{"Reviews": [{"Title": "Awesome compactness, feature set and price, but flimsy", "Author": "D. Rushby", "ReviewID": "RJ9IM3B6HS8O5", "Overall": "3.0", "Content": "This camera is exceptionally compact.  Place a credit card on top of it, and only a tiny area of the camera is visible around the edges.  Incredible!I'm a point-n-shoot photographer, and the only complaint I have about the image quality is mild red-eye.The image stabilization feature is amazing.  With image stabilization enabled, I've taken one-handed pictures while driving down a mountain road with the other hand, and their clarity has turned out remarkably well.  Photos of text taken  in dim lighting conditions with deliberately shaking hands also turn out well.  Image stabilization is quite remarkable.I also found the menus well designed and the in-camera review features excellent.  For example, one can zoom in on a particular area of a photo, right on the camera's LCD screen.  That's very helpful for culling photos without first loading them onto a PC.Battery life with the included lithium ion battery is fabulous--far longer than the other digital cameras I've used.This camera begs to be kept in a pocket and whipped out on the spur of the moment, with image stabilization counteracting haste to deliver good picture quality.  Unfortunately, the physical construction is not rugged enough to endure that kind of use.  The flimsiness is exemplified by the \"door\" covering the USB port, which consists of nothing more than a rubber pad attached via a thin rubber stalk that will undoubtedly break after a few hundred uses.Apparently, the lack of durability extends to the internals as well.  I accidentally dropped this camera a modest 30 inches onto a plastic chair mat on a wooden floor, and now its picture quality is terminally damaged.  The camera massively overexposes everything, and can no longer focus properly.  If I'd dropped the camera from a standing position onto concrete, I could excuse this failure.  But a drop from a sitting position onto a chair mat, when the lens didn't impact anything on the way down, should have been survivable.Since the camera is now useless, I tried dropping it several more times from the same position to see how it would fare.  Even though neither the lens nor its housing ever came into contact with anything, they became stuck in a partially open position after the third drop, and the lens housing now feels wobbly.So:  5 stars for compactness, features, and price.  2 stars for durability.", "Date": "October 17, 2006"}, {"Title": "Excellent so far", "Author": "A. Liu \"college student\"", "ReviewID": "R1XQW2N0HO8ICJ", "Overall": "5.0", "Content": "So when I bought this I noticed that there was no reviews on Amazon for it. I was looking for a small camera that was around 5 MP, had at least 3x optical zoom, and had rechargeable batteries. I was actually going to buy one of those Casio Exilims. But I noticed this camera in a Best Buy advertisement and it was about $50 cheaper than the cheapest Exilim. But like I said, there were no reviews so I was a little anxious about buying this. However, because I had my mind set on buying an Exilim, and this had all the same features it seemed but was so much cheaper, I decided that this was a steal and went with it.Ok so it came yesterday, finally, and here are my first impressions. The first thing I noticed was how small it was. I thought it would be a little bigger, but small is good. It is pretty much the size of a pack of cards. The case is all metal, not painted plastic. The construction of the camera seems to be pretty solid (not cheap). So far, the pictures I have taken seem pretty sharp. I have a have problem which is that I keep on taking blurry photos, but I think that is my fault. Like the camera has a clever system where if you press the trigger down halfway, it focuses, and only when you press it down all the way it takes the picture. The picture taking speed is pretty fast--hardly any delay, which is something I was worried about. The rechargeable battery seems pretty good so far. When I popped it in without charging it, it never ran out. Later on I charged it up (which is good for Li-on batteries apparently) and that took a while, which is the only drawback. However, since I have charged it, the battery meter hasn't shown any decrease.So this camera has been everything I wanted so far, and for $50 less. I'm very pleased with it.Hmm what else... the camera has a bunch of settings, but I end up using \"AUTO\" for everything because the settings dont seem to make a difference. After you install the software that comes with the camera, you can access the camera like any USB drive from your pc (using the USB cable of course). You have to install the software first though.Some notes:When I first ordered it, Amazon had this little thing like \"buy this with an SD picture card and save!!\" or something, so I did. But DON'T do that! It's a trap! This camera doesn't use SD memory, it uses xD memory, which is different. So I had to cancel the memory and order the correct one seperately.Secondly, if you're going to buy this, don't pay for shipping! I paid like $6 for shipping, but used the free shipping on the memory, and they both arrived on the SAME day! Needless to say, shipping is a total rip off. So don't pay for shipping.Oh yea, and this is my first camera I have ever owned. Like I said, I'm pleased with it. I would totally recommend this camera to anyone, simply because of the quality you get for the price.", "Date": "September 29, 2006"}, {"Title": "Ok, but...", "Author": "Marcy Hogan", "ReviewID": "R1CLFFBQRVSSPH", "Overall": "3.0", "Content": "I bought this camera for my birthday.  I had another Olympus that worked well, but I wanted something that was slimmer, and that took better pictures at low light.Now, the Olympus fe190 is definitely nice and slim-- it fits into a small clutch purse for going out, and that's great.This camera also takes beautiful pictures of landscapes and the outdoors, and of people and things in good natural light.HOWEVER pictures taken indoors with flash are very much hit-or-miss.  I've gotten some very cute pictures with friends and family, and others where the picture quality just... sucked.  The picture looks washed out, not sharp, and just... not good.  Some of these would have been great shots of people and I was very disappointed when I viewed the pictures on my computer and discovered the poor quality.Also, the flash seems to give everyone really bad red eyes.  When I've tried to use the anti-red eye flash it hasn't seemed to really help.I'm so frustrated by this that I'm now debating spending another $200+ to buy a different camera, as I'm tired of great pictures getting ruined by a sub=par camera.  Maybe I just don't know how to use the best settings to maximize pictures, but it also shouldn't be this hard to figure out.", "Date": "February 11, 2007"}, {"Title": "I got burned on this one", "Author": "C. M. Hartman", "ReviewID": "R2GVF50MWLNGWV", "Overall": "1.0", "Content": "I got this about 2 months ago, used it a couple of times and just took it with on vacation with me. The pictures are no where close to being 6mp quality. I have another Olympus 4MP form 4 years ago and it blows this one away on picture quality. I would say the pictures look like they where taken with a 2MP camera.I just called Olympus for help and the tech mentioned that this model has generated lots of calls and there is nothing they can do to sharpen the quality. They got me over to customer service where they said if I would \"surrender\" my FE-190 to Olympus they would sell me a FE-200 at a discounted price of $226. The FE-190 can be purchase on Amazon for $50 less without trading my FE-190 in. NO WAY is this an acceptable option.This is not a good value.", "Date": "December 11, 2006"}, {"Title": "Very Convenient, Image Quality could be better", "Author": "Jo Gusto", "ReviewID": "RXKT6GIJJUP9Q", "Overall": "4.0", "Content": "This is a great little purse cam, which is what my wife uses it for. We have had Olympus compacts since the C-3030, and I have to say this one is the most \"stylish\" and convenient... built in lens cover, very small size, great large viewfinder, etc.My only gripe: image quality. While the image quality is passable for snapshots and so forth, upon enlargement one can see a significant amount of fringing and chromatic aberration. Our previous model, the C-50, has fewer megapixels and takes better photos, ones that will withstand some enlargement.Overall, it's fine for what it is, a very inexpensive pocket shooter. I actually wanted to give my wife the Nikon S7c because it had the large LCD and very good image quality, but alas it wasn't available -- also the WiFi feature seemed \"sexy\" and she would have loved that gadgety feature.I settled on this Olympus after also looking closely at the Pentax Optio S7, which, at almost $100 more than the FE-190, took pictures which were (IMO) no better...", "Date": "January 3, 2007"}, {"Title": "Love it!", "Author": "T. Chatelain", "ReviewID": "R29UOIC00NP6PQ", "Overall": "5.0", "Content": "Despite what other reviewers have said, I haven't had any of those troubles yet with my Olympus FE-190.  The images turn out great, the camera is easy to use, and I'm very happy with my purchase.  It's compact size is also a huge benefit and the battery life is great.  I haven't really had it run out on me yet.  It does have a lot of features and different shooting modes, but I haven't really explored those too much.  It's a great camera for a casual photo taker.  Also, on the 2nd to best photo quality (high quality 2816x2112) and with a 256 mB xD card, it can store over 170 pictures.  I recommend it!", "Date": "November 11, 2006"}, {"Title": "Excellent little camera!", "Author": "Jusher", "ReviewID": "R302DUP33PC3ME", "Overall": "5.0", "Content": "If you are looking for a camera to pop in your pocket with a large 2.5\" viewing screen and easy to use, this is the camera for you!  This camera takes incredible pictures.  Priced just right for 6 Megapixels.  The FE-190's image stabilation is great for someone with shaky hands. Olympus is our favorite brand of camera.  We have another Olympus digital that is larger - with greater zoom capability and we love it but it is very bulky to take to the beach, park or hike.  We will be using this camera much more than our larger Olympus.", "Date": "January 11, 2007"}, {"Title": "Great Deal for the Money!", "Author": "A. Perretto \"mandygirl\"", "ReviewID": "R1X3PPYFVKA8PP", "Overall": "4.0", "Content": "I purchased this camera for my boyfriend's birthday back in november and he loves it! Its slim and packed with all the different settings you could want. I compared the price listed on the website to that of my local electronics store and u cant beat it...6MP for under $200 and the trusted name brand of olympus makes it a great buy!!! I even bought one for myself!!! ooo and the delay time in between taking pictures is not long at all (better then most cameras i've used)", "Date": "December 17, 2006"}, {"Title": "Very affordable and high-quality camera", "Author": null, "ReviewID": "RM64BS26LSU5H", "Overall": "5.0", "Content": "I bought this camera a month ago, and it has been a great purchase.  It was affordable and offers a lot of quality and features for the price.  I have no had any of the problems that other reviewers have had, but I will mention that there can be minor problems with red-eye.  This seems to be very easy to edit out with basic software.  I highly recommend this camera for the easy use, slim design, and the long-lasting battery.  I've only had to charge it once.", "Date": "December 14, 2006"}, {"Title": "Please don't purchase!!!", "Author": "simplicity718 \"Simplicity718\"", "ReviewID": "R2KEM9WMKZMA5C", "Overall": "1.0", "Content": "I bought the Olympus fe-190 6mp today, and I'm returning it tommorrow!! The camera is cute and compact but the pictures really SUCK!!! Im was very dissappointed in this Olympus product. Make sure you do your research beore making your purchase read those reviews they are worth it trust me!!!!", "Date": "July 18, 2007"}, {"Title": "Image quality is horrible", "Author": "stlulu", "ReviewID": "R77OQ1AO2DYJK", "Overall": "1.0", "Content": "I own an old Olympus D-490 which takes excellent pictures in resolution 1600x1200, so I decided to replace it with a newer model of the same brand.  What a disappointment.  All pictures taken indoors really suck, even with flash.  Don't waste your money on this camera.  I sent it to repair under warranty and it was returned without being serviced \"no trouble found\" so it seems this is a problem with the model not with my camera.", "Date": "July 12, 2007"}, {"Title": "Horrible.", "Author": "Mule \"Jesus is Lord\"", "ReviewID": "R2PW7BGQEETNMW", "Overall": "1.0", "Content": "Admittedly, I use expensive DSLRs and have come to expect quite a lot from my cameras. Having said this, I started out with Point and Shoot cameras long ago, so I have experience with cameras representing the spectrum of quality. This camera simply gives the worst images of any camera I have ever used, including much older compact point and shoots, in both 35mm and digital format.Pros: It is very, very small and slim. It is easy to always have a camera with you, as this fits easily into a pocket and you won't even know that it's there. It is also well-built, with a metal body and clean construction; the only plastic parts are the battery door-cover and the thread insert for a tripod screw on the bottom. If you own Photo Shop and are proficient with it, you might be able to save some of the shots you'll get with this camera.Cons: Horrible images are rendered by this camera. It will produce images that some folks will be happy with, but to me, most of the images are simply unacceptable. It has built in image stabilization, but it is not true optical IS, but rather \"digital IS\"; this means that when you turn on the image stabilization mode, the camera automatically makes the ISO higher, (makes the camera much more sensitive to light), resulting in a faster shutter speed, which increases the chances that the picture-taking process will be done with before you can move and blur the shot; however, this produces horrible 'noise' in the photograph. By the way, there are NO manual settings on this camera, not even white balance settings! Therefore, there is little you can do about the noise, or about any other common problems. The camera is also slow; slow in every way. Shutter lag is noticeable, write time is slow, as is the time between images when reviewing captures. Pictures taken outside in natural light are easily the best; you can almost forget decent captures indoors with this, as there is no way to adjust WB. The flash is just about useless as well.I have to admit that I was very disappointed in this camera; I've had several small Olympus point and shoot cameras over the years, and while they certainly weren't in the same class as SLRs, which they're not meant to be, they were so much better than this late offering as to offer no comparison.Do yourself a favor and spend a few dollars more and get yourself a Canon if you need a compact camera in this class. You'll be glad that you did.", "Date": "May 12, 2007"}, {"Title": "Good product", "Author": null, "ReviewID": "R2IP9HC6SJAYDS", "Overall": "4.0", "Content": "i got this camera for my birthday and it works great, the pictures turn out good and i like it how you can put the different settings for action shots and stuff. you can record movies, which is a huge plus. It was very easy to learn how to use. The down side is that it sucks the life out of your batterys, but I use it a lot and the movies do not have sound on it. Also it was kind of confusing up loading the pictures on my computer, but with the directions and a help of a friend anyone can do it.", "Date": "November 23, 2006"}, {"Title": "Poor Durability, and poor customer service", "Author": "C. Stevenson \"Tina S.\"", "ReviewID": "R2DDI1UD70KRYY", "Overall": "2.0", "Content": "I was given this camera as a Christmas gift last year.  It took good quality photos at the time(not the best at enlargement but good for computer use, and 5x7 photo prints), it was compact, and easily portable.  At Thanksgiving this year (So about 11 months after I received it), I took it down off the shelf to take photos, but all of the photos had horizontal lines through them.  I switched the battery, tried new memory, and it was still having problems.  I searched online and found that I definitely wasn't the only one.I called olympus and they told me that it was under warranty, but they could only give me a warranty repair if I provided the original purchase receipt or credit statement.  I told them that I got it as a gift, and they told me that I needed to go to the person who gave me the gift, and get a receipt from them, or a statement.  I went to the person who gave me the gift, and they no longer had the receipt (of course), and had canceled the credit card that they had bought it with.  They called the CC company, and they would send him a mailed statement but it would take 2-4 weeks to recieve, and then even if he priority mailed it to me, it would take another 3-5 days to get that, *and* there was no guarantee that Olympus would take it, because multiple items were purchased in that transaction at his local Best Buy.  By the point that I got the statement, the camera would be out of warranty.  I'm really frustrated with Olympus because of the lack of customer support, and the lack of durability with the camera.", "Date": "December 30, 2007"}, {"Title": "Amazing pictures!", "Author": "Amy C. Eley", "ReviewID": "RYU75RBNDT3G9", "Overall": "5.0", "Content": "I have taken really great pictures with this camera! It is super slim and small and can be taken anywhere. I love the image stabilization feature, because most digital camera's I have come across, blur when shooting action shots. Not this camera. I absolutely love it!", "Date": "October 3, 2007"}, {"Title": "Purchaser", "Author": "Roy H. Whipp \"Roy Whipp\"", "ReviewID": "R3F0JX5KRWD4H8", "Overall": "4.0", "Content": "This was taken to Venezuela.So far the user there is happy.I saw photos and they were good.It is small.Roy Whipp", "Date": "July 22, 2007"}, {"Title": "not very impressive , ok product", "Author": "P. Patil", "ReviewID": "R1G5J79P6YN9R1", "Overall": "3.0", "Content": "its good but nothing specialno issure with the working", "Date": "April 19, 2007"}, {"Title": "Not that good", "Author": "Gadget Man \"JT\"", "ReviewID": "R2PE8R830MOUW6", "Overall": "1.0", "Content": "The first one only lasted Two Days! Only used once other time in the next month, the next time I tried to use it on vacation that month it was dead again. The battery door is too week to keep the battery down against the spring and in contact with the contacts. Unless you keep pushing on the door the camera is dead. The camera has nice features but not if it doesn't turn on.", "Date": "April 4, 2007"}, {"Title": "Wonderful camera - but it fritzed out within 3 days", "Author": "Stillman B. Brown", "ReviewID": "RCD7N084M4R3S", "Overall": "2.0", "Content": "I researched several cameras in this price range before buying the Olympus, and was extremely happy with it - until it ceased to function properly (a heavy gold tint to every picture, with horizontal bars across the image) after three days, just as I was beginning to shoot a 50th birthday party for my best friend.  I don't feel comfortable buying another, as  obviously I have a better chance of getting another lemon.  I'll be getting a bulkier but hopefully more durable Canon.", "Date": "October 8, 2006"}, {"Title": "excellent", "Author": "wayne", "ReviewID": "R1CV97NKNG8LL3", "Overall": "5.0", "Content": "i use this at work to take basic pictures of jobs in progress, being in construction this camera is very durable and lasts well especially considering what i put it through", "Date": "May 12, 2013"}, {"Title": "Best camera EVER!", "Author": "putasmileon", "ReviewID": "RWBM38UQVPZ9", "Overall": "5.0", "Content": "I've had this camera for 5 years and it has always taken amazing pictures! It's really easy to use and very idiot-proof!battery life is exceptional it lasts for a long time. The \"auto\" setting sometimes makes blurry pictures so normally i use the \"anti-shake\" setting and it produces great quality pictures! I'd recommend this camera to any and everyone!", "Date": "September 9, 2010"}, {"Title": "Good, but not great", "Author": "K. Campbell", "ReviewID": "R1KZV3H8Y9BW3P", "Overall": "4.0", "Content": "Very portable, reasonable battery life, takes good pictures with some limitations. It does not do well in low light conditions (indoors, clubs, etc.) and it is slow even in 'action' mode. This makes taking family pictures difficult.", "Date": "January 22, 2010"}, {"Title": "Wasn't Worth the Money", "Author": "L. Coleman \"Geek Girl\"", "ReviewID": "R3GXJOUHGZ9VY", "Overall": "3.0", "Content": "I bought this camera two years ago and only used it for special occasions and it is already broke.  The picture quality is just decent and the battery doesn't last that long.  It has never lasted that long.  The camera no longer takes pictures even after replacing the lithium battery, charging it, changing the memory card etc.  I paid over $170.00 for this camera at the time and it wasn't worth it.  I would save your money especially since there are much better cameras on the market today!", "Date": "November 1, 2009"}, {"Title": "Never again", "Author": "Ernesto J. Zambrano", "ReviewID": "R2NWS6HX4AGPK7", "Overall": "1.0", "Content": "Really bad experience. The product did not come with the charger and usb cable either. And a after spent some money buying the accesories the camara stop working. I sent an email to the seller and he offered to reimburse me 50% of the cost. It was an insult to me. Well, never again with this seller.", "Date": "August 20, 2009"}, {"Title": "Great size and weight. Inferior pictures.", "Author": "DrHickenlocher", "ReviewID": "R2R2SU4CDXRDQA", "Overall": "2.0", "Content": "I'll preface this by saying I pretty much just take pictures on Auto. I'm not one to mess around with all the functions as a camera neophyte. I loved the size. Very thin and would fit into my jeans pockets easily. BUT... My mom got the Canon SD630. We went on vacation together, took identical pictures half the time, and the image quality was just SOOOO much better with the Canon. I ditched the Olympus and bought a SD750 later on, and I'm much happier with the focus, color, clarity, and especially low-light shots. Maybe you could do something with the different settings, but for a novice shooting Auto-Olympus vs Auto-Canon, pay the extra money and get the Canon.", "Date": "May 21, 2009"}, {"Title": "good starter, but fragile", "Author": "selina kyle \"s. kyle\"", "ReviewID": "R20TNPHI4P7IM0", "Overall": "4.0", "Content": "My previous experiences with Olympus 35mm (film) point and shoots were that they were durable and took great pictures.  One point and shoot I have I've dropped hard once or twice, and it's still good to go.With that said, I did realize you can't bang around digital cameras, so I treated this camera with kid gloves, always keeping it in a hard case unless I had it in my hand to take pictures.Even with the best care, though, it is not unexpected that you may drop it. I dropped it for the first time since I bought it three years ago from a height of about 18 inches onto thin carpet, lens retracted, and now the lens is out of alignment and would require a $120 repair to fix it.  I guess I'm naive to wonder how it is a retracted lens gets knocked out of alignment.Yes, I dropped it, but I still was very surprised it couldn't survive this relatively minor impact.  Apparently, as it damages relatively easily, I will specifically look for a camera that can handle rougher treatment, just in case.Another thing worth mentioning is that when taking pictures with flash, it can have an irritatingly long lapse between when you press the button and when it finally takes the picture, a good 3 or 4 seconds. That can make all of the difference as to whether or not you get the shot.  If it's an action shot, forget about it.Regarding pictures taken in low light, with or without flash, seem to either come out blurry, or terribly harsh and high contrast.  Seems to take its best pictures outside during the day.If it wasn't broken, I wouldn't be compelled to get a different camera, but now that I have to get a new one, I won't be getting another one of these.", "Date": "May 2, 2009"}, {"Title": "Camera", "Author": "Micaela Johnson \"Mikki24\"", "ReviewID": "R12T9ZY6QRWQDI", "Overall": "5.0", "Content": "Great, camera, easy to use, video feature is wonderful. Takes numerous images which are easy to review and organize.", "Date": "December 26, 2007"}, {"Title": "God Awful", "Author": "B. Roy \"RoyTech\"", "ReviewID": "R2FFMKKIJWPKCU", "Overall": "1.0", "Content": "This product lasted in my hands for exactly 8 hrs before I paid restocking fees to get it back in the hands of the retailer from whom I bought it.Normally - I check reviews and picture quality on the web before spending my hard earned money. However, I had some faith in Olympus - all of their camera's I had purchased earlier gave me sharp pictures with good color. I also needed a slim/small camera that would stay in my bag at all times and this one seemed to fit the bill.Those people giving it five stars are not seeing the pictures at 100% enlargement. When you do - you'll find edge sharpness to be so bad - its like you are not wearing your glasses. Trees look like masses of green. Same pictures with a similarly sized Lumix are tack sharp. No - it was not the camera I purchased - Olympus simply cut corners and gave this camera a bad lens. What good is a camera if the pictures are fuzzy? I am very surprised at Olympus for releasing such a poor product.The difference between this and a similar sized Lumix from Panasonic is astonishing. I am considering the Lumix now - since my luck with Canon has also not been too good.", "Date": "June 6, 2007"}, {"Title": "good camera, not amazing", "Author": "A. Durden", "ReviewID": "R10JGXDT9NDG27", "Overall": "4.0", "Content": "i bought this camera for my birthday. this is a great little camera, small, thin, and lightweight with a large screen. it is an excellent choice if you just want a good camera for taking pictures of friends and family, but not at all if you want great quality pictures. the picture quality is okay. so far i have had no problems with it. however, it doesn't have some nice features such as a viewfinder (helpful on sunny days)or settings such as black and white. it does have a macro but it doesn't seem to work very well, there is a difference, but not that much. but overall i am very happy with my purchase, however, it is a little overpriced for its quality, but just by a little. there might be better quality cameras for the same price range. but it really is a nice little camera.", "Date": "June 3, 2007"}, {"Title": "Great Camera, Just What I was looking for....", "Author": null, "ReviewID": "R13037TORF1Q5J", "Overall": "5.0", "Content": "I saw this camera in Target for $200. I came home and looked it up on amazon and it was only $150.This is a great camera for anyone. It is thin and light so it can fit in your purse. Also its images are very clear. I was taking a picture in a pitch black room and on a certain mode it made the room look like it was bright.This is an excellent camera for the inexpensive price.", "Date": "February 24, 2007"}, {"Title": "Nice size - too fragile", "Author": "Kieu", "ReviewID": "R1DR631BCK0UO8", "Overall": "2.0", "Content": "When i got the camera, I was looking for one that would be a nice small size to fit in my purse so i could take it everywhere. It's great and compact and all.. but i dropped it once and now it has problems. It sometimes shuts itself off with the shutter still out. It takes a lot longer to save and view pictures now. I always had canon cameras before and they survived multiple drops before showing any problems.The good things though... the camera seems to have a pretty good battery life. I was concerned with the big lcd and no regular viewfinder, but i don't have problems with the battery. The pictures are ok, but low light images don't look very good a lot of the time. the image stabilization is a nice feature that i do use often though.", "Date": "January 4, 2007"}, {"Title": "Olympus FE-190 6MP Digital Camera with Digital Image Stabilized 3x Optical Zoom", "Author": "Ruben M. Barnard", "ReviewID": "R3HAJJBZPFMEB2", "Overall": "5.0", "Content": "I bought this for my daughter. And now want one for myself.Takes great Pics.", "Date": "May 13, 2007"}, {"Title": "Great camera at a great price", "Author": "J. contreras", "ReviewID": "R3TJIN6CW5MTK", "Overall": "5.0", "Content": "I got my camera quick and easy, I would purchase from them again.", "Date": "March 25, 2007"}, {"Title": "so sorry I bought this one", "Author": "MaddieP", "ReviewID": "R2YI5P8CU80PWD", "Overall": "2.0", "Content": "This camera's size is perfect.  However, the pictures it takes sure aren't.  I have changed the quality of the pictures too and it really doesn't make a difference.  If you use the zoom, the picture quality is horrible.  Even if you don't use the zoom, the picture quality is not as good as my old large Fugi 2 megapix. camera.", "Date": "January 4, 2007"}, {"Title": "Blurry pictures...", "Author": "Mark Twain", "ReviewID": "RG57YQQD4JE6Y", "Overall": "2.0", "Content": "If you are looking for blurry photos, this is the camera for you!  I loved the price and the size but come on!  My 8 year old Canon powershot (3 megs) make MUCH sharper pictures than this camera.  Do not buy this camera.  Took it back, got a Casio Exilim EX Z600, very, very happy.  I'm not some big photo guy, Christmas, vacation, that kind of thing, was looking for a small digital camera.  Thought, what the hey, they have had to gotten better after 8 years, this one hasn't.  Was very disappointed.  If you do buy this camera, make sure you get it somewhere with a good return policy because I think you might be using it......", "Date": "October 22, 2006"}, {"Title": "Don't buy this camera", "Author": "Linda H. Tillman", "ReviewID": "R1BWC6T5RMOKU9", "Overall": "1.0", "Content": "I just sent back the second Olympus FE 190 digital camera because both of them had a defective view screen.  The vendor I bought it from has come to the conclusion that the store received a defective shipment, since they order the product, and then send it out without opening the sealed carton - and since I got two in a row with the same problem, they figure the entire shipment was probably bad.  The Vendor, J&R; Music Store, was very nice and apologetic for my difficulties - and I have no problem with them - but I would not recommend that anybody buy this camera from any store at all through the mail.", "Date": "May 13, 2007"}, {"Title": "I love this camera!!!!!!!!!!!!!!!!!!!", "Author": null, "ReviewID": "R34CCNFKBMTM27", "Overall": "5.0", "Content": "I love this camera! It is the bestest camera ever in like the history of ever! I love it and it loves me. I wuz so excited to get it, and when i got it, it was so cool and dudely. Thank-you olmpus! I love my camera! When i got my camera i said, \"Oh my gosh Becky! I can't believe i got it!\" It was a coolisosio moment.Ham wuz here!", "Date": "December 14, 2006"}, {"Title": "Olympus FE-190", "Author": "WSUS \"WSUS\"", "ReviewID": "R3UP5NP7SWR4J2", "Overall": "1.0", "Content": "Very poor image quality at wide angleVery poor image (noise) at low light levelsCrashes at random intervalsFew usefull settings", "Date": "October 22, 2006"}, {"Title": "FE-190 With No Battery", "Author": "Peter K. Adler", "ReviewID": "R1ED5PR8T8RWWS", "Overall": "1.0", "Content": "I ordered the Olympus FE-190 through Amazon with the merchant being Adorama of NYC.The camera shipped promptly, however, the FE-190 shipped with no battery.  I called Andorama.  Sorry, Customer service closes at 4:30 p.m. ET.  I called the order desk.  They simply cut me off.While true, I did get a good price it is not worth the hassle they give you. There must be something wrong when the sales line is open for 10 hours a day, but the customer Service line is only open  for 8 hours per day.  Never again.", "Date": "February 14, 2007"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000H7ECI2"}}