{"Reviews": [{"Title": "A pocket camera for people who appreciate photography", "Author": "PhotoGraphics", "ReviewID": "R26QKOBSFGY429", "Overall": "5.0", "Content": "I have been giving less and less credibility to the so-called digital camera reviewing websites lately as digital cameras get past the gee-whiz-gadget stage and become true instruments of photography.  The review sites are ok when they talk about their interpretations of published specs but they leave me cold when it comes to how good a digital camera is at making a memorable photograph.  Yes, things like start-up time, internal memory capacity, and battery life are good to know because if a camera scores really badly on certain specs it can become a chore to use. But how well a digital camera helps create a photograph is still the most important thing that needs to be considered.I have preached the mantra that \"more megapixels doesn't mean a better picture\" for years and I still believe it, but I also believe that some of the newer high megapixel cameras are also now giving us better lenses and processors, which are the two main things that make one digital camera better than another.  And I've resisted getting suckered into the hype about some manufacturers putting exotic-sounding names on their lenses.  All that really means is that they paid to license the lens name, it doesn't mean each lens is hand made in the Black Forest by old bearded craftsmen.The same review sites mentioned above seem to kiss the feet of anything with the name Canon on it to the point of putting their independent review status in severe jeopardy.  Yes, Canon makes some good cameras but they really don't have any more real experience in the business than most other DIGITAL brands and in my estimation they consistently fall just slightly short of the mark.  Yeah, most people buy them, but then again most people eat at McDonalds.So what do I think is the very best all around consumer digital camera on the market regardless of price?  To me it's the Nikon D70S - priced right, near perfect design, and slightly more accurate at capturing images than the Canon counterpart.  But I don't want to lug a huge camera and a bag of lenses around with me all the time, that's why I was so excited when high-quality pocket-size digital cameras were invented, so I could leave my old Nikon SLR on the shelf and be prepared to make good photographs wherever I happened to go.Since I put the old film cameras into semi-retirement, I have had digital cameras from Panasonic, Canon, Olympus and HP and they were all adequate but suffered from that \"chore\" syndrome mentioned above with their horrendous shutter lag, dismal startup time and wretched battery life.  This time around I wanted a camera I could truly carry in my pants pocket, yet has a good (no make that great) lens, excellent battery life, as many manual features as I could get in a tiny package, and something that didn't feel like a plastic toy.I considered Panasonic Lumix, Canon, Nikon and Sony.  The other brands I looked at had some good stuff but didn't seem to fill my desire for a true photographer's quality instrument.  Sony got booted off the list fairly fast.  They are such a fine company, why can't they make a camera that actually takes a great picture?I am intrigued by Lumix, the quality of the pictures seems first-class, I love the image stabilizer, and they are very feature-rich, but most of the pocket-size models feel just a little cheesy.  Canon makes pocket cameras that take good pictures, but I feel Canon is resting on their reputation instead of trying to build a product that's worth the asking price.And Nikon would have come in a strong second, just missing first place because of weak ergonomics.  I never seriously considered Casio, ok maybe for a watch or calculator, but I asked myself what they would know about photography.  Turns out they know a lot.  They've actually been making digital cameras longer than almost anyone, and when it comes to the right buttons in the right place they are geniuses.  I'll go further than that, the whole concept of the Exilim EX-Z750 is genius.  It you total up all it offers I would have to give it the honor of being the only perfect pocket-size digital camera on the market.As soon as I touched on I was impressed by its quality.  It feels like it's machined out of block of solid aluminum (its not).  The controls give you nearly everything you will every want using buttons that make sense and don't require you to go many levels deep in the menu.  I love the HUGE 2.5\" LCD screen but no LCD screen is fully useful in direct sunlight no matter what anyone says, so Casio thoughtfully brought back the optical viewfinder.It seems 9 out of 10 reviewers who mention the optical viewfinder say they hate it because it's so tiny.  Who cares?  It's there when you need it, and it's sharp and clear.  If it makes the difference between getting a priceless picture or missing it, I'll take a tiny viewfinder instead of none anytime.The EX-Z750 starts up and is ready to shoot by the time I get my finger from the off/on switch to the shutter release.  Can't be any faster than that.  I have still not found any instance where shutter lag has caused me to miss what I wanted to capture, in other words there really isn't any shutter lag in real life.Rather than go into every detail of the camera, I'll mention a few of the biggest high points that sets this camera apart from every other one in the category.1. The EX-Z750 remembers the zoom position when you turn it off and back on again.  I have dreamt of a feature like this!  There are so many times I have had the camera all set up and had to turn it off to wait for something to be ready, only to have to turn a camera back on and make several readjustments.  With the EX-Z750 I can turn it back on and EVERYTHING is set exactly the way I left it.2. Some cameras have some limited function to remember other favorite settings, the EX-Z750 seems to have the ability to remember nearly everything without having to commit it to a special \"favorites\" position on a switch or dial.  So if I like -1 saturation (and this camera is slightly oversaturated in its default position) I can leave it at -1 forever.3. You can turn the camera on and off with the on/off switch, or you can turn it on and off using the \"record\" \"play\" buttons to go directly to that mode.  How cool is that?4. The EX button makes it possible to very quickly adjust four of the most important shooting parameters without ever going into the menu mode.5. The movie mode is incredible, and offers several unique features including a unique pre-movie that's already recording before you push the record button ... kinda like the way TIVO works ... it's weird and insanely brilliant.  After seeing the quality I wonder who in their right mind would lug along a camcorder no matter how small it is on those trips to Disneyland when the EX-Z750 can take outstanding still pictures AND decent video in a camera you can hide in the palm of your hand.6. Live RGB histogram?  On a camera the size of a deck of cards (smaller actually)?  WOW!7. Battery life is one of the best in the industry.8. 30 scene modes!  Yeah I know I said I wanted something to take professional quality photographs and I wanted manual overrides, but sometimes you don't want to spend 10 minutes setting the camera like when the sun is setting in 30 seconds.  I can't believe how versatile the scene modes are.Last but not least, the picture quality is shocking.  I compared two pictures taken at the same time of the same scene with the EX-Z750 and the $1300 Nikon D70S.  I showed them side-by-side to several people who should have been able to tell the difference.  Nobody could.The negative side?  Slight oversaturation as it comes out of the box.  For snapshots it may help most people make a blah picture look a little more exciting.  For someone more critical, just set the new default to -1 and you've got yourself a low-price, pocket-size D70S.  To the reviewers who can't figure that out, get over it and go get a job at McDonalds.The other small negative is that I love panorama assist.  I take a lot of panorama pictures and I can't figure out how Casio missed putting in this one obvious feature.  Must be some fear they have of absolute total perfection ;-) I rate the Casio EX-Z750 a 10 out of 10Footnote:  I've had the EX-Z50 for a week now.  I've taken it on a trip and taken a variety of photographs and even submitted a few to be judged.  The sharpness of the lens on this little pocket camera is unbelievable.  The realism of colors is uncanny.  Overall I can say photographs taken with this camera are so far beyond my expectations I would call them thrilling.  I'm still going to buy a digital SLR but I'm in less of a hurry now that I see what I can do with my pocketable Casio.", "Date": "May 21, 2005"}, {"Title": "Class-leading design; problematic quality control", "Author": "Joseph Madden", "ReviewID": "R240FQY4JZMTHN", "Overall": "4.0", "Content": "As other reviewers have already noted, the EX-Z750 is nearly unbeatable in terms of its design and feature set. It is the only subcompact camera to offer such a comprehensive amount of control in such a small package. However, my experience indicates some troubling quality control issues that potential buyers should be aware of. First, however, pros and cons of the camera.Pros:--Excellent battery life.--Excellent menu system and ergonomics.--Very, very fast and responsive both in playback and record modes.--Small size, all-metal construction.--Included docking station.--Good movie mode.--Large LCD screen.--Good flash performance.Cons:--Default saturation is really too high. I suggest setting it to -1 in the menu. Even with this corrected, though, I tend to prefer the colors produced by Canon and Fuji. That, however, is a personal preference.--Images are slightly noisy. (Not enough to mar reasonably-sized prints, however)--The zoom has relatively few steps between wide-angle and telephoto. Not a big problem, certainly not an uncommon one in point-and-shoot digitals.Having said that, however, I should mention that my unit was defective. The autofocus system missed consistently (If I had to guess, I'd say that 75% of the shots were blown). Also, mine had a completely bizarre sensor problem; the images were blocky and pixelated even at full resolution and full quality, appearing as though they were of much lower resolution. I took these images to my local camera store and had this impression confirmed.Anyway, it turns out that I am not alone, especially with the autofocus problems. A not-inconsiderable number of users have been reporting problems with the autofocus system, optical problems with their lenses, and another troubling mechanical problem that I'll explain below. (For these discussions, head over to dpreview.com, select \"Forums\" on the left, followed by \"Casio Talk\")The troubling mechanical problem I mentioned earlier is this: If the camera is ever accidentally powered on while the lens barrel is obstructed, you will probably receive a \"Lens error\" message. To my understanding, this situation can also damage or break the autofocus motor. It seems like common sense not to turn it on while it's in the case, but accidents happen to the best of us (and other models do not seem nearly as susceptible to this problem). The Casio's easy-to-press raised power button makes accidental power-on more likely; so does the ability to turn the camera on with the \"Record\" and \"Playback\" mode buttons (also raised) on the back of the camera. This behavior can be disabled through the menu system; I recommend doing so.In conclusion, then, the EX-Z750 is endowed with a nearly unbeatable combination of design, features, and image quality at this price point. And despite the problems that I mentioned, realize that all consumer electronics have a reasonable rate of failure. Nonetheless, my impression (both from my personal experience and from the anecdotal evidence I've gathered from the forums) is that this might not be the most trustworthy and reliable camera around.If you decide to go with the Z750, shoot a LOT of pictures when you receive yours. Shoot some houses on your street; definitely shoot some portraits. Put the camera through its paces in the first couple of days, then examine all the images at actual size on your computer screen and make sure that the focus is accurate and that the resolution and detail is all there. Especially when dealing with third-party merchants who sometimes have VERY short return/exchange periods (mine required getting it postmarked for return within seven days of receipt), it is important for you to establish that your camera is working well right off the bat. And, again, make sure to disable the power-on function for the record and playback buttons on the back of the body.Some other models you may want to consider in the same (roughly) size/price range:--Fuji F10. Terrific noise control, very fast-operating camera. A little bigger than the Casio and short on manual controls, but endowed with good battery life, beautiful 6.3MP images, and Fuji's (to my eye) excellent image quality. It has some downsides, too; be sure to read up on it.--Canon SD500. A very popular choice-watch out for fragile LCD screens, though. Limited manual controls. Many have reported breakages that Canon will not cover under warranty.--Sony DSC-P150. I'm not too familiar with it, but it is favorably reviewed.Lastly, make sure that you really need a camera this small. There is something to be said for the way that a larger camera feels in the hand, and there are plenty of attractive super-zoom models for similar prices as these point-and-shoots. Making things smaller always entails some kind of compromise. However, the good news is that these small point-and-shoots (in my opinion, particularly the Fuji) deliver outstanding images on par with much larger and much more expensive cameras. Just make sure that your particular camera's optics and focusing systems are delivering the results you expect.My four-star rating for this camera combines impressions of my actual experience with the expected image quality of a non-defective unit. I gave it four stars instead of five because of reliability concerns and slight image problems (too-high saturation, noise levels, good but not great color rendition, in my opinion).", "Date": "June 9, 2005"}, {"Title": "Something else to consider....", "Author": "S. Yang", "ReviewID": "R3T7RN8CY3TDII", "Overall": "5.0", "Content": "I've researched and debated on buying a camera in this class for a couple months and my choices were the Casio Z750, Casio s500, Casio s600, Canon SD450, and the Canon SD550. Lots of great reviews for all these cameras, and all seemed to have their pros and cons. In the end, it came down to the Z750 and the SD550 (wanted to go for the 7 megapixels because my wife really likes to do stuff with photoshop and print large layouts of pictures).I'm not a photographer, just the average person who likes to take pictures at social events and vacations, and wants a good camera that I easily take with me in my pocket. I can't really tell the difference that a lot of reviewers talk about in image quality, and frankly I don't really care about purple fringing, softness, contrast, saturation, blah blah blah...as long as the picture looks good to me and takes me back to the moment then I'm happy. Therefore the images produced by both the Z750 and SD550 (and the others as well) were all good enough for me.Here's the dealbreaker that led me to buying the Z750 over either of the Canon's...SPEED. I've read just about every review out there and although they talk about how fast this camera is, they don't really relay just how much faster this camera is when you simply push the button. I'm the guy who's on vacation who will bother a stranger to take a picture of me and my wife or friends, and I can't tell you how many times we've had to tell these strangers how they need to hold the button down halfway, let the camera focus first, then push it all the way down. Only for them to not understand or not be able to do this. Then we end up getting crappy shots or have to ask someone else who looks younger and more in tune with today's digital cameras. I'm sure a lot of you know what I'm talking about. So a major concern of mine when selecting a new camera was the ability to hand the camera to anyone walking along the street and let them simply push a button and take my picture. Here is where the Z750 sealed the deal for me.I went to a couple of stores, turned on each camera, pointed at something in the store and pushed the little button to get a picture. The Canons (both SD450 and SD550) wouldn't take the picture, and I ran into the same \"hold the button down halfway\" problem. Even though they were quick to focus once I held the button down halfway and quick to take the picture once I fully pressed, neither would take a picture if I simply pushed the button all the way. On the other hand, all the Casio's took a picture immediately. They all have extremely quick autofocuses and in combination with this, if your finger is too quick for the autofocus there's a quick-shutter option that will allow the camera to bypass the focus and still take the picture. Some reviews say the autofocus is so fast that it's hard to even get to the quick shutter phase, and some say that the quick shutter sort of guesses on a focus and takes the picture based on this guess. I don't really know what to believe, but what I do know is that either way when I just press the little button, I get great looking pictures.So if you're like me and need a camera that will take a good picture while handing it over to a stranger , then the Z750 is the better choice. If you're the only person who's going to handle your camera and know all the ins-and-outs of digital photography, you'll probably have a much tougher decision.", "Date": "December 14, 2005"}, {"Title": "Good Camera but the Lens-Error problem is a design flaw", "Author": "Greg \"systems guru\"", "ReviewID": "R2BT5QEQ3G9QHS", "Overall": "3.0", "Content": "The lens error problem is real. It is a design flaw (in my opinion as a Electrical Engineer). I experienced the problem about 10 minutes from opening the box.The sensitivity to go into the lens error failure mode is too high. Any pressure (even the slightest) on the lens at opening will shut the camera down w/error. After that, each time you try to power up the camera it will keep displaying the lens error and power down immediately. The only way to get it working again is to re-apply very slight pressure to the lens. I know this is counter intuitive and in fact scary, especially on a new camera w/warranty disclaimers on power lens failure due to the blockage / abuse. It may take several trys. You may even hear a ratcheting sound from the lens. But it works !If necessary, you can recalibrate the autofocus by zooming in / out completely.Turn off the digital zoom. It seemed to aggravate the probability of the lens error problem when zooming the lens in and out - specifically when switching (crossing over) to/from digital zoom mode. Digital Zoom doesn't really help anyway.The case also has a padded insert causing the case to be way too tight - remove the padded insert !Out of the box the unit powers on in multiple ways. This can cause inadvertant power up w/lens blocked. Turn off those power up options.Double check the picture mode each time you start taking pictures - the dial tends to rotate when handling the camera out of the case.", "Date": "September 17, 2005"}, {"Title": "Why still looking for more?", "Author": "Juan Sanchez \"Juan\"", "ReviewID": "R3NKFVML1R9EW2", "Overall": "5.0", "Content": "Hi all. First of all, I must say the main idea of this comment. THIS IS A DIGITAL CAMERA... AND ITS MAIN FUNCTION IS TAKING PHOTOS.I bought this camera a couple of months ago, after a very deep research, investigation and comparissons. The first thing I was looking for, was a good resolution and high quality photos. Then I wanted a big LCD screen and of course, good image stabilization. After that, the size of the camera was very important, memory and storage features and then, price and brand.When I saw this camera for the first time, I got very interested with its 7.2 megapixeles. When I took some trial photos (when I had already bought it, of course) the results where amazing. Its 3x optical zoom is just enough if you have modes to take huge photos (fixed to be printed in a A3 paper). So, my first conclusion was: If I don't have the 5x or 10x of optical zoom that other cameras offer... I can select the biggest printing size for my photos and equal that quality. it's not dissapointing at all, I swear.Then, I read carefully about the different modes it has to fix images according to light conditions. You can easily go from a sunset landscape to a fireworks scene, from a backlight picture to a night portrait... and it really works well. And you get it, just selecting the auto-configured modes. One trick I always do is (if I'm in doubt about which mode to use) taking trial photos with the possible modes, and then compare them (the huge 2.5\" LCD screen is very helpful here). The result is the perfect photo, the best flash setting, contrast and white balance. Simply awesome. I almost forgot, if you take an action scene with the standard mode, you get a great picture too (this camera has an almost instant photo taking from the time you press the buttom).After those photo features, I found a very friendly menu. it's really easy to change settings and modes. You can do it from the complete menu, or the wonderful quick access buttom to edit or modify the most common settings for a fast configuration. You also have to buttoms to switch between the play mode and the camera itself. Then, you have a very friendly and easy to understand menu and structure.Another outstanding feature of this camera is the use of SD cards. This cards are widely used in many other devices as PDAs, cell phones, other brand cameras, whatever. This is not as the nasty and \"exclusive\" Sony's Memory Sticks, so, you won't have to buy many memory storage cards for each device you have (but you'll have if you have a Sony). Its LCD screen is simply wonderful, a great colour display and even the digital zoom (8x) is a helpful tool.Then... and finally... the video feature. This camera has 3 basic video modes. The first one, and the most common in other cameras is a poor video quality (320 x 240) which can be used for quick videos to be sent by Email. As I said at the beginning of this review, you're buying a photo camera, not a video recorder. But, this is your like day... If you use this camera's best movie quality mode (640 x 480) you'll get really GREAT and enjoyable videos. I went to Las Vegas for a holiday week and I spent a complete day taking videos with my camera. The quality is incredible for a photo camera (for both, images and sound) which can easily be played in a 15 inches screen without losing resolution. It's really cool.For video editing, this camera comes with a CD containing an editing software to brun a VCD or DVD file, so you can enjoy in both two ways of your videos. Of course, you have the .mpg and .avi files.So, my conclusion: This is the best camera I've ever had, about its price... I think it's fair, you have the best photo camera and a pretty cool video recorder (but, be sure of buying a 512 MB or more SD card to storage lots of video).", "Date": "November 4, 2005"}, {"Title": "A well-designed, compact camera with some limitations", "Author": "Douglas A. Greenberg", "ReviewID": "R1QO4JI3FP88", "Overall": "4.0", "Content": "This is a very attractive walkaround mini-camera that will suffice to get those \"grab shots\" you might otherwise miss. It's small, ergonomically well thought out, and has surprisingly good battery life. The generous digital sensor of 7.2 megapixels makes it possible to get good enlargements up to 8 x 10, or even larger. The camera includes a number of specialized functions and settings that are helpful in particular situations such as night portraits, sunsets, etc.It also features some useful functions that a lot of other small digicams lack, such as detailed exposure information via a very intricate histogram, plus in-camera resizing, which is very useful in preparing photos for web presentations or email.Another fine set of features is its video functions. By setting the control dial you can take mini-videos that when viewed on a computer screen are actually quite satisfactory and fun. Don't think, however, that these small-sized images will compete with videos taken with a real video camera.However, this camera is not without shortcomings. Like many users, I have been frustrated at times when for no apparent reason the camera locks and indicates \"lens error,\" forcing me to retract the lens and start the preparation process again. I've missed more than a view potentially good photos because of this.It should also be noted that the much-ballyooed \"manual functions\" are exceedingly limited. In \"manual mode\" you can choose between TWO similarly wide aperture settings, whoopee. There is, however, a more full range of manual shutter speed settings.I also have noticed that despite the large size of the digital sensor (and hence the image files), the actual lens quality is, frankly, so-so. The quality of images produced by another small digicam I own, the much-criticized Contax U4R (equipped with a superb Zeiss lens), is actually superior, despite the considerably smaller sensor size (4.0 mp).Images taken with the Casio EX-Z750  can be improved through judicious (downward) adjustment of the color saturation setting and through skillful use of post-processing functions, but the truth is that the raw images are not really all that great.The tiny optical viewfinder is certainly controversial. It's not completely useless, but the truth is that it provides a highly cropped version of what actually appears in the image.  Consequently, when using it (which is sometimes a good idea when the ambient lighting is very strong and hence the LCD is hard to see), one has to engage in a mental calculation of what full-sized finished image will actually result.Finally: it's nice to have a 3X zoom, but the lens on the Casio does not allow for stepless adjustment in focal length. Instead, there are several fixed settings to which the lens will move by default. Sometimes this is frustrating, if what one really wants is \"in between\" the available settings.People may complain about the high noise level at ISO 200 and up, but this is actually pretty standard for tiny digicams, so this doesn't bother me.Overall, this is a nicely designed little camera and an excellent buy, once you accept the camera's limitations.", "Date": "October 2, 2005"}, {"Title": "Great Technological Marvel!", "Author": "E. Burgos", "ReviewID": "RVY7M98ZRLWSB", "Overall": "5.0", "Content": "Pros: Movie mode, easy to use, compact, great battery life!Cons: Included software is not great. Can't convert to Casio's M4S2 video format (MPEG-4 codec)Question: What great name brands do you think of when you hear \"digital cameras\"?  Certainly Kodak, Sony, Canon, Olympus... but Casio?  I didn't even know Casio made digital cameras until I bought this camera!In early May 2005, I was looking into purchasing my first digital mini camcorder from Panasonic. In fact, I had already ordered it when I came across this gem. I immediately returned the camcorder and ordered this camera.The video quality is awesome at HQ mode 640 x 480 30 fps. Yes, it may not be as good as DV quality but who really wants to work with DV or mini-DV tapes (the whole concept seems so primitive). Anyway, working with SD cards is so much faster and easier. A 1GB SD card can store over 30 minutes of video at its highest setting, and twice that amount at its standard setting. So, I went ahead and purchased a 2GB to give me over an hour of high quality video recording.Along with its digital video features, I also got a 7.2 megapixels digital camera which has now officially replaced my Sony P52. This camera is easier, faster, slimmer than my Sony and I love the quality of the pictures. I also love that I can actually put it in my shirt pocket and take it anywhere.In addition, I like the dock station since I have it plugged next to my TV and watch the videos and pictures on my TV. And yes, you can transfer pictures and videos via a card reader which most people already have (so you don't need the dock to transfer videos and pictures if you have a card reader for your PC).At eBay I purchased an extra battery charger and battery for about $25 and those generic brands work just as well (just type \"NP-40 battery\").  Amazon also sells the generic NP-40 battery for less than $14.00 vs $39-$49 for the Casio brand.The only drawback has been the M4S2 video MPEG-4 codec that Casio used. Some video editors can't read the format without a video conversion.  Ulead VideoStudio 9 and Adobe Premiere Elements reads M4S2 codec without any trouble.Likewise, it would have been great if Casio had included a video converter (like Panasonic's MediaStage and MovieStage software) so that you can transfer your PC videos or edited videos back to the camera for easy viewing on its whopping 2.5\" screen or TV. In fact, if this was possible, the Casio EX-Z750 could even become a portable video player as well (a la Archos or Creative Zen Player).  I understand that AVS Media and VideoCharge will be working and updating their software to convert to M4S2 format. I can't wait!Overall, this is a great digital camera and mini video recorder for a great price! Casio is going to make a lot of money on this camera and will become well respected for its digital cameras.... and rightly so!", "Date": "May 16, 2005"}, {"Title": "joined the casio LENS ERROR club", "Author": "S. Skelly", "ReviewID": "R1X1YASAY2ZQ7E", "Overall": "4.0", "Content": "it's seriously a wonderful camera. the design and build quality of this thing is amazing. i've been digital (i think) longer than most and seen many cameras down the line and the pictures obtained from those cameras. more often than not, the Z-750 just blows me away. the results typically range from excellent to stunning. i love this thing.for two months, it worked flawlessly. now i get the lens error. it happens at least 2-3 times a day. the message most often appears when using the camera - although sometimes happens shortly after booting up.i really hope there's a fix soon as the z-750 doesn't deserve the bad press it's lately been getting. seems like a firmware issue to me.", "Date": "October 5, 2005"}, {"Title": "BEST Ultracompact camera!", "Author": "Momojojo", "ReviewID": "R20FIY9K6S9RN0", "Overall": "5.0", "Content": "I was in search for the perfect digital camera and have gone through about 8 to 10 digital camera in the past 4 years, and Casio Z750 is the one. I started out with Canon PowerShot S40, it took pretty good pics but was big and heavy like a brick. Got a Canon S110 but auto focus was slow, then Canon SD230, Canon SD450, That's when I started to notice that images produced from Canon digital camera has a certain softness to it, I don't know how to explain it, the images got good color and looks clear but it just doesn't standout as much, and doesn't look as crisp and sharp as it should be...Also, Canon cameras has a tendency to capture dust specs in the images, meaning if you use the flash, the flash would get reflected or bounced back from the dust spec and you would get multiple round transparent ball of light in your images, and for some odd reason this only happens to Canon cameras. Anyhow, due to all those reason I have stopped getting Canon and would never buy another Canon again. My next camera was Pentax S3 (images were sharp but too much artifacts), then Panasonic FZ5 (camera was too big to be carrying around all the time), Sony T7(camera was too small and light which makes it hard to hold it stable), Sony W1(took great pictures but a bit bulky to leave in the pocket). After all these cameras I realized the camera I need to look for was an ultra compact. Why? Because I want to take spontaneous pictures when-ever and where-ever, while not strapping the camera around my neck, or the need to carry a man-purse just for the camera. If you want to take wonderful professional pictures and like fiddling with the camera setting, then your best bet is a Digital SLR. Mid-sized & Ultra-Zoom camera are for those people that want a SLR but can't afford it. But for all other occasions ultra compact is the way to go. One thing you need to know about ALL Ultra compact camera is that there are trade offs for the size. Ultra compact camera have limited flash rang and a high potential to take blurry pictures if you don't have steady hands (they are so light and small, if you press the shuttle too hard it will shake the camera and thus blurring the picture). But would you rather have spontaneous pictures even though some might be blurry or no pictures at all?I personally think the Casio Z750 is the perfect weight and size for an ultra compact which can be held steady enough that it minimizes blurry pictures. (If you are getting lots of blurry pictures, its not the camera, its YOU! And no matter which camera you buy or exchange it with you will still get blurry pictures, but the bigger the camera the easier it is to hold it steady and the less blurry pictures you will get.)This casio also got the best battery life out of all ultra compacts. The images are super sharp and crisp under the correct lighting and it produced the best images out of all the digicams I've used. (color saturation is higher than normal but that can be fixed within the menu to your personal liking) Since the flash rang is short it can not shoot good pictures in dark room where the subject is too far away, but this is true for all ultra compacts. The Casio z750 also uses SD media. One thing I hate about Sony is their use of MemoryStick. They are more expensive and only Sony uses it. Olympus also uses a proprietary format (XD or something). I prefer having one type of media that I can use across board with all my electronics and wouldn't cost me a fortune. SD memory is just more versatile, cheaper and wide-spread. Casio z750 also got lots of manual control option, that is great but its something I'll probably never use since it's got about 23+ scenes that you can choose from which already optimize the setting to take the best picture. All in all this is the best ultra compact camera as of Feb 2006.", "Date": "February 24, 2006"}, {"Title": "Casio brings it all together", "Author": "sonnojoi \"sonnojoi\"", "ReviewID": "R7OKR8DY3VWTY", "Overall": "5.0", "Content": "This is a terrific camera, and I'm picky.  I've returned two cameras (the Nikon S1 and Casio's own Ex-Z50) before getting this one and I think I'm finally sold.  The video is probably the best available on a small camera, the pictures are good, the battery life is fantastic.  It's very quick and responsive.  The screen is big but not the best, because it's highly reflective in sunlight, but the tiny optical viewfinder is good enough for pointing the camera at what you're aiming at.  The flash is weak, but the red eye prevention flash works pretty well.  What really sets this camera apart is the video, especially the past movie mode which starts recording 5 seconds *before* you hit the shutter, which is great for taping sports.  The other thing that puts this camera above the Canon SD500 (aside from the better price) is that there is a manual mode for setting shutter speed and something called aperture priority.  CNET.com, Steve's digicams, and other review sites say that this level of manual control is extraordinary in a compact digital camera.  I look forward to learning how to use them.You'll need a large memory card, I'll give you the numbers the camera gives me with a 1gig card:All pictures are taken at best quality.7 megapixels = 220 pictures5 megapixels = 4313 megapixels = 5502 megapixels = 854640x480 (VGA) = 4721Movie at High Quality = 34 minutesMovie at normal 640x480 = 1 hour, 4 and a half minutesMovie at 320x240 = 3 hours and 4 minutesAudio Recording = 50 hours and 41 minutesBoth normal and HQ video mode are 640x480 and 30 fps, so I'm not sure what the difference is that makes HQ files twice as big.  Less compression I guess.", "Date": "July 8, 2005"}, {"Title": "Tiny and Powerful", "Author": "William Thomas", "ReviewID": "RHRO2HGDGGH7H", "Overall": "5.0", "Content": "I bought this camera after reading several positive reviews, and I'm very happy I did. I wanted a camera that was (1) small, (2) fast, (3) takes decent pictures, and (4) a decent price. This camera meets all four criteria, and I couldn't be happier. It's a great everyday snapshot camera.- Very easy to use interface. I was up and running in minutes. Plus, it remembers settings after turning it off!- Shutter lag is VERY minimal, and the recovery time between shots is pretty quick.- Focuses very quickly.- Battery life is great. I took the camera on a weekend trip, took over 200 photos, and the battery meter was still showing full.- The video is very clear. Using \"Past Movie\" mode, you can aim the camera, and when you press the button to record it will actually begin the recording from 5 seconds in the past! (Just record what counts!)", "Date": "March 8, 2006"}, {"Title": "Too bad 6 stars isn't allowed!", "Author": "Keith M. Anderson", "ReviewID": "R112FSELE6DKS5", "Overall": "5.0", "Content": "I really can't imagine anyone not giving this 5 stars.  Casio has been a quiet leader in small, high qualily, high megapixel point-and-shoot digitals.  What Casio does, Cannon (etc) follows.  Casio pioneered the SUPER large LCD display, user-friendly and intuitive controls, all metal body, and a compact size.  This latest version is no exception, and is a huge improvement over previous versions.But maybe you don't care about how cool Casio is and you just want to hear why this is worth your money.  Well, there are SO many reasons to buy this camera, its tough to fit it all in.First, this camera has all the convenience you want from a point and shoot, including fast focusing, good auto light metering, and several photo options that allow the cameras artificial intelligence to take beautiful pictures in any situation.  But it also goes almost totally manual, so you can select your own aperature, ISO, and shutter speed if you want.Second, the camera takes pictures fast.  Most point and shoot's are limited by processor speed, so they don't snap the photo the second you press the button.  This camera has one of the shortest lags you can get at this price point.  That's a big deal to me, since I often photograph dogs or kids, that move around so fast you can't afford to have photo lag.Next, the 7.2 MP is hard to beat at this price point, and you'll see the difference in the images.  My wife and I have upgraded from the 3.2MP to the 5.1MP to the 7.2MP, and with each upgrade, we've been thrilled.  You can easily blow images up to 8x10 or 16x20 with this camera, it's just that good.Next, the flash and the options for color balancing are improved on this model, so you can take photos in near darkness and the flash illuminates EVERYTHING at a reasonable distance, and increased control over color balance, brightness, etc, allow you to choose anything between enhanced color to low contrast to extra bright reds, or anything you want.Next, the movie feature is greatly improved.  We snap movies that fill up our 1GB SD card, and the quality of the audio and the video is almost comparable to our friends $800 digital camcorder.  No joke, its really that good.Finally, to summarize, I think this camera is the best value on the point-and-shoot market, as well as being the highest quality camera you can get at this level.  I also have a Canon Digital Rebel XT, which cost $1300 with the lens, and there are plenty of times I would prefer the Casio to my higher end camera.My only complaint with the Casio is that the conversion of images to JPG format isn't that efficient, so the size of images, on the highest quality setting, is about 4MB/img, which is pretty high.  As a comparison, an 8.2MP image on my Canon is about 2MB.I think you'd be down right stupid to buy another camera.  This one is THE BOMB!!!!!!!!!!!", "Date": "April 20, 2006"}, {"Title": "Great Pictures & easy to use", "Author": "Cards B. Good \"Credit Warrior\"", "ReviewID": "R2NTP8B3JKXU4D", "Overall": "5.0", "Content": "I took a long..... time before I purchased this camera. Looked at all of the competition - even the SLR's. Everytime I pick up this baby I am remimded of all of the reasons I selected it. BIG screen, great focus, loads of options. Having the 7.2mp allows me to give the camera to my wife and get a great shot. She doesn't always frame the picture well, but with this many pixels, you can blow it up, crop, crop, crop and end up with a great picture. One recomendation. when you get the camera - take a couple of days and learn all of the options for setting lighting, lens speed, etc. It can make a big difference in the quality of pictures. Yes, it has a best shot function, but the more you can help - by setting portrait vs landscape - indoor  lighting vs daylight will only help the results.ONE complaint - this camera can only work with the docking station. There is no recharging cord. So when you travel - you take the docking station with you or get backup battery pack. This solution works depending upon how long the trip is. I hope Casio will reconsider their product engineering and next time consider the road warrior.Summary: It has consistently given me great pictures. Small form factor is great for carrying the camera all of the time. Great value for the money. Would buy it again. I have owned it 6 months - shot thousands of pictures. Buy a high speed SD card for video. It does that well too!", "Date": "May 16, 2006"}, {"Title": "Impressive to say the least", "Author": "G. Kwiatkowski", "ReviewID": "R1LYQL5ZEWV29I", "Overall": "5.0", "Content": "When i was debating what digital camera to get for my trip to Mexico for five months i debated between the Casio sd450 and Fuji Finepix Z1 and this camera.  I am very glad that I chose the Casio.  I was a little worried about the brand, but after much research I realized that their quality is just as good as Canon and this camera has many more manual controls to ensure that you get the best shot.One of my photographer friends (who uses a Canon 20d DSLR) was very impressed with all the options on this pocket sized camera - simply the best out there.  One little feature that I personally enjoy a lot is the shoot timer.  You can set it so that it will take the pic after 10 secs, but then takes 2 additional pics about 2 seconds apart so you get 3 shots total to chose between.  This saves on the time to get everyone together for a group shot - a great feature.  I cannot think of anything that I do not like about this camera - just be sure to disable the auto-on when the play button is pushed so the lens doesn't shoot out while in your pocket, damaging the mechanics.", "Date": "December 31, 2005"}, {"Title": "Excellent Camera (except for the LENS ERROR messages)", "Author": "Mike W. Miller", "ReviewID": "R1QMID5H3ZQ1YU", "Overall": "4.0", "Content": "Others have said most of the key things about why this camera should be an unqualified 5-star recommendation, so I won't repeat comments on great battery life, very fast start-up, virtually no shutter lag, stunning pictures, or unexpectedly good movie mode.What I will tell you about is the problem that, from what I've read on various message boards including the widely respected on on DPReview, is happening to a fair number of people.A not-insubstantial number of people are reporting that their Casio has started (a) giving \"LENS ERROR\" messages a good percentage of the time when they start up and (b) they are unable to get a focused picture when the camera does start up correctly.  For me, it was after about one month and 500 pictures that it started happening.First, although I've not yet tried to do this, I read that Casio is replacing these lens sets and/or cameras.  However, if this starts happening to you, THERE IS A DECENT WORK AROUND.Once you get the camera to start up without a \"LENS ERROR\" message, zoom out to the limit of the optical zoom (the vertical red line on the zoom level indicator) and then back in to the home position.  That should \"reset\" the camera's idea of where the lens is, and you'll now be able to take an in-focus picture.  See?  The little focus rectangle now turns green when you push halfway down instead of red.  You're good until you shut the camera off... next startup you'll have to do the same thing.", "Date": "July 14, 2005"}, {"Title": "MAC Compatability NO PROBLEM!", "Author": "nonlinearize", "ReviewID": "R18WQ4G4IDEA6L", "Overall": "5.0", "Content": "Stupidly, Casio initially failed to provide support for movie playback on Macs --which was possibly the single detractor from this otherwise remarkable and reasonably-priced camera.The problem is this: The Exilim encodes video in .avi format, which is not readily supported by Quicktime and other applications on Mac.The problem was first solved by an open source developer who created a simple patch. With this patch I've never experienced ANY problems with Quicktime, iMovie HD or any other Mac application when working with movies created with the Exilim Z-750.Apparently, Casio has finally released an official patch. Get details and all relevant links here:[...]ALSO: The Infamous Lens Error has posed no real problem.  In 6 months of use I've seen the message twice.  When message occurred, pressing very gently on the lens housing causes it to retract and the camera to turn off.  When turned on again, there was no further issue.That said, this camera is Highly Recommended!!", "Date": "February 10, 2006"}, {"Title": "Great camera but very delicate lcd screen prone to breaking", "Author": "Stuart", "ReviewID": "R3A2C47A1EM7V2", "Overall": "4.0", "Content": "I agree with most of the comments on camera performance for the Exilim. It offers a great combination of size, simplicity, automation, manual control and picture quality.BUTThe LCD screen is extremely delicate and is not covered by the warranty. My 2 week old camera was in the Casio leather bag in my computer bag on a flight back from Hawaii. When I got back home the LCD screen had cracked. Casio would not cover replacement under warranty and charged me $175 for the repair.My final assessment is that while this is a great camera, it is impractical to use as the LCD is not structurally sound. You have to carry it around and cannot place it in a pocket or other carrying bag without the risk of breaking the screen. If you are tempted to purchase this camera ask yourself \"Do you want to pay an additional $175 every time the LCD cracks?\"", "Date": "August 19, 2005"}, {"Title": "Best camera I've ever used!", "Author": "Dustin Hoffman \"Technology Firm President\"", "ReviewID": "R1AY66Q51MO5ZY", "Overall": "5.0", "Content": "Having been involved with technology for almost 2 decades, and as the president of an IT firm, I've used my share of digital cameras. I've primarily used Sony still digital cameras, both in a work environment and for personal use. Let me also say that until I was persuaded by my brother-in-law (who is a graphic artist), I always associated \"Casio\" with \"cheap watches\".The Exilim EX-Z750 has totally changed my mind. It's simply the best camera I've EVER used.This camera has blow me away in several areas. The \"shutter lag\" (the delay between pressing the \"take picture\" button and the camera actually snapping a shot) is basically non-existent. My wife's non-digital Elph isn't as fast as this camera. Frankly, I've always hated digital cameras for having a terrible amount of shutter lag. Often, when trying to take a picure of my young daughter, whatever cute thing she was doing was long over by the time the digital camera captured the moment. It's incredibly frustrating. This camera works as fast as you do (unlike the Sony Cybershots I've used).Likewise is the \"recycle time\" (the time between taking one shot and the camera being ready to take another). The camera is ready again almost as fast as I can snap shots. You simply won't notice the recycle time on this camera.Who doesn't love the ENORMOUS SCREEN?! It's HUGE. It takes up 3/4 of the back side of the camera. I've also found the controls and on-screen menus very intuitive (yes - I'm one of those guys that doesn't read the manual unless I have to). I do think the screen is a tiny bit grainy, but the images themselves are perfect.The color of the images is fantastic, much better than the Sony's I've used in the past, including recent models. They print beautifully without me having to tinker with the color. They also appear to me to be less grainy than the other cameras I've used, although this is admittedly hard to quantify.According to my brother-in-law, this camera also provides complete manual control over basically everything (f-stop, color or white balance, and all that non-sense). I can't really comment on this too much - I'm an \"auto focus\" kinda guy. :)Last but not least, the camera's movie taking ability if AWESOME. I'm taking 640x480 30fps MPEG4 movies in brilliant color. On my 1 GB SD card, I can take probably 34 minutes of video or ~225 best quality highest-resolution still images.If you haven't figured it out, I absolutely LOVE this camera. It's TINY, beautiful, and takes perfect shots (even for me, and auto-focus kinda guy). If you can get past the \"Casio stigma\", you're going to fall in love with this camera. My family even got one for grandpa.My accessory suggestions: get a screen protector for the big beautiful screen, a case (it doesn't come with one), and a 1 GB memory card. They are very inexpensive on eBay - I got mine for about $52.", "Date": "July 24, 2005"}, {"Title": "Great Shots to Go", "Author": "Mobil'Homme", "ReviewID": "R1FIEJCXDW18ZM", "Overall": "4.0", "Content": "I bought this camera because it has a great range of manual features, including the ability to take up to 60-second exposures (I like night shots). As I've gotten comfortable using it, my photos have gotten better and better. See for yourself: [...]But, the best thing about this is: it's comfortable to stick in your pocket and lets you take excellent photos when something strikes your fancy. With a mini tripod, this thing is a wow-your-friends dynamo.I love it and only have one caveat: the case is aluminum, so DON'T drop it. That said, having dropped it from four feet onto cement, bending and denting the case, I was able to effect the repair myself and am now really impressed that none of the workings were damaged. Wish they made an iSkin for this camera (or that its case was polycarbonate).", "Date": "November 17, 2005"}, {"Title": "Truly awesome camera but......", "Author": "Richard C. Franklin \"zerobytes\"", "ReviewID": "R2I6XHUMR0ATVV", "Overall": "4.0", "Content": "Bought this camera for it's size, image quality, price, manual controls, and video modes.  On all accounts I have been supremely impressed.  If you are a snapshooter interested in playing around with some manual controls then this has everything you are looking for.  BUT...I do have a few issues.Pros:. small, smaller, and smallest - fits any pocket. Great movie mode with lots of shooting time - you still get a little flicker though, don't expect DV quality.. good manual control set. good picture quality. fast and responsive shootingCons:. Limited F-stop capablities. Over-saturated picture (red, green, and blue pop right off the page in sometimes unnatural hues.  Then again you might like that). Still tough to find MPEG-4 supported editing software and the bundled Casio software will only burn VCD (unless you want to pay more $$$ for a DVD upgrade). 2.5 inch screen is gorgeous, but fragile.  Mine cracked after owning the camera for only two months of conservative usage - just outside my 30 day warranty and the casio warranty reads as follows: \"The customer shall NOT have any claim under this warranty for repair or adjustment expenses if...problem caused by broken display or key.\"  The flat rate to fix the screen is $257.95.  Most places, including casio, will just try and sell you a new camera.Bottom line, the camera is truly awesome for the price - I researched all of the above qualities for many different cameras and I was most impressed with this camera's performance - even over the similar Canon models.  Your choice though - just don't drop it!", "Date": "August 22, 2005"}, {"Title": "Wonderful Camera, Great Customer Service", "Author": "Ann Arbor doc \"Rx\"", "ReviewID": "R1RVSWCCB9MZ6L", "Overall": "5.0", "Content": "I spent a weekend researching digital cameras, exhausting and confusing, so many to choose from,  and when I was in a store looking at various cameras, a customer just started telling me how much he loved this camera he had just bought, which was this one; I assumed it was 'a sign'. And it was. Small size is fantastic, put in your shirt pocket or purse, almost weightless. Quick shutter takes the best pictures of new  baby grandchild of any camera anyone in the family has used. (others had Sony and Canon digital cameras) The movies are excellent.  The quality and color of images are perfect, not too over-digitized as some have said. Everyone in the family thinks I'm a wonderful photographer, but it's not me, it's this camera.  The battery life is really long, and it can take good pictures in multiple types of poor visibility situations. In the first month, I dropped it a few  times, once on the sidewalk and it survived which was impressive. Having a viewfinder is a big advantage in bright sunlight.After using and loving it for 9 months, the telephoto froze.  I sent it back to Casio, and they fixed it; it took 3-4 weeks, which is a little long, but did not charge me for the repair.The baby pictures are fantastic, especially because it takes the picture so fast, and the scenery pics all look like National Geographic.", "Date": "May 21, 2006"}, {"Title": "Small Package with Big Results", "Author": "Rocky Rhoads \"Retired\"", "ReviewID": "R4GTXQJ2K6TFH", "Overall": "5.0", "Content": "I recommend purchasing a camera case.  It's a bit fragile if you will drop it on the floor.  Stable shots for shakey hands!Outstanding quality and you do not need to be a professional photographer.  Easy to learn and a lot of functions.  I recommend reading the instructions manual.  This camera does it all.  This I would say is the sleeper of digital cameras.Great price and nice and small but not too small.You will love this one!  I gave my sony away.  The Macro is excellant for close up with great details.  You can shoot manual or auto.  Movie and select best picture mode.  Nice big LCD screen.  A must to own!", "Date": "April 26, 2006"}, {"Title": "Great camera design, questionable quality?", "Author": "Jeff Patterson", "ReviewID": "RT959DYC8XA06", "Overall": "4.0", "Content": "Grrr, I just had to send back my EX-Z750 for exchange - the lens didn't reliably  retract.  It's a shame such a great-featured camera can get out of the factory with such an obvious defect - when I first used it, the lens failed to retract about 50% of the time... after a week it improved but still failed 3 times in a full day's use.  It really makes me question Casio's quality control processes.I've noticed a couple of disappointing things about the images as well... there's some graininess or color mottling in pictures taken in low-to-medium light, more so than I noticed in my older Canon S410... and I see some very noticeable chromatic aberration (tinges of red and blue at off-center high-contrast edges), again more so than on my Canon S410.And yet, this camera is still way too cool to pass up - the near-instant start-up time and no shutter lag are such a joy after the agonizingly slow battery-demolishing Canons - I'm hoping my replacement will work properly lens-wise and maybe have less of an aberration problem.Oh - the videos and sound are *incredible* - they even dampen the zoom motor in movie mode so it's inaudible (albeit a little slower).  With a large memory card, this can totally obsolete the old Handicam - a 1 Gig card will hold 34 minutes of 480x640 video at 30fps, and display it right to your TV.  Truly cool & works great.", "Date": "September 17, 2005"}, {"Title": "Lens Error is safety mech. LCD covered by hard plastic", "Author": "Luke N. Zankich", "ReviewID": "R3RWMCFAVMCKOK", "Overall": "5.0", "Content": "The lens error issue is a safety mechanism so the camera will not be damaged!  Sometimes the camera is damaged due to the lense extending, but most of the time this stops the camera from being damaged, and the camera works fine after a lense error.As to the LCD breaking.  You would have to drop it! It is covered by thick hard scratch resistant plastic.  There is no way it could break in your pocket or bag.This camera is awesome!  I have used and replaced several small P&S; cameras that did not take good pictures. (Sony P200 for instance always gives blurred photos due to 1/40s shutter in flash).", "Date": "September 23, 2005"}, {"Title": "Beware LCD Problems", "Author": "R. D. Hunter", "ReviewID": "R8VB54VTKHBQP", "Overall": "2.0", "Content": "Got this camera and two days later the LCD failed.  We had to fight like heck with the retailer (not Amazon) to take the thing back.  I did some research and apparently this camera has two quality control problems.  1.  The LCD and 2. Lens Error problems.It appears from others that Casio does not stand behind the LCD.  We know we did nothing that would have caused the LCD to fail. We hadn't had the unit long enough to do anything that might make it fail.Otherwise, it's a neat little camera.  I just hope our 2nd unit lasts longer than the first.", "Date": "August 27, 2005"}, {"Title": "Digital Photography's Review (http://www.dpreview.com/reviews/casioz750/page9.asp)", "Author": "M. Luu \"sciolist\"", "ReviewID": "RW0FX9DW4E26E", "Overall": "4.0", "Content": "Given that the majority of ultra-compact 7 megapixel cameras share the same CCD sensor, have similar lenses and processors, and have enough pixels that any small differences in resolution and noise will only be visible when you produce big enlargements, it is perhaps unsurprising that they produce very similar results when printed at 'normal' sizes. Where the differences do show is in areas such as exposure, color and dynamic range, and often choosing between one model and another comes down to little more than personal taste. Handling, design and 'add on' features are also important when attempting to choose one model over another, and in this latter area the EX-Z750 is a clear winner.It's a surprisingly rewarding camera that manages to squeeze a lot of features into its tiny body, and - just as importantly - makes using the wealth of controls and features as easy as possible given the lack of surface area for extensive external buttons or switches. It's fast, easy to use, and reliable, with very few focus or exposure problems (save for the occasional metering error in scenes with lots of contrast or large areas of sky). In the final assessment the EX-Z750 has a bigger feature set than any of its pocket-sized competitors and has a very impressive movie mode with some pretty advanced options thrown in for good measure.On the downside there are only two serious problems - the ludicrously over-processed appearance of shots taken at the default settings (something you can at least fix by tweaking the sharpness, contrast and saturation) and - more seriously - the woefully underpowered flash. Pocket cameras like this are used in social situations requiring flash, making the poor performance all the more unfortunate. So, if you want a camera that allows you true control in a very compact body, there can be no other choice, and if you rarely use flash you'll find little to complain about. In fact I'm going to stick my neck out here and - even with the underpowered flash - put my money on the Casio EX-Z750 as the best ultra-compact 7 megapixel on the market today for the serious photographer. Perfect? No. Very impressive? Certainly.", "Date": "August 15, 2005"}, {"Title": "Great unit for the price - performs well", "Author": "Mr. Paul M. Morgan \"Paul\"", "ReviewID": "ROQ6RI3YKERX0", "Overall": "4.0", "Content": "I replaced a Canon Elph 3.2mp with this camera and have not regretted it.Aside from the fact it come with a whopping 7.2mpx, the screen display is a great size (although the resolution of the screen is a touch low). It's easy to start using, the controls are pretty good and the setup straightforward.To quick start is pretty straightforward - you can either go with the \"best shot\" option where the camera will help you for the conditions you are in e.g. Portrait, Scenery, Soft Focus,  Sundown & Night Scene (i believe there are 25 of these).If you're a bit of a budding pro, you can alter functions like ISO etc. but I haven't played around with those yet.Video is also possible - mpg4 (640x480) and seems to do a good job both for video and audio. Battery life seems decent too, as does build quality. Check that you have a later model, as apparently the earlier models are plagued with barrel failure. Also recommend getting a 1gb SD card - they're cheap enough.My only comlplaint is that to download the pictures you need to house the camera in the cradle that comes with it - and it's a  USB1.1 I believe, although the transfer rate was fine. Would have been nice for a bigger zoom that 3x but you can't have everything... where would you put it?Overall a great camera for people from the casual photographer to those looking for a bit more flexibility in a compact camera.", "Date": "March 2, 2006"}, {"Title": "Agree that this is the best ultra compact.", "Author": "another_Amazonion \"Alvin\"", "ReviewID": "R3I7O5SYYT3ZP7", "Overall": "5.0", "Content": "Myself have also done many researches on those digital camera review websites and ended up the same leading brands such as Canon, Nikon, etc. For an ultra-compact-size digital camera I was surprised that Casio received a very good technical review. For the attractive price I gave it a try and have been loving it for it's combination of sturdy construction, long battery life, quick startup, high quality movie file, and most importantly its full manual control features. In addition to its regular camera shutter/aparture controls, it also allows you to adjust the so-called image quality the way you like (sharpness, color saturation, etc). A few less-than-perfect things in my mind include the requirements of Casio's proprietary battery and docking for charging.Instead of repeating the same points several excellent reviewers have made and have rated it 5 stars, I urge you to read the comments made by PhotoGraphics here in Amazon.com, which provide a down-to-earth evaluation of this extraordinary EXZ750.--Update Feb 2007:  Still LOVE this camera very much for it's quick start up , fast auto focus, long LONG battery life.  Also I just realized that this camera takes BETTER movie clip than my Sony Handycam camcorder on the memory stick !! (... of course it can't compare to the video taken on the digital tape.)  Z750 has higher resolution, and I believe higher frame/sec as the motion is a lot more fluid.  I also appreciate Casio's full manual control which has allowed me to play with the aparture, shutter speed, and flash and sucessfully take pictures of christmas lighting at night with or without people.", "Date": "December 9, 2005"}, {"Title": "All I can say is... WOW!", "Author": "D. Murphy", "ReviewID": "R1NOBWDAECGS6H", "Overall": "5.0", "Content": "This camera is just amazing being such a little camera.  I have a Kodak digital camera that I just love, but it's not \"travel friendly\" meaning it's big, bulky, and it sucks batteries so I always have to lug around a case with an extra battery and a charger.  I wanted to get a new camera that I could take with me on vacation and keep it in my shirt pocket and not have to worry about bringing a bunch of accessories with me.  This camera was more than I could ask for.First let me say the battery life is unbelievable.  I took a thousand pictures and I only charged the battery twice, and both times I charged it the battery wasn't even low.  I don't use the flash much, so I'm sure that helped, but still amazed me.Second, the large display is great.  It's a little difficult to see in bright light, but really all LCD's are.  The LCD backlight brightness can be adjusted to make it brighter during the day so it is easier to see.  The large display is great for reviewing your pics or movies.  The camera even has built in sound so you can hear your sound bits or movies that you recorded.I've read in other reviews that the flash falls short of adequate for distance.  I didn't seem to notice this.  I found a setting in the camera that allows you to easily change the flash intensity with 5 intensity settings.  If I turned the intensity all the way up, I was able to light an entire very large room easily even if the room wasn't very dark.  The flash worked fine for me.  I'm sure there's more settings that I haven't found yet, but the only problem I saw with the flash is that the pictures come out darker if the flash is used in say, dusk light for distance scenes.  The pictures came out brighter for me without the flash for taking a picture of a city at dusk.  Probably because the shutter time is longer, but you have to be sure the camera is steady.The built in scene modes are great and cover just about every type of shooting situation you'd need, and you can even create custom.  I took a picture at standard settings of a sunset in Hawaii, and then used the \"sunset\" mode and the picture came out so much better, it looked professional.  The \"text\" mode was also great for taking pictures of text, signs, etc.  You also have the options of black and white, sepia, pastel, cartoons, etc.  Some pretty neat options for picture modes.This camera is also very quick, you don't have to wait a long time for the picture to save before you can take the next.  You can probably take the next picture within a second or two. It also boots up very quickly.I am very happy with this camera, and I'm sure I'll be more happy once I learn how to use all the features, although it is pretty user friendly right out of the box.  if you've used a digital camera before you'll be able to figure out how to do the  majority of the basics.  I've shown my camera to a few friends and they already went and bought one.  All I can say is I'm very happy with it and still amazed at how much camera is in such a small package.  If anyone has specific questions please let me know.  I bought this camera for $375 about a month ago and I would highly recommend it to anyone looking for professional quality pics in a small travelable package.", "Date": "August 5, 2005"}, {"Title": "ATROCIOUS CUSTOMER SERVICE", "Author": "A. Goodwin", "ReviewID": "R1SCD8TTUODGSH", "Overall": "1.0", "Content": "I have had such a miserable interaction with Casio's repair team. They do not respect their customers nor do they apologize for their mistakes. I sent them my camera over a month ago since my shutter broke. They fixed it in one day and proceeded to send it to the wrong city. Multiple phone calls later on my part, never theirs, they promise me they will overnight my camera. Never happens. I call again and they promise to overnight it. Never happens. I call again, same thing. It has been 3 weeks now of hearing their promises that turn into lies. I just want my camera back - all they do is send you a refurbished one anyway. I have called, emailed, faxed, etc. They do not allow you to talk to a supervisor or manager. They do not read your emails, even if they respond to them. I sent an entire email, beginning with my job number, to the repair center going into detail again about the situation with my camera, ending with me being frustrated with customer service and never intending on buying their products again. The email I get back? \"Hi, I saw that you called asking for your job number, so I just wanted to be sure you were helped with that. Bye\" What??? Of course I have my job number - that was in the first line. They didn't even READ my email or even allude anything in my email. It was UNBELIEVABLE. Today I called again, and I have been so frustrated and feeling so hopeless, I was starting to cry as I explained to them again about the situation and what terrible service I have received, when the customer service agent, Nabeel, outright laughed at me, mocking my concerns. They are unbelievable. I never have had such bad service even through not-so-reputable companies! Needless to say, I will NEVER purchase from Casio again, and neither will any of my colleagues that I have explained in detail my unfortunate course of events! DO NOT BUY CASIO PRODUCTS IF YOU EVER EXPECT TO UTILIZE YOUR WARRANTY. THE REPAIR CENTER IN NEW JERSEY DOES NOT CARE IF THEY DO THEIR JOB WELL OR AT ALL. Sorry to go on about this, but I STILL have not received my camera, and I am at a loss of what to do or who to contact. Please, DO NOT PURCHASE!", "Date": "April 25, 2006"}, {"Title": "Fantastic compact camera", "Author": "Gaji", "ReviewID": "R1C5NCOW92D0JH", "Overall": "5.0", "Content": "The EXZ750 is simply a fantastic compact camera. It takes great pictures, even greater if you bother to use one of the many picture presets (scenery, portrait, macro, etc.).The pros:- picture quality is great; if you want anything better you'll probably be lugging around a DSLR- picture presets are extremely easy to use, even if you are not a techie and / or you've never handled a camera in your life (is there such a person?).- it will fit into your pocket and you'll forget it is there. This is a major advantage as the best camera is the camera you actually have with you - this one you will.- common settings (picture size, ISO, etc.) are one or two clicks away - very convenientThe cons:- the camera does take videos (at more than decent resolution) but they come out shaky even if you have pretty steady hands. Without some image stabilization in it, it is definitely not a replacement for a video camera- although the camera has ISO settings of 200 and 400 you should probably avoid them due to noiseOverall, a very positive and pleasing experience. Even having a digital SLR, I'm never giving this little puppy up.", "Date": "June 16, 2006"}, {"Title": "Super camera, price and free shipping", "Author": "G \"FL33496\"", "ReviewID": "R1BYWQ14FTZOYY", "Overall": "5.0", "Content": "After checking prices with all the usual pricing bots, I found a better price, including free shipping, by going directly to Amazon. This lowest price did not appear in the other searches, so it pays to go to Amazon first.I replaced my Canon SD400 with the Casio and find the controls more logical to use. This is important if you don't use the camera for a while, because you can just pick it up and start shooting without hunting for the manual. Also, the docking base is much more convenient than plugging small cables into the camera. You do not have to remove the battery in the Casio to charge it as you do with the Canon SD400. The VGA movie quality is superior on the Casio. Still pictures appear to be about equal.Amazon delivered by UPS in record time even with a weekend inbetween. I ordered on a Friday and received it the following Tuesday. Go with Amazon!", "Date": "May 24, 2006"}, {"Title": "Great Camera, EXCEPT...", "Author": "W. Chandler", "ReviewID": "RUZOG10KMV4HF", "Overall": "3.0", "Content": "...except for the reliability.  I've had the camera almost a year, and it is now back for repair the second time.  The first time, the optical viewfinder quit tracking with the zoom lens.  It finally came back repaired, with a new lens assembly, but I was without the camera for nearly a month.  Now, with the warranty running out in one month, the lens suddenly extended and the camera will not turn on.  So it's back to repair again, with the hopes it won't take a month this time.I really miss the camera.  Easy to use, great pictures, goes in the pocket so that it is always available.  But my old Sony P1, which was outstanding in it's day but is now clunky and slow, still works, with never a hiccup.  Guess that should tell me something.ADDENDUM:  The camera came back and worked fine for a couple more months.  But then the LCD failed, half of it looks like a cracked mirror.  Of course, it's out of warranty now so I don't have to go through that exercise again.  The optical viewfinder still works and the pictures are still good, but I miss the convenience of seeing a picture immediately after taking it.", "Date": "April 2, 2006"}, {"Title": "Lens problem", "Author": "Xing Shi \"XS\"", "ReviewID": "R23L6IS4RZGEOY", "Overall": "2.0", "Content": "I bought this camera in June 05 after reading some good online reviews. I first thought this camera was great. I so enjoyed its stylish design, large LCD, and a variety of Best Shot Modes.I took this camera on a trip in August. It was really the first time I seriously started using this camera. Before it, I probably only took 20 pictures with it. During the first several days, the camera worked well and I took about 150 pictures before it started to have problem.The problem I had was that I could not take clear pictures no matter what mode I used. The pictures all looked blurry and out of focus. Maybe there are some tricks that might help. However, the camera is not supposed to have this problem. It is definitely a serious drawback of this CASIO camera.I phoned CASIO and the service representative I spoke to quickly said it is the problem of the lens. It sounds like the problem I encountered is not a rare case. I am more convinced after reading some reviews reporting the similar problem. I called CASIO repair center in NJ and haven't been able to speak to anybody. The waiting time was fairly long. I have to keep calling.I hope you have good luck with your camera. For me, I would like to just return it. However, I doubt they won't let me. They will probably tell me to send it to CASIO for repair.", "Date": "September 12, 2005"}, {"Title": "Positively Surprised", "Author": "G. Nagy", "ReviewID": "R5A7682YBM89Z", "Overall": "5.0", "Content": "This is the 3rd digital camera I have bought and I really, really like it! I spent hours on researching professional and user reviews and it came down to the CANON SD550 and this little gem. The menu layouts and the buttons are the most user friendly I have ever seen on an ultraportable digital camera, it is ultra fast, it has a view finder (small, yes, but better than not having one at all), the film modes are brilliant, the battery life is amazing and it takes great pictures. Please make sure you disable the on/off function of the PLAY and REC buttons - this will take care of the lens error problem people have been reporting about. I als remember reading somewhere about the flash being too weak - I did not find so at all. The only downside is that you have to use the cradle for recharging and sending pictures to your PC (I bought a PCMCIA card reader for my laptop). Also, while it does have an anti-shake mode the pictures taken with that mode have very low resolution.", "Date": "December 25, 2005"}, {"Title": "perhaps the Best Ultra Compact camera available", "Author": "A. Freeman", "ReviewID": "R2JBOY60OHJ73Y", "Overall": "5.0", "Content": "If your looking for an ultra compact digicam, you have to consider this one. NOT sony, NOT Canon, but CASIO has quietly become the leader in this class.If your more advanced than a point and shoot photographer, this will make you happy. Lots of features, but heres the BEST reasons to get this camera.-Video mode is MPeg4 /(640 x 480 pixels) at 30 frames per second.(It shoots close to camcorder quality)-Battery life best of any digi cam out there. I can go days without charging!-Beautiful 2.5 inch lcd-Super Fast, I'll never miss a moment again.-quality images that will make you happy.-lots of manual controls.-focus assist lampThere are so many advanced features for those who like to \"tweak\"...too many to remember at the moment, but a few come to mind.-manual control of flash intensity, manual white balance setting, exposure/iso/focusing/sharpness/contrast....12 preset scene modes...lots of focus control choices...and more....all the tweaking you can imagine.-Theres also movie mode that will 'buffer' before and after you decide to record, so if you are a few seconds late, it already recorded those seconds for you.the 7.2 megapixel sounds intimidating, but I keep it set to 5mp, still more than enough for most pics...you can also make duplicate pics from WITHIN the camera at SMALLER sizes (email size, for example). Theres quite a bit of in-camera pic editing/adjusting you can do before you load to your computer...it will keep the original, and creates a duplicate of an edited version. Nice feature.you MUST get a SD card, the biggger/faster the better. Only comes with tiny internal memory.I'm using a RIDATA 1GB 66x SD card, found online for under $60.But 512mb should be plenty.Shop around online for this camera, its still overpriced in stores.... price may be the only negative. I recomend to keep it in a case,& be careful when it goes in your pocket, you dont wan't to break the lcd! I'm nuerotic about it, despite its solid 'feel'", "Date": "August 4, 2005"}, {"Title": "Great But it has a Flaw", "Author": "Carter (1amazonreviewer@gmail . com) \"Carter\"", "ReviewID": "R2KOVLMDARYJO0", "Overall": "4.0", "Content": "Ok the camera is great and no other compact digital comes close.The problem I am having after owning it for 25 days is that you get lens errors on the display screen then camera shuts down. This only supposed to happen when there is an obstruction that does not allow the lens to deploy. On this one you zoom to a point and it just stops, lens error, then shut down. Now it just does it at random, sometimes its fine sometimes its not. I did a google search for lens error z750 and others are having this problem. Hope Casio can get this problem fixed, and at the moment I am hoping thier warranty customer service is good.The repair went well. They replaced the lens assembly and in since the repair I have only had three lens failures.", "Date": "July 2, 2005"}, {"Title": "Casio  EX750 great camera...but", "Author": "Vanessa", "ReviewID": "RE6FVTE0WCDFU", "Overall": "2.0", "Content": "I love the ease of using this camera, and it takes great pictures and video.  However, after a few weeks of use I did get the dreaded \"Lens Error\" problem that so many others seem to be having.  When this happens the auto focus gets messed up and you have to focus or zoom in and out to reset the autofocus.  I did not drop, or otherwise damage the camera, and I don't think I ever blocked the lens, unless it tried to open in the case without my knowledge.  I tried to keep it on the audio record setting to prevent this from happening.I sent the camera in to the Casio repair Center and it is being repaired under warranty.  They told me I'd have it back in a month:(.  I'll let you know how it performs after the fix.  Hopefully it will be the last of its problems and I will be able to enjoy this great little camera once again! If it weren't for this problem I would give it 5 stars.  Hopefully the newer units have this problem solved.", "Date": "August 16, 2005"}, {"Title": "i'm going back to the canon elph!", "Author": "Jennifer T. Bruno \"jtbruno\"", "ReviewID": "RL9GSYVM576EF", "Overall": "3.0", "Content": "after losing a digital elph, i took a chance on the casio for the significant additional funtionality it offered at a lower price. however, after just 2 months, the lcd panel mysteriously broke - not due to any mishandling or dropping. i kept the camera in its case and took great care of it. casio tells me this is not covered under warranty and is charging $117 for repairs. my canon elph travelled extensively with me and overall, just proved to be a tougher, more durable, and overall asthetically pleasing camera. it's worth the extra $50-$75 to go with the canon from the start.", "Date": "February 21, 2006"}, {"Title": "Great package - high learning curve", "Author": "Who?", "ReviewID": "RMPVP0S8IMZ0F", "Overall": "4.0", "Content": "O.k - I'll admit it.  I'm not the most savvy digital camera owner out there.  When my Kodak prehistoric digital cam went about a year ago, I knew I needed to upgrade.  Finally decided on this little camera mostly based on megapixels, and it's size.  Oh - and I wanted an optical viewfinder - which most LCD screen cams don't have now.So, I do like the camera, but my gripe is that the instruction book is a mere 8 or 9 pages only explaining the monitor.  An additional selling point for me was the manual settings you can control - which I hoped to \"grow into.\"  Come to find out - there's a manual on the CD rom that accompanies the camera, but it's 250 pages long!  Come on now!  I'm a hands on guy, and usually will read through a manual before using, but this is crazy!My other gripe.  I spent my first happy day with my new toy shooting a few random pictures.  I thought they looked a bit grainy, but thought it might just be the way the lcd looks.  So I got home to put the pics on the computer, and I had these horrible lines going across every one of them.  Not the kind of quality I expected from a 7.2MP.  Grrr.Called Casio Tech Support and talked to \"Travis\" who said I needed a new camera, and that the image sensor was defunct.  I asked if there was any setting that I might have fiddled with to make it this way, and he said \"surely, not.\"A bit dismayed, I started working on my return to Amazon.  I decided to try the movie mode to see if I had the same problem.  Last thing I wanted to do was return this beautiful camera!  Ran around the house in video mode, and noticed that while a bit grainy, it was typical of short video clips, but the lines were gone!Then I tried a few other modes, and discovered that under Snapshot mode, my pics came out crystal clear and beautiful!  I viewed them all on my comp and I couldn't tell the difference between the lowest resolution and the highest.  Truly wonderful if you plan on blowing these up.Anyhow - long story short - I do recommend the camera, and some lcd protector sheets, as well as a case.  I'm very worried that I'll drop the camera it's so small!", "Date": "February 17, 2006"}, {"Title": "Near great ultra compact camera", "Author": "Samuel C. Lightle", "ReviewID": "RD5ZYK0PQW7IV", "Overall": "4.0", "Content": "I have had very good  results so far with this camera.  Video clips taken from the top bleacher at a football game were surprisingly clear played in Win Media Player.  All  still pictures taken have been superb except for those with flash.  The flash is way underpowered, but I have been able to compensate for most of this with Adobe Photoshop.  My only other drawback is that the control knob sometimes gets moved while in my pocket so I start to shoot on the wrong setting and a couple of times the power has accidentally been bumped on while the camera was in my pocket.  Except for these very minor shortcomings, I have completely enjoyed this camera.", "Date": "September 28, 2005"}, {"Title": "Excellent Camera", "Author": "sp", "ReviewID": "R19WE649AM2O7R", "Overall": "4.0", "Content": "Very small, compact, but powerful.  My only complaint is that the focus setting is a little confusing.  For example, If I switch to business card mode (which is a preset for taking pictures of business cards) the preview on the lcd is a little fuzzy.  It clears up nicely once you take a picture of it...for some reason the focus adjusts after you have taken a picture.  You can also use manual focus adjust once you get comfortable with the camera.  Other than that, great camera, many options to adjust brightness, saturation, aperture, etc.BTW, mac users, you can play the videos you take.  Despite the manual consistently mentioning how you cant view the videos on a mac, it's only because quicktime cannot play them.  Just download windows media player or VLC and you can watch them perfectly.  All videos I take run great on my pb12 with 10.4.3.", "Date": "January 4, 2006"}, {"Title": "Best super compact camera to date", "Author": "Robertson", "ReviewID": "R3I97FXG4WTEO1", "Overall": "5.0", "Content": "This is the best compact digital camera to date.  It is packed with features, unlike the Canon series, and big screen makes a big difference, and it takes great pictures.  The plethora of preset settings are especially good.  If you are looking for a high quality camera with lots of features that you can take with you everywhere you go, this is the camera for you.", "Date": "July 19, 2005"}, {"Title": "Good, but not equal to the sum of its parts", "Author": "Doctor Mark", "ReviewID": "R2LX1MMVD3KBP", "Overall": "3.0", "Content": "Actually I would have to give 3+ stars.  I bought this camera after a fair amount of looking.  It was very important to me to have a camera that combined good still pics. w/ video.  I am very please w/ the size and form factor and the large screen.  The camera is quite easy to use and the start up times are very fast as is the shutter release.  However, I am less than enthused w/ the meager zoom.  Most importantly, I am disappointed w/ the quality of the pictures that are coming out.  I figured that at 7+ megapixels, I should be getting really crisp photos.  Not so.  The 4 X 6 prints I am getting out are generally obviously indistinct and at times no better than the Canon Power Shot 3.2 MP camera which broke and was replaced by this.  As I have found out, if you don't have a crisp image focused onto the CCD, you just get 7 MP resolution of a fuzzy image.  Perhaps this has to do w/ the fact that Casio is not a camera maker primarily.  I wonder if I would be complaining about this w/ a Nikon or Canon or Minolta.  If a camera can not take great, crisp photos, a lot of the rest is moot, although w/ this camera the multitude of other features and form almost make up for it.  The video does come out good and it is very convenient not to have to take two devices and then worry about compatibility.  I previously had purchased a Panasonic DVD camcorder but returned it after only a short time secondary to the compatibility issues.  The DVD camcorder is a great concept, but I will wait until more of the formatting issues get worked out.", "Date": "July 5, 2005"}, {"Title": "Another EX-Z750 Victim of Lens Error / Retraction Problems", "Author": "C. Roehrs \"CSRoehrs\"", "ReviewID": "R377FGI040QHW9", "Overall": "1.0", "Content": "Add my name to the lengthy list of EX-Z750 victims of the dreaded 'lens error' and lens retraction problems.  I bought this camera less than two weeks ago and have only used it on two days. On the first day, almost immediately after shooting some photos the lens went blank with the 'lens error message'. This happened a few times but I was able to remedy the issue by powering down the unit.  Unfortunately today - as mentioned, only the second time I've used the camera - the lens refuses to retract. I've tried removing the battery, recharging the camera, etc. to no avail. This is infuriating but I blame myself because despite my due diligence, there was a large number of reviews and persons who mentioned this problem. Hopefully B&H; Cameras in NYC, where I bought this product, will allow for it to be exchanged. From the limited amount of time the camera actually functioned properly, I was pretty impressed!Croehrs", "Date": "December 26, 2005"}, {"Title": "In a class on its own!", "Author": "P. Richardson", "ReviewID": "R3U7H5MGNZFXTW", "Overall": "5.0", "Content": "Had this camera for a few days, and I must say, it is excellent!  All the other cameras I looked at (Sony and Canon were my other favourites) did not have anywhere near the features of this camera.One feature on this camera that alone makes it better than the others (although Sony has a few cameras that do this) is the MPG4 video!  I can't believe I've actually seen people complain about this feature!I use this camera as a video camera, and it looks better than my old Hi8 video camera.  I can also burn straight to DVD without much problems.  This camera is the only one I've played with that allows zooming during recording.I also dislike how people complain about the optical viewfinder, this is so hard to find on a small camera, but so very handy when you need that extra-recording time by turning the LCD off.Bottom-line, this cammera is the only camera I would consider buying simply because none of the other companys match the feature-set.", "Date": "August 31, 2005"}, {"Title": "I had to take mine back and I miss it!", "Author": "R. McLaughlin", "ReviewID": "RNIIYCZN6IE69", "Overall": "3.0", "Content": "I purchased this camera in May and it has been fantastic. Then 2 weekends ago I got this LENS ERROR and it failed to work.  So I took it back to Costco for another one and the new one had the same LENS ERROR.  Well I need a camera I can count on, so I am going Canon!", "Date": "September 17, 2005"}, {"Title": "Great slim camera", "Author": "Dyallen Efendi \"blu3clipse\"", "ReviewID": "ROOHPJ91UA0HD", "Overall": "4.0", "Content": "love the camera size!great batterygreat large screengood flashgood selection in the menueasy to use (i dont read the manual but i can operate this camera just like that...)very nice slim design..very sophisticated!takes great great amazing detail pictures OUTDOORnot very satisfy with the result for pictures that taken inside.. it might be my lighting source..but so far this camera took just Ok indoor pictures.great price for 7.2 mega pixels cameraeasy usb/charger deck (i am on Mac/os x, have no problem at all), downside: deck is too big to carry for travel.overall: very satisfy with the camera :)", "Date": "November 27, 2005"}, {"Title": "good, convenient, but a couple of flaws", "Author": "B. Hewitt", "ReviewID": "R1JGNNECAOPVD5", "Overall": "3.0", "Content": "Overall, the camera has been easy to use and seems to generally take good shots. The menus are somewhat straightforward, although I've used others that seemed a bit more intuitive (the Canon PowerShot models, for example). The menu option to disable the digital zoom, for instance, was a challenge to find. The physical controls are quite logical, it has good manual options, and the screen and functional display are large and useful. So far, after a couple of months of shooting in a variety of settings, I've been pleased with the photos overall.I have come across a couple of flaws that prevent me from giving it 4 or 5 stars (I'd give it a 3.5 if I could): first, and probably most annoying, when using autofocus, the camera seems to shoot some out of focus shots, despite the focus-confirming 'beep' and what looks like a focused preview image on the screen. This seems to be especially true when using the maximum zoom. Second, the flash is getting a bit temperamental. There have been a number of occasions that the flash wouldn't flash in lighting conditions that clearly would require it, even when the flash mode is set to always on (as opposed to auto-flash). I haven't been able to figure out why this is, but my hunch is that it MAY have something to do with battery charge, although it has actually happened when charge shows as 2/3 full. Lastly, a minor complaint: although the screen is large and bright, it's actually a little grainy - not enough to affect the ability to compose a shot or evaluate it afterward, but not exactly crystal clear.I'd still recommend the camera as a good point and shoot, but might have some reservations if you're looking for something a step above that.", "Date": "November 9, 2006"}, {"Title": "Great idea but glitchy", "Author": "M. Wong", "ReviewID": "R3OJK81D97VOPW", "Overall": "2.0", "Content": "We bought this camera just before our wedding and honeymoon and loved its overall ease of use, compact size, quick boot-up, responsive shot time and the fantastic photos it produced.  Even the video clips are of good quality.The main issue is that within two weeks, we started getting \"Lens Error\" messages every time we tried to zoom in for a shot.  This shuts the camera down.  We'll take this one back and see if it happens again.Other issues:-Flash/focus dial is very sensitive, as is the camera mode dial.  You have to double-check all three before taking a shot to make sure you're not accidentally taking a video clip instead (this happens often when you're having someone else take a photo of you, for example).-Not wild about having to pack the travel caddy to charge the camera on trips (one more thing for me to lose or break).", "Date": "July 4, 2005"}, {"Title": "Lens errors", "Author": "Santos Alberto Castillo", "ReviewID": "R3TPEBUM08UZQW", "Overall": "1.0", "Content": "I bought this camera four weeks ago.Great camera if you are lucky enough to get one that works.I had exchanged it two times! other words two out three did not work properly and showed the same problem that shows as follow:The camera works just fine for 2 or 3 days then the first sing of problems is that when you turn it on and try to focus (1/66, F2.8, ISO 100) it just doesn't focus (the small square gives you a red one the shooter is half pressed), however if you move the zoom to a different position works fine.As you use it deteriorates to the point that when you move the zoom in or out it turns off and display the message \"lens error\" this keep appearing more and more until it becomes unusable.I had the same issue with the first two cameras (the original purchase, and the first exchange)I am now on my third one(yes it is crazy!!) this last one appears to be from a different mfg date or lot (you can tell by the S/N).", "Date": "September 6, 2005"}, {"Title": "Excellent photos - almost idiot proof", "Author": "Charles E. Kirby", "ReviewID": "R3O6CW7HM5JE79", "Overall": "4.0", "Content": "I bought this camera for my boyfriend, and he loves it!  He's a bit of a camera snob, and sold his high end digitial camera after I bought him this one, because it takes pictures that are practically as good, and the camera is considerably lighter and simpler to use.  His only complaint has been that the viewfinder does not show what you will be taking pictures of, you have to look at the screen.  I am a horrible photographer, but with the camera's features (crop, zoom, modify brightness, etc.) even my pictures can be made to look professional.  I found this camera by comparing in Consumer Reports (this is not an endorsement for them).", "Date": "January 3, 2007"}, {"Title": "excellent little camera", "Author": "P. Tam", "ReviewID": "RG921XF98BQ73", "Overall": "4.0", "Content": "Very small size (fits in my baggy jean pocket), fast startup, fast response when shooting picture. Much easier to carry around than my Canon G3.Does not do well indoors when flash is needed. Lots of red eye, much more than my Canon G3.", "Date": "June 13, 2006"}, {"Title": "Best compact digital I've used to date", "Author": "Amazon Customer \"The Mojo\"", "ReviewID": "R1ANIKRU5CZIYV", "Overall": "5.0", "Content": "I have to agree with all the postive reviews already posted and can't really add anything above what's mentioned. This  is my 6th digital camera and finally I am pleased. I have constantly been disappointed with other digicams having slow focus, ease of use for the whole family, and battery life. Except for the weak flash, which you would expect from a camera this size, this unit is as near perfect as I've used for a digicam. I absolutely love the MPEG4 video mode, which I use for almost all my family videos now. This camera is a keeper for me.", "Date": "August 8, 2005"}, {"Title": "TOP OF THE LINE CAMERA", "Author": "Suzie Allen \"cat1449\"", "ReviewID": "R3EHTNN5RHKY87", "Overall": "5.0", "Content": "I bought this camera 12/2005 for Christmas on the recommendation of Wolf Camera.  I am not a photographer or techno advanced; just a mom with 4 kids.  I love this camera.  It's great and hasn't failed me yet.  The salesman told me about the oversaturation and I adjusted it.  The battery life is amazing as I am always on the go.  It is so small I just throw it in my purse.  I have not had any problems with the lens sticking or turning on unless I turn it on.  Sounds like some of the other reviewers should go with a digital SLR.  This is an awesome point and shoot camera and I would recommend it to anyone.", "Date": "November 14, 2006"}, {"Title": "Small camera, great pictures", "Author": "Eugene A. Silva", "ReviewID": "R2TOGQU1REERFB", "Overall": "5.0", "Content": "I had the Cassio Exilim 4MP and upgraded it to the EXZ750. I'm very pleased with the quality of the pictures. Make sure you order a SD card with the camera because it does not come with one, just comes with some minimum internal memoory.", "Date": "July 6, 2005"}, {"Title": "WAY TOO SHOCK SENSITIVE FOR THE REAL WORLD", "Author": "M. Bloomfield", "ReviewID": "R3MEX6OAAT5N9W", "Overall": "2.0", "Content": "PLEASE BE AWARE OF THIS CAMERA'S SHOCK SENSITIVITYI was pretty happy with this all-in-one compact camera until it had to be repaired for the SECOND time. It's sensitivity to vibration or a slight bump while the lens is out is way too sensitive for the real world. The result is it loses it's ability to focus and zoom. It didn't help that it commonly powered on while in a pocket, with the lens protruding, thereby causing unintentional harm to the lens assembly.The first time it happened Casio repaired it under warranty. The second time it was outside of warranty and the repair center wanted $137 to repair it - that's more than 1/3 the original purchase price. I won't reinvest in a weak product. I'd rather put that money into a new camera altogether.", "Date": "October 26, 2006"}, {"Title": "A review of  a camera from someone who knows nothing about cameras...", "Author": "Mark Prijic \"This is my book punks!\"", "ReviewID": "RCA2WO0RXDAE7", "Overall": "4.0", "Content": "I would like to start my review of this camera by saying that I don't know much about cameras at all.  I'll review this camera based solely on how the pictures look, not on stupid stats and specs of the camera like a technogeek would.Indoor pictures:  If you take a picture indoors in a normal sized room the pictures turn out fantastic.  However, if you go to a basketball game or some huge arena, the pictures turn out very dark.  I don't know why, but they do this everytime.  Take a look at my picture of Rasheed Wallace on the customer pictures at the top of this web page to see what I mean (This was probably the brightest picture out of 50 I took at the Bucks game)Outdoor pictures:  Wow, this camera is fantastic for outdoor pictures as long as it isn't night out.  Take a look at at my night picture of Judson Tower to see what a night shot is like.  It is not bad, but not nearly as good as a daytime pic.  I also took a picture of two palm trees during sunset in Hawaii which turned out fantastic (However, some jealous person voted that the picture wasn't helpful, yea right!!!  That picture of two palm trees as sunset is the prettiest picture I have ever seen in my life.)  Take a look at my picture of the rooster to see what a daytime picture looks like.  The colors are nice and bright.To sum up, the camera takes great pictures in daylight outdoors and closeups indoors, average pictures during darkness outdoors, and terrible pictures in large rooms indoors such as an NBA arena.", "Date": "January 24, 2006"}, {"Title": "Great Camera - Great Price!!!!!", "Author": "mg \"gator alumnus\"", "ReviewID": "RAT4INA3UX14J", "Overall": "5.0", "Content": "I have owned this camera for several months now and have absolutely no complaints. It is easy, and takes great pictures.", "Date": "April 23, 2007"}, {"Title": "To be a great small consumer camera it would need optical stabilization", "Author": "Seth Wandersman", "ReviewID": "R3LY2P3GI2WDH2", "Overall": "4.0", "Content": "This isn't a full review but some thoughts I've had after using it for a long time.Stabilization- The fact is that if this is the camera you take everywhere with you, you are going to either lose shots or have to use the flash. If flash doesn't bother you, no sweat. But I've never like the look of it.Ease-of-use- Great.Voice memo- I use this feature all the time. It would be nice if it had a pause button because without it I end up with many small files.Ex- This is where you set the exposure. Casio does a great job putting everything in one place. The only thing they should have done better is that if you have changed a selection (e.g. ISO 200 to 400) and hit the shutter release it should take the shot. Instead nothing happens. You have to click set first. It's an extra step that you have to make during a critical time.", "Date": "August 14, 2006"}, {"Title": "Hats off to Casio this awesome little camera is a winner!", "Author": "Kip D. Dietrich \"kiparoo\"", "ReviewID": "R2MMU5VMV7EZCB", "Overall": "5.0", "Content": "I received my Casio EX-Z750 a week ago.  I purchased this after much online research. This is the 4th digital camera I've owned.  My previous cameras were all Canon, and they are good, but the Casio is better!Excellent quality 7 megapixel photos with very fast response time.  Absolutely stunning 2.5 inch display makes reviewing your photos/movies truly enjoyable.  Casio lets you have manual control or just select \"snapshot\" mode and it's all automatic.The controls are so well thought out and logical that you don't really need a manual.  (which is good because the one they give you is not great- oh well, you can't have everything.)Biggest improvement is in the quality of the movies. They are so much better than the ones my Canon produced.  Battery life is better as well.In summary, finally somebody got it right!  Tiny size, high quality pictures and movies.  Hats off to Casio for this one ... it's a winner!", "Date": "June 15, 2005"}, {"Title": "Very important for everybody to read.", "Author": "Francisco Lainez", "ReviewID": "RD7ILJV5PU2Y6", "Overall": "5.0", "Content": "Ok there's nothing to review since i never received the camara ;i paid a visit to the post office to make sure item was not delivered to a different address by accident or anything of that nature , nevertheless there wasno information regarding such a package ...so now i concidered a lost because i don't have the time to do any farther investigation . I contacted the saler via e-mail who said that he paid usps for a sign up at delivery; so i wonder if he ever received a confirmation of the package delivered in such a date or else .", "Date": "November 28, 2010"}, {"Title": "Great little camera", "Author": "Pizzzaz Com \"The silver man\"", "ReviewID": "R2ZF8FLLJOT7DV", "Overall": "5.0", "Content": "I highly recommend this camera, I've been shopping for one for a few  years now. I've been expecting the camera to drop in price. It hasn't dropped much as the word must be out about its capabilities. The camera shoots great shots from the hip, and even better if you understand how to utilize the manual settings. It also does great video, 3 different settings. I'm glad I held out for this model. I chose it over the higher pixel models in the same catagory and even the same maker. It is one quick camera shot to shot, and it turns on is ready to shoot in around 1.8 seconds. Its also very sturdy, and even with its small size the camera's controls are separated well enough for big hands. Great menue, and easy to learn how to operate. Small enough to slip into your front pocket of a shirt. It also has a viewfinder which means you can turn of the lcd screen and save your battery. They aren't making this model any more, so I figured I better get off the pot and order one before I couldn't get one; I'm glad I did. I highly recommend this camera if you are looking for a great camera that is compact enough not to be intrusive, but takes great shots and great video too! Buy it now before it's to late.", "Date": "January 15, 2007"}, {"Title": "Happy in Kuwait", "Author": "M. Gerjets \"mgerjets\"", "ReviewID": "R3BPFYZB44T5RD", "Overall": "5.0", "Content": "I just received this camera the other day and after reading the manual and playing with the setting (some of which I took the advice of other comments, like the saturation) it seems to be working great.  I love the big LCD, the cool sounds, the extra settings and many other things.  It is about the size of a deck of cards, it is the perfect size and seems really sturdy.  I give this camera 5 star rating for now.", "Date": "January 20, 2006"}, {"Title": "Flimsy, bad customer service", "Author": "Dean", "ReviewID": "R1DO718VHLPQDJ", "Overall": "2.0", "Content": "Like most people I got this camera because it is quite compact for the quality of the image.  I've been pleased with the image quality when it works, but from the start it's felt flimsy and felt like it would die with any rough treatment.  Sure enough: * The shutter cover has often stuck open or shut. * Sometimes it refuses to start at all. * It sometimes powers on as you're putting it into your pocket, which opens the barrel which has got to damage the camera. * Finally, the LCD stopped working altogether.  This is after 8 months.Casio has decided I'm not under warranty (no explanation as to why, no phone number to argue with them), and is charging me $97 to repair it.Don't be seduced! It's a poor quality product.", "Date": "October 30, 2006"}, {"Title": "Worked well... when it worked!", "Author": "SophiesMom", "ReviewID": "RGJI0JZXCBFDO", "Overall": "3.0", "Content": "I just returned my camera.  I loved it until it stopped focusing any piture.  Casio was NOT very helpful and luckily I was able to return it to the store where I bought it.  I am thinking about getting another one, but am worried I will have the same results.", "Date": "December 10, 2005"}, {"Title": "horrible customer service", "Author": "Edwin B. Jankowski", "ReviewID": "R12R735NB0DT80", "Overall": "1.0", "Content": "I purchased this camera new in JAN 06. Had the camera until the view screen went bad in AUG 06, about 8 months.  Because I am stationed in Germany the seller (AAFES) would not stand behind the warranty and we were forced to deal directly with the Casio repair shop in Dover, NJ.  What a nightmare...my wife sent the camera to Dover and we spent $90 to have the screen replaced. Then they told my wife that they sent the camera back on 19 DEC to our APO AE address in Germany but it never arrived.  They didn't insure the camera or place a tracking number on the camera when they sent it.  So after returning from Iraq in FEB and still no camera I had to contact the Dover Customer Service again and a worker named Debbie said \"that a new camera would be sent out and we should be receiving it in about 2 weeks.\"  Well we waited the 2-2.5 weeks and called the Dover facility again.  This time we were informed that Debbie is no longer employed by Casio and that the replacement was never sent.  So on 6 MAR,  our new customer service person SAL, has taken on our quest for a replacement camera.  He has taken a week to check with the repair shop and consult with his supervisors regarding our missing camera.  Yeah all most forgot, when I was talking with Sal about the horrible customer service I asked to speak to his supervisor and the supervisor was not available to discuss the situation.  I then asked for the supervisors boss well he wasn't available either.  In all fairness I did call about 8 p.m. in Germany which makes it lunch time in NJ...They were probably just out to lunch.  I have sent SAL a few e-mails and he's still looking into the situation now it is 13 MAR.  I cannot or will not ever recommend a Casio product to anyone.  The service is horrendous.", "Date": "March 13, 2007"}, {"Title": "i love it", "Author": "Johanny Sanchez \"johanny\"", "ReviewID": "R3JR5TVA4HD1YB", "Overall": "5.0", "Content": "this camera is awlsome i have a year n half with it and the battery life is super good ! the body is metal ! pictures are beutifull nice n super clear ! the only bad thing is that u cant record in the dark other than that is a very good camera i recomend it .", "Date": "December 17, 2006"}, {"Title": "cascio camera", "Author": "roger countryman \"rscjr\"", "ReviewID": "R5UH66Q73IO3W", "Overall": "4.0", "Content": "this is an old camera which I got to replace my old one, the same exact model.  It came in perfect condition, could not be happier.", "Date": "May 25, 2013"}, {"Title": "Great replacement", "Author": "Albert Rabinovitch", "ReviewID": "R29HH6TTMS2TBD", "Overall": "5.0", "Content": "I'v owned this camera for years.  For the price, it really takes high quality photos.  Since my wife lost hers, I was able to replace it with this used one at a great price.  Now, our cameras are identical.", "Date": "May 4, 2013"}, {"Title": "Reunited", "Author": "MN reviewer", "ReviewID": "R53ONQA2V7IDD", "Overall": "5.0", "Content": "My first Casio Exilim EXZ750 was recently stolen from my luggage after the airline unexpectedly told me I had to check my carry-on bag at the door and whisked my luggage away. I originally ordered a new Casio from Best Buy, but I really loved this camera so much that I cancelled that order and bought a used Casio instead (this purchase). This wonderful little camera takes amazing macro photos, videos, etc, and is very solid. I am so happy I didn't fall for the new one!", "Date": "July 15, 2011"}, {"Title": "A TOUGH camera.. who knew?", "Author": "Miles G. \"Miles G.\"", "ReviewID": "R3UHQXM0Z56DUN", "Overall": "5.0", "Content": "I'm about to get a new camera, however I felt it necessary to write a quick review. Solid camera, no cheap build here. This camera has taken a beating throughout it's 4 year life with me. Recently I was involved in an impressive Downhill bike crash where the camera, located in my backpack still managed to pull through. Along with just being dropped, damp, ect time and time again... however it had less than an epic finish to it's life. (Dog knocked it off the table while trying to get some dinner...rendering the LCD screen useless.. but the rest of the camera is still working)oh alright, I like it when people put pros and cons so here we go..PROS-Fantastic battery life-Very tough although not advertised to be I guess... nice side note.-QUICK start up.. take a picture in under a second.. good for that short notice photo op.-Very good pictures-Quick changing to the different modes with the wheel on top.-Good looking LCDCons-mmm, More optical zoom?-The bust shooting mode puts all the pictures into one picture.. that is unimpressive requires photo shop to split apart into their own pictures then the quality is degraded.-People have complained about the lens error.. I think they're on the fritz.. since my camera is pretty well broke and tested one of these reviews in that \"the slightest pressure on the lens will cause a lens error\".. I put my fingers on the lens multiple times with some pretty good pressure and didn't get any of this.HOWEVER if you are worried about it turning on accidentally. Turn that convenient little wheel to \"Microphone\" mode and guess what? if it accidentally turns on, the lens will not come out.. Magic...I hope my next camera (which will have more optical zoom) will take and give as much as this one has.", "Date": "June 24, 2009"}, {"Title": "Very very good buy at Amazon", "Author": "Jonathan Galente", "ReviewID": "R1JY3IRSS71E51", "Overall": "5.0", "Content": "This Casio camera was a great buy and I have been looking for this one for at least 5 weeks!Thank you.Jonathan Galente", "Date": "February 15, 2009"}, {"Title": "LCD Problems are an issue", "Author": "Joe the Consumer \"Joe the Consumer\"", "ReviewID": "R8S6YQVS0KW08", "Overall": "2.0", "Content": "Size is great for traveling, but I continually have LCD issues.  I sent it back to manufacturer and they fixed it once.  Six months later, the same splotch occurred on the LCD screen.  Of note, it was not cracked, just a malfunction of the internal guts of this camera.  I would not recommend this camera for this reason.  Others have reported similar problems.", "Date": "January 20, 2009"}, {"Title": "SPORTS! WILL capture PAST ACTION 5 sec BEFORE you press shutter!", "Author": "A. Fisher", "ReviewID": "R17TXYLGAX1589", "Overall": "5.0", "Content": "Everyone who is using a camera to capture ACTION...SPORTS MEETS,GAMES, MATCHES,CAR RACES, ANYTHING that you could miss by being slow to hit the shutter will want THIS camera.MOST OTHER CAMERAS DO NOT HAVE THIS RARE \"PAST MOVIE\" FUNCTION!In that setting it is constantly recording (and erasing after 5 seconds)whatever you have it pointed at.  When you hit the shutter the camera SAVES THE PAST 5 SECONDS ACTION BEFORE YOU PRESSED SHUTTER AND DOESN'T ERASE IT but commences the recording 5 sec before shutter is depressed.  So you NEVER MISS capturing the \"action\", wreck, dive, jump, accident, WHATEVER action happen just before you pressed the shutter!!!(Like the copperhead snake that swam up and attacked my bobber while I was fishing!I lost my camera on a cross country trip, and because it is such a great camera AND it had my vacation photos on it, I gladly paid a reward to the lady in KY who found it and called me and returned it.  Make sure you put one of those sticky address labels on your camera and write your phone # on it too so honest people CAN return it. You won't regret buying this camera, it takes fantastic photos too.", "Date": "November 10, 2008"}, {"Title": "Casio Exilim EXZ750 7MP Still one of the best even today!", "Author": "Bill \"Nuts4Gadgets\"", "ReviewID": "RLRAU2X92QM4L", "Overall": "5.0", "Content": "Casio Exilim EXZ750 7MP Digital Camera with 3x Optical ZoomI bought this top rated camera when it first came out a few years ago. Recently it was stolen and I went searching for a new replacement in current top Point & Shoot cameras. I could not justify nor feel confident enough with any of the choices of the new crop of cameras (all brands) due to one reason or another (e.g. they have higher noise levels, video mpegs not as good or equal, higher prices, no regular view finder, optical lens distortions).  Even though many newer current cameras have moved up to 8, 10 and 12 megapixels resolution compared to this original 7 MP camera, there is no improvement (or no noticeable improvement) over this older camera.  So even though this camera seems to be discontinued, I searched for it and found it on sale at an Amazon.com third party vendor selling it \"new\" for less than it cost when new (and cheaper than any current equivalent quality camera). So I rate this camera that good! I re-bought it over any new current crop of P&S; cameras.  It provides very decent focusing and picture quality plus outstanding videos! The minor cons are that I think it can only take up to the 2GB SD memory cards and does not support the newer larger 4GB and 8GB SD cards. But you don't need those large sized cards for this camera really and you can get seveal fast 2GB SD cards really cheap these days. It also does not have the latest IS technology but I don't really need it and have always done without it in the past. It was a Nice top rated camera back then and STILL a TOP rated camera now!", "Date": "July 3, 2008"}, {"Title": "Great Camera", "Author": "Stacy", "ReviewID": "R188BYHUPJ4ZJG", "Overall": "5.0", "Content": "I have had this camera for three years-ish. About a month ago, I dropped it and killed the LCD screen. The camera still works and takes great pix but I felt since my gf is spoiled by the LCD and doesn't know what the view finder is...I should probably get another one and I can use the broken one. This camera is easy to use, easy to switch modes and gives great video and pictures. Obviously I/we like this camera since we had every opportunity to buy a different one but stayed with it. The only negative I have with this camera is that it needs to be in the cradle to charge or to download. That part is a bugger....hope this helped...", "Date": "April 27, 2008"}, {"Title": "Very good point and shoot camera", "Author": "J. Wen", "ReviewID": "R4V10X37DVUUZ", "Overall": "4.0", "Content": "Great product. Best features are:1. VERY LONG battery life2. quick response3. many pre-set shooting modes. Night shoot with portrait being one of my favorite. Business card mode also very useful.", "Date": "August 24, 2007"}, {"Title": "The best of the Best it takes a beating an works fine", "Author": "Ramon L. Ramos \"Ray's personnal Experince\"", "ReviewID": "R19NYSFEO0O3X8", "Overall": "5.0", "Content": "Purchased this camera online when I was in Afghanistan, got the camera used under some of the worst weather conditions sandy, extreme hot and very cold weather while traveling on long road trips or fliying in helicopters, I took it with me to the Phillipines on a beach vacation and it worked just perfect.  When I returned back to Afghanistan keept Using it until I finish my tour, then I went to the United States for 3 weeks (Texas) and I used during during my kids Spring Break vacations and worked great returned back to my duty station here in south Korea were I took it on many trips to the mountains while hiking with no problems.  By the way during all this time I had a Cannon S-3 IS 12X Zoom a great camera but; I prefer the pictures quality of my Casio and the pocket convinience.  I never purchased a leather case all I used for a cover is an Oakley's little black sunglases bag and I clean it with computer wipes.  It still looks brand new.  Is a matter of how you take care of your property and your invesment.  Also I want to point out that I never, ever had any problems with the so famous lens erros when they open in your pocket ect.  One time I purchased the Casio Z850 just to give my 750 to my wife but when I saw how low the quality of the video and how noisy the ISO was when I was taking pictures I immediatelly return it, picture quality was a sted down from the Casio Z750.  I will purchase an additional Casio Z750 intead of buying a Cannon SD 800, any Sony Camera outthere, just to keep it handy that is how much I like it.  I rarely use my bulky Cannon S-3 IS.", "Date": "August 4, 2007"}, {"Title": "Just doesn't last - VERY disappointing", "Author": "T. Mehelis", "ReviewID": "R1NWSUGN06DZC7", "Overall": "1.0", "Content": "We purchased this camera in March of 2006.  We loved it.  I was able to keep up with our toddler and take hundreds of great photos.  The pictures were clear, the shutter was fast and the battery charge could last a long time between charges.  Even the movie function was pretty good for a little pocket camera.  However, by summer, the zoom function stopped working.  We kept using it anyway.  Soon, the menu button no longer worked.  We kept the camera in a padded case and treated it gently and always kept it out of reach of the little one.  We are still waiting for the repairs to be done (at our expense, too!)  It is now the end of July 2007.  I've given up and am looking for a new camera.  So sad.  If it could only last few years before breaking, it would be a 5 star camera.", "Date": "July 25, 2007"}, {"Title": "Good pocket camera", "Author": "Shuping Lu", "ReviewID": "R2P4APSCQZZZV6", "Overall": "4.0", "Content": "The camera is very compact and light weight.  I carry it in my pocket everywhere.  The video quality is good enough to view on a regular TV  monitor.  The only shortage is that when I use photo portrait mode, it doesn't work as well as the demonstration photo shown on the camera.  Everything still is in focus.  If you want to take a portrait and want to blur the background, this camera is not the choice.", "Date": "June 24, 2007"}, {"Title": "Lens freezing", "Author": "K. Johnson", "ReviewID": "RLPJEPMMAKFU1", "Overall": "1.0", "Content": "Just for the record, my lens has frozen as many others have complained on this and earlier Casio models. Presently in Iraq, I do want to have a camera with me, but am not inclined to send it back in view of the reports of poor customer service. Sad. It looked to be a great camera.", "Date": "June 8, 2006"}, {"Title": "Feature Rich but Lacks Quality", "Author": "Billy Howell", "ReviewID": "R2AN46GFFXMZMG", "Overall": "2.0", "Content": "I originally purchased the Casio EXZ750.  The Casio wowed me with it's features, It does everything but it seems quality is lacking.  I charged the unit over night and woke up to a lens error.  Casio told me the unit was defected and to take it back to the store where I purchased it.  Still able to take pictures (just not able to zoom) I experimented and took many pictures.  I found the quality of the pics to be acceptable only about 50% of the time. Ohhh and the movies did not play on my Macintosh.I exchanged it for the Canon SD550. The Canon did not have all the features the Casio has but.... You can immediately feel the quality of the Canon in your hands.  The Canon does not seem frail as the Casio is. The quality of the pictures are exceptional.  I only paid about $40 more for the Canon but it is truly worth the price difference.  Crisp clear pictures in every lighting situation.  Just love it.  And the movie feature works wonderfully with my Macintosh.I loved the features od the Casio but I wanted better quality pics and not to worry if the camera will be broken in a few months.  I am so happy I returned the unit and went with the Canon SD550.  The Canon is truly a much better camera.Billy - thecloser", "Date": "December 8, 2005"}, {"Title": "Casio rip-off", "Author": "Test Engineer \"Test Engineer\"", "ReviewID": "RKOAIXCEY6DO7", "Overall": "1.0", "Content": "My camera went bad from a VERY COMMONLY reported manufacturing defect \"camera stabilizer is not available\" error message in the model I had. Since this is a common defect from the manufacture, they should have fixed my camera at their expense, but they refused to fix it without me having to pay $100 something for their manufacturing defect plus shipping charges! Don't buy Casio products! They don't stand behind the quality of their products.", "Date": "July 16, 2009"}, {"Title": "worst ever, never focused properly, ruined our newborn photos.  AVOID", "Author": "jdt2", "ReviewID": "R2TA8J4NKTUE54", "Overall": "1.0", "Content": "Ruined two sets of vacation photos and our baby photos.  Never focused properly.  Warranty, support was worthless.  We purchases a Canon digital SLR and are much happier.  Avoid this camera at all costs!  It caused nothing but heartbreak.", "Date": "February 17, 2009"}, {"Title": "Great Camera Except for Red Eye", "Author": "K. Smith", "ReviewID": "R1A7VOV5JG3OK2", "Overall": "3.0", "Content": "Let me start by saying I'm not a photo expert.  I want a small, simple, point-and-shoot digital camera.  I have had a Minolta Dimage X for a few years and have had good results.  I decided to upgrade to a higher resolution camera and after reading a lot of reviews I selected the Casio EX-Z750.  I like everything about it except that I get terrble red eye on almost every picture of a person (when they are looking more or less directly at the camera).  I even tried the red eye reduction setting on the camera and continue to have the same problem.  I never had this problem with the Minolta.  Maybe I'm doing something wrong?  I'm thinking about returning the camera, but I would appreciate any advice on how to fix the problem before I bother with the return.", "Date": "January 2, 2006"}, {"Title": "Lens Error", "Author": "Mark J. Byers", "ReviewID": "R17NMG2X58RIZZ", "Overall": "1.0", "Content": "I purchased this camera earlier this year and ended up experiencing the \"lens error\" issue when zooming.  I had heard a lot about this issue after I bought the camera, but did not seem to experience the problem until a few months ago.  The lens jams and the camera shuts off when I attempt to zoom at the highest setting.  I had really loved the features of this camera and found the photo quality great, however it is useless when it keeps turning off consistently.  I now have a Canon PowerShot and am living the reduced feature set, but have a good snapshot camera that works.", "Date": "December 14, 2005"}, {"Title": "Exilim EX750", "Author": "Jinyoung Chon MD \"anestha\"", "ReviewID": "R3CARNZB6U2H59", "Overall": "5.0", "Content": "Very nice slim camera.Very bright lens and very long battery life!!Much better than my previous Sony T series.", "Date": "July 7, 2005"}, {"Title": "Broken after 6 months", "Author": "Charles Schwab \"PaulG\"", "ReviewID": "R2EFD37HCX5UG4", "Overall": "1.0", "Content": "This is my 3rd and last Casio camera ever.  This one broke (starts up with a \"lens error\" message and shuts down) after 6 months of gentle use.  Casio wanted to charge me $135 to fix and said the warranty on factory reconditioned items is only 90 days.  I thought fact. recon. was supposed to mean brought back to new condition?  Regardless, I owned two other similar Casio cameras EXS500 and they both broke with the same lens problem. One broke at 11 months and was covered, the other at 15mos. and I had to junk a $220 camera.  So maybe it's my own fault, but the least I can do is share my experiences with others so maybe they won't suffer a similar fate.", "Date": "April 10, 2007"}, {"Title": "Bad design", "Author": "Camera Buff", "ReviewID": "R1P6SDXDUPBQEG", "Overall": "3.0", "Content": "Camera has a fatal design flaw - the zoom lens assembly is fragile, locks up and malfunctions easily. If camera is out of warranty repair costs $119. I am on my second repair, when the zoom lens breaks the third time I'll be ready for a new camera from a different manufacturer. Skip buying this one unless you're prepared to keep it in a padded case and dust off the lens assembly after each use.", "Date": "January 21, 2007"}, {"Title": "What a FLOP...", "Author": "Richard Robichaud", "ReviewID": "R1M1O3KIWO5G77", "Overall": "1.0", "Content": "I have taken this camera on two expensive vacations only to find most of my pictures were out of focus. I finally gave up and sent it in for warrenty repair. I have not received it back yet. I would also get a random lens error message. I believe the lense is binding sometimes and does not focus. I would not recommend this camera or brand to any friends. I see that other people have reported the same problem with theirs. I ordered mine through the i-net so I don't know if the return-to-store option was available to me. I would have selected ZERO stars but that was not an option.", "Date": "December 13, 2005"}, {"Title": "LEMON ALERT", "Author": "Justin M. Dowd \"J.D.\"", "ReviewID": "R3AUHPVZPVZ1TZ", "Overall": "2.0", "Content": "The functions are nice, the size is perfect, but the camera, well,....its HORRIBLE.  I bought one (the first) and as soon as I turned it on there was a lens error. so i brought that back and deceided to order one online, now that I have that one( the second) the zoom continuos function will not work.  TO complicat the problems I am overseas in Italy and the number the give in the warranty with all the countries isnt even worth the paper it is written on. When you call the number and press 2 for english, they automatically hang up on you, when u press 1 for Italian, and talk to them, they tell you to call back in a week. Now what kind of customer support is that??????????Then I finally found a way to call an 800 number from the states and the online tech help was poor.DONT BUY THIS CAMERA. UNLESS YOU LIKE NICE EXPENSIVE PAPER WEIGHTS...", "Date": "January 5, 2006"}, {"Title": "There are better cameras out there in the same price range", "Author": "Katie Greer", "ReviewID": "R4LKP3GPM3JCT", "Overall": "2.0", "Content": "I purchased this for an office that had both advanced and extreme novice users; other reviews had assured me that the picture quality and ease of use would be worth it.  The camera was very easy to use, but the picture quality was horrible -- simple images were pixelated and not very clear at all.  I ended up going to a camera store and purchasing the Fujifilm Finepix E550, which is also easy to use and in the same price range, but with much finer images.", "Date": "October 17, 2005"}, {"Title": "this is awsome", "Author": null, "ReviewID": "R1OHIS8NR97U34", "Overall": "5.0", "Content": "i think this should have 5 stars because is incredible! the best camara ever!", "Date": "October 5, 2005"}, {"Title": "Nice movie clips but poor photos", "Author": "D. Lezynska", "ReviewID": "R13VYP25CC4KJF", "Overall": "3.0", "Content": "This camera has amazing movie clips photos but the photo quality is very poor - the focus and flash are terrible.  I bought this camera, tried it for a week and then returned it to buy a Canon PowerShot A620 - awesome camera all around.", "Date": "October 21, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "7-megapixel CCD captures enough detail for photo-quality 15 x 20-inch prints\n3x optical zoom; large 2.5-inch LCD display\nHigh-speed start-up enables shooting approximately 0.9 seconds after the power is turned on\nSuper-life battery enables up to 325 shots on a single charge\nPowered by Lithium-ion rechargeable battery (included, with charger); stores images on SD cards (camera features 8.3MB of internal memory)", "Name": "Casio Exilim EXZ750 7MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/517FPZ4KXGL._SY300_.jpg", "ProductID": "B0007KQWDC"}}