{"Reviews": [{"Title": "One of the better Prosumer Digicams", "Author": "Nomad \"Gadget Freak\"", "ReviewID": "R23MF51QTB2TYH", "Overall": "5.0", "Content": "This camera evokes love/hate relationship based on the numerous reviews and comments from users. So the bottom line really is the picture quality.Prior to owning this I had been an Nikon and Canon SLR user but like many, I also have to adapt to the current trend in using digicams. So before purchasing, I spent a whole month researching through the web, visited shops and get a feel of the current digicams on offer. In my quest for the best digicam for my needs, I have seen their output, held the camera itself and thoroughly inspected everything about them. Besides, Im spending U$600-700 so I really need the best for my needs. In those times, I have seen them all, and finally purchased the S7000.What about S7000? I must say that the picture quality of this camera is best at 6mp native resolution. Although it is capable of taking 12MP interpolated photos, I would personally skip that because at that resolution it does become noticeable noisy. However, pictures taken at 6MP and below are by far the best amonth the current offerings. I have tested the Minolta Dimage A1, Nikon coolpix 5700, Sony F707 and the Canon and by far the Fuji have the best color saturation, more natural, vibrant and crisp photos among these cameras.At U$650, you just cannot go wrong with the S7000. The other cameras mentioned here are even pricier and doesnt give all the extras that the Fuji can give. Right now, I am having a blast taking photos with this baby witout worrying about film development cost. It is a great way to learn the ropes about photography espcially in manual mode because as long as you have the memory, you can practice your skills endlessly. When I am done with it, I would like to upgrade to the Nikon D100 because despite the excellent features of s7000 it still is not perfect, but the s7000 is way ahead of the current Nikon, Canon, Minolta offerings at this price range.", "Date": "November 25, 2003"}, {"Title": "Update after half a year's experience", "Author": "Ursiform", "ReviewID": "R1BOV8R5S0NJ0C", "Overall": "5.0", "Content": "Now that I've had the camera for several months its seems like a good time for an update, especially given some of the criticisms that have been leveled at the S7000.The short answer is that I still love the camera, even though it's not perfect. The long answer deserves some explanation.I have many years experience with 35mm film, but also many years experience with computers and computer graphics. Even today, film has capabilities that can't be matched with digital cameras, except possibly by cameras beyond the means of most people. On the other hand, digital photography has huge advantages in terms of immediate accessibility, cost per shot, electronic distribution, editing and enhancement, and the ability to control the printing process to get prints that look the way you want them to.My initial path into digital photography was to buy a film scanner and scan 35mm slides, which in some ways still represents the best of both worlds. But it is a time consuming and expensive (on a per shot basis) approach. My move into digital cameras has occurred in two steps. The first was to replace my \"little\" 35mm camera with a compact digital camera. For recording events and snapshot photography digital cameras became the preferred approach several years ago, and I'm on my second generation compact digital camera. I love being able to go to a family gathering, then go home and do a quick sorting and editing of the pictures, dump them on the web, and e-mail out a URL so everyone can see them while the gathering is still fresh in their minds.Replacing my 35mm SLR is a tougher problem, and one that hasn't been completely solved yet. The biggest issue I have is that the format of available digital sensors means that there are no really wide angle lenses available for reasonably priced digital SLRs. This, more than any other issue, keeps me from buying a digital SLR. I bought the S7000 as a way to get most of what my 35mm SLR does at a reasonable price, while retaining the 35mm SLR, the film in the refrigerator, and the film scanner as a backup until there is a digital SLR that comes close enough to my ultimate requirements that I'm willing to pay the extra money for it.The S7000 is a remarkably capable camera for the price. The wide end of the zoom is restrictive for me, but I have an adaptor and a  Raynox 0.66x lens that help. A fast 1GB compact flash card makes it easy to take a lot of pictures at essentially zero marginal cost. It is true that the lack of control over the compression is an occasional annoyance, but the compressed pictures usually come out very well.Then there is the noise issue. There is no question that if you want to blow up the images and look for noise you will find it. For many shots it's not an issue, but for clear skies and a few other situations you can clearly see it. In most cases screen images and prints of modest size won't show unacceptable noise, but there are situations where it will be evident. Note that there are tools available to make the nose less apparent in images, and if you only occasionally make big enlargements they may solve the problem (if it is one) for you.To continue on this issue, if I scan a slide from ten or more years ago I will generally get grain that is more evident than the noise in an S7000 image. Newer film, thanks to the intense rivalry between Kodak and Fuji in the 90s, has noticeably less grain, but it is still there. So it is all a matter of expectations. The S7000 can create images with noise no more evident than the film grain of days not long since past. Yes, for half again as much you can buy a camera with less noise, but is that a reason to criticize the performance of the S7000? The S7000 can create marvelous images at a great price. It doesn't quite match the capabilities of a cameras that cost significantly more, but why should it?  I'm delighted with the S7000, and have taken a lot of pictures that I really like with it. I like being able to shoot hundreds of pictures without changing film. The battery draw bugs me a little, but the problem is not that I've ever had to stop while shooting to change batteries. The strange thing is that it draws down batteries while it is turned off, so I have to plan on inserting fresh batteries each day. But that's a small problem when you expect it.I keep up on what's happening in the digital camera world, and I knew when I bought it that it was possible to buy a better camera at a higher price. But, as I alluded to above, I'm waiting for the digital SLR system that gives me everything I want before I make a big investment, and this camera offered pretty much everything available at its price point or even a step or two higher. The one competing camera that intrigues me is the Sony DSC-F828, which has a wider zoom and a four color CCD mask. But it not only costs half again as much, it weighs nearly twice as much as the S7000. So I still think the S7000 is the right camera for me at this time. That doesn't mean that it is the right camera for everyone. But when you compare its strengths and weaknesses it should be clear why many people love it even though, as some critics point out, it certainly isn't perfect. But it is a very capable and fun camera!", "Date": "April 25, 2004"}, {"Title": "Awsome photos", "Author": null, "ReviewID": "RNUYP2IDQDA62", "Overall": "5.0", "Content": "I had the chance to tinker with this camera and had it set to 12MP, Fine, and soft sharpness as suggested by one reviewer here. Started taking pictures mostly outside without the flash. I was so delighted with the shots that I had them developed at a local Kodak processing center. 5 A4 sizes and the rest in 6X4s. This is a native 6MP camera but the shots taken at 12 MP can rival a 9 or 10MP camera without paying extra. The printed photos were just amazingly clean of noise and artifacts. I suggest getting a circular polarizer with it because it just brings out more vibrant color to your outdoor shots. I am so thrilled with the performance that I have started buying accessories for it to really take advantage of all its features. The accessories I bought are1. Adapter ring (I suggest getting 55-55 not the suggested 55-52)I bought mine from cameragear.com because it is not availble from any stores in amazon.2. Tiffen deluxe filter set (FL-D, Neutral Density, Warming Filter)3. Tiffen circular polarizer4. Vivitar 285HV Professional Flash (this one is highly recommended from pro to amateur users because of its price and features)I got mine from amazon as well.All this accessories only cost me U$ 160.00 but it really brought out the best from the S7000. For the price and feature set, nothing comes close to the s7000. It is the new king of prosumer digicams at the moment.", "Date": "December 5, 2003"}, {"Title": "A lot of camera for the price", "Author": "Ursiform", "ReviewID": "R3L0CB4JR9PAMM", "Overall": "5.0", "Content": "I've only had this camera for a week now, but the \"shake out cruise\" at a local botanical garden left me anxious to get out and take more pictures with it. Even in 3 MP mode the images can handle significant enlargement, and my tests to date (partial frames printed on an Epson 2000P printer) suggest that the higher resolution modes will support at least 22.5x30\" prints assuming you don't insist on pressing your nose against them to find fault with them. The super macro mode allowed very close up pictures of tiny flowers, and the \"ISO 800\" setting coupled with shutter priority mode allowed me to freeze the wings on a hummingbird. The electronic viewfinder works very well, and I like having a ring on the lens for zooming. I still haven't tried all the features, but I got a lot of decent pictures on the first time out. This is a digital camera that can do a lot of what I've done in the past with a 35mm SLR. (I shoot slides and scan them.) To be fair, it isn't perfect. I would have preferred the handgrip to be a little smaller, but I have small hands. I would have liked a 28mm equivalent short end on the zoom, but I have an adapter to give me that capability that I need to get out and try. More options on image compression would also have been nice, although it produces very good images given the level of compression it achieves. I do like the fact it runs on 4 AA batteries (but get high capacity NiMHs) and will take CF cards (preferably fast, high capacity ones). All in all, it's a lot of camera for the price.", "Date": "October 31, 2003"}, {"Title": "Expectations surpassed!", "Author": "\"dodger_fan\"", "ReviewID": "R1JVHSLG5M27U7", "Overall": "5.0", "Content": "I asked my wife \"what is the opposite of buyer's remorse,\" to which she said \"buyer's ecstacy,\" which is what I am experiencing ever since the camera arrived a couple days ago.It took me about 2 minutes to figure out how to hook up the video cable to my TV and how to record a video clip.  Moments later I was amazing the kids with short video clips with sound of themselves dancing around the room.  Later in the evening I started delving into the incredible depth of feature sets this camera has and realized that this thing is as sophisticated and \"manual\" as I want it to be while also being as simple and \"automatic\" as a novice would want it to be.  It covers the entire spectrum.One issue that was very important to me in upgrading to a better camera was getting one that would fire the shutter right away and be ready to go for more a moment later.  My previous camera left a lot to be desired in the confidence that I would end up with an image that bore any resemblance to what I was looking at when the shutter button was pushed.  Add to that the interminable wait before the next shot was able to be taken, and it was a real roulette of experiences.The S7000 is ready to take pictures when I am, and includes a function that will take several frames in sequence if desired.  The SLR function means I get pictures framed correctly instead of the viewfinder offset that spoiled a few clever photos I experimented with on my old camera.I cannot imagine a better value out there.  The technology that is built into this camera and the results it produces are phenomenal.  The body seems rugged and the controls seem solid with good feedback.  There are several buttons positioned all around the camera to perform various functions, but they seem pretty intuitive.I wish the camera came with an AC adapter.  I can't find it among the listed Amazon accessories, so I'll be tracking that down elsewhere since the provided AA batteries didn't last long (but I put it through its paces).  Rechargeables (NiMH recommended) look like the way to go.I am not an expert, and can't offer much in the way of comparisons, but this seems as good a camera as a casual hobbyist like me ought to be allowed to have without being overcome with a sense of importance and photo-journalistic flair.  Fujifilm did great on this one!", "Date": "March 20, 2004"}, {"Title": "Answer on the battery discharge issue", "Author": "Ursiform", "ReviewID": "RGPRVJ8QYG9UE", "Overall": "5.0", "Content": "I've now learned that the problem with the batteries discharging while the camera is turned off is limited to early production models with certain CF cards left in them while turned off. In the UK Fuji repaired the cameras. In the US they've just told people not to leave CF cards in them. It turns out that the problem can also be solved by opening and then re-closing the battery compartment after turning off the camera. (It some how resets the power supply so that it doesn't drain the batteries through the CF card.) In any event, this shouldn't be an issue for anyone buying a new S7000 at this time.", "Date": "May 16, 2004"}, {"Title": "Image noise is noticable", "Author": "Bob Gilstorf", "ReviewID": "R2ND38KX87IL0S", "Overall": "4.0", "Content": "I received the S-7000 about a week ago and have taken about 250 pictures with it so far. Generally, the image quality is very good even at the lowest setting (1M) and the resolution is a great improvement over my old Sony FD-91. The color is more true than with the Sony.My only dissapointments so far are:When you have an image with a solid background there is noticable noise that manifests itself as slight color splotchiness in dark backgrounds. A 2 second empty image (with the lens cap on) had various white, blue, green, and red dots throughout the black field. I don't know if this is a sensor or firmware function but long exposures at night might be affected. Good news is fringing is minimal.Using the flash at longer distances is one of the reasons I choose the S-7000 and it works very well even at around 30 feet. But it does seem to be a bit on the warm side yielding a slightly  greenish-yellow tint to whites. This may have been due to my proximity to the subject at the time since other images seem to be well balanced.The auto focus has problems in low light situations but if you keep the subject greater than about 7 feet away you should be alright. I tested this last night in a darkened house and it seems to work alright.Fuji says it has a CF II memory slot but they say it's for a microdrive only (max. 1 GB but I've seen packages that include 2GB microdrives). Most info doesn't mention that. I have read that 512 MB 40x Lexar CF cards work without a problem but since Fuji doesn't specfically recommend them you take your chances if you use them. Also, some CF cards can cause your batteries to drain even with the camera powered off. I understand openning the storage compartment door, after the camera is shut down, will prevent this. Since the file system is fat16, you are also limited to 2 GB storage, which should be plenty for anyone buying this camera.  The 16MB xD card that comes with the camera won't do you much good unless you stay close to a computer to empty the card when it's full.That Fuji doesn't supply a set of rechargable NiMH batteries and a charger with the camera is something else to take into a purchasing decision. If you already have them you're in good shape but look for the added expense for them and storage if you do not have them. A set of fully-charged 1900 mA NiMH batteries lasted for about 150 images. Most of these images were taken using the flash and the LCD panel. Since I'm still using just the 16MB card it also involved uploading the files to the computer for evaluations. Just a note here I do wish the LCD was tiltable.Having been involved with technical documentation for 30+ years I have to say that the manual leaves a bit to be desired as well. There is no index and it seems Fugi has it's own terminology for some functions/features. They haven't separated feature information from usage tips. (This is good for beginning users but this and the lack of an index made the manual hard to use when looking for specifics.)Summary:(...) it's a fair to good point-and-click camera but if it was any more than that I be very disappointed with the noise in the images and the non recommending of CF cards. I'll probably be contacting Fuji to see if there is a firmware update available or if there is anything that can be done about the noise.Follow up to previous review...072604 - Just got back from a one week vacation around Mt. Rushmore and must say I was disappointed with the S7000 in auto mode. I took more than 200 6MP photos with the camera in the auto mode in daylight and darker situations requiring the flash. (BTW the NiMH batteries lasted the entire trip even with the 1GB microdrive and the flash.) The noise in the images has made them essentially useless to me for anything but computer desktops or snapshot use and the color bias toward the green end is bad enough in some images to make the sky look teal in color. (Photoshop may be able to correct this but I don't feel I should have to do this.)The auto focus may have caused some of the detail problems since it focuses in steps (about 21) not in one smooth range.The lack of image stabilization hurt the quality of some of my images where I was at a location that would not allow visitors to use the flash and tripod use was not feasible.I have images from an Olympus C-50 in auto mode that produced color much more true and free of the noise that blurs details.There are cameras that yield better images for less money. They may not have all the features of the S7000 but if you think about it, you really won't use most of them. I should have kept the Olympus C-5050.I wouldn't recommend this camera unless you're willing to put up with it's short-comings. To some people they are minor but for my use they are not.11/26/04I've contacted Fugi several times about firmware updates and have only recieved form-letter responses that pretty much say we're not doing it cause we think it works fine. Their web site has not improved since I got the camera.I just came back from a short trip and the images I got at a 6MP setting were of considerably lower image quality of the same subject, under the same conditions, a friend got using a less expensive 5MP Sony camera.The more I use this camera the more disappointed I'm becoming.", "Date": "June 9, 2004"}, {"Title": "Enjoy the s7000!", "Author": "Pierre Labreche", "ReviewID": "R1XEJUXVGR2LWJ", "Overall": "5.0", "Content": "The s7000 has the essential features I wanted : large 6 Mpixel sensor, dynamic range of light (no more white-outs!), excellent resolution and colors, value for money, 6x optical zoom, external flash hot shoe, standard AA batteries and compactFlash memory cards. The camera is very easy to operate, including with gloves. (tried it outside in winter!) The image quality is great when using the best settings (12M pixels fine or RAW, ISO 200). The AUTO mode, the default sharpening, and the JPEG compressor for 1-3 MPixel images produce artefacts or boost sensor noise. I just changed the rating of the camera from 4 to 5 stars after seeing what the raw format is capable of (not using Fuji's bundled software).  Note that the s7000 is not a 12-MPixel camera: it has 6 MPixels. For a fair assessment of the s7000, use at raw files converted using a  lossless format (e.g. TIFF) before magnifying the image at a 1:1 ratio on your monitor.If you use the best settings, you will have excellent pictures. However, the s7000 is not comparable to cameras with larger sensors. If you really want to remove the noise, the \"advanced sharpen\" tool of Picture Window Pro 3.5 will clean it up. Resolution is great. Chromatic aberration is very low but can be noticed (by a purist) when viewing pictures at high magnification. The viewfinder is comfortable and accurate. The delay for taking pictures is better than my other digital camera's (Canon S10). To aid focusing, you can hit a Focus Check button that pops-up a magnified area of the image. The macro photography modes allow for extremely close shootings (1 cm); the auto-bracketing works fine; the last-5 frames continuous capture is a great idea for action shots.Video quality is awsome, and there is no limit to the duration of the videos. I don't need another video camera, since the s7000 is good enough for my needs.Missing features:- a tool for rotating images in the camera- a mode for taking pictures to be stitched (panorama)- 24 hour time format is not supported- range of flash adjustment should extend beyond -0.6 EV- 16 or 24 FPS video rate (only 30 FPS is supported)- Zoom is not enabled during video shooting- sensitivity cannot be set manually lower than ISO 200- bundled RAW converter has no controls, and is not taking the best out of the RAW files. Use alternatives!Minor annoyance:- RAW setting should be available from the \"F button\" for Image Quality (not the SET mode).- LCD display is fixed (many other cameras have an articulated extension)- Audio annotations to photos require tedious manipulationsNice Surprise:Third party RAW converters are available on the web. For example, s7raw has more controls than RAW Converter LE that comes with the camera, and it can output 16-bit TIFF images. dcraw is also very good, and you can experiment with its source code. rawgem (my own converter) is also available for download, and produces PSD 24/48 bit or BMP 24-bit files.ProblemThe histogram shown during picture taking in manual mode is different from the actual histogram of the picture taken. It can be way off -- don't rely on it for setting the camera aperture/speed.", "Date": "January 13, 2004"}, {"Title": "Upgraded from an A95", "Author": "Luppapa", "ReviewID": "RJV77A8941S57", "Overall": "5.0", "Content": "May be this sounds interesting, but I'd been upgraded to the FinePix S7000 from a Canon A95.You can ask me the question: why did I ever upgrade when I was mad about my A95?The reasons are simple:- Because I cannot afford two digit cams at the same time at this price level (so my second one is a Fuji A200 for pocket use).- Because I needed a hot-shoe for future plans,- Because it has 6x optical, 2.8-3.1 fast zoom lens,- Because it has unlimited movie mode,- Because although the ISO starts at 200 (160 in auto mode) it is quite clear even at ISO 400 (and 800 at the 3MP mode),- Because of the professional feeling, excellent ergonomics,- Because of the high resolution viewfinder,- Because of the many extra settings and external buttons for quick menu accessing,- Because of the 1/10,000 min. shutter speed,- Because of the \"last 5\" continious shooting mode,- Because of the 1cm super macro mode,- Because of the faster performance in record mode, faster AF,- Because of the USB 2.0 high-speed transfer from camera to PC,- And because of the dual media slot that is very useful.So what are the things I miss from my S7000 at this price range?- Flip-out and rotating LCD- Custom modes on mode dial (or anywhere)- ISO 800 at full CCD resolution (6 MP) - Yes, I DO NOT miss ISO 100!- Continious shooting mode with flash on- A bit better auto white balance- An AF-assist lamp would be nice (passive sensor helps mainly in good light)Many people compare the S7000 to DSLRs. This is NOT fair IMO. Compare DSLRs to each other, this camera may look like a DSLR (that is very nice) but that is not a DSLR and it doesn't want to be one. It's an all around, full-featured prosumer camera with high quality lens and longer than average zoom.I use only the 6MP mode, the 12MP interpolated is not my cup of tea. The images are soft and noisy for my liking in the 12MP modes, but in the 6MP mode everything is clear - so if noise is the issue you hesitate buying this camera, then go and get it, it's not an issue - at least for me.I like the aperture of 3.1 of the 6x zoom lens at tele position very much. With this, I can make crystal clear and sharp images at full zoom, without having to struggle with light and AF. Of course, it needs external light that can be a flash unit, but this property of the S7000 is really outstanding, comparing it to any of my previous Canons.The last 5 continious shooting mode is very useful - it even works for moving objects, I shot several sharp images of my 2-year-old daughter without any problems. Just make sure you have a big memory card, make as many photos as possible and keep the best of them at the end of the day.Strong jpeg compression is another thing I was afraid of. Having 5 Canon compacts before, my first thing was to test the image quality straight out of the S7000 without any post-processing. Some of the photos I saw on the net (on pbase) were great, but some of them looked grainy and soft. Here's my opinion: again, at the 6MP mode the images are GREAT. At the 12MP modes, although it allows for larger print sizes, images look grainy and soft to me. So I stick with the 6MP mode, it's enough for me and gives at least as detailed pictures as my A95 gave before.What can I say about the macro mode? It's outstanding with great DOF, very high resolution and image detail. No complaining about the S7000's macro performance.VGA movie mode - it's nice. Fills up the memory card quickly so be sure to get a few ones (or a big one). Try to avoid microdrives, nowdays high capacity CF cards can be bought, no need to a microdrive, I always preferred flash cards to microdrives.One of the big big advantage of the S7000 to other cameras is user friendliness, ergonomics, menu and button layout. It's unbeatable I think. Everything is in the right place, you can manage the camera even with one hand.I have only one problem at the moment, but it's not that big really. The camera seems to misfire the white balance sometimes when using flash indoors. It has a blueish tint to the images taken, that happens occassionally. In the same environment, without changing anything, I was obtain to take 9 pictures with great wb and 1 with bad (blueish) all the time out of 10. This is quite strange, may be I have a faulty camera I don't know, but it can be easily corrected in post-processing afterwards.It did the same when using one of the pre-programmed wbs, like the incandescent setting.Still, despite of the white balance issue, I HIGHLY recommend this camera to every serious amateur photographer out there. It's certanly NOT a DSLR but can you get a DSLR for this price? I don't think so. The S7000's outstanding ergonomics and appereance, feature set and high quality optics raise above most of today's compact (and even prosumer) cams, just go and buy it you'll love it I promise. That's what I've been told and they were right!...Back again. Did I ever mention the RAW format and the zoom ring for manual focus?I would like to talk about the noise issue. The S7000's lowest noise setting is ISO200 in P, A, T and M modes, and the camera can select ISO 160 if it can. Are the images of the S7000 noisy at ISO200? I would say definitely NO. In fact, image noise of the S7000 at ISO200 match the image noise of my A95 at ISO100. One of my favourite digitcam reviewers on the net was complaining about ISO200 as the lowest selectable ISO and higher than average noise. OK, a Rebel has less noise. But hey, again, this is not the same price point. For the price, the S7000's noise is lower than average. I can shoot hand-held images without flash at ISO400 (or 800) and I don't need a tripod. Just try it yourself and you'll see that noise is not an issue, indeed it's better(lower) than average. Show me another camera at this price that has lower noise at ISO200 and ISO400 than the S7000. I wonder if you could.So come on people, hurry up, before this excellent camera gets discontinued!...Another update: the more I use the camera the more I like it. There is another issue unfortunately: blown highlights. The S7000 tends to overexpose images occasionally that many times leads to blown highlights and therefore loss of detail. Be careful with the right exposure setting. I know that in winter it's really tough for the camera to set the correct metering, but the number of overexposed images seem a bit more than average to me. Still, I love this camera you just have to check and set the exposure manually a few times and then you're ready.DOF of this camera is SOOO great!", "Date": "January 26, 2005"}, {"Title": "PRO-sumers choice", "Author": "M. Murphy \"No Bling\"", "ReviewID": "R2NTSVBBS921EV", "Overall": "5.0", "Content": "Ease of Use:  Excellent - It is easy to use right out of the boxDurability:  Very Good - Well made and will last a long timePortability:  Very Good - Small and usually functions wellPhoto Quality:  Excellent - Pictures are professional gradeBattery Life:  Very Good - Lasts all dayLighting Conditions:  Use inside & outside, with or without a flashI would recommend this camera primarily for:  AnyoneI went from a Casio QV-3000, to a Canon G5. After testing the S7000, I sold the G5 in favor of the S7000. The options exceed those of the G5, included 12MP image capability. A buddy of mine (you know him, Mr. Pro-photographer) said that digital camera's that do RAW format is the one to go with. I had no idea what he meant until I had one printed out. Stunning.As the QV-3000 and G5 had, and the S7000 has, the ability to use IBM Microdrives. I tested the seek/write times between the Microdrive and the xD-Picture card ... my recommendation is to dump the Microdrive. The xD-Picture card uses less power and seeks much quicker than the Microdrive. Well, not wanting to get rid of my investment, I was happy to find that I can use both the xD-Picture card and the Microdrive at the same time (in case I run out of room on the 256MB xD).Ease of use. In my family, I'm the one who figures techy stuff out (like the blinking VCR time). This time my wife figured this one out way before I did. We had it in the house for 1 day and when I came home, she told me of all the neat stuff it did. Very easy to use.", "Date": "November 17, 2003"}, {"Title": "Pro wedding photog's family camera", "Author": "Jerry Jackson Jr.", "ReviewID": "R1O183YY8DBOI1", "Overall": "5.0", "Content": "I work as a wedding/portrait photographer using high-end Fuji and Nikon DSLR cameras. DSLRs are excellent performers, but they don't make good family/travel cameras because of their bulk. When I decided to buy a new family/travel digital camera I wanted something that could perform almost as well as high-end DSLRs but in a relatively compact form with a low-end price.The ONLY camera that fit the bill was the Fujifilm FinePix S7000. I can't say enough about how great this camera is. The list of great things is too lengthy to go into, so I'll list the only two negative things about this camera. 1: The autofocus system is not as fast/reliable as what you can get on a higher-priced DSLR like the Nikon D70 or Fuji S2. But then, the S7000 is at least $500 less expensive. 2: The ISO noise/grain is worse than in a higher-priced DSLR, but you can remove ISO noise/grain easily using Photoshop or Photoshop Elements.If super-fast autofocus speed and clean high ISOs are what you \"need\" then I don't recommend the S7000. But for 90+ percent of people out there, the S7000 will make an EXCELLENT camera.", "Date": "December 2, 2004"}, {"Title": "Microdrive is fast enough. Video capturing is excellent", "Author": "H. Wang \"jwangamazon\"", "ReviewID": "RFNMHLXM2PSBA", "Overall": "5.0", "Content": "This is my 2nd digital comera. I have been usingit for over 8 months. I am very happy with this camera.I agree with other reviews about the good photo qualityfrom this camera. Just to address something not heavilycovered by other reviews.1. I am using Hitachi's 2GB microdrive and MAGICSTOR's  2.2G microdrive. No problem for continuous 5-shooting  with the highest resoultion setting (5-meg, fine),  where each picture is about 4.8Meg byte in size.  Microdrive is fast enough.2. With microdrive, this camera can capture >30 min of  video at its highest setting (640x320, 30-frame/sec).  The video lenght is limited by my microdrive disk  space.3. With microdrive, the captured video does not show  any slack, and dragging effects. You don't need to  use xD-card for video capturing. The microdrive is  already fast enough for non-stop video capturing.4. This camera has very very good video capturing power.  The captured video is better than my JVC camcorder.  The color is more vivid. The focus is far more sharper.  The audio capturing is more clear than my JVC camcorder.5. Excellent low-light video capturing power.  Here is the best part, virtually all camcorders don't  capture good videos under low-light condition. This  camera is very good in video capturing under low light  condition. In a kid's birthday party, when all the light  is off, with only the few candle lights on the cake,  it still can capture good video. Pretty amazing....I do a lot of video shootings for my 4 and 3 years olddaughters. Instead of using my camcorder, I use thisFuji S7000 most of the time for video capturings.I highly recommend this camera for both photo shooting andvideo shooting.", "Date": "January 19, 2005"}, {"Title": "Review from a scrapbooking mom!", "Author": "Justine \"Scrapper Geek\"", "ReviewID": "R2VQRUFMLBJGFJ", "Overall": "5.0", "Content": "OK - I am not a \"camera-phile\".  I read all of the reviews by the more experienced camera users.  All very informative, but very technical.  From a \"regular mom\" consumer point of view, I wanted to add my comments.  I LOVE this camera.  The quality of pictures I am able to take is just fabulous.  I was reluctant to switch to digital, but now I wonder why.  The ability to manipulate photos of this quality has been great.  Often friends can't believe they are digital prints!  I've just been thrilled.  Initially, I was unwilling to spend this amount (remember, just a mom wanting to take family pics), but it really has been worth it.Thanks to Fujifilm for a great camera.", "Date": "April 5, 2005"}, {"Title": "Great Camera!", "Author": "covellite", "ReviewID": "R3M27Q1F1NNVB3", "Overall": "5.0", "Content": "As a photographer, I'm in the beginning to moderate range.  I bought the s7000 prior to a recent trip through Colorado and the Dakotas in September and October, and came back with several hundred photos.  I don't think I had really discovered photography until I sat at my computer and saw some of the great photos this camera produced. Everything appears to work well, although it is more complicated than the basic point and shoot stuff. The color photos are great and the built-in macro is killer. I purchased both the Olympus wide-angle and teleconverter lenses (as well as the Fuji adapter ring), and these complement the camera nicely. A couple sets of rechargeable batteries are a must if you take a lot photos like I did in the Rockies. Stick with the viewfinder as opposed to the LCD monitor to maximize battery life. My only real problem is that the auto/manual focus switch is easy to trip, sometimes resulting in out of focus shots if you're thinking you are in auto mode.  Otherwise, this camera ís very much right on and can deliver professional quality shots.  I'd say the s7000 will open up new dimensions for the beginning/intermediate photographer. I bought mine through Amazon.com, who usually offers up very competitve prices and is very reliable. Highly recommended camera.", "Date": "October 30, 2004"}, {"Title": "First \"real\" Digital Camera", "Author": "mistermetro \"sharp-shutter\"", "ReviewID": "R2EMKHAVQDWAND", "Overall": "5.0", "Content": "I Started about 5 years ago with Black and White photography.  That being my main forte I was looking for a good transition to digital.  I did massive amounts of research and landed upon the Super CCD Fuji.  The noise issue did give me some concern, however, dealing with film I feel it gives it a more realistic quality.  I can't wait till Fuji masters the Super CCD just think the octogonal constructions is way ahead of its time, perhaps too far.  However.  After using this little bugger for 3 weeks now I am in love with it.  The night capabilitys are amazing.  It says maximum sutter time is 15 seconds, but, with a release cable, it can stay open for hours.  It has \"B\" mode.  Awesome.  The macro cababilitys are also killer.  Now to get a shot that I can only get with film just use the manual override.  That way you have total control.  Sorry, I can't keep my hands off this little bugger.  Good luck on your research.", "Date": "May 3, 2004"}, {"Title": "A Brilliant Camera.", "Author": "I. Greenwood", "ReviewID": "RYMXCTKL3B4LR", "Overall": "5.0", "Content": "Quality, much better than I imagined. I was unsure about switching from 35m SLR film to digital but this little beauty has changed my way of thinking. The controls are very similar to an SLR. The results speak for themselves. I have used the camera now for about 6 months, taken over 500 shots. Taken it on holidays to Canada (3 weeks mostly cold 1 degree Cel and lots of snow. Shot mostly in Ap priority (as I used to with 35m) and it worked extremely well. I especially like the way Fuji have incoporated their film colour technology into the digital camera. The colours are brilliant. It's an easy camera to use if you are used to 35m SLR, but this camera is definitly not for beginners. Well done Fuji.ProblemsNo Problems as such but would love a DOF smaller than F8. I am used to F22 at least. A DOF preview button would be good also. I really miss that. Plus an ISO of less than 200 would be even better still. Low light is a little difficult to focus, but can easly set to manual focus.I can not understand why some reviewers say poor quality? All I can say to this is, you must be using it wrong.Great camera, go buy it.", "Date": "May 23, 2005"}, {"Title": "Hoooray!!  6 Months and Still LOVE the S7000", "Author": "K. Rosinbum \"\"chickentender\"\"", "ReviewID": "R1J2MZOZL3DR2M", "Overall": "5.0", "Content": "I owned the Finepix S3000 for a couple years before I purchased this model about 6 months ago in late June of '04. I was EXTREMELY fond of my old camera so Fujifilm is where I looked first. I briefly considered a Sony and a Canon Digital Rebel but settled on the S7000 based on great reviews and amazing price.\"Disappointed\" isn't even in my vocabulary!Excellent camera - it is my S3000 plus a whole net set of additional features: much faster shutter delay and focus, better lowlight shooting, fully manual settings, greater megapixel rating.The things rules. I rarely leave the house without the S7000.Hats off to Fuji, AGAIN!", "Date": "December 28, 2004"}, {"Title": "A Great Camera - Advanced Consumer", "Author": "Capt Kirk", "ReviewID": "RPW0SIKUNQW12", "Overall": "5.0", "Content": "This is my third digital camera the others are an early Olympus 2020 (2 Meg) and a Canon Elph (3 Meg - bought for the small size).  I had three SLR's over the years, and love taking photo's.  I looked for an upgraded camera to take on a boat charter to the Alaska Inside Passage this summer.  I did a lot of research and read the reviews.  I settled on the Fuji Finepix S7000 for a variety of reasons - the biggest being the ease of use (it holds and hefts like a SLR, so it comes naturally) and picture quality.  Others I looked at include the Canon Digital Rebel (not a lot of versatility in the stock lens), the Nikon 8700, and the SONY.  My criteria were something that got me 6 Meg (to get a good 8x10 print with some cropping), could do point and shoot as well as aperture, shutter or manual without a lot of fussing around, appeared to be well made and fit in a medium sized case.  Based on the reviews and the price, the S7000 was my choice.The camera is great, all and more than I expected it to be.  It takes great pictures, has a lot less shutter lag than my other two cameras, brilliant colors, little color fringing, and low battery drain.  Everything is well thought out and fits in your hand like a good SLR.  With a 512 MB XD card and a 512 CF card in the camera I was able to have over 600 pictures in the camera. It is a joy to use.Any limitations?  The wide angle is a 35 mm equivalent - a 28 would be nice indoors, but it has not bothered me yet.  There is a less range in ISO speeds than I would have liked.  But these have yet to have any impact on the quality of my pictures.I love the camera.  Any limitations now are those of the photographer.  To see what it can do, take a look at the Fuji enthusiats web site [...]I highly, highly recommend it.", "Date": "September 11, 2004"}, {"Title": "Awesome photos", "Author": "bm97", "ReviewID": "R3KY2EKRJTVGWW", "Overall": "5.0", "Content": "I have been getting amazing photographs with this camera. In just one trip to Mount Shasta, I got atleast thirty stunning shots with great realistic colors. Better than the best photos I got with a Canon G5 borrowed from a friend for a Cancun trip. I was even able to make 16\"x20\" posters out of some pictures. This camera excels at outdoor photography where colors and light are both rich (it does not have a snow mode though if you are thinking of taking it along for a ski trip). Menu controls are less than intuitive - for example you cannot access the megapixel resolution setting through the menu - you need to press a different button. The best feature in this camera has to be the speed. If you have used other digital cameras, you would have experienced the frustration of the \"moment\" slipping away while your camera takes its time responding to your pressing the button. Not this one - shot times are extremely fast, making even this bulky monster a near-natural fit in most photo situations. This is probably one of the fastest cameras out there. This camera takes AA batteries - which is great. I got myself a set of 8 rechargeables so I would have a fully charged backup set at all times.", "Date": "April 29, 2004"}, {"Title": "The best value...", "Author": null, "ReviewID": "R3A97HZGCSL2KG", "Overall": "5.0", "Content": "I have been using this camera extensively for the past week and I am liking it more and more. First things first, this is not for the casual point and shooter although with some fine tuning of settings it can also deliver good results in Auto. The camera shines best when in manual mode. The noise that reviewers talk about are non-existent in the prints I have made. This is mainly because these reviewers just examines the photos in their computer monitors. Naturally, it will exhibit noise because monitors are not the most faithful in showing the \"real picture\". In my case,  The photos are beautiful at a4 size printed from 6MP with sharpness tuned to \"soft\". To have full control I suggest shooting in 12MP raw, fine, and soft sharpness.  I have been so lucky so have so far all noise-free, vibrant and true to life images from this S7000. And the real kicker is that it cost way less than the competition.", "Date": "December 3, 2003"}, {"Title": "No battery drain", "Author": "Fred Williams", "ReviewID": "R1KDV3GVP9HA6Y", "Overall": "5.0", "Content": "I haven't seen any battery drain with the FinePix S7000 and use a CompactFlash card to store the images.Also when it arrived it was factory set at 1 Megapixel so you need to push the f button and change the quality setting to a higher level [I keep mine set at 6 Megapixel].At that setting it is very high resolution, I use images I take and use them as a background for my desktop PC and the colors are excellent.Overall a great camera, also the video setting works great, it has two settings, at 640 it lasts 1m48s and at 320 it lasts 3m34s with a 128 MB CompactFlash card.Also at 6MP it holds 83 frames with regular snapshots, and at 3MP it holds 164 frames on a 128 MB CompactFlash card.", "Date": "January 18, 2005"}, {"Title": "Very Nice", "Author": "Abhilash B. Vithlani \"AbhiJaiGuruDev\"", "ReviewID": "R1DSFT8UU5ZN01", "Overall": "5.0", "Content": "Okay I'll be honest. I am a complete amateur(for the moment) when it comes to cameras and all the jargon that is associated with them, but I must say that this baby does a really nice job of what it is supposed to do and that is to take good,high quality pictures. Tinkering around with the buttons for an hour or so will give you a general idea of what this camera is capable of. The only problem that I did face was that the memory card supplied with the camera is woefully inadequate for the kind of images that you would like to take with a camera of this calibre. All in all I am extremely pleased with my purchase.", "Date": "October 9, 2004"}, {"Title": "Perfect for the One Camera Family", "Author": "S. Newman \"29savoy\"", "ReviewID": "RNXZTL0N2GV0A", "Overall": "5.0", "Content": "This camera is a real money savor for a family that can only afford 1 camera!  Along with the F5000 (a real bargain now) this camera allows a user to learn photography from full auto to full manual without the high expense of film and processing.You don't even need a Video Camera!  The vast majority of video that I take of family and other cute stuff are very short in duration.  This camera does 30 frame per second (that means it's like TV, without any jerky movement or lost frames) and the clips are already fully digital and ready to transfer to computer or display to tape.  Put a lot of short clips together and you have the same thing you would get from a camcorder only it's all in one camera!Hot Shoe - One of the major plus' of this camera is the Hot Shoe.  Any digital camera without some way of putting on an external flash is really just a snapshot camera, no matter how much it costs!  The external flash means that when you take a photo of something like the inside of an old structure like a cathedral, etc, you get a beautiful photo that you could not get without the external flash!The quality of the photos in the S7000 is tremendous.  We stopped doing film photos a few years ago when a local processing company destroyed the only two rolls of a friends wedding back east.  Naturally, after that the memories of the trip were gone!  They only appologized and moved on!  With digital, we have never been disappointed.Both the S5000 and the S7000 are, in my mind, two PERFECT cameras for the typical family!  And a real money saver!  I especially like the little graphic in the viewfinder that reminds you that there might be some camera shake and to hold the camera steady!  Very cool camera!", "Date": "February 28, 2004"}, {"Title": "Still Good", "Author": "MeMark", "ReviewID": "RSK58VAX7P82N", "Overall": "5.0", "Content": "I'm an early adopter of digital cameras and have been progressively upgrading as the better technology becomes available at a reasonable price.  With my current iteration, I decided to get the best available (at a reasonable and depreciating price) that I could find.  I also looked at the many reviews, but went ahead a purchased this camera, mostly because of examples I found on review sits and my preference for Fujifilm digital cameras.The bottom line?  I've had this for about 7 months and still love it.  New digital SLRs are coming down to the reasonable price range lately and I have NO motivation to upgrade - I can imagine using this camera for years - and that says a lot for me.By the way, to correct one reviewer's comment regarding the video recording of this camera - it is NOT limited to 30 - 45 but the limit of your memory (compact flash/micro drive or xD), and the quality of the video is quite good - I use it as a substitute for my digital video camera more frequently than I use my video camera!", "Date": "November 30, 2004"}, {"Title": "Couldn't be Happier", "Author": "J. Battle \"jbattle\"", "ReviewID": "R3QDJSZ3E2WWPW", "Overall": "5.0", "Content": "I got this item as a gift for myself after a vast amount of research.  The other camera that I was looking at was the new Canon digital elph.  My mother ended up purchasing that one and I chose the fuji.  My previous camera was a canon digital elph, and I liked it very much.  That being said, this Fuji far exeeded my expectations in every way.  It is a lot bigger, so if you want small stick with canon; however, when comparing the same picture, from the same distance, in the same lighting my camera blew my mother's canon away in clarity.  The only complaint I have is that I wish it had a rechargeable lithium battery instead of taking double A's.  I do love the ability for dual media and I took a picture of a flower on macro only to find there was a bug on that flower that I couldn't even see.  I really love this camera and all my friends want one now.", "Date": "August 2, 2004"}, {"Title": "Lots of features and good performance.", "Author": "S Smyth", "ReviewID": "R1PG59EDCILI70", "Overall": "5.0", "Content": "I bought this as an upgrade to my Fine Pix 2400 compact and haven't been disappointed.The electronic viewfinder has a big and clear display ,with a useful grid feature you can switch on and off to help with composing pictures to the rule-of-thirds. The battery life seems to be reasonable, and the memory options with XD clips and micro-drive compatibility is welcome for taking lots of shots at the 6.3 megapixel maximum before software does its thing to generate 12 megapixel files., which I haven't bothered with.Colour saturation looks a lot cleaner than with the smaller 2.1 megapixel 2400, and the 6X optical zoom works well, but a tripod and a cable release is necessary to avoid blurring of distant detail. The self timer could be used instead of a cable release, but this option might be too slow for some users who use maximum zoom on a regular basis.Downloading via USB 2.0 is significantly quicker than with USB 1, even so, the purchase of the XD/ smartmedia reader would be a good choice, especially if you intend to use the 128MB and higher  XD clips.A collar can be fitted to the main lens ring, with which you can attach filters. A polariser would be a good addition for getting crisp shots under bright light conditions.This camera can also be used to shoot short videos, and be used as a webcam. Although the battery life is reasonable, purchasing the optional power supply would be a good idea, especially if you intend to be using the flash unit a lot.This is a good camera.", "Date": "July 7, 2004"}, {"Title": "Wonderful new Fuji  digital camera. Nov. 15, 2003", "Author": "Nicolae A. Popescu \"apopescu\"", "ReviewID": "R3HJM3QB3I2CBP", "Overall": "5.0", "Content": "Fuji Finepix S7000 is a wonderful camera by any comparison. I am in the digital photography since the beginning of it with a Kodak 640/480. I had many other cameras last of which was a Fuji Finepix 4900. This last model is a markedly improved one. I read most of the reviews about this camera. Some of them are critical in the respect of picture quality and some presented photographs to support this claim. I examined them carefully but I did not agree with the criticism. I did my own testing in any way I could and at any setting. I do not agree with previous reviewers who claimed that SOFT setting is better then NORMAL and that 6MP is better then 12MP setting. I suggest you should do your own testing. I also printed several photographs (2400/1200 printer) at full-page size and they appeared superb. I do not suggest that you should rash and buy this camera, but I do suggest that you should include it in your options, as it is indeed one of the best in its class.", "Date": "November 15, 2003"}, {"Title": "I love it!", "Author": "PeoplePhobic", "ReviewID": "RTJGGQ4E87RVN", "Overall": "5.0", "Content": "This is the best camera you will find for under five hundred dollars.  I just spent all day taking pictures with it and I'm totally blown away by this camera's performance.Someone said that it doesn't autofocus enough but only one of the 200+ pictures I took today was out of focus.The camera is a little awkward to hold.  I almost always use a tripod anyway so that's a non-issue with me.Switching picture quality is really fast and simple.It's nice to be able to switch from the EYF to LCD screen with one button.The zoom is fast.It runs on AA batteries instead of a pack.  I ran out of juice today but I was able to canabalize the AAs from my MP3 player.  This made me realize how much better it is to just use common battery types instead of an expensive pack.The camera wrote to my xD picture card REALLY fast even on the higher quality settings.  This is probably more to the camera's credit than the card's but I love those little cards.  They're so tiny, I feel like I'm on star trek when I use them.It took exellent pictures!  Way better than my old kodak.It's auto mode is great for a beginner and its manual modes and settings would make it great for a back-up camera for a professional.Anyway, I'm very pleased with it.  It was fast to set up my shots, it wrote to the card fast, the pictues look good.** I would reccomend that you get a tripod or at least a monopod though since it lacks image stabilization. **:) I'm very happy with it.  :)", "Date": "September 21, 2004"}, {"Title": "Finest 6.3 Mpx Point  & Shoot on The Market - 4.5 Stars", "Author": "Uncle_Audio", "ReviewID": "R3BHRNNSHOF6Q3", "Overall": "4.0", "Content": "I must say I have been totally pleased with the purchase of the S7000 camera. I owned a Fujifilm 6900Z prior to acquiring this camera and have found the S7000 to be a world apart in difference (much better). Utilizing the excellent digital media format (xD) or the older Microdrive/Compact Flash I or II media. Slots are provided for both. The range of shutter/flash settings provided are capable of all that you'll ever need and even a threaded cable release shutter-release button for time exposures. All though the lens' zoom controls are now on the back right-side panel of the camera they are a little less intuitive in this location and a little more cumbersome. The learning curve is a little steeper with these zoom controls at least as to placement of the controls. One control any photographer should learn about right away is the exposure/focus lock button, although the auto-focus feature works extremely well, a slight movement of the camera will change the point of focus rather quickly. So, knowledge of the exposure lock control is fairly important. Also, you will need to keep the exposure lock button depressed until the shutter release button has been depressed and the image begins recording. This is a minor drawback and inconvenience and Fuji should have created a simple \"on\" lock for depressing the button and an \"off\" mode if pressed again. In addition, the manual focus setting appears to be pretty worthless as the focus mechanism struggles to update the focus point inside the viewfinder rapidly. This makes knowledge of the use of the exposure lock button with the auto-focus feature even more important. Understanding White Balance is also key with this camera. Relying on any camera's auto white balance feature, means a lot more post processing correction. Custom White Balance with S7000 is a breeze using the back side of a 18% Gray card (it's white)! Read up on this feature before heading out into the field and relying solely on the camera's interpretation. A major plus with this camera is the capability to do all image processing outside of the camera with a PC or MAC. This camera offers the RAW CCD sensor format solely for post processing work (image processed outside the camera). Images range from about 12-13Mb per image. So definitely obtain a 1Gb xD or Compact Flash storage card if you want to work a lot in this particular format. Rechargeable NiMH batteries are a must for this camera unless you own stock in EverReady or Energizer. Although, power management is extremely good even if you like to preview your images a lot? You will find you'll need to end up turning the camera on and off a lot if you're using a timer for the power management. I have always set mine to \"off\". Also splurge on the exorbitantly priced AC Adapter or buy one used online. If you decide to let the camera process images, you will get some extremely good color results at the highest JPEG settings (6.3 Mega-pixel actual and 12.1 mega-pixels interpolated). This is probably the easiest and best setting for most people who don't want to process every image outside the camera on a computer. I never use the video capabilities on this camera although they are quite good, only limited by your memory card capacity (I'd say go for the Hitachi 2Gb Microdrive if you plan on using this for video) I believe if you want to shoot video though, you should buy a video camera. This camera is too capable for still image creation to utilize as a video camera solely. I found this camera to be one of the finest semi-pro point-and-shoot cameras on the market for the dollar. This model incorporates top notch optics and superior low noise, and in-camera processing (JPEG) when utilized. This is an easy camera to recommend for an advanced user and someone who is already familiar with basic photographic exposure principles and color temperature. It will be a challenging camera for someone who is just beginning to come to terms with photographic principles however. I am a professional photographer who also uses the Fuji S2 and S3 Pro SLR digital cameras where a multitude of lenses might be required. So, I have a pretty thorough understanding of the most of the Fuji lineup from recent years.", "Date": "September 16, 2006"}, {"Title": "Love this camera", "Author": "H. C. Forehand", "ReviewID": "R1P29L0AGACS9W", "Overall": "5.0", "Content": "I was originally looking for a full SLR digital camera but after reading what the S7000 could do I decided to take a chance and pocket the extra $600-$1000 for the Canon or Olympus. I have not been disappointed. The image quality is superb, the features are great, the battery life has been very good, its durable, its not as heavy/sturdy as the Digital EOS for instance but it doesn't feel like a toy either. You can run the gamut from full manual to full auto to adjust to your situation. It also takes both Compact Flash and new XD cards which was a selling point being taht I already had 2 big CF's. The optics are great and while you don't have the lens flexability of a true SLR there are attachments that can get you closer. (...)", "Date": "October 13, 2004"}, {"Title": "Best Camera Out for the Price", "Author": "Christopher Shaw", "ReviewID": "R1KAVBOWRLTX6", "Overall": "5.0", "Content": "I bought this camera in september of 04 and am very pleased with the results. The image quality is sharp and the picture can be blown up without distortion. It looks and feels like an SLR although I was expecting the auto focus to be quicker. I also bought the 256mb compact-flash card and I get a little over 50 pictures in 12mp mode so I would definitely buy a memory card. I am now using it for my sister's senior pictures and am very particular about my photos. This camera excedes expectations. If you want a great camera for a great price, I would no doubt by this camera.", "Date": "October 4, 2004"}, {"Title": "An Excellent Pro/Novice Digital Camera", "Author": "James W. Ricci Jr.", "ReviewID": "R1S60OOBG5N5DY", "Overall": "5.0", "Content": "I did a lot of research for my big move from the original HP 1 megapixel digital camera I have had for the last 3 years.  I wanted to purchase a camera that placed me close to my old SLR Film days and the Fuji S7000 is that camera and a whole lot more.I looked closely at products from Canon, Pentax, HP, and Nikon and found that dollar for dollar, the Fuji S7000 was an excellent choice.  The pictures that this camera takes are incredable to say the least.  I took pictures from 2 Meg up to the 12 Meg and also using the RAW settings, and the color saturation and clarity are awesome.  Obviously the best shots are at the 6 Meg level, but what range you have!  Wow!  Also, the Macro and Super Macro settings are a lot of fun and get the minute details that you really want with close up shots.Lastly, I have not run into any of the problems that I have read in a few of the prior reviews, ie. the battery drain from the CF Media or noise on film (I even tried the shot with the lens cap on and no lines (noise) recorded!) I did buy a double set of good quality rechargable batteries and have taken a lot of shots with no problems.  Buy it quick and (...) it's an even better buy!!!I love this camera and look forward to many years of fantastic photos!", "Date": "June 23, 2004"}, {"Title": "This is the camera DADS need to get", "Author": "Eric C. Morin \"ericmorin2\"", "ReviewID": "R2XQPDCI71OV44", "Overall": "5.0", "Content": "Not just dads, but anyone not wanting to lug around a camcorder with their digital camera.I researched like crazy on what camera to buy, wanting good resolution and more importantly video capture. It came down to these cameras, the Canon S50, Fuji F700. Fuji S5000 and S7000S50 has best picture, small, but not good zoom, doesn't take standard batteries, and the video capture is only half-rez and limited to 3-mintue max sizes.The F700 is small like the s50, taked great video (full rez, as long as you want), but it doesn't use standard batteries, only does 3MP pictures and only takes the more espensive XD cards..Then I found the S500 which does 3MP, good zoom, but only takes half-rez video and requires XD card..But... the S7000 seems to have everything i wanted for around the same price..It takes standard AA batters (and rechargables too)Taes XDcard AND Compact Flash/Microdrive storageHas 6X zoom.Super-macro mode,Continuous burst shooting.takes 6MP pictures natively (12MP possible too)and takes full-rez video ad 60FPS for as much storage you have.... sold.I was going to only spend $300 total, but with the $100 rebate, the s700  really became worthwhile.The camera takes AWESOME outside pictures.. a bit noisy indoors, but the flash makes it work great indoors..Okay, a quick comment to the people that say a digital camera isn't good for capturing video for life's moments.. like recording your child's school play etc/...You might use a camcrder to capture 90-minutes of video.. but really, you gonna watch that full 90-minutes at a later time? no, youre gonna edit, fastforward or whatever just to get to the part you want to watch which will probably be like 10 minutes tops.", "Date": "March 15, 2004"}, {"Title": "Get it, you won't buy another....ever!", "Author": "RUSH", "ReviewID": "R332C6KJK893QE", "Overall": "5.0", "Content": "I have owned Fuji Finepix 3800, some junkie Sony, Fuji Finepix E550, Canon Digital Rebel XT and this one. Guess which one is left standing. I have bought, sold and returned all of these cameras including the S7000. I then came back to my baby. It will take a heck of a camera to replace this one. I think I'll keep this one for ever and maybe get a second one as technology advances. You won't be sorry.", "Date": "August 4, 2005"}, {"Title": "My S7000 Photo`s", "Author": "Mr. Nigel Ritchie \"http://homepage.ntlworld.c...", "ReviewID": "R28KDETY54N0IN", "Overall": "5.0", "Content": "I think this is one on the best camera`a that I`ve used for simplicity, not being a pro I have found that the pictures that I have taken for my website ( [...] ) prove what quality photo`s can be taken on this camera. I think you`ll be amazing at the quality, especially the night shots taken from the top of the Empire State Building and Time Square in New York.. Its a brilliant camera for a learner and will give you confidence to follow it up with a more interesting look at photography..Well worth a loook..", "Date": "August 7, 2005"}, {"Title": "Fujifilm FinePix S7000 has big improvement from the S602Z", "Author": null, "ReviewID": "R1AYSQ4WKGGR50", "Overall": "5.0", "Content": "Dear all, After a week of diagnostic and test-out the new Fujifilm FinePix S7000,it has big improvement from the S602Z with so many cool features.It worths the upgrade. ============================================== Pros of S7000 : 00. 6 mega pixel effective 4G Super CCD.01. Battery life increases.02. Faster handling and performance.03. Better AutoFocus in dark area.04. Better buffer handling on saving pictures.05. Power management and stand-by mode.06. F button switching to photo mode.07. DROF and Exif compliant.08. USB 2.0 support.09. Cable Shutter release support.10. Simplified Chinese as language for operation menu.11. Color is more detail. - in landscape for both near and far objects, 4G SuperCCD do a better job.12. Multiple Exposure mode.13. CCD-RAW Mode support (12 megabyte), recommended 6 MP Native mode JPEG (1.7 megabyte).14. Super pixel detail in 12 MP Fine mode JPEG with firmware sharpening.15. 640x480 vivid VGA movie mode that record AVI until memory card full.16. Proudly made in Tokyo Japan/Fujifilm.============================================== Cons of S7000 : 00. Over-agressive decompression on 12 MP Normal mode, created noise.01. RAW conversion software is a plugin to finepix viewer, instead of a standalone application.02. RAF format is proprietary for s7000 with its own header, not compatible with Fuji S2 Pro.03. Lack 24bit Tiff format in firmware storage format.04. F button can be confusing, needs to be accustomed to.05. Low light operation is still not perfect, but improved from S602Z.06. Need the new F700 \"Green Light\" assisted AF illuminator.07. Would be nice to have a REAL optic image view finder.08. Missing ISO 1600 for Manual mode, or 1 mega byte Auto mode09. Software provided does not have nice menu, everything is in HELP directory in HTML format.10. Need the S2Pro Hyper Utility EX or similar to ship with S7000 that can be standalone  and adjust all the image properties BEFORE converting.11. Does support FAT32, meaning 2GB CFII is the maximum size supported. I already send all my concerns to Fuji support, if you have similar concern feel free to voice themto fuji since fuji is not a company not listening as my experience. I recommend this Proconsumer Digital Camera which has a nice-grab, sturdy body, super fast startup+performance,and professional features to all Digital Camera lovers, and it will serve you well,and take photo that match the professional level camera with price 1k to 2k. Please start this discussion group so all owners of s7000 can discuss about this camera here,always thanks DAVE for his site and providing a space for us here. PS : I already get the command line set of tools to perfectlyconvert S7000 CCD-RAW format with higher resolution...", "Date": "November 18, 2003"}, {"Title": "Excellent Image Quality at a Relatively Bargain Price", "Author": "Mad Dog \"maddog6969\"", "ReviewID": "R7HN6P5N2I7ND", "Overall": "5.0", "Content": "Actually, 4.5 stars.I only had a little time to run the S7000 through its paces, but that was enough to see that for a camera that can be had for $700, it is a price-point bargain.  It's not perfect, and I'll give a couple of examples, but overall, I'd give it very high marks.On the plus side, the 6x optical zoom lens is of excellent quality and the autofocus system works very well.  The focus and exposure electronics seemed to be faster than most, thus there is less of the notorius \"digital lag\".  If you capture images in the least-compressed modes, you will get excellent results considering that the CCD is \"only\" 6 MP.  This thing, at its best, rivals my 8MP Sony.On the minus side, the S700 does not have continuous autofocus, so it that's a priority, you will find it lacking.  Also, I found the exposure of close-range flash pictures to be poor and beyond the range of compensation.  Aside from those caveats, this is a very fine device at a very reasonable price.", "Date": "March 18, 2004"}, {"Title": "Great Quality at Moderate Price", "Author": null, "ReviewID": "R2HPNXKVZZMTH3", "Overall": "5.0", "Content": "Go for it. I purchased 3 weeks back, taken 1200 snaps. Most of them superb. I am no expert ( used a 1.3 mp for some time), but I am sure, I will grow with this one. The Auto mode is decent. Even 3 MP pics  in Auto are excellent unless u r looking for massive prints. Macro/Close Up mode is grrreat! Hope this works ok, and then I will really have a nice time.The Good News : Any Novice can easily use it and churn out great photos.However, get at least 256 Mb if not 256 in both slots. Forget Movie Mode, though it is clear, takes too much memory. Contrary to Review, the Battery lasts long enough. Get a rechargable in course of time. Also, think of a Bag to carry it around. It is quite big, bigger than my Sony TRV 19 MINIDV.Worry : Why are prices falling fast ? I got for 590 less 100 mail in fr Fuji ( yet to get rebate).Now rebate is gone, but Amazon sells for 499. Buydig gives for below 450!!! What is Fuji upto?As an user, I have to give it 5 Star. Its good, budd. Happy times!!!", "Date": "July 16, 2004"}, {"Title": "Fantastic quality - excellent price", "Author": null, "ReviewID": "REXKHH4I3EDUN", "Overall": "5.0", "Content": "This is a superb camera. It has SLR-like capabilities and quality that you just don't find with similarly priced Nikons and Cannons.I completely disagree with the other reviews that complain about focusing problems indoors. Those reviewers obviously don't know how to use the built in flash properly. It has a variety of intensity settings that allow you to take sharp, beautiful indoor pictures. I've had the camera for a month and after about 1000 pictures, this Fuji is a clear winner. Highly recommended.", "Date": "January 11, 2004"}, {"Title": "Photos with unbelievable clarity at large sizes", "Author": null, "ReviewID": "R3QQPU2BODJIRA", "Overall": "5.0", "Content": "A friend of mine went shooting in the woods for some wildlife shots. He eventually printed 6 of his best shots commercially to 36\"X40\" prints. I was stunned by the clarity and picture quality of the output at this huge size. My Sony F717 eventually became wimpy compared to the prints of the S7000 especially in bigger sizes. The sony is good up to 8X10 but higher than that it becomes noticeably noisy. Not good. I am so amaze that am about to sell my F717 in ebay and buying a fuji S7000 myself but everywhere I go it is on back-order. Apparently Fuji cannot keep up with the demands. I need this before the holidays. Please...", "Date": "December 6, 2003"}, {"Title": "Again, Fujifilm's Another Beauty!", "Author": "L. Yang \"sfobeach\"", "ReviewID": "R29SDXFENG88BI", "Overall": "5.0", "Content": "This is the best digital camera I got so far. The photos came out beautifully with sharp focus, brilliant and balanced color (no any color casting as one reviewer stated). Resolution is exellent. Even at 3 MP, it beats all competitors, like Olympus, Nikon, HP, Kodak etc. It's the only digital camera came with a shutter cable release which is incrediblly important for taking pictures at night or under dim light when a tripod is used. Its Raw Mode gives almost noise-free photo, as good as you can possibly get.  For the price of $$$, it's a very good deal. It's basically a SLR with many nice features. its value is a way more than the price. I tested the shooting modes of P, SP, M, S, A, all were very satisfactory. The night view photo came out very good. I like its manual focus, too.  I wish it were 10X zoom.  Overall, I love this camera. I give it 5 stars!", "Date": "November 9, 2003"}, {"Title": "Batteries????", "Author": "D. Dixey \"1967 Tempest\"", "ReviewID": "R2JKPZHBLKBK92", "Overall": "5.0", "Content": "I have had GREAT LUCK with the Energizer e2 LITHIUM AA's.  They cost around 12$ for 8, but I went through 600 pictures w/flash and they are still going.  I have heard many people complain that the Fuji S7000 draws batteries, and these are great!!!..  Rechargables dont even come close!!!", "Date": "August 3, 2005"}, {"Title": "AN AWESOME CAMERA!!", "Author": "GK \"teacher753\"", "ReviewID": "R1DJYV3NTGLN1X", "Overall": "5.0", "Content": "I am \"in love\" with this camera! I have NO COMPLAINTS whatsoever about it, except maybe for the fact that the neck strap is in the way of my hands, but that's CERTAINLY not a reason for not buying this camera! The results of the pictures are absolutely beautiful, even at the lowest setting. It has a LOT of bells and whistles--for the photo-tech--and enough automatic functions to make a novice happy! I can't say enough about this camera. I am overjoyed that I now own such. The pictures are beautiful both on-screen and printed out. You WON'T be disappointed in purchasing this one.", "Date": "June 19, 2004"}, {"Title": "A light camera for the quality", "Author": null, "ReviewID": "R2Y5NX3QNPMBV9", "Overall": "5.0", "Content": "I own the Olympus E-20. The Fujifilm S7000 is half the weight at half the cost and a lot better camera. I'm very happy with it, though i've only owned it for 17 days. Very sharp lens. It's like someone took the time to figure out what was wrong with most top line digitals, and made it right. I own another Fuji (i wish the'd drop the \"film\" part of their name, it confuses people) and i've noticed that they are designed very well and are user friendly.", "Date": "November 17, 2003"}, {"Title": "Professional", "Author": "Jonathan J. Swinton \"jjswinton\"", "ReviewID": "R1910ZV1P7SJ49", "Overall": "5.0", "Content": "I own two photography companies.  I purchased this camera because of its incredible price.  The quality is amazing.  I would recommend it to any professional or novice.  Very easy to use.  I love the manual settings as well.A must buy!", "Date": "September 30, 2004"}, {"Title": "The Best Digital Camera Out there", "Author": "A reader", "ReviewID": "RQT9Z19QXBSBI", "Overall": "5.0", "Content": "When I was doing my research I was between this one and the Canon G5. I honestly went for this one because I found it chepear and I don't regret it at all. The picture quality is incredible and that was what I was most concern about. If you have a good printer (I have the HP psc 2210), you would be amazed with the results.The LCD of the camera is above and beyond anything I have seen. The camera is easy to use. And it has more settings than the average user will ever need; hey that's a plus ;-)I was able to take pictures of the Grand Cannon from the airplane and these pictures came out pretty good.Anyway, I highly recommend this camera.", "Date": "March 30, 2004"}, {"Title": "it's good!!!", "Author": null, "ReviewID": "R5E9MAG4BHNOY", "Overall": "5.0", "Content": "i would say if u like to play with close-ups or want a camera that has fantastic macro and supermacro abbilities, then you found the right one.the view finder is great.you dont even want to use the screen with such a good view finder!the only thing that this camera has that gets on my nerves is that it doesnttake good fotos with mooving objects.like if u want to take photo of kid you have to use shutter speed priority, otherwise it's out of focuss.also the video shooting thing is fantastic!if u want a good quality camera and u r not afraid to use shutter speed button take this one.oh!it's better to have 512MB card.and also what is great is the 'delete' button!works great!saves you lot of space on card if u want to get just rid from some photos in easy way.(it lets you also to restore the photos though)", "Date": "January 23, 2004"}, {"Title": "another one on the well-deserved bandwagon", "Author": "Ray-man", "ReviewID": "R2PMZ4045IMM3E", "Overall": "5.0", "Content": "The Fuji S7000 doesn't disappoint! I have used this camera for about 3-4 years and am still using it. If there is one camera you need to take with you in a hurry for any photography situation, this could be the one. The 6x optical zoom is more than competent for about 95 percent of most pictures, and if you need more then you can bump up the added 3.2x digital zoom (total 19x zoom). With this camera you can put in two memory cards at the same time (CF and xd), but of course it will read/write to only one at a time that you choose. But this gives you automatic backup, just switch to the other card if your primary card is full! Also, it shoots 30 fps video, so it's a good idea to get as big and as fast a memory card that you can. In the macro mode it can get as close as ½-inch, and I have taken many awesome close-ups! The built-in flash also has a rated range of nearly 28 feet at wide angle and 26 feet at telephoto! And it has a hot shoe so you can add a more powerful flash if you wish, if you needed it. I did have a disappointment with it in that because the lens is an external zoom (the lens zooms outward), it is not possible to attach a lens filter to the front of the lens. (When the lens is retracted, it is possible to attach a 55 mm filter, but then the camera won't operate because the lens can't pop out when the camera is turned on.) I believe Fuji sells an accessory tube that can be attached which is longer than the extended lens to allow the use of filters. (I was brought up on film SLRs, where every lens had a UV or haze filter to protect the lens.) Another quirk, which is a \"good thing,\" is that this camera will shut itself down when battery power is low. It happened to me, but all I had to do was restart the camera, and it will continue to take pictures (and then shut down again). I know I am writing this review late, since the camera is already officially discontinued, but I happened to browse this site, and was impressed that the camera has such high rankings and such a loyal user base.", "Date": "June 22, 2007"}, {"Title": "Awesome camera - if you love photography, you will love this!", "Author": "S. Shah \"desi101\"", "ReviewID": "R32LKQ20QY6UT4", "Overall": "5.0", "Content": "This is an awesome camera. One of my great investment ever! I had bought it from Sears as closeout model for under $[...].I own this camera for more than 1.5 years now - just never got a chance to write review on it. I am not a professional cameraman but I love taking pictures. And any give time, pictures taken from this camera just come out great. All of my friends & co-workers always envy my camera. I ended up buying the same camera for my brother too. ;)When I originally bought the camera, 6.3MP was a lot for most of the people. Now you can even find 7MP camera. Most of the time I actually take picture with 3MP but they still 100 times better than regular 3-4MP cameras. I have taken some great skyline pictures in the night with this camera too. My advice will be to get 1GB SD memory card along with this camera so you don't need to worry about any space issue.The only pictures I don't like with this camera are fast activity picture and the one mainly in low light. I just find the speed slow that it's not able to take very good pictures. For that I use, small point & shoot digital camera. But with this small disadvantage this is still an awesome camera and so I am giving 5 stars!", "Date": "October 11, 2006"}, {"Title": "Fantastic Video Capture", "Author": "Aimee Woods", "ReviewID": "R2CBWNMRNU7321", "Overall": "5.0", "Content": "The best thing about this camera has to be its video capture (with sound).  You can only record about 30 - 45 seconds at a time, but the resolution is unbelievably clear!  Better than our digital camcorder and very easy to upload to your hard-drive.  We are really impressed with this product, which we have owned for 6 months now.  A great buy!!!", "Date": "November 3, 2004"}, {"Title": "Fuji got it right S7000 outstanding!", "Author": "bobann@netscape.net", "ReviewID": "R3S6ZLPRQOZEW9", "Overall": "5.0", "Content": "Great camera with all the extras. Also own 35mm Pentax LX. This is my first digital camera and I followed the rating by What Digital Camera. Found it to be just as reported. Learning cure probably two weeks and 200 pics.", "Date": "January 23, 2004"}, {"Title": "Very good Camera", "Author": "J. Sin Whai Leong \"Sin\"", "ReviewID": "R1FDJR8K5K4JRP", "Overall": "4.0", "Content": "i've had a 1.3mp olympus digital for some time now and went to this camera.If you're into the basics of photos (point and shoot)This camera has that with very good results.If you think that 6mp is over kill. Think of your last vacation photos can you really blow that up.Now ever wonder what your shot could have been like if you could just change something to make the pic look just the way you want.Welcome to moreand enjoypsbuy Rechargeables", "Date": "August 19, 2004"}, {"Title": "A BIG improvement over S602 model", "Author": "Thomas Pierno", "ReviewID": "R2QD6XWP232K3M", "Overall": "5.0", "Content": "Having owned the Fuji Finepix S602, I recommended to two colleagues they consider it's next generation S7000. Both decided to buy it after examining and briefly using my S602. When I got a chance to play around one of theirs, I was immediately impressed with how much more responsive the S7000 autofocus was and how incredibly crisp it's shots were even in low light condition. On top of that the latency between shots was much better that the S602. The only thing I seem to dislike a bit is the autofocus mechanism which appears much noisier than its predesessor. I can hear it operating and making faint clicks all the time. I had my S602 for 2 years, loved using it, but disliked its low light performance. I managed to sell it and get the S7000 (...). Aside from the cost of the new XD card I needed to buy it is a GREAT deal, and I get new warranty to boot! A no-brainer purchase.The sturdiness of the S602 continues with the S7000. It is rock solid and comfortable in my hand. It is not comfortable for my wife however who prefers her own pocket sized Gateway 5.25 mp camera.Keep in mind that this Fuji camera feels much like a small 35mm camera and can be something that gets a bit tiring to lug around your neck. That said, I would rather carry it and have the ability to takes photos that are really outstanding with the Fuji S7000 camera. It captures images of stunning clarity and color better than all other digicams I have had the occassion to use or test except the Sony DSC F828 8mp unit. Considering the delta in price ($350 or more) the Fuji really stands out as the clear bargain and a pretty capable one also. Though not perfect it scratches enough itches to satisfy this casual photo taker.Many have underscored the issue of distorion caused by the firmware compression but I have not noticed anything objectionable so far. All 400+/- pictures I have taken are more than acceptable in that performance critereon. A new button near the 1.8\" display makes resolution adjustments much easier than the prior model. Adjustments can be made in 1/4 the time. Great idea Fuji!. The only feedback of a negative nature on the menu system is in the means of performing a memory format. In the S602 it was very easy to do, in the S7000 it is now buried in a different menu and a bit more difficult to perform. This is a pretty minor issue however.All in all I believe anyone wanting one of the better digicams out there for considerably less than those High End Big names, walks away with a fine camera and hundreds to spend on other 'toys'!", "Date": "June 26, 2004"}, {"Title": "This FUJI ROCKS !!!!!!", "Author": "joeboxer22 \"j rock\"", "ReviewID": "R1Y48OVGL5XMSO", "Overall": "5.0", "Content": "My previous camera was a canon g2 which was an excellent camera so I was hesitant to try a fuji but after reading the great reviews I decided to try it. Got the S7000 on ebay for 275.00 with 512 memory card. I have to say this camera is amazing using the 6mp mode, I mean its no professional camera but the average user like myself will be blown away at the results. I beleive the picture quality is due to the focusing of the camera which is excellent and fast. If you are considering the s9000 or the s5200, save some money and get a s7000, you wont be sorry!", "Date": "July 21, 2006"}, {"Title": "Great Camera", "Author": "G. Niemi", "ReviewID": "R2VGRF7OO4L5CZ", "Overall": "5.0", "Content": "I don't want to bore you with this-n-that and what this camera does and it's shortfalls.  In short, it's a great camera.  I've had it for a couple of years now and have shot a little more than 13,000 photos.  In short, this camera has been outstanding.  Four months ago I bought a Canon EOS 30D (8 MP) thinking that I could improve my photos (I also needed a camera where I could change lenses).  But I was dead wrong in my thinking.  The Fuji S7000 out shoots it!  I know that may sound funny especially when you read all the kudos by professionals in the various photo magazines toward the 30D.  I know.  Who am I to say they're wrong.  I spent one afternoon shooting the same scene with both cameras.  Both cameras were set on a tripod to make everything equal.  Later that evening I printed eight pictures shot with the S7000 and with the 30D.  I took them to work and asked several people to tell which pictures they thought were the better.  In each case they all picked the ones shot with the S7000.  They were just a bit sharper.  The smaller details were clearer.  The Canon does have some nice features, but when you spend $1400 on a camera that has a higher MP rating you would expect it to produce a better picture.  Against the S7000 it loses.  Especially when you consider the price.I got my start in photography in the mid 1950's in Japan and haven't stopped.  I've had pictures published in magazines and books.  I grew up with 35mm and 2-1/4.  I can tell you without reservation that this is as good as any of the 35mm's that I own.  And a couple of those 35mm cameras are professional grade.  Now it's great to come home after a day's shooting and download everything into my computer in a few moments.  No more standing around waiting for things to develop and no more breathing chemicals.  No more washing prints and drying.  I just sit at the computer and produce pictures as good as anything I've ever shot.I seriously doubt that you'll find a camera that does everything you want and to the degree you want it.  Take a chance!  The S7000 will not disappoint you.  Believe me this is an outstanding camera!!", "Date": "July 21, 2004"}, {"Title": "Reliable and a great value", "Author": "H. Roark", "ReviewID": "R3CR5HZKLII0ZW", "Overall": "5.0", "Content": "I've now taken this camera through four years of hard use and it has been terrific. It's been dragged through dusty back roads of Mexico and to snow covered New England mountain tops. Take the time to learn how to take advantage of the control it offers.  It provides the power and flexibility of an SLR digital and the convienence of a point and shoot. The zoom and lens optics are impressive.  I can highly recommend the S7000 for someone wanting a more serious digital at a great value.", "Date": "June 8, 2007"}, {"Title": "A classic already!", "Author": "Ellie \"Eilean Siar\"", "ReviewID": "R1GIYX0YGD3QGC", "Overall": "5.0", "Content": "The fact that this Fuji Finepix S7000 came out nearly four years ago and is still so highly regarded give one an idea of its good qualities. It is ergonomic - the fingers and thumb find the zoom, AE lock, flash, exposure compensation, viewfinder/LCD toggle without much struggle. The viewfinder is excellent - detailed and has as much info as you could want.It eats up standard AA batteries, so get some NiCads, NiMetalhydride, or some other type of rechargeable.But they are a good point - available everywhere. I have read that the early models produced have had the problem of the CF card running down the four AA batteries when the CF card is left in the camera between shoots. So, it is a good practice to remove the CF card after using it (it is menu selected as to using the CF or the Fuji xD card). Otherwise you will pick up the camera one day with the CF card in it and find the batteries drained.Later production may not have this problem. The camera was designed to use the IBM mini disk card, not the standard CF card. But it does, with reservations. For example, I could  not get video do upload to Picassa from the CF card. Photos uploaded OK.I have been astounded at the quality of the images shot at the highest resolution, written to the CF or xD card as 12 megapixel images. The lens, even racked out to maximum telephoto is tack sharp and contrasty. I've used many cameras in my life and this is a favorite. For the amount of money you can get one of these new or used, you can't go wrong. It is a winner.It also does 30 fps VGA video with the highest quality I've seen so far. Also, although it doesn't seem to have an image stabilization system, I have been amazed how little the images deteriorate due to low shutter speeds or normal camera shake. Maybe it uses a 'stealth' stabilization! Anyhow, I love it and have rediscovered the joy of photography through finding how much I could do with this beauty.Recommended.", "Date": "May 5, 2007"}, {"Title": "great camera", "Author": "bobann@netscape.net", "ReviewID": "R3MQOVJ9LMD0X", "Overall": "5.0", "Content": "found the review in WHAT DIGITAL CAMERA To be right on the money this camera has a full line of features learning curve probably two weeks and 200 pics.", "Date": "January 23, 2004"}, {"Title": "Takes pictures too slow- Poor customer service", "Author": "D. Durkee", "ReviewID": "ROFGUEK4XHH5X", "Overall": "2.0", "Content": "I got this camera to take pictures of school events.  The quality of outdoors posed pictures are great, but it takes pictures TOO slow.  I have not seen this problem anywhere on the web, so I sent it back. Fuji told me the camera was fine.  I have since had a professional take a look at it and they think I got a lemon.  Other problems include: the camera turns itself off in the middle of shooting lots of pictures (power saver is turned off), and images appear blurry in the view finder (but appear ok when I take the picture).  Good luck on finding one that works, because the company will not take care of you.  I gave it a 2 star because of the customer support.", "Date": "October 7, 2006"}, {"Title": "Great camera for the dough!!!!", "Author": "T. S. C.", "ReviewID": "R1AUVFZ40MVIGB", "Overall": "5.0", "Content": "I bought this after upgrading from the Fuji finepix A405, which itself was a cracking little camera! Well, the s7000 is a lightyear from that, and already I have taken some great, extremely atmospheric, and crystal clear shots, in all kinds of conditions. The picture quality is absolutely superb, and for £300 you are getting a camera that could be used for even total professional shots.There are a few points I could take with it: The technical side could have been made a little better, such as an open bulb setting for example, and you DO need rechargeable batteries with it, but these niggles aside, the camera takes brilliant shots, is easy to get used to, and within a few weeks you will be taking great shots, within days taking good shots. I feel that this camera will push me towards a more professional approach, and I can't wait to see the next level of Fuji camera, whenever that is!Highly recommended!!!", "Date": "July 3, 2013"}, {"Title": "Replaced my original FinePix", "Author": "BarbaraJ", "ReviewID": "RVUJ65A7H1QQF", "Overall": "5.0", "Content": "Purchasing this Fujifilm FinePix was a great solution for my husband.  His original camera, identical to this one, was in need of repair which would have cost more than purchasing this camera.  It arrived promptly in original packaging and it works great.  He is 81 years old and had no desire to attempt to get used to a new camera, so this was a perfect fit for him. He is thankful to have a working camera again.", "Date": "January 28, 2013"}, {"Title": "A Very Good Starter Digital Camera", "Author": "D. Denny", "ReviewID": "R1QOFWLJU28RA8", "Overall": "4.0", "Content": "I own two S7000's. My review is simple. I purchased my first S7000 new in 2004. It served me well as my first digital camera. I love the way it takes excellent macro pics. It is hard on batteries and I quickly learned that lithium batteries were the only thing that would last for long. My biggest challenge with this camera is the delay between the time you press the button to capture your image vs. the time the image is actually taken. With the slight delay, I had to work and practice a lot to capture images at the exact time I wanted them. This was especially important to me when shooting pics of my family playing sports. Several snap-on attachments I acquired for the lens seemed to be a waste of time and money. I am especially fond of the fact that you have the option to use a view finder or the small monitor on the back of the camera to frame your shots. With my vision being slightly less than perfect, I enjoy the view finder because it makes the images much sharper than the viewing screen. A simple press of a button lets you switch betweeen these two options.A few years ago I upgraded to a Nikon camera but I continued to use my S7000 for macro shots and locations (sporting arenas) where professional cameras (my Nikon) was not allowed. Approximately three years ago my S7000 suddenly quit working. The view finder/monitor on the camera would not display clear images. Any pics taken also showed the same scrambled image. Attempts to get the camera repaired were met with expensive estimates of around $200. Eventually I found a used S7000 on Amazon at a very reasonable price. Even with the few shortcomings, I am very happy to have another S7000.Note: With regards to the above mentioned purchase, I procrastinated and did not immediately rate the Amazon seller of the S7000 I purchased several months ago. When I tried to rate them recently, I discovered an Amazon policy that would no longer allow me to do so. I would like to thank Amazon seller BFuller563 for the entire buying experience of my second S7000. The purchase was handled perfectly, the seller communicated with me in an extraordinary manner, and I highly recommend BFuller563 to others.", "Date": "December 31, 2012"}, {"Title": "Near Perfection", "Author": "Rodger C. Ludwig", "ReviewID": "R1J3JJQAU229J3", "Overall": "5.0", "Content": "I've been using my FinePix S7000 for about three years now.  Overall, I've been extremely please with all aspects of the camera *except* for the following:1. The electronic zoom control is inoperative in the movie mode.2. *My* camera requires a re-boot when I switch from a CF card to an XD card.  No rebooting is required when I go the other way (XD to CF).  Fuji claims this is a problem that could be corrected with a new mother board, however, my camera is out of warantee and I'm not going to pay $175 to fix such a minor problem.I have taken literally thousands of pictures and I have to say that this camera has consistantly produced outstanding results.All considered, looking back to when I bought the camera, I made a good decision and would probably do it again.", "Date": "August 2, 2008"}, {"Title": "2 years and still going strong!", "Author": "Ami \"Ami\"", "ReviewID": "R63R4L24YFJH5", "Overall": "5.0", "Content": "I still love this camera. I actually have 3 other digital cameras (Canon, Panasonic, Disney) and this is the one I use the most. It has the best clarity and I'm in love with the video capture. It also has a \"multiple shot\" function to get those hard-to-get fast motion or low light pictures. I've had this camera for a little over 2 years now and not one problem whatsoever! (knock on wood) Great buy!", "Date": "December 9, 2006"}, {"Title": "XLNT CAMERA", "Author": "Rick", "ReviewID": "R2GMSK1YGOQV1M", "Overall": "4.0", "Content": "This is my third S7000.  Not because the other two quit, but both were stolen.  After trying smaller Kodak and Vivitar cameras, I had to go back to the Fuji.  Although no longer produced, this camera fits so well in the hand, and the controls are so easy to manipulate I found myself scouring the internet for used ones.  The versatility of this camera, the quality of the pictures and videos and the design are some of the most comfortable features in a camera I've encountered in my 50 years of amateur photography. Some say the batteries drain quickly but I have found that using a high quality rechargeable makes that problem minimal.  And a 1gb XD card can store so darn many pics you could shoot for days. Fuji did a phenominal job on the model and I hope to use my third Fuji S7000 for many years.", "Date": "September 5, 2012"}, {"Title": "Love it", "Author": "Christopher S Holdread", "ReviewID": "R1BR1OLFK2QH5X", "Overall": "5.0", "Content": "Not to make this a short and sweet review, but I love this camera. I've used it for many years. The super macro lens is great. The only knock on it to me is I'd like more zoom lens, but for something that is a fixed lens camera it is fantastic. Really wish they still offered it brand new.", "Date": "July 11, 2010"}, {"Title": "wonderful upgrade from the s5200", "Author": "Christopher A. Dozier \"artist\"", "ReviewID": "RUKO6OMLL10VX", "Overall": "4.0", "Content": "Once you add the protective adapter barrel and a nice 55mm UV filter with lens cap, and after you get yourself a nice lens hood, you have yourself a nice looking and feeling camera hereThe pictures I've taken, whether macro, telephoto'd or anywhere along the zoom range line have come out well. Even ISO800 images come out quite well. RAW images that come out of this camera and processed through Fastone(image program) generally look astounding. The larger 1/1.7 sensor definately flexes its muscles in the s7000.However, with the high shutter range, fast 2.8 lens, and general nice feel, I cannot understand why Fuji limited the ISO range. My s5200 can take 64-1600, which is why I still keep it around. If I could think of any other prosumer camera that could one up this dynamic duo, it would be the Konica Minolta A2 with it's manual features, larger sensor, better lens system and generally bulky feature set.Other than that, I believe this camera does the trick for hobby photographers.", "Date": "January 17, 2009"}, {"Title": "Outstanding Camera", "Author": "Joe B \"Joe B\"", "ReviewID": "R3D8KSNBOI6FIW", "Overall": "5.0", "Content": "This Fuji S700 is my 4th Digital Camera. The first was a HP that started messing up within the first week. I swapped that out for a Fuji which gave me years of reliable service. I gave that to  friend a few years ago when I bought a Panasonic that had more bells and whistles. She is still using the Fuji I gave her. The Panasonic developed a quirk with the on/off switch and I went back to Fuji with the S700.All I gotta say is, WOW! This S700 far exceeds my expectations. It has more features than I'll ever use and is very user friendly. Even a newbie will easily be able to use it right out of the box. It has the looks and feel of a sturdy SLR and is extremely well balanced. That make is easy to take quality no jitter pics. Both the view finder and LCD screens are remarkably bright and easy to see even in the brightest conditions out side. The pop up flach is unique and does the best job I've ever experienced with eliminating red eye. For those of you who have Dogs and/or Cats, you know that even with red eye eliminator set on most cameras, the eyes of your pet will still have that piercing glow. Not so with the Fuji S700! My Puppy Zoe's eyes are the beautiful soft natural Brown even with the flash. Rae my Cat's deep Green eyes look deep and green wvwn with the flash. The Vid setting takes amazinly great Video for a multi function Camera. You can get up to 45 minutes of Vid on a 2 gig SD card. The audio is even exceptionally good for a Camera. One feature that knocked off my socks is the battery discharge feature. I was able to completely discharge some NIMH batteries that were destined for the recycle bin due to not keeping a charge. That resulted in them now holding a complete charge again! I can go on and on about the wonders of this camera. Oh yeah, the manual. It's detailed and leads you through the use and functions in a logical, easy to understand step by step process. One of the best written manuals I've ever seen. Yes, there are better ones on the market but they are many times the cost of the Fuji S700. I could go on and on singing the praises of the Fuji S700 but will conclude in saying that I'm beyond pleased with it.", "Date": "December 5, 2008"}, {"Title": "Fujifilm FinePix S7000 Review", "Author": "P. Minny", "ReviewID": "R8MRHLLI1AFMG", "Overall": "4.0", "Content": "The Fujifilm FinePix S7000 is a fine camera offering most of the functions that can be found on the better quality SLR cameras. The only serious point of dissapointment is the fact that it does not at least have the same type of lens than the Fujifilm FinePix S5000 which offers the serious photographer the oportunity to also photograph in the wild or any other distant object should circumstances require it. The 37mm-210mm lens would have been the ideal lens size for this quality camera.", "Date": "March 15, 2004"}, {"Title": "was not fully operational", "Author": "Donald E. Borstad", "ReviewID": "R1T6OM2TOHKOOT", "Overall": "3.0", "Content": "The adjustment for the different types of photo, like sport, manual, etc was and is frozen. It will not turn, at least it on set on auto, so I could use it.", "Date": "October 13, 2013"}, {"Title": "WHAT CUSTOMER SERVICE??????", "Author": "Dan Briggs \"woodworker\"", "ReviewID": "R1GY87OIDKVS80", "Overall": "1.0", "Content": "Iowned my s7000 for about 3 1/2 yrs. Usage was lite  3-400 pics a yr.  Camera was well taken care of never dropped or abused. All of a sudden for no reason it would not download to the 'puter.  Sent it to Fuji, they said a board burned out,  WANTED $170 to replace it,  WOULD ONLY GUARANTEE FIX FOR 3  MONTHS......I amm buyin a Canon Rebel,  and Fuji can eat their LACK OF CUSTOMER CARE>>>>>>>", "Date": "March 18, 2008"}, {"Title": "IF you buy the Fuji S7000 YOU'LL BE SOORRREEEE!", "Author": "MERTMAG \"mertmag\"", "ReviewID": "R1CFEAG8M2MMIG", "Overall": "2.0", "Content": "I have a Fuji S5000 and thought it a good camera for the price. It takes sharp photos with great color under all conditions. I wanted to go to a 6MP camera and for the price the Fuji S7000 looked like a great deal. Boy was I wrong. My S5000 3MP takes better pictures than the S7000. The camera would not focus for anything. The indoor shots were horribly Under exposed and constantly fuzzy, even with the setting on sharp. The color was dull and the auto focus just does not work well in low light conditions (by low light I mean indoors where people like to shoot photos of their family). If your on a budget try the S5000 I think you'll be happy. If you can afford to go to the $1,000.00 range go with the Canon EOS. Or the new Sony 8MP camera. IF you buy the Fuji S7000 YOU'LL BE SOORRREEEE!", "Date": "December 20, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "6.3-Megapixel SuperCCD HR sensor produces images with 12.3 million pixels (4048 x 3040)\n6x optical plus 3.2x digital zoom (19x total)\n1.8-inch LCD, electronic viewfinder, super macro mode for shots as close as 1cm, 5-frame burst mode\nIncludes 16 MB XD Picture Card; also compatible with CompactFlash Type II cards and MicroDrives\nPowered by 4 AA batteries (alkalines included, rechargeables recommended); connects to PCs and Macs via USB 1.1", "Name": "Fujifilm FinePix S7000 6.3 MP Digital Camera w/ 6x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51M84XRMGPL._SX300_.jpg", "ProductID": "B00009VS6P"}}