{"Reviews": [{"Title": "Good Price Difficult To Configure", "Author": "OldDad", "ReviewID": "R1DIS8ONV8EFIE", "Overall": "1.0", "Content": "Great price for the camera/lens/mount combo but very difficult to get it \"just right\". Accurate focus is next to impossible to accomplish, have to settle for best picture available. The 5-100mm lens is really not necessary as the 5mm setting is just right for home outside perimeter use. The only thing really lacking is good documentation.Pros: Great price for this complete package, sturdy camera and mount, easy to physically set up.Cons: Difficult to adjust focus and a better explanation as to how to use the two switches for AES/BLC. Trial and error is really not the way to go unless you can have a monitor next to where you're setting the camera up.Update: Stupid me!! My entire system is on WiFi and therefore I used my laptop (logged into my DVR) next to the camera installation point which made adjusting the focus a no-brainer, still very touchy tho!Update: Seller sent me a test pattern to print out to adjust focus. Worked like a charm. Seller has been VERY helpul and very quick to respond to questions.Cons:One of the cameras only lasted 5 months, picture became blurry, colors washed out and an excessive amount of glare was present. Swapped out for the other camera in the same location worked just fine which proved conclusively that the other camera was defective. Since it is only a 90 day repair warranty the only thing left to do is to throw it away and never buy another one. Warehousesellers is no longer \"helpful\" although the 90 day warranty was in place at time of purchase. So if the camera goes bad after the 90 day period you're out of luck.Final:These cameras are JUNK, plain and simple -- JUNK!! They are very difficult to focus correctly, susceptable to outside temperatures of below 30 deg F. Sunlight bouncing off concrete will blank the display. Service is ok during the warranty period but once that has expired, forget it, they forget you and could care less. We junked the 6 cameras we purchased and went with 3 and 6 mm bullet cameras that are working far exceeding expectations, and they only cost $89 USD. Suggest you stay away from box cameras altogether.", "Date": "January 12, 2010"}], "ProductInfo": {"Price": "$767.45", "Features": "Built-in 1/3\" Sony Effio CCD Color Image Sensor. NTSC System\nDigital Signal Processor; 700 TV lines; Effective pixels 510(H) x 492(V)\nMinimum Ilumination: 0.01 LUX; C/CS lens mount\n6-60mm Varifocal lens\nContents:1 x Sony Effio CCD camera, 1 x 6-60mm auto IRIS zoom lens, 1 x 12V DV Regulated CCTV Power Supply, 1 x video power extension cable, 1 x adjustable camera bracket and 1 x security warning decal", "Name": "VideoSecu 700TVL Built-in 1/3\" SONY Effio Color CCD Outdoor Day Night Vision Security Camera Weatherproof CCTV Surveillance Camera with 6-60mm Varifocal Lens, Power Supply, Camera Bracket, Extension Cable and Free warning sticker CHT", "ImgURL": "http://ecx.images-amazon.com/images/I/41QZySlddEL._SY300_.jpg", "ProductID": "B000TBLOS2"}}