{"Reviews": [{"Title": "Wide angle wonder", "Author": "P. Claxton", "ReviewID": "R15ICN8UWDFNEO", "Overall": "5.0", "Content": "I've been shooting pictures as an avid photographer for more than 30 years. My first digital camera was an Apple 150 ... and that was a long time ago. This little offering from Olympus is used as a snap shot camera to supplement my Nikon DSLR so I use it within it's limits.Pros:The 3\" screen is bight, clear, and plenty big enough.The wide angle lens produces sharp pictures and has a very useful close focus.The flash is effective within its limits.The camera is simple to operate.The guide mode is very nice to use.Each mode on the function wheel has a large icon that displays on the rear screen to make selection easy.Cons:The function wheel feels a bit cheap as it's made out of plastic - the rest of the camera feels solid in comparison.The battery life is a bit shorter than I'd like - extra batteries are available here for $14.All around a wonderful little camera which is just so easy to use. An excellent camera.", "Date": "January 7, 2008"}, {"Title": "Simple with a Lot of Features", "Author": "Annie Belle", "ReviewID": "R35SSWLZK8ZIBC", "Overall": "5.0", "Content": "I love this camera. I was in the market for a digital camera for a while. I've been searching and testing for a long time. While, I'm not a professional photographer, I'm very picky about the things that I purchase. One of the important things that I was looking for in a camera was slimness, yet most of the cameras that were slim had very few features. This one is great, it's slim with a lot of high tech features, yet still easy to use.One of the biggest plus is moving shots and shots behind glass still come out crystal clear! This camera is great and at a reasonable price.", "Date": "March 6, 2008"}, {"Title": "A lot more camera for a lot less money!", "Author": "A. Ramos", "ReviewID": "R2DE4CUORVEI18", "Overall": "4.0", "Content": "After 26 years of being in the hobby of photography, I have already outgrown the stage where I thought that the best cameras were simply the ones with the most number of bells and whistles. There was a time when I wouldn't even consider something inexpensive, thinking that surely it's features weren't the latest. Maturity has given me the wisdom of realizing that as far as my point and shoots were concerned (and I've had so many of these through the years), I have never really availed of much of these whatchamacallit features! The point of having a point and shoot, after all, is to be able to just point and shoot (and leave all the adjustings with your SLRs)!  A few days ago, I ordered the affordable (inexpensive, not cheap) Olympus FE-340 and FE-290. Yes, I ordered both of them! I was attracted by the 5x optical zoom of the FE-340 and the 4x (with wide-angle) optical zoom of the FE-290, and I couldn't decide which one I wanted more. Well, it turns out that the combined price of both units were still less than the price of one comparable unit of another brand. More importantly, I simply trust the lens of the Olympus since I know that it is a long-time optical company that created an optical product, not just an electronics company that decided to dabble in cameras.", "Date": "April 4, 2008"}, {"Title": "Awesome Camera, but lacks manual settings", "Author": "Laurie V.", "ReviewID": "R1K59F5BXJG5J1", "Overall": "4.0", "Content": "I've had this camera for about a year and I absolutely love it.  The pictures are crisp even in low-light conditions (I hate using the flash, I prefer to take photos using available light), and the video capture is clean and clear with good sound quality.The only places I see room for improvement are: 1) there is a bit of a lag between hitting the shutter button and the capture of the photo.  2) there are no manual settings on the camera whatsoever--no shutter speed, iso or focus adjustment.  Last of all 3) the battery life is a little bit weak, but at least additional batteries aren't expensive.All in all though, this is a great camera and it takes a beating, too.  I've dropped mine a few times and it holds up great.", "Date": "July 21, 2008"}, {"Title": "DJWC", "Author": "D. Colbert", "ReviewID": "R2Q2YCMM7VO9DP", "Overall": "5.0", "Content": "Shipment was promt. Had this camera before, it takes great pictures. Even outside at night images are nice an clear. Nice compact size, fits well in pocket.", "Date": "June 16, 2012"}, {"Title": "Blurry Pictures - Short Battery Life", "Author": "Dakota Brink", "ReviewID": "R269A1T4UMXOZG", "Overall": "3.0", "Content": "I've owned this camera for 1.5 years, the camera is okay. But the images are often out of focus, unclear, or jostled. Turn off the flash, and it's even worse. I can take 20 pictures with this camera before the battery is close to being dead. The camera uses xD digital flash media... be wary of this. I sure am. It seems much slower than SD, and I don't understand why they decided to use xD, because it's terrible. Maybe because Olympus owns xD and wants to lock you into their market with their proprietary devices? I don't know... Sounds a lot like apple products to me.Be prepared to wait almost 1.5 seconds between the time you press the picture button, and the picture actually taking. It will focus in, then focus out, wait, then flash, and the picture will still be blurry half the time!A pro for many people is that the screen is as about as big as it can get for this size of camera. It's nice, but I don't really care all that much.. I like to view my photos on my computer, and on paper.The short battery life makes me feel anchored to my charger. I can't go out for a day of shooting pictures, because the dumb thing would be dead in an hour.I may be being a bit overly critical of this device, but overall, it's not really an acceptable camera for my standards. If I were you, I wouldn't spend my money here, keep looking. I just bought a Nikon L110... I hope it's a good replacement for this one.", "Date": "June 7, 2010"}, {"Title": "Great camera, only one problem", "Author": "C. Gerhardt", "ReviewID": "R207LHTYCQ4JOM", "Overall": "4.0", "Content": "I have owned this camera for over a year. I bought it because of the wide angle capability, as I am a real estate agent and need wide angle for interiors.  This camera is great indoors, takes excellent pictures. I didn't realize that it didn't have a viewfinder when I bought it. I don't use it outdoors because I can't see the LCD image on a sunny day, even turned to highest brightness. So this is my indoor camera, and I use my 7-year old Olympus D-510, 2.1 megapixel with viewfinder outdoors.", "Date": "May 26, 2009"}, {"Title": "Good!!!!", "Author": "Jimmy Albert \"Salvador Suero\"", "ReviewID": "R2NZ8GN5SHL8NE", "Overall": "4.0", "Content": "I like so much my camera but the battery unloading very fast. The moldels Olympus Stylus 710 The loading of the battery is more intense and it lasts more. In this Models FE-290 the wide screem 3 inch it is a success.Salvador Suero", "Date": "March 31, 2008"}, {"Title": "Excelents results", "Author": "Cristian J. Novelli", "ReviewID": "R1YT8WWERHVZED", "Overall": "4.0", "Content": "The cam works really good and i am very happy with the delivery. Thank you!", "Date": "January 22, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "7.1-megapixel CCD captures enough detail for photo-quality 15 x 20-inch prints\n4x wide-angle zoom lens with Digital Image Stabilization\nLarge, 3-inch LCD screen\nAVI Movie Mode with sound\nCapture images to xD memory cards (not included)", "Name": "Olympus Stylus FE-290 7MP Digital Camera with 4x Wide Angle Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41xQnN7iySL._SX300_.jpg", "ProductID": "B000UW3D5C"}}