{"Reviews": [{"Title": "MVC-CD400: How to take a darn good idea and make it better!", "Author": "\"mikejensen1\"", "ReviewID": "R2OM60OH0G2WN4", "Overall": "5.0", "Content": "The MVC-CD400 is a new model of Sony's established mini-CD burning cameras, along with the MVC-CD250, replacing the CD200 and CD300 models. So why would Sony need to upgrade anything you ask? I was actually asking myself the same thing at first. I was getting ready to drop down the money for a CD300 model when I heard a new design was coming out, so I started doing some research. I found that Sony has done a nice job of directly addressing many of the failings of the CD300/CD200 units, and added some especially nice touches to boot! The most noticeable change up front is that the built-in flash unit has moved from the upper right side of the unit to right over the barrel. This helps with avoiding shadow effects when taking up-close shots. Additionally, they have addressed the single most commented-upon flaw of the 200/300 series: Viewing the LCD screen in bright sunlit conditions. They have added a clear 'strip' along the top of the LCD panel that allows ambient light to help back-light the LCD screen, and the results are frankly good, making the LCD significant more usable in all lighting conditions without having to buy the 'viewfinder attachment' that Sony sells for the Mavica CD model cameras. The third significant change is the addition of a standard flash adapter, allowing one to use external flash units with this camera for better lighting when needed. It is important to note - apparently it is critical to make sure you use a normal low voltage external flash instead of a studio-quality high-voltage unit, as this may damage the camera!Like it's previous generation brothers, the CD400 includes a Carl Zeiss Vario-Sonnar lens for high quality (professional?) photography without the distortions you may sometimes find in the 'corners' of shots taken through some lower quality digital cameras. It also upgrades the CCD from 3.3 megapixels to 4.0 or so, which means even more detail can be captured for folks who are interested in capturing everything possible. The other unique addition is Sony's Hologram AF system, which uses a laser emitting diode to put a crosshatch pattern on your target prior to snapping the shot, letting the autofocus get better accuracy when dealing with situations that sometimes confuse traditional autofocus routines. Sony's batteries also are decent, giving a typical user 2+ hours of uninterrupted shooting before needing replacement, and then recharging in ~45 minutes. And of course the mail selling feature for most folks, myself included - the photos are saved on mini-CDs, rather than one of the various memory stick/card units. Mini-CDs are dirt cheap per MB compared to memory sticks, and typically store ~150-200MB worth of photos, depending on make. Sony of course recommends you use only their branded disks, but many folks are reporting no problems using other manufactured brands. Depending on CD used, this translates into ~10 photos at the absolute maximum resolution 2272x1704 at maximum quality (TIFF) through ~1300+ photos at 640x480 at standard quality (JPG).As an added feature, you can record movies with audio with the camera also, though the image and sound quality are not comparable with a digital video camera so if video is your passion, go look for a video camera, not a digital still camera. Otherwise, this is a nice little bonus. I had resisted the urge to purchase a digital camera for a long time, waiting both for the photo quality to start approaching that which could be found with 35mm cameras, and for the means to get the pictures into a usable format on the PC to become cheaper or easier. Mini-CDs work in nearly all modern CD drives on computers, and I have not run across one yet that failed to work, though I admittedly tend to have relatively modern equipment at home and work. (Nothing older than ~3 years old at least in terms of CD drives.) The MVC-CD400 is an answer to every criticism I've had about digital cameras for the last few years. I'm enjoying mine greatly!ONE NOTE: Viewing 'unfinazlied' CDs on a Windows PC only works if you have DirectCD installed, which is an application that comes bundled with pretty much any CD burner on the market. 'Finalized' CDs are readable pretty much everywhere.", "Date": "May 30, 2002"}, {"Title": "Great Camera to travel with", "Author": null, "ReviewID": "RF7P1MBVUH4SR", "Overall": "5.0", "Content": "Let me first start of by saying that this camera is probably not for everyone.  I'll start of by describing its short coming, all of which I think is something that is expected.Firstly, its bulky.  Not big, maybe the size of a 35MM not as heavy though, but definitely much bigger than your average Digital camera.  This of course is due to the fact that it uses CD as storage device.  Sony did a nice job of putting a hand grip on the right side of the Camera that fit nicely in my hand.  But I think that perhaps left-handers and people with smaller hand might not feel as comfortable with this camera.  I would recommend going to a local store and try it out before buying it online.Secondly, since it uses CD as storage, there will be lag time in disc access.  Reading from disc or reviewing images are slow (very slow).  And definitely for me the worst part of this camera.  Taking pictures at regular interval (2-3 sec between shot) is ok since the camera stores the pictures into a memory buffer first before writing onto the disc.  But you will have problem if you want to take lots of shots on fast moving object.  The camera provides a mode for 3 burst shot or a multi burst mode for up to 16 shots (stored in 1 picture) but its not very good, you are probably better off with another camera.  But again, this is something I was expecting from this camera.Now to the good part.  Of course the CD storage is great.  The main reason I brought this camera is because I went on a 2 weeks vacation and didn't want to carry lab top around to off load my pictures.  The CD storage are cheap, and allows me to take highest quality pictures at all times.  I recomend using Memorex 210MB pocket CD-R for this (stores about 96 pic on highest quality).  Much better than sony mavica standard CDR, and cheaper too.  Furthermore, the CDR makes filing away pictures much easier.  You don't have to store it onto a harddrive or burn the image afterward onto CDRs.  Its probably would be convinence to be able to come back and look at the pictures 2-3 years from now.  Another important thing is that the camera just simply takes great pictures.  The pictures come out real nice, and with its autofocus feature its almost impossible to shot out of focus pictures, unless of course you use the manual setting.  You can add effect to the pictures (solarize, BW, Sepia, Negative Art) and also adjust the white balance...the usual stuff.  And the Carl Zeiss Vario-Sonnar lens works real well.  Sony probably realizes that the Camera is bulky and thus they actually put alot of features into the device (at least the 4 megapixels version) comparing to their other 4 megapixels camera DSC-P9.  You can adjust the camera to Manual that allow you to adjust various stuff like Shutter speed, Aperture, exposure shift.  Overall this, and the image quality, is the biggest different between the 2 megapixel and the 4 megapixel Mavica.  The camera has a movie mode which record the movie (with voice)onto the disc in mpg format.  On an empty disc this its about 5 min recording time on best quality and 90 min on lowest quality.  Its no substitution for camcorder though because zoom doesn't work under this mode.  But its a nice little feature nontheless.  Note that lots of Digital camera has this feature, but not all of them allow you to record movie up to the maximum capacity of the media.  Many digital camera limits you to a certain fixed time (usually less than 1 min) of recording time.  Battery life is decent.  The camera display the exact battery life remaining in minutes.  It definitely is enough for normal operation for 1 day, before its nightly recharged.  The recharging doesn't take too long, 1-2 hours.  You can buy a backup battery/charger if you takes lots of pictures.  Overall I really recommend this camera for people who like to take pictures.  Its not your typical digital camera so it definitely is not for everyone and you should be cautious when buying it.  Go to a store try it out first.  But I do tell you this, if you are thinking about buying the MVC-CD250 vs. MVC-CD400...go with the 400.  Its more expensive, but its a much bigger bang for the buck.", "Date": "November 24, 2002"}, {"Title": "Man what a camera!", "Author": "Mike \"dragonhound\"", "ReviewID": "R1V11KG8XAY0DP", "Overall": "5.0", "Content": "I've used this camera over the past several years and I remain a true believer of both it, and its updated 5MP version, which I also own.  The expanse of capabilities and options with the camera allows for taking excellent pictures under nearly any conditions.  The manual as well as the shutter and aperature priority imaging modes allow you complete control over the imaging process.  I've taken pictures of everything including northern lights at 2 a.m., my cats in near complete darkness, portrait shots of subjects in dark rooms standing in front of bright windows, and they've all turned out wonderfully.  For printing, I've used both my home printer, and a professional photo store, and prints up to 11x14 have turned out perfectly with no degredation at all.Several recommendations if you buy this camera.  Don't waste your money on Sony's cd-r disks.  I've used verbatim, memorex and k-hypermedia cd-r with no problem.  They're certainly much cheaper, and they all hold 185 MB while the Sony's only hold 156 MB.  I would also suggest that you buy the Sony external flash for the camera.  While the hot shoe will accept other brands of flash, I've been very impressed with the improvements to my pictures since buying the sony flash.  I would also recommend buying a small (3-6\") expandable tripod that will fit in any case.  This allows you to set up longer exposure shots for dark environments, as well as for using the timer function on less than ideal surfaces.If you're looking for huge storage (and archive) capabilities, excellent images, and complete control over your picture taking (minues the zoom limitations), then this is certainly the camera for you.  Everyday I think it is worth the price I've paid, and with a new baby in the house when first purchased, being able to take several hundred pictures in the first few days and email the \"best-of\" off to the grandparents is certainly a plus.", "Date": "November 1, 2002"}, {"Title": "Great Camera But Consider A CD300 For Less $$", "Author": "Richard R. Carlton", "ReviewID": "R2C8BWJ87RWH5A", "Overall": "3.0", "Content": "I am a professional radiographer and photographer (25 years now) and I used both the CD400, CD300, as well as a Nikon Coolpix for this year's field research season x-raying mummies in Peru.  This means the cameras were pushed hard.....blowing sand, huge contrast ranges, high resolution radiographs needed, fast manual control of radical light conditions, etc.....essentially most of the tough conditions and imaging requirements you can imagine.  Here's what I found:The Sony Mavica CD300 beat them all.  It's not the most expensive or the best resolution but we all thought it did the best job.Mavica CD400: best resolution but extremely slow recording time made it impossible to work with most of the time....the CD300 often got 3-4 shots while the 400 was recording one.Mavica CD300: not the best resolution, but now that I've done some prints for publication from it's highest res setting I will not be buying any more 400s....just not a significant enough difference, plus it's not as heavy or bulky.Nikon Coolpix:  not in the running by comparison with the Sonys....although it is more lightweight....we are buying mini CDs for 33 cents each in bulk... and getting 140-180 high res images per CD.....they are so easy to format, initialize, and copy on any CD burner that I can't believe we even considered using memory stiks, or USB downloads.The best features are common to both the Sony Mavica CD300 and 400 series though.....manual control of the images, excellent close up abilities, decent wide angle (which can be enhanced with add-on lenses if necessary), and both rapid video and automatic functions with night focusing for flash, etc., etc. Finally!  There is a great digital camera.", "Date": "July 5, 2002"}, {"Title": "Great vacation camera", "Author": null, "ReviewID": "R2M9Z2NXIIRD0G", "Overall": "5.0", "Content": "We looked at the 2megapixel versions that were out plus the 22X zoom cd mavica before purchasing this particular model.  Had there been a zoom version upgrade with the cd rather than the memory sticks, we probably would have purchased it because we liked the zoom feature so much.  We wanted 4 megapixel with the cd option, which left us with this camera.  Having had access to use all 3 cd mavica cameras, we chose this one because the zoom isn't bad, the Zeiss lenses are great and the options are all there.After taking this on a trip to Washington DC, we used only 2 disks using 2nd from the highest resolution.  We also shot a few mpeg videos, which were an interesting endeavor.  Because it isn't a full camcorder, you cannot zoom in and out while making a video.  We didn't find this out until we filmed the changing of the guards at Arlington.  Also, at highest res, you only get 5 minutes 28 seconds of video.  The next step down gives about 28minutes.  All in all, it was great to only have to carry cd's and knowing what we know now, we can go completely high res on our next vacation and not have to worry about disk space.  Also, the functions on the camera allowed us to take pictures of items behind glass at the Smithsonian museums.  We could instantly see if we had a glare or not and the camera offers a few different ways to eliminate the glare completely.  Other than the \"wow, this is a different camera\" comments through airport security, we had little problem with it.  The battery life was impressive - 3 days before recharging.  If you want to do videos, we would recommend purchasing a separate unit that has more functionality, but it was great if you only wanted to carry one camera.", "Date": "October 1, 2002"}, {"Title": "For those who are not computer or camera savy!", "Author": "Kathryn Guthrie", "ReviewID": "R1GGIBCGI2DLWY", "Overall": "5.0", "Content": "This is a great camera.  With the CD in the camera all you have to do is take it out and pop it into the computer.  No hooking up a docking station, no buying memory sticks that are tiny and easy to loose.  I can use this camera and download to our computer with no help from my husband.I am an avid scrapbooker and I have found that this camera has saved a fortune in developing pictures that I would have never used anyway.  I love being able to decide weather or not I like the shot right away.  No getting home from a Disney vacation and finding out everyone had their eyes closed in the great shot with Mickey.  You can take several shots quickly and delete the ones that you don't like right there, and on to the next attraction.  No more spending $16 to get double prints and a CD.  You can take well over 100 pictures and decide from the camera what you like.  Plus you have everything saved on a CD already. You can then take it to a developer and have what you want printed, or upload to Shutterfly and never have to worry about going back to the store for pick up.This is the perfect camera for those of us who have wanted an upgraded camera with all the bells and whistles and could not, and didn't want to spend hours learding how to work everything.  A quick read through the book and you are ready to go.", "Date": "November 30, 2002"}, {"Title": "Best digital yet", "Author": "Pat Hoyt", "ReviewID": "R3VEHLJ339ST5M", "Overall": "5.0", "Content": "I am an amateur photographer in Florida, and this camera gets incredible wildlife shots and adjusts to all light conditions with excellent color. Saving photos on CDs is SO much better than dealing with memory sticks that only hold a few photos, as I can get 170 shots on a CD at the HIGHEST RESOLTUION, and the CDs are cheap too. It comes with a CD adapter that lets you slip it into your CD drive, but frankly, the adapter is a pain as you have to put the CD in it JUST SO. I use the USB port it comes with instead, and it is much faster. The camera is a little bulkier than most, but it is so well designed, I don't care. The is the first camera I am in love with!", "Date": "December 2, 2002"}, {"Title": "powerful", "Author": "\"narsipur\"", "ReviewID": "R1FMQTTGV5X38J", "Overall": "5.0", "Content": "I formerly used a point and shoot 1.3 MP camera that had no LCD screen.  I am absolutely amazed at the capabilities of this camera and it continues to impress me.  The battery is robust.  The discs have ample room for recording an entire vacation (about 200 pictures).  The \"movie\" mode is a bit primitive and I wish I could have more control over bracketing exposures.  I also think the time delay between pictures (because they are \"recorded\" on the cd) makes this not a good choice for the action or sports photographer.  I spent some fun time this morning with my wife and kids looking at pictures fed from the camera onto the TV screen as a \"slide show\"!", "Date": "December 8, 2002"}, {"Title": "The ultimate in convenience", "Author": "Eric L. Fox \"vaporlock9\"", "ReviewID": "RLAGD0XD8GRLU", "Overall": "5.0", "Content": "I recently went on a whale-watching trip in Monterey.  We didn't see many whales, but we saw thousands of dolphins.  They would pop up out of nowhere and everyone was snapping away with their cameras trying frantically to capture the action. People using film gave up after a few minutes since the cost was prohibitive.  People using memory stick cameras quickly used up their memory and spent the rest of their time reveiwing and deleting photos to make room for more.  After shooting almost 100 photos at maximum resolution (JPG) using my Mavica CD400, I simply swapped out the disc and shot 100 more.  The CDR's are so cheap that I didn't have to worry about taking bad shots. When all was said and done, I had about 15 excellent images out of the nearly 200 that I shot.  I'm sure that I was the only one that walked off the boat with anything other than pictures of the water.Image quality is excellent.You can shoot video with sound until the CDR runs out of room.Many useful features that are easy to access.Battery life is sufficient for 200+ photosOver-priced, but incredibley convenience...worth the investment", "Date": "March 27, 2003"}, {"Title": "awesome pictures", "Author": "ginger mcleod", "ReviewID": "R3T5MHMIHWNBRP", "Overall": "5.0", "Content": "I just bought my new toy and I love it. I have several different types of cameras to include digital. This is the best one I have had the pleasure of using. I take photography seriously and so did sony when the designed this camera. I was incredilbly impressed with the results of the sepia photo's taken with this camera. They were right on target. I have used my camera allot in the few days that I have owned it. I am still finding more and more items and options that are great. I have read that people think it is a little big. I think they need to think back to the first digital cameras and thank sony for this one.", "Date": "January 16, 2003"}, {"Title": "Great camera!", "Author": "Ben Schumin", "ReviewID": "R244VA5RTRI2YP", "Overall": "5.0", "Content": "Having upgraded from the Sony Mavica FD73, the CD400 was quite a jump!  Big 4.0 megapixel pictures, with lots of adjustable settings make this camera hard to beat.  The only downside is no zooming in on videos (but you can set the zoom beforehand), but then again, you bought this for its still camera capabilities, and not its video capabilities, right?  It will even autofocus in complete darkness.", "Date": "November 30, 2002"}, {"Title": "great camera", "Author": "M. Morrison \"mich311e\"", "ReviewID": "R7FHN7H4RC0Q7", "Overall": "5.0", "Content": "I have this camera and love it.  It takes great pics, has more options than I need.The only downfall is the fact that there is no zoom in video mode.  I had the older Sony Mavica (that recorded to floppy's) and it did have zoom, so I didn't even think about this one not having zoom.Other than that, it's great.", "Date": "October 8, 2002"}, {"Title": "Great All-Around Camera", "Author": "Tim E Shideler", "ReviewID": "R2XPG1O97BL0YP", "Overall": "5.0", "Content": "I have owned my CD400 for nearly one year.  I have never been disappointed with capabilities, quality, user-friendliness, or results.  This is a fantastic all-round camera.  Use Sony discs, as recommended.  Other media is unreliable.", "Date": "May 15, 2003"}, {"Title": "Sony MVC-CD400", "Author": "Clarence E. Nichols", "ReviewID": "R1OVMEM1EG65UL", "Overall": "5.0", "Content": "Best I've ever seen so far for clearity, ease of use and ability to edit or modify pictures with photo software.  Truly enjoy this one, especially the automatic focus, flash, and transfer to my desktop.  I'll never use all the space on the cd and if I do, big deal, less than 50 cents a piece for a new cd-r.  My photo paper costs more.", "Date": "February 8, 2003"}, {"Title": "The best digital with the best features.", "Author": "Richard Gomez", "ReviewID": "R3NCNGBRI2QYP1", "Overall": "5.0", "Content": "I studied every camera out there and found this camera has the best features for me. This camera has a built in cd burner which allows you to store a ton of pictures and movies. The CD's are inexpensive to buy and easy to share, save and store. The quality is excellent.", "Date": "March 21, 2003"}, {"Title": "AWESOME!", "Author": null, "ReviewID": "R5ZTATAV64J8H", "Overall": "5.0", "Content": "I am new to digital photography.  After doing internet research, this is the camera that I selected to purchase.  It is feature packed, easy to use, and takes beautiful pictures.  I highly recommend this camera.", "Date": "December 21, 2002"}, {"Title": "Sony Makes It Easier", "Author": null, "ReviewID": "RTONNBCWA175D", "Overall": "5.0", "Content": "Great camera. Easy to use for beginner and enough to make a pro happy. Very thoughtful to use CD's for storage medium - very convenient, efficient, and love the DD R/W flexibility. Only wish would be to have a variet of auto settings like many of the Nikon series.", "Date": "November 30, 2002"}, {"Title": "Got mine 3 days ago!", "Author": null, "ReviewID": "R1N8DM5D4SCR0", "Overall": "5.0", "Content": "It is simply a marvel of technology and represents good value for money considering that it comes complete with a superb long-lasting Lithium-ion battery pack, International 110-240V 50/60Hz charger as standard for when you're travelling (you still have to buy adaptors to fit the sockets in other countries), and 156MB+ storage capacity on the CD-R/ CD-RW for about [price]. The camera and its' extensive features are easy to use after only a few hours of ownership. Slip the 3\"CD-R or CD-RW into most CD-ROM drives and immediately access your photos in Windows Explorer without the aggravation of cables and card readers. The only blemish is the meagre 3X optical zoom. For anybody in Europe where this camera sells for about [price] before adding 15 to 20% sales taxes to give an average retail price of about [price] , this camera is an especially great buy.But the Sony is BIG! OK, it can't be any smaller than the 3\" CDs it uses for storage. But somewhere in Sony's system of R&D;, having established that they had a superb product concept, nobody then passed on the design to the Sony boffins who specialize in miniaturizing everything. The result is simply that you have a great camera but which is simply GIGANTIC compared to anything else out there!I should have spent more and bought a Fuji Finepix S602 with a 1GB IBM microdrive. Anybody want to swap?", "Date": "August 23, 2002"}, {"Title": "what a great gift", "Author": null, "ReviewID": "R2YLYVQLFT9D6V", "Overall": "5.0", "Content": "This camera was a gift. I don't know much about digital cameras except that whenever I have used one, the pictures always seem very grainy. I never understood why people would use them over regular cameras, except for the online uses. Having said all that, I must now admit that I love this camera. The picture quality is excellent, and I love being able to see my pictures on the computer and choosing which ones I want on paper. My only complaint (minor) is the view screen. When you are outside, it is difficult to see what you are aiming for.", "Date": "September 27, 2003"}, {"Title": "Great for making Movie Maker Videos", "Author": "Rowbert", "ReviewID": "R1DPMHS1RVKJ2V", "Overall": "5.0", "Content": "Not only does it take awesome photos but this camera is great for short MPEG movies. I copy them right off the CD to my hard drive and then import into Windows Movie Maker for editing. The movies have better quality than my TRV27 Sony Camcorder.", "Date": "August 23, 2003"}, {"Title": "Effective and Efficient !!!", "Author": "Rich Parziale", "ReviewID": "R2VS3POCZX545J", "Overall": "5.0", "Content": "I am a trades person and I take alot of before and after pictures. It's nice to be able to get good shots the first time out. I can't tell you many times I've taken usless pictures of jobs that I could use for future work.", "Date": "January 10, 2003"}, {"Title": "Great Little Camera", "Author": "AJ Starling", "ReviewID": "R2VLI0L3EG3RH9", "Overall": "4.0", "Content": "I just love this great camera from Sony.  The Mavica MVC-CD400 was a great buy for me a couple of years ago, although a 4 megapixel camera doesn't cost quite this much anymore.  I spent 600 dollars for the camera at Best Buy, getting a deal because it was an open item.The MVC-CD400 is extremely user friendly in all modes of operation (still picture, movie, or review).  In my two years of taking pictures with this camera, I have only used the fully automatic still picture mode and the simple movie mode.  I've yet to have a bad shot.  Part of what makes shooting pictures with this camera so easy is the fact that it has the large viewing window to let the user see just about exactly what the picture will look like.This camera has a fairly quick auto-focus feature that is highly reliable except in extreme low-light conditions, and even then it can usually compensate for the lack of light by using the built-in diamond pattern lamp used for helping the camera focus.  Where this tool starts to fail is for objects more than six feet away, depending on lighting.Although the camera has a note that it displays on power-up any time it detects a non-Sony Mavica CD installed in the storage bay, I've never had any problem using other discs.  Typically I use the Memorex 210 MB CD-R's.With these discs, I can store 95 pictures at the highest JPEG resolution, or 954 pictures at the lowest resolution.  For the movie mode, the same disc will yield 8 minutes and 31 seconds at the highest resolution (which isn't that great at 320 HQX) or 100 minutes at 160 by 112 resolution, which is actually pretty crappy video.  But if you want a camcorder, this is not the toy for you.The camera can also store images in TIFF format, but be prepared to wait a while for the images to save to the disc, and to change the discs often.  Only 13 images will fit on a 210 MB disc in this format.  For anyone who isn't interested in professionally working with their photos, the JPEG format is fine.  I've printed out many of those prints at 8x10 with remarkable detail.Some of the extra features of this camera include the photo effects, such as black and white or negative (can't quite figure out what I might want to do with that one, but it's there nonetheless) and a red-eye reduction flash.  The red-eye reduction takes a little bit more work than I would like to turn on and off (rotating the selector knob to \"SET UP\" and navigating a couple of options then back again), but it isn't that much of a pain and can be done in about 5 seconds.  Also the user can select a \"confirm before write\" option, to avoid wasting space on the disc for those who have a habit of taking a picture with their thumb over the lens or something.Another feature of the camera is to stamp the image with a date/time stamp.  I don't know why anyone would really want to do this, since the time and date are also imbedded in the file (along with other data such as ISO speed, focal length, flash, and exposure time) and can be retrieved by loading the disc into a computer CD-ROM drive.Battery life is usually quite good.  I can typically use mine for an entire event (football game, wedding, etc.) without worrying about the battery, although the internal monitor might be telling me that it's low toward the end if I've been doing a lot of reviewing.One of the drawbacks I've read in another review of this product is that sometimes using the camera to review the images stored on the disc can be painfully slow.  While it is slower than using a memory stick model, it isn't that bad.  Add the advantage of accessing all of the images very quickly using a PC (even before the disc is finalized by the camera) and the usefulness of this method becomes clear.  Transfers from a CD are substantially faster than transfers via USB or Firewire.I have a Canon EOS Digital Rebel now which I use most of the time and love, but I'm not getting rid of this great little Sony.  Partly because my girlfriend loves it and it's kind of her camera now (she's laid claim to it), but also because it is still so useful and so good that I see no reason to.", "Date": "January 4, 2005"}, {"Title": "Finally, a good way to save my pictures.", "Author": null, "ReviewID": "REOYIHXTK4281", "Overall": "5.0", "Content": "One of my greatest problems with digital cameras was that I wasn't good about saving copies on removable media.  This camera starts by burning my picture to a mini-cd and I love it.  It is as feature rich and quick as my other Sony camera.  It's buffer is large enough that I've never felt a slow down in my picture speed.  Just a great camera.", "Date": "December 1, 2002"}, {"Title": "The convenience is worth it...", "Author": "Photo Mom \"digimom\"", "ReviewID": "R1R5LJ13T4U6JV", "Overall": "5.0", "Content": "I've owned this camera for about 2 years now.  I have dropped it, kicked it on the pavement and still, I get great shots.  The photos are great and there is lots of flexibility of storage.  You can delete photos before you finalize the disk if you like or keep all of them and only upload those you want to manipulate with editing software.  Very user friendly, I like the feel of the camera, has a nice grip to it.  Opportunties to improve:  the lcd screen does not have protection so it is kind of scratched up; also, hard to frame your shot without a view finder in very bright light or with low light at night.  Finally, need to account for shutter lag time to get the photo you want.  It takes several seconds for start up so you need to account for this as well.  Regardless, the pros outweigh the cons, I love the cd fomat for saving the photos -- no need to transfer from memory stick to computer or printer, just pop into your computer and you are there.", "Date": "June 19, 2006"}, {"Title": "Wow!  Great Resolution", "Author": "\"sweetcebu\"", "ReviewID": "R26I4RRVDUS9E8", "Overall": "5.0", "Content": "I simply love this camera!  So easy to use, great resolution, no film, CD hold lots of high quality shots!  I printed some pics from the first day and Sony Imagestation suggested enlargements 20x30 in size as the maximum! ...", "Date": "March 14, 2003"}, {"Title": "Effective and Efficient !!!", "Author": "Rich Parziale", "ReviewID": "R1XYJBQ28585AR", "Overall": "5.0", "Content": "I am a trades person and I take alot of before and after pictures. It's nice to be able to get good shots the first time out. I can't tell you many times I've taken usless pictures of jobs that I could use for future work.", "Date": "January 10, 2003"}, {"Title": "Fragility, portability, durability", "Author": "Natalya Marquand", "ReviewID": "REYRTUT96YN3U", "Overall": "1.0", "Content": "As an avid photographer, I wanted a digital camera that had the complicated lense features of a regular SLR without the complications of the various storage disks/cards/drives that plague most other digital cameras. This camera looked like the one. It burns to a mini cd, and therefore the orginal images are available immediately on disc without software or cords. It has mini video functions as well as other high tech possibilities.Nice idea, but it failed. This camera is still relying on new burning technology, so the camera is still extremely fragile and definately not portable. I've had the camera 10 months and I've had to fix it three times. First the burning lense broke... any slight shake or bump will cause it to go off course, making the entire camera non-usable. As there is no harddrive within the camera, if you cannot burn to cd then you cannot take pictures. Then the photo lense got jammed (over the course of a month--so photos picked up a blur after a little while) and was unable to function, although I was still able to view pictures. After paying to REPLACE both parts (in excess of $150 each) the burning lense broke again after two months. If you're planning to only take the camera out on special occasions, fine, but if you're planning on doing any sightseeing with it, putting it in a bag and taking it anywhere, it won't hold up.", "Date": "November 21, 2003"}, {"Title": "Sony Mavica CD 400", "Author": "\"jatn1017\"", "ReviewID": "R3RQWT4KPXD3HF", "Overall": "5.0", "Content": "I recently purchased my first digital camera.  A big step for someone involved in taking photos for over 40 years. I purchased the Sony Mavica CD 400--what a great choice. It has the feel of an SLR, has the ability to add equipment-similar to that used with my SLR cameras, and the ability to view the pictures immediately.  It also has many great features included in the initial packaging---everything to start!! I like the idea of the mini CD for picture storage, and multiple ways to download the pics taken.  I will continue to use my 2 SLR cameras, but like the challenge of this new, fun digital camera.Jackie NNew Hampshire", "Date": "April 24, 2003"}, {"Title": "love this camera", "Author": "Brandon Immers \"Brassmann\"", "ReviewID": "R1WCQR2O1LSL5F", "Overall": "5.0", "Content": "This is the best digital camera I have ever used. I have even bought a spare camera (MVC-CD400 it is sitting quietly in its box) just incase I where to ever break it beyond repair ;)Ya its that Sweet!!!Brandon", "Date": "November 18, 2003"}, {"Title": "Not \"state of the art\" anymore but still a solid camera", "Author": "Amazon Customer \"eaglesong3\"", "ReviewID": "R2JHAL9SJWC1S6", "Overall": "4.0", "Content": "This camera has a wonderful feature set and a SOLID form factor.  I love its weight and the way it fits my hand.  The software offers all the features that an amateur or intermediate photographer needs as well.  All in all a wonderful device.  In fact, this one was purchased to replace the exact same model.  I've had it for years and the charging port finally gave out on me so now I use this one to charge both battery packs and I have two great cameras ready to go whenever I am.", "Date": "September 8, 2013"}, {"Title": "Flawless service and a fine product", "Author": "JTCoyote", "ReviewID": "R3JEYVCPQ76FVB", "Overall": "5.0", "Content": "\"The Mavica CD400 camera arrived well packaged 3 days after I ordered it... It is better than described. It functions flawlessly and takes beautiful pictures in all conditions at all settings from macro to full telephoto. Whether bright or in low light, the subjects are recorded accurately and clearly, this includes the movie function as well as stills. I am more than pleased with the product and must praise the flawless service William1942 provided in this transaction. Overall, it's well worth 10 stars. Thank you.", "Date": "August 7, 2013"}, {"Title": "great camera", "Author": "C. Sidari", "ReviewID": "R1CXW3L0WVMZVN", "Overall": "5.0", "Content": "I've owned this camera sinse 2002 and I have not bought a camera that can take great pictures like this one. And I've bout some really good cameras... you wont be disappointed in this one !", "Date": "November 6, 2011"}, {"Title": "After nine years of use, I'm finally ready for a change", "Author": "Roger Bruner \"Author of Christian fiction\"", "ReviewID": "R1C94PMPDSOP3H", "Overall": "4.0", "Content": "I've had my Mavica since the early 2000s, and it's been great overall.My only real complaints are these: When turning the camera on, I'm warned that it would be better if I used genuine Sony Mavica CDs. A minor nuisance.The real problem lies in the vulnerability of the files (and consequently of the disk itself) during the interminable seconds required to write the file to disk. And when the setup operations warn not to vibrate the camera, they mean it. I've lost several CDs that way--fortunately I was still able to upload to a PC.I'm expecting a camera using some other type of media to be faster and more secure. Considering the age of this camera and the limited megapixels, it takes great pictures, but it's time to move on to even greater pictures.", "Date": "September 16, 2011"}, {"Title": "My opinion on the MVCCD400 CD Sony Digital Camera", "Author": "Gary Orlando Sr. \"Gary M. Orlando, Sr.\"", "ReviewID": "R32ZNPJNFLRCX", "Overall": "3.0", "Content": "This WAS a great item.  I like the idea of the photo going directly on a CD, but now the camera is way outdated.  4MP with 3X Optical Zoom is just not powerful enough to use practically!  I'm looking for a more powerful \"direct to CD\" digital camera now.  Any suggestions?????", "Date": "December 7, 2010"}, {"Title": "Excellent all around, supreme for travel, but limited", "Author": "James Wilkins \"J.W.\"", "ReviewID": "R12AWT64DOX1J", "Overall": "4.0", "Content": "You have read the rave reviews about this camera and I completely agree with them. This is a most excellent digi cam to travel with. But it has a few limitations which can be very annoying to some photographers.My experience with this camera involves a 6 month stay in Thailand where I used it extensively. I also used a Cannon Rebel 2000 with 28-80 stock lense and a Quantary 70-300 W/macro lense, plus an Olympus p/s zoom all weather camera. From the thousands of shots I took, here is my opinion:The Sony's resolution is much greater than the 35mm counterparts. This makes for much more satisfying large prints (8x10++). This is most important for landscapes and sunset shots. But I found a few limitations.For sunsets, I found that the Sony created fuzzy shots of the sun during a sunset when the sun was still a bit high, where the standard Cannon Rebel 2000 delivered crisp views of the sun's orb - much more satisfying. Maybe it's just a limitation of the digital sensor/VS standard film, but a limitation nonetheless. As the sun sank lower, the Sony photos were better. The best sunset pictures I took were with the Sony, but only after a brightness threshold was passed.(I used a filter on Sony equal to -1.5 stops) One other limitation of the Sony is the exposure time. It is limited to 8 seconds. This is OK for most applications, but I wanted more. 8 seconds is very limited when I want to shoot static nighttime shots. Many pictures came out OK(excellent, actually), but I lust for the unlimited (bulb) setting of the Cannon Rebel 2000 . This is not available with the Sony. Also, the Zoom is limited, and I like interchangable lenses, which is impossible with the Sony. That limits my shot selection.Using ISO 400 can be unproductive(noise!), but still satisfactory for night snapshots with flash.The Sony is a GREAT camera for the regular user, excellent for travel, and fun for the more inventive photographer (full manual mode). But it's limitations can hinder the more serious photographer who is looking for professional results.", "Date": "April 21, 2003"}, {"Title": "MVC-CD400: How to take a darn good idea and make it better!", "Author": "\"mikejensen1\"", "ReviewID": "R14RPNS5M5BY3P", "Overall": "5.0", "Content": "The MVC-CD400 is a new model of Sony's established mini-CD burning cameras, along with the MVC-CD250, replacing the CD200 and CD300 models. So why would Sony need to upgrade anything you ask? I was actually asking myself the same thing at first. I was getting ready to drop down the money for a CD300 model when I heard a new design was coming out, so I started doing some research. I found that Sony has done a nice job of directly addressing many of the failings of the CD300/CD200 units, and added some especially nice touches to boot! The most noticeable change up front is that the built-in flash unit has moved from the upper left side of the unit to right over the barrel. This helps with avoiding shadow effects when taking up-close shots. Additionally, they have addressed the single most commented-upon flaw of the 200/300 series: Viewing the LCD screen in bright sunlit conditions. They have added a clear 'strip' along the top of the LCD panel that allows ambient light to help back-light the LCD screen, and the results are frankly good, making the LCD significant more usable in all lighting conditions without having to buy the 'viewfinder attachment' that Sony sells for the Mavica CD model cameras. The third significant change is the addition of a standard flash adapter, allowing one to use external flash units with this camera for better lighting when needed. It is important to note - apparently it is critical to make sure you use a normal low voltage external flash instead of a studio-quality high-voltage unit, as this may damage the camera!Like it's previous generation brothers, the CD400 includes a Carl Zeiss Vario-Sonnar lens for high quality (professional?) photography without the distortions you may sometimes find in the 'corners' of shots taken through some lower quality digital cameras. It also upgrades the CCD from 3.3 megapixels to 4.0 or so, which means even more detail can be captured for folks who are interested in capturing everything possible. The other unique addition is Sony's Hologram AF system, which uses a laser emitting diode to put a crosshatch pattern on your target prior to snapping the shot, letting the autofocus get better accuracy when dealing with situations that sometimes confuse traditional autofocus routines. Sony's batteries also are decent, giving a typical user 2+ hours of uninterrupted shooting before needing replacement, and then recharging in ~45 minutes. And of course the mail selling feature for most folks, myself included - the photos are saved on mini-CDs, rather than one of the various memory stick/card units. Mini-CDs are dirt cheap per MB compared to memory sticks, and typically store ~150-200MB worth of photos, depending on make. Sony of course recommends you use only their branded disks, but many folks are reporting no problems using other manufactured brands. Depending on CD used, this translates into ~10 photos at the absolute maximum resolution (2272x1704 in TIFF format) and quality through ~1300+ photos at 640x480 at standard quality (JPG).As an added feature, you can record movies with audio with the camera also, though the image and sound quality are not comparable with a digital video camera so if video is your passion, go look for a video camera, not a digital still camera. Otherwise, this is a nice little bonus. I had resisted the urge to purchase a digital camera for a long time, waiting both for the photo quality to start approaching that which could be found with 35mm cameras, and for the means to get the pictures into a usable format on the PC to become cheaper or easier. Mini-CDs work in nearly all modern CD drives on computers, and I have not run across one yet that failed to work, though I admittedly tend to have relatively modern equipment at home and work. (Nothing older than ~3 years old at least in terms of CD drives.) The MVC-CD400 is an answer to every criticism I've had about digital cameras for the last few years. I'm enjoying mine greatly!", "Date": "May 30, 2002"}, {"Title": "Piece of crap!", "Author": "Robert J. Heinz", "ReviewID": "R3NT2G8F58AHCY", "Overall": "1.0", "Content": "Bought this camera brand-new back in 2002.  Was satisfied with it until this weekend when it totally quit working, won't turn on now even with the A/C power supply (instead of battery back) plugged in: Nada, zilch, zip, kaput, dead-as-a-friggin'-doornail. Another piece of disposable throw-away Jap crap {sigh}.", "Date": "September 25, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "4.1 megapixel sensor creates 2,272 x 1,704 images for prints at sizes up to 11 x 14 inches\n3x optical Carl Zeiss Vario Sonnar zoom lens and 2x digital zoom with 5-area multi-point autofocus\nStores images directly on 156 MB 8cm CD-R or CD-RW (rewriteable) discs\nDiscs can be read by virtually all Mac and PC CD-ROM drives  (not currently compatible with Apple iPhoto)\nUses proprietary Infolithium rechargeable battery (NP-FM50 )", "Name": "Sony MVCCD400 CD Mavica 4MP Digital Camera w/3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41ETCLPanJL._SX300_.jpg", "ProductID": "B000066HU9"}}