{"Reviews": [{"Title": "Kodak Easyshare CX7300", "Author": "Lisa R. Myers \"hsmom22\"", "ReviewID": "R2YDVV0S9ZKX7E", "Overall": "5.0", "Content": "I love this camera!  I have had it for 5+ years and it is still going strong.  It takes wonderful pictures indoors and out.  The only thing I don't like about it is that the camera flash is very bright. Eventually I will get a new camera and give this one to my daughter.  It does everything I want it to do.  It isn't my first digital camera but it is my best one so far.  The batteries do wear out quickly.  I love the rechargable batteries from Kodak.  I have only had to replace them once in all the years I have had it.  I would definitely recommend this camera. Kodak EASYSHARE CX7300 - Digital camera - 3.2 Mpix - supported memory: MMC, SD", "Date": "February 2, 2009"}, {"Title": "Very good little camera!", "Author": "Scott", "ReviewID": "R37RD73OIXPVK8", "Overall": "4.0", "Content": "We've had this camera for about 4 years now, and it has held up nicely. I can't even remember how many times I've dropped this thing and it still works same as the first day I used it.For a cheap digital camera the pictures come out very clear, with minimal touch-ups. I hung this camera out of a car window driving through the Smoky Mountains and I got quite a few nice pictures.Definately recommend it!", "Date": "May 14, 2008"}, {"Title": "Great Camera", "Author": "Ralph R. Santillo", "ReviewID": "R26NR1TZTBE0J0", "Overall": "5.0", "Content": "I have owned this same camera for about 5 years and after dropping it too many times the battery compartment wouldn't stay closed. So I was glad to find one in such good condition and hope it will last just as long or longer. I would recomend this camera, it takes very good photos! It is easy to use and a very good camera.", "Date": "May 19, 2009"}, {"Title": "Good, reliable camera!", "Author": "Elaine Benes", "ReviewID": "RRLOG49X6EL7S", "Overall": "4.0", "Content": "I've had this camera for 4 years, it was the first digital camera I had, and it was actually won by my father in a contest.It has held up very well, after being dropped more than once, and works well in all weather conditions. It does also take good, clear pictures for being only 3.2 megapixels. There is some downsides to it, though. It doesn't have many features, as far as settings, and it doesn't have a manual zoom. It also has no LCD screen to take the picture, so you have to take it through the viewfinder. I can't even count how many times the camera has been used by someone other than myself, and I have to tell them not to look through the screen and to look through the viewfinder, or they ask me why they aren't seeing the picture as their taking it. I usually tried to tell people beforehand, but in some situations, the camera was used quickly and I couldn't. I've also found that even with the red eye reduction feature on, I've often gotten red eye in my photos. The batteries are also an issue. AA alkaline batteries don't last very long at all in it (of course battery brand also may have something to do with that) and the Kodak rechargable NiMH battery was a total waste of money, as it never stayed charged for long at all and was really frustrating, as it would always die at the worst times. I stopped using that one after the first year or so of having the camera. The best batteries for it are the AA digital batteries.Overall, the camera ia very good for what it is and does take good, clear, everyday photos. It's a nice little camera that I'll keep as a backup, even now that I own other digatal camera(s).", "Date": "December 27, 2008"}, {"Title": "Hardy & Limited", "Author": "P. White \"Los Desperados\"", "ReviewID": "R3ML3PT87V4WA5", "Overall": "3.0", "Content": "I find this camera a little frustrating at times because it is so limited when it comes to settings. It's horrible for pictures indoors but works OK outdoors. You can't manually zoom! That is something I can't stand about this camera.I often have troubles with the flash and it would be nice if the screen was bigger.I got this camera used so maybe this is caused by it's previous use but when I press the button it takes around ten seconds to take the picture. In a situation when I'm trying to capture something moving this can get annoying.I wouldn't recommend this camera.Some things I do like is how simple and easy it is to use as well as it's durability.I've had this camera for a little over two years and I've dropped it several times and have even gotten it a little wet a few times and it still works fine.", "Date": "October 22, 2008"}, {"Title": "use camera", "Author": "Wendy E. Binnie \"Geoff's Gal\"", "ReviewID": "R1HHKTGOCBZT2O", "Overall": "4.0", "Content": "I was pleased that it Looked new and worked very well. Am not sure how to use the dock though.", "Date": "July 16, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Great for beginners\nVery easy to use\nSimple file transferring to your computer", "Name": "Kodak EASYSHARE CX7300 - Digital camera - compact - 3.2 Mpix - supported memory: MMC, SD", "ImgURL": "http://ecx.images-amazon.com/images/I/21F7SAG252L.jpg", "ProductID": "B0006VXHTO"}}