{"Reviews": [{"Title": "Highly Recommended", "Author": "ADAM STANHOPE", "ReviewID": "R3M38UA1U70LH3", "Overall": "5.0", "Content": "I bought the Nikon Coolpix 7900 for my wife and daughter.  We couldn't be happier about it.I have a Minolta Dimage A2 which is larger, heavier and more expensive and has a lot of manual adjustment capability.  A small part of my almost regrets lugging the A2 around because the Nikon is so small and light and performs so well.It has been perfect so far for any sort of snapshot we've used it for.  If exclusively taking snapshots was all I did, I would definitely replace my A2 with one of these.  I'm keeping and continuing to use the A2 because of hobby non-snapshot photography, but will be borrowing the Nikon from my wife and daughter for anytime I need a quick, easy camera for snapshots on the go.One note:  We had a Nikon Coolpix 3200 which we enjoyed very much.  The 7900 is a nice upgrade from that.  The only disappointing change for us from the 3200 to the 7900 is that the 3200 uses AA batteries while the 7900 requires a special rechargable battery.  It lasts long, so no complaints there - but it was always nice with the 3200 to be able to grab two AAs on the road rather than recharging.", "Date": "June 14, 2005"}, {"Title": "Great Upgrade Camera  - very few trade-offs", "Author": "Russell Janecka", "ReviewID": "RF8CQ9KXE1OWL", "Overall": "4.0", "Content": "I have years of photography experience and teach a digital photography continuing ed. class in our local junior college. I've used the Sony DSC-P9 camera for the last few years. I was looking at the P100 or 200 as an upgrade option.The shape and style of the camera and its price first caught my eye.  I compared it to a very similar camera that was $200 higher but with limited extra features.  I chose this one.After reading these reviews about the complaints over focus in low light I became concerned and started shooting around my house (with regular 40watt ceiling fan lights). The results are as expected - the camera did fine. The major problem when shooting in low light is certainly shutter speed. You'll never be able to hold a camera still enough for 15th of a second shots. (30th of a second only if the subject and you are still) The camera obviously gives priority in several of its scene settings to image density, sacrificing shutter speed for capturing enough light to give an adequate shot in very poor lighting conditions.With searching through the options and choosing the right assisting modes (Manual focus spot selection, Auto Bracketing, etc.) and with 'Best Shot Selector' the photographer is given the ability to hold down the shutter and the camera assists you by obtaining the most still shot!But as always - if you MUST take pictures in dim lighting, use a tripod!!  If you want absolute great clarity, you need an SLR camera with larger lens elements (more glass) to capture more light and focus specifically like you want to MANUALLY.  (more money)This camera offers a great trade-off and improves on previous generations' flaws by speeding up flash charging, offering rapid exposure's (1.7 per second) and many assisting modes that take a little learning curve to adapt to your shooting style, but in the end - a really good value!  I'll keep mine.", "Date": "September 9, 2005"}, {"Title": "My first point and shoot", "Author": "Adam Fick", "ReviewID": "R1KFVCQGQZB0T3", "Overall": "5.0", "Content": "After using a Nikon N75 for 2 years and being extremely pleased with it I decided I needed something a little smaller for play/work to pack around with meFirst impressions of the camera are very good, it fits my hands quite nicely, which is often an issue because most digicams dont fit my hands very well.The 2\" screen is very nice and smooth when panning around a scene and works well in direct sunlight, I can actually see it (compared to a Canon A80 which i cant see anything in the sun)The camera starts up very quickly (after diabling the animation) so that is nice for being able to snap pics. The camera is ready to go before you get it up to your eye after turning it on.The low light focus is a little poor, but for the other options that the camera has I'm willing to overlook itThis camera has no chromatic aberation in high contrast screens, so there is absolutely no blue fringing in any of the pictures.  This was a big selling feature for me as the blue fringing that the Canon A80 & A95 had were completely unacceptable to me.  Especially after using a real SLR camera.I find the autofocus quite quick under normal conditions, and it works quite well. The zoom is smooth and has a number of incremements that you can zoom by, not like some other cameras that seem to have a preset number of zooms, this one you can just bump the button and it will just zoom a wee little bit!I know some people are complaining about the camera taking a long time to write pics, this is because they have the in camera red eye fix turned on, and then the camera has to analyze the image to fix the red eye.  Simply turn the red eye fix off and it writes the images nice and quick.As for the people that say that it wont take a image in focus, I'm not sure what your talking about, I've taken lots of pics with it, and it either tells me with a \"vibration warning\" that it needs more light (flash) or that the picture is blurred and asks you if you want to save it or delete it.The scene assist modes are quite nice such as the panorama assist mode, it leaves a phantom image on 1/2of the screen so you can line up the next shot so that they line up easily and stich together well.There is an option for landscape shots, and an option to divide the screen into 9 parts so you can fram you shots properly, and thats just scratching the surface......!One other note, I bought a Sandisk Ultra II 1GB Secure Digital card, and I tested it against a regular Lexar SD card that we have at work and the Sandisk Ultra II is more than 2X faster on writing to memory.  I would highly recommend it.Overall I am quite happy with the camera as a secondary camera.  If you were looking for a camera for primary use in all situations, you may be dissapointed with the low light focus, but I haven't had many issues with it yet", "Date": "May 29, 2005"}, {"Title": "Nikon for the MAC", "Author": "PECCINI Thomas", "ReviewID": "RK3QIC2AKT681", "Overall": "5.0", "Content": "I am a life-long Nikon user; this is my third camera in 18 years. Never bought or used anything quite as good.  We bought a Nuvis S (APS) five years ago because at that point the quality of digital cameras was really poor. Decided to take the leap into digital photography with the Coolpix 7900.  After reading a lot of the reviews of this and other cameras, I find these misleading. A lot of them should be categorized by type of user: professional, hobbyist, casual user, etc.  which would qualify a lot of these range of opinions. My wife and I like to have the camera around to take pictures of our kids and of places we go and I enjoy taking interesting shots or portraits.  My wife wanted a camera that could at least take short movies since I am not one of those dads to have his hand stuck on the digicam for every occasion.  We wanted good quality digital pics and our budget was between $300-$400 and and we wanted to make sure this camera was compatible with our Mac (iMac G5) and our iPod Photo.Why the Coolpix 7900?#1 BRAND, brand, brand.  I was not happy with the Nikon Nuvis S and was ready to abandon the Nikon ship until one day I was chatting up a photographer who told me how the technology of APS film works and why it is so grainy.  So, I looked at other friend's APS and the quality was worse than with my Nuvis S.  So, it wasn't so much the Nikon but rather the film type.  APS cannot match up to 35mm.  Anyway, after checking out Canon and Konica/Minolta, I didn't get the impression from the description that they were offering a superior product to Nikon. Why does Nikon have a good reputation?  Nikon is first and foremost a company that manufactures professional cameras.  Simply put, the technology developed for these top shelf models makes its way down to models that average consumers can get their hands on at affordable prices.  They are still a bit more expensive than other brands, but marginally so now.  Considering what you get for your money, you actually get what you pay for. Not a sleek plastic box with average technology, like the popular Canon models.#2 PRICE POINT:  We got this camera for $335, which retails for $400.  The price point for the next superior model, the Coolpix 8700 (the top of the line Coolpix 8800 is $800) was @ $650.  The only difference between this and the 7900 is 8x megapixels, rather than 7x megapixels found in the 7900.  Since we are amateurs, it didn't make a whole lot of sense to spend that amount of clams.  I paid around the same for the other two Nikon I have bought in the past 18 years.#3 MEGAPIXELS: this is what you need to know about digital photography.  The higher the megapixels, the clearer the picture. 7x megapixels is available at reasonable prices this year.  Just two years ago, our friends bought a Nikon 5900 with 5x megapixels for $500.  Don't buy anything less, you'll be disappointed.  We took a few pics and then uploaded them to iPhoto on the iMac G5 and in a word... WOW!  Amazing; quality you see in printed books! Every time I upload pics to the computer and use them as wallpaper they exceed the quality of the photgraphs that came standard on the Mac and I am amazed.#4 QUALITY AND RANGE OF OPTIONS: Again, Nikon is the leader in bringing a lot of bells and whistles first to the consumer market. Each of the features listed by Nikon under the product description actually work and are functional, though I probably will never use the direct printing feature.  I was a little overwhelmed by the range of options at first but you'll learn them by just playing around with the camera, this is half the fun! Very easy to use and well-laid out on the camera. In your hand, the camera feels small but solid yet not cheap.  It is very compact, too;  I thought it would be bigger from the pictures.  It is the size of a family size bar of soap.  Very ease to tuck in places but not too small where you'd lose it.#5 FEATURES: Other reviews complain about poor-quality photos in low-light situations.  As an owner of this camera, I, too, have had this problem but once I learned that you have to go to SCENE mode and choose either Backlight or Indoor  to correct lighting deficiences then-- problem solved.  You cannot shoot low-light photos in MACRO mode. Duh. I did a test photograph between these two modes and the Backlight feature was incredible.  The differences between these two photographs were amazing. I think these reviews are from users who haven't learned how to use the camera.  Other complaints are of Close-ups.  Again, you have to enable micro-close-up (from the main menu) so the camera knows to enhance the image while shooting in MACRO mode.  Otherwise, just blurry.  I have been shooting food in close-ups and they are so clar you can almost taste them. That clear.  The short movies are great and the sound quality is excellent. They have exceeded my expectations.  They must be transferred from iPhoto to iMovie and then they are automatically played on QuickTime software. Very easy.  We also hooked up the camera to the TV for a slide show, the cable was included.  Very fun to show family and friends or to a group.Things you need to know before BUYING/USING camera:-You must buy a memory card if you want to use this with some regularity outside of the house, away from the computer. The internal memory is very little. Thus, as with ANY digital camera, you have to figure in another $25-$50 for a decent-size memory card. We bought a 512 for @ $45 and it had 80 pics on it and two movies when it ran out while we were away for a few days.  I erased some unwanted pics (you'll find you'll be taking several pictures of everything so get in the habit of clearing all but the best pics before you upload them to the computer, to save space both on the camera and the hard drive) and I kept taking photos.  Not really a problem.  Just remember to upload and erase original photos from the camera before heading away from home.-Install software before uploading photos.  iPhoto randomly fails to upload certain movies.  We called Nikon and the problem wass fixed when we installed the software.  The pics/movies upload to Nikon's \"Picture Project\" and then we just transfer them over to iPhoto.  Easy and not time-consuming.Overall, money well-spent and EXTREMELY satisfied with this purchase.  We highly recommend this to people who have the same needs as us: user-friendly, point-and-shoot, amateur hobbyists who wanted a movie feature and not super savvy with technology or fussy about photographic details and fit in with our iMac and iPod Photo technology.", "Date": "August 10, 2005"}, {"Title": "Nikon Needs to Get Focused", "Author": "Capt RB", "ReviewID": "RIBQ6HGUP79SY", "Overall": "2.0", "Content": "The 7900 sure is an attractive little camera with it's sleek body and high mega pixel count. Like several other Coolpix cameras, including the Nikon 8800, this camera can't focus well in low light. I don't know why Nikon continues to release these cameras with the same flaws. The AF system on the Coolpix line is contrast based and in less than ideal lighting it can lock focus, but get wrong repeatedly. You can visit DPreview.com and Nikonians.com for more info on AF weaknesses with the Coolpix line.This is a serious warning for buyers! Website forums for Nikon are filled with rabid supporters of the products, even when they haven't tried them. Another funny move is when the focus problems are mentioned by someone they quickly post a shot taken on the dark side of the moon! What exactly does this prove? The 7900 CAN take a low light shot, but it will often miss the shot as well. Don't trust samples taken in low light since you have no idea how many missed shots it took to get it. Buyer's remorse makes camera owners say and do anything to defend their purchases.Point blank: The 7900 has poor auto focusing compared to MANY other cameras. To make matters worse it has a VERY weak AF assist light just like the 8800. Insult to injury. A Pentax Optio S5i focuses better in low light without the lamp and costs far less. A Canon A95 also has superior focus ability, though not the best of it's class. High count sensors mean little when you miss a shot due to focus, right?When the 7900 DID get the focus right, images seemed slightly soft overall. While it has many modes there's no real manual control of the camera. This is not good for the growing photographer or the shooter who likes to fine tune.There's little point in discussing the Nikon's other merits. Inability to focus in many indoor settings is a deal killer. Like the 8800, I have no idea why Nikon can't do what other designers have done at half the cost. I own a Nikon D70 DSLR and I LOVE IT, so I'm not bashing Nikon. I just don't know what the problem is with their line of P&S; units. The 7900 I tested belongs to a friend and she's returning it for a Canon A95 or Fuji 550.", "Date": "May 3, 2005"}, {"Title": "Nikon 7900 Fills the Small Camera Niche", "Author": "bluffwalker \"bluffwalker\"", "ReviewID": "RPSXLX3KOOXFR", "Overall": "4.0", "Content": "I currently use three digital cameras: a Nikon 7900, a Canon S1 IS and a Canon Digital Rebel XT. I take about 5,000 photos a year and have been using exclusively digital cameras since 1999.The number of pictures taken per camera is inversely proportional to the camera size, mainly because big cameras are a pain to lug around. I purchased the Nikon 7900 to have a unit that I could wear on my belt (be sure to get the Nikon case with its extra battery compartment). Whether I'm walking or bike riding, the 7900 is easy to take along and less likely to get left lying on stump or café seat because it's attached to my belt like a cell phone.The Nikon 7900 takes great pictures. If any shots have been blurry, the problem has been my error -- either motion or choosing the wrong scene mode. A word of caution about the leather case: it fits like a glove but also is likely to cause the mode dial to turn when you insert or remove the camera from the case. You need to check the dial setting frequently.The best way to prevent motion blur (outside of using a camera like the Canon S1 IS with image stabilization gyros) is to take photos using the eyepiece-optical viewfinder rather than the LCD monitor on the back. When you look through the eyepiece, at least one hand is braced against your head. Most people have enough balance and nervous control to hold their heads fairly still. Not so for your hands and arms holding a camera away from you so you can see the LCD monitor. Use the LCD for changing camera settings and reviewing shots, not for composing and shooting pictures. In this regard, the Nikon 7900 eyepiece is no prize. It typically shows only about two-thirds of a scene and displays no camera settings.I like the Nikon 7900's clean design. With my Canon cameras, it's not uncommon to accidentally change a setting by touching one of the many buttons on the back. That's less likely to occur with the Nikon. The Nikon's scene modes are helpful once you take the time to read the user manual. Creating 7 megapixel images is overkill unless you really expect to publish a photo, and such large files bog down transfer and processing on the PC.  Transferring images via the USB cable works smoothly, but the camera connector is smaller than other mini-USBs (like the ones on iPods, Rio music players or my other cameras).My favorite camera of three I own is the Canon S1 IS, but I am pleased with the Nikon 7900 purchase. It fills the niche for a small camera.", "Date": "August 22, 2005"}, {"Title": "Best point and shoot in class", "Author": "Biggsy", "ReviewID": "R264PZUFQIVS61", "Overall": "5.0", "Content": "I have had nothing but great results with this camera. Make sure to read the manual and reviews to help you adjust for best picture quality. People have been complaining about the poor AF lamp again I've have great results, I'm not sure what is causing thier poor results. I compared this to the Canon SD500 which is also a great camera, I ultimatly like the pictures out of the Nikon better. The thing that sold me was no purple fringing around objects with the Nikon. I would encourage people to try both, the coolpix 5900 is a great 5MP version of this camera.", "Date": "June 4, 2005"}, {"Title": "One Of The Best Deals Right Now!", "Author": "Martin A Hogan \"Marty From SF\"", "ReviewID": "R3CNPB43UFM9ZU", "Overall": "5.0", "Content": "This tiny camera has it all!  It is far easier than my old HP Photosmart 3.2 and my Canon 2.0 with easy to learn features.  It has it all, including `fireworks' mode!  The best are the various `tones' you can give your pictures.  Just look at all the technical specifications here and you'll be amazed!  I like that I can video in three different modes with great sound and that I can film in so many different modes (headshot, distance, fireworks, nightscape, backlight, etc.) that you can never screw up.  Plus it is 7.0 pixels which is really incredible even when you crop half a photo!  Unlike most small cameras, the buttons are easy to navigate.  It also comes with all the extras you need (listed in the specifications).  Don't settle for anything less than 7.0 pixels, as within a year anything 5.0 or under will be obsolete.  I love this little thing and bought all the accessories it didn't come with (which were few).", "Date": "June 13, 2005"}, {"Title": "Great overall, but low-light non-flash focusing is disappointing", "Author": "Robert Scott \"Glistening Pig\"", "ReviewID": "R63G6XVEWQRWJ", "Overall": "4.0", "Content": "For the first two days, I seriously wanted to return this camera.  I had an older Canon Powershot A310 that half of the time took reasonable pictures at low-level light, and was used to not working with the flash.  I still had my old camera when I was first trying this one out, and took about one hundred shots with each camera in the exact same setting.  The low-light pictures almost always turned out bad/unacceptable.  If you want more casual, less obstructive photography during family events or dinner or things like that (I hate interrupting things with the flash!), this camera might not be for you.  On the other hand, I found that the best pictures I took with the old camera were with the flash.  I thought I would hate the Nikon, at first.  But then I got to get to know it a little better...  The refresh rate on the screen is very high, and the screen takes up much of the back of the camera.  I am very pleased with the screen overall.  The buttons, which take a bit of messing around to get to know, are moderately user-friendly, as is the menu in most cases.  One thing I don't like is the lack of manual focus- there is a way you can choose what the camera focuses on, but it involves the camera auto-focusing on a particular spot that you can designate- you don't really have control like you would on an SLR, which eats at my soul.  The macro setting is my favorite.  This camera has a very good macro lens, although it does have some trouble focusing when the object is less than an inch away.  I found myself getting the camera focused using my hand, then locking the focus (by pressing down halfway on the main button), and then moving in close the the desired object.  Macro works great under most conditions.  I sometimes have to prop it up on something, or use a tripod, or hold REALLY still for it to take good pictures.  I took this camera with me on a vacation in Oregon and took about 1500 pics; I had, of course, some bad ones, but many many of the pictures I took were very good, and I even have some printed.  The flash!  The camera works wonders with its flash.  Just to see how well it would work, I began spinning the camera around in circles, and letting the camera focus and take a picture by itself, not watching.  Most of the time, indoors, the flash let the camera focus very well, and only rarely (when I really spun it fast) did the picture turn out blurred.  The casing is great, the camera is small, and fits in pockets (mine), although the extra SD cards and batteries basically require a small camera holder, with zipping pockets.  I love the look of it, and it feels solid.  The scene assist modes, accessible by a spin dial, are very helpful, although I found myself mostly using the \"automatic everything\" setting, and the macro setting.  The portrait ones are useful, as is the landscape, but I found satisfactory results with the regular mode.  The movie mode is good, nothing very special; I recorded some very memorable things with it, and am glad it comes with the camera, though it's not a highlight.  3x Zoom is about standard; personally, I would like more, but the 7.1 megapixels makes up for that slightly (big pictures can be zoomed in a bit, and still retain their good appearance).  The seven megapixels ROCKS MY SOCKS completely.  I absolutely love them, all 7,100,000 of them.  Massive pictures can be cropped (for instance, I took a pic of a whole plant, then cropped it into a great looking single-flower-shot, and printed it).  Can't say enough how much I love the megaMegapixelage of this camera.  BUT!!! BE SURE TO BUY AT LEAST A 512mb SD disk!!!!!  Mine didn't come with a card, which didn't mean anything to me- most cards that ship with cameras can only take a few pics at the highest resolution, lowest compression.  I have three 512s and a 1gig card.  Overall, I am very pleased with this camera, although there are definitely a few things that I don't like: bad low-light focusing without the flash, focusing problems on REALLY close objects in macro mode, and the extendible lens.  If you think you would like to take many pictures indoors, or away from bright light, then I would consider getting a different camera.  I would definitely buy this again; I consider it one of the best purchases I have made.  I just wish Nikon would get its autofocusing gears into action, and give me low-light non-flash capabilities!", "Date": "August 6, 2005"}, {"Title": "Great Little Digital Camera", "Author": "Howe Yawl \"Buckeye\"", "ReviewID": "R1ASAJ83PA1C71", "Overall": "5.0", "Content": "After quite a bit of research on digital cameras on the internet and at local retail stores, I chose the Nikon Coolpix 7900.  At less that $400, it was a great value.  I just came back from a quick trip to Rocky Mountain National Park and am completely satisfied with all the pictures that I took.  Most of the time, I had it set on the Landscape setting and the colors and focus were so crisp and clear.  The 7 MP image on this camera is awesome.  A bird flew into a picture as I snapped a picture.  Using the zoom on the image, I could tell the type of bird and what he had in his beak.  It has more settings that I will ever use.  I played around with the Fireworks setting on July 4th and got some fantastic images without even trying. I was glad that I paid a little extra for the rechargeable battery and more megapixtels than the 5900.  The battery lasted for 200 pictures and probably would have kept going when I recharged it.  I am very happy with the purchase and would be amazed if there was a better deal.  You will need to purchase a memory card and a carrying case.  I got a 512 mb card, which has about enough room for 200 of the 7.1 MP pictures.  I got a great holster case at Best Buy.  What a deal for $400.", "Date": "July 12, 2005"}, {"Title": "A slick package and easy to use.", "Author": "Lucky Andy \"Lucky Andy\"", "ReviewID": "R206CKZX6C10SY", "Overall": "4.0", "Content": "I had an earlier version of this camera and so bought this one to upgrade. I especially like the Scenes Mode. My favotite is Museum. We travel a lot and visit places that flash is not allowed. This mode is excellent.Another feature I like is being able to change scene modes with the rotary dial. I kinda wish the Museum mode was one of the selections. However, the selections are useful ones, easy to get to with the turn of a switch.I've have found the battery life to be good. I just recharged it yesterday after using it over a month around the house.I like to feel of it and the styling, especially the black case. It looks like a camera! The viewfinder was one of the reasons I bought the camera. There are times, in bright sun you cannot see an LCD screen.I give it 4 stars right now. I have yet to use it a lot, but so far I am satisfied.", "Date": "September 29, 2005"}, {"Title": "fantastic pocket digital", "Author": "B. Pollock", "ReviewID": "R3FMJMXHHCDVKZ", "Overall": "5.0", "Content": "I have recently purchased the Nikon coolpix 7900, and well...I love it I've worked for a Ritz Camera store.  And now work for Best Buy.  So i had many options to choose from and this one came out on top! Many people say this camera doesnt focus well in low lighting and there dead wrong! All they need to do is put it in one of the 16 scene modes to find an easier way to do it.  The super ccd(part that records the image) is awsome at 7 mega pixels and it takes super crisp shots.  the en-el5 rechargeable battery capeable of 220 shots on a single charge isnt bad either and its only $30 for an extra battery.  there are three down sides that i have found on this camera.  the  flash wasnt positioned in an ideal spot many times having an occasional finger over the flash.  and the indepth in-camera menue it takes a couple of pages to get to where you need to be.  It could be quicker too. Nikon has done well and they made an easy to use pocket digital with a punch.  Good Job!", "Date": "September 25, 2005"}, {"Title": "Great Little Camera", "Author": "C. Park", "ReviewID": "R3M9BHEPHV8I88", "Overall": "4.0", "Content": "Although I have used digital cameras in the past, primarily Canons, this is the first one I have owned.  After looking at pocket-sized digital cameras for a long time (I'm a careful shopper) I finally bit the bullet and ordered the Nikon 7900 a week before I was to leave for vacation.  A quick read through the manual and a bit of playing around with the camera was enough to learn the basics before setting off.  I purchased a one meg memory unit and was able to get 300 pictures with the camera set to 7 megapixels and the fine adjustment. I am very happy with my purchase.  I was leaning towards a Canon product but the Nikon seems to have a better lens and I like the controls better on the Nikon as well.  I used the macro and panaramic features while on my trip and found that they worked well.  My only real complaint is the function dial on the top of the camera - the detents are not strong enough to keep it from being accidentely rotated, especially when inserting and removing the camera from the Nikon case.  I did get into a habit of checking the setting but only after several incidents of finding I was unintentially in movie mode (the movie mode is only one click away from the normal setting.)  Initially I thought the upper end Canons looked cool and the Nikon Cool Pixs were kind of dorky looking but I've grown to like the look of my 7900 and I am very happy with the performance.", "Date": "August 1, 2005"}, {"Title": "What glitters is not always gold.", "Author": "J. Schell \"Dr. Schell\"", "ReviewID": "R1ENVVO12DM9N4", "Overall": "1.0", "Content": "I had this camera for 14 days. I went to the store to buy the Canon SD500, and the design of the Nikon Coolpix 7900 grabbed my attention. The sales person informed me that the only difference between the Nikon and the Canon was the name.She was wrong.In a series of 100 photos, the Nikon took around 6 crystal clear shots. The remaining 94 shots were blurry and lacked quality.I upgraded my Olympus C3040 (3MP) with the Coolpix 7900. My Olympus outperformed the Coolpix in all respects, except for battery type, weight, and size of camera.When I returned the camera to the place of purchase they asked if I was sure I was \"doing it right.\"  I am an artist and published photographer. I've been taking pictures with digital camera for 5 years. I carefully read the instructions, I even called Nikon to ask for assistance.This camera cannot take QUALITY photographs consistently. Especially in low light. Bottom-line--I found it to be a horrible camera. A typical case of what glitters is not always gold.I returned the camera for the Canon Powershot SD500 and my first three photos were pristine.Good luck,JAS", "Date": "May 13, 2005"}, {"Title": "Like anything else...read the directions", "Author": "Magilakuty", "ReviewID": "R3BB4TRD9HPF6O", "Overall": "5.0", "Content": "I am a PhD student and work with microscopes, dissecting scopes, laser microscopes, electron microscopes and several digital imaging software programs daily.  I get to use a lot of high-end optics.  I also am an avid photographer and hiker and spend a lot of time taking pictures both outside and inside in both high and low light conditions.  I wanted to get a camera that would be lightweight for hiking, have flexible settings for low light and versatile optics as I routinely take both landscape shots while hiking and intense macro shots for both labwork and my own curiosity.  I initally was going to get a Canon Digital elph SD500 but at the store made the decision to get the Nikon because it was 20% cheaper and able to take macro shots with a shorter distance between the end of the lense and the object than the Canon (both minimum focal length and working distance were decreased).I could not be happier with my decision.The 7900 captures macro shots that blow my mind.  In the lab I have started to use my personal 7900 for close up shots over our Zeiss set up with a $10,000 digital camera attached to it.  I no longer carry a magnifying glass in the field but instead just take a shot with the 7900 and zoom in on the image with the LCD screen on the camera.  It is more effective.In low light the camera is able to take great pictures using the manual focus feature.I have noticed in some of the other reviews that there are quite a few people who must not have properly read the directions that came with their camera.  If you are taking a low-light shot, any camera will have problems focusing on an object because the light being reflected by everything is weak and contrast can be reduced.  In low light it is essential to manually focus on an object and first and foremost to use a tripod.  If you are taking a 7mp shot and using a slower shutter speed to compensate for the weak amount of light it is physically impossible to hold the camera still enough to allow it to properly focus on an object or to get a clear picture.  There is just too much vibration in anyones hands for that.If you use the many features that are on this camera properly, any kind of shot is possible.It has been pointed out that the camera has no manual mode.  This is true, there is not a setting for manual mode.  But when using cameras from other manufacturers, the Canon Elphs for example, the features that make up the so called manual mode on these cameras are also offered on the Nikon 7900 (saturation control, white balance, manual focus, exposure length, etc.), they are just integrated into every mode instead of having a devoted manual mode.  So I don't think this is an issue provided you read the directions and learn how to properly use the camera.The case is beefy.  I have accidently dropped mine several times and even accidently sent across a street sliding and bouncing on the asphault after falling out of my pocket.  The case was scratched up but the electronics still work fine.If I had one complaint it would be that the Nikon software that comes with the camera is pretty bad.  I luckily have access to other imaging programs but if the Nikon software is all you had you would probably be in bad shape.  Also, I would imagine if you were trying to do artsy kinds of photography and need precise numbers for settings you will probably not be happy with this camera.  However, it is a point and shoot and if you want to do anything artsy that is what SLR's are made for.  With anything you always get what you pay for.Overall I think this is a great camera and would make any buyer happy.  I really would recommend getting a tripod for any 7mp camera though and definately recommend you read the instructions carefully - the camera can do a lot!", "Date": "December 9, 2005"}, {"Title": "focus is not a problem!!!!", "Author": "P. Roots", "ReviewID": "R50484XWWGUTF", "Overall": "5.0", "Content": "some have said this camera gives bad focus... its because they are using the camera wrong!!!! In poor light conditions it adjusts its exposure time and shows a warning that the picture may become blurred. Its not the focus that causes this but rather the motion blur during the extra time required. The Best Shot Selector gives an easy solution...  it takes upto 10 pics and then automatically selects the clearest picture.. giving crystal clear results. Isn't it better to have this small inconvienience than to return poorly lit under-exposed pictures!!All other features on the camera are simple and effective as far as I can tell. This camera gives a whole range of features to enable great pictures... you really can trust all the good reviews this camera has received.", "Date": "January 13, 2006"}, {"Title": "Sweet Little Thing", "Author": "Kailua Steve", "ReviewID": "R3N25Y9KK9AI6F", "Overall": "5.0", "Content": "My wife's Nikon SQ died so I wanted to get a *small* travel camera as a replacement. The 7900 is indeed small. It takes great photos outside and will take good full frame 30 fps movies until the SD card is full (bar graph on screen). I've taken blury low-light candid photos w/o flash, but most are due to camera movement rather than focus problems (when looked at in Photoshop). The camera is a little /too/ small for me to grip steadily and hold against a door frame for candids. It'll be a great travel camera for her. Large LCD, good battery life, 7MP images, Image Stabilization.Disappointed that it's built in China like most everything else and Noise Reduction mode is a little too painterly for me -- I'll clean up my images myself.", "Date": "May 7, 2005"}, {"Title": "Not without its flaws...", "Author": "Beemer903", "ReviewID": "R3FIXXPB3928HM", "Overall": "4.0", "Content": "I have bought many Nikon digital cameras over the years, having always trusted the brand since my film days. Like every coolpix I have owned, this one excels in many ways but is not without its flaws. The picture quality is very excellent - however, the lighting conditions must be good. Under low lighting conditions, and even with the tepid autofocus assist lamp, the results are mediocre to bad. Indoors at night with only a couple of lights on in the room, the camera frequently struggles to find focus. I have overidden the Auto ISO feature, because I found it was often whacking it up so high, it was introducting noise. Outdoors, this camera is superb. The images are razor sharp from edge to edge, and the zoom is of very high quality. The much marketed 'face priority' is a neat gimmick, but it requires some very specific conditions to work properly (distance from camera, still subject, etc.) With my little 18 month old twins, I cannot get face priority to work because they move around too much for the camera to lock-on. The camera is compact, the same size as my other Coolpix 5900. I bought a high-speed 1gb SD card which will cover an entire weekend of shooting. The battery life is incredible, and the LCD screen is much bigger than the 5900 and other Coolpix's in this range. For more professional shooting, I use my D70 -- even though it is a 6mpx camera and the 7900 is a 7mpx camera, there is no comparison between the D70 and 7900. But, then again, the lens on my D70 cost three times as much as the whole 7900, so it's the same old cliche: you get what you pay for!", "Date": "August 12, 2005"}, {"Title": "Just what I wanted", "Author": "cary \"palmster\"", "ReviewID": "RYMS53EEZ835J", "Overall": "5.0", "Content": "I'm sold on Nikon!This camera has everything I was looking for.  I wanted something compact, with the largest screen possible for the size, a viewfinder, high mega pixels, a compact rechargeable batter solution, and good quality results.  I found this and more with this camera.I wondered about going with Nikon's proprietary battery solution instead of standard AA batteries.  The battery recharger for this unit is much smaller than the AA rechargers I could find, and the battery lasts much longer than my previous experience with the AA batteries.I didn't think I cared about having 7.1 mega pixels, but now I see the advantage.  I can crop and zoom pictures from this camera without loosing the resolution I was used to with my older Nikon.I also have a Nikon 950, which I love, but this little wonder goes with me everywhere.  I also got a 1gb SD card for this unit (recommended).I just started using the Video Recorder and am just amazed at the quality and convenience.  I'm capturing video clips at a moments notice because I'm able to carry this camera with me pretty much all the time.I really can't compare this to other brands, since I don't have experience with any other digital camera than Nikon.  It was my past experience with Nikon and comparing price and features that led me to decide on this camera.  So far, I'm not disappointed.  The price on Amazon was great and the overnight shipping actually happened.Thank you Nikon and Amazon!", "Date": "July 19, 2005"}, {"Title": "A little camera with huge results", "Author": "Adonise \"Wlakshouyaba\"", "ReviewID": "R3MAOSBDHZO08W", "Overall": "5.0", "Content": "When I bought this camera I wasn't sure if I made the right choice but after using it for a few days I'm now absolutely content. Cosmetically speaking, this is definately a beautiful camera.It is compact in size(comparable to Sony SD400 or Kodak V550), very easy to use(even without reading the manual) and most importanly it takes some stunning pictures which I'm very impressed with. And although this is not a video camera The Video quality I would consider very good. I'm giving this camera five stars because for it's price I think it's the best buy out there and this time around \"good things did come in a small package\"!!!", "Date": "August 9, 2005"}, {"Title": "Great resolution, takes excellent shots, but....", "Author": "S. Heath", "ReviewID": "R1VORUU5XR6NJW", "Overall": "4.0", "Content": "Bought this for our anniversary trip to Cancun.  Took tons of shots at the beach, at Chichen Itza, all over the penisula.  I also bought a FantaSea underwater camera case and the camera took great underwater photos (it even has a special underwater setting).  My only down side was that I wish it had a greater optical zoom.  I was torn between this camera and an Olympus with a 10X optical.  However, it was only 4 MPix.  I took a Chichen Itza pic and blew it up to a 4x4 letter sheet size (roughly 34\" x 44\") and it still looked great.  I framed it and have it over the couch in the Den.  Looks like you are sitting in front of the pyramid!  Still I think it's great.  Would have given 4.5 stars, but not an option.", "Date": "August 24, 2005"}, {"Title": "nice point & shoot camera", "Author": "Guy M. Kitashiro \"gkitash\"", "ReviewID": "R2A1JKZQSBF1X", "Overall": "4.0", "Content": "I purchased the Coolpix 7900 as a second digital camera; my other camera is a Coolpix 5000 (semi-pro).  Although the 5000 is a more flexible camera, I wanted a camera that was simpler to use than the 5000.Overall, the 7900 is an excellent camera; however, the caveat in product reviews about less than desirable low light performance are correct.  The camera's maximum sensitivity is 400 (the manual does not recommend this setting when using the flash) and 200 when the camera is set to automatically use the flash.The 7900 is a 7 megapixel camera, but the maximum quality of a stored photo is around 2 MB (JPEG).  My Nikon 5000 has a raw mode and can store photos at the full 5 MB.The above comments are rather critical and I don't wish to leave the impression that it's a bad camera.  I like this camera and think it's a very nice point and shoot camera.  It has a lot of nice features such as a macro mode and a selection of preset modes for a variety of shooting situations.  It also takes short video clips with sound.  I recommend this camera with the exception of it's low light performance (taking flash photos on evenings out in less than fully lighted venues will be disappointing).", "Date": "December 29, 2005"}, {"Title": "Inconsistent", "Author": "MFP \"MFP\"", "ReviewID": "R3Q37HRUV1X4AF", "Overall": "3.0", "Content": "First, let me say that I am a great Nikon fan. I bought the 7900 after owning the 3200 because I was seduced by the 7 megapixels. I agree with the reviewers who contend that the camera cannot always find its focus. Moreover, the general quality of the pictures is ... well ... inconsistent. Sometimes you get an eye-popping shot; othertimes, under very similar conditions, a disappointing shot.On the whole, there is much to commend. Incredible next-shot speed (almost no time at all), large screen, good handling, excellent compact size that permits you to take the camera anywhere, good value.So I'm not all that unhappy, but I wish the camera were more consistent and could focus better.", "Date": "December 21, 2005"}, {"Title": "Excellent camera", "Author": "Davin A. Widgerow", "ReviewID": "R2G8RK6MEZVUWW", "Overall": "5.0", "Content": "Ver reliable, stylish, and loaded camera. The 16 different scene modes allow for creative impulse and contextual photos, always producing detailed and clear pictures. The camera struggles somewhat in very low light, especially with focusing, but unless you're prone to low-light photography, this camera will stand you in good stead.", "Date": "July 27, 2005"}, {"Title": "Excellent camera", "Author": "R. Ross Rodgers \"rossinmt\"", "ReviewID": "R1B59UKQDWWKXS", "Overall": "5.0", "Content": "I'm puzzled by some of the reviewers who said they could not take clear, focused pictures.  I've used this camera for about five months and have many prints of 11x14 and larger that show excellent focus, resolution, and clarity.  As several professional camera review sites on the web have noted, the auto focus sometimes does not work well in dim light; I'll take their word for it, but it hasn't been a problem for me.  I have found the menus and command sequences for close-up, portrait, and other special situations to be excellent -- though they do require you to read the very well-written manual to learn all the tricks.  I have recommended this camera to several people, all of whom have had excellent results with it.", "Date": "November 2, 2005"}, {"Title": "Great little camera", "Author": "L. Nygaard", "ReviewID": "ROGO89AYTR1Y2", "Overall": "5.0", "Content": "I bought this for a once in a life time trip to Paris.  It took wonderful pictures and did better than my sisters Olympus digital camera.  The colors were fantastic and had no problems with the focus.  Have used it often since the trip, too.", "Date": "October 22, 2005"}, {"Title": "Fun!", "Author": "Rimi U. Lebeouf \"missadeline\"", "ReviewID": "R19GT0RR4JOUS4", "Overall": "4.0", "Content": "I always wanted a Nikon because the pictures always seem to take eye-candy like colors. I like that. So I bought this camera a month ago and I'm having so much fun with it. It's very small and sleek, so I have found it to be easy to whip out and take a pictures.If you own a blog, journal...etc this camera is perfect. The colors are bright and vivid, and is very accurate with people's faces. (it doesn't distort faces and objects like a lot of camera's do. For example some cameras will add weight on to a person) If you want to be a little artistic macro mode is fun to play around with so is black light!The camera has so many specific settings and options already set up for you that anybody can use this camera. It's got a black light setting, sunset setting, snow/beach setting, party/indoor setting...etc. It's a fun little camera.Albeit it's NOT A PROFESSIONAL CAMERA. I don't know why \"professional photographers\" want to buy this kind of camera? I think it's more for the average Jane or Joe like myself with not a lot of experience with cameras.I gave this 4 out of 5 because it doesn't focus well under low LOW light and it doesn't have super lightning fast speed.Next im getting a canon powershot, that everybody seems to compare this too. I like both brands very much so don't worry there no bias here.", "Date": "August 6, 2005"}, {"Title": "Perfect shirt pocket camera", "Author": "Dev Purkayastha", "ReviewID": "R2X8E72RYK5875", "Overall": "4.0", "Content": "I have been an amateur photographer for quite a few years. My frustration has been all the shots you miss. So I was looking for a shirt pocket camera I can use when I am not specifically going out to take pictures. I really like the 3X zoom. I have given it a 4 star because I would have liked a bigger zoom range and optical image stabilization. Nikon should do a deal with Panasonic for better zoom and OIS. Then it will be a 5+. Well there is next year. I have been happy with the image quality.", "Date": "July 14, 2005"}, {"Title": "Not as sharp as I would have liked it...........", "Author": "Susan Weiss", "ReviewID": "R3L8CUTVSWQR1", "Overall": "3.0", "Content": "Too fuzzy for my tastes as a point and shoot for people pictures, seems to expand everything in the middle and just not that sharp.  3x digital zooms are horrible.BUT after putting it on a tripod, putting it on time delay and setting up a light tent, with floods, I was able to take the most beautifully sharp product shots.Produced top notch photos.  What I really needed it for was product shots anyway.  Am happy with the ones I got.", "Date": "April 7, 2006"}, {"Title": "I have the Blurry out of focus issue too", "Author": "Timothy \"Timothy\"", "ReviewID": "R1I2CZSJ3T52F7", "Overall": "3.0", "Content": "I decided to buy the Nikon coolpix 7900 because of its size and the \"guide\" feature which make taking picture idiot proof for everybodyAfter using it for a month, I am really disappointed with the picture quality.Initially, I thought the Nikon coolpix 7900 camera was defective, but after reading some of the review here, I realized that I am not the only person who is issue with it.8 out of 10 pictures that I took are out of focus. Don't get me wrong, it is not very burry, but when you view it 100%, it is very obvious.I agreed with the previous user who commented that the 7900 has poor auto focusing compared to MANY other cameras. I think Nikon seriously has to work on the focus.One thing I do like about the Nikon is the battery lifespan. It last a long time.Pardon me, I am not here to bash Nikon, just sharing my experience of owning the coolpix 7900 camera.", "Date": "September 26, 2005"}, {"Title": "Read The Review On Steves-Digicams", "Author": "shift_bank", "ReviewID": "R37OI337MM5YHC", "Overall": "4.0", "Content": "I am very happy with my Coolpix 7900.  However, I will not provide a critique.  Instead, I recommend reading the review on [...]  It contains a detailed description of the camera specifications as well as helpful example photographs and an example video taken with a Coolpix 7900.  This is the review I relied upon when making my decision to purchase my Coolpix 7900.  Furthermore, I can now confirm without reservation that it is an extremely accurate review which other consumers will likewise find very helpful.", "Date": "August 12, 2005"}, {"Title": "This one will blow your mind out", "Author": "E. Huy", "ReviewID": "R1PHTITIA86YI4", "Overall": "5.0", "Content": "I have this camera for 3 years never had a Mojor problem wih it.Also have Nikon D70s for 4 yearsI never liked point and shoot camera but when my mom got this one I was surpise. I never liked point and shoot because of its zoom. But as I used it, I learned Its almost better then any SRL Cameras.  I use it when I go to Partys or away from home.(Prom) I have nikon d70s but I dont wanna break it so I brings this one. I like it alot of those featurs it has. I NEVER HAD a problem with it. The A/F is ok but some times its blurry.I like when it has the night vision so you can see what you about to take. I use it during prom and was suprise it had it. Other people was suprise too with it.PRO:- VARY easy to use.- It has Auto fix the picures when you take them(you can turn it off if you dont like it). It will make it more colorfull if you want it.- Its small.- The view finder has night vision before you take the pictures. Then the flash comes- Has a way to zoom in your pictures so you can see what you have- camera does warn you that the shot is blurred or no good. It will ask you if you wanna redue it.- Good pixels (7.1)- Has different modes; night, indoor, party, fireworks mode, 360 mode(forgot whats it called sry its late) and others- Nice battary life.- Nice Black and white Pictures(I gotten some cool Pictures with this mode. (Its cool!)Cons:-Some blurry shots but not alot.-The veiw finder(the one on top) is Little off then the lens(that shows whats on the screen)- Little bit slow to start up(you can put your own greeting pictures evertime you start up the camera.) Dont know if you can shut it off or notOverall: I highly recommend it. If you can afford it. GO FOR IT.I never had a problem with it. Dont know why other people hasAlso, im a college student not some person who wants to Rip how bad this camera is. I tell the truth not like other people.", "Date": "November 7, 2007"}, {"Title": "Best one yet", "Author": "Mark Burkhardt", "ReviewID": "R2DIXRMU40BUUE", "Overall": "5.0", "Content": "Everything it should be. Easy to use. unbelievable Phote quality and colors. Love the Lithium Ion battery. Small is good for carrying but there is a limit to how small I want for handling reasons and this is it. If availible I would opt for a larger LCD screen. Still has viewfinder. Really important for good shot composition.", "Date": "January 3, 2007"}, {"Title": "THIS IS AWESOME", "Author": "IndyKaren", "ReviewID": "R1R1TD22JIGF8G", "Overall": "5.0", "Content": "I got this in June and it has good pics. and works good.  Has good features and prints good with HP Printers Thumbs up to NIKON", "Date": "January 17, 2006"}, {"Title": "Love it!", "Author": "L. McNeil", "ReviewID": "R1EOPBE8VL4K6A", "Overall": "5.0", "Content": "This is a wonderful little camera.  I love that I can slide it into the pocket of my jeans, fanny pack, or even into my tiny formal purse.  It has a neat curve that seems to feel great in my hand as well.I've not had trouble with pictures being out of focus that others have complained about... even when the light was dim.  Hmmm...I have a Canon Rebel X and I haven't really used it since I got a hold of this little camera.", "Date": "January 11, 2006"}, {"Title": "Fine little camera", "Author": "JCB,HIFIGUY", "ReviewID": "R1XWJK01JW7SFN", "Overall": "5.0", "Content": "For its class, this camera is about as good as you can get.If you want a tiny deck of cards size camera,look elsewhere, as this jewel has a wonderful handgrip protrusion and a lens housing that also protrudes rather than being flush mounted.These protrusions give the camera the look of a mini professional camera.Much easier to hold than a deck of cards camera,though tougher to fit in your back pocket.Fine photo quality and relatively easy to use.It is a tiny camera, some reviewers expect these little things to have the photo quality and features of cameras costing $1000 or more.Not fair.My girlfriend has a Kodak V550, which overall, I can say is about as good, and also as good looking.If you want a small cam, this one is a no brainer.", "Date": "November 24, 2005"}, {"Title": "Smooth Operator", "Author": "J. Gomes \"Speakeasy\"", "ReviewID": "R3P9ZRF728HSES", "Overall": "5.0", "Content": "The Nikon Coolpix 7900 has everything one might ask from a travel companion: user friendly without reaching for the manual every piss stop and cool crisp image for the delight of your eyes. Overall an excelent value digital camera on its own class.", "Date": "September 23, 2005"}, {"Title": "Check out my pic's before you buy anything else!!  (G rated)", "Author": "kbodo", "ReviewID": "R2CI687BHW1G4H", "Overall": "5.0", "Content": "Nikon has an awesome line of point and shoot cameras. I used my Nikon camera on my recent trip to Hawaii. I used it in all conditions with excellent results (even while driving). I have blown up several pictures into 8x10 and they look great! I have posted several pictures on my space. Please feel free to check them out.[...]Honestly I can't say enough about my camera...I shot pictures from the airplane that look as if I was hang gliding and others from a catamaran sailing trip with a lot of motion and all the pictures are in focus with vivid colors and great depth of field. I even caught dolphins jumping out of the water....Check them out on my space click on \"view my profile\" then \"view more pics\" you can then click on each picture thumbnail for a larger view.", "Date": "August 12, 2005"}, {"Title": "Not As Bad As Some Have Claimed But Not Perfect", "Author": "K. Morrison \"Cealdi\"", "ReviewID": "R9APPFP482VIA", "Overall": "4.0", "Content": "This camera is nice in the way that it's small, lightweight, and looks fabulous. It's bad in the way that it's slightly difficult to get a really great picture with it. I used to have a Nikon Coolpix 4300 that seemed to take clearer pictures than this one. I have no idea how that's possible but in any case, it's not as horrid as some people have claimed but it's certainly not the best camera ever by any means. I took it on a few vacations and out of say, 120 photos taken, probably only 75 were \"good ones\" in my opinion. With a film camera I wouldn't complain but I think with digital, there shouldn't be as many bad shots. With my 4300 it was virtually impossible to take an ugly picture, so it seems to me that this one should be better, not worse.", "Date": "January 30, 2007"}, {"Title": "Am I seeing Crooked?", "Author": "R. Agoglia", "ReviewID": "R3MNW3GYNEMR9R", "Overall": "4.0", "Content": "I love the camera, although I think when the manufacturers built mine, they put the 2 inch LCD monitor in crooked.", "Date": "February 2, 2006"}, {"Title": "I do love this camera", "Author": "katydaly", "ReviewID": "RT2UDIY9QZH3L", "Overall": "4.0", "Content": "It is certainly perfect for a point-and-shoot digital. It is easy to use even if you don't read the manual, but when you do you will find that it has many different ways of manipulating shutter speed and light. It takes some getting used to if you are just switching from an old SLR, like I did, but you can pretty quickly figure out how to get the best shot by changing the modes.For me, the biggest advantage is the size. It is not so small that you cannot hold it easily, but it is small enough to keep in my purse and take everywhere. Being an artist, the large photo size is necessary for my use in printed materials. It is definitely not a camera for a professional photographer, but for my use as a graphic artist it is perfect. Photos are 7.68\" x 10.24\" at 300 dpi. Even the Nikon software for downloading photos works well on my Mac, playing back both the short movies and photos in a slideshow with music, if you like.I highly recommend this camera for people who want something better than just a cheap digital to take snapshots with, but aren't willing to pay the price for a more professional model.The disadvantages I have noticed:I wish there was a stronger zoom. I used to have a separate telephoto and wide angle lens on my SLR, and I miss the range that I had with those.There are some blurry shots, especially on indoor, or low-light outdoor pictures, but the camera does warn you that the shot is blurred, so you can try a different mode, or try harder to hold still, and retake it.You definitely need a camera case, the preview window on the back is large and exposed, where the lens is protected automatically when you shut off the camera.Buy at least a 512 mb flash card, the internal memory is limited.", "Date": "November 2, 2005"}, {"Title": "Nikon Coolpix 7900", "Author": "Louis A. Coronato", "ReviewID": "RYKUXFDZS01UF", "Overall": "5.0", "Content": "Everyting it was represented to be. Small, high resolution, great pictures, easy to use and carry in your purse or pocket at all times.", "Date": "September 7, 2005"}, {"Title": "Attention: MSRP $399.95", "Author": "S. Yang \"Gadget Tester\"", "ReviewID": "R2YMDY2CSZ0AQI", "Overall": "5.0", "Content": "Heads up, Amazon customers.  Nikon's MSRP for this camera is $399.95.  Why do some sellers expect to get away with $699.95?  Talk about price gouging!", "Date": "December 16, 2005"}, {"Title": "Good, not great, camera", "Author": "vrknoise", "ReviewID": "R1AM8ACSXJTW9O", "Overall": "4.0", "Content": "I've had this camera for over four years. I'll start by saying the picture quality for outdoors, well lit subjects and macro shots are outstanding. This camera really shines outside. Get to know the menu and some of the features about the white balance settings and you can make some drastic adjustments to your picture quality and color accuracy. That said, this camera is not one of those cameras that will give you a well focused but grainy picture in a low light situation. Some cameras will give you this option but this camera only wants to take a sharp, detailed picture. This can be frustrating if you just want a point-and-shoot to capture quick shots while you're in the bars at night or just indoors at home. Dusk can also be a frustrating time to use this camera. There's comes a point where the light fades and the camera begins to struggle; with focus, picking up a clear shot, capturing that soft purple light as the sun goes down, etc. I have tried ALL the different settings and I understand what this camera is capable of. Yes you can get a tripod to capture the low light shots and it will do okay - still not great. Picture quality becomes very poor with the flash. The light is extremely harsh. Colors are washed out, skin tones are not captured nicely resulting in an 'unflattering' picture. I even tried covering the flash with several layers of scotch tape to soften the light, to no avail. This camera also tends to give a subtle fish-eye effect on subjects within about four feet. Macros don't seem to have this problem. I am impressed, however, that my Nikon went for an accidental swim in the river last summer and after allowing the camera to dry and recharging the battery the camera still works! Ever since then my picture quality has diminished and there is a new, slightly hazy quality, but I realize it needs to be taken apart and cleaned. Not the camera's fault. Overall, at the price I'm seeing right now (about $190 USD) I would recommend getting this camera expecting beautiful daytime landscapes and macros.", "Date": "December 4, 2009"}, {"Title": "Just what I wanted", "Author": "Lorraine \"Librarian\"", "ReviewID": "R1510O963XDJNO", "Overall": "5.0", "Content": "The Nikon 7900 has the feature that I most wanted in my next camera - tiny size.  I have the D70 but wanted something that I could carry most all the time and this one fits the bill.  Of course it can't do everything and I don't expect it to.  The pictures so far are wonderful and I am very pleased with them.  I researched several different cameras and finally decided that if small was what I wanted then small was what I should get.  Having been a photographer most of my life I have acquired many cameras but there has always been that shot I missed because I had not packed a camera somewhere on me.  This one is small enough to put in my purse or pocket and keep with me.  I am pleased with the quality of the shots and have taken the time to read the manual and check out all the menus on the camera. It's really fun to have a camera so tiny that takes such great shots.", "Date": "August 19, 2005"}, {"Title": "Nikon Coolpix 7900 vr samples", "Author": "Paolo Smeraldi \"www.paolosmeraldi.com\"", "ReviewID": "R15CETDFP5CZX9", "Overall": "4.0", "Content": "I have bought a nikon coolpix 7900 vr, as i liked its high resolution (7 megapixels) and video capability: here are the results of my tests.1) Normal high resolution (7 megapixels, fine compression) photos: [...]2) Videos, 640x480 with electronic stabilization (the original videos are quick time .mov) [...] [...]3) Panoramic photos, mosaic of 7 megapixels images made with a tripod and Arcsoft software (bundled with the camera) [...]4) Experimental high resolution low framerate video made with Virtualdub and the xvid codec: [...]After all I like this camera. Low light performance is poor; I do not have experience with other cameras, but as soon as it gets cloudy you will start having problems.ByePaolo--[...][...][...]", "Date": "July 2, 2005"}, {"Title": "Great Until It Broke", "Author": "Ronnie Dickson", "ReviewID": "R3JIRGNF93HJI4", "Overall": "1.0", "Content": "I really liked this camera until if stopped working.After about a month, I would get a lens error, indicating that the lens could not slide out.  I did some research online and found this to be a common problem with this camera.  Apparently the lens can get knocked off the rail that enables the lens to slide in and out.", "Date": "September 2, 2007"}, {"Title": "best at its price", "Author": "G. R. Harris Jr.", "ReviewID": "R2FRDQRBA7RJ1A", "Overall": "5.0", "Content": "the cool pix 7900 is one of the easyist to use on the market.the clarity of the photos is exceptional,i would recommend this camera to begining & advanced digital photografers.", "Date": "September 12, 2005"}, {"Title": "Love It", "Author": "Heather Stevens", "ReviewID": "R3LHZ957P7F6LD", "Overall": "4.0", "Content": "I just got this camera a couple of days ago.  It takes wonderful pictures right out of the box.  I am very happy with all the pictures I have taken with it.  Very easy to use.", "Date": "August 5, 2005"}, {"Title": "nice pocket camera but...", "Author": "H. Rashid", "ReviewID": "RRKS31WWEI2MA", "Overall": "3.0", "Content": "its good for quick use when professional considerations don't matter, but if you view this product critically then nikon should be ashamed, first thing I notice was the lens motors are very loud so at the first look its \"Made in China\" all over it. very flimsy, if u drop it then its gone. I have a Cannon also which is made in Japan and you can really tell the difference with just looking at two. here are the main pains:1- Auto Focus sux, if light is poor then just get ready for blury pics.2- the ISO settings does not work properly.3- the saving and transferring of pics is just painfully slow even with fast SD card.4- Flash if used improperly makes everything look blue. I have not seen this happening in any other digital camera.5- the movie mode records in .mov files.6- plastic body is very flimsy, it should have \"fragile\" written over it.The reason I am giving 3 stars is because of nikon's colors and 7MP quality.I am just frustrated on \"Made in China\" products, there is just no quality in things anymore :( and amazon almost exclusively deals in made in china.", "Date": "September 5, 2006"}, {"Title": "Great camera", "Author": "C. Lettich", "ReviewID": "R2ZVNJ28JEI97A", "Overall": "4.0", "Content": "I love this camera!  I was most concerned about the picture quality, and it's fantastic! This camera is worth every penny!!!", "Date": "September 21, 2005"}, {"Title": "This is a gem & a fantastic little camera !", "Author": "B. GILLING", "ReviewID": "RJ6ISU1PFPT1R", "Overall": "5.0", "Content": "This is a gem & a fantastic little camera ! takes unbelievable pictures for its size highly recommended.Good battery life and once you get the hang of all the controls a powerful little camera that you can carry anywheresee my site for pictures taken with this camera [...]", "Date": "October 7, 2005"}, {"Title": "amazing camera", "Author": "N. Khan \"UrbanMotors\"", "ReviewID": "R2852BBNUH85WR", "Overall": "5.0", "Content": "amazing camera, was going to buy canon but very happy with the purchase", "Date": "September 10, 2005"}, {"Title": "It is one of the worst  cameras I have ever purchased", "Author": "A. Baker", "ReviewID": "R1KN5VP554Z4KI", "Overall": "1.0", "Content": "It was my fifth digital camera and it was the first Nikon \"DIGITAL\" camera (also probably my last). I bought it with the intent of replacing my current backup camera because of the brand name, higher resolution, movie mode, and the size of the camera. I have an Olympus digital camera model C740 with 3.2 megapixel as a backup camera and two other Nikon film cameras (model 8008s and F4..some of you might be able to tell from the equipment I use that I am serious about photography) and various type of Nikkor lenses which I love them dearly. I have been using nothing else but the Nikons for over 25 years (I don't have a camcorder..not yet anyway).I used to think when it comes to photography as long as I use \"Nikon\" products...I will not be disappointed. How wrong I was!! THIS CAMERA JUST CANNOT TAKE A CLEAR PICTURE. I tried to enhanced the sharpness of the image by using the menu with no success. Believe it or not my 3.2 megapixel camera produced much better image than this camera. By the way, I am planning to return this camera to the store.I was about to purchase the Nikon D100 which is one of the Nikon high end digital cameras but after this experience I think I will give other makers a try.If Nikon can correct this image quality problem. the Coolpix 7900 would be a nice little camera especially the movie recording cability (640 x 480 at 30 fps WITH no time limit).So my final word...do not buy this camera unless you know a store that will let you return without re-stocking charges.", "Date": "August 23, 2005"}, {"Title": "Bold and Beautiful", "Author": "Nilendu Kumar Pattanaik \"Blue Nile\"", "ReviewID": "R2B62EURCODIZR", "Overall": "5.0", "Content": "The slick 7900 is handy and comes with a superb performance throughput. Black color makes the camera sophisticated. With ample options to have pictures of different aspects..it's worthy to be called as Owner's Pride and Neighbor's Envy....", "Date": "September 27, 2005"}, {"Title": "Failed to Work Right Out OF Box!!!!", "Author": null, "ReviewID": "R3OWE4TIR1LXGB", "Overall": "1.0", "Content": "This camera did not work after I charged and inserted the battery.  This camera did nothing after I pressed the ON button.  It just does not work!!!", "Date": "August 11, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "7.1-megapixel CCD captures enough detail for for photo-quality 11 x 15-inch prints\n3x optical zoom through a quality Zoom-Nikkor lens (zoom is equivalent to 35-105mm in a 35mm camera)\n2.0-inch LCD display; exclusive Nikon In-Camera Red-Eye Fix\nMacro shooting as close as 1.6 inches\nPowered by a Lithium-ion battery (included); stores images on SD memory cards", "Name": "Nikon Coolpix 7900 7 MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51Z20JXCRML._SX300_.jpg", "ProductID": "B0007KQWEQ"}}