{"Reviews": [{"Title": "nothing what I expected", "Author": "Rhian Smith", "ReviewID": "R2EUNNTN969KD6", "Overall": "1.0", "Content": "I bought this for my grandson who really wanted to learn to take pictures.  But he wanted to be able to see them or get them made into photos.  This does not have an SD card.  You have to load the pictures to your computer, burn a disc and then get the photos made from that.  Too complicated for an 8 year old.", "Date": "September 3, 2012"}, {"Title": "Not what was pictured", "Author": "Matt", "ReviewID": "R4UAK7ZX1KE0L", "Overall": "1.0", "Content": "whats shown on the preview is a small square camera silver cameraShift3 Multi-function 3-in-1 Usb Mini Digital Camera with Keyring (VARIOUS COLORS), what i got was this oval shaped green thing that wont sit flat on a table picture at [...] completly disipointed in this seller, the name says it all: cheep", "Date": "December 20, 2012"}, {"Title": "Photos erase when battery dies", "Author": "Clarissa", "ReviewID": "RZLR1L0MP1IW3", "Overall": "1.0", "Content": "I bought this camera to keep in my backpack for whenever I need a photo. Unfortunately, I found out that it has no lasting memory AND it drains batteries very quickly even when not in use. When the battery dies, all my photos disappear. I regret this purchase.", "Date": "November 26, 2012"}, {"Title": "digital blue american Idol camera", "Author": "Mark Twain \"nursey\"", "ReviewID": "R2A5JMUXMHJZJR", "Overall": "5.0", "Content": "I really don't know why I bought this thing. But I haven't used and don't plan on using it.Just one of those things.", "Date": "May 2, 2012"}], "ProductInfo": {"Price": "$4.99", "Features": "The Perfect Digital Camera To Hook On Your Keychain\nAdd Background Images - Type Treatments - Frames - and More\nThrow It In Your Pocket and Go\nDownload Into the Special Software and Put Yourself on the American Idol Set\nTake Pictures of Yourself and Friends Then Edit with Images From the Hit TV Show", "Name": "Digital Blue American Idol Mini Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/31a0GtmLvhL.jpg", "ProductID": "B000FAICKK"}}