{"Reviews": [{"Title": "Great Camera for the price", "Author": "Joshua Anchan", "ReviewID": "R17NSTBI2QVBZY", "Overall": "5.0", "Content": "this is a great little camera to tote around and basically capture your life.obviously it's not for the professional photographer but I would definitely recommend to any casual picture taker.4 megapixels seems perfect in terms of the size of the picture file and the quality of the image. The 3x optical zoom (true zoom) is also cool because it helps you takes close-ups without affecting the quality of the picture (which i've found digital zoom, or regular cropping to do).My only recommendations would be to get rechargable batteries (you'd only need 4 because the camera uses 2 at a time) and atleast a 128 mb xD card.", "Date": "January 18, 2007"}, {"Title": "fuji 4.1 megapixel a360 camera /  memory card", "Author": "A. Ramirez \"goddesslinky\"", "ReviewID": "R2YCEEAK3NQOQ3", "Overall": "4.0", "Content": "I've had my camera for a few years now, and it's still in gr8 condition.  I recently tried to get a new memory card for it, and found out that this camera can only handle up to a 1gb, not a 2gb.  Which still works out gr8, because even the 1gb holds a lot of pics. I just panicked when I tried to put the 2gb in, and the camera kept reading \"card error\"  I got scared and thought I needed a new camera, but this one still works gr8!", "Date": "February 4, 2009"}, {"Title": "Broke in less than 1 1/2 years", "Author": "Mary A. Brown \"Mary Brown\"", "ReviewID": "R10HP9O3R0FKA3", "Overall": "2.0", "Content": "I bought this camera at walmart, not amazon. It worked pretty good for the first year or so. Now I have to buy a new camera less than 2 years after this one. The shutter will only open 60% of the time and the photos are fuzzy in till you have to turn the camera on/off a few times and switch from camera mode to view mode. I want a camera that lasts longer!", "Date": "December 19, 2007"}, {"Title": "ZOOM ERROR...sound familiar anyone?", "Author": "Thomas M. Miller", "ReviewID": "R2WSG0EYWE8ZE2", "Overall": "1.0", "Content": "PLEASE, PLEASE, PLEASE avoid this product.  I should've done my homework.  I purchased this camera new in 2005 from Wal-Mart.  I thought it was a great deal because it came with a nice bundle package.  Besides, I figured it didn't matter what kind of camera I bought because I take immaculate care of my belongings.  I WAS WRONG.  I used the camera for a few months and it started flashing \"ZOOM ERROR\" in the viewfinder.  In a day or two the zoom lens wouldn't even come out.  Then, a few days after that, it wouldn't even turn on.  It's been in my desk drawer since spring 2006.  I read up on this camera on Epinions and here on Amazon and I kept seeing report after report of \"ZOOM ERROR\" problems.  What junk!!!", "Date": "December 2, 2008"}, {"Title": "Love this compact camera.", "Author": "Mary E. Luther \"starluther\"", "ReviewID": "RGOJ5O5WXKTHS", "Overall": "5.0", "Content": "This is my second Fujifilm camera, its great, we motorcycle ride and its great for me to take pictures from the back of the bike. The pictures are clear, wonderful, and easy to take. I have taken over 20,000 pictures with it, and hours of movies...and they are great. Hubby loves it because he gets to remember all the great places we have been. Glad Santa gave it to me.", "Date": "August 4, 2008"}, {"Title": "Best camera for the price!", "Author": "Deb Maubach \"Homeschool-Entrepreneur.com\"", "ReviewID": "RZ5XOSLM3T6X3", "Overall": "5.0", "Content": "My Fuji A360 was a gift to help ease the pain of losing my previous Canon digital and I thought I could never love another camera...but I was wrong! I found it easy to learn, only takes 2 batteries and they seem to last longer, and the picture quality is just as good. It's very portable, fits better in my coat pocket or purse, and has survived several drops on the floor (ouch!) . With 4 children and 5 grandchildren, this camera has gotten alot of use over the last 2 years and I have had ZERO problems with it. Would definitely recommend it-but be sure to get a 1-2GB SD card, camera does not hold much on it's own.", "Date": "July 25, 2007"}, {"Title": "not so pleased with this one", "Author": "Miranda Lamb \"mariah\"", "ReviewID": "R30I22EUI87NWA", "Overall": "2.0", "Content": "well i bought this camera for my first digital camera and at first it was working well and took mostly good pics then about less than a year into having the camera it started goin downhill. the battery life was not good at all even after putting new batteries in and the it started saying zoom error all the time. then finally about a month ago it just decided to not work at all. with kids i always like to have then camera ready, luckily i am getting a new one that has a lot more features and am really excited.", "Date": "August 13, 2007"}, {"Title": "Don't buy this product!!", "Author": "Donna K. Houstn \"TW\"", "ReviewID": "R1P62IMOYXIQRQ", "Overall": "1.0", "Content": "It takes terrible pictures! Most are blurred even on sport settings and the picture loses a huge amount of quality as you zoom! I hat this camera!!", "Date": "February 14, 2010"}, {"Title": "first digital camera", "Author": "S. Horsfield", "ReviewID": "RTS6E76FKYD5C", "Overall": "5.0", "Content": "I've had this camera for over 3 years and lasted me through college. It's great for a first digital camera at a low price. It takes great pictures. My only complaint is the zoom, next time I buy a camera I will look for 5x or greater because I do a lot of traveling and take pictures from afar. This camera is very easy to use- My dad was even able to figure out how to use it on a trip to Scotland without me having to explain much. If you're looking for an easy- to-use, durable, point and shoot camera this is a good buy.", "Date": "February 8, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000IEV188"}}