{"Reviews": [{"Title": "Fantastic Camera", "Author": "Zachary Wilson \"pretentious hack\"", "ReviewID": "R29E5CSUUDK6F4", "Overall": "5.0", "Content": "I purchased this camera in lieu of paying rent on my apartment for 4 years, and believe me when I say it was worth it.  I used the box that it came in as a hat and some other boxes for a home.  It's uncomfortable but the pictures I've taken of my new home are so sharp that you can see the fleas on the brick I use for a pillow.  I can also take high detail pictures of my children (who I am no longer able to see due to court order resulting from gross negligence) from an acceptable distance.  Highly recommended!", "Date": "August 7, 2009"}, {"Title": "Medium Format is Dead - and Hasselblad helped kill it.", "Author": "Stephen Marley", "ReviewID": "R1H8U1G9PF4THJ", "Overall": "1.0", "Content": "I've owned dozens of Hasselblad cameras for over 40 years and used them for high end ad work, as well as commercial/industrial photography.  Whatever you are doing in photography, you don't want to get tied to an extremely expensive system that hasn't figured out how to sustain itself in the volatile marketplace.  Ask any audio/visual media professional with 20+ years of experience - and they'll tell you that it's too easy to get locked into an ever changing technology that you simply cannot get a decent ROI from.  Hasselblad medium format cameras have become another one of those losing propositions.For many decades during the film years, Hasselblad cameras - like Sinar in large format view cameras -  were industry standards. You could expect to get many years of reliable service, superior optics and accessories and new products that allowed photographers to continuously upgrade.  That's the way it used to be.Since Hasselblad entered the digital age, they've changed business owners, as well as, their design/manufacturing philosophy and the results aren't pretty.  In a matter of a few years the company killed off the transitional cameras and their high quality standard leaf shutter lenses (camera models like the reliable dual film & digital 555ELD) and starting building numerous \"dedicated\" medium digital format machines. Goodbye Schneider & Zeiss, hello Fuji. Digital backs are dedicated - in place- and not interchangeable the way the old film and first generation digital backs were.  Most of their new efforts have been short lived and less than spectacular in reliability and robustness. Next generation equipment was incompatible with older versions, and worse still, incompatible with more recent introductions.The resolution and pixel count is not significant compared to the much more adaptable and robust pro DSLR's with FX format. Photographers must face the brutal facts - the useful life of any digital camera is much shorter than what film photographers of the past experienced. The professional market doesn't drive (or influence) the camera business the way it did in the past... and expensive cameras aren't always designed for professional use. Sometimes it's just because a market exists for folks who simply want to flaunt an expensive piece of \"jewelry.\"My advice for young pro's is to buy as inexpensive a system as you can work with and be prepared to toss your equipment within a few years. The days of treating pro camera gear as a long term investment are over. Don't believe me?  I've got nearly a dozen well used Hassy's, a high end SCSI-device drum scanner and a couple of $25,000 Sinar 4x5 Systems, that I'll sell you real cheap!", "Date": "January 16, 2013"}, {"Title": "Worth it for passionate commercial photographers", "Author": "D. Barker \"pixel-deep\"", "ReviewID": "R1SUJO8ZW18WRR", "Overall": "4.0", "Content": "I own a canon 1D4 and a Hasselblad H3D-39Its easy to fall into the trap of comparing the two cameras, but i have to resist the temptation.  The canon is so convenient and durable, and can produce quality images for 90% of the jobs i do.  But when we get a job that requires the big gun, im glad i have it.  The 39 megapixel 16 bit files are amazing to work with in post.  You can change colors and push the pixels around, add shadow/highlights and  oversharpen and all that fun stuff, and the file retains its integrity way longer than a canon or Nikon file.  It can also flash sync to 1/800 second, not like 1/200 or 1/250 like a canon or nikon.  This means you can freeze action in the studio or darken the sky in broad daylight much easier.  That being said, its certainly not the easiest camera to work with, especially after being spoiled by Canon DSLRs for 6 years.  The battery life is terrible, the screen is not good, and there is only ONE focus point, so you'll be manual focusing a lot.  If you are a commercial or fine art photographer, and your photography income can justify getting into a medium format digital, it might be what you need to take it to the next level.  There is a reason why Nikon used this camera to shoot the ad for the D3 haha![...]", "Date": "December 21, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000Z0JZ74"}}