{"Reviews": [{"Title": "Awesome Pro-sumer Security Camera w/ excellent web interface", "Author": "R J", "ReviewID": "R36K882H2Z2MGR", "Overall": "5.0", "Content": "The quality of the images and the flexibility of the interface make this product excellent for high-end consumer use or commercial use. Keep in mind that this is the POE (Power Over Ethernet) version and does *not* come with a normal (plug in the wall) power pack. You need to either have or buy separately a POE injector that essentially powers the camera via the CAT5 ethernet cable that it connects to.I connected mine with a Trendnet POE injector and an ASUS 330ge portable access point and I am able to view images (very detailed images) over the internet via my password protected administrator account on Panasonic's ViewNet.com website. Unlike other cameras, Panasonic includes the ability to view, rotate, zoom, and if you connect a microphone, even listen remotely.This camera is much more powerful than those from the the cheaper (no optical zoom) cameras. The optical zoom on this camera is a 21x optical zoom and I can tell you that not only is it powerful, but this Made in Japan camera has a very good lens that can allow you to not only view a car from across the street... not only read the license plate from the car across the street... but you can even read the expiration date on the registration tag; the zoom lens is that good!In addition to the above mentioned functions, you can also rotate the camera about 360 degrees and it can look up at about 90 degree and down (but given base, it's not 90 degrees down). On top of that, it also has advanced function that will allow to see well in the dark (low lux) and even record images to your computer and/or a built in SD card reader.Those of you just looking for an inexpensive camera to watch fido or keep watch on the baby-sitter will normally be fine with one of the less expensive Panasonic units (also w/ free web access). On the other hand, those of you looking for something more powerful, yet does not require a professional installer to set up, then this may be the camera for you.", "Date": "June 17, 2011"}, {"Title": "Solid reliable camera.", "Author": "Lost without GPS", "ReviewID": "RMDEDWJOMH5EK", "Overall": "5.0", "Content": "This one is our second. Even though there are more updated models we like being able to control both with the same panasonic web interface.  We use one for the front gate and another as a critter cam for the backyard.  I have used them to do timelapse pics of our landscape and sunrise/sunset - then blended into a 5 minute clip for sharing with friends and family.", "Date": "November 4, 2013"}, {"Title": "Panasonic BB-HCM581A Network Camera Pan and Tilt", "Author": "Kais", "ReviewID": "R2O7FKOXKYGIVB", "Overall": "4.0", "Content": "Product looks good. Is not compatible with Apple though and that was not mentioned. Does anyone know if there is a program one can download coz I looked everywhere and couldn't find anything,.Panasonic BB-HCM581A Network Camera Pan and Tilt", "Date": "September 4, 2012"}, {"Title": "Bossman 651", "Author": "William J. Lewis II", "ReviewID": "R14T0M002P3NTN", "Overall": "5.0", "Content": "Works great with Control4 Fast zoom and great Picture quality. Simple to install needs a little more instruction on setting up the triggers.", "Date": "August 20, 2012"}, {"Title": "Trush", "Author": "Thomas Rushfeldt", "ReviewID": "RYU2LRX3FKWTL", "Overall": "3.0", "Content": "This camera was great-once I final got it working.The camera is powered by a POE hub or a separate additional a/c adapter neither of which are included with the camera. Would have been nice to know this BEFORE purchase. For a $800 item you would think that Panasonic would include a way to TURN IT ON, but NO. The ac adapter is item BB-HCA3A (about $40)- or at least warn buyers to get the a/c adapter.This was very inconvient because after 4 hours of research to figure this out, I had to order the a/c adapter and pay for overnight shipping.", "Date": "February 26, 2009"}, {"Title": "panasonic bb-hcm581a", "Author": "Long Do \"do long\"", "ReviewID": "R1ZADBCJZGM6H6", "Overall": "5.0", "Content": "i havae hcm581a over one year it is working very good and easy set up i do not have any problem with it , i think this is the best net work camera and good price too", "Date": "August 19, 2010"}, {"Title": "i got it for a friend", "Author": "Samer Massoud \"Samer Massoud\"", "ReviewID": "R234QY19L2N1ZL", "Overall": "5.0", "Content": "i got ths camera for a friend who was looking for a monitoring camera. feedback i got from him is really good.", "Date": "April 18, 2011"}, {"Title": "Its perfect", "Author": "Ziad", "ReviewID": "R1KY420N41B35Q", "Overall": "5.0", "Content": "I bought second one recently , it's clear and easy install and it's the best zoom of ip camera I had seenit's really  the best , it's value of moeny", "Date": "September 26, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "PANASONIC CONSUMER BB-HCM581A NETWORK CAMERA PAN A", "Name": "Panasonic BB-HCM581A Network Camera Pan and Tilt", "ImgURL": "http://ecx.images-amazon.com/images/I/31iK-tgm4FL._SY300_.jpg", "ProductID": "B000RHXPO4"}}