{"Reviews": [{"Title": "A Sweet Surprise", "Author": "Hyojin J. Hwang", "ReviewID": "R1DS5CKG8172DH", "Overall": "5.0", "Content": "I have owned 6 digital cameras (1 Kodak, 1 Casio, and 4 Canons) in the past, and this is the best yet.  I had purchased a Canon SD500 last month but didn't think it lived up to its hype.  I did extensive research and found this less popular camera.  At first, I was reluctant because I had owned a Casio before (the Z40), and I thought the images it produced were subpar.  But I read good reviews on the P700.  I found a store that had a good return policy and decided to test it alongside the Canon SD500.I performed a blind test on my friends.  I used all auto settings, with no photo doctoring at all.  The P700 had more accurate colors and didn't have the blinding flash of the SD500.  However, the P700 had a bit more noise in dark areas.  6/10 people preferred the P700 pictures over the SD500.  The P700 has much more manual control than the SD500, so when I took new pictures using the manual controls, the P700 blew the SD500 away.  Needless to say, I decided to sell my SD500.What I like most about this camera is the manual controls.  There is an aperture priority mode and a shutter priority mode on top of the full manual mode.  Other useful things I can control are sharpness, saturation, contrast, and flash intensity - things I haven't seen in the other 6 digital cameras I've owned.  Of course, I can always adjust those in Photoshop, but it's just nice to have handy.  Just a few more of the features I love already: AE (auto exposure) lock, auto bracketing, 25-shot stop action images, ability to shoot in TIFF and RAW modes (RAW mode is available through a hidden menu), autofocus area controls, metering modes, and the help icons.It doesn't have the greatest movie mode, but making movies isn't the reason I bought a digital camera - I would've gotten a camcorder instead.Many people think the design is ugly, but personally, I love the sturdy, industrial design.  That was another reason I didn't like the Canon - because of its fragile body.As for the size, the P700 is not a super-compact, pocket camera.  However, it's still small enough to fit into my handbag.  The larger size also reduces hand-shake, a problem I noticed with smaller cameras.All in all, I believe that the P700 is a great camera for someone who takes casual snapshots but dabbles in serious photography as well.  It is a great choice for those who want more than a regular point-and-shoot but doesn't need/cannot afford an SLR.  I highly recommend this camera!", "Date": "August 2, 2005"}, {"Title": "Great Camera!", "Author": "Shutter Bug \"Shutter Bug\"", "ReviewID": "R2I7MDKDZXK4YK", "Overall": "5.0", "Content": "I have owned several digital cameras... 3 Fuji's (all wonderful) and 2 canons (1 great, 1 not so great) to name a few.  This is the first Casio I've owned and it takes stunning photos!  Ideally I thought I wanted a digital SLR but their large size scared me away.  After much research, I decided on the Casio and found that it takes just as good if not better photos than my friends SLR's.The auto mode is fine, but this camera really shines when you start using the manual modes.  If this will be your first experience with manual modes, do not worry, Casio makes it fairly easy.You will not be disappointed with this camera.", "Date": "August 7, 2005"}, {"Title": "Should be a more popular camera!", "Author": "Corey Thompson \"Corey Thompson\"", "ReviewID": "R3TNQ3G0GC864C", "Overall": "5.0", "Content": "This is my second digital camera - my first was a Creative Labs 3MP that I bought for taking whiteboard pictures. I am very happy with the Casio, as it solves three of the issues that have prevented me from buying a \"decent\" digital for some time.First, it feels solid, which I like. The display is big, pretty bright, and sharp. Amazingly, it fits in a jeans pocket (let's just say it's noticeable something is in there though. It doesn't fit with keys in there too.)The camera powers-on and takes its first picture VERY quickly (about 2 1/2 sec). Most digital cameras that I've been evaluating do this slowly (5-7 sec). Further, the half-press to full (focus to picture) is very rapid (one website said less that 1/10th of a second!) Full press is quite fast as well (same website said 0.4 sec).Finally, it actually takes good pictures. Certainly it is better than the Creative Labs cam, but it is amazing the detail that 7MP picks up! Seems to do well in low-light.This is a great camera.--A note on features: Just about everything can be manually adjusted (aperture, white balance, focus, etc, etc.) Many things can be bracketed... it can actually rotate a whiteboard taken at an angle, which uses one of about 20 preset modes you can choose from. I use them often, and it enables you to save your own too. AND it DOES have a raw mode, it is just in a hidden menu.", "Date": "January 15, 2006"}, {"Title": "Great digital camera", "Author": "R. LAFERLA", "ReviewID": "R2R2FJLO6VVFXJ", "Overall": "4.0", "Content": "I purchased this camera to replace my Casio EX-Z4 which broke.  This camera takes great photos.  The controls are much easier to access than my EX-Z4.  i.e. there is a dedicated delete button, dedicated dial for choosing mode, etc...  The power button while small is much easier to press than the EX-Z4.  I was really looking for a camera with at least a 4x optical zoom because I like to take lots of wildlife photos and I can get too close to my subject.  The downside to this camera is that it's too big to slip into my pocket like the EX-Z4 and there is no cradle charger.  The camera also does not automatically shutoff when idle when attached to your computer -- which drains the battery.I purchased a 2GB SD flash card on the Internet and I'm very pleased with this camera!", "Date": "November 26, 2005"}, {"Title": "Old Casio, good product", "Author": "Pat Pesek-herriges \"Patrick\"", "ReviewID": "R1YJ7463Z5O59J", "Overall": "4.0", "Content": "Although this model is no longer in production, it is an excellent little camera, with many good features (e.g., \"best shot\" selection). It's a good, all-around digital camera for everyday use.", "Date": "December 21, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "With a 7.2-megapixel CCD sensor, create brilliant images that can be printed up to poster size\nFeatures an ultra-fast Canon 4x optical zoom lens\nInnovative functions and fully adjustable manual settings\nWith a high-performance Super Life battery, approximately 260 images (according to CIPA standards) can be taken per battery charge\nExtraordinary performance is complimented by an exceptionally attractive design", "Name": "Casio Exilim Pro EXP700 7MP Digital Camera with 4x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51KW6HEHGFL._SX300_.jpg", "ProductID": "B0002Y6DGY"}}