{"Reviews": [{"Title": "Good for my 8 year old", "Author": "Mike K \"technoguy\"", "ReviewID": "R2QR9LGKHWC8QT", "Overall": "3.0", "Content": "This camera was only $49 at Walgreens (about 40% the cost of the cheapest decent cameras that you can get).  I would not recommend this camera for an adult, but I do think it is great for a kid who wants to take pictures.  Why, read on.Most cameras made for kids are really terrible.  They offer very low resolution (0.1 to 0.3 MP) and take awful pictures. The Argus camera is a 3 mega pixel camera.Although the camera takes pictures that are much better quality than a kid's camera, don't expect the Argus to take high quality pictures.  This is because the lens is cheap (probably plastic) and the electronics are not state of the art.  The tiny lens isn't very sensitive to light so it does teach you kid good photography habits (if they are not steady, the photo will be blurry).  There is also a several second lag when you push the shutter.  The last time I encountered this was with my first digital which was purchased 12 years ago.  Needless to say, the lag makes the camera useable only for still shots.  It does have a viewfinder which is helpful, as you have to hold the camera to your face which steadies it.The back of the camera has a bunch of buttons for various tasks (like previewing or deleting your pictures) and a postage stamp sized review screen.  The screen is of low resolution, so it only gives you a gross estimation of your photo.  The camera runs on 3 AAA batteries which are provided.  In addition you get a software disk, a USB cable to connect to your computer, a little instruction booklet and a wrist strap. There is enough internal memory to allow for about 8-10 shots, but Argus recommends that you buy a SD card (up to 512 MB is supported).  These cards are pretty cheap.  We had an old 256 MB card that went into the camera which was more than enough for my kid's needs.You can take short video clips, but there is no microphone on the camera, so they are silent movies.  In addition you can use the camera as a web cam.  I have not tried this function on the Argus but I have done so with other cheap cameras.  In general, the results have been only so-so.  If you need a web camera you are best off buying a dedicated one from a company like Logitech or Creative.  They make great products, vastly superior to combo cameras.Picture qualityWhen taken by a shaky person it the photos were not useable.  However, with a steady hand they were not too bad.  The focus was a bit soft but acceptable.  Colors were also OK.  Pictures tended to have a flat look common to low resolutions cameras (like a cell phone cameras).  The Argus has 3 MP which should have been plenty for a more detailed picture.  I am assuming that the flat quality has more to do with the poor lens and cheap electronics of the camera.  Anyways, the pictures would be fine for email or small prints.  In fact, we printed up some prints at 6x4 which looked pretty good.SoftwareSoftware includes a driver allowing your computer to recognize the camera.  This worked just fine and the SD card was recognized as a disk drive by the computer.  Conversely, you could simply use a media reader for the CD card.Also included is Arc Soft's Photo Impressions 4.  This software seems to be bundled with many inexpensive cameras and web cams.  Arc Soft sells many different versions of this software so really inexpensive cameras may have Photo Impressions 2 and better ones may have Photo Impressions 5.  Arch Soft always allows you to upgrade to their latest version (now version 6) for a reasonable price.  I have used this software before and it really is pretty good.  It definitely has more functionality that you would get from the free software bundled with a lot of other cameras.  Of course you get basic functions like red eye reduction, sharpening and color adjustment.  In addition you get more advanced features like cloning, dodge and burn brushes and an auto button that automatically corrects several parameters at once.  There are also a number of projects included, it is easy to add a picture frame, turn your photos into a calendar and put your face in a stock photo of (as an example) an astronaut.  We had a lot of fun with these projects.  For instance, we printed up a picture of our kids on a fake 100 dollar bill.  The software is definitely worth using and perfect for most people getting started in digital photography.  With that said it doesn't offer the controls of something like Photoshop Elements, but that program cost $100 and Photo Impression is free.SummaryAll in all, a decent, very inexpensive camera for a child to get used to digital photography.  The simple construction of the camera makes it less likely to break with a small drop.  The low price makes it less likely to hurt when it eventually gets lost and it takes good enough pictures to be used for email or small prints.  As a bonus it comes with editing software (Photo Impressions) that is actually useful and offers a number of projects that a kid would find enjoyable.  Is this a camera for adults?? Probably not, unless you couldn't afford more than $50.  Otherwise double the money and buy a decent entry level camera with 5-7 MP, a real optical zoom and better electronics.", "Date": "December 26, 2007"}, {"Title": "good starter camera for kids", "Author": "Dr. John \"Dr John\"", "ReviewID": "RF0UWTWHJOLGM", "Overall": "4.0", "Content": "I got this camera for my 5 year old after trying two other cheapo/kids cam's. While it is restricted in features (fixed focus, and smaller LCD screen) it is a junior model of a reasonable full feature camera.It is standards based i.e. has a mini usb connector (comes with cable) and is recognized by win XP as a USB drive right out of the box with no drivers, it takes SD cards (it claims to use up to a 512 MB but one of my extra 1 Gig cards seems to be working, SD cards are really cheap these days now that SDHC is out at 4gb) and you will need one.The other two cameras I got had weird connectors, flaky software drivers and propriatary non standard software editors and were really difficult to use even for me.It takes decent pictures, where the other cameras I got for my kid took really blurry pictures and I gave them away as I did not want her to get frustrated and give up on digital photography.Note: This is nowhere near film cameras and it is not to be compared with the Nikon, Sony and Canon cameras I usually use.It does have a bit of lag on the display and when shooting, but it does have a \"burst mode\" that takes 3 pictures that works well and an movie function that records 60 seconds that works well.The function buttons are easy to understand, it has a flash and the price is right.  It keeps my kid involved with usable pictures.For the price this was a great choice for my kid.", "Date": "December 12, 2007"}, {"Title": "OK ,but do not expect much.", "Author": "northeasternsales", "ReviewID": "R37TQLOF1UQNBA", "Overall": "2.0", "Content": "It really is not a camera to take on trips.It takes about 3 seconds from the time the shutter button is pressed to when the image is actually taking.So if you are shooting at a slow moving object ,the time the  shot is actually taken from the time the shutter button is pressed ,the subject would be around the block.If you want to get a half way decent shot,use a tripod , and timer.A little camera shake ,and  pictures will come out blurry. .Indoor shots with flash are only good to about 5-6 feet.Over 6 feet with the flash on , the pictures come out dark.Close up shots or macro shots  are not good.For example taken a shot at the title of a book cover,the letters will be blurry,even with a tripod. Over all picture detail is  OK in outdoor shots.Outdoor action shots are acceptable only if the camera is solid rock steady or used with a tripod .My first digital camera was a Olympus Camedia Brio D-100 1.2MP Digital Camera that I paid over $ 150.00 a few years ago.This camera actually takes better pictures,but still it's not saying much compared to other cameras currently on the market.If you can get this camera real cheap it's OK.As I said before - \"OK but don't expect much\"", "Date": "December 5, 2006"}, {"Title": "Don't waste your money", "Author": "Karyn M. Sacker", "ReviewID": "R1S5393B0CT5U4", "Overall": "1.0", "Content": "Unfortunately, I purchased this camera 1 day before the 1st review, so I did so without any insight. But, given the fact I was buying it for a 10yr old, I didn't really need much and wanted to keep cost to a minimum so I took a chance. Well, I have to say both previous reviews now seem generous. After using the camera for one day (Xmas day), and listening to my 10 yr old complain about how bad it was, I returned it to Amazon. It is an absolutely horrible product, not worth $4 let alone $40. I even tried a tri-pod and pictures still came out blurry. I have since purchased a new low cost camera for about $60 - it is  considerably better than this one - pictures are clear and shutter speed is much faster....and my daughter is happy with it. So spend a few extra dollars and avoid this product.", "Date": "January 3, 2007"}, {"Title": "Not worth the money", "Author": "B. Padron", "ReviewID": "R1SML7DEDR0YNG", "Overall": "1.0", "Content": "The camera is okay. I bought it for my 8-year-old and it works fine for her. The shutter speed is extremely slow and the menu is difficult to navigate. I would not buy this camera again, I would spend a few extra dollars and get better quality.", "Date": "January 9, 2007"}, {"Title": "I agree with all the negatives...", "Author": "stuart_b", "ReviewID": "R2PQV2P4L9P8IA", "Overall": "4.0", "Content": "...but I still like this camera.I was looking at this thing for Christmas, but it went out of stock before I could get one. So I bought a Digital Concepts 2.1MP. Then I got this one after all (and for less money), and it's better.Aside from the obvious difference in resolution, it has much better low-light sensitivity, showing an image on the LCD panel in a fairly poorly-lit room. As far as the issue of shutter delay, I suspect that has been overestimated by other reviewers, but it does exist. The worst thing probably is that you don't really know when in the sequence between pressing the button and the camera being ready for another shot it actually records the image.The only other actual complaint I might have is rather poor battery life. But a writeup on another low-end camera reminded me that in order for the internal memory to retain images there needs to be a constant small drain on the batteries. And that's enough to take out a set of batteries in about two weeks.  It would be ideal if the camera would go into a totally-unpowered mode if you put in a SD/MMC card, but I suppose that's too much to ask in a $40.00 camera.  Trying to figure how to keep a reusable plastic strip in the battery compartment.And being able to shoot short videos is a little bonus I hadn't even thought of beforehand.  And the same thing I said about fairly low light applies there as for stills.", "Date": "May 30, 2007"}, {"Title": "Good for kids", "Author": "jewel464g", "ReviewID": "R2937OLEXJXPYJ", "Overall": "3.0", "Content": "I bought this for my 10 year old daughter's birthday.  She's already dropped it twice and it's still working.  It does have a really slow response from the time you press the button until it takes the picture, but what do you really expect for a $40 camera.  I think this is a great start for her to learn to use the camera and become more responsible with it and if she does break it I'm not out a lot of money.", "Date": "April 22, 2007"}, {"Title": "Did it come from a cereal box?", "Author": "Matthew Lanzer", "ReviewID": "R3P9KVGPJV0RQV", "Overall": "2.0", "Content": "The pictures you can take with this camera would have been considered \"ok\" at the advent of digital photography, but nowadays they're really low quality compared to anything I've seen... almost like webcam stills, only larger. The viewscreen is almost completely worthless. The buttons are basic at best, and the actual construction of the whole product is very cheap and light... I almost thought it was a toy after taking it out of the packaging.If you are at all used to a $100+ digital camera, you'll be disappointed with this. If you know absolutely nothing about digital cameras and just want to try one, this may be OK. At least you'll know almost everything else out there is better.I agree with northeasternsales' review below as far as technical aspects of this cam.", "Date": "December 26, 2006"}, {"Title": "Digital Camera", "Author": "George R. Fulton", "ReviewID": "RX87MKMQOAURQ", "Overall": "4.0", "Content": "Just what we needed, an inexpensive camera that is easy to use.Will be used by employees when they observe a problem at one ofour clients sites. Cameras will be placed in our vehicles so thatthey are readily available to any employee operating the vehicle atany location.", "Date": "December 11, 2007"}, {"Title": "Not even fit for a 10 year old", "Author": "Tee \"Tee\"", "ReviewID": "R2GLLG9XLS2NKQ", "Overall": "1.0", "Content": "Bought this as a cheap, simple camera to give to a 10 year old as their first \"real\" camera.  It's a piece of crap.  Don't bother.  Viewfinder is useless...blurry.  The one we received didn't even work...instructions are sparse, so when you click and no picture is taken, there's not a lot left to do but to return the thing.  Better option if looking for a gift for a child:  buy something used that was a nicer camera.  Tons of deals for used cameras as new ones come out every single day.  Wish I'd thought of that sooner.", "Date": "January 12, 2010"}, {"Title": "Great Kids Camera", "Author": "N. Leitner", "ReviewID": "R2EOXVQOGSGP31", "Overall": "4.0", "Content": "I purchased a camera for my 10 year old grandson.  My family are camera buffs and at first they thought it wasn't good enough for him.  However, after a bit of time, everyone agrees that this is a really good camera for my grandson.  Nancy", "Date": "April 8, 2008"}, {"Title": "High Quality Camera", "Author": "W.C.", "ReviewID": "R2OYJUPMPZSW76", "Overall": "5.0", "Content": "Argud is an old time company that has made high quality products. I'm not sure about 2013 forward but when I found these and bought I never found any problems. I find this to be a high quality camera. Take very nice pictures. Uploads to computer very well too.", "Date": "May 11, 2013"}, {"Title": "Por el precio esta bien", "Author": "La Pelona", "ReviewID": "RGRHQ55TRB30", "Overall": "3.0", "Content": "La compre para mi hija de 8 años. Las fotos que sacan no son maravillosas. Pero se pueden bajar directo a la computadora. Considero que son mejor opcion que las de Disney, etc. que venden para niños.Algunos problemas que presenta son: si se le quiere ampliar la memoria se le puede colocar una tarjeta SD hasta de 512 MB, que casi no se consiguen; trabajan con pilas AAA y ya sabemos que eso puede ser latoso; la pantalla es bastante pequeña y no se ve muy bien.Aun asi, por 14 $ y para evitar que mi hija quiera usar la mia (mucho mas cara), arriesgandola, esta bien", "Date": "April 9, 2011"}, {"Title": "Could be fun", "Author": "P. T. Greene", "ReviewID": "R6HNQR9PE12WL", "Overall": "2.0", "Content": "Others have noted a too small veiwing screen and its a bit blurry. Not sure it actually has all the functionality claimed, haven't been able to get that far with it. But it might end up being fun in the end as kind of a novelty item. Doesn't make a great gift for a younger child, however.", "Date": "May 17, 2010"}, {"Title": "A monumental waste of money", "Author": "R. Soule", "ReviewID": "R2ROOJYPQDLS8F", "Overall": "1.0", "Content": "The quality is so poor, you cannot see any details.  Don't worry about whether somebody blinked - you cannot even see if they have eyes or a mouth; it's just a blur.  My 8 year old doesn't even want to play with it as a toy, and I'd bought it for him.", "Date": "May 23, 2009"}, {"Title": "OK for toy camera", "Author": "USA \"Chad\"", "ReviewID": "R3U99955YPCH8F", "Overall": "3.0", "Content": "It was a gift for my 5 year old daughter, and that is about all it is good for.  Pictures sometimes turn out pretty good, but you can't tell by the viewer.  She has had it now over a year, and it still works.", "Date": "February 8, 2009"}, {"Title": "unsatisfied", "Author": "David Dominici", "ReviewID": "R3PZHKMYUSCF9Z", "Overall": "1.0", "Content": "My daughter opened this product on Christmas morning and it refused to work right out of the box.  My husband tried different batteries and messed with it for hours and could never get it to work.", "Date": "January 14, 2009"}, {"Title": "Great for a 9yr old", "Author": "Colorado Girl", "ReviewID": "RYNR28EUYIALF", "Overall": "3.0", "Content": "This camera if perfect for my 9yr olds first digital camera. He has really enjoyed taking pictures and video. One side note, make sure to order a memory card to go with it. Great little camera for a kid.", "Date": "January 9, 2009"}, {"Title": "Camera", "Author": "K. W. Perdue \"Daboo\"", "ReviewID": "RWK1PFD4PT1WR", "Overall": "2.0", "Content": "I bought this camera for a gift, it looks nice but when I got it is very light and plastic more along the cheep toy feel. The camera takes descant pictures so I'm not too upset but If I had looked at it in the store I would not have purchased it.", "Date": "December 16, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "UPC - 760215303364\nCamera- Digital still", "Name": "Camera, DC3185 3.2 Mp Cmos, 1.1 Inch LCD", "ImgURL": "http://ecx.images-amazon.com/images/I/319h6hgGs0L._SY300_.jpg", "ProductID": "B000E209Y6"}}