{"Reviews": [{"Title": "Konica Minolta Z3", "Author": "A. Groth", "ReviewID": "R1OWUIN2H5PHK9", "Overall": "4.0", "Content": "Having some experience with SLRs before the digital age, and having used a 2.1 megapixel Canon Ixus 300 for three years, I was ready for an upgrade. At the same time I was pondering whether to buy a digicam that can shoot stills, or a stills camera that can shoot video - thus covering both my needs with a single device. Carrying two devices, two AC adapters/chargers and potentially two different storage media was out of the question, although some manufacturers allow you to use the same storage medium and battery if you buy only their products. I decided for a stills camera, but demanded video capture of 30 frames per second. This requirement excluded almost all the cameras within my price range.Another key consideration was speed. The Ixus is notoriously slow both during startup and shutter lag, too slow for my baby son.Finally I imagined a camera with 5-6 megapixels and a fast lens (ideally f2.0), fairly compact and relatively light weight.Exhausting research showed me that the ideal camera does not exist. However, some cameras do have 30 fps video: SONY W1 or P100, The Panasonic Z10 or Z20, Kyocera M410R, and Konica Minolta Z2. The three latter manufacturers offered large zooms as well. However only Panasonic offered a stabilized zoom, and on the other hand was so big tha I decided against it.All the above cameras offer only middle-of-the-road resolution of 4-5 megapixels. On the other hand, friends with higher resolution cameras tell me that they never use maximum resolution anyway, so I decided I could compromise on the megapixel race and get some other useful features instead.When the Z3 with stabilised zoom was released I took a chance and bought it here at Amazon although none of the established digital photography websites had yet reviewed it.Having used the Z3 for a week and taken about a hundred photos, I am pleased with my decision. The photo quality is as good as I expected, as regards sharpness and colour. The optical 12x zoom is fantastic, and with 4x digital zoom you can shoot the moon and have it fill the entire screen in fairly good resolution. I could read the lisence plates of cars standing 200 yards away.Additionally the camera is fairly compact but has an unusual shape, so get the Konica Minolta case for it.Video is very good, as expected. You get a built-in loudspeaker for instant playback. Besides you need a fast SD card, I got a 512 MB Sandisk Ultra II and am happy with it. An additional plus with SD cards is that they fit into my Palm Tungsten handheld for direct downloading of photos.The instruction manual is good as well, not too big but detailed. Unlike cameras like Olympus C-5060 and C-8080, that have received a lot of praise for their optical qualities but criticism for their complicated menu structure, the Z3 is very straight-forward with just the right repertoire of features. It is really easy to use. When we add quick startup and focusing, I feel most of my requirements are met.I also bought the 2500D external flash with vertically swivelling head, which came at a very competitive price compared to dedicated flashes from other manufacturers. The built-in flash is nevertheless quite strong in most indoor situations.Such features for 499 dollars is a good deal. However Konica Minolta have chosen very cheap solutions to some other needs:- the LCD at the back of the camera is very small, and it does not swivel. All other comparable cameras have larger screens, most of them swivel. If your eyesight is not 100%, get a different camera.- the built-in flash does not pop up when needed, you have to push it up with your hand.- The lens itself is not threaded, only the barrel around it. You have to buy a big adapter in order to attach the most basic UV filter. The camera will also not fit into the case with the adapter on.- low light metering is poor, often impossible. A focus assist lamp should have been included.- the body is plastic. It feels fairly sturdy but many competing cameras are made of metal.- Konica Minolta did not bother to include NIMH batteries in the box. They are absolutely necessary but cost extra.- it is a pitty that such a big lens is not f2.0, only f2.8-4.3. The older Olympus C-5060 and Canon G3 have it - why not newer cameras?To sum it up: if you need a digital camera beyond the basic point-and-shoot type, video matters a lot to you, and you are willing to carry a somewhat bulky camera around in order to get a big zoom, the Z3 may be the camera for you. Unless you are willing to wait for a future Z4 or Z5 that has it all.", "Date": "August 27, 2004"}, {"Title": "Good, but not great", "Author": "Robert Pawlak \"rjpawlak\"", "ReviewID": "RPCG4RRK0NXEM", "Overall": "4.0", "Content": "Plusses- 12X zoom with anti-shake lets you take pictures of things that are difficult to capture otherwise. For example, I take quite a few pictures of my animals, and when you get close to them, they tend to move. This camera lets you maintain your distance and get a good shot.- Video mode is good. High res, and works surprisingly well in low light.- Very good ergonomics as far as controls are concerned. Menus for various camera modes are well laid out.- Exceedingly fast operation. Turn it on, and it is ready to go. Repeated shots are also very fast.- Easy access to real time histogram of current image.- Reasonably powerful flash.- Great macro and super macro mode.- Takes AA batteries and SD cards.Minuses- Small LCD display, but with some use, you'll be able to tell if you got a good shot or not.- I think familiarity with some of the other picture taking modes of the camera is a must (i.e. aperture and shutter priority modes).- Some purple fringing at high zoom.- Noise in images, even at low ISOs.- Some difficulty focusing in low light situations.I haven't noticed any problems with capturing video to my SD card, like the other reviewer mentioned (I have a Kingmax platinum card). Nor do I think the SD card door is `flimsy'. It is thin to be sure, but I've never had a problem with it.I think color saturation is fine. Color balance is very natural on normal setting. Vivid color setting produces rich color. Battery life seems decent to me, I use high capacity NiMH cells.Overall, this is not a SLR, but you're not paying the same money either. Overall, I think this is a decent camera and worth the price.", "Date": "January 4, 2005"}, {"Title": "Good camera with some neat features", "Author": "hecklervtec", "ReviewID": "R8H55II669TC2", "Overall": "4.0", "Content": "I needed a camera for a cruise we were taking to Anarctica and wanted a digital camera with a large zoom.  After trying to decide for about a month, I bought the Z3 and an Olympus C770 together.  I decided to keep the Z3 and return the C770, mostly because of some of the great features on the Z3.  The antishake really seems to make a difference and I like how fast the camera is.  The C770 wasn't exactly slow, but with the test pictures I took with it I got a lot more blurred ones than with the Z3.  The ultra high speed shooting modes on the Z3 are great and I got a lot of pictures I would have otherwise missed with slower shooting rates, especially when taking pictures of wildlife.  As one of the other reviewers mentioned, it sounds like a machine gun when its taking pictures.  I could see it being a lot of fun with candid shots too.  The focus is fast and there is almost no lag taking pictures once the object is in focus.  Its still not quite SLR fast, but this camera's not an SLR.  The zoom is great and when showing pictures to other people on the ship they couldn't believe how close the camera was able to get with just the optical zoom.  The pictures it takes are pretty good, there is some purple fringing on some things, particularly in dark areas at higher zooms, but you really have to get in close or blow the pictures up pretty large to notice.  I took a few videos on my trip to and thought they were pretty good.  The focus seems to hunt a little bit at times which got a little annoying, but this isn't a video camera.  I thought the white balance and color was very good and I had only a couple of pictures that I would say the colors were off.  The white balance on the Z3 in auto was better than the Olympus, where I seemed to have to manually change the white balance modes, especially when taking pictures outside.Now for my gripes.  The body and its panels all seem on the cheap side.  The access door for the USB cable is just a soft plastic flap and the access door for the SD card is kind of flimsy.  I've accidently caught the SD card door on things a few times and worry it might get really caught one day and rip off.  I've been tempted to but some tape or velcro on it to do a better job keeping it closed, but haven't been able to make myself do it.  The Olympus body was metal and the access doors on it seemed a little sturdier.  The Z3 also eats alkaline batteries and you'll want to buy a set of high capacity Li-ions.  Once I bought a set I would easily get over a full 1GB cards worth of shots (almost 500) before having to change batteries.  The Z3 does have a hard time focusing in low light and I agree with the other reviews that a focus assist light would probably help.  The Olympus was no better.  I also sometimes have a hard time finding the shutter release without hunting for it and every once in a while I catch myself trying to press the bezel surrounding the shutter release rather than the shutter release.  I also wish the flash would either pop up automatically or have a button like the Olympus, rather than having to grap a little tab on the side of the section that pops up.  It was sometimes really difficult to do with gloves on or even without having to stop what you were doing and look at the top of the camera.  Also, plan to buy a higher capacity SD card because 16mb is a joke.  I have just a regular speed SD card and have not had any of the problems some people were describing capturing video, but I do wonder if I would be able to capture more continuous shots in the ultra high speed modes without the camera having to pause.  The Z3 is also a little larger (maybe bulkier is better word) than the C770 and while I felt I could have fit the C770 in a large pocket or even wife's purse, the Z3 won't fit in either.So to sum my review up, the Z3 is a good camera with some limitations.  Its probably the cheap feeling construction that keeps me from giving it 5 stars.PROS:Speed, speed, speedAnti shake worksGreat zoomGood menu systemCONS:Cheap feeling constructionEats Alkaline batteries (plan on buying Li-ion)Wish flash was easier to pop upIts a little bulky", "Date": "January 27, 2005"}, {"Title": "Wonderful camera for the amateur enthusiast", "Author": "Marian Galovic", "ReviewID": "R3NDZCBDTVRN8D", "Overall": "4.0", "Content": "I have the Konica Minolta Dimage Z3 for about a week. Here are my comments:positive aspects:  * the camera is very fast, it feels simply awesome to shoot some photos with it, altogether the handling is very good  * the best feature is definitely the 12x zoom with anti-shake. It may seem unbelievable but you can take perfectly sharp pictures at telephoto without the use of a tripod  * the UHS capture and movie mode are great  * a lot of manual features  * reasonable pricenegative aspects:  * images are quite noisy  * the saturation is (below) average  * the camera does not fit into my pocket :-)My conclusion is:If you are an enthusiastic amateur like me, this is the perfect camera for you. Although the image quality is a little disappointing all of the other features make this a wonderful camera.", "Date": "September 21, 2004"}, {"Title": "So close...", "Author": "digitalzen", "ReviewID": "R3QWGWT5GEQKBE", "Overall": "4.0", "Content": "First of all, let me say that I LOVE the Z3!  I would give it five stars, except for the comments below.  The anti-shake technology is impossible to believe until you have used it, then you find yourself doing ridiculous things like hand-holding at an equivalent 300mm and 50th of a second--and getting acceptably sharp photos.  I have gotten 1 shot that enlarged to 5x7 nicely, shooting from a braced position at about 1/4 second and ridiculously long zoom, (at least 300mm equiv.,) although I admit that only one shot out of half a dozen was that sharp.The light weight is a pleasure to work with after my Nikon 35mm's, and at 250+ highest quality images on a 512MB SD card, you just forget about running out of \"film.\"  If you start getting low, you can reduce the resolution to 1/2 the 2272x1704 \"normal\" size and still use low compression, doubling the number of available shots at the cost of big enlargements.  (It will also shoot about 30 min. of low-def video on the 512card, but I haven't tried it.) I would happily leave all the Nikons at home and take the Z3 as my primary camera for most anything except for two things.Now the bad news.  The built-in flash sucks, and because the exposure is read off the CCD the only supplemental flashes you can use are hotshoe mounted and dedicated to the Z3.  No off-camera flash is available.  The built-in flash is useless beyond about eight feet in dim light, which is no big deal because...You can't see squat in the LCD viewfinder in low light anyway, and the camera doesn't have a supplemental focusing light.  In a dimly-lit living room, you just aim blindly, hold down the shutter button, and the camera fires when it thinks things are at optimum.  They usually aren't.  The flash does a good job at what most built-in flashes do well...fill flash...but don't go anywhere at night or indoors thinking you have a flash on your camera.  You mostly don't.  And then there's the red-eye problem.  My son-in-law has pale blue eyes, and I haven't gotten a really good shot of him yet, even from the side.  The camera begs for off-camera capability.  Synch plugs take so little space...but then there's the dedication thing.Having said that, I do primarily nature photography in the daytime, so I haven't felt the need to buy a hotshoe flash or a digital body for my Nikon lenses.  The latter, however, is just a matter of time.  The Z3 is not a professional's camera, but I'm here to tell you it's a camera that a pro can have a helluve lot of fun with!If I had it to do over again I'd spend the extra $60 and get the equivalent Panasonic strictly because of the low-light focusing l.e.d. aid, (it, too, has anti-shake, although a different system,) but I'm pleased with the Z3 and expect to have it for a long time.", "Date": "March 24, 2005"}, {"Title": "Great Camera - Software not bad but could be even better", "Author": "SteveD", "ReviewID": "RESCPHVS57NFP", "Overall": "4.0", "Content": "Two modifications to my earlier review (below) -1. The macro and super macro features are fantastic if you take a little care with lighting. Have had several of my shots used by professional graphics people.2. Low light focusing is not the best.Number 2 is not a big deal for me and easily outweighed by the many great features.----------------------------I love the Z3. This camera feels great in the hands and nothing out there currently matches it in terms of light weight, long zoom capabilities with image stabilization and incredibly quick response times. The similar performing new Panasonic DMC-FZ15 and FZ20 are much bigger/heavier but I am sure will also make their owners very happy.The importance of the image stabilization feature cannot be praised enough as daylight shots at full zoom can easily be done handheld. In low light situations still best to use support/tripod.The software supplied has some great image manipulation tools but is let down by not having a simple ability to show images on your computer in a slide show. Hope that Minolta will fix this by a free software download patch. Please Minolta that will make my experience with this camera 5 star?", "Date": "September 3, 2004"}, {"Title": "Good, basic camera", "Author": "David Barber", "ReviewID": "R3MSCV44BFM94E", "Overall": "3.0", "Content": "Overall, the camera is not bad. The light metering can be a bit questionable in low light, and the memory card door is flimsy beyond belief (and catches on my camera bag to boot - I don't know how much longer it will stay on). But the photos are quite acceptable, and the zoom is amazing. I get good life out of my (purchased separately) rechargable batteries, and a 1GB SD card holds about 500 images. Image quality is pretty good, although it is all JPG - this may or may not make you happy.The camera I bought had flaky software and hardware, which survived to some degree for almost the length of the warranty before giving up the ghost. Service was not the most friendly (some of my emails simply never got a response), but they did fix the camera and now everything works fine.", "Date": "March 9, 2005"}, {"Title": "Excellent for the price", "Author": "Go North", "ReviewID": "RKJY03ATAFLCI", "Overall": "4.0", "Content": "Have this for about a week, quite impressed overall.Positives: lots of features, antishake works well, very quiet zoom.  Image quality as expected for 4MP camera, but I have not done extensive testing yet.  Movie mode (640x480 30fps max) is excellent, but you'll need a large capacity (1GB or more) SD card for any significant amount of capture at high quality. I like the overall design, easy to hold and shoot.Negatives: autofocus has occasional problems, especially at low light. My unit is Made in China (entire thing, stamped at the bottom of the camera), so hard to predict the long term reliability.  Those who prefer the \"metallic feel\" may have issue with the entire plastic casing of this model (I have the black one).", "Date": "August 20, 2004"}, {"Title": "Great Zoom", "Author": "J. Crowley", "ReviewID": "R37KH5PZH6M12L", "Overall": "4.0", "Content": "I used this camera for three weeks and loved it. The 12x zoom is great, the camera small and light, a good fit for backpacking, and it's anti-shake design makes it perfect for wildlife photos. The menu is very easy to navigate and the options for various modes easy to access.  Unfortunately, I had to ship it back for repairs after only 4 computer transfers.  Something happened and I was unable to tansfer photos anymore.  I can't wait until I get it back!Jean C.  Sept. 04", "Date": "September 17, 2004"}, {"Title": "Five Stars... BUT", "Author": "T. MacFarlane \"Tommacf\"", "ReviewID": "R2IYTGI6X4IHGW", "Overall": "5.0", "Content": "There is a movie mode issue with this camera which Minolta are not making too clear: if you use a 'bog-standard' SD card movie will stop every so often - 30/90 seconds, it seems to vary - and the egg-timer will appear to save your clip.You then have to re-start!It seems Minolta actually recommend you use a type II card with a much faster read/write time to avoid this problem.", "Date": "September 27, 2004"}, {"Title": "Great camera with all the right features", "Author": "R. Wisner \"wisarss\"", "ReviewID": "R1MHH2BDH775TS", "Overall": "5.0", "Content": "I was looking for an excellent camera that I wouldn't outgrow any time soon and found it in the Minolta Dimage Z3.  I had a lot of criteria I wanted in a camera including high optical zoom, image stabilization, high quality video with audio, quick startup and short lag time between exposures, rapid shooting function and a macro mode.  This camera does all these things and does them well.  The only feature it doesn't have that I kind of wanted was an auto focus assist lamp for taking pictures of people in dark settings.The only cameras that even came close to this feature set were the Panasonic Lumix DMC-FZ30K (which only takes 320x240 video compared to the Z3's 640x480 and costs quite a bit more but is 5mp) and the Fujifilm Finepix S5100, which is missing the image stabilizer that the Z3 offers but is quite a bit cheaper.If your needs are similar to mine, you'll probably want to choose between this one and the Panasonic.  If you already have a digital camcorder, I'd go for the Panasonic, but otherwise this is probably your best bet.", "Date": "March 1, 2005"}, {"Title": "Z3, not impressed", "Author": "mweddle \"Mike\"", "ReviewID": "RJVDU85E6E5YC", "Overall": "1.0", "Content": "I bought the Z3 because of the features, 12x zoom, image stabilization, 4.0 MP.  The stabilization feature works very well, as does the macro modes.  It does everything the literature says it will do.  Except take a decent picture.  I took a few and printed them off, the color was off and grainy, no matter what quality setting of the camera.  Some pics even turned out yellowish.  The image viewing software is rather difficult to manipulate, and kept shutting down my computer.  It eats batteries.  The LCD is VERY small, and hard to see in sunlight.  The memory card door is also VERY flimsy and could be easily broken.  If you decide you want an external flash, Minolta is proprietary, they range from $150-$450 for a flash.  I'm pretty disappointed.  I was hoping for a good out of the box camera that was easy to operate with good pictures as a result.  Not so.  Maybe it's just too complicated for me.  So tomorrow it goes back, and traded for the Kodak DX7440.  It's not nearly as advanced as the Z3, but at least it will take a GOOD picture right out of the box and easily manipulated.", "Date": "October 12, 2004"}, {"Title": "Don't buy the refurbished one.", "Author": "J. Star", "ReviewID": "RRTBTR9ME5K4Y", "Overall": "1.0", "Content": "I bought this camera in factory-refurbished condition, which means the camera was returned to Konica by someone for any reason ranging from dissatisfaction with the camera to it being broken to they bought two different ones and decided on the other one. Konica then put the camera through its refurbishing process, ran it through a number of tests, and then resold it as \"refurbished\" through a third-party seller at Amazon.At least, that's how it's supposed to work.When I opened the box, there was a Konica sticker on it that said \"refurbished condition,\" and inside was a card offering a 3-month warranty. The camera didn't work. It froze repeatedly, and couldn't be turned off with the power button; the batteries had to be removed. The zoom stopped working halfway through a video. The autofocus seemed to be the source of most of the problems with the camera; it would attempt to focus on something, suddenly go blurry, and then freeze. Several times when I turned it on, it froze before I could even take a picture.Needless to say, I'll be returning the camera. My advice is that no one purchase it in refurbished condition; whatever tests they supposedly ran on it at Konica to ensure that it was in proper working order failed miserably. I don't understand how this camera could have passed any kind of test. Save your dollars and buy it new. It seems like it would be a great camera--if it worked.", "Date": "July 21, 2005"}, {"Title": "Great Camera", "Author": null, "ReviewID": "RRI1ZFZAK0K90", "Overall": "5.0", "Content": "I have a sandisk ultra II SD card and it works very well. Like other people say the sd card door is flimsy, it it operates the way the ashtrays on the doors in a car work, just not as much spring. it doesnt lock. that is one minus. It isnt as good in dark areas as it is in light, and sometimes in some modes in dark areas you'll get nothing on screen, then you have to rotate the knob to auto or something. the zoom is awesome. And it works really fast. I excpecially like the uhs progressive. When it takes so many pictures and saves the last 15 it sounds like a machine-gun. Very good camera", "Date": "October 14, 2004"}, {"Title": "Better than its peers", "Author": "Arun Ramakrishnan \"DRKR panel\"", "ReviewID": "R2PIRW04FOI81G", "Overall": "5.0", "Content": "one word to describe this camera would be \"QUICK\" startup. battery life is excellent. LCD(not optical) viewfinder is a cool addition. though autofocus is a little slow under high zoom, i like the other features. simplicity is what you will find when you operate the software. it is a very good buy compared to similar cameras with 12x zoom with Anti-Shake. 4MP is a little low for big natural scenaries, but it suits me just fine. i shall always recommend this camera for beginners and intermediate photographers.", "Date": "April 29, 2006"}, {"Title": "Great customer service and warranty work", "Author": "Northpeak \"Outdoor Enthusiast\"", "ReviewID": "R2GVSS37FFQ4CV", "Overall": "4.0", "Content": "I'm more of a point and click kind of guy so I won't get into the technical aspect of the camera.I purchased this camera about 8 months ago.  I've taken it on every outdoor adventure that I've been on since.  Mount McKinley, Yosemite, Ruth Glacier, ice and rock climbing, a couple 2 week long sea kayak trips, etc, etc.About 2 months ago on a sea kayak trip in the Gulf of Alaska, the zoom and auto focus stopped working(I beat my gear but I didn't think that I beat it TOO hard).  By the way, I really take my gear to the limits, so don't allow this malfunction to change your mind about this camera.Fully expecting to have a huge problem getting this camera serviced under warranty, I sent it in with an invoice printed from Amazon.com.I had my camera back within 10 days.  No questions asked.If only all of my warranty work went so well!", "Date": "August 29, 2005"}, {"Title": "Konica Minolta Dimage Z3 Digital Camera", "Author": "Catherine L. Hardymon \"traveler\"", "ReviewID": "R263QTR3MVQ9EG", "Overall": "5.0", "Content": "I purchased this Dimage Z3 Digital Camera as a replacement for an identical one I had that got damaged beyond repair. My original had gone to places as far reaching as Churchill ,Canada to see the Polar Bears, and Africa on safari.  The photos I have taken have been really excellent and often as good, or better, than some taken with much more expensive SLR cameras.  The anti- shake technology  works very well.  I'm not a pro, but this camera makes me look like one.Konica Minolta Dimage Z3 4MP Digital Camera with Anti Shake 12x Optical Zoom", "Date": "April 21, 2008"}, {"Title": "Enjoyed camera - untill 2 yrs later - Repairs would cost $211", "Author": "L. Funderburk", "ReviewID": "R3DMSUP708TWMO", "Overall": "2.0", "Content": "I used this camera a lot. It took great pictures. My wife is visually impaired and took great pictures ( this was the first camera she was able to do that with ). BUT two years later the zoom stuck in one position, sent it to Sony for repairs and was quoted $211 and some change. NO THANK YOU!!", "Date": "October 12, 2007"}, {"Title": "Lots of camera for the buck!", "Author": "P. Thomas", "ReviewID": "RL3WX33OMKJL", "Overall": "4.0", "Content": "My high school-aged son bought this camera to use in his photography class.  If I had written the review earlier, I would have had nothing but good to say, with the exception of noting that this camera does not have RAW files.  The image stabilization feature for a camera in this price range is a wonderful feature; however it is the one that has malfunctioned.  Prior to this problem, neither my son nor I had any complaints.  From macro shots to telephoto shots, all were incredibly sharp. Color was true-to-life. Ease of use was fantastic, right out of the box.  However, about a month into my son using it every day in school for photography class and the annual staff, he noticed a warning light for the image stabilization feature.  A call to tech services confirmed that this camera has a malfunction that needs repair.  I cannot speak to the quality of service, as my son needs this camera through the end of the semester.  After that, we will send it in for repairs.  I would keep in mind that this is a 16 year-old boy that owns the camera.  He is fairly responsible (especially with things HIS money purchases)but is possibly more rough on a camera in a school setting than an adult would be in most situations.  Even without the anti-shake, we love this camera.  Just don't know if this is a common problem.", "Date": "November 19, 2006"}, {"Title": "Great Camera", "Author": "Bangledorf", "ReviewID": "R3T91FWAZZ6O8S", "Overall": "4.0", "Content": "We love this camera.  We have owned if for about 6 mos now and have no complaints about it.  We returned the better rated Olympus Camedia C755 and bought this instead and have not regretted it for a moment.  We have none of the low light shooting problems that others have reported.  Nor have we experienced any descrepancy in the viewfinder image quality versus the actual image quality.  It is very user-friendly and the design is very comfortable, and I like the way it looks.  The fact that this camera has been discontinued along with all Konica Cameras was a bit of a concern, but they farmed the customer support out to sony so you would not be completely left hanging if something did go wrong.  But with any electronic product it is a crap shoot that you will never have to use their horrible customer service.  It seems to me this is no different.  My only complaint is that it runs on AA batteries instead of a rechargeable battery pack.  This is nice because you will never run out of battery power when you really need it, but it sure gets expensive.  This camera does not run through batteries exceptionally fast but it still adds up quickly. We love this camera and would recommend it to anybody.", "Date": "November 1, 2006"}, {"Title": "not worth the money", "Author": "Nichole Stahovich", "ReviewID": "REA0LS1YKXB0Y", "Overall": "3.0", "Content": "This camera is so out-dated.  You can get point and shoots that have the attributes this camera does.", "Date": "February 14, 2010"}, {"Title": "great for the right price", "Author": "B. Sharp", "ReviewID": "R1SM0COFNP4DPZ", "Overall": "5.0", "Content": "i bought this camera used for $100 (in perfect condition other than some scratches on the grips), and for that price, it's absolutely great.  others have documented some drawbacks (some noise; some problems in low light conditions, etc.); i agree with some of these faults- but you just can't buy anything of this quality for $100!", "Date": "March 26, 2009"}, {"Title": "Good for a grab-and-go", "Author": "James \"software_rancher\"", "ReviewID": "R389A7M6A5H90B", "Overall": "4.0", "Content": "The Z3 is a great little camera; I bought it 3-4 years ago to tide me over until DSLRs came into my price range (which they did a couple of years before I had expected).  Still I find the Z3 is a handy grab-and-go camera when I don't want to be bothered with my DSLR (maybe when I get an 18-250 lens for my DSLR the Z3 will be retired---maybe).  I also like the ability to use it as a video camera, though the duration that will fit on the SD cards is not all that long.The long zoom range (35mm equivalent of 35-420) makes it an incredibly versatile camera and with the anti-shake feature the telephoto range is usable.  The camera provides a range of manual adjustments that rival those found on SLRs.  The image quality is good.  If the camera had an optical viewfinder rather than an EVF I would rate it 5 stars (the best that there is for its niche); as it is the EVF makes it hard to see the fine details in a shot sometimes.  I don't use the LCD on the back for shooting since I don't like taking pictures with the camera at arms reach.", "Date": "March 7, 2008"}, {"Title": "Great manual controls. Automatic lags.", "Author": "Eric", "ReviewID": "R1F8U4TET06Z6", "Overall": "4.0", "Content": "If you like manual photography on a budget, this camera is for you. It's cheaper than a real SLR, but offers many of the same features.In full manual mode, the shutter is lightning fast. There's no delay. You can use this for sports photography. The macro mode is amazing.The downside? The flash is weak and the flash angle is bad. To make best use of the internal flash, use a diffuser (or bounce the flash using a bit of paper) and slow down your shutter.The white balance needs to be reset whenever your lighting changes. Don't trust the auto mode.Don't trust most of the automatic features for that matter unless your are taking photos in bright sunlight. They frequently choose the wrong settings and they add a lot of delay to your pictures.The low light performance of this camera is amazing for its size (in manual mode). You can take flashless photos thanks to the large sensor size and anti-shake technology. I've handheld shots for a second or more with no visible blurring.All in all, the manual controls are the only reason to get this cameral. If you like having control over your camera as much as I do, this camera is best in class. If you want to point-and-shoot in anything other than bright light, look elsewhere.", "Date": "July 17, 2007"}, {"Title": "Konica-Minolta DiMage Z3", "Author": "E. Tan", "ReviewID": "R3C2L2C8Z9LJIB", "Overall": "2.0", "Content": "I'm just a vacation picture taker and only used this camera while on vacation about 2 times a year for 2 years.  It suddenly stopped working properly.  The lens started shaking when turned on and then it wouldn't take pictures. This camera was not mistreated! I was very pleased with its performance up to this point.  Great pix and great features but not worth fixing at $181.00 by Sony.", "Date": "June 8, 2007"}, {"Title": "Lasted a long time", "Author": "Jake Gustafson", "ReviewID": "R38T5YQVOHV277", "Overall": "4.0", "Content": "I bought this camera used on Amazon a couple years ago and it worked fine for a long time.  It started overheating and not turning on, so I stopped using it and bought a Nikon Coolpix which has better lowlight performance anyway.", "Date": "November 4, 2010"}, {"Title": "Workhorse Digital Camera", "Author": "S. Jacobson", "ReviewID": "R2VNSKOA34AZNC", "Overall": "4.0", "Content": "We are forensic structural engineers and architects and have three of these cameras.  The zoom capability is great for our work, since we can get closeups from a distance, eliminating the need to use tall ladders.  On each of our projects, we take anywhere from 25 to 100 photos and we are doing over 200 projects a year.  The only thing that can make this camera better would be a built-in rechargeable battery.  Between the 3 cameras, we use a lot of AA batteries,, but we are obtaining the batteries at a discounted price.  Overall, we recommend this camera, especially if you need a great zoom.", "Date": "February 1, 2010"}, {"Title": "Minolta Dimage Z3, 02-2008", "Author": "Frank E. Pannone", "ReviewID": "R2R2B2C5A487C5", "Overall": "5.0", "Content": "Minolta Dimage Z3, 02-2008This was exactly as indicated on the net and was received in a very timely fashion.  Great Cooperation.", "Date": "March 4, 2008"}, {"Title": "amazing", "Author": "Glenn Wells \"you need this if you have a ipod\"", "ReviewID": "RHKLPDB4TOFMJ", "Overall": "5.0", "Content": "i love this product and mine is referb the anti shake is ausome u really need that when you lock your shutter open it is the best this is not a camera that you want if you want to point and shoot so it is not a camera for a starting kid", "Date": "July 14, 2007"}, {"Title": "Consider another brand", "Author": "KevGar", "ReviewID": "R3IWUWYW1X7TU2", "Overall": "2.0", "Content": "I have owned this camera for 16 months. I'd guess I am an average user in respect to how often I use the camera. I have taken extremely good care of it. Not a single mark on it. One day it just stopped working. Wouldn't turn on. It's currently at Minolta to be fixed to the tune of $160. Personally I find this unacceptable. My suggestion is to look at other brands.", "Date": "January 25, 2006"}, {"Title": "not  as good as expected", "Author": "Ernest G. Irelan", "ReviewID": "R25XHXYP1WP0JB", "Overall": "2.0", "Content": "I opened my box, camera was scratched on lcd viewer, was supposed to be NEW condition...then after reading instructions, found that it would not function unless the batteries were like new..took to soccer match as I shoot a lot of sports pics...well, would not focus clearly at all at over 100 yards..all my shots were blurred at this distance...do not like the idea of no protector over the lcd viewer.(also, nearly impossible to see in light) .was obviously scratched in shipment as was sitting on it in the box..parts were not included in the box as stated on line...talked with factory rep. told me it should be returned for service,etc..I am waiting on replacement from AMAZON an will see if it is any better, if not, will go back for a different brand, type, etc..", "Date": "October 18, 2005"}, {"Title": "Too many bugs!", "Author": "Blue Eyes", "ReviewID": "RRJAN5PDV10B7", "Overall": "1.0", "Content": "The biggest problem with this camera is the focusing apparatus...much too sensitive and frequently does not work.  The pictures are never as clear as my SLR Canon and I shall go back to that.  The viewer is entirely too small and difficult to see whether the clarity is truly there.  The wide angle adaptor lens is also not productive.  Especially annoying with the camera is with a small group of people at relatively same range of distance......most of them are out of focus (and, yes, I did focus on the one at mid-range.  The company at 47th street disregarded my request for a new operator's manual and suggested I get one through Google......fine, but I couldn't download it onto a disc with my limited features on my computer!  Writing to Konika Minolta in New Jersey over three months ago brought no satisfaction from them, either.  Incidentally, I misplaced the operator's manual while returning from a painting trip to Florence, Italy the early part of October 2005.  Nothing but frustration with this Konika Minolta and the representatives!", "Date": "January 14, 2006"}, {"Title": "Buying a camera through Amazon", "Author": "Wilkie \"Al\"", "ReviewID": "R2NHV0QBGY1VWK", "Overall": "5.0", "Content": "This reveiw particularly concerns Australians. I purchased a Konica Minolta Dimage Z3 through Amazon because 1) My Z2 was accidentally damaged and QBE insurance would only pay me the written down value. That value corresponded to a camera offered by QBE that was inferior to my Z2.Traps for young beginners! I declined the QBE offer and elected instead to find a Konica Minolta elsewhere and pay any 'overcharge\".2)Konica Minolta is no longer available in Australia because a Japanese company has bought them out and replaced the KM with their own brand. Elsewhere in the world Konica Minolta is still available.The Dimage series is a top camera for the amateur in my opinion,and I have had consistently good results from the Z2I found the later model Z3 (anti-shake)on Amazon and by paying a few dollars above the insurance offer (basically the cost of airfreight and insurance) found I could land the Z3 here within my budget.Despite the fact that Amazon indicates on several of their sites that they do not undertake the forwarding of cameras internationally, they do point out that although 'they' dont, some of their suppliers do. In fact that is what happened. I bought through Amazons' supplier...'Electronics Club'. I bought the camera on Friday Western Australian time and followed its progress with the UPS tracking system over the weekend. It was quite a journey, but the transhipment from one aircraft to another could not be faulted. Rarely more than a few hours via US West Coast then Canada,Korea,Hongkong,Philippines,Singapore and finally Perth in Western Australia. I received the camera in pristine condition at my front door from UPS on Tueday morning. The five day service door to door from one side of the globe to the other was phenomenal. Well done to UPS, to Amazon, Electronics Club and your contractors.Al Lewins.", "Date": "April 27, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0002J6SFA"}}