{"Reviews": [{"Title": "A LITTLE \"THIN-SKINNED\" FOR OUTDOOR USE", "Author": "Apache Paul", "ReviewID": "R2KFBJFG0LGYR9", "Overall": "4.0", "Content": "GOOD CABLE FOR INDOOR OR CONDUIT INSTALL.  OUTER INSULATION IS TOO THIN FOR OUTDOOR USE.  ALSO USE CARE WHEN SPLITTING THE RG-59 AND POWER WIRES, THE INSULATION CAN TEAR OUT LEAVING THE INDIVIDUAL POWER WIRES SHOWING (STILL INDIVIDUALLY INSULATED BUT UNSIGHTLY)  OVERALL GOOD STUFF FOR THE PRICE. I'M ON MY SECOND ROLL.", "Date": "June 2, 2010"}, {"Title": "Good cable", "Author": "tttttttttttttttttttt", "ReviewID": "R3OJS6FB604N78", "Overall": "5.0", "Content": "well what can you say about a roll of cable. it works i have had no problem with broken center conductor ( i tested the entire roll when i recieved it). the only thing is the roll i recieved was white not black but that was not a problem for me. if you need to have black because of color coding then i would say email the seller and make sure they have and send black. the shipping was fast and over all i saved a decent ammount over buying the cable at my local alarm/telecomm store.", "Date": "February 21, 2012"}, {"Title": "Great product!!", "Author": "Brian", "ReviewID": "R8Z0UF58EAMX4", "Overall": "5.0", "Content": "I used this to run most of my lines.  One line was over 400 ft and through conduit and it worked great.  Camera clarity is great even with that long of a run!!!", "Date": "June 12, 2013"}, {"Title": "Great price!!", "Author": "tom", "ReviewID": "RZLEMVF57PR7K", "Overall": "5.0", "Content": "What a savings, I used for a special project and it worked perfectly for what I purchased it for, thanks!!", "Date": "February 18, 2013"}, {"Title": "1000 FT Siamese Qsee Cable", "Author": "Joey", "ReviewID": "RRQTBRMWMSJ55", "Overall": "5.0", "Content": "As a professional CCTV Installer, this is the only cable that truly delivers quality every time for analog systems. At $156 shipped for 1000FT, you can't beat it. Only thing is I received both spool in white cable, not black but no big deal. Its just cable. I'll continue to use this cable for a long time. Thanks Q-See!", "Date": "June 9, 2012"}, {"Title": "It'll do", "Author": "Robert Rhodes", "ReviewID": "R1AZUXGFDTEIV5", "Overall": "3.0", "Content": "But I preferred the box that came with VideoSecu. But, the cable is the part that is important, so it'll do.", "Date": "November 16, 2012"}], "ProductInfo": {"Price": "$192.99", "Features": "RG-59 coaxial video wire\n18 gauge copper wires for power supply\n1000ft length", "Name": "Q-See QS591000 1000 Feet Siamese Cable w/RG-59 & 2 Copperwires for Power (Variable Color)", "ImgURL": "http://ecx.images-amazon.com/images/I/51R2l3AqvsL._SY300_.jpg", "ProductID": "B000GWTDFA"}}