{"Reviews": [{"Title": "Great lens, image quality all in a compact sized camera", "Author": "Amazon Customer", "ReviewID": "R3VK40G8P57EBY", "Overall": "5.0", "Content": "I've always been a fan of Panasonic's Optical Image Stabilizers on their Lumix line of cameras. The DMC-FX12 was quite the steal at under $200.  Very compact camera without sacrificing image quality (at least not too much). There have been testimonies stating that the images produced from the DMC-FX12 are soft, but you can fix that by changing the color mode to \"vivid\" and presto, sharper images. The only gripe I have with this compact performer is that anything from ISO 800 and higher provides very noisy images. Most of the low light shots I've taken (minus the flash with color mode set to 'natural') were acceptable, but quite noisy.  This camera has a quality Leica lens which helps contribute to some crisp images. Other than that, the flash is decent and under normal lighting conditions, you get some pretty darn good images (the image stabilizer makes a huge difference). This is a point-and-shoot camera and people tend to expect SLR quality images from a point-and-shoot camera. I have yet to come across a p&s; shooter that comes anywhere close to SLR quality. As for the DMC-FX12, it's compact, great for point-and-shoot casual shooting, and worth every penny. I was in debate of whether to get this shooter or the DMC-FX30 but I wasn't about to shell out another extra $100 for a difference of 7mm of focal length between the 2 shooters. I chose the DMC-FX12 due to price and the image quality.", "Date": "May 31, 2007"}, {"Title": "Excellent pocket camera (Review updated 7/29/07)", "Author": "Amazon Customer", "ReviewID": "R2G3C8PT31E5PA", "Overall": "5.0", "Content": "Light carry weight and small size were near the top of my \"must have\" features for a new camera; I wanted something that I would grab every day, put in a pocket, and not worry about.  I have a digital SLR but carrying around every day is a bit much.After looking at Canon and Nikon pocket cameras I decided on the Panasonic Lumix DMC-FX12.  (I did on-line research, then went to my local camera store where I've been buying gear for 30 years.  Their recommendations are generally spot-on.  BTW - I paid a few bucks more at the camera store; buying on Amazon would have been less expensive.  But since I spent some time in the store with the clerk, I felt it not right to use his expertise and then purchase elsewhere).The FX12 is quite small - easily fits in a dress shirt pocket or front slacks pocket.  (Jean pockets maybe not so much, they tend to be tighter and might damage the camera).  The camera is also quite light, although perhaps a bit heavier than it looks.The Leica lens was a major selling point for me.  Leica glass reputation is second-to-none.  However, the focal length could be just a tad longer for my taste.  This camera is great for wide angle shots (group photos, etc.) but grabbing a telephoto shot means going to electronically enhanced zoom and, even with a Leica lens, that has inherit limitations.Close up shots (such as flowers) come out very nicely indeed, even for such a photographer as myself.Construction of the camera seems...delicate.  Flimsy is too strong a term, but \"delicate\" seems to fit.  Of course the controls are small by design, which is great, but the battery/card cover isn't all that substantial.  However the camera seems to ride happily in whichever pocket I have dropped it into, and the construction is not such that would make one concerned that the machine will be crunched in the carrying.  Perhaps because it is so small...it just seems delicate to me.The battery, as far as I can determine (someone PLEASE tell me if I got this wrong!) can't be charged in the camera.  Battery life seems good - I've not run it down yet.  However I would rarely, if ever, use the camera extensively at one go.  If I know I'm going out for a shoot I'd take a DSLR.  So you might look to others for recommendations on battery life.  More important to me is how long the battery will keep a charge while the camera is in my pocket.  I don't want to pull out the camera to find it's gone dead sitting.  After being toted around for a week, taking the odd (in every sense of the word <g>) photo, playing with the lens and camera settings, the battery was still showing a complete charge.I can't comment on the software that came with the camera, as I use Photoshop Elements.  However I've used card readers in XP and Vista computers without a problem in retrieving images.I've not noticed that the images are particulary soft, but it may be a result of the images I've taken.  More experience may tell a different tale.Quality-wise I've had no issues with the images.  Composition errors are not the fault of the camera ;-)The image stabilazition does seem to have a positive influence on low light shots.  The flash is, as one would expect from a small pocket camera, limited in range.There is no viewing port on the FX12, just the viewing glass on the back of the camera.  After spending a lifetime of looking through ports (both rangefinder and SLR) I'm having some difficulty in holding the camera to get my shot - I think one loses something in support when one has to hold the camera away from one's body when shooting.  It appears that many manufacturers are taking this design road.  On the bright side it does cut down on the profile size of the machine.I can't comment on the noise factor at higher ASA values; I've not had cause to make those types of shots yet.  The bottom line is, of course, always the image and I've been quite satisfied with the quality of the images I've made with this machine.  However, I've not made any 8x10 (or larger) prints yet, and there may be hidden faults that will appear only on larger prints.Since I truly drop this thing daily into my shirt or pants pocket I had some concerns about scratching the viewing glass.  I found a Delkin \"eFilm\" shade which adds nearly no weight to the camera (it does add about 1/4 of an inch to the depth of the camera)and protects the viewing glass and also gives protection from direct sunlight when used outdoors.  It's removable, but I've found it doesn't interfere with keeping the camera \"pocketable\".Other than a bit more lens reach the only other thing on my \"WIBCI\" list (Wouldn't It Be Cool If) would be manual settings.  However it's a point and shoot with autmatic controls (although there are a number of scenes from which to choose!) so one can't gripe about lack of manual controls.Start up time is quite fast for this type of camera - much faster than my Kodak 443.  Shutter lag isn't bad (although taking action shots at football games might be a bit dicey.  Try golf <g>).  Delay between shots is noticeable, but I have a slow Kodak card in the bay and a faster card might improve write speed.For a $200 camera it's quite acceptable, and it allows me to make pictures where other cameras don't - because you can't make a photo with a camera you don't have in hand; this FX12 has become a fixture with me.ADDENDUM 7/29/07Battery life while carrying has proven not to be a problem - after a couple of weeks in my pocket, taking an occasional shot the battery still has plenty of power.However - I did try a few shots of a fast moving subject and found that the shutter lag does have a significant impact.  Not as bad as my old Kodak 443, but it does require a considerable amount of anticipation on pulling the trigger to get the shot.  Also, on some portrait shots, @ 10 feet in subdued light the photos came out underexposed (the camera was set on \"portrait\" in modes).  I was able to correct the issue in PhotoShop, but there was considerable noise.  I believe the flash was at the absolute limit at 10 feet.Overall, after a few more weeks with the system, I still like the camera very much - even though some shots have given me trouble.  The only reason I had trouble was because I had the camera with me <g>. I'm slipping the camera into my pocket on a daily basis - but need more time to get used to the limitations of a point 'n shoot.", "Date": "July 12, 2007"}, {"Title": "A great little camera", "Author": "Mark Twain", "ReviewID": "R1Q8T6UUSMJ050", "Overall": "5.0", "Content": "This a nifty little camera.  I already have a 35mm SLR, but wanted a compact digital camera that I would be more inclined to carry and use and without the worries of film.  I do carry and use this camera much more that I would with a larger film camera, so for that it is great.  However, I find myself missing some of the features that I'm used to, especially manual settings and manual focus.  I wish that it would focus and cycle through shots much quicker.  Also, the lens is tiny, but as the whole camera is tiny, that is the nature of the product.  I find this camera fairly easy to use.  I was able to starting taking picture right out of the box and before looking at the manual.  However, some of the menus and controls are somewhat anti-intuitive.  The basic use is straight forward, but trial and error or reading the manual is needed to take full advantage of all this camera offers.  The manual included reads like a manual; it is so choked full of warning and disclaimers that finding the useful information is tedious.  Also included is a disk of photo software,  for both Microsoft and Mac OS.  However, I use Linux, so this is utterly useless to me.  No mention is ever made to other OS besides those two.  Despite this, I've had no problems connecting the camera to my computer with the supplied USB cable; It mounts like a FAT16 flashdrive, and I assume it could be used as one too.  This camera is loaded with a number of settings and features; this somewhat make-up for the lack of control offered by other cameras.  One foolish feature is when the camera is on, the lens extends itself from the body and is uncovered and exposed, and it stays this way even if the camera is in a mode that does not use the lens such as while connecting to a computer or playback.  I bought this camera with traveling in mind, so hope it will be durable and it seem like it will be, but I can't yet truly comment on that.  Overall, I really enjoy this little camera, and its size allows me to keep it handy.  As a point-and-shoot camera, it is great.  For a wider range of photography, reading the manual and learning about all the features is necessary.", "Date": "April 7, 2007"}, {"Title": "Excellent city camera", "Author": "Lee A. Jacobus \"Author of Volcanic Jesus\"", "ReviewID": "R3K3JOBWBPWVQ1", "Overall": "5.0", "Content": "I'm very surprised at the flexibility of this camera.  I carry it in the also excellent Panasonic leather case that's available, and the results so far have been remarkable.  Displays on a large HDTV surprise everyone who sees them--sharp, good color, even stable in night shots.  I'm not sure how large I can print, but the 8 x 10s are right on the money. I bought it to travel with in city conditions.  My Sony Alpha is my camera of preference in most situations, but there are many times when it is too bulky to carry.  This camera is perfect in those situations.", "Date": "May 28, 2007"}, {"Title": "Best Camera Ever", "Author": null, "ReviewID": "RMXBOC4UN4Y36", "Overall": "5.0", "Content": "The Panasonic Lumix DMC-FX12 is the best camera ever. I got this for my 12th Birthday. This is my second camera. It takes very clear pictures. There is nothing I don't like about it. I bought a 1GB SD Card for it and it can take 625 Pictures on 3M. It has 21 scene modes: Portrait, Soft Skin, Self Portrait, Scenery, Sports, Night Portrait, Night Scenery, Food, Party, Candle  Light, Baby 1, Baby 2, Pet, Sunset, High Sens., Starry Sky, Fireworks, Beach, Snow, Aerial Photo, and Underwater. I Highly Recommend it.", "Date": "August 9, 2007"}, {"Title": "Good only while it lasts", "Author": "Hovie Hawk \"Hawk 36\"", "ReviewID": "R2YFE0NUU4JBM4", "Overall": "2.0", "Content": "I had been very pleased with this camera until it suddenly developed oil spots on the interior of the lens. I was instructed by Panasonic to send it in for repairs. After 3 weeks I finally received my camera back in good working condition only to have the oil spots appear again two weeks later. At that point I requested a replacement but was informed by Panasonic that my only recourse was to continue to send it back for repairs. Unacceptable. I would strongly urge all considering this product, or any Panasonic product, to think long and hard before taking the plunge as, my experience has been that the company will not stand behind their product.", "Date": "March 27, 2008"}, {"Title": "Great Camera", "Author": "6ft5vbplayer", "ReviewID": "RK5K4ORS5H5OB", "Overall": "5.0", "Content": "I love this camera. I love all the different settings that are already programed onto the camera. I was taking pictures that were the same quality or better than my mom's $1500 camera. The only thing that wish I could change about the camera is giving it a higher optical zoom, however, the 3x optical zoom plus digital zoom still produces great pictures on this camera. I'm an architect major and a lot of my grades depend on the portfolio pictures that we take of our 3-D projects and I know I can trust this camera to produce what I'm seeing in real life. I did a lot of research and searching for cameras before I bought this one, and I could not be happier. In all.... great camera. (hints the 5 star rate by everyone)", "Date": "August 6, 2007"}, {"Title": "Great pictures, little worried about durability", "Author": "sparhawk6", "ReviewID": "R1IE97YNZ3FWUB", "Overall": "4.0", "Content": "I am loving the quality of pictures on this camera. The pictures are beautiful. I also love the many different picture options available that are pre-programmed into the camera.After about 4 months of use, the flash died while I was in Mexico on vacation. I heard a small pop right as I tried to take a picture. As it was under warranty, I sent the camera into Panasonic (I had to pay shipping) and they fixed it and sent it back in 2 weeks.So, while I love practically everything about this camera, I worry that it is not durable enough to last a long time. I don't think I am too rough with it.", "Date": "February 7, 2008"}, {"Title": "Panasonic dig. camera DMC-FX12", "Author": "James Stevenson", "ReviewID": "R3DG7DOPNVJA6H", "Overall": "5.0", "Content": "I love this camera, it is the 1st dig. camera I've owned and it takes incredible pics. I put a 2 gig sd card in and it's good for 600+ pics at highest resolution; the battery recharges in 2 hrs. or less; this thing has unlimited features as you see when reading the 100 page manual! Software includes 3 basic programs which work well, but I still want a good program for tweaking photos . The price was great, it's powerful and has all the features I was looking for, especially small size.", "Date": "October 6, 2007"}, {"Title": "Great camera", "Author": "M. Polanco", "ReviewID": "R2EA2TPGT8J3S2", "Overall": "5.0", "Content": "This a very nice compact camera. You can carry it in your pocket and won't notice at all. Pictures are crisp and colorful. Love the detail in Macro Mode. Great shots in sunny ambients, best solution for holidays. Indoor pics tend to be a little noisy (grainy) when pictures are full expanded (7Megapixel = 3072 x 2304 sized pictures), this is why I would give it a 4.5, otherwise outdoor pics are excellent.", "Date": "August 19, 2007"}, {"Title": "Mine is terrrible!", "Author": "GoingUp", "ReviewID": "R3USZ5UDDWTRRM", "Overall": "1.0", "Content": "After doing lots of research, I finally bought this camera to replace my Canon SD10 (from 2005), and here's my experience with it compare to the SD10.Pro:* Size remains compact, fits easily in a pocket.* Faster startup.* More responsive menu/feature buttons.* More intuitive user interface.* Logical placement of buttons.* Solid and attractive fit and finish.* LCD screen have very bright settings.* Very long battery life (I actually returned the spare battery that I bought for this camera).* Optical image stablizer really works, but only to a small extend (which means you still have to try your best to hold the camera steady)Con:* I know that most compact cameras with 1/2.5\" CCD don't perform well in low light condition, but this Panasonic DMC-FX12X is even worst then my old Canon SD10! Even when I lock the ISO at 100, there're still a lot of noise in the photos. After I turned on the lights in my room (at night), turned off the image stablizer, and hold the camera steady (which I'm very good at), the photos still turned out softer and noisier than my SD10! (Yes, like one of the reviewers said, if your change the color setting to Vivid, the photo will become shaper, but the colors would look exagerrated).* Most of the time when I point the camera towards an object with sunlight in the background, I would see some purple streaks on the LCD screen. (Although those streaks disappeared once I zoomed-in during playback, display it on the computer monitor, or print it out).* Despite having a much larger LCD screen than my SD10 (only 1.5\"), this Panasonic's screen quality is not as sharp. In fact it's not sharp at all; the photos I took always look blurry/soft on its LCD screen, I had to either zoom in or display them on my computer monitor in order to see how sharp the photos actually are! For the first time I realize how misleading the resolution figure on a LCD screen can be.* Whether I use the built-in memory or my Kingston 4GB Class-6 SD card, it's slower to \"write\" the pictures into the memory after they're captured, and this is when I'm not using flash! Again, I'm comparing it to my old SD10 camera with 32MB SD card.Conclusion:I was really thrilled when I first received this camera after only 2 days of ordering it from Amazon.com (I chose the Standard shipping). After an hour of playing with various features and reading the manual, I've learned all the features on this camera. Unfortunately in the following 48 hours, I was disappointed numerous times and decided to mail it back to Amazon. It's a painful experience because I really want to like and keep this camera (due to it's price, size, style, finish, etc). Now I think I would choose a compact camera with a larger CCD size (e.g. 1/1.8\") even if it doesn't have an optical image stabilizer.", "Date": "November 12, 2007"}, {"Title": "Best camera there is", "Author": "Hector D. Iglesias", "ReviewID": "R3GZIGRGA24REM", "Overall": "5.0", "Content": "Indeed, the absolute best possible compromise between weight, size, image quality and friendliness of use (and that includes the way the manual is written down). A camera designed to please in all aspects.Recommended 110%.", "Date": "November 21, 2007"}, {"Title": "Great ultra compact camera", "Author": "James McCadden", "ReviewID": "RMJB9LF9DI8YJ", "Overall": "5.0", "Content": "This is a very good camera that takes high quality pictures, is extremely versatile and takes good pictures in different conditions.  It is very easy to use and is extremely easy to carry around in your pocket.  There are a number of scene modes that are very useful.  The price was right, the camera is just what I needed; overall, a great value.", "Date": "November 19, 2007"}, {"Title": "Digital camera", "Author": "E. Mitidieri \"mspenny\"", "ReviewID": "R2PM45ZAHWEYZM", "Overall": "5.0", "Content": "Great camera, easy to use and understand for a technologically retarded person as myself. Scanned the info manual, started using  right out of the box.No problems. The reviews sold me because of the excellent lens.The programs give me more trouble, so many and so confusing. Highly recommend this camera. Speedy delivery also from Amazon. Thank you", "Date": "October 28, 2007"}, {"Title": "Great Digital Camera", "Author": "M. Lyons", "ReviewID": "RYKBDN5MQK84D", "Overall": "5.0", "Content": "This is my first digital camera and I loaded everything and started taking pictures without having to read any instruction books (a first for me)!  At first I was disappointed that the zoom wasn't good enough but when I loaded the pictures to my pc (that was a piece of cake too !) I had sharper detail on the images than what I could actually see.  The camera comes with fantastic software that allows you to easily view your pictures in a slide show.  Great camera !", "Date": "July 2, 2007"}, {"Title": "maybe there are better cameras", "Author": "Xavier P \"Xavier P\"", "ReviewID": "R3MODDL7VTDQTW", "Overall": "2.0", "Content": "This camera takes very good photos in the day, but awful photos at night. What I didn't like about this camera, is that you will need a tripod to take pictures if you are taking photos without flash or in an ambient with poor light, because your are going to get awful pictures.When you take pictures and you watch them on the display, you think they look beautiful, but when you download to the computer, you will see that some are shaken.Look for another camera. I am very sure that there are better than this one.", "Date": "July 3, 2008"}, {"Title": "very nice robust camera", "Author": "Alex Bondarev \"Sasha\"", "ReviewID": "RWC25BULRMO55", "Overall": "5.0", "Content": "very nice camera (i have also canon d50 and pana fz30 - big ones), very good battery - can use it for weeks without recharging. leika lenses. very compact, - i used to carry in jeans, just put it into soft bag from glasses.if needed i will buy similar from panasonic", "Date": "March 9, 2010"}, {"Title": "Great little camera.", "Author": "J. F. Rojas", "ReviewID": "RO0X4ZE1U3IMB", "Overall": "5.0", "Content": "Definitely the Leica lens makes the picture quality much better.  Worth paying a little more to get it.  Simple to use and perfect for traveling light.", "Date": "February 17, 2010"}, {"Title": "Excelente", "Author": "Alex García \"alexeiiw\"", "ReviewID": "R2O1V6FBT5M1HE", "Overall": "5.0", "Content": "Excelenete producto, a pesar de ser de 7Mp, es un excelente producto, excelente camara, la resolucion de fotos es impresionante, y mas su facil uso", "Date": "June 27, 2009"}, {"Title": "Crisp Pictures in a Small Package", "Author": "W. Brown", "ReviewID": "R3FBLVR8Q8WIOC", "Overall": "3.0", "Content": "The Panasonic DMC-FX12 is a great supplement to a larger SLR. It's easy to tuck into a pocket or purse to catch those pictures that inevitably pop up when you decided not to lug your big camera around. The Leica lens is sharp, and when used at its highest resolution, the camera can produce quality large prints. With a 2 gigabyte card you can record an entire trip without having to download your pictures to a computer.", "Date": "January 6, 2009"}, {"Title": "Very Nice Quality", "Author": "Robin Lynne", "ReviewID": "RHKSZ26DI2HSC", "Overall": "5.0", "Content": "I bought this camera about a month ago, so far it has been very good to me. It takes really nice quality photos. The battery lasts a really long time. I take pictures of pets a lot and its very hard to get one with them sitting still, and it's hard to use a flash because pets get really bad red-eye. But this camera has a specific setting for pets! There are so many different settings i haven't even discovered them yet. I think this camera could make anyone a great photographer. I totally recommend it.", "Date": "February 8, 2008"}, {"Title": "Great Camara for a nice price", "Author": "Juan I. Rey Mendez", "ReviewID": "RUD1FD5KEB4", "Overall": "5.0", "Content": "It's an excellent, very portable, fully funtional camera for a nice price. I recommend it!!!", "Date": "February 1, 2008"}, {"Title": "Awesome!!", "Author": "Jennifer Lynn Butz", "ReviewID": "RCEI5W609HGX0", "Overall": "5.0", "Content": "I love THIS camera, I can zoom up to 12X and can stand far back! I have TONS and TONS of pictures on my camera now. I absolutely LOVE the battery life on this camera. I thought the battery was weak with one bar left, and it was still going. I charged it and it was charged up in less than an hour (the battery). This is a great camera, love the scenery modes, all the modes you can put the camera in. They come out clean, clear, focused VERY well.", "Date": "January 21, 2008"}, {"Title": "Great for the money", "Author": "phOtOcat \"S\"", "ReviewID": "R1OCXHLENWD1EX", "Overall": "5.0", "Content": "I had the Panasonic Lumix LX1 for a couple of years and loved the Leica lens and RAW capabilities. I paid over $500 for it. The FX12K is for my wife and she loves the ease of use and the picture quality, and I loved the low price! The only thing I wish it had was greater zoom range.Except for the occasional need for RAW, I would be just as happy using this as the carry-with-me-all-the-time camera instead of the LX1 that cost a lot more.", "Date": "January 17, 2008"}, {"Title": "WHAT A GREAT LITTLE CAMERA!", "Author": "Lynda Wells \"THE WAY TO WELLNESS.COM\"", "ReviewID": "R3EKLUQJ05NWO6", "Overall": "5.0", "Content": "I'm still scratching my head over the bargain of all bargains that I found when I spotted this little beauty.  It cost a whopping $119.99 at a local Office Depot in Mississippi, where I was spending the Holidays. On a whim I just glanced at the sales table, and there, just waiting for me, was my Lumix FX12.  Was I searching for a replacement for my Sony CyberShot 5.1?  No.  But the price was too good to resist, so I bought it on the spot.  Thank heavens I did.  I just downloaded my first batch of shots, and WOW!  I'm impressed.  My assistant was looking over my shoulder and said that he would frame 3 or 4 and put them up immediately in his home.One drawback, which, frankly, is true of my Sony as well:  Too much lag time between shoot and shutter, if something is moving quickly.  I got several shots of my Maltese and Chihuahua's backsides!  Ah, well, the ones that I did get looked as though they were 3-D and jumping right out of the frame.  I'm using Microsoft Digital Image and it's a breeze for me, probably because I've only used it and never educated myself in Photoshop.Can you tell that I'm thrilled?", "Date": "January 4, 2008"}, {"Title": "works great", "Author": "J. Wagener", "ReviewID": "RB6F30CEIZHD4", "Overall": "5.0", "Content": "i purchased this for my 16 yr old she loves it and is very easy for her to figure out.", "Date": "December 27, 2007"}, {"Title": "The best camera point-and-shoot of its category", "Author": "Leonardo de Assis", "ReviewID": "R1VRPV0N8UMD26", "Overall": "5.0", "Content": "Best quality photos, image stabilization, lcd 3.0, videos 640x480 with sound, supports SDHC, small, slim, all these stuff for a very cheap price. I recommend it.", "Date": "October 10, 2007"}, {"Title": "Excellent pocket camera", "Author": "Halldor E. Gudmundsson \"Elli\"", "ReviewID": "RPD8VPTHOSX04", "Overall": "5.0", "Content": "It is usable in low light conditionsIt is small and easy to use.The picture quality is satisfactory.", "Date": "November 22, 2007"}, {"Title": "Disappointing Performance", "Author": "Mateo", "ReviewID": "R2DFQQKRUTKX3P", "Overall": "3.0", "Content": "I recently purchased this camera through amazon. If I were to purchase again, I would probably choose the comparable Sony or Canon model. While I appreciated the Japanese quality of the camera, the performance left much to be desired: my first outing with the camera was to a high school dance that I had organized, and I could see nothing through the digital viewfinder--there is no standard window viewfinder--and this inability to see anything, mixed with focusing and color problems, led to horrible photos. I also found the camera's function controls, as well as the bundled software, to be very non-intuitive, with a large number of commands required for navigation. I do not recommend this camera for general purpose use, particularly among buyers who may wish to take photos in darker environments and/or do not want to spend great amounts of time reading and rereading the user's guide to ensure proper functioning of the camera.", "Date": "February 23, 2008"}, {"Title": "Excelente producto", "Author": "Monica Duran G \"Moni\"", "ReviewID": "R38I52DCPXENW5", "Overall": "5.0", "Content": "Aun que fue para un regalo. La persona que la recibio esta dichosa por la calidad de las fotos y la funcionalidad de la camara. El balance costo beneficio es muy perfecto.", "Date": "July 15, 2007"}, {"Title": "An Ok Camera", "Author": "B. May", "ReviewID": "R26D7XJDXUC7KA", "Overall": "3.0", "Content": "I had a Panasonic Lumix Camera before and like it it had great pics and the zoom was 24x but the the lends broke. So I bought this camera I love all the cool features it has and the sound with the motion pics. But the zoom only is 3x and it was up dated from my old one so it super hard to take far away pics. A picture that is pretty close up looks far away. 3x zoom is like nothing I wish it cold at least of been 6x. Other than the zoom I like it.", "Date": "August 9, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "7.2-megapixel CCD captures enough detail for photo-quality 15 x 20-inch prints\n3x image-stabilized optical zoom; 2.5-inch LCD display\nIntelligent ISO Control (I.I.C.) reduces image blur from subject movement and low light\nRecords full-size movies in wide-aspect VGA (848 x 480) at 30 frames per second\nStores images on SD/SDHC/MMC memory cards; 27MB internal memory", "Name": "Panasonic Lumix DMC-FX12S 7.2MP Digital Camera with 3x Optical Image Stabilized Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41tRT1Y-MdL._SX300_.jpg", "ProductID": "B000MW8GTS"}}