{"Reviews": [{"Title": "Amazing camera value!", "Author": "Hiram Grant \"just call me Sam\"", "ReviewID": "R1I4ZD9KRFVL0T", "Overall": "5.0", "Content": "This is one of those nice cameras that's so well done, it's easier to talk about what the camera ISN'T, rather than what it IS!  This camera is not a small, shirt pocket camera, and might be a bit bigger than a woman would wish to carry in a purse.  It's not a super-tele camera, but it does have a respectable, bit longer than average 4x optical zoom.Using the camera, it has a good weight and feel for average sized hands.  The use of AA batteries helps keep the cost down, and has it's own advantages, although some may prefer the longer life charges of Lithium-Ion batteries (I do).  General, controls are well thought out and easy to use.  The zoom is nice and smooth.For those that prefer an optical viewfinder, Canon is probably the strongest supporter, and this is a better than average viewfinder, although it does not have a diopter adjustment.  But you'll probably never use it with the tremendous 2.5\" rotary screen.  Yes, there are 3\" screens on the market, but this dwarfs anything on a hinge!  It is a great aid in composing photos at low, high, or other odd angles (photos you simply didn't take before).Another feature that gets high praise is the flex-focus system.  Today's AF cameras do a decent job, but occassionally, they just don't hit on the right focus point.  With the flex system, you can determine which point to use.  This is simply great for crowded rooms or nature photos where the subject may not be the closest item within the focusing areas.Control for this price point is very good indeed.  Multiple \"scene\" modes make it easy for the novice (ok, or sometimes lazy pro), while the semi-auto and manual modes give even experienced users all they need.Simply put, this camera could have easily been priced $50 to $100 more.  The only real competition is the A640, $100 more, 10 meg, and a bit more attractive black finish.", "Date": "September 7, 2006"}, {"Title": "Unexpectedly Good Pictures", "Author": "Frederick W. McManus \"Rip\"", "ReviewID": "R2QRMDUNCJFA8R", "Overall": "5.0", "Content": "My first impression of the A630 was less than stellar. After a year plus squinting through the viewfinder of my Rebel XT, I was really looking forward to composing my shots in a big, beautiful LCD again. Unfortunately, the LCD on the A630 may be big, but it's not beautiful. It does a fine job helping you review what's already been captured and presenting menu options legibly, but a mediocre job of rendering what's coming through the lens. The color is inaccurate and interference frequently appeared on the screen when half-clicking to freeze the focus. It still beats a viewfinder for composing an image but, frankly, I'd rather have the smaller LCD on my daughter's A620.Ultimately, though, picture quality is everything to me, and here the A630 excels. I took 60+ pictures on a recent trip to Door County, WI and not one of them was a clunker, including several taken in very tricky lighting situations. Shooting modes worked as advertised although, with good lighting, the auto mode produced identical results. Indoors, flash pictures were perfectly exposed and the flash had a surprisingly good range.On average, and I know this is heresy, the A630 took better pictures than my Rebel XT, and I didn't feel the need to Photoshop a single one of them. If I cared more about the LCD, I would have given this camera a lower rating, but a lower rating would not have done justice to the quality of the images this camera produces.", "Date": "October 2, 2006"}, {"Title": "Excellent optics, macro range,good manual controls", "Author": "MaxVideo \"maxvideo\"", "ReviewID": "RYOMSN943LHWA", "Overall": "5.0", "Content": "Let me preface this by saying I come from the \"old school\" of photography.  I've use good-quality film SLR cameras for years, and have always hated digitals because of all the cumbersome controls and lack of good manual control of the camera (yes, even on digital SLRs).This camera is quite an improvement.  If you are just a point-and-shooter, you can take it out of the box, throw batteries and an SD card in it and just click away.  But if you know what you are doing with a camera, there are good manual controls in here for you, too, and that's what I want to focus on.If you need to take close-up shots of small models, insects, flowers, etc this is the camera for you.  If you want something tiny and slim just for snapping pics on vacation, this is NOT the camera for you.  It will do a superb job, but it's more than you need and therefore bulkier than you probably want.It has shutter and aperture priority - the latter being the most important.  You can manually stop down the lens anywhere from 2.6 to 8.0.  It wish it would stop all the way down to, like f/22, but that's a lot to ask for a $200 digicam.  In macro mode, it really truly can focus on things only 1 cm away from the lens, and the focus is still crisp - very impressive.Put this thing on a tripod, put a good light on your subject, turn the flash OFF, use the built-in timer to avoid shaking the camera, and you'll get magazine-publishable photos, and that's no lie.White balance is superb.  You can take shots under flourescent, incandescent, tungsten (photofloods) and the color rendition is terrific, even if you use the \"auto\" white balance.  But you can manually calibrate it if you really want to.  There are also several preset white balance settings (flourescent, incandescent, tungsten, and about 4 others).It runs on 4 AA batteries, so you can shoot a long time before the batteries are dead, but definitely invest in 4 NiMH AA's and a charger.It uses standard SD cards, not like those morons at Sony who insist on using a proprietary memory card in their cameras.The best thing about it is that all the real controls you need if you are used to using a real camera are easily accessible right at the top level buttons - exposure compenstation, macro mode, flash on/off, f/stop.There is also a full manual mode, so you can set f/stop, exposure, shutter speed and focus all completely manually.  I fooled with some of the DSLRs, and those \"mid-range\" hybrid models like the S3 (sort of in between the things like this A630 and a DSLR).  Frankly, they are agony to use.  If I spend $800-$1000 on a DSLR, I do not expect it to punish me to find how to change the *(", "Date": "May 10, 2007"}, {"Title": "Not what I expected", "Author": "FlamingJune1967", "ReviewID": "R4KS7ZF0IH8NW", "Overall": "3.0", "Content": "I currently own a Canon A80 (which I love) and was interested in upgrading to the highly reviewed A630.  I received the camera in time for Thanksgiving and took about 200 photos with it in a variety of conditions.  Everything was great until I got home and downloaded my photos to the computer.  About half of them were blurry... but worse, ALL of my indoor shots had a lot of noise.  I took some more test shots, and noticed that the \"camera movement\" icon came on every time I used the zoom on indoor shots or any time I tried to take an indoor shot without the flash.  After calling customer service, I was convinced that I just had a defective camera, so I contacted Amazon and they were wonderful about sending another camera right out.Today I received the second camera.  It was no different from the first.  I am a point and shoot photographer who is mostly interested in taking photos of my children... so I took a variety of photos using the same settings on both of my cameras (a80 and a630) then downloaded them to my computer for comparison.  I even printed out several photos to make sure the problems weren't with my monitor.  Outdoor photos were excellent on both, however there was a huge difference inside.  In a well lit room with plenty of natural light from outside, the a630 still produced significant noise, while my a80 on the same setting (auto) produced clear noise-free photos.  When my toddler was moving, I got mostly blurry photos with the a630 on auto as well as using the \"kids and pets\" mode, while my a80 produced crisp and clear photos.I love Canon cameras, and this was my 3rd PowerShot.  I really expected to love this camera as much as my previous Canons.  Now I don't know whether I should even try to find a newer camera, if the inside shots are going to be like this.Things I liked about the a630:LARGE LCDNice quality moviesScene assistsGreat outdoor shotsVery accurate colorsQuick shutter responseThings I didn't like about the a630:Poor quality inside shots with lots of noise and blurry results.If I were a pro, I could probably figure out how to use the manual controls to fix my indoor problems... but I'm just a mom who wants some cute photos of her kids, so this didn't work for me.  I'm sticking with my slow-but-dependable A80.", "Date": "December 5, 2006"}, {"Title": "Another wonderful Canon camera", "Author": "Anon", "ReviewID": "R1JJ7L0YEN7WTB", "Overall": "5.0", "Content": "This is my third camera in the A-series.  Like its preceders, it takes crisp and clear pictures full of vibrant colors.  I absolutely love the Color Accent feature, to turn all but one color black & white, which creates a professional effect of accenting one color.  The zoom is also fantastic - I used the 16x to photograph some trees in the distance, and it showed a squirrel on one of the branches that couldn't be seen with the naked eye, without losing any quality.  This was astounding - the Canon SD630 took blurry pictures with a 6x zoom (one of the reasons I returned it), so I was very impressed by this.One cool feature that Powershot preceders didn't have is the large swivel screen.  It's very helpful if you want to put the 10-second or 2-minute timer on and capture a picture of you and friends.  You can position the swivel screen so that you can see how you look (ex: too close, too far away, off-center) and get better photos.  I also liked the large size; it's high-resolution, too, so it doesn't appear grainy on the screen.  My friend Nathan has a 3\" screen as well, but his has low-resolution and everything always looks grainy/blurry.One final neat feature of the A630 is it being motion-sensitive.  When viewing pictures, you can turn the camera 90º and view vertical images vertically on the screen.  If you try to view vertical images horizontally, you don't get a very good idea of how it turned out.All in all, this camera takes GREAT pictures and has neat effects, but is simple enough for an amateur to use.", "Date": "March 4, 2007"}, {"Title": "extreamly please with its performance", "Author": "NiceGuy", "ReviewID": "RN1Y75NHK9K19", "Overall": "5.0", "Content": "I really like this camera. It has many features of my larger and bulkier digital SLR. I like the stitching mode. The picture quality is very good. Night shots at low light performance is admirable. It is not exactly a \"slim\" type camera but does fit into your pocket. It servs well as camera for the starter (my wife) in the \"auto\" mode, or for the more experienced in the sp, or ap mode. The details in 11 by 8 prints are excellent. I am very happy with this buy.", "Date": "November 28, 2006"}, {"Title": "WOW!", "Author": "Julia Houghton", "ReviewID": "R2OGEDWAFU8AGY", "Overall": "5.0", "Content": "I just recently had a baby and we were using my husbands old Kodak DX4330 (3.1 mega pixels). After making prints we were not satisfied so we decided we needed a better but afforable camera. And after researching I found this to be the one. And I was right on! Great quality pictures! Easy to use! Awesome flip screen!! Just be sure to get a bigger memory card!", "Date": "October 19, 2006"}, {"Title": "Nice!", "Author": "Charles B. Summers", "ReviewID": "R3E3SSLZBX3FX6", "Overall": "4.0", "Content": "I bought this camera after breaking my Nikon Coolpix P2 which I LOVED. I was well pleased with the quality of pictures that the Nikon made, so I knew it was going to be hard to replace.A lot of research later, I found the Canon A630. I like the large LCD screen and what was even better was the fact that it would fold shut, or rotate so that even I could get into a shot once in a while. Even better than that is the picture quality... I have a picture of a plane towing a glider, and when enlarged you can actually see the tow line.The reason I gave it four stars is this camera doesn't have the rechargable battery pack that I liked so well with the Nikon. Also, the memory card slot is in the same door as the four AA-batteries and I usually end up spilling my batteries when getting the card out. Not really a big deal now after owning this camera awhile... but I would have preferred somewhere else.", "Date": "July 17, 2007"}, {"Title": "A630 - Good all around camera", "Author": "G. W. Smith", "ReviewID": "RZQ9QSZ8VOCB3", "Overall": "5.0", "Content": "This is a nice camera for the beginner to the advance user. I'm not a tall person, so in a crowd, it nice to be able to reach up with the camera above my head to take photos and actually see the screen.  The one thing I would like, but this camera does not has this capability, is image stabilization but for the price, you can't beat it.  An ISO above 800 would be nice and so would having RAW but then again, it would drive the price up.  It's a great point and shoot camera.  Don't recommending buying the Canon recommended Power Shot case as it is a tight fit and is just barely able to close.  Don't know what Canon thinking when they recommended the Power Shot Case.", "Date": "May 21, 2007"}, {"Title": "First Time Canon Buyer", "Author": "Eddie \"Jimmy\"", "ReviewID": "RGJQSWI3X8MR4", "Overall": "5.0", "Content": "I'm a amateur for sure but this camera makes me look like a pro. I'm amazed at the picture quality especially from distance. In the zoom mode while reviewing photos I can pick up detail from far away. I wish the manual had more explanations on how to use the all the features. Auto mode works good for now.", "Date": "December 3, 2006"}, {"Title": "good bang for your buck...PC mag's editor's choice", "Author": "Tonya N. Krueger \"nixter83\"", "ReviewID": "R2Z0HZNXT61F13", "Overall": "4.0", "Content": "don't fight it.  you will look around, drive yourself crazy and incessantly read reviews.  there's always going to be something bigger and better but for the price, this is a sweet little (not so little i guess) camera.  i'm still figuring out all of the functions, but the macro mode, color accent, and stitch assist are very neat and make creative photography a snap!  also, i got a rechargable docking battery charger made by energizer that allows you to charge 8 batteries in 2 removable \"pods\" so you can always be prepared--battery life is excellent (makes up for the bulky size).  i'm leaving for mexico in a few weeks and i can't wait to take this little guy with me.  i was debating a for a while whether or not to get the a640 instead, but many reviews have said that it's not worth the 80 or so more bucks. i figured that i'd go for the cheaper, identical version (besides the MPs) b/c it's a PC magazine eidtor's choice and overall customer satisfaction is higher for the a630.  i'm still toying with the idea of getting an underwater case, but i probably won't because of the design flaws and huge pricetag...we'll see though, taking the camera in the water would be amazing.just realize that not every camera has everything (i wish this one had image stabilizaiton and a better flash), but for the price, you make out like a bandit! happy shooting:)", "Date": "March 26, 2007"}, {"Title": "Great camera -- a bit bulky, though", "Author": "bob", "ReviewID": "R2L4BDCIPTIKEY", "Overall": "4.0", "Content": "This camera is amazing -- great shutter response time, excellant battery life, and tons of features and completley customizable.  However, it was so bulky, we often just left it at home, rather that take it with us to parties.  The same convenience of being able to use AA's (and not worrying about charging the camera, or having it die halfway through your trip) also results in a substantial bulk.  Also, the camera does not accomodate one-handed operation.  If portability is not a concern -- go for it.  It is infinitely tweakable -- with a full manual mode and lots of creative options.  But if you are looking for a point and shoot you can drop in your purse, or even your pocket, go for the SD630.", "Date": "December 21, 2006"}, {"Title": "Very Capable Camera", "Author": "T. Monroe", "ReviewID": "R1GD48QKTWCYHI", "Overall": "5.0", "Content": "The first digicam I got (another brand) was very disappointing for my purposes, the A630 is a major improvement.  Autofocus works very well in low light.  The LCD continues to work in dim light also instead of going blank.  Battery life is very good using 2000MAH AA rechargeables.  The tilt/swivel LCD display is very handy when its not possible to get your head behind the camera, such as documenting wiring inside an equipment rack or taking shots from ground level. There is a programmable self-timer mode which I have found to  be useful.  I use the optical viewfinder  often in bright sunlight when the LCD is difficult to see, many other models don't have this.  The A630  is capable of very good resolution, I have used it for photographing some intricate mechanisms and circuit boards and the detail in the pictures has brought favorable comments.  The auto white balance works well in most situations including dimmed incandescent light. Aperture priority mode is great for documentation shots where you need to maximize depth of field, many similar cameras don't have this mode.  Outdoors the A630 reproduces blue sky and clouds beautifully without using any lens filters. I have not used the movie mode so cannot comment on that.The pictures are a bit noisy at ISO 400 and above if enlarged although still good \"snapshot\" quality. In very dim light (without flash) its necessary to use high ISO and accept a little noise or stabilize the camera and use a slow shutter.  The shiny camera case can be rather slippery to hold, I put a strip of cloth tape on it for a big improvement.  The computer software provided has limited editing features, I use an old copy of Paint Shop Pro if significant editing 1s needed.Bottom line:  I am very happy with this camera so far, I have been able to get a good picture in just about any situation.  It has many useful features the average \"point & shoot\" does not which makes it a practical tool for work as well as pleasure photography.", "Date": "June 2, 2007"}, {"Title": "AWESOME!", "Author": "MDubs \"MDubs\"", "ReviewID": "R2XVVRF1UZPTFG", "Overall": "4.0", "Content": "This camera is more then I bargained for, Great 4x optical zoom, various picture settings.  Swivel screen lets you take pictures like your operating a video camera. Video also comes out very clear and sound is great.  I would give it 5 stars execpt for 2 things... 1. It comes with a measly 16mb sd card, which can hold about 7-12 pictures or about 7 sec of video. So I would suggest a 1 or 2g card.  2. I would suggest buying good quality 2500NiHm recargeable batteries, It will be cheaper in the long run.  Overall, execelent!", "Date": "February 23, 2007"}, {"Title": "8 megapixels of point and shoot", "Author": "Michael Horn \"mikie\"", "ReviewID": "RLPDM9JLY28ZF", "Overall": "4.0", "Content": "My Canon A85 was stolen from my car recently - and I needed a \"point and shoot\" camera of compact size when my Digital Rebel and camera bag are not needed or welcome.Canon no longer makes a compact \"PowerShot\" camera with CF Memory cards - and since I have a large investment in AA rechargables - I opted for this model over Canon models with a more compact lithium battery power source.Following the theme of the Powershot A70 - A95 - the camera is somewhat compact - except for the battery compartment holding 4 AA batteries. IT comes with 4 Alkalines - but you can go thru those in no time. Get yourself a set of rechargable 2300-2500 Amph/hr and be done with it. Additional thickness is added to the case to accommodate the swivel LCD viewer.Memory is located in with the battery compartment - the tiny SD card is spring loaded in a slot. I chose a standard speed 1 gig card - and shoot max resolution every time. I dislike mixing batteries and memory access on the same latch - having visions of AA batteries rolling loose everywhere ... lol... The camera has a need for greater power than ever - larger LCD viewer, more powerful flash and better, faster computer...The large LCD viewfinder is twist/movable in many directions. It is bright but strong sun will wash it out. The optical viewfinder is a good backup for strong sun situations.The built in speedlight/flash on the A630 continues Cannon's tradition of redeye - even with redeye setting utilized. The flash is more powerful than ever - as is the computer in auto setting - fastest setting yet - with fewer 'hunting' delays in low light situations.Picture quality is simply outstanding - vibrant oversaturation of colors - zoom lens adequate out to 4X - continue to stay away from that digital zoom past 4X...Overall - the A630 is a grown-up version of my A85. I like the swivel LCD viewer, faster computer, and familiar controls. It enables me to utilize my investment in rechargable AA batteries - and the whopping 8MP of picture quality gives me pause to take my 'digital Rebel' dSLR on vacation.Disappointed I am with the SD card in the battery compartment and the discontinuance of CF memory in the PowerShot line. On the positive side - I find no need to purchase the 10 MP model - the 8 MP of the A630 showing virtually no difference in picture quality in my camera use.", "Date": "January 2, 2007"}, {"Title": "A 630 Canon", "Author": "Tom Frasier", "ReviewID": "R1N3YJTUKD9Y46", "Overall": "5.0", "Content": "I was hesitant at first about buying another Canon camera after not being very satisfied with the previous one.  I'm glad I gave Canon another chance and purchased a A630.  I would recommend it for the photography who enjoys taking pictures for their album and showing to friends and family.  Anything more elaborate the learning curve widens.  Even though I'm still learning all of the options it offers, so far I like it very much.  The pictures are very clear", "Date": "March 31, 2007"}, {"Title": "Great camera", "Author": "D. Lewanda \"DLewanda\"", "ReviewID": "R9FYQNNXDIE68", "Overall": "5.0", "Content": "My wife and I received a Nikon SuperZoom 5MP camera for our wedding almost 3 years ago.  While it is a great camera, it was too large to be convenient as it required a separate case and was not easy to throw into a purse or backpack.  Due to this size limitation, we rarely had the camera to capture candid moments and general activities.  We also wanted a camera that ran on standard batteries if necessary.  Our old camera ran on a rechargable lithium-ion, but when we went on vacation this summer my wife forgot to pack the charger.  We burned through the battery in the first 2 days and had to resort to disposable cameras for the remainder of our trip.  After reading a number of reviews and hearing a few people mention their happiness, it was clear we wanted a Canon.  Canon makes 2 different lines of \"point-n-shoot\" cameras, the SD line and A.  Both received high reviews and we could have gone either way.  I decided to purchase the A610 because it appeared to be a sweet spot for the number of megapixels (8), optical zoom (4x) and price.  We took it on vacation over the holidays and took a number of quality shots, ranging from close-up portraits to large scene landscapes.  I used the PhotoStitch feature to grab 5 shots of the desert landscape around Scottsdale, AZ and used the included software to tie it together into a great-looking wide angle shot.  I hope to get the photo printed professionally because it came out too large for my home photo printer.  I also liked how the LCD screen automatically rotates when shooting in landscape or portrait mode.  The controls were very intuitive and easy to use.  The standard SD card slot is a plus as my laptop also accepts SD, thereby allowing me to use my laptop as a transfer device and not require carrying multiple cards.  A 1GB disk is certainly big enough for 1 day of photos, and if it is full, I can easily empty it onto my laptop.  All in all, the Canon A610 is a great looking, feeling and photo-producing camera.", "Date": "January 27, 2007"}, {"Title": "Love it.", "Author": "David L. Spahr", "ReviewID": "R39F22J0MZFDCQ", "Overall": "5.0", "Content": "This camera is great! The large flip screen is very useful if photographing near the ground, over head, or for photographing yourself. Ergonomically excellent for a person with larger hands. This camera has lots of features and apparently can take it too. I often shoot over 500 pictures a week with it. Sometimes far more. I take it everywhere. See my photos in the customer images to know why I love this camera!", "Date": "July 24, 2007"}, {"Title": "Great camera, great price", "Author": "David H", "ReviewID": "RLBRMF6MPYZFL", "Overall": "5.0", "Content": "I stepped up to this model from a PowerShot A70, and was pleased to find that basic operation was pretty much the same as the A70, allowing me to get up to speed with it in a very short time.  In size, the A630 is even larger than the A70, but that's not a drawback for me as it still fits conveniently in my pocket.  It uses four AAs, like the A70, and its hefty feel adds camera stability when longer shutter times are called for.  The 8 mega pixel images are a vast improvement over the A70's 3.2 mega pixels, with incredibly precise resolution possible, especially in well lighted images.  These images run between 5 and 6 megs each, but the 1 gigabyte data card I bought with it still holds over 200 of them (or many hundreds of smaller pictures), so that's not a problem either.  I like the option of complete manual operation, but also appreciate being able to take lots of fast snapshots on auto with some expectation of getting usable pictures.  The flash is stronger than the A70's, so I'm looking forward to using it underground on caving trips.  Redeye is still a problem, even with the redeye reduction pre-flash.  I'm getting better at PhotoShopping it out.  One thing I really like is the fact that this camera will do its thing the instant you press the shutter button, like an SLR, so if you're trying to put a speeding diesel locomotive right in the center of the frame, you don't have to lead your target or compensate for any time lag.  One of the best features of this model is its pricepoint - amazingly low for what you get.  I say, if you don't mind its size, go for it.", "Date": "April 22, 2007"}, {"Title": "Great Camera", "Author": "Timezone \"Timezone\"", "ReviewID": "R2UJYRKQE1XODA", "Overall": "5.0", "Content": "I bought this camera for my wife for Christmas 2006.  We have taken over 300 photos with the camera in 2 months without a problem or flaw.  We have only shot in the Automatic mode, thus far, and automatic mode is where the camera will be set at 95% of the time.  The camera is great and the price is right.  The camera fits nicely in my hand and is a perfect size and shape.  I do not care for those \"credit card\" size digital cameras because they can easily be lost. The rotateable viewing screen is very inovative and useful when using a tripod and protects the screen when the screen is folded inward and not in use. The Software is very user friendly and I had no problem transferring the photos to my computer. I'd recommend this well designed digital camera to anyone.  I would even buy another one.", "Date": "February 13, 2007"}, {"Title": "Extreme value for the money", "Author": "E. Berin", "ReviewID": "R24SR6Y712VSZE", "Overall": "5.0", "Content": "I bought this Canon A630 to back up my Canon Rebel XT dSLR - both are 8 Mpixel.  The A630 was intended for situations that didn't require the dSLR attributes - low light, lens interchangeability, bulkiness,and most importantly:  the rapid shot-to-shot capability.The Canon A630 is an excellent point-and-show.  The image quality is nearly identical to my Rebel XT (except for low light situations and flash recovery speed).I had to keep reminding myself this is NOT a Rebel XT (in size, speed, price, bulk, and low  light situations).  It is a $299 vs. $899 list camera for TOTALLY different purposes.The swiveling lens is great for off-angle shots (e.g. over head, around corner in tight situation like an aircraft carrier deck, etc.).  The 4X zoom is nice;  I like 12X, but 4X is perfect for most folks.The movie mode (640x480 at 30 fps) is very nice too - it still have some artifacts compared to a true video camera, but adequate quality for short clips.  I used it for New Year's fireworks in Oahu, Hawaii and the video is pretty good with some artifacts in the dark sky areas.  It beats having to carry two cameras.The menus are very handy - selecting BW or Sepia instantly changes the view finder to show exactly how it looks.Use of anything beyond ISO 80 is recommended only as last resort.  The image noise levels are noticeable and at 400 and beyond, I consider it very bad.  If you need the shot, use it, but don't expect good image quality.I also bought the DC8 underwater housing for snorkeling in Oahu's Hanauma Bay - it allows total control of the camera from power on to ALL features and modes.  The pictures I took were fantastic.  It would be nice to get an underwater housing for the Rebel XT, but at $900 vs. $199 for the DC8 housing, the A630/DC8 combination is an excellent value with great underwater capability.  The flash seemed to work very well underwater (unlike my Pentax Optio s4i - too much debris reflected back into the lens assembly with weird flares).  The A630/DC8 underwater performance was beyond my expectations.Make sure to switch to 'fish' mode to compensate for blueness of underwater.The 4xAA battery capability is compatible with my battery stash.  The SD cards need to be selected carefully.  An 8 Mpixel camera can comfortably use a 2GB SD card.  However, if you get a 4 or 8 GB card, you MUST get an SD HC-compliant card - the non-SD HC cards do NOT work.  I bought/returned a Pretec 4 GB SD card - it was not SD HC-compliant and simply did not work.  Canon's website says the A630/A640 are SD HC-compliant and the cards are available, but rather expensive.  I made do with 2x2GB cards, but that may be a limitation underwater (as you can't easily change cards on the beach without getting sand/water in the camera).  My snorkel outing did just fine with 2 GB card for 2 hours of snorkeling.Highly recommended.  If you like to crop your pictures, I assume the A640 (10 Mpixel) may be better, but the street price is about $100 more.  It isn't worth it if you simply 'point-and-shoot' with zero post-processing.END", "Date": "January 4, 2007"}, {"Title": "Canon does it again", "Author": "Ginnyspal", "ReviewID": "R1LX3GRQ4FRQM4", "Overall": "5.0", "Content": "I have purchased several cameras in the last 4 years.  This Canon is a great little camera.  It has a swivel LCD view screen which is great for protecting the screen when not in use.  The pictures are very good quality.", "Date": "June 1, 2007"}, {"Title": "Good enough", "Author": "hadi", "ReviewID": "R2U0K1H79GTI5J", "Overall": "4.0", "Content": "Canon PowerShot A630 8MP Digital Camera is a nice camera.  I specifically chose this camera for its rotating screen.  One disappointing thing is that some of the most often used functions (such as self timer) are buried in the menu rather than manual knob or button.", "Date": "February 14, 2007"}, {"Title": "Wow!", "Author": "T. Crawford", "ReviewID": "R1NLTWSI3WOT9I", "Overall": "5.0", "Content": "Super Fast!  Camera is great so far....haven't really played with it yet but I will tell you the shipping was wow!  I ordered this about 10:30pm on a Saturday.  Got an E-mail on Monday saying it was shipped. Wednesday I had it in my hands.  How fast is that!!!?  Plus it was \"free shipping\"!!!I did my research on this camera and it seems to be perfect for my use.  Took a couple of photos and they are spectacular indoors and out! Price is right too.  I amost got the A640 but couldn't part with an extra $100. just for 2 more mega pixels when 8 will do fine.  The software is easy to install and my photos downloaded fast to the computer.  Also this camera lets you take pics pretty fast in a row using the flash so I considered that as well.  It works just like all the 5 star reviews say it does.  I have had a Kodak EasyShare and that failed after 3 years so this is a great upgrade.  I recomend this camera for it's ease of use, cost and great product support (software)  Check out all the great reviews!  All these people can't be wrong!", "Date": "March 29, 2007"}, {"Title": "Great Camera Well Worth It!!!!!!!!!!!!!!!!!!!!", "Author": "Brandon G. Sabala", "ReviewID": "R1P85UWM1ON5UK", "Overall": "5.0", "Content": "I was hesitant to spend the money on this camera but after I did, I was very pleased and would have spent another $50-100 on it.  So many options to use, great picture quality, and the rotating screen very helpful for taking pictures of yourself for webpages and other uses.  If you take a picture and view it while turning the camera sideways the picture will rotate anyway you turn the camera except the upside down position. Any otherway the picture will rotate with you, it was something I was in aaahhhh about the first time I discovered it.  It caught me off guard the first time I discovered it since I never read directions anyways.", "Date": "November 28, 2006"}, {"Title": "Love it", "Author": "CatLady", "ReviewID": "R3KR6RP716XXWY", "Overall": "5.0", "Content": "This is our first digital (I know, we live like cavemen) and I absolutely love it.  Everyone is soooo jealous when I swivel the screen.  It is perfect size FOR US but my sister said, OMG thats huge! Have had no problems, bought the rechargeable batteries and they are still on first charge after several months and hundreds of pictures.  I am not a techy but even I feel comfortable with this camera.  Love the quality.", "Date": "August 1, 2007"}, {"Title": "great camera", "Author": "D. Henderson", "ReviewID": "R9H0MLI4ZDX5J", "Overall": "5.0", "Content": "This is a great camera, I have taken many pictures with the batteries right out of the box and they are still going strong. The many option to the camera are easy to figure out without having to research a lot i the books. The camera shuts down fast and turns on quickly. Both are good for saving battery life on shut down and if the perfect picture comes up you can get the shot.The large LCD screen on the back is nice for viewing your pictures and looking at menu options without having to squint your eyes. I will be purchasing rechargeable batteries soon when the original batteries die so I can get even longer life before having to change the batteries out again.", "Date": "July 27, 2007"}, {"Title": "Better than I had hoped!", "Author": "Gwardan Woodruff", "ReviewID": "R35W05H20A4L0T", "Overall": "5.0", "Content": "After shopping around several stores and online, I bought the A630 with high hopes. This camera did not disappoint! I love the huge LCD screen that can be folded over to protect and refolded to address the picture to help produce and center a family photo or self portrait. There are several lighting options that you can use that definitely help in tricky situations. I took this camera to a Cincinnati Reds game and was impressed at the quality photos I was able to retrieve. I sat midway up in the stands and was able to capture some excellent batting pics of Griffey Jr. However, when the zoom is in full effect the camera must be held completely still in order to get clear photos. After some trial and error I was able to come back with some great pics! This camera gives very sharp, colorful pics almost everytime. It took some time to get used to the focus, which is made by holding the shutter button halfway down before taking the pic. I also used the video function at a recent party and was suprised to find that the audio came out better than expected. The video is a little grainy, but I bought it for the pictures, not the video. Although bigger than your normal point and shoot cameras, it is still an excellent buy for the quality photos that you will get in return. And at 8 megapixels I will not need to upgrade for quite some time.", "Date": "July 8, 2007"}, {"Title": "this camera is our newest addition to the FAMILY!!", "Author": "VERY HAPPY \"bang for my Buck!\"", "ReviewID": "R1PROOJ2JX3WRC", "Overall": "5.0", "Content": "i have to say I LOVE my camera.  if you are looking for a fairly easy camera with all kinds of options that are easy to figure out (like at the aquarium or very bright lights...) this camera is for you.  I also got a set of rechargeable batteries and a 2G memory card (i have filled twice in two weeks)  the video is very nice..the speed is great for this price of cameras. the best i have seen.  i spent weeks comparing price, priorities(pixels, eye finder, batteries, etc.) and customer review...I am VERY pleased with my choice.things i LOVE that i was not looking for...the rotating screen (i like to throw it in my purse and it is protected)rechargeable batteries.My favorite setting is the \"kids and pets\" with the continuous picture thingy.(i am not a camera expert)...going down a pool slide or jumping of the diving board is GREAT!! all in focus!!LOVE IT!!!", "Date": "June 19, 2007"}, {"Title": "Great camera, reasonably priced!", "Author": "Susie", "ReviewID": "RKPYM99H63VR2", "Overall": "5.0", "Content": "I am one to really review and investigate a product before I purchase it.  We have had previous Canon digital cameras and as always Canon has upgraded and comes through with a great product.  I bought this as a starter camera for my son and it has proven to be easy to use.  The picture quality is good and there are many other options/settings that we have yet to investigate and try. The flip screen is amazing.The two things that I would even slightly comment to the negative are: the memory card and focusing.  As with all digital cameras, the memory card that comes with the camera is small.  You would be well advised to buy as additional memeory card with your purchase of the camera.Also, focusing at very far distances takes some getting used to.  As you focus the image blurs then clears and sometimes blurs again before a final clear.  It is important to make sure the image is clear on the LCD before you click the picture.  After a weekend of picture taking we got used to this.As always, even after surfing reviews and pricing, Amazon was right on with reviews, the best price and very quick shipping.I am very satisfied with this purchase.", "Date": "June 12, 2007"}, {"Title": "Fantastic camera", "Author": "K. Fassman", "ReviewID": "R2QPQUS6J1HPFX", "Overall": "5.0", "Content": "I previously owned a Nikon Coolpix 3.1 MP camera, so that had set my expectations before buying the Powershot A630.  This camera is a HUGE upgrade in many areas, including:* Fast startup* Image quality (which is an obvious one going from 3.1 to 8 megapixels)* Ability to shoot images in low light* The flip open/hide screen is great too.  By not using the screen (which is the normal condition when I shoot) it saves battery life.* The fact that it uses standard AA batteries instead of expensive camera batteries.* Even the included software to manage the downloads and view/edit images is an upgradeThe only negatives I can think of are:* Heavy in comparison to other cameras I've had/tested* Battery life isn't great.  That may have to do with my choice of batteries, too.* It should come with a case", "Date": "June 11, 2007"}, {"Title": "versatile, great photos", "Author": "MELLOPT", "ReviewID": "RGIIYIHOSHBBF", "Overall": "5.0", "Content": "A replacement for my Canon A40 w 3x zoom and 2.1 mpx.  A world of difference,ESPECIALLY with that swiveling large size LCD.  What a help!!!!  Even in sun canadjust so rarely need to use viewfinder.The large mpx serves as an additional zoom factor, since when you set camera atmax size/rez with very large mpx image, AND use zoom, you can get good image ofsmaller subject from a decent distance, nearly like using a telescope!!!Batt life very good, with the 4 AA as was with my earlier model.  Actually so mayvarients for pic taking I tend to get lost at times, but since I read the How To inmanual only when I HAVE to, its my fault.Highly recommended.  Now all I need is decent aftermarket flash for additional interior work.", "Date": "May 16, 2007"}, {"Title": "Consistent Quality! A sure winner!", "Author": "Tuan Vuong Pham \"T. Vuong Pham\"", "ReviewID": "R30QYT7GFCEV67", "Overall": "5.0", "Content": "I have owned the Canon PowerShot A70 for several years.. I was overdue to upgrade..This camera is great!- SD memory is very small, and takes less power and holds more images.. even at 8 MP!!- The swing-away LCD is very convenient!- Large enough to hold on with out shaking! (smaller cameras aren't steady)optics are excellent.- Imagery is fantastic for 8 MP.- AA batteries can be had anywhere.. and rechargeable ones are inexpensive.- SCN modes help lighting, Aperture, Exposure etc.The camera's functions can be a bit overwhelming.. but offer so much control!Summary:Good quality camera. Point and shoot enthusiast and control fanatics!Canon makes solid products!Amazon Prime fantastic shipping and service!", "Date": "March 9, 2007"}, {"Title": "Canon A630 the best yet!", "Author": "Martha W. Straub", "ReviewID": "R2TXL7YF4FDVV2", "Overall": "5.0", "Content": "Awesome!  I love this camera.  Many wonderful features.  Fast focus, great zoom, wonderful quality pictures, easy to use!", "Date": "August 17, 2007"}, {"Title": "Just what I was looking for!", "Author": "Wanda", "ReviewID": "R3H677FKQZ870L", "Overall": "5.0", "Content": "The Canon PowerShot A630 is even better than I imagined.  I have had it two weeks and already have 237 photos that everyone is impressed with.  The quality is excellent and it is so simple to use that I am carrying it with me almost everywhere.  I had a Minolta Dimage and it was way too complicated to carry and to use.  This is exactly what I have been looking for and would recommend it to anyone who wants great photos.  Both of my college age kids got one last Christmas and so, I knew it was what I wanted in a camera.", "Date": "August 13, 2007"}, {"Title": "Very Good Digital Camera", "Author": "Mahmoud I. Soliman \"Mahmoud Soliman\"", "ReviewID": "R3VTTLVDKXF0AN", "Overall": "5.0", "Content": "This is my second Canon Digital Camera because I used to have powershot 95 but my brother like it and I gave it to him as gift.So I did a lots of research again on the net and I could not find a better camera then this one.", "Date": "July 23, 2007"}, {"Title": "canon powershot A630 digital camera", "Author": "Stephanie F. Biello", "ReviewID": "R19VY8HM9PUKRP", "Overall": "5.0", "Content": "This is a great overall camera. I like the swivel screen a lot. This feature allows you to take pictures of yourself or of objects in different angles and still be able to see what you are photographing. The pictures are very clear. The auto mode seems to work better for the most part than choosing a specific setting option. The camera is very versitile and easy to use. A great camera for the affordable price.", "Date": "July 22, 2007"}, {"Title": "A High Quality Point and Shoot Camera", "Author": "Beam Me Up \"BMU\"", "ReviewID": "R1PSL74RDPTGAJ", "Overall": "4.0", "Content": "I am thoroughly satisfied with my purchase.  I wanted a higher end \"Point and Shoot\" class camera.  To fit the bill, it needed to be priced appropriately, and take very good pictures that could later be enlarged and cropped with little image degradation.  This camera can do that.  Furthermore, I did not want a camera that was so manual that I would miss good shots while trying to guess which settings to use. This camera feels good in my hands (not to small and not too large) and is still light enough that you will want to take it everywhere.  Lastly, it runs on 4 AA batteries which are inexpensive easy to find.", "Date": "June 22, 2007"}, {"Title": "Worth the money", "Author": "Addsmiles...", "ReviewID": "R1KOXJ9XXRY2L8", "Overall": "4.0", "Content": "Bought this in a haste as I as planning an trip to an outdoor location and did not have a camera. Result: Very much satisfied...Pros and Cons are below:+ves: Performs its prmiary function very well that is takes amazingly clear picures, the rotating LCD screen adds a lot of flexibility and helps us take pics in any position.-ves: Requires 4 AA batteries and is hence a bit bulky, also batteries are sucked out very quickly (keep a spare set in case the charger is not handy) I am also not very sure of its capability when the light is not good, maybe a bit of fine tune is needed from my side...Over all worth the money, and I cannot complain given the amount I paid for it...", "Date": "June 4, 2007"}, {"Title": "Love this camera", "Author": "L. Newington", "ReviewID": "R2P8OBENK9F5B3", "Overall": "5.0", "Content": "I absolutely love this camera. It is hands down the best digital camera I have ever owned. It is extremely easy to use. There are a so many options and settings. This camera can pretty much do anything that you could think of. Great camera for the price. I highly recommend it.", "Date": "May 28, 2007"}, {"Title": "Fully Functional!", "Author": "AG \"AG\"", "ReviewID": "R2ET86YTJR55F", "Overall": "5.0", "Content": "I'm actually excited about this camera because I could figure it out and take pictures right away.  I will say that the battery compartment is a joke and I might end up breaking it at some point, but the battery life is good, so I don't have to risk it very often!  This camera is bigger than most other newer cameras; however, it's by no means bulky or huge and fits into my purse just fine.  I like that there is somewhere to grip and the LCD comes out and flips around to really see what I'm shooting.  The zoom is awesome as well.  I'm amazed at how far technology has come since my last camera.  This is an 8 mega pixel camera with great zoom in a great size for a great price!", "Date": "May 15, 2007"}, {"Title": "Nice buy", "Author": "Ricardo C. Carvalho", "ReviewID": "R2ZATTMKR4VUGN", "Overall": "5.0", "Content": "The Canon PowerShot A630 is a light, fast and dependable camera. My first Canon was the A75, 3.2 mp; this one shoots faster, saves battery power and has enough programs that allows a snapshot and a more elaborate, almost manual settings photo. It deals beautifully with difficult lighting and the photos are sharp with very nice colors. I'm an amateur and use for leisure photos. It is, as much as I looked at the other cameras, a wonderful value for the money spent. I'm happy with it", "Date": "April 10, 2007"}, {"Title": "Nice camera", "Author": "George R.", "ReviewID": "R1FGHNWUI3D9U3", "Overall": "4.0", "Content": "This is an amazing camera for the average amateur photographer. Nice picture and video quality. Compact enough to fit in your jeans pocket (if you wear them baggy), but not too small that it will be easily misplaced. I am not a big fan of the memory card placement (in the compartment where the battery goes), but the pictures look quite nice, and the zoom covers my basic needs.", "Date": "March 10, 2007"}, {"Title": "Very worthy camera", "Author": "Victoria Rakhshteyn", "ReviewID": "R4HGR8GXGEDC", "Overall": "5.0", "Content": "It is easy to use, not too big, neither too heavy. High quality of a picture, very high resolution makes possible to crop pictures as much as you wish. It is possible to make a good quality portrait from a regular photo. It is close to professional level of performance, but with very prudent price.", "Date": "March 9, 2007"}, {"Title": "Great camera!", "Author": "Cary Thomas", "ReviewID": "R22QBR9XICKF0D", "Overall": "5.0", "Content": "This is a great camera, I bought it for my sister and she absolutely loves it!  Easy to use features, and the LCD display is great.  It doesn't drain batteries like most other digital cameras, and the picture quality is awesome.  Definately a great buy for the money!!", "Date": "December 28, 2006"}, {"Title": "I love this camera, I can't put it down!!", "Author": "Stacy L. Pinghera \"STACE\"", "ReviewID": "RW0ZLGW8EYAG0", "Overall": "5.0", "Content": "This is the best camera, EVER!! I love this camera; the quality is amazing and the pictures are so clear.  If you have any doubts, DON'T! This is the camera you want and you will not be disappointed!!", "Date": "November 25, 2006"}, {"Title": "Best Canon yet!", "Author": "Erin A. Stewart \"hummingbird lover\"", "ReviewID": "R1D82LVM6UUVJ4", "Overall": "5.0", "Content": "This is the best Canon point and shoot that I have purchased yet!I had the A75, A520 and then this one.People are always looking at my pictures and ask \"What kind of camera do you have?\".  They think it is some pro model.The picture quality is great and the features available make it very versitile.  Video is also very good.The battery life is very long with high quality rechargables too.  On a recent Grand Canyon trip I took over 600 pictures in 13 days on one set of batteries.  Amazing!Great camera, no doubt!", "Date": "December 6, 2007"}, {"Title": "Yeah, Baby!", "Author": "T Money", "ReviewID": "RBU6VZVMYRU9J", "Overall": "5.0", "Content": "I spent many weeks trying decide which camera to buy. I can't do anything impulsively. Finally I was deciding between the nikon s10 and canon a630. i was kind of worried about 4X zoom Vs 10X. After much anguish i picked the a630. it is awesome. the 4X zoom is fine with 8mp, i can use digital zoom(ie crop out part of the picture)and the quality is still incredible. It has all kinds of great extras, but i am just going to focus on the important stuff: quick response, a screen and viewfinder, manual mode, video, powerful flash, variable shutter speed. What's best though is the articulated LCD.At first I thought it was unnecessary that it could swivel and rotate 360 degrees but it is great. While the s10's screen can rotate only vertically in order to take high or low horizontally-oriented shots with ease, it cannot rotate horizontally to easily take vertically oriented shots like the a630. the screen is so great at concerts especially. i can hold it above my head (and the crowd) in the vertical or horizontal position and just point the screen towards me.Also, i like that it takes 4 AAs so i can just use regular batteries if my rechargables ever run out. i got the Eneloop batteries and so far they are awesome. i got the kingston ultimate 2gb card as well. These help my camera to operate quickly in continuous shooting (burst) mode. I can also adjust the size and resolution to shoot faster. the options available are abundant. i can turn off the sound and adjust anything i want.I have taken some sweet concert shots with slow shutter speed and also some beautiful shots of flowers in macro mode.the only things i dislike are: (1) i cant shoot with inverted colors; i would have to invert them after on my computer. (doesnt matter, just would be more fun) (2) There is no dedicated sports mode. I can easily go to manual or shutter speed mode to pick a fast speed, but i just wish it would do this stuff for me. i think this is so i can change other settings as well(ie. shoot in snow mode with fast shutter).I definitely am pleased with my choice.", "Date": "October 18, 2007"}, {"Title": "Great Camera ! Good for videos too", "Author": "Saravanan Velrajan \"Saro Velrajan\"", "ReviewID": "R8H0K8BDEZVNE", "Overall": "4.0", "Content": "I've been owning this camera for the past 6 months. It is so easy to handle. I am not an expert photographer - the \"auto\" mode works well for me. This camera can be used to take good videos too. The quality of the videos taken are comparable to the ones taken by Sony DCR-HC48 camcorder. Best suited for indoor day time videos. The only drawback is the need for 4 AA batteries which makes the camera too heavy to carry. If you are used to compact models from Canon, you would find it a bit difficult to adjust to this. However, you can compromise for the nice LCD display, 8 Mega pixels photos and the quality videos.I am a loyal Canon customer and the A630 hasn't disappointed me.", "Date": "October 13, 2007"}, {"Title": "Fantastic camera", "Author": "grizzly adams mountain man \"mountainman\"", "ReviewID": "R19BRBTNMXAOLU", "Overall": "5.0", "Content": "This is my second CANON power shot camera, my last one was the A80. I would still have it but it was stolen. The build quality of the A630 is very good and feels solid. The camera takes fantastic pictures and is easy to use. The manual is very well written. Great product and very rugged!", "Date": "October 13, 2007"}, {"Title": "Great camera", "Author": "A. R. Lanier", "ReviewID": "R3HZL7BSXCAAYA", "Overall": "4.0", "Content": "I ordered this camera based on a rating I received in Consumer Reports.  I ordered the camera online and it only took a few days before I received it. The first time I used this camera, I was smitten by its performance.  I've never owned a camera as nice or as fancy as this.  I love it!  The memory card only allowed me to take 6 pics before it was full though. So I went online and brought an additional 1G of memory . . . and it is so worth it.  Now I can make a 5-minute movie along with taking a huge amount of pics and I never fear that I am going to run out of memory.  I am excited about learning what else this camera can do.", "Date": "October 10, 2007"}, {"Title": "Awesome little camera!!", "Author": "Michael Eggleston, Jr. \"Computer Geek\"", "ReviewID": "R219A5RY8SY3XE", "Overall": "5.0", "Content": "This is a serious little camera for very little money.  This has to be one of the finest cameras that I have ever owned.  It is versatile, relatively light-weight, and can store a lot of photos.  The only down-side that I see is that it uses batteries, instead of a rechargeable battery.  However, that down-side is easily handled with rechargeable AA batteries.", "Date": "July 30, 2007"}, {"Title": "Great camera", "Author": "Anthony Bynoe", "ReviewID": "R1XVPEBO27JFHJ", "Overall": "4.0", "Content": "Takes very good pics and with the swing around LCD screen self potraits are even easier as you can see yourself before the pic is taken. 8mp for under $200 and uses AA batteries that's a good combination for me.", "Date": "June 22, 2007"}, {"Title": "Awesome Camera", "Author": "Expatriot", "ReviewID": "R16KO6VPIY129K", "Overall": "5.0", "Content": "Terrific equipment. Canon proved it again. Very easy to use unit, comes with lots of features, and delivers excellent picture. I used to own another Canon P&S; unit (A-70) but LCD on A-360 is much better. The capability to rotate the LCD adds another dimension to the flexibility of this product. So far, I used two different ASA settings, i.e.  ASA 200 and ASA 400. The picture quality in each case was superb.Downside if any would be the SD Card that comes from the factory has very limited capacity, 16MB only. You ought to have a card with much higher capacity. Overall a brilliant product to own for any level of camera user expertise.", "Date": "May 29, 2007"}, {"Title": "Great Camera Value", "Author": "Michael Graham", "ReviewID": "R2FV1JKBE5TKSG", "Overall": "5.0", "Content": "I previously had a Cannon A85 which I was very pleased with but the A630 takes photography to a new level.Easy to operate....a lot of bang for your buck!", "Date": "May 24, 2007"}, {"Title": "Canon PowerShot A630  WOW!!", "Author": "David J. Brumbaugh", "ReviewID": "R2K1LR8NQZASN0", "Overall": "5.0", "Content": "At the time when I purchased this camera, I had been working with an 8.1 digital camera that wasn't even a true brand name. This previous camera had been nice until it went and it wasn't even a year old. I had been using it for my photo class at college until a vital part died. Luckily, I saw the Canon PowerShot A630 and read over its vital statistics. It more than fit the bill and it was a lot less than the previous camera. I was able to finish up my project in about a week and a half and found timeto play with it and find out for myself what it can do. Now that I have graduated I have read certain parts of the manual and was blown away by what it is able to do. It had been the screen that had originally sold me on it and now that I have found out what else it is capable of I'll truly treasure this camera - I just wish Maria Sharapova came with it!!", "Date": "May 21, 2007"}, {"Title": "great camera for lots of uses", "Author": "Jami Berthiaume \"Jamileena\"", "ReviewID": "R2G8SRANOGOX7O", "Overall": "5.0", "Content": "This was a purchace for work. We needed a camera with easy to read and use settings, easy to take quick snaps shots, as well as good close up, detail shots in close quarters. The flip out display makes it  very easy to use in a lot of situations. I bought two, actually-one for my use and one for the department to use. I also bought the same camera for my husband's birthday. It also takes video with sound, for those funny moments at work...", "Date": "May 14, 2007"}, {"Title": "Can't get a better camera for the price!!", "Author": "Philly Phan", "ReviewID": "RWYPXMXPAZCE3", "Overall": "5.0", "Content": "My wife and I purchased the A630 3 months ago after doing a decent amount of research, and we both love it. Almost every feature of this camera is great. Long battery life (4 AAs), Good-Sized LCD screen, 8MP provides high-quality photos and movies even at 16x zoom, fast shutter speed (no waiting 5 seconds for the camera to \"reset\" in between pictures), etc. One of the neatest features is the fold-out LCD screen. We have 2 small children (age 3 and 11 months). If you flip out the screen so that they can see themselves, you can get some good photos because they're focused on watching themselves on the screen!", "Date": "May 12, 2007"}, {"Title": "So far, SO good --", "Author": "Kashi Frank", "ReviewID": "R298W9DR34X6NP", "Overall": "5.0", "Content": "I've been using this camera for a couple months and am very happy with it.  The big flip screen is a great asset - and my pictures are excellent quality, although I haven't yet read the manual.  No doubt they'll be spectacular once I do that.  Previously I had a sophisticated \"professional\" Olympus digital with too many options for me, so I gave it to our son, who has more patience and understanding. This one may have the same options, but somehow it isn't as daunting.", "Date": "February 10, 2007"}, {"Title": "A great camera at a great price!!", "Author": "K. Eason \"K.Eason\"", "ReviewID": "R1Z50K3JRZHVEO", "Overall": "5.0", "Content": "I am very impressed with the quality of this camera! Amazon has it for an amazing price as well. I went to Target and Walmart and they had the same exact camera for 299.00! I recently got my pictures developed and they were very high quality pictures. It takes awhile to figure out all the different settings on the camera, but is worth getting. This is the best digital camera that I have ever owned. I used to have a Kodak easy share and this camera puts the Kodak ones to shame. I highly recommend!", "Date": "April 4, 2007"}, {"Title": "No disappointment here...", "Author": "Visual Avatar \"Technocrat\"", "ReviewID": "R37RHHPAZP1PDX", "Overall": "5.0", "Content": "I decided to replace my Power Shot A95 (5 megapixels) with the A630.  In comparing the two models the enhancement to picture quality with the A630 is incredible.  Pictures are sharp.  Colors are vivid and true.  I am a point and click person...this camera is just the ticket.", "Date": "December 29, 2006"}, {"Title": "GREAT CAMERA.... BUT.................", "Author": "MichaelM \"MichaelM\"", "ReviewID": "R2S04WAVSG9A4I", "Overall": "5.0", "Content": "I have been shooting Canon DSLR's professionally since 2004 (after a 30 year love affair with Nikon.. which let me down for the last time!)This little P&S; makes great images! If I want the overrides one usually has w/a SLR, I have it..... AV, TV, M, \"manual\" focus, Fill flash,Exp comp for both existing light & flash.... LOVE IT!!Occasionally I do get underexposures w/flash, but if noticed, this prob is easily remedied using the flash+/- feature or perhaps by changing the ISO.Some of the images I have made w/this camera have been good enough to sell. Videos are as expected... fair at BEST. You'll document fun stuff withthis easily, but don't expect anything hi quality. [Buy a REAL video camera for that.... duh...]The \"articulated\" or 'rotating' screen was a MAJOR selling feature for me & I use that with nearly 80-90% of my shots.OVERALL A GREAT, WELL BUILT, WELL DESIGNED & ENGINEERED CAMERA that I have been using for 5-6 years and love!! I wouldn't trade it for anything.HOWEVER.......................If some fool is REALLY trying to get $700+ for this.................. LAUGH OUT LOUD!!!!Then find another camera for a fraction of the cost!!!!!!!!!!!THE SELLER MUST BE ON DRUGS OR ON ANOTHER PLANET TO EVEN THINK ABOUT ASKING THAT KIND OF PRICE!!!!!!!!!!!!!!!!!!!!Just sayin..............", "Date": "January 8, 2013"}, {"Title": "Bulletproof Camera, Great Pix and Video, Mixed Programming", "Author": "Mark Lee", "ReviewID": "R1AO7UBZKEJMTP", "Overall": "4.0", "Content": "Our county bought a pile of these great cameras along with 1GB memory cards and we've been using them for a year now.  This is a tough digital with a bright display that you can pull out and flip around if you want.  The high-res video mode is 640x480 and smooth.  We bought them for use by law enforcement, fire and ambulance crews because the controls are large and easily manipulated by people under a bit of stress.  The USB2 cable connection is fast and the transfer software is acceptable, even if it's not terribly pretty.  The software stores your photos in dated folders, so make sure you've set up your camera properly.  One of our folks had a bunch of photos end up in a folder dated \"1980\" which appears to be the blank date setting.  I carry mine with an extra four AA batteries (yup, four) because you don't get much warning when they go.  But as a general rule, the camera's not a battery hog either.  The macro and exposure adjustment setting work pretty darn well.I've dumped this camera a number of times and keeps on ticking.  It's *not* a professional camera for those who are hypercritical, but what it does, it does very well and while I usually use this camera for work, the few private photos I've put up in blogs are of very good quality and usually get comments.", "Date": "April 1, 2008"}, {"Title": "GREAT camera with a few kinks", "Author": "Ziti man", "ReviewID": "RLY57XK7D4CUX", "Overall": "4.0", "Content": "If you're looking to purchase a camera, I would seriously consider adding this one to your research list. Below are the major Pros and Cons. As you will see, the pros are much more numerous than the cons, but the it really depends on what's important to you.PROS:-Great picture quality. Those 8 MP really pay off.-Wide range of options. Choose from differnt types of lighting available, sharpness of the pictures, ISO ranges, and app settings.-Ease of use. I personally monkey around with it before my pictures to get the best quality, but your waitress could grab it and take the picture without having to get a lecture on usage.-Fairly accurate rendition of the picture on the LCD screen-Big LCD screen-Adjustable screen. This seems strange to need it, but it comes in handy ALL THE TIME. I'm a young guy, so my friends and I are always taking pictures of ourselves when we're out, so the screen can turn towards the front of the camera to accomidate. Also, you can angle the screen so that you can take the pictures in strange positions and still get good view.-The digital zoom is 4x. This is huge. The most I've seem besides this was 3.5x. It also has a 16x optical zoom, which is nice, but shouldn't be confused with digital.CONS:-For some reason, there is no image stability on this model. Earlier and later models have them, but not this one. If you don't know how to play with the ISO settings, then this could be an issue.-Low-light pictures can be another issue. Again, there are ways to monkey areound with it, but if you don't want that extra work, that is an issue to consider.-Macro settings are nice, but on a camera of this caliber, it really should also have a super macroHope this was helpful!", "Date": "December 6, 2007"}, {"Title": "4AA Batteries make this a winner!", "Author": "Samo \"Samo\"", "ReviewID": "R3PRF6O3F0NRZD", "Overall": "5.0", "Content": "This camera takes wonderful detailed pictures at most every setting.  The swivel LCD can be very useful although it's left showing like a normal camera most the time.  The flash pics are well-balanced and look natural on most all exposures.  The real plus with this camera is the fact that it takes four AA batteries.  This means it has some more amperage to recycle faster - the delay one usually waits to take the next flash picture or regular picture is negligible.  Friends who have tried it say it's the most digital responsive camera they have used.  When I use 4 2700 mAH NiMH Sanyo batteries, I have yet to have to replace the batteries after a full day of shooting.  It's pretty hefty too, a little bigger than the normal pocket camera.  I like the heft, the mass, and so much that this purchase here was for my wife so we have two of these cameras.In short, if you are looking for a responsive fairly reasonably priced digital camera that takes great pics and has very little if any shutter lag between shots, then evaluate this.  I own Sonys, other Canons and a Nikon digital camera and this one has been the best one so far.  Features galore, a choice of movie settings, nice big 2.5\" swiveling LCD display, SD media, USB2 connectivity for fast picture download to your PC.", "Date": "September 27, 2007"}, {"Title": "Great camera", "Author": "NorCal", "ReviewID": "R3V65M5MHOGAY4", "Overall": "5.0", "Content": "I bought this camera in June, 2007 for a month-long trip to South America. I had wanted a higher MP camera to possibly print some 11x14 and higher posters.  In short, I'm thrilled with the purchase.I was expecting this to just eat AA batteries like my old Canon A70. I had even packed a ton of batteries for my trip in anticipation of this. Instead, I was able to take 200-300 pictures on each set of batteries.The 8MP was also plenty and the shots we made into posters turned out great.Finally, the camera also takes great pictures in all modes. I especially feel like the night shots came out much better than my previous A70. The audio on movie mode was also much improved over older models.  The ONLY slight con is that framing a shot with the viewfinder sometimes produces mixed results. I think the actual picture taken tends to be a little bigger than what you see in the viewfinder....for example if you frame a shot to avoid a tourist in the viewfinder, that person may still make an appearance in your photo. In these situations, I just used the LCD screen which seemed to be a more faithful representation of the photo to be taken.", "Date": "August 29, 2007"}, {"Title": "Great Camera", "Author": "F. Farley", "ReviewID": "R3ATE9MNL60339", "Overall": "5.0", "Content": "I am really pleased with my Canon A630. I upgraded from a Canon A70. The interface has improved. The LCD is really good and I love the fact that it folds out for use and folds away to protect it from being scratched. The sharpness and color are great. I really recommend it.", "Date": "August 12, 2007"}, {"Title": "Great Camera", "Author": "Larry A. Neubauer \"elkman\"", "ReviewID": "R29XDANWZTQ3XF", "Overall": "4.0", "Content": "The camera performs as claimed.  I have an older model which is basically the same camera except for the 4x zoom and 8 megapizel.  You cannot go wrong with a Canon.", "Date": "July 26, 2007"}, {"Title": "Easy to use, and great pictures", "Author": "Janet Moursund", "ReviewID": "RIX24TZI8RRX6", "Overall": "4.0", "Content": "I bought this camera just before a trip to Central Asia, and had little time to get used to it before leaving.  But even without knowing how to use all the bells and whistles, it still did a fine job.  The only adjustments I used were varying degrees of zoom, flash on or off, and closeup on or off -- and all these are easy to manage (and to remember).  The camera is compact and easy to hold.  Rechargeable batteries lasted through many, many shots -- I recharged every 2 or 3 days, and never had a problem. Eight megapixels give photos that can be \"taken apart\": pulling out an interesting face or object, and blowing it up as a separate picture.  Also, with this degree of resolution, it's hard to tell where optical zoom leaves off and digital zoom begins.Only two criticisms:  first, the lag time between pushing the shutter button and actually taking the picture (and I think all digitals are plagued by this). Second, it's easy to accidentally twist the dial on the camera top when pulling it out of a bag or case, and it's hard to remember to always check to see that it's set correctly.Overall, though, a very good camera for the price -- I'm well-satisfied.", "Date": "July 4, 2007"}, {"Title": "Excellent Camera!!", "Author": "Toshio Shigematsu \"T-Shigg\"", "ReviewID": "R1YD4ZYW6G6EFE", "Overall": "5.0", "Content": "I bought this camera not to long ago and it is without a doubt the best camera i have bought! I recommend this camera to anybody who loves the world of photography. I have Previously bought about 20 cameras ranging from Nikon, Kodak, Sony and other leading camera companys and they dont live up to what it says, this camera is really EXCELLENT! GOT MY 5 STARS!!", "Date": "July 4, 2007"}, {"Title": "Canon A630", "Author": "Jed Schaiman", "ReviewID": "R2FXMLPX4GVC7A", "Overall": "4.0", "Content": "I like the camera and did a lot of research before buying it.  I didn't realize how handy and convenient  and valuable the pull out rotating screen is. You quickly learn to take advantage of high and low shots. Amazon had the best price especialy if you take into account free shipping and sales tax ;-).I am just a little disappointed in ths storage speed but I can live with it.The camera arrived before the promised data.", "Date": "June 14, 2007"}, {"Title": "Excellent camera", "Author": "Jeanne", "ReviewID": "R1QG9JNYV5SX1C", "Overall": "5.0", "Content": "Takes great pictures.  Most valued features for me are the long battery life relative to number of pictures one can take and the moveable view finder.  It has way more features than i will ever use, but that is true of all the cameras I looked at.  It was a reasonable price and highly rated by Consumer Reports and the salesperson at Best Buy even though I didn't purchase there.  Even though it is not the smallest model, it easily fits in my purse.", "Date": "June 11, 2007"}, {"Title": "Canon PowerShot A630 8MP Digital Camera with 4X Optical Zoom", "Author": "Arthur R. Weisman", "ReviewID": "R53K9BSQEIA33", "Overall": "5.0", "Content": "My old 35mm camera quit. I had not had any experience with a digital camera. I looked at newspaper ads and checked the local stores to see if I could find a camera that would meet my needs. My son advised me to go to Amazon.com. I purchased a Canon PowerShot A630. I am very pleased with it. It is easy to use and does every thing I want in a camera.", "Date": "May 13, 2007"}, {"Title": "Awesome value", "Author": "wagnerite", "ReviewID": "R2NC07M3NFBMJ9", "Overall": "5.0", "Content": "This camera replaces my original A80 4 MP camera.  I loved my old A80 but hoped for a larger LCD.  The A630 brings this along with 8 MP to handle larger prints.  All this for a price lower than when I bought my original A80!The camera is a little bulky and still depends on 4 AA batteries for power.  That is one of the drawbacks/benefits.  Also, taking lots of pictures with the larger (but must-have articulated) LCD will deplete the battery faster, so be prepared for this.  On the upside, I discovered that I was accidentally using the digital zoom on some photos and was astonished at the quality of the images.  Shutter lag compared to my original A80 is also a lot better.For general purpose photography and ease-of-use, you can't go wrong with this camera.  It is not slim but it is very comfortable to hold and operate.  Highly recommended, especially in light of its price and value.", "Date": "May 12, 2007"}, {"Title": "Great!!!", "Author": "shopgirl", "ReviewID": "RMN8O6PAEW2KC", "Overall": "5.0", "Content": "I got this camera over four months ago and I love it!! The quality of the pictures are excellent even up to 16x zoom.  It takes great pictures in any light, the battery life is great.  I have nothing negative to say about this camera.", "Date": "May 11, 2007"}, {"Title": "Purchase of a Canon A630 new digital camera", "Author": "B. Bartlett \"Texas Brad\"", "ReviewID": "R2M0JIOL7SDT2M", "Overall": "5.0", "Content": "Having used a Sony Mavica FD83 digital camera for a long time we recently purchased this new Canon digital camera last month. We are pleased with the camera, written instructions, software, compactness and many, many features. It will probably take us some time to figure out all of the things this camera can do. I really like the automatic setting the camera provides which takes great pictures and I don't have to figure out intricate settings to get a good picture. There are also lots of add-ons we can get and will soon purchase the telephoto equipment and rechargable battery equipment. Meanwhile, we are taking super pictures using standard AA batteries. You will definitely need a bigger SD card because this camera takes some big pictures and will use up the included SD Card real fast.", "Date": "March 28, 2007"}, {"Title": "EXCELLENT CHOICE", "Author": "MAURICIO SALCEDO \"Maucho\"", "ReviewID": "RCO32QA66A0KW", "Overall": "5.0", "Content": "I've bought canon A630 in replacement for my A95 unfortunately lost during last December holydays (thanks God I didn't loose my pictures). Although I've not  have the  opportunity to explore all the possibilities of the camera, I think that people like me, who like to play manual, especially using shutter speed & aperture, will find an outstanding camera for an affordable price. In one word: Excellent!!", "Date": "January 27, 2007"}, {"Title": "Great Value and QUICK shipping", "Author": "Larry Brewer \"Savy Shopper\"", "ReviewID": "R1O94GNJ33ACTM", "Overall": "5.0", "Content": "Thanks as I greatly appreciate the service from Amazon.com and we LOVE the features of the camera (it would have been nice if an external power supply was provided by Cannon). owpers sv", "Date": "January 23, 2007"}, {"Title": "Awesome Manual and Auto Features...GREAT Camera!", "Author": "S. Watson", "ReviewID": "R3NNP9LR4MWHVG", "Overall": "5.0", "Content": "Whether you are a first time buyer or not, this camera is excellent! It is comfortable to hold, and won't slip out of your hand.Pros -Movable LCD which makes self-portraits easy -Good zoom (digital zoom looks bad in LCD, but if image is focused the picture turns out fine) -MANY manual options which are quite fun to play with (eg. shutter speed as slow as 15 sec. which can make a shot at night look like one taken during the afternoon, drive feature which takes about three pictures per second as long as the shutter button is depressed in this mode) -Easy to use Auto functions -Video editing feature on camera when in playback mode -The four batteries last very long -Sensor which detects when you move the camera, allowing LCD to go to a standby mode which will turn back on once camera is moved again (saves battery power) -Many, many other featuresCons -Slow zoom on video mode -Only digital zoom on video mode; low quality video when zoomed in a lot (but good quality when zoomed out all the way) -High quality pictures (actually a pro, but makes emailing pics as attachments limited because of the 8 MegaPixels)This camera has lasted me half a year so far and has done nothing but satisfy me while I've owned it. I would DEFINITELY recommend the Powershot A630 to anyone who wants an awesome camera.", "Date": "November 30, 2007"}, {"Title": "Canon A630 Power Shot digital camera", "Author": "James K. Crosbie III \"Black Cloud\"", "ReviewID": "R16S02JCQ8161C", "Overall": "4.0", "Content": "This product is more user friendly than advertised. Pictures are veryprofessional. I love the cameral!!!! One very minor quirk, memory chipthat comes in new camera only holds 6 - 8 pictures and this is not notedin the english language \"How to operate\" manual. With its new 2GB card itis flawless.  Consumers Reports was conservative in their praise of thisproduct.", "Date": "October 24, 2007"}, {"Title": "Hardware good, manual could be improved", "Author": "Jean M. Gabet", "ReviewID": "R1MF24YO3H2ZSW", "Overall": "4.0", "Content": "I bought this camera to replace a cheapie 2 MP camera. The Canon A630 is a great camera! Lots of features, some of which I am still trying to learn after 3 months. What decided me on this one is the LCD which can be flipped and oriented at will. For one, by rotating the screen 180 degrees I can take photos of ourselves while seeing the photo-to-be. And it is also very useful when taking photos at odd angles, for example at ground level, without having to twist myself into a pretzel. Of course, the manual has been written by an engineer: for example, it states how to do something but never explains why you would want to do it in the first place, and the benefits of doing it. Obviously somebody has assumed that all those features are well known by the user and certainly do not need expounding on. Ergo, a lot of experiments are necessary to figure things out.", "Date": "October 24, 2007"}, {"Title": "Great value,,,but", "Author": "C. T. Darling \"CTD3\"", "ReviewID": "R1KBXOWLU6ZF1Y", "Overall": "4.0", "Content": "Well it is a lot of camera for the bucks and i like it except had I to do over i would have opted for the 10MP (A640) version because with the 10MP you can do remote exposure you cannot with this camera also if in movie mode the camera has an annoying (& very disappointing) high pitched \"camera sound\" which although not screaming loud is audible enough especially on quiet footage that is a shade or two above noticeable .  There are features on this model which sometimes get in the way & are all too easy to set unintentionally, I am speaking of the color selector which is a very cool feature,,  but can be tripped when you do not want or need the feature.  The Picture quality is beyond decent for the price. The integrated software \"Image Browser\" has been tricky for me switching from stills to video clips when uploading. Clips in low light are better than most cameras.The macro functions of the camera especially for movie clips is brilliant and deserve high praise. The swing out screen is an awesome feature for being able to see the screen way below or overhead, it is a well designed feature and often will cause interest from those around you @ events. Although having experienced the Elph series I thought this would be a good choice & overall it's a fairly good camera and an excellent value.overall 8 out of 10 would be my rating.", "Date": "September 30, 2007"}, {"Title": "A Very Easy Camera to Use", "Author": "CARME", "ReviewID": "R345VZUHCI4V0R", "Overall": "5.0", "Content": "I bought this camera in July, 2007. I inserted the batteries that they came with and used the camera during 2 weddings and a vacation, taking over 300 pictures. I was very impressed by that. The pictures are very clear and sharp. I use Shutterfly which says the pictures can print up to 20x30! I haven't had the chance to try other features, I mostly stick to Auto, with and without the flash.  It is truly an easy camera to use!UPDATE--Aug, 2008--I recently just used the video feature on the camera for the first time and it is amazing. The picture is clear and crisp and the sound quality is excellent. I was very pleasantly surprised. I would recommend this camera to anyone. It is always in my purse and I use it often.", "Date": "August 29, 2007"}, {"Title": "AWESOME!", "Author": "T. Gray", "ReviewID": "R1EPIQ0JP318JQ", "Overall": "5.0", "Content": "I absolutely love this camera!  The pictures come out great and there are so many different settings to use that no matter what the scene the pics will come out great.  I have a smaller 6 mp camera that doesn't even come close to producing the quality of pics we get with this.  I would recommend it to almost anyone.", "Date": "August 9, 2007"}, {"Title": "Easy to Use", "Author": "Red Hot Annie \"Red Hot Annie\"", "ReviewID": "R1VEAET7S7QLAX", "Overall": "5.0", "Content": "I think it's a great camera - a cheap point & shoot with very decent images and video.  It's handy and easy to use.  I would recommend it to anyone who just wants something that will take quick pictures.Don't forget a memory card!", "Date": "August 8, 2007"}, {"Title": "I'd recommend this one", "Author": "margaurite", "ReviewID": "R3V3JEJGTF0PPX", "Overall": "4.0", "Content": "I had the A540, I upgraded to this one. The A540 is a great camera, the A630 is the same - except it is slightly larger and has a swivel screen. The swivel screen comes in handy not only for reaching above to take a shot, but also for taking pictures and video of kids that like to watch themselves. The A630 also takes 4 AA batteries.  The video quality is great for a digital camera.  On the \"standard\" setting it is easy to make good movies to put on DVD.", "Date": "July 15, 2007"}, {"Title": "Point and Shoot.....easy as 1, 2, 3", "Author": "Wayside Park \"Micki\"", "ReviewID": "R2EUXKZA1FW7O7", "Overall": "5.0", "Content": "What can i say about this camera that i picked up at Office Depot for some 4th of July picture taking, i was impressed. First off, taking pictures on this thing is a blast because it is so user friendly to use that i did not even bother reading the instruction. The viewer does a fine job showing you the shot before THE SHOT! I even try some video shots and those come up very nice too for such a compact camera and it is so easy to hold your hand onto. I have a Kodak easyshare before and this one is clearly heads over heel a better camera as for as ease of use and high quality pictures. Just point and shoot letting the PowerShot by Canon handle all your picture taking needs.You will be impressed!", "Date": "July 7, 2007"}, {"Title": "WoW!!!  This is the one.......", "Author": "Grumpy", "ReviewID": "RI2WXUX2B6AA0", "Overall": "5.0", "Content": "I love this camera very much.  I just purchased a week ago and took with us to Disneyland.  I didn't get a chance to read the instructions before the trip.  This camera definitely is a user friendly camera.  I am no tech person at all.  It was very easy for me to take pictures with two young kids.I ended up took a lot of pictures without flash and they all turned out great.  Of course, it would be a good idea to know the camera before trip. :-)If you are looking for convenience, this is the one.  I am going to check out the underwate casing and hope to take this camera for scuba diving.Happy Summer!!!!!!!!!!!!", "Date": "July 4, 2007"}, {"Title": "Great Camera", "Author": "Dani McB \"DMC\"", "ReviewID": "R1DEJRQ8RGGVYH", "Overall": "4.0", "Content": "I can't say enough about how great this camera is.  I can't believe the quality of the photos for the price.  The only drawback would be the that is thick compared to many of the streamline cameras available today but the overall quality and available settings are outstanding.  I would highly recommend purchasing this.", "Date": "June 27, 2007"}, {"Title": "This is some camera!", "Author": "Alfonso A. Gonzales \"believer in truth\"", "ReviewID": "R31UGALDM9Q71R", "Overall": "5.0", "Content": "I purchased the Canon A630 May 31, 2007 and to be truthful, I have not tried any of the great features this camera comes with, but as soon as I took this little guy out of the box and placed the batteries in, I loved it.  It is so simple to use!  I haven't even begun to look through the instruction booklets.  The memory card that comes with it is not all that good, but six pictures can be taken and deleted until you get the hang of it.  I tried the low light feature and there is some noise, but then I'm not an expert (Drip under pressure) so for my needs, it's going to just find.  I really recommend this camera to anyone.", "Date": "June 18, 2007"}, {"Title": "great digital camera", "Author": "GarFar \"digital newbie\"", "ReviewID": "R2PPZ5WOFC044K", "Overall": "5.0", "Content": "This is my first digital camera but I was amazed at house easy it was to figure it out without even looking at the manual. So I consider this camera to be quite user friendly and the picture quality is impressive. I would recommend this camera to anyone.", "Date": "June 13, 2007"}, {"Title": "glad I picked this one", "Author": "I. Frias", "ReviewID": "R320QO2GJGN9FP", "Overall": "5.0", "Content": "I am extremely happy with the purchase of my A630! i bought it about 5 months ago after doing tons of research. i didn't have any particular price range but wanted to stay under $400 for my first digital camera. for a while i couldnt decide between this model, the Canon A640 or a similar Nikon model. I decided the A640 was probably too much for me pixel wise, didn't need 10 MP. I thought the A640 was nicer looking than the A630 with it's black finish but all in all not the best value for me. the Nikon model had a stabilizer and the A630 didn't however the A630 made up for it with all the features it has.Again, this is my first digital camera so it has been a little tricky learning how all the features work but it's definitely fun to figure it out. The manuals it comes with are pretty much no help at all (thanks canon!).The battery life is actually better than i thought. It came with a 16MB memory card so i had to upgrade that. i dont have any problem transferring the pictures to my computer.the body is nice and easy to hold for any size hand. I picked a great camera for the money i paid ($257 on amazon) and its fun to use and to experiment with all the features and shooting modes.", "Date": "May 11, 2007"}, {"Title": "Great Camera", "Author": "M. Lonsberry \"Karate grrl\"", "ReviewID": "R3VFYD0L2RWV3A", "Overall": "5.0", "Content": "I am still learning how to use this camera, but overall the pictures I have taken thus far have been excellent. I intentionally bought this camera to challenge me to learn more about digital photography and so far it has been easy to learn. The only bummer was the way too small initial memory card. What a waste of resources and a method to make you part with more cash. But overall, excellent camera.", "Date": "May 9, 2007"}, {"Title": "Superb camera", "Author": "S. Henkel \"subdivisions\"", "ReviewID": "R73UAY54D84SF", "Overall": "5.0", "Content": "I am way more than satisfied with this camera. It is so easy to use and the pictures are perfect.", "Date": "May 8, 2007"}, {"Title": "great camera, great price", "Author": "Sue Autumn", "ReviewID": "R18SQYXS2SJDQ5", "Overall": "5.0", "Content": "I just have the camera a few weeks, but I am extremely happy with its efficiency, clarity and wonderful features. (I did expect it to be a little more compact, but that's really my fault- I should've checked the measurements in advance).One disappointment I had has nothing to do with the camera itself but with the fact that I ordered the canon camera case PSC-65 on this website since it stated that it's compatible with the A630, but I was very upset to find that the case was way too small, and I had to return it. Oh well. But the camera is great!", "Date": "April 25, 2007"}, {"Title": "Great Camera for everyone - Look no further", "Author": "Rcmax \"rcmax\"", "ReviewID": "R4G4NRYDHKZVR", "Overall": "4.0", "Content": "I bought this camera lastweek and also a 1GB Lexar media card. Products arrived in 3 days of placing the order. The camera comes with a basic manual and an advanced one, the latter is intimidating on the first look. Just go with the basic manual initially to familiarize yourself with all the controls and within 1 hour you are ready to shoot your first pictures. The quality of pictures is excellent, in both night mode and Auto mode which you will mostly be using. The zoom is so good that on one of the pics clicked on a really cloudy evening I could read the lience plate of a truck that was about 50 yards away. I must have shot only 20 pics in the last 4 days that I have the camera, mostly test pictures under various conditions and I have no reason to complain.For a semi-pro, there are lot more options that the camera provides to control the shutter speed, aperture, pixellation and many many things which I probably will rarely ( or even never) use.If you have Windows XP, downloading the pictures from the SD card is easy. You don't even need to install the CD that comes with the camera ( I did'nt), just use the \"Microsoft Digital Image Standard 2006\" s/w that comes as part of XP.The menus are quite intutive but there is room for some improvement here. The advanced manual could have been written in a more friendly way not to scare a non-technial mind.", "Date": "March 26, 2007"}, {"Title": "mr.", "Author": "N. Nguyen", "ReviewID": "R1Q23ZKSBBT4J3", "Overall": "4.0", "Content": "i like this camera because it is easy to use. you don't have to be an expert to use it. everything is there for you. just press the button and that's it.", "Date": "January 15, 2007"}, {"Title": "Great multifunction camera", "Author": "D. Newland", "ReviewID": "R1NAECKAY6IT4K", "Overall": "4.0", "Content": "This camera is easy to use with automatic exposure settings as well as manual for loads of creative image creation. The LCD screen either flips out or folds flat against the camera. The point and shoot novice will enjoy this as well as the intermediate to advanced photographer. I highly recommend it.", "Date": "January 15, 2007"}, {"Title": "Very versatile or very simple, your choice", "Author": "the Archangel \"Bring out your dead!\"", "ReviewID": "R2QO6WXZ664QG5", "Overall": "5.0", "Content": "This wonderful camera is like two cameras in one.  You can set it to auto and anyone can use it as a point-and-shoot model capable of some very nice shots.  If you happen to like to use manual settings and apply an artistic eye to your shots, it is very good at this as well.  I have just started trying to take more artistic shots and this camera is very good for this purpose and has many helpful features.  Tons of options, a high resolution, even a widescreen mode, in addition to the \"stitch\" feature (in which you take a series of photos, such as a panorama, and features on the camera along with the included software lets you stitch the photos together into one big photograph), the affordable price, semi-small size, and large number of add-ons and lenses make this a wonderful purchase!It is also nice to have a camera that takes regular AA batteries instead of some kind of proprietary rechargable battery.  If you ever find yourself with dead batteries and no spares, you can find AA batteries in just about every amusement park, city, or country that you may find yourself in.", "Date": "January 11, 2007"}, {"Title": "Pretty Darn Good", "Author": "Amazon Customer", "ReviewID": "R1KV9AQDRQ2M1W", "Overall": "4.0", "Content": "This is probably the best bang for the buck camera out there today.Pros:Fantastic image qualityFeatures offer lots of user controlTight macro mode8 Mega Pixels offers lots of post processing options4X optical zoomGreat battery lifeUses AA batteries (4)Sturdy lightweight constructionSwivel LCD is shweetPrice/performance ratioCons:Poor low light performance (need tripod or flash)ISO 400 and 800 have too much noise to be usable6X optical zoom would be niceJPEG compression No RAWNo battery meter", "Date": "January 10, 2007"}, {"Title": "Excellent camera at this price!", "Author": "Roxme", "ReviewID": "R3LMHQOZUCZ5ZQ", "Overall": "4.0", "Content": "My brother bought the A610 and was so pleased with it, I decided to buy the A630, which was a better value than what he paid for his almost a year ago.  So far, I very happy with its performance but had to take away one star for the weight.  Perhap a half star would be more appropriate, but that wasn't possible.  I doubt I ever use all the bells and whistles this camera features, but the quality of photos and its use-friendly functions are impressive enough to make this a super deal.", "Date": "May 1, 2007"}, {"Title": "Canon A630 Review", "Author": "Oak Ridge, Tn", "ReviewID": "RIBP9NQUICIXO", "Overall": "5.0", "Content": "Both my new Canon A630 and older Canon A80 are satisfactory in all respects. The automatic  feature on both is flawless when the simple press half way/hold/compose/shoot directions are followed. The lens quality on both is outstanding. The reason I bought the A630 was to increase the  pixels from 4 (A80) to 8 (a530). It turned out to be be helpful only with enlargements exceeding 8 X 10 inches. All smaller were perfect with the A80. The most significant advantage of both cameras is the ability to shoot over the heads of people in front of you. The snap out swiveling viewing screen allows you to hold the camera high over your head, look up, and still perfectly see the scene you are shooting", "Date": "April 11, 2007"}, {"Title": "easy to use, built to last", "Author": "smw", "ReviewID": "RPWNUIFKB1DA2", "Overall": "5.0", "Content": "Perfect camera for eveyday use.  simple and the price is right  I have owned this camera for a while and still works great", "Date": "November 19, 2013"}, {"Title": "One of Best Cameras Ever", "Author": "Gray Horse", "ReviewID": "R1D9S93GH3H04P", "Overall": "5.0", "Content": "Don't know why this one isn't in production now, it's about my favorite camera.  The swing display screen is especially handy, when taking photos by holding the camera up above crowds, or to check what is in the photo for the self timer.  Has an optical viewfinder, too, an increasingly rarity among digital cameras now, that is essential if you're taking photos out in bright sunshine, at the beach, or where ever.Takes great photos, too, easy to use, has lots of options, and doesn't eat up AA batteries.Glad I got another one when I damaged my first one (my fault, not the camera's).", "Date": "August 25, 2013"}, {"Title": "Good and reliable camera", "Author": "Life_is_a_Choice", "ReviewID": "R17W7J6HFQQATU", "Overall": "4.0", "Content": "I have used this camera for few years up until now. It still works fine. The pictures are great. Although it's a little bulky compared to other new cameras, this is still my favorite camera to use whenever I go for a trip or hiking.", "Date": "August 6, 2013"}, {"Title": "LOVE IT!!!", "Author": "TRISH CLARK", "ReviewID": "R18K2I54P7S735", "Overall": "5.0", "Content": "bought this camera in 06 did not pay 700 some dollars for it, cant understand why it is so much on here. it was like 249.00. just this week the flash is out of sync and pictures are to dark. I would buy this camera again!!but not for 700!!", "Date": "December 8, 2010"}, {"Title": "Canon PowerShot A630", "Author": "G. Ray", "ReviewID": "RIAHOT00K8WB5", "Overall": "4.0", "Content": "I previously had purchased the Canon PowerShot A610 and was so satisfied with the convenience of use and quality of the picture that I decided to look for another one as a backup for my point-and-shot activities.  I was pleased to find out that I could still purchase a camera from the series even though it is no longer currently on the market.  I was fortunate to find a new one on Amazon and quickly grabbed it up.  I opted for the A630 which has 8 MP and a 3\" articulated screen vs. the 5 MP and 2.5\" screen on my old A610.  I am very pleased with my purchase and the A630 has met my expectations for a reliable and quality point-and-shot camera.  I use it on my hiking trips all the time to capture the moment.  It's one of the few cameras that offer an articulated viewer - a feature that I use all the time.", "Date": "June 14, 2009"}, {"Title": "Great Camera for Travel and Casual Portaites", "Author": "Amazon Customer \"Caravaneer\"", "ReviewID": "R2B689MXQHV0QZ", "Overall": "5.0", "Content": "I've used this camera for ~2.5 years over much of the US and Asia and taken over 5,000 photo's. I and have been very pleased with its performance.I am a serious amateur photographer and story teller who relies on images for Power Points, newsletters, and photos to display. This camera has been wonderful and reliable. I average about 500 pictures with one set of four AA batteries. The tilt viewing screen makes this camera perfect for 'discrete' photo's in markets, for casual portraits where people play and work, of architecture, and even of self portraits. In markets and on streets I often find myself tilting the screen and shooting from waist level. I also sometimes find that I can hold it over my head, and the heads of others, see and capture the image again by the tilt of the screen.This camera is a little larger than I would prefer. It does not easily go into a jacket pocket. I find that I most often carry it in a 'messenger bag' or on my belt under a jacket, sometimes in a jacket pocket. But to be so feature rich, it is worth this extra bulk to me. If I did not want the option of manual controls and the other features I would go for a smaller camera and enjoy the smaller size.When this camera is replaced I will look for another Canon, I will buy it from Amazon, look for a swivel screen, AA battery powered, and the newer stabilization technology.", "Date": "March 25, 2009"}, {"Title": "Great camera except for flash problems", "Author": "GS \"handyatmusic\"", "ReviewID": "RTEUH5T7S8PLC", "Overall": "3.0", "Content": "We have owned this camera for just under two years.  It has lots of powerful features that we've enjoyed using, especially things like timed exposures.  We have taken a lot of great pictures with it.  However, recently the flash has intermittently stopped working.  When trying to take a picture, the symbol for the flash would blink on and off on the screen, and it refused to take the picture unless we turned the flash off.  The manual says nothing about what the blinking flash symbol means.  At present, the flash works sometimes, but it is no longer synchronized with the shutter.  Is this an electronic problem rather than a mechanical problem?  Anyway, it sets the shutter speed, etc., based on the presence of the flash, but the flash is early - \"flash . . click\".  So no pictures come out right.  Time to get another camera.", "Date": "July 27, 2008"}, {"Title": "great little camera", "Author": "S. Sookhoo", "ReviewID": "R6ZUUOS5VEAHQ", "Overall": "5.0", "Content": "Arrived ahead of schedule and in great condition. This little camera takes unbelievable pictures and is quite easy to operate", "Date": "May 19, 2008"}, {"Title": "Great camera!", "Author": "Amazon Customer", "ReviewID": "R32JEMZP1T0GMF", "Overall": "4.0", "Content": "I like these camera a lot.  It cost us less than $200 in circuit city and it has been great.  We took amazing pictures for our wedding and travels and we are very pleased with it.  It's easy to use although a little bulky.", "Date": "March 18, 2008"}, {"Title": "canon powershot A630", "Author": "J. Simons", "ReviewID": "RF9D3VOUOZOCL", "Overall": "3.0", "Content": "I have been very pleased with the pictures I've taken with this camera as far as outdoor still-life (flowers, ...). However, in low-light, it is very difficult to get a good shot. With flash, the color is off, with no flash, it is extremely blurry every time. But, takes pretty decent video and seems to hold battery charge pretty well.", "Date": "March 10, 2008"}, {"Title": "LOVE this camera!", "Author": "gadget girl", "ReviewID": "R2GO303UU0EU6M", "Overall": "5.0", "Content": "I can't really say enough about this camera.  Although not a professional by any means, I do know my way around a camera, and other than fancy lenses there's not much more you could possibly need or want.  My favorite functions are the Macro setting and the Aperture-priority.  I like that shallow depth-of-field look with the background all fuzzed out, and this camera has a minimum aperture of 2.8, which is wonderful for achieving that look.  The camera is also small and easy to carry around in a purse.  Also?  I LOVE that it takes regular AA batteries.  I bought some rechargables and they last forever.  I take photos almost every day and I only have to charge my batteries once every few months.Seriously great camera and easy to use.  It's probably more camera than a beginner would want (or someone completely not interested in photography), but if you're looking for a really nice camera and don't have the money for a DSLR this is a GREAT camera for you.", "Date": "March 4, 2008"}, {"Title": "Great camera - horrible software!", "Author": "Amazon Customer", "ReviewID": "R36QWH5VH496MH", "Overall": "4.0", "Content": "I received the A630 for Christmas, and initially I loved the camera.  It is very intuitive, takes great photos, and the battery life seems to be fantastic.  However, my first experience with the Canon software included left much to be desired.  First off, the software suite is huge - over 300Meg for the complete installation.  The software itself seems to be very well written and intuitive, but it has some severe limitations.  First off, you simply cannot access the memory card in the camera like a computer hard drive, something that every digital camera I've owned has let me do.  (Kodak, Nikon, Minolta, heck - even the no-name digital binoculars let me mount as a hard drive).  There doesn't seem to be any way to just mount the card as a drive.  So, stuck with using the software to extract photos from the camera, I came headlong into another severe limitation - the software does not recognize any hard drives on your PC that are network drives.  I have all my digital photos on a server, and I would be satisfied to simply use the software to transfer the photos, but not being able to see any network drives puts another step in the process - copying them to the local hard drive and then using windows file manager to copy to the network drive.  Canon support basically told me \"the software does not support network drives\" without offering any other suggestions.  I guess I'll have to fall back to buying a card reader (I have to get a new one that supports SDHD) and transferring photos that way.  I'm giving it four stars because the benefits of the camera being so good outweighs the software problems.", "Date": "January 27, 2008"}, {"Title": "Great Photos, a little bulky", "Author": "Avory H.", "ReviewID": "R2FQBGU6LBDT4Z", "Overall": "4.0", "Content": "I bought my A630 about 4 months ago. Before I had a Kodak Easy Share 4.0 mpx, and I figured it was time for an upgrade, because I was going to study abroad in Germany for the semester and I naturally wanted really good photographs.It's a month before I come home and overall I have to say that I love the pictures this camera has produced. I'm not a photographer, but I am really picky about photo quality, and this camera doesn't disappoint. It has a setting for virtually everything you could want. Sometimes the setting for the situation wouldn't work as well as other settings (for taking a picture of a statue at night, I got the best picture with the indoor setting without flash instead of the night setting. Who would have guessed?) Also, sometimes my pictures would be blurry or have a lot of noise in the pictures with indoor settings. The blurry-ness could get annoying sometimes when I just wanted to take a great picture, but I would just apply the high ISO or change settings and it would be fine. While traveling, the biggest problem I've run into with this camera has been the size. I knew it was big when I bought it, and it was a sacrifice I was willing to take. But I think it's worth mentioning: This is no pocket camera.My favorite thing about this camera is all of the customization features for pictures before you take it. I also find it really easy to use these features, which is nice for click-and-go situations. My personal favorites are the color exclusion and foliage setting. They make outdoor pictures look really natural (even with people in them). Also, the rotating screen has come in handy, not just for self/group portraits (because it's awkward to ask a passerby in another language to take your picture) but for awkward shots too. Instead of bending over to get a good angle, I can just rotate the screen and see what kind of a shot I'm going to get. Along the same lines, I've gotten good videos out of my A630 as well. You can tell exactly what the talking moose is saying in a crowded market!I also found it useful to use rechargeable batteries because the camera does hold 4 of them (they last for quite a long time!) and it's just cheaper in the long run if you rely heavily on your camera day in and day out.Overall, through my experience, I would recommend this camera to anyone who travels and wants unforgettable pictures and is willing to settle for a bulky camera. I can honestly say that this camera has brought out the mini-photographer in me, because now I try every setting and angle to make stuff look cool!", "Date": "December 1, 2007"}, {"Title": "Awesome!", "Author": "B. White", "ReviewID": "RK5ZISVKBR2MK", "Overall": "5.0", "Content": "I was wondering which camera I wanted to receive for my birthday last September, and I decided on this camera because it was cheaper than most and 8mp.  I fell in love with it.My only complaint is that there should be some type of Sport mode, because there were some very blurry shots.  I took almost all of my pictures on a moving band bus, it takes awhile to find the right mode to use... but I had a lot of memories and if I had my previous camera the pictures would have been very bad and almost every picture I have taken with this camera has been in high quality.I love the fact that you can move the LCD screen around, all of my friends were amazed with it, and when you are in review you can rotate the picture.  I thought it is cool that you can buy an underwater case with it too.Also, I highly recommend buying a 2GB+ memory card so you don't have to constantly change the memory card.  And rechargeable batteries, it takes 4AAs and over time you will probably pay more for batteries than the camera itself.  The Canon recharageables (not sure what they are called) lasted me an 8-hour bus ride from Virginia to New Jersey there and back, trust me, they are worth the money.I love photography and anyone looking for an almost professional camera at a fair price should look into buying this camera.", "Date": "November 17, 2007"}, {"Title": "Fantastic Camera", "Author": "MS \"MS\"", "ReviewID": "RY4EFX2KRRCY8", "Overall": "5.0", "Content": "Purchased after researching for over three months based on positive reviews and price. Great camera for the price. Very easy to use, although still haven't even attempted half of the features. We like the camera so much that other family members have purchased it, too. Recommend using rechargable batteries and a larger memory card.", "Date": "October 28, 2007"}, {"Title": "AWESOME", "Author": "ms.michelle", "ReviewID": "R1DPI8M24T1USA", "Overall": "4.0", "Content": "i love this camera although its a little big, it takes great pictures! i got reccommended from a co worker and it really is all that he said. you can take pics from any angle and see it with the screen!!at night if you cant see with the screen you can lighten it up or look through the eye.", "Date": "October 1, 2007"}, {"Title": "It is reallyworthwhile the mony", "Author": "Tsung", "ReviewID": "R22665VRXHCMKT", "Overall": "5.0", "Content": "Although it looks so-so (cheap plastic), but the image quality is really worthwhile to have it. Especially with the price less than $200 and with the 2.5 inch LCD screen that can be twisted at different angle. I love the AA battery model, that you can always have batteries handy.", "Date": "September 24, 2007"}, {"Title": "Canon A630 Camera", "Author": "L. NEFF", "ReviewID": "R2OI4UWBARHB3P", "Overall": "5.0", "Content": "I am very pleased with the camera. I really like the adjustable flip out display.When people are in front of me, I can turn the display down and hold the camera over everyones head and still see what I'm trying to photograph. Excellent Camera. I received it within the quoted delivery time.I also could not find it at a lower price then at Amazon.", "Date": "September 18, 2007"}, {"Title": "Good for the money you pay!!!!", "Author": "Jitendra Pawar \"JP\"", "ReviewID": "R3FDYWC66MO3WI", "Overall": "4.0", "Content": "Nice camera but I dont know if I am not using all the features coz the pic quality in low light is very noisy and at times very hazy.....This camera needs Image stabilization...BIG TIME...Rest looks OK and acceptable at the price You pay to get one!!!!!!!!!!", "Date": "September 16, 2007"}, {"Title": "satisfied customer", "Author": "George R. Huntington \"slackdog\"", "ReviewID": "RXKXE7IPTP9IA", "Overall": "5.0", "Content": "So far I really like my Canon Camera.........have no complaints so far......I'm not an expert camera user..so probably won't be able to comment on some of the Camera's abilities.......but would recommend camera to most people........", "Date": "September 15, 2007"}, {"Title": "Canon PowerShot A630", "Author": "M. Money", "ReviewID": "R2GG8CD9RVM7AT", "Overall": "5.0", "Content": "I upgraded to the Canon PowerShot A630 from a Canon PowerShot 520A Digital Camera recently, and have found that I am able to get better definition with it. I like the way the LCD Monitor works, particularly.  The instructions are very clear for using the camera.", "Date": "September 13, 2007"}, {"Title": "Canon PowerShot A630", "Author": "ESGMN \"ESGMN\"", "ReviewID": "R2EYYQBB3FOEOA", "Overall": "5.0", "Content": "This is a great product.  I am very pleased with it and am enjoying using it.  I would recommend it to anyone.  Two of my friends have the identical camera, but paid more for it in a retail store.  It's a great camera at a great price!", "Date": "September 12, 2007"}, {"Title": "Digital Camera for daughter", "Author": "Adryna R. Jacobsen", "ReviewID": "RQ4S11CL3RAQT", "Overall": "5.0", "Content": "I bought this camera for my daughter for her birthday.  She loves it. I bought myself a Sony digital over a year ago and it is amazing the difference in technology in that short a time. I almost kept the Canon and gave her my Sony, but I didn't. I was impressed with the quality and the speed of taking pictures and pleased that the prices have come down since I purchased mine. Great Buy.", "Date": "September 10, 2007"}, {"Title": "Great Buy!!!!!!", "Author": "ARK", "ReviewID": "RF3LU96B05QS4", "Overall": "5.0", "Content": "This is my first Canon and I love it.Wonderful pictures easy to understand. Great for taking picture with children.Love that you can adjust the camera to night, snow, firework, so easy.Batteries have lasted, love that.Only thing I don't like is the strap is for your wrist.", "Date": "September 8, 2007"}, {"Title": "Great Camera! (Eh, not so much - READ UPDATE)", "Author": "Angela Blair", "ReviewID": "R1G82RHPQUBWVG", "Overall": "3.0", "Content": "I bought this camera for a weekend trip to NYC. It was just what I wanted. The photos are ridiculously crisp. I'm a casual photo taker and have had no problems. I hope to learn the fun tricks with this one. No complaints. I have yet to change the batteries and have used it every day for almost a month.I purchased an additional 2gig SD card for the camera and it has plenty of room for my day-t-day activities. Overall, this camera is a 5 of 5. [I browsed the comments on the additional one and two-year warranty and decided against it, make sure you read the reviews on that warranty before buying it.]********************************Update (years later): My camera started acting up the day after the main warranty expired. There was something wrong with the flash not working - if you had it set to be on the photo wouldn't take at all. After browsing message boards I found that many people with this model had the same problem and smacking it against something hard right near the battery compartment made it fix itself until you turn it off. Their warranties didn't cover the problem, though. BOO! HISS!", "Date": "September 4, 2007"}, {"Title": "Not as fast as I would like but good...", "Author": "Reader #1 \"Customer\"", "ReviewID": "R3MRJ91DWHSOET", "Overall": "5.0", "Content": "Much faster than similar cameras made 3 years ago... but still was hoping for faster shots.  Perhaps I am doing something wrong, but it takes a second to capture a photo. Otherwise, very happy.  I love the way the view screen flips around (and ends up right-side-up!) so my baby sees himself when I take his photo (I see him through the window)... Moms know: nothing's more exciting than your baby seeing himself (or the \"other\" baby).", "Date": "August 23, 2007"}, {"Title": "I love this camera!!", "Author": "patdra \"patdra\"", "ReviewID": "RX21R9AZOH3SF", "Overall": "5.0", "Content": "This is my favorite camera....what holds it above all the others is the moveable LCD screen.  I bought a 2GB SD card for it and at the best settings it holds up to 567 photos and the video perfect!", "Date": "July 9, 2007"}, {"Title": "Great Camera", "Author": "Veena Srinivasan \"Veena\"", "ReviewID": "R1TXD0CV0EIT7C", "Overall": "5.0", "Content": "I bought this camera for my sister and had a chance to see it while she stayed with me. It is an great camera for beginners.Good resolution, easy use. We especially loved the fact that it has a cable to the TV and we could watch the sightseeing pictures with the whole family.You'll have to buy a memory card though because the one which comes with the camera isn't enough.", "Date": "June 26, 2007"}, {"Title": "Love the Canon PowerShot A630 8MP", "Author": "Tracey K. Doubrava", "ReviewID": "RZI5YL96JHX3Q", "Overall": "5.0", "Content": "Great camera.  Were looking for a lighter, easy to bring along alternative to our Canon EOS.  This is ideal.  Great pictures and does everything we could want.", "Date": "June 13, 2007"}, {"Title": "Canon PowerShot A630 8MP Digital Camera", "Author": "Dean M. Briggs", "ReviewID": "R3FNQ5ZGU69XBC", "Overall": "5.0", "Content": "Wonderful camera. This was a replacement for my 3.0M pixel Fuji camera. No complaints. Have taken over 200 pictures at various settings with perfect results. Would recommend this camera to anyone!Dean", "Date": "June 13, 2007"}, {"Title": "Canon Powershot A630", "Author": "Kari L. Devol", "ReviewID": "R2J0JO7NS4KNYA", "Overall": "5.0", "Content": "We have been very happy with the camera.  If you are looking for a good camera this one is.", "Date": "June 7, 2007"}, {"Title": "A630 was a breeze to use", "Author": "S. D. Porcello \"Sal P\"", "ReviewID": "R1U268A0Z11034", "Overall": "5.0", "Content": "My new A630 was great to use. The tilt view screen came in  handy when I held my camera above the crowd to get a picture of  Pope Benedict at the public audience in Vatican city on my vacation. Camera was ease to use. Pictures came out great.", "Date": "June 4, 2007"}, {"Title": "Easy to use", "Author": "Alex Victor", "ReviewID": "R1HW493YAPZ2IL", "Overall": "5.0", "Content": "I used to have a Canon Powershot A95 camera, which finally broke down after 2.5 years of use. It was an amazing long life, if one considers how many times it fell (I dropped it on) on hard surfaces. Canon A630 is a much more updated version of A95. It offers larger pictures (8MB instead of 5MB) and a larger display window. What I like about it (and what I liked about A95, too) is that it is light, easy to carry, easy to use and it offers good quality pictures.", "Date": "May 13, 2007"}, {"Title": "Canon; Very dependable for casual to professional photographers", "Author": "Darren W. Wilcox", "ReviewID": "R1PZCI0XFCMLJZ", "Overall": "4.0", "Content": "I really have enjoyed this camera because of all the settings that it has. It has all the basic settings a casual photographer needs for every-day pictures, but also includes color-swapping and a great macro setting that are great for people more into taking photos as a hobby. It even suits the professional because you can buy and add other lenses for the camera to make the pictures you take more beautiful.", "Date": "May 12, 2007"}, {"Title": "Canon Camara works amazingly.", "Author": "Wen-d Kersten \"Wenmik\"", "ReviewID": "R3J0P4RXBR33GR", "Overall": "5.0", "Content": "I love the camara. It works really well.My only issue, is that the battery wears out quickly. Other than that, everything's great.", "Date": "March 10, 2007"}, {"Title": "Canon PowerShot A630 8MP Digital Camera", "Author": "Tosha Marie", "ReviewID": "R2ZKYNJN14YVIE", "Overall": "4.0", "Content": "I really like the camera but find some of the buttons to be awkwardly placed in that I either hit them while trying to find others or I cannot hold two buttons at the same time such as when trying to take wide angle shots.", "Date": "March 8, 2007"}, {"Title": "Excellent Pocket Camera", "Author": "D. E. Hollatz", "ReviewID": "R1SMKA3F20KUHF", "Overall": "5.0", "Content": "I bought this camera to use in conjuction with my Nikon SLR. It is small enough to be convenient to carry, yet takes very good pictures. The interface makes it relatively easy to use. The LCD is reasonably large and makes framing your shot pretty simple. The picture quality has been great. I'd highly reommend the camera.", "Date": "March 8, 2007"}, {"Title": "Good product! Good service!", "Author": null, "ReviewID": "R3VU3GUB5PJYPQ", "Overall": "5.0", "Content": "I hoped to get the product ordered in the website amazon on time, in fact, I got it earlier. Good product, good service, which are so important, I am going to order other products from this website.", "Date": "January 23, 2007"}, {"Title": "Great camera/great service", "Author": "Down To Earth", "ReviewID": "R30UX1Z6TI4A6X", "Overall": "5.0", "Content": "I knew i was buying a good camera but the features blow me away.It is definitely a great buy and the service from Amazon is always outstanding, it arrived faster than expect, and in the middle of the XMAS season. I had options to buy it cheaper in other sites but I decided to stay with AMAZON.", "Date": "January 22, 2007"}, {"Title": "Boy, am I not sorry", "Author": "Long-time Christian reader \"Jane\"", "ReviewID": "R2B6JXNS2C4AL2", "Overall": "5.0", "Content": "I love this camera.  I was switching over from a 35 mm, which I've had for 20 years, and used Consumer Report as a guide.  There are a lot of little picture-icons on the readout screen on the back of the camera, which take some memorizing to get straight, but at the same time, you can do as much or as little \"fancy\" as you like, and still get pictures that look really good.  This is a camera to grow with.  I am very happy with it and would recommend it to anyone.", "Date": "January 15, 2007"}, {"Title": "Nice Camera - Bad Luck", "Author": "Renato R. Souza", "ReviewID": "RF9C2E68RDS4Q", "Overall": "5.0", "Content": "The Canon Power Shot A630 is a fantastic camera. Easy to use, and excelent shotss are not difficult to get. I had, however, a bad luck with the new feature (the turnable LCD display). It was open while the camera felt down, and it was broken in miliseconds! So be careful while handling it... :-)", "Date": "January 15, 2007"}, {"Title": "Great camera.", "Author": "Erik N. Oppermann \"Firefighter112\"", "ReviewID": "R1B0XLB445XEBJ", "Overall": "5.0", "Content": "I'm just starting out with a \"real digital camera\". This is a perfect camera for learning photography. Or for a quick point and shoot. My mother is a photographer and a friend of mine is too and they both like it alot with all of the features it has. I'm learning alot on this camera and it's been fun! The first A630 had a problem when I recieved it, the flash wouldn't work and the Canon tech support was a big help, and they were suprised that it was defective (very rare) they told me. No problem with exchange from where I got it. Battery life is excellent with plain old alkaline, but get rechargeables. Video mode is very nice and I love hooking it up to my TV. Macro shooting is the best as well as night shooting. I've made some crazy light trail shots of moving cars at night. Can't wait to try it during the Fourth of July fireworks! The LCD screen is great and the view finder is nice too, actual it zoom in as well. Like I said it is the best camera for learning on, it will show you if you make an error before you shoot. It also has a quick startup, and you have alot of custom features on it. The software it comes with is easy to use. I'm a firefighter and I can't wait to try it on a call or training. Awesome camera....get one!!", "Date": "January 13, 2007"}, {"Title": "cannon power shot", "Author": "Hiedi Roberts", "ReviewID": "R3V4WH69MFRNJ4", "Overall": "5.0", "Content": "Great, easy to use lots of fun dose all kinds of stuff you will love it I do", "Date": "January 11, 2007"}, {"Title": "Canon A630 hits a homerun!", "Author": "Larry Kanzer \"the-locksmith\"", "ReviewID": "R3VADUOAAAR89V", "Overall": "5.0", "Content": "After considerable research, I chose to replace my Olympus D-520 with the Canon A 630.  The primary reason was to be able to take pictures of coins for E-Bay sale, and this camera fit the bill to the T.  True, it took some experimenting to figure out the right settings to do this, but once I had it figured out, the pictures were precise and detailed, and just what I was looking for.  This camera has so many settings and possibilities that I am now looking for opportunities to utilize it to its fullest potential.  If you are just looking for a point and shoot, just set it and forget it, and shoot away.  If you are a pro, this should answer all your needs.  I am a happy camper.......", "Date": "January 11, 2007"}, {"Title": "Powershot A630 - Big bang for the buck", "Author": "Julie \"Julie\"", "ReviewID": "R2JNF1ON2FSKTM", "Overall": "5.0", "Content": "Gotta love it - easy to use, simple instructions make even the most complicated setting a breeze.  Love the pivoting viewer - makes lining up the group shot easier and never a worry about scratching or cracking it.  Wish it was smaller but then again the size is due to the batteries (AA) which last surprising long and for the forgetful charging impaired you are never too far from somplace that sells them.  Videos are amazing - clear video and audio - sorry I didn't buy it sooner", "Date": "January 10, 2007"}, {"Title": "Solid All Purpose Camera", "Author": "Tag", "ReviewID": "RE057CVY0ZRUL", "Overall": "5.0", "Content": "Canon's product quality and customer service led me to buy the camera and it has not disappointed.  It has all the picture quality and features I could need for everyday use.  I find I use the video feature of the camera as much as taking still pictures.  It's easy to bounce back and forth and the camera lets you easily adjust resolution for e-mailing video clips and pictures to friends and family.", "Date": "January 9, 2007"}, {"Title": "Excellent camera", "Author": "D. Alva", "ReviewID": "RLKXSCEU430QI", "Overall": "5.0", "Content": "This 8mp camera works fantastic, the quality pictures are incredible and its many features let me do what i couldnt do with a previous 5mp kodak camera i had before. First the screen size is perfect, very bright and clear, the mobility of the screen helps on keeping the surface of the screen protected when not in use. it takes only 1 sec to start taking pictures after it is turned on. while in video camera mode you can zoom in/out, video quality excellent. i still haven't used the other many features but so far is doing so good.What i don't like but it's not a big deal is the amount of batteries it uses (4AA) but it compensates with the lenght of battery life.", "Date": "January 7, 2007"}, {"Title": "Good one", "Author": "Giridhar Kumar", "ReviewID": "R3JFP62GI1B4Z3", "Overall": "4.0", "Content": "This camera is my second digital camera. My first one was Canon A530.I see two drawbacks with this camera. Not good for night scenes and it requires 4 batteries. The battery lid handling looks slightly clumsy. While opening or closing, i have a strange feeling that it would brake. However you wont be using that part of the camera often. Apart from all that, the quality is simply superb. There are 5 levels of resolution. Average resolution is more than enough. So imagine how good the max resolution would be.This camera is a good option for any non professional.", "Date": "July 15, 2007"}, {"Title": "Good camera", "Author": "J. Chen", "ReviewID": "R23M8F9MR3ECFC", "Overall": "4.0", "Content": "I like it especially the display which can rotate.  Very good for someone like me who travel alone.", "Date": "June 9, 2007"}, {"Title": "AMAZING!!!", "Author": "Kelley A. Veytia \"Kelley\"", "ReviewID": "R2YN9DJR5O1W3H", "Overall": "5.0", "Content": "I absolutely love this camera. I bought it after having an HP for about a year or so before it was stolen. This Canon replaced that, and I am kind of glad the HP was stolen. hehehe This Canon has amazing features, so if I want to do creative photography, I can... and if I want to do snapshot shooting, that is easy as well. I got this camera about 2-3 weeks ago, and I'm still getting used to all of the features, but I am not complaining. Also, I've used the camera almost everyday since then, and the factory batteries are just dying now. Not too shabby, eh? :-D", "Date": "June 7, 2007"}, {"Title": "Comparing to Sony Cybershot", "Author": "J. B. Hawse", "ReviewID": "R3IDKEOETLUW95", "Overall": "4.0", "Content": "From what I have learned so far from using the camera, I really like the Canon.  I previously owned a Sony Cybershop and loved it. I based my choice of a Canon this time on the great review in Consumer Report.  I have been very happy with the pictures, but thus far I still take better pictures with my Sony.  I am assuming this is because of my inexperience with the Canon at this point.  It has the characteristics I need, is less complicated than my Sony and I am looking forward to taking some great pictures with it.Canon PowerShot A630 8MP Digital Camera with 4x Optical Zoom", "Date": "March 27, 2007"}, {"Title": "A great camera! -edited: problems!", "Author": "J. Vogel", "ReviewID": "R151MN4CIIHUES", "Overall": "1.0", "Content": "I have been quite pleased with the A630.  It takes really clear pictures with vivid color.  The camera is packed with features...more than I've been able to learn in the few months I've had it.  I am quite happy with the battery life too.  In all, I have no complaints with this camera.  Overall, a good buy.January 2013 edits: for the last 2 years, I have had significant problems with the flash.  It refuses to work, despite \"forcing\" it through settings. There are also times when the camera refuses to take a picture.  The batteries are also dying within VERY soon after using them.  When you're at an event and have only one camera and it refuses to work, the memories are lost forever.  I have stopped using this camera due to its unreliability.", "Date": "January 25, 2007"}, {"Title": "What is wrong with movies?", "Author": "R. Lefever", "ReviewID": "R2L7MP7MXGAEZQ", "Overall": "3.0", "Content": "Has anyone else had this problem?.....I have an A620 and just got the A630.  When taking movies with the new A630, there are a lot more rolling lines and \"screen\" effect than is with the A620, especially in the edges of objects.This is in the 640 x 480 mode at 30 fps. (most popular shooting mode)The movie quality should be at least as good in the A630 as it was in the A620, rather than objects looking like they are moving around and \"rolling\" the peppermint twist. Otherwise, I would have given this camera 5 stars. This is a lot less of a problem in my A620.", "Date": "January 20, 2007"}, {"Title": "great camera for the price", "Author": "A. Alonso \"anival\"", "ReviewID": "RMNNFQ5W6ZKKH", "Overall": "5.0", "Content": "pros: great picture quality, good battery life, accessories come cheap, and good variety of features and options.cons: pictures go grainy with noise at high iso settings, lack of picture stabilizer.great for beginners and those who want a great camera without paying the big bucks for the xlr cameras.", "Date": "May 26, 2007"}, {"Title": "Digital camera veteren friends are jealous", "Author": "D. Wade \"Inspector NoClue\"", "ReviewID": "R1EXZXD7SDFRHT", "Overall": "5.0", "Content": "We chose the Canon A630 because it (and it's sister camera, the A620) received rave reviews via several web sites and Consumer Reports. I've only had this camera a few weeks but we really like it.  This is our first digital camera, so we don't have much to compare it to.  But we've had two separate occassions where people who have used digital cameras for a while pick ours up to play with it, and say how much they like it.The viewfinder is very nice, the zoom surprisenly good, the video and sound quality also better than I would have thought (and I own a video business).  Do consider that the card that comes with it held five photos at most, but we found a 2 gig card at a warehouse club for less than $30.  The flash doesn't always go off, but it appears that the photos without flash didn't need the flash.  Very simple to use.  A friend also likes the hand grip.It's not light and wouldn't fit in your pocket, but we found that it easily fit into a standard camera case that fits on a belt.  Very easy to transfer to the computer. Again, it's only been used a few times, so we have not played with photo quality or printing photos, but so far I would definately recommend the A630 for the money.", "Date": "April 16, 2007"}, {"Title": "An average camera", "Author": "mabinmaui", "ReviewID": "R2KG20KUPN5S1M", "Overall": "3.0", "Content": "I had this camera for several months, and the results are mixed.  Sometimes I am very pleased with the photos, but other times they come out very blury, especially under low lighting.  Sure, a tripod helps and many of the manual controls help, but I am mostly interested in taking pics of my kids, which requires a camera to snap descent pics w/o all the hassle.  In the end I decided on a higher-end camera with optical stabilization --- Canon S3 and have been very satisfied with it.  All the research in the world can still lead you to the wrong camera... in the end what matters is a retailer with a generous return policy.", "Date": "January 20, 2007"}, {"Title": "This camera will not run with rechargable batteries!", "Author": "Jack Buffington", "ReviewID": "R1LFCAFU9X0EQR", "Overall": "3.0", "Content": "I just bought this camera and was extremely dissappointed to find out that it will only run using alkaline batteries.  Fully charged NIMH batteries will cause it to start extending the lens and then shut down with it half way out.  This is completely unacceptable.  Because of its high 'dead' battery voltage, you aren't able to fully use alkalines either.  They are still quite useable in other things when this camera says they are dead.  Besides this problem though, this camera has a lot of nice features.  I am happy with everything else.  Just the same, I wouldn't have bought this camera if I had realized how bad its power problems are.", "Date": "February 7, 2007"}, {"Title": "Nice camera, but delays", "Author": "DST", "ReviewID": "R2UMIH5BHOC0SA", "Overall": "3.0", "Content": "It's a good camera, but getting used to the delay (vs. a traditional 35 mm SLR) is still bugging me a month into owning it. I'm sure I can mess with the settings somehow to shorten that, but so far I haven't figured it out. I also get red-eye in my subjects even with red-eye reduction on, unless they look directly into the lens. Both of these things take away some of the spontaneity in picture taking. I would have liked a wider lens and image stabilization, and looked at the Canon SD800, but it wasn't available on amazon when I ordered this one. But since I love the A630's grip and feel (especially the knob at the top with very facile thumb-friendly mode dial), what I lost in wide angle to \"hand happiness\" is really a toss-up, and I was a little afraid I'd drop the smaller SD800. The LCD & control interfaces are okay, but I wish more of the modes and icons were more intuitive. The screen is bright and clear, especially appreciated when zooming in on playback. Downloading to a Mac is easy as pie and I like Canon's ImageBrowser that came with the A630 much better than iPhoto.", "Date": "January 29, 2007"}, {"Title": "I'm getting rid of this camera.", "Author": "Tulip_Mesa", "ReviewID": "RD5YPZ10DDJLE", "Overall": "2.0", "Content": "I went from the Olympus C-5050 (not a point & shoot but not professional either) to the Canon A630.  I like to take a lot of natural light pictures and this camera absolutely stinks for this.  The flash doesn't produce a lot of light and the natural light pictures are uselessly blurry even when I brace it on something to hold down movement.  I've been very unhappy with this camera in every indoor setting, shaded outdoor setting but I have been happy with it outside.I wanted a lighter camera to take fun shots with but even my fun shots like the llama show I went to.. are pretty much useless.  I'm going to be getting rid of this camera.  I've taken hundreds of pictures on it and it's just making me madder every time.", "Date": "September 16, 2007"}, {"Title": "great camera except it is bigness", "Author": "EGEMEN OMER YILMAZ", "ReviewID": "R1N7P7C1SXOTTN", "Overall": "4.0", "Content": "it is a great camera for taking high quality photos with excellent 2 and a half inch screenç Also it is wonderful that it has got a turning screen which allows you to take photos from every angle including your own photo easily (Especially when you are travelling alone). However it is a little big and also needs 4 Batteries which makes it bigger and heavier.", "Date": "October 12, 2007"}, {"Title": "Best Camera for the Price Let Me Tell You Why!!!!", "Author": "Gary Bruner", "ReviewID": "RVDF1C33PRAHP", "Overall": "4.0", "Content": "This is a great camera because of the quality, it's a Canon, takes clear pictures, and it's easy to use. I bought the case so I just slip it on my belt and have a 2.0MP card so I can take like 900 photos or videos. The size and it has no stabilizer are it's pit falls. You can't put the camera in your pocket or purse and if you have a problem shaking, the photo may come out fuzzy, I haven't experienced it yet. It's digital so you can always review the photos when taken. I found the night photos did not come out very clear, I experienced that with my two other digital cameras also.I went to Hawaii with it, best move I ever made- B++++ overall, A+++ Quality and Price.", "Date": "September 8, 2007"}, {"Title": "Easy to use...takes great pictures!!", "Author": "M. Price \"missy\"", "ReviewID": "R17QL2O813I21J", "Overall": "5.0", "Content": "I purchased this camera about 3 weeks ago, wanted a new one to take to Vegas.  I did alot of research, online and in the stores, and I mainly liked this one because of the swivel display.  I also found the best deal on Amazon, I did the uprade on shipping and got in in 3 days!! I was really surprised to get it so quickly. A major discount store had this camera for $50 higher so I decided to get it online, a no-brainer.  This phone was very easy to use out of the box and the picture quality is impressive.  I am very happy with it and my shopping experience on Amazon. I own 2 Sony digital cameras, they are ok, but I really am much happier with my new Canon.", "Date": "June 9, 2007"}, {"Title": "Gran Producto", "Author": "Enrique Degrossi", "ReviewID": "R30T1XLZ2MSLYW", "Overall": "4.0", "Content": "La camara es increible. Solo que le faltaria un estabilizador de imagen.Las fotos en lugares cerrados son espectaculares.Muy facil de usar. Muy practica.Totalmente recomendada", "Date": "January 15, 2007"}, {"Title": "Great camera!", "Author": "Francisco Guerra \"FG\"", "ReviewID": "R2UUJ3N7AM322H", "Overall": "5.0", "Content": "Absolutely great! You get what you pay for. I also have a Canon Digital Rebel, but I use this PowerShot as my secondary camera. It's just great. Sometimes I wonder why I bought my Digital Rebel. Photos are of great quality and the different modes and functions let you play almost as free as you can imagine. May not be a professional camera, but perfect for amateurs like me.", "Date": "January 3, 2007"}, {"Title": "great point and shoot", "Author": "claire a corcoran", "ReviewID": "R32QOVGKHPYMN1", "Overall": "5.0", "Content": "too bad they stopped making this model - easy to use and takes wonderfully defined photos. It's also a nice size -not so small you have to hold it with a couple of fingers, it fits in the hand nicely. And it uses AA batteries.", "Date": "May 13, 2014"}, {"Title": "Love it, but....", "Author": "Shari Kays-Whitten", "ReviewID": "R171GD9H783MEX", "Overall": "4.0", "Content": "After a couple of years of careful use the lens cover broke and only half protects the lens. This camera was never abused,nor exposed to beach sand, etc. Very disappointing.", "Date": "March 13, 2014"}, {"Title": "10 years old & still going strong", "Author": "Tutu Nana", "ReviewID": "R1OW5HNPT8GFF9", "Overall": "5.0", "Content": "I've had this camera for about 10 years now.  It has always given me great shots of the distant mountains and the super closeups of birds and flowers.  The only focus problems have been when I didn't take the time to set it or when my dogs go flying by with a ball.  Hummingbirds are not too easy to capture but I've had some great shots of swallows on the wing and feeding the babies.  I like that it is so easy to use even for a technology challenged granny.", "Date": "June 11, 2013"}, {"Title": "Review of recent camera purchase", "Author": "Gordon E Tagge", "ReviewID": "RCP6TBIYUK23", "Overall": "3.0", "Content": "The product was advertized as new, out of the box. Upon inspection, the top near the zoom and print button was highly scratched. The zoom didn't work at first but I eventually got it to work. I would have returned it but didn't want the hassle and extra mailing.", "Date": "May 3, 2013"}, {"Title": "easy to use / good pictures", "Author": "R. Copeland", "ReviewID": "RKKGHFZ1US1OY", "Overall": "3.0", "Content": "this thing is easy to use takes good pictures , uses easily obtainable AA batteries. I would give it 5 stars easily except the date /Time stamp will not work", "Date": "January 24, 2013"}, {"Title": "4 years and looking good", "Author": "Bri", "ReviewID": "R1N0TH768JX8E2", "Overall": "5.0", "Content": "I have had this camera for a few years, going on at least three, maybe four. I bought it at a serious bargain: $180 or so from an online discount warehouse.Anyway, this camera is heavy and big. It won't fit in your pocket, and you have to be careful handing it to someone else, because if they don't get a good grip it'll fall out of their hand.I love this camera with a passion. It's:*Durable. I have an attic bedroom and sat it on my railing, then bumped it down my stairs. It fell 12 feet and bounced. It looked a little banged up, but works 100%. This was about 6 months ago. The shutter now refuses to shut all the way on occasion, and sometimes the videos will appear blurry. That's the only damage, and a stop and start of the recording will fix that.*High quality video and picture. I'm not a professional photographer, I'm a teenage girl. The appeal for me was that 8 mega pixels sounded really sharp, and i was right.*The effects are quite flexible, and i loved experimenting with the drastic and subtle changes allowed in the \"program\" function of the camera. My favorite is probably the portrait setting, although the color swap and color accent are really cool too.*It should be noted that this camera burns through batteries like c r a z y. I had it for a month and decided it would be best to buy some rechargeable batteries. So i bought 8 AA batteries and a charger from Radioshack. Now i always have another set charged and ready when i've burned through my current set. For this, I don't even consider the short battery life for the camera to be a con.*Reliable: this camera gives minimal technical difficulty. It's not 100% on picture taking response. You'll have to hold down the button for a few seconds, even without the flash being turned on. I haven't used a camera that didn't behave this way, and there are ways to increase the response speed, but i've never been impressed with it. It's also gotten slower this past year: a sad sign that it might be wearing down.*the video is SPECTACULAR. I've used camcorders with worse quality. I make instructional piano Youtube videos that require distinct details to be visible, and this camera never lets me down. On occasion, after the drop, i've had to stop and start a video that was too blurry, but the second time comes crystal clear, so this isn't a big deal to me. The camera gives you the option to choose how detailed your videos will be. Less detail=more memory space, as higher quality videos will require more space. But it's 2011, and we all knew that, right?I always get compliments about the videos i take with it. \"Oo, whose camera is this? It's so clear/colorful,\" things to that effect.Besides taping my piano videos, I used to use this camera to record myself and my friends at gymnastics meets. This is where the option to edit and freeze-frame on the go is a must. There might be an additional 30 seconds on a video, and a limited memory card means that 30 seconds has gotta go. So \"set\" button>edit>edit beginning>save, and now you have that much more flexibility in your recordings for the rest of the day. The camera on its default settings allowed me to watch routines frame by frame, and i could see exactly how a trick was executed. Every once in a while, an appendage would be blurry due to exceptionally high speed, but it captures tumbling passes and the vault exercise with ease and accuracy, which goes to show you how detailed the video features are. Again, this is with the default settings, not even the advanced detail.*Transfer to the computer is easy, but i'm not terribly knowledgeable about how advanced the features can be. I tend to dump everything, name my photos/videos, then format my memory card in the camera. I don't know what all it's capable of in this department. It's not always speedy, but that's because i am transferring large files. The speed is not unreasonable, but this is the only camera i've ever owned, so i can't compare transfer speeds in all fairness.*I don't print my pictures, but they email just fine, and the high mega pixel count and clarity on-screen shows good promise for beautiful prints.*This camera allows you to take successive photos, anywhere from 1 to 10 photos snapped automatically with a small delay in between. Great for goofing around. Dunno why else you'd want it, but i use it with my brother when we're bored. We do stop-motion skits ha ha!*My FAVORITE feature is the wonderful flippy screen! It's not fragile, it's durable just like the rest of this sturdy, chunky camera. The screen allows you to see you taking your own picture. I can place my face where i want in the frame, though it's backwards (move to your left, the camera portrays you going right.). This is especially handy in two ways:1) Taking pictures with multiple people without a freestanding photographer. Just like taking your own picture, it can be super tricky to include every face in your photo. But with the flipping screen, you can position it perfectly, no talent required.2) When using the successive auto-shoot feature, you can see what you're doing, even between frames.All in all, i love this camera like i love my dog. it's my baby, and though my friends mock me because i tend to have large electronics, this camera is fabulous, effective, powerful, insanely durable, has lasted forever, and if you catch it on sale, it's economical. Would I buy this over again at Amazon pricing? Yes, if i wasn't a broke college student. But it's really worth it. you'll need an SD cards for memory (i have one that's 1 GB and another was a gift: 4 GB!! 1 gig will work for you just fine), and at least 4 AA rechargeable batteries, then you're all set.", "Date": "December 10, 2011"}, {"Title": "I like this camera", "Author": "Polina", "ReviewID": "RQNSMB0MJVF6I", "Overall": "5.0", "Content": "I've been using it for 3 years and it still works. Though I wasn't too careful with display so it's scratched now.", "Date": "January 16, 2011"}, {"Title": "Great features from basic camera", "Author": "David M. Teslicko Jr.", "ReviewID": "R2N6W73V9Z1118", "Overall": "4.0", "Content": "For its size and price, this camera is packed with features that can help you take great pictures in a variety of settings.  The biggest limitation I've noticed is the small, sometimes blurry LCD screen and the limited zoom.", "Date": "April 30, 2010"}, {"Title": "Takes beautiful photos", "Author": "J. Simmons", "ReviewID": "RZJR2I7SYHJ25", "Overall": "5.0", "Content": "I am not a professional photographer but I think this camera takes some of the best photos I have seen in a while. If you know how to read the display and understand which settings you need for the photo you are taking, then there is no way you could not end up with a beautiful result. The zoom on this camera is great, and I love the 360 monitor!", "Date": "February 19, 2010"}, {"Title": "I love Canon PowerShots", "Author": "K. Hanlon", "ReviewID": "R23JPCHL23PFZP", "Overall": "5.0", "Content": "We had an older Canon Powershot A95...and it lasted quite a while..it had a pretty hard life...so we upgraded to the A630..it does all the same stuff. It has a higher resolution and a better zoom. It has one less feature on the turnstyle, but it is not missed. The one thing that we can do with this camera that we couldn't w/the A95 is zoom in while you are taking video..that is a great feature. The camera also takes 4 AA batteries, it is great to get rechargables. It is a little heavier and bulkier than most digital cameras out there..but it is a little lighter than the A95...and still fits into a purse. The A630 does take an SD card where the A95 took a Compact Flash card..so you can't use your old memory...but SD's aren't that expensive. The camera came in great shape...we love it!", "Date": "October 18, 2009"}, {"Title": "Another super camera from Canon!", "Author": "E. Nemeth \"By Mac Guru. Enjoy.\"", "ReviewID": "R175GUXERSZKVA", "Overall": "5.0", "Content": "I love the flip-screen, and AA batteries. I've taken 1,000's of pics with this one. Canon is great. I'll only pick Canon cams. I've worked with Canons since 1983.", "Date": "June 22, 2009"}, {"Title": "very happy customer", "Author": "Priscilla \"Lady B\"", "ReviewID": "RQV2VAA5UAHU6", "Overall": "4.0", "Content": "I had a canon A540 before this and wanted to upgrade to get closer photos and clearer pictures. So far, I have not been disappointed that much. I have had it over a month and have taken many different kinds of photos. Very close up of singular flowers came out fantastic. Caught some quick action shots clearly...was great. Realistic color is improved and I am enjoying this part. Scenery pictures come out great. Did video of a major thunderstorm that brought a tornado to my neighbors. The close-up of falling hail didn't stay clear as I zoomed in. The close-up photos of hail stones were great!!, though. Overall, I am enjoying the camera. A little bit bigger than my old one, but the fun I am having overules! My dad has the next level up, so I knew what I was getting. It is very similar to his. It is not perfect, but I am enjoying the improvements, and the quick response when you press the button is just worth it all!!!", "Date": "April 6, 2009"}, {"Title": "Amazing Camera", "Author": "Jesus Belloso", "ReviewID": "RAJDF558I9OFF", "Overall": "5.0", "Content": "I am one of those that like and enjoy take pictures with my family and friends and I want also to be in the picture.  This is the only Camera that I found that let me do this because I can flip the lcd screen toward any direction and see me in that acreen.wonderful camera, I love it", "Date": "March 25, 2009"}, {"Title": "Good value, but garrish color by default", "Author": "David B. Jones", "ReviewID": "RKZ80M7IRYKS6", "Overall": "3.0", "Content": "For the price, this is a very good camera.  My main gripe is (or was) the way the color is punched up.  With the default setting, the saturation is outlandishly high.  I paint in oils.  When I used the camera to take pictures of my pictures, the portraits looked like people with bright red lipstick and clown dots on their cheeks. Sunny skies looked almost bright purple rather than cool blue. Eventually I discovered that there's a \"neutral\" setting that's not the default.  It's much better, but still somewhat too saturated. I would recommend that if you want natural looking images, use the \"neutral\" setting and set the white balance manually rather than using one of the presets.", "Date": "March 20, 2009"}, {"Title": "The only brand i trust.", "Author": "Jennifer Peters \"Jenifah2007\"", "ReviewID": "RQFHUI9ECC15N", "Overall": "5.0", "Content": "This camera does some amazing things. I love it. Not as sleek as the other cameras but i don't care. I'll take it with me where I can. I love the color accent features and takes great videos. Sometimes the format isn't compatible and can't upload to youtube but w/ a couple tries I get it. I love this camera. It was dropped a few times. I am determined to replace it w/ the exact same one. I've had it for a year and a half.", "Date": "January 31, 2009"}, {"Title": "Canon A630", "Author": "C. Harter", "ReviewID": "R16984FW1ASGML", "Overall": "5.0", "Content": "We owned the previous model of this camera and loved it.  This one is basically the same design with a few improvements on the casing.  My absolute favorite - and MUST have - feature is the flip out and rotate display screen.  We use the self portrait feature a lot so that is ultimately important to us.", "Date": "January 31, 2009"}, {"Title": "ISO 200 and above too noisy", "Author": "Photological", "ReviewID": "R3O3WFZ74I4HEO", "Overall": "3.0", "Content": "Sometimes I wonder if someone slipped me the wrong camera.My Canon A95 was such a wonderful thing; flip and turn LCD screen, good clear shots, relatively fast speed (2.8), great for macros.  But somewhere, the A630 just leaves me missing my A95 (the first camera met a salty demise in one of those camera \"baggies\" in the Gulf of Mexico looking for jewfish).First I'll tell you what I did find to be pros about the camera:-Flip and turn lcd - big and it FLIPS AND TURNS.  Very nice for macros and sneaky shots.-Quick shutter button reaction - you don't have to wait forever between pushing the shutter and actually taking the picture.  It's almost instantaneously in my experience.-You can use accessories with it - buy an off brand extension and you can put polarizing filters (i highly recommend this), a Cokin set with a ND graduated filter and your landscape or sunrise/set shots will suddenly get much greater.  Even without anything on the extension, it acts like a hood and keeps glare from marring a shot.-This is my camera of choice for macros and infrared shots (using a filter).  You can get millimeters away from things. It's amazing. It's like having a microscope with 100x magnifier.And my main camera (an EOS digital Canon camera) doesn't have the advantage of actually seeing through the infrared filter (which is a deep red/almost black), so it's difficult to frame shots.  The A630 lets you see through the filter on the LCD screen.Now, the not so hot;-You're limited in the use of your ISO.  Anything over 200 is unusable in my opinion (and 200 is not that hot either).  Any ISO under 100 is unusable without a tripod or hands of steel.-The size.  Not small enough to tuck in your pocket.  I really wish it were.  This is supposed to be my little camera.-Photo quality.  I know this camera should take better pictures than my A95 but I'm just not convinced it does.All in all, get it for a reallyreally good price and you should be happy.  :)", "Date": "January 18, 2009"}, {"Title": "Nice flip screen, but camera a little heavy & bulky.", "Author": "Elle77", "ReviewID": "R278ZUDJH2KGVF", "Overall": "4.0", "Content": "Over all I like this camera. I think I got what I payed for. The flip screen is GREAT, you can take a photo & be in it at the same time, all while knowing the pic will be good because you can see it while your taking it. The camera itself is a little heavy, and bulky, but over all a camera you can have fun with!!", "Date": "January 13, 2009"}, {"Title": "Great camera! just make sure you have spare batteries", "Author": "Connie M. Jan", "ReviewID": "RXSP6KA1FHMR7", "Overall": "4.0", "Content": "This camera produces great pictures and has several settings to use. After turning off all the silly noises that drove me nuts i use this camera often and am always happy with the pictures i get. I'll assume it's my rechargeable AA batteries that don't last long enough but it i never get as many pictures as i want out of one battery life. It's also probably due to the fact that when you have the viewer pulled out more battery battery is being used. Since it's run on 4 AA batteries this camera is a little larger than other cameras on the market, but the bulb created by the batteries makes a nice handle.", "Date": "January 4, 2009"}, {"Title": "Canon A630 Powershot", "Author": "Shopper \"Betty\"", "ReviewID": "R2BV6DGRJCH3WL", "Overall": "5.0", "Content": "Canon 8mp digital camera with 4x optical zoom was my daughters 1st choice.She lost her 1st one and she received another one for x-mas.Thanks,Infolight.", "Date": "December 27, 2008"}, {"Title": "Good Camera, great pictures, black screen?", "Author": "M. Lynch", "ReviewID": "R3K5OEN9171A4E", "Overall": "4.0", "Content": "This is a great camera for the price.  I have taken tons of pictures in the National Parks, Ski Mountains, Family gettogethers.  I would recomend this camera.  I have a personal preference not to use the Auto Mode.  I set it up for portrait or Landscape most of the time.  Great large pictures of blue skys and snow.  The large flipout screen is great for taking pictures when you put the camera on a tripod or want to take a night shot and need to set the camera down.After owning my camera for about 16 months, my camera LCD screen went black.  The pictures were black and the camera was useless.  I went directly to the Cannon Website and opened a repair.  I paid for shipping to them.  They actually paid for the repair and they will pay the shipping back to you.  In my case worst that would have happend was they tell me it's expensive to fix and they pay to ship it back and I buy a new one.  This is the second powershot I have owned, I had a A540 and had no problems with it.  I wanted more Mgps.", "Date": "November 11, 2008"}, {"Title": "best damn camera", "Author": "D. Wilk", "ReviewID": "R4KFCFQ9379J2", "Overall": "5.0", "Content": "I've had this camera for well over a year now and it just never ceases to please.  I love the standard AA batts which allow me to use the batteries of my choice and affordably keep multiple spares.  I can also pick up replacement batts just about anywhere so I never need to worry about being without my charger...Consumer reports rated it tops in picture quality and that is no lie.  I almost feel embarrassed for all the nikon coolpix owners in my family.  It's a little on the slow side, but the copious options (allowing you almost the flexibility of an SLR), flexible LCD, and overall picture quality more than make up for it.  Consumer reports has just named the PowerShot A650 to the top of the heap so I already know what I'll be getting to replace this one should I ever be forced to.Oh, it's pretty tough too.  It's been on numerous trips, hiking and otherwise, and taken a few trips to the floor... the hard way.", "Date": "October 13, 2008"}, {"Title": "10,000th Picture", "Author": "A. Weinert", "ReviewID": "R1QEOFYM0G4DRZ", "Overall": "5.0", "Content": "I just took my 10,000th image with this camera. I bought it 2 years ago, and it is still working great, even with the beating I have put on it. It has been rock climbing, caving, kayaking, dropped on concrete, etc. It is only now succumbing to cave dust after about 30 different caves [that destroyed my solid state flash after about 10 caves], but it still takes great pictures for now. I love having the manual mode, where I have almost limitless options for the more difficult shots. The noise at high ISO is annoying, but it seems on par for its generation. This is the camera line I buy when I want an DSLR but can only afford a 200-300 dollar camera.", "Date": "October 4, 2008"}, {"Title": "great camera", "Author": "JTB", "ReviewID": "R18WFHUATVFHCX", "Overall": "5.0", "Content": "ASIN: B000HAOVC6i love this camera - especially how you can see the photo you're taking from different angles-perfect for taking self portraits, w/friends, concerts, etc.takes great photos and videos too-lots of fun - we take it everywhere -", "Date": "September 29, 2008"}, {"Title": "a bit of a disappointment", "Author": "Michel Le", "ReviewID": "R37530WFV0VP8N", "Overall": "3.0", "Content": "I'm a graphic designer/art director. I published magazines and books, so photography is a key element of my work. This is my second Canon. I had a G3 that had problems with the lens (it wouldn't extend when powered on), and the screen went black after 2 years! So I got this one, because it was the only point & shoot with a swivel screen, and I wanted to give Canon another chance.I have a same comments as Flaming June. The inside shots were for most of them grainy, on various settings. Also it doesn't have shake control. Lower and cheaper models have it.I also have problems with the flash. Occasionally when I forced flash on, it wouldn't take pictures. Annoying to miss some good shots. The quality of the photos is very good for a P&S;, but the top left gets way too blurry. It's fine if there is a non detailed background (ie sky) but it's a disappointment for the rest. The Canon software is good, including the stitching, but I generally end up using Photoshop.My next camera will have a swivel screen, but that won't be a Canon.Looking for THE perfect Christmas present? How about a nice warm children book to read to your kid?The Hawaii Snowman", "Date": "August 4, 2008"}, {"Title": "Canon Powershop A630 good choice", "Author": "Kenn's comments \"Kenn\"", "ReviewID": "R8ZNNE8MRV5Q4", "Overall": "5.0", "Content": "This camera has met every need of our family in our picture taking and videos.Pictures are crystal clear.  Typical easy off load by cord or memory card of pictures and videos to any computer or photo program.  We have 4 computers with a different photo program on each one.You do have to read the manual.  This is not an out of the box, point and shoot camera.  There are many many features available, and I recommend rereading the manual after three months to find out which of the many features you have not used, but could be using.Price was fair, normal cost for this good a camera.My wife has used it extensively and loves it.We our \"senior citizens\" therefore if we can master it, anyone should be able to.Very pleased.I recommend that you purchase a larger memory card than the one that comes with the camera so you will have plenty of storage space.", "Date": "May 10, 2008"}, {"Title": "Canon PowerShot A630 8MP Digital Camera with 4x Optical Zoom", "Author": "Marly", "ReviewID": "R3AXZ6XSIQNOQ6", "Overall": "5.0", "Content": "I bought this camera almost a year ago, and simply love it.  It is everything I was hoping for and more.  I would highly recommend it. It takes excellent pictures and also short videos.  Mg", "Date": "April 26, 2008"}, {"Title": "All depends on what you are using it for", "Author": "J. Boyce", "ReviewID": "R17JRJ1JX0EQY3", "Overall": "4.0", "Content": "This is my first digital camera. I made the transition from a high quality 35mm slr for the ease of photographing stained glass and jewelry for my web sites. With traditional film it was costing a small fortune for supplies and processing not to mention being disappointed with the results of photographing glass. I had to overshoot with the hope a glass panel would turn out correct. Glass is a very difficult medium to capture accurately. Digital just made sense having instant results. It worked great for the glass panels but I am not pleased with pics of my jewelry. This application requires more close up shots for detail. The auto focus seems unpredictable and I end up with a great many of my pictures being out of focus. I have to shoot quite a few pics to get a couple of keepers. I suspect this is not this cameras' specialty. I use it outside and it takes an excellent photo. Normal indoor photos, like Thanksgiving, with the flash is fine also. So it all depends on what you are going to use it for.", "Date": "April 22, 2008"}, {"Title": "Great Product", "Author": "Robert C. Burket", "ReviewID": "RX5WYE68UYAH5", "Overall": "5.0", "Content": "This camera is brilliantly designed and constructed.  For an amateur photographer such as me I cannot imagine anything to improve.", "Date": "April 14, 2008"}, {"Title": "A Professional-Like Camera Made For The Amateur.", "Author": "Andre Reynolds", "ReviewID": "R11DOME9KIAZNR", "Overall": "4.0", "Content": "If you're anything like me, you're not exactly digital camera savvy. You may not understand what exactly ISO has to do with a shot, or the benefits of using Macro or different lens settings. Before buying this camera, I owned a Fuji Fine Pix camera. It was everything a beginner's camera was supposed to be. It was easy to use, but the ease came at the sacrifice of having great looking pictures. That isn't the case with the Canon A630.The Canon A630 is a professional like camera that is made for the use of both amateurs and mastery photographers. It comes with a host of features and is relatively easy to get used to using. I've owned this camera for nearly 2 years, and have yet to have a major problem with it. The only minor problem I have had is battery life, but I bought a rechargable battery for the camera, and that's improved my issue with batteries. I took this camera abroad to Europe with me to cover my trip, and the photos turned out great. Clear, vivid, and crisp. I definitely recommend this camera to any and everyone. If you're looking for a great camera, but are a bit intimidated by being overwhelmed with the technical aspects, then the Canon A630 is the camera for you. Easy to use and great results.", "Date": "March 25, 2008"}, {"Title": "My Canon A630.", "Author": "Ronald Davidson \"Ronald Davidson\"", "ReviewID": "R2NCJ70X5LF2TD", "Overall": "5.0", "Content": "Its an excellent camera about the best ive ever used. And theSERVICE from Amazon is as always the very best.  Ron Davidson", "Date": "January 27, 2008"}, {"Title": "Very expandable!", "Author": "Janine R. Starykowicz \"jrstark\"", "ReviewID": "R1BXMOTZO8GVRY", "Overall": "5.0", "Content": "I bought this camera in May, it's my first \"real\" camera.  A few things I haven't seen mentioned: you can use at least a 4GB card, that was the largest when I bought the camera and it's working fine; there are add-on lenses, I just bought a wide angle and 2X telephoto, and I see there is also a 3X.  There's another lens you can buy for closeups.  All you need is the adaptor, you can also use filters and an external flash.This is a very versatile but easy-to-use camera.  I've talked to Canon Customer Support once (when I upgraded the memory card) and they were great, but have yet to read the manual.  There are all kinds of manual settings to play with, there is also a DVD tutorial available through Amazon that I'm thinking about.  Mostly I use automatic or portrait (blurs the background).  There's a Canon Yahoo group as well.Get a tripod if you are shooting in low light, those are the ones that come out blurry for me.  Video is sharp, but you can see how much I move ;-)  Someone earlier wanted a sports setting, try Kids&Pets.;This is a great camera, the swivel screen is very cool and you'll be amazed at the shots you can get.  The more you learn, the more you can do.", "Date": "January 20, 2008"}, {"Title": "from a graphic designer", "Author": "myrlie \"cjjlenny\"", "ReviewID": "R13Z0GKU7G3M5A", "Overall": "4.0", "Content": "I purchased this camera as an upgrade from what I call my purse camera. I like to carry a camera absolutely everywhere I go. In the past I've always carried point and shoots but had decided I would prefer a camera that had the ability to go manual. Plus the rotating LCD was such a plus when it came to this department.When I first purchased the camera I was absolutely ecstatic. I'd heard such raved reviews about the A610 which had recently retired from retail shelves. I got it home and discovered that well, maybe I wasn't so hot a photographer after all. I avoided it for about 6 months before it made itself into the purse after all.I had the same problem everyone else seemed to have with taking photos indoors. It didn't compare to my 3.2MP HP Photosmart 735. I didn't expect the world but comparable indoor shots to an outdated point and shoot were kind of on my list of great expectations. I actually found out I can shoot video in a scene I can't take a photo in and the video look perfectly fine. It's a better camcorder than a camera sometimes, if it wasn't for the pesky memory limit. And the software freezes upon completion of upload every time.With the help of imaging software I have come to actually love this camera. I don't mind airbrushing or touching up the color and light settings later on...that's what I do for a living and what I love. It's a workable lighter camera for the professional but I would not advise it for the everyday consumer.Somewhere in the past month the camera has become severely damaged physically. It went on this crazy trip through the City Museum in Saint Louis (think giant metal playground) and I don't know exactly what happens but on my way home I realized that it was dented badly. I can only imagine what kind of a blow it took. It still works just the same however and functionally I never would have noticed. All of the pictures survived the ordeal.I am hoping to upgrade in the near future, being that mine now looks like a car wreck, and of course technology progresses. I will still probably look to Canon. This hasn't turned me completely off. Everything has to have it's downers and it's just unfortunate this one has such a huge curve to overcome. I've taken roughly 5,500 images/video with this camera and don't plan on completely setting it out to pasture in it's older age. I'm sure it will accompany me to more \"dangerous\" places to keep the new guy safe at home.", "Date": "January 20, 2008"}, {"Title": "Outstanding", "Author": "E. Haydock", "ReviewID": "R222ETYGLZ4B34", "Overall": "4.0", "Content": "Love this camera. Best we have ever owned, except for low light performance. It does hunt a little to focus in low light, sometimes not being able to focus automatically (Our Sony was amazing in low light, but not as good overall)", "Date": "January 13, 2008"}, {"Title": "Most of the usefulness of a DSLR in a pocket-sized package.", "Author": "Justin Baker", "ReviewID": "R12BD50O5UY5P3", "Overall": "5.0", "Content": "Well, if you have big pockets. It's pretty clunky for a point-and-shoot, but the zoom and manual mode make up for it. It's small enough to lug around, yet the grip and features make it feel like a \"real\" camera. The all-manual exposure mode was my main reason for buying Canon A-series cameras, even though I've ended up using them in Program mode 99% of the time -- it's a very smart P. mode. Neither this one nor the previous A70 have disappointed me in any way (other than the A70's CMOS coming loose, but that's a warranty repair, I just chose to buy a new 8MP instead of getting the old one fixed).The AiAF seems to alway pick the wrong part of the frame to focus on for me, but I turned it off and just used the center frame and a half-press of the shutter button. No problem with that method, since I grew up on Olympus OM-series SLRs.The manual focusing leaves something to be desired, since it just gives a magnified center on the LCD, and no cheats -- you have to judge sharpness on the little LCD, by eyeballing it. But you'll never need to use the MF, since the auto works perfectly from one inch to infinity if you set it to only use the center zone, then focus on what you want to be sharp and hold the shutter button halfway down while you compose. The MF does show a distance scale at the top, so you can really fine-tune it if you're willing to break out a ruler.Overall, I'd say it's as good as you can get without interchangeable lenses. Ease of use and features abound.", "Date": "January 11, 2008"}, {"Title": "Great camera", "Author": "Seda", "ReviewID": "R11DF55CRT1MCC", "Overall": "5.0", "Content": "I wanted this for a long time. It's a great camera with lots of features. The macro lense is WONDERFUL as is the zoom. It's easy to use and takes aa battery's to operate. I kind of wish it took a rechargable ion battery, but whatever. I recommend it for sure.", "Date": "January 5, 2008"}, {"Title": "Great camera", "Author": "Aggiegirl", "ReviewID": "R14DBJ1C2FQ86N", "Overall": "5.0", "Content": "This camera is fantastic. I've dropped it more times than I can count, and it still works like it did when I first got it. I've used it for over a year now, and I've taken millions of photos, away at college, home for Christmas, parties, at the pool, on my trip to Australia, up in Lake Tahoe, college group retreats, concerts, dates...everywhere I go, the camera comes with me. It fits great in my purse. I know it looks big, but I haven't had any problems taking it anywhere. It doesn't exactly fit in your pocket, but since you can flip the back panel around, the screen stays protected. I love how clear the pictures are, too, and all the shooting modes make it fun to play around with the camera in different settings. My friends love that you can flip the screen out- it makes it easy for them to take photos of themselves without making somebody else do it, and it's great for taking pictures of my boyfriend and I when we go out. Sometimes I have issues with clarity when I turn the flash off, but that's partially due to the fact that I can't keep my hand still long enough. All in all, the camera is well worth the money. I highly recommend it! :)", "Date": "January 2, 2008"}, {"Title": "Nice shots, BUT red eye reduction not good", "Author": "Lauren V. \"Lauren V.\"", "ReviewID": "R30L6147X19B57", "Overall": "3.0", "Content": "I have had this camera for several months (my first digital).  Overall, the clarity and color of the shots are great.  My big complaint is that most of the time the red eye reduction doesn't work, so I waste countless hours with a photo software taking the red eye out.  The troubleshooting portion of the manual states that the subject should be looking directly at the red eye lamp.  That's not very easy when taking pictures of children.  It also recommended brighter lighting which many times a person has no control over, especially if the picture is taken outside at dusk.  I had a Ricoh film camera that I loved and the red eye reduction worked everytime.  However, that red eye reduction was a flash as bright as the flash itself (rather than a dull lamp) so I used to tell people to wait for the 2nd flash before getting out of the pose. Maybe Canon should improve the technology for its red eye reduction.", "Date": "January 2, 2008"}, {"Title": "Good service and product", "Author": "Y. Pan", "ReviewID": "R14EF85LJS2HJ1", "Overall": "5.0", "Content": "Quick serices and good product. Will give very hig recommendation ot the people are interesting to.", "Date": "November 13, 2007"}, {"Title": "Superior Buy When On Sale!", "Author": "RC \"RC's Reviews\"", "ReviewID": "R14UO8YIG3RAP3", "Overall": "4.0", "Content": "Bought this camera after seeing a good review and I have not been disappointed.The camera takes some good pix even when on automatic settings.  I've found the swivel screen to be a huge plus and I use it all the time.  I'm pretty tech savy, but think most folks can figure out the advanced features on this camera.And to top it off, the batteries last ten times longer in this camera than my old Fuji.Its not the smallest camera out there, but if you don't need to slip it in your pocket, this one's a winner.", "Date": "October 26, 2007"}, {"Title": "great camera......hope it lasts", "Author": "Tom", "ReviewID": "R10D26WN4NHTFO", "Overall": "4.0", "Content": "The 630 is a great camera. Good pictures. My daughtr uses it as a video cam almost as much as for stills. Now I just hope it outlasts my first digital camera ,the Canon 610. I always treated the 610 with kid gloves, but the lcd died on this camera after only 15 months. This is something that has happened to quite afew 610 owners, but Canon will not admit to a flaw in this model. My review of the 610 can be seen in the 610 section.Why did I buy Canon again? We fell in love with the 610, the 630 has a larger lcd which also swivels. This particular feature I would find it hard to do with out.", "Date": "October 4, 2007"}, {"Title": "so far soooooo  happy", "Author": "not happy \"david\"", "ReviewID": "R1411518PIKCLK", "Overall": "5.0", "Content": "i love this camera  great resulation,,  great features..  only draw back i have noticed is you need a large card to store anything i have 2 gig  the one that comes with the camera holds like 7 pix at full resuliton..  2nd  digital zoom is pixelated  but over all a great camera for pics and video...", "Date": "September 28, 2007"}, {"Title": "Awesome photos, but bad extras.", "Author": "V. Deering", "ReviewID": "R2MI2RE6F4R5MD", "Overall": "4.0", "Content": "I love this camera. It takes awesome photos and the flip screen comes in handy a lot. The only problem is that they sent me the wrong hook up for my computer. It's too small.", "Date": "September 26, 2007"}, {"Title": "Great pix, terrible shutter lag", "Author": "Gary J. Landman", "ReviewID": "R2F47TO89SMANX", "Overall": "4.0", "Content": "A very good camera, super clear pictures, very handy view screen that swivels all around, but a terribly slow lag time between pushing the shutter button and the camera actually taking the picture.", "Date": "September 25, 2007"}, {"Title": "Canon Powershot A630 is all it claims to be", "Author": "L. J. Snyder", "ReviewID": "R19RBZJO2DRD3Q", "Overall": "5.0", "Content": "I also have a Canon Powershot A540 that is the best camera that I have ever owned...until now. I was looking for a higher mp and a stronger flash and the A630 fits the bill so nicely.  It's as simple a camera with superb results as you wish, but also has more technical capabilities for the advanced photographer.  I highly recommend this camera!", "Date": "September 24, 2007"}, {"Title": "Good camera, frustrating sometimes", "Author": "Gabriel's Buddy", "ReviewID": "R13RCB6HHI2G9W", "Overall": "4.0", "Content": "I'll let you read the specs for what this camera has and just use this space to explain the biggest thing I noticed. It is a very good camera with many good features. The points below are mostly negative, but none of them are big enough to make me want a different camera.1) Like all digital cameras, the shutter delay is frustrating. My laughing baby will turn his head and look away from the time I press the shutter and the time the picture is actually taken.2) It is hard to get good auto-focused pictures indoors. I assume it has to do with lower light inside, but it is frustrating to see a good picture on the display only to see it fuzzy when you download it.3) Sometimes it won't take pictures. I don't know if it is waiting for the flash to charge or what, but I can point at what I think is a well lit shot, push the shutter, and nothing happens.4) Frustrating that the display is more light sensitive than the camera. I wanted a picture of my baby sleeping. I could see him just great in the display (it was dark, but that is what it looks like in real life and what I wanted to capture), but the picture comes out black. You can get the picture if you play around with one of the manual modes, but it is always a guess what you will get. It would be nicer if the display was more WYSIWYG.5) Battery life is great!6) You can get great images out of this camera and 8 MP is great when you want to crop.7) I love the ability to take multiple pictures on a timer.8) The video comes out very well.9) A speck of dust appeared on the inside of the lens. I am not sure how it got there or how to get it out, but it doesn't seem to affect the pictures. Annoying, none the less.10) The software is useless unless you want to stitch pictures together.", "Date": "September 23, 2007"}, {"Title": "Great camera for the price", "Author": "GiG", "ReviewID": "R2NJIBJ3VXCJIM", "Overall": "5.0", "Content": "I have been doing quite some research before I decided to go with this camera.  It takes photos of decent quality, and it's inexpensive.", "Date": "September 21, 2007"}, {"Title": "Great pictures - easy to use", "Author": "Larry TX", "ReviewID": "R2WZF9EU9QDI2Z", "Overall": "4.0", "Content": "This camera is small and relatively lightweight. It takes great pictures even when the cameraman is not really \"into\" photography. Just point and shoot. Speed between pictures is good and the camera is easy to use. Glad we bought it.", "Date": "September 20, 2007"}, {"Title": "Great so far", "Author": "L. Pridgen", "ReviewID": "R1FXT7472P6WNG", "Overall": "4.0", "Content": "I'm really happy with this camera so far.  It has all of the functions that I wanted in a camera and many that I haven't discovered yet.  It takes wonderful pictures and is very intuitive.  The only downfall is the recovery time between photos isn't quite as quick as I would like, but it's not terrible.", "Date": "September 16, 2007"}, {"Title": "Canon Powershot A630 is a good buy", "Author": "David Daniels", "ReviewID": "R278KGRXXKFG86", "Overall": "5.0", "Content": "I am definitely satisfied with my A630 digital camera.  The quality of the camera and the features it contains far outweigh the cost of the camera.  One of the coolest features is the fold-out LCD screen that helps protect the screen from scratches and also allows you to have a clear view of the screen when the camera is at any angle, including when it is pointed at yourself.", "Date": "September 15, 2007"}, {"Title": "very nice camera!", "Author": "L. Miteva \"Lyuli\"", "ReviewID": "RVXHC38JUHPYE", "Overall": "5.0", "Content": "I'm  very satisfied by the camera. It makes very good pictures! Even in the dark.", "Date": "September 13, 2007"}, {"Title": "The Best Camera for $200 you can get", "Author": "Kristen Brenner \"kristen in the keys\"", "ReviewID": "RI0FAREYYGVV4", "Overall": "5.0", "Content": "We have a Cannon Professional Series Digital Camera, but the lens and camera were big and bulky, and I did not take it with me to soccer and other events our son participates.  I wanted a small camera that took quality pictures to share with my family and friends. We could not have picked a better camera.  The photos are beautiful and easy to take with the screen on the back of the camera. And the photos are sharp and clear, and no delay when you take the photo.  We are estatic about our new purchase.", "Date": "September 9, 2007"}, {"Title": "A very good camera", "Author": "Rodrigo Duarte \"Rod\"", "ReviewID": "R3TKYPI8ZYRZOP", "Overall": "5.0", "Content": "I own this one, and had an A620 before.Very good image quality and controls. Excellent battery life. of course , it is a bit pn the bulky side, so large pockets or a camera case are useful (mine lives in my backpack).The rotating screen on the back is priceless, as it allows for inconspicuous shooting of subjects who resent being photographed.", "Date": "September 8, 2007"}, {"Title": "Lots of features, great pictures, just a rather large", "Author": "Mr. Bozack", "ReviewID": "R141FNZATI206F", "Overall": "4.0", "Content": "This camera has a ton of features, is easy to use and takes great pictures.  The only drawback, and the single reason I returned it, is because it's rather larger for point and shoot.  If you're looking for something that'll slip into your shirt pocket, this ain't it.", "Date": "September 5, 2007"}, {"Title": "Excelent Camera", "Author": "Eric E. Levy Forbes", "ReviewID": "RUFJIKQ37XB6D", "Overall": "5.0", "Content": "Very easy to use, fun and versatile; high quality pictures and as a plus have an optimal use of batteries.", "Date": "September 3, 2007"}, {"Title": "Canon camera", "Author": "D. Horning", "ReviewID": "R83CWSBB2NQMR", "Overall": "5.0", "Content": "I chose this camera from Consumer Reports as the best one and I can see why.  This is our second digital camera and it is great!  We were able to purchase through Amazon at a tremendous savings over Walmart!!  Highly recommend. Compare prices and see for yourself.", "Date": "August 31, 2007"}, {"Title": "good camera", "Author": "D. Lakhan", "ReviewID": "R3D1G8E6VXWVFA", "Overall": "5.0", "Content": "This is a good camera with lots of zoom and good picture quality. No complaints.", "Date": "August 31, 2007"}, {"Title": "Great camera", "Author": "P. Emory", "ReviewID": "R1485ZP4G3ICG9", "Overall": "5.0", "Content": "I originally purchased the Power Shot A640 but I dropped it and it broke.  I replaced it with this camera and like it much better.  It's more user friendly and works great.  I'd recommend it to everyone.", "Date": "August 9, 2007"}, {"Title": "The Canon Family", "Author": "Robert J. Webster \"camera jocky\"", "ReviewID": "R12PIDBPH2OL25", "Overall": "5.0", "Content": "I have a long list of canon cameras at use in my house. This one really surprised me! it is so much better than the compact cameras I currently had. It ,of course, takes great pictures! I had an A95 and upgraded to the 630. What an upgrade. The Macro shot ability of the 630 is incredible, the large view screen is sweet and the ability to flip the screen out for different bizarre angles is more of a plus than most people realize. The A95 has this feature as well, and when upgrading to the 630, I was not going to give up this sweet option.all in all this is one of the best compact digital cameras I have had. No, it is not tiny, but, I am 6' tall and this camera doesn't feel like I am holding a deck of cards and trying to take a picture.", "Date": "July 23, 2007"}, {"Title": "Awesome Camera", "Author": "Enrique Cendejas \"Quique\"", "ReviewID": "R163TAL7SYOAL6", "Overall": "5.0", "Content": "What an incredible camera for the price. When I show my pictures to people they cannot believe the vivid colors that it produces. This camera is simply awesome....and as Forrest Gump says, \"that's all I've got to say about that.\"", "Date": "July 12, 2007"}, {"Title": "Canon's Powershot", "Author": "D. Haymond \"Deke\"", "ReviewID": "R2DRAJCDUD7IZS", "Overall": "5.0", "Content": "The powershot line has been a great camera.  We have two.  I use them for simply point and shoot tasks.  Shutter speed is slower than some, but quality is great.", "Date": "June 26, 2007"}, {"Title": "I love my camera!", "Author": "S. Ballard", "ReviewID": "R11WGCVOJQ7S0O", "Overall": "5.0", "Content": "I've had my Canon A630 now for a month and am very happy with its ease of use and performance.  I do not like small lite weight cameras.  This one definitely has substance.  I think the weight and size are perfect.  My last camera had 4MP and I can sure tell a difference in the pictures taken with this one.  They are amazing!  Before I purchased this camera I read a lot of reviews saying that it was difficult to hold this camera steady so the picture wouldn't be shaky. The instructions tell you to change the ISO setting so you won't have this problem.  I did this and have never experienced a shaky picture.  This camera has my highest recommendation.", "Date": "May 12, 2007"}, {"Title": "great camera", "Author": "Bobby Abrahamson", "ReviewID": "R2RMSBRQYRKRNZ", "Overall": "5.0", "Content": "Wow, this is one nice camera.  It is easy to use, takes great pictures, and the books help you make your pictures come to life on your computer with ease.", "Date": "February 6, 2007"}, {"Title": "nice camera", "Author": "lizzy", "ReviewID": "R13A7ORNC8OL14", "Overall": "4.0", "Content": "bought for college daughter.  She loves it-easy to use, super, her friends all want one.  She wishes she had the tripod for steadiness on pics at night that take a few seconds to shoot.", "Date": "January 30, 2007"}, {"Title": "Well worth it!!!!", "Author": "M.N. \"maddie\"", "ReviewID": "R3H3I90HW5P1OS", "Overall": "5.0", "Content": "I think it was worth every cent...First time canon user, a little tricky at first with the multy functions, but once you get a hang of it, it's all good.Great size, great functions, and a great price for the brand and the 8 MP.Give it a try you will not regreat it!!", "Date": "January 20, 2007"}, {"Title": "Canon is a great camera at a great price", "Author": "jsandgirl", "ReviewID": "R1W22OJJ72HK3B", "Overall": "5.0", "Content": "Upgraded from Canon A70 and have no complaints.  Has lots of picture taking modes such as kids, snow, fireworks etc....Love the big, moveable LCD screen.  Even takes great movies.  Love my Canon A630!!", "Date": "January 19, 2007"}, {"Title": "The sincerest flattery", "Author": "obform", "ReviewID": "REUOTMZ3PZT7S", "Overall": "5.0", "Content": "We chose this Canon as a gift because we are thoroughly happy with the one we have.", "Date": "January 15, 2007"}, {"Title": "Nice Camera for the Money", "Author": "B. Millett", "ReviewID": "R2FV53AOGCOQ5L", "Overall": "4.0", "Content": "The camera is very easy to use once you get used to the buttons and choices for enhancing your pictures.  It seemed a bit awkward at first, but I believe it was just my becoming familiar with it.  The software loaded without any problems and downloading the pictures is a snap.  I'm very satisfied with the picture quality and features that I didn't have with my old Canon.  Very good choice for the casual picture taker.", "Date": "January 13, 2007"}, {"Title": "Canon A630 Powershot", "Author": "Steven Altschuler", "ReviewID": "RFAUTKDQ8IHXC", "Overall": "5.0", "Content": "Very easy to use. Great features. This is my 3rd Canon Digital Camera purchase. Highly recommended!!!!", "Date": "January 12, 2007"}, {"Title": "great camera", "Author": "M. Potts", "ReviewID": "R12KPQKVGOP3B", "Overall": "5.0", "Content": "First let me say I am not a big digital camera expert.  I know enough to take some great photos, but some of the technical terms go beyond my range of knowledge.  The camera I owned prior to purchasing the A630 was a Cannon Power Shot SD 500 (digital elph).  I loved the functions on it, but it was very light and after I broke the screen for the 2nd time... well, I decided it was time for a change.The powershot A630 uses the AA batteries which #1 let me use rechargable batteries that I keep on hand yet in a pinch I can always buy new batteries, and #2 gives the camera extra weight.  I appreciate the heft of this camera.  I find I have fewer blurry pictures due to hand-shake.  the Elph was so light that I tended to move the camera as I took the picture.but here's the part that just flat out sold me on the A630.  the swivel screen.  as a family, we often take group shots of ourselves - using the timer feature.  As we set ourselves up for the photo, we can swing the screen around so we can frame ourselves as the camera is counting down.  (I also purchased a tiny flexible tripod which helps with the framing too).  When we're not taking pix, I just turn the screen around to help protect it!  knock on wood, I haven't broken it yet!At the highest quality setting, I can only get a few pictures on the memory card, but with 8 mega pixels, even the lower settings give great quality photos.I have not explored all options/functions/features on the camera, but overall, I love it.", "Date": "January 11, 2007"}, {"Title": "Canon A630 Good Camera.", "Author": "Penco", "ReviewID": "R128WVF2BSXRTM", "Overall": "5.0", "Content": "AI've been using a Canon F1 all my life and was a little intimidated going digital. Fear not! The A630 is like carrying a bag of accessories for the F1. You should have some experience with photography to get the full benefit from the A630. If you're a complete novice you will have to learn a lot before you will be able to get the full benefit of all the camera can do. You have to understand the terminology. IN auto mode you will get nice shots while learning the rest.  I like the A630 very much.", "Date": "January 11, 2007"}, {"Title": "Canon PowerShot A630", "Author": "Daryl D. Buchholz", "ReviewID": "R1BS4MN1K7OBOJ", "Overall": "5.0", "Content": "Everything we could have hoped for in ease of use, and yet sophisticated enough to do all the extras!  Well worth it in value.", "Date": "January 11, 2007"}, {"Title": "My 630A Camera", "Author": "Audrey A. Weister", "ReviewID": "R3396J8XOG6IWP", "Overall": "5.0", "Content": "This is the first time I have had a digit camera. it is easy for the  directions, I'm sure I will love it.", "Date": "January 11, 2007"}, {"Title": "Canon A630 Powershot", "Author": "Esther Pressler", "ReviewID": "R1ZA80AF1J9V4Y", "Overall": "5.0", "Content": "Soooooo easy to use and beautiful quality prints.  You won't be disappointed.", "Date": "January 11, 2007"}, {"Title": "Great camera.", "Author": "C. Slater", "ReviewID": "RFMXHSD1FRBU2", "Overall": "5.0", "Content": "I love this camera.  It is easy to use and has lots of extras if you need them.", "Date": "January 11, 2007"}, {"Title": "Powershot", "Author": "Barbara C. Steele", "ReviewID": "RP4VMEBSW2NNQ", "Overall": "5.0", "Content": "Camera is user friendly and pictures, to date have been very clear.  Also purchase of mem card from one shot was easy and effecient.I am new to digital camera use and I found the directions easy to follow.Price was better than same camera advertised in our local stores.", "Date": "January 10, 2007"}, {"Title": "It's a HIT!", "Author": "R. Menck", "ReviewID": "RINLCOZ71GNHN", "Overall": "5.0", "Content": "We gave this camera to our fourteen-year-old daughter as a gift. She has been busy taking wonderful photos ever since. The controls are easy to access and she loves the moveable LCD screen. The pictures are superior in quality. Ultimately, it was a wonderful purchase.", "Date": "January 10, 2007"}, {"Title": "great value for the money", "Author": "Amy Denardo", "ReviewID": "R19GAPUB21QLTF", "Overall": "5.0", "Content": "after much research i got this camera for my daughter as a christmas gift. it takes beautiful pictures with ease and when printed out right on my computer printer, the images look great. I use it as much as she does. well, maybe more.", "Date": "January 9, 2007"}, {"Title": "Office Manager", "Author": "Susan A. Reed", "ReviewID": "R1V42R8JZTBCXE", "Overall": "5.0", "Content": "I'm very happy with this camera.  It takes wonderful pictures and veryeasy to use.  It is also easy to carry and to pack.", "Date": "January 9, 2007"}, {"Title": "Powershot A630 an ideal choice for me.", "Author": "Steven A. Thomson", "ReviewID": "RDDQYNA8SXS8F", "Overall": "5.0", "Content": "This camera is excellent. As a first time digital camera owner I find this easy to use, although I have not taken the time to utilize all of the features. The LCD display is 3\" and can be viewed from a number of positions as it flips out and rotates, depending on your preferences. It also closes in for storage which keeps the screen clean when not in use. The quality of the shots have been very good and the viewing of the shots taken can be zoomed in. Portability is just fine for me. I am afraid that I might lose something that is much smaller. Both my children have Canon Powershot cameras and seem to be happy with them as well.", "Date": "January 9, 2007"}, {"Title": "Canon PowerShot A630", "Author": "A. Fedrizzi", "ReviewID": "R48AQKMY1GOCV", "Overall": "4.0", "Content": "This is a  wonderful camera if you are looking for something that isn't too awfully bulky.  It takes great, clear photos for a smaller camera.  It was slightly confusing at first trying to figure everything out but all fell into place quickly.  I would highly recommend this camera!!", "Date": "January 9, 2007"}, {"Title": "Great camera", "Author": "H. Freeman", "ReviewID": "R32569OXNFQII0", "Overall": "5.0", "Content": "Great camera for the money.  Canon is always good quality and this is no exception.  I'm very happy with the shots I've taken and I haven't even had the time to go thru the book and see all that it will do.  It has lots of options in addition to just point and shoot.  Highly recommend it.  My single complaint is that Canon cut corners by putting on a flimsy little piece to open for the AV/DC in-out.  It's no big deal, but it doesn't match the high quality of the rest of the camera.", "Date": "January 9, 2007"}, {"Title": "good performance", "Author": "Swetha Reddy Purmandla", "ReviewID": "R2SC6YVH2I50V4", "Overall": "5.0", "Content": "I feel the product is reliable, till date i havent faced any problems", "Date": "January 9, 2007"}, {"Title": "Love my camera!", "Author": "Camille Christensen", "ReviewID": "R22VYI3NHGLQXQ", "Overall": "4.0", "Content": "I love everything I have so far figured out with my camera.  I haven't spent the time to really look into or use any special features.  But I can tell you having the flip out screen is really nice.  I can have my camera up high but still see what's in my lense by simply tilting the screen down. Also it helps because  I can turn it inward therefore further protecting it from scratches or the hands of my little children.  I would recommend this camera to anyone, especially those that take the time to read all the info about special features.  (cause I know it has lots of them)", "Date": "January 9, 2007"}, {"Title": "Outstanding value", "Author": "Leonardo P. Alenquer", "ReviewID": "RRR75MFGUWZFE", "Overall": "5.0", "Content": "Good image definition, reasonable 4x optical zoom, filming capability, flexible power source, established brand.This is a camera for amateur photographers that nonetheless offers interesting shooting possibilities. You can use regular batteries in it or buy the rechargeable battery pack for a few more bucks. My advice is that you should buy the battery pack and take regular batteries with you when traveling to far, isolated places where electricity is not available. And for those like me who do not like to use digital zooming, the 8-megapixel definition allows you to extend the power of the 4x optical zoom as it offers great picture cropping possibilities without lessening the quality of 5x7 inch prints.", "Date": "January 9, 2007"}, {"Title": "AWESOME CAMERA", "Author": "Dawn Rene", "ReviewID": "R1P1OVC9WZXPVX", "Overall": "5.0", "Content": "I love this camera. I bought it after we had our camcorder and other camera got stolen. Now I have both all in one. It has so many settings for everything. Highly recommend!!!", "Date": "January 9, 2007"}, {"Title": "Canon Powershot A630 - great bargin", "Author": "Isla girl", "ReviewID": "R3OYZ5UT7WAQID", "Overall": "4.0", "Content": "For the price, this is a great camera.  This is my second digital camera.  I am used to my 35mm Canon Rebel X, which I love.  It is much easier to take with you although for some things there is no replacing the 35mm.  I find this model easier to handle than the more compact models of digital camera.  It's pretty simple to operate.  It takes very good quality pictures that have good resolution for enlarging.  The video feature is best used without too much of a zoom unless it is a stationary or very slow moving object.  Zooming in on flying birds was disappointing.  But having the option to take short snip-its of video is a great feature to have.  I haven't used the \"compact\" video feature very much.  The \"standard\" video feature eats up you SD card pretty fast so don't use anything smaller than a 1GB SD card or you might miss something important by having to stop and change cards.  All in all, I am very happy with this camera.  (It also has an under water case available - another great feature)", "Date": "January 9, 2007"}, {"Title": "Excellent product!", "Author": "Kelly L. Marsom \"certainmind\"", "ReviewID": "R1GPD2GPFHQ3YK", "Overall": "5.0", "Content": "The pictures at 8 megapixel are just bomb.  And the video at 640 X 480 puts this camera over the top.", "Date": "January 9, 2007"}, {"Title": "If Only...", "Author": "Will \"Will\"", "ReviewID": "R1CRCL5D660OSE", "Overall": "4.0", "Content": "If only you can find a case for this camera... not a big one or a small one, just one that fix like a glove... but I tried whit a couple of Canon's case and none fix well. The Camera, its really Great, just remenber: you need to buy rechargable batteries and extra memory.", "Date": "January 9, 2007"}, {"Title": "Excellent", "Author": "Casie L. George", "ReviewID": "R117MBV7MIEAF2", "Overall": "5.0", "Content": "this is an amazing camera, all of my friends want one its awsome. i love of!!!!!!", "Date": "January 5, 2007"}, {"Title": "Canon and Sony do it again! (I'm not saying that's good)", "Author": "Miguel Lescano Cornejo", "ReviewID": "RVVEN4509CQVM", "Overall": "3.0", "Content": "This is my second Canon camera. The first one was a A75, which I bought back in 2004 and which died from the horrible defective Sony sensor (you know, horizontal purple banding) syndrome in the summer of 2006.When time came to buy a new camera, I was at first wary of buying Canon again, but ended up taking the plunge with this A630 before taking a trip to Chile. After all, Sony had said that they had already identified and corrected their mistake.FALSE. Last summer, all of a sudden I noticed that a few pictures revealed a very subtle purple banding on one of the corners. It's been a year since then, and the problem seems to have gone. I really hope Sony kill the sensor problem once and for all, and I look forward to using my A630 for a few more years.By the way, when my A75 died, Canon's representative in Quito, Ecuador did not honor the \"free repair\" Canon had offered for buyers affected by the sensor problem. They just kept giving me excuse after excuse. So I took it with me to Canon's repair center in Chile, where it got repaired, no questions asked.", "Date": "December 20, 2006"}, {"Title": "Redeye", "Author": "Mark Twain", "ReviewID": "R10X1SMVACNVH", "Overall": "2.0", "Content": "I replaced my Canon A95 with the A630, and I have the worst case of redeye I have ever seen in a camera. The sharpness of the pictures is no different from the A95 nor is the quality of the images any better.  I may go back to my A95.", "Date": "December 11, 2006"}, {"Title": "Good value, lots of image noise in evening indoor photos, poor quality flash", "Author": "dave", "ReviewID": "RHMKHVFX4PT0S", "Overall": "4.0", "Content": "My wife upgraded from her old Olympus 3030 and wow were we disappointed with this camera! Low light image noise was an order of magnitude worse than the old Olympus, and the flash was nowhere near as even as the older camera. Even though Canon has made this a fairly easy to use camera, my wife still goes back to Olympus.That being said, the camera is only $250, so we were probably expecting too much. I own a Canon 30D SLR and several lenses, so I don't have a thing against Canon. The 30D is an incredible semi-pro camera that I highly recommend if you don't mind the bulk and price of an SLR.", "Date": "November 21, 2006"}, {"Title": "Not the best--There are better ones", "Author": "D. Campos", "ReviewID": "R2QYG3CQB3VFKC", "Overall": "2.0", "Content": "I bought this camera thinking that it would be an upgrade to a 4 y/o Olympus that I had--I was wrong!This model had some very nice features and was easy to learn, but it lacks one important capability and that's (IS) Image Stabilization otherwise known as the ability to adapt for camera shake when taking a picture. I was disappointed by how many blurry images I was getting so much so that I returned it.If you want a compact camera such as this, I'd strongly suggest seeking one of the other Canon models that offers the (IS) feature.", "Date": "July 10, 2007"}, {"Title": "Too much noise", "Author": "H. Thomas", "ReviewID": "R1JO4T3Q3WPFKX", "Overall": "4.0", "Content": "The cam is not so bad for usual circumstances using flash light, but for me as an designer there is too much noise. Even when I set ISO to 80 with still images and long exposure time, there is noise that overlays too much of the resolution, using a camera that has a 4 megapixel resolution if it makes very clean noiseless images the result is as good or better then that of the powershot 630 / 8 MPixel, but with that much of noise all the megapixels are useless. Generally it needs a lot of light to make it a minimum of noise but its still there.", "Date": "May 19, 2007"}, {"Title": "Macro", "Author": "Miguel Eduardo \"Chumpi\"", "ReviewID": "R2YPCBPZG4RK1G", "Overall": "4.0", "Content": "I bought this unit basically interested in macrophotography. Up to now -over 1 week - it has fully fulfilled my expectations. It is a very good camera for its value range.", "Date": "March 12, 2007"}, {"Title": "A very handy camera", "Author": "Michael G. Shively", "ReviewID": "R3KU1SYNWGB4AD", "Overall": "4.0", "Content": "We had an A75 so the A630 was an upgrade for us.  The A630 is everything we needed and more.  The ONLY short coming we've encountered so far is the lack of photo quality in low light situations.", "Date": "January 5, 2007"}, {"Title": "Get the A650 IS instead", "Author": "t00nz", "ReviewID": "R181H5QCBBQ278", "Overall": "5.0", "Content": "I use both this and the A650 IS at my work.  Although this is a very good camera, it does not compare to the better capabilities of the newer A650.  Especially when it comes to the prices I'm seeing here (keep in mind that the A650 is going for under $300).  I mean it's laughable when you just know that the A630 is inevitably destined to show up on ebay someday for $10-20.", "Date": "May 8, 2008"}, {"Title": "Just too bulky for me", "Author": null, "ReviewID": "R3RPZ87VZTAZVL", "Overall": "3.0", "Content": "This camera is great for someone that doesn't mind bulk. It has a lot of great functions and features and the pictures a pretty clear. It was just too big for me, I had to return it.", "Date": "December 2, 2007"}, {"Title": "Great value, lousy SIM card", "Author": "Tim \"Theologator\"", "ReviewID": "RHM644TM0WWY", "Overall": "5.0", "Content": "We love the camera.  It is a bit more complex than our old 2mg Olympus point & shoot, but all to the good.  Our only complaint is the SIM card only holds about 28 pics after we'd set it to 4x6 & medium pixels.  A bigger card is available.  GREAT VALUE on the camera, though.", "Date": "November 17, 2007"}, {"Title": "Great camera with great features and nominal price", "Author": "S. Perumal", "ReviewID": "R20YCOPYJ82B78", "Overall": "5.0", "Content": "I own this product for over 2 months now and feel this is the best point-and-shoot in this range. Actually there cannot be anymore improvements in this already ideal camera.Be it macro mode, or normal mode every shot promises more than what you preview or review. Why I say so? The LCD screen doesn't give the real picture, with its average resolution.The camera has a turning LCD screen which gives you more freedom with angles and views.The camera might be a bit heavy, and definitely not a pocket sized one, but that is probably its advantage. You get a solid feeling holding it.Its just an amazing camera in all aspects, except for low light photography. The images are not quite sharp in low light, probably because of the absence of image stabilizer.Other than that, I recommend it to anyone who is thinking about it.", "Date": "September 19, 2007"}, {"Title": "Canon Powershot A630 8MP Digital CAmera", "Author": "Maxine Carlson", "ReviewID": "R3KOQYAM3YCWT9", "Overall": "2.0", "Content": "Received the camera quickly.  I needed it for a vacation I was taking and it worked well for the first 2 weeks.  It did malfunction the last day of my vacation by not opening properly, so only had small slit which was exposed to my shots.  Small disappointment, but I hope to rectify this with the warranty or with Amazon.I have always been satisfied in the past with my purchases from Amazon.Canon PowerShot A630 8MP Digital Camera with 4x Optical Zoom", "Date": "September 9, 2007"}, {"Title": "I love this camera!!!", "Author": "Umdatgirl \"shaebug\"", "ReviewID": "R1DQEXAK4RHXDX", "Overall": "5.0", "Content": "My husband bought me a camera a few years back. It was a fuji. 2.0 pixel so I couldn't blow the pictures up bigger than 4x6 and it look good. My mother-in-law bought her husband the Canon A570 I think and I loved the camera. I am into a little money last month so I did a little research. Amazon had the camera cheaper than everyone. Walmart,office depot, kmart,and best buy. Prices range between $249-399. The camera came with everthing I needed. This is the best camera!!!!!!", "Date": "June 29, 2007"}, {"Title": "Great for the price!  Great pictures.", "Author": "B. S. S.", "ReviewID": "R3KNDBDV67WOBS", "Overall": "4.0", "Content": "This camera is very affordable, takes great pictures, and has lots of handy features.  The flip screen allows you to take pictures of yourself or group pics with you in them.  I was also pleased to see that you can add a more powerful lense to take better close up pictures.  My friends were very impressed with this camera.", "Date": "May 17, 2007"}, {"Title": "PowerShot A630", "Author": "Rebecca J. Herington", "ReviewID": "R2N5Z8UODUNYQ8", "Overall": "5.0", "Content": "I just love the camera and it is so easy to use and downloading is quick and easy.", "Date": "May 15, 2007"}, {"Title": "Extra! Extra! PowerShot Satisfies Despite Installation Fiasco!", "Author": "P. Wages \"anti-capitalist idealist realist\"", "ReviewID": "R1U9HVW0C2CPPP", "Overall": "4.0", "Content": "<----begin sillyness---->I got my camera delivered at work, so I sat at my desk working, thinking about getting home to crack open the box and start playing with my first new camera in 3 years.  The sweat pouring on my brow.\"Sir, do you mind if I go home early?\"  I moused to my boss.\"Did you finish the such-n-such account?\"\"Yup!\", with enthusiasm.\"Have fun....\"\"Thanks!\" As I grabbed my coat and dashed out the door before he changed his mind, I almost ran out without the camera!<----end sillyness---->Upon opening the package, I read the manual a bit, then started up the camera and took some sample pictures.  All very easy, straightforward, and the little icons on the buttons mirror the purpose of the buttons (intuitive!).  Then I followed the directions to install the software for connecting the camera directly to the computer.  Unfortunately, after many hours of frustration, I could not get the software installed.  However the second tech support guy I talked to about the issue was very knowledgeable and explained that I needed to reinstall Windows because I was missing a required windows file.  Otherwise, the camera is way better than my old Sony Cybershot 3 megapixel, but not only because of the megapixel difference.  The options available are excellent (panoramic stitch, nice video quality, etc).  The reason I did not give 5 stars is because it has difficulty focusing sometimes which seems to get worse when zooming in.  Perhaps all digital zooms are like this, but this is easily remedied by releasing the button, turning the camera slightly, and refocusing.  After the picture is in focus, turn the camera back to the subject and it's perfect!Overall, a much better experience than the old Sony and the memory cards are cheaper.", "Date": "January 19, 2007"}, {"Title": "A great camera....!!! Una gran cámara!", "Author": "Isabel Cecilia Blanco \".\"", "ReviewID": "RUOIXR9S04KDO", "Overall": "5.0", "Content": "I'm dentist and i'm using the camera for little details and for my personal entertainment, and i'm really surprise, the fotos are nice and i recomende it 100%! There is an better information in spanish:Mi experiencia ha sido muy buena con esta cámara, ya que soy Odontólogo y la compre para llevar un registro de los tratamientos con mis pacientes y las fotos intrabucales salen bastante nitidas con la función macro y el zoom óptico de 4x, eso es lo más importante para esos pequeños detalles.- Es bastante rápida entre toma y toma con el flash y más aún sin flash.- Tiene capacidad de tomar videos, esta función la pude aprovechar más colocandole la tarjeta de memoria de 1gb, así como la capacidad de tomas más fotos.- Añade efectos a las imágenes fijas con la función MIS COLORES.- Puede grabar memos de sonido para las fotos.- Es posible la edición de peliculas.- En la toma: configura automáticamente los ajustes de disparo para adaptarlos a las condiciones concretas.- Posee un sensor de orientación inteligente, detectando la orientación de la cámara automáticamente.- Posee una velocidad ISO alta, evitando los efectos de sacudidas o que los sujetos salgan movidos.- Fácil transferencia de archivos al ordenador, y es posible cambiar el formato del archivo para que no sea tan pesado.- 21 modos de disparo- Opción de disparo continuo, y muchas otras funciones que aún me falta por aprender! La recomiendo 100%!", "Date": "January 14, 2007"}, {"Title": "Camera not bad.  Customer service?  Not good.", "Author": "S. Hagood", "ReviewID": "R33VFGQ04JMM52", "Overall": "3.0", "Content": "Back in January, after owning my Canon PowerShot A630 for about a month, the camera began not focusing in Portrait mode. The only way I could get it to work was to push extremely hard on the shutter button and it was as if it pushed something back into place.Since my camera was new I called up Canon, sent the camera to them to repair, and waited.Now, I've owned digital cameras from the time they were 1 megapixel. First a Kodak, then two Olympus, then the Canon. The only reason I got the Canon is because my Olympus cost over $1000 and the smaller camera was easier to take to places where I might get knocked around (concerts, moshpits, etc.). And I liked the cool flip screen.They sent my camera back with the problem undiagnosed, stating they cleaned it. They also stated that the camera had damage. It didn't have ANY.Fast forward, and I'm at a friend's house and I drop my camera out of my hand onto the coffee table, leaves a few dents on the case. My camera had STILL been not focusing, but I had found a quick fix - slam the bottom of it on a flat surface and it worked. Feeling that I shouldn't have paid $300 for a camera with a problem, I contact Canon again. I tell them that when I sent my camera in that it had NO damage, and the document I received back said that it did. Now that the camera had damage, my fear was that they would blame me for the malfunctioning focus, and make me pay for the repairs. I got back a form email telling me to send the camera to them.Uhm... no.I call them today and talk to someone explaining why I didn't want to send the camera back, just to see if they would simply offer to send me a replacement camera. Nope! They said that I could send it back to them at their expense, but they wouldn't know anything about the repairs until they were able to look at it.  They already DID!  So now they want to look at it and see if the new damage negates the old problem?When I looked up the problem in the database originally it didn't even give a diagnosis, it just said to send it to them for repair, so I assumed they knew what the issue was. Waste of my time and money buying this camera. And the amusing thing is that I told them I'll never buy another Canon camera and they seemed to not care. Why should they? Camera is paid for!I will never purchase another Canon camera.", "Date": "June 16, 2008"}, {"Title": "manual mode not intuitive", "Author": "rubenpjr40 \"buff\"", "ReviewID": "R1ZHWKLVR8P0FU", "Overall": "3.0", "Content": "I like just about everything about this camera except the manual mode. Ifyou never use manual, then you'll LOVE this camera but since I'm a veteranshooter, I find it lacking. It's not intuitive and takes getting used to.Otherwise, a great camera", "Date": "July 12, 2007"}, {"Title": "Really Cool", "Author": null, "ReviewID": "R2K9OZJP8TLEDX", "Overall": "5.0", "Content": "I got this today for my birthday. It was way more than what I expected.The flip out screen is really cool. I did not expect something so nice. The pictures are crystal clear.Canon is the best!!! = )", "Date": "February 7, 2007"}, {"Title": "Impressed!", "Author": "Warren Sentivany", "ReviewID": "R2JHY9COCUAZ2R", "Overall": "5.0", "Content": "I have been using 35MM SLR cameras for years and this is my first experience with a digital camera,the Canon Powershot A630. I was impressed with the sharpness and accuracy of the colors. A great camera for the price.", "Date": "January 5, 2007"}, {"Title": "great compact camera", "Author": "Michael Ellery", "ReviewID": "R23DHSEXHECJUM", "Overall": "5.0", "Content": "I've been very happy with Canons in general - this is no exception.  This is the first digital camera I've had that doesn't suffer from a noticeable delay when shooting.  The only exception is when flash is required, but that's typical of all point-and-shoots.  I especially like the fact that this camera uses standard batteries.  I'm using a decent set of rechargables and battery life has been quite good.", "Date": "January 5, 2007"}, {"Title": "A great value", "Author": "R. Graver \"Bobby G\"", "ReviewID": "R1TLMIC42HI99Q", "Overall": "5.0", "Content": "I love this camera.  I only have limited experience with digital cameras but I think this camera is a great value.  I especially like the rotating viewfinder (or whatever it's called).  You can even turn it 180 degrees so that you can take a picture of yourself.  I used it at a baseball game and turned the viewfinder 90 degrees to see around a corner - it was great.  Frank Robinson never saw it coming.", "Date": "January 4, 2007"}, {"Title": "HORRIBLE  don't waste your money", "Author": "Cheryl Coneeny", "ReviewID": "R31P9SZHXMON4F", "Overall": "1.0", "Content": "Can't believe I wasted my money on this camera.  Should have sent it back, when it came. The manual it came with was ABSOLUTELY HORRIBLE!  It gives you no real direction on how to work the camera. The only thing it really describes are the buttons, etc.  The flash doesn't even automatically go up.  Its size is bulky and for the first time I used it, all the photos came out fuzzy.  I would not recommend ever.", "Date": "November 25, 2013"}, {"Title": "Card locked even though it is not locked!", "Author": "SouthernMomma", "ReviewID": "R3K47SYO12X7FF", "Overall": "1.0", "Content": "I have read canon forum after forum about this camera. I got the \"Card Locked!\" error message even though the card was not actually locked. I found out that there is a contact sensor in the camera where the card goes and if it is out then it tells the camera that the card is locked. If you take a paper clip and press it back in then the message disappears. This was a huge pain in the butt to deal with because it wasn't the card and doing a factory reset on the camera did not work either.", "Date": "January 25, 2013"}, {"Title": "Chronic focus problem", "Author": "JAG", "ReviewID": "RTCOOYDE3NPWX", "Overall": "1.0", "Content": "This camera has a serious focusing problem. It has nothing to do with light or moving the camera. This camera also runs through a set of four batteries in less than a couple of days. This product is unreliable and I wouldn't recommend it to anyone.", "Date": "November 12, 2012"}, {"Title": "Great camera", "Author": "Arthur Thompson \"Kindle reader\"", "ReviewID": "R3PHLRALQ6BN7S", "Overall": "4.0", "Content": "Great camera in power shot series. Canon A630 is best of the best. Manual exposure controls are very easy to use and it has an attractive design.", "Date": "February 6, 2012"}, {"Title": "Not working well", "Author": "Timothy P. Dwyer", "ReviewID": "R2OZS02FASKN0D", "Overall": "2.0", "Content": "The camera seemed ok till it broke. The button that adjusts the zoom doesn't function nor does the button you press for photos. We've taken good care of it so we're surprised it doesn't work.  We're not sure what to do now. Not sure if the warranty will cover.", "Date": "December 26, 2007"}, {"Title": "Cheap and fun", "Author": "Trish", "ReviewID": "R1BQCHP1GO8B54", "Overall": "5.0", "Content": "Im so glad to have buy this camera, It is by far more than I espected. Don't hesitate, If you have the money click buy. BTW you should also buy an SD Card (in my case I bougth a 2GB).", "Date": "December 17, 2007"}, {"Title": "beautiful picture and easy to use", "Author": "Mary L. Schrader", "ReviewID": "R1HBZ8RTX43A99", "Overall": "5.0", "Content": "this little camera takes great pictures is easy to use and used normal batteries.  The camera shins best with a large fast memory card.", "Date": "December 15, 2007"}, {"Title": "Nice product", "Author": "Vishesh Garg \"Aqualeo\"", "ReviewID": "R18CNYPVS7JQ03", "Overall": "4.0", "Content": "I have purchased this camera 3-4 times to gift to my friends / relatives. This is a real nice product, picture quality is good. The only negative is that it is a bit bulky and it requires 4 AA batteries.", "Date": "September 1, 2007"}, {"Title": "Powerful Power Shot", "Author": "DA", "ReviewID": "RNNW7H5F0UMPZ", "Overall": "5.0", "Content": "Just got this camera yesterday after doing extensive research and comparisons with other brands etc. Though it does not have the image stabilizer touted by some of the other canons, many of the shooting modes offer this option which I think is pretty cool. I am still getting to know the camera but so far its been great and has taken some awesome photos. I think for the price its definitely a great value.", "Date": "May 5, 2007"}, {"Title": "Canon Camera", "Author": "Edwin L. Helvig", "ReviewID": "R4GS9PD95JFGZ", "Overall": "5.0", "Content": "As a gift for our grandaughters graduation it has all the features and pixels that will make it very effective for years to come as she goes to college and later into her profession.", "Date": "March 8, 2007"}, {"Title": "camera", "Author": "James Lehman \"JL\"", "ReviewID": "RWOEWKVFS68Q", "Overall": "4.0", "Content": "It came in reasonable time, I like the camera, it's got some nice features, I am still playing with it to figure things out, a little bit hard for me to use but this is my first digital camera to own, it's a little bigger than i thought but is a good camera.", "Date": "January 18, 2007"}, {"Title": "Nice for family", "Author": "Paco", "ReviewID": "R1LW561YZKP7CL", "Overall": "4.0", "Content": "it is practices, light but it needs accessories like carrie case, but is fantastic for family vacations, easy for used by kids", "Date": "January 17, 2007"}, {"Title": "Canon PS A630 Poor indoor Quality Pictures", "Author": "Linda \"Linda11454\"", "ReviewID": "R2K7Z0IKFRS319", "Overall": "2.0", "Content": "I own a Canon G2 4MP camera that takes fantastic pictures indoors and outdoors.  It takes fantastic indoor picture without a flash, which at times is a plus because you do not lose anything in the background like you do when you use a flash.I just became a Grandmother and wanted a camera that also takes good video.  So I ordered the A630 and I am very disappointed with the quality of the indoor pictures.  It takes a fantastic video at the high setting and takes great outdoor pictures.  But is poor with indoor pics, very grainy. I tried all different settings to try and see what I am doing wrong, does not matter the indoor pics just stink.I am returning the camera and looking for a better indoor picture quality with the 640 video settings.", "Date": "March 25, 2007"}, {"Title": "Worth to buy!", "Author": "Yang Feng \"fygood\"", "ReviewID": "RQQBEDKXIE72T", "Overall": "5.0", "Content": "I have considered canon A610 and A630, and some SD brands. Finally, I chosen A630. The LCD are large, the only problem is that it has few pixels compared to the 2.5 inch LCD. However, the pictures are good!", "Date": "October 13, 2006"}, {"Title": "Lens Errors Still a Problem", "Author": "K. Marshall \"Katmarsh\"", "ReviewID": "R1HGNKM1C5JFPK", "Overall": "1.0", "Content": "This is the second Power Shot camera I've owned I've had the lens get stuck on in less than 4 years, but of course after the warranty ran out. I kept it in a case and was very careful with it, but the lens got stuck anyway. The next camera I buy will probably NOT be a Canon, and I've only owned Canons up to this point.", "Date": "June 17, 2008"}, {"Title": "Excellent buy!", "Author": "Rupert Smellfungus \"The Roop\"", "ReviewID": "R2TQD980E4774E", "Overall": "5.0", "Content": "I owned one of these before but it was stolen. I missed it so much, I bought another one.This camera takes excellent macro photos which is the main reason I bought it.I am very surprised that one can purchase a camera of this quality for a couple hundred bucks.It uses standard AA batteries and a standard SD card. It's very easy to use and takes great pictures. What else could you want? Buy it already!", "Date": "November 11, 2007"}, {"Title": "Canon PowerShot A630 8MP Digital Camera", "Author": "A. Cameraman \"AC\"", "ReviewID": "R1Q0G9CE5GA1GA", "Overall": "3.0", "Content": "The quality of this product is far inferior to the A95 that I bought about two years ago, so the \"upgrade\" (in terms of pixels, zoom, and LCD screen size) was a mistake. In particular, the LCD screen does not seem to work consistently and the automatic interchange between portrait and landscape format on screen is annoying.", "Date": "August 27, 2007"}, {"Title": "great camera.", "Author": "T. Shoval", "ReviewID": "R1YY44D48F0D4V", "Overall": "5.0", "Content": "great camera, after 2 weeks of using it, i ordered another one for my sister.great camera for beginers.", "Date": "August 23, 2007"}, {"Title": "Cannon", "Author": "Robet Grijalva \"Robert Grijalva\"", "ReviewID": "R386ZUQXYI07BY", "Overall": "5.0", "Content": "Awesome digital camera.  No complaints and shoot perfect pictures... I'm glad that I bought this camera from Amazon.", "Date": "May 6, 2007"}, {"Title": "Indoor shots are so grainny", "Author": "Larry Vu", "ReviewID": "R8VGDDAPHYYP5", "Overall": "3.0", "Content": "I bought this camera A630 to upgrade from my old A95 camera.  Sport shooting mode is not availble with the new A630 camera unlike the A95.  I'm so disappointed with the indoor shots so grainny and poor in details and clarity.  New camera suppose to be better than the older ones but unfortunately this is not the case.  If you plan to take a lot of indoor shots then you should not buy this camera A630.", "Date": "April 7, 2007"}, {"Title": "Nice but fragile", "Author": "D Larry B \"dlb\"", "ReviewID": "R2WTZGU4OKU0CF", "Overall": "4.0", "Content": "I really like this camera. It has a flip view screen and an adapterto use filters like polarizing.But the technology is so fragile. One day it simply quits with noexplanation.In the long run I'm tempted to stick with film and an SLR. I can't be replacingdigital cameras all the time.", "Date": "December 8, 2012"}, {"Title": "very disappointing", "Author": "sylvia rose", "ReviewID": "R3AEUM6I3BNYU", "Overall": "1.0", "Content": "I previously owned a Powershot A70. I got beautiful photos and it was great for traveling. I own SLRs and know how to shoot photos, but I like a small camera for certain events.  I thought another Powershot was the only way to go.  I practiced with it for a couple of weeks and only got 3 photos that were in focus.  It doesn't seem to make a difference which mode I shot in, or the lighting conditions, every photo turned out poor.  I finally sent it back and I'm trying another camera.", "Date": "May 2, 2008"}, {"Title": "Canon PowerShot A630 Digital Camera", "Author": "Edward D. Schepler", "ReviewID": "RNY05L4031XT1", "Overall": "5.0", "Content": "THe Canon PowerShot A630 digital camera is easy to use and give quality pictures. Camera was shipped promptly", "Date": "December 14, 2007"}, {"Title": "You'll want to order an upgraded memory card", "Author": "Lynn", "ReviewID": "R33WB4WBB3IOHT", "Overall": "3.0", "Content": "It wasn't clear to me from the product description how inadequate the memory card included with the camera would be.  It came with a 16M card that was full after I shot a half-dozen still images.  You'll want to order an upgraded card (I went with a 1G SanDisk card) at the same time that you order the camera, otherwise you won't be able to do much with it.  Otherwise I've been pretty happy with the camera, although I'm still playing around with different settings, lighting, etc.", "Date": "December 7, 2007"}, {"Title": "The bulge in my jacket pocket.", "Author": "Arthur Hampton \"Aging gym rat\"", "ReviewID": "RG2US8CVDG3YL", "Overall": "5.0", "Content": "My other camera is a Nikon D70, which is a hunk of iron around the neck. This one is a sizable lump in my jacket, but it's always there. It always works, takes inexpensive batteries that I can buy at most stores, and takes excellent photos. I thought initially that the swing-out screen was just a gimmick, but it has proved to be amazingly handy. My only complaint is that it isn't pretty. It's sort of like a crowbar in that regard. It isn't stylish, and it isn't the smallest camera you can get, but it has all the manual controls that I need and it gets the job done.", "Date": "November 23, 2007"}, {"Title": "Excellent camera!", "Author": "M. Aguni", "ReviewID": "R1QRQA95UYEMW9", "Overall": "5.0", "Content": "With a number of technical functions built-in, it is still easy to use. I especially like the swiver viewer. Great camera!", "Date": "November 21, 2007"}, {"Title": "Good, but not what I expected", "Author": "R. W. Taylor", "ReviewID": "RW3LHCO2PT8VC", "Overall": "3.0", "Content": "I bought this camera expecting great things. I do like it but there are a couple things I feel I should mention. When using the zoom, especially to get close pictures of small objects, you must hold the camera exceptionally still or the picture turns out blurred. I didn't think that would be a problem since I am used to using non digital cameras with telephoto lenses. I was wrong. Apparently this camera requires a tripod for I have yet to get a good picture when using a great deal of zoom. The other thing I felt I should mention is if you are shooting a picture through a window the color turns out faded and drab even if there is no reflection. Like I said I do like this camera, but it is not the wonder I expected.", "Date": "November 7, 2007"}, {"Title": "Nice camera", "Author": "D. Clarke \"Dave\"", "ReviewID": "R2BN5TN7QBBYY5", "Overall": "4.0", "Content": "This is a nice camera but I would have never bought it had I not dropped my Powershot A80 on the driveway.  This new camera does take nice pictures but I think the \"Auto\" setting is not nearly as good as what my A80 had.  When I don't feel like using the manual settings I more often get disappointed with the picture.  Mainly they look washed out and drab.  The A80 did a much better job when you want to be lazy.I will say I have some very nice pictures with this camera when using the manual modes (and some with \"Auto\").  The video is nice and looks pretty good when hooked up to a standard CRT TV.  I picked this camera because the viewfinder folds open and swivels around.  This is nice when holding the camera over my head and adjust the viewfinder so I can still see my target.", "Date": "November 6, 2007"}, {"Title": "Nice Camera", "Author": "Wilder Urraco Suazo", "ReviewID": "RQY87TZ7IQJ2Y", "Overall": "4.0", "Content": "I bought my Canon power Shot A630 by may 27th, it arrives like was scheduled, Well the only complaint that i have is when I use the zoom after the 4X optical zoom, and beging the digital zoom it distorts the image, it seems that i can't close up the image perfectly.after that there is no other complaint.", "Date": "June 19, 2007"}, {"Title": "Good product", "Author": "Thrifty", "ReviewID": "RVQFC8GKSKU6O", "Overall": "5.0", "Content": "I have had this product for about one month only. It works good and I have no complaints.", "Date": "October 18, 2007"}, {"Title": "Great product, fast service!", "Author": "Angele Delahoussaye \"AngeleInAustin\"", "ReviewID": "R3EDWK9RI5OE7X", "Overall": "5.0", "Content": "I received my camera very quickly and it is exactly what I wanted, when I wanted it. I recommend this seller!", "Date": "August 27, 2007"}, {"Title": "Nice Camera", "Author": "Dana A. Ammerman", "ReviewID": "R1WQVK1CRYAS1D", "Overall": "5.0", "Content": "This camera is very nice.  Easy to use.  I like that the screen flips around so it does not get messed up.", "Date": "July 16, 2007"}, {"Title": "Happy customer!", "Author": "Mrs. B.", "ReviewID": "RHRWQ3782X40V", "Overall": "5.0", "Content": "Product came in a timely manner, at a great price--and was exactly what was promised.", "Date": "July 13, 2007"}, {"Title": "I`m very satisfied about this product.", "Author": "Cristian Victor Cismigiu", "ReviewID": "R2UKLSEB5D86JJ", "Overall": "5.0", "Content": "No comment. Everything is OK !Regards,Cristian", "Date": "January 21, 2007"}, {"Title": "Perfect Camera", "Author": "Wade Vogler \"camera Freak\"", "ReviewID": "R3OI9CSRJYSYMD", "Overall": "5.0", "Content": "Perfect Camera excellent for Business or Personal Use. If you Dont Buy it You're A Fool.", "Date": "January 18, 2007"}, {"Title": "FIXED, and now works great! (was: Horrible with anything but ideal lighting)", "Author": "Jonathan Camfield", "ReviewID": "R1KW5HVOBSB6HR", "Overall": "1.0", "Content": "UPDATED: I sent the camera in after a phone call to tech support and there was a hardware problem (repaired, under warranty), and it works like a charm now.  I've added the CHDK set of tools (guide here:[...]) and am getting awesome HDR photos and amazing tools.Sure, it has great features, but you might as well buy a fully manual camera, because you'll be messing with custom settings any time you want to take anything but a shot in ideal lighting.  Bright daylight? The photos turn out dark.  Night/low light?  Unless the subject is less than a foot away, the flash will fail to illuminate them and again - underexposure.  This camera ruined my photography of my trip to India.  Maybe I have a dud camera.", "Date": "October 30, 2007"}, {"Title": "Review from Iceland - Europe", "Author": "A. Jonasdottir", "ReviewID": "R3O8DABMSCPBZA", "Overall": "5.0", "Content": "This camera works just fine. Good quality for little money.", "Date": "November 13, 2006"}, {"Title": "Cannon 360A", "Author": "silvia elias \"SE\"", "ReviewID": "R29A9GXGL7IIV4", "Overall": "1.0", "Content": "The pictures with this camera are of poor quality, and cannot be used for the internet.  If you have to take pictures of items to place on the internet, this is not the camera with which to do it.  We just purchased it, and took our first pictures today. It is worse than our old Nikon.", "Date": "October 31, 2007"}, {"Title": "Good experience", "Author": "Onkar \"Onkar\"", "ReviewID": "R4R8E2AW53F3H", "Overall": "5.0", "Content": "Received the product within the scheduled time, box packed. The same model that I was expecting.I will deal with this seller in future.", "Date": "April 3, 2007"}, {"Title": "Good camera, I guess, lousy manual(s)", "Author": "A. Burchfield", "ReviewID": "R2GH3FXYQ6J2HA", "Overall": "3.0", "Content": "I was going on vacation and needed a camera, this one reviewed well so I bought it.The manuals are too small in size, not much bigger than the camera itself, which makes them hard to read due to the small printing size (my brother's older Canon came with a manual the size of your hand- at least with that one you can read it more easily)and they (a basic and advanced manual- keep both of them because they refer to each other) seem to be written more for an experienced photographer, not the near total novice. Do buy the Nimh batteries, the supplied alkalines only ran me less than 60 shots, a second set I had along ran over 300 and my power usage wasn't really power wasteful on the first set. The Nimh batteries ought to do you better- I hope.As suggested by the manual I did practice around with the thing and got things going well enough (note: nowhere does Canon bother to tell you that the internal clock is 24 hr, not 12- I got some shots miss dated because of that- 1 pm is 13:00, not 1:00 and so on before I realized how things should be set and that there is no 12 hr setting). I generally shot my pictures in Program mode although some bright/ or overcast shots seemed to do better in Automatic- didn't really bother with most other settings. I tried the folder setting, not sure yet if I have it right, the movie setting does work well (I kept it at top resolution) but the built in microphone is useless for good sound whether you're in the windy outdoors or a relatively quite church (I did both), the built in speaker is even more of a joke. Playback on a TV or PC looks good, my current Pc is too old to meet the specs but my brother's year old laptop recognized the camera without his having to load the software. I used the close up settings (a tulip and MF) several times, tulip was good but I could never get much done with MF. The manuals don't really explain either of the icons but I did get along with tulip, my brother's Canon has a ribbed wheel to turn for MF focusing- just a crummy little lever without much control for this camera, it never would stop just where I wanted it to.I do like the flip over monitor, even though cleaning instructions aren't given that I could find, image stabilization would be nice- I deleted several shots that could've been saved if the A630 had that.I don't really regret buying the thing but Canon needs to improve a few things before I'd be really happy about my camera.", "Date": "May 6, 2007"}, {"Title": "Very pleased", "Author": "Andrew L. Lopez", "ReviewID": "RR9WO4R40JRPK", "Overall": "5.0", "Content": "I've only had this camera for a little under a month, but so far i have seen nothing that has been a problem. It takes great pictures, and is easy to use. So yeah overally very happy with this purchase.", "Date": "March 13, 2007"}, {"Title": "Bad photos in low lite, week auto focous", "Author": "Elio Y. Haddad \"Elio - Nur\"", "ReviewID": "R3FXE8WTKUBKIX", "Overall": "2.0", "Content": "The camera has some good manual functions, but it lacks a good sensor for low lite photos. It has a good macro, but it works only with manual focus that works very slowly. the lcd is small with a very low resolution and brightness.The configuration of the camera is good, but it needs new sensor, new auto focus sistem and a new lcd.", "Date": "July 12, 2007"}, {"Title": "Excelente", "Author": "Nobrega Landa Juan", "ReviewID": "R1LACE0TUC69", "Overall": "4.0", "Content": "Esta Camara no solo toma fotos espectaculares en modo automatico, autoajusta, elimina los ojos rojos y demas cosas. lo Que no logro conseguir es que dispare las fotos en tiempo, osea programar la foto.Como si fuera poco los videos que graba son de muy buena calidad, con poco sonido pero muy buenos...", "Date": "May 17, 2007"}, {"Title": "Picture quality in midimum light", "Author": "UB \"UB\"", "ReviewID": "R1S04ATL1R65AK", "Overall": "2.0", "Content": "I bought this camera after good review from my friend for previous version which was 5 MP. This camera is more in weight and the biggest problem is picture quality when light is midium or low. It did not function well at all while we were taking picures in banquest hall with more yellow light as well as same problem when we took pictures in basement with regular light. The light in banquest hall and basement was really good enough for taking pictures as other cannon camera with 5MP did really good job where as this A630 completely failed to show good results. each pictures was yellow, I try to take it using night shot, that was even worst as there was alreay enought light. I think this camera is getting confused on auto flash.I am going to probably going to garbage this camera, it is completely waste of my $.", "Date": "May 14, 2007"}, {"Title": "It may die after two years of use", "Author": "Super Man", "ReviewID": "RBMC3TWCKEZQ9", "Overall": "2.0", "Content": "I owned a Canon PowerShot A610 and it turned a black screen on me after two years of use. Other buyers also had the same problem with A610. It may happen to A630 too. You are probably happy too early. It is not a good value because the A610 is really a disposable camera disguised as a good value buy. This can be true for A630 again.", "Date": "May 24, 2008"}, {"Title": "Broke down within a month", "Author": "Georg Birgisson", "ReviewID": "R2HGFMOWNT3EOY", "Overall": "1.0", "Content": "After using the camera for less than a month the on/off button stopped functioning and now there is now way to turn on the camera.", "Date": "April 18, 2007"}, {"Title": "Happy customer", "Author": "P. Henry \"mercedes_34\"", "ReviewID": "R2PGFH9R0MHKI9", "Overall": "5.0", "Content": "Product arrived in said condition. Still working well. Shipping could have been faster, but I attribute it to the free \"super savings\" shipping...", "Date": "March 14, 2007"}, {"Title": "DOA", "Author": "G. Robinette", "ReviewID": "R2T6D7XB1N969W", "Overall": "1.0", "Content": "Item was DOA out of the box because it the focal length adustment wouldn't function. Amazon quickly returned it for a full refund and I found it at another vendor for less money.", "Date": "January 3, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "8-megapixel CCD captures enough detail for photo-quality 16 x 22-inch prints\n4x optical zoom; 2.5-inch vari-angle LCD display\nISO range up to ISO 800 for less blur in low light while hand-holding\n3:2 guide masks LCD to display 4 x 6-inch print size; 16:9 format option for still images\nStores images on SD cards; powered by 4 AA-size batteries", "Name": "Canon PowerShot A630 8MP Digital Camera with 4x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51AG8V52PEL._SX300_.jpg", "ProductID": "B000HAOVC6"}}