{"Reviews": [{"Title": "Solid Camera very well suited to first time users.", "Author": "Peter R", "ReviewID": "R1DP1QGW6YTNKZ", "Overall": "5.0", "Content": "Spent a lot of time looking for reviews on this camera without luck -- so I thought I would post one.Bought this for my parents who have never used a digital camera so ease of use was of primary concern.  From that perspective it's a home run.  It is much more intuitive than the other digital cameras I have owned/used.  Low-light usage is (predictably) not as good as my D-SLR (forget the 8000 ISO from a practical standpoint, but at 800 it performs well).  Shutter lag is on par or better than other Point-and-shoots I've used (hardly noticeable).  Supports about 15 or so languages.Pros:- Very easy to use. Intuitive Menus and features.- Decent low-light performance.- Good color and auto adjustments.- Nice in-camera feature set: Automatic digital red-eye removal, photo stitch, crop, etc (these work well enough for novices, but you'll probably want to use a computer based program if you are going to set it up)- Relatively comprehensive and well laid out manual control mode (white balance adjustments are missing, but does have things like independent exposure controls and adjustable exposure bracketing).- Relatively compact but not so small that it feels fidgety- Built-in orientation sensorCons:- Screen has a relatively low resolution (would give it 4.51 because of that)- The High-ISO mode (selectable) was either too grainy or smoothed out for my liking in my test shots.Final thoughts:- Be sure to buy some decent rechargeable batteries with the camera.  Alkaline AA's won't last long.- The included Kodak software is OK, but a little clumsy.  Picasa (free) is simpler/more efficient to use and has a very good feature set.", "Date": "July 3, 2007"}, {"Title": "This Camera Packs a Lot of Digital Punch!", "Author": "Robert L. Stinnett", "ReviewID": "R37QXJ1JU5EH6F", "Overall": "4.0", "Content": "Over the years I've owned many digital cameras; at last count I've owned about 8 cameras in a little over 7 years.  With digital camera technology changing so much I've always liked to keep up with the new features, but have always been hesitant about spending a lot of money on a camera because I knew that in a few months the technology would change again, or (worse yet) I'd end up breaking it and have to buy a new one!I picked up the Kodak Z885 after my prior digital camera bit the dust after spending a little too long in a hot car.  I initially picked up the camera because I had previous Kodak cameras that were high quality and because it was the only affordable digital camera in the 8.1MP range that offered the features I was looking for.  I'm happy to say, 4 months later, I made a great choice in chosing this camera.How many megapixels is enough?  When it comes to detail, the more megapixels the better.  That's why the 8.1MP of the Z885 caught my eye.  When taking pictures with the high quality mode you can expect to get images that are very crisp and bring out a lot of the smaller details of the subject you are focusing on.  And speaking of focus, a feature of this camera that I have put to use a lot is the ability to pre-focus the lens on your subject and have the camera actually show you what it is focusing on.  By using the LCD and pushing halfway down on the trigger button the camera will focus in on area (or areas) and bring up green rectangles to show you what it is focusing in on -- I've found this invaluable for close-up shots with busy backgrounds when I wanted to make sure the camera was focusing in on the foreground and not the background.Another impressive feature of this camera is how well it takes pictures in low-light.  The camera does have a built-in flash, but I have found that it takes exceptionally good pictures without using the flash well until dusk.  Most cameras cannot handle low-light well, but the Z885 certainly excels in that area.If you are looking into this Kodak camera, or any Kodak camera, I highly recommend that you also invest in the Kodak EasyShare Camera Dock Kit.  For one, it makes recharging this camera a snap when using rechargeable batteries, but even more importantly it provides one-touch easy access to the internal and memory cards for pulling the pictures off to your PC without having to worry about attaching cables.  Trust me, even if you only take a moderate amount of pictures, the dock will pay for itself in no time flat.Overall, the Z885 packs a lot of punch for a relatively low price.  It's a great camera not only for everyday use, but is also perfect for those close-up shots you might want to grab.  With its 5X optical zoom, it also delivers good, crisp results for objects in the distance.  The only drawback to this camera is the lack of a viewfinder, but after you use the auto-focus features on the LCD you'll be left wondering how you ever got by with a viewfinder on your previous cameras!", "Date": "September 25, 2007"}, {"Title": "Not Kodak's best work", "Author": "P. Stevenson", "ReviewID": "R2R6SYK1AWCHVS", "Overall": "2.0", "Content": "Two years ago I got the Kodak Z760. A few months ago it was stolen, so I bought the Z885 to replace it. According to Kodak's specs, the Z885 was better than the old Z760 in every way: it offered more built-in settings, more video options, higher megapixels, and more zoom.Unfortunately, this camera has been a MAJOR disappointment. Kodak's built-in settings (SCN options) are a great way to get the right flash, shutter speed, focus, etc. for your subject by scrolling through the different options very quickly. On the Z760, these worked great (i.e. you'd choose \"action\" setting for action shots, \"close up\" setting for close up, etc.) On the Z885, these could not possibly be worse. The action shots are always blurry, the close up shots are out of focus, the portrait setting gives everyone redeye, arrrgh!! The flash on this camera is too bright (I eventually figured out how to lower the brightness of the flash in the manual settings), and pictures taken without the flash are, of course, blurry. Sometimes the pictures even look grainy, a problem I have never seen on a digital camera.Everything I've photographed indoors usually has to be photographed 3 or 4 times (each time changing the settings) to get the right conditions, and for the most part, I'm trying to photograph my baby; I don't get 3 or 4 chances at those quick smiles! Also, this camera has a delay that you wouldn't believe, I know what Kodak says it is supposed to be, but it feels like a full second before it takes the picture (again, photographing babies is especially difficult with this problem.)The lack of viewfinder makes photographing in bright outdoor conditions very difficult, sometimes impossible. I tried to photograph someone waterskiing, but several times ended up with pictures of just waves because I couldn't see that the person wasn't even in the frame!Based on the specs of this camera, you think it'd be pretty sweet, especially for the price. But who cares if you have 8.1MP and 5x Zoom if you can't get a decent picture in the first place?!The only reason I give this 2 stars instead of 1 is the panoramic stitch feature, something Kodak recently added to most of its cameras. It works great and is really awesome for taking panoramic shots. I give the panoramic stitch 5 stars, but I'm disappointed in everything else. I can't figure out why Kodak's new product isn't as good as the one they made 2 years ago.", "Date": "August 21, 2007"}, {"Title": "great all around camera", "Author": "kj \"chicagomom\"", "ReviewID": "R202RT2SEDPKF6", "Overall": "5.0", "Content": "I bought this camera along with the Kodak Z612 b/c I also wanted a smaller one to fit in my purse or diaperbag.  This camera is great, there is only one negative, that it does not have a viewfinder.  However that ONLY affects me when I am in super super bright sunlight that is reflecting on the screen which is not that often.  It is great in auto mode, movie mode, sports, etc.  The 5x zoom is more powerful than I thought it would be.  For the money you can't go wrong with this one at all, it is quick and super easy to operate, you don't even need to read the manual to operate it.  The functions and icons are self explanatory.  Once you buy this kodak and register you have access to Kodaks website and galleries where they have tons of hints and the extended user manual if you ever needed to look anything up.  The camera is sharp looking too.  Has great Fireworks mode.  I took it to an outdoor baseball game, it took great pics in ALL light even at dusk.  I was truly amazed.  The stabilization is pretty good too for this camera.  It also has vivid/high color mode and makes the colors bounce off of the page.  Try it you will love it.  Beats all the other cameras out there in this option range, the canon elph, panasonic, sony, and hp etc. can not compare with the feature's and ease of use of this one.  I have two kids and I need to turn it on asap and operate it, that is one feature that will always be the best with Kodak.I only wish that this came with a lithium ion battery instead of AA's, however, you can add rechargable's, I strongly advise them.", "Date": "October 2, 2007"}, {"Title": "This camera is Great", "Author": "Eddie Little \"EddieL\"", "ReviewID": "R29NRKL2GUJRNY", "Overall": "5.0", "Content": "If you choose this camera go ahead and shell out the bucks for an SD card and the dock.I've never been crazy about the easy share software but it works best to get the pictures from the camera to the computer.In the fully automatic mode taking great pictures is a no brainer, as for the more advanced stuff , it will do a time exposure of up to 8 seconds which makes it usable for some astronomy photos. I photographed the last lunar eclipse and just for kicks, the Orion constellation.as for the video mode, at 640x480 you can get some pretty good stills from your videos.I would prefer videos that were in Windows media format, but the quality is great.This is the best digital camera before you move up to the next price range", "Date": "September 13, 2007"}, {"Title": "my easiest camera", "Author": "Richard Tobiassen \"toby\"", "ReviewID": "R19ZAQ8VJWBM1A", "Overall": "5.0", "Content": "I love this little camera........fits in my pocket and works very well for the pictures i take.....i like the software.............and i ordered some blow ups,they came out great...........", "Date": "August 25, 2007"}, {"Title": "I love this camera!", "Author": "Melinda J. Bass \"makadamia\"", "ReviewID": "R2F8UEUY2LL9S3", "Overall": "5.0", "Content": "I went back and forth on three different Kodak cameras and this one by far was the best choice.  The other two were the Z710 and the Z1285(12 MP).  This camera is compact - which is what I was looking for - and it has all the features of the other two.  The clarity of the pictures is incredible, and the menus are very easy to follow.  The only drawback I find with the camera is that I seem to go through batteries fairly quickly, although not as fast as the 12MP model.  Overall, I would highly recommend this camera.", "Date": "February 11, 2008"}, {"Title": "battery drainer", "Author": "foofoo", "ReviewID": "R2KU90PFP00VOS", "Overall": "2.0", "Content": "I like this camera better than our old Kodak DX.  It's smaller and faster.  I like that the on/off is a separate button.  With the DX, I have to go from auto mode to off to video mode.  What I don't like about the Z885 is that it eats up batteries like crazy.  I like taking pictures and videos of my kids.  Many times, I miss the precious moments because the battery had drained.", "Date": "February 11, 2008"}, {"Title": "Great camera for the money", "Author": "M. Gorman", "ReviewID": "R1ED1MZAULV6R1", "Overall": "4.0", "Content": "I purchased this camera after comparing brands and models in the $100 - $200, 6MP+, point and shoot range.This camera offers a lot for the relatively low price. There are a ton of features for adjusting your image. From MP selection to full P/M mode to multiple preset scene settings. Multiple Auto-focus settings. Menus options vary based on selector position. It is definitely versatile.The image stabilization and ISO settings produce exceptionally noisy shots. In good or standard lighting you will generally get great shots. In low lighting, no flash or full zoom you tend to get a slight blur unless you've got a super steady hand. Still, there are enough ways to adjust your image when needed.Pros for me. Uses AA's and SD card. The camera and controls have a nice solid feel to them and operate smoothly. That includes the battery and memory doors. Fast on. The camera defaults to about a 3 second picture review after each shot but you can interrupt that by taking your next shot. Shot to shot time is very good. Even switching between modes allowed for fairly speedy shots. The on screen information is all very useful. In P/M mode you can display a real time histogram. They also display in review mode. You can choose to display a framing grid and have multi-zone auto focus. Or you can turn those features off. I've have this for two days and I'm still working through all the options.Some downsides, in no particular order. The lens remains extended while in review mode. No view-finder. The previously mentioned photo noise issues. The battery level indicator doesn't come on until it's getting low. Can't disable picture review or on screen help (it displays a short description of the camera mode when you switch to it). If you zoom in movie mode the zoom noise is quite loud on replay.Another consideration is that this is an Easy Share product and so the camera is just another cog in the Easy Share machine. The camera incorporates Easy Share features like creating galleries, favorites, keeping address books in camera and using USB or the optional dock to do one touch transfer and synchronization. Then you have the option to use the Easy Share software to share prints on line or order photos or merchandise. (For photo review/correction the software does an ok job).  If none of these interest you then they are just useless features. However the Easy Share experience is not intrusive or insistentand you can either use or not use the features and I like that Kodak has taken this approach.This is a good solid middle-of-the-road camera that should perform well in a variety of situations.Edit: I find that I'm deleting more pictures than I'm keeping, which is disappointing. I have to drop this rating from a 4 to a 3 (although I can't change the official rating). Unless your using a tripod or other steady surface there is no way to take a clear shot in low light or full zoom. I'm really torn because I love the form/features of this camera but  the pictures, unless you're shooting with a flash or substantial light source, just don't measure up.", "Date": "January 12, 2008"}, {"Title": "I got the reject", "Author": "D. Hemond", "ReviewID": "R2W1ASSQNQ0B44", "Overall": "1.0", "Content": "I had to replace another Kodak EasyShare camera before my trip.  With several positive reviews, I was excited about the 8.1MP, which worked with my docking station/printer.  So I discounted P. Stevenson's review.  But oh, did P. Stevenson's review hit EVERY PROBLEM this camera had!  I have never written a review but had to with this product.The display looked blurry from the start.  I tried 3 times to get a decent shot of our Christmas tree using 3 different settings.  And the close-up pictures focused before the lens went out of focus to take the shot.  Using TEXT was the only way to get a decent close up shot after trying SEVERAL other setting attempts.  Don't attempt moving shots.  The moving subject had 5 \"ghosts\".At first I thought the blurriness was just in the display.  Yet when I saved the pics to the SD and transferred them to a PC, the blurred pictures were horrible!  I do miss having the viewfinder which was available in my other EasyShare.I do have to admit that the 5x Zoom was nice.  However, not enough for me to keep the camera and deal with the unexpected problems.", "Date": "December 16, 2007"}, {"Title": "Good Camera, Bad Battery", "Author": "Mr Campagnolo", "ReviewID": "R2KP419SOFDGNL", "Overall": "1.0", "Content": "Well, I loved the camera itself, but the battery was not good. It always said low battery. I tried evrey battery, even the ones recomended online and in the instructions. When I tested my batterys in my battery charger, the charger said they were ok, and my second one said that, too. It had good pictures, and all the features were useful. Pros: Good quality pictures, lots of camera modes, videos. Lots of MPs and alot of optical zoom. Cons: Bad battery rating, hard to hold the camera, doesn't come in lots of colors, has more noise when using the image stabilization.  I DO NOT recomend it, your going to find yourself buying A LOT of batterys if you buy it.", "Date": "February 5, 2008"}, {"Title": "My 5th Kodak camera", "Author": "Judy Gregerson \"All things are possible to hi...", "ReviewID": "R386R2JPD0ODR0", "Overall": "5.0", "Content": "Yep, I stick with Kodak. I bought one of their first digital cameras and it still works, so I was confident in buying this one for my daughter for Christmas. She loves the ease of Kodak and the quality of the pictures. You'll be happy with any Kodak you buy, but do not buy them refurbished. We made that mistake. But new? You bet!author of: Bad Girls Club", "Date": "January 11, 2008"}, {"Title": "Downlaoding pics to the computer - complicated", "Author": "Maven \"Pc Maven\"", "ReviewID": "R2B1MBRPZKE4XA", "Overall": "2.0", "Content": "The quality of the pics wasnt impressive at all....but downloading them to the computer was worse....it wasnt as friendly as with the previous cameras I used to have, Canon and Fuji. I would need to buy the dock to make d/l to pc easy, they at least should have sold it as an enissial accessory with the camera, included in the price.", "Date": "August 6, 2007"}, {"Title": "Good item but bad LCD resolution", "Author": "Jaeho Park", "ReviewID": "R3JKQLRF81DSM3", "Overall": "4.0", "Content": "A lot of function, easy to use, good quality of picturs, AA battery.Due to the low resolution of LCD, it cannot be a excellent one.Whenever checking the pictures in the LCD, You might always thought why you bought this one.But Pictures in your monitor and prints, there might be no more complains.", "Date": "September 6, 2007"}, {"Title": "Kodak Z885", "Author": "C. Pedotto", "ReviewID": "RGQ000YRZ0WW8", "Overall": "4.0", "Content": "I really love my new camera.  I haven't had time to figure out all the quirks, but here goes:Good: Optical Zoom, Video recording, manual settings, can change pixel size, small, light weight, easy to useBad: Cannot zoom when recording video, hard to capture moving objects in low light (concerts), software is very slow, must use software to load pictures from camera", "Date": "July 16, 2007"}, {"Title": "Great camera but.....", "Author": "Rad63", "ReviewID": "RW4AJB3A7G225", "Overall": "4.0", "Content": "I have used the Z885 for a month. It is versatile and gives you a lot for the money. It has one glaring deficiency and that is the absence of a view-finder. I tried to take some beach and pool pictures in Florida. I could not make out an adequate image on the lcd and could not get good pictures. I would really like to see this camera at a slightly higher price and a view-finder.", "Date": "December 16, 2007"}, {"Title": "Good but needs some improvements.", "Author": "William Carr", "ReviewID": "R2JP859KDRLR6K", "Overall": "4.0", "Content": "The main problem I find is with an owner/operating manual.  You download the CD rom Easy Share; some instructions are very clear, others are vague.If you are new to this type of camera and often refer to the operating manual it is incomplete and one must go to the Easy Share CD which presents a problem if away from your computer. So far, as I experiment with the Z885 I'm pleased.", "Date": "August 31, 2007"}, {"Title": "Very Picky about Batteries", "Author": "J. Lopez \"Bargain Hunter\"", "ReviewID": "R3TY25Y7TVISNC", "Overall": "3.0", "Content": "I use rechargeable batteries with this camera and I have to recharge them right before I use them on this camera every single time. I thought I just had crappy rechargeable batteries but I tried different brands and I get the same result. If I use batteries I charged 3 days ago it wouldn't work. It probably has something to do with Rechargeable batteries having 1.25V as opposed to Alkaline batteries having 1.5V. When I use Alkaline batteries, I have no problem.  The Pictures come out great though... when it works.", "Date": "March 16, 2009"}, {"Title": "Camera Review", "Author": "roy j hammond", "ReviewID": "R2RQOZP1NEK5G5", "Overall": "5.0", "Content": "This is simple easy to use camera. The telephoto lens is amazing, and the 8.1 mega pixel pictures are superb. I love this camera. Batteries seem to last and last.Threw my wifes old one away and brought her one of these. Super value for a low, low price.", "Date": "November 30, 2008"}, {"Title": "Very Good, for Steady Hands...", "Author": "Milcka Carrera \"Studio Owl\"", "ReviewID": "R2KWDF93CN3OJE", "Overall": "4.0", "Content": "When I bought this camera, I was very Excited. It captures with a professional style any photo, but it has serious problems with Motion Performances and specially with ISO-taken pictures. It looks a lot grainy and with extremely high noise. I tried everything to fix this, but is not possible. The video capturing is very good, and also the Smart Scene and Scenes Options are amazing. The Manual option is also great. The problem is Motion and ISO pictures.The Zoom its outstanding...For Semi-Prefessionals, I give it 3.8/5", "Date": "September 28, 2008"}, {"Title": "Kodak EasyShare Z885 8.1MP Digital Camera", "Author": "K. Young", "ReviewID": "R1LYZS6TH164IJ", "Overall": "5.0", "Content": "This camera was bought as an upgrade replacement for my older EasyShare camera.  Do not regret this purchase.  What a great camera.  Easy to use. Beautiful photos and it can take movies with sound as well (which can be downloaded to your Kodak Gallery to be saved). Only warning is that the dock adapter offered on Amazon (as well as other sites) is NOT compatible.  You must purchase a new dock specifically made for this model.  I purchased the adapter  thinking I could save by using my old dock, only to have to return the adapter and buy a new dock.  Guess I did not save any $$.  Very happy with this camera.  Amazon delivered quickly as usual and refunded my dock adapter purchase quickly.  Thanks Amazon!", "Date": "April 5, 2008"}, {"Title": "EASY---Kodak Easy share Camera", "Author": "Gwenlyn L. Smith", "ReviewID": "R1O5HM484ZCBWY", "Overall": "5.0", "Content": "This is a very easy and great camera. It takes awesome pictures. Very user friendly. I like the small size. It easily fits in a pocket. Take it every where. I love it !!", "Date": "February 17, 2008"}, {"Title": "Great Starter Camera", "Author": "Kaedy", "ReviewID": "R3HCLTXKTE1V4H", "Overall": "4.0", "Content": "I got this camera for my Mother's Birthday.  Her old 35 mm film camera died on Christmas day.  Between the batteries and the film she was putting a lot of money into making memories.  My mom isn't real good with the new generation of tecnology but she is willing to try.  This camera has been so easy for her to use and she is loving it.  The second day she had the camera it snowed, real snow not ice, in Georgia.  She got some really good pictures and isn't as afraid to try new things because she can \"see\" what she is capturing.  As most of us remember the film cameras was a wait and see kind of thing.  The rechargable batteries really hold up and she is please with that as well.  Great camera for beginners.", "Date": "February 8, 2008"}, {"Title": "Kodak Z885 review", "Author": "RayBoy", "ReviewID": "R3G38SLC913PGD", "Overall": "5.0", "Content": "Bought the Kodak Z885 for my daughter.  She has been interested in digital photography since using my Kodak D7630 camera.  The camera is a birthday gift that was recieved with great enthusiasm.  We both like the 5x optical zoom and easy operational steps.  We were able to go through the features on the camera without a problem and are pleasantly impressed with the clearity of captured images.", "Date": "January 29, 2008"}, {"Title": "quality", "Author": "Lauren K. Conklin", "ReviewID": "R2XIE9WCX18OAY", "Overall": "5.0", "Content": "Brand new camera, cheaper on amazon than at kodak.  received the package the week before christmas, less than 6 days promised.  no complaints.", "Date": "January 13, 2008"}, {"Title": "Great Camera for the Price", "Author": "Family of Five", "ReviewID": "R2OSJYETH8L2M2", "Overall": "5.0", "Content": "I was looking for a small camera with a decent zoom and good resolution. To replace my older Kodak that was only 2mp.  This Camera met all my needs.  It takes very clear pictures even in low light 8.1mp.  In low light the view through the view finder is an orangy glow but once the flash takes the picture they come out great.  Also the delay to take a picture is very minimal so unlike other camera your subject hasn't moved from the time your press the shutter button to actual picture.  Has some great features too, and the ability to do all manual settings of the exposure, flash, picture editing, panaromic, distance etc.  But I usually just use the automatic settings.  I almost purchased the M and V lines from Kodak but although those cameras may have better styling and are a bit small they sacrifice picture quality and features.  I do believe this is onw of the best, easy to use cameras on the market.  And have been using the easyshare software for atleast 5 years now, and it works very well.  You will have the camera out of the box sofware loaded and in use in an hour.  No problems with software, and the camera even has a tutorial built in so if your not sure of the functions the camera tells you what they are.  You don't even need the manual.  Very inovative camera.", "Date": "December 20, 2007"}, {"Title": "Perfect value for the money.", "Author": "Ms. Victor Tsan", "ReviewID": "R2P13KQZEVALMT", "Overall": "5.0", "Content": "This is not a high end professional equipment, however I can't find any cons to bring up. Works good and a great value for the money. High quality images made in dark room.", "Date": "November 8, 2007"}, {"Title": "Kodak Easy Share", "Author": "E. Joseph White", "ReviewID": "R1KSRW5A7PR0E1", "Overall": "4.0", "Content": "Camera has all of the features I wanted. It's easy to crop pictures, and their Easy Share program is great at downloading, enhancing, grouping pictures for printing on a PC, etc.", "Date": "August 23, 2007"}, {"Title": "Z885", "Author": "HLF \"Grandpa Howie\"", "ReviewID": "R2BK24SHW0HRO7", "Overall": "4.0", "Content": "I had two other Kodak Digital cameras (LS 743 & C875)  The C875 was stolen in Argentina (don't go there - high crime).I purchased the Z885 as a replacement.  However, when I recived it, it did not have an AV cable which was included with the other two cameras - it is a $25 extra charge which is a significant price increase.In addition, the Z885 will not play the videos from the old cameras and will not crop the old photos.I sent 3 different e-mail questions to Kodak support and the answers did not answer the questions.  It seems as though they either didn't read the e-mail or don't understand as they answered questions I did not ask.  I called phone support and finally did get answers to my questions.I suggest you consider these factors in buying your camera.", "Date": "July 26, 2007"}, {"Title": "I like this Camera", "Author": "tjuana", "ReviewID": "R239PSEP1HENQ3", "Overall": "4.0", "Content": "I like this Camera a lot.  The only thing I had a problem editing my video's with windows live movie maker.", "Date": "December 10, 2013"}, {"Title": "A great camera !", "Author": "kathy santy", "ReviewID": "R391AFII5BDBAD", "Overall": "4.0", "Content": "I was surprised that I had to buy new batteries the day I got it  but otherwise I find this camera very easy to use and the pictures turn out really good.  I bought my first Kodak Easyshare in 2007 . I am a realtor and it's important to have a camera that works when you arrive at a listing to take pictures. I've always gotten rechargeable batteries. This camera came with regular batteries. It was a new camera but they were dead when it arrived. I replaced them and I'm very happy with how the camera has been working since.", "Date": "December 9, 2013"}, {"Title": "Kodak Z885 Digital Camera", "Author": "William E. Thom", "ReviewID": "R1OEE45CAUVHJ1", "Overall": "5.0", "Content": "I've had three of these Z885's! My daughter liked mine for the quailty photos of the Grand Kid's sporting events, birthday parties and critter/insect close ups. She ran video and put 1440 photos on my SD card! So, I gave her mine and ordered another one from Amazon!I used mine for close ups/videos of operating machinery. I could e-mail the results to my Boss for claims adjustments. A neighbor kid dropped my daughter's Z885(1st) and broke it! I gave her mine(2) and have another Amazon Z885(3) on order. I kept my SD Card!!", "Date": "November 30, 2013"}, {"Title": "Great camera", "Author": "L. E. Como \"Truthteller\"", "ReviewID": "R3SHW54MW0RO7Q", "Overall": "4.0", "Content": "This is an exceptional camera.  It takes high quality photos and is not short on extra features.  I highly recommend it to beginners and point and clickers, however, Amazon has it WAY WAY overpriced at a whopping $400.  Shouldn't pay more than $150 or so for it.", "Date": "August 8, 2010"}, {"Title": "my last kodak", "Author": "poohsticks1", "ReviewID": "R3VA6YWZFTIAY2", "Overall": "2.0", "Content": "this was my 3rd in 3 generations of kodak digital cameras and was my least favorite. it had a problem with unrecognized file error. every so often a picture would come up corrupted and was an unrecognized file format. so far all these pictures are lost. i have the files but there is no saving them (at least not yet). then there was the problem where the camera needed to have the date and time reset after every battery change. this was originally not a problem until after the first year of service(?). and then there was the occasional out of focus picture and difficulty in low light situation. the problems happen enough to make it really annoying. i really didn't have these sorts of problems with my previous 2 kodaks.  after 3 years suffering with this camera, i am done. i got a canon a1100 is and it really works great. the a1100's run is about a year now (came out around march 2009) and it's been replaced by the a3000 is and a3100 is. the difference is the optical view finder is no longer available and it no longer uses AA batteries (this was a real convience of the a series). also the digic 4 processor is replace by the digic 3. yes, 3 replaced 4?! at $129, anyone considering the canon a1100 is should act fast before they disappear for good", "Date": "April 6, 2010"}, {"Title": "Great Camera....Until I Suddenly Died", "Author": "M. Baca", "ReviewID": "R328NDZRY3UI65", "Overall": "3.0", "Content": "This review is for a product that has obviously been superceded, but....to whoever reads this, this is for you.The Kodak Easy Share Z885 is an easy to use camera for the computer illiterate. The menu consists of easy to recognize shapes. The camera itself acts like a computer allowing you to sort, select your favorites etc. It even allows you to do image improvement, sort of like a mini photo shop editor.Photos are incredible. THe camera also has a multi picture feature that takes like 10 photos in a row so you can catch moving scenes, such as a kid blowing out candle. It also had a great panoramic feature that created some mind blowing shots.I had this camera for about 2 years when it suddenly started draining batteries faster than all get out. A new battery would last about 20 pictures. I hooked a voltmeter to the battery and it had basically went from 100% to about 75%, which according to the camera, was not enough to give it life.I researched the problem and found many people recommending quality batteries, rechargable batteries etc. but obviously the camera's problem is internal, since the problem is new and was not there for 2 years.The general price to get your camera fixed is around $100, if you're lucky...meaning I'm going to go buy a new one and retire this one to the kids room.Would I buy another Kodak.....ummm maybe. Great camera while it worked. Just didn't expect the life to be 2 years.", "Date": "January 7, 2010"}, {"Title": "Kodak Z885", "Author": "Boggie Boy", "ReviewID": "R1TK1RJJ6J7SVV", "Overall": "3.0", "Content": "I should have listened to the reviews I read before I purchased the Z885. The absence of a view-finder is a serious problem when taking pictures outside-especially if the sun is shining. You absolutely can not see what you are trying to take a picture of. Its really too bad because I like the number of pixels and the zoom is excellent. The camera takes great pictures inside and outside. Inside you can see your target fine; outside-you need to take a lot of extra shots to ensure you take the picture you want. Can't do that with grandkids,etc. Ok for static scenes outside (with extra shots). So, I am now looking for another camera.", "Date": "September 14, 2009"}, {"Title": "helf", "Author": "tamuna55561", "ReviewID": "R2WK3U472UL0PF", "Overall": "2.0", "Content": "please helf.I have kodak z885. i take good pictures, but when my digital camera dont switch on....I have this 4 week.", "Date": "September 9, 2009"}, {"Title": "EasyShare Z885", "Author": "Pat \"Pat\"", "ReviewID": "R1LCLEEPOVJBXQ", "Overall": "4.0", "Content": "I thought it would have image stabilization all the time but that is a mode all of it's own.", "Date": "August 15, 2009"}, {"Title": "Excellant Value", "Author": "G. Pattison \"geopatt\"", "ReviewID": "R3F6U00E7IVN0N", "Overall": "4.0", "Content": "I bought this camera for $99 and it is an excellent value. I takes great pictures and it's 8 mega pixels are enough for most pictures.  My only complaint is it needs an optical viewfinder if pictures are to be taken in bright sunlight.  It is difficult to see the LCD screen on bright sunny days.  But under most conditions it works great.  I would recommend this camera.", "Date": "August 7, 2009"}, {"Title": "We love this camera!", "Author": "Darcy Brown \"Darcy\"", "ReviewID": "R3MS6MT4AKT63L", "Overall": "5.0", "Content": "I bought this camera for my husband.  I thought since I already had a Kodak easyshare, that I would stick with what I know.  He took it with him on his fishing trip and he loved using it.  It makes great pictures!  The price was right and I feel like I should replace my old camera very soon!", "Date": "December 1, 2008"}, {"Title": "Nice and practical!", "Author": "Alvaro Santos", "ReviewID": "R219R71KDIGNSD", "Overall": "5.0", "Content": "I bought this Camera a few days ago and I have taken excellent photos with it. It is compact and has several interesting functions. It is cheaper than others but it is a Kodak. I like this one.", "Date": "September 1, 2008"}, {"Title": "GREAT picture - BUT...", "Author": "Big Dad \"computer guy\"", "ReviewID": "R3D5WJLLBZEMCN", "Overall": "4.0", "Content": "Camera takes a GREAT picture, but it broke the first time it was used! I have sent it back to Kodak for repair, but that adds delay and additional cost! Hope the next one is repaired instead of just repackaged!!!!", "Date": "August 28, 2008"}, {"Title": "very happy", "Author": "Kendra Weller", "ReviewID": "R1CDUSAL16M077", "Overall": "4.0", "Content": "I gave this as a birthday gift to my husband and he really liked it a lot.  It wqorks the way he wants to and is small and portable.", "Date": "July 1, 2008"}, {"Title": "Kodak has outdone themselves", "Author": "Kathryn L. Glass", "ReviewID": "R3Q137CMTHM7NZ", "Overall": "5.0", "Content": "I love this camera. The picture quality is great, the video is amazing, I attempted to make a video of this review but after reviewing it, I decided that typing is what I am better at.I went to Sea World San Diego this past Saturday and tokk 97 pictures and even some video. I am still finding out the amazing things this camera can do.BEST INVESTMENT I HAVE EVER MADE!!!!!!!", "Date": "June 24, 2008"}, {"Title": "Do Not Buy!", "Author": "Jules \"Jules\"", "ReviewID": "R3RWYT2LY4KLZH", "Overall": "1.0", "Content": "I have had this camera for six months and have been very disappointed.  Almost every picture has red eye, some are grainy and the flash is useless.  I have missed many important pictures because this camera does not work well inside.  If you are taking pictures outside in bright sunlight it is excellent.  If you are taking pictures of your children moving outside it is great.  Sadly any picture taken indoor is not good.", "Date": "June 15, 2008"}, {"Title": "Best Camera Ever", "Author": "Louise M. Di Carluccio", "ReviewID": "R1SNUMP5L8WT3F", "Overall": "5.0", "Content": "I love this camera so must that this is the second one I bought for my dad for father's day. It is very easy to use and take wonderful pictures right out of the box. The price makes it affortable for anyone and the soft wear is wonderful. You can do so much with your pictures for free with most of the soft wear and easy to use. You can upload and share big picture files that they can use for free to see and down load. I tell everyone about this camera and that Amazon has the cheapest price.", "Date": "June 13, 2008"}, {"Title": "Good camera!", "Author": "Robert D. Thomasson \"weather geek\"", "ReviewID": "R1140JQGEIGUNS", "Overall": "4.0", "Content": "Kodak EasyShare Z885 8.1MP Digital Camera with 5x Optical ZoomThis is a very easy camera to use and functions well for digital photos as well as video. It transfers seamlessly to the computer and has stunning pixel display.  I've only had this camera a few weeks but I really like it! When you transfer photos from camera to pc the software asks if you would like to delete all photos currently residing in your camera.  The photo button trips quickly, which comes in handy when trying to capture those fast-moving kids!", "Date": "March 20, 2008"}, {"Title": "Northern Wis review", "Author": "Wisconsinite \"Ann\"", "ReviewID": "R1JUO73V8JIN7S", "Overall": "4.0", "Content": "This camera is very easy to use.  It is the first digital camera I have own.  I like the features where you can edit your pictures if they are not exactly what you want.  Also the different settings for taking pictures in snow, with candles etc. very nice features.", "Date": "February 8, 2008"}, {"Title": "Very Decent camera", "Author": "Hans E. A. Schweikert", "ReviewID": "R11Y48X3F46SKZ", "Overall": "4.0", "Content": "Camera works very well, pictures are of very good quality at 8 megapixels. One drawback is that when you remove the batteries for charging, it loses the date and has to be reset. Supposededly, a docking station (extra charge) eliminates the need to remove batteries. Also, there is no \"Easy Share\" if you are running older operating systems, like my Millenium Edition. Guess I now need a new computer to print or email my pictures. I suppose Walmart could at least do printing.", "Date": "January 30, 2008"}, {"Title": "Excellent Point an shoot camera.", "Author": "Shaun Marts", "ReviewID": "R11JWUE14K7082", "Overall": "5.0", "Content": "I purchased this as a Christmas gift for my aunt and uncle to replace their aging and slow DX4530 kodak this unit is a million times better as far as focus and shutter speed. Also the 5x optical zoom is a great benefit not usually found in cameras of this price range and works great. All in all I highly recommend this for the basic user as it is easy to use and creates beautiful photo's.", "Date": "January 20, 2008"}, {"Title": "Great price", "Author": "B. Moores", "ReviewID": "R161S899NLDWM", "Overall": "4.0", "Content": "It is a great camera for choice if money is the problem.It has many great features.There is a problem with taking a high ISO image between the shutter and the flash.The camera image will look jarred from the shutter opening and closing.The higher the ISO the Grainer the picture will become.Then again there is a bonus.35mm film cameras never had a ISO that high where the problem occurs,only cameras for fast motion were built for that.Took picture at 1600 ISO no problem.I have no problems with the camera myself.If i wanted a 1200.00 camera for that task i would have brought another one instead.", "Date": "September 9, 2007"}, {"Title": "LOVE the camera", "Author": "Christy Lundberg", "ReviewID": "R33JNGMVVIHS75", "Overall": "5.0", "Content": "I LOVE the camera. Took it to Vegas. It took really GREAT pictures, even in low light and the dark.", "Date": "October 14, 2007"}, {"Title": "Second Kodak Camera", "Author": "Michael S. Johnson \"Michael J\"", "ReviewID": "R1ORZTMW4QFOUB", "Overall": "5.0", "Content": "This is the second Kodak i have purchased.  This is very easy to use and takes great pictures.", "Date": "August 13, 2007"}, {"Title": "no wrist strap!", "Author": "M. Jones", "ReviewID": "R358A533F8TYX5", "Overall": "2.0", "Content": "I purchased this camera after my Sony of 4 years blew up.  It does not compare in quality to my previous camera.  The pictures taken inside were blurry and red-eyed.  The colors in the NC mountains last week-end were vibrant! Too bad the camera didn't come close to capturing them.  And--  WHAT'S THE DEAL WITH NO CARRYING STRAP!??  There's a place for one- but it is not provided- maybe it's considered an accessory along with the view finder-also not included.  We'll probably end up buying another Sony and giving this to our teenager.", "Date": "October 28, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.1-megapixel sensor delivers excellent resolution for prints up to 30 by-40 inches\n5x optical zoom; 2.5-inch LCD screen\nRecord VGA (640 x 480) video at 30 fps with sound\nKodak Perfect Touch technology; Smart scene mode\n32 MB internal memory; SD/MMC card slot", "Name": "Kodak Easyshare Z885 8.1 MP Digital Camera with 5xOptical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51N33lvBaJL._SX300_.jpg", "ProductID": "B000NOVLEC"}}