{"Reviews": [{"Title": "A first-rate film camera", "Author": "Imejasan_Photog \"imejasan\"", "ReviewID": "RRP9HAVBYR57I", "Overall": "5.0", "Content": "In this day and age of digital SLR cameras people sometimes seem to forget the joy of using film...you know, that thing that comes in a small metal canister that you load in the back of your camera!  Even Nikon, that long established giant of the photography world has stopped making film cameras.Well for those who still appreciate the joy of film, this camera is perhaps one of the best film SLRs ever made.  Over my lifetime, I've owned a number of different film cameras from both Minolta and Canon, I even owned a 35mm Mamiya Sekor (for the under 40 crowd, you can look this camera up in Google or Yahoo) and I can safely state that this camera is a top performer in every possible way.There are enough functions, both automatic and manual, to unleash the creative genius now lurking inside you.  The camera's controls are laid out in an intuitive manner, so your fingers always seem to automatically find the right buttons to push.  In spite of the fact that this camera has many functions, the user is not overwhelmed by all of the electronic wizardy.  A beginner photog will feel right at home with this camera after shooting a couple of rolls of film.  A more advanced photog will be able to use this camera's features to enhance and expand his/her creative potential.The camera itself is well-built.  It has a solid feel to it, there are no cheap parts to it.  Plastic use is confined to a minimun and where plastic is used, it is of the highest possible quality.  I once dropped this camera and it was not even dinged!  Everything fits tight and works well.  I've owned this camera for several years and after shooting countless rolls of film (and dropping it once) it still works and feels the way it did the day I took it out of its box.If you buy this camera, also look into getting the accesory battery grip (BP-300).  It makes it easier to hold the camera when using long tele lenses, makes it easier to take vertical shots and it allows the user to use AA batteries or the standard lithium batteries. [...].This review is for the Elan 7 camera.  Canon followed the 7 model with the 7E, then the 7N and finally the 7NE.  The \"E\" designates cameras with the automatic focusing feature.  You look into the viewfinder and the camera automatically focus on the section of the scene that your eye is looking at.  This feature does not work very well for eyeglass users, so I chose the standard Elan 7 model.  The \"N\" designates a newer version of the Elan 7.  The improvements are nice, but they do not add significantly to the overall quality and features of the standard Elan 7 model.  I would rather get the standard 7 model and invest the savings on a good lens.Get this camera before they are all gone.  You will not be sorry.Digital is nice but film will never die!", "Date": "July 3, 2007"}, {"Title": "Canon - EOS Elan 7 with Canon 28-90 Auto Focus Lens", "Author": "Richard J. Lott", "ReviewID": "RAI9P8AH8B266", "Overall": "5.0", "Content": "The Canon EOS Elan 7 with Canon 28-90mm Auto Focus Lens made for a wonderful gift.  I rated it five stars because the transaction went smoothly and the seller went out of his way to make sure we were satisfied.  The seller shipped the item very quickly, as well.  Overall, I would rate this camera, the seller, and the delivery a five star rating.", "Date": "August 4, 2013"}, {"Title": "Where's the 28-90mm lens?", "Author": "Robert Lee Pyle", "ReviewID": "R30TRPRVTG2QP9", "Overall": "4.0", "Content": "Alright, so here's deal the bag, and the film are a nice touch but, where's the 28-90mm lens promised that I have not received? I mean I received a 28-80mm lens.", "Date": "August 3, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00012IP72"}}