{"Reviews": [{"Title": "Very easy to use, great pictures, few drawbacks", "Author": "Goldengate \"Goldengate\"", "ReviewID": "RUVT7WOW95U78", "Overall": "5.0", "Content": "I purchased this camera in early June 2006... a month later, I'm very happy with it.  This is my first digital camera -- I had been waiting for prices to come down and features to improve.  All of the buttons and knobs on traditional cameras seemed overwhelming to me -- hence my appreciation of this camera.  There are two buttons on the back - one to review pictures you've taken (titled \"play\") and one to pull up menus (titled \"menu\").  I also bought the wireless remote control (model \"E\") as well as a generic AC adapter (\"Digital Concepts 4.5V AC Adaptor\") from Amazon.  Both have performed well though I think the wireless remote control was a waste of money -- it's only for taking pictures of yourself, vs. I was hoping it would work with the slideshow feature when plugged into the TV.  I also purchased a fast 1 GB SD (\"Sandisk SDSDPH-1024-901 1 GB Ultra II SD Plus USB\") card from Amazon and seem to have tons of capacity for pictures and video... and I'm not experiencing the slow performance issue that others have referenced.The slide show feature is great - it comes with cables to plug into your TV or VCR and within seconds there's a menu on your TV for an auto or manual slide show.The LCD screen is big and clear -- and bright in all but the brightest of outdoor situations.  I bought some anti-scratch plastic overlays on ebay to protect the screen.The camera also includes a bunch of special effects and editing functions, such as making pictures brighter or adding clip art, etc.  Only complaint is that after you modify a picture, the camera goes back to the end of all pictures you have stored, vs back to that specific picture, so you have to scroll backward again... but not a big deal.I had no trouble uploading pictures to my computer, and was also impressed at the video capabilities... with my SD card I have about 15-20 mins of video recording time at the higher quality setting.Camera is also a good size - fits in your palm or pocket nicely without being too small to hold.  Good sound effects too -- you can set the camera so it makes a \"meow\" when you take a picture.  There's also a customizable startup screen so you can take a picture of a business card and have it display when you first turn on the camera -- just in case you lose the camera and it is found by an honest soul.Touch screen was my #1 reason for buying this camera.  I researched the only other touchscreen model on the market, made by Sony, but reviews of that one were lukewarm and this camera is brand new on the market, so new reviews...so I took a chance and am very happy I did.Everyone who sees it is curious about the touchscreen and falls in love immediately... and within seconds they are taking pictures with it and marveling and its intuitive user interface.  In 2 years I bet they'll all be like this.Only drawback would be there's no viewfinder, so you look at the big LCD screen to take a picture...since I was used to a viewfinder on my 35mm I thought this might be an issue, but it's not... I don't even miss it.Great camera, EASY to use, highly recommended!!!", "Date": "July 4, 2006"}, {"Title": "Great new ideas, but not the greatest camera", "Author": "M. Crawford", "ReviewID": "R3EVUAV43973G2", "Overall": "3.0", "Content": "The 3 inch touchscreen LCD navigation is a really nice feature, and functioned great. It seemed to react better to fingers rather than the included stylus pen though. This being the case, it should come with a screen cleaner cloth to remove smudgy fingerprint residue.The camera itself is SLOOOWW. When setting up a shot and taking a picture the camera was horribly slow, sometimes missing the shot I was trying to get. Definitely not an action shot camera, even with the \"sport mode.\" There is a myriad of manual controls available for those users who really want to tweak the settings to their liking.The pictures and movies were decent in my opinion but not excellent. I was less than impressed with the quality. The flash was decent as well. The battery lasted a good while of shooting, about 150 shots.Overall, the T10 is a a slick and well designed, well laid out camera. This camera met my expectations for a $300 digital camera. The size is easily portable in any pocket, bag, purse, etc.", "Date": "June 13, 2006"}, {"Title": "A solid, well rounded camera", "Author": "J. Deckard", "ReviewID": "R26R7W2HMHC6H3", "Overall": "5.0", "Content": "The Optio T10 is a great little camera.The camera sports an aluminum alloy body (the door to the battery compartment is plastic), making it durable yet light weight. The camera comes with a wrist-strap, but you may want to pick up a carrying case or belt-clip for it.The large LCD display has an intuitive interface. Although a stylus is included for navigating the touch screen menu, it is easy to use with just your fingers. The upper-portion of the touch screen is not as sensitive as the rest of the screen, and you will need to push a little harder up there.The lack of a view finder is awkward on bright sunny days; however, it is still possible to see the major elements of your shot (and the picture still comes out great). Although there are instances where the view finder would come in handy, I prefer having the larger display.The Li-Ion rechargeable battery (battery and charger included) has a good life span, and it is easy to swap in and out. I was able to take photos of the family for three days, at three different theme parks, before needing a fresh battery. I recommend buying a second battery so you're not caught short-handed.As with most digital cameras, be sure to invest in a memory card. Fortunately, the Pentax T10 uses SD cards (which are less expensive than the XD alternative). A 2GB card allowed me to store around 1,200 images (or about a half-hour of video).The Pentax T10 takes great pictures, is easy to carry, and even easier to use. I am very pleased with this camera, and I recommend it for anyone who wants to take pictures on vacations or at parties.", "Date": "March 17, 2007"}, {"Title": "Fun to Play with", "Author": "Michael Lebow", "ReviewID": "R14B8BCHF54OSB", "Overall": "4.0", "Content": "This is a great camera to fool around with. The zoom is excellent, the screen is masasive, and it has many features that are nice to have but you'll never use since you forget they are there. One feature I do use is the red eye remover, Its cool to be able to actually do that on the camera rather than have to do it on the computer. My only complaint is that some pictures look great on the screen and then you snap the picture, and they are incredibly blurry", "Date": "November 3, 2006"}, {"Title": "Horrible lens.", "Author": "K. Hunt", "ReviewID": "R13IXTUJQBKUCD", "Overall": "2.0", "Content": "I am 14 years old, and this was my 4th digital camera. It was a sleek camera with an interesting touch display for a good price. I bought it and loved it. I loved editing the pictures in-camera. I got so many comments on the easy to use touch screen user interface and everyone always crowded around it. The lens, however, would sometimes stall when powering down, causing it to automatically power-down and forcing me to push the lens casing manually back into the device. Eventually, one day, I powered on, and the lens completely fell off! I was horrified. I sent it in, and Pentax wanted $278.00 to fix the camera. Which was more than I paid for it in the first place! Needless to say, I did not pay for the camera repairs, and I'm now looking for a new digital camera. It also seems I am not the only one to have experienced such problems. Almost every single review for the next generation, the Pentax Optio T20, mentions the faulty lens. Also, the screen washes out COMPLETELY in bright light. The battery also lasts approximately two hours on each charge. All said, I will never buy another Pentax item.", "Date": "July 3, 2008"}, {"Title": "an ok camera, only one con so far", "Author": "Shaobo Zeng", "ReviewID": "R31TRJ7U8JXCDW", "Overall": "3.0", "Content": "only one con i am not satisfied, it is that 3 inch touch screen, although it is big and touchable, brings a lot of fun and convenience to users, but this screen is very glary, on a shinny outdoor environment, it is very hard to see things on the screen, you almost won't be able to see anything, so actually when I took photos outdoor, I was just holding the camera and aimed to the direction where i wanted to take photos and pressed the button, no way to know if the camera aimed to the right thing. they should make this screen free of glare. other than that, all is fine.", "Date": "April 28, 2008"}, {"Title": "thiscamerastinksbad....BAD! ZERO STARS", "Author": "Auburn mom \"Auburn WA parents\"", "ReviewID": "R307A0I56BH95Z", "Overall": "1.0", "Content": "This is the stinkiest and worst camera ever. We bought it to take graduation pics when I got my BA and it didn't work from the beginning. We thought it was us but is was not. The sensor didn't work from the factory. The store we bought it at (KITS in Seattle) gave us hell when we brought it back and didn't want to replace it. They sent it to the shop to fix and it came back the same way. Finally they gave us a new one but it had the same sensor problem too. We kept it for a while and it malfunctioned and took BAD pictures as well as horrible video. The camera just stopped working the other day. We have not gotten the $350 out of it that we spent and will get immense pleasure slamming it on the ground into a million pieces.We went and got a Samsung for about $90 and it is better than the pentax ever was. Plus we will feel better having to throw away $90 rather than $350.BUY THIS AT YOUR OWN RISK...the features are cool, if you can get them to work.PLUS the store that sold it to us DOESN\"T advertise this camera at all anymore...says a lot to us.BEWARE!", "Date": "April 5, 2008"}, {"Title": "Pentax Optio T10 camera", "Author": "Charles H Matthews, Jr \"Herb Matthews\"", "ReviewID": "R2U4L2E4FD2UEO", "Overall": "5.0", "Content": "This camera was ordered as a replacement for my wife's T-10 which was not functioning corretly. The image would disappear from the rear display screen.My wife loves this camera and it is performing very well. Great camera!", "Date": "August 11, 2012"}, {"Title": "Poor development", "Author": "J. D. Ruiz V \"JDRV\"", "ReviewID": "R19KDTBQLR3P46", "Overall": "2.0", "Content": "The screen is excellent but is to hard to focus with this camera. It is to sloow to take a picture and the zoom really sucks", "Date": "January 13, 2012"}, {"Title": "camera", "Author": "Troy W. Yonemoto \"polanski\"", "ReviewID": "R1GOS42LI92XH0", "Overall": "5.0", "Content": "Great Camera and it has given me some very memorable memories. Birthdays and events being one of them. I highly suggest this product.", "Date": "March 10, 2011"}, {"Title": "amazing camera!", "Author": "L. Dissi \"lu2323\"", "ReviewID": "R14K02MEUQNHBK", "Overall": "5.0", "Content": "i had this camera for 2 years, and it has worked amazingly up until just a month ago. it finally simply stopped working after the 2 years of excessive use. i dont know why it died, it just.... stopped working....  the touchscreen is very responsive but more to the fingers rather than the pen that comes with the camera. it has really awesome features that work well, and amaxing in-camera editing. however, the picture quality isnt spectaculer. this is hardly noticable for those simply looking for a point and shoot camera. it  makes nice photos for those who simply want to take photos and not necessarily for competition etc. it does have some lag time between shots that can get annoying, but honestly, to me, it didnt matter if it took an extra two seconds to take the photo once you get used to it. i recommend this camera :) its a great little device.", "Date": "November 25, 2009"}, {"Title": "Nice idea - several drawbacks", "Author": "John Nichols", "ReviewID": "R154OV15SRZULU", "Overall": "3.0", "Content": "I was looking for a camera that would let me make annotations on the photo while in camera and there were two choices - Sony's N1 and Pentax T10. The sony is about $100 more. The Pentax suffers from short battery life (note the touch, 3\" screen and the temptation to edit in camera).The focus problem is more serious. It takes 2 sec to focus and shoot. This is not good considering today's cameras. Shots are missed and frustration builds. I'm turning off the auto focus for regular family photos but will still use it for other shots where quickness is not important.All in all, I would have to give serious consideration to spending $100 more for the Sony. My first T10 had a defective touch screen - if you get the camera, check this out completely - this is the primary feature of the camera. The upper left 20% of the screen required very heavy pressure to register imput. The screen will be hard to see in bright sun.On the plus side - It is small, has a quality feel to it, and the drawing function works well.", "Date": "July 11, 2006"}, {"Title": "great camera", "Author": "Dana", "ReviewID": "R2H9TRG82Y8H7U", "Overall": "4.0", "Content": "This is a great camera. My only complaint is that the big LCD screen is hard to see out in bright sunlight.", "Date": "July 24, 2008"}, {"Title": "Digital camera", "Author": "L. Pherigo", "ReviewID": "R143SKST4J3RC2", "Overall": "4.0", "Content": "It was great doing business with wintekinc.  They were prompt and sent just what I asked for.  Glad I did business with them and would do so again", "Date": "January 14, 2009"}, {"Title": "THIS THING ROX!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Author": null, "ReviewID": "RO27HK32UOCGX", "Overall": "5.0", "Content": "I got this like a month ago and it is the greatest f-in thing eva!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! It is sooooooooooo kool!!!!!!!!!!!!!!!!!!!!", "Date": "April 9, 2007"}], "ProductInfo": {"Price": "$183.99", "Features": "6.0-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints\n3x optical zoom; 3.0-inch touch-screen LCD display\nCapture movies in QuickTime motion JPEG (640 x 480) at 30 frames per second; built-in movie editing functions\nFeatures creative Drawing Function, Stamp Modes, Image cut-out, and built-in Picture frames\nPowered by Lithium-ion battery DL-I8 (battery, charger, and AC cord included); stores images on SD memory cards", "Name": "Pentax Optio T10 6MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51rsqGwCJjL._SX300_.jpg", "ProductID": "B000CSEKQU"}}