{"Reviews": [{"Title": "The best digital camera!", "Author": null, "ReviewID": "R38GIWBJI6V6DQ", "Overall": "5.0", "Content": "This camera is fantastic.  I got it about 2 months ago and it has been invaluable.  I will never take a picture with film again!  The quality of the pictures is absolutely amazing!!  '[m not an photography expert, so I wanted something that was easy to use but did not want to sacrifice quality and this is it!  The batteries last much longer then other digital cameras I have used.  Of course the memory stick is very small, but that it typical for all digital cameras.  You will need an extra one, and b/c this is 5 megapixels the memory stick will hold less pictures that images taken at 4 megapixels or less.  And the great thing about this is if you need extra batteries you can buy any rechargable batteries and use that!  No expensive extra ... batteries here!  The size is nice and small so it fits in my tiny purse.  I've tried other cameras that were so small they looked so fragile.  Not this!  I have no complaints at all about this camera!!  To download the pictures you just plug the USB into your computer and you can pull them off without even downloading software to your computer.", "Date": "August 10, 2003"}, {"Title": "Compact. Great photos. Easy to use.", "Author": "Kenneth J. Williams \"big dork\"", "ReviewID": "R134T28BY28R7C", "Overall": "5.0", "Content": "I got this camera less than a week ago and I have nothing but good things to say about it. The photos that it takes are amazing. It is wonderful to get the 5MP quality at such a price and with such features. Also, its acceptance of the Memory Stick Pros just makes me giddy. 1GB o' photos at 5MP? Yes please. It is so light and compact. I can carry it easily in my pocket (which already has my cell phone in it). Being able to choose the quality of the movies that one makes is truly a bonus as well, as one does not need to waste quality on MPGs that are simply going to be e-mailed. Very well thought out design. I'd expect nothing less from Sony.(Still, it does not begin to compare to my Nikon SLR, but at a tiny fraction of the cost of the body and lenses, it seems like quite a nice trade-off. Plus, I don't have to fumble with lenses, filters, and the like in order to catch a shot. This will be a great hanging-out-with-the-friends camera for sure!)", "Date": "June 26, 2003"}, {"Title": "Great Point & Shoot Camera!", "Author": null, "ReviewID": "R3MMNYDA6DN6QF", "Overall": "4.0", "Content": "I bought this camera recently at 360 bucks. It¡¯s a bang for the bucks, with 5 megapixels. Batteries are good. The Nimh batteries the camera came with have shooting life up to 50 pictures, to fill up a 128-MB memory stick. Since it¡¯s AA, you can get cheap batteries anywhere in stores. The body is plastic, but thick and firm, though not as delicate as I thought it to be. Noise of zoom lens is a little annoying. Low-light focusing is always a trouble. Pictures shot in daylight outdoor are superb. When I printed one on Canon photo paper pro on 4x6 size, you cannot tell the difference from pictures shot with films.", "Date": "September 19, 2003"}, {"Title": "Fabulous Camera - now go buy a memory stick", "Author": null, "ReviewID": "R5GMOUQJG558", "Overall": "5.0", "Content": "I'm rating the camera, or else the package would have got 4 stars since a 16MB stick is totally inadequate.  Aside from that, the camera is absolutely great.  5MP gives you obvious great quality.  A feature that I didn't think I would use much is really becoming more of a handy feature, the A/V MPEG mode.  It will not replace a video camera, but being able to snap 50 pictures at 5MP and take about 7 minutes of footage has been really nice.  (I have a 256MB Stick)  Overall, I'm very happy with the camera.  Like the Sony name, and it feels nice and durable in your hands.  I certainly can recommend this camera, but honestly, buy a memory stick, and I would not recommend anything below 128MB.  256MB is nice as you get about 100-120 5MP pictures.", "Date": "June 13, 2003"}, {"Title": "Excellent quality digital camera", "Author": null, "ReviewID": "RZ6BHYZ4753ZM", "Overall": "4.0", "Content": "I've only had my Cybershot for a week, but so far, I've been very impressed with the quality of the camera, the clarity of the pictures, and the ease of use of the camera. I was able to use this camera for Thanksgiving, just a day after receiving it, and was still able to get some great pictures, so the learning curve is very small. I have settled on 3:2 mode, which is about 4.5 megapixels, versus the full 5 megapixel mode. The main reason for this is my desire to produce accurate 4x6 prints, which the 3:2 mode does to a \"T\". This camera takes breathtaking outdoor shots, and very good indoor shots. I've taken most of my shots in the point n shoot mode, with everything set to auto, and the pictures have all, for the most part, been great. I like the fact that I do have some degree of manual control over exposure, metering, focus, etc., because I do intend to explore all the different ways to take a picture with this camera, but for now, I'm very happy just shooting everything in auto mode. The movie mode is cool, if not a little on the jerky side (due to only 16fps), but I do like having the capability to record small movies, if the need arises. For now though, I just use the camera for taking pictures. The batteries and charger that come with the camera are top notch. It took me days to run them down. I did buy an extra set online for 9 dollars, so I should have no problems with battery life. I recommend buying a memory stick, as 16MB is a joke. I bought a 256MB (128MB x 2) memory stick online for about 80. I'd stay away from the memory stick pro. The magic gate stuff takes up way too much of the memory sticks memory. I highly recommend this camera to anyone.", "Date": "December 2, 2003"}, {"Title": "Great Camera - Now go buy a memory stick", "Author": null, "ReviewID": "R1QZS5FOKU5Y9Y", "Overall": "5.0", "Content": "Looks great, feels great, and takes great pictures.5MP truly gives you a great quality, and surprisingly (to me) I'm using the Audio/Video MPEG mode more often then I thought.  The quality of the movies won't replace your video camera, but quite handy for clips that you want to capture.  Packed with features and a very easy to use menu system.  Overall I really love the camera.Cons:  With the camera, none.  With the package, the memory.  16MB is absolutely terrible.  5MP you'll get about 6 pictures.  Wait for deals, here on Amazon as well, and you can find 256MB sticks for [some money].  So DO consider this in your pricing (with other cameras as well), but if you pick up a 128 or 256 stick, you have a great system that you will be happy with.", "Date": "June 13, 2003"}, {"Title": "Great Point-and-Shoot", "Author": null, "ReviewID": "R65X96V580ZHD", "Overall": "5.0", "Content": "I received this camera as a Christmas present and have used it off and on since then.  I'm not an avid photographer, just one who likes to take shots of the grandchildren around the house and occasionally pics for inclusion in a Word document.  I don't use any of the more detailed setting and I've yet to read all of the manual.But it takes beautiful pictures using just the point-and-shoot mode.  The color balance and color correctness looks very good, even in those pictures shot indoors using incandescent lighting.  Importing the pictures into Win200 is simple and quick, and when printed on my Canon I860 printer the result is simply gorgeous.I'm very pleased with the results and even more so when it's coupled with the Canon I860 printer.  A great combination.03/31/2004 update:  I have to agree with the reviewer who said the 16M memory stick is inadequate.  It only yields 24 pictures at 1.2M resolution in Auto mode (wherein pictures are forced to Fine mode instead of Standard mode, effectively halving the number of pictures one can fit on the stick).  I've since purchased a 256M \"Memory Stick Pro\" made by Sandisk, to keep from spending a lot of time transferring pictures to my computer in order to clear the 16M stick for more pictures.", "Date": "March 18, 2004"}, {"Title": "Stop thinking - it's worth it!", "Author": "Nick Schestakov", "ReviewID": "R1GUZEF4VN18G6", "Overall": "5.0", "Content": "My friends brought it to me from the US (i bought it at AMAZON), in a week i threw away my old film camera, even though i thought before that the pictures i had are excelent! To tell you the truth, i was expecting something really cool, but when i got this baby, and printed several pictures afterwards - i was simply blown away by the quality of prints, colors, sharpness and etc.Words of warning: when you get it, you will suddenly start shooting and shooting and shooting, so buy the second set of batteries and the bigger memory stick! It's a must!", "Date": "November 13, 2003"}, {"Title": "Magnificent, not Magical", "Author": "Lloyd V. Williams \"Lloyd Vincent\"", "ReviewID": "RLM9GHUDK27AF", "Overall": "4.0", "Content": "I've had this product for 4 months now, so I feel I'm ready to write my review.When I bought this camera, there were two things that compelled me to select this camera over others. the 5-mega-pixels, and the fact that it was made by Sony, a company that I've come to trust.I'm sure you've probably already heard what's good about this camera, so I'm just going to skip all that and cover what I think the buyer should be aware of, namely... what they can expect to go wrong.The point-and-shoot architecture is very intuitive, but not for professionals. One thing I was looking forward to with this camera was playing around with the manual camera settings. I quickly lost interest in this because you can't change the shutter speed, which is what I really wanted to play with.The size of the camera is nice. It's a little smaller than the 1-time use film cameras, although much heavier. maybe about the weight of a small coffee cup.The 3x optical zoom is great, but going beyond 3x the camera starts to use digital zoom. You can get up to 12x, but the picture quality really, really drops off beyond about 6x.The camera takes pictures in standard computer screen proportions (although it has one wide-screen option). This is great for computers, but can pose a problem for people wanting to actually develop their pictures, as standard picture sizes are proportionally wider than computer screens. The top and/or bottom of your pictures may get cut off.For indoor pictures, there is a problem. To function as a hand-held camera, you either have to have ROCK steady hands, or extremely bright lighting. Anything other than this will give you some problems with blurry pictures. After about a month of finding shelves and countertops or books to set my camera on for picture-taking, I bought a 5 dollar tripod that has expanded my options for using the camera and also just made it less troublesome on the whole. Taking pictures in the pre-set \"landscape\" mode can also result in blurry pictures, even if the lighting is magnificent.The battery life can be troublesome, but a fully-charged set of batteries can last you an entire, fairly rigorous day of picture taking. I suggest buying an extra set of batteries, but if you can tolerate the thought of needing to take a picture, but having your batteries be in the charger, then it's not necessary.When you turn on the camera, the lens twists and moves out of the body. This very cool to watch, I think... but compared to other cameras it is a little noisy; perhaps about the decibel level of a person next to you listening to loud music on poor-quality headphones. It's not annoying, because the sound only happens when you turn the camera on or off, or use the zoom feature.There is a strange sound I discovered that is always going with this camera when it is on though. It's inaudible for the most part, but if you hold your ear directly against the display screen, you hear all sorts of cool mechanical beeps and stuff. it's probably not too healthy to do this... but it can't be worse than talking on a cell-phone all day :-PThe 16mb memory stick has got to be some sort of cosmic joke. You can fit at most 5 high quality pictures on it. I suggest, nay, DEMAND that you get AT LEAST a 128mb memory stick. But, keep the 16mb around as backup (you never know when you will run out of space and need to take one quick picture).The screen was great, no pixels on mine were burnt out (check for burnt out pixels on your camera if you are buying from a retail store where you actually get to test the camera before buying it). But the screen is missing something. Most Japanese cameras and cell-phones put a clear, hard-plastic cover on these screens, which is very useful for those people who always feel they need to touch and point (those wierd colors that you see when you touch the screen are BAD).The movie mode is nice for catching moments like kissing your lover, friend's falling off their skateboards, and so on. But don't plan on becoming the next Steven Spielberg with this. The camera will record directly to .mpg format, which is nice because you can play this format on almost any computer without needing to install anything. I say 'almost' only because I'm sure there are some linux distros that don't include a video player.The cord that hooks your camera up to an AV-in port is great. you can watch your movies in decent quality on the TV screen, and do a slideshow type thing of your pictures. I like to use this in conjunction with my VCR to record movies, this gets MUCH better quality than the built-in video mode and records to a VHS, which can be handy. But the cord is rather short, so I can't record anything outside or in another room.The USB hook-up to your computer is very handy. And transferring a full load (128mb) of data to my computer never takes more than 2 minutes, which I think is very reasonable considering how easy it is to set up. The camera will pop up in your computer and you can browse it just as you would any regular folder. Your pictures are stored as JPG pictures (of course) and in windows xp, you can switch to 'thumbnail' view and find the picture you are looking for right away. I have had some problems getting my computer to detect the USB connection, but I've always been able to fix this by rebooting.This is a great camera. Under the right conditions and with a fair amount of awareness, you can take magnificent pictures. But it's not the magical camera that is going to work perfectly all the time and under every possible circumstance. I don't think such a camera exists. If you want 5 megapixels of power and a name like Sony, this is the camera for you.", "Date": "May 8, 2004"}, {"Title": "You gotta have this camera", "Author": "Paul Romer", "ReviewID": "R3VPQ834M1LQTY", "Overall": "5.0", "Content": "If you love photography, if you like digital imaging, if you like making fun MPEGs, and if you enjoy shooting high quality pictures, then you gotta have this camera. I have never seen such an easy-to-use camera. Like with most Sony digital cameras, the DSC-P92's user-friendliness and image and lens quality are what it's all about. Having family living all around the world, it is also great fun to make short MPEGs and send them through e-mail.", "Date": "July 20, 2003"}, {"Title": "This camera packs lots of mega pixels for a reasonable price", "Author": "WFG", "ReviewID": "R37F6KUZS33BIL", "Overall": "5.0", "Content": "Update! We have had the camera for several month now and it is probably one of the best products I've ever owned. We've been in several trips now since we bought it and I can not imagine leaving on vacation without it. Stop thinking about. It is well worth it, a very reliable product, and the picture quality is outstanding. You will get your money back along the years by saving in development, and you will be able to share your memories with your family and friends through email.---I bought this camera the day it was released. The day after receiving it we left, along with the new camera, for our summer vacations in Las Vegas. I'm glad I bought this camera, otherwise my wife would have used 5 or 6 24 exposure films. The camera is very easy to use, very compact, and it comes at a good price. The quality of the pictures was beyond my expectation. I was surprise to see how well the camera automatically adjusted at different light conditions. I was able to take good pictures with just a click of the shutter. I need to mention that this camera is replacing my 35mm Canon EOS 650 from which I took excellent pictures, but it was just too dificult to carry around. The battery life of the included NiMH is very good as well. I was able to run  the camera the whole day without recharging, taking about 25 pictures per day, and of course watching the results right after.  Make sure you buy additional memory sticks, because you are going to need them. At 5 megapixels and fine resolution you only get 51 pictures in a 128MByte memory stick. Fortunately, the price of the memory stick has dramatically dropped in the last couple of weeks. This camera also supports the new Memory Stick Pro, which comes in 256,512, and 1024 MByte configuration. I also recommend buying the LCS-CP2 Soft Carrying Case, and a Sony 128 MB Memory Stick Media MSA128A along with the camera. The only cons with the camera are that the included memory stick of 16Mb is only good for 6 pictures at 5 Mega Pixels, and that is very difficult to adjust new lenses/filters as you need the Sony adapter.", "Date": "June 6, 2003"}, {"Title": "Great camera for the price. . .", "Author": "Matthew Epperson \"raggedpoke\"", "ReviewID": "R2S5RW1R6EOT7E", "Overall": "5.0", "Content": "I did a lot of shopping and searching before I discovered this model.  Then I had to wait about 2 months before it came out, but I am thrilled with it.  The menus are easy to use.  The AUTO mode takes great pictures, but you have the flexibility to make adjustments if you want.  The files are big, but that is what you get for 5 megapixels.  Memory sticks are a convienient media, and prices will continue to fall.  I am amazed how much you can zoom into a picture that you've taken and it still looks clear. . .even on the camera's LCD.  I was resistent to digital photography because I love great 35mm pictures, but this camera makes it easy to switch.", "Date": "June 18, 2003"}, {"Title": "Good camera,excellent quality!", "Author": "Gabriel Mendez", "ReviewID": "R3KZAOR7LX1EFJ", "Overall": "5.0", "Content": "I just got this camera for a replacement to my Kodak LS443 which broke.  This camera, being less expensive than the old  one (the LS 443 cost more than this one when i bought it ). The camera,  for the price it has, is Great! What other camera can you get under $ 400 with 5 megapixels?The quality is great, it comes with red eye reduction, MPEG movie mode, and voice recording feature too.What i really liked about this is that you can cjange the quality- from 5.0 MP to 3MP to VGA mode, so sending emails will not be a problem.The camera comes with a 16MB memory stick, which allows you to take up to 7 photos with High Resolution. The camera is great, for beginners and experts!", "Date": "February 3, 2004"}, {"Title": "What ever happened to customer service?", "Author": "T. J. Patton", "ReviewID": "RPCT2O8IONAF6", "Overall": "2.0", "Content": "I used to buy a lot of Sony products but this camera has put an end to that practice. I could go into details of my customer service nightmare with Sony but I think I'll focus on the product itself. The camera produces an average picture but my Kodak DC 200 had better quality and it was less megapixels. The camera started shooting blue hued pictures when taken around dusk. Later, it began doing it all the time. I use Adobe Elements to correct Sony's failures but I am just going to purchace another camera.  Close ups were never very crisp either.  I would send it into Sony for repair but they jacked their flat rate price up from $117.00 to $171.00. Ridiculous, nobodys inflation rate is that high. To repair it and pay for shipping, I might as well go purchase a new camera.", "Date": "August 30, 2005"}, {"Title": "Yes, it's fun and easy.....", "Author": "Tonia", "ReviewID": "RH3PFSV2NSUT7", "Overall": "4.0", "Content": "For the money and features it's worth it.Think about what you're buying before you buy it. If you are looking for SLR features, don't buy this camera. You're not paying for them here.This is a point and shoot camera with some features to play with. Some of the settings are a waist and only produce blurry pictures. Low light shots, this camera sucks. I've never owned a camera that didn't, even my old Nikon 35 mm SLR. The outdoor shots are awesome. If you get bad pictures read the manual. Your shots should be clear and bright.I really don't worry about babying it and it has been problem free for a year now. The camera is well built and has traveled with me all over. Toughest test was roaming many ruins in Mexico, banged off rocks, heat and humidity.Yes buy a larger memory stick, that's a given.", "Date": "December 4, 2004"}, {"Title": "Dropped 4 feet and still works perfectly!", "Author": null, "ReviewID": "R3N0RLNLT9PJ43", "Overall": "5.0", "Content": "The reason I bought this camera was my Kodak dc290 stopped working after dropping it on asphault from about two feet (dragged out a car door with a jacket).  The camera was 5 years old and I was really happy with it up until that point.I wanted an excuse to get a new five megapixel anyway.Just a few weeks ago I handed my Sony DSC-P92 to a friend and it slipped through our fingers and landed hard on the sidewalk.  It fell about four feet.  The Memory card fell into a nearby pond, the memory door flew off and my heart sank. \"Oh no not again.\" I thought.The camera is fine.  The memory door snapped back on easily, the memory card dried off and worked fine, and EVERYTHING works.  Amaizing.  It even has minor scratches on every side from it bouncing and rolling - but it works like the day I bought it.Maybe I was lucky, but I am still impressed, and after using the camera for a few months, I believe it survived because it is simply well designed.", "Date": "April 11, 2004"}, {"Title": "Love it!", "Author": "B \"myliebe\"", "ReviewID": "R1X2U6JQTV0CH4", "Overall": "5.0", "Content": "This camera worked amazingly since I got it in May.  It has been all over the US and Europe with me.  I do like the P-10 because it is smaller, but this is definitely a great value for the price.  The unlimited mpgs are wonderful and really allow you to bring the experience home with you.", "Date": "October 31, 2003"}, {"Title": "Ok, but not great. Best for absolute beginners", "Author": "Angela Henderson", "ReviewID": "R2DTD6OO6351O7", "Overall": "3.0", "Content": "I had such high hopes for this camera. I have been using an Olympus 3030Z (3.3 megapixels) for a couple of years, and I'm sorry to report that my old Olympus does a better job. I bought this partly on the basis that we already have Sony computers and I am sick of fighting with card readers, and most reviews of this camera on the web that I saw were positive. But I think for many this was their first digital camera, and if you have nothing else to compare it to, it probably seems fine. However, it does have serious issues with blurriness and less-than-perfect lighting. I took comparison shots with my Olympus--same object, same lighting, same everything--and the Sony blew it every time. I saw graininess in most of the low-lit Sony shots, and none with my old Olympus (and no blurring, either). Low-light shots without a flash are no problem for my Olympus. But you could never get away with no flash with this camera. Bottom line: the price of this camera was great, but even so, I can't look at the pictures without wincing. The picture quality is barely above disposable camera-level. It's too bad, but I'm afraid this one is getting returned.", "Date": "January 24, 2004"}, {"Title": "Best Small camera Availble today 5.3 meg", "Author": "G. White \"GW\"", "ReviewID": "R1IFMDN502N6W6", "Overall": "5.0", "Content": "I love my Sony DSC92 It does every thing I need and more.People Can not beleive the photo sharpness and I love how eazy it is to use ,with a camera that fits in your pocket.", "Date": "April 12, 2004"}, {"Title": "This is a wonderful camera from Sony", "Author": null, "ReviewID": "RJ39UY83CTYLW", "Overall": "5.0", "Content": "I searched for months trying to decide which digital camera to buy. The Sony DSCP92 was my choice after lots of research. Easy to use, brilliant photos, clear, crisp, colorful. The movies are great too. This camera does a lot of the set-up work for you when shooting pictures. The kids can even work through the buttons and menus without any trouble. I bought rechargable batteries as well as two 128 meg memory sticks. The one Sony supplies is basically useless. The software that comes with the camera is also fairly lame. I downloaded Adobe's Photoshop Album 2.0 and have been using that with great success.", "Date": "March 30, 2004"}, {"Title": "Almost 5 Yr Old !!! Still Going Great !!!", "Author": "Sachin Kumar \"sssdddaaa222\"", "ReviewID": "R1ANGTS36NDA43", "Overall": "5.0", "Content": "I brought this camera in Oct 2003 (so its almost 5 yrs old). This is the most amazing camera i've owned. It takes amazing pictures. These days there are so many new cameras in market that I also wanted to have one so I took this camera to its last trip on labor day weekend. Yeah you heard it correct \"its last trip\"... to Niagara Falls. I soaked this camera in water for couple of hours. At cave of the mist it took a whole 1 hour shower with me (Although i was protected with plastic, it was not). I never imagined in my wildest dream if any electronic equipment can survive that abuse. But i failed and this camera did not. It worked like a charm the whole time and even when water went into the camera compartments it worked. i just took out the battery and memory stick and drained the water out. Its still working and is amazing me more and more.", "Date": "September 3, 2008"}, {"Title": "Decent camera, Bonus feature", "Author": "C. Carabine", "ReviewID": "RJ7RJLQMHVGDV", "Overall": "4.0", "Content": "This camera is good for point and shoot.  Low zoom power, but makes up for it by being compact enough to carry around.More importantly,  for those interested in infrared photography or IR + visible photography, this camera is a 10 minute project to disassemble and modify.  10 screws, swap out the ir filter and you're set.", "Date": "February 20, 2007"}, {"Title": "Sticky Lens Cover", "Author": "Checkers", "ReviewID": "RS0OFRSVTNJ1", "Overall": "2.0", "Content": "My Sony DSCP92 takes great pictures in full light and fair pictures in low light situations.  The only problem I have encountered is a sticky lens cover that does not alwys close or open properly.  The camera is 2 years old.", "Date": "December 10, 2005"}, {"Title": "Great Camera, Great Service by Amazon!", "Author": "Gustavo Fernandez", "ReviewID": "R2V97KYGA83HCJ", "Overall": "5.0", "Content": "I had the Sony DSC-P71, and changed it to this camera Sony DSC-P92. It is great, the 5MP is fabulous and the MPEG with sound is another great feature. I recomend it, the pictures you get are better than any other camera I have seen or used that some of my friends have.So, go out and buy it, and as some said already, do buy a 128MB memory stick or higher, you will need it.The shipping servie by amazon is awesome! It's not the first time I buy from Amazon, and every time my packages have been on time and in excellent conditions.", "Date": "March 2, 2004"}, {"Title": "Wordeful Sony Camera.....duplicate of the one I had enjoyed for a decade or more.", "Author": "JeffTcom", "ReviewID": "R2B2Z2UJQHDVMK", "Overall": "4.0", "Content": "Replaced the exact same camera I had enjoyed for years, but which later failed.  Thgis marked down twin meant that I could still make great photos with a cameral that was second nature to me..", "Date": "December 4, 2013"}, {"Title": "Sony DSCP92 Cyber-shot 5MP Digital Camera w/ 3x Optical Zoom", "Author": "Peter C. Christiansen", "ReviewID": "RF3YX5TGMRI8F", "Overall": "4.0", "Content": "Sony DSCP92 Cyber-shot 5MP Digital Camera w/ 3x Optical Zoom: Good product that works as advertised. I would recommend to others.", "Date": "December 29, 2012"}, {"Title": "Camera malfunctioned and is out of warranty", "Author": "A. Prato", "ReviewID": "R3OWNLDFNB9CLY", "Overall": "2.0", "Content": "I've owned this camera for about 3 1/2 years and it is now malfunctioning.  The LCD shows a horizontal purple bar across the middle and the screen flickers.  Moreover, my photos come out with thin red, blue, and green lines which ruined my Christmas pictures.  I'm not heavy user of the camera.  It was never dropped (I took care of it like it was made of glass).  It was never kept in humid conditions. And no, it's not part of the CCD image issue. I will say that I did find Sony support helpful.When the camera was working, it drained batteries quickly (even the special digital AA ones).  I thought the shutter speed was a tad slow which caused me to miss quite a few shots.  When I did capture the shot, I was pleased with quality of the photo.I'm in the market for a new camera and I will look at Canon or Olympus.A word of caution on store warranties: I bought an extended 3 year warranty through the big name electronics store I purchased it at.  Be aware about the warranty if you decide to purchase one!  It was 3 years from the shortest of Sony's labor warranty (3 months) or parts warranty (1 year). The salesrep neglected mention that important piece of information, so I had 3 year 3 month coverage; not 4 year coverage as I would led to believe.", "Date": "January 30, 2007"}, {"Title": "Great camera & Awesome pictures", "Author": null, "ReviewID": "R1CVU203L60MSS", "Overall": "4.0", "Content": "I picked the DSC-P92 because of the quality of the pictures,size of camera & affordability.This things takes awesome pictures.Ease to handle and easy to use.Only drawback is the memory stick they include but no big deal,I purchased the 128 memory stick and will purchase another soon.Once you start taking pictures you don't wanna stop.I have a 35 millimeter but in order to email pictures you have to have them developed and then scanned,with the digital you just shot,load to computer and email,all within a matter of a couple of minutes.Thanks Sony for creating another fine product.", "Date": "April 14, 2004"}, {"Title": "Great price for a 5 megapixel camera", "Author": null, "ReviewID": "R2O6PI7A9UXK8U", "Overall": "4.0", "Content": "I've had this camera for a few days and I've been impressed with its quality.  The camera itself is great, the software is horrible.  If you use Photoshop or another image program--keep using it. Overall, good price and good quality.  If you can't afford a Kodak or Olympus, this is a great option.  Small size makes it ultra portable.", "Date": "March 18, 2004"}, {"Title": "Best 5 MP Camera I've Used", "Author": null, "ReviewID": "R30XDWEE1PA78U", "Overall": "5.0", "Content": "This camera is beautiful! It isn't at all plastic, it's strong and it takes very clear pictures with great color! This camera is worth much more than it's price! It even sends out an orange focus beam on your subjects face to help it focus. You can change the resolution from 1 MP to 5 MP, it even has a setting to take low resolution email pictures to send them quickly. It has lots of different settings. The only &quot;cons&quot; of this camera is that it only comes with a 16 MB memory stick and that allows you to only take 6 pictures at the highest 5 MP quality. But hey, for this price overall it's fantastic!", "Date": "December 10, 2003"}, {"Title": "Sony Cyber-Shot Digital Still Camera - DSC-P92", "Author": "Kelly Millard", "ReviewID": "R1YFS9GXT5N3OK", "Overall": "5.0", "Content": "Well, I have to say, this is the most wonderful camera I have used.  I have always loved the pictures that my sister's camera takes (Olympus).  Her camera was very expensive and this one was quite affordable and takes as good of pictures if not better than hers.  I have not a complaint about this camera except for the memory stick that comes with it.  The pictures are crisp and clear!  I love it!  Thank you Sony!", "Date": "September 17, 2003"}, {"Title": "Cool Camera! But with AA batteries?", "Author": null, "ReviewID": "R1CGRWKFYN8DIE", "Overall": "3.0", "Content": "Way to go for Sony Digital Products, but what happened when they designed it? It is a great digital camera with a fine 5.1 Megapixels resolution, it supports Memory Stick Pro, it has MPEG movie capabilities...wow Sounds Great, but it uses 2 AA batteries (included) instead of the Infolithium battery system. If you are tired of having too many things that require AA batteries, go ahead and buy Sony's DSCP10 camera instead, you will get the same cool things (but with an Infolithium Battery) and the price difference will be none when you compare it to how much you'll spend in buying AA batteries when the ones included are no longer useful.", "Date": "July 17, 2003"}, {"Title": "Poor color quality & not very sharp", "Author": "buddej", "ReviewID": "R1E8SJGMQGXU90", "Overall": "3.0", "Content": "We were very disappointed with the image quality from this camera.  I have finally returned it and am still searching for one with acceptable image quality.The photos from this camera came out very red and were not sharp and clear.  I tried multiple film developers including snapfish.com, shutterfly.com, Walgreens, and a local custom film developer.  The Walgreens and local developer's prints were almost acceptable, but the others were horrible.  I played around with the white balance and other adjustments and could not get them with good color balance.  Perhaps more adjustments were possible--but I just finally decided that I didn't want to have to manually adjust for every picture situation.  I want more of a point and shoot camera, with the ability to adjust things if I want.The other controls, battery, and operation of this camera were excellent.  It felt very solid and durable.  I loved the little sounds it made when you made menu selections.  It is easy to use and a great price.But, in the end, the most important thing is the image quality.  I suppose I could take each picture and manually fix it in Photoshop or something--but that isn't something I am interested in doing.  A digital camera should be able to take the majority of it's pictures without software tweeking with Photoshop...", "Date": "January 11, 2004"}, {"Title": "Great camera!", "Author": "Jim Irwin", "ReviewID": "R3J40YUCX767UR", "Overall": "4.0", "Content": "Considering I'm one that avoids reading instructions first...I found this camera idea for me.  However, I was so impressed with the quality of picture, and easy of auto operation, that I started reading.  This camera has a world of features, and offers a lot of fun.  I highly recommend it.", "Date": "March 12, 2004"}, {"Title": "All too common camera malfunction", "Author": "Lee", "ReviewID": "R1ORHNRGC6OUN9", "Overall": "1.0", "Content": "The screen on this camera commonly goes black. And thus unable to take any pictures.  My son had read reviews on this very site  over a year ago about this very issue. I cannot now find any mention of this issue on here now. What happened to all the posts about this? Anyhow, I just typed in google the term \"black screen Sony DSC\" and came upon a post on another website where someone blogged about this black screen thing. A response to this was to take the camera and smash/whack it on a hard surface a few times, and the screen will come back on. Well, I did exactly that. Before tossing this out into the wastebasket, I took the camera and whacked it as hard as I could on a piece of wood, and the screen came back!! I tried taking some photos, and they came out perfect. Still, I will start my search for a different brand camera now, as this, while it works now, is not reliable. I still don't know what happened to all the Amazon posts from last year about this very thing", "Date": "July 26, 2005"}, {"Title": "camera", "Author": "Charles A. Iannaci", "ReviewID": "R2WS2JFHALMO8C", "Overall": "5.0", "Content": "it came to me fast .. it works great .. and I use it in one of my cars if I ever need to photograph an event.. the price was great . compared to buying a new one", "Date": "January 7, 2013"}, {"Title": "Great deal, works perfectly", "Author": "GlennB", "ReviewID": "R10QG114K4W5XX", "Overall": "5.0", "Content": "Great value.. I bought this in Feb, 2011: It is working very well and is better than expected. I would by another", "Date": "July 13, 2011"}, {"Title": "good old camera", "Author": "William F Rogers", "ReviewID": "R26J8J8A7SOEGP", "Overall": "5.0", "Content": "This is a reliable camera in my experience. My first one lost its movie function after three years of use. It got confused between playback and picture-taking mode in year four. Lost its ability to take pictures even though it could play them back, this after a night outdoors in the rain. I like the file size for what I do with digital photos. I use 35mm and 2.25 square film cameras for higher quality images.", "Date": "July 5, 2011"}, {"Title": "Reliable quality", "Author": "Food Fan", "ReviewID": "R1JHX9BBPZ1UB3", "Overall": "5.0", "Content": "I've had this camera for 4 years, and it is still taking great pictures. The quality of the pictures is great, even better than two newer cameras that I have.", "Date": "March 3, 2008"}, {"Title": "with stood the test of time...", "Author": "Katie M. Allen", "ReviewID": "R36GNSPM3M0K0V", "Overall": "4.0", "Content": "I have had this camera for 2 or 3 yrs. now... let me start of saying this is an excelent camera... i love it.. if i had to go back and do it all over again i would have still chosen this camera... now i will tell you the problems that i have encountered...The Flash- this camera has a red eye reduction feature that works wonderfully but, the flash goes off about four times before the picture is taken and if it is a posed picture and the subject doesn't realize this about the flash then they are likely to move by the time the picture takes...Lens- about 6 months ago the lens started getting stuck i took the camera apart and blew all the stuff out of it... after that it started working again... about 4 or 5 months ago the there was something wrong with the focus.. all i had to do was zoom in just a little bit before i took the picture and it would focus just fine...let me end by saying most of the problems that i encountered with this camera where about 98% self inflicted by me... this camera has made several trips to New Orleans... a few dozens falls from fairly high places.. i used it outside on a front porch to take some pictures and video of hurricane Katrina.. (live in south Ms)... but this camera is still going...", "Date": "January 11, 2007"}, {"Title": "Astounding", "Author": "Katie Hernandez \"Corsetiere\"", "ReviewID": "R3NH7VV4ES9AEO", "Overall": "5.0", "Content": "I received this camera as a present from my mom.  It has to be probably the best camera that I have ever owned.  It is wonderful because you can just point and shoot with faith that the image will come out clear as day.  Also the movies are impecable quality.  As a photographer this camera is great to carry around in order to just grab life as it happens.  It is light weight, easy to handle and even easier to use.", "Date": "December 7, 2006"}, {"Title": "Decent camera, decent price, I'm happy", "Author": "L. Price", "ReviewID": "R10TZWDQQ1C7A5", "Overall": "4.0", "Content": "Overall I like the the camera very much. There are a few things that I wished were better, e.g. focusing, battery life, but you get what you pay for. If your looking of a good 5.0 MP camera and don't want spend big bucks, you probably can't go wrong with this camera.", "Date": "January 11, 2006"}, {"Title": "Lens is stuck!", "Author": "Fiona", "ReviewID": "R15U5FRD8KHUPV", "Overall": "4.0", "Content": "I have had this product for 19 months now, Only now have I come into serious problems.As you can see, the lens will not go back in- and it's out to full zoom.I turn on the camera and get a really nice rhythmic electronic groove- but i'd rather my lens go back in...  This has happened several times in the past, but it would sort itself out within 30 seconds...The onscreen message tells me to turn the camera off and back on again, and I do so, but the noise carries on for a good 15 seconds after and it doesn't help.I have no working camera!!!!!I'm off to check out the insurance papers...As for the camera, It was great- I used it for a lot of concerts and got some unexpected results/flukes- but never really what I saw (a common problem with digital).I still haven't to this day found the suitable settings for live concert situations-  They're either vibrant and blurry or 'white coated', dull  and bitty.  If anybody has some settings tips for this situation, please mail me them!Also, yes, the screen is lacking a hard, clear, protective coating... It is difficult to view the pictures at an angle.  Mine scratched after just a few days...Another thing- shutter lag... It's PAINFUL... you shoot, the screen goes black, and I have dealt with *20 SECONDS* of paralysis recently... On spanking new batteries, too...Needless to say, I'm upgrading shortly- I want to do some A0 prints, Not sure what to upgrade to but something with a shorter lag time is preferable...But, I do love Sony's products...", "Date": "August 12, 2005"}, {"Title": "Excelent Camera, zoom during capture should be included", "Author": "Amazon Customer", "ReviewID": "R12N4KTC1AWDV6", "Overall": "5.0", "Content": "With 256 MB and larger memory sticks, this doubles as a camcorder. The only issue is that the zoom does not work during video capture. Video is high quality. Much better than analog camcorder to digital conversion. Small size means it fits in a pocket.", "Date": "April 16, 2004"}, {"Title": "Not very clear", "Author": null, "ReviewID": "RKPD6SCLY7G90", "Overall": "2.0", "Content": "We bought this camera b/c we had thought Sony was a very good product. This camera took awful pictures. They quality was very blurry. We called Sony and they had us on the phone trying to fix it. We were told we would have to hold the camera a certain way (which we tried) and listen for the beep (which we tried) Finally after taking about 15 pictures and having about 3 come out clear, we packed it up and returned it for a cheaper Olympus, that takes great pictures!", "Date": "January 18, 2004"}, {"Title": "small and handy but not as sharp as fuji", "Author": "M. Rao \"raolin\"", "ReviewID": "R111JVYPWS37N1", "Overall": "3.0", "Content": "I was having 2 options when buying digi cam fujifilm finepix 3800(now 3000) or Sony dscp 92I bought dscp92 becs of high pixel range 5mp against fuji's 3.2mp and small size but after comparing its result with Fuji I m really disappointed. I think Fuji's finepix technology is best for better color quality and sharpness. (6X zoom and 4 battery power is bonus!!) I was lucky I bought it form C'city so I can go back within a month and gat it change or return it!! ;)for those who are high pixel rage maniac(like me)- high pixel doesn't affect ur picture quality if u wanna take normal postcard size prints it will help u to just take big copy and 3.2 range is good enough for around 10X12 inch picture.never buy HP digi cam i bough 1 from Amazon and return it in 2 days becs of poooooooor picture quality(Sony is not so bad)-----UPDATE: actually i returned this and bought another one see all my reviews--------", "Date": "January 3, 2004"}, {"Title": "A wonderful 5 meg camera", "Author": "\"pokerplayer\"", "ReviewID": "R15V3UB3192V4S", "Overall": "5.0", "Content": "For the most part, I love Sony products. I used to use the old Sony Mavica when they first came out and was looking for a replacement. To my suprise, a group of very good friends did research & found that for the price, this camera was hard to beat & ended up gifting this to me. Nice friends eh?The camera is very well thought out with controls that are not only easy to understand, but easy to use as well. There is not much I can say bad about the DSC-P92 except for the 16M memory stick like others mentioned leaves a lot to be desired. My friends saw fit to include a 128M stick & I just recently went and bought a 512M PRO stick, so available space for pictures is no longer an issue.Picture quality is simply amazing and if you use software like Adobe Photoshop 7, anything in your imagination can be done. This is one of the best and easiest cameras to use out there. Virtually all my friends have digital cameras ranging from Cannons to Nikons. When price, quality, features & ease of use is considered, the DSC-P92 is a winner in my book.If you consider buying this camera, keep in mind that you'll definetly want to get at least a 128M memory stick upgrade, and that the batteries are not Lithium-Ion, but are 2100 mAh NiMH rechargeable AA batteries instead, so getting extra batteries would be a must as well.", "Date": "July 18, 2003"}, {"Title": "Defect", "Author": "J. A. Spoelker", "ReviewID": "R2E08M07KRBTT0", "Overall": "3.0", "Content": "We bought this model new at Staples which was our first mistake.  We also bought an extended warranty through Staples which was our second mistake.  This camera took good pictures until it starting humming after less than a year of use.  Turns out there is something wrong with the shutter and the total bill is $375.  Staples will not pay to get it fixed even under their extended warranty.  They are cutting us a check for the purchase price but will not refund the $50 for the warranty or the $25 deposit I paid to get it fixed.  Bottom line,  probably a decent camera but never buy a camera or extended warranty at staples.", "Date": "March 10, 2005"}, {"Title": "VERY fragile LCD, terrible customer service", "Author": "David A. Thomas \"ASUDRDAVET\"", "ReviewID": "R13L6LZ0DFWSH4", "Overall": "1.0", "Content": "My wife bought me this camera for Christmas.  After taking a few shots, I dropped the camera in a padded case about four feet to a carpeted floor.  The minimal impact caused the LCD display to malfunction.  The problem was not covered by either the store's extended service plan or the Sony warranty.  Sony wanted more then the cost of the new camera to repair it!!  One of their customer service representatives actually told my wife to \"treat the camera like you would a TV!\"  Well, I typically don't take my TV skiing, hiking or boating with me!  Poor product, poor organization, poor customer service.  I will never buy a Sony product again!", "Date": "February 18, 2005"}, {"Title": "Great.", "Author": null, "ReviewID": "R19M63DRH1WX3J", "Overall": "5.0", "Content": "This camera was actually a \"replacement camera\" for an HP 5 megapixel camera I purchaged a few weeks ago. I was extremely disappointed with almost everything about HP's camera. However, this Sony model is leaps and bounds better than that one.  The battery use was a huge reason for me to return the HP camera, and this camera has excellent battery use. The Macro focus was pretty much broken on HP's camera, and works wonderfully on this one. The only thing that HP has over this camera is image quality, and even then it's a negligible difference.", "Date": "January 7, 2004"}, {"Title": "Great Camera.", "Author": "Christian Van Der Henst", "ReviewID": "R2ZVEETP0VTAMM", "Overall": "5.0", "Content": "I been working with cybershot since a couple years ago. First I got the DSC-71 and then the U-30.  Now I'm using the P-92 with great results in my pictures.  The 5mp and the zoom works fine and it's easy to use..", "Date": "April 20, 2004"}, {"Title": "Dont waste your money", "Author": "Joseph K. Odell", "ReviewID": "R2T5X23X4LQA5J", "Overall": "1.0", "Content": "This camera is laughably bad. i had an Olympus and literally wore it out. I was then reluctantly talked into this piece of garbage. The pictures are dark and blurry. As a digital camera enthusiast i truly hate this camera and am out $300 on it.", "Date": "November 3, 2004"}, {"Title": "Good photos under the right circumstances...", "Author": "Dani Nymeyer", "ReviewID": "R182RUN7ZMJR8P", "Overall": "3.0", "Content": "I actually have not bought this camera, I borrowed it from my aunt for a few days and I must say that I was only some-what impressed with the camera.  The main reason I wanted to try this camera out is because it is a very compact, high pixel resolution, point-and-shoot camera.  I mean, five mega-pixels?  That's amazing for the size, I currently own a Minolta Dimage Z2 and it has 4.0MP resolution and it is a much bigger camera.  I am quite impressed with the pictures this camera takes, I can blow up the pictures quite a few sizes larger on my computer and it does not pixelate.This camera uses two AA batteries which is something that I prefer over lithium batteries. (lithium batteries cannot be found everywhere, and you must take care of them because they are not as easy to replace)  However, the battery life seems to be a little short.  Fully charged batteries may last you one full day, so I would recommend buying another set of batteries.If you are not looking for professional photography, then this is probably a pretty good choice of camera for you.  I didn't find so much satisfaction with it because I was looking to play around with the manual functions, but there are so very few, and you cannot even change the shutter speed which is something that I really want in a camera.The 3x optical zoon works nicely.  It's fairly silent, not as noisy as the start-up (which is not too bad itself, but is definitely noisy). However, once you go beyond 3x you switch into the digital zooming...which is not so good because you dramatically lose picture quality.  For that reason, I never zoom in beyond 3x, and 3x hardly seems like anything when you know that there are other camera out there that zoom in more.I found trouble taking pictures indoors...you either have to have a tripod to set it on or have very bright lighting.  Most people who buy this point-and-shoot camera probably are not looking for proffessional cameras, therefore many may not use tripods, meaning that if you take pictures indoors you must be sure that there is plenty of light, or else it will result in blurry pictures.It comes with a 16mb card...this, I found, to be quite humorous.  I mean, how many pictures can you fit on that thing?  Five to ten, about.  I was laughing a bit, luckily I also had handy the 128mb card, which I found worked out fine.Overall, under the right conditions it is a fairly nice camera.  It is not something that I would recommend to everyone, though.  Are you looking for a simple, point-and-shoot camera?  Then this is not a bad choice at all, 5MP, and under the company name Sony...that's pretty good, I think.Like I said before, I borrowed this camera from my aunt, and after trying it out I have decided not to buy it.  Mainly because it is point-and-shoot and that is not what I am looking for.  My aunt who only uses point-and-shoot loves this camera, though.  So ponder a little on that before buying this camera.", "Date": "March 14, 2005"}, {"Title": "crap", "Author": "frantic mom", "ReviewID": "R1BAAHYQW7Q3RJ", "Overall": "1.0", "Content": "pros:  sizecons:  double exposures  blurry shots  the flash works sometimes  the picture takes about 3 seconds to actually be capturedI have a kodak 2mp camera from about 5 yrs ago-and the shutter is much quicker.  I use the camera purely for snap shots of my kids-and I cant have a 2 yr old \"hold on\" while I wait for the camera to focus. I was very disapointed in this camera-especially after seeing all the great reviews.", "Date": "December 16, 2003"}, {"Title": "Blurry", "Author": "Valerie Adolph \"Coast Journal\"", "ReviewID": "R7MF2FSOSX2RP", "Overall": "2.0", "Content": "I tried out a number of 5 mp digital cameras and this was the worst by far. I couldn't get a decent picture whether it was scenery, portrait or whatever, every picture was blurry. I really thought Sony would have better quality control than this.", "Date": "January 2, 2004"}, {"Title": "Great Camera!", "Author": null, "ReviewID": "R1CDNFJI2139MI", "Overall": "5.0", "Content": "This camera really does deliver the goods, and for much less money than other models out there. I couldn't be happier with it!", "Date": "December 22, 2003"}, {"Title": "No Black & White mode", "Author": null, "ReviewID": "R2APPNTFT3YJHD", "Overall": "3.0", "Content": "I had a 3.2MP Sony camera about two years ago. It was great. Why I got rid of it, I'll never know. Even though it was a bit bulkier than the DSCP92, it took great photos and MPEGs and I could fit so much on a 128MB memory stick. With this one, five photos and a 30-second MPEG are all I can fit on a 16MB memory stick. But what bothers me most is that it doesn't offer Black & White as an optional photo mode! WHY IS THAT? It's such a common option and yields some beautiful photos. I mean, come on, how often do you take photos in Sepia, Solarize or--what's the other one--Sunburst? PLEASE! I'm tempted to take this camera back. Even my parents' cheap Kodak digital camera offers B&W.", "Date": "June 1, 2004"}, {"Title": "I'd give it less if I could", "Author": "Rhea Saffar", "ReviewID": "R2ELD5S6RLJECS", "Overall": "1.0", "Content": "I will start by saying that most of my electronic devices are sony.  I buy TV's, VCR's, DVD players, all sony.  I was happy for just over three months, right about the time the warranty ran out.  I now have a pretty expensive paper weight.  Sony responded by telling me that I could pay them another $150 to have them fix it with no additional guarentees.  My complaints were taken, and I was reassured to know that my problems would help them fix things in the future with their cameras.  Unfortunately, that does nothing for my camera now.  Sony used to be the end all of electronics.  I don't know if I could ever buy one again.  Buy a canon, my elph has done great for years.", "Date": "April 21, 2004"}, {"Title": "Good product, but there's something wrong with amazon...", "Author": null, "ReviewID": "RORR06S3H6RP4", "Overall": "4.0", "Content": "First of all, I compared this camera with the Sony's P10, and they have basically the exact same specs, the only noticable differents is the design, P10 has a 16MB more capacity on the included Memory Stick, but for a price that is more than $50. I bought this camera and bought a Sony 128MB Memory Stick for $50 bucks. What I don't understand what amazon is doing is that I had one item in my shopping cart for 10 minutes at one moment, and the price had increased. Also amazon.com prices of most of their products are actually higher than their other retailer listed on amazon.com web site. What mystified me also is when I make an order, the order doesn't show up until like the next day, and when its about to shop, it does the same thing. What's going on with amazon?????", "Date": "January 23, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "5 megapixel sensor (2592 x 1944 pixels) for enlargements up to 20 x 30 inches\n3x optical zoom plus 4x digital zoom (12x total)\nMPEG VX movie mode with audio recording; 1.5-inch LCD\nIncludes 16 MB Memory Stick; compatible with Memory Stick Pro media\nPowered by 2100 mAh NiMH rechargeable AA batteries (included with charger); connects with PCs and Macs compatible with USB 2.0", "Name": "Sony DSCP92 Cyber-shot 5MP Digital Camera w/ 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41Q8RFH9T2L._SX300_.jpg", "ProductID": "B00008O35Y"}}