{"Reviews": [{"Title": "Disappointing pictures", "Author": "S. Logston", "ReviewID": "R2YX3UECXSFBFP", "Overall": "2.0", "Content": "I saw this model in person and fell instantly in love with the design.  It was very compact, had a good sized LCD, and seemed to be a reasonable price for an ultra-compact with 5 MP.  I ended it up ordering it from Amazon and upon receiving it and testing it out, I must say I was pretty disappointed in it.General build/condition: I still love the design and feel of the camera.  However, the one that I got was noticeably dirty.  There were black smudges around the top panel, and there were little pieces of reside all over that just kept the camera from feeling \"brand new.\"  Nothing else in the box looked like it had been touched so I don't imagine that it was a return.  It wasn't a big deal, I cleaned it up but it was just a bad way to greet my new camera.LCD: At the same time I purchased this, I also purchased a Canon A510 for my mother.  I tested them out side-by-side.  I noticed that while the LCD on the Olympus was bigger - which was nice - it looked very grainy.  Not sharp at all.  And this was while the Canon still had its protective covering on the LCD.  The Olympus did not come with a protective covering on its LCD.  Protective covering meaning that little clear plastic square that they always put over sensitive things on electronics.Picture quality: I must say I am a complete novice when it comes to photography.  I hardly ever veer from the default settings.  I took a series of comparison pictures with my current camera (an Olympus D-40), my mom's new camera, and my new camera.  The Canon was the obvious winner.  The pictures from the Olympus D-630 were very washed out from the flash and was oversaturated with redness.  I noticed that my older Olympus also was very red-toned, but it was not nearly as bad as the D-630.  I'm sure if you know how to manipulate the different settings and fix photos in Photoshop, it wouldn't be a problem.  But that's not how I would use my camera in an everyday setting, so it was the dealbreaker.I wanted to share my experience with this camera because since it is such a new model, there aren't any real reviews out there for it.  I hope this will help someone in my position make a more informed decision.", "Date": "April 28, 2005"}, {"Title": "Do not buy this camera!", "Author": "Mary G", "ReviewID": "R1TBYY5GI8A0QT", "Overall": "1.0", "Content": "I waited to buy this camera for 1 month- even resisted buying other cameras when I really needed it for a trip.  The camera itself looks great- but the photos it takes are REALLY bad.  My 5 yr old 3 megapixel camera took much better and much sharper pictures.  It makes my old camera look like a 7 megapixel camera in comparison.  The indoor pics are so grainy I'd be embarrassed to show them to anyone.  The flash is not very good.  The LCD screen is pretty bad too.  I gave it a chance after taking a few pics in the store- that maybe it would look better on the computer screen.  I was wrong and I'm taking the camera back.  What I really wanted was to throw it out the window- but I will take it back and get a different camera.  It's pretty, but a waste of time and money.  Olympus should be ashamed of putting out such a poor quality camera. Do not buy!", "Date": "May 3, 2005"}, {"Title": "Don't let the appearance fool you", "Author": "Laura", "ReviewID": "R3P7J34NI5AIR8", "Overall": "1.0", "Content": "I'm very disappointed in the quality of the pictures this camera takes. It takes fine pictures in bright sunlight, but once you get inside it won't focus. The majority of the pictures come out blurry and the few that are actually in focus are visibly grainy.My boyfriend and I bought this camera so that he wouldn't have to always be borrowing mine (a Pentax Optio 550). At first I really admired the camera because of it's sleek design, and low price. It seemed like a great camera for a novice with all of it's presets. I will admit that some of the presets do work pretty well (like the night shot), but you have to go through a few menus to get there.My advice, don't waste your money. If you want a camera to take photos and not just wave around to show your friends, you should look elsewhere.", "Date": "December 5, 2005"}, {"Title": "1 Year Later drop to 3 stars", "Author": "D. J. Klett", "ReviewID": "R2C7V2L7TT6ZPL", "Overall": "5.0", "Content": "Very light.... takes great pictures OUTSIDE. This camera does not take great inside (bar, club, or other location) pictures.I just upgraded from a Olympus C-2100 and while i miss the 10X Optical zoom, the 3X works well and the 5MP allows for clear pictures that can be cropped.There are three buttons under the screen that make picture management easy. One button puts you in picture taking mode, another puts you in picture viewing mode, and the third button deletes the picture from memory.The rest of the menu options are organized very well. Using the buttons it is very easy to select what type of picture mode you want (Portrait, Night-time, Landscape, etc.) and it provides a very easy way to switch between picture quallity (2560 x 1920,  1600 x 1200,  640 x 480). The camera has other features too but these are the ones I use the most.I also recommend purchasing a xD Memory card. For the Avg user I would say either the 256MB or 512MB (I use the 256MB). Just some numbers for the 512...2560 x 1920 SHQ - 128 Shots2560 x 1920 HQ  -  416 Shots1600 x 1200 SQ1 - 1024 Shots640 x 480  SQ2  -  2896 ShotsUsing the 265MB card and the 2560 x 1920 HQ gives me 208 shots. As I travel with my laptop, that is more than enough space for me.", "Date": "April 26, 2005"}, {"Title": "don't be cheated", "Author": "john", "ReviewID": "R2BIU8LJSFVGYC", "Overall": "1.0", "Content": "This camera is a terrible one, it is unable to take a simple clear piture, no less than satisfied picture. In a word, it is the worst one I ever met. Don't be cheated!!! Don't waste your money. It definitely will waste your time too, as it take you half day to call for the Return Authorization, and mail it to merchant. Don't be so foolish as me!!!", "Date": "December 8, 2005"}, {"Title": "Terrible Indoors", "Author": "Mrs. B", "ReviewID": "R2TOZX1M05SAP", "Overall": "1.0", "Content": "This camera is great, as long as you use it outside on a sunny day.  Indoors, this camera is horrible, no matter what setting you use, flash or no flash, etc...  The pictures will be terribly grainy, fuzzy, un-viewable.  My parents own the same camera, so I know mine is not a lemon.  Theirs is also horrible.  We will both be returning these cameras.  Its unfortunate, becuase I also own a D-550 which works great.  Olympus must have changed the recipe.Do not buy this camera, you will be very sad.", "Date": "January 9, 2006"}, {"Title": "NICE!", "Author": "Robert Stellingwerf", "ReviewID": "R1QU3HU5CQR5WC", "Overall": "4.0", "Content": "We have been usning this camera for over a year with excellect results. Works well both indoor and out. VERY small and lightweight, easy to take along. View feature on a button is especially handy.", "Date": "June 4, 2006"}, {"Title": "worst Olympus camera I ever had", "Author": "NY READER", "ReviewID": "R3TT2LPABNSD3S", "Overall": "1.0", "Content": "I've had many Olympus cameras and were very happy with the color and quality (enough to keep buying Olympus).  The D630, however, does not follow the same standards. I'm not sure why the change, but my complaints follow consistantly with the other user's opions below; mostly grainy photos, dark lifeless color and a lack of general crispness that is seen on just about any other camera you pick up nowadays.Another complaint is that it takes a long time from the moment you turn it on until you're able to take a photo. I've missed many photo opportunties waiting in that time.", "Date": "September 4, 2007"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0007SXIXQ"}}