{"Reviews": [{"Title": "Great little camera", "Author": "Ouachita Mike \"Cabin Guy\"", "ReviewID": "R35M0AGGXS4RLP", "Overall": "5.0", "Content": "This small camera worked great out of the box.  I set it up in our vacation cabin and it gives a nice view of the whole room.  I connected it to an inexpensive video capture card and will be able to access it via [...] via the internet (we have Hughes Satellite internet).  I will be able to check the cabin from home to make sure that everything is alright.  I may purchase more of these to put at the front door and other locations.  For the money you can't beat this camera.  I'm not sure how well it will work out for an outdoor location, but I am pleased with the indoor picture-it looks much like a picture that you see from security cameras, certainly not high resolution, but for money I don't think you will find a better bargain.", "Date": "June 13, 2008"}, {"Title": "Read up on it before you buy!", "Author": "Steve", "ReviewID": "R19NMWK8M9IHVS", "Overall": "1.0", "Content": "Just got this today. Hooked it up straight to my tv to test it. There was no color, and the picture was very jumpy, like a vcr will do when the tracking needs adjusting...only, as far as I can tell, there's no way to adjust it!. It came in an original, unopened package, but no instructions/troubleshooting guide was included. So I looked it up. Apparently this product used to be good, but the quality has since been downgraded drastically. It's supposably got night vision, but what used to be infrared sensors are now just fake pieces of plastic. Apparently the microphone has been removed also. Now I have a camera that is basically useless. Always read up on a product before you buy!", "Date": "December 9, 2009"}, {"Title": "wonderful", "Author": "hrtf", "ReviewID": "R2JD9U96NV36X2", "Overall": "5.0", "Content": "great quality/sharpness/color, can easily see individual leaves blowing in yard from 20-30 feet. latest version of camera doesn't have a microphone and IR leds have been replaced with black plastic pieces.make sure to focus camera (twist lens) for best picture.", "Date": "August 19, 2008"}, {"Title": "Not what is pictured", "Author": "Michael Mazzotta \"NetflixHaiku.com\"", "ReviewID": "R2TWXOBNY8BRC5", "Overall": "1.0", "Content": "I just received this item, and I am livid. . . the picture on the website CLEARLY shows the camera with 6 ir LEDs. . . but when you get the product, there's just little black plastic nubs where the LEDs should be.  I needed this as an IR camera. . . I guess I got swindled.Thanks, Guys.  You got my money, now there's nothing I can do.", "Date": "April 7, 2011"}, {"Title": "good for the price", "Author": "Nathan L. Warshawsky \"Nate\"", "ReviewID": "R27Q9EKVCR7S3R", "Overall": "4.0", "Content": "bought to spy on my self while I sleep. the wife said I was doing some crazy stuff in my sleep. so wanted a cheap way to watch my self sleep. a real camcorder is expensive. didnt need sound. picture reselution is ok. not high quality and a little grainy. but is a security cam so this is normal. very small and compact. could hide it well. doesnt do well in low light though. just hook up to vcr and have fun with it.", "Date": "August 25, 2009"}, {"Title": "Beware", "Author": "Howard \"mentrius\"", "ReviewID": "R4OZ5PS8DI2LK", "Overall": "1.0", "Content": "Image is crappy like a VCD without adjusting, no night vision. Waste of money and time", "Date": "July 28, 2010"}, {"Title": "Extremely Dissappointed", "Author": "Mcole", "ReviewID": "R1RAP7R8JYBVCS", "Overall": "1.0", "Content": "Even though the picture shows an audio cable this camera DOES NOT come with audio capability. The \"Dark\" functionality of this camera is nonexistent. Just a black screen for us. Like the Infrared LED's are not working. Took a gamble on the cheap price on this one and lost. Not even worth the hassle to return to amazon. VERY Disappointing.", "Date": "August 30, 2008"}, {"Title": "POOR CAMERA,NO SOUND", "Author": "Badleg2011", "ReviewID": "R19RRDF2WE7JAL", "Overall": "1.0", "Content": "Not a great cam ,but if you are on a budget this would be a great  cam but there are others in the same price range that are better than this but Im using mine  as of now,just recieved it about a week ago,came fast but  I think they are false advertising ,but i would buy another if needed for the price if this cam holds up,we\"ll see, I'll keep u posted...", "Date": "February 20, 2011"}, {"Title": "no good for NTSC", "Author": "Jason J. Perry \"jsunperry\"", "ReviewID": "R2AQACL1JCOZR0", "Overall": "1.0", "Content": "Camera is B&W;, not color, but the big problem is that the picture rolls.  My guess is that it's outputting a PAL signal(whereas it advertises NTSC).  If you've got a PAL compatible system, and are willing to gamble,  this might do the trick.", "Date": "January 27, 2010"}, {"Title": "The Short Power Cord and Heavy Power Adapter are TOO HEAVY for such a small light camera", "Author": "Jon", "ReviewID": "R1KIO1F4AFVA8J", "Overall": "4.0", "Content": "It would be a great little camera for the price, but ... The power cord is too short (an extension cord is a simple solution) HOWEVER the Power Adapter (the 2 prong end you plug into the wall outlet) is very large, heavy and irregularly long and narrow and pulls down on the camera so easily and with so much force it not only makes positioning the camera difficult, it actually pulls the cord out of the camera itself.So far, I've been able to kind of push the cord back up and get the camera to work again, but I think it is close to coming out completely, making the camera totally unusable.Needs lots of light, just like all digital imaging.  The more light, the better the picture quality.  Too much bright daylight causes total 'white out' of the image.", "Date": "November 10, 2009"}, {"Title": "great little camera", "Author": "Music Man", "ReviewID": "R37GVAM4TKBSGB", "Overall": "5.0", "Content": "I bought this camera not for sound but picture.  It does the job well.... sound would have been good with it but for my purposes it is great.", "Date": "May 29, 2009"}, {"Title": "SOSO Buy", "Author": "Amazonbuyer", "ReviewID": "R1TUVE2JQ6VFM5", "Overall": "2.0", "Content": "Cord is short. You get what you pay for. Camera works but picture is a 6 or 7 out of 10. I would not buy again or recommend. Just pay a little more money and get something that will work.", "Date": "October 8, 2011"}, {"Title": "the item shown in the photo amazon is not the shipping", "Author": "Cesar F. Hernandez Ochoa \"cesar\"", "ReviewID": "R27W6828NGAV17", "Overall": "2.0", "Content": "the item shown in the photo amazon is not the shipping,first photo shows it has 3 RCA (2 audio and 1 video) but in reality only brings a 2 cables for video and one for the charger.second in the box clearly states that have night vision but also has, as the 6 clear lens for night vision in the picture amazon but they are black and are not functional.", "Date": "June 19, 2011"}, {"Title": "small, but cheap", "Author": "Thomas Richard", "ReviewID": "RWQO5FZAIVI2E", "Overall": "3.0", "Content": "Worth the price, but be warned:  the unit operates on an input voltage of 5v, and there is a 78L05 in a lump in the input wires(the supplied power supply is 8V) An advantage is that it can be focused.Despite the picture, the unit has no infrared, just little clear dots on the front. AND; some come with very crude audio, and some not.", "Date": "November 17, 2010"}, {"Title": "NOT for low light", "Author": "Stephenm27TX \"Home Stuff Psycho\"", "ReviewID": "R2FE390SJQ2C2Y", "Overall": "1.0", "Content": "Seriously, do yourself a favor and buy a camera with infared. This camera has no picture in low light unless you count black and red snow as a picture. And it requires lots of light to recieve a clear quality picture. It's not even worth the low price. A cheap webcam would be better!", "Date": "July 29, 2009"}, {"Title": "shoddy workmanship", "Author": "R. Hallowell", "ReviewID": "RMVCLW5LFUXQ6", "Overall": "1.0", "Content": "the camera worked once or twice, but overall, i am very unsatisfied. do yourself a favor and buy something else.", "Date": "March 13, 2009"}, {"Title": "too bad", "Author": "Juan Burbano", "ReviewID": "R4E5C43EIKD4L", "Overall": "1.0", "Content": "i buy this camera days ago.this item is not the same that i bougth , i receive a camera only with video, not audio.when you se the picture you see that the camera come with audio an video.", "Date": "July 8, 2008"}, {"Title": "Not as small as led to believe No Tech Details Yet", "Author": "ElectoEverything", "ReviewID": "R2588G5JBRREPM", "Overall": "4.0", "Content": "I received this 6/3/2008.  It was $16.99. The weight is about 2x as anormal plastic camera. The stainless steel might have some advantage.It's more durable do a hard knock but while plastic might bend and comeback this would dent. I can't see an advantage to stainless case.LENSThe lens was so very tight when I got it. It appeared to be crossthreaded. I could not turn it by hand being a strong man it worried me.Using a thick soft cloth between a pair of slip joint water pliers itwas easy to turn and then was loose.  It was simply stuck. It turnsfine now.  A sping keeps tension on the lens so it stays where you setit.VIDEO QUALITYI have no info yet. Will update you if I can.POWER REQUIREMENTSThis came with a 9 volt adapter plug and a power supply of 12 volts at 100ma.  The unit has 6 IR leds.  The fact that they don't have an offswitch nor do I think they shut off in daylight since I see no sensormakes me think they waste power if you're running from a 9v battery.9v battery is about 300mah. So this means it will run 3 hours before youcan't use it.  The leds probably add 30ma or more to the powerdraw. More would be my guess otherwise they would not be useful past afew inches.HACKING:If you want to take apart the camera there are 2 Phillips screws in theback to facilitate this.  While the LEDS would be on the other side ofany circuit board there might be a wire or other easy method to turn themoff to save power when on battery.If you do open it as I might let's put up the video or images. I can makean animated gif if you like.Figure out  for  ajajaj at rediff to contact", "Date": "June 6, 2008"}, {"Title": "Do not use with HDTV", "Author": "Marc", "ReviewID": "R1QLVPO54TQR8R", "Overall": "3.0", "Content": "Looks great on an old boob tube, but who has those anymore. The HDTV works but looks like crap. Still, it's very inexpensive and worth the money, my 3 stars are given out of disappointment. I got what I payed for though. Decent product for the price.", "Date": "April 1, 2012"}, {"Title": "camera man", "Author": "shotgunman", "ReviewID": "R12WYYOVY1GNTY", "Overall": "3.0", "Content": "you get what you pay for here. that said both cameras funtion, but one would not work with the cabling. i had to install it using a simple rca cable. the problem had something to do with the bnc connector and it was not the cable itself as it worked well with my other cameras. the second camera was flawless. i bought two in hopes that one would work :)", "Date": "November 20, 2011"}, {"Title": "small camera", "Author": "Electroman", "ReviewID": "R1O3ZADQTCT54O", "Overall": "4.0", "Content": "This is a great litte camera exept for no night vision or sound also hard to hang you have to take the camera off the bracket to hang it. but over all easy to hide and a great camera with good picture quality btw the picture is ntsc not pal so b aware of that.", "Date": "July 28, 2011"}, {"Title": "Cheap and quality", "Author": "Emilio", "ReviewID": "RE9O86ESVVH65", "Overall": "4.0", "Content": "This product I have drawn much attention since its image is of very good quality, others their small size makes it easy to place anywhere. 100% recommend this product.", "Date": "July 19, 2010"}, {"Title": "excellent", "Author": "jose jimenez \"SOLO BUENO!!!\"", "ReviewID": "RRJ78LPG3UV7P", "Overall": "5.0", "Content": "simply the best more than I expected,small and functional", "Date": "April 10, 2009"}, {"Title": "About what I expected from a $15 CCTV camera", "Author": "Darkwave Fan", "ReviewID": "R2CSO8I8SO7XCI", "Overall": "2.0", "Content": "This a cheap CCTV camera. The video if very grainy. It's good enough to see if someone is standing in the hallway outside your door, or to see if someone is waiting in the public area of your business,  but don't expect much detail. It's sensitive to infrared. When I point my infrared remote controls at the lens, they show up nice and bright on screen.", "Date": "February 9, 2009"}, {"Title": "Cheap Camera low res output", "Author": "M. V. Damiano", "ReviewID": "R1F2I23C30PD0Z", "Overall": "3.0", "Content": "Works well for the price you pay. Plan to use it to monitor basement on upstairs TV.", "Date": "August 31, 2010"}, {"Title": "good for the price", "Author": "Frank Angelini", "ReviewID": "RPQQBDZIAG1QZ", "Overall": "3.0", "Content": "Good deal for the price.I thought it had a mic,but it did not,but i still am very happy with it.", "Date": "May 18, 2009"}, {"Title": "NO GOOD @ ALL", "Author": "FLACO", "ReviewID": "RNX5LWVQ4LSOL", "Overall": "1.0", "Content": "never worked since delivered... Contacted seller with no answer...DO NOT PURCHASE THIS ITEM FROM SELLER...", "Date": "January 22, 2009"}, {"Title": "Disappointed", "Author": "S. Bromm", "ReviewID": "R2ILHBNFTA51LK", "Overall": "1.0", "Content": "I bought the wireless version of this camera some time ago and have been very satisfied with it.  I thought I would try the wired product and was very disappointed in it.  It would not work (no power to camera thus no picture) with the cable that I purchased with it even though other cameras worked fine on that cable.  While the camera did have a great picture when I first hooked it up as soon as the sun came up the picture faded out entirely and never did come back.  This camera was not located in direct sun--just a sunny location.  I would not buy this camera again.", "Date": "December 8, 2008"}, {"Title": "No Directions on How to Operate this Item", "Author": "Janie Stapleton", "ReviewID": "R5RTS4K9210W2", "Overall": "1.0", "Content": "How do I operate this item?  I need to know how to hook this item up.", "Date": "August 23, 2009"}, {"Title": "Wow", "Author": "Washingtongirl", "ReviewID": "RN86QOS49FYTJ", "Overall": "1.0", "Content": "I finally recieved the camera and as i open the box it seems i dont even have a cord to plug into my computer or any instructions on how the camera works. Then when i finally get the other part, i plug everything in and guess what happens... NOTHING!!! And, when the camera isent even goin it still manages to heat up and burn me at  touch. If you are looking at this product i would recomend that NO ONE ever gets it.", "Date": "September 11, 2010"}, {"Title": "Bueno", "Author": "Emilio Sequera \"segrol\"", "ReviewID": "R3H908ISUCA519", "Overall": "3.0", "Content": "Buena imagen de video , pero no tiene audio y es una lastima. la imagen que esta en la web no corresponde con el producto", "Date": "February 6, 2010"}, {"Title": "promedio", "Author": "Francisco Javier Urquia \"biker\"", "ReviewID": "R2EFKQ2FHMF2VV", "Overall": "2.0", "Content": "No tiene buena definicion de imagen despues de 8 metros, por lo que solo sirve para interiores y de muy pequeno tamano.", "Date": "December 14, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "AC Power Adapter Included  Battery Power Adapter Included  High sensitivity (0.5 Lux)  Easily Build your own Security System\nConnect the pinhole to any standard television or VCR with the RCA cable (cable not included)\nPlug the AC-DC +8V 200mA Power Adapter into the power jack of the camera Adjust the lens of the camera to its best position\nDimensions: 0.875 oz. (Net Weight) 1.125 oz. (Gross Weight) 0.725 inches x 0.875 inches x 0.875 inches (W x L x H)\nRetail Package Content: Color Camera Battery Power Adapter AC Power Adapter", "Name": "Wired Color CCTV Security Camera with AC Adapter", "ImgURL": "http://ecx.images-amazon.com/images/I/31yloB8tAQL._SX300_.jpg", "ProductID": "B000V0AHRA"}}