{"Reviews": [{"Title": "One of the best on the market", "Author": "Kodiak", "ReviewID": "R3RTB2HIFS7G0C", "Overall": "5.0", "Content": "I am a total caveman when it comes to things digital.  I have had digital cameras before but always felt reluctant to use them as they were too complicated, batteries ran out, the viewing screen was too small, and you had to wait a long time between shots.  Well, I am here to tell you to buy this machine.  It is great: simple to use; rechargable batteries, large viewing screen; very short wait between shots; AND it connects right up to the Kodak Easy Share printer (or you can remove the SD media and stick that into the printer) and makes exceptional quality photos.  For $200 you can't beat this camera.", "Date": "July 5, 2007"}, {"Title": "A great camera!", "Author": "melissajme \"melissajme\"", "ReviewID": "R3Q4J41J01U8O7", "Overall": "5.0", "Content": "I got this camera for Christmas and was impressed that I was taking pictures literally within a minute of charging the battery.  It's so easy to use, you don't even really need a manual, the joystick and control panel are very intuitive and simple.  Even easier than my old APS camera! I had resisted upgrading because I saw so many people struggle with \"programming\" their cameras - the user guide for my Dad's Sony is 50 pages - yuck, too much hassle!  But this is about as point-and-shoot as it gets.However, I became trepidacious after reading the negative online reviews of the camera.  So, I took about a gazillion pictures to test it: self portraits, people, cats, close-ups of the detail in my Christmas decorations, indoor, outdoor, daytime, nighttime.  I used as many of the modes as I could.  I choose a couple dozen representative shots for printing (NOTE:  I don't print my own, I upload them for printing at my local Walgreens).  I was more than happy with the results: all the pictures came out beautifully, far exceeding my expectations.So, as a camera for normal use (vacations, holidays, friends, family & pets), I'm thrilled.  The speed hasn't been an issue; I still miss a few shots of my cats (they're not overly cooperative...), but not any more than with any other camera, 35mm, APS, or digital, that I've ever had. However, I don't have children so I can't comment on how appopriate this camera is for catching sports and play all the other kids' action.I haven't used the video much, but to be honest, I considered that more of a novelty in a camera in this price range. If I was looking to shoot quality video, I'd expect to pay accordingly.  To me, that's the kind of advanced feature that needs some input from Consumer Reports.I think this is the perfect camera for the casual photographer and/or the technically-challenged.  I'm very happy with it and can't wait to start scrapbooking all my new pictures!", "Date": "January 5, 2008"}, {"Title": "so-so printed pictures", "Author": "K. Nguyen", "ReviewID": "RO1RAV7N7LG62", "Overall": "3.0", "Content": "I want to give this 3 1/2 stars, but it's not possible so I'm giving it 3 stars.  Bought the Kodak EasyShare V1003 in July for my mom.  She's never had a digital camera before so I was looking for something easy to use, not too many complicated buttons.  The camera was easy for her to learn how to use.  The problem came when we printed out some pictures.  The quality of the printed pictures was iffy.  Some shots were stunning, great color, unbelievable detail.  Others looked much worse than they did on the camera's LCD screen and the computer screen.  I noticed that bad shots occured most often when we took pictures of people inside.  Faces were not very detailed, and everything came out much darker than it looked on the camera's and computer's screens.  I played around with the camera a lot over the past week, taking lots of test shots in different settings, and I've come to the conclusion that the camera has problems with taking photos of groups of people (bad facial detailing) in indoor situations from more than five feet away.  If you stand pretty close to someone, the camera usually does ok (flash can sometimes be too powerful, washing out details and colors) but faces are blurry when you stand further away compared to the output of other digital cameras (my relatives have Canon and Sony cameras).  The pictures are ok, certainly comparable in quality to our old 35mm film camera from the 90s.  It's just that other modern digital cameras can capture much finer detail of faces in in-door situations than this Kodak.  I've learned the hard way that megapixels aren't everything, camera lens and in-camera processing matters alot too.  I've just ordered a 7 megapixel Canon model for my mother.  My sister has this Canon and the print output from her camera is fantastic compared to what we've gotten from this Kodak.  Shop around, higher megapixels don't translate into better details in photos.", "Date": "October 8, 2007"}, {"Title": "Wonderful camera!", "Author": "Amanda M. Stephens", "ReviewID": "R1VYWIBR2FVJ9D", "Overall": "5.0", "Content": "I've started taking more trips, and my little Sony Cybershot 3.2MP wasn't doing it for me anymore.  I picked this camera up on a whim, because it was under $200 and 10MP--the most I'd seen in this price range.What a great camera!  First, it's light and small, so I can stick it in my pocket on hikes or vacations.  Second, the colors are vibrant and the pictures sharp.  And third (my favorite) it has a timer so I can actually be IN the pictures I'm taking!", "Date": "August 12, 2007"}, {"Title": "Great for everyday use", "Author": "graphic girl \"vpg55\"", "ReviewID": "R1KC5JWV6ISS9I", "Overall": "5.0", "Content": "I have this camera and I like using it.  The controls are easy to navigate.  I disagree with the comment about it being too slow.  The camera is set to have a preview after a picture is taken.  You can change this setting to less time or press the shutter button half way down and the camera will take a picture immediately after the last.  Good value for 10mp.", "Date": "October 3, 2007"}, {"Title": "Not Thrilled", "Author": "Annon", "ReviewID": "R5NL5AE97C57G", "Overall": "2.0", "Content": "I spent 2 years looking and waiting for the right camera to come around.  I tried another Kodak easyshare as I like the EASY-ness of them.  I was not happy with that one, so went to the V1003.  I bought it at circuit city BIG mistake (they have a 14 day return) It is not possible to make sure ALL the features on the camera work in 14 days.  And with this camera, they do not work.  The video is VERY noisy! The camera keeps adjusting (why I don't know) and the internal noise causes noise in the audio of the video.  Also with 10MP you'd expect perfection of colors etc.  Not the case. There is a strange blue glow off of white objects in certain shots.  The settings for beach etc for adjust to bright light changes the colors also.  I took a picture of a pond covered in lily pads and the sun was at an angle that was too bright.  I used the beach settings and a few others for bright light and the colors of the pond changed.  The pond appears bright blue in some areas.....believe me this pond is NOT blue.  Trying to take sun pictures with the \"filters\" causes a weird flower pattern...like a daisy.  My previous camera was a simple Kodak Easyshare 3.1 and it took better pictures, and better video (no noise!).The buttons on the camera are inset a bit and very small.  I have small hands and it still is difficult to press the buttons.  I usually have to press on several times to get it to come on.  As far as speed, there is too much time between pressing the shutter button and waiting for the green light to actually take the picture.  If you expect to get a shot of something that happens quickly and you need your camera to respond quickly...you'll miss your shot.  If this camera comes down in price significantly, it might be an ok buy...  As you will see by my edit, this is another thing you have to do BEFORE you can do something else with the camera.  There are too many steps and too many ways to miss what you want to capture.EDIT and UPDATE: to solve the problem with the noise in video if anyone has this issue, I found the following:When the camera is in the video mode. You can change the AF Control setting to Single Auto Focus mode, Please folow these steps:1. Turn the camera on.2. Set your camera to video mode.3. Press menu button.4. Move the Joystick up/down to highlight AF Control then press the OK button.5. Choose Single AF, then press the OK button.6. Press the Menu button to exit.", "Date": "October 4, 2007"}, {"Title": "easy to use", "Author": "D. Moskaluk", "ReviewID": "R1VHB3UQLERD6S", "Overall": "4.0", "Content": "This camera is tiny enough to fit in your back pocket & you don't have to wait a week & a half after hitting the power button to start shooting. I especially love the anti blur setting as I am usually laughing at my subjects! It's really easy to switch from mode to mode, & the view screen is huge!", "Date": "October 22, 2007"}, {"Title": "Lots of MP for cheaper, you get what you pay for.", "Author": "J. Taihei \"happy_happy\"", "ReviewID": "R1FU79B9CYMU6C", "Overall": "3.0", "Content": "I'm torn about this camera.On the one hand, it has really nice picture quality: really brilliant colors with enough light and lots of MPs for the price. Then again pictures tend to run a bit blurry at times and the response time button-to-capture lags a bit.Overall I'm really happy with the pictures. This camera is a nice fit for what I need: I don't take photos often, and when I do I like doing artsy quiet shots. If you're more on-the-go and need higher performance, go with a CANON.AUDIO CLICKING ON VIDEO FEATURE: Videos will have a clicking noise in the audio. It wasn't until I read another Amazon review that I discovered this happens because of the Auto Focus feature. Thankfully it's stopped since I've turned the feature off. Absolutely annoying design flaw.", "Date": "February 10, 2008"}, {"Title": "Could Use Some Improvement", "Author": "T. M. Urquhart Jr. \"1955 T-Bird\"", "ReviewID": "RBM0JMMK4IK7M", "Overall": "2.0", "Content": "I bought the V1003 last week. I was impressed with the 10 MP, the price, and the printing dock. I have one question however. Will you tell me what the heck it is with Kodak that they feel a viewfinder is no longer needed??? I get a bit queasy trying to focus and compose an image with just the screen in the back. A coupled viewfinder would really make it sweet in my humble opinion. Also, the shutter recycling time is indeed a bit slow, and I don't know why. I am reconsidering my purchase for a SONY or a CANON or NIKON. It's really too bad, though! It could have been much nicer if the camera was properly designed and engineered in the first place.", "Date": "October 17, 2007"}, {"Title": "Product Review", "Author": "William T. Laffond", "ReviewID": "RZ2DB6TOJXOKR", "Overall": "3.0", "Content": "The camera is compact, fairly light and easy to use, and takes high quality photos. I think the camera is a good value. Negatives: doesn't dock to an older Easy Share version I had; the software takes longer to start than older version; I miss having a viewfinder, this camera just has a view screen; battery cover slips open fairly easily if you hold it with a pincer grip; camera body fairly slippery, could use some coarse grip surfaces. Overall satisfied, but things I would change, and wish I had considered beforehand.", "Date": "June 1, 2008"}, {"Title": "Pictures too dark", "Author": "Kimberly Howells", "ReviewID": "R19A65GJJGQ8DH", "Overall": "3.0", "Content": "I bought the Kodak V1003 in late August 2007 at Target...I find I am constantly using the PERFECT TOUCH technology feature  in the camera  to brighten up the picture...  I primarily take pictures of people....I personally like brighter pictures than this camera takes...Although I love all the user- friendly features  and  durability  (dropped it on hard concrete...no damage!)  of this Kodak camera ...I decided to buy  the Canon Powershot SD 750 Elph camera last week from amazon and so far I am much  happier with the brightness of this Canon camera's  pictures!", "Date": "December 1, 2007"}, {"Title": "Highly Disappointing", "Author": "E. Santos", "ReviewID": "RRRPEPDAMRKO8", "Overall": "1.0", "Content": "I bought this camera for only $140 and that price was one of the defining factors for my purchase.  I had read all the reviews and yet I thought that this camera couldn't be as bad as some people thought.  Sadly it is.  I used to own the kodak V603, which was only 6 MP, but it still performed better than this camera.  That camera was ruined after I went kayaking and I and my camera went into the water.  I also used to own the C340 but my brother broke that.  It was only 5 MP and did better than this camera.  Next time I'll buy the V1253 as a replacement.Negatives:-The picture quality is low compared to the V603 except in bright light where it is about the same.  Pictures come out blurry indoors and often grainy.-In the sun, you can't see the screen at all.-You can hear the camera zoom in and out when taking video, and even when it's quiet you hear too much noise.-IT FREEZES A LOT.  That pissed me off the most.  I thought it was just my camera but my mom's friend has the same problem with the same camera.-The button to turn off flash is in the upper lefthand corner, which is inconvenient for people like me who prefer it next to the On/Off button to immediately turn flash off.-After using it awhile, it says \"Unrecognized file format\" when I go into review to view pictures it recognized only a minute ago.  To fix that i just turn it off and leave it alone for awhile, but it does get annoying.-Takes a long time to focus.-Takes awhile to turn on.-The camera itself is pretty thick.-Anti-blur mode makes pictures grainy instead of blurry.Positive:-It looks nice.-Good pictures outdoors.-The joystick is fun.-Perfect touch technology right on the camera.-Over 20 modes to choose from to fit your setting, including panorama.Overall, this camera sucks. Even though i haven't tried the V1253, I'd recommend trying that over this camera.  At least the V1253 has face recognition, HD video, and a large screen that may actually show excellent quality pictures the V1003 can't deliver.", "Date": "January 5, 2008"}, {"Title": "Simple and great camera, even for a beginner. Great pictures.", "Author": "T Thomas \"Joe Kool 2112\"", "ReviewID": "R9L7HNCTD3LZY", "Overall": "5.0", "Content": "Bought mine about three weeks ago. I love it and it is fairly simple to use. The instuctions with it are a bit vague. However you can figure it out. I would suggest that when you puchase the camera, that you buy a protective bag for it so as not to damage or scratch the LCD screen. Takes great photos though. I think it was worth the money spent for it.", "Date": "August 23, 2007"}, {"Title": "Don't bother!!", "Author": "C. mccabe", "ReviewID": "R2JSC6YX2MIDUP", "Overall": "2.0", "Content": "I bought this camera because I thought 10 megapixels would be better than the Kodak I have with 4 megapixels.  It's not!  Pictures come out blurry and it take so long for the camera to actually take the picture that your subject has chaged position and the picture looks terrible anyway.  I would not have bought this camera if I had a chance to play with it first.It also needs a separate cord to work with the easyshare printer dock 6000 that I already owned.  I am going to buy another camera and let my 15 year old have this one.  Don't waste your money.", "Date": "January 28, 2008"}, {"Title": "Great photos, sleek design", "Author": "V. Tyagi", "ReviewID": "RS3YJVICQ5RXJ", "Overall": "5.0", "Content": "I upgraded from my ancient olympus 2.1 MP to this one and I am very satisfied with the images, so far. The camera is sleek, lightweight and the battery is good enough for the weekend shooting. Default automatic settings work for me. I set the camera at the max ISO setting and the pictures came out grainy. Fiddeling with various setings didn't work for me. I am a novice, point and shoot camera user. Reverting to automatic settings worked great. I have not tried various modes (night time, snow, motion, etc.).The photos so far have remarkable resolution and color quality. I added a 2GB memory card and it provides for ~700 photos. That is more than what I need, however, I never have to worry about using up all hte space. I can shoot all I want.The joystick control is vastly superior to regular controls. The large LCD screen is a good aid and is helpful for picture reviews. The photo review is fast for a 10MP camera. Delete/undelete/forward/back all work at good speed.There is no viewfinder. Finding a snug camera case for this baby was painful. It is \"just\" bigger than the pocket size cases. The camera does not charge with the usb cable. The battery has to be in place (and charged) for uploading the photos. Having two cables (one for charging and other for uploading photos) is a bit of a pain. I would expect to do both jobs with one cable.Overall, an excellent camera under $200.", "Date": "December 31, 2007"}, {"Title": "Kodak v1003", "Author": "D. Sosa", "ReviewID": "R20EN0WJ5S0XSP", "Overall": "2.0", "Content": "I received one of these as a gift.  It's a cute little point-and-shoot, with rounded edges that look like they were inspired by Apple.  The screen is monstrous and the interface is simple enough.  Personally I like the joystick-type navigation, although some of my more heavy-handed friends struggle with its delicate operation.  A refreshing piece of innovation is the ability to recharge the battery while it is onboard the camera.  External battery chargers are great for those who carry more than one battery and like to have a backup charging at all times, but I have never met one of those people.  This is where I will cease praising the V1003.  There are several reasons I returned the camera after owning it for three days.  Firstly, the lack of an ultrasonic autofocus motor means any video taken by a moving photographer, or of a moving subject, will be laden with clicks that drown out recorded audio.  This is because the motor that controls the AF makes enough noise to be picked up by the camera's microphone.  The problem can be avoided by turning off the autofocus, but in many (read most) cases, this is completely unacceptable.  Secondly, the shutter lag was so severe that I found myself taking pictures of the future.  Even after pressing the shutter button half way so that it would finish focusing, once the shutter was triggered, almost two thirds of a second would elapse before the camera recorded anything.  As most of my intended use for a camera is action photography, shutter lag is unacceptable.  Finally, I have no use for 10 megapixels.  If you plan to make posters, it becomes slightly more appropriate, but you will be disappointed by the quality obtained with the camera's tiny lens.  It's been stated before in other reviews, so I won't harp on it, but beyond 5 or 6MP, pixel-count is just another way of keeping up with the Jonses.  Instead of pixels, I look for features and responsiveness, and although the Kodak V1003 is ample in the first department, it lacks severely in the second.  (For those who may be curious, I purchased a Canon S5 IS as a replacement.  I will review it in a while.)", "Date": "December 30, 2007"}, {"Title": "Proof that more megapixels does not mean more quality", "Author": "J. Hoffman", "ReviewID": "R3KSD350MRYWVZ", "Overall": "1.0", "Content": "The V1003 was purchased for my wife as a diaper bag camera, as my Canon S2 is too bulky to carry around for those cute impromptu baby shots.  Unfortunately, this camera did not live up to the quality you would expect from a 10 megapixel camera.  The pictures taken indoors with the camera were always very dark, even in well lit rooms.  When you got close enough to a subject to offset the darkness factor (i.e., <3 feet away), it would be decently lit, but the picture would appear very blue in hue due to the flash.  After doing a little research, I have found that the modern point and shoots with a high number of megapixels do not have large enough lenses to support the number of megapixels.  I picked up a Nikon CoolPix 11 camera with 6 megapixels to do a side by side comparison.  The difference between the Nikon and the Kodak were like night and day.  My recommendation would be to find yourself an older model point and shoot camera with a max of 6 megapixels.", "Date": "January 3, 2008"}, {"Title": "Nice Image Quality", "Author": "T. Lin", "ReviewID": "R19Z76ORLP86PJ", "Overall": "4.0", "Content": "Bought this camera as my spare.  It works well and very portable.  It takes the auto focus longer than usual to focus.  So if you need quick shot, you may end up with a blurry one.  Every Kodak is different.  I have seen other Kodak auto focusing instantly.  This V1003 takes too long to focus.One thing I must say is Kodak should protect this camera LCD display with another hardened glass.  I see many cases of broken LCD and you know when that happens, you might as well get another one.", "Date": "January 9, 2010"}, {"Title": "a bit hit and miss, really.", "Author": "Carly Campbell", "ReviewID": "RP9AEA6E78E1W", "Overall": "3.0", "Content": "I did a bit of research on this camera before making the decision to buy it. Apparently I just didn't do enough.At 10mp, the quality is disappointing. I've had cameras that were perhaps 4mp and yet they still took sharper, clearer photos. As much as I play with the settings, and no matter how steady the photo is or how careful I am in paying attention to the lighting, I still find it falling behind my first Kodak from 1998. This is not a good thing, in the least.It is also very fragile! I had to send in my first one for a broken lens when it slipped out of my hand and hit the table, even though I had the wrist strap on and the fall was perhaps a few inches.On the bright side, it is extremely easy to navigate, and focuses very well, even if the quality isn't as wonderful as I had been hoping. All in all, it is a fairly good camera for its price, and beats out most other digitals in its price range. However, I think I'll do a bit more review reading the next time I buy a camera -- and probably go crawling back to Nikon for the quality/durability combo I desire.", "Date": "December 6, 2008"}, {"Title": "Awesome Camera---well worth the money.", "Author": "S. Gassman \"crazy cat lady\"", "ReviewID": "R3IRWCXXMRE3FM", "Overall": "5.0", "Content": "I had purchased the V803 back in march of 07 and was super happy with it. just the fact that it comes in purple was awesome enough for me. the actually picture taking was super clear and crispy. all the features are super easy to use.but then my friend dropped it and all the pictures that were taken after that were blurry. so i ended up needing another one. so i purchased the V1003 Which i might add is the one i originally wanted back then anyway. But i got it. and it works exactly the same, has super crispy pictures, very easy navigation. i absolutely love the camera.i even bought one for my mom for mother's day b/c she kept griping about mine, so i finally got her one. she always had crappy cameras in the past and i believed she deserved it. she's beed using it non stop and has had no bad experiences yet.i would highly recommend this camera to anyone who wants a digital camera, its a great product and im VERY happy with it. i would just suggest not dropping it. :)", "Date": "June 21, 2008"}, {"Title": "Kodak EasyShare V1003, Pink Rose", "Author": "I. Poss \"springtime49\"", "ReviewID": "RNQ7NEMK0ZLRH", "Overall": "4.0", "Content": "I like this camera.  I don't like that it takes a couple seconds to auto focus though.  It is a 10mp, I would have thought it would be quicker than it is.  It's small enough to carry in my purse, which I like.  I like the video clips I can take as well.", "Date": "March 23, 2008"}, {"Title": "Sweet!", "Author": "Noms Services Ltd \"Noms\"", "ReviewID": "R196BJXP30CPMC", "Overall": "4.0", "Content": "I think this is one of the best Kodak has ever produced. It is stylish and sleek. It looks more like a cell phone than a camera and thats the attraction. It includes the AC charger unlike the 12MP I just bought which u have to charge with your Pc or laptop if u dont buy the AC charger saperately. It doesn't really blur like the 12MP too. The 12MP is just better only by the shutter speed. I would recommend this better than the 12MP", "Date": "March 20, 2008"}, {"Title": "OMG This camera is amazing!!!!", "Author": "Kathleen Sader", "ReviewID": "R3G011EIV6OKAW", "Overall": "5.0", "Content": "I was looking at this camera and thought it looked a little bit bad, so i read more reviews and it seemed alright so i went ahead and bought it.  i opened the box and charged it right away i got it all charged and started taking pictures. I was stunned by the quality of the picture. THIS IS A FIVE STAR ITEM!!!!!!!WELL WORTH THE MONEY!!!!!!", "Date": "March 19, 2008"}, {"Title": "Kodak V1003", "Author": "crushergk \"Crushergk\"", "ReviewID": "R3NE2NDDJ74XNA", "Overall": "4.0", "Content": "Kodak EasyShare V1003 10MP Digital Camera with 3x Optical Zoom (Midnight Black)Have found this camera very easy to work with - would recommend", "Date": "March 10, 2008"}, {"Title": "Fragile LCD... Watch out..", "Author": "G. Chang", "ReviewID": "R21TF6LRLDXIBK", "Overall": "1.0", "Content": "Nice one but ....After 3 month light use, this camera has a crack on the LCD. I don't remember to drop it or hit it with something, but always within my pocket if I carry it.  It is useless now. Still function but can't see the picture.  Search internet for the LCD replacement and found some complain about how fragile this LCD was. Always a little bit late to catch the quality...There is a poor guy broke his second V1003 LCD. Not me for sure. Maybe a design issue..I will pay attention on the quality next time. You need to buy a protection case and good luck...", "Date": "March 3, 2008"}, {"Title": "I like my camera", "Author": "Cheraun Malone \"Reliable_2u\"", "ReviewID": "R29T65OKCBMTJG", "Overall": "4.0", "Content": "The camera is great, and the pictures turn out awesome! I have gotten so many compliments on the physical appearance of it. The only thing I am not so fond of the camera about it when i press the shutter button, it focuses itself and then flashes. So, for me it is too much of a delay when taking the picture. Other than that I love the camara and the quality of my pics.", "Date": "February 25, 2008"}, {"Title": "kodak easyshare v1003 review", "Author": "T. Eiler", "ReviewID": "R17OQUHWLWH246", "Overall": "4.0", "Content": "This is a good camera for the price. Very easy to use, and takes great pictures. The menu is easy to navigate, and always a plus, its rechargable.", "Date": "January 23, 2008"}, {"Title": "1st Easy Share", "Author": "Ethel R. Swan \"Ethel Swan\"", "ReviewID": "R1YZMPILB2ITC5", "Overall": "4.0", "Content": "This is my 1st Easy Share and I love it. I've had so much fun with it. I keep it in my purse at all times, just in case. I've not used to video jet but will soon I'm sure.", "Date": "January 17, 2008"}, {"Title": "Great Camera", "Author": null, "ReviewID": "R3DPRZH6LB9B0B", "Overall": "4.0", "Content": "I got this camera for Christmas, and I love it. It takes really amazing photos, and has great features, like PerfectTouch technology. I just wish you could put a frame on the pictures, like some other cameras do. But besides that, I only have good things to say about the Kodak V1003 Digital Camera.", "Date": "January 17, 2008"}, {"Title": "Come as promised but Not satisfy with picture quality", "Author": "Xeng Yang", "ReviewID": "R1MND9SU94FNPN", "Overall": "3.0", "Content": "Great Price and come as promised but the camera just turned me away.  I guess I better sticked with Asian Technology better.Picture quality even with 10MP still not crystal clear shot, and takes too long to get picture reviewed.", "Date": "January 12, 2008"}, {"Title": "GREAT!!!!!!!!1", "Author": "SIPPY \"SIPPY\"", "ReviewID": "R3S6PNQWVBNJSM", "Overall": "5.0", "Content": "THIS IS THE BEST CAMERA I HAVE EVER HAD AND I HAVE GONE THROUGH MANY CAMERAS.  LOVE THE PLUG-IN RECHARGER.  THAT'S WHY I BOUGHT 3 MORE FOR THE GRANDDAUGHTERS LAST CHRISTMAS.  RECEIVED THE PRODUCT IN SHORT PERIOD OF TIME STILL IN WRAPPER.  I LOVE IT.", "Date": "January 7, 2008"}, {"Title": "excellent buy for beginners", "Author": "Paul C. Carter", "ReviewID": "R1NCPJO7N87J1N", "Overall": "5.0", "Content": "Kodak Easy Share camera V1003 is excellent for those persons like my self, who is just starting out and is unsure about the type of camera to to purchase.It is easy to use and is very user friendly.There is a five a minute video feature and you can do correction to pictures.You can also delete the pictures that didn'tcome out so great.Plus lots of other cool features It's a Great buy.", "Date": "September 17, 2007"}, {"Title": "Good pictures, Way to slow!", "Author": "Gregory K. Brown \"G. Brown\"", "ReviewID": "RIJMTJ49PNJU", "Overall": "3.0", "Content": "We took this camera to Disneyland. It was very slow powering on. Once it was on, and you were able to snap a shot it would take several seconds to process the image. This delay caused us to miss a lot of good shots. We took it back.", "Date": "August 29, 2007"}, {"Title": "Great Value", "Author": "Melissa", "ReviewID": "R2UVQNMH2GBWN3", "Overall": "4.0", "Content": "This is the third Kodak EasyShare Camera I've owned.  They've all been loyal and true.  It's fairly durable and easy to use, however it has more options and features than earlier models and it a little more advanced.  Takes wonderful portraits and good stills as well.", "Date": "July 25, 2007"}, {"Title": "LCD IS TOO DELICATE / IS NOT PROTECTED", "Author": "Gift Card Recipient \"Digital Camera LOVER\"", "ReviewID": "R33L2M8JSS1HDS", "Overall": "1.0", "Content": "This camera has good quality pics/ 10 MB. It is kind of slow. I bought one about 25 days ago. THERE IS ONE BIG FLAW. The LCD screen is not protected. Many digital cameras do have a protective HARD COVER for the LCD screen. This camera is TOO DELICATE. I have bought more than 5 digital cameras for the last 5 years. This is the FIRST ONE that I broke the LCD screen.", "Date": "August 22, 2007"}, {"Title": "Nice Little Camera", "Author": "Bruce Tracy", "ReviewID": "R3JVF1IC8Q41JU", "Overall": "4.0", "Content": "This is a nice little compact camera.  The picture quality has been very good, but I wish it had a view finder.  It is sometimes hard to compose pictures using the screen alone.", "Date": "February 27, 2008"}, {"Title": "GreatBuy!", "Author": "WDJ2013", "ReviewID": "R1L2SF4A8K4D7E", "Overall": "4.0", "Content": "This product was like brand new. It works perfect for family photos! It is just what I needed! I coludnt ask for a better buy!", "Date": "July 31, 2013"}, {"Title": "Great Camera!", "Author": "Addie Strom", "ReviewID": "R3M4NIVVI1C94J", "Overall": "5.0", "Content": "I love how simple it is to take great photos and it is just a really great little camera. I definately love it.", "Date": "June 12, 2013"}, {"Title": "great buy", "Author": "rljw", "ReviewID": "R3FFD6DL0EWNTQ", "Overall": "4.0", "Content": "Had a blue one just like this and was really bummed when the screen was accidentally fractured, rendering un-usable. This black Camera arrived on time and looks brand new, Although it did not come in a box and had no accessories, and seems to have the small defect of making more noise than usual when turning on or off and when zooming in, it works really great and looks fantastic. Thanks again", "Date": "March 15, 2013"}, {"Title": "Dead on Arrival", "Author": "Gene", "ReviewID": "R2GYKVK501NYN6", "Overall": "1.0", "Content": "The nicest thing I can say about this is it was easy to return for credit.  I had high hopes of replacing a like camera whose screen had died but this one had the same problem.", "Date": "March 3, 2013"}, {"Title": "Camera", "Author": "Marin", "ReviewID": "RXBNWDB7BR0WV", "Overall": "5.0", "Content": "Had this same camera before, it got broke, was very happy to find one that was the same .It works great", "Date": "January 27, 2013"}, {"Title": "The camera is great", "Author": "Paula Pawloski", "ReviewID": "R2S2UEA9IARO91", "Overall": "4.0", "Content": "The camera arrived very quickly and is in great working order. All the information displayed in the description was accurate.", "Date": "December 26, 2012"}, {"Title": "Great camera for most situations", "Author": "C. Juszak", "ReviewID": "R1GZYULO524COM", "Overall": "4.0", "Content": "Great compact digital camera. I've owned this for a few years now and I've taken *thousands* of pictures with it. It's also very robust. I've dropped it numerous times onto hard surfaces and it continues to take great point-and-shoot photos. I've owned about half a dozen point-and-shoot digital cameras and this one takes the best pictures. My biggest complaint is that the camera takes a while to reset between taking pictures (might have something to do with the media card) and it's not a great low-light camera (works fine close range with flash of course, but sometimes a little overexposed). I also like the way it recharges (plug camera right into charger without taking battery out) and the VERY long battery life. For trickier shots (low light without flash, etc) I have a much \"fancier\" (and much more expensive) DSLR camera. However, this camera works great for 95% of \"normal\" situations, and is compact and robust for carrying around and traveling.", "Date": "November 26, 2011"}, {"Title": "great still images, poor video quality", "Author": "Diego", "ReviewID": "R2PM7QKSTKZFLN", "Overall": "3.0", "Content": "i got this camera as a christmas present. my aunt knows how much i love photography and she gave me this camera which was originally hers. it's a pretty good camera. the still images are great. especially in landscape mode. it's very easy to use and i love the built in picture editor. the thing that really disappointed me was the lack of video quality, especially at night. the video quality is terrible. you have to be in a well lit enviroment (and i mean VERY well lit) for this camera to work, including in still images. and for still images at night, like all cameras, it has to be stabilized when you take a picture, otherwise the picture will be blurry. but still, the pictures are great and it's a good camera. but the video quality is just, terrible.", "Date": "October 1, 2011"}, {"Title": "Kodak easy share v1003", "Author": "BIll", "ReviewID": "R2UWDSG7O7DHJG", "Overall": "5.0", "Content": "This camera is easy to use and has many features. I got it to replace the last one I had lost.  I like the many picture settings it has, comes in handy no matter where you are taking pictures.", "Date": "December 27, 2010"}, {"Title": "Nothing but disappointment", "Author": "Curtis Vinson \"GEcrazy\"", "ReviewID": "RA0NC1OU1TSQS", "Overall": "1.0", "Content": "The V1003 is my third Kodak camera.  The first two went to our children.  The picture quality was good only in bright light situations.  The flash did not provide adequate light indoors.  I resorted to taking pictures indoors without the flash for better results.  Blurring and grainy pictures led me to Kodak for help.  They were useful in assisting me in syncing my flash to the camera but results were only slightly better.  I really lost the fun in point and shoot picture taking because this camera always disappointed.", "Date": "May 12, 2010"}, {"Title": "Sweet little camera for unprofessionals", "Author": "Hilton", "ReviewID": "R340XLVYWS1KOL", "Overall": "3.0", "Content": "Okay I've had this camera for about two or three years. The reason why I got it was because of the colors it came in. But someone ended up giving it to me as a gift in BLACK anyway.All in all, I like this camera. It's my second digital camera since the 90s, and yeah it's a huge step up. I've dented the outside, majority of the print and stickers have worn themselves off, and I've dropped it on more than one occasion and it's held up. And it's small enough to fit in  my jeans pocket, down my shirt or just throw in my purse.What I like about it, is the ease of picking settings. When you're at a concert, down in the pits somewhere with general admission, you don't have time to fuss around with turning wheels or going through menus. This camera is exceedingly easy to switch between different modes. You press one button, and you have a screen full of options from portrait, low light, custom settings, etc. So you pick one, take a quick pic, look at the result...not good enough? Go ahead and switch it. You don't have to go in and out of menus while the crowd is pushing you from every which way, it's just super fast to find a setting you want.Also you don't need a degree to use it. It pretty much just has ONE button to take photos or record a video. Not rocket science, I'm sure anyone would get the hang of it.But it does have it's down sides. The time it takes to take a photo is a bit long. I mean if you're handing this off to a friend to take a pic for you, make sure you TELL them to hold onto it because you can't just press the button and expect it to immediately take the photo. They'll try to give it back to you and you're left with some super blur.And now that I've gotten into product photography though to sell things off my website this camera has been quite frustrating! It is such an adventure getting it to focus. And yes, like other reviewers say, it tends to go click.click.click randomly loud enough to be heard on the video mode. At first I thought I broke it! Recently I've switched it manual focus instead of auto and I haven't seen much of a difference.All in all, it's durable, it's cool maybe if you are a teenager or in the market for your FIRST digital camera for it's ease of use, but if you want to get professional with it, you'll probably throw it out the window.", "Date": "March 24, 2010"}, {"Title": "this camera for 40 dollars is good", "Author": "Mar \"Marinera\"", "ReviewID": "R1JV0O4YBGI04S", "Overall": "5.0", "Content": "you spend 200 dollars in cameras and this one is better than lots of canons i owned.love the color quality in this camera.", "Date": "March 23, 2010"}, {"Title": "It's ok, but....", "Author": "Roxy", "ReviewID": "R2KU0VVICRTL5P", "Overall": "3.0", "Content": "I ordered this camera because I had one before, which I ran over with my car....don't ask!  I am never able to view the screen well in bright outdoor light.The used camera arrived without a cord to connect to my computer or a charger, but luckily I had my old ones. There were also personal photos still left from previous owner on the camera, which should have been deleted before being sent to me.", "Date": "December 15, 2009"}, {"Title": "Great Camera !", "Author": "H. Gress", "ReviewID": "RZGUDIR03GZ2Q", "Overall": "5.0", "Content": "Great camera, takes nice clear photos. Does not have a shutter delay like most. Takes video and does all the little things like black and white and sepia. Overall A great camera. So easy even grandma has used it.", "Date": "December 14, 2009"}, {"Title": "LCD viewer", "Author": "M. Rosenbaum", "ReviewID": "R1ZW5239US7F73", "Overall": "2.0", "Content": "The LCD screen freezes, leaving it un-usable to view pictures.  Happened 16 months after purchase of the camera.  Second time it has happened with a Kodak camera.  Kodak wants to charge $80 to repair.  Will be looking at Nikon and Canon.Night pictures are terrible.", "Date": "August 4, 2009"}, {"Title": "Awful Camera", "Author": "Jellybean", "ReviewID": "RVKU5H2SY3Q7D", "Overall": "2.0", "Content": "This is our 2nd Kodak,we loved our old one, but someone bought us this one for a gift and I regret giving away the old one.  I have a toddler and I have zero pictures of her face, I have plenty of the back or side of her head.  This has the WORST delay ever.  My pictures are often blurry and out of focus.  Our old camera was a 5 MP and took much much better pictures than this thing.  I would not recommend this camera to anyone.  Kodak missed the spot with this camera.I did  have to give it two stars because, it is compact and very easy to use.  Kodak is very user friendly, the buttons are labeled well and the menues are easy to follow.", "Date": "August 3, 2009"}, {"Title": "Not the best Picture Quality", "Author": "T. Davis", "ReviewID": "RJ0CZQ12LOP1J", "Overall": "2.0", "Content": "The camera came on time, but im not happy with the picture quality of this camera. Taking pictures from a distance is a waste of tiem cause the pictures come out horrible, even when i use the various settings.", "Date": "July 12, 2009"}, {"Title": "Long lag time, but good for the price", "Author": "trinaelaine \"trina\"", "ReviewID": "R3EIJ8EYW9O6G5", "Overall": "3.0", "Content": "My daughter had a camera like this that broke, so I bought her another one. We shared it on a trip and I was surprised by the long lag time that this camera has when taking pictures! Had I tried it before we went, I wouldn't have bought this model again. If can adjust to the lag time, the pictures do turn out good.", "Date": "July 4, 2009"}, {"Title": "Many Fixes", "Author": "Samssisters", "ReviewID": "R36XQHPYAECM7Q", "Overall": "2.0", "Content": "When I had bought this camera two years ago, I was thrilled. It produced crystal clear pictures and very, very easy to use. Within a couple of months of my purchase, though, the camera would turn off in the middle of when I was taking a picture, but the lens would still be zoomed out and I couldn't turn it back on for a while. That happened a couple of times. Then, I took it on a cruise and plugged it into the right voltage outlet so that it could charge and when I took it out, it wasn't charged and it wouldn't turn on. I spend about $80 on  getting it fixed and I had to get it fixed often. Great pictures, but it wasn't worth how many times I had to get it fixed and how much it cost to get it fixed.Kodak EasyShare V1003 10MP Digital Camera with 3x Optical Zoom (Slate Gray)", "Date": "June 11, 2009"}, {"Title": "Kodak Easyshare V1003 [Steve Sap Review]", "Author": "Steve Sap \"Steve Sap! Your #1 Asian Guy!\"", "ReviewID": "R1HTS36KH4KI77", "Overall": "5.0", "Content": "This is basically the big brother to the Kodak Easyshare V803. This is a great camera. It's beautiful, sleek and small but i pack's a punch. 10 mega pixels comes out beautifully. So if you want something small and compact that take beautiful picture this is the camera to get!Picture Quality= 10/10Video Recording= 7/10Media Interface= 10/10 [easy to use]", "Date": "May 11, 2009"}, {"Title": "Great and Affordable Camera", "Author": "picture perfect \"Michele\"", "ReviewID": "R3B0XVTG350RQR", "Overall": "5.0", "Content": "The Kodak Easyshare is one of the best cameras out right now and it's affordable. I have a friend that has he V803 and i purchased the V1003 from Amazon and they are both great Cameras I would recommend this camera to anyone.", "Date": "March 20, 2009"}, {"Title": "great for electronic uneducated people", "Author": "V. Blankley", "ReviewID": "RP08Q79S7K3SA", "Overall": "4.0", "Content": "i bought this camera for a birthday gift for my mother who is computer and electronic elliterate, she figured it out with no problems and it is a great little camera.", "Date": "December 16, 2008"}, {"Title": "pros and cons", "Author": "Howard Jefferson", "ReviewID": "RSXOJ6AAB8SUC", "Overall": "4.0", "Content": "Yes, It's 10MP, very clear. But, I also experienced the problem of some buzz with the button. And, it seems that I need to learn to deal with the weak light.", "Date": "December 2, 2008"}, {"Title": "why the picture comes with too much light or black in the low light spots", "Author": "M. Patel \"mp\"", "ReviewID": "R1JYHSCBV1T661", "Overall": "3.0", "Content": "i bought this camera a month before. i don't get why the picture comes so dark in the low light places. sometimes it comes completely dark in those cases. i am tired of it because i can't take any decent picture in the clubs or at night. does anyone have any suggestion about it. i played with manual but nothing seems to work. please help me if someone know about it.", "Date": "November 19, 2008"}, {"Title": "third times the charm??", "Author": "Kelcey_Bea", "ReviewID": "R3DFOTSP40WMC9", "Overall": "3.0", "Content": "I bought this camera while i was pregnant because i figured i would need a good one for when the baby came. I was really pleased with it and it did take really nice photos. The videos werent the best but i suppose you cant expect perfect videos from a cheap camera. When the baby came i had someone running around the delivery room snapping pictures. Every other picture was blurry. I dont know if it was the operator or just the camera. I did notice that you had to wait a long time and have the perfect light for the camera to take really good pics. After having the camera for about 2 or 3 months i had an accident involving dirty baby clothes a misplaced camera and a washing machine...needles to say the camera didnt make it out alive. I decided to go ahead and buy the same camera agian. I was still pleased with it but a little bummed i couldnt find the 10mp for as cheap so instead i had to settle for the 8.2. Anyways im an avid review reader and i had read a couple that said the camera straight up quit working after 6 months. I decided to ignore them because most of the other comments were totally positive. I had my second camera for about 5 months and it died...on its own...no washing machine involved. It was like the Auto Focus just completely quit working for some reason. (really bad timing too because i was at the hospital with my friend while she was having HER baby when i found out it quit working.) Anyway i liked the camera but cant decide if i want to try it out a third time and risk the chance of getting burned.", "Date": "October 30, 2008"}, {"Title": "Fabulous!", "Author": "Fredrick Paul Luna \"Freddy\"", "ReviewID": "RWA2K9RHD59NA", "Overall": "5.0", "Content": "The Camera came quickly and very well wrapped in it's original seal. Just FYI- if you get it threw UPS, the box was thrown to my door from my gate 3 feet away! Other than that, the camera is Fabulous!", "Date": "October 4, 2008"}, {"Title": "Great Camera", "Author": "Karen Newell", "ReviewID": "R3MXSZHNDSP6TK", "Overall": "5.0", "Content": "I purchased this camera for my son, for his girlfriend for christmas.  I have already purchased this same exact camera in the past and the receiver of it loves it.  It takes great pictures.", "Date": "September 30, 2008"}, {"Title": "Kodak Easy Share 10 Pixel Digital Camera", "Author": "Mary C. Albanese", "ReviewID": "RAPLUZPXYHY72", "Overall": "4.0", "Content": "This camera was delivered as promised.  It is my second as I dropped the otherone with the lens open and I am trying to get it repaired. I use it so often I ordered another one. The price is right for the item and I use it often.  The photos are very clear and it is an easy to use camera.  I love it.  It is a bit larger than some digitals but not a problem for me.Kodak EasyShare V1003 10MP Digital Camera with 3x Optical Zoom (Slate Gray)", "Date": "August 31, 2008"}, {"Title": "Bad LCD", "Author": "Jaclyn 0325 \"Jackie\"", "ReviewID": "R1YDCXY5EMSBNF", "Overall": "2.0", "Content": "I recieved this camera as a gift for my birthday in March, and I had to send it back in early May to have the LCD screen repaired, I had not dropped it and the camera hadn't had any impact. It took a couple weeks to get my camera repaired and it worked great. Last night my camera was in the new case I purchased (thinking it would protect it better) which was inside my purse when my purse fell off my sofa. Once again, the LCD Screen is broken. I think it is ridiculous that a camera be so easily ruined. I am not going to pay to have my camera \"fixed\" again, only to have it to break again in a few months. It's a shame because I took some excellent pictures with it, and I really like the panoramic feature.  I wouldn't rcommend this camera unless you're going to treat it like an \"Egg Baby\" for a High School health class.", "Date": "August 27, 2008"}, {"Title": "Excelent", "Author": "Jorge Aray", "ReviewID": "R1HUTCKTMPWEWB", "Overall": "5.0", "Content": "I love this camara... its small, and very easy to use... thanks to adorama for this product!...", "Date": "August 12, 2008"}, {"Title": "no good quality", "Author": "DEMETRUNKS", "ReviewID": "R2E3Z59Z3NKEAV", "Overall": "2.0", "Content": "this camera isnt what we expect, when you take pictures, the camera make change in pictures colors and photos quality is very poor, i repent to buy it.", "Date": "July 25, 2008"}, {"Title": "Picky, picky, picky", "Author": "Knowledgeable User", "ReviewID": "RLHFBDPF5ZL42", "Overall": "4.0", "Content": "Don't believe all the \"expert\" reviews that give this camera low marks.  These clowns are looking for the perfect camera that does not exist.  This camera takes great pictures, is easy to use, has loads of features, is small and compact, and is backed by Kodak.  That's good enough for 99% of us.", "Date": "July 23, 2008"}, {"Title": "not the best", "Author": "T. Collado", "ReviewID": "R2OQTRA53YAD92", "Overall": "2.0", "Content": "This camera has lots of features, but most are not worth it.  The picture quality goes down to nothing when you use digital zoom, and videos and often dark and can not be edited.  The lense is often getting stuck on the open position, so I will return it for refund and probably go back to a FUJI camera.", "Date": "July 14, 2008"}, {"Title": "You get what you pay for", "Author": "Tinkerbell", "ReviewID": "R37DCLLGIO2RT", "Overall": "3.0", "Content": "I bought this camera because I thought it's a great value. I paid $170 a year ago, hard to beat the price considering this is a 10 mp camera.I've given it 3 starts because I do like the quality of the pictures. It's sharp enough for me, I'm not a professional photographer or anything, but I've been taking daily pictures of my baby since she was born and the results have been pretty good with this camera.As far as recording videos,......This camera is terrible. The quality is awful, very grainy and once you transfer the videos to your computer, it's almost impossible to hear the sound. I don't know if I'm doing something wrong - like another reviewer said, the manual is no help whatsoever, you have to figure it all out by trail and error .My brother has recently bought the exact same camera, but 8 mp instead of 10, and much to my surprise his videos have a much better quality than mine. I can't figure out why.", "Date": "July 13, 2008"}, {"Title": "Great Camera!", "Author": "Lisanne Anderson \"Happy Mom\"", "ReviewID": "R3CW352NO7T046", "Overall": "5.0", "Content": "I bought this camera for my daughter's 7th birthday. By the end of the day she had taken about 200 pictures! She can use it easily and fluently. The ONLY downfall is the lack of memory. Don't buy th camera without expecting to buy a memory card also... Though I think this is standard with most cameras anyway. For such a small camera this is an awesome product. GREAT purchase! No regrets!", "Date": "July 9, 2008"}, {"Title": "A beautiful mediocrity", "Author": "R. Trevino \"hd dvd aficionado\"", "ReviewID": "R31BB9WFBRAJM1", "Overall": "3.0", "Content": "First off, let me just say that I'm a Canon believer. The only reason I have this camera is because I got it at work as a prize. I've owned a Canon A40 (2MP) and a Canon A80 (4MP). I've never been too big a fan of Kodak's build quality (cheap plastic on many lower end models) and have always been skeptical about their image quality.The good thing about this camera is that it feels solidly built. I can't really attest to it's durability, as I've never been unfortunate enough to have dropped it. Kudos to Kodak for the appearance of the camera - it's a good size, has a solid weight, and the screen looks really nice. The buttons are small and difficult to distinguish but functional enough. The menu isn't as intuitive as what I've used on my Canon's, acceptable, but not great.The real weakness of this camera lies in it's picture quality. Since my A80 is only 4MP, I figured that this would be a nice upgrade for me, regardless of my preference to Canon's design and interface. I only recently had a real chance to use the camera and it was then that I learned that it's image quality was not adequate for me.I was visiting Sea World, and I took my A80 and the v1003. We were taking pictures with both cameras of the same shows and after I got home, I began comparing the shots in iPhoto. I was disappointed by the amount of noise/grain in the v1003's shots. My Canon shots were generally brighter and certainly not plagued with noise. Even some outdoor shots in bright daylight couldn't match up to those of the Canon. The shutter response was slow, despite prepping for the shot, there was too much lag. Most of the action shots were caught with the Canon. Even more disappointing was the video quality. This camera records at 640x480, much better than my Canon's 320x240, but the compression is horrible. I like that I was able to zoom in and out as I recorded (a feature that my A80 lacks) but I was completely unimpressed after seeing the videos on my computer.Certainly this camera is priced cheaper than what I have paid for either of my Canon's when they were available, but the quality is still inexcusable. I won't say that the camera is completely worthless, but even at Amazon's price, it is a hard sell if you are even remotely serious about the quality of your photos. This is a good camera for \"fun\" occasions and may be enough for a school student to take pictures of their friends. I wouldn't count on it for a major event or a family trip. The v1003 failed to take the roll of my A80 and since then I decided to purchase a Canon SD870.", "Date": "July 7, 2008"}, {"Title": "Fantastic consumer camera", "Author": "Brian Shields \"Ramza\"", "ReviewID": "R2RVXFSF4D401V", "Overall": "5.0", "Content": "This is a great camera for the average consumer. Probably one of the better consumer level cameras. If you want anything better, you're going to have to spend more money on a professional camera.I received the camera as a wedding present to replace my 5 year old Kodak Easyshare 4MP camera.I am very pleased with this gift.The video mode is very nice. I like how it will automatically focus to deal with lighting issues.The quality of the video is also very nice. Obviously not as clean and crisp as a digital camcorder, but still very nice for a camera.The images are very, very excellent, as stated above. I love the variety of pre-set modes that come included with the camera. No longer do I have to mess around with the ISO or shutter or lighting settings. The modes automatically do it for you. Though you may need to tweak the settings a little bit to your liking. Though, make sure to change back the settings when you are done with them, otherwise your pictures will look different. If a mode is selected and you turn it off, the next time you turn it on it will be back in the default Auto mode.I also love how the camera plays sounds whenever there's an error or something else happens. THankfully though, you can turn the sounds off if you don't like them.The only tiny nitpick I have about this product is the battery. The battery works quite fine. It has a long life. The only thing is it is Kodak's own proprietary battery. You cannot use AA's or AAA's you already have. You have to use their own Lithium battery. Again, it really isn't a problem, just a tiny nitpick. Thankfully the battery is very long lasting and charges up fast. From an empty batter to full charge is only 90 minutes or so.All in all, this is the best consumer level digital camera I've ever had, and I've had quite a few. It is easy, lightweight, and provides excellent pictures and settings.", "Date": "July 7, 2008"}, {"Title": "Outdoor not indoor", "Author": "Robert Todd Sturgis \"Murphy\"", "ReviewID": "R3AFCQNQ6UAYX5", "Overall": "3.0", "Content": "I bought this camera last October.  I have been very disappointed with it.  It takes great outdoor pictures but for indoor pictures it is a crap shoot.  They might look good on the screen but once downloaded too often they are blurry or grainy.  The flash can be harsh on the eyes when used, especially with kids and in my opinion make the picture too bright.  And not using the flash the pics are worse than ever.  I am tired of getting cameras that take great outdoor pics and HORRIBLE indoor pictures.  Course I have just been sticking to Kodak easyshare cameras so might be time to change brands.", "Date": "July 6, 2008"}, {"Title": "a kodak moment", "Author": "Teri M. Kmiec \"teri\"", "ReviewID": "RH6KST7T3N9FM", "Overall": "5.0", "Content": "Kodak EasyShare V1003 10MP Digital Camera with 3x Optical Zoom (Midnight Black)what a nice camera!.... you can highlite, crop and fix the photo all in the camera!...also it stores your pics when your memory card runs out....the lcd screen is large and clear and you can see the screen even in the bright sun!....i highly recommend this product!", "Date": "July 2, 2008"}, {"Title": "A little homely looking, but a great camera!", "Author": "RK", "ReviewID": "R14CZORN7BI35R", "Overall": "4.0", "Content": "I just ordered this camera, and so far its perfect for me.  I'm not an avid photographer, I just wanted a cheaper, decent camera that was small enough to keep in my purse. I really like how it comes with a recharable battery instead of needing double A's all the time like cameras I've owned in the past.To me, the look of the camera is a little goofy and unfortunately, the booklet it came with is not helpful at all, but other than that, its great!", "Date": "May 30, 2008"}, {"Title": "Great little camera", "Author": "JP \"JP\"", "ReviewID": "R30YA5B902EWU0", "Overall": "5.0", "Content": "This little camera takes the most awesome pictures.  It is easy to operate with nice features.  Would definately recommend this camera.", "Date": "May 27, 2008"}, {"Title": "Refurbished verses Repaired", "Author": "Lazuras", "ReviewID": "R17QSIU0I4TRWI", "Overall": "5.0", "Content": "I recently got a new Camera for my birthday and I was rolling around with the dog and forgot I had it around my neck and broke the LED Screen.  I sent it to Precison Camera on the net for repair but was looking to buy a new one to replace the old one sad because I had only had it 2 months.  To my Suprise Precision Camera wanted $103.00 to replace the Led screen.  Amazon offered a refurbished camera, like new for a dollar less.  I got a new battery (I kept the old one) and only the box was open.  I was very please with Amazon and very disappointed in the repair cost.  So Amazon is the place to shop.", "Date": "May 16, 2008"}, {"Title": "Highly Recommend", "Author": "Jillian Karnatz \"Jillian K\"", "ReviewID": "RT21YC4CZ7VSP", "Overall": "5.0", "Content": "I love my Camera! It takes awesome pictures, my last camera was only 2MP so this one is so much more better!", "Date": "May 16, 2008"}, {"Title": "Not that bad!!!", "Author": "Leo12", "ReviewID": "R270Y3FSTRMMTD", "Overall": "4.0", "Content": "Too many bad comments about this product. I have to be fair. The quality of the pictures can be as good as that of my Canon SD630 (the auto-focus function is even smarter because it knows where to focus), and much better than my older Sony Cybershot DSC-T5. It also amazes me with the very smart panorama function, allowing me to take 3 different pictures then merge them together to make a wide panorama.That said, it can be the slowest camera I ever had in terms of operation. However, I don't mind that because I don't use it for taking pictures of children. For my personal need, I would give it 4 stars.", "Date": "May 8, 2008"}, {"Title": "Unreliable", "Author": "A. Hawkins \"Real Muzic lover\"", "ReviewID": "R1871L0RICJPNC", "Overall": "1.0", "Content": "Camera battery failed after 3 shots. Could just be the battery but the action shots were out of focus also.", "Date": "April 28, 2008"}, {"Title": "Kodak Digital Approved!!!", "Author": "John Tavcar \"Peter Pan Syndrome\"", "ReviewID": "R2D2W1K5SUAEXT", "Overall": "4.0", "Content": "I think it's a great camera especially for the price! It has a lot of features and I'm technologically challenged so it's taking me a while to figure out all it all it has to offer but I would definitely recommend it to family and friends!!!", "Date": "April 24, 2008"}, {"Title": "V1003 Results", "Author": "RAM \"RAM\"", "ReviewID": "R3I3Z2WHRKZ0DS", "Overall": "4.0", "Content": "Pictures of wildflowers, both distance and close-ups were found to be quite comparable to those taken with my 10x optical Kodak camera.  A \"stitched\" photo of the USS Ronald Reagan came out well.  My only objection to the camera's features it that it doesn't have a viewfinder (very useful when in full sunlight and the screen is hard to see).", "Date": "April 13, 2008"}, {"Title": "Great camera, great price!", "Author": "A. Wilhelm", "ReviewID": "RZZO30POOSTQ9", "Overall": "5.0", "Content": "This camera does a lot for the money. It is easy to use and takes great pictures. I have read very little of the owners manual but am able to figure out the different settings because it is so easy to navigate.  The only thing I could possibly say negative is I have a difficult time with pictures in low light.  That being said, even when they don't turn out so good on the camera when I up load them to the software sent with the camera and do some editing with the light they look great! The red eye removal tool in the software works great also.The other day I took the camera to my sons band competition but forgot the video camera. I hadn't used the video feature of this camera yet so I was leary. It turned out wonderful!For the price I don't think you can go wrong with this camera.", "Date": "April 10, 2008"}, {"Title": "Very good", "Author": "Atterly C. Charles \"Babyd\"", "ReviewID": "R35EPJKL4M3I92", "Overall": "5.0", "Content": "This Kodax camera is very good it keep charge for a very long time. I have no problem with it. i recommend it to everyone", "Date": "April 9, 2008"}, {"Title": "Love it", "Author": "L. Jaramillo", "ReviewID": "R3II0VYHE4ODDG", "Overall": "5.0", "Content": "I really like this camera! it takes a little to get use to the settings but its a really good camera!", "Date": "April 8, 2008"}, {"Title": "Rochester, NY still putting out the goods.", "Author": "David A. Rivera \"DND\"", "ReviewID": "R3BDFN2ELPYS2D", "Overall": "4.0", "Content": "I dont care what anyone says, kodak cameras have THE best color than any other brand and this camera proves it. The pictures are very detailed, even though it only has a 3x zoom, the image can be further zoomed upon on photoshop and still is clear. 2 things I dont like about it is the zoom sound when video recording and how the buttons are spread out, but over all a good camera. Finicky people need to get a grip.", "Date": "April 6, 2008"}, {"Title": "Great buy if you want something simple, yet sophisticated.", "Author": "D. Smith \"DMHS\"", "ReviewID": "RNLXYHKRJA4I2", "Overall": "5.0", "Content": "This camera is a great buy. I recently purchased it and I am very pleased. If you are an amateur or maybe you are really skillful this camera is great for most people. If you need very high specs and zoom and photography is your life then you probably need something more advanced. This camera is worth it and its only $130 dollars. I would recommend purchasing and extended warranty incase something happens. This camera is about $200 dollars in stores. This camera takes great pictures and videos and produces a crisp, clear, sharp, stunning image. I received this camera on time and so far I am very pleased.", "Date": "April 3, 2008"}, {"Title": "Excellent", "Author": "EJ Star", "ReviewID": "R2PN95QZN3LX77", "Overall": "5.0", "Content": "I love this product.  For Christmas I purchased a 7 mega pixel camera that took bad quality pictures.  While I was looking through a Target add, I found this camera and decided to see it in person.  Upon my viewing, I fell in love with this camera, but no one had the color I wanted.  When I looked on Amazon.com I found this camera at a resonable price with the same quality.  I love it!  It takes amazing pictures.", "Date": "March 31, 2008"}, {"Title": "Defective out of the box - $80 bill", "Author": "M. Cunningham", "ReviewID": "R23M2OAVWMDIAP", "Overall": "1.0", "Content": "I purchased a Kodak V1003 camera prior to taking a short vacation.  The camera was defective out of the box (frozen lens cover).  Finally able to push the cover open (an unauthorized action), I managed to capture at least a few pictures and informed Kodak.  The official response - Kodak repairs but does not replace defective cameras (brand new units included).  Unauthorized damage/repairs void the warranty resulting in an $80 repair fee.Buyer beware!", "Date": "March 30, 2008"}, {"Title": "Kodak EasyShare V1003 10MP Digital Camera with 3x Optical Zoom (Midnight Black)", "Author": "Adriana Lopez \"Adrilo\"", "ReviewID": "R2TCJ2XH8118YT", "Overall": "5.0", "Content": "Excellent product, I recommend it widely, their images and options give the user greater breadth of opportunities at the time of use.", "Date": "March 28, 2008"}, {"Title": "Digital Camera Kodak Easyshare V1003", "Author": "Ruth Keener \"R.B.Keener,book worm\"", "ReviewID": "R2RWX7VQZ067YS", "Overall": "5.0", "Content": "I purchased the camera 2 days before the wedding of my Grandson. The camera was easy to use, the pictures I took came out well. The instructions that came with the camera were easy to follow. The camera is small and light enough to carry with you. I highly recommend this camera.", "Date": "March 28, 2008"}, {"Title": "Not Happy with the V1003", "Author": "Laura Leenderts", "ReviewID": "R31C6AK1385IW7", "Overall": "1.0", "Content": "I have had my Kodak V1003 for about 5 months and I am not happy with this product.  I bought this camera because I loved my Kodak DX7630 but it didn't withstand a rainstorm (oops!).  I thought I would update the features and size and ended up with the V1003.  The camera is TOO SLOW.  I have a small child who is usually half way across the room before the picture shoots.  I have a lot of trouble with blurry photos and/or varying brightness and Kodak customer support has been unable to help me.  They suggest using a tripod but does that really make sense for a point and shoot camera?!?  I can take 10 pictures of the same item and get a variety of quality - some blurry, some too dark, some too light, and once in a while a perfect picture.  The most attractive features of this camera are the physical size and MP.  But 10 MP does you no good if the photo is blurry.  When the camera is working well, it has awesome color and clarity - it just takes a lot of picture taking to get that one great photo.", "Date": "March 26, 2008"}, {"Title": "Kodak Easy Share V1003", "Author": "Vilma V. Smith", "ReviewID": "R2NV4CW5OBE9WT", "Overall": "5.0", "Content": "This camera is very good. It is very light weight and takes very nice pictures. The panoramic mode is awesome!", "Date": "February 8, 2008"}, {"Title": "Great product, great price!", "Author": "Aisha Owens-Carter", "ReviewID": "RKIR2WCRPWAS", "Overall": "5.0", "Content": "This camera is excellent just as described.  The price was also excellent for the features it has.  The only thing is I really wanted a pink camera and the color is listed as pink rose but the pink should be called sheer pink because the color is barely there.  Other than that I love it!", "Date": "January 23, 2008"}, {"Title": "Nice", "Author": "Dena", "ReviewID": "R3QDM5MZ6JIRNL", "Overall": "4.0", "Content": "This is a nice fairly simple camara.  I bought it for my sister for christmas. I liked it because of the color, size and features.  Thought it was a good price for the features.", "Date": "January 19, 2008"}, {"Title": "Kokak Easy Share", "Author": "Diane K. King", "ReviewID": "R10VO73B7LQLE1", "Overall": "4.0", "Content": "My daughter purchased it. It doesn't seem as clear as my 8-pixel for some reason, and it is a 10-pixel, most noticeable inside.  Not sure what the problem is. Arrived quickly and seemed to be fine at first.", "Date": "December 28, 2007"}, {"Title": "Awesome Product", "Author": "E. Veal", "ReviewID": "R131IP9Z1YZ1VQ", "Overall": "5.0", "Content": "It is the best camera I have ever had and would recomend it to every one!!!!", "Date": "August 31, 2007"}, {"Title": "Camera", "Author": "Lawrence R. Morris \"Big Mo\"", "ReviewID": "R1J4R5ND7170Z0", "Overall": "4.0", "Content": "It was a great purchase.  For the money I think it's the best value available.  I have always been pleased with Kodak products and this camera is no different.", "Date": "September 22, 2007"}, {"Title": "my lovely pink camera", "Author": "S. Sweeney \"pink star\"", "ReviewID": "R3FN8WOD1Y1PUM", "Overall": "5.0", "Content": "This camera is wonderful. Easy to use and takes great pictures.Please make this your next purchase.", "Date": "July 12, 2007"}, {"Title": "Simply Awful", "Author": "KBee", "ReviewID": "RLJSVK3ALVPCZ", "Overall": "1.0", "Content": "Before I purchased this camera, I was very loyal to Kodak cameras.  Since purchasing this camera, I have not even considered wasting my money on a kodak.  I went on a roadtrip and brought this camera along.  Several of my travel companions also had the same camera.  By the end of the trip, almost all of these cameras had damaged/unusable screens.  I still used the camera throughout the trip (despite the fact that it doesn't have a view finder or anything)and the printed pictures were what you would expect from a point and shoot.  I tried to return the camera or get it repaired, but they told me it would cost $200 dollars to make the repair.  Personally, I think there should have been a recall on this product because of the overly fragile screens.", "Date": "June 21, 2012"}, {"Title": "This camera sucks!", "Author": "Looking for the Perfect Item", "ReviewID": "R1RCG4PPP84SOO", "Overall": "1.0", "Content": "The day I got this camera I took a lot of pictures and it worked nice but they were kinda blury and did not do well with movement in the picture! As time went by I realized that this camera really sucked! After a year the battery would not stay charged so my reaction was that the battery just needed to be replaced so I ordered a new battery! But it still would not charge more than 1 bar! Finally a month after I replaced the battery it refused to work unless it was plugged in! ITS A PIECE OF TRASH!", "Date": "January 21, 2010"}, {"Title": "Broken Lens", "Author": "Katelyn Dearing", "ReviewID": "R34S7PPBQPBZW0", "Overall": "1.0", "Content": "I received this camera as a gift and had to send it in three times to be fixed. (Yes, I am EXTREMELY careful with my cameras) First, the lens would not go back inside. Second, because it would not charge. Third, for the lens again. I used it once after it got sent back and it broke again. A waste of time.", "Date": "September 17, 2008"}, {"Title": "movie download porblems", "Author": null, "ReviewID": "RB9PNOH40CGX3", "Overall": "1.0", "Content": "lets u film movies in HD mode one problem is the movie uses 700GB thats bigger then a dvd for less then 20 minutes worth lenth . I wanted to save theese to cd - r rom  but the movie I made with the camera where too big just the same size as a hollywood dvd . the other problem was Downloading the movie to my pc after dueing so the movie kept freezing up on my pc when playing. Can any body tell me why it skips on my pc. I was filming on boat in fast motion but it downloaded with slipping problems. when playing it on the camera it dident have that problem. its possible it downloaded with problems.. all it takes it one crew up and u wont be happy with this camera. Any body else having this problem ?? reply to my question & I will read it latter, thanks", "Date": "July 7, 2008"}, {"Title": "Not Too Impressed - but worth $100.00", "Author": "Frank M.", "ReviewID": "R3LZ8RBL8UCYQX", "Overall": "3.0", "Content": "I bought this camera on sale at Target for $100 and glad I did! This camera is basic, works fine, takes good pictures, and thats about it. I would compare the quality of picture to more of an 7megapixel, not 10. I've taken better looking pictures with an 8megapixel Olympus ($150) camera. The video is bad. Very low resolution that cant be raised and there is purple tint and vertical lines while recording. I'd recommend this camera for the low price of $100 or less, and to first time buyers. But if you got the money, definitely spring for a better camera with more features. Canon camera's seem to be what everyone recommends. Casio has great features.", "Date": "June 6, 2008"}, {"Title": "Wish I Had Returned It", "Author": "Julia A. Mcferrin", "ReviewID": "R3TF6TJD2R4U7Z", "Overall": "1.0", "Content": "Kodak EasyShare V1003 10MP Digital Camera with 3x Optical Zoom (Midnight Black)  You cannot use the anti-blur mode with any of the other modes.  It seems very sensitive to movement.  If you use the anti-blur mode and want to take a close up (or any other 20+ modes, e.g. landscape, sport), you are out of luck for anti-blur. I find this really annoying. I'm certainly not going to carry around a tripod for everyday, ordinary pictures.", "Date": "May 27, 2008"}, {"Title": "LCD Screen Cracked!", "Author": "N. Thomas \"yogasister\"", "ReviewID": "R1VHGJDRN3WGWT", "Overall": "1.0", "Content": "I had the same problem with the LCD screen. I had the camera just 3 months or so and it cracked. I had it in a pocket in my purse, so it was not without some protection.  After reading about all the hassles with Kodak customer service, I really don't want to go thru the trouble of mailing it off, etc.....I had an EasyShare a few years ago that worked just lovely, so that is why I bought this one.  But no more Kodak products for me.", "Date": "May 5, 2008"}, {"Title": "Worst camera ever!", "Author": "JAO", "ReviewID": "RIJZCLY64DUT7", "Overall": "1.0", "Content": "This camera takes horrible pictures.  They are grainy and blurry and in no way look like what a 10 MP picture should look like.  It also takes way too long to even focus & take a picture.  I owned a DX7630 which was a 6.0MP and it took far better quality pictures.  Do not waste the money on this camera.  It is junk!", "Date": "March 26, 2008"}, {"Title": "It`s a great camera.", "Author": "Mike", "ReviewID": "R1C6CRE9LIVQ5A", "Overall": "4.0", "Content": "I so happy with my new camera because it`s more smaller than other cameras and it has excellente focus.", "Date": "February 13, 2008"}, {"Title": "Fun product", "Author": "Jennifer Hamilton \"Jennifer Hamilton\"", "ReviewID": "R25VIQTOOYTCRE", "Overall": "4.0", "Content": "I have not used this camera much yet, but it's very easy to use and transfer pictures. Lots of great features! I'm not a girly girl, but I love the pink - very cute!!", "Date": "February 10, 2008"}, {"Title": "A decent camera for the money, but I expected better", "Author": "J. Vickers \"jillcreations\"", "ReviewID": "R3FVH6FM6I2MNQ", "Overall": "4.0", "Content": "The camera is ok, but the pictures tend to be on the dark side.  I can not get the camera to connect to my pc.  I got to work twice but now it will not at all, maybe it is just a bad USB cable.", "Date": "February 8, 2008"}, {"Title": "good", "Author": "Erika Olvera", "ReviewID": "R127PJCUA2VL62", "Overall": "4.0", "Content": "transaction was easy and smooth, delivered by expected time, product was in good condition.. good price.. shopped other stores/sites.. amazon was the cheapest", "Date": "December 27, 2007"}, {"Title": "Kodak EasyShare V1003 10MP Digital Camera with 3x Optical Zoom (Slate Gray)", "Author": "Luis A. Gonzalez \"lagp\"", "ReviewID": "R3AEJ99UD9F3TK", "Overall": "5.0", "Content": "Buenas noches yo quisiera saber donde esta mi camara fotografica ya que la compre el 8 de agosto y el 18 del mismo mes fue entregada en una residencia y desde entonces no se nada de la camara fotografica", "Date": "September 9, 2008"}, {"Title": "A great little camera", "Author": "C. Moss", "ReviewID": "R27XCRE5F711YS", "Overall": "4.0", "Content": "I bought this as a last minute gift for my 18 year old niece.  She loves it.  She loves the color, the matching accessories, and most of all she loves the pictures that she's been sharing.I like my DSLR, but for a point and shoot, this one is pretty good.", "Date": "February 17, 2008"}, {"Title": "Disappointing", "Author": "William W. Krzymowski", "ReviewID": "R1Z1NESW1MHE88", "Overall": "2.0", "Content": "This is the fifth Kodak digital camera I have bought and like two others it has needed a major repair after a minimal impact.  The warranty is virtually worthless as the contract repair company simply says the damage was due to an impact and there is no recourse.  The prior cameras took nice pictures, however this model never did work correctly.  The flash often did not work for indoor shots.  The Kodak cameras are simply too fragile and this is the last one I will buy.", "Date": "February 5, 2008"}, {"Title": "It stinks dont buy it", "Author": "MB", "ReviewID": "R19NBTBYRL9EHF", "Overall": "1.0", "Content": "We bought this camera for my daughter for Christmas 2007. She used it once, then it sat on a table until she went to use it again, and the LCD screen was broken. It had been a little more than 30 days so I could not return it to Amazon. I sent it away to Kodak to be fixed/replaced and they want to charge me more than half what I paid for the camera to fix a brand new camera. The camera stinks and Kodaks customer service, or lack there of stinks too. I will NEVER buy a Kodak product again. They do not stand behind their product. I would not give this camera any stars but the system made me. We never even got to see one picture from this camera.", "Date": "January 23, 2008"}, {"Title": "Not as good as Canon", "Author": "Navapadol Tabkum \"NT\"", "ReviewID": "R1Q8W4QG7J8U9R", "Overall": "2.0", "Content": "LCD not viewable in the sunlight or outdoor.Hard to choose and save setting.", "Date": "October 1, 2007"}, {"Title": "A Waste of Time, Sometimes", "Author": "Digital Photographer \"Used to Like Nikon,s\"", "ReviewID": "R2LHUFHVTF24VX", "Overall": "1.0", "Content": "This is really a very nice camera, but with some glaring deficiencies, first the manual is next to useless, tells you just about nothing, it is disjointed, disorderly and at best vague.I think Kodak would have been much more honest to include a flyer inside which said, \" you figure it out.The viewfinder in low light is just fine, but, go out in a sunny day with the sun behind you and you cant see a thing, I wish the camera manufacturers  would do something about this, 3 cheers for canon, they put an optical viewfinder on their point and shoots.Very sad part, this thing takes some first class photos, sad part,I will return mine.", "Date": "November 4, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "Keep your special pictures close without filling your internal memory.\nCreate better, brighter, more vivid pictures and clear up dark shadows right on the camera.\nReduce blur caused by camera shake or subject movement.", "Name": "Kodak Easyshare V1003 10 MP Digital Camera with 3xOptical Zoom (Pink Rose)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Ze5jepB2L._SX300_.jpg", "ProductID": "B000P58GGU"}}