{"Reviews": [{"Title": "jamcam 3 is great for what it is.", "Author": "diptheria", "ReviewID": "R1C573TLQUVAHG", "Overall": "4.0", "Content": "i've had my jamcam for a few weeks now, and i love it. this camera is not trying to be a film camera replacement, it just for taking quick snapshots to share with friends and family. you wont be framing any of the pictures you take with this camera, but thats not what this camera is for. it wonderful for sending new pictures of the baby or whatever to the parents or best friend. we bought the sandisk 32 meg memory card to go with it, and can take 130 pictures at a time now. someone complained that their 32 meg card wouldnt work with their cam, but mine works great. Others have complained about battery life with this cam, i bought a pack of 9 volt batteries from radioshack, and have taken over 150 pictures (mix of flash and no flash) with the first battery, and its still going strong. the picture quality is not stunning, its less than a disposable camera, but for the price and what its meant for its fine. if you want your pictures to look like film photographs look elsewhere. the software that comes with this camera is a little cumbersome, but it is servicable.when i want a nice picture, i use my old om-1 and tamron lense. when my cats are being real cute, i snap them with my jamcam.", "Date": "March 22, 2001"}, {"Title": "Pretty Cool", "Author": "Rebecca Mellor", "ReviewID": "R2RWN5WRHTAXBE", "Overall": "4.0", "Content": "Hi. I'm 14 and I got a JamCam for Christmas. It isn't exactly the best possible quality digital camera, but it takes pretty good pictures for the price. I would recommend it for amatures and for anyone who just wants to take some pictures for fun. Another thing that I found, however, was that to take a really good picture inside or anywhere you would probably want to use the flash. Otherwise the picture will come out a little fuzzy. So I just wanted to recommend this camera and give a bit of advice. It was one of the best gifts I got this year. Parents, if your kids or teens like taking pictures and even more than that love using the computer, BUY THIS FOR THEM!!", "Date": "February 2, 2001"}, {"Title": "JamCam 3.0", "Author": "J. Bob", "ReviewID": "R3PFYJ31T19TZL", "Overall": "4.0", "Content": "The JamCam works great for a relatively low end digital camera and it's the only digital camera I found that will work with a Mac.  An excellent camera for kids: they can shoot all the shots they want without the expense or time delay of film processing.  It was a big hit at my daughters birthday party.  The indoor flash worked great and the bundled software allows image manipulation like swaping heads and putting the subject of one picture into the background of another. - Hint for Mac users: it requires OS 8.5.1 or newer (8.5 wouldn't work).", "Date": "December 18, 2000"}, {"Title": "Better than I expected", "Author": "Skllbns", "ReviewID": "R1PEG54JEYZD05", "Overall": "4.0", "Content": "I bought this camera basically for taking snapshots that I could email to friends and incorporate into digital home movies edited on iMovie.  I purchased a 32 MB MMC card and can shoot 130 pictures with it.  I got the camera right before the Christmas holidays and probably shot 400-500 pictures in ten days.  Of that number, about 25% were overexposed, too dark, blurred, or weirdly pixilated.  The rest of the pictures came out suprisingly clear, and I ended up keeping about 100 really good snapshots (and didn't have to pay $$$ for film processing).  For a toy camera marketed to email-savvy teens, I'm pretty impressed.  The software package and USB connection couldn't be easier to use (except when you download 130 pictures onto your computer, it requires a huge amount of memory).  I may upgrade to a more expensive digital camera someday, but for now I love my dopey little Jam Cam.", "Date": "February 1, 2001"}, {"Title": "Excellent Low-End Camera", "Author": "philber \"philber\"", "ReviewID": "R1YAMTMBSEG16Y", "Overall": "5.0", "Content": "I have read every review here prior to mine and I have to say, Look, you are NOT buying a professional camera! It is for the low end market and it surpasses what you should get for the price! This is way better than I expected for a cheap camera.  I bought mine specifically for photos on Ebay and it has surpassed my expectations compared to what people told me I would get.  In part because of its simple to use software.  I download a photo, use the zoom feature and then crop it and I have a great, clearly visible shot.  Sometimes a shot will look grainy depending on how close you were to the object. You can't get super close shots because it doesn't have a macro mode or zoom lens.  But for the price it rules above all other cameras under $100!  I'll stack this up against any other one out there.  As for the people who complained, the common theme was eating batteries which seems to be a case by case scenario.  I get over 100 shots per Duracell, and I've taken close to 500 shots. Many other reviewers claimed either terrible battery life or great longevity.  Maybe you just get a good one or a really bad one?  So take it back and try again!  IMPORTANT: The customer service is outstanding!!!!  And worth the price of the camera alone.  They have never failed to be anything less than excellent in at least ten calls!...", "Date": "July 10, 2001"}, {"Title": "Don't forget the 9 volt battery", "Author": "Joshua Stout", "ReviewID": "R1Y6MAV5GVUDJW", "Overall": "4.0", "Content": "If you're giving this product as a gift or are buying for yourself you should know the camera doesn't include a 9 volt battery.  This can result in a disappointing run to the market. Happy shooting!", "Date": "December 16, 2000"}, {"Title": "Ha Ha Ha", "Author": "WiillyRay", "ReviewID": "R27XPPMOE5PLBZ", "Overall": "1.0", "Content": "WOW! What a waste of time and money. I purchased the Jamcam 3.0 through the HomeShopping Network. The pictures I took looked like they were taken through a plastic bag. When I tried to enlarge them to 100% they got even worse, But I did notice that the smaller they were, they got better. But then they were too small to see what they actually were.  I can't imagine anyone wanting to email or print pictures from the Jamcam3.0 let alone use the special effects to frame them. You would need advanced special effects to make the pictures clear and worth while. I wouldn't even give this to a child to use.  Thanks for allowing me to express my thoughts... Now I have to take the time and hassel to return it.", "Date": "April 14, 2001"}, {"Title": "You get what you pay for.", "Author": "RogerK", "ReviewID": "R2EDMAFRZKFLBG", "Overall": "3.0", "Content": "For an under $100 digital camera, the JamCam 3.0 is an OK toy. Since I use Windows 2000, I had a small problem getting the camera to work initally (a problem installing the software). A call to KB Gear's tech support solved the problem. Unlike most \"tech support\" calls, this one was actually answered by a REAL PERSON who ACTUALLY KNEW how to solve the problem (and I didn't have to wait on hold, either!). I give KB Gear's tech support a SOLID FIVE STARS. As far as the performance of the camera itself, I would say it is fair. Not poor, not good, just fair. The camera doesn't handle low light situations well (even with the flash). The camera seems to have a very low number of bits per pixel. Although the camera shoots at 640 x 480, each pixel seems to be (my guess) 4 or 5 bit color depth. This causes the image to seem grainy. The TWAIN driver included with the camera is not very mature and it crashed a few times. The camera draws power from the 9 volt battery at an amazing rate. By the time you get the software installed, shoot up a few test pictures and download them to the computer, you will need a new battery. In conclusion, if you just want to shoot quick pictures for your online auctions, this camera is fine. It's also fine as a kids camera. If you want to take family or vacation pictures, this isn't the camera for you.", "Date": "April 13, 2001"}, {"Title": "Good web cam, made better by lowered price.", "Author": "Rheumor", "ReviewID": "R1R0IZ6SKAOUWQ", "Overall": "4.0", "Content": "I've owned mine for over a year & have been impressed with it in several ways. First is the new, lowered price; real digital cameras at such a nice price are quite a development! The applications this camera seems best suited to are: e-mailing photos, webpage posting or limited photo printing (4\" x 6\" max), as in school papers or nonprofessional grade work reports. The resolution is up to these tasks, but not much more. It has no zoom lens, which limits its usefulness. It does have a good indoor flash, and it has an expandable memory (MultiMediaCards, generally harder to find & a bit higher cost than other memory formats). The camera will download into the PC via USB (forget about painfully slow serial port options), but the only way to fly is to use a separate MMC card reader (a little more $, but no battery use and much better speed). All in all, this is a great camera for younger students and beginners whose main interest is computer-based digital photography.", "Date": "November 11, 2001"}, {"Title": "Jam Cam is best for the money", "Author": "Keri Heskett", "ReviewID": "R3SBTHZM4CDSJ1", "Overall": "5.0", "Content": "I originally purchased a Polaroid digital camera at a local discount store for the same price as the Jam Cam.  Since I knew the Polaroid name I assumed it would be the quality product of the two.  The Polaroid took such lousey pictures you couldn't tell what color the item was or even what it was.  The Jam Cam was my next purchase and what a difference!  This camera is awesome for the price and even though you can only take 8 pictures at a time you can add a memory stick and take as many more as your want.  I hightly recommend this product for anyone posting ebay adds.  A+++", "Date": "September 18, 2001"}, {"Title": "Give it a shot, but give it a shakedown", "Author": "wayne m lodahl", "ReviewID": "R3BTQSXVZM0RWS", "Overall": "3.0", "Content": "I think this is the best camera you can get at the price -- but it IS cheap and therefore it's going to have limitations.  I recommend giving it a real good workout when you first get it to familiarize yourself with them so you can still return it if those limitations are just too much.  1. OK -- it eats batteries.  The expensive, high-quality,alkaline 9-volt kind at $3.50 a pop.  You can't use rechargeables at all and it doesn't even stop to chew the cheap ones from walgreen's. A $10 AC battery replacer for downloading is a no-brainer.  2. The flash is overkill - to avoid washed out pictures use the timed exposure when working close.  3. Too dark, too light will get the paint-by-numbers look.  4. The viewfinder in mine was a little off from the picture.  Too  bad an lcd just ain't gonna happen for under $100.  5. One undocumented feature is that it doesn't use all kinds of multi-media cards - only those with negative logic so you're pretty much stuck with SanDisc & can't shop around for the best price.  6.Did I mention it was the best you could get at the price?", "Date": "May 18, 2001"}, {"Title": "Solid camera at a great price", "Author": "Sir Bowen", "ReviewID": "R36D9R9HIAWS5K", "Overall": "5.0", "Content": "It's always great to find a product where the maker keeps the price down by omitting features rather than by cutting corners on quality.Sure, this camera isn't super-high-resolution, nor does it have many extra features. But what it does it does well. It's easy to use, and the photos are fine for most snapshot-type uses. It's also rugged - highly recommended for kids.The software loaded with no hassles and has a simple user interface. The camera hooks up to a PC easily, and I haven't had a single glitch uploading.I will recommend that you add the 16MB MultiMedia Card. Without it, the camera only holds 8 shots. With it, the capacity goes up to 69 - much more useful.", "Date": "January 24, 2001"}, {"Title": "Performs as advertised", "Author": "F. Donald Ahee \"donahee\"", "ReviewID": "R8TYV40BRPR9H", "Overall": "4.0", "Content": "If you haven't guessed, this is a toy digital camera. What a great little toy tho!It performs as advertised. It setup fast, software is fairly friendly and the kids can take it without a worry. The images are only good for emailing or lite web publishing. Don't expect to print anything worth framing.I got web pages for my nephews with this camera and they can take pictures and publish them on the web. On the downside, a memory card expansion was a tough find. I ended up buying one from KB Gear because I couldn't be sure what other cards would work. The KB cards are expensive.", "Date": "January 3, 2001"}, {"Title": "Excellent first digital camera", "Author": null, "ReviewID": "R2VKAFC14ACW9V", "Overall": "5.0", "Content": "Just bought the Jam Cam 3. My son, age 8, on the first 3 days of use shot 64 pictures, with 15 of them flash, on one battery. I am inpressed with the quality of the pictures. Use the high resolution, (VGA), which allows you to store 8 pics before downloading. As other users noted, this is an entry camera, a great first pick for kids 6-12. We downloaded the pictures easily on the USB port (Windows ME.) The software includes Adobe Photo Deluxe Family Edition. My 8 year old caught on quickly to downloading, manipulating, and filing the photos.", "Date": "July 30, 2001"}, {"Title": "Windows XP Driver Here", "Author": "W. Alford", "ReviewID": "RRV8QSI0EZD1B", "Overall": "3.0", "Content": "I don't own a JamCam, but you can try here for the WinXP Driver.  It appears this may work.[...]", "Date": "December 3, 2002"}, {"Title": "Works with a Mac!", "Author": "Timothy Arends", "ReviewID": "R2H1V94QU6LHD7", "Overall": "3.0", "Content": "This is a nice little camera for the money. It looks like a real camera, not a toy. The menu-based controls on the back of the camera are easy to use (one criticism is that it is fairly easy to accidentally clear the camera's memory if you're not careful.) The camera is very sensitive to slight jiggling and will give blurry pictures if you don't hold it extremely still. My biggest complaint is that the viewfinder is poor and gives a very inaccurate preview of what you're shooting. I like the fact that it uses a single 9-volt battery for ease of loading, instead of 4 AAs. The battery wears out quickly, although the camera complains that the battery is dead when there is enough juice left for several more pictures. Use a rechargeable if you have one. The camera's built-in light sensor sometimes allows you to get good pictures and low light situations--other times you will need to use the built-in flash. Fortunately, experimenting with a digital camera is cheap. The pictures are somewhat inferior in quality to a digital camera that was included with an Internet service provider subscription, but the Jamcam's built-in flash is more reliable--the other camera's flash stopped functioning after a few pix. The choice of two resolution modes seems like a nice added feature, but the lower resolution is of such poor quality as to be almost unusable for anything but quick emails. A nice feature is the upgradeability with an expansion card. The best thing about the JamCam is it is one of only a very few starter cameras that works with a Mac. The downloading software is not bare bones and works nicely. The included Adobe PhotoDeluxe editing software is a capable addition and adds considerable value to this camera, if you don't already have a similar program. The Jamcam software connects you to the Jamcam website, which has worked out agreements with Shutterfly.com to print your pictures and a free web host to post them for the world to see. Sometimes you will be very disappointed with the way this camera's pictures turn out, other times you will be pleasantly surprised--if you don't have unrealistic expectations to begin with.", "Date": "January 21, 2002"}, {"Title": "Be forwarned", "Author": "\"maxxwwedge\"", "ReviewID": "R34DQ14L248DIT", "Overall": "1.0", "Content": "Camera worked great-when it worked, which was for approximately 4 months. I called KBGear to see how I could get it fixed, and was told that they had none in the warehouse, they all go to major retailers. Because they had none, and did not know when some would be produced, they would not fix, replace or otherwise try to compensate for their faulty product. I was told to \"keep trying back\" to see if they get any in, but if they don't I'm just out of luck. Their one year warranty is basically worthless. Just be warned if you get one, it's striclty purchased as-is.", "Date": "November 15, 2001"}, {"Title": "Use alkaline battery", "Author": null, "ReviewID": "R3U393IT1WMSQA", "Overall": "3.0", "Content": "The battery issue is easily solved by using an alkaline battery. My camera had problems with battery life but that does not seem to be the case when an alkaline battery is used. A regular battery seems to not be able to recover after 5 or 6 shots. I have gotten 30+ shots from the current battery with no sign of weakening.", "Date": "July 25, 2001"}, {"Title": "GREAT,  I love this camera", "Author": "\"kimber8\"", "ReviewID": "R2F0BQCPDRT0HA", "Overall": "4.0", "Content": "This is my first digital camera and I am really impressed.  It is a great starter, easy to operate and download.  The software included in the package makes adjustments brainless.  I was concerned with the battery at first but then I got a duracell ultra battery and Ive surpassed 100 pics (w/flash) and am still going on the same battery.  Overall great beginner digital camera !!!!", "Date": "May 24, 2001"}, {"Title": "two and a half stars", "Author": "George Vassiliades \"yiorgos\"", "ReviewID": "R1HE0A8HCAZUOK", "Overall": "2.0", "Content": "This is my first digital camera. It is a good price and very easy to install and use but the quality of the pictures is average (as should be expected at this price). The fact that the 9volt battery does not come with it is a little annoying. It is very very light so it feels like a toy... I have a small problem with the USB connection but that could be my laptop's fault... The serial port connection works just fine. The fact that it has both is a plus. Finally, remember it only holds 8 pictures...", "Date": "January 16, 2001"}, {"Title": "A rather shoddy product", "Author": "Michael Borgwardt", "ReviewID": "R19MP7QMXA1GDC", "Overall": "1.0", "Content": "I really can't believe all the other positive reviews about this product. Apparently they've never used a REAL digital camera. Admittedly, the price is cheap. But so's the quality. The image quality is really bad, even for the low resolution. There's no zoom. There's no preview screen, and you can't delete bad shots. It eats through batteries like wildfire. The images aren't stored in a standard format, so you can only download them through the camera, not through a MMC reader. Now that wouldn't be so bad, but unfortunately, the JamCam software is quite unstable and crashes often during the download, which means that if you have more than about 40 images on one card, you'll never manage to get them out. Overall, I can only recommend you to stay away from this camera unless you really only need a toy for your kids.", "Date": "May 21, 2001"}, {"Title": "JamCam has Multimedia Card Problems", "Author": "Lars W. Ericson \"erxnmedia@hotmail.com\"", "ReviewID": "R3B7C1I26ALGG9", "Overall": "2.0", "Content": "I own a JamCam 3.0.  It can write but not read all photos on a 32MB MultimediaCard -- it times out downloading and the camera shuts off after 100 photos.  Also, it uses a proprietary format which is not compatible with USB card readers such as the MicrotechInt ZiO MMC USB card reader.  Other than that, it is a good, rugged, cheap camera.  Just don't buy a 32MB MMC card or ZiO reader to use with this camera.", "Date": "February 27, 2001"}, {"Title": "Drivers for XP and 2000", "Author": "NANDO \"AMAZON JUNKY\"", "ReviewID": "R3ECJ0IJ7EEL2Z", "Overall": "5.0", "Content": "If you need Windows XP or 2000 drivers, they are available from (...) as well as help with installation, instructions and other helpful hints.  Great starter camera and fun for kids.", "Date": "May 7, 2005"}, {"Title": "No Tech support", "Author": "Marlene", "ReviewID": "R3Q41DDO7Y1KH1", "Overall": "1.0", "Content": "I bought a Jamcam 3.0 in Dec. of 2000 and it worked for about 6 months. Now when I try to download I get a message that says \"An error occured while downloading picture from camera, please try again\". I can't get tech support electronically, so called the number for help in the book. I got the message, \"This number is not in service\". What do I do now? Throw the camera away???", "Date": "May 28, 2002"}, {"Title": "Don't Buy It!", "Author": "W. Miller \"Bill\"", "ReviewID": "R3E4A4PFMYHNNX", "Overall": "1.0", "Content": "KB Gear has gone out of business!!  Does not work with XP and never will.", "Date": "December 28, 2001"}, {"Title": "really fun", "Author": null, "ReviewID": "R38MJIRBSVKHDY", "Overall": "4.0", "Content": "this camera is great for kids its also awesome for beginners", "Date": "October 26, 2000"}, {"Title": "Cheap and Cheerful", "Author": "Kali \"bengaligirl\"", "ReviewID": "R2W0AOEEXQGYYJ", "Overall": "5.0", "Content": "You get what you pay for and this camera is cheap, cheerful and great for those people who want to tinker with a digital camera but don't want to pay the earth.  For this much money, you can't go wrong with this solid little number that takes pretty good digital pictures and is SO easy to use.  The instruction booklet is simple to follow and isn't too technical.  It also comes with a both a USB and serial port cable so you can choose how to download your photos.  It runs off a 9v battery, can hold up to eight photos but be warned you don't have the luxury of seeing your photos before you download them to a computer. Remember this is a basic digital camera and has next to no fancy extras.  As a bonus however you can increase the memory with an expandable memory card but that costs extra and will put the price of the camera up if you choose to go down that avenue.Like I said this is a cheap and cheerful camera so it's pot-luck as to how good your photos are.  It does have a flash so it can be used indoors and there is a low battery indicator to tell you when to change the old dry cells.  This camera isn't for the serious photographer, kids will love it, adults who just want to muck around with something remotely digital like will enjoy using it, and it takes a pretty good photo for something at the bottom end of the digital camera market. A good stocking filler for Christmas if there ever was one.  What more can you ask from a cheap digital camera?", "Date": "November 19, 2001"}, {"Title": "XP users, have you tried this website?", "Author": "Monica", "ReviewID": "R1NXBW751QK8WZ", "Overall": "5.0", "Content": "When I purchased this camera in November of 2001, I had Windows ME installed on my computer.  The camera was easy to use and worked fine.  It took decent pictures for the price.  Another plus was that it uses just one 9 volt battery.It does not have a window on the back of the camera for you to preview your pictures before downloading.  The camera will hold  8 pictures.  However, with the purchase of a San Disk Multi Media card, that comes in various sizes, it can hold many more pictures.  For people who do not know alot about digital cameras (like me), I found out that it was common with digital cameras to have to buy additional storage to take more pictures.In January 2002 I upgraded to Windows XP, and the compatibility check I ran on the programs on my computer PRIOR to doing the XP upgrade, showed that the software I had for my Jam Cam may not work.  It advised me to unload the software before continuing with the Windows XP upgrade, and to see if I could find upgrades on the internet so that the camera would work.  I didn't want to bother with unloading the software, decided to \"take my chances\", and continued with the Windows XP upgrade.  After the upgrade was completed, I found a website for the camera company ... that had new downloads for Windows XP users  so that they could continue to use their camera with the new operating system.  I could not correct an error message I was getting that I had received when I did the compatability check.  I shut my computer off, and decided to try again the next day.  The next day my computer could not start up normally, and I was getting an error message that showed the problem was directly related to what I was trying to fix the day before.  I had to do a system restore.  I am honestly not sure that IF I had unloaded the camera software before doing the Windows XP upgrade if I would have suffered the same fate or not.  Since I have restored everything, I am very reluctant to try it again without knowing for sure.  I saw that a few people wrote and said that the camera did not work with Windows XP, and I am not sure if they knew about this website or not.  I thought I would mention it in case it CAN work for someone.", "Date": "April 3, 2002"}, {"Title": "A decent digital for the price...", "Author": null, "ReviewID": "R3PAKTIKIYDVMW", "Overall": "3.0", "Content": "I'm surprised at some of the problems other buyers seem to be having with this camera. I recently bought one, my first digital, and so far, have had No problems with it. The software loaded up fine the first time and I was able to take and download pictures right from the start. It IS an inexpensive, low-resolution camera so I wasn't expecting 35 mm quality pictures. But for the price, I'm perfectly happy with the results. Eventually I may move on to a more expensive, higher resolution camera, but to start out on, this is a nice, inexpensive way to experiment with digital photography, in my opinion.", "Date": "May 22, 2001"}, {"Title": "I don't know what I was thinking...", "Author": "Scout Leader", "ReviewID": "RMTAX3BGXRSK4", "Overall": "2.0", "Content": "Bad software, hard to understand manual and just too difficult for the child I bought it for. We did much better spending more money and getting a \"real\" digital camera!", "Date": "October 22, 2005"}, {"Title": "Doesn't work with Win XP", "Author": "Mary", "ReviewID": "R2CE7J9AXNJ13U", "Overall": "3.0", "Content": "I got this camera originally for a WinMe system w/ UBS connection.  When I upgraded to Win XP, nothing works, despite downloading and re-installing driver from JAMCAM website that are supposed to work with XP.  I left a number of messages with the site (they are tough to contact).  No responses. Customer support - zero stars.The camera worked fine on Win Me.  Good price for what I got when it was working.", "Date": "September 9, 2002"}, {"Title": "Hello, reality check - this is a kids camera", "Author": null, "ReviewID": "R3PD2TO3ALV221", "Overall": "3.0", "Content": "If you've bought this camera for your 7 year old and had a \"bad tech time\" you've got reason to complain.  If you bought this camera to document your once in a lifetime safari trip to Africa, well lets just say you should re-plant your decision tree.", "Date": "July 17, 2002"}, {"Title": "XP User Beware!! Will Not Work With XP!!", "Author": null, "ReviewID": "R1ML26G8AG5EAQ", "Overall": "1.0", "Content": "buyers beware the software drivers do not work with Windows XP I could not get it to work and the update on the company website doesn't help. The company is also out of business and will not be able to assist you. Buyer Beware!! Amazon Beware!!", "Date": "July 6, 2002"}, {"Title": "Good, Fun Camera", "Author": null, "ReviewID": "R2HC318E2X2EAT", "Overall": "4.0", "Content": "Received the camera about a week ago and shot over 20 pictures.  The software upload was a snap with my imac.  The pictures are of good quality and easy to upload.  All in all the camera does a great job and you cannot beat the price.", "Date": "August 2, 2001"}, {"Title": "Good first digital camera", "Author": "Cindy", "ReviewID": "R2JK4HAJQQNZ8W", "Overall": "3.0", "Content": "I received my JamCam as a Christmas gift - I've used it to take many photos so far.  For the price, you cannot get a better camera.  As for using it to take print quality photos, I'd look elsewhere.  You cannot get ultra clear photos with this camera but you can get fun shots - I use it for my dogs :)  Its nice to be able to download the photos right away and see if any turned out.  I use a rechargable battery with my JamCam with no problems. All in all, I'd say that my experience with JamCam has been fairly good.  I won't buy another and my next digital camera will be higher quality.  But for what I use it for, my JamCam has performed well.  You cannot expect a $1000 camera quality photo from the JamCam.  If you go in with that thought, you'll enjoy your camera :)", "Date": "July 2, 2001"}, {"Title": "Batterys go dead a lot.", "Author": "Kelly Hendrickson", "ReviewID": "RJE7FL7TSEATN", "Overall": "4.0", "Content": "This is my first camera, and its a good one. The only thing i would say was bad was that the batterys go dead a lot. You get 3, maybe 4 pictures before they are dead. I dont know if it is just the batterys, but still, it is a costly thing when i buy them a lot(batterys). Good camera for kids and teens (I am a teen).", "Date": "January 28, 2001"}, {"Title": "For 20 Bucks (after rebate)??? Why not?", "Author": null, "ReviewID": "RRCS1WDSCJ7QF", "Overall": "5.0", "Content": "I tried to order three of these after a friend showed me his Jam Cam and let me try it. Too bad ... is out of stock. I was going to keep one and give the others as gifts. It works great for the web and the resolution is just fine for email and web albums. It's better than most cheap still web cams I've seen. I'm looking around for at least one.", "Date": "November 22, 2001"}, {"Title": "Decent camera", "Author": "Amazon Customer \"busywoman\"", "ReviewID": "R3NC9VZTSG385B", "Overall": "4.0", "Content": "This camera was purchased for our 12 yr old son to use on field trips, vacation, ectc.  We added extra memory so he now takes about 160 shots on any given trip.  The photos are clear enough for his purposes.  The only down side is I hate downloading 160 photos... it takes forever.", "Date": "January 4, 2003"}, {"Title": "MMC card readers DO NOT work with this camera!", "Author": "microwiz \"The Evil Microwizard\"", "ReviewID": "R1LMTZ0CZ6H4LL", "Overall": "3.0", "Content": "For a sufficiently low price, this is a pretty decent 640x480 camera, especially with a cheap MMC card added. With the driver updates listed in other reviews, it works tolerably with WinXP as well, though it's much smoother going with Win98SE. The flash works tolerably well at night, though it's rather overpowering if you're too close to the subject. Its TWAIN driver is also annoying, as it apparently gives no way to download raw images (all are pre-processed before download).One suggestion made in another review, though, is completely off-track: an MMC card reader CANNOT BE USED with this camera! (Has the reviewer who suggested it ever actually used this camera...?) Photos are saved to the card in an annoying proprietary format, which means that it cannot be read other than with the camera. I'd strongly suggest use of a 9V battery eliminator for downloading, or you'll find yourself going through batteries at quite a clip!Another shopping site also states clearly that MMC cards >16M in size do not work properly with this camera.  There's a lot of misinformation present about this camera in the reviews and links here - caveat emptor!", "Date": "December 30, 2002"}, {"Title": "A great camera, but does not work on Windows XP", "Author": "Chris Hill", "ReviewID": "R3TBMOHGQ3LS90", "Overall": "4.0", "Content": "I have owned this camera for over a year and have loved it.  It is great for pictures to e-mail to friends.  Although I have updated my computer and now can not use it with Windows XP and the company seems to have gone out of business.  Don't plan on this working forever.  Once you update your system, you loose the camera.  I was happy, but wish I had a new driver to use.", "Date": "November 27, 2002"}, {"Title": "The Jam is Off", "Author": "Alan Cummings", "ReviewID": "R2Q7H9AQX5VL4P", "Overall": "3.0", "Content": "I won 2 Jamcams - they are basic cameras for low res. \"happy snaps\".  I wanted to install on XP - I tried to access the website to download drivers and - guess what - KB perhaps don't  exist any more - their web site has been unobtainable for a week now.So, I'm stuck with 2 cameras that I cannot use because I cannot install the software......If anyone has any info re. XP drivers for these cameras, I would be pleased to hear from you.", "Date": "November 6, 2002"}, {"Title": "Its So fun and easy!!!", "Author": "\"redlove41\"", "ReviewID": "R1AO3O1THU7XM0", "Overall": "4.0", "Content": "Ok.......I had heard rave reviews from Tech TV about this little bugger, and I decided, since 1)I am NOT really technically inclined....and 2) I wanted a digital camera.....I would give this baby a try. I got it out of the box...and was taking pictures immediatly!!! Now, I am a real digi begginner, so to me the pictures look great! Obviously to someone more experienced, I'm sure they would be looking for exceptional quality, but for [this] you can't beat this fun cam! I absolutly LOVE it! Even my 5 yr old can use it! It is a great little DigiCam for begginners, and young people, and I definatly recommend it. For the more seasoned Digital photographer....it is probably \"child's play\", but for us starting to learn, it is a great teaching tool!!", "Date": "March 31, 2002"}, {"Title": "Jam Cam  really great inexpensive camera", "Author": "E. Lang", "ReviewID": "R2VQ5R6UJRTOOR", "Overall": "5.0", "Content": "I have owned the camera for 6 months and have taken 100's of pics.  Once you get the hang of it you will love it.  I paid 19 bucks at fry's and it has been one of my best buys there.  I like the simplicity of the operation of the camera.  Just point and click.  You can edit the pics once they are downloaded with the \"easy to use\" jamcam software.  Because of the great price I loan it to my friends to take pics and also take it on bike rides over rough terain not worrying about damaging it.Get one you will be surprised at the quality of pics.", "Date": "March 6, 2002"}, {"Title": "Great for kids starting out!", "Author": null, "ReviewID": "R2D7WEQLIJIV0O", "Overall": "4.0", "Content": "It was perfect for my 7 year old - simple to use/download/etc.  Cheaper than regular camera and wasted film while learning the basics of photography.", "Date": "January 9, 2002"}, {"Title": "You Get What You Pay For", "Author": "Ronald Brown \"rboffp\"", "ReviewID": "R1Z3XB2M6ZKXVE", "Overall": "2.0", "Content": "Bought this as a gift for a teenager. It seems to work, but has limited memory space (8 pictures) and a slow serial connection to download pictures (as opposed to faster USB). But what can you expect for the bargain basement price. Good introduction to digital photographer for younger folk.", "Date": "January 7, 2002"}, {"Title": "I want my money back!", "Author": "Marie", "ReviewID": "R9VI2Z0CO6EV7", "Overall": "1.0", "Content": "I do not recommend this camera to anyone.  The memory card is expensive.  You might as well spend the extra money you would pay for the memory card on a better camera.  The camera takes lousy pictures too.  They are very grainy, distorted, or black.  They're not even worth e-mailing anybody.  Do yourself a favor and DON'T purchase this camera!", "Date": "January 5, 2002"}, {"Title": "A good buy if you don't need high quality pictures.", "Author": "Nancy von Minden \"frugalfamily\"", "ReviewID": "R2BV8KX88XSY1Y", "Overall": "3.0", "Content": "This camera is a pretty good buy even without the manufacturer's rebate.  That's a good thing, because I am *still* waiting to receive my rebate, and I'm beginning to doubt that it will ever come at all.  We chose this camera because all we needed was a Mac-compatible way to send pictures over the Internet, and it has served that purpose well.  There are some problems with indoor picture quality (graininess and altered colors), but it seems to handle outdoor pics well.  Close-ups are also out of the question.  I would have rated it 4 stars but the rebate thing knocked it down a notch.  I might have thought that the problems receiving the rebate were unique, except that my sister-in-law is still waiting for hers as well.", "Date": "November 10, 2001"}, {"Title": "JamCam - pretty fun", "Author": null, "ReviewID": "RIWUHCJ623MOD", "Overall": "4.0", "Content": "For what it is, the JamCam is a nifty device, capable of both pixellated, bad photos and some nice clear images. I picked one up because I wanted to see if digital cameras were for me. I'll probably get something nicer in the future, but for now, this works for snapshots/e-mail purposes. Better quality can probably be gotten from it once one is used to it. I noticed that pictures with low light were the ones with the most odd artifacts. The quality of photos is slightly above the Color QuickCams used to be. Battery life seems good, interface is simple to learn and the accompanying software works pretty well. Definitely something to check out.", "Date": "September 16, 2001"}, {"Title": "Cool Little Camera", "Author": "Dolphin07", "ReviewID": "R2SNKX83EOWXL1", "Overall": "4.0", "Content": "I just got this little camera and the pictures that I have taken so far have been good. It seems easy to use and for a starter camera it is great. I look forward to taking more pictures with my little camera.", "Date": "September 14, 2001"}, {"Title": "Go for something better.", "Author": "Adam Ruddermann", "ReviewID": "R3GJF3F9RP3FS4", "Overall": "2.0", "Content": "The old cliche that you get what you pay for makes another apperance with this digital camera. Although the specs look OK and the pricetag looks excellent, the reality is that unless you're in an office-setting (regarding the lighting and general distance the camera will have to deal with) the camera performs very poorly. It's a great teenager camera (which is obviously the entire point from just looking at the camera packaging itself and the name) because it's cheap and it does the job, but if you're looking for any pictures from your trip to France that you can look at 10 years from now and sigh over with your kids, this is not the camera. Under no circumstances have I found it to be good taking outdoor pictures, no matter the lighting. The camera also reacts poorly to colored lighting (like house lamps).Great birthday present for your 16 year old, but if you want real pictures, I look elsewhere.", "Date": "March 13, 2001"}, {"Title": "Remember it's a toy", "Author": "\"victor_laporte\"", "ReviewID": "R3EQDM9DOQ46Z1", "Overall": "4.0", "Content": "I bought this camera for my 12 year old daughter. She loves it. A bit disapointed when it didn't have a LED to view pictures but she got over it. The quality of shots is good enough for her . There are several shots already circulating cyber-space. Easy to use easy to down load. She was even able to make a short film from stills on iMovie.", "Date": "January 27, 2001"}, {"Title": "If you have no $$ and need a cheap digital cam, get more $$", "Author": "\"jilldaugherty\"", "ReviewID": "RWHMYDGVU1N7Q", "Overall": "2.0", "Content": "We owned this camera for a couple years without a problem.  It takes pretty marginal pictures but we didn't have money for an expensive digital camera and wanted to take spontaneous (and free) photos of our dogs, friends, etc.  Works ok for that but the resolution is poor so you'll immediately be thinking upgrade.But as soon as we upgraded to Win XP, the USB download ceased to work.  The Win XP driver just doesn't do USB.  The serial cable download works ok but is very slow.  BTW, the camera has been finicky about downloading the pictures on stored on the MMC card.Disregard any suggestions that you could use a card reader to read an MMC card with JamCam photos.  Doesn't work.  Apparently, the JamCam uses a proprietary format that the card readers see as unformatted.", "Date": "February 19, 2003"}, {"Title": "I actually give this product zero stars.", "Author": "\"velma76\"", "ReviewID": "R9A14DEAYN730", "Overall": "1.0", "Content": "This is NOT a camera for amatures!This camera is so difficult to use you need to be a seasoned professional to use it.The big down side to this camera is only takes a few picture. If you want to be able to take more, you have to use a memory card (which is sold seperately).", "Date": "August 19, 2002"}, {"Title": "Not compatible with new Windows machines!", "Author": null, "ReviewID": "R3V379OOVNQ3CP", "Overall": "1.0", "Content": "Please note that if you are buying this camera to use with your Windows XP machine the hardware has NOT been \"Windows Logo approved.\"  That means XP does not accept the updated or old driver software.  And, you cannot use this camera (3.0) with your XP computer.", "Date": "February 27, 2002"}, {"Title": "it ruined my trip", "Author": "andrew j simon", "ReviewID": "R1NA5NM4ZTO0BZ", "Overall": "1.0", "Content": "I got the camera the day before my two week vacation in Europe.  After the first day, I tried to download the photos via the USB to my computer.  It did not work and subsequently erased my photos.  I then had to use the serial port which takes forever.  After a check to see if it works, I took about 70 pictures.  It took about an hour to download, but then would freeze my computer when I went to save them. So I had to redownload them over three times.  After I finally got them on my computer I realized that the camera did not take all of the photos that I took.  Infact it lost some of my most important ones.  It would appear as a blank white/empty photo.  The rest of the photos are very grainy or black even with the flash being used.  I was and am furious.  Before you go thinking that this is just someone who has no clue and created these problems himself, realize that I am an IT professional and very competent on my computer and systems.  This is a waste of your money and time.  Do not spend your money on a cheap camera because you will regret it.", "Date": "June 7, 2001"}, {"Title": "i returned it... fast", "Author": "boycalgary", "ReviewID": "R3E9OGCLSXJ7UE", "Overall": "1.0", "Content": "This camera may have been something special in 1999.. but the only thing i did like about it was the price. The capture quality is unreliable. I took the same picture of the same thing under the same lighting on the same mini tripod... and the quality was different each time. I may have got a dud but...The software is okay for a biginner but the only thing i used it for was to grab the images from the camera.It is durable and maybe good for children for just that reason. I WOULD NOT USE THIS CAMERA FOR VACATIONS OR WEDDINGS OR ANYTHING LIKE THAT. A lot of the images looked as if they were scanned off of last weeks local news paper at best. This is just my opinion but...", "Date": "March 15, 2003"}, {"Title": "pretty good", "Author": null, "ReviewID": "R2CU9M8I5W9CFS", "Overall": "3.0", "Content": "This camera is good for outside use. It often comes out bad if you take a picture inside. Also, the place for the memory card is very exposed. If you take it in and out too much, the memory card loses it's contact, and sometimes dosen't work. Also, the downloading program does not work too well on Windows XP, but works good on ME.", "Date": "June 10, 2003"}, {"Title": "battery power", "Author": null, "ReviewID": "RNE2VM8U53L4W", "Overall": "3.0", "Content": "I'm happy with my first digital camera but probably will go upmarket once I get used to it.The Jamcam 3.0 is okay for the price I paid.What is the best type of 9v battery to use with the Jamcam as I've already gone through two batteries in less than a fortnight.Where can I buy a 16MB Multi Media Card for the Jamcam 3.0 and how much do they cost?John, Wellington NZ", "Date": "June 6, 2003"}, {"Title": "Need Help", "Author": "Melva NeeSmith", "ReviewID": "R2EAC89GXP0AL8", "Overall": "4.0", "Content": "I've had this camera for about 2 yrs. and have used it a lot got great pictures, but now can't use. My PC crashed and when I put everything back on the PC can't find the hardware for it. I've done everything I know how. Can anyone out there help me get it back?", "Date": "February 14, 2003"}, {"Title": "JAMCAM 3.0 HELP", "Author": null, "ReviewID": "R10KUTM49QU11V", "Overall": "3.0", "Content": "I HAVE A JAMCAM 3.0 AND HAVE IT CONNECTED WITH USB CABLE BUT I CAN'T FIND A DRIVER TO OPERATE IT......CAN ANYONE OUT THERE HELP ME OR MY CAMERA IS USELESS......I HAVE GONE TO PLUG AND PLAY AND THEY DON'T COME UP WITH ANYTHING EITHER......I HAD THIS THING WORKING AT ONE TIME AND I DON'T KNOW WHAT HAS HAPPENED....ANY INFORMATION WOULD BE HELPFUL.......THANKS, JUDIE", "Date": "February 7, 2003"}, {"Title": "Need Driver for XP", "Author": "Bam", "ReviewID": "R2TYTY6MUR1OQU", "Overall": "3.0", "Content": "If anyone has a driver for this camera,please let me know.", "Date": "November 21, 2002"}, {"Title": "No support; Does not work with XP", "Author": "Jack Pace", "ReviewID": "R13RX4VLY5DWJ9", "Overall": "2.0", "Content": "I purchased this along with 64 meg memory card. The camera has no support and the patches on the web site are virtually worthless. From what I have found, it seems KB Gear went out of business in late 2001. Yet Amazon, nor anyone else who has thier products for sale care to mention this. After great pains, I finally got the USB bus on my XP machine to recognize the camera, but it would only attempt to download from it once out of perhaps 20 times. It always works from the serial port, but only with high res pictures. Low rez pictures always error out and cause the program to shut down. And high res take about 1 minute per pic (so 30 pics = 30 minutes) from serial port.", "Date": "October 17, 2002"}, {"Title": "Jam Cam 3.0 is good for the price", "Author": null, "ReviewID": "RM09011M85E67", "Overall": "3.0", "Content": "The camera is good for first time digital users the piturce quality needs improvement but its workable and for the price the software alone is a deal.  The camera has two resolution setting with 600 x 800 for 8 pictures and 400 x 600 for 28 picture the r1 and r2 setting and ytou have to careful not to hit Clr on the menu since it will erase you pictures.  The rubberize grip feels great and the thunb rest is a grest idea.  The self-timer is a pain so I turn mines off but I guess it to taste how to set up the camera.  All so you can add a MultiMedia Memory Card to expand you picture capabilty.  Currently I have a SanDisk 8 mb card in and can take over 80 pictures regularally. I had a problem using the serial cable with my laptop but the USB cable works great and the software works with my more other digtal cameras as well.", "Date": "September 9, 2002"}, {"Title": "This camera bites a big one.", "Author": "Stephanie Truscott", "ReviewID": "R3JDOJVOJ8ZWAQ", "Overall": "1.0", "Content": "...I have also spent hours trying to get the driver found and loaded with absolutely no success. The downloads are junk. I am returning the product with a large contempt for the [person] who created it and the software. I am even more peaved that the website provided no help in trouble shooting my problems and had no phone number for me to use to express my frustration or get the assistance I needed. I am tempted to send these guys a bill for my time. The purchase of this ... has cost my employers an unnessecary expense and me some of my sanity.I enjoy shopping at amazon.com. This is the first product I have recieved and returned due to lack of satisfaction.", "Date": "September 5, 2002"}, {"Title": "The company is going out of business", "Author": "sebastien tardif \"Sébastien Tardif\"", "ReviewID": "R12T0C8WKOMPVZ", "Overall": "1.0", "Content": "Try any email support or phone number for reaching this company they will said: disconnected! And I can guest why. JamP3 or JamCam both have drivers that crash the operating system! The software of JamCam is very annoying. The quality of picture is very bad, my cheaper Logitech webcam and Labtec webcam have better quality. You have to wait 8 seconds between pictures, not because of the flash even with picture without flash. Time is money, buy anything else than product from kbgear! The camera can take just 8 pictures because of its low memory...", "Date": "January 13, 2002"}, {"Title": "Get the most from this $50 bargain", "Author": "\"backwoodsbear\"", "ReviewID": "R14U0M3PQWLX5V", "Overall": "4.0", "Content": "You've read the other reviews; from joy to contempt. A year after purchasing a JamCam 3 - these are a bargain at Amazon's $49.99 price. A great intro to digital photography. Few sub-$100 cams have built-in flash, and PC as well as *Mac* USB support. Here's my best tips after owning one of these the past year:Steady Freddie! A steady hand, a gentle push of the button will improve sharpness. Digital image sensors are slow compared to chemical film.Quality 9V batteries (Duracell or Energizer) make all the difference. _Rechargable_ NiMh (not NiCAD!) will quickly pay for the battery and charger _if you look carefully and get one that outputs 8+ volts_ (Eveready Ultra) rather than most other \"9v\" models which only output an inadequate 7.2v.The supplied Jam app's default sharpening setting best; leave it alone, but do experiment with the lighting settings _before_ importing your pics. The Flash/Indoor/Outdoor/Etc buttons DO affect the image brightness _as it is imported_. Use the Jam supplied app ONLY to transfer - find a better 3rd party graphics app for more control over the final image.San-Disk is the only recommended MMC card brand. You cannot use a USB card-reader (as some reviewers imply) because the JamCam does not store pics in a standard 'disk-like format'. Choose a 16mb or less module for faster writes and better battery life than a large one. Don't be tempted to get more pics with the lo-res 320x240 setting. You'll only grab more dissapointment. Stick with the hi-res setting.Teach yourself or your kids the basics of good photography. Not a point and shoot mentality - but Point. STOP. LOOK. ADJUST, LOOK AGAIN - then Shoot. Compose your image, move in on your subject, analyze lighting for shadows and highlights. I spent 30 minutes with a 10 y.o. neighbor kid and his JamCam; 15 with the camera, 15 with the software trying this and that - and totally changed his perception of the cam, and vastly improved his results.", "Date": "January 9, 2002"}, {"Title": "Buyers Beware!!!", "Author": null, "ReviewID": "R10L4MAOGUN7BC", "Overall": "1.0", "Content": "My daughters were each given a Jam Cam 2.0 last summer.  We were unable to get either to operate despite all attempts by ourselves, very computer-savvy friends, and calls to tech support.  By the time we gave up it was too late for returns or exchanges.  I wrote the company's corporate AND consumer relations offices to explain our predicament.  It has now been months without so much as an acknowledgement of our letters.  Given KB Gear's utter disregard and lack of meaningful support I feel compelled to discourage purchase of any of their products!!", "Date": "July 4, 2001"}, {"Title": "Pretty Good for the Price...", "Author": null, "ReviewID": "R24I22JWA3SUQQ", "Overall": "3.0", "Content": "The JamCam's photo isn't exceptional but is handy for taking pictures about the house for most purposes.  The cameras options are easy to manuever after a few uses.  The software that comes was rather pesky, but it's not a huge drawback, it works.  I don't what another was talking about that it ate batteries.  I've stilll got the originasl battery in it after about 30 pictures.  Over all it's a good buy.", "Date": "April 22, 2001"}, {"Title": "get what you pay for", "Author": null, "ReviewID": "R3S44JL7E2SRTU", "Overall": "1.0", "Content": "Surprisingly lousy build quality.The first one I got was broken out of the box.It doesn't come with a memory card.it feels like a cheap toy.Save your money, spend a bit extra and buy a Kodak. I wish I had.", "Date": "January 4, 2001"}, {"Title": "disappointed user", "Author": "chrisboswell", "ReviewID": "R2PAQGPK4IYPXR", "Overall": "1.0", "Content": "I have had this jamcam camera for approx  6 months, having bourght it on price alone. It has cost me nearly £75 to have the software put onto my computer by a proffessional company as I could not get it to accept material by myself. It has only worked on 3 occassions when I have tried to download any photo's. i now wish I had sved my money and bourght a recognised man i.e kodac. I am on windows XP.  Yours Sincerely Chris Boswell", "Date": "June 23, 2003"}, {"Title": "Any news on driver for XP and JamCam3", "Author": "naomi", "ReviewID": "RVCYC28RWYSTG", "Overall": "1.0", "Content": "I notice a few people are looking for the software for the JamCam3 and Windows XP. Has anybody located this yet? I would be very grateful to hear from you before I toss my camera in the bin and start again.Many thanks Naomi", "Date": "November 10, 2002"}, {"Title": "junk-junk-junk", "Author": null, "ReviewID": "R1H38MHYPXRX1U", "Overall": "1.0", "Content": "does not work with xp no customer support. downloads from website worthless.has anyone contacted the better buisness on this  company?", "Date": "September 22, 2002"}, {"Title": "Does not Work With XP", "Author": "J. Allen \"deal-hunter\"", "ReviewID": "R1S8VYFZ81AH2D", "Overall": "1.0", "Content": "CAUTION - I am a computer savvy user and spent MANY hours trying to get the JAM 3.0 to work with XP. I have not had any sucess downloading my kids pictures on XP and the updated drivers posted on JAMCAMs site (dated 2001) do not work.", "Date": "July 24, 2002"}, {"Title": "Not worth the price", "Author": null, "ReviewID": "RFO3JZY2Y4LF", "Overall": "2.0", "Content": "I bought a Jam Cam last summer to introduce my daughter to photography. It was fine for the first  five months (decent photos, easy to use) and then one day we changed the 9 volt battery and it just... stopped... working. A great disappointment. We live overseas so exchange is a real hassle. Now I am shopping for a better quality instrument.", "Date": "June 3, 2002"}, {"Title": "Great! (if it's Hacked)", "Author": "Anton Hood", "ReviewID": "RRB01PISFWGCD", "Overall": "4.0", "Content": "I bought this camera (2.0) about a year ago, very cheaply off (...), So far it has been the best (...)I have ever spent! I have better cameras but this one just goes and goes and goes, it's been all over the world, had a swim (whoops!), and it's still working. it does feel cheap and plastky and if you squeeze it hard enough the \"camera\" will fall out! (A curcuit board) which still works outside the box! as for the software it's small and easy to use, (Twain wich does not like photoshop) but fuzzes the images which is explained below and in detail on my siteOverall the camera has been an awesome buy, once the fuzzy white \"haze\" problem was fixed (Gamma) it takes some very nice shots. and tough enough to give to the kids (wasn't that what it's designed for?)##(...)P>A bit of tecchy information here,The camera has had 3 evolutions of drivers,I have the JAMCAM 2 not the v3. (they are almost the same)the first drivers take a image off the camera, whack up the gamma by 2.2 then \"enhance\" the colors, giving a washed out complexion,The second drivers, use \"PHOTOSHARP\" which is just a enhancement tool which does the same as the \"sharpen image\" in photoshopThe third drivers are the \"JAMCAM 3\" drivers which work fine with 2.0 (the R3 pics don't work) which is just tweaked \"PHOTOSHARP\"The fourth drivers are my own tweaked which give a natural color tone. (original with modified config.file)", "Date": "November 7, 2001"}, {"Title": "Don't bother with this camera.", "Author": null, "ReviewID": "R1VGWV8Z198W8V", "Overall": "1.0", "Content": "I got this camera for my wife how just wanted to take pictures of the kids and send them to her sister. After looking around a bit and seeing that this is on of the editor's pics, I picked on up at the local store. I couldn't refuse the $30 rebate and free 8meg card either. Well, I got home and put in the 16 meg card I bought and put in a brand new battery. Took 3 pictures at 640 x 480 and the battery was dead (this was brand name battery just bought that day). So I put in another battery, take 3 more pictures and again...battery was dead. I repeat this one more time and got 8 pictures out of 3 batters. Now I can see why this camera is so cheap. After getting fustrated with wasting battery's I hook the serial cable up to my computer, install the software and drivers. Follow the directions they give you in there 5 page booklet and the software tell's me to hook up the camera or check to see if the camera has power. I check the connection's and power both good. Still no go. I also tried the USB cable that it came with (another reason I went with this camera) installed everyting (on my work PC) and still nothing. After playing with it for over an hour and almost having to reinstall windows 98, I'm still unable to get it to work. Needless to say I will be taking the camera back tomorrow for a full refund.", "Date": "March 14, 2001"}, {"Title": "WHAT do you EXPECT??", "Author": "Colleen Finley \"macmom\"", "ReviewID": "R3OVIZ5XMGTNGN", "Overall": "3.0", "Content": "I bought one of these when they first came out almost two years ago - bought it strictly for auction sale pics.  I have dropped it several times, it still works.  I added an extra 28 MB memory card, and it made a world of difference in the capacity, BUT it totally messed up the LCD screen - my USB connection is loose, so I have to jiggle it sometimes to get it to work - BUT!!!  I have been less than nice to it, and it has been great to me for what I paid for it.  Close ups are non exisitant (meaning don't even try) flash pictures are always washed out.  I believe there is no longer a web site for the company - check that out too. You DO NOT need ANY extra software to download or alter the pics - Jam Cam includes that with the Cam.  I WOULD recommend this (with a 28 MB memory card) for a younger person just learning photography, or someone like me that 2 years ago could not afford anything else!!!", "Date": "April 25, 2004"}, {"Title": "love the camera but help!", "Author": "lesley", "ReviewID": "R2GOG3X762OZ9X", "Overall": "3.0", "Content": "i was given this camera as a xmas present and love it.it is so easy to use and is great for the computer......i have one problem now......plse could someone tell me what is going wrong.when i am downloading my pictures onto the computing i keep getting the error code 5er.....the pictures will not download now...plse could somebody help i miss my camera!!!", "Date": "January 15, 2004"}, {"Title": "Not worth the trouble", "Author": null, "ReviewID": "R1DZYW4HYCY84J", "Overall": "1.0", "Content": "I bought this camera with the idea that I could get some \"quick & dirty\" shots when I want to email a photo to friends or family.  I returned it 2 days later.The camera is easy to use, and uploading the pictures is also easy, but I wouldn't bother.  The quality was so bad that it's just not worth the trouble.  And I wasn't expecting much...Remember the science/art project in elementary school where you made a camera by sticking a pinhole in a cardboard box?  This camera reminded me of that.  The only differences being the flash and the digital format.I'm going to wait until the technology improves and the prices go down...", "Date": "September 7, 2001"}, {"Title": "no brainer.....", "Author": null, "ReviewID": "R3BUO3SDWGKY5J", "Overall": "5.0", "Content": "I wanted a digital camera for personal and business use.  It has to be something simple and easy to use.  Actually, a 'no brainer' type of camera.  Found this camera to be very easy and simple to use and very user friendly.Now I can concentrate on what I'm aiming at and not how I should be aiming the camera.", "Date": "June 11, 2002"}, {"Title": "DO NOT BUY THIS CAMERA!!!", "Author": "C. Brown \"rvbcave\"", "ReviewID": "R20Y8LGICR9TP9", "Overall": "1.0", "Content": "This is a lousy camera, even for the price! It drains alomst an entire battery with 8 pictures. Do not buy this under any circumstances!", "Date": "May 8, 2001"}, {"Title": "The best EVER!!!", "Author": null, "ReviewID": "R2PTZEWO63RCOH", "Overall": "4.0", "Content": "I have an Argus DC1500 that takes 320 x 240 pictures.  I just got mie on 4-87-03.  I tried takig multimal pictutes, ad it works great in 640 x 480!  The best thing I ever had!", "Date": "April 28, 2003"}, {"Title": "AVOID THIS PRODUCT", "Author": null, "ReviewID": "R3EZW4X4LQL49M", "Overall": "1.0", "Content": "This camera is terrible. It produces terrible pictures and is a complete ...! I thought for a starter camera I would be at least able to make out some of the details or images, but this did not work at all! Save your money!", "Date": "September 5, 2001"}, {"Title": "You get what you pay for", "Author": "Lisa", "ReviewID": "R190YE4JWF8QNR", "Overall": "2.0", "Content": "I bought my JamCam at K-mart, chiefly due to the low price.  Outdoor pictures in sunlight are passable for e-mail, but indoor shots are impossible (no flash on this camera)  I've also found that the battery dies FAST, so keep some spares with you.  I'm pleased with my purchase, altho I have found the JamCam to be a \"gateway\" camera....I now want a \"real\" digital camera LOL! All in all, the JamCam is a neat little toy to keep around.", "Date": "July 29, 2001"}, {"Title": "patches", "Author": "myer gensler", "ReviewID": "R2SWL8ILF7RKMU", "Overall": "1.0", "Content": "why don't you have a patch so jamcam can be used with xp i can't use mine", "Date": "August 26, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "Captures images at a resolution of up to 640 x 480 pixels (interpolated to 800 x 600)\nFocus-free lens for simple operation\nBuilt-in memory stores up to 8 images; MMC card slot for additional capacity\nConnects with Macs and PCs using USB port\nUses a 9-volt battery for power", "Name": "KB Gear JamCam 3.0 0.3MP Digital Camera, Blue", "ImgURL": "http://ecx.images-amazon.com/images/I/41TZFR5KVBL._SX300_.jpg", "ProductID": "B00004YBVF"}}