{"Reviews": [{"Title": "Olympus C-2100UZ: 35mm SLR user's \"switch\" digital camera", "Author": "M Snyder", "ReviewID": "R9FLLZRM7K5EZ", "Overall": "5.0", "Content": "If you own fine 35mm and/or large-format cameras, and have toyed with the idea of trying digital, read on at your own risk. You may -- like me -- never pick up your Leica M4P or Canon F1 or Mamiya 645 systems again.Let me tell you the only negative about this camera first: The color correction of the CCD under low tungsten illumination and fluorescent lighting resembles Ektachrome 400, circa 1970.That's it. That's the only defect.You're going to love this camera. Many reviewers wish for a 3.3 megapixel chip, vs. the 2.1 mp chip in this 2100. The recent introduction of cameras with the same image stabilized 10x lens/2.1 mp CCD system from Canon and Sony suggests some rethinking among the manufacturers of these cameras. Simply put, the ability to fill frames with image trumps the cameras with 3.3mp CCDs and smaller zoom ranges. To accommodate those 3.3 mp CCDs, one needs a larger buffer memory...which means a longer write-time...which means either a slower-shooting camera or a greater battery drain, or both, to match the frame-to-frame shooting capability of this lens/CCD/buffer combination. It also means your storage media demands will escalate dramaticaly, as will your needs for imaging media. Add the image stabilization feature, which has some kind of gyro motor running all the time, and you'd end up with unacceptable battery drain, if your had a 3.3 mp CCD.This camera offers two displays -- one the traditional 1.8 inch \"TV\" display, and the other, an SLR-like eye-level display. At first, you'll be disappointed in the graininess of the eye-level display. And yet, you will be surprised at the speed with which you'll accommodate that.The camera offers a 35mm lover's range of creative control, plus features you'd never dream of finding in an SLR or rangefinder. You can select the ASA of the CCD's sensitivity -- 100 to 400 ASA. You can select white balance, although it's not great under low-light-level tungsten or fluorescent, as noted. You can -- now get this -- choose black-and-white or...SEPIA toned imaging. The latter is a magnificent trip back to the 1950s and 60s.But nothing matches this lens. It's the equivalent of a 38-380mm zoom lens. The image stabilization means that, if you carefully brace yourself, you will easily -- and I mean EASILY -- shoot 380mm hand-held shots at under 1/20th of a second. It's a razor-sharp lens.The image compression algorithm in this camera works extremely well. The standard \"HQ\" mode generates images of around 400k size, which means you get a whopping 128 images on a 64mb Smartmedia card. You can switch to the SHQ mode and get 45 images on a 64mb card, but for most images, you can't see the difference in an 8x10 print. The write-to-buffer/write-to-Smartmedia time increases, limiting your frame-to-frame shooting speed.If you half-depress the shutter release, locking the focus and exposure, you can capture great sports action shots. If you put the camera in a manual mode, you can shoot almost one shot a second in the HQ mode.Flash reach is astounding. I have easily shot perfectly exposed images in dark rooms at 30+ feet. Recycle time can be iffy -- I minimize it with a Digipower external battery pack that plugs into the AC adapter jack -- but the flash mode seems to generate more data, which takes more time to write to the buffer and then to the Smartmedia, which slows the shot-to-shot time.You can get through about 150 frames with a single charged set of 4 NiMH 1600ma batteries -- I can't imagine going anywhere with fewer than a single well-charged extra set. The camera will kill a fresh set of alkaline AAs in about 10-12 shots -- the deep drain of a digital camera is totally incompatible with this kind of service.The camera is light, well-balanced. Its controls fall under the fingers neatly. Viewfinder controls work well, but I could argue that controls for the manual focusing could be better placed under the left fingers, rather than under the right eye, forcing you to focus with the right thumb.I purchased a C-2040 for my 14-year-old daughter's middle school graduation, and with those two cameras, our family is now fully digital.Stop looking for a new digital camera -- you've found it.You will be tempted to use the different controls and shooting modes. The iESP (\"P\") setting works so well, for most shooting, you'll leave it there.The only kind of shooting you might wish for a 3.3 mp CCD is for scenics -- digital cameras don't handle fine detail as well as 35mm film. I'd prefer a metal camera to a plastic one, like the the $2000 Olympus E-10. But I tried that camera, and it's S-L-O-W by comparison to the C-2100, and lacks both the zoom range and the imaging stabilizing features of the C-2100.For frame-filling portraits, there simply isn't a better camera.", "Date": "June 30, 2001"}, {"Title": "Olympus C2100 Ultra Zoom", "Author": null, "ReviewID": "R1VAY87CRX5WS1", "Overall": "4.0", "Content": "I consider my self an amateur photograher.  I enjoy the simplicity of point and shoot but get frustrated with the limitations this imposes.  The C2100 does great in point and shoot mode, but lets you manualy control some or all of the exposure settings. Manual focus worked well in taking picutres of fish below the surface. If you want you can specify a standard ISO value. All exposure settings are displayed in the view finder or LCD and stored with your exposure so you can compare and tweek until the shot is perfect.  Even the flash brightness is adjustable.  I was surprised on how many features this camera has and how many were user adjustable.  The movie mode runs at 15 frames per second so it's a little jerky and the built microphone leaves a little to be desired.  It points off to the left side of the camera instead of forward (there is an optional microphone port). You can also record 4 second sound bytes with each still shot (a good way to keep brief notes). The camera has an action shot mode which did a good job in freezing birds in flight.  However setting up the camera for specific shots can be a little time consuming when you're first learning (I missed more than several shots at first).  If your're out for action shots you'll have to plan and setup ahead of your shot and there is a delay between \"click\" and \"shutter\".  You can reduce time between still shots by turning autofocus on continously (shortens battery life). The drive mode will do sequential shots. The time between shots is 0.5 to 0.67 seconds depending on resolution.  If you plan to use the movie mode or high resolution shots I would recommend getting a 64mb card (holds 128 exposures 1600x1200 in standard jpeg format). I was able to get about 80 exposures on one charge of the rechargable batteries that came with the camera (this included zooming and reviewing shots on the LCD).  The camera can drive a video out but the TV picture isn't a crisp as your PC monitor.  The camera comes with USB and Serial ports but only a cable for USB.  Downloading 60mb worth of pictures takes a long time over serial port.  The only complaint I had with this camera was that occasionaly (sun to dark shadow shots) the view through the viewfinder was to dark to properly frame the shot.  Adjusting the view finder brightness didn't help. Overall I'm very pleased with this camera.", "Date": "October 22, 2000"}, {"Title": "I have a lot of fun with the C-2100", "Author": "Mark N. \"Intrigueable\"", "ReviewID": "R2MNT6QG2I9UYR", "Overall": "5.0", "Content": "The C-2100 is said to be based on the C-2000/C2020 which have been praised for taking brilliant images. Yet the camera works and operates like the latest C-3000/C-3030 series with additional features like audio/video recording, fast continuous shootings, continuous digital zoom, fast USB downloads, etc. Plus the camera has unique features of its own such as TTL (through the lens) LCD viewfinder, 27x continuous zoom (10x optical + 2.7x digital), optical image stabilization, more dedicated button adjustments (so you don't have to roll through the menus), exposure lock button, full optical and digital zoom in movie mode, etc.The image stablization works effectively along the zoom range and I was able to take sharp-focus pictures at 27x zoom without the aid of a tripod (remember I am an amateur and my hands aren't as steady as the pros'). It's a lot of fun taking this camera around shooting nature, buildings, sports, or just those innoncent people who are minding their own business from half a block away!The C-2100 uses 4 ordinary AA batteries so should your rechargable batteries (which is included with a charger) die you can always grab those AA alkalines at a convenient store. The camera usually can run half a day (on and off) using the rechargable batteries during my outdoor shooting trips.To me, this camera is a lot of fun to use, and it provides excellent pictures too. I am satisfied, almost. I only wish Olympus simplify the menu system, put on a manual focus ring on the lens, include a lens tether and a carrying case.", "Date": "November 2, 2000"}, {"Title": "Outstanding camera, outstanding value", "Author": "Doug Briggs", "ReviewID": "R27VHY8VO0J98V", "Overall": "5.0", "Content": "The description above covers the waterfront on this outstanding digital camera. Some of the features that make it my idea of the best buy are:1. An important feature to me is single-lens-reflex (SLR) viewing, in addition to the LCD viewer. For me, I've been composing pictures for decades through SLR viewers with the camera to my eye. I don't like holding a camera out and looking at a tiny LCD image. I can hold this Olympus steadier in the old conventional way and get faster, more accurate composition. For me, the LCD screen is for RE-viewing, not for viewing while shooting.2. Hefty 2.11 megapixel image. Double my old Sony (which I thought was just fine), and likely to capture everything I will need for the professional work I do. 8\" X 10\" printouts are beautiful.3. USB port connection. Absolutely essential. Serial port is way too slow. If your computer was made in the last four of five years it'll have a USB port.4. Must those of us who have grown up with f-stops and film speeds unlearn all that? Not with this camera. It has the same familiar settings, including ISO film equivalencies of 100, 200, and 400 - it just converts what we understand to what the camera understands.5. Exposure of 1/800 to 16 seconds in manual mode. That will cover any possible range of shooting I'll ever encounter.6. Outstanding and almost instantaneous autofocus. When you need to shoot you can't be waiting even a half-second (like some popular digitals make you do) for the camera to get a fix.7. Incredible 10x optical zoom, equal to a 38mm wide-angle to 380mm telephoto - I'll not need more than that range, ever.8. Image stabilization. An excellent feature, especially for those quick shots, for long-range telephoto hand-held shots and those in low light that need longer shutter-open time.9. Lightweight, about 21 ounces. And very well balanced, considering the great zoom lens.Consider getting the 64-meg Smartmedia memory card described at left --($). 8 megs will be sure to cramp your photo capacity. The whole thing: less than (#). That's not peanuts, but this is the most digital camera you'll find for anywhere near the money AND for the widest range of practical use. Perfect for photogs from novices to pros and you won't be craving to trade up anytime in the foreseeable future. You could easily spend ($) and not get beyond the practical features of this camera, and that price won't even get some of the critical features found here.After ordering your camera, go to ..., who wrote the Product Description at the top of this page, and sign up for their newsletter on digital photography. This stuff is different from shooting film (all on the plus side), and there are some things to learn if you really want to get the most out of this incredible technology.", "Date": "February 12, 2001"}, {"Title": "Bravo, Olympus -- this product is superb! (long review)", "Author": "A. Franke", "ReviewID": "R3GM861BKPK1L2", "Overall": "5.0", "Content": "I purchased this camera about 6 months ago, but wanted to wait until I had real experience with it to review it. I am 95% thrilled with this product!Before I purchased I completed a very detailed feature/benefit analysis of this and four other advanced amateur products, including those made by Sony and Nikon, all within the same price range at the time. I was looking a camera with excellent picture quality, SLR-like image control (shutter priority, aperture priority, etc.), a powerful optical zoom lens, and a small footprint (as small as possible). Obviously with these requirements, there were some compromises - for example, this camera is larger than those with 3x optical zoom lenses, but among the 10x lenses at the time, it was the smallest. I decided on this camera because it had the best score on average of all my requirements, and because every single independent review that I read was excellent.For advanced amateurs, the camera is excellent, with different shutter priority, aperture priority, bulb, fully manual and fully automatic. You can bracket exposure, flash intensity - hold the shutter button down and it will take 3 or 5 rapid shots of the same subject with different settings - then you can view them and delete the ones that you don't want. For beginners, the camera might be a bit overkill, but it has a fully automatic mode, which makes it hard to take a bad picture - even in almost total darkness, believe it or not! (When dark, the camera emits a red light that's used to focus.)Olympus was one of the first companies to release the 128MB SmartMedia card, too, and it works flawlessly with the camera - and with my MP3 player - allowing me to store both music and photos on the came card - and use it interchangeably. There's no special formatting required, and the card retains the \"special feature\" (panoramic photos) that Olympus added to the card. (Just don't format the card or it will be lost!). The 128MB card and the included 8MB card were all I needed for a 10-day Caribbean cruise during which I took about 500 pictures.Originally I thought that 2.1 megapixels might not be enough where there are higher resolution cameras available. But I rarely even use the highest resolution of this camera. Normally I use the second highest (1280x960), which combined with an online photo service like ofoto.com (or probably shutterfly or Yahoo) produces exceptional, vivid prints up to 5x7. I use the highest resolution when I want to print 8x10's.The software with the camera allows you to \"instant fix\" your prints, too. This feature automatically balances the brightness and contrast. On bright days, photos taken with this camera usually don't even need to be fixed. But for some shots, this feature really brings the image to life. In one example, I took a picture of a skunk in my backyard at night in manual mode with the shutter set way too fast. When I viewed the shot on my screen it looked completely black. I ran it though \"instant fix\" and the image of the skunk was suddenly plain to see - though it looked like a black and white shot, I couldn't believe the detail that came from what I thought was a lost image!On the down side: The camera has frozen on me a couple of times for no apparent reason. A couple of times I've needed to remove the batteries to get the camera to reset properly. This doesn't happen often enough to make it too much of a bother, though. Also, the viewfinder is digital (not optical), so it's still difficult to get a good focus sometimes. (When manually focusing, the image in the viewfinder doubles in size, which makes it a bit easier, but still it's not as easy as an SLR.) Also, I wish there was a focus ring on the lens like on SLRs - the hardware interface for focusing and aperture setting takes some getting used to. Automatic focus works very well, though.The camera came with four high-capacity batteries and a charger. You'll want to get an extra set of batteries, too. Though the camera uses batteries slower than I expected, it always seems to run out when you least expect it. Unfortunately the camera doesn't give much warning when it's about to run out of juice. The charge indicator will go from \"fully charged\" to \"empty\" and blinking in a matter of minutes.If you're an advanced amateur who likes exceptional picture quality and exposure control, plus lots of other cool features (too many to list), then you'll love this camera. When I studied these cameras, it was the best there was without taking the step up to true digital SLRs. If you're a novice, you'll find many features you don't use or don't need. You'll still like the fully automatic mode, though. And if you don't use the zoom a lot, you'll find the camera more bulky that your typical point-and-shoot. (The zoom, by the way, is exceptional - 10x optical with 2.6x digital - a total of 26x zoom, it's like having a telescope on your camera!)I hope this review helps you in your decision!", "Date": "July 13, 2001"}, {"Title": "NINE OUT OF TEN U-2 SPYPLANE PILOTS AGREE....", "Author": null, "ReviewID": "R32MEWJC45FGWS", "Overall": "5.0", "Content": "....This is ONE AWESOME CAMERA!I am a relatively new digital camera user, so if I can figure out how to use the menu, the display, and the controls, anybody can.  The body of the camera is very sturdy in its build, unlike many other models where you sort of expect the battery latch or the flash to break off from over use.  The 10X zoom lens really does live up to its billing, and the 2.1 megapixel resolution, while it is not as high as the resolution in many new models, is remarkably clear and sharp, especially for a user of entry level 460 X 640 cameras.  The camera is packed with manual overrides and even sound recording and video recording features!  The camera has an excellent USB download feature, and the photoediting software package, which includes Camedia, PhotoSuite III, and VideoWave III is good as well.On the downside, there are a few problems.  First, the camera sucks up batteries like a vampire sucks blood.  Olympus very considerately includes NiMh rechargeable batteries and a recharger pack with the camera, and this goes some way towards alleviating the problem.  Even so, you will be going back to the recharger early and often.Second, I agree with the other reviewers.  They really need a tethered lens cap.Third, this camera needs a case.Fourth, the 8 MB SmartMedia card that came with the camera is only good for either 15 exposures or a 24 second clip.  If you want to get maximum mileage out of the camera without frequent trips to a laptop or PC for downloading (which is really, really annoying) you must get bigger cards (the maximum size is 64 MB).  BEWARE!  If you do not buy a card from Olympus, the camera will make you run some insane reformatting program.Don't let these criticisms throw you.  It is a great camera, and it does rate five stars.", "Date": "December 26, 2000"}, {"Title": "Olympus 2100 - An Excellent Value!", "Author": "\"tomlutz\"", "ReviewID": "R19A1T8R6UO6YI", "Overall": "5.0", "Content": "I recently purchased the Olympus 2100 camera after considering many alternatives.  Here is what I like: Image stabilization and an all-glass 10X optical zoom means that the 2.1 meg pictures usually look better than any 3 meg camera. Great vide clip ability with sound that remains sychronized with the action. [A] Rebate if you buy Olympus accessories. Menu and controls are very easy to use - spend 1/2 hour with the manual and you'll be ready to go. Great battery life - I've shot about 100 pictures and a dozen video clips using the LCD display and I'm still on my original charge. This camera has the option of continuous focus - I usually lock the focus (1/2 press of shutter) at athletic events and then take the picture when the action happens.  I had been concerned about slow response times of digital cameras (vs. traditional), but this camera works great in capturing the action when I want. Overall, I'm very happy with this camera.  My only complaint is that the camera body is silver (instead of black).  Other than that, it has completely exceeded my expectations.  Buy a card, a reader, and another set of batteries and you're all set!", "Date": "July 16, 2001"}, {"Title": "Outstanding Value & Quality", "Author": "\"jrolson1013\"", "ReviewID": "R3PXT8WIEHCR26", "Overall": "5.0", "Content": "The Olympus C-2100 digital camera has the power and features that are hard to find in most other digital cameras. Its ability to zoom from 35mm to over 1000mm (35mm film equivalent) makes this camera worth the price alone! The image stabilization that is also a part of this camera is an added bonus. Most other digital cameras in this price range zoom up to only about 200mm (35mm equivalent) and do not allow for multiple shots.For those of you who are considering a digital camera that goes beyond \"point-and-shoot\" and has the ability to go in aperture-priority or shutter-priority mode, the C-2100 fills the bill. I do a lot of sports photography and am finding that the C-2100 does a good job. My only additional advice is to buy a 64mb SmartMedia card (the 8mb card that comes with it is insufficient) and a reader for your SmartMedia card that you can connect via USB to your PC. While you can download directly from the camera to your computer, it does add stress onto the camera.You can spend a lot more on a digital camera, but this one will not disappoint.", "Date": "March 12, 2001"}, {"Title": "The one that rocks...", "Author": "R Lopez", "ReviewID": "RAEFHAHNACN42", "Overall": "5.0", "Content": "I'm a schoolteacher, and I'm no stranger to homework.  I've agonized for almost a year on this.  Being a manual SLR enthusiast for more years than I care to remember, going digital was a big decision.  After taking Seattle vacation images on an entry level digicam, I was hooked.  I pestered camera shop owners, scanned the Web, magnified film, 3.3 digital and 2.1 digital images in 8x10 format. I finally decided on my first choice, the Olympus C-2100.  My decision was partially based on magazine articles stating that this model was used by some medium-format professionals as their \"test\" camera.  While I agree that 3.3 might make a better 11x14, I found no difference at the \"atomic\" level between 3.3 & 2.1 mp for an 8x10 printed photo, which is the largest I ever print.  If I should ever want larger, I'll use my Pentax SLR.  Photography is my passion, not my profession.  About the camera.  Let me point out the negative:  The 8mb card.  Don't use it.  It's almost funny.  If you're going digital, expect some expense.  Get the 64 or 128.  So much for the bad.  That's it.  As I anticipated, I am ecstatic.  I have found n-o-t-h-i-n-g that matches this 10x aspherical lens with IMAGE STABILIZATION at this price!  I've tried taking bad shots, but it's not easy...this machine only wants to do right!  And that's just the programmed mode.  You just have to try the aperture-preferred, shutter-preferred, scene program, and MANUAL.  If that's not enough, you will play with the sepia and black and white modes for nostalgia!  At the price I paid, which is hundreds less than a year ago, it might be my last toy...  Armed with the included 1600 rated rechargeables, I took loads of photos in the back yard, Waikiki, flower farms, and scenics.  Dumped unwanted images, took more, gave up counting, downloaded, and the original batteries are STILL going!  If you use alkalines, this machine will drain them like a vampire; fifteen photos and they are deceased.  It may not be the norm, but the shot-to-write time ratio for the Smartmedia card appears to be much  shorter with the 2.1 mp CCD, which may be why energy could be distributed more efficiently to the image stabilization feature.  USB cable and provided Camedia software are excellent; Adobe Photodeluxe even fixed \"b-a-d\" images.  This camera caters to SLR lovers.  If you want tiny, and if you want one to put in your pocket or purse, look to the C-700 instead, if you still want 10x zoom.  It just doesn't have image stabilization.  The C-2100 cradles readily into the hands like an SLR, but without the tonnage.  Olympus even positioned the strap so it would counterbalance the feature item:  The massive lens barrel housing.  That way, the lens doesn't droop down looking at your feet.  I've taken about twenty night shots, available artificial light, NO TRIPOD (even though I usually use one).  Sharp, facial-stubble clarity, stunning color quality.  If you don't have one, you might invest in a CD burner and CD RW's for all the pictures you'll take.  This baby is THAT good.", "Date": "January 2, 2002"}, {"Title": "This is really great!!", "Author": "Rheumor", "ReviewID": "R1W91FILSYC20H", "Overall": "5.0", "Content": "Last night I inaugurated the 2100 at a Friday night football game. Taking the place of my JVC DVM70U, Canon S100 & Olympus Camedia 700 (all of which I like), the 2100 had a lot of big shoes to fill. First of all, I bought it for the 27x zoom, which from the sidelines is absolutely necessary to get into the action, and for its built-in stabilization system, the lack of which made long range zoom shots frequently blurry in the JVC & Camedia 700. I bought an extra set of batteries, a nice, leather Olympus case and a 128 meg SmartMedia card.I spent about 2 hours with the fairly complicated and not too well written manual before gametime. I pretty much had decided to leave the camera in its 'sports setting\" for my first night,  which is accessible easily through the thumbwheel control knob atop the camera body (though this requires a little time in the setup menu, which I found pretty intuitive).Well, 48 plus minutes later I had shot 83 pics at a medium resolution (1024 x 768), and about 12 30 second QuickTime movies at low resolution (320 x 240). There was still a ton of room left on the 128 meg card, and the batteries were still juiced!The camera was easy to operate, easy to hold and the new electronic viewfinder is about as nice as it gets. The zoom was fine as frog's hair.When I got home, I installed the nice software package and connected the camera via the USB cable (supplied). Downloading took about 5 minutes (BTW, I ordered a SmartMedia FlashPath reader, but you-know-who didn't get it here on time, despite the overnight shipping charge...but I digress) and playback was a cinch. All in all, the photo quality was very good, though I think I can do better at freezing the action than the so-called \"sports program\" did. The QuickTime movies, even at the lower of the two resolutions available, were magnificent; they were better than the JVC digital camcorder and the sound was really high quality.Now this is no point and shoot, but if you have a little time and interest, I think the 2100 represents a great multipurpose digicam.", "Date": "September 22, 2001"}, {"Title": "Great Digital Camera", "Author": "\"leebeverly645\"", "ReviewID": "R3J85FF5EXFP61", "Overall": "5.0", "Content": "I've been into SLR 35mm photography for over 30 years and just entered into the digital arena. I purchased the Olympus 2100UZ and rate it top of the line. If you want a simple point-and-shoot camera, this is it. If you want to control the camera completely, again, this is it. If you want a powerful zoom lens, then this is definitly it, and with its stabalization on, no support is necessary, unless you really ZOOM out with the Digital Zoom turned on. And another thing to mention about the stabalization feature, low light photography is even possible without a tripod well below 60. I am thoroughly pleased with this camera. The instruction manual is well written and easy to follow. Down loading to a computer is simple with the included software. I would recommend the A/C adapter for down loading and viewing photos on the T/V, and a spare set of batteries.", "Date": "September 23, 2001"}, {"Title": "Fantastic Camera", "Author": "Stephen R. Parrish", "ReviewID": "R3IER0A8LOM2JL", "Overall": "5.0", "Content": "This is my first digital camera and I bought it after becoming interested in birding and checking out the cost of good optical telephoto lenses.  The optical zoom to 380 mm gives great results and I think that this is largely due to the stabilization.  One of the strengths of a digital camera is that if in doubt you go ahead and take the picture because you can always erase it.  I've taken quite a few pictures that I would have never tried because of motion and been very impressed with the clarity.  When the zoom is pushed between 380 mm and 1000 mm the quality drops so my impression is that this is really a 380 mm lens that crops to make the picture sized for 1000 mm.  The manual is not clear on this.  Still, the zoom is impressive as are the multitude of options.  If you are interested in a digital zoom camera I don't think that you could do better.  If you don't care about the zoom then you probably should get a cheaper camera with slightly better resolution.  The camera is surprisingly light and has a good feel and at the basic setting is very easy to use.  I would recommend the 64 mb card as well and an extra set of rechargable batterys.", "Date": "April 21, 2001"}, {"Title": "Buy This Camera!", "Author": null, "ReviewID": "R342JX1137KSRY", "Overall": "5.0", "Content": "If you are reading this, you are thinking about this camera-- BUY IT!  This camera is my 3rd digital camera, and is  a must buy if you are interested in a camera with a powerful zoom lens with a lot of features.  After reading professional reviews, I almost didn't buy it, but am now glad that I did.  The low scores in many reviews were more attibuted to the price for a 2 megapixel camera, [price], when it first came out.  I just paid [price]at compUSA- by far the cheapest anywhere on earth.  It is just a 2 megapixel camera, but I think that there is too much emphasis on megapixels in reviews.  What really counts is a good quality photo which this camera produces.  Most printers today can not even begin to take advantage of the 4 and 5 megapixel cameras unless you are planning on printing a lot of pictures larger than 8X10.  (unless you are willing to spend [price] or [price]for a professional printer)It's just plain overkill!  I have printed from 4X6 to 8X10 and have been very pleased with the results.  I printed comparative shots between my 3.3 megapixel (with very little zoom) and this 2 megapixel, and this Olympus produced better photos in color detail and saturation.  What you will get is unbelievable pictures that you were previosly unable to capture by virtue of a 10X zoom.  I have an HP 1315 photo printer.  You will need a good printer to get good print results.  I did not rate support as I have not needed any.  A few things that may be considered negative:  is a little complicated to learn, but there is just so much you can do.  I also don't like that I have to reset the date and clock each time I change the batteries.  The 8 mb card that comes with the camera is a joke.  Buy a 128 mb card right away, they are cheap.  I also prefer to use a seperate card reader for loading photos into the computer, it is much faster than going through the camera and does not use any battery power.  The EVU takes a little getting use to, and can be difficult to see in low light.  I'm going on a carribean cruise, and my 3.3 megapixel is staying home.", "Date": "January 10, 2002"}, {"Title": "Great Camera, Great Pictures", "Author": "Ken R Lee", "ReviewID": "R2QYOX4Z4K6LT1", "Overall": "5.0", "Content": "This is a fantastic camera.  With hardly a look at the manual, you can operate the controls.  There were only a few items I couldn't figure out just by looking and doing.  The flash gives great pictures at normal view or zoomed view.  On the HQ setting (1600 x1200) with a 64mb card, I get 128 pictures.  At this resolution, my pictures, printed out on glossy photo quality paper, look like they were taken with 35mm film.  This camera has the look and feel of an expensive SLR camera.  It has good grip and balance.  The only complaint I have is that the \"Product Specs\"& ... states that this camera comes with an AC Adaptor.  Mine did not.  The rechargable batteries last a long time.  I bought 4 sets just to be sure I have power when I need it.  Seldom have I needed more than two sets.", "Date": "April 16, 2001"}, {"Title": "Flexible yet light", "Author": "James J. Horning \"Jim H.\"", "ReviewID": "R2U0J229M8EIPF", "Overall": "5.0", "Content": "I was considering the Nikon CoolPix 990 and the Canon 3030, but what really sold me on the 2100 was the 10x optical (plus 2.7x digital) zoom. Everything has worked just as advertised.  I get nice 8x10 glossies (you have to look real close to see pixelation).  I took it to a couple of evening Christmas parties in very mixed (mostly low) lighting, and got good focus and available light shots across the room.  The claimed 13 foot range for flash seems conservative. This was my first camera with \"red eye reduction flash\"; it did its job, but I turned it off because of the greater delay between clicking and shooting.  Better to remove the occasional red eyes with PhotoShop, I think. A worthy replacement for my OM-1 and OM-77 for most purposes.", "Date": "January 4, 2001"}, {"Title": "C-2100: An Incredible Digital Camera", "Author": "PBF", "ReviewID": "R3P4PUSI0TJEXW", "Overall": "5.0", "Content": "I purchased my C-2100 last Christmas after much debate. Most of my photos are of either surfing, nature scenes, or family snapshots. This is why I really needed the big zoom (it is sweet). I've owned two Nikon 35s and was very reluctant to go digital but am very glad I did. This is a fantastic camera. Easy to use (wife and kids use it) but also can go full manual when you need it. The pictures are impressive - 2.1MP is enough for me and unless you are making huge enlargements, it is good enough for you. The reason I decided to write this review was because of an accident with the camera. I was holding it in one hand and my son ran by accidentally catching the strap and knocking it to the concrete sidewalk we were standing on. Of course I freaked. The battery cover popped off and the lens hit so hard it cracked a UV filter I had screwed into the lens. I thought it was scrap because it REALLY hit the ground hard. After putting the batteries in I was shocked - it worked fine!!! No problems except for a dinged up battery cover and some cosmetic scratches. Totally unbelievable. Like they say, just buy it, you will love it.", "Date": "October 10, 2001"}, {"Title": "Best camera you can buy", "Author": "W. Marshall", "ReviewID": "R31243HN62NSMM", "Overall": "5.0", "Content": "Before I bought this camera I hadn't ever touched a Digital Camera before.  I had read reviews about this camera in 2 different magazines in the same month (March/01) and these magazines did nothing but say great things about this camera.  10 other cameras were reviewd including the new Coolpix and 2 of Sony's, it stated that the Olympus C-2100 was the best and if could only have been 3.1 Megapixels it would've been unbeatable.  So I went out and bought this, and I love it!  I have been taking beautiful pictures with stunnig image quality.  I can't even see why anyone would ever need a 3.1 megapixel camera unless your wanting to blow your picutes up to Poster size or something.  The 10x zoom is of course the greatest feature, and I'm glad it has a smartcard instead of floppy disks like some of Sony's.  Floppy disks are not dependable at all, I am a tech support rep for a computer company and you don't really want to save much on a floppy disk.  I understand that smartcards don't last forever either, but the way floppies are made;  you could lose your pictures at any time.  But this Olympus camera is a beauty, it has so many modes and options that you could take just about any type of picture.  The only thing I don't like is the Panoramic mode, but oh well.  I don't really see using the video and sound function when it only records a few seconds, especially if you have a camcorder already.  But this is an awesome camera that produces stunning images.  I definitely recommend this camera, just read all of the other reviews!!!", "Date": "April 13, 2001"}, {"Title": "One of the last GREAT Values in Digital Cameras", "Author": null, "ReviewID": "R2NQZO0I9EF4GK", "Overall": "5.0", "Content": "Because I teach digital cameras to more than 10,000 people each year, I naturally have more than a few digital cameras myself and the opportunity to see and use many digital cameras belonging to my students.The Olympus 2100UZ while only a 2.1mp camera, gives the user an optically stabilized 10X platform with an outstanding lens. If image sharpness is a priority for you, the 2100UZ delivers it in spades. It compares very favorably indeed with other 3 and 4mp digital cameras. My students are usually amazed that the digital photos I show them from this camera come from a 2.1mp digital camera.I own not one but two 2100UZ digital cameras. That tells you very well that I rate this digital camera quite highly. If you are considering the Canon Pro-90 which is also a 10X stabilized digital camera, in my opinion, even though it uses the same lens and stabilizer system, it is nowhere near the digital camera that the Olympus 2100UZ is. I own a Canon Pro-90. The Canon is slow to focus, especially in dim light and produces a lesser quality digital photo.", "Date": "March 18, 2003"}, {"Title": "Great Camera", "Author": "J. Alexander", "ReviewID": "R38S0RZZJ3T2HL", "Overall": "5.0", "Content": "I got mine 18 days ago.  I would prefer more megapixels, but in the price range, I had to choose between megapixels and zoom, and I went with zoom.  I simply like a strong zoom.  I took it to the zoo to test it.  For some animals you need a strong zoom and for some animals you don't.I feel that the picture quality is better than the Canon Rebel 2000 35mm/Kodak picture CD combination.  I used to get my film developed with the picture CD option, but that costs too much.  I wanted to say goodbye to film.  My Canon has easier to use manual focus, but my Olympus has easier to use exposure compensation.You can shoot short films with the camera.  6 minutes fits on a 128 MB card.  At the zoo, I filmed a bald eagle in flight.For my new digital camera, I paid extra to get a 128 MB card, spare batteries, and AC charger.  I would recommend those items.", "Date": "July 8, 2001"}, {"Title": "New territory", "Author": "Stewart Brand", "ReviewID": "RDVK8V4DHHEGS", "Overall": "5.0", "Content": "This camera opens up whole new realms of use, thanks to the STABILIZING 10X telephoto.  You can nab wildlife in the field and take the images home to the field guides.  You can collect human behavior at its most candid and beautiful, because you're at a distance where the camera is effectively invisible, even if the subject knows you're shooting.  You can do serious telephoto in low light because the stabilized lens permits low shutter speeds.I only wish it had Compact Flash storage as well as Smart Media, because the joy of digital shooting is that you can just blaze away and then cull once you've dumped to the computer.  This is my third Olympus digital camera (after the 2500 and the 490).  I keep all of them busy.", "Date": "January 8, 2001"}, {"Title": "simply amazing", "Author": null, "ReviewID": "R1QBP47YRSQ3GB", "Overall": "5.0", "Content": "I just got back from a motorcycle trip to bravaria where I took my new c-2100.  It had to be light, easy to use, able to store lots of pics, be small enough to fit in a tank bag, and have a great optical zoom.  also, I wanted it not to eat batteries.  This camera more than made the trip successful.  The zoom lens is made by Zeiss, the makers of the best optical scopes in the world.  And it more than works on this Olympus.  Zooming in on the castles from far away left the image clear and impressive.  I went to an industry meeting where they had hired a professional photographer ... guess who got all the good pics!  I fully recommend this one ... you'll love it", "Date": "June 12, 2001"}, {"Title": "If you are not a millionaire", "Author": "Claude wadsworth", "ReviewID": "R3STTCBZXMPTF4", "Overall": "5.0", "Content": "And I am not, But if I were the 2100 UZ would still be my camera of choice. I have been doing digital photography since Olympus came out with the first digital model.and I had moved up to the 2500C and was perfectly happy untill it was stolen from my car.My insurance co. would replace it up to [amt]I looked at them all and chose the 2100UZ because of the Zoom and image stablization.. If I could have any camera up to [amt], I would still go with the 2100 UZ.The picture quality is absolutely GREAT, I could go on and on, But let me say just this, BUY this camera you will not be disappointed!", "Date": "February 12, 2002"}, {"Title": "out of this worl camera", "Author": null, "ReviewID": "R31ZEICU2RY9HO", "Overall": "5.0", "Content": "The 2.11-megapixel sensor is just one of the reason this rocks, could be better but this is enough not far from the fuji fine pix. I am also very impressed by the 10x optical plus 2.7x digital zoom lens. Lens incorporates optical image stabilization, no more blurry pics! Included 8 MB SmartMedia card holds 16 images at default resolution but buy the 64 mb card and thats all you need! So many reasons to buy this camera it connects with Macs and PCs via USB or serial port. USB is better and faster. Not to worry about running to the am/pm store cause this comes with 4 AA rechargeable batteries and charger included! BUY! BUY! BUY! this camera for yourself or for someone else. This is an awesome camera.", "Date": "November 9, 2000"}, {"Title": "A Fantastic Digital Camera", "Author": "L. Marion", "ReviewID": "R3CMU2BOVZ61FR", "Overall": "5.0", "Content": "My criteria for a digital camera: macro capability, big zoom lens, excellent print quality at 4x6 (I have never blown up a vacation photo in my life) and ease of use. What I got with this camera was everything on my wish list and more.I spent days researching digital cameras and decided I needed more lens than megapixels. How many of you have enlarged your photos past 8 x 10? I was ready to purchase a 5 megapixel camera when I realized I didn't need it. The photo quality is amazing and I have taken some shots in horrible conditions to push it.This camera is very light but feels solid. It communicates seamlessly with my Mac for downloads and the controls are designed well and are easy to navigate. The people at Olympus obviously know what they're doing. Good job!", "Date": "June 5, 2002"}, {"Title": "C-2100 is the Best", "Author": "Amazon Customer \"schafferbj\"", "ReviewID": "R38LYJCS582JQH", "Overall": "5.0", "Content": "I've agonized buying a digital camera for about a year now. I liked the Sony FD-95 for the floppy disk feature and excellent picture quality (we use one at work).I finally gave in and bought this camera. I bought 2 additional 64Mb smart cards. I would recommend this - each card holds 128 photos at the 1200 x 1600 resolution.I took this equipment camping and was worried about running out of battery juice.  I took 102 photos and had plenty of battery life leftover. (I used the flash ~ 10 times.)  I recently took \"candid shots\" at a wedding ~ 86 shots total (all with the flash), reviewed the photos several times and the batteries finally gave out.It comes with one set of NiM H batteries & charger. The photos are great, and the download time (via USB cord - included) was about 2 min total.  The software installed without a hitch and worked perfect first time.", "Date": "May 30, 2001"}, {"Title": "Zoom, quality is impressive, VIVID pictures, WOW !", "Author": "David Vincent", "ReviewID": "R35KZ6YHCRKLTB", "Overall": "5.0", "Content": "Had to decide how many MegaPixel's I needed first, and most printers today can not even begin to take advantage of the 4 and 5 megapixel cameras unless you are planning on printing a lot of pictures larger than 8X10.So after deciding on a 2 or 3 MP camera, I needed lots of zoom for sporting events, and image stabilization cause I'm not always steady.  This camera delivered in all areas I needed, and I could not be happier with the qaulity of my pics.  I shoot in SHQ mode, stay away from shooting uncompressed TIFF's.  Pics are so real, WOW!", "Date": "June 2, 2002"}, {"Title": "C-2100 is a versatile performer for advanced amateurs", "Author": null, "ReviewID": "R2FARNNNE53I3P", "Overall": "5.0", "Content": "The combination of 10X zoom, macro mode, and image stabilization gives this camera a level of versatility found only  in professional level digital cameras.  Although it has only 2.1 Mega-pixels, this is more than enough for most amateurs, producing satisfactory 8X10 enlargements.Image stabilization allows you to take (300mm eqivalent) tele-photos without using a tripod.  Macro mode allows reasonable close-ups as well.The image viewfinder is not optical, but uses a small LCD screen.  This does take a bit of getting used to, and is sometimes a problem with low light . Likewise, taking action shots with image stabilization and at a high zoom level can make the image quite jumpy.  Turn off image stabilization if you are using a fast shutter.Overall, I rate this as some of the best money that I've spent. It certainly gotten me interested in photography again.", "Date": "December 13, 2001"}, {"Title": "Olympus C-2100 2MP Digital Camera w/ 10x Optical Zoom", "Author": "Ken Chambers", "ReviewID": "R1Z0MQOTHGOONU", "Overall": "5.0", "Content": "I have had my C-2100 for about a year and love it.  The 2.0M pixel is good for almost any work.  You can operate it manually but you don't have to because it handles almost any situation in the auto exposure mode.  The 10X telephoto is the feature that clinched the sale for me.  You can bring those long shots in close and use it for framing subjects.  Oddly, the telephoto lens is the only negative I have with this camera.  It makes the camera hard to conceal if you don't want to look like a tourist.  I picked up a Fuji 2600 for those situations.  But for really serious pics, I take the C2100.", "Date": "June 28, 2002"}, {"Title": "Buy this camera", "Author": "Steven L. Gordon \"Rocketeir\"", "ReviewID": "R3BLZ0Z86HYR7D", "Overall": "5.0", "Content": "I have been an SLR photographer for about 20 years and a digital photographer for about 3 years.  This camera gets you the best of both worlds.  The lens is fantastic, the ease of use is a joy, and the full range of features boggles my mind.  I was able to get a good deal right now at compusa and the price difference paid for the extra batteries, 128 Mb card and a card reader.  These are the three accessories that you must get, in my opinion, as well as a UV filter and a bag.  Do yourself a favor and quit shopping around.  Buy this camera now.", "Date": "April 7, 2002"}, {"Title": "By By 35mm!!!", "Author": "Mike Taylor", "ReviewID": "R1OH2FTFWM3I68", "Overall": "5.0", "Content": "This is by far the best camera I've ever owned.  The camera may look complicated but if you simply want to point and shoot it's no problem.  As you advance in your photo skills it will advance with you.  It feels like your holding an old fashioned 35mm, but takes even better pictures.  Order a larger memory card if you love to take pictures, the standard 16 picture capacity was simply not enough for me.  I've had my C-2100 for a year and thought it was a great buy ...!  I'm kind of sick to see it can be purchased for nearly half that price now!", "Date": "December 15, 2001"}, {"Title": "One of the best in it's class!", "Author": "Anonymous A", "ReviewID": "R2RN0Y0D9W5UP4", "Overall": "5.0", "Content": "This digital camera is truly amazing! When looking at pictures of the camera online, I thought that it would be big, bulky, and uncomfortable to carry around, but it's smaller than it looks in the ads and comfortable in the hand.The digital image stabilizer is truly helpful for people like me with unsteady hands. I love the customizing options it has such as, increasing or decreasing the intensity of the flash, taking portrait like photos, taking photos of moving objects, and much more! The manual is as easy as can be to understand. And, the most important thing of all, it takes wonderful photos, better than some 4.3 Megapixel digital cameras. You will absolutely love it!", "Date": "November 1, 2001"}, {"Title": "Best Digital Camera of All Time", "Author": "Mark Perry", "ReviewID": "R2993OOW4KQC9P", "Overall": "5.0", "Content": "Simply the best and most fun camera to use....from Pro to amature....you won't be disappointed. I have owned mine for over 3 years now without any problems and paid over $900.00 for it new then. It is worth every dollar!Great electronic LCD viewfinder!Acts and feels like a true SLR 35mm, but takes GREAT...GREAT...Digital pictures.Fast and easy adjustments from f-stop to speed, lighting, everything!The best lens I have ever seen on a Digital Camera....has Sony beat hands down! The 10x is remarkable....I will never own another camera without 10x optical....ever!I will use this camera till it dies, and I have owned Nikon SLR (FE, FE2, etc.) in the past....the ease of operation and output blows them away! Even at 2.1 Mp, the images are sharp and color is right-on!If you can find one of these....buy it....you won't be sorry! It's worth 10 stars!!! I hope Olympus makes another just like it (same shape and not that square-instamatic-look)with higher MP in the future!", "Date": "June 10, 2004"}, {"Title": "Great camera", "Author": "Rajendra S. Gondhalekar", "ReviewID": "RFCR0GOONK5W9", "Overall": "5.0", "Content": "Excellent picture quality and level of control over the pictures you can take.  10X Optical Zoom is incredible for its time and is still hard to beat.  The optics are remarkably distortion free at all focal lengths.  2MP CCD makes this a very fast camera, as a lot of time is not waste writing to the card while the photo opprtunities slip away.  Great low light capabilities with slow shutter speed. This is a bargain to be had in the used camera market.  There are other cameras that sound better on paper, but when it comes to putting pixels on a memory card, there is none that surpasses the versatility and fun of this camera.", "Date": "June 7, 2004"}, {"Title": "Great camera and lighter than you might think", "Author": "D. Myers", "ReviewID": "R35Y30CLO8T7DW", "Overall": "5.0", "Content": "This is a wonderful digital camera.  The stabilization feature helps me out alot, because it is so hard to hold anything completely still.  I haven't taken a bad picture yet with this camera.  I love how far I can zoom.  It comes with it's own batteries and charger !  Make sure to get at least a 64 meg memory for it though (especially if you want the really wonderful pictures this camera is capable of).  Believe me, you want this camera !  Buy it !", "Date": "August 6, 2001"}, {"Title": "Great Camera", "Author": "\"sldowdy\"", "ReviewID": "R29TAUKZRQJKTF", "Overall": "5.0", "Content": "This is my second digital camera.  The first was a learning experience.  It took good pictures for a 4 x 6 print; however, it had no zoom.  I could not get any close ups.  After getting on the net and comparing cameras and the available options, this was my pick and I love it.  It is a great camera.  It takes beautiful high quality pictures and it has a fantastic zoom.  You can even print 8 x 10's.  It is extemely easy to use.  The only fault is the 8MB card.  I will definitely be investing in a 64MB card.  This camera is definitely worth the money.  As the saying goes, \"You get what you pay for.\"", "Date": "May 19, 2001"}, {"Title": "Great Pictures but not reliable", "Author": "Byron Whitesides", "ReviewID": "R3PP1BCZTG4JD0", "Overall": "2.0", "Content": "I have had this camera for about nine months, and love the zoom and it takes great pictures.  About 2 weeks ago after downloading about 200 pictures to the computer from a 128 meg card, the camera lost power and wouldn't power back up.  I had to send it in for repairs, which I found to be a flat rate repair of a high price if your warranty has expired.  While researching online to try to find what had happened I also found that many others had the same problem, and it appears to be something that Olympus shoud recall and fix.  It appears that if the batteries get low, the power circut board burns out!  Because of this problem I would tell everyone to beware of this camera, snd it appears that other Olympus models have this same problem.  I have purchased a card reader so as not to have the batteries get low when downloading, and hope this will solve the problem.  If it breaks again, I will just throw this camera away as the cost of repair is too high.", "Date": "May 16, 2002"}, {"Title": "a fine camera", "Author": "rj smith", "ReviewID": "R2VUSHUD8IT4Y5", "Overall": "5.0", "Content": "it's a pleasure to own this.. it is everything a photo hobbyist could ask for.. with the exception that \" right around the corner\" Olympus will be announcing the 3.4 or 4.0 etc. model of this same camera and I'll have to have that. Unlike the c3000 and c700, this camera feels and looks like a camera should ...solid constuction .. and controls that make sense and to the extent possible, save on battery expenditure..ie (the mode switch is separate from the on/off switch).. many more thing I could mention in comparison to  some of their other models in the $... price range but time doesn't permit it ..nevertheless the C2100 is not only quality but \"fun\" to use.", "Date": "July 14, 2001"}, {"Title": "2002 to 2007 AND THIS OLYMPUS IS STILL GOING STRONG", "Author": "Paul", "ReviewID": "RNKX0E4HYGBQE", "Overall": "5.0", "Content": "It's going on 2008 and this Olympus 2100 is still going strong.  It is not a camera that's been on the shelf waiting to be used.  It's been in at least half of ths U.S. taking pictures the whole way from Disneyworld to the back woods of Maine. If this camera is an example of Olympus quality, I am waiting for the equivalent of this camera to come out today.  I see lots of cameras out there but when you get down to it, this old camera does everything they do.  If anybody can suggest it's equivalent, please add on to the messages on this page.", "Date": "November 4, 2007"}, {"Title": "This Camera is the Greatest!", "Author": "Sashasaurus", "ReviewID": "R35QNJPOMJJJC6", "Overall": "5.0", "Content": "I bought this camera a few years ago after doing weeks of homework.  It was the best camera I could find at the time for the price... Let me just say it was one of the best purchases I've ever made.  This camera has crossed half the states in the US, and a handful of countries in Europe and I've never been disapointed in a single shot.  The zoom lets me take pictures of animals accross lakes and then later zoom in on the details.  I have the most amazing pictures from going to watch the bald eagles in Illinois thanks to this zoom.  If you are looking for a digita camera I'd strongly encourage you to purchase this one.", "Date": "November 13, 2004"}, {"Title": "easy to handle", "Author": "V. L. Hirt", "ReviewID": "R2OULSZANKCPN7", "Overall": "5.0", "Content": "I would strongly agree with the others here who rave about this camera.  It's a great camera.  I just wanted to add one more thing.  Some cameras are clumsy to work with.  A half-hour of shooting and you feel like you are dragging around a ball and chain.  I was very surprised to find this a very comfortable camera to hold even after an extended time.", "Date": "June 19, 2002"}, {"Title": "C2100: A great all purpose camera", "Author": "Animal \"Animal\"", "ReviewID": "R1KD9C0TIVNG3I", "Overall": "5.0", "Content": "I've had my 2100 for almost a year now and still love it.  The only suggestions I could make to improve it would be a faster lens (Currently F2.8-F3.5), higher resolution (Now 2.1 M)  and better battery life.  It comes with rechargable batteries but I find that buying Lithium AA's or CRV3 (Expensive but much longer life) means I rarely worry about battery power.  I also recommend the 128M smart-media card.  I get 257 high res pictures before I have to upload. The ability to shoot manually (manual focus, Aperture and Speed) are great for teaching new photographers. (I'm teaching my 9 year old)", "Date": "June 1, 2002"}, {"Title": "Amazing", "Author": "john t guerra", "ReviewID": "R1NJ4PIP91OSY8", "Overall": "5.0", "Content": "This is my second Olympus camera. My first I paid over [dollar amount] for a few years ago.It was the D600l and was a great camera. I bought the Ultra Zoom for close up pictures of animals. I keep amazing my friends with pictures of animals with the Ultra Zoom and for the price its a real bargain for what you get. You even get a cam corder feature that is great. I have used it in various conditions and its performed in every situation. And believe me I take allot of pictures and the quality is great.", "Date": "May 28, 2002"}, {"Title": "Excellent for point and shoot or advanced photographers", "Author": "D. Riggin \"driggin\"", "ReviewID": "R5J0TNB72G28W", "Overall": "5.0", "Content": "I've owned the c-2100 for 6 months and am very pleased with my purchase.  For this price point, you're looking at buying a 3 megapixel camera with some features or a camera like the c-2100 with all of the features you could need.  The true optical zoom is awesome and I've also had good results with the digital zoom.  I've used it indoors, outdoors, on manual and automatic settings and have been pleased every time.  The only two negative things I can say are that the size of the camera is larger than the average digital camera and the flash refresh is slower than I am used to with a traditional SLR.", "Date": "March 28, 2002"}, {"Title": "Good overall but lacking in a couple areas.", "Author": "Matt \"mattfl1\"", "ReviewID": "RBCN034RFSY7H", "Overall": "4.0", "Content": "I had the chance to borrow this camera and use it for a couple days. The camera is easy to operate, looks nice, and produces pretty good results. This camera is proof that for 8x10 prints, a 2.1 megapixel CCD is sufficient...but I wouldn't go any bigger than that. 8x10 is really the limit with 2 megapixels. It's easy to connect to the computer and download images. The 10x zoom is sweet. After using this camera and going back to another camera with only a 3x zoom, I felt deprived. AND IT'S IMAGE STABILIZED!!! However, there are a few things that really bothered me about this camera:a. Fastest shutter speed is 1/800 of a second in non-automatic modes. That's not very fast. If you're trying to capture fast moving objects, forget about it. Your picture will be a blur, especially if you're using that 10x zoom.b. The purple fringing, aka chromatic aberration, you see on digital cameras sometimes is pretty bad on this camera. From what I've been told, this is common on Olympus cameras.c. I don't like how the on/off/reset-settings selections are all on the same switch. It is WAY too easy to accidently push the switch up too far to the reset-settings selection, and wipe out all the custom settings you've made. Olympus really should've made this a seperate switch.Overall I liked the results, but I decided not to buy this camera due to the faults I listed. If Olympus makes another camera like this, with what I listed fixed (and hopefully with a 3 megapixel chip as well), I'll be the first to buy it.", "Date": "September 9, 2001"}, {"Title": "What  a CAMERA!!!", "Author": "JT", "ReviewID": "RFL2SILWHSQEM", "Overall": "5.0", "Content": "Have only had this camera for a week now.  Moved up from Fuji MX1200 (beginner grade).  The Fuji took excellent pictures even in macro mode....but this Olympus takes the cake.  I have a lot to learn yet, but I am having soooooo much fun!  The zoom was the determining factor for me.  With the 10x zoom and the 2.5 digital zoom...you are right on top of your subject. Great, clear, sharp pictures.  The price is right and the name Olympus was enough for me.  I highly recommend this camera. Could not ask for more. Shop around...lots of difference in prices.", "Date": "January 3, 2002"}, {"Title": "After comparing digital cameras for 3 months THIS IS IT!", "Author": "Mike Tue", "ReviewID": "R3THH0OK4Z63J4", "Overall": "5.0", "Content": "I'm not one to make hasty decisions when it comes to expensive items, I do my homework. After buying three magazines dedicated to digital camera comparisons and reading numerous online articles, I went to the most expensive camera shop around and got excellent expert advice. Then I played with the finalist. Four main things were important to me. They were: 1) Price 2)Pixels 3) Zoom and 4) Quality. The C-2100 Ultra Zoom has it all!", "Date": "December 10, 2001"}, {"Title": "Best times 3", "Author": "cowartmd \"cowartmd\"", "ReviewID": "R20OUC3YENJWCM", "Overall": "5.0", "Content": "I am about to replace my stolen C2100. It will be my third one that I have owned. This camera is a workhorse. Don't let the 2 megapixel rating scare you. Most of my highly acclaimed photos I have taken with this camera and my other Olympus cameras are down the list in ease, quality and zoom length. Buy this camera if you can. It will not disappoint. It is especially good for \"personal\" and candids which require stealth. The zoom will get you incredibly close and remains the best cropping tool for reaching the latent image from a distance.", "Date": "May 29, 2004"}, {"Title": "Over a year of reliable service", "Author": "Jared Yates", "ReviewID": "R25VUAERSSSXBY", "Overall": "5.0", "Content": "I'm convinced that this is one of the best buys in digital photography- mine has been spectacular for over 5000 pictures in the past year.  It isn't the best camera on the market, but for the money, it is really great.  If you want to learn about photography basics, then it has a manual mode.  If you want to point and shoot, it does that too.  Long exposures over about 1.5 seconds aren't that great due to noise.  Of course the zoom is fantastic, but don't forget to compare the image stabilizing.  I've never been friendly with a camera that didn't have it, so I can't compare, but I do know that I can almost always get nice shots at a distance, even in somewhat low light.", "Date": "December 31, 2003"}, {"Title": "Jeff", "Author": "HandyGuyWithTools \"Jeff In Milwaukee\"", "ReviewID": "R1X666T0S646BY", "Overall": "5.0", "Content": "Have owned this camera for 2 years.  The stabilized 10x optical zoom can take clear shots without blur from camera movement.  Great indoor picks with flash.  Full manual to full auto works as you see fit, old 35mm buffs with like the options available.  If you need a camera that can take zoom shots that are close up and clear, you can't do better than this at its current price range.  If you have kids in sports, this camera can take nice close ups from the stands.  2.1mega pix allows clean and crisp 4x6 prints.  (Size is its only distraction.  I would also like to own a pocket camera such as the Pentax/Casio mini 3mpix or the Minolta to take with for unplanned moments.)", "Date": "July 21, 2003"}, {"Title": "Unique digicam in a crowded market.", "Author": "Wade Hathaway \"mrwade6\"", "ReviewID": "R1RQIB7AWCI9H5", "Overall": "5.0", "Content": "There lots of digital cameras on the market, many very similar in features and many with high prices.  The 2100 'UZI' stands out amongst them.  No it doesn't have the biggest number in megapixels, but it DOES have a true 10X OPTICAL zoom, and add to that image stabilization to improve image sharpness of telephoto handheld shots, along with many, many adjustment features including an ELECTRONIC viewfinder that show the same TTL image and setting data as the large LCD display and you have a wonderful tool for digital photography.I enjoy my 4mp Canon G2, but the 3X zoom is a bit lacking in many settings outside the home.  The Olympus 2100 is much more able to get the picture when you are outside and need to get close to the action but can't physically move closer.Try it, you will like it.", "Date": "May 24, 2002"}, {"Title": "The one that rocks...", "Author": "R Lopez", "ReviewID": "R1RNSAQC591ZEK", "Overall": "5.0", "Content": "I do a lot of homework, and I agonized over this one for almost a year, pestering camera shop owners and trekking the Web.  After being a hobbyist manual SLR user for many, many moons, I took my first digital images in Seattle with an entry-level digicam, and loved it.  I then made a commitment toward it, which meant research and saving bucks.  My quandry was, do I go for 3+ megapixels with 3-5x optical zoom, or 2+ megapixels with 10x zoom?  I do agree with the idea that more megapixels would give me better 11x14, but I NEVER print images larger than 8x10.  I use my Pentax for those.  Photography is my passion, not my profession.  After months of examining 8x10 images from our film cameras, and comparing them under extreme magnification with 8x10 digital imaging, my mind was made up, and went with my first choice, the Olympus C-2100.  I was not disappointed.  In fact, I am thrilled.  My decision was partly due to reading in several magazine how some medium-format professionals use this model as their test camera.  Armed with their included rechargeables, I took photos in the back yard, Waikiki, flower nurseries, and scenics.  Took more, gave up counting, downloaded, and the original batteries are STILL going.  Alkalines melt like butter in a hot pan.  Due to the 2.1 mp CCD, write time to the Smartmedia card is astonishingly fast.  By the way, get the 64mb or 128mb.  Using the included 8 mb card is almost funny.  This baby caters to SLR lovers.  It almost cradles in your hands.  If you want tiny, if you want something to stick in your pocket or purse, look at the C-700.  The neckstrap for the 2100 balances the camera so that the main feature, the massive lens barrel housing, doesn't drop over (cool).  Oh, speaking about the lens...I found n-o-t-h-i-n-g that even comes CLOSE to this lens on a camera this small and in this price range.  To have an aspherical 10x optical (38-380 mm, 35mm comp.) with LENS STABILIZER opens up enormous opportunities formerly lost.  I can actually gamble and take shots without fear of bad images, even hand-held, artificial-light street scenes at 9 pm!  Throw the bad ones out...no film to develop.  If that weren't enough, the camera's menu has so many options to keep anyone happy.  Programmed mode, aperture or shutter preferred, scene-program, and MANUAL.  The sepia and black and white mode will take you on nostalgic trips.  Downloading for me is fast via their software, and Adobe Photodeluxe fixes even some b-a-d images.  You might want to invest in RW CDs for the tons of pictures you might be taking.  This equipment is THAT good.", "Date": "January 2, 2002"}, {"Title": "Astounding bargain!", "Author": "J. Sanford", "ReviewID": "R1KXDQGUFHDTKM", "Overall": "5.0", "Content": "OK, let's deal with the cons first. That big lens really sticks out and this is not a camera you can stick in your pocket. Now for the pros, which is just about everything else. It is the lens that frosts this very substantial cake. 10X is just awesome to have and the 35MM equivelant is 38 - 380 MM. The near perfect range. Now don't confuse this lens with the more compact C700UZ. This is a MUCH better lens and I have yet to see any sign of purple fringing common to the C700 and some others. Image quality is way up there and approaches that of the professional SLR models like the Nikon D1H. It is a 2 megapixel camera which is more than I needed for computer viewing, but the prints are excellent as well. 8X10's are as good as some 3 megapixel models. Frankly, I think megapixel count is overrated as a decision maker anyway. This camera has just about any feature you might want and some you would probably never think of or use. It's good to know they are there if you want them. Best of all, as of early December, 2001, this camera can be found selling for Less than the C700! If you can live with the big lens, and it is well worth doing so, and are content with 8X10 print size, then check this camera out in some detail. You wont be sorry!", "Date": "December 3, 2001"}, {"Title": "Be very careful w/ dead pixels", "Author": "K. Lo", "ReviewID": "RLZYQ5DH5J06L", "Overall": "4.0", "Content": "fellow shoppers. Please be very careful and test the camera relentlessly as soon as you get it. But it is a great camera nonetheless:i)Can't beat the 10X OPTICAL zoom.ii)The menus are user-friendly.iii)Flash is fast and responsiveiv)Sequential mode is shot accurately and as expectly", "Date": "October 16, 2001"}, {"Title": "Love it", "Author": "J. W. Ley \"JW\"", "ReviewID": "R2FB9D2AF00ZE5", "Overall": "5.0", "Content": "Just got it 5 days ago, and I have very few wishes not acomplished: more resolution (3Mpix would be nicer), a hotshoe for the external flash, interchangeable lenses and under $... price.  I have used SLRs for 20 years and this is great, the quality of the prints is amazing, even without using the flash indoors or low light conditions in witch a film camera would be useless, and this way you get to know that you DID got the picture. I'm using an HP SmartPhoto 1215 to print (it includes it's own SmartMedia card reader, wow!) and I'm extremely satisfied with the overall quality.", "Date": "June 4, 2001"}, {"Title": "Thirteen years with my C2100", "Author": "jrengelhardt", "ReviewID": "R3CTPYXM769IKJ", "Overall": "5.0", "Content": "I have owned my Olympus C2100 for over 13 years.  It the first digital camera I have purchased.  Before buying I compared it with Sony, Nikon, and Canon.  I had never heard of Olympus until I saw this camera at Wal Mart.  I was looking for a camera that I could use up close to take photos of jewelry that I hand make.  I was looking for a camera that I could focus up close to show off fine detail.  According to the information I had read the C2100 can focus in 10 power as close as 3 inches from the subject.  The C2100 was the only camera at the time in that price range that had that capability.  The only problem that I found is that with SHQ setting you do start seeing individual pixel points if you try to expand the picture too great.  However for showing on a 25 inch TV monitor it still shows a very sharp picture, more than what I would need to show off my jewelry.  The camera is very easy to handle, and I seldom use a tripod.  I have taken photos using the full 10 power zoom and can usually steady myself against a pole or car top and get a great shot.  With a set of freshly charged batteries I can shoot most of the day before have to change batteries.  I usually carry an extra set of batteries with me so I can go a full day and fill up a 128 meg card without a battery change.  The biggest problem is finding new memory cards for the camera.  It uses Smart Memory cards, and the largest available it 128 meg.  Because Smart Memory is no longer the medium of choice for cameras of memory the cards are difficult to obtain.  Also the cards will bend and break if you don't handle them properly.  That has not been a problem for me and I have used the same cards since I first purchased the camera.  The camera originally came with an 8 meg card.  I immediately pruchased two 32 meg cards with the camera and also a 128 meg card that I found at Wal Mart.  That gives me enough to last a couple days before uploading to me computer.  I currently own two more digital camera's, a Olymput E VOlt 410 SLR, and a Pentax Kx SLR.  If I want to get up close and personal with a flower or a small bug I use the C2100.  The lense on the C2100 is just about the finest I have used.John R. Engelhardt", "Date": "August 19, 2010"}, {"Title": "Incredible camera", "Author": "Charles Reid", "ReviewID": "R2BHNY7K2106DE", "Overall": "5.0", "Content": "I now use an Oly E-500 dSLR. I have more money in filters and toys for my slr than the original C2100 cost me. And i'll admit there are times im still tempted to break out the c2100. This camera will do everything from ultra closeup macro's to extreme handheld zoom out of the box. Toss in a few filters et al and you have an entire system. The lens quality is just plain excellent and the image stabilisation makes it possible to shoot at max aperture with addons (i rigged a 2x video camera converter to it). With the rigged up 2x i was getting 1000mm. Handheld. My dslr wont do that. Period.The 2 megapixels is a drawback but 2mp is plenty for a 4x6 and acceptable for 8x10's with a very good printer (I use the hp8750 and the canon ip6700d). If they had come out with a 5mp version of this within a year or two of my purchase id probably be using it instead of my slr. The camera is that good. But oly decided to put out a cheaper knockoff consumer camera next. You will not go wrong with this camera. The secret is in the lens and you simply arent going to find a fixed lens camera with a better lens period (ask a professonal photographer he'll tell you the lens is the whole ball game). I'll admit suprise at it still being priced at 150 for a 2mp camera. But thinking about it , it is a more capable camera at 2mp than most of the consumer p&s;'s are at 10mp.", "Date": "September 15, 2007"}, {"Title": "My C-2100 - Great Camera!", "Author": null, "ReviewID": "R3FDQQXL5JR4GC", "Overall": "5.0", "Content": "Wow, my first digital camera and I was able to get this. I don't like the reset of the off/on switch. But I just live with the default settings and get awesome results.I bought it about two years ago when they were discounted at $499. Has seen a lot of use, still works perfect. I've tried side by side comparisins to my Nikon 4004, I miss having a super wide lens, but for pratical purposes the C-2100 blows away the film camera.The only negative is the time lag for taking the picture compared to film.Good work Olympus.-Lew", "Date": "December 6, 2003"}, {"Title": "Portrait Shooting", "Author": "Gerald Stauffer", "ReviewID": "R2SOHSYXARNREL", "Overall": "5.0", "Content": "I have owned an Olympus digital C2100UZ for about 18 months. It is without a doubt the best camera I have ever used. It has traveled with me to many parts of the world.The best feature is the 10X optical zoom. I like taking photos of poeple and especially portrait photos. With the above camera it is possible for me to stand accross a room and take many portrait photos. Recently in Southern Africa I was taking portrait photos of lions and other wild animals.It is a great all-around camera and does everything an amature photographer, like me, can expect.", "Date": "February 6, 2003"}, {"Title": "Great all around camera!", "Author": "Erik Andersen", "ReviewID": "R2PPPZ25ZPQZTJ", "Overall": "4.0", "Content": "... It takes excellent pictures altough if you're looking for speed this camera isn't it. If you're looking for great pictures with an awesome zoom this camera is it! Great for the beginner in digital photography like me!", "Date": "April 18, 2002"}, {"Title": "Buy it!", "Author": "James Reese", "ReviewID": "R3G9W9ZR9L2FEC", "Overall": "5.0", "Content": "As a rule the digital cameras fall in price, this one has gone up.  I have been looking to buy this one since it first appeared 1 or 2 years ago, finally found one that was reconditioned.  This camera is good for all, beginner, etc.check out the other 47 reviews if you do not believe me.", "Date": "March 23, 2002"}, {"Title": "Simply a Pro-camera", "Author": "Ken Parks \"viswizard\"", "ReviewID": "R1RHWUOA7IDJXK", "Overall": "5.0", "Content": "Based on the reviews, I was convinced to replace my Mamiya 645 and OM-2 with the Olympus C2100 UZ.  The features are aimed at the professional and/or serious amatuer photographer.  Althought the fastest shutter speed is 1/800 sec., this is still fast enough for action and sports photography.  I can remember when most 35mm cameras max'd out at 1/500 sec. with good results...", "Date": "December 13, 2001"}, {"Title": "Wonderful Camera", "Author": "Trisha R \"trisha@westfield-ma.com\"", "ReviewID": "RSOJQ807V0UAE", "Overall": "5.0", "Content": "After spending nearly a month going through reviews of digital cameras and comparing models both online and in stores, I settled on the Olympus C-2100. This is a superb digital camera in every way. If you are a beginner and want the ease of just point and shoot, you can have it with this camera. Or, if you are more of a pro photographer and want the ability to adjust settings, you can have it too. Olympus is known for excellent quality and they haven't failed with the 2100!", "Date": "July 20, 2002"}, {"Title": "Best bang for buck!", "Author": "Cam", "ReviewID": "RA8OCWXP0LDJS", "Overall": "5.0", "Content": "This is simply an amazing camera.  Right out of the box I was able to take superb photos on auto mode.  The more I use it, the more I learn to use the advanced/manual features.One caution, however, is that the connection software does not work so well with WindowsXP.  It does allow downloading on pics, but not a lot else.  That's all I need, however, so it's not a problem for me.", "Date": "February 28, 2002"}, {"Title": "great for infrared", "Author": "Michelle M. Ress \"safoocat\"", "ReviewID": "RZ6JXW0BVARVR", "Overall": "4.0", "Content": "This is a good camera for infrared photography.Just get yourself a 49mm infrared or red filter and have at it.About the only thing I didn't care for was the reset option on the onoff switch, don't know why they did that. Nice glass, real nice.", "Date": "February 13, 2009"}, {"Title": "Brings back great memories", "Author": "AcornMan", "ReviewID": "R10NB86QR8CW3Z", "Overall": "5.0", "Content": "The Olympus C-2100 was my first digital camera, and boy was it fantastic. I eventually sold it and \"upgraded\" to a camera with higher megapixels because, as great as the C-2100 is, 2.1 megapixels is paltry these days. But even the newer cameras I've tried pale in comparison to the C-2100's ability to take pictures in low-light situations. I captured absolutely stunning photos of sunsets and extremely low-light scenes at night by the fireplace with no lights on. I've never even come close to getting pictures like that with my newer cameras. I'm actually thinking about buying a used C-2100 so I have that capability again. They're dirt cheap now compared to when they were introduced many years ago, so if you get a chance to buy one, I guarantee you will not be disappointed. It's a real shame that Olympus never followed up by releasing the same camera with higher megapixels, because I certainly would have bought it, and I'm sure a lot of other people would have as well. I'll never understand why this camera went out of production and why Olympus essentially walked away from a segment of the market that it completely dominated.", "Date": "June 4, 2007"}, {"Title": "The BEST 2.1 mp camera on the market !", "Author": "\"brukar\"", "ReviewID": "R2CJC055M0LB6W", "Overall": "5.0", "Content": "Whether you are a beginner or an expert it is tough to beat the ease of use and the quality of this camera. I've owned mine for a little over a year and it still impresses me. Yes, the camera is bulky as others have mentioned and yes, the body is plastic (could you imagine the weight if it had a metal body?) but everyone that sees the camera falls in love....especially when they see the photo that it has just taken. I have photos posted on pcphotoreview.com for anyone that wants to see what the camera can do.", "Date": "October 18, 2002"}, {"Title": "Great camera. Ignore the review by Della L Dunning", "Author": null, "ReviewID": "R1YYPNCEGYB260", "Overall": "5.0", "Content": "This a great camera. I've taken thousands of pics and downloaded them to a PC just fine without any additional accessories. But I do reccomend an additional set of batteries. But you'd want an extra set anyway in case you run out of juice during a shoot. And it comes with a charger.", "Date": "May 26, 2001"}, {"Title": "Great pictures, great features", "Author": "GeekBoyWonder", "ReviewID": "R3JT1TW2YJZQTR", "Overall": "5.0", "Content": "The only negatives that I have found are heavy battery consumption and the old memory card.The picture quality is terrific, and it is obvious that this is a camera designed for SLR enthusiasts- all kinds of control, or just set it all on auto and fire away.The image stabilization makes the 10x zoom useful, and the video mode was an unexpected bonus.If you have to have the next best thing, this is not it.  If you love having top of the line N-1 technology, you'd be hard pressed to beat this camera for the money.", "Date": "May 8, 2007"}, {"Title": "Amazing Camera!", "Author": "Olympusowner", "ReviewID": "R3P05EA7VJEGP5", "Overall": "5.0", "Content": "I have had the Olympus C-2100 UZ for more than a year and a half.Its exceptional qualities are alrady mentioned by other reviewers. I would emphasize that most of the available digital cameras have 2 issues:1. Blurry pictures when shot indoorsThe C-2100, due to its Image stabilization can take pics at a lower light level (without using the flash) than others.2. Slow focus and focus-to-shot-taken timesAgain, this camera has a large buffer space and its focusing is fairly fast. It is more than adequate for me.The 10x zoom allows pictures which cannot be taken by a 3x or a 4x zoom (which most cameras have nowadays).If a 2 megapixel camera is able to take reasonably good color/resolution pics (like the c-2100), having another camera with more (3, 4, 5 +) megapixels will not necessarily mean it will take better pics. Probably slower to take the next pic.If you can find it (probably sold new in Japan), buy it!!", "Date": "July 7, 2003"}, {"Title": "a great camera", "Author": null, "ReviewID": "RFP5RO3G1M7EE", "Overall": "5.0", "Content": "My first digital camera and i love it. Everything worked immediately. Directions good and completely compatible with my iMac. Zoom is amazing and pictures are extremely sharp. Great 8x10 prints. I also bought the 128 media card and I can take 200 or so pictures. I use rechargeable batteries and always have an extra charged set ready.", "Date": "January 7, 2003"}, {"Title": "My second review of this camera!", "Author": "J. Sanford", "ReviewID": "R1DQITWVZVV8DP", "Overall": "5.0", "Content": "I have had the C2100 for about a year and a half now. I loved it when I first got it and still love it today. I have taken THOUSANDS of pictures and carried it for thousands of miles under all kinds of conditions including being dropped twice. I have had exactly zero problems! A solid five and a half stars!!", "Date": "September 25, 2002"}, {"Title": "Wow", "Author": "Dennis Brake", "ReviewID": "R1X19ZVP7844IC", "Overall": "5.0", "Content": "The title says is all I'm too busy taking great pictures to elaborate.", "Date": "April 19, 2002"}, {"Title": "I love this camera for only $60 !", "Author": "Matt Halpain", "ReviewID": "R145G6VGG5XQLP", "Overall": "5.0", "Content": "The zoom is excellent.  The c-2100uz takes excellent photos in low light and night time with out the flash.  The flash on the c-2100uz works great, lots of light produced.  The c-2100uz used batteries up fast.  So I recommend getting rechargable NiMH batteries.  The c-2100 uses 4 AA batteries.  I recommend getting a older memory card reader to read the memory card for the c-2100uz.  Hooking up the c-2100uz directly to the computer only works in windows XP and with the official olympus c-2100uz software.  You don't want to try hooking up the camera directly to the computer to get the photos as it will break the camera if the batteries run out while hooked up.  The c-2100uz is only 2mp.  But the photos look great on my 1080p monitor.  The c-2100uz does not take good moving action shots, as the photos are most often blurry from motion.  The c-2100uz takes excellent macro shots.  I love taking macro shots of flowers with my c-2100uz.  The memory cards are expensive and hold very little photos storage as compared to today's SD cards.", "Date": "March 9, 2014"}, {"Title": "In many ways it overcomes Nikon5700", "Author": "\"paulovilla\"", "ReviewID": "R113VPUZX6L1NB", "Overall": "5.0", "Content": "I own 3 digital cameras.A Minolta S404, a Nikon 5700, and the one I love the most: a Olympus 2100.  The absolutely magnificient lenses of this camera overcomes in many ways all the possible quality of image the more capable sensors of the other cameras could offer.It's always interesting to note that most people taking digital pictures(including myself)rarely print their pictures in sizes bigger than 8\"x10\".", "Date": "December 1, 2003"}, {"Title": "Get one if you can!", "Author": null, "ReviewID": "R13TBM39WINRB6", "Overall": "5.0", "Content": "I had to hunt to find this camera because it apparently is being discontinued.  If this is true, it's a real shame because it's the most exciting camera I've run across in 20+ years of being a fairly serious photography enthusiast.I decided to try the camera after a friend raved about using one on a recent trip to Europe.  The extreme range of the zoom lens made it very versatile, and the image stablization feature enabled her to take it into a variety of settings where tripods were not allowed and she came away with beautiful, handheld shots.After a couple of weeks of shooting with my new camera I've found it to be everything she said it was.  It's versatile, light, sturdy enough for serious use, and it takes WONDERFUL pictures.  The controls are very intuitive. You have all the control of shutter speed, aperture, and focus options of a manual camera but with the added benefit of several automatic modes.  I'm not so fond of the menu-oriented approach to giving you these options, but I think with practice this won't seem so cumbersome.  I'd have preferred a shorter focal length on the wide angle side, but just love the long zoom.  I photograph everything from birds to plants, so coupling the long lens with macro capability is much appreciated.I suspect that many people would shy away from this camera because of the 2.1 megapixel rating.  I use a Photoshop add-on called Genuine Fractals that enables me to do rather extreme blow-ups without degraded image quality, and would highly recommend this approach to anyone who thinks the pixel rating of this camera might be an issue.  So far, I haven't even bothered using the camera's highest resolution setting, and I've been very pleased with the results.  (This is a real surprise to me because Kodachrome 25 is my preferred film for 35 mm--again, the image quality from this cameria is amazing.  And, I can't believe I'm getting these results without my trusty tripod!)If you can find one, give it a trial.  It really is an amazing camera for the money.", "Date": "January 14, 2002"}, {"Title": "Best digital I've owned yet", "Author": "Ragnar Danneskjöld", "ReviewID": "R2IBH5I072DQCI", "Overall": "5.0", "Content": "This replaced a Sony Cybershot, an Agfa ePhoto, and a Panasonic Superdisk camera.  The best camera I've owned yet with it's optical zoom.The memory door can be a little hard to open, so I have to carry a quarter with me, but with a 128 Mb card that's not often.", "Date": "November 1, 2002"}, {"Title": "GREAT CAMERA FOR THE PRICE I PAID", "Author": "scott b.", "ReviewID": "R2QX92QRDJMS7T", "Overall": "4.0", "Content": "I just got the C-2100 a few weeks ago and I love it so far. It has the best quality and features for the price. I'm still learning all of the functions it has to offer.  I've had the camera for a few months now and I don't like that you can't get very good low light action shots.  Example indoor sports arena for a childs birthday party.  The falsh isn't powerful enough to go morethan 10 ft.  I love the camera for outdoor shots.  The other problem I have is the time it takes between shots.", "Date": "October 19, 2001"}, {"Title": "Absolutely what I was looking for", "Author": "Lili Guralnik \"Lili Guralnik\"", "ReviewID": "RBO5P3M14DI1K", "Overall": "5.0", "Content": "I chose this camera choosing between pixels vs lens.I preferred less pixels in view of the reviews I read regarding the lens and I made the right decision.Pictures are great enough but the 10x zoom is remarkable!Don't miss it!", "Date": "November 2, 2001"}, {"Title": "Olympus C 2100", "Author": "David Zuflacht", "ReviewID": "R1QYQJGVXZJLGW", "Overall": "5.0", "Content": "I am a novice photographer but this camera is far and away the best camera I have ever owned.", "Date": "May 29, 2001"}, {"Title": "What is not in the package that was advertised on the review", "Author": "Della L Dunning", "ReviewID": "R2N07203M2EATH", "Overall": "3.0", "Content": "The camera is great until you try to download your pictures.  You better have your batteries charged up, because there is not a AC power cord included in your Olympus Camera Box.  And you will also need to buy additional supplies if you want it to download your pictures to your PC.  Such as a USB reader with cartridges which will be another ...($$$).  I wish I had been informed of these small details before I purchased online.  I tried and tried to download the said pictures only to find I needed more hardware than was included in the package.", "Date": "May 19, 2001"}, {"Title": "Great features, very poor images", "Author": "kent D. Kieswetter", "ReviewID": "R5MPE5KDKB61H", "Overall": "2.0", "Content": "I have owned, and returned 2 of these cameras, and I prefer Olympus.  The features, from 10X OPTICAL zoom, to noise reduction for open shutter exposures, are terrific.  Two bad the images recorded are unuseable.", "Date": "May 11, 2002"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00004Y2MM"}}