{"Reviews": [{"Title": "Simply does the job!", "Author": "Blake McJunkin", "ReviewID": "R3CTXZJMLK0ZA6", "Overall": "5.0", "Content": "This contact works great for my home garage door.  It works like any magnetic electrical contact except it has a much greater tolerance on spacing.  The magnet supplied will close the contact from over 2 inches away.  This makes up for any variations in the door position.  I opted to mount mine at the top of my garage door rather than the floor and it works great.", "Date": "October 24, 2012"}, {"Title": "Works well with DSC PC1864", "Author": "Doug Deep", "ReviewID": "R2ETIMN2DD4A8P", "Overall": "4.0", "Content": "I set this up with my DSC PC1864, NC wiring, no EOL resistors. Works well enough. It does as it says and works with a few inch gap. I too put this at the top of my garage door instead of the bottom.", "Date": "March 11, 2013"}, {"Title": "Hi quality", "Author": "B. Jenkins", "ReviewID": "RNITLQQOT1YJX", "Overall": "5.0", "Content": "I used this as a normally closed switch, mounted in-line with my garage door circuit to keep the door from opening whenever the attic pull down ladder is open.  This is a very rugged switch and offers a wider range than a smaller reed switch.  I figure I was on borrowed time before one of the kids pressed the opener button while I had the ladder down!", "Date": "November 18, 2013"}, {"Title": "Works great with garage door", "Author": "Brent R. Blackburn \"WYY551\"", "ReviewID": "R22HCVUQVW40UG", "Overall": "5.0", "Content": "Works great with garage door and is cheap/easy way to know if the door is closed or not.  I use this over a Total COnnect 2.0 service on my iphone to make sure no contact points are open while I'm away.", "Date": "October 12, 2013"}, {"Title": "perfect", "Author": "RUSSELL D BRANTLEY", "ReviewID": "R18VYJB5DPZ0F2", "Overall": "5.0", "Content": "Outstanding just what I needed does everything I need it to do. Arrived quick and on time the best service many thanks.", "Date": "October 6, 2013"}, {"Title": "Adding Garage Doors to Alarm System", "Author": "Onfus", "ReviewID": "R3H8NUEMLN76VI", "Overall": "5.0", "Content": "I wanted to have an indicator inside the house that would tell me if the garage doors are closed.  They sell items specifically for that that mount to the door and transmit to an unit plugged somewhere inside the house.  But I did not want to have yet another gadget.  So I hooked two of these to my alarm system  and now not only I know if there is a garage door open, I know which one (I have an alpha-numeric display).  Also now my garage is protected by the security system all these for less than half  the cost of the single stand-alone  garage door monitor.", "Date": "May 20, 2013"}, {"Title": "Works as expected", "Author": "Stephen Sanislo Jr. \"Steve Two\"", "ReviewID": "RNQZ0ZKSSY8VU", "Overall": "4.0", "Content": "I took a star off because the 'Honeywell' name is prominently molded into the metal case. For independent installers, Honeywell is both a supplier and a competitor. It doesn't make sense to promote your competitor inside of your customer's home or business.", "Date": "May 14, 2013"}], "ProductInfo": {"Price": "$17.26", "Features": "Can be added to a wireless home security system with video surveillance cameras and more\nAdjustable magnet with L bracket for fast installation 24 in.\n24 in. Armored cable is standard Standard gap -- 2-3/8 in.\nEpoxy sealed for protection from moisture and impact.\nRugged Shock Absorber design protects reed against flex or damage to housing.", "Name": "Honeywell Ademco 958 Overhead Door Contacts", "ImgURL": "http://ecx.images-amazon.com/images/I/41473Y583CL._SY300_.jpg", "ProductID": "B0006M1I1W"}}