{"Reviews": [{"Title": "Excellent video webcam", "Author": "Nathaniel Gildersleeve \"Nat\"", "ReviewID": "R5RFKR308M9HA", "Overall": "5.0", "Content": "I looked for a long time for a remote camera to keep an eye on a vacation residence.  Reviews of other similar cameras like the Toshiba IK-WB11A were spotty at best especially when using in wireless mode.  Panasonic cameras seemed to get good reliability reviews, so when an outdoor wireless-G came out I decided to give it a try.  I had some difficulty getting the ports forwarded through my router.  The directions are pretty sparse when it comes to setting up your router.  I guess there is a fair variability in how each different router is set up.  Once that problem was solved it has been rock solid.  In the 4 months I have had it running, I only had to reset it once, after a 3 day power failure.  Actually, I think it was the router, not the camera that needed to be reset, but I reset everything.  It does everything it is advertised to do although I don't use the audio feature.  The motion detection feature works better than other webcam security software that I have tried.Addendum:I have now had this installed over 4 years and it continues to function as good as the day I bought it. As it is in a vacation home and I am frequently gone, I have had some problems with loss access via the internet.  It appears that this is secondary to flaky DSL router.  I finally purchased a simple timer at the hardware store.  It turns off the router every night at midnight and then turns it back on a minute later, effectively resetting the router each day. Since then no problems. It doesn't require a computer to be running so both the router and the camera boot back up following a power failure.", "Date": "February 19, 2006"}, {"Title": "Worth it", "Author": "Archer Koch", "ReviewID": "R27APQMGG36D2M", "Overall": "4.0", "Content": "I've used this camera for the better part of a year now. I've used it in a variety of locations and conditions. It's presently mounted outdoors and transmitting wirelessly to a router sitting indoors 340' away. I use dynamic DNS to access the camera remotely via DSL. The framerate is decent, but still-picture quality (clarity) could definitely be better -- especially when the subject is moving. The motion detection is good and triggers reliably to upload images to an FTP site. The camera is very configurable, but best-suited for the tech-savvy. Plus, it's evident that a lot of the instructions written into the camera firmware were done by a non-native English-speaking individual. I've successfully viewed the camera remotely via my Motorola Q. Sound quality from the camera is very good. I can hear the frogs chirping in a nearby riverbed right now.For what it's worth, I also own a very expensive Axis camera. The bottom line is that, although this camera has room for improvement, it still comes pretty close to justifying its cost.", "Date": "February 14, 2008"}, {"Title": "Bad Quality Camera", "Author": "W. Wong \"mikmuck\"", "ReviewID": "R2UY2WY8D8XRGD", "Overall": "1.0", "Content": "I am extremely unhappy with this camera.  On the surface, the camera looks great--it offers SD recording, wireless connectivity, and remote management.  But this is a really poorly made camera with poor supporting software.  Firstly, it took me 3 nights trying to set this up--and I'm a long time techie.  I followed the directions EXACTLY... got wired connection working fine... but the wireless was terrible.  The camera kept telling me it wouldn't connect, even though I had all the settings correct.  I even reset my wireless router to setup the most basic wireless LAN, and it still didn't work.  Then all of a sudden, for no apparent reason it worked.  Garbage.  I still don't know why it worked.The remote management was interesting and I like the fact that it let me control and move the camera remotely.  It also lets you setup specific times to allow \"triggers\"... but the trigger software is spotty.  The sensitivity controls for when the triggers set off didn't work well at all and it basically capture everything or nothing.  Axis has much better event management software.Finally, the picture quality is TERRIBLE.  It claims that it can record up to VGA at 12 frames/sec, but it doesn't even COME close to that... at VGA it records maybe 1 or 2 frames/sec at best.  Even at that quality there are noticeable artifacts and blurriness.  I researched all the other cameras at this price level and amazingly this seemed that it had the best specs, but I suppose there's no subsitution for first hand experience.  This is a terrible camera... I ended up buying the Axis 207w.  It doesn't have movement capabilities, but for half the price, it's picture quality is 2x better and setup was a breeze.", "Date": "February 9, 2007"}, {"Title": "Software Has Problems", "Author": "A. Conti", "ReviewID": "RAOOA3XCP2VDQ", "Overall": "3.0", "Content": "I purchased this camera because I didn't want to run Ethernet cable to my router. If this is not a problem for you, I would recommend you check out the BB-HCM311A. Note that with the BB-HCM371A, you still have to run wire for power, which sort of defeats the wireless concept.Be warned that you still need an ethernet cable to plug into your router for set up.Speaking of setup, if you don't know your network settings, this camera will be a pain to setup. For example, if you don't know the IP to your DNS, you're in trouble. Fortunately for me, I managed to configure it successfully and I'm no system administrator.Physical installation was straight forward. I mounted my camera high and I was afraid I was going to drop it while threading it to the mount. Panasonic really should have come up with a safety system where you can tether the camera while you screw it in place.My biggest gripe is the web-based software. It's feature-rich, but I cannot capture images the way I like. For example, I cannot acquire a time lapse movie of an overnight shot. I either get the first few seconds or the last few seconds. If a prowler saunters into camera shot at 2:00AM, I wouldn't see him. There's also a bug when you play the time-lapse motion image. Once you play it once, you cannot play it again. :-(Also, downloaded images are in PCN form. What the heck kind of image format is that?Another gripe is that night vision isn't great. In this day and age, a camera like this should perform better in terms of night vision.", "Date": "August 20, 2008"}, {"Title": "Too PC-dependent and lacks WPA for wireless security", "Author": "C. Roberson", "ReviewID": "R3RCH7TO1W15IQ", "Overall": "2.0", "Content": "I just received this unit and have to state that I'm rather disappointed.  First, we are an all-Mac household with a SonicWall firewall but this unit is so heavily PC-dependent that it would not work out the box with either.Another reviewer said it would work with the Macintosh but I couldn't even see the unit in the ARP cache or the DHCP leases of the firewall.  The only way I could initially talk to the unit was to dig out an old PC and use the enclosed CD.  It would be nice if there was a switch that could be flipped manually to tell the camera to use DHCP instead of UPnP (which I don't find \"that universal\").The second thing that really surprised me was that this unit only supports WEP wireless security instead of WPA.  For all the talk about security in the documentation and in the setup tools, WEP is a very poor choice.  To use this unit wirelessly in my network, which is why I bought it, I will have to gut the security of the rest of my network.  This is a serious shortcoming, in my opinion, especially for such an expensive camera.Finally, I'm finding the Panasonic support site clumsy and limited in scope and utility.  This product has potential but it its shortcomings get in the way of its utility.  Until they add WPA, I can't recommend this unit.  If you're a Mac user, make sure you have access to a Windows machine to get it out of UPnP.  I think it defaults a 192.168.x.x. address.", "Date": "October 10, 2007"}, {"Title": "Excellent  high-quality outdoor web cam", "Author": "Daphne L.", "ReviewID": "R29JSHO5F0ORTG", "Overall": "5.0", "Content": "I had first purchased a couple of Panasonic BL-30C wireless web cams to keep an eye on a vacation house that is far away from us.  I wanted to put one outside too and decided to give this one a try against the weather.  It was a bit harder to set up than the BL-30c, but after a few trial and errors and some persistence, I managed to get this one going too.  The picture quality is very impressive and the audio is a nice optional feature! Very clear viewing in the daytime, and good night mode too.  It has been reliable, and I am very pleased I bought it.", "Date": "March 31, 2007"}, {"Title": "Beware: No WPA support", "Author": "N. Andersen", "ReviewID": "R2E8EC7PPSL8MB", "Overall": "1.0", "Content": "I find it appalling that a camera this expensive only supports the flawed WEP WiFi encryption protocol.It leads me to believe that it is an older model that hasn't been updated in a while.I returned mine.", "Date": "May 18, 2009"}, {"Title": "Best Wifi Web Server Camera Out There", "Author": "LaLoca \"ll\"", "ReviewID": "R1W4EKJLBLCPLS", "Overall": "5.0", "Content": "I purchased this camera to keep an eye on my house while away. So far it has delivered for over a year. Also has helped to finger those who don't pick up after their dogs!!!Setup was straight forward, until it came to the part of connecting over the WAN (for viewing from work). Don't know why anyone would think that WIRELESS means not having to run wires for power. Oh yeah, that guy who gave it 2 stars :)This camera is not for the meek if you to go through more than 1 router. You need to understand quite a bit about networking to get this to happen.All that said, customer support was excellent and they put me on the right track. I am going to buy another for the back and I tried to see if I could find something less expensive, but you give up a lot. So here's my list in order of importance: Pros: - Free DNS Account (this would cost you otherwise) - Totally browser based so can be viewed from iMac, PC or Linux box - Alarm I/O, which I use to trigger the camera to preset view area - On-board storage via SandDisc - email alerting - motion detection Cons: - Clumsy playback!!! when on frame 244/1000 and you hit play, it starts from 1.  Should be able to take a date and time and find the frame for you - No optical zoom. At 640x480, having 10x Digital Zoom just gives grainy video.  I'll take 2x optical zoom and give up 10x digital - Cannot zoom on a preset", "Date": "August 10, 2009"}, {"Title": "Excellent webcam", "Author": "John Schoeneck", "ReviewID": "R1HI41UY7O2VV9", "Overall": "5.0", "Content": "The BB-HCM371A is easy to setup if your router supports Universal Plug'n'Play (I'm using a late model Linksys 54G).  If you're using several other cameras in addition to this one, you may have do some manual configuration of the router ports.  Panasonic's setup instructions are adequate but clearly they've been translated from Japanese.  Picture quality is good for a camera in this price range.  Camera is best mounted out of direct sunlight... underneath a roof overhang is ideal.", "Date": "July 27, 2008"}, {"Title": "Not usable as \"outdoor wireless network camera\"", "Author": "J. Pisano", "ReviewID": "R1EKL75XE4L62X", "Overall": "2.0", "Content": "I purchased this camera to monitor the status of a home renovation project while I was not at the house. I mounted it on a tree about 30 feet from the house. At first the camera seemed to be working OK and I was able to keep tabs on how the project was coming along. The internet access from that distance was very touch and go and the camera often lost the signal. The web site is only available for viewing when the camera is connected to the internet. Now that the camera has been installed at the location for a couple months the internet connection is getting more and more sporadic. It may be because the walls of the house have gone up and are blocking the signal to the router. Whatever the reason, it is impossible to consider this camera a good option for use outdoors and wireless. When I log onto the website 99 times out of 100 I can' access it due to now internet connectivity. In hindsight I think I should have purchased an Ethernet cable to run between the router and the camera.Also, it is important to note that there is no JPEG save option for the timer images. It had been my original plan to save a JPEG every 15 minutes and create a stop motion video of the project's progress. It turns out that the timer images exist in a format that is exclusive to Panasonic and cannot be downloaded as JPEGs in bulk. My only option was to individually save the images the old fashioned way by right clicking and \"save image as\" any one that I wanted to include in my stop motion.The camera is affordable and durable (it has survived some pretty nasty rain storms this year) but not a great option if you want something wireless and outdoors. I'm sure that the camera would work just fine if it was inside the home.", "Date": "August 3, 2012"}, {"Title": "Needs night vision but works good, older model", "Author": "K. Halloran \"bridgenet\"", "ReviewID": "R3LQVHQ5XGHW0R", "Overall": "3.0", "Content": "Use this along with a BL-C230A to monitor my vacation home.  The camera web server operates slower than the BL-C230A so it is probably an older model.  They work fine together.  Can adjust the brightness and white balance, and panning is great.  Tried the Sharx SCNC3605 and returned it.  It was not able to adjust the brightness and white balance and numerous images would get washed out due to indirect sunlight.  Can't beat the panning option as I can see the entire front of the house.  Have it installed above the front door.  Not having night vision is poor but knew that when I bought it.  Does not work well in dim light either.  Have an outdoor light that runs on a timer for limited viewing.  If you can wait the Sharx unit is going to have panning and HD sometime next year which should make it a great camera but for now had to go with the BB-HCM371A.Edit:Just bought another one and no problems.  First camera has survived outdoor winters and still worked at -30F.  Now put one on the other side of the house, easy setup and love the panning.  There is some night vision by you need light.  Views very well at dusk or moonlit nights but once fully dark out there is no vision.", "Date": "November 14, 2010"}, {"Title": "Great camera for our sailboat", "Author": "KaneHau", "ReviewID": "RWS89YA7E8YLW", "Overall": "5.0", "Content": "I was looking for a camera we could put on our sailboat so we could watch the boat remotely.  I wanted it to be weatherproof and wireless.I own the other panasonic wireless models and while they work well, they don't have audio that works on Apple computers (no codex).I was very surprised when THIS camera's audio worked!  Not only that, but when I added my other cameras to the MULTI menu of THIS camera, their audio suddenly worked as well (that is because THIS camera has the codex in a little plugin that it installs when the webpage comes up - so as long as THIS cameras software is running, if you look at other cameras in MULTI mode they get to use the codex as well).Anyway - great camera, FANTASTIC color and good motion.  Good audio.  Works very well!", "Date": "October 13, 2009"}, {"Title": "Excellent Video webcam", "Author": "Earl Wilson", "ReviewID": "R3BMKWWXYWWJY1", "Overall": "5.0", "Content": "I have had this camera in place for over a year and it is working just as well as day one. Configuration is very easy as long as you know very basic IP schemes; images are very sharp during the day and better than expected in evening. Panasonic gives you access to a DNS server so you can see it from anywhere with no charge. The camera also will pan and tilt, features usually reserved for professional grade equipment. Last but not least the camera has audio so you can hear what is being said around the camera, great for watching and listening to the kids. Well worth the money for a home or a small business.", "Date": "March 3, 2011"}, {"Title": "Panasonic BB-HCM-371a", "Author": "DJ \"dej\"", "ReviewID": "R37CJ3MT6KWQIP", "Overall": "1.0", "Content": "I have owned two of these camera's and neither one ever worked properly.  The first once had a main board failure and the second one fails to boot up past the orange light blinbk and then goes solid.  This is probable the worst and most problematic camera for the money.  There are several others at half the price that are better.", "Date": "May 22, 2012"}, {"Title": "Pricey but does the job", "Author": "Jeremy Hogan", "ReviewID": "R20JJGYCGYH745", "Overall": "5.0", "Content": "I purchased this camera last week and was able to set it up without much difficulty.  Pros:1. Clear picture (slightly blurred around the edges, because of the bubble over the lens)2. Good hardware included for mounting - extra wire, putty, self bonding tape, extender for the arm3. Accessible through the viewnetcam.com website (free!)4. Decent setup software (although it seems to have been translated from Chinese or some other language)5. Solid build and nice looking, inconspicuous designCons:1. WEP security only - outdated2. Night vision is not great3. PriceyOverall this camera works well with my existing Panasonic netcam.  The negative reviews here are valid, but this is a quality product.", "Date": "March 12, 2012"}, {"Title": "Extremely Disappointed - Setup Difficult / Lacks WPA for Wireless", "Author": "CLIFFORD J WILLIAMS", "ReviewID": "R3QIMI9O6GFTU9", "Overall": "1.0", "Content": "I just unpacked this unit and spent about two hours configuring and hunting the internet for updated firmware. The unit does not easily configure, but more disappointing is that it lacks WPA for wireless security. The unit offers two choices - NO security or WEP. WEP is an outdated protocol that can be cracked in under 10 seconds. I would essentially have to gut my network's existing wireless security to roll back to WEP to support this unit, which makes zero sense. I own an AXIS wireless cam which is about 1/3rd of the price but which unfortunately is not a PTZ. Otherwise, it set up much easier than this one AND offers WPA and several other security protocols. I will send this one back and buy another AXIS cam.", "Date": "December 10, 2011"}, {"Title": "Not recommended due to poor security", "Author": "Bryan MacKinnon", "ReviewID": "R1861XTDN24MV8", "Overall": "1.0", "Content": "I agree with the other reviewers that the lack of wireless WPA security is inexcusable.  I wish I had known that before purchasing this unit.  I have two other indoor Panasonic cameras and they all have WPA so I did not even think to check if this one had it.I upgraded to the latest firmware released in 2010 and still no WPA security.For those who are not familiar with the limitations of the inadequate WEP security that this camera has, if you don't mind people breaking into your networks and stealing information, then you don't need to worry about it.", "Date": "March 4, 2011"}, {"Title": "Great camera - weak software", "Author": "walker", "ReviewID": "R3FKO17KW7Z82B", "Overall": "4.0", "Content": "I have two of the HCM371A Cameras- They are easy to set up. I have been disappointed with the software though. The specs 'suggest' that they have a zoom feature, but I have not been able to find it even with the firmware update. The ability to view the recorded data is poorly designed. if you want to view, you can only start from the beginning of the buffer and have to watch everything, even though you only want to see something in the middle. Also the the .pnc video format is not compatible with any players. You must download (good luck finding this) Panasonic's proprietary player (PC only) to see saved video.The cam has great functionality but Panasonic really needs to beef up the post record part of the software. Also with the PAN/TILT feature, why can't the cam follow detected movement?Panasonic drop me a line troutdoor@gmail.comTom", "Date": "January 4, 2011"}, {"Title": "See everything when you can't be there", "Author": "Kona_Kid", "ReviewID": "R10C5MUXJUJLL5", "Overall": "5.0", "Content": "This Panasonic outdoor camera is a great little product. It is used outside our condo and it has operated in temperatures of -5 without any issues. An attached SD card allows many photos to be saved on a chip and the zoom lens allows us to see things pretty close. The only issue is finding a powered outdoor speaker for use with two-way communications. Panasonic wasn't able to provide a vendor and we haven't been able to find one on our own. Except for this issue the camera works as advertised.", "Date": "November 3, 2008"}, {"Title": "Remote wireless video camera", "Author": "Kent R. Pipes \"Kent R. Pipes\"", "ReviewID": "R1M9BM8RCFA4FY", "Overall": "3.0", "Content": "This camera was hard to set up, ours still does not work properly, will have to be sending it back to Panasonic.  You'd better have a knowledgeable tech person available.", "Date": "July 17, 2011"}, {"Title": "Not as advertised", "Author": "Blaine D. Richardson", "ReviewID": "RBMPBGC0VQ85J", "Overall": "2.0", "Content": "Not as advertised!!!reviewing different models of Security cameras for the features that that I wanted. I though that I had found the right one with this camera. It is wireless at least to the network but still needs power running to it. It has a built in mic so you can hear what is going on, and it is water resistant.  Panasonic advertises this unit as having a built in motion sensor to trigger an alarm to cause it to send pictures over the network and track the movement. I could not get the camera track motion or to trip an alarm on motion. I contacted Panasonic, the agent informed me that it does not come with a built in motion sensor  but agreed that it was advertised to have on. He informed me that I would have to buy a separate sensor to activate the camera (set off the alarm feature), but that Panasonic did not have any products that would work. Panasonic offered to sell me a different model camera that would track and trigger an alarm with a built in sensor, but the price was more than I could buy the same camera for at a local store and the camera did not have the other major feature that I wanted and that was being made for the outdoors.  Bottom line, if you want a security camera for outdoors and that will work as an alarm,  Keep looking!!Panasonic has still not corrected their advertisment!", "Date": "November 20, 2009"}, {"Title": "Defective camera, lousy service", "Author": "Amazon Customer", "ReviewID": "R3675ROT9J3R52", "Overall": "1.0", "Content": "I already have two Panasonic BL-C30A cameras that work ok, though not perfectly (see below).  I purchased the BB-HCM371A for use outside the house.  However, when I connected it to my router I got a blinking red light.  According to the installation manual that indicates an internal malfunction.  Although it appeared that I got a defective product I decided to contact Panasonic service to see if I was missing something.  First, I sent an email and quickly got a typical reply, probably automated.  The reply was simply to connect the camera to the router exactly as described in the manual, which of course I had already done.  So then I called the 800 number.  The automated answering service was one of the worst I have ever encountered - asking me to describe the problem in normal language but then unable to understand what I was saying.  It was almost a parody of an automated answering service and I finally gave up in disgust without ever getting through to a real person.  I am returning the camera to Amazon for a refund.  I will definitely not purchanse this camera again and cannot recommend it.I have had better luck with my two BL-C30A cameras but it does have some annoying bugs.  For example, when accessing the camera over the internet it automatically recenters which can be quite aggravating if you want it pointing to the side.", "Date": "December 15, 2006"}, {"Title": "Not very impressive!!!", "Author": "Forrest S. Morris Jr.", "ReviewID": "R2KAZ5F8H2BGU6", "Overall": "2.0", "Content": "Purchased this Camera expecting it to operate as good or better the the much less expencive BL-C20A did.  The picture quality was sub-par for a camera that was 400 dollars more, I expected more.  The wireless set up was a ritual in frustration, reset the camera multiple times, repowered, downloaded the updates, packaged it up and am sending it back.I think for a camera that is 650 dollars, it should preform considerably better.The Weather Proofing and WiFi was why I purchased it, so I will look elsewhere for another product.", "Date": "August 9, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "Two-Way Voice Communication\nCCD Sensor for Enhanced Image Expression\nSD Memory Card Recording\nSimple Ethernet Connection - No PC Required\nOne Year Warranty", "Name": "Panasonic BB-HCM371A Outdoor Wireless Network Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41vf4-Aw%2B9L._SY300_.jpg", "ProductID": "B0009PD0ZI"}}