{"Reviews": [{"Title": "This digital camera lured me away from film", "Author": "Thomas Janowski \"tomj1963\"", "ReviewID": "R3SBI96PKJK6QZ", "Overall": "5.0", "Content": "I have been a film photographer for over 20 years.  I've exhibited on and off through the years and have always developed and printed my own black and white film and enlargements.  My old Minolta 35MM was getting really old and I was seriously thinking of buying a Nikon FM3 because I love manual control.  As the time to buy a new camera got closer, I began to notice the Fuji S3100 at a local store.While I have never liked the feel of plastic bodied cameras, at least this Fuji was substantial in size.  I hate tiny camera.  They might be great for sticking in a shirt pocket, but they seem too small to hold and use.So, one day I'm in the camera store and wow...the Fuji S3100 is on sale at an incredible price.  I buy it on impulse.I think because my expectations of digital photographer were so low, I was able to fall in love with this camera.  Like the other reviewer said, this may not be a camera for beginners.  While I expected to not understand digital photography in the same way I do understand manual film cameras, I have to admit this Fuji is easy for me to use.  I guess I should also say that I opened the box in my car and instantly lost the manual.  I was able to figure out everything I needed to know by scrolling through the numerous menus.  Though I have to admit it was a relief to find the manual when I cleaned my car.I just recently went to Toronto and the Fuji was the only camera I brought along.  I selected 7 pictures from the trip and had 8 x 10's printed.  I could not tell they were digital pictures.  They were as sharp and clear and colorful as I have come to expect from film.I have shot pictures in full auto and in manual.  Both produce equally great photos.All my friends have had digital cameras for a few years and I have seen prints and 8 x 10 enlargements taken with other cameras and I had never been impressed.The highest praise I can give this camera is that it is the camera that finally lured me away from using my film camera.", "Date": "November 29, 2004"}, {"Title": "A nice camera, but not for the beginner", "Author": "T. Tompkins", "ReviewID": "R3L5IPG8JZLRRC", "Overall": "4.0", "Content": "The Fuji FinePix S3100 is capable of taking pictures that look great, even enlarged to 8x10 size, when operated correctly; and therein lies the rub. The very things that add value to this camera unfortunately remove it from the list of those suitable for the beginner or those who need point and shoot convenience. The S3100 requires slightly under three seconds \"warmup\" with the included 16mb memory card before you can see your subject in the viewfinder. This delay appears to increase with a larger card installed and can be a hindrance in candid or spontaneous shots. The FinePix imitates an expensive SLR-type film camera where what you see in the viewfinder is actually what is coming through the lens, but displayed on an electronic screen inside. I found this to work well (and I wear eyeglasses), but one may also toggle the image to the 1.5 inch LCD monitor at the back of the camera with the push of a dedicated button. As with other cameras that feature automatic exposure and focus, the operator must push the shutter button part way down and wait for a confirmation that the adjustments have been made before pushing all the way down to take the picture. Failure to do this usually results in poor-looking photos which inevitably get blamed on the camera. Unfortunately, the image in the viewfinder/LCD freezes for a second or so during the adjustment procedure, meaning the position of a moving subject may have changed by the time you're ready to snap it. For this reason, the camera doesn't recommend itself to action photography. Autofocus is not foolproof on any camera that has it and under certain conditions I found the images I got weren't as sharp as they should have been. This subject is covered in the very complete and informative 100-page manual and as one gains experience it should be possible to forsee and work around those situations that confuse the autofocus. Beginners may find the pop-up flash confusing and forgetting to extend it in a dark setting will spoil the shot.There is a lot to like about this camera. Although certainly no lightweight mini you can slip into pocket or purse, it is comfortable to hold with well laid out controls. The 6x optical zoom, which was a big selling point for me, brings subjects about twice as close as most zoom cameras will, albeit at the expense of some of the wide angle capability. Two accessory conversion lenses are sold for this camera that enhance its optical capabilities, but are very expensive. The user may select from three sharpness levels and five picture quality/size settings. The included memory card will store eight pictures at the absolute highest quality, or double that number one step below. You may also select from four scene modes; for example, portrait and night. Red-eye reduction and slow synchro flash modes, as well as forced or suppressed flash may be chosen. Limited-quality AVI movie shooting without sound is possible and there is a macro mode for shots as close as a tad under four inches. For those advanced amateurs who like to tweak settings, limited manual adjustments of flash brightness, EV, white balance and aperture-priority are possible. Current settings, along with any cautions, are normally displayed around the perimeter of the viewfinder/LCD screen, but may be turned off.Several pages in the manual are devoted to discussing the rechargeable Ni-MH batteries consumers typically use in their camera. Over time, these apparently suffer from reduced life and the S3100 includes a discharge feature that may be used to (hopefully) restore their performance. The camera is supplied with four alkaline AA batteries and an optional AC power adaptor is available. In addition to the USB cable for downloading picture files, a cord is included for viewing the images through the video input of an ordinary television monitor, which I found to be a handy feature.Probably the best photo I've ever taken, a zoomed in close-up of a seagull on a piling, came out beautifully even without using a tripod. Another, of a mostly black cat, was somewhat fuzzy, owing to autofocus confusion because of the dark fur. A hand-held macro shot of a flower blossom looked fine, even though it was taken under low light conditions without a flash.For the money, I find the S3100 to be a good performer.", "Date": "September 19, 2004"}, {"Title": "An excellent camera to replace a 35mm SLR", "Author": "T.C.", "ReviewID": "RO4JU7R3GUE6Q", "Overall": "5.0", "Content": "My 35mm is 35 years old with multiple lenses and a mini suitcase to carry it all.  I was looking for the right digital camera to replace this old and cumbersome companion in my travels. I found it in the Fuji S3100 after having done my research homework and handling the camera in the store.Picture quality was the #1 requirement. My first test shots (in the auto mode) were downloaded to the PC and test printed as 3x5's at home. The quality was outstanding in all respects. My prior research did not disappoint. Coloration was perfect. Focus was perfect. Light balance was wonderful with the flash within its range. The pictures were velvety smooth to the point I couldn't stop looking at them. The WOW factor was evident in every shot.I heavily cropped one picture of my son from a full length view of him (6 feet) standing in our dinning room to a view of his chest and face. I printed a 5x7 of this shot and there was neither a hint of graininess nor any deterioration of quality.Optical zoom was the #2 requirement.  I like to capture all kinds of details in buildings and monuments, etc. when I travel.  The 6X optical zoom gets me close to what I want without the weight and bulkiness of my old telephoto lens.Comfortableness/Grip was the #3 requirement.  This camera fits my hand like a glove.  Its grip is perfect.  It is locked securely in the hand with fingers around its grip area - little or no chance this camera will ever slip out of guys' bulky hands. The shutter button can be hit with the index finger and the thumb can work the back of the camera without ever loosening the grip. The left hand can easily stabilize the camera as the shot is composed by holding beneath the lens hood with little chance of obscuring the lens or flash with fingers.A Manual mode was the #4 requirement.  After years with a totally manual 35mm SLR, I did want only a point and shoot digital. I wanted the ability to have some control.  I took one test shot of myself in an area well lit with fluorescent lighting, testing the use of the Self Timer and with the camera in Auto mode.  The camera warned that I needed flash, so I popped the flash, set the timer and ran into the camera's view.  In Playback mode I could tell from the LCD that my face was a bit light. I went into Manual mode and stepped down the intensity of the flash, retook the picture and liked the result.  With Manual mode, you can still be a bit of a photographer.I mentioned that I popped the flash after the camera warned me. I like the fact that the S3100 does not pop and auto fire the flash, even in Auto mode.  It gives you one more aspect of control in how shots are composed and one less electronic connection that can go bad.  My daughter owned a Cannon Rebel with an auto pop up flash that stopped popping, and the cost to repair was not worth it. It was cheaper to buy a dedicated flash for the hot shoe connection.Until I started working with the camera, I didn't know I would come to appreciate the electronic view finder as much as I do. When you look through this bright viewfinder you are looking at what the lens sees and exactly what the picture will look like. Because this view finder is so accurate and bright, displays the necessary information and is so comfortable to the eye to use, I use the liquid crystal display only for playback. One push of the dedicated button next to the LCD toggles between viewing by the LCD or view finder. Very nice and much less a draw on the batteries.Finally, the camera uses alkaline AA's or Nickel Metal Hydride rechargeables. Very cost effective.  I use the Hydrides and after one month of ownership and using the LCD heavily as I learned the camera, and then taking Christmas and New Year's shots, the batteries are still going strong.T.C.New Jersey", "Date": "January 21, 2005"}, {"Title": "Nice camera, but ...", "Author": "Joseph W. Keyes", "ReviewID": "R3RPNP690NDV8L", "Overall": "3.0", "Content": "I upgraded to this camera from a fixed-focus Olympus D-360L. Going from 1.3 to 4.0 megapixels was most definitely an improvement. I appreciate the zoom, macro, and animation features of this camera as well. The ergonomics are good, the fit and finish are very nice. I like the lens hood and cap that are included with the camera. In functionality, it approaches many of my old 35mms. Now for the \"buts\"The camera is maddingly slow to recharge the viewer. One reviewer suggested that it may be due to the size of the card. I did not find this to be the case. It is just that slow -- all of the time.The functionality of the menu selections is not as intuitive as I would have expected.Battery life (per charge, NiMH) is much less than I had expected. I always keep spare AA's in my pocket when attending an extended function or event.Finally, the \"travel kit\" offered with the camera is a waste of money. A charger and four NiMHs -- which can be purchased in any electronics store -- should be included with the camera, not part of a \"kit\" containg a silly array of superfulous gadgets.\"Buts\" notwithstanding, it is a good camera for the price. It's not for technophobes not for those looking for the simplest point-and-shoot options.", "Date": "June 1, 2005"}, {"Title": "One of the best values in digital cameras", "Author": "L. Uyeno", "ReviewID": "RXFVMGL9LVBSB", "Overall": "4.0", "Content": "I bought this camera a few months ago. I was actually thinking about buying a different camera and came across this one. I'm an old school photog and I use mostly 35mm pro and semi-pro equipment but wanted to get a decent digital at a good price.I didn't want a pocket digital camera. My sister has one and I feel it's *too* small. This camera isn't very bulky, but with the hand grip by the shutter button it fits the hand very well. In fact, I found myself instinctively holding like I would a film 35mm camera with my left hand cradling the lens. This helps steady the camera. Sometimes a light camera is harder to keep steady than a heavy camera. But, I found keeping it steady was not a problem.While it functions very well as a point and shoot camera the manual features is what sold me *after* I had bought it because I really didn't know all that much about it when I purchased it. So, finding about all the other features of this camera was a pleasant surprise!Being accustomed to full manual cameras I like at least some control over the operation of the camera. This little camera allows even some one like me some control over the image without it being so complicated that a rank amateur can't use it. The following are some of the features I like personally. I won't discuss the other features like megapixels.Electronic viewfinder. The first thing I really like is the EVF (electronic viewfinder).  On digital cameras most optical viewfinders are slightly off due to parallax error. The only optical VFs that show you truly what the lens sees are the professional SLR digital cameras. The S3100 acts like an SLR with the EVF. You truly get what you see. This is important when using the telephoto or macro settings on the lens. Also, it can be difficult to see the screen on the back of the camera in bright sun or if you're far-sighted (which I'm started to become *sigh*). Being able to use the EVF gives me a big image to compose with rather than stretching my arms out so I can focus my eyes on the screen. This was a huge selling point for me at least. Also, having the EVF allows you to see if your fingers are blocking the lens! This happened all the time with my grandfather's rangefinder camera...Manual Flash. I can also control the flash. Not just for the usual red-eye and such but the overall output too. This allows me to use fill flash outdoors to open up shadows without it being too bright and looking artificial. This combined with the slow flash feature allows me to shoot indoors and achieve a more natural look.Aperture-priority. This allows me to manually set the aperture of the camera to control depth of field or somewhat control the shutter speed for creative effect. A lot of cameras in this price range or higher don't have this feature.EV exposure control. This allows me to adjust the sensitivity of the camera's CCD which is normally equivalent to ISO 100 film speed on this camera (EV range is ISO64 - 250). This works well when I'm shooting outdoors and in the shade, but don't want to use flash to achieve a good exposure. Or, for backlit subjects where I don't want to use fill flash.Lens. The lens is very sharp. The 6x zoom range (39mm to 234mm 35mm camera equivalent) is very good for most shooting. It would be nice if it could zoom out a bit wider though...say to 35mm or even 28mm, but this is a minor complaint. The macro setting allowed me take great pics of my plants.Batteries. I love the fact that I don't have to buy proprietary batteries for this camera. It comes with 4 AA NiMH batteries but take alkaline and lithium AAs too. All rechargeable batteries have a finite lifespan. I know that if I'm on a trip and my NiMHs bite the dust I can go just about anywhere and buy more AA NiMH batteries...Best Buy, Target, even a home improvement store like OSH carries AA NiMHs. And if they're out of NiMHs I can buy a few Alkalines. You can't say that about a another camera's proprietary Lithium Ion battery! Even if you do find a Best Buy, Circuit City, or Radio Shack will they have your battery in stock?Well, there's more features but that's just a few I really like. The S3100 is an easy point and shoot camera in auto mode, but still allows some one like me who is used to manual film 35mm cameras some control and exactness over composition and exposure. When it comes time to upgrade Fujifilm's other S line cameras will definitely get a first look.", "Date": "October 30, 2005"}, {"Title": "Great for Action and Low Light", "Author": "T. Burns", "ReviewID": "R44K4MHQTGRVF", "Overall": "5.0", "Content": "I bought this camera for my sister to replace one that I broke (oops).  It does not have the zoom range that her other camera had, but the megapixels are higher.  I borrowed it one day (and she let me!) to see how it works.  It worked GREAT! I was in a high school gym taking pictures of my son's basketball game and the pictures were not too dark and came out pretty clear for the situation.  I have the next step up camera with a 10X zoom and 5MP and do not get as clear pictures in the same gym!I am very impressed and she is very happy.", "Date": "March 10, 2006"}, {"Title": "Great combination of features", "Author": "A. Thompson", "ReviewID": "R1IRIE7IEU0XXY", "Overall": "5.0", "Content": "I was looking for a new digital for my wife to take on a trip. It needed point and shoot simplicity, but I wanted it to have some advanced features for me. Also, we were on a budget. As 'last years model', this camera is the best deal out there in the $200 range. The 6x optical zoom gives it better effective resolution than the 4MP it's rated at(digital zoom use a useless measurement). The auto settings and autofocus works well. There are 4 'scene' settings for some control over exposure. The battery life (4 AA's) is excellent. One of the coolest features is the viewfinder: hit a button, and the LCD screen blanks (saving battery life). A smaller, but full featured screen lights up in the viewfinder, so you can see what your doing in bright daylight. The controls are easy to learn and well placed. It's big enough to feel good in my hand.Oh, and by the way, it takes great pictures.Cons: Although it has an aperture 'priority' setting (in manual mode), you can't control the shutter manually. It does has a night scene mode that gives priority to longer shutter speeds. You can't fine tune the 4 'scene' modes to suit a particular need. For example, you can adjust brightness of the flash in manual mode, but it won't carry over to other modes. So if you need full manual control, this camera isn't for you.But then, if my wife had to do all that, she'd never take a picture!", "Date": "August 22, 2005"}, {"Title": "So close to a perfect 5 stars....", "Author": "tina", "ReviewID": "R1F0PB4T0K8COM", "Overall": "4.0", "Content": "I have had this camera for 5 months now, and I love it.The things I love:1. The clarity of the pictures is awesome. The colors are so vibrant.2. The camera is very flexible with some manual settings, yet the autofocus works so well I haven't had much use for the manual settings.3. I love that I can just plug it into my laptop with the included usb cable and see my pictures in an instant without having to use their software.4. I like how it fits in my hand - very comfortable.5. The menus are easy to navigate and smart in that whatever menu you were on last when you go back to the menu it is still on that item. For example if I was setting the white balance, and I chose a setting then took a picture and didn't like that setting, i just push the menu button and without navigating again through the menu it is at the white balance options already.The thing I would change:The viewfinders accuracy.I can't tell if the object is fully focused or not. This may be something I need to learn. This object looks perfectly focused but then when you download the picture onto your pc you notice it was slightly out of focus. not super blurry but slightly and that is annoying to me because if I knew I wasn't focused perfectly I would just refocus. This happens to me about 10-25% of the time.The accuracy is a little off also in that you take a picture and think, \"that was nice :)\" and you are happy. then when you actually download it you are amazed at how beautiful it is. So *if* you get the focus right you will be thrilled with your picture.Excellent camera for the price. Would definately buy it again. I've had so much fun with it these past 5 months. :)", "Date": "March 28, 2005"}, {"Title": "Great Camera for aspiring photographers", "Author": "M. Tamialis \"Bloaf\"", "ReviewID": "R31T0BF4WUJELV", "Overall": "4.0", "Content": "This camera is a great entry level digital camera for those interested in taking pictures that are more than just \"general\" pictures.  It is easy to use and fun to experiment with and with a little time and patience, you can shoot pics that will impress.  I have had this camera for a little over a year and I am still amazed at what it can do.  I have taken pictures and framed them for gifts and for my home, the response is still the same, \"you must have spent a fortune on your camera!\"  Not true.  There are some drawbacks; the shutter lag time is on the slow side and can be quite challenging when trying to take action shots and the video mode has no sound.  However, for overall price, ease of use, and end product, you can't beat this camera!", "Date": "December 16, 2005"}, {"Title": "Great Camera", "Author": "Bondo", "ReviewID": "R382QBCSS03JXM", "Overall": "5.0", "Content": "I purchased this camera to replace an old Fuji.  I keep finding new features that make this one well worth the money.  Does everything I want it to and more.", "Date": "August 19, 2005"}, {"Title": "Great camera - very impressed", "Author": "Cyrca", "ReviewID": "R1IUZ2106MLYAN", "Overall": "5.0", "Content": "I received this camera as a Christmas present and have been using it ever since - my pictures are bright, vibrant, very detailed and without blurs. Even my photographer friend had a hard time believing that all my photos were digitally taken - very impressive.My sister started a serious search for her first digital camera about a month ago and, although technology is improving almost daily, this was the best camera we found so we picked up one for her two days ago - she's already taken a couple of great images and loves photography now.", "Date": "August 15, 2005"}, {"Title": "So Many Problems!", "Author": "Linda", "ReviewID": "R1TH2D95S9JYAT", "Overall": "1.0", "Content": "My son got this camera last December (2006).  It has been nothing but trouble right out of the box.  We put batteries in and from the first time we turned it on, it would not function properly.  I contacted Fuji and sent the defective camera back to them for re-working.  I figured that was okay, as any camera can be defective, and surely once it is repaired or replaced, it will be fine.  (BTW, I had to pay to send it to Fuji, even though it was under warranty.)  I received the repaired camera in about a month, and it seemed to work!  I was happy to try it out.  I took exactly three pictures before the old problems started.  I don't know what was wrong with the camera, but the viewfinder was either completely dark, or streaked with white lines.  I thought it was just a viewfinder problem, so I continued to take pictures just to see what I would get.  The pictures came out just as they appeared on the viewfinder: either completely dark or streaked with white!  I wish I could insert a picture in this review to illustrate the problem.  So, here I go again.  I will have to contact Fuji and see what they can do.", "Date": "April 30, 2007"}, {"Title": "Just Marvelous", "Author": "J. Storchan", "ReviewID": "R26S1NETIX68RK", "Overall": "5.0", "Content": "I really needed a new digital camera, .  My Olympus 560 had been dropped on cement while I was working my eBay business, plus I do web development.  My camera was about eight years old.  My partner's camera only cost him $150.00.  But it really was not a camera like my Olympus.  I liked the zoom feature, also being able to look through the view finder and to see is what you were getting..  I had to look at the LCD screen and image what the picture would look like.  I owned an Pentex 35 mm camera, I am an amateur photographer.  I consider some of this new digital camera's an insult.  I hate my partner's camera, even though it had 3 times the pixel image than my camera.  The new camera would be using much larger memory cards.  The maximum memory card I could get for my old Olympus was an eight Meg.So I went shopping.  First I went on the web and looked at recommendations and reviews.  Then I went to several local stores.  Some of this digital camera was so small I considered them a Kodak throw away.  Then I saw the camera of my dreams.  I read about it but never saw one.  It was a Fujifilm S3100, it had all the features I was looking for.  Not only could you look through the view finder but it gave you the option of seeing the pictured object in the LCD.  It had a video option, it had zoom, it had capability of 128 meg cards.  It fit in my hand well.  I got so exited about this camera that I stopped another shopper from buying another camera and told him about all these camera features.  So I sold the camera basically to this person.  The price was the same if a little higher than Amazon.  Yet the accessories in all these stores were twice the price than amazon.  I needed a charger, a carrying case and memory, I got them at  amazon for ½ the price than the stores, plus no SALES TAX.Someone wrote in on Amazon, about downloading with batteries is a problem.  No problemo, all camera's used up batteries, big deal, that is the life of a digital camera user, but that is why you have rechargeable batteries, dah.  Plus the Fuji offers a 5v transformer option, a video output option.  My camera is a 6X zoom, 4 .0 Mega Pixels.  The camera internal software is child's' play.  The software is ok, but I am an experienced Photoshop user, so I just download from the camera acting like a drive.  All in all I give this camera 9 stars (9 out of ten).  I would give it a ten but I had to pay for it, it was not free.", "Date": "April 5, 2005"}, {"Title": "Horrible Customer Service!!!", "Author": "C. Allen \"Jason Logue\"", "ReviewID": "R2Z93KO095FXRI", "Overall": "1.0", "Content": "The camera is fine as long as nothing goes wrong. Fuji has the worst customer service I have ever delt with. They pass you from one person to another and do everything they can not to help you. Be prepared to deal with the worst customer service in the business. I really hope this helps you.", "Date": "December 23, 2007"}, {"Title": "underdog of cameras", "Author": "jeanette \"tokyolux\"", "ReviewID": "RD8JGPJ43KJNL", "Overall": "4.0", "Content": "i'm pretty sure this camera isn't given enough chance and most people believe you need something super fancy to take better than good pictures and it really isn't the case. i did experience a lot of the same \"frustrations\" that others were complaining about and i'm not sure if its my semi-knowledge of camera use and photography that helped me smooth out the frustrations or the simple fact the camera truly holds a potential you sort of have to tinker with for awhile before its discovered. its a great little point n' shoot-esque camera that's done everything my regular slr's and digital slr's have done without a lot of the pains of technology (or old technology). i'm not a fan of the slow shutter speed when it comes to action shots and things of that nature but its macro does wonders and well practically so does everything else and after all the getting used to, its worked its way into my daily routines.", "Date": "May 1, 2007"}, {"Title": "Great camera if you know how to use it.", "Author": "Adam Richard", "ReviewID": "R362YNOLR7OGCL", "Overall": "5.0", "Content": "This is a great camera and takes excellent pictures, if you know how to use it. Now don't get me wrong It doesn't take a genius to figure out. If you're new to cameras don't expect to pick it up and start taking pro pictures. It takes excellent quality pictures. I used the macro setting and took a picture of a AA battery and the I could read the fine print that says not to recharge, very easily. It was bigger than this text with no blur.", "Date": "July 13, 2005"}, {"Title": "Good quality close up shots but shutter speed extremely slow", "Author": "Anna R. Cruz \"Hephzibah\"", "ReviewID": "R37R16H0NX4O2O", "Overall": "3.0", "Content": "The shutter speed on this camera is way to slow. In my opinion, this camera is good only for still, close up shots. I'm going to return it. Very disappointing.", "Date": "June 22, 2006"}, {"Title": "great for non-action shots", "Author": "Cheryl", "ReviewID": "RB91337MHJKD0", "Overall": "2.0", "Content": "I bought this camera to replace a Kodak that was stolen.  I bought it because it had (at the time) a higher than normal zoom (6x) and got decent reviews.  After owning it for a year, I can say definitively that I LOVE it for macro shots and still photography.  I HATE it for 2 reasons- it has an electronic viewfinder and not just a lens viewfinder and I HATE it for taking pictures of anything requiring any kind of quick response- the shutter takes around a second to respond and you will miss MANY shots.  This is just not acceptable for me while trying to take pictures of my kids.  For the first time in my life I am looking to buy another electronic item without the first one breaking, being stolen, or being outdated!  If you only want to take still shots, this is a great camera.  But if you want to take any pictures that include movement- find something with a quicker shutter response time.", "Date": "April 18, 2006"}, {"Title": "Great but has some problems", "Author": "Christoper D. Puksta", "ReviewID": "R3GIS5UD1BKCGG", "Overall": "4.0", "Content": "Camera takes great pictures and it is really simple to use MOST of the time.  However it has a big delay on it so when you are taking pictures of something that is moving it proves to be a difficult thing.  Another problem consists with the zoom.  It for some reason does not take clear pictures (all the time)  on the furthest zoom.  It is also kind of big which makes it annoying to carry around different places.Although, I must say, that I like this camera.  I had it for years now and it still works as good when I first purchased it.", "Date": "September 10, 2009"}, {"Title": "Excellent Camera, Short Life Span", "Author": "Nana Cool \"Nana\"", "ReviewID": "R1IA1YRYRE2KHZ", "Overall": "2.0", "Content": "Purchased 2 Fujifilm Finepix cameras. Both took excellent pictures; however, both died within 2 years and would not function at all. The cost of repair just not worth it. Now I sit without a camera which I cannot afford to fix or purchase another. As a senior citizen, this was one of my favorite hobbies. These were not 'refurbished' and I don't blame Amazon. I've read many reviews (after mine died) and the consensus was that this has happened with many Fujifilm cameras. Love the camera, but very disappointed in its life span!", "Date": "June 5, 2009"}, {"Title": "FUJIFILM S3100 CAMERA", "Author": "Bruce Nantz \"\"Song Crafter\"\"", "ReviewID": "R1AAIX2567667B", "Overall": "5.0", "Content": "Being recently new to digital photography, I find this little jewel extremely easy to use.  If one uses the view finder when glare from sunis on the other view when taking photos, you can better frame the shotand the final result is a sharp, clear image.However, this camera seems to work better inside, even with satisfactorylighting, if the flash is used.  But, that is fine with me.  Great product!  Easy to use.", "Date": "April 4, 2009"}, {"Title": "Great Camera", "Author": "C. OKeefe \"1337\"", "ReviewID": "R2CJMFG20HY5A0", "Overall": "5.0", "Content": "I've owned this camera for a long time and I loved it. I used it primarily to take pictures of artwork and the pictures almost always came out great. I also loved to take it to the zoo to take pictures of the animals there and those turned out great too. This camera isn't a simple camera to use in that it has a lot of features, but once you get the hang of it it's a lot of fun to take pictures with it.", "Date": "January 3, 2009"}, {"Title": "Perfect camera for me!", "Author": "Roberto Milton \"Bear\"", "ReviewID": "R3P0FZL84WO5MW", "Overall": "4.0", "Content": "I would have given it 5 stars but I hate that the video has no sound and it eats up batteries so fast. I probably should have invested in some rechargeable batteries and would be better off.", "Date": "November 10, 2007"}, {"Title": "Good Starter Camera", "Author": "Dolamyt", "ReviewID": "R3FD717GXBN6M6", "Overall": "5.0", "Content": "This camera is great.  Very easy to learn.  However, you will not want it to be the last digital camera you purchase, although it can be.  The zoom is ok and is the only weak point.", "Date": "July 20, 2007"}, {"Title": "love it!", "Author": "Joey \"montereymom\"", "ReviewID": "R1WVM6IN0BC3AR", "Overall": "4.0", "Content": "I am just getting around to reviewing this camera after purchasing it about 2 years ago. I love it; it's a good first or second digital camera, as it is functional but without too many features for the beginner. I use it for both personal and my job as a newsletter editor -- the 4MP are more than enough to get the quality images at the resolution required for publishing.", "Date": "January 5, 2007"}, {"Title": "B-E-A-UTIFUL", "Author": "Steven Toth \"stax malone\"", "ReviewID": "R3RKPRIYQ2RW6F", "Overall": "5.0", "Content": "absolutly love this camera, dont tyink its worth how much its up for, maybe a little over priced, but absolutly greaqt non the less. never have a single problem. pictures come out great. however, pictures come out a tad blurry when flash is not on. but other than that, FABULOUS!", "Date": "December 30, 2006"}, {"Title": "Fuji #1", "Author": "Keith F. Stewart", "ReviewID": "R2PU6JNISQ4NTT", "Overall": "4.0", "Content": "I got the Fuji S3000 which is the 3.2 mp version of this camera 3 years ago and I loved it.  I have a 1 yo boy and a 4 yo girl.  So my wife and I take pictures constantly.  This was our first digital camera, so I don't have anything to compare it to but 35mm cameras.  Digital is so much better.  You can keep taking pictures until you get a good one.  You see them instantly.  Delete the ones you don't like.  Print/ save the ones you like.  3.2 mp or 4 mp blows away any film camera out there in terms of quality.  I am a hack and my wife is clueless about anything electronic, but we still managed to take many beautiful pics of the kids.  We are able to blow up the photo's and put them in frames and they are profeesional looking.  This camera has a 6X optical zoom, which is great.  The flash works great.  The 16mb card you get with the camera is worthless.  1st thing we did was buy a 256mb card, which was enough for a week long holiday of picture taking.  My wife gave this camera to her nephew last month, so now I have an excuse to upgrade.Pros:  Cost(you can get this camera for under $175), picture quality, zoom, video, easy to use.  Cons camera shake", "Date": "October 17, 2005"}, {"Title": "Great camera under US$200", "Author": "Luis", "ReviewID": "R2HHK6JOOUIW6Y", "Overall": "4.0", "Content": "I bought this Fuji S3100 at Staples for just $149.99.  For that kind of money, I am getting good quality pics @4MP.  I also thought about getting an Olympus C755 but the price difference was doubling the price of the S3100.  Too bad the videos have no sound.Luis CotoCosta Rica", "Date": "October 15, 2005"}, {"Title": "Nice upgrade from previous Fuji digital camera", "Author": "Elizabeth A Triano \"lizziewriter\"", "ReviewID": "RUACAZ5CG3R4W", "Overall": "4.0", "Content": "Just a few words.  I got this camera when my husband needed to take our other digital camera, a FinePix 2650, for work.  I had such a good experience with that one that a Fuji was my first choice -- the prices are competitive and the camera was easy to use and fairly durable.This camera has a lot of nice features (zoom, pop-up flash, etc.) and is fairly simple to use.  My only gripes are that it is very lightweight (lots of plastic) so I fear it may be more breakable than the older one, and that it is so large.  Once you put the adaptor thing over the lens it is even bigger.  So don't get this one if you want a pocket digital camera.  If you are comfortable with a full sized SLR this will feel more natural.  Also you can switch back and forth between the screen viewfinder and the one that is more like a \"regular\" camera.  Although once you get used to using the screen, it can be handy for holding the camera at an angle you couldn't have reached otherwise to take a picture.I don't like the delay in shooting digital pictures either, versus an automatic 35-mm camera, but I see in the directions that there is a faster mode and I am looking forward to trying that out.  Also I am very excited about the macro option.  I really needed that.", "Date": "July 8, 2005"}, {"Title": "extremely good for non-action shots", "Author": "C. Castor", "ReviewID": "R2NOCCRFBLNKTI", "Overall": "5.0", "Content": "We bought this camera online, refurbished.  Everything functioned correctly. It does not offer shutter speed adjustment, which is the only thing that annoys me, because the camera chooses slow(er) shutter speeds, unless you point the thing directly at a lightbulb. (Which, I might add, it took an excellent picture of) So action shots are not it's specialty. However, macro shots, and pretty much everything else works great.", "Date": "May 27, 2006"}, {"Title": "caution: bad focus and no sound", "Author": "Pine Hill \"Pine\"", "ReviewID": "R22PO0MUBA0AA0", "Overall": "2.0", "Content": "I got very good impression on fuji products and when my fuji 3800 died I picked this fuji s3100. Unfortunately its focus was horrible and I had to zoom in and out to get a clear picture. It has no sound, which is another bad thing compared with 3800.", "Date": "December 27, 2005"}, {"Title": "not bad but could be better", "Author": "vj  guerra", "ReviewID": "RDXPMCNY9FPIZ", "Overall": "3.0", "Content": "the camera isn't bad but they could fix some things about it. the hand that means the camera is shaking comes on all of the time. other than that i like it", "Date": "November 9, 2006"}, {"Title": "Good camera", "Author": "Christopher P. Thompson", "ReviewID": "R2SIH7SGYYWPGQ", "Overall": "4.0", "Content": "The camera works great.  It is easy to use, and takes wonderfull pictures.  The image quality is very nice, and the range of the focal length is great too.  I have two issues with it.  It does not perform well in low light situations(inside dark rooms) it's tough to autofocus.  Also, it goes through batteries like crazy.  I would recomend getting a set of rechargable batteries, it will be well worth it after 3 or 4 days of using the camera all day.", "Date": "November 9, 2006"}, {"Title": "DON'T BUY THIS CAMERA!", "Author": "Sharon Horodyski \"59 Caddy Gal\"", "ReviewID": "R1D375HMSALVFT", "Overall": "1.0", "Content": "Although I reviewed all user comments before buying this camera, I am now complaining of the same breakdown you will see mentioned by other users; particularly as of late.  It worked fine for a few months, then began an ongoing focus problem, always after adjusting the focal length.  I returned it to Fuji, who claimed they repaired it, but the day I got it back, put the batteries in, and turned it on, I EXPERIENCED THE EXACT SAME PROBLEM.  IT WAS NO DIFFERENT.  AT least 2 out of 4 times, focus is impossible, even after trying to use the AF AE lock.  It just takes the picture without ever focusing. I am constantly switching it on and off in an attempt to get it to focus!  I have an entire collection of blurry photographs!  I am returning it to Fuji and asking for money back before my warantee is up.  I doubt I will GET my momey back, and what I will have is a useless camera that will make a nice shelf decoration.  I like a larger camera that feels substantial in my hands, the smaller models are not for me, so I am going to try a Kodak and cross my fingers.", "Date": "January 9, 2006"}, {"Title": "product review", "Author": "Department Of Health", "ReviewID": "RA5W5VRWL250K", "Overall": "5.0", "Content": "the product is high quality and the vendor shipped it safely and quickly.", "Date": "July 5, 2005"}, {"Title": "Great Camera", "Author": "Bonnie Bartholomew \"photo chick\"", "ReviewID": "R3QTPGEGZEPCA", "Overall": "5.0", "Content": "I found this camera easy to use. It took great pictures, reagardless of the resolution.", "Date": "August 2, 2005"}, {"Title": "Dead piece of junk with poor customer service!", "Author": "Maloy", "ReviewID": "RNXCBD7F8C9TS", "Overall": "1.0", "Content": "This camera took decent pictures, when it worked (after I figured out a few things).  The 3 second delay was annoying and I wish the video had sound, but I could have lived with those annoyances since I knew about them before I purchased the camera.Unfortunately, the blankety blank camera stopped working within 2 months.  No power, no nothing.  The batteries needed to be changed while I was shooting, and once they were, it stopped working.  Apparently I'm not the only one this has happened to.  I sent it back (at my expense) and they fixed it.  BTW, their telephone Customer service leaves much to be desired.  The same thing happened 3 weeks after I got it back.  Having a camera isn't nearly as important as actually being able to use the camera.  I need to send it back again, but every time I do, I get more PO'd at Fuji.I would have considered this a fluke bad Fuji camera, except for the fact that I bought this camera because my previous Fuji A303 died within 5 months due to a dreaded \"zoom error\".  I'm sure it would have died sooner, but I didn't use it very frequently. This was also a problem experienced by others.  So, I'm 0 for 2 on digital cameras even though I am very careful with them and keep them in nice camera bags with plenty of protection.Next time (and next time is going to be this Christmas), I'm getting a Kodak or Canon with a 10X zoom.  Hopefully, it will last longer.I don't generally write reviews (although I usually read them before making purchases), but I have hated my Fuji experiences and wanted to warn others!!!!Update:After going through a number of terribly unhelpful offshore operators, I finally reached a customer service rep in the U.S. who sent me a prepaid envelope to ship the camera back with an agreement to actually replace the camera instead of \"repairing\" it again.  They finally replaced it two weeks before my warranty expired (and right before Christmas).  The new one does work.  Unfortunately, it takes terrible pictures.  I plan on re-reading the owner's manual to make sure I'm not missing something.I have a friend who has the same camera and has the same problems.  We are about to take our kids to Disney together and we are doubtful about getting a decent photo between the two of us.  With all of the money I am about to spend at Disney, I hope I can get some good shots.", "Date": "November 27, 2005"}, {"Title": "Constantly Blurry", "Author": "Metala", "ReviewID": "R3CVI8NKSY66PR", "Overall": "3.0", "Content": "I've had this camera for about a year and a half and it's a great camera if you feel the need to take about 3 shots of everything.  I have taken some wonderful pictures with this camera but there have been way too many times when I took a picture, it looked great on the viewfinder and great when I reviewed the pictures on the camera but as soon as they were uploaded to the computer, I could see they weren't nearly as clear as they should have been.  This isn't due to a malfunction of any sort, it's due to the fact that the screen on the back is large enough to see your pictures but gives a false sense of security when you check to make sure your picture looks good. It's also due to the fact that this camera just isn't that great. I'm now looking for a better camera since I'm tired of finding that the pictures I was so excited to print out or show to others look horrible.", "Date": "March 16, 2007"}, {"Title": "Camera Great, Buy.com iffy", "Author": "M. Green", "ReviewID": "R1JE43JYOL7NX6", "Overall": "5.0", "Content": "The camera works great even though it is a refirbished unit. However it did not come complete. It is missing the adapter ring and is now out of production.Buy.com, Fuji and other locations do not have the ring. My bad for buying an out of date camera for sale.", "Date": "January 25, 2007"}, {"Title": "Not worth the money", "Author": "Vernon J. Bell", "ReviewID": "R1YLL17IE485U6", "Overall": "1.0", "Content": "Bought this camera as i have a 9 month old daughter, and want to catch all those important firsts and the cute pictures.  I have to say this camera, in my opinion, is not worth the $230.  First off, at fill zoom, the lense fish eyes when printing large pictures.  Second off, unless you use the flash, and even then sometimes, the picture is blurred unless the subject stays absolutely still and you have this camera on a tripod.  The subceptibily to not being able to autofocus due to camera shake is ridiculous.  This camera without the use of a tripod is really not there because of how sensitive this is to camera shake.", "Date": "April 19, 2005"}, {"Title": "Awesome Camera", "Author": "DVD FAN", "ReviewID": "R2GT9655Z1RR9E", "Overall": "5.0", "Content": "The S3100 is an awesome camera for the price. I took it out of the box and started taking very nice photos.  It is easy to use and takes great pictures. I have no grips at all with this camera.", "Date": "December 29, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "4-megapixel sensor captures enough detail to create photo-quality 11-by-15-inch enlargements\n6x optical zoom; 3.4x digital zoom\nPictBridge compatible; 1.5-inch TFT LCD screen\nStore images on xD Picture Cards (16 MB xD card included)\nPowered by 4 AA-size batteries (alkaline included; rechargeable Ni-MH recommended)", "Name": "Fujifilm Finepix S3100 4MP Digital Camera with 6x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51WD9Q35EVL._SY300_.jpg", "ProductID": "B0002AHQLY"}}