{"Reviews": [{"Title": "What an amazing machine!", "Author": "R. Wahl", "ReviewID": "R21JNZ4SV6KFGV", "Overall": "5.0", "Content": "The Zoom MRS-8 multi-track recorder went so far above and beyond my expectations! When I began looking for a good multi-track, I was torn between the Fostex MR8 MKII and this one. I have used the Fostex before and had good experiences with it, but decided to take a gamble on the Zoom and pay the extra money.Boy was I surprised!The Zoom is eons above the Fostex in ease of use and quality. The Zoom uses SD media to record on which is a whole hell of a lot cheaper than the Fostex's Compact Flash (both useable with up to 1gig of storage, not as small as you would think)Next, the zoom includes an onboard drum and bass machine which provides a quick and easy way to add drum lines or bass to a project or allow the user to easily practice with them. The included drum sounds are pretty good, although I will say the bass effects are only mediocre and clearly sound digitalized. The Zoom offers a quick and painfree process to create beats and riffs and offers 'FAST' technology to speed the process up even more. However you decide to do it, a quick run through with the help of the manual and your on your way.Both the Fostex and the Zoom have an onboard condensor mic, however I again prefered the zooms over the Fostex. Sounds were very clear and crisp and had a nice way of picking up more of you than any ambient room noises, the fostex was too sensitive IMO and picked up lots of other noises. I still prefer a nice condensor mic although neither offers phantom power so you will need to get an outside power source adapter or use a non-powered XLR-type mic. The onboard mic is good for acoustic recording.After recording, I prefer to dump my tracks into Cubase (You can check out Audacity too which is a FREE computer mixing software with TONS of advanced features and VST/VSTI support!) for further editing using the free Zoom software available from their website to convert my files into .WAV format. From there ts easy to swap out files from the computer to the device and back again.I have not messed with the midi all that much, it will allow you to play the drum and bass sounds via an external device (IE a midi countroller) and setup time clock syncs but I doubt most people will use either of those features very often if at all. I dream of the day these machines can load VSTI tracks, but for now you likely wont bother with the midi options.As far as mixdown options I cant provide much of an opinion because I upload my work into cubase. From what I have seen there are a lot of options but outside of glancing over them, I have not touched them. Other reviews I have read have sang their praises though.The included manual is well written and will have you ready to record in a matter of minutes even if you have never laid eyes on a machine like this before. VERY first time user and advanced user friendly. The Options are really limitless.The Zoom is a very solid feeling and the faders all move very tightly so you wont accidentally bump them or anything.My only dissapointment with the zoom was the included effects which are only a little better than the Fostex's but the zoom includes a lot more and more ways to customize them. This is easily fixed by using your own FX pedals and such which will give you the best options every time.Other than music recording, im a radio jornalist and use the Zoom A LOT for conducting interviews where I need my voice and my interviewees voice to be heard. I usually bring two Shure SM58's with an XLR-splitter and set those up and Voila! I have studio quality sound anywehere!In the end, the Zoom is hands down the best product you can buy in this price range with these options. Its ease of use is incredible and you will be off making music before you know it!", "Date": "October 9, 2008"}, {"Title": "The Little Recorder That Can!", "Author": "James Fogle", "ReviewID": "R2B2X83KL5OBSB", "Overall": "5.0", "Content": "Zoom MRS-8If your a musician, songwriter or garage band with limited money to spend on a bunch of equipment and are looking for an all-in-one recording solution then you are the target audience for this little machine.Zoom says the MRS-8 is a complete Music Recording Studio.  It is almost an accurate description as you can record, mix, add effects and master your finished project.  However you must use a cd burner (available on most computers) to burn an actual cd of your music.The Zoom MRS-8 inputs include two 1/4\" jack inputs (one with a switch to select high Z for instruments or line level), a good sounding built-in condensor microphone and built-in (mono) bass and (stereo) drum rhythm machine.  There are four mono recording tracks that can be linked together to create two stereo tracks as well as two more dedicated stereo tracks for a total of eight tracks.  Each track has ten alternate takes (virtual tracks) so it is possible to record 88 tracks then select which eight tracks will be used for a final stereo mixdown.  The final mixdown has ten virtual tracks too so you can have ten final mixes!The MRS-8 offers a huge arsenal of built-in input enhancement and send/return effect tools.  Time dependant effects such as chorus and echo are internally linked to the beats-per-minute (bpm) tempo setting of the internal rhythmn machine to match the tempo of the song you're recording.  Other effects include basic tools like compressors, limiters, noise gates, and expanders as well as more specialized tools like octivers, doublers, distortion, microphone, preamp, amplifier and speaker cabinet simulations.  The effects are grouped together into presets named althorithmns.User support is available from the manual.  A begineer's guide is available at: [...] and there is a user forum dedicated to the Zoom MRS-8: at: [...]I've had mine for more than a year and I'm still enjoying using it while I learn more about recording and music in general.", "Date": "November 22, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000I4SN5M"}}