{"Reviews": [{"Title": "The Digicam You've Always Wanted - Wish I Could Give It 6 Stars", "Author": "R. Vrshek \"rob\"", "ReviewID": "REZR1T8MGGI1L", "Overall": "5.0", "Content": "I normally don't write product reviews, but this camera is outstanding.  I have wanted to get into more serious photography but don't want to have to lug around an SLR everywhere I go.  I'd rather have something I can take anywhere.  May get an SLR at some point, but right now I really don't care.My first digital cam was a Nikon Coolpix 880, which had great manual features and excellent imaging/color.  Only problem was the 3.2mp resolution and the fact that I might as well carry around a brick.  I bought a Canon SD450 and took it to Panama.  I was really disappointed.  Generally, Canon photos are sharp with great color.  The camera had washed out colors and was susceptible to some serious blur.  My friend and I agreed that our girlfriends' Canon A400's (possibly the best 3.2mp camera for novices) took much better photos than this one.  Some of the photos actually looked as if they were taken on a video camera.  The battery life was tolerable (about 140 pics) but I decided to take it back and get the Panasonic.The DMC-FK01K takes the best digital photos I've seen outside SLRs.  The colors captured by this camera will make your jaw drop.  It's that good.  I'm surprised at the number of photos I've taken which make me feel like a good photographer.  The stabilization feature helps out a lot with blur, but it won't fix everything.  The video taken with this thing is incredible and will give you almost 20 minutes of 840 pixel-wide resolution (albeit mono audio) video with great detail on a 2GB high-speed SD card.  My friend bought one on the same day as me and told me his is taking some incredible photos in Las Vegas right now.  Knowing how this camera does its job, I would have been willing to pay $450 for it.Rather than do a long, drawn-out diatribe, I'll just list all the fantasic things about this camera, plus a couple of MINOR drawbacks.  I have always liked Panasonic products and this is the best one I've seen so far.  Prepare to buy lots of fast memory (up to 2GB) - it will be worth it.ADVANTAGES:1. Incredible picture quality, particularly colors, with great definition.  3.6X optical zoom makes a big difference, compared with 3.0X.2. Wide-angle Leica lens is great.  3:2 and 16:9 picture modes take great photos and make you see your prospective photos much differently.3. Stabilization prevents most blurred photos (read up on how sophisticated this feature is at leica.com via panasonic.com link).4. Very small - less than 1/2\" wider than the Canon SD450.  The screen sticks out a bit, so you will a screen protector.5. Beautiful design - the flat black body with silver/chrome trim looks very cool, like an old camera.6. Outstanding battery life.  I've taken almost 100 photos and some video, and the battery still shows full.  People are reporting almost 300 photos before recharging.7. Great widescreen (mono sound) video - 2GB SD card gives up to 20 minutes at highest resolution, 30fps.8. Enough near-manual modes to do what is needed (if you buy a small tripod for nightshots - the only way to take night photos, the pictures will turn out amazing).9. Gorgeous LCD screen with a daylight feature and a great mode which allows you to see the screen when you hold it above your head.DISADVANTAGES:1. Image stabilization is not perfect all the time, but is certainly much better than not having it.  Helps a lot with video.2. You can't zoom while you're taking video, so you need to know your shots and anticipate edits.3. Make sure you're careful of the power switch when putting it in your pocket.Move over, Canon.rob", "Date": "April 29, 2006"}, {"Title": "The only small camera with an optical image stabilizer", "Author": "oldsoup", "ReviewID": "R28EF5B4P2L1G4", "Overall": "5.0", "Content": "I got my FX01 recently from Amazon and have played with the camera for a few hours. I also own a Sony W5. The FX01 is a big step forward from the W5:1) It is much smaller. In terms of volume, the FX01 is about half that of the W5.2) The optical image stabilizer works, to some degree. I took pictures with both cameras, at about 1/15 speed; the picture from the FX01 is sharper.3) Movies from the FX01 are steadier and easier on the eyes because of the image stabilizer.4) The movie resolutions are more flexible: All three resolutions can be either 10fps or 30fps.5) It uses the less expensive SD card.6) It has a slightly wider angle lens (2.8), which comes handy when taking group pictures in a small room.7) It has a bigger LCD (2.5”). However, unlike the W5, the FX01’s LCD protrudes out from the back; a screen protector film is definitely needed.The only thing I don’t like about the FX01 is the proprietary battery. AA batteries won’t fit in the small body of the FX01. However, I purchased two compatible rechargeable batteries from a vendor at Ebay for only $7.99, which should provide ample power for most day trips.", "Date": "March 24, 2006"}, {"Title": "Exceptional.", "Author": "B. Lagman", "ReviewID": "RDOA1OMQ9HENW", "Overall": "5.0", "Content": "Didn't really know what to expect given long term relationships with Canon and Sony.  Also, some of the reviews were less-than-stellar on various websites so I entered into purchase with cautious optimism.  Mind you, I am not a photographer, but I am always concerned with quality and wanted a camera that fits my point and shoot needs, but is capable of a little more seriousness if needed.  I would use it for family vacations, family events and to shoot landscapes for email transmission at work. I purchased the camera on a Wednesday and our family left for vacation on the following Friday.  That didn't leave me much time to become familiar with the camera before having to really rely on it.  No problem. Out of the box the camera is fairly simple and easy to understand.  If you've owned any digital camera before, you'll find navigation simple and straightforward. The screen on camera is awesome, large and bright and I found the menus to be logical.  The camera seems a perfect weight as it is not too heavy, but has some heft to give it a solid feel.  The black color is fantastic, it is very cool to look at.  It is small and light enough to carry in a cargo short pocket without bogging you down.  Just make sure you give the camera its own pocket so you don't risk scratching the LCD.  The camera has a very quick response time when you power it on and you are instantly ready to shoot.  At 6 MP it is almost overkill.  I don't make large prints and if I shoot photos at 6MP, they seem so large they are cumbersome to email -many at a time.  Regardless, when shooting at 6MP, my untrained eye sees magnificent photos.  I'm sure real photog guys could find flaws, but to me none were apparent.  Night shots, could pose some challenges, but again, I think unrealistic expectations are part of that.  The flash does not cast too far, so if you are shooting in low light at some distance - don't expect a great result.  I would think a camera of this size will always have similar downfalls.  After reading some reviews I was afraid I wouldn't be able to take quality shots at night.  Not the case at all.  I have some fantastic night images and some mediocre night images that I just don't think a camera of this stature can handle.  Certainly not a problem for me and my intended use.  Image stabilization was noticeably good and the ability to select settings appropriate to the scene was useful. The \"Easy Mode\" allows those without any camera savvy (my 12 year old daughter) to shoot basic photos with ease. The battery life on this camera is stellar.  I bought an extra battery for our vacation and didn't even use it until the third day! Battery life was a big concern in cameras past - but not any more.  One thing that was a pleasant surprise was the camera's ability to shoot video.  Don't get too excited - it's not going to replace your video camera any time soon, but for shooting 30-60 second clips to send to friends or add personality to your vacation album, I was truly impressed.  I shot a video clip of our roller coaster ride.  My wife and son sat in the first car and I held up the camera to caputure their impressions.  Granted, I was jostled and jolted as the wooden coaster took violent shots at me, but the video was surprisingly great.  Perhaps today's cameras on this level are all capable of similar feats, but I just couldn't believe it. Overall, I rate this product 5 Stars.  Maybe it's a testament to how far technology has come in the last 4 years since my last digital camera purchase.  Maybe it's an indictment of the quality of my last camera and how I'd gotten used to mediocrity. I could not be more pleased with this camera. It is ready when I am, lasts a long, long time in between charges, takes great photos, takes great video clips, is small and light, has a wide angle lens, brilliant LCD, image stabilization that really works and sensible menus and settings - what more can I say?", "Date": "July 1, 2006"}, {"Title": "Finally the camera I've been waiting for!", "Author": "Ted Shafer", "ReviewID": "R2N06ERK4KS5RR", "Overall": "5.0", "Content": "Wow I love this little camera.  Finally a 28mm (35mm equivelent) zoom lens in a really compact body.  I've always kept 2 cameras - one little and portable, for quick shots and videos of the kids, and one large and bulky for high-quality, wide-angles, landscapes, architecture, and portraits.  I think I'm finally ready to ditch everything in my camera drawer and consolidate on this little Panasonic.  This camera addresses virtually every complaint I've had about my past 5 digital cameras.Pros:- wide angle lens in a very compact body- very sharp and bright 2.5\" screen - MUCH better than the Canon SD450- great picts- great videos- very rapid response - quick turn-on, quick shutter, quick turn-off- solid construction, feels good in the hand- easy to use - buttons and menus are well thought-out and intuitive- battery life is exceptional- Anti-shake really seems to work- surprisingly inexpensive - more bang for the buck compared to comparable models from Canon et alCons (I'm hard pressed to criticize this camera)- lack of zoom ability during videos is annoying- like most non-SLRs, it is basically impossible to attach filters to the lens (I like to occassionally use a polarizer, and my previous wide-angle camera, the Nikon 8400, also great but far bulkier, has threads that allow you to attach filters)", "Date": "May 25, 2006"}, {"Title": "Just What I Was Looking For...", "Author": "Carol C. \"C. C.\"", "ReviewID": "R3UJZHN0AO4EMZ", "Overall": "5.0", "Content": "After several weeks of online shopping for a digital camera I chose this Panasonic Lumix DMC-FX01. I was looking for a camera to replace my long-time love - a Canon Sureshot, that I'd used for over 20 years! I've had a couple point-and-shoot cameras in between but nothing came close to the great pictures and simplicity of use as that little Canon. I am by no means a professional photographer or techo-wise person, I just wanted a very small point-and-shoot camera to carry in my purse that required little fuss to take great photos of my family doing family things.My layman's opinion of this camera is that for the price (I paid less than $300), it delivers all that I was searching for. The size is perfect for me, about the size of a pack of cards but at the same time \"weighty\" enough to hold on to. I like the metal housing and the black color looks great! Various reviews report the battery life to be exceptional and I find this true. I've gone two full days of picture-taking, transferring to PC, vido-shooting, reviewing shots and experimenting with settings with plenty of battery life left. (My last HP digital camera would take less than 16 picures before crying for more juice....arrrrrgh! so battery life was an issue for me) The control buttons are conveniently placed, except I have accidently turned off my OIS a couple times. Avoiding this problem is just a matter of practice on my part.BTW, the OIS....that is what sold me on this camera! I'm embarrassed to say I was unaware of this feature until I'd started shopping, then I decided I had to have a camera with it. I was all set to buy one of the pricy Canons with IS when I found this Panasonic decided to try it based on reviews I'd read, as well as the great price. My opinion is that this feature is indispensible. Who couldn't use a little help with camera shake? The LCD display is 2.5 inches with brilliant resolution. The menu and controls are so easy to manuver, I'll soon be able to leave my hard-copy manual at home. I especially like the \"simple mode\" which just displays the very basic features for quick point-and-shoot. The more manual settings are close at hand in those situations where I want more control of my shots.More advanced reviews of the 6MP, Leica lens, optical zoom capabilities, 15+ scene modes, etc are also out there but I can just tell you that for my use, this camera takes great pictures and is easy to use.I'll make a couple recommendations for accessories. Get those plastic film screen protectors for that nice big display. They are so cheap and worth every cent to protect it. I also bought a 1 Gig memory card and a semi-hard protective case so the camera wouldn't get squashed in my purse.You'll love the Panasonic DMC-Fx01. Enjoy.", "Date": "May 20, 2006"}, {"Title": "Nice looking camera with great features, but image quality is not what I expected", "Author": "Michael Chung", "ReviewID": "R30O07U5TPW2UB", "Overall": "3.0", "Content": "I wanted to surprise my wife with a new compact camera with some updated features since her beloved Canon SD200 is getting a bit old (although still reliable). We just had our 3rd child, so I felt she could take better pictures with a better camera.I researched extensively and decided on the Panasonic Lumix FX01. As a bonus, it came in pink....my wife's favorite color.This camera has some great features like the image stabilizer and 28mm wide angle view.  It's also a compact camera (like the SD200) which is a requirement for my wife.  A majority of the reviewers liked the camera...for its size, you get some amazing features.  For me, the biggest selling point was the wide angle lens (a Leica lens) and 6 megapixels.When I got the camera, it was fancy looking....All metal construction with a large screen on the back.  The menus are easy to use, and there's a simple mode for those that just want to point and click.I am meticulous about comparing and testing, so I put the SD200, FX01, and my personal Sony DSC-V1 side by side and took over 100 pictures inside with flash and outside in sunlight.I expected the FX01 to have amazing pictures, but I was actually disappointed.  Some of the shots looked slightly out of focus compared to the other cameras' shots.We take mostly inside shots of our kids with the flash on, and the FX01 did mediocre compared to the other cameras.  I noticed the pictures got very dark when I used the zoom.  The SD200 had some noticeable noise in some shots, but the FX01 was not much better and was worse at times.  My Sony V1 did the best, but this was more of a comparison with the compact cameras.Pitting the SD200 vs the FX01, I looked for good picture quality....and these cameras rated about the same to me. I looked for sharpness and good focus, and the FX01 just didn't impress me.  Of the 100 shots, SOME of the FX01 pictures were better (skin tone and detail), but more were slightly out of focus and dark.  Even with all the fancy features of the FX01, I did not feel completely satisfied that it was a better camera than the SD200 because of the image quality....so I'm returning the FX01 today.I give it 3 stars for its great set of features but only average image quality for indoor shots with flash.  I wanted very badly to like this camera, but after all the testing I finally had to admit that it's not a better replacement to our SD200.", "Date": "July 13, 2006"}, {"Title": "Wide angle lens makes up for slight shortcomings", "Author": "A. Butterfield", "ReviewID": "R1X365ERE0HJNH", "Overall": "4.0", "Content": "I also have a 4MP Canon Ixus 400, and a Canon Pro1. My Ixus is getting on a bit, takes forever to focus, has a screen the size of a postage stamp, takes horrid movies and is twice as fat as this Panasonic. The latest Ixus models address all these things, but don't have the wide-angle lens I love on the Pro1.The Panasonic FX01's photos aren't as good, if you look at them critically, as my much older Canon Ixus 400. They come out a (little) bit dull and lifeless, don't look quite as sharp, just don't have the same depth of quality.BUT, the thing is, unless you look closely in Photoshop, or make big enlargements, you're unlikely to see the difference. If you make typical size prints, or view slideshows, you'll be very happy I reckon. And despite Panasonic's reputation for `digital noise', I haven't found it to be an issue (compared with my Canons) up to ISO200, the maximum the camera uses in auto ISO mode.GOOD STUFFThe wide-angle lens is really good for getting more in when you're standing close to something. Don't underestimate how useful this is.The image stabiliser makes a real difference when the light gets low (though I found it doesn't help much if you turn the camera on its side to take a portrait or something).The screen is really sharp, like a mini plasma screen. There's a `bright' mode that makes the screen easy to see in bright light, although you have to go into a menu to select it, and it cancels itself after 30 seconds.Movies are nice and smooth and look close to real video when you play them through your TV. You can take higher res widescreen ones too, but if you don't have a widescreen TV, don't bother because they look worse on a standard TV. I bought a 2Gb SD card and you can get 22 minutes video on it (less in widescreen).It's really, really easy to use. The menus are perhaps even better than Canon's menus. An absolute pleasure to use.Very small, light, slim, stylish, nicely made. Will impress your friends.Battery seems to last quite a long time, if you enable the economy mode.Spot focus mode very useful for macros and difficult subjects. Focusing generally reliable and there's an assist light for dim conditions.Pretty fast to focus and take photos, and fast to switch on and off.Metal tripod mount.The black version (mine) isn't just painted black: the black stuff is grippy and slightly rubbery.BAD STUFFNo optical viewfinder. I still miss that.There's no panorama stitch mode like on my Canons, and no way to lock exposure like on them either, so don't count on being able to make decent panoramas even in Photoshop.No spot metering option.Sometimes I get blurry photos for no apparent reason, like the focus hasn't worked. Doesn't happen often but it's annoying.Despite claiming to use high speed USB 2.0 transfer, if you download straight from the camera to your computer it takes AGES. Use a card reader.The screen doesn't have a surround to protect it. So if you lay the camera on its back, you're laying it right down on the screen.Tiny flash is weak.High sensitivity mode produces paintings, not photos! A gimmick I think.No manual control over aperture and shutter.CONCLUSIONProbably not quite the best ultra compact, though not far off. But it has a wide angle lens and that's the killer because only the hard to find and generally compromised Ricohs have that. If I hadn't wanted a wide angle lens in particular, I would probably have bought a Canon or Fuji. This doesn't even come close to my Pro1, but my Pro1 doesn't fit in my pocket!", "Date": "July 1, 2006"}, {"Title": "PHENOMINAL POINT AND SHOOT CAMERA", "Author": "SCRAPPYHAPPY \"LOVE TO SCRAPBOOK!\"", "ReviewID": "R3TLWJEWGQN30F", "Overall": "5.0", "Content": "Wow!  This is great!  I have a panasonic SLR that does GREAT pics, but this is great for convenience and does a great job.  You still get a better pic with the SLR's (of course) but this is nothing to laugh at.  I picked one up for $270 new and LOVE IT.  It is really tiny but has alot of features, and better zoom.  I had a canon SD200 before and this is TONS better than the cannon with a better zoom and better battery life, better everything...and it has image stazilizer!~", "Date": "April 13, 2006"}, {"Title": "Very nice camera", "Author": "C. Anderson", "ReviewID": "R1YW6630SWVDTL", "Overall": "5.0", "Content": "A few months ago, I realized that I had very few family outing pictures over the last couple of years.  The reason was that nobody wanted to lug around my digital SLR, even though it was an outstanding camera.  The answer was to buy a good camera that fit into my pocket.After a lot of research, I settled on the Lumix DMC FX01 -- primarily for the image stabilization, the lense quality, and being able to do 28mm.  I couldn't be happier with it.The camera itself is well made and sturdy (with the exception of the door covering the USB connection: it's a bit flimsy).  The display is bright and very easy to read.  The menus are simple, readable, concise, and don't depend on too many glyphs :-)The pictures are great, especially outdoors.  You do have to learn your camera a bit to take good indoors and low-light photos.  I advise experimenting a bit before your kid's birthday party.  Remember that you can reduce the shutter speed very effectively with image stabilization, and that helps a great deal with low-light situations.Image quality is excellent unless you go over ISO 400.  At higher ISO speeds, there's a fair amount of noise in the image.Overall, for a point and shoot camera that fits in my pocket, I'm extremely pleased with the Panasonic.  I reviewed Casio, Canon, and Fuji prior to buying this camera and after owning it for a couple of months, I can say that I would make the same choice again.", "Date": "June 5, 2006"}, {"Title": "Great wide-angle lens and 16:9 format in a stylish, pocketable camera", "Author": "Paul", "ReviewID": "R2TFKNKPUKGOWS", "Overall": "4.0", "Content": "I love this camera. I originally bought it for my wife but I've been using it more than she has. The wide-angle lens is great and I value it much more than a big zoom. It's great for close-up shots, group photos, and landscapes. The 16:9 format is great for landscapes, sunsets, etc. The display is clear and bright but a little slow.Overall, I'm very happy with the picture quality but there is quite a bit of noise in low light situations and the exposure control is sometimes unpredictable. I also can't seem to get the flash to work just right. If you're too close it washes out the subject and if you're too far it's not effective at all.Overall I would definitely recommend this camera.", "Date": "September 6, 2006"}, {"Title": "Great Portable Camera", "Author": "Stan Targowski \"Photography Enthusiast\"", "ReviewID": "R21JLN673JUOEY", "Overall": "5.0", "Content": "I bought the LUMIX so that I can have a small camera for taking quality snapshots. Something that fits in the pocket, has good battery life, takes good pictures, and can accompany me anyplace and anytime. Other cameras I considered were Canon SD550 and upcoming CASIO EX-Z1000 (10.1Mp).The camera is very well built. It is actually Made in Japan. The LEICA Lens provides the wide angle capability equivalent to 28mm - 102 mm in film cameras. This is a very handy feature for taking pictures in small places, at homes - as most cameras in that space have widest angle of 37mm or more.The LCD display is large and very clear. It is 2.5\" and has 207,000 pictures. For comparison my D-SLR KonicaMinolta Maxxum 5D has 115,000 pixels.The built in antishake mechanism is great. There are actually two levels. The preset scene modes are very handy, and include interesting selections as Food, NightLandscape, etc. I have taken several pictures at nite, with no flash, setting the camera on a table or fence, and they have come up great.The video capture feature is very good and very useful. Capturing film at 30 and 60 frames per second. With this camera I no longer need a camcorder. Although at the highest resolution the camera uses a lot of memory card space - and you need to have a fast second generation card, like Sandisk Ultra II (minimum 1Gb recommended.)The camera is small and fits well in the pocket. The battery life is very good, and the charger is very small, plugging directly into wall - no cables.The picture quality is very good. Pictures taken in good conditions are excellent for a 6Mp camera. The shutter lag is very small, and the camera is capable of taking pictures of active kids.Comparing to the 6Mp D-SLR like my Minolta Maxxum 5D, the pictures come very close. The Minolta with much larger image sensor, and huge lenses and flash takes better pictures, but again, my 17-35 lens alone costs almost twice what I paid for Lumix. The shutter lag on Minolta does not exist, but again, LUMIX is excellent for its class.Pictures taken in low light conditions are reasonably good. ISO-80-200 is good, ISO-400 is reasonable. The flash is good for short distances, say 10-15 feet.Overall, great little camera for taking quality pictures. The next best thing to a D-SLR. It is smaller than Canon SD550, and as far as CASIO goes it is not out yet, and I did not want to deal with the charging cradle for traveling. Strongly recommended", "Date": "May 26, 2006"}, {"Title": "Best camera I have ever owned.", "Author": "Dave \"Dave\"", "ReviewID": "R1LHCTV6VNB7KL", "Overall": "5.0", "Content": "I purchased this camera for a vacation to Europe. The camera was small and easy to carry. The photos it took were beautiful and even though some were taken while moving and bouncing, they all came out perfectly clear. I never was able to fill up the one meg digital card even though we were gone for 10 days. Even without the view finder that are on cameras with film, I didn't have any trouble seeing the image on the large screen in direct sunlight. I am totally thrilled with my purchase. The only negative is that I ordered a case from Panasonic on the internet and they failed to tell me that they didn't have any cases in stock (seems strange) and that it would take over a month to get. The anti shake feature is what sold me and it paid off.", "Date": "July 13, 2006"}, {"Title": "fantastic camera at a great price!!!", "Author": "rw2", "ReviewID": "R1GQEQ2SF3GLM1", "Overall": "5.0", "Content": "After researching compact digital cameras for several weeks and pouring over reviews by experts and customers alike, I chose this camera and am very pleased.  The wide-angle lens, the resolution, and user-friendly menu (with a plethora of options for a compact digital camera) make this camera a top-notch, affordable compact camera.  If you know the basics about exposure, then you can do a lot with this camera in a wide variety of lighting situations.  Also, paired with a 1GB SD, this camera will afford you several hundred pics at 6MP as well as room for video.  I highly recommend this camera for anyone wanting a great, versatile camera at a great price - and this coming from an experienced artist photographer who is very selective about equipment purchases!!!", "Date": "July 11, 2006"}, {"Title": "Little Pink Powerhouse!  Love it!!", "Author": "SuperFids", "ReviewID": "R2JAT8AURZ3MR1", "Overall": "5.0", "Content": "Thos little camera is awesome!  My boss bought me the more expensive Lumix LX1 after I achieved a certain sales goal, and while I was thrilled to be given such a fabulous piece of equipment, I found the camera to be somewhat cumbersome and heavy.  After researching further, I discovered this little powerhouse that also has the wide angle lens I need.Due to the good reviews I read on several websites I decided to trade in the LX1 for this FX01... and I am so glad I did!This camera is compact yet very powerful.  It has a terric wide-angle lens that makes all spaces look huge (I photograph a lot of real estate).  In addition, it offers image stabilization and EXCELLENT battery life!I love how compact this camera is...it easily fits in a pocket or handbag.  It's also light and very attractive (I love the pastel pink color!).  The camera is easy to use and produces great quality images.With respect to weaknesses, I'd say that the flash is a bit small and not incredibly powerful.In my opinion, this is the best option if you're seeking a compact camera with wide angle capabilities.", "Date": "June 12, 2006"}, {"Title": "Awesome except for indoor shots", "Author": "Max D. Neale", "ReviewID": "R1L5ZQ9W6ULRKR", "Overall": "4.0", "Content": "This camera excells in most outdoor situations, but when brought indoors it is nealry useless without a flash. It severely underexposes indoor shots without the flash, but other than that it seems to be one of the best ultra-compact cameras out there.", "Date": "August 27, 2006"}, {"Title": "May be the best value for compact digital 6 MP cameras", "Author": "John Kwok", "ReviewID": "R2UNFVBYQ36A61", "Overall": "5.0", "Content": "The Panasonic DMC-FX01 may be the best value for money available now in compact digital cameras with 6 MP resolution. Optically it has a superb LEICA DC VARIO-ELMARIT f/2.8-5.6/4.6-16.8 ASPH zoom lens with a wide focal length range of 28 to 102 mm (35mm format equivalent). It also comes with an excellent optical image stabilizer that will greatly minimize camera shake working under low light conditions or when panning a fast-moving subject. I've seen elsewhere some splendid pictures taken with this great little digital camera. Those who may find its image quality inferior to other digital cameras probably took poorly exposed pictures, or were unable to use effectively its fine image stabilizer. I'm truly amazed that Panasonic has offered so much, at such a relatively affordable price.", "Date": "June 1, 2006"}, {"Title": "Outstanding Value", "Author": "K. Gearhart", "ReviewID": "R3L0IXTT15XR4A", "Overall": "5.0", "Content": "This is a great camera and the value makes it an even better deal.I needed a 28MM lens at the low end of zoom for wide angle shots on hikes and group photos at gatherings.  The image stabilization allows great shots in low light (evening and indoors) with little or no flash.  It also insures a much higher success rate than any previous camera in obtaining a usable snapshot. (I've owned 5 digital cameras)  The pictures can be noisy if you leave the \"sensitivity\" set at auto.  I set it to 80 and it works great.  If I can't get the shot I need at 80 then I switch to the \"scenes\" mode and let it automatically set the parameters.  I did this when I went skiing and got great shots in the \"snow\" mode.  I also had the camera in an outside jacket pocket with the temperature in the mid 20's F.  The camera got extremely cold, BUT NEVER MISSED A BEAT as I took over 20 pictures during the day.  I also ran a half marathon with it and was able (with the 28mm lens) to take good self portraits and video thru the entire race.  (Image stabilization was a great feature when you're tired and trying to hold a steady shot while running)Pros: High Success rate (not blury or out of focus)  16 x 9 picture size (high def TV dimensions)  Relatively quick start-up and photo  Durable construction  28mm lens  image stabilization (1/8 second handheld pictures)Cons: As with most compact cameras - the limited space for holding the  camera will require some getting used to before you stop accidently  activating some buttons while trying to take a picture.  Noisy pictures in low light if sensitivity is set to auto or above  200  - the noise was never a factor since:  1. I would not have been able to take the photo with most  other compact cameras.  (ie. sensor pushed to the limits)  2. When printed out 4\" X 6\" or less, then noise seems much less  compared to the computer monitor(Both Canon MP500 and Epson 300R)I have purchased 2 of these cameras - The second I gave as a gift to my brother after being impressed with its performance.  The Canon SD800 with similar features is $400 and this Panasonic FX01 is available for just over $200. I also have two other Canon digital cameras.", "Date": "January 31, 2007"}, {"Title": "This Camera Has A WIDE ANGLE Lens", "Author": "John Boland \"John  Boland\"", "ReviewID": "R1BABDPNPMF12E", "Overall": "5.0", "Content": "I do not own this particular camera myself but if you are interested in portable digital point and shoot cameras, since Canon discontinued the Power Shot S-80, this one is one of THREE digital point and shoot cameras on the market that I know of that have a \"true\" WIDE ANGLE lens of 28mm! (The other is: The Canon Power Shot SD800 IS for [...]----and another one is Kodak EasyShare V570 which has a 23mm lens and sells for about [...])So, you ask, \"who needs a 28mm lens?\" You do! Most people concern themselves with how LONG is their telephoto lens. But, most people who \"know\" know that it is the WIDE ANGLE lens that is most important---most of the \"best shots\" are made with a WIDE ANGLE lens. For example, you're in Europe and you are trying to \"get a shot\" of that Cathedral of Notre Dame over there. You NEED a WIDE ANGLE lens. You are in the California Poppy Fields and you want to get the expanse of the golden-yellow poppy flowers with the huge blue sky filled with white clouds above---you need a WIDE ANGLE lens. You are sitting at thanksgiving dinner and you want to take a photo from the foot of the table with everyone sitting on the left and right---you NEED a WIDE ANGLE lens. You are in the garden of the California Mission and you want to take a photo of the ENTIRE garden surrounded by the mission walls---you NEED a WIDE ANGLE lens. It's Christmas day and you want a photo of the ENTIRE GROUP of visitors in front of the Christmas Tree---you NEED a WIDE ANGLE lens. This is where the 28mm lens on THIS camera comes in! So, you NEED THIS CAMERA! Otherwise you'll be cutting off heads and leaving Aunt Sylvia out of the \"Christmas Group Photo\" this year---and she'll disinherit you and you'll live a life of poverty and misery everafter! :o) If you agree or disagree or know of ANY other digital point and shoot camera that has a WIDE ANGLE lens please write, Email:boland7214@aol.PS:  Followup----today I tried out the \"big brother\" to this camera, The Panasonic DMC FX07 which you can find online for about $250.  I REALLY liked the photos that camera made.  Some reviewers complained of \"noise\"---but I didn't see any with the photos I took.  If you want to see photos taken with the FX07, please send me a request via email.  Thanks.PS: I've lately become aware of a \"better\" camera, the Nikon P50.  If you wanna know why I like the P50 over this one write to my email address.", "Date": "October 4, 2006"}, {"Title": "WARNING- LCD screen issue on all compact Lumix cams", "Author": "C. Negoescu", "ReviewID": "R1472OV8L5GDIW", "Overall": "1.0", "Content": "Bought the camera on a recommendation, and also what looked like good specs on the web. Owned it for less than two weeks when the LCD screen cracked (below the surface of the protective cover). Turns out this is a very common problem with these cameras. Panasonic will not warranty fix this! If you do get one, or own one, be very careful not to use the left nav button. If you do, be very careful on the pressure you apply. This is the camera's glass jaw, and you might end up \"bricking\" a brand new camera. I am replacing mine with a Canon.", "Date": "April 26, 2007"}, {"Title": "great features, great reviews - where is the focus?", "Author": "Sasha", "ReviewID": "R33DOUI87H5JY0", "Overall": "3.0", "Content": "I bought this camera because a good friend recommended it to me and all the reviews I've read confirmed that recommendation. I am replacing a Canon sd400 which got the infamous e18 error 3 years after i bought it :-(. I was very happy with my canon till it broke, I have a one year old and the canon has made it easy to record her first steps. After I received the fx-01 I took 100 picture the same day (ok it was at night) 33 of the pictures were out of focus - i had never had such a bad rate with my canon, in fact focus was something i wasn't even aware of till I tried this camera out. Also I found it difficult to take pictures of my daughter the camera took to long to take the shot and I seemed to miss most of them, even my sd400 felt faster. I'm in the process of returning this camera, it reads great (reviews, price, etc) but for my reality (pics of kids, friends, vacations, etc.) it can't focus and is too slow. I've used the sd600 before and consider it to be a much better camera (who cares about IS and 28mm if it can't focus?) I should warn you that I'm just a guy taking pics around the house with no professional experience, so these are my .2 cents.", "Date": "January 22, 2007"}, {"Title": "Quick summary", "Author": "T. Mallery", "ReviewID": "R1LPL0VN878GVI", "Overall": "3.0", "Content": "Pro: love how fast it turns on, and the time between pictures. love the wide angle lens.Con: the JPEG image processing in this camera is bad. noise is way too high. this camera might be great if it offered a RAW image format, and allowed the image processing to be done on the computer. you'd do better with a 4 megapixel camera that offered a RAW image; as it is, you end up with a big, noisy picture that can not be blown up as large as you would expect from a 6 megapixel camera.Great snapshot camera, but nothing more...", "Date": "October 27, 2006"}, {"Title": "Definately get this camera.", "Author": "Proximo", "ReviewID": "R5OCXZJRVFQ0M", "Overall": "5.0", "Content": "When you consider the price of this camera and its functionality and \"coolness factor\", its an easy choice to make.  I was using a Cannon Digital Elf before. The Cannon works very well but the LCD is very small, plus I felt I needed a camera that was a little more robust.Favorite points:size28mm wide angleoptical zoomimage stabilizermac os compatiblelarge LCDLeast favorite:$300 camera should include a casebattery door appears flimsy", "Date": "July 13, 2006"}, {"Title": "Great looking, performs well, but unacceptable noise at high ISOs", "Author": "Barry Wolborsky \"Barry\"", "ReviewID": "R17DM78YNHHZJ0", "Overall": "3.0", "Content": "After much research, I decided to go with the DMC-FX01. So after having used it at two events, which included a few indoor parties with low lighting, I'm more or less enjoying the camera, with the caveat that it produces quite a bit of noise, even at lower ISOs. While I was pretty happy with my results involving outdoor pictures and using the flash in well-lit indoor shots, I was very disappointed to notice the unacceptable amount of noise in some of the photos I took with low lighting. I'm not particuarly knowledgable about photography, but I don't quite understand why a camera manufacture would sell a device that takes unusable pictures at certain settings.So while I still like the camera, I wouldn't recommend it for the user who wants to take night shots or photos in low lighting situations. Other than this very important (and basic) flaw, the camera is a lot of fun to use.", "Date": "June 9, 2006"}, {"Title": "Upgrade", "Author": "David C. Nutter \"handelway\"", "ReviewID": "R310AAKMN8XYW6", "Overall": "5.0", "Content": "I previously used the FX7 which had awful battery life and noise. This new version seems to have solved all those problems. I've only just got it so i'm still testing it but so far I want to believe that it might just be the perfect small camera with the wide angle as a bonus. I havent had to recharge the battery and I've been taking pictures with and without flash for 4 days now. So far so good.", "Date": "April 1, 2006"}, {"Title": "PERFECT!!!  Have fun with movies and wide angle lens!", "Author": "kme118 \"kme118\"", "ReviewID": "R2WOPSUGHNYASG", "Overall": "5.0", "Content": "So first, this camera does show very noticeable noise in low light/ high iso.Now for the good stuff...The wide angle lens is F-A-N-T-A-S-T-I-C!!!  You will have so much fun with it!The movie mode is absolutely awesome!!!  I played them back on the TV and they are of similar quality as a camcorder.The photo quality and flash capability is great!Buy this camera... you will not be dissapointed!", "Date": "September 6, 2006"}, {"Title": "A great camera!", "Author": "JP \"JP\"", "ReviewID": "R2TS2MF7E71AV1", "Overall": "5.0", "Content": "I looked pretty hard through the market to find this camera, and was not disappointed.  What I wanted was (1) a large, hi-def LCD, (2) a standard SD memory slot, as everything else I have uses SD (3) good, non-choppy video with sound and (4) a long lasting, rechargeable battery.  I would have preferred AA rechargeables as these by far have the longest battery life and are easy to find & cheap, but the DMW-BCC12 battery isn't too hard to find or expensive.  Surprisingly I couldn't find all this in any store I looked, and I looked around almost two weeks.As a previous digital cam snapper, my reasoning was that 95% of the pictures I take I never take the trouble to print, and I instead find myself going around shuffing through the LCD and showing them.  That's what has happened at just about any get together or trip I've been to.  I suspect many other people end up doing this too.  My friends also like videos, and videos without sound is a no-no (forget about using their TV and plugging in, carrying cables around, that never happens).  The LCD pictures with 200K pixels and 2.5 size were impressive.My only complaint is (okay, I'm being picky) the small size.  I have large hands and sometimes with these digital cameras I feel like I'm a giant playing with a toy.  But the buttons are not hard to get at or prone to finger-fudging.  And at least as in some models, you don't have to use tweezers.  Why can't they make cameras man sized anymore?  I'm not afraid to carry one around and I'd never put one in my pocket anyway (what this obsession is with camera makers to make them 'pocket friendly', I never quite understood).  The durability has yet to be assessed.  Aside from that, I give this 5 stars.  My 2c.6-01-07-  I will add one thing, watch out for the LCD screen, because it can crack.  Ever since I got this camera I wished there was a cover for the large screen.  Sure enough about 6mo later, something was in the camera bag and it accidentally compressed, now I have a small starburst on the left side, distorting the photos a bit.  Curses!  I don't know why designers don't think of common sense things like this.", "Date": "August 19, 2006"}, {"Title": "Cheap, nice wide-angle, take-anywhere camera.  Photo quality ok...", "Author": "T. Gutmann", "ReviewID": "RCVCKQRNWZISM", "Overall": "4.0", "Content": "I have owned Canon Powershot S-series (S330), A-series (A540, A570is) and the S2 IS.  I wanted a 28mm wide angle point and shoot, so I bought this because Canon's SD800 IS is outrageously priced.  I'm a Canon fanatic, so be prepared for multiple comparisons.  However this camera is worth crossing over to Panasonic for.PROS - I definitely enjoy the 28mm feature.  The bright rear display is wonderful, the OS is quite intuitive as well.  Also it gets great battery life.  The ~ 300 shot estimate in the specs is pretty realistic.CONS - Compared to Canon cameras this is my conclusion -All of Canon's camera have much truer white balance presets.  Even with RED & BLUE fine tuning options, indoor dim lighting is really hard to do, as is snow lighting.This camera takes much more saturated and contrasty photos than Canons do.  Even when the FX01 is set to be less-vivid, it's way more saturated than Canon's most vivid setting.  The end result is a dramatic and unrealistic photo sometimes.The CCD noise is another issue.  This camera's sensor is much noisier than Canons'.  Nothing dramatic and deal-breaking, but don't expect the same crisp, clean shots a Canon will take.Finally Panasonic image stabilization.  It really does not hold its own against Canon.  I used the 570 IS and handheld shots that were a 1/4 second, and sometimes longer, with decent results.  The same goes for the S2 IS (which I HIGHLY recommend as a digital camcorder/super zoom hybrid).  The panasonic's sensor doesn't seem to match the ISO standards that you set it to, and it wants slower shutter speeds at f2.8 ISO 100 than a Canon set at the same f-stop and ISO.  So, despite the FX01's Mega OIS, its longer shutter speeds mean you still get shake that you wouldn't with an equivalent Canon.I know Canon, Canon, Canon.  Well, I told you I'm biased.  After reading these cons, why would you get this?  It's 1/2 the price of the SD 800 IS (if you shop around) and it's a must have for city photos, big landscapes (skies look so cool with wide angle) and it's vital for indoor group shots!Buy it, but don't expect the world from it.", "Date": "April 18, 2007"}, {"Title": "First time digcam owner", "Author": "J. Granda \"Jessie\"", "ReviewID": "R1QKE8CQ478UCX", "Overall": "5.0", "Content": "I had no prior experience with digicams nor did I know anything about purchasing one. I chose this camera based on the LCD screen size, the Optical image stabalizer and overall look. I've read the manual and there are so many functions that make it very easy to take great quality pictures. I absolutely love it and have become more interested in photography because of this camera.", "Date": "July 30, 2006"}, {"Title": "Good small camera", "Author": "Lance Jurgensen", "ReviewID": "R3U5GLBTOBWVTE", "Overall": "4.0", "Content": "With the exception of low-light photos, and action photos which has been talked about in other reviews, this camera has done a good job.  The wide angle is nice, gets more in the photo.The biggest problem I have had with it is that it does not have a standard USB cable. So, it will not work with the single cable that my Canon camera and my motorola phone both use.", "Date": "February 12, 2007"}, {"Title": "Great on paper...", "Author": "Jared", "ReviewID": "RE1K29ZYIWKYN", "Overall": "3.0", "Content": "Pics taken outdoors and in very brightly lit indoor settings are fine.  However, for the times when I want to take quick snaps of the kids and the lighting conditions are not ideal (read: most of the time), the fx01 creates images that are either cold and unnatural looking (flash on, but this is kinda normal for this space), or are noisy and grainy (which is not normal).  I found some success tweaking the settings, but I bought this to be a point and shoot camera, not a dslr, and while I don't expect the world from an ultra compact, I think the fx01 should take better pics, and there are many other cameras that do.  I returned it.The noisiness aside, it does have a bunch of cool features.  I don't think I will buy another camera without the wide angle lens, which makes framing shots so much easier.  It has a setting that makes it so you can see the lcd when you hold the camera above your head for a higher angle shot, I could see myself using that on occasion.  It goes pretty quick from off to taking the pic, which is essential for snapping candids of the kids.  Also the image stabilization works.Overall, this camera has all the right features, it just falls short on the images.  Panasonic just needs the fix the sensor to take cleaner pics to be real competition for Canon.  I have read that the fx07 is even worse, so skip that.  The fx30 was just announced, so I am going to wait and give Panasonic another chance (provided that my old s50 stays with me).  If that doesn't work out I guess I will either have to suck it up and shell out the extra cash for the Canon sd800is, or sacrifice the wide angle lens in the Fuji f40fd.", "Date": "February 2, 2007"}, {"Title": "Very good camere for filming (and stills too)", "Author": "Jonas Kubilius", "ReviewID": "R3JBO14BCBC48Q", "Overall": "5.0", "Content": "I bought this camera more than half a year ago. My intention was to get a decent camera for images, but then also be able to use it for filming short movies.I'm very pleased with its performance. In good lighting conditions, colors come out to be amazing. I really really did not expect them to be so vivid and sparkling! In darker conditions, well, it still works fine, not nearly as bad as I expected from some other reviews. Photos might be grainy or not as vivid anymore, but the stuff is still perfectly suitable to show the photos to people.As about filming, it's terrific. I mean, resolution is great (sth like 848 by 640 or so), better than what one could possibly expect from a regular camera. And the quality is super awesome, looks very neat on computer screen. Respect.It has to be pointed out that you cannot zoom while filming, but not many cameras out there can do that.Oh, it's also very small with a gigantic screen and great battery life. A great buy.", "Date": "February 22, 2007"}, {"Title": "Grainy images! I should've gone with the SD600.", "Author": "Kate S.", "ReviewID": "R3MOTZETAJXYM2", "Overall": "2.0", "Content": "I spend hours pouring over reviews trying to decide which ultracompact was the best deal and the best overall camera.  In the end, it came down to Panasonic's FX01 and Cannon's SD600.  I read the warnings from other reviewers that the Panasonic's images weren't top quality, but I chose to ignore those reviewers because on paper the FX01 looks like it would out perform the SD600.  I was wrong.After using the FX01 for a few days I knew what those other reviewers were talking about - grainy photo after grainy photo.  I really really wanted this camera to be great, but it just wasn't.  Actually, my old 3mp camera took better shots then the 6mp FX01!  Very disappointing.  I ended up returning this camera to Amazon (very easy-great service) because of the poor image quality.  I mean, wanting good photographs is why you take photos, right?  I know someone with the SD600 and he's very happy with the quality.  Judging by the customer images on the SD600's page on amazon, I think I should've gone with Cannon.", "Date": "March 13, 2007"}, {"Title": "Very Small & Nicely Built, BUT Disappointing Image Quality", "Author": "Anthony Pantliano \"The Photo Guy\"", "ReviewID": "R1KQUJDSAISZ7U", "Overall": "2.0", "Content": "I bought this camera to replace my Canon Powershot A620 because I wanted something smaller.  The Canon may have been larger and heavier but its pictures were far better.  The Panasonic took nice pictures outdoors, however, indoors, even with a few lamps on, the pictures were fairly noisy with the ISO set to only 100.  Indoor shots at 200 or 400 ISO are unacceptably noisy. The noise was distracting in prints as small as 4\" x 6\".  Moreover, when I tried to take macro pictures without the flash for an online auction the images were so dark as to be useless.  All the pictures I shot were at the highest resolution and lowest compression setting.  I ended up returning the camera for the Canon PowerShot S3 IS, which has far superior controls, zoom range, and picture quality (sure it's a larger camera, but it is a trade-off I am more than willing to make).  One the positive side the camera is very small, has a nice wide-angle zoom with optical image stabilization, and is solidly constructed.  Still, taking pictures is what a digital camera is all about and the poor image quality could not outweigh the positives.  I like Panasonic products and own many, but this Panasonic was a disappointment, this beautiful camera deserves a better sensor.  Look into a Canon or Fuji camera first.  I have owned a few of both brands and they have never disappointed.", "Date": "May 6, 2006"}, {"Title": "Great little camera", "Author": "David Dellinger \"ddupmul\"", "ReviewID": "R1NB9FFSPFJ9AL", "Overall": "4.0", "Content": "This camera has been a great ultra portable camera for over 3 years now.  At first, it was my primary camera, replacing my Nikon CoolPix 3200.  Last year (3/2010) I purchased a Lumix LX3, so the FX01 is now my secondary camera.  The photos are surprisingly good for a 6 MegaPixel camera.  The menus are easy, but the best part about this camera is the program wheel on the top that allows you to switch to different major functions without diving into the menus.Panasonic DMC-FX01 6MP Compact Digital Camera with 3.6x Optical Image Stabilized Zoom (Black)", "Date": "January 26, 2011"}, {"Title": "Incredible Quality", "Author": "Bobbi \"L.K.Nguyen\"", "ReviewID": "R3IMNQKP5TO1N0", "Overall": "5.0", "Content": "I purchased this camera around 2005 and I chose it randomly due to my company's discount program with the vendor.I was lucky b/c it turned out to be an incredible product. The quality of the photos (sharpness, clarity, color etc) is superb! Several family and friends who have used my camera have been impressed enough as to buy it. And a few of them are extremely picky people.I've taken this camera through all types of weather (humid heat of Vietnam, the summer heat of Sedona Arizona, ice cold 18 degree weather on snowboarding trips, while on a sail boat which caused it to get splashed with water)...needless to say it has never crapped out on me. I thought it would crap on on the snowboarding trips b/c I would constantly take it out, point and shoot, then move on to another location on the mountain...yet it always functioned perfectly.Even after almost 6 yrs., the battery life is great. I am comparing the battery life to all the cell phones I've owned over the years. Obviously, I use the cell phones much more frequently than the camera, but I expected the camera battery to drain due to the length of time I've owned it and due to the frequency of recharging it etc. Yet, it still functions incredibly well. Also, in comparison to several types of rechargeable AAA and AA and 9V batteries I own which drain out in less than a year, the cameras battery life is top notch.I know there are fabulous new products on the market with 14 MP, HD and everything under the sun..but when you've found a fantastic product, theres no reason to purchase upgrades. The only reason I'd buy a new digital camera is if I was to lose or break my current one :)Highly recommended.", "Date": "November 8, 2010"}, {"Title": "broken re-furbished camera", "Author": "Chris Knierim", "ReviewID": "R2EPEECBGN9OB1", "Overall": "1.0", "Content": "This vendor sold me a broken, re-furbished camera.  On the first day of my trip to Brazil my camera broke.  I didn`t drop it or bang it against anything, I used it normally, took some photos that afternoon.  I noticed that the camera was draining my batteries (from a previous version of this camera) much faster than normal.  I tried turning on my camera the next day and it didn`t work.  I tried recharging the batteries again and nothing.  Its a shame, because I had a previous version of this Panasonic Luminix camera and they are great cameras`... and of course it also almost ruined my trip to south america as i had to buy another camera from Sony Brasil that isn`t that great in quality (errors on some of the images I took)", "Date": "June 19, 2008"}, {"Title": "Unbreakable", "Author": "person \"dude\"", "ReviewID": "R1QD4U5W1EXKGN", "Overall": "5.0", "Content": "I usually don't write reviews, but I just had to tell everyone out there that  this camera is amazing.Today, I accidentally dropped it, screen first, about five feet onto the sidewalk. Not a scratch, chip, or anything. I was terrified for the screen, but besides from a smudge of dirt on the corner, it was perfectly fine.Since the day I bought it, which was in December, I've never had a problem. The battery is just fantastic, I've only recharged it about twice now. And I've taken a LOT of pictures, and not one is blurry.If you're looking for a camera that you can trust to work, and work WELL, choose this one.", "Date": "May 12, 2007"}, {"Title": "camera", "Author": "P. Keng", "ReviewID": "R3JYF5GNIRKLYG", "Overall": "4.0", "Content": "Great quality photos; easy to learn how to use. Acceptable \"pause\" time between pressing button and shutter. Didn't know memory card was \"token\" and needed to go out and make a separate purchase. Flash doesn't seem to be very strong, but all settings are easy and accessible.", "Date": "January 15, 2007"}, {"Title": "Panasonic DMC-FX01", "Author": "Stephen Damon \"Steve\"", "ReviewID": "R2HNOK78FM5MJZ", "Overall": "5.0", "Content": "This is my third digital camera, (first Panasonic). I am rather ancient and like the stabilizing as it gets rid of shakey hand holding. I keep it with me at all times since it fits in shirt pocket. Haven't been in my darkroom since I bought the first digital. Made an 8X10 print this morning of mountain scenery using about half the frame (would have been 16X20 if I used all) and quality was as good or better than from my 35mm Nikon film camera.", "Date": "January 3, 2007"}, {"Title": "Stay Away from the Beach", "Author": "B. Edelston", "ReviewID": "R35QG5CTYMQQ29", "Overall": "1.0", "Content": "If you buy this camera, do not use it anywhere near the beach.  I bought one as a present for my daughter going overseas and it broke within a few weeks.  I sent it in for warranty service and was told that the warranty was voided because the camera had sand in it.  They offered to sell me a new one at a price higher than Amazon charged me.  Apparently, others have had problems with sand blowing into the camera - it must not be sealed very well.  Customer service was rude and not at all helpful.  I would stay away from Panasonic entirely.  I will certainly not buy from them again.", "Date": "July 23, 2007"}, {"Title": "Cute but so noisy!", "Author": "cure", "ReviewID": "R3LNLE2URPTFCO", "Overall": "2.0", "Content": "After a lot of research, I bought this camera a couple of months ago before I went on a trip.  The camera had some features I really wanted - such as the 28mm wide angle, image stabilizer, a large LCD screen and the compact size!  It looked really good on paper.  After the first day of my trip, I almost wanted to smash it against the wall!  The photos (taken at ISO 200 or 400 due to a rainy day) were extremely noisy - it's like nothing I have ever seen.  I am no expert but it's just unacceptable! (When I first bought this it was just released so there was hardly any review; since I returned from my trip, I've seen quite a few reviews about this noise problem. Wish I knew it before!) Though the photos turned out okay (not excellent) the rest of the way at ISO 100 during sunny days, I would not recommend this product to anyone.  Sure it has some attractive features, but a good camera should at least take good photos! This camera gives Leica a bad name.", "Date": "June 10, 2006"}, {"Title": "Great Camera!", "Author": "W. Cass", "ReviewID": "R3HL0NPF9VMNDG", "Overall": "5.0", "Content": "I bought this camera for my girlfriend's birthday and she absolutely loves it. Panasonic has teamed up with Leica to produce something truly great for a very reasonable price. The same camera made under the Leica brandname costs twice as much. I'm very happy with my purchase and my girlfriend is too. Thanks so much!", "Date": "November 11, 2006"}, {"Title": "Panasonic FX01 Digital Camera", "Author": "Reid Arendt", "ReviewID": "R2SHGNZ7KO5967", "Overall": "5.0", "Content": "Short and sweet folks!  This compact digital camera is by far the best camera I've ever seen!  It takes beautiful sharp pictures and the camera itself is very easy, extremely easy to operate.  All or any settings are only a click away.  You will surely be satisfied with your purchase of this camera.", "Date": "January 28, 2007"}, {"Title": "still active 5 years later", "Author": "Wolfwerk \"wolfwerk\"", "ReviewID": "R1YUEPI5FJFJDZ", "Overall": "5.0", "Content": "Great real glass optics by Leica with a respectable optical zoom and interchangeable formats large enough for art prints.  I am still using this as a studio camera and it has been about 5 years.", "Date": "June 11, 2013"}, {"Title": "Great product, great seller", "Author": "Lisavox", "ReviewID": "R24AQSNNGQMTU5", "Overall": "5.0", "Content": "I bought this to replace a camera that was lost or stolen a long time ago.  It is a great little point and shoot.", "Date": "February 9, 2013"}, {"Title": "Worst camera I've ever had.", "Author": "BBYMGR", "ReviewID": "R2BCFI1JDYVOZS", "Overall": "1.0", "Content": "Horrible pictures! Always blurry!!This is the first and last Panasonic Camera I've had. I'll go back to a Canon or Nikon.", "Date": "June 17, 2012"}, {"Title": "Wonderful", "Author": "Steven A. Berns", "ReviewID": "R3AJ32AJ7HTT48", "Overall": "4.0", "Content": "Great, great camera.  Easy to use and produces consistently outstanding photos.  A bit of a hassle to transfer files to the PC, but I found a way to do it rather easily.  Not necessary to usse Panasonic software to do the transfer.", "Date": "February 25, 2011"}, {"Title": "Good choice", "Author": "BikeTom", "ReviewID": "R2TAD6VTH6FV2B", "Overall": "4.0", "Content": "I've had this camera for about a year now. I've taken thousands of shots and it has preformed without missing a beat. What I still love most about this camera is it's small size, quick start up and amazingly long battery life. What I like least is the picture quality. It's fine for shots that don't require a great level of detail but use it for something close up or zoom in on a picture you've taken and you'll notice a great deal of \"noise\" in the image. I'm still happy using it but I know there is better out there. When this one dies I will probably get a Canon based on the several positive reviews I read about that make.", "Date": "August 4, 2008"}, {"Title": "Great for Daylight and Outdoor photos", "Author": "Stuart Floyd", "ReviewID": "RG9IHK23MM7V5", "Overall": "4.0", "Content": "Camera takes great photos if out in the sun or daylight.  Indoors or flash are awful from my experience.  It is nice and small, sturdy and has served me well for what I like to take photos of and I have several others so this is just one for the pocket when out and about.", "Date": "April 1, 2008"}, {"Title": "Worth money, great quality", "Author": "S. Napan", "ReviewID": "R3BZR6A00AD56Z", "Overall": "5.0", "Content": "I'm an amateur photographer. I bought this little camera for a handy use. Previously I had similar items by Nikon coolpix, Pentax Optio, Canon; they are so so to okay. But this one I like the most. Good quality image, long life battery, exellent wide angle range, several mode to play with, nice external look. Great!!!!", "Date": "February 7, 2008"}, {"Title": "Compact, great LCD, but trouble focussing sometimes", "Author": "Michael E. McCarthy \"Mac\"", "ReviewID": "RTJYTBTOYMF8X", "Overall": "3.0", "Content": "I have four of these -- for me, my wife, and each of my two daughters -- and we took it to Europe in April and took 2000 pictures with it. In many ways it's a good little camera -- very compact, good zoom (3x), a somewhat wide-angle (28mm) basic setting, which is handy for taking pictures indoors, lots of special settings if you want to use them, shutter lag that's not too bad, and generally good guesses as to the right lighting for a balanced picture. Its video capabilities are very reasonable too.Our only ongoing problem is that many of our pictures are out of focus, and we don't really know why. We are going to try \"prefocussing,\" where you push the button down halfway first, so the camera gets a focus, and you can see in the (very big and bright!) LCD display on the back what it's focussing on, and see if that helps.It seems to have the most focus trouble in lower light conditions. I notice that even with ISO set at 400, it will often slow to 1/8th a second or even slower -- and there's no way we can hold the camera steady at that slow shutter speed, even with the dual image-stabilization/ anti-shake feature it has. So it may be blur rather than focus that's our problem. Some future day when we buy another snapshot camera, we'll see if we can spend more for one with a higher ISO setting (800 or 1200), though that can drive the cost up quite a bit. Of course, we *could* just get a tripod, or a monopod, but this is a snapshot camera, how much of a camera geek do you think we are??If we can conquer the blur problem, this will be the nearly perfect everyday camera, especially for travel.", "Date": "November 27, 2007"}, {"Title": "My First Cam: A First Great Experience", "Author": "Michelle Hipps", "ReviewID": "R291KY3XBMC6UV", "Overall": "4.0", "Content": "I got my camera about a year and a half ago before I went to college (UF - Go Gators! :) When I was purchasing my camera I was torn between getting a Canon and a Panasonic, but the Best Buy sales guy that I spoke with told me that the Lumix lens on this camera was very good, better than the Canon I was looking at. He was very right. I have never had an issue with my camera (Panasonic DMC-FX01). It has a very durable exterior (I dropped it twice), has a nice big LCD screen on the back, has easy to use buttons, has many scene modes (like sports, scenery, soft skin, portrait, night portrait, night scenery, self portrait, food, party, candle light, fireworks, starry night, baby, snow, and underwater) You can also take videos with this cam. All your pictures can be stored on a regular Scan Disc and transferred to your computer (unless you would rather use the USB cable, it does come with it). In addition, the battery is long lasting. It has a very nice feel to it. I don't really know how to explain but I'm gonna try... When you hold it, it has a nice heavy expensive feel to it without feeling too heavy. It has taken some very nice photos too. The Panasonic also allows you the option of taking your pictures in black/white, sepia, or warm, cool, or neutral color. I have used this option many times. I'm not lying when I tell you that I've gotten  alot of compliments on my Panasonic. Anyway, I'm not saying this is the camera you have to get, because there are probably many more expensive ones out there, but for the price this is pretty good. This was my first and I have to say I am 100% satisfied with it. :)", "Date": "October 28, 2007"}, {"Title": "Great camera at an excellent price", "Author": "Michael A. Owen", "ReviewID": "R2A3L6HXFV51JF", "Overall": "5.0", "Content": "I purchased a panasonic camera 5 MP model about 4 years ago and we used it to the point to where it doesn't turn on right away sometimes. I have taken thousands of pictures with the old camera and I would have to say that this version is absolutely awesome. I pop the card out, copy and paste into a folder and have pictures ready to print or email in a matter of seconds. I'm still learning the new features but so far so good. If you want something reliable that takes good pictures and portable then you can't go wrong with this. The only downside I guess would be the rechargeable battery not being able to use AA's. Oh well you can't have everything right. I recommend buying an extra battery on amazon so you can always have an extra one on hand when you are busy wailing away taking pictures.", "Date": "October 11, 2007"}, {"Title": "Great Camera", "Author": "Rafael Zurita \"tenezus\"", "ReviewID": "R1DIZO4WQ7W5SE", "Overall": "5.0", "Content": "You gonna love the 28mm of this lens. It is very fast responsive and the quality is great!! Speacially for those places you are not gonna take your DSRL.Great buy!", "Date": "October 10, 2007"}, {"Title": "Solid camera, very versatile", "Author": "metamatt", "ReviewID": "R2IHX7HSN2D8WG", "Overall": "5.0", "Content": "I've had this camera for over a year, have taken thousands of pictures, and am completely happy with it and recommend it (or its newer siblings) highly.Prior to the Lumix FX01, I'd owned several Canon pocket-sized digital cameras (S100 and SD400), and considered myself a die-hard fan of Canon's quality and interface, but when I broke my SD400 (my fault, not Canon's) and needed a replacement, I was drawn to the Panasonic/Lumix instead.  Thinking back to the SD400 and the photos I'd taken, 2 problems stood out: a lot of the pictures I took were blurry, and often I couldn't fit everything I wanted to in the frame.For the blurriness problem, usually the photos would look good on the camera's built-in screen, but when viewed at their full size on a computer or printed, the blurriness would be apparent.  The obvious solution: optical image stabilization. It's just really hard to hold something as small and light as these cameras perfectly still, so OIS is a big help.For the fit-in-frame problem, sometimes moving farther away is just not an option, and 35mm equivalent starts you off too close. The obvious solution: a wider lens. Unfortunately, that was very rare in pocket cameras... until the FX01.I chose the FX01 because at the time of its introduction, it was the only pocket digital camera whatsoever to combine a wider-than-35mm-equivalent lens and optical image stabilization. This was enough to make me take a chance on a new brand, not knowing how well the controls and interface would perform in actual use. Over the next year, it's turned out great -- there are somethings I've preferred about Canons and some things I've preferred about this, but this camera has taken consistently good (and not blurry!) pictures.One more thing I only learned after the purchase: the build quality (construction and materials) of this camera is amazing. I don't use a carrying case for my pocket cameras, since then it can't fit in my pocket! Instead, I just keep the camera naked in a pocket with no keys or other metal objects, or keep it in a $5 soft sunglasses sack. After a year of this treatment, the SD400 still worked fine but had a bunch of minor scratches and a few missing screws. After over a year of this treatment, in comparison, the FX01 still looks brand new. It bears repeating: it's amazing.The image quality isn't quite perfect (one common complaint is noisy images under low light conditions), but given the tradeoffs necessary to make something this small with all the other features and abilities you want, I'm completely satisfied.Since the FX01 pioneered the OIS+wide lens combination, other pocket cameras (Canon's SD800) do it too; a friend has the SD800 and it's great too. You won't go wrong with either one, in my opinion.", "Date": "September 20, 2007"}, {"Title": "Fantastic!", "Author": "naeno", "ReviewID": "R1LR13FZGFBYST", "Overall": "5.0", "Content": "I've had this camera for about seven months.  It's wonderful!  The controls are easy to use, the pictures are very clear, and the motion picture is great.  I would recommend this camera to anyone.", "Date": "September 17, 2007"}, {"Title": "I love this little camera", "Author": "David Owens", "ReviewID": "RQMQHHF2STH1X", "Overall": "4.0", "Content": "I have had many digital cameras over the years, and today have 4 that work. I use this the most just because it is so small and easy to carry. Panasonic is going to release a 12 mp model soon which I might buy.", "Date": "August 25, 2007"}, {"Title": "Best camera I've ever owned!", "Author": "M. Li", "ReviewID": "RTY0F11KX5LL", "Overall": "5.0", "Content": "And I've owned a Canon and Sony. But this stylish, compact Panasonic beats them hands down! Lightweight yet made of quality materials, I often just sling it around my wrist with the complimentary wristband and walk around taking pictures all day.Pictures are sharp and focused, no matter what light I took them in. It has such a variety of settings for all sorts of occasions that I take quality photos at EVERY setting. The stabilizing feature works PERFECTLY. I thought a friend had ruined a photo by moving the camera the second after he pressed the shutter, but the picture came out crystal clear!I was very impressed that Amazon shipped me a new product that was MADE IN JAPAN -- and you know that Japan makes quality electronic products. It was a very professional and comprehensive package, I just LOVE this camera!", "Date": "June 29, 2007"}, {"Title": "Nice camera", "Author": "Steve Felker", "ReviewID": "R1H6HY3WO1KUIA", "Overall": "4.0", "Content": "This is a nice camera.  It produces huge pictures (3.5MB) so make sure you buy an SD card with it (why do they waste our time including a 16MB card?).  Another piece of advice, buy a case to put it in, the whole back of the camera is an LCD display that scratches very easily.Shop around before you buy, though.  I just saw a 7MP version at Costco for a lot less than this.", "Date": "June 2, 2007"}, {"Title": "Best little pocket camera out there!!", "Author": "C. L. Stuart", "ReviewID": "R137PG1JC96Q1V", "Overall": "5.0", "Content": "I recently purchased this camera for my daughter, I was so impressed with the image quality and 28MM (widescreen)that I bought one for myself!If you are looking for a great little pocket camera that takes excellent pictures, I would highly recommend this camera. It has been around for about a year, so you can buy it now for a pretty reasonable price.Canon is the big name out there and they make great cameras, but I think Panasonic makes a better camera with better technology.Check it out, you won't be disappointed!An added bonus, it is actually Made in Japan!!!", "Date": "May 23, 2007"}, {"Title": "Great product", "Author": "Michelle L. Best \"M. Best\"", "ReviewID": "RFUHQEQDAZPRS", "Overall": "5.0", "Content": "My husband accidentally ran over the previous version of this camera.  We loved that camera too.  This one is even better because there is audio for the video mode play-back.  There was not in the previous version.This camera is a great deal for the quality picture that you get.", "Date": "May 15, 2007"}, {"Title": "love my little pink camera", "Author": "P. Hodges", "ReviewID": "R1WX49FYWOCR4J", "Overall": "4.0", "Content": "I love this camera.  It is handy, goes in my purse everywhere.  Sure it isn't a Canon Rebel or remotely like it, but it is fast fast fast, holds a charge, takes a great wide angle shot and takes superb macros.  I don't use the movie feature but it has it.  There is a lot to offer in this little camera.  I have people stop me all the time and ask what brand it is.  Buy it and be happy :)", "Date": "April 24, 2007"}, {"Title": "Panasonic & Leica - great combination", "Author": "Welmer T. Cruz", "ReviewID": "R1VGGKYA71C5M5", "Overall": "5.0", "Content": "I have recently gotten this camera, and i'm very happy with this purchase. It's very easy to use, compact and include all you need if you are a beginner taking picture.For those person who look for made in japan electronic, this is a great product, that combine german thechnology too, as it has a Leica lens, witch in my opinion it is one of the best optical products.It is a very good choice, for price, quality and features.", "Date": "January 14, 2007"}, {"Title": "Panasonic DMC FX01", "Author": "G. Chambers", "ReviewID": "R358WHWDKJJ1II", "Overall": "4.0", "Content": "I have had all around good results with this camera. The optical image stabilization works well. The screen is easy to see in bright sunlight so the lack of optical viewfinder is not a big problem. The movies are very good when set to the high resolution setting. This is a good camera for the price", "Date": "January 11, 2007"}, {"Title": "Pan.Lumix FX01", "Author": "German Saucedo", "ReviewID": "R3S0G45A0IWF58", "Overall": "5.0", "Content": "Great camera, wide angle, excellent quality with light and acceptable under low light conditions. One person bought this camera and after observing the capabilities of such a small pocket toy 3 people ordered also.Video is also good but it is sad that these pocket cameras do not operate the zoom while taken video. A good 2GB. SD card is needed for video.", "Date": "January 9, 2007"}, {"Title": "Panasonic Digital", "Author": "Norman Shelton \"Norm\"", "ReviewID": "R2H80PU2AJK1QI", "Overall": "5.0", "Content": "I was very impressed with this camera. The picture quality is excellent. It is compact and very easy to carry. The large view screen is a plus. Like all LCD screens a bright sun makes viewing difficult.The camera lacks a standard viewfinder which isn't a problem except in bright sun.It is very intuitive and easy to operate. Very feature rich for the price.I highly recommend it.", "Date": "January 7, 2007"}, {"Title": "great little camera", "Author": "Debbie Z.", "ReviewID": "R1TSI8LVWOHHL6", "Overall": "5.0", "Content": "I'm not a camera expert, but I love this camera. It's nice and small and lightweight. the picture quality is great. There are many different options on this camera, but I haven't used them yet. ( I use it in simple mode and it automatically does flash or backlight adjustments)  It was a bit of an adjustment to get used to pressing halfway to focus, then smap the picture. What I love is when viewing the pictures on the LCD screen it automically turns the picture upright no matter which way you took the picture. I did buy a 1GB card and it stores plenty of pictures for our holidays and vacations.I recommend this for anyone who wants a small useful camera.", "Date": "January 6, 2007"}, {"Title": "Great Camera - Easy to use", "Author": "Scooby Doo \"ScoobyK\"", "ReviewID": "RCNI3TA9IGXX8", "Overall": "5.0", "Content": "I bought this for my 12yr old daughter as a Christmas gift. Not only was she excited about the color but she took it right out of the box and used it w/no problems quite easily... Of course, she read the manual later and learned more.. the screen is quite big and it takes great pics.", "Date": "January 2, 2007"}, {"Title": "This is the One!!", "Author": "fbrgr", "ReviewID": "R1AMMDR577ZXIP", "Overall": "5.0", "Content": "Just got the DMC-FX01 yesterday for my birthday. I'm so stoked!This ultra compact has it all! 6mp, Panasonic's proprietary optical image stabilization, wide angle lens, a high-powered 2.5\" LCD that even works in daylight, VGA movies w/ onboard sound, ISO 1600 high sensitivity mode - the list goes on and on.I can finally stop searching for the perfect digicam - this is the motherlode! You will love it!", "Date": "April 22, 2006"}, {"Title": "Very nice camera!", "Author": "N. Achalaboon \"godspeed\"", "ReviewID": "RHWUDS6XLSHNA", "Overall": "5.0", "Content": "It so nice picture. Very nice picture in the night without flash. good price, Good quality !", "Date": "August 24, 2006"}, {"Title": "Mediocre picture quality, terrible low light performance", "Author": "Big Fudge", "ReviewID": "RJWTN91PQ0QYL", "Overall": "3.0", "Content": "I have owned this camera for about 6 months.Pros: This is compact and light camera, which makes it very easy to take along on day trips and dinner parties. The battery lasts forever. The controls and on screen menus are easy to use. The case and controls have a quality feel. The camera starts up very quickly and writes to the card very quickly.  The screen is large and crisp.Cons: Unfortunately it takes pretty crummy pictures. Low light is the worst, producing very grainy, poorly exposed, and out of focus pictures. Day light, not surprisingly, produces the best results with rich color. But the camera also overexposes a bit in bright daylight. Flash pictures are almost always blown out. Red eye reduction on the flash is very slow, so you get a noticeable lag between pressing the button and having the flash pulse and the shutter release.This camera is like and old Polaroid or instamatic... you can't expect much, and you will never count on it for true \"keepers\".  That said, it goes with me everywhere and is handy for when lugging around a DSLR is overkill.", "Date": "January 31, 2007"}, {"Title": "Point and Shoot", "Author": "D. V. Woodard \"Soulnoir\"", "ReviewID": "R24CH9XX63OIN6", "Overall": "5.0", "Content": "I am accustomed to using a larger point and shoot zoom. This is a sleek pocket sized point and shoot that gives exceptionally sharp pictures. It focuses very swiftly I would suppose due to the Leica lense. The battery life is good. I do notice that photos tend to calibrate a little to the blue range. I like to have a little more zoom. Overall,I like it very much.", "Date": "March 29, 2007"}, {"Title": "Good Camera", "Author": "Candace E. Pruett \"kandachu\"", "ReviewID": "R1O1VPC1STWNI9", "Overall": "4.0", "Content": "easy to use. fun wide angle feature. I miss my zoom on my old camera, but in general this camera is very nice for a digital.", "Date": "July 31, 2006"}, {"Title": "Easy", "Author": "Luiz E. S. Zambelli \"Eduardo Zambelli\"", "ReviewID": "R2URPWRKMCVMR6", "Overall": "5.0", "Content": "A melhor máquina para mulheres! Pequena, elegante e potente, tira fotos enormes com ótima qualidade.", "Date": "January 11, 2007"}, {"Title": "WARNINGS about this Panasonic camera", "Author": "Picks n Pans", "ReviewID": "R3LEWJQJO8GVJC", "Overall": "1.0", "Content": "I'm sort of relieved that my Lumix FX-01 is at Panasonic after I refused to pay $111 to have them fix my lens, which bent to the side.How did it bend to the side?See that on/off switch on the top of the camera? The entire time I had the camera it would turn on by itself since it's very easy to hit by accident. Apparently this happened somehow in my pocket and the lens bent and stuck.When I pointed out to customer service that no other camera has a switch that extends like that - and seemingly for a very good reason - they were not moved.On another note this camera is HORRIBLE in low light photography. Additionally the colors and photos were always kind of harsh without the nuance and \"wysiwyg\" quality I got with my old Canon point and shoot.I HIGHLY recommend getting a Canon instead of this. The main reason I got this Lumix was a 28mm lens, but that wasn't worth it -- especially after my bad experience with their product design.", "Date": "October 1, 2008"}, {"Title": "love it", "Author": "A. Dousset", "ReviewID": "R3QN3JISD6TXEJ", "Overall": "5.0", "Content": "this is my fifth digital camera, and i like it the best by far.  it's also the cheapest.  it's my first wide-angle and my first silver-not-black:  as someone else said, i don't see how i would ever go back to a non-wide-angle after this; but i do wish mine were black.  i have noticed the colors are faded in fluorescent light, but for macro it is excellent--much better than the more expensive camera i already had bought for macro purposes (canon.)  i also love the battery, which seems to last forever.  i bought a replacement lenmar battery which is also great, and cheap, but it got some bad reviews because it was described as being for the wrong model camera, not the fx-01.  (if you read the customer reviews, you can figure out which one is the right one for you.)i do have problems understanding the display, which shows options that don't correspond to any place on the camera you can select the options at.  (i guess i should look at the manual.)  also, i don't like the software and decided not to download it at all.i bought this because i wanted a camera made by a computer company as much as a camera company, that is, i wanted it to work.  also, someone had sent me an email about the history of leica, and how they saved a lot of jews from the concentration camps.  the other nice thing about this camera is that i use it a lot more because i carry it with me every day:  it is tiny and the battery always works, so why not?as for the graininess, on my desktop the pics look fine, and i would not be raving about this camera if it were not very easy to take good pics with--but i have to admit i haven't used it for printed pics so far.", "Date": "March 20, 2007"}, {"Title": "Sexy  YES,  but lacks performance!", "Author": "Hello Earth!", "ReviewID": "R2CMZE7UA0N78Y", "Overall": "2.0", "Content": "The Panasonic is very compact, very stylish SEXY as my wife called it, but the photos are very disappointing: they are way to noisy! Even if set on the lowest ASA setting at 80ASA it is just barely acceptable and they do get progressively worse anything above 100ASA.The colours are good, and it does take very good videos, but still photos are just plain bad when compared to other cameras in Photoshop CS2. Of course it is easy to understand why: the native resolution of the images. If one investigates such things, will notice that the Panasonic is only 72 dpi, same as Sony's, Canon improves this to 180, and Nikon is at 300 dpi. It is not just about megapixels folks, but how those megapixels are recorded and at what resolution. Obviously a camera with 72 dpi will have more noise than one at 180 or 300 dpi.So before you buy any digital camera or thinking about upgrading to a newer model, do yourself a favour. Try 4 or 5 cameras in the same megapixel range at a good camera store by taking photos of the same subject in the same light condition. Set the camera for the lowest ASA and the highest picture quality in JPG format, take the photos, pop the SD card  into the computer, compare the images in Photoshop. Enlarge to full pixel size (100%), and and look at the meta data at the same time and you will see for yourself. That is what I did, since I was not very happy with the images my Panasonic produced! I had this camera for 11 months and 20 days exactly, and today I traded it in on a Nikon P5000 after evaluating over a dozen models including the Leica D-lux3 10MP camera, and driving the sales persons crazy with all the testing and spending 4 hours at the store, but it was very educational for them too.", "Date": "April 4, 2007"}, {"Title": "xmas gift", "Author": "D. Colatrella", "ReviewID": "RGJ596OSGMACD", "Overall": "4.0", "Content": "this was a gift for my teenage daughter.  she finds it very easy to use, and loves the small size, being able to take with her anywhere.", "Date": "January 20, 2007"}, {"Title": "EXCELLENT CAMERA", "Author": "Carol A. Casady \"C Casady\"", "ReviewID": "R3MP4NYJBK5K04", "Overall": "5.0", "Content": "I PURCHASED THIS PANASONIC DMC-FX01P DIGITAL CAMERA FOR MY COLLEGE DAUGHTER FOR CHRISTMAS AND SHE FELL IN LOVE WITH THIS COMPACT PINK CAMERA THE MINUTE SHE OPENED IT! SHE LEFT FOR THE PURDUE COLLEGE BOWL GAME IN ORLANDO AFTER CHRISTMAS AND TOOK HER CAMERA AND SHE SAID IT WAS EASY TO OPERATE AND SHE LOVED THE LARGE VIEWING SCREEN. THIS CAMERA WAS AN EXCELLENT CHOICE AND SHOPPING ON LINE WITH AMAZON FOR THE FIRST TIME WAS A GREAT WAY TO DO CHRISTMAS SHOPPING!", "Date": "January 15, 2007"}, {"Title": "Don't ever lose the proprietary data cable for this camera", "Author": "Daniel Jacob", "ReviewID": "RBK61ECY6L5YQ", "Overall": "2.0", "Content": "This camera takes great pictures and is very compact and portable.  I've loved having it, but it has one glaring flaw which is the proprietary data cable. If you lose it, there is no universal cable you can use to transfer your pictures to your computer. You have to buy a very specific replacement cable. Not being able to get my pictures off my own camera has rendered it nearly pointless.", "Date": "September 23, 2008"}, {"Title": "Great little camera, easy transaction", "Author": "Tom Sloss", "ReviewID": "R1GPPMZWFVQQVD", "Overall": "5.0", "Content": "I am very satisfied with this camera. It is a great size and easy to operate. I tried to purchase it on line, only to find dishonest dealers who wanted to charge me for the battery or charger. Those items are included from the manufacturer. When I saw the same camera on Amazon at a competitive price I ordered it. I felt very confident having done business with Amazon before, and I wasn't disappointed this time either.", "Date": "January 9, 2007"}, {"Title": "Panasonic DMC-FX01 6MP is dah boss!", "Author": "Michael Tchong \"trend maven\"", "ReviewID": "RV764DUAXP1Q4", "Overall": "5.0", "Content": "This is a superb digicam that has all the buzz in the camera world. And no surprise: it's small, has anti-shake, a wide-angle lens, plus is cheap to boot! Get it today!", "Date": "July 5, 2006"}, {"Title": "Big Mistake", "Author": "J. Marcus-kurn", "ReviewID": "R1Q6UDELF6594N", "Overall": "1.0", "Content": "I do not recommend this camera.  Within six weeks of getting it, after routine usage,it died and Panasonic would not repair or replace it despite the 90-day warranty.  They said the camera had sand in it.  If it broke down that easily and that quickly, and the manufacturer will not stand behind its product, then stay away from this camera.During the brief time the camera was working, it took pictures that were no better than any other digital camera I've seen.  Why buy an average camera from a manufacturer that will not stand behind its product?", "Date": "July 17, 2006"}, {"Title": "Panasonic DMC-FX01 6MP Compact Digital Camera with 3.6x Optical Image Stabilized Zoom (Black)", "Author": "Li Lin \"L Madison\"", "ReviewID": "RBGTIDFJ5ZU84", "Overall": "5.0", "Content": "Good product but the color was not so attracticed.", "Date": "February 14, 2007"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000EBOC9U"}}