{"Reviews": [{"Title": "Don't bother with this one", "Author": "T S \"8bit\"", "ReviewID": "R1N0ZH9PMPWWCZ", "Overall": "1.0", "Content": "I got this unit because my house was broken in recently. Sadly, this unit disappointed me in almost every aspect. First, the unit is extremely difficult to setup (despite the very detail manual on how-to). You need to connect the unit to a router first and assign IP address via Panasonic app. Second, you NEED power outlet for each of the webcam. Most likely, you'll never have a power outlet where you want to place the unit. Third, the unit does not support WPA protocol, just WEP, which is not very secure. Lastly, this unit is OLD model. There is a new model that support WPA. Also, if you search Amazon carefully, there is an identical product with a lower price. I finally opted for a wired (q-see) webcam system.The only bright spot is Amazon.com customer service is OUTSTANDING. They answered all question and helping return.", "Date": "May 20, 2009"}, {"Title": "Be sure about what you want", "Author": "Stela Pen \"Stela\"", "ReviewID": "R1LBF5WH3CMFEO", "Overall": "1.0", "Content": "I bought this because the cameras I wanted (top line) was above $500. When I saw this product I though this was a good deal. I needed a security camera urgent and I ended up buying this.As mentioned on the other review, setup is not easy, manual is not clear about to configure the cameras and the tv adaptor. If you intend to configure the network, it's not eash. The manual tells that you must to have panasonic router for the network, but it's not true, I used a ethernet-wireless bridge and connected to the tv adaptor and it working with my wireless network.Don expect good quality on the resolution neither on the movie quality. Don't use this camera in low light places, if you can keep in a room with natual light or white/natural light lamp the image is good.Good things:- cameras comes with a built-in software which allows you to control the camera over the network and internet.- if you setup camera on the network (assigning IP to the camera using the utility cd that comes with the camera), you can customize each camera to send emails with the picture they capture with the motion detection.- easy to manage remotely- if you have the recording software on your PC (sold separated) you can buy other models of panasonic camera to use the same softwareBad things:- the camera can record few pictures (frames) and the TV adaptor only support 1GB SD card (so old technology!) which is used to record also. But if you want to record a lot of images, you need to buy their recording software which is a little expensive (and there is no upgrade if you buy the old version, you will have to buy the full price of the new software). And end of all this recording software must to be installed in a PC. I bought and it was ok, but I was expecting more for the price I paid.- model of the product is old, this camera as mentioned in one comment only support WEP and doesn't has zoom. The new model supports WPA and has zoom (but it is twice more expensive). Both new and old model doesn't support wireless n.- not good in low light places- I would rather prefer to buy only the cameras without the TV adaptor that doesn't has capacity to record a lot.", "Date": "July 2, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "It?s Wireless. Place the cameras anywhere.\nPan/Tilt Control. Move each camera via the internet, cell phone or TV.\nEasy Setup. It?s Plug and Play simple! No PC required on location.\nRecord and Email Camera-triggered events on an optional SD memory card.\nMonitor up to 8 locations with your TV.", "Name": "Panasonic Internet Video Monitoring System with 3 Color Cameras, TV Adaptor and Remote Control (Gray)", "ImgURL": "http://ecx.images-amazon.com/images/I/31QQCVJPR3L.jpg", "ProductID": "B000KDW460"}}