{"Reviews": [{"Title": "Easyshare Z612 - WONDERFUL, WONDERFUL CAMERA!", "Author": "D. Werkheiser", "ReviewID": "R15C1YP77270HH", "Overall": "5.0", "Content": "I LOVE this camera!  I have a Nikon N90, which is an excellent camera, but I wanted a digital, smaller camera.  Several years ago, I bought a Toshiba PDF4300, and my husband purchased a Nikon Coolpix 5000.  Both of these digital cameras are not user friendly or fast.  As a result, we stopped taking photos.  I bought a Kodak C model Easyshare camera for my mom for Mother's Day and was shocked at how easily I was able to immediately start taking photos.  There were dedicated Review and Delete buttons by the LCD panel.  What a concept! (To this day, I have problems deleting on my Toshiba.)  It made me want to start taking photos again. I studied specifications from camera to camera; e.g. Canon, Nikon, Kodak, but I kept coming back to Kodak's simple, easy-to-use formula. I decided on the Z612 for a multitude of reasons: size, speed, stabilization, TV quality video with stereo audio, 2.5 LCD with 233K pixels, 35mm to 420mm zoom, 6.4 MP, ability to use a 2 GB SD card (with the best res (6 MP), this card can hold 491 photos), etc. I called some camera stores in town to see if they carried the Kodak Z612, because I wanted to see it in person, and I was surprised at their snobby responses that they don't carry Kodak.  Don't let that kind of attitude stop you from seeing this camera.  I found one close to home, and bought after looking at it - great sale price, too.  This is the easiest camera out of the box. Very fast! Excellent quality - no red eye on my new kittens.  In one day, I took 200 photos, copied them to my computer - no hassles. I am the happiest I've ever been with a camera.  As an additional FYI, Kodak announced the P712 in London on June 20, 2006.  This should be better than the P880 which I was considering.  If you want to add an external flash and things, the P (Performance) line is the way to go.  For this purchase I wanted size, quality, AND EASE OF USE. It looks like the new P712 is very similar to the Z612, which was announced Feb 2006. (Z is for high zoom, 6 is for MP, and 12 is for 12x zoom.)I am ABSOLUTELY THRILLED with my Kodak Easyshare Z612.  (No, I do not work for Kodak.)", "Date": "June 22, 2006"}, {"Title": "One important drawback", "Author": "Gail", "ReviewID": "R2YDAE1D8Q8BTR", "Overall": "4.0", "Content": "Kodak Easyshare Z612Pros1.  There are dedicated buttons for setting focus, flash, timer, review, information, delete, menue and share photos.  Because the buttons require a solid punch, I have not not had the problem of accidentally resetting the camera when handling it. This makes the camera easy to use.2.  The x12 zoom works great and so does the image stabilization.  I was able to take photos of people without a tripod from significant distances (15-20 feet) allowing for candid, non-intrusive shots of subjects. Because there are blur and poor exposure warnings, almost all of my photos came our sharp and bright.  At the longer distances on the flash range, it was necessary to enhance the exposure in editing and I was amazed at the quality of the correction.  Unless I was very close to the subject, the skin tones were good.  I have submitted some sample images for your review.3.  I really like the software that comes with the camera.  I normally edit the photos in a retail store because the touch screens are so easy to use as compared to my complicated and tedious computer software. The Kodak software was simple and had fun features such as turning the photos into cartoons or coloring book pages.  Plus, the software is integrated with the Kodak website for easy photo sharing.4.  The camera is lighter weight (10 oz w/o batteries) and smaller than the Kodak \"P\" (professional) series. [...] While it is no substitute for a pocket camera, I think I would still use the z612 as my primary camera on a road trip.5.  The LCD screen is large at 2.5 inches and the EVD is bright. In comparison to other cameras I have used, I can see the LCD screen in bright sunlight but it is on the dim side in the normal mode.  There is an option to brighten it beyond normal, which I have not tried.6.  The batteries, which come with the camera, seem to last around 50 photos with lots of telephoto adjustments.7.  The camera does come with a lens cap and lens strap, which I attached to the hook for the neck strap.  The cap pops off and hangs out of the say when the camera is turned on.  It is NOT necessary to keep track of the lens cap.Cons1. The wide/telephoto lever is located immediately to the right of the viewfinder.  I use my left eye when looking in the viewfinder and it is very, very difficult to use the wide/telephoto at the same time.  My thumb  ends up poking my right eye.  If I had tried this camera out in the store, it may have been a show stopper.  This is a significant con, which dropped my rating by one star.2.  The icons and text describing the scene options are on the small side compared to the space available on the LCD screen.  My current camera uses a descriptive photo with large text for the scene options. After you select a scene option, you have to toggle the wheel off and back onto the scene option to get back to the scene menu.  This is cumbersome.3.  The icons on the camera body for the flash, focus, et. al are small and may be difficult to see for the 50+ consumer.4.  The battery indicator does not come on until the batteries are low.  I would like to know the status of the batteries at all times.5.  For macro photography, you have to be at least 4.7 inches away from the subject for the focus to work properly.  This is a long distance for macro photography, so your photos may require cropping for a really close look.  I did some test photos of a grid and the tightest I could get (while maintaining good focus) was an area of around 2 inches by 2 3/4 inches. Too much cropping degregates the image quality.  If you want to take pictures of ladybugs in high resolution, you may want to consider another camera that has a better macro mode and a super macro mode.  Cropping to a grasshopper size works--but a ladybug size seems to be beyond the limits of this camera. (I did get a good shot of a ladybug, but I had to leave a lot a background to maintain a quality photo.)ConclusionThis is a light-weight, easy to use, affordable camera with a large, bright LCD screen and bright EVD viewfinder. The image stabilization and the integrated editing software is  a real plus.  This camera will work for a beginner photographer, as well as, a serious amateur who wants some control over settings but doesn't want to spend the $ for a DSL.  I would have liked a super macro mode, but the trade off was more expense, weight, no batteries included and a smaller, dimmer LCD screen.  (Check out the Canon IS 3S or Sony super zoom) While I may not be able to photograph the texture on a bug's eye, at the end of the day, I'm really most interested in good candid photos of people.  All in all, I am very pleased with my purchase and I'm having lots of fun taking pictures.  Check out the images I have shared.  If you buy this camera, I also recommend that you download the full manual from Kodak and take the time to edit each photo with the included software.  (Note:  I have not tried the video on this camera.)7/12/2007 update.  I still love my z612 and lots of acquaintances seem to have camera envy.  I just wanted to mention that the Kodak editing software does not allow one to straighten or sharpen photos.  I am now using picasa2 by google, which is available through a free download. It has very easy photo editing capability that is easy to use and is significantly better than the Kodak version.  Google also offers a free web service for storing and sharing up to 1 gig of photos.  The best thing about this service is that your friends can download a HD version of the photos for free.  On the Kodak website, you can share photos but friends can only download a low quality version or buy prints or a CD.", "Date": "October 26, 2006"}, {"Title": "4.5 Stars for a great camera", "Author": "K. G. Schneider \"Librarian, Writer, and Booka...", "ReviewID": "RG0SA905VKG4H", "Overall": "4.0", "Content": "Update: I concur on the blurring issue. It doesn't happen frequently, but sometimes, particularly on close-ups, the autofocus won't focus no matter what I do. Then the next picture is fine. Possibly a firmware issue Kodak could address with an update?Note: only a couple of tiny issues keep this from being a 5-star review. To me, \"5\" means \"close to perfect,\" and the Z612 isn't quite there--but I still love this camera! The Z612 has all the ease of an EasyShare with features found in more demanding cameras.ProNice small size for its key features: 6.1 mexapixels, 12x zoom, and image stabilizationBrilliant, huge viewfinder--by far the best in this price rangeTrademark Kodak color--pop-out clear and beautifulButtons and switches are clearly labeled and easy to use, particularly the huge, well-placed release buttonFoolproof picture-taking, but easy to access advanced featuresEasy to transfer pictures, either with the USB cable or the optional dock (you don't have to get the printer dock; there's a $40 series 3 dock that just charges and transfers)Loaded with easily-accessed scene settings, including a separate toggle for three of the most popularAccepts regular camera batteries in addition to its rechargeable battery--though on a four-day trip where I took a lot of pictures I didn't seem to get anywhere close to exhausting the juiceConThe rubber boot covering the USB transfer port seems a little flimsyThe manual is cryptic on some featuresAs with all non-manual zooms, the Z612 zoom is a bit trigger-happyI'm not quite as impressed with close-ups such as flowers as I was with my old DX6440 EasyShare... so I thought I'd buy a close-up lens, but:To use generic 55mm lenses, you need a special 49 to 55 mm lens adapter made just for the Z612--but this accessory isn't available yet! Come on, Kodak.Still, a lot of camera, both for the cost and for the ease of use. Oh, and it's rather attractive, too--I took it to a conference and a lot of people commented on my \"nice camera.\"", "Date": "June 29, 2006"}, {"Title": "Z612 Wonder Camera", "Author": "J. Pressel \"Camera Girl\"", "ReviewID": "R25CVCQD0W7ZL1", "Overall": "5.0", "Content": "CONTROLSThe camera's controls (buttons: flash, picture settings), menu are very easy to use. The buttons are placed for easy use.PICTURE QUALITYThe pictures are sharp, clear with good natural color. The 12X zoom works in all lighting conditions. In bright sun light auto 12x works well. In low light you can use the manual or program controls with the 12x zoom. One really good feature is that once you take a picture you can use the kodak perfect touch to sharpen and lighten up the picture if you need to. You can also crop the picture.I've taken lots of macro pictures of flowers. I've even got good shots of bees in flight on the flowers.VIDEOYou can use the 12x zoom while you run the video. In low light like at a circus or party the video is great. You don't miss a detail.PRINTERYou can user the kodak series 3 printer to print pictures from your video.TVThe camera or printer dock can be hooked up to your TV. You can review your pictures to decide what you want to keep. You can show the whole family what you're taken pictures of.RECOMMENDyes, for an experienced photographer you have the ability to set the iso 800, control shutter speed, etc.Yes, for the beginner, let the camera do the work and you'll get BEAUTIFUL, SHARP picutures.You can't go wrong with this camera. By the way, it is so lite you hardly know you're carrying it.", "Date": "June 23, 2006"}, {"Title": "Outstanding, Exceeded All Expectations", "Author": "P. Morris", "ReviewID": "R3M0WSV6D5W480", "Overall": "5.0", "Content": "I spent weeks researching cameras and finally went with the Z612.  I had it two days, flipped through the manual, and headed out on vacation.  In all situations, beach, boats, planes, ships, cars, this camera took outstanding photos.  I used many of the scene settings, beach, landscape, night, sports, auto, night landscape, and the picture were great.I did not experience any of the issues reported by other users, blurry pictures or loose cap for the lens.I would highly recommend this camera.", "Date": "August 15, 2006"}, {"Title": "A Well Rounded Zoom Camera", "Author": "S Man", "ReviewID": "R3FDJN63VN2D71", "Overall": "5.0", "Content": "Overall this camera is totally worth the $400 to buy it. It takes excellent and colorful shots - both closeup and far away. The image stabilization works great, so there's little chance of blurry shots at full zoom. It's easy to use and it's super small. I bought this camera because I love my Kodak CX7430 and I didn't want to pay the money for a digital SLR like the Canon Rebel. If I had the choice to buy a zoom camera again, I'd still take this one.PROS:1. Crisp and vivid photos2. Great image stabilization3. Easy to use controls - a Kodak trademark4. Long battery life and uses over the counter batteries or the rechargeable ones that come with it.5. Both viewfinders give you a lot of versatility and the LCD screen is excellent.6. Has two video sound mics for stereo sound.7. Very small in size for a camera of this type.CONS:1. Video sound distorts at rock concerts.2. Video sound fades out when zooming in and out while recording (so don't zoom while recording is my procedure, unless you're not worried about the sound).3. Camera could be a bit faster reloading from shot to shot.", "Date": "July 19, 2006"}, {"Title": "Wonderful Camera", "Author": "Z Man", "ReviewID": "RQVOR2ZZOBRDU", "Overall": "5.0", "Content": "The first one I bought I had to send back but This camera is great it takes wonderful picture with great colors and is easy to use. I have taken picture of the moon at 12x zoom and then used the review at 8x and can see the creaters on the moon objects in motion and closeups that sold me on the camera. It's very easy to use my girlfriend never had a digital camera before and she can take great pictue with it.Well I would reccomened this camera for any one looking for a mega zoom camera that is simple to use with many extra's like many preset scene's,with  flash settings, great picture to picture speed nice low light picture's good auto focus and fit's in your hand nice and battery life is great I can go a couple weeks between charges useing the LCD screen 2.5\" nice and big.I did A lot of resarch before I bought this camera and found this was the best in price range well worth the money.", "Date": "August 11, 2006"}, {"Title": "Great and Easy to Use!", "Author": "Bope \"Oakville\"", "ReviewID": "RJ9US6DBEC5LH", "Overall": "4.0", "Content": "I love this little camera. It replaces a DX7590 that I lost (and is my 4th Kodak digital camera). I also have a Canon Digital Rebel XT and although it's a great canera as well, it's not ideal to drag along to the beach or destinations where I have to worry about it being stolen or damaged. The pre-configured settings are a good way to set up your camera for quick shots (sports, sunset, candlelight scenes, etc) and the abilty to crop the picture in camera is useful. I also have a 2 gig card which allows me to take as many pictures as I want. This also helps with use of exposure bracketing. What I like best?...screen size and quality, picture quality, ease of use. My only issue was finding a back-up battery pack...", "Date": "August 25, 2006"}, {"Title": "Check out my shared photos!", "Author": "Kim", "ReviewID": "R2MS6DTW71KS6M", "Overall": "5.0", "Content": "I have had the Z612 for a month now. I decided to look it up on amazon and see what reviews it was getting. I was surprised to see the few shared photos. I love my camera and decided to add some of my own that I have taken in the last month. I read all the reviews and agree with them all. I didn't want to bore anyone by repeating everything... I just wanted to let anyone that's looking for a high performance/zoom camera to check out my pictures. They are mostly of my dog, yes. But it shows the speed quality and clearity of this camera. Also the videos are excellent and very clear with great sound quality (with the exception of zooming while filming). I would recommend this camera to experts and beginners (considering I'm relatively new at photography as an art). Thank you!", "Date": "August 17, 2006"}, {"Title": "Great camera with one flaw", "Author": "firechill", "ReviewID": "R1K1XL8LYWPFW5", "Overall": "3.0", "Content": "The Z612 is a great camera but has one minor to moderate flaw depending on the user.  All-in-all the white balance sensor does not function properly.  I ended up exchanging it for another one because of this problem, but the second also had this problem.  Best Buy said this model is known to have an inferior white balance sensor.In indoor lighting conditions, sometimes the LCD tends to look very yellowish. so yellowish that its hard to determine whether or not the picture will come out ok.  The strange thing is that on both of the cameras i tried, the pictures come out fine and it seems to just be the LCD that has the yellow tint.Overall, i am still satisfied with the camera because the pictures come out great and movie mode is fine.  If a yellowish LCD is something that will bother you, you may want to consider something else..", "Date": "December 21, 2006"}, {"Title": "Easy to use", "Author": "H. Cushing", "ReviewID": "RKCIZTYF1OLBV", "Overall": "5.0", "Content": "My Z612 is very easy to use and I am terrible with cameras! Digital is the best for me because I need the option to erase the ones that don't come out the right way. It takes great pictures, especially wildlife, hummingbirds, butterflies etc... Also great for pictures of kids who won't hold still.", "Date": "November 20, 2006"}, {"Title": "Solid camera for most photographers", "Author": "JP", "ReviewID": "R25CXUCIDKGL62", "Overall": "4.0", "Content": "This camera can take good photographs worthy of 11x14 enlargements, maybe larger and should take great 6x4 photos for just about any situation.It has a wide variety of options for creative control, but has fully automatic 'everything' for those not able or willing to make any decisions.The 12x zoom is both one of the cameras strengths and weaknesses. The zoom lets you get close to far away objects, however the temptation to 'overuse' this feature is strong. At the highest magnification one needs fairly high shutter speeds even with the image stabilization to avoid blur. I also found that at the most magnification the lens quality was a little suspect and images were a little 'muddy'. Maybe once summer comes round with much more ambient light the lens will do better. Time will tell. Image stabilization is of little use if one is 'tracking' a moving object. I wish Kodak had put an on/off switch for the image stabilization on the camera, the control to switch it on/of is deep in the menus. Turning off the stabilization is essential for tripod use as is the case with all IS cameras. With the 12x lens Tripod use is very beneficial, the Image Stabilization is good but not good enough for enlargements.Colors are acceptable in most circumstances, I found the colors on the Kodak DX6490 to be better in a wider range of conditions.The dial to select shooting mode works very well and is a vast improvement on some of the older Kodaks. The 'jog' dial is well positioned compared to other Kodaks. The camera on/off switch is well positioned.The LCD is large and bright making picture taking/review easy. In bright daylight you'll be forced to use the viewfinder, but the viewfinder is pseudo TTL so it is a very good substitute.I did find the viewfinder awkward to use. It is almost flush with the camera back so with glasses on it is difficult to see clearly into the viewfinder because your nose butts up against the LCD first. Older Kodaks are better. The zoom control is difficult to use if you use the viewfinder at the same time, it's too close and your check which prevents your thumb getting to the zoom out. I also found the zoom control a little too quick, it is very difficult to frame photos using the control without 'overshooting' one direction or the other. The DX6490 was much better and had a better zoom control to boot.The ability to use rechargeable batteries or standard CRV3 lithiums is great! However the rechargeable batterries are proprietary. Kodak made a change to the battery contacts for the rechargeables and generic rechargables from Radio Shack will NOT work - I had to return one. Buy only rechargeable batteries that are designed for this Kodak camera. Despite the battery saving features of the camera the batteries do seem to run down more quickly than other Kodaks. The camera comes with a plug in battery charger, an improvement over older models. I recommend the purchase of the camera dock for both charging the camera and downloading photos to your computer. This saves having to open the battery compartment to either charge the battery or retrieve the memory card. Use the Kodak software to download the photos and then use other software to enhance your photos.As with all Kodaks the Macro feature sucks. Purchase of the lens adapter and some screw on macro filters overcomes the limitations. The lens adapter used with a skylight filter also protects the lens against bumps and dirt. The adapter is only $15 so is an essential add on IMHO.The scene modes are very comprehensive and seem to work well, making many decisions for you.One can take up to 8 photos in burst mode, but I found that the image in the viewfinder freezes for a longtime making tracking of a moving object very hard. Once the burst is over you can't use the camera for 30-40 seconds while it writes the photos to the memory card. If you need burst mode a lot, don't buy this camera higher end cameras do this much better.One annoying feature is that in AUTO the camera always fires the flash in low light situations, it cannot be turned of as a default, each time you switch the camera on the flash may fire. This may not be OK inside buildings, museums etc. I found the best way around accidental flash is to leave the camera in 'program mode'. Program mode remembers the last flash setting used in that mode, which is typically off for me. I can switch to auto if I want flash.  I tried using an auxiliary flash unit with a slave, but the two flash units confused each other resulting in dark photos. Fortunately the built in flash illuminates a medium sized room quite well, so auxiliary flash is often unnecessary as is the case with previous Kodak models.One can override the color control to cope with flouresent or incandescent lighting, but that's about it, more white balance options would be nice.Picture review is easy and has a great 8x zoom to examine the suitability of taken photos. I don't understand why Kodak make such a big deal about the favorite and 'share' features and devote some many buttons and menus to these valueless options.Self timer options are great with both 2 and 10 second delays and also a 2 photo delay feature, just in case someone blinks at an inopportune moment. I wish you could combine self timer and exposure bracketing to make sure you got a good photo when away from the camera. Alas you can't, a very small drawback.I was disappointed that 6 mega pixels doesn't show a big improvement over 4 mega pixels I had before. Well I learnt my lesson there. Don't buy for mega pixels, buy for features, ease of use and other capabilities.The focusing system is quick and accurate, a vast improvement over other Kodak cameras. The manual focus sounds great but I found in practice it is almost impossible to use accurately. The three focus modes are better ways to overcome any focus problems you may throw at the camera.The best of all feature of the camera is its ease of use. Unless you are a budding professional or sports photographer this camera will meet almost all of your needs. The easier it is to use, the more photos you can take and better ones too, because you don't waste time struggling with a complex setup.I like it. As a long time Kodak DX6490 user I found it to be a good upgrade, but not as good as I had hoped. At the current price of just over $250 I can't really be too disappointed.", "Date": "December 30, 2006"}, {"Title": "i love this camera", "Author": "Carolyn L. Sinacola \"nuangel1\"", "ReviewID": "RYF49JCXIGULW", "Overall": "5.0", "Content": "i have had another kodak camera for 3yrs and while i enjoyed it i am now traveling more and wanted a camera with a more powerful optical zoom.after having researched different brands ,prices etc i decided to buy a kodak.i chose the z 612 because it had the 2.5 inch viewfinder ,6 megapixels ,12x optical zoom with image stabilization.i just recieved it today about 3 hrs ago.i love this camera .it is easy to use ,the zoom works well and quickly.the pictures are very crisp even at full zoom .the image stabilization works well .since i already have kodak software it was easy to upgrade my new pictures that i took today .you also can't beat the price for this quality camera.i am looking forward to taking more pictures with the z612.i would definitely recommend this product to the beginner or more experienced photographer .", "Date": "October 26, 2006"}, {"Title": "Nice & Easy Camera To Use", "Author": "Optics Planet Wripped Me Off \"Mastro\"", "ReviewID": "RPF0ZLLRB3GA6", "Overall": "4.0", "Content": "After much research and forum hunting [...] I decided on this camera for my parents. I went with the Z612 because it is simple to use, has a big lcd screen and has image stabilization. My parents are seniors and are not technologically advanced. They do not have a computer and this is their first digital camera. The set up menu is straight forward and very easy to understand.I set up everything before I gave it to my parents and took several shots. Great quality pictures! Especially on the fine setting.  The lens quality is outstanding (for the price) and image stabilization corrects for hand shake (great feature for the senior crowd). I have a digital SLR camera and was still impressed by the quality pictures this camera took...and it cost about a third of what I paid for my camera and is about half the size. The 12x lens is fantastic!The reason I gave this rating a 4 and not 5 is because the product manual that comes with it is a \"getting started\" manual...you have to go on the internet and download the full manual. Also, each time you charge the battery you have to reset the clock and calendar.", "Date": "December 26, 2006"}, {"Title": "Excellent, Easy-to-use, Long range zoom Camera.", "Author": "Mr. R. R. HERMAN", "ReviewID": "RGZC3CY5LD0QN", "Overall": "5.0", "Content": "We have had this camera now for a few months and are pretty pleased with it after a few hundred pictures taken.  Our prior camera was a Kodak DX7440, and when it died, we replaced it with the Kodak Z612.  The camera is easy to use, and not too large considering it is a high (12x) zoom camera.  Battery life is good.  It has a HUGE screen.  Some dislikes are the digital viewfinder, which doesn't have great picture quality, and a tiny bit more shutter lag than our last camera.  BUT - the high zoom and other attributes cancel out those problems.  One of the best features of the Kodak Easyshare cameras is the ease of use with the Easyshare Computer program that comes with the camera.  It makes transferring, editing, downloading, and sharing pictures a breeze!  I have made over a dozen photobooks with this software and then also using the Kodak Easyshare (OFOTO) website, and get highly commended by everyone that sees those books.  I owe a lot of the credit to KODAK!!!  ANOTHER HUGE ATTRIBUTE for this camera, which most Kodak's don't have is the image stabilization, which is built in!!!  IT HELPS TREMENDOUSLY!!!  I would buy it again!", "Date": "July 5, 2007"}, {"Title": "Digital Powerhouse", "Author": "S. Kessler", "ReviewID": "R2CZGY1VHPOJPJ", "Overall": "5.0", "Content": "I've had this camera for almost 2 weeks now--and so far I just love it.  I bought it to replace a 4-year-old Minolta Dimage digital, which while it took good pictures was clearly outmoded, had a small screen that was unusable in daylight, an inadequate rangefinder viewfinder, and lousy battery life (even with Ni-MH rechargables).  So I was ready for something new and more advanced.After doing lots of homework reading specs and customer reviews, I settled on the Z612 Kodak.  What initially attracted me was the 12X zoom, which I couldn't be happier with.  But the other features are equally good.  The LCD screen is spectacular and I can't say enough for the electronic viewfinder, which is bright and clear (I generally am used to the \"put the camera up to the eye\" mode of picture taking, so I love the EVF).  So far I've only taken photos indoors, mostly of my cats and husband, (which means with flash) but they have all come out sharp, clear, and with terrific color.  After finally figuring out how to work my fancy-schmansy HP photoprinter, I printed several 4X6 prints in 6 mp that are now hanging above my desk and are just amazing.  I can't wait to get this thing out of doors.I love the different shooting modes.  The controls are very intuitive and easy to reach with the right hand while I have the camera up to my eye.  The symbols for each function and mode in the viewfinder and LCD screen are easy to read and understand.  I'm still learning, but have recently figured out burst mode, which will be great when I'm shooting from moving boats in Switzerland this summer.So far battery seems find, but I will have to do more shooting to find out how long a charge lasts.  I love that the battery and charger were included in the package.  That's $20-30 right there in savings.My only quibbles, not enough to downrate the camera is that I wish they'd included the full manual in the box.  I had to download 90 pages and print them on my computer, which was a pain--and a waste of paper and ink.  The little start-up manual that comes with the camera is not all that helpful, not to mention that I misplaced the English version and had to try to read the Spanish version.The only other complaint is that the manual and website contains little information on what kind of memory the camera needs and how much it can handle.  I took a leap of faith and bought a 2GB SD card, and, thankfully it works with the camera, but I had little to go on.And finally, the price on the Kodak z612 cannot be beat -- in fact it was nearly half what I paid 4 years ago for the Minolta and is at least twice the camera.All in all, I love this camera.", "Date": "June 15, 2007"}, {"Title": "Kodak Z612 - my new camera!", "Author": null, "ReviewID": "RAG5HXBTCNVW7", "Overall": "5.0", "Content": "I've been looking for a camera since I went on a trip for spring break about 3 weeks ago. I saw so many good picture opportunities but only had a cheap winding camera that you get at gas stations and my brother's small digital camera (he would hardly let me use it). In the middle of the trip while I was trying to sneak my brother's camera away from him I realized I should get a digital camera...For three weeks I've been reasearching and researching and that really gets old so it was a real relief to finally get this camera and see that it's actually a good one.  The first picture I took made me nervous because it turned out really dark - I had read some other reviews that said all the pictures were way too dark. Then i turned on the flash and I said \"What kind of idiots are these people?\" It seems like it should be common knowledge that if a picture is dark you turn on the flash! - I'm 13 and I can figure it out.But anyway I thing this is a great camera. I took a picture of a flower on my dogwood tree using macro (don't zoom in while using macro, the camera won't focus if you do) and it turned out great. Then I cropped out the flower from the picture ( on the camera!) and the quality was amazing. I had thought that surely this on camera cropping is gonna make the picture have fuzz, but it turned out great.I don't like the electronic  viewfinder too much ( the quality of the screen isn't very good), but it's great when you need to hold the camera really steady like on long zoom shots or close-ups.I got this camera on sale for 200 bucks. I was sorta nervous about buying it but I thought \"Hey, it's got a 2 week return policy, I'll take it back if I don't like it.\"  I'm definitely not taking this back unless it breaks.I was also impressed with the size of the camera and how it actually looked in person. Even though it's a full sized camera it's still fairly small and it's light but sturdy.  If you take test pictures in the store you will not get good results simply because the inside of an office store is downright boring. Buy it, take it home, and take some test pictures with it. If the results seem bright or dark then mess with the flash and try the touch up thing on the camera, it really helps. It's really important that you take it home to take some test pictures - you can probably take it back depending on the store you're at.I think this camera is great - especially for the money! I was about to get a Sony DSC-H2 but at the store I thought the image quality was terrible! I never got to test the H5 but it was too expensive anyway. The Canon PowerShot S3 IS seemed alright but it took 4 batteries as opposed  to 2 and it was too much maney for me. Panasomic's Lumic DMC FZ7 or 8 both looked cheap to me so in the end I took this camera.", "Date": "April 7, 2007"}, {"Title": "Very happy", "Author": "Joseph Andrews \"Go Joe\"", "ReviewID": "R1RDEWTU29Y18Z", "Overall": "5.0", "Content": "I'm very pleased with the Z612. I think it is the best deal available in a super zoom. Aside from price, I think it's strong points are:1) It starts up and takes photos very quickly.2) It has good image stabilization.3) The electronic view finder is very bright, and particularly nice if you came of age with 35mm film SLRs.4) Very good image quality and color (fine mode is best and the \"high color\" setting for really vivid images)5) a zoom with a wide angle that reaches as low as 35mm (equiv.)6) The focus zone system let's you know in advance of the shot the exact points where the camera is focussed7) It is easy to switch and use the shutter or aperture priority modes.8) Great battery life and you have the ability to buy a battery that fits at most drug stores (even though it does NOT take AA.) if you run out of juice at a bad time.9) Good movie mode -- limited only by the size of your SD Card -- although zooming during a movie means a brief period when images are out of focus. Then again, other cameras won't let you zoom at all during movies, so...  Do, however, expect background noises as the autofocus operates.I've not, admittedly, had the chance to use other superzooms (like the Canon S3-- Kodak's obvious target) so you will have to ask yourself it's worth the extra $100. A comparison of their specs suggests they are very near to one another (e.g. in lens speed and focal length.)", "Date": "May 6, 2007"}, {"Title": "Best camera I've ever owned.", "Author": "Danny R. White Jr. \"The Sleuth\"", "ReviewID": "R4W2WAX3ODMMU", "Overall": "5.0", "Content": "So far, this is the best camera I've ever owned. I chose it over the Kodak z710 because not only did it have a more powerful zoom, 12x as opposed to 10x but the view screen was much bigger. 2.5 inch compared to 2 inch. It doesn't seem like much but that's a big difference in view screens. Also, this one came with a rechargeable battery and charger. The z710 didn't. It's extremely easy to focus and taking pictures with it is a breeze. The battery holds up for long periods of time. My old camera batteries didn't hold up near as long and it was only a 3.2 megapixel camera. This camera definitely offers a lot of bang for your buck. I would buy again in a heartbeat!", "Date": "March 7, 2007"}, {"Title": "Very detailed pictures", "Author": "Kaedy", "ReviewID": "RX9ZP7Q6Y119D", "Overall": "5.0", "Content": "I purchased 5 of these cameras for our Police Department.  They have been raved about every since.  This camera is a big large but the trade off is there isn't anything or any place this camera can not capture a great picture.  From fingerprints to fast action shots this is the camera for you.  Our department has really utilitzed this camera and the battery life is amazing.  Even if it runs out of juice the charge up time is quick and it is back on the job.  I really can't express in this amount of space how much this camera will surprise you.  The quality of the picture is just amazing.  As you can tell I wish I had one of these myself.", "Date": "June 7, 2007"}, {"Title": "Very good camera", "Author": "R. Russ \"MoneySpender\"", "ReviewID": "R2KZ2Y9USO0Y1X", "Overall": "5.0", "Content": "I purchased this to replace an Olympus camera that was pretty much junk from the day it was new. I was hesitant about Kodak because some of their earlier cameras were complicated and hard to use.I wanted to buy a camera to use for product pictures for business and for use for family photos, vacations and such. My previous cameras have been used only for product pictures because the image quality was fair at best. The prints made from the digital images were not of photo quality in my opinion.The Z612 was a pleasant surprise. It is easy to use, controls are fairly simple. You do not need an engineering degree to use it. Screen is bright and fairly easy to see even in bright light. The quality of the pictures is great. Zoom is fantastic. The auto focus is a wonderful feature that actually works very well.The bad - the \"easyshare\" software pretty much hijacks all of the images on your computer. It installs it's self so that it automatically starts when you boot your computer, changes all of the image icons to the easyshare icon. It does not offer many options for installation or operation. It appears to work OK but it is more of a problem than a problem solver for advanced users. I personally use Photoshop and do not want other generic software trying to be the dominate image editor.The camera should come with a memory card as well as the internal memory. At this time the memory card is sold seperately which adds another $ 30.00 to the price of the camera.Camera comes with a neck strap no wrist strap. A wrist strap would be a nice addition to prevent the camera from making it all the way to the ground if it was dropped while in use.Overall it is a great camera and a great value. I have other digital cameras that cost three times as much that are virtually useless.", "Date": "March 28, 2007"}, {"Title": "Wonderful camera!", "Author": "Kendra Gehring \"nursing student/mama of 2\"", "ReviewID": "R35EOT9PPUXP5V", "Overall": "5.0", "Content": "Earlier this summer, my husband and I decided it was time to replace my digital camera (a Kodak DC280, bought in 2000), so we were unofficially looking.  We stumbled across a good deal on a Kodak C643 and printer dock and thought we were getting a good camera.  To cut to the chase, the C643 just wasn't the camera that we thought it was (my 6-year old 2 megapixel DC280 took better pictures!), so we unofficially started looking for something better.I started reading up on cameras and saw good things about the Z612.  What really caught our eye was the image stabilization, as that was one of the problems with the C643.  We also wanted the zoom capabilities and higher quality lens, especially since photographic events don't always occur right in front of you.  We took a look at a Z612 in a store and were very impressed with its performance.  We shopped around online, found a great price, and bought one.  We've not been disappointed.This camera has so many amenities - on screen cropping and editing, tons of different shot options (night shots, action shots, close-ups, etc.), and more.  We've tested it out in poor situations - long distance shots in very low light, moving subjects, extreme close-ups - and the pictures have turned out perfectly with no blurring, no fuzziness, no darkness.The only \"complaint\" I have - and it has nothing to do with the camera itself and does not affect our very high opinion of the camera - is the owner's manual that comes in the box is *very* basic.  My husband went to the Kodak site and downloaded the unabridged manual, which contains a lot more information on the camera.  Not a big deal, but it would be a bit more convenient to not have to run to the computer when we want to read up on the camera's options.I wouldn't hesitate to recommend this camera to anyone!", "Date": "January 6, 2007"}, {"Title": "a superb camera !", "Author": "Andrew Lubin \"author of Charlie Battery; A Ma...", "ReviewID": "RL1VU6IE3ASAA", "Overall": "5.0", "Content": "I researched a lot of cameras with 6+ megapixel and 10x-or-greater zoom, and this camera was the best of the lot ! Easy to learn to use; it's got a point-and shoot style that makes it simple and easy to shoot good picts or video, and then download, and distribute. As a journalist and writer who is about to leave again for Iraq and Djibouti, I need a small camera that's easy to use, and with a lot of moxie - this is the one !", "Date": "December 31, 2006"}, {"Title": "Overall great camera", "Author": "kaydubya", "ReviewID": "R3D1XBS56XGWJK", "Overall": "4.0", "Content": "I've had this camera for over 6 months and have taken more than 2000 pictures with it. I have taken some phenomenal pictures with it, and some that were just awful. If I had to guess, I'd say that better than 90% of the pictures have turned out great, with the remainder being either blurry or too dark.Over time I have learned how to get the best results with this camera. I can't stress enough the importance of taking more than one picture of any given subject (if you have the chance). As I read elsewhere on the web, professional photographers always snap multiple pictures of a subject; that way, they will have plenty of good pix to choose from. I almost always take several shots of my subjects, even if it's something that's not moving. If you can afford it, get a BIG memory card (like 1GB minimum). From what I can tell, the prices on memory cards have really dropped in the past 6 months, so you really shouldn't have an excuse!Another thing you should experiment with if you get this camera (or if you already have it) is turning the flash off. I was amazed at how much better some of my pictures turned out when turning the flash off. I guess I assumed that the camera wouldn't fire the flash if it was already bright enough, but I was wrong!Pros: GREAT pictures (most of the time); Big LCD screen; fairly intuitive controls (especially if you are like me and generally use the \"auto\" feature); dedicated \"Delete\" button (if you snap a picture and you know right away that it's a dud, just hit \"Delete\" and confirm that you want it gone); image stabilization (although since some pictures turn out blurry, it must not always work); long battery lifeCons: shutter lag; noisy zoom/focus when shooting videos; grainy indoor video; no option to turn on the camera and just review pictures without having the lens pop out (not sure of the technical term there); occasional dud picture (blurry or too dark); poor pictures in low light conditions; no option for a hot-shoe flash(A note on the shutter lag -- I have actually gotten some GREAT pictures thanks to the shutter lag. If you have pets, as I do, sometimes what the camera actually snaps is better than what you originally wanted to capture. It's rare and probably shouldn't be a selling point, but sometimes you have to look on the bright side!)Overall, I really do recommend this camera. It has some flaws, but I think the budding enthusiast (like myself) will do well with it. I think it's a good choice for people who are ready to step up from taking simple snapshots with their cameras but don't need the power of an SLR. Buying an in-between camera like this can help you decide whether you will get into it enough to justify upgrading to an SLR someday. I DO NOT think this is a good camera for someone who is a high-end enthusiast or a professional. If you really know a lot about photography (like you know all about exposure and F-stops and ISO and all that) then you'll probably want to move on.", "Date": "April 14, 2007"}, {"Title": "Easy to use takes good pics", "Author": "M. Moody", "ReviewID": "R28GK86LEYIOF3", "Overall": "5.0", "Content": "I loved 35mm photography and used a Nikon for years. I just wanted to take pics without all the hassels have the convenience of auto focus. The camera has been simple to use, has good documentation and the software for downloading the pic to your computer works very well. There is also a docking station that you can purchase that will automatically download your pics as well as recharge the batteries. I really like this camera and would recommed it for folks who like taking pictures and are somewhat particular about their pictures and the quality of their shots.", "Date": "July 27, 2006"}, {"Title": "I love my Z612!", "Author": "A. Meyer", "ReviewID": "R39IZNLNMGY8KS", "Overall": "5.0", "Content": "I upgraded to the Z612 from a Z740 and I am so glad I did. I wanted the Image Stabilizer and the use of the histogram feature. I am very impressed by the IS (very few blurry images). I have taken well over 500 photos in the 2 months that I have had it and the majority of them have amazing color and clarity. I love the manual control functions and the ability to control how strong the flash is. There were a couple of people that said it takes horrible indoor pictures, but I think it is the user, not the camera because I haven't had any problems with my indoor shots. I always adjust the flash compensation in the P mode before taking indoor pics with flash. I recently bought the a HD 10x macro lens for this camera and I am now able to take some pretty amazing macros.  My only complaint with this camera is that there isn't a hotshoe or pc sync to allow for the use of a variety of external lighting. However, I did spend far less than I would have had I bought a camera with that option, so I am 100% happy with my purchase. I am not sure why people think Kodak is crappy considering they are one of the older camera manufacturers still around. Every Kodak I have ever had, took amazing pictures.", "Date": "May 22, 2007"}, {"Title": "Great Camera - Excellent Value", "Author": "Devin H. Wiesner", "ReviewID": "R28AD5VUUBZES0", "Overall": "5.0", "Content": "After researching digital cameras for about two weeks I decided to purchase the Z612 based on the consistent very good reviews on photo sites, Amazon and CNET.  I believe this camera is one of the highest rated cameras (by users) on all of CNET.  I'm very happy I purchased the Z612.  The picture quality is great.  I love the 12x zoom with image stabilization and have utilized most of the many features and options.  Further the battery life appears to be very good as I have never run out of \"juice\" while shooting photos.  This is the third digital camera I have owned and the best.  Excellent value for the money.", "Date": "February 3, 2007"}, {"Title": "Amazing!", "Author": "Sabah K. Hussain", "ReviewID": "R1LG5JHVL3RBH1", "Overall": "5.0", "Content": "I ordered my Kodak Z612 a few weeks ago here on Amazon. So far I'm really happy with it. The colors are brilliant, focus is pretty spot on and the zoom is simply amazing. I've still got to sensibly fool around with the manual settings (meaning that I've already done some random fooling around with interesting results).Keep in mind this is not a pocket fit and is aimed towards people who take their photography seriously or are developing a serious interest in this field.The screen is a major fingerprint magnet and I now regret taking off the thin plastic sheet over the screen. Another negative I noticed is that during video recording the mic picks up a lot of sound from the zoom motors and that there is substantial blurring while you are zooming during a video shoot. I'm not sure if these are standard problems that come with video recording with digicams but its not a major issue for me; since I only use it to shoot 1-2 minute clips of my son. I also turned off the Continuous Focus option in favor of One Time Focus since the lens would constantly be adjusting and readjusting and making sounds at every slight movement and it would no doubt be the source of major battery drainage.The zoom on this thing is awesome and image stabilization plays a major role at 12x zooms; in fact it would be pretty useless without it.All in all its an excellent camera. Just make sure you purchase a 1gb SD card to go with it (if not more) and a camera bag since it doesn't come with one.", "Date": "February 1, 2007"}, {"Title": "Good, but could easily have been better...", "Author": "Helcio Mello", "ReviewID": "R285NTGFAYWDR5", "Overall": "4.0", "Content": "I have this camera since Dec/2006, and my overall opinion is that it does its job fairly well. However, there are some little details that, if fixed, could make it even better. Here they are:1. You can't change the optical zoom settings while making videos.2. Optical zoom is set up by pressing a button, instead of the ring used in manual zooms which allow precise control over the magnifying.3. Fotos get rather dark in automatic mode when environmental light is poor and flash is not used. While this sound an obvious limitation at first glance, some cameras due to other manufactures are claimed to perform better at this point. However, I did not purchase any of them to check this information.4. When shooting in continuous mode (i.e. two shots are taken per second while shutter button is pressed), the maximum number of photos in a row does not increase when I select lower resolution (eg. 3 MP). Note that at lower resolutions each photo takes less memory space, therefore allowing more of them being made in a row.A good point of this camera seems to be its price, if compared to similar ones out there. So, unless the customer wants something closer to perfection, I would recommend this camera.", "Date": "January 14, 2007"}, {"Title": "great for the money", "Author": "CelticBrewer", "ReviewID": "R8KFMRKFXRSIQ", "Overall": "4.0", "Content": "I bought this as a replacement to my last Kodak which I loved. I just happened to destroy it- oops.The 12x zoom is awesome. I took a crisp, clear picture from across my workplace- about 200+ feet to the other side.What's on the screen is usually not what ends up being taken. That's kind of a bummer, but in general, the actual photo comes out a LOT better than what is on the LCD.People have complained about the macro mode. At least a third of my work is macro photography, and the camera itself did really well.  Even so, I bought the adapter and macro lens ($30 total) and it's even better! This will revolutionize what I create.To the last reviewer, there IS an incandescent option and my CCD has no dead pixels.This camera has a lot of options, and it'll take some time to find/learn them all. But the auto mode will get casual picture takers up and running in no time. The manual that comes with the camera is pretty brief. You need to get the full manual (pdf) off of Kodak's website.People in motion tend to be blurry. I've tried it with img stabilization on and off. Sports mode seems to take care of the problem. If you're taking pictures of someone walking or anything faster, try sports mode.Taking movies really stinks. The camera is continuously focusing and the soft clicking ends up on the film. If you even try to zoom in out out, that sound is unbearable. Movies are only good if you plan on stripping the sound out and adding music or a voice-over via a movie editing program. Thankfully, I don't take many movies with my camera.Overall, I am happy with this camera and wouldn't trade it for anything in its price range. Yeah, I'd like one of those $900 digital SLRs one day, but not yet...", "Date": "February 28, 2007"}, {"Title": "A Wonderful Camera", "Author": "Jay C.", "ReviewID": "R2ANSM514SNCAV", "Overall": "5.0", "Content": "Bought this camera for my wife because the price was decent, it looked cool, and had good features. It has far exceeded my expectations. Has all the options most people could want and then some. The battery seems to go on and on without re-charging. Had a similar-featured Sony before. We liked it but the auto-focus quite working twice. The first time it was under warranty. The second time they wanted $200 to repair. No more Sony for me! People I know with Kodak cameras have been very pleased so that inspired me to try this one. Sure glad I did. It's a superb camera. Now that my wife has one, I want one for myself. Buy this camera with confidence. It's a real winner.", "Date": "May 25, 2007"}, {"Title": "This camera is very dissapointing!", "Author": "dave", "ReviewID": "R2LC2QB3IABWBQ", "Overall": "1.0", "Content": "This is quite possibly the worst camera I have ever used, in fact it's SO bad I had to write a review (and return it.)  In short, if you enjoy getting natural low-light shots without a flash, you will HATE this Kodak camera.I was blinded by the specifications, MPEG4 video, 6MP imager, 12x optical zoom with image stabilisation, very light weight, large 2.5\" high resolution screen.  Sure, it all sounds good on paper, but it appears that Kodak didn't put the pieces together correctly, which really is a shame because it seems that a firmware upgrade would be all that is required to fix the following problems.To begin with, this camera can't focus correctly in low light (without a flash), so you have to take the shot over and over just to get it right, if that's even possible.  I've taken an identical shot with a Canon S1 and a Sony H1 and can read the label on a bottle of wine from across the room, not so with the Kodak.Second, what you see on the display before you take the shot is NOT what you get as a picture afterward.  For some reason, the camera gains up the screen correctly so that it looks right, however when you snap the picture and review it, it's always dark/underexposed!  And the camera KNOWS it's dark, because when you go to the built function to fix your pictures, the camera always brightens them up (which is not a good option as this adds noticeable artifacts.)  I've tried every mode to let the camera control the exposure and it just doesn't work.  Overriding the EV seems to help (although then it doesn't look correct on the screen anymore), and with manual mode you can control the shutter, but in the end it's just a guessing game.  With the Canon and Sony they can figure the exposure correctly so that what you see on the screen is what you get in the picture.  If I couldn't get ANY camera to take the shot correctly then I would think this was my problem, however the Kodak is the only camera that I can't make work, and I've had several Canon's and Sony's over 4 years now which work as expected.  If this was the only thing wrong I might have kept it, but poor exposure coupled with bad focusing just pushes it over the edge.Third, it has a LOT of dead pixels on the CCD (this may have been just my camera.)  This is just flat out a quality control issue.  They mainly show up when I gained up the EV of the image.  Take a pure black picture (put your hand over the lens) and gain up the EV to maybe +2.0 and when you review the picture, zoom all the way in and scroll across the screen... mine looks like a starfield!  I've taken this shot a few times and it's always the same pixels.  It seems that possibly Kodak is cheating when you boost the EV and electronically gaining up the image vs. lengthening the exposure by keeping the shutter open longer (which should be a function of the ISO and not the EV.)Fourth, very few options for white balance.  Fluorescent, sun, shady sun and flash ... that's all.  No incandescent?  No custom?  Good luck on getting your colors to come out correctly.  We're plunking down $200-ish for this camera, we should be getting pictures that are superior to film!  Both Canon and Sony have a custom white setting which work great for all situations.I'm not sure how this camera got such good reviews, however it seems to be from people who don't ask a lot of it or are always shooting outdoors in bright light or with the flash.  If this is you, then the camera is probably fine, but wouldn't you rather get a camera that can take better pictures in more situations?  I'm not saying to get an SLR, but rather I'm suggesting that you look at the competition, do a little research and test the cameras.The thing I love about digital photography is that it's BETTER than film!  4x6 prints look better than 35mm film, and the color is always more true.  You should be asking a lot from your camera, and it should be delivering.P.S. I thought that maybe I had a bad camera, but I went and tried one at Best Buy and had the same results, and their store was even brighter than the room I was originally testing in.  I also tried one at Target with the same outcome.  It just makes me sad that Kodak seems to have all these great pieces but can't put them together in a quality package.If someone has found a way around these problems I'd love to hear it because I still can't believe this camera is that bad.  PLEASE try it in the store first, and try a Canon and Sony as well.Some tips for great shots:Set the lowest ISO possible within reason to get a clear shot, the higher the ISO, the higher the electronic gain from your camera and the more noise in the picture.The higher the mega-pixels is not necessarily the better the shot.  A lot of times the same basic camera with an 8MP or 9MP imager, both imagers will be the same size, and the 9MP imager will have more noise making it equivelant to the 8MP imager.  Also go with image stabilisation, Canon has the SD800 with image stabilisation and the SD900 without.  If you get a blurry shot with the 9MP camera you have just effectively reduced your resolution most likely below the 8MP, so go with the SD800 with image stabilisation.  Besides, if it's noisier anyway, you now have a larger image file with more noise.To get a brighter picture, set the exposure longer or turn up the EV.  On any decent camera you'll also notice this change on the display as well as the final picture.To increase the depth of field and get more things in focus, raise the F-stop (this will let in less light, and nothing comes for free so the camera will have to have a longer exposure to compensate), lower the F-stop to keep your main subject in focus but make everything else out of focus.  You can see an example of this by squinting, put a printed page in front of you too close to focus, then squint and you will notice that the text comes into focus, the camera is doing the same thing.Set the custom white balance for your current lighting condition.Set the camera for the highest resolution (MP of the camera) and minimum amount of compression (usually fine or super fine.)Zoom into the picture after you have taken the shot to make sure it came out in focus.", "Date": "February 26, 2007"}, {"Title": "Wonderful camera", "Author": "Gerald J. Winship", "ReviewID": "R3N1B49NZUL1RE", "Overall": "4.0", "Content": "This camera is lightweight and very easy to use. It has so many features that I haven't had time to learn about all of them yet. Unlike several other cameras I've had this one has controls that are much easier to get to.I'm enjoying this camer immensely. The picture quality is terrific.", "Date": "August 9, 2007"}, {"Title": "Excellent & Easy to use", "Author": "D. Johnson", "ReviewID": "R3UPM3FAGL29DT", "Overall": "5.0", "Content": "After trying my daughter & Son-in-laws camera I knew this was a good deal.  Better yet, having bought it here online, I got an even better deal than they did when it first came out.I use this for pleasure, (vacations, etc), and professional, (real estate - listing photo's), and it works great.  Easy to use, and the pictures usually turn out perfect, (unless I move too much on max close up shots, then use a tripod which helps to minimize any blur).Great deal as an entry to mid level digital camera.  Get the 2g card and you'll have more room than most will ever need.", "Date": "June 26, 2007"}, {"Title": "Love it", "Author": "Sue \"R.N. M.S. N.P.\"", "ReviewID": "R27IJL2FYZTLDV", "Overall": "5.0", "Content": "Great pricezoom is excellenteasy to use even for non camera buffs like meclarity is beautifuldifferent scene options deliver great pix: \"snow\" captured each flake and a great shot of my daughter in the snow with fantastic color. portrait setting gives perfect detail-you feel like you can reach out and  touch the subject in the photobattery life is very long- I have been using my camera for a month and have not had to recharge!Settings are so easy to use that you actually use all the different options to get the best photoI bought a 1 GB memory card, so I don't know how many photos you'd hold without that.I use with Adobe Photoshop, and uploading is a snap.I have owned some expensive cameras, but this is by far my favorite.I really can't think of any negatives. I am really happy I researched a lot of cameras and bought this one.", "Date": "March 30, 2007"}, {"Title": "Imprested:", "Author": "D. Boots", "ReviewID": "R4B6BDDVDIHXJ", "Overall": "5.0", "Content": "I have had this camera for about 6 months. I'm overly impressed with the easy of use with the preset options dial on the top of the camera. I download two pictures (view in download area) one of water drops from downspout stop in mid air (just setting dial on auto sport mode free handed) and 12 X zoom of the radio tower in the background, approximately ¼ mile away. The video mode with room lighting is very good, and a nice option for those moments when you forget or don't have the video camera.  As with any camera non flash shoots with low lighting require a tripod and still subject or you get motion blur. But then again if you don't like the picture delete and shoot again the cost advantage over film cameras. Also bought spare battery because of previous experiences with digital cameras, haven't had to use even during a shooting session Christmas of over 30 min video and 50 plus pictures.", "Date": "February 5, 2007"}, {"Title": "Almost, but not quite...", "Author": "C. A. Schaller \"Crafty CAS\"", "ReviewID": "R2L1TMMIE65PP4", "Overall": "4.0", "Content": "I was specifically looking for a camera to use for photographing my daughter's soccer games.  I was upgrading from a Kodak dx7440.  I wanted good optical zoom (which at 12x is outstanding) AND as little delay as possible from pressing the shutter to the picture being taken.  I REALLY liked this camera, except, the shutter delay is just too long for action shots - the action was long gone by the time the picture was taken and it's really impossible to anticipate a shot and get it right.  The controls are easy to understand and use.  The large LCD was great.  The Kodak EasyShare software is easy to use; in fact, I use it with my other camera also.  Long story short, I returned this camera and...gulp...took the dive and purchased the new Canon XTI Digital SLR through Amazon.  LOVE IT!  Action shots are outstanding!  Not a \"pocket\" sized camera, but sure gets the shots at those soccer games!", "Date": "January 3, 2007"}, {"Title": "Very Pleased", "Author": "Bean", "ReviewID": "R2L7N7BJDMO7I4", "Overall": "4.0", "Content": "I ended up buying this camera (even though I heard bad things about Kodak) because I liked the feel of it in my hand.  I don't like small thin cameras.  And it is somewhere between a point and shoot and and SLR.  Since I can't afford an SLR I went this. I have to say I love the camera.  I have already shot enough pics and printed them on my printer and they came out great.I love all of the features.  It reminds me of my 35mm SLR that I still own and use from time to time.  I don't find any lag in taking the pictures.  However, if you are on auto shoot, it needs to focus first before you take the shot.  But my 35mm SLR did the same thing.  I thinkg the shutter is just fine.  I would reccommend this camera to someone who needs to upgrade from a point and shoot.  After reading the reviews, I am seriously thinking about getting an extended warranty for it.  Escpecially since my last camera crapped out on me 1 1/2 years later.The only thing I seem to have a problem with is my fingers like to hit the control buttons on the right side of the camera while I am trying to take a picture.  It could be that I am a lefty and all of the controls are on the right side. But for the price, you can't go wrong.", "Date": "April 16, 2007"}, {"Title": "kodak easyshare z612", "Author": "S. Shandilya", "ReviewID": "R9WQ1EKJYTUU7", "Overall": "5.0", "Content": "wonderful camera. picture quality is very gud. I clicked thousands of pics and i didnt had any complaints. My brother took it from me when i visited him. Now I am planning to buy one more. Preview screen is also nice. Video quality is also wonderful.In all excellent product from kodak. i bought it from amazon. I had bought so many things ranging from memory card to notebook from amazon and i admire them. Delivery is gud n safe.", "Date": "March 5, 2007"}, {"Title": "great", "Author": "J. NIEMEYER", "ReviewID": "R201TT9JUPE3TP", "Overall": "5.0", "Content": "even the local pro is very impressed with what this thing can do, and my picsright off the the bat, have been nothing but wow, and I don't even know whatI'm doing. Full page pics from my Canon printer are in my opinion perfect.", "Date": "August 5, 2007"}, {"Title": "Great camera", "Author": "D. Ryan \"dryan\"", "ReviewID": "R3VVEUA9OH0P2A", "Overall": "5.0", "Content": "I am not a professional photographer. However, I have found this camera is everything stated. Everyone is wowed by the zoom and sharp photos with super correct color.  Many features that I am still experimenting with.", "Date": "June 1, 2007"}, {"Title": "Wonderful beginner's camera", "Author": "V. Subramanian \"ventcrazy\"", "ReviewID": "RUPJQDSVWYFAK", "Overall": "5.0", "Content": "Hi,This is my second camera, and the first digital camera. It is fun to play with. A wonderful value for money product. The image stabilization works great. The different screen modes help a lot, and with a little experience, u can click really great pictures with this camera. The colour science chip works fine, but sometimes, gets confused in bright sceneries. You can always switch to the manual or the program mode and still get great pictures.Video recording works fine to capture short videos, and I am quite happy with that too. The best part is, unlike my old SLR, even my kid can use this camera :-)Great buy...", "Date": "January 25, 2007"}, {"Title": "GREAT CAMERA", "Author": "Wayne B. Henshaw", "ReviewID": "RP9UH0VWJA5CY", "Overall": "4.0", "Content": "HAVE HAD THE CAMERA FOR A MONTH,EVERY THING WORKS GREAT WOULD RECOMEND IT TO ANY ONE LOKING FOR A DIGITAL,IT IS MY FIRST AND HE ONLY THINGS THAT I MAY GO FOR NEXT TIME IS MAYBE MORE PIXS BUT A GREAT CAMERA FOR THE MONEY AND I HAVE EVEN TAKING PIC WHILE RIDING ON MY BIKE AND WITH THE IMAGE STABLIZER THAY STILL COME OUT GREART", "Date": "January 18, 2007"}, {"Title": "The Best in the Lot...", "Author": "R. Gandhi \"RonakG\"", "ReviewID": "R1LWX75HIGMSAV", "Overall": "5.0", "Content": "The ergonomics of this camera are excellent. The buttons are very well placed and positioned within easy reach of the thumb and index finger. The LCD is big 2.5 inch 202K pixel. It gains up nicely in low light so that you can frame your subject nicely. The 12X optical zoom and the image stabilization works really well together. The image quality is awesome. The colors that this camera produces is very natural and still very vibrant as with all the Kodak cameras.I was most impressed with the video quality of this camera. It can take video at 640x320 at 30 fps with stereo sound. And the compression it uses is MPEG-4 QuickTime. So you can store 32 minutes of video in 1 GB card. And the video length is alos unlimited (till your memory card fills up fully i.e. 2 GB card can hold 1 hr of video). You can use the 12X optical zoom while using video. Though it does lose focus while zooming in video.The battery life is also very good. It uses Kodak KLIC8000 Li-on battery. And it comes with a charger also. It took more than 200 photos, most of all with flash and with reviewing them all on LCD. The camera allows you to edit the photos in camera it self. You can enhance the photos using Kodak's Picture Perfect Touch technology that will improve the sharpness and the colors. You can tag the photos as favorites and they get emailed automatically when you transfer them to PC. You can even crop the photos in camera itself.The last and the most important thing is the manual controls. You can control all the settings life exposure, aperture settings, ISO from the camera and decide what  is going to work for you. It still has some 20 auto scene modes that you can use in many conditions. Like beach, snow, night, sport, portrait, kids etc.Overall I am a very very happy owner of my Z612. Would recommend this to everyone who is looking for a prosumer camera.", "Date": "January 8, 2007"}, {"Title": "Photos of wildlife I never thought possible", "Author": "Paul M. Silverman", "ReviewID": "R3GAAGGZF9F0XW", "Overall": "5.0", "Content": "The photos I am now getting are so superior to the ones from my other digital cameras that I gave the other cameras to friends. My frustration with blurred close-ups of moving objects has ended. My only wish is that this photo quality could be achieved with a smaller camera.", "Date": "January 4, 2007"}, {"Title": "Great Camera", "Author": "David Leiberg", "ReviewID": "R2IH7EY379FREZ", "Overall": "5.0", "Content": "Just got my camera two weeks ago and so far I have no complaints. Excellent pictures, easy to use, I couldn't be happier.", "Date": "June 12, 2007"}, {"Title": "Positive reviews sold me", "Author": "P. Linderman \"motor home mama\"", "ReviewID": "R2KEG3A4ORXJ2H", "Overall": "5.0", "Content": "I purchased the Kodak EasyShare z612 based on the positive reviews on Amazon. I ck'd CNET and the review was negative...so I figured people who had the camera and were satisfied were the best bet for purchasing it.  I have been delighted with the zoom...wow!! and the quality of photos...looking forward to years of use!!", "Date": "June 8, 2007"}, {"Title": "very good camera", "Author": "M. Benintendi \"firestomper443\"", "ReviewID": "R37MOQQO2399AK", "Overall": "5.0", "Content": "I bought this camera to replace an older fuji model.  Can't say how big an improvement it is!  The image stabilization is a god-send!  The only thing I've got to say negativly about it...the digital zoom is a bit hard to control, but for most things, the regular optical zoom is plenty.Very good camera, and I would highly recommend it as a great starter camera.", "Date": "May 22, 2007"}, {"Title": "Best camera I have ever owned.", "Author": "Kathy P.", "ReviewID": "R16F78DXVT9X99", "Overall": "5.0", "Content": "I have used this camera for about 2 months now. I am thrilled! The images are  clear and crisp, the colors are true to life. I could not be happier.", "Date": "May 6, 2007"}, {"Title": "Great Camera!!!", "Author": "Michael Rodrigues", "ReviewID": "R1O1ILD9PR0CYN", "Overall": "5.0", "Content": "I'm using this camera for one month and loved!Great pictures and it's easy to use.Movies quality and sound are very good.Hope this review will help another customers, I used it a lot comparing with different cameras.Regards,Michael Rodrigues.", "Date": "February 22, 2007"}, {"Title": "What a great camera!", "Author": "Donald Wright", "ReviewID": "RKOL4S99HWYHK", "Overall": "5.0", "Content": "This was purchased as a gift.  I had read reviews for this camera, here and in other sites.  While I kept my options open when looking into a new camera (Canon, Olympus, etc) I decided to stay with Kodak because our entire family has Kodak and no one has ever complained about picture quality.Three things were immediately noticeable--1)the ease of use and setup, 2) the large LCD display, 3) and this camera's ability to rapidly snap picture after picture with none of the dreaded lag time associated with the less expensive models.None of us are professional photographers, but this camera is just great!  The terrific zoom is just icing on the cake.  While we purchased this for our daughter and son-in-law, we were so impressed we are seriously considering a followup purchase for our selves!You will not be dissappointed.", "Date": "January 9, 2007"}, {"Title": "I must like Kodak digital cameras", "Author": "Amazon Customer", "ReviewID": "RVZ2G26PFG6OX", "Overall": "4.0", "Content": "This Z612 is the third Kodak I've bought in 5 years.  They have all been reasonably priced and, especially, easy to use.  My wife wanted a zoom camera she so could take snapshots of the heron at the far end of the local pond.  The Z612 does the job.", "Date": "January 9, 2007"}, {"Title": "Excellent!!", "Author": "J. Autrey \"hockeyninja18\"", "ReviewID": "R1JDWBJ5RJ9NIH", "Overall": "5.0", "Content": "This is a great camera for anyone, whether a skilled photographer or just learning.  There is a larger variety of settings that are easy to control, and the zoom and picture quality is amazing.  I would recommend this camera to anyone that's looking for quality digital memories!", "Date": "May 22, 2007"}, {"Title": "A Fully Satisfied Customer", "Author": "Ranjiet P. Menon \"The Metalhead\"", "ReviewID": "R39ZAS534JKOSM", "Overall": "5.0", "Content": "this is an excellent camera. when i first noticed that it was a 10X zoom camera, i had an apprehension that at maximum zoom, the picture may not be very clear...but when i clicked pictures at max zoom, and viewed the picture on my computer, i was amazed by the clarity. the camera in general takes amazing pictures. a definite buy for amateur photographers like me!!!", "Date": "May 12, 2007"}, {"Title": "GREAT CAMERA", "Author": "Duane Michael Crewse \"dmc777\"", "ReviewID": "R2K14188XB351E", "Overall": "4.0", "Content": "GREAT CAMERA FOR THE PRICE. WE HAVE OWNED KODAK CAMERAS BEFORE & WE REALLY LIKE THE ZOOM STABILIZER FEATURE ON THIS CAMERA, IT STABILIZES ALOT QUICKER THEN PREVIOUS MODELS. THE ONLY DOWNSIZE TO THIS CAMERA IS IT IS BULKY, BUT YOU HAVE TO HAVE THE BULK IF YOU WANT THE ZOOM. THE PICURE QUALITY IS CLEAR. I LOVE THE LARGE REAR LCD SCREEN, THAT WAS A BIG FACTOR WHEN BUYING THIS CAMERA. VERY USER FRIENDLY UNLIKE OTHER BRANDS.", "Date": "January 9, 2007"}, {"Title": "Love this camera!!!", "Author": "HF GUY \"Sportsfan\"", "ReviewID": "R1QSIEMRU9QUQZ", "Overall": "5.0", "Content": "Unfortunatly, I lost our camera last year!! So I really wanted to get another Kodak since I was so happy with the previous model. I looked at all the popular camera's like the Cannon powershot, which I was not happy with at all. I have a friend that owns one and has to recharge the batteries after only a few hours of use. The kodak uses the Rechargeable lithium-ion battery, which after a full charge lasts for DAYS!!! not hours!! For the casual user this is a perfect camera. Vacations, parties etc.. this works great. I like to use it at sporting events because of it's abiltiy to zoom from a distance and still take sharp pictures.", "Date": "January 8, 2007"}, {"Title": "Easy to use, except the zoom", "Author": "The Wood Doctor", "ReviewID": "R2799DWQC201UF", "Overall": "3.0", "Content": "I've had this camera since 10/06. It is very intuitive and easy to use with the exception of the zoom, which is very jerky. This means that instead of being able to zoom until you are satisfied, it jerks past where you want to go. When you try to go back a little, it jerks way past where you would want to stop.I am also having to return this one to the manufacturer for repair under warranty. When I try  to do video, the camera makes grinding noises as it tries to focus and you can hear the noise on the video. I sincerely hope that is not how the camera is supposed to operate.But the images from the lense and 6.1 megapixel camera are excellent and Kodak software is easy to use.", "Date": "January 9, 2007"}, {"Title": "First Choice on 1st ditigal camera", "Author": "Odilia G. Bustillo \"celebrated blue truck\"", "ReviewID": "R22AUTWHLZU045", "Overall": "5.0", "Content": "My kodak easyshare z612 6.1mp digital camera is exactly what i was looking for.I spent six months looking,reading,surfing the web,paying layaway on some other ditigal camera.On the month of Dec.i picked up some ads on the z612,read them,research the camera,close my layaway on the other ditigal camera,bought my kodak z612 at amazon.The camera is macro compatible,small,light,and offers me a chance to learn a more modern aspect on photography.", "Date": "January 9, 2007"}, {"Title": "Some nice images, but some very blurry", "Author": "M. Lane", "ReviewID": "R29GEG0O6B8BN5", "Overall": "1.0", "Content": "I got some very nice photos with this camera, and some very disappointing ones, too. Even not using the zoom, I ended up with some very blurry pictures. This is not my first digital camera. I am unsure as to whether or not the camera is broken. Judging from other reviewers, I am guessing I just got a defective camera.", "Date": "July 20, 2006"}, {"Title": "KODAK", "Author": "Adrienne G Poole", "ReviewID": "R1JBXLLYM0C4XH", "Overall": "5.0", "Content": "This camera took great pictures.  When I received the camera it was basically new.  LOVED IT, I bought this camera several years ago, and until last year (when i dropped it) - BEAUTIFUL pictures.  Great catch at a great price.  This product was in GREAT SHAPE,,, thanks.", "Date": "March 14, 2013"}, {"Title": "The perfect camera for me.", "Author": "MiMi", "ReviewID": "R33ZP9YLPP62FL", "Overall": "5.0", "Content": "I'd had this same camera for about 5 years.  It took alot of abuse before it finally gave out.  I replaced it with the same camera, because it is perfect for my needs.  I'm not much of a photographer, but this camera produces outstanding pictures every time.  Costs about a hundred more than some aim and shoot cameras, but the quality is more than worth it, and my camera lasted much longer than the cheaper ones purchased by friends.Also, the rechargeable battery is an awesome advantage.", "Date": "February 9, 2011"}, {"Title": "Unreliable", "Author": "J. G. Young \"Pic Shooter\"", "ReviewID": "R10VV1DD3XR2AA", "Overall": "2.0", "Content": "Owned this camera less than 1 year and its in the shop for the second time. Customer support was okay the first time but sucks now because they put me on hold for so long that I didn't get the issues resolved. I'm willing to try another Z612 before switching brands because I love the picture quality and the ease of operation.", "Date": "April 9, 2008"}, {"Title": "The Perfect All Around Camera", "Author": "Big-Z", "ReviewID": "R3LTDJ6WEMUPPD", "Overall": "5.0", "Content": "I will not repeat all the positives found in reviews on this site and on others. I have owned 23 digital cameras (most for reviews) over the past 20 years, and I must say this is the best all around camera of them all. It is not quite a s good as some of the Fujis for very low light shooting, but other than that it can compete with $500 cameras easily. Picture quaility is what counts and this camera even beats my Canon G7 in that regard and easily beats the Fujis in adequate lighting. I have had no problems with this camera and have loved it from day one. With all the professional settings as well as point and shoot, it can appeal to everyone. At the price, it is a steal.Those who write negative reviews about this camera either have a defective unit or do not know how to use a camera, or think they are writing a review on a $1.000 camera. Highly recommended without reservation.", "Date": "March 4, 2008"}, {"Title": "One year later, still in love -", "Author": "M. J. Heiser", "ReviewID": "R372V9544FXG58", "Overall": "5.0", "Content": "We bought this camera a year ago for our trip to England.  I switched from my point-and-shoot Sony because the zoom was completely insufficent for my purposes.We received it a week before the trip, and I was concerned I wouldn't be able to master it before we left.  I was very wrong.  The controls are intuitive and well-placed.  I took some of the best photos I've ever taken on that trip - and many of them at long range.  The power of that 12X zoom is fantastic!  Not to mention the video capabilities are more than adequate.  Color stays faithful to the subject (so long as you have the right natural/atmospheric lighting).Besides the great features, surprisingly small package, and beautiful picture quality - did I mention the camera is really cool-looking?  It's startlingly novel in its chrome and brushed-nickel looking housing.I'll be holding on to this camera for a very long time.", "Date": "February 14, 2008"}, {"Title": "Just short of perfect for me", "Author": "katsachatter \"katsachatter\"", "ReviewID": "R366858C34XK6I", "Overall": "3.0", "Content": "I have had this camera for several months now, and being a mom, I have used this camera in dark gyms, recorded video, in bright sun light, and while chasing kids with the sports setting. I purchased this camera as an upgrade to my Minolta Dimage Z1.  I wanted more mp because I do a lot of cropping and editing.  For me, sometimes its not what you are intending to shoot, that makes the best picture.Pros:It has some really great features, not found on other cameras.  This is what makes this camera hard to pass up.  I love the 12x optical zoom.  It even allows you to zoom while recording video (not a feature I can find in most other digi cameras).I purchased the docking station, and now never have to worry if I have batteries.  I just put my camera on the dock, and its charged and ready to go.The battery life is the best of what I have had so far and this is my 4th digital camera.The controls at the top allow you to make quicker decisions about zoom and what kind of setting to use .Internal memory can come in handy for emergency back up.Cons:The features are great, but there is a down side.  I am picky about picture quality.  Pictures that look great to a novice will drive me insane in editing.  With this camera, there is a lot of editing to do.Red eye reduction doesn't reduce red eye that well.  Pictures that have been zoomed into do not have enough light for the proper exposure.What you see in the LCD isn't necessarily what you get.Some pictures come out too vivid, almost fake or cartoonish in color rendition.  I haven't figured out why this happens yet.I want a point and shoot camera, not a new hobby doing photo touch-ups.  I need to shoot in the moment, while the kids are running, when they are doing something cute (which doesn't last very long).  The last thing I want to worry about is finding the proper settings for the environment I am in.So, in summary, this camera is great for taking relaxed shots if you  pose your family, sell on ebay, shoot landscapes, where you can control your enviroment and subject or play with the settings.If you are picky like me and want a true point and shoot, great pictures, without having to make adjustments, or spend hours editing later, then this camera may be an issue for you.", "Date": "October 27, 2007"}, {"Title": "Happy 1st time Kodak owner", "Author": "L. J. Kirkhart \"trainlvr\"", "ReviewID": "R2LQBTCBSJPV67", "Overall": "5.0", "Content": "This is my second digital camera and I must say I am very pleased. I like the grip especially and the zoom is terrific. I am so happy I can now video with sound also. It is very easy to manipulate dials and review.", "Date": "January 16, 2007"}, {"Title": "Homework paid off - nice camera!", "Author": "C. Bergeron \"GeekMom\"", "ReviewID": "R2ASEBRN9TMBS6", "Overall": "5.0", "Content": "I went to Consumer Reports online to research for a new camera after I dropped my old Kodak camera and damaged it.  Print quality and battery life were high priorities.  This one was in my price point.  Amazon had the best price on this camera that I could fine.  I've had 3 Kodak cameras and this is a very easy one to use.  I'm getting excellent prints and it came with a special Amazon offer of free memory card.  I am a happy customer!", "Date": "January 9, 2007"}, {"Title": "Unhappy with Kodak", "Author": "Jane Smith", "ReviewID": "R2KMWSAE7YG6H0", "Overall": "1.0", "Content": "Even though I did like my Kodak Z612, I had a terrible experience with Kodak as a customer. First I was sent a camera that didn't work properly, the menu button didn't work. I asked Kodak to replace my camera with a properly working one, they told me they \"don't replace cameras\" but I could send it to Precision Camera to get it fixed. Kodak wanted me to pay for the shipping and insuring of the camera until I argued enuf that it wasn't my responsibility and threatened to write a review about the camera, then they finally agreed to pay for the shipping. After 4 weeks with no camera, I discovered after countless phones calls and emails that my camera had been lost by the shipping company. Neither Precision Camera or Kodak was very helpfull thru this process. I guess they figured it wasn't their problem. The shipping company agreed to refund Kodak the cost of the camera and Kodak would have to refund me because Kodak is who paid for the shipping. Instead of refunding my money, Kodak told me they had to send me a new camera instead of the money. At this point I was so tired of the whole process I agreed. When my camera arrived, I was surprised to find a \"refurbished\" sticker on the bottom of my camera. I was then told that Kodak \"can't send new replacement cameras, but refurbished doesn't 'necessarily' mean that it's been broken or used\". So I started with a brand new camera, went without a camera for about 6 weeks, spent hours on the phone with countless calls to Kodak, Precision Camera, and the shipping company, and now have a refurbished Kodak camera.", "Date": "March 4, 2007"}, {"Title": "Very Very Bad Repair and Warranty", "Author": "S. K. Johnson \"Shelly\"", "ReviewID": "RU91YID3LUTUE", "Overall": "1.0", "Content": "This camera worked good for about six months, then it would just shut down. It will turn itself off, and won't turn back on.  I sent it in to be repaired while it was still under warranty. They returned the camera to me without fixing the problem. So I sent it back and now they are telling me I have to pay $150 to have the camera repaired or I can buy a different kodak camera and get 15% off. Even though the camera was sent back to me the first time without being repaired while it was under warranty, they will not fix it.  Nobody at Kodak or precision camera was willing to stand behind the camera or the warranty.", "Date": "April 11, 2008"}, {"Title": "Great Camera", "Author": "Jerry Fouchong \"JFouchong\"", "ReviewID": "R3NYSDAD3S9FBF", "Overall": "4.0", "Content": "I am happy with this item, at the price paidI am delighted with the quality of the Pictures taken so far", "Date": "July 18, 2007"}, {"Title": "My new camera", "Author": "M. Miller", "ReviewID": "R3E4JPTW5FS471", "Overall": "4.0", "Content": "I enjoyed using my new camera. I've already taken some great pictures. Digital zoom is really great. Took a picture of a cardinal and had it enlarged. Great!!", "Date": "January 15, 2007"}, {"Title": "Great!!!", "Author": "ssfan4vr", "ReviewID": "RK38F1XSUDL83", "Overall": "5.0", "Content": "I am so happy with this product. I had gotten one as a gift 10 years ago and simply couldn't find one to replace it..... until now! I am pleased with the condition and works great. I am thankful.", "Date": "December 12, 2012"}, {"Title": "Wow!", "Author": "Green", "ReviewID": "RNXEVG3DHXG1N", "Overall": "5.0", "Content": "I've had this camera pretty much since it came out (2004) and just last month it finally gave up. It's been through my teenage years and for the last 3 years it's been putting up with my daughter beating the heck out of it, throwing it around, knocking it on things, etc. It takes awesome pictures and it was always my go-to camera. It's still hanging on by a little thread but now when I turn it on the screen goes all static-y and then it corrupts my pictures. I can't blame it at all though, 8 years is a ripe old age for a digital camera and I'm going to miss it.I loved that this camera had settings you could change manually. Control the aperture, exposure, flash compensation, and shutter speed. You can either single out one of those settings and leave the rest to auto, or you can completely control it manually. It was great for stuff like, fireworks, taking night shots on a tripod. For everything else I just used the auto settings. There are also scene settings for candles, outdoors, portraits, text, etc but I only used it for macro when I wanted to take pictures of teeny weeny details.No, this camera doesn't have a hot shoe or anything like the camera I had before that (Kodak P850). This isn't for studio work. But it turns on fast and it's great for grabbing and going. I am sad to have to replace it now but it's been through a lot. Rest in peace, Z612!", "Date": "August 25, 2012"}, {"Title": "I love this camera!", "Author": "Mrbluiis", "ReviewID": "R201RHTF3HVZ0D", "Overall": "4.0", "Content": "I've had this camera since 2006. I'm considering buying a newer used one as I know this is going to give out one day and want a spare as a backup. It's easy to use. I have big hands (6'4\" and 250lbs) so I need a larger camera than the ones that are pocket size. I'd say that I've taken well over 1000 pictures, the flash still works, auto-focus still works. You can get still shots from videos and copy them into photos. One thing that a previous reviewer wrote which is true. When using the video function you can hear a grinding in the video from the auto-focus constantly adjusting. And there's no way to correct it. It doesn't ruin the videos but it is annoying to hear. Other than that this is a great first camera.", "Date": "August 9, 2012"}, {"Title": "Good camera", "Author": "Dave", "ReviewID": "R272IH05IUNV7Q", "Overall": "4.0", "Content": "Although a bit of an older camera, it has a lot of features that advanced photographers would appreciate.  Yet, it also can be used simply and without fuss for the novice or basic user.  Good zoom capability, and it takes great pictures! High Gigabyte chips are also now available for the camera, allowing extended video to be taken that is comparable to other modern cameras.  If you have the Kodak CD and the interface cable,a program allows you to set up a nice program that will download and organize your pictures into albums on your computer.  Don't forget to back up those pics!", "Date": "May 28, 2012"}, {"Title": "Nice point and shoot with extras", "Author": "Cal", "ReviewID": "R2T41CW68ONIK8", "Overall": "5.0", "Content": "I found this camera very nice for a point and shoot camera.  It does have many extra features for those who like to fool around with the manual setting.  You can't go wrong with this unit.", "Date": "August 6, 2011"}, {"Title": "Hobby", "Author": "Edgar", "ReviewID": "R2R88Q2CXV7H6Q", "Overall": "4.0", "Content": "Excelente cámara, puede lograrse mejores fotos, pero esto depende de la destreza del fotógrafo ya que la cámara dispone de facilidades para ello, casi como una cámara profesional. Solo faltaría mejorar la lente y algunos accesorios ópticos  para producir ciertos efectos.Lastimosamente un problema presentado ahora, despues de más de un año de uso, las fotos que obtengo se ven borrosas, desenfocadas. No la he golpeado por que la tengo protegida. Pero en tiendas especializadas en repararlas, me dicen que ese es un problema que se presenta con cierta frecuencia en esas cámaras y su reparación es realmente muy costosa.", "Date": "November 3, 2010"}, {"Title": "Great camera but for the zoom noise", "Author": "A. Bray", "ReviewID": "R1KP3CMR4KYXRU", "Overall": "3.0", "Content": "I got this camera several years ago and LOVE it - except for one problem.  When taking video footage, there is a grinding or clicking noise that happens when you zoom in or out.  This is quite audible during the playback of the videos.  At most times, the grinding literally sounded like a buffalo grunting (we were in yellowstone at the time) one of my friends said.  It is very obnoxious when you are trying to take video of things like weddings, your child sleeping or pretty much anything that you want to be able to hear what is going on.  Also, who wants a grinding/grunting noise during video shots?Kodak says that there doesn't appear to be anything wrong with the camera - when I sent it in for a $120 fee - and returned it to me.Since I take a lot of video, I gave this camera a 3 stars due to this problem.", "Date": "November 2, 2010"}, {"Title": "Do not  buy.", "Author": "Chuck Lowery", "ReviewID": "R2DV433T5MCIHC", "Overall": "1.0", "Content": "I bought this camera in Nov 2006 for $250.00.  I had to send it into Kodak for repair six month later.  The camera would show a white screen on outdoor picture.  The camera was repaired under warranty.  Eight month later the same problem occured.  This time Kodak wants $135 + sales tax + $10 for shipping to repair it for the same issue.  It is a piece of junk.  Kodak now offers a 15% coupon trade in towards on a new camera.  So I give thme my crappy camera and they send me a 15% discount towards the purchase of a new camera.  Then turn around and resale my camera to some else.  I will never buy another Kodak product.  Buyer beware! Save you money.  JUNK JUNK JUNK!", "Date": "June 30, 2008"}, {"Title": "buyer beware", "Author": "J. buttenwieser", "ReviewID": "R2S97JD9P7DMMW", "Overall": "1.0", "Content": "I bought this camera a little over a year ago, it was great at first and got some really nice pictures.  After a bout 6 months it started to act up, Since then I have had to send it in to kodak three times.  The camera will no longer focus and I am upgrading to a real SLR...DONT WASTE YOUR MONEY ON THIS CHEAP CAMERA...  I lost some really important moments to blurry pictures because of this camera.", "Date": "May 30, 2008"}, {"Title": "A little disappointed", "Author": "Halloween Girlie", "ReviewID": "R12WC7VCGDD8VT", "Overall": "2.0", "Content": "Is is just me or has anyone else experienced a grinding noise coming from this camera?? Right out of the box, it sounds like a little motor wants to shut down. Is this normal?? I didn't expect the camera to make any noise aside from zooming in and out. Please let me know if anyone else has experienced the same thing.", "Date": "April 30, 2008"}, {"Title": "Amazing Camera...Amazing Zoom", "Author": "G.O.B. Bluth \"Mandy\"", "ReviewID": "R2CAOYCXGZUN41", "Overall": "5.0", "Content": "I wanted a digital camera that I could zoom onto the field of my nephew playing football and other sporting activities far away. I did extensive research on all kinds of different cameras and finally chose this one. I am SO glad I did. Thousands of extremely clear pictures and hundreds of zoomed (!) videos later I know I made the right decision for me. If you are focused on zoom and clarity you will enjoy this.", "Date": "March 4, 2008"}, {"Title": "Very nice camera.", "Author": "Gary B.", "ReviewID": "R3A6DPZWY3X6G", "Overall": "4.0", "Content": "After owning many simple plain type cameras , including the throw away types , this is my first really good camera , and I am having a ball with it . This camera has more options on it than I will probably ever use, but then again , that may very well change . I take it camping with me all the time and have taken some fantastic pictures at the state parks that I visit. Close ups or far away , they all come out great.Even the video part is great . My only complaint so far is the sound from the video is not loud enough, could be better . The walls in my den are filling up with framed 8 x 10 pictures taken on camping trips.I Just purchased a tripod for it and that should help in taking videos. Excellent camera for the money .", "Date": "January 21, 2008"}, {"Title": "Wonderful camera at the price", "Author": "Slash Dot", "ReviewID": "R13R3KRTN2R29G", "Overall": "5.0", "Content": "I bought this camera as a refurb, and I am extremely satisfied. The camera has a great manual mode, and together with a 12x optical zoom, it has proven to be a perfect intermediate step from a point-and-shoot camera to my ambition of getting a DSLR.The only problem I have noticed is that in a few of the pictures is that the borders seem a little darker than the center (kind of like a circular frame at the four corners). This does not happen in every picture, and might be due to some setting.On the whole, the camera is perfect for me (I take low-light pictures, wildlife pictures, as well as regular shots of people)", "Date": "January 14, 2008"}, {"Title": "I think I just wasn't lucky enough", "Author": "Daniel A.", "ReviewID": "R22AQ2IQJNCPYT", "Overall": "2.0", "Content": "I bought this camera on April 2007, and I have to say that I was really excited with its performance. I took great pictures, considering my amateur level. Unfortunately, by November 2007 it got broken.Without any notice, from one day to another, it showed a 'tick'. The image in the viewfinder or LCD goes up and down continuously, making a still pic or exposition almost impossible.I wont give one star to this camera because during the time I used it (about 6 months) I thought it was great for its price. For the time being, I will fire my last shot to Kodak US, since the local repair center couldn't fix the problem...  =( (I got the camera via Amazon, I live outside US).Wasn't I just lucky enough?='(", "Date": "December 10, 2007"}, {"Title": "FABULOUS CAMERA ~ FAST SERVICE", "Author": "Jin Jin \"Jin Jin\"", "ReviewID": "R1551JGEL85ZAY", "Overall": "5.0", "Content": "I love this Kodak camera.  It has everything I need and takes great quality pictures.", "Date": "November 25, 2007"}, {"Title": "Had to send in twice for repair", "Author": "Seth Hopkins", "ReviewID": "R203A41UCFTPRP", "Overall": "2.0", "Content": "While I am happy with the performance of this camera, I have had to return it twice for repairs within 6 months of purchase.  First the Auto focus had to be adjusted and recalibrated within a month of purchase, then I recently had to return it because the mode selection dial stopped working.  I am a bit afraid that this camera will need to be replaced as soon as the warranty runs out...", "Date": "October 13, 2007"}, {"Title": "great camera for the price", "Author": "M. Wesneski", "ReviewID": "R1SIJUS64YJS1M", "Overall": "5.0", "Content": "One of the best and easiest cameras I've ever used. Used to have an older Kodak model that cost much more than this one with less features and harder to use but it doesn't hold a candle to the Z612. Worth every penny so far. Quality of photos are excellent!!!", "Date": "May 30, 2007"}, {"Title": "Awesome camera!", "Author": "W. Burks", "ReviewID": "R10OU6KGB679UE", "Overall": "5.0", "Content": "I researched other cameras, and Kodak always gets my vote. This camera is awesome for the price!  It also has fun features like you can crop right on your camera, correct the color using Kodak Perfect Touch, take pictures right from your video footage or even make a collage print from different frames from your video, and all on your camera!!!  LOVE IT!! If you want a slim camera, it's not for you, but otherwise, it's GREAT!!", "Date": "January 3, 2007"}, {"Title": "Very good camera", "Author": "S. Gould", "ReviewID": "R110NDLXMQFF0C", "Overall": "5.0", "Content": "I have had this camera since late last year, so almost a year now. Love this camera. Takes very good pictures. I only have problems with low lighted areas. Takes awhile to get a good shot sometimes if there is not enough light.", "Date": "October 6, 2006"}, {"Title": "You get what you paid for - an ok easy point and shoot.", "Author": "Luving it", "ReviewID": "R2DED6TJOXBMM7", "Overall": "3.0", "Content": "When it works at its best, the picture looks great. But that's not often the case and far from \"fool proof\". And I doubt I am the only fool out there :) Note: I did most of the shooting indoor in bright to regular artificial lights, in full auto mode. Main object is my 2 year old.Pro:light weight, easy to use, IS helps, uses Li-Ion battery (used to have a Olympus with 2 AA batteries, a nightmare will never forget).Con:1. The LCD is blurry and murky always, better when the picture is in focus, worse if not. But never truly clear and sharp.2. The AF is slow and inaccurate at the long end, ok at the wide end. The \"ding\" sound supposed to indicate a good focus, but it dings often when the subject is totally blurry. So now I have to carefully watch the murky LCD to make my own judgement.3. Indoor shooting tends to over expose, quite often. This is the opposite to Easyshare V603 I tried before, which tended to under-expose.4. I tried other settings besides \"full auto mode\", the results were worse. Fully auto seems to be the best way for cute cameras like this.5. Zoom is awkard, inaccurate and hard to control. I found Canon Powershot zoom wheel to be better. On Kodak, once you took a picture, you have to half press the shutter to get the camera out of the review mode and then zoom the lens. \"Shoot and zoom\" just doesn't work. This is consistent with Easyshare v603. I think it's the design flaw or technical deficiency on Kodak's part.6. Shutter lag is significant, from the time the shutter is clicked (always after \"in focus\" as indicated by the sound) to the time the picture taken, my baby could have changed her facial expression completely and moved out of the frame, and she was not even running.All in all, this one is still very much the good old \"stand-in-line-n-say-cheeese\" type of camera. Super zoom never is good on DSLR, no exception here. I happen to think most features packed in this camera is just for marketing. This is certainly no sub for DSLR, not by a long shot, even if the feature list reads like one from time to time (I did read the manual :)). The only real positive for me is the natural color from Kodak, when things are right (also true with V603). Alas, that doesn't have very often. On a side note, the phrase \"point-n-shot\" is really misleading, because with this type of small cameras, you can point, but shot doesn't come about till the cameras decide it's ready for it. SLRs are far more truer to the phrase!", "Date": "February 8, 2007"}, {"Title": "Una hermosa camara.", "Author": "Douglas Guillen", "ReviewID": "R2V3VWY41XKDI1", "Overall": "5.0", "Content": "Es una camara facil de usar pero con una gran calidad en la fotografia. Me ha impresionado mucho la manera como capta los atardeceres, ademas el zoom es buenisimo y las demas prestaciones tambien.", "Date": "July 3, 2007"}, {"Title": "terrible picture quality", "Author": "Philip Keith Miller \"phil\"", "ReviewID": "R2G5Z8NEAIM415", "Overall": "2.0", "Content": "My Dad owned an older Kodak with the same lense, and it took good pictures, but this camera takes very grainy and fuzzy picutres.  It is incapable of taking an indoor picture without the flash, and even with the flash the indoor photos (except for closeups) are fuzzy.  Even high light outdoor photos were often fuzzy.  I returned this after a week and now an looking to get either a fuji s700, kodak s3 is, or a panasonic fz8, but I don't want to  be this dissapointed again", "Date": "April 30, 2007"}, {"Title": "Bad picture quality", "Author": "Dee B. Pickus \"Dee B. Pickus\"", "ReviewID": "R2RSIX8EF5QR77", "Overall": "2.0", "Content": "I just bought this camera and took it to one of my kid's indoor soccer games. The light was low, but not that low.  You should be able to take a picture without the flash. When I took the flash off, the picture looked fine on the preview, but came out completely black.  Yet the camera was able to take perfectly fine video at the same light level!  What a disappointment.  I am going to try to return it.", "Date": "April 4, 2007"}, {"Title": "Noises of using the zoom lens and when turning on", "Author": "Jiang Dong", "ReviewID": "R2ULHYDTB0EZ62", "Overall": "2.0", "Content": "When turning on this Z612 6.1 MP Digital Camera, it sounds a slight \"Da-Da-Da...\" noise. I suppose this is due to the automatic focusing function that is endurable. But when I took the video recording, the noise was clearly recorded by the camera. This seems abnormal. I don't know how to abate the noise.Thanks,Jiang Dong", "Date": "May 13, 2007"}, {"Title": "Poor repair for this camera.. why sell good with poor repair?  This went from 5 star in the beginning to 1 star 6 months later!!", "Author": "Sherry A. Paris \"Always Hunting For Good Deals!\"", "ReviewID": "R3FCT3S48LMJKV", "Overall": "5.0", "Content": "I've had this camera 5 1/2 months and it's on it's way to the shop to be repaired the 2nd time.  First time they did nothing to it.  Not sure what was wrong with the tech.I bought this for good quality pictures to frame.  When I'm ready to photograph it sits in the shop.  Would I suggest this camera for a serious photographer?  NO I would not.  My trip is in 30 days and where is my camera?  Not with me!I'm very disappointed.  I thought Kodak had better products and repair set up than this.  Buy the extended warranty if you get this camera.Outside pictures are white.  Inside pictures are red/blue lines across.I have grandchildren on the way and no camera to take them. *sigh*I could go on but you get my point on this.Kodak has much proving to me to sell me again.", "Date": "April 2, 2007"}, {"Title": "Kodak EasyShare Z612 6.1MP Digital Camera", "Author": "Oren", "ReviewID": "R2CMG04N3OZW62", "Overall": "5.0", "Content": "I had priced a cheaper model (Same Brand) at a local store and it was $ 100.00 more than Amazon. I purchased a better model and still saved $ 30.00Delivery was fast.", "Date": "January 26, 2007"}, {"Title": "Tremenda camara!!!", "Author": "David Rangel", "ReviewID": "R3MCMOWRU2LYBS", "Overall": "4.0", "Content": "muchas funciones y calidad de 6.1mp.... memoria expandible con una ranura para tarjetas SD, con las fotos guardadas en la tarjeta la puse en mi Wii y disfrute mucho viendolas...que mas puedo pedir...", "Date": "May 28, 2007"}, {"Title": "Kodak EasyShare Z612 6.1 MP Digital Camera with 12x Optical Zoom", "Author": "J. Read", "ReviewID": "R24LMHCBHTN6D5", "Overall": "5.0", "Content": "Wonderful pictures. Prints great pictures.", "Date": "April 1, 2007"}, {"Title": "Kodak EasyShare z612", "Author": "B. Fluker \"photographer want-a-be\"", "ReviewID": "R3TVSRN6QFOGYB", "Overall": "5.0", "Content": "I have only had my camera for a little less than a month.  So far, it is great.  The weather hasn't been where I can get out and take a lot of pictures yet.  Those are my favorite pictures of the outdoors unless it is grandkids.  I am anxious for the sun to shine and the flowers to grow to give it a real test.  Or for the grandkids to arrive.  So far so good!Beverly", "Date": "January 26, 2007"}, {"Title": "BAIT AND SWITCH", "Author": "P. SULLO", "ReviewID": "RNHDOYUQ3R43Y", "Overall": "1.0", "Content": "When I ordered this camera from AMAZON the price was comparable to local establishments. The only reason I ordered from AMAZON was that there was a tag on the web page that said if you order this item you will get a free SD 512 memory card. This also appeared on the Kodak Z650 add on AMAZON. I did not recieve the card and when I inquired to AMAZON they answered that a card does not come with the Kodak Camera. Well, I knew that! The card was a give away from AMAZON not from Kodak. My biggest mistake, aside from ordering electronics from AMAZON was not saving the web page to prove my claim. Watch out for the bait and switch. Now AMAZON can do it too.", "Date": "December 24, 2006"}, {"Title": "BEST BUY-Recommend 100%", "Author": "J. E. Lewis \"James\"", "ReviewID": "R3O8LLQLWY0A58", "Overall": "5.0", "Content": "I bought this camera for myself as an early birthday present. I admit I have not fully tested out this camera as I have had this camera less then 12 hrs at the time of writing this review. But As soon as I got it out of the BOX I thought WOW! glancing through the menu options I only took a couple of pictures but I am still learning. I will update soon :) bye for now. If I could I'd give it  10 out of 5 LOL!", "Date": "September 6, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "Compact digital camera with a powerful zoom and precision optics, a 6.1 megapixel resolution, and easy-to-use controls\nRecord VGA video at a resolution of 640 x 480 pixels at 30 fps with sound, and print multiple frames on a 4 x 6 inch print\nWith 32 MB internal memory and the ability for expanded external memory via the SD/MMC card slot, you can keep shooting pictures longer\nLithium-Ion rechargeable battery provides continuous and reliable power; can be recharged easily via the included battery charger\n12x Optical zoom", "Name": "Kodak Easyshare Z612 6.1 MP Digital Camera with 12xOptical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41095ADCQ8L._SX300_.jpg", "ProductID": "B000DZHA6O"}}