{"Reviews": [{"Title": "User  Friendly", "Author": "mgh \"mars\"", "ReviewID": "R3727YFP5Z1473", "Overall": "3.0", "Content": "This camera is user friendly.  I like the large display screen.  I love all the different setting modes like theatre,etc.  I like the red eye removal and the anit shake mode.  The big problem is that it is only 3X optical zoom and isn't enough for taking pictures at a distance!!  You need something with more mp for bigger zoom.", "Date": "April 30, 2007"}, {"Title": "Good value!", "Author": "B. Drouin \"ScoutBCD\"", "ReviewID": "R3852AH481OYCF", "Overall": "4.0", "Content": "I am a fairly experienced amateur photographer.  I bought the M537 in Spring '07 for its convenience to use on an extended vacation trip in the UK  and all around Europe.  Took over 750 pictures of many subjects at varying distances and under a wide range of lighting conditions, and was very pleased with the overall clarity and quality.  The color balance/tint was almost always spot on, especially on flesh tones.  With pictures on which the exposure was a little off, doing a little basic photo editing (brightness, contrast, saturation)  usually sufficed to create a quality result.  Many of my pics approached what I have achieved in the past with my trusty old Nikon FG.  Flash picture quality is more hit or miss, but that's true with most small cameras with built in flashes.  AA batteries lasted quite a while--only had to replace twice in  6 weeks.  Slightly annoying that some special use modes get lost to default mode when camera is shut down in between pictures, but switching modes is easy to figure out and do.  Only prior digital was a Sony DSC-7.  Cybershot bought in 2002.  This camera is far better and easier to use, and was a lot less expensive!", "Date": "November 25, 2007"}, {"Title": "great price!!!!good quality", "Author": "Paul Anzola", "ReviewID": "R1QRL0S1SV8BS5", "Overall": "4.0", "Content": "I got a Hp Photosmart m537 for $69.99 new, warranty,etc. for the price and quality i can not complain. Basically i changed the picture resolution to high (6 m) and i can take good pictures, good resolution, i love the 2.5\" display . also i got a memory SD 2GB for 14.99 *excellent price****. I recommend this product if you want to take regular pictures, for this price you will not get something better.... i got a great deal.", "Date": "November 23, 2007"}, {"Title": "Great camera for the price!", "Author": "trevtnyc \"trevtnyc\"", "ReviewID": "R3N6EKDO8WCD9E", "Overall": "4.0", "Content": "I have not had any of the problems I am reading on here, so I can't comment on what happened to them.  All I can say is that this is a great little camera for the money, it takes pictures in brilliant color and is so easy to use. I do agree with one reviewer who said pictures in the dark are hard to see, you do have to guess, and pictures at a distance (cityscapes at night don't come out very well, that would be my only minor problem and the only thing that keeps me from giving five stars)  I bought a camera dock and rechargable batteries right from the start so I have no battery problems and I can download my pics right to my laptop either directly through a USB cable or through the camera dock.  It also has great and easy to use settings for borders, color schemes and antique to black and white settings as well.  I've never had a camera that takes such great pics, so easy to use and costs so little.  I would tell anyone looking for a good basic camera that isn't going to break you to go for it, I don't know what these other people on here are using their camera for but mine is just fine and I love it!", "Date": "March 2, 2008"}, {"Title": "Acceptable", "Author": "Shiri E. Segal", "ReviewID": "R3PQ9D9J9E95LX", "Overall": "4.0", "Content": "Pro's:-  Easy to learn.-  Nice sized LCD screen-  Clear pictures-  The price was rightCons:-  Battery Eater. (One solution to this problem is you should purchase rechargeable batteries if you don't want to spend a fortune)-  If its dark you can barely see anything on the LCD screen, you would have to guess.-  The flash takes a while to go off. (I personally don't mind. I haven't had to take any pictures of moving things in the dark. But For Example: If I want to take a picture of a flying bird and its dark, it might take a second for the flash to go off and by then you might miss the shot).All in all I really like this camera.  Its my first one. If its great for me it might be great for other beginners.  Its not great, but its a good acceptable little camera.", "Date": "December 26, 2007"}, {"Title": "Nice digital camera.", "Author": "Gary J. Anderson", "ReviewID": "R2AW6NNKBCX8JI", "Overall": "5.0", "Content": "Can't buy this camera in stores anymore. It's obsolete. This is a replacement for an identical camera that I dropped and broke. I liked the picture quality and features of the original so much, I wanted to replace it with the original. I like it.", "Date": "August 28, 2008"}, {"Title": "horrible waste of money", "Author": "avid reader in Chicago", "ReviewID": "R3BWZ4UUMCAK29", "Overall": "1.0", "Content": "We have had this camera for only about 4 months and have used it sparingly since it is my husband's camera for use at work in case they need a photo of something.  It is already broken.  The lens won't extend and open when you turn it on- thus impossible to use.  When you turn it off, the lens opens up.  It is not worth even $99.00.  How disappointing in this day of digital cameras that HP can't come up with something a little better than a disposable camera from the supermarket.", "Date": "December 3, 2007"}, {"Title": "Nice little camera", "Author": "Sylvester \"Sylvester22\"", "ReviewID": "RPJH9LKW0GBEV", "Overall": "5.0", "Content": "For the price, this nice little camera is very handy and the menus are simple to navigate and use. Unlike some professional reviewers, I have no complaint about its picture quality. The zoom functionality is fun and comes in handy at times. I like it's small size; I can easily carry it in a trousers' pocket.", "Date": "June 21, 2010"}, {"Title": "Third Times A Charm?", "Author": "K. Spahr", "ReviewID": "R21NBGTRW1HAM1", "Overall": "3.0", "Content": "OK, I'll admit it.....this is my third purchase of this exact camera model. I keep buying it as I also own the matching photo printer which I love.My first camera was dropped on New Years Eve and ever since exhibited the dreaded \"Lens Error\" message in the LCD display. I bought a second supposedly \"new\" camera through [...] but when it arrived, I could tell it was not of the new retail variety. It was shipped, camera only, wrapped in bubble wrap without manuals, cords, plugs, etc. It didn't last 60 days before it too was showing the \"Lens Error\" message. A call to [...] for warranty replacement was a waste of time as this \"new\" camera only came with a 30 day warranty. (Last purchase from them by the way!)Now on to this latest purchase. This camera was also listed as \"new\" by a company called Gamzi Digital. When I received it however, it was packaged just like the last one I had purchased. No retail packaging, no manuals, cords, plugs, etc. It did however have the original plastic film covers on the LCD screeen. A quick email was placed to Gamzi Digital to inquire about the \"New\"-ness of the unit. They assured me that their factory rep stated the units were new but since it was a discontinued model, this was how they were sold and shipped. Gamzi also guaranteed me a year warranty for the model and offered to replace it with another model if I did not wish to keep my original purchase. Very good customer service and quick response by Gamzi.So, how does it work? Well, at first I had my doubts. I put in a set of rechargeable AA batteries and right away, received the \"Len's Error\" message....my heart sank as this was supposed to be a surprise for my wife (she dropped and broke the original). I changed to new batteries and the error message went away. Maybe the batteries weren't fully charged? Anyway, the camera seemed to work fine after that. Oddly enough, subsequent uses brought on the same \"Lens Error\" when I first turn on the camera but if I turn it back off and then on again, it seems to work fine.Overall, if the cameras worked without error, I'd say it is a decent camera. Slow shutter speed and click responsiveness but the picture quality is usually ok for family photos and candid shots. The layout and user interface is simple and easy to use. The digital zoom is OK but can be grainy at long distances with a lot of darkening/graying out of colors. Not a professional grade piece by any means but ok for the price.Bottom line? Once this camera dies, and I don't doubt that it will soon enough, it will be my past HP. I'll put the photo printer up for sale and go with a different brand.", "Date": "June 2, 2010"}, {"Title": "Fantastic camera for the money.", "Author": "Stephen L. Parker", "ReviewID": "R3699UGBK2E6DD", "Overall": "4.0", "Content": "I've purchased over a dozen of these cameras for our field technicians. They are easy to use and take great photos. We have had issues with the battery cover integrity and displays that fail over time. Keep in mind these cameras are subject to quite a bit of abuse over their service life. I had one as a personal camera that was subject to a lot of shock. The display finally bit the dust but not after a couple of years of rough and tumble.", "Date": "April 22, 2010"}, {"Title": "Couldn't be happier!", "Author": "Sheri Lynn", "ReviewID": "R5BXEXHGSDMQL", "Overall": "5.0", "Content": "This camera is outstanding.  It is easy to use with a ton of options and features to use.  The software downloads quickly and easily.  It was a perfect gift and I'm glad I bought one for me too!", "Date": "December 18, 2007"}, {"Title": "Perfect", "Author": "Gerald Kurtz \"adrbro\"", "ReviewID": "R1J5YZ1JRO4H2W", "Overall": "5.0", "Content": "The hp M537 is one of the best cameras you could buy, it has a nice 2.5 '' screen and it is very easy to use you can get close with its 18x zoom. It comes with a great easy to use software CD, plus you can change the colors of your pictures and add borders right in the camera.", "Date": "June 27, 2007"}, {"Title": "picture colors unimpressive, problems with stuck between modes", "Author": "M. Laganaro", "ReviewID": "R39G54BBT02UJZ", "Overall": "1.0", "Content": "I just went on vacation and took about 190 pics during all different lights and distances, used diff modes, and videos.  I thought the camera and menus were easy enough to use, but the picture colors were just blah.  Also I had 3 or 4 times in 2 days where the camera jammed with the lense open and zoomed out, but I had a black screen and it wouldn't turn on or off.  I had to mess with it for quite a while and missed 5 to 10 minutes of pictures each time.  I am returning it.", "Date": "September 1, 2007"}, {"Title": "Battery Problems", "Author": "L. Howard \"Randas\"", "ReviewID": "RSUWK088BSNVB", "Overall": "3.0", "Content": "I purchased this camera in June 2007 and after one round of video and pictures on my 2G ScanDisk, I am having battery problems.  It says the battery is full when I have just put a brand new set of Lithium or regular batteries.  The camera is not that expensive, but still I would expect to use it for a few years without problems?  Before this issue, the camera had been great.", "Date": "August 15, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "6-megapixel CCD for beautiful prints up to poster size\n2.5-inch LCD screen\n3x optical zoom; anti-shake mode for steady pics\nIn-camera red-eye removal\n16 MB internal memory; capture images to SD cards", "Name": "HP Photosmart M537 6MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/417q3bI8MaL._SX300_.jpg", "ProductID": "B000N23XG8"}}