{"Reviews": [{"Title": "Digital Cam Newbie", "Author": "JP PAZ SOLDAN", "ReviewID": "R1YOVBWV6XJGEX", "Overall": "5.0", "Content": "Have used it for 2 weeks (40 shots) and so far a happy camper.  I post a long comment hoping to save some aggravation to digital cam newbies like me.I wanted a simple, practical, medium priced, good optics, moderately featured, small digital camera that allowed me to put up pix in a web site or send via email with an easy to load into PC procedure.  No sound, no video, no super ultra resolution (no memory, no printer, no special paper, no patience and no need for more than 640x480 pictures).In the Olympus the USB solution is the best part (although I agree the manual does not make it clear how simple it really is): hook the USB cable into the PC with the camera turned off and without doing anything else you have another disk drive instantaneously, with the Windows File Explorer, click down two directories into your new disk, then click to view or select and drag and drop to copy all your pictures in your PC into any directoy like any old file.  No need to even install the included Camedia photo editor (of which I already have 3 in my PC that do the simple retouch things I need to do to family pix for sharing).  I bought and returned a Polaroid PCD 240(?) that cost a bit less as the \"hassle free\" software did not install at all and I had no way to transfer the pictures into the PC.  And when it worked (in my old PC with the broken screen, to add to my frustration) I realized had to suffer a rotating parrot flash screen from Polaroid and use a program with special buttons and a slow 3 step process every time wanted to download pictures and the loading procedure worked 2 out of 3 times I tried it. So much for user friendliness.  The USB port is quick: less than 30 seconds to download 20+ or 1.6MB worth of pictures and no extra program to run with the Olympus.With the initial Polaroid purchase I discovered ALL digital cameras have the same Alkaline battery gobbling problem, as this Polaroid came with regular AAs and it ate them up in some 20 shots plus the normal testing and showing off you do with any new gadget, I read up a little and discovered this is not a specific problem of the D-100 but of all digital cameras.  Accept the fact that you need better (1600mA Ni-MH batteries) if you want to use a digital camera, as you accepted the need to replace your regular AAs for long lasting Alkalines when electronics got more complicated than transistor radios.  The business here is consumables.  Think Polaroid instant photos and the roll prices, think bubble jet printers and cartridges, think Microsoft Windows and PCs, think Internet and DSL monthly bills. They have to make money somehow. After all, you are buying a product that is more powerful than early PCs and you want it to use the same power source as your flashlight?  Think again.The previous comment about the D-100 lacking the see through viewfinder is plain wrong: that is one reason I preferred it over other other models in which you had to aim through the digital screen, which makes for awkward and shooting. In the D-100 you can turn off the digital viewer and it only comes up for a couple of seconds after a shot, displays it briefly and then shuts off again to save power.  Other issue is memory size vs resolution. The Standard (Low) Quality mode alloes some 80 shots at 640x480 resolution with the included SmartMedia 8MB card. This resolution makes 80KB-120KB files per picture, which actually bigger than they should be for email attachments or to put several shots in a family web page. In a web site with several pictures per page, a large graphic item should be 50-80KB so it downloads at a reasonable speed for regular earthlings.  Sending email attachments over 500KB to international friends which may hook up via a pay-per-minute setup is not a polite thing to do.Finally, I have read in several places (and believe it from Olympus) that the optics top quality for a low-end camera and the that it makes pretty smart corrections to color/focus/lighting and its reaction time is pretty fast.  This was not an initial worry of mine but realized after using two models that it makes a big difference as subjects (especially babies) don't wait too long in the perfect picture taking position.  The D-100 allows you to take 2 pictures per second in its Continuous Shooting mode.  The only (very minor) criticism access to some functions like the picture review function (press and hold the TV button: sounds easy but I could not remember it 2 weeks after I read the manual and tried all the options) and what some options mean, as due to the small size it crams several functions into 6 buttons, but this is a reasonable sacrifice for having a pocket camera that easily fits into your shirt or pant pocket (try that trick with the Sony Mavica or any of the semi-pro models). Again, for family uses or with newborns around, pockets and shoulders are a precious commodity. It much smaller than most other models and its shape feels very comfortable to handle.  The zoom models felt awkward.  Again, for amateur/email/web use, you can do all the cropping in your PC in 4 seconds flat AND reduce file/image size.  Printing digital photos is not for me.  Regular film is more practical/quick/cheap if you want hard copies and I believe will remain so for amateur needs for at least 5 more years.", "Date": "October 22, 2001"}, {"Title": "Start here.", "Author": "Rheumor", "ReviewID": "R2H6FX82798LGV", "Overall": "4.0", "Content": "This is my first Olympus digital, but it will not be my last. It is a very nice beginner's purchase, and would also make a very good backup for a more dedicated digital photographer. The size and weight make it a breeze to carry in a pocket, purse or glove compartment. It has good quality optics, a 1 megapixel resolution (that will allow pretty good 5\" x 7\" prints), good battery life (and can use readily available alkalines) and easy USB connectivity to your PC for transferring images. The included 8 meg card is adequate, though it seems to me this camera, which when attached to your PC is automatically recognized as another drive (a nice feature requiring no software installations), would have benefited from some on-board memory. Furthermore, I do not like cameras that require using the LCD panel to view & frame the image, much preferring a traditional through-the-lens viewfinder, which is absent on the Brio. However, its most glaring short-coming is the lack of an optical zoom (it has a digital zoom, but these are vastly inferior digital tricks that halve the resolution while doubling the size of the selected portion of the photographed image), but if that's not a problem for you, you'll be happy with the rather handsome Brio.", "Date": "June 17, 2001"}, {"Title": "Very battery intensive?", "Author": "Elvis Presley \"fleadip\"", "ReviewID": "R338YK7XKW5Z1O", "Overall": "3.0", "Content": "This was my first digital camera. I found it very easy to use with the quick start intructions. The pictures came out nice and they downloaded easily into my pc.  I took 8 pictures, downloaded them, and spent some time learning the menu options. I figure about 60 to 90 minutes. I turned the camera off. The next day I went to take pictures and the battery was dead. It was late, so I used some Duracell AA batteries, which the instructions said you could use. It took 8 new batteries to take one picture and download it. Forget about making any changes to the settings. I had to put batteries in and take picture right away. These AA batteries lasted about 30 seconds if that much. The next day I went to Walmart to get another battery, the lithium type that it came with. They had several sizes, but they did not carry the size for this camera. And they sell Olympus cameras there, although not this model. It must be an odd size available at camera stores.  I called tech support and asked him if this is the normal life span of the so called long life battery. He said that it did not sound right and something must be wrong, he had never heard of this problem. He put me on hold to check it out. When he came back on he said, and I quote, \"This camera is battery intensive and we reccomend the rechargeable nich (?) batteries\" I asked him again if this was normal for the other batteries or was something wrong with the camera. He replied\" The only thing I am allowed to say is that this camera is battery intensive and we reccomend the rechargeable batteries.\" His attitude leads me to believe I had a bad camera, but that they were not admitting to it. I would be interested in future reviews to tell how the batteries lasted.", "Date": "August 22, 2001"}, {"Title": "Great little camera!", "Author": "J. A. Cline", "ReviewID": "R2R0OZBID4QLNU", "Overall": "5.0", "Content": "I must say that for my needs this camera was perfect. I've got one of the larger \"uber-pixel\" cameras already, and wanted something smaller, lighter and less expensive that I didn't have to worry about losing when I went to parties, camping and other misc. activities... This one's perfect! The 1.3 megapixel is perfect for simply saving to my laptop on the road, desktop at home or simply printing out 4X6 or 5X7 prints, the 640X480 mode is perfect for posting to the web... The included SmartMedia card stores 8 in SHQ mode, 24 in HQ and 82 in 640X480... The other two modes provide and ample 1280X960 resolution. I also purchased a 32meg SM card for 35/99/331 photo storage respectively.Image sizes are roughly 800k in SHQ (1280X960), 300k in HQ (1280X960, more compressed) and 80k in SQ (640X480).Image quality is better than I expected. As I said, it fits my needs perfectly. And about complaints about battery life? I can't say that I agree, I bought the camera (As well as four NIMH rechargables) two days ago, and it's still using the provided Olympus battery after several hours of tinkering, downloading (downloading is very fast, BTW)... etc.All in all I'll say this is a wonderful camera for this pricepoint... Check it out!", "Date": "September 10, 2001"}, {"Title": "My 1st digital camera", "Author": "J. Stevens", "ReviewID": "R3IUFRCM5VQPTT", "Overall": "5.0", "Content": "So, I'm new with digital cameras and I'm not a photography buff ... but I have been surprised (happpily) with this camera. I also bought the 32mg SmartCard and some rechargeable batteries, based on others' reviews.  I've only had it a month, but was on a 2-week vacation during that time and took maybe 200 pictures. I'm very pleased with the quality of photos I'm getting; some of them are astonishing (a lighthouse at sunset from maybe a quarter mile away! Beautiful!). I expected a significant difference in quality from my 35mm but did not see much, if any.  I post photos to my web site where they look great; I also printed some 4X6 in color and BW and they turned out wonderfully. An added plus: It was very easy to learn to use.", "Date": "October 19, 2001"}, {"Title": "Digital Camera for the \"Novice\"", "Author": null, "ReviewID": "R16JIUAPCZ49U", "Overall": "3.0", "Content": "This camera seems to be a pretty good choice for someone new to digital photography.  The price is reasonable and it has all the basic features.  It is very easy to download pictures to the PC via the USB cable.  The only complaint that I have so far (I have only had the camera for 1 week) is that the documentation is not user-friendly.  I had to call customer service to find out how to use the USB download. Their Customer Service Technician provided excellent support.  The software instructions that come with the camera do not address the D-100 model download.  They have added the instructions to their web site.  Overall I think this is a good choice for the \"novice\" that doesn't want to spend a lot for a digital camera.", "Date": "June 5, 2001"}, {"Title": "Great Camera", "Author": "Rita", "ReviewID": "R3FFDU2NDFJWWP", "Overall": "5.0", "Content": "The Brio D-100 is a great little camera.  It is easy to use and and even easier to download the pictures to your computer.  Just plug the camera into your USB port and your computer recognizes the D-100 as an attached hard drive.  Then just drag and drop the pictures from the D-100 folder to your hard drive. There is software to install - but I haven't installed it - no need to.  The LCD monitor display which is used to the review pictures you have taken and to set your various settings works great.  You may preview pictures without turning off the camera by pressing the monitor button twice.  (One review said this was not possible - but it is).  There's just enough features to give you some good options but it is easy enough to set it, forget it,  and shoot to your heart's content.  I recommend it!", "Date": "July 12, 2001"}, {"Title": "Great digital camera for 1st time buyer!", "Author": "Grace Cheng", "ReviewID": "R3EWTY0BJIPWCK", "Overall": "5.0", "Content": "I received this D-100 as a gift. Compared to my friend's Olympus D340R, this camera come with USB interface(finally!) and works fast & great!You don't need to pay extra to buy a USB smart card reader. And standard 640x480 picture looks good on my 19\" ViewSonic monitor.I think D360L (no USB) will be priced down quickly. I highly recommend this to 1st time buyers.", "Date": "June 5, 2001"}, {"Title": "Excellent Camera.", "Author": "Henri Pauli Mikael Welling \"Henri\"", "ReviewID": "R36YAB4JRK4JWC", "Overall": "5.0", "Content": "This is my first digital camera, and I am very happy with its ease of use and performance!  I spent a few months looking for a digital camera and this is the one I ended up with based on price/performance ratio calculations (in my head).  True, it may not have as many features as some cameras, but then again it is meant for one thing:  taking easy digital photos!  I love the size too.  Complaints?  None so far.", "Date": "November 6, 2001"}, {"Title": "batteries for this camera", "Author": null, "ReviewID": "R2RHNIRP92YYJF", "Overall": "5.0", "Content": "I was unable to find a battery like the one that came with this camera (3v lithuim battery, LB-01 CR-V3) here on amazon.com and the recommended battery charger & batteries set does not use these batteries.  I wrote to Olympus and this was their reply. The D-100 can use both CR-V3 lithium batteries, which are not rechargeable, and Ni-MH AA rechargeables. It is also possible to use other types of AA batteries, but we generally only recommend lithium or Ni-MH. This makes it easy!  The Olympus charger kit is more expensive than the Kodak options.  You can get a Kodak K200 charger on here for $25 (does AA AND AAA sizes) and a pack of 4 Kodak NiMH rechargeable AA batteries for $19.  There is also a kit with AA charger and 4 AA batteries for $40, but I don't think that charger will charge AAA batteries.  (4 rechargeable AAA's are $12.)", "Date": "October 27, 2001"}, {"Title": "Paul W.", "Author": null, "ReviewID": "R3QV43E250M15W", "Overall": "5.0", "Content": "Well if you have plowed through 32 reviews so far, you must be serious about buying this or another digital camera. I am 66 years old and, well, not too out of step with the electronic world though this is my first digital camera. I have had an Olympus SLR for years (30?) though that alone was  not a deciding factor in my purchase of another Olympus product. I wanted 3 things 1. Price I could afford. 2 Easy to operate. 3 good pictures. It met all 3 at a 5 level. I also like the feature of showing the pictures on a television. Not as sharp on a tv screen as on my 17inch computer monitor but very nice. I printed a picture of my dog taken outside and printed it on 8x11  plain paper using my deskjet 932c and it looks very nice. I have yet to wear out the battery pack that came with the camera and have taken about 60 pictures, in groups of 6 to 8, and then down loaded them to my computer  and displayed them on verious tv's. I did buy 4 Nickel-Metal Hydride recharables and a charger as it is obvious that this is a necessity for any digital camera. I like to use the old fashion optical look viewfinder as apposed to the screen when taking pictures. Perhaps this is why the batteries have lasted so long. I have a H.P. computer and as soon as I selected \"my pictures\" and connected the camera, the download procedure took off with easy to understand directions. No sweat. And quick. It's a gem of a product!", "Date": "April 14, 2002"}, {"Title": "I Love This Camera", "Author": null, "ReviewID": "RODUYIZKDSG6A", "Overall": "5.0", "Content": "This is my first digital camera and for a beginner it is a breeze to use.  The size is petite so I can carry it in my purse or pocket.  There are enough manual settings to make it fun to use. The pictures are perfect on the default settings even though there's a manual white balance.  The print outs looked like from a photo lab.  I have Windows ME.  There is no download info that comes with the camera, but if you go to Olympus web page they have very complete instructions for both PC and Mac.  It worked just as instructed. So simple!  I love this camera.", "Date": "June 11, 2001"}, {"Title": "Neat and Very Well Done Camera", "Author": null, "ReviewID": "R2U8V96FQC0664", "Overall": "5.0", "Content": "Just bought the D-100 today, it really is a beautiful little camera, very nicely made, gives great results, even the digital zoom, while not as high a resolution as normal, works very well, I did detect in the install manual for the USB driver that something was not right, called Olympus Digital Customer Service, they were the best, we went through it on the phone, it installed in a minute or less, Olympus is sending me via E_Mail the proper instructions, looks like they goofed. no big deal. CS makes up for it. Took many shots and printed them, excellent results, menus are very straightforward and easy and camera works rather quickly for a digital, just to sum it up, a wonderful camera, good price, I wouldnt part with this thing, just love it.", "Date": "July 4, 2001"}, {"Title": "The little camera that can", "Author": null, "ReviewID": "RZJKIQZ9PJSDG", "Overall": "4.0", "Content": "Reasons why I love it:1) It fits easily into my shirt pocket2) The easier the camera is to take with me, the more I am likely to use it3) Great shots are usually unplanned, but this camera's small size makes it easy to keep in the bottom of my brief case for that unexpected image.4) I compromise between small file size & great resolution. I find shooting at this camera's relatively low max resolution that I can get pictures that are a little blurry for enlargements but a little big for email.  So I do neither well, but do both well enough.5) My four year old niece has taken some great pictures with it6) I can change to various white balance presets, and use other \"programmed\" settings to fool the camera into thinking it has as much flexibility as my SLR7) I am very happy with the color qualityReasons why I want a better camera1) I shot a once in a lifetime picture.  I captured the image because I had my small camera with me but the 11 x 17 enlargement looks like it was shot a little out of focus due to the camera's low max resolution.2) It takes to much time and battery power to boot up the camera to use the digital zoom.  I highly recommend a camera with an optical zoomFYI I have been waiting for years for digital SLR type cameras to come down in price.  I finally got tired of waiting and bought this one.  I shopped by price alone; I bought the cheapest one I could find at the time.  I must say that overall I am very glad that I did.  The savings in film costs and processing costs have already paid for the camera.", "Date": "December 17, 2001"}, {"Title": "Perfect Price-Point for Compactness and Image Quality", "Author": null, "ReviewID": "R1HILOIGA5L5O3", "Overall": "5.0", "Content": "Excellent Camera ! Love all the low-tech options - fully automatic,  To take pics slide-cover and click. To see pics (Win 2000) - connect to USB cable (no drivers, software ot install), and the pics are in jpeg in a new drive that shows up ! Other low-tech features - in a snap, run it with 2 AAs Definitely fits in the pocket - the only other camera that would qualify is the Digital Elph - at [price] - too much. Their 'TruePic' feels, looks and smells like 'real' technology - 72 dpi pics look better than some 600dpi pics I have  Downside - No zoom (helps keep it compact)", "Date": "June 18, 2001"}, {"Title": "Never to old to learn.", "Author": "Buck Shuller", "ReviewID": "R8DKYHAL3WV9F", "Overall": "5.0", "Content": "For fathers day I received The Olympus D-100.  I have never had a digital camera in my hands before. By the end of the second day after I received the camera I was sending e-mail with picture attachments. My wife calls it my toy, I call it my pride and joy. If I can do it anyone can", "Date": "June 21, 2001"}, {"Title": "Windows 2000 and XP Compatibility", "Author": "Lawrence Sinclair", "ReviewID": "R3OHUOQF61F6TR", "Overall": "3.0", "Content": "I found that plugging the D-100 into a USB port on my Dell 330 running Windows 2000 Professional consistently produced a \"Blue Screen of Death\". In other words, the computer completely froze up. I have many other USB devices on adequately powered hubs, none of which have caused such problems. Although Windows XP was not listed as a compatible system, I found the D-100 worked flawlessly with my Dell Inspiron 5000 laptop running that operating system. The camera was detected automatically without my loading any new software. XP presented me with wizards to transfer, print, or view the contents of the camera.", "Date": "November 29, 2001"}, {"Title": "Software Tech Support", "Author": "Steve", "ReviewID": "R1BU0N2NIEGHDC", "Overall": "4.0", "Content": "Just received this camera and it is working great, the pictures look good.  The software that shipped with it is another matter though.  The D-100 looks like a \"Removable Disk\" to WIN98.  The only problem with that is that the documentation that comes with the camera never tells you this.  It says you need to run their software to transfer photo's when all you really need to do is use explorer and copy them over to your hard drive.  I called tech support to find this out.  They we very helpful and the wait on the 1-800 line was less than 5 min.  ...", "Date": "June 8, 2001"}, {"Title": "Great Camera", "Author": null, "ReviewID": "R1Y349GF72GATR", "Overall": "5.0", "Content": "I spent a month checking out inexpensive digital cameras, and actually tried to get a couple of others, which were unavailable for one reason or another. I'm so glad! This camera is everything the initiate to digital photography could ever want. The images are very sharp under the normal (default) mode. Downloading to the computer... really easy w/ the Comediamaster software. The included 8 mb smart media card...good for 24 photos at default. Everyone I've sent photos to, can't believe this is only a 1.3 Megapixel. I read every word of the short manual before starting... I recommend that. My only problem with this camera is that it went on sale (-38%) 2 weeks after I bought it. Snap it up at this price.", "Date": "February 14, 2002"}, {"Title": "Not for beginners", "Author": "Audrey Brumley", "ReviewID": "R85YLAFHK4GRT", "Overall": "1.0", "Content": "I had so much trouble with this camera.  First it wouldn't work with my side USB port, everytime I plugged it up it locked up my computer.  So I called tech support and they told me I had to plug it up in the back, and they showed me how to cut and paste the pictures, but didn't show me how to get the pictures through the software.  so I couldn't get the camera to work with the software, it kept telling me the camera wasn't hooked up when it was.  The thing that really got me though was that you have to turn the camera off to view the pictures you just took.  So everytime you want to see a picture you have to turn the camera off and, turn on the LCD.  And then if the picture wasn't good you have to turn the camera back on, turn the LCD back on, and then reset your preferences, it's really annoying.  The only good thing about the camera is the long lasting battery that's included.  I ended up returning the camera and paying $50 more for the Sony DSC-P30.", "Date": "June 29, 2001"}, {"Title": "Alkaline batteries not enough, Lithium or Ni-MH needed.", "Author": "Tina", "ReviewID": "RDM1C6EIABBKX", "Overall": "3.0", "Content": "This is a decent camera with poor instructions / information / design with regard to the battery. Good alkaline batteries don't last a whole day in this camera. Lithium batteries work but need to be replaced more often than in most cameras. The best thing for this camera is to buy Ni-MH rechargeable batteries. Take the batteries out when not using the camera and recharge them often.", "Date": "December 21, 2002"}, {"Title": "Easy Transition from Film - Great First Digital", "Author": "Peter Winterble", "ReviewID": "RJUD9W6ZA9Q08", "Overall": "5.0", "Content": "Remarkable camera for a reasonable price.  Flawless downloading to my PC.  Took me a few days to get the various options in mind so I could access them quickly -- especially \"erase this picture\" so I could free up card space.  Don't know where I would go upwards from here without spending a lot more money for features I really don't need.  This is the perfect vacation, travel, weekend camera and taking pictures at lowest density allows more than 160 frames on a card -- which turns out to be the perfect size for sending along with e-mails.  It does go through batteries more quickly than I had imagined, but that's the name of the digital game -- ... PS: All my previous camera work has been done with single-lens reflexes and other small Olympus models.", "Date": "November 2, 2002"}, {"Title": "D-100 Reliability", "Author": "Carl G Fedelski", "ReviewID": "R20GFBOQJJXU0M", "Overall": "2.0", "Content": "I bought a D-100 in September 2001 and althought it takes great pictures It's been back for repair twice. First with the 1E10 error and then because of shading on the left side of the pictures. I'm beginning to think this model is \"Snake Bit\".", "Date": "May 13, 2002"}, {"Title": "Great Camera at an affordable price", "Author": null, "ReviewID": "R1G76J38I30PU0", "Overall": "4.0", "Content": "When I shopped for a camera, I had 3 things in mind:a) Cost  b) Ease of use c) Quality. My thoughts on howOlympus D-100 rates: Cost:  If you are a beginner looking for a low cost digital camera, this is the one for you. If you are looking to broaden your horizons in photography, go for the olympus D100. I purchased this for $129(new). I even got an additional 16MB smart card -- free! I would say any price under $150 is a good price for this camera. I rate it 5 STARS for the price. Ease of Use: Okay , it comes with a software and all..But on reading the software manual, i found that this camera is not supported by the software. Then upon playing with the USB stuff, i found that it is a auto-detected by the PC. Hence this obviates the need for software. I have Win2000 Professional edition on my PC. To make things easy for people reading the review, i want to state in simple terms how to transfer pictures:1) Attach the USB to the USB card in your PC. The  other end goes to your camera.2) Now start your PC.3) Windows will detect the USB and open up a drive for you. (In my case it was G: drive).4) Now open \"windows explorer\".5)Click on \"my computer\".6) Click on G:7) This will show a folder for your camera. Once you open the folder you see your pictures.8) Transfer the pictures or upload them on the Web and enjoy! This is a very simple process and I would rate it 4 STARS for ease of use. Picture quality: True the quality is not as good as a 4.1MP but it is good enough. This drop in quality is only observed when you zoom in your pictures...But like i mentioned before, it is good enough for a 1.3MP camera.  I would rate it 3 STARS for picture quality.And  finally my thoughts on power drain...I think this is to be expected from almost all cameras. This is not confined to this camera alone. Hopefully , there will be clk gating technology(or better clk gating if they already have it) in the days to come.Hope this review was helpful to you..I hope you have made up your mind whether to go for this camera or not.", "Date": "February 6, 2003"}, {"Title": "Cute little camera, not so cute battery usage!", "Author": "M. Parra \"skaitey\"", "ReviewID": "R1M7603VIJMZD8", "Overall": "4.0", "Content": "I got this camera for my birthday last week, it is very easy to use, put battery and mem card, and off you go.At first I couldn't stop taking pictures, and the battery lasted about 3 days of almost non-stop usage. Although by the 4th day the battery had died and I put 2 alkaline batteries, and after maybe 5 pictures, it would just turn itself off. I think it just drained the alkaline batteries extremely fast, so I don't like that one bit, maybe the rechargable batteries won't be so bad.The camera itself is very fun, although it doesn't have the same features as the D-370, but it comes darn close!If you want to use this camera for basicly just emailing pictures, this camera will be definitely a must have for the quiality (quality is pretty descent) and price ...!I just don't like the battery drainage at all, and that's one thing that really worries me, because I've read reviews on this camera on here, and people are saying the same thing about it!Just one thing, rechargable batteries/AC Adaptor are a must!!", "Date": "October 9, 2001"}, {"Title": "Excellent Camera!", "Author": null, "ReviewID": "R1UV7ITF1B2XS4", "Overall": "5.0", "Content": "Excellent camera overall! Great pictures (better quality than a 1.3 Fuji I have...), small, lightweight, affordable, and easy to connect (no problem with OS 9.0.4 and a USB Cardbus adapter on a Wallstreet G3) - just be sure to have the latest USB update (1.4.1)", "Date": "July 16, 2001"}, {"Title": "Great Camera, very durable", "Author": "\"aaronschofield\"", "ReviewID": "R3T9AV1N1EIY6V", "Overall": "5.0", "Content": "I bought this camera on clearance and couldn't be happier!  It works every time, takes great photos at a nice quality and is auto recognized by iphoto.  Also, this camera is tough.  My 4 year old takes hundreds of photos with it on our 256MB smart media card.  In all a very good buy.", "Date": "July 13, 2003"}, {"Title": "Good for basic snapshots only", "Author": null, "ReviewID": "RQ8U4AGMCACLE", "Overall": "3.0", "Content": "This camera is a great entry-level unit. The quality of pictures is fine for the casual user, and for viewing on your computer and printing out small pics. However, if you want to use a zoom, forget it. The 2x digital zoom is worthless on this camera, since if you zoom at all, you can see many pixels.", "Date": "September 8, 2002"}, {"Title": "Great little camera !", "Author": "rob", "ReviewID": "R23WTSIXT63NTY", "Overall": "4.0", "Content": "... for the price, it's the best camera I've ever owned. I use window's xp, it hooked right up with no new software. It rocks !", "Date": "August 5, 2002"}, {"Title": "OK For Everyday", "Author": "D. Miller", "ReviewID": "R1FQZ2SR7EX8GK", "Overall": "3.0", "Content": "If I had it to do over again I would have bought a camera with a higher pixel count. This camera is great for everyday snapshots but falls short if you want to take sports or action pics. The flash takes forever to recharge and the delay for autoflash is just stupid slow. The digital zoom is pretty worthless since the pixel count is so low. A great deal if all you do is take the family snapshots at holidays.", "Date": "July 16, 2002"}, {"Title": "Good price & easy to use", "Author": "J. Orr", "ReviewID": "R2E9PJW8XB22W2", "Overall": "5.0", "Content": "For the price, the camrea takes fairly good quality pictures. It is easy to learn to use. The video output port is wonderful. The pictures you take while traveling can be viewed on any TV that has an A/V input jack, making it nice to share the pictures with family and friends - when a computer is not available. The camera will take about 24 pictures in its normal mode. I recomend buying a 32MB smart media card - it is like having the equivalent of 4 rolls of film on its normal mode. I am running it on Win 98 and have had no problems.", "Date": "March 14, 2002"}, {"Title": "Don't hesitate, buy this one", "Author": "D. Pang", "ReviewID": "R3N881EV5VRAJ5", "Overall": "5.0", "Content": "Nice brand,compact, easy to use,fast picture taking time,excellent color reproducing and aperture/shutter control which makes the pictures look great. I use a pair of rechargeable batteries and can take over 60 pics.Forget about the damn pixels (1280*960 looks very nice on my 17\" monitor)...", "Date": "February 17, 2002"}, {"Title": "D-100 -- skip it! They have short life spans", "Author": null, "ReviewID": "R3H0L23GU55L7N", "Overall": "1.0", "Content": "My D-100 was, for 1 month, a total joy. Then it turned belly up for no reason whatsoever... dead. Wouldn't power up at all. Tech recommended letting it sit without batteries for a full 24 hours so it would return to factory default settings. Didn't bring it back to life. This camera was handled with such extreme care that one might say I went overboard. And it died anyway. As for battery life, it went fine for days and days and days, 100s of shots on 2 NicM AA rechargable batteries. That is until it died. I went to the Olympus forum on D-100s. Nothing but horror stories and tales of woe. Skip it. Get something else. Waste of nearly $200.", "Date": "July 8, 2002"}, {"Title": "Don't work with Windows 98!", "Author": "Jerome Bigge", "ReviewID": "RYF7MZYCBNJ9Q", "Overall": "4.0", "Content": "Bought this camera, found it took great pictues, but the camera isn't capable of working with Windows 98.  It will work with Windows SE, Windows ME, Windows XP, but if you don't have these operating systems, the camera won't download.  I believe you might be able work around this problem by buying some sort of adapter, but the floppy type won't work with my Compaq due to the way the case is styled, so I ended up taking the camera right back.  So you do need to check whether or not the camera of your choice is capable of working with the operating system that you have.  Other than this, the D-100 is a great camera.", "Date": "March 19, 2002"}, {"Title": "Wrong adapter is suggested", "Author": null, "ReviewID": "RMDCV5TI3WHU8", "Overall": "5.0", "Content": "I'm certainly not a professional photographer, but I really like this camera and the pictures I've takes so far.The power adapter they recommend is not the one that goes with it, you don't want the c-7au.  You want the E-7au.  At least that's what the folks at Olympus told me.  Will know soon...", "Date": "October 23, 2001"}, {"Title": "Excellent value for money, great for indoors picture taking!", "Author": "Yong Thung Cho", "ReviewID": "R3C6UKXN10URGN", "Overall": "5.0", "Content": "Picture quality of this camera is impressive. I tried taking pictures with it indoors.  It was much better than I expected.  Even with lowest recording resolution, it looks like real picture in my computer monitor, even much better than Sony FD75 which is much expensive than this camera. It takes very good pictures for closely located objects with flash on, even closer or little more than a foot away. If you are looking for cheap camera with good picture quality this is it.If you are worried about batteries, buy AC adapter.  I'm just using 3 V, 2.5 A, not expensive digital camera AC adapter, but it is working fine.", "Date": "October 15, 2001"}, {"Title": "Great camera-if you can find batteries", "Author": null, "ReviewID": "RU2BTRI7P4GYR", "Overall": "3.0", "Content": "I recently purchased the D-100, based on various positive reviews listed on this page. I purchased this camera specifically for an extended trip. The camera works great and the quality of the pictures is excellent. However, when the battery (provided with purchase) was no longer good, I could not find a replacement. Stores such as Wal-Mart and Target, who carry this product, don't carry the batteries. I searched for a replacement battery within a 500 mile radius, but no luck. As a result, I was unable to take pictures that I will never be able to get again. I intend to contact Olympus directly to bring this marketing problem to their attention. It appears that Olympus makes it intentionally difficult to locate replacement (one-time use) batteries, requiring consumers to purchase their batteries and charger for $60.00.", "Date": "September 24, 2001"}, {"Title": "good for the price", "Author": "john e young", "ReviewID": "R3IX2A7FFF14EE", "Overall": "4.0", "Content": "came with out memory card or usb adapter I recieved a partial refund I managed to find a card and usb cord from other sources. takes great pictures", "Date": "July 6, 2013"}, {"Title": "Hard to beat for the price.", "Author": "Jerry Smith", "ReviewID": "RFHFZGUAVNVC7", "Overall": "5.0", "Content": "My wife bought this camera 3 years ago after reading a positive review.  She likes the camera because it is small, simple to use, and has been dependable.  She isn't a computer whiz but she has no problem using the program that comes with the camera.  Her only complaint was battery life.  She  recently bought a Digital Concepts battery charger at walmart that comes with 4 - 2000mah Nimh AA batteries for $17.00.  Now she can get over 70 pictures with no battery complaints. With good batteries and a good charger this camera is an amazing value at the price.", "Date": "May 10, 2004"}, {"Title": "i love my digital camera", "Author": "matt", "ReviewID": "RIO87DO5L5CR2", "Overall": "5.0", "Content": "I got my digital camera last year for christmas and I love it! I love the zoom and the lcd screen! That is all I can say is I love it!", "Date": "October 20, 2002"}, {"Title": "Great Digital Camera for the money but...", "Author": null, "ReviewID": "R10IFNGFGQL7O9", "Overall": "4.0", "Content": "I've owned this camera for over a week now.  Excellent picture quality and easy to use.  The only problem is that it does drain batteries -- please buy rechargeables ASAP or you will go through quite a bit of AA batteries.Overall -- Very good camera!  It will be hard to upgrade from this camera.  Picture quality -- excellent, Ease of use - great, USB connectivity -- flawless...If you've *never* owned a digital camera -- this is the perfect starting Digital camera.", "Date": "September 7, 2002"}, {"Title": "It suits my needs as an entry level camera, and works fine.", "Author": "EA van Bekkum", "ReviewID": "R2N6DSLZHVZ9UU", "Overall": "4.0", "Content": "I had been looking for an affordable digital camera that I can slip in my pocket yet one that produces acceptable quality pictures. I think that the C-100 (c-You in Europe) meets these requirements.I had no problems installing the camera in Windows XP but I have to admit I did not use the additional software yet. My only dissapointment is the battery life, which may be influenced by the heavy downloading by the computer and the video screen usage, but it's a standard AA battery input so you can just slip in those batteries.The quality is OK for what I need it for, just take the SHQ (which indeed may require a 64MB chip rather than the supplied 8MB one). If you are looking for state of the art camera's, skip this one, but if you are looking for a second camera or an entry level model, I think this one is definitely the best one in the market right now.", "Date": "April 3, 2002"}, {"Title": "Olympus D-100", "Author": "Gilbert Reed", "ReviewID": "R27K22DYOZE9GU", "Overall": "2.0", "Content": "I've had this camera for a couple of weeks now.I also have a Fuji Finepix-1400 that I have had for about15 months. The olympus is not even close to the quality thatcan be achieved with the Fuji. The color is not easy to get right with the Olymous. Also, you don't get a users manualwith the Olympus until you print out 104 pages on your printer.Not easy for a novice to figure out.", "Date": "March 17, 2002"}, {"Title": "Cute little camera, not so cute battery usage!", "Author": "M. Parra \"skaitey\"", "ReviewID": "R3MFG89W58BCUD", "Overall": "4.0", "Content": "I got this camera for my birthday last week, it is very easy to use, put battery and mem card, and off you go.At first I couldn't stop taking pictures, and the battery lasted about 3 days of almost non-stop usage. Although by the 4th day the battery had died and I put 2 alkaline batteries, and after maybe 5 pictures, it would just turn itself off. I think it just drained the alkaline batteries extremely fast, so I don't like that one bit, maybe the rechargable batteries won't be so bad.The camera itself is very fun, although it doesn't have the same features as the D-370, but it comes darn close!If you want to use this camera for basicly just emailing pictures, this camera will be definitely a must have for the quiality (quality is pretty descent) and price (around $200)!I just don't like the battery drainage at all, and that's one thing that really worries me, because I've read reviews on this camera on here, and people are saying the same thing about it!Just one thing, rechargable batteries/AC Adaptor are a must!!", "Date": "October 9, 2001"}, {"Title": "Cute little camera, not so cute battery usage!", "Author": "M. Parra \"skaitey\"", "ReviewID": "R1E3EKEULJX55A", "Overall": "4.0", "Content": "I got this camera for my birthday last week, it is very easy to use, put battery and mem card, and off you go.At first I couldn't stop taking pictures, and the battery lasted about 3 days of almost non-stop usage. Although by the 4th day the battery had died and I put 2 alkaline batteries, and after maybe 5 pictures, it would just turn itself off. I think it just drained the alkaline batteries extremely fast, so I don't like that one bit, maybe the rechargable batteries won't be so bad.The camera itself is very fun, although it doesn't have the same features as the D-370, but it comes darn close!If you want to use this camera for basicly just emailing pictures, this camera will be definitely a must have for the quiality (quality is pretty descent) and price ...!I just don't like the battery drainage at all, and that's one thing that really worries me, because I've read reviews on this camera on here, and people are saying the same thing about it!Just one thing, rechargable batteries/AC Adaptor are a must!!", "Date": "October 9, 2001"}, {"Title": "Very battery intensive?", "Author": "Elvis Presley \"fleadip\"", "ReviewID": "R3MUF1JRIHE722", "Overall": "3.0", "Content": "This was my first digital camera. I found it very easy to use with the quick start intructions. The pictures came out nice and they downloaded easily into my pc.  I took 8 pictures, downloaded them, and spent some time learning the menu options. I figure about 60 to 90 minutes. I turned the camera off. The next day I went to take pictures and the battery was dead. It was late, so I used some Duracell AA batteries, which the instructions said you could use. It took 8 new batteries to take one picture and download it. Forget about making any changes to the settings. I had to put batteries in and take picture right away.", "Date": "August 22, 2001"}, {"Title": "Pretty good one for the money you spend", "Author": "Dileep", "ReviewID": "R1U3KU4IIAJ5ML", "Overall": "4.0", "Content": "I've had very good results with this camera. The pictures are of excellent clarity. May be the best bet for a 1.3 Mega pixel digi cam. No provision for using rechargeable batteries.", "Date": "April 27, 2002"}, {"Title": "Great!!!!!! MWA!!!!", "Author": "Satya B", "ReviewID": "R3BPSP89TIS10T", "Overall": "5.0", "Content": "i was present for me and iam mad with it. must buy for a begginer great picture quality!!easy connect to PC!!go for it!!!!!", "Date": "November 27, 2001"}, {"Title": "Bad Battery life", "Author": null, "ReviewID": "R2BTUSCDR21YK3", "Overall": "1.0", "Content": "This was also one of the first cams I brought. I purchased this camera around the first of December and with in a week the battery was dead. I have not been able to locate the battery that fits this camera and I am very disappointed with this product. The pictures were good for what I needed it for posting pictures to websites but don't be too far from your subject.", "Date": "January 31, 2002"}, {"Title": "Terrible, extremely shoddy product", "Author": "P. Agarwal", "ReviewID": "R2E4CM09H81QWO", "Overall": "1.0", "Content": "I bought the Olympus Camedia Brio D-100 in Oct 2002. Got it for about a hundred greens. Thought I had a landed an awesome deal, until the camera proved you get what you pay for. CONS:1. Battery eater: No rechargeable battery is good enough for it to last through 20pics. I couldn't leave batteries in it for a week - they would be run down in that time.2. Major issues with focus: The whole user interface with communicating when its ready to shoot is incredibly unreliable. I would switch it on, and wait for the green and amber lights to stabilize. They would sometimes, and not others. Even worse, they would and wouldn't on the same shot, with the same composition. Very frustrating.3. Unreliable save: I was never sure if it saved a pic. Sometimes I would press the button - but nothing. No indication on the camera what's wrong. Then I would have to close the cover, reopen it to switch it back on, and pray it will shoot this time - 50% chance. No indication of what's wrong. Using the LCD at the back is a pain too. Often it wouldn't have enough power left to let you browse through to see if it took pics alright.I could go on and on, but the sum total: very frustrating, unreliable camera, best take your money elsewhere. I don't care about bells and whistles, but one expects if its called a camera, it will take pictures. If its called a camera 100% of the time, it will take pics a 100% of the time!!As for mine,after missing some critical pics on a very important family occasion, and some more of household items while documenting before a relocation, I finally hit it against my tiled floor, broke it in a hundred pieces, drilled through it in various places, and am sending it to Olympus's HQ with a letter explaining what they should have done themselves that I had to PAY them to do!", "Date": "August 24, 2003"}, {"Title": "Very Good Product", "Author": null, "ReviewID": "R1DES0BB56RVVG", "Overall": "5.0", "Content": "Buy it, very good quality camera for the price.", "Date": "August 28, 2002"}, {"Title": "MY NEW OLYMPUS D100", "Author": "\"jhking\"", "ReviewID": "R7ED3Q6Q1DFQ5", "Overall": "1.0", "Content": "THIS IS A VERY GOOD CAMERA,ITS EASY TO USE AND UNDERSTAND.VERY EASY AND FAST TO PRINT PICTURES. ITS JUST A NUMBERONE CAMERA ALL THE WAY.", "Date": "August 25, 2002"}, {"Title": "A couple quick questions.", "Author": null, "ReviewID": "RGNH7VTRHVKLW", "Overall": "1.0", "Content": "In the product description and reviews, there is NO indication as to the NUMBER OF PICTURES (frames) the camera can store with (or without) added storage card.  Also, how many pictures can one take in terms of life of batteries (or charge)?  Does # of pix vary based on type of battery?", "Date": "August 14, 2001"}], "ProductInfo": {"Price": "Unavailable", "Features": "1.3 megapixel sensor creates 1280 x 960 images for prints at sizes up to 5 x 7\nHigh-quality autofocus Olympus lens with 2x digital zoom\nIncluded 8 MB SmartMedia memory card holds 10 images at default resolution\nEasy USB connectivity with Macs and PCs\nAlso features 1.5-inch color LCD monitor, built-in flash, and self-timer with 12-second delay", "Name": "Olympus Camedia Brio D-100 1.2MP Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/416J1TMRYTL._SX300_.jpg", "ProductID": "B00005ATWQ"}}