{"Reviews": [{"Title": "So far So good", "Author": "Xbsims \"Chris\"", "ReviewID": "R2H8Y5NE6QVEMM", "Overall": "4.0", "Content": "I rated this with 3 stars because it does not go in half increments would have rated it 3.5 stars if I could, because it does have some minor issues but for the most part I have been happy with it.The good:1. Very large screen. 3\"2. On camera photo adjustment such as cropping, red eye, Panoramic, slimming feature ( everyone likes this feature).3. Very good picture quality.4. Mode features are intuitive.5. pretty compact for large screen.6. Video feature pretty good for a camera lets you choose different resolutions and will let you zoom while videoing. the ISO is pretty good on this as well for shooting at night. Will let you run the video for as long as you have memory or battery life. My older Canon would only let me do 30 second shots. Would have been nice if flash would also act as light.Comes with 32 meg in the camera. Very small but would let you get a few shots in if you filled up your memory card.The not so good.1. anti-shake feature does not work with mode feature for night shots had to use auto mode to get best picture. Would need a tripod for night shots.2. With the buttons on top handling the camera can cause you to accidentally turn the camera on when you don't want to.3. the battery compartment/ memory card door is difficult to close and lock. it takes an effort to lock the tab. opening is OK though.4. docking, which at first sounded like a plus. is not the easiest to use. the camera does not slip into this easily, I had to pick it up and line it up to use. It will charge the camera for you while you down load files though.5. The battery life is not great, I guess a trade off for a large screen and compact design.The BAD:1. I had camera lock up on me 3 times since owning it. (only a month so far, got it after Thanksgiving 2006)seems there is an issue sometimes when saving or viewing video on the camera. Had to remove battery to get the camera working again. It froze when I went to try to view the video on the camera. It also happened to me when I was saving a panoramic shot. It will also take long time to go from taking a picture to using the video right after each other I would say around 10 seconds. This can be a long time when you are trying to get a shot quickly. I am planning to contact HP to see if this is a common issue and if it is will they offer a firm ware update on this camera to correct these issues.Don't get me wrong, I do like this camera. I have been a fan of HP for a while. I will update this opinion if things change as I use this more.", "Date": "December 13, 2006"}, {"Title": "I love this camera", "Author": "D. Smith", "ReviewID": "R3CNQ9KOGS7QCT", "Overall": "5.0", "Content": "I take about 1500 pictures a year, and previously used a Canon PowerShot S400 4MP - which was a great camera: easy to use, very portable, and took great photos. I started doing some digital editing of my photos (photoshop) and found that I needed more than 4 MegaPixels. So, I looked at the latest Canon and found that the 7MP PowerShot was the same price as HP's 10MP camera. Hmmm, tempting, they seemed to match each other in size and function, but HP seemed to edge it in a few funtions and 50% more pixels! ... so I gambled on HP.My first concern was that HP would not take as good photos as Canon. Well, I was wrong on that. HP takes great photos ... and has this great feature called \"adaptive lighting\" that automatically brightens pictures taken in dim light. Wowzers! That's an amazing function. You can watch on the crystal clear 3\" display as your dull photo is automatically transformed into a great photo a second or two after you've taken it. Wow!My second concern was that it would not have the full range of features that I was used to on my Canon Powershot- panorama stitching, zoom, close-up, etc. Well, I was even more wrong on that. This camera is *packed* full of features:-Firstly, it has an excellent user interface that's really easy to use. The clear on-screen menu is easy to navigate and explains how to get the most of each function as you go, and is also very quick to navigate.-Secondly, it has instant red-eye removal (that really works) - I've now taken about 900 photos with my HP and I'd estimate maybe 1 or 2 red-eyes have crept by, all other have been removed automatically. I'm impressed.-Thirdly, it has a ton of other funtions my Canon didn't have -- e.g. burst mode, auto-settings for different lighting situations, etc -- and a beautiful 3\" screen that's the clearest I've seen.I've owned this camera for about 7 months and it's a delight. There are a few things that can be improved, e.g. travel recharging without needing to carry the dock with you, button placement to prevent occassionally accidentally pushing on-off ... there's always something ... but these are really minor compared to the excellent picture quality and great features included.If you're like I was and wondering if you should gamble on HP, go for it. I'm not looking back!", "Date": "July 3, 2007"}, {"Title": "Screen size, plus excellent quality photos", "Author": "J.P. McCubbin MD", "ReviewID": "R3E918WGG38567", "Overall": "5.0", "Content": "Honestly, when buying this camera the huge selling point is the 3\" screen size.  I bought this as a gift, one for my dad and another for my mom.  The main reason for the purchase was my mother constantly complaining with our old camera that she could never see the image on the little screens and so didnt know what she was shooting.Secondly, the resolution on the screen is just amazing.  With a 2 gb SD card you can use this also as a digital photo album(although watch out for the battery life.Last, and most important, the 10 MP picture format is wonderful.  We were previously using a Nikon, which I was more than happy with and that product is far overshadowed by the HP.Excellent product for most any user!", "Date": "December 21, 2006"}, {"Title": "10 MP!  Great viewing screen", "Author": "James Brownlow", "ReviewID": "R2OVPSHLH9C3BU", "Overall": "5.0", "Content": "I've had the R967 camera for three months.  I bought it because 1)I've always had great service from HP, and 2) I wanted more resolution than the 5MP camera I was using.The camera is a stainless steel box, and has a very sturdy feel.  On/off is easy and the 3\" focus/viewing screen is nice.  There are a myriad of features on this camera, including adaptive low-light shooting and the ever-popular \"slimming\" feature.  I've used the low-light feature, and it worked quite well (sample size=1  LOL)..A few observations: in low light I had trouble getting the \"macro\" feature to focus, the document feature is great, who needs a scanner? great resolution, excellent pictures, I'm not wild about the feature buttons on top of the camera.. I've hit one or more by accident.Over all I'm quite pleased with the camera and I recommend it.", "Date": "March 15, 2007"}, {"Title": "Amazing", "Author": "N. Megill", "ReviewID": "R1SC5RAJZ0YFF8", "Overall": "5.0", "Content": "I absolutely love my camera. It does everything it says (by the manufacturer), and it does it without hassle.This camera:-is very easy to use-is sleek in design-is handy-takes amazing pictures-takes high quality pictures-has a sufficient battery life-has many features-**and the list goes onI have many HP products (my laptop, desktop, two digital cameras, two photo/copier/fax/scanner printers, Pocket PC) and I am always satisfied. This camera has not ever let me down (I've owned it for a few months now). I have had many compliments on the camera and the features and pictures it takes. I would most definitely recommend this camera to anyone.Buy with confidence!!!", "Date": "June 21, 2007"}, {"Title": "nice features - but not the best camera for a family with small children!", "Author": "Heather Jungk \"Mom\"", "ReviewID": "R2IBYEC1A4Q8CA", "Overall": "2.0", "Content": "I love the features that the camera offers.  They're a bit redundant as they're the same types of things I use with my photo program anyway, but it's nice to have them available on the camera itself.My biggest complaint is that with a 2 year old and a 1 year old - trying to capture moments quickly is beyond frustrating with this camera.  The half-press focus (hoping that it focuses on the area you're asking it to) seems to take a lifetime when you're trying to follow action!  I've tried to just point and shoot - but the photos are never in focus.I've also found that the \"saving to memory\" time is rather long, even when you decrease the Megapixels.This would probably be a great camera for someone else, but for a mother of two - I would NOT recommend it.  I've only had it 4 months and I'm online right now shopping for a new camera.  :(", "Date": "February 23, 2007"}, {"Title": "Great shots!", "Author": "S. Thomas \"FWB Pastor\"", "ReviewID": "R3W96JYBL423I", "Overall": "5.0", "Content": "This is a great camera for the price. 10 MP pictures are crystal clear. The panoramic feature is awesome. The large view screen makes picture snapping easy. No more AA batteries!!! The downsides are: 1) there is no view finder as an option if the battery is low so that an individual can turn off the view screen and save battery life, and 2) camera must be docked in order to charge battery and download pics.", "Date": "August 12, 2007"}, {"Title": "piece of junk", "Author": "M. Edwards \"book addict\"", "ReviewID": "R1DBOHHQQJ7U3T", "Overall": "1.0", "Content": "I bought this camera less than six months ago, (from Best Buy, not in a big hurry to pay a restock fee) and I've already had to replace the battery twice and the charger once.When it \"worked\" it was fine, but now HP's customer services answer to the fact the charger isn't charging the new battery is to buy a new battery.It's ridiculous to have to buy a new battery for every day I use the camera. (which happened when I took it on vacation to Georgia. The battery died in one day.)My recommendation? DO NOT BUY THIS PIECE OF JUNK. One of my family members works for HP and she recommends the same thing. I wish I would have known before I threw my money away on this item. I am now looking for a new digital camera and a friend has suggested Nikon. (he's a professional photographer, so I'm going to take his recommendation.)I'm so disappointed in this product and more disappointed in the lack of customer service. Never again will I buy an HP product.", "Date": "June 14, 2008"}, {"Title": "Just Great!", "Author": "Auristela Tovar \"A.T.\"", "ReviewID": "R2ECE5SWMG26PM", "Overall": "5.0", "Content": "The Camera is excelent ! I mean, pics look amazing ! (haha, I'm not a expert ). The only thing that I don't like about it, it is that almost need flash in every pic...anyway, it is a great product. Ahhh, and if you want to take photos to your lil kids, it is too slow for that XD !", "Date": "May 30, 2007"}, {"Title": "Never Again", "Author": "Melody", "ReviewID": "R19NB0F612XRU3", "Overall": "1.0", "Content": "I wish I had never bought this camera. My last camera (a Nikon) was very user friendly and the pictures came out beautiful with very little settings adjustment. With this camera I have to fiddle with the settings on a constant basis. The color is often off and the focus can be tricky. Having said all that I made the best of it but yesterday the docking station just stopped working and I cannot get power to the camera. I figured it would be easy to replace the docking station but HP does not sell it without the camera and I can't find any other outlet, not even on e-bay. Time does not allow for me to pull the battery out of the camera to put it in a recharger every time I need to shoot pictures which I do for a business a number of times each week. This problem makes the camera useless to me. What a waste of money.", "Date": "January 8, 2011"}, {"Title": "Perfect camera for me!", "Author": "Kerry Dorsey", "ReviewID": "R33PDTHKUJVVL6", "Overall": "5.0", "Content": "I had to duplicate this purchase when I lost the first.  I was really hurt.  It's perfect for me.", "Date": "June 2, 2009"}, {"Title": "Camera", "Author": "B. Herndon \"happy mom\"", "ReviewID": "R30B3IPN24TV2I", "Overall": "5.0", "Content": "We've had this camera for a couple of years now and I still love it. It's small so i can carry it with me all the time and it's a great little point and shoot camera.", "Date": "September 4, 2007"}, {"Title": "Clyde's hp R967", "Author": "Clyde Bowman \"book author\"", "ReviewID": "R1LRVAMJZG66QR", "Overall": "5.0", "Content": "HP Photosmart R967 10MP Digital Camera with 3x Optical ZoomI've several digital cameras including hp 945. Hp has a way to go on service. I bought this camera becuase I like it's features and easy to use menu. The price is excellentfor this much camera. I bought an extra battery and it charges in the camera.I would buy this product again.I would reccomend HP R967 to friends.", "Date": "November 21, 2007"}, {"Title": "black eye", "Author": "Christopher Fletcher", "ReviewID": "R3G5SM4UWA9R6S", "Overall": "4.0", "Content": "when using the remove red eye process most of the time the eyes get super blacked out.", "Date": "October 18, 2007"}, {"Title": "This Camera Can Make You Look Skinnier", "Author": "Elizabeth Myers \"ElizabethMyers07\"", "ReviewID": "R2JFMNZHVANT89", "Overall": "4.0", "Content": "When we heard about this camera, and its so called \"slimming\" feature, we were both dubious and curious. Yet the feature worked beautifully and the camera overall is great. The screen size is handy, and the weight of the camera feels nice compared to other lightweight point and shoots. Check out our extensive review of it, and the pictures we took at[...]", "Date": "July 24, 2007"}, {"Title": "I like this camera, but there are better ones available", "Author": "Denise Fnord", "ReviewID": "R2LY1G245LKRSA", "Overall": "3.0", "Content": "I bought this camera as a replacement to the one exactly like it I broke. I could have bought a better one, something newer, but I like this one. It's simple and heavy duty.", "Date": "April 24, 2013"}, {"Title": "Excellent Purchase", "Author": "L. R. Liddick Jr.", "ReviewID": "R2NJYD27PFLP44", "Overall": "5.0", "Content": "Bought this for my wife a couple of Christmas' ago and we love it.  Easy to use, easy to hook into computer, and nice screen on the back to view the pictures or even when taking pictures.  I would recommend this camera for a family anytime.", "Date": "January 7, 2010"}, {"Title": "HP R967 Digital Camera", "Author": "B. Horn \"Bets86\"", "ReviewID": "R18ZFX7OZ6N609", "Overall": "5.0", "Content": "I have a preference for HP Products and had been happy with my original HP photosmart 635 bought Nov-2003. Then, in Nov-2005, I upgraded to an HP photosmart R817 after seeing the awesome photos taken by a tour mate on our African Safari to Kenya, and simply LOVED it and the photos I took with it -- even bought one that Xmas for a gr-niece, who had taken a Photography class and admired mine! Then in Oct-2007, while traveling in Germany, I dropped the camera while touring a monastery in Corvey, and could no longer take outdoor photos... only inside with/without flash!! So, after finding that this version was no longer available, I opted to try the R967, since it was the closest to the 40X total zoom of the R817 and used the same type battery, instead of AAs; R967 has 30X total zoom. I'm still working to get all the features down, but I like it 'almost' as well as the R617!! I can highly recommend it to other amateur photographers!", "Date": "December 28, 2007"}, {"Title": "HP Photosmart R967 10MP", "Author": "O. Lopez \"ojlr2003\"", "ReviewID": "R1W3QARLX4YLJA", "Overall": "5.0", "Content": "It's an excellent camara, I'll recommended, you can get a lot of it, but you should buy a SD to get better results.", "Date": "May 13, 2007"}, {"Title": "A little Information !!!!", "Author": "BudoDaddy", "ReviewID": "R2N0OT3FAHXNC8", "Overall": "3.0", "Content": "Bought an HP Photosmart R717 in the summer of 2005 for $324.74. 4 months after the camera warranty was up and after minimal usage the camera was displaying: 0000000F-10FB-1BD-024 Error Message, on the display screen.When I called HP about getting my camera repaired I was told that it would be too expensive to repair. I was informed it would cost around $200.00 dollars to receive most likely a refurbished replacement camera, with only a 3-month warranty.After trying the replacement camera for 15 days I was then to send my old camera back as partial payment for the replacement camera.I told HP no thanks, because they had already gotten enough money from me.", "Date": "December 18, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "Get crystal-clear shots with the 10-megapixel resolution\nCapture just what you want with the 30x total zoom (3x optical, 10x digital)\nUse HP's in-camera Design Gallery options to slim down your subjects, add borders, and more\nAutomatically remove red eye, right in the camera\nCapture the action in high-quality VGA video with audio", "Name": "HP Photosmart R967 10MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/413VB22VDRL._SY300_.jpg", "ProductID": "B000HWHOA0"}}