{"Reviews": [{"Title": "A perfect beginner camera at the lowest price you will find!", "Author": "J. A Hayes", "ReviewID": "RGTKJ7RVZS33A", "Overall": "5.0", "Content": "The Kodak CX7300 was a steal at $100. I have wanted a digital camera for a while but did not have the money to shell out for one, but I read the reviews and they are all true. For this price you could not find a better camera for beginners or casual users. It is extremely easy to figure out, and after about 30 min-1hour I had mastered my new toy. Battery life seems to be reasonable up to this point and that is great because I plan on using this thing quite frequently. You can take pics in color, black and white or sepia, all giving a good picture quality. I havent bought a memory card yet, but on the lowest quality setting you can snap 67 pics using the internal memory. Using the best quality it can hold 17 pics. I have made some pretty good pics so far even on the lowest setting. There is a night mode with flash for what else but night pics, and the auto setting is for general picure taking with the flash automatically flashing when there isnt enough light in the room. The 1.6 inch lcd screen is cool, giving you the option to review and keep or delete the pics that you take. The camera even has a movie mode where you can take a very small movie clip (without sound). Included with the package is the software you will need to organize and edit your pics on your computer as well as a tutorial to teach you everything you wanted to know about the Kodak CX7300. This camera is so user-friendly though that chances are you will skip the tutorial and be snapping pics very soon after you buy it. So that is all I can say about this camera. It is a great bargain yet high quality product that I would highly recommend to anyone looking to start digital camera-ing that doesnt have a whole lot of money to get it started. I sure am glad I bought one.", "Date": "November 1, 2004"}, {"Title": "Great Camera, small quirks", "Author": "NoddingLilith", "ReviewID": "R1GIGJCPOP5ZCS", "Overall": "4.0", "Content": "The CX7300 is the third Kodak camera I have owned, and thus far it has been the best.  The price is great and the camera is very easy to use with a lot of great options.  The Kodak EasyShare Software is some of the best photo software on the market. The camera takes high quality pictures for only being 3.2 mp. I only had a few issues with the camera.  My main problem is that there is no cover for the lens.  Even with the camera turned off you can touch the plastic lens covering.  The second problem I had is that there is also no cover for the connection port on the bottom of the camera.  You have to get a case for this camera if you are going to take it outdoors with you in order to avoid dirt, damage and other problems with both parts of the camera.", "Date": "July 16, 2004"}, {"Title": "Great inexpensive digital camera", "Author": "\"wolf_pack\"", "ReviewID": "R24AM5HVZLNU59", "Overall": "5.0", "Content": "I have a Sony Digital Camera that I love but my husband, who is sort of camera illiterate, wanted to use it often so I bought him an easy one of his own -- Kodak Easy Share CX 7300.  While I had to set up the computer portion of it for him, he was taking pictures within a few minutes.  The software is wonderful and easy to use as well.  Everything is explained on the computer monitor.  No need to read through the manual.  I do not have a dock but the cable is very easy to use.  We just love the camera!!!", "Date": "March 15, 2004"}, {"Title": "No surprises", "Author": "Andres Cooper", "ReviewID": "R709NLP6GZGNF", "Overall": "5.0", "Content": "Hi, I bought the camera 30 days ago. I have taken more than 150 pictures and batteries are OK. Using the internal memory (16MB) the camera allows you to take up to 67 pictures in low resolution and up to 17 in max resolution (you can choose among 4 options of resolutions). However, I don't think the difference is too high. So I always use it in the low resolution. I have also bought a digital flash card of 256MB (SD256M), for $35, and now it allows me to take 306 pics in max resolution and 1184 in low resolution. It is nice. The only problem I see, is that it doesn't record sounds in video recording. Just images (15 secs). Camera is light, works well, and it is all that I expect from a camera. I have had no surprises.", "Date": "September 26, 2004"}, {"Title": "Great point and Shoot", "Author": null, "ReviewID": "R31EFPBE5KJO48", "Overall": "5.0", "Content": "Ok, this camera does not have an optical zoom, but for general point and shoot pictures this may actually be an advantage.All you have to do with this camera is turn it on and it's ready to go.The controls for this camera are very easy to use, and it has several advanced features, like auto white balance and night shot mode. Best of all, this camera takes outstanding pictures.  It rivals any small 35MM for picture quality, and the Kodak software works really well for both filing and printing.I bought this camera as a kind of second camera for Spring break, but wound up using it more than my \"main\" camera because it is so easy to use.", "Date": "March 9, 2004"}, {"Title": "Staten Island NY Loves this Kodak Camera!!!!", "Author": "Big Daddy \"S.I., N.Y.\"", "ReviewID": "R1CBVODIRZC3JH", "Overall": "5.0", "Content": "This is not my first digital camera. My first one is a Mavica 0.3 Mega pixel.  This Kodak camera is small but powerfull. I was able to take it out of the box, pop in the 2 batteries that come in the box and push in a 256 mb SD card and off I went. I set the camera to 3 stars *** which means best quality and the screen told me I have 306 pics left to take...I don't know about you but that beats a roll of 36 exposure 35mm film anyday (and not to mention the 21 photos per floppy disc with the Mavica).  The auto setting, controls  all settings. I took about 40 shots so far, put the SD card into the SD reader in my computer, without installing the software from the Kodak box that came with the camera ( YOU MUST INSTALL THE SOFTWARE FIRST INTO YOUR COMPUTER BEFORE YOU ATTACH YOUR CAMERA TO YOUR COMPUTER VIA USB CABLE OR DOCKING SYSTEM...KODAK SAYS THIS 4 TIMES IN THE INSRUCTIONS).. and boom there they where, great, clear, crisp and colorfull shots. The indoor shots of things like flowers and people and a few cats where the bomb (that's good).  The outdoor night shots looked like a painting...(thats good too)...OK NOW FOR SOME FACTS: YOU MUST GET THE FOLLOWING WHEN YOU BUY THIS CAMERA...RECHARGEABLE BATTERIES AND RECHARGER...I PCKED UP THE SONY BRAND FOR $19.00 AT AMAZON..KODAK DOES NOT WANT YOU TO USE AA ALKALINES...YOU MUST GET A CASE..$9.00 IN WALLMART OR KMART OR AMAZON...YOU MUST GET A 256MB SD CARD...DONT FOOL AROUND WITH ANYTHING LESS CAUSE YOU'LL LOVE HAVING MEMORY FOR 300 PHOTOS AT BEST QUALITY OR 1000 PHOTOS AT GOOD QUALITY...SD CARD 256MB AROUND $30 AT AMAZON OR WALLMART...EVEN COSTCO....OH ONE MORE THING I GOT FOR THE CAMERA WAS A NECK STRAP, THE WRIST STRAP THAT COMES IN THE BOX IS ...WELL A WRIST STRAP..THE NECK STRAP MUST HAVE THE LOOP AT THE BOTTOM TO ATTACH TO THE CAMERA...ABOUT $9.00 I GOT MINE ON eBAY....  In conclusion...buy this camera", "Date": "January 5, 2005"}, {"Title": "Highly Addictive For The Digital First-Timer!!", "Author": "K. Fontenot \"Prairie Cajun Regenerated!\"", "ReviewID": "R3OCEGBMJZC008", "Overall": "5.0", "Content": "This is the first digital camera that I have ever owned.  I'll be honest in saying that I was a little uncertain of how to react to this camera when I ordered it from Dell.  Once I received it, however, I came to love the CX7300 very quickly.  It is so easy to use.  Just point and shoot whatever you feel like.  Turn it to auto mode so that it automatically adjusts to get just the right brightness and color.  Use night mode for good shots after dark.  The video mode is also handy, though I purchased this camera primarily for still shots.My first major test for the CX7300 was the final game of the regular season for the Houston Astros.  I was seated along the third base line.  The zoom feature allowed me to get decent shots of the players, especially third baseman Morgan Ensberg and the scoreboard in front of the Crawford Boxes at Minute Maid Park.  Players on second base and beyond became harder to distinguish, but the camera did a great job as far as I'm concerned.  The Astros won the game, as well as the NL Wild Card to make it into the playoffs.  Naturally there was confetti, fireworks, and all-out celebration everywhere in the park.  The camera picked up all of this quite easily.  I probably looked like some kind of freak taking pictures of the confetti, but it was just one other way for the CX7300 to prove its flexibility of use.  Exterior shots of Minute Maid Park came out great.  I even managed to get a shot of one of Houston's finest astride his police horse.I plan on using this camera on any and every trip that I go on in the future.  It's small size, brilliant photo-taking ability and overall ease of use makes it the perfect fit for a roadtrip, ballgame, birthday party, etc.  I highly recommend it for the beginner like myself.  As good as this camera is, Kodak is definitely going to be the first company I look at when it's time to upgrade to a fancier camera.", "Date": "October 4, 2004"}, {"Title": "Happy! (at last)", "Author": "Iron Chef \"Iron Chef\"", "ReviewID": "R2AKESWHP7T6XU", "Overall": "5.0", "Content": "This is my third digital camera in the past 2 weeks. The first one was an Aiptek, but that felt so flimsy that I was sure it wouldn't last 2 days. The second was an HP, which guzzled batteries like they were going out of fashion. This, being the third, works like a charm. I am using the batteries that came along with the camera for the past 3 days, and so far, no signs of dying!! The software is just superb. For about $100, this camera is a steal! The picture quality is as good as HP, maybe even better! The camera feels strudy, the controls are easy to use and the menus very simple. Whats more, Kodak gives a one-year limited warranty. (HP gave only a 3 month warranty!)", "Date": "July 25, 2004"}, {"Title": "Power-Hungry Camera", "Author": "Melissa K.", "ReviewID": "R2XL4AIHLX79N2", "Overall": "4.0", "Content": "For its price, this is a nice, simple little camera.  Compared to a higher priced digital camera that I have used, the night time feature on this camera produces grainy pictures.  My main complaint is how fast it goes through batteries.  Be prepared to either spend a small fortune on disposable batteries, purchase no less than two pairs of rechargeable batteries, or at the very least, buy stock in Energizer.  I found that it likes only fresh batteries, so don't expect the camera to operate when you steal the AA's out of the remote control.  When the camera does use whatever juice from fresh pair of AA's you swear you just put in, save them for other things like toys, flashlights, remote controls, etc.", "Date": "November 29, 2004"}, {"Title": "nice relatively simple digital camera -- poor battery life", "Author": "techmannn \"techmannn\"", "ReviewID": "R2U3WFRXXHXZ35", "Overall": "4.0", "Content": "I wanted a simple digital camera that, if it broke, I wouldn't care so much.  This is better than I expected.  It has only a digital zoom, but I knew that when I bought it.  What I couldn;t have known is that the battery life isn't that great -- maybe one hour of time with fresh batteries.  Bring more batteries with you wherever you go.One big plus is that Windows XP sees the camera without any additional software needed.  You can install the Kodak software if you want, but you dont need to. You can just move pictures back and forth between computer and camera like they are files.  This is perfect.  If you still use windows98 I doubt the camera will work this easily.", "Date": "November 20, 2004"}, {"Title": "Great camera for outdoors at a low price", "Author": null, "ReviewID": "R31WNK423S55AR", "Overall": "5.0", "Content": "For its price, this camera is great for outdoor pictures. I took this on a recent vacation to Hawaii, and got some great shots in the mountains and beach as well as undersea (in a submarine, of course !). I have them as my wallpaper now and look cool !  Indoor and night pictures turned out to be quite grainy with chromatic and grain noise, which need manual adjustment using Neat Image or other denoising software (a good free one is at [...] ).There are not many features, just basic delete,digital zoom, flash settings, video (without sound but quality is OK) and exposure setting. However, you can improve the pictures using gamma correction etc. after downloading to the PC (use free Irfanview or Photoshop) . The LCD quality is just good enough to review the pictures, not great like the >$200 models. If you are on a tight budget this is a good choice.", "Date": "June 9, 2004"}, {"Title": "Great Camera", "Author": null, "ReviewID": "REBS5LF0RBNQV", "Overall": "5.0", "Content": "The Kodak Easyshare CX7300 is a great camera. The picture quality is great and the camera is very easy to use. It is very easy to get started as they walk you through all the steps. The software is also very easy to use. You can easily blow pictures up without major loss of quality even at 8x10in. If you use the zoom (digital) the quality drops quickly.  It does eat up batteries quickly so I recomend a battery charger but that is usual with digital cameras. The movie mode is also pretty good. The movie size is small (only 320x240) but it is a great for catching those special moments.  My only complaint is that the camera does not come with a lens cover so extra care must be taken.  The CX7300 is a great camera for it's price and is very user-friendly. It is great for digital camera beginners.", "Date": "May 1, 2004"}, {"Title": "SIMPLE", "Author": "Breninem \"Brenda\"", "ReviewID": "R1W6YSC4ZB46E", "Overall": "5.0", "Content": "I just bought this camera last week for my 17 yr. old son to take to prom.  I didn't want to spend alot of money on an expensive digital for him and from all the reviews I had read it seemed like the perfect camera.  This is the BEST camera I have ever purchased!!  It's so easy to use, the pictures turn out great....I could not be happier.  I used the PICASA program from google to store my pictures on and printed them out right from my own printer on picture paper and they turned out better than in the store.Could not be happier with my purchase!  Well worth the money!!!", "Date": "April 13, 2005"}, {"Title": "Good Starter Camera", "Author": "Donna Scanlon", "ReviewID": "R1WSUFRZPSNCR3", "Overall": "4.0", "Content": "I bought this for my 8 year old. (very responsible 8 year old)She graduated from instant and advantix brands and constantly wanted to borrow my sony cybershot....This camera is very easy, point and shoot. Great for a digital beginner. Pictures are great. Everything is auto. You will definitely need a regargeable battery pack. Close ups and \"nearer\" shots only...don't expect to zoom....like I said..for the beginner, or the untechnical that want a good camera.", "Date": "November 22, 2004"}, {"Title": "nearly perfect for beginners", "Author": "Livvie", "ReviewID": "ROTUXVETMEJYY", "Overall": "4.0", "Content": "I have never used a digital camera before and bought this one based on the reviews I have read. Within 15 minutes of buying the camera I was taking photos and was able to e-mail them with no problem. The software is easy to install and easy to use. Perfect for beginners. The photo quality is surprisingly good for the price of the camera. The only reason I am giving it 4 instead of 5 stars is because there is no protective lens cover. Other reviewers have also mentioned this, and it is the only complaint I have. I suggest buying a camera bag if you are going to be taking this camera anywhere. Overall, it is an excellent buy, great deal for the money and very easy to use.", "Date": "August 18, 2004"}, {"Title": "feels like a toy", "Author": "Rebecca N", "ReviewID": "R21B1JPAVJO8E7", "Overall": "3.0", "Content": "The quality of the pictures is good.  The interface is really easy for a beginner to learn.  However, there are two significant drawbacks to this camera.First:  The camera feels like a toy -- it's extremely light and has a plastic body.  I bought this as a gift for my mother (a total beginner) and while she was grateful, even she could tell that this felt \"different\" than the digital cameras we all had.  It felt more like a child's toy -- similar to what you'd expect a Barbie Doll camera for an 8-year old to feel like.Second:  The viewscreen quality is very poor.  When my mother took a picture, she looked at it and asked \"is that what the picture looks like?\"  It was very grainy on the viewscreen -- though it was fine once we uploaded it. I would compare the quality of the viewscreen to what you see on camera phones.In total:  The quality you actually get when you upload is a great bargain for the price.  However, the quality of the camera body and the viewscreen is truly terrible.  That might be ok for some people who care about the final image only.  However, since I bought this as a gift, I now regret this purchase.  I can deal with entry-level etc. I'm not bothered by no optical zoom -- my mother didn't need that. But when the camera itself just feels and looks \"cheap\" it's a problem.Understand these two limitations in your purchase decision.  I would not give this as a gift, as the gift reciever will notice immediately that the camera is far inferior to the cameras s/he has seen other people using.", "Date": "November 24, 2004"}, {"Title": "VERY HAPPY WITH THIS CAMERA!", "Author": "MIRANDA HENDERSON", "ReviewID": "R1MB5BPCHVLVWI", "Overall": "5.0", "Content": "THIS IS MY FIRST DIGITAL CAMERA, AND I AM VERY VERY HAPPY WITH IT.  IT'S EASY TO USE, RIGHT OUT OF THE BOX.  GOOD PRICE, AND THE PICTURES ARE GREAT.<br />IT COMES WITH SOFTWARE TO GET YOU PUTTING YOUR PICTURES ONLINE AND EMAILING THEM RIGHT AWAY.<br />GREAT CAMERA GREAT PRICE, HIGHLY RECOMENDED!", "Date": "February 13, 2005"}, {"Title": "Great Camera, Even Better Price!!", "Author": "AnthonyR.", "ReviewID": "R2IL2SJYHQ3QI5", "Overall": "5.0", "Content": "I wanted a digital camera for some time, but with so many out there I had no idea which one to get. I decided because it's my first camera I'd get a cheaper one, and since Kodak is a trusted name in photography I went with theirs. Well, I'm loving this CX7300. For $100 dollars the picture quality is superb. 3.2 MP is enough for me - the casual user.Armed with my 256MB SD Card, and some rechargeables I take it with me everywhere. At best quality, I can take 300+ pictures. The red eye and night features are added bonuses and the abilty to take short (soundless) movie clips is always handy. I dont like however, that the clips are saved in Quicktime (.mov) format. One other downside is you shouldn't expect much from the 3x digital zoom.I never installed the bundled software nor have i ever connected the camera to my pc. I just take the card out a slip into the reader when I need to save or have a little fun with Photoshop. I plan to keep this camera for a while and use it like crazy. I'm so glad I didn't get one of those expenxive ones, this CX7300 is all I need!", "Date": "January 16, 2005"}, {"Title": "Great all around, bad red eye, good for price", "Author": "T. Crowe", "ReviewID": "RE718A6Z6XZ49", "Overall": "4.0", "Content": "I have been using this camera for 4 months and really like it.  I have taken around 500 pictures and the majority come out great.  Without using the viewfinder I can take about 100-150 pictures with and without flash before the batteries need to be replaced.  I purchased a 256 MB card for it and according to the LCD it can hold ~270 pictures at max resolution.To comment on some of the other comments, I haven't had any problem  with the lens cover or the camera turning itself on/off.  I do keep it in a bag most of the time.  I used the internal USB connector a few times but have switched to simply pulling the SD card out and using a USB reader, it's much faster.My only gripe about the camera is the redeye.  If the flash is used inside or outside at night, redeye is almost guaranteed.  I don't know if it's because there is no redeye reduction or b/c the flash is so close to the lens.  I end up correcting the redeye in about 90% of the pictures I take at night/inside.The camera is also a little slow to start up but it's manageable.  All in all I would buy this camera again.", "Date": "April 18, 2005"}, {"Title": "A Thrilled Newcomer", "Author": "tcmat \"twmat\"", "ReviewID": "R48SINGUXJ1RW", "Overall": "5.0", "Content": "I ordered this on a grudge Monday PM (1st online buy), after a hideous visit to a local retailer who apparently didn't need my business...I was taking photos with it 3 days later.  This camera is great, feels high quality, and is very easy to get used to.  Only gripe: just noticed the price went down $10 today! (but the free shipping helps there; promised 5-9 days, actually here in 3).  I was crazy to wait this long to do this: both the camera and Amazon impressed me (and no, I'm not a stockholder in either!)", "Date": "March 11, 2004"}, {"Title": "just what i wanted", "Author": "santa cruz woman", "ReviewID": "R2PSJVF1UCOVAX", "Overall": "5.0", "Content": "I don't know anything about cameras or computers and have never worked with them.  This camera is extremely easy to use. I had no trouble reading the directions to set it up. I took 14pics and went down to the drugstore. I had to buy something called a sd card which is a little p-lastic thing to make the pics. They came out with such rich natural color. It was very easy to use the drugstore machine.  I took pictures of a bright blue subaru.  Have not tried the video or motion parts yet.  Even in sulight the screen is easy to see.  The reviews that said this is ideal for beginners were right. I'm 60 and a bit leary of gadgts but the drugstore machine was very easy to use.  I love this camera, will end up taking more pics than I had ment to, it is such fun to use.", "Date": "June 18, 2005"}, {"Title": "Batteries?", "Author": "Ben Jammin (Isaac) \"Musically aroused\"", "ReviewID": "R19FMYO09ZOZQD", "Overall": "4.0", "Content": "The resolution indoors was not fantastic, but expected.  However, I noticed some other reviewer complaining about the batteries being difficult to find because of the special need for a specific battery type.This is not true.I plugged in plain old Duracell cheapos and it worked fine.  Do not hesitate to buy this camera because of this complaint, because it is a false complaint.The camera works very nice for the price, and traveling with it is easy and you don't worry too much about it getting stolen, cause it ain't worth much.Also, don't worry about the SD disk that someone else complained about, they are available in most stores (Target, Wal-Mart) as well as here on amazon, look it up.", "Date": "May 6, 2005"}, {"Title": "Great Camera!!!", "Author": "Dustin", "ReviewID": "R2TXWV46GN5515", "Overall": "5.0", "Content": "I bought this camera at best buy and you cant write reviews on their site. I thought I simply must tell people about this camera. It Is SOOOOOOOOOOO easy to use and you can get high quality prints too. I thought the picture quality was amazing. I would reccomend you buy this camera at best but though. When you put it in your cart at bestbuy.com it is only $116 and next day shipping is $6.15!! The video quality was pretty good too but you can only record for 30 seconds and it has no sound. But who buys a digital camera to shoot videos anyway? I say if you want an excellent camera for a low price you should buy this one.", "Date": "July 16, 2004"}, {"Title": "great camera for price but has a few design flaws", "Author": "ABCD \"homeschool helper\"", "ReviewID": "R3F5685ZMYON8U", "Overall": "4.0", "Content": "My family bought my mother-in-law one of these for Christmas and it was her first ever digital camera.  I really pushed to get a Kodak camera because I have a 3+ year-old DX3500 which still works great and is easy to use.  However, there have been a couple of irritations with this CX7300 and I see at least one complaint already mentioned here.  Unlike my older model, this one doesn't have a cover or even a way to cover the plastic clear lens which covers the actual lens.  Thus, you can easily leave fingerprints or whatever on there and obviously that would affect the photos.  The bigger complaint is that she received a simple camera bag to hold this in and it fits nicely inside if not a little tight.  However, this has caused an annoying problem.  The on/off switch is on the top of the camera and it easily turns on when the camera is put into our pulled out of the camera case.  Albeit, the case didn't come with the camera, however, it was a surprise that the switch could be turned on so easily and often without being aware of it.  The result of this is that batteries tend to die more quickly.  I write this only for the benefit of anyone who purchases this camera to realize they should select a camara carrying case that is not too tight fitting.  I don't really have a solution to offer since I haven't had a chance to take the camera to a store and try other cases.  Maybe another owner of this camera can comment on their success with this.  Also, I would never take a photo without setting the resolution at its highest, thus I would recommend purchasing at least a 128MB or higher memory card.  I think in my mother-in-law's case we went with a 256Mb card, just in case she should ever want to use the video feature.  Enjoy your Kodak camera!", "Date": "February 25, 2005"}, {"Title": "Best for the price - but get accessories", "Author": "Michael Goeller \"urusovguy\"", "ReviewID": "R1KW5Q5WXYX9ZE", "Overall": "5.0", "Content": "When I went searching for a digital camera, I was looking for something inexpensive with at least 3 megapixels (which is enough for simple pictures and website publishing) and the ability to transfer pictures easily in multiple ways.  I never imagined I could get that for $100.  I have been very satisfied with the Kodak CX7300 and would recommend it highly.  But since you are getting it for such a steal, you should also invest in some accessories to make your life easier.A cable and software are included with the camera, so you can download pictures easily by pressing the one-touch \"share\" button (once you have the software loaded on your computer).  But you basically have to download all of your pictures at once and you are using up your batteries somewhat as you do that.  Kodak also makes docking stations that work with all their cameras, but I wanted to get something that could work with other electronic devices as well.  So I also purchased SanDisk ImageMate 5 in 1 Reader (under $20) and a Viking 512 MB Secure Digital Flash Card (under $50 from Amazon) -- which is less than most docking stations.  The storage capacity on the CX7300 alone is very minimal (16MB), so you will definitely want to pick up some type of flash memory card.  512 MB may be more than you need to buy, but it sure makes your life easier.  I actually still have not filled up the card and I've been taking lots of pictures for over a month now.  The SanDisk device makes transferring pictures to any computer easy, since it is just like using an external disk drive that plugs into a USB port.  The combination of the two helps conserve batteries (I still have not changed them) and is very easy to figure out.  I never read a manual on any of this (including the camera, which is very user-friendly), and I wouldn't call myself a \"tech guru\" by any means.One small reservation about the camera's design: the on-switch is a turning wheel on top of the camera and so it can easily turn itself on as you slip it into a pocket or backpack and it rubs against a surface that turns the wheel.  I've often found my camera in the \"on\" position as I took it out.  But this does not seem to have done anything obvious to my battery life, so there may be a sort of sleep mode if it is left on for a long period (I haven't investigated this fully).I'd also recommend you pick up some lithium batteries.  Friends recommended rechargable batteries, but I can't be bothered and the initial cost is discouraging.  I find I'm getting lots of battery life.", "Date": "April 8, 2005"}, {"Title": "Works like a charm!", "Author": "Perro", "ReviewID": "R3CYRTI5UNS689", "Overall": "5.0", "Content": "Great camera here.  Worth the $100 I've spent for it.  Takes great quality pics.  I read the reviews on this camera and thought I'd give it a shot.  I'm sure glad I did.  If you want your very first digital camera, spend the $100 on this one.  You'll be glad you did.", "Date": "April 16, 2005"}, {"Title": "Moved too quick to be this slow", "Author": "D. Avantika", "ReviewID": "R2VSIYDZU8PGHR", "Overall": "3.0", "Content": "My previous (and first) digital camera was a Kodak, which served me well...thus I was inclined to purchase Kodak a second time. I do not quite regret the purchase totally...I was indeed on a budget AND in a rush to get a replacement device, so I was willing to make some leeway in features.The camera is a 3.2MP offering under $150, which is quite competitive. It also has capability at night, something I really wanted in a camera. The one caveat about this camera is it's speed...it's slow, you gotta wait a beat before the camera or subject moves from position. This is a bit annoying for those fun candid shots of friends that you could *ahem* accidentally send to your address book on purpose. That's pretty much the reason I rate it at three stars.Glad I got that night mode though.", "Date": "December 3, 2004"}, {"Title": "A Great  First  Digital Camera!", "Author": null, "ReviewID": "R2PXDLTB2ML90B", "Overall": "5.0", "Content": "I got this camera about 3 months ago and it is still working great!  It takes fantastic pictures and has a long battery life.  The only down fall is the internal memory.  It holds about 20 pictures by itself but you can easily by a memory card for 15 bucks that can hold 150 more!  The camera is a great price and you can use it right out of the box.", "Date": "August 20, 2005"}, {"Title": "Awesome for the price.", "Author": "Steve Haverda \"SynPanda\"", "ReviewID": "R2F57AYXUFF05Q", "Overall": "5.0", "Content": "Picture quality is superb! Movie mode is great, just wish there was sound too. For the price, this is a gem. Ez to use and a snap to work!", "Date": "February 15, 2005"}, {"Title": "All the camera you need !", "Author": "Mr. Programmer \"Mr. Programmer\"", "ReviewID": "RFTWUV9JWV0U0", "Overall": "5.0", "Content": "I was skeptical due to the low price. But this camera takes clear sharp pictures with great detail and high resolution. The 'Auto Mode' makes it simple to take shots. Everything is easy. The pictures are breathtaking!State of the art, it does everything you need, for viewing your pictures on the pc and/or for prints. No other digital camera comes close at this great price. No wonder it's often sold-out almost everywhere.", "Date": "February 12, 2005"}, {"Title": "Great Camera!", "Author": "ciriasly", "ReviewID": "R2YKCTH6B7YVEU", "Overall": "4.0", "Content": "I think its a great little camera. I am happy with the picture quality. It takes a little work getting the night pictures right. I bought this for a trip to Vegas and my friend and I just loved it. It was simple to use which made getting other people to take pictures of us easy. I agree with an earlier review that said it does seem light and cheap. However, I dropped the camera from a height of about 3 feet to a concrete floor and it survived with no problems. Besides if it did die in that instance, I didn't pay that much for it. The best advice I read in the earlier reviews was to buy a camera bag and make sure you have extra batteries. There is very little warning the batteries are about to die. Also, I would get a digital card to take extra pictures.Overall, I am very pleased with the camera and I take pictures all the time now.  I definately recommend this camera as a beginner camera or if you just don't want to or have a lot of money to spend.", "Date": "January 5, 2005"}, {"Title": "Great Camera", "Author": "P. Butterfield \"-P\"", "ReviewID": "R1EZSNEH5F3LO7", "Overall": "4.0", "Content": "What a wonderful camera. My first digital camera, works wonderful. Pictures are breath taking. When looking through the digital viewfinder the quality is not the best(6/10), but when you snap the picture it's great(9/10). I have only used it indoors so I don't know outdoor quality. Please buy alot of batteries!! It is now 1:20PM I have been using it since Midnight and Im on my thrid pack(2xAA) of batteries!! It eats them quickly I have taken about 50 pictures(highest quality) and 40secs of video. This camera is so simple and none of the features have been left out of it. Kodak's Photoshare software is wonderful, and easy to use. Besides battery life this camera is a 4/5. Wonderful for the expert or first time user.", "Date": "December 25, 2004"}, {"Title": "Info you may need about the batteries!", "Author": "A. Barker", "ReviewID": "R2DVQEV5HV0Q71", "Overall": "5.0", "Content": "I like this camera, and when ordering it, trying to be prepared, I ordered extra alkaline batteries and a memory card and a camera carrying case.  I read the instruction book and in there it says DO NOT USE ALKALINE BATTERIES!  I took a look at the batteries in the camera, and they are Oxy-alkalines.  What's that?  I looked all over the Kodak Web site - nothing.  I e-mailed the customer service and they sent me back to the Kodak Web site (nothing there, remember?) and after several e-mails I was linked to a Web site in CHINA!  The minimum order was 200,000 batteries!  I did a Web search and found nothing.  I finally wrote the CEO of Kodak, and he forwarded my letter to a very nice man in the Kodak organization who answered every question I had.  He linked me up to a Web site that has the batteries here in the USA and they are very reasonably priced.  He also told me that lithium batteries are NOT rechargeables (which I did not know) and would last longer than the oxy-alkalines!  So if you aren't able to invest in a recharger and rechargeable batteries ([...] then try the lithium batteries available on Kodak's Web site.  Or get the Oxy-alkalines at [...] I hope this helps save you some frustration when it comes to the batteries.  My camera was supposed to come with lithium batteries but they ran out and included the oxy-alkalines instead.", "Date": "April 12, 2005"}, {"Title": "Great value and ease I love it!", "Author": "Caroline F. Murphy \"Caroline F Murphy\"", "ReviewID": "R1FGMR79IG437F", "Overall": "5.0", "Content": "This is a great camera for the price. Very easy to use, the included software is very complete.Perfect to email pictures.The red eye problem happens even with expensive cameras.I have not had that problem using the flash.I find that the pic look best if it is dark, inside for example.<br />I would recommend this camera to anyone.", "Date": "November 30, 2004"}, {"Title": "What you save on buying film, you'll lose on batteries...", "Author": "Robert Cardinalli \"cosmically-psychic-bob\"", "ReviewID": "R1YB6EN2B5IIGI", "Overall": "1.0", "Content": "I bought this camera for myself during Christmas 2004.It was suppose to be a utility camera, ebay items and class projects for the kids only--I don't trust digital cameras for family photos.The Kodak CX7300 seemed to fit the bill; inexpensive, easy to use and with more than enough resolution at 3.2mp.The flaw in this camera didn't appear until I pulled it out of the drawer some months later. The camera wouldn't turn on. I checked the batteries and they were in excellent shape. I eventually tried replacing the batteries and, sure enough, that worked.The next time I took out the camera, the exact same thing happened. And the time after that.At first, I thought the CX7300 was eating the batteries. But eventually I came to the conclusion that the camera doesn't eat batteries, it nibbles at them. It won't run on anything but brand-spanking-new batteries.The Kodak batteries that came with the CX7300 are still in my mini-mag flashlight, going strong.I contacted Kodak about this flaw. They wanted to talk about what kind of batteries I'm using--Kodak--or the option of my purchasing a Camera Dock and some rechargeable batteries. A solution that would increase my investment by about seventy-five percent.I thought that buying an optional AC Adapter would be the simple, and cheap, solution. Surprise, surprise, the CX7300 is one of the few digital cameras Kodak makes that doesn't take one.So, now that I'm way past warranty, what do I do with it?I'm shopping for another camera.", "Date": "August 11, 2006"}, {"Title": "So glad I bought it!", "Author": "Mary", "ReviewID": "RZAI5FJQ3GS7O", "Overall": "5.0", "Content": "I am so happy that I waited for this camera. I bought my daughter a Vivitar before Christmas and she likes it a lot. Then I decided that I wanted a camera as well and researched. I liked what I read about the Kodak. I really like the black and white/sepia/color options. I love black and white photography and it is so nice to be able to switch back and forth.<br />The camera is so easy to use. I popped in the batteries and started shooting (to the annoyance of my kids)<br />The software was easy to download and understand.<br />I already uploaded some pictures and have sent them to friends.<br />I read somewhere that the camera feels light and cheap....I couldnt disagree more. It feels great in my hand.<br /><br />The only two points I could make that aren't great....the shutter speed seems a bit slow. Maybe all digital cameras are this way? I wouldnt know but it seems to be a while from the push of the button till the flash. Kind of hard when you are trying to capture a 14 month old!<br />The other item is the lack of pouch or bag for the camera. My daughter's came with a small bag.<br />I will have to pick one up when I purchase a memory card.<br />The camera will hold 17 regular pictures in it's internal memory.<br /><br />", "Date": "January 2, 2005"}, {"Title": "Great camera for starters", "Author": null, "ReviewID": "R3TEBVJKGC9A9L", "Overall": "5.0", "Content": "My husband has a digital camera and it was not as simply to use unlike this one. My husband decided to buy this one for me as an anniversary gift since I love to take pictures. It is easy to follow, step by step instructions. With the auto focus and flash, all my pictures have come out great. I am very, very, happy with this camera. The software that comes with the camera is also easy to follow. Even a beginner can use it. I guess my Minolta i will be put on top of the shelf.", "Date": "June 19, 2004"}, {"Title": "I love it!", "Author": "Artistic_c \"Christina Y.\"", "ReviewID": "R8M7485A4DDMU", "Overall": "4.0", "Content": "This is a great camera. The quality is good and the camera is very durable. I've accidently dropped the camera several times, and it still works. However, I would suggest getting a memory card if you want to take more than 24 pictures at a time.", "Date": "April 15, 2006"}, {"Title": "Great entry-level camera", "Author": "Catspec \"Catspec\"", "ReviewID": "RLFK6INLOWGBA", "Overall": "4.0", "Content": "This camera is excellent for its price.  I wanted an easy automatic point & shoot and I wanted the best for the least amount of money!  I have several excellent film cameras, and I love point & push after years of manual settings.  I never thought I would ever leave my Leica Mini behind on a trip, but on my last vacation I took only the KODAK.  Get a 256 memory card, and get the lithium battery - I bought mine in June 05 - battery still fine after a couple of hundred pics.  You must remember not to get closer than the recommended distance, and the camera is all auto - fixed focus, no manul exposure.  There are several flash settings and a delay setting, and a few distance presets.  Strictly the Brownie Hawkeye of today (although the Brownies were much hardier), and thats fine.  You have to know this, and not expect more.  The major failing of this camera is the battery door, which is the most flimsy and hard to shut little thing. I cannot imagine that it will last long if opened frequently. It is really difficult to mash in the battery while closing the tiny plastic door. All the camera buttons, etc., are rather small, but this is standard in digicams. DO NOT DROP this - this is not built to drop - I would not recomend it for active children or active sport, although with constant wearing of the wrist loop and extra care, I have not dropped it.  KODAK EASY SHARE software is \"easy\". I stopped using my photo manipulation software routinely and now use KODAK EASYSHARE, and just take the easy way and order prints and other photo items from KODAK GALLERY (formerly Ofoto).  Service is fast and excellent.  Great starter camera, you won't want to mess with film again unless you are a pro.  I use a Mac running OS X, and the software is not only compatible, but Mac friendly and nice to look at!  I have seen the Windows version, and it is not nearly as nice looking as the Mac version - thank you KODAK! I do not use iPhoto.  Easyshare does not duplicate photos - it uses your own folder setup, which I really like.", "Date": "August 11, 2005"}, {"Title": "Delighted!", "Author": "Sabrina Nicole \"Sabrina\"", "ReviewID": "RO1VA4Y2FWCEK", "Overall": "5.0", "Content": "I've really enjoyed this little camera. I did the usual, checked out all of the reviews, and I agree that it's a great beginner camera for a nice price. The picture quality is excellent, and uploading the shots is a snap. I don't have the extra card for additional memory, but this is rarely a problem for me, as I'm always near a computer and can upload. I highly recommend it for recording the little day to day actions of life- it's fun and extremely user friendly!", "Date": "August 2, 2005"}, {"Title": "Great product! Linux compatibility superb!", "Author": "Steven Hilton \"mshiltonj\"", "ReviewID": "R31C6DM8ZEAFSS", "Overall": "5.0", "Content": "I am very impressed with this product. For a mere $100, I was able to get 3.2 megapixel pictures with great color. The camera options were easy to figure out and use.One thing I want to add, on top of all the already superb reviews here, is that its compatibility with the Linux operating system is great.I run Fedora Core 3 on my home computer, and all I had to do was plug the USB cable into my computer and it recognized the camera, the pictures, and gave me all the options I needed to downloads the pics. I didn't have to install any software all! It all happened automatically. I am very impressed.I have no complaints at all.", "Date": "April 11, 2005"}, {"Title": "AS EASY AS PIE!", "Author": "Judy Godsey", "ReviewID": "R1UFWHQKLM9CZC", "Overall": "5.0", "Content": "I just recently purchased this camera because I bought a more expensive model with lots of &quot;Goodies&quot; on it and was very dissapointed with that model. This little Kodak is easy to use and does one heck of a job. Had no problem with it from the beginning and would happily recommend this to anyone, especially people who are not &quot;High Tech-Minded&quot;. Kodak came through for us again..thanks Kodak!!", "Date": "January 25, 2005"}, {"Title": "SWEET!", "Author": "andrea", "ReviewID": "R2L05BZ2BGWSEX", "Overall": "5.0", "Content": "I received this camera for Christmas and I love it! It is really easy to use  and it doesn't take a brain scientist to know how to operate it! I haven't yet printed out any pictures, but I like how easy it really is! The software program really works great too! I would recommend this camera anytime!", "Date": "January 7, 2005"}, {"Title": "Excelent Camera", "Author": "J. Flores", "ReviewID": "R2KFS5YY4QOLGM", "Overall": "4.0", "Content": "I bought this camera because this one is very cheap instead of others, when the camera arrival I took a picture and I love it. However, there is a tiny problem, when you use a night mode shoots, it is very sensible to movement, so there is a lot of photos shot at that mode and the result was not good. But now I took night photos in normal mode, and they look great.", "Date": "October 14, 2004"}, {"Title": "good camera, dumb reviewers", "Author": "NoCensorship", "ReviewID": "R2Y8S3CQ0TJGKP", "Overall": "5.0", "Content": "First it's a good camera for less than $100 bucks. As to the power switch turning its self on, so what! it has an auto power down feature. If your batteries are dead, invest in a rechargeable set. $20.00 @ most discount retailers. Fuzzy pictures, hold the thing still, the shutter has a delay. It's a camera not a laser, inexpensive technology has not come that far yet. Download your pictures without a dock. First, all D.C. come with a USB cord. Fragile things, If you have ham fists. Try picking up thumbtacks with a pair of tweezers, or other exercises to develop your fine motor skills. Once this kindergarten level task is mastered, move up to double digit IQ tasks like inserting USB cords. Bottom line: good entry level camera, too many whiny 21st century trendoids with no technical skills (read the Dilbert Future for more on these types)", "Date": "June 19, 2005"}, {"Title": "I got what I expected", "Author": "John S", "ReviewID": "R1OAPO71T2M11H", "Overall": "4.0", "Content": "I've been using this camera for over a year. I'm pretty satisfied with this camera - taking in account both the price and the performance. Yes, the lens does not have a cover, but I've always been careful with it. A number of reviewers complained about batteries - in my case I did not encounter such a problem - the provided batteries served well for half a year and then I just bought new ones, no problem really. It's perfect for taking pictures you want to send by e-mail or post online - while the previous generations of digital cameras failed to capture large landscapes or anything at a distance.For high quality printing it would not be as good though.Still, to me it's a pretty good camera within its potentialities and price.", "Date": "January 1, 2006"}, {"Title": "Where is the zoom?", "Author": "L. McCabe", "ReviewID": "R18LAGEX62RZ6J", "Overall": "3.0", "Content": "This camera is good for beginers, and for quick snapshots.  However, there is no optical zoom on the camera, making any picture that has been zoomed in very pixelated and blurry.  Even thought it has 3.2 megapixels, I wasn't satisfied with the quality of the picture.", "Date": "September 22, 2005"}, {"Title": "You get what you pay for!!", "Author": "David Velez", "ReviewID": "R3FHDUHUYRW3H", "Overall": "1.0", "Content": "I bougt this camera and a Olymus camera, both in the same price range, the Kodak camera was by far deficeint in quality of image and workmanship. Avoid this at all cost the Olympus was well made, durable, higher quality picture and ease of use.", "Date": "March 8, 2006"}, {"Title": "You get what you pay", "Author": "Eric", "ReviewID": "R2SF65W287XKWX", "Overall": "2.0", "Content": "Don't waste your money with this camera, it doesn't have optical zoom and it goes thru the batteries very very quickly-so you will need to buy rechargeable batteries.  But for less than $100 you can't expect much.On the other hand the software is very user friendly as is the camera.", "Date": "August 24, 2005"}, {"Title": "Great Camera at Great Price", "Author": "Peter Polansky", "ReviewID": "R1IKPAI9L7X4WM", "Overall": "5.0", "Content": "As previous reviewers noted, this camera takes great outdoor pictures!  You can view photos taken with the CX7300 at my moblog at [...]  Very colorful...  A must buy for those looking to make the move from 35mm to digital!", "Date": "July 11, 2004"}, {"Title": "Very impressed with this camera!", "Author": "D. Farano", "ReviewID": "R1PLY65VM1LH31", "Overall": "5.0", "Content": "When I bought this camera from OfficeMax, I expected it to be, alright. (I mainly bought it b/c it came with a free 128mb SD card.) I opened this right out of the box and loved it. Great picture quality, even while zoomed in! I used to have an old Intel CS630 camera with less then 1 MP. This is a \"must buy\"!", "Date": "June 26, 2004"}, {"Title": "Disappointing", "Author": "Angela Mohle", "ReviewID": "R288KQBYV8M5W", "Overall": "3.0", "Content": "I was excited about this camera because of the megapixels and the Kodak name. I ended up being very disappointed.CONS:+ Eats batteries like you wouldn't believe. You'd better always carry extras, because you're definitely going to go through them while you're snapping pics.+ I get more out-of-focus images than anything else.+ There is no zoom, so you need to be very close to your subject. Much like disposable cameras, you take a picture of something close by and it prints out like it's a million miles away. But, if you get too close, it'll be blurry.+ The wheel on top of the camera used to turn it on and select different modes is in a really bad place. If you buy a case or bag for the camera, often it will turn on accidentally.+ It takes a long time after you snap a photo before you can take another photo. That irritates me!PROS:+ Inexpensive+ It has some good features, like different flash modes, a self-timer, stuff that a lot of cheaper cameras don't include+ You can get a docking station to print directly from the camera - no computer needed+ Once you add in a memory card, you can take a ton more pictures. I got a 128MB and it holds about 150 pics, in addition to the internal memory.", "Date": "June 18, 2007"}, {"Title": "I have beat the[..]out of this thing and it keeps going!", "Author": "PG \"2 Many PS3 game...Too little time\"", "ReviewID": "R2P069PBBOIGT2", "Overall": "4.0", "Content": "This was the first decent digital cameras I have ever owned. I am not sure what the deal is with people complaining about battery life. Buy a recharger. I used the same batteries for the two years I have owned this camera. I have run into glitches from time to time that are most likely due to me putting the batteries in there when they were not fully charged(yes I am inpatient) Sometimes the camera looks like it took a picture and then it crashes. Other times it will not turn off. Opening and re-closing the battery door always fixes it. I am sure that both of these issues are due to me putting the weak batteries in.As for durability? I am not sure what the deal is with people complaining about no lens cover. Who cares? I have dropped this camera so many times I cannot even begin to count! This thing is built really well!! I never worry about putting the camera down with the lens up. I just toss it on my desk when I am done with it. Still takes great pictures. I have bitched about this camera from time to time but I have taken nearly 1100 pictures with it and it is still going strong. Now that memory cards are so cheap, I finally bought one for the camera. A 1 gig one will let you take 4000(!!!) low definition pictures. Of course low def is like 1024x768 on this camera. My only beef is why not have VGA resolution anymore? I always have to shrink the pics down to use this with eBay.", "Date": "February 25, 2007"}, {"Title": "CAUTION", "Author": "Shawn", "ReviewID": "R3HJMGQQJBVMRE", "Overall": "3.0", "Content": "I really like the camera. However if you get one get the printer dock too. I down loaded pictures off to my computer with the cheesey cable pluged into the side MAYBE 4 times and it quit working. The small wires located inside the camera that attach to the cable got stuck and bent. Now I have to buy a dock for the camera to download pictures to my computer. Though it should work longer than that...and believe me I was being very careful because the connection looked alittle fragile.", "Date": "March 18, 2005"}, {"Title": "WOW! What a wonderful camera!", "Author": "Cassie Morris", "ReviewID": "R1VQDYX96UC39X", "Overall": "5.0", "Content": "This camera is wonderful! This is my first Digital Camera and I am pleased with the features and quality of the pictures. Great camera to capture memories and special events! I love this camera! It's the best ever! If you are looking for a Digital Camera this is a good one to choose.", "Date": "December 31, 2004"}, {"Title": "AHH DANG!", "Author": "Anthony", "ReviewID": "RH5MPTGS63HSD", "Overall": "4.0", "Content": "THIS CAMERA IS SO FUN! FIRST OF ALL I LIKE HOW EASY IT IS TO USE. SECOND OF ALL I LIKE ALL THE DIFFERENT SETTINGS YOU CAN PUT YOUR PICTURES ON, AND THIRD OF ALL I LIKE THE SIZE AND SYLE OF THIS CAMERA. I ENCOURAGE EVERYONE TO GET IT IF YOUR LOOKING FOR YOUR FIRST DIGITAL CAMERA BECAUSE ITS PERFECT!", "Date": "January 13, 2005"}, {"Title": "awesome", "Author": "casey", "ReviewID": "R1UDDER6WXQ54R", "Overall": "5.0", "Content": "Hello my name is casey i am 14 years old i got my first kodak camera when i was about ten i loved i absolutely love this new one it rocks hello all you red eye people i dont care how inexpensive the camera is the red eye is going to sometimes allways happen dont let those other reviews stop you from buying such a great camera. like every camera this kodak comes with P.C. software hello there is a red eye tool that make it vanish", "Date": "January 19, 2005"}, {"Title": "Great camera - my 2nd digital", "Author": "Michael Wells", "ReviewID": "R24C565KNHD2B6", "Overall": "5.0", "Content": "I started out with an HP digital camera, this one puts it to shame.  Takes great pictures, zooms works, software that comes with it is easy to use.Bought another one for my son and daughterinlaw for christmas.EASY to use....GREAT.Thanksmbwells - Dresser, WI", "Date": "November 16, 2004"}, {"Title": "Old, but excellent", "Author": "Artemist", "ReviewID": "RHNUVUL02ET63", "Overall": "5.0", "Content": "These cameras are basically indestructible. I received it used from a friend back when I really needed a camera, and it looked liked it had been through a war. Even with that, it still took great pictures.THEN Some years later, I dropped and lost it in the snow somewhere and it was out in the snow for probably over a month. I found it after the snow thawed and it was soaked. After all that, it still worked perfectly!It's an excellent camera if you're really good at abusing electronics lol.", "Date": "January 27, 2012"}, {"Title": "good camera", "Author": "Ralph R. Santillo", "ReviewID": "RGI0O3UF6ARIV", "Overall": "5.0", "Content": "I like this camera because you can stil look through the view finder instead of the screen that you can't see in the sun light. It takes great photos..", "Date": "May 24, 2011"}, {"Title": "Ole Reliable", "Author": "TAPMETAL \"Rockman\"", "ReviewID": "R24YB725GB6TIS", "Overall": "5.0", "Content": "This camera is great for the money. For starters, some of these reviewers should read the manual that came with the camera. It has a 3.0 times zoom that only works when the display is on. Simply push the right direction button to zoom in, left direction button to zoom out. As for battery life, buy the Energizer lithiums, they last quite awhile. Regular AA batteries never last long in digital cameras. We've had this camera for about seven years, and with all the handling, dropping, and abuse by the kids, it's still going strong. As far as quality, it takes as good if not better pictures than the Canon A Series.", "Date": "August 21, 2010"}, {"Title": "Works OK, but just for a short time before breaking", "Author": "Miss Kitty", "ReviewID": "R2E7XPM6D8GMGO", "Overall": "1.0", "Content": "I purchased this camera a year or two ago as a gift.  She has only used it a few times.  One day, it abruptly stopped working.  Batteries were changed, etc., but the camera was just plain dead.  It was not abused, so we are at a loss to explain why it went \"patas arriba.\"  Very disappointing.", "Date": "November 3, 2009"}, {"Title": "Ok for your first cam", "Author": "boncoeur", "ReviewID": "R5EAOT6XSV0JI", "Overall": "1.0", "Content": "I bought this camera for an online class I was taking at the time.  It was a real steal at about $100.  The model I received was refurbished which may have been part of the problem.  The battery life is horrible, especially if you're using the digital screen to take pics rather than the view finder.  This past summer it completely shut down on me. It's great for taking general photos but not so reliable when trying to capture details.  I recommend at least an 8MP model.  I have a Sony CyberShot DSC right now and I LOVE it, although it IS a little pricier.Bottomline: this is a very basic camera with not a lot of shelf life.  Good for a first time buy in order to practice with a digital cam.", "Date": "January 3, 2008"}, {"Title": "It Works, It Doesn't, It Works, It Doesn't", "Author": "D. Ash \"Debi Ash\"", "ReviewID": "R3AQNMQ1OV9ONN", "Overall": "1.0", "Content": "Okay, yeah, its a good camera for the price.  Night photos are blurry, but otherwise it's good.  Until it stops working after 45 days.  Was working fine then it stopped...green light blinks then fades.  Charge the batteries, recondition the batteries (Kodak tells me to do this on the phone), it works fine for about 2 hours then it stops again.  Reformat the card, take the card out, recharge and recondition the batteries again, buy new batteries!  Hmmm...doesn't work...so what does Kodak say?  Did you get liquid on it...NO...did you buy our batteries...NO but they are Ni-Hi rechargeable which you recommneded...OK...well, send it off to us and if you aren't at fault we will fix it.  It should take only up to 3 weeks.  WHAT???  I need it now.  I would like to get my money back and find another camera but alas we are stuck.  Still waiting to hear from them; it's been 14 days now and no response...Beware...its a good camera for the money only if it works.  ;-)", "Date": "July 29, 2005"}, {"Title": "Not Recommended", "Author": "D. Saxena \"dev080\"", "ReviewID": "R1POC163UO9TTT", "Overall": "3.0", "Content": "I bought this camera as a gift for a family member because the price was very reasonable and the reviews said it was a great start up digital camera even for the technologically unsavy. Although it is very very easy to use and share the pictures, the photo quality leaves much to be desired. Outdoor photos are fine for a 3.2 megapixel camera, but the indoor photos it snapped are pretty bad- extremely grainy and dark (even with the flash!). I really don't recommend this camera unless you only need it for outdoor use.", "Date": "February 1, 2005"}, {"Title": "Perfect for parties", "Author": "Fernando \"SVAX\"", "ReviewID": "R3O49W23YULXTG", "Overall": "5.0", "Content": "I bought it almost a year ago, and I also bought the CRV3 battery. That's the perfect combo. I used and abused it for 4 months and not worrying about buying new batteries. Yeah, It doesn't have zoom, or macro option, but you only need it in a proffesional level (I work in advertising). So, go to a road trip, party or any family event, you won't need anything else, your camera, the CRV3 battery and some more memory for it. Even my 5 years old niece can take good pics with it.", "Date": "September 20, 2005"}, {"Title": "Kodak CX7300 3.2 MP Digital Camera", "Author": "hallcharlesw", "ReviewID": "R38S6FNKLXQ6PJ", "Overall": "5.0", "Content": "It was received in exactly the condition that it was advertised.  I have had on like it for seven or eight years and was great until the battery cover borke.  The camera was received very promptly.  Good vendor.", "Date": "March 3, 2013"}, {"Title": "Kodak CX7300 3.2 MP Digital Camera", "Author": "Tzuria", "ReviewID": "RI111BSMHIDFC", "Overall": "4.0", "Content": "Great for taking pictures close up, far away, not so great.  I sat in the 2nd or 3rd row of a concert and took pictures of the singer, they were rather distorted and unsatisfactory,, could be because of the low MP if that's what caused it.... Maybe it was because I was so excited, my hands were shaking.  I love the review feature, and the live-view.  I never look through the view finder, instead I use live-view..", "Date": "February 11, 2013"}, {"Title": "Easy to use!", "Author": "Cookie Monster", "ReviewID": "RPENXNXDP9HSW", "Overall": "5.0", "Content": "I first received this camera about 6 years ago for use at work. If you are not a tech wizard, and are confused by too many bells and whistles, this is the camera for you.  Very simple to use and takes decent photos.Note:  This camera has both internal memory and a slot for a SD card.  If you opt to use a SD card (recommended), don't buy a high capacity 4GB SD card for this camera.  Get a 256 MB card. That's right, 256 Megabyte, NOT Gigabyte. The camera won't be able to format the 4GB SD card.  Using the 256 MB SD card will still provide enough storage for about 300 photos at the highest resolution. If you use the SD card, you can remove it and plug it directly into the card reader on your computer (if you have one).  If you use the camera's internal memory, you will have to use the Kodak cable to transfer the photos to the computer and sometimes the used cameras don't come with the cable.", "Date": "January 21, 2012"}, {"Title": "wrong items sent on both ends", "Author": "The Alleycat \"I am The Alleycat\"", "ReviewID": "RCFB37COK75HN", "Overall": "1.0", "Content": "This cameria does not fit the kodak easy share CX 7300 this is  the camera dock 3M873/ M883I was told by both ends this canera would workit does not fit AT ALLI would like Bob to send me the correct port for this cameria or refund moneyI am still waiting on the memory cards 3 of them and a battey charger to plug in car and housethis is very importand that I get these items soonboth people were wrong about the cameria fitting in this portPlease take cae of his matterbob send cards 3 memory cards and correct wire to computer and charger for auto and homeI must to a write off on visa if yiu cant send", "Date": "June 11, 2011"}, {"Title": "product  verses  management", "Author": "ralph grace", "ReviewID": "RC52X5J93VAC", "Overall": "4.0", "Content": "I AM VERY PLEASED WITH THE ITEM . BUT, THE PROBLEMS WERE ALL IN THE HANDLING AND MANAGEMENT.  I WAS PROMISED A FEW THINGS IN THE PURCHASE AND REBATES  BUT NOTHING ! I HAD TO CONTACT CUSTOMER SERVICE WHICH HAD NO CLUE WHAT I HAD ORDERED OR WHO I WAS.  BUT I DID FIND SOMEONE IN THE COMPANY WHO HAD SOLD THE CAMERA AND SHE FOUND NO LINK TO THE TRANSACTION ! BUT SHE INVESTIGATED THRU THE AMAZON CREDIT CARD AND FOUND THAT I WAS IN THERE, THEREBY I WAS ABLE TO GET INTO THE CREDIT COMPANY'S CUSTOMER SERVICE AND STRAIGHTEN IT OUT  AND GET THE ITEM PLUS THE REBATE THAT I WOULD HAVE HAD TO RE-PURCHASE. GLAD FOR SOME PEOPLE THAT WILL DIG FOR THE CUSTOMER AND HELP.  THE DELIVERY WAS DOUBLE THE TIME IT WAS TO BE.", "Date": "November 18, 2010"}, {"Title": "Great camera overall", "Author": "D. Clark", "ReviewID": "R2207SKDPREVB8", "Overall": "4.0", "Content": "I bought this as a gift for my nine year old daughter.  It's great.  Not complicated to work at all.  Bought it used and still in great working order.  Only negative is that it doesn't have a button to zoom.  You have to use the display (instead of the view hole) and then you are able to zoom.  It took us a little while to discover this.", "Date": "August 22, 2009"}, {"Title": "dont use the zoom", "Author": "Sarah R. Orille", "ReviewID": "R2XQ7XC2P63XVE", "Overall": "2.0", "Content": "I have had this camera for 3 yrs now and like it for the most part but hate that you cant zoom in and have a picture turn out, everytime I have zoomed in for a picture it has NEVER turned out the pictures ALWAYS look grainy and look like its raining ! and its not good for moving objects its too slow!", "Date": "August 3, 2009"}, {"Title": "Nice for 1st time users or beginners", "Author": "Cynthia L. Schultz", "ReviewID": "R6F2ZOS1XMSBB", "Overall": "3.0", "Content": "I bought the Kodak CX7300 about maybe 5 yrs ago and it is great for first time buyers and if you do not want to capture action shots.  The pictures turn out great if you are close up to a subject or outside.  Action shots don't come out very well because of the slow shutter speed and the zoom is very grainy when picture is developed. It also takes too long in between shots.  Overall a good first timers camera.", "Date": "April 23, 2008"}, {"Title": "Ok, but not the best.", "Author": "Emily Roepke", "ReviewID": "R1T61LQV0KCG7A", "Overall": "3.0", "Content": "This camera is a good basic camera taking pretty good pics. It doesn't hold battery life to the best extent. It is a good starter camera but isn't the best.", "Date": "July 23, 2007"}, {"Title": "Not really worth it", "Author": "J. Hallenbeck", "ReviewID": "R2J93T3HV4FYFG", "Overall": "1.0", "Content": "I bought one of these cameras because it was cheap, and Kodak has a pretty good reputation.However, I found that the quality of the pictures it takes is rather low, and it consumes batteries very quickly.  It doesn't zoom, so unless you're close to something, it won't take a very good picture.  Once the picture is scanned onto the computer, or printed, it's very grainy and pixellated. You can get other brands for a similar price that are much better quality.", "Date": "April 12, 2007"}, {"Title": "great camera", "Author": "court", "ReviewID": "R11QXQBOABQEW9", "Overall": "5.0", "Content": "I got this camera as a christmas present along with the dock, this is the coolest thing ever.  For the price you get great results! thumbs up to the Kodak corp. for this great, inexpensive digital camera.", "Date": "December 31, 2004"}, {"Title": "Camera Review", "Author": "M. C. Liebold", "ReviewID": "R10WRTO4ZIYL41", "Overall": "4.0", "Content": "I purchased this camera to replace a Kodak I had prior.  Two items I miss are.  Sound with the video clips....and zoom.  I wish I had gotten the camera with these two additional features listed above.  I miss have those features.", "Date": "September 25, 2004"}, {"Title": "Not the best...", "Author": "Dafna", "ReviewID": "R17KA8ZSGSLR21", "Overall": "2.0", "Content": "I got this camera when it was rather new. I am not extremely pleased with it. It is not acting this way because it is 2 years old...it was like this when i bought it.-first of all...it has no lens cover so you HAVE to keep it in a camera bag. Incase you touch the lens without relizing...all your pictures will be ruined.-It takes for ever to take a picture. You have to wait for like  2 seconds for the picture to be taken.-It eats up batteries like crazy-It takes forever to turn on-If you have the flash setting on autoflash, the camera will still flash in bright sunlight-The pictures are extremly blurry when you print at home-It has no optical zoom (but the zoom is really the customer's choice.", "Date": "October 29, 2005"}, {"Title": "Very Easy To Use", "Author": "Jennifer", "ReviewID": "R5L867MN6XU53", "Overall": "5.0", "Content": "This is my first digital camera and I am in love with it. It's very easy to use straight out of the box. The picture quality is great. The editing software makes it easy to edit pictures and share with friends. A great digital camera for beginners.", "Date": "May 14, 2004"}, {"Title": "poor quality, no zoom, bad purchase", "Author": "Emma", "ReviewID": "R3S7CATVFB93IP", "Overall": "1.0", "Content": "I recieved this camera as a gift for Christmas several days ago. Unfortunately, I have not been happy. I opened the box to find a flimsy, cheap feeling body. This was my first complaint but I figured if that was the only problem then it should work out quite well.To my disappointment I found that not only was the body cheap, it didn't have an optical zoom. For me, this was a huge problem. I like to be able to zoom into my subject without losing the quality that you do from a digital zoom.Then I began snapping shots. Now given it was indoors and the lighting wasn't perfect, the shots I reviewed on the camera's LCD screen were of terrible quality to say the least.Another drawback I noticed was that you cannot move the camera at all while taking the picture and the subject cannot move for a few seconds either or else you'll end up with a blurred and fuzzy bad picture. How unconvienient. Mean't to be a cheap snap and go camera it should at least be quicker in processing the images.When I think of Kodak I think of quality pictures. No longer do I feel this way. I would DEFINITELY NOT recommend this camera to ANYONE. It's a waste of money and I'll be returning mine for a full refund today. Instead, try a Sony Cyber-shot or Nikon.", "Date": "December 27, 2004"}, {"Title": "Great Camera!", "Author": "D. Buchanan", "ReviewID": "R2MC60XV4H14G2", "Overall": "5.0", "Content": "I have a ton of space since I bought the card ( this one: http://www.amazon.com/exec/obidos/tg/detail/-/B00005UEA6/102-6745742-3976939?%5Fencoding=UTF8&v;=glance )for more space. This camera is easy & it's a nice & clear picture. I reccomend this camera for a family with children :O)", "Date": "September 2, 2004"}, {"Title": "Great buy!", "Author": "Rob", "ReviewID": "R2WXO6BTK7OHK4", "Overall": "5.0", "Content": "The pictures come out great, battery life is average, only downside is movies are a little grainy, but then again it was designed to take pics, not movies!", "Date": "June 27, 2004"}, {"Title": "i love this camera", "Author": "Robin L Markcum", "ReviewID": "R1RUOF5E5QBQFJ", "Overall": "5.0", "Content": "I LOVE THIS CAMERA BECAUSE IT IS EASY TO USE AND IT TAKES GREAT PICTURES IF I WAS TO RECOMMEND A DIGITAL CAMERA TO ANYONE I WOULD RECOMMEND GETTING A KOADK EASYSHARE CX7300 IT TAKES GREAT PICTURES.", "Date": "September 9, 2004"}, {"Title": "Whatever Happens  \"Bahala Na?\"", "Author": "Michelle Bayquen \"Mcgyver\"", "ReviewID": "R3CF151JVJ467B", "Overall": "3.0", "Content": "I purchased this camera because it was cheap and good price for a 3.2 MP LCD digital. I still have and use it. I regret not learning how to save photos, all my pixs with ASIN- filipino singer and honeymoon at Boracay got deletd somehow... however it's definetly worth the price and perfect 1st time camera. It also does have a video capture.... although red eye reduction doesn't quite reduce the red just turns it green...", "Date": "June 28, 2005"}, {"Title": "poor quality and customer service.", "Author": "Albin", "ReviewID": "RNAYR9KAHSPUY", "Overall": "1.0", "Content": "aside from anything i wish to say about kodak products, i must say that their customer service is awful. i spent 40 minutes at a time on hold with their customer service to have our digital camera repaired. and another 40 minutes on the phone to get it back. this camera (DX6440) was well taken care of and mostly kept in it's camera case. never dropped or brought near water and yet it puttered out a month after the one-year warranty expired which to me is poor quality. kodak holds a monopoly on kodak camera repairs (no camera shop in minneapolis was willing to fix it as it's a kodak.) i received an estimate of $193.99 to repair the camera. that's about $200 when you include S&H.; we received the camera as a gift which cost $350 to begin with and for that price i would expect it to last longer than 1 year and 2 months. we will go with a brand that our local camera repair shop can fix as opposed to a having to send it out of state for repair with an estimate service fee totaling $48 whether it's fixed or not. mind you, this is if it's out of warranty. so if you do indeed to go with kodak, but an extended warranty!", "Date": "June 29, 2005"}, {"Title": "awesome", "Author": null, "ReviewID": "R3SYQ0RVQHG20C", "Overall": "5.0", "Content": "this is the best camera for the price.  yOU CAN'T GO WRONG!", "Date": "June 3, 2004"}, {"Title": "Crap Crap and More Crap", "Author": "Diane M. Napolitano", "ReviewID": "R2SHFDPL339M55", "Overall": "1.0", "Content": "This is the first Kodak camera I have ever owned and I am so disgusted with it that I'll never buy another Kodak product again (sans film).  This camera is a toy and a bad one at that.Not only is there no lens cover, there is also no battery life to speak of.  The genius who designed this one put a very easy-to-turn dial at the top of the camera that hangs over the edge just enough so that it turns on no matter where you've put it.  Put it in your bag, take it out and go to turn it on later, you've got dead batteries.  As if the camera didn't eat up enough batteries during normal (non-viewfinder) operation.Since the day I got it (last Christmas), my camera has never been able to read the memory card.  I don't know if it's just the memory card or what (and sorry, but I just can't afford to buy another card to try), but usually when I turn on the camera, with a card inside, the camera will tell me the card needs to be formatted.  If I take the card out and insert it again, with the camera on, it is read fine.  Also, no matter what resolution setting I use, my camera refuses to store pictures on my memory card after the 25th or so picture.  Glad I have a 128mb card.Speaking of the camera's settings, it'd be nice if the camera retained my settings after I turned it off.  I can't leave the camera on for a period of more than three seconds, and it's annoying to have to constantly reset the settings before every single picture.Additionally, there is no zoom to speak off and the flash settings are horrendous.  Also, Kodak's software constantly crashes on my computer (in Windows 2000).  There's no sound on the video (and the video is extremely short, 30 seconds if your batteries are brand new) and the quality of the pictures are ok at best.This camera insults me and I can't wait to get rid of it and buy a Canon.  Spend the extra $20 and buy something good, you won't regret it.  This camera is extremely annoying for anyone, even the most casual user looking to take a few pictures.  To make the most out of this camera--i.e. to save it from being so easily damaged--you have to buy numerous add-on products from Kodak, such as a protective case...can we say \"rip off\"?", "Date": "October 3, 2005"}, {"Title": "Kodak ImpossibleShare", "Author": "Gary Barry \"Brett\"", "ReviewID": "RLQ0ZTSZOWSQH", "Overall": "1.0", "Content": "This product is awful!!!! I'm better off buying a disposable camera than this piece of crap!! It takes horrible pictures, it's impossible to email them to friends or even upload them onto the stupid computer! This camera is possible the worst thing I have ever bought, and has brought me so much frustration over it!!! DO NOT BUY THIS CAMERA!!! Save your money for something that's actually worth it! Oh yeah, this product doesn't deserve any stars but i had to rate it.", "Date": "June 11, 2005"}, {"Title": "Not Satisfied", "Author": "Jen", "ReviewID": "R2UFF4HQUVV1JG", "Overall": "2.0", "Content": "I bought this camera and returned it after a couple weeks. Almost all my pictures had red eye even though I had the red eye reduction on at all times.", "Date": "November 16, 2004"}, {"Title": "Broken in Less than a Year", "Author": "M. Wagner \"Mermi\"", "ReviewID": "R2JI4PWTQUWS6Q", "Overall": "1.0", "Content": "My camera has broken in less than one year of owning it.  Because I received it as a gift I don't have the proof of purchase so Kodak will not fix my camera for no cost.  What a lemon the CX7300 is.  First of all it takes pictures so delayed you never really get a good candid picture.  What's broken?  I can take one picture before the batteries go dead.  I change the batteries, one picture.  Change the batteries again, one picture.", "Date": "January 14, 2006"}, {"Title": "VERY Poor Quality at night", "Author": "Jean-Pierre Fouché \"Jean-Pierre Fouché\"", "ReviewID": "R29G54T72I0P2Q", "Overall": "1.0", "Content": "Thanks for nothing, Kodak.  I thought that buying a Kodak would be a safe option.  Sorry to find that the camera is extremely blurry at night, in both flash and auto mode.  I would recommend that anybody wanting a digital camera spend the extra money and buy something a little more expensive.  This one leaves me with worse pictures than I have ever seen on any analogue snappy camera.", "Date": "December 15, 2004"}, {"Title": "good point and shoot...for beginers", "Author": "H. Morgan \"bruinschick13\"", "ReviewID": "R3W4T5KF9EUFP0", "Overall": "3.0", "Content": "If you really want a good digital camera, you need to go and get one with more MP.  the more MP the better the camera.  Other than that, the camera is nice, just not advanced like a lot of other cameras.  That is only my opinion though.  I like to have other features on mine, unlike this one.  if you ever want to buy a digital camera, I also recomend going to a store like Best Buy (or another store like that, not wlmart or anything).  That way you can have an on hands feel of the camera.  go to the store before buying.  they will even show you how to use the camera.  that is your best bet.  don't order on line.  it took me about 2-3 trips to look at cameras before i bought one.  it's something to invest in, so get a good one!", "Date": "November 6, 2004"}, {"Title": "i heard", "Author": null, "ReviewID": "R28X8BNE90GLAY", "Overall": "5.0", "Content": "i  read  other  people's  review's  and  it  sound like  a  great  camera", "Date": "September 3, 2005"}, {"Title": "Worst Camera I have ever had", "Author": null, "ReviewID": "R212TGA9YFKH3C", "Overall": "1.0", "Content": "this camera was a waste of $200 at Circuit City. the glare protection was messing with my pictures.", "Date": "June 16, 2004"}, {"Title": "ReAl GoOd", "Author": "switch \"switch\"", "ReviewID": "R3VM1P2K0ZCJ1Q", "Overall": "5.0", "Content": "u kno wat? i have not even purchesed this yet. i was wondering if i should. please e-mail me back at nick_b@rock.com . ok? thank you", "Date": "December 16, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.2-megapixel sensor captures enough detail to create photo-quality 11-by-14-inch enlargements\nKodak lens with 3x digital zoom\n1.6-inch LCD display screen; on-camera \"share\" button allows you to organize your images for e-mail and printing as you take them\nStore images on 16MB of internal memory or on optional Secure Digital (SD) memory cards (no memory card included)\nPowered by AA-size batteries (alkaline included, rechargeable Ni-MH recommended)", "Name": "Kodak CX7300 3.2 MP Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41LIWYnd4eL._SX300_.jpg", "ProductID": "B0001DJSYU"}}