{"Reviews": [{"Title": "The best ultra compact camera yet..", "Author": "Nse Ette", "ReviewID": "R3CA50HSQ2HJFR", "Overall": "5.0", "Content": "Ok, I guess I have to start by confessing to being a Fujifilm fan. This is my fifth digicam, the previous four being a Fujifilm FinePix 1300, a Fujifilm FinePix 2800, a Fujifilm F410, and a Fujifilm F420.What a tiny gadget this is, and it still manages to fit in 5 megapixels, and 3x optical zoom. Very fast start up time too. As an architect, I love to be able to whip out and shoot any scenery, sunset or building that catches my fancy at anytime and this serves just fine. This leads me to mention the one gripe some people might have with it, people with large hands/fingers might have problems accessing the tiny buttons, but not me.And what a stunning looking gadget it is! It comes in 2 colors; silver (the one I went for) and black. Very slim, slimmer than Kate moss, LOL! Never fails to grab attention when I whip it out. Excellent design! To switch on, you slide back the front panel.It is very simple to use (you literally snap away once you have set up, which is very easy to do) and shortcut buttons eliminate the need to twiddle in the menu section in search of most options such as different flash settings, different resolution settings, Macro mode (amazing close ups), and many others. There are also some pop ups to guide you, reducing your dependence on the manual (which, like all Fujifilm manuals I have seen, is very detailed and easy to use) except for really major issues.Like I mentioned, the camera has 3x optical zoom. The zoom lens does not project out of the camera. It instead uses a system where it zooms vertically inside the camera and images are reflected to it. Image quality is not compromised at all.Images viewed in the large 2.5\" LCD display are really clear and bright when it is used as a viewfinder, especially for indoor shots. Depending on the light condition of the environment, the LCD automatically adjusts to compensate, enabling you to view in almost any condition, a very good feature, especially as there is no optical viewfinder. This can also be adjusted manually. Oh, and the LCD is extra toughened to resist scratches/breakage. I unwittingly tested this when I accidentally dropped mine LCD face down on some cobbled street. I picked it up with my heart in my mouth and besides a few scratches on the case, no scratch on the LCD. There is also a new feature that enables you to view past photos taken while taking a new one. Cool!The AF/AE lock is a breeze to use and takes exceptional shots every time. Photo quality is really amazing. You can pick out fine details in the background of the subject. Colours and contrasts are good and sharp. Flash modes are easy to access and dark indoor shots taken using suppressed flash yielded amazing results. Pictures taken without the flash come out amazingly natural looking, thanks to some new low light feature. Outdoor shots on a bright day are unbelievable in their clarity.A very useful addition is the introduction of a short cut button to get to the timer; previously, one had to go through the menu which involved quite a number of steps.The Movie clips with audio are very simple to make, and it is very easy to switch between resolutions (320x240 or 160x120). Results are very good as the movies are shot at 30 frames per second which gives TV quality movies. Best results are obtained where there is a lot of light, e.g. outdoors on a sunny day. However, it is amazing to see how the camera adapts rapidly to changes in light conditions while shooting. Length of clips is restricted only by size of memory card.The video out function enables you to connect the camera to a TV to view images/movie clips. Very good.Battery life is very good but it's always best to have a spare. The battery charges rather quickly.The cradle is stylish looking too. I have mine permanently hooked to my PC and just place the camera on it, switch it on, and the software launches and downloads everything quite fast. The cradle also doubles as a tripod stand receiver.The FinePixViewer software is very good. It is very easy to view folder contents at a glance, set up a slide show, etc. You get lots of print options from full photo, Index 1x2 (2 photos on a sheet), 2x2, through to 7x5.Print results are simply breathtaking, whatever the size of paper, up to A3. Colours are rich and images very realistic looking.This is a camera I would recommend without hesitation. It blows away any other camera in its class or price range. If you are looking for a relatively inexpensive, compact, high resolution camera, look no further. The perfect camera for people like me who don't want to do too much adjusting/setting etc. I hope this review helps you.", "Date": "August 10, 2005"}, {"Title": "Not my first, definitely my favorite. Convenient, Reliable & Functional", "Author": "THATCH \"RST\"", "ReviewID": "R1R17CTS5ANTFA", "Overall": "4.0", "Content": "I am not new to digital cameras. This camera, overall, is more usable than any digital camera I have or have had. I've owned and used the camera for 7 months as of May 06.I have owned Olympus, Sony and Fuji Digital cameras. This camera by far, as the easiest menus to navigate and are easy to navigate quickly without reading the instructions.  The back display is huge and bright, glass reinforced, which a lot of competitors do not have. This keeps away scratches and smashes.  The casing is real metal, so you do not have to baby it, and finally, the size and shape of this camera make it very convenient to carry in the front pocket of jeans with no problems.  This is the RAZR of digital cameras, in my opinion. It is ready to take pictures very quickly from when you open the lens cover.The rechargable battery has never died on me before I ran out a 1 GB memory card.The flash is adequate but a bit slow to recharge. This is not a problem for me however, because I chose this camera for two unique features, First-- \"Natural Light Mode\"-- a \"flash off\" mode that enhances pictures with natural light. I take most of my pictures, even indoors, with no flash, because I like the look of natural light. This camera is great at capturing under those conditions.The second feature I like about the camera is called \"PhotoChrome\" mode-- it richens colors and makes pictures sort of a \"technicolor\" look. Print worthy in many cases. I use this in conjunction with the Natural Light Mode.The only drawbacks I could think of with this camera is that because of the screen size/vs megapixel, sometimes you think a photo has come out clearly by looking at the screen, but if you didn't use flash and moved (which obviously makes pictures blurry) it will show up blurry at full size when you download it to the PC.The only reason I rated 4 stars instead of 5 is because in super low light situations the fact that a picture is 5 megapixels but you view it on the LCD tricks you to thinking the picture was captured clearly when you might have a slight blur at full size. This may be true of all cameras, I don't know.This is an auto focus camera.  You will get incredibly clear pictures of close ups and regular photos, but you have to let it focus.  This is not a \"wail your arms around while on a dance floor and snap pictures\" camera. Many people detract from the camera because they want it to be a fixed focus camera for situations like described above. Tempting because it is so portable and stylish, but this camera fills the needs of much more than a fixed focus.I have a 4 megapixel Fuji S3100 for situations where I need mega zoom, but, who wants to lug around a camera bag on the trip to the mall or walmart or work? I also own a Sony DSC-P72 which is not bad at anything, but isn't great at anything either, and is too big and hogs batteries. Previously I owned Olympus digital cameras.  I've found the 5 megapixels of the Z1 more than adequate, and I often shoot in 2 or 3.  I have the black edition. It does show finger prints. If I had it to do again I'd choose the silver only for that reason.I carry this camera often because its so convenient, and often those pictures I'd have missed by only owning a larger camera and not lugging it along are captured because of how convenient it is to carry this camera along. Its no burden at all to travel with, produces great results, battery lasts long, and is durable.", "Date": "May 22, 2006"}, {"Title": "GREAT CAMERA! HAD TO BUY THIS ONE", "Author": "R. D. Byrne", "ReviewID": "R78FZINNLB8BP", "Overall": "4.0", "Content": "Positives:I just bought the Fujifilm FinePix Z1. Took it on a weekend at a beachfront spa on Tampa Bay. Took great pics. Very good lowlight shots. It was a cloudy and rainy day but the color was great. Zoom is 3x and you can digitally zoom in on the pic on screen. BTW, the screen display in back is larger and sharper than I've seen on other cameras. Video and stills are sharp and bright in the display. You can zoom the stills while viewing them.Easily fits in a pocket. Lens is protected and automatically powers down when you close the sliding cover.Directions were simple. Transferring pics and movies is easy via USB cable or removing the card and plugging it into my pc card reader.Negatives:The supplied card is only 16 megs. Not enough to store one video but good enough to store stills. I recommend buying a larger card. I purchased a 256 meg card and found it easy to store movies.Speaker is tiny but then, this camera is so small it is understandable.No case. You'll have to find one that fits. (I'd have rated it 5 stars if the case was included.)", "Date": "June 6, 2005"}, {"Title": "Great camera!", "Author": "J. More", "ReviewID": "R14QIXNAWR9GBY", "Overall": "5.0", "Content": "I bought this camera after being tired of my current Fuji Finepix A340. The A340 is a great camera, but the time btw pix was painfully slow for me. Plus, I needed an excuse to buy a new camera!The Z1 actually was bought by mistake. I was after a different camera, and hastily bought this one and I am extremely glad I did. At first I was wary of a rechargeable battery and was going to take it back, but I opted to toy with it for a few days first.The rechargeable battery really is no issue. You get about 200px per charge and there's always the option of buying a backup off ebay for about $40. (Don't fall for the extended warranty crap at some appliance stores. They told me it was $60 and if the battery goes I can get a new one, well since I can get 1.5 batteries for that warranty cost, I opted to take my chances and save my money)I love the metal case and the practically instant on when sliding the cover. The size is smaller than a deck of cards but it doesn't feel fragile. There is no view finder, which is fine by me, I never use it since I went digital anyway. There a lot of settings and I found that for dark environments, this camera is slick!!! Easily the best dark environment camera I've ever owned.I'm not a photo expert, I take a lot of pictures, and as long as they are clear, crisp enough to print if I choose, I'm happy. I am sure there are other cameras that others will say are better for this or that but for a casual photo taking endeavor, this Fuji is perfect.", "Date": "March 23, 2006"}, {"Title": "I love this camera", "Author": "G. Kenny \"Digital lover\"", "ReviewID": "RQQJ5L6AFNUBK", "Overall": "5.0", "Content": "I bought Z1 about a month ago and gave it to a good friend as a great present a few weeks ago..I just bought another one for me, again.Before that I had a Fuji F10. I loved it too and gave it to my father in the summer.I love digital cameras and have tried so many in the last two years, including the Canon Rebel XT which I bought, used, and gave it as a present for a wedding in the family.I tried many other digital cameras, but the new compact Fuji's beat them all in quality of result. The Z1 also beats most others in compactness, style and feel.Both Z1 and F10 have automatic sensitivity (ASA) mechanism which is under rated. It is a huge advantage, in my mind.Don't know why Fuji stopped selling through Ritz Camera. Perhaps because their prices are too low for Ritz to make a nice profit.Anyway, their prices is low enough to allow you not to think too much and just by it.There's not much different in quality between Z1 and F10, so I'd recommend the Z1 over the F10. The F10 has a strong green light that helps in focusing in the dark, but the Z1 is doing a good job even without any light.Gadi", "Date": "October 11, 2005"}, {"Title": "LOVE LOVE LOVE", "Author": "Tina Smith", "ReviewID": "R1WE7XNQMXLOVA", "Overall": "5.0", "Content": "I love this camera!  Im not a professional photographer, I'm just a mom who wants to take some great pics.  Well this camera does it all and does it well.  My favorite thing about it is it's not loaded down with options that you have to search for forever.  If you need to change something you can do it within a few seconds. Just what the average point and shoot person needs.I wasnt looking forward to  getting used to another camera and figuring out all the buttons and the where is that and what does this do and how do I get there kind of thing.  When this one arrived, within 15 minutes I pretty much had it all figured out.  They made it so easy.The buttons on the back are just where they should be.  Everything you need is right in front of you.  The huge screen is  phenomenal. BLEW MY MINd!  My older Canon only had like a 1 inch screen.As for the quality of pics, as for what I have taken here in the house they have been great.  The color is so vivid.  For me this camera is perfection.  I do understand though that if you need some in depth serious options you may want to look further. But for overall ease of use and extremely sharp pics you have to try this camera.The only thing so far that I didnt like but its not big deal is that you do need to have it in the charging dock to unload pics to the computer or mount it on a tripod. Its a small thing but I guess to keep the sleek look of the camera they put all the connections somewhere other than the camera. Also, there's no viewfinder to look through if you need one this may be a big turnoff. All you have is the big screen but it wont mislead you.  Also this thing weighs less than 5 ounces!!  I'd buy another in a heartbeat.", "Date": "December 14, 2005"}, {"Title": "Amazing.", "Author": "Stephanie Krutsick", "ReviewID": "RR4ZO04GVZQ2B", "Overall": "5.0", "Content": "I received this camera for Christmas this year and don't know how I lived without it all this time.  I've come up with some beautiful compositions with just quick photos of indoor flower pots.  I would recommend this to any casual photographer who takes a lot of pictures-- particularly on the 800 film speed setting.  The user pictures at the top of the page are very accurate representations of the quality of images from this fantastic camera.Edited to address Andreea's review-- you do NOT have to plug in the dock in order to transfer pictures.  All you need is the dock and USB cable.  You don't have to carry around the AC Adapter in order to transfer, as it's not needed for it.  I transfered pictures just fine onto my laptop, far far away from any plug.", "Date": "December 27, 2005"}, {"Title": "Awesome for its size", "Author": "Nick Coyne", "ReviewID": "RV3E39018P00O", "Overall": "5.0", "Content": "Great little camera - small enough to slip into any pocket, and takes pretty good pics.I use the z1 for the times went I don't want to lug around my Nikon D70. Its very quick and easy to use.The reviewer who complained about image compression definitely didn't read the manual properly - the images are full quality 5mp ones.", "Date": "September 3, 2005"}, {"Title": "Camera for the  \"not-so-picky\"", "Author": "Ezee Topleeze", "ReviewID": "R2HJE0YPRU5JH3", "Overall": "5.0", "Content": "This camera does not have so many features, unlike the ones that a real 'pro' on digital camera is looking for. It is not overpriced and the quality is not the best but I'd say very good. It does not come with a leather case because you don't need one. The lcd display has a thick protective glass like a scratchproof material (just don't drop it for a test or something). It is so small that's why it's called portable. If you have big hands naturally this is not for you. All digital cameras have different features of their own, you just have to read the manual to be able to appreciate fully what you got.", "Date": "July 21, 2005"}, {"Title": "The best of my bunch", "Author": "Richard L. Steiner", "ReviewID": "R3M0EZ2M78KSKW", "Overall": "5.0", "Content": "I bought this camera about a month ago and have tried it out in every circumstance and setting I could think of.  It performed beautifully and I have been completely satisfied with it.  I bought my first digital camera several years ago before they were all the rage.  Since then, as new technology was developed, I bought several more cameras.  The Fuji Z1 is the sixth one for me.  I have been happy with my previous cameras, mostly Olympus models, but the Fuji Z1 is fast becoming my favorite.I bought the Z1 for its size and ease of use.  I really didn't expect to get high quality pictures with it, but I did.  This camera performs well under every condition I could come up with.  I have seen several reviews by people who hated this camera and cannot understand why.  They have criticized the picture quality mostly, but I don't see why.  I can only assume that the cameras they bought had a manufacturing flaw or they couldn't follow the reasonably simple directions for using it.I have printed out a large number of pictures from the camera and I can't tell them from those I produced with any of my previous cameras.  They were sharp and the color was accurate.  I have produced hardcopy enlargements up to 8\" by 10\" and they came out perfectly.  I was surprised to find it is possible to crop pictures right in the camera before printing.  There is also an option that allows shooting pictures in black and white.The small size and feel of the Z1 is just what I was looking for.  It is a camera I can keep in my pocket while traveling to be quickly taken out for a picture when the opportunity presents itself.  I do a lot of traveling and this camera is just the thing for use on my many trips abroad.I like the looks of the camera and it is as solid as a rock.  The quality of construction is outstanding.  I like a camera that doesn't feel like a slight bump will break it. I don't mind having a camera that draws a little attention to itself.  The Z1 does that.  It will turn heads.One the same day that my camera arrived from amazon.com I discovered a new model was coming out.  I was only disappointed for a moment or two.  Once I discovered the new version of the camera (the Z2) had only superficial changes and a higher price I was glad I had purchased the Z1.  Unless you simply must have a camera painted red and the capacity to shoot with an ISO of 1000 you should go for Z1.  It is now selling for rock bottom prices and it is both a bargain and a great camera.", "Date": "December 22, 2005"}, {"Title": "Terrific Travel Camera, Especially Outdoors", "Author": "J. A Carty \"Jessie Carty\"", "ReviewID": "R3JYKQ2MRUV4YP", "Overall": "4.0", "Content": "This is my third digital camera and by far my favorite. I purchased after having a very versatile but large (well large in the dimensions of digital cameras) digital camera. I needed and wanted a camera that I could easily carry w/ me at all times. This is perfect.The Fugi Z1 fits easily into your pocket or a small case for easy access. Just don't put anything else in that pocket! The one time I forget and did this I noticed a large scratch on the silver portion of the camera.As with all digital cameras this one takes much better pictures in good lighting. I have found, however, that this tiny camera has an excellent flash so I am still able to get good interior shots if I am willing to blind people (or my cats) for a few seconds.The camera comes w/ a docking station that I have found very useless for uploading pictures but you have to use it to charge the camera. I tend to just use a USB cable direct to the computer or a really cheap USB card reader that I can attach directly to my computers USB port.I took this camera to Japan and it was great. I only had one day where I ran out of battery power but that was my own fault.This is a highly recommended camera by me!", "Date": "June 21, 2006"}, {"Title": "OUTSTANDING in Every Way", "Author": "Big-Z", "ReviewID": "R17I2NGBHPNLSG", "Overall": "5.0", "Content": "I read all the reviews on the web before I bought this camera and narrowed down my choices to this one and ones like this from Sony and Nikon. All three are great cameras, but the Z1 has much better low light capability. Many people whine about picture quality, docking cradle, power adapter, etc., but all these factors are spelled out for anyone who does any research. Anything spelled out in specs should never be stated as a negative. Yes, flash is weak, but it works and one should never expect a camera of this size to have the flash output or the optics of larger cameras with extending lenses, even cheaper ones. Even a $125 Canon takes better pictures under some conditions. There are obvious tradeoffs in a camera of this size and weight, but well-worth those tradeoffs for the convenience of size and weight. Those who complain about poor picture quality either have defective units or do not know how to set the camera up and operate it.Last night in total darkness with one 15 watt florescent bulb on, I took stunning pictures of objects three feet from the bulb without a tripod, eventhough the camera alerted me to the high potential for a blurry picture. It seems to have no problem focusing in all light conditions. BUT you must always hold the shutter release button down half way so it can focus, as is the case with most digitals these days.This is my 8th digital over 13 yrs. My main one is the Canon G6, but this is the one that I can take with me everywhere. This is the one I use for low light conditions.A free noise reduction program like noiseware community edition takes care of low light noise. Extra batteries and a travel charger for it are cheap with some research on the web especially auction sites.Lots of size for reduction to high quality. I did not install the software so I cannot comment on that. Works great on a TV with nice slideshow function.By the way, the wrist strap is the best I have ever seen for a camera. Also do not believe reviews that say you need more MP to print larger than 9x12. I won an award for an 8x10 that I took with a 1 MP Kodak digital of 1998!If you are looking for an ultra small camera and understand the tradeoffs for the convenience, then this camera is a great choice.UPDATE: After using the Z1 for more than a month, I can say that it is even better than I thought after a week and in my first review here at Amazon. The low light capability, which I gave high marks to originally, is even more wonderful... natural light setting. I have tested it down to two candles and it still takes great pictures. In bright light, such a scenic shots, it is fantastic. This camera is so good that my Canon G6 is collecting dust. The movie mode is no less than sensational. My Sony videocam is collecting dust. I love this camera. It is amazingly eaasy to use and the results are wonderful. The flash is also better than I first experienced.", "Date": "January 20, 2006"}, {"Title": "Great things in Small Packages", "Author": "Gabe E. \"Tech Geek\"", "ReviewID": "R1PPU7J2O71TGU", "Overall": "5.0", "Content": "So I first saw this camera in an advertisment from a different store. I guess love at first sight is true. I intially bought this camera for its portability, screen size, and overall look. When i got the camera I was impressed by the many features it had. As soon as i took it out of the box no adjusting was needed, this is truly a point and shoot camera. The software is a simple 1 2 3 setup. Even a child could use this camera. If you are looking for a camera that will garauntee great shots in all levels of light without any adjustment then be wary of this camera. As you can see this camera really doesnt give you anything to stabalize it when your taking a picture, so if your a very fidgety person this is not the camera for you. But if you are a person that is on the move and loves pictures, this durable camera is just for you. But you better be preparing to upgrade to the next level memory card while you getting ready to purchase this... without that higher storage memory card you will not be able to take advantage of the great Video Camera that this Digital Camera also is.", "Date": "December 13, 2005"}, {"Title": "Exactly what it's suppose to be.", "Author": "Robert Mazzola", "ReviewID": "R1SK6ZE08B32T8", "Overall": "5.0", "Content": "This camera is exactly what it's suppose to be: convenient, reliable, compact, user friendly and above all else, it takes good pictures.  If you want a camera that takes great pictures, you'll need to buy something a little more expensive, and quite a bit larger.  I bought and returned several cameras in this class before realizing that no camera this size, and in the sub $200 price range will perform the way my SLR does.  That said, if you don't mind playing with the Exposure compensation and ISO settings, you can take some pretty great pictures even in low light.I learned a long time ago that the worst camera is the one you don't have with you when a great shot presents itself.  With the Z1 you'll never have that excuse.  Even in a case it fits nicely in my front pocket without protruding too noticably.The only issues I have are that it doesn't have a continuous shutter mode, and the dock is required for charging and downloading images.  That said, I'm still giving it 5 stars because as I said,  it's exactly what it's suppose to be.", "Date": "January 3, 2007"}, {"Title": "Great camera for those on the go", "Author": "B. Puga \"bapuga\"", "ReviewID": "R4G3591O56I5K", "Overall": "5.0", "Content": "Wow.  This is my second Fujifilm camera, and could not be happier with it.  I had three reasons for upgrading and this camera met them all.#1-  Speed:  Besides processing pictures MUCH faster than my previous camera, the Z1 starts up AMAZINGLY FAST.  This means less photo ops are missed waiting for the lens to come out of the case and the camera to come on.#2-  Size:  I'm the kind of person that likes to bring a camera along everywhere.  I'll take tons of pics, delete the lame ones, and keep the jewels.  This camera is slim and about the size of a deck of cards.#3-  Quality:  With any digital camera upgrade, you expect quality improvements.  The real-light (or whatever they call it) feature makes for much better color.  And a 3 mega-pixel jump was nice, too.On a side note, the proprietary battery that is included with this camera is amazing.  I used to carry extra batteries with me at all times.  The Z1 lasted an entire week on vacation (over 200 pics) and the battery indicator never changed.Some gripes:  You have to use the included dock if you want to transfer pics to your pc or use a tripod. The LCD screen is HUGE, and very exposed.  This means you have to be careful not to scratch it, a problem for those (like me) who take their camera with them.  There is no Webcam mode on the Z1, unlike my previous Fujifilm camera.OVERALL, I HIGHLY RECOMMEND THIS CAMERA.  (I could never find this model on display in a brick&mortar; store, and bought on faith from Amazon.  You may have to, as well.)", "Date": "January 29, 2006"}, {"Title": "Love it.", "Author": "Emily K", "ReviewID": "R35ZSPR2O4A6U0", "Overall": "5.0", "Content": "I love this camera. \"Krykie\" commented in a previous review that there is no tripod screw--there is. It's on the charging dock, which is small and easily portable.What I like most about this camera is the fact that the lens never extends past the cover, so it can be opened and closed quickly and easily. And it's so fast! Great for people who love taking snapshots on the fly.I will say that I got my finger in the frame a few times at first. You just have to learn how to hold it.Overall, this is a great compact camera. The look, the size, the speed, the features, and the picture quality make this one cool little camera.", "Date": "January 7, 2006"}, {"Title": "Perfect compact camera with great picture quality!", "Author": "@GMCz", "ReviewID": "R38WDDHWJ9CA72", "Overall": "5.0", "Content": "I've had this camera for several months now and I LOVE it. If you are a professional photographer looking to take photos for magazine covers... move on BUT if you're looking for a small camera that you can take anywhere and take good quality shots this is it.PROS:Small (Fits in your pocket)Big Screen (And it's hard to scratch! I frequently slip it in my pocket, sometimes with change, and it hasn't scratched once yet.)Good Battery Life (Don't use the flash and it'll last a long time.)Rechargeable BatteryGreat Quality (99% of the time I'm very happy with the shots I get.)and the best:\"Natural Light Mode\" In this mode the ISO is raised to 800 (I think) and you can take pictures indoors without the flash! And they're not blurry either! It's a really great feature because when you use it your subjects don't have redeye or bleached skin from a flash. Also, the colors are almost dead on. I use this all the time indoors and get great results.CON:Lery little zoom. Just the standard 3x. (But better then other compact cams.)The only thing I'd reccomend is that you buy a case for the camera. Even if it's a cheap case, get one. The camera looks so good you'd just die if you scraped it up. ;c)", "Date": "August 15, 2006"}, {"Title": "Great camera, but flash isn't so great.", "Author": "Pamela", "ReviewID": "RXOGACI2IMUFL", "Overall": "4.0", "Content": "I like this camera, it's a little bigger than a credit card and pretty stylish.Pros:  Sturdy body, big lcd, easy to use buttons, video mode with sound, great images outdoors, slideshows.Cons:  Horrible images indoors at night w/ flash.So far I've had this camera for about 2 days and I love it.  It's easy to upload the pictures, but put your camera in the dock and plug in the usb cord and follow the steps on the screen.  If you want to play slideshows, just put the camera in the dock and plug in the a/v cords and there you have it.  I recommend buying a 512 mb type-m xdcard if you're planning to take a lot of pictures.  With the 16mb card it came with, i took about 6 or 7 pictures and a small video.  I took a few pictuers at night and sometimes when I turned on the flash, the whole picture would be white.  When I turned off the flash, the picture was grainy and unclear.  Overall, the Fujifilm Finepix z1 is a easy to use camera with nice picture quality.", "Date": "January 5, 2006"}, {"Title": "Great Camera", "Author": "Utah girl! \"utah girl\"", "ReviewID": "R3C8DOZD9PWMY7", "Overall": "4.0", "Content": "It really worked great for me!! I know people that doesnt like it because its too small and you cant fit it in a tripod...In my case I love it because I just use it when I go to parties and concerts and its so small and great to carry.  Regarding to the picture quality i think I got a great camera.... Its beautiful...I get great pictures!!", "Date": "March 2, 2006"}, {"Title": "Great Camera", "Author": "Bella", "ReviewID": "R3GAJ95G4RDZB", "Overall": "5.0", "Content": "I really love this camera. There is no easier camera to use. The thing I like best about it is that all you have to do is press a button to view the picture you just took. It literally takes less than a second. If looks are important to you, this is the camera for you. EVERY time I pull it out, I get a \"wow!\" Not to mention, it has the coolest \"power on\" ever. The front of the camera slides to the side to reveal the lense. AND the screen just really doesn't scratch. The ONLY thing I don't like about it is that there is a very slight pause after you take the picture. But, the quality makes up for that. Love it.", "Date": "February 22, 2006"}, {"Title": "Good and Bad", "Author": "iSAWaUFO", "ReviewID": "RDW799Z717ZMG", "Overall": "3.0", "Content": "I'm enjoying the Z1. Picture quality is decent. It has good low-light imaging and I really like the fact that it has the sliding lens cover. What I don't like is that it uses a non-standard USB port and will not charge off the USB connection, so you must lug the cradle and power supply around with you when you travel.", "Date": "December 26, 2005"}, {"Title": "very handsome camera, takes nice pics for night outs", "Author": "Aan S. Rianto", "ReviewID": "R146FZNRDAB3G3", "Overall": "5.0", "Content": "First time I saw this camera, I said to my self that I have to have it. It looks so cool and handsome. My order come a week later and I've been a happy camper with this little guy. I had Olympus E20 and currently also bought a Minolta Dimage A200. I hated my old Olympus because it was really slow. My A200 is a beautiful camera, yet fast enough to take an 8mp pics.This Finepix Z1 is really good in taking pics in low light conditions. Doesn't say have the image stabilizer, but the macro and other pics I took in very low light, including a chandelier with a single votive candle, yes, I said A SINGLE VOTIVE CANDLE, captured beautifully, no blurry image when you use in Natural mode. Using a night mode, definitely you'll need to rest your camera on a steady surface, no tripod socket :(.The memory card that come with the camera is not big enough to store pictures with full resolutions, but stores enough pics for e-mail.Definitely the camera I want to take everywhere with me !!! Unless I want to take a more sophisticated picture then I'll bring my other beauty, Dimage A200.", "Date": "July 27, 2005"}, {"Title": "perfect point and shoot camera", "Author": "Michelle", "ReviewID": "R2BVL1J0VXFF1U", "Overall": "4.0", "Content": "I would classify myself as a good critic of digital cameras. I've had this camera for over 2 years and i love it. It takes good quality pictures. There are some downsides to it though. It doesn't take quality pictures at night if your a certain distance away and sometimes it takes blurry pictures in darker places as well. The sound doesn't work on my camera but its probably becuase I have dropped it a couple times and thats never good for any camera. The battery life is okay but my friends have other cameras and their batteries usually last twice as long as mine does. I recommend getting a back up.", "Date": "May 29, 2007"}, {"Title": "Good, but not perfect", "Author": "Steve Turton", "ReviewID": "R2DG9CT1X3BSQV", "Overall": "4.0", "Content": "I was looking for a camera that was small and had a large LCD screen on the back for reviewing pictures that I had just taken.  This camera fits that bill perfectly.  For the most part, the daytime pictures are very good....and especially blown up to 8\" x 10\"....I was very impressed.  But what I don't think are up to par are the nighttime pictures, or pictures taken inside at night.  They are OK sometimes, but kind of dark in most cases.  Other than that....I like the camera very much.  Also, using the docking station to download your pictures to your computer is a pain....so buy a USB card reader.  I also found the battery life very good, so I don't have to charge it every day because I usually only take about 20 pictures at a time.Hope this helps you decide if this camera is for you....Steve", "Date": "August 13, 2006"}, {"Title": "Great camera", "Author": "txfive", "ReviewID": "R2TTFR6J9OEQWW", "Overall": "5.0", "Content": "This camera is easy to use and is adaptable in all types of environments.  Great night shots!  The large LCD screen is fantastic and clear!  Took it right out of the box and began shooting and I am definitely an amatuer!", "Date": "February 12, 2006"}, {"Title": "love it!", "Author": "Andreea Polonic", "ReviewID": "R339H46S8142OB", "Overall": "4.0", "Content": "I love this camera!  It's light and little.  Perfect for everyday photography.It's easy to use. Just slide the front cover open and you're ready to shoot.  It takes good pictures in low light and the macro mode is fantastic!My only complaint is the way you transfer the pictures.  The camera comes with a dock.  The dock has to  be connected to an outlet through a AC power adapter and to upload you have to hook the USB cord to all of that.  You have to dock the camera in order for the pictures to transfer.  I usually use my pictures for school projects where I have to upload them on to the computers at school.  I don't want to have to carry around the dock, the AC adapter, and the USB cord just to upload a few pictures.  I going to be getting a xD card reader.  It would be so much easier if they made it so you could plug the usb cord directly into the camera.Other than that, I have no problems recommending it to anyone looking for a fun little camera.", "Date": "December 27, 2005"}, {"Title": "mediocre pic quality", "Author": "B. Yeung", "ReviewID": "R15UDX6WMQA6P8", "Overall": "3.0", "Content": "I just want to say that I agree with the reviewer, C. Caroll. To the reviewer who inferred that C. Caroll did not read the manual correctly, you are wrong. Indeed the photos are full 5MP, but if you zoom in on them, and you will see a definite lack of clarity, and elements of compression. They almost look like impressionist paintings when you zoom in. I bought this camera for the size and the low-light capabilities, and it met my expectations in that regard. But I am disappointed with the picture quality.", "Date": "September 23, 2005"}, {"Title": "Grainy Shots", "Author": "Steve \"Steve\"", "ReviewID": "R26YGXJJ59BSDU", "Overall": "1.0", "Content": "Buyer beware!  I bought this camera and tested it out by taking indoor and night shots.  I downloaded them to my PC (which was very easy) and the pictures were grainy and many were out of focus.  The picture quality was worse than most compressed .jpg's that receive via email.  I have an older Olympus C-3000 which takes terrific pictures (indoors, night time, etc.).  I am used to much higher quality shots.  The Olympus has a much larger lens, which I think has something to do with it.  I took the Fujifilm back and am sticking with my older Olympus for now.  I am extremely disappointed, especially since Best Buy charged me a 15% restocking fee ($60)!", "Date": "June 26, 2005"}, {"Title": "Excellent 10mp Images !", "Author": "Paulibus Schumann \"Casey-Kin\"", "ReviewID": "R2N0K8HPGLHEYM", "Overall": "5.0", "Content": "Great for the money!  I do, however, miss the regular old viewfinder (esp. when my battery runs low).  No way to shoot without the LCD display.  I've owned 6 FujiFilm digital cameras over many years.  I get used to one and the new camera throws me.  Some of the features of past Fuji cameras that this one lacks are auto-bracketing and fast multi-image shooting.  Still... great images for my dolla... now if I could just connect the wrist strap to either side of the body I'd be very content with my purchase.", "Date": "October 8, 2009"}, {"Title": "great camera- super easy to use", "Author": "N. PRITIKIN", "ReviewID": "R30BEMQ51I4MTZ", "Overall": "5.0", "Content": "I've had several digital cameras in the last 10 years and this is my favorite by far.  Very very easy to use, great small size and takes excellent pictures.  I lost this one and decided to replace it with the exact same camera!", "Date": "September 1, 2007"}, {"Title": "So good, I bought it twice", "Author": "Krykie", "ReviewID": "R2MMVRRJCUYQPO", "Overall": "3.0", "Content": "This is a great camera.  I bought my first one 1.5 years ago, and this summer I broke it  -- and went out of my way to buy another one. I also have a more expensive NIKON digital with all the bells and whistles, but this one is so good -- I never use the NIKON.PROS:*It starts and is ready to take a picture faster than anything else I've seen on the market.  No waiting to \"load\" or whatever the wait is on other digitals.*Size - small enough to fit in my front jeans pocket*Durable - I've dropped it, and klunked it, no problem.*Screen - Easy to see outside in light*Features - Easy to flip through and set without having to look at the manualCONS:* No viewfinder; only large screen which is sometimes a problem in VERY bright places.* Charger is as big as the camera itself (you have to use the cradle), which makes it annoying when I'm trying to travel light* You need the cradle in order to use a tripod/monopod.  No problem except when trying to do a self-shot.OVERALL:  Buy it...again and again.  You'll find that you have it with you more often, and will take pictures more often.  A better camera isn't better if you don't have it with you...", "Date": "June 24, 2005"}, {"Title": "Great feature set - very very bad compression makes the it all for naught", "Author": "C. Carroll", "ReviewID": "R34VRZWY5Q2721", "Overall": "2.0", "Content": "Hi all -I loved the features and the form-factor of this camera - all metal, feels like quality, great looking and the speed is great.  Plus the fact that you could shoot video in full VGA at 30fps w/ no limit except the size of your memory card.But unfortunately, Fuji used a compressor chip that scrunches the data in the photo so much you lose a lot of clarity.  It's like looking at a low-quality jpeg and there's no way to change it - I searched all through the manual and the on-screen menus and there is no setting for compression.And I'm not talking about a small, barely noticeable defect - it was horrible!  My 2.0 megapixel canon powershot took way better photos just cuz it didn't compress them so much.  I took a look at the file sizes the two cameras made - at 5.0megapixel on \"fine\" setting from the Fuji, the file sizes were smaller than the canon 2.0megapixel!  So, no wonder the camera's so fast - it's sending less data to the memory card, and you lose out on quality big time because of it.I loved everything about the camera except the pictures it took, so i had to return it.Best of luck.", "Date": "July 27, 2005"}, {"Title": "Cute, but lousy pictures", "Author": "Osvaldo Rodriguez", "ReviewID": "R23M9221AR4VEV", "Overall": "2.0", "Content": "It is a cute little gadget, for the price I thought it would take better photos. Indoor photos look out of focus and grainy, I love my cannon. S-70.", "Date": "November 1, 2005"}, {"Title": "Fast startup, but quality lacks...", "Author": "D. Brandner", "ReviewID": "R24CSJ6AKCOKL7", "Overall": "3.0", "Content": "I have been using this camera for a few months and its very user friendly and the startup time is VERY fast, but the picture quality doesnt compare to a Olympus or Sony. Its bad with low light conditions, pictures have static in them, and even in sunlight the pictures are just OK, not anything amazing at all. But for a camera to take pictures with friends and simple pictures, I would say that it is ok for that. just OK. I used it for Bike Week and taking pictures of the wet t-shirts contests and bar scenes with friends, and i like it because you never know when something happens that you want to take a picture of, and this camera is very fast to start up so u can catch every moment quickly which is a very great feature.PROS:FAST start-up timeFast picture takingsmall \"pocket sized\"good for everyday useCONS:poor picture qualityBad in low-light conditionsI would buy it again, probably, just because the fast startup, as far as picture quality, it doesnt compare to others, thats why it lost stars for me, the pictures could be a lot better...", "Date": "March 19, 2006"}, {"Title": "Terrible Customer Service!!!", "Author": "C. Allen \"Jason Logue\"", "ReviewID": "R2P9EJYXGARVBH", "Overall": "1.0", "Content": "The camera is fine as long as nothing goes wrong. Fuji has the worst customer service I have ever delt with. They pass you from one person to another and do everything they can not to help you. Be prepared to deal with the worst customer service in the business. I really hope this helps you.", "Date": "December 23, 2007"}, {"Title": "Great Camera, Bad Company", "Author": "W. Yates", "ReviewID": "R3K0178UOSRDQ9", "Overall": "2.0", "Content": "Here's the Good News:I have had many cameras in my life, digital and film , and I have found the Z1 to be my favorite.  The camera is very user friendly and the pictures are sharp with great color.  My previous camera was a Minolta Dimage 7($800) and I found that this camera's photo quality was just as good.  The best feature of the camera is the fact that it is sturdy and compact enough to carry with you daily.  Owning this camera made taking pictures a daily part of my life.Here's the Bad News:Recently my camera broke and when I tried to contact Fuji to get a replacement or a repair, the service was terrible.  Their website is very difficult to navigate and offers very little support.Summary:Great camera as long as it doesn't break.  It's easier to pay someone to fix it than actually get Fuji to repair it.", "Date": "March 25, 2007"}, {"Title": "Nice features but extremely fragile", "Author": "Lloyd Borders", "ReviewID": "R1MIDE42L0VA72", "Overall": "1.0", "Content": "Bought this camera for my wife.  Takes good pictures but handle this camera with extreme caution.  If you drop it be prepared for a large repair bill.  Fuji customer relations is sub-par.  Warranty does not cover any impact internal damage.  I've had better luck with Nikon and Kodak and will steer clear of Fuji in the future.", "Date": "August 8, 2006"}, {"Title": "Stay away", "Author": "Joe", "ReviewID": "R3N5HL8K5X009R", "Overall": "1.0", "Content": "Do yourself a favor and stay away from this camera. I returned mine after trying every possible combination of every possible setting and realizing that at best this camera takes pictures that are mediocre. At worst they're unusable, and most pictures fell into that second category. I have an older 3.2 megapixel Canon that takes significantly better pictures than this 5.1 megapixel camera. I bumped into someone at a party who had this Fuji, and they had pretty much the same opinion of it. About the only reason I can even give this camera 1 star is because of its compact size and portability. But, what good is that if the pictures are horrible? If you are considering this camera, I strongly recommend you take a look at the Canon PowerShot SD450 instead. It's very similar in size and price, but takes pictures (and videos) that are in another class entirely. It totally blows this camera away.", "Date": "February 24, 2006"}, {"Title": "Analizing Quality of z1", "Author": "Oliver Yamuni \"Oliver Yamuni\"", "ReviewID": "R3N6VLFWG1LDMH", "Overall": "3.0", "Content": "I bougth this camera 2 months ago, and i was agree to buy it cause of the tiny body which let u carry it whereever u go, and the lcd is huge so u can see clear the pic ur taking.After a while using it I got dissapointed about the quality of the picture, when u see them in ur pc u dont see them as u expected.I used to have before this camera a Kodak 3.1MP and i believe that the picture was so much professional. Another thing which made me unconfortable is that the lens is to close up to the place where u hold the camera so it is so easy to drop down the camera. If I have the chance to go back i wont buy it. Thank u", "Date": "November 3, 2005"}, {"Title": "Flop of a Fuji", "Author": "TnT \"Trudy\"", "ReviewID": "RBHB99RWXLS6T", "Overall": "1.0", "Content": "It was a very sad day when I had to return a Fuji camera within one week of purchasing the Z1.  I had taken over 200 pics in that time span with various lighting and options.  I probably had 2-4 pics that were salvageable.My brother is a professional photographer who is a big Fuji fan and user.  I was on the phone e:Mailing the Z1 pics to him and he was astounded at the poor quality of the pics, as well, even though some other reviewers had great quality pics.  Perhaps the camera has inconsistencies in the manufacturing of it, as I could never see it taking a decent pic to want to keep on your PC much less print out?We took it back, paid 15% to return it, and went to a real camera shop and bought the Fuji E900.  More pricey, a tad bit larger than the F1, but much better camera and the Fuji quality is back!", "Date": "December 18, 2005"}, {"Title": "Great Camera, lousy service.", "Author": "Judge Andy", "ReviewID": "R259V5VNU1Z5G4", "Overall": "1.0", "Content": "I bought this camera for my daughter. She loves it, but it lost the sound recorder. I took it in to the Fujifilm service center, which happens to be located where I live and they can't even look at it for at least a month. There are no other alternative servicing facilities with a quicker response. It is the worst service time I have ever heard of. I would not buy another Fujifilm camera.", "Date": "January 30, 2006"}, {"Title": "Don't Buy...FujiFilm Support is a Joke...It's The Worst !!!!!!!", "Author": "Koz", "ReviewID": "R2DU86WO6JK87O", "Overall": "1.0", "Content": "I bought the camera in May of 2006, as a graduation gift for my son.  He loved the style and compactness.He experienced focus/zoom problems after 1 use.  Unfortunately he didn't start to use the gift for 2 months or I might have been able to return to Amazon for a refund.  Contacting Fufifilm has been overly cumbersome. Their website is not straightforware and their voice response system is not user friendly or responsive (LONG WAITS).  They have had the toy camera (AS THIS IS BEING WRITTEN)for over a week and when I called yesterday for status, they told me that the camera \"hasn't been diagnosed yet\".  I expect it will be, once their 90 day warranty expires, which will limit Fujifilm's liability to the 1 repair.  I have a mean case of buyer's remorse.  I might as well have taken the ~$235.00 spent on this camera and tossed it in the street.If you own one and it doesn't require repairs, you might like it.  If it ever requires repairs, you might feel as I that you would have been better to purchase a disposable digital camera.  Save yourself the potential aggravation and look to a camera that has a longer warranty, a better support environment or by all means purchase the extended warranty.  You may still face the frustrations but will have the consolation of knowing that it will cost you no more then shipping to have it repaired.  I bought it in May of 2006....I feel like I lost it in July of 2006.IF I COULD HAVE GIVEN THE Z1 LESS THEN 1 STAR, I WOULD HAVE.  THAT'S WHAT IT DESERVES!  !&%$$##444EN FUJIFILM", "Date": "August 22, 2006"}, {"Title": "No Thanks", "Author": "Lori L. \"llinder\"", "ReviewID": "RFLOWQEXIS0XO", "Overall": "2.0", "Content": "I bought this after seeing it on tv.  I'm really disappointed.  I think the front cover is hard to open.  My fingers slipped on it.  There is nothing to grip, no indents, etc.  It's also very easy to hit other buttons on the back while taking pictures.  I got my fingers in the way on the front of the lens too easily.  The software is terrible.  There is a row of buttons on the right that are advertising and there's no way to make it go away.  When I clicked on one called Customize, it took me to a Fuji website where I was supposedly able to customize the list of items on that column, but it would not let me delete them all.  Also on that website, the word Customize was spelled about 4 different way - making it look like a 4th grader had done the page.  Also when I tried to download some utilities it froze up and closed me out of the Internet.  I also had to manually control/alt/delete shut down the program several times because it froze up. When I tried to drop and drag photos into specific new folders I'd created it closed up the program and I had to reopen it to begin again.  Really, really frustating.  I\"m going to try to return the camera.", "Date": "January 8, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.1-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\nFast .6-second start-up, 1.1-second shooting interval, and .01-second shutter lag\n3x optical zoom; 2.5-inch LCD display\nUltra compact, measuring only 3.5 x 2.2 x .7 inches\nStores images on xD Picture Cards; powered by Lithium-ion rechargeable battery NP-40 (included)", "Name": "Fujifilm Finepix Z1 5.1MP Digital Camera with 3x Optical Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41m56VrBCFL._SX300_.jpg", "ProductID": "B0007IANK2"}}