{"Reviews": [{"Title": "Excellent Photos/ Easy to Use", "Author": "James D. Nichol", "ReviewID": "R26UEFAXK0EOAF", "Overall": "5.0", "Content": "In a former life (18 years ago) I did some professional photography (portraits & architectural) and I used professional equipment daily.I haven't been in the photography business for many years but I still know good photos when I see them and this little gem can even make up for some of my bad habits and poor subject matter as well.  I'm not going to get into the technical side of what make this a good camera other than to say on automatic or controling each aspect of your shot it works well. At 8 Mega Pixels the photos blow up very nicely and I am even proud to show them on my 13 foot projection screen. (as long as you're not too close they look very crisp)If you are use to (and like) the menus from older Olympus cameras you will instinctively know how to use this camera with a few exceptions. The menus have been simplified and are easily navigated.  My only complaint is that I have large hands and fingers and I can sometimes activate the menus and controls by accident while shooting.In addition to the camera, is the camcorder - very nice! It doesn't shoot anywhere near the resolution I would like, but the easy of use and the fact that it is right there with a dial of a knob has made it so easy to get a few little movies in-between still shots that even my technically challenged wife is taking video now. (and believe me that is a big deal - she loves this little camera)  So the functionality and accessibility of shooting video more than make up for the resolution (resolution isn't that bad when you consider you might not have shot the video footage in the first place if you didn't have the camera handy)For the small price you pay for this camera you would have spent well over $1,500 in 1987 dollars. I really like this little camera and if I had smaller hands I'd give it 6 stars.", "Date": "September 6, 2007"}, {"Title": "Awesome Camera! Love it!", "Author": "K. Jenkins \"2boysmommy\"", "ReviewID": "REB2AWSZSW2PU", "Overall": "5.0", "Content": "After going over tons of reviews for tons of cameras I finally purchased the Olympus FE-250. That was absolutely the best decision I ever made! I love this camera so much. Pics turn out wonderfully. I have only had it for a few weeks and still learning, but it's pretty simple. My favorite part: It takes panoramic pics; it will snap 10 shots super fast. Perfect for getting pics of my kiddos in action! It's so small and compact it fits in my back pocket easily. It's sleek, classy & gorgeous. I have gotten so many complements on this product. Would definitley recommend this to anyone wanting a can that can do just about anything but needs simplicity as well.", "Date": "March 18, 2008"}, {"Title": "Small camera, great photos, slow shutter speed", "Author": "JV", "ReviewID": "R33WJLZYIWGK6P", "Overall": "4.0", "Content": "Purchased this camera through Beach Camera. Happy with the company, very happy with the quality of photos from the Olympus FE-250. Colors are vibrant, the camera itself is VERY compact. I would recommend buying a case for it, I scratched it on it's first use, but probably because I was so used to tossing my old dinosaur of a digi-cam around. the only complaint is the shutter speed is quite slower than some other cameras, so if you like to take quick photos, this isn't the best bet. but if you're in the market for an easy to use, compact, nice looking camera that takes nice looking photos, I recommend it.", "Date": "February 19, 2008"}, {"Title": "I love my camera--so many great memories saved!", "Author": "Veggie Lori", "ReviewID": "R1H5X51OMIETC8", "Overall": "5.0", "Content": "This camera is/was my first digital camera I've bought. It's easy to use as a camera and also, I discoverd, as a video camera. I've taken so many short videos whose memories will last a lifetime! I hate to say I've even dropped this camera TWICE in the 2-1/2 yrs I've had it and the little darling still works fine! (the second time it tumbled down the vinyl coated--luckily for me--steps of a tour bus!) I was able to take great shots in costa rica after having only had the camera about 1-1/2 weeks before the trip! I highly recommend this camera to everyone, especially beginners. I've gotten lots of compliments on the camera and its pictures.", "Date": "November 13, 2009"}, {"Title": "good but I thought that the quality of the image would be better", "Author": "A. Paras", "ReviewID": "R11QQR7QUEDP8U", "Overall": "3.0", "Content": "The size of the camera is great and easy to use; I was happy with my purchase the only thing is that the quality of the image in the picture is not perfect. Not bad for the price.", "Date": "November 29, 2008"}, {"Title": "Bad low light", "Author": "Rachel Farrell", "ReviewID": "R3EQ7FSOH2PGSU", "Overall": "4.0", "Content": "The camera itself is a thing of beauty - very sleek and compact. The features are nice, but in a decently lit room I couldn't get rid of the noise in the background where it was a little darker. The camera was stolen before I could experiment with it much more (still a bit bitter about that), but for a basic point and shoot, you could do worse.", "Date": "March 30, 2008"}, {"Title": "go for it", "Author": "Stephen A. Jaggers \"Steve\"", "ReviewID": "R3LQ36QJO5HW4V", "Overall": "5.0", "Content": "Compact is the word.  Light, small, easy to use.Large viewfinder/screen for a camera this compact.Takes great pictures", "Date": "August 16, 2007"}, {"Title": "great camera!", "Author": "Sarahdise", "ReviewID": "R20LN25BOKPZMH", "Overall": "5.0", "Content": "I have had 2 digital cameras previously that were much more expensive, and I still like this one better!  It's really light and small, and super easy to use (even my dad can use it!).  I highly recommend it.", "Date": "November 29, 2007"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000NBOA0M"}}