{"Reviews": [{"Title": "Some good (great pics), some bad (eats batteries)", "Author": "just another customer", "ReviewID": "R34JHSPK2IZIGB", "Overall": "3.0", "Content": "There are some things that Nikon did right with this camera, but mostly they  got it wrong.  Although I love my Nikon Coolpix 3100 (3 megapixels), some may want to avoid the Nikon Coolpix L11.First, the good.  It takes great pictures and fits into your pocket. OK for snapshots under normal conditions.  I also have had some professional quality pics with good color saturation then the light is good.  The camera remembers your settings (eg, exposure compensation) after being turned off, meaning you don't need to reset them each time you power up/down.Now the bad:1. As one reviewer noted, it does not have a viewfinder, only an LCD monitor.  First, powering the LCD screen makes it eat batteries.  Next, the LCD screen is useless in bright light because you can't see what's on the screen.2. Once the camera alerts you that it's turning off after a certain period of non-use (eg, 60 seconds), it takes a long time to actually turn off.  And in the meantime, there's nothing you can do to stop it from turning off.  Not good it you want to get that great shot.3. The cycling time between pics is very long.  It takes about 1.5 - 2 seconds to recycle and get ready for the next shot.4. The \"multi-selector\" (the large round dial in the back that lets you select flash, timer, exposure, and macro settings) is prone to operator error (meaning it's too small and you will select the wrong setting a lot (eg, exposure instead of timer).  This means you need to scroll out of the wrong setting, back into the correct setting.  Again, a time waster.5.  It can be very noisy (the pictures look grainy) in night pics.The price isn't bad for 6 megapixles, but I suspect the low price is indicative of how much some people don't like this camera.  Still, I think it's a three star.", "Date": "August 30, 2007"}, {"Title": "A great camera for the money...and even for more money", "Author": "Dare to love", "ReviewID": "R3JX05C5QL7CFK", "Overall": "5.0", "Content": "This is a great camera. I have used and owned several cameras, including three Canons (all great), a Panasonic (not so great), and now this one. This is what I wanted in a camera, things I think all of us are looking for:1) Price - I was looking for a camera around $[...]. This narrows the field considerably.2) Picture quality - Obviously, this is why you buy a camera. I would never buy a camera from a company that isn't famous for them, such as Samsung. I compared the Nikon L11 to the Canon A550/560 since these two are really the best budget buys out there.3) Size, AA batteries, SD card - all these features make for a great an inexpensive camera to use. The Canon is too bulky too comfortably put in your pant pockets.4) Speed - this is also essential. Nothing is more annoying than a snapshot camera without the \"snap\".This is a great camera that I would recommend to anyone. Go to [...] for an expert opinion.Thanks,", "Date": "July 20, 2007"}, {"Title": "nikon coolpix l11", "Author": "M-Diver", "ReviewID": "RWVKYLYEJN89V", "Overall": "4.0", "Content": "I bought this camera after returning the camera called Lumix by panasonic, because the Lumix didnt have audio during video, which is very important to me. Anyways, this camera is awesome with all the features including zoom during video, audio, crisp pictures, etc. The only reason I gave it 4 stars instead of 5 is because during video recording you can hear a low buzzing noise during playback. The picture quality is excellant but the underlying buzz noise is kinda a drag. Also, you need to read your manual and reset some settings if you want to use flash or not during auto mode. Its the BSS ON/OFF setting. I added some pics if you wanna see them. Good batter life for a digital camera. Buy rechargeables of course.", "Date": "October 14, 2007"}, {"Title": "Nikon L11 digital camera", "Author": "M J \"Cat Man\"", "ReviewID": "R1WY5WAGSCZYI3", "Overall": "5.0", "Content": "Having had another Nikon digital camera for the past few years I knew I liked the operation and durability of their products.  When it came time to get multiple units for work I went with the L11 unit.  It is small, light, has a large view screen and lense protector, and it runs well on regular AA batteries.  My employees have had them for two months now and they are working great so far. For the price this camera is a real deal!", "Date": "May 12, 2007"}, {"Title": "Nikon Coolpix L11", "Author": "KS \"KS\"", "ReviewID": "R2YOYT9R9LDSN2", "Overall": "4.0", "Content": "I bought Nikon Coolpix L11 for my daughter from Bestbuy 2 days ago. In the evening it showed \" Lens Error\" and would not operate. Took it back and got an exchange got in the car and the second one had the same \"Lens Error\" and would not operate. Next day had another exchange and now the 3rd one working ok. In spite of its 6MP the images are not comparable to a 6MP digital SLR but for the value it's pretty decent. It is a point and shoot camera and has very little controls. The one I really miss is able to control the ISO speed. I like the fact that it goes all the way to 800 ISO but you can't control it. I really like the \"Face Recognition\" feature that locate the face and determine the exposure accordingly. It's sleek design is appealing, the LCD is decent size but would like to have little more controls in terms of ISO speed and contrast. Overall my daughter think its cool camera and that's all it matters.", "Date": "May 31, 2007"}, {"Title": "Decent Camera", "Author": "Mir Islam \"mislam\"", "ReviewID": "R387BGKM9S3ZS6", "Overall": "3.0", "Content": "I am a big fan of Nikon cameras. I have D70 that I really love. But this camera left me with a lot more to desire.Good:- Takes very good pictures in good lighting- Nice options including face priority- D Light feature seems to be really working- Supports SDHC card- Very cheap (less than 100)Bad:- Takes not very good picture in low light or shade- Flash is not powerful enough to go over 5 feet- Shutter lag time sometimes can be long. Not sure why, but it could be related to battery power. That causes more shake and blurry pictures. Especially if you let someone else take the picture who is not aware of the lag.Overall, I think coughing up a bit more money for L14 (which I believe has optical stabilizer) maybe worth it.", "Date": "December 31, 2007"}, {"Title": "Awesome little camera!!", "Author": "D. J. Epright", "ReviewID": "R8P0JXJ1UY04S", "Overall": "5.0", "Content": "I've owned a sequence of the Coolpix cameras and they just get better and better. This one's great!I have a Coolpix 5600 (??) that I took to Iraq last year -- and loaned it to a co-worker for her own deployment to Iraq. She won't be back before I go again -- therefore I bought this little gem. I couldn't believe the price for a six-megapixel camera. It takes great pictures, I really like the Coolpix size and shape, the LCD screen is bigger and brighter -- and the titanium colored body is simple and elegant.", "Date": "April 7, 2007"}, {"Title": "Camera is too slow!", "Author": "D. Antenucci", "ReviewID": "RJ1X5AIOBG9HK", "Overall": "3.0", "Content": "I'm on the border of giving this 2 stars, but have opted for 3 stars since the pictures are decent for the price of the camera.  Gripe #1: the boot-up speed; when turning the camera on, it takes 4 seconds before it is ready to take a picture.  Gripe #2: processing speed between photos; another 3 seconds in between pictures.  There is a setting which allows for taking rapid photos, but I believe you lose image quality in this mode.  Grip #3: the provided computer cable (for downloading the pictures) is a micro USB connection (unlike most camera's mini USB connector (e.g. Canon digital cameras)).  The only reason this bothers me is I'm short on USB ports, and I already have a mini-USB hooked up for my Logitech remote control. Now I have to take up another port for this camera. Gripe #4: power-save mode is confusing.  The camera shuts itself off after a certain length of time, and getting it back on was a bit confusing.  There were at least 2 occasions during the first weekend of use where it went into sleep-mode, and I tried waking it up by pushing the power button. I don't know if the camera was just slow to respond, and so I hit the power button again, but all of a sudden the camera is turning off (the lens goes back in).  Whatever the case was, I was fiddling with the camera for 15 seconds before it was ready to take the picture (which I ended up missing because of the delay).I'm returning it today, and buying the Canon PowerShot A550.  The price is equivalent, and Canon has not let me down (especially with the boot-up and in-between processing times).", "Date": "July 26, 2007"}, {"Title": "VERY Disappointing!", "Author": "Jennifer", "ReviewID": "R1AMOL5D804JPN", "Overall": "1.0", "Content": "I purchased the L11 just prior to a family vacation so I could get some nice snapshots. I was very disappointed. The vast majority of the pics we have taken have been blurry, under or overexposed, grainy or have had some other problem.  The two biggest problems with this camera is the delay when you press the shutter button (to take a pic) and the poor focus control. Although this camera was relatively inexpensive, it didn't perform even at the minimum standards I would expect.  I would NOT recommend getting this camera. After all, what's the point of getting a \"bargain\" if it doesn't do what it's designed to do?!", "Date": "December 1, 2007"}, {"Title": "Nikon quality - Instamatic size & ease of use", "Author": "Dave \"dccanfield\"", "ReviewID": "R1ILH1OX78BF3K", "Overall": "5.0", "Content": "I have a Nikon D200 which I love, with the exception of when I have to lug my camera bag on a trip with limited opportunities to use it, or when I want to shoot a fleeting photo-op. This has excellent resolution (better than my DX2 did for $2600 four years ago) and color rendition, a sharp lens, and requires no set-up. Quality, ease of use, without frills. Nice LCD, too.", "Date": "December 7, 2007"}, {"Title": "It's a good cheap camera", "Author": "Deyanira Andrade", "ReviewID": "R2WT338MWQ345X", "Overall": "4.0", "Content": "Nikon Coolpix L11 6MP is good for me. I use it with lithium batteries and I haven't had any problem. But when you're taking pictures you have to wait 5 seconds to take another picture...But I'm happy to have it. It takes nice pictures!! I recommend it.", "Date": "September 20, 2007"}, {"Title": "Decent product for the price with some quality concern", "Author": "PC \"Sleepless in LA\"", "ReviewID": "R3AZMEBSMF6K3", "Overall": "3.0", "Content": "I owned this one for a day and returned it, part of the reason is due to the retailer.I am looking for a medium resolution point-and-shoot camera using AA batteries. Every thing in the spec of Nikon L10/11/12 looks great and it did perform. It is slim enough to slip it into the pocket. What prompted the return is that it didn't focus exactly. After comparing with a 2MP camera and a 10MP DSLR, I am certain that the focusing of my L11 is not accurate. When I brought it back to Circuit City and said I want to look at other brand, they asked for a 15% re-stocking fee. I decided to take the lost and never go back to Circuit City! Even Ritz has a 10-day no-restocking period!At another store, I checked an L11 and found somewhat better result on focusing so perhaps I was just unlucky on the first unit.Another concern on these camera with large soft LCD panel is that it looks vulnerable to impact. The Sony or Canon models with hard plastic panel looks better. Canon is good that it uses normal size USB connector and has optical view finder but the Canon's are too bulky.I ended up with a Sony 650 even that means getting Memory Stick Pro Duo.", "Date": "July 8, 2007"}, {"Title": "Awesome camera for the money", "Author": "Mike Mcauley", "ReviewID": "RC46EPIRC0LW0", "Overall": "5.0", "Content": "I bought this camera after having my old Samsung ruined by salt water. I am highly impressed with the quality of the photos it will take both in and outdoors as well as low and bright light situations. It will be my travel companion for (hopefully) many years...", "Date": "June 19, 2007"}, {"Title": "excellent bang for the buck", "Author": "Arun Perinkolam", "ReviewID": "RSBWK1LMXSOTK", "Overall": "4.0", "Content": "For a $100 point and shoot, the L11 is excellent bang for the buck. Its ideal for someone who does not want to deal with manual settings, it has about 15 pre-programmed shoot modes, apart from from the all-pervasive AUTO mode. Its extremely light and more importantly it fares pretty well in the two features I consider most important for the compulsive AUTO-mode shooter: image quality and AF (with face detection).There are obviously other point and shoot cameras like the Canon IS series that are extremely high performing, but for a budget camera the L11 works.", "Date": "December 24, 2007"}, {"Title": "Good Deal", "Author": "Jasia Mouline \"Jasia\"", "ReviewID": "R2L10JN78EMO65", "Overall": "4.0", "Content": "Well I've owned this camera for about 3 months now and it has served me well at home and abroad. It was my first digital camera and it was very easy to use. I opened it and used it at the airport before departure in a matter of minutes. There are many functions on it, but I only wanted it for simple pics, which have all come out great, even in motion.So I highly recommed it.", "Date": "November 24, 2007"}, {"Title": "Flimsy camera; died in less than six months :-(", "Author": "Jennifer M. Macleod \"yiddishe supermama\"", "ReviewID": "R36TQH6O6180GC", "Overall": "1.0", "Content": "This was a successor to our broken CoolPix L4 which only lasted 8 months; I don't know why I thought this one would last longer.  Guess I was a sucker once again.With the L11, I forbade every family member under 18 from even touching it because the last one proved so poorly-built.  And it still died - also of a cracked LCD screen - after less than six months.If you do buy this camera, I know now that they sell LCD protectors for not too much money that could potentially extend its life by a matter of years.However, even when the camera was working, it took less than fantastic pictures.  In low light, my choice was to take shaky, poorly-lit pictures with no flash, or washed-out glaring pictures with too much flash:  there never seemed to be a middle road.The macro mode had the same problems, and it was always rather time-consuming, switching back and forth from macro to non-macro, lit to unlit, to see which combinations of mode would give the best possible picture.  And even then, the pictures were not great.I totally chalked it up to my being a lousy photographer, by the way... and you may, too, until you - like I did - try another camera.  I'm now using a Sony DSC-S730 7.2 mp and loving it.  Every picture is a great one, with none of the lousy Nikon shutter lag before or between shots.If you do find yourself leaning towards this camera, PLEASE \"try on\" a few different cameras first!  Like I said, I thought I knew a lot about digitals, but it turns out, I just had to find the right camera.  For me, at least, with kids, and lots of pictures to take on the go (in less-than-ideal circumstances) this simply was not the right camera.  For just a bit more money, I found the right one and I'm so happy I did.We did enjoy the video mode of this camera, which, for some reason, was able to focus and get the lighting right even when the photo mode couldn't.  The L4 didn't have audio with its video mode, but the L11 did and it was lots of fun to use... while it lasted.Finally, don't make the mistake we did of buying the extended warranty.  The LCD viewscreen, shutter cover, and most of the other \"breakable\" parts are simply not covered by Nikon's or anyone else's warranty.  Apparently, they only warranty the stuff that can't possibly break.  Consider yourself warned.  :-(", "Date": "April 21, 2008"}, {"Title": "Great Camera for the family", "Author": "Aertle \"Aertle\"", "ReviewID": "R2KIO5S41TPN6K", "Overall": "4.0", "Content": "I got this mainly for my wife. The ease of use and large display made it perfect. I have been impressed with the quality for the price. A 2gig card will give you 1200+ photos. The Digital zoom is just OK, but overall very satisfied.", "Date": "August 23, 2007"}, {"Title": "Decent budget camera", "Author": "a satisfied Canon owner \"Pete\"", "ReviewID": "R2J533ZFB1YJCD", "Overall": "4.0", "Content": "I purchased this camera to replace my older Sony 3.2mp, as it was slooooow as heck.  I paid under a hundred bucks for it and I was a little wary after purchasing the camera and then reading some of the complaints about it.I am happy to say that the camera takes great pics and has a relatively short recycle time (for a camera that uses AA batteries).  I lent it to a friend who went to Disney World over New Years and he took some amazing pictures of fireworks.It's just a kick around camera for me but for a novice or someone who needs an inexpensive second camera, this is a decent camera to buy.Oh, it takes great video with sound, however, there is an annoying sound on playback. not so much to make me return the camera, but annoying enough to be noticed.", "Date": "January 12, 2008"}, {"Title": "nikon coolpix l11", "Author": "Andrea Herron \"Andrea H\"", "ReviewID": "R3C8EO0EHCTQDC", "Overall": "5.0", "Content": "i love this little camera. i'm not a professional photographer, all i need is a little camera that points and shoots and this camera does just that.  it doesn't have too many fancy features, but i wouldn't understand how to use them anyway.  if you are looking for a decent camera that takes decent pictures for a reasonable price look no further!", "Date": "December 21, 2007"}, {"Title": "Excellent camera!", "Author": "D. Cahill", "ReviewID": "R8ML0B3M4PT1M", "Overall": "5.0", "Content": "This L11 is an excellent camera. The large 2.4\"lcd screen is one of the best features that I like. It is simple to use and very handy. The one drawback that I found is the different usb cable that came with the camera. The port on this camera is smaller than on the others. So if necessary I must purchase another like sized cable. However that aside, I like the way this camera handles.", "Date": "December 18, 2007"}, {"Title": "Excellent camera!", "Author": "D. Cahill", "ReviewID": "R8ML0B3M4PT1M", "Overall": "5.0", "Content": "This L11 is an excellent camera. The large 2.4\"lcd screen is one of the best features that I like. It is simple to use and very handy. The one drawback that I found is the different usb cable that came with the camera. The port on this camera is smaller than on the others. So if necessary I must purchase another like sized cable. However that aside, I like the way this camera handles.", "Date": "December 18, 2007"}, {"Title": "It was ok", "Author": "Stacy \"Stacy\"", "ReviewID": "R7WEMYLG1CKWM", "Overall": "3.0", "Content": "The quality of a majority of my pictures were bad. The camera had a hard time focusing and resulted in low quality images.The video part of the camera was good, but the pictures weren't.", "Date": "November 12, 2007"}, {"Title": "Nikon Coolpix L11 camera", "Author": "S. Carlson", "ReviewID": "R6MXWBYSP2KDO", "Overall": "5.0", "Content": "I was looking for a camera that would be not only easy but intuitive to use.  Why get a small camera if you have to carry around an instruction manual for it?  This one has a separate button to control the flash, rather than having to go through a menu.  The menu for different types of photos - portrait, night, etc., is also easy to access.  And the price was right.", "Date": "July 5, 2007"}, {"Title": "\"Broken\" LCD", "Author": "TD \"World traveller\"", "ReviewID": "RVQHBC4SJL4KP", "Overall": "1.0", "Content": "I decided to buy this camera for my daughter because of the reasonable price. I thought that we would be luckier than the people who ran into the \"Lens error\", shutter malfunction, Broken LCD... problems, but it turns out that this camera is very fragile and I made a terrible decision (for buying it and also for buying the extended warranty).I bought it new in Feb this year. In May, the shutter did not function (close half way, and did not open). I sent it to Nikon and they repair it free of charge. But then, last month, the LCD viewscreen \"broke\" even though there is no crack, no apparent physical damage, no dropping. Nikon charges $56 for repair, plus a stiff S&H; $12.50, plus tax, bringing the total to $71.86... almost the price of the new camera!I called Nikon and they said \"Our evaluation determined the screen is damaged from excessive pressure causing it to bleed. ... this damage is not the fault of the product or of manufacturing and is not covered by warranty\".Well, expensive lesson! I was warned by the many negative comments, but I did not listen! :-((Very disappointed in Nikon this time!", "Date": "August 12, 2008"}, {"Title": "EXCELLENT BUY for Pix & Price", "Author": "A Mother of Two", "ReviewID": "R3F5PZGOL24E5R", "Overall": "4.0", "Content": "I bought this Coolpix L11 last year three days before going to Florida to visit grandparents and Disney World.  Without reading the instructions, I took great pictures of the family and unforgettable videos of the kids we will cherish.  I love that this uses AA batteries instead of CR2s (grocery stores don't always have them) or \"rechargeables\" (where you have to wait hours to recharge--why bother?).  I used a SD card so I can pop it into my computer or printer to view/print--330+ pix and about 10 videos so far.  The quality of the pix is VERY GOOD, but alas it does take a second or two between shots.  If you need something faster, pay a few hundreds more.  My 5 and 2 year-olds use this to take nice pix and because of this, there is jelly or similar on the \"outside\" lens/shutter so it doesn't always open/close fully anymore (I use my thumbnail to do this sometimes).  Otherwise, I love it and will probably buy the next version(s) with similar features.", "Date": "March 31, 2008"}, {"Title": "Don't buy it!", "Author": "Hoho", "ReviewID": "R3J1UT2SZEMGBX", "Overall": "1.0", "Content": "I researched a lot of cameras for my 14 year old daughter before I decided to buy the Nikon L11.  Nikon used to be a great name in cameras but not anymore.  After just one month the camera broke with a constant \"Lens Error\" message whenever the zoom was used.  Unfortunately it is too late to return to the third party vendor (Adoramma Camera) so we are stuck with trying to send it off to Nikon to get repaired.  I knew it was an inexpensive camera when I bought it but I thought it would last more than a month. Don't buy it!", "Date": "March 30, 2008"}, {"Title": "Good value", "Author": "F. Robinson", "ReviewID": "RUJTW6ZU1IE8T", "Overall": "4.0", "Content": "Nice camera for the price.  My wife likes the way it looks.  It's easy to operate and takes good point & click photos.  Very nice for traveling for those quick photos with good qualify.", "Date": "December 28, 2007"}, {"Title": "Nice camera....Best for its price", "Author": "MD \"MD\"", "ReviewID": "R1MYJINU8WWIL6", "Overall": "4.0", "Content": "This camera is the best for its price....it works well most of the time but goes a little shaky in the dark or low light.", "Date": "December 24, 2007"}, {"Title": "Cheap camera, disappointing product from Nikon", "Author": "Eclectic fan", "ReviewID": "R3MRSBXHS5ZFY4", "Overall": "3.0", "Content": "I was looking for an expensive but quality digital snapshooter.  I had a Coolpix 2100 (2.1 megapixel) stolen during RAGBRAI.  I thought the 6 megapixel L11 would be an upgrade.  Unfortunately, I liked my 2MP better for the following reasons:*viewfinder*ability to trim video directly on the camera.  Video on the L11 records as .mov files, which cannot be trimmed on the camera OR on a PC without buying QuickTime Pro or some conversion software, but who wants to do that if you're only paying $120 for a camera?  My 2MP did a great job, albiet with poorer video quality.  I'm not planning on showing my little videos on the big screen however.*Picture quality.  The L11 flash washed everything out on inside pictures.  Really white and blue, no true colors.  I messed with the settings a bit, but again, who wants to do that on a point and shoot?  I want anybody to be able to pick this up and take a decent snapshot.  Outdoor, suny day pictures were not bright enough, even after shutting down the exposure by a couple of stops.  The 2MP took more pleasing pictures, but again, I'm not blowing them up to poster size.I ended up bringing it back to Circuit City after 4 days.  They waived the restocking fee because I asked them to (would've been $20).  I exchanged it for the Canon A550, a 7 MP camera for $10 more.  I am very pleased with that camera, and would not recommend the L11.  Sorry Nikon.", "Date": "August 13, 2007"}, {"Title": "Great camera!!!!", "Author": null, "ReviewID": "R3GZGB6IF2862A", "Overall": "5.0", "Content": "I just got this camera and it seems to be working great. Everything is working as aspected. There are some cool features like the way you hook it up to the TV and the Panarama mode. I would recomend this camera to anyone. The price is very far.", "Date": "March 28, 2007"}, {"Title": "worst camera i've ever had", "Author": "A. King \"A King\"", "ReviewID": "R2LVHEL9O6MJPU", "Overall": "1.0", "Content": "i've tried everything i can possibly think of with this thing, every setting, every position, it simply can not take a good photo. if i'm lucky, i might get one decent shot out of every 30-40 images. my 4 year old 3 mega pixel camera exceeds this one's picture quality in every way. don't waste your money here.", "Date": "June 21, 2009"}, {"Title": "Bad Bad Camera", "Author": "Mary Alexander \"Love to READ\"", "ReviewID": "R1HOBONNDNI9OO", "Overall": "1.0", "Content": "I'm sorry Nikon but I have to say this. After breaking my Canon camera that I've used for 4 years, I decided to use this Nikon thinking since it's newer and smaller it must be better. I was soooo wrong.  This thing is junk. It takes forever to take a picture and get ready for the next one which makes it look like you are clueless about how to take a picture. The pictures are terrible. The colors never match what real life colors I'm taking a picture of.  The flash is late, so in darker situations, sometimes it's like I didn't even use a flash and I have to try again which takes forever. It kills batteries very quickly. You can get a much better camera for the same price or less. If you actually like this camera you will be amazed at how much better digital photos can be when you get another one. I suggest Cannon or even Kodak.***I really wish I would have done more research before I bought this camera. It produces pictures I'm almost embarrased to show because I'm sure people think I have no clue how to take a simple picture. I also end up deleting (for dumb lighting, color or blur issues) what could have really good pictures.", "Date": "January 2, 2009"}, {"Title": "Poor Quality and Warranty Support", "Author": "Mgman", "ReviewID": "RCOI0BWCDOOJ9", "Overall": "1.0", "Content": "Have owned unit for one year.  Repaired once under warranty and it is broken again.  Same lens problem that everyone has.  Now it has to go to the landfill along with the other \"Made in China\" junk.", "Date": "December 18, 2008"}, {"Title": "Do Not Buy This Camera", "Author": "C. Huber", "ReviewID": "R2HCLLNOAWWTKY", "Overall": "1.0", "Content": "PLEASE just pick another camera and do yourself a favor! If you look around you will find 100s of dissatisfied owners with broken Nikon Coolpix lenses. It is a major flaw and Nikon will not do anything to help repair.", "Date": "December 12, 2008"}, {"Title": "Image Stability Issues", "Author": "Daniel Poor", "ReviewID": "R1LMTZNNH80KZ2", "Overall": "1.0", "Content": "Nice form factor, low price, but the painfully long latency from shutter click to actual snap of the photo means that most of my photos are blurry.  I have had a series of Canon's that have just as many features and not this latency issue.  After getting back home and seeing most of my trip photos blurry (imperceptible on the LCD viewer, but painfully obvious on the desktop monitor), I put this thing on the shelf and went shopping for another.  In the scheme of things, I would rather pay $50 more and know my photos will be usable.I am extremely disappointed in this product.  I expect more from Nikon.", "Date": "May 26, 2008"}, {"Title": "Nice Camera.", "Author": "Janaki R. Naralasetti \"Janaki Ram\"", "ReviewID": "R3T39KNFOHZGG3", "Overall": "5.0", "Content": "This is very good camera for the price you pay. I have bought 3 cameras and gifted to my friends as well. It has the memeory card slot seperately and makes it easy while coping. I need not open the batteries slot while removing it. Goood quality photos. Video is not so good. I would suggest my friends to use for Still Photos.", "Date": "April 20, 2008"}, {"Title": "My favorite camera ever!", "Author": "M. Sivo \"Honest $$ Big Spending $$  Mom of Two\"", "ReviewID": "R253XYU0M6G7GS", "Overall": "5.0", "Content": "I have owned many cameras throughout my day.  I volunteer my services taking photos for people.  I ended up buying this camera because it was on sale for an outstanidng price.  After the first day I was in love with it.  A few months later my son grabbed it and threw it (very hard might I add) and in that freak accident the lens got a lil' bent.  I was devestated and though have been looking at several other cameras (since my local stores have been out-of-stock).  Today I decided that I was just going online and buying a new one....END OF STORY!!!  That's what I am on here doing now.  Sure it eats batteries...but what digital camera doesn't?  I have found I average 300 high quality-enhanced deatil photos per set of batteries (high quality...not cheap store brand).  For professional use....I find it a fair trade off.  I have taken numerous shots that were so incredible you would never believe it came from a $100 camera.  If going through the batteries is such a concern.....then there is always the option of buying rechagrables.  This little camera  is worth the money and then some!!!!!", "Date": "April 8, 2008"}, {"Title": "Great Camera for the price ...", "Author": "K. Downs", "ReviewID": "R1AFPOO3VFPWE9", "Overall": "5.0", "Content": "I bought this camera as a gift for my young grandson ... after reading all the awful reviews of kid's cameras ranging in price from $50 to $100  (with point-3 megapixels!???) I decided I would rather get him a real camera.  This Nikon at $87 and 6 megapixels turned out to be an excellent choice.  We added a screen protector and a lanyard to hang the camera around his neck for safety.  He loves it, as does his younger brother.  He takes stills that his Mom uploads to iPhoto for him, and he takes movies that the family can watch on the TV or the computer. And it is small enough for Mom to carry in her purse when he tires of taking pictures .. and then she uses it to take pics of the kids playing, and is more than satisfied with the result.  The family has a bigger, newer, better camera for indoor use and special occasions, but loves having this little one handy when they are out and about.  There may be better cameras out there that take more technically perfect pictures, but this camera, and its price, were a perfect choice for our purpose.", "Date": "March 24, 2008"}, {"Title": "Love My Coolpix!!!", "Author": "Adrienne Aiken \"kid\"", "ReviewID": "R2XW9JJ5NTK7UD", "Overall": "5.0", "Content": "Love this camera. It is super easy to use and very compact.  Fits in the palm of your hand and it takes great pictures.  I am legally blind and it has not been a problem for me to use.", "Date": "January 17, 2008"}, {"Title": "Pretty Good!", "Author": "D. Anderson", "ReviewID": "R3DDMS6CI3NKYS", "Overall": "4.0", "Content": "This is a pretty good camera.... very easy to use, small and easy to handle.  Nice picture quality, but zoom feature isn't great.  I would certainly recommend this camera for the price!", "Date": "December 28, 2007"}, {"Title": "A great camera for under a hundred!", "Author": "Packratt \"Pack\"", "ReviewID": "R1ZD2NUX1X2MBC", "Overall": "5.0", "Content": "For under a hundred bucks this camera is one of the finest out there! The features on it are outstanding,the quality and detail of the photo's are amazing. I'd recommend this to anyone in the market for a well priced camera!", "Date": "December 26, 2007"}, {"Title": "Jury Out, June 2007", "Author": "Michael D. Mcgough \"MDM\"", "ReviewID": "R2HEFMR5C1D928", "Overall": "3.0", "Content": "I bought first unit at Meglomart.  I also got the lense error.  Took back same day and made the exchange.  Second unit has performed well so far.  I have not used a great deal though.  Made this purchase based upon brand name and price.  The lense error issue is a repeating item in the reviews.  If I owned stock in this company I might be selling.", "Date": "July 4, 2007"}, {"Title": "disappointment", "Author": "I. Fanshaw \"it's not me\"", "ReviewID": "R1M2RQDTGPUH7N", "Overall": "2.0", "Content": "Worked fine for a while less than a year later, it doesn't focus well anymore.I'm looking for a new one.", "Date": "December 2, 2007"}, {"Title": "Chews batteries like crazy", "Author": "Danny Smith", "ReviewID": "R1Z7MCYN23DJ1P", "Overall": "3.0", "Content": "I bought a brand new pack of four batteries, and I think I was able to take 10 pictures total between the four batteries.  The picture quality is good but it takes for ever to load between pictures.", "Date": "August 23, 2007"}, {"Title": "Exactly what I was looking for", "Author": "Maone", "ReviewID": "R287SIJPD3IACP", "Overall": "5.0", "Content": "I had this same exact camera only in black.  I lost it and wanted to replace it with one of the same model.  I looked at the newer Coolpix cameras and didn't like the feel of them.  I was very happy to find this one \"used\".  It's just like new... nothing at all wrong with it, and half the price my old one was several years ago.  Very satisfied with my purchase.", "Date": "December 21, 2013"}, {"Title": "Perfect pocket camera", "Author": "K. M. Hicken", "ReviewID": "R3OSTE5WA3G5HQ", "Overall": "4.0", "Content": "I just had to leave a review of these fine little cameras after reading so many of the negative reviews. Cameras are precision instruments and if treated indifferently, will break. Quality control is an issue for many brands with budget cameras lines. I have many Nikon cameras dating back to the '99 Coolpix 950,2mp.($800)and all have had quirks and problems, but all still work and still take very good photos. I have 3 of these L models, a L10 and 2 L11's. All have been used extensively and taken hundreds if not thousands of photos. The L11's are an amazing little camera with excellent photo quality at this price point. Mine show much handling wear but have been kept clean and treated gently. Thrown in a jacket pocket without a case will invite debris to get into the zoom mechanism and then the inevitable \"lens error\". If lens is accidently extended in an enclosed space, will get you the same results. Any camera without image stabilization if not held steady will get blurry pictures no matter the cost. Any camera dropped on the extended lens will break it. Period. These cameras shoot fairly fast with a Class 6 SDHC, have a continuous shot mode that's even faster, do fairly well in low light and have very good battery life.  I use Eneloop rechargables and never use alkalines in any of my cameras. Exposure is nearly always right on and has exposure compensation just in case. Has white balance presets that work well in most situations and a custom white balance preset for difficult lighting. Has the usual many scene presents including face recognition and panoramic stitch, extras at this price point. Auto ISO keeps it simple and I expected noisy pics with higher ISO in low light, common to most all small sensors, except maybe some Fuji's. The flash is just so so and has limited range though does cover the usual presets. A cheap $10 slave flash took care of that. The video is actually not bad, as I keep reminding, at this price point. Like most all digtals, high lights will be blown out but this L11 had acceptable dynamic range. There is some CA, (purple fringing) but wasn't too bad and won't be noticeable in smaller prints. Nikons digitals have always had BSS, a wonderful feature and I use it a lot to get sharper photos in dim or difficult shooting situations. Takes a series of shots and picks the sharpest one. The macro is unbelievably good like most Nikons but is limited to about 5.6 inches. I've printed 8.5 x 11's that people thought were taken with one of my expensive cameras.(I have about 2 dozen cameras) They're amazed when I pull this little beaten P&S; out of my pocket and say it was taken with this. I suspect the bad reviews come from people that know little about cameras or photography and treat the camera like a throw away. \"Lemons\" do show up in almost all Chinese made budget cameras so that covers the rest. The \"professional\" reviews rate the Nikon L11 fairly high for a budget P&S; camera, read those. Newer, more mp's, more $$$, cameras, I'm sure are better but more megapixels on small sensors don't always work that well. This camera is for snap shots not art. I'm not a Nikon nut, my favorite cameras are Canons and Fuji's. I use Nikons for macro and in microscopes. I've several different brands of small, carry around P&S;'s and this L11 is better than most at this price point, for image quality, ease of use, compactness, AA's and so far, durability. The lack of manual controls can be frustrating at times, but hey, this is just a cheap point and shoot. I've been an avid amateur photographer for over 40 years.", "Date": "March 29, 2013"}, {"Title": "As advertise", "Author": "doug trudeau", "ReviewID": "R1U3OYDSQ1AUQ7", "Overall": "5.0", "Content": "The perfect point and shoot camera that can do so much more if you were so inclined couldn't be happier.", "Date": "March 5, 2013"}, {"Title": "inoperable after less that 1 year", "Author": "2manybooks \"SallyJo\"", "ReviewID": "RRYGKFF681CJ6", "Overall": "1.0", "Content": "My daughter bought me this camera, and initially I LOVED it. It is nice and compact, and fairly user-friendly.  Unfortunately, it lasted less than a year, and Nikon does not, it appears, stand behind their products - there was no offer to replace it, or fix it for free.  Despite the fact that the Coolpix cameras are compact and cute, I would be afraid to own another Nikon product. What it does it shut itself off IMMEDIATELY after turning on.  Before that, it did some other weird things, but basically wouldn't take any pictures, especially when there was plenty of light. I just today got it back out to check if it might want to work. Have been using a Canon that she subsequently bought me, and it's held up for 3-4 years.", "Date": "March 3, 2013"}, {"Title": "A, while it lasted", "Author": "Johnny Perez", "ReviewID": "RY6NPEAY5XP0U", "Overall": "2.0", "Content": "Nice prize and quality.The pictures it took we're excellent, and the videos too.Why I rate it so low? Before the second year with it, the screen stopped functioning one day. No known reason.", "Date": "February 6, 2013"}, {"Title": "Used many Coolpix L11s for at least 5 years", "Author": "Gordon Shevis", "ReviewID": "R1U8Y3UZIWPO3F", "Overall": "5.0", "Content": "I have had about 4 or 5 Coolpix L11 cameras...going back about 5 years.  I dropped one on a casino floor; one was stolen; I bought one for my wife; and I gave one to a friend.  So the one I just bought makes 5.  And it is new.....so it works just fine.It has a lot of features.  You can easily make setting adjustments so that you can get good photos.  The batteries are easy to replace.  You can easily connect it to a TV to look at photos you've taken.  Or if you want to download and save or edit photos, it is easy to remove the memory card and transfer photos to your PC.You could easily spend a lot more money on a camera....but I don't think you'd get your \"money's worth\" as you will with the Coolpix L11.", "Date": "February 4, 2013"}, {"Title": "A starter pocket camera,", "Author": "Jaime Nunez", "ReviewID": "R3JN1JL4QXLMV5", "Overall": "3.0", "Content": "Ok I got this camera as a gift 4 years ago(it had been used for a year before I got it). It was free I did not pay a dime so I must say I got a pretty good deal. It does have a lot of features for a pocket camera. It does take good pictures in good light conditions. It is fairly easy to use. Its well built, my wife already managed to break to other cameras a sony and a samsung within a year and my Nikon still going strong. She has to borrow mine from time to time. I will use and keep this camera as long as it lasts. It has been to different parties, vacations and it has been on many hands and I have taken thousands of pictures with it. But it has some things I don't like it does take long for it to actually take the picture after you press the button. It does eat batteries pretty fast I got some duracell rechargables and problem solved. And the flash only works well a couple of feet away. I know Nikon makes excellent products at higher price range but for snap and shoot camera this one does the trick. Now that the holidays are coming up the wife will be getting a Nikon coolpix L810 for her birthday in a couple of days. These camera will get a review and will see how long it lasts on the wife's hands the true test.", "Date": "November 29, 2012"}, {"Title": "Good camera for the price!", "Author": "Alex", "ReviewID": "R2CNWBNT5BSJSG", "Overall": "5.0", "Content": "This is the second one of these iv'e bought. It's a great simple little camera that gets the job done! It runs on AA batteries so the battery life isn't that great but it isn't bad either. There very few buttons to mess with and it is simple and straight forward.", "Date": "October 24, 2011"}, {"Title": "Nikon Coolpix L11", "Author": "Jack Overath \"USCG (Ret.)\"", "ReviewID": "R3BS28QTSZ4FSB", "Overall": "5.0", "Content": "This was an exact replacement camera for one that my 2-year old grandson accidentally dropped.  It works fine and the price was right! Came with both a printed manual and CD.", "Date": "September 20, 2011"}, {"Title": "Loving it from couple of years", "Author": "Amit", "ReviewID": "RRYS9PD4RTOU4", "Overall": "4.0", "Content": "It's been gifted by somebody couple of years back. And I am using it since then. It's really good camera in the given cost and picture/video quality is also wonderful!It's not that great in the dark but overall it's worth at such a low cost.", "Date": "September 15, 2011"}, {"Title": "Okay Picture, Horrible Video Recording", "Author": "Hao Zhang", "ReviewID": "RC3GRO503485", "Overall": "2.0", "Content": "When I first got this camera, I was excited. A few months after I got it, I started to feel as if this camera was not worth the money. Why? Well, I wanted a cheap camera for video recording and some photo shooting. The pictures it take are fine, but the video... When I upload them to YouTube, they come out as 240p... And the sound? What, is there like a mini-fan near the microphone in the camera? All I can hear is a bunch of weird blowing noises... Here's an example video: [...]", "Date": "May 10, 2011"}, {"Title": "So many reviews about good picture quality, I think not...", "Author": "Seung H. Kim \"Susie\"", "ReviewID": "R9KI3YI2HN863", "Overall": "2.0", "Content": "Ever since I bought this camera 3 years ago, it has let me down over and over again.The good:- It hasn't broken down on me yet.- I like the indoor/party featureThe bad:PICTURE QUALITY!!!- Sloooooow shutter speed even in broad daylight that results in blurry/shaky pictures SO EASILY. This irritates me so much, sometimes I just want to smash it... Wouldn't you be frustrated if you're trying to take some fun pics with your friends and your camera just keeps on failing you? Really ruins the atmosphere and your temper.- Lots of noise, both in daylight and indoors (How come it's noisy and blurry/shaky at the same time?!)- Close-ups suck. Forget about taking a picture closer than 3 inches away from the subject.- Also eats up battery like crazy. Next time I'm buying a camera with rechargeable batteries.I wish I had done more research and spent my money on a better camera. Maybe it was bad luck and I got a defective model, but I doubt it.The old Canon A60 that I had owned was heads and shoulders above this one. (Except for even worse battery consumption)", "Date": "March 14, 2011"}, {"Title": "Average quality", "Author": "Mwindaji \"5th grade mom\"", "ReviewID": "R1CJ4HOUI34LBA", "Overall": "1.0", "Content": "I have tried two different Nikon Coolpix products---neither were as easy to use or took as good of pictures as the Casio.  Shame on me for changing from a product I knew works great to one that someone else liked better...", "Date": "November 12, 2010"}, {"Title": "Meh. Good enough.", "Author": "jc", "ReviewID": "R1KVRRODTXQ6GR", "Overall": "4.0", "Content": "This is my third L-11. They seem to last about a year until the LCD on the back cracks/breaks. If I don't get more than a year out of this last particular specimen, I may finally be forced to buy something a little up-market and, hopefully, more durable.Other than the durability, its a good, cheap, point-and-shooter.In contrast, the analog Nikon FG I bought in 1983 is still going strong, but I like digital because I dislike the expense and clutter of negatives/prints.", "Date": "July 24, 2010"}, {"Title": "Lemon Alert!", "Author": "humanum777", "ReviewID": "RT8232BAAE33W", "Overall": "1.0", "Content": "This camera is short lived. Broke down within a couple of months of purchase, and then lasted for just two years. Why Nikon would create a lemon and besmirch its own name is beyond me.", "Date": "December 31, 2009"}, {"Title": "Takes Blurry Pictures!", "Author": "C. Hargett \"picture taker\"", "ReviewID": "R3NK5XUTZRHYBK", "Overall": "1.0", "Content": "The camera is fine except for the fact that it takes blurry pictures when up close!!!  What is the point of a camera that takes blurry pictures!  I would not buy this camera.", "Date": "December 2, 2009"}, {"Title": "lousy pictures, beware", "Author": "John Nicolazzo", "ReviewID": "RA6SPQUWKY0TA", "Overall": "2.0", "Content": "I just got rid of my fujifilm E-510 in hopes that this nikon L-11 would take better macro close ups. Man was i wrong. my fuji was only 5.0 megapixels compared to the nikons 6.0, but the pictures were a lot more clear and crisp. Taking the same close ups i used my fuji for the pictures from the nikon were blurry and no matter how i tried to adjust settings on this camera the pictures were blurry and the auto focus function was very slow. This camera is in my opinion a piece of JUNK!! now i have to throw this thing away and buy a good camera. I hope this helps.", "Date": "September 30, 2009"}, {"Title": "Cheap and nasty", "Author": "P. Clay", "ReviewID": "R36Z06UQXEMI3P", "Overall": "1.0", "Content": "This camera is simply built cheaply.  Our previous Nikon lasted for several years.  This one lasted for several months.  Stupid stuff like the clip for the battery breaking.  No clip, no batteries.It will not be replaced with another Nikon.", "Date": "September 28, 2009"}, {"Title": "A great little travel camera", "Author": "shutterbug42", "ReviewID": "RQDNKB5BDTN6D", "Overall": "4.0", "Content": "This is a excellent little travel camera. It's picture and video quality isn't as good as my Panasonic TZ1, but it's not bad at all. (The Panny is also a lot larger and more expensive, so no surprises here.) If you're careful, you'll get very good results.The good: It runs on AA batteries and is so compact and easy to use. It's well engineered and intuitive.The bad: The flash takes a little long to charge, and I'm sure there are small cameras that take better pics and movies, but this camera certainly gets the job done just fine.", "Date": "April 6, 2009"}, {"Title": "Broke twice in one year = Lemon", "Author": "Casu Marzu", "ReviewID": "RY4WMJ00DUL8O", "Overall": "1.0", "Content": "I received a Nikon L11 for Christmas 2007.Woo! I was psyched!Within a month the camera developed a problem: It would no longer take pictures, allow me to delete pictures, or power-down when the on/off button was tapped.Grrr....The camera sat in my desk.Finally, around November, I contacted Nikon and sent the camera in for repair. They returned it to me in a couple of weeks and the few test pictures I took indicated that it was again working.Today, after taking six pictures on the repaired camera, it again froze after taking two pictures.I've contacted Nikon for advice as what to do with this now out-of-warranty camera.If you need a paperweight, this is the camera for you.", "Date": "February 8, 2009"}, {"Title": "Not the best, Not the worst", "Author": "Jessica Lim \"Jessica\"", "ReviewID": "R5DHGFSCS2C5Q", "Overall": "3.0", "Content": "I have owned this camera for 10 months.  I have found the following to be true.1)this camera does not have the greatest speed. After you take a picture it can take five seconds to see it.  I have discovered a way to get around it. If you press the review button right after you take a picture, it won't take as long.2) the screen isn't very large, but it is still a nice size for viewing.3)there are not as many features as there are on canons like video editing and cool color effects (and many others.)4) the volume isn't very loud, so if you are in a place where anyone is talking, and you try to view a video, you won't be able to hear it even on the loudest.  Canons on the other hand, go very loud.5)the picture you see on the screen is not as clear as Canons but is still very tolerable.6)the AA rechargable batteries that I use (duracell) last a very long time.7) The compartment that holds the batteries is kind of lose, but it hasn't been causing me too many problems, really.8) the picture come out nice.9) It is very easy to use, without having to read the manual, unlike other cameras like canon (probably because canons have a lot more features.)10)I did not mistreat this camera, I always kept it in my case, and my LCD is cracked.  I sent it to Nikon and they said it will cost me over 70 dollars to repair and I only spent 85.  They said the reason it isn't covered is because accidents aren't covered, but I didn't do anything to cause it to happen.  So I don't know if this is a common problem, but I am nervous that maybe they break easily. I just don't know.Overall while it worked, I found it to be an average good camera, that didn't match up to canons, but was still very good.", "Date": "January 21, 2009"}, {"Title": "Great Buy for the money", "Author": "S. Hargis", "ReviewID": "R1W0OROFTF5YBP", "Overall": "4.0", "Content": "This camera takes great pictures and shoots video far better than I would expect for a digital camera.  The audio on the video is very good for this platform.  I have taken over 200 pictures using the original set of alkaline batteries that I put in the camera.  The view screen on the back is very big and very clear and the controls are much easier as far as changing modes or deleting compared to other digital cameras I have owned.", "Date": "January 6, 2009"}, {"Title": "Poor image quality, slow", "Author": "Eric Means", "ReviewID": "R25DHL9CYTPQZG", "Overall": "2.0", "Content": "I wish I'd done more research before buying this camera; I would advise anyone to buy a different camera. The picture quality is extremely disappointing, even on highest settings--and I'm comparing to the 2MP Kodak EasyShare that it replaced.Aside from the ease of taking quick videos with this camera -- which any of its competitors will do just as easily -- we never use this camera anymore. Between the lack of image quality, even in well-lit surroundings, and the rather incredible amount of time it takes to be ready to take the next picture (not even using flash), the camera is just not as good as many of its competitors in the same price range, and nowhere near other cameras that are even slightly more expensive.On the upside, I like the color of the camera itself; you don't see many brown personal electronics.", "Date": "December 12, 2008"}, {"Title": "Better Price and Product Than Competitors", "Author": "Natalie Kilpatrick", "ReviewID": "R18C4EUDYOX4F5", "Overall": "4.0", "Content": "I have not run into the same problems with this camera as I have with other brands.  Although the color in the pictures is a bit dull, it still focuses extremely well, including in underlit areas.  The image is constantly adjusting to get the best shot possible, so that's a plus.The coolest feature so far is the Panoramic Assist.  Using this feature, you take your first photo, then move the image to the right and you can see a ghost of the previous image showing up to the left, helping you determine where to line up your next shot.  It's pretty neat.There are multiple modes on this camera along with Panoramic Assist, such as Face-priority AF, Portrait, Landscape, Sports, Night Portrait, Party/indoor, Beach/snow, Sunset, Dusk/dawn, Night landscape, Close up (Macro), Museum and Fireworks show.The zoom isn't spectacular, only a 3x, equivalent to 18.6mm.  The digital zoom is a joke, as it is with all digital cameras.  Please don't use this feature on *any* camera!Deleting images is a snap!  Take a picture, don't like it?  You don't need to go into the preview mode.  Simply click on the trash can button twice and scroll down to Yes and you're done.  Need to go back to shoot?  Hold the shutter button down halfway and you're back to where you were before.The Nikon L11 also allows for video and, in my opinion, does a pretty good job of it.  You have the option of 160, 320 or 640.  Definitely nothing to produce a movie with, LOL.In preview mode, if you use the zoom in button, it will zoom into the photo you are previewing (obviously), however, if you click on Menu, your photo will be cropped to that size that you are currently viewing.  A pretty neat feature.  Up, down, left and right can be used interchangably, as down and right are the same (going up in numbers), left and up go down in numbers.The maximum off time is 30 minutes, which makes it ideal for uploading photos from your Eye-Fi.  You can also turn sleep mode off.  I have never had any issues with this camera uploading with the Eye-Fi.I wouldn't highly recommend this little one, but it's recommended, nonetheless.  I will say that this camera is much better than some competitors that are price $100-$200 more.", "Date": "September 24, 2008"}, {"Title": "Nikon Review", "Author": "M. Dubiel", "ReviewID": "RXLMFGTKAD9NU", "Overall": "5.0", "Content": "The item was in a great condition, just as promised.  Arrived at the stated date.", "Date": "August 27, 2008"}, {"Title": "Spend a little more on a Canon", "Author": "J. James", "ReviewID": "R1OYE9WVRGR366", "Overall": "2.0", "Content": "Bought this for around $80 on amazon, new.  It is just that, an $80 camera.  Has a hard time focusing and blurs a lot.  I get an error message saying picture is blurry even when it is not.  Small, compact, yes.  Worth $80, maybe.  Frustrating...", "Date": "July 1, 2008"}, {"Title": "Lasted One Day", "Author": "Dick \"Mountain Rescue Guy\"", "ReviewID": "R2MO5FA0R4OTQD", "Overall": "1.0", "Content": "I suspect this in not typical but the camera I ordered worked fine on day one but on day two it would no longer turn on.  I replaced it with a different model of Nikon camera - only because this model was no longer available.", "Date": "May 27, 2008"}, {"Title": "point and shoot", "Author": "smith carpentry \"Quality tool freak!\"", "ReviewID": "RZ7EY2GNR3YCU", "Overall": "5.0", "Content": "After a lot of research(many amazon opinions too!) I made my choice on a low-end point and shoot camera. I didnt want to get carried away for a disposable camera. Now that might be harsh, but I really planned on using this camera to its breaking point! After piles of batteries( finally, I got some Sony quick recharge ) batteries for this gem.  I found out that a newer version of this camera has a inferior processor in comparison to the older one, so I searched and found a older(by 6 months!) model and bought it. It has 1 megapixel less, but this is made up with the superior processor. This point and shoot camera is a great buy in all departments. I got a black one. The only 2 things you could offer as a complaint is it's a little tough on batteries, and it's low light shooting. But hey, I like the whole battery thing. If they die, you swap them out, no waiting around to recharge.I know, have a extra in any situation(on board or not). $85.00 &$22.00 for a snug-it. What a combo.I don't know if anybody has noticed SD cards for less than$3.00!!The beauty of this get-up is that it's with me 24/7. Think I miss anything?", "Date": "May 20, 2008"}, {"Title": "Good in Light, Bad in dark", "Author": "Reader", "ReviewID": "R2LPO6QTD1RJXQ", "Overall": "4.0", "Content": "This camera takes WONDERFUL pictures in the daytime or in lighted areas. But this camera is NOT good in dark areas such as dances, proms, and nighttime pictures. I myself like to take pictures in areas that are sometimes not well lite such as school dances. But the camera makes the pictures appear blurry and fuzzy. Two features I do like about this camera are the D-lighting and the cropping feature. The D-lighting feature allows you to lighten up dark pictures and the crop feature allows you to zoom in and crop pictures. Both of these features can be done right there on the camera immediately after you take the picture.So if you are only going to use this camera in the day or well lite areas this is the camera for you, especially if you are on a budget. But if you often take pictures in dark areas I recommend that you don't get this camera.", "Date": "May 8, 2008"}, {"Title": "Very happy so far.", "Author": "J. Schwab \"Twins fan\"", "ReviewID": "R35XOZ4IM10EEP", "Overall": "4.0", "Content": "I bought the camera on a recommendation and have been very happy so far. I took it on a trip to Europe and was pleased with its small size and ease of use. Seems like a good \"entry level\" camera. I didn't give it five stars because it seems that rating should be reserved for cameras with more features, etc. Still - I'm not aware of any flaws so far.", "Date": "April 28, 2008"}, {"Title": "Great camera", "Author": "M. Mixco \"First time owner\"", "ReviewID": "RD1M7NCM4WY5N", "Overall": "5.0", "Content": "I think the size is very light and small enough for great pictures. I like the features and pictures look great!", "Date": "April 12, 2008"}, {"Title": "Good choice", "Author": "Alex-it \"Alex\"", "ReviewID": "R20JX8NCVJZ9UR", "Overall": "3.0", "Content": "That's the camera I wanted for my wife and daughter: great brad and low price.", "Date": "April 8, 2008"}, {"Title": "cheap and slow, but again, cheap.", "Author": "Mustafa Ilker Ozdem", "ReviewID": "R2TIFEHUQ0PD5K", "Overall": "4.0", "Content": "If you want a rapid machine, donot buy this one. If you want a cheap camera, this one is what you should consider seriously.", "Date": "March 18, 2008"}, {"Title": "Sharpness is Disappointing", "Author": "Kent \"The Forestmeister\"", "ReviewID": "R2XFOLF5ZTZS1Y", "Overall": "3.0", "Content": "A number of reviews have been submitted outlining the many features packed into this small camera.  I will not dwell on a repeat of the various features.The price at $92.00, including postage from an Amazon Marketplace seller, was excellent.  After a time with the manual, the various features are fairly straight forward.The biggest disappointment is that even with 6 megapixels, the sharpness of the pictures are sadly lacking when compared to those of my Olympus D-400 1.3 megapixel camera that I have had for several years.  That is true in side-by-side tests both indoors and outdoors.  I have no idea why - but there it is!The other negative is that lacking a viewfinder, the LCD screen view is impossible to be seen in bright outdoor light with my eyes, though my wife states she can see the view.  Again, the Olympus has a viewfinder with optical adjustment for eye quality, so a sharp view is always there - in any light.In summary, with it's many features (including \"movie mode\", it is worth the $92.00 it cost and would best serve as a handy to store little camera easily available for the amateur photographer caring more about size, weight, and ease of use than the final sharpness of the picture.  It just does not fill the bill as a camera taking professional or semi-professional quality pictures, but at the price - that may be asking too much!", "Date": "March 17, 2008"}, {"Title": "seemed good. didn't last even 6 months", "Author": "Ellie \"Elliemae\"", "ReviewID": "R1LIWSO05RPHKE", "Overall": "2.0", "Content": "I bought this as a Christmas gift for my son. So, it's only 3 months old. He has his own process serving business. Thought this would be great due to size as people get a bit irate when he comes to their door with posting and camera in hand. This he could conceal in his pocket until he got back out to the street to get the picture. I'm very disappointed. I have a 3.2 megapixel that takes better pics than this 6 mp. Especially at night. Very grainy. Also darkens the shot considerably at night. 6:00pm looks like 10:00pm. Not wanting to hurt my feelings he didn't tell me that he'd had so many problems until last week when he received a post that was a rush order. His flash burned out. He didn't get the shot. He had to go buy another camera and go back out to the house. People pretty upset he was back to take another picture. I've never been so disappointed in a purchase. After people's reviews around Christmas time I thought this was a good camera. Just junk. Maybe for a 5 year old to play with. Don't buy.", "Date": "March 15, 2008"}, {"Title": "A gift for my parents", "Author": "NR Tech \"here i am\"", "ReviewID": "RFS793TFK13BD", "Overall": "4.0", "Content": "I took a couple of pics with camera before sending this off to Nepal for my parents and it's a good camera. No complaints, none whatsoever.Price per unit value is awesome!", "Date": "March 7, 2008"}, {"Title": "Coolpix L11", "Author": "John W. Rippetoe Jr.", "ReviewID": "RZ450PUXGW74Z", "Overall": "5.0", "Content": "a fine camera, easy to use and with easy to follow instructions, a pleasure from the moment of its arrival, and the vendor/shipper was true to its promise of delivery.fine job all around.thanksjohn w. rippetoe jr.", "Date": "March 3, 2008"}, {"Title": "Excellent choice for beginners", "Author": "Guillermo Ruiz Arevalo", "ReviewID": "RF6XEEXISTSNX", "Overall": "4.0", "Content": "I bought this camera replacing my old and loyal Kodak EasyShare CX4200 and I'm not repent of it. This little camera takes vivid images on daylight and nice takes at night. If, like me, you have bad pulse you'll probably need a tripod for night shots 'cause normally this kind of pictures appears blurred.This camera has two 'cons': it has no optical viewfinder, so it's mandatory to use the LCD screen; bad idea for some people, not a problem for me, yet. And, sometimes night images could appear a bit noisy, it has ISO 800 sensitivity but a little lens; so, flash may be necessary.In my opinion, this camera is a good choice for those who are beginners in photography, perfect buy for a first camera.", "Date": "February 24, 2008"}, {"Title": "A good camera", "Author": "Nigel Richardson \"Big Daddy Buff\"", "ReviewID": "R14HG6BPRPJN8H", "Overall": "4.0", "Content": "I bought this camera for my niece and I have not regretted the purchase.I would recommend for anyone who want a camera for amateur use.I purchased a 2GB card for it at the same time.It would be a good idea to buy a rechargeable battery set because you would be using a lot of batteries once you get started.Nigel", "Date": "February 13, 2008"}, {"Title": "Good but not great", "Author": "A. Luce", "ReviewID": "R12IT5EQJ96IGO", "Overall": "3.0", "Content": "This is our first digital camera. It's very small and lightweight. It's not a bad camera for the price but it has a few drawbacks, the first of which is the very brief time the viewfinder stays on/lit for you to frame a picture. It's a matter of seconds before it goes dark and you have to hit the shutter button half way to get it to come back on. So if I'm trying to get a picture of a bird in my back yard and am waiting for the right moment, it might go dark on me at that moment.The second problem is the VERY slow shutter speed. Don't expect to take any action shots, even on that mode. There is such a delay between the time you depress the shutter and the time it takes the picture that you have a very different picture if anyone or thing is moving at all.It also takes a while to warm back up until it's ready to take the next picture. So no rapid-fire picture taking is possible, even remotely.The quality of picture is good, although when I compare my pics to other people's from their cameras, they're not as sharp.The zoom is pretty good. You can zoom closer than is recommended, and even though your picture will look blurry in the window, it will come out sharper once you've taken the picture and review it. So that's a plus.So I am still using it and enjoy it but will definitely not buy it again.", "Date": "February 12, 2008"}, {"Title": "Great Camera!", "Author": "Andrew D. Degolyer \"D-train\"", "ReviewID": "R1FYXFZN6IJSLM", "Overall": "5.0", "Content": "The camera works great, I have no complaints.  Easy to use and takes beautiful pictures.", "Date": "January 28, 2008"}, {"Title": "cute little camera", "Author": "E. Robertson \"mzelli1\"", "ReviewID": "R3AUM6IMVXMTG8", "Overall": "4.0", "Content": "cute little camera!  i got it as a gift for a friend and she flipped.  it came within the time quoted.  so far, so good!!!", "Date": "January 21, 2008"}, {"Title": "great camera, great price", "Author": "Jill Reilly \"Jill\"", "ReviewID": "R2M1MFDAY53JEQ", "Overall": "5.0", "Content": "We really wanted to spend under $100, but had certain options we were unwilling to compromise on.  We really feel the Coolpix L11 had everything we wanted.", "Date": "January 14, 2008"}, {"Title": "Don't buy if you need good audio", "Author": "katinga", "ReviewID": "RLTG1RX7FLWLL", "Overall": "3.0", "Content": "I thought when I bought this that at last I would be able to record with sound. Unfortunately, there is a significant and off-putting mechanical clicking sound going on in the background like crickets going singing in the background.In fact, if you listen closely to the camera in still mode, you can hear the sound.This happens both in video mode and in audio record-only mode.There is no video-only mode, so you have to use conversion software to delete the audio.So if you just need a camera that takes stills, well, it works fine, has an easy to learn interface, and is parsimonious with batteries. For video + audio? Well, you get what you pay for. It works, but leaves something to be desired.", "Date": "January 11, 2008"}, {"Title": "Great little camera!", "Author": "Princess \"Busy Mom\"", "ReviewID": "R1IMU3DDC01AQ7", "Overall": "5.0", "Content": "We bought two of these cameras for our kids, and are very impressed with them. Our kids are still young, so we wanted something that was high quality and easy to use. This camera also takes video clips, with amazing clarity and sound quality. Pictures are very sharp as well. The view screen is nice and large. Obviously this camera is not the top of the line, but for the price, it is an excellent value- very impressive! We are pleased with the product overall!", "Date": "January 8, 2008"}, {"Title": "Nikon Coolpix", "Author": "Jermaine Williams", "ReviewID": "RITMGZ0FHEJQE", "Overall": "4.0", "Content": "I purchased this camera as a Christmas gift for my girlfriend, and it is definetly worth the money I spent on it. Its a nice dependable camera, though I wouldn't suggest it for any professional photographers. Its great for general picture taking.  Jermaine Williams  Chicago, Illinois", "Date": "January 7, 2008"}, {"Title": "Good Camera for our use.", "Author": "J. S. \"J. S.\"", "ReviewID": "R2APA7UMDPX3QT", "Overall": "4.0", "Content": "We purchased this camera as a Christmas gift for our 16 year old daughter who mainly uses digital images to upload to the web.  So it is great for her use.  When we received it we found out that is had a defect -- Amazon sent a new one out immediately and we returned the defected one. So we are very happy with Amazon and the product.", "Date": "January 6, 2008"}, {"Title": "No Complaints", "Author": "G. inman", "ReviewID": "R2MOHHK0377CDB", "Overall": "4.0", "Content": "So far, no problems.  Very user friendly.  I bought it for my daughter and I would rather use it than mine.", "Date": "January 3, 2008"}, {"Title": "Nikon L11 camera", "Author": "M. Henshaw \"M. Henshaw\"", "ReviewID": "R1B9JIAKEYMHON", "Overall": "4.0", "Content": "Camera works as well as expected.  Nothing was missing from the packaging and it arrived on schedule.  Good camera for early teen children.  Relatively simple and straightforward.  As with all digital cameras, it eats batteries for breakfast.", "Date": "December 31, 2007"}, {"Title": "Good Value for Money", "Author": "Lazy Shopper \"Lazy Shopper\"", "ReviewID": "R4U2DTM2HS707", "Overall": "3.0", "Content": "It is a good camera for the money I spent on it. Simple, easy to use, small size.", "Date": "May 20, 2008"}, {"Title": "Expected better", "Author": "T. Engr.", "ReviewID": "R2EEXIR9ZIC5W3", "Overall": "2.0", "Content": "Pros with this camera are it slim size and use of AA batteries.  The 6MP is also a plus, though not particularly usable.I found quickly that if I took pictures in the full 6MP mode a large amount pictures would come out blurry, even outdoors in daylight.  (The camera's software tells you if a picture is blurry and asks if you want to keep it.)  I finally changed the picture mode to 3MP and had better success, though still more blur problems than you'd expect.One of the features I've always liked with digital cameras it that you can turn off the flash, and if you have something to stabilize the camera against, they take great pictures at night. (city lights, etc.)  However, I found this to be nearly impossible with this camera.  Even setting it on something, pictures nearly always ended up blurry.  Though I wasn't using a tripod, a previous older Canon took fantastic pictures this way.  In the end, it seems that the photo sensor on this camera just isn't fast enough.After 7 months, the camera was accidentally dropped -probably not more than about 20\" off the ground--and met it's demise.  The camera hit partially on the lens, which caused a lens jam-- and the camera will not turn on or operate with this condition--it simply reports a \"lens error\" and powers down.  Though certainly our fault, you hope that these products will be just a little more resilient to the bumps and scrapes of life.  Instead, we had to use a disposable camera for the last half of our Disney vacation.  Many consumer products are tested and designed for drops, etc.  Evidently not this one.So now it's time to shop for a new camera...  probably not another Nikon.  I'd expected better from them.", "Date": "March 23, 2008"}, {"Title": "Cheap camera, you get what you paid for", "Author": "J. Perry", "ReviewID": "RLA0MBTQSPW8U", "Overall": "3.0", "Content": "I've had this camera for about 6 months now, and I am about to abandon it for a Canon Rebel XT. The Nikon Coolpix L11 is a nice camera and it takes decent pictures, but it has terrible loading and booting up issues. When you take a picture with the flash it takes nearly 4-7 seconds for you to take another. I would not recommend this camera if you are into action shots.", "Date": "December 27, 2007"}, {"Title": "Zoom, zoom", "Author": "P. Kirtley", "ReviewID": "RUX5FGGWMRVKL", "Overall": "1.0", "Content": "After three days of use, the lens became locked outside the case, and even with a set of charged batteries, there was no power to the camera. Now, rather than enjoy the camera, the person we gave it to is faced with having to fork out money to have it returned for factory repair. I wish we could say something about the picture quality in this review, but we never advanced far enough to enjoy pictures retrieved from the unit. I usually buy Canon. This was my first Nikon.", "Date": "January 11, 2008"}, {"Title": "The video function is actually really good!", "Author": "David Holmes", "ReviewID": "R1TJTRQYJ0UC2I", "Overall": "5.0", "Content": "Fantastic value.Sweet little camera!  Seems to take pictures \"quickly\" -- as if they've eliminated a lot of that delay in between clicking the button and taking the picture.  The video feature includes audio and actually takes pretty good little movies.We couldn't be more pleased with this little camera for what we paid for it.", "Date": "August 11, 2007"}, {"Title": "fuzzy picture,  low price", "Author": "AliBri", "ReviewID": "RIHFVDVTQJV3M", "Overall": "3.0", "Content": "I just bought this camera and was disappointed.  My other nikon had 3.2 megapixels and it took better pictures than this one.  I'm not sure what's wrong with it but it takes fuzzy pictures for some reason.  The price is right but the quality isn't.  I'm going to return it and pay a little bit more for a better quality nikon.", "Date": "April 18, 2007"}, {"Title": "Great value!!", "Author": "Charles M. Garner", "ReviewID": "R2Q6JR7N7LERWA", "Overall": "5.0", "Content": "The camera was for my daughter.  She loves it.  I am impressed and will try to buy another.  My wife has used it also and she loves the simplicity of it.  The quality of photos and the ease of operation and the $$$ make it a great value.CT Garner", "Date": "April 17, 2008"}, {"Title": "Lens Jams and Nikon will not repair under warranty", "Author": "T. Webb \"Toolman\"", "ReviewID": "RXWRBJZZOQKQ5", "Overall": "1.0", "Content": "I bought this camera for my daughter for Christmas and paid $100. I was tempted by the low price but should've known it was too good to be true.  I've never owned a Nikon before and don't intend on owning one again. After about 6 weeks the lens became stuck while extended. After researching the problem on-line I found many other users had the same problem. The part that realy sucks is that Nikon do not regard this as a camera failure and will not repair it under warranty despite the fact that the camera was only a few weeks old. They would however repair the camera for $165. Duh! I bought a Sony Cybershot years ago and have never had a single problem. I guess my daughter will be getting a Sony now.", "Date": "March 18, 2008"}, {"Title": "It's a ggreat choice!", "Author": "its_crazy_time", "ReviewID": "RBXK7MZ5DDQ4V", "Overall": "5.0", "Content": "The Nikon Coolpix L11 is a great choice for a point and shoot. It's VERY easy to use, I took it out of the box and started taking pictures. The price is right for a name brand digital point and shoot, and the pictures look great. This camera takes better pictures than my fathers $600.00 digital! Another plus is that it uses AA batteries...camera batteries can be pricey...my old camera used camera batteries and it was a pain in the butt. Even the software was easy to install and use!The only con that I can think of is that it doesn't hold many pictures without a memory card, but most cameras don't anymore, and load up on the batteries, but I think most cameras chew them up too!", "Date": "March 11, 2008"}, {"Title": "Great Budget Camera BAD LCD", "Author": "BX5 Fan", "ReviewID": "RZJBBE6JQVBV9", "Overall": "1.0", "Content": "I have owned this camera for 2 months, maybe 50 shots total and the unit has never been dropped or handled roughly.  Over the weekend my wife had a baby shower and when I turned the camera on I noticed in the top right corner a white square about the size of a stamp with a black line across the screen, took all of about 2 seconds to realize my display was broken!I keep this camera in a case and again not a scratch on it, have owned other digitals for YEARS never a issue or even a scratch on a single display of mine HP, Lumix, Kodak, Canon, this is my first Nikon and got it just as a quick carry and shoot, overall it was a bit noisey to use but pics came out fine no complaints for the $$ yet now with no display and not even having done anything to it (no drops no opps moments) I am stumped and find myself with a broken camera :(", "Date": "March 3, 2008"}, {"Title": "Don't buy this camera - very slow to save image.", "Author": "Hiten Patel", "ReviewID": "R1M3F6FSR5D09N", "Overall": "1.0", "Content": "I bought this camera as the price was low and the brand was Nikon. I also bought the memory that showed up in Amazon as \"items other people bought\" when they bought this camera. The camera takes about 5 seconds to save the image to the memory. Thats so long that all the next photo gets messed up. As the camera was bought to \"point and shoot\" and if it takes so long to \"point and shoot\" then hey, it no good for me. I intend to return it as soon as I reach home, later this week.", "Date": "February 24, 2008"}, {"Title": "Buy a Disposable Camera Instead", "Author": "stgallag", "ReviewID": "RROFXJK3WJFHX", "Overall": "1.0", "Content": "CONS: Blurry Photos and Indistinguishable ZoomThis camera was a breeze to get setup and become completely familiar with all features, I did not mind that this camera does not have many features, but the one feature I miss is focus. I am returning this camera because of the poor quality of photo. The LCD shows a great shot, but the computer and television show a different quality. I am going to spend the few extra dollars and get a good camera.", "Date": "July 28, 2007"}, {"Title": "A disposable camera is more reliable", "Author": "Carrie Cotten", "ReviewID": "R2ZD9ZCNNPL5C9", "Overall": "1.0", "Content": "I bought this camera for a special trip to my 30th HS class reunion. At first I liked that it was light and easy to use and with enough features and capacity for it's price. Then at my main event it stopped working. I got a \"lens error\" message and the lens got stuck. Before that, it would turn off without any reason while aiming to shoot (batteries was not an issue). Unfortunately I got stuck with the \"lemon\" but for such a big event, it's unforgivable, it ruined my trip and I ended up buying Kodak disposables.  No more Nikons for me.", "Date": "June 13, 2007"}, {"Title": "Not bad.", "Author": "Brandon Heat \"I am Brandon Heat\"", "ReviewID": "RVFFX53FHHMRO", "Overall": "4.0", "Content": "First some of the drawbacks:First, the l11 is kind of awkwardly designed so it never quite feels right in your hand, it's too rigid and rectangular.  Also, you can't set it up (on a table or something) vertically as easily as stouter cameras.Second, the ISO is really high, but they don't really explain what that does.  The sales guy told me that you never really need over 200 or so, and when you get above that you get worse pictures.Finally, there is such a glut of Coolpix cameras that you can never really tell if you're getting something of quality.  The expertise required to rationally decide on one model over another is beyond me, and I'm sure a lot of others as well.But on the plus side, it takes very large high resolution photographs and has a video mode with audio.  The best thing though would have to be the price, which makes it's shortcomings bearable.", "Date": "April 5, 2007"}, {"Title": "You'd think a Nikon would focus...", "Author": "Evan", "ReviewID": "RS3A8G24Q7GCT", "Overall": "2.0", "Content": "I bought this camera as an inexpensive point-and-shoot that would be convenient enough to drop in my pocket, and even though I had only modest expectations, I'm still disappointed. The quality of the photos is uniformly bad; nothing is every really in focus, daylight shots are always way too contrasty and indoor shots are white-balanced properly only half the time. Moreover, the video it shoots on highest quality, supposedly 640x480 30fps, looks like 15 to me. (The SD card I have in it is supposed to be fast enough.)Other than Auto Mode, the L11 does have many, many Scene Modes and other options that I spent a little bit of time with, but none of them seemed to produce any noticeably better results. And really, if I was going to spend the time futzing through all the settings for every shot I want to take,  I wouldn't have bought an inexpensive point-and-shoot pocket camera, now would I?Yes, I know, it's just a cheap camera, so what should I expect?  Well, better than this. P.S.- My five-year-old 2 mega-pixel Camedia still does a better job, for heaven's sake.", "Date": "June 6, 2007"}], "ProductInfo": {"Price": "$124.99", "Features": "6.0-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints\n3x optical zoom; 2.4-inch Super Bright LCD display\nFace-Priority AF automatically focuses on faces\nD-Lighting improves brightness and detail\nPowered by 2 AA-size batteries; stores images on SD memory cards", "Name": "Nikon Coolpix L11 6MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51P6UoqqCHL._SX300_.jpg", "ProductID": "B000N49WPW"}}