{"Reviews": [{"Title": "Quality Pics with great zoom lens", "Author": "M. A. Quadir", "ReviewID": "R18FKEIIIN5KFQ", "Overall": "5.0", "Content": "If you wanted to have a good solid camera, this would be your choice. HP's 945 camera provides excellent features, with 8x optical and 5.3mega-pixel this camera is really an excellent peice of work. If you get one buy it do not leave it.", "Date": "June 22, 2006"}, {"Title": "Easy to Use with an incredible zoom!!!", "Author": "S. Law \"la_puck\"", "ReviewID": "R1OPND7H1P8LQT", "Overall": "5.0", "Content": "I LOVE this camera.  FIrst of all, the Optical  ZOOM on this camera is a wonderful 8X, where most camera''s now-a-days are maxed out at 4x!  The pictures were excellent, both in and outdoors.  The other review on this camera, the reviewer states there is a lag-time... untrue if you have a faster memory card!  I experienced NO lag time, but was stapping pictures back to back, nearly no time in between.I would definately recommend this camera to anyone lookig for a well=built camera... From beginner to Professional, this camera is well worth every penny....and then some.Nice features, also.  Easy to use AUTO mode takes the guesswork out of all conditions.", "Date": "June 17, 2006"}, {"Title": "Not an action camera", "Author": "PG \"PG\"", "ReviewID": "R1N7M0GFOELDBL", "Overall": "2.0", "Content": "This camera has a VERY slow shutter response. It is impossible to take action pictures, but works well for stills. The pictures are good quality. The lag time appears to be 20-30 seconds. Imagine being at a birthday party and having to wait 30 seconds before taking the next shot every time. This camera is a battery hog. Also, HP does not repair their cameras, nor will anyone else touch them. They offer either to 1) give you the same camera refurbished or 2) give you an upgraded version of a similiar camera refurbished. In the case of the Photosmart 945, the camera has been discontinued and they will only offer option #2. My \"upgrade\" offer was for a $220 refurbished camera.", "Date": "May 16, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "HP PhotoSmart 945 - Digital camera - compact - 5.3 Mpix - optical zoom: 8 x - supported memory: MMC, SD", "ImgURL": "http://ecx.images-amazon.com/images/I/21RPKTKWN6L.jpg", "ProductID": "B0000DIOCW"}}