{"Reviews": [{"Title": "Not what I thought", "Author": "Charlie Zack \"Charlie\"", "ReviewID": "R9W8A3BJBSUB", "Overall": "3.0", "Content": "I need a camera with >5MP and short movie feature.This one looks cool since it comes with mpeg4 video and 7 MP. The reviews from Steve and other experts are not too bad. The sample pictures online are really nice to me.So I bought it. I like it very much before I found this problem.THE SOUND VOLUME of the VIDEO is VERY VERY LOW! you can barely hear it if you shoot someone a couple of feet away. How disappointing!I called Samsung to make sure whethter it is a design issue or just this one I got is malfunctioning. The RP was so rude. She told me, \"this is a still camera, no a video camera\", \"it is not a design issue\".I used Sony P-92 before. The volume level of that camera is very good. But this Samsung V700, what a flaw. Otherwise I will like it and keep using it.I ended up sold it on ebay. Please avoid this one if you are inrerested in its mpeg4 video. It is not worth it.", "Date": "October 10, 2005"}, {"Title": "Good value for money", "Author": "Ashwin Shetty", "ReviewID": "R2JJENK6FAZ7DV", "Overall": "5.0", "Content": "Has all the necessary features. The anti-shake indicator lets you know that the image is going to be blurred. Specially like the Text mode, which let me take pictures of documents and print it while my photocopy machine was out of  order.", "Date": "January 4, 2007"}, {"Title": "Casi perfecta !", "Author": "Luis G. Pinzon Serrano \"gpinzon\"", "ReviewID": "R28RZMVDTJFJ3I", "Overall": "4.0", "Content": "Estoy muy contento con la cámara, el único defecto que le he encontrado es que el volumen al grabar video MPEG4 es exageradamente bajo....  parecen películas mudas y ruidosas.  Por lo demás es muy buena.", "Date": "October 27, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "Stylish, compact silver point-and-shoot digital camera with 7-megapixel resolution for brilliant poster-size prints\nSchneider Kreuznach 3x optical zoom lens with 12x digital zoom\nNearly instant start-up; high-speed shot-to-shot feature allows continuous high-speed shooting; movie mode limited only by memory card\nStores photos on SD and MMC memory cards; 32 MB SD card included\nTransfers photos via USB; compatible with Windows and Mac operating systems; rechargable Li-ion battery", "Name": "Samsung Digimax V700 7MP Digital Camera with 3x Optical Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/417QCKVQT3L._SX300_.jpg", "ProductID": "B0007ZGXRC"}}