{"Reviews": [{"Title": "Comparison to Canon Powershot S40", "Author": "netscorer", "ReviewID": "R3OGOPMVOFX088", "Overall": "5.0", "Content": "1) Size. Both cameras are small but the crown goes to Olympus, even if only by few cubic points. Olympus is also lighter of the two.2) Resolution. Both cameras feature 4.1Mpixel CCD. What Canon misses and Olympus has is an extrapolation to 3,200 X 2,400 (or 7+Mpixels). By making an extrapolation from a raw image (not even TIFF!) the camera may make a much smarter decision then your average Photoshop program. This is the must if you want to print a poster from your picture.3) Picture quality. Very good and comparable between both cameras. Even the most advanced reviewers have a hard time giving clear advantage to one or the other. Canon has a slightly better rendering algorithm, so the nod goes to Powershot but not by much. ...4) Lenses - for all purposes the same. Not as fast as on any of the bigger cameras but satisfying for most applications.5) Zoom - same.6) Storage media. Olympus uses SmartMedia, while Canon uses CompactFlash (types I and II). Both supply laughable 16Mb out of the box, so you have to purchase larger modules. The prices for memory are comparable but advantage goes to Canon, since Compact Flash is a more advanced format and comes in bigger sizes. Still, 128Mb is more then enough for a day of shooting.7) Batteries. Both cameras are not ideal. Canon pretty much forces you to buy additional module ... since it uses a proprietary format, but Olympus does not supply a rechargeable batteries and does not allow to recharge in camera, so you need to buy NiMh AA batteries and charger, which would cost the same (smart investment). Still I would give an advantage to Olympus because you can always find AA batteries in any store if you ran out of power. I also want to address here the power consumption since a lot of users are giving their thumbs down based on this feature alone. Both cameras are bad. This is a sad reality if you want a subcompact camera. But not make a tragedy out of this. If you use both cameras smartly, it should last you the whole day of shooting quite easily.8) Price. Still too high IMHO for both of cameras. Canon is slightly more expensive but not by much. You can buy any camera now for less [money]. With all accessories (memory, batteries, case, etc.) you should just be able to fit in ... budget.9) Flash. Mediocre at best for both cameras. Canon does a slightly better job at red-eye reduction, but Olympus is slightly better with white-balance adjustment. Still this is probably the weakest point for both cameras.10) Video. Both cameras have built-in video mode with sound recording and speaker for later review. Since I don't care much for this feature I won't discuss it here.11) Supplied software. Olympus ships with camera the Adobe Photoshop Elements - by far the best photo-editing package on the market now.12) Nice extras. Canon comes in a metal casing which gives it a very sophisticated and ruggish look. Olympus casing is more stylish IMHO and is made of very sturdy plastic. Both cameras have auto USB connectivity and optional waterproof cases. Olympus has three unique features that made me buy it. First is a low-light noise reduction that can be activated when you switch camera into night shot option. The special algorithm that Olympus uses allows it to compensate for long-exposure related errors (such as \"hot\" pixels) and results in a much better looking pictures. If you like to make night photos (I do) you can't live without this feature. Second feature is pixel mapping that allows camera to compensate for dead pixels in CCD. Until you have this problem you won't probably think much about it. The third feature is \"User Mode\" which allows you to store your preferable settings and access them by simple switch of the dial. I use it quite often and it saves a lot of preparation time before shot is taken and results in a better quality picture. It is especially useful if you take a series of pictures in challenging lighting conditions (such as twilight time).Overall, I chose Olympus for the above mentioned features, but you can't go wrong with any of these little cameras.", "Date": "April 15, 2002"}, {"Title": "Finally.. a high resolution pocket size digital camera!", "Author": null, "ReviewID": "R2HJD1Q7IACOHS", "Overall": "5.0", "Content": "I've used Olympus point-and-shoot cameras for years, starting with the XA.  Though my 'main' camera is a Nikon F3, over the years I've opted to carry the small Olympuses for travel. If it can't fit in my pocket or purse, it doesn't go!Finally... there is a pocket-sized digital camera that rivals the resolution of a film:  the Olympus D40Z. It has more bells and whistles than the average photographer will ever need, but it also runs just fine in the 'PHD' AUTO mode. And the quality is fantastic! Another feature I really liked was the drag-and-drop feature that allows you to offload pics direct to a PC hard drive through the USB port makes download a snap.  On a short boat ferry, I powered up my laptop and had the pics downloaded in less than 30 seconds. (One friend uses his Olympus to transfer files from one PC to another at home!)Battery life has not been a problem - I've run several hundred photos through the camera and am still on the original battery. I don't however use the viewer much - I save battery life by downloading photos to the PC rather than viewing and editing them in the camera. Nevertheless, purchasing the rechargeable batteries is recommended in the long run.I was looking at the Nikon CoolPix 990 and 995 before this camera was released. Though the quality and durability is very good, I was put off by the larger body size and weight of the Nikon (if it's not small, it will probably be left in the drawer more often than not). So if you're in the market for a digital camera and need small size, high picture quality with enough features 'headroom' to allow a high degree of control over the image, you should definitely consider the Olympus D40Z.", "Date": "December 30, 2001"}, {"Title": "Tiny camera, many features", "Author": null, "ReviewID": "R3514NEGW9902Y", "Overall": "4.0", "Content": "This is the second Olympus camera I've owned, and I bought it specifically for travel. It fits easily in a jacket pocket (or shirt pocket without the case) or a briefcase, so there's no excuse to leave it behind. Like all Olympus digital cameras, the D40 optics are excellent, and the resulting pictures have good color fidelity and saturation. The extra pixels also make a big difference in enlargements. 8x10 prints from the D40 are noticeably better than the 8x10s from my two-year old, 1.3 megapixel D620.  Even subtle scenes like sunsets are captured with excellent fidelity - almost as good as film. The camera has a dial that lets you select from several pre-programmed modes for scenes like landscapes, portraits, etc. One really cool pre-programmed mode is a night setting that allows long exposures by cancelling the noise that normally builds up in digital pictures. Of course, there is also an \"auto\" mode for us lazy folks, but if you're ambitious, you can navigate the menus, set everything manually, and save it as a user-defined, custom mode. It also shoots QuickTime/MPEG movies (with sound).While I like the portability, the camera does have a few drawbacks. It uses a LOT of battery power, so the two AA cells run down very fast. Olympus ships the camera with a disposable 3V lithium battery, but get this, it costs about $10 to replace! I use rechargeable NiMh AA cells, and while they only last 1/3 as long as the throw-away lithium battery, over time they will save $$$. Be sure to get the newer 1600 or 1800 ma-hr AA cells, and pack four of them in the camera case.Another potential drawback is the complexity of this camera. I enjoy learning how to operate stuff like this, but if you are intimidated by options and menus, you might want to look at a different model.", "Date": "December 10, 2001"}, {"Title": "Yippie", "Author": "Hugh Barrett Flynn", "ReviewID": "RJW9RXF7V6MJ4", "Overall": "5.0", "Content": "This is my 4th Digital Camera. I love photography and know how to take great pictures. Olympus has done it again.  The D-40 is an amazing product. First remember you are buying a point and shoot camera. This camera is tiny and light.  When you put it in your pocket you will not know it is there. The sliding lens cover is great because you can put the camera anywhere with no lens cap to worry about.  It is simple... It is complex.  This is a real plus.  Most of the functions are very simple.  But if you are anal, then you can do whatever you want to create interesting photographs.  They included a dial that allows you to select the type of picture you want.  This is good. However, you need to have your brain alerted to the dial because it is easily moved. They have a view mode when you are taking pictures making it easy to view the picture you took and return quickly to shooting.  When I first picked up the camera it was hard to hold because I have big hands.  Then I noticed the grooves in the camera that allowed my hands to naturally hold the unit.  It stuck like glue to my hands. The zoom is not great but if you have legs you can overcome that problem.The picture quality is amazing.  Colors are extremely accurate and the intensity of the pictures are hard to believe.  You actually get excited when you look at your work. Each picture is a little less than 1 meg.Now I could go on because there is tons more to say... But the reality is, if you like taking pictures of everything, and you want the easiest, smallest way to do that, this is the camera... no questions asked... it is so cool... thank you, thank you, Olympus for giving us this amazing piece of technology.And when you buy this camera, Olympus has great service.  I know because they have helped me with knowledgable customer care...and I do not work for the company!", "Date": "November 24, 2001"}, {"Title": "An excellent compact camera", "Author": "Stephanie \"psketch\"", "ReviewID": "R2MKL9GH4R90ZT", "Overall": "5.0", "Content": "This camera is fabulous for us.  We live in Bermuda so we take lots of outside pictures - beach scenes, foliage, macro shots of exotic flowers etc.  The colours on the photos are clear and rich, and our pictures cannot be distinguished from real film shots. We print on an HP960c printer and use Kodak photo printer paper.  The results are remarkable.For indoor shots the subject needs to be close - typically with digital cameras the flash could do to be a little stronger.When I first started with the camera, the lag between depressing the shutter button and taking the photo was a bit perplexing.  However, I understand this typical of digital cameras (but not a problem on my previous Toshiba digital).  BUT - I learned to set a manual focal distance to take quick shots. Also the burst function which takes several shots in rapid succession helped alot.We purchased a rechargable battery kit with 1700 model batteries.Using the optical viewfinder and occasionally using the LCD to alter commands, I have been able to shoot and download 180 pictures at high quality level.  Since the camera takes only 2 batteries, it's easy to keep two spare charged batteries in the case.  I did go through the original lithium battery very fast because when I first got the camera I tried out every function, including shootin several movies and used the LCD alot.  Re-chargeables are definately the answer.I recommend to get the camera case designed for the camera - it is compact and has a special compartment for the spare batteries. Also a 128 mb Smart Media Card - it will hold 130 pictures at High Quality.All in all, we are thrilled.  We had also considered the later model Canon cameras but read reviews about poor autofocus. I have had yet to have an out of focus picture on this camera!  The manual could be a bit more explicit, but Olympus on-line is very helpful. Next time however, I would like a larger optical zoom.We use Windows XP and everything works fine with it.  Good Luck!", "Date": "April 14, 2002"}, {"Title": "Great camera and easy to use", "Author": null, "ReviewID": "R876XT1R0V8TE", "Overall": "4.0", "Content": "I've had this camera for 6 months now, and have been very impressed with the quality of the pictures and the ease of use.  The compact size and light weight makes this one great camera.  My only criticism is that the manual is very difficult to understand, and does not even attempt to explain how the remote control works.  Fortunately, the various dials are buttons are pretty self-explanatory, and I've been able to figure out everything I need.", "Date": "June 5, 2002"}, {"Title": "This camera is great!", "Author": "isolde", "ReviewID": "R3TM528PQVNUAC", "Overall": "5.0", "Content": "I bought my first digital camera about 6 months ago, the Fuji Finepix 101, 1.3 megapixel. It was handy and I had lots of nice shots, especially after editing in Photoshop.But the Olympus! Wow! Now I'm back to the old days of SLR photography, even with the choice of B&W or sepia tone images. This camera, in auto mode, captures the colors perfectly. It is a little hard to figure out at first and as someone else noted, the manual is worthless. But if you don't mind poking around a bit, you'll soon get the hang of it. I am very happy with it.BTW, I haven't had a single external device connected via USB that hasn't crashed my computer at some point so I'm not going to give the camera negative points for that.", "Date": "June 10, 2002"}, {"Title": "just buy it ....you'll be glad", "Author": "G'man", "ReviewID": "R3CJXEQTCS22OK", "Overall": "5.0", "Content": "i have had an olympus digital camera for 4 years now, and have been researching for the last 6 months on a new model.. just got the new d40 in time for  christmas and also ordered the bu-100 charger and a 128mb extra card... buy both! amazon's service on these products was just great!  ordered them 1 week before christmas and got them in 5 days....the camera takes great pictures and the featuers are easy after you play around with the camera.....for christmas my son also got me the olympus USB smartmedis reader which i really like useing to save the battery power...the quick time video uses alot of battery power but the sound and pictuer quality is just amazing and the zoom featuer works really good....compact size makes it a breeze to carry around in the shirt pocket...i mainly use the 1600x1200 sq1 modeand the COLOR quality is just amazing.....get one now!!!", "Date": "January 6, 2002"}, {"Title": "An ultracompact that has it all", "Author": "Douglas Turnbull", "ReviewID": "R29BTPBKMYAB7S", "Overall": "5.0", "Content": "The D40 is an unbeatable combination that has several key features:1. Very compact--fits easily in the pocket or a small purse when going out. If the camera is too big to carry around with you, it's worthless--you won't get any pictures if you don't bring the camera2. High resolution--4 megapixels is enough to make a high quality 8 by 10 print. Unless you're a professional photographer, it has all the resolution you need.3. Takes AA batteries--this was key, as the Olympus was the only ultracompact that takes AA's rather than proprietary batteries. The lefetime is a little less but if you buy a set of 4 NiMH batteries you can always have a spare pair handy. Other cameras' proprietary batteries will cost another $50-75 over the base price, if you want a spare. And since it uses AA's you can always buy more if you don't have spare rechargables handy, or if you forget to bring the charger on vacation.4. Optical zoom. Digital zoom is a meaningless number--it's the same thing you can do with photoshop after the fact. Only true optical zoom gives you zoom while keeping the resolution, and the D40 has it.I was looking for all those features, and the D40 was the only digital that provided them. We took it on our 3 week honeymoon and the pics turned out great. A pair of NiMH's last about a day of fairly frequent shooting.All in all, I'd highly recommend this camera.", "Date": "October 22, 2002"}, {"Title": "This camera kicks butt!", "Author": "Newbie digicamer", "ReviewID": "R2RLIJV1G95X2", "Overall": "4.0", "Content": "After much shopping around on the internet, and reading reviews I decided on the Olympus D-40.  It's my first digital camera and so far I'm VERY pleased.  Its compact size makes it easy to take with you.  The biggest selling points were (1) the 4 megapixel capability, (2) the size AND (3) it has a remote!  I love this feature, it means I can take pictures of myself with my family/friends without having to do the run back and forth routine that you do with a timer. (It does have a timer for those that still want that option)  The remote works for a few feet - enough to get a pic of you with that awesome scenery, monument, etc. behind you.  Also, you can manually set all settings - shutter speed, etc.The drawbacks are (1) the zoom and (2) the lag time between the press of the shutter button and the actual picture being taken.  The zoom doesn't go as far as I wanted.  I would have also liked the capability to put an extra zoom lens on.  Sometimes the lag between pressing the button and the photo being taken is enough to miss the shot.  For those reasons I've given the camera 4 stars instead of 5.  Overall, this camera has been a great starter for me and I bet would be good for a repeat digital camera buyer who wants a bunch of features in a small package.P.S. Get the big (128MB) memory card.", "Date": "September 7, 2002"}, {"Title": "Beautiful little camera", "Author": null, "ReviewID": "R19C78QIJI9ORG", "Overall": "5.0", "Content": "Thinking to get Canon S40 but ended up with D40 due to many good reviews of this camera.I like the panorama mode that is built in this little camera. Software is top notch, you can print different pictures on a photo paper instead of printing one at a time. I had this camera for 2 weeks now, still using the battery that comes with it.", "Date": "April 26, 2002"}, {"Title": "The best you can have for the price.....", "Author": "Teo Katopodis", "ReviewID": "R273EL212ENKCO", "Overall": "5.0", "Content": "I have used about 5 digital cameras so far (pentax, sony, olympus) for more than 2 years. The D-40 is my last upgrade from the Olympus 2040. My remarks:1: Olympus gives the best results when you print your fhotos(in an average quality... printer like HP-920). Simply you cannot tell the difference from a hi-quality film camera.2: If you like the quick \"point and shoot\" photography without tripods and professional settings, the camera is amazing and the zoom is just what you need. It takes clear and sharp pictures. The camera of course has noumerous settings and capabillities but it works fine in auto mode. Just turn it on and shoot.3: The camera is the smallest by far in 4 megapixels. You can have it always with you, everywhere, even in your shirt pocket.4: Real plug and play. Just plug it into a USB port and that's it. No drivers no CDs...Just drag and drop like a hard drive. With the 128 MB SM card you can cary more files than a 100 MB zip drive. Yes I use it to copy and transfer files.5:It gives you for an extra the pixel-maching technology. You never know when you could need this, but other brands, more expensive cameras, still haven't it.6:Yes, it drains batteries fast but not faster than the other models by Olympus, if you take into consideration that it takes only 2 AAs. So you have 2 more for spare.5 stars with no doubt. And remember : SIZE ALWAYS COUNTS.", "Date": "August 22, 2002"}, {"Title": "Good picture quality, fairly usable", "Author": "Ian Ivey", "ReviewID": "R1RJ3KL3WWBA9K", "Overall": "4.0", "Content": "I concur with the first two reviewer's comments, generally. The camera takes excellent, clear, vivid pictures and is very small (not as tiny as the Canon digital Elph line, but the small Canons are currently only at 2.1 MP). Although you don't have to be a genius to figure the camera out, ease of use is not the camera's strong point. Icons and menu labels don't make immediate sense; you must read the manual (PDF format on the CD -- no print version!) to understand what the menus and dial-mode positions do. Though the controls are complex, they're also deep and feature-rich. The camera gives an Auto mode, a Program mode, Shutter priority, Aperature priority, and full Manual modes, and automatic scenery, portrait, and people-in-front-of-scenery modes. Macro mode and night-time mode are also on the dial for quick access.Olympus includes an infrared remote control in the package (nice not to have to go buy one separately). The 30-second movie mode works fine, but don't think of it as a substitute for a camcorder--the microphone doesn't work that well. It is a mystery to me why Olympus chose to use a proprietary battery size. The included NON-rechargeable lithium battery is about the same size as two AA batteries, and you can use two AA batteries in place of Olympus-brand lithium batteries... Ni-MH rechargeable AA batteries are the cheapest solution in the long-run; the camera chews up Alkaline batteries like crazy, and lithium AA batteries are about as expensive as the Olympus-brand battery, per picture. Note: you can't recharge your Ni-MH AA batteries inside the camera; you must have a separate charger. Silliness. But not so silly that I wouldn't recommend the camera. I'm happy I bought it.Last item: I use Windows XP Home, and I tried hooking up the camera to my computer via the included USB cable. It worked the first time, but it crashed my system the second and subsequent times. This might just be my fault, but I can't be sure yet.", "Date": "December 29, 2001"}, {"Title": "Great photo quality -- VERY slow response time", "Author": "Kim Quilter \"kimquilter\"", "ReviewID": "R3IJ6FNX2D0OGE", "Overall": "3.0", "Content": "While the photo quality is amazing on this camera, there is one maddening thing about its operations that makes me second-guess purchasing it.  There is about a one to two second delay between the time you press the button to take the photo, and the moment the photo is actually captured. I took the camera on vacation, and when other people offered to take my family's photo...I had to explain to them NOT to move the camera for a couple seconds after pressing the button, so that we all didn't come out in a blur.  I am amazed that this has not been pointed out in camera reviews. I wish I had known this because it is a major flaw.This camera is terrible at action shots on automatic.  I haven't tried it on advanced settings yet. I will have to explore that more.Also, it takes a long time for the camera to \"warm up\" once you open the cover and prepare to take a photo. Very little spontaneity is possible with this camera if you intend to put it away and take it out only during photo opportunities. The best use for this camera is for still shots and people portraits. It's not a \"get-up-and-go\" camera with fast response time and responsiveness. I am hoping that my inquiries into Olympus will clear this up as a simple programming issue so that I can speed up the camera's performance.  But as of now, I feel the camera isn't as versatile as I would like.", "Date": "September 19, 2002"}, {"Title": "it's been 3 years and i still love my D-40Z", "Author": "schuss", "ReviewID": "R1WQ6I8J9HK2S8", "Overall": "5.0", "Content": "check my pics in the customer shared gallery for some examples. ;)i bought this camera for the 4MP, the compact size, the sliding cover to protect the lens, the relatively cheap memory format (smartmedia), the AA batteries, and the combination of automatic modes and manual adjustments.  3 years later it continues to deliver for me in all these areas and more.i spent a month in europe last winter and took 150-200 pix a day with it.  everything from skiing to dark pubs to out-the-car-window came out well.an oft-overlooked feature that has become my favorite (the icon is worn off the selector knob from use...) is the \"My Mode\" setting.  once you pick a setting and save it here, it's at your fingertips.  my preference is flash off, motor drive, auto shutter/fstop, overexpose by 0.7.  it's my snap-pix-of-my-friends-discreetly mode. ;)  anyway, dedicating a selection on the mode knob to a custom setting is much appreciated, thank you olympus!overall, it takes great pictures, is easy to use whether you want to tweak with things or just hold down the button and fill a card with shots, is reasonable with batteries, and is well-designed and constructed.  it has been everywhere with me - travel, skiing, sailing... it has bounced around in my bag, hung out the window on the freeway, gotten rained on, snowed on, hailed on, been to the beach... and is still a champ.btw, those first two pics i posted in the share gallery i took today... so that's how it works after 3 years of abuse. ;)", "Date": "March 27, 2005"}, {"Title": "Yet another good Camedia, but.....", "Author": "Rheumor", "ReviewID": "R32W3ZAFEI2E3A", "Overall": "4.0", "Content": "not a great one. I had a chance to use this one for a couple of days and while I certainly liked it, I don't miss not having it.My complaint focuses primarily on its balance of features; it is rather expensive, and a good part of that expense is due to its outstanding 4 megapixel resolution. (\"resolution\" describes the number of digital dots that make up the image; as you enlarge a picture, the dots begin to pull apart and the picture begins to look grainy). For Internet purposes (either emailing pics to family members or for posting pics on websites), about 1 megapixel is fine. For printing standard 4\" x 6\" photos, 1 megapixel is also adequate. The 2+ megapixel cameras (that's a big group) do a fine job with enlargements of 5\" x 7\"; the 3+ megapixel cameras easily handle 8\" x 10\". While this latter group can produce pretty good 11\" x 14\" enlargements, it is at this level that a 4 megapixel camera begins to make sense. But how often will you take a pic you want to enlarge to that size? Pictures taken at higher resolution slow down the camera (\"write time\"), increase battery use, take up much more space on memory cards and on your PC, and email or open on websites more slowly.For my purposes, a powerful zoom lens with good glass optics will always trump resolution. To be sure, other features do matter: size, balance, battery setup, connectivity and the ability to shoot QuickTime movies. Having said all that, I would much prefer to grab the Canon S300 or the Camedia 700 than the D-40, but if someone just gave you a D-40 for the holidays, you still did pretty well. Enjoy.", "Date": "December 30, 2001"}, {"Title": "Love this Camera", "Author": "Frank L. Richardson", "ReviewID": "R3VVUFA14Q8H8T", "Overall": "5.0", "Content": "I have owned 4 other Olympus digital cameras, always upgrading towards more pixels. My last Olympus was the C3000 zoom, an excellent camera. The only reason I bought the D-40 zoom was for it small size.If you are looking for great quality photos, ease of use ,many,many extra features and small size (fits in your shirt pocket), this is the camera for you. As to battery consumption, if you use the view finder instead of the screen, you get over 200 pictures. It only uses two batteries and I use rechargeable, so power consumption is not an issue.", "Date": "January 4, 2002"}, {"Title": "Beware LEMONS!", "Author": "Brent Frederick", "ReviewID": "RROU1MWQOH5W5", "Overall": "3.0", "Content": "I can't lie... this is a great digital camera with many advanced features and excellent photos (see the other reviews), BUT...  It took me 3 orders to get a camera that worked properly.  Had it not taken me so long to find a camera that worked I would surely have rated 5 stars.Camera #1 took excellent pictures and worked properly, EXCEPT that it managed to drain its battery while it was OFF - usually in less than 12 hours.  (I used the recommended CR-V3 batteries, for anyone who might think I had simply used AA Alkalines.)  I shipped this lemon back to Amazon and was promptly furnished a new model.Camera #2 did not even turn on!  The lights would blink and it gave an error message indicating problems with the Smartmedia.  I tried swapping the card with one that I knew worked, but to no avail.  Also, while OFF, this camera heated up to about (I'm guessing) 100°.  I took the battery out fearing an explosion and promptly exchanged this model.  I've had Camera #3 for several days and everything seems to be in order.  I'm still using the original battery after taking many pictures and movies.  I am now thoroughly satisfied with my purchase, but I advise you to keep my problems in mind as you consider this camera!I must put in a good word for Amazon's replacement policy.  My new cameras arrived quickly and all the return postage was prepaid.", "Date": "August 2, 2002"}, {"Title": "Little Giant", "Author": "Steven C. Brandt", "ReviewID": "RGHFEYWRBV7KS", "Overall": "5.0", "Content": "Great little camera. The picture quality exceeds my expectations. This camera is jam packed with great features. After studying the users manual on the CD I was able to recognize all of the functions and navigate the menus with ease. Very intuitively laid out. I highly recommend this camera to anyone that wants the best of both worlds, a full featured miniture camera.", "Date": "February 6, 2002"}, {"Title": "Love it", "Author": "Nicole L. Moen", "ReviewID": "RP1T4GG7OEU3P", "Overall": "5.0", "Content": "I have never owned a decent camera of any kind so this is a first for me, But with all that aside, It was easy to figure out, and it takes really nice pictures. You can be standing in a room so dark you cant see your hand in front of you and the picture will come out like its broad daylight. (nightmode) Took it to Horror Nights at universal and everyone was like wow your camera is cool! Thanks Olympus :)", "Date": "October 15, 2002"}, {"Title": "Great features, terrible battery life", "Author": "Rey Leon \"athomeintheair\"", "ReviewID": "R2U82JMW44JVXL", "Overall": "4.0", "Content": "I originally purchased this camera on a vacation and was very excited about its compact design and full features.  I was very disappointed when after shooting only 25 pictures the battery meter came on and shortly after the LCD shut off.  I was using Nickel metal hydride rechargeable batteries as recommended by the salesman.  I popped in another set of batteries and had about the same results.  This model uses only 2 AA batteries as opposed to 4 in most other models.I ended up returning the camera because of this problem and purchased the Olympus C4000 instead. (it uses 4 AA batteries)I still have photos from both cameras and I am very impressedwith both.My only warning is beware of battery life and don't even think about using alkaline batteries (I got only 10 minutes using those) If you don't mind the battery changing then this is the best I've seen in its size.", "Date": "September 27, 2002"}, {"Title": "Olympus d40", "Author": null, "ReviewID": "R2GY4DUCHH4L2V", "Overall": "5.0", "Content": "I bought this camera in June and immediately went on a 6 week vacation, thus I did not have time to learn how to use the camera.  I bought 3- 128mb  memory cards plus the  Olympus carrying case. I obtained  1700 mah NiMh AA batteries and charger.  I used the camera in automatic position and kept the batteries just in case I ran down the camera batteries.  I got 468 terrific photos ,almost never ran down the batteries in a days shooting and found the carrying case saved my camera from a rain storm(my underwear got soaked in the rain).  When I got home I plugged the camera into my Windows xp computer and did a copy and paste from the camera to the computer  hard drive. The photos were amazingly beautiful and accurate in both bright light and at nite.  So whats is wrong with the camera.  Perhaps the battery situation could be improved as to  battery life, the camera might be better in a metal case and  .5 inch longer, the slight time delay in shooting could be shortened.But realistically this camera is fantastic and fits in you shirt pocket.  If it was any bigger I probably would not take it with me.  Richard", "Date": "August 14, 2002"}, {"Title": "Excellence with qualifications", "Author": "Grant Mason", "ReviewID": "R1AMJY67KIQKW9", "Overall": "4.0", "Content": "I have had this camera now for 7 months and I have years of experience with the Olympus IS-3000 180 Zoom. Here are my thoughts:1) The D40 takes pictures better than a 35mm because: a) with digital you can instantly see the pictures and take more if needed, b)you tend to take a lot more pictures resulting in a better chance of excellent photos (and you delete the useless ones), c)the small display -- if you shoot with this -- causes you to take lots more closeups than you would with a 35mm and the result is better because of this, d) the print quality on photographic paper is on par with a 35mm (I do notice the \"hot pixels\" sometimes only because I read these reviews, e) I really have not used much of the digital editing using the software -- this would be an extra edge over regular cameras.2) The minimovie mode takes reasonable movies -- better than the reviews would have you think. I have some keepers. Although I have not got the audio to work right.  And the Quicktime format means that if you burn CD's with the movies to send to others you need to also send them the QuickTime program if they don't have high speed internet.3)Why I deducted a star in my rating: no redeye reduction.  I think most digitals don't have this -- why not?  It means that you get lots of redeye shots.  The software takes out most but not all of the redeye and is inconsistent, and its an extra labour that we should not have to do.4) As you do not look down the lense as with my IS-3000 the viewfinder is not so good -- I think a common drawback of digitals. You don't really get what you see.  This is an area where my IS-3000 is superior: framing shots.  I recommend using the LCD to frame shots.  It is more accurate although on bright days it is difficult to see.5) Installation.  I could not get the software to work with 98ME after visits to the website and calls to customer service.  I then upgraded to XP and it worked like a charm.6) I agree with commenters that the owner's guide is not so clear.  It is true that the camera is intuitive on all the basic features and more.  However, there are some features I would like more explanation about.  Shame on you Olympus!  You could put details on the web if you don't want to put them in the owner's guide.7) This camera, probably like all digitals, is a bit slow to fire up compared to a regular camera.  It takes a few seconds to turn on, then two seconds to fire up the LCD.  Also, like all digitals, there is about a second delay between when you press the button and when it takes a shot.8) Zoom is limited.  I may have considered buying extra zoom if available.  9) I was expecting the camera to be a battery eater and it is.  When I go on trips I carry the charger along with.", "Date": "January 27, 2003"}, {"Title": "Amazing camera for its time; still a good buy for a low-end camera", "Author": "Alexander C. Zorach \"Alex Zorach\"", "ReviewID": "R1BA7GT3OEL4RF", "Overall": "5.0", "Content": "This was my first digital camera; it is a quite out-of-date model but it was among the top of the line when it was made, and in some categories it still holds its own against modern, much pricier models.The biggest strength of this camera is that it takes excellent photos.  The automatic setting works pretty well.  It supports ISO-400 and has less noise than many newer cameras.  It also takes decent flash photos.  And it does have modest optical zoom.  The settings are pretty easy to use and it gives you a good amount of flexibility, although the full manual mode is clumsy.  It is very small, and it is very durable--I have used mine for four years, and the plastic cover for the ports broke off, and the icons wore off the dial, but it still works like a charm.  The night-setting also takes fabulous long-exposure pictures.The weak points are pretty self-evident.  The viewscreen is tiny, the camera has a very slow startup time, and flash cycling is pretty slow.  And the digital zoom is pretty much useless; modern photo programs can interpolate at least as well.I think this would be an excellent purchase for those wanting a low-end digital camera.  It simply blows away modern models in the below-$100 price range.  I now have a Canon PowerShot A700 (about $300) and I can say with confidence that this old Olympus still wins out over my new camera in some situations.  Especially for people who are going to take a lot of lower light photos but want a cheaper model, this is one of the best options out there.", "Date": "October 14, 2006"}, {"Title": "Don't Know Why Olympus Stopped Making It", "Author": "Confederate", "ReviewID": "RTDN5PMVTF57L", "Overall": "5.0", "Content": "When this camera first came out, I could only afford to look at them on the dealer's shelves. Small, lots of features and reviews praising the image quality up the gazoo, AA batteries (no scarce proprietary). But the price was anything but affordable. Now that they can be had on eBay, Amazon and other places refurbished or in mint condition, the D-40 is still one of the most desired cameras around. The only rub I've discovered is indeed minor: don't leave the autofocus on constant when you're shooting movies with sound; otherwise the focus mechanism makes a distracting noise.I don't worry too much about filters and white settings. Most of that can be fixed in Photoshop.It's such a nice camera, I don't know why Olympus stopped making it. At 4 megapixals, it's got a lot of life still in it.", "Date": "August 18, 2004"}, {"Title": "Nice features when it works", "Author": "Jay", "ReviewID": "RHGACG6NM08XG", "Overall": "3.0", "Content": "I bought a D-40 and liked it so much I bought another for my parents.  Within a very short time my parent's camera started having power problems.  It would only stay on for about a minute even with new batteries.  Fortunately we were able to return it and I got them a D-490 instead.  After a little over a year my camera developed a similar problem.  I'd turn it on, five seconds later it would turn off.  They charged me $ to fix it.  0 for 2 is a pretty poor track record.", "Date": "January 16, 2003"}, {"Title": "Outstanding Product", "Author": "\"fourreversee\"", "ReviewID": "R2MLRM51BJYU6W", "Overall": "5.0", "Content": "I purchased this camera (D40 Zoom) after looking at the canon s100 and s300.  We were looking for a small camera that we could take with us all the time.  So the small size is what attracted us, but since having the camera, it has led to much more than just quick snapshots.  It has a lot of features that allows you to play with light and exposure time which can really create some great photos.I have taken this thing with me everywhere and had some really great shots (surprisingly for an clueless wanna be photographer).On the downside, like every other digital camera, it is a battery HOG!  I ended up getting 8 rechargeable NiMH batteries and 2 128 MB smartmedia cards. The lense does not lend itself to adding any filters or additional lenses so that could also be a problem.But finally, the picture quality (there are several different resolutions you can set) at the high level is outstanding.  You could easily print an 8 by 10, and really even greater but my printer doesn't get that big.Bottom line...I love it, and the price has dropped 250 bucks since I bought it, but I would buy it at the same price if I had to do it again.", "Date": "September 27, 2002"}, {"Title": "cool features, great pix, too long lag time to shoot", "Author": null, "ReviewID": "RGI8KUBRUKFRC", "Overall": "4.0", "Content": "I enjoy the camera quite a bit, it is user friendly, has great features, but the long lag time from when you press the shutter button to when the picture actually takes means you miss quite a few great shots and get the bad ones seconds later.  I have to e xplain to people when I take their picture to not move for several seconds after I press the shutter. Thus candid shots stink.", "Date": "April 10, 2002"}, {"Title": "great quality  photos, poor battery management", "Author": null, "ReviewID": "R3VG55RA4VWCJD", "Overall": "3.0", "Content": "The quality of the photos that we've taken with this camera have exceeded our expectations, but it has two problems.  The response time is slow and the battery management has been poor.  On a number of occations, the camera has indicated a low-battery condition and refused to take a photo even with newly charged batteries.  We close the camera, open it, and then it shows a fully charged battery - but we have missed the photo op.", "Date": "September 26, 2002"}, {"Title": "Great Camera for size and price", "Author": "Cruising \"Cruising\"", "ReviewID": "R1SE0SGFWQRFMI", "Overall": "5.0", "Content": "I had a 2.1 megapixel Epson for over a year and upgraded to the D-40. Pretty good battery life compared to other cameras - but still goes through batteries <frown> when using the LCD (to be expected). Everything else top notch, including menus and ease of use and size. Bonus - it comes with Adobe Photoshop Elements - full version. That makes it a real steal!What I wish it came with, AC/DC adapter... Other then that - this is one of the best buys I have seen.", "Date": "December 28, 2001"}, {"Title": "Terrific, easy to use camera.", "Author": "H. Cassell", "ReviewID": "R21CPPFBJXKPL4", "Overall": "5.0", "Content": "This was my first digital camera, which I used constantly for the three years I owned it. I loved it and I shouldn't have been so eager to \"upgrade\" (I recently, and foolishly, switched to the Sony T1). This is a fantastically easy to use point-and-shoot camera that takes fabulous photos, up to and probably even beyond 8x10. It's friendly in low light conditions, at the beach, in the bright white snow, and just about anywhere a person would want to take their camera. Action pictures turn out great. The flash is strong. It is light, compact, and very sturdy. The picture taker's hands don't have to be deathly still to take a killer shot. The lense stays closed. The batteries are AAs--YAY! (I'm amazed at these features I took for granted because my T1 lacks in ALL these areas, much to my chagrin.) For the price this camera is being offered at on Amazon, you can't go wrong, even if they are used. You won't be disappointed with the D40.", "Date": "June 25, 2004"}, {"Title": "A near-perfect digital camera", "Author": "hiker999", "ReviewID": "R31LIPHCXFKFE9", "Overall": "5.0", "Content": "A terrific quality camera overall.  Just a few gripes:1)  Eats batteries fast.  If you use the viewfinder while you take shots, some regular Duracell or Energizers will last 15-20 mins tops.  Results are much MUCH better with Lithium batteries such as the Energizer E2.2)  There is a somewhat lengthy delay between pressing the button and capturing the shot.  I've missed some good shots on a couple occasions because I was too late on the trigger.Overall though, these are minor gripes that are more than made up for by the quality of the pictures this thing takes and the fact it is tiny enough to COMFORTABLY fit in your pocket.  Highly recommended if you are looking for a top-notch camera thats easy to lug around.", "Date": "November 2, 2002"}, {"Title": "Finally A Compact Digital Camera Worth Buying", "Author": "Mad Dog \"maddog6969\"", "ReviewID": "R35TDM5SQ9RU7Z", "Overall": "4.0", "Content": "My wife and I have shopped the smallest digital cameras for a few years and for one reason or another have never been able to take the plunge.  Maybe part of it is that we've been using higher resolution, more fully-featured digtal cameras and have been unwilling to accept the compromises of their smaller siblings.  But finally, I've found the camera for us - small enough to stay in my wife's purse or clipped to my climbing harness, yet flexible and high quality enough to not make us cringe when the images are printed.The D-40 shares the strengths common to Olympus cameras: excellent optics, flexibility of operation, high quality of manufacture and excellent image quality.  Unfortunately, the major problems common to older Olympus digital cameras are still existant: mediocre software, a non-rechargable battery and a tiny media card.  The D-40 lens is excellent for a camera of this size and price, resulting in superior image sharpness, even at the wide angle limit where most consumer digital cameras suffer.  It's zoom range is equivalent to 35 to 98mm on a 35mm camera and the aperture is f 2.8.  The camera weighs under 7 ounces and it is tiny, easily fitting in a shirt pocket.  Standard AA batteries will work with the D-40 if the standard lithium battery dies and you can't find them locally.  I'm psyched up that we'll be carrying a camera with us to more places.  We've missed too many photo opportunities since moving from film to digital.  Our bottom line is image quality and for a compact camera, the D-40 delivers.", "Date": "August 26, 2002"}, {"Title": "A great, if dated, choice", "Author": "Mistypaw", "ReviewID": "R17GHHYNLJY1U4", "Overall": "5.0", "Content": "I'm a budgeter, but I also really wanted all the cool manual features and eveything. The D40 suited up perfect. Yes, 4MP may not seem much compared to what's out there now - but I figured, when am I ever going to print anything larger than 8x10 anyway? 4 MP was perfect for me, more would be a waste.As i said, the features are all there. Choose your own shutter speeds and apetures, white balance, video (yes, the vid sux, but that's true of most cameras. Same as digital video cameras take sucky stills. Give it a few more years you might be able to get a really good true hybrid. But i'm not waiting that long.) The only feature I can think of that I've really missed was no hotshoe for a bounce flash. It does have a tripod mount.It's also a great point and shooter, with several pre-sets. So you can use those and if you decide you want to be brave and try out other stuff, that's there too.It takes AAs, which if you get rechargeables and if you don't use the LCD screen can go for quite some time. I was once old school photography, so the viewfinder feels better to me anyway.The one major flaw I heard of before buying was that if you shoot an extremely high contrast shot you might get some violet bleed. In the few years I've had this camera, I've yet to actually see that happen. And even if it does - it's easily corrected in photoshop.My last thing to point out is it IS dated. The memory cards it uses are a thing of the past that you will mostly likely have to hunt for or buy online. I bought myself 4 cards, which will last me several hundred pics, which is more than I exspect to ever have to shot at one time.Oh, another thing I really liked - it's size was perfect for me. The tiny ones always seemed to flimsy and it gets hard to hold the camera right if it's too light or heavy. This is not a wallet or slim shirt pocket camera. But it will fit in a pocket or purse quite nicely.Overall, for the price, it is an excellent little camera. Does everything I could ask for, and despite the world moving on with more technology I still have yet to feel the urge that i'm missing out on anything.", "Date": "September 27, 2006"}, {"Title": "Worked well while it lasted...", "Author": null, "ReviewID": "RXGHZSFR7QMNE", "Overall": "3.0", "Content": "We bought this camera (actually the European version C-40 Zoom) after doing lots of research, and loved it.  It was easy to use, had awesome picture quality, and even made short mpeg movies.  However, when it was about 10 months old, we had a problem where it wiped one of our smartmedia cards, so we lost a few photos.  We sent it away for checking, as it was still under warranty, but they found nothing wrong, and we didn't have the problem again.However, when the camera was 15 months old, it failed completely.  It was no longer covered by warranty.  We spent a LOT of money on this camera, believing you get what you pay for (and I guess it was great while it worked), and were very unhappy that this occurred.  At the time of writing this review, we have yet to send it away to see how much repair would cost, but have been told by Olympus that we'd probably be better off buying a new camera.  If that's the case, it won't be an Olympus!", "Date": "September 13, 2003"}, {"Title": "Wow!", "Author": "Edward W. Giroux", "ReviewID": "R24MO69BO75ECK", "Overall": "5.0", "Content": "I'm always a little leary when buying over the internet. I've got burned before and ordering a digital camera was a big ticket item for me. I have learned that there are three things that I look for to raise my comfort level. Price of the product, condition of the product and communication about the product. The purchase of the Olympus Camedia D-40Zoom was all great. I got a good price on a great little camera that is all the seller said it was. I received E-mails at every step of the delivery process and it showed up exactly when promised. I'LL BE BACK!!!", "Date": "July 10, 2003"}, {"Title": "A Very Good Camera", "Author": null, "ReviewID": "R3UZE5FCF061UQ", "Overall": "4.0", "Content": "I've had my Olympus Camedia D-40 for almost a year and I'm very happy with it. I bought it for the combination of small size, sharp  lens, and plenty of manual controls. It's also an advantage that the camera uses only two AA batteries. I have four NiMH rechargeable batteries so I always have a spare set. The battery life is good if you don't use the LCD screen all the time. I use the optical viewfinder for most shots, except when I need more precise framing for close-ups. I have a 128 MB memory card, but 64 MB would be sufficient for most people. If you find one of these cameras on the used market, I suggest that you buy it.", "Date": "May 24, 2003"}, {"Title": "battery recommendation", "Author": "Julie G. Cooke \"skyamese\"", "ReviewID": "RRCKCYPYWBBB3", "Overall": "4.0", "Content": "I too ran into problems when I tried to use fresh AA alkalines.  The new Engergizer e2 lithium photo batteries worked very well for me.  Lasted for my whole week-long vacation.  I've been using two AAs, but they also have a CR2 model which might work as well.As for the camera itself, it works wonderfully and it's pretty easy to use.  My photos look great and I get very nice quality prints through an online service (ofoto).", "Date": "October 3, 2002"}, {"Title": "sweeeet!", "Author": null, "ReviewID": "RI8U0YB8UDV3W", "Overall": "5.0", "Content": "I've had this camera for two weeks.  Its great.  I use 1800mah NiMH batteries and I don't have much problems with the camera draining the batteries.  Compare to my other digital camera (Nikon 775), I like this one much better even though the nikon has a better macro mode.", "Date": "July 29, 2002"}, {"Title": "Small, but some draw-backs", "Author": "\"christine500\"", "ReviewID": "R3TEWCVX8MPTR6", "Overall": "4.0", "Content": "I have owned about 4 digital cameras so far, and this one is the smallest by far.  While I like it's size, there are a couple of things I do not like about this camera:1: I do not care for the smart media format.  Not enough memory.2: The zoom is not big enough3: The colors are a little reddish4: The LCD screen is too small, making it hard to judge if you made a good picture worth saving or notEventhough it has these drawbacks, it is still a nice camera that will get used a lot because of it's size.  The noise reduction feature works well, which is a definate plus if you plan to make a lot of pictures at night.", "Date": "August 6, 2002"}, {"Title": "Bought a second one already", "Author": "G. Kohl", "ReviewID": "R1GL6Q6BL0JGZN", "Overall": "5.0", "Content": "Our first D-40 and an older Riccoh digital were stolen along with our carry-on bags on a recent vacation.  We promptly replaced both cameras with 2 more D-40s!  Checked out the D-50 and decided we didn't need the extra resolution.  Checked out bigger zooms and decided to crop and blow-up shots with the computer instead of having to carry a larger camera.  Have an 8x10 of our dog's head that was cropped via computer and you can virtually count the hairs [printed on an Epson with good paper & ink].  Got MAHA batteries and a charger for longer battery life.  Have Adobe Photoshop Elements and found the software that came with the camera to be plenty adequate for most purposes.  Like having all the settings available for when you need to tweak a shot, appreciate usually not needing to.  Love dropping it in a pocket-which is where they'll get carried on our next trip!", "Date": "December 5, 2002"}, {"Title": "Olympus D-40", "Author": "Ellen Mcgovern", "ReviewID": "R2DVSVML5K8SC7", "Overall": "4.0", "Content": "I really like this camera.  It is very easy to use, and small enough to fit in my purse or fanny pack. I take it every where!It is also easy to transfer and print or e-mail pictures.  I usually carry an extra set of monster rechargeable with me, but don't usually need them.", "Date": "November 11, 2002"}, {"Title": "Beautiful Compact", "Author": "Terry M King", "ReviewID": "R73Q4ZB6I9IVW", "Overall": "5.0", "Content": "I recently purchase this camera after selling my nikon coolpix 880 which was more camera then I needed.  I purchased the camera because I needed something small that would fit in my pocket with much of the features of my 880 or else It would say home.  After lots of research I decided to purchase the D40 this is a beautiful little camera that takes exceptional pictures. I love the D40 and I take it every where I go. It has all the features that you need in a compact size. It is very intuitive I didn't even have to use the cd manual once. I don't have a problem with the batteries but I do plan to buy some 1800 mah battteries soon.  I highly recommend this camera for people like myself, who don't like to lug around big camera's but want all the features in a compact size.", "Date": "March 19, 2002"}, {"Title": "User Friendly", "Author": null, "ReviewID": "RKHBC4WPM6NX6", "Overall": "5.0", "Content": "I used this item within 2hrs of recieving it by mail.  It works very well with Windows XP My Pictures Format.  I do agree with others who rated this product and found the instruction booklets somewhat confusing, but the product itself is remarkable.  The Photo quality is excellent.  Transfer to PC was reasonably simple if you remember to disarm your Firewall/Virus software first otherwise the process takes a little longer.", "Date": "July 12, 2002"}, {"Title": "D40 Zoom is Great!", "Author": "cathy", "ReviewID": "RCCQYOYB0YHFY", "Overall": "5.0", "Content": "Bought the D40 Zoom....absoluuutely love it!  It is almost impossible to take a bad picture....from macros to landscape...the colors are vivid and images sharp.  Every time I take a picture, I cannot go without saying aloud, \"I love this camera!\"  Totally awesome!", "Date": "September 13, 2002"}, {"Title": "Awesome", "Author": null, "ReviewID": "R1ZWESKRQP56OJ", "Overall": "5.0", "Content": "This camera is great. With the addition of a 128mb, you can stores countless pictures. FOr myself I dont really need the high quality pictures, but you could probably make them poster size with the size of the high quality settings. Many special affects. The movie feature, is great , it also captures audio. You can also play back the movies on the camera. Battery life is great. The only minus for myslef is the movies are recoreded/stores as .mov's. I would much rather mpeg, that way you can view them with downloaded quicktime. Anyways, great product.", "Date": "August 1, 2002"}, {"Title": "Olympus d40", "Author": null, "ReviewID": "R3JXNLQQCNSFNS", "Overall": "5.0", "Content": "I bought this camera in June and immediately went on a 6 week vacation, thus I did not have time to learn how to use the camera.  I bought 3- 128mb  memory cards plus the  Olympus carrying case. I obtained  1700 mah NiMh AA batteries and charger.  I used the camera in automatic position and kept the batteries just in case I ran down the camera batteries.  I got 468 terrific photos ,almost never ran down the batteries in a days shooting and found the carrying case saved my camera from a rain storm.When I got home I plugged the camera into my Windows xp computer and did a copy and paste from the camera to the computer  hard drive. The photos were amazingly beautiful and accurate in both bright light and at nite.  So whats is wrong with the camera.  Perhaps the battery situation could be improved as to  battery life, the camera might be better in a metal case and  .5 inch longer, the slight time delay in shooting could be shortened.But realistically this camera is fantastic and fits in you shirt pocket.", "Date": "August 15, 2002"}, {"Title": "Great Camera. Overall very pleased", "Author": "cyber kid", "ReviewID": "RG4OIHEBEQFJ4", "Overall": "4.0", "Content": "This is a great camera. Tiny for all that you get. The battery life is a limiting factor but it is managable.  Just be sure to pick up the latest 2300mAh Ni MH rechargables.I have only 2 complaints so far.Most disapointing is while shooting movie clip with sound you will record the cameras internal noise. I believe it is the sound of the motor from the auto focus.Also being that I have the C40zoom (the Japanese equivalent), since it does have a quite complex menu system mine is tough to navigate due to my poor japanese ability.Also after 2.5 years with this camera, aparently a tightly pack internal ribbon cable is beginging to split, The price of the new shutter module, $25 from Olympus, its just a tiny ribbon cable..anyway, this was a great camera in its day.", "Date": "February 5, 2002"}, {"Title": "MAC USERS- powerful little camera that works great!", "Author": null, "ReviewID": "R10FHQJKPF2A91", "Overall": "4.0", "Content": "This is my 2nd digital camera and i wanted something really small because my first one was too bulky to carry around. I looked at a lot of cameras and was torn between the Canon Elph and this one. These are the only two mini cameras that I found that record sound in the video clips. I am very happy I went with the Olympus. My main reason for choosing it is its ability to run on AA batteries. With the Canon, you are stuck with their battery and if it runs out when you are out on the beach, or whatever- too bad!This camera is easy to use and easy to play back on the tv too! For mac users- i was very cautious about finding a camera that would work without problems on my powerbook. It works beautifully!!!The only reason i gave it 4 instead of 5 stars is that the batteries drain fast!!! I knew this would happen and i thought i knew how it would be (my Kodak went through batteries quickly too), but it is MUCH worse than i thought! Also, it sometimes doesn't work with certain aa's. It works great with the type of battery it comes with. The best part is all the little features. It gives you all kinds of control over color, size, and much more! And the images are so large that you can blow them up and re-touch them.", "Date": "January 15, 2002"}, {"Title": "Best Compact Digital Camera....", "Author": null, "ReviewID": "R2ZFLN7FC7GNDT", "Overall": "5.0", "Content": "Great Pictures, Great Zoom, lightweight...one bad thing:  it drains batteries FAST...rechargeable batteries are a MUST.", "Date": "July 24, 2002"}, {"Title": "Great Camera [...]!!!", "Author": null, "ReviewID": "RDJ8Y64FJ0RX9", "Overall": "5.0", "Content": "I purchased an Olympus D-40 from [website] in October 2002 and am very happy with the camera in every way. [...] I recommend buying an Olympus D-40, [...]", "Date": "October 20, 2002"}, {"Title": "It's very  frustrating", "Author": "I. Chiu \"socalguru\"", "ReviewID": "R2YGNOMH22PP15", "Overall": "3.0", "Content": "The camera is small and compact. The resolution is great and if you buy extra memory it can hold tons of pictures. But...sometimes i want to just use a disposable camera because this one is soooo frustrating.  The auto-focus takes forever, so many times, you miss \"kodak moments\" because the camera isn't ready to shoot.  When you have the display screen on, it sucks up the batteries.  You can't view pictures right away unless you close the lens...which takes forever. Little things like this are very frustrating.  And the dial for photo settings is so convenient that it often moves without you knowing so your settings will be off and you get a messed up picture.  I'm no camera genius, i know how to use all the functions but this camera really tests my patience and i've missed alot of good shots.  It's not just point and click like many other cameras i've used.", "Date": "September 16, 2003"}, {"Title": "GREAT DIGITAL CAMERA!", "Author": null, "ReviewID": "RV0HC61BOMQ1B", "Overall": "5.0", "Content": "WHAT CAN I SAY!!!!! IT'S A GREAT LITTLE CAMERA. THAT FITS ON YOUR PALM... HIGHLY RECOMMEND...", "Date": "October 22, 2002"}], "ProductInfo": {"Price": "Unavailable", "Features": "4 megapixel sensor captures 2,288 x 1,712 images for prints at 11 x 14 inches and beyond\n2.8x optical zoom lens with autofocus\nIncluded 16 MB SmartMedia card holds 16 pictures at default resolution\nAutomatically connects to Macs and PCs via USB port\nUses LB-01 disposable lithium battery (included) or 2 AA batteries", "Name": "Olympus Camedia D-40 4MP Digital Camera with 2.8x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51GVTD64W5L._SX300_.jpg", "ProductID": "B00005Q7DG"}}