{"Reviews": [{"Title": "Good camera - Great value", "Author": "Penny Wise", "ReviewID": "R1QNSJ1YZRQ6Z", "Overall": "4.0", "Content": "Update: May 2006 - Still have and use the camera frequently.  I've also learned that you can take movies and the HP share tools will let you extract still pictures out of the video...very cool.  I will agree with the review after mine that the camera doesn't feel sturdy but it fits in your pocket, so there really isn't a need to pack it in luggage.  Plus, no matter who made your camera you probably want to shy away from dropping it on the floor.I didn't buy this camera from Amazon, I got it at an after Thanksgiving sale at Staples, but I am very impressed with it.  It's about the least expensive 4MP digital camera I could find and it takes very good pictures.Downloading photos is a quick process, about a second per 4MP photo, and the HP instant share tools that come with the camera make it easy to edit, e-mail, and print the pictures.  There is a video with sound feature on this camera that is about average but it appears to record video for as much as the memory can hold.  I currently have a 64MB card in the camera and I can film video for three minutes and I see that as a big positive for this camera.I would second the previous review that you will need to buy additional memory if you want to shoot more than 20 pictures in 4MP in between downloading them but that is the only thing that keeps me from giving the camera five stars.", "Date": "January 1, 2006"}, {"Title": "HP Photosmart E217 Digital Camera", "Author": null, "ReviewID": "R1YRO8MEVWOCCY", "Overall": "4.0", "Content": "Very nice Camera. Good zoom and display. Easy navagation. Not a very big built in memory. I recomend you buy a memory stick for it. It only holds 16 megs. and 33 photos at the most. Otherwise it is a great camera", "Date": "December 28, 2005"}, {"Title": "Not for the real world - get a Kodak", "Author": "R. Trotter", "ReviewID": "R27YD8WG8U8BY4", "Overall": "1.0", "Content": "I recieved this camera for christmas.  A month later, I dropped it about a foot onto a carpeted floor and it stopped working.  I was told by HP that I could get it replaced if I bought a accidental replacement warranty.  The thing is my 6 year old has had a Kodak digital camera for over a year which has been dropped on linoleum, hardwood floors and even concrete - from far more than a foot.  Heck, I suspect it went flying through the air before hitting the floor a few times.  Yet we've never had any problems with it.  My HP gets bumped and now it won't work?  I wouldn't even feel comfortable packing the thing in luggage for a trip!  A bumpy road might do it in.  Also, my brother recently get sand inside his new Kodak after taking it to the beach.  Kodak found sand inside the darn thing when they opened it up but they replaced it free of charge for him.  No additional warrenty needed.  Before it went kaput it worked fine, although I wish it had a view finder.  However, I recommend to you and to everyone you know that you buy a Kodak.  They're good cameras, they stand behind their products and they sure a heck of a lot more durable than HP's are.", "Date": "February 9, 2006"}, {"Title": "Didn't last a week!", "Author": "Proud Daddy", "ReviewID": "RUS19WLM65QAL", "Overall": "1.0", "Content": "I purchased this camera becuase I needed something for  a weekend.  The pictures initially were excellent.  I accept the simplicity of the camera due to the cheap purchase price.  However, the standard AA batteries wore out in an afternoon.  There is no rechargeable option.  Within a week, the camera was taking blurry photos with strong black vetical lines.  I did not drop this camera or mis-treat it in any way.  Additional problem, video clips didn't download with a usable sound track.", "Date": "June 14, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "4 MP effective resolution - 2048 x 1536 effective pixel count\n16 MB internal Flash memory - 1.5-inch Color LCD\nSlot for memory card; Secure Digital (SD) or MultiMedia Card (MMC)\nFixed focal length: 7.7 mm, 35 mm equivalent (approximately 36 mm)\nBuilt-in flash:  1 to 6 second recharge-", "Name": "HP Photosmart E217 4MP 4x Digital Zoom Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/21FGQERHFBL.jpg", "ProductID": "B000BYSUO8"}}