{"Reviews": [{"Title": "Not a DSLR! Specs look good, image quality varies based on settings...", "Author": "Michael Gmirkin", "ReviewID": "R1WC8A3S05T053", "Overall": "5.0", "Content": "I've been looking for a new camera to replace my Canon A70 (3MP w/3x optical zoom) for some time. I was looking for a camera that was as portable, with a significantly higher megapixel rating, and a much better zoom. But I also wanted it to have as simple a button layout. I also wanted to avoid breaking the bank.So, I've been looking at a number of mid-range cameras currently available on the market. Most of the Canons I looked at have opted for more complex button layouts. I liked my old Canon, but was not willing to trade complexity for performance. Many of the other models such as Panasonic's Lumix (or even Sony's H7 and H9) are considerably more bulky, thus not as portable (as they can't be slipped into a pocket). Many of the smaller cameras also came with a smaller optical zoom rating (opting to use digital zoom which really only degrades image quality).The Sony H3 has thus far been my favorite camera available at this time. The button layout is simple, as are the two main menus. I love the 10x zoom (with which I've consistently been able to zoom in across a room and get a clear picture of the \"writing on the wall\"). The more I play with it, the more cool features and abilities I seem to find. I've been quite impressed with its anti-shake image stabilization, and its sports feature which seems to let you capture objects in motion without a lot of messy blur. I even found that I could take pictures while the camera was panning slowly and have the images come out without too noticeable of blur. In a few cases, I even still got legible print on signs, etc. I rather like the in-LCD mode wheel reminder that lets you know which option you've just switched to on the jog dial, and what that mode is good for. In all, this is a great little camera. I haven't had a chance to test it out in low light situations, but I've heard that it does relatively well (with perhaps a bit of image noise in lower light, higher sensitivity settings).Over all, a nice, nice camera!That all said, I'll add a few caveats:1) This camera does not have a viewfinder, rather only an LCD. Personally, I've never had a problem with LCDs, but some may be put off by the lack of a viewfinder under certain situations (or, so I hear).2) This is not a DSLR. It's not intended for \"professionals.\" So, don't expect a professional level camera. This seems to be designed for the high end hobbyist / casual photographer, and does quite well for what it is, as far as I can tell, thus far.3) This camera uses Sony's Memory Stick Duo or Pro Duo memory cards, which is slightly proprietary (though several companies manufacture cards of this type), so it seems to be slightly more expensive than competing SD cards. But, if you're willing to pay a few extra bucks for the cards, I hear they tend to be pretty good quality (especially the Pro cards, which have a faster access time).So, as long as you don't expect \"pro\" features, you won't be disappointed. If you come from lower end digital cameras and are upgrading, you'll probably find this to be a nice machine for you. I'd still recommend going to your local brick and mortar store to actually handle the various cameras, try out the zoom, try out the movie feature, see how they all feel in your hand, see how the different cameras fare on moving subjects, or with hand shake, or a moving camera. I think the H3 stacks up well against the various competitors in the mid-range space.I would not even object to someone lightly calling this camera \"revolutionary\" insofar as it takes the camera into the extreme zoom (10x+) market, gives it a high megapixel rating (8MP+) and manages to put it into the \"portable\" camera market as well (only slightly larger than my old Canon A70)... It seems like the best of several worlds. In my estimation, the best of breed at the moment, and a unit to emulate, for future Sony models and for other brands to copy.----------Addendum (10-11-07): Finally received mine yesterday, and started playing with it under \"real world\" conditions. It's held up pretty well. Had to figure out which were some of the better settings to use in our house at night (not the best lighting). I noticed that under lower lighting conditions, some of the modes are a bit harder to keep \"steady\" and avoid blur. Though, once I turned on anti-shake, and multi-point face recognition, it seemed to do better. Likewise when putting it on the low-light portrait setting. It was still necessary to keep it more steady than under bright lighting conditions.Still testing it out, but have generally been quite pleased with performance. As expected!----------Addendum (11-20-07): Actually, now that I've found out the ^ISO (high ISO) jog dial setting (in combination with playing with some of the settings for lighting type, etc.), low light photography seems to be pretty easy (found out I'd been putting it on the wrong setting by accident). Still a good idea to keep the camera steady on general principle, of course.----------Addendum (11-29-07): Well, I'd promised to review the image quality once I'd had a chance to download some photos and view them on my machine at full resolution.To be quite honest, I may have to slightly revise down my estimation of the camera on the basis of image quality. I've downloaded a number of photos from the camera, and while they're \"large\" and \"high resolution,\" honestly, so far they've been lacking. Considerably more than I'd expected. Granted I've mostly been shooting in low light w/o flash, and I've heard that on an automatic setting it can up the ISO which leads to more noise in the image. My experience is thus far consistent with that assessment. However, I took a few shots with flash on the full auto setting for comparison. There was a higher quality level to those images, but they still didn't live up to what I would expect to come out of an 8MP digital with a 10x optical zoom, image stabilization, etc.Specifically, my gripe is with definition. With an 8MP sensor and a high power zoom with a good lens, I'd expect some pretty darn crisp images (but maybe I just have an unreasonable expectation?). For example capturing definition and details in hairs when zoomed in on a head shot. So far, this has not been the case at all. It appears that the images either don't capture sufficient detail, or somewhere in the processing the detail is removed. I mean, I'm starting to wonder if the camera processes the raw image by applying whatever filters are set up and then by saving a highly \"compressed\" version of the image to get a better # of pictures out of a memory stick, while sacrificing image quality. If so, I hope there's a way to turn off the \"compression\" and restore original image quality...Honestly, when I zoom in on the image, it appears to get rather blocky, some would say \"noisy\" and there is a lack of definition between elements in the picture (such as between fingers, or between fine locks of hair). IE, the blockiness seems to overlap the region where there should be definition.If there is a setting for Standard, Fine, Super-Fine detail level as there is with my old 3MP Canon A70, I've not yet found it with the Sony. Perhaps I should read the manual again just to make sure I'm not overlooking something crucial. But, if the images I've seen thus far are representative of the standard quality I can expect from this model, then I may have to grudgingly start my camera shopping search over again. I hate the prospect of having to either trade the simplicity of the Sony for better image quality but more complexity and bulk to say a Canon or a Panasonic Lumix, or trade down in optical zoom rating (as the extended optical zoom was one of the key features I was looking for in a replacement camera).I might also point out that the camera does not utilize the standard mini-usb cable connector, opting for a proprietary cable that connects both to USB and to AV out cables. The connector worries me, as it seems \"loose\" when connected and feel flimsy, so I worry about breaking it if I'm not ginger enough with it. Likewise the memory stick pro duos it uses rather than the cheaper more ubiquitous SD/SDHC or some similar thing.If I find anything more out, I'll add yet another addendum...----------One more addendum (12-19-07): Okay, I've done a lot of reading over the last couple weeks. Specifically,I was considering upgrading from the Sony H3 to the Canon PowerShot G9. So, I read a lot of camera comparisons and reviews. I even learned a few things! From what I've learned, I can tentively say that some of the issues stem from the specific settings used. Low ISO settings seem to let light in longer, but can lead to more \"shake\" blur issues. High ISO settings leave the lens open for less time, thus eliminating camera shake issues to some extent (in combination with anti-shake technology). However, the higher the ISO, the more noise tends to creep into the images.That said, image quality may vary greatly with settings and/or with \"user malfunction.\" IE, learn how to use your camera well and it will love you for it and give you great images. After taking the camera off automatic (sans flash), and setting the ISO to 400 (often a good middle ground, I've found), I was able to take relatively good quality images in non-optimal light conditions (indoors with uneven lighting). Whereas if I dropped down to 80-100 ISO, I tended to get too much blur. If I hopped it up to 800, 1600 or 3200 ISO, I usually got little or not shake, but the images were much more noisy with color aberrations.Apparently I've a bit of a learning curve for digital cameras. All told, I haven't yet done much experimenting in \"optimal\" (outside, natural) lighting conditions. Most likely those shots will come out well on \"auto\" settings. Likewise, ISO 80-200 shots in most situations would come out best on a tripod.I am still upgrading to the Canon G9, though no longer due to image quality issues per se. Now it's simply for the RAW support and for the 12 MP images. Plus, as I may have mentioned earlier, I previously owned a Canon A70 that I loved to death (well, not to DEATH, as I still have it and it works beautifully). It was a solid machine and always delivered top quality images, especially on its high end 3MP resolution and super-fine quality setting. I just bought the G9 last night, and generally like its layout, despite being slightly more complex. It also feel properly weighty and rugged in my hand. I think I'll enjoy the switch.So, long story short, know thy camera! The H3 does seem to be an excellent little camera, once you know enough to properly use it. Or, so long as you use it under optimal lighting conditions (or know how best to compensate for non-optimal lighting [with either a flash or the ISO settings]). For a point-and-shoot, it's at a good price point, and has plenty of features, plus, the zoom is excellent, and the pictures come out well when taken properly.", "Date": "November 12, 2007"}, {"Title": "FANTASTIC!!!", "Author": "J. A. Parkyn", "ReviewID": "R21GGIHBHZ7PMS", "Overall": "5.0", "Content": "I purchased this camera last week and am already blown away!  This camera was to replace a previously purchased DSC-H2 - while I loved that camera, the delay time was unacceptable - not to mention design flaws causing the shutter button to need to be replaced more than once on two of the H-2's.I was skeptical in purchasing another Sony since having the above experience w/ the H2 - I tried an Olympus and a Fuji - neither could hold a candle to the Sony's picture quality -so, back to the store those went and I decided to roll the dice on another Sony...I just couldn't get over the saturation of color and the crispness of the photos you get with the Sony and Carl Zeiss lens...not to mention the advanced sports mode ( I take alot of action pics )  All pics come out spectacular and clear!  This camera also has many programming features - I especially like the face detection and the \"soft shot\" mode.For a 10x zoom - this camera is TINY!  I was concerned with the size, but Sony made it happen and it's quite an impressive little gadget.I'd recommend this camera - it was a good find and a good buy for me...hopefully this will end my perpetual hunt for the perfect point and shoot ( I think it will! )", "Date": "October 12, 2007"}, {"Title": "My Favorite Camera Ever!!", "Author": "lloraine", "ReviewID": "R3BEV6WZVGVW2G", "Overall": "5.0", "Content": "This camera is great in low light. I shot pictures in an auditorium with regular stage light in \"High Sensitivity\" mode and was able to get 4x6 prints of people (as long as they weren't moving too much) without a tripod and WITHOUT a flash! I did use the 2 second timer so I could hold the camera still while the shutter went off.I also love the macro setting. You can focus on your subject less than an inch away.I like the \"Advanced Sports Shooting\" mode, but I've actually gotten better action shots by putting the camera in \"Manual\" and setting it to the fastest shutter speed possible. The other advantage of using \"Manual\" is that you can use the  flash.Speaking of the flash, I absolutely love the quality of light from this flash. No blown out subject in front of a black background. There's even a setting for the flash called \"keep subjects and distant background bright\" that keeps the ambient light even brighter and makes the picture a lot more natural looking.The picture quality is amazing!! I haven't done any enlargements yet, but when I zoom in on the computer screen, a lot of my shot seem to be as clear as my SLR shots!The only problem I've had is that there are a lot of buttons on a little camera so every once in a while I accidentally hit the dial or a button and have to re-set it. But having said that, I definitely wouldn't trade this camera for one with less settings. It's well worth having to watch my fingers more closely.All in all I'm very happy with this camera. It's by far the best point and shoot I've owned.", "Date": "October 14, 2007"}, {"Title": "Great camera", "Author": "David M. Wagner \"dWag\"", "ReviewID": "R2WPBU2F7PX6XM", "Overall": "5.0", "Content": "I am amused by all these people who say that the flash is too bright on this camera. They haven't figured out that there is a menu setting for turning down the flash intensity. DO NOT BE AFRAID TO TAKE THIS CAMERA OUT OF AUTO MODE! In the Program AE mode, fantastic indoor pictures can be had by pegging the ISO setting on 100 and turning the flash intensity (EV) down a few tenths of a point. In automatic mode the flash will be too bright. Auto mode is great for outdoor shots but indoors requires a little bit of fidding with the settings. The only situation where this camera doesn't take brilliant pictures is in a twilight setting, but that is hardly a complaint, most cameras stuggle in areas where the lighting is not bright enough for flashless photography, but too bright for the flash to be effective.In addition to the excellent picture quality, this camera offers one of the best macro modes I have ever used. I recently went to the local public aquarium and was amazed by some of the close up shots of fast-moving fish I was able to capture. All of this in a camera so small! I am utterly amazed by this thing. The focus speeds are nearly as fast as the DSLR's I have used in the past.My only complaint thus far is with sony's memory sticks. The first one I bought had to be returned because it would not record pictures. This is hardly a fault of this fantastic camera though. Well worth the money! I will post some shots in the product gallery for potential buyers to browse.", "Date": "January 16, 2008"}, {"Title": "No yet ready for prime time...", "Author": "Amazon Customer \"MontWat\"", "ReviewID": "R21927N7ELDSCZ", "Overall": "3.0", "Content": "This camera take o.k. pictures but I do not recommend it esp. for the price. See reasons below0. I bought this mainly because I wanted it for the face detection. Well the faces are invariably over exposed in the auto mode which I use 90% of the time (just like every average user) just like they are with my 4 year old dsc w7. Who has the time to set all the settings when you are trying to capture a moment when a 3 year old is doing something cute?1. The image quality is suspect when you view the picture on the computer zoomed 1:1. There is alot of noise (or color artifacting). I did a series of comparison tests with my much older sony dsc w7 camera ( a great camera by the way, I bought the h3 thinking it must be even better!). The images taken by the older camera are better than the h32. This is not a DSLR so why did sony do away with the automatic lens cover? This makes it a royal pain to remove the lens cover each time by hand and put it back on3. This camera uses the proprietary sony battery. Yes, maybe this lasts a little longer but other non slr camera use AA batteries. If you use rechargeable 2700 mah AA battries, those last for atleast 300 shots. And if you run out of juice, well you can always buy AA batteries anywhere. If you are like most people, the battery will run out of juice just when your kid gets on stage or when you are posing in front of the golden gate bridge.4. The cable to connect to the computer is unqiue unlike the dscw7 alluded to earlier which used common usb cable. Where do I go except to Sony to buy a second cable to use to download some pictures at work? The cable looks like it can be easily damaged because it locks into place and  if you forget and pick up the camera, it can damage the camera itself. The USB cable would just pop out5. The number of clicks you need to do to delete a picture is about 5 or 6 which is a lot of clicks compared 3 in the dsc w7. Also in the dsc w7 the delete option stayed highlighted so you could delete all the picture you wanted after  the first one with a click. On this it reverts to OK after each one and you need to do a couple of extra clicks. It is annoying to do this.6. The first h3 I got had a glaring defect in the camera lens visible to naked eye. What kind of quality control is being done. If Sony did not catch this, I wonder what else is wrong inside that I can't find with naked eye?7. And the pop flash is annoying too. In the dsc w7 you hit the power off button and that was it. In the h3, first you have to push the power off, then you have to put the lens cover back on by hand and then you have push in the flash to retracted position by hand. It is very annoying.", "Date": "November 29, 2007"}, {"Title": "I'm very disappointed with this camera...", "Author": "Madison's Mommy", "ReviewID": "RRRF4701FDUJ5", "Overall": "2.0", "Content": "I have always been a fan of the Sony cameras.  This camera however, has made me change my mind.  First of all, I LOVE to take pictures, and I have never had a problem with my camera's.This camera takes horrible pictures.  Most importantly, my camera never focus's properly.  If my child even moves the slightest bit, the pictures come out blurry and often lead a \"trail\".  I am also noticing a very yellowish tint to the majority of my photos, which shouldn't be happening, as it does have a very strong flash.  The main problem is, that after I take the picture, it looks good on the LCD screen, but the second I transfer the pictures to the computer you can see the blurred pics and the yellow tint.After playing around with multiple settings, taking pictures of still objects as well as my children and adults, and using the camera both indoors and outdoors, I have come to the conclusion that my camera is defective.When I spoke to a technician about this, they blamed my computer.  I told them that I found that to be pretty amusing, since my OLD camera's pictures were very clear.  Not to mention, if you print the pictures they are still blurry and yellow... hmmmm...Just be aware before you buy.  I have read other reviews from different sites, stating the same problems that I have had with this camera, maybe it is a defective batch??  I think overall that the camera COULD be good, like I said, I do think mine was defective.  Regardless though, I did't spend that amount of money to have to deal with problems, and have to send the camera out for repair, at this time of year, when I REALLY want to capture pictures of my kids.Edited to ADD on 12/6/2007-  After reading many other reviews, and also trying out a some additional cameras that are the same model as this, I do not think that the camera was defective, I think that is is just not a very good camera.  After taking multiple pictures in several different stores with this model of camera, I am getting the same thing yellow tint and blurry pictures.", "Date": "December 2, 2007"}, {"Title": "A great quality Sony product", "Author": "B. Short", "ReviewID": "R19I5BJDZQPWCT", "Overall": "5.0", "Content": "I just got this camera for Christmas and so far I am very pleased. The camera does everything Sony says it will do. For a camera so small, its a wonder how they can make a camera with 10X zoom and image stablization and long battery life.  The flash power is pretty incredible too. I could go on but you get the idea. Overall, the images have come out great. The powerful flash sometimes blows out indoor images in the auto mode, but in manual mode the flash can be toned down with excellent results. The lens cover is not automatic but I prefer a seperate cover as my old Kodak's automatic cover use to get stuck all the time. Maybe its because I take lots of outdoor shots and dust/dirt may be causing it but either way its one less thing to worry about breaking now.When reading reviews of this camera I sometimes get frustrated at how some will nit-pick the features that this camera lacks such as no viewfinder, limited manual controls, and some noise issues at higher ISOs. You need to keep in mind that this is not a DSLR. It is not meant to compete with a DSLR. This is a camera for someone wanting a compact point and shoot long zoom digital camera. Its very easy to use and takes outstanding photos and the digital noise is as minimal as you will find on any NON-DSLR. Comparing the Sony to others in its class, I have to say that the build quality on the Sony is second to none.Not everyone (especially me) wants to lug around a hefty DSLR camera with big bulky lenses that can add up to over a grand, unless you're a professional or a very serious amatuer. I mean, for a street price of around $270, this camera just can't be beat.Oh yeah, if I do have to gripe about something on this camera, it would be the slightly low resolution LCD. Its not quite as nice as the Canon or the Panasonic compact superzooms, but it does get the job done. Other than that, I have to say my hat is off to Sony for making a great little superzoom that won't break the bank.", "Date": "January 3, 2008"}, {"Title": "Decent pictures, but control knob is in a Rotten place", "Author": "Sheryl Wittig", "ReviewID": "R2K2YG6XBJ1HQB", "Overall": "3.0", "Content": "We bought this camera as our primary digital still camera.  Overall, the camera takes reasonable pictures, but we've lost MANY shots because the primary control knob, the one that selects the camera mode, is located on the right edge of the camera directly beside the shutter button.  When reaching for the shutter, the index finger has a tendency to slide against this control knob, CHANGING THE PICTURE MODE, which means we're taking pictures in a different mode than we had expected to, often losing the shot we were seeking to take.We also managed to inadvertently open the battery door and eject the battery on one occasion.The bottom line is that we have to be extra careful when handling the camera to avoid changing settings.  This is an inconvenience and a nuisance when what we really want to be concentrating on is the subject, not the camera.", "Date": "December 18, 2007"}, {"Title": "Sony DSC-H3", "Author": "R. Badger \"Knower of All, Master of None\"", "ReviewID": "R36KTDDP82F7PT", "Overall": "5.0", "Content": "I got my camera Friday afternoon. So far I have been throughly impressed with the picture quality from this great camera. The pictures are sharp and the color is full. Abberation isn't really a problem, but it gets worse towards the tele-photo side of the zoom range. Oh well. You can't really get away from that. One of the most impressive features is the quality of the LCD. Even in full sunlight, I can read the LCD perfectly without having to use my hand as a shadow. Great job Sony for that. The Bionz processor that Sony is using is great at image processing. At the higher ISO levels (anything above 800 or so) you'd expect to see a LOT of noise out of the CCD, but the image processor does a wonderful job of removing the noise without sacrificing much detail. You will lose some detail, thats the be expected. The controls are nicely laid out, and all are very accessible. The slideshow feature is very neat, and really gives your pictures an added touch with the music and change effects. One of the coolest features about this camera is that you can change the flash intensity from -2.0EV to 2.0EV, and it makes a difference. Get to know the manual controls, you will love your pictures after. Overall, a GREAT camera, with even better results.", "Date": "November 26, 2007"}, {"Title": "Sony Quality", "Author": "MikeR \"Disappointed in Sony\"", "ReviewID": "RJPPFLTQCU55M", "Overall": "3.0", "Content": "I have just (Nov 22) purchased a Sony Cybershot DSC-H3 after comparing functionality with the Canon equivalent - it was a tradeoff and $$ won by a whisker!Good news - the camera feels comfortable, the lens is good, it shoots easily in point/shoot mode, and there are a plethora of options should one want to become more adventurous!Bad news - over the Merry Christmas snapping of photos the flash unit suddenly stopped popping up automatically, regardless of setting!  It is possbile to manually open the flash unit and shoot when you think extra light is required, but this is not the design!  So now I have to bundle up the product and send it to the nearest repair center, after only 1 month use - this is very disappointing and not what is expected of Sony products!Next time I would go for the Canon!", "Date": "December 29, 2007"}, {"Title": "Shutter lag is a problem", "Author": "New dad", "ReviewID": "RGFV43C1CPF4I", "Overall": "2.0", "Content": "I bought the DSC -H3 as a camera to replace a 3 year-old 5 meg Cybershot which had terrible shutter lag and fewer megapixels.  I was looking for something that was fast, automatic, and small to capture my 22 month old son as he explores his world.  After two weeks with the camera and three trips to Santa's lap, its undeniable, the camera cannot keep up.  When I used the rapid shot mode, the flash shut down as did the auto focus - we have blures and dark pictures.  When back in the single shot mode, the lag is such that the moment is always gone by the time the picture clicks.  When I try to anticipate his movements, and finally get a shot, we get red eye even with the red eye adjustor on - probably because he is not looking at the camera when it first focuses.  I purchased a Sony 2 gig pro card for the camera, so I don't think the lag is attributable to anything but the camera.  Of the 100 or so pictures I have taken with it, very few are from outdoors where perhaps this camaera would do better, but the indoor shot quality was far below what was hoped for or expected.I like the size of the camera and the zoom, and I did not miss not having a view finder, but the lag was so pronounced I am sending the camera back and writing this review to suggest that anyone interested in this camera try it first to ensure they can live with the lag.", "Date": "December 17, 2007"}, {"Title": "Great Camera", "Author": "Lindsey", "ReviewID": "RUT14PFO16IT8", "Overall": "5.0", "Content": "I bought this camera after my Kodak Easy Share was stolen.  I origally wanted another easy share b/c it was pretty user friendly, but when I started looking around and seeing what I could get for my money I decided to go with a camera with more zoom.  It came down to this one or the Kodak 710 and in the end this one won out b/c it was more compact.  I wanted the fetures of a long zoom with out the bulkiness of one.  I also wanted a camera with the ion rechargalbe batteries.  I know a lot of people like the AA, but they just dont compare to the ion in batery life.  We settled on this camera and I think it does the trick!  It's very compact compared to the other cameras with 10x optical zoom and its super afordable on amazon.com. The camera is heavier than I'm use to, but then again my old one was the size of a deck of cards, so most anything would be heavier than that.Now for the preformance.  It's great!  I have played around with it all day and it takes great pictures!  The zoom is wonderful.  The pictures are very crisp and the colors are natural looking.  The camera is also very easy to use.  Basically the camera its self tells you what every thing is for.It also has a great feture that will allow you to take 3 pictures at a time so you can get those hard to hold still toddlers!I'm not a proffesional, but I do love to take pictures of my baby and this camera allows me to take great pictures.Still lovin it!  I've had the camera for a few weeks and played around with it a ton.  I haven't been able to take a bad picture.  I kove this camera.  It would be a great buy for any skill level.", "Date": "March 15, 2008"}, {"Title": "Great camera!", "Author": "Steven G. Rush", "ReviewID": "R201MRZ0XMEKOL", "Overall": "4.0", "Content": "Takes great photos and easy to understand menu.  I bought this model because I needed a camera that had a good zoom and that I could fit in my pocket. Some reviewers did not like the \"hard\" lens cap, but to me it is one of the best features because it really protects the lens.  The only thing that I do not like is that you either get a strong light with the flash, or very little light if the flash is not used. Some photos taken inside during the day are either washed out or too dark. But I probably need to make an adjustment to fix this, but have not been able to figure out how.", "Date": "February 8, 2008"}, {"Title": "Excellent point and shoot", "Author": "Robert G. Walker", "ReviewID": "R2B34X3JFFSX76", "Overall": "5.0", "Content": "Great little camera - little to no shutter lag. Very compact size.  Screen is large.  Many usable options.  Picture quality is excellent.  Easy to use.", "Date": "February 8, 2008"}, {"Title": "Great camera!", "Author": "A. E. Garcia", "ReviewID": "RY89BBQOOQ77E", "Overall": "5.0", "Content": "This is a great camera! Its very quick unlike most digital cameras.  I'm a designer and us the pictures for advertising. The images are clear and  even the movie capture is great quality!", "Date": "March 12, 2008"}, {"Title": "Day 1 of Recieving this Camera - LOVE IT!!", "Author": "Scarlett \"Maitai\"", "ReviewID": "RIMFIXZZQV4UG", "Overall": "5.0", "Content": "I've only recieved this camera yesterday, and had a chance to play with it last night. Already, I am loving this camera. I cant beleive this camera was only $269. For the features and funtions this camera has, and the picture quality (although i havent had a chance to print any yet), it should be over $300. Yeah, there's no view finder or that the lens cap is not automatic but that just keeps the price down. Plus, the lens cap is twist on/off so that it allows for you to use various filters if you want toPictures taken in doors, with only a room lamp and christmas tree lights turn out great, with or without a flash. Or even when i use the 10x optical zoom, with no flash in the same dimly lit room, the picture comes out clean and clear - NO NOISE. I've heard other reviews that this camera also takes even greater pictures, outdoors. I cant wait to try it out.There's enough auto preset modes to take care of most situations including a sports mode (which anticipates movement from the subject even) and there's a manual mode as well - although i havent had time to learn that yet.Again, the look and weight of this camera PLUS all the features and quality of photos, makes it seem like it should cost more. All around, this is probably the best $269 i've spent on any electronics.", "Date": "December 11, 2007"}, {"Title": "Great Camera!", "Author": "S. Pyne \"Army Wife and Regular Mom\"", "ReviewID": "R38YLZFIWJI40X", "Overall": "4.0", "Content": "I've really enjoyed this camera so far. The instructions are easy and not very long. I read through them and was using the camera within the hour. The only thing I have not figured out yet is how to use the continuous-shooting mode. Like I said the instructions are not very long and don't refer to that. There is an instructional CD -ROM that has more detail, I just haven't done that yet. Everything else is very easy to figure out and to use. I LOVE having a rechargeable battery. I can take tons of pictures. I haven't counted exactly, but I just recharged my battery and I probably took close to two hundred pictures, spread out over a month before I had to recharge. My old camera went through 2 AA batteries before I had the chance to take 20 pictures.I especially love the ISO (low light) setting that you use without a flash. They usually come out better than using the flash and it doesn't cause a glare that a flash can cause (depending on what you are taking a picture of), and you don't have to blind the people with flashes. They won't even know you are taking a picture.My other favorite setting is the Macro setting. You can take great close-ups on this setting, and the detail is wonderful!I have tons of great pictures thanks to my new camera! I have no complaints, and I would recommend it to anyone!", "Date": "February 23, 2008"}, {"Title": "Great zoom, Sharp pictures", "Author": "D. Gibson \"Disey\"", "ReviewID": "R3OOUTPZD7MEAM", "Overall": "5.0", "Content": "I have always had Canon cameras but the reviews were better on this Sony than Canons 10x zoom model so I decided to give it a try. It takes great pictures, I took some at Christmas at the Rocketts show and in twilite mode with the zoom and I was amazed how clear and close up they were. So far so good. Had to get used to where the zoom buttons are compared with Canon.", "Date": "January 6, 2008"}, {"Title": "good pics, small, simple", "Author": "J. Graff \"World Zombie\"", "ReviewID": "R2WKWCFNEVTMNZ", "Overall": "4.0", "Content": "I got this as a gift for my wife and she loves it.  She was using a Fuji Finepix but wanted better quality and more options; this delivers as well as being more portable with the option of adding lenses for those special shots.Sony cameras do work best if you take the time to learn how to use them.  The Auto functions can be a bit grainy sometimes, but if you learn the camera, learn what the settings are for, you'll be very happy with it.", "Date": "May 18, 2008"}, {"Title": "Good camera for the price!", "Author": "Nukkles", "ReviewID": "R1R9FMCODMV4BZ", "Overall": "4.0", "Content": "I was nicely surprised with the DSC-H3. I've owned Cyber-shots before and I've always liked them.  The H3 is much lighter weight than previous models. I'm still experimenting with all the features; so far, it seems to shoot really well in low light, especially without the flash. On the whole it seems an easy camera to use.  As I experiment with all the features, I'll report back on my thoughts, but so far, I'm loving it!", "Date": "March 16, 2008"}, {"Title": "Sony Cybershot", "Author": "C. Davis", "ReviewID": "R3HRSHO7RTH4W7", "Overall": "4.0", "Content": "We find this camera easy to use. We were looking for a camera with alot of optical zoom and this one definitely has it. We've used a couple of different settings and it performed well. A couple of things - we wish the camera had a view finder and we would have liked a wrist strap. But overall, we are very satisfied.", "Date": "March 9, 2008"}, {"Title": "Small cam, big features!!", "Author": "S. Shea \"Steve\"", "ReviewID": "RYUBNY54A9JBW", "Overall": "5.0", "Content": "This camera is a great buy. It is smaller than I thought it would be, and the zoom is amazing. You definitely get a lot of bang for your buck. Which is why I bought it in the first place. After painstaking research, this seemed like the right camera for me. I am a middle/high user, but didn't want to spend $700 plus for an SLR. The auto feature makes this very easy to use. And the programmable settings give you a ton of options. There are websites out there that benchmark test a lot of different cameras. For the price of this one, it seemed to get the reviews that I wanted to hear. I'm not saying there isn'ta better one out there, but for the price and features, this does pretty well. Oh, and for the record, it takes a beating. My cat has knocked it off the counter twice and there is no perceptible damage or loss of picture quality. The cats quality is a little off now though.", "Date": "February 8, 2008"}, {"Title": "Great Camera, Automatic features can get in the way", "Author": "J. MCNUTT", "ReviewID": "RGMAQQXLA9357", "Overall": "4.0", "Content": "This camera takes great pictures, but the auto focus seems too smart at times and is best to probably leave at center-focus.  This is perhaps due to trying to take more untraditional shots at odd angles, but none the less it seems to not focus where I want it to for many shots.The faster ISO's aren't really even worth trying, seems above 800 you can forget it but that's typical with lower end cameras.Lots of features to play around with and once comfortable with them and their manual counterparts I'm confident this will make an excellent camera.", "Date": "January 11, 2008"}, {"Title": "Sony Camera", "Author": "Celeste Shotts \"Dog Lover\"", "ReviewID": "R2CEIOY6ERLGP1", "Overall": "5.0", "Content": "Rated gret by Consumer Report.  This was a gift for our sond and \"daughter-in-love\" for Christmas.  They are amazed by it.  What a great buy!", "Date": "December 31, 2007"}, {"Title": "Disappointing", "Author": "Gerald Caponetti", "ReviewID": "R2KLXQGTB9N6BR", "Overall": "3.0", "Content": "I really have some issues with this camera.  First when you are using the LCD viewfinder it is so low resolution that everything is blurry and noisy just until you are ready to take the picture.  You can't judge the picture or who is in it since it is all blurry!For some reason halfway through taking the pictures, there was a red saturated tint to every background.The menus are so confusing.  If you take flash pictures inside, everything is way too bright and if you turn the flash off and adjust the ISO, well good luck.A waste of money.", "Date": "December 23, 2007"}, {"Title": "An excellent P&S; camera with a very good optical zoom...", "Author": "Diwakar Sadasivam", "ReviewID": "R1IO10DXFN4YAI", "Overall": "4.0", "Content": "I got this camera 9 months ago after doing a lot of research.Till now this camera has not let me down...It deserves a 5 star rating but the reason for a 4 star rating is due to the Cons mentioned.Pros:1. High quality pictures2. Excellent optical zoom capability...3. Use of zoom in movie mode (but you cannot adjust the zoom when a movie is getting recorded)4. Advanced Sports Mode - the mode that I love to use... - you can take crystal clear pictures of moving objects without any blurs or aberrations (this is restricted to daylight - as this mode deactivates flash settings)5. When you set the camera to continuous shots mode & use with advanced sports mode, the time it takes to get the camera ready for the next picture is such that you won't even notice that the picture is already taken & the camera is ready for the next one. I have not tried with other modes...so cannot give any idea of how quick the camera gets ready for the next picture in other modes (like Soft snap, Twilight, Landscape etc).6. Movie recorded in night is of a good quality than compared to taking pictures.Cons:These are the two main drawbacks I noticed with this camera.1. Night mode pictures with this camera are not so good as compared with the pictures taken in daylight.2. The mode dial at the top right sometimes unknowingly gets changed when we keep taking pictures and by the time you notice, you would have taken quite a few pictures and think... when did this get changed? I did not change it!!!When I first used this camera during my trip to LA & uploaded the snaps & shared them with friends & relatives, the comment that I got was -\"the ultimate part seems to be the Camera... The images are crisp & sharp..\"Overall, this is an excellent camera to own & it takes excellent quality pictures (in daylight).Diwakar.", "Date": "September 7, 2008"}, {"Title": "Great action and still shots!", "Author": "Michelle", "ReviewID": "R29YJERWLS4Y0G", "Overall": "5.0", "Content": "I bought this to replace my Kodak EasyShare Z740 with 10x optical zoom. I needed to keep the zoom capabilities and I wanted a camera that would take good action pictures as well as still photos. I also had to have the video mode to capture all the witty little things my boys do and say.I got it charged and started taking pictures right away. I have two busy boys so I need a camera that takes good action shots. I love all of the features and I love that when you turn the selection dial the choices appear on the lcd screen so that I can stay focused. I wanted to be able to learn to use something a little more complex with the plans of moving up to a SLR camera later.", "Date": "June 13, 2008"}, {"Title": "A Great Camera!", "Author": "penname", "ReviewID": "RQOLNWCHGZW07", "Overall": "5.0", "Content": "I LOVE this camera.  I've had it for about 6 months and it takes wonderful pictures, even in the dark (with the ISO setting).  The Zoom is great.  The GRIP is a super-wonderful feature!  It's easy to download pictures, and the BATTERY LASTS FOREVER!  Overall, it's the nicest camera I've ever owned.", "Date": "May 25, 2008"}, {"Title": "I wanted a 'pocket camera' and got a good one.", "Author": "Robert Cox \"LightChaser\"", "ReviewID": "R2P7SYRFJ8UT8E", "Overall": "5.0", "Content": "I shoot, as a matter of course, heavy DSLRs and wanted a small camera to carry at all times for those unexpected opportunities and the Sony dsc-H3 fills the bill.With the eight meg resolution and the 10X optical zoom ( 38mm to 380mm effective range ) this camera more than fills the bill.The images are sharp and have that wonderful 'Sony Color' plus the IS and face recognition....wow. The wide range of 100 to 3200 ISO, the on board strobe has a greater range that I have seen on other small cameras and it handles very well. Three friends have looked and handled my H3 and went out and bought their own. How much of a review is that ?!?I am a very pleased purchaser,D Cox", "Date": "May 5, 2008"}, {"Title": "An Excellent Camera for the Price", "Author": "C. Ang \"cliff_ang\"", "ReviewID": "R2SN8TG1GSJFGH", "Overall": "5.0", "Content": "The H3 is an excellent camera for those that want a 10x zoom and excellent picture quality, but don't want to break the bank.  The main advantage over a comparable Canon model is the Lithium battery (although you have to take it out of the camera to charge it).  Don't let the size fool you - this camera is quite light.  This camera does not have an Electronic View Finder (EVF), which I don't really find too useful and never used in my old digital camera.  The LCD screen is sufficient under most lighting conditions.  I haven't gotten around to playing with most of its features, but for normal point and shoot operation -- this camera is pretty good.", "Date": "April 22, 2008"}, {"Title": "Excellent Camera That Doesn't Break the Bank", "Author": "Fred A. Wilczenski \"6 STRING RAZORZ\"", "ReviewID": "R28XMUU88SCA6K", "Overall": "5.0", "Content": "The H3 is a very compact long-zoom point and shoot camera that reliably takes pictures in Auto mode and doesn't break the bank. It's got decent image quality (surprisingly good in good light), point and shoot simplicity and an efficient image stabilization system. You can easily take it with you anywhere you go and, most of all, it is simply fun to use.", "Date": "April 5, 2008"}, {"Title": "Not quite a bullseye - but close.", "Author": "A. Thoricht", "ReviewID": "RN5DZ0SFYWKAJ", "Overall": "4.0", "Content": "Overall, I like the camera very much. It takes nice, high quality photos and offers a great optical zoom for the price. I only have a couple of complaints, mainly echoing the above reviewer's opinion that on older Sony digicams, it was only a couple button pushes to delete an image in-camera, now it takes longer.My old Sony camera (I believe it was a DSC P39), which was 6 years old and still working OK for the amount of abuse it put up with (including being submerged in muddy water while powered on a few times accidentally), was stolen and needed to be replaced. It came with a 16mb regular Memory Stick, which I still had, along with a 128mb stick I had bought to take on vacation. I was slightly confused with Sony's array of terminology (Memory Stick, Pro, Pro-HG, Duo, Pro Duo, MagicGate, Micro, ad nauseam) and assumed my old Memory Sticks would work with the H3, which of course they wouldn't. On the up side, the H3 did have internal storage (which only holds 8 pictures at 8mp size) that the old one didn't, but it was aggravating to have to buy a new stick (I opted for the 2gb, it is in the mail as I type).I also do not like the removable lens cap, but I appreciate the ability to add on lenses and filters like SLR cameras.The viewfinder being gone did not bother me, as I don't believe I ever used it on any digital camera I have ever tried.In summation, I am very pleased overall at the camera, but there will be a learning curve. I would highly recommend it to the novice who wants a mostly easy to use, high quality camera.", "Date": "January 18, 2008"}, {"Title": "Flash problem", "Author": "JAAM \"jaam\"", "ReviewID": "RUQGG5HI1AC8D", "Overall": "3.0", "Content": "I am disappointed just after one month of use. I have to ship it back for repairs because the flash will not pop out as it should. I found out the hard way while taking photos at an event I had been hired to do. Fortunately, most of the room was well lighted. It wouldhave been a disaster if all of the lighting had been poor. There is also an issue with the (image stabilization)super steady shot. If you target moves even slightly before your shot, your photo is blurry. I wish  I had read some of these other reviews before I invested in it.", "Date": "February 20, 2008"}, {"Title": "Nice Camera", "Author": "alwaysputzin", "ReviewID": "R8DI13GF5KJ1A", "Overall": "4.0", "Content": "I have been looking for a replacement for my old Kodak 10x camera for a long time.... I was told about this camera and boy have I been impressed...It is small and the pictures are very nice.  The menus are not as easy to navigate as my Kodak, but it is small, large zoom and takes beautiful pictures....", "Date": "November 17, 2007"}, {"Title": "OUSTANDING CAMERA", "Author": "e", "ReviewID": "R1M52A45B8JOFU", "Overall": "5.0", "Content": "Be advised this camera and its' battery are made in Japan and the quality shows. Worked out of the box and it even has a auto pop up flash when it senses too low lighting conditions. Still checking it out and I will edit this at a later time when I have had a few weeks to play with it. This is the camera to buy today. Tommorrow is another story in electronics. LOLCompared this to the Panasonic, Kodak, and Canon models in the same price and feature range at Best Buy, Circuit City, Sams, and Office Depot. Still the champ and your best buy today. Going price is 271 shipped.Bought more memory and an extra battery. All my Christmas shoots were perfect. I might try the 400 setting soon to see if the quality is better than auto. Price has dropped on this camera since Dec.", "Date": "October 22, 2007"}, {"Title": "Just what I wanted a camera to do!!!", "Author": "Aerofan02332", "ReviewID": "RR7M5O77B24CR", "Overall": "5.0", "Content": "I have not had enough time yet to play with all the functions of this little beauty, but I am thriled with it so far.  I enjoy especialy taking low light shots of acts in coffee houses, clubs and other music venues--and it is spectacular.  More fun this wekend!", "Date": "March 29, 2013"}, {"Title": "I LOVE This Camera", "Author": "Linda Jo Park \"Professional Knitter\"", "ReviewID": "R6ZTI3KWDB1R5", "Overall": "5.0", "Content": "I've had this camera for about 3 years now and I LOVE it! It may not be intended for professional level work, but it takes professional level pictures. I am amazed at what it can do. I've taken awesome close ups using the macro lens, impressive pics of my dog running with the sports mode, and wonderful landscapes and portrait pics. It's super easy to use too. I didn't know much about photography when I got the camera, but with a little education and this little baby, I've become quite the amateur photographer. I use my camera mostly for taking pictures for my blog as well as photos for knitting and beading patterns I write and publish. If this camera ever croaks, I'm gonna cry like a baby.For samples of my photos, visit the blog: [beadknitter dot blogspot dot com]", "Date": "October 28, 2012"}, {"Title": "Worst Camera I have owned", "Author": "travelinggnome", "ReviewID": "R2HKGNW110GUMK", "Overall": "1.0", "Content": "I bought this camera, not fully looking at all of the reviews.  If I had, I would have gone with the Lumix that I REALLY wanted.  The first month, everything seemed fine.  I felt that I was getting decent pictures, but not perfect.  After that first month, my 4.1 Kodak was getting better shots than this Sony was!  Nothing would focus if you were inside.  It started making this VERY obnoxious sound.  I thought a gear was loose or something.  Shutter speed lagged.  No matter what I did, I could not get focus inside/low lighting.  After doing some research, I discovered that this was a flaw on the Sony DSC-H3.  It is a random thing that doesn't happen to all of them, but it was at least a big enough issue that several review sites mention it.  Basically, the camera is useless unless you are outside.  It will take a decent video, if you are not concerned over the ridiculous noise that it makes in the background.  I saved up my money and purchased the Panasonic Lumix FZ40...which is absolutely awesome.", "Date": "June 15, 2012"}, {"Title": "Great photos but. . .", "Author": "Krissy2009", "ReviewID": "R3M8LT5R0JBSQ5", "Overall": "3.0", "Content": "This camera takes great photos and is super user friendly.  I love to take nano shots and try to take beautiufl photos, this camera is very helpful with both.  And compact for the kind of photos it is capable of. The only problems I have had with it, are cosmetic.  The little plastic cover on the side (that covers up the hole for the cord that connects it to the computer)  will no longer stay closed, the little peg is supposed to pop into place but after only a year it will no longer snap shut. Around this same time the flash no longer automatically pops up, i have to manually pull it up, this sucks beacause sometimes i forget and photo opp is missed.  I'm not sure how these things happned, the camera has never been dropped or missused, it had barely been used.  the reason for not using it very often is because I like to carry a camera that is super small and this is just a little too bulky.  If you just want something to bring EVERYWHERE and can easily slide into a jeans pocket or purse don't buy this but for when you knwo you'll be taking care when shooting then great camera to bring along.", "Date": "February 9, 2012"}, {"Title": "Easiest Camera and Best Pictures for active people", "Author": "Ann Palmer \"annp123\"", "ReviewID": "R169UFKGSKJHRB", "Overall": "5.0", "Content": "I bought this camera for a friend as a gift and found myself wanting one.  Bought it used at a great price and love using it.  Small, fast, and great pics.", "Date": "August 7, 2011"}, {"Title": "Have had camera for about 2 years", "Author": "K. Kaur", "ReviewID": "R2C25O1ZU0FKHW", "Overall": "5.0", "Content": "Very happy with this camera.It is lightweight and very portable.The lens takes high quality pics.  Usually of all the point and shoots at an event, my photos turn out the better than most.Does well in low light. Sometimes I forget it has a flash. lol.Does well in action, high motion.Zoom works for my life.Had camera two years or so.No problems. Knock on wood.Sad to see that Sony is not making this body anymore.I like the grip.  Easy to use one-handed.Happy with Sony.Bought this camera from them refurbished.", "Date": "June 19, 2011"}, {"Title": "still works great after 3 years!", "Author": "minami_park", "ReviewID": "R248CYIHPBL6P3", "Overall": "5.0", "Content": "I bought this in 2007 to replace an old nikon coolpix because of the 10x zoom capability. I have used this camera in all our travels (even harsh elements like misty waterfalls, sandy beaches, hot & humid places) and family events and sure, it does have its own limitations as a point-and-shoot in low-light conditions but overall, the images are sharp and come out the way I want them to. I have been using the P-mode mostly and my friends often think I'm using a DSLR when they see the pictures I've taken from landscapes to portraits. I've also used this camera to take handheld close-up pictures of dragonflies, flowers, even in a zoo... and they all came out sharp and clear with good depth of field! Now I own a DSLR but I'm still keeping this camera as a handy back-up.", "Date": "June 2, 2011"}, {"Title": "fantastic for kids in sports and ANY type of pic taking/videos", "Author": "R O \"r o\"", "ReviewID": "R1W3WP3P4DENF6", "Overall": "5.0", "Content": "I have had this camera for approximately two years...It takes awesome shots of my son playing football (yes, even close ups!), and basketball as well, although the lighting is low when using the sports action setting inside.. Last weekend I took videos at a horse show, and the quality in low lighting, whether zoomed or not were amazing; I got a ton of comments on the stability of the picture, and how clear they were, even at the distance I was taking them at.  The only \"con\" I would make is while video recording, you cannot zoom in or out while recording. Whether close ups, or zoomed in pictures - they are great.  Even without a tripod, when zoomed to 10 the pictures come out crisp/clear.  When using low light/slow shutter pictures, I get scared about the movements I make as the shutter stays open but again the picture turns out great.  I would never pay for anything else. Family members have cameras that cost 3-4 times more (the NICE NICE ones) - and it takes them forever to focus them, they can't figure out the features or options - theyre bulky, and honestly I don't think theyre happy with them...You will not go wrong with this camera!", "Date": "February 9, 2011"}, {"Title": "The best", "Author": "GBoog", "ReviewID": "R2L6JP5K4S2PVV", "Overall": "5.0", "Content": "I took the best pictures in my life with this camera. Easy for those who don't understand about photos, and complete for those who want to take the best shot. Very resistant, I'm writing this review after 2 years I bought it and only after dropping 3 times in the floor (the last one was really hard) it broke, unfortunately. Let's go for the next Sony.", "Date": "December 28, 2010"}, {"Title": "Good, with some quirks", "Author": "T. F", "ReviewID": "R683LEDB3HHU7", "Overall": "3.0", "Content": "Pros: Good flash, nice zoom, image stabilization works fairly well.Cons: Bad button placement (see below), circular selector on top is too easy to move. Long time to focus sometimes.Both the circular selector and the 5-way rocker button next to the LCD are very easily pressed when not meaning to. I have screwed up many would-be nice shots by having the camera accidentally in nighttime mode or manual mode when I really didn't want these modes. I take the picture and then realize that the mode is wrong, but alas, the moment has passed.ALso, don't use the AUTO (green) mode - it is absolute crap. Whenever the flash goes off, it puts it to like ISO 1000 or something and your picture looks really awful. I don't know why they put that mode like that, it is for people who don't know anything about image quality apparently.The picture quality at full zoom is mediocre.As long as you use the P mode and set the ISO to be like 200 or 400, you should be good to go.All in all, this camera is decent if you really don't want an SLR and you need the extra zoom, but there are plenty of better choices out there for everyday point and shoots.", "Date": "November 25, 2010"}, {"Title": "Pics come out blurry no matter what you do", "Author": "Tooky \"Tooky\"", "ReviewID": "R16OP93BEHHQ11", "Overall": "1.0", "Content": "This camera has lots of bells and whistles but it does not do the one thing you need it to do: take clear pictures. Regardless of how you adjust the settings, the SLIGHTEST movement by the subject = blurry picture. The only workaround is to use \"sports mode\" but this mode does not allow flash, so pictures end up too dark indoors. I have lost countless good photo moments of my kids because this camera cannot catch any live-action shots clearly. This camera is best used for shooting inanimate objects outdoors. Don't waste your money if you intend to use it as a family camera.", "Date": "August 15, 2010"}, {"Title": "GREAT", "Author": "Mary Odonnell \"mary\"", "ReviewID": "R1Z6M5ZBCNZVAN", "Overall": "5.0", "Content": "I am not a professional at ALL just a mom of 3 active kids. I have had this camera for 2 years and I still Love it.. Great pictures and super easy to use. We are a very active family and we take losts of pictures. I think my only little com is the lens cap cover being so active I wish it had an automatic lens cover. However i would trade our camera for anything!!", "Date": "April 29, 2010"}, {"Title": "Great Camera for Beginners! AWESOME", "Author": "Holly W. Wallace", "ReviewID": "R3OZ1LQTZS3S1Q", "Overall": "5.0", "Content": "I am thrilled with my dsc-h3!  I bought this used off Ebay and lucked up and got it for $100.00.  It is amazing how close you can get and how well the pics turn out!  I haven't used all the settings but the automatic is wonderful!  Couldn't be happier with this purchase and this is my first Sony too. Go Sony!!", "Date": "June 3, 2009"}, {"Title": "Birthday gift for mom...", "Author": "Paul A. Hernandez", "ReviewID": "R18AZ2UVO57S6P", "Overall": "4.0", "Content": "Great camera, lots of features.  The only thing I have to complain about is that there is a second delay from when you push the button to when it actually takes the picture unless it is in sports mode.", "Date": "May 20, 2009"}, {"Title": "EXCELLENT CAMERA!", "Author": "ibbobb", "ReviewID": "RZ49RUX8CE501", "Overall": "5.0", "Content": "This is by far the best camera I have ever used! The controls are easy and intuitive. I'm not sure what the people who gave the camera 1, 2, or 3 stars were doing, because this camera takes BEAUTIFUL pictures. The camera has 10 modes, one of my favorite being Scene mode.Scene mode can take beach scenes, night scenes, and my personal favorite; fireworks! Fireworks mode really works too. I took an excellent picture of a firework in pitch black, and it captured it perfectly. A must have for 4th of July.I can't live without Super SteadyShot. It stabilizes pictures when you take it, or you can set it so it is always on.I really recommend this camera, as a cost effective alternative to other cameras.", "Date": "January 19, 2009"}, {"Title": "Great camera!!", "Author": "C. Cox \"C Cox\"", "ReviewID": "R2KUWOAJIETF5M", "Overall": "5.0", "Content": "I bought this camera a little less than a year ago and I have no complaints...  it has a lot of settings and is easy to use.  Takes great pictures!!!  It is not a slim camera but I would also say it is not bulky...definitely need a memory card and the camera case to protect it.", "Date": "January 1, 2009"}, {"Title": "Among the best", "Author": "SpeedoNJ \"Len\"", "ReviewID": "RR20PPTT0E0PI", "Overall": "5.0", "Content": "I bought this little gem off ebay about a month ago, and it came with nothing but the camera (and fortunately the battery). So I had to get the funky memory stick or whatever they call it, but it does go directly into the computer slot, so no problem there, that's how I always do it.  (Does anyone fool around with USB cords?-what a nuisance)Great pictures in a small size, to me this is a camera that will fit in a jacket pocket.I've no problem with indoor shots-normally turn the flash off anyway because the first few I took it popped up on me unexpectedly. But it is a little bright, since I don't have the manual I didn't know til I read some other reviews that it can be adjusted.  And I could always go to the website to look for it (right-like I'd do that)As the last paragraph alludes to, I'm a point & shoot guy, DSLRs kind of scare me so I'll use auto 95% of the time.  That little mtn switch works well though for fall colors scenery.Guess I'll just fool around with it some more and enjoy the results!P.S. Get over that lens cap thing- the automatic ones do just jam after a while.  Wish I had a cap for mine-have to put it back in the case all the time (of course, had to get that ala carte too) BTW a canon IS 2S case is perfect for this, and the canon is too big for it.  Wrist straps are a dime a dozen-just use one off an old radio or something", "Date": "November 11, 2008"}, {"Title": "Easy To Use", "Author": "NASCARLadybug", "ReviewID": "R3PYRC7DJJX4UU", "Overall": "5.0", "Content": "I am not onw to read directions!!! I love this camera and have made tons of photos since I got it in December 2007.  I highly recommend it.  This summer, I plan to read th manual!!", "Date": "May 23, 2008"}, {"Title": "Camera is so so", "Author": "J. Benzon \"J\"", "ReviewID": "R2H33T6OQMKXK3", "Overall": "3.0", "Content": "I purchased this camera in December of 2007 and was excited to receive it after rave reviews from various digital camera websites.  In the past I have owned Olympus and Canon (Elph Series) Digital Cameras and the only reason I decided to purchase this was for the bang for my buck...a 10x optical zoom digital camera for under 300...I thought it wasn't so bad.  After owning it for over 4 months, I came to my conclusion that I wish I don't own a Sony digital camera again:1. I noticed with Sony camera's that the quality of pictures are not as crisp compared to my previous Canon and Olympus' pictures.  It's as if you are constantly taking pictures with a high ISO Setting (ok, maybe i'm over exagerating) If you take a picture and zoom in a bit you can see a fuzzy pixelation and some detail of your subject is gone.  I believe it has to do with the sensor on the camera, since this occurs with other Sony digital cameras that are NOT SLRs.2.  The camera has a pop up flash.  When the settings on the camera are set to use automatic flash or if you set it to flash when you take the picture, the flash usually opens. In this case, after four months it doesn't do it at all anymore.  The flash is broken.  It works if I manually dig your nail in-between the crevice of the flash and the camera body to pop the thing up but I dont think that was Sony's intention for us to use the flash feature.  Also, I read on several other digital camera websites that this same feature would break for them as well.  Poor quality production I guess?Overall it's a great \"looking\" camera and has great 10x optical zoom but in the long run I don't think the price would suffice with the worries you have to go through when wanting to take a good picture.  I think after this experience I DID regret not getting my Canon G9!", "Date": "May 1, 2008"}, {"Title": "love it", "Author": "Gift Card \"super dooper\"", "ReviewID": "R2JVSPQTWXPB0D", "Overall": "5.0", "Content": "i love my camera it captures all of the spontaneous moments my other snailish digital missed.it can take pictures of things on top of tall buildings with it's awesome zoom feature.  move over ansel adams!", "Date": "April 20, 2008"}, {"Title": "My best shot!", "Author": "Ms. Pocketbook", "ReviewID": "R3PNXCZBMDM3HB", "Overall": "5.0", "Content": "The price for this camera was exceptional!The delivery swift.The product was exactly as I expected.Only problem was running out of memory. Be sure to buy a memory stick.Easy to operate and takes great photos.", "Date": "March 26, 2008"}, {"Title": "Excellent zoom capability", "Author": "Kristin J. Vaden \"Tin Tin\"", "ReviewID": "R3EO6KBL7SVNWX", "Overall": "5.0", "Content": "The zoom feature on this camera is amazing! All the features make this camera fabulously easy to use. I would highly recommend this to anyone who loves taking photos, from the amateur to the professional!", "Date": "March 1, 2008"}, {"Title": "Very Pleased", "Author": "anthony", "ReviewID": "R1EGQ8RT7IRMUF", "Overall": "5.0", "Content": "This camera is taking great pictures.  It is easy to use and it has a lot of capabilities.  The battery that came with it is working well and has plenty of capacity, but I was a little surprised that I have to remove it from the camera to charge it, unlike my Sony P100.  It is a very good camera at a good price.  Note that also unlike my P100 it doesn't have a view finder.", "Date": "February 8, 2008"}, {"Title": "Great Camera", "Author": "Lit Diva", "ReviewID": "R2WGT96HSM0K55", "Overall": "5.0", "Content": "I love this camera!  I was torn between the features of a digital SLR and the size and weight for everyday use.  This is a perfect balance.  It takes great pictures in lots of different lighting situations and the \"click delay\" is short enough to get action shots.  The zoom is wonderful and can get close-up shots from across the gym.  This is a great product and I'm thrilled with it so far!", "Date": "February 8, 2008"}, {"Title": "Excellent performer ....just one notch above Canon IX200", "Author": "S. Singh", "ReviewID": "R3VP91BDEHYP53", "Overall": "5.0", "Content": "Excellent camera with poweful flash and does an excellent job even WITHOUT flash with correct ISO settings.I bought the Canon IX200 from CircuitCity but didn't like the slow flash recharge time and the fact that it didn't feel comfortable in my hands. Took it back and bought this H3.Cant go wrong.", "Date": "February 4, 2008"}, {"Title": "Excellent gift", "Author": "Phillip Holman", "ReviewID": "R1IBDBGFBCRP46", "Overall": "5.0", "Content": "This camera has many easy to use functions. It takes clear precise photos and is a great choice for a beginner digital camera user.  Super value!", "Date": "December 30, 2007"}, {"Title": "Flash doesn't work.  Very messy camera", "Author": "Blahoooooo", "ReviewID": "R2VV0PN5BH02GU", "Overall": "1.0", "Content": "I'm so disappointed! I loved my old cybershot,but not this one.  My first day: the flash worked as I was experimenting but just when I went to shoot a *real* picture, the flash stopped working.  I wrote to Amazon and made an exchange through the mail. The second camera arrived, and the flash was working, again.  But now it arrived without the extra lens hood that originally came with it.  Amazon wanted me to return the whole product to get that extra hood, but I needed the camera for the holidays, so never got the extra hood.Then, after a month of use (and after the Amazon return window expired- starting from the date of ORIG purchase, not the date of the exchange), the flash stopped working again.  I've found if I fiddle with the camera long enough, by changing modes, sometimes the flash works.  Otherwise, I'm at the mercy of luck if I need a well-lit picture.Also, the lens cap - not fun to remove & keep track of.  Why not just an autolens cover, like the old ones?  It's just such a bulky, uncomfortable camera...Finally, the quality is just ok, not as sharp as I recall my early model being for it's era.I'm so upset by this purchase and long for the ease and quality of that old Cybershot.EDIT:I ALSO BEGAN TO USE MY FINGER TO GENTLY PRY OPEN THE FLASH LID, MYSELF.  ONCE THE HOOD IS UP, THE FLASH ALWAYS WORKS.  YOU JUST HAVE TO PRY IT OPEN, MANUALLY.I'VE ADJUSTED TO THE SIZE, USED A BREAD TIE TO KEEP ATTACHED THE LENSECAP TO THE CAMERA, AND MY PICTURES TURN OUT PRETTY GOOD IF I'M CAREFUL TO ADJUST THE SETTINGS, APPROPRIATELY. I'M STILL NOT AS IMPRESED AS THE EARLIER CYBERSHOT, BUT PERHAPS IN THE EARLY DAYS, ALL DIGITAL SHOTS SEEMED MORE IMPRESSIVE THAN WHAT I WAS USED TO BEFORE THEM!", "Date": "April 23, 2008"}, {"Title": "Highly recomended", "Author": "J. F. Bobadilla", "ReviewID": "R30J6W2U8DR5AW", "Overall": "5.0", "Content": "Bought this camera for my wife. She has been using Sony compact cameras for a while and wanted something about the same size, bigger screen and higher quality lens. When I found this new camera from Sony I counldn't believe it! This was exactly what we were looking for. The lens from Zeiss is excelent and video quality is very good. The big screen makes it easier to take pictures. If you are a Sony fan you'll feel instantly confortable handling this camera. Highly recomended!", "Date": "November 29, 2007"}, {"Title": "Not at all what i expected", "Author": "Mr. Mantis \"JC,\"", "ReviewID": "R2ALFEOPX70DFY", "Overall": "2.0", "Content": "Well, simple.., big pictures but with very low quality (72 dpi) it DOES NOT have a \"fine\" feature!!! take that in consideration because IT WILL take your pictures in a standard mode even though you're taking the picture in 8M size.I used to have a dscw10 and it took WAY BETTER pictures.., and my 200 dlls cheaper kodak camera did too.., go figure.Ps.- if someone knows how to solve that issue please let me know!", "Date": "December 13, 2007"}, {"Title": "Try before you buy", "Author": "George Griffith", "ReviewID": "R1WU4A91HDS5LL", "Overall": "1.0", "Content": "I purchased the H3 online, based on the reviews in a major consumer magazine. I should have tried it out first. It functioned ok when I tried it shooting stills inside, but then I took it outside. It was a moderately sunny day. The lack of a viewfinder made it next to impossible to use this camera outside. The LCD screen was totally washed out by the sunlight. I could not compose the subject let alone view the many icons on the screen. If you are considering buying this camera I highly suggest you take it outside and see if you can live with this problem.", "Date": "March 20, 2008"}, {"Title": "frustrated", "Author": "justafan", "ReviewID": "R3PFPA91CBEJ60", "Overall": "2.0", "Content": "Good features and all the other bells and whistles. However, the picture quality is not what one would expect from $500 camera. Most of the pictures that I took were indoors and the quality was rather poor. many photos came out blurry and most were not very sharp. I switched settings and tried it all, no luck.  On a hiking trip, I took some photos outdoors and they came out very nice. I'm just disappointed with the indoor performance of this camera. Also, the camera developed somekind of memory error. There are few pics that I cannot erase, they just stay there even though the camera doesn't acknowledge it. These pics stay there and always transfer with the new photos when downloading to the pc. The warranty expired so I cannot do anything about it. Sony make good products but I will stay away from their cameras next time.", "Date": "March 9, 2011"}, {"Title": "Buy at your own risk", "Author": "Missy \"mom to four kids under four\"", "ReviewID": "RXZZVVWJP8FCJ", "Overall": "1.0", "Content": "Had this camera for just over 2 years when the flash broke. Sony wants $200 to fix it. Will not be purchasing a Sony again.", "Date": "September 8, 2010"}, {"Title": "Big Dissapointment", "Author": "Celina", "ReviewID": "RRXL4WOB0HEO0", "Overall": "1.0", "Content": "I had the same problem as Madison's Mommy, I was so excited to try this camera out for my nephews birthday. Now I am left with a bunch of blurry pictures from his birthday party. If the kids made the slightest move, images came out very blurry. If not the subjects just look discolored, lots of yellow tint in their skin and around them. Also, I noticed that my daughters blonde hair looks very orange. People have even commented that she looks like a redhead in the pictures. I spoke to sony support and all they did was have me initialize the camera which did nothing. Very upsetting, this camera \"sounds\" so much better than it is. I also thought it must be a defect but apparently not. I did get a few nice outdoor shots, as long as people weren't in them.", "Date": "September 15, 2008"}, {"Title": "Overall nice little camera", "Author": "Wind \"Wind\"", "ReviewID": "R2283FUS2RZ6FL", "Overall": "4.0", "Content": "Overall I like this camera.  It is small enough to fit in my coat pocket yet still gives me the zoom power I need.  The quality is good.  The flash is powerful.  The ISO function is perfect for athletic events taking place in gyms where the lighting is less than optimum.  The only drawback I can see with this camera is the selector dial on the top is very easy to bump and change the settings of the camera.  I've ruined a ton of shots because I didn't realize the dial had changed positions.", "Date": "April 12, 2008"}, {"Title": "Good camera", "Author": "Jose D. Osorio", "ReviewID": "RDTOXEDV70UZE", "Overall": "4.0", "Content": "I purchased the sony dsch3 a few weeks ago and I liked the camera, nice quality image and good features. I returned it because it wasn't what I was a looking for for my wife and I, besides the camera software didn't work great in my computer, but overall this a good camera with a clear image .", "Date": "January 7, 2008"}, {"Title": "does not have good picture quality", "Author": "Robert Chipman \"durling23\"", "ReviewID": "RVMH1BSW62C1A", "Overall": "1.0", "Content": "HI You are totally right I bought one off of ebay used and used it a couple of times I took pic of the kids and it does look like they have a fake tan or something. I wasI was not happy with this camera. and like you were saying that the pictures looked good on the lcd screen but when i loaded the pictures to my computer  the ones I thought were going to turn out great has a slight blur to them I thought it was my computer screen but my other pictures I took with my other camera are fine . I am glad I am not the only one who is having trouble with this camera", "Date": "May 30, 2009"}, {"Title": "A toy with optics", "Author": "Ashot Khachatryan \"akhachat\"", "ReviewID": "R3HP3GEN0TP7LD", "Overall": "1.0", "Content": "A toy with optics is the best I could feel. I bought it because of the 10x optics and thought the SONY is not bad brand but I'm disappointed.Images it takes look like taken by 2-5MP resolution camera. I don't know what is wrong with it either HW or SW compressor but it HAS NO even a raw image mode. What is this? Slow processor, which is unable to write fast on MStick or something else. In any case it was not worthy deal. Now my son uses the camera like a toy. And I continue to use my 5MP Konica-Minolta, which takes more powerful pictures than SONY. I'm intended to buy Panasonic TZ3. It has a little bit more optical distortion but better quality of image. I also would not recommend to buy the other models of this series (H5, H7, H9) because those differ only in optics.", "Date": "December 6, 2007"}, {"Title": "What the hey, amazing!", "Author": "C. Richardson \"plain girl\"", "ReviewID": "R2P018HAA0OOUF", "Overall": "5.0", "Content": "This is a great camera.  There isn't much else that can be said about it.  I'm sure if I had the extra 200 to 300 to spend on a Dslr, I would have.  But this is the next best thing.  Good for amateurs and professionals.  Great price, new camera.  It's awesome!", "Date": "November 30, 2007"}, {"Title": "CoolCam", "Author": "Satish Neela \"satish\"", "ReviewID": "R2N9R55AJICJJX", "Overall": "4.0", "Content": "It is a nice Camera for a starter like me. Its easy to hadle and takes very nice pics......", "Date": "November 17, 2007"}, {"Title": "Great Sony Digital Camera!!!", "Author": "N. OConnor", "ReviewID": "R1XBUMFGWA22ZA", "Overall": "5.0", "Content": "Very nice - easy to use, exactly what Sony says!  My wife use it and pictures are beautiful!  We put it through a lot with our kids and it worked great!!!  I highly recommend this Sony Cybershot DSC-H3 8.1 mp digital camera!", "Date": "December 26, 2007"}, {"Title": "Sony 8MP 10x zoom camera", "Author": "A. Kanagala", "ReviewID": "R15ZLK8WL7LBQB", "Overall": "2.0", "Content": "I received camera as open Item. I expected it as brand new, unopened item. Someone might have returned this camera or it might be refurbished item.You could have sold it as an open item instead of selling it as NEW.", "Date": "April 28, 2008"}, {"Title": "SOFTWARE LENTO Y ZOOM MEDIOCRE", "Author": "JOSE LUIS GONZALEZ", "ReviewID": "R11OIFBQKJHJLT", "Overall": "3.0", "Content": "Compre la H3 para reemplazar mi Canon A710 IS (7.1 MP y 6X) porque quería un zoom de 10X y me llamó la atención la función High Definition, los 8 MP y el flash de largo alcance, sin embargo solo bastó usarla por 15 minutos para constatar:1. El software es más lento que el Digit II de Canon, sobre  todo cuando estás revisando la foto que tomaste, para acercar y alejar parece una tortuga.2. La calidad de la imagen a 8 MP es inferior a la de mi canon a 7.1 MP, existe un efecto pixelado grande.3. La corrección de ojos rojos no funciona correctamente, debes realizarla en tu PC con el sowtware de escritorio de Sony que es realmente Muy Bueno.4. El flash es muy potente, tanto que en el modo auto con tomas cercanas las fotos salen muy ILUMINADAS.Finalmente reconozco que es una cámara liviana y compacta pero la vendí para quedarme con mi vieja Canon A710 IS.", "Date": "January 27, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.1-megapixel Super HAD CCD captures enough detail for photo-quality 16-by-22-inch prints\n3.0-inch LCD display; 10x zoom with Super SteadyShot optical image stabilization\nHigh Sensitivity Mode (ISO 3200) lets you shoot without flash in low-light conditions\nFace Detection technology (up to 8 faces); Advanced Sports mode\nPowered by rechargeable lithium ion battery; stores images on Memory Stick Duo or Duo Pro media (not included)", "Name": "Sony Cyber-shot DSC-H3 8.1 MP Digital Camera with 10x Optical Zoom with Super SteadyShot Image Stabilization", "ImgURL": "http://ecx.images-amazon.com/images/I/51dWK6HedML._SX300_.jpg", "ProductID": "B000TEYOOK"}}