{"Reviews": [{"Title": "AWSOME", "Author": "Mommy \"Mandy\"", "ReviewID": "R3O47ZETLKYH7T", "Overall": "4.0", "Content": "First off I gave it a 4 stars because it doesn't come with a rechargeable battery, which stinks, my battery is already dead. I recieved this for my birthday and I sjut love it. It is super light and very easy to use. There are alot of options on this camera. It is user friendly and has a built in memory, you can also use a memory disk on this camera as well.", "Date": "September 27, 2005"}, {"Title": "Great Until the Battery Died Within an Hour", "Author": "Jenny", "ReviewID": "RD0B5N130NKLT", "Overall": "4.0", "Content": "This camera really is worth it. It is light, attractive, and easy to use for beginners like me. Within a few minutes I had everything set up and was already taking pictures. The pictures are great quality, and it was simple to upload them to the computer. However, within an hour the camera wouldn't turn on anymore, and it was strange because I wasn't using it for that full hour, rather on and off. I called up Samsung and they said that I needed a new battery, which is absurd because it only lasted an hour! This is definitely ridiculous, so now I need to look into buying a rechargeable battery. All in all, you should really take into consideration purchasing this product, but beware because it's a power sucker.", "Date": "December 28, 2005"}, {"Title": "Great camera - helpful reviews", "Author": "Johnny Boughtone \"Intellectual Poseur\"", "ReviewID": "RQK0PW9BS4OUY", "Overall": "4.0", "Content": "I bought this camera offline but was about to return it until I saw the reviews re the battery life. Amazon saved me a major headache trying to return what I thought was a broken camera. Instead I'm just going to buy the rechargeable battery FROM AMAZON. You just can't beat the power of social networking!Camera is great bang for the buck. Try to find another 5 MP camera in the same price range and you won't see much. This is a great entry level digicam!", "Date": "December 28, 2005"}, {"Title": "iam sorry i ever bought this camera", "Author": "C. Cordero \"ccross\"", "ReviewID": "R2KKOU6SE2JJQ7", "Overall": "1.0", "Content": "dont buy this camera the main problem real simply said it the battery life sucks and it is also a hard item to find(battery) good luck i dont even use mine any more just for that reason.and yes i can buy a rechargeable but iam not in the market to spend $70 for it.", "Date": "February 19, 2007"}, {"Title": "boo this camera... BOOO", "Author": "joybell", "ReviewID": "R1L9NW64VA3RHN", "Overall": "2.0", "Content": "i bought this camera because i was told that for a 'first timer' this is one to have. the quality of pictures if you zoom is horrible. its unbelievably slow, you tend to miss the shot or people get tired of waiting. and if you dont have the rechargeable battery, its impossible to find the disposable version. save up your money, buy one that will give you the quality that you really want. big time thumbs down.", "Date": "November 6, 2006"}, {"Title": "Great Camera", "Author": "Larry Collins", "ReviewID": "R1RWMQ4XE26GLH", "Overall": "5.0", "Content": "I also bought this camera at a local department store except on clearance...for 34.00 I thought it must be a flop..no it is excellent and by  the time i got the rechargable batteries at the clearance price of the camera i am still well under 80.00 for the camera and batteries.", "Date": "August 7, 2006"}, {"Title": "Don't Waste Your Time", "Author": "Alina M. Hensley", "ReviewID": "R9BQHWOBTIZ41", "Overall": "2.0", "Content": "I bought this camera 8 months ago when my Kodak EasyShare died three days after my first child was born. For $100 I figured I couldn't really go wrong. Oh, but was I was ever.Others have mentioned the battery issue. The Duracell it comes with died in a matter of four hours. I had two options, scour my hometown for the $20 replacement or drop $60 on a rechargable.At first it seemed like a great product, sleek design, tiny enough to slide into a jeans pocket, huge screen... I was in camera heaven until I really began to notice how the photos were turning out. The color/lighting balance on this little monstrosity is lacking at best. It hates indoor photos with a seething passion (regardless of how I set the different functions and sensitivities) and the only way you're going to get that perfect shot is if you have unyielding patience and TONS of bright, perfect lighting.Having years and years of both traditional and digital photography experience, I can tell you with utmost assuredness that I wasn't doing anything wrong (that I could tell.)The camera is very slow and the shutter speed is even worse. Don't for a moment expect to be able to take a crisp photo with the flash off. I've had endless frustration with this camera's quality and was especially shocked to realize my cheap Kodak was amazing comparatively.Today, nine months after purchase, the focus died. Now the camera turns on, but when you attempt to depress the shutter to bring your image into focus, it just makes a horrible grinding noise. The mechanism is obviously bust, but I can't say I'm disappointed. It gives me an excuse to buy myself a nice new one... Maybe another Kodak, I'm thinking  ;)", "Date": "March 29, 2007"}, {"Title": "Battery problem", "Author": "NYC reviewer", "ReviewID": "R3GR0ASOASJWJT", "Overall": "2.0", "Content": "I can't really say much about the picture quality because once the battery runs out you're in trouble. Theyr'e very hard to find, very expensive, and don't last very long. If you buy this camera, consider the nessecity of paying $70 for the also hard to find rechargeable battery. (Seriously, samsung should refund everyone who bought this since you can't use it.)", "Date": "February 13, 2007"}, {"Title": "Great camera", "Author": "Edwin Antonio Gamero", "ReviewID": "R2Y89UST2FEMU9", "Overall": "5.0", "Content": "This camera can take excellent pictures without using big files and the auto oprions are usefull in different enviroments. Buy the rechargeable battery and SD Card (512Mb) for this camera. The price is excellent according to pictures quality.", "Date": "July 6, 2006"}, {"Title": "SAMSUNG CAMERA", "Author": "K. BIRDWELL \"Kathytax\"", "ReviewID": "ROD8KJSPH3NID", "Overall": "3.0", "Content": "The camera is small and cute but the time between flashes is a little slow, the battery drains fast so buy the rechargable battery.  The reveiw function is terrible.  The pictures come in fuzzy and must \"clear-up\" between each photo--everytime you go back and forth.  This makes finding and reveiwing photos on the camera extremely cumbersome.", "Date": "December 26, 2005"}, {"Title": "Hate it!", "Author": "Kelly Victor \"Kelly98292\"", "ReviewID": "R3QVLUD1LBWTRX", "Overall": "2.0", "Content": "I hate this Camera. It's never worked quite right since day one. It's impossible to get a good shot because it's so slow.You can not use the zoom feature. The pictures come out soo blurry. Cropping is a joke. The screen locks up when scrolling through pictures. I have a $15 fuji that takes better shots than this one. If this was a $20 camera I would probably rate it higher. No way is it worth more than that.", "Date": "December 1, 2008"}, {"Title": "Great camera with many features", "Author": "R. Watson \"Electronics lover\"", "ReviewID": "RKJ1RY61KNYMX", "Overall": "5.0", "Content": "I recently purchased this camera and a fuji NP-60 charger and battery for the camera that interchanges with the Samsung camera.  The camera's LCD can be viewed very clearly when held at the right angle.  The camera has so many features that it will take some time just for me to learn all of them.  The camera has: 5x digital zoom, 2sec,10sec and double self timer, voice memo recording with photo, movie clip recording with sound, still image photo mode, self portrait mirror to take your own photo, 9 photo frames to insert photos , day, night, cloudy, exposure compensation, sharpness and image quality adjustments, photo rotator, copy to SD card, and many other features. It is small enough to carry in your pocket, or on your belt with the pouch provided. I am very satisfied with the camera after previously owning an HP digital camera.", "Date": "March 17, 2007"}, {"Title": "TERRIBLE!", "Author": "J. Brooks", "ReviewID": "RQ4B8XHU3ID7", "Overall": "2.0", "Content": "This camera is terrible.  The flash is slow, the battery dies very quickly.  And the picture quality when printing them out is horrible.  They are always blotchy.  When I called about this problem they said that you have to change the camera to 3 MP mode in order to get decent pictures.  But that still didnt work.  I would not reccommend this camera.", "Date": "September 18, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.0-megapixel sensor captures enough detail for photo-quality 13 x 17-inch prints\n5x digital zoom and 2-inch LCD screen\nVGA movie recording with audio at 24 frames per second and 15 frames per second\nStore images on 16 MB internal flash memory or use SD/MMC memory card slot\nTransfers photos via USB; compatible with Windows and Mac operating systems; powered by lithium CP-1 battery", "Name": "Samsung Digimax U-CA 505 5MP Digital Camera with 5x Digital Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51TF6RZQ53L._SX300_.jpg", "ProductID": "B0007ZGXQS"}}