{"Reviews": [{"Title": "Fuji E550 vs Sony DSC W1", "Author": "OC guy", "ReviewID": "R3A8AGYA68M5R3", "Overall": "4.0", "Content": "Ok.. I wanted a camera that was light, could fit in my pocket, used the AA batteries or the NIMH AA batteries, and of course could take great pictures.  The Canon A95 almost fits the bill, but it used 4 AA batteries while the Fuji and Sony use 2 AA batteries,  and is a little too big and heavy.Anyway, here are the Pros and Cons of each camera.Fuji E550 Pros:Great, very sharp pictures. (6 MP) I blew them up to 8 x 10 on my Epson Photo 700 printer and they were stunning! I have never seen such great output on my printer. The Sony DSC W1 is not even in the same league -- just look at the head shots on the Steves Digicam site and you will see how much sharper this camera is between the E550 and the DSC W1.  As far as color, great color saturation It should be noted that all Fuji cameras tend to shift more toward blue, the Sony shifts more toward green (as do most digital cameras including Canon). Some say this makes grass not look green enough, but to my eye, the grass just looks like a darker green, it still looks green though on a brite sunny day. Skin tones look fine.  I shot a pumpkin on the grass in bright daylight. The Sony shot had a yellow-orange pumpkin with light green grass, the Fuji shot had a very orange pumpkin with darker green grass. The Fuji shot was much sharper. I like the Fuji shot much better. Some say that the 6MP default is too compressed, I just don't see it.  And the default compression allows for more pictures on the 512 XD card (over 300 I think).2 A lens with great range - from 32 mm to 130 mm - goes wider and longer than most others. It is responsive and fast.The DSC-W1 is a 3 x zoom.3. A comfortable grip and a large 2 inch screen4. Lots of modes and options for the photographer to play with-Program mode, shutter priority, aperture priority, sport mode(the DSC-W1 doesnt have any of these) It should be noted that the sport mode is fair at best and does not compare to a real SLR such as the Digital Rebel), night, portrait mode, flash adjustment, white balance, program shift, continous autofocus, etc, etc..Fuji E550 consThe screen is practically unusable in brite sunlight.  It washes out in the sun, images turn too bright and white and washout, you have to use the viewfinder to take your picture in many instances and then review it on the screen by switching to playback mode and cup your hand over the screen .  The Sony screen works fine and you press button to instantly review your picture.There is no autofocus lamp on the camera.  Under low light the camera frequently cannot focus. In other words, you might have to turn on a light. However, indoor shots always come out better if you turn on more background lights.The flash does not always work properly indoors - I am not sure why.  The pictures sometimes have to be reshot because the flash did not fire. Sometimes I have to change my position for the flash to fire. However, when it does fire, the pictures look fine (and sharp)  The Sony fires correctly all the time and has the autofocus lamp to autofocus fine. It also has the instant review button of the shot you took.. which is handy.The Sony unfortunatly always chooses 1/50 of a second when you turn on your flash, the Fuji chooses 1/60 of a second.  That may make it a litter harder to get a clear picture on the Sony. The Fuji screen is also harder to use in lower light, but it is still more usable than in bright sunlight.The Fuji has a pop-up flash, it tells you you need to pop up the flash, it does not do it automatically (a small annoyance).  The Sony flash is built in.The build quality of the Sony seems better- a more solid camera, well built.  The Fuji seem flimsier, the pop-up flash may perhaps break one day.And my wife will probable hate the Fuji because of the screen being pretty much unusable in bright sunlight and the darn camera flash and autofocus does not always work well indoors under low light.  Of course she still likes our old Canon 2 MP S10 camera (which I was upgrading from).  So.... how to resolve this...... Here is my conclusion:I'm going to return the Sony.. I would have kept it it a heartbeat if it could take the incredible picture the Fuji can but unfortunately it just can't. And for me, it's about how much fun I can have with the camera and how tack sharp and colorful the pictures are that it produces.I'll put up the the shortcomings of the Fuji E550 --- and Fuji, if you read this review...... fix those shortcomings and you won't be able to make enough cameras because these will fly off the shelf.And my wife?  I'll let her stick the the Canon S10.  It's built well and will last for years to come.Loren", "Date": "November 16, 2004"}, {"Title": "Build Quality Not Up to Spec", "Author": "David", "ReviewID": "R1SEISD6BSUOEX", "Overall": "4.0", "Content": "The spec of this camera is very good, but the build quality leaves much to be desired, such as:1.)  Flimsy pop-up battery.  The button is shallow to pop-up the battery and the flash mechanism is built of flimsy plastic.  When you close it it latches only to one side leaving one side higher than the other.  On one camera, the flash stopped mid-way from full extension.  This was the third camera that had some issue with the flash.  IMHO, this flash is geared for failure..........I hop on FUTURE cameras, Fuji will have the flash built-in--no moving parts please--and please no cover sliding doors like other cameras like Olympus or Canon (which also fail)!2.)  USB/AV port has an UNHINGED plastic cover.  When you upload your pics, the plastic cover has to come off.  Since it's unhinged to the body of the camera (unlike the competition), the plastic is engineered to be eventually lost.3.)  Cover handle creaks.  All E550 cameras I tried has this creak on the handle when you gripped it.  The plastic obviously is not glued on proficiently.  I hope on future cameras they use a solid well constructed rubber grip like Kodak for instance.4.)  Uses ULTRA expensive xD cards.  One shouldn't be buying such a camera if they don't fully intend to be using the FULL 6MP (or 12 MP interpolated) for pictures.  Otherwise save your money and get a 4 or 3MP camera!  Since 6MP picture files are large, you need substantial memory size (not to mention a good sized hard drive!).  A 512mb memory card is a good STARTING point.  In this regard, xD cards from Fuji or Olympus cameras cost 2-3x as much as the nearly universal SD or Compact Flash cards.  The pice difference is SUBSTANTIAL enough to make this camera a deal breaker.  For instance 1GB of Compact flash memory is $220+ cheaper than 1GB of xD!....That's enough memoy to upgrade one's camera to a markedly better level!Now the picture quality dings:1.)  No autofocus lamp for dim light pics.  The lack of the lamp causes the camera to take blurry and wrongly exposed pictures.  A AF lamp (like what other competitors have), will solve much of this problem.  The much more expensive brother F810 has the lamp, but it should be included on this model.2.)  Pictures has purple finging.  While smaller amounts of fringing was shown in high contrast outdoor pictures than Canon, for instance, the E550 still had more consistent fringing from pic to pic.  In other words, most of my outdoor pics had fringing--more than even Canon.  Though, when Canon shows the fringe on a picture, it's much more egregious and noticeable on a 4x6\".3.)  Many outdoor pics were overexposed on high contrast scenes.  The effect caused branches, architecture, for instance, to be bleached out or whited out......While many compacts outside the digital SLR have this problem, this camera had a higher than average bleaching.  So bad on some pics, as to be deleted!  The preview LCD won't be of use as it's too small to capture all the bleaching going on. This bleavhing problem was much worse than the fringing.  The fringing is much more forgiveable since it's smaller than the HUGE bleaching going on.4.)  Pictures such as grass shots are blurrier or muddier than competing 6MP cameras.  The Fuji CCD interpolates data differently thus adding detail in a manner that doesn't contribute to better detail.  The Fuji CCDs are very controversial in this regard among the pros.5.)  Flash takes 5-9 seconds to recharge from picture to picture!!  This is absolutely horrendous perfromance compared to other cameras!  By the time your flash is recharged, the picture taking opportunity is usually lost.Camera PROS:1.)  Great specs for it's pricepoint!  Many manual controls for the serious amateur.2.)  Good video.3.)  Glad they use AA's instead of expensive proprietary Li-Ion.4.)  Snappy start-up, zooming, and scrolling through pictures in memory.  One of the best out there in this regard.  Well done!5.)  Small size.6.)  No lens covers to fuss with.7.)  Lens starts at 32.5mm!  GREAT JOB!  Most small digicams start at 38mm which is abyssmal for close indoor or room shots.  32mm is a good repectable widezoom that I hope the rest of the industry will take heed!8.)  Good 4x zoom.  Better range than most 3x zoom cameras.9.)  Good, snappy Fuji colors on pics!All in all, this is a solid camera that will appeal to many on a budget.  I'm a serious enthusiast picture taker, so I will be overly critical with any camera under $1000.  I think Fuji has a near budget classic on their hands if they take my suggestions to heart and make required changes.For me, the flimsy flash, creaky handle/construction, expensive xD cards, and bleaching/fringing in pictures is enough to supercede a purchase.  If these issues aren't important to you, then you should be very happy with this camera.  All in all, one of the better cameras in its pricepoint.", "Date": "September 26, 2004"}, {"Title": "Too good to be true?? NO!", "Author": "A. K. Sholl", "ReviewID": "R35040R4YJJ658", "Overall": "5.0", "Content": "I was very skeptical of this camera. Since Fuji is not considered one of the \"top\" brands, and this camera has so much for the money. But I went ahead and ordered it, and have not regretted it for one minute! Unless it disinegrates in my hands in 6 months, this is an awesome camera!PROS:*Obviously, the 6.3MP (not 6.12) and 4x zoom*2\" crystal clear LCD - so much better than 1.5\"!*Long range flash - I think the manual says up to 10', but I had no problems even at about 15'.*Super fast start up - takes <2 seconds.*Will take standard AA batteries - they only last about an hour, but if your waiting to recharge, they'll get you through.*I like the size - it's a little too big for a pocket, but it gives me something to hold on to. I looked at a Canon Elph and it just felt too small!*Very solid. Doesn't \"feel\" cheap at all.CONS:*The flash takes FOREVER to recharge! In sunlight, the camera is ready to take another picture in <2 seconds, but if you're using the flash, be prepared to wait about 7 seconds!*I'm not real crazy about the pop-up flash. I'm afraid it will break.*It might be like this on all cameras, but the manual wasn't very useful. On advanced features, it would tell me things like HOW to change the aperture, but not WHY I would need to do that. But for normal photography, the camera is very easy to use.I have no idea why this camera is so inexpensive (I got it for $325 from an internet company). It must just be that Fuji has not made a name for itself yet in the digital camera field. But I highly recommend it!", "Date": "September 10, 2004"}, {"Title": "Best Camera at this price range", "Author": "Trader John \"Trader John\"", "ReviewID": "RKQ5YMHPMZNLI", "Overall": "5.0", "Content": "I am a Nikon fan and own Nikon SLR as well point and shoot camera. I am a programmner with love for technology. However, I have hesitated to dive into the digital world due to he low price performance ratio.My requirements are 1) reasonable resolution, 8mp = 35 mm film. The camera got to be at least 5 mp or more. 2) reasonable shutter lag. 3) reasonable price for what you get.Fuji E550 fits the bill. E550 is replacing my point and shoot (I paid 250 6 years ago). With the 50 rebates, I paid 245 for the E550. Shutter lag is .28 sec. topping the Canon A95's 2 Seconds and the miserable Nikon 4nnn cameras. And its 6.1 mp better than both the nikon 4nnnn and Canon A95.On top of other reviewer's comments, I've found picture from the Fuji has very natural skin tone. Great for Kid's picture. Vivid color. Camera is good size for handling. (Small camera invites camera shake) It got more features (some professional features such as auto bracketing) than I expect for the price. The menus system is not the easiest to use in the world. But it is not hard either. As an advance photographer, love this camera. My wife is a pure point and shooter loves this camera. The pictures are better than my old point and shoot.The low shutter lag was very important. A friend of mine bot a Nikn 4100. He complained the long shutter lag causing him to miss picture opportunities of his kids. He then returned the Nikon for an E550. He is one happy guy and praises my recommendation everyday!One important aspect, E550 got low noise ratio at ISO 200 400 and 800. Try that on Canon A95 or Nikon! These high ISO sensitivities afford much more picture taking fexibility for low night shots and action shots.The brand name Fuji have me hesitated. It's not Nikon or Canon. After three weeks, I am sure this is a winner. Of course, there are better cameras at 6, 7, 8 or more mp out there. With E550, you got much more than what you pay for at this time. That's why the 5 stars!", "Date": "February 17, 2005"}, {"Title": "A lot of camera for a little money....", "Author": "B. Drasby \"bpdraz\"", "ReviewID": "RX0D2JJBZRDJB", "Overall": "5.0", "Content": "I will start off with the negative aspects of this camera. I agree with everyone that the flash is flimsy and that the LCD is useless in bright daylight sun. We must keep in mind that an amatuer photography would rely on the eye viewer versus the LCD screen.I've never had any focus problem with low lighting, perhaps that is because I go in and play with the manual controls and set my ISO and aperture. This is not the kind of camera that the average person should pick up for quick point and shoot pictures. A camera like this is more for the hobbiest who knows a thing or two about photographer.This camera truly takes nice pictures and because of the high megapixels I'm able to blow my distance pictures up with little to no distortion.This camera is worth the money for the hobbiest who can not affordone of those high priced SLR digital camera that run at a $1,000 and better.", "Date": "April 2, 2005"}, {"Title": "Fuji E-550 Digital Camera Review", "Author": "S. J. Weber \"speaklightly\"", "ReviewID": "R3W1EO404YTXXJ", "Overall": "4.0", "Content": "The Fuji E-550 digital camera is Fuji's first digital camera aimed specifically at the consum digitaL camera market. It delivers a lot for the price. With 6mp and 4X optical zoom this digital camera has a lot of advance features such as a raw image format and a manually set white balance in addition to the white balance presets.The E-550's digital photo output is great. Like so many digital cameras its flash unit only operates out to about 10 feet with the normal settings. However that range can be extended up to 25 feet by adding a slave flash and some camera adjustments.All in all, this is a high value camera. You get a lot of quality, features, and flexibility for a very fair price. I would buy another without any hesitation and I do enthusiastically recommend the Fuji E-550 nto others.", "Date": "August 23, 2004"}, {"Title": "\"Zoom Error\" is a major problem for this camera.", "Author": "Ross \"Ross\"", "ReviewID": "R3HG5DNZSUFNDS", "Overall": "1.0", "Content": "The photos I take with this camera have been great, however, I just experienced the same \"Zoom Error\" problems many have mentioned.  It should definitely be factored in to your purchasing decision.To those with the Zoom Error issue - try this!I had the same problem with mine and I tried several suggestions, BUT the only one that has worked is to gently grab the lens, pull it out as far as it will go until fully extended. While keeping it extended turn the lens to the right until you hear a click. Once you hear the click, release the lens and turn the power button on and then back off again. This should take care of the problem. A word of warning. ALWAYS make sure your fingers do not touch the front of the lens when you power on the camera. Even the slightest bit of obstruction seems to make the problem reoccur. Another note. I had tried this several times until I finally heard the click, so please don't give up on it, just keep trying. This will work and it will save you a lot of time and money having it fixed.", "Date": "February 6, 2006"}, {"Title": "Excellent Picture Quality", "Author": "Mark F. Stratton", "ReviewID": "R1UQ66YWYU2GPK", "Overall": "5.0", "Content": "I have had this camera since Dec 2004 and have been very pleased with its performance.  Quick turn on and fast shutter lag, excellent color and sharpness, nice video mode, and AA battery use make for a great match for me. I have had no problems with mine and my only complaint is that the viewscreen is hard to see in bright sunlight (like many LCDs). A larger starter Xd card would also be nice, but that is easily overlooked when you see the photos.", "Date": "November 29, 2005"}, {"Title": "Good Little Camera", "Author": "Charles Robinson", "ReviewID": "R3090AH66ZP1DK", "Overall": "4.0", "Content": "I bought a Fujifilm E510 from Best Buy for $299 last year, and I liked it so much, I bought the E550 from Amazon and paid just $5 more for a superior camera.  Both cameras have the same faults that Loren mentioned, yet they are \"keepers\".  I can't believe how clear the pictures are, both in the viewfinder and in print.I also bought the Fujifilm 512 MB XD Picture Card to go with this camera.  With this chip and with the E550 in movie mode, I can take a movie for up to 14 minutes.  With the E510 and a 256 MB chip, the maximum recording was just 180 seconds, and that after reducing the resolution to a small screen size.  The audio playback is very clear and realistic, even though it is mono and not stereo.One irksome thing: I have just one Fujifilm FinePix CP-FXA10 Universal Cradle, and I have the adaptors for the E510 and for the E550.  The adaptors are not universal, and I have to swap them out depending on which camera I plug into the cradle.  Why can't the adaptors be universal, too? (For that matter, why is there a need for the adaptors?)Oh, and the included rechargable batteries for the E550 cannot be used with the cradle.  I have to swap out the batts, too.  So I ordered another set of batts that are compatible with the cradle today.Overall, I love the two cameras.  I like the quickness of the E550 when powering up vs. the E510.  Both take GREAT pictures.", "Date": "May 9, 2005"}, {"Title": "After only a month-superb camera with one caveat", "Author": "R. Martenis", "ReviewID": "R29R21N3ZWR6NI", "Overall": "5.0", "Content": "Bought this camera after reading a lot of reviews (pro and am).Mostly for fast shutter and great quality photos. I can live with focusing problems at low light and lcd not twistable. Love the optional settings. My problem is that in dozens of reviews nobody ever mentioned the fact that a small, light camera is much more difficult to hold steady than a larger bulkier camera. This camera is great for sliding into a pocket, and is only slightly smaller than previous Kodak, but is so much more difficult to hold steady (especially with zoom). I am using tripod a lot more now.", "Date": "March 21, 2005"}, {"Title": "Great pocket sized one hand camera", "Author": "A. Oslapas", "ReviewID": "R3T44UOKICPLSD", "Overall": "4.0", "Content": "Love using it.Very versatile, very clean enlargements.Great video.Fast response.Intuitive, very easy to master controls.Poor optical viewfider.", "Date": "August 26, 2004"}, {"Title": "Almost perfect camera", "Author": "P. Wu", "ReviewID": "R22A6HWRQRQQHH", "Overall": "4.0", "Content": "I use this camera mostly indoor with flash. I've taken only about 100 photos with it so far. What I like:- fast start- uses AA batteries- decent flash pictures at wide angle- 2\" LCD- simple to use menu- no shutter lag and quick postviewDon't like:- slow flash recycle time- flimsy popup flash- expensive xD picture card (but it's a one-time cost)- when zoomed to telephoto, aperture becomes so small that most flash photos are underexposed. I end up moving closer to the subject to take flash photos at wider angle.- often I would notice a large patch of black object in a photo. It seems dark objects are unusually black, or color seems missing somewhere. Nobody else mentioned this; is it just me?There are no red-eyes in the photos I took. However, all my subjects so far have black eye color, so I can't say how well this works on lighter color eyes. It is defintely better than my old canon S230 (it gives everyone red eyes).I put two 2000mAh NiMH in the camera three weeks ago and after taking 100 photos (more than half of them with flash) I still haven't had to recharge them yet. The camera comes with 2300mAh NiMH -- higher capacity than the ones I'm using.", "Date": "January 31, 2005"}, {"Title": "Great little camera!", "Author": "J. Andersen", "ReviewID": "R3M1X9I30EBZ46", "Overall": "5.0", "Content": "No technical information here.  Just my opinions.This is a fantastic camera!  I have have wonderful luck with Fuji in the past, and they did not let down this time!The recharge rate is very fast.  I read one person say it's 5-9 seconds.  I don't know what kind of watch he uses, but it does not take that long at all!  Even with the flash on!  (Yes, the pop-up flash is flimsy, by the way!)The color is great!  My last camera tended to run in the yellows.  I rarely have to adjust the color with this camera at all.  Same holds true with exposure.  Indoors and outdoors, I rarely have to adjust the exposure when editing pictures.I am still getting to know my camera.  The multi-shot feature takes practice to avoid major blurring.  But, I know I'll get that down.The grip is fantastic.  I can have a firm hold on the camera while chasing my 3 year old son around!  That makes taking pictures of him much easier!  He is, after all, the reason I have this wonderful little camera!", "Date": "March 10, 2005"}, {"Title": "Nice features but very unreliable.... faulty twice!", "Author": "PoobaDaddy", "ReviewID": "R3QT35PRTX5RGM", "Overall": "2.0", "Content": "I purchased an E550 in mid-August for a trip to Niagara Falls and after the first couple of pictures; the camera's retractable lens would not retract. It kept showing a \"ZOOM ERROR\" and all attempts to remedy this was futile. I rushed back to our hotel room and read the manual which simply said to contact the manufacturer. Still undaunted, I replaced the batteries and tried again to no-avail. Immediately after our trip which we only had 2 or 3 pictures to show for it, I returned the camera to the store I purchased it from for a new one.We then used the camera for a baby-shower in September and the E550 seem to redeem itself. The next time we called on the camera to perform was for my wife's birthday in October and after just two pictures, the dreaded \"ZOOM ERROR\" appeared again. I was disappointed and the words to describe how my wife was feeling would not be appropriate for this review. Needless to say we have returned the E550 back to the store it was purchased from and are wondering what else to do. I initially went with the Fuji E550 recommendation after reading a write-up in a Consumer magazine and I wanted to see it anyone else had encountered the same problem with this digital camera. Don't get me wrong, I really like the features the E550 offers and at the price, it's a steal but two BIG occasions and two BIG disappointments has got me in serious doubt.", "Date": "October 11, 2005"}, {"Title": "Great camera", "Author": "Anita Horning", "ReviewID": "R39688ENVYEJJ3", "Overall": "5.0", "Content": "I love this camera.  When shoping around, the 2 most important things I was looking for were a short shutter lag time (the time between depressing the shutter and getting the shot), and really good resolution.  I like to crop my pictures as well as enlarge portions of shots, so the 6.3MP with the Super Had was a big selling point right there.  This camera also had the shortest shutter lag of any that I tested at the time.  It's certainly barely noticeable.  Unlike many others, I actually like the pop up flash, since I can choose not to use it.  I dislike the harsh contrast with a flash, and in many cases (such as my recent trip to Europe) there are occasions where a flash is forbidden.  Even in very dark churches, I had good results using the automatic feature with no flash, or the nighttime setting.I also enjoy the feature that allows you to choose either the aperature or shutter speed, and the camera chooses the apropriate complement.  This is a good way to play around with manipulating your shot without having a perfect knowledge of photography rules.I'm perfectly happy with the Xd card.  I'm not sure where all the \"it's too expensive\" stuff is coming from.  I bought a 128MB card at best buy for $20, and it would have been cheaper if I hadn't accidentally thrown away the packaging and thus was unable to send for the rebate.  It hold's about 86 pics on the highest shooting mode, which was more than enough coupled with the included 16MB card for my recent trip.  I actually find myself using the smaller card (which holds 10 pics) more often around the house since I usually like to upload my photos right away.The only drawback I see is the cover to the USB cable.  I haven't lost it yet, but have forgotten to put it back on the camera a few times.  I'm guessing this is why they include 2 in your package.", "Date": "December 17, 2005"}, {"Title": "This is the one to buy", "Author": "some guy", "ReviewID": "R3S31Y35UKT5WM", "Overall": "5.0", "Content": "Great point and shoot camera for beginners and intermediates, although experts will not have much use for this camera.  Simple to operate for a beginner and get great pictures out of it, this camera is great.  The 2 inch lcd is very large compared to most cameras and the camera overall has a nice feel to it.Pros:  Decent sized, small enough to fit in pocket.  Great pictures, adjustable options (ie:  flash brightness, shutter speed, flash type, picture quality, ect), little to no shutter lag(time from picture to picture).Cons:  Insufficent flash for objects more than about 15 feet away, no autofocus lamp so autofocus in dim light situations is nearly impossible, Xd cards are still expensive compared to the common compact flash(although they are comming down in price).This is the camera to buy if you are new to the digital camera world, or if you want something just a little bit more advanced than an entry level camera.  If you are not concerned with price and don't care how small it is, you could go for the larger cameras from canon that go for $1000's.  But for the average person, this is the one to get.Update:  After taking this camera on several trips, i have a few minor complaints to add.  First and most importantly to me, the selection wheel thing on top turns way to easily for my taste, leaving it to select a mode other than the one i had selected between putting it in my pocket and pulling it back out.  Indoor pictures and other low light situations suck; the flash is basically useless unless your taking a picture of something about 5 feet away from you.  Still working for me though; these minor complaints should not deter you from buying this camera.", "Date": "February 12, 2005"}, {"Title": "If you're even THINKING about buying this camera...", "Author": "Torin \"DrumFox\"", "ReviewID": "R3NEEMMN04HS7N", "Overall": "5.0", "Content": "...Here's EVERTHING you should know. (To skim read: read bold statements). I got this camera for an early Christmas gift last year. I've used it on vacation (GREAT VACATION CAMERA!) Let's get right into it...>>>Design--the design is sleek and sophisticated. Silver and shiny but FINGER PRINTS WON'T SHOW. LIGHT WEIGHT. 2\" SCREEN DISPLAY. all great things about the E550. pics can be up to 12 MEGAPIXELS!!! AMAZING!>>>Start up, shut off---EXTEMELY FAST CAMERA. Start up is about 1.5 seconds. Great for Point and Shoot. Just pop in two AA batteries and a mem chip and you're set. BATTERIES ARE FINISHED WITHIN 45 MINUTES! not good but excusable.Shooting Modes---all on a dial at the top>>Night- for night shots. Automatically sets a long exposure so it can take all the light but the shots come out extremely blurred most of the time. NOT GOOD*.>>Sports- for shots of movement. Automatically sets a short exposure but the scene usually ends up being too dark. NOT GOOD.>>Landscape >>>> nothing special about either>>Portrait >>>>>> both pretty normal to me. NOT GOOD.>>Auto- BEST FOR POINT AND SHOOT. Lighting gets a tad greener that naturally but that's acceptable. VERY GOOD.>>P-(Programmed) goes to a preset shutter speed and a certain aperture. Handy if you plan on taking pictures from the same place over and over again. SOMETIMES HANDY.>>S-(Shutter Speed Priority) USED THE MOST OF ALL. The system it uses...you select a S.S. and the camera selects an aperture. If the aperture number is red, you have to change the S.S. EXTREMELY COOL TO USE. MAKES IT SIMPLE TO TAKE GREAT NON-BLURRED PICS.>>A-(Aperture Priority) sometimes helpful for there are less Ap. settings than S.S. settings so it's faster to find the right combo except sometimes WHEN USING THE A_PRIORITY YOU CAN'T FIND THE CORRECT COMBINATION.>>M-(Manual) you can choose both the Aperture and the Shutter Speed--handy for your own special pictures with weird effects. can be real cool.>>Movie- THIS CAMERA CAN TAKE GREAT VIDEO--THOUGH NOT ENOUGH TO FILL A TV, IT CAN FILL THE SPACE ON A COMPUTER MONITOR. VIDEO CAN LAST FOR A SURPRISING AMOUNT OF TIME! Can be great for precious moments but NOT GOOD WITH SOUND!>>>Menu Features---on the menu button>>Timer-for TEN SECONDS SO YOU CAN GET IN THE PICTURE TOO, two seconds so you don't shake the camera by pushing the shutter button**, and off if you had it on (but after each pic, the timer shuts off, can be annoying if you want to take more than one).>>WB-(White Balance) pretty much the lighting. AUTOMATIC LIGHTING, programmed light (haven't figured that one out yet) SUNSHINE, CLOUDY, LIGHT BULB LIGHT (indoors, most common) and three others that always make everything a different shade of red (strange). CAN'T CHANCE WHITE BALANCE WHEN YOU'RE IN CERTAIN MODES.>>Focusing- Auto focusing: CENTER FOCUS, MULTI AREA (<< most common), AREA--YOU CAN SHIFT THE BRACKET IN THE CENTER OF THE SCREEN TO ANYWHERE SO IT'LL FOCUS ON WHAT YOU WANT--, Continuous, the camera will continue to focus on things (usually IT'LL FOCUS WHEN THE SHUTTER BUTTON IS PUSHED HALFWAY DOWN) and will use up a lot of battery, even faster! Manual focusing: Um...I don't know how to do it. STICK WITH AUTO FOCUS!>>Photometry-Average, spot, or Multi, I have absolutely no idea what they change...I assume that multi is the best.>>Continuous Shooting-Top 4 (HOLD THE SHUTTER BUTTON DOWN AND WILL TAKE FOUR PICTURES CONSECUTIVELY, VERY COOL) final 4 (hold the S.B. down and it'll save the LAST four pics you take, a little weird but kinda cool) bracketing (takes three pics consecutively under different settings, kinda neat but it has never helped anything) and 40 frames (TAKE UP TO 40 CONSECUTIVE FRAMES BACK TO BACK AT 2 MEGAPIXELS, pretty cool)>>Options- change a few settings (not to do with the pictures) like brightness of the screen and volume of THE BEEPING (which SHOULD BE TURNED ALL THE WAY DOWN can get pretty annoying, each click of a button is a beep!)>>Bracketing- change the range of something, I have no idea NOT HELPFUL>>Sharpness- Hard (For distance photos) normal, soft (closer up)>>Flash- adjusts the brightness; don't really need to be adjusted because THE FLASH IS ALWAYS EXTREMELY BRIGHT! BUT USUALLY UNNECESSARY***!>>>Flash and Marco---change by pressing the buttons around the menu button>>Flash- (Press the button of the left side of the menu) change the flash between...off, automatic, RED-EYE REDUCTION (this WORKS REAL WELL), Slow Synch flash (flashes right at the beginning of a long exposure usually) Slow Synch+ red eye reduction (mixes the two)  IT WILL NOT FLASH UNLESS YOU PRESS THE FLASH BUTTON SO THE LIGHT BULB JUMPS OUT. IT WILL TELL YOU IF YOU SHOULD HAVE A FLASH.>>Marco- (Right side)for close up, on/off. doesn't change much.>>>Special FujiFilm Modes---(not real special)>>Quality- 0.3MP (for tons of pictures) 2MP, 3MP, 6MP (the one I use the most...YOU CAN TAKE 84 PICTURES AT 6 MEGAPIXELS ON A 128mb xD PICTURE CARD 12MP, 12MP fine...A STUNNING 12 MEGAPIXEL CAMERA, THAT PRINTS UP TO 20\" x 15\"!!!! THAT'S HUGE and it's FINE so you can't see the pixels.>>ISO-(Light Sensitivity)80, 100, 200, 400, and 800 at 2MP nothing special>>COLOR- standard, chrome (saturated color, cool) Black & White>>>Lense--->>Zoom--OPTICAL ZOOM IS 4X!! REALLY GOOD! digital zoom (do not use) is 6x. Lense extends from camera about two inches.>>Attachments--PRETTY MUCH NOTHING YOU CAN ADD ON THAT'S CHEAPER THAN $100!!! It sucks!>>>WHEN YOU LOOK AT THE LCD DISPLAY, YOU CAN SEE WHAT THE PICTURE IS GOING TO LOOK LIKE. YOU CAN ALSO SEE ALL OF THE SETTINGS. WHEN YOU PUSH THE S.B. YOU CAN SEE IT FOCUS AND ALL THE SETTING DISAPPEAR. EXTREMELY NICE!!!!<<<>>>Reviewing the Pictures--- you can flip and small switch to change from taking pictures to viewing them. easy to switch.>Display--push to change from seeing the picture with the DAY/TIME to seeing just the picture, to seeing nine pictures (good for browsing)>+/-  push that button to see the specifications of the photo.>Menu Items-->>Erase-single frame, all frames>>Protect-single frame, all frames>>Playback-four modes for viewing all your pictures in a slide show (NOT GOOD)>>Voice memo-USELESS, I think. You SHOULD be able to remember the picture, you took it!>>Trimming-EXTREMELY USEFUL!!! YOU CAN CROP A PHOTO BY ZOOMING IN AND SHIFTING THE IMAGE, VERY NICE TO USE. IT WILL TELL YOU HOW BIG THE AFTER-IMAGE WILL BE>>Options-same as before the other options...>>>it'll tell you if you get low batteries<<<>>>comes with hand strap<<<>>>comes w/ 16mb...pretty much completely worthless <<<>>>comes with two batteries+charger<<<GOOD!Keep in mind the 12.3 megapixel is from the super CCD sensor which means the image is interpolated(pixels are added)*what happens with a long exposure, for instance, cars: if you're in a car taking pictures of the lights of other cars as you pass them, set the exposure real long. the lights will trail behind the car and the effect looks really cool and professional.WHAT I RECOMMEND WITH PURCHASE---1. A TRIPOD, TALL NOT TABLE, BECAUSE WHEN PUSHING THE SHUTTER BUTTON CAMERA TENDS TO SHAKE CAUSING BLUR2. A CARRYING CASE FOR ALL YOU STUFF3. >TWO< 128MB xD PICTURE CARDS4. EXTRA SET OF BATTERIES AND >ANOTHER< CHARGER5. USB PORT COMPUTER CONNECTION, MAKES TRANSFER EXTREMELY QUICK!BOTTOM LINES: GREAT, GREAT CAMERA. FOR THOSE WHO LIKE TO EXPIRIMENT WITH PHOTOGRAPHY. THIS CAMERA HAS THE MOST FEATURES OF ALL THE CAMERAS I'VE SEEN! IT'S THE BEST CAMERA YOU CAN BUY.DON'T SETTLE FOR ANYTHING LESS THAN THE FUJIFILM E550!~T*RIN 5lbscatfood.blogspot.com", "Date": "January 12, 2005"}, {"Title": "Love it as much/more as my first Fuji", "Author": "B. Essex \"B. Essex\"", "ReviewID": "R239ZQKKGES7IJ", "Overall": "5.0", "Content": "(...)Having said that:I purchased my first Fuji Digital in 2001.  It is 3.3 Megapixels and was truly state of the art at the time.  I paid over $500 for it.  *grin*  Yes, technology always gets cheaper!  It has worked flawlessly for over 4 years now without a hiccup.  I am sure I will keep using it as a 2nd \"point and shoot\" digital camera.I have used that Fuji for many thousands of photographs in just about every imaginable situation.  I have a photo on a commerically published music CD jacket that I took with that camera.  I also have numerous photographs on commerical web pages that were taken with that camera as well.So, when I decided it was time to upgrade to a higher pixel point and shoot - I price compared with other brands, but Fuji was the only name I seriously considered.The one flaw that existed in my first Fuji has not changed with this one:  The flash has to be opened manually.A few complaints I noticed in other reviews that don't apply to me:I am not bothered by the USB cover, as I always use the storage card to download the pictures into my computer.  I'm also not bothered by the LCD screen not being able to be easily viewed in bright light.  99% of the time, I do not use the LCD screen when taking pictures.  Since I take pictures with SLR's, I've never gotten into the habit of using the screen - I use the viewfinder.Expensive memory cards?  I don't know where the people that complained about expensive memory cards are shopping at.  It is about impossible to spend more than $50. for a generous sized MB memory card.  I keep 4-6 memory cards going at all times - because, as I mentioned before, I use the cards to download into my computer.The photos are crisp and bright.  They have a lot of depth.  I have found that the black/white mode is something I am using on some shots.  My old Fuji doesn't have this feature.  I did not know if the \"vivid\" mode would be something I would use, as I use Adobe Photoshop for editing any photos that are keepers.  However - it really is very handy and does make colors \"pop\" on outdoor landscape shots that have varied colors of green.I'm not going to go into a pro/con list, or a long detailed review of every feature.  There are already several reviews that do that.I just wanted to give this camera the 5 star review that it deserves.  I'm sure it will be another 4-5 years before I need to upgrade from this camera.  I'm very pleased with my purchase.", "Date": "December 18, 2005"}, {"Title": "Terrible problems with Fuji E550", "Author": "Brad J. Faltermeier \"FotoJunky\"", "ReviewID": "R1VIHDPZOTMQ13", "Overall": "1.0", "Content": "I purchased my Fuji E550 brand new online and have had the same problem happen repeately.  I have had FUJI repair it for free under warranty twice, but the camera just keeps failing in exactly the same manner.  At first, the camera worked fine for about 6 months.  After the first repair it worked for about 2 months.  After the second repair it lasted LESS than one month, with very little use.It encounters a 'ZOOM ERROR' randomly and freezes up so that it will no longer take pictures.  I can view my existing photos, but that is all.  I have informed FUJI that this is obviously a lemon, but they refuse to replace it. Their factory authorized repair facility won't even inform me of what they did to get the camera working again.  I don't know if they replaced any parts or what.Terrible customer service and HORRIBLE reliability for this unit.  I wish I could get my money back and get a different brand of camera.  I will never buy another FUJI product.  I can't tell you how many photo opportunities I have lost due to down time while FUJI 'repairs' it.Take my advice-  don't buy a FUJI.", "Date": "July 1, 2006"}, {"Title": "Dont Be Fooled By First Impression - Lots of Problems Here", "Author": "Alana H. Shores", "ReviewID": "R2WZWBRS5YUMOJ", "Overall": "2.0", "Content": "I am giving this camera two stars only for the absolutely terrific pictures it took WHEN IT WAS WORKING.  This camera came highly recommended on all the camera review sites and consumer reports and for the first 11 months I wouldn't have traded mine for any other camera out there.  That is when the problems started and they are big camera ending problems.  I first had the problem many people report about washed out pictures outdoors no matter what settings you use.  I thought maybe it's me or the weather is too hazy, or bright.  Then the dreaded banding problem came.  It looks like a giant fingerprint or TV test pattern of shadowy lines all over your pictures.  All pictures are now unusable and I am currently in disupute with Fuji over fixing the camera.  If you look up these problems online like at Google or Yahoo search you will see many, many, people have had the same issue with sometimes no luck in getting Fuji to fix the problem or repeated failures of the camera even after repairs.  Heed my advise DONT DO IT.", "Date": "July 17, 2006"}, {"Title": "common lens defect - read this before buying", "Author": "non-impulse buyer", "ReviewID": "R3LZM95EM2F25K", "Overall": "2.0", "Content": "I am one of the many purchasers who likes this camera but suffered the dreaded zoom error (see the reviews of others who had the same problem).  According to a Fujifilm technical service representative (who was very familiar with the problem), it occurs because the lens is designed to come out so rapidly.  Fujifilm is replacing the current lens assembly, but it is not clear when that change is taking place.If this problem happens to you, the repair to replace the lens assembly will cost about $150 unless the camera is within its one year warranty.  Fuji estimates repair time will be about 4 weeks.So think hard before you buy this camera and ask lots of questions.  I really like the ability to take rapid shots in succession, intuitive menus (unlike my Canon), and excellent picture quality.  However, I probably would not have bought it if I had known of this design defect.", "Date": "February 1, 2006"}, {"Title": "Great Camer", "Author": "Rmcv123", "ReviewID": "R9X0YNU2FHAK4", "Overall": "5.0", "Content": "I have try many other camer.  I finally settle with this as upgrade from my 2megapixel fuji finepix 2600 which is a great beginner camera.Pro:use double AA battery which you can get anywhere.  I do recommend use the nimh rechargable batter.  They are cheap anyway compare to those custom battery.6 MP for less than $300 after rebate.(Wow)Good Picture quality.Con: a little bulky. Expensive xd card. Battery runs out fast with flash.  But this is true for all camera anyway.My experience with the camera:I bought a 512 md xd card make by SankDisk right after I got the camer.  However, most my indoor picture turns to very dark.  I spend a lot of time to read the manual and learn many adjustment.  Since I am not a professional photographer, I very have no idea I am doing.  At the moment, I am very pissed with the camera.  I was about to throw it at the floor. Finally,  one day, the xd picture suddenly unreadable by the xd card reader.  I went to circuit city and return the sanddik xd picture and I saw the 128 md fuji xd memory card (made by fuji) on sale.  I bought it and want give the camera last try.  Oh Boy, what a different.  All the sudden, my picture turn out very clear for my indoor and night picture.  I don't know why. I suggest stick with Fuji brand xd picture card for this camera.  I have use the auto mode, with auto iso with geat picture.  For very dim light indoor picture, I manually set the iso to 400, I got very clear picture.Note:  higher the iso, the more noise on the picture.  Howerer, if you are printing, 4x6, you probably won't notice the noise with iso  400.I love this camera now.", "Date": "December 20, 2004"}, {"Title": "Finepix? (if it works...)", "Author": "John Davis \"JDinthePlace2b\"", "ReviewID": "R1N7WPBI4GKQ5X", "Overall": "2.0", "Content": "I researched cameras for a long time weighing price, quality, and functionality all very heavily.  I even used Consumer Reports to help me in my decision.  I came up with the Fujifilm Finepix E550. This Camera was a great buy for the price...at first.  Over time I found out the pros and cons very clearly.It has excellent quality pics (if taken during daylight hours), a nice size viewing screen (but you can't see it very well in direct sunlight) and several functions I was looking for in a camera. There is no autofocus lamp so when taking pictures in dark areas or at night you probably won't get a focused pic unless you have a tripod.  I was willing to overlook all these things due to the price until now.I don't think I've had this camera over 2 years but now suddenly the lens has stuck and won't close or open fully.  This camera is in operable at this point and it makes me so sad.  I agree with other reviews about the flash being flimsy as well since it feels like it could just break off if you bumped it.I'm looking for a new camera now I just hope I don't find one with so many problems.", "Date": "July 28, 2006"}, {"Title": "FINEPIX E550", "Author": "Myron D. Brockman", "ReviewID": "R2WY7SBUXIQM3L", "Overall": "1.0", "Content": "I bought this camera after it was rated a 'bestbuy' at Consumer Reports. The flash is extremely flimsy and I have never seen a point and shoot camera with such a rinky flash setup which needs to be extended before use. After 4 days in the Grand Canyon the camera began vignetting and overexposing and no amount of tinkering with the exposure settings have improved this fault. All in all it has become useless. This has definitely soured me on Fuji cameras and I will look elsewhere to Nikon or Canon for my next camera.", "Date": "July 5, 2006"}, {"Title": "Great Camera", "Author": "Jasper", "ReviewID": "RE95WS9HYSYRL", "Overall": "5.0", "Content": "This camera is awesome. The start up and shut down time is extremely fast as is the auto shutter speed. What's great about it is that you can choose from 10 different shooting modes that allow great versatility to adapt to just about any situation. Lots of people say that the buttons are shallow and difficult to push but they seem fine to me. Another good feature is that you can view a histogram of the image that displays information about the individual frame. You can also choose how many megapixels that you want with the special Fujifilm button. The zoom is great too with 4X optical. It also zooms even if you look through the optical viewfinder, which I might add is a bit small. The LCD screen is also satisfyingly large at 2.0 inches. I highly recommend this camera for the digital camera enthusiast that wants a camera a few steps higher than a point-and-shoot, with optional advanced features.", "Date": "January 8, 2005"}, {"Title": "PLEASE READ THIS IF YOU HAVE A ZOOM ERROR ON THIS CAMERA!!", "Author": "TexasMom1974", "ReviewID": "R1D6G8WZGO5I53", "Overall": "3.0", "Content": "I purchased this camera and reviewed it in Oct 05, I love it. But I have just had my first experience with the zoom error message after the lens being barely tapped on my desk. After reading all the reviews I was thinking I would have to buy another camera. Then I came across the review from Ross about pulling out the lens until it clicked and the shutter opened and then turning off and back on and I thought oh well what have I got to lose. So I tried it and it WORKED!! My camera is now fully functioning with no zoom error! Thanks Ross and if this happens to you try this!! This is probably all they do when you send it in anyways!! I hope this helps someone!!", "Date": "May 19, 2007"}, {"Title": "Very frustrated and disappointed", "Author": "D. Kennedy", "ReviewID": "R3K7VIHL1F0DR5", "Overall": "2.0", "Content": "I researched for a digital camera for months before purchasing the Fuji Finepix E550 6MP digital camera in May 2005. I had a Canon and wanted something with a little more clarity, video capacity, and mainly, something that would not take as long between pictures. The Finepix takes great pictures and video - when you can take them. There is a significant amount of camera shake. In addition, I have had to bring the camera in for repair 4 times since purchasing it in May 2005 - due to the dreaded \"zoom error\". I brought the camera in for repair in Sept 2005, Nov 2005, and Jan 2006. The camera is again in need of repair (April 2006), the 4th time with the same problem. The lens barrel freezes if the batteries run low and is very sensitive. For instance, if your hand or clothing brushes against the lens barrel it stops working. If the batteries run out while you are turning the camera on, the lens barrel simply stops and doesn't retract. I am so tired of bringing the camera in for repair and frustrated with the amount of time it has been in the shop and pictures that I have not been able to take that I am not even going to bother with another Fuji camera ever again.", "Date": "May 1, 2006"}, {"Title": "Banding Problems", "Author": "Amazon Man", "ReviewID": "R3U6BU4L1OKXK6", "Overall": "1.0", "Content": "I researched this camera and found it highly recommended in Consumer Reports and had other friends that also have the same camera.  They all love it but the one I recieved off of Amazon was defective because I would get this banding problem with every picture at any setting.  It would look like a big fingerprint over the picture and no it wasn't my fingerprint on the lens. I tried fixing the problem by going to the fuji support site but no mention there of such problem.  I thought it was something that I was doing wrong but as I searched \"finepix e550 banding\" I started to see that others have had the same problem.  I just recently contacted Fuji to see what they can do about it since my camera is still under warranty.  This review is for those with the same problem.Update:  Fuji fixed my camera after I paid to have it shipped.  Don't use it much anymore because I ended up buying another camera.  I think Fuji is out the digital camera game because none of thier newer cameras had great reviews.", "Date": "April 16, 2006"}, {"Title": "Somewhat complicated for a first time digital camera user", "Author": "W. Steen", "ReviewID": "R3LE8NDSEEPU4V", "Overall": "4.0", "Content": "The E550 seems to be a high quality unit, however, with its many features, it at first seems a little overwhelming.  The quick start up guide should have included instructions on programming the ecard....if instructions were present, they were not obvious.  I've heard that most cards that come with cameras are the smallest in capacity...this is unfortunate...one would think Fuji is more progressive.  I also purchased the \"Fuji Starter Kit\" which includes a nice case, however, the additional batteries and charger were not necessary....live and learn.  All in all, so far, I am pleased with the purchase.", "Date": "September 12, 2005"}, {"Title": "Great when it works", "Author": "Stephen714", "ReviewID": "R3TDPE6TT23N2X", "Overall": "3.0", "Content": "It's hard to make a decision about this camera as it takes the very best pictures of any camera I have ever owned.  The photos from this camera are significantly better than any digital camera I have ever seen.  That said, there seems to be a general problem with the zoom lens.  I am also waiting for my camera to be returned from Fuji due to the \"zoom error\" mesage and the lens locked in the open position.  It would be important to find out how widespread this problem is in Fuji camera and if widespread, then stay away from it.  If the incidence of this problem with Fuji cameras is no different than that for other brands, then I would definitely recommend it.", "Date": "December 11, 2005"}, {"Title": "A nice little camera, very good for the $$$", "Author": "K. King \"K King\"", "ReviewID": "R6LHDOFVQAT0U", "Overall": "4.0", "Content": "I have owned this camera for about 1.5  years now, and haven't had any problems with it.  It has a very fast reponse from turned off to picture taking time, and that is one reason I like it.  Also, it gives a very rich and clear photo under the proper conditions.  I love it for taking pics of the kids.  The only lacking I find is it's power in zooming and no image stabilization.  OTOH camers with higher zoom are usually much larger, so it's a tradeoff.  I find it's not sufficient to sit in my seat and try to take photos of the kids on stage because they will be out of focus and not zoomed in enough.The LCD has a protective cover over it that makes it kind of shiny/gloss, the screen is one of the largest I've seen (I think 2\"), which is nice.  Also no lens cover makes it easy to use and not lose anything.It seemed to use up alkaline batteries so fast it was kind of stunning, but the rechargable type are great, last a long time.The xD cards are expensive, but gradually coming down in price.  They are so small!Other reviews here also good to read.", "Date": "June 25, 2006"}, {"Title": "It's an average camera", "Author": "C. Norris", "ReviewID": "R3KL48V29CCZEL", "Overall": "3.0", "Content": "I have had this camera for only five months and the Zoom Error just occurred a couple of days ago. I was NOT happy and thought that I had a serious problem. So, I jumped onto here to read the reviews and saw that others had had the problem too and I found out how to fix the problem myself and the idea worked! YAY!! Thank you to the person who posted it. It may be a temporary solution but at least I know what to do if it happens again. Overall it's a good camera but if I could go back to before I purchased it I would have bought another camera.", "Date": "April 1, 2006"}, {"Title": "Fujifilm Finepix E550", "Author": "C. K. Ballance", "ReviewID": "R1FSS5SYG7ECWF", "Overall": "5.0", "Content": "I am quite happy with the camera.  It combines pretty good resolution with numerous features, all at a very reasonable price.  Further, its compactness makes it quite portable.  I like it so well that when mine was stolen, I pruchased another one.", "Date": "February 22, 2006"}, {"Title": "Pretty Good Camera", "Author": "Mike Harrison", "ReviewID": "R3BK4UMLMIQBZL", "Overall": "4.0", "Content": "Pros:  The Fuji E550 takes good pictures in a variety of lighting conditions.  This camera is very quick to start up and lag time between shots is very short.  It's easy to navigate through the menus and the buttons and controls are laid out logically.  The compact size is not a hindrance to using it.  The included software (FinePixViewer and ImageMixer VCD2) are easy to install and pretty straight forward to use. You will probably want a more sophisticated photo editing program for composing / cleaning up your shots.Cons:  It does have a couple of drawbacks.  The memory card that ships with it is way too small. Removing the memory card is not practical so connecting to your computer via USB is necessary. There is a mechanical switch you must use to change between taking photos and viewing or deleting what's on the camera.  I question how long this switch will last.Overall Impressions:  I like this camera and would recommend it.", "Date": "December 13, 2005"}, {"Title": "An excellent versatile camera in a small package", "Author": "T. Faranda \"Tom Faranda\"", "ReviewID": "R3DCS793TET48S", "Overall": "4.0", "Content": "I have been using the Fuji E550 for almnost two years, with none of the problems that have been reported by some of the reviewers.Here are the negatives:1) The flash has mediocre range and is a little finicky. If you don't depress the shooting button all the way, it may not flash.2) In bright light, the screen on the back is unusable - it washes out the image. BUT the camera has a fine viewfinder so this is not really a major issue.The positives:1) It takes great pictures. Really excellent.2) It's small, and easy to carry.3) The controls are well thought out and positioned on the camera body. Very easy to use.4) It has several automatic modes - sports, landscapes, portrait, etc, or you can use it on manual. I always use one of the programmed modes.5) The video option is not bad at all - my twelve year old (now 13) uses it.I was so pleased with this camera I bought one for my administrative assistant about ten months ago, and she is very happy with it.At it's current price I think this camera is a bargain. Only reason I didn't give it five stars is because of the weak flash.", "Date": "December 23, 2006"}, {"Title": "A very good camera for the advanced novice", "Author": "Bill W.", "ReviewID": "R3LKXL7I4CVT1G", "Overall": "4.0", "Content": "I have had the camera about 2 years and all in all it is an exceptional camera for its many advanced features. The designers must have felt that because of the wide range of f-stops, very slow/fast shutter (3sec to 1/2000) and the fantastic film speed range (auto or ISO 80 to 800), why have a large flash. The E550 is designed as a available light camera. True the flash only works when the autofocus and autorange feature can work. It must see something well or you get no flash. Somethings I like are the unlimited movie time. (card limited)  The almost none existant shutter delay is very unusual in a digital camera. While driving I can pick up the camera, turn it on and shoot with one hand a shot of a deer on the side of the highway. I just preset it on speed prioity shutter, preset on 1/800 or 1/1000. With the dial on top you can set priority to amperture, speed manual or program all. I also like the feature of automatic exposure bracketing. Also the rapid shooting feature to get a object moving. Also I like the feature to prefocus (by pressing the shutter half way down)then waiting for the instant shot. What worked in Alaska to get a whale which was only for an instant at the surface. It is a very capable camera as well as a 'point and shot'.  I have taken about 3000 photos with it. It is a great camera but if not set correctly you may not get a good picture.", "Date": "December 1, 2006"}, {"Title": "Zoom Error Revisited", "Author": "F. Verdi \"The Philadelphia Kid\"", "ReviewID": "R1CF2SQQ1KG73I", "Overall": "1.0", "Content": "I was very excited when I received this camera. I liked it very much, and thought I was getting a lot of camera for the money. Sure enough, the pictures looked great, very true color, nice to handle, Black & White setting. It was a little heavy and uses those XD cards, but overall I really liked it. Then, within about three hours of owning it - after less then ten pictures - something had gone awry. The zoom lens was stuck, it wouldn't move and the \"zoom error\" message kept appearing. Then, the camera would shut off. That's when I referenced the manual and found out that it wasn't a fixable error. It had to be fixed by the manufacturer. I have since learned that there may be a fix for it, and quite frankly I wouldn't want to deal with the \"zoom error\" happening all the time anyway. I guess I know why I couldn't find a new one on-line, and why there were so many refurbished. I still really like Fuji cameras, but I wouldn't trust this model, especially a \"recertified\" one. I have since learned that I am not the only person who has found this out the hard way. Lucky, I was able to return mine for a refund.", "Date": "November 6, 2006"}, {"Title": "Watch Out For This Camera", "Author": "Dr. Marc Mayerson", "ReviewID": "R2T4RXQLCY6K59", "Overall": "2.0", "Content": "This camera has a problem with overexposing and shuttering effects on uploaded photos.  Fujifilm denies this as a chronic, recallable problem, but the Internet camera forums are filled with people (like me) who bought this defectively designed camera.Buy a Canon or a Nikon.  Fujifilm doesn't deserve your business.", "Date": "August 24, 2006"}, {"Title": "Return Policy", "Author": "K. McCormick", "ReviewID": "RQ37SGTIZ18VC", "Overall": "5.0", "Content": "Fantastic camera for the value, features are abundant, comfortable and easy to use on auto settings, more than enough manual options to accomodate improved skill. Received the first one with a bad CCD, Amazon overnighted a new one free of charge - no questions asked! This is the place to buy products.", "Date": "January 19, 2006"}, {"Title": "#1 DOA, #2 30 Days, Waiting for #3", "Author": "eds65", "ReviewID": "R20G6Y7A9BXZR1", "Overall": "1.0", "Content": "The first 550 we purchased was DOA.  Returned to seller, and replaced with #2.  #2 worked for 30 days, then dead.  Past sellers return limit, so sent to Fuji.  3 weeks now, waiting for replacement...  Don't buy this camera!!", "Date": "October 18, 2005"}, {"Title": "Buy only with extended warranty", "Author": "GarpM", "ReviewID": "R24JRW27ODN9ES", "Overall": "1.0", "Content": "This camera has a problem that might not show up for awhile.  In my case it revealed itself after a year and two month.  One day fingerprint like lines appeared on prints.  They are invisible on LCD monitor but cover the picture area on the computer monitor and on prints.  Search the Internet and you will find many similar complaints.", "Date": "April 15, 2006"}, {"Title": "I Love this Camera!  It meets my very HIGH STANDARDS!", "Author": "Queen", "ReviewID": "R25KOVPGPT9HSM", "Overall": "5.0", "Content": "I received this camera the day after I placed my order for it and was ecstatic when I finally opened it.  This is a great camera for beginners like myself.  The operation of it is quite simple unless you are trying to do more than take quick pictures.  The only cons that I have with the camera is the reset time for the flash.  It takes a few seconds for the flash to reset but I was taking pictures of my 9 month old nephew who wouldn't sit still long enough for it to reset.  The view screen is excellent.  When you use the flash the pictures in the view screen are awesome.  It makes the background look very pure and clean.  I haven't had a problem with red eye at all.  All in all, I think this is a great camera and I am very satisfied.  The price is excellent the quality is excellent and Amazon is excellent.  In my opinion, they don't charge enough for this camera!", "Date": "August 25, 2005"}, {"Title": "Great camera - when it works", "Author": "B. Uram", "ReviewID": "R2LYPRBSXDHHMX", "Overall": "1.0", "Content": "This camera is great when it is working.  My camera is in the repair department for the second time with the same problems.  It is taking pictures with lines/bands running through them.  It took months with much confusion to get my camera back last time and already this time I am getting the run-around.  I will not buy Fuji again because their customer service is poor.", "Date": "November 10, 2005"}, {"Title": "beware the zoom error", "Author": "B. Bennett", "ReviewID": "R24ILZQSS05YOP", "Overall": "3.0", "Content": "I have had this camera for over 2 years and have LOVED the photo quality and ease of use.  The camera is very quick, takes great macro shots and doesn't eat up (rechargeable) batteries.That being said, 2 days ago it started overexposing my pictures.  Then it locked up completely.  I was able to get my pictures downloaded off of it, but, after reading other online reviews (especially of Fuji's poor customer service and the persistance of this problem with Fuji cameras) I am now shopping around for a new camera.  I will not be buying another Fuji, which is too bad, because I really did love it while it worked.For a review of many other users with this problem:[...]", "Date": "May 8, 2008"}, {"Title": "Fuji Finepix E550", "Author": "Kurt A. Borden", "ReviewID": "RWY5ZVQ689LJG", "Overall": "5.0", "Content": "The best digital camera I have bought so far. There are so many features in such a little package. I carry it where ever I go & it has always worked great for me. I keep finding new things it can do. The quality of pictures & video it takes is great for the size & ease of use. The best thing is I can fit the thing in my front pocket with-out feeling I have a huge bulge there. It's also very easy to carry extra 1GB cards due to the XD cards being so small. Fuji has & still makes great cameras.", "Date": "May 24, 2007"}, {"Title": "Finepix E550 lives up to its CR \"Best Buy\" Rating", "Author": "Glenn B. Wooden", "ReviewID": "R2L7TDQK05C6W7", "Overall": "4.0", "Content": "After an extensive review of available compact cameras, I decided this was the best choice as a gift for my wife. She wanted a small camera that was easy to use. Period. What I gave her was a small camera, easy to use, with a wealth of advanced features.You have a choice of shutter priority or aperture priority, letting you choose depth of field, and how you capture motion (freeze-frame or sense-of-motion effect).  You have auto-focus/auto-exposure locks, red-eye reduction, vivid color saturation (in F-Chrome mode), PictBridge compatability, adjustable flash brightness, continuing shooting up to 40 frames, voice memo recording...The camera comes with 2 rechargeable AA-size Ni-MH batteries and a wall charger.  I found that alkaline batteries gave longer usage time.This camera is a little workhorse. We took it with us to O'Ahu and loved the resulting images. The 6.3 megapixels allowed us to edit our photos, zooming in and enlarging, with no perceptible loss of sharpness.A great value for the money. And now, you can get 1GB and 2GM memory cards for less than 512MB cards cost a year earlier.Last word: When our first E550 was damaged, I went online to find a replacement camera and found that the price was almost HALF what we had paid a year ealier. So, we bought another E550!!This camera deserves 5 stars. I knocked off one star because we missed some critical shots when power ran out and we weren't prepared with extra batteries.  But, after factoring in the better color saturation and powerful flash and features, we were probably getting as much mileage as possible out of our batteries.", "Date": "May 13, 2007"}, {"Title": "what a shot  form and function", "Author": "Bruce A. Attfield", "ReviewID": "REZQNEO2V4I78", "Overall": "5.0", "Content": "Made a photo so clear and good the whole house was expanded to greater than the screen could contain. I bought the zoom lens to a wounderful midsize unit.Keep up the work fuji seems like your real good company.", "Date": "February 16, 2007"}, {"Title": "No problems at all", "Author": "S. Koue", "ReviewID": "R37ISH24G6BM1I", "Overall": "5.0", "Content": "I was a bit worried about this camera after reading a bunch of complaints about lens error and some other issues.  Maybe those were early versions or a bad batch, and maybe  the design got tweaked ??  But I have had no problems at all.  I just came back from two weeks in Portugal and have shot over 1500 pictures in the four weeks or so I've been using the camera and it's been bounced around a bunch.  I tried to get the lens error (before I left and after I found the \"fix\") but it never happened.  Maybe if you actually stop the lens from moving or pushed it back?  but that would probably break most cameras.  So either that issue is fixed or some users were being violently rough with the camera to get the error.THe images look great, it's fast and it was great to have along.", "Date": "January 27, 2007"}, {"Title": "An EXCELLENT camera for the money", "Author": "April K. Schmidt \"tmagoots\"", "ReviewID": "R1DFOG68QOKDLZ", "Overall": "5.0", "Content": "I'm a bit obnoxious when it comes to my pictures.  I'm not a professional photographer by any stretch but I'm a mom and I want GREAT pictures of my kids.  This camera delivers.  Point, shoot, get a great photo.  The \"delay\" time is a bit long, but I've used other digitals and found this to be comprable.  Easy to use, takes excellent photos, really what more can you ask for?  I like the fact that this camera is small, but not teeny-tiny; there's still something for you to hold onto to steady the shot.  I really don't have a single complaint about this camera!", "Date": "December 26, 2006"}, {"Title": "Recharging system with cradle CP FXA10 is dismal", "Author": "Gerard Batt \"garbatt\"", "ReviewID": "R33DDNY5RWCRFY", "Overall": "1.0", "Content": "The camera takes good photographs.My issue is its recharging system.It was purchased with a cradle CP FX-A10, after about 9 months the battery would no longer charge fully. I discharged the Nickel Hybride battery fully with no success. I purchased a new battery... same problems.DO NOT BUY a Cradle, it is a waste of money.I now recharge AA batteries with an external charger.", "Date": "December 9, 2006"}, {"Title": "Stay away from this product and Fuji", "Author": "borati \"borati\"", "ReviewID": "R3CPGN4NSTRGKD", "Overall": "1.0", "Content": "This was my 3 Fujifilm camera that I bought.  I wish I never did.The camera is heavy when loaded with the batteries.  It is also big and awkward in shape.In my experience it is unreliable as well.  I bought mine brand new.  To my chagrin, the zoom unit failed only 5 days and some 30 pictures after I started using it on my long-awaited European vacation.I sent the unit for repairs on October 3, 2005, and I was just told that I can expect to get it back in two weeks (45 days later).  To make the story complete, the customer service guy hang up the phone on me.My loyalty to Fuji is gone.  Moreover, I will never touch their products again.I realize that my case is probably extreme and unfortunate, but I will strongly encourage you to stay away from this product.  There are better companies and products!", "Date": "October 28, 2005"}, {"Title": "I love this camera!", "Author": "J. Wissner \"Jenny\"", "ReviewID": "R2M9ZSF9JCZ0MJ", "Overall": "5.0", "Content": "I am so in love with this camera, it served me well for 3 years until my toddler destroyed it. I now have the dilemma of finding a new camera I will love as much. It was so easy to use, took sharp beautifully colored photos, preformed outstanding in low light situations, I had no problem printing large photos without any graininess. I'm tempted to just buy the same camera, but in 3 years I am assuming there have been major improvements and I can find something even better. I hope!", "Date": "February 2, 2008"}, {"Title": "Great for the price!", "Author": "N. Zapien", "ReviewID": "R1VLS23J6G52TD", "Overall": "4.0", "Content": "This camera has served me well over the last few years.  There are a few things that you need to be aware of however.  The first thing is that the flash has a delay.  You have to wait for it to recharge in between each picture if you are using the flash and that can take at least 6-8 seconds.  Taking pictures of children can be challenging if you are using the flash!  With that said, the camera has been great.  It is very simple to learn!", "Date": "September 10, 2007"}, {"Title": "Fujifilm Finepix E550 6.3MP Digital Camera with 4x Optical Zoom", "Author": "Happy Golfer", "ReviewID": "R8240SX9O9ITY", "Overall": "5.0", "Content": "As a golfer and a picture-taking fan, this camera is soo good...and you can take movies with sound....and the camera is small- However it uses expensive type memory (xd) so take that into account when buying.Stay happy,Happy golfer", "Date": "August 9, 2007"}, {"Title": "I have had it more than two years now.", "Author": "Kelli Maier", "ReviewID": "R2RJN2TRFDQAXF", "Overall": "4.0", "Content": "Neither the flash mechanism nor the battery compartment have broken...they are fine.I am not a pro...but I will say it takes a good clear picture if you bother to learn a bit about it and photography itself. It does have problems in lower lighting, but overall I love the reliability, and I use it to photograph my artwork for print sales and for slides.So there you have it. It's good enough to trust my income with.But nothing is going to do ALL the work for you...at least not if you want to pay a reasonable amount of money. Be willing to learn a bit about how cameras work in general and about lighting and composition and color.", "Date": "August 9, 2007"}, {"Title": "do NOT buy this thing", "Author": "Changhong Gao Sr. \"charlie's chocolate\"", "ReviewID": "R1BQPK3NLHOKBV", "Overall": "1.0", "Content": "I bought this camera 2 years ago. It was working fine. But suddenly, it starts to over-expose. The photos have strange white stripes across. There must be a design flau because someone else had the same problem here. Do NOT buy any FUJI product!!!", "Date": "June 19, 2007"}, {"Title": "best camera ever", "Author": "S. Umur \"umurs\"", "ReviewID": "RPYHLDVDMNDGZ", "Overall": "5.0", "Content": "best camera best best be...i cant say anything else, it has everything u need...", "Date": "May 9, 2007"}, {"Title": "First Camera and I am not disappointed", "Author": "David Farhi \"dune612\"", "ReviewID": "R379AP4CQ6GSTY", "Overall": "4.0", "Content": "I decided that since I have no expertise with cameras, and I needed one for my new job, I would go for a factory refurbished one. So far this camera is everything I could possibly want.Good battery life with Nimh rechargeable batteries, great clear pix, easy to use. The LCD came with some minor scratches, but I guess on a refurb thats to be expected. I like this camera also because it has a viewfinder which a lot of the new cameras do not have.I would recommend this camera to anyone who is looking for an easy to use well made, inexpensive camera to work with.", "Date": "March 31, 2007"}, {"Title": "Fujifilm Finepix E550 6.3MP Digital Camera with 4x Optical Zoom", "Author": "What picture?", "ReviewID": "RFHVS211SJXWH", "Overall": "1.0", "Content": "Camera didn't even get out of the starting gate. The zoom lenswent out and then the lense was closed and the picture number onedidn't even happen.  It was Christmas and no pictures were takenon the \"new\" camera.  If you want a big disappointment purchase the useless camera.  I am still trying to get my money back fromChristmas for the waste of time and money of a camera.  Maybeby next Christmas, I will get the refund and the money tobuy a real camera.  Perhaps, I will have pictures of 2006 Christmasunlike 2005 which does not exist in photograph memories.", "Date": "January 20, 2006"}, {"Title": "Good compact camera", "Author": "G. Fuhrmann", "ReviewID": "R3U956BAI1WHCT", "Overall": "4.0", "Content": "I was looking for a pocket camera with some useful features, and this camera takes good pics. The macro function also works great. The different functions are easy to figure out and I like the software  better than iphoto.The flash is small and not very useful, however all small cameras with a built-in flash have the same problem.  Using the night option allowed useable pictures in dark settings.  Batteries drain fast, so use rechargeables.", "Date": "January 7, 2006"}, {"Title": "You know I had this camera before.. so I don't know what went wrong with this one.", "Author": "jim", "ReviewID": "R164UJ2GIRWIWJ", "Overall": "1.0", "Content": "It has a battery life of about 3 shots and then shuts itself off.  I'm to say the least quite surprised since I owned this model before and my old one died a natural death.  This is now officially a bad purchase and I'm out the 50 bucks I spent.  I hope the seller didn't know this and sell me a clunker but I've changed the nice shiny new batteries multiple times and it does the same.. click turn on and immediately shut off.Too bad for my wallet.", "Date": "February 12, 2013"}, {"Title": "Best digital camera we ever had.", "Author": "Art", "ReviewID": "R1OHHB80NFI657", "Overall": "5.0", "Content": "We have a Fujifilm Finepix E550 camera that we have used to take thousands of photographs over the years and we were surprised to see a new one still available (and at a great price).  We immediately ordered the camera and it was delivered very quickly.  It works perfectly.  We highly recommend this product and the seller.", "Date": "December 26, 2012"}, {"Title": "Recurrent sensor problems", "Author": "Maia Cavelli", "ReviewID": "R3DJW3VBJE17B2", "Overall": "3.0", "Content": "In spite of the well-documented imperfections, I have loved this camera and have continued to use it even after  acquiring a Nikon D200 (DSLR).  I have loved the portability of this point and shoot, and its ability to capture RAW data images - enabling professional level adjustments in the post-processing phase.  Great landscape camera, as well as a great macro point and shoot camera.  My unique gripe is this:  I bought my E550 in 11/05.  In June 06, I was getting a spot in all my pictures. Naively, I thought it was a spot on the lens, but brought it in for warranty service and learned that the CCD card (the sensor) had burned out a few cells.  It was replaced, under the warranty.  But now, 3 years later, I have the same issue.  The new sensor has now burnt out cells.  And not only is the camera not under warranty, but the old warranty service providers advise that Fuji has pulled all its warranty and authorized repair services out of the U.S., so the cameras must be mailed out of country for warranty service.  The parts for repairs aren't available here, making convenient repairs and fast turn around times inaccessible to the consumer.  I'm concerned about two sensor failures in a well cared for camera.  Both, incidentally, occurred immediately after flying, so I'm wondering whether there is some vulnerability to being in a pressurized cabin??  In any event, I'm off now to see whether Fuji has any reasonable resolutions to what appears to be a defective design in an otherwise great sensor.  Stay tuned.", "Date": "January 19, 2010"}, {"Title": "Fair price for the product", "Author": "Terry Monies \"terrym222\"", "ReviewID": "R3RTDCOVQEEB5A", "Overall": "4.0", "Content": "Bought this just weeks before a two-week road trip, and had to learn in a hurry.  Camera is a step up from my Nikon Cool Pix.  Optical viewfinder is a must-have.  Camera comes with bonus stuff - cords, card, batteries & charger, although the card is too small.  Recommend buying an additional 1G card, a camera case, and at least 2 more pair of NIMH batteries.  On active shoots, batteries only lasted 4 hours.  Camera has more options than Cool Pix and additional lenses are available.  Good stabilization.  Have not tried video yet.", "Date": "June 24, 2007"}, {"Title": "Best buy", "Author": "R. Mesquita \"good deals buyer\"", "ReviewID": "R2I5VCVZVMDJI3", "Overall": "5.0", "Content": "It's definitely an excellent camera for non-professionals. Great image and diverse facilities. I recommend it.", "Date": "June 21, 2007"}, {"Title": "nice pictures, sturdy", "Author": "kse", "ReviewID": "R10GCLN8IBPVXP", "Overall": "5.0", "Content": "we use two of these cameras for kite photography, and the pictures turn out great. we've had more than a few crash landings with both cameras and both are still going strong, going on four years. great camera and easy to use, nice pictures even when you just use point and shoot mode.", "Date": "June 10, 2007"}, {"Title": "A DigiCam for All Starting \"Amature\" Digital Photographers!", "Author": "STRALLENT COM \"STRALLENT\"", "ReviewID": "R2CEND5OWCOT6M", "Overall": "5.0", "Content": "All I can say is, If you know what you're doing (Basic Knowledge in Digital Photography) You'll Love this Camera. Adobe Photoshop would be nice to have ,too, if you like to play around with the pictures to make it more better. Have Fun!", "Date": "March 25, 2007"}, {"Title": "Good", "Author": "Crystal Smith", "ReviewID": "R3JTMPJPL87NA0", "Overall": "4.0", "Content": "My nephew was thrilled to recieve this for graduation.  He took it on his trip to Spain and got great pictures.  Good camera for the price.", "Date": "January 15, 2007"}, {"Title": "Great camera for the money", "Author": "M. J. Krause", "ReviewID": "R11IPGHSB14S84", "Overall": "5.0", "Content": "This camera is great. When we were looking at them, ones with megapixels over 5.0 were almost $400 and only a 3x zoom. Loved the features with this...was looking for one a little smaller, but this still can fit in a baggy pocket. I have taken 100s of pictures, and get many compliments on them", "Date": "December 6, 2005"}, {"Title": "Awesome camera when it functions", "Author": "Spencer Allain", "ReviewID": "R10VWS1W9DRT6L", "Overall": "2.0", "Content": "We have owned an E550 since January 2005, and at first it was an incredible camera -- and still is, under the right lighting conditions.  Indoor pictures taken away from windows where there is low contrast between items result in stunning pictures.Unfortunately, our first camera could not take a picture with any significant amount of sunlight present (not noticed much during the months of January, February and March).  We just thought the few bad photos were a small price to pay for the good photos otherwise.  The more pictures we took without a completely overcast sky, the more pictures we \"lost\" due to horizontal bands, streaks, or being so washed out such that almost everything is white with few discernable edges.We sent that camera in for repairs, and several weeks later we received a replacement (it had a different serial number on it) and it seemed to work better -- at first.  After using this one for about 2 months, the auto mode again started screwing up outdoor photos and indoor photos with high contrast.  I had managed to use the manual settings to get some good pictures for a while, and now even those are getting the banding effects.This makes two defective cameras that we've received.  We haven't abused any of the cameras we've owned, and have had to go back to our several year old Olympus that still takes nice looking photos at 2.1 MP.  In fact, it was only recently that we encountered the zoom sticking issue, which is surprisingly easy to cause.Maybe we've just been bitten by terrible luck, but we've lost too many photos and are again going to have to deal with returning our camera under warranty (want to just get our money back at this point as it takes about 6 weeks for the whole warranty process) to recommend this camera to anyone due to the quality issues we've encountered.", "Date": "September 20, 2005"}, {"Title": "Very happy with this camera", "Author": "E. Campisi \"extrabooksalbany\"", "ReviewID": "R12E5ZR3VAX7O9", "Overall": "5.0", "Content": "This is my first digital camera and I almost went out of my mind researching them. B&H; in New York had a good price on this, and the SONY PSC d150 (a 7mp cam) I ended up choosing the Fuji for the rebate and the larger and brighter rear screen, which I realized made a difference in the fun factor. The SONY was probably built a little sturdier, but the body felt too small and the small rear screen was a little annoying.I LOVE this camera. It was pretty easy to figure out, even though I'm still learning. Within the first hour of use I took a fabulous photo of an amaryllis, which I blew up to 8x10, and it looks professional. The pictures are extremely easy to view after taking as well. A few of the close up shots of my dog came out not in total focus, but for now I'll blame that on me not using the portrait mode - especially since my friend with a SONY PSC D-100 has much worse focus problems than I do.I take photos at 6mp. The detail is stunning. I was satisfied with the video too, except for a weak speaker.Negatives - 1. I've already lost the little plastic cover to the side of the thing. Why isn't is permanently on there? The battery section is also cheaply built. 2. Some people don't like the fact that you have to pop up the flash yourself. I actually like this, because I have always had a hard time supressing the flash on my SLR. This is a matter of personal preference, I like this feature. 3. The flash takes a long time to recharge, and if you are going to take lots of flash pix keep a set of extra batteries handy because it eats them. 4. There is no low light focus beam -- this hasn't bothered me yet, but I guarantee it will at some point. 5. I totally hate the fuji picture viewer software. It doesn't download well. Stick to Adobe photo shop or Microsoft Picture It and you'll be less frustrated.These negatives are rather minor, and unless you spend a lot more money you will always have something about a digital camera that bugs you. The pictures from this camera are just fabulous, and anyone can create a great photo with ease. That's the most important thing to me. I have become a total photo bug in 3 days!After the rebate I paid $280 for this camera. It was a real bargain, and I will certainly be able to use this camera for years without upgrading.Unless you are a person who will hate to pop up the flash yourself, and you can't stand a little long flash recycle time, I don't see how you would be disappointed with this camera overall.", "Date": "February 6, 2005"}, {"Title": "I Love This Camera!", "Author": "Ann Mayberry", "ReviewID": "R2C1CRNM7COI2N", "Overall": "5.0", "Content": "This camera is very easy to learn to use....the pictures are very sharp and clear...battery lasts a long time...A Great Camera!", "Date": "August 9, 2005"}, {"Title": "Terrible Customer Service!!!", "Author": "C. Allen \"Jason Logue\"", "ReviewID": "R1DADQWWMZMIC0", "Overall": "1.0", "Content": "The camera is fine as long as nothing goes wrong. Fuji has the worst customer service I have ever delt with. They pass you from one person to another and do everything they can not to help you. Be prepared to deal with the worst customer service in the business. I really hope this helps you.", "Date": "December 23, 2007"}, {"Title": "Very poor design on Zoom lens", "Author": "H. White", "ReviewID": "R3SN7N22HK28X9", "Overall": "1.0", "Content": "I've had other digital cameras but this is the first one I've had problems with. I started getting a Zoom lens error shortly after I bought it but it would clear if I turned it off then back on. It is now unusable as the lens can not be retracted at all. It lasted 18 months.", "Date": "February 12, 2007"}, {"Title": "Blurry Pictures - AWFUL customer support", "Author": "K. Newton", "ReviewID": "R1NGR0Y3V2ZXB0", "Overall": "1.0", "Content": "I was so excited to get this camera and did lots of research.  The camera indoors takes pictures that blurs upon the slightest movement with little hope to be had in fixing the problem.  The customer support and repair department are the WORST I have ever dealt with and I'm usually very understanding and patient.  It sounds like they are shuffling through piles of papers when talking to me, they've lost communications that were attached the camera when submitted for repair and are disinterested in all conversations.  I will NEVER buy another product from FUJI.", "Date": "November 20, 2006"}, {"Title": "Don't Buy The Fuji E550 Camera!!!", "Author": "J. Rexer \"camera guy\"", "ReviewID": "R32FVWNB3M7PN5", "Overall": "1.0", "Content": "I have owned Fuji Cameras in the past, and I was very pleased with them. So, based on my experiance with Fuji, and the Consumer Reports recommendation, I bought the Fuji E550. What a mistake! Fuji should recal this camera, and Consumer Reports should help the customers on this one! I am looking for a new camera right now, and the E550 will soon go in the trash. I would not sell it in a garage sale! This camers acts like it has a basic chip flaw, and should be recalled. Under normal conditions, I can usually recover only about 10% to 15% of the pictures taken. What a mess!", "Date": "November 2, 2006"}, {"Title": "Malfunctioned after 3 days", "Author": "Joe The Pro", "ReviewID": "R1SMWLNJZCLLZ5", "Overall": "1.0", "Content": "I had this camera for three days when the built-in zoom lens broke, rendering the camera unusable.  Zoom error appeared in the LCD and I could not take any pictures.  I tried replacing the batteries as the troubleshooting section sugests, but that did not work.  I contacted the place I bought it from, and they said that the camera was defective and needs to be returned.  I ended up buying a Sony DSC-W7, and I'm very happy with it.", "Date": "June 15, 2005"}, {"Title": "Not good in night mode", "Author": "M. Na", "ReviewID": "R1GKCA6UJNTK2I", "Overall": "3.0", "Content": "This Fuji DC is fantastic! Especially for the fast power on (no more than 3 seconds). But the night version is horrible. I took this camera to a concert, and shot at least 30 pics in night mode. But only got one clear pic. Of course the flash light is powerful, but it useless. Every photo came with double or triple edges even with flash on. I have to say I'm so disappointed with that. Besides, the anti-shake mode is poor and the xD memory card is too expensive.I have to return this camera for sure.", "Date": "October 24, 2004"}, {"Title": "Poor auto focus unless in very bright light.", "Author": "Leif Wennerstrom", "ReviewID": "R2107OXPVEEJRR", "Overall": "1.0", "Content": "I would look elsewhere for a camera unless you don't mind using the flash all of the time.  The auto focus (when not using a flash ) on this camera is very poor in anything but very bright sunlight.  I've taken several shots in very well lit conditions and the images come out blurry.  You pretty much have to use the flash all of the time.  I believe Fuji addressed this problem in another camera (I don't recall the model).", "Date": "August 16, 2005"}, {"Title": "memory card", "Author": "too little memory", "ReviewID": "R1QY1N3ABCMH1O", "Overall": "4.0", "Content": "Camera is nice but who in the heck decided to include a crummy 16mb card with it. The 16mb card holds 9 pictures before it is full. Don't find out like me (too late) when you get to a family Christmas gathering and all the stores are closed.....get a bigger card.", "Date": "December 28, 2005"}, {"Title": "Terrible Customer Service Experience", "Author": "DR_Net_Buyer \"DR_Net_Buyer\"", "ReviewID": "R39NAKVQXUX1WV", "Overall": "1.0", "Content": "First ... in case you are having difficulty finding the phone number for customer service- it is1-866-216-1075.I purchased the Fujifilm Finepix E550 6.3MP Digital Camera with 4x Optical Zoom almost a week ahead of Mother's Day and clicked on the \"Guaranteed 3 Day Shipping UPS\" link for the shipping option.  Upon finishing up the purchase, the estimated delivery time was the Friday before Mother's day weekend.  Two days later I got an email from Amazon with the UPS tracking info giving a estimated date of delivery time of the Tuesday AFTER mothers day (over a week after my purchase date!).I called customer service that day and spoke to them about this and was told that the order would probably arrive on Friday, but if it didn't- Amazon would refund the shipping cost ($14 for a camera that weighs around 1lb).  Personally I think I (and my mom) deserved more, but I said fine.Sure enough, the camera doesn't arrive until Tuesday late afternoon.I called Amazon and was put on hold by a representative, that then hung up on my after quite a while of holding.When I called back, a representative (live, with voices in the background) that was trying to sound like a answering machine message, was reading off  something about not being able to access records, then hung up on me.Finally on the third call, I interrupted the startled representative (Emanuel's) ramble today (5/18/2007 3:03CT) by stating that I wanted to speak to the manager.  He kept repeating that he would take down my number  and have someone call me back when they could access their records again.That is where things stand so far ...", "Date": "May 18, 2007"}, {"Title": "WARNING!!  DEFECTIVE ZOOM MALFUNCTION", "Author": "Mr. Tom", "ReviewID": "R1IHYXUT9MHBLC", "Overall": "1.0", "Content": "Owned the E-550 camera for a total of 1 day before the zoom stuck open, giving me a \"ZOOM ERROR\" message. This camera has a defective zoom and once it sticks open, there is nothing you can do to correct this problem without returning it for repairs.Too bad the zoom is so flimsy, because the camera takes great pictures. Will be taking back tommorrow.Please stay away from this camera.", "Date": "November 27, 2005"}, {"Title": "The Best Camera Ever", "Author": "JR", "ReviewID": "R1DWZUWOA844KG", "Overall": "5.0", "Content": "Very very easy to use, fits almost everywhere, has the best of all worlds in its easy to use features, travels very well.", "Date": "October 6, 2005"}, {"Title": "Video playback - poor sound", "Author": "BugMeister", "ReviewID": "R1VVKN38HTDMWD", "Overall": "3.0", "Content": "This is a neat little camera for the price, rebate considered. The video playback is quite acceptable but the audio has a \"bacon frying\" noise in the background. I'm extremely disappointed with this defect. Anyone else out there hear the noise? Even has noise on playback if you don't record any sound.", "Date": "January 16, 2005"}, {"Title": "It was awesome and unbelievable", "Author": "Dominic Kersi", "ReviewID": "R1QMV7QK4JRG76", "Overall": "5.0", "Content": "I think Fuji E550 6.1MP is the best of the best. The pictures I took with the camera was crystally clear and high in resolution and not forgetting the video mode.", "Date": "April 8, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "6.3-megapixel sensor captures enough detail to create photo-quality 14-by-19-inch enlargements\n4x optical zoom lens; 6.3x digital zoom\n2-inch TFT LCD monitor; 4 preprogrammed scene modes; PictBridge compatible\nStore images on xD Picture Cards (16 MB xD card included)\nPowered by AA NiMH rechargeable batteries (included with charger); compatible with USB 2.0", "Name": "Fujifilm Finepix E550 6.3MP Digital Camera with 4x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51f6c6Xd4hL._SY300_.jpg", "ProductID": "B0002AHQL4"}}