{"Reviews": [{"Title": "Great camera, great value!!!", "Author": "Happy Teeth", "ReviewID": "R1QMLFTXCWE4MD", "Overall": "5.0", "Content": "I looked at many cameras and many reviews before choosing this camera. I was drawn to its looks initially, but didn't want to get stuck with a lemon just because it was a pretty color. After lots of research, I decided to try it out.The first pictures that I took with it were of some farm land right at dusk with the sun already behind a mountain. I used the \"Night\" mode and the pictures looked as though we were there in bright daylight! Even distant items stood out with great color and clarity.It also has modes for portraits, children, sunsets, and so much more! I still can't believe how many features this camera has for the money.The only thing that it lacks is a strong zoom, but, face it: that's what runs the price up on a lot of cameras. This camera gives you a whole lot of features at about half the price of other 7mp cameras.THIS IS THE BEST ELECTRONICS PURCHASE I HAVE EVER MADE!!!!", "Date": "April 6, 2007"}, {"Title": "3 months and still going strong!", "Author": "Mystie \"Mystie\"", "ReviewID": "R139Y08QHMDLI5", "Overall": "5.0", "Content": "I bought this camera 3 months ago and I'm still AMAZED by it. The video is takes is fantastic, and the pictures come out absolutely AMAZING. I never have to adjust the flash or anything, it just focuses and does all the work. The LCD display is big and displays the photos perfectly, you can even zoom in to get a closer look. I've never been so happy with an electronics purchase.", "Date": "March 11, 2007"}, {"Title": "Best Birthday", "Author": "N. Garcia \"Msdiggity\"", "ReviewID": "R8E7BCJ3N9DK9", "Overall": "5.0", "Content": "I gave this cam to my 10 year old daughter for her birthday and she is absolutely in love with it.  It has great and numerous fairly easy to use features and it has video.  It also has music on it (I think you can download music of your choice onto it-gotta look that up) that will play during your slide shows.  The batteries run out really quickly though so you are better off getting rechargables as soon as you can.  I spent a day researching digital cams in our price range and this cute little number is a lot of camera for a little money!", "Date": "July 30, 2007"}, {"Title": "Polaroid Doesn't Stand Behind It's Products", "Author": "W. Heinbokel", "ReviewID": "R34PGIAQQP7ZTY", "Overall": "1.0", "Content": "My daughter received the i733lp as a Christmas present and was very excited to own her own digital camera.  This camera performed well initially only to have the LCD screen unexpectantly go blank.  Since the camera does not have a view finder, the camera is unusable should the LCD screen fail.  As the camera was only a few months old, we contacted Polaroid to have the camera repaired under warranty.  After incurring the cost of shipping the camera to the designated repair site, we were contacted by Polaroid and told that the warranty doesn't cover the LCD screen.  How can that be?  I reiterate, the camera is  unusable without an operational LCD screen.I have owned several digital cameras manufactured by Nikon and Canon and have never experienced any problems with their products.  You have many many choices available when picking a point and shoot digital camera.  Don't focus solely on the performance of the camera when making your choice.  It is just as important to know that the manufacturer will stand behind their product should problems come up.  It is for this reason that I implore you to not waste your hard earned money on a product manufactured by Polaroid.", "Date": "September 4, 2008"}, {"Title": "Polaroid 7MP DC Pink", "Author": "Cara \"Mom X2\"", "ReviewID": "RB7XNM953QVWJ", "Overall": "5.0", "Content": "Polaroid 7MP Dc Pink We bought this camera as a birthday gift for our 20 yr. old daughter. She loves it! It's easy to use and takes beautiful pictures. It didn't come with a battery charger, so we got her a battery charger and a couple sets of AA batteries. Taking film clips seemed to use up the charge fairly quickly. We recommend this camera.", "Date": "November 8, 2007"}, {"Title": "worth the money", "Author": "C. Boeck \"cebii\"", "ReviewID": "R5RKNFHVL4WCR", "Overall": "5.0", "Content": "I bought this for my teens to share.  They love it.  It's easy to use, provides quality pics and videos, they argue over who gets to use it.  couldn't ask for more.", "Date": "January 31, 2009"}, {"Title": "Pros and Cons of the Polaroid", "Author": "Glynnis", "ReviewID": "R2U3VT3KJ8IMNS", "Overall": "3.0", "Content": "My husband brought this camera for me as a birthday gift 3 yrs ago and I loved this camera. The color of the camera is bright and cute and it was easy to navigate through the photo options. However there were some cons about this camera. The photo shutter would get stuck quite a bit. It also has an annoying double flash that makes everyone that you are photographing wonder if you finished taking the picture or should they still continue to pose. Real akward. Also, if you are trying to take a photo of any moving object it is a waste. My camera finally died the other day because that shutter that malfunctioned so many times before finally jammed for good. I looked at some reviews for this camera on another site and many users had the same issue. This time I am going to shop for a more light weight camera and one that doesnt have the annoying flash and shutter issues.", "Date": "December 27, 2008"}, {"Title": "Great camera... when it works.", "Author": "Jeremy Epstein", "ReviewID": "R13KUHW1V9I8QY", "Overall": "2.0", "Content": "Bought one for my ten year old.  First few days it was fine.  Then all the pictures had a purple tint.  Sent it back for a replacement, which gives a \"card error\" when I insert the memory card.  (Tried two 4GB cards and got the same error, but no errors on an old 2GB card.)  Turns out that it can only use cards 1GB or smaller... pretty weird for 2009!", "Date": "June 20, 2009"}, {"Title": "BATTERY INFO!!!!", "Author": "Aundria", "ReviewID": "R3SWJDJ6EWBYD7", "Overall": "3.0", "Content": "I LOVE my camera!!!  The only problem is, it hasn't worked for MONTHS!  Come to find out this camera will temporarily run on regular batteries, then will ONLY run on LITHION batteries!  I bought all kinds of different batteries and the thing won't turn on unless the batteries are brand new or expensive Lithion!THIS CAMERA NEEDS TO TELL US THIS ON THE BOX!Happy I didn't throw this camera away before I found this out!  Now it works fine.", "Date": "March 6, 2008"}, {"Title": "never recieved camera.", "Author": "4 Ever Alive in Jesus", "ReviewID": "R2EQRO626Q4ZRH", "Overall": "2.0", "Content": "Item never arrived.  Was moving and needed item on time.  Seller would not respond to my email attempts.  I had to order camera from other seller.  Fortunately, Amazon stood by the claim process and promptly had my money refunded.  I still trust Amazon, but not the store who posted this camera for sale.  Thank you Amazon for standing by your reputation.  :)", "Date": "May 25, 2010"}, {"Title": "Polaroid Camera 7MP Dc Pink", "Author": "Sam \"Sam\"", "ReviewID": "R2Z36K8GLOA57N", "Overall": "5.0", "Content": "Purchased for grandaughter.  She has found it easy to use and is happy with the pictures.  Expect a short battery life.", "Date": "September 27, 2009"}, {"Title": "Excellent Product", "Author": "Aimee Shellnut", "ReviewID": "R1M29JDSIRXRU8", "Overall": "5.0", "Content": "I bought this camera for my daughter.  She has totally enjoyed it.  We received it before scheduled and are very please with this purchase.  We would definately purchase from this seller again.", "Date": "February 26, 2009"}, {"Title": "not so hot", "Author": "T. Flores \"mommy 2 two\"", "ReviewID": "R3VDV9TPQ5AQQC", "Overall": "2.0", "Content": "I bought this as a replacement camera...my daughters broke my easy share.  I thought it was okay at first.  However it does the annoying double flash, pictures turn out way too washed out and bright no matter what and it is a battery sucker....and it is a little heavy for my taste, kinda bulky.Pros....it has a rubberized outer shell, if you drop it no biggie and if it floats around your bag..no scratches.only pro about the rubberized-ness is that I had the camera in a new leather bag with black lining and the color transfered on to the camera, I have no idea how to get it off.I am upgrading once again and hopefully for the last time to a Nikon and giving this to my 5yr old.", "Date": "November 25, 2008"}, {"Title": "Absoulte CRAP", "Author": "AJ", "ReviewID": "R2KR621RDS0SOC", "Overall": "1.0", "Content": "It is a refurbished and knew that going in. And it was just going to be my 11 year old's camera. But it should have come out an egg in one of those 50 cent things that give crappy junk to the kids. Except that stuff is actually better quality than this.", "Date": "March 13, 2014"}, {"Title": "My Manly Fishing Camera", "Author": "Dan Mader \"aka JD Mader Author of Joe Café\"", "ReviewID": "RUKJWQJ3126PK", "Overall": "4.0", "Content": "Exactly what I wanted. I had a old digital camera. Pretty simple, like this one. Got dropped in too many rivers and streams on fishing trips and finally died, so I got this one. My only complaint so far is that you have to hold the ON button for longer than you should. In my opinion.Basically, all the digital cameras I looked at were expensive. This one seemed close to our old one. My daughter likes pink. And it was \"refurbished\" or whatever, so it was about 15 bucks. If they had sold it as new, I wouldn't have batted an eye. Looked brand new, packaging and all.Stoked on my manly pink fishing camera.", "Date": "November 18, 2013"}, {"Title": "Throw Away", "Author": null, "ReviewID": "R3J9ZGCKKU9Y99", "Overall": "3.0", "Content": "Great little camera for the 3 years it lasted. It broke a couple of weeks ago: the lens is stuck in the open position & it won't turn on. I've tried other new batteries to no avail. Polaroid says they do not repair them and they have no forums or web site to go to for help.", "Date": "January 11, 2011"}, {"Title": "battery life", "Author": "John A. Latiolais Sr.", "ReviewID": "R1WZV0J8AA9XPP", "Overall": "4.0", "Content": "GOOD PRICE, GOOD CAMERA; HOWEVER, THE MEMORY CARD PROVIDED WAS DID NOT FUNCTION AND HAD TO PURCHASE A NEW ONE.", "Date": "March 6, 2010"}, {"Title": "Perfect camera for my teenage niece!", "Author": "Mojo's Mom \"mojo's mom\"", "ReviewID": "R3KEG5L2FIISOW", "Overall": "5.0", "Content": "This is a great little camera.  Has a light rubber feeling coating, which will be great for a 13 year old who might need the extra protection. I have tested the camera, though have not printed photos from it as it is to be a Christmas gift.  For a kid who loves pink, it is perfect!  Camera arrived packed safely and soon after I ordered it.  Great little camera, great seller!  Thanks.", "Date": "November 21, 2009"}, {"Title": "Good For The Price", "Author": "D. Hall", "ReviewID": "R11O5EVUUDVRM", "Overall": "3.0", "Content": "I didn't realize it took AA batteries.I got the rechargeable ones but they don't last that long.I would have preferrede one with a charger.I couldn't find anything about the type of battery it had in the description.I wish I had saved  and waited a little longer and gotten one that had a built in battery.It is ok overall, lots of good features", "Date": "March 29, 2009"}, {"Title": "works extremely well", "Author": "Gina Lee Tackett", "ReviewID": "R17PEMLF1G0LIP", "Overall": "5.0", "Content": "works extremely well takes even better pics than camera she had before which had less pixels even though it was the same brand. She is very happy with it", "Date": "June 1, 2008"}, {"Title": "review on pink digital camera", "Author": "Lori R. Sunzeri", "ReviewID": "R2FKLJBQAHRX4B", "Overall": "5.0", "Content": "I gave this as a christmas gift to my daughter. She is 20 yrs old and absolutely loves it. She said that it is really easy to use and takes great pictures.", "Date": "December 31, 2007"}, {"Title": "Love it", "Author": "Pamela Stark \"Morgan's Collies\"", "ReviewID": "R5WO73UIAMD4D", "Overall": "4.0", "Content": "I wanted a digital camera for a long time, my gr daughter had this same brand, so she could help me learn how to use it.", "Date": "March 23, 2008"}, {"Title": "Not worth it", "Author": "Andrew Leslie \"Andy\"", "ReviewID": "R2IJSYE5O54ZL4", "Overall": "1.0", "Content": "I got this camera free, and I'm still disappointed. If you are looking for a vacation camera, then by all means, buy this. Its basic enough that anyone can use it.But if you want to do any kind of art photography, this camera is worthless. honestly.you cannot manual focus, you cannot change F stop and shutter speed manually. you CAN change ISO, but that ruins the pictures by adding way too much grain. this camera barely pics up any detail in far objects, and, as i said, it can't focus on ANYTHING.its a waste.", "Date": "May 11, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000KYQ9F6"}}