{"Reviews": [{"Title": "Better than expected", "Author": "kimberly geddie \"life entusiast\"", "ReviewID": "R1NZ088MTGZRHP", "Overall": "4.0", "Content": "For the price you pay, this is a good little point and shoot.  The camera, upon turning it on, does have a 4X digital zoom, as well as a good flash, however the camera is not overly userly friendly but not hard to figure out at all.  A good investment for a first, or a travel camera.", "Date": "July 11, 2005"}, {"Title": "Not bad for the money.", "Author": "GRS", "ReviewID": "R3PS914MDIV0UU", "Overall": "4.0", "Content": "This cam is basically what you pay for. It is great as a travel cam and that is why I bought it. It does have 4X zoom, and will record short movie clips. The 16MB onboard memory is a little small, but it will take a SD up to 512MB that will store 509 2304 x 1728 high res pics. It will go through batteries, especially when using the flash. I have NiCads (rechargeables) so I don't have to deal with the waste or expense of disposable batteries. I paid about $85 for mine and am very happy.", "Date": "February 14, 2006"}, {"Title": "was good but now.......", "Author": "D. Orozco \"Kalikutes\"", "ReviewID": "R3NPAUAU2AHXT6", "Overall": "3.0", "Content": "i bought this camera in march for travel.  it takes great shots but my problem now is that i cant use just any battery on it.  it refuses all batteries except energizer.  from when i first got this camera i had been using only energizer. one day i had run out at a party and i was given two other types of batteries from a friend. the camera would start to turn on but then itd just stop.  i went to the store and bought some energizers and all was great.i found some panasonic batteries in my house and it refused those. i have alot of new batteries i can use but it will only take energizer.  and it uses up batteries way too quickly. i have 2 other digital cameras with more mega pixels and they dont use quite as much.  pretty much my once daily used camera now just sits there. yeah the price wasnt all that bad but i couldve spent a lil more and been happier.", "Date": "January 11, 2007"}, {"Title": "Camera not as described.", "Author": "KL", "ReviewID": "R3UX0IMZPEL9EB", "Overall": "1.0", "Content": "First of all, the camera I purchased did not match the product description on amazon.com.  The package says it is the Vivitar Vivicam 4100, but its missing some features.  The sticker on the camera says its only 2x zoom not 4x and there is no AC/DC charger (which was the main reason I chose this camera over others).  Plus, the flash doesn't work. What a let down. I know the camera is inexpensive, but at least the camera should have the features that it states it has.", "Date": "June 22, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "Compact, 4.0-megapixel digital camera\n4x digital zoom for great close-ups\nBuilt-in auto and red-eye reduction flash\nReview images on the 1.5-inch color TFT screen\nEquipped with a 16 MB internal memory and is SD card compatible", "Name": "Vivitar Vivicam 4100 4.0MP Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41SYSGDR2GL._SY300_.jpg", "ProductID": "B0009N5BWK"}}