{"Reviews": [{"Title": "Nikon D1X", "Author": "D. Olson", "ReviewID": "R3DRBDZNWZ93OW", "Overall": "5.0", "Content": "I have own the D1X for 6months now. The one issue some have is the older tech. batteries. Personally I didn't bother with the Nikon batteries but have bought the batteries from BatteryBarn. Great price, service and warranties.Image quality is fantastic with the colors and rendering as close to film like (Velvia) as anything I've seen.I use Nikkor 17-35f/2.8, 28-70f/2.8, 70-200f/2.8, 85f/1.4, 50f1.4 and they all do fine.I regularly make A3 (13X19) prints which are beautiful and wouldn't hesitate going much larger.One thing. Viewing an image on the LCD will make you feel like the shot is garbage but trust your abilities and the D1x as when opened up they are simply stunning.Focus is fast and accurate with any lens, AF-S or screw. The meter is very accurate.These may be of an older generation but those of us that use them love them.", "Date": "December 31, 2007"}, {"Title": "BEWARE ABOVE RECOMMENDATION!", "Author": "Roseann Dreasher", "ReviewID": "R3TVUDFIXB2JQW", "Overall": "5.0", "Content": "Do a google search on ROYAL CAMERA COMPLAINTS and you will see that they are a scammy outfit! I ONLY buy from AMAZON and who AMAZON recommends (like Adorama! B&H;! etc!) oh and this camera is a FABULOUS camera to use - a bit of a learning curve but wonderful results!", "Date": "July 28, 2006"}, {"Title": "Excellent camera, even now...", "Author": "Leo Koach", "ReviewID": "R183WINGEN5XJL", "Overall": "5.0", "Content": "I just bought this camera from our studio, which we had 15 of them, most of them are not working due to usage condition over the years. From Amazon I ordered Nikon 50mm 1.8 lens and battery for it. However, I did try D1x with studio's 50mm 1.8 and works perfectly. I have Canon 40D, before that I had Canon 30D and before that I had Canon 350D and none of them can produce pictures that good and sharp. Colors are amazing, focusing is very fast and on the spot. I just can't tell you how much I love this machine right now, if this one breaks I am thinking to buy another one... as a matter of fact, I am going to buy another one whenever I have a chance because right now they are crazy inexpensive (even used good ones).It is a pro camera, it is creating awesome pictures and it is affordable. Go for it :)Edit to tell you I have 3 (three) of these cameras now... they all work very good I don't even know how many shutter counts they have but rumors says around 200K each machine... Well, once Nikon built a TANK that lasts forever ;)", "Date": "October 20, 2011"}, {"Title": "Ancient yet still awesome", "Author": "Joseph Wilson", "ReviewID": "R1BF7L2AKUS2S5", "Overall": "4.0", "Content": "I used a canon 1d and then decided to go with the d1x to some people this sounds like blasphemy.So it does have an odd arrangement of pixels and images in jpeg/tiff format are 5.3mp but when I use .NEF(raw) and open it up in UFRAW(gimp attachment) it opens up as a 10.6mp. I found that it uses a 10.6mp sensor that it combines pixels together to gain awesome insane quality colors are awesome much faster to use than even a mark IIn canon. I can switch all of my settings by easy to use switches instead of having to hold down a button and rotate a giant dial.Body AF is fast motor AF is fast really all AF is just ridiculously fast and accurate. metering is well done and has multiple settings for adjustment.I would partially recommend a d1h over the d1x just because of the FPS", "Date": "July 11, 2010"}, {"Title": "Highly recommend this product", "Author": "Charles Washington", "ReviewID": "RQ34UA2WWSOGU", "Overall": "5.0", "Content": "All features worked as required; enjoying it along with my old Nikon D1 that I bought new in 1998 for $5000.", "Date": "September 1, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "ISO equivalency 125-800 (variable in 1/3, 1/2 or 1 EV steps)\nSupports CompactFlash (Type I/II) & Microdrive media\n2-inch, 130,000-dot, low temp. polysilicon TFT LCD with white LED backlighting\nIEEE-1394 Firewire Interface\nApprox. 3 frames per second continuous shooting mode", "Name": "NIKON D1X 5.47 Megapixel SLR Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/518MJiU76HL._SX300_.jpg", "ProductID": "B00006I5JL"}}