{"Reviews": [{"Title": "Solid camera, great value!", "Author": "tim747", "ReviewID": "R446J0MFW01EU", "Overall": "4.0", "Content": "I have had my D-510 for over 2 months now and am happy with my purchase.  I initially spent a couple weeks reading reviews all over the web on different 2 and 3 mega pixel digital cameras.  Bottom line is that I would recommend this camera to anyone that is just starting out with a digital camera and wants to have a powerful camera that is a great value.Pros1.  3x zoom (You should get at LEAST a 3x optical zoom, digital zoom does not matter because you can do the same thing in software later)2.  Retractable lens.I really like the fact that the entire lens retracts into the camera and gets covered so there is no danger of it being scratched.  Some people might not like the fact that when you open the lens protector to turn on the camera for picture taking, the flash will come out and you have to wait a few seconds for the lens to come out.  I got used to this and did not find it very bothersome.3.  Small size - it fits in the pockets for easy carrying around.  Nice compact package when the lens is retracted.4.  Crisp and colorful pictures.  The 4 x 6 prints I made turned out very nicely.  I couldn't even tell the difference from pictures that came out of a regular camera.  If you need bigger pictures often though, a more expensive 3 or 4 mega pixel camera would probably be bigger.5.  Fast USB connection, in my opinion you do not need to get a separate digital film reader.6.  Output pictures to TV, cables comes included.7.  Can fit over 200 pictures on a 128MB card.  It uses 3.3V Smart Media.  Don't buy the wrong stuff!  Viking works great.Cons:1.  Only comes with a 8MB card.  You need to buy Olympus Smart Media if you want to use panoramic mode.  You can just buy a new card of a cheaper brand and use the one that comes with the camera for panorama pics, which is what I do.2.  Software could be more robust, it works though.3.  Batteries, you need to get lithium ion batteries.  If you do not have a set and charger already, you should get the 510 package to save money.  Batteries will last a pretty long time if you do not leave the LCD monitor on and use flash all the time.", "Date": "October 9, 2001"}, {"Title": "I saved the best for last!", "Author": "Rhonda L. Thomas \"tigerave\"", "ReviewID": "R19P916N3YXOIB", "Overall": "5.0", "Content": "So far I love this camera.  I tried a Fuji Finepix 2600 first, but it's ISO rating is too low for versatility.  Not so the D-510.  It handles 100, 200 and 400.  I takes truer color pics inside the house WITH the flash than without, but that's normal.  I found the instructions to be easy to follow.  I've heard a lot of complaints about the lack of documentation included, but Olympus included a manual in PDF form on the CD that covers every single feature and function of this camera!You take your shots, plug the cable into your camera and into your VCR and preview the pics in 5 seconds!!  Be warned, though, the color you will see on your TV will not compare with your computer monitor unless you have a high resolution TV. However, I didn't get red eye on people even without using the red eye flash setting.The camera has night mode, white balance, sharpening ability, self-timer, manual or auto ISO settings, fill-flash, no flash... you name it and this camera delivers!  However, while it says it has a panoramic setting (which only works with Olympus media), it really just takes two consecutive pictures of your choosing.  YOU have to join the shots together yourself in the software to  make it a panormic, so I would hesitate to actually call it a panoramic feature.All in all, it's a great camera!  You can't beat taking a picture, plugging it into your PC, and within seconds, you have pictures!!  Find the manual on the CD, read through it carefully, have fun while you're learning, and you'll be a digital camera buff in no time!!!", "Date": "December 4, 2001"}, {"Title": "An excellent camera", "Author": "A. Pedersen", "ReviewID": "RY7VGJDRBS68L", "Overall": "5.0", "Content": "I really like this camera. I've noted several people reviewing this camera mention the \"cheap\" feel/look of the body of the D-510. I personally disagree, I think the camera looks pretty good and has a nice solid feel to it without feeling too heavy. The picture quality and color fidelity of this camera are both excellent. In SHQ mode with a 128 MB SM card you get 90 pictures, more than enough for almost any vaction or trip you might take. The storage-class USB makes getting pictures off of the D-510 a snap, and is far easier than any other digital camera I have owned. The movie mode only records 30 seconds of video at SQ mode and only 15 seconds of video in HQ mode. It doesn't matter how large a smart media card you have, you need to press the shutter button to take video clips with an approximately 2-3 second delay between each clip as the movie is written to the SM card. Important note: There are 2 \"click stop\" settings for the camera cover. You need to make sure the cover is fully open before the camera lens will extend. I think this camera is a worthy replacement of the D-490.", "Date": "August 8, 2001"}, {"Title": "Good First Digital Camera", "Author": null, "ReviewID": "RYEFPSWTRO2LJ", "Overall": "4.0", "Content": "I shopped around a lot for my first digital camera, and this value package cinched it for me, since it came with rechargeable batteries, charger and camera case, all for the same price as the major chains. Overall, I love the camera. It was really easy to use right out of the box, and I know very little about taking pictures. Although the automatic setting is handy, you can experiment easily with the specialized settings, and the menus are easy to navigate. It's great that this Amazon value package comes with rechargeable batteries because, as every other review has noted, this camera eats batteries. However, the rechargeable batteries that are included do not come with any instructions, so you have no idea how long you're supposed to charge them. The charger even says \"Read instructions before use,\" but where are the instructions? In general, the pictures were easy to transfer to my iMac. Whereas the manual says you don't need to install the Camedia software to use the USB, I did in fact have to install it, though that took seconds. And frequently, the USB connection doesn't work, and I have to fiddle with the cable and restart the computer before it works. Maybe it's my computer.Some other tips:1) To turn the camera on, you have to slide the lens cover all the way until you hear it snap. If you just slide it without hearing the snap, the camera does not work.2) If you use any specialized settings or the digital zoom, these settings are wiped out when you turn the camera off, and when you turn it back on, you start at automatic again w/o digital. If you want to keep digital on at all times, go to the shooting menu and navigate it to \"hold settings.\" When you do that, everything you set is stored in memory.3) The instruction manual is very skeletal and does not go into detail. A more detailed description of the camera's features are in Adobe format on the included CD-ROM.4) It took me a while before I realized you can preview your shots while you're in shoot mode (i.e., while the camera lens cover is open) just by hitting the monitor button twice.Yes, I would recommend this camera. It's got a lot of great features in a sleek package.", "Date": "September 7, 2001"}, {"Title": "Overall A Great 2 Megapixel Camera", "Author": "John Bis", "ReviewID": "R2MFADNFJULG9M", "Overall": "5.0", "Content": "I have been looking for a digital camera for a long time now and was about to buy the Olympus D-490, but luckly I found out about this newer model. There are three reasons why I went with this camera instead of the older model. This model features a Quicktime video mode that allows you to capture up to 66 seconds of footage on the provided 8mb card. This I thought would be a great way to send short movies to family and friend or just if something big was hapening and I wanted to make sure that I caught it. I also liked the easy USB conection opposed to the serial cable on the previous model. USB is alot faster, so most people end up buying a seprate USB card reader, which costs extra. With this camera this can be avoided. The third and final reason that I went with this camera is the improved zoom range. The D-510 has a 3x opical zoom and a 6x digital zoom. This allows for a longer shooting range.", "Date": "June 19, 2001"}, {"Title": "Love the D-510!", "Author": null, "ReviewID": "R2AS883LH4QFID", "Overall": "5.0", "Content": "I opened my D-510 last night and took about 75 pictures today. My first impression is that it's a wonderful digital camera in keeping with my prior experience with Olympus film cameras. Picture quality, expecially photo colors are wonderful. I would not recommend the camera to someone who must have simplicity. While I quickly learned how to use the camera, I have extensive camera experience. The written documentation enclosed with the camera is minimal. While I had the camera operating within minutes, downloading photos to my PC did not go so well. The necessary drivers did not appear on my PC. I had to call the Olympus 800 number. The technical help I received was excellent and the wait time was short. One point - the 800 # message said that I might have a 20 minute wait. I actually only had to wait about two minutes. One of my relatives saw the pictures the camera took today. She's already ordered a D-510 for herself!", "Date": "November 23, 2001"}, {"Title": "This is the best 2.1 MP camera for the money, period!", "Author": "\"loud1\"", "ReviewID": "R248EUBXD6VVVE", "Overall": "5.0", "Content": "Don,'t believe any of the few negative reviews posted here. Those people didn't take the time to read the manual on the CD. The printed manual says right on the front \"basic manual\" and that's what it is. Anyone that would get a D-490 must like waiting all day for their pics to transfer. If you have a computer old enough to not have any USB ports on it then try spending 400 bucks on computer upgrades instead of a digital camera. The optical zoom works fine. Panorama mode is cool and sequence shooting is as well. Pics can be viewed easily after taking them. You can either setup an option to immediately preview each picture you take as it's being written to the card or you can double click the monitor button to view them. It eats batteries true, but doesn't any digicam that uses AA's do that ;) This camera has way more options than the competition at this price range. If you're a more advanced photographer who wants more user configurable settings go for the C-2040 Zoom which is only [amount] more, or The C-700 if you want a \"mega optical zoom\" with its 10X optical/27X Optical + DigitalIf you're going to spend [price] or more on a digicam and you're an amateur photographer do yourself a favor and pick one of these babies up.", "Date": "December 7, 2001"}, {"Title": "Pretty Dang Cool", "Author": "B. Dunn", "ReviewID": "RL7QAQH0HBRXQ", "Overall": "5.0", "Content": "Here's the only negative with the camera: The slide-door that turns the camera on and off. It feels flimsy and might some day be a cause for concern, plus it's kind of strange that you have to shut it part way, wait for the lens to retract, then shut it the rest of the way.But, uh, that's just not a very big deal to me. The controls are intuitive enough. The optical zoom works great, no problems there. The digital zoom could maybe be more accessible, but most of the time you're not using it -- it works well once engaged, however. The ultra-close feature creates excellent detail.One other cool thing is that the Olympus doesn't seem to try to tell you how your picture should look, i.e., it doesn't super-saturate every picture it takes like some of its competitors. I mean, I KNOW how to saturate a picture. Additionally, the images are ultra sharp and ultra clear, even with some really questionable lamp lighting.It's a drain on batteries (it uses AA) of course, but so is every digicam and rechargeables are readily available in most parts of civilization. The display on the back is awesome -- I wish my laptop looked that good.", "Date": "August 3, 2001"}, {"Title": "Shopped around", "Author": "D.Leonard", "ReviewID": "R1NY36X94AZYZV", "Overall": "4.0", "Content": "I guess in todays high tech society It would be foolish to purchase something without fully checking it out. Well after reading all the reviews posted here as well as a host of others concerning different Digital cameras, I decided on the D-510. I use it constantly for my business and I must say that it was a very wise decision to purchase this camera. Anyone that is thinking about purchasing a digital camera for the first time will be pleased with the quality,functionality and overall performance the D-510 has to offer. I appreciated all the helpful tips when I decided to purchase a digital camera for the first time and offer a few of my own.1) Rechargeable batteries are a must.2) To save even more battery life I purchased a \"SanDisk\" USB downloader which is fast, easy and doesn't require you to use your camera(your camera doesn't even have to be there)...Hope I may have been some help....", "Date": "September 19, 2001"}, {"Title": "BIG bang for your buck!", "Author": null, "ReviewID": "RXRV7FBJZT3CT", "Overall": "5.0", "Content": "After considerable research, I decided on the Olympus Camedia D-510Zoom for my first \"real\" digital camera. I couldn't be more pleased with the ease of use (considering the deep menu which is somewhat intuitive for a technophile), long list of cool features/controls, and excellent image quality.  Although you can start taking pics immediately with the quick-start guide, TAKE THE TIME TO READ THE FULL MANUAL ON THE CD and practice!The video clip and panoramic features are very fun toys/tools and proved to be much better quality than I expected. The Camedia software effortlessly stitches up to ten pics together for interesting panoramic shots and the video feature saves short silent clips in Quicktime MOV format. I would recommend spending the extra ten bucks or so on an Olympus-brand SmartMedia card with the panoramic code for your first or second large-capacity card (since the card that comes with the camera is only 8MB and other brand cards don't have the proprietary panorama code that works with the software.)My camera says it will shoot about 22 pictures in the highest TIF resolution (1600x1200) and 1300 pictures in the lowest JPG resolution (640x480) on a 128MB card. The highest JPG resolution (SHQ at 1600x1200 w/minimal compression) is where I keep mine set most of the time and I get about 90 shots per 128MB card. The default JPG setting (HQ at 1600x1200 w/medium compression) gets about 230 shots per 128MB.As with any zoom camera I've ever used, you need to keep the camera still or your image will blur. Use a tripod as often as you can, particularly for zooming, night shots and definitely for panoramic shots. The 3x optical zoom is nice but it will not make my SLR (35mm film camera w/zoom and macro lenses) obsolete by a long shot-perhaps if I dropped a grand or two on a high-end Nikon or Minolta digital...The camera does eat batteries, but not as bad as I expected, considering all the moaning and groaning in these reviews. Just buy an inexpensive NiMH charger and eight rechargeable batteries. I find my Energizer ACCUrechargeables last much longer than the batteries the camera came with and I'm very happy with them. I also keep a set of Duracells in the camera bag just in case.The housing has been described as cheap (among other things) but I think it has a good solid feel to it and if you treat it like the somewhat delicate piece of electronic equipment it is, instead of like a football, it will probably last a long time.I don't have a card-reader or AC adapter yet since I don't see an urgent need for them. The camera works well by itself as a card reader and the transfers are quick (about 4 minutes to transfer a full 128MB card) so I don't think I'll shell out the fifty bucks for the adapter (ouch!).", "Date": "April 14, 2002"}, {"Title": "Merry Christmas!", "Author": "Rheumor", "ReviewID": "R164UBSHAR1FR", "Overall": "5.0", "Content": "If you're looking for a special holiday present for someone who is either new to digital cameras or who has an early model, this package should make the perfect gift. The Olympus Camedias have been an excellent series, with great optics and a fine record of reliability. The D-510 offers some important features, like a 3:1 optical zoom (disregard most digital zoom hype, optical is what you really want), a 2.1 megapixel resolution (adequate for pretty clean 8 x 10 enlargements), easy USB connectivity to your PC, the ever-clever clamshell case and a pretty good flash. (It includes a mediocre sized memory card, but bigger cards are available readily and their prices have fallen steadily). This package ships with a carrying case, batteries and a charger, all nice extras that mean the D-510 is ready to go right out of the box.", "Date": "December 1, 2001"}, {"Title": "Highly Recommended", "Author": "Kevin Fenn", "ReviewID": "R26JEWDVUPX119", "Overall": "5.0", "Content": "This is my first digital camera and after doing a ton of research on point-and-shoot models, I found this one to be the best overall.  Small enough to stick in your pocket.  Picture quality is excellent and in addition to all the automatic features, it's nice to adjust your own white balance and exposure settings.  The panorama stiching feature is awesome.  I tood a 360-degree panorama and the software stiched it together seamlessly.Buttons are easy to use and menus are intuitive. Digital zoom isn't that great, but the 3x optical is nice.  Get it before 1/02/02 and get a free 64MB SmartMedia card with mail in rebate.Movie mode is a fun feature, but in HQ you are limited to 16 sec. clips. In SQ mode it is much higher.  Movie clip is choppy, but that's not what I bought the camera for.  It's fun for capturing small moments.  It eats up space on the card though.  About a 16 sec clip in HQ mode is about 4 MB.Waiting for the lens to retract and open each time you slide the cover is fine once you get used to it.  The USB transfer cable that comes with the camera transfers pictures very nicely and quickly.Get this camera.  It's a great camera for the price and features.", "Date": "January 12, 2002"}, {"Title": "One Great Camera", "Author": "R. Brist", "ReviewID": "R1D0VI12IMVXNK", "Overall": "5.0", "Content": "Having owned an Olympus D-360L digital camera, I should have known the D-510 would not disappoint.  The picture quality is excellent.  White balance is accurate and consistent under incandescent, florescent, and outdoor lighting.  I originally bought a Fuji 2600 but ended up selling it.Other D510 positives:-excellent 3X optical zoom-flash is bright and covers a wide area for indoor shots-on screen menu is easy to use (read the manual first!)-lens can retract into camera-can view images without having lens open-optical viewfinder in addition to LCD screen-multiple 'thumbnail' image view allows you to see all images taken (they're small but you get the idea anyway)-lots of manual mode options-can use NiCad rechargeables, alkalines, or special lithiums for longer lifenegatives-flash has to be manually closed after lens retracts and you close front 'door'-no LCD info display on top of camera like the D-360L had.  You must use the LCD viewfinder.-it is a bit heavy in my opinion, but heavy means quality right?All in all this is a great starter camera or a step up camera.", "Date": "February 11, 2002"}, {"Title": "Easy to use, quick access to pictures", "Author": "M. Shapiro", "ReviewID": "RS987JBLAQEJJ", "Overall": "5.0", "Content": "This is my first digital camera and it's a fun one to use.  Take about 5 minutes to get started.  The LCD is not the easiest thing to get used to, but I bet it's that way for all digital cameras.The 3X optical zoom is great, but the 9X digital really helps bring things close.And best of all, NO SEPARATE USB CARD READER.  The USB cable plugs DIRECTLY in to the camera.  Forget the add-on reader, this camera has the plug right on it.", "Date": "June 15, 2001"}, {"Title": "I don't know what I did without it!", "Author": "Green Pineapple \":)\"", "ReviewID": "RT0UL1BSTO1C5", "Overall": "5.0", "Content": "Like everyone else, I have been researching for months now looking for a digital camera. I needed a camera with USB connectivity, one that used a removable card (for a lot of pictures), and one that was compatible with both PC and MAC. I also wanted at least a 2 megapixel camera that was capable of zooming.After reading everyone's reviews, I realized that I found the one I wanted. I am so glad I read the reviews because I found out I that I also needed rechargeable batteries (I bought the Kodak Photolife K1000 Battery charger that comes with 4 batteries), a card that was at least 64MB (I got the Viking one). I also picked up the Olympus C-7-AU Adapter.I recieved the camera and accessories a couple of weeks ago and I am more than satisfied. I was totally set to go right out of the box! The color and clarity is excellent. Both day and night pictures came out great. I was able to hook up to my PC with no problem but had some trouble with my Macintosh. I e-mailed Olympus and they were quick to point out that I needed the USB Mass Storage Extension. Well, I did not have it so I went to the Apple Site under Knowledge Base and had to search for USB Storage 1.3.5 software. Downloaded it, installed it and that was that! I actually don't even need the Camedia Master software that came with the camera. Works perfectly!I could not be happier! I definitely recommend this camera.", "Date": "March 13, 2002"}, {"Title": "The right package at the right price", "Author": "Denalijay", "ReviewID": "R1S2KQUWB4F85Y", "Overall": "5.0", "Content": "This is a perfect first digital camera for owners of Olympus Stylus or other quality, 35mm point-and-shoot cameras.The combination of right size (hand-holdable, pocketable but not too small), zoom range (3x optical plus digital), picture quality (2 Megapixels, sharp enough for 5x7 images), and price ...!!!!!, make this a terrific digital take-everywhere camera.  It has better features than the smaller Canon Elph and I find the 510's shape easier to hold. It's clam shell design is well-protected and easy to pack.  It will even do short, silent movies.I went with this camera over higher resolution, more feature-rich cameras because I wanted a simple, inexpensive, versatile camera that has enough flexibility to handle difficult lighting situations.  The primary user is my wife. Most of her pictures will be small format hard copies or email attachments to far-off friends and family.  I also figure the 3-4 Megapixel camera prices will come down sustantially by the time I am looking for more creative control over my digital photos.Hope my comments help - I could not be happier with my choice!!", "Date": "February 1, 2002"}, {"Title": "Excellent novice-mid level digital camera..", "Author": "Michael A. Kinsella", "ReviewID": "R3AV2B9WJ3M0WZ", "Overall": "5.0", "Content": "I upgraded from a Canon A5 zoom.  The Olympus is easy to use straight from the box, though not as intuitive as the Canon.  The picture quality is noticeably better.To get the most from the camera, or even make basic changes like the default resolution settings, it is necessary to read the comprehensive manual (.pdf file) on the CD-ROM.  The paper booklet included is very basic.The movie option is good fun, but nothing like a VHS.  I use this for e-mailing short clips to friends.  Low-resolution mode uses about 70kByte/sec, maybe 5% less in a zip file.  High resolution uses about 300Kbyte/sec - unusable unless you have the 64MByte-memory card.The standard resolutions are 1600 x 1200 or 640 x 480. 16.7 million colors lead to files about 400Kbytes ad 50Kbyte respectively.  You can get picture similar to a regular analog camera by using glossy photo paper with an ink jet printer ...You certainly need the rechargeable batteries.  I like the option of using AA, rechargeable or lithium batteries.  You can buy the AA batteries almost anywhere, but they do not last!The USB connection is very fast and easy to use - Windows treats the camera like an extra hard drive.  If you do not have a USB port, do not buy this camera, as there is no other way to connect.I find the pop-up flash a bit irritating - it comes up every time you use the camera.  I would also prefer a more protective camera case.Overall I am very pleased with this purchase.", "Date": "March 14, 2002"}, {"Title": "tlyonker", "Author": "Amazon Customer \"tlyonker\"", "ReviewID": "R2GTI93QVGF8TC", "Overall": "4.0", "Content": "This is the second digital I have owned.  The first was also an Olympus, a 1.3 megapixel.  This is twice the camera if not more.  The features are better, the picture clearer.  This is a great camera and worth the money.  Only 1 feature I do not like, that is that you have to close the lens barrier (shut the camera off) then turn on the monitor to review pictures already taken.  A bit \"time consuming\" especially when that awesome shot comes up and goes away before you can shut the monitor off and turn the camera back on, by then the awesome shot may be gone.", "Date": "November 18, 2001"}, {"Title": "Best 2.1 megapixel available", "Author": null, "ReviewID": "R2JZ1VHDXDCYGG", "Overall": "5.0", "Content": "After much research I decided on this camera and have not been disappointed.  Little features like variable iso settings which allow the camera to work in low light and dioptric viewfinder to accommodate those of us that wear glasses are not available on competitors cameras for this price.  Some reviews mention you must turn the camera off to view pictures, this is not true.  You just have to hit one button to view the previous pics while the camera is on (read the manual guys before making comments).  The pics have come out great in all light situations, actually printed out better than a friends 3.1 megapixel Nikon in low light photos at the same party.  The menus take a little learning but it is not hard.  The printed manual is scant but the one on the CD has all you need.  All in all a great purchase.", "Date": "December 19, 2001"}, {"Title": "Great digital camera!", "Author": "Henry A. Muller \"hamuller\"", "ReviewID": "R2CGWLAZFZU6LV", "Overall": "5.0", "Content": "The Olympus 510 Zoom is a great camera!  This is my second digital camera, my first being a low resolution inexpensive camera.  The 510 is head and shoulders above it!  Be forewarned however, you do need to read the instruction manual carefully before using all of the camera's features.  It takes really great pictures right out of the box if you don't want to do anything fancy.  Rechargeable batteries are a must.  I bought the value package with the rechargeable batteries and they really last a lot longer than the AA alkaline batteries.  The package also came with a free 64 megabit Smartmedia card which I'm still waiting to receive (it takes up to 10 weeks).  The supplied 8MB card is woefully inadequate allowing only about 13 high quality pictures. The 64 MB card should fit the bill nicely.", "Date": "January 21, 2002"}, {"Title": "Everything I expected and more", "Author": "MOT33", "ReviewID": "R3OY21H92UV6IW", "Overall": "5.0", "Content": "This is my first digital camera and I couldn't be more pleased.  It's simple to operate.  Uploading pictures to my computer is incredibly easy.  The camera is very compact.  Best of all, it takes terrific pictures.  Up to 8 X 10, you can't see much of a difference (if any) between pictures taken with this camera and my \"film\" camera.  The camera also has a 30 second movie mode and allows you easily to preview your pictures on a TV.  The only problem is that now I'm taking pictures of EVERYTHING. I delete the pictures I don't like, save the rest, upload them to ofoto.com and order prints.  I highly recommend this product.  You will, however, need to purchase a memory card with greater capacity than the 8MB card that comes with the camera and holds only 16 pictures at the default setting.  I would also purchase rechargeable batteries.", "Date": "July 12, 2001"}, {"Title": "My first digital camera exceeded expectations", "Author": "Michael N. Gualtieri \"AmazonBuyer\"", "ReviewID": "RF5A3RHY57X9V", "Overall": "5.0", "Content": "I did alot of research before choosing the D-510 as my first digital camera.  With all the research and articles I read I was most concerned with how many megapixels I would actually need to get decent quality.  The D-510 has 2.1 megapixels which is probably average at this point compared to all teh cameras on the market.When I received the camera I was able to figure out how to use it within 20 minutes.The two most amzing things about this camera are:  - The picture quality was fantastic.  I sent pictures to family and they were amazed at the quality.  I was initially concerned about only have 2.1 megapixels but it turns out that it is enough.  - Downloading the pictures from the camera is just a matter of connecting the USB cable to your computer.  The camera actually shows up as a Drive letter in Windows Explorer.  You can drag and drop images from the camera to your hard drive.  Real simple!  On XP you don't even need the software that comes with the camera - it just works.This is a great camera.  You won't need film anymore.", "Date": "December 18, 2001"}, {"Title": "Extra Information", "Author": null, "ReviewID": "R9PN436PWA1ZF", "Overall": "5.0", "Content": "I purchased this camera because of the sturdy lens cover and accurate viewfinder. If you hold the flash closed, it will swich to no-flash mode. (saving you the need to turn on the display and press the right arrow 3 times) This camera will ensure a bright picture when in no-flash mode by taking longer to \"absorb\" the image, so hold the camera still if there isn't much light. To go into preview mode while taking pictures, double-press the monitor button (press again to return) The manual estimates battery life at 100 pictures, assuming 50% are with flash and the monitor is turned off when not needed. My first charge of batteries lasted about 70 pictures and lots of tinkering. Comes with 7 page quick start guide, 35 page basic manual, and a 150 page pdf manual on the cd. According to the manual, the camera will NOT serve as a charger(if you were to leave the A/C adapter plugged in while the camera is off). This would have been a nice feature, but oh well. Unlike the Sony Cybershot cameras, you cannot crop (shorten) movies in the camera. That also would have been nice, but that's what digital camcorders are for I guess.", "Date": "August 13, 2001"}, {"Title": "Olympus D-510 with Viking 128 Meg Smart Card", "Author": "Robert K. Huberman", "ReviewID": "R1S11SJTMIVC4O", "Overall": "5.0", "Content": "Camera worked very well. Daytime pictures were beautiful. The night ones, especially distance shots, not as good.  We took atrip across country to Yellowstone N.P. and the Viking 128 Meg Smart Card held over 300 pictures.  The BIG problems occurred trying to download the pictures.  The software provided does not apply to 64 or 128 Meg.  I purchased a Lexar Media Reader and had to go to their site  to download a new driver. I was then able to download my pictures to my computer.  Then I discovered that there is a conflict between the Lexar driver and Windows 98 that halts the computer when you try to shut down or restart the computer.  The computer stops dead at the \"Windows Shutting Down\" display.  A technician at Lexar said it's a known error.  I am still unable to figure out how to download directly from the camera into the computer.  I will attempt to figure out how to do this but in the meantime I may just buy a couple 32 Meg Smart Cards to replace the 128 Meg.  Like everything else these days there are so many different options that simple processes become complex.  I don't know if I would have had the same problem with an Olympus 128 Meg Smart Card or if I used a Media Reader made by a company other than Lexar.  But, I'd recommend staying away from both the Viking card and Lexar readers if you're a Windows user.", "Date": "December 23, 2001"}, {"Title": "Great Design", "Author": "B. Gary", "ReviewID": "R1PJ1XO5CWA7EY", "Overall": "5.0", "Content": "I recieved this camera for a graduation present. At first I was a little disappointed in the feel of the camera itself because I had gotten used to using Cannon's ELPH. After three months of use, though, I am completely satisfied with this camera.The picture quality is extremely good in every situation I have tried it in. Just some experiences with my camera... I took it to the beach once and the door had some trouble closing because it was jammed with sand, but it was easy enough to clean it out.The only trouble I have had with the camera is that I try closing the intergrated lens cap before the zoom lens has fully retracted and ended up bending the little metal ring on the lens. This doesn't affect picture taking at all, but it's just a little annoying.All in all, I am extremely happy with this camera and don't see myself needing a new one for quite a while.", "Date": "December 7, 2001"}, {"Title": "Olympus D-510 zoom camera a smart buy in mid range", "Author": "BILL Box", "ReviewID": "R1JFBUR51DB0X6", "Overall": "4.0", "Content": "I found the D-510 to be a great little camera in the mid range size and cost.It makes great pictures and holds more than some of its cousins with only the 8meg smart media card.With 3X zoom it offers advantage over others in the same price range.NOTE If you have trouble loading from USB port into the PC,It might be the driver did not load sucessfully.The book doesnt help much because it doesnt provide the address for the correct driver{E:\\USB\\WIN98} wth E:=CDROM Drive & WIN98=Oper.sys", "Date": "July 27, 2001"}, {"Title": "\"Easy to use, good enough for me!\"", "Author": "Francisco Lopez-Mieres", "ReviewID": "R20OQ02QW5F630", "Overall": "5.0", "Content": "I just take pictures every now and then. Instead of paying for developing, I decided to buy a digital camera. After shopping around for several days, I was down to HP 618 or this one. I went to a store, and took the same picture with both. The Olympus looked so much better! So that was it for the selection. Overall, my pictures look great on my Sony 17\" monitor. I have taken some very acceptable pictures in very dark conditions. I have the resolution set at low 1600 x 1200, and with the 128 MB card I can take well over 220 pictures. The only thing I have noticed is that when taking a picture of something \"purplish\", it looks kind of blue, for some reason. As a first digital camera, I strongly recommend it.", "Date": "August 23, 2001"}, {"Title": "Olypus D-510 delivers", "Author": null, "ReviewID": "R1D8EWRSDHVS6F", "Overall": "4.0", "Content": "This being my first digital camera, I shopped every where and researched all types of digital cameras in the 2.O MP range. The Olympus D-510 is definitely the best \"bang for your buck\" purchase. It comes with a quick start fold out that's easy to follow so you start taking pictures right away. The best part about this camera-the downloading through USB! What a breeze! The software that it comes with is easy to install and very helpful if you read the instructions. Still I was hoping for more with the software package. If you have win 98, you still need to donwload the driver from the disc that it comes it. The quality of pictures blew me away at first. The clarity of the photos is clear and crisp. I felt like a pro. I recommend the D-510 to anyone.", "Date": "March 25, 2002"}, {"Title": "Go prepared and enjoy!!!!!!", "Author": "\"radiger\"", "ReviewID": "R94ZZRW95OPQG", "Overall": "5.0", "Content": "I purchased several Smart Media cards, two sets of batteries and a speedy recharger with the Olympus D510 before departing for a 15day tour of Europe. WA LA!!Great Pics! No bulky rolls of film and no cost of developing duplicates, bad photos, etc. My deleting bad photos every evening gave me ample previewed pictures to save. Photos were taken from bus windows while traveling in all kinds of weather, or as I was walking, which is the case with most travel groups. They were more satisfactory than my  preveious journeys using a 135mm camera with the same travel circumstances. The equally great feature was the protective lens cover, the light weight compactness of camera gear,and not being SO visible as a tourist. I did all of my comparative shopping and purchasing of accessories on Amazon[.com].  The camera was on special sale locally, however, the accessories were so pricey and confusing, that I came home to do online research which simplified the process and saved money.  One important info to KNOW up front is how you delete the entire card!!VERY important as then you won't make this error. You can't retrive what you delete.  Lesson learned!", "Date": "March 11, 2002"}, {"Title": "Great Value", "Author": "Bill Monaco", "ReviewID": "R3TOI5ZB950MUZ", "Overall": "5.0", "Content": "I've owned this camera since August of 2001. I've yet to see a camera with the features this one has anywhere near this price point. The owners manual is weak with information, but the product has an easy learning curve. Two thumbs up.", "Date": "November 10, 2001"}, {"Title": "very nice little camera", "Author": null, "ReviewID": "R36VY6S1XQKW92", "Overall": "5.0", "Content": "I purchased this camera as an easy to carry alternative to my Canon Elan. Using the default \"point and shoot\" settings gives very high quality pictures - well focused and lit, with beautiful color. There are enough features to keep most people happy with it for a long time. Just realize that you can't use filters or accessory lenses on it. (I knew these limitations when I chose it.) I am very pleased with camera and picture quality.", "Date": "July 24, 2001"}, {"Title": "Nothing but Good...", "Author": "M. L. in NJ \"M. L.\"", "ReviewID": "R2S2L6NFNHKBBJ", "Overall": "4.0", "Content": "I have been muddling thru the digital camera world for quite some time, looking for just the right one. I finally settled on this one, and after dropping hints for the last couple of months, I got it for Christmas. This camera goes beyong words... It's easy to use, takes great pictures, and connection to the computer (USB port, Windows 2000) practically sets itself up. Took me a grand total of about 30 seconds to be able to download images from the camera. Honestly, for the quality, features, and the price, you can't go wrong!", "Date": "December 27, 2001"}, {"Title": "A Great Camera For Everyday Photography", "Author": "Gene Mathias", "ReviewID": "RJ3ZAPX9BB8WG", "Overall": "4.0", "Content": "Ease of use, compact size and excellant picture quality make this a great choice for the average user. The USB AutoConnect feature makes downloading and printing pictures a piece of cake. You will need to use rechargeable batteries, regular batteries will only last a few hours.", "Date": "October 14, 2001"}, {"Title": "Great bang for your buck!", "Author": "\"ducksquat\"", "ReviewID": "R36CADFFWQMIYP", "Overall": "4.0", "Content": "I have been an owner of the Olympus Camedia D-510 Digital Camera since Sept. 2001. For the price, you get a lot of bang for your buck. The images are good and the learning factor is relatively short for this first time digital camera owner. I particularly like the ease of how quickly I can set it up for download to my laptop while on vacation. Takes no time at all with a quick plug to the USB port straight from the camera. If you have MS2000 or newer, the drivers are already built in so no download time is necessary.Though I've been very satisified, I have to be honest with the downfalls. Prepare to purchase a battery recharger with rechargable batteries. It is certainly power hungry, as are most digital cameras. I always 4 spare AA's for such emergencies. It takes good photos at night, however, make sure you have a still object. I took it to a George Strait Concert recently and have nothing but blurred photos despite taking 124 photos on the memory card. I tried different configurations but all motion gets blurred quite easily and is quite more sensitive since you really can't adjust the shutter speed as you can with a manual camera or higher end digital camera. In addition, the darker the atmosphere, the more grainy I see see the photos become. I use the jpeg setting at the high quality and it doesn't help much more. Daylight or normal lighting shots usually come out fantastic! If you are a PhotoShop user or have another good photo manipulation software, you should probably be okay with most photos to tweak them for optimal viewing. I'm an expert user so most poor photos come out pretty good when I print them on my HP.Sometimes, when I try to keep the camera on standby and try to turn it on quickly, I have to do it twice. I'm not sure if it's because of the batteries (though the power shows it is good) or what, but it can be an annoyance.Overall, I'm happy with the camera. I use it often and have many great photos. I'd say that 3/4 are good to great quality and I simply dump the ones I can tell are poor in quality right from the camera. It's a nice size camera and has been sturdy. I dropped it on the carpet once or twice and have yet to have any problems.For the budget-minded or first time buyers, I recommend this camera. I can't wait to graduate to the high end ones!", "Date": "March 6, 2002"}, {"Title": "Good camera, cheap battery Charger", "Author": "K. Negi \"vickyrk\"", "ReviewID": "R1ZUYCUL7YLJOZ", "Overall": "4.0", "Content": "I bought this camera recently. Most of the reviews are positive so I basically want to focus on the negatives, because I missed following comments in these reviews:1) Looks good to me except the sliding lens cap. The lens cap is the poorly designed feature in this camera. They could have reduced the weight/size of camera by using just a cap on the lens part only. I find the operation of this lens cap quite inconvenient and unecessary.2) Also remember that the AVI files (movies) can not have sound in it.3) Distant pictures are a little blurry too.4) You need to get one 64MB card too to get reasonable number of shots, which is currently free after mail in rebate if you buy before 1/31/02.5)The value package also boasts of giving the battery charger which is non-olympus brand and really a cheap one. Looks like it is a cheapest one you can find in the market. I think it is the first thing to blow in this package.6) Pretty reasonable for the price otherwise.", "Date": "December 18, 2001"}, {"Title": "Best of the Bunch", "Author": "J. Russell", "ReviewID": "RH05BUTMSX0DL", "Overall": "4.0", "Content": "This review about an older camera is to help those who still have their D510, help those who may be looking for a very good used or refurbed older digital as an entry into digital photography without spending alot, and to debunk some of the bunk you will find in comments here due to not reading the full manual on CD. The printed Manual, which would be the one a reader would start with, is close to USELESS. Don't stop with this one. It does not do this great camera justice.First, I have had mine for about 2 years and it is still going strong, even after buying it as a factory refurb. Second, this camera provides the best match on the market between point-and-shoot convenience, small size, and some extended pro's control over resolution, white balance, shutter speed(ISO), focus point, etc. You will have to buy an upscale(read that expensive) camera today to get these options. Third, this camera takes great pictures at just 2.1 Megabit, and you really don't need more  han this if you don't plan to print photos larger than 8 x 10.Now here are tips for using this camera and some for useful for Digital Photography in general:1.The settings you change ARE retained after power off, but you have to SET this option. Open the lense for picture taking, push OK button to enter Setup screen, follow the Manual instructions to change the default settings to what you want, now set the RESET option to HOLD in the SET options screen. Don't forget once set they will be retained until you RESET defaults back to D510's originals, which means if you HOLD defaults to a low resolution say in order to get more pics on the 8Meg mem card supplied, and forget to change it before taking a pic needing higher resolution, you just lost it. This is why D510 is defaulted to HQ, the setting required for photo quality 5x7's.I leave resolution to HQ and use a bigger 64Meg mem card. I change the Digital Zoom default from OFF to ON because so I always get the full range of both Optical and Digital Zoom via the Zoom lever on top. In the ON option, a graphic shows on your LCD in pic taking mode to indicate when you have Zoomed past the Optical(optical does not degrade resolution) and are entering Digital(will begin to reduce resolution of pic). In addition, when you are still in Optical you will here lense motor run. When you are out of Optical and into Digital you will not here motor any longer. Digital zoom only shows in LCD, not Optical View finder, so be sure to frame you shot in the LCD if zooming past the 3X Optical.2. The flash pops up automatically to be sure you don't forget to open it, missing a pic that needed it. To turn it off, just hold down the flash while taking the pic, or use right arrow key to set it to OFF or to set other Flash Options before taking pic.3. BATTERIES. You MUST get 1600 Mah or higher NiMH or NiCAD batteries and charger. ALL digital cameras and toys eat Alkalines and other non-chargeables. Get eight AA so you have a ready set of 4 for backup. You will get great battery life from each recharge, even when using the LCD for viewing your pics and setting(framing) your pic shots. You will not be happy if you don't invest in rechargeables and a larger Memory card.4. You must use an Olympus SmartMedia Card to use the Panorama feature. Since these cost more than generic brands, I use the Olympus 8Meg that came with the camera for Panorama shots and use my generic 64Meg for all others. Note the Digital Panorama is not the same as Analog Panorama. It is not a one shot deal, but more than one shot pieced together in the Cammedia Software supplied. Takes some practice and a MUST READ of the Manual.5. To view your still pics on the LCD push monitor button once, if lense is closed. If lense is open, press twice in quick succession. Press again to quit. To set view/play movie options, close lense and press monitor, then press OK. To set Pic taking options, open lense and press OK. Use arrow keys to navigate to options and OK to set an option change.6. The quality of you pics have as much or more to due with lighting and the stillness at which you hold the camera, than the resolution(mega pixels) you choose. A digital camera takes longer to take a picture than an Analog, and even more time in low light, no flash, zoomed, and high resolutions settings. One could write a book here, and there are some. Read up so you will be happy and not blame the camera for limitations you should be aware of before changing to Digital Photography. The keys one are, in order of priority; frame your shot in the viewfinder when possible with focus frame centered on non-bright area like persons face, not a white shirt, hold the shot button down half way till a green light tells you it has focused. Hold camera very steady 1 sec before and 1 second after pic is taken. Squeeze pic button between index on top and thumb or other finger(s) on bottom of camera. Don't just push on top because like a rifle shot, if you pull the trigger your barrel will move. If you slowly squeeze it, it will not move.More steadiness time is needed for low light, flash OFF, zoomed and high resolution(megapixels) shots. If you pic is somewhat blurry it is likely you and not the camera. Newer digitals have Digital Stabilization to mitigate some movement during pic taking.Finally, the D510 is an awesome and reliable camera. It deserves a 5, but the stupid manual and some un-intuitive menu labeling and navigation has reduced it to a 4. I would highly recommend it as a low cost camera for anyone who wants a digital but don't want to spring for an unknown new one at high cost. You will have to pay over $300 for a camera with the pic taking options and control this one gives you.", "Date": "July 11, 2005"}, {"Title": "Great Little Camera", "Author": null, "ReviewID": "R22TKY6TT0PVRE", "Overall": "5.0", "Content": "I've had the camera for three days and it is everything I expected.  Took about twenty minutes to read the \"basic\" manual which allowed me to take and view my first digital pictures.  I followed the simple procedure for loading the software (I have Win 98)and had my camera transferring those pictures to my computer in no time.  My only regret is that I didn't spend the money to get the ac adapter and the rechargeables, these things eat batteries!  I'm getting those items today!  Get the extra memory card (I got the 64mb), the 8mb included is not enough.  One other negative I had read about was the lens cover, however, I do not personally have a problem with that.  As a matter of a fact, I like the lens tucked away when not in use.  Bottom line initial impression:  takes great pictures, feels good, easy to use, looking forward to getting into the more advanced features of this reasonably priced point and shoot.", "Date": "February 17, 2002"}, {"Title": "Can't put it down", "Author": null, "ReviewID": "R1JYHBJI359RN1", "Overall": "4.0", "Content": "The D-510 takes great photos, but it goes through batteries like a hot knife through warm butter! Get the rechargables!", "Date": "February 9, 2002"}, {"Title": "Digital Delight", "Author": "Glen Brandow", "ReviewID": "RH431CB99KXUJ", "Overall": "4.0", "Content": "I bought the D-510 in mid-November, to get a jump on the holiday rush and to gain some experience with the camera before the holidays. A first timer to the world of digital, I easily got up to speed on this easy to use camera after a bit of trial and error.The camera itself is a breeze. And the quality of the photos is excellent. If you are a typical point and shoot user, 2.1 Mega Pixals is just fine for great photos of all sizes. The D-510 gives you the option of increasing the resolution quality if you want to print larger format photos, up to 8 X 10.  Don't listen to anyone who tells you to waste you money on a more heavy duty camera.The only negative comment I can make, such as it is, is that the Olympus software to download photos to your PC isn't the greatest. If you don't read the manual, you'll be completely lost. However, most newer PCs (and you need a newer PC anyway) offer good alternatives, like Dell's suite of photo [Amazon.com], and is fabulously simple, and offers great editing capabilities.Long and short, the D-510 bundle is a super value. I've seen the same camera in retail outlets for $20 more than I paid without the recharger, batteries and case. Throw in the tax and I figure and free shipping and I saved $100.Buy this camera!", "Date": "January 3, 2002"}, {"Title": "My First Digital Camera", "Author": "Realcog \"realcog\"", "ReviewID": "R2PI54K1QSI0GZ", "Overall": "5.0", "Content": "This was my first entry into digital cameras.  After research (talking with other digital camera owners,looking at specs,etc)I made the plunge with the D-510 Value Package.  Turns out to be a good choice as I was able to immediately take good photos and most importantly download them easily.  While I found the instruction manuel skimpy, it was still fairly easy to learn the ropes.  Only thing I don't like is it is difficult to easily slid open the lens cover.", "Date": "November 16, 2001"}, {"Title": "Read reference manual thoroughly for best picture.", "Author": null, "ReviewID": "R2L19WERU5WIIK", "Overall": "5.0", "Content": "You must read the reference manual thoroughly located in CDROM to have best picture quality. Tip : It is useful to utilize half-pressed shutter button mode before taking pictures. Press shutter button very lightly and hold. (see manual for details)Use high current-hour capacity battery for outdoor pictures.Make yourself familiar with battery life cycle trends. Battery may die more quickly in continuous monitor mode and flash light.I think D-510zoom is best buy for the price, but do not expect highend quality. Sorry for bad english.", "Date": "November 16, 2001"}, {"Title": "D-510 a great bargain camera", "Author": "DJ", "ReviewID": "R3AAHGVS8C3J6H", "Overall": "5.0", "Content": "I am new to ditigal photography, so I spent quite a bit of time researching various models and prices.  I finally settled on the D-510, and I'm very happy with it.  It is certainly a bargain, with 2 megapixels and a 3x optical zoom (ignore digital zoom when shopping for a camera).  It takes beautiful pictures!  My wife and I took it to Europe the first week we had it, took over 750 pictures, and had to toss out maybe a dozen that were blurry or otherwise didn't turn out well.Pictures taken outdoors turn out especially well, even using the macro mode to take them within a foot or two.The biggest complaint I have with this camera is that the software that comes with it is not very good.  It allows you to rotate and mirror the images (things which Windows XP will already do for you) as well as crop, cut and paste them, but it is notoriously unstable.  I don't use this software very often, so I haven't had to deal with that issue much at all.So even though the software is lacking, the camera is awesome so I'd still highly recommend this product.", "Date": "May 24, 2002"}, {"Title": "Very easy to use with great quality", "Author": "John Woneis", "ReviewID": "R2EAEZCLRP4FWY", "Overall": "5.0", "Content": "Right out of the box the camera easily produced excellent quality pictures.  The menu's are fairly intuitive however the paper manual is very sparse.  You need to look at the .pdf file included on the CD Rom.  If you don't have a USB port on your computer you will have a difficult time downloading the pictures.  Download from the camera is only by USB.  Download of the smartmedia through a reader, is an alternative, but finding a reader that isn't USB is a major task.", "Date": "March 20, 2002"}, {"Title": "How easy to use", "Author": null, "ReviewID": "RL1GCH6I6F2HN", "Overall": "4.0", "Content": "My husband and I were shopping for a camera that would be easy to use and would take good pictures. For beginners like us, this camera has been very easy to figure out. Although we don't have much experience in photography, we took pretty good pictures with our camera. We are very satisfied and would recommend this camera to anyone looking for a reliable camera easy to use.", "Date": "January 24, 2002"}, {"Title": "Amazing product", "Author": "\"ghernandez@terminales.co.cr\"", "ReviewID": "R37443ATQGUSB3", "Overall": "5.0", "Content": "Incredible resolution and very easy to use.  Very dynamic, I can see the pictures in the TV and in the PC.  The video option is a plus.  I'm really satisfied.", "Date": "September 17, 2001"}, {"Title": "Excelent Camera for the money", "Author": "Manlio", "ReviewID": "R3VPZEYXPF1VLH", "Overall": "5.0", "Content": "After reading all the reviews, and comparing to other digital cameras, I decided to get this one. It has a compact design and it seems very well built.Picture quality: very good, excelent with natural light (sun), not perfect with flash. There are many options for taking pictures, different qualities. One thing I liked is that you can opt for the TIFF format, which does not compresses the image, very useful if you need to take a picture to work with it then (if you are a grafic designer and don't want to spend more, this is a good option).The quicktime movies are cool, nice to show things on the web.The Smartmedia Card of 8MB is too small, I recommend getting a 64MB Viking which is working ok.The only thing I have to say as a con, is the manual, that it's not very complete.I totally recommend this camera.", "Date": "February 21, 2002"}, {"Title": "Great Camera", "Author": "Scott Pilotti", "ReviewID": "R3RAD6C0MHRCV1", "Overall": "5.0", "Content": "If you are looking for a camera in this price and or pixel range this is the camera to buy.  Takes excellent pictures and offers a variety of detail settings.  Download pictures to pc or attach them from the camera directly to e-mail.  The pc reads the camera like an extra hard drive - nice feature for deleting, saving or sending pictures.  I spent some time comparing this camera to others in this range and the D-510 proved to be the better value and a great performing product.  I am very happy with this camera.  The question now is what should I do with my two 35mm cameras?", "Date": "February 20, 2002"}, {"Title": "Worth Every Penny!", "Author": "Vincent", "ReviewID": "R33C9YLC72ZLZP", "Overall": "5.0", "Content": "I can't say how impressed I am with this camera. I carry it everywhere. It takes the best digital photos and even at its lowest resolution settings, the photos are still great for printing. It's also really easy to use. Like the brochure says, point, zoom, click and shoot! The only problem is, I lost the USB connector cable that comes with the camera and being a special USB cable made only for this model I could not find a replacement anywhere, even in the Olympus site.", "Date": "October 10, 2001"}, {"Title": "Excellent Choice", "Author": "dhm19382 \"dhm\"", "ReviewID": "RBR7R8ZT46YLW", "Overall": "5.0", "Content": "We spent 6 weeks checking out options and compairng features for our first digital camera.  The D-510, with the value package has been an excellent choice.  We haven't fully teste battery life, but the pictures exceed expectations.  The full image is tack sharp - to the corners, a problem I noted on several other 'pocket' cameras.", "Date": "November 28, 2001"}, {"Title": "A fine camera", "Author": "Merle  Hansen", "ReviewID": "R3DOO0PNCX73QE", "Overall": "5.0", "Content": "I have a tendency to jump right in and use a new device without pausing to absorb the directions. This time I took the advice of other reviewers to read and inwardly digest the manual supplied on the accompanying CD. I even printed it out (all 137 pages). It's clearer and vastly more helpful than the small printed \"Basic Manual\" supplied with the camera. Consequently, I learned to use my Olympus D-510ZOOM quickly and am thoroughly enjoying it. I feel this was a good purchase for me who is rather a neophyte to computers and cameras.", "Date": "December 27, 2001"}, {"Title": "A good camera for the price", "Author": null, "ReviewID": "RR6V4PU4SWIDX", "Overall": "4.0", "Content": "I bought this camera after being so impressed with the Olympus D490 I used at work. I was surprised that the body of the D510 is so much \"cheaper\" than the D490--the D510 feels less durable, and I handle it more carefully because I'm afraid I'm going to break it. It looks and feels like cheap plastic.I used the D510 to take action shots at a bullriding event. In using the sequence mode, I was frustrated that the camera would only let me take two shots in a row, and the majority of those shots were blurry. After the initial two shots, the camera seemed to \"lock up\" and I missed a lot of great shots. Shooting in regular mode produced clearer, crisper pictures.Taking rodeo photos, I can't always get as close to the action as I want to be, so being able to zoom in is very important. I'm regretting not paying a few hundred dollars more for the Olympus C-700, which has a 10X optical zoom. The D510's 3X zoom is a good feature considering the camera's price, but if you need to get even closer on a regular basis, consider paying more for another camera.", "Date": "July 22, 2001"}, {"Title": "Good Camera, Bad Manual", "Author": "P. Pham \"whathot\"", "ReviewID": "R198ISBM5B64PJ", "Overall": "4.0", "Content": "I was looking for a digital camera that can deliver high quality picture, but at a reasonable price.  Constrained with a budget of $300, I bought this camera by the influence of the rave reviews.  And what I can tell you is this: oh it's true..it's true, the picture quality is very good!  And once you have figured out all the functionality of this camera, you will appreciate it even more.But that's thing! You have to figure some of the instructions out yourself because some are missing from the manual book.  For example, I had to go to the web to learn that using the LCD screen instead of the VIEW FINDER for take pictures is a batteries killer! But using the LCD screen to preview the pictures from the memory card doesn't consume batteries as much as using it to take photos.  Gee, could have save me a few bucks and hassle if this was mentioned in the manual.Another is if you go to FAQ at Olympus web site, you will find that there is a question, \"How do I get the camera to work?\". Well, this just proved my point!  And from my first experience with this camera, I actually have a very hard time getting it to work too. The problem is really dued to its misguided manual book.  For instant, it said: To start, slide the len cover out until there is a click, and wait for the len to pop out.  I did that, and nothing happens; I did really thought the camera was broken.  But if you're familiar with most sliding cover digital camera, you would know that after the first click, you must push the cover back one more time for a SECOND click.  This is my first ever digital camera, how do I suppose to guess that when the cover seems to be already completely opened?!?", "Date": "April 18, 2002"}, {"Title": "Great pictures, GREAT price!", "Author": null, "ReviewID": "R39WJ3O781T26W", "Overall": "5.0", "Content": "The Olympus Camedia D-510 is a perfect camera for everyday use. I did a lot of research and did a lot of comparison shopping, and this is, by far, the best value.This camera has a lot of features that the more serious photographer can utilize, but it's also very easy to operate as a \"point-and-shoot\" for the amateur. The software is super simple to use, and getting pictures from the camera to the computer couldn't be easier or faster!", "Date": "February 14, 2002"}, {"Title": "I LOVE my camera!!", "Author": null, "ReviewID": "R2RMZUFNVKGE74", "Overall": "5.0", "Content": "I have absolutely no complaints about this camera.  For its price, its a great buy.  It has great features, like quicktime video (no sound), digital zoom, timer, overall, many more photo settings than the average person needs.  It's great!!", "Date": "December 23, 2001"}, {"Title": "The Perfect Present", "Author": "hank Mixsell", "ReviewID": "RLM5V0A3E6BX3", "Overall": "5.0", "Content": "I was lucky enough to receive a Canon D-510 for my birthday in June, just before setting off to Puerto Rico with my family for a  vacation.  Although I drove my two sons (19 and 22) crazy, I couldn't stop taking pictures.  The quality was wonderful, and I could edit out the ones  I didn't want to keep every night.  I even took some video in the rain forest above San Juan.  When we got home, I simply plugged in the camera to my iBook and downloaded the pictures I had saved (over 100 of them).  With the Camedia software, I was able to \"tweak\" any of the pictures I wanted in almost any way imaginable.Then in July, I took my camera to Mexico with me for a month-long sabbatical in San Miguel de Allende.  Once again, I took pictures all day, but this time I had my iBook with me so I could download each night the pictures I had taken.  I took well over a thousand pictures and have a marvelous visual diary of my wonderful month in San Miguel, which I have since edited down to some 150 pictures to show school groups through a video projector.The enthusiasm I have for this camera can be measured by the fact that two colleagues have bought digital cameras as a result of having seen my pictures of Puerto Rico and Mexico.  I also continue to use the camera at school, taking pictures of school events, classes, excursions, plays, etc.  I print them out (multiple pictures/page format) and display them on hallway walls.  Coppys of the drama production stills, printed on glossy inkjet paper, are sold as a fund raiser for the thesbian society.I can't think of a more wonderful gift for someone who likes to or has to take pictures than this relatively inexpensive, reliable, versatile camera.", "Date": "November 30, 2001"}, {"Title": "LOVE IT", "Author": null, "ReviewID": "R3C1TVM6E3ZW5V", "Overall": "5.0", "Content": "The D-510 was debated on for a long time before I decided it was the best for the bucks. I was right. Perfect size, great photos. Muchto learn about this little camera but so far I couldn't be happier. I have Windows ME and getting the pictures is a snap! Purchase more batteries! You will definately need them!", "Date": "October 12, 2001"}, {"Title": "Decent First Digital Camera", "Author": "James A. Swartz \"JASwartz\"", "ReviewID": "RNYX92ZMI72MS", "Overall": "3.0", "Content": "I am not a pro photographer but my family and I enjoy taking photos of our adventures and gatherings. Late last year, I decided to take the plunge. After reading reviews online and visiting Best Buy to actually feel the camera in my hands, I opted for the Olympus Camedia 510. After using it a year, I would say it is a decent, but not great camera and that for basic pictures in good lighting, it works well. It fits well in the hand, is very light and portable, and if you have never taken digital photos before, it is a real kick to see your work on your PC right after you shoot the photos.The rub is that digital cameras, and this one is no exception, do not work at all well in lower lighting with the flash. You tend to get too bright and harsh images in the foreground and blackness in the background. You have to go up in price to get some correction for this. And, as other reviewers have noted, the time lag between depressing the button and waiting for the picture to be copied to the card is longish. Forget snapping a quick sequence of photos. And forget the manual. It was written by some tech geeks at Olympia who do not have a clue how to write clear, simple, direct instructions, or how to design a clear, simple menuing system for the camera. It took me a half hour to figure out how to delete a photo using the LED menu.This is just a personal note: You have to slide the lens cover over to use the camera and then the lens extends itself. You snap the cover back to the edge of the lens and it retracts and you can close the lens cover. While this is nice to protect the lens, it got really annoying to me over time and I longed for a simple camera with a simple lens cover.The pictures can be very vivid, even spectacular in their resolution, but sometimes the colors can be a little harsh.I suggest that if you want to take basic pics in day light or well lit rooms, this is a decent little camera and the price will only keep getting lower. Plan on getting a higher memory card, a battery recharger kit and rechargeable batteries, the card reader to hook up to your PC (works like a charm) and download your own photo editing software.If you want more advanced features, better imaging, and better performance in dim light, you will have to go up in price.", "Date": "October 10, 2002"}, {"Title": "Great for Travel", "Author": "pinktech", "ReviewID": "R2MRGT0GWXH3J5", "Overall": "5.0", "Content": "I love to travel and I always pack light. Years ago I began to leave my SLR at home in favor of an Olympus 35mm point & shoot, because never missing a moment is more important to me than capturing every Ansel Adams degree of detail. When I looked for a digital camera, besides super sharp images, I wanted one that would fit easily in a daybag pocket, had 2 megapixels (for the occasional enlargment), used smart media (less of a battery eater than compact flash, hence don't have to buy or pack as many batteries) and had a zoom lens. On two vacations and several other short trips, I've gotten some great pix. The only drawback is the software; it's not hard but it's also not intuitive. Before you go, either learn how to do the basic steps like deleting a single image, or plan to pack your instruction manual. If you're packing for a one week vacation, I'd bring 2 64mg cards, one or two extra sets of good batteries (the kind made for electronics), and a padded case with pockets or slots to hold said batteries and media. A flash path adapter is a useful accessory if you want to upload your pix but don't have access to a USB port and/or don't want to drain batteries. For the professional looking to make fine art, this isn't your camera. For anyone who wants to take pics wherever & whenever, this is it.", "Date": "April 9, 2002"}, {"Title": "Superb Digital Camera", "Author": "Morgan Harvell", "ReviewID": "R2DWGXCVKNCYUD", "Overall": "5.0", "Content": "We use one of these at my job to make ID's, take pictures of incidents and events that take place at work. The CAMEDIA software is very user friendly, so easy even a 5 year old could use it. I like this camera so much that I am seriously thinking about purchasing one sometime in the near future for myself. I highly rrecommend this camera to anyone shopping for a digital camera with great features although not too taxing on the wallet.", "Date": "September 30, 2001"}, {"Title": "Just what I was Looking for...", "Author": "Jeffrey C. Kounz", "ReviewID": "R2BGKMO8WKUG9M", "Overall": "5.0", "Content": "For my first Digital Camara, I wanted one that would provide everthing I was looking for.  Not only did it provide all the amenities but it is a excellent camara for the money.  Sure you can always get better, but for the money I got more than I was expecting.It beats my 35mm hands down! Now all I have to scan are the old pictures. My first pictures turned out better than a majority of any pictures I took with my Fuji 35mm.  Make sure you get a 64MB (picture) memory card with your camara.  It will be all you will need for a long time.", "Date": "January 13, 2002"}, {"Title": "Excellent bang for the buck!", "Author": null, "ReviewID": "R19FC08GO7YTK2", "Overall": "5.0", "Content": "I've researched and purchased a number of cameras for our school. The Olympus line tends to be the most durable and trouble proof....and the Olympus 510 providing the most bang for the buck.Don't bother with the included software. Go ahead and download the USB driver (available from the Olympus website) if you're using Windows 98 and use the camera's drag and drop recognition.Invest about $25 in a NiHi set of AA batteries and charger (any Radio Shack carries them) and you have a great, rechargable system. I usually purchase several SmartMedia cards and swap them out like rolls of film until I can get to a computer to download my photos.The resolution is excellent and when printed on regular photographic paper, is indisguishable from photos taken with a mid range 35mm camera.", "Date": "June 24, 2002"}, {"Title": "Great for amateurs and the slightly more advanced!", "Author": "Mom of One", "ReviewID": "R1DKWPP22T7IR9", "Overall": "4.0", "Content": "I love this camera. Let me begin by stating why I have given it 4 stars as opposed to 5. If you are using regular AA batteries you better buy stock in Duracell or Eveready. This camera burns through batteries very quickly even if you do not use the monitor. I recommend buying the package that includes the rechargeable batteries and/or buy an AC adapter. And gosh, why didn't it come with a case?With that being said, the picture quality is supberb on just the default settings. I have never used the highest quality setting and every one raves about the quality of my pictures. Not only the quality as seen on a computer or printed on an at home printer, I recently uploaded the pics to an online developer and the hard copies were BETTER than pictures I take with my standard film camera.  Initial set up was very easy, once I put in the batteries and the memory card I was taking pictures no problem. It has a myriad of features including zoom, digital zoom, ability to take extreme close-ups (great for online auction addicts), several flash options, create QuickTime movies, blend pictures together for panaramic shots, auto timer (so the photographer can get in the picture) among many others! It has a slew of features that I am sure are for the more \"professional set\" and at some point I'll play with those. Hooking the camera to the PC is also a snap. Once you install the software and connect to the USB port the camera becomes a \"removable\" disk drive that you can navigate to just like any other disk drive. The Camedia software is simple but does the job but those who want more complex operations may need additional software. It has an one click Instant Fix that works remarkably well.  I am a very satisfied customer.", "Date": "December 26, 2001"}, {"Title": "Easy to use and Feature Packed", "Author": "Rex Moffett", "ReviewID": "R3E15W2AQ637A5", "Overall": "5.0", "Content": "This is my first digital camera and I have been nothing but pleased.  The picture quality is incredible and when I email them to ofoto.com the prints look better than I was getting with my APS film camera.  The camera is very easy to use and has more features than I expected.  It is easy to upload pictures to a computer through USB.  The only drawbacks are the somewhat vague directions and it eats through batteries.  A larger memory card is mandatory because the supplied card only holds 16 pictures.  Bottom line, the picture quality is excellent and the camera is very easy to use.  I highly recommend it.", "Date": "August 7, 2001"}, {"Title": "I absolutely love this camera.", "Author": "\"gutterxsparkle\"", "ReviewID": "RCKFVBTZVG26U", "Overall": "4.0", "Content": "I would like to comment on one of the reviews that was posted on here earlier saying that their camera zoom didn't work and there was no picture in the LCD display. I had this \"problem\" for 20mins when I first got the camera simply because I didn't open it all the way. Once I read the manual and learned how to use this camera it has been nothing but fabulous to me. Even though it like other digital cameras eats a large amount of batteries- so you will need to make another purchase of a battery charger, which has at a very low price, by the way. Also I love the way it takes less than a minute to get all my pictures into the computer. It's a great camera.", "Date": "July 11, 2001"}, {"Title": "GREAT!", "Author": "James Nichols", "ReviewID": "R2RLHPZTGLD0O1", "Overall": "5.0", "Content": "I absolutely love this camera. I shopped around for one for months and I originally decided on this camera's predcessor, the D-490. After hearing that a newer version would be coming out with USB support (the D-510) I postponed my purchase until this marvel came out. The only thing I do not like about the camera is that it is missing the small monochrome LCD on the top of the D-490 that used to display battery usage and pictures remaining. While this isn't a major setback it would have been nice to have. Overall, I am VERY satisfied with this camera.", "Date": "June 29, 2001"}, {"Title": "Good first digital camera.", "Author": "Annie", "ReviewID": "R1RFYH2L41Q4RH", "Overall": "4.0", "Content": "When I purchased the Olympus Camedia D-510, it was done in a last minute decision. I was traveling back to my homeland of Taiwan, and I knew I wanted to take lots of photos, but I also wanted to upload the photos for easy acces sharing & printing later on. After spending some time comparing reviews online, I settled on this model because it was in (well, not really) my price budget.This is my first digital camera, and so far, I am quite pleased with it. The camera is easy to manipulate, the buttons are not too complex and the photos came out fresh and crisp when printed from an online photo source and from home. However, I do have three quirks about this camera.(1) Placement of the LCD  (?) Screen: When you're not using the LCD screen to view the shot you're going to take, you'll end up pressing your face to the viewfinder and the screen gets smudgy.(2) Delay in opening/powering on: This time elapse was a bit annoying when you had people posing and they're waiting while the camera turns on.(3) Battery Use: Be careful, this camera uses a LOT of batteries. It's always a good idea to stock up on extras.Other than the mentioned quirks above, I am overall tremendously happy with my last minute decision to buy this camera.", "Date": "June 21, 2002"}, {"Title": "Great Little Camera", "Author": null, "ReviewID": "R1AL95EW8296MQ", "Overall": "5.0", "Content": "One of the best cameras that I've tried. Have had it since Nov. and have taken over 1,000 pictures and they have all been great! especially with the software you can get a quick fix and the pictures come out just great. The zooms are wonderful.", "Date": "January 10, 2002"}, {"Title": "I'm Impressed", "Author": "Jessica Ann Fiallo \"big j\"", "ReviewID": "RUGW3TZMYOHOA", "Overall": "5.0", "Content": "I love this camera.  The pictures are great, it is easy to use, easy to download, and full of features.  I love having the choice of color, black & white,or sepia.  I also dig the movie feature, it is reminiscient of old 8mm films my dad used to take of us.  I like the fact that my 4 and 5 year olds can easily use it with the LCD.  The price was really good too.  Lots of features and pluses (...)!!!!  I recommend this camera to all my friends!", "Date": "December 22, 2001"}, {"Title": "Great Camera [bad] batteries", "Author": "Wade Holbrook", "ReviewID": "R1Y7JUN1JYEG3S", "Overall": "4.0", "Content": "Great Camera!  I have Windows ME (which I hate! but that's another story) and the camera plugs right into my USB and I can download the photos instantly!! Windows ME reads the camera as an extra drive so you can copy and paste or delete off the smart card from your computer.  Amazing feature.  Great photos! Pretty good zoom function too.  Digital zoom (9x) is good, not great, but good. I don't like the fact that it does not remember your settings when you turn it off.  You have to reset them (ISO, flash,no-flash,red eye reduction etc)all over again when you turn the camera back on. Lastly the batteries [are bad]...I recommend rechargeables.  Overall I am very happy with this camera and you can't beat the price for what you get.", "Date": "March 21, 2002"}, {"Title": "Olympus D-510", "Author": "Douglas B McCreery", "ReviewID": "R1MLKI2PDTX3YD", "Overall": "4.0", "Content": "The D-510 produces very nice pictures with very good detail, and no detectable distortion or chromatic aberation. The camera is easy to use, since most functions are automated. The camera case (particularly the front and sliding lens cover) is of a cheap, plasticy constuction; for $... bucks, Olympus can do better. The battery compartment cover is a hybrid slide-and-hinge design that is easly damaged by anyone who has not used it before. There is no LC display on the top of the case, so you must activate the view screen to see the set-up status ( a bit hard to see in strong light) The Alkaline batteries that came with the camera lasted all of 25 minutes! The macro function is a bit limited, since it will not focus at distances less than about 10\". Overall, a very nice camera with a good lens, but with a few rough edges.", "Date": "February 24, 2002"}, {"Title": "The D-510 is a great travler", "Author": "Hugh T. Shook", "ReviewID": "RYBACTUEO3KAY", "Overall": "5.0", "Content": "I printed the instructions on the CD that was included in the camera package [151 pages] and found this an excellent referencewhile learning to operate the camera. It is compact and easy to cary. I have taken over 500 pictures and found the picture quality good and the camera easy to operate.I have difficulty documenting and recieving the promised rebates. The computers at the rebate center are very confusedwith my application for the promised 64 MB smart media card promised in the pre-christmas promotion. I have made 2 snale msil submittals and numerous E-mail follow ups without success.", "Date": "February 15, 2002"}, {"Title": "Excellent digital camera!", "Author": "Tammy Bovey", "ReviewID": "R943D6R7Z3IJZ", "Overall": "5.0", "Content": "I searched for a digital camera that would meet my photograpy needs.  I am always taking pictures, and love to send them online to friends and family.  The camera is easy to use, my teen daughters use it too. You definitely need rechargeable batteries.  The price is very reasonable for what you get.  I take it everywhere for those wonderful candid shots!  Buy it, you won't be disappointed, and if you are, it's because you just can't appreciate a good camera.", "Date": "January 11, 2002"}, {"Title": "Very Nice Camera", "Author": "\"aborzoi\"", "ReviewID": "RKKGWOFY6LQGK", "Overall": "5.0", "Content": "This is a very easy to use camera.  The pictures are very clear and sharp and easy to download, especially with Windows ME.  I haven't loaded the Camedia software, so I can't speak to that.  I would recommend this camera to anyone looking for a digital camera.  Olympus is known for their quality, and this camera lives up to that quality.", "Date": "December 13, 2001"}, {"Title": "Great camera with only one flaw", "Author": "Mrmako", "ReviewID": "R1OCMMNBUGQBTQ", "Overall": "4.0", "Content": "This is a great all around camera for the average person to use.  I bought one for my father and he has no problem using it as his first digital camera.  It is simply and easy to use, with a basic manual that answers your questions as need be.  I have borrowed this camera for myself and found the picture to be quite clear.  It was easy to use on pick up, I only went to the manual occasionally. It is very easy to transfer you pictures to the PC.  The wizard is useful for transferring to the PC, but you can also just treat this as a removable drive.  The LCD window is great for taking up close shots and the zoom is enough for most people.  This is a point and shoot camera and is one of the best at 2.1 MP.The only problem is the camera lens door!  You have to open it of course to shoot, but if you do not open it all the way the camera will not take pictures and this can be confusing for some.  You must make sure to click it all the way.  That would be okay and you will adjust, but when taking shots it is easy to shift the door slightly back in and cause the camera to not take pictures.  This is the only flaw, it will frustrate you greatly when it happens, but I have adapted to taking pictures in a way to avoid this.I still recommend this camera for 2.1 MP, but I also recommend buying the new 3.0 MP version (D550).  It is very similiar and you get a lot better resolution.  Search pricegrabber.com for competitive prices.", "Date": "November 9, 2002"}, {"Title": "Great camera, decent support, fair documents, fair software", "Author": null, "ReviewID": "R1JXJ1YBUSSGAG", "Overall": "5.0", "Content": "Purchased this camera recently.  A great value when I bought it if you look at features vs. price.  Quality of photos very good.  Easy to set up camera but you need to make sure the lens cover is fully open to turn camera on.  I had trouble understanding how the software communicates with the camera.  The docs were not helpful and it looked like I had some kind of communication issue.  I email'ed support and got a prompt response.  Basically, with Windows ME some of the functions are not required and do not work, eg image transfer via menu item.  The software itself is pretty sparse in terms of image editting capability, luckily I have some better software that came with my ...Visioneer scanner.  Overall, very happy but they should improve docs and add some more software.", "Date": "February 14, 2002"}, {"Title": "The Best Christmas Present", "Author": "Happy in Monticello", "ReviewID": "R1OBJ3JBV5VK64", "Overall": "5.0", "Content": "I got this camera from my husband for Christmas, and after a little reading, I was using it like a pro.  It's my first digital, and I love it. The software is easy to use, and it couldn't be simpler to download the pictures from the camera to my computer.  The pictures are great, very clear.  The rechargable batteries are a must.  If you want a fantastic mid-priced digital, this is it.  Olympus makes a great product.  I have one of their 35mm's and the digital did not let me down!", "Date": "January 3, 2002"}, {"Title": "Watch out", "Author": "Matt Tatom", "ReviewID": "R34IG5LXXXK7X4", "Overall": "2.0", "Content": "I just recently purchased a referbished item from cec-corp and the item malfunction in just a couple of days and i tried to gain information on returning the item but neither cec-corp or olympus would help me, so watch out for cec-corp", "Date": "May 24, 2002"}, {"Title": "Love the Camera", "Author": "M. Bernard", "ReviewID": "R2WN2RZBH7L8EM", "Overall": "4.0", "Content": "I didn't just run out and purchase this camera. I did a lot of research on Digatal Cameras first. I was thinking the best camera for the least amount of investment. I read the pros and cons of the Olympus D-510. I already owned 2 digital cameras so I knew what I was looking for. Some of the shortcomings I read were the retracting lens and flash. You quickly get used to this and I actually now think its a good feature. I also read that the Instruction Manual was very weak but if you look at the one on the CD it covers every aspect of the camera and should be printed out in full. Take your time, read the whole thing and play with each feature and you will love this camera.It does go thru batteries like a hot knife thru butter but that is easily solved by recharables. I purchased 8 of them so I always have 4 fully charged. All in all I love this camera.I tried the nighttime feature of the camera and was amazed.  I was in complete darkness (had to put on a light to find the shutter button) and the picture looked like it had been taken in sunlight.", "Date": "March 3, 2002"}, {"Title": "Great Camera", "Author": "Dmitri Karimov", "ReviewID": "RH2U41SVKXJA3", "Overall": "5.0", "Content": "-very good battery life (on 1600mAh NiMh batteries - approx. 100 shots with LCD and flash, and batteries still full)-good resolution, colors, and picture quality-good zoom-good options (for example, to save settings on exit)", "Date": "March 2, 2002"}, {"Title": "Awesome Camera for the $$$", "Author": "Matt Militano", "ReviewID": "R3FXR0TJHQ5LTP", "Overall": "5.0", "Content": "I love this camera. Awesome picture quality. Durable,compact. Great features. For someone new to the digital world and are looking for a camera that offers great features and quality for the money I would definitley purchase the D-510 zoom...I'm very happy.", "Date": "February 25, 2002"}, {"Title": "A little bit complicated for  beginners", "Author": "titafeo \"orofeo\"", "ReviewID": "R7ZKG971WEFEQ", "Overall": "4.0", "Content": "I am pleased with my purchase, however, the instructions are complicated for beginners like me. So far, I haven't learn how to take movie pictures, for instance, and each time I open the lens barrier, I have to change the settings for the picture conditions. And the most important thing: although I made my purchase within the days stablished in the promotion of the \"Free 64 MB Smartmedia Card\", and submitted the information requested, the Rebate web site (rebatesHQ.com) clasified my reward as \"invalid\" and rejected it. Lets think it is a misunderstanding and they are not cheating me.", "Date": "January 28, 2002"}, {"Title": "excellent camera", "Author": "\"sfgardening\"", "ReviewID": "R2MAHUY0RVU22X", "Overall": "4.0", "Content": "i really like my d-510, close-ups are beautiful, it performs extremely well - although the 'panorama' feature simply does not work anymore on my relatively new camerai do not like the sliding lens cover or the wait between shots or only being able to view pics when camera is shuti wish it recorded sound with the quicktime movie feature", "Date": "February 3, 2003"}, {"Title": "The  Best", "Author": "Larry McLean", "ReviewID": "R23SG0SE2Y53PE", "Overall": "5.0", "Content": "Great Picture Quality and INSTANT hook-up and down loading on my Windows 2000 machine with the included USB cable.  No need for seperate media reader hardware.", "Date": "May 9, 2002"}, {"Title": "This is a great camera", "Author": "Charles W. Long", "ReviewID": "R2ZYFQTWEWKYN1", "Overall": "5.0", "Content": "I agree with all the good things said about this camera in the current reviews seen here. The Olympus software installs smoothly and works well, but if you are running Windows XP you don't even need the software. Downloading your pictures is simple and fast. I produce very small and detailed craft items (boats in bottles) and the macro in the Olympus 510 is great for photographing work in progress on a model. I am told that I tend to be a nitpicker, but I really can't find anything I don't like about this camera.", "Date": "May 8, 2002"}, {"Title": "Nice camera - poor instructions", "Author": "Carolinehome \"carolinehome\"", "ReviewID": "R1ZCSF8NFGJ0BF", "Overall": "4.0", "Content": "See IMPORTANT HINT below.I've had this camera for about ten weeks now and have used it constantly. I've taken a lot of beautiful quality pictures. I didn't think 2.3 mp would be enough but these pictures truly rival my 35mm. We also enjoy how easy it is to view these pictures on our television. We've had two parties where we took several dozen pictures and then had an instant \"slide show\" on our widescreen TV that entertained everybody.On the negative side - expect to have a week of stomach churning frustration because the instructions are TERRIBLE and many of the features are not intuitive. In fact, I've learned a few things today from reading other reviews here. I guess the chief lesson is to use the manufacturer's website instead of the manual.IMPORTANT HINT: Everybody complains about the battery consumption. We bought the Camedia battery recharger and those batteries work pretty well but I couldn't find anywhere to buy an additional set of batteries. I finally found them. Feel free to contact me to find out where!", "Date": "April 25, 2002"}, {"Title": "Takes Great Pictures", "Author": "Louis", "ReviewID": "R1G5SOQZKTBFA9", "Overall": "4.0", "Content": "I am very happy with this camera, the pictures are fantastic, Its pretty easy to use and compact. I would recomend this camera to anyone.", "Date": "April 8, 2002"}, {"Title": "Excellent Digital Camera for non-experts", "Author": "\"ramesh_ln2\"", "ReviewID": "R1G4B0UI344164", "Overall": "5.0", "Content": "Very easy to use and good resolution. I love this camera. User manual could be more elaborate and user-friendly. Locating a specific information is very difficult.", "Date": "May 13, 2002"}, {"Title": "Great value digicam", "Author": "Maricris Go", "ReviewID": "RJBOLJX6CRHYE", "Overall": "4.0", "Content": "I got this camera for my mom and just test-drove it this weekend at a car show.  It's a really great value!  I thought that the picture quality would [stink] compared to my Olympus C2100UZ but it wasn't bad at all.  And it's also easy to use, perfect for my mom.  It's just a little heavier than I would've liked for her but I guess that's how digicams are.", "Date": "March 31, 2002"}, {"Title": "Very happy with this camera!", "Author": "Patty Campbell", "ReviewID": "R3HXM7SBGIB9UR", "Overall": "4.0", "Content": "Takes excellent pictures! We used Ofoto to upload and print copies of the pictures and you can't even tell they were taken digitally. We also purchased the 128MB card (made by Viking) which holds about 250 pictures.My only complaint about the D-510 is that it can take too much time to get the camera turned on (i.e. from the time you open the lens cover and turn it on, you may have missed the perfect shot). Over time, you have to be exceedingly careful about touching the front of the camera. Even a small tap to the front of the camera will cause the lens to retract and the camera to shut down.", "Date": "July 8, 2001"}, {"Title": "first  time camera buyers look", "Author": null, "ReviewID": "R3PATGBIY0CIIO", "Overall": "5.0", "Content": "I purchased this camera from [another retailer] on close out for... less than advertised on amazon. It works great. the only minor flaws are the small memory card I would recomend upgrading to a 128mb. and the camera don't take pic's if it's not snapped open but after you get used to it you'll have hours of fun toooo...", "Date": "December 15, 2002"}, {"Title": "I have no regrets about my purchase of the D-510.", "Author": "David H. Howes", "ReviewID": "R39YCK8YC2BGJT", "Overall": "5.0", "Content": "I looked around quite a bit before purchasing my first digital camera and settled on the D510 as a good compromise in terms of price, resolution, size, and quality. It has been a year now, and I am well satisfied. I have used it indoors and out, on trips abroad and along the coast in our sailboat. The camera, and the Camedia software packaged with it, have functioned perfectly.It does have a few irritating characteristics, though. The shutter delay sometimes seems long when taking an action shot. The instructions are not very clear, and the user interface is not very intuitive.Still, all in all, a very satisfactory first digital camera at a good price and I would buy it again.", "Date": "October 5, 2002"}, {"Title": "Pretty good camera...", "Author": "Adi Adler", "ReviewID": "R1RYRSDS4WPA2C", "Overall": "4.0", "Content": ".. takes pretty good pictures, etc.The only problems I have with it are:1) The smart cards for this camera have a mzimum of 128 MB - I usually need 2 - 3 cards to take on a few days' trip.2) The camera itself isn't very easy & intuitive to use-  it took me took me a while to understand how to use some basic features such as the zoom or how to delete a photo.", "Date": "May 7, 2002"}, {"Title": "It's good", "Author": null, "ReviewID": "R9I53ZW75TGQ0", "Overall": "4.0", "Content": "I thought the digital camera was pretty good once you figured out how to use it. The directions were not too clear. Once over coming that obstacle, it takes pretty good pictures.", "Date": "April 18, 2002"}, {"Title": "GREAT CAMERA!", "Author": null, "ReviewID": "R1SOSHNUMXOFMQ", "Overall": "5.0", "Content": "I love my Olympus.  Easy to use out of the box.  If you are trying to decide which digital camera to invest in, this is the best!  Pictures are fantastic, just can't say enough good things about Olympus!", "Date": "January 3, 2002"}, {"Title": "Sharp but not bright.", "Author": "Amazon Customer \"leige\"", "ReviewID": "R2T6NJGSOCBECP", "Overall": "3.0", "Content": "I bought this camera on Mar.2002, I took some good indoor pictures but I was totally upset by the outdoor picture quality. The colors are always look darker and colder than they really are. The brightest green leaves, beautiful flowers and blue skies could never be recorded by this camera.Moreover, the optical system is not adjust precisely, the pictures you take are always shifted from what you have seen in the eye viewer.I don't recommend this camera, I will try Cannon next time.", "Date": "July 16, 2002"}, {"Title": "Good camera, easy to use, works well with Mac OS X", "Author": "duenasd", "ReviewID": "RKRSNNCWUF8UY", "Overall": "4.0", "Content": "After doing some research on various cameras, we decided on this model as our entry into the digital camera arena. Price was very good for the features you get. We didn't install the included software yet the camera works without any problems with iPhoto and Mac OS X. Buy the 128MB smart media card so you don't have to worry about running out of space.", "Date": "May 3, 2002"}, {"Title": "Easy to Use, Bad Flash Spring Loaded", "Author": "Piperkr \"piperkr\"", "ReviewID": "R32W8036IR8FX9", "Overall": "4.0", "Content": "I bought this camera on Saturday and it loaded right up to my computer. It acts just like a smartmedia card reader and it easily transfers files to my computer. The pictures are also very nice. However, six days later I already need a replacement camera as the spring flash is falling off the camera. This flash is not very sturdy (typical plastic parts) and seemed like a poor idea the first time I saw it. This is my only complaint so far, maybe it was a flaw in mine's craftsmanship. Since getting a new camera, it has been flawless. I love it!", "Date": "March 8, 2002"}, {"Title": "Excellent and easy to use.", "Author": "Gonzalo Hillerns Blanco \"Ghillerns\"", "ReviewID": "R3UMSZC5CTP9I6", "Overall": "5.0", "Content": "It's an excellent camera for the price. Only three bad things:No camera bag.No rechargeable Batteries.Small Smartmedia Card....I'm very happy with my camera.", "Date": "March 4, 2002"}, {"Title": "Incorrect Directions!", "Author": null, "ReviewID": "R2Q6YUIWVBF2JT", "Overall": "3.0", "Content": "This is my first digital camera and I wanted something simple since I'm only partially computer literate.  The lengthy instruction book got me through the basics of taking the pictures...until I got to the Transferring to Your Computer part.  After a frustrating hour or so, I finally called Technical Support.  \"Oh...the instructions in the booklet are totally incorrect.\"  Gee...thanks for letting me know.", "Date": "July 16, 2001"}, {"Title": "The green of nature is missing from the pictures.", "Author": null, "ReviewID": "R2H5SG9R19KQDH", "Overall": "3.0", "Content": "This camera is good overall except 2 major issues I discovered.  First, the colors of outdoor shots were not accurate most of the time, specially the trees and grasses never looked as green in the pictures as in real world. I believe this is a major defect. (Another reviewer also mentioned the same problem.) Second problem is the long shutter delay. You will not be able to catch the best moments in life.I will not buy another Olympus digital camera unless I am convinced they fixed such defects.", "Date": "May 29, 2003"}, {"Title": "Don't be fooled", "Author": null, "ReviewID": "R3P0F5GB1I27TD", "Overall": "2.0", "Content": "Olympus has replaced their D-490 camera with a piece of ... plastic.  They have improved a couple features with the D-510 such as a USB Port instead of a serial port and higher manification, but guess what?  They cause more problems than they are worth.  If you have an older computer that doesn't have a USB Port your ....  You have to buy a Smart Media/Floppy converter which isn't nearly as convenient as a direct connection to load your pictures on your computer.  The telephoto on the D-510 has more magnification than the D-490 but the camera turns off if you try to Zoom out in telephoto mode before taking the picture.  What the ... is that all about?Oh yeah, getting back to my first point.  This camera is made out of a very cheap plastic.  The D-490 (the older model) feels and looks superior to the D-510.  Try to get the D-490 if you can unless having a USB rather than a serial connection is a big deal to you.  The worst part is that I actually paid more for the D-510 even though it's retail price is ...less than the D-490!", "Date": "July 3, 2001"}, {"Title": "Not really worth the trouble", "Author": "Stephen", "ReviewID": "R12IDVQ66GGN9I", "Overall": "2.0", "Content": "Camera seems fine, but mine came with an unformatted media card that has pretty much rendered it unusable.  Not worth the trouble of a new reader or a replacement card.", "Date": "January 8, 2014"}, {"Title": "Versatile Camera", "Author": null, "ReviewID": "R10BQYHLU99MRL", "Overall": "4.0", "Content": "I've used mine for two years so far and gotten alot of mileage out of it.  What I really love is that it doesn't require special software to download pictures.  When we go to visit, we can just plug in the camera with the USB cable, treat it as a removable disc, and transfer our pictures to our hosts computer before we leave.  One downside is that the viewfinder doesn't quite frame the picture accurately.  For close-ups, I have to turn on the LED screen or I cut off half of the face...", "Date": "February 6, 2004"}, {"Title": "Excellent Buy", "Author": null, "ReviewID": "R1K3WKUDM6ZTXF", "Overall": "5.0", "Content": "I bought this camera at a local store for a close out price and this camera has given great pic's ever since.They give you a 8mb card which is a start but you'll soon want to up grade to a 128mb.If your thinking of a starter camera at a great price .Check out this one I know you'll enjoy it.", "Date": "December 15, 2002"}, {"Title": "I love this camera", "Author": "Benjamin Fry", "ReviewID": "R11V9H3OKPHBQ6", "Overall": "5.0", "Content": "So far I love this camera.The pictures are crisp, the design is nice, and the interface is the easiest to use and least cluttered I have ever seen in a digital camera. The included software is also very good and with a free 64Meg card (on mail in) you cannot beat the price! Be warned though- the batteries do drain amazingly fast (as with most digital cameras).", "Date": "December 22, 2001"}, {"Title": "Excellent camera", "Author": null, "ReviewID": "R15V0A2G8Y5ICC", "Overall": "5.0", "Content": "If you want point and shoot or you want to fool around with the settings, this camera is excellent. I did a lot of research on what to buy and am very happy with the 510-Z. Print quality is excellent and the accompanying software is easy to use.", "Date": "October 18, 2001"}, {"Title": "Solid camera, great value!", "Author": "tim747", "ReviewID": "R1OYNR67A3D79O", "Overall": "4.0", "Content": "I have had my D-510 for over 2 months now and am happy with my purchase.  I initially spent a couple weeks reading reviews all over the web on different 2 and 3 mega pixel digital cameras.  Bottom line is that I would recommend this camera to anyone that is just starting out with a digital camera and wants to have a powerful camera that is a great value.Pros1.  3x zoom (You should get at LEAST a 3x optical zoom, digital zoom does not matter because you can do the same thing in software later)2.  Retractable lens.I really like the fact that the entire lens retracts into the camera and gets covered so there is no danger of it being scratched.  Some people might not like the fact that when you open the lens protector to turn on the camera for picture taking, the flash will come out and you have to wait a few seconds for the lens to come out.  I got used to this and did not find it very bothersome.3.  Small size - it fits in the pockets for easy carrying around.  Nice compact package when the lens is retracted.4.  Crisp and colorful pictures.  The 4 x 6 prints I made turned out very nicely.  I couldn't even tell the difference from pictures that came out of a regular camera.  If you need bigger pictures often though, a more expensive 3 or 4 mega pixel camera would probably be bigger.5.  Fast USB connection, in my opinion you do not need to get a separate digital film reader.6.  Output pictures to TV, cables comes included.7.  Can fit over 200 pictures on a 128MB card.  It uses 3.3V Smart Media.  Don't buy the wrong stuff!  Viking works great.Cons:1.  Only comes with a 8MB card.  You need to buy Olympus Smart Media if you want to use panoramic mode.  You can just buy a new card of a cheaper brand and use the one that comes with the camera for panorama pics, which is what I do.2.  Software could be more robust, it works though.3.  Batteries, you need to get lithium ion batteries.  If you do not have a set and charger already, you should get the 510 package to save money.  Batteries will last a pretty long time if you do not leave the LCD monitor on and use flash all the time.", "Date": "October 9, 2001"}, {"Title": "Loyal customer: disappointed", "Author": null, "ReviewID": "R10S33ZTBEWR6F", "Overall": "3.0", "Content": "I own several Olympus digital cameras, and am extremely happy with them.  I recommend them to everyone.  I own several versions of the D4xx line, the D620 SLR, the 2500 rangefinder, and the E-10.  I have 5 or 6 Olympus digital cameras in total. I recently purchased the D510 because I wanted something slightly smaller, and with USB connectivity.I've been somewhat disappointed with the usability of this camera.  I miss the top LCD panel which was removed; the front lens door is difficult to open; and the spring loaded flash which always pops up and requires manual closing is annoying.I have only used this for a few hours, but I'm a little disappointed.  It feels like the camera was designed for production cost savings and not an increase in usability.I'll post another review if my experience changes after some more use, but at this point, my recommendation would be to pick up the D490 over the D510 unless you really need the USB connectivity.", "Date": "July 24, 2001"}, {"Title": "pictures are fantastic but.....", "Author": "ELAINE", "ReviewID": "R3MA66TYMH7X3", "Overall": "4.0", "Content": "the instructions are terrible. They must think Im some kind of expert to figure this out.  I still might send the camera back.", "Date": "February 13, 2002"}, {"Title": "Best buy for the price", "Author": null, "ReviewID": "R2DISYM7U8W2ZM", "Overall": "5.0", "Content": "(...)I think D510zoom is best buy digicam for the price.You must read the reference maual located in CDROM thoroughly for best pictures.", "Date": "November 17, 2001"}, {"Title": "A Real Battery Hog", "Author": null, "ReviewID": "R313AMTEPCUIDK", "Overall": "4.0", "Content": "This camera has served me well and takes beautiful pictures. However I spend so much on batteries. Have tried regular, heavy duty, and alkaline and none last. If I don't take batteries out after each use, they won't last overnight. If one buys this superb camera he might want to use an adapter rather than rely on batteries (unless he has won the lottery).", "Date": "January 16, 2004"}, {"Title": "Good pictures and easy to use", "Author": null, "ReviewID": "RXK39MEZI01CQ", "Overall": "4.0", "Content": "Easy to use and great pictures.  However, every time I downloaded files to my pc the camera crashed my home network.  I therefore use a card reader / writer to move files onto my pc now.", "Date": "January 8, 2002"}, {"Title": "Don't be fooled", "Author": null, "ReviewID": "R39ZIZLKH5BN84", "Overall": "2.0", "Content": "Olympus calls this camera a 3x zoom plus 3x digital zoom (9x total).  Don't be fooled.  The 3x zoom is really a 1x zoom.  I don't know how they get away with this.  Total zoom is 3x using the digital zoom which distorts the photo.  I bought this model only because of the zoom and it is pretty useless.  You also must turn the digital zoom on again every time you turn the power back on.  The camera shuts off power on it's own very frequently.", "Date": "July 11, 2001"}, {"Title": "Olympus D-510 review", "Author": null, "ReviewID": "R2PGLAZYDGXYJK", "Overall": "1.0", "Content": "I purchased the D-510 for Christmas and I was very disappointed with the camera write out of the box. It has unfriendly menu commands on the camera, even deleting a picture is not easy. The most frustrating was trying to down load the images to the computer. The Camedia software does not reconize the camera. I spent 6 hours over a period of two days and drained the new batteries in the camera getting the pictures down loaded. I still have to hunt to find the file the pictures are in the USB drive, it's not stright forward operation at all. If you don't use the camera regularly and forget the procedures you will be frustrated too. The picture quality is fine but not worth the trouble.", "Date": "March 21, 2002"}, {"Title": "Hard to huck-up to PC", "Author": "Harlan Finch", "ReviewID": "R2K7EILQYL12WB", "Overall": "3.0", "Content": "I have not got this D-510 too work on my PC, PC will take the USBport from the Camera at all.", "Date": "February 22, 2002"}, {"Title": "DOA", "Author": "\"gcreese\"", "ReviewID": "RU7XQ73SU5AMT", "Overall": "1.0", "Content": "I bought the D-510 because I had an Olympus film camera for a number of years and loved it -- great lens and the camera was small enough to take anywhere.Therefore, it was a great disappointment to find out that the camera I bought has the picture-taking functionality of a brick.  The diopter adjustment never sharpens the focus of the optical viewfinder; the zoom lens doesn't zoom; and no picture is displayed in the LCD viewfinder....", "Date": "June 27, 2001"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00005B6TI"}}