{"Reviews": [{"Title": "The Ultimate Semi-Pro or Serious Amateur DSLR", "Author": "Brendan Getchel", "ReviewID": "RGOLD882H4CWR", "Overall": "5.0", "Content": "I'm not a professional photographer. I don't make a living off of my pictures. Most pros I've seen would opt for the much more expensive D1x or Canon EOS-1D as their primary DSLR, but wouldn't hesitate to have a D100 in their bag as a backup. If you're a very serious amateur or have professional aspirations, look no further than Nikon's new D100. At 6.1 MP, it can easily compete with standard 35mm film cameras up to 8x10 prints and beyond. Most people in this market will be wrestling between the D100 and the Canon D60. I'm not wed to Nikon, so the deciding factor in my selection was availability, price, and overall feel. The D100 just felt better and more substantial--with better switchgear--than the Canon. In most head-to-head reviews they usually come out in a draw, leaving it up to you to decide. They each possess strengths and weaknesses that the other doesn't, which balance the reviews without a clear nod to one over the other. Generally, most reviews tend to favor the sharpness of the Canon for still or studio work and the Nikon for outdoor or action work. The easiest decision will be whether you're fortunate enough to already have an existing lens collection. If you do, then the decision has already been made. If not, you can't go wrong getting the D100. There simply isn't enough room for a detailed review of the D100 in an Amazon blurb, but you'd be well advised to check out sites like DPreview.com (especially) and a myriad of others like StevesDigicams.com, etc. I would recommend getting the MB-D100 multifunction battery grip too. It adds another battery and the ability to use six (6) AA's in a pinch, plus it gives you a vertical grip, shutter release, and duplicate controls when in portrait mode, as well as a mini microphone and speaker that allow you to record voice remarks for each photo if you desire.Naturally, the D100's image quality is astounding. Mated with quality lenses and proper technique you are left with no excuse for not producing the best photos you've ever taken. Friends and onlookers will drool with envy where ever you go, because you just can't hide a D100 with an MB-D100 grip and a fast AF 80-200mm f/2.8 ED IF zoom in your shirt pocket--forget about candids.It's big, it's heavy, and it's all Nikon--and everyone will know that you're serious about your picture taking.", "Date": "September 19, 2002"}, {"Title": "Nikon D100 - The best camera I have ever used", "Author": "David C. Seeholzer", "ReviewID": "R2HUOGNMHXPAK6", "Overall": "5.0", "Content": "I have been buying various digital cameras for the past 4 years, starting with the 2 megapixel Olympus C-2020, then trading up to the C-3030 and eventually the 3 mp C-4040.  Although these cameras take wonderful photos and are a great form factor for travelling, etc, they all suffered from one significant shortcoming:  shutter lag.  So, I was inspired to pay the higher price for a digital SLR.I now have the Nikon D100 with a variety of lenses and I can enthusiastically say that it is the best camera I have ever used -- digital or film.  In program mode, it is nearly impossible to take a bad photo with it.  It does an amazing job of focusing - fast and accurately. (In order to get full autofocus capabilities, you can use any Nikon \"D\" or \"G\" type lenses)  And it feels and works just like a film SLR camera.  No shutter lag at all.Also, the user interface is sensible and easy to use.  This is especially important for this camera since there are so many customizable features.My only disappointment with this camera is that in order to get the 10-pin connector (which allows the use of remote controls, for example), you have to pay (Money) for the battery pack.  That is a lot of money to spend and a lot of size and weight to add to the camera in order to get access to a tiny but useful connector.This camera and the Canon D60 seem to be the begining of a whole wave of amazing digital SLRs, as I see that Kodak, Canon and others have new ones coming out with even higher resolutions.  But I think that my D100 will keep me happy for several years.", "Date": "October 18, 2002"}, {"Title": "Awesome.  This camera heralds the death of film.", "Author": "Roger J. Buffington", "ReviewID": "RWJGQCA2R9AQU", "Overall": "5.0", "Content": "This is an awesome digital picture-taking machine, which heralds the imminent death of 35 mm film.  The D-100 does pretty much everything that a high-end film SLR does, and it does it beautifully.  A 512MB CF card will enable the D100 to take hundreds of high-quality pictures that are indistinguishable in quality from those taken with film.  The Six-megapixel images in Large/Fine or RAW mode are quite competitive with their film counterparts for almost all purposes.  The advantage of digital, of course, is that the consumer, equipped with pretty much any computer, can process and print the pictures him or her self with far more power and flexibility than one had in a darkroom processing film.  The digital darkroom has arrived.The D100 can use Nikon's entire line of autofocus lenses and many of the older manual focus lenses, allowing the photographer to easily migrate from film to digital.  The camera has spot, matrix, and center-weighted exposure options, a programmed mode, apature priority or speed priority, as well as all of the manual options.  Autofocus is crisp, fast, and works very well in low light.  This camera is nearly as powerful in terms of its focusing and exposure options as the Nikon F5, which is the film camera I used for years before replacing my F5 with the D100.Perhaps the greatest testimonial for the D100 is that it is notorious that the vast majority of photographers who I know who have bought a D100 never (or at least rarely) shoot film ever again.The D100 takes OK shots right out of the camera, but to get best results most photographers will want to \"process\" the pictures through either Nikon's own program \"Capture 3\" or an aftermarket program like Adobe Photoshop or Photoshop Elements.  I and probably most others have found that some of the post-processing settings on these programs really improve the images produced by the D100.  This is a deliberate design \"feature\" of the D100 in that the D100 anticipates that serious photographers wish to retain a certain amount of control over their images.  Accordingly, rather than making all of the decisions for you, the D100 produces images for which final exposure and contrast decisions can and should be made in a post-processing program such as Adobe Photoshop Elements or Capture 3.  That having been said, the D100 can and does produce fine images without using a post-processing program.  But almost all users have probably found that the best results are achieved by using such a program.  In my opinion this is true of pretty much all of the high-end digital cameras out there, and is not confined to the D100.  This is the power of digital photography--the photographer, at little cost (a low-end PC and $100-200 program are all that are required) can have a powerful \"digital darkroom\" which yields tremendous control over how the images turn out.Physically, the D100 is ruggedly built.  The rear LCD is bright and clear.  The menu systems on the D100 are very well designed and quite intuitive--after familiarizing myself with the manual for several hours, I now find that I do not need to refer to the manual at all even for very complex \"custom\" situations.  The menus are not overly \"layered\" as is the case with some digital cameras.  The on-board flash is fine for snapshot portraits and the like, but most serious users will want to spring for either the SB-50DX or the SB-80DX flash, both of which are more or less designed for the D100.Negatives on the camera are few.  I mentioned above the post-processing issue, which in my mind is not a negative, but instead is just Nikon giving the photographer as much power and flexibility as possible.  The matrix metering is not as powerful on the D100 as on the top-of-the-line F5, inasmuch as in tricky lighting situations the D100s center-weighted or spot metering will sometimes yield better results.  Having said that, after several hours of experimenting I can now confidently take consistently good pictures with the D100 in fill-flash conditions.  In common with the exposure issues, the D100 more or less requires photographers who want very \"sharp\" images to apply \"sharpness\" post-processing.  Most of us have probably found that this produces better results than setting the sharpening in-camera, for reasons that exceed the scope of this review.By the way, the battery life in the D100 is phenomenal.  The on-board proprietary Nikon battery lets you take many hundreds of pictures, and serious shooters can buy at modest cost the MD-100 accessory which lets you shoot with either 2 Nikon batteries or a bunch of AAs.  Either way this allows you to literally shoot all weekend likely without needing to recharge.  The Nikon batteries recharge in a bit over an hour.For good reason the D100, retailing now (October 2003) below $1,500, has put powerful digital photography in the hands of serious amateurs.  It is a well-designed and sturdy camera that is a delight to own and use.", "Date": "October 9, 2003"}, {"Title": "Very good ....but", "Author": "Brian", "ReviewID": "R35HNNI5QZSO80", "Overall": "4.0", "Content": "There are plenty of reviews here and elsewhere that extol the virtues of this camera and I have found the quality to be very good. At this stage I don't plan on using film again.But, three issues need to be pointed out to prospective buyers.TTL flash. If you have enjoyed using TTL flash on your nikon film cameras for years and have learned to love it, beware. The D100 does not support TTL flash, only D-TTL. Your trusty macro ring flash or SB26 will not work in TTL mode. Read the owners manual online to check the flash compatability list before you commit. You can use your flash in manual mode and get instant feedback on the lcd monitor, but if your subject has flown and your manual setting was wrong, tough! The strange thing is the the Fuji S2 which uses nikon lenses and flashes can work in TTL flash mode. If flash is very important to you then look at the S2.Another issue to remember is the ccd sensor is smaller than a 35mm frame so there is a 1.5x magnification factor applied to all of your lenses. This is great news for your 300mm f2.8, which becomes 450mm f2.8, wow! In my case it is not so good when my 18-35mm goes to 27-52.5mm. For all you wide angle devotees, 27mm is nothing like 18mm is it? You can now buy a 12-18mm lens especially for nikon digitals but it is not cheap and it won't work on your film cameras.Finally, if you plan on using the bulb setting for exposures of a few minutes, such as for astrophotography, The results may disappoint. There is not only electroluminescence picked up from other on-chip electronics, but the chip appears to heat up with long exposures. If you do 3 x 5 minute exposures with the lens cap on, the noise level increases significantly with each exposure. This makes dark frame subtraction dangerous as you may well loose photographic data. The camera would probably perform better in very low ambient temperatures, but I haven't tried that  so far.Otherwise an excellent camera.", "Date": "October 28, 2003"}, {"Title": "The best buy for Nikon D series", "Author": null, "ReviewID": "R28ROHOCVLIPKY", "Overall": "5.0", "Content": "Stop reading this review and just buy this wonderful camera if you're serious about digital photography.  There are only two REAL digital interchangable SLR to choose from.  Nikon D1H or D100.  If you are not a photojournalist, needing to carry your gear to desert war zone, and extreme environments.  You don't need the ruggedness of D1H, which is based on the F5 body.  If you don't need the insanely large memory buffer of D1H, D100 will satisfy all your need.D100 has higher resolution than both the extremely fast D1H and the higher resolution cousin D1X (but slower), at half their price.  The only thing that's lacking is a smaller memory buffer, hence slower, and a slower flash sync at 1/180.  Unless you're doing a lot of daylight fill-flash, I wouldn't worry about this limitation.Since the D100 is based on the N80, it's comfortable to hold and use.  The user interface is so much better than Canon's.  It's more ergonomic and comfortable than the more expensive Canon too.  Not to mention that Canon's is lacking a playback zoom feature which I find it very important in Digital.  You don't want to download your photo to your notebook computer every dozen  shots to examine the details and sharpness, do you?Of course, it can use all your Nikkor lens.  (That's the main reason I'd never buy Contax, Pentax or Minota's digital camera.  Their lens selection is just too limited.)Just buy it and you'd be happy.", "Date": "December 3, 2002"}, {"Title": "Nikon D100", "Author": null, "ReviewID": "R2FPXTEDFWYDW1", "Overall": "5.0", "Content": "I recently upgraded to the D100 after having used the Coolpix 5700 for six months. The Coolpix was great, but the D100 is greater.  Many of its functions, for instance, can be controlled by turning a dial or pushing a button; many consumer digital cameras require you to menu surf in order to change a simple-yet-important setting, such as metering mode or flash output. Better yet, the external controls are easily accessible. The D100's program mode is incredible; I have yet to take a picture in it and be disappointed by the results. Additionally, I can get 6+ hours of continual use; when I shoot for several minutes a day, the battery can last for weeks before the battery meter indicates a slight drop in battery strength.  The camera excels in other areas, too. Its noise level is extremely low. In fact, in low-light situations, I do not hesitate to use settings of ISO 1250 or 1600, which show noise only if you scrutinize darker areas in the photo. I daresay that the D100's grain in its pictures is lower that that of the grain in equivalent-speed film. Unfortunately, the two highest ISO settings, HI-1 and HI-2, equal to ISO 3200 and 6400, respectively, show appreciable amounts of noise, but are acceptable for situations when you really need for the camera to be fast. The camera's low noise levels let me shoot in near-infrared light (with optional filters), something that can be tricky with digital cameras because they are designed to reject most infrared light (thus requiring a high sensitivity when working in NIR).  I have just one complaint about the D100, and this is very significant if you do indoor action with a flash. The D100's maximum shutter sync speed is 1/180 of a second. This means that with a flash, the D100's maximum shutter speed is 1/180, opening the door for blurring of subjects. I recommend that you not use a flash and take advantage of the superbly-low noise levels at some of the higher ISO settings.  Unless you plan to shoot a lot of indoor action using a flash, I wholeheartedly recommend this camera.", "Date": "August 12, 2003"}, {"Title": "Nikon D100 is a GREAT Digital SLR", "Author": "A Conrad \"Ask Conrad\"", "ReviewID": "R37ZPPTH01J5CE", "Overall": "5.0", "Content": "I call the Nikon D100 the \"VOLVO\" of digital SLR cameras. It is safe and rugged, and once you buy one, you cannot buy any other. I bought the D100 about 3 months ago, and after test-driving it for a few months, I have been very happy with it.Photography has been my hobby for the past 12 years. I am an avid (and loyal) Nikon user, being the owner of the N70, N90, F4, and F5 35mm SLR cameras (yes, I have a thing for Nikon). Therefore, it is almost logical for me to stick with the Nikon brand, and hope that the lenses are interchangeable.I was quite skeptical about the capabilities of digital cameras, and I never thought digital technology will be able to catch up to film resolution for a while. Until now. I have to say that the Nikon D100 convinced me to take the first steps towards the digital revolution.Now, I primarily use the Nikon D100, and use my film cameras as back-up. I've only used my film cameras during rainy days, so that my new toy/investment would not get wet.I've made a brief list of what I noticed about the D100.Pros:-instant on-fast response-nice fit in [my] hand; very ergonomic-superb resolution-default pictures have higher contrast-compatible with Nikon lenses, especially the Nikor F mount lens-LCD monitor cover comes with the camera(Thanks, Nikon!)Cons:-6MP, compared to the 8MP of the Canon (20D and 350D)-moire effects-no firewire connection-does not properly tag JPEG images with correct color profile; have to use Nikon View software to separate images for full Adobe compatibilityOne camera that almost swayed me away was the Canon EOS 20D. I was fortunate to have friends who have these cameras, so I was able to make a head-to-head comparison of the Nikon vs. the Canon, and the pictures and features \"side-by-side.\" The pros and cons of each camera balance each other out, so in the end, it all comes down to personal preference, and what you like or dislike about these cameras.For me, it was because of loyalty* and investment. I saved a few thousand dollars because my lenses (especially the Nikor F mount lens) are compatible with the Nikon D100 (I was informed that they are also compatible with the D70, but that is second-hand information).Conclusion: The Nikon D100 is a great camera, which is cheap enough for the amateur photographer, and advanced enough for the professional photographer.Footnotes:* Loyalty did not come instantly. Like I said earlier, I have been a photographer (and therefore camera enthusiast) for 12 years, and it took me a few years to appreciate a good camera.", "Date": "September 15, 2005"}, {"Title": "The Digital Camera for the Serious Amateur", "Author": "JLP", "ReviewID": "R2E9HEJOI0NTTA", "Overall": "5.0", "Content": "I am a serious amateur and after several years use (and happy ones at that) with a Sony Cybershot, I had outgrown it. I've owned the camera for nearly two weeks now and I am quite pleased with its performance and the quality of the photos. The advantages of this camera are many: interchangable lens, manual controls, camera settings easily changed from a dial and buttons right on the camera body so it is easy and quick, fantastic battery life, no shutter lag (in milli-seconds) and a number of others. It is not as light in weight as the Sony but it feels comfortable in my hands. The LCD screen allows you to review the images afterwards but not before - another reason the battery lasts so long. You will need to buy the lens separately. I purchased the inexpensive but decent for the price Nikkor Zoom 28-85mm G but there are other reviewers who took serious issue with this lens because of its plastic construction and its optics. Thus far my photos have come out very clear though I have not taken photos at every f stop. It has three metering modes matrix, center weighted and spot. You can also adjust exposure compensation. There seems to be a tendency to under expose the photographs which may be related to my technique or optics. In comparison with the Canon, I cannot comment as I have not used that camera. However, I know that Nikon has made high quality cameras both fully mechanical and digital. I would recommend it for serious amateurs who are going take a lot of photos and want the option of manual controls.", "Date": "June 10, 2003"}, {"Title": "A Dream Come True!", "Author": "Keri Jo", "ReviewID": "R3VYW6SG20M8ZF", "Overall": "5.0", "Content": "This camera is the answer to my dreams.  Not only can I see what I'm shooting right away, I can rest assured that I didn't mess up an entire wedding or photo shoot!  The quality of the photos are AWESOME!One of the best things that made me buy this camera is the lenses to my other Nikon AF's fit this one (besides the fact I've been a long time Nikon fan).  I was a little skeptical about the price, but this has me convinced that there is nothing better than this camera.With a 512 MB memory card, I can get over 150 of the finest quality pictures.  I print them out on my hp photosmart 1215 and they are perfect!  Add Photoshop, and we got game!!The battery on this seems to last forever!  I've done 2 photo shoots (with animals!) and played around with it quite a bit, and the battery is still at full level.  Instructions are easy to understand, it's easy to download, and it is just plain SWEET!I've still got a lot to discover with this camera, but so far, it's worth the money!  If you're a serious amature or a pro, this camera is the best.  I'm ready to get rid of the old \"film cameras\" and buy another one!", "Date": "February 28, 2003"}, {"Title": "Camera Good-Nikon Service is terrible", "Author": "david Schwartz", "ReviewID": "R3M7C9VWHRI92P", "Overall": "3.0", "Content": "Obviously from the other reviews the camera is fine. The problem is if you have a problem with it. My auto-focus gave out about a week after the warrant ended. I was charged $775.00 to repair it. Nikon kept it for 38 days. Sent it back and never reapaired the problem.They took it back worked on it for a week- waived the $293.00 charge. Guess what? I am on holsd with the service department as it was sent back with the same problem.Speaking of service forget about ever speaking to a real person unless you have 2-4 hours to kill.never again .", "Date": "July 13, 2004"}, {"Title": "Definetly not a Pro", "Author": null, "ReviewID": "R1C67N9AKC6VGK", "Overall": "5.0", "Content": "I'll be the first to tell you I'm no professional but so far this camera has been amazing.  For the past four years my wife and I have been using the Nikon N60 and it has more than met our needs.  My decision to switch to digital was based on 2 important points.  First, we found 16 undeveloped roles of film around the house.  After realizing it would cost well over a hundred dollars to develop them and I know we won't like at least half the shots, we decided we needed to move to digital.  Now with the D100 I can pick-and-choose exactly which shots I keep, retouch, crop etc then download them to someone like Walmart.com.  For exactly the same price I end up with the exact pictures I want. Up to now I refused to get a digital because the N60 takes such beautiful shots.  Past digital cameras' shutter lag was so bad you'd have to predict where a moving subject is going to be when you hit the button.  What sealed the deal for us is the D100 has no noticable lag, and it uses all the lenses we already had for the N60.The D100 looks and feels just like my old N60 only lighter.  It acts and sounds just like a 35mm SLR, the camera internals are the same except with a sensor in place of the film strip.  In fact a co-worker, and long time digital user, was checking it out and couldn't figure out why it was \"all blurry\" when he looked through the view finder.  He also had a hard time finding the \"zoom button\".I highly recommend this camera.  If you were reluctant to switch to digital because you loved your old SLR then this is definetly the replacement for you.", "Date": "January 23, 2004"}, {"Title": "A F5 Owner", "Author": null, "ReviewID": "R3G7UOJ1L7U6YF", "Overall": "5.0", "Content": "I am a serious SLR hobbyist since 1994. I spent all my college summer work money to buy the Nikon legend F5. But, the fact is that I can never learn all the F5 features or at least has some sort of grip on all the features. Film based SLR could really break your bank if you are not a professional who can earn the money back by photos. I ended up putting my F5 on the shelf most of the time. (but still I like it so much :)) So, it is definitely time for a digital SLR move. I was thinking about switching my gears to Canon as the 10D has quite a lot good reviews. People complaint D100 is just a modified toy from Nikon 80. Well, I spent six months to do my deep research. Nikon D100 is the final choice, and it is the RIGHT choice. All features on the D100 is similar to the F5. I am using it to practice for my F5. 2 X 512 MB cards gives me just enough to handle my one day trip to SeaWorld. The camera has incredible speed for me to capture all the Shamu pictures. 3 frames per second give me plenty of speed. The buffer also seems to handle all my quick shots without slowing me down. Battery life, incredible, I shot more than 500 shots without even close to finish one charge. One thing kind a disappointed me a bit is when you set to use the highest raw resolution. The 17 MB file really gave my compact flash some real test. It took 5 minutes to write all six files (the max it can store in buffer) to the card. AND the worst thing is that if you accidently switch off the camera during the buffer transfer, all the images in buffer will be flushed away without any warning! I am using regular Kingston 512 MB card. I am not sure how well it will perform on those so called high speed card. Therefore, for my case, setting it to FINE mode is the most practical settings. The body works very well with my Nikon 20-35 2.8 and 70-200 2.8 lenes. My old SB-26 flash is not usable on this camera. it doesn't support the new D-TTL feature of D100. Picture quality? Super! Period.", "Date": "October 7, 2003"}, {"Title": "Oh Baby... Where have you been?", "Author": "Anthony Morelli \"Woofbear\"", "ReviewID": "RE26KREGS2E6Q", "Overall": "5.0", "Content": "I've always been an avid Nikon user. And from now on I'm even more than ever!I haven’t been able to put it down since buying it in July, 2004.The picture quality & clarity is amazing, as if you’re actually  there in the photo!I’ve flown front seat in a helicopter this summer and took some great arial photos! \"National Geographic Magazine\" here I come!!!This baby has a lot of great functions!The quick speed of the playback monitor & deletion of unwanted photos are must-have functions! It's nice to have only good photos, rather than over-exposed trash. I’ve been able to take so many photos with this thing, I don’t know what I’ll be doing with my F90X and the rest of my other film cameras. There’s no end to the imagination with the D100. With my F90X, the colors and effects are lost during the development of the film and the printing of the photo. Having the D100, I’ll have less worry over my photo’s results.During my partner's 25-day business trip, he only shot about 362 photos out of 598 & only recharged the battery once. Spares come in handy, that's for sure! I have a 20-35mm. f/2.8D Zoom lens. I used that baby left and right with the F90X and it seems to be the perfect lens for the D100 (FYI…this lens is discontinued and has been replaced by a 17-35 f/2.8D).Our D100 is loaded with a 1Gb memory card that gives me 598 frames configured as jpeg normal, large (3,008 X 2,000) Pixels.Battery life is excellent. We don’t have to change the battery all that much, and when we do, it recharges quite promptly. If you don’t play with the monitor frequently you should be able to take about 1600 shots on 1 battery.Obviously, frequent use of the Monitor takes up a lot of battery juice. I try not to use the monitor much because of just that. Owning this Baby is fantastic, because it’s saving us a bundle of money on film & reprints.If our friends ask for a copy of a photo/s, we just email them out and it’s done! No more waiting on Friday afternoons at the photo lab!Some Good Technical Points about the D100:- Dynamic-Area AF (Auto Focus): Useful when you have an erratically moving subject. The focus will readjust itself.- You can adjust the ISO sensitivity from 200 to 1600 and HI-1 and HI-2.  Trust me, it works great with proper use!- White Balance: (the color of light reflected from any object). The white balance makes sure that whites are whites in any given situation instead of coming out a shade of gray.- AF-Assist Eliminator: It helps the camera Auto-focus on a poorly lit subject by sending a beam of light on the subject to help the focussing process.- Memory Buffer: is extremely quick for fast, consecutive shots.- Comfortable to hold in right hand- Fairly Light, depending on the lens used- You can input comments on the monitor, with the keyboard area, to the comment area and attach it to your picture.- All Nikkor lenses are compatible with the D100, depending on the nature of the lens. Some minor adjustments or compensations or different settings may need to occur. (out of focus or manual lens, AF-S, AF-I Nikkor lenses etc…)- True to life color photosPhoto Manipulation:Each photo, when uploaded to the computer is about 1.5Mb in size.With the use of Photoshop, I usually have to make only minor adjustments to the levels, depending on what needs to be enhanced. With the D100, I’ve tried taking photos indoors without the flash, but it doesn’t guarantee clarity unless you crank up the ISO sensitivity, and use the noise reducer. You may find yourself needing to use the flash indoors, more often, because it will most likely result in a blurred or distorted photo. With the D100, I'm able to capture indoor images I've only dreamt of, and didn't need to use slow speeds and a tripod.Our first Nikon was the F1 standard model with a Photomic Head, in 1969. I've had many disappointments with my non-digital Nikon models because of multiple visits to the repairman, resulting in the carbon track in the Photometer being worn out & couldn't be replaced. That would explain why all my photos were always over-exposed. I’ve always had wrong readings.My partner’s decision to switch to digital was one of his greatest purchases within the past year, among other things! I suggest you invest in this camera because you won’t be sorry!", "Date": "August 23, 2004"}, {"Title": "Fantastic Camera", "Author": "Diego F. Mera \"Diego\"", "ReviewID": "R1KDFHTAK0AASV", "Overall": "5.0", "Content": "I read many reviews before finally deciding to spend this much money for a camera - and I am so glad I did.  Proof is in the pictures processed and they are beautiful.  All of the important buttons are on the outside and easily reachable.  Autofocus is fast and accurate.  Battery life is long and camera is easy to use and learn.Lag time with pictures was always a problem with the other cameras I had used, but with this camera that is a thing of the past.  I really haven't found anything bad complain about with this camera.  A great buy.", "Date": "March 5, 2003"}, {"Title": "Better than Film SLR!", "Author": "ronwood \"ronwood\"", "ReviewID": "RLKRRU8J5XSS", "Overall": "5.0", "Content": "I was expecting the resolution to be not quite up to film SLR standards, but what a suprise. Maybe custom photolab work could make film shots a higher resolution, though I doubt it. Taking the same shot with film, processing it through standard processing and comparing it to identical exposure, lens etc. with the D100 the digital camera outstripped the film camera in spades. No more film for me. No more trips to the processor, no more film costs, no more waiting. Just shoot and downlaod and manipulate away in the digital environment. I use this camera professionally(ronwood.com) for my work and can not recommend it too highly. Delighted!!!", "Date": "January 11, 2003"}, {"Title": "Wow!!", "Author": "Steven Callaghan", "ReviewID": "R3OOMVOIKWSDJU", "Overall": "5.0", "Content": "I just got back from seven days in Yosemite with my D100 which I bought back in December. I shot 6071 images. I took two batteries. I changed the batteries three times and I only had to recharge twice. I never had any downtime. I bring the images into Photoshop and make one small levels change, one small selective color correction to the neutral colors, and one small unsharpen filter change. I apply the same three changes to every image automatically and the images are perfect. I upload to one of the online photo services and get perfect 5x7s. I only use the small+fine resolution setting since I never need more than 5x7s. The small+fine resolution (1504x1000) is just a little smaller than a 2Meg picture (1600x1200) and has plenty of data for high quality snapshot images. The ISO/ASA sensitivity settings are great. I don't even bother using a flash. When I'm indoors, I set the ISO to 1600 and fire away. If the image comes out too dark, I set the exposure compensation to +1ev all the way up to +4ev. I was able to capture indoor images that I've been trying to get for years, and I didn't need to use slow speeds and a tripod (who'll let you use a tripod indoors anyway these days). I have found that the program mode works really well with lenses that have the 62mm front end. My 28mm lens with the 52mm front end doesn't seem to let enough light in, so the image is a little overexposed, but I fixed that by setting the exposure compenstion to -1ev. It's also important to set the ISO Auto feature to OFF. Great battery life and enought buttons and switches and settings to allow for lots of creativity. I've used Nikons for twenty five years and I've had many disappointing non-Nikon digitals. I'm very, very happy with this one. Sometimes I dream of the D2H, but this is half the price and very lightweight which is important to me when I'm in the field. I'm already thinking of buying a second one so I won't have to change lenses. I bought mine right here at Amazon and I'd do it again.", "Date": "May 16, 2004"}, {"Title": "D100  Shortcomings", "Author": "Cynthia Keith", "ReviewID": "R26XNGIGVTAM0G", "Overall": "5.0", "Content": "The D100 camera is great.  I shoot in raw format.  It has two short comings.  First, your can only take four pictures and then you have to wait for the buffer to become empty.  I wish Nikon had a service to increase the size of the buffer for pictures shot in raw mode.  For every other JPEG mode the buffer is not a problem.  Second, the zoom controls on the rear viewer do not work in raw format.  They work just fine in JPEG.  I really like the camera and have printed hundreds of 13 X 19 pictures on the Epson 2200 printer.  ...just my two cents!", "Date": "December 4, 2003"}, {"Title": "Lots of bang for the buck", "Author": "Damian P. Gadal", "ReviewID": "R20B1JTWAAEHHY", "Overall": "5.0", "Content": "Having had three different digital cameras prior to purchasing the D-100, I was ready to move up to a Digital SLR and get away from annoying shutter lag. After waiting for more than a year, I now have the Nikon D100 and couldn't be happier. I've been putting this camera through its paces and haven't been disappointed yet.  It captures images under most any lighting conditions with stunning results.I have been amazed and very pleased with the batteries.  They seem to last forever, though I'd still recommend carrying an extra one if you shoot as much as I do (an old habit from my previous three digital cameras) - though you'll probably find that you won't be changing the battery very often.Being able to use Nikon D and G lenses is another plus for those who own Nikon equipment and wanting to make the switch to digital - you don't have to invest in lenses all over again - but, keep in mind that there is a 1.5x lens ratio difference that may take a bit to adjust to, but with instant feedback from the camera that shouldn't be a major obstacle.Using this camera, I can tell that Nikon did its homework and put a lot of thought into this product.  The result will be many happy hours of shooting and thousands (if not more) of stunning images!  Be sure to get extra 512mb CF cards!", "Date": "January 18, 2004"}, {"Title": "Excellent Digital SLR", "Author": "6502Lane", "ReviewID": "R2DMQPSLAYX9N8", "Overall": "5.0", "Content": "Now that Nikon and the rest have all moved on with the latest and greatest, this camera has come down in price enough to make it a good buy or at least worth a second look, for the serious amateur.  It also makes a great entry-level pro camera.Though its metal frame makes it heavier than most of its newer siblings, the solid construction of the D100 make it durable in even the most rugged conditions. With the addition of a new VR lens, it becomes an unbeatable digital SLR, especially for the price.  While lacking some of the bells and whistles of the latest Nikon cadillacs, it's a sold performer and still easily competes in the most important category: image quality.  Pictures are sharp and bright and the \"purple\" edging from which so many digicams and digital SLR pictures suffer, is unnoticable without serious magnification.A single caveat here.  As with most digital cameras these days, there are numerous functions accessible by a number of buttons and dials on the body, and even more through menu options.  This is not a camera you can put in the closet for a couple months and expect to easily remember how to use when you pick it up again.As a digital SLR, it does not fall prey to the dreaded shutter lag of digicams, of which the Nikon Coolpix line is the worst offender.  If you're looking to upgrade from a simple point and shoot camera or are advancing in your career as a serious amateur, this unit cannot be recommended highly enough.", "Date": "May 24, 2005"}, {"Title": "Excellent Quality", "Author": "Norman S. Allen", "ReviewID": "R1CJ0ZJ13LZG49", "Overall": "5.0", "Content": "I bought the Nikon D100 a few weeks ago and frankly it was well worth the expenditure. The picture quality is as good as film, if not better, as I found it near on impossible to take a bad picture (unlike film). Its versatility of use with lens adaption gives it several advantages over the standard \"fixed\" digital Cameras. It SLR qualities and excellent focusing make it a leader and a must for enthusiasts, amateurs and professionals alike. With a good tripod its perfect. I can never stop playing with it! I have never taken so many pictures of my German Shepperd!", "Date": "June 29, 2003"}, {"Title": "Excellent camera for the amateur or professional!", "Author": "Samia", "ReviewID": "R3KR1KZ08FTXXK", "Overall": "5.0", "Content": "The Nikon D100 is an excellent digital camera.  I consider myself an advanced amateur and I bought the camera almost two years ago.  I chose the D100 because I was very happy with the Nikon Coolpix 5000 and because of Nikon's reputation.  The 6MP CCD sensor captures images with brilliant color and clarity.  No one can tell that my photos are digital.  I have enlarged photos up to 20x30 inches and it is still impossible to tell the photos are digital.  After purchasing this camera, I hardly ever use my film SLR's.The Nikon D100 was designed based on the Nikon N80.  The D100 has a rugged, well-designed body.  There is a large, bright LCD screen on the rear of the camera.  The LCD is used for reviewing photos and changing settings.  (Most digital SLR's use the LCD similarly.)  The viewfinder must be used for taking photos.  Most of the camera settings may be changed using the controls on the body or scrolling through the LCD.  The camera uses compact flash memory cards which are readily available and is also compatible with microdrives.  I prefer the faster speed 1GB compact flash cards.The D100 comes with a rechargeable battery, battery charger, camera strap, manual, USB cable, AV cable and Nikon View software.  The Nikon View software is used to transfer photos from the camera to the computer and has a few basic photo-editing tools.  I recommend purchasing a compact flash reader for the computer.  Nikon Capture software is also available separately.  Nikon Capture is a powerful photo-editing program made specifically for the Nikon digital SLR's.  Aside from photo-editing, Nikon Capture allows the photographer to connect the D100 to a computer without a compact flash card.  Photos are stored directly onto the computer hard drive.  Other features of the Nikon Capture software include changing camera settings and taking photos without touching the camera.  Everything can be controlled from the computer.  This is convenient for studio photographers.  The battery life is amazing.  I purchased an extra battery and usually charge the batteries after several months.  The AV cable is a nice accessory because it can be used to display photos on the television in a slideshow mode.Photos taken at the fine resolution (6 MP) are very sharp and detailed.  There are three formats for photos - raw, jpeg and tiff.  I have purchased several 1GB faster speed compact flash cards and I usually keep my camera at the large jpeg and fine setting.  I have taken beautiful photographs in the raw setting as well.  The enclosed Nikon View software allows the user to edit the photo without changing the file.  The Nikon Capture software has far more editing tools and functions than Nikon View.  I would recommend using faster speed compact flash cards in the raw setting, otherwise the camera sometimes lags when the buffer is full.  (This only happens if more than six photos in the raw setting using a traditional, slower compact flash card are taken within a few seconds.)  I seldom take photos in the tiff format.  (Tiff is basically an uncompressed jpeg file.)Nikon is famous for both cameras and lenses and has a large variety of lenses and accessories.  After purchasing the D100, I bought a 24-85mm zoom lens, 28-300mm telephoto lens, 60mm macro lens, 1.5x teleconverter and SB-50 external flash unit.  One zoom lens may be sufficient for amateurs.  The three lenses have been more than sufficient for my needs.  (I seldom use the teleconverter.)  I may add a wide angle lens to my collection.  When purchasing lenses for the D100 (or most other digital SLR's with CCD sensors), it is important to note that there is a 1.5x conversion factor (i.e., a 24-85mm lens becomes a 36-127.5mm lens).  The conversion factor is great for distant subjects but may be inconvenient for close subjects.  Nikon has released a series of DX lenses specifically to address this issue.Other items that I bought after purchasing the D100, include the Canon i9100 photo printer and Adobe Photoshop.  I used Photoshop LE before purchasing the D100 and decided to upgrade to the full version of Photoshop after my purchase.  I use Photoshop for almost all my photo-editing.  I only use Nikon View for photos in the raw format.  Most of the time, I edit the raw photos as needed in Nikon View and then convert the raw photos into jpeg.  The newer version of Photoshop CS is able to read the Nikon raw format.  Adobe Photoshop Elements may be sufficient for most amateurs but Photoshop is more powerful and fun to use.  The Canon i9100 prints stunning photos but it can be expensive to print photos at home.  The ink cartridges and photo paper can become expensive over time.  I print at home when I need a few sample photographs or I need the photos immediately.  Most of the time, I print my digital photos at Costco One Hour Photo.  The photos are reasonably priced and available within an hour.  Similar photo processing services are now available at drugstores, grocery stores and discount department stores.  It is also convenient for photographers who do not want to deal with the entire photo-editing and processing situation.I recommend the Nikon D100 for advanced amateurs and professionals.  The camera takes beautiful photos and is definitely a good investment.  I learned a lot about digital photography and photography in general after purchasing this camera.  I love this camera so much that I will probably never use film again.", "Date": "February 24, 2005"}, {"Title": "ABSOLUTELY WORTH MAKING THE JUMP TO DIGITAL SLR", "Author": "David Bailey \"www.DavidBailey.com\"", "ReviewID": "R26KU6ELKIG4B8", "Overall": "5.0", "Content": "I've been using digital for several years and a Nikon film SLR and this is the best combination of both.  There is a short learning curve to learn how to make adjustments, but once you learn its a breeze.  From fully automatic shooting to manipulating every aspect of shooting this camera performs like a Ferrari. The quality in .jpg is absolutely amazing.  With this camera and Photoshop you will have print quality photos immediately.  I'm only using a 512mb cf card and it holds up to 150 high quality images. I do a little freelance once in a while and I will be using 100% digital from now on.  Unless you're doing full page magazine spreads or large blow ups, no need to spend the extra money for the higher end digital SLR's.  This is a winner all the way around.  [...]", "Date": "January 29, 2004"}, {"Title": "D100 PRODUCES INCREDIBLE DETAIL IN PHOTOS", "Author": null, "ReviewID": "R1P6ME6AYLQ5GJ", "Overall": "5.0", "Content": "I don't know why the reviewer says that this camera is not professional because he can't use it in broadcast tv, etc.  You should always make sure you're getting the right camera for a given purpose.  Plus, I have both the D1X, and this D100.  I use the D100 as back-up and as a first line camera from time to time.  I find that the images produced by each camera have superb detail and contrast; and I find that using the same lens, side by side photos taken by both, make it difficult to determine which camera they came from.  Being 100% candid, the D1X does produce some of the best images I've seen, but the D100 is no slouch and I dare you to find noticeable noise, unlike smaller cameras with a lot of megapixels.  If you like to take pictures of Uncle Charley's wedding, or a photo to enter a contest, or even to manipulate with one of the photo editors, I believe you'll find the D100 an incredible bargain.", "Date": "September 23, 2003"}, {"Title": "Digital Camera that's worth the price", "Author": "Peter C. Krieger", "ReviewID": "R3FLYZHHB8CD4S", "Overall": "5.0", "Content": "I have only had this baby for 2 days, but it has been a workhorse, as I have gone through hundreds of images in that time.It has miniscule boot time; take the lens cap off, switch to the ON position; take photo > super quick.I bought it w/ the AF-Nikkor 28-105mm F3.5-4.5D lens, and a 1GB 32x Lexarmedia CF card.  Works fine so far; I will be adding lenses and accessories as time goes on.Nikon has produced a real winner.", "Date": "September 1, 2003"}, {"Title": "Nikon D100 is a GREAT BUY!", "Author": "Professor \"N.B.\"", "ReviewID": "RSC8TXZCA3PJR", "Overall": "5.0", "Content": "I call the Nikon D100 the \"VOLVO\" of digital SLR cameras.  It is safe and rugged, and once you buy one, you cannot buy any other.  I bought the D100 about 3 months ago, and after test-driving it for a few months, I have been very happy with it.Photography has been my hobby for the past 12 years.  I am an avid (and loyal) Nikon user, being the owner of the N70, N90, F4, and F5 35mm SLR cameras (yes, I have a thing for Nikon).  Therefore, it is almost logical for me to stick with the Nikon brand, and hope that the lenses are interchangeable.I was quite skeptical about the capabilities of digital cameras, and I never thought digital technology will be able to catch up to film resolution for a while.  Until now.  I have to say that the Nikon D100 convinced me to take the first steps towards the digital revolution.Now, I primarily use the Nikon D100, and use my film cameras as back-up.  I've only used my film cameras during rainy days, so that my new toy/investment would not get wet.I've made a brief list of what I noticed about the D100.Pros:-instant on-fast response-nice fit in [my] hand; very ergonomic-superb resolution-default pictures have higher contrast-compatible with Nikon lenses, especially the Nikor F mount lens-LCD monitor cover comes with the camera(Thanks, Nikon!)Cons:-6MP, compared to the 8MP of the Canon (20D and 350D)-moire effects-no firewire connection-does not properly tag JPEG images with correct color profile; have to use Nikon View software to separate images for full Adobe compatibilityOne camera that almost swayed me away was the Canon EOS 20D.  I was fortunate to have friends who have these cameras, so I was able to make a head-to-head comparison of the Nikon vs. the Canon, and the pictures and features \"side-by-side.\"  The pros and cons of each camera balance each other out, so in the end, it all comes down to personal preference, and what you like or dislike about these cameras.For me, it was because of loyalty* and investment.  I saved a few thousand dollars because my lenses (especially the Nikor F mount lens) are compatible with the Nikon D100 (I was informed that they are also compatible with the D70, but that is second-hand information).Conclusion:  The Nikon D100 is a great camera, which is cheap enough for the amateur photographer, and advanced enough for the professional photographer.Footnotes:* Loyalty did not come instantly.  Like I said earlier, I have been a photographer (and therefore camera enthusiast) for 12 years, and it took me a few years to appreciate a good camera.", "Date": "April 13, 2005"}, {"Title": "D-lighted (sorry,  I'm in love)", "Author": "Mark S", "ReviewID": "R3I2PWSYFNEU5J", "Overall": "5.0", "Content": "I just got the camera 3 days ago and did my first headshots today.  Awsome!  Great camera. Happy client.  Fast work flow.  I was torn between the Canon D60 and the Nikon.  And to be honest went with Nikon because it was the one that was available for my shoot -- But no regrets.  Great camera.", "Date": "September 20, 2002"}, {"Title": "My second digital platform", "Author": "Wiley1", "ReviewID": "R16Q8678C74R9M", "Overall": "5.0", "Content": "As a serious amateur (means limited budget), the D100 was chosen for several reasons. 1. It would take all my Nikon lenses and resembled the layout and feel of my F80 (N80). 2. It is compatible with my SB28DX flash and has a cable release on the shutter button. 3. It has been out long enough (post Nikon D70) to have come down in price, and many are available second hand. 4. It has USB for down loading, and produces excellent 8 by 10's on my inexpensive ink jet printer. 5. The Nikon Viewer software is very user friendly, and links to Adobe Photoshop. 6. It produces RAW (NEF) files (nearly 10Mb!) and they make fabulous 11 by 17's at the commmercial labs. 7. Yes, it is heavier than my Sony DSCV1, but it is worth it. All in all I am very satisfied: compared to film...instant gratification!", "Date": "November 9, 2004"}, {"Title": "An oldy but a goody", "Author": "Loretta", "ReviewID": "R2JG5B970OP1LL", "Overall": "4.0", "Content": "i just recently bought this camera off of amazon and i got it for $175. The price couldnt be better in my opinion. Overall, for the amount of money that i spent on it, it was a deal but there are some problems. Personally i feel that the shutter lag time is too great. Regardless of shutter speed, there is about a half second delay between when the button is pressed and when the camera acutally takes the picture. Other than that it is a great camera with tons of features. I also would have liked the screen to be bigger but what can you do when it was made in 2002. I give it two thumbs up for its time.", "Date": "April 4, 2009"}, {"Title": "Go Digital and Never Look Back", "Author": "B. Merritt \"filmreviewstew.com\"", "ReviewID": "R18L8WL31NOMNG", "Overall": "5.0", "Content": "My girlfriend purchased this camera for me for my birthday about 2 years ago, and I fell in love with it immediately. I'd already owned a Nikon 8008 film camera and was thinking of going digital anyway. But I'd recently spent a lot of money on new camera lenses for my SLR and didn't want to just lose out on the funds I'd expended. Amazingly, the Nikon D100 adapts my lenses to its frame and I can still use them! Awesome!I would argue, though, that this camera is compact. It isn't. It's just as large as my 8008, but I don't mind that. I like the feel of a bulky camera in my hands. It feels firm and I have something substantial to hang onto. I've see these tiny little digitals that have buttons the size of pinheads on them and they drive me crazy! I'm a big guy (6'3, 250 pounds), so I need something bigger. Thankfully the D100 was (is) the answer.I also enjoy the large view screen on the back of the camera, giving me a peek at the image I just took.There is some controversy still surrounding digital imaging and printing. One group of photographers say that printing on a home printer is too expensive (ink and paper costs), while another group says that film is too expensive because you can't delete what you shoot, can't pick and choose which images to have developed; you've gotta pay for them all. I'm in the latter group. Although photo paper and ink cartridges are expensive, being able to delete images and select only the very best for printing far surpasses the film option in both convenience and cost.This is a fantastic camera. But a friend of mine just purchased the D70 model (the latest and greatest Nikon Digital Camera), and boy does that one look nice, too! Hmm. What to do?", "Date": "May 22, 2005"}, {"Title": "One Great SLR", "Author": "Fussy Old Man", "ReviewID": "R1WAM7NXNILJF1", "Overall": "4.0", "Content": "I have had my D-100 for six months, having used a Coolpix 5700 for two years, and I am satisfied but not ecstatic. My first 20 shots were underexposed, lacked color depth, and were short on flash. After adjusting the settings through the menu, it came to life. You can control this machine in any way you can imagine, but experienced buffs all know that the lens is the most important ingredient.Your choice of lenses, being aware of the 1.5 correction factor--which Nikon Tech Serv says applies to all DX Lenses also--will determine how you use this precision instrument. My old Nikon lenses worked well for a few months, but my 35-70 Zoom (53-105 actual)was not adequate, because I had gotten used to the great range of my Coolpix. For me, this meant an 18-35 Zoom (27-53 actual) and a 24-120 Zoom (36-180 actual) The latter has proven to be fantastic, and all but the wild wide angle crowd will be happy with this choice. Indoors and close quarters will favor the 18-35 Zoom, but mine remains boxed.This is no lightweight to haul around, but the photo perfection is worth the effort!", "Date": "July 15, 2004"}, {"Title": "An oldie but a goodie", "Author": "Daniel Taylor", "ReviewID": "R1A1RHLDDHXAD2", "Overall": "4.0", "Content": "I purchased this DSLR for my wife 2 Christmases ago for an extremely low price and although the technology in this camera is dated and not up to par with what the market currently has to offer, As long as you have a basic understanding of photography and you have a clean lens, you can use photoshop or lightroom and create some amazing pictures.  I would not call myself an expert by any means, however as mentioned above with a basic understanding of photography and a basic understanding of what you can and cannot do with this camera, you will be good to go.  The biggest negative that I have above this camera is how dated the LCD screen is but hey back in 2002 I am sure it was epic.  For people who are concerned about not getting a good visual after the shot is taken, take my advise and only SHOOT IN RAW! Do not even waste your time with JPEG.  When you shoot in raw, you have the ability to edit the exposure along with other things later on in your post processing.  If you want to see some of my pictures taken with this camera check out my Flickr:[...]Pros:You can purchase one for an extremely low price now!Although dated, you can still take great picturesCamera body is strong and extremely durableCons:Dated technology in comparison to what is currently available in market.", "Date": "January 28, 2013"}, {"Title": "Don't pickup this camera", "Author": null, "ReviewID": "R3AV5N27Q8WSCC", "Overall": "5.0", "Content": "Unless you want to become obsessed, because that's what happened to me.  There are not enough good things to say about this camera.  I love the many features, the fast start-up, compatibility with my other lenses for my standard Nikon cameras.  It's so easy to use, and takes fabulous pictures.", "Date": "June 7, 2004"}, {"Title": "Good start up camera", "Author": "Antonio", "ReviewID": "R26DM3X6AGD7U5", "Overall": "4.0", "Content": "I really liked using this camera for my start up camera into Photography. Infact i still take this camera for back up purposes along side my D7000. any DSLR is better then a point and shoot camera in my opinion.Pros. easy to learn, good battery life, good qualitycons. Screen is to small you can barely tell if your in focus.  only 6MP so blowing up or cropping can be tricky.doesn't work with some of the new lens or speedlights.If you want to learn about taking good pictures and getting into photography with learning manual settings etc. etc. then this camera is perfect.if your looking for professional results and a camera that will be good for blowing up and cropping consider a better camera like a nikon D7000 in my opinion.Alot of my D100 photos can be seen on www.swiftwaterproductions.com", "Date": "July 2, 2013"}, {"Title": "Having fun", "Author": "Nina", "ReviewID": "R2MOZM1MGSNPHD", "Overall": "5.0", "Content": "Ever since I purchased this camera, I feel that I can now show my full potential as a photographer.The cameras images are sharp and detailed. Changing shutter speeds and the aperture is a piece of cake for adjusting to light.It's not too heavy, but it takes a few days to get used to how the camera functions and the settings.after you get past that, it is a superb device.", "Date": "March 26, 2011"}, {"Title": "nice  camera", "Author": "loren gray", "ReviewID": "R1ZA4XLTEJZHLH", "Overall": "5.0", "Content": "got it  fast,  very happy  with it ,  we  don t  use it as much  as  would  like,  but  over all  very  happy", "Date": "January 18, 2013"}, {"Title": "Camera", "Author": "Grama Beau", "ReviewID": "R3APPNCSRVRSBI", "Overall": "5.0", "Content": "Gave to granddaughter for Christmas-she picked it out - just texted her and she says it's awesome.  Thanks it was nice to be able to trust when you order on line", "Date": "December 25, 2012"}, {"Title": "Wonderful product! Will purchase from again.", "Author": "LisaS", "ReviewID": "RA5D9GDT9635K", "Overall": "5.0", "Content": "Wonderful product received as described. A quality product that I can not wait to learn how to use. Charger and battery included with order that was done and ready to go in no time. Excellent product!", "Date": "August 1, 2012"}, {"Title": "camera", "Author": "April L. Warstler \"pa386\"", "ReviewID": "R34VL6RL278OE9", "Overall": "5.0", "Content": "This is a great product that came in very good condition for being used. Will need to get flash, because otherwise the photos are dark when taken inside, but over all a very nice item.", "Date": "December 25, 2011"}, {"Title": "Awesome.", "Author": "Courtney", "ReviewID": "R2AU97YGHBXLQ3", "Overall": "5.0", "Content": "Love this camera and the seller was right on top of things even hooked me up with an extra battery. I would purchase from him again.", "Date": "November 23, 2010"}, {"Title": "Amazing", "Author": "the febreezer \"laur\"", "ReviewID": "R2XLVRKSCHT3L6", "Overall": "5.0", "Content": "i just got this two days ago. I brought it home and started taking pictures. the quality is amazing the color is great! this is basicly a newer SLR. i LOVE it", "Date": "September 29, 2009"}, {"Title": "Terrific digital SLR for the buck", "Author": "al-taaliba jadeed [the new student]", "ReviewID": "R27G42A3J0J72O", "Overall": "5.0", "Content": "I am so excited to receive my D100!! I used to be simply a point and shoot type of person before I needed training for work and we used this model. I fell in love with photography and especially Nikon with this model! I was amazed at how much clearer, vibrant, and detailed my photographs came out versus my old 3.2 mp Olympus (about 5 years old now). What a difference!! The D100 is also very easy to use...take this from a person who never before changed ISO or meter settings and within a couple of hours I was taking pictures that I think were on par with National Geographic.This is a quality camera, feels sturdy but not too heavy. Lots of great features. I highly recommend Nikon just because they make a quality product with great results. You may pay a little more, but that's why I drive a Bimmer and not a Daewoo. Sometimes spending a little more makes the difference, especially if you're results oriented. =)", "Date": "September 3, 2009"}, {"Title": "The D100 is a great camera", "Author": "Jordan", "ReviewID": "R2NQCMNGPJB5KO", "Overall": "5.0", "Content": "For any amateurs or semi-pro photographers this is a great camera for you. Its quite easy to use and the 6.1 MP comes out with great photos. Its study and durable. The shipper is extremely knowledgeable about the camera, the specs, and what lens' fit and don't fit. The camera came with no scratches and everything clean.The battery life was great and the comfort of it in you're hand feels awesome. I took some amazing pictures with this as i am a photography major at my college. I had a Kodak ezshare and it had 5 MP. The quality is unmatched for 1 MP of image.  I look forward to having this for a long time and purchasing more from the seller.", "Date": "August 26, 2013"}, {"Title": "Amazing!", "Author": "David", "ReviewID": "R2TR8NTL3W0I6S", "Overall": "5.0", "Content": "I have been looking for a starter DSLR and was told some great things about this one. First off the quality is great and secondly, I got it a day before it was even promised to me. Couldn't be happier with them or the camera. I will forever and always be a Nikon guy. MY hunting equipment is all Nikon and now my camera is too. It is just the excellent quality and craftsmanship that keep these guys moving. Thank you very much for the amazing camera. My girlfriend will now be super happy that I can now snap shots with her and of her and our family.", "Date": "June 4, 2013"}, {"Title": "Good product", "Author": "CrysDawn", "ReviewID": "R25BBHOR170APC", "Overall": "5.0", "Content": "I returned this camera, because it did not end up being what I was looking for.  However, it was very nice and will definitely work well for someone willing to invest the time, money and effort into it.", "Date": "December 30, 2011"}, {"Title": "Nice seller and camera", "Author": "Glenn B. Scroggy \"\"Flabird55\"\"", "ReviewID": "RIG0YPIS1NL0P", "Overall": "5.0", "Content": "I bought this camera as a backup. I had one before but sold it to buy something else. The Seller AK was great and easy to do business with. He sold me a camera in near mint condition with lots of extras and he even had the firmwear upgrade done. Thanks AK.", "Date": "June 2, 2009"}, {"Title": "Good Camera, Be Careful", "Author": "T. Werelius \"nullman200\"", "ReviewID": "R1A2REZHDYTEDF", "Overall": "5.0", "Content": "This is a good camera, but it's a little behind the times. The only real complaint is the requirement to purchase a special adapter to use commerical lights etc.The software and features are also a little dated, but it's still a pretty good deal overall, if you cant spend 5 Grand on a camera (The new DX2) it's a good choice.Next year they are supposed to be bringing out updated pro-sumer SLR's but I still think the camera is a great value for your money.[...][...]Good luck, great camera.", "Date": "January 26, 2005"}, {"Title": "A source of more info", "Author": null, "ReviewID": "R2F7S0TEW5NRTC", "Overall": "5.0", "Content": "OK, I haven't bought a D100 - yet. But I'm in the market for a replacement for my ancient Kodax digital, and I've just about decided that the Nikon D100 is going to be it.For one thing, my main non-digital SLR was a Nikon FG and I loved it. I acquired a high end Minolta, but I never liked it as much as the Nikon, and I have several Nikon AF lens and a couple of Tamrons, and I've always sorry that I couldn't use them with digital photography. The new digital camera bodies solve this problem.The suggestion: go to [...] and click the D100 image at the bottom of the page. You'll get a **complete** set of detailed views and specs for the D100, almost a users manual (except it isn't downloadable) in the form of mousable images of all the controls and features. Answers almost any question you might have. (There is a listing of specs that is downloadable).", "Date": "October 9, 2003"}, {"Title": "Good picture quality, light on build quality", "Author": null, "ReviewID": "R4J7LIT5L15QJ", "Overall": "3.0", "Content": "This camera delivers nice pictures most of the time, but it is lightly built, very plasticy.  Image quality:  I find it a bit too noisey for the money, and somewhat lacking in detail.  Not a big enough imporovement over the 5MP Sony F717 to justify the cost difference.  In some instances the Sony is better.  Overall quality:  The F717 seems heavier duty, it is all metal and although the body is smaller, it feels heavier that the D100.  Not a lot, but a nice solid piece of work compared to the plasticy Nikon.  The D100 feels hollow, cheap for an expensive DSLR.  The menu systems are not very intuitive, and sometimes the camera won't take a picture until you get out of them.", "Date": "January 19, 2004"}, {"Title": "Rapidez para cuando la necesites", "Author": "Tony Lindo", "ReviewID": "R3IRDTB1GDEO2M", "Overall": "5.0", "Content": "Definitivamente un verdadera aliada para viajes largo donde necesite matener siempre un cuadro adicional la recomiendo con los ojos cerrados ,sus 6 megapixeles me ofrecen calidad para realizar vallas de carretera de manera excepcional, otro dato compra tarjeta compact flash de 1 gb y veras como no te aburres de tomar fotos todo el dia.... fotograficamente,  Tony Lindo C.", "Date": "November 5, 2002"}, {"Title": "An amateur camera for \"prosumers\"", "Author": "Cecil Fox", "ReviewID": "R3TQ07J4A5ODNW", "Overall": "3.0", "Content": "This is a brilliant amateur camera for what Nikon calls the prosumer market- consumers who fancy themselves professionals on the basis of having taken pictures for cousin George's wedding. When used with Nikon lenses and accessories it performs extremely well and is rugged enough but lacks those features that allow adaptation of the camera body for technical uses, live TV monitoring, bellows use or anything that made the F series wonderful for innovation in imaging. In other words, if you want Nikon to dictate the limitations of your cameras based on marketing concepts this is a swell camera and cheap. On the other hand, do not think of  the D100 as a backup to professional cameras as the Nikkormat was for years. Neither should one depend on the owners manual to be  forthcoming about the camera's  limitations, the telephone help line is hopeless and the best information is on Nikon's UK website.It's strictly prosumer man.", "Date": "August 19, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "Built around a 23.7 x 15.6mm RGB CCD, the D100 captures images with an incredible, film-rivaling 6.1\nPictures are amazingly detailed and color-rich, with resolutions up to 3008 x 2000 pixels\n3D Matrix Metering\n5 Area Dynamic Autofocus with Focus Tracking and Lock-on\nBuilt-in Speedlight featuring D-TTL flash control capability + standard ISO-type hot shoe", "Name": "Nikon D100 6MP Digital SLR Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/51FFN4JK1AL._SX300_.jpg", "ProductID": "B00006JK37"}}