{"Reviews": [{"Title": "Does what it says", "Author": "Peter Bowman", "ReviewID": "RLVJU67ORABKS", "Overall": "5.0", "Content": "The U-60 is a gem. I bought it for water sports and to have a small rugged carry-anywhere digicam (I also have an Olympus C-700 for more technical and telephoto shots). I keep it in my pocket and often get those \"I wish I had a camera right now\" spontaneous shots that I used to miss. It's fast to start, easy to understand, very user friendly, small to carry, and gets decent resolution pics. It goes surfing every time I do. Especially fun and useful is the \"burst mode\" that takes five shots in a row. It addresses that frustration of \"shutter lag\" and \"shutter timing\" that can happen with digital action shots. More info:PROS:Small, cheap, rugged, easy to use, good software, good battery life, decent resolution, well waterproofed, cheap batteries, burst mode, battery-saving lowlight LCD mode, card reader unnecessary.Cons: No viewfinder, tiny LCD, no opt. zoom, burst pics are only 600x400. (although I adjusted to all these shortcomings and didn't miss them!)For it's intended use, it excels.", "Date": "September 19, 2003"}, {"Title": "Perfect for what it is.", "Author": "Adam Z", "ReviewID": "R1XUUJDEHA8SGW", "Overall": "5.0", "Content": "Although the DSC-U60 has almost none of the features one has come to expect on a digital camera, it does what it does flawlessly. What it does is snap simple, hi-resolution photos in any environment without fail.It has no zoom lens. What you see in the viewfiner is what you get, period. You point, you shoot, that's it.It is (or at least mine is) really, truly waterproof. This is an absolutely essential feature for me, and is the raison d'etre of the DSC-U60. If you don't need a waterproof camera, look elsewhere. On the other hand, if you kayak, canoe, fish, or camp, it's really cool to have a camera you don't have to worry about getting wet. I've killed a number of cameras on river trips, and probably lost some great photos as a result. This puppy has been in rivers, lakes, and hot tubs, and hasn't skipped a beat.The lens is great, the electronics are great, and the resolution is superb. Although 5 or 6 MP is becoming standard these days, the DSC-U60 takes extremely sharp, clear photos, good for printing or viewing on-screen.If you need anything more or less than a waterproof point-and-shoot, you will be disappointed. This would be a really poor choice for a general-purpose camera. There are better, sharper, and easier-to-use cameras out there with way more features for much less money.On the other hand, if (like me) you really need an indestructable camera for simple, high-quality snapshots, you couldn't ask for more.", "Date": "June 14, 2005"}, {"Title": "Nice Camera!", "Author": "M. Stocker", "ReviewID": "R3EPBDEAA5Y2EV", "Overall": "4.0", "Content": "I really like this camera. It takes great pictures. It easy to use when out kayaking. It has fallen in the water and been entirely submerged with no problems. It's sporty looking and very easy to use. I highly recommend it.", "Date": "August 26, 2004"}, {"Title": "Excellent Camera!!!", "Author": "Alberto", "ReviewID": "R34E3TX7ZV83YX", "Overall": "5.0", "Content": "I really like the Sony DSCU60 digital camera, it's special to take it to the beach and take pictures under the water. With 2.0 megapixel it's not for pros but the quality its great for point and click cameras. The only con: no audio with video recording but for 150$ I think its ok", "Date": "February 9, 2005"}, {"Title": "More capable than it seems", "Author": "TarikB", "ReviewID": "R3PGFKCXR520LJ", "Overall": "4.0", "Content": "For 2mp cam with no zoom, this little thing takes some nice shots.  I have used it in a party setting, in a heavy shorebreak and out on reef break a short paddle out from the shore.  Has not let me down yet.  This is not suitable for a main digicam, and I don't really see myself getting prints from it but for web, email and general electronic use it's great.Some issues with battery life however, be prepared to get a backup set or two of the rechargable sony bateries. Also as others have mentioned the \"burst\" mode resolution is tiny and the video mode is really only usable as a last resort, and I mean aliens landing/second coming type last resort.  Don't buy it for those modes but still consider it, at $150 it's a bargain.", "Date": "January 5, 2005"}, {"Title": "BEST DIGITAL CAMERA I'VE EVER OWNED", "Author": "Robert Carr \"Activesailor\"", "ReviewID": "R4HB3MN34OOIZ", "Overall": "5.0", "Content": "I have had one for over 10 yrs and saw this one online. I love it for its simplicity and it takes excellent pics! Though no tele-photo or the extras one purchase with other cameras. But if one know how to use software, that is not an issue.", "Date": "November 10, 2011"}, {"Title": "4 years experience with DSCU60", "Author": "C. Scarbro", "ReviewID": "R1H9OCDKHGEOFU", "Overall": "4.0", "Content": "I have had the camera since 2004 and it still works.  I use it like most people for outdoor activities. I don't do anything special to prevent it from getting wet. However, on  my last kayak trip I noticed condensation behind the LCD.  Based on what I have read in the other reviews the end may be near.Its a great design, the one handed shape.  It tucks into a life vest or a ski pocket.  I never put it in a case, its always at hand. It was inexpensive and the pictures can be great.  Its best features in order are, water proof, small size, and easy to deploy.  That puts the camera in play in more situations than a SLR or even most point and shoots.  That makes for some good pictures.The video is a joke and there is no sound.  The lack of a zoom is fine.  Most zooms are pretty anemic. The resolution when you blow it up is lame by today's standards. It eats batteries so carry a bunch of rechargeables and a charger or use lithium disposables (but recycle them!!!)I believe they don't make the camera anymore, but I really would like Sony to update the thing pretty much as is but with a sharper lense (skip the zoom though), more resolution, better water proofing, and better quality of construction. If they could produce it for less than $150 bucks I bet they could sell a bunch of them.", "Date": "October 18, 2007"}, {"Title": "Awsome camera perfoms perfectly never leave home without it", "Author": "kaiser", "ReviewID": "R302Q1AA62PF7Y", "Overall": "5.0", "Content": "I purchased this camera as a cheaper option to any other camera with a $400 marine housing as I dont intend on diving 40 metres the u60 is perfect for my surfing pics and a bit of reef photography. I bought this 7 months ago for $380 and its the best money I've ever spent taking fishing and surfing and everywhere wet the images are crystal clear and I dont see any differnce in image quality between this and my 5 megapixel camera.", "Date": "August 9, 2006"}, {"Title": "loved it until it just stopped working", "Author": null, "ReviewID": "R3756GLO14DRCJ", "Overall": "3.0", "Content": "as a long time film user, this was my first digital cam. I'm fairly active, and since purchased in Aug 03, have taken it sea and whitewater kayaking, into the break, sailing, sledding, skiing, etc. While the resolution wasn't up to what I was used to with even fast film, I took pictures where I just wouldn't have been able to before. I took care of the o ring, and have experienced none of the problems reported by other reports here.All was good w/ it until it just died last month. I'm probably going to check out some other alternatives, and am not even going to bother calling sony or the place where I bought it.Even with that said, the camera's just about paid for itself in the past year.", "Date": "June 29, 2004"}, {"Title": "A decent entry level camera", "Author": "rhicksmtb", "ReviewID": "R3U8MBP3KR9N5C", "Overall": "2.0", "Content": "I like this camera but after a couple of years the screen now shutters and you have to turn it on and off to get it to stop. Life expectancy is a little less than I had hoped for.", "Date": "October 20, 2010"}, {"Title": "The best little camera ever!!!", "Author": "Chris Alexander \"Chris\"", "ReviewID": "RAQ65EX1PB2N", "Overall": "5.0", "Content": "I have had this little camera for about 6 years. Bought it in Puerto Rico at the Post Exchange on impulse. A friend had one and I liked it and when I saw one I grabbed it. Absolutely the best, simplest, most durable camera ever. I have dropped it off cliffs, out of a moving car, had it in mud and under water (much farther than it says it should go) and it has always functioned flawlessly. The shape is something folks have to get used to but I like it.It takes great family and vacation pics and has been put to the test. I use it often in the garage to take photos of my hobby cars. But like all things, when some company discovers they made something fantastic, they discontinue it. I have been searching online to try to find another one of these since mine is beginning to wear out. The switch is going bad, and it is covered in greasy finger prints and now showing considerable wear. I am worried it will die and I will have to get something that is just adequate.Great job with this one Sony, a fantastic, rugged camera I have really enjoyed. Shame on you for discontinuing it. :(", "Date": "September 19, 2009"}, {"Title": "Great Water Resistant Camera from Sony", "Author": "M. Shaw \"Mahatma\"", "ReviewID": "R2CJKSO0PZB2ZJ", "Overall": "5.0", "Content": "I love this camera.  Great for one hand use if necessary.  Rugged plastic construction.  Unfortunately, they never replaced it with an upgraded model with higher resolution camera.  Sony memory card is expensive in comparison to other memory card formats, which is my only complaint.", "Date": "January 25, 2009"}, {"Title": "Camera Leaks", "Author": null, "ReviewID": "R11LUL14ZDEDF", "Overall": "1.0", "Content": "BEWARE, MY CAMERA WAS NOT AS WATERPROOF AS SONY CLAIMED IT TO BE!  I bought a DSC-U60 to take on beach vacations 6 months ago.  At first, it worked pretty well on our trip to Mexico.  I got some good shots of my family in the ocean and pool.  However, on our recent trip to Hawaii, condensation started to build up in front of the lens and LCD monitor.  Condensation built up in the sealed memory stick/battery compartment too.  The water damaged my 128 mb memory stick and the 60 pictures I had taken on it.  I contacted sony to have it repaired but the labor warrenty lasts only 90 days.  The mimimum estimated labor cost was $139 (for a $249 camera).  I chose not to have it repaired and am thinking about buying the new pentax water resistent camera which has 4 megapixal resolution.", "Date": "June 15, 2004"}, {"Title": "Great....until it died.", "Author": "Scott Wilk", "ReviewID": "R1MD6MIB6M321R", "Overall": "2.0", "Content": "This camera took 1407 photos before is stopped working.  The problem is the viewfinder never shows what the camera is looking at and any photos taken will be black.  It is as if the camera has a lens cap on it  (this camera has no lens cap).  The camera turns on, the screen show the menus, all buttons work and you can take a photo. (you'll see the green light flash on the display as it debates on using the flash and finally the camera will take the photo (including the flash going off))I called Sony and was told the camera carries a 1 year parts, 90 day labor warranty.  I was thinking \"great the sensor is covered\"  The bad news was that the labor was a flat rate charge of $148, which seemed quite excessive since we paid $150 for the camera new at a mall retail store.Just for the record, there is no water damage on the camera.  Great care (on the verge of paranoia) to makes sure the seal was clean prior to using the camera in the pool.  (typically just under the surface of the water)Here is the details of the life of the camera....This camera was a Christmas gift (2004)  Other than taking a few test pictures early this camera sat around until April or so before I got a chance to really use.  At this time the rechargable batteries that came with the camera would only take a handful of photos before they'd loose their charge.  After about a week of daily draining/recharging the batteries they started to hold a decent charge.  Most pictures with it out of the water were quite good for such a basic camera.  I was also very please with many of the underwater photos.  (the only water the camera was ever in was a pool)  My only complaint about the camera when it was working was the hand held form wasn't a natural to take pictures \"blind with\".  With my other sony digital camera I am quite good a taking photos without actually looking at the camera, but with the U60 I seemed to cut off my subject surprisingly often.The last time I had used the camera at the pool it worked great.  I removed the batteries to charge then and the memory stick to move the photos to my PC and all was great.  Two weeks later I decided to grab the camera because I was playing in a golf tournament.  The camera remained in a camera case in a padded side section of my golf bag.  I never used it.  When I got home I brought the camera back in to my office where it sat on my desk until last Sunday.  I wasn't in the pool yet when I turned on the camera and found the black image in the view finder.Even at the great deal of $150 purchase price, the camera had a price of over $1 per 10 photos.  (many of which were from the taking of photos just to drain the battery during that week where I tried to get some life in the batteries.)I have some great photos of my son playing the pool... and a lot of frustration.", "Date": "July 27, 2005"}, {"Title": "Buyer Beware!! Sony does not stand behind thier own design!!", "Author": "JJ", "ReviewID": "R1NK6MBO831X8H", "Overall": "1.0", "Content": "Buyer beware - I bought this camera for my daughter in Dec 2003. In June 2004 the flash stopped working.I contacted Sony and they said - sorry - out of warantee.  That will be $140. Sorry!!!  90 day warantee on their workmanship.  Does not say much about their confidense in their workmanship does it? Sony can pound sand.  They will NEVER get $$$ from me again. They have this terrible warantee on many products. BOYCOTT SONY !!!!!!!!", "Date": "October 22, 2004"}, {"Title": "the fun lasts only ONE YEAR", "Author": "Jess M. M. Kaneshiro \"Jess\"", "ReviewID": "R1STBR5P7K7S3E", "Overall": "2.0", "Content": "I'm an outdoor type of guy and had a great time taking my camera hiking and swimming and everywhere my friends couldn't bring theirs.  unfortunately it only lasted about 1 week under a year.  and even THEN, under WARRANTY, it would've cost $150 to fix (when i bought it for around $300).It broke as other people have explained it...works perfectly fine and then all of a sudden, without misuse or trauma or water leakage, either black pictures or pictures like a tub of vaseline.  Sony's \"flat rate\" $150 service fee didn't even gaurentee it would be fixed for that price because that only covered certain things (and they didn't know what was wrong with it and wouldn't even look at it 'till i paid).  i said screw it, and i don't think i'll ever buy another camera from them again which is unfortunate, because years ago i loved sony.  now i just keep getting dissappointed with everything but their audio equipment.fun camera, but sony isn't standing behind their products anymore.  if they don't trust them (and won't fix them), why should you?", "Date": "March 20, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "Durable for active lifestyle; waterproof up to 5 feet; one-handed operation\nFast start up (0.9 seconds); built-in flash with red-eye reduction; 1-inch LCD monitor\nIncludes 8 MB Memory Stick; compatible with Memory Stick Pro media\nIncludes rechargeable NiMH AAA batteries and charger; connects to PCs and Macs via USB 1.1", "Name": "Sony DSCU60 2.0 Megapixel Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/21459WHA2NL.jpg", "ProductID": "B00009YFXC"}}