{"Reviews": [{"Title": "OK, so maybe it's only 4.8 stars  :)", "Author": "Ms. S. Brown", "ReviewID": "R3BFQIW0OQZZ5O", "Overall": "5.0", "Content": "Having had a previous Kodak digital camera, this one wasn't too hard to \"get to know\".  One thing I noticed, after playing with it for 2 days, is that it doesn't have a viewfinder.  So obviously you can guess that I'm used to using the lcd display to \"set up\" my shots.  But it seems odd not to have a viewfinder.  I'll just have to get over it.  I am so excited about it being an 8.0mp, and one of kodak's newest releases.  I enjoy picture taking immensely, and this camera even allows you crop photos right within the camera.  You can even edit video clips.  Wow.  And the camera also takes panoramic shots, which will require some practice but I'm excited about that feature as well.  What practice shots I have taken in this mode, however, do not use flash.  So I guess this is a feature left to the great outdoors, probably where most panoramic shots are taken anyway.  Already having a charging dock, I failed to research to see that I would need an adapter in order to use it for the new camera.  I can appreciate that that makes perfect sense, but had I done the research I probably would just have bought a plug-in charger for about the same price and then had the charger dock available to sell when I sell my other camera.  I was also considering the P712, but this C875 is the one for me.  The camera has a pretty good feel to it, and the wrist strap is very handy.  There are just so many new models out there - I wonder if they all come from the same factory!!  I tried an olympus 7.1mp all weather camera before purchasing the Kodak, and I just didn't like it.  I look forward to several years of usage from this camera.  Thanks, Kodak.  You've earned my trust and my repeat business.", "Date": "September 28, 2006"}, {"Title": "Best point-and-shoot available!  Great for families!", "Author": "Brian D. Kozola", "ReviewID": "R19EF8339B360X", "Overall": "5.0", "Content": "PROS: Picture quality, 5x optical zoom, Video quality, Manual Controls, Burst Mode, Responsive, AutoRed-eye removal, ease of use, Cropping and Kodak Perfect Touch editing on camera, compressed video format (MPEG-4)CONS: Size, very bright flashOverall:  This is the best point and shoot camera I have seen for active families.  It has fully auto mode for instant snapshots, manual mode for advanced users and tough situations, and is responsive with burst mode for sports and action shots.  All results and pictures are sharp and have great color.  The video looks great with relatively small files using MPEG-4 format.This camera is a perfect fit for my family.  All controls are simple to use in either fully automatic (with automatic scene detection) or the fully manual mode.  Pictures turn out with great color and impressive detail under many/all shooting scenarios.On-camera processing is impressive.  The camera automatically removes red-eye with great results.  You can then apply Kodak Perfect-Touch processing for great lighting results and even crop it to the perfect snapshot.  It even shows you if you were still enough when taking the picture to get a good print. (Very nice so you know to take another shot!) With this camera, all of your shots can come off of the camera as masterpieces!Video capability is great.  Picture quality is very good (TV-quality) and the file size is small because of the MPEG-4 encoding so you can get around 30 min per 1GB.  You can even zoom while recording, but you will hear the motor and the pictures is momentarily out of focus.  Again, you can edit the movie by cutting it into multiple smaller files right on the camera.Very responsive with minimal lag time between shutter-press and picture capture which I find as essential for taking pictures of kids! Great burst modes allowing 5 shots at 2 fps or the last 4 shots again at 2 fps.  A larger buffer would be nice but this was sufficient for taking actions shots of kids sledding down a hill.The only downsides are the larger size than some cameras and ultra bright flash. It still fits in my pants or coat pocket, but is definitely not as sleek as the sub-compacts like Kodak's V603.  I still can't complain because it is pretty small and includes a 5x optical zoom and a 1/1.8\" CCD which is larger than most cameras (so it gets more light and has improved low-light performance).The flash is very bright and will fill most rooms with light (good) but will also bleach out skintones at close range.  This can be overcome by taking shots from farther away and using the zoom, or I have made a quick diffuser with tissue and clear tape that gives good close range results.  ust be aware of this issue.Overall I am very satisfied with this camera and highly recommend it!", "Date": "October 28, 2006"}, {"Title": "I Never Thought I Would See Pictures As Good As My Canon", "Author": "Big-Z", "ReviewID": "R9SFZW6EUTTWC", "Overall": "5.0", "Content": "I have always felt that Canon cameras took the best pictures after having Fujis, Casios, Panasonics, Sonys, and Kodaks, but I must say that the pictures out of the C875 are virtually itentical to my Canon G6... at one quarter the price. Photos in virtually any light are great. Flash throttles down so it does not overexpose. Images are sharp and clear with excellent color. Movies are fantastic. And to have the zoom feature during movies in a camera this price is amazing. I gave this camera five stars, but considering that the price is not $500, it really deserves six stars. There simply are no issues with this camera... as perfect a camera under $500 can be... and look at the price here on amazon where I bought mine! Simply AMAZING!UPDATE: After taking several hundred pictures in all lighting conditions and several videos of a total 30 minutes time, using manual settings, flash under all conditions, scene settings, I must reconfirm that this camera is simply amazing. Remember, I am a digital nerd and have owned a dozen digitals over the past 12 years. With rechargeable 2500 and 2600 Nimh batteries, the camera goes and goes, eliminating the complaints about battery life. I cannot say how many pictures it takes with these high power rechargeables, but I can tell you it went all day snapping away with reviews of pics and flash many times. I have not had one bad picture yet! I cannot say that about any other camera I have owned. And not having image stabilization does not seem to be a problem at all, even when the symbol on the LCD says that the picture may not be good... it is spectacular. I tried the panorama feature inside and outside and it is amazing... best I have used in a digital. So I still give this camera six stars after a week of heavy use.", "Date": "December 24, 2006"}, {"Title": "Very good for price", "Author": "Kodachrome man", "ReviewID": "R1OEN35D55JC94", "Overall": "5.0", "Content": "I am a professional photographer and went along on a shopping trip with a non-photographer friend of mine on Christmas Eve to buy a camera. He had a $200 limit and wanted something easy to use as he knows nothing about cameras.  After many side by side comparisons he bought the C875.  After we got back to to town we went our own ways then got back together later that evening. I was surprised he already had some very nice photos.What I like about this camera in comparison to others in its price range:Good shutter response, better than others we tried that day as well as  my wife's small Canon digitalEasy to get into manual controls and exposure compensation if desiredGood sized clear screenSmall but useable with big handsThe green light was a small distraction when he took a picture of my wife and I (as others mentioned) but ALL cameras have a focus assist light so the camera can focus in low light!  Even my pro cameras have this as an on/off option.  Just tell your subject to smile when they see the light - not a problem!No viewfinder - a viewfinder means less room for a lcd display and viewfinders on cameras in this price range are so inaccurate they are useless.  My wife's little Canon has a viewfinder and she soon found it was junk.No red eyes in any of the pictures we took of each other.  However if there is a problem the flash button is easy to use.5X zoomNote - cameras in this price range are not going to work great in low light situations such as the typical kids school program.  The lens is \"slow\", the sensor is small resulting in a \"grainy\" look, the small flash does not have great range etc.  Also the lens gets \"slower\" as you zoom out, meaning it requires more light.  If you need that kind of capability regularly buy a SLR, big flash, and fast lens.ALL cameras in this price range have some shutter lag - again you get what you pay for, if you need fast shutter response buy a SLR.Cons so far:Instruction manual designed to be non-confusing but needs more info such as the manual controlsI may have missed something but the exposure compensation seemed to only work on non-flash pictures.  I could not find a way to make it work with flash.  However using scene modes did work to change exposure with flash.  He had a white wall in his house, which causes any light meter to darken the picture, - going to snow mode took care of the problem.This is a very good camera for the money.", "Date": "December 25, 2006"}, {"Title": "Awesome little camera at a great price.", "Author": "Amazon Customer \"buddyroo\"", "ReviewID": "RT24K9A7H873Y", "Overall": "4.0", "Content": "I've only had this a couple days, but have already taken quite a few pics and videos with it so I think I can give a reasonably accurate review. Although the camera isn't perfect (at this price level, what do you expect, pay $1000 for a digital SLR if you want to try for absolute perfection), for what you pay it is awesome. First and most important, in my opinion the picture quality is really really great. I like my pictures to be very sharp and good color and for most pictures this camera delivers --- my benchmark of quality is my old HP 945 whose pictures I loved but it broke, and this camera's pics are as good as the ones I got from that one (read my review of the HP 945 if you're curious). Other cameras I've had or tried include the Casio EX-Z120 and Kodak C743. This camera blows away the C743 in all areas, and for such a small price difference (maybe $30-$50) I would just get this one. The picture quality of this one is definitely better than the Casio EX-Z120, but the Casio is a bit better low-light performer (it can go up to ISO 1600, whereas this one only goes to 800; the Casio also seems to focus a bit better in low light, but the focusing performance of this one in low light is definitely acceptable). So by the most important measure, picture quality, I love this camera and definitely recommend it. The 5X optical zoom is great too (and you can even use it while filming video!), a nice addition above the usual 3X zoom, although you'll need a steady hand or tripod at large zooms (no image stabilization in this camera). Some others have complained about the flash performance of this camera, e.g. that it isn't good, the pictures are dark or washed out, etc. I have found this to be somewhat true, but the key is to use the in-camera \"Perfect Touch Technology\" which corrects this very well I have found. Finally, the video quality is really good too: as I said, you can use optical zoom during video (although it gets out of focus for a brief instant while zooming before focusing well again), but also it stores videos in MPEG4 which is very space efficient (other cameras, e.g. the Casio EX-Z120, use Motion JPEG which is a real space hog), it is 30 frames per sec VGA (i.e. real-time motion, TV quality), and finally the low-light performance is pretty good (e.g. cheaper cameras such as the Kodak C743 are HORRIBLE in low light, almost completely dark and barely discernible, while this one is much better and nice); it is not as good as a dedicated camcorder, but if you are on a budget (i.e. don't want to purchase 2 separate products) and/or you value the convenience and space savings of just carrying one camera then this can probably work well as your video camera too. In sum, a great camera and especially so at its price. It would have been nice to have optical image stabilization, but that probably would have jacked the price up quite a bit and I can personally live without it. Highly recommended.", "Date": "December 27, 2006"}, {"Title": "A wonderful camera . . .", "Author": "William D. Gray \"The Midwesterner\"", "ReviewID": "R2GAMUEUJ0JR6Z", "Overall": "5.0", "Content": "This was one of the most highly rated cameras by a well-known consumer watchdog organization. After doing some research, we found that it could be had for a great price here on Amazon.com. It didn't disappoint.Packed with loads of features, and an amazing 5x Optical zoom, we've been able to look good in our digital pictures for the first time (with our previous camera, eyes were always closed because of the flash, or the photo was blurry because we DIDN'T use the Flash). The digital movie feature was a nice added bonus--the camera picks up sound very well, and some of the movies we've made have been just lovely to watch.Some recommendations if you're thinking of buying this product:1. Try to purchase it with a 1 or 2 GB SD card. With so many megapixels, the camera is a memory monster.2. It would also help to buy a set of rechargeable batteries. We're still scoping that out, but in the meatime, we seem to burn through AA batteries at a furious rate.3. If you plan on using it to shoot a lot of video, buy a separate power supply cord and a tripod, if you don't have one. The auto focus is very sensitive, and when you shoot movies, especailly if you zoom in, it will be constantly (and audibly) adjusting itself.If you follow the above, you'll find that you have perhaps one of the best cameras available today. Thank you for taking the time to read my review.", "Date": "May 14, 2007"}, {"Title": "Great!", "Author": "David \"Davy5000\"", "ReviewID": "R2ABT4JZHV3MBV", "Overall": "5.0", "Content": "This camera takes great pictures, I was especially impressed with the clarity.  The 5x optical zoom works great and it has manual focus and plenty of options you can use.  This is what I was looking for, an upgrade, since my previous camera was a 3.2 mp kodak. The 8.0 mp works fabulous, with stunning detail and quality.  Video mode works awesome, for a digital camera, and the sound is good, too.  This camera I intend to use for a long time, although I need to practice taking night shots.", "Date": "October 20, 2006"}, {"Title": "Great as a Point and Shoot camera- ok for more advanced users", "Author": "R. Lipman", "ReviewID": "R78WFJWILL7VJ", "Overall": "4.0", "Content": "Earlier this year, I purchased this camera for my daughter to use on a recent trip.  Her criteria were small, easy to use and good quality pictures.  She loves the camera and it has worked perfectly for her.One of the reasons why I purchased this camera is the 5x / 185mm eqiv zoom.  This is significantly more telephoto capability than just about every other camera in it's price range.  This is a very usefull feature-outdoor images are sharp and well exposed at max telephoto distance.Oveall picture quality is fine (other than compression artifacts) with even color and saturation.Like many current digi-cams, you will not find a view finder.  Image composition is via the LCD on the back panel.  It is large enough to see easily and is bright enough to use out of doors.  Max color resolution of the LCD is limited, but the camera captures enough info to enable effective editing later.When the shutter button is partially depressed, you will see a grid overlay appear on the screen- this can be a usefull aid for centering and rough image composition.  In anything less than bright sunlight, there is some shutter lag between depressing the shutter and when the image is captured.  When using the camera for sports or fast moving images, you will have to anticipate the movement of the image in order to capture what you want.  Fairly easy in most cases, but definately something to consider when making a decision.If you are looking for an automatic point and shoot camera with enough resolution for large prints or extreme cropping- this is your camera.If you want manual control and flexibility- you may want to look elsewhere.I gave this camera 4 stars.I have borrowed it a few times from my daugther and as an auto camera it does what it is supposed to.  However, I have noticed that the stated resolution of 8mp is misleading due to the extreme image compression used when saving a picture.  8mp image resolution results in a jpeg file of less than 2mp and over 500 saved images per 1gb SD card.  The downside of the storage capability is that I notice compression artifacts in the fine detail of saved photos.  Pictures are very noisy at film speeds obove 200 ISO.  No such thing as a free lunch.While this camera does offer manual control of focus and exposure settings, getting to full manual mode is burried under several clicks and menus.  Not easy or intuitive, and rather time consuming when in use.  On the other hand, I have used some of the preset scene selections and the defaults seem well chosen.The included Kodak EasyShare software is fine for a new user, with one click editing commands, picture templates and easy storage features.  The software package does take up alot of disc space however and this may be a factor when installed on a laptop with limited hard disc space.  You can very easily bypass the Kodak software in WinXP.  Just use the embedded camera and scanner wizard to download photos to the folder of your choice.  Freeware apps such as Picassa, Irfanview and GIMP give you everying from basic one touch commands to Photoshop CS level editing.Battery choices are also an issue.  While AA is a standard size, this camera does not like lower powered batteries.  I tried 1850ma rechargeables, which lasted for exactly 2 pictures before running out of juice.  I then tried 2500ma Li-Ion batteries and took several hundred pictures before a replacement was needed.  Something to be aware of...In any event, perform a web search for reviews of this camera- there is alot of usefull information out there, including how to guides.Point and Shoot- GREATManual Control and Flexibilty- OKGood Luck.", "Date": "May 20, 2007"}, {"Title": "kodak 8.0", "Author": "Melissa", "ReviewID": "R3B42KPEORNRIX", "Overall": "4.0", "Content": "This is my 3rd digital camera. I have always had Canon..which I love except every 2 years the same thing breaks on them....so i thought i would try a new brand.  I really love this camera. It has been pretty basic and a breeze to figure out most of it. The clarity is amazing and it tells you which pictures will be blury if you blow them up. I also love how when you are changing the scene mode...the camera tells you what the scene you are on does, instead of having to go back to the book to find the symbol you are on. That makes it so much easier to switch modes!! In the beginning i had trouble with it shutting off after every 4 or 5 pictures. There is a setting so the camera will shut off after however many minutes you choose. Once i set it to the longest i didnt have that problem anymore. It takes great pictures and the movie mode i like because the volume is easy to hear. I have been trying to figure out how to not have the pictures as dark as they are when i zoom in. If anyone knows how to reset that...please let me know. I switched to lithium batteries with this camera since is does drain them quickly. That has made a big difference. For the most part...I think it is a great little camera for the price, the 8 megapixels and the 5X optical zoom!! So easy to use and figure out!!", "Date": "January 18, 2007"}, {"Title": "Loved it.", "Author": "Tim McCoy", "ReviewID": "R1SK87CYW0XS7K", "Overall": "5.0", "Content": "This camera is magic!This is my second Kodak digital camera... the last one I bought lasted 7 years and still kicking!!  I dropped the old one several times.. even on the cement.I bought it on the way to a Halloween party and several other people had digital cameras.  The first pictures I took from this camera--other digital camera users at the party were jealous and asked me about the camera I was using.  The funny thing was I had never used this camera before and didn't even know what buttons to hit to review the pictures and had to fumble in the dimmly light party to figure out how to show people the pictures.  I didn't have a memory stick at the time so after taking 2 pictures, I found I only had a few left so I lowered the resolution and had many left.  The quality was still good.the reasons I bought this camera-Video with audio (for youtube online)-takes standard AA cells (I love NiMh rechargeable 2500ma cells..had them for years now)-greeting card images to send to freinds/family (at sendoutcards online)-Kodak quality on my last camera is a+++-SD Cards taken.. so I was able to use my transflash cell phone memory card and also buy new cheap cards everywhere-8 Mega Pixels is way more than I needed-Kodak knows what they are doing for good images..like magic.", "Date": "January 21, 2007"}, {"Title": "What a *G*R*E*A*T* Camera!!!!!", "Author": "J. Parton \"Amber\"", "ReviewID": "R37K6HSD0O66EA", "Overall": "5.0", "Content": "This is my first Digital Camera...... ( I know behind the times ) But being my first I have to say that I learned how to basiclly use it within the first 10 minutes no prob. It can be simple to use but you must read the instuctions. A couple other reviews are saying that the pics they took with the camera were turning out dark.... they should have read the instuctions well before use. It has like a million diffrent settings. Which is GREAT! There is a night setting, dark setting, snow, sand, sport, text or document, fireworks,  close up, REALLY REALLY close up and just about any setting of light you are in! It is an 8 MP so the picture quality is awsome! I love how this camera also has a \"UNDO DELETE\" option! I don't know anyone with a dig. camera who has that option. Make a mistake and delete the wrong pic just bring it back! I also love the video camera option as well. Now I don't have to take both cameras with me just one! BUY THIS CAMERA! IT IS GREAT!", "Date": "December 20, 2006"}, {"Title": "Needs stabilization", "Author": "P. Noble \"Topoday\"", "ReviewID": "RT3RT2500G6P0", "Overall": "3.0", "Content": "On the plus size the lens is bright, and the controls are intuitive.  The cameras form factor is good for both a big and small hands.  On the negative side, the camera needs imagize stabilization especially considering how sharp the lens is.  I wouldn't buy another camera without stabilization until image sensors become faster (more light sensitive). Most low light situations are a problem with this camera. Another niggling issue is motor noise during video mode. It goes away after the camera gets hot, as if it was improperly lubricated.  Unfortunately, the motor noise is captured on video soundtrack.", "Date": "April 3, 2007"}, {"Title": "Battery solution for this great camera ! !", "Author": "Greg L.", "ReviewID": "R2Y6VLLIECQMTE", "Overall": "5.0", "Content": "I've owned this camera about 6 months, with same sorry results about poor battery life. Even fresh Duracells only give a few shots. Forget the AA NiMH rechargeables, they only put out about 2.5volts (no matter what the capacity) when fully charged. Found a great solution... get a rechargeable 3.6 volt CRV3 battery pack which takes the place of the two AA's, and take 50 or more photos on a single charge. I am totally pleased with the camera now that I don't have to worry about the battery crapping out on me. the pack and a charger will run about $30 and is well worth the cost. Charges up in about an hour or two, and will last several weeks in the camera waiting to be used. There are several different styles of CRV3 batteries; just make sure you verify it's a 3.6 volt version and you'll be in good shape.", "Date": "August 11, 2007"}, {"Title": "Great Camera", "Author": "L. Doctor \"lpeters271\"", "ReviewID": "RFEY9P2V3W5YE", "Overall": "5.0", "Content": "I read all the reviews before buying this camera and there was some negatitve reviews.  I think this is great camera.  I love that you can correct the picture prior to printing it. It takes a beautiful picture. I have not had the battery issues, because I have used rechargable batteries. I have a printer dock, so it is great set up.  This is my third Kodak camera and I am very happy with it.", "Date": "April 4, 2007"}, {"Title": "Great camera with only one drawback", "Author": "Will Buffington \"RubberChicken\"", "ReviewID": "R2PSRDU6S9FK4J", "Overall": "4.0", "Content": "We've owned this camera now for a few weeks. The pictures are breathtakingly crisp and detailed. There is only one drawback that I had not seen mentioned yet - when the two AA Kodak batteries that are included with the camera lose their power, you will find that you need to buy Kodak batteries to make this camera work. I bought an Energizer recharging station and two 2500 NIMh rechargeable batteries. After fully charging the batteries and popping them into the camera, I found that the camera would only stay on about 4 seconds and then turn off. I did a bit of research online and found a couple of other posts from people with the same problem (tried alkalines also - didn't work). What I did was to buy the Kodak recharging platform for $50 at Best Buy. It comes with a rechargeable Kodak battery pack, a small tripod, the base which you use with the plastic faceplate that came with your camera and a camera bag. It fixed the camera shut-off problem immediately. Other than this small problem, this is definately a great camera and a great buy for getting 8 megapixel pics.", "Date": "February 18, 2007"}, {"Title": "Arrrggghhh . . . . so close, yet so far", "Author": "C. Good", "ReviewID": "R421X49XXN6ZW", "Overall": "4.0", "Content": "I've had a Kodak C875 for over six months now, and have taken hundreds of pictures with it. It's a great camera for the price, but there are a lot of things I wish were different about it.What I like:- The 8MP pictures, which are very clear at the lower ISO speeds.- The different scene settings- No delay between pressing the button and taking the picture- The video capture option- Having the manual settings available if I want them- Having an automatic point-and-shoot option if I don't want to mess around with manual settings- The size of the camera (can fit in my pocket)- The size of the LCD (easy to view pictures)- The ability to review and zoom in on pictures with just the cameraWhat I don't like:- The 2-5 second delay while it writes a picture to memory- The weak flash and general poor performance in night time and low-light settings- The battery consumption- The poor performance at higher ISO settingsAs I said, so close and yet so far . . . . .All that said, this is in many ways a GREAT little camera. The video option works really well (and up to an hour of video on a 2 GB card -- yay!!!), it takes really clear pictures when there's enough light, and for the average user it would probably be great, just bring extra batteries. I tend to take a lot of action shots and indoor shots, so I may have expectations above and beyond the average user.", "Date": "June 18, 2007"}, {"Title": "Tremendous camera, easy for tech-challenged geezers!", "Author": "Jodi Oli", "ReviewID": "R3PVS1HUM4L7GS", "Overall": "5.0", "Content": "This is a great buy -- a lot of features and a low price. Hard to believe I could get 8 megapixels for less than $200.I was terribly frustrated with it for the first hour I had it until I figured out the \"joystick\" button (this is my first Kodak, and the manual did not explain it adequately) -- after that, it was extraordinarily easy to use.The graphics are all adequately explained in easy to read type on the large lcd screen (even when I don't wear my reading glasses). Although there's no viewfinder, I quickly adjusted to not having one. Point and shoot is tremendous, and I'm even having some success with some of the \"choose your own\" functions (I haven't managed this with any of the other cameras I've tried).Although it's a little bigger than some of the credit card sized cameras, it doesn't weigh much and easily fits in my purse or my coat pocket.For this (or any camera, really) do yourself a favor and buy rechargeable batteries. You won't regret it.I am thrilled with the picture quality, the ease of use, and the readability of the text.", "Date": "January 4, 2007"}, {"Title": "Had high hopes for this camera", "Author": "mathmom", "ReviewID": "R2IQB049C9YN5D", "Overall": "1.0", "Content": "I have owned a 3 mp Kodak camera for the last several years and wanted to upgrade.  I checked out other brands, but thought I would get a better bang for my buck if I just stuck with Kodak.  I was so disappointed.  Here are my biggest gripes with this camera:1) When you focus on your subject, it shoots out a neon green light for about 2 seconds that covers the focal point of the area you are shooting.  It is blinding for people whose picture you are taking, and makes it pretty near impossible to take candid shots.  It would be very distracting if you were to take this to your kids' school productions and try to take pictures.2) The size of the screen is great, but the resolution through the screen is awful! Very grainy!3) Minor gripe, but gripe nonetheless.  There's no view finder -- you have to use the screen to compose your picture.  Wears down the batteries faster.4)Unless I specifically chose the red eye flash setting, I got red eyes. The description on the website made it sound like red eye would be gone even if you didn't choose that setting.I am returning this today and will look elsewhere for another camera.  I signed up for Amazon Prime for a trial period and got free 2 day shipping.  Found out when I was getting ready to return it that the cost of the 2 day shipping (very expensive!) would be deducted from my return amount. Not crazy about that ... wouldn't have ordered it if I'd known I would have to reimburse Amazon for their free offer.", "Date": "December 16, 2006"}, {"Title": "Awful power consumption. Buy something else", "Author": "Andrew Stack", "ReviewID": "R3R0QJ3176XBFB", "Overall": "2.0", "Content": "This is an easy-to-use camera we've had for over 6 months and we bought it because it looked like the best camera to snap pictures quickly once you pushed the button, which is important if you have fast-moving kids. However, THE POWER CONSUMPTION IS AWFUL! I've never before had a device that was so inefficient with battery usage and would require so many recharges or new batteries. I think I've replaced the batteries 4 times before I've filled up the memory card. I've nearly thrown this camera out the window various times because the batteries cut out at important (and priceless) times. I'm selling it to get a Canon. If you like having precious moments lost forever because the camera chooses not to work at all when you need it most, then this camera is for you. Otherwise, please get something else.", "Date": "June 16, 2007"}, {"Title": "Drains batteries within MINUTES", "Author": "M-Diver", "ReviewID": "RBMUOCTB49X32", "Overall": "3.0", "Content": "I love Kodak so much. The lens and features on this particular model are excellent. The picture quality with still and video are outstanding! THE ONLY PROBLEM, WHICH IS A HUGE PROBLEM, IS IT ONLY KEEPS A CHARGE FOR A FEW MINUTES. Then its time to go get the other rechargeable AA batteries to continue taking more pics. I use rechargable batteries, but they only last literally 3 minutes. Its so maddening! I own 3 Kodak cameras, this is the only one where there is no viewfinder, just a LCD screen. Thats what eats batteries. I paid a lot for this camera at the time. A year ago. Its a wonderful camera, despite the battery issue. So I dont take it anywhere, I use my others with rechargable lithium-ion batteries. :(", "Date": "May 18, 2007"}, {"Title": "Easy to use camera, software needs improvement", "Author": "JAN", "ReviewID": "R1K2G31N3QZIR3", "Overall": "4.0", "Content": "This is my first digital camera for personal use. I found it easy to learn. It has most of the functions I was willing to pay for, and in its price range, I think the quality of pictures is generally superior. There is a slight problem with bluriness, but it can often be corrected by choosing a diferent mode. I find the colored-hand indicator of a picture's quality is not always accurate, so don't discard a shot based on this until you examine it. Many  shots I've taken that rated a yellow hand are perfectly acceptable, even a few red ones.For the first week I did have the problem mentioned by others that it turned off repeatedly. I have not had the problem once I became diligent about keeping fresh NiMH batteries in it. I made it through a week of  intense sightseeing without having to recharge them.The software is usable and easy to navigate. I have not played with it long, but one thing that's annoying to me is that the albums do not seem to be separate folders, but rather are a way to organize aliases of the photos. When you move a photo from one album to another, you do not make a copy of it. This is good to keep from using up disk space, but use the delete button with care: when deleting photos from an album, the software deletes the photo from the collection. It will dissapear from every album you put it in.I'm happy with the camera and would recommend it for a general use snapshot camera. Picture quality is very good, it's versatile, small, but not too small and feels solidly built.", "Date": "May 11, 2007"}, {"Title": "Easy to use, great pics", "Author": "Lutitia Holmes \"busy mommy of 2\"", "ReviewID": "R22EE86JSPJ9FT", "Overall": "5.0", "Content": "This camera is so easy to use, truly point and shoot, but you can make it more complicated if you really wanted to, by changing settings and using different scene modes.  I'm not a complete novice, but I'm also not a \"serious photographer\" so I just turn on the camera and shoot away.  And you know what, I've yet to turn out a bad photo.  The camera has a feature that picks the best scene mode for the picture you're taking.  Great huh?  Kodak really took all the hard work out of this one and made it super user-friendly.  One note: if you are really dependent on looking through a viewfinder, this one may not be for you, it does not have one, but unlike some other digitals nowdays, what you see on the screen is what you're really taking a picture of.  I was used to looking through one, it didn't take long to get used to just seeing it on the screen.  (plus you don't get nose prints all over your screen!)  I've used it in many different situations, children's sports, NASCAR, at the zoo, in a mall, just around the house, from a moving car, and the pic is clear everytime.  I even got some really nice shots of the moon the other night, not easy to do when you're zoomed in with no flash on most cameras.  Worked great with this one.  I highly recommend the Kodak C875, for versatility, ease of use and esp. for the price.  Would also recommend getting the dock kit to go with it, as it comes with a case and makes transfer of pics to computer effortless.", "Date": "March 3, 2007"}, {"Title": "a camera anyone can use and get great results!", "Author": "D. Richmond", "ReviewID": "RFQGF9EBVECRC", "Overall": "5.0", "Content": "I really love this camera. It took me a few minutes to adjust to not having a viewfinder. After the adjustment, I love the way you can see the photo on the large screen in advance of shooting it and really make sure you have it centered properly.The batteries are the only negative issue. They didn't last but a few hours. I was very disappointed by this, especially when I had to leave an event to get fresh batteries.", "Date": "February 25, 2007"}, {"Title": "Amazing Little Camera For Great Value", "Author": "Renee I. Weidner \"Photography Mom\"", "ReviewID": "R3PG2F1OP4FEB", "Overall": "5.0", "Content": "This is the 3rd Kodak Digital Camera I have owned and I couldn't be more satisfied! I upgraded from my Kodak 4.1 Megapixel and I cannot believe the difference in the quality of photos! I now can take photos up very close and they are not grainy at all.  (I have found better quality when I stand back a little and zoom in... rather then standing close to subject) Even my daughters little freckles are of perfect form! Don't get discouraged if the photo in the LCD screen is not perfect, once downloaded onto the computer or printed at the store, the quality is much better. I didn't realize what I was missing out on until now!!The size of the camera is smaller then the ones with the 10X and 12X optical zoom, and I personally can't imagine needing more then the 5X Optical Zoom this camera has, for the photos I take. And it is a great trade considering with this camera you get 8.0 megapixels for a lower price. I personally am so glad I chose to spend a few more dollars and get the Kodak with the SCHNEIDER KREUZNACH Lens.  Really, it is well worth it! My mom has the Kodak 7.1 without this particular lens, and my photo quality is so much better then hers.My son's sports action shots are perfect even zooming in from the stands. The video quality and sound is also unbelievable for this small device.  Much better then my VIDEO CAMERA!  Also I am really enjoying being able to crop right on the camera, and I love having so many settings to choose from.  I have found the automatic setting works very well if you don't want to go through all the settings or plan to change from photo to photo.  This allows the camera to choose what setting is best for the different pictures and does a great job!Menu is very easy to understand, and is very similar to other kodak cameras. Software is great with many additional upgrades since my last kodak software was installed a few years ago.Kodak has my vote since I could not seem to find 8 megapixels anywhere else for under $200, not to mention I also received the free memory stick by purchasing through Amazon.  (Be sure to add it to your cart and then put in the promo code at checkout.)Wal-Mart has this exact camera for $199.96 right now with out the extra memory stick.  This camera is selling on ebay for MORE then you can buy it for at Amazon, which I don't understand.  I bid on several then realized it was a better price on Amazon.  I also received this in 2 days with free shipping!Thanks Kodak for another great product.  No, I don't work for amazon or kodak, I am just another highly satisfied customer.  :-)", "Date": "January 13, 2007"}, {"Title": "I LOVE IT !", "Author": "MAR", "ReviewID": "R1OPA3S1YN51R3", "Overall": "5.0", "Content": "This is a great little camera.very powerful camera pics are very sharpgreat if you have kids", "Date": "October 16, 2006"}, {"Title": "Incredible camera  with incredible features that takes incredible pictures!", "Author": "L. Yoder", "ReviewID": "R2IDXMHNFOA36B", "Overall": "5.0", "Content": "I did extensive research before selecting the Kodak EasyShare C875, and I am thrilled with my purchase. This camera takes incredible pictures. The screen is much larger than my friends' cameras, and it has all the extra settings that the average person needs to take great photos in all kinds of conditions. I have not had any bad or blurry pictures with it yet. I am thrilled with this camera and would recommend it to everyone.", "Date": "February 25, 2007"}, {"Title": "Love the Big Screen", "Author": "Amazon Customer \"jmul1186\"", "ReviewID": "RUYZNRFCX34Y1", "Overall": "5.0", "Content": "This camera has lots of option and it great.  The price is right and so affordable compared to others with 8.0 MP.  The only thing I don't care for is that when you load your pictures into your pc it turns them all into easy share photos and you can't scroll the way I like but other than that it is an awesome camera.", "Date": "February 24, 2007"}, {"Title": "Nice camera at a great price", "Author": "Bluesguy \"Greg\"", "ReviewID": "R24WKFM9QQJ2S1", "Overall": "4.0", "Content": "8 MP and 5X optical zoom for $171 including a 1GB memory card......quite a good deal. The C875 is a bit front heavy with the large zoom lens and the auto focus occasionally locks on something in the foreground and captures the subject out of focus. Easy to operate and great photos when properly focused. Camera size allows for convenient in-pocket carrying.", "Date": "February 7, 2007"}, {"Title": "Excellent camera for under $200", "Author": "A GIFT FOR YOU", "ReviewID": "RFBVI6TYF1C0O", "Overall": "5.0", "Content": "LCD display is big, regardless the lack of a viewfinder (which many mentioned as a battery drainer) battery duration is very good, and color is excellent.All that aside, this camera has every feature a casual user might want.For me, I take HQ photos of products for data sheets and its F number of up to 8 has given me a very decent depth of field on macro mode for these shots.Other great features are its 8mp and 5x optical zoom which makes it even more versatile.Overall this camera is outstanding for its low price.", "Date": "December 31, 2006"}, {"Title": "Great Camera", "Author": "CLM", "ReviewID": "RT27CB67737CV", "Overall": "4.0", "Content": "I got this camera for Christmas, yesterday. My mother was looking for a inexpensive camera with great zoom.  So far I have been happy with it.Pros-Very clear pictures, great LCD screen, easy to use, great optical zoom, nice mega pixel count, has a great auto fix function on the camera.Cons-doesn't focus at times (its not that bad), pictures come out very dark in low light rooms, sometimes flash doesn't work that well, some pictures come out blurry (low light places), bad with batteries (plan on buying some rechargable ones)I was using the camera in my living room, which is only lit from one side.  Pictures sometimes came out odd, but overall great.  They came out darker, but all of it can be fixed on the camera.  There is a function that will try and lighten up the picture while on the camera.  Most of the flaws can easily be fixed in a photoshop programTook about 50 pictures outside (in darker weather) all pictures came out great!  They're really clear and reflect the actual event.Most of these reviews complain about the green light.  All camera's have some sort of light.  It hasn't given me any problems.Other reviewers complain about some minor flaws.  They were expecting a professional quality camera for a cheaper price.  Its not professional quality, but good for the average adult/teen.Many of my friends have the Cannon (in the $150 range).  It takes the same quality pictures, but only has a 3.5x optical zoom.  I much prefer this camera.", "Date": "December 26, 2006"}, {"Title": "No view finder", "Author": "C. Craig Hubachek", "ReviewID": "R3DSO9V24WSPR5", "Overall": "3.0", "Content": "I wish I had researched this camera a little more before I bought it.  When I received it I found out it has no view finder, only the screen on the back to view what you are taking a picture of.  For younger people who didn't grow up using 35mm range finder and SLR camera's I am sure they won't mind.  It does take great pictures and it is easy to use but because there is no view finder I put the camera in the back of my sock drawer and bought a Canon A630 which I really enjoy using.", "Date": "April 2, 2007"}, {"Title": "ALMOST perfect camera", "Author": "Amazon Customer", "ReviewID": "R33RYKM161BZ8X", "Overall": "4.0", "Content": "OK - I got this camera because it seemed dummy proof....  It has a setting on which it will take what IT thinks is the best picture for the lighting conditions are.... which doesn't work well if you're inside in a dark environment (like at a Christmas party for the office)(it thinks that it should use the \"candle light\" mode... which makes cool pictures, but the flash doesn't go off, so you get a darker picture)....  other than having to take the same picture 5 times....  I would suggest for the next variation of this camera to have a \"normal picture\" mode (which I haven't found on this camera), where the flash goes off...Also - with Kodak cameras, you can't just plug them into a computer that hasn't had the Kodak software installed on it... the computer won't recognize the camera as a camera....If Kodak were making improvements to this camera, I would also suggest adding a viewfinder, so you can turn the display off to preserve battery life... with the big screen, it eats batteries!Other than that, it takes great pictures, and has the AWESOME feature that if you turn your camera to the side, it automatically switches the display on the screen to show the picture right side up....It's a really great camera, and takes some amazing pictures, but if Kodak could fix those two or three little things, it woudl be the prefect camera!And a 2G SD card in it (not included - but I bought it on Amazon.com for cheaper than I could get a 1G card at Walmart!) has held all my pictures - including the shots I took just playing around the office, my Christmas party, and the cruise I jsut went on.... and we were some PICTURE TAKING FOOLS!  :)", "Date": "January 11, 2007"}, {"Title": "5 STARS ***** great deal!!", "Author": "J. Bilby \"littlebibs\"", "ReviewID": "R3U3TQOE44EBNG", "Overall": "5.0", "Content": "Just bought this nice little Kodak C875 camera the other evening andhave been experiementing with it. First off, amazing great price for thisquality, feature packed little camera. I've taken many sharp, vividclose-ups and I couldn't be happier about how these photos are coming out.Attended a great pre-Christmas get together with some family and friendsand all the new digitals were snapping around the room, I wish I couldhave captured seeing all these going off in a picture! After comparing the new elph Canon, Nikon coolpix,Panasonic lumix zoom, another zoom Kodak Z710, I'm thrilled at this camera's quality and versatilty. I need to find my way around everything aboutthis new Kodak C-875 but its basically pretty easy and handy to use itsthe holiday season so I'll have some free time and many prints to be made.  I know that there is anissue with battery life with this camera, it has a bright strong flash, but I will get a charger soon enough but its good to keep spare AA batteries just in case. I was allset to buy the Canon A630 when I realized what a pain it was gonna betrying to get into my computer, remove my scanner everytime, forget it, so I took a chance with what was going tobe my 2nd choice, this C-875, so far I'm more than happy with this performance. At $199.00 for a feature packed 8.0 5X its a steal andshould allow Kodak to keep up with this crazed maket of digital camera excellence. To each their own.", "Date": "December 9, 2006"}, {"Title": "Battery Killer", "Author": "L. Shen", "ReviewID": "R3W0N0EE15P5WC", "Overall": "1.0", "Content": "The battery is such a big headache. This camera only works when I put in new or freshly recharged batteries. If I'm using the video taping feature, it will quickly start complaining the low battery.If I leave the new batteries in the camera, the camera will not work because of the battery the next time when I try to use it, even it's just the following day.What's really odd: The 'used-up' batteries from this camera are actually usable in my old digital camera. I'm wondering why this one is so demanding?", "Date": "August 6, 2007"}, {"Title": "Not upto the mark !", "Author": "Kamal Bhardwaj", "ReviewID": "R239QQ4ZLIPP2S", "Overall": "2.0", "Content": "I bought this Kodak EasyShare C875 digicam in Nov' 06 from Amazon online. I had very high expectations with this camera but now I' am not entirely pleased with its performance. The pictures are excellent during daylight or outdoor conditions, but in low light or indoor conditions picture quality is not upto the mark. The zoom is good but when you take pictures of long distance scenes, they appear hazy and blurred. The red-eye reduction mode also does not help much. During Video mode their is lots of Camera noise that is also recorded with the video. It gives an impression that recording was done near a seashore. Overall, I feel Kodak should have tested this product thoroughly before launching it. I' am now planning to sell it off and move to Cannon/Sony.", "Date": "May 16, 2007"}, {"Title": "Easy to use, but guzzles batteries", "Author": "WKM \"Cat Lady\"", "ReviewID": "R1JOOSTHMHOP87", "Overall": "4.0", "Content": "I bought the camera a few days before leaving on vacation and found that it was the easiest camera to learn and to use that I have ever had. It takes fantastic pictures and it does all the work for you if you use the automatic mode. I was really impressed by the quality of the photos. There are two problems, though. It guzzles batteries like crazy. Next time, I'll take at least two rechargeable batteries, a battery charger and some extra batteries, to boot. I used two AA batteries for every 25-50 photos, depending on the quality of the batteries and how quickly I turned off the camera after shooting. The other problem is viewing the screen outdoors. It was very difficult to see the screen in the sunlight. I tried some panoramas, but I could not see the screen well enough to line them up corretly. The photos would have been magnificent if I had lined them up correctly. I rate the camera VERY highly for being very easy and for the great quality of output.", "Date": "February 10, 2007"}, {"Title": "Great Little Camera for the Price", "Author": "D. Mills \"dmills1555\"", "ReviewID": "R36W10R2O4CPWB", "Overall": "5.0", "Content": "For the money, I don't think you can beat this camera.  I received mine as a Christmasa gift.  Overall I have been very happy with it.  You must remember this is still an entry level camera, and as such it isn't going to do everything that higher end digitals or SLR cameras can do.  My pros and cons are listed below:Pros:-  Mega pixels.  You simply cannot get 8MP for this price in any other camera-  Price-  Ease of use - The manual isn't that great, but the onscreen menus are pretty intuitive.  You can print a more detailed menu from the Kodak website-  Versatility.  You can use the camera from a strictly point and shoot mode to fully manual where you control the F-Stop, Aperture, and Shutter Speed (or anything in between).-  Nice video capabilities-  Accompanying software lets you edit and share pictures easily-  Has an indicator that tells you how well your picture will look on a 4x6 printCons:-  Uses batteries like they're gong out of style.  You definitely want to use rechargeable ones-  Unpredictable results in the fully automatic (auto sensor) modeIf you're looking for a good entry level digital camera, I definitely think the Kodak Easyshare is worthy of your consideration", "Date": "January 18, 2007"}, {"Title": "Nice for the Price", "Author": "MLipenk", "ReviewID": "R2U7WHPC8CW8RR", "Overall": "5.0", "Content": "Pros:Nicely constructed. Good solid cover over SD card slot and USB port (unlike my Canon A620's flimsy cover). Unrivaled ease of use. All functions are explained as you select them. Additional \"info\" button further explains functions in detail. Has a high rez 7.1 megapixel 3:2 ratio option!!! (In other words: photos will not be cropped if developed as 4x6. Most digital cameras have a 4:3 ratio and the top and bottom of 4x6 pictures will get cropped at the developer). Date stamp can be added to ALL resolution options, unlike my Canon which only allows date-imprint on the \"postcard\" mode.Cons:The flash can be a bit strong. Faces on portrait shots 5 ft. or less can sometimes be quite over-exposed. Compensate by maintaining some distance and using the zoom. The AA batteries that ship with the camera last for about 30 pictures, then cause the camera to behave eradically.  (I now use 2300mAh Lenmar Ni-MH batteries. Performance obviously is much better). The camera will try to shut down when the batteries start to get low so the lense doesn't get stuck open. This is not necessarily a bad thing. So don't let the batteries that ship with the camera determine your final analysis of the camera's performance.Other Thoughts:This is the first Kodak point-n-shoot that actually looks good in my opinion. Nicely constructed, without the cheap look of some other Kodaks. Pictures so far are great with the occasional over-exposed portrait shot. The results of some of the pictures I've taken with this Kodak exceed those of my Canon a620 from a point and shoot standpoint. Operation is so simple that you will unlikely need to refer to the owners manual. The 3:2 format option is awesome... No surprises when developing 4x6 photos.", "Date": "January 2, 2007"}, {"Title": "Great photos but...", "Author": "Lynne Ewen", "ReviewID": "R3I4N6X3HJ1WL1", "Overall": "4.0", "Content": "The camera works great and I can deal with the \"no view finder\" as listed in other reviews.  What really drives me nuts is the button to maneuver around the camera.  My CX743 was WONDERFUL.  This one doesn't advance just one picture but goes back to the beginning or if you want to delete it skips back to the beginning again. The \"scan\" offerings are great, if you can get the advance button to click onto the correct icon--again it skips all around and won't place itself where I want it to do so.  I can't tell if it is super sensitive or just the way that it works.  This is especially frustrating when you are trying to \"review\" pictures.On the other hand, the cropping and enhancement right on the camera menu are great and do a tremendous job.Hopefully the museum setting will work well.  I'm still not satisfied with the night setting for inside churches during choir festivals etc.", "Date": "June 12, 2007"}, {"Title": "Excellent Camera", "Author": "C. Kline", "ReviewID": "R1CG9LFYFH4C1X", "Overall": "5.0", "Content": "This camera is VERY easy to use.  I would not consider myself technologically inclined, and I could figure out most functions without the manual.  The pictures are crystal-clear, and downloading is a breeze.  I would highly recommend this product to anyone for a first time digital camera!!  Very cost-effective for such a high mega-pixel quality.", "Date": "March 9, 2007"}, {"Title": "C875 8MP Digital Camera", "Author": "Susan Mcfarlane", "ReviewID": "R2Y6LC0BNH5PPX", "Overall": "4.0", "Content": "I love this camera as it is easy to use.  There was one problem that I encountered however, and that was shooting pictures in the sun.  Since it does not have an eye piece to see through, and only the LCD screen, it was very difficult to see the screen to center the picture in.  Everything else, ease of use and picture quality were great.", "Date": "March 8, 2007"}, {"Title": "Love it!!!", "Author": "E. Adduci", "ReviewID": "RD4JUPV1NHL8S", "Overall": "5.0", "Content": "I've been shopping around for months for a camera and I ended up going with this one, and ever since I got it I used it all the time, it really puts my old camera to shame. The picture quality is great, I overall love this camera. The only downside of it is it eats through AA batteries real quick, so if you get this camera I HIGHLY suggest buying rechargeable battery!! Other than that it's a great camera :)", "Date": "February 18, 2007"}, {"Title": "Extremely happy  with this camera.", "Author": "A. Bailey", "ReviewID": "R21UY8FGOCU7DZ", "Overall": "5.0", "Content": "I have always used Kodak cameras in the past with great results and once again I was not disappointed. I love it.  Kodak just keeps getting better.  The software is very user friendly and is quite easy to use to edit and store your photos.  The camera is also very user friendly besides being small and light to carry.  It took me a little time to get used to using the 2.5\" window to take photos but now I don't know how I used a smaller one. My favorite feature is the grid you get when you press slightly on the button before you actually take the photo.  My photos come out centered with less cropping latter.  And finally the 8 megapixels are unbelievable.  My enlargements are so much clearer and defined.  Hands down this is the best camera for the price, quality and ease of use.  A.Bailey", "Date": "February 14, 2007"}, {"Title": "Excellent for photos but lousy view finder", "Author": "Jung Su Myung", "ReviewID": "R2WR3HRHV53DA4", "Overall": "4.0", "Content": "I have several digital cameras(4 Kodaks, 3 Canons, 2 Nikons).  For good photos Kodak gives best colors in my feeling. But my Kodak cameras(DC 265, DX 6490, P712, and C875) show some violet colored bluring stripes on view finder at certain situations. Those situations means the case of shooting angles related with light sources. Concerning the view finder, I could never see clear scene like other brands. Even though, the pictures taken are excellent qualities comparing with other brands. I always carry two or three cameras taking same pictures to compare. I am insisting on Kodak because of the good colors. I am expecting Kodak would correct this obstacle soon, or some other company to accept Kodak processing chip to their's.", "Date": "February 1, 2007"}, {"Title": "Easy share", "Author": "Robert Thurston Jr.", "ReviewID": "R2KRNY4MYC4X76", "Overall": "5.0", "Content": "I'm very satisfied with the product, very easy to use with the descriptions of the buttons in the menu so you don't have to remember what the icons represent.  The picture quality is excellent.", "Date": "January 29, 2007"}, {"Title": "Easy to use- battery hog", "Author": "Robbie Hunter", "ReviewID": "R2IOPYZ1JYP624", "Overall": "4.0", "Content": "Overall the camera is easy to use and download from.  The camera does go through a lot of batteries, probably because the is no viewfinder only the screen. To use the movie recorder you have to have MPG4 on your computer.", "Date": "November 9, 2006"}, {"Title": "A so-so replacement", "Author": "Stephen Sapp", "ReviewID": "R3ALTLU9K8KX2J", "Overall": "3.0", "Content": "We bought this camera to replace an earlier EasyShare (CX 6330, I think) that we liked very much (3.1 megapixels, 3x zoom, but with a cracked battery door that sometimes resulted in a failure to deliver the juice needed to take pictures even when the battery's fully charged), but so far it has not knocked our socks off. There's nothing really wrong with it (other than that it lacks a viewfinder, but that's my fault for not looking closely enough at the product picture!), but I haven't seen a marked increase in picture quality from the old camera. It does still have the qualities we liked in that one: small size and light weight (fits in my shirt pocket easily), ease of use, and simplicity of transferring pictures to a computer.", "Date": "June 12, 2007"}, {"Title": "Great features; user friendly; quality photographs", "Author": "Bonny M. Yokeley", "ReviewID": "R3IH4JLDDVPEBE", "Overall": "4.0", "Content": "This is my third Kodak digital camera, and I am very pleased with it. Some of the features that were important to me are no delay, video/audio recording, ease of use, and quality of photos. This camera has met all those requirements.  Yes, it lacks a traditional viewfinder, which I thought I would miss because I still used the traditional viewfinder on my old camera at times, but because the screen is so large and clear, I don't need it, and my photos have not suffered one bit.I have used the video feature many times to email clips of my children to family, and it works very well.I wouldn't try to compare this camera to the professional series, but for the everyday photographer who wants a quality camera at an affordable price for vacations and action shots of their children, this camera is ideal.", "Date": "June 9, 2007"}, {"Title": "Great little camera, easy to use", "Author": "L. Hubbard \"Miss Lady\"", "ReviewID": "RWRGNUPWGPTDB", "Overall": "4.0", "Content": "This is my second Kodak digital, and I love it as much as I loved the first one (which I only replaced because after 4 years, it was just so outdated).  It's small and light, and more sturdily built than previous models, plus the picture quality is great.  Simple to use, you can get fancy if you know what you are doing, or just pull it out of the box and snap away.  I gave it 4 stars instead of 5 because it goes through batteries really quickly, I have had to replace the lithiums twice in 5 months.", "Date": "May 29, 2007"}, {"Title": "The Kodak that could", "Author": "Barbara Bowne", "ReviewID": "R1E2VAGNJXHG9K", "Overall": "5.0", "Content": "I have been a photographer for many years. i can set f -stops and use a light meter and everything.But this little digital makes me wonder why I waited so long to go digital.I love my new Kodak. It is  gets nice results in the very beginning. Of course you can go on to more complicated shots when you are ready. It is very easy to use and gets lovely pics.", "Date": "March 24, 2007"}, {"Title": "Kodak C875 8MP digital camera", "Author": "D. Diehl \"Don\"", "ReviewID": "R3SKYM0GOZC9HD", "Overall": "4.0", "Content": "This is a great little \"take along\" point & shoot camera. The good: let the camera do the thinking and nearly every shot you take will be great.  Want to control the shutter or lens opening you can do that too.  With its included softwear and website support you can make the most of every shot you take. The bad: no optical viewfinder & no optional add-ons to enhance picture taking ability.  What you see is what you get!  For anyone like me who doesn't care about all the bells & whistles but just want's easy to make great pix in most situations, this camera would be hard to beat.", "Date": "March 21, 2007"}, {"Title": "Incredible clarity!", "Author": "I Vote", "ReviewID": "R3EMMS58CEBRCR", "Overall": "5.0", "Content": "I was concerned that the camera would not perform at 8MP nor the 5X zoom be clear. I'm please to be the owner of an incredible Kodak performer. I had to test how clear the shots where and found that I could shoot THEN zoom in for fantastic detail. Better than anticipated! I only wish I had bought the docking/charger package.", "Date": "March 20, 2007"}, {"Title": "Flashy Remarks", "Author": "Briana Littleton \"Breezy\"", "ReviewID": "R3NJY6TJ2EOYUX", "Overall": "3.0", "Content": "Overall we are happy with this camera (our first digital).  It's easy to use, the photos are sharp and the color is vibrant.  The reviewer who stated that photos look better when you use the specific lighting/action settings was absolutely right, which can be frustrating when you want to just point and shoot. I also wish I had realized that the batteries have a very limited life in this camera, even when you buy the lithium.  We bought rechargable AA's for digital cameras and that took care of that problem for the most part.", "Date": "January 11, 2007"}, {"Title": "Great value", "Author": "Still Alive and Kicking", "ReviewID": "R1J5FGYP45QAUC", "Overall": "5.0", "Content": "This was my second Kodak digital camera, a replacement for an old plastic 2MP one I bought in 2002. I was looking for a longer zoom and manual controls, as well as of course more resolution, and this one really fit the bill well. I just got back from a vacation to northeastern France just two weeks after buying the camera, and I'm even more pleased with it now. Because it fit easily into my pocket, I carried it with me everywhere. Because of the manual controls, I got the night photos I wanted, something that never would have happened with my older camera or with a regular automatic camera. The auto settings worked well for most situations, and the 5x optical zoom got me the photos I wanted without cropping when I got home. The photo quality is absolutely excellent.The one and only downside is that the flash seems a bit weak. If I were taking a lot of photos of groups of people indoors (say, at parties or weddings) that would be a real annoyance, and I'd think twice about using this camera for that kind of thing. I usually do not use the flash, and in fact I set the Custom mode to fully automatic, but flash off, and used that for most of my photos (since as far as I can tell, the Auto mode cannot be set to default to \"flash off\" - but this is exactly the same thing).I'm still surprised that I bought Kodak cameras - I thought those days were long over back in the 60s - but I've been very pleased with both of the ones I've owned.", "Date": "January 8, 2007"}, {"Title": "off to a rocky start", "Author": "P. Kendall", "ReviewID": "R2XCHQCH0SEG00", "Overall": "3.0", "Content": "My first C875 lasted about a day. That's when it started turning off when I pressed the shoot button (even with fresh batteries).My second C875 seems to be working well so far. I like the 5x optical zoom and 8 MP image size, all for a reasonable price. One minor irritant is the lack of documentation on the camera's features. The enclosed manual is light on content, and the user's guide on the Kodak website seems to be for a different model, since it directs the reader to camera menu options that don't exist.", "Date": "November 22, 2006"}, {"Title": "price is good, pics \"so- so\"  to  ok.", "Author": "Alex E.C. \"Music and movies\"", "ReviewID": "R1KOFILQSCLAC6", "Overall": "3.0", "Content": "This camera has a few good things, the optical zoom is the best .But the automode is not perfect.when is a clear day outside and you thing in the perfect pic,the pic is out of focus and blurry. Other times the pic is taken perfectly. The price is right for 8 megapixels.The close up mode(flowers) sometimes works and others not, you have to play and take several pics to reach the perfect close up.The camera will focus other part of the frame,and you flower is blurry.The flash is out of focus in automode but when you set in party, it works good.Beside,I tried to take pics of myself with a tripod,the pics were all them blurry and out of focus. if you want pics of yourself, you have to tell your friend to take it for you.it doesn't work with all pre-set modes ,neither in auto mode.nop!.I don;t know if I will return it.update.nov,30,2006.I took more pics with this camera and definitly something is wrong with the automode,and the macro sometimes works right.I return this camera and I'm going to invest in something better.I wanted an easy and sophisticated camera, this is not.It has a lot of things,but the magic with this camera never happend.I posted a lot of pics.I dont have anything against kodak, maybe kodak has others good cameras.my first digita camera was a kodak and I loved it.I had the oldest kodak 2 megapixels and it took it better pics at least they were in focus with the timer.I'll try the canon A630 orA640,the rewiews of the A 620 and pics of this camera are very good. I think the Canon A640-A630 are the updates of this camera.I don't have shakings hands, if you ask.", "Date": "November 26, 2006"}, {"Title": "Great shots... until flash stopped working", "Author": "S. Peters", "ReviewID": "R2LMF58DM5CDSS", "Overall": "2.0", "Content": "I got the Kodak C875 as a gift just under two years ago, and at first I loved it. Previously I'd always had Nikon or Canon cameras. The camera is very easy-to-use right out of the box, and the one-touch transfer button on the charging dock (sold separately) is a nice feature for someone who doesn't have a lot of time to sit around uploading photos. It took some trial and error to get the best possible shots and learn how to work around the camera's small limitations, just as with any product.Once I got familiar with the camera, I got some really great photos. As a \"snapshot\" camera it's great, particularly in outdoor sunshine. People were always complimenting the action shots I got of kids. But I was able to set up some nice shots using the manual settings as well. I have one killer nighttime closeup photo of a spider on a dewy web that I flatter myself to think looks quite professional.In spite of all this I have to give this product only two stars and recommend against purchasing it, because the flash stopped working a month ago, and I am dismayed to learn that this is quite a common occurrence and that Kodak's customer service is completely unhelpful about fixing it. I can only assume it's another instance of planned obsolescence to keep people buying a new camera every few years. Sorry Kodak, but I'm going back to Canon and Nikon.", "Date": "December 1, 2008"}, {"Title": "not good product, not good warranty", "Author": "L Haynes", "ReviewID": "RDKJC0MQNA52H", "Overall": "1.0", "Content": "The flash suddenly stopped firing and, although the camera is still under warranty, the fees associated with redeeming the warranty can be astronomical. Kodak can find the warranty null and void for any reason, then charge you for the return of your camera. We added up potential costs of turning the camera in for warranty work, and it would be more than a new camera. We're going to give it to the kids to play with and purchase another brand camera for ourselves. I thought Kodaks were supposed to be top quality, but this experience has proven differently. It has been a terrible disappointment.", "Date": "March 28, 2008"}, {"Title": "Bad quality, worse Kodak Service!", "Author": "Monica Czyz \"Moniczka\"", "ReviewID": "RSA6TKDHPRPDE", "Overall": "1.0", "Content": "There must be an on-board timer for this camera to break down.  Just like the other user that gave a single star, the flash stopped working on the camera about 1 year and 1 month after buying it.  Get this- Kodak was willing to give me 15% off another camera at retail price- only if I gave them the broken camera back.  So I can get yet another Kodak?  Don't think so!The flash stopped working within weeks of the 1 year warranty, so I called in to see if they were willing to keep a customer. (I even called back during overseas time to talk to a manager who the agent said could be much more helpful given the timing of the breakdown)  Nothing was done but a repair bill close to the cost of a new camera, or 15% off on a trade in.Although these are probably $40.00 to make, and King Kodak can care less, I would STRONGLY recommend an extended service package if you want 2 summers out of the gadget.  I am of the opinion that an 8 MP camera would and should last me a few years, as I am not the tech driven person who needs to replace phones, cameras, and computers every 12 months because something else was released to the market.Hope this helps!", "Date": "March 10, 2008"}, {"Title": "Too early to really tell, but seems great so far.", "Author": "JoDee Leahy", "ReviewID": "R19KKPXBCG6WHC", "Overall": "5.0", "Content": "We got our camera 3 months ago.  The batteries that came with it (and any other normal AA batteries) were used up after 5 or 6 shots with the flash.  That was highly annoying.  However, we finally bought some rechargeable batteries especially made for digital cameras and they're lasting much much longer.  Other than that, I read the manual and there's so many features that come with the camera that I've been really excited with it's potential.  I've only actually tried using a few of them so far, but they all seem to work great.", "Date": "May 15, 2007"}, {"Title": "Great Camera!", "Author": "C. Sheppard", "ReviewID": "R2M5OLD71V1GLH", "Overall": "5.0", "Content": "We looked up this camera on a rating site before we purchased it, and it's turned out to live up to our expectations.  It has numerous settings that allow you to take pictures in every situation, and takes wonderful pictures.  I would recommend this camera for anyone and everyone.", "Date": "March 13, 2007"}, {"Title": "We love it...mostly.", "Author": "Eve White", "ReviewID": "R3U82TYTXS8ICV", "Overall": "4.0", "Content": "The camera takes beautiful pictures and is INCREDIBLY easy to use.  I have an Elph at work with half the features that is much harder to navigate.  The only drawback is that it chews through batteries at an incredibly fast rate...even in power-save mode...thanks to its beautiful but energy-devouring view screen.All in all, however, we are very VERY pleased with the picture quality.", "Date": "February 21, 2007"}, {"Title": "Kodak EasyShare C875", "Author": "S. Epstein", "ReviewID": "RGWCYN3HLBX3I", "Overall": "4.0", "Content": "This is my first digital camera.  I bought it because I was going on vacation and finally needed one.  My requirements were: speed (for when I'm taking pictures from a tour bus window), use of rechargeable (not proprietary) AA batteries and more than 3X optical zoom, on a small automatic (not SLR) camera.  I need only 4X6 pictures for scrapbooking, so I set it to 3.1 megapixels, but didn't change any other settings.  It takes pictures quickly (unlike my friend's camera, where you have to hold the button for 5 seconds or more), but there is quite a lag until I can take a second picture.  I don't know if this is normal, since I don't have much experience with digital cameras.  It has 21 \"scene modes\", of which I had the occasion to use quite a few (especially flowers, landscape and night landscape) and I was pleased with all of them.  There were others I should have tried but I forgot they existed.", "Date": "February 20, 2007"}, {"Title": "Could be a great camera, but VERY DISAPPOINTING in low light.", "Author": "Dennis Wagner", "ReviewID": "RPC5D9WWF8SQW", "Overall": "2.0", "Content": "This was my third digital camera, and the features, price and other reviews made me curious.  The bottom line about this camera is that when shooting indoors and overcast sky, the flash is seriously underpowered.  The 5x zoom lens lets you get close, but beyond 8 feet the picture is dark and disappointing.Amazon paid the return shipping, and the credit was smooth, thanks Amazon!", "Date": "January 17, 2007"}, {"Title": "Great little camera!", "Author": "K. Mc \"Kate\"", "ReviewID": "R1A1B4TT7U50QC", "Overall": "5.0", "Content": "I really like this one.  I had a Kodak 4 mp for a long time and it took beautiful pictures.  I purchased the Kodak 7 mp and I hated it from the start.  I returned it and then bought this 8 mp.  What a difference!!!  I thought I would have a problem with it not having a standard viewfinder but the technology has really improved on the LCD screen.", "Date": "January 9, 2007"}, {"Title": "Great Little Camera", "Author": "M. Wilkin \"avid reader\"", "ReviewID": "R1EZS5H4IE7IMW", "Overall": "5.0", "Content": "I received this camera as a Christmas gift and waited a while to write a review.  I love this camera.  It is true that it lacks a view finder, a feature I did not even notice was missing until I read reviews.  It also does eat up AA batteries.  I bought special digital batteries by Duracell and they worked great.  Eventually I bought and CRV3 battery and really have not had any problems at all.  If you check out the product gallery I have contributed some pictures and they speak for themselves.  Great color, clarity and the ability to take some pretty good action shots.", "Date": "March 29, 2007"}, {"Title": "Great camera!", "Author": "L. Smith", "ReviewID": "R2WI1A55I3I0V", "Overall": "5.0", "Content": "I love this camera!  It does more than I have needed to do so far.  It's easy to operate and takes great pictures.  I haven't used it for video or panoramic shots other than to try out the options but they worked great when I tested them. I would recommend this camera as an easy camera to work with.", "Date": "January 30, 2007"}, {"Title": "Burns batteries better than a bonfire", "Author": "The Knave", "ReviewID": "R1YXSC18ITLUT1", "Overall": "1.0", "Content": "I have owned this camera for about 18 months and have been buying Kodak products for 50 years.  Never again.  Battery live was marginal when the camera was new.  Now, the camera shuts down after two or three pictures, even with new batteries or newly charged batteries.  If you buy this camera, you will likely regret it.  Kodak should have recalled these because the battery problem is rampant.  I wrote to Kodak and, based on the response, I would say that Kodak just doesn't care.", "Date": "July 2, 2009"}, {"Title": "Everything I could possibly want in a camera", "Author": "ChildInside", "ReviewID": "R3EL0B39V54PTI", "Overall": "4.0", "Content": "As a preface, before I came to own the Kodak C875, my primary camera of choice were two things: (1) A $5 digital camera I purchased off of eBay and (2)my cell phone. Needless to say, both were terrible for taking pictures, not simply because of picture quality, but because of lack of good flash, and not enough MP (I like high resolution pictures).So I eventually decided I needed a dedicated camera. Admittedly, I eventually decided upon the Kodak C875 due to good reviews, brand name, price, and significantly because it was 8MP (at a time when 10-12MP was extremely high end). However, I am happy to say that, after two years of ownership, I have never been disappointed by this camera.To begin, one of the best things I like about this camera is simply how simple it is to use. Most of the features of the cameras can be used simply by turning the mode know on the top, flash is handled by a button to the left of that while another button is for the timer. All of this makes it easy to take photos. If you want to take a quick photo, you turn it to 'On' and the smart settings will help you take the best possible photograph. On the other hand, 'SCN' (Scene) will help you determine the best type of photograph in a certain setting (Night, sports game, close up, etc) or, if you know how, you can simply take over by using manual.Some of the most impressive things about the cameras are the LCD screen, the ability to take panoramic pictures, and the ability to edit pictures within the cameras. The LCD is great because it makes taking pictures just a whole lot easier (especially since it's so large); personally, I never really liked the viewfinder on cameras much, so this was a big plus for me. Secondly, the ability to take panoramic photographs is highly impressive, and just an overall great thing to have on a camera that is supposed to be point and shoot. Lastly, while I never used it myself, I do appreciate the ability to do things such as sort pictures (date, album, slideshow, etc), and the ability to enhance or crop pictures right within the camera.However, I've been going on too long about the technical aspects. The big question is what is the quality of the pictures? 'Excellent' is the word I would use. The quality is very clear and is well able to capture all the details within the photograph. Colors are vibrant and accurate; flash is bright enough to illuminate most dark areas I try to photograph. Overall, the photographs are just really high quality.Ultimately, for those who may be looking for a point and shoot camera, it really is difficult to go wrong with the Kodak C875. It is simple to use, filled with features, it uses standard SD cards (meaning cheap memory!), and it takes high quality photographs. Really, what more could a person ask for?", "Date": "October 1, 2008"}, {"Title": "Bad Flash", "Author": "Disappointed", "ReviewID": "R1EYUMGZP89L6G", "Overall": "1.0", "Content": "After a little over a year of use (warrenty expired) the flash no longer works.  Kodak customer service indicates repair will be approximately $150.  This camera seems to be little more than a very nice \"disposable\" product.", "Date": "April 19, 2008"}, {"Title": "BEWARE of poor quality camera and poor Kodak support!", "Author": "Sarah", "ReviewID": "R214OAYIXOV20S", "Overall": "1.0", "Content": "I received this camera as a Christmas gift last year, and the flash stopped working on Christmas day this year.  Kodak warranty is 1 year, so they told me it will be $140 to fix it!  I can buy a new camera for that.  My sister-in-law also owns this camera and had to send it in twice under warranty, and it's never been quite right since then.", "Date": "January 6, 2008"}, {"Title": "Great pictures when you can actually capture them", "Author": "Adam", "ReviewID": "R3UFAZCCW54FMM", "Overall": "3.0", "Content": "This overall is a pretty good camera.  It's a point & shoot so you can't expect too much.Pros:  - Price  - Size is very manageable  - Manual FeaturesCons:  - Battery life is horrific  - Seems to overcompensate the shutter speed on Auto.  It often fires the flash even in bright sun.  If I turn the flash off it greatly over compensates with a long shutter lag.  For a point & shoot it should be better about this.  - No viewfinder", "Date": "October 3, 2007"}, {"Title": "Super great kodak digital camera----", "Author": "David R. Rogers", "ReviewID": "R3J969O1GBL2LQ", "Overall": "5.0", "Content": "I love it. easy to use , easy to work with in every area--You will love this little camera-It is my second Kodak and is so nice--Great buy.", "Date": "March 26, 2007"}, {"Title": "THE BEST DIGITAL CAM.", "Author": "Mohd Adnan El Habash \"habbash911\"", "ReviewID": "R2Q1WKG7E7W5YF", "Overall": "5.0", "Content": "VERY NICE AND EASY TO USE, HIGH RESOLUTION PICTURES, WITH USER-FRIENDLY SOFTWARE THAT YOU CAN BURN CD/DVD, SEND EMAIL, EDIT YOUR FOTOS AND MANY MANY FEATURES.", "Date": "February 17, 2007"}, {"Title": "love it", "Author": "brandi \"familyof4\"", "ReviewID": "R3I83WOM7AVSLD", "Overall": "5.0", "Content": "i received this camera from my husband as a christmas present. as i was going through the manual, looking at the different settings, i zoomed in on a picture frame across the room (a better zoom was one of the reasons i wanted a new camera) as i reviewed the picture i had taken it was absolutely perfect. this is the 3rd kodak easy share i have owned, i love how easy the software is to install,cropping, color changing, and other features the software offers.", "Date": "January 15, 2007"}, {"Title": "Good Camera with Issues", "Author": "L. Etzel", "ReviewID": "R1SOHITDAGCJ3D", "Overall": "3.0", "Content": "Not a complete fan - takes good pictures but it gets hung up sometimes trying to open/close the shutter and just blinks. I pop open the battery door and it quickly resets. Also it seems to try and overcorrect the lighting at times. I had and older LS model for 4+ years that I preferred. Definitely invest in the dock and rechargeable battery.", "Date": "January 9, 2007"}, {"Title": "Excellent, I can't believe it's this good", "Author": "Carlos N. Rautenberg", "ReviewID": "R6I2P4692E39A", "Overall": "5.0", "Content": "The camera is amazing, it is always fast, the definition of the pictures does not depend on light conditions, the amount of features is large! such as landscape or portrait and they work perfectly.I took like 400 pictures with my girlfriend and not even one came out blurry. There's a feature to take objects in motion that is amazing!.I'm thinking if there is something that I don't like of the camera, and the only thing I came out with is that it dows not include a bag or a case. I think that is a flaw, but everything else is amazing.", "Date": "February 17, 2007"}, {"Title": "Use sensitive", "Author": "C. Maine", "ReviewID": "R2XDUBQ2VFT17V", "Overall": "5.0", "Content": "I think many people are not aware that cameras are use sensitive.  Ask yourself:  What do I want to use this camera for?  Purchase a quality camera at the best price based on that decision.Parents are complaining about using this to take photographs of plays and such in low light; I would use a SLR camera for such events-- or at least a camera with a better lens.If you want to take convenient yet quality photos of your children--a purse camera--this camera is perfect.My sister bought this camera for Christmas and I used it.  My husband always buys very nice (and expensive) cameras; however, I have been reluctant to use his often as I need a purse camera. I don't like the idea of chunking $400 or more into my purse and getting it all beat up. I think this camera can deliver the same quality as his cameras for a lower price.  So I plan to buy one.Decide what you want to use the camera for.  There is no \"perfect\" camera for every event.  Some events are spontaneous and need convenience.  Some need preparation--and planning--larger cameras/lenses are acceptable then.Happy picture taking!", "Date": "January 7, 2007"}, {"Title": "Hate it, very limited, biggest regret!", "Author": "1cscheid \"rtscas\"", "ReviewID": "R3UAK9TW8933KU", "Overall": "1.0", "Content": "At first I was excited to own this Kodak -- I mean Kodak, the best brand!Oh, boy was I wrong.If I want to send pictures it has to be done through the Kodak photo album and you have to send the invitation to friends.* I was used to my Cannon downloading on my Windows and I could send pics on their own or send them as files.With this one, it has to be downloaded through Kodak.**When you do film, you don't have to option of downloading it to windows so that you can edit, and make your own film and add clips from other video taping.  What you shoot is what you get, no editing capabilities.**If you tape and it takes a lot of space, Kodak will tell you it is too big to send -- once again having to download only through Kodak and can only be sent as a Kodak invitation -- so what is the point of being able to buy a memory card, when you can't send your video clip if it is too big.I had ordered it for my son, who likes to record with the camera and then put clips together but as I mentioned earlier, you cannot add clips together and edit them to make your own video clip.**YOU MUST put it on the case, my son made the mistake of taking it by itself w/o the case, putting it in an inside pocket of his backpack and damaging the LCD screen, we can't see what we shoot.They need to include another way of viewing what you shoot or tape b/c your only way of seeing what you shoot is through the LCD screen no other way. NO OPTICAL VIEWFINDER!! BIG FRUSTRATION! So now I have to buy a new camera, and I only had it for 2 months!The same thing happened with the same brand of camera to a friend of mine who went to Iraq, his camera LCD got damaged the same way, you can't shoot what you can't see!  U can't take pics, unless you guess.I'm most def going back to Cannon b/c their LCD's are protected w/a plastic peace and you do have an Optical Viewfinder.Yup, it is a battery sucker!  They must be new if not it shuts down on you, thank God, I bought rechargeable batteries.THIS CAMERA IS MY BIGGEST REGRET!!!!", "Date": "September 4, 2007"}, {"Title": "Great point-and-shoot for the price.", "Author": "UltraCody", "ReviewID": "RU362Q4OI5CSN", "Overall": "4.0", "Content": "I've had a good amount of experience with cameras. I've owned 4 Samsung point-and-shoot cameras in the last few years. They took pretty decent pictures. The first 3 cameras (Samsung SL620 12.2 MP Digital Camera with 5x Dual Image Stabilized Zoom and 3.0 inch LCD (Black), 2x Samsung SL820 12MP Digital Camera with 5x Wide Angle Dual Image Stabilized Zoom and 3.0 inch LCD (Black)) had 12 megapixels and the 4th one (Samsung TL240 - Digital camera - compact - 14.2 Mpix - optical zoom: 7 x - supported memory: microSD, microSDHC - gray) had 14 megapixels. They all had small sensors (1/2.3\") and the pictures were usable, but not that detailed. After having them all breaking on me one by one, I had to borrow my photography teacher's Nikon D40. I've never used an SLR before. It took way better pictures than my 4 Samsung cameras, even though it was only 6 megapixels. I figured it out pretty quick. Anyway I was gonna wait until I got a job this summer to get the new Nikon D5100 16.2MP CMOS Digital SLR Camera with 18-55mm f/3.5-5.6 AF-S DX VR Nikkor Zoom Lens, and my older sister surprised me with this camera. Considering the fact that it came out like 5 years ago, it took much better quality pictures than my Samsung cameras thanks to its bigger 1/1.8\" sensor. This camera has some manual controls that my other cameras didn't. There's one thing about this camera I don't like. The flash is too bright and I can't adjust it. My face is literally white whenever I take a picture of myself. One thing I'm gonna miss is the HD video that my last 3 Samsung cameras had. I'm still planning on getting that Nikon D5100 for my advanced photography and HD video and using this camera as my point-and-shoot that I can take anywhere.", "Date": "April 28, 2011"}, {"Title": "Great Camera. Great Pictures. Kodak #1", "Author": "Bruce C", "ReviewID": "R281U8QHPSJTBF", "Overall": "4.0", "Content": "I purchased this new from staples back in 2007.  Worked flawlessly on a trip to FL. Still good all the way in 2009.  Will use about 3 sets of batteries in a day of heavy picture taking(about the same as any other camera.  The screen is a little hard to see in bright light, but takes excellent photos.  Used a Cannon SLR 8 MP this camera compares in image quality to the Cannon without all the hassle/size.  Great camera don't listen to the bad reviews.", "Date": "September 19, 2009"}, {"Title": "Kodak Easyshare C875 8mp 5 dig zoom", "Author": "yelmight", "ReviewID": "R1664STJUQZHV4", "Overall": "1.0", "Content": "I purchase the Easyshare C875 about 9 months ago and I have had nothing but problems with it since the very first day that I started to take pictures. The problem is that this camera goes through a set batteries with every 5 or 6 pictures. I tried every single battery recommended by Kodak and got the very same results. I was going to trash it but I did pay 185 dollars for it when I bought it so I thought it would be to my advantage to give Kodak an opportunity to repair the camera. Kodak Tech support said that the camera was repairable free of cost if I could provide my receipt with the date of purchase, if not then I would have to pay to get it repaired and also for shipping. Since the camera has never worked properly from the onset I could not imagine that putting another 100 dollars or more into the camera would be the most prudent thing to do. Instead of spending more money on this piece of crap, I would rather spend it on another Canon Power shot or Sony cyber shot. A word of caution the Easy share camera will eat up batteries faster than you can buy them. Please don't waste your hard earned money on such an inferior product. I read similar reviews of this camera on this web site and on epinions and I did not pay attention to them now I regret having done so. Be kind to yourself and stay away from the Kodak Easy share series like the C875 it promises a lot and delivers nothing. A complete waste of my money and I thought I got a good deal. Live and learn......", "Date": "February 6, 2009"}, {"Title": "Flash gone bust", "Author": "A. K. Kaw \"AKK\"", "ReviewID": "R2CBJD1SLZ3NHB", "Overall": "2.0", "Content": "Just after two years of use, the flash is gone bust. It is no use to get it repaired as you can get a canon powershot for less than the cost of repair.  So no more KODAK products for me.", "Date": "January 2, 2009"}, {"Title": "Nice pictures shutting down can be an issue.", "Author": "T. Malitis \"wolfgang-1\"", "ReviewID": "R2K7UW5HNMI4YD", "Overall": "4.0", "Content": "This camera takes great pictures. It also has easy to use menus that novice camera users can understand.  The 5x zoom is a great bonus on the camera.  The reason for 4 stars instead of 5 is because when camera battery gets low it will shut down even though there is power still in the batteries.  I would recommend getting Kodax rechargable batteries to deal with this problem.  It has been helpful for myself.", "Date": "December 26, 2007"}, {"Title": "Love it!", "Author": "K. A. BUTLER", "ReviewID": "R3OIJ6G6219N8T", "Overall": "5.0", "Content": "I went from a cannon to this, and I love this camera.  Out of the box, easy to use, nice pics.I have bought two other Kodaks as gifts, same easy to use.", "Date": "February 15, 2007"}, {"Title": "Kodak C875", "Author": "Helmut L. Seufert \"hellie\"", "ReviewID": "R23LHD51QQ2RI6", "Overall": "5.0", "Content": "Lots of great features packed into the C875. I am very pleased to have such a nice camera in this small package.", "Date": "January 18, 2007"}, {"Title": "awesome", "Author": "precious girl \"Precious\"", "ReviewID": "R1BXWSH1EULUVC", "Overall": "5.0", "Content": "this camera is my first, but i have borrowed all of my families and friends cameras and mine is the best. i definately recommend this camera to anyone. its easy to use and fun.", "Date": "January 18, 2007"}, {"Title": "Great camera", "Author": "L. Lee \"Lee\"", "ReviewID": "R2V6XOA9Y0UM3I", "Overall": "5.0", "Content": "This is the 3rd digital camera I have owned and by far the best.  The pictures are clear and the use of the camera is the easiest I have used.", "Date": "January 16, 2007"}, {"Title": "Love this camera", "Author": "M. Bose", "ReviewID": "R2UZ6O3O6PYS6D", "Overall": "5.0", "Content": "I bought this camera because I was unhappy with my 3.5 megapixel one that produced grainy pictures. I am so happy I did. The C875 is very easy to use (even for a beginner like me) and produces crisp, superb photos. You can take one photo after another without having to wait too long between shots. I recently shared my pics when I got back from a vacation and I got a lot of comments about how clear and sharp the pictures were and how vibrant the colors were. I can't believe that I got such a great camera for under $200.", "Date": "March 26, 2007"}, {"Title": "batteries", "Author": "Sterling Barclay", "ReviewID": "R3E7QEG1EJY6YQ", "Overall": "2.0", "Content": "The batteries for this product do not seem to hold up.  I don't know how it compares with other digital cameras but we are having a hard time getting us to this one.", "Date": "March 8, 2007"}, {"Title": "Kodak C875 Camera", "Author": "Ashley", "ReviewID": "R2MFFDGELRBNAK", "Overall": "5.0", "Content": "I LOVE this camera!  It is very easy to use and has LOTS of great features!  It takes great pictures!", "Date": "February 22, 2007"}, {"Title": "OK Camera, if you are ready to adjust the modes", "Author": "Goven \"Good Buyer\"", "ReviewID": "R35EB00FOMWKSN", "Overall": "3.0", "Content": "I bought this camera to take pictures of my daughter. And I tried extensively for over 9 days and then returned it.Here is my take,- You can not simply use the auto mode. Believe me. It sucks. I tried over 100 pictures in auto mode in different conditions, the good pictures are less than 15-20.- You can take nice pictures if you know what mode to select bsed on lighting and environment. But it is a hassle. When you try to take shots, you want it to be done quickly. You do not have time to analyze and pick the best mode in 20+ modes.- The loading into computer and zoom are nice.So if you are trying to take pictures mainly of adults and places, it may be a good camera, but not for kids or on the moment shots.Good luck", "Date": "December 9, 2006"}, {"Title": "Great Features, but dark picks horrible software", "Author": "J. Wagers \"parentreview.net\"", "ReviewID": "RGRP52TBWEQMC", "Overall": "1.0", "Content": "We bought this camera, we figured an 8mp for the price was too good to be true.  We were right!  My husband was dazzled with the zoom and the featues, The first night we were taking pictures in our house and they came out pretty well.  The second night was my daughters winter recital. We could not get the pics to lighten enough to see anything. It was in a fairly well lit gymnasium too. We tried the auto scene, tried all the different scenes setting, adjusted all the settings, but no even with the flash we didn't get a single decent pic.  And I am not choosy I am more than happy with the pics I get from my 6 year old Fugi 1.3 Finepix1300.  I also do know how to use the camera.  The photo software included is all but useless, the redeye auto setting could not dectet the redeye, and the \"manual\" couldn't find it to fix it either.  Oh wait there shouldn't be any redeye with this camera anyways, but there is.  On closeups I can eliminate it, but too far away and it's there.  I was very dissapointed and the camera gets returned tommorrow.", "Date": "December 15, 2006"}, {"Title": "Easy and Fun", "Author": "Thomas W. Godfrey \"Long Rider\"", "ReviewID": "RW56WONUK0H2G", "Overall": "5.0", "Content": "This camera has made picture taking easy and fun again.  The only thing missing is a case/carrier.", "Date": "March 27, 2007"}, {"Title": "digital camera", "Author": "Gary L. Moss", "ReviewID": "R2VBTA8X361QYX", "Overall": "4.0", "Content": "For the price, an excellent camera. Anti-shake would be the only improvement for this price range.", "Date": "March 15, 2007"}, {"Title": "Kodak easyshare c875", "Author": "M. Conrad", "ReviewID": "R39L6Z9HGTDV3P", "Overall": "5.0", "Content": "This camera is far better then expected for the money.It takes great pictures ...I also love the fact it can take pictures automatically or be tweaked to your own specs.I couldn't be happier.", "Date": "March 15, 2007"}, {"Title": "Excellent Buy", "Author": "Neal Hambright", "ReviewID": "RFBVIREV0YWX6", "Overall": "5.0", "Content": "This camera is en excellent camera for the money. You will not go wrong!", "Date": "March 12, 2007"}, {"Title": "great upgrade", "Author": "Barbara A. Redfearn \"gamma2carly\"", "ReviewID": "RGA4J842G5YGS", "Overall": "4.0", "Content": "I got this camera for Christmas. An upgrade from Kodak 3.1 MP camera. The main problem I had with previous camera was it had a separate lens cap that did not stay on unless I secured it with rubber band. This camera has internal lens cap. I also wanted a higher MP since I take a lot of pictures of my grandchild and tend to do a lot of cropping. I enjoy the various \"scene\" choices I have. Currently I've only used the camera for Christmas and inside pictures. Am looking forward to using it on my Alaska cruise in June. My husband is not great at taking pictures, so I will give him my old one for the cruise.", "Date": "January 9, 2007"}, {"Title": "SCATTERED BUTTONS", "Author": null, "ReviewID": "R3JYY8117QHKRM", "Overall": "4.0", "Content": "Overall I'm please with the results from the camera.  I easily switched from a \"viewfinder\" peraon to display viewer. There is some difficulty with wash-out in bright back light.  A hood would help.  My main complaint isthe scattered option buttons. The flash, delete, data, menu, and review buttons could have all been combined ina toggle button right next to the current toggle and made fumbling less irritating.  As for the remaining buttonsput them on the back in thumb's reach", "Date": "January 4, 2007"}, {"Title": "The C875 is the best camera coming and going. Too bad it is out of production.", "Author": "Amazon Customer", "ReviewID": "R1JNJ3YQ0EWN6D", "Overall": "5.0", "Content": "This is the best camera made. This is my second one. I had the first one forever. It started smoking after I took a picture. So I ordered another. This is a great camera...easy to work. It is limited but hey you don't really need 14 mega pixals. It has eight mega pixals which is still wonderful for cropping. I can get more than three great pictures from one eight mega pixal image. Plus the SD card is limited to one gigabyte...so it is small, but hey it is fast. And after a hundred images, you are gonna download them and reformat the memory card anyway, right? and zoom...five times is plenty of optical plus another two times for digital. Man I can take pictures of a license plate two blocks away. And it readable. It takes lithium batteries that just seem to last forever. Kodak makes it and it might not get a lot of promo...but really now, this is one great camera...especially now as it is no longer made so used ones sell cheap.  The camera body is metal and it feels strong not like some cameras that still have that pepsi can feel.", "Date": "November 14, 2013"}, {"Title": "Gift", "Author": "Melanie", "ReviewID": "R1A4DJKFXUVVL2", "Overall": "4.0", "Content": "Made a great gift but now we are having problems formatting a memory card to it. Arrived ontime just a little bummed out.", "Date": "March 4, 2013"}, {"Title": "Good little Camera", "Author": "freebirdandfloyd", "ReviewID": "RDRNKLRVIKVTR", "Overall": "4.0", "Content": "I bought this for my sons trip and he loves it. It takes a while to learn. When we bought it there was no cd or instructions with it, although I believed there would be. I was disappointed at first but like it overall. The two things I do not like are 1. It can only take a 2 Gigabyte card max. @. You have to reset the date every time when you change the batteries. Its not hard to do but does get old. It was very inexpensive, and overall  a good little camera.", "Date": "November 16, 2012"}, {"Title": "Good Camera", "Author": "J. Knight", "ReviewID": "RDVSZNZECM95Q", "Overall": "3.0", "Content": "Was a so so camera. Had to send it back to Kodak and they completely rebuilt it for me. Now it works fine and I am happy with it.", "Date": "September 25, 2011"}, {"Title": "Buy lots of batteries", "Author": "Justin Fortney", "ReviewID": "R1APHC3KJEDGXI", "Overall": "1.0", "Content": "The camera is fine, but a little big (thick).  The picture quality is good but it takes poor pictures in low light situations compared to other cameras.The worst thing about the camera is it is very picky about batteries.  New cheap batteries will usually not allow it to be tuned on; expensive disposable Energizer E2 and Kodak batteries will get you about 30 pictures.  After the camera go's dead with them you can use the \"dead\" batteries in other cameras for 200 more pictures. Kodak Ni-MH rechargeable last a little less, but can be recharged, but after a year they won't last for more than 5 pictures.  We don't use many features, we don't review pictures, and we turn the camera off as soon as it is not in use.After owning the camera for 2 months we sent it into Kodak because we were convinced there was a malfunction causing battery consumption.  They sent it back with a form letter saying it work properly and to only us Kodak batteries.  I guess they make their money off of selling tons of batteries for crappy cameras.We cannot wait until it breaks so we can justify buying a new non-Kodak camera.", "Date": "June 30, 2010"}, {"Title": "kodak c875", "Author": "William J. Morrow \"J. Morrow\"", "ReviewID": "REQHRUUHBJO4G", "Overall": "4.0", "Content": "I already had a C875 and wanted another to make stereo (3D) pictures with.  I take 2 pictures at one time and mount them to have a 3-D picure. It works great.  It's a little hard on batteries but I already knew that.  The purchase of an AC adapter has helped that though when I use it for reviewing pictures etc.", "Date": "March 20, 2010"}, {"Title": "Good camera and good business.....", "Author": "Erzsike", "ReviewID": "R1OQAIZWPUHHAZ", "Overall": "4.0", "Content": "This is my second Kodak C875. The first one I purchased new from online and it broke 2 years after the purchase. I think it should have lasted a lot more since I took good care of it and at the time of the purchase it was quite expensive. Having all the gadgets and printer dock already from the first camera I decided to purchase an identical, even though the life-span of the first one wasn't too great. This second camera through Amazon was a used one but in good condition and for a fair price, so I am happy with it and hope it will last longer than the first one. The shipping was timely as well.  The quality of the pictures was excellent on both, that was another factor in chosing the same again.", "Date": "January 18, 2009"}, {"Title": "One GREAT camera for the price!", "Author": "Daniel Nebab", "ReviewID": "R2FJS6SPD4SQZV", "Overall": "5.0", "Content": "The Kodak C875 was one of my best purchases. The zoom is GREAT. I was able to zoom in VERY close to far subjects for great candid portraits. I absolutely love the panoramic feature, and how it auto stitches the pictures together w/o extra software. The screen is huge, but seem to lack in quality. It's a bit pixel-y but the pictures come out fine. This camera is packed with awesome features and is good for even the professional photographer. The videos taken on this are very good quality and worked great when video blogging while I was snowboarding 6,000 ft up in the air- usually the batteries are too cold and the camera is too cold to operate, but i kept my camera in my pocket, so it worked fine. The macro feature is a little stingy though, you can only get up to 3-4 inches close to the subject. The auto focus is green- it looks cool! The shutter speeds are pretty adequate- between 8 sec and 1/1600 sec. The Perfect Touch editing is GREAT! It really fixed my photos in a way I never though of doing! The cropping is a real life saver as well!Pros:- large 2.5in screen- 5x optical with 5x digital zoom (up to 25x total zoom!)- video is great, very clear- panoramic- auto stitch feature- built in memory- though not much a mere 32mb- great shutter speed- 8-1/1600 sec- awesome in-camera Perfect Touch and Cropping editing featuresCons:- pixel-ish LCD display- stingy 3-4 inch macro- burst mode- only saves a few of the pictures (for both modes)", "Date": "January 18, 2009"}, {"Title": "Kodak C875 bluish LCD and bad service from [..]", "Author": "Christine M. Wiste", "ReviewID": "RY9JKF8YFBZIZ", "Overall": "1.0", "Content": "I bought this for my daughter about a month and 1/2 before her birthday.  She tried it out and showed me the bluish LCD, so I hunted for settings and nothing fixed it.  I returned it and they sent it back to me, because it was past the 30 days. So DONT buy form [..] if it is for a gift.Then I called for repair under warranty, sent it in again, it was returned to me in the same condition. So I called Kodak again and asked them if this is way the Kodak 875 camera was sold and she assured me that Kodak woudlnt sell a camera with a bluish LCD and so I sent it in again, it came back with the same bluish LCD and still produced faded photos.I am not sending it in again, I'm throwing it, I already spent 1/3 of the camera price on shipping it to them. I can't sell it on Ebay, as I wouldnt trick people into buying a camera with a bluish LCD and bad quality photos. I thought [..] would be a safe online purchase. It is poor business  and not smart, as I buy about 3 cameras a year updating my SLR, my medium sized camera and my pocket sized camera often. Also, my daughter wanted a C from Kodak because she liked her other 3 that she had before.  Needless to say, I will not be buying a Kodak camera every again. It's too bad, because this camera was responsive, fast shot to shot and nice extra zoom.  Kodak EasyShare C875 8MP Digital Camera with 5x Optical Zoom", "Date": "January 17, 2009"}, {"Title": "Excellent", "Author": "Zack Johnson", "ReviewID": "R2KSZQ8GPMHTI8", "Overall": "5.0", "Content": "Item was received even quicker than expected and was in great condition. Great working with this seller.", "Date": "January 11, 2009"}, {"Title": "salesman for kodak hanging around in circuit city talked me into it", "Author": "Rhonda Pedigo \"pedigo 85\"", "ReviewID": "R2BMJ8YWRQ0S79", "Overall": "1.0", "Content": "lasted less than a year and the lcd went crazy on me. if you cant see where it is aimed it is useless. takes way too long between pictures also.", "Date": "November 26, 2008"}, {"Title": "C875 Not Recommended", "Author": "WPITES", "ReviewID": "R1VHF1GIM5U235", "Overall": "1.0", "Content": "We have had this camera for a year. I have taken more than 1000 personal and business pictures with it. In short, the Kodak Easyshare C875 is very disappointing. My suggestion, based on my experience - Spend your money elsewhere on a non-Kokak product!The C875 is disappointing for at least four reasons. First, the auto-focus seldom works properly. This is true regardless of subject, lighting or camera settings. I've tried them all. Nothing works. I now take at least five pictures of a subject in the hope that at least one picture will be properly focused. (Camera on a tripod, good light, still subject. Four out of five are out-of-focus.) Second, the system eats batteries. Take a dozen pictures, store the camera for a week or two and the batteries will be dead or almost dead. Third, neither the auto mode nor the many \"special\" modes handle lighting properly. Again, I have learned to take multiple pictures of a subject in the hope that at least one will be properly exposed or will be close enough that photo software can correct the remaining exposure problems. Forth, speed is slow, slow, slow. Forget using the camera for anything that moves or is in anything less than brightest sunlight. The shutter delay is both long and unpredictable. Also, the camera takes three to six seconds to recover after each shot. Again, based on this experience, look at something other than the C875.My Background: First SLR - 1974. Owned five other SLR's through the 90's. Have three digital cameras including this C875.", "Date": "June 26, 2008"}, {"Title": "would not recommend", "Author": "M. Abbott", "ReviewID": "R2OGWA8EJ5OQPM", "Overall": "1.0", "Content": "I bought this camera in July of 2007 and practically from day one I was looking for another camera.  The majority of my shots were blurry (granted I was taking pix of my kids but still) and low light pictures were HORRIBLE, and forget using the zoom the pictures turned out blurry and out of focus over half the time.  I constantly was having to \"touch up\" my photos- I got sick of it and replaced it by Christmas.  I used to be a huge Kodak fan until I got this camera.  Trust me, there are many, many better ones out there- keep looking!  Hope this helps!", "Date": "March 4, 2008"}, {"Title": "Awesome camera!!!!!!!", "Author": "tracyrme2 \"Tracy\"", "ReviewID": "R113V9W9XP076P", "Overall": "5.0", "Content": "I love my camera.I bought this camera a couple of months ago. I havent found but 2 things I don't like about it..It doesnt have a view finder..and it uses batteries a good bit..but It has a 2.5\" LCD screen and I bought a battery charger and rechargable batteries..So now i'm happy..This is an excellent camera for the price..You get a 8 MP camera with 5 X optical zoom.It has lots of great features..It also fits perfectly in your hand..I would definitely recommend this camera to anyone. It is easy to use..", "Date": "May 7, 2007"}, {"Title": "Solid camera", "Author": "Kate", "ReviewID": "R13NWFQT5214EY", "Overall": "5.0", "Content": "5 stars...easy to use. The screen is large and clear. The automatic settings include a variety of scene selections (ie beach, party, fireworks scenes).  I have yet to use the video, so I cannot comment on that. I think this is a great all-around camera, and it fits in the smallest purses...big plus.  The screen has yet to get scratched in all my purse juggling.My only complaint would be in the shipping.  I paid extra to expedite my order since I was leaving the country a few days later. It was sent via UPS with a signature \"in person\" required.  When I missed UPS the first time, I was unable to just sign the paper and leave it on my door.  I had to contact UPS to find out when they would return so I could sign in person, which was an ordeal.  I wish I would've known that the camera was being sent this way.  I would've requested that no signature be required.", "Date": "March 29, 2007"}, {"Title": "Think Twice", "Author": "J. BEAM", "ReviewID": "R129RFVSDRQFUH", "Overall": "3.0", "Content": "I previously bought the C330 Kodak in addition to using my 35mm camera, since I didn't always want to lug around all the lenses etc. The C330 takes excellent pictures for a 4 meg. pixel camera. Also the 330 came with a good user manual. The C875 does not come with any manual of any use, just a little booklet. When I contacted Kodak why they didn't include a manual, they told Me it was to save paper and the environment.Well, Duh! that's because they print it in 12 different languages. If they printed it in just English they would save literally tons of paper.Also, as most reviews suggest the batteries burn up in no time, I could understand if the camera recycled faster, meaning the time you have to wait before you can take the next picture. The Canon camera I am now going to purchase takes 4 aa batteries but it recycles in no time and the batteries last much longer. (I borrowed my friends camera.) My advice is to think twice and try a couple other cameras, a few extra bucks goes a long way and you won't wind up buying another camera.", "Date": "February 21, 2007"}, {"Title": "Research", "Author": "C. G. Archer \"Read More Books\"", "ReviewID": "R13RRCTDPIPGPZ", "Overall": "4.0", "Content": "Research the type of camera you think is right for you. There are obviously many different kinds of cameras for many different kinds of people. The Kodak C875 is the first camera that I have purchased. Because I have never bought a camera before now, I researched extensively the many brands and models. I began with price as the first qualifier in my narrowing of the many options. I did not want to spend over $200 for a camera, so I was easily able to eliminate many brands immediately. Fuji, Canon, and other similar brands were eliminated simply because of the price of a decent 6 megapixel camera, which is all I determined I would need. I found cameras with more options and better selections from brands like Kodak and Olympus.Basically, I deceded to get this camera above all others because the low price coupled with the advantages over other cameras in its price range. I did not intend to buy an 8 megapixel camera or one with a 5x zoom, but was able to do so because of the low price. Most other cameras in this price range offered 6 megapixels and a 3x zoom. I received the camera, and enjoy its functionality and design. It is very easy to use, has more features than I will need, and is of good quality as expected from Kodak.Pros:-More for your money (8 megapixels, 5x zoom)-Easy to use-Quality construction, durable-Takes pictures quickly (some cameras I tested seemed to have a slight  delay between pressing the shutter button and taking the picture)-21 scene selections-Large screen-Functional designCons:-No viewfinder (I would never use it if it had one)-Takes AA instead of the integrated lithium ion (It can use rechargable AA's if you prefer)-Somewhat difficult to take clear pictures when the flash is off (You must hold the camera very steady)", "Date": "January 17, 2007"}, {"Title": "not worth it", "Author": "Christopher M. Otis", "ReviewID": "R3I3DVRPLOXNCJ", "Overall": "2.0", "Content": "I bought this camera  6 or 7 months ago it took great pics and we were enjoying it but then the zoom stoped working right before we went on vacation and had to buy another one we replaced it with a non kodak camera", "Date": "June 17, 2007"}, {"Title": "D-camera", "Author": "L. Martz", "ReviewID": "R1RJX96GGPJ3VB", "Overall": "4.0", "Content": "I'm having good success with the camera.  Because of my inexperience as a photographer I probably should have chosen one with a view finder.  Other than that I am getting some good shots, it is easy to operate and to understand the functions.", "Date": "June 1, 2007"}, {"Title": "Wasn't what we ordered but.....", "Author": "Harlin C. Oakes", "ReviewID": "R264O0YM66X5E0", "Overall": "5.0", "Content": "When our camera arrived it wasn't the model we had ordered but after calling the sender we were told they had been given the wrong information from Amazon and was already aware of the error. We were about to leave the country and did not havd time to exchange the camera for the correct model. We were given a small credit as we went from an eight MP to a 6 MP. It does a wonderful job so far. The pictures are great.", "Date": "February 8, 2007"}, {"Title": "Happy Photos", "Author": "Evelyn Regan", "ReviewID": "R2UTYY7LFINRBB", "Overall": "5.0", "Content": "Had the Kodak EasyShare C875 highly recommended.  Purchased and am so happy with easy use of camera and support from Kodak.  I would also recommend this camera to anyone who is looking for a new camera.", "Date": "August 3, 2007"}, {"Title": "Excellent purchse", "Author": "Sabaw H. Lat", "ReviewID": "R1P9BWQC4P91S", "Overall": "4.0", "Content": "It is easy to use and the picture quality is sharp and very good so far. I tried video recording with 2GB sd card which I purchased it together and it worked excellent so far. I recommend this to anyone. And the price, you can't beat it.", "Date": "March 26, 2007"}, {"Title": "Terrible instructions, an incomplete package", "Author": "K. Wynn \"be real\"", "ReviewID": "R1BOXM2NI6Z4ZQ", "Overall": "2.0", "Content": "Camera working well, but don't expect any help from the very vague and non-descriptive instructions.  Pretty much all they tell you is the parts of the camera, beyond that you are on your own.  I'm not talking about advanced photography techniques.  Even information about how to manuever between screens and navigate through the menu is missing.  There is incomplete text written about how to even use some of the buttons.  And if you were thinking of buying a particular battery for this camera - good luck figuring it out from the manual.  You basically have to go to their website or a camera store to even figure out what batteries will work with this camera.  Oh, and by the way, don't plan any special use for this camera right out of the box, because without env warning you, Kodak decided not to even put a battery charger in this one.  I'm not sure if they have decided this for all their models, but I have even less expensive and sophisticated cameras from other manufacturers that at least have a charger in the box.  This was an insult to buy a camera that is supposed to be easier to use and has more megapixels, only to find that you have to go searching for more instructions, get help from stores on how to use it, and buy equipment just to keep it functioning.  Yeah, now after all that aggravation, it is becoming easier to use, but I have had much better experience with Panasonics and Canons.  Their literature is written at a more in depth and intuitive level, and they aren't so cheap as to not even put a charger in the box.  If Kodak was going to pull this unethical stunt, they could have at least have been professional to put inform people in the ad, or even tell them in the book.  I bought this camera as a gift for my mom and she kept looking for things that simply weren't there.  I thought I was helping her out, but in turn it caused a lot of undue stress.  Should have just gone with a company that had already proven themselves to me in the digital camera business instead of being lured by a inticing sales price.  There are not extras in this camera past perhaps getting a great deal on what you initially pay for it.", "Date": "January 15, 2007"}, {"Title": "Does it come in pink?", "Author": "Melissa Machleid", "ReviewID": "R3IKTLMJ8M03BO", "Overall": "5.0", "Content": "I like that it does not bother with a view finder.  The symbols on the camera are intuitive and there is a movie feature.  Sharing photos is very easy.  I originally saw an add in Parenting magazine previewing and recommending this camera but it was shown in pink.  Silver only was offered on Amazon.  That's my only disappointment.", "Date": "May 30, 2007"}, {"Title": "JUNK!!!", "Author": "HiredGun#28", "ReviewID": "R2SMHP93ZJM277", "Overall": "1.0", "Content": "This would be a good camera if it wasn't for it's inability to start on a regular basis and the battery draining issue. Its junk because of too many bugs. Stay away from it.", "Date": "December 30, 2010"}, {"Title": "Good for 2007", "Author": "Mireya Donahue", "ReviewID": "R1AQFRV99KZ2ON", "Overall": "3.0", "Content": "Decent camera .. I guess good for the price.  I would invest more and buy a better model to last longer.", "Date": "August 25, 2010"}, {"Title": "Not what consumer reports made it out to be", "Author": "Billy Headrick \"SLOdrifter\"", "ReviewID": "R2AJWY0RBN8XYG", "Overall": "2.0", "Content": "I looked at consumer reports and found this camera to be a best buy for your money.  I bought it for my mom and she hates it!!!  I felt bad giving it as a gift.  The batteries never last and there is no viewfinder.  The pictures are completely mediocre.  I wish I would have spent the extra on a canon.  If you love your mothers you'll buy something else.", "Date": "December 9, 2007"}, {"Title": "Great little camera", "Author": "Ellen", "ReviewID": "R8I6G5U5KKYHR", "Overall": "5.0", "Content": "Light weight. Easy to use. Fantastic zoom. Good software transfer. Overall excellent camera.", "Date": "June 4, 2007"}, {"Title": "False advertising", "Author": "M. Findlay", "ReviewID": "R300M9GT1VSKW4", "Overall": "1.0", "Content": "I cannot rate this camera as purchase experience was horrendous.  Website said camera was new when I purchased, received item two weeks late and sticker on bottom of camera said it was refurbished.  Contacted Amazon who in turn said to contact vendor which I did by email with no response.  Called their 1-800 number and was able to return camera.  Awaiting credit to my charge card.", "Date": "September 10, 2007"}, {"Title": "Worst camera I have ever owned!", "Author": "J. Dresser", "ReviewID": "RGNPV0YM0DS25", "Overall": "1.0", "Content": "We recently took a trip to Disney.  In anticipation of this trip, I asked for a new camera for Christmas.  I even picked out this one out.  Next time I will do more research.  First of all, even with new batteries, it does not stay turned on unless it wants to.  It plays dead for ten, twenty minutes even, and then all of a sudden, when your photo-op is gone, it turns back on.  We missed sooo many pic of the kids during our trip because this camera couldn't seem to make up its mind.  And new batteried didn't help.  Finally, on our last day at Disney, I turned on the camera to discover that somehow ALL of the 275+ pictures I had taken had somehow deleted!!!  I was devestated!  Thank God for photo recovery software.  This camera is going back to the store tomorrow, and I will be purchasing a Nikon or a Canon.", "Date": "January 17, 2007"}, {"Title": "TOTALLY UNACCEPTABLY UNHAPPY!!", "Author": "Janice Stewart", "ReviewID": "R19SYEY6R55I61", "Overall": "1.0", "Content": "I never received this order, I never heard from the Seller of this order after sending to emails to them.  And after recently filing a complaint to Amazon, I've never heard from them yet either.", "Date": "September 18, 2009"}, {"Title": "So Far So Good!", "Author": "Shelly A. Bridge \"shopaholic\"", "ReviewID": "RWXVBT53NA8BH", "Overall": "4.0", "Content": "Just took it on vacation, pictures were awesome. Easy to carry, easy to use. No complaints.", "Date": "April 1, 2007"}, {"Title": "Let the Buyer Beware - This camera is defective!", "Author": "Unhappy Customer", "ReviewID": "R3AUA2G5ZGYLKI", "Overall": "1.0", "Content": "When we received this camera, we liked it very much. Its 5x optical zoom and high resolution seemed like good features. But after two days, it started shutting off after three or four pictures were taken, or after a few seconds of movie were made. We also noticed that a camera at Circuit City had the exact same problem. Changing the batteries did not help at all. Buy a camera from a reliable manufacturer like Canon or Nikon.", "Date": "January 6, 2007"}, {"Title": "Not good....", "Author": "Susan Dolan", "ReviewID": "R1PIT7TSA3Q5RB", "Overall": "1.0", "Content": "This is my 3rd Kodak Camera (I have also bought Kodak's for my Mom and young son).  It is the worst.  I am taking it back tomorrow.  The green light, that another reviewer mentioned, is annoying.  I did take it to a Holiday program at my son's school and not one picture turned out.  I spent more time dealing with the camera than watching my boys. People kept turning and looking at me when I took a picture(it was the green light).  All of my pictures had horriable red eye. All of my pictures were grainy.  My friend was sitting next to me and her Cannon was taking awesome pictures.  So it was not the conditions.Who is the quality control person at Kodak and why would they let a product like this go out on the market?  Shame on Kodak.  I also bought my Mom the Kodak 7.1 for Christmas lets just hope it works better or it will also be returned.I am going to look at a Cannon....", "Date": "December 16, 2006"}, {"Title": "Camera Came from Amazon Broken", "Author": "Djalma Pinto de Britto \"Djalma Britto\"", "ReviewID": "R24RB97AD30TKJ", "Overall": "2.0", "Content": "Well, I did not even had a chance to use it.. When I turned it on it immediatly turned off.. I returned it to AMAZON and I am waiting my refund.  I am  dissapointed with it...", "Date": "February 22, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "8-megapixel CCD captures enough detail for photo-quality 16 x 22-inch prints\n5x optical zoom; 2.5-inch LCD display\nProgram, aperture- and shutter-priority, and manual modes for extra creativity\nRecords TV-quality VGA video at 30 frames per second, with MPEG-4 compression\nStores images on SD memory cards (32MB internal memory included)", "Name": "Kodak Easyshare C875 8 MP Digital Camera with 5xOptical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41BRG5VMPXL._SX300_.jpg", "ProductID": "B000H91K7Q"}}