{"Reviews": [{"Title": "Excellent Camera", "Author": "\"huarong\"", "ReviewID": "R3RFZS7PC7WQYF", "Overall": "5.0", "Content": "It is an excellent camera for this price (I bought it for $250 about 2 weeks ago). Last week I used it to take pictures in Niagara Falls during day and night. The pictures during the day are crisp. During the night, I held it by hand to take pictures of rapids and the water falls (without flash). The water flow effect was surpringly clear and bright.Its TruePic Turbo image processor is indeed very fast. I used the camera to take pictures of fireworks. During 10 minutes I took tens of pictures.However, it is quite necessary to have four recargable Ni-Mh AA batteries with this camera. It uses battery power pretty fast.", "Date": "June 24, 2004"}, {"Title": "Great Value!", "Author": null, "ReviewID": "R9V9TPFM3U4O0", "Overall": "5.0", "Content": "This camera is an excellent value!  It is very cheap for a four megapixel camera, has zoom, takes great, sharp, and colorful pictures!  I bought this camera for my girlfriend based on what I had read about ease of use for this camera.  You would be hard pressed to find a more user friendly camera in this price range or above.  THe auto focus on this camera is excellent!  We have taken lots of picures with this camera during the day and night and little have come out anything but clear and colorful.  Two of the night photos I took of fireworks came out blurry but this is to be expected when not using a tripod.  This is a great camera that has a very powerful flash and is easy to use.  A word of warning would be not to even try using Alkaline batteries, they will be spent in about 20 shots. One warning, for outdoor wildlife enthusiasts, the zoom motor on this camera is very loud! Instead get one of the Lithium CR-V3 batteries which give excellent picture taking volume in this camera.  I highly recommend this camera to anyone looking for an easy to use, great working and low priced camera.", "Date": "July 13, 2004"}, {"Title": "Olympus D-580 - A Great Mid-Priced Digital Camera", "Author": "R. E. Trout", "ReviewID": "R3UI5ZG4KOMJZ7", "Overall": "5.0", "Content": "Several of these reviews sound like they are talking about a different camera than the one I'm using. Or they didn't read the manual and don't know how to use it. I've only had my D-580 a few weeks but couldn't be more pleased. It's compact and stylish and has Olympus's trademark sliding lens cover to protect the lens.The sliding lens cover does seem a bit stiff, but so does the one on my Stylus 35mm camera. I've been using that for 5 years and it still works just fine. The thing you have to remember, and they tell you about it in the manual, is to close the lens cover in 2 stages. You slide it part way to the detent, the lens retracts, and then you can close it the rest of the way. I like the sliding lens cover.The D-580 has 4MP resolution with 4 settings: SHQ, 2288 X 1712; HQ (the default setting), also 2288 x 1712, but more compressed; SQ1, 1600 x 1200; and SQ2, 640 x 480. The included 16MB xD card will hold up to 19 pictures in HQ. In SHQ, it will hold only 6. Obviously, you will want a larger card. They're available all the way up to 1GB. Using Olympus cards and the Camedia software, you can stitch together panoramas from as many as ten images.It has several modes accessible through the menu: Program Auto, Portrait, Landscape, Portrait-Landscape, Night Scene, Self Portrait, and Movie. Most of the time you'll get the best results by using Program Auto, the default setting, and letting the camera do the thinking.The easily accessible macro setting (there's a separate button for that) allows you to to take pictures from as close as 7 cm. The macro pictures look great and I've been using the macro more and more. And you can use the zoom in macro, allowing great flexibility. Apparently the zoom is disabled in super macro mode, which is accessible through the menu.Speaking of zoom, it has a smooth 3x optical zoom, and 4x digital. Thankfully, the digital zoom has to be turned on whenever you want to use it. I don't ever see a need to use it, since with 4MP to work with, most of the time you can just crop the picture and still end up with resolution to spare and much better results.The numbering system used for pictures is P + month + day + number of the picture for that day's shooting: e.g. P6070001, for June 7, 2005, picture number 1 (the year doesn't appear in the file name, but is recorded). That ensures a unique filename for each picture. One little quirk is that the date resets to January 1, 2004 if the batteries are taken out for 3 days. Not a problem, just something to be aware of. Resetting the date is pretty easy.The included Camedia software seems fairly useful, especially if you want to do panoramas, but since it mostly duplicates software I  already have, I didn't install it.Picture downloading on the Mac is simple, and you don't even have to turn this camera on. When the USB cable is plugged in, the LCD lights up and gives you three choices, the first one of which is PC (the others are Print and Exit). You just click the OK button and iPhoto launches. The camera shows up in the finder as a drive, so it must be ejected before you can unplug it. Unplugging it without first ejecting it triggers an error message.It is powered by 2 AA batteries, and while power consumption is heavy, it isn't quite as heavy I expected. I used the supplied alkaline AAs for about a week before they gave up the ghost. Then I switched to rechargeable NiMH batteries, and it did much, much better. I use the Monster Cable MB 4-DCRC, sold by Amazon. I prefer cameras that use AA batteries over cameras that use proprietary lithium ion batteries because AAs are cheap and available and in a pinch you can drop in some alkalines.Overall, I'm very pleased with the D-580. Picture quality is consistently great with Olympus's new image processor (TruePic Turbo), and it has enough settings to fiddle with to keep a person amused for hours. Not that you have to -- on Program Auto, it does everything for you and does it very well. I highly recommend this camera for the amateur who likes uncomplicated cameras, but occasionally likes to dabble in creative photography.", "Date": "June 7, 2005"}, {"Title": "Decent Entry Level Digital Camera...", "Author": "Institution Green", "ReviewID": "R1FP8PI8PQHHSO", "Overall": "3.0", "Content": "I bought the Olympus D-580 as a birthday gift for my wife and as our initial foray into the world of digital photography. The D-580 is certainly easy enough to use and the picture quality is very good. I've made some 8x10 prints from the D-580 that look great. The controls are all very intuitive and user-friendly: you basically scroll through options on the on-screen menu. Transferring pix to your PC is a snap. With Windows XP, I just connected the camera to my pc via the included USB cable and I was ready to go - no need to even use the included software.A few negatives I noticed pretty quickly:1) the D-580 will demolish your AA batteries within about 20 pictures (combination of flash/no flash). After the first set of AAs quickly died, we switched to the CRV3 Lithium battery pack and got much better battery performance (or, invest in some rechargables...)2) the auto-focus is hit and miss in dimly-lit situations, due to the lack of an AF illuminator. (This has me looking at the C-7000, but that's another story.) So, if you take a lot of indoor photos (party pix, etc), the D-580 may not cut it for you. It's hard to tell whether photos are sharply focused until they've been transferred to the computer, which has been frustrating for us and the reason I didn't give this camera another star or two...All in all, though, I'd recommend the D-580 to anyone looking for a first digital camera or even just a simple-to-use point-and-shoot camera without a lot of bells and whistles.", "Date": "December 8, 2004"}, {"Title": "Another wonderful Olympus product", "Author": "J. Downs \"fuss fuss\"", "ReviewID": "R1IU271MZUW35R", "Overall": "4.0", "Content": "My first digital camera was a Olympus D-390. It was great,but it was a fixed lens(no optical zoom). Then I tried a kodak cx6230 and really didn't care for it at all. I considerd the D-540 and  Stylus 410. My wife sort of borrowed it,and seems like it very much. She likes the auto program mode and the sharp picture quality. I use rechargeable batteries and always have a spare set charged and use the LCD monitor to much to tell you how many pictures I get out of a pair of batteries. I have had this camera for a couple of months and shot over two hundred pictures and have not been disappointed.", "Date": "July 21, 2004"}, {"Title": "Bad product; awful customer service", "Author": "Photography Guru \"PhotoGuy\"", "ReviewID": "R1AAAEJQSELNRY", "Overall": "1.0", "Content": "I bought one of these as a backup to my more expensive camera, so I didn't use it much for the first 3-4 months.  I took it to a company event about two months ago and the thing actually shorted out: I took a group photo and then shut the cover and when I opened the cover a few minutes later, the camera body was very warm and none of the LEDs would light up.  I took the batteries out and they were too hot to touch.For the past month I have been haggling with Olympus.  They do not seem willing to perform warranty repair even though I've still got 6 months left on the warranty.  Every time I contact them via e-mail it is a couple of weeks before I hear anything again.This was my first Olympus camera and I guarantee it will be my last.  Bad product, terrible customer service.", "Date": "February 23, 2005"}, {"Title": "Great camera", "Author": null, "ReviewID": "R351IL23E6HPRE", "Overall": "5.0", "Content": "Easy to use straight out of the box.  Great automatic features and has the option of manual.  Over 130 photos can be taken with a 128mb card, more than enough I think.  The good price makes it top in its class. Instructions are very clear and easy to understand.  The software that comes with it is easy to use.  Makes a great first digital camera, as it is mine.", "Date": "March 28, 2004"}, {"Title": "Great little camera", "Author": null, "ReviewID": "R1EDRTR70YW6CV", "Overall": "5.0", "Content": "This is my second Olympus and I really like it.  Small and compact, takes great pictures.  Easy to understand instructions.  Great point and shoot camera.  I wish the lense cover and body were a bit stronger.  Lense cover seems a bit flimsy - like it may not last a long time without breaking.  But we will see.  I have only had it about a week.  I bought the Cannon A75 and hated it and took it back.  Olympus takes much better pictures and it much more amature user friendly. Cannon seems to be for the professional that knows how to manually set the settings.  But if you want a great little point and shoot camera  \"Cheaper\" than cannon,  then go with Olympus.  I think my next one will be the Olympus Stylus, since it is made for all weather and a all steel body.  I wish I had gotten the Stylus, but it is a bit more expensive.", "Date": "May 30, 2004"}, {"Title": "A Horrible Camera - Unworthy of Olympus", "Author": "Hey Mo!!", "ReviewID": "R2KTQR7VBYQERO", "Overall": "1.0", "Content": "I have been a huge fan of Olympus cameras and I totally adore my 4-year old 2.1 megapixel Olympus D-490. I thought the D-580 would just be an upgrade to my camera because there are a lot of passing similarities between the two, but in its guts the D-580 is a horrible re-design with almost nothing good about it.For starters, if you select anything less than the highest quality image-format, you'll find that the pictures are totally unacceptable. They are blotchy and jpegged to death. It's shocking and disgusting how bad they are. With my old camera, I would sometimes select a slightly lower quality image in order to speed up photo-taking, but that just won't work with the D-580.The 580 is unusable without the flash, but the flash is such a bright and focussed white light that reflections often blow out the CCD and colors look washed out and artificial.The viewfinder lens is so small that the LCD is the only reasonable way to line up a shot, but that runs down the batteries in no time at all.The LCD is large, but has funny problems, like when the camera was pointed at a bright metal building, the whole thing appeared in reverse-colors.The menu options are arranged in such a manner as to obscure the most simple tasks. Where my old Olympus automatically compensated for all but the most extreme lighting conditions, this camera needs tweaking for every different environment. Changing a setting involves navigating through an awful round selection-menu, followed by choices from a sub-menu and finally tuning the options in a totally separate menu.Comparing images from my old camera to the D-580, the old 2.1 megapixel camera wins every time. Images from the old D-490 are sharper, the colors more accurate and the flash produces warm living tones.Yes, the D-580 is small and light and it can do a lot of nice tricks, like shooting panoramas or QuickTime movies with audio. But the sacrifices aren't worth it. I can't recommend this camera for anyone. Olympus needs to re-think their consumer strategy!!", "Date": "January 29, 2005"}, {"Title": "Excellent Camera", "Author": null, "ReviewID": "R1ML23RCC5DRRQ", "Overall": "5.0", "Content": "This is my first digital camera.  I was looking for something that was easy to use, took excellent pictures, and wasn't too expensive.  After looking at Fujis, Kodaks, and Canons, I decided to go with this one.  Boy am I glad I did! The picture quality is excellent, it's really easy to use, and has enough options for a beginner without going overboard.  Screens and options are easy to navigate through; you can start using this camera in no time.  There were no problems getting my computer to recognize the camera.  The only compliant is there were some minor problems with the installation software for the included photo editing software.  The installation program thought the serial number wasn't correct even though it was.  I just had to click the back button then reenter it again to get it to work.  Overall this is an excellent camera, especially for only $299.99.  I highly recommend this camera to anyone looking for a great point and click 4.0 mega pixel camera.", "Date": "April 6, 2004"}, {"Title": "Buyer beware, warranty is useless", "Author": "J. Arling \"jarling\"", "ReviewID": "RLERICILQXD9O", "Overall": "1.0", "Content": "I bought this camera for $199 in November of 2004.  It stopped working within 6 months.  I sent it back to Olympus fully expecting them to repair it under warranty.  Instead, I have gotten a complete run around about how the camera is unrepairable and that my warranty is invalid because there is battery corrosion.  They did not say that they were sure that the camera stopped working due to the corrosion, only that the corrosion is present.  They then pointed to the fact that battery corrosion invalidates the warranty.  I explained that I used all the original components that came with the camera, including the battery that they shipped with it.  If their battery is faulty, why isn't it their problem?  They repeated that the battery corrosion invalidates the warranty, so I get nothing.And to add insult to injury, they oh so kindly have offered to ship me a reconditioned replacement for only $138.54.  I pointed out to my repair technician that I can buy a reconditioned model of this camera at Amazon.com for $128, so why would I buy it from them for $138.54?  He then recommended that I use their \"Trade-Up\" program to buy a better model from them to replace my broken model.  They offered me a Stylus 500 for $250.  I quickly Googled that and found it online at 17th Street Camera for $219.89.I asked him why they would insult me this way?  I have a camera of theirs that I have used properly for less than a year.  It stops working and they won't replace it under warranty and then they try to rip me off by offering me replacement cameras at prices above retail.I told him that I would never consider buying another Olympus product.", "Date": "October 24, 2005"}, {"Title": "Worked great up until...", "Author": null, "ReviewID": "R376YMLIL1KLYX", "Overall": "4.0", "Content": "I found this camera to be very easy to use right out of the box.  The software installation went off without a hitch and I was able to view the pictures on my PC with ease.  Anyone looking for a first-time digital camera would be very pleased with the package Olympus has put together here.  However, after only having had the camera for four days, the lens would no longer retract when I went to turn the camera off.  So now, the camera beeps and the indicator lights near the viewfinder constantly blink which if I read the manual correctly indicate some kind of battery problem (which it isn't).  I'm planning on exchanging it for another one and hopefully, this lens problem is just with the camera I have now.", "Date": "April 7, 2004"}, {"Title": "Excellent camera!", "Author": "TJ", "ReviewID": "R3BCYKXM5ZX9DW", "Overall": "5.0", "Content": "I expected a good camera when getting this model due to prior experience with the Olympus digital line.  This camera is wonderful!  The comparable Stylus had a few more features, but I'm very happy to save a few $ in buying this one on sale.  Video quality is good.  Night photos are surprisingly good for the specs.  Macro shots are amazing.  I bought the camera just in time for the California desert bloom & an Hawaii trip.  On video of a cheetah running by 2-ft from me, you can hear its paws beating the ground.  The photos are unbelievable - even with hyper, shaky hands.  People rave about my photos.  The camera's performance offsets my shortcomings as a photographer.", "Date": "April 25, 2005"}, {"Title": "Great Pix, Lousy Battery life", "Author": "Y. bhat \"Razorback\"", "ReviewID": "R3WKHROOS7JRA", "Overall": "3.0", "Content": "Whatever anyone says, the battery is zapped by this little handy camera.  If you like to take plenty of pix, be ready to shell out for the batteries.The pictures are great, easily handlable camera. Love everything about it. but the battery life.I've tried the lithiums, i have recharagables, but they all get wiped out by the powerusage on this machine.", "Date": "October 24, 2005"}, {"Title": "Love this Camera!!", "Author": "Shutterbug", "ReviewID": "RHXCIG3G343DB", "Overall": "5.0", "Content": "I bought this camera about a year ago, as my first digital camera. I love photography as a hobby, and this camera takes beautiful pictures. I often get asked if I am a professional photographer. I recently upgraded, but love this camera so much, I stayed with the Olympus brand. I still plan on using this camera often.Only con: It is a battery hog, but you can fix that by getting rechargeable batteries, or the Energizer e2 lithium batteries.*Update 2008* Just updating that I still use this handy little camera, and it is still working like new for me. Fits great in a purse to carry with you all the time if you never want to miss a shot.", "Date": "October 12, 2005"}, {"Title": "Good Camera for the Price", "Author": null, "ReviewID": "R2HM74AYMSQKZD", "Overall": "3.0", "Content": "I purchased this camera for my wife because of it's ease of use (point'n'click) and the lense is automatically covered when turned off (protects lense in her purse or briefcase). It is a nice camera, easy to use, picture quality is OK (my daughter's Kodak 6340 and my Nikon 5700 pictures are much sharper), good camera for beginners. Batteries do not last long, pictures blurred with full digital zoom.", "Date": "June 18, 2004"}, {"Title": "I love Olympus, but NOT this camera!!!!!", "Author": "Alison", "ReviewID": "R3DFJT2SDXLQ38", "Overall": "1.0", "Content": "I've been using Olympus digital cameras since 1997. I've bought five over the years for different reasons and loved them all - but NOT this camera. For the first time, I have ended up returning a camera and buying an entirely different model.First, I have to completely concur with the battery-sucker commentary others have mentioned. It's terrible, and it uses up batteries within 20-30 pictures, even worse if you are using the flash consistently. I have had three other Olympus D-model cameras (including the 560) and have NEVER had such problems.Second, the flash is completely overwhelming. It whites out almost everyone I took a picture of at even a moderately close range, and when it was NOT used, the slow shutter speed made a clear picture when the camera was hand-held almost impossible. In addition, even with red-eye reduction, the flash was so bad that nearly everyone I took a picture of had their eyes closed.Third, and this was the worst, the shutter speed was terrible. As the batteries wear down (which is extremely rapid), the shutter speed gets slower and s-l-o-w-e-r. The auto-focus takes between one and three seconds at a MINIMUM between the time the button is pressed to the taking of the picture, and this is when the camera was already focused using the half-button-press method. I was VERY disappointed by this. My favorite subjects are my children (four years old and three months old) and if you want to catch them smiling that's simply an unacceptable delay.I returned this camera and traded up to the Olympus C-765. The C models have far better creative control, including flash-intensity control, many more picture-taking modes, aperture control, etc., but I'm also very pleased by the point-and-shoot (auto) mode as well. In addition, the C-765 has a much better lens (meaning much better shots) and a 10X zoom, which is ideal for me to capture the wildlife in my area - I got shots of animals I'd never been able to get before.Don't waste your money on this camera unless you are using it for strictly out-of-doors, well-lit shots that have very slow or not-moving subjects. For family pictures or a lot of indoor use, don't bother - and make SURE you buy several packs of rechargeable batteries - and CARRY THEM WITH YOU - if you decide this is the camera for you!Otherwise, buy a different Olympus camera altogether. I was incredibly disappointed by this but am thrilled with the C-765.", "Date": "January 7, 2005"}, {"Title": "Great Camera", "Author": "Patricia Wyss", "ReviewID": "R2O1MP2JESJWUN", "Overall": "5.0", "Content": "Honestly, I don't know why people are complaining about this camera. It is a simply designed snapshot camera that offers great resolution at an extremely affordable price!What more could you ask for4.0 MP3x Optical, 4x Digital Zoomlarger LCD screenWeight: 5.8 ozPRICE: just over $100!I cannot believe you have anything to complain aboutsimply a great camera, and I have tried them all", "Date": "July 11, 2005"}, {"Title": "Fine camera", "Author": "D. Weulander", "ReviewID": "R25NNL61EPM2XR", "Overall": "5.0", "Content": "The instructions were not congruent to the actual camera settings.  However, after just a few minutes, I had it figured out.  This camera is BY FAR easier to use than the D-510 that it replaced.  As per the \"beef\" about battery life, that I have read: What is the difference if you change two batteries every 20 or so shots or four batteries every forty shots? Thus far, I am very pleased with this camera.", "Date": "August 21, 2005"}, {"Title": "alan rap", "Author": "alan rap", "ReviewID": "R4B2YHQJ6RR0Q", "Overall": "5.0", "Content": "I received this camera as a Christmas present from my wife.  I think this is a really nice digital camera.  It's very easy to use and takes terrific photographs.  I've read the reviews on this page about the camera being a battery eater.  In fact, it exhausted the batteries that were included with the camera in less than 15 photographs.  That got me nervous and I was ready to return the camera.  But my wife also got me a nimh battery recharger which made all the difference in the world.  These rechargeable batteries last significantly longer than the alkaline batteries.  I would recommend this camera.  It's inexpensive and a great starter digital camera.", "Date": "January 4, 2005"}, {"Title": "Great inexpensive camera.  Only snag is poor battery life.", "Author": "Michael A. Kinsella", "ReviewID": "RSRPMJZRXOQ8M", "Overall": "4.0", "Content": "I upgraded from a D-510. The D-580 Consumes batteries too quickly - need to carry several backups, and use rechargeable batteries.  I wish it held 4 AA batteries like the 510, rather than 2.In all other respects it is a great camera for the money.Pocket-sized, simple to use, the D-580 makes digital photography easy for anyone.4 mega pixels , 3x optical/4x digital zoom, auto focus only, program exposure only, JPEG file format, ISO range 50-400, movie mode with sound.The movie option is good fun, but nothing like a VHS. I use this for e-mailing short clips to friends. 160 x120 pixel mode uses about 75kByte/sec, maybe 5% less in a zip file. High resolution uses about 340Kbyte/sec - unusable unless you have the 64MByte-memory card.  Sound quality not bad.The shutter speed is noticeably faster than the D510, there is a delay of about 1/5 second between pressing the button and taking the picture. So it is still slower than a 35mm camera, making moving action shots a challenge.  But this is true of all digital cameras, and the D580 seems the best in its price range.The USB connection is very fast and easy to use - Windows treats the camera like an extra hard drive.I am pleased with this purchase.", "Date": "December 25, 2004"}, {"Title": "Great starter camera", "Author": "Danielle Louise", "ReviewID": "R2BWQK4C6L0OY", "Overall": "4.0", "Content": "I used to always borrow my dad's C-5000 (I think that's the model... now I can't remember!), so my parents decided to buy me my own camera for Christmas. My mum picked this one for me, and I think she made a pretty good choice. The camera is very easy to use. At first it may seem intimidating to have to flip through the digital menus to change settings, but it quickly becomes second nature.All of the pictures that I have taken using just the point-and-shoot method have come out very well. The flash is sometimes over-powering, but for the most part it does its job well. Pictures taken in the auto mode are generally very crisp, unless I turn the flash off anywhere other than outdoors (in which case the shutter speed is longer and my hands shake too much to get a clear picture.. I also have this problem in night mode).I love this camera because it makes playing with different settings -- flash, white balance, macro mode -- very easy. It's much, much easier than the C-5000. It's a very good camera for anyone who wants to dabble in photography but it's ready to drop the money for something more serious. And it's also a great little point-and-shoot camera.Of course, a big complaint is the batteries. Don't even think about using regular AAs. I found an Olympus package at Best Buy for about $30 that solved my problem... It included two sets of rechargable batteries with charger, a camera case, and a (very) mini-tripod. With regular batteries, I think I took about 20 pictures, but I can take many more with the NiMH batteries the package included.Another thing -- don't bother with Camedia software! We have it on my parents' computer, and it's a hassle! If you have Windows XP, bypass Camedia and use the default XP programs, they're much better!Overall, I think this is a wonderful starter camera, and have been very pleased with it. I'll drop the money on something more sophisticated when my photography skills get better, but in the meantime I'm a happy girl. Even if you just want this camera for point-and-shoot purposes, I advise that you play around with the different settings (I like to practice on my dogs, so I'll know what I'm doing when I have to take real pictures) -- they can improve your pictures greatly!", "Date": "February 17, 2005"}, {"Title": "Camera is nice, software bundled is a swindle", "Author": "Peter Hilliard", "ReviewID": "R23FGJM7Q6AEC6", "Overall": "3.0", "Content": "We got this camera for a good price from Costco, and we're pretty happy with the pictures we're getting. Like most people would, we moved the files to our hard drive using the software that came with the camera: Camedia Master. The program freezes up on me frequently, but that isn't my beef. In order to e-mail the photos you take, to move them to a disk to get them processed, to move them back to your camera, really to do anything except print them or use them as wallpaper, you have to pay for the 'pro' version, which costs $20. By the time most consumers discover this and start using another program to upload their photos, they will, as we have, already put dozens of photos in this program where they will be irretrievably locked until they pony up $20 they hadn't bargained on when they bought the camera. This kind of business practice is really underhanded, because it makes basic functionality a premium product. Buy the camera, by all means, but don't use the software at all, or budget into the endeavor an extra $20 to do the very minimum you'd want to do with digital photos.", "Date": "January 26, 2005"}, {"Title": "move on up to the East Side", "Author": "Gadgety", "ReviewID": "R1M6FCNKLLUBCM", "Overall": "2.0", "Content": "As previous reviewers have stated, this camera has major battery drain issues. I Recieved the 580 last night for an early Christmas present and 24 hours later it's packed, ready to go back.  After taking about 15 pics and messing around with the set up, the first set of Alkalines ran out.  The second set didn't last one picture!!  The third set three or four.  It does state on their website that it doesn't recommend Alkalines but instead tells you to use a $13.00 one that lasts maybe 20 or 30 times more.  And for rechargeble Ni's you'll probably need ten sets.  I reccomend you move up to the Canon A95.  For a hundred bucks more you get a much better camera.  Check it out.  It has dozens of better features including a state of the art processing chip, a flexible display, manual options, and a better focusing system.  Save your self the trouble with this Olympus unless your daddy owns Duracell.", "Date": "December 23, 2004"}, {"Title": "Worst digital camera ever", "Author": "T. Sezen", "ReviewID": "R1S0LGVUA3FGBR", "Overall": "1.0", "Content": "Batteries: I bought Olympus Ni-MH batteries. By the time you go through a few menu items red light on battery starts to come out. When it goes dead, you cannot even close the cover.Usability: Everything in menus which eats up battery power. Menus are confusing, blink out instantly and I thought Hieroglyphics went out of fashion with egyptians. You make changes, but the camera like resolution of the picture but it reverts back to another resolution all on its own.Quality: snapshots of landscapes are OK, but the camera cannot focus anything closer than 10 yards.I think the name fits this camera: Camedia but I think it is misspelled it shoud read \"Comedy\" of a camera.I own 5 digital cameras, this one is a big dissapointment.", "Date": "February 19, 2005"}, {"Title": "Great Point & Shoot Camera", "Author": "brad g", "ReviewID": "R3SVP115ZXPNUL", "Overall": "4.0", "Content": "This is a great little point & shoot camera. I paid $199 at Costco.It take really nice pictures and is VERY easy to use. The only downside is it's slow to focus in low light.I keep the flash off and the LCD off to save batteries.It's a great first digital or travel camera.", "Date": "January 7, 2005"}, {"Title": "Pictures themselves are good, design and value are poor", "Author": "Erik Grow", "ReviewID": "R34E6450M4C8QX", "Overall": "2.0", "Content": "As the title would indicate, I really don't like this camera. I saw it on sale at Best Buy for $199 and got it for my parents for Christmas. The actual picture quality is pretty good. 4MP is certainly quite crisp. It is fairly compact as well.I ended up returning the camera, and here is why. First, needing to slide the shutter to turn it on is not intuitive, and annoying. Second, I had some problems getting the lens to retract sometimes when I did close the shutter. Third, I was also surprised that the camera didn't come with a rechargable battery. Most cameras these days come with one, and it basically felt like they were skimping on accessories. Fourth, the screen on the camera was very laggy and low resolution compared to nearly all others I have seen. I was not impressed.", "Date": "December 28, 2004"}, {"Title": "It will cost a fortune in the long run- skip on AA cameras", "Author": "Girleen \"girleengirl\"", "ReviewID": "RQJ8YAG93Y8O8", "Overall": "3.0", "Content": "Pay extra for the Olympus 410 because this is a battery sucker. Would you rather be walking around with a bag full of batteries? I had to constantly change the batteries. That was when I decided this camera wasn't worth it. It becomes a hassle when you have to change the batteries after 30 or so pictures.  I have to admit the picture quality is better than the 410 but the fact that it doesn't come with rechargeable batteries made me return the item. In the long run this camera would be too expensive to keep because batteries are expensive and having 3 or 4 sets of extra rechargeable batteries becomes a hassle. I found it rather troublesome having to change batteries after a few pictures.  Never again will I buy a camera without the rechargeable lithium-ion battery technology. Overall the camera takes almost perfect pictures because the lag time is not noticeable. In fact I didn't even notice there was a lag time until I got the 410 to compare to. Another downside to this camera is that it is rather bulky and big compare to other digital cameras. I have small fingers and I found the buttons rather hard to press at times.This item only gets a 3 because there are more cons than pros. The only pro is the picture quality. But the AA batteries make it a  con in the long run.", "Date": "September 20, 2004"}, {"Title": "Nice Camera, battery issue overblown", "Author": "R. Hoierman", "ReviewID": "ROMLO1N8RBHCW", "Overall": "4.0", "Content": "I bought this camera a month ago and use AA NiMh batteries that I recharge.  They last for a long time, in fact I have never run the batteries down on a photo shoot.  I do have to turn the flash off on several occassions when it really is unnecessary.  The photos come out great and all the user interfaces are easy to use. The down loads to my pc are fast and easy too.  For the price, this is a great buy for a digital camera.", "Date": "January 27, 2005"}, {"Title": "Battery HOG!  Just not worth it", "Author": "M. Danker \"photo junkie\"", "ReviewID": "RYXZFNTA155MJ", "Overall": "2.0", "Content": "I had one of the first Olympus digitals - a 2.1 mp - and loved it.  It finally broke after years of pounding - and decided to stay brand loyal.I'm getting ready to box the new one up and return it.  I used rechargeables - as well as 6 other pairs of batteries to feed this camera - and it just burns through them like nothing.  The \"free\" batteries it comes with lasted maybe 10 minutes - and that was just turning the camera on and playing with the settings.  And I never even used it for video.The speed of the camera seemed just as slow as my 2.1 - and the quality was not as good for some of my shots.  I'm not high tech when it comes to cameras - but this one just didn't seem to have the right speed or adequate lighting.  It was too bright on some shots - and others WAY too dark.The good to the camera - it is small - but I guess in this instance - size doesn't matter - b/c I don't like this camera at all.", "Date": "December 28, 2004"}, {"Title": "ITEM NOT WHAT ORDERED", "Author": "Lynne Bradley", "ReviewID": "RYUZ5T4XXEWOC", "Overall": "1.0", "Content": "The camera received was not the camera ordered. It was the correct box but inside was an old used camera. BAD!", "Date": "November 13, 2013"}, {"Title": "Workhorse", "Author": "Gromit801", "ReviewID": "R25J82BZF2DZIR", "Overall": "5.0", "Content": "We've had this little Digi for eight years now.  It's dinged up, scuffed, and still works like a champ.  It was an impulse buy for us on our way to a beach, and didn't feel like bringing our more sophisticated photo gear with us.Did we expect incredible photos?  No, not at 4mpx, but the pics are plenty good enough for our website and keeping friends in touch with our activities.  Has worked great with lithium AA batts, good flash settings.Nice little camera, I highly recommend it.", "Date": "September 16, 2012"}, {"Title": "Great Camera, bad battery life", "Author": "Steven Purcell", "ReviewID": "R18H8LEMP8M8IQ", "Overall": "3.0", "Content": "This was a great camera for us.  The only problem is we got about 24 pictures out of a set of batteries and they were done.  We only kept the camera for about 3 months because of that.  It was just to much of a hassle.  We may have had better luck with more expensive batteries but after a year of buying them we could have just bought a camera with a rechargeable battery.", "Date": "March 1, 2011"}, {"Title": "Was good in the day", "Author": "P. Mohring", "ReviewID": "R2MYNBDVCJ5VV1", "Overall": "3.0", "Content": "This was my second digital camera and while it was good for the first year, after that it began locking up. I would take a picture and the camera would freeze and I would have to shut it off and try again. I lost many good shots because of this and it led to me buying a new camera.", "Date": "February 21, 2010"}, {"Title": "Tepremental Technology", "Author": "M. Stewart", "ReviewID": "R3TGEBFUY4TCPL", "Overall": "3.0", "Content": "First, some caveats for this review; this is my first digital camera; and I bought mine via eBay, so some of my issues could be due to my camera being \"experienced.\"  I do have 40 years' experience as an amateur photographer, but I've resisted the plunge to digital until now.I too noticed that if you use AA batteries, you will use them up quickly.  I also found you need to use name-brand alkaline batteries if you want to take more than one or two pictures at a time; see my review for AA Alkaline Battery Value Pack.  Also, the battery charge indicator is basically useless regardless of the type of battery; it tells you if you have enough battery for few shots.  No semblance to a gas gauge; more like an out-of-gas indicator light.  I do get a lot of pictures out of the CR-V3 lithium batteries.  And I can play around with the zoom a lot with the lithium ones; with alkaline, zoom a few times, and you may need to wait for them to rebound to take a picture!Sometimes I get great pictures, and other times it seems the auto-focus sensor seems to be confused and locks in on the wrong part of the image.  The latency from pushing the shutter button to the camera capturing the image is frustrating long; especially using the flash.  Pushing the shutter button down part-way helps somewhat.", "Date": "January 16, 2009"}, {"Title": "Great Camera For The Price", "Author": "Hoop Mama", "ReviewID": "R39K3F5SKEMDPZ", "Overall": "4.0", "Content": "PROS: Ive had my Olympus D-580 for about four years, and I have finally decided to upgrade.  I have to admit that for what I paid (around $250) it has been a great little camera with a lot of features.  My most-enjoyed feature had to be the video, which has zoom feature.  I took my first video at Niagara Falls and was astonished at the quality of the picture and sound, even when at max zoom.  Since then I have taken countless videos of my children, and aside from needing a lot of lighting (outdoors is best) I have no complaints.I like the fact that it uses AA rechargeables, and it isnt a big battery burner.  I could take about 250-400 photos, depending on size, before needing to change the batteries.  Carrying a spare set solves any worry about running out.  And, if you forget your spares, you can always buy a pack of AAs in an emergency.  I say this is a bonus because the lithium ion batteries dont offer such convenience.  The night scene also performs remarkably well, if a bit grainy.My main reasons for the upgrade, and the reasons this camera gets 4 stars instead of 5, are the following CONS:* Very slow picture-taking.  It can take up to three seconds from click to capture, which is just completely unacceptable to me.  In fact, I would rate that part of the camera a 1 star because it has caused me to lose SO many great shots.  By the time the thing gets around to capturing the photo, my scene was gone.*Auto-focus can be sticky.  Sometimes the three-second delay becomes a permanent one when the auto-focus seemed to get stuck mid-thought and the camera just didnt take the photo at all.  Adjustments to scene would probably help a bit, but honestly, it didnt help me much.*You have to hold PERFECTLY still to get a nice, clean shot.  Thankfully it's digital so I could toss the many blurred pictures I had throughout the past few years.  This problem seems to have worsened has the camera has gotten more use.*Unexplained grainy pictures. Sometimes, without any apparent reason, the camera will take a few really grainy photos.*Lens is prone to spots, and boy will those ruin some great photos.  This is easily remedied, just keep a good lens cleaner on hand and always check your lens before taking photos.Overall, I would recommend the Olympus D-580 to anyone looking to go digital.  The 4MP offer surprising clarity and beautiful, bright photos.  It's a great family camera (aside from being slow to capture, which people trying to photograph small children may find very frustrating) and performs well in a variety of lighting situations.  It's nice and small, lightweight, but not so small and lightweight that you're half afraid of losing the thing.The reason I am upgrading at this point is that I am more into photography as art in addition to wanting the great photos this camera can offer.  I'm a feature creature!  I will definitely be keeping my Olympus D-580 for a backup though, it's been a great little camera.", "Date": "June 2, 2008"}, {"Title": "Olympus D-580", "Author": "Rolling Thunder \"Krystal\"", "ReviewID": "R2LGI1I96SGT3G", "Overall": "5.0", "Content": "By  Kathy \"kainesis2\" (NJ USA) - See all my reviewsIt's about 3 years old now and I have never had one whit of trouble with it. My 6 year old granddaughter has been taking pictures with it also, since she was 3 and she has become quite the photographer (though she's dropped the camera from time to time and it survives!). The pictures are always crisp and clear, with great color. Sometimes there's red-eye with flash photos which is normal, and I can easily take care of with Picasa. Family members have other more expensive digital cameras, but mine (around $250 at the time) takes the best photos, in my opinion. I have been extremely happy with this camera.", "Date": "January 10, 2008"}, {"Title": "Don't forget extra batteries!", "Author": "LisiLoo", "ReviewID": "R2T1LCML6J7E9X", "Overall": "3.0", "Content": "The camera takes nice pictures but even with rechargeable batteries, they have to be replaced after about 20-25 pictures, maybe more depending on how often you open and close the camera.  I always have to have extra batteries charged and with me because we never make it through an event without having to replace the batteries at least once, ofter more.  Also, there is a long delay between pressing the shutter button and the actual taking of the picture.  I have missed so may shots because of this!", "Date": "April 23, 2007"}, {"Title": "Excellant Camera", "Author": "Deborah A. Dresser \"DDDzStmpn\"", "ReviewID": "R1MMB0FYUJUP7W", "Overall": "5.0", "Content": "This was my first digital camera & I am so happy I bought it.  I have had it for two years & have taken several hundred photo's if not over a thousand with much satisfaction (I also get alot of compliments on my pictures). I am a scrapbooker & I take this camera with me wherever I go....it stays in my fanny pack unless I'm using it.  I do not use the software that came with it as I already had Google's Picassa2 & was happy with that.  I see many complaints have been made that this camera eats batteries.  I buy Walgreen brand photo batteries & they last a long time.  I will probably upgrade to a new camera this year but I will most likely buy another Olympus camera I think.", "Date": "January 9, 2007"}, {"Title": "Great Camera!", "Author": "Alena K. \"Alena\"", "ReviewID": "R1721QBSLGD5B4", "Overall": "5.0", "Content": "I had this camera for about 2 years and I truly enjoyed using it. Great outdoor and indoor pictures. I was especially impressed with the indoor pictures as not that many cameras I owned or tried were able to take great bright pictures indoors. Beautiful, rich colors and very sharp images - it was hard to take a bad picture. It did use alot of batteries, but Rechargeable CR-V3 Li-ion batteries would make a great difference. The only problem was the sliding lens' cover that I think was the reason why my camera broke down. Or may be the batteries were running out of charge - but all over sudden it started bipping, the lens wouldn't come out and then the power would go off. I'm still giving it 5 stars because I was very happy with it and would recommend it to everyone.", "Date": "December 26, 2006"}, {"Title": "Great Camera", "Author": "D. Hollowell", "ReviewID": "R15KP1PE2OY0LL", "Overall": "4.0", "Content": "This is a great camera.  Inexpensive, lightweight, and very versatil.  It takes great pictures.  The only downside to this camera is the delay when you snap a picture.  I took a picture as someone was walking out the door and after the delay all i had was the door.  The batteries are long life, took pictures all day on one battery.", "Date": "September 12, 2005"}, {"Title": "Eats batteries", "Author": "Digital Dave", "ReviewID": "RBJWQ6FIGZEQT", "Overall": "2.0", "Content": "I like this camera a lot, but as other reviewers have noted, it eats batteries in no time at all. I orginally bought rechargables but found that they didn't have the power depth to last more than a few shots (like maybe 10 or 20). I switched to alkalines, which last a little longer, but what a waste of money to keep buying new ones.It seems like the problem is that there is a huge drain on the battery on each shot taken because if you let the camera rest for a while, the batteries will eventually allow it to take another shot (after you turn the camera off, of course).I bought this camera based on Amazon reviews, which were very helpful. Next time I'll wait until the product has been on the market long enough to find out about these kinds of problems.", "Date": "February 10, 2006"}, {"Title": "The Best Camera", "Author": "Nick", "ReviewID": "R2OYS9RCD6DI5M", "Overall": "5.0", "Content": "i got this camera for Christmas and i love it because it is very easy to use and to hook it up to the computer is soo easy.", "Date": "December 29, 2004"}, {"Title": "Happy it's gone.", "Author": "W. Hurschel Hardesty", "ReviewID": "R1VKN3Z4KKC0HF", "Overall": "3.0", "Content": "I bought a D580 because I had an earlier model Olympus digital camera that was OK and I thought that an upgrade would be an improvement. Picture quality was great with the 580, but hard to get what you shoot because of the l  o  n  g  shutter lag and the  l  o  n  g  start up time, I really grew to HATE the cute little camera for those two reasons. I was using high mAh NIMH rechargeable batteries and had no complaint about battery life at all, just missed a lot of shots because the thing wasn't ready or because of the shutter lag. It does have a happy ending, on a boating trip in the Gulf of Mexico, I bumped the rail and the case with a velcro belt loop came loose and it got dumped in the Gulf, good riddance. I promptly bought a Fuji because it uses AA batteries and the other XD memory cards that I had, I'm now a happy camper.", "Date": "December 22, 2006"}, {"Title": "The \"Jaguar \"of digitals cameras!", "Author": "W. Behnke", "ReviewID": "R3E8Q6D6FUGKB5", "Overall": "1.0", "Content": "I own one of these. Bought it based on past Bought it based on previous Olympus film camera experience.Big f-ing mistake! Kinda like buying a Jag; better buy two. So you have one to use while the other is in the shop for whatever is wrong with it this time.Worked great, except for slowww shutter response while we were in Switzerland. Did I say slowwwwww?It's been all down hill since then.There seems to be an issue with the battery door, or contacts. When one opens the lens cover at times, the lense does not move out and the monitor does not illuminate. Great for Xmas 2005!Open the battery door and close it...we're back in business!?#Yes and no! Sometimes it does, other times, your screwed. NOTHING!Also, the cards seem to have contact issues. My two 256 cards each had 20-40 pictures on them when alas, I turned on the camera to take a few family Xmas pictures and after getting no response from the camera before reloading the batteries, the first card came up with a format message! I changed cards, while everyone else was clicking away with their SONYS and NIKONS. The other card came up with the same damn message!No xmas pix this year...Sh*t!!!I have spoken to Olympus and they require $99.00 to make it seem new again and warranty for 6 months.You should be aware, I treat my cameras and all of my possesions with the utmost care and respect. so this is not a note from someone who beat-up his camera and expected it to take it. If it costs mone I treat it like money.The new Sonys and Nikons look pretty freak'n good about now.", "Date": "March 21, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "4-megapixel sensor captures enough detail to create photo-quality 11-by-15-inch enlargements\n3x optical zoom combines with 4x digital zoom for 12x total zoom\nQuicktime movie mode with audio; PictBridge enabled; optical viewfinder\nStore images on xD memory cards\nPowered by 2 AA-size batteries (alkaline included, rechargeable NiMH recommended)", "Name": "Olympus D-580 4MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51E6MQRWFDL._SY300_.jpg", "ProductID": "B0001DKQX2"}}