{"Reviews": [{"Title": "Good, Bad, and thankfully not ugly", "Author": "AP", "ReviewID": "R1P1QK89BCFZW7", "Overall": "5.0", "Content": "You're probably considering the Fuji A330 because you either want a good reliable point-and-shoot or simply because you want a really good deal. I've owned several digital point-and-shoots and even digital cameras several times the price of the A330 so the enclosed points speak from a fairly varied experience of digital camera usage over a 4 year period.The Good1. The photos are generally good quality when taken outdoors. Compared to other point and shoot cameras at least. But you'll instantly notice the difference in photo quality if you choose to buy (for example) a 3 MP camera at twice this price. (I also own the Canon PowerShot IS and love the vivid color in the photos there.)2. If someone tells you 3 MP is not enough, ignore them unless you need to make prints larger than 8x10 (when did you make blow ups with a 35mm camera anyway???)3. Battery life is decent. Please do invest in rechargeables. A worthy investment. Make sure you get a smart charger, not a dumb one (enough product information and review material on Amazon to help you learn more on this if you would like.)4. You'll appreciate the 3x zoom though instantly crave for more.5. There is not much else out there in the market under one hundred and fifty dollars. So if this is a gift, you've got a good starter camera to give with the additional accessories to be bought later by the recipient.The Bad1. XD cards are at least 40% more expensive than compact flash cards. Negates the whole concept of getting a really good deal. (Though there is currently a free memory card offer on Amazon that's worth looking at.)2. Start up time at 3.3 seconds (according to Fuji at least) is still slow. That means you are guaranteed to miss a good action shot since time from start to click is at least 6 seconds (unless the word `draw' reminds you of the Wild Wild West and not your kindergarten days...)3. If your really plan to take some video footage, you'll regret, soon enough, the lack of audio. Be prepared to be disappointed. I suggest you strongly consider a camera with audio. You can use Windows Movie Maker to add audio in later but you'll probably not find time to learn to use this efficiently enough.4. its `just' a little too bulky to put into your pant pocket and still be completely comfortable. Especially if you have a carrying case with the camera.The UglyNone really.ConclusionA great starter camera. You cant go wrong with this purchase if this is your first digital camera. I'm being a little critical here because I'd like to share my likes and dislikes of this purchase. But I guarantee you, at this price,  or for a starter camera, you'll be hard pressed to find anything better.", "Date": "October 6, 2004"}, {"Title": "Fuji A330", "Author": null, "ReviewID": "R3KJC5LYOUE1MT", "Overall": "5.0", "Content": "This is my second digital camera in 5 years - handed down the old one to the kids.  I was hesitant to give up my old one because of how easy it was to use (an old HP model)but it was bulky and I wanted some new features.  I bought the Sony DSC P32 and hated how complicated it was.  I hung on to it for 90 days hoping I could dedicate a week or so to reading about how to use the darn thing when I finally gave up and returned it.  I was referred to the Fuji A330 for ease of use.  It is so easy, my kids use it!  It takes great pictures all around - inside, outside, light or dark.  The software also is much better than what came with the Sony I returned.  A friend bought the Nikon 3200 and we compared our cameras to eachother.  We found them to have practically identical features except that the Fuji is about $50 less so I know I get the better deal.  One very important thing to keep in mind is that the software be user friendly.  Even if you find a camera that you like, if the software stinks, you won't get the best use out of your camera.  The software with the Fuji is good.", "Date": "June 13, 2004"}, {"Title": "easy, light, sometimes blurry, energy efficient, recommended", "Author": "Troy H", "ReviewID": "R2AMZHAFPO1QJO", "Overall": "5.0", "Content": "This is my first digital camera, but it's easy to use.  I like how it's so small and light that I can carry it with me in my pocket.Pictures are good quality, my only complaint about the pictures is that outdoor photos at dusk or in evening shadows tend to easily blur slightly due to long shutter speeds when the subject is too far away for the flash to be effective.  I don't know if other digital cameras have the same problem as much but this can be fixed by using a tripod or shooting when it's brighter.Another minor quibble is that it's not as easy to change the settings as it could/should be.  To change between night mode to sport mode, for example, I have to go to the menu and scroll through the options.As I understand it, the camera is very good on batteries, I took about 250 pictures (albeit in the span of 3 days) before I had to replace the batteries that came with it.I would definitely recommend this camera, it's small, easy to use, and much cheaper than a similar Canon.  One thing to consider is the price of memory, though.  This camera uses xD memory, which is slightly more expensive (though smaller) than some other kinds.", "Date": "August 24, 2004"}, {"Title": "Cool Camera", "Author": "Yolanda Russell", "ReviewID": "RGHZYZA79R61B", "Overall": "5.0", "Content": "This is my second Fuji, my first was the MX-1200.  It took great pictures, nothing last for ever.  So now I own the A330 and it'sstanding up to my old one even better.  What I like is that you can be in a dim lighted room and take a picture that comes out as if you had all the lights on. Fuji has my business.  Also it's very easy to use.", "Date": "November 18, 2004"}, {"Title": "Great price but ...", "Author": null, "ReviewID": "R1E2BAMHGT9FMT", "Overall": "3.0", "Content": "This camera is a lot smaller than the last year model, Fuji FinePix A210 and costs about 20 to 30 dollars more.  I bought this camera  based on the reviews on the A210.  This is my second digital camera.  The camera comes with 2 Alkaline batteries, a 16M xD memory card.  I use 2 NimH rechargeable batteries instead.  It doesn't come with a case.The Fuji A330 camera is a point-and-shoot camera that has red eye reduction.  I was able to operate without reading the instruction manual.  Under bight light, the LCD screen is very fade and hard to see.  If you want to download the pictures to the computer, you will need to install the USB driver.  I have Windows 2000 and the software installation is a snap.The outdoor pictures are acceptable.  However I was disappointed with indoor pictures. Even at a 4-5 feet range, the pictures were  dark.", "Date": "June 1, 2004"}, {"Title": "Easy", "Author": "sonya popova", "ReviewID": "ROYZ0C5V7ZNRT", "Overall": "4.0", "Content": "This camera is easy to use, easy to carry around in your backpack or purse, though not so easy to break. I've dropped it plenty of times and it stands up against my brutality. I have a 35mm and a digital SLR that I use when I want to take better pictures, but the quality is fine for snapshots or random things you find around town.", "Date": "November 12, 2004"}, {"Title": "Fantastic Camera!", "Author": "Katherine O'shea \"Kathy\"", "ReviewID": "R1X0ZXJXLOA6LS", "Overall": "5.0", "Content": "This is an awesome camera. It takes really great pictures in a room that is dimly lit. Everything came out crisp and clear.  I just got it yesterday, so I am still playing with it. Picture transfer from the camera to my computer was so simple and very quick.", "Date": "December 4, 2004"}, {"Title": "Yay! Great camera!", "Author": "Jessica", "ReviewID": "R13JCK2Q273QA6", "Overall": "4.0", "Content": "This is my second digital camera and I LOVE it! I was impressed with indoor photos and natural light photos. The zoom quality is great. Perfect size to fit in a small purse and to take out at night without being cumbersome. All the menu options are easy to use & obvious to understand,for those of us who hate reading direction booklets. The only complaint I have would be the \"movie mode\" in dimmer settings, it was SO DARK! It also doesn't come with ANY extras; no camera case, rechargable battery, etc...All in all, I love it! Seems to be a great price for it too! Yay Target!", "Date": "January 10, 2005"}, {"Title": "Great little camera!", "Author": "Ellie T.", "ReviewID": "R10USK6WKV8EO7", "Overall": "4.0", "Content": "This is a small, sleek, fun and cute camera!  It takes great pictures in a variety of photographic settings which are easily customizable for the more advanced photographer, or a simple to use \"Auto\" mode for the novice.  The only reason it gets 4 instead of 5 stars is because it doesn't come with a case (can be purchased separately for under $20) and because some of the menu features are not as simple as they could be.  I also had a bit of confusion when first downloading the pictures to the computer, but these were minor inconveniences that I soon worked around.  The camera is both great fun to use, and produces quality prints or digital files!  I would definitely recommend it!", "Date": "December 28, 2004"}, {"Title": "Affordable, compact, easy to use, good pix for a P&S;", "Author": "Clare Quilty", "ReviewID": "R14CPZ01LI5M1J", "Overall": "4.0", "Content": "I am not a photographer and am not really an expert about cameras but I've gotten a lot of good use out of this one.  My main camera is a Sony DSC-S30, which is bigger and heavier and more expensive and which I tend to handle with great care.If that camera were a pair of Ray Bans, the Fuji A330 is like a pair of drugstore sunglasses; I wanted a little camera with optical zoom that I could stuff in my pocket and use without too much worry and this is it.  I also got one for my folks, who were iffy about dipping into digital but they found it easy to use.  It's a good starter camera and it comes with its own memory card and batteries, which means if you're gifting it you have everything in one unintimidating box.As someone else here wrote, rechargable batteries are definitely recommmended. And I, too, wish the camera had audio to go with the video but, for the price and size, I can live without that.", "Date": "December 17, 2004"}, {"Title": "great camera", "Author": "P. Husom", "ReviewID": "R363HJ2KBITXLZ", "Overall": "5.0", "Content": "great camera, especially for the price you pay. about it being the \"worst, most crappy camera ever known to man.\" yeah, if you move the camera while taking pictures, the picture is going to be a little blurry, but that happens with any camera, even an SLR that takes film. the videos? no where does it say that they playback with sound. and having to save pictures? i don't know what camera that person was using, but it's not true with this camera. this camer takes great quality pictures, i used it for 3 months in germany and it never let me down, and i continue to use it over a year later. about the LCD not showing anything: just push the DISP/BACK button once and you've got it. otherwise, the LCD got turned off, which you can fix by going to the menu and turning it back on. i dont know, maybe the kodak easy share is a better camera for someone who has no idea how to take a picture. you do have to have some idea what you're doing with this camera, like how to take a decent picture, but even if you don't, it's easy enough to get the hang of it.", "Date": "October 24, 2005"}, {"Title": "Great Little Gift To A Shutterbug :)", "Author": "Marie Edwards", "ReviewID": "R1ANFU072FLHEU", "Overall": "5.0", "Content": "I recently received this camera as a Christmas gift, along with a spare 128 MB xD card. I was a new user to the world of digital cameras and I was shooting perfect pictures within minutes. I had a few bad shots (due to my own flubs); but all in all my pictures were wonderful, beautiful, & crystal clear images. Between 12/25 and 1/02 I have taken over 150 pictures. I have to go through a few steps to get the pictures transfered to my PC (which is easy, if you can follow directions) and onto CD rom, and not being a patient person that is a lot of trouble--that is certainly well worth it. It certainly beats having to wait 2 hrs at Wal-Mart trying to get 2 rolls of film developed (in one hour) after someone had dropped off 19 rolls to be developed at the one hour photo there. I would recommend rechargable batteries, depending on how much of a shutterbug you are. I like the fact it is small and compact, enough so I carry in in my shoulder bag everywhere. The resolution is super and since I don't need any picture bigger than an 8 x 10 (where the heck would I store or pack something that size?) I don't mind it being 3.2 MP. This wasn't the first camera I was looking at when I was asked what I wanted--but am glad my mom gave me this one--now she wants one too, and she is quite resistant to new technology. All that being said our old 35mm camera only worked with Fuji film (no other film would have pictures that developed, only pictures taken with Fuji would develop); and this product stands up to a great experience we have had with their products. I recommend this for starters, people who want to simply click and save their photos and are not interested in \"editing\"  or anyone who wants an inexpensive digital camera; but keep all the accessories in the box :)", "Date": "January 2, 2005"}, {"Title": "great camera", "Author": "John Scaffidi", "ReviewID": "R2R0E5ERHN0GXL", "Overall": "4.0", "Content": "I purchased this camera yesterday. It is easy to use, takes great pics, color is exceptional. My son has a Cannon sureshot and in my opinion this Fuji has great color. I'm so pleased with the purchase of this camera. I'm still learning but I must say my decision to purchase this camera was based on the photos I reviewed on customer images. I'm not sorry I chose this little camera.", "Date": "February 2, 2005"}, {"Title": "Excellent everyday camera", "Author": "M. Aronson", "ReviewID": "R3FK6ROAIJE735", "Overall": "5.0", "Content": "I purchased mine over a year ago and really love it! The lens stays protected when not in use, thanks to the sliding cover. It's lightweight and small enough to easily fit into my purse. The controls are easy to use (much easier than the controls of the previous Fuji camera I owned.) The quality of the pictures it takes is superb for \"only\" 3.1 megapixels. Colors are true (especially skin tones), focus is always excellent, details are superb and lifelike. Besides regular family photos, I also use this camera for selling small items on Ebay and, again, the quality is excellent. When the time comes for me to replace this camera, it will only be in order to have a movie-shoot function. Otherwise, this has been the best camera I've ever owned!", "Date": "July 11, 2006"}, {"Title": "pretty good camera.", "Author": "Aly", "ReviewID": "R2EROT1LCC6HTF", "Overall": "4.0", "Content": "i have had good experiences and bad experiences with this camera.my sister got the same camera as me on the same day [christmas] and her's lasted about a month before malfunctioning. the flash is not timed correctly with the picture taking and all her pictures come out extremely dark or black. unfortunately we had thrown out the box, and having heard about fujifilms's bad reputation with customers, we did not do anything about it.however, my experiences with this camera have been extremely good! this camera is seemingly very durable [i've definitely dropped it a few times] and takes great pictures. i have not had any problems. the recovery time between shots is a little lagging, but other than that, i have no complaints. my pictures all come out great and the battery life is ok [not the best-but i've had worse]. i've had it about a year though, and it's still taking great photos. and considering my sister is now sharing this camera with me, we've probably taken over 1000 photos. so i guess you have a 50/50 chance! make sure you save the box!", "Date": "November 26, 2005"}, {"Title": "good for the price.", "Author": "leavesinthecity", "ReviewID": "R2GOGC5YEVYM8H", "Overall": "4.0", "Content": "the level of satisfaction you will get with this camera totally depends on what you're looking for when you buy it. If you're looking for a good start-up camera this is the perfect choice. easy to operate, good quality pictures, and an outstanding price.i would definately recommend this camera to that crowd.but if you're more serious about photography and want consistant results from this camera, you won't find it here. about half of the pictures you take will be blurry and only about 10% will probably turn out the way you want.but i can't imagine why those people would buy such a cheap camera if they're that serious. that's why i give it 4 stars.", "Date": "June 13, 2006"}, {"Title": "Decent camera", "Author": "Kenneth P. Meyers", "ReviewID": "R23H4DLH7V1FRA", "Overall": "4.0", "Content": "I am in college and wanted a digital camera to capture all those priceless memories, and this Fuji does a pretty good job.  First thing that attracted me the msot was the price.  I actually bought mine in a combo set that included a printer for $170.  The only bad thing about the printer is I though that it was just a normal printer that hooked up to your computer, but it's a camera compatible printer only, and it's just as big as a normal printer.  Back to the camera.  It's basic functions are pretty easy to use.  I'm one of those people who don't really read a manual, I just jump into it and figure it out.  At first, I couldn't figure some things out like how to view my pictures I just took.  But after a few minutes of button pushing, I figured it out.  The quality of pictures on my computer seems really great.  I haven't printed any prints yet, but I have faith that it will be great.  It's fairly small in size, but I wish it was smaller like an Elph.  Overall, I think that this is a great camera for the low-budget starter or for someone who doesn't care a whole lot about printing every picture that they take.  This isn't a camera I would buy if I had a bigger budget though.", "Date": "February 8, 2005"}, {"Title": "Good Camera under $100", "Author": "Sriram", "ReviewID": "RY4CXBY8RPMU6", "Overall": "4.0", "Content": "I own this camera for past 1 year. Its doing good - both at indoors and outdoors. The picture quality is decent with no grains. I usually prefer to take prints than sharing thru computer. The prints are nice in 4 x 6.The macro mode is not so great...but it works. The battery life is excellent. I've taken over 200+ pictures using rechargable batteries and still battery is alive.Pros:1. Good picture quality for 4 X 6 prints. May be even for higher size. But I've not tried.2. Excellent Battery LifeCons:1. Date & Time is not imprinted in the image. Tried DPOF settings. Still not happy.", "Date": "May 7, 2006"}, {"Title": "Great camera", "Author": null, "ReviewID": "R58V9974YYWLZ", "Overall": "4.0", "Content": "This is a great camera for a novice. If you are taking a picture of fast moving objects or people, you would want to use the sport mode. Otherwise, just set the camera and light settings to &quot;Auto&quot; and you're done!", "Date": "May 14, 2004"}, {"Title": "6 year old camera retains value?", "Author": "Angela Mohle", "ReviewID": "RGTGWXPN7L1F5", "Overall": "4.0", "Content": "I found this camera in the bottom of a water-damaged box in the storage shed of a house I bought! It had a tiny 512MB card in it (I own 2 Olympus cameras, so I was happy about the xD card) While I can only shoot about 10 pics before it fills the card, the quality is better than expected for old technology and a camera that was, more than likely, abused to start with. You have to really play around with the settings to make sure you know what you're doing in various photo situations, but I'm still impressed. Let me reiterate: for 6 year old technology, it's probably better than the other cameras that were out there at the time.Obviously, I would not recommend buying this camera at full price now. If you can CL one or find one here used, go for it. It's a great throwdown in case you're not willing to chance a DSLR disaster or you're traveling and don't want to worry about it getting bumped around. In addition, with new inventions, you can get a microSD to xD adapter off eBay or maybe here on Amazon. That solves the problem of xD cards being hard to find in stores and expensive to boot.", "Date": "January 30, 2011"}, {"Title": "Great starter camera!", "Author": "Christin Templeton", "ReviewID": "R38FYIC2VLI4DN", "Overall": "5.0", "Content": "This was my first digital camera and it worked (still does several years later) great. It's very easy to use!  I also bought the camera's docking station for my computer which makes transferring/sharing the pictures SO easy.", "Date": "January 22, 2011"}, {"Title": "Best 1st Digital Camera I will have", "Author": "Kindra K. Martinenko \"Technology Wiz\"", "ReviewID": "R1M8W584ENQ7TD", "Overall": "5.0", "Content": "I am writing this review on my 3 year old FujiFilm FinePix A330 because I will soon be ordering another FujiFilm (probably a S700) and I wanted to pay due respect to my trusty 1st digital camera I owned.Believe it or not, the A330 consistently takes professional quality outdoor photos for which I have always been grateful for because that is what I use my camera for.  I take it out in the middle of nowhere and have taken clear, crisp photos.  It is hard to imagine a 3MP digital camera being able to take great pics consistently in this age of 10 MP cameras.The 3x Optical zoom was perfect for close-up flower shots or far away mountain shots. The stability on this camera was excellent considering it is a entry-level camera where many of comparable price will blur and distort.This camera had just enough features on it to take great pics, but was not overwhelming for me as a novice digicam owner.  I liked the fact that I could turn the camera on, point, zoom, and shoot.To sum it up, I love this camera and will keep it as a back up. It has turned me from a novice to a photographer taking award-winning photographs in 3 years time and I cannot wait to get my hands on my next FujiFilm with twice as many megapixels and 10x optical zoom in the S700!", "Date": "May 27, 2007"}, {"Title": "My first non-disposable camera.", "Author": "SonicM88 \"-Matt\"", "ReviewID": "R12JBE3SS697EB", "Overall": "5.0", "Content": "I received this camera about 3 years ago as a Christmas present.  It was the first camera I had unless you count maybe 2 or 3 disposables.  So, obviously I feared I would have a lot to learn about taking good pictures but this was not the case.  This camera is incredibly easy to use for anyone and includes an extensively detailed instruction manual that should clear up anything (it also explains some basic image taking tips that are very helpful).  I like things simple so I leave the camera on Auto about 95% of the time and it does an amazing job.  I don't know anything about white balance or EVs and frankly I don't care because I get the pictures I want.  I can't vouch for the ease of use of the included software however because I simply plug it into my Mac and drag and drop the images because I don't like \"messing up\" my pictures with all the editing.  I don't believe in changing things in my pictures (except possibly cropping) because I think it's \"cheating\" to enhance images after they've been taken (I won't go into further detail about this because I don't want to start arguements).This is a very basic point-and-shoot camera (a camera for everyday use by the average person).  Here is a breakdown of the pros and cons.Pros+takes great pictures if you know nothing about cameras (other than, obviously pushing the button)+takes great pictures in various light settings+the macro mode (close-up) is amazing and you can get incredibly close to your subject+incredibly easy to use and yields great results comparable to \"better\" cameras (better cameras include newer cameras, or cameras with more megapixels)+great prints are made from the pictures (although I don't make many prints)+there is a zoom feature+there is a video feature+has a viewfinder (not digital which is another +) that is very accurate+the LCD is very sharp+the lens is covered completely so it can't get damaged, if the camera is off (the front part that says \"Finepix\" slides over the lens which retracts into the camera)+uses AA batteries+I've had no problems at all with any part of this camera at any timeCons-takes a long time to start up if you need to snap a shot quickly-night shots are blurry if you don't use a tripod-the LCD is small-the video feature lacks audio to go along with it (I don't really use this much though)-battery life could be better I suppose but I manage to get about 150-200 shots per charge ( I use rechargeable batteries)-the memory card is an xD memory card (which translates to nothing more than a memory card that's a little pricey, but you can still manage to find good deals on the cards)-the zoom doesn't get you that much closer to your subject which is fine for most users but I personally would have liked a little more zoom-only has 3.2 MP because it's somewhat old which means that you can't make large prints (larger than 8x10)The pros outweigh the cons.Bottom Line: The only reason you shouldn't have this camera if you're at all interested in basic everyday photoshooting is because it's a little outdated and if it had 1 more megapixel then there would be no reason to not have it.I have submitted a couple images that I have taken so you can see the beautiful results this camera produces. Remember that when looking at my images THIS IS MY FIRST CAMERA!If you have any questions about this camera feel free to e-mail me sonicm88@hotmail.comI hope this review, in conjunction with my images that were submitted, help you make the right decision about buying your camera.Just as a note of interest: When I upgraded to a newer camera I switched to a Kodak Z-650 (or 700, I don't remember which) and had terrible image and transferring problems.  I returned the camera and bought myself a Fuji E900 which I love now.  Fuji has the best cameras on the market in my opinion.", "Date": "February 15, 2007"}, {"Title": "Great Camera", "Author": "M. Parker", "ReviewID": "R36YGPOK53SV0A", "Overall": "4.0", "Content": "My first digital camera, but I love it! It's super easy to use and you can easily get your pictures on to your computer. The software it comes with is completely useless and poorly designed, but you don't need it for anything. A great product!", "Date": "January 9, 2005"}, {"Title": "Is a fine camera while it works...", "Author": "Jerry P. Finn-kelcey", "ReviewID": "R35XA2CPC49QIM", "Overall": "3.0", "Content": "One week after the warranty expired, nearly all my shots had horizontal lines on them. I took it to the Fuji Service Center in Thailand and they diagnozed the lens was at fault. The charge to replace/repair was $95.00. So not a good bargain after all.", "Date": "May 6, 2005"}, {"Title": "Frustrating Little Bugger!", "Author": "Lysette Hickman \"Lysette826\"", "ReviewID": "R6688ITL5Z80G", "Overall": "2.0", "Content": "This camera is tempermental as all heck! Have had good and bad shots, more bad than good! Pic after pic is blurry and now I have a \"card error\" message that won't go away even after purchasing a new memory card! Anyone know how to troubleshoot?", "Date": "March 24, 2006"}, {"Title": "Didn't work.", "Author": "jason lane", "ReviewID": "R1TY13N2ML9VDH", "Overall": "1.0", "Content": "I bought this camera to replace the one that was damaged & it was just as damaged as the one I was replacing.  Very upset with this.", "Date": "October 9, 2013"}, {"Title": "Decent camera for the money", "Author": "Xavier", "ReviewID": "R15LA0QHU8QPA5", "Overall": "3.0", "Content": "This is a decent, cheap camera that's getting cheaper -- I think I paid about $150 for it, and I see Amazon has it for under $100 now.  It takes good pictures indoors and out, although the flash has a harsh quality that makes indoor portraits unattractive.  For outdoor fill, the flash works great.  Movie mode works well, but without sound, is kind of useless.  The controls are all very easy to use, battery life is good, and the sliding lens cover is a good feature.  The camera is lightweight and easy to carry along, but is a bit too bulky for a pants pocket.  The case is a combination of plastic and metal (aluminum I think) that feels a bit flimsy but has held up OK in the two years I've had mine.", "Date": "November 27, 2006"}, {"Title": "Not Worth the Gamble", "Author": "hmbiker", "ReviewID": "R227ATLSE2CABZ", "Overall": "1.0", "Content": "With so many cameras out there manufactured by companies with GOOD customer relations why take a chance on a Fuji unless it was free. I have 4 other digital cameras that I have purchased over the last 7 years (Kodak, Canon, Nikon) and have never had a problem. This FUJI is junk. I had the card error problem and the blurry picture problem. The camera will not focus at any distance and Oh Yeah! just after the warranty expired.", "Date": "April 4, 2006"}, {"Title": "FujiFilm FinePix A330 what a pleaser", "Author": null, "ReviewID": "RUCZLVVPGSTMW", "Overall": "4.0", "Content": "What a pleaser to finaly get a Camera that works for my specific needs that I use it for.As I take my company's product pics with it and most of the time the colors and evrything comes out perfect only time its not perfect is when my lighting is in correct and the high res. and low res options also is fantastic.", "Date": "June 22, 2004"}, {"Title": "good throw away camera", "Author": "Melisa Ellers \"melisa\"", "ReviewID": "R24XVB1PSSR4PC", "Overall": "1.0", "Content": "camera works good the first day after that pictures dark and blury lcd screen works when it wants to would not reccomend purchasing!!!!", "Date": "June 9, 2006"}, {"Title": "BEWARE!", "Author": "Beav", "ReviewID": "RG069DT5VMK8T", "Overall": "1.0", "Content": "FUJI FILM HAS EXTEREMLY POOR CUSTOMER SERVICE AND THEIR CAMERAS ARE ONLY BUILT TO LAST THE LIFE OF THE 1 YEAR WARRANTY.I've had 3 Fuji camera now because they keep breaking.  The last time my camera broke was a month past the warranty expiration date.  Out of frustration, I wrote a letter to Fuji and the store I bought my camera at to complain and I didn't get any response from Fuji...  I know they got the letter, because I got a response from the store that I purchased it from and they agreed to pay for the repairs.And, I'm not the only one, unfortunately you don't hear about this stuff until AFTER it already happened.", "Date": "November 23, 2004"}, {"Title": "What a P.O.S.!!", "Author": "Brian L. Blair \"carhaulerbrian\"", "ReviewID": "RK5KHY088V9VW", "Overall": "1.0", "Content": "I have trouble even believing that the folks who wrote reviews of this camera ever used it. I bought it to replace a Canon Sure-Shot (which I lost). There is basically nothing good about this camera. It takes too long to work, has no audio on the video mode, and the images (both still and video) are terrible. I am absolutely returning it to the vendor, and have no intention of trying any other camera products from Fujifilm.", "Date": "December 10, 2004"}, {"Title": "HORRIBLE CAMERA--DO NOT BUY!!!!!", "Author": "kimbop \"mrs. inglima\"", "ReviewID": "RD2WGFIZ4SGUP", "Overall": "1.0", "Content": "this is the WORST, most CRAPPY camera ever known to man! the pictures come out horrible and blurry, the videos replay no sound on camera, and you have to save the pics.so that means if u got a great pic and u 4got 2 save it b4 u turned it off, it'll go away forever. i would MUCH rather buy/reccomend a kodak easyshare, knowing i just got thatand it is so much better-the pictures are so much better looking and have much better quality, the videos play back sound and can go on forever (depending on the memory card,) and it is much cooler. so buy a kodak easyshare, do NOT buy this.", "Date": "July 12, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.2-megapixel resolution for photo-quality 11-by-15-inch enlargements\nFujinon 3x zoom lens\nSliding lens cover design; movie mode without sound; improved operating speeds; PictBridge compatible\nStores images on xD memory cards (16MB included); connect to computers via USB 1.1 or 2.0\nPowered by 2 AA-size batteries (alkaline included, rechargeable NiMH recommended)", "Name": "FujiFilm FinePix A330 3.2MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51CJH925DVL._SX300_.jpg", "ProductID": "B0001D56SM"}}