{"Reviews": [{"Title": "Had high hopes for S7c but was dissapointed.", "Author": "Matt \"Custom\"", "ReviewID": "R2AZ3T9AQAINQS", "Overall": "2.0", "Content": "This camera is stylish, thin enough to be comfortable to carry in a pocket for entire day, has a large screen, but the performance is overall disappointing.Battery life was hardly 100 pictures.Focusing and taking a picture is very slow...usually more than 4 seconds when it has to use the focus assist light indoors. Everyone comments on that when I'm taking their picture.  In addition, unlike most cameras that have multiple focus points (7,9,11,etc), this camera only focuses on the middle point of the picture by default.  There is a nice feature that lets you manually move the focus point around to anywhere in the scene, but it takes a lot clicks and time so I don't bother using it.The lens is not wide enough for daily use and most pictures come out very soft in the center with bad chromatic aberration and a lot of distortion at wide angle.WIFI is slow and useless in all but the most rarest of situations.  They should have just used Bluetooth so that anyone could use their phone to email the picture or at least be able to email/ftp directly to any email/ftp you want.The screen smudges very quickly, but it's easy to clean and can't see the dirt when the back light is on.The camera decides when the electronic VR (image stabilization) gets used and most of the time doesn't activate it.  And even when it does activate it, it just increases the noise and the picture still comes out soft.  There is an option to clean up the image after it's been taken, but the camera tells you that it's not able to do it for many images.The camera corrupted my Sandisk ultra II sdcard, something that my former compact digicam didn't do in two years.The movie mode, on the other hand is very good.  The movie files do get fairly large...about 1mb per second, but very smooth, very stable and have good color.  There is a constant buzzing noise in movies though.The scroll wheel is fantastic and should have been incorporated into many other cameras. It makes browsing pictures and menus extremely fast and easy.  It really saves thumb fatique.  The camera is quite fast at switching between pictures, modes, etc.  So that...(plus the movie and style factor) are the ONLY redeeming features.It's also very hard to get used to not having an actual switch to switch between movie and picture mode.  Having to go trough though the menu can sometimes make you miss a photo opportunity because the camera is set in video mode and switching to photo is not a one button operation.Overall, I don't think it's worth the price.  What am I getting to replace this one?.....the Canon SD800.", "Date": "November 2, 2006"}, {"Title": "Takes flattering photos that are true to color!", "Author": "hair guru", "ReviewID": "R3NT0EWRNOXCTF", "Overall": "5.0", "Content": "Pros:-Small size and weight; Can fit into pocket or purse without feeling you are carrying a brick. Sleek design and large 3\" LCD has 230,000 resolution, which means when you take a picture you can actually see how clear the picture is and you don't have to zoom in to see what it looks like.  Not the case with SD 600/630.  The new canon model coming out soon has highter resolution.- Takes great snapshots with flash or without flash with plenty of light. Not for those that love to play with tons of settings and I would agree with previous reviewer that ISO settings worsen the quality of the picture.  Adjusting the exposure isn't difficult and you would need to click through the menu to adjust it, but that's something that all digital cameras require.-The color of the picture is more true to color than what I've experienced with Canon powershot A70, SD 600/630 and the flash isn't so powerful that it creates an unrealistic brightness or whiteness to people's faces.  The flash creates an even brightness throughout the entire picture as opposed to just adding light to your face and leaving the background pretty dark-Very easy to use; Very easy menusCons:-The picture isn't as sharp as the Canon SD600/630 when you take a picture inside without the flash and don't have adequate lighting, but it is perfect with the flash on.-You have to hold camera steady and any slight movement might blur the shot, which is true of other digital cameras, but the Nikon s7c is a little more sensitive to that.  Same thing with moving objects.-Smaller buttons, but the camera is small and thin to begin with, thus, you can't expect to have a tiny little thing with large buttons.-No viewfinder, which didn't bother me, because I don't use it to take a picture, but some people prefer to have it.-Lithium ion battery doesn't last very long (other digital cameras use a lithium ion battery as well, but there are some that use double AA size batteries so when the recharecheable batteries die, you have an alternative.  Those would be larger cameras, of course.)Overall, this is a camera that takes great snap shots. If you are in low light, use a flash, don't bother with iso settings.  It's just not meant for those things and when I go to any event, I really don't have the time to play around with settings and just want a good quality picture without pushing too many buttons.  I was looking for a camera that takes true to color photos with a flash that adds flattering light as opposed to overexposed faces that make people look frighteningly pale.I love it, but no camera is perfect with every feature.Try it out and compare it to others and look for the features that matter to you!", "Date": "October 8, 2006"}, {"Title": "A different reality", "Author": "Dr. Jim Taylor", "ReviewID": "R3REA8XV5UHP4J", "Overall": "4.0", "Content": "I don't get all of the negative reviews about the S7c. I got one for Xmas and find it great. I had a Pentax Optio S (circa 2002) and the Nikon is a major step up in quality and features. I'm no photo geek, so I have pretty realistic expectations what a point-and-shoot digital camera is for and what it's limitations are.I did tons of research and narrowed my choice down to the Nikon and the Canon SD630 (both have 3\" screens). Among professional reviewers, the Canon did come out a bit ahead (e.g., cnet), but all of the professional reviews of the Nikon were very positive (and I don't have nearly as a discerning eye as the pros). I went with the Nikon because it has 7 megapixels (the Canon has only 6), I liked having fewer mechanical parts (no mechnical retractable lens), and the wifi seemed like the next big advancement in photo sharing.Pros:1. Great photos in most conditions.2. Large screen size.3. Simple and intuitive menus.4. Small # and good placement of essential buttons on camera.5. Wifi is the best. It took some effort to get it set up (Nikon tech support was great), but once I got it going, downloading to my PC is fast and easy. I've also used the Coolpix Connect to send email to family and friends, and it worked seamlessly. Every camera should have wifi!6. Pictmotion is a great and fun feature.Cons:1. In some indoor light, the flash goes off when it doesn't need to, causing overexposure.2. Nothing else to speak of at this point.Overall:I'm really pleased with the purchase.", "Date": "January 5, 2007"}, {"Title": "Nikon coolpix s7c is a HORRIBLE choice", "Author": "Jeffery Lennan", "ReviewID": "R2UWMGQA7P2971", "Overall": "1.0", "Content": "I have been searching reviews of the Nikon coolpix s7c to make sure that it wasnt just me - and I am finding that indeed countless other reviewers are having the same problem, and many have taken it up with Nikon only to be told 'sorry'.In a nutshell, I am a professional photographer and have owned about a dozen digital cameras ranging from the early elph to nice new SLR models.  I purchased the Nikon coolpix s7c for my wife, and it is by far the worst one I have owned for many reasons, but the chief problem is they have simply screwed up the way this camera does things automatically and the result is HORRIBLE PICTURES.The 'electronic VR' is simply digital image sharpening, the ISO adjustments in low light are terrible, and what I simply cannot believe is how terrible the autofocus is.  Couple that with the design of this camera that makes it difficult to shoot steadily, and you literally end up getting more than 50% blurry pictures.", "Date": "April 3, 2007"}, {"Title": "GREAT CAMERA", "Author": "Emanuele Di Rienzo", "ReviewID": "R398NQZUN6F7SK", "Overall": "5.0", "Content": "Is somtimes difficult to understand some of the reviews for that camera. One review for instance says that the quality of the pictures is fantastic and the next one says that it's terrible. This camera is (like most cameras of this kind of any brand) basically a point and shoot camera and it will of course never have the performance of a Nikon D 200 or even of a D50. It is not the same range and not the same price. But for what is is, it's an excellent camera that takes great pictures. I bought one to update my \"old\" S1 and to take everyday pictures, I am quite satisfied with it. It takes great pictures , great videos, is fast enough for a \"normal\" use, the display frame is one of the best and wifi works well.", "Date": "January 6, 2007"}, {"Title": "Nikon Disaster", "Author": "Matthew Flynn \"fredrockman\"", "ReviewID": "R2WZ89IR0BTUU0", "Overall": "1.0", "Content": "I bought this camera with high hopes and it is by far the WORST digital camera I have ever owned. It looks great but the picture quality is terrible--grainy, spots and ghosts. I cannot tell you how bad the picture truly are. I had a Kodak and I am going back... and I am tech savvy and take pictures for publications.", "Date": "December 6, 2006"}, {"Title": "This Coolpix got me steamed, and it's goin' back!", "Author": "lighten_up_already2 \"lighten_up_already2\"", "ReviewID": "R38RIAG60KBCLK", "Overall": "2.0", "Content": "I put this camera through its paces today and I don't feel cool at all. I'm steaming mad at this camera.Before I rant, I will say the big screen is nice and the menus are nice and big and readible, and I mastered almost all the controls without referring to the manual.  Nikon did do some things right.But what they did wrong was really wrong.  The vibration reduction is really just a sharpen filter, like in Photoshop, applied to the blurry image you just took with your camera that has no real vibration reduction cabability.  What's worse, once this \"electronic\" vibration reduction is applied, the picture on the camera's screen looks way better than it really is.  You only find out that the camera doctored a blurry picture when you move the image to your computer and look at it on your big computer monitor.Also, it seems that many of the pictures I took were fuzzier than I expected, or the color was just washed out.  I never really got a \"Wow, that's amazing\" picture out of the dozens I took.The macro mode is terrible.  Even in macro mode you can't get more than about four inches from the subject.  Did you know that other cameras let you get 4 cm from the subject?  This camera is worse for macros than my Minolta that I bought two years ago!Finally, the \"quick start guide\" that comes in the box tells you to take the camera out of the box, attach the wrist strap, put in the battery, charge the camera, etc.  However, it never tells you to put in a memory card!  DOH!So, if you want a point and shoot camera with a big readible screen, and you don't care so much for picture quality, buy this.  If you want great pictures, better check out some other cameras.", "Date": "December 26, 2006"}, {"Title": "Nikon Coolpix S7c 7MP Digital Camera", "Author": "A. Scherz \"Runner\"", "ReviewID": "R3T5WYLSC48L43", "Overall": "5.0", "Content": "This is a wonderful camera. I had the Nikon Coolpix S1. It was also excellant until I dropped it. I replaced it with this S7c. The view screen is bigger, 3\". The camera itaelf is slighter bigger than the S1 but still very compact and easily fits in a pocket. The play back of photo feature is easier to use than the original. Picture quality is superb. As with the S1, the S7c is slow to take pictures in flash mode. This can cause you to miss some candid shots. Camera is certainly worth the cost.", "Date": "January 19, 2007"}, {"Title": "Less than I was hoping for", "Author": "Philippe Hartley", "ReviewID": "R1IJUJV3Q4O52P", "Overall": "2.0", "Content": "The camera feels slick.  The software that comes with it gets a 4 star for efficiency, though the intuitiveness is not its strength.  While the large LCD display is terrific (the main reason I got it), It is worthless in a high glare situation.  You can't see what you are shooting.  It's worthless!  And since Nikon did not give you a viewing lense for such situations, there are times whey you have no idea what you are shooting.While the viewing wheel, to rapidly cycle through the shots you've taken, is quite handy, the rest of the navigation is less than intuitive, and often takes so long to figure out that you give up.  Pictures are generally good, though the conditions have to be perfect, or you get grain or blur.There is one lovely feature, but it is only useful on a tri-pod.  It is a function which allows you to take a flash photo and have the aperture remain open for a little while after to fill in the background.  It creates flash shots without the black void background typical of such pix.  I use that feature a lot, but its worthless without \"legs\" for the camera.I bought this on a whim, counting on the Nikon reputation.  Had I known, I would have stuck with the Canon.", "Date": "January 17, 2007"}, {"Title": "A nice camera and versatile", "Author": "J. Lin", "ReviewID": "R1H9CBO9SC5ME1", "Overall": "5.0", "Content": "I bought this camera for travel, so I had 4 simple criteria:  (1) Small size and fairly light weight (fit in pockets), (2) decent optical zoom and MPixel, and (3) small/simple docking station/charger (for those extended trips, (4) large LCD screen, so what you see is what you get.I found the camera to exceed those criteria.  I took it to skiing, put in my ski-jacket pocket.  Despite a few tumbles in snow (not direct major impacts), the camera survives and work well.  I actually dropped it on the floor (in door) once or twice, and not a scratch.  The colors are vivid, the red-eye reduction works well, and vibration stabilizer works well.  Took pictures in a moving car of the landscape, and they came out well.  It has many other special features (which I am exploring right now - like panaramic overlay), and they seem to work well.I got a Kingston 1 GB Elite Pro Secure Digital Memory Card to use with this camera, it worked well.  Even took several movies with this camera durng my trip, and they came out great.  For the value, functionality and quality of pictures, it does what a travel camera should do, take good travel pictures to showcase one's adventures.", "Date": "January 9, 2007"}, {"Title": "Nikon Coolpix S7c auto mode leaves domething to be desired", "Author": "C. Sutton", "ReviewID": "RDNIWBLOFZ8GX", "Overall": "1.0", "Content": "I am disappointed by the poor image quality of this camera in automatic mode.  I gave it to my wife as a gift and she did not use it first until the 30-day return peroiod lapsed.  The auto-exposure feature does not work well.  It sets a very high ISO rating causing the flash not to flash indoors and the photo to be too grainy.  The photo is good when the ISO is set to 100 manually, but then the flash is too weak to take anything but close-ups.  A 200 ISO setting is a compromise which enables the flash to light the subject, but it more grainy than my Canon at ISO 200.  In short, my wife prefers her film camera and does not want to fiddle with setting the ISO manually for a better photo.", "Date": "November 24, 2006"}, {"Title": "Wifi = good.  pictures = bad", "Author": "Steven Crowley", "ReviewID": "R3TC0DFUBJP6LE", "Overall": "2.0", "Content": "The wifi is a great idea!  The idea on paper sounds amazing, but the way you had to do it was horrible.  it gave you no control over what pictures or anything.  plus it was slow.The Picture quality was HORRILBE!!!  M y two Megapixel cell phone takes better pictures than this camera.  They look AMAZING on the LCD screen, but once you get them on the computer, they are fuzzy, grainy, etc.I would not recomend this camera to anybody.  yes, it has some nice features, but the pictures are anything but acceptable.", "Date": "February 12, 2007"}, {"Title": "Awesome pics and video", "Author": "M. Cox \"Cox Corner\"", "ReviewID": "R3AG62L612ZURE", "Overall": "5.0", "Content": "We bought this camera to keep handy so it would always be available around our newborn daughter. We bought a case that fits on the strap of a diaper bag/backpack/purse/briefcase and this camera is always ready when needed. The size is great!! We did not intend to buy a professional level camera (Would have bought the D80 if I was looking for professional settings). THIS CAMERA IS AWESOME!! The response time is quick, we have not missed a shot yet. When our digital video camera is not readily avialable, it is very easy to shoot video with the S7c. Battery life has been great. Everyone who sees the 3\" screen is jealous of it. Picture quality has been outstanding. I've read several reviews that mention problems with blurry images and having to delete pictures that are out of focus; I think these people must have issues. I have not seen one picture that was the least bit blurry. I have printed pics at home on my HP photo printer and I have had photos printed at Costco, Wal-mart, etc. and the quality is always the same...AWESOME! I researched for months (9 to be exact) before making my decision and I don't think there is a better compact camera available. If you want SLR features, buy an SLR. If you want the best pictures from a small camera with point-and-shoot features, buy the S7c.", "Date": "January 11, 2007"}, {"Title": "Everyone needs to slow down. This is a GREAT camera", "Author": "Daniel Neve \"Photo Pro\"", "ReviewID": "R2CV0TGQ2FK3JI", "Overall": "5.0", "Content": "I am a semi-professional extremely serious recreational photographer and I run a successful photography website and have sold several photos that were taken on this camera. I own a mess of DSLR's ranging from Canon to the latest and greatest Nikons. Even in comparison to thousands of dollars worth of SLR's these photos are pretty good. I have owned this camera since it's debut and are still using it in 2009 and will continue to use it in 2010 and probably longer. My girlfriend has brand new Samsung Dual View and the image quality, ease of use, zoom, and flash of the S7c kill it. I have had absolutely no desire to get a new point and shoot camera since I purchased this camera. If you know what you are doing and just spend maybe 15-30 seconds to set up the camera up you can take amazing photos, not to say just turning the thing on and taking a picture on auto is bad. The people who complain about the noise in the photos are crazy. I have posted pictures that were taken in Vegas from the top of the eiffel tower at the Paris Hotel so feel free to take a look. These were taken in an auto mode and since the photo was taken in dark conditions the ISO was set fairly high and there isn't much noise at all. The fact that the camera is a sensible 7MP rather than a 10 or 12MP helps keep the amount of noise low. When you overload an image sensor with 12MPs of information the amount of noise increases. You can get clearer pictures out of a lower MP camera because once you overload sensors with useless information the image quality goes south. That's why even the $2,000+ D300 Nikon DSLR is a 12.3MP and that has a huge (in comparison to PAS cameras) image sensor.  It comes down to this: would you like to view a slightly smaller yet still full screen image thats clear or would you rather have a picture thats overloaded with noise and awkward lighting that can be blown up to the size of a billboard. If you still like the billboard idea this isn't the camera for you. However please note!!!!: If you are shooting action NO point and shoot camera will give you a professional look. In sports mode with the S7c it does well but it's no SLR nor will any POS be. But if you are looking for an all around great camera you should highly consider the Nikon S7c. I hope the review helps", "Date": "November 4, 2009"}, {"Title": "Great camera", "Author": "Howard \"long time camera user\"", "ReviewID": "R37DFQDYTHMYV7", "Overall": "5.0", "Content": "This is a great camera that allows you to just point and shoot but with the potential for lots more. We took it to Italy for a month's trip and on one 2 gig disk we shot 750 pictures and 15 short movies.  Very user friendly device.", "Date": "January 3, 2007"}, {"Title": "Not a bad purchase.", "Author": "R. S. Ballesteros \"That's How I Roll\"", "ReviewID": "R3PQ9RUXJL6BA8", "Overall": "4.0", "Content": "First, I knew what I was going to get in a small form camera.  I also have a Nikon DSLR D200; prior to that a D100; and prior to that, 3 Nikon SLR cameras.  The S7c is a camera that serves it's purpose: snap shots; capturing moments of time in a small form size.  If I needed images of better quality, I have my DSLR with the functionality and performance.  To expect the performance of the S7c to match that of a D200 is crazy.I did appreciate the large LCD screen and the WiFi is a feature that I enjoy very much.  Again, I knew what I was getting so the focusing mechanism, the VR, and the flash is adequate for what I have used it for.  And, for a plus, it's easy to carry.I would recommend this camera for those looking for a small form size camera.  It's not a \"silver bullet\" that several reviewers where expecting.  If you need a high performance camera, the S7c isn't; look for a DSLR.", "Date": "December 31, 2006"}, {"Title": "A-OKAY", "Author": "Barbara Beck", "ReviewID": "R2ID0BH8FPA7UL", "Overall": "5.0", "Content": "This camera is great. I haven't used the wifi component yet ( because you need a t-mobile plan) and I've  heard all types of reviews about it. Otherwise, the camera works great. Many have been complaining about the flash function but I have never had a problem with it . The blur reduction could be sharper but,  its good regardless.  I highly recommend this camera. It has a sleek design and works great!", "Date": "January 30, 2007"}, {"Title": "Nikon Coolpix S7c", "Author": "Floridan", "ReviewID": "R1NKT890435C83", "Overall": "4.0", "Content": "I was using a Nikon S3 until it's lens failed without warning. I chose the S7c because besides the S3 it's the only small digital with decent macro capabilities below the expensive full size SLR models. So far the S7c appears to take high quality photos on par with the S3. The only problem is that it won't interface with my Canon downloader (the S3 did). Right now I can't attach pictures taken with the Nikon and transferred using Nikon's software to emails. I'm looking for a solution to this.", "Date": "October 26, 2010"}, {"Title": "Nikon S7c camera", "Author": "Jonathan R. Adams \"adrenalinanimal\"", "ReviewID": "R15MOD03FGHQ19", "Overall": "4.0", "Content": "PRO:compact, small and flat.Large viewing screen.VersitileHandles 8gb SD cardsBetter than not having a camera but a full size Canon ESO or Nikon D80 are the way to go for real picture quality in fast bumpy conditions like wakeboarding.Con:Video is at a low resolution.Video imagage stability is shakey.Small on/off button and zoom buttoms are difficult to use.Changing from video to picture must be done by a menu.Slow operation compared to full size cameras.Protect the large screen, we broke ours snow skiing.Buy 4-6 extra batteries.Internal flash eats batteries quickly.Docking station is OK but would like cord only option for traveling.", "Date": "August 5, 2008"}, {"Title": "LOVE it", "Author": "Patty", "ReviewID": "RP08XO8XP9EK1", "Overall": "5.0", "Content": "Excellent camera. I've been buying and testing so many cameras until I found this one, VR great plus,good pictures on low light, good color quality, 3 inch display, fits in my pocket, lots of features...love it, love it.Great looks too", "Date": "February 26, 2008"}, {"Title": "Not a good camera", "Author": "O. J. Weber", "ReviewID": "R2V3TMQ0IEUUB5", "Overall": "2.0", "Content": "I had a Minolta DimageX that died after several years of abuse and great photo's.  So looking for a new camera I selected the s7c to use as my next pocket camera based on all great early reviews from the photos sites. I should have waited for user reviews, I hate this camera and the night pictures are bad.  I mostly use this for night shots when I am out with friends, dark pictures don't focus well. The red-eye reduction flash is so long that people think you have taken the photo and move by the time the shutter actually goes (if you turn off the red-eye reduction it helps a little, just need to fix it later).  The shutter lag is extremely long, it feels like you are there pressing the button for hours - and the button for me is small.  Hard to use. So after much experimenting, I am able to get decent night pictures about 75% of the time (I have no complaints about day photos), but if you give this camera to another person to try and take a photo of you, you are almost assured of a bad photo. They will line it up, but it won't come out good, it will be blurry.  It takes someone experienced with the camera to get a halfway decent photo.At this point I long for my 2 megapixel Minolta...", "Date": "November 29, 2007"}, {"Title": "Not Pleased:(", "Author": "Dave Owen", "ReviewID": "ROHY7C51FAUR5", "Overall": "2.0", "Content": "Not a good camera.  Terrible in low light.  Terrible focusing in low light.  Just, all in all, a bad camera.  Invested so much time in the whole wireless feature, forgot to perfect the basic camera necessitities.  Trust this review, have had several cameras and none have which have been near this frustrating to own.  Looks are cool but thats where it stops!", "Date": "July 5, 2007"}, {"Title": "Not My Best Nikon", "Author": "R. Campora \"taxman\"", "ReviewID": "R3K9ALU1FV53OD", "Overall": "2.0", "Content": "I've always been high on Nikon products but can't stand this unit. Yes it takes fair photos and has all the flexibility anyone can expect in a camera. The bigest and most serious drawback is the inability to view anything on the screen on a bright, sunny day. On a recent trip to Italy I couldn't use it outside during the daytime. Thank God I had my Canon as back up otherwise I wouldn't have any pictures.", "Date": "June 2, 2007"}, {"Title": "What has happend to Nikon", "Author": "C. Schierkolk \"Tired Parent\"", "ReviewID": "R14OU0KDX5CP5Q", "Overall": "2.0", "Content": "What a horrible horrible horrible camera this is. The only thing that is nice about it is the looks. Like other lessons in life, looks aren't everything.Run Away!!!", "Date": "February 4, 2007"}, {"Title": "The Camera Tha Pleases", "Author": "Jane S. Rapp", "ReviewID": "R11AH7NKE6TGAA", "Overall": "5.0", "Content": "Thsi camera was purchased as a goft to my son and his wife.  It was delivered directly to them.  The report is that the camera has taken over 500 shots in less than three months.This was the specific gift that my son wanted.It is used all of the time.  During the holidays I had the opputrunity to use the camera.  It was great!  Is is compact in size, very lightweight, and very very easy to use,  Thank you Amazon for h aving hte procudt in stock.", "Date": "January 7, 2007"}, {"Title": "A good purchase", "Author": "Eduardo Bustos Bobadilla \"ebustos\"", "ReviewID": "R2BLX27LAPUIHR", "Overall": "5.0", "Content": "I enjoy the large built-in LCD, the amazing colours and the beautiful pictures captured with it.", "Date": "January 11, 2007"}, {"Title": "not worth it!", "Author": "L. Stone", "ReviewID": "R3MAOKYVTOZTED", "Overall": "1.0", "Content": "I received this camera as a gift from my husband who had been listening to me say I wanted a smaller digital camera to capture the everyday moments of our three kids.  I previously had a Canon Powershot G3 which I loved, although it was bulky and hard to carry around when I had my three small kids with me.  That being said, this camera is a waste of money.  While it is small and fits nicely in my purse, I have yet to get one nice photo out of it.  I consistenly get blurry pictures and all the lower light shots have subject who have these bright white eyes that can not be photo shopped out.  I sent it back to Nikon who \"repaired\" it for free, however the repair did nothing.  I have had my pictures from several imporatant occasions ruined by this camera and am planning to trade it in for anthother Canon soon.", "Date": "July 10, 2008"}, {"Title": "Little point", "Author": "RICARDO A. GUEVARA \"Tech Customer\"", "ReviewID": "R1LJPSBOEZGFA7", "Overall": "4.0", "Content": "I've bought like 3 or 4 Nikon Coolpix S7c, and i've seen the camara has a good funtion but after use for sometime appear on the screen a little point like a lens scratch, this point no is a lcd dead pixel, is a problem on the lens, no is a significative problem, but exist.", "Date": "July 28, 2007"}, {"Title": "Terrible", "Author": "Roza", "ReviewID": "R2DMELCM4FWI5N", "Overall": "1.0", "Content": "I was so disappointed in this camera that i returned it. i thought it was terrible - the picture quality is horrendous. it looked better on the actual camera than it did on my computer. the pictures are grainy; they're neither sharp nor clear. I was just vey disappointed with this camera. I wanted to update from my canon digital elph b/c i've had mechanical problems with it. the elph, though older, took much sharper, crisper pictures than this. it was just incredibly disappointing, especially when nikon is known for their cameras.", "Date": "December 30, 2006"}, {"Title": "Nikon S7C Camera", "Author": "Tootles \"NT\"", "ReviewID": "R68EX4V6PET9W", "Overall": "4.0", "Content": "This camera has a large screen very easy to view. We are satisfied with all the features of this camera so far. The wireless transfer function using our existing wireless network is so convenient and efficient. Just need to clean the screen often because all your finger prints are over the glass screen when you hold the camera.", "Date": "March 13, 2007"}, {"Title": "\"Lens Error\"", "Author": "Sam \"SV\"", "ReviewID": "R3CQY8XDUGWEAX", "Overall": "1.0", "Content": "One week out of the box, for no reason at all, the camera started giving the \"Les Error\". The camera doesn't work and the zoom won't retract.", "Date": "December 31, 2006"}, {"Title": "great little camera", "Author": "Mary K. Peterson", "ReviewID": "R1FAI86OA5FSYP", "Overall": "4.0", "Content": "This camera is great because of its size and its features are just what you are looking for in a digital camera. It fixes blurring and the zoom cability takes phenomental pictures. it was a good investment for future memories!", "Date": "March 31, 2007"}, {"Title": "WiFi's a Gamechanger", "Author": "Swing4Fences \"Swing4Fences\"", "ReviewID": "R4P0GOSD3L7P6", "Overall": "5.0", "Content": "Recently went to Hawaii on vacation. Bought the Coolpix S7c because it had integrated wifi. Standalone digital cameras are already at a disadvantage to camerphones becuase they share their pics immediately using a cellular connection. Who wants to have to sync to a pc in order to send pictures to friends? Nikon takes a leadership position that all digital cameras can take a lesson from. It has teamed with T-Mobile to give consumers a 1-year free service in getting your pictures off your camera and into the inbasket of your friends via wifi which was very easy I must add.asily upload pictures and save up to 30 email addresses. The phone has all different pictures settings but once you get a feel for the camera, you will appreciate the well-roundedness of it's total performance. Wifi sells this camera.", "Date": "October 15, 2006"}, {"Title": "Pobre rendimiento", "Author": "Amazon Customer", "ReviewID": "RCBN4T059L98E", "Overall": "3.0", "Content": "Excelente camara con muchas funciones, pero el rendimiento de la bateria es pesimo pienso que nikon debe buscarle una solucion a este problema por que la bateria no dura mas de una hora, despues de lo otro la camara es maravillosa", "Date": "November 23, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "7.1-megapixel CCD captures enough detail for photo-quality 15 x 20-inch prints\n3x optical zoom with Vibration Reduction; 3.0-inch LCD with wide 170-degree viewing angle\nBuilt-in Wi-Fi antenna allows for wireless printing and, with Custom Connect service, instant emailing\nOne-touch portrait button for easy access to Face Priority AF, In-Camera Red-Eye Fix, and D-Lighting functions\nStores images on SD memory cards (14MB internal memory included); powered by lithium-ion battery (battery and Cool-Station charging dock included)", "Name": "Nikon Coolpix S7c 7MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41ESR4JBKVL._SX300_.jpg", "ProductID": "B000I1TKKW"}}