{"Reviews": [{"Title": "This camera is pretty darn good", "Author": null, "ReviewID": "R2PHVYUF07RXY0", "Overall": "4.0", "Content": "I bought one of these camera's for my office about 2 years ago after reading reviews of various digital cameras in a computer magazine. It turned out to be a great buy. It is a very easy to use and takes pretty  good photos. I liked it so much, that I ended up buying one for  myself.There are a couple of problems with this camera:If you use  the LCD panel(for previewing pictures you have taken), your batteries (4  AAs) will be drained - FAST.The 4 mg memory card that comes with this  camera is really not enough. I would recommend that anyone buying this  camera buy the 32mg chip. With 32mg, (and the 4mg card) you can take more  about 130-140 photos at the highest resolution (the recommended resolution  if you want to print your photos). This makes the camera great to take on  vacations - you don't have to worry about running out of memory.It takes  a long time to transfer photos to a computer. I recommend getting the  Parallel Picture Card Reader (from Kodak) which will make the photo  transfer lots faster.Buying these various accessories does add to the  cost of the camera, but it is well worth it.The print quality of these  pictures is pretty good (although NOT regular photo quality).  You can  upload your photos to Kodak and they will print them and send them to you  through the mail.  Also, they will set up a URL where your friends and  family can see and order your uploaded photos.As much as I love this  camera, I think that I will eventually buy a higher end version (maybe the  Kodak 260) so that I can have better print quality for my photos.", "Date": "October 13, 1999"}, {"Title": "Don't worry about the battery life", "Author": null, "ReviewID": "R282243X8TVTE5", "Overall": "5.0", "Content": "This is a fantastic camera - I've had mine for over 12 months and have taken over 3000 pictures with it.  Never a problem and seldom a bad shot.Don't listen to people grumbling about battery life.  Spend a  couple of dollars more and buy two sets of AA size Ni-Cad rechargable  batteries (8 in all) plus a charger, and you'll never think about the cost  of batteries again.  The carry case even comes with elastic holders to  carry the batteries in.Great camera.  I recommend it.", "Date": "December 3, 1999"}, {"Title": "takes great pics, but has sorry battery life", "Author": null, "ReviewID": "R1MPISM4FHLDGS", "Overall": "4.0", "Content": "The camera's software is incredible, this is a definite upgrade over the sony mavica. Pictures are crisp and clear, especially when using the high res flashpix mode. Only gripe about the caamera is battery life. Expect  about 8 hours from a set of four. I found turning off the auto preview  helps. They also sell some great Ni-Mh rechargeables that last about twice  as long. Overall a great camera...", "Date": "October 3, 1999"}, {"Title": "Great Camera!", "Author": null, "ReviewID": "R2PGREBMJ1GC5N", "Overall": "4.0", "Content": "My Dad got me this camera so that our family could easily send photos home of our son (and us a I guess ;)  We've since replaced our film-based camera  primarily with this one.  We have and Epson Stylus 800 printer (highly  recommended), and we can print photos of comparable quality to normal  film-developed photos.The camera has a really nice user interface for  setting the camera configurations, viewing stored photos, transfering  photos to a PC, and deleting photos from the camera.  It is compact and  easy to use.  It also has a few nice features like a timer, and closeup  modes.The only drawbacks are, it doesn't take shots that require a  telephoto lens very well.  For example, I've tried to take a simple picture  of Mt. Ranier, a huge/stunning mountain visible from most anywhere near  where we live, and none of them turned out too well.  It also takes a while  to download onto the computer (for highest resolution photos it's about  18/10-15 minutes)  If you have a laptop I suggest you get the Flash card  PCMCIA adapter.  It allows you to get the pictures off the Flash card  lightnight fast.If you're looking for a good digital camera that could  replace your film camera this is a great candidate despite the flaws.", "Date": "July 12, 1999"}, {"Title": "DC210 Plus - a great inexpensive digital camera!", "Author": null, "ReviewID": "R302V1UHQLSH7P", "Overall": "4.0", "Content": "I purchased this camera for two reasons a) to save money on film and development cost and b) to support several imaging related projects I'm working on - namely a picture CD, printing and framing photos, digital  collages, etc.  For the money spent (~$450 after add-ons) it was well worth  it.  The image quality is great, and the pixel density is good enough for a  decent 5x7.  On the down side, PC transfer is pretty slow - about 45  seconds per image on the highest quality and size.  Also, the picture is  ideal when the subject is relatively close - like between 4 and 20 feet.  Beyond that the results are not optimal.  Overall I'd say if you want a  digital point and shoot camera to replace your film camera, this is the  one.  If you are an amateur photographer, go for a DC260 or DC295.", "Date": "September 22, 1999"}, {"Title": "I have a Kodak DC200 - and I love it!", "Author": null, "ReviewID": "RTMBICUSZXRNT", "Overall": "5.0", "Content": "I actually got the DC200 camera as a Christmas gift this past year.  I have taken over 500 pictures and have put photos on the web, sent them to family, and even recorded photos on video via a VCR.  You can also view  photos on your TV!  The DC210 Plus has additional 2x zoom capability and I  believe better memory usage and battery life.  My only complaint is that  they eat batteries. I bought the adapter for $80.00 and use that for  downloading and viewing on video.", "Date": "September 8, 1999"}, {"Title": "Excelent for perfect pictures", "Author": "Jennifer Stenton \"stenton999\"", "ReviewID": "RDIL0P6OJ4L25", "Overall": "5.0", "Content": "If you are looking for speed this is not your camera. I love it! I am more into quality of pictures rather than the speed I can take them. This camera lets you view every picture right after you take it and immediatly decide if you want ot keep it. I take all my pictures on the best quality and I think they are great! If you use the duracell ultra battery you shouldn't have a problem.", "Date": "December 10, 2002"}, {"Title": "Recommended", "Author": "R McEwan", "ReviewID": "R2H5TDLO05TLAH", "Overall": "4.0", "Content": "This is a 1.3 Mpix camera and is an excellent camera for this category.  It takes great pictures up to 4 X 6.  I have even printed out 8 X 10 that are very good.  Upon close scrutiny you would notice pixels at that resolution but that would be true for any camera of this calibre.  If you have a laptop and an adapter card for the memory card then downloading pictures is a breeze.  No Kodak software is even needed.  I do find the Kodak software useful for simple cropping and printing of pictures as well as slide show presentation.  It is slow to upload using serial port on a desktop and well worth buying an adapter that accepts compactflash cards.  I have taken thousands of pictures with the camera and feel it is well worth it for the category of camera it is.", "Date": "January 13, 2002"}, {"Title": "dc-210 worth a look", "Author": "rdavis@nyx.net", "ReviewID": "RGDYLUIZ35IKI", "Overall": "4.0", "Content": "As digital cameras with better resolution appear, the Kodak DC-210 seems perhaps outdated.  But it is not.  For pictures to insert into web pages, it is perfect.  The DC-210 has a large LCD for viewing photos, and a two to one optical zoom lens.  Using CF memory, getting pictures from the camera to your computer is very easy.  It even works on my Amiga 3000.  If there is any problem with the camera, it is the short battery life.  You will go through a lot of AA alkalines if you use the LCD much, but that is not a serious problem.  Just don't pay a whole lot for the DC-210, as new cameras in the 1.1 megapixel class are now under $100.", "Date": "September 14, 2003"}, {"Title": "For High School Yearbooks, the DC 210 is a winner!", "Author": null, "ReviewID": "ROJ4MJLNS66YH", "Overall": "5.0", "Content": "In trying to keep up with technology in high school, as yearbook adviser I went looking for ways to make doing layouts easier and more fun. The Kodak DC 210 is the perfect camera for my kids. It is easy to use, easy to  transfer pictures to the computer, and a breeze for them to do special  effects.The pictures actually print in the book extremely well. We had  an 8x10 photo on one page and no one could tell it was digital. The photo  won first place in state contest!This camera is well worth the money!", "Date": "August 27, 1999"}, {"Title": "Garbage", "Author": "Mike", "ReviewID": "R38AZXDZ6PMYA4", "Overall": "2.0", "Content": "I bought this camera when it first came out in 1998 for $700 + TAX!!!!This is what i got: Unnatural blurry pictures, 4 AA batteries run out after 10 shots, no options, slow shutter speed, zoom sucks, have to wait forever between pictures, uses old compact flash, slow transfer rate (serial port, 1 min per pic!), software sucks (wont install on newer versions of windows), no lens cap, nowhere to hold on while taking pictures.Please, go and get yourself a real camera. You can get one 10 times better for the same price. Try Cannon, Nikon, HP ......  Kodak is not the anwser!!!!!!", "Date": "May 27, 2004"}, {"Title": "Slow, Fragile, Slow", "Author": "Daiku \"CB\"", "ReviewID": "R22CT60E07KRKZ", "Overall": "1.0", "Content": "I guess I expected more from Kodak.  This camera takes a long time to turn on, a long time between pictures, and a long time to transfer pictures.  Picture quality was adequate.  Wouldn't work in the cold, and stopped working all toghether shortly after the warranty ran out.  Not recommended.", "Date": "June 20, 2002"}, {"Title": "Not up to the mark . . . .", "Author": null, "ReviewID": "R2XT2TG7K99UNR", "Overall": "1.0", "Content": "The camera is good but it has the following problems :1. The camera does not shut off, we need to remove the batteries from the camera.2. It gives continous problems right from the second month onwards. The  battery shutter does not close properly. Sometime the zoom does not go  in.Just imagine the frustation that I went through - I brought the  camera from the US and the Kodak authorised showroom in ASia did not take  it under warranty as the warrenty is based on grographical locations  only.I have now sent the camera back to the US for repairs and I don't  know how much will it cost or when will I get it back.", "Date": "December 26, 1999"}, {"Title": "High Priced, Low Performance Dud of a Camera", "Author": "C. McCloud", "ReviewID": "R2ZKAWET88XDED", "Overall": "1.0", "Content": "Initially the camera worked fine.  Pictures were of good quality and all features worked fine.  After only a few months the camera's performance has dropped considerably.  Brand new batteries only last for about 12 pictures, the camera doesn't even power up at times even with new batteries. If you check the other reviews you'll find equally frustrating problems others have had with the DC210.  Consumer Reports' Nov 2002 issue contains Kodax's repair history which speaks for itself. The same issue also provides excellent alternative cameras with superior features at much lower cost.  My advice:  Don't waste your hard earned cash on the overpriced, poor performing DC210.", "Date": "November 1, 2002"}, {"Title": "Not recommended", "Author": null, "ReviewID": "R1Z2DIN8D5YRYD", "Overall": "1.0", "Content": "This is my second experience using a digital camera (the other was an Olympus). The software is a pain to install, and I tried installing it on at least thre different computers and got problems with all. The user manual is totally unstructured and Kodak use too much jargon and buzzwords to describe the simplest operation. Some problems encountered were: The memory card indicates a full 'magazine' of 19 shots, but when reviewing my shots on the camera viewfinder I get only 15. So I lose 4 shots somewhere. Try connecting to the computer, you get a myriad of problems, and to make matters worse, every time you need to stop the download, the software has to go through the same connection link-up procedure. The use manual is terribly written, you get two choices of software without anyone explaining in simple terms what each does.In summary, I would look elsewhere, e.g. Olympus.", "Date": "June 23, 2001"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00000JDEM"}}