{"Reviews": [{"Title": "Fantastic digicam, you can't go wrong with this one.", "Author": "Dave", "ReviewID": "R1PP7PHQAD8C77", "Overall": "5.0", "Content": "I purchased the Nikon CoolPix 3700 after much research and chose it over the Canon S400.  I've been extremely satisfied with the quality of the pictures and videos.  This camera was rated #1 Best Buy by PC World and for good reason.Pros:-rediculously light and very sturdy-has a long, narrow shape that is more natural in your hand and your pocket as compared with the more square Canon S400 and other Nikon Coolpix cameras-almost NO SHUTTER LAG, a big plus when photographing people who don't like to hold still for too long.-EXCELLENT PICTURE QUALITY, 3MP is PLENTY for most uses.-takes such great videos (with sound) that it might just replace your video camera.-easy to set up and fairly straightforward menus-uses SD memory which is generally better than CF.-pretty good battery life, recharges fast, most users probably won't need an extra battery.-if you need it, Nikon's tech support line is very helpful (toll-free and 24/7!)Cons:-Performance in low-light isn't great, but that is the case with most other cameras of this type.-No case included and only comes with 16MB SD card.  A leather case and 256MB SD card will set you back about a hundred bucks.  (256MB is the ideal size, I recommend Panasonic SD cards because they record at 10MB/s)-on/off switch and zoom buttons are awkwardly placed/shaped, should be switched, takes some getting used to.-included USB cord is a bit fragile, I had to get a replacement from tech support-3x optical zoom isn't much.  If you want a lot of zoom go 10x.Overall a great camera with the best performance in this price range.  Highly recommended, it's really a hidden gem.  Perfect as a first digicam or for someone who wants to upgrade.", "Date": "April 6, 2004"}, {"Title": "Picture quality second to none", "Author": null, "ReviewID": "R1R9TTCW8PLOC2", "Overall": "4.0", "Content": "Had previously bought a Canon SD10 to replace a Coolpix 4300 since I needed a faster and smaller camera.  Was confident of good picture quality after reading reviews on Amazon and CNET.Much to my horror, no matter what settings I changed, the picture quality was blurry when compared with my old Nikon.  So I returned the Canon and, with much trepidation, bought the 3700 even though it offered a megapixel LESS than the Canon, and for more money too.In this case, it is obvious that you get what you pay for.  Sharpness of photographs are amazing despite being a megapixel less.  Definitely superior to the Canon and comparable to my old Nikon 4300.  Upon reading the manual, discovered that Nikon has specifically built a algorithm to ensure sharpness in its digital processor.  Makes a world of difference.  Responsiveness is great too with imperceptible shutter lag.  Would recommend to all looking for a compact camera.  Just make sure that 3 megapixels are enough for your purposes.  I eventually returned this camera to wait for Nikon to release a compact, fast, 4 megapixel camera.  The extra megapixel is important if you crop your photos or otherwise want to be able to print larger than 4x6 genuine photo-quality prints.", "Date": "January 15, 2004"}, {"Title": "Works real good", "Author": "Joe Smith \"consumer\"", "ReviewID": "R1JJL6DU75CS1L", "Overall": "5.0", "Content": "I am no camera buff. I know nothing about the workings of a camera or how to manually render wonderful picures. Thankfully, the Coolpix 3700 is totally automatic, no need for me to adjust or fool around with obscure settings to get a decent pic. Still, the camera does offer a number of different \"environments\" you can choose from, such as indoor party, portrait, night landscape, panorama, closeup, etc. But the beauty of it is you only need to choose the appropriate setting to match the environment, no need to configure the f-stop or shutter speed or all that other crazy stuff. I agree with the other reviewers, I think this camera is awesome, especially for the price after rebate.What I like best are this camera is 1. The rechargable battery lasts a really long time, 2. The macro shots are amazing, the close up detail is really exceptional, 3. The size is a mere 4.6 ounces, there are smaller cameras out there like the optio 4si, but the 3700 is still smaller than the canon elphs, 4. the build has a solid feel with a brushed aluminum finish, no cheap plastic, and 5. the overall picture quality is first rate, in my opinion, it's just really crisp and bright.That said, I would've liked a 4 megapixel camera, but I realize that this 3.2 mp is more than sufficient for my needs. I'm not going into the photo development business anytime soon, so oversized prints are not necessary for me. The manual also states that this camera is best suited for up to 7x5 prints, it can certainly go higher, but this size is optimal for quality.I think it's strange that this camera is not very popular, I have yet to see a camera match the 3700's picture quality in the point and shoot category. The closest rival is of course the Canon Elph, but that's too rich for my blood. Plus, I think a case can be made that the 3700 is arguably a better point and shoot camera than the elphs, not to mention the smaller size. So, if you're on a budget, I highly recommend this camera to really get your money's worth.One other note on memory cards: this camera comes with a 16 mb SD card. I recommend a high speed card, perhaps a 256 mb. Check out newegg for the kingmax sd card, it's 60x speed (up to 10mb/sec transfer) and it's incredibly cheap. Also, if you're into name brands, outpost has the 256 panasonic SD (also 10mb/sec transfer) for a mere 45, (...), but it won't last long. Happy shopping!", "Date": "September 1, 2004"}, {"Title": "extremally versatile, very reliable, ultracompact", "Author": "colonel Misiak", "ReviewID": "RI7MLQDZ25M5Q", "Overall": "5.0", "Content": "I needed an ultracompact digital camera capable of taking decent pics (including photos of text), recording voice (like meetings, classes etc.) and making a short movies. My previous digital camera was a no-nonsense Ricoh DC-2 (bought back in 1996), so I had to learn about today's technology befor meking my purchase decision. My choices were, in chronological order: Casio EX-Z4U (but since American version doesn't feature video I hed to resign of it), Minolta Dimage G400 (but reported problems with focusing in darkness made me still open for another options), and was all the time attracted to Canon, but neither could record long audio. All of the sudden Coolpix 3700 emerged, the very latest from Nokon (I searched just after New Year).It's really as advertized:- ultracompact, so rather thab considering to take it or not you keep it all the day long in your pocket, ready to take a pic- with many preset photo modes and some manual setting- offering 5 video modes, up to 640x480 (TV resolution) in color and 30 frames per second- delivering high fidelity of color and sharpness- very fast in response - can make a pic in a second after turning on- with excellent, crisp LCD- audio/video out so you can watch your movies or photos directly on TV (NTSC and PAL)- and of course with fast USB to dump your files onto hard drive of your PCThe attached software bundle is good and easy to use.Finally, it uses SecureDigital memory cards (up to 512 MB) which are very fast.Thats all I needed and much more. In one sentence: EXCELLENT PRODUCT WORTH WELL MONEY IT COSTS. Strongly recommended!", "Date": "February 5, 2004"}, {"Title": "excellent camera", "Author": "Amazon Shopper \"alex222222\"", "ReviewID": "RXDR3A5JBBGUG", "Overall": "5.0", "Content": "I love this camera.  I researched cameras quite a bit before purchasing, and with the $100 rebate, this camera is an awesome deal that simply can't be beat.  This is my second digital camera, after having traded up from a 2.1 megapixel model.  I find that the quality of a 3 megapixel camera like this is ideal--big enough for high quality photos, yet not insanely detailed to the point that the photos eat up incredible amounts of hard drive memory.  The camera also takes pictures quickly without much lag time in between photos.  Also, one of my favorite aspects of this camera is that with a 512k memory card, the camera doubles as a little camcorder for capturing high quality, quick videos (with sound) of precious moments.  The only thing I don't like about the camera is that the rechargeable battery has to be removed in order to be recharged.  There's no way to recharge it simply by plugging in the camera.", "Date": "June 4, 2004"}, {"Title": "Compact size, metal body", "Author": "Lakan Kildap", "ReviewID": "R3K3LMMLTB7C1H", "Overall": "3.0", "Content": "Pros:-compact size, stylish-metal body, nice build quality-selectable AF sensor and metering in M-record mode, each AF bracket acts as spot meter, useful for tricky lighting-framing guides on LCD-generally competent metering, Auto white balance, focusing.  again, for difficult lighting, the AF sensor acts as spot meter in M-record mode-straightforward transfer with Nikon View, although a separate card reader is recommended instead of connecting camera directly to computer, this is to save those USB contacts in the camera from wearing out prematurely.Cons:-movie mode exhibits that notorious audio-sync problem-hot or dead pixels on my unit, resulting to those annoying white spots on the image when viewed at full size-Scene Modes disable features here and there, and that set up may not be what you really want-no option to set ISO, camera adjusts ISO on its own, which may result in noisy images-more on noise, you really need lots of illumination, either daylight or flash, to keep the camera from bumping the ISO up, and with it, the noise-still having difficulty dealing with the green cast of fluorescent lighting (as do most cameras)-button operated zooming, with those tiny Wide-Tele buttons, especially when in Macro mode, is not the easiest thing to doOverall, a decent picture taker that requires well-lit scenes to perform well.  That means it is a \"flashy\" camera.  For someone used to the Olympus Stylus, this is not an issue, however, this camera is not for those who prefer shooting without flash, especially indoors.  There's the auto-ISO issue mentioned above, which leads to noise, also, the lightweight and small size of the camera, not to mention all those buttons which get in the way of the left hand, prevents any decent steady handhold.  This maybe the reason for those soft lens comments from other reviewers, among other variables (e.g. how is the Sharpness set?).Many of the cons are limitations imposed by the small size of the camera.  Regardless of make, for compact cameras, these limitations are something one must live by.  If you want more control (to prevent the ISO from bumping up by itself), and you want to stay Nikon, the larger Coolpixes (4500, 5xxx) maybe the better choices.  The Canon A70/75/80 also offer greater controls, but at the expense of compactness.  However, I cannot believe that Nikon or any other manufacturer for that matter, cannot make a compact that allows manual ISO setting.The decent build and finish of this camera are regrettably offset by noise issues, and in my sample, dead pixels, which prevents me from giving this camera a higher rating.", "Date": "July 20, 2004"}, {"Title": "nice body, so-so lens", "Author": "S. Lin \"bad guy\"", "ReviewID": "R2DVA4O287K5KW", "Overall": "3.0", "Content": "The CP-3700 is my 5th camera I owned in 5 years due to my traveling need. The last one I use was Nikon CP-3100 and which have been lost by my friend, I then bought this Nikon CP-3700.This camera is very handsome and small. Its whole metal body is stylish and well built. It can easily fit into any pocket, so you can carry it all the time and never lose a scenery. This camera is fast and its vedio mode is super that takes 640*480 vedio with sound, and the length is only limited by the memory card you installed.  And this camera has assistance beam to help focus at low light condition. However, when talking about image quality, I am not impressed.The color of the pictures are always very good, and seems they were always well exposured, however, most of the images are not very sharp, even compared to the cheaper and older CP-3100. besides, serious distortion occurs at the wide angle, which makes those pictures looks very bad especially when there were big buildings near the edge.So, if you want a small nice-looking camera and you are going to take family pictures or party pictures or for flowers or yor dog, this one is good. However, if you are going to take picture with part of building in it, say you are going to shot in New York or Paris, then avoid this one, or you will find curved skyscrapers and cathedrals in your picture.I already gave this camera to my girl friend. I may buy the Sony DSC-W1 for my next digital camera, it is slitly bigger but it comes with Carl-Zeiss lens, some manual controls and can attach with some converters.", "Date": "June 20, 2004"}, {"Title": "A good starter digicam", "Author": "epharm \"e-pharm\"", "ReviewID": "RPMCWGRO3UTN4", "Overall": "4.0", "Content": "I beleive this is a good camera for the light/novice photographer. Check steve's digicam and cnet for a review. just remember the camera's limitations; fully automatic ( no Man. Settings), flash range is 7-8 feet, in dark or zoom, try to have a steady hand as shutter speed decreases. it is an overall v.good camera for just ponit and shoot with good focusing system.P.S.Try to copy and paste the camera's name in google and check for prices on pricegrabber.com, cnetshopper.com and epinion.com. You'll be amazed, that it actually exsists in other trusted websites for $75-$125 less than in amazon.com. and this is the case with most of the electronics on amazon.com.It seems that amazon.com is fooling only its loyal cusomers (I have been a loyal amazon customer for 4 years now)by its nonsense promotions. The huge price difference clearly shows that amazon.com is now not looking to keep its customers who are always few clicks away from other sellers. Amazon.com is obviousely looking just to use it's customers' trust to get an exaggerated profit margine on the merchandise compared to the common market profit, as you'll see from other stores' prices.Don't let amazon.com silly promos fool you. Shop smart and don't allow them to use you.I believe, with this attitude, amazon.com will loose a huge number of its current customers, along with a big market share in the near future. The consumer has become now more and more aware about the e-market tools and rules.", "Date": "July 26, 2004"}, {"Title": "Excellent Value (With some major caveats)", "Author": "Relentless \"skepticalbeliever\"", "ReviewID": "R1QQMS77DLYXKG", "Overall": "3.0", "Content": "I've owned and used all sorts of digital cameras. My three last digital cameras were Sony and they all had some things in common: 1)the picture quality was not up to par, 2)the MemoryStick(tm) has very slow write/read speeds. When I decided to browse for a new camera, the usual brands came to mind...Olympus, Minolta, Kodak. However, the product offerings were not tantalizing to me. I then looked-up for Nikon and to my surprise they had the product I was looking for at a price I could afford.Let me tell you, the camera is very small and light. The picture quality is DEFINITELY superior to that of Sony's and Kodak's I've used. The full-quality, full-TV-screen video option is very good and comparable to full-fledged DV cameras. The options are vast. The user interface is very intuitive and easy to get around of. The versatility of using SecureDigital media is definitely a plus, since it can be used in PDAs, cell phones, et cetera. The voice-recording option can be very handy. The flash recharge time is minimal (it used to take my Sony good 10 seconds to do the same). The auto-shutter is pretty good. And the Auto-Focus is very precise. It's worth its price and then some. I highly recommend this device. A must for digital photography enthusiasts.***Ok, I wrote this review before trying night-time shots. To my dismay, in low-lights the camera it's incredibly useless. It won't let you shoot w/o flash-- period. I'm incredibly frustrated. It does not let you choose manually the shutter spped and the pre-set scene options are ludicrous. It's a shame, because it took such a good pictures with good light...but tonight was nothing short of catastrophic.", "Date": "April 1, 2004"}, {"Title": "Great camera, good movies and audio", "Author": "Jill W. Ferguson", "ReviewID": "R32SN7OWNJ8J6O", "Overall": "5.0", "Content": "This camera takes great photos and gives you lots of options, from simple point and shoot to preprogrammed settings (landscapes, fireworks, dusk, closeups) to total manipulation of features and images using camera features and software. We wanted a small, light camera, and this one is compact while easy to get your fingers on the \"mouse\" and dial. We were especially surprised by the quality of movies and audio (movies with sound and sound alone features) for an inexpensive camera that is not meant to be a true video/audio recorder. What a bonus!", "Date": "July 21, 2004"}, {"Title": "excellent small digicam", "Author": "tikcuf \"tikcuf\"", "ReviewID": "R1ZTA7G7LZ4ABV", "Overall": "5.0", "Content": "excellent photo quality, features and ergonomics.  much lighter, better ergonomics, better display than the canon S400 series (its main competitor).  this is a wonderful camera w/ great portability (about the size of a cell phone or pager) which i carry on my belt or pocket and really impressive photo quality.  i had to return the first one i ordered which appeared to be a lemon (probably a problem w/ auto white balancing), but its replacement takes just first rate pictures.", "Date": "May 1, 2004"}, {"Title": "Made for Goobers like me", "Author": "Carmyne Ratoolo", "ReviewID": "R3K48J5YNHU3VZ", "Overall": "5.0", "Content": "If I can screw something up I usually will.  This camera  compensates for my total lack of ability to take a decent pic. For some reason 98% of the pics I have taken have come out absolutely stunning. When I took it to a family reunion and started taking pics side by side(with my family members using their ultra mega-pixel, high speed dig cams with all the bells and whistles only found on the space shuttle and other advanced technological inventions)it became readily apparent that my pics were greatly superior to the ones they were producing. It was worth the price of the camera to watch them fiddle with  knobs,switches and dials on their cams to try and replicate (let alone exceed) the quality of the pics my 3700 was producing. Not wanting to acknowledge that I had a superior product they blamed everything from atmospheric pressure to the depleted ozone layer for their inferior pics. To make a long story short within a week they had sold their overpriced, over rated dig cams and purchased 3700's  Nuff said.", "Date": "May 10, 2005"}, {"Title": "Best Point and Shoot Camera without question", "Author": "SpinChin \"Spin\"", "ReviewID": "R36NDBKPZ9WNIQ", "Overall": "5.0", "Content": "This camera will create images with color accuracy to not only rival but beat other digicams costing 5 times as much - *BUT* it must be used in certain modes to accomplish this.  Just go to [...] and compare pictures from almost any camera.To create TERRIFIC *indoor* pictures use the \"BACK LIGHT\" pre-programmed mode - for every indoor occasion.  Hold the button down halfway until the camera is ready and then press all the way. To eliminate camera shake, which ruins many pictures, use a tripod (a great folding SLIK w/case costs less than $25).I haven't taken any pictures outdoors yet but I have seen pictures from this camera that astonish me.  So I am sure that I will be able to identify a mode that will do the same for me when the occasion arises. *IF ONLY* Nikon made this EXACT camera with some manual modes, a hotshoe, and accessory lenses, AND anti-shake. Enjoy!", "Date": "January 15, 2005"}, {"Title": "Great light weight camera", "Author": "Chetan Bhargava", "ReviewID": "R2VZWFQEAIQMTV", "Overall": "5.0", "Content": "I bought this camera about 10 months back and am loving it since then. I bought this for my wife as I own a Sony DSC-V1 (another great one) and she wanted a light & small camera. I'm very pleased by the performance.I have taken about 2500 great pictures in all modes even in dark using manual mode. The movie mode is swift but only does Apple Quicktime. Other formats would be a plus.Great Camera!", "Date": "November 16, 2005"}, {"Title": "3700 picture quality", "Author": "Eliot Bliss", "ReviewID": "R321KMPDX3PO43", "Overall": "4.0", "Content": "I have owned a 3700 for several months. It takes sharp pictures,is a delight to carry. Everything about it isfirst class..except......it takes pictures that are always very \"cool\".  (Noticeably bluish). If you like faces with blueish skin,or scenics on the blue side even with lots of sunlight, OK. If you don't...Adobe and a touch of less blue and a touch of more red will produce pictures with color as good as any from Sony or Canon. (we have or have had both)It is the 2nd Nikon camera I have owned and EACH of them (took)takes VERY cool pictures, ie pictures with a blue cast,A non critical user wont worry about it. (But \"they\" dont worry about pictures from $5.00 throw-away cameras) Still,it is a good buy, and reliable. Good battery life.However, the very few pix that you really love (its always very few, right?) to save and print..if you are at all critical, probably should be color corrected.Note that the 3700's resolution (sharpness)is a trifle less than that of a Sony P150 or Sony V1 or Canon S50 (all owned by one relative or another) But the sharness differences are so minute that one is not aware of any differences if viewing prints from NORMAL viewing distance.The \"noisy\" night pictures also are just fine when you dont use a microscope but wiew ona wall or in a photo album.The bottom line to me is that camera sharpness should not be the number one all quality consideration.Remember that that pleasing or poor color is obvious from any viewing distance whether a still picture or movie and thatsome movies and peoplestill portraits are shot with diffusion to soften the \"look\", deliberately, thus dismissing sharpness in favor of creativity.So the question of proper color always remains. Check that first, then sharpness second.", "Date": "September 15, 2005"}, {"Title": "Great Cameral!", "Author": null, "ReviewID": "R1ALIQMLWE7Y50", "Overall": "5.0", "Content": "This camera is excellent. I cannot believe the quality of the images. I bought it because I especially wanted to use it for close up shots - and they turned out much better than I expected. The camera is a great size, easy to learn and control, has almost no noticable shutter lag, and takes great shots. The battery life is not the best, but I like that the battery is removable and extra batteries are cheap. All-in-all I'm very glad that I bought this.", "Date": "January 22, 2004"}, {"Title": "Better than higher megapixel cameras", "Author": "jacquielyne", "ReviewID": "R38MWJJUI5Q7DR", "Overall": "5.0", "Content": "I've owned this camera for the past four years, and I must say that even though I own another camera with a higher megapixel, this one takes better pictures! I owned a 5 megapixel camera and a 10 megapixel camera with different brands and I must say that this little camera beats them both.One drawback: Taking pictures at night or indoors with a lot of lights can be a hassle since you will have to fiddle with the controls and settings before getting things right. Also when you are recording movies, there is this ticking sound that goes with it.This is a great camera for beginners who just want to point and shoot.", "Date": "September 28, 2008"}, {"Title": "neat little camera", "Author": "BULLWHIP \"bullwhip\"", "ReviewID": "R3G10Q46L3K91A", "Overall": "5.0", "Content": "i as always did a internet search on what camers to buy and read the reviews on this one and made a wise choice, this is one great camera", "Date": "January 23, 2014"}, {"Title": "Excellent", "Author": "Maria Gali", "ReviewID": "R2JNFNKA2QC140", "Overall": "5.0", "Content": "Thank you very much. It was more than expected. I used it already. My family and friends could not believe it. I had to show them my bank account to prove how much I paid for it. Thanks again.", "Date": "July 28, 2012"}, {"Title": "Great Camera!", "Author": "wopper", "ReviewID": "R2IC83UALO25UV", "Overall": "5.0", "Content": "Love, love, love my Nikon 3700. I was just surfing the web and almost purchased a Canon, but, reading all of the reviews for this camera and different Canons~ I felt as though I was cheating on my Nikon!Sounds ridiculous I know, but, I have had this camera for quite a few years and it is second to none.  Some of my best memories came from this camera.I have many rave reviews on my pictures and the quality that came from this little gem.  Everyone comments on how great my pictures are~ so it must be doing something right.  The only thing that I really would like is a bigger screen, but, I would not sacrifice a bigger screen on the camera for not so great pictures after.No brainer~ get this camera and you wont be disappointed!", "Date": "March 9, 2011"}, {"Title": "A Camera that can't be beat,", "Author": "Jim Smiley \"JimnDot\"", "ReviewID": "R1CXE1AMYCW2S0", "Overall": "5.0", "Content": "I've had the Coolpix 3700 for 5 yrs now, and was thinking it might be time to upgrade. There really is nothing better out there. More mega-pixels sure! But the quality and clarity of the 3700 would not be improved with more mps. And good luck finding a digital camera that offers an eyepiece viewer. The screen only cameras are very difficult with the sun behind you. I'm sticking with this antique.", "Date": "May 25, 2010"}, {"Title": "Great digital camera for the price", "Author": "RockShoX \"punkrockfan\"", "ReviewID": "R3JVN9P655U0CL", "Overall": "4.0", "Content": "Let me just get the negative out of the way.  This camera is not great for low light photos.  I took a picture of my cousin's parents on stage during her weddding and the result was sort of dark and gloomy.This camera definitely depends on its flash.  Without flash, taking a photo can be too dark or blurry.  If you use a tripod, then with enough light source you can disable the flash.The LCD screen is small compared to other much newer cameras available today.That being said, this camera is worth the money.  The picture quality is freaking sharp.  Continous snapshots works great, panoramic photo is really fun and the other 13-14 pre-set functions are easy to use.The motor is quiet compared to the 4MP Canon Powershot.  The video recording is fun and more impressive than I had imagined it to be.  I probably would just get a digicam if I am serious about recording.The metallic body is really good looking and the feel of the camera when you are taking a picture is comfortable.  The camera is small enough to easily fit inside your pants pocket.Battery is like other batteries.... you probably want to carry more than one if you travel a long time without a chance to charge up.  The charger does a good job charging fairly quickly... I think less than 2 hours with totally discharged.It does not come with a case, but I went out to buy my own durable case for it (less than $10).  It uses the fairly small SD card, which you can buy for next to nothing these days.", "Date": "March 26, 2005"}, {"Title": "Excellent digi camera", "Author": null, "ReviewID": "R2G74MAY70Q7Y2", "Overall": "5.0", "Content": "I've tried my share of digi cams, from sony to canon to fuji and found that the Nikon 3700 is by far the best in its class.  Sweet Compact Size and really light in weight. Excellent quality of pics during the day and at night, found it to be superb in most cases. Scene modes can come in handy. Tons of great features. Movie quality is probably the best in a digital camera. At 640 X 480, it was excellent.  This camera is very satisfactory and worth the $350.", "Date": "January 26, 2004"}, {"Title": "Very good for the start", "Author": "larry \"larry\"", "ReviewID": "RGCCZ9CQ4IZEA", "Overall": "5.0", "Content": "Nikon is a very good brand forr all you people who knows that. there lens are pretty big compared as to the others. i got no problem whats so ever on this camera and it works like a charm. the 16 megabite secure digital memory card can hold up to 8 pictures in very good quality and resolution, low quality is double the amount.you can buy a more reliable secure digital memory card in here that is 512 megabite storage. brand name scandisk and is around 50 dollars, not that bad.Some technical features of this camera from the website is:Superior image qualityThe COOLPIX 3700, with its precision 3x optical Zoom-Nikkor lens and 3.2 megapixel resolution delivers superior optical performance and photo-quality (2,048 x 1,536-pixel) images packed with natural looking colour and sharp detail. The new COOLPIX camera utilises Nikon technologies and imaging expertise to ensure faithful colour reproduction, sharp contrast and clarity in virtually all shooting conditions. Excellence in image quality is ensured thanks to the high-precision 256-segment Matrix exposure metering and TTL- controlled Auto White Balance.Stylish, sleek-compact designLightweight and pocket-sized, the COOLPIX 3700 is designed to be easy to carry, durable and attractive. Encased in a slim compact body with a brushed aluminium finish, the camera measures approximately (W x H x D) 95.5 x 50.0 x 31.0mm (3.76 x 1.97 x 1.22 in) and weighs just 130g (4.6oz) without battery and SD memory card.Easy to operate, fun to useAs with all cameras in the COOLPIX series, the COOLPIX 3700 aims to make digital photography simpler for the novice and to offer potential for the advanced user to experiment and develop their skills and capabilities.  * Simple operation: The controls on the COOLPIX 3700 have been kept to a minimum and are logically arranged for easy, speedy handling. The camera also powers up instantly and features a fast shutter response.  * 15 Scene Modes: The COOLPIX 3700 is equipped with 15 Scene Modes, including Portrait, Party/Indoor, Sunset, Museum, Fireworks Show and Panorama Assist, which optimise the camera settings for a wide range of subjects, backgrounds and lighting conditions.  * Continuous Shooting: The fast-acting shutter is also capable of shooting at 2.5 (H) or 1.5 (L) frames per second, or the new Multi-shot mode for capturing 16 consecutive frames in a single image.  * Macro Function: In Macro Mode, the COOLPIX 3700 delivers sharply focused images of subjects from as close as 4cm (1.6in).  s  * TV Movie Mode: The COOLPIX 3700 offers eight Movie Modes, including a new TV Movie Mode with streaming technology that enables the production of TV-size (640 x 480-pixel) movies complete with sound.Ready to Use - All in One PackageThe COOLPIX 3700 standard package includes a high power rechargeable Li-ion battery, batter charger, 16MB SD memory card, Nikon View and Adobe Photoshop Elements software and a protective soft camera pouch.  *  3.2 effective megapixels  * 3x optical Zoom-Nikkor lens (equivalent to 35mm - 105mm in 35mm [135] format)  * Compact, slim and lightweight aluminium body offers outstanding portability at approximately (W x H x D) 95.5 x 50.0 x 31.0mm (3.76 x 1.97 x 1.22 in) and 130g (4.6oz) without battery and SD memory card  * Stylish and sophisticated design looks good everywhere it goes, and feels good every time it is handled  * Nikon's advanced image-processing algorithm assures faithful, vivid colors, sharp contrasts and image clarity  * Macro Function for sharply focused close-ups from a distance of 4cm (1.6 in)  * 15 Scene Modes to ensure beautiful compositions for every subject, every time  * Eight Movie Modes include Time-lapse Movie Mode and new TV Movie Mode for filming with true TV resolution (640 x 480 pixels) at 30fps, complete with sound. Streaming technology makes storage of lengthy clips possible on the SD memory card.  * New voice recording function records up to 5 hours of sound on a 256MB or larger SD memory card, and up to 20-second voice memos for each still image. Recorded sounds can be played back using the camera's built-in speaker.  * Multi-area focus with a choice of 5 focus areas  * High-precision 256-segment Matrix exposure metering  * Accurate automatic white balance with TTL control  * Continuous shooting at 2.5 fps (H) or 1.5 fps (L)  * Interval Timer Shooting takes a series of successive still images at preset intervals  * Fast power-up readies the camera for action as soon as it is turned on  * Easy-to-use controls include a high-definition 1.5-in 134,000-pixel TFT LCD monitor and a handy Mode Dial  * New \"Sound release\" that adds convenience and versatility to the self-timer mode by snapping the shutter in response to a remote sound command from the user.  * High-speed noise reduction automatically ensures higher picture quality at shutter speeds of 1/4 second or slower  * Date imprint adds the date to images in a range of formats  * Direct printing from the camera to PictBridge compatible printers and Epson USB Direct-Print printers  * Customizable Settings include a new World Time Setting, 3 different shutter sounds, and menu support in 10 languages  * Nikon View Software is a highly versatile application for easy image transfer to computer, editing, e-mailing and printing. Removes red-eye effect at the touch of a button.  * Compatible with new CP1 disposable lithium battery with life of approx. 250 shots (TBD)  * Included accessories: hand Strap, 16MB SD Memory Card, Rechargeable Li-ion battery EN-EL5, Battery Charger MH-61, USB Cable, AV Cable, Nikon View CD-ROM, Photoshop Elements, Eyecup and Camera Pouch.", "Date": "September 4, 2005"}, {"Title": "The Small and Valuable", "Author": "Aditya Sjartuni", "ReviewID": "RKGK6V9LOA6GM", "Overall": "4.0", "Content": "This camera for my Kid Birthday present and she like it very much. This Coolpix 3700 the small and practical camera I have ever have. Have video, voice recording, optical zoom, directly printed the image to the printer and very easy to use. You just turn on the camera and let the coolpix do for you. You still can use the manual shoot but it's not perfect. Its appropriate for my kid that she just need to framed the image and shoot. The 3.2 mega pixel is enough for A4 paper size.The price is approriate for your pocket", "Date": "April 30, 2005"}, {"Title": "Mediocre pictures, very poor movie mode", "Author": "M.S. Waksberg", "ReviewID": "R3OP85NMEZXRME", "Overall": "2.0", "Content": "The Nikon Coolpix 3700's pictures are no where near as quality as my old Canon or the Sony Cybershot P73.  The photos I took inside were washed out and a bit grainy.But the main reason I've chosen to return this camera is the movie mode.  The sync between audio and video is terrible, and there is a continuous clicking noise through each video.  I've heard that the clicking noise is from the lens focusing in continuous focus mode, but even when I stood very still, filming one thing, the clicking persisted.", "Date": "July 21, 2004"}, {"Title": "Good Product", "Author": null, "ReviewID": "R3R3F16LP5REDT", "Overall": "5.0", "Content": "Fully function, good price and the mail-in rebates process is faster. Highly recommend.", "Date": "July 13, 2004"}, {"Title": "Good but.........", "Author": "Juan \"Juan\"", "ReviewID": "R1EO7HIUEAD3YD", "Overall": "3.0", "Content": "Becareful it blocks and doesnt work, it appears \"lens error\". It was sent because of the warranty and it last only 15 pictures and continue with the same problem. Nikon says to send it again but they wont change it for a new one. I am not agree with this, the same problem twice is not worth it any more. Is not a good warranty. This maybe happen to you.", "Date": "August 8, 2004"}], "ProductInfo": {"Price": "$339.99", "Features": "3x optical zoom Nikkor lens (35mm equiv of 35mm - 105mm)\n1.5-inch color LCD screen; voice recording of up to 5 hours; One-Touch Red-Eye Fix feature\nStores images on Secure Digital (SD) memory card (16 MB SD card included)\nPowered by a EN-EL5 rechargeable lithium-ion battery (included with AC adapter that charges the battery in-camera)\n3.2-megapixel resolution for photo-quality 11 x 14 sized prints", "Name": "Nikon Coolpix 3700 3MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/4106683KMBL._SX300_.jpg", "ProductID": "B0000VL2VK"}}