{"Reviews": [{"Title": "The Refined Camedia", "Author": "kkrome25 \"kkrome25\"", "ReviewID": "R3MB4BD3QSFC7Z", "Overall": "5.0", "Content": "The Camedia body design has always been traditional, which I've favored over Sony's outlandish model F717 & F828 body/lens layout. The C8080 has a nicely refined body style. It's a compact 4.75\" wide, by 4.7\" deep, and 3.4\" high. For old-school film SLR users like myself, it resembles that look and feel. The ergonomics is just about perfect. It's a real joy to hold, even with one hand. The controls are easy to see and become acquainted with. The shutter lag is almost undetectable. And if you set it for continuous frames (1.6 fps), it will give you 3 to 5 shots in quick succession. The lens and picture quality is up to par with the previous Camedias. Olympus lenses are outstanding. The 8 megapixels sure help. The things I like about the C8080 are: 2 memory card slots (CF and XD)and you can toggle between the 2 cards. So if you have a 512 MB capacity for both cards, that's 1024 MB total. If you want more, get an IBM 1GB microdrive.  You don't have to download software. Plug into the USB 2 in your PC, and you're in business (Win XP os). The viewfinder is electronic, which saves on battery consumption. The display screen can tilt up or down, and is visible even in bright sunlight. It's very comfortable to hold and shoot. And of course, it's got 8 megapixels. The thing I don't like about the C8080 is you have to remove the battery to charge it. For pro-level amateurs and professionals, I recommend it highly.", "Date": "March 12, 2004"}, {"Title": "A Miriade of features at a reasonable price", "Author": "Robert J. Price", "ReviewID": "R32KAGUDUCN84X", "Overall": "5.0", "Content": "If your like me and dont have a bunch of lenses already there that could be added to the camera as in the Canon Rebel then the next best choice is to try to get a camera that has all you need in one camera. This camera also feels better than any other camera I tried. And I tried them all, HP, Canon, Minolta, Fuji, Sony, and Olympus less expensive older models.That is what I see is one of the main advantages of the Olympus C-8080. It is a very flexible highly featured camera. The lenses on it feature both wide and telephoto capabilities and Olympus has taken the time to make sure that the lense does well in these areas. They were special produced for this camera.I have been able to get some excellent image quality out of my Olympus C-8080 so far. By excellent I mean that there is alot of detail in mid tones. Some of the noise artifacts in high contrast areas in other cameras such as purple hazing seem to either not be there or greatly reduced. In other words I have not seen that as an issue. This is attributable to a new CCD for the camera that impliments cyan dots into the color capture system. I love the extra colors I am getting from the CCD on board that has increased my color ranges in blues and greens as well as neutral shadow areas. Olympus also implimented an anti noise feature in this camera that is said to help with those issues.This camera is complex. It will take alot of time to be able to use all its featured capabilities. The menu system is intuitive and very customizable.Am I glad I bought it? Yes definitely.Also look at the built in historgram. Better than any of the competion. That is because it has a historgram in a historgram. You can learn on line how to use historgrams and then that feature will mean more.Negatives:Red laser focus system can be blinding for shooting portraitslack of stablization system like Minolta usesLack of illuminated controls for night shooting", "Date": "March 21, 2004"}, {"Title": "Outstanding camera", "Author": "Bucherwurm \"bucherwurm\"", "ReviewID": "R2FLYEPR9C2H59", "Overall": "5.0", "Content": "Make sure your read the last paragraph of this review to see why an outstanding camera gets only three stars.Before buying this camera I read a variety of professional reviews on various websites. The consensus seemed to be that this was the best of the lot of the new 8 megapixel cameras. As a lifetime Canon owner who also  has a Canon D60 6.3mp SLR digital camera I was disappointed that the new Canon Pro1 didn't get as high ratings, but I believe that quality pics beats any brand loyalty that I might have.I was in the market for one of these new high resolution cameras because I wanted something to carry around for quick shots when I didn't want the trouble of lugging my Canon D60 and a  host of lenses.I took it on a recent trip in to the California coastal mountains. I was totally pleased with the results. The professional reviewers were all concerned with noise in higher ISO settings for this breed of cameras. All of my pictures were shot in the range of ISO 100 to 160 in bright light. I used Photoshop to greatly enlarge pictures taken at 100 and 160 and compared them for noise. ISO 160 pics were noisier, but still printed out clear 7.125 by 9.5 prints. Colors were very accurate, and I noticed no significant distortion.The large number of buttons and menus posed no real problems for me. You just work yourself gradually into this, and soon you are at ease. I particularly liked the button on the top that allows you to make a custom setting. I use it for ISO settings, making it a breeze to quickly change ISO when I want to. What criticisms can I make? Here's my brief list:1. Buttons on the top right of the camera are very crowded, and it takes a while to get used to them, and not be changing the wrong one. I find it somewhat difficult to hold down the custom button and rotate the selector wheel at the same time.2. I am not too enthralled with the electronic viewfinder. I found it sometimes difficult to see things clearly, and colors were harder to detect as accurately as in a normal viewfinder. I particularly had problems adjusting a circular polarizer filter to best effect.3. I am used to manually zooming an SLR camera, and the power zoom on the c-8080 is a bit frustrating. It is difficult to zoom to the exact point that you want. You keep over and under zooming it. But I suppose this is a problem found on most power zoom cameras. As most professional reviewers have noted, this camera is built like the photographic equivalent of a tank. It feels solid and indestructible, a heft that you usually find only on very expensive professional cameras. Oh yes. Why did I give this camera only a three star rating. When I received the camera the software disk was broken. The disk is important insofar as Olympus is too cheap to provide a complete manual with the camera, and a further 180 pages or so of it are on the disk. Three phone calls and an email, and over a month later I get a software disk in the mail. But it's not for the c-8080. Another phone call and I am told the that the c-8080 disks come only with the camera itself. They have no extras, and I will simply have to do with this one which is written for other cameras. It supposedly will suffice for the camera to computer interface, although the c-8080 is missing from the reference manual of listed cameras. When I first called and waited on hold for a long long time no one even new how to deal with this problem. I was given the run around from department to department to department. You better hope that nothing is damaged in shipment, and that you never ever need tech support from them.", "Date": "May 20, 2004"}, {"Title": "Outstanding 8-Megapixel Camera with top quality lens.", "Author": "Abester", "ReviewID": "R1722DQ9POYPCL", "Overall": "5.0", "Content": "After some extensive research on 8-megapixel digital cameras, I decided on the Olympus C-8080 for several reasons.  I'll highlight a few of them below.* The magnesium cased Olympus C-8080 has a quality feel to it in my hands.  It feels solid.  This camera won't creak or flex when handled like some of the others I tried.* The Olympus C-8080 power up time is extremely fast which is important for catching those special moments.  It has one of the fastest power up times of any 8-megapixel camera.* The C-8080 has one of the best lenses available in its class with just the right balance of range and speed... The lens is rather large for good light gathering ability.  It's also very sharp.  At 5x and 28mm - 140mm (35mm equivalent) range, some might lean more toward a camera with a broader optical range sacrificing speed and quality.  For me, it's about quality not quantity!  I find that I often use 28mm indoors where space is limited or for those wide outdoor scenic shots.  And 140mm is usually sufficient for most of my 'telephoto' needs.  You can also purchase optional adapters for wider angle or more zoom if you find it necessary.* Battery life on this camera is top notch... it's one of the longest lasting and far superior to most other 8-megapixel cameras.  Although I own 2 batteries for my Olympus C-8080, I have yet to need more than one for an entire day of shooting.  My findings pretty much mirror what the professional reviewers have tested with regard to long battery life on the Olympus C-8080.  I have yet to see my 'low battery' indicator come on!I should also mention that I wear eye glasses which is a problem for me with some viewfinders.  Not so with the Olympus C-8080.  The ring surrounding the viewfinder is rubberized and when I place the lens from my eye glasses up against the view finder, I can see the entire frame clearly and comfortably.  The viewfinder also has a diopter adjustment to compensate for less than perfect vision.Some people have commented that the controls on the Olympus are a bit confusing.  The camera is very versatile with many features and I've gotten used to the controls.  Also, the power on/off button is located fairly close to the shutter release button but I got used to this within just a few minutes.  It really isn't a problem.  Unless you're seriously lacking in manual dexterity, you'll get used to it very quickly.Also, don't skimp on the memory card.  I have a 512MB xD card in the camera and keep a blank 256MB card in my pocket in case I fill up the first card before getting a chance to download all the images to my PC.  I might just get a 512MB CompactFlash card as well since the camera has a slot for both xD and CF style memory cards.To quote another reviewer, the Olympus C-8080 is the one to get!", "Date": "July 14, 2004"}, {"Title": "Great in the day, noisy at night", "Author": "James Barnett \"JB\"", "ReviewID": "RUO88SROT5CBN", "Overall": "4.0", "Content": "Some thoughts from an amateur having been using it for a while.  Note that my overall score is high and I'm very happy with this camera: bang for the buck this is great.So - these comments are deliberately critical since I think that's what most people want to know about.  If something really cool stands out - such as dark frame subtraction on this camera for us astronomers - then I'll point it out.1. Do not look at this camera as a 'point and shoot, slip it in my pocket' sort of camera.  This is big, has many functions and can be overwhelming at first if you're new to this level of camera.  That said - the functionality and positioning of features is exemplary: for example the dual use of buttons to allow quick access to features and settings.  Also, assuming you've got the camera setup how you want it - you can flick it on and be snapping away pretty quickly; the 'user setting modes' are great in this regard, since you can save different types of setup to allow quick access.2. In auto focus mode, the camera can be a little slow to focus and you can miss your intended photo moment - frustrating!  You can set it to manual focus mode, but that can be slower since there isn't a focus ring for you to turn a-la-SLR.  You have to use the buttons to focus and that can be tricky with your eye wedged up to the viewfinder on sunny days!3. A full printed manual isn't provided - it is online on the CD only.  I think that is cheap, Olympus!4. I'm an astrophotographer and so far I've only been able to take piggy-back shots (not a problem with the camera - I just need to make some adapters).  Dark frame subtraction in night mode is extremely useful, but so far it seems the noise generated by the CCD is too much for it to handle, even in relatively short exposures (on a 75 degree F night at ISO400).  I'm going to try slower ASO speeds since that should improve it a litle, and I know cooler evenings will help a great deal, but still not off to a great start.  Also, cooling would help but at 800 bucks you can't get everything! ;-)  ADDENDUM 9/NOV/04: this camera works OK as an astrophotography camera, but basically you get what you pay for.  Because it isn't an SLR, it is difficult to achieve focus using the camera with it's fixed lens, through an eyepieve and into the telescope.  hugely magnified and actually too much noise to speak of.  I'm persevering, but I'd recommend the extra step to an SLR if you're going to be into astrophotography (Canon 20D)5. The remote shutter release doesn't plug into the camera: you have to buy a power battery holder and plug the shutter release into that.  That seemed a little stupid to me and just an excuse by Olympus to make you buy more stuff.6. I find it very frustrating that you can't plug the camera in to the mains (with the optional mains adapter) and CHARGE the battery with it still in the camera.  You have to remove the battery and use the separate battery charger.  That means more stuff to carry - and that's annoying.7. Battery life seemed exceptionally good to me, but because of the charging scenario described above, I would get a spare battery8. Video quality is good: I've taken a few but for some reason I have to convert them on my PC, presumably because of some coding issues (they import into Adobe Photo Album v2.0 but won't play).  ADDENDUM 9/NOV/04: this is now resolved and is not an issue related to this product, but rather some clash in load order between Adobe and Quicktime.9. I don't like Camedia Master, whatever version.  I'd personally recommend the use of a separate photo manager and ditch Camedia.  The only useful thing I've gotten out of it so far is stitching some panorama shots together, which worked quite well but it won't stay installed on my PC just to do that!  Other software can do that, too!Overall?  I like the camera and it's taking some great shots that have printed onto 11x14 photo paper to produce stunning images.  I find it comfortable, easy to use (after a simple learning curve) and everything you'd reasonably expect from a camera at this level.So far, though, I haven't been that impressed with the night time photography - but I'll be able to test that extensively soon so will update this review at that time.  ADDENDUM 9/NOV/04: my conclusion for astrophotography is it is worth saving some extra pennies and going for an SLR (the Canon 20D).  For daytime shooting, this camera has produced some stunning shots and I'm extremely pleased with it.Happy shoppingJB", "Date": "July 26, 2004"}, {"Title": "Wow. Ok, almost Wow, but best I've owned so far.", "Author": "Michael D. Gibson", "ReviewID": "ROEYJUSXWON87", "Overall": "5.0", "Content": "I bought this to supplement my E-20, and after having used it for just over two weeks, I think I'll put the E-20 away.Pros:-Nice size. I have big, arthritic hands, and it is a joy to use-Best image from any digital i've owned, and i've got/had a few-FAST, FAST, FAST, except for playback-Quiet-Beautiful resolution, edge to edge.-I really like the rubber grip on the lens (and the body)-Great battery life.Cons:-Slow playback (but I rarely use it, so ho hum)-You must have a micro drive for images-Lens cap doesn't fit well with lens hood (nitpick).I am particularly impressed with blues and greens. Great rich color and great detail. Can be manipulated to give results very much like film, or crank up the saturation, contrast, whatever, and go crazy.I also really like the sort of odd angle the lens is at with the body and the viewfinder, makes the camera VERY intuitive to aim and hold. I've seen some complaints about the position of the power button and exposure button, but I find them very well placed. All the controls on the left side of the camera are easy to access when holding the camera with your right.My brother, who is a photo novice bought the camera at the same time I did, and he is producing very nice images, just using it point and shoot.", "Date": "May 10, 2004"}, {"Title": "One of the best digital cameras I have ever known!", "Author": "Aaron M. Ramsey \"AMRamsey\"", "ReviewID": "R393ALRRSLBGV5", "Overall": "5.0", "Content": "I bought my C-8080 last summer, and I was immediately impressed with the image quality as I walked up and down the beach for hours testing the camera's features, not to mention the capacity of my Xd 512mb card. I have been abroad all year in France and this camera was the first item I packed. It has been able to withstand the Parisien winter downpours and still take some exquisite pictures. My shutterfly account has never been so full! The color tones of the camera's image sensor are increddible, and its feature set is limitless. The learning curve for the c-8080 is steeper than other cameras in its class, which is why I would call this camera a pro-enthusiast device. When you master the settings and buttons, the images improve that much more. One thing I have to comment on is the battery life...I have gone on trips for two weeks and did not bring the charger. It was only on the last day in Nice that the battery light started blinking, and I had gotten at least 35 pics in each day. The camera has survived my backpack, which is not the most forgiving place considering my traveling addiction, and has yet to have a scratch. Olympus has provided me with a great way to capture all my photographic desires in one package.", "Date": "May 17, 2005"}, {"Title": "Still One of My Favorite Cameras!", "Author": "J. Wong", "ReviewID": "RFWY9106TA74Z", "Overall": "4.0", "Content": "I've owned by C-8080 for over a year.  Several months ago, I bought a Canon Rebel XT DSLR.  The XT gets better resolution, focuses and stores faster, has a broader dynamic range, and slays the C8080 in medium and low light hands down.  Add an image stabilized lens to the XT, and performance-wise, the C8080 gets left in dust accross the board.But I still often I pack the C-8080 and leave the XT at home.  In good light or when using flash, the C8080 takes great pictures, with very respectable resolution and clean, bright, vibrant Olympus style colors.  It boasts a lens with one of the widest front diameters of all the digicams on the market (and thus captures more light), and the quality of the glass is superb.  Raw mode storage is slow, but the results can be wonderful---you can sqeeze one more level of resolution and color depth from raw.  Comparable pictures shot with my XT would blow up to bigger size, but the C-8080 is more than adequate for the typical 8-1/2X11's that I print at home.  The C-8080 can produce fine prints in many cases at 13X19.While not \"compact,\" the C-8080 is a tidy, convenient, sturdy tool that is suitable for the serious photgrapher.  The 28-140 mm is too short for field sports, but it's great for indoor people shots, landscapes, and the majority of common shooting situations.  Autofocus is generally \"fast enough.\"  The dual memory card format offers a convenient way to organize pictures and immense storage capacity.  I like the tilting viewfinder.  The control layout is a bit complex, but you learn to maneuver it.  It offers more precise control over shutter speed, aperture, and ISO than most digital cameras; ISO choices are, for example, 50, 64, 80, 100, 125, etc., instead of the more standard 50, 100, 200, etc.  This means, among other things, when you haven't got enough light for ISO 100, you might not need to drop to ISO 200 where you will pick up more noise; instead, maybe you can capture the shot at ISO 160. Noise is typically not an issue until you are pushing ISO 200.I wish the C-8080 offered image stabilization.  I wish it did  better in dim light.  I wish it zoomed out to 200mm or better.  But it is an easy camera to pack and operate, and in many, many situations, it does more than well enough.  This is useful, quality gear that was built to last a long time.", "Date": "December 9, 2005"}, {"Title": "No, 6 stars", "Author": "Gary O \"wudooeyeno?\"", "ReviewID": "R1FN2RPAK5JE53", "Overall": "5.0", "Content": "I'm not getting it.I have no problem with this camera defaulting to the xd card when you turn it on. It stays wherever it was when I shut it off.I'm having no problem with the power switch. It's on the top, the shutter is on the front. Since I'm still trying to learn how to walk and chew gum at the same time, I don't understand the problem many seem to be having.Swivel LCD? It's cute but the only use I found for it is taking a pic of myself in a mirror. (Not a pretty sight!) :)Low light problems? I have no complaints. Contrary to popular belief, *most* indoor shots with a digital camera *don't* need flash. In fact, more often than not, flash will ruin it. The \"film\" is free. Try it both ways. :) Experience will let you know when you need it and when you don't. Don't just pop up the flash simply because you are indoors. I remember a few years back reading a lot of complaints about my old nikon coolpix 800 having low lite problems but I never did. No problem with the c8080 either. And if all else fails... that's what they make Photoshop for! (And I hardly ever need it with this camera)Auto focus problems? Don't use it if it doesn't work for you. (Yes, it does have manual focus)Remote shutter release plugs in? I must be missing something again. I got a cordless one with the camera.The only con I have is that the manual has to be printed out, but what doesn't anymore? Never had a digital that came with a book.Ok, two cons. Yes, I know it's a heavy piece of equipment but still I would have liked a wrist strap.I learned from past experiences with digitals... even before you take your first shot, print the manual and read it.If you go by the old adage... when all else fails, read the manual... you do this camera and yourself a disservice. And reading it on your computer doesn't really cut it. You need to print it out or you're going to miss a lot.", "Date": "February 7, 2005"}, {"Title": "Good camera--superb digital image quality", "Author": "Douglas Henderson", "ReviewID": "R1TJR2LATEYBDA", "Overall": "4.0", "Content": "I bought a brand new, USA warrenty Olympus C-8080 camera a few weeks ago from Buydig.com--for $472.00, about half what this camera cost when it first came out last year.  Had considered an Olympus Evolt, but I went for the convenience of an all-in-one-piece high-end amateur camera which has been receiving very good reviews and seems considered the best of the 8-megapixel non-SLR cameras available.  I'm an illustrator and large-format photographer--and a  stickler for image quality.  The C-8080 produces beautiful images with sharp resolution and even illumination from corner to corner. The lens and image quality are simply superb.This is my second digital camera, the first being a Panasonic FZ10. Both these cameras have EVF's (electronic view finders) instead of optical view finders. EVF's are very useful--the screen actually gives some visual indication of an exposure before you take the picture. The FZ10's EVF is especially accurate in this regard.  The C-8080's EVF is less so--but it is only a matter of experience decifering the image that appears in the EVF before making the exposure.The C-8080 has far more functions than I am likely going to explore using.  Since I am mostly shooting landscapes , all I really want is confidence in the exposure and focusing functions of the camera--and after a few days of experimenting and a 2 day trip in Yellowstone shooting scenics, I'm quite pleased with how the C-8080 handles.I especially like the AEL (auto exposure level) button on the front of the camera.  It allows you to preset the exposure before focusing on the image--and generally, if a scene has both dark and very bright components, you will not get a good exposure if you just point and shoot. I found it necessary to point the camera at the brighter/brightest elements of a scene (pointing it well up into the sky with clouds, for example), then set the AEL, then return to the scene to be photographed and make the exposure.  The C-8080's EVF does not give you an accurate visual indication of the exposure--if the scene in the EVF looks good, likely it will be a little or more overexposed.  If the scene in the EVF looks disturbingly dark, then it is about right. When you have to choose between what looks good in the EVF and what the AEL button gives you, trust what the AEL button gives you--even if the view is very dark. Having shot 4x5 and 5x7 film in the field with a lightmeter and faith, the C-8080 exposures are a breeze.One disappointment with the C-8080--the manual focus functions. Various user reviews dating back to last year mention problems with the manual focus--and it seems to be a design flaw.  Not only is manual focus a time-consuming multi-step effort, but it doesn't work.  Photo results using manual focus at infinity are noticably inferior to the same scene in auto focus.  Hard to believe Olympus let this camera out of the lab with such a crummy manual focus ability.  I hope Olympus is reading this--they ought to design an easy, fast, one-step, \"get-me-there-now!\" manual infinity lock. In some low-light conditions, the auto focus has a hard time locking onto infinity--and you have to scout around in all directions to find anything far off that the cameras will settle on.  Using manual focus instead is out of the queation.  I should note, that in the two days in the field in Yellowstone, I did not have any problems with auto focus--it worked fast and reliably.The above said, the C-8080 is a great digital camera.  Prefered settings can be programmed and returned to quickly by turning the dial to 'My Mode\", which is very handy. Very good battery life.  Very good low compression JPG's. TIFF and RAW if you want them. Image color is very accurate (some call this neutral) and can be adjusted with various settings in many small increments. Also, the memory cards and batteries are compatiable with top-of-the-line Olympus SLR models. Just be sure when erasing memory cards in camera that it is set to the card you intend, since the C-8080 defers to the xd card (if an xd card is in the camera).", "Date": "July 3, 2005"}, {"Title": "EXCELLENT OPTICS, GREAT PICTURES, COMPLICATED.", "Author": "Capt. Phil \"Capt. Phil\"", "ReviewID": "RFTGSMGQWYHGY", "Overall": "4.0", "Content": "After 40+ years of taking pictures in 35mm I decided to wet my toe in digital waters with an Olympus C2020. Used that excellentcamera for three years and decided this spring to upgrade to theOlympus C8080WZ just then released by Olympus.This camera takes great pictures, many examples can be viewed at digicam.com by going to the forum for Olympus Digital. The Olympus lens is considered by many reviewers to be the best available for digital. So... why not five stars?End results are, of course, the bottom line in an camera but some weight must be given to how difficult it is to get those results. This is where I must hold back a star on the C8080WZ.The camera is difficult to focus in many situtations... low light, low contrast, fast moving subjects. There are options as to how the camera's auto-focus is applied but each has its own issues. I do not think Olympus has done a good job with the auto-focus in this otherwise excellent camera.Personally I don't like the EVF (electronic viewfinder). It is overloaded with information in my opinion and under high contrast conditions it suffers degrading vertical color bands which do not show in the photos but are distracting when trying to compose a nice landscape scene.The power zoom works... but I would prefer a manual zoon. Power zoom seems a waste to me, it is never as accurate nor fast as manual zoom and uses battery power in the bargain. I suppose this is a necessary evil but could do nicely without it.Maybe I'm spoiled by my years of Nikon SLRs that were straight forward in their operation. Look through the lens, set apature and shutter from built in metering, focus and trip the shutter.Now it's a half dozen choices to be made and in things like focus you really don't have much control anyway... the cameradecides and you are stuck with that.My Olumpus C2020 remains my favorite for most outings. It is a true \"point and shoot\" and gives fine results within its 2mpcapability. An 8mp camera that operated as nicely as my C2020would be a true \"upgrade\" for me.", "Date": "September 19, 2004"}, {"Title": "Very Nice Camera", "Author": "dancingdog1", "ReviewID": "R2Z3DMNP8M4OUU", "Overall": "4.0", "Content": "After having had 2 older olympus cameras I decided that I would stick to what I am familiar with and I purchased the C-8080. I am very pleased with the camera.Most of my picture taking is outdoor scenery and wildlife so that is what most of my review is based on. I rarely take indoor photos so I have no opinion as to the quality of it's indoor pictures.For outdoor use..Pros:Picture quality is very good (Best for daytime use). It has a very quick startup time and the different options it offers are very nice. It allows you to set up the features you use the most and then saves those settings for future use (My Mode)..very handy in a pinch. I have discussed problems with the focus below BUT I wanted to point out that when you do get the camera in focus the pictures turn out fantastic (see butterfly photo in album). I have been using this camera for capturing butterflies and insects on flowers and am very pleased with the results! I have also photographed elk and deer with it and have gotten some awesome pictures. The battery on this camera is also very good. I have yet to purchase a second battery because the one that came with the camera has a long use life. I do plan on purchasing a second battery only because it is just a good idea to have one on hand. The camera is, in my opinion, easy to use and a very good camera for the money.Cons:Nothing is without it's flaws and this camera is no exception.I, like many other reviewers, am not real pleased with the focusing on this camera. If I want a closeup shot of a flower(for instance) then I have to back up a good distance away in order for it to work. The manual focus is not fantastic and you usually have to sit there for several minutes trying to get it to focus and, occasionally you will wind up taking several blurry pictures before you get one that will work. This is NOT good when you are trying to take pictures of moving targets! I have taken several deer pictures where the deer is fuzzy but the tree in front of it is clear as can be. Good thing it's digital and you can remove the unwanted photos! I have also found that in low-light settings the photos are almost not worth having as they are very grainy.", "Date": "August 1, 2005"}, {"Title": "The Olympus C-8080 from advanced amateur to pro photos.", "Author": "AZ Sheldon \"Somewhere in AZ\"", "ReviewID": "R2PN65GHEI9TUF", "Overall": "4.0", "Content": "My background in photography extends back to my high school days in 1976, through selling cameras professionally for 6 years in retail post high school, and then later after college taking wedding photos with a Hasselblad and pro lighting for a few years 'on the side.'In 2002, I sold all of my film-cameras, and went digital with an Olympus C-3020 to start (a 3.2 mega-pixel camera).  In 2004, I upgraded to a C-8080 and bought a 2-gig card and extra battery.  In 2005, I purchased an E-300 Olympus, and both are 8 mega-pixel cameras.  The battery is exactly the same, so now I have three batteries and two chargers.  Staying in the Olympus family made the transition to new menues very easy, and when my wife takes the C-8080 (recently on a trip to China) I have the E-300 to use with additional lenses.I am very happy with the image quality of the C-8080, and with a 2-gig card, this unit can hold just over 1,000 high quality photograps, making vacation and family photography enjoyable and almost flawless.  Many have discussed the advantages and how \"great\" this camera is.  So, I will touch on some of the more sensitive areas.  Understand, first, that these are overcome by the other qualities of this camera -- it is really super.The C-8080 is an SLR (see through the lens), but understand that the image that one sees through the camera is a projected image, like a TV screen.  This is on EITHER screen, inside the camera or on the back.Contrast this with the E-300 and one sees the acutal image just like looking through a real (film) 35mm SLR in the E-300.  This is partially why I gave the C-8080 camera 4 stars (I would have rated it at least 4.5 if that rating selection was available).What that means is that, with either view, the image is using battery power.  Still on a two week treck across the US to Ohio and Michigan, I over came that worry with the extra battery, and in two weeks and over 400 images, I still had power to spare when I returned home.Additionally, looking at the image, one again does not see the actual image, but its reproduced equivalent.  In lower light, one cannot pick out, say, a reflection on a subject's shirt button or other small point of reference to use as a manual focusing reference (the screen does not display well in very low light).One offsetting advantage, though, is that the image display plate on the back of the C-8080 can be 'pulled out' and positioned (adjusted) so the photographer can hold the camera overhead to make shots in crowds of people, or it can be adjusted to view the image at waste level - kudos, Olympus!The other disadvantage that I find is the focusing in lower light.  Where on the E-300 that camera uses a pulsed flash to help in focusing, the C-8080 actually sends out an amber-colored beam to help \"illuminate\" a lower ligted area, but this is not a strong beam and doesn't help the photographer, other than to give one some illumination to try to see and watch the camera re-focus if at first the unit doesn't succeed.  This is the other reason why I gave this a 4-star rating.Overall, though, I love this camera.  It's all I used on several travels now, and each time I've been pleased with the results.  Even with its fixed (non-interchangeble) lens, the variety of focal lengths was quite enough in 98% of the photos, and the exposure meter is exceptional.  It can be used as easy as a point-and-shoot, and has some really nice advanced features.A person can take photos \"out of the box\" when the battery is charged, and in the meantime walk through some of the neat things outlined in the manual to learn the menu system and make advanced modifications.Last, but not least, the overall Olympus quality in digital cameras has without a doubt impressed me.", "Date": "November 13, 2005"}, {"Title": "An amazing camera!", "Author": "Francis D. Ferrall \"Delphititan\"", "ReviewID": "R2V9KPT271IB2G", "Overall": "5.0", "Content": "I have been using a Canon G5 for the last year. I wanted higher resolution (althought the Canon is excellent for 8\"x10\" images). I have read C-8080 Wide Zoom reviews on the most prominent review sites. I noted the comments about the excellent image quality and the comments about slow writes shooting raw, the power button too close to the shutter release, etcetera...Forget all the negative nonsense. I acknowledge that I am only one user in thousands of my new C-8080, but this camera is wonderful. The image quality is stunning. I took the time to read the online manual (I don't care if it wasn't printed all nice and tidy). I studied the settings, got used to the features. It took a few days of practice.I find myself truly motivated to plan outings to practice the art of photography. If my images aren't quite what I am expecting, I can use the incredible C-8080 feature array to make the necessary adjustments. I use a tripod when necessary. I use a polarizing filter when necessary. I am waiting to receive my FL36 Olympus flash for additional lighting when needed.If you are more serious about image quality and control than a particular button being \"here\" instead of \"there\", you should give this camera serious consideration. Buy it. Use it. Enjoy the art of photography. I'm leaving now to take my C-8080 Wide Zoom and create some new works of personal expression. Good luck to you in your own photographic experience!", "Date": "April 26, 2005"}, {"Title": "A review for the ambitious amature", "Author": "Kindle Customer \"jtouchst\"", "ReviewID": "R4VD5VJC5K2W8", "Overall": "4.0", "Content": "This is my third digital camera. My first was a canon powershot g3-- A camera I would still be using if it hadn't developed a problem with storing images to CF cards and downloading them to the computer.  My 2nd camera is a Canon s100 point and shoot.  Just so that you can understand the view point of this review, I will let you know that I consider myself an amature with intentions of improvement. If you are a pro photographer or even an advance amature,  this review won't offer you much.  That being said, if your aspirations are like mine, this camera is an excellent choice.  I explored most of the major online sites prior to making my choice: Steve's Digicams, DPR, etc.  All those sites gave the camera high marks.  What I liked most about this camera was the image quality.  It had the least noise, and least chromatic abberation and distortion of any of the 8 megapixel cameras in nearly all the reviews.  Since what I wanted most at the end of it all were excellent photos,  this was enough for me to make my choice.  And if you aren't happy with the shots straight from the camera, you can tweak every thing from sharpness to saturation to achieve the results you want.  Other features that I liked included the wide array of image size, and shooting options available.  I felt that this camera could certainly grow with my skill level for years to come. Many have complained about the placement of the power button.  I haven't had any probs with it.  I have not accidentally turned it off or on even once.  Now what I would change if I could:Oh I wish the LCD were a swivel display.  I have grown accustom to this with my canon.The flash does not automatically pop up when you need it.  The EVF is taking some getting used to.  I am still wary of weather or not what I am seeing actually represents actually color, lighting etc...The menu system could use some revision.  I am sure it will take me a while to learn to use the camera to its best capacity  simply because the menu system is not intuitive.  You actually need to read the manual and the one on the CD to work out the ends and outs of the camera. The camera defaults to the xD card if you have a both and xD and a CF card in place.  This has caused me some problems.  You will be less frustrated if you only have one or the other installed. I like this camera more and more every time I use it. I researched my choice exaustively and none of the other 8 megapixels currently available even tempt me when I look at the whole picture.  I don't think this camera will dissappoint you .", "Date": "June 15, 2004"}, {"Title": "I have used many cameras, this is one of the best!", "Author": "FromCharlotte \"ddppkosh\"", "ReviewID": "RDH6RDUEBXBQH", "Overall": "5.0", "Content": "As other reviewers have already talked about this camera, I want to give my comparisons.Olympus C8080- The best so far. 8MP, picture gives you complete details.Olympus E10-A best 4MP SLR digital camera.Olympus E20-5MP, but very slow.Olympus C5060-Very good, slow start.Olympus C5050-Great camera and slow, not so good for big prints.Olympus C700 - Good zoom, very good color, bad contrast.Olympus C3020-The best at 3MP, very good for small photo printsOlympus C4040-The best at 4MP cameras, but had some issues with skin colorsOlympus C50-Horrible focus and not happy withOlympus D510-Good camera for web photos, very poor color though.Olympus D360L-Good for web photos, no optical zoom.Nikon 990 & 995-The best 3MP camera but odd shapes.Nikon 3200- except the size of the camera, very disappointedCanon IS S1 - At 3MP and 10x optical zoom, this camera rocks.Canon S400 & S410-Good cameras, but you can not get the details of the subject.Panasonic DMC-FZ10K - Great optical zoom, but very poor image.Hope someone using these cameras find my review helpful.", "Date": "May 18, 2005"}, {"Title": "Excellent 8MP camera", "Author": "Timskis6", "ReviewID": "R1SFF4BXZACQQ0", "Overall": "5.0", "Content": "This camera takes excellent, clear, vivid, high resolution images.  A myriad of different customizable variables.  Super bright lense system.  EXCELLENT battery life (more than 400+ photos w/ LCD screen ON and flash OFF).  The startup time for the camera is very quick, among the fastest I've seen.  Would definitely recommend over the other 8MP cameras.  Owned the 8080 for about two months now.", "Date": "March 16, 2005"}, {"Title": "olympus c8080", "Author": null, "ReviewID": "R2CI28OWIZQCOR", "Overall": "4.0", "Content": "I've owned the c2020, c5050, nikon's 5700, canons d10, in that order,and I'm back with olympus c8080. theres nothing in my opinion like the glass of olympus, great for daytime shots, too slow in low light situations. the on off button is to close to the wide angle, telephoto button it's taking some time to get used to. pros.........the colors are the truest no need to adjust in photoshop, and rarely in photoshop with this camera...what you see is what you want to keep! it's alot of camera for a small package........very light for all thats inside....go olympus!", "Date": "May 19, 2004"}, {"Title": "From a long time owner, GREAT CAMERA!", "Author": "Kort \"Art, Music, Book & Movie Enthusiast\"", "ReviewID": "R1HEQ6BGT0AYQ5", "Overall": "5.0", "Content": "Before this camera I owned the Oly C3030 and C5050.  All great cameras but they pale when compared to this one.  Even as I write this today, I would still recommend getting this camera used at a great price rather than spend more on a newer model.  It has every control a camera enthusiast could hope to have short of owning a higher end SLR, with the convenience of having everything in one fairly compact package.  After a little bit of a learning curve, this camera becomes intuitive and is a joy to use.Who is this NOT for?Someone who needs to shoot a lot of images in rapid succession at high ISOs, and who want interchangeable lenses.This camera has a rather slow buffer and file write time, especially if you are shooting RAW.  Also it only goes up to ISO 400 and noise is quite noticable at that ISO.Who IS it for?Everyone else.  If you shooting style is more sedate and you shoot at lower ISOs, you will be reward with stunning imagry and very little noise, if any.  You can exercise the utmost control over every aspect of your photography, or just set it on auto and let it do it's thing.  You will love the results and the wide angle 5x zoom is like have 3 lenses in one.Don't want to take my word for it?Feel free to visit my website (kramerkreations dot com) and peruse my photo gallery.  I think you'll agree that is one amazing camera at a great price.  If I had to do it all over again, I would get another C-8080WZ without hesitation.Happy shooting!", "Date": "July 31, 2006"}, {"Title": "The little Camera that could!!", "Author": "Sinister Minister", "ReviewID": "RQYE7LM8C91CN", "Overall": "5.0", "Content": "The sinister Minister here. To give you some insight on yet another camera that has inspired me to go forth and take pictures! The C-8080 has been my 2nd Olympus camera,(The e-300 was my first) and will most definitely not be my last.Some of you may have seen my review of the Sony V3 camera which I considered the ultimate point and shoot camera, that was until I got my C-8080. The c-8080 has all the important features of the V3 such as dual memory capability (XD & CF 1&2, Hot shoe, Etc.) But it surpasses in many other areas such as 5X optical zoom as opposed to 4X on the Sony. A swiveling LCD Screen, 8MP instead of 7.2 (yes it makes a damn difference) and finally a much more in depth and concise menu system and exposure control, allowing you tons of other options in how you expose and take your pictures,(Scene presets, shutter speeds, exposure control, focus options, White balance, ISO settings) On almost all counts the 8080 came out the topdog over the V3. Even the battery life is better.It was even as good as the V3 in low light wich really surpised me! Now understand that this is not a pocket camera neither is the V3 for that matter, I mean you could kill a mugger with this sucker and take his picture afterwards! Again not so with the V3, it is a sturdy camera to be true, but the 8080 is made of metal and forever. While on the subject of design-the 8080 is a larger but more comfortable camera to use, it fits sweetly in your hand and not quite as chunky as the V3. Shot to shot I rate them about the same as far as speed, and the Sony I think is a little quicker on start-up but not by a margin that would be outstanding. Okay so we did the tech thing now what about the pictures? Again I have to go with the C-8080. I found the color reproduction a little more on the money and over a wider selection of settings (which the V3 didn't have to begin with) I still love Sony's film clip mode and in camera editing features better than anything else out there however so that one goes to the V3.This review comes a wee bit late, Olympus has already released thier new models for the 2005 Holiday season and most of those suck in comparison to the 8080 (except the E-500-mines on order!). But even so I would reccomend picking up this camera while you still can. Because in its class there really isn't anything out there that can touch it as far a form, function, and the ability to take amazing photos! Some cameras do outlive upgrades & trends (like the Sony F-828) I think the C-8080 will follow suit.Actually its the new designs that have turned the 8080 into the ultimate point and shoot camera! Most point and shoot cameras are now between 6&8 MP (Fuji has a 9MP!!) have an optical range of 3-5X and are getting faster by the day! (well some are)The little camera that could? That could still be around in 2 or 3 years because its just one hell of a camera! I still stand by my 5 star rating I gave the V3, but as we speak I've sold mine and kept the 8080 to take its place.By the way theres one thing you should know about digital photography, that no salesman or self-proclaimed pro will likely tell you...you will outgrow your camera! But hey thats a good thing right!? So if YOUR ready to grow look no further! Thanks for reading and Happy shooting!", "Date": "November 3, 2005"}, {"Title": "5X Zoom Question", "Author": null, "ReviewID": "R33GZ8YQQ7ORRW", "Overall": "5.0", "Content": "Here's a little optic lesson.The higher the zoom ratio i.e. 2x vs 7x, the more problems with the lens.  This may show up asdistortion, out of focus corners, resolution, etc.  Generally, the greater power, the moreapochromatic problems with the lens.  Also the higher the zoom power, the lens gets larger or thef/ get smaller as it's zoomed.  Olympus did a very good job with this lens.  The \"cost\" of a greaterpower would be of not much value if they had to compromise the image quality.  Just about, theonly one who cares about 5x vs 7x are idiots.  Don't get a complex over it.  You have the best lens (for 8MP camera's today)", "Date": "June 13, 2004"}, {"Title": "Extremely Happy", "Author": "P. Volpe \"djsmack\"", "ReviewID": "R1DSUJZXOLXP0T", "Overall": "5.0", "Content": "As someone who has jsut begun to get beyond the basics in photography, this camera has allowed me to really grow.  This is a terrific tool and I have been extremely pleased with my pictures:[...]Yes, it is slow in low light to focus.  Yes it is a bit bulky (but feels good in the hand to hold) but that lens takes terrific pictures.I have had the camera for about 6 months now and love taking it out more every day.  Lots of flexibility and features to keep me busy.", "Date": "November 10, 2004"}, {"Title": "Disappointed", "Author": "Jim G", "ReviewID": "R253MFNTR416QU", "Overall": "3.0", "Content": "I've pursued photography as a hobby for many years, and have been using digital cameras or a number of years.  After reading the glowing reviews of the 8080, I decided to give it a try.The camera build is excellent, and the ergonomics are great too.  It has a wonderful feel to it, and the controls are placed well.But, unfortunately, I have found this camera to be very slow focusing indoors, and that focusing is often inaccurate.  Shooting in a living room with an incandescent lamp or two, the focusing performance is poor, going through a hunting sequence.  It takes about 4 seconds to get a prefocus lock.  I have experimented with the AF light on/off, and various focus settings, but nothing really helped. If you shoot mainly outdoors or in bright light, this is not an issue, of course, but if you intend to shoot indoors at holidays, parties, etc, you may be disappointed because of this issue.The playback time tends to be slow as well (using a CF card)... to move from pic to pic takes a second or two - noticibly slow.Others have discussed already the great picture quality, so I won't go into that here.  The slow performance in low light has made it a dissapointment for me, and I will return it.", "Date": "November 3, 2004"}, {"Title": "I have owned a C-8080 since they came out with it", "Author": "B. S. Waters \"BRAGGART\"", "ReviewID": "R2RXXAC4AFX9AM", "Overall": "5.0", "Content": "I have been reviewing the reviewers of this product.I have owned this camera since it came out.I have the lens adapter and lenses that are available for this product and have used them.The pros: The camera has minimal turnaround time from shot to shot.  It works the best in bright light whether indoor or out.  It makes great portraiture shots in good lighting.  It has great battery life.  You can make a video with sound in video mode and the video is  as long as your storage card will allow.  You can play back video with sound on your camera.  It takes two different brand of cards.  This is a wide angle camera.  I also purchased a wide angle  lens specifically for this camera that takes approximately a  100 degree shot.....maybe more.The cons: Does not do well in low light.  Automatic view finder centers on wrong object.  Searches when focusing sometimes (low light).  I bought the telephoto lens specifically for this camera and  have found that you cannot zoom with this attachment.  Also if  you tend to get a tunneling effect if you do not have the fixed  zoom lens positioned right.  I used this tunneling effect in my  photos with good results.  Does not take good action shots.", "Date": "March 18, 2008"}, {"Title": "No major issues so far...", "Author": "rootie", "ReviewID": "R1MY4U1QL0IP3G", "Overall": "4.0", "Content": "I am still getting acquainted with this little gem.  In spite of all the criticism below, I am definitely happy with it.I have to say that I agree with pretty much everything JB said in his review \"Great in the day, noisy at night\" -- I haven't done any night work with this yet.So why post?  Some comments I've got are not included elsewhere.  Some are worth repeating.As mentioned in other reviews, I too have hit the power button when I wanted something else.  The main annoyance with this is the camera's configuration is reset on power-on, so if you had a shutter speed set, you get to reset it.  There is a camera setting to reset all settings on powerup or not which is presumably intended to correct this.  Personally I'd rather have the settings reset and have the power button recessed, or at least a little bit stiffer.  The power button is *very* responsive.I *LOVE* the startup speed.  It's on and ready to shoot before I can have the shot framed.  (This does take some of the sting out of hitting the power button accidentally)I *HATE* the manual focus.  It zooms into the center of the image and you are supposed to be able to tell from very raw pixels when you are focused or not.  It isn't as easy as it sounds -- slow, painful, inaccurate, and tedious.  There has to be a better way.  My Nikon CoolPix 995 boosted the sharpness of the preview in a way that let you tell what was in focus and what wasn't.  Still painful, but much better than this.The 8080 doesn't overexpose as much as my 995 did.  I like not having to adjust.  The only thing I have encountered (which I need to reshoot to understand better) was a pinkish flower in my yard that for some reason was oversaturated on the blue channel.  Probably an out-of-gamut RGB color?I very much like having all the buttons for individual settings.  The 995 was a real pain going into the menu and browsing to find the setting.  The 8080 is nice -- hit the right button, spin the wheel to the value you want without being required to dig through menus.  Those of you who like digging through menus will be relieved to know that you can do everything through the menus that you can do with buttons.I definitely like it.", "Date": "September 11, 2004"}, {"Title": "A Honey of a camera", "Author": null, "ReviewID": "R1CG2C1NY0OMSL", "Overall": "5.0", "Content": "I've owned nine digital cameras at one time or another, looking for the perfect one. The olympus E-20 came close except for the weight and that monsterious lens that scaried the hell out of people. Then i found the Fuji S7000, which is a great one and i thought nothing could ever beat it. So i was hesitant to buy the Olympus 8080 but was glad i did. As soon i handled the camera, i knew this was different. I love the camera more each day, it grows on you. It has licked most if not all the past problems associated with digitals. Speed in all departments and well, what you read in the specs is all true. and the price is also great. I was a little worried about the placement of the off and on button, but i got used to it.", "Date": "May 17, 2004"}, {"Title": "Great Camera, Great Seller", "Author": "Rottyboyy", "ReviewID": "R1QOYLAV4M36J0", "Overall": "5.0", "Content": "I'm no expert, but I believe the quality of this old (er) model camera makes up for bells and whistles that newer models may have.  This is a very savvy and helpful seller.  Would buy again.", "Date": "March 23, 2013"}, {"Title": "Camera", "Author": "AnnaMarie oudal", "ReviewID": "R2567XYNWRILUC", "Overall": "3.0", "Content": "It is a good camera, but some of the features on it did not work.  I enjoyed the lens that came with it.", "Date": "March 3, 2013"}, {"Title": "Great camera when you want a all in one", "Author": "J. Waugh", "ReviewID": "R1NGMMR8X1HUD", "Overall": "5.0", "Content": "This is a great camera, even used, it outclasses alot of new ones.  I purchased it because I wanted something close to a DSLR for image, but all in one - currently you can only get cameras with the tiny little point and shoot sensors as all in ones.  The C-8080 has a physical sensor size that is somewhere between those tiny point and shoot and a DSLR APS sized sensor - the bigger the sensor (not the megapixels), the better the picture (lens quality applies as well).  It also has a big fast (F2.4) lens (wide angle and gathers alot of light) and is built like a tank (Magnesium body I think).As a note, after this camera came out the entire industry shifted their pro-sumer lines (bigger physical sensors) over to DSLR's - since DSLR's were falling into the same price range.  They could make more money selling you lenses there.  So this was an example of the pinnacle of high end point and shoots.  Of course you couldn't get a DSLR with a high quality F2.4 lens built out of Magnesium for those prices...but that's the way the cookie crumbled.I have a small point and shoot, the C-8080 and a DSLR.  The pictures from this camera are so stunning compared to the point and shoot that I rarely use the point and shoot anymore (it is now the take it in dangerous conditions camera).  The DSLR pictures are slightly better, but the C-8080 is the Camera I take with me.  Its not too big, takes fantastic photo's (that lens and bigger sensor size) and just works.The one downside to it is that the auto-focusing doesn't work quickly in lower light (like evening indoors unless you're close to a bright light source) as you can have it hunt for a moment - losing instant picture moments - but you want a DSLR for that.  This doesn't get in my way much, even with a 2 year old daughter.  Highly recommended.", "Date": "January 26, 2009"}, {"Title": "Four Star rating until ...", "Author": "AHB \"barbwiretoo\"", "ReviewID": "R12262477D3KE1", "Overall": "3.0", "Content": "Purchased the C-8080 Wide Zoom to replace my Olympus C-3020. Excellent decision at first. Two months of great pictures, except in low light situations (poor focus). Then the bottom dropped out. The camera froze in the middle of the operation - just like my computer often does. Nothing worked - no zoom, no shutter, no on/off switch. Had to reboot by removing and replacing the battery.Operated normally for 10 shots, then ... iced again. Changed battery - functioned normally for 15 shots, then ... again. Changed to additional battery - three batteries - frozen again. Removed cards, one at a time - no difference. Currently undergoing repair at Hauppauge, NY.Love the camera - fits my hand well, everything except POWER SWITCH in acceptable position. Looking forward to getting it back. Optics are superb. Movie capability is excellent, with great sound pickup. Should be 4-star+.Will continue using my old 5-star rated C-3020 until the C-8080 returns. See follow-up review when I get it back. Will also include time duration for repair.", "Date": "July 30, 2005"}, {"Title": "Great camera", "Author": "Theoni Lussos \"Kandy\"", "ReviewID": "R3AR8PDNTJ6TDE", "Overall": "5.0", "Content": "I love this camera.  Takes beautiful vivid shots.  Lightweight.  A bit on the noisy side.  Has lots of options that aren't the easiest to figure out -- a lot of nested menus and if you aren't setting them all the time you have to rethink how to set them.  Got this Lowepro Toploader Zoom 45 AW (Black) to carry it in and it fits snug as a bug in a rug.  Nice all around camera.  Lightweight too.", "Date": "December 12, 2011"}, {"Title": "Great picture quality", "Author": "Mary L. Williams", "ReviewID": "RQ51DXIT5GDYU", "Overall": "5.0", "Content": "I have the D-490 Zoom and needed to upgrade.Great picture quailty but not enough MP and zoom.After reading reviews and being so satisfied with the Olympus I have I decided to buy the C-8080. I am no professional and needed a camera that would do almost everything automatically. The pictures are exceptional quality. I am still learning but that is why I bought one with so many features. I can grow with this one.", "Date": "August 1, 2005"}, {"Title": "If you are serious, look elsewhere.", "Author": "R. Haas", "ReviewID": "RTEXQEMOD1SD5", "Overall": "1.0", "Content": "If you are thinking of purchasing this camera, STOP!It was too late for me to send mine back to Amazon when I found out this camera can NOT be focused to infinity manually. It focuses to 16 feet. Which means everything beyond is fuzzy. And to add insult when the Auto-focus gets confused it goes to 16 feet. (The point of manual control is to get the shot even if the auto stuff does not produce the image you want) Which means the dirt at your feet is sharp but the fall leaves on the Vermont hills you're hoping to get this fall will be blurry. I have hundreds of ruined shots with no way to ever take them again. Everything else is great about the camera but what does it matter if the metering is excellent if the shot is out of focus? You still have to throw it away...I wish I found this out in time to exchange for the SONY F-828. If you are looking for a camera with all the manual controls you need for \"Prosumer\" level work, get the Sony.(I called Olympus and \"they're a International company and they're not going to change the firmware\" for me.)", "Date": "August 1, 2004"}, {"Title": "Just moved up from the C-5050", "Author": "B. Cameron \"CamRich  22\"", "ReviewID": "R3QDHSBA4R4VGH", "Overall": "5.0", "Content": "This will be short and sweet.  I just moved up to the C-8080 from the C-5050 (which I loved for several years now).  I am glad I did.  This is a (realitively) simple camera, two media types, and very easy to use.  The results have been great so far (4 days of joy) shooting plants, birds in the yard, the neighbors kids, and I can't wait for vacation this summer  where I think it will shine shooting vistas in Arizona.I am one happy camper that I bought this camera.I might add that I bought an extra battery so I can keep one charged at all times.  I'm still on my first charge.....I highly recommend this camera...", "Date": "June 17, 2005"}, {"Title": "8080", "Author": "Erich", "ReviewID": "R3T0C8GEC32FTJ", "Overall": "3.0", "Content": "Very good camera but...If you shake the camera, it rattles, the lens is not firmly mounted.The power botton is horriable.  You can hit it with you finger working the camera and be turning it off in the middle of an operation.Highlights can easily be blown out.Focus in the dark are out of focus.jog wheel is over too far, and trigger bottom tripped over the front too much, instead of on top.Pixel per pixel, my 2 MP Canon S110 is by far sharper.Odd backround noise in movies.Most external flashes hit the pop up flash, making it no good.Lens hood will interfere with flash on 3 ft close ups.Can not come close to SLR optical manual focusing.  This has manual by buttons.  Not that great.Slow post views of images.LCD sticks out and I'm afraid will be the blunt of bumbs.Battery charger has cord.  My Canon, has flip out AC plug.Have not used software yet.* * * * * * * * * * * * * * * Since most people only want the bad, that's what's above.  I don't have the time to list all the good.  I think this is the best 8MB to date.  Bought for $789  I'm still learning about it too.  Wanted the Nikon D70, but with lenses and flash, too much $.", "Date": "May 8, 2004"}, {"Title": "Great camera", "Author": "\"georgiy\"", "ReviewID": "R1ROAN3D8BCH2W", "Overall": "5.0", "Content": "Pros: Outstanding picture quality, surprisingly low noise level, fast startup time, magnesium body, USB 2.0 PC interface.Cons: power off/on button is located too close to the shutter.", "Date": "March 13, 2004"}, {"Title": "seller flaked, tried to rip me off.", "Author": "O. Mould \"Islander\"", "ReviewID": "R25BJWC2H2ELCS", "Overall": "1.0", "Content": "it might be a good camera -- its from the pre-\"upgrade\" series that nearly every major manufacturer put the hapless consumers through. You can check reviews for Canon, Nikon, Olympus, Panasonic . . . all of them with products in the $120 - $180  price range. In every case the more recent model versions dumbed down one thing or another in the name of \"improvement\" concealing crapware with the marketing glitz of megapixels.Unfortunately I never got the product delivered. Did the seller imagine that I would just shrug off $110 like it was nothing?", "Date": "April 3, 2013"}, {"Title": "it's okay.", "Author": "A. Ganote \"petesbbq\"", "ReviewID": "R1S8ZAKORYOU27", "Overall": "3.0", "Content": "i think it makes things more complicated than they really need to be but it takes great pictures.  also....after purchasing the product, i learned that the camera has to have a proprietary zoom lens that is way more expensive than say, canon.  but other than that i am very happy.", "Date": "January 11, 2007"}, {"Title": "Nikon vs. Minolta vs. Canon vs. Olympus, or d-SLR?", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "RKSY58GD1FPHP", "Overall": "5.0", "Content": "Ok, this isn't one of my usual hands-on reviews.  I ain't got the kind of money to buy all these cameras and test them.  But I wanted to give potential buyers some help...Should you consider an SLR-type EVF (electronic viewfinder) digital camera or an interchangeable-lens digital SLR for serious photography?  I faced this question and agonized over it for months.  I wish I had come across this brief and very helpful article by Popular Photography Magazine (I'm not affiliated with them in any way):[...]The article compares five current-model EVF cameras: Canon PowerShot Pro 1, Konica-Minolta Dimage A2, Nikon Coolpix 8700, Olympus Camedia C-8080, and Sony Cybershot DSC-F828.  It's a very easy read, and at the end the writers give you a helpful checklist for the EVF vs. d-SLR decision.As for myself, I'm going with a d-SLR since I want 1) high-quality lens, 2) lens choices, 3) little to no shutter lag, and 4) accessory choices.  Good luck!", "Date": "December 14, 2004"}, {"Title": "Reaching out to touch the world", "Author": "Shara L. Bouie", "ReviewID": "RMYUYYJJQK06R", "Overall": "5.0", "Content": "Today's bright and sunny, but you have major photos in which you have to take for that over due book or portfilo. The olpmpus C-8080 wide zoom digital camera catches the closest snap shots when you need to get that 200-400 speed shot of a moving animal or that clear visible close-up shot of the models on runway.. Although, it may seem like a timeless task, but with this camera , the photos are taken like a breeze. Also, it is very easy to use ,so no need for that refresher course for visual commications for that new heads up on speed photograpy...<br /><br />So here's to the high life of the world of photography<br /><br />Thank You<br />Shara L. Bouie<br />Atlanta,Ga", "Date": "October 28, 2004"}, {"Title": "Only 5X?", "Author": "\"dbraleigh\"", "ReviewID": "R2GP9DJ16H8RBK", "Overall": "5.0", "Content": "I bought this camera a month ago. so happy with that.This is my first digital camera, so I am not sure I have to authority to compare?Bought this one since all my previous cameras were Olympus and I loved them.However, I am a bit questioning the 5X optical zoom. Since I am new to digicam I am not sure what I am missing here. Can someone please say what is the drawback of having 5X in the C8080 versus the 7X or more in the Nikon Coolpix and Minolta A1/A2?Thanks", "Date": "May 30, 2004"}, {"Title": "Robert F Derenthal", "Author": null, "ReviewID": "R1RNV7WR6VA1SB", "Overall": "5.0", "Content": "If Robert F Derenthal contacts me, I will send him the CD for the 8080.  erroha@bluefrog.com", "Date": "May 28, 2004"}, {"Title": "Movies with audio?", "Author": "C Riley", "ReviewID": "R2QMHDLX1175RE", "Overall": "4.0", "Content": ">shoot short videos (without audio) The odd thing is that the review says \"without audio\" (as above) but the Olympus website says it works with audio as the 5050 etc do.  Any idea why it would say that?", "Date": "March 11, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "8-megapixel sensor captures enough detail to create photo-quality 16-by-22-inch enlargements\n5x optical zoom combines with 3x digital zoom for 15x total zoom\nMovie mode with audio; PictBridge enabled; 1.8-inch articulated LCD display\nStore images on xD or Compact Flash memory cards\nPowered by lithium ion battery (included with charger)", "Name": "Olympus C-8080 8MP Digital Camera with 5x Optical Wide Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51X4XHDTMDL._SY300_.jpg", "ProductID": "B0001DKLHS"}}