{"Reviews": [{"Title": "Great camera", "Author": "David Corentto", "ReviewID": "R32G4OS14XX1LO", "Overall": "5.0", "Content": "I broke the screen on my last one (14 MP) loved that one so much had to buy the same camera but the newer one.  Panorama is so easy takes great pictures and it fits in my pocket.  My favorite thing is the AA batteries, if the batteries die you can get some from anywhere to put in and keep shooting and they last a long time too.", "Date": "July 3, 2013"}, {"Title": "This is a great compact camera. I love it!", "Author": "H. A. King", "ReviewID": "R3MLSL7ADW1A5P", "Overall": "5.0", "Content": "I love my new Fujifilm Finepix AX650 camera. It takes great pictures and it is very easy to use. I have fancier cameras with backlit-CMOS sensors. However, I find that CCD-sensor cameras (like this one) perform much better in bright outdoor lighting conditions (where CMOS cameras can too easily over-expose bright white clouds and windows to look hideously monochrome, flat, and texture-less).  The results of this Fujifilm AX650 camera are very natural and accurate. I tested the camera outdoors and indoors. I took 156 photos (some are posted in Amazon's sample photos page for this product). The overwhelming majority turned out well. Just make sure the subject of the photos is stationary. If one puts the camera on \"Sports\" mode, the camera should be able to capture moving subjects more crisply (I forgot to try that). I left the camera on \"Scene Recognition Auto\" most of the time, and also tried the \"Landscape\" mode for some tree-against-sky scenes, \"Flower\" mode for some photos of close-up flower/plants, and \"Baby\" mode for some of my pet photos. I found that the \"Scene Recognition Auto\" mode worked the best, and it was also the easiest to use. I left many samples on Amazon's sample photo page for this product [Fujifilm AX650].  The camera has many nice features, such as the ability to shoot photos in a wide variety of aspect ratios (4:3, 16:9, 3:2, 1:1) for each level of image resolution (large [12-16 MP range], medium [5-8 MP range], and small [2 MP range]). One can also record any photo in either \"Normal\" (1:8) or \"Fine\" (1:4) image compression ratio for the JPEG files, which is a very nice feature. I always record my photos in the \"Fine\" compression ratio, because the resulting image quality is much better for both print and cropping, since more of the original image data is saved into the JPEG image file.  I think this camera is great for everyday snapshots, and especially for travel snapshots when you are on a whirlwind tour and just want to snap several hundred photos according to your inspiration. With an easy camera like this, you can just set the camera on \"Scene Recognition Auto\", and snap away, focusing more on composition rather than camera settings. The results are great. However, if you want more control over the settings, you can manually select the \"Scene\" mode (such as \"Landscape\", \"Portrait\", \"Sports\", \"Baby\", \"Flower\", \"Night Landscape\", \"Party [Indoor]\", etc). The camera also has the \"P\" mode, or \"Programmed Auto\" mode, where you can adjust the combination of shutter speed/aperture values to your liking.  What differentiates this camera from the rest in its class is the excellent optics of its standard lens (as opposed to the more common wide-angle lens found on most of today's compact cameras). This gives the Fujifilm Finepix AX650 much better performance in three categories of photos: (1) macro photos; (2) portrait-level photos; (3) landscape scenes requiring maximum depth-of-field [the highest f-stop rating on this camera is 14.4 at the telephoto end, compared to f/8 on wide-angle lens cameras]. The result for this camera is much crisper depths for deep landscapes, like sunsets and scenes like at Canyonlands National Park. Wide-angle lenses give more width, sacrificing depth-of-field. Wide-angle lens cameras have their place, like with most (but not all) landscapes and architecture. However, I find that with the Fujifilm Finepix AX650, macro photos and portraits look far more natural, life-like, and pleasing, than the same photos taken with a wide-angle lens camera. This camera complements a wide-angle camera well, and I carry both with me to get the best of both worlds.  The camera can also record video, although CCD-sensor cameras are never a substitute for a dedicated camcorder, if video is very important to you. Whenever I take video with a still photo camera, I set it on VGA, rather than any of the HD-recording modes. The results are always good. Just make sure your displaying device plays the video in its actual resolution, rather than full screen. For still photos, this camera is excellent, in any resolution!  I also like that this camera uses AA batteries, because they are always easy to find. You can also use rechargeable AA batteries. I think AA-battery cameras have more longevity, because you never have to worry about proprietary batteries no longer being available down the road.  This camera has more features relative to other cameras in this price range (I got it for well under $100). It is a very good deal. I have always heard about the superior optics of Fujifilm lenses, and the performance of this camera corroborates that view.  I am very pleased with this camera. I will probably buy another one of these just as a back-up camera for my purse (so I can leave this one at home for everyday snapshots of home life). I definitely recommend this camera to anyone wanting a well-performing, simple to use, lightweight, portable camera that just happens to be very affordable. I will also further consider buying higher-end Fujifilm cameras now that I have tested this one and found its performance very satisfactory.", "Date": "November 4, 2013"}, {"Title": "It's OK for the price-See my follow-up opinion", "Author": "Leenaud \"leenaud\"", "ReviewID": "R210USVIWK62XN", "Overall": "5.0", "Content": "Pros: Pictures in different modes come out really well.  Camera is compact and light. Easy to carry in pocketCons: Camera shuts down when it thinks the batteries (alkaline) are drained.  I removed the batteries and put them in another AA Panasonic camera and was able to take quite a bit more pictures.  So what's being gained with the compactness and weight of the camera is lost with the amount of batteries one will need  to have on hand.Additional observations: When  Alkaline batteries are depleted down to about 1.37 volt the camera will shut down, which in my opinion is a big draw back. Also when taking pictures with a SD card used in another camera an additional directory will be created (XXX_FUJI) when taking pictures, but some pictures won't be written to the folder,even though it shows the picture for a second or so after it has been taken. No error message or anything.1-19-2014 Spoke with CS at FJ and explained the battery problem. They did not get into the problem itself nor did they address my question what an average amount of pictures a set of Alkaline batteries would be able to handle. They told me to return the camera.I had that already planned thru Amazon. Got the replacement back within a couple of days. Inserted the same batteries the previous camera rejected and I'm still taking pictures with it. So I'm a happy camper and therefore change my stars from 3 to 5. I also had no problem with storing pictures on a already used SD by another device.", "Date": "January 7, 2014"}, {"Title": "This a great camera", "Author": "Alex", "ReviewID": "R39HFW216AOUZB", "Overall": "5.0", "Content": "I got this camera B/c I had a fuji and it broke ( got 10 years out this camera it fell  off my desk and broke) so I went with another fuji. I always trusted Fuji film for my slr cameras and now their digital cameras are great.Reliable , easy to operate, I love the macro function. and many different file sizes to chose from also great small size and the cost was what i like too. This camera does NOT come with a sd card.", "Date": "August 9, 2013"}, {"Title": "Great little camera!", "Author": "Kathryn Susan \"centexkat\"", "ReviewID": "R1Q62LRBHEDNB", "Overall": "5.0", "Content": "Clean, sharp photos.  Easy to use right out of the box.  Highly recommend. Used it on vacation recently and all shot were great.  Panoramic looks great.  Easy to hold, self-timer is fun to use.", "Date": "October 11, 2013"}, {"Title": "Excellent small camera", "Author": "KSArnold", "ReviewID": "R3SGPIKTFG0E66", "Overall": "5.0", "Content": "These Fuji cameras are great for panorama pictures.  I found this one at a good price so I got it for a back up camera.  For regular shots this camera is good but the panorama pictures make it stand out from the crowd.", "Date": "December 24, 2013"}, {"Title": "great little AA camera!", "Author": "GT68", "ReviewID": "R3UMOIXR1PKNY3", "Overall": "4.0", "Content": "get a super fast card and this baby does the trick.  very hard to find a small AA camera with this kind of zoom and this kind of speed.  low light focus/performance is meh......but overall, for the price.  love it.  oh also, you have to set it to alkaline for battery type even though I use NMH otherwise it will shut off prematurely -my only complaint", "Date": "December 1, 2013"}, {"Title": "Pretty good camera", "Author": "John Horrocks", "ReviewID": "RQSVR2E5RZ7GI", "Overall": "4.0", "Content": "I've been using it at work everyday for a little over a month. One in about 5-10 photos are out of focus no matter how careful I am but all in all it's a good little camera.", "Date": "October 26, 2013"}, {"Title": "best product than ever", "Author": "Onh Tron", "ReviewID": "R3MYGYP0R9RR2H", "Overall": "5.0", "Content": "I absolutely love this camera!!! It has good pic resolution and easy to use.Furthermore, the price is good enough...", "Date": "September 21, 2013"}, {"Title": "Exceptionally Pleased", "Author": "Nat Bo", "ReviewID": "RAV8VKODGI2VH", "Overall": "5.0", "Content": "Got to say that I'm exceptionally pleased with the quality of this camera and the pictures it produces given that it is an inexpensive camera. The picture quality is really extraordinary. It was easy to get started and take a few pictures. Using cheap regular batteries instead of expensive-to-replace batteries is another big plus. The included instruction book is minimal and confusing, but I'm sure I'll be able to figure out the more complicated features. Overall, this camera is an exceptional value for anyone just wanting a basic point-and-shoot digital camera.", "Date": "September 2, 2013"}, {"Title": "Decent compact digital camera", "Author": "Stormy1", "ReviewID": "RWEKR1D5Y7Y2Q", "Overall": "4.0", "Content": "I have had a variety of similar Fuji digital cameras starting with the AX-300 4 years ago and got most of them here since they are fairly cheap, took decent photos and overall fairly easy to use. I recently got one of these Fuji AX-650 compact digital cameras to replace an older Canon compact digital camera that kicked the bucket a month ago.This camera looks identical to the past Fuji compact digital cameras and seems to take just as nice photos like those older Fuji digital cameras I had before.Good points with this camera so far: easy to use, simple menu, 5X optical zoom for some zoom power when needed, decent-sized LCD view-finder screen, uses the common SD photo card, very good video quality and decent photo quality for basic general photos.Bad points so far with this camera seems to be just a couple of items: some shutter lag, battery life is short with 2 \"AA\" batteries and no optical view finder.Indoor photos and generally outdoor photos are quite good with this camera. It's fairly easy to use and good for those that needs a digital camera on the go for work or whatever. I gave this camera 4 of 5 stars.", "Date": "April 20, 2014"}, {"Title": "Great camera to take anywhere!", "Author": "bmitchell", "ReviewID": "R2PIOAMQZ59LRQ", "Overall": "5.0", "Content": "This camera takes great pictures.  Easy to use and fits just about anywhere.  Would recommend it to anyone who is looking for a new camera.", "Date": "December 19, 2013"}, {"Title": "Great Camera!", "Author": "Mark Twain", "ReviewID": "R38J0YR5R0RTON", "Overall": "5.0", "Content": "This camera has a zillion different modes you can set it on. It is pretty small so I can take it everywhere. It is super easy to download pictures on to the computer with the cool icon you can download. The flash works really well. I love this camera and it is a great deal.", "Date": "December 19, 2013"}, {"Title": "Beautiful", "Author": "George", "ReviewID": "R1HRRU19BMN3X9", "Overall": "5.0", "Content": "Very nice camera, takes great pictures. Easy to use. Easy to carry, fits in a small pocket. Very happy with this camera !!", "Date": "November 12, 2013"}, {"Title": "Limited use for supposedly versatile camera", "Author": "Edward Meiman \"ME backwards\"", "ReviewID": "R2SRILB01VL0OW", "Overall": "2.0", "Content": "Good for still photos.  Lousy for shots where person is in motion (even in Sports mode).  Delay between button press and actual shot is at least a second, maybe two.  Buy something else unless (like me) you are strapped for cash.", "Date": "November 2, 2013"}, {"Title": "Lense quit retracting - on two different cameras!", "Author": "Amy Hoptowit", "ReviewID": "R1999WDAYYN8LR", "Overall": "2.0", "Content": "My first camera was a finepix (but a the model before they put the video recording option into it). It served me well for a few years, but I took it to the beach and it stopped retracting the lens. I bought this model thinking that I got sand into the last one. I have only used this one a few times and It just quit retracting as well (with a slight grinding noise when turning on). I have taken excellent care of this one, so I am very disappointed that it quit working.", "Date": "March 22, 2014"}, {"Title": "Battery doesn't last long", "Author": "J", "ReviewID": "R2AL1YD2K5530C", "Overall": "3.0", "Content": "It's an ok camera for the price, takes good quality pictures and videos. I use it a few times a week. The battery life lasts about 50 pictures and literally 5 videos that are 10 minutes long. I have to replace a battery every month. I had Nikon camera before and hated to charge the battery and was excited about this camera that takes A4 batteries. But should I have known I will have to buy batteries all the time I'd look for a better camera (maybe more expensive but at least save on batteries in a long run).", "Date": "March 10, 2014"}, {"Title": "Fujifilm AX650 Excellent Quality", "Author": "Arbee", "ReviewID": "R2OCNOLFXJQ2XP", "Overall": "4.0", "Content": "Little more complicated to use than the Nikon we had but the quality of the photographs are worth it. Pics are great when posted on Social Sites. Video also works as well as hoped.", "Date": "February 5, 2014"}, {"Title": "I love this camera!", "Author": "Jo AnneTitchen \"Jo A\"", "ReviewID": "R1V4SLODOFKN4C", "Overall": "5.0", "Content": "This is my go-to camera.  I carry it with me every day.  The pictures are great.  You can set it up to take natural and flash pictures and then you decide which to keep.  It's a great little camera.", "Date": "November 6, 2013"}, {"Title": "Pleasantly surprised by this inexpensive camera", "Author": "Stephen Dupre", "ReviewID": "R2WI7ID59S91NB", "Overall": "4.0", "Content": "This camera replaced some Canon A490's that got old.  Bought 2 for a trip.For the price, you can't beat this point and shoot.  It allows for 3 different types of batteries (setting inside the camera), but seems to work best on the cheapo alkalines.Pros- AA Batteries.  2 sets lasted 600+ pictures using flash minimally and minimal video.  (Ray-O-Vac $6/4 batteries)- easy in the hand- takes good pictures in good lightingThough people have complained about fuzzy pictures, I think with default auto settings, this camera is pretty forgiving.  Put a good Class 10 8GB memory card and you won't have to worry about lag too much.Cons- Video mode takes a few more menu clicks (vs having a dedicated red \"record\" button)- Would prefer a Canon-style external dial for changing modes vs the screen menu (hard to see in direct sunlight)This is not an expensive camera, but if you're looking for one with AA battery convenience, look no further.  Buy a bunch of Ray-O-Vac's on sale and keep them handy and your chance of fun photo taking experiences will increase.", "Date": "May 10, 2014"}, {"Title": "Takes Good Pictures -- and Uses AA Batteries!", "Author": "Elisa 20", "ReviewID": "R1PNEBDVSQNN2W", "Overall": "4.0", "Content": "I have a Fuji X-S1 which is a great all purpose camera (24mm--624mm fixed zoom lens). But although its a lot more convenient than a DSLR, it's still kind of bulky and I often don't have it with me when I want to take a picture of something. Also, I've noticed that people are less cooperative when you're pointing a big camera at them than when you point something small and unobtrusive.I'm wnjoyinf this little camera for what it is and what it does in this price range. First, it is light and easy to put in my purse or a pocket. It has settings options, but I go through all that with my other camera. For this one, I keep it on P or SR AUTO (it chooses the best setting for the situation--including Macro and low light) and seems to do a very good job. (I keep the flash off, but ISO at 3200 seems to work fine in most situations).If you put it on \"P\" mode you can change a couple of settings more than in SR AUTO. For example, you can add \"Digital Zoom\" which seems to double the zoom (basically magnifying and cropping your optical zoom image, but it does a good job with that).However, as I said, I think SR AUTO is fine and it lets me concentrate on just taking the photo, not worrying about any decisions on the settings. (The flash, when I used it, was fine, but I'm just not a fan of that kind of lighting unless absolutely necessary). Low light pictures have been pretty good (with flash or one of the \"night\" settings--there are several). The photos are very clear at 4 x 6 size and on the web, some detail gets lost on the larger sizes -- I'm still experimenting though (and macro works best at wide angle setting).For some people, not having an optical viewfinder will be a drawback, but the LCD screen on the back is a good size and I haven't had any problem with it so far.There's a hole for a tripod, but I usually use the \"2 sec\" timer and hold the camera steady. I really, really like it that it takes 2 AA batteries (I got NIMH batteries and a charger, too, but the batteries that came with the camera seem to last much longer than I expected. The advice somewhere online was to keep the menu choice on \"alkaline\" even if you use NIMH, so that's what I plan to do). No problem transferring to the computer with the USB cord (I usually use a memory card reader but with the card and battery together, it's actually easier to just transfer with the USB).For $60 this was quite a bargain, I think. I've been really impressed by the quality of pictures and how fun and convenient it is to use--plus having AA batteries which you can hardly find in a camera any more.  Very handy camera.", "Date": "May 5, 2014"}, {"Title": "Nice camera", "Author": "sadiejane", "ReviewID": "R1IE5SV6NFI2LI", "Overall": "5.0", "Content": "I bought this camera to use when I travel.  I do not print photos;  I upload to a website.  I am pleasantly surprised with this camera for such an inexpensive camera.  I wanted a camera that uses AA batteries so I don't have to use power converters to charge a battery.  I was concerned about not having a view finder, but the display window is large so that has not been a problem.  The camera is lightweight and will fit in a pocket or purse.  The shutter speed is fast.  I'm very pleased with this purchase.  This camera compares to or exceeds the features on the last camera I purchased that cost 3 times more than this one.", "Date": "April 4, 2014"}, {"Title": "Narcisistic camera has a mind of its own", "Author": "Barry A&P", "ReviewID": "R2MI38BES55CCX", "Overall": "1.0", "Content": "This battery hungry camera constantly beeps for attention and gets especially lonely in the middle of the night.I purchased the Finepix camera for my wife before christmas the camera was actually given to her on her birthday Mid Jan.  2 or three days later we put batteries in it and began to use it. a few days later it began beeping at 3 am that it had dead batteries, we replaced the batteries and a few days later again at 2 or 3 am it began beeping to let us know the lens was open. we took the batteries out for a while and began using the camera again a week ago. it seems to have a mind of its own turns itself on and off whenever it wants and if you leave the batteries in it some alarm at some inopertune time is guaranteed to go off. of course like other reviewers i only had use of the camera for about a week before it was un returnable.", "Date": "March 9, 2014"}, {"Title": "fujifilm FinePix  AX650", "Author": "Anne Martino", "ReviewID": "R22Q8QZUM3HFF", "Overall": "5.0", "Content": "Love it!  Compact, easy to use, great zoom!  Stick in your pocket and take a hike..  fall colors are beautiful now in NE.", "Date": "October 3, 2013"}, {"Title": "Easy to use", "Author": "Robert A. Meyer", "ReviewID": "R31I0P5PCERSS6", "Overall": "4.0", "Content": "Very nice camera,,only problem I found was I forgot to format  Flash Memory card and  couln't  take  any pictures,,,After that everything went smoothly.", "Date": "August 16, 2013"}, {"Title": "Cheaply Made Camera", "Author": "POLICE MILLENIA", "ReviewID": "R3JIKSIZYVGTII", "Overall": "1.0", "Content": "First, the weight of this camera compared to other cameras, this feels like a kids toy. Besides that I used the new batteries AA and after 30 photos my batteries were dead. I put new batteries in and within the day and about 20 more photos those batteries were dead too. It has good reviews but you should check for other cameras really. This camera works and feels like the cheapest camera produced in China. shop for another make, model, seriously.", "Date": "March 1, 2014"}, {"Title": "Fuzzy images", "Author": "J. Freeman", "ReviewID": "R2QWR1ZFKG1NME", "Overall": "2.0", "Content": "No matter what settings I change or how steady my hands are these pictures barely look like they could be at the lowest resolution setting even when put to the highest quality. I'm at a loss at this point as to what else I might do that could improve this, but ultimately I think this camera is likely just terrible. It seems like my cell phone camera is better quality. I've read and reread the manual and even tried to see if anything online might provide a clue as to why the quality is so horrible but I am coming to the point of believing that it's just a really terrible camera.", "Date": "May 27, 2014"}, {"Title": "Fujifilm FinePix AX650", "Author": "Cheryl Hastie", "ReviewID": "RKNELJR11F85T", "Overall": "4.0", "Content": "My last camera was a Fuji 3800, I wanted something smaller, that still had zoom and movie. This works great for me. And the case I bought, Case Logic DCB-302 Compact Case for Camera, is a perfect fit for this camera. Downloading the pictures to my laptop is very easy as well.I haven't used all the features yet, but so far I really like this camera. I read a lot of reviews on other cameras before going with the Fuji again. It's a great camera for the price.", "Date": "May 25, 2014"}, {"Title": "super little camera", "Author": "J. Nelson", "ReviewID": "R2SE3GP0WR4ZRG", "Overall": "5.0", "Content": "I have one, and both daughters have them all were gifts and dont need anything better, dont overspend on unnecessary bells and whistles", "Date": "May 18, 2014"}, {"Title": "I do love it, really...", "Author": "Steven J. Torrey", "ReviewID": "R2GAM9I915I77A", "Overall": "5.0", "Content": "But I had a Sony CyberShot which came with a rechargable battery.  A battery good for a couple day's usage--maybe 80 -100 + pics.  Plus the Sony Cybershot was easy to switch from stillphoto to movie mode.  A plus when filming street scenes such as street fairs, etc...  The Fujifilm AX seems to chew upit two AA batteries a little too quckly.  The Fujifilm AX seems more complicated to operate, the learning curve seemed higher than the Sony CyberShot.  Truth to tell, the battery makes the big difference.  No matter the camera--the batter is likely to go dead long before an 8 Gb card is filled up.  When filming an all day street fair, several cameras may be requried because of limited battery capacity.  For simplicity of operation, for flexibility, for its rechargable battery, for ease in shifting from still to movie mode, the Sony CyberShot would win hands down.  The Fujifilm has a good heft, takes great pictures--the two drawbacks:  AA batteries wear out to quckly demanding constant replacement and moving from still to movie mode is too complicated--especially when using a camera in such a fluid environment as a street fair where quickness becomes crucial.", "Date": "May 10, 2014"}, {"Title": "Fujifilm FinePix AX650", "Author": "BIGFOOTDWR", "ReviewID": "R2U402OF8TJM81", "Overall": "5.0", "Content": "Nice little camera. So far pictures look very nice and sharp. I use on auto, don't really fool around with other settings, so it's a easy camera to use. Will fit easily in any pocket.", "Date": "March 15, 2014"}, {"Title": "Great camera for the price", "Author": "William Bradley", "ReviewID": "R1HZYM4CCIVQN0", "Overall": "5.0", "Content": "Camera is easy to use and pictures are beautiful.I had no problem with using a pre-formated SD card from another camera for both video and pictures.Menus are easy and self explanatory. The macro feature is the best i've seen on a budget camera. They compare very favorably with those I took with my SLR using custom lenses.Battery life is good too, but be sure to tell the camera what type you are using as this will affect the shooting time.", "Date": "February 27, 2014"}, {"Title": "Great For Backpacking With Less Weight", "Author": "Boatman", "ReviewID": "R2KUY8NBT5C1QG", "Overall": "5.0", "Content": "~I have not had the opportunity for taking photos yet with this camera, but it looks great and is the lightest camera I have ever owned.It is compact, and weighs less than half of my other \"point n' shoot\" cameras and extremely light compared to my Nikon D90.As soon as I get the opportunity to use it in the next few weeks, I will re-post an update.By the way, this camera's description does NOT contain ANY information regarding weight if you are interested.I weighed it with my hanging baggage scale and it is exactly 4.3 ounces [ quantitative value ] alone but in the box with attachment and CD, it weighed a total of 12.9 ounces [ including the box itself ].So, if you only carry the camera [ and not the box and it's other contents ] you will be carrying a very lightweight [ qualitative value ] with you on your hike.The other factor that swayed me to purchase this camera is the positive feedback from professionals who use it everyday for work.Way to go Amazing-zon!!~", "Date": "February 15, 2014"}, {"Title": "CD", "Author": "Diana Kistner", "ReviewID": "R3RTQMF5OE5MQ1", "Overall": "4.0", "Content": "The camera is fine, easy to set up and use, haven't learned all it can do yet. My only complaint is the CD program that came with it seems to be infected. As soon as I tried to down load program to my computer a virus warning came up and my computer anti virus went into action. I took out the CD and tried to reinstall it and the same thing happened, so needless to say I have no idea what is on that CD and can't use it. So if you buy this camera be aware of the CD that comes with it.", "Date": "May 16, 2014"}, {"Title": "Battery Recommendations", "Author": "Randall D.", "ReviewID": "RJNX72QAW2QVO", "Overall": "5.0", "Content": "After putzing with many cameras over the years, my best advice is to use good batteries.  Do not use regular cheap alkaline, do not use low-voltage wussy rechargeables, use Energizer Ultimate Lithiums.  They work.  (no, I don't work for Energizer)", "Date": "May 15, 2014"}, {"Title": "great  camera", "Author": "tom scriven", "ReviewID": "RA4O7RKFR768Q", "Overall": "5.0", "Content": "replaces an older Fuji camera, most functions the same, nice feature that takes standard batteries, don't need a specific charger for special battery.", "Date": "May 10, 2014"}, {"Title": "This is the best i have", "Author": "Ayub shaik", "ReviewID": "R3Q1H6PGLJK175", "Overall": "5.0", "Content": "I love this product,i carry it with me where ever i go.I would recommend this to everybody to have one.", "Date": "May 24, 2013"}, {"Title": "Pictures not as crisp as I hoped", "Author": "muffiemae", "ReviewID": "R3VR2C7AKG39AW", "Overall": "3.0", "Content": "Some pictures seem a little fuzzy, like they have been taken with a gauzy filter. I haven't had the camera for long. I've now increased the picture setting so I hope that will help.Edit on February 4th, 2014 - I am in Panama and this camera was shipped to my mail forwarding address in Miami. The camera was shipped on December 30th. I received it on January 13th. Yesterday, on January 3rd, it completely quit working. I logged in to Amazon to return it--and received the message that my right to return expired on FEBRUARY 2nd. How's that for timing?Anyway, my experience with this camera is that it is a piece of junk. And not only did I pay for the camera, I also paid about $20 to get it to Panama. DO NOT BUY THIS CAMERA BECAUSE OF ITS VERY LIMITED WARRANTY!Update on February 4th - I called Amazon, and they are allowing me to return the camera for a refund after I explained the situation to them. Amazon rocks!", "Date": "January 26, 2014"}, {"Title": "Christmas Gift", "Author": "Keithmarine", "ReviewID": "R3KJY2O9AMNYT7", "Overall": "5.0", "Content": "I purchased this camera for my 11-yearold grandsons. He is beginning to use this camera for school projects and personal use.  He was happy to receive this camera for a Christmas present.", "Date": "January 8, 2014"}], "ProductInfo": {"Price": "$89.95", "Features": "2.7-inch TFT color LCD monitor\n16 million effective pixels 1/2.3-inch CCD image sensor with primary color filter\nFujinon 5x optical zoom lens with approx. 7.2x digital zoom (up to approx. 36x with 5x optical zoom)\nFocal Length: f/5.9mm-29.5mm; Full Aperture: f/3.3 (Wide), f/5.9 (Telephoto)\nHD movie (1280 x 720p/30fps)", "Name": "Fujifilm FinePix AX650 16MP Digital Camera with 2.7-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/511G3ggXPFL._SY300_.jpg", "ProductID": "B000P6I4XO"}}