{"Reviews": [{"Title": "Love this Lock", "Author": "Sonya Hamilton \"Cats Rule\"", "ReviewID": "R1QA65JM9ZC93T", "Overall": "4.0", "Content": "We really do love this new remote door knob, and locking system. It took a little convincing before ordering for my husband, but now that it is installed he loves it too. Our existing door knob was about 20 years old. It was kind of loose, and the key would stick in the lock. I thought since we were replacing it, why not do something cool with a remote, since we love the remote for our cars. To be honest, the directions were not great, but if you just look at the previous lock mechanism carefully you will figure it out pretty quick. We did the entire take off of old, and reinstall of new in about 1/2 hour. That is amazing for us. It usually takes us much longer for the do it yourself stuff that should be \"easy\". It works great, just like advertised. It does come with keys as well if you ever should need them. We love using the remote. I will say it seems to lock quicker, than it unlocks. It seems as though you have to be pretty close, and point directly to unlock. The locking seems much quicker. Our overall view of it is GREAT. We have said since installing over & over how much we like it. It is also attractive, and no drilling of holes was needed for replacing which we really were happy about. We did not want to damage the door. If you should try it, I think you will be very pleased.Catsrule, Ruckersville VA", "Date": "February 16, 2009"}, {"Title": "Very solid, definitly not a cheaply made peice of junk", "Author": "Edward Hollander", "ReviewID": "R25D7KHSD6PBHY", "Overall": "5.0", "Content": "the knob feels very very solid, like the ones in hospitals or governments buildings. The ones you buy in a hardware store or home depot feel finicky and cheap compared to this (unless you get a name brand like weiser or kwikset) Also since it's RF and not IR (Infrared) there is no line of site required and works a good distance away (at least 50ft)I'm very satisfied.", "Date": "June 23, 2007"}, {"Title": "great product", "Author": "CreativeCreature", "ReviewID": "R2YLNXTTDAI3OT", "Overall": "5.0", "Content": "I bought this product so I would not have to go downstairs to open a door for guests to come by. It works great. I love the remote and the distance I can press the button and the door unlocks. Love it!", "Date": "September 28, 2007"}, {"Title": "Excellent product", "Author": "William P. Dulmaine", "ReviewID": "R128BRR85878MJ", "Overall": "5.0", "Content": "I installed this lock today in about 20 minutes. The lock itself is very well builtand very heavy. The QuikSet lock it replaced looks like a piece of junk beside this one.Programming is the simplest you will ever see. Just push two buttons and you are done.I bought this because I'm always having to put down the groceries when I get homein order to fish out my keys. Now I just push a button before I even leave the car.Also,I keep the second fob up on my nightstand in case I ever need 911 assistance.Without this, 911 would have had to break my door down to get into the house.  I amtotally delighted with this product in all ways.", "Date": "January 26, 2012"}, {"Title": "Good product, excellent customer service!", "Author": "BigDT", "ReviewID": "R3M1SGAOGJP6C6", "Overall": "5.0", "Content": "I actually owned 2 of the infrared version of this deadbolt lock and I owned it for more than 4 years now.  The quality of the product is good and very easy to use, but the customer service is just wonderful!  Last night I had a problem with one of my lock after 4 years of daily use, so I contacted Morning Industry to see if their 25 years warranty is any good.  Long story short, I talked to Mathew and went down to their office.  Within 10 minutes, I was out with a brand new back section of the lock and I did not even have to show my receipt to them.", "Date": "January 3, 2007"}, {"Title": "Locks did not work...", "Author": "NCF", "ReviewID": "R1O03Y89T6767M", "Overall": "2.0", "Content": "I've bought the levers before and they've worked great.  Bought three of these knobs and for whatever reason, all three of them didn't work when we received them.  On one of them, the manual lock on the front was broken out of the package.  On the other two, the locking mechanism inside sticks.  About every third time you try to open it, the light is green but the knob won't turn at all, and greasing it didn't help either.  We called the company and they sent replacement parts, so hopefully they work now!", "Date": "February 14, 2011"}, {"Title": "excellent product", "Author": "R. Fox", "ReviewID": "R2LCAH2D6L6DDG", "Overall": "5.0", "Content": "This product was the perfect solution for my disabled mother.  This allowed her to feel more secure in her apartment.  In fact, the building management was so impressed with the product that the corporation has installed several of them for other disabled residents.  The installation was easy and the device works anywhere within 30 feet.  Mom keep her \"clicker\" on a lanyard along with her \"lifeline\" alert.  Having this doorknob has made Mom's life much easier and more secure.", "Date": "May 22, 2010"}, {"Title": "Morning Industry RKK-01P Radio Frequency Remote Door Knob, Polished Brass", "Author": "Robert Holthaus", "ReviewID": "R3U03EHSTG6G9P", "Overall": "5.0", "Content": "This is an excellent product. I installed it near the end of December. It works flawlessly.my wife is disabled. She operates the lock by remote from 15 feet away out of line of site. The lock came with 2 remote controls. Installation was easy and this is a well built lock.", "Date": "February 9, 2010"}, {"Title": "Love this lock!", "Author": "Anna Louise", "ReviewID": "R1HNNFC5K8KRAV", "Overall": "5.0", "Content": "This knob looks great, works perfectly, and was easy for my son to install.  I have arthritic hands, and this product saves me pain at least six times a day.  Moreover, it works from as far away as my bedroom (well out of line of sight), so if I wonder if I've left the front door unlocked I can lazily click its clicker, and hear the reassuring small zzzz of the lock sliding closed.  Does exactly what it says it will, and does it well.  Who could ask for more?", "Date": "May 30, 2010"}, {"Title": "Nobody can get in from the outside", "Author": "Stephanie", "ReviewID": "R1PAD0N8BKHHQB", "Overall": "1.0", "Content": "Well, if you don't want anyone to get in from the outside, this lock is for you!  Even when the door is unlocked, you can only open it from the inside.  I have had two major problems, that started out to happen randomly, and now happen every time I try to open the door.  At first the handle would not turn from the outside even when it was unlocked.  If opened from the inside, I could not duplicate it.  My husband thought I was crazy because he would let me in and then the problem would be gone once the knob was turned from the inside.  (He now believes me as it has happened to him.)  Then the knob decided it would turn, but wouldn't catch the latch.  That is now the problem I have every time I try to get in my house through that door.  I have only had this knob installed for about a week, so it was obvious from the start that it was defective.  If it worked correctly, I imagine it would be a great door knob, as many people are very happy with it.  I, however, got the dud and will not be purchasing another lock from this company again.  I am thankful that I purchased through Amazon because their return policy makes this mistake easy to fix!One other thing... Even if this knob had worked the way it is supposed to, I don't care for the way it looks.  In the picture, it appears to be a normal looking handle, but it actually sticks out quite far.  And the inside has a very large thing attached to it (for batteries and mechanical type things I imagine), that makes it not very attractive.  I have posted a side angle shot so you can see exactly how large this is.", "Date": "February 12, 2013"}, {"Title": "Great Door Knob", "Author": "Paulc", "ReviewID": "RDXKGPJA6ZKRM", "Overall": "5.0", "Content": "This doorknob works fantastic. Very simple installation. Only took about 15 minutes and fits perfectly where the existing door knob was. I can lock/unlock from my car which is about 20' from the door. Really comes in handy if you have an armload of groceries or when it's raining. I was a little skeptical buying this, as the price was very good. Glad I did, because this is an outstanding value.", "Date": "October 22, 2012"}, {"Title": "Awesome product", "Author": "Chris Karapetsas", "ReviewID": "RDBXE5Y98W675", "Overall": "5.0", "Content": "Great product! Gimmiky but I love it!Nice looking, all the parts are sturdy, works great. The remote control aspects work as good as I would ever want. You know the item is working as you can hear the lock turning in addition to a beep. I don't have any real problems with range either. Obviously it probably won't work if your too far away but you shouldn't be away from hearing distance when using the remote.I would buy this item again if I choose to purchase another in the future.", "Date": "August 20, 2012"}, {"Title": "You're gonna love it!", "Author": "caveman", "ReviewID": "R1OA1EYDJY0JPM", "Overall": "4.0", "Content": "My wife uses this to open the door to visitors and after 9 months I can honestly say it works great.It has not been the AA battery hog that I thought it would be.  So far I've replaced the batteries one time.To me it was easy to install.  The instructions are mostly pictures.  You'll notice the sentences were 'translated' but you can still understand it.  Use the company's website for additional info.Keep in mind the green and red lights are more like green and red covers over diodes.  More visible at night.  Hard to see during the day.  At least there is a distinct (though not loud) sound of movement as the door is unlocked.  Of course, we had to show our visitors the sound it makes so they would know that the door was unlocked for them to enter.  No, the door doesn't pop open. It just unlocks so someone can turn the knob to open the door.The 'footprint' of this door knob is smaller than the door knob that it replaced - maybe a sixteenth of an inch.Still it is well made and I have been really pleased with it.", "Date": "December 30, 2011"}, {"Title": "Works Great", "Author": "diemaker", "ReviewID": "RA3JPRCSFG351", "Overall": "5.0", "Content": "Fast delivery time. The door knob was easy to install.Fit the standard door knob holes no drilling of fitting. Looks really great and works from my driveway about 15 feet away.Took about 15 minutes to install.", "Date": "December 13, 2011"}, {"Title": "Works like a charm - and saved me $400!", "Author": "Joseph Kline, Jr. PhD, MD, MBA \"patriot\"", "ReviewID": "R1YDB2OSEL8O9A", "Overall": "5.0", "Content": "In my new office, the restroom is not accessible directly from the waiting room.  If I put a lock on the door, then my wife would have to get up from her desk to let a patient into the inner sanctum each time.  I called a security company about installing one of those electronic locks and was told the price would be $600.  Geeze.  So, I next got online and searched Amazon.  I found this lock.  It looked like it would do the job.  And IT DOES!The directions for installation are not the best, but they include several methods of customer support.  Fortunately, I'm the son of a builder and had spent part of my youth installing non-electronic locks in homes.  This was almost a breeze, and I had it on in less than 20 minutes.  The two remotes work just fine.  Unfortunately, my office is further away, and I the remote doesn't work.  I wasn't sure why.  My office is only about 10 feet further away.  After some experimenting, I discovered that if I pointed the back of the remote at the door, it does work.  Hmmm.The lock can be set to relock automatically after about 10 seconds.  This gives time for a patient to get into the hallway.  Nice feature.  My wife loves it.I called the company before I ordered the lock to ask a couple of questions.  They were very helpful.The only suggestion I have would be to have a keyless entry with push buttons so you didn't have to carry the remote control around with you.  As it is, you must use a key.  Other than that, this lock is perfect!  And you save hundreds of bucks!", "Date": "April 28, 2011"}, {"Title": "DO NOT BUY THIS PRODUCT", "Author": "Phil", "ReviewID": "R1AHIZ9080DZ3E", "Overall": "1.0", "Content": "When we first received this product the door would not unlock with the remote. I called Morning Industry, did some troubleshooting and they said they would send me a new rear assembly. In the meantime we used the key, for about a week.  When I went to unlock the door with the key the tumbler came out with the key. After collecting the springs and individual tumblers off the ground I called Morning Industry again and let them know what happened. A couple weeks later I received new front and rear assemblies and the doorknob worked properly, for about 3 months. We only ever used the remotes till we went on a weekend trip and the in-laws stopped at house. When they went to unlock the door the tumbler again came out. One issue resolved is completely fine, two I can live with, but for the three issues with a doorknob that doesn't allow me to unlock my door is unacceptable. I would not recommend this product to anyone till they fix the issue with the tumbler.", "Date": "October 20, 2012"}, {"Title": "Disappointing", "Author": "D. Halecky \"Diane H.\"", "ReviewID": "R2JDIH1T3VB7QZ", "Overall": "1.0", "Content": "I bought this item for a couple of reasons:  1. my mother is less mobile that she used to be and it's easier for her to push the button to open the door, rather than fumble with a key while using her walker.  2.  When I am loaded down with packages and a sleeping child, I can just press the button and gain entry.Unfortunately, while using the key (the battery had died in the remote) yesterday, the entire cylinder came out and the pins flew everywhere.  I would assume the product is under warranty and I will look into that, and thankfully we had the old door knob handy, so we switched it out.It didn't even last 6 months.  Very, very disappointing.", "Date": "June 11, 2012"}, {"Title": "I love this awesome feature", "Author": "Boopie", "ReviewID": "R1CC7U3DKGUO9S", "Overall": "4.0", "Content": "This was an excellent purchase 3 years ago. I bought with the dead bolt. Both worked with he remote. In three years I have had to use the key only twice,I was gone for two months and batteries had not been changed in 9 months. (I use low discharge hybrid AAs: eneloop, Duracell hybrids, now imedion). The other time the remote battery died. I switched remotes as I had back ups already set and changed the battery (2016 lithium) myself later. Overall, I just l love these locks. I purchased two more of the knob versions and dead bolt for my elderly mom's house. She has suffient remotes (two for each purchase) to provide all of her kids. Plus, I set my remotes from my house to work on her house. One remote will work on all of these locks. Thus. One can place at their home, office, garage, guest house etc., The only reason I am taking off one star is that when I ordered her locks just recently, one of them arrived not fully functional. I only realize this because I had these locks previously and ordered two of the knob versions this time. One of the knob versions, brand new. Was received by me in a ratty, torn, weathered and dented box, which made it appear as if it was a return, that  was the one that did not work properly. although the interior of the package was sealed. The Amazon return could  not have been easier. Before they had even received the return back they sent out a replacement. Excellent service from amazon. The replacement works and arrived just two days later. My mother and family members are happy that we all have access to my elderly mom's house and can still check on her, she also likes the convenience of not having to get up to answer her door. She can let visitors in and out without getting up. She is elderly so we installed 8 security cameras on the exterior, so she knows exactly who is on her property before they reach the door and can allow entry without getting up or maintain her security and keep the locks closed.", "Date": "September 15, 2013"}, {"Title": "Frustrated with knob", "Author": "Brian Off", "ReviewID": "RDIEKJAHF5XDS", "Overall": "2.0", "Content": "I am frustrated with this knob, I think it's a great idea but it don't always work. I am not sure i will keep this knob or not at this point.", "Date": "March 8, 2013"}, {"Title": "quality control", "Author": "J. Defruscio", "ReviewID": "R1S1JQULUBX05T", "Overall": "3.0", "Content": "well on my second one, when i received the second one i noticed compared to the original the mounting bars for the keyed knob were little over a 1/4 inch shorter on the replacement.  so when i put the new one in it was much more snug which was good.  Amazon as always was very helpful and sent the replacement right away which is always a plus.  So far the new one is working but i'm still leery of it at this point.  When you lock it via the remote it seems to twist the lock farther then you could manually or with the key, and if you don't unlock it with the remote after it almost feels stuck and you need to twist the key harder then you would think is normal for a lock.update:So its been about a month, haven't gotten locked out so that's a bonus.  seems to be working fine now, replacement seems to be much better just a random jam here and there.  you cycle through lock and unlock again though and it comes right out.  Write it off to the first one was factory faulty, at least with Amazon you get fast replacements or refunds if needed.", "Date": "February 21, 2013"}, {"Title": "Convenient lock", "Author": "Teresa Norris", "ReviewID": "R6MLVW3PC0YML", "Overall": "5.0", "Content": "Easy to install and easy to use.  I love not having to struggle to put the key in the keyhole.  Plus if you get the same brand of deadlock you can very easily set the remote to work on both at the same time.", "Date": "January 12, 2013"}, {"Title": "Good Product, Hard to Operate", "Author": "Harry Woodcock", "ReviewID": "R7GQZ5QEQUG6X", "Overall": "3.0", "Content": "Product is unique in operation and would get a higher rating if it operated easier.An ADA or rectangular handle would make opening easier.", "Date": "January 11, 2013"}, {"Title": "Great concept but needs improving - Horrible range", "Author": "Romel1", "ReviewID": "RNGFW5PF5X41T", "Overall": "2.0", "Content": "The lock came nicely packaged with simple instructions, nice weight and seemed well constructed.I tested it outdoors in the open before I installed it and was very disappointed with the range.It works great if you are within 10 - 15ft line-of-sight, outside of that I got no response at all. And forget about going thru walls or around corners, I tried to operate it from 5ft away with a wall between and nothing. I liked it so much I even installed it to conduct a true test hoping there was RF interference in my test location but unfortunately the results were the same. Finally I concluded that the transmitter/receiver is not powerful enough to give the advertised range and I returned it. Also, the lights on the knob are misleading, they flash green when closing and red when opening instead of green for go and red for no go. LED's on the remote would've been a nice touch, if you are far from the lock and cant hear it you cant tell if the remote is transmitting.", "Date": "May 24, 2012"}, {"Title": "Excellent lock, Very high quality", "Author": "I. Moylan", "ReviewID": "R26H7C9NKQTHP", "Overall": "5.0", "Content": "I have never written a product review before, but I was so impressed with this lock I felt it was time to write one. I needed to replace a door knob from one that didn't lock to one that does.I went to Home Depot and bought the best, highest end lock I could find. It wasn't bad, but the screws were impossibly difficult to install on the knob, and it didn't feel totally solid and sturdy. I also had to pull on it HARD to get the latch to pop inside the door frame. That lock has now been returned.This lock on the other hand, the RKK-01AQ was a breeze the to install. The instructions are well written and easy to understand. It even came with a tiny screwdriver for the battery compartment. The lock feels totally sturdy, makes the door feel like a brick wall when locked. The latch mechanism easily slides into the receptacle in the door frame with very little effort.I am not by any means a professional lock smith, but I do like to do things myself around the house. That being said, this lock took me less than an hour to install. Someone with experience could probably put it on in 10 minutes. This is a replacement, not a new installation however.I cannot attest to the longevity of the lock, as I have only owned it for a few days now. So I hope it keeps working, I have a feeling it will. The only suggestion I have for the maker of this lock is to add a button to change the beeping volume and/or mute it. It's not a big deal, but it would be nice :).Thanks for a great product!!", "Date": "May 15, 2012"}, {"Title": "Radio Frequency Door Knob", "Author": "Mountain Homey", "ReviewID": "R31KNS4ILSBUFD", "Overall": "5.0", "Content": "Took about 45 minutes to install and works like a charm.  Love it!  Great when coming out of the car when it's raining and you don't have to jiggle around for the keys.", "Date": "April 24, 2012"}, {"Title": "Morning Industry RKK-O1P remote door knob.", "Author": "James HerbertJ", "ReviewID": "R1QLA91N0MWKPU", "Overall": "4.0", "Content": "Very pleased. Works as described. The optional auto lock feature is very useful. Just what I wanted.  Highly recommend.  Wish the remote had a little more distance. Otherwise, I am very happy with this RKK Radio frequency remote door knob.", "Date": "February 27, 2012"}, {"Title": "It works every time", "Author": "D90NewB", "ReviewID": "R3EBC66USHJQLD", "Overall": "5.0", "Content": "I bought this remote door knob for my front entrance door down stairs. It takes little time to be installed, and works the way I wanted. The remote range is not bad, you can operate it from the second floor. Also, free shipping is very quick too.", "Date": "February 24, 2012"}, {"Title": "Almost 7 years and going strong, solid construction, and a lifesaver", "Author": "B. Brooks \"Railey Marie\"", "ReviewID": "RTGNEMMZG2DL3", "Overall": "5.0", "Content": "It's been almost 7 years, since we purchased this, here on amazon, in December 2007.  Today, I was thinking about, our useless dead bolt up there, as we never lock it.  Pulling a key out and locking your door!!  Nope, sooo last century.Okay, we haven't had a single problem with this thing.  The only time we have an issue with it, is when we drain the batteries to the point, that they are unable to unlock/lock the door.  As they start to weaken, it alerts you with additional beeps and we ignore them, til the end.  Since 2007, we have changed the batteries about 4 times, it could be 3 but, leaning more toward 4 changes.  It's a great product and you will wonder, how you lived without it.Construction:  It's solid, firm, not a hollow piece of junk door knob.We're picking up the matching dead bolt below.  Plus, you can program the single keyfob to lock and unlock both locks.http://www.amazon.com/gp/product/B000FBU2KM/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&camp;=1789&creative;=9325&creativeASIN;=B000FBU2KM&linkCode;=as2&tag;=willbeusingad-20", "Date": "October 10, 2013"}, {"Title": "Great product... except.", "Author": "Brian Ducharme", "ReviewID": "R1IB52E2YHAJDK", "Overall": "4.0", "Content": "This locking knob works have had zero issues with it but the photo shows the red/green LED lights on the top of the knob and they aren't.  They are on the bottom when you install it and so you won't see them flash when you press the unlock button on the remote.", "Date": "November 19, 2013"}, {"Title": "good locks, but beware.....", "Author": "mark huynh", "ReviewID": "R3JM2VG9DNHOXC", "Overall": "2.0", "Content": "Haven't really use them yet so can't comment on how good they are; however, they do feel very solid.  Discovered an hidden function that you can open the locks from the inside without using the thumb lever.  The locks remain locked from the outside.  I accidently locked myself out due to his hidden functionality.  I can see why this is wanted but for our situation this would not work at all.  Unfortunately, we are past the 30 day return period and won't be able to return these locks without taking a major hit.", "Date": "August 15, 2012"}, {"Title": "Not as easy as advertised", "Author": "JoeSeadog", "ReviewID": "R32RA56MBX9IUQ", "Overall": "1.0", "Content": "They said in the ad you could install with your current configuration. Not True you need to measure and drill, I'm just not that handy, nor do I have the tools", "Date": "November 14, 2012"}, {"Title": "This product has a LONG way to go before being worth it", "Author": "Douglas R. Wood \"Mailboxhead\"", "ReviewID": "R2J24KUFAAJUBQ", "Overall": "1.0", "Content": "Who wouldn't want to open their front door like they open their car?  For $120 it seemed very high, but I figured if it works, it'll be worth it.The doorknob itself was less than high quality as it felt a bit cheap.  The installation was harder than it had to be as the battery pack needs to be setup right on the back of the door.  Once I got it in, it worked but to my dismay the controller only worked long distance INSIDE the house where the receiver was.  Outside, the signal could not cut through my wood door unless I stood right next to the doorknob (where I would use a key).I also bought a Schlage keypad deadbolt and it rocks.  This is the way to go.  Forget remotes until the manufacturers get real about making something that works as reliably as your car.  Keypads are great.Overall, STAY AWAY FROM THIS PRODUCT!  Overpriced, ineffective and not ready for primetime.", "Date": "August 25, 2012"}], "ProductInfo": {"Price": "$169.99", "Features": "Remote control you door lock up to 30 feet away.\nAccept up to 15 different remote controls\nQuick and secure entry to your door.\nRequire 4 AA Alkaline Batteries (not included)\nEasy Installation, fit standard door prep, no additional drilling", "Name": "Morning Industry RKK-01SN Radio Frequency Remote Door Knob, Satin Nickel", "ImgURL": "http://ecx.images-amazon.com/images/I/51ljoQgSnbL._SX300_.jpg", "ProductID": "B000FBXWB8"}}