{"Reviews": [{"Title": "Great photos for a small price", "Author": null, "ReviewID": "R2UAWBS2GE5ADQ", "Overall": "5.0", "Content": "I purchased this camera before taking a trip out West.  I'm not a great photographer but found that this camera took good quality pictures without much fuss on my part.  I liked the fact that I could change the picture quality settings to hold more pictures (I took 92 one day without having to have a memory card) and I liked being able to set the camera to landscape or portrait or action mode depending on my subject.  I found it very easy to use.  It's also possible to fine-tune your settings if you're a more experienced photographer.  I thought it was a really good value.", "Date": "October 6, 2003"}, {"Title": "A decent camera for the price", "Author": null, "ReviewID": "R2WU3USLG1VS2M", "Overall": "4.0", "Content": "I purchased this digital camera for my wife for Christmas after comparing some 6 different cameras.  This was our first digital camera, but we pretty much knew what to expect.Some of the negative reviews I believe are a little unfair.  The picture quality is completely dependent on the photographer.  The camera allows you to take 1, 2, or 3 \"star\" pictures.  The 1 star photos are the poorest quality - we found them to be equivalent of taking pictures with a cheap disposable camera.  But the higher star photos are quite good, and we had no problem using the zoom.Two words of advice - since you will need to take 2 or 3 star photos for the quality, you will also need to purchase a memory card expander.  And this camera is a monster on batteries - we used Duracell Ultras for our first pictures and the batteries died after 10 pictures.  My suggestion is to use the camera's manual viewfinder whenever possible, don't take too many video or audio clips, and buy decent rechargable batteries.The viewfinder was easy to read, the directions were clear, and the camera is easy to use.  For people interested in purchasing their first digital camera who don't want the poor quality of a 2MP camera and/or can't afford a 5MP, this is a smart purchase.", "Date": "January 16, 2004"}, {"Title": "Cudos for HP 735", "Author": "David Campbell \"dssoup\"", "ReviewID": "R6S395HSM0HW", "Overall": "5.0", "Content": "For the money this is a great machine.  The lens is sharp, colors are well saturated, and everything on the camera actually works.  This little guy has rekindled my old interest in photography, and it is possible to take this camera out and come back with hundreds of reasonable pictures.  My bags full of high-end 35mm are likely to gather more dust.  The optional 8881 dock works well, and the HP photoshare feature allows encoding email address targets or printing instructions on the camera for automatic download/print/email sharing when docked.  Standard AA batteries (only two) and generic storage expansion are appreciated.  Buy an extra few high capacity NiMH batteries on your own and you will be able to shoot all day long.  Moderate resolution setting and a 256 MB SD card will keep you busy for over two hundred shots with very reasonable resolution.  The HP 735 performs much better than I expected it to, and it's highly recommended.  A manual focus option is the only feature missing that I would find useful, especially for macro shots.  If the functions and output do not satisfy, then the only option is to move up to >5 Mpixels at a much higher price point.", "Date": "August 16, 2003"}, {"Title": "hp 735 first impressions", "Author": null, "ReviewID": "RXYO7O05YZQ60", "Overall": "3.0", "Content": "I bought the hp 735 photosmart camera to replace an hp 315 which, contrary to reviews I've read, I thought worked very well.  I used it a lot for snapshots, eBay ads, and some pretty good picture taking, editing with Ulead iPhoto software that came with a scanner and displaying photos on my computer with GPhotoshow freeware, which I recommend.  The 315 display was too dim.  The 735 is better.  The 315 had 2.1-megapixel resolution and that was fine for me because I wasn't printing larger tham ordinary print sizes but I'll tell you where the higher 3.2 MB resolution has already helped:  when I wanted just a small part of a picture that I couldn't get close enough to - just used my software to crop what I wanted.  The 735 is nice sized - I like to carry it in my pants pocket.The 16 MB internal memory is totally inadequate.  I knew that but so far haven't gotten what I need, having once ordered (then resold) the wrong card on eBay.  Plan on spending for more memory right away.  Plan on something like a 128 MB card.  That's what I expect to get, or 256 MB - I sure wish I knew for sure what product to buy & if they work right!  The manual that came with it says \"128 MB is the largest memory card tested by HP.  Larger sizes ... should work - use at your own risk\"!!  So you tell me!  The movies are worthless indoors.  Unless you provide very bright lighting, or can accept just a dark suggestion of what you saw.  And a couple of those very few movies I've taken indoors so far had a blue line down the images!  It worked ok outdoors.You have to solve the battery issue.  It ought to come with better info on batteries.  I don't like being expected to research the hardware.  So far, I've found most of the ordinary AA batteries I have around the house don't work.  But I'll tell you this much:  right now I have some Energizer Industrial batteries in it, and they seem to work fine.  If only I knew where my wife bought them ...And I have around the house some Radio Shack rechargeable batteries that work in other things - The 1.2 V 1000 mAh AA Ni-Cd versions do NOT work at all in this camera, while the 1.2V 1600 mAh AA METAL HYDRIDE versions do seem to work okay.  I'd guess you had better carry some spares in your pocket when you walk out of the house with the upgraded memory card.  With the 16MB, no problem.Beyond that, it has more features than I really want to worry about - for you pros - and the biggest issue I have with those is that in a dark room I find it hard to see what settings I'm on - really more difficult that the older camera if only because with more choices it's harder to tell, for example, do I have it set for fill in flash, red eye reduction, or suppressed flash - features I DO use and find it hard to use on this camera because I can't see the tiny LCD indications in typical indoor lighting, such as in a club or coffeehouse where I'm trying to take photos of my favorite band.", "Date": "November 3, 2003"}, {"Title": "My Second HP Camera!  And this one ROCKS!", "Author": "\"pc_prntr\"", "ReviewID": "R2DKHAHMNDA8YJ", "Overall": "5.0", "Content": "I owned HP's photosmart 315 camera for the last 3 years and decided to upgrade to the HP 735 and WOW! am I glad I did.This is one fine 'automatic' camera and I am having loads of fun with it. They really thought this one out well.  I also bought the 'dock' and it is making my life with this new camera so much easier. It recharges my batteries without taking them out of the camera and it hooks up to my TV to view my photos there if I wish.Two things I would recommend you upgrade as soon as you receive this fine, easy to use, camera:1.  Purchase a set of NiMH/1800 to 2200mHh rechargeable batteries. (Use the set that comes with it in your child's toys.)2.  Upgrade that 16MB memory card that comes with it to at least 124MB SD card or even an 256MB card.  You will be glad you did. Like any computer, we always have to upgrade that memory!HP products ROCK!  No other for me. I highly recommend this camera with all it's ease of use features for the 'snapshot enthusist'!  Which most of us are.", "Date": "November 29, 2003"}, {"Title": "solid performer", "Author": "glen peltz", "ReviewID": "R1R2LE8Y9OH0L4", "Overall": "4.0", "Content": "Very solid, Auto mode makes point and shoot easy, Bright clear photos, Easy download, workable manual, tons of features, Feels good in hand. Easy to review picturesWeaknesses:Hard to see display in bright outdoors. Batteries go fast. slightly confusing access to Image Display and Capture Menu. The Capture Mode more confusing than handy. Limited shots at high resolutionSummary:I have enjoyed using this camera, my first digital. I find it easiest to use this camera as a basic \"point and shoot\" I hardly use the Live Image Display although tempted to. It's fun to play cinematographer, but It burns out the batteries too fast.I don't mess around too much with the Capture Mode option's offered; shoot Micro, Landscapes, Portraits, or Action. My technique is too spontainious for me to set the mode every time I want a shot.More functional is the capture menu, not the easiest to locate and manipulate when you want to modify a shooting mode, but helpful when an artistic effect is desired. Items from the Capture Settings Menu that I use; The White Balance feature is good to be aware of, for example, If I shoot in the shade mode, even in bright daylight,I don't worry about backlighting. I also like the Saturation feature, nature can be Psychidelic. I leave all the other options to the default (auto) mode. I skip things like EV Compensation, although well laid out in the manual, it is too much to recall on the verge of a picture, the default (auto) mode will take a good picture.Another Menu, the Playback Menu allows you to review your thumbnails, delete or rotate your images.I guess I have to buy a memory card if I wish to shoot in only the 3.2MP mode. I only get 8 shots in the highest quality mode. The lowest setting is most memory efficient at 80+ pictures. 14-18 pictures in middle setting is respectable. Next stop? 5MP maybe a digital SLR", "Date": "October 6, 2003"}, {"Title": "Excellent \"value for money\" option", "Author": "Tomas MF", "ReviewID": "R7I0DJYLG7XDI", "Overall": "5.0", "Content": "I've gotten this camera for Xmas and I am attached to it. It takes great pictures in 3 different formats and has a video option as well (you can record pretty nice videos too).It's really easy to use, and the USB plug & play feature for connecting to any PC is awesome since you do not need to have the special software installed, thus enabling to download the photos in every computer (especially handy when you are traveling and do not carry with you your own) and emailing them.I have heard about \"swallowing batteries\" by a hundred, but the time I have had the camera, I only needed to change batteries once and before running out of them it kept on warning me about it.I am truly happy about it.", "Date": "February 2, 2004"}, {"Title": "Great camera for the price.", "Author": "W. Paul W. \"Paul White\"", "ReviewID": "RE284U6ZF6933", "Overall": "4.0", "Content": "Given the price of the camera, it is a great preformer. The pictures, when set on the 2 star quality, are good, and they're somewhat better on 3 star quality (the camera has adjustable photo quality). I'd reccomend a memory card, but that's normal with digital cameras; most don't come with more than 32MG internal memory, and this one only has 16. On high quality settings, that'll last maybe 10-15 pictures. The pictures on the higher settings are as good as one can expect from a camera in this price range; they don't compete with the 5 megapixel deals, but what do you expect? They're more than good enough for email or photo work on your PC; I blew a photo up to use as my desktop (on a 17\" flatscreen) and it was still photo quality.The video and audio capabilities are neat, but I don't use them; just have no reason. Also, they seem to eat the batteries. They do work though, and are surprisingly decent (of course, they do not compete with a camcorder).The interface is easy to figure out, and the camera is easy to use. For most of us, it takes photos as good or better than we'll need.The only complaint I've heard is that it eats batteries, but so long as I stay away from the video and audio features it doesn't seem to to so badly; they'll last more than the 10 pictures or so that other people mention. I've taken more than 40 pictures since I've gotten it, as well as a 2 minute video (which killed the first set of batteries), and I'm only on my second set. Just buy rechargables.", "Date": "July 4, 2004"}, {"Title": "Great camera, great price!", "Author": "Lorien Cox", "ReviewID": "R1R5KO2CS0E1HO", "Overall": "5.0", "Content": "This is my second digital camera.  My first (canon) turned up missing.  We believe our 20 month old daughter may have tossed it in the trash.  Even she knew that it was garbage..LOL! So we replaced and definately upgraded to this HP.  I LOVE IT!! I take a ton of pictures between my 2 babies and selling on ebay and I couldn't be happier.  The pics are crisp and clear, and you have so much control with all the manual settings. Yes, there is a delay from the time you push the button to the time the pic is actually taken but that is because it is focusing. All digitals have some kind of delay. If you are taking action pics you can manually set it for such but the quality won't be real great.  If you want great quality, action pictures you are gonna need to spend a heck of a lot more than 200 on a camera, or better yet use a regular one and have the pics put on disk.  I compared every single camera in this price range in person, online, and asked around to see what people had to say and I think I found the best.  If you go to best buy, walmart,whatever...pick up each camera and look at it closely you can definately tell which ones are better quality, and this is definately a great quality camera.  Buy this one you won't be disappointed!", "Date": "January 7, 2004"}, {"Title": "Good Camera for the price...", "Author": "Dave Shaun \"Digital_Guru\"", "ReviewID": "R35VAKEKO3C6OL", "Overall": "4.0", "Content": "Th hp735 is an good value for a 3.2MP camera.  The image quality surpassed my expecations for an HP camera.  The sharpness and contrast has never been an issue.  The color seems to be on the blue side and a little under-saturated.  But as long as I have a sharp picture, I can deal with tint and saturation in pretty much any software.If you're starting out with a new digital camera, the HP735 is an excellent value for the price.  The shutter to shot, shot to shot and turn-on time is slow but tolerable.  The beginner photographer will enjoy this camera.Pros:1. focus brackets indicate focus lock; invaluable when you don't have time to review after the shot is taken; pretty reliable2. lcd on the top of the camera keeps the back panel display from being cluttered3. nice, sharp images.4. the macro feature renders excellent close-ups with nicely blurred backgrounds.5. their software detects already uploaded pics and gives you the option of only transfering new images.Cons:1. does not automatically return to your settings; you must hold the \"ok\" button when powering on the camera2. not enough cursor keys to pan when zooming in to review an image.3. slow shutter to shot; slow shot to shot; slow turn-on; this is typical of entry level digital cameras;4. battery life but i typically carry an extra set.5. tint and saturation is a little off; but correctable with software", "Date": "October 3, 2004"}, {"Title": "Promising features, disappointing images", "Author": "J. Luna", "ReviewID": "R9FPYDWOBF24M", "Overall": "2.0", "Content": "I really really wanted to like this camera - it's 3MP, 3x zoom, uses SD cards (major factor as I already had cards) and has a decent price.When I got it I started taking test pix but many of them were very blurry - you apparently need a super-steady hand to avoid any blurriness with your pictures.Even when the blurriness wasn't there, the pictures were grainy and the colors just didn't look very good. I took many test pictures and compared them to the old pictures I took using my Canon S110 - there just wasn't any comparison: The Canon pix looked way better than the HP's.I'd say try it out in a store if you're thinking about this camera to make sure it's what you want - you apparently have to mess around with the controls a lot - which I didn't have to do on my old Elph S110 to get good quality pictures.The pictures looked Ok when viewed on the computer screen at half size but when you opened them up to their full size, they just had many tiny colored dots on most surfaces and weren't very sharp.Sorry HP, I really like the idea of this camera but the pictures just didn't cut it. I went ahead and returned  it. :(I give it two stars because of all the features but the picture quality wasn't what I expected.", "Date": "August 15, 2003"}, {"Title": "No problem with batteries", "Author": "Robin Ringer", "ReviewID": "R188D4JGSNO98L", "Overall": "4.0", "Content": "Almost every reviewer has complained about short lifetime with alkaline batteries. This is because you are NOT suppoused to use these! It says so explicitly in the manual. If you get rechargable batteries the camera works for several days before you need to recharge.", "Date": "July 8, 2004"}, {"Title": "Good job, HP!", "Author": "Iron Chef \"Iron Chef\"", "ReviewID": "R2ZI3UE2VJ34WN", "Overall": "5.0", "Content": "I bought this camera from Target. It is a great camera. My only peeve is that the battery door is weak, and it broke while inserting batteries. I called HP and they promptly replaced the camera. I got my replacement in less than 2 days!! As far as power consumption goes, I don't use the LCD display at all. I also use NiMH rechargables, and I get about 65 pictures each charge. I use the optical zoom sparingly and transfer pictures to my computer about 3 times. I best feature about this camera is that it has a little display on the top, where you can adjust picture quality, mode and flash options. That, I guess saves a lot of battery power. All in all, a great product and I am really happy with it.", "Date": "August 7, 2004"}, {"Title": "wonderful product...learn how to use it", "Author": "fritz", "ReviewID": "R1OE4C09WF8R4M", "Overall": "5.0", "Content": "I read multiple reviews...not just on this site, how this cam can't take indoor or dark pics, or how it eats batteries like mad. Well, I'm here to tell you that if you read the manual, learn the different modes and qualities and so on, you won't have any problem indoors, or in dark. As far as battery consumption, I am on my first set of batteries and I have taken 60-70 pics, plus uploaded 2 sets to my pc via USB. Now, if you have your red eye flash on, normal flash on, and are using the lcd screen as a viewfinder then, yes, you will burn up batteries...but if you are outside, and you are using the normal view finder and no flash, or inside and mess with the modes of capturing, then you will be fine. like I said...I have taken alot on one set. The quality is amazing, adjusting the saturation and modes and such is a snap, and it is big enough to be useful and small enough to be portable. The video capture is great too...64 MB card will give you about 4 1/2 minutes of video with sound at pretty good quality...fun for emails and such. So there it is. A great camera with quality pics and good solid construction...and with a little messing around the quality will only get better, I found a new hobby.", "Date": "June 29, 2004"}, {"Title": "I'm loving mine", "Author": "Elizabeth Davis \"rosesdelight24-amazonsells\"", "ReviewID": "R3M313JG4OU6T4", "Overall": "5.0", "Content": "I love my camera!  The lady who gave it a bad review sounds like she wasn't too paitent with it..I was worried if I had gotten a jicky one at first, but after playing with it for awhile and leaning all that it can do I love it..plus it prints out perfect pictures!  I bought rechargeable batteries and a charger so I don't have any problems with running out of batteries when I'm using it awhile, plus the more I recharge my batteries the longer life cycles they seem to have (Duracell).  It's simple to use even with all the options it has, such as portrait shot, action shot, landscape, burst of pictures, video and audio recording options, so on and so on.  It does have a slightly delayed flash depending on the flash you use (reg., auto, red-eye, night, no flash), but it hasn't been a problem for me. I especially like the self-timer..we took a family portrait in front of the tree and gave them for X-mas presents! I would reccomend this camera to anyone who just likes to take pictures for fun like me...five stars!", "Date": "January 9, 2004"}, {"Title": "A fine camera for the money", "Author": "Chris", "ReviewID": "RS973RVO8M165", "Overall": "4.0", "Content": "Unless you're a avid photography buff, you really don't need too many megapixels or very high-quality lenses.  The 3.2 mp HP 735 is a fine camera.  It reads the Secure Digital format which is preferable to CompactFlash.  Storing a picture sometimes takes too long, especially when the camera first boots.  Battery life it what I would expect from a digital camera.  They all could make more efficient use of power.  Overall a decent camera", "Date": "January 15, 2004"}, {"Title": "Does the basics well", "Author": "Optimist", "ReviewID": "R21SO1J7FT2TCF", "Overall": "4.0", "Content": "I bought this camera as a \"fill-in\" while I wait for the price of 5Mp+ SLR types to fall from $1K to <$500. Have used it for about a week. Pros are: Good quality lens - takes very good pictures (as good resolution/quality as most any 3.2 Mp). Simple user interface (most important stuff on three simple buttons on top with LCD display). Cons are: Movie mode is too low resolution and grainy. Has some delay between camera and playback mode (slow processor). I installed lithium batteries and have taken a few dozen photos and it still shows full battery, so this issue (complaints by others) has not bothered me. Overall, a good camera if it stays well below $200. If you can afford $250 to $300, you might look at others too (e.g. Canon A75 or A80).", "Date": "July 26, 2004"}, {"Title": "HP Photosmart fabulous!", "Author": "Karen", "ReviewID": "R3G3287NSZDOS3", "Overall": "5.0", "Content": "I love this camera!  I sold a 2.1 megapixal HP to upgrade to this one.  The photos are fabulous, the camera easy to use.  I have no problem with fuzzy pictures as one of the other reviewers stated.  I would recommend this camera to anyone.", "Date": "September 21, 2003"}, {"Title": "Hardware error on the first month of use", "Author": null, "ReviewID": "RHL3JMO7MTK02", "Overall": "1.0", "Content": "I was taking pictures when the camera unexpectedly shut down (probably because the batteries were depleted), only this time it did not close the zoom lens. Now the camera has the zoom lens extended and it is blocked. When I turn it on, it shows an error E106 and shuts down again.The idiots at HP have an extremely stupid troubleshooting guide with only the obvious and intuitive problems (remember to put on the batteries, etc) but without error descriptions. I wrote and called, but still don't have a solution.For those of you thinking of buying it:- The camera is OK for the money- The display is not too great- The time delay between the time you press the button and the actual picture taking is long, but I think this is standard for cheap digital cameras- ALKALINE BATTERIES CAN'T BE USED, the description of the camera is deceptive in this respect, if you look into the manual you will see that you HAVE to use rechargeables, so take a note of that in your budget", "Date": "September 14, 2003"}, {"Title": "Trouble 2 months out of warranty", "Author": "Mary Jones \"(Jan)\"", "ReviewID": "R1XEG5G4OOLZN3", "Overall": "1.0", "Content": "Only two months out of warranty I now face replacing this camera.  I cannot take a photo--when I depress the button I get a message of \"charging flash.\"  After two calls to Technical support it still won't work and they offer (at $99 on up) that I can upgrade to a refurbished model.  This sucks, especially since I'm expecting twin grandaughters to arrive in less than two days and I won't have a camera!  Also this camera has a slow shutter--making me miss a lot of shots of a moving grandchild.", "Date": "January 30, 2005"}, {"Title": "Great pictures fast", "Author": null, "ReviewID": "R4UPHNVZ4VTKC", "Overall": "4.0", "Content": "For those of you having problems with the batteries...  We finally bought more expensive, non rechargeable batteries.  Otherwise you could only take about 5 pictures, and it took FOREVER to save them.  Try Energizer Litium.  They worked great right up until the time someone stole it!", "Date": "July 15, 2004"}, {"Title": "A decent camera for the price", "Author": "Brandon", "ReviewID": "R18GEJLVYUL1S8", "Overall": "4.0", "Content": "I recentley purchased this camera from target. I now wish I had purchased it from target.com, due to the $ 50 mail-in rebate. But, anyways the camera is a solid performer, I purchased it for taking basic everyday pictures. The 3.2 megapixels are more than enough for my photos. The zoom is the reason I bought it (15 x total zoom). I am happy with it overall. The uploading process is fairly easy too. If you plan on purchasing this camera, be sure to buy good batteries (NiMh) and a charger. You will be set to take pictures for a long time. The battery cover is very flimsy so be careful there, so you may want to buy a camera case. The internal memory is allright, but dont rely on it to store all your pictures. I also purchased the 64mb memory card and at the lowest quality you can take over 400 pictures with the card. The video mode is suprisingly decent, but don't expect to shoot whole concerts. Overall, for the price its a decent camera.", "Date": "April 25, 2004"}, {"Title": "Hope you have a lot of batteries in your pocket", "Author": "Jamie M. Broadhead", "ReviewID": "R4J3GKIC6OM3Z", "Overall": "2.0", "Content": "This camera would have been decent if it could actually operate for a reasonable amount of time on the two AA batteries it requires.  Rechargeable or alkaline - doesn't matter - I get through about five -seven shots and it's shot.  Not very practical.  I've had this camera for about a year and a half.  Many batteries and many missed shots later, I can definitely say the HP 735 was not worth the money I wasted on it.  I should have coughed up the extra money to by a higher megapixel version of my original 1.5 megapixel Olympus Camedia Camera- now that was a digital camera worth owning.", "Date": "April 4, 2005"}, {"Title": "Not very satisfied", "Author": "Adrian Turcanu \"adrian\"", "ReviewID": "R2K4AJT9FBEHHB", "Overall": "2.0", "Content": "I've read the good and the bad reviews. I would not recommend this camera. Read on if you want to know why.The good things: price is acceptable for the feature set, picture quality good for the price. PC software a breeze to use.The bad things:- It takes about 2 seconds from the moment you press the button until the photo is actually taken.- battery life is questionable, especially if you use the LCD. I tried every single type of battery. Make sure you have one or two sets of spares with you. But beware! Be sure you cahnge the batteries before they run out, or you might get strange behaviors like corrupted flash card.-I found the camera very buggy (I might be unlucky). It damaged (to the point of not being able to reformat) a flash card when batteries got depleted. Also, in another instance, it corrupted my flash card. I had to reformat it.Definitely my next one will not be a HP.", "Date": "April 4, 2005"}, {"Title": "Charging Flash problem camera is now totally worthless", "Author": "R. Pereira \"Frustrated Photographer\"", "ReviewID": "R279IME0D2VOGR", "Overall": "1.0", "Content": "bought this camera off of a reputable dealer on ebay and when i received it and turned it on, it would not take any photos. The screen comes on but when you depress the shutter button you keep getting the same message \"charging flash\" no photos. I have tried several batteries and even had the camera plugged in via the power source and still had the same error. Calling HP help was totally useless. They had no answer for the problem they said it was new to them and then immediately refused to help once they heard i bought it form an ebay dealer", "Date": "March 29, 2005"}, {"Title": "not so bad", "Author": "m_tulu", "ReviewID": "RRHU9YYZ260S8", "Overall": "3.0", "Content": "that's right,i run out of batteries in a very short time.i bought lots of rechargable batteries,they are always in charge. so this solved my problem in a way.secondly when i saw my friends' cameras(like fuji) i ve been shocked.because their image quality was better.but then i learned their prices..really high!i think this is not a bad camera considering its price..", "Date": "March 31, 2004"}, {"Title": "discouraged", "Author": "M. Franklin", "ReviewID": "R3J6ZYEDJSU2AO", "Overall": "2.0", "Content": "I dont know if the cameras arent consistent or what.. My camera was horrible.  Extremely slow from when I pushed the button to take the picture to the actual flash. I could take my hand off the camera and wait around 3 seconds before it would click and flash. Not good for quick photos of the kids! On the clearest pictures, they werent very focused. My batteries were used up completely in an hour of playing with my camera. Plus, you have to use the batteries to get the pictures to your computer. Im returning my camera and hoping to find something better for the same price.", "Date": "December 5, 2003"}, {"Title": "Can't loose for the $$$", "Author": "Bettyboop", "ReviewID": "R374IPG2D9AZTW", "Overall": "5.0", "Content": "I bought this camera for under $140 for a trip to Montana.  This was the best investment.  It took great pictures outdoors of the mountains and at Yellowstone - true to life color.  Indoor quality is pretty decent - not the best in darkness.  It is slow to take a picture - but most digitals do have a split second delay.  As with any digital camera buy rechargeables because they do eat the batters.  I have owned this camera for 2 months and have taken over 2000 pictures on it.Another great HP product is the HP psc 2175 all-in-one copier.  By far this is the best printer we have ever owned and especially when you can find them on sale like we did for just $99.97!!!!", "Date": "October 15, 2004"}, {"Title": "I like it", "Author": "Charles Acklen", "ReviewID": "R1AMJWZP9N0Z9W", "Overall": "4.0", "Content": "Should have come with cord and especially instructions, but overall, I like it and it is a cool little camera, a go getter and does its job.", "Date": "November 26, 2012"}, {"Title": "Still not bad", "Author": "Mermaiden", "ReviewID": "R3G28S5L8BIWW8", "Overall": "4.0", "Content": "Though it's pretty old now, I still have mine.  It has always been poor with battery life, but if you turn the display off when not taking photos, using the left top button on the display, it will not use so much.  I tested the macro focus option against a newer camera and I dare say I think this one was better. It is slow to process sometimes which is a pain, but still, the quality of photos is actually pretty nice.", "Date": "October 18, 2010"}, {"Title": "My Favorite Digital Camera", "Author": "Grammadot, Barto, PA", "ReviewID": "R10947DD31HS46", "Overall": "5.0", "Content": "Because I spilled coffee on my first model 735 photosmart camera, then fried it by charging it before it had dried out. SAME model was purchased 7-7-08. FROZE CLOSED because I did not know I was to check for updates. Bought #3 (9-5-9) and updated it immediately. It is working fine. Bought #4 1-18-2010 as a spare in case I do something dumb to #3. I am not insane; they do not make or service this model anymore and although easy to use it makes pictures that \"real\" photographers rave over. Another fine feature is the dock in which it recharges, is always ready to capture that one-of-a-kind moment!", "Date": "April 7, 2010"}, {"Title": "A Decent Snapshot Camera, but Buy a Newer One", "Author": "amazon customer", "ReviewID": "R3967NU3VFEA8X", "Overall": "4.0", "Content": "I have owned this camera for almost 3 years now, and it is the sturdiest and most reliable one that I have had.  Once, I dropped it from 5 feet onto a sidewalk and it didn't even get a scratch.  The outdoor picture quality is excellent, as well as the macro mode, but if you have shaky hands (like me), you will have a ton of blurry pics.  The screen just can't compete with new cameras, being too small and dim to see outdoors.  The flash is weak, but if you know how to use aperture and ISO settings, indoor shots will turn out pretty good.  Personally, I think buyers would be better off buying one of HP's new R-series cameras (R717, R817, etc).  While this camera is cheap and pretty reliable, the newer models have much more features and are still around $200-$300.", "Date": "August 22, 2006"}, {"Title": "okay", "Author": "Ge", "ReviewID": "R1CND1GUYAQCZ5", "Overall": "4.0", "Content": "this cam was great when untill the flash didnt work! i went online for support but after talking to them, they said it was a internal malfunction or something like that but by then the warrantee already expired so im stuck with a flashless camera.  Ive miss many special moments due to no flash.  and its really hard taking pictures with no flash and no tripod.But overall good camera! batteries seems as though they die quick but like i turn it off for like a few hours then the batteries came back to full power again.  The video mode is pretty good....i also recommend using the power adapter when possible! that way you can turn the camera on as long as you want without worrying about the batteries dieing out!The printer is a really great printer as well!...but sadly i cant live any longer with a flashless camera so im going to sell this up or just give it to my brother or something and saving up for a Fuji Finepix s5100...Good luck!", "Date": "April 5, 2006"}, {"Title": "use it right, it does the job", "Author": "Amazon Customer", "ReviewID": "R351KAQ8VG97XJ", "Overall": "4.0", "Content": "This was my first digital camera and it's because of this camera that I stuck with HP when upgrading.  It's a very good point and shoot camera with enough modes and settings to satisfy those who like fiddling with such things.Many of the reviews here complain about battery life.  Turn off the live display, you don't need it anyway since the viewfinder is accurate.  I never got *fewer* than 60 pictures (sometimes more) in two star mode with the live display off, on a pair of 1800 mAh rechargeables.  I also had a big difference when I changed the auto shutoff to a shorter time period.Also, yes, you need a memory card -- but what digital camera doesn't?  I had a 64 MB card with mine and only once completely used the card up.Shutter speed is a little slower than average for the class but fine for everything except action shots.  Lens glass is by Pentax and is good quality.  No, you won't get digital SLR quality from this camera, but at <$140 it's a great deal.", "Date": "February 2, 2006"}, {"Title": "DO NOT BUY THIS PIECE OF JUNK!", "Author": "P. Swain", "ReviewID": "R1LCX237ZKB7Z5", "Overall": "1.0", "Content": "HP might know how to make a computer but they CANNOT make a camera that is worth buying.  Camera has never taken great pictures and 5 months after the warranty ran out, the camera quit. It turns on for a second, shows an E106 error message, and shuts down.  In doing some checking this means the lens is stuck.  HP Support was horrible and stated it could take up to $200 to fix it!!!  What???  The camera is not worth it.  It eats batteries and no matter how much you customize the options, the picture color/quality is never true to life.  I will buy a DEPENDABLE name brand (Canon) next time!", "Date": "August 8, 2005"}, {"Title": "I lost pictures of my new son!", "Author": "Sybil \"sybil21\"", "ReviewID": "RCPWR8MK0KAO", "Overall": "2.0", "Content": "This camera decided to quit on the day my son was born.  We were in the hospital trying to take pics of my brand new baby, and the flash wouldn't go off.  I'm guessing from these reviews it's because of a \"corrupted flash card\" because we cannot find any other explanation for it, since the camera otherwise works fine.  The batteries were even fully charged!  But, having no camera on the day my son was born is unforgiveable.  I'll never buy an HP product again!", "Date": "August 5, 2005"}, {"Title": "Excellent Camera For The Price", "Author": "Jerry D. \"mayon\"", "ReviewID": "R14LTMUA1X2ZE8", "Overall": "4.0", "Content": "I've been using this camera for the past month and have been very happy with it. I have but a few pet peeves with this camera:1. Batteries ran out too quick -- I just took a dozen pictures and the included Energizer batteries ran out?!2. Internal 16 MB memory is inadequate. At highest resolution, you can only take 8 pictures before memory runs out.3. Processing time after taking a picture takes too long. You have to wait for about 20-25 seconds before you can take another.Fortunately, the first two problems are easily solved. I immediately bought 6 good quality NiMH rechargeable batteries (the camera accepts 2 at a time). Other digital cameras fix this problem by using 4 batteries at a time for longer life, but I think I would rather have the compact design of the 735.Then I bought a 256MB SD flash memory card and it now shows it can accomdate 164 pictures at max resolution. That's a lot of pictures!!The third problem, I guess I have to get used to since I always like taking pictures at max resolution, making the processing phase a little slower.The last thing I did was buy a camera bag at Target for $6.99. It fits the camera perfectly and has an additional pouch for the extra batteries.As can be surmised from my issues above, I'm not a professional (or even amateur) photographer. I just like taking pictures during events, and of my son (who's growing so fast!!). I just want a camera that works. And since I'm upgrading from a non-digital camera, seeing these problems that I didn't have with the old camera is a little annoying.Despite all that, at this price, I really think the 735 gives the extremely good value for a 3.2 megapixel camera.", "Date": "January 1, 2004"}, {"Title": "horrible waste of money", "Author": "jel", "ReviewID": "R3AJDWSAHA5LGG", "Overall": "1.0", "Content": "You can literally take 8 shots and the camera is dead.  I've missed so many photo opps.  Definitely NOT worth buying.", "Date": "December 21, 2005"}, {"Title": "This camera sucks", "Author": "Kannan Raju \"Kannan Raju\"", "ReviewID": "R3NBMY5RBHQMTS", "Overall": "1.0", "Content": "I am totally dissatisfied with this camera.. I bought with lotz of expectations and found it a junk piece.For new buyer dont mind spending a few more dollors , go to Canon or Sony.. They are good.this camera as mentioned eats battries like anything.. not able to take > than 10 pic and has poor flash. .all photos are coming dark", "Date": "November 22, 2005"}, {"Title": "Not very Photosmart", "Author": "Lauren", "ReviewID": "R2PTRSJ035BV9U", "Overall": "2.0", "Content": "Okay.. well I bought this camera right before I headed off for a family vacation in Cuba. This was my first digital camera and was expecting to be able to capture every moment. Not. This camera eats your batteries like crazy. Dont expect to be able to take more than 7 or 8 pictures at a time. Not very convenient when your on the go. There is also around a 3 second delay from the time you click the button to the time your picture actually takes. Bummer. That being said though, I have always been more than satisfied with the quality of the pictures and it's very easy to use. To sum it up.. if your looking for a starter camera or you just want to take pictures once and while this camera is okay but I'd look into getting a Cannon or a Kodak Easy Share. Both very good, simple to use and are worth every penny.", "Date": "September 16, 2005"}, {"Title": "Horrible Camera", "Author": "Liz", "ReviewID": "R5KGRWE47EEK2", "Overall": "1.0", "Content": "I purchased this product in August of 2003 and have had problems ever since. I returned it within a week because of the battery life. The second one was returned because the battery compartment broke. The third one was returned because of an internal lens problem and it took horrible night pictures. And now the fourth camera is being returned for the same problem as the third. Hewlett-Packard will not give me my money back, they will just keep sending me replacements, they will not give me a free upgrade, and they will not extend their warranty. I do not recommend this product to anyone unless they have money to throw away.", "Date": "March 23, 2004"}, {"Title": "Keep shopping", "Author": "Johnny B.", "ReviewID": "RYG3CQT8SLBKB", "Overall": "2.0", "Content": "I bought this new camera in Nov 2003 and can not take it on trips unless I carry a 48 pack of high energy digital alkaline batteries with me.  Don't even try using regular alkaline batteries in it, they are useless.", "Date": "May 7, 2004"}, {"Title": "don't get it!!!!", "Author": null, "ReviewID": "RNUTU7STPK7Z1", "Overall": "2.0", "Content": "Don't waste the money on this camera. Pictures are great but the baterrie life is terrible...At first I didn't mind replacing the batteries because I got the rechargeable pack but things haven't changed!!! I called HP on this problem the gentalman on the phone didn't understand the problem, he told me to use photo lithium batteries I bought a pair hoping this would cure the problem but nope same old batterie sucker!!!!", "Date": "July 8, 2004"}, {"Title": "No power", "Author": "S Newbert", "ReviewID": "R7DS7IR5QG3SJ", "Overall": "1.0", "Content": "This camera has been a real disappointment.  It eats batteries. It is so frustrating to use this camera for a few minutes and the camera shuts down and tells you it is out of power. I can't believe anyone could have the nerve to design or sell it.", "Date": "March 5, 2004"}, {"Title": "No Batteries", "Author": null, "ReviewID": "R1C7LMEUF7BZC6", "Overall": "1.0", "Content": "This is a terrible camera. It run out of batteries with less than 10 pictures. It should be recalled. Is a very bad product.", "Date": "April 24, 2004"}, {"Title": "so far im fine with the camera", "Author": "srkit", "ReviewID": "R1IPXYS0FEILET", "Overall": "4.0", "Content": "i just bought a hp ps735 a present for my husband for our anniversary. reading all the reviews seems to be balance thats why im rating it 4stars. but so far i had the camera for a day so i cant say too much about it...and i dont know if im keeping it while i can still return it.  like some people would say the batteries seem to show a bit problem. i tried playing with the camera and video clips so far it works awesome im happy with the video clips i can imagine i my husband can use video clips longer if he gets a bigger mb. anyways im scary about the battery problem since i know my hubby likes to play with the cam. i still have 90days to decide to keep or return the product as i was told by the sales clerck at target 15% of $199.00 to return or exchange is not a big deal if it breaks within 90 days i dont have to pay anything. right now ill keep the camera and try to get energizer industrial batteries and see what happens. i will let u know if im 100% satisfied with the hp ps735. all i can say is that before purchasing anything make sure that if u are not satisfied with the product u may return or exchage with the one u like to get and so far hp is the best product when it comes with computer so as compaq.", "Date": "March 26, 2004"}, {"Title": "HP 735", "Author": null, "ReviewID": "RYWW14B6M2P8Z", "Overall": "1.0", "Content": "The photos were extremely blurry and only took good pictures of closeups the digital zoom is useless for photos.Battery don't last more that about 10 pictures.Kodak DC210 1 mega pixell takes much better photos.Taking mine back after one day of poor pictures.", "Date": "January 14, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.2 megapixel sensor captures enough detail to create photo-quality 8 x 10 prints and medium-quality prints up to 11 x 14\n3x optical and 5x digital (15x total) zoom lens with autofocus\nHP's Instant Share features lets you designate image destination (e-mail or printer)\n16 MB internal memory; compatible with Secure Digital and MMC memory cards\nPowered by 2 AA batteries (alkalines included, rechargeables recommended); connects to PCs and Macs via USB 1.1", "Name": "HP PhotoSmart 735 3.2MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41NKD0ZPS1L._SX300_.jpg", "ProductID": "B00008Z0IT"}}