{"Reviews": [{"Title": "10x optical zoom,  affordable, but consider competition", "Author": "jemaerca", "ReviewID": "R89FMBD4FE71U", "Overall": "4.0", "Content": "the minolta dimage z1 is an affordable and capable entry into the 10x optical zoom camera class.  but there are a couple of watch-outs to consider.pros:- 10x optical zoom - this is the main selling point of this camera (make sure you get a tripod or monopod to hold the camera steady at 10x to prevent blurry shots).- 3MP resolution.- generally good image quality.- good redeye performance (better than competition).- uses a passive AF system that theoretically speeds up focus times at all light levels although low light focus speeds were not as fast as expected.- has several burst mode options that should appeal to sports photographers.- allows a great deal of manual control.- fast start-up.- minimal shutter lag.- fast shot to shot times.- external flash hot shoe - but only compatible with minolta-based flashes.- support for optional wide-angle lens.- bright, hi resolution 1.5\" LCD display (smaller size than competition, though).- has intriguing Switch Finder system reflects the LCD image to the viewfinder so you see what the CCD sees.- movie mode supports VGA quality (640x480) capture at 15 or 30 frames-per-second plus the AF system operates continuously during movie mode ensuring sharpness.- non-proprietary AA batteries used. this means replacement batteries are as close as the nearest convenience store (i recommend rechargeables though).- not the most compact 10x zoom camera: 4.3 x 3.1 x 3.2\", but one of the lightest at 10.8oz.- for the price, has a solid feature set.cons:- noticeable purple fringing in high contrast and night shots.- soft images with details having over-processed feel.- some barrel distortion at wide-angle.- does not support RAW or TIFF formats.- build quality suspect as evidenced by lens rattling and a battery door that feels like it will detach easily.- the feedback when using the Switch Finder system does not give the solid feel that is confidence building - will this system last?- the passive AF system does not perform very well in low light.- the supplied 16MB SD card is inadequate. be prepared to shell out a few more bucks for more memory.- add more $$ to buy more rechargeable batteries and a charger (only disposable batteries are included).the dimage z1 is a good value (for the feature set) in the 10x zoom camera class but two areas of improvement are: noticeable purple fringing and suspect build quality.  if this camera holds up well, it's a very nice value.  but if it breaks prematurely, you're out several c-notes.  in the 10x optical zoom class, also consider the olympus c-740 and c750 as well as the fuji s5000.i hope this helps you with your buying decision. peace.", "Date": "October 16, 2003"}, {"Title": "GOOD CAMERA", "Author": "randall \"randall222\"", "ReviewID": "R2ZEJ29O8NI0ZF", "Overall": "5.0", "Content": "This is a very good camera; excellent value.My priorities were:1. Good picture quality (obviously).2. Quick response time.3. Big zoom to get close to subjects without being intrusive.Z1 does a great job on these features. Additionally it has many other valuable features such as 60 fps screen, exposure control modes, 30 fps high res video, ease of use, etc. But it isn't a \"pocket edition\" due to the 10X optical. Highly recommended.", "Date": "October 23, 2003"}, {"Title": "Feature Rich - excellent Price/Performance", "Author": "Harry Tuttle \"Citizen\"", "ReviewID": "R2SWEPT92B83XF", "Overall": "5.0", "Content": "I got this camera a week ago. I'd been shopping for a compact replacement for my bulky Kodak DC5000. I had considered the Canon A70, but then I saw this Z1 and took the leap. It's a little bigger then the A70, but the 10x zoom, ergonomics, and unique viewing system really appealed to me. I'm glad I got it. I'm very pleased. The camera is feature rich. You have control over everything or you can just go with AUTO. I haven't even tried the MOVIE features yet.The picture quality is, IMHO, excellent. I've taken a lot of pictures of my dog, and the color and detail are very good. A close examination reveals exceptional detail in each hair on her coat. Snapping action shots is great because the camera is fast. The auto focus is fast and the recovery time for the next shot is fast. The camera is very light weight and ergonomic so holding it and setting up a shot is a pleasure. The unique SLR-like viewing system is very natural. Nothing out there comes close unless you're looking at a digital SLR for $1000 & up.Yep, it's only 3.2 mega pixels, but I'll take the 10x zoom over an extra megapixel since getting a good shot, more often then not, benefits from a little detachment (with people, as well as dogs :). I've seen criticisms about the camera's use of plastic, and comments like the NY Crank Yanker's below on picture quality & steadiness and low light issues. Hey, the camera isn't for Ansel Adams. It's not a Leica, or a Hasselbad. As to the plastic materials, I think this contributes to the camera's light weight and ergonomics and to some extent it's price point. Nevertheless, for features/performance/price ratio, this camera is an excellent value and a real joy to use.", "Date": "October 13, 2003"}, {"Title": "Ideal Choice for everyone", "Author": "Sanjay Pindiyath \"SJ\"", "ReviewID": "R31L5A4N5FYLH", "Overall": "5.0", "Content": "I've been using three major brand SLR cameras for the past few years.To satisfy & explore further stages of my increasing interest in photography I decided to move on to digital level. I started to look for a good digital camera. I wanted to have at least 3MP with zoom & other basic functions. Since my knowledge about digital cameras were limited, I researched a lot, starting with Steve's Digicams ([...] reading almost all the reviews posted on various sites on the net and trying out almost every possible camera on display. After reading all the reviews and observing the market prices I went for this model.  Dimage Z1 looks and feels like a real SLR camera. Perhaps this may be the main reason that made me buy this model. However it turned out to be a ideal choice for me. I can't explain how easy it was to zoom in on distant objects to take a sharp, bright & clear picture without a tripod. This is one fine user friendly camera with too many features to mention, yet simple to use. Excellent battery life ! I love this camera !!! Check out some of the pics that I've captured with this camera at [...]", "Date": "January 4, 2004"}, {"Title": "Great for the price", "Author": "E. Rowe", "ReviewID": "R1USWL5IRUQ897", "Overall": "4.0", "Content": "I bought this camera about 4 months ago and have taken about 1500 pictures with it thus far.  I've taken it on trips to DC, Philly, and London.  It's been windsurfing (though it stayed safely on the beach), and cross country skiing (where it got to go along for the ride).  I also use it for documenting projects around the house, and as the PR camera for my Toastmasters club.  The major technical cons with the unit are:1) Noisy auto focus - the videos do in fact come out with a clicking sound in the background.  In fact they have disabled the zoom feature during video+sound capture mode seemingly for this very reason.2) Movie mode auto focus is less than optimal and frequently loses focus.2) Sub-optimal lens - Unfortunately this lens falls far short, and on many occasions the chromatic aberration problems have shown up.  It is most evident in shots where the light levels are greatly different between different parts of the shots.  For example, in a shot of bare tree branches in the winter against a bright sky, the tree branches will show up purple.  Other than the chromatic aberration problem, it appears to be a good lens, on 21st century standards (cheap plastic lenses with sub-optimal optical characteristics being the norm nowadays).3) Lack of a remote shutter release capability - it is very annoying to be taking long exposures and having to use the 10 second timer function to keep the subject from blurring.  Seriously, how do they possibly expect us to make use of the slow-speed synch function without one???  On a positive note, the long exposure shots came out beautifully using the timer.4) Macro mode is largely unusable due to the difficulty of the auto focus of handling these subjects, and the difficulty of accurately focusing on a subject on a low resolution LCD screen.  It has a 1:1 display function when you are using the manual focus mode, but even this is not really useable.  Fortunately since it is a digital camera (and film is free!), I usually get the focus into the ballpark, then take a series of shots moving the camera through about 6 inches fore and aft of where I thought it was in focus.  One of those shots usually turns out in focus and I can guiltlessly toss out the rest of the blurry mess.5) The built in flash is utterly useless.  At 15 feet in a poorly lit room it will take a picture, but they will likely turn out blurred due to long exposures, grainy due to the increased gain, and overall pretty poor.  It does have a hot shoe mount, but see rant #1 for my experience with that.6) The clear plastic back over the LCD does not appear to be replaceable.  This also doesn't appear to be the case on any other camera available today, and it does appear to be made of lexan or something fairly resistant to scratching, but it is only a matter of time before it becomes unusable due to this design flaw.I have a few rants with the system as well:1) Apparently Minolta changed their hot shoe mount sometime between the mid 80s when my Minolta Alpha-7000 was purchased and now, and as a result none of my expensive digital flashes will work with the new camera.2) People can't seem to figure out how to use it.  I usually end up out of all pictures I take, which is disappointing because I usually bring this camera on vacations and trips.3) Movie capture is in QuickTime only.  Unless you're in the 1% of the population who can afford a Mac, the player for these movies is buggy and has an annoying popup ad every time it starts up.  It does have a conversion program that comes with it so you can put it into a format you would be able to pass onto friends without being embarrassed.4) The battery cover is pretty chinsy and I expect it to have duct tape on it before not too long.On the pros for the unit:1) It usually takes excellent pictures if you know how to use it.2) For the price I think you would be hard pressed to find a better camera.3) The SLR like controls make it nearly seamless for me to transition between my SLR and this camera, as well as allowing me to practice techniques using the same modes.  With this camera I can get instant feedback and adjust settings to get the perfect shot before it disappears.  This ability has allowed me to get some stunning sunset shots I would normally have missed.Other notes:1) While RAW format pictures would be nice, it still takes pictures good enough if you turn the compression all the way down.  With the resolution cranked and the compression at a minimum, the 3.2 shots come out to between 1.2MB and 1.6MB each.  With a 256MB memory card, this is the setting I usually leave it on, and I have never run out of memory.2) The auto focus on the system overall is pretty good.  It is fast, as long as you are patient enough to wait for it to settle down.  It has a very difficult time with low light situations and I frequently find myself using the manual focus mode.  An illuminator would help greatly, and they do have one on their hot shoe mount flashes.Also, make sure and look at this camera in person before purchasing - it is much smaller than it looks (for good or bad).Overall I would buy the camera again.  For the price it takes very good pictures.  I don't expect this camera to last as long as my Minolta Alpha-7000 has, but I do expect it to get more use.", "Date": "June 27, 2004"}, {"Title": "Minolta Dimage Z1 3.2MP Camera Review", "Author": "Dimitri", "ReviewID": "R30MU3H3ESY1FK", "Overall": "5.0", "Content": "This camera is certainly in a class of its own. But before you buy it, here's what I found : (I wont comment on photo quality as anything these days over 2MP will produce excellent and sharp images - the Minolta being able to do this with ease)1. I initially wanted the Fujifilm S5000 - a very very good camera. However, when I compared picture quality, the Minolta Stood out. The Minolta also stood out with its SLR-type viewfinder which helps a lot in taking pictures.2. Bluriness : The camera does not use infrared focusing but rather \"calculates\" the focal points in the picture - and then uses that to focus on the correct items. This works very well BUT - I have noticed that when taking pictures with moving smoke (i.e a barbeque) the autofocus struggled and had to switched to manual. Other than that it has given me no problems and is capable of allowing the user to focus on particular parts of the picture.3. The cameras looks and \"handle\"-ability are superb. Its easy to hold, the buttons are reachable and its comfortable.4. The Macro is just stunning!5. The LCD display is the sharpest I have seen - another plus over the S5000.6. And last but not least, it has a wicked flash. This baby will light-up people in pitch-black darkness like they've just been struck by lightning!All in all I am very happy with the camera.However, the choice comes down to the users. For the same price I could have got a 5 megapixel or higher, but with no zoom lens it kinda makes your pictures look a bit cluttered when you cant focus on what you want.", "Date": "December 26, 2003"}, {"Title": "Great Camera!", "Author": "\"smileyjoe\"", "ReviewID": "R7O82LITNYJ6P", "Overall": "5.0", "Content": "I'm new to digital cameras and my criteria was:1. At least a 5x zoom2. Quick shutter speed for sports shots.3. Ability to manually control shots as I grow more comfortable with digital photography.The Dimage Z1 has met my expectations with flying colors! Some of what I like so much about the camera is true of all digital cameras: seeing your shots as you take them, a memory card that can hold hundreds of pictures, digital video, and easy download to the computer. If you're on the fence about a digital vs. tradtitional camera (as I was for a while before doing lots of research), then let me tell you digital is SO nice! I wish I had a digital on my 5 week trip to Europe! That would've been so nice  not to have  to worry about rolls of film, wondering if my pictures turned out, and being able to take video -- how cool would that be to have video clips of my favorite places on my trip. Back to the Z1: the thing is a work of art. I spent a lot of time looking for the right camera but it became very clear that the Z1 was the clear winner. The zoom is really nice, the interface is incredibly easy and intuitive, and while its a little bigger than some of the postage stamp sized digital cameras you see nowadays, it's no where near as bulky as my Minolta 5000 with the telephoto lens. My favorite features:1. Choosing the size and quality of your image.2. Digital video: up to 60 fps.3. Zoom: Beautifully clear pictures at the 10x zoom.4. Ease of use with capability to manually program your shots. Anyway, I'm no professional photographer, but if you want a great camera for $300 then I strongly recommend you look at the Z1. Be sure to get a larger memory card (the stock 16mb isn't big enough to be practical), and get the Nimh batteries with the recharger.", "Date": "February 16, 2004"}, {"Title": "Easy to use, nice big zoom, but lacking in some features!", "Author": "Courtland J. Carpenter", "ReviewID": "R31EWNCYDI4RJ5", "Overall": "3.0", "Content": "A friend of mine saw this on TV and bought one.  I played around with it some, and thought it was a nice little camera.  It definitely has some good points.  Its light, its loaded with features (you practically get bored reading the list of specifications its so long), and it has a bigger zoom than most of the other entries in this price class.Unfortunately, I noticed some missing items while reading the specs, that downgrade it, at least some.  File types for one, most of us use computers to change, view, print and modify files, so having a number of file types supported helps.  JPEG is about the only standard format supported by this camera.  Next, I would have figured by now the makers would have gotten the message that we don't like digital cameras with a throw-a-way memory card.  I really think today's digital camera should come with a minimum of a 32 Meg card, or larger.  This one has only a 16 Meg card; it won't take many quality pictures without downloading.I really liked playing with the 10X zoom. You could get a clear image on some really distant stuff.  I did need to set it down on a rail though to get a steady shot.  One of the reasons, I would wait for more of the new models to come out is to get the Fuzzy logic type of steady cam I have on my five year old camcorder.  It's only a matter of time before it shows up on these medium priced models.  The camera looks really great, and has simple enough to use controls.  A special feature lets you see the LCD through the viewfinder.  Different from the digital optical views you sometimes get mixed results from.  One thing I was impressed with was the resolution in the viewer screen.  Too often these things are very blocky, but this one was clear.  The flash really lights things up well, and the redeye reduction actually works!I'm not a professional photographer by any means, so I can't comment on all the optical specifics.  Suffice it to say, that the camera is probably not intended for the professional. It's easy to use, has a great long range zoom, but I think its lacking in some important areas.", "Date": "November 28, 2003"}, {"Title": "Excellent performance for the price", "Author": "Keith", "ReviewID": "R3F8ATJ0PF59DY", "Overall": "5.0", "Content": "I have used the Z1 mainly to capture the precious moments of my kids.  After taking over 300 pics, I liked the Z1 very much.  It just delivers the results it declares (fast focus, low shutter lag, long zoom, manual controls).  I agree that there are better cameras out there (A1, FZ10, 300D) but they are all at a different price range.I should say the Z1 is 'just enough' for me, 3 MP is just enough, 10x zoom is just enough, weight and size is just enough (FZ10 is too big, A1 too heavy).  Originally I was planning to buy the Optio 555 which is smaller and lighter. But the 5x zoom is insufficient to keep a reasonable distance from the kids and keep myself unnoticed.  And of course the Optio 555 is nearly twice in price (when considering the additional battery packs, etc).  The Olympus C750 has also been considered, but rejected due to its slower performance.Some pics from the Z1 are posted for reference:[...]Regards,Keith", "Date": "November 23, 2003"}, {"Title": "Not A Camera for PROFESSIONALS", "Author": "C. Forbes \"thundercats\"", "ReviewID": "R227K70SNZTCPD", "Overall": "4.0", "Content": "I've read many reviews(dpreviews.com, pcphotoreview.com, dcresource.com,..etc) about the Z1 and 90% of it has been positive.  The 10% that was negative have been from more of the advance to professional photographers. Many of the problems has been aesthetics and the purple fringing with night time shooting. Anyone who is starting out or who is at the intermediate level will find the Z1 the best value for the money. THE Z1 IS NOT A CAMERA FOR ADVANCE or PROFESSIONAL PHOTOGRAPHERS, AND SHOULD NOT BE RATED/REVIEWED IN THAT CATEGORY. I'm reviewing this camera from the beginner - intermediate view. The Z1 has auto functions for the beginner and manual controls(Shutter control, Aperture priority, Manual Focus, and Manual White balance) for the intermediate photographer, But ( There is always a BUT) there are some things that due concern me.1.  The shaky lens. Minolta says they designed that way purposely for when carrying.2.  The battery cover. Not very robust3.  The mirror system used to reflect the LCD to the viewfinder. Could see this jamming or breaking down from continuous useWith all that aside, the DIMAGE is still a very solid camera. So what if it's not black, So what if its got unconventional styling  Bottom line is; it takes excellent pictures and is priced very competitively.Nuff Said!", "Date": "December 1, 2003"}, {"Title": "Great!!", "Author": "Sun Baked", "ReviewID": "R275DO1T5QIFN3", "Overall": "5.0", "Content": "I received a Minolta Dimage Z1 as a gift from my Father.  I hope all of the info. HELPS!My Z1 is a 512 MB SD card which takes 309 Pictures @ 2048x1536 Fine Quality, or 491 pictures @ 1600x1200 Fine Quality, or 754 @ 1280x960 Fine Quality or last @ 2380 pictures @ 640x480 Fine Quality.  At 1600x1200 Fine Quality I can take almost all 491 photographs with the flash with out changing batteries!  My Batteries were the Rechargeable AA 2000mAh Ni-Cad, I have since changed to a 2700mAh Ni-Cad!In Movie Mode with the 512 MB SD card it works out to 640x480 @ 30 Frames Per Second, it will give you a 7.41 minute movie, @ 15 FPS 15:10 Minute Move!  AND also a movie to send over the Internet with the 512 MB SD card Movies @ 320x240 @ 30 FPS =12.16 minutes, or Movies @ 320x240 @ 15 FPS = 23.26 minutes.  And last movie size and speed = Movies @ 160x120 @ 30 FPS =46.53 minutes, or Movies @ 160x120 @ 15 FPS = 85.57 minutes!I print 4x6 inch pictures that were taken at 1280x960 Fine Quality and they come out equal to my 35MM Minolta.  I have printed posters 20\" x 30\" at 2048x1536 Fine Quality with no blurring!!I have used this camera in Snow to the Arizona summer heat and it has never failed!  I have owned several digital cameras and would rate this Minolta Dimage Z1 9.8 out of 10.00!!!", "Date": "June 5, 2005"}, {"Title": "Best for Price and Features", "Author": "Geno \"thomgeno\"", "ReviewID": "RK1XGA2QRZ5M3", "Overall": "5.0", "Content": "I have owned the Minolta dImage Z1 for six months and am extremely pleased with it.  I have over 25 years experience as an amateur photographer with 35mm Minolta cameras from point and shoot to semi-pro models.  When I started my home based computer and web consulting business I wanted a camera that would provide high quality results.  After researching cameras for about four months, including handling them in stores, I decided on the Z1.  It has 10x optical zoom, and the resolution that I needed for web based photos.  There really isn't a need for anything higher than 3 - 4 Mpix for this medium.  If you're going to print 10X20 etc., then sure, go for a 5 MPix or greater camera.", "Date": "March 13, 2004"}, {"Title": "Updating my review", "Author": "katsachatter \"katsachatter\"", "ReviewID": "ROV4A39U5WNQO", "Overall": "4.0", "Content": "At first I was disappointed and frustrated with this camera, however now that I have had it for over a month, I have really come to enjoy it.Yes, it took some time to get used to all the fancy gadgets, but now that I have been playing with it, I have gotten a lot of compliments for the clarity of my pictures.  I run auctions on ebay (under the same name if you want to see my pictures), and compared to that cheaper camera I talked of earlier, the pictures are 100% better.There are some things that I don't like about this camera.  The software and lack of technical support are lacking.  The battery slot is wobbly.  Other than those issues and a little time spent playing around with the settings, I have to say that I would recommend this camera as an upgrade from a \"starter\" camera.A great value for the buck.", "Date": "January 31, 2004"}, {"Title": "Great Camera", "Author": null, "ReviewID": "R1CKJBPDX9LG92", "Overall": "5.0", "Content": "By far the best on market for the features in this price range. The zoom is great. When we first began taking pics we notice the pics were very blury, I have also read other reviews that also stated there pics were blured. After reading the booklet for a second time, we learned that, You must press the shutter-release button half way (hold for a second) before taking a picture, in order for the camera to focus. So if your not getting clear shots make sure you are doing this. Also you can set the camera mode to take black & white photos and also Sepia photos (which is the aged photo look). If you have children you must try taking pics in these modes.  The main thing that lead us to this camera other than the 10x zoom , is the size of the camera. It is  bigger than other digital cameras and it feels MUCH better in your your hand than the small compact cameras. It does have alot of different features and you must really read and re-read the booklet in order to work the camera correctly and learn all that it has to offer. Once you see your pics it will be worth the time that you spent reading. We have had no problem with the battery compartment thus far , it seems to be a very strudy camera in my opinion.", "Date": "January 6, 2004"}, {"Title": "Confirming the truth! Amazing camera!", "Author": "Diego Lomonaco", "ReviewID": "RI5BUZ4I6E9JC", "Overall": "5.0", "Content": "Confirming what Mr. Brody said Minolta Z1 IS THE BEST camera among others 3megapixel camera. I've read all the reviews on web about digicams, sent mails to lots of photographs asking about, and my wife bought a Z1 for me. Here in Brazil its to expensive e hard to find a friend of her went to US and bought one. The colours, sharpness, contrast. everything is perfect. Ultrafast autofocus, ISO(50-400), incredible zoom(40x with a tripod i took good pics), video quality, battery lifetime... There`s a thing that you should know, if you're going to take pics just in the AUTO mode you dont deserve a camera,like this, with lots of manual settings. You need a full auto camera. Anyway its the BEST 3 megapixel nowdays.", "Date": "January 17, 2004"}, {"Title": "5 for pictures and ease of use, 1 for reliability", "Author": "A. Hawkes \"aehawkes\"", "ReviewID": "R20KXV6YZOI5TK", "Overall": "3.0", "Content": "I purchased this camera back in November.  Yes, I had to buy a card, and batteries, but I was extremely happy with it.  The LCD mechanism is different, but it didn't bother me.  Takes beautiful pictures (and I am a beginner.)  But...this camera is built out of plastic, and after only a few months, I am having mechanical difficulties.  I had to send it in.  The mechanical switcher quit working, and there was a crack in the battery door hinge.  The optics are great, movie quality with sound (that the Olympus C740 didn't have) but the plastic construction leaves a bit to be desired.  We'll just have to see how the warranty repair goes.", "Date": "June 10, 2004"}, {"Title": "lovin' my Z1", "Author": null, "ReviewID": "R1VLEHPMEFEKSW", "Overall": "5.0", "Content": "I'd never owned a digital before and have felt quite intimidated.  But the more I've played with this little camera the more I'm lovin' it.  I'm and American living in England and last weekend I traveled through the picturesque Cotswolds, a series of beautiful old villages.  I got some very professional looking shots that I'm thinking of making into greeting cards.  I've also been experimenting with the macro zoom feature and with the lovely flowers here in the English springtime, I'm getting some great pixs.  I'm amazed at the clarity of even the tiny little forget-me-nots that I've zoomed in on.  I've had the camera since January and I think it's a keeper.I'm happy with my choice.", "Date": "May 23, 2004"}, {"Title": "Disappointed and frustrated!", "Author": "katsachatter \"katsachatter\"", "ReviewID": "R3RY3QO0RAA1C6", "Overall": "3.0", "Content": "My husband bought this for me for Christmas.  He was well intentioned and excited about my surprise, however I am the resident techie in the house and as soon as I picked it up, I thought \"Uh oh\".It rattles and feels like cheap plastic.. You paid how much?  I have a cheaper 1.3 mega pixel Olympus that has more stability and is a lot easier to use.I wanted the zoom features.  My daughter is in the chorus and getting a clear shot of her with my other camera was impossible.  I am hoping that it will be better with this camera.. hoping.  The video clips are grainy and dark.  The audio has a lot of clicking.  The software is complicated and insufficient.  What ever happened to instant fix?  Do I want to know about white balance, and hystowhatever?  No.. just give me a damn camera that I don't have to spend hours editing the pictures through the computer. I tried to get images from the camera through the software and it can not read the camera.  I am using my photo printer software and windows to upload the pics.  I have had the camera for 4 days, and have changed batteries 3 time already.  The door to the compartment was originally easy to operate now has me scared to death that I will break it.I have been reading the book and it sounds pretty easy, but when I try to implement the instructions for a clear picture or video, I am left with foggy out of focus video.  Tell me.. please.. those of you with glowing reviews.. how are you getting those nice \"TV QUALITY\" videos and Sharp crisp pictures?  Sincerely.. advice would be greatly appreciated.  If you are looking for a simple point and click camera that will get you great pictures with ease, don't get this one.I am going to stick with it because I just read the return policy for the store hubby purchased this at.  It has to be Mint in box in order to be accepted back.  Hello.. how am I supposed to know if this camera is functional unless I take it out and use it? If you are going to buy this camera, please make sure the store has a flexible return policy.", "Date": "December 26, 2003"}, {"Title": "Sold it After 2 months", "Author": "C. Forbes \"thundercats\"", "ReviewID": "R31ZYK7BW03YDZ", "Overall": "1.0", "Content": "In my previous review, I said that this wasn't a camera for professionals. After using the unit for about 2 months, I found that the Dimage is not even a camera for beginners.1. The Auto focusing on the Z1 is horrendous; half of all your photos will be out of focus especially in low light situations. What is the point of taking pictures if they all come out blurred?2. The shaking lens and the flipping LCD mechanism are poor quality and cheaply designed. This will definitely be an issue later on.The problems I've highlighted might not be an issue to most of you, but I'm sure we all have one common goal, and that is we all want excellent picture quality. When the auto focusing works the photos are half decent (don't get me start on the purple fringing problem). This is the kind of camera that you would but for son or daughter in high school. I've already returned my Dimage Z1 and upgraded to the Sony F717. (Now that's a camera!) One thing I've learned from all of this is; you pay for what you get.Nuff Said!", "Date": "March 16, 2004"}, {"Title": "Great for the price I paid", "Author": "Cinderella \"Jessay\"", "ReviewID": "RXNL9ME3ON2YY", "Overall": "5.0", "Content": "Let me begin by saying: I am not a professional photogragher, so some of the technical terms in the reviews I've read, are Greek to me. But I love taking pictures. When I pull out my camera, people say \"wow, that's a nice camera\" lol. Little do they know I bought it at that supercenter we love,,,starts with a -W- and paid only $175.00. I took pictures of my daughters at the lake and people thought I had hired a professional photographer. Absolutely, breathtaking photos. It's very simple to transfer pics to computer and print. I save all my pics to CD's to free up space on the disk. I purchased rechargeable batteries and they last a long, long time before having to recharge. I didn't read the manual (completely) and accidently formatted the disk and erased some pics one time. Darn!! Other than that, I think it's a great camera for beginners. Overall, my experience has been great. I bought (two) 5 mega. cameras (Kodak and HP) at Xmas for relatives, and they don't take pics half as nice as my Z.", "Date": "December 31, 2005"}, {"Title": "Great Camera", "Author": null, "ReviewID": "RN55BWJTPFF9X", "Overall": "5.0", "Content": "Well our first adventure into the digital world has been great thanks to the Minolta Dimage Z1.  We've owned Minolta SLR cameras in the past which was our deciding factor here vs. the Olympus and we've been nothing but impressed.  The zoom is absolutely incredible and the camera functionality as well as picture quality is superb.  If you're on the fence..don't be--get the Z1", "Date": "December 28, 2003"}, {"Title": "This is THE cam to get!!!", "Author": "zach54880", "ReviewID": "R7WO06MM1BQAJ", "Overall": "5.0", "Content": "I got this cam for Xmas last year. The only problem I had was with the view selector not letting me switch to the viewfinder from the LCD screen. Minolta fixed it, and I got it back SOONER than they estimated!! Definitely get xtra memory cards, 16 MB just ain't enough. I got a 512 mb card for mine, now I can take up to 5,000 pics (yowza!)before having to empty the card!! This cam is packed with features ( 10X OPTICAL zoom!!) The black and white/ sepia tone modes are cool, and the software is very nice too. Picture quality is excellent. In my opinion, you can NOT go wrong with this camera. I don't see a need to upgrade anytime soon, but if and when I do, it'll be another Minolta. Invest in a set or two of NiMh batteries, a bigger memory card, and a card reader, and you're all set for some serious picture taking. Five stars all the way!", "Date": "June 20, 2004"}, {"Title": "Nice Camera", "Author": null, "ReviewID": "R1MZN6Z4T7WCMG", "Overall": "5.0", "Content": "I bought this Minolta Dimage Z1 camera about 6 weeks ago, and I am very pleased with it! The zoom is more than awesome!! I find it very easy to handle! This is my second digital camera, first being an Olympus, which I had really considered again! This camera really caught my eye! As with all cameras, they each have flaws, I have not found one perfect camera for everyone!  The zoom and the way it is design is what sold me on this one! The pictures are beautiful! This camera for the money is just hard to beat! I admit the battery compartment door is flimsy. Overall, I am very happy with my choice!", "Date": "March 28, 2004"}, {"Title": "Nice!", "Author": null, "ReviewID": "R3L7A9G9O8ZZRM", "Overall": "5.0", "Content": "Got mine on Friday so far it's great.  The pictures I took at night were impressive.  The only think I have to pick at is that it shows the movies in quicktime which seemed to work well with this camera but I prefer realone or MS media player. (no good reason I just prefer it)  Other than that it's pretty nice.  The zoom is awesome.  I used it to get the serial numbers off of an overhead transformer mounted on a 45 foot utility pole (those serial numbers are not much bigger than the print on this page).  You wouldn't believe the clarity.  I was going to hold out for something with more megapixels for the same money but I'm glad I didn't.", "Date": "December 21, 2003"}, {"Title": "Sounds so cool, but...", "Author": null, "ReviewID": "R1WFG9OH3LTHNQ", "Overall": "1.0", "Content": "I've been using a very low quality digi-cam for years and really wanted to upgrade to something more serious.  A camera pro shop recommended this one because of the incredible 10x zoom and the fast response time.  However, within hours of having it home, I saw some problems: 1. It seems REALLY fragile and I just don't imagine the body or the lens holding up too long.2. Once you stuff the batteries in (quite literally), the battery cover looks like it's going to pop off or break at any minute.3. My husband and I both tried repeatedly to get clear shots, but with any zooming at all (even minimal), the picture was blurry.  We tried multiple settings and various lighting conditions and the results were the same.  What good is a 10x zoom if it takes you 8 shots just to get something remotely clear???Turns out that the ultra fast response time (and it IS really fast) just isn't worth the trouble we had trying to get a stable picture, so we took the camera back.  Instead, we opted for the Fuji Finepix (sp?) S5000, which also has a 10x zoom, was cheaper, had fantastic reviews here, and takes dependably clear shots (even using the zoom).In my opinion, if you have your heart set on this cam, I'd hold out until they come up with a better model or test drive the Fuji.", "Date": "December 30, 2003"}, {"Title": "I love this camera", "Author": "S. SPEIGHT \"SP8girl\"", "ReviewID": "RBDQ0SST1RERU", "Overall": "4.0", "Content": "This is such a great little camera! I've had it less than a year and I've taken some pretty nice pictures (you can see a few on \"share your images\".The battery door is flimsy, hence the 4 stars, but my pictures have turned out very nice. Like most Americans, I wanted to upgrade just to have something more expensive and I'm glad I did but this is a nice compact piece that I can go just about anywhere with.I loaned it to a coworker for her trip to Kyoto, Japan during the Cherry Blossom Festival, I'm sure her shots came out great and she'll be upgrading to digital:)You'll like the easy use and, unlike another review, it's not difficult for others to master.The price Amazon is offering is way too much. Look elsewhere, I got mine on eBay for $124.oh and another 'con'! I lost the lens cap and they no longer make them:(", "Date": "April 15, 2006"}, {"Title": "Micro focus went bad", "Author": "Repairmanjack \"rationalcoach\"", "ReviewID": "RO98GZ8ER3LPB", "Overall": "2.0", "Content": "I've had this camera for about a year. I love the zoom and it takes nice pictures, but recently the micro (close up) feature stopped working. I sell on eBay, so this function is a priority to me. It will not focus and there are mechanical sounds inside that don't stop. So, for just one year of occasional use, it's over. I have to go out and buy a new camera. I spent about $400 on this camera and that means I paid about $33.00 a month for the use. Too much!", "Date": "December 31, 2005"}, {"Title": "Extremely poor auto focus ---", "Author": "GymLady \"GymLady in Utah\"", "ReviewID": "RO691MP8FSTR", "Overall": "1.0", "Content": "Over 50% of the photos I have taken are blurry.  According to the instruction manual, when the dot in the view finder turns white, the picture is in focus.  This is only true if blur is your focus of choice.  I have taken still shots, motion shots, shots with flash and without with the same poor focus results.My current digital camera is an Olympus also with a 10x optical zoom which is my desired zoom minimum.  My only complaint with the Olympus is the delay time between shots.  I had such high hopes for the Minolta as the write time and refresh time is so good.  And that did fulfill the promise, but again with out of focus pictures.I am returning the camera and will continue my search for a camera that will deliver the features promised.", "Date": "February 1, 2004"}, {"Title": "GREAT LITTLE CAMERA!!", "Author": "ROSY BEE", "ReviewID": "R2UBF53UR0YB1O", "Overall": "5.0", "Content": "I'VE OWNED THE DIMAGE Z1 FOR A YEAR NOW AND I ABSOLUTELY LOVE IT! IT TAKES GREAT ACTION SHOTS  AND  I REALLY LIKE THE \"VIVID\" COLOR OPTION AND SOFT FOCUS FEATURE. IT FOCUSES QUICKLY AND BATTERY LIFE IS GREAT...A GIANT STEP UP FROM MY FIRST DIGITAL, THE DIMAGE 5. I DO FIND FOCUSING IN THE MACRO MODE A BIT DIFFICULT AT TIMES, AND THE FLASH CAPABILITY IS LIMITED, BUT STILL A GREAT LITTLE CAMERA FOR THE PRICE. I HIGHLY RECOMMEND IT.", "Date": "September 24, 2004"}, {"Title": "Good Camera for Amateurs", "Author": "M. pickett \"honeydew3219\"", "ReviewID": "R2KKFQUORWCMBC", "Overall": "4.0", "Content": "I am female and bought this camera to take to fiji (imagestation.com)  for landscape pics in auto its fantastic point and shoot.  However, at the family reunion all my people pictures were blurred and out of focus.  why?  you have to hold down the shoot button halfway to get the red square box that tells you its focused and then push the button all the way down for a fantastic picture.  If I had read the book duhhhhhhhh! I would have known this.  The only problem i have is that others cannot use my camera when I go on trips I am never in the picture, its confusing for others to use instantly.", "Date": "June 12, 2005"}, {"Title": "Never Again", "Author": "P. Perrino", "ReviewID": "R1T6Q394FH7XSM", "Overall": "1.0", "Content": "I bought this camera a couple of years ago, and had problems with the auto focus. About a year ago the battery cover wouldn't close all the way due to a broken tab in the cheesy cover. Well I just sent it in to be repaired, and guess what they want $150 to fix it. That's almost half the price of the camera for a 10 cent item and probably all of 15 minutes to fix. I won't be getting it fixed (I'll tape it shut), and I won't ever buy another camera from Minolta. Let the buyer beware. Stay away from Minolta unless you like spending your money on repairs.", "Date": "February 3, 2006"}, {"Title": "Great camera excellent condition.", "Author": "Mariann Leone", "ReviewID": "R1J60VN5D5RPLV", "Overall": "5.0", "Content": "Very happy with camera and like new condition. Packed well . Had one like it and wanted to replace one that was taken.It takes outstanding photos. Thank you.", "Date": "January 30, 2013"}, {"Title": "Minolta Z1", "Author": "bigsis", "ReviewID": "R130112JY0PE3U", "Overall": "5.0", "Content": "I had a Minolta Z1 for 7 years and purchased a second one because I liked everything about the first one.  I use them heavily and am thrilled with the quality of the pictures I get.", "Date": "August 26, 2011"}, {"Title": "Great Camera!  Owned it for 7 years!", "Author": "coolnezz", "ReviewID": "R16ZPC6EP1Z3QU", "Overall": "5.0", "Content": "Take excellent pictures.  I've taken it to vacations everywhere, domestic and overseas.Love the 10x optical zoom.  3.2MP is good enough for me since I don't do prints much, mostly facebook and other online picture sharing.It has a tripod mounting screw socket at the bottom, which is great for taking professional shots without blurs.Too bad it only has a small built-in display, i think it's around 1.5\" compare to 3\" these days.Uses 4x AA batteries, NiMH rechargeables last a long time.Can also take motion videos, pretty good quality and light levels.Just wish it fits in my pants' pockets. =)", "Date": "November 27, 2010"}, {"Title": "Super Camera", "Author": "Steve McGrath \"Steve McGrath\"", "ReviewID": "R3F8IR5GY4RYHU", "Overall": "5.0", "Content": "This Camera is super . I love this camera the 10X zoom takes you places you would not believe. I have taken this camera on vacation and get the best pictures I could ever ask for. A++++++++ Also because it uses 4 batteries the life of those batteries is quit long. I've gone as long as three days without having to change or charge batteries.", "Date": "November 18, 2007"}, {"Title": "5 STARS CAMERA", "Author": "Amazonadicto \"John\"", "ReviewID": "R2LNAL2FYLO7SF", "Overall": "5.0", "Content": "No complaints, it's an excellent camera, after use this model you won't use the point and shoot cameras anymore.", "Date": "January 16, 2007"}, {"Title": "Love This Camera", "Author": "Southern Peach \"historical romance fanatic\"", "ReviewID": "R11KINULYLMRB", "Overall": "5.0", "Content": "I have had this camera now for over a year and have taken pictures of grandkids, landscapes, concerts, etc. and have always gotten beautiful results.  The video mode worked great at an Anne Murray concert my husband and I went to - picture and sound both had good quality.  My son took it to Florida for his vacation, and was happy with all the pictures he took there.  I agree that when you have 10x zoom you can't get a good focused picture, but other than that I have no complaints.  In fact, my grand-daughter is graduating next week and is planning on taking digital photography in college, so I bought her a Z1 to start out with.  As for the simplicity of use, I had no problem using it right out of the box and I am certainly no \"pro\" (my last camera was a 110 pocket)!!!  For the money, I think this camera is super for the amateur photographer.", "Date": "June 17, 2005"}, {"Title": "Ideal Choice for Everyone", "Author": "Sanjay Pindiyath \"SJ\"", "ReviewID": "R11XZUIJAP5LX7", "Overall": "5.0", "Content": "I've been using three major brand SLR cameras for the past few years.To satisfy & explore further stages of my increasing interest in photography I decided to move on to digital level. I started to look for a good digital camera. I wanted to have at least 3MP with zoom & other basic functions. Since my knowledge about digital cameras were limited, I researched a lot, starting with Steve's Digicams ([...] reading almost all the reviews posted on various sites on the net and trying out almost every possible camera on display. After reading all the reviews and observing the market prices I went for this model. Dimage Z1 looks and feels like a real SLR camera. Perhaps this may be the main reason that made me buy this model. However it turned out to be a ideal choice for me. I can't explain how easy it was to zoom in on distant objects to take a sharp, bright & clear picture without a tripod. This is one fine user friendly camera with too many features to mention, yet simple to use. Excellent battery life ! I love this camera !!! If you've time check out my photos located at[...]", "Date": "January 16, 2004"}, {"Title": "A \"real\" review of this Camera!", "Author": "Robert Brody \"Capt. RB\"", "ReviewID": "R12X51T7XUYFEQ", "Overall": "5.0", "Content": "If you were unable to get sharp pics with this camera, then you've done something wrong. Pics are VERY sharp. I'm formerly a professional photographer who has used some of the best cameras ever built.The Z1 is a CONSUMER camera packed with a lot of features for the money. Construction is fair and this is not a TOUGH unit like a Canon G3 or G5. The lens is of very good quality at this price point and can deliver crisp images fully zoomed in. I've zoomed in to 40X with the digital kicked in and gotten sharp images HANDHELD. But the truth is that even with image stabilization extreme zooming is hard to keep steady. The fellow who said you need 4 mp or more clearly knows little about cameras. You can crop fine at with a 3.2, unless you have a printer that does posters! Focus works great on manual settings as well, but the camera lacks a focus light which can give it some trouble. The Z1 can also shoot good quality video, above and beyond what most others can do. It has a great display, among the best I've seen and is easily balanced. B&H; sells them every day for 329.00 and it has utterly replaced my G5 for day to day shooting. It's an amazing value.I'm sure Minolta will come out with a better version soon...and I'll probably buy it!", "Date": "January 14, 2004"}, {"Title": "will not focus with flash", "Author": "Legal Eagle", "ReviewID": "R37FOMYAG8V068", "Overall": "1.0", "Content": "I have had the camera for 11 months now.  I like how easy it is to download pictures.  It takes great pictures during the day BUT ... in a dark situation, when I have to use the flash the camera almost always focuses incorrectly.  Even though it shows you with a red line where it is focusing, with the flash it does a poor job of really focusing where it says it is focusing.  Plus, you think the picture is in focus because on the LCD screen it looks like it is in focus, but once you print the picture it is not in focus.  Like I said, I have not had any focus problems when I am not using the flash.  I'm not sure how to fix this problem.", "Date": "October 21, 2004"}, {"Title": "feels like a child's toy; mirror breaks", "Author": "W. Reynolds \"atmvoice\"", "ReviewID": "R8M8RCIDQMPDK", "Overall": "1.0", "Content": "If you have ever held a real SLR (Canon, Fuji, Olympus, etc.) SLR film camera in your hands, don't WASTE YOUR MONEY on this thing. It feels like it is made of the same plastic used at to make the toy cameras at the dollar store. The battery cover will break after a few battery changes; the lens rattles like it is going to fall out. It is smaller and less professional looking that you might imagine.After flipping from LCD to viewfinder about 10 times, the mirror on the one I ordered began to stick.Do youself a favor...if you are considering this camera, go to W..mart and pick one up and see how it feels. Then if you still like it, come back to amazon and order it. (It is about $80 cheaper at Amazon!).", "Date": "December 19, 2003"}, {"Title": "support terrible", "Author": "Dave \"davestephen\"", "ReviewID": "R3GIUQDQZ3M96N", "Overall": "4.0", "Content": "Great little camera, fully functioned. However the software that comes with it has proven difficult to get working leaving me to download the files from the camera to my laptop by dragging and dropping same. ...", "Date": "November 14, 2003"}, {"Title": "DO NOT WASTE YOUR MONEY", "Author": null, "ReviewID": "RVS2L9A73DZIY", "Overall": "1.0", "Content": "The images are not sharp at the telephoto end of the lens. Also, very bad camera shake blur if you do not use a tripod. Only 3.2 Megapixels. You need at least 4 nowadays, especially if you want to crop or enlarge. Panasonic Lumix is about to release the FZ10 which is a 4 Megapixel camera with a Leica 12X Zoom lens with Image Stabilization. This means that you do not get blur camera shake even with handheld shots at the long end of the zoom. Wait for this one. Never buy a long-zoom camera withour Image Stabilization.", "Date": "October 7, 2003"}, {"Title": "Z1 Minolta camera specs, another amazon.com idiot", "Author": "nascarnbroncosfans \"nascarnbroncosfans\"", "ReviewID": "R238MOP3C14IF3", "Overall": "5.0", "Content": "Another amazon.com idiot.... that wont take this down:(The camera is powered by two AA batteries (alkalines included, rechargeable NiMH batteries recommended). It measures 4.31 x 3.05 x 3.15 inches and weighs 10.8 ounces (excluding battery)).Camera uses 4 AA batteries NOT 2Remanufactured Minolta Dimage Z1 3.2MP Digital Camera w/ 10x Optical Zoom", "Date": "April 11, 2009"}, {"Title": "So far, a great camera, BUT", "Author": "Cheryl E. Black \"CR Black\"", "ReviewID": "R27XHX2BW9LAZV", "Overall": "4.0", "Content": "TRY TO GET THIS CAMERA TO TALK TO YOUR COMPUTER!  8 hours of fiddling, calling Minolta, calling Microsoft, and going through 2 card readers and the camera will NOT talk to my 2 year old HP laptop with Window XP!  I now have to sit down with a computer instructor in two days to see if I can resolve this problem.  For a camera that is supposed to be compatible with XP, IT ISN'T!", "Date": "February 11, 2004"}, {"Title": "A BEST BUY", "Author": null, "ReviewID": "R36SGQ8PT5V2MY", "Overall": "5.0", "Content": "You get the best of point-and-shoot or go fully manual, or anywhere in between.  Great zoom, great macros, easy to use controls, suprisingly light weight and compact! Does really well with low light, stops action well.  All around great camera.  (This is th 9th digital I have bought)", "Date": "December 15, 2003"}, {"Title": "great product, for photografy as a hobbie", "Author": "Edwing Roberto Sagastume \"shumes\"", "ReviewID": "RKZIHBKPY85KN", "Overall": "5.0", "Content": "This is a great camera, I also have a Canon EOS with traditional film so I do know have to use a the functions a SLR camera give. so when I did had to choose my camera, y want a camera with functions like a SLR, i didn't want a pocket camera.but also this camera is so easy to use that I can borrow it to my mother, and she can use it in mode AUTO.", "Date": "February 1, 2004"}, {"Title": "all you need now is...", "Author": "\"zackcamacho\"", "ReviewID": "R2WLAF286IJMOX", "Overall": "4.0", "Content": "all you need after a purchase of one of these is a bag for it, 256MB memory card, a flash adapter (Z1 is poor at night), and rechargable batteries [AA] w/ charger, oh and a tripod preferably the tall one....go ahead buy it.", "Date": "July 11, 2004"}, {"Title": "Blindly taking pictures", "Author": null, "ReviewID": "RIE5B1O06J2LX", "Overall": "2.0", "Content": "This is probably a pretty good picture taking camera, but I can't try any of the controls because I can never see what I am taking!  All my pictures are outside and the LCD (at the darkest setting) is so bright and washed out I simply point at shadows and hope I come out with what I want.  The eyepiece is no better since it is mostly gray spots.  The pictures I get on automatic settings are good,  but I could get better composition and lighting if I could see what I was aiming at!  Also, the card door keeps comes open when just brushed by the bag.", "Date": "June 24, 2004"}, {"Title": "great and low price", "Author": null, "ReviewID": "R4IXU9XHBLICJ", "Overall": "4.0", "Content": "as far as i have used it, it's good.very satisfying for me.it's got a very far zoom (10X) and many automatic and manual setting.", "Date": "October 18, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.2 megapixel sensor captures enough detail to create photo-quality 8 x 10 prints and medium-quality prints up to 11 x 14\n10x optical plus 4x digital zoom (for 40x total)\nIncludes 16 MB Secure Digital card; also compatible with MMC cards\nUnique SLR-style; fast f2.8 - f3.5 lens allowing fast shutter speeds for sport or natural-light photography; 2-second start-up time\nPowered by 4 AA batteries (alkalines included); connects with Macs and PCs via USB 1.1", "Name": "Minolta Dimage Z1 3.2MP Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/419%2BTmrOFBL._SX300_.jpg", "ProductID": "B0000BYODE"}}