{"Reviews": [{"Title": "Amazing functions, really easy to operate", "Author": "A. Yeo", "ReviewID": "R3S1EYEN36B7JV", "Overall": "4.0", "Content": "I used this camera for family photos and obtained really good results, the camera combined with the software provided produced good quality photos, excellent on-screen presentation and great prints.", "Date": "January 4, 2007"}, {"Title": "Its ok", "Author": "Maverick19", "ReviewID": "R2Q9UFBUJ4ZHB6", "Overall": "3.0", "Content": "The camera is ok but the problem is it is not effective in night. One bad feature of this camera is that if it is switched off the last settings are not saved. The default settings are restored and this becomes very irritating at times as one has to keep doing this exercise again and again. My camera lens has anyway spoiled as a small dark spot is seen in the middle of each photo.Well I would not recommend HP cameras to anyone. In my opinion Sony Cybershot is authentic. Nothing can beat Cybershot!", "Date": "July 25, 2010"}, {"Title": "Great Camera in excelent condition", "Author": "Jim Miller", "ReviewID": "R1NN84OUB4VVJB", "Overall": "5.0", "Content": "Great!  This older model HP was just what I wanted, due to the fact I have used one just like it for several years.  This one was exactly what I thought it would be.  Very satisfied!", "Date": "December 31, 2013"}, {"Title": "Great camera", "Author": "Robert D. Sherwood", "ReviewID": "R3D9G9VEV1BORD", "Overall": "4.0", "Content": "This camera is a great camera for the price. I have used this camera for almost everything. Only bad part was it did not come with the software.", "Date": "March 17, 2013"}, {"Title": "HP Photosmart Digital camera R827 7.2MP", "Author": "Edsel R. Hensley", "ReviewID": "R1IIFLC4Z6N5ET", "Overall": "4.0", "Content": "Very satisfied with the camera, But it does not fit the insert adapter on my docking device, and Amazon could not find one.[ HP Photosmart R-series docking device] My insert fits the R-817 camera...If anyone has the insert I need, or needs the insert I have let me know...", "Date": "January 23, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000GWMJRY"}}