{"Reviews": [{"Title": "Great Camera for the Price!!!", "Author": "Tanya Millan \"Super Mom\"", "ReviewID": "RQXV4YG0IA8RZ", "Overall": "4.0", "Content": "I purchased this camera for my mom for Christmas.  She loved it.  It does not come with a memory card but the internal memory holds alot of photos.  i would recommend this camera for the novice photographer.  I want to purchase one for myself...", "Date": "January 6, 2008"}, {"Title": "nikon coolpix ... soft pink", "Author": "Albert Canavesio", "ReviewID": "R2Z15VKJ9CSKIY", "Overall": "4.0", "Content": "bought this camera for my daughter ... she is very happy with it ... i should have researched the camera a little more though ... after she opened it she immediately looked for a memory card .. didn't come with one... pictures that she has taken look very sharp and clear ... big thumbs up for the cost and quality ...", "Date": "December 28, 2007"}, {"Title": "Great Nikon L15", "Author": "Kristina Howden \"Kristina\"", "ReviewID": "R24XYFMQXW5I7G", "Overall": "4.0", "Content": "Great camera to work with for beginners, I needed just a basic camera, with good quality photos worthy of prints and internet display as I do take a lot of photos. Wish it came with an SD card because I take so many photos. I have to go out and buy one. Might not be perfect, might not be fast enough to take them, and if you use the flash too close to a light object it becomes whited out so you can't tell what it is- but if you move back some you can then see what's in the picture. I like it and it is good enough for me. Under $130- for an 8 megapixel is a bargain I think.", "Date": "January 30, 2008"}, {"Title": "Easy to use, easy to handle!", "Author": "geisha", "ReviewID": "R1NSYPPZP4HQOI", "Overall": "5.0", "Content": "GREAT camera. Got this one for my teenage daughter because it has more storage and image stabilization. Works very well - no complaints. It taking AA batteries fantastic! The pink tone is NOT obnoxious - very quiet and classy.", "Date": "January 12, 2008"}, {"Title": "Don't bother!", "Author": "Tim Ziegler \"Tim\"", "ReviewID": "R6IVZMK8TIO04", "Overall": "1.0", "Content": "I can't believe that Nikon makes this camera.  As a long time user of the Nikon SLR cameras I assumed this would make a decent reliable camera to stick in my pocket and carry around.  Not so!  Not only was the performance only mediocre (mind you, I was not expecting it to be an SLR) but my wife's Fuji which pre-dated it by several years was better in almost every aspect.  And if you so much as look at the the lens the wrong way, you'll have the dreaded \"lens error\"!  At one point I had two L15s and one L14 (from my daughter and her friend) on my bench trying to repair the lens problems.  No luck.  Nikon was no help, offering to sell me a rebuilt one for the same price as a new one on Amazon.  A waste of money and a notch down for Nikon.Tim", "Date": "May 13, 2011"}, {"Title": "Digital Camera", "Author": "jannelee \"jann\"", "ReviewID": "R33JXFU3G5FFHX", "Overall": "4.0", "Content": "Not a bad product. The flash takes quite a while to recharge, so a bit cumbersome for spontaneity. But for the price, it works. Would have been nice for a case to come with it.", "Date": "January 16, 2011"}, {"Title": "defective lens", "Author": "Teresa Devictoria", "ReviewID": "R8SQGM7HH2TD5", "Overall": "3.0", "Content": "I got this camera for my birthday, used it a couple months, and then took it to Israel. During the trip i had problems with it overheating (probably some sort of battery problem) and with the lens not working properly. This camera only had a lifespan of 5 months for me (granted i did travel with it and use it everyday). the lens must be defective because i've read similar reviews about it having problems. Now it will take pictures, but they are purple, blurry, and have horizontal lines through them. it took good pictures but didn't last long.", "Date": "March 14, 2009"}, {"Title": "coolpix camera", "Author": "skagit", "ReviewID": "R2XY690ZQ82L9Y", "Overall": "3.0", "Content": "This is a versatile camera for a teen photographer, but is slow. The time between pressing the shutter and the actual photo being shot can lose the shot altogether.  Also, it EATS up the batteries.  It takes really good pictures, when it doesn't matter how long the shutter takes, or if the subject doesn't move for a few seconds, but it isn't a point and shoot, but a point and wait and then shoot.  The color is darling, but the camera could use some 'tweeking\"", "Date": "December 16, 2008"}, {"Title": "Defective in Pink", "Author": "dgwnana", "ReviewID": "R2MO0ZYATYOTKW", "Overall": "1.0", "Content": "Nikon Coolpix L15 8MP Digital Camera with 3x Optical Vibration Reduction Zoom (Pink) Caveat Emptor on this one.I have been trying for weeks now to get a definitive response from the merchant on whether they will refund the purchase and shipping either way on a camera that arrived flashing \"lens error\". The phone message left in response to my \"800\" call said to ship merchandise to address other than appears on invoice.", "Date": "October 15, 2008"}, {"Title": "Not a good seller", "Author": "Huiching Huang \"Elsa Huang\"", "ReviewID": "R2YK5CVMNPB3R3", "Overall": "1.0", "Content": "It took me almost a month to get the right camera. They send me the wrong item and I even have to pay for the shipping fee to send it back.They promise to return me the shipping charge, but they never did. I called them and left messages but they never reply. Bad service and I will never buy anyting from them", "Date": "October 3, 2008"}, {"Title": "Look Elsewhere", "Author": "S. Strawn \"-\"", "ReviewID": "R2U2HH5WL0PAXN", "Overall": "1.0", "Content": "Purchased this camera for my wife as a carry around camera, replacing a Kodak EasyShare DX4330. Sadly, the Kodak has a better picture quality.  In sunlight and well lit areas, picture quality is very good.  Loose the light and picture quality fails fast due to the auto ISO. Lower light pictures are very grainy and have excessive noise. You can run noise reduction at the cost of detail so this is not a good option.  Skin tones are blotchy and harsh and edges are not well defined due to jpeg artifacts along them.  These shortcomings were tolerable as we shoot with a D200 and others for quality photos but when the lens failed to retract, all bets were off.  After searching the web, it became obvious that this was not an isolated problem as there are endless reports of lens failures on this camera.  I could get it fixed under warranty but I have to pay postage both ways and who's to say it's won't fail again.  I may just cut my losses and get something else.  I would not recommend this camera at this time.", "Date": "August 13, 2008"}, {"Title": "Coolpix L15", "Author": "Thomas G. Harrison \"Tee\"", "ReviewID": "R1WKHKHX4V0QCY", "Overall": "4.0", "Content": "The camera is very easy to use. The only downside is it appears pictures taken in telephoto are always slightly grainy looking.", "Date": "July 3, 2008"}, {"Title": "Awesome Point-and-Shoot", "Author": "Jessica Hannan", "ReviewID": "RX58KC2X49R1P", "Overall": "5.0", "Content": "I bought this for my mom since she wanted to upgrade to a digital camera. And pink was the desired color, so pink it was. This is an absolute blessing for those not technologically minded. It's less involved than my L11 with the same sized screen. My mom has taken pics, even deleting some, while she has trouble with opening Word on her laptop majority of the time.Also, there's crystal clear pics that I've come to expect with the Coolpix line and it manages to dim dark shadows indoors automatically. Worth the money if you just want to carry a camera around just in case something strikes your fancy. And it's small enough that it won't take up massive amounts of room in a purse/tote or small bookbag.", "Date": "April 30, 2008"}, {"Title": "disappointing", "Author": "J. Stanton \"realist\"", "ReviewID": "R1BZ155R00CASS", "Overall": "1.0", "Content": "The inability of this camera to focus on a specific point in a general scene makes it damn near useless. We made the mistake to take it on vacation and the majority of \"general view\" shots are out-of-focus. It seems to function well if you zoom-in on the particular focal point so that it occupies a significant portion of the frame, but lacking manual focus capability really hurts this camera.Some freinds brought along their Sony pocket digital and they did not experience the same problem (except when they used the Nikon). Nikon service was no help whatsoever. They told me to hit the reset button. That made no difference. It is truly an inferior product.", "Date": "April 27, 2008"}], "ProductInfo": {"Price": "$179.95", "Features": "Supplied accessories - Two 1.5V LR6 AA-size alkaline batteries, UC-E6 USB Cable, EG-CP14 Audio Video Cable, AN-CP14 Strap, Dock Insert PV-15, Software Suite CD-ROM\n8.0 effective Megapixels for high-precision image quality for up to 3264 x 2448 pixel resolution (standard) and 3200x1800 (16 - 9 Widescreen)\nOptical 3x Zoom-Nikkor lens (35mm equivalent 38-114mm) / 4x Digital-zoom\nOptical lens shift VR image stabilization minimizes the effect of camera shake\n2.8-inch high-level contrast LCD monitor with anti-reflection coating", "Name": "Nikon Coolpix L15 8MP Digital Camera with 3x Optical Vibration Reduction Zoom (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41yyArJ7ibL._SY300_.jpg", "ProductID": "B000VKUZDQ"}}