{"Reviews": [{"Title": "portable, superior results", "Author": "Bradley D. Laronde", "ReviewID": "R2VTQYCYPZ7QZA", "Overall": "4.0", "Content": "My perfect camera has to do two things very well.  First, it has to deliver superior results.  Second, it has to be portable.  I think this Olympus C-7000 comes the closest to perfect and this is the one that I bought.For superior results I thought I wanted a dSLR, but after handling one I realized I wouldn't often want to take something that large and vulnerable with me.The Canon G6 and S70 are the only other cameras that I took any serious interest in.  The G6 was tempting but still a little thick (especially the grip bump).  The S70 was tempting too, but still longer than the C-7000.Neither Canons offer as much zoom as the C-7000 (5x optical), though they both offer a wider angle.I gave only four stars because I still wonder how it compares to the G6 in light gathering ability.  Maybe I'll upgrade it to five stars once I settle that issue.I was determined to buy a Canon or a Nikon.  I had no thought toward buying an Olympus.  This camera impressed me enough that now Olympus has a new customer.  Nice job Olympus.", "Date": "November 3, 2004"}, {"Title": "Great Camera, Questionable Software, New RAW Format", "Author": "Mitchell Small", "ReviewID": "R3DFF4B9EA42UV", "Overall": "4.0", "Content": "I'd like to split this review into different sections: The Camera, Implementation and Bundled Software.I'll begin with the negative impressions first.ImplementationOne of the driving forces behind my new digital camera purchase was that I'd outgrown my old camera's capabilities. My skills had reached the point where having a camera that saves images in a RAW format was highly desirable. When screening my choices, the C-7000 came in at a reasonable price while offering this feature.I must digress for a moment here. It seems that RAW format is not a universal standard. My present imaging software, PhotoShop CS, lists RAW formats from a variety of vendors. Apparently all are unique. While the C-7000 was not specifically mentioned, the C-8080 and C-5060 were mentioned, as were several other Olympus models. Additionally, Adobe has proposed an open standard for RAW formats, dubbed DNG for Digital Negative, and the same list of cameras appears on the list of supported formats that may be converted to the DNG format. Once converted, a DNG image may be read by any program utilizing that format.At least that's the theory. Olympus seems to have changed their specs for RAW from the other cameras in their line up as neither the DNG converter nor PhotoShop, with the latest RAW reader plug-ins, is able to read an Olympus Raw Format (*.ORF) image from the C-7000. Major disappointment! Other than ORF images, I had no trouble reading any other images.Bundled SoftwareThe inability of my software to read an ORF image lead to the installation of the included Olympus Master software. Installation is painless: insert the disk and an auto-install wizard takes over. Once installed, the software is ready to go.Personally, I felt the software was aimed at a first time camera user. The interface was so simple I found it almost insulting. I mean, come on, do you really need a wizard to help you e-mail a photo or print a picture? You also don't need the software to transfer images to your PC (see The Camera, below). I found nothing in the software, or advertised features, to warrant the expense of upgrading to the \"full version\" at a cost of almost US$20.While the software is capable, especially if you have no other image enhancement software, there are some serious shortcomings. I hate to keep harping on the RAW format, but it's a problem here too. You are free to manipulate the image, but you can't save it to another RAW format usable by any other product. You can save the image as a JPG or TIF, but there is quality loss involved. That's what the RAW format is supposed to avoid. Olympus, PLEASE sign on to the DNG standard or at least offer the ability to convert these RAW images to the same format as your other cameras that are supported by third party imaging software.The CameraNow we're getting to the good stuff! Ten minutes after unpacking the camera, I was off and taking pictures. It's that easy. The controls were different from my old D-460, yet intuitive enough there were no major problems. Even if this was your first digital camera, I estimate you could be taking your first digital photos in less than half an hour. The setup folder is easy to follow. I used the battery without charging it and got about fifteen exposures before I ran it down. Fully charged, I'd expect about a hundred exposures before recharging.Now that I had some test shots, I wanted to see them. Without reading the manual, I simply plugged the supplied USB cable into the camera and then plugged the cable to my PC via a hub. Windows 2000 showed a notice that new device was detected and in a couple of minutes I received a notice my removable drive was ready to use. No additional disks to insert for drivers, no Internet searches for drivers or anything more complicated than finding an open USB port. Windows Explorer showed the new drive and I was able to navigate to the photos, drag `n' drop to a temporary folder and I was able to view them with my graphics viewer of choice (JPG images only). I'd expect the same to be true for Windows XP or Mac users.The only customization I'd done to this point was selecting an image size of 640 x 480 to maximize the number of images stored on the supplied 32 Mb XD flash memory. During use I was impressed with the speed it wrote to the memory. On viewing the images, I was impressed with the evenness of the exposure, accuracy of focus and quality of the flash. Using a tabletop to hold the camera steady, I did some available light work with exposures of one to two seconds length. The resolution is impressive as is the contrast of the images. I don't have any objective data to back my results, but I'd match this camera against any other fixed lens digital camera on the market. Superb optics!Another major surprise was the camera body finish. The brochure describes it as Titanium. I don't know if Olympus is describing the color or the actual material, but it certainly isn't plastic! The shell has a nice solid feel in your hands and, while I wouldn't deliberately drop it, it gives the impression of ruggedness. Holding it you feel your money was well spent.ConclusionsOverall, I'm very pleased with this camera. I bought it because I wanted something compact and rugged, yet easy to use. I bought it for the quality of the camera and the picture taking ability of the camera, not the software. In time, I'm sure my problem with the ORF images will be solved and the image format in no way interferes with the camera's abilities. I would suggest two accessories to purchasers of this camera, both of which are based on common sense, not any shortcoming of the camera.1) Get an extra battery and always keep a charged spare with you.2) Buy the highest capacity XD card you can find. You'll use it!To Olympus I'd suggest offering some conversion of this new ORF format to DNG and perhaps marketing another package that is priced to include the camera and XD memory without the proprietary software. While the software may be useful to some users, it is an unneeded duplication for others.12/23/2004Adobe has solved the problem of reading the RAW format. There is a new plug-in for PhotoShop, RAW 2.4 Beta, that allows me to read the ORF this camera generates. I still stand by my 4 star rating based on the quality, or lack there of, of the bundled software. The camera by itself earns a full 5 stars, it's the total package that suffers.", "Date": "November 29, 2004"}, {"Title": "Otherwise Great Camera Marred By Poor Auto-Focus...", "Author": "Institution Green", "ReviewID": "R1IJ0GGUNX9C1J", "Overall": "3.0", "Content": "Having purchased an Olympus D-580 a few months back, and not having been thrilled with its auto-focusing ability for indoor photos, I decided to splurge and purchase the C-7000 after considering the Canon G6 and Sony DSCV3. The C-7000 has an AF Illuminator that the D-580 doesnt have; I figured this would solve the auto-focus issues I had experienced with my D-580 while taking indoor photos. Wrong. Under indoor, lamp-lit conditions, the C-7000 often takes several seconds to focus and then, when the green \"focus indicator\" light finally comes on, a quick glance at the monitor reveals that the camera is obviously NOT focused. (And, your subjects will probably be wondering how much longer they're going to have that red AF Illuminator shining in their eyes.) Having said all that, I will admit that after using and practicing with the C-7000 for awhile, you sort of \"get the hang of\" (for lack of a better term) the auto-focus and can achieve acceptable results. I also found it helpful to adjust the camera to \"always auto-focus,\" which is an added drain on the battery, but seems to improve focusing performance. But, all things considered, I'd prefer to just be able to point the camera at my subject and shoot rather than wrestle with an inferior auto-focus. For a $500-$600 camera, I think Olympus can do better.On the good side, this 7.1 megapixel camera does take very good, very high resolution photos (see my samples) and is solidly constructed (aluminum and plastic). All sorts of settings, ranging from full auto to full manual, including aperture priority, shutter priority etc... I basically leave it on auto, but I did go in and increase the color saturation and the contrast a bit. This compact, easy to carry camera also has a nice selection of features as well (I couldn't get the red-eye reduction feature to work, but oh well: I can fix those better on the computer, anyway.) The C-7000 also allows you to take black-and-white or sepia photos, but you have to switch into either mode BEFORE you take the pictures, whereas the D-580 allows you to make B&W; or sepia versions of photos you've already taken. Battery life is decent; it takes just under 2 hours to give the battery a full charge, so buy a spare. The C-7000 uses a proprietary battery so you can't just swing into a convenience store and buy some Duracells to throw into it...The big question: If I had it to do over again, would I still go with the C-7000? No. I'd choose between the Canon G6 or Sony DSCV3. But, I'll stick with the C-7000 for now. Over time and settings adjustments, I suspect I'll learn to like this camera.2/19/05 - UpdateAfter using this camera for a month and a half, reading other user's reviews and forum postings, I realize that the C-7000 does have critical auto-focusing issues. I called Olympus tech support and spoke with a gentleman who suggested putting the camera in \"night\" mode when taking pictures around the house. He then suggested I use \"sports\" mode when taking pictures of the kids, because \"they're always running around.\" Why the camera won't focus when my kid is sitting perfectly still in a chair smiling patiently at me while the auto-focus grinds away remained unexplained. At any rate, I decided to email Olympus through their website - hoping the question would reach someone who understands the difference between auto-focus and exposure settings -  and ask about the C-7000's auto-focus issue. To date, I've received no response. My advice? Steer clear.", "Date": "January 5, 2005"}, {"Title": "Excellent Camera", "Author": "Terry Field", "ReviewID": "R30NAJ4AXPK96O", "Overall": "5.0", "Content": "I recently purchased the Olympus C-7000 after an exhaustive search and I am very happy with this camera. I have worked as a professional filmmaker for over 28 years and have shot extensively with my full manual 35mm Pentax MX but this is my first foray into the digital still camera world. This camera makes me glad I made the move.Some other online reviews I read during my search made me apprehensive about the speed of the autofocus and the lag time in browsing through photos stored in-camera but, as I suspected, I think the other reviewers were being ultra-picky. What little effect I noticed, I found to be minor issues particularly when weighed against the many, many excellent qualities of the camera.The camera is responsive, intuitive and just plain takes great pictures with outstanding resolution and tremendous detail. The basic point and shoot setup is easy to use and very accurate but the camera also has the flexibility to satisfy my pro desires to tinker with the settings for variations in the end result.Some additional features I really like:1. The macro (closeup)capabilities are excellent and easy to use.2. The flash is always off unless you manually pop it up, then it can be adjusted from there. I dislike having a flash pop off whenever it feels like it and it's a pain to go through a menu to shut the flash off every time you power up.3. The viewing screen is big, bright and clear but the manual viewfinder is very helpful in composing a shot under sunny conditions.4. Most of the fequently used controls, including viewing and deleting photos, have dedicated buttons on the back of the camera which means you don't have to hunt through lots of menus to do the repetitive work.5. The camera feels well balanced in my hands and the controls are thoughtfully laid out.The only downsides I've noticed so far are:1. A relatively short battery life which I solved by simply buying another battery for about $35. I also purchased a 1GB chip which gives me lots of room to work with.2. I would like to have a little wider zoom on the short end (maybe a 28mm equiv. instead of the 38mm equiv. provided) and a little faster lens on both the short and telephoto ends but cameras that included these features seemed to cost quite a bit more money so I can live comfortably with this camera for the price.I am not an expert (yet) in digital photography but I highly recommend the Olympus C-7000 as a solid, well-made, easy to use camera. It is exactly what I was looking for.", "Date": "November 27, 2005"}, {"Title": "Focus problems, again", "Author": "William Balsam \"Ursus\"", "ReviewID": "RYLOP2LLEW3X", "Overall": "2.0", "Content": "I recently purchased and returned an Olympus C-7000 (thank you Amazon). As has been noted, when properly focused, the images are spectacular. Unfortunately, the focus was inconsistent, even in bright light and even with half-press of the shutter button and giving the camera time to focus. In dim light most of the images were blurry. Flash pictures, however, were always sharp and crisp. This lead me to put the camera on a tripod and try some pictures at low light levels. When mounted on a tripod and using the timer pictures were in focus, suggesting the problem with low light was more related to camera shake than focus. I tried putting the camera in the night shot mode and forcing ISO 400 (higher noise), but shake or focus was still a problem for hand held shots at low light levels.The Olympus C-7000 is not the only camera for which users report focus problems; many >7 mp cameras seem to have some focus problems and many users report better focused pictures with older, lower mp cameras. In part, the higher resolution sensors (>~5 mp) seem to require more precise focus for the more detailed image they produce. Two recently introduced cameras acknowledge this and try to correct this problem, one by shifting to higher ISO numbers in dim light and the other by shifting the sensor to lower mp resolution in dim light. Until autofocus technology catches up to sensor technology it may be best to limit your choice of point and shoot cameras to 5 mp or less or buy a camera with manual focus, a DSLR.", "Date": "May 7, 2005"}, {"Title": "Good Overall Value", "Author": "SevereWX", "ReviewID": "R1HG6SQU4UTYDZ", "Overall": "4.0", "Content": "This camera is a fast little camera with lots of nice features. It is a battery-hog however, so be sure to buy an extra battery or two for it. It takes around 2 hours to charge the lithium-ion battery pack to full capacity.The camera takes sharp pictures, but has a small amount of vigneting and slight barrel distortion at all focal lengths. These irregularities will not be noticed in most instances however. The onlt times they really become noticeable is when shooting bright plain subject like a light-colored wall or the sky, where the vignetting is seen, or when shooting architecture where the barrel distortion can be seen by a discerning eye.The contrast-based auto-focus is quick and precise in bright light, but tends to stumble and hunt in low light or low contrast situations.On the up-side, the camera offers true-colors and accurate white balance. The ability to put the camera in complete manual exposure mode is big plus for those who want to break-away from the novice auto-program scene modes. This little camera also offers a manual focus option, but with no real distance scale to go by, it is very limited for practical uses.The size of the camera is small and will fit in most any shirt-pocket without a problem. Easy to stow away and a great alternative to luggging a heavy and bulky SLR around when doing so would be inconvenient.The optical viewfinder is very small and dim, with no information displayed except for the focusing-brackets. The LCD screen makes up for it though, with a bright, sharp, easy to read display.The menu system is fairly simple and easy to navigate, making it a snap to change settings quickly. The advanced manual covers all the settings and how to change them, but is only on a disc in adobe .pdf format. A paper manual would have been much more convenient.Compared to the few other 7MP p&s; cameras available, the Olympus Camedia C-7000z is a feature-packed little camera for a decent price.", "Date": "March 22, 2005"}, {"Title": "Well worth the price!", "Author": "Mama Bird", "ReviewID": "RVRET0XUKVOXN", "Overall": "5.0", "Content": "As an owner of 2 canon cameras I was not expecting to buy an Olympus. I decided I wanted a digital camera(my first) for Christmas/Birthday (my husband loves it when he knows exactly what to get) and after MUCH research and thought I concluded I wanted the C-7000.I received it from Amazon.com 7 days ago and have had not one moment of regret. Within minutes of opening I had the xd picture card and battery loaded and had taken a couple of pictures. Then I charged it for two hours as instructed.What I noticed immediately is how easy it is to use. It is easy to hold, feels very sturdy and has a rubber grip on the front right side. The compact digitals always felt too small to hold comfortably. Trashing unworthy images is painless and navigating the menus is straightforward.  I have not read the ins and outs in the manual (product of having a 16 month old) but I have the basics down.I must admit to being behind the times, my computer has win 98 and the software \"bundle\" is not compatible. This has not created a problem as I do have a mult-function printer (hp 2400) which has a xd slot. Pop it in, it downloads quickly and without any input. From one screen you can then edit, email, print and save. I can't imagine it being easier with another program.I had considered buying a backup battery immediately but have decided to wait and see if needed. I have used this camera quite alot in 7 days and the battery shows full powere after only that initial 2 hr charge.BUY A OLYMPUS 512 MB XD PICTURECARDi got mine a couple of days before the camera arrived and boy am I glad. Yesterday I went to a party, a house full of one year olds and their mothers. I then discovered it is hard to take a bad picture with this camera. I came home with 78 pictures and those did not include obvious trash (ie blurry or child half out of picture) It loads quickly, focuses quickly, flash cycles instantaneously which are all important as one year olds do not hold still for anyone especially mama. I forgot to use the flash (one button pop-up) and it compensated very well for low light.  better than my 35mm would have when subject is backlit.I am looking forward to using and exploring the more complex options of this high powered toy. I still have about 240 pictures I can take on this card without deleting any.Closing thoughts: I think this camera is competitive with the SLR models selling for a couple to several hundred more dollars and is more convenient. You don't immediately need a backup battery but I would get a 512 mb olympus xd card (only olympus cards allow you to use panoramic function)", "Date": "December 11, 2004"}, {"Title": "Just might be the perfect digital camera...", "Author": "Mark L. Clark \"marcusclarkus\"", "ReviewID": "RQOWDRXJVYZ9F", "Overall": "5.0", "Content": "I had done a lot of research prior to buying this camera. I previously had owned an Olympus Camedia C-2020 (2.1 megapixels) with which I had not had any problems, but I was ready for the next generation of digital cameras. I needed a smaller size, but more capabilities, especially more zoom. I had narrowed by choices to the Canon S1 IS, the Olympus c-765 or C-770 or the Fuji S-5000.A local photo shop hosted a manufacturers rep day and I went and had some great conversation. When I first saw this camera I was amazed at all it could do, despite it's small size. 5x optical zoom, 20x total zoom, 7.1 megalpixels and a size that allows it to be carried in your pocket. You can read all the fancy specs at a lot of good review sites, checkout [...] but before you buy a camera in the $400-$550 range, check out the Olympus S-7000.", "Date": "November 22, 2004"}, {"Title": "Olympus C70", "Author": "Stuart Goggin", "ReviewID": "R2AJAVCDZFB05D", "Overall": "1.0", "Content": "I have owned an Olympus C70 now for a couple of months,  I have taken over 1500 photos with it.  I \"upgraded\" from a Sony Cybershot DSC P73 (4megapixel).  I have a large collection of Olympus OM SLR film cameras/lenses, and was interested in getting back into the Olympus family.When it actually manages to focus  the Olympus C70 produces absolutely fantastic images,  but in normal family photographing  it rarely manages to focus,  or it underexposes severely when using the flash,  or it spends ages trying to focus.  What is the point of a camera that cannot focus on a human face in anything but direct sunlight? Why is there an AF illuminator that makes absolutely NO difference to the ability of this camera to focus? The Sony cybershot beat this olympus camera, it focused nearly instantly every time.  I never lost a photo due to bad focus or the flash exposures being badly underexposed.  With the C70 I spend so much time trying to work with the focus limitations that I have begun to hate using it.  It's just not possible to use this camera to take quick family photos,  by the time you mess around getting it to focus that magic moment is gone forever!  At first I though it was a bad camera,  I  exchanged it for another,  if anything this new one is even worse.  Perhaps it is my technique that is at fault, Olympus say that it uses contrast to judge focus,  that's great, but it appears that a human face does not have enough \"contrast\" to get this camera to focus in anything but direct sunlight.  Often it will focus on some high contrast object in  the background,  or if I have it in spot focus mode it will refuse to focus on my childs face.  Olympus customer support said that one workaround is to compose your picture by focusing on a similarly distant object, lock the focus and then reframe the picture on to your subject.  Sounds great in theory but in reality for shooting shots of people that move this is really a pain in the neck.  And in my experience I have often been faced with trying to find a suitable high contrast object to focus on.  There is a manual focus mode, that works very well, and I often have to resort to this,  but it's interesting that the much cheaper Sony that I had before did not need this option and focussed perfectly every time in every situation.There is an option to allow full time autofocus, this supposedly allows the camera to keep focus even when the button is not pressed.  This option is very much an annoying waste of time.  You can point the camera at something,  this continuous autofocus will then get it into focus all by itself,  great!!  Then you press the button to take the shot and the camera has another go at autofocussng and you end up in the same position as above. And it seems strange to me that the continuous focus, often gets focus where the actual Auto focus it tries to do when taking a photo cannot? This option must have been added for marketting purposes.The image quality when it manages to get focus is nothing short of stunning,  I love opening an image in Photo shop and just zooming in,  the details seem to go for every and are pin sharp.  The noise levels of this camera are excellant, you can take a photo of a blue sky and not see any visible noise!  You can take a photo of a face and zoom in until you can see every single little hair!  It's really an amazing image quality.  If it would focus then this camera would be perfect.Oh and a word or warning,  be \"very\" careful with that expensive bit of plastic and aluminium,  I phoned the local olympus repair centera and was told that if you so much as scratch the camera, olympus can and sometimes does void your warranty.  At least this is what I was told on the phone, not sure how legal that is in Australia.In summary, If you want to take still life photos and can live with an autofocus that is useless for low contrast objects,  this camera's image quality is unbelievable.  For family snaphots, it's the pits.", "Date": "January 3, 2005"}, {"Title": "Great camera, other than the focus issues noted below", "Author": "David J. Elliott \"NewWaveDave\"", "ReviewID": "R17DIIE6SCYYPL", "Overall": "3.0", "Content": "I concur with the other reviewer in that when the camera manages to focus correctly, the pictures look great.  But be prepared to through out 30% of your pictures due to focus/blurring problems.  I to have tried numerous camera settings and have yet to find the magic formula.The 7Mb image size is great and the 30 times zoom are very nice.  Also, the camera powers up and is ready to snap pictures very quickly (much faster than any digital camera I have owned).  I am going to stay with the camera, but I am a bit unhappy with the focus problems that I have to deal with, especially in lower light conditions.", "Date": "June 4, 2005"}, {"Title": "Visually Blurred!", "Author": "D. Miller", "ReviewID": "RVK0G30ZC5NME", "Overall": "3.0", "Content": "This camera packs a lot of features into a small little camera.  However, the focus issue is HUGE for me.  I have little ones that I'm always photographing, and the auto focus issue doesn't cut it for us.  Family photo taking?  This camera isn't for you.  Even using auto focus mode (battery draining indeed), and using a flash indoors, you will take several pictures before achieving a sharp picture. In the meantime, your subjects will be temporarily blinded by the \"red light\".  (A big complaint from our family).  Not too great for those impromptu moments of catching your children's smiles and \"firsts\" on camera.After reading the other reviews, I think this one is not a keeper for us.  On a positive note, it does allow the experienced photographer to venture out of the \"box\", more so than most digitals.", "Date": "July 5, 2005"}, {"Title": "RAW format", "Author": "Vince \"orbhot\"", "ReviewID": "R2LLKW5LPE9E05", "Overall": "4.0", "Content": "Thsi is a correction to Mitchell Small's review and his comment about the Olympus Master software and TIF files where he states \"You can save the image as a JPG or TIF, but there is quality loss involved.\"While he is correct about images saved in JPEG format losing quality, TIFF is a lossless format. TIFF files are larger than JPEG of course but files converted from the RAW format to TIFF retain the full quality of the image. The TIFF compression scheme is lossless, meaning no information is lost and preserving the full quality of the original RAW image.You can read up on the TIFF file type at [...]", "Date": "July 5, 2005"}, {"Title": "Not a Novice's Camera", "Author": "83jagman", "ReviewID": "R3VS3NYEEWFXYL", "Overall": "5.0", "Content": "I for one love my Olympus C7000. I had one before that I felt so-so aboutbut then it was stolen and I tried out a few other brands and this is whenI realized how much I actually liked my C7000.Not being a currently produced item any longer, I embarked on a quest tofind a used one. Finding these proved not to be so difficult given theyare older models and lots of people try to stay updated with their electronicsplus the fact that a lot of Novices have purchased this camera for the greatbrand of Olympus only to find that using this camera is not as simple a justpoint and shoot.I am by NO means a professional but do understand some basic functionalityof cameras and after studying the very extensive owners manual that Olympussent with this model and even some feedback from others I began to understandhow to use this camera.Olympus really put a lot into the design of this camera. Being packed in whatI feel is a small package, they managed to pack in lots of functions that youwould only expect to see in a Professional camera. In fact I feel this camerashould have been marketed/promoted as a Professional Camera.Once you have it figured out, I would say the quality of the pictures is 2ndto none. I would put up any of the pictures I've taken, even at lower resolution,with those any professional would take.In the end, while not for everybody, I am VERY happy to be owning my 2nd Olympus C7000.", "Date": "November 11, 2010"}, {"Title": "review of c 7000", "Author": "Samuel Davis", "ReviewID": "R1LNEWRLOP4629", "Overall": "5.0", "Content": "in my opinion after using this camer for 2 years on 4 continents in all conditions , nothing matches it , it is as good as my nikon ,cannon film 35mm -not as fast but one can adjust-", "Date": "August 29, 2007"}, {"Title": "Good camera", "Author": "DejaLiyah", "ReviewID": "R2UD818BB2U6FC", "Overall": "5.0", "Content": "I bought this camera about a year and a half ago. This camera has gret manual features i can't be happier with them. This camera is not for someone who is only gonna take it out to bars or on camping trips just to shoot your friends and maybe some landscape. Every camera can do that well. This one is for people who like to play with manual settings and experiment in photography without paying $1000 for a huge camera with changable lenses, but also want the auto features for regular pictures.PROS Digital zoom is amazing i took closup of the moon although it's grainy no other digital camera can do that that i've seen. I used this camera to take photos of my 3D senior portfolio and out of 10 students my I was the only one not having trouble shooting great pictures! haha everyone kept asking what kind of camera i have. Panarama is great. Video shooting is great with sound, quality is very good. I even have taken photos with sound which came out amazing when i took a picture of a peacock and the noise it was making recorded as well. The premade Scenes are limited to :Portrait, Sport, Landscape+Portrait, Landscape, and Night Scene. I've used Sport and Portrait and landscape the most. Night Scene is useless to me it just turns the flash on for night shots which i dont like. I've used a trip pod with this camera to take pictures of NYC at night and they came out beautiful. Portraits come out great.Has features like SEPIA and Black and white shooting as well as rotating your pictures and editing them right on the camera (i dont do that)ISO goes from 80 to 400 newer cameras go up to 800Has the burst shooting by holding down the button it takes consecutive pictures until u take your finger off, great for sports so you don't miss a good frame.Brightness of the flash is adjustable and can be changed to Red eye reduction as well as 1st curtain and 2nd curtain flash (does that make sense?) Has noise reduction feature (on and off) you can turn the AF on and off.I discovered this recently it has MANUAL FOCUS which is great. sometimes the camera can't focus on what you are trying to shoot (if it's too close and its too dark) and you can manually focus it with your arrows! (takes a little longer though)White balance features : Light bulb, Clouds, Sun, and 3 manual ones you can set. You can adjust sharpness, saturation and contrast (before you take the pic)Macra and Super macra is AMAZING!!! i already posted some pics and i've taken lots and it hasn't failed. captures details you CANNOT see with your eyes!Languages: English, french, spanish, portugesecan change the volume on the camera or set it off. has shortcut buttons you can pick, date, pixel mapping, AE/AF: spot metering and ESP. of course timer to take self photoshas P for auto shooting. M for manual. S for just manual shutter speed. A for just manual Apeture. My Scenes you can set 4 of your own manual settings and it will remember them, Scene, Video, and playback.also has AEL dont know what that is yet lol.Cons:-This camera did not come with a case of any sort and they didn't even sell any separately. I had to buy a canon one!-It's bigger than most digital cameras out there, so i dont take it out much with me, its a hassle to carry around on a daily basis. But it's smaller than the big manual cameras which is great.-When shooting with limited light or indoors the autofocus focuses for upto 5 seconds just to pick up a focus. it's really annoying and takes too much time. Canon focuses REALLY fast even in low light and quality is better but i'd still pick this camera it's way more advanced.-Pictures with no flash indoors come out grainy.The Flash button pops UP when you turn it on which is kinda funny lookingI will be posting more pictures so look out for those :)", "Date": "December 31, 2006"}, {"Title": "Camera", "Author": "Donna Goutermont", "ReviewID": "R295AT5BP6V08E", "Overall": "5.0", "Content": "What can I say. I love this camera. Easy to use, takes wonderful pictures.I have used it for close up's as well as far away shots--I am very happy with this camera. I have had other digital cameras and the pictures were not as clear know matter what setting you had the camera on.It is small, light weight.", "Date": "March 23, 2007"}, {"Title": "I love this camera!!", "Author": "Kristy Ann Emerson", "ReviewID": "R1DKYP3YS5IV73", "Overall": "5.0", "Content": "I purchased my refurbished Olympus C-7000 about 5 years ago.  I had been looking for a nice, durable point-and-shoot that I could throw into a backpack on hiking trips, something tough that wouldn't fall apart if it got banged around a bit.  I must say, I couldn't be happier with a camera.  It's proven to be exactly what I was looking for.  The thing can take a beating and has never faltered in its ability to produce beautiful pictures.  It has some SLR type features (the ability to set shutter speed/aperature) that I didn't think I'd ever use, but ended up coming in quite handy.  It gives my Nikon D70 a run for its money.  Now, five years later, with the batteries tiring, I thought rather than replace them, I'd start looking for a newer camera with even better picture producing quality.Its replacement came in the form of a 10.1mp Nikon Coolpix, purchased on a whim because the price was unbeatable. What the heck, Nikon is a good name, 10.1mp...gotta be better than a 7.1mp camera built over 5 years ago, right? After trying some comparison shots I was immediately sorry!  My 5 year old \"obsolete\" 7.1mp Olympus put the new Nikon to shame.  Pictures clearer, colors better, macros sharper, overall MUCH less noise...setting for setting, the new Nikon just couldn't keep up with the dinosaur.My Olympus has produced beautiful poster sized prints.  The Nikon could handle a disappointing 8x10 before looking grainy and pixelated.  It was returned the very next day.I have decided to hang on to this treasure of a camera and invest in new batteries.  I'll wait to shop around for a replacement camera when this one dies.", "Date": "March 25, 2010"}, {"Title": "Tough Little Bugger", "Author": "David Mettenburg", "ReviewID": "R38CQS1MELGVA1", "Overall": "5.0", "Content": "I bought mine in 2005 after using a pretty cheap HP something. It's been a stalwart companion for nearly all family outings for the past 5 years (about).  I purchased a 1GB SD card after a year or two which greatly increased the storage capacity, but it kind of slowed down the responsiveness of the shooting (I think). There are many more adjustments on the camera than I have ever taken advantage of, the most useful I've found is the ability to adjust the flash intensity -- if I knew more about the technical details I might not have to take so many over/under exposed to get that setting ideal however.THe digital zoom is great. I've used the camera on more than one occasion as a sort of telescope.  If I can't tell what something is far away (or small) with the naked eye, I zoom in using the digital zoom and snap a picture.  The quality (given good lighting) is amazing on maximum zoom, and I'm usually able to see what the tiny little thing is at my leisure.I've not had any complaints about battery stamina.  The rechargable-ness of the camera is a key benefit -- and it's easy to pop the battery pack out, charge it up, and pop it back in.  I have used it on a number of times to take videos -- which is sometimes an option when the photograph doesn't come out.  If the camera is held still, and set on the \"indoor\" or \"night\" setting, it will take pretty good videos of kids at band concerts, etc.I do have to agree in some respects with the auto-focus comments of others.  For a while I never had a complaint, but sometime along the way I modified a setting and it seems to have gotten a little out of whack.  If you just depress the trigger button slightly, it will refocus pretty well, but by that time the 'kodak moment' may have passed.Our camera has been dropped, banged around, stayed in the car in the summer and winter without any ill effect.  In fact, one year I jumped in the lake with it in my pocket and it got wet.  I took the battery out, sat it in the sun for the day, and it fired right up and has worked fine ever since.  Even now, the battery door popped off due to rough handling and I've got a bit of duct tape (color coordinating) holding it in place and it just carries on.I'm thinking of passing this camera on to one of my kids and graduating to a digital SLR.  It's a hard decision though because quality/cost ratio is pretty hard to beat with this small and powerful little camera.", "Date": "November 28, 2009"}, {"Title": "great pictures when it works", "Author": "seagypsygirl", "ReviewID": "R1K5GTGXT8MW8Y", "Overall": "3.0", "Content": "bought this camera to replace a DX series Kodak.My thoughts:- I was excited, at first, by the manual controls, but disappointed by the difficulty of using the pre-set modes when in a hurry (who wants manual all the time?). The option for pre-setting 4 \"my mode\" settings is great, though.-  The color results are not impressive, I frequently find myself changing saturation and reshooting.- Battery life is not great and the battery is very expensive. You will need at least one extra at $35 a shot.  Also inconventient for international travel.- Finally, On two trips I have lost pictures when the camera has malfunctioned. Refuses to turn on and/or erases the XD card.- Did I mention the good picture quality? When the camera works and the saturation is controlled, the pictures are great.I have had the camera for 2 months now and it is on its way back to the store.  Good thing membership warehouses have generous return policies.", "Date": "November 8, 2005"}, {"Title": "Olympus C-7000 by Film Guy", "Author": "R. Bragassa", "ReviewID": "R29DVNJ51APJ7Q", "Overall": "4.0", "Content": "This camera has most of the features of my two well equipped Nikon FE's. It is a supplement and learning tool. Pluses: light; one unit not twenty; mostly complete; macro to tele; good price. Minuses: too small for my XXX hands (made a handle); No print manual; media & battery propritery. Has lived up to its promise and grows as I learn. Has usual CCD low contrast but I compensate easily. Would like to use filters but that's for the replacement camera.", "Date": "August 31, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "7.1-megapixel resolution for photo-quality poster-plus sized enlargements\n5x optical zoom lens combines with 6x digital zoom for 30x total seamless zoom\n2-inch semi-transmissive LCD features glare-reduction technology\nVersatile with 12 shooting modes and an array of manual controls\nTruePic TURBO image processor and PictBridge technology allow for quicker start-up, use, and printing", "Name": "Olympus C7000 7MP Digital Camera with 5x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/5142PPRHXJL._SY300_.jpg", "ProductID": "B0002ZUHB0"}}