{"Reviews": [{"Title": "Svat 60' Security Camera Extension Wire", "Author": "Kathy L Moneysmith", "ReviewID": "R3ILLGHURW3TG9", "Overall": "5.0", "Content": "I wouldn't have been able to use my existing security camera without this hard to find cable. A cable longer than this one might have degraded the signal. And without this cable,I would've had to replace the camera. I will look forward to making future purchases from this seller and am very happy with my product!", "Date": "August 21, 2013"}, {"Title": "A+seller", "Author": "Kevin Cox", "ReviewID": "R1D97OQTZQJQG7", "Overall": "5.0", "Content": "Great product fast shipping. A+. The Seller spld me a genuine Product not the grey market version. This will help me monitor my massive book and media  collection im selling. Thanks so much. Kevin of savyworld", "Date": "May 29, 2013"}, {"Title": "4 PIN DIN security extension cable", "Author": "Charlie Harper", "ReviewID": "RK21VCLD9AJOW", "Overall": "5.0", "Content": "I received the cable when promised. Good quality like the original cable, which I have had for four years now. I would recommend this for replacing your 4-pin cable or extending your camera range. I would advise protecting the 4-pin connection from the rain for a longer life. I use plastic heat shrink tape.", "Date": "January 14, 2013"}, {"Title": "WIRE FOR SECURITY CAMERA", "Author": "Molly", "ReviewID": "R1SMMX81OL93V8", "Overall": "5.0", "Content": "THIS WAS PURCHASED FOR OUR SECURITY CAMERAS AT WORK AND IT IS  A VERY GOOD QUALITY PRODUCT.  VERY DURABLE TO USE.", "Date": "May 26, 2012"}, {"Title": "Extra 60 foot!", "Author": "James Abraham", "ReviewID": "R2QMD9GXE3EGQQ", "Overall": "4.0", "Content": "Not much to say. Very nice cable about the same as the original in quality. Was shipped and received very quickly.Highly recommended.", "Date": "October 8, 2009"}, {"Title": "Good product", "Author": "A. Jordan", "ReviewID": "R1JOS7VGIY6PG4", "Overall": "5.0", "Content": "Not a whole lot to say about this, but it does what it's supposed to. We haven't had any issues and have been using it over a year.", "Date": "June 13, 2009"}, {"Title": "SVAT CVW62 60ft Camera Extension Wire", "Author": "Howard Riddle \"howeetree\"", "ReviewID": "R38RR5SIQOWSIB", "Overall": "5.0", "Content": "I had purchased two  SVAT CVQ1000 Color Quad Security System with 4 Day/Night Cameras, but I needed to move a couple of the cameras further away. So I found these 60 ft. extension wires. They worked great. Onlything I found I needed to do was to unplug the wire from the camera and plug this wire into it and extendedthe distance with this cable. Very well pleased with product and service. Howard WV", "Date": "May 22, 2009"}, {"Title": "Nice Product", "Author": "Joe", "ReviewID": "RR2YA3Y5I76S6", "Overall": "4.0", "Content": "Easy to install these cables, no splicing of any wires just plug into camera wire that came with the cameras and you have 60 more feet of cable.", "Date": "February 6, 2009"}, {"Title": "Video Cable Extention", "Author": "Paul Lafleur", "ReviewID": "R29ESSAMIOCU6S", "Overall": "4.0", "Content": "This product is great for extending the reach of a video camera, or routing the wire around and under things. Eleminating tripping problems.", "Date": "August 17, 2008"}, {"Title": "camera extension wire", "Author": "MATTHEW \"bar guy\"", "ReviewID": "RG977A5PSHBG4", "Overall": "4.0", "Content": "The wire works as promised, however the svat system that i ordered at the same time had a defective DVR, i was unable to record any of the camera system and had to return the unit for repair.  do not have the unit back yet, so cannot say how this will turn out", "Date": "January 30, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000W45766"}}