{"Reviews": [{"Title": "A fantastic camera better suited to the intermediate to advanced photographer", "Author": "tim can", "ReviewID": "R92PJ33L18V90", "Overall": "5.0", "Content": "First let me share that I purchased this camera because of the recomendation of a local professional protographer and haven't been sorry.  The manual controls are excellent and the auto features the most impressive I've seen on cameras running many times its price. For example:  face detection and smile detection works well, I love the manually aimed focus on a single user directed point in the viewing field, while remaining in auto focus mode.  Through glass mode is of questionable value and works poorly as expected.  The true optical zoom outclasses everything else right now although I expect Canon to quickly match or slightly exceed the 18 times zoom.All this technology comes at a price though and it is not in the price tag you take the hit, but in the fuction.  If you are looking for a point and shot camera for quick shots of the family or friends you are barking up the wrong tree!  There is a LONG delay for the auto range,focus and other features that make this camera so special to work so stop action - spur of the moment shots are not going to happen in full auto.  In manual focus the time from off to open shutter cycle and completed photo is impressively fast, but you have to know how to change from full auto and be competent at range focusing.  This is a trade off for the full auto - do everything modes.  There are faster stop action modes, but again there is a trade off of time for auto focus, as this setting is about shuitter speed.  The the burst quality is quite degraded to the point that a print of any size better than a standard snap shot may be hard.I am not trying to spoil a great camera for anyone, but this is a camera that by definition and fuction is designed for someone who wants manual modes available to them and plans to use manual modes frequently. It's placement in the point and shoot catagory is unfortunate because for many laymen - it will be frustrating rather than rewarding.  If you find a regular point and shot digial technically frustrating and want to take only snap shots, let me say it again, this is not a camera for you - there a number of better choices for less money. Like all optical zoom of any length a tripod is required in spite of image stabalization. Also video mode will work best with an H card rather than just the regular XDFor those of you who seek SLR-type manual controls with great optics and a superb auto mode then this camera is nearly impossible to beat.Biggest improvement over the Olypmus SP-550UZ is the high spead USB cable. Downloads are lightning fast! Frankly I can't really tell the difference in my type of shooting in the .9 extra megspixal upgrade from the 550A fantastic camera for under 375 dollars purchased through Amazon - who by the way increases the price of this camera during the daytime hours to over 400 and reduces it at night/early am hours - go figure when you want to buy. - Added on 11/8/07:  Now that this is not a brand new, just released camera, the price is coming down.  Nevertheless I would check at different times to see if you find a better price here at Amazon.  It does continue to change.", "Date": "November 3, 2007"}, {"Title": "Caveat emptor the Olympus 560!", "Author": "Abi Gezint", "ReviewID": "R17ZQAXOSEATP6", "Overall": "4.0", "Content": "This review REPLACES a negative review I'd posted, based upon insufficient knowledge of the camera:I got up this morning at about 4:00 AM thinking about the disastrous shoot I'd had at a party the other night with my new Olympus SP 560, the camera that was supposed to the the PARTY CAMERA OF MY DREAMS! On at least two occasions, the results were just awful, and I couldn't believe that Olympus had put out such a lousy box. After thinking it over and over I came to this mind-boggling possibility: could it have been (gulp, gasp) ME??? So I got out of bed and proceeded to do a series of low light experimental shots in the house. What I did was to (first) set the camera on spot-metering and then on center-weighted metering and proceed to take a series of side-by-side shots of first ISO AUTO and then the identical shot at HIGH ISO AUTO.When they say you must get to know this camera, they aren't kidding. For such a little squirt, the SP 560 has a lot of things in it that can not only enhance your picture-taking, but can throw you off as well.Bottom line: to avoid chaos in trying to take good pictures in low light situations, MAKE SURE that you NEVER use the ESP meter setting! If you have inadvertently chosen this setting, the camera decides that it knows more than you do about what you're trying to focus on and MAKES THE DECISION FOR YOU. If you're trying to focus on one thing and the camera decides to focus on something else, you're going to pull your hair out.SO -- when you first turn on the camera make this your standard routine: (1) choose your shooting mode (I prefer the P mode for instance), and (2) THEN PRESS THE OK/FUNC BUTTON TO CHECK THE CAMERA'S SETTINGS. This brings up a toolbar along the bottom of the screen, and a stack of settings icons in the lower left-hand margin of the screen. MAKE SURE YOU HAVE THE FOLLOWING SETTINGS (listed from top to bottom) when intending to shoot in low light situations with the camera on auto settings:WB AUTOISO AUTO (or ISO HIGH AUTO)SINGLE FRAME (a picture of a rectangle)CENTER-WEIGHTED METERING (a rectangle with a white dot) or SPOT METERING (a rectangle with a black dot).If you have the metering setting at ESP, CHANGE IT TO ONE OF THE OTHERS, or you'll get a massive headach as well as terminal heartburn trying to get the camera to focus on what YOU want it to. I can't emphasize this enough: the ESP setting is the SETTING FROM HELL, if you don't realize you've chosen it!The other thing is the AF assist lamp:In dim light situations, the AF lamp is blind to things with horizontal line patterns, and may hunt and hunt and not focus. TURN THE CAMERA to somewhere between 45 degrees and vertical to remedy this. In this turned position,  get the focus locked, then position the camera for the shot and proceed accordingly.In addition, if you are focusing on something so dark that not enough light is thrown back to the camera, it will not lock. Same thing if you're so far away from the subject that the light is too dim for the focus to lock. So beware of all these things and compensate accordingly.I put the shots into Adobe Bridge to see what the camera was doing settingwise.In ISO AUTO, it was choosing no higher than ISO 400. That meant a slow shutter speed. That meant holding my breath with my body locked while bracing the camera against my nose while the camera took the shot with a 1/2-second exposure. In HIGH ISO AUTO, it was choosing no higher than ISO 800. This got me a much better shutter speed (around 1/25-second) and a somewhat brighter picture, that was somewhat more noisy, but still acceptable for a VERY DIMLY-LIT shooting situation. It still means some Photoshop surgery, but not totally useless pictures!The bottom line: MAKE SURE you don't use that ESP metering setting; it's a disaster -- at least in dim light. Since the camera doesn't go beyond ISO 800 on its own, you probably shouldn't do it on your own either. Those higher settings -- and I once did an entire dim-light shoot on ISO 3200 -- are worse than useless -- your entire effort is trashed.I now upgrade my camera review from two to four stars. A very good camera IF you know what settings to choose and what settings to avoid. (Why not 5 stars? Because I had to go to so much trouble!)", "Date": "December 28, 2007"}, {"Title": "Excellent build, but mediocre picture quality", "Author": "Jonathan Birge", "ReviewID": "R3FCPN5S6D2JMZ", "Overall": "3.0", "Content": "I switched to this camera from a Canon A610 that died on me. The first thing I noticed with this camera is that the picture quality on my $200 Canon was better or equal than this $400 camera. The dynamic range is terrible, with skies often washed out to white. Like many \"super-zoom\" cameras competing on specs, it makes up for noise and dynamic range limitations in its small CCD by over-processing, and the images show signs of heavy noise reduction filtering, washing out details. Granted, this isn't a DSLR, but this isn't a cheap camera, either. It appears that they really pushed the boundaries of the CCD to get 8 MP, and used too small a CCD for this resolution.One thing I will add, after doing more research, is that this problem appears is common to all recent cameras in this market segment, such as the Canon S5. They are pushing the pixel counts so high, and the zoom ranges so far, that optical quality is suffering as a result. (See [...] for more explanation of why.)Another issue I found is that the autofocus algorithm is rather slow, especially at long focal lengths, and it often has difficulty with any scene movement. Worse, it will sometimes tell you it focused successfuly when it didn't. Part of this is the zoom, I'm sure, but my experience in this regard is backed up by some very in-depth reviews on dpreview.com.I'm sorry to offend the Olympus fans around here, but Olympus engineers can't violate the laws of solid state physics, and smaller pixels means less photoelectron capacity, and that means less dynamic range. Smaller pixels also means less signal to noise, and it shows. The fact of the matter is that they have pushed the pixel count too far for the size of the CCD, and you will get better images from a camera with fewer pixels, ironically. I have nothing against Olympus, or I wouldn't have purchased this. Glowing, breathless reviews by people who are so inexperienced they are amazed at mediocrity aren't useful. I'm not saying don't purchase this camera in particular, as I'm suggesting this class of camera is just not worth the money.On the bright side, the build quality is supurb. Much better than the Canon S5, which I initially considered. The camera has a nice heft and a very solid feel in the hand. The materials are high quality all over, the one exception being a cheap and annoying rubber cover on the USB port.Another high point is the zoom and image stabilization. The range is exceptional, and essentially gives you everything from a wide-angle to a medium telephoto. Unfortunately, the cost of this is a lens that does not perform well at the extremes: at wide-angle its highly distorting, and at telephoto lengths there is significant chromatic aberration (color fringing) off center.In summary, I'd say Olympus followed the crowd (maybe led it) by putting way too much effort into specmanship, and less into making the right engineering decisions. They clearly wanted to have 18x and 8MP printed on the box, and considered image quality a secondary concern. This may be endemic to all the brands of super-zoom cameras, but it doesn't change the fact that you don't get your money's worth where it counts with this camera: image quality. This is a huge shame, because in most every other aspect this is the nicest camera I've ever used.My advice: if you need the resolution afforded by 8 MP, you need to just suck it up and buy an SLR. Only they have large enough CCDs to handle such resolutions adequately, and this applies to all brands, not just Olympus. Otherwise, just get a 5 MP camera. The images will be just as good, if not better, and you'll save a lot of money.", "Date": "November 17, 2007"}, {"Title": "So Far So Good", "Author": "YelleBelle", "ReviewID": "R1CZHPZDW4KD4I", "Overall": "5.0", "Content": "I've only had this camera for a day, but I thought I'd post an early review since there are none up yet. I was reluctant to buy this camera because it is SO new, and I generally prefer to wait for reviews to be in, but the 560 had so many interesting features I decided to give it a try. So far I'm glad I did. I've only been taking trial snapshots around my house to become famliar with the camera, but they're all coming out beautifully; very sharp, rich colors, no visible noise. Even low-light and high-zoom shots have been surprisingly good. The pre-programmed settings and other features (of which there are many, you should check the porfessional reviews to see them all) are really useful and I think some of them are unique to this camera right now.The design is great if you don't mind pushing buttons often. I looked at other cameras that had easier access to different settings, but were crowded with buttons. The 560 has much fewer buttons cluttering its surface, but that means more button pushing to get things done. I'd rather do that than have all that clutter on the body, but others might not. It's also small, lightweight and fits nicely in my hands.I don't really know yet if this deserves 5 stars, so I might revise this after I've had some time to take pictures outdoors and generally use it more. As of now I'm very satisfied all around. I bought it from a reputable online store with good independent reviews for about $380.", "Date": "November 1, 2007"}, {"Title": "Olympus SP-560UZ Review", "Author": "R. A. Norris", "ReviewID": "R2LW6RIN2OM3MR", "Overall": "5.0", "Content": "Put simply a great camera that consistently produces high-quality pictures. This camera approaches SLR quality.Good Points:1. On AUTO setting takes great pictures. The others take some work.2. Many options for getting the right picture.3. Great view screen visible in daylight.4. Two Levels of macro for up close.5. Shadow correction.6. Battery life even with the flash is great!7. Uses AA batteries. I recommend NI-CAD OR NMH for long life.8. Very comfortable in the hand. Weight not an issue.Not So Good Points:1. Not a simple point and shoot. Need to be a mid to high level user.2. Doesn't remember your personal settings when turned OFF. Have to reset.3. Requires XD Memory Cards which are more expensive then SD.4. Has a special adapter plug for USB download to a computer.5. No off-the-shelf 47MM lens like Skylight, UV, etc. Need to buy an Optek adapter and 58MM lens set (no cap).", "Date": "December 23, 2007"}, {"Title": "I love this camera", "Author": "T. Mulligan", "ReviewID": "REVP5KRYG83IG", "Overall": "5.0", "Content": "I am a huge canon Elph fan.  I think they are great portable camera, that take great photos.  But, the zoom on the canon are virtually non-existant.  My son is a swimmer and I could never get action shots of him swimming because I was too far in the stands.  I was at a swim meet and the women next to me had the Olympus 550uz.  I was watching her zoom across the pool to take pictures of her kids.  I was amazed.  I asked her about her camera and she started showing me all of the neat functions it can do.  I was very impressed.  I came home researched and compared various cameras along with going up to a Canon Rebel.  By the time I was finished I came to the conclusion that this camera was for me.  By far it has the longest zoom out of all of the point and shoot cameras.  I have been using my camera for about 2 weeks now.  I love it.  I took it to a swim meet and the shots I got were amazing.  I did the scn #17 rapid shot and am able to take 40 frames simultaniously.  It was incredible.  I was then able to pick and choose the shots I wanted.  The zoom was great.  The pictures were not grainy or out of focus.  I do have to say it is a lot of camera.  It has functions that I will probably never use.  It has settings that I am not familiar with, but I like auto, so it works for me.All in all, I will take this camera for any kind of event that I would need action shots and a zoom.  My Canon Elph will go on vacation just for ease of use and carrying size.", "Date": "January 5, 2008"}, {"Title": "Olympus SP-560UZ", "Author": "D. Neumeister", "ReviewID": "R1W2D0IZ0C2DGG", "Overall": "4.0", "Content": "Worthwhile upgrade from previous 10X Olympus. More zoom, faster, easier to find functions, and more features. Still trying to get used to scene-based shooting and deciding right mode -- especially for indoor shooting (images fuzzy). Not convinced how good image stabilization is yet -- sports mode in past seemed to work better.", "Date": "February 26, 2008"}, {"Title": "Great Camera still learning how to use all the features", "Author": "Diver Down", "ReviewID": "R1CM4W63JY9HV8", "Overall": "4.0", "Content": "I bought this camera along with the Olympus Underwater housing so that I could try my hand at underwater photography. Using the preset underwater modes it take pretty good pictures. I would like to add the external flash to bring out more of the colors. Topside photos are excellent as this camera has plenty of features including RAW image format and an 18x optical zoom. I am still learning all of the features and preset modes along with setting up manual modes and saving them to my favorite settings list. It also has a nice panorama feature and with the included software will stich the pictures together for a seemless panoramic shot. As for underwater the lens has a wider anglel than some of the other cameras in the same price range which is important for U/W photography. Overall it is a real nice camera with plenty of features to keep me busy for a while. I would recommend it for both topside and U/W photo-taking.", "Date": "January 19, 2008"}, {"Title": "Difficult to Use at First", "Author": "April Wininger", "ReviewID": "R2AHDDKICBZ541", "Overall": "4.0", "Content": "This camera makes good pictures and has lots of functions. I purchased it because of the awesome 18X optical zoom. I had a 12X zoom that made wonderful photos and I thought these would be even better. In time my action pics have gotten better. There are so many bells and whistles, it is difficult to make quick shots. It is more camera than I bargained for. I think with practice and study my photography will return to what it was with my previous camera, but there is a lot to learn.", "Date": "December 12, 2007"}, {"Title": "New Model sp-570 Comming Soon", "Author": "Leslie Wright III \"Law4u911\"", "ReviewID": "R1G5OA4SLLIKZE", "Overall": "4.0", "Content": "I've had this camera several days now and so far so good.  Right out of the box, the sp-560UZ feels like a quality piece of equipment - my wife (no techie) immediately commented on how great the camera felt and looked.My first several photo sessions with this camera went well - especially the outdoor ones on the beach and the macro pictures I took of our wonderful California winter flowers.  If you have owned an Olympus camera before, the basics of this camera will be familiar and you can take decent photos right away on the auto settings.  This camera also allows for plenty of manual adjustments (ISO, Aperture, shutter speed) which I find myself using a lot with this camera. Focus seems to be a bit of a challenge but I am getting the hang of it - any camera in this class takes awhile to get to know and this one is certainly no exception.  Also - I think a mono-pod is a good addition to this camera unless you have a really steady hand - on the really long zoom shots it is really hard to keep the camera steady and the mono-pod helps a lot.Because of that, I would rather wait a few weeks to write this review - However I wanted to let buyers know that when I registered this camera on the Olympus site, I learned that Olympus is adding to this line with an SP 570UZ that will have 20x zoom and even a wider angle lenses.  Buyers may want to wait for the newer model - or take advantage of the lower prices on this great little camera.My only real complaint so far is that the RAW mode requires the use of the included Olympus photo editing software to open and edit the RAW files.  In this camera the RAW files are save as a .olf file and not a .raw file.  The .olf file can not be opened in Adobe Photoshop and can only be edited in RAW mode in the Olympus RAW editing program.  This is ashamed since while the Olympus software is alright, it is in no way as complete as Adobe Camera Raw contained in Photoshop. Get with it Olympus - minus a star for this silly proprietary silliness.", "Date": "January 24, 2008"}, {"Title": "Extraordinary Camera", "Author": "Robert Sizemore \"Robert\"", "ReviewID": "RUH29N89P3BYZ", "Overall": "5.0", "Content": "I read all the reviews some good some bad, but it is a new camera so not enough of it is out there yet. I meant to get a professional camera and looked at my options from highly rated Cannon to Kodak who is falling way back from what their reputation used to be. I chose this because of the awesome zoom, ISO capabilities sure there is noise at high levels but test that noise with another camera it's much worse, and Cannon only achieved ISO 1600, Olympus 3200. I love Super-Macro four tenths of an inch, at 8 mp can make an extraordinary picture. This also has the highest rated processor out, true pic III. Modes and time does not reset with batteries out I hate reseting everything after charging batts. Face detection works very well, also smile mode. I also love if you have ever accidently pressed shutter down all the way instead of half way so you get an unfocused picture, it focuses before everyshot. Every little thing adds up to big things for a big camera, to get the \"Big Picture\" literally. So don't settle for second best, this camera is just as good if not better than most \"average SLR's\" I say this cause some are unbelievable if you have over 1 thousand dollars.", "Date": "December 3, 2007"}, {"Title": "Olympus SP-560 UZ Digital Camera", "Author": "David B. Merrell \"Old English Prof\"", "ReviewID": "R3QPD4YH5KQKJV", "Overall": "5.0", "Content": "Olympus SP-560UZ 8MP Digital Camera with Dual Image Stabilized 18x Optical ZoomA professional photographer in town recommended that I consider this camera seriously. I have had it about a month and am really pleased. I took available light photos at a party; they came out beautiful. Of course, it has so many features that I have not used all of them in a month, but I like being able to move from automatic (point and shoot) to specific situational automatics, to controling aperature or speed or both manually. It matches closely the control I had with my best 35mm film camera. The resolutions available will allow enlargement or even projection. It's not a pocket camera, but not excessively bulky. I endorse this professional's recommendation fully.", "Date": "December 28, 2007"}, {"Title": "Does it all, if you can figure out how.h", "Author": "Lawrence Ross", "ReviewID": "RI3PU3QH2IZZA", "Overall": "4.0", "Content": "I've been using this camera for about a month, inside, outside, and underwater.  Having a wide-angle lens built-in is great, and the 18x zoom gives it versatility.  The features of this camera a too numerous to mention here, and while many are easily accessed, there are lots of features buried deep in the camera's menus.  You'll want to keep the owner's manual handy when using this camera.  Some problems - the higher ISO settings (1600, 3200) are very grainy, and the storage of RAW shots takes so long that you can only really use it for posed shots.  And file this under \"quirks\": if you set \"fine zoom\" to \"on\", you can't shoot in the camera's highest resolutions, just standard resolution.  All-in-all, it's great camera.  It's not SLR quallity, but it's not SLR price either, and the underwater housing is about $1000 cheaper than an SLR housing.", "Date": "December 22, 2007"}, {"Title": "Disappointed", "Author": "Keyser Soze \"Treasguy\"", "ReviewID": "RS5R5R5XFFALN", "Overall": "2.0", "Content": "I have been eagerly awaiting the release of this camera and purchased one as soon as I could.  Disappointed!  The professional reviews I read were on-target, however, my experience with the auto-focus and color electronic viewfinder (EVF) were not up to what I was expecting.  I currently have a Sony DSC-H2 and a DSC-F717 before that, so I'm comparing the Olympus to my experience with these two cameras.  The auto-focus did not have a high level of consistency in focusing properly/sharply.  Too many of my pictures were slightly or way-out of focus.  With my Sony's, the auto-focus is highly consistent - only an occasional picture is out of focus.  This is what I've come to expect with any camera.The SP-60UZ's color electronic view finder seemed primitive (again, in comparison with the Sony).  It looks like a 'cheap TV' picture and not a true representation of the image you are taking.  Because of this, it looked like all of my pictures were in-focus, but the resulting image was not.  So the EFV was no help in determining if the camera was focused or not.  I'm not going to spend a day taking pictures only to find-out afterwards that a high percentage of them are not focus properly.The images that were in focus looked spectacular so image quality is what they say in the pro reviews.Anyway, I was hoping for a new 18x super-zoom with great image quality and was disappointed in the camera I received.", "Date": "December 3, 2007"}, {"Title": "A great camera for all advanced shooters", "Author": "Norman Eng", "ReviewID": "R283NS3L1N0C9V", "Overall": "5.0", "Content": "The SP-560 represents a fine progression in Olympus' line of ultra zoom cameras. The three principle changes are the 18x zoom lens, the solid magnesium alloy body and the increase resolution to 8MP. Among the other changes is the ease of switching to a 2 second self timer which makes time exposures a simpler task. Scrolling through the extensive menu is easy and fast and allows a complete array of professional features such as flash exposure compensation. Image stabilization has yet to be throughly tested but my experience has been that stabilization is a gimmick that is a poor substitute for a tripod. A slightly higher flash does reduce red eye and the 18x lens adds inevitable heft and length, but it's negligible when compared to the old film SLRs. As a long time Olympus owner I'm very satifsied with with this new camera.", "Date": "January 3, 2008"}, {"Title": "great camera for the price", "Author": "pet doctor \"dave\"", "ReviewID": "R2FSVIREPKXAW6", "Overall": "5.0", "Content": "With only limited use so far, I've been impressed with camera.  So far I've only used the auto mode, but have some great close-up/zoom shots of humming birds, pelicans and landscapes etc, and the macro works well too.  The zoom is very impressive, especially for a point and shoot.  Colour reproduction is good, and the Olympus software helps optimize the colours on pics that seem a little \"off\".  One complaint is indoor, low light pics without flash - tend to blur (fine if using flash).  I think once I get used to the manual controls I'll see more versatility.Overall, I think this is a great camera - an 18x zoom for less than $400 is hard to beat.", "Date": "December 17, 2007"}, {"Title": "Great Little Camera", "Author": "Y. Zahir", "ReviewID": "R1AA9UY2A69BDK", "Overall": "5.0", "Content": "I've had this camera for about 6 month, and I love it!  It's simple to use and the pictures come out great!  I highly recommend it.", "Date": "June 27, 2008"}, {"Title": "The Olympus SP-560UZ is an amazing camera", "Author": "Jessica R. Bloomer", "ReviewID": "R37ZA62ZOGF71W", "Overall": "4.0", "Content": "I recently bought this camera for myself and it is exactly what I wanted.  It has a nice grip encasing that makes it easy to handle.  It also has an amazing 18x zoom feature and takes gorgeous macro pictures.  The menu features are very easy to find and understand once you get used to them.  I would recommend this camera to anyone that loves to take good pictures, amatuer or experienced photographer.", "Date": "February 1, 2008"}, {"Title": "The most Beautifull Photo", "Author": "Edlios", "ReviewID": "R3B6CAT9GVWB2X", "Overall": "5.0", "Content": "I have a lot time with this camera but the image quality could say everything about they. I get photos so clear, very very clear. This is my best upgrate since the SP 500. I purchase this camera because my older camera (the sp510) haven't image stabilization. But this.. is more than i expected. I really love this camera. but not all is good. In auto mode the ISO Level can be SET very high (400-800 automatically) and this provocate blurry photo. The image stabilization dual really work very well. The auto-focus may be slowly and somethings and the objective its not clear as possible you want. for elsewhere don't have any dissapoint about they. About, the video Quality i really think that's very poor comparate with the quality of the SP 510.", "Date": "December 26, 2007"}, {"Title": "love this little bridge camera -  super superzoom", "Author": "Peter Braun \"book neophyte\"", "ReviewID": "R3B7O81EE9WUO4", "Overall": "5.0", "Content": "love this little bridge cameraMy Olympus 560 replaces an old 10x Olympus c 740.I love the extra 8x of zoom.  This 18x zoom has greater range than any lens I could buy for my SLR.When I go on vacation, I will bring 560 superzoom and not my SLR.It is so small and light.  Great for hiking and nature photos.  It is almost too small.The build quality is excellent.  I have pride of ownership with this camera.The LCD is much sharper than the LCD display on other cameras.  The hypercrystal technology works.I appreciate having a separate door for the xd card.Note: I do not like having to use xd cards.  They are a tad higher in price than SD cards, and harder to find in large sizes. They are also probably slower than SD cards.  I think that Olympus allows the use of SD or micro SD in their newer cameras, which was a smart move on their part.I'd love to upgrade to the 26x version, but above 500 mm, I think I'd have to use a telephoto, and I prefer hand holding.  At 18x, I have taken some sharp nature and bird photos.  The image stabilization built into this camera works.Overall, this camera takes great shots.  I have had some issues with the auto-white balance, but I just need to set WB manually.This camera is worth every penny.  The lens is as standout lens.  Super range, super fast, with good resolution.  I would buy this camera again.Last note.  I do not like its wrist strap.  Would much prefer a neck strap.  Will have to look for neck straps that can fit on the tiny openings.", "Date": "March 3, 2013"}, {"Title": "Love this camera", "Author": "Sharon Ross", "ReviewID": "R26Q48GNIEDC0T", "Overall": "5.0", "Content": "This camera was a replacement for a camera I broke and used all the time. I ;love this camera and I was so impressed that this was a used camera but it was like new. I take hundreds of pictures at a time at a Cat Rescue and this is a good size and easy to use. It's like an extension of my eyes so I caan share how I see the world.", "Date": "February 3, 2013"}, {"Title": "Could be better", "Author": "JOSE MACHADO JUNIOR", "ReviewID": "RSNHIGSI0F21U", "Overall": "3.0", "Content": "I bought this camera a while ago and just few months ago (maybe 4) it started showing \"Zoom Error\" when it was t=urned on and shutted off by itself.Fixing it would cost almost as much as buying a new one.", "Date": "March 9, 2010"}, {"Title": "I love this camera!! Beautiful pictures...amazing zoom!", "Author": "Kat Dawg", "ReviewID": "R2EP6PMD0PZJ4K", "Overall": "5.0", "Content": "I LOVE this camera..I bring it everywhere with me, it's an extension of my arm lol.I find the best pics don't come on the highest quality settings, but the level just below (depends what mode you're using). Took spectacular pictures on my recent trip to Cape Breton. Lifelike colours.I love the zoom om this camera. I will be upgrading to the new Olympus UZ with a 30X zoom.This is a great camera is you want to save some money...GET THIS ONE instead of the new 30x zoom...it is just as fantastic!", "Date": "February 14, 2010"}, {"Title": "Sencillamente una Joya", "Author": "Luis P", "ReviewID": "R1N6DPUC96UXYH", "Overall": "5.0", "Content": "La SP-560 UZ, es una joya desde todo punto de vista no encuentro algún detalle verdaderamente significativo que opaque este producto. Para conseguir otra cámara mejor quizás sea mejor pasar de una ULTRAZON a una DSLR de una vez por todas. Ya que con esta cámara estas trabajando al borde de un equipo profesional reflex aunque con ciertas reservas y con una enorme versatilidad. Recomendados para todos los que se quieren iniciar seriamente en la fotografía y para el profesional que necesite un equipo versátil y ligero que puede ser usado quizás como segundo equipo de apoyo y de costos mas bajo.", "Date": "June 25, 2009"}, {"Title": "Absolutely Amazing", "Author": "W. Walsh \"Walshy\"", "ReviewID": "R1DE8SYIVUFTO1", "Overall": "5.0", "Content": "Bought this camera as an upgrade to what I had. Nikon 4 megs. Easy to use and the quality of the pictures are fantastic. For this amount of money, what a bargin. This was my first Olympus and it won't be my last,", "Date": "September 28, 2008"}, {"Title": "Olympus SP-560UZ is GREAT", "Author": "Gary Morton", "ReviewID": "R1LRSKQN047SHK", "Overall": "5.0", "Content": "I've had my SP-59UZ four months.  I've taken several hundred photos during this time.  The camera takes excellent photos and is very easy to operate.  The optical zoom and image stabilizaition are GREAT!  I highly recommend this camera.", "Date": "August 9, 2008"}, {"Title": "No Focus / No Support", "Author": "Jim Cobb", "ReviewID": "R2FALRLSB7Z4JR", "Overall": "3.0", "Content": "Very disappointed with Olympus. I own 2 other Olympus cameras and was very satisfied, bought this camera and after shooting several hundred exposures was not satisfied with results only about 25 % of shots were in focus. Contacted Olympus with my concerns, but they never returned my inquiry. Sent camera back to 17 Th Photo and purchased a Cannon S5 IS. 17 Th St Photo is an excellent retailer and the Cannon S5 IS, in my opinion is a much better camera.", "Date": "June 19, 2008"}, {"Title": "Olympus sp-560uz Ultrazoom Camera", "Author": "A. Thomas", "ReviewID": "R1XGCM8EHB0HRT", "Overall": "5.0", "Content": "Great camera! I've Had Several olympus cameras analog and digital. The 560 ultra zoom does it all. Just finished ordering a high speed memory card for this camera so I can take better action shots. This Camera is well worth the money.", "Date": "June 2, 2008"}, {"Title": "Very happy with the Olympus SP-56UZ", "Author": "Clayton E. Kitchin \"clayfromak\"", "ReviewID": "R35TKW6KY86IRN", "Overall": "5.0", "Content": "This camera is packed with features that make all my pictures come out great.  It even has a help menu that sets the camera up for the situation you are shooting.", "Date": "May 22, 2008"}, {"Title": "Watch out ... Stay away from Olympus", "Author": "John J. Durcan \"JD\"", "ReviewID": "R1GR6CNJMKQD28", "Overall": "1.0", "Content": "I picked this camera up thinking that I would give Olympus a try after having used Cannon equipment for years.  The camera worked fine for about two years and then started to have an intermittent lens error message.  I decided that I would send it in and started the repair process.  Without mentioning any charges prior to the camera return, I was told that I needed to pay @$175 in order to open the camera for review - The bells should have gone off when I heard this and had them return it without repair.  long story short... I went ahead with the repair, my credit card was billed, the camera was returned, and the camera continues to have the same error.  Olympus refused to refund the cost of the repair (quote from the service manager - \"you can return the meal at a restaurant after you have eaten\" seems to me I was billed and never received the meal).  What a joke.... Save yourself the time and aggravation and stay away from Olympus.", "Date": "August 12, 2011"}, {"Title": "More that enough", "Author": "Kenneth S. Pierce", "ReviewID": "R236U1T7TA3TUW", "Overall": "5.0", "Content": "This camera is capable of taking great picture, close to professional. But rest assured that it has more computer than my computer. Finding you way around in the setup is not too bad for those used to camers , but could scare a newby. If what you want is a simple point and shoot, I would suggest a lesser camera. If you will take time to learn it, it can take pictures equal to the best.", "Date": "January 6, 2008"}, {"Title": "Olympus SP 560-UZ Digital Camera", "Author": "Sharon A. Green \"Sharon\"", "ReviewID": "R1P1IBEK5GAMW4", "Overall": "5.0", "Content": "I love this camera. It has sooo many features. I am enjoying learning to use them.", "Date": "May 9, 2008"}, {"Title": "Great Camera!!!", "Author": "Jim", "ReviewID": "R1D4Y3O7I147C4", "Overall": "5.0", "Content": "I love this camera. It has the features you need to take great pictures. I've had 3 advanced point and shoot cameras and this one is by far the best. Olympus rocks.", "Date": "May 4, 2008"}, {"Title": "First Ditital Still Camera", "Author": "G. Brunjes \"Dick\"", "ReviewID": "R1O720AFU74UJY", "Overall": "5.0", "Content": "I had put off buying any digital camera until the resolutions would produce crisp accurate large format prints. (6+ MP). When this qualitybecame affordable......, the cameras also became too small for my large hands. I was also used to Video zooms of 20X or more and I did not want the cost, size or weight of SLR. This Olympus has everything I wanted at a very reasonable price for high quality abundant automatic and manual settings, high zoom range and fine image reproduction.Olympus SP-560UZ 8MP Digital Camera with Dual Image Stabilized 18x Optical Zoom", "Date": "February 14, 2008"}, {"Title": "Not the best camera for the real estate professional", "Author": "Suzanne White", "ReviewID": "RKC4D0BG3CJ24", "Overall": "1.0", "Content": "I purchased this camera because of the Bright capture technology since I do a lot of pictures of the inside of homes, I also purchased it because it had in camera panorama which is perfect for my virtual tours of homes.  However, none of the great features of this camera work when the camera is set to panorama mode.  In panorama mode you get black pictures, impossible to edit even in Photoshop.  When shooting the shots I set the camera to indoor and proceeded to take the pictures from left to right, of course the first shot had to be the window so when turning the camera to catch the rest of the room it was set for the lighting of the window so the rest of the room was dark.This camera is also capable of using the flash with each shot, except, when you are in panorama mode.  If you point the camera towards a darker section of the room for the first shot, it automatically sets to take that section perfectly, however, when you get to the window you have an atomic bomb going off outside the window.  I get great inside shots with this camera as long as I don't use the panorama feature which is the main reason I bought this camera over the Cannon.Another note, when you take a picture using the viewfinder and not the monitor, the picture is previewed on the monitor and not the viewfinder where you're looking so you have no idea of how the picture came out when using the viewfinder until you download the picture to your computer or preview them on the camera.  All of the pictures taken through the view finder look great but the final result is not.  Everything I read about the camera sounded perfect for my business, if all of its features worked in panorama mode it would be the ultimate camera.  Overall, I am very disappointed in this camera.6/10/2008 - Contiuning problems with this camera, it has a serious problem and cannot be depended upon to take pictures when you need to. It gives me a \"zoom error\" then shuts itself down. It is now back at Olympus for repair the third time with the same issue. This time they received it on 6/3/2008 and didn't even look at it or log it in until 6/5/2008. When I call they won't give me any answers. Support is terrible, do not buy this camera you will be sorry. This camera has spent more time in repair than I have had it to use.  I will never buy another Olympus camera again.", "Date": "November 25, 2007"}, {"Title": "Olympus SP-560UZ", "Author": "Robert Elzey", "ReviewID": "R24KD8USF14CO9", "Overall": "5.0", "Content": "The Olympus SP-560UZ is the best digital camera I have ever owned, I don't think you could get better pictures with any price camera", "Date": "January 18, 2008"}, {"Title": "old horse learns new tricks", "Author": "Billie E. Harrison", "ReviewID": "RQCETCL3BRDF6", "Overall": "5.0", "Content": "I purchased an Olympus sp-560 as an upgrade to a previous Olympus purchase.  I wanted the face ID and picture burst.  The camera is one of the best that I have ever owned.", "Date": "December 28, 2007"}, {"Title": "olympus SP-560UZ Digital Camera", "Author": "James Clark", "ReviewID": "R2P8ODNXNYY0UB", "Overall": "5.0", "Content": "This is an excellent camera, if you are just starting out or if this is an upgrade from a previous digital camera. The price makes this camera worth a serious look, and the quality of the pictures cinch it.", "Date": "December 11, 2007"}, {"Title": "Olympus SP-560UZ 8MP Digital Camera", "Author": "Zella_Doula \"Zella_Doula\"", "ReviewID": "R1W93KCKXA08FJ", "Overall": "5.0", "Content": "got this item fast, and when it did not work, they had me mail it back free and sent me another one very fast as well...thanks and I love the product !!!!! This item does what it says...it takes wonderful pictures!! I have had a  digital camera for years and mine was going bad...so got this one after careful study.... it is an excellent camera..and the guide on the camera is the best!!! it is easy to use and fun to play with...haven't used all the features yet, but I am sure they will be equally sufficient. I am glad I picked this camera!!!", "Date": "December 29, 2007"}, {"Title": "Olympus  SP-570UZ", "Author": "Alfred Martz Jr. \"AL MARTZ\"", "ReviewID": "R2CZKN6Q02NGVU", "Overall": "5.0", "Content": "Olympus SP-570UZ 10MP Digital Camera with 20x OpticalDual Image Stabilized Zoom  This canera is teriffic...easy to use...good battery life...great zoom ! Easy to carry...has great camera settings i.e. \"SCN\"  All controls easy to use.excellent menu,etc.", "Date": "April 17, 2008"}, {"Title": "fantastic", "Author": "mohikan \"crazy_eng\"", "ReviewID": "RK05E9T8RTUTO", "Overall": "4.0", "Content": "i have recently bought it. took a few pictures.it has really a good design and finish.do not expect high quality pics from a 1/2.35\" sensor.i could not understand two points yet:can it record movies for 40sec? and is thereany option to shoot more than once on self timer mode.or is there any other option?", "Date": "March 1, 2008"}, {"Title": "Good Product", "Author": "Tamai", "ReviewID": "R1H541GVHL2F6J", "Overall": "4.0", "Content": "I have only used for a couple events, which I used in auto mode. I got great results!", "Date": "December 31, 2007"}, {"Title": "Olympus SP-560UZ", "Author": "Leif Tyr Gudmanssen \"(^^)\"", "ReviewID": "RJPGC7CCQMESS", "Overall": "5.0", "Content": "Wider is BETTER!!!  I couldn't be happier with another camera... GO OLYMPUS!!! :)  Tak!", "Date": "November 10, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.0-megapixel CCD captures enough detail for photo-quality 16 x 22-inch prints\n18x super telephoto zoom; Dual Image Stabilization\n2.5-inch LCD; Bright Capture technology for low-light photos\nHigh-speed sequential shooting (up to 15fps) and Pre-Capture\nCaptures images to xD memory card (not included)", "Name": "Olympus SP-560UZ 8MP Digital Camera with Dual Image Stabilized 18x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41LCXgsgsOL._SX300_.jpg", "ProductID": "B000UW8CU8"}}