{"Reviews": [{"Title": "Not perfect, but a great value for the price.", "Author": "L. Simonson", "ReviewID": "R42PUJZSW4YEI", "Overall": "4.0", "Content": "The jury is still out on this one.  I purchased this with high expectations of Canon's experience and reputation for digital cameras.  I grew up in a family of professional photographers so I am fussy.PROS:1)  You can't beat the price considering this is 3.2 megapixel camera.2)  Picture quality is excellent.3)  This can take short movies, with sound.  Again, excellent quality.CONS:1)  No optical zoom.  The 5.1x digital zoom is fine if that's what you want.  However, there is a huge difference.  If zooming is not important to you, then this is fine.2)  The button choosing between still pictures and the movie setting is a hair trigger and can be easily shifted by accident.  Both my father and I inadvertently took movies when we wanted to take stills.  We didn't know it until we downloaded the images.3)  Buy stock in a battery company.  At least you'll get some of your money back in dividends when you become the company's best customer.  Digitals consume batteries like water, but this one devours batteries like Niagara Falls.  In fact, this is probably the single biggest limitation of this camera.  Getting a rechargeable package is the way to go, and you'll be using it a lot.  Also, be careful of battery consumption when connected to the computer -- it's a killer.4)  The instructions in the manual, and the controls on the camera itself, are very complicated.  Plan to spend a lot of time reading the manual over and over again, and practicing with the camera to get the hang of things.  This is far from a \"take it out of the box and start taking pictures\" kind of camera.  The function and display controls on the camera are, in my opinion, very frustrating.  If you have patience and can spend some time concentrating and practicing, you can master it.All in all, while you may never use half of the cameras capabilities (either because you don't need them, or will never understand how to use them), you can take great pictures.  The primary decision making factor here is price.  Why spend $500 when you can get this camera for less than half?", "Date": "May 25, 2003"}, {"Title": "\"You can't beat the price, megapixels, and name!\"", "Author": "Jerry Parks \"USAToday All-American Teacher; N...", "ReviewID": "RW0NDMZ2PDNVZ", "Overall": "4.0", "Content": "Here it is in a nutshell. I bought this camera for photos of my students' activities at school, and trusted the Canon name to give me more than my money's worth in a [$...] camera.The positives are:  1. It's [relatively inexpensive], 3.2 megapixels, and it IS a Canon!  2. It has a focus assist light, which helps in low light.  3. It's simple to use, though with many advanced features such as white balance adjustments, manual exposure, sound effects, etc.  4. It takes really good photos (excellent color saturation).  5. It takes two AA batteries with pretty good battery life.  6. It's small enough to slip in a pocket!  7. It uses inexpensive compact flash memory.  8. It's easy to transfer to your computer via USB cable and Canon software.The negatives:  1. Onlydigital zoom--very handy, but degrades quality.  2. Flash is only average.  3. If you do any cropping or enlarging, quality degrades quickly.  4. Not attractive, but is sturdy (I've dropped it a few times!) I like this camera--there's not much NOT to like. It does not have the enduring 'draw' of the Nikon 2500/3500 (see my review), but it has many more features, and the pedigree of the legendary G3, and S-50 Canon cameras. If you want just a basic, compact, point & shoot digital camera that's  [relatively inexpensive] for a 3 megapixel unit, this one is THE one. As a bonus, you find it offers a whole lot more under that generic, unspectacular appearance!", "Date": "April 17, 2003"}, {"Title": "excellent value 3MP compact camera, but no optical zoom", "Author": "jemaerca", "ReviewID": "R2K6XR02ERO525", "Overall": "4.0", "Content": "this camera is geared towards the casual photographer who is looking for good resolution (3MP) in a compact and lightweight package and doesn't want to spend a lot of money on a digicam.pros:- great resolution for the price - 3MP!- uses the same DIGIC processor as Canon's high-end G3 and EOS 10D - great pictures!- you can use this as a point and shoot but it still allows a degree of manual control when you want to be more creative with your shots- focus assist light for low-light situations- has exposure compensation- two autofocus modes- ISO 50-400 range- the interface makes plenty of useful features quickly accessible - once you get the hang of it- voice annotation available- VGA movie mode with sound (limited to 30 seconds)- uses non-proprietary AA batteries; i recommend buying rechargeables though- reasonable shot to shot time for this class of camera- USB connectivity- and you can get all this for less than a couple of c-notes!cons:- no optical zoom; but if that's what you want, you should look at the next class up on cameras (there's a digital zoom, but it's better to take the picture un-zoomed and zoom in later in your computer)- noticeable barrel distortion at the edges of the frame- the camera is light but it's bulky, so it doesn't feel very solid- no RAW or TIFF uncompressed format- short flash range- the included 16MB CF card is not enough; be prepared to shell out more $$ for more memory- no composite video connection so you can't view on a TVfor the price and for its target audience, this is a very nice camera.  just don't expect the higher end features you would find in the canon s50 or g5.  enjoy!", "Date": "August 12, 2003"}, {"Title": "Canon A300 Digital - a decent starter digital camera", "Author": "R. King", "ReviewID": "REE8NV7MS6CHJ", "Overall": "3.0", "Content": "This is the second digital camera that I've owned. I had a Fujidigital for the previous 5 years and it served me well for basicphotos, just a bit weak on the megapixs (1.3), and after the first couple of years; the controls became less dependable.The Canon A300 has easy-to-use controls, takes digital movies with sound, stitches several pictures together to make a panoramic print, takes gorgeous closeups within a few inches of subject and transfers the pictures to a pc or other device in a snap with a excellent photo program that allows cropping, editing, etc...There are drawbacks to this model - the digital telephoto isn't too good past 2.5X (goes up to 7.5x), no optical telephoto, uses AA alkaline batteries as if they were candy, the battery and compactflash card door isn't located right as I keep unlocking it when I turn the camera on with the protective lenscap that slides towards it. I would strongly suggest rechargable NIMH batteries and a recharger.There are better digital cameras out there, but for the low price and features, I would recommend it to anyone who wants tostart digital photography with an inexpensive investment.", "Date": "January 15, 2004"}, {"Title": "Great starter digicam even though no optical zoom", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "R2NHROKQZ9JFRZ", "Overall": "5.0", "Content": "The other reviewers have covered this beginner's digital camera extensivesly. I just want to give you my two cents regarding two issues. 1. Lack of optical zoom. For my primary digital camera I demand optical zoom, and no less than 3x of optical zoom. If you travel a lot like I do, optical zoom is a must. If, on the other hand, you shoot a lot of party pictures, it's not as important. The A300 lacks optical zoom, so it's better used as a secondary camera, which is how I use it, kinda like a pocket camera. Two advantages of no optical zoom: 1) the camera operates more quickly, and 2) the lens mechanism won't break as fast. 2. Three megapixels. Nowadays even 5MP models have become immensely affordable. A lot of people overlook the facts that 1) most digital pictures never get printed, and 2) you can get great 6x4\" prints from 2MP, not to mention 3MP. In fact, you can get great 5x7\" or even larger prints from 3MP. On most photo printers, too many megapixels are wasted anyway. What's more important is the overall image quality. There are 5MP cameras that take underexposed and ugly pictures. The A300 continues Canon's tradition of superior image quality. For this price, the A300 is a must-have for gadget lovers and people looking for an easy-to-use starter digicam.", "Date": "July 28, 2004"}, {"Title": "Great Camera with some minor drawbacks...", "Author": "\"jebno1\"", "ReviewID": "R2DY5FO4KR5B7H", "Overall": "4.0", "Content": "I love it...It is my first digital camera but for the price it really has more features than you would expect. I would like if it were a little smaller so it could fit in my pocket, but I guess thats why you pay hundreds more to get an elph. The photo quality is excellent however it declines when doing work to the photos on the computer. The movie function is AMAZING. The quality is excellent and it is like having a home movie camera! I sometimes have trouble taking the pictures when i have to hold the button down half way and wait for the camera to focus - it takes a few seconds and sometimes doesnt focus at all and wont let you take the picture. The only really bad part about the camera is that the batteries die VERY VERY VERY VERY quickly. Definitely invest in duracell stock when you purchase this camera or NEVER use the LCD screen! Overall the camera is GREAT and I love it. Hope this helped...", "Date": "June 23, 2003"}, {"Title": "Nice Shots, but Eats Batteries!", "Author": "J. Massey", "ReviewID": "R2VGFECLZIGVXN", "Overall": "4.0", "Content": "The Canon PowerShot A300 takes some really awesome pictures.  It has a lot of features that are easy to figure out and is user-friendly to those new to the digital cam world.A couple pros:-Takes great pictures, even when set to low quality (1 megapixel)-ISO-Great quality for price-Many featuresA couple cons:-Eats through batteries in minutes.  A suggestion would be to turn off the LCD when using the camera.  The LCD isnt very necessary for taking pictures, anyways.  Also, buy some Canon NIMH rechargable batteries.  I found some at Circuit City for $35.  If you dont get NIMH batteries, you'll go through a 12 pack of regular batteries in an hour.-Flash doesnt reach far enough.  Sometimes I find that using the camera in low-light situations is pointless because the flash wont even reach the object I'm taking a picture of.-Sometimes \"automatic\" features (ISO, flash, etc) make the picture come out blurry or fuzzy.  Try experimenting with the features to find something that suits you.For the money, its a great camera, but dont expect miracles out of it.", "Date": "April 19, 2004"}, {"Title": "Excellent camera at a very reasonable price!", "Author": "Rusty", "ReviewID": "R1G44TMJBGJ9XM", "Overall": "4.0", "Content": "I bought the Canon A300 knowing full well that it doesn't have optical zoom. To me, a typical 3X optical zoom simply doesn't do much. Further, the added moving lens of a zoom camera is prone to mechanical problems. It is simply NOT worth the [money amount]or more for this feature. What the Canon A300 offers is a compact camera that takes shockingly detailed pictures, especially in outdoor light. In macro mode, the fine detail that I see in the pics is astounding! They are better than my Nikon SLR film camera. Indoor shots with flash do not turn out as sharp as outdoor shots, but still very good nevertheless. Sure there are negatives. Do not use this camera for action shots or sports photography. The auto-focus and light-metering will be too slow for that. However, for general use, such as scenic shots, this camera is more than adequate. Don't let the complaints about excessive battery drainage scare you away! It is simply not true! The original alkaline batteries did NOT last very long, but the NiMH batteries I got seems to last longer each time I recharge them! I can get at least 60 shots using these batteries with the camera in full function. One negative is the very tiny icons. They are hard to see and they are not very intuitive. Navigating the menus is also confusing at first. But once you get it, it is quite easy. Suggestion: go through the very long owner's manual first to see WHAT the camera can do, then go through it again to see HOW to do it! The software that comes with the camera is also very nice and easy to use. I did not have to read the manual for the software before using it. But I did later because I did not want to miss anything. In summary, this is a very competent camera and a great value. At [money amount], there is simply nothing close to it in terms of features, quality, and value.", "Date": "July 13, 2003"}, {"Title": "Great for what I wanted", "Author": null, "ReviewID": "RQLNJOZO89M4V", "Overall": "5.0", "Content": "This is my first digital camera. I wasn't looking for anything major. Mainly I wanted the camera for taking pictures that I might not want to have developed.  Just everyday pictures to share with family and friends. Also, I thought it would be handy for when I go househunting.So far, I am impressed. I have been using the superfine setting for the medium-2 size.  The clarity of these pictures is wonderful. I haven't used it enough to speak on the battery eating that other reviews have mentioned.  But I did buy a charger and some NiMH batteries.  I have had to change the battery once and that was also because we left it open.  I have managed to take over 40 pictures and several movies if that means anything to you.For the price and the discount on the memory card (I went for the 128 MB version), I think this camera is a great deal and perfect for someone wanting to get their first digital camera without breaking the bank.*Updated*I just took this camera on a weekend trip.  I didn't have to change the batteries.  I turned off the LCD screen (I don't like using that for pictures anyway), and I turned the camera off between pictures. Worked beautifully and the pictures look great too.", "Date": "March 13, 2004"}, {"Title": "Worth every penny", "Author": null, "ReviewID": "RQRZNAY0OUQ1K", "Overall": "5.0", "Content": "The alkaline AA that came with the package lasted a few hours for me (several photos, a few videos). Then I bought some MAHA Powerex NiMH rechargable batteries and they last me 3 occasions spanning more than a week even after taking a lot of pictures and nearly an hour of video. I also use a Viking 256MB CF Card, and I don't have to worry about storage. It stores more than 150 photos at the higest resolution, and I could take a lot a lot of videos without having to worry about space. The video quality is superb. Pictures are a bit tricky; you have to hold it a bit longer to capture the image properly, plus you get blurs at the edges, but it's barely noticable at the highest resolution and almost undetectable for amateurs like me. ...", "Date": "May 19, 2003"}, {"Title": "A convert's opinion", "Author": "Asian_myth", "ReviewID": "R2K0I04GQVILFC", "Overall": "5.0", "Content": "I am a recent convert to digitial from an advantix camera.  Ive had this camera for a month now, and it is the best thing i have ever bought.  I knew that when I saw this in the flyer, we would be getting it.Anyways, the batteries that it comes with are garbage.  they didnt even last long enough to change the settings.  I did buy 4 energizer rechargables though, and each pair has lasted me a good 2 or 3 daysI strongly recommend using the viewfinder to take shots and use the lcd to review shots to save on battery.The digital zoom is not that good, but im surprised i can still catch the license plate of a car that almost hit me.The movie mode is ok.  its much better outdoors than indoorsThe memory card lasted a while, but i really wanted to get better shots, so I got the 128 mb card.  With the new space, I was able to catch a video of a flock of ducks crossing the road and holding up traffic for 10 minutesi agree with many of the opinions here.  If your a person that just likes to take average shots without paying too much, then this camera is for you.  If you buy 2 pairs of rechargebles, you will be fine.  I guess in a few years, ill probably stick to canon when the 10mpxl cameras come out", "Date": "August 5, 2003"}, {"Title": "A must have!", "Author": null, "ReviewID": "RLWX1R6HLYKIV", "Overall": "5.0", "Content": "I am 14 years old and received this camera on the back and it is great.  I bought a 128mb memory card to go along with it, the more the better.  So far I have clearly noticed the really good parts about the camera...and the not so good parts.I'll start off with the not so good parts--1) As with all digital cameras the batteries run out very quickly (and thats an understatement).  Although I do not own any rechargable batteries, I would still recommend them.  I litterally go through around 2-4 each day I use it.  2) A lot of buttons on the back.  The buttons are very confusing when you first start fiddling around with the camera but once you look through the guide, you'll figure it out.3) No optical zoom The good parts--1) The camera is small and can easily fit in a pocket.2) With a nice size memory card you can store tons of pictures.  With my 128 mb card I can store 77 on the highest quality but I don't even need to use the highest so I keep it on either the setting that allows 125 or 225. 3) The video mode is cool and can even record sound!4) The digital zoom.  Sure digital zoom can make pictures grany but if you put it in a high quality you can zoom without giving up too much.  5) It's a fun thing to have.6)  Great value!I know that I am probably forgetting things but all in all I have enjoyed this camera and would recommend it to everyone!", "Date": "December 26, 2003"}, {"Title": "Great Bang For Your Buck", "Author": null, "ReviewID": "R313YY52DN5YE9", "Overall": "5.0", "Content": "After comparison shopping other digital cameras in a $100 to $300 range I decided to go with the Canon A300. I've had two different digital cameras since my first in 1996... this is simply amazing technology for the relatively small price. It's fairly easy to use and light and small enough to fit into a front pocket even. It takes wonderful pictures and I'm looking forward to using the mini movie with sound function to help sell art I create. I don't recommend products lightly but if you're on a low budget and you want or need a great digital camera... this is one with wonderful \"bang for your buck\" plus with a name like Canon.. you know you're getting quality to boot.", "Date": "April 21, 2003"}, {"Title": "No Battery Problems!", "Author": null, "ReviewID": "R1LCWRPI8HMPTK", "Overall": "4.0", "Content": "I was reeeally skeptical about this camera, regarding the battery problems that many of the readers encountered. But I got it anyway from Target. I haven't used the enclosed batteries, rather I went to Fry's Electronics and made a purchase of a set of 4 [no name brand] rechargable batteries.To my surprise, I've had noooo problems with the camera draining the batteries! I've had the camera for 2 weeks now, I've turned it on and off at least 20 times... and have taken at least 50+ shots with the flash on, and I'm still using the the set of charged batteries. No joke. It's pretty amazing.I've had an older model of the Kodak digital camera, and the batteries it used was a Kodak factory made, and it was very disappointing to say the least.I don't know if it's a hit or miss with this Canon model, but mine's been working out just fine. Last note, yes, it's kinda strange without the optical zoom, but like another reader had stated, shoot it at the highest resolution, don't digital zoom, then just crop whatever you need [if needed], it'll come out just fine.", "Date": "February 22, 2004"}, {"Title": "You'll need a zoom lens", "Author": null, "ReviewID": "R39LY4R5BSS2VV", "Overall": "3.0", "Content": "I've been using Nikon and Leica film cameras for more than seven years and been a firm believer in prime lens, for the better image quality. Now that I'm shopping for a P&S digital camera for my wife, with the same kind of thinking in mind, I checked out A300, for its non-zoom lens. After playing with A300 at Circuit City for a while, ironically, I have to say you do need a zoom lens for these little digital cameras. Not that I have suddenly developped inclination for zoom convenience, but that when shooting at close range, the lens distortion is so severe and shocking. The traditional approach of \"getting close to subject\" won't work here. You have to get further away then zoom in to bring the subject back, in order to mitigate the distortion. Have to use a longer focal length (e.g. zoom in) when a shorter one will typically do, there're other disadvantages: easier image blur from camera shake, less flexibility in shooting angles, etc. This shortcoming appears to me quite limiting, especially A300 already has a 1-stop slower lens (f3.6 vs. f2.8) compared with other models, say, Canon A60, for similar price.Due to the general limited optics quality on these cameras, I don't think the difference between 3.2M (A300) vs. 2.1M (A60) pixels is big deal anymore. This factor might well be overshadowed by many other ones that also bear impact on the final image quality. So I'll just pick up A60 for quick digital jobs, and leave more demanding ones to my old trusty Nikon and Leica.", "Date": "October 11, 2003"}, {"Title": "Everything except the battery", "Author": "GeeNah", "ReviewID": "R23Y0GYGJ5PCK7", "Overall": "4.0", "Content": "This is my first digital camera, a christmas gift from my sweetheart. It's great...it has great features...I agree with most of the other reviews that I've read. When I first opened it I was expecting to be able to use it with no problems as I'm pretty handy with things like this. However, I wasn't able to do so, I had to read quickly throught the manual. I wasn't able to take a picture until the next day. I took several videos the first night. The next day, the battery was dead...and I had only used it for 15-20 minutes max. I changed batteries and not too long after the same thing, dead batteries. Other than that the clarity is wonderful and once you've taken a read through of the manual you're good to go. I would recommend this for anyone young or anyone for a first digital camera. I'm planning on getting the rechargable battery pack as well as the AC adapter so that I don't have to get frustrated. These items are a bit pricey but less than continually buying batteries OR misisng a great shot due to battery failure. ENJOY...", "Date": "December 28, 2003"}, {"Title": "Best Camera in the $200-$250 price range", "Author": "R. COLE", "ReviewID": "R3BP8TRY0QZCVF", "Overall": "5.0", "Content": "I sold digital cameras for a living.  Take my word for it.  This is a great camera!  It is very simple to operate and it has some cool features.  The camera does not have optical zoom, but I was willing to give up the optical zoom to get the 3.2MP resolution.  Most 3.2MP cameras are in the $300 plus price range.  I will be taking most of  my photos of people and I do not need the optical zoom.  No camera in the $200-$250 comes close to this camera.  Even the Sony needs improvement to compete.", "Date": "May 29, 2003"}, {"Title": "Very good pictures", "Author": "Aivar Annamaa", "ReviewID": "R1YY4RXWVHWTJB", "Overall": "5.0", "Content": "Picture quality is very good. Eats batteries, but you need to buy rechargeables anyway, for any digicam, so it's not a big problem in my opinion. My camera says sometimes that batteries are depleted when they are not, when I turn it off and again on it works again.", "Date": "June 11, 2003"}, {"Title": "Worth the price.", "Author": null, "ReviewID": "R5YJXOH5ZPRR2", "Overall": "5.0", "Content": "I bought this camera right after it was released in April 2003 and I'm happy with my purchase. For less than $200, this camera gives you a lot.I never use most of the features of the camera. If you like to play around with it, I guess you can create many neat effects on your photos or videos.This camera comes with a 16MB CF card but I recommend using a 256MB CF card (although this might be way too much for most people) so you won't have to worry about memory.Remember to format the CF card using the camera before using it for the first time to avoid problems. I have experienced lock-ups with this camera, but I suspect it has to do with my large capacity CF card. I figured that I can avoid this problem by formatting the card after every download to the computer.Data transfer between the camera and computer is fast.It uses 2AA batteries. USE RECHARGEABLE BATTERIES! The normal disposable batteries that were included in the package only lasted a few photos and some 2 minutes of video.As an amateur photographer I can say that the picture quality is great. My pictures come out clear and sharp, with correct and realistic colors, so I don't have any complaints.The video+sound quality is EXCELLENT.I use this camera with a 256MB CF Card, four AA rechargeable batteries (2 for use, 2 for spare) and a battery charger. I also have the carrying case for the Powershot for easier storage.I recommend visiting powershot.com for more technical details.", "Date": "December 6, 2003"}, {"Title": "Nice Pictures, but Tragic Flaw", "Author": "Steven C. \"semi-informed consumer\"", "ReviewID": "R3EYYBWSNMT63R", "Overall": "3.0", "Content": "I purchased this camera a while ago, and while I was generally pleased with the picture quality and other functionality, the camera has an intolerable flaw: the slow shutter time.  It takes an eternity between the time you press and hold down the button and the time the picture actually takes.  This gets pretty embarrassing and frustrating when you're asking other people to take pictures of you and your friends.  I got sick of saying \"You have to hold it down for a long time...even longer...there we go\"  I gave up in the end, and bought a different camera.", "Date": "October 28, 2004"}, {"Title": "Mediocre at best", "Author": "Jeff R Allegrezza", "ReviewID": "RKCHN54BGIVIZ", "Overall": "2.0", "Content": "I bought a Canon A300 to replace a lost Sony.  I found the camera to be adequate except for two things:  Battery life and delay upon hitting the photo button.  Simply stated, the same type of batteries that last 18 hours in my mp3 player last 5 minutes in this camera.  Battery life was consistent over several sets of batteries.  Secondly,  this camera is completely inadequate for taking pictures of small children because the children will have moved by the time the picture is processed.  While the camera takes adequate pictures, I would not recommend it.", "Date": "May 1, 2003"}, {"Title": "Great Entry Camera", "Author": "Stanley J. Wynman \"Wynman\"", "ReviewID": "RDGMFOC9VPABQ", "Overall": "5.0", "Content": "I bought this camera as a spare for taking pictures while on vacation.  It is nothing like my 10D or Pro 1, but I only paid $150 for the A300. The pictures are very decent, and much better then most, if not all cameras in this price range and class.  Simple to use, readily availble AA batteries, and it shares the same Compact Flash cards with my other cameras.", "Date": "July 16, 2004"}, {"Title": "Not happy", "Author": null, "ReviewID": "R2F9C15X78QQX5", "Overall": "2.0", "Content": "It takes good pictures, but I have absolutely no patience for this camera . . . it eats up batteries like CRAZY (I think one time a set of batteries ran out only after TEN minutes, ahhh!!).  The other issue I had with it was that it takes FOREVER to snap a picture . . . everybody is sitting there smiling and waiting for the picture to take, and IT DOESN'T SNAP!  I discovered quickly that I must be an impatient person, because I just don't have the time or money (on tons of batteries) to deal with this camera.  I'm actually going to try to sell it on ebay or something, because it's in perfect condition, but yet I can't return it to the store anymore (anybody want to buy it?). I usually only buy canon and think it's an excellent brand and have some really nice higher-end cameras, but I just don't like this one very much and can't wait to get a different one . . .", "Date": "June 24, 2004"}, {"Title": "A SUPER DIGITAL CAMERA, ESP. FOR BEGINNERS!", "Author": "rittyrat \"Alli\"", "ReviewID": "RIE6A84JP1WKJ", "Overall": "4.0", "Content": "Sure, this camera has its drawbacks, but you'll never find a digital camera that is perfect.  I wish it was more compact, I wish it always took perfect, in-focus pictures without me putting in any effort, and I wish it was faster, but one might say that about any digital camera.  This is my first digital camera and I'm now ready to move on to a more modern camera that's more compact with better zoom and possibly more megapixels.  But I'm not sorry that I bought this camera and when I bought it, it cost me about $300 or so.  I am not an optimist and am by far the most cynical person I know and I still say this camera is a good buy, especially now that the price has plummeted.My main reason for liking this camera is its durability.  I've dropped it countless times (hard) and it remains in perfect physical & working condition.  Many people complain about the FlashCard/battery door breaking on other models but this camera is a rock!  The worst that happened when I dropped it is that the door swung open and the batteries came tumbling out.  Each time, I thought \"Oh, no!  I broke it!\" but soon realized it was intact and still working like normal.  And most of the time, I toss it into my knapsack without putting it in a case first (tsk, tsk) and the camera is still going strong.Also, with Canon cameras, many people get the E-18 error message or whatever it is on their screen and then their camera stops working completely.  I believe this is caused by sand getting into the camera.  I've never brought my camera onto the beach or anything, but I've had it not-so-clean places before and I never got that message with my trusty A300.Many people have said that this camera eats batteries like crazy, and that's true, if you use regular AA Duracells or Energizers or what have you.  I highly recommend you buy a set of 1 hour rechargeable batteries meant especially for digital cameras.  I bought a charger that came with two sets of batteries for $20 and these digital camera batteries last MUCH longer than normal AAs.  It's great!  You can use one set of batteries while the other set charges (it only takes an hour!)  So I have to wonder what kind of batteries these people who complain about the battery-eating are using.Size: it is a bit bigger than you might hope for but it never mattered much to me.  It won't fit in your pockets (unless you wear very baggy pants) but it fits just fine in my  knapsack.  But ladies, if you carry around a tiny purse, this will take up a lot of room in it.  It would also be nice if it was a tad lighter.I've gotten many great photos out of this camera.  I would say about half come out good, half come out not-so-good.  Two pictures I took with it came out so well that they won photo contests.  I think it was fun to experiment with the 'flower' button and flash button, etc.  I wish the mini-movies it takes didn't come out so dark.  But it got the job done.  It's pretty easy to use, too.  I figured out how to use the camera quickly.  I didn't even need the manual until it came time to download the pictures from my camera onto my computer (which also turned out to be easy).The only thing that really bothers me is the very slow reaction time.  Don't expect get any photos of your cat yawning, for example, or anything that happens that fast or faster.  It takes a little while to load when you first turn the camera on before you can start taking pictures but I've gotten used to it.  I would say that this is the A300's only major drawback.  If you're in a hurry to snap a photo or if you want to take a picture of something fleeting (like a yawn), you might get very frustrated by the delay time (I have).  But other than this problem, this sturdy camera was a breeze to use and I am happy to pass it on to my sister when I get a newer model.See my two contest-winning photos that were taken by my A300 in the photo gallery ('Customer Images') for this product!  They are the two rat pictures... Thanks for reading this and good luck!", "Date": "May 31, 2005"}, {"Title": "It goes everywhere with me", "Author": "William Lelyveld", "ReviewID": "R6BHCF2JACGG4", "Overall": "5.0", "Content": "I am as happy as Larry with this camera. It takes terrific shots, fits in my pocket, so goes everywhere with me.No excuses for having missed a fantastic shot wherever I go.It's \"Quickdraw McGraw\" with the best gun in town!", "Date": "January 2, 2004"}, {"Title": "First Impressions: Excellent Value for money", "Author": "Amazon Customer", "ReviewID": "RJZ622PCXTESC", "Overall": "4.0", "Content": "Given that digital camera prices keep falling, and steeply for the higher end models, this camera is almost a steal. At under $200 for a 3.2 megapixels this camera is an excellent buy (at least in 2003!). I have had this camera for less than a month and first impressions:- Photo quality is excellent. Best results if you are shooting with lots of light, either daylight or indoors.- ISO 50 mode gives you the best results.- Consumes lots and lots of battery power. Trying to learn the camera controls used up a two AA pack in less than 90 mts. Go for the NiMH rechargeables. Will save $$$- Most of the controls can be understood without reading the manual. The manual itself can be quite intimidating, so try to understand the controls by tinkering around with the camera itself.- Best photo quality is to be had under the Superfine and Large settings. File sizes at this setting can be as large as 2MB.- Get a 256 MB or larger flash card.- File transfer with the usb connection seems a bit slow, especially when transfering a full 256 MB flash card worth of contents.- Flash is quite difficult to use. At close distances it tends to whiten everything in its wake, and at moderate distances it seems too weak to do anything useful!- Noise is considerable at ISO 400 setting. Therefore, shoot at 50 or 100.- Videos are reasonably sharp. the 640x480 mode creates large files (approx 25MB) of ok sharpness.- the images tend to be a bit on the softer side. For the price this camera is an absolute steal. Of course you do not get an optical zoom, nor can you control the depth of field, or the shutter speed with this model, but this model is meant to be a starter model...", "Date": "September 15, 2003"}, {"Title": "Excellent Digital Camera", "Author": null, "ReviewID": "R3MVYD2DJI3LIO", "Overall": "5.0", "Content": "Bought this camera after reading the reviews here at amazon.com. I was a bit worried about the battery life. After starting to use it, I did not have any problem with batt life. If works like other D.Cameras. I bought a rechargeable kit anyway. I used the batts that came with the camera and I was able to play with the LCD for setup and filled my 16 MB compact flash and even downloaded the pics. The camera sometimes says that the batts need to be changed but once you switch if off and turn it back ON, it works fine like before. I tried this 2 times and was able to fill another 16 MB card. Ths pics are great and the movie mode is really cool. The digital zoom is [weak]. Wish it had atleast a 2x optical zoom. Anyway I use the software to Zoom the pics so that 's not a big problem for me. This is a great camera for price you pay.", "Date": "July 28, 2003"}, {"Title": "More than Adequate!", "Author": "M. Evans \"New England Technology Teacher of T...", "ReviewID": "R35465VHBILWXD", "Overall": "4.0", "Content": "I won't spend a lot on a camera that I use for Ebay, Email,classroom, and web photos. The A300 is a lot better than what I need. The video mode is handy for power point presentations. Don't use the zoom and flash together if you can help it and you'll get great shots that you won't need to sharpen. For [this price range] there is no other choice. I love it!", "Date": "May 26, 2003"}, {"Title": "ItS realLy goOD...batteries last longer than others said", "Author": null, "ReviewID": "RXPNO7APKE4L1", "Overall": "5.0", "Content": "at first i was skeptical because i have read some of the reviews that were only mediocre. but when i purchased the camera and used it i was dumbfounded. the batteries last a lot longer than only 2 minutes LIKE THAT OTHER GUY SAID> maybe something was wrong with his. the batteries it came with lasted pretty long or at least longer than 2 minutES!! the pictures come out really great.....and for the price......its hard to beat........", "Date": "May 12, 2003"}, {"Title": "Barely average", "Author": "a scientist", "ReviewID": "R1UGP8G1H7MNXU", "Overall": "3.0", "Content": "This camera is extremely cheap.  Although it is a bargain and not a bad camera, I found it too frustrating for regular use.  I took the camera on an extended trip and discovered the following foibles:1, It eats through a set of 2 AA batteries in 20 - 40 pictures, depending on how much the flash is used (using LCD screen for every shot but for minimum possible time).2, If you close the cover before the yellow light has stopped flashing, the camera thinks the batteries are finished and needs to be re-set four times before it will behave properly.  Note to Canon: why not just take pictures until there's no more juice?3, It takes an age to take the picture.  Whenever I pressed the button, it always took several seconds.  Occasionally, the camera would just click and whir for 10 seconds without doing anything.  I missed several great pictures because of this.  If I asked anyone else to take a picture with the camera, I had to specifically warn them because this camera is UNUSUALLY slow.4, There is no obvious \"fill-in\" flash and the regular flash was too aggressive.  Under indoor daylight conditions, the performance was fine but indoor dark conditions were difficult.On the plus side, the pictures turned out nice and sharp, pretty well exposed, except for the flash problems I've already noted.  I guess that's all I could really ask for.  My next camera will probably cost four times as much but at least I won't spend my whole vacation foaming at the mouth.", "Date": "October 9, 2004"}, {"Title": "I LIKE IT!", "Author": "Judith Sarfati", "ReviewID": "RFON7FJFVEDNF", "Overall": "4.0", "Content": "I'd been wanting a digital camera for a long time, but I just knew that I'd kick myself when prices came down. (My best pal bought one for 599 last year that is going for 199 now!) But when I saw the price for this one, I thought \"how can you lose?\" I'd read the negative reviews, and decided to take them seriously, but not let them swing my opinion. When I got the camera, I was really pleased with the size. It's pretty small, but it doesn't feel like it'll fall apart in your hand. Granted, the batteries that came with it were used up after about 10 shots (shooting, viewing and downloading). But the $1.99 energizers I put in are still going strong after about 20 more shots (including the downloads)(It uses two plain old \"AA\"'s). I just try to remember to turn it right off after I'm done shooting or downloading. It takes a few moments to turn on and to actually snap the shot (it has the shutter has this half position where I assume it's taking a light reading?) but I can't imagine, unless you're shooting rapid action shots, like a race or something, that it'd be a huge detraction. A plus is that it comes with the cable you need for downloading. The Canon case for it is about five bucks separately, and is worth it. Anyway, if you are using the camera for more specialized kind of photography, you probably want something better, and aren't looking for an inexpensive all around camera. But if you want something small to take on vacation, take snaps of buildings and landscapes or to shoot posed shots of family and friends, this is a great choice.", "Date": "August 31, 2004"}, {"Title": "GREAT CAMERA", "Author": null, "ReviewID": "RQBSEVKVD1IL0", "Overall": "5.0", "Content": "I've purchased this camera on July 02.  Pictures are just wonderful!!!  Display is not intuitive ... but after a while features are easy...Regular batteries last max. 2 minutes - I personally suggest rechargeable NIMH which last approx. 80/90 shots.", "Date": "January 10, 2004"}, {"Title": "My thoughts on the Canon A300", "Author": "\"sleen_wong\"", "ReviewID": "R1PQB436PURKQ5", "Overall": "3.0", "Content": "It's great if you just need a point-and-shoot no fuss camera and optical zoom doesn't matter to you. It colors are gorgeous, especially outdoors during the day. Drains batteries like crazy, slightly over 20 photos and the battery was flat. Slightly bulkier that I'd like, but it's a Canon at a reasonable price. I use it primarily for email and web publishing so image quality is not very important to me.", "Date": "October 2, 2003"}, {"Title": "Fits budget with quality and features", "Author": "dlc \"dlc\"", "ReviewID": "R1NPS4XKDNFHN1", "Overall": "5.0", "Content": "An exceptional camera ..., takes excellent images and surprisingly clear and smooth video with sound!.Uses the same DiGiC image processor as Canon's high-end EOS 10D. Color balance is excellent, skin tones look great. Easy to use with many features and options. The low light focus assist lamp is neat and photo-stitch feature for panoramic shots is really cool! Does use batteries quickly but it is to be expected since it only uses 2AA's while most use 4 or proprietary. NiMh batteries perform much better. AA size batteries are a plus since they can be found virtually anywhere and probably even that nearby electronic gadget if needed.Originally bought this camera to take photos of my two young children and discovered that the video works great to record those special moments, like my daughter's first bike ride without training wheels! The kids love to watch the clips over and over again. It will shoot up to 3min of video, the number of clips depends on the CF card size.The only drawbacks I found are the fixed focal length, long recharge times after flash, and no TV hook up.I definitely recommend this camera. After researching other digital cameras nothing else currently can compare to the Canon for the price.", "Date": "August 8, 2003"}, {"Title": "If battery life is an issue, don't buy this camera.", "Author": "sirfelix", "ReviewID": "RKS00X6AR0P8E", "Overall": "2.0", "Content": "First, let me say that the camera features and quality of images are the best I have seen for a camera of this price. ....and then the batteries died.The battery life is the worse that I have ever seen in any electronics device.....ever.Supplied AA alkalines supplied with the camera got me about 5 photos and about 15 minutes of menu playing time. The manual states I should get 75 images with the supplied alkalines.I installed Quest 1300mah NIMH rechargables, like everyone suggests, and got about 9 images and one movie before the batteries died. The manual states I should get 200 images with rechargables.I'm thinking of buying the new 2200mah rechargables, but I'm already disappointed with the camera's use of power and I'm not sure the 2200s will even get me 20+ images.I'm seriously thinking of returning this item....UPDATE:(2/3/04)I did buy some 2200 mAh batteries and with the LCD defaulting to off and using the eyepiece, I can say that the camera is usable, but only for occational use. I can't see using this camera on any long trips/vacations. I still wouldn't recommend the A300 to anyone without warning them of the extra cost of a good ($50) rechargeable battery kit. Keep this in mind if you are evaluating Total Cost.Hope I helped.David", "Date": "January 19, 2004"}, {"Title": "energy consuming", "Author": null, "ReviewID": "RHWWX7JR91LTS", "Overall": "3.0", "Content": "this is a nice camera. But it is too energy-consuming. With the 2 AA batteries in the package, I shot only 2 pictures and played with some functions,say,replay,delete,setup.I don't know why it is like this.In other words, if you want to shoot 10 pictures,you gotta have at least 6 AA batteries!!! suggestion: buy an AC adapter,and batt charger.", "Date": "April 18, 2003"}, {"Title": "step up and invest more...", "Author": "No. 6", "ReviewID": "R2BK6ILN7IZ1M9", "Overall": "1.0", "Content": "admittedly, this camera is very inexpensive for the feature set you get. but we needed to change batteries far too often to make this a worthwhile investment. Also the lack of optical zoom means you are essentially buying a 35 mm point and shoot, so great if that's what you want (and u r willing to spend $10/week on batteries for regular \"vacation\" usage). IF you want greater flexibility, and something u won't grow out of or tired of real fast, u should keep looking for something that may involve extra initially, but you will get more use of.In short, great price, but serious shortfalls w. respect to battery life and camera capabilities. Also, the cycle time between shots (especially when using flash) is painfully sloooooooow.", "Date": "August 31, 2004"}, {"Title": "Good Stuff", "Author": "M. Hamilton \"Moquarius\"", "ReviewID": "RAGHN6OD91GVV", "Overall": "5.0", "Content": "This camera works great!!!! I love the picture quality and all the things you can do with this camera. I still use the memory card that came with my camera because it can hold up to 32 pictures. I purchased some Sony rechargeable batteries and charger so battery life is not a problem. All in all its a good buy!", "Date": "August 29, 2004"}, {"Title": "Great Digital Camera For Beginner!!!", "Author": "Master Q", "ReviewID": "R29X1EYGNIPAY4", "Overall": "5.0", "Content": "This Canon PowerShot A300 3.2MP digital camera is great!  For about $109 it is a bargain with 64MB of CF card.  There may be no optical zoom lens but the digital zoom of 5.1x does a pretty good job.  It may look de-pixilated at the zoom of 5.1x but when the pictures come out it is better looking with a bit blurry.  There is a micro feature too that allow you to take picture of small stuff as close as 2 inch away.Overall, I have it for about two weeks and I am pretty happy with it.", "Date": "August 17, 2004"}, {"Title": "Takes forever to 'record' a picture", "Author": "L. Feinstein \"lloydo\"", "ReviewID": "R3Q6F2NZZ2HNCQ", "Overall": "2.0", "Content": "Takes absolutely forever to 'record' a picture.  You click the 'shutter' button and then the thing just sits there for an interminably long period of time.  Add to that the pitiful battery life managed out of the 2 AA's that will fit into this camera and you've got a product that really has reached the end of its useful life.A couple years ago it would have been a fine camera,  in 2004 its a dinosaur.  I, stupidly, bought it last year thinking it would be comparable to some of the other higher-end Canon cameras on the market.  I was sorely mistaken and deeply regret the purchase.  Don't make my mistake,  this isn't a significant improvement over a 98 Sony Mavica in anything except being able to use a flash card in lieu of a floppy disk.", "Date": "August 17, 2004"}, {"Title": "Great camera", "Author": "S. Rainey", "ReviewID": "RZIDLLRXMZJ96", "Overall": "5.0", "Content": "This camera takes beautiful pictures for use on the web. Printed versions are not nearly the quality as those you take with a regular film camera, but that's a given.  We like the fact that this camera has video, but the video quality is nothing compared to the photo quality so I consider just a bonus to have that feature. If you want good video, I wouldn't get this camera.  It's been well worth the money, and while some reviews I read while researching this camera said it sucked up batteries, I haven't experienced that.  I use the monster rechargeable batteries and they last quite a while.", "Date": "August 16, 2004"}, {"Title": "Did I get a lemon?", "Author": null, "ReviewID": "R3GE3SYGFIHNQ", "Overall": "1.0", "Content": "We got this camera for Christmas. Brought it to a trip oversea and it stopped taking pictures half way through the trip with an error code of E25. Brought the camera back to Circuit City and was told to send it back to Cannon for repair. Very disappointing and frustrating!The pictures we managed to take did come out very well, but this camera consumes batteries like crazy, so expect to change batteries everyday!", "Date": "January 6, 2004"}, {"Title": "Completely Satisfied", "Author": "Jean-Claude Chambers", "ReviewID": "RC3U9CYROYGJE", "Overall": "5.0", "Content": "I just bought my Canon A300 yesterday, having done as much background research and comparison shopping as I could.  Almost all of the reviews I read were positive, and I determined that nothing could touch it for the price.I needed a digital camera with few \"bells and whistles\" but with excellent image quality, and I needed it cheap.  Turns out it does has a few \"bells and whistles\" thrown in anyway.The picture quality is stunning, and more than surpassed my expectations.  Sure the operation of the camera is a little cryptic, but if you read the manual, it explains everything.Nothing can touch it for the price at 3.2 mega pixels......I'm completely satisfied!!!  I actually feel like I got more than I paid for.", "Date": "July 25, 2003"}, {"Title": "Very nice for the money", "Author": "R. Matthew Goldey", "ReviewID": "R1TWR5UNDCX4OU", "Overall": "4.0", "Content": "If I had realized that this camera's zoom was digital-only, I might not have bought it. Other than that, it's great for the money.", "Date": "May 26, 2003"}, {"Title": "Buy stock in a battery company first", "Author": "L. McKeever", "ReviewID": "RUVXY3BGESY5X", "Overall": "2.0", "Content": "I got this camera a couple of months ago and I'm not real please with it.  Althought it takes good pictures it eats up batteries even when your not using it.  If I let it sit for a week the first thing I need to do is change batteries to get it working.  I also have a problem importing pictures directly from the camera to my graphics program, it will only allow for one picture at a time to be imported, this is the first camera that has done this to me.  So I'm pretty disappointed with the camera, expecially since it was a Canon.", "Date": "August 15, 2004"}, {"Title": "Nothing past 20 feet", "Author": null, "ReviewID": "R7TDTK7FCTOF0", "Overall": "2.0", "Content": "I wasn't expecting a lot from this camera, but I've been disappointed with two aspects of it. Even with a higher resolution setting, I couldn't get sharp pictures indoors from more than 20 feet away. I've also found the controls slower and more complicated than most other digitals I've owned. I wish I had put this money towards a higher-quality camera (which I ended up doing anyway).", "Date": "May 1, 2004"}, {"Title": "Great camera for beginners", "Author": "Jessie Williams \"Jessie Williams\"", "ReviewID": "R2CCTU48CWCZB2", "Overall": "4.0", "Content": "This little camera is a great camera for someone who is new to photography. The settings that this little things has is wonderful. You can either run on autopilot and have it do the work for you or you can set the manual settings to your little hearts content. There are a few fun settings that you can add the background startup photo to one that you have taken or you  can add your own sound tot he startup as well. The only downside that I found with this camera is that it is a little fragile and if you drop it you better pray that you can pick i up in one peice. The pictures I took with this are awesome and pleased me until I moved onto bigger and better things, I highly recommend this camera to anyone who would like a cheap camera that has excellent results.", "Date": "December 11, 2005"}, {"Title": "A few words for fellow adventurers:", "Author": "AMD", "ReviewID": "R222MXOYWUHC6P", "Overall": "4.0", "Content": "I have found this camera to be surprisingly resilient to the repeated abuse I have given it.  It's not been left completely untarnished, but it still KIND OF works.When I left it outside in the sand during a thunderstorm in the fair town of Dirt, Louisiana, it woke up in the morning QUITE gritty and the buttons were a little stubborn, but it still worked perfectly.  Photos are of beautiful quality.I've banged it around the Caribbean without a care in the world, and while it was always a bit too slow to take successive photos of Puerto Rican farmers getting into a bar fight, it held up quite well.Real problems came after I dropped the poor thing into a hot spring in the Andes of Venezuela.  Luckily, I was able to retrieve it, but it would never be the same again.  The LCD is completely trashed and unusable and the flash is now nonexistent, but the durn thing still takes pictures!!  I can't believe it, either.  As long as I'm outside in the sun, photos and video turn out great and transfer effortlessly to my computer.In short, this camera will take a lot of wear.  It's a great camera to take on adventures (especially to places that don't have lithium batteries!), but go easy on the hot springs.", "Date": "April 29, 2005"}, {"Title": "Sweet Camera!", "Author": "M. Lu", "ReviewID": "R329QAU4EVLUYA", "Overall": "5.0", "Content": "This was a great first camera for me and I feel like I got WAY more than I paid for.  3.2MP and high resolution allowed me to touch up in Photoshop and still allowed fantastic print quality.  Video recorder has audio.  There is no Optical Zoom, which is why I decided to get another camera after I felt like I've \"graduated\" from this one.  Buy, Ni-MH rechargeable batteries.  They last WAY longer and this way, you won't have to own your own battery company to like this camera.Oh, and since Canon cameras all have digic chip processor and pretty much the same operating format, after you're done with this camera, you won't have any trouble when you upgrade to any of the fancier Canon models.", "Date": "January 24, 2005"}, {"Title": "Price was right!", "Author": "Gloria", "ReviewID": "R37SGOT4UBV3O6", "Overall": "4.0", "Content": "My first digital camera frustrated me initially. I kept having to wipe of the batteries and reload them for the power to stay on. Then they died permanently. These were the batteries that came with the camera. But, I had much better performance with some Rayovac alkalines.As a beginner I also became frustrated with the myriad of settings viewed thru the LCD monitor.Now that I am familiar with the camera, I am happy with it.  It is easy to upload the pictures to a computer.", "Date": "August 19, 2004"}, {"Title": "SMALLEST CAMERA THAT TAKES PICS LIKE THE BIG LEAGUE", "Author": "Shashank Tripathi", "ReviewID": "R1ZRHEZSC07FQ4", "Overall": "4.0", "Content": "If you need small cameras, you have to typically settle for picture quality that LOOKS like it came from a tourist gadget.Not this one! Despite its budget price (and what a steal it is) the colors are vivid and the pics sharp as crystal. Occasionally you could get overexposed results, but that's easily sorted out with white-balance settings.The only potential negative is the legend of barrel distortion on small Canon cams, but I still have to see what that looks like (and I take several architecture pics).A great steal of a small camera, it sure doesn't behave like one!", "Date": "August 18, 2004"}, {"Title": "WOW!!!", "Author": null, "ReviewID": "R2CQX1CNJYA85C", "Overall": "5.0", "Content": "I received this as a christmas gift this year. this is great i love it. all other digitals that i have used dont compare. the picture quality is awsome as is the movie playback quality when downloaded to your pc. cant wait to get the portable 4X6 printer to go along with it.!!!", "Date": "December 29, 2003"}, {"Title": "Great price and such, bad battery life", "Author": null, "ReviewID": "R3COBXEK05WM1C", "Overall": "3.0", "Content": "I originally bought this camera when it was hard to get during the summer of 2003 (just out on the market) for work. We sell magazine photo guides and take approx. 75-100 photos per day. The camera takes EXCELLENT pictures for the price. Problem is the battery life. The cameras that we use previously lasted 1-3 days with one set of batteries. This camera I have photographers changing out batteries 2-3 times A DAY. If you don't take pictures that often, this is great for you. If you use your digital camera often, research more. I've bought the A60 (despite peoples complaints about the E18 error message) and Nikons. Both have better battery life.", "Date": "December 29, 2003"}, {"Title": "Absolute beginners, step right up!", "Author": null, "ReviewID": "R2UQ065WSZNRNI", "Overall": "3.0", "Content": "We got this camera as a Christmas gift so for the price WE paid it's great, but I would never have bought this camera!What good is paying $159 for a camera that is only half decent AFTER you pay $100 for 128mb card and $50 for a battery charger and 4 batteries?Sure, the camera takes fine pictures in good light with little or no digital zoom, so it's great for parties or close range, if that's what you need.I took the camera on a trip to Europe and was sooooo disappointed with the battery consumption.  I was forced to buy batteries in all the most tourist-trap places, three times a day, for top dollar!  Then, the enemic memory card it came with filled up in one day, so I had to buy a bigger card in an equally tourist-trap store.  And yes, I bought a battery recharger on my trip as well.  How much does my entry-level $159 camera cost now????And just a word about digital zoom.  NEVER use digital zoom if optical zoom in available, and NEVER buy a camera that has didn't bother including ANY optical zoom!Save up a little money and buy yourself a better camera.", "Date": "January 10, 2004"}, {"Title": "can be dropped", "Author": "Aivar Annamaa", "ReviewID": "R2XLWR8T7UF6TJ", "Overall": "5.0", "Content": "Dropped it from about 1 meter to concrete floor, battery lock, a small piece of plastic broke but camera worked like before.", "Date": "June 30, 2003"}, {"Title": "Good", "Author": null, "ReviewID": "RYHMKI7ZR5KF9", "Overall": "4.0", "Content": "Good for the money. Need to use rechargeble batteries, so far with 40 pic taken with flash without changing batteries.Don't use alkaline, they'll be out with just a few shots.Print-outs are better in its original states than edited in photo deluxe.", "Date": "May 20, 2003"}, {"Title": "You Get What You Pay For...and You Should Pay More...", "Author": "John Frisbie", "ReviewID": "R1QBX0NAFYL566", "Overall": "1.0", "Content": "Camera feels [sub-standard], has a flimsy mechanics, eats batteries all day long. I put in the original batteries and the camera lasted for exactly two (2!!) pictures. Replaced the batteries and upon using the LCD screen the camera IMMEDIATELY told me the batteries were low. (Hadn't so much as TRIED to take a picture!) Subsequent batteries lasted a bit longer, but buy this camera WITH a MONSTER pack of NiMH batts. Photos are fine, features are NOT easy to figure, there's nothing intuitive about the menu. In short, buy an Olympus, this camera was intended to replace the same and except for it's ability to shoot movies, it doesn't.", "Date": "May 21, 2003"}, {"Title": "Perfect entry level camera", "Author": "The COOTP \"cootp\"", "ReviewID": "R1V4G7QM1HW39O", "Overall": "4.0", "Content": "I bought this for my mother for her birthday.  Picture quality is outstanding and the videos you can take are great also.  Very easy to use, and for 50 bucks you can add a larger Compact Flash card so you can take hundreds of pictures or more video.  It does come with a 16mb card which isn't bad for starters.  Of course, as with any digital camera, rechargeable batteries are a good investment.  The only thing missing on this camera would be optical zoom.  I got this for under 100 bucks...unbeleivable!", "Date": "August 26, 2004"}, {"Title": "Great starter digital camera:", "Author": null, "ReviewID": "RU9TCINSWJLCG", "Overall": "4.0", "Content": "This camera is certainly not top-of-the-line, but it's not bad for the money. It takes beautiful daytime pictures, but night shots tend to be blurry (you can fiddle with shutter speed and white balance though). If you want to become a professional photographer, this is not the camera for you; but if you're looking for a decent camera at a decent price, this is a great buy. Also, I have to disagree with previous posts about additional costs - 128mb cards can be found as cheap as $30-40, and an Energizer recharger with 4 NiMH batteries is $20 at Target. With these minor additional costs, you'll have a lifetime of memory and battery life.", "Date": "January 19, 2004"}, {"Title": "Great camera, excellent for the price", "Author": "not telling", "ReviewID": "R10GM86NNSCVVM", "Overall": "4.0", "Content": "I bought this camera for 200 bucks and can say that I am quite satisfied, and somewhat surprised at the quality. The pictures are great - the camera is 3.2 megapixels and it really does make a difference! The pictures come out so clear and bright! The camera has a good zoom on it, and is very easy to use. After a couple of hours of fidgeting around with it, I pretty much had all the basics and then some down. It was easy to set up the software in my computer - took about ten minutes. The only problems that I have with this camera are: 1. the battery life is short - but battery life is short on all digital cameras, so I guess compared to others this one isn't bad. 2.) If the lighting is not great, there will be a long delay before the picture takes. doesn't seem like that big of a deal but it can get annoying. 3.) I can only download the pics from my camera onto my computer once at a time. If I want to empty out som e more onto my computer later, I have to shut down the whole computer and start it back up again in order to download more pictures.But, that's the only qualms I have. So, considering that I only paid 200 bucks, I am very, very happy with this camera.", "Date": "October 8, 2003"}, {"Title": "No Zoom", "Author": null, "ReviewID": "R1UTA6R9ABZ4N2", "Overall": "3.0", "Content": "A good solid camera at an excellent price.  My only complaint, and it's a big one, is that the zoom feature is practically useless. All pictures that I use the zoom on come out blurry.", "Date": "August 31, 2003"}, {"Title": "Great for taking the step from 35mm Digital", "Author": null, "ReviewID": "R39OVCQMDP4WLS", "Overall": "4.0", "Content": "The Canon A300 packs a lot of features for a low price. Its user friendly, has a good internal zoom lens and comes with great photo editing software. I strongly recommend getting recahrgeable batteries. The best thing is that I can shoot all the pictures I want and then edit them later. If you're wary of making the change from film to digital, don't be. This camera makes it painless for the digital novice and the pictures are very nice.", "Date": "August 27, 2003"}, {"Title": "A good low cost high quality camera", "Author": "M. Jordan", "ReviewID": "R211OY7QIPXE9B", "Overall": "4.0", "Content": "This is my first digital camera and while I was camera searching there are two very important things that you have to take into consideration. One is the type of media storage (CF or SD memory), and the other is the type of battery it uses. When I was deciding which one to buy it was between an Olympus and a Canon.What I noticed about the Olympus camera that I didn't like was that it uses XD memory cards which is only made for Fuji, Olympus, and Toshiba cameras making it extremely expensive to purchase memory. The Canon uses CF memory which is the cheapest out there and can also be used in your PDA and MP3 player making it's versatility a plus.Now with ALL digi cams that use AA batteries it will drain quickly if you use the LCD viewfinder and flash. If you use NiMH rechargable batteries then expect those batteries to drain a whole lot quicker. This is true for Nikon, Fugi, Kodak and ALL other cameras too.Now even though the A300 doesn't have optical zoom it's digital zoom doesn't skimp on the quality. Made for XP users plug and play via USB cable. And the software that comes with it is okay but, if you use Windows XP then you might want to things simple and use the picture viewer to edit pics. And when your done with that head over to Snapfish to develope your edited pictures.", "Date": "August 14, 2003"}, {"Title": "keep looking", "Author": null, "ReviewID": "R1HK67M08GJVVD", "Overall": "2.0", "Content": "I liked the camera for the most part but is was cheap feeling, light, and plastic feeling.  I took it back because the flash reload time was near 10 seconds between photos, it could have been me but it did have new batteries and I even contacted customer support to find out if there were any adjustmenrs I could make, they were of little help but did respond quickly.  My advice, Try the A70 or a Kodak, I bought the A70 and am much happier, the flash reload time is minimal.  If you are interested in cheap megapixels though I could find no better value in the market from a reliable manufacturer.", "Date": "July 25, 2003"}, {"Title": "1st Time digital user", "Author": "Clinton L. Norton", "ReviewID": "R386Q3A6P7O0QP", "Overall": "4.0", "Content": "I read the available customer reviews about the Canon A300 digital camera and noted the complaint about the lack of battery power. (eats batteries). I ordered the A300 based on recommendations from others about the machine being a good place to start. Now that I have had a few days to play with the A300, I can say in my experience the machine lives up to the manufactures claims. It is still on the supplied AA batteries after initial set up, 25 Shots and download time to my computer. For the price I cannot see how a novice could go wrong for a still digital camera with sound and movie options. My recommendation? If your new to digital and want to get your feet wet, try the Canon A300. Downside... could use optical zoom. However, keep your resolution high, and go easy on digital zoom and you will still get a quality shot.", "Date": "July 4, 2003"}, {"Title": "Installing the software is an exercise in futility", "Author": "Eric Clem", "ReviewID": "RZ21OEHE8M5RN", "Overall": "3.0", "Content": "Installing the software for this camera was a nightmare.  It turns out there were conflicts with the Install Shield feature built into Windows.  Contacting Canon thorugh e-mail and phone turned out to be an exercise in futility.  I did a web search on the error message (1607), and found there are many others using Canon products having this problem.  I ended up having to reinstall Windows.  When I contacted Canon, I simply asked them if they knew of a downloadable patch to facilitate downloading their software.  They told me to contact Install Shield.  Install Shield's website refers you back to the manufacturer (Canon).  Had I known about the level of hassle I would experience in advance, I would have purchased an Olympus.", "Date": "August 28, 2004"}, {"Title": "Nice features and good photos. Batteries a deal breaker", "Author": "\"roundheadmaker\"", "ReviewID": "R256F336K59MFR", "Overall": "2.0", "Content": "You may notice other reviews mentioning the battery problem. They are not exagerating, We used up a set of batteries just setting the preferences. I thought it was just cheap batteries that came with the unit. We got it going and took about six pictures before the battery light came on and the screen went black. After the second set died after 7 pictures, we knew this wasn't going to work as a nice point and shoot digital. Too bad. The price is nice and the pictures came out very crisp and full of detail. But who can carry four sets of batteries to take as many pictures as a roll of film? Sorry Canon. Nice idea, but AA's do not power this piece of equipment. Go back to the drawing board.", "Date": "June 17, 2003"}, {"Title": "Not particulary user friendly, memory card problem too", "Author": "TMC \"TMC\"", "ReviewID": "R3GRNNKG9IP6X2", "Overall": "3.0", "Content": "The camera offers a lot of features for the price. It is also compact, and the case is sturdy, and appears to be good quality. From the get-go I had problems with the memory card. It got stuck at first (needed pliars to remove) then it would not even read the card. According to Canon.com, my problem was due to a defect in the camera, which I recently sent back. (needless to say, Amazon returns/customer service is awesome!). Aside from the card problem, I found the camera not particularly user friendly. I read the long user manual, but had to continually consult it to operate the cameara, and do simple point and shoot shots. I began to forsee myself in the future on a vacation needing to bring the manual with me everywhere I went, in case I pressed one wrong button and was unable to figure out where to go next with it. In additon, I was unable to access one menu option even after reading and re-reading the particular section to address it. Since I had to return the camera since it was defective, I chose not to purchase a canon again, primarily because of the lack of \"user friendly\" buttons and method of accessing and changing the menus. Lastly it takes a pause before recording the image you are trying to capture, because of the auto focus. So if trying to photograph a moving child (like I was) I continually got blurry pictures, and often missed the shot I wanted because the auto focus caused such a delay (in other words you press the button to take the picture, and about a second or so later, it actually takes the picture). Hope this information helps. Except for the issues I mentioned, the picture clarity, resolution, and ease of uploading to computer etc were excellent. Using rechargable bateries also was fine, they did not drain very fast.", "Date": "September 18, 2004"}, {"Title": "Good Camera", "Author": null, "ReviewID": "RCGBST9TD4KK3", "Overall": "4.0", "Content": "This is a great camera for the price. I am a novice photographer and I need something with a good resolution. This is it! The few downfalls this camera has are that it eats up batteries so I recomend that you use the optional AC adapter. Another downfall is that it doesn't have an optical zoom. I don't recomend using the digital zoom because the picture becomes blurry. I recomuend using Picture It! and croping the picture.", "Date": "October 19, 2003"}, {"Title": "FANTASTIC", "Author": null, "ReviewID": "R2ZRK4AB5RBKE7", "Overall": "5.0", "Content": "This is a surprising camera.  I have no idea why it's so inexpensive.  The video alone is amazing!  Those who complain that it has no optical zoom have never used a digital camera before.  You don't need a zoom in the view finder.  I hear it uses batteries quickly, but it only takes 2.  I use the rechargable batteries and I can fill up a 256 mb card twice before I need to replace them.  This is my second digital camera, I got my first one 4 years ago and just moved up to this one.  It's not very user-friendly.  You will need to refer to the book often for a while.  The programs that it comes with are fantastic, too.  You can convert the .avi to .mpeg, you can put them on disk and play them on your dvd player and watch on your t.v. or that also makes the files small enough to email them to family and friends.  I love this camera!!!", "Date": "September 28, 2003"}, {"Title": "Great!", "Author": "Linda Roman", "ReviewID": "R3R7Y8HE7OLC5U", "Overall": "4.0", "Content": "I love this camera. It is perfect for carrying along to catch those special moments, with either photo or movie clip. I do not enjoy carrying the larger movie cameras and this is just right for me.  I love the pictures, they are very clear and have excellent color. I too would like the batteries to last longer, however I noticed the change battery pack message shows up before the power is actually gone.  I just keep using it until it stops and then change the batteries. I plan to get rechargeables but for today, I am in love.", "Date": "August 24, 2003"}, {"Title": "You get what you pay for, but this is the best for the price", "Author": null, "ReviewID": "R3PR4F7N7IH1YH", "Overall": "4.0", "Content": "Sure if you spend more you get more, but compared to other cameras in the price range you get a lot for the money (and I spent a fair amount of time looking). Just don't expect it to replace your SLR.  The quality of the pictures is quite good, and while an optical zoom would be nice at 3 megapixels you can just crop the big image and get a reasonable snapshot. I may have an entry level budget but I'm not a novice photographer, and I like the manual exposure compensation, and diffetent metering and focus modes.  It doesn't feel as rugged some more expensive cameras, but I don't think it's badly made either.  There is some barrel distortion of straight lines at the edges of the frame, but it isn't usually noticeable and if you aren't shooting in maximum resolution you can zoom in a bit with the digital zoom.  Just not too much or you lose resolution.  I like the movie mode with sound, and it's nice to be able to take 640x480 movies.  You can even edit them with the included software. It eats alkaline batteries but I don't think that's a legitimate complaint. Digital cameras in general eat batteries and they all need NiMH rechargeables.  Be forewarned.  I like that it takes AAs, I already had some AA rechargeables for other things and it's easier/cheaper to get spares than it sometimes is to track down an obscure proprietary battery pack that doesn't fit anything else.", "Date": "June 14, 2003"}, {"Title": "Canon PowerShot A300", "Author": "James R. McCoy \"VITAMINGIANT\"", "ReviewID": "R1XKJ1WLDFN6DR", "Overall": "4.0", "Content": "This is our first experience with a digital camera. It is a camera easy to use for the novice and has the bells and whistles the experienced or serious digital camera user demands. Super easy to connect to the computer with the USB cable supplied. We think this gives more bang for the buck than any we have looked at. Love it.", "Date": "June 12, 2003"}, {"Title": "Battery Killer", "Author": "Amazon Customer", "ReviewID": "R3TSU44CGZ8GLI", "Overall": "3.0", "Content": "I purchased this camera for my mom for mother's day.  We played with if for about 5 minutes before the batteries that came with the camera were dead.  We changed batteries and have exchanged the camera the bateries still only last for a few shots.  I would either purchase a set of rechargable batteries or try another camera.The pictures that we have taken do turn out very well.", "Date": "June 7, 2003"}, {"Title": "WONDERFUL BEGINNER'S CAMERA!!", "Author": "ReddyHotnBlue \"CLIVE\"", "ReviewID": "R3JSS2K9UB0BI2", "Overall": "4.0", "Content": "I've had several digital cameras in the past, though some were cheap, others expensive.  I've been amazed of how fast these digital cameras have dropped in price. This once was over $200, & now it's just over $100. Checking out the features low-cost, high quality (both camera and pictures), easy to handle,perfect for first time user. My daughter who was going away to school was never comfortable w/digitals, (she always wanted the kodak throwaways). I wanted her to capture some of her experiences & to be able to share & relive them at some future time. So when I loaded it up w/new batteries and a new CF card, I stuck it in her luggage w/the instructions and nothing else. A week later I had to pick her up for an appointment. Her priority was not bringing home laundry but to have her camera! She wanted to share, put online, etc. with both family and friends. So if you want something high quality, a no brainer, inexpensive, for yourself or your kids, you've found it!", "Date": "September 13, 2004"}, {"Title": "Great For It's Price", "Author": null, "ReviewID": "R3O92NFUZCXZ0W", "Overall": "5.0", "Content": "I'll admit there are better cameras than this, but only if you're willing to spend an arm and a leg for one. I've had this camera for around 3 or 4 months now, and it's been great. the photo quality is excellent unless you need to zoom, then it's only so-so. one thing that's overlooked on most cameras is the flash, which is hardly rated at all and hard to really find out about. this one works pretty well for short to medium range pictures, but doesnt fare so well at the long range. on the battery issue, i've actually had no problems with it and even though i use it more it tends to outlast my cd player. i use rayovak rechargeables in mine and take a lot of pictures (i filled up the 16mb card it comes with with the low rez pictures with no problem) if you dont use rechargeables, you should always carry some extras with you, you'll need them quite a bit. it's actually pretty easy to figure out once you get used to it, though at first it can be slightly annoying. the lcd screen is a rather nice feature on this one and works a lot better at aiming your shot than the viewfinder is. the videos you can take with it are alright, if you're wanting to make videos though this isnt the one for it, but a nice feature none-the-less. all in all, a great camera for me. not professional quality or anything, but still great, especially for the price. if you print out photos with it those look quite well too. my only complaint about this camera are the slow loading time (after you take a picture it takes it a moment until you can take another) other than that, i wouldnt change a thing about it.", "Date": "July 26, 2003"}, {"Title": "The Truth", "Author": null, "ReviewID": "R3LJUAK7LE9A8", "Overall": "5.0", "Content": "I bought this camera for about 2 weeks now and I'm the happiest person in the world.Some other reviews said that the camera eats batteries, this is TRUE!!! But I also bought a package of 4 rechargeable batteries (NiMh of 1800mah) and they worth every penny! The batteries are perfect, they last for about a week or two!!!, the pictures are the best and the movie mode is the great!!!This is the best camera at this price, so don't even look for more, buy it now....If you're looking for a camera with zoom this is not the one because the digital zoom [is bad] but If you're a fist time digital camera user you wont regret it....Canon is the best!", "Date": "July 16, 2003"}, {"Title": "Batteries & no flashcard included", "Author": "Rebecca Baker", "ReviewID": "R1UT9VI9OEZIAG", "Overall": "3.0", "Content": "I recently received my camera & am very pleased with the features.  However, I was halfway thru setting up my camera when the batteries it came with started to go low & I was given the sign to \"replace the battery pack\".  I am also disappointed with the fact that MY camera DID NOT come with a flashcard - I had to go out and purchase that from the store.  It would have been nice to know that ahead of time!!!!", "Date": "August 30, 2004"}, {"Title": "Fantastic", "Author": "Jerry E. Sullivan \"drjesullivan\"", "ReviewID": "RIYXZA3AW4VHA", "Overall": "5.0", "Content": "The Powershot A300 was my first digital camera.  In that sense, it's like your first car.  You knew you weren't going to win any points for style or speed, but it got you from point A to point B and introduced you to what you knew you wanted in future cars.The picture quality is, in a word, superb.  I took a picture of my daughter at the 2 megapixel equivalent setting (1600 x 1200), and I was stunned.  I had that photo blown up to 8 x 10 and you cannot tell it was taken with a digital camera (no pixellation).  The colors are rich, and the only down side to that shot was that it made me realize that my little girl is becoming a young woman.  My wife, who does not give out compliments easily, said that the picture rivaled what you'd pay for in a studio shoot.I have not had the battery life problems others have mentioned.  In fact, AA usage is pretty good, all things considered.  This is the ideal point and shoot camera for travel, but as battery life erodes, writing the picture to the compact flash card becomes noticeably slower.This camera now goes with me everywhere.  It is much more convenient to use than my EOS Rebel 2000, but I miss the creative zone controls on the Rebel.  These same controls are on such Canon Powershot models as the A60, A70, S45, S50, G3 and G5.The manual is comprehensive, and from what I've seen, most of the complaints addressed in this board can be solved or addressed by reading the manual.All in all, this camera yields dynamite pictures and you cannot beat the price.  If you're thinking about trying out digital, or you want a durable camera you can take with you on your travels and have a ready access to power (AA batteries are almost worldwide universal), get the A300.  You will not be disappointed.  It won't make you Ansel Adams, but if you've done even 30 seconds of homework before you make your purchase, you'll know this going in.", "Date": "June 15, 2003"}, {"Title": "have this camera for 5 years", "Author": "whatisknown", "ReviewID": "RLKAJCNZU88V4", "Overall": "5.0", "Content": "originally had older model which I dropped and it was under warrantee so it was replaced as part needed was not available. really happy with service. I still use the camera on my travels and takes great stills. also use it for movies. as is the advance of technology even basic cell phones now have great cameras that capture movement better and higher zoom capability. but I am attached to this camera.", "Date": "September 18, 2013"}, {"Title": "Worked well for 4 years.", "Author": "James B. Gardner", "ReviewID": "R8Q1VU58L8GE7", "Overall": "4.0", "Content": "Worked well for nearly four years till it died (bought refurbished). This was during the time when digicams first started becoming more common. Took great pics for only being 3.2mp.", "Date": "February 7, 2012"}, {"Title": "Totally disappointed with this camera", "Author": "twopurringcats \"Carolyn McFann\"", "ReviewID": "R1VCJ1S2GD046P", "Overall": "1.0", "Content": "I had this camera for a little over two years and it ate batteries like candy, had a confusing screen interface that malfunctioned frequently, then it just died, and was too expensive to fix. It wasn't misused, and I have a bunch of other cameras, mostly 35mm, that I've used for 25 years or more without breakage, my first was a Canon AT1. But this camera was nothing short than disposable and disappointing. Too bad, I never would've expected that from Canon previously.", "Date": "February 18, 2008"}, {"Title": "fun starter camera back then", "Author": "Mark Twain \"Sam\"", "ReviewID": "R1SLMIAHWYWPT3", "Overall": "4.0", "Content": "i got this camera a few years ago because i really like how their is a lens cover, it had a pretty good price for its features and it had a movie mode but i used norecharable bateries when i first got it you have to get 2500nah batteries for best results i recomend this camera for kids because its durable cheap easy to use and it dosn't have an optical zoom so the lens dosn't pop out which makes it easy to break  but i lost it a year and a half ago but now im geting the powershot 570is hopefully its good too i hope this was helpful", "Date": "August 28, 2007"}, {"Title": "Simple Camera, Good Quality", "Author": "Paul Mosier", "ReviewID": "R30UUEMHV3C1N2", "Overall": "4.0", "Content": "The Powershot A300 is a good beginner's digital camera and the price is fairly decent. The actual picture quality is great in my opinion for a 3.2 mp camera. The build quality is also solid. I've owned this for three years and it still works like new. I would not claim to be a photographer or even a photo enthusiast, but I am definitely a gadget type of person. There are some decent features such as red eye reduction, landscape setting, ability to record short videos and 5.1 digital zoom.The most substantial downside to the camera is the lack of physical zoom (i.e. telescoping lens). Because of this really any picture taken while in digital zoom is going to be pixelated. Secondly, pictures are difficult to recall. In order to get back to the taken picture you must cover the lens and then turn the camera off and then on again. Another problem is there are not many features to speak. However, considering the age of this camera I can't really say it is a problem. For the average person this is a perfect camera. It is easy to use, has great picture quality and is fairly cheap.", "Date": "July 23, 2007"}, {"Title": "just OK", "Author": "J. Fein \"feinfam\"", "ReviewID": "R1WW9NNIRPXJAD", "Overall": "2.0", "Content": "Have owned this camera for a few years. Never happy with image quality. Battery life is sucked dry very rapidly.  Much better cameras out there I'm sure, even back then...", "Date": "February 6, 2007"}, {"Title": "Don't buy it!", "Author": "Paulo O. May Junior \"Paulo May\"", "ReviewID": "R11Q3FEKHCUZGW", "Overall": "1.0", "Content": "I'm still wondering how could Canon create such a bad product. I was stupid enough for not read customer reviews before buying it.The A300 will eat a pair of batteries (even those with more than 2000 mAh) every 10 to 20 minutes, if you're lucky and keep LCD and flash off. It will take a century to respond after you press the shot button and another century to process the picture.I tried to contact Canon but I guess their customer support is just like their camera - it doesn't work!Do yourself a favor: don't buy a Cannon A300.Paulo May - Brazil", "Date": "April 11, 2005"}, {"Title": "OK, but that's it", "Author": "Are B. Willumsen \"only me\"", "ReviewID": "R3IYVIKNS71LD2", "Overall": "3.0", "Content": "This camera is affordable and I should perhaps not expect any better.To sum up. It is qutie big, but that I knew when I bought it. But on the other hand it doesn't weigh that much. The quality of the pictures are good. The camera has a few times reset its clock. Making me having to set the clock before I could take the picture. There are also some troble taking the picture. You should press the button half down and wait for the camera to focus and be ready before you press it all the way down to take the picture. Otherwise it sometimes refuses to take the picture. It also takes a looooong time to take a picture. Making you miss some spescial moments. Otherwise however it works fine. It is easily installed, and used with the PC.", "Date": "November 30, 2004"}, {"Title": "Windows 98 install problem, weak flash", "Author": "Robert R. Evans", "ReviewID": "R15S15VMMAAETH", "Overall": "4.0", "Content": "I bought this inexpensive camera for my young son and I to play around with, and it has met my needs and expectations. However...* I had problems installing the software under Windows 98. I eventually solved the problem, but it was time-consuming and not fun. See below.* The flash is pretty uselessMy PC is running Windows 98, and I could not get the software to install. The installation process hung at \"Please wait while installing ZoomBrowser EX\", and after connecting the camera the PC could not find a driver to update.I spent a fair amount of time tried many things (suspecting some sort of UCB conflict, and complications from preexisting problems with an external hard drive). I found one reference on the web to the same problem, without a resolution.In the end, I found a relevant Canon page (see below), and carefully followed suggestions AND was careful to install only the TWAIN driver at first. The installation succeeded, and I uploaded the pictures to Microsoft \"Picture It\". I suspect the crucial step is that the camera must be connected both during the initial install-from-disc, AND during the subsequent reboot. This is not emphasized in the Canon material about installation problems.After that I installed ZoomBrowser EX. I got the same hang, but after aborting the install the ZoomBrowser seems to be installed and functioning. Pretty good software, too. (...)", "Date": "September 9, 2004"}, {"Title": "Excellent camera for the money", "Author": "texasranger556 \"texasranger556\"", "ReviewID": "R15IN7ZQ283SYP", "Overall": "5.0", "Content": "I upgraded to this model from a polaroid pdc640, so its lightyears better than what I'm used to.  I'm a bargain hunter so I got a good deal on this and a 256meg CF card.  As mentioned by most all previous reviews, this thing EATS regular alkalines.  Buy some decent NI-MH AAs and a charger...and save some benjamins, seriously.  Here's a list of what I like about this camera:-easy to switch to movie mode and back-15fps movies are excellent quality and have SOUND!-easy to change picture quality (hit FUNC>left or right>FUNC)-no drivers needed with Windows XP (just plug it in and POOF!)-excellent quality pictures even at low-res-changable startup image/theme and sounds-powerful flash lights up a pitch black room-lens protector keeps the lens cleen/unscratched-auto focus works well in good-light conditions and easy to useThings that aren't as good-auto focusing takes a while in low light, I turn AF off most times-EATS batteries, buy rechargables. do it.-digital zoom...what do you expect for the money (compare a 3.2mp sony)-no TV-out (no complaint here)-16mb card will last you about 20 pictures at the highest resolution (fortunately CF is cheaper than memory stick, SD, MMC...)This camera is great for close-ups, short videos, any generally any type of picture that zoom is not a priority.  Personally I love it, but if you want to be able to zoom in on your subjects, definitely pony up the cash and move up to a more expensive camera.", "Date": "January 16, 2004"}, {"Title": "My 1st Digi Camera", "Author": "Frank D. Castellano", "ReviewID": "R14UFZ8OCMWJ3", "Overall": "4.0", "Content": "I rec'd this digi camera for X-mas and so far have been very happy with it. I'm an old school claims adjuster and very used to my Nikon 35mm camera that I have been using for 19 years. I can't believe all I need to do is take the mem card  to Wal-Mart and have the pics processed in 15/20 minutes. NO more film, processing and having to wait for a day or two to return to PU the film.  I did buy the 128K mem card ... and rechargeable battery ..., but I find these costs reasonable considering the films packs I used to buy and then the film processing costs and travel time to pick up the film. From what I hear battery life is not to great but again I have been lucky. Although I have 4 spare batteries in my camera bag; I'm still on the first set . My boss has an Olympus and he goes through a 10 pack in a day. The pics are great along with the photo detail (very sharp 4X6's).Good luck with your camera. I'm very happy with mine.", "Date": "January 15, 2004"}, {"Title": "Canon PowerShot A300- An outstanding camera!", "Author": "Antar Azan", "ReviewID": "R149NIKQ444YXJ", "Overall": "5.0", "Content": "Let me tell you, if you are looking for a camera with a good photo quality and video, this is it! The day I bought this camera i was so excited. My excitement really paid off with a good looking and good working digital camera. Sure, it may eat up the batteries at first, but if you have the right batteries for it, for example: Monster Rechargeable Batteries, it will work out. Amazing photo quality can be achieved easily with it's MENU OPTIONS. Great white-balance! I recommend Canon for any camera proffesional or just as a hobby. I myself prefer Canon more than any other brand for cameras. Hope you enjoy the A300.( I sure did!)~Nice job Canon! You hit it big.~  Sicerely,  Canon Consumer", "Date": "June 29, 2003"}, {"Title": "Great deal!", "Author": "BethR \"BethR\"", "ReviewID": "R110UNGXOBB3UD", "Overall": "4.0", "Content": "I did quite a bit of research looking for a great point and shoot for my significant other.I really like this camera. Also, I found it ate batteries the first day...but I read somewhere to wipe off the terminals and the batteries will last longer. I get hours of use out of my batteries now. I also have rechargables....but have only needed 4. Two in camera...two for backup. So, ever since reading that about wiping off the terminals my battery life has increased 10 fold. Pro: Great performance on the videoCon: Digital zoom stinks...but I knew that before I bought the camera and still really like it.Also....got a great buy here at Amazon on the Viking 256MB CompactFlash Card........", "Date": "June 16, 2003"}, {"Title": "Batteries?!?", "Author": "Anthony Stark", "ReviewID": "R185NQF9TO7JJF", "Overall": "3.0", "Content": "My first digital camera, so I'm learning all the basics.  I love it so far except for one MAJOR drawback.  I have gone through SIX AA batteries so far.  It goes through batteries in about 10 minutes of photography.  The ones that came with it lasted about five minutes.  I then bought a pack of Duracell M3 and it burned through them too.  I now bought a Monster AA rechargable pack...we'll see how those work.  Am I not supposed to use the LCD screen for shooting and viewing all the time?  Should I just use the viewfinder for pictures and then use the LCD screen for viewing/editing later?  Can anyone help me?  Should I return it for another one?  Is it defective?  I love Amazon, gadgets and computers...but I'm baffled here.", "Date": "June 11, 2003"}, {"Title": "Very nice for the money", "Author": "R. Matthew Goldey", "ReviewID": "RH3P5PQLQYZ97", "Overall": "4.0", "Content": "If I had realized that this camera's zoom was digital-only, I might not have bought it. Other than that, it's great for the money.", "Date": "May 26, 2003"}, {"Title": "Great camera, great price!", "Author": null, "ReviewID": "R2060XZE103479", "Overall": "5.0", "Content": "This camera works great! We bought it right before our vacation and we were so glad we did. It is easy to use and the pictures are so clear! Great zoom and the movie mode is just awesome! Very happy with it. Couldn't believe the low price!", "Date": "August 31, 2003"}, {"Title": "Battery Guzzler!", "Author": "Digital Beginner", "ReviewID": "R39JVG8094IGDR", "Overall": "1.0", "Content": "We knew about its short battery life, but we bought it anyway.  Now we regret it.  The battery lasted only for about 20 pictures with flash.  Had we known this as a fact, we wouldn't have bought this camera.", "Date": "July 25, 2006"}, {"Title": "The Jury Is Still Out", "Author": "cocodiva", "ReviewID": "R2NBED21N37TZP", "Overall": "3.0", "Content": "I recently purchased this camera with high expections. So far the jury is still out.  This is a good beginners camera, and beginners will love the picture quality vs that of 35 mm. I also love the fact of being able to print pictures directly from the camera (with the printer it comes with) without having to use a pc.  The cons are this camera goes through batteries. I am thinking about buying stock in a battery company. After pressing the shutter button, the camera takes it's time to produce the image. The user's guide is wordy. I just sat down one weekend and read through the guide and practiced with the features on my camera, only to have my batteries die out twice during the process.", "Date": "January 17, 2005"}, {"Title": "Good quality, bad performance.", "Author": "Armando Gonzalez \"Javier\"", "ReviewID": "R3494WGCLF6ZQB", "Overall": "3.0", "Content": "I bougth this camera on January 2004 and I already sold it. Quality pictures was pretty good, but time between shots is really long. When you ask somebody to take a picture for you it is very very embarasing because many times the shutting button just doesn't work. I think this is not a good election to buy please check other trademarks since I have read this problem also occurs with other CANON cameras.", "Date": "December 5, 2004"}, {"Title": "Highly Recommended!!!", "Author": "Robert G.Walden", "ReviewID": "R12E2ALY1GXG8P", "Overall": "4.0", "Content": "I've had this camera for 5 months now, and it has survived rock climbing, ice climbing and few high altitude drops (about 20 feet), and this camera has still survived it all. My only complaint, which I guess more a comment then anything, is that I wish Canon had tried to compress the pictures a little.  Anyway.  The picture quality is excellent, but I noticed that when you zoom to anything, the picture clarity diminishes a little, and at sometimes, depending on the conditions, can come out blurry.The good is that the camera is excellent for those people who go out and are the outdoors type person.  This camera is a little light, and can be put into a camping bag or your car glove box.  The media this camera uses is Compact Flash.  Which by the way, is one of the cheapest media that is currently out in the market.  So it will be easy for you to upgrade from the 16 mb card that comes with the camera.  Trust me, don't be caught with 16mb, and run out when you are camping, or out somewhere and you're out of pictures. Done that, isn't pretty.  The connection between camera and computer (threw the USB port connection) is moderate and batteries consuming.  I would recommend a card reader for this camera, since at times, this camera can eat up batteries.  If you want longevity for your camera using the batteries, I had best luck and longer usage using Energizer e2 Lithium Batteries.  I tried the basic batteries, and after 5 shots, I would run out of battery usage.  With the Energizer e2, I could make 5 long movies (14 sec's each) and still could take more pictures afterwards.", "Date": "November 30, 2003"}, {"Title": "Don't get a digital zoom", "Author": null, "ReviewID": "RDFSSKAD97ZXP", "Overall": "1.0", "Content": "Thought we'd try it out. My boyfriend is a professional photographer and had never used a digital zoom. Lasted 3 days before I returned it. Digital zoom pictures were grainy and dark and of poor quality. I was afraid I would damage the plastic body and the buttons and settings were overcomplicated, even after reading the manual. We had to change the batteries 3 times and we took no more than 20 pictures all the time. Had trouble synching with the computer, too. Fortuntely, Amazon gave a refund and we're going to try another camera.", "Date": "September 26, 2003"}, {"Title": "Canon service is horrible", "Author": null, "ReviewID": "R2SJKY5HM3JL8C", "Overall": "1.0", "Content": "Canon service is horrible. My camera has broken repeatedly and having it repaired has been a horrible experience- it took over three months to get it fixed!", "Date": "October 27, 2003"}, {"Title": "Problems...problems", "Author": "DianaC7", "ReviewID": "R902ARF08KJ7M", "Overall": "1.0", "Content": "I am not a novice when it comes to digital cameras; but after following the instructions to the letter, I never got one picture from this camera. And, it devoured the batteries that came with it, plus the special Ni-MH Canon batteries that I purchased separately.", "Date": "August 30, 2004"}, {"Title": "Great for the money!!!", "Author": "Diya Shari", "ReviewID": "R1U0XIFAU8UB45", "Overall": "5.0", "Content": "I had it for few years and worked great for what I paied for it. I bought the new Canon SD700 and very happy form Canon stuff.Don't expect $100.00 camera to do a $1000.00 camera's Job!!!!", "Date": "January 2, 2007"}, {"Title": "Nice pics, but eats batteries...", "Author": null, "ReviewID": "R2CA8ZGJDQH3G8", "Overall": "1.0", "Content": "I ran through two sets of new AA's in one days shooting (no flash used). I tried the rechargeable NiMH's, they ran down even faster. I use it now as a studio camera with an AC adapter.", "Date": "September 26, 2003"}, {"Title": "Please don't buy this!!!!", "Author": "R. S. Brandwayn \"Bobby McM\"", "ReviewID": "R242BD1MC3378M", "Overall": "1.0", "Content": "It might take ok pictures, it might be an entry level camera, but..IT'S CUMBERSOME TO USE AND THE BATTERIES DON'T LAST MORE THAN 15 MINUTES. PLEASE, DON'T BUY THIS PRODUCT....AVOID IT LIKE THE PLAGUE!!!!!!", "Date": "September 2, 2006"}, {"Title": "Useless piece of crap", "Author": "Patrick Murphy", "ReviewID": "R2KXLSEJJMORGA", "Overall": "1.0", "Content": "Even with alkaline batteries you can only take 4 or 5 shots before the batteries die.  Less if you play with the menus.  Canon should send a check to everyone who bought this piece of crap.", "Date": "January 9, 2004"}, {"Title": "Great Camera for the first time user", "Author": "Erin Appleby", "ReviewID": "R10LQWD5JFUKVM", "Overall": "5.0", "Content": "This is my first Digital Camera!I got this camera for my 15th birthday from my dad, he is VERY picky about how well it works, how fast and if it works at all.I read through the manual, which is kinda long, but you don't have to read all of it to figure it out. After finishing the manual, I took about 8 pictures, and 4 movies, the batteries seemed fine, but when it came time to cut the cake and sing happy birthday, I couldn't take pictures because the batteries were dead! I just flipped them (took the batteries out, reversed them so the batteries were switched) and the camera worked fine again, I still have to figure out how to get the best quality.Speaking of quality, the reviewers are lying! When I use the digial zoom to the fullest, it is not fuzzy, choppy or anything! The images are still great, and the quality on this camera is EXCELLENT!When I loaded the images to my computer, the set up disks were very easy to follow, and very fast. and Loading was a piece of cake! It took less than 10 seconds to bring everything to my files.This camera is so much fun, but to enjoy it to the fullest, I suggest these purchases: 1. A Camera Case (to keep this baby safe)2. A 4 pack of rechargeable batteries (you'll need 4, two to use, and two to charge, then between times, you never have to wait. You'll always have one pair ready to go)3. A battery Charger (Unfortunately these can be pricey but they are worth it)4. An AC adapter (the thingie that plugs into the wall, they're useful while you charge batteries or to save you $$$)5. A larger flash card (I find the 16MB just fine)6. A Warrenty in case something goes wrong (the camera comes with a one year warrenty through canon already, but I suggest one through the store you buy the camera too)I'm very lucky to have had all these things from my CD player, so I my dad only paid for the camera and warrenty, which was an excellent price for 3.2 MegaPixels. With other cameras, you are bound to pay more on flash cards, batteries, equipment etc...Remember to enjoy this Camera :) It's loads of fun!", "Date": "November 1, 2003"}, {"Title": "Digital zoom == no zoom", "Author": "NYC Mike \"ny_mike\"", "ReviewID": "R1FJ86ZJ4FV9XA", "Overall": "2.0", "Content": "Digital zoom is not worth anything -- any computer graphics program can give the same (or better, thanks to sophisticated algorithms which can't run on a camera) effect by cutting out a picture from a non-zoomed digital image.Optical zooms are expensive (a few bucks!), so we see even expensive digital cams only have digita zoom, where in the past even el cheapo analog cams had optical zooms up to 30x.  Nowadays you have to be grateful for a 3x optical zoom on a $700 videocam or digicam....", "Date": "August 9, 2004"}, {"Title": "muito boa realmente", "Author": "Giuliano", "ReviewID": "R2TBJIPW0PHZWX", "Overall": "5.0", "Content": "moro no brasil e comprei esta camera numa viajam aos EUA, e nao me arrependo... muito boa mesmo... nao deixando a desejar para as similares.", "Date": "May 17, 2003"}, {"Title": "JUNK!!!!!!!!!!!!!!", "Author": null, "ReviewID": "R386EFBD4AKBZ9", "Overall": "1.0", "Content": "Gave this to my poor mother on her way to Europe. It broke the first day!! At least she got a few dozen photos out of it, before having to send it back to Canon. But she did say the pictures turned out ok.", "Date": "October 20, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.2 megapixel sensor captures enough detail to create photo-quality 8 x 10 prints and medium-quality prints up to 11 x 14\n5.1x digital zoom\nUp to 3 minutes of video with sound\nCompatible with CompactFlash Type I cards; 16 MB card included\nPowered by 2 AA batteries (alkalines included); connects to PCs and Macs via USB 1.1", "Name": "Canon PowerShot A300 3.2MP Digital Camera with 5.1x Digital Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41RAYQK2HKL._SX300_.jpg", "ProductID": "B00008OE43"}}