{"Reviews": [{"Title": "Awsome for every day use!  Small, Fast, and Solid.", "Author": null, "ReviewID": "RS4FAFUG6W47U", "Overall": "5.0", "Content": "This camera is perfect to store in your backpack, briefcase, or front pocket. It is very small and very solid.  It starts up very quickly, and is ready to go.  The 2\" LCD screen is wonderful, and it has great battery life.  When I first received the camera, I was careful about using the LCD, but after a while, I used it liberally. I purchased an extra battery and battery charger, so when the battery starts to run low, I swap in a fresh one, and I am ready to go.  No need to remember to dock it each evening.  But, the dock is very nice, and works great.  The LCD screen is really wonderful when you are on-the-road.  It is large enough and crisp enough to show people your pictures with ease.The camera is very speedy.  The time between pressing the trigger button and taking the picture is about 1/2 a second delay.  It takes about 2 second to complete a shot, and you are ready for the next shot.  Viewing images is also very fast, even at 4MP.The camera is a pro-consumer camera. It has some advanced image options such as White Balance and EV Shift. The standard 3x optical zoom is great.  The images are very clean.  The digital zoom is not so great.  12x images (3x optical, 4x digital) are good enough to identify, but they are blurry...which is understandable.  The camera is so small, I realize you can't fit the optics for a much higher optical zoom.  Having some optical zoom was important to me, which is a great feature of this camera.  If compact high-level optical zoom is important to you (more than size), I hear the Panasonic Lumix Digital DMC-FZ10K (12x optical, 3x digital) might be a good option (it is larger to support the optical zoom lenses).A note on picture taking.  The images this camera produces is really effected by the image options.  The White Balance especially changes the coloring of the images.  For example, on a sunny day at the beach, setting the White Balance to \"Sun\" makes the images look great.  At dusk, setting the White Balance to \"Shade\" produces better images.  If you are lucky enough to get this camera, you should spend a little time getting comforable with the images options.  To make things easier, Casio has pre-programmed different configurations for night, day, scenery, portrait, etc.  These configurations make it easy to get a great picture.  You can also create your own 'canned' configurations.It also has a few cool options like the ability to superimpose a background (you take two pictures to get one), and the ability to take half a picture, and then a second half, so if you are traveling with a buddy, you can each be in the same picture.  There is also the ability to create HTML pages with thumbnails to copy to your website.  Overall, it has some impressive features in such a small device.  Make sure you get a memory card.  The internal memory card is insufficent.  I am very happy that Casio supports the SD/MM cards, rather than some proprietary format like Olympus.One thing that does disappoint me is that the camera does not support video.  I figured since the Z3 did, the Z4 would.  I am not too disappointed, since I plan on getting a second camera at some point, but if you only want one digital camera, you might consider a different camera which supports video (perhaps even the Z3!).  Also, the camera is not the greatest in low light conditions (early evening)...where the picture can get grainy in zoom mode (without flash).Overall, if you want a very portable camera, this is such an awsome device.  It really amazes me.  If you are more concerned about image quality over portability, you might consider other cameras.  I plan to purchase another larger digital SLR camera such as the Canon Rebel 6.3MP to use when image quality is most important.  I have a friend with a larger Sony camera, and he rarely uses it because it takes time to pull out of the carrying case.  He also does not like to carry it around all of the time.  I, on the otherhand, yank the Casio Z4 out of my front pocket, and am ready to go in seconds.  He might have somewhat better pictures (subjective), but I get much more use out of my camera, which is a better investment in my opinion.  Why buy a camera that you barely use? Actually, now he is thinking about getting a Casion Exilim as well.In closing, I am very happy with my purchase.  It is a pleasure to use, and my money was well spent.  After having this camera, if I only planned on owning one digital camera, I would be very happy owning the Casio EX-Z4.", "Date": "November 3, 2003"}, {"Title": "Small Easy and About as good as it gets", "Author": null, "ReviewID": "R262FYBTBGRJ7O", "Overall": "5.0", "Content": "Not sure where I read it, but someone said that the only bad picture is the one you couldn't take... because you didn't have your camera, or couldn't get it out fast enough. I am not a professional photog... but do know good from bad.  I have owned 3 digitals, and a die hard 35 MM user. I own Camera's with lenses that come off :-)What I liked most - the big screen, if not just for me, I was able to hand others this camera to take the shot... and they have all been able to use it. Even in strong sun.Small size, keep it on your pocket.. starts up fast enough to get the good shots.It is practical, I never needed to pack a \"bag\", and never felt guilty about it. Seriosuly if the only way you'll take a digital camera with you is to pack an entire bag for it... you won't want this anyway. Keep your 35 MM.  Traveled with some folks recently, and I usually had my camera out, shot and done before a co-traveler even had the bag unzipped... got so bad he bought a disposable. Just emailed him my picks which he claims looked better than the new 6.3 MP camera he was using.Good battery life, recharges, comes with a cradle, and a spare battery is tiny enough to carry if you are really that demanding. Most of us just need to get through a day or two of sightseeing in between charges. I recently took over a hundred picks before needing a charge.  Other camera's I had always needed new battery's frequently. Don't buy a digital without rechargables, you'll spend more $$'s on expensive battery's than your kids favorite toys demands.Dislikes.. power button is a bit small, fingernail is the best way to turn it on, but this was probably thought out I never was concerned about it powering on in my pocket as a result. I did have this problem with an other small camera. No direct usb link, you have to use the cradle.. but such is life with sucha small body, you have to move some things out. I bought a USB reader (cruzer), tiny and I slide the SD memory into it.  Also serves as a great place to store a spare memory chip on a trip. Software that comes has weird navigation for the average folks. Try it out, but suggest you look for a decent photo editing program if this is you first camera.4.0 MP...  will be as good as the scene you choose (there are 21 with this camera, everything from Portrait, Pet, Kids, Food and Night and Fireworks, very cool).. or choose Best Shot, which I have inadvertently turned off a few times.  4.0 MP is also as good as your printer and process...  Like that it uses SD memory, although most SD cameras are a little more money, it does make your life more flexible (fits in Palm Pilots, some phones, tablet PC's, etc. etc.). You should consider what memory format you want to standardize on if you are a first time buyer. The Pentax lense seems good. If you haven't figured it out yet, the Pentax Optio is similar, but has it's own strengths and weaknesses.As for price I noticed that you can save about $40 between merchants (as of now)Hope this helps !!", "Date": "December 7, 2003"}, {"Title": "Slick little camera with a big screen", "Author": null, "ReviewID": "R2SJK4CYF8IDZ1", "Overall": "4.0", "Content": "BENEFITS (my opinion):Even though the Z4U does not have movie or AV cables, it's a nice camera because of the many neat features as well as being ultra small.1) Camera SIZE & LCD - as advertised, this little camera is very compact.  Go to the Casio Exilim site to view the demo.  The size of the camera shown in the demo is exactly the same as the actual camera.  The LCD, though lower in resolution, is still a plus.  No more squinting at a tiny LCD.2) BUTTON PLACEMENT - Before buying, I held and handled the Minolta Dimage 3.2mp, the Pentax Optio 3.2mp, and the Canon Powershot S400.  Of the four cameras, the Exilim Z4 'felt' the best to me.  I liked how all of the buttons were placed on one side of the camera (rather than all around) and the large LCD was placed on the other side.  I can hold the Exilim comfortably in one hand (with camera strap on) and press thebuttons while someone else is viewing the pics. My big thumb doesn't get in anyone's way.  It works the same when I'm taking pics; I can press the buttons for options I need without blocking the LCD.3) NO rotating \"WHEEL\" - Thankfully, the Exilim has no wheel button to rotate for optional features.  In a big camera, it's not as bad, but for an ultra compact camera, I found the wheel to be a nuisance.  If you have big fingers, you have to use your fingernails (if you have any) to rotate the wheel.4) LOOKS - Of the four cameras I looked at, the Dimage looked the plainest.  The Dimage has similar zoom features, but there is no physical telescoping lens-- all of the zoom is done with its special optical non-telescoping lens technology.5) PICTURE QUALITY - The Powershot S400 appeared to be the best in all low light situations; the Dimage the worst.  The Exilim, if used correctly, will take good photos in low light with less purplish 'noise'.  DON'T use the digital zoom in low light situations because it enhances the noise factor.  On the other hand, the Exilim takes excellent outdoor photos. I guess the downside of an ultra compact camera is that photos in low light situations do not turn out the way you expect in some cases.4) BESTSHOT mode - The Bestshot templates (21 of them) are excellent.  Examples: B&W, Sepia, Coupling shots (split screen 'ghost' image), Pre-shot (background 'ghost' image), Night Scene, Twilight, Sundown, Natural Green, Collection (for toy photos).. and more. Besides Coupling and Preshot, you really don't need to use the templates because the camera does a great job without them.5) SELF TIMER - 10sec, 2sec, and x3.  I found the x3 function VERY helpful.  In group shots, the camera takes three consecutive photos without having to run back and forth to the camera.  The first delay is 10sec and the remaining two shots have a ~5sec delay.  This feature helped me pick out nice shots.  Also, the large LCD screen makes it a snap to position and center a group shot on a tripod.6) Power Saving Mode - The sleep mode and power off mode are handy in saving battery power.7) AUTO FOCUS - The time it takes for the camera to focus in Autofocus mode is very quick.  However, Exilim doesn't take close-up shots in Auto Focus mode very well, so use Macro mode and the close-up photos come out great.  Make sure to press the button halfway to focus before fully depressing to snap the shot.8) ISO - The Exilim does an excellent job in selecting the proper ISO (in auto ISO mode) versus if you set it yourself manually.9) BATTERY LIFE & CHARGE TIME - On a two week trip, I did not have to charge the battery the entire time.  Charge time itself took a couple of hours.CONS:The learning curve on the Exilim Z4 may be high if this is your first digital camera.  I already have an older digital camera, but I needed to play around with options/functions for a couple of weeks before I started taking serious photos with it.  However, once I got the hang of it, I can use the Exilim with ease.1) DELETING FILES - In the delete menu, 'delete' and delete all files' are on the same screen, so it is easy to accidentally delete all of your pics if you are pressing buttons very fast.  This happened the first time I fiddled with the camera.2) INSTRUCTION MANUAL - The contents of the Exilim box contains a 'brief' camera manual pamplet.  You will need to refer to the PDF manual on the CD-rom or print it out in order to read full instructions.3) CAMERA CASE - There isn't any...4) BLURRY SHOTS - Easily avoided if you hold the camera steady, but a nuisance if you have never used a digital camera before.  I learned to take shots with a steady hand when I first bought my old digital camera, so this was not much of a problem with me.. but my spouse is still getting used to it.5) LCD SCRATCHES - to avoid scratches on the rather large LCD, I cut to size and stuck on a clear plastic overlay (used for PDA screens).", "Date": "February 7, 2004"}, {"Title": "EX-Z4U travel charger & cases", "Author": null, "ReviewID": "R1GPK4Q3KWJ7X0", "Overall": "4.0", "Content": "The Casio BC-10L battery charger will charge batteries for the EX-Z4U (and all other Exilim cameras).  You can buy this charger from the Casio Exilim web site (and hopefully soon Amazon!).  The charger is about the size of a PCMCIA card, plus the inevitable (but not excessively large) power brick.The combination of a USB SD reader and the BC-10L is arguably the same size as the cradle and its cables, but with a charger and extra NP-20DBA battery, I find that I can leave the charger and cradle at home and only travel with the SD reader.  I just swap batteries whenever the camera is running low.As a side note, the EX-Z4U is only slightly smaller than an iPod and fits nicely into many of the fabric and neoprene iPod sleeve-cases.  I've been keeping mine in a Timbuk2 iPod case I found at an Apple Store.  Of course if you're ordering from Casio's web site already, get yourself a EXCASE2 or EXCASE3.I like this camera a lot for the small size, decent optical zoom, great battery life and large LCD screen.  It's a great camera to own if you want to always have your camera around and just want decent pictures.  If you want to be Ansel Adams, get a different camera. ^_^There are three big drawbacks I've noticed so far:First, the camera has terrible low-light performance (in comparison to a Canon S10 and a Kodak DC260).  Pictures taken without the flash are dark and grainy, often with purple specks on them.  Expect to use the flash all the time.Second, the camera ships with \"medium\" compression turned on.  Presumably this is so you can put more than 3 pictures on the camera out-of-the-box (the built-in memory is small).  However, I took 20 pictures or so before I noticed this and was annoyed by the compression artifacts on the originals.  When you get the camera, make sure you turn the \"Quality\" to \"Fine\".And last, of course, is the lack of a movie mode in the US version of the camera.  The EX-Z4U can even *play* movies recorded by other Exilim cameras, just not record them.  Talk about adding insult to injury.  Also, get the latest EX-Z4U firmware from Casio's web site if you don't already have it.  The 1.0 firmware has some white balance problems which the latest version fixes.", "Date": "January 27, 2004"}, {"Title": "Great value for your money", "Author": "Ajay Tirumala", "ReviewID": "RWD5H05EMCZ3I", "Overall": "5.0", "Content": "This is my third camera (second digital) and I think you should grab this one for the price.This camera has a lot of options, so it may take a while to get used to it. Don't give up, patiently try out the options and once you get used to it, you'll appreciate each of the options.I'll first talk about the plusses.The obvious ones are 4M pixels and 3x optical zoom, ultra sleek design (by far the best looking camera I've seen), dock availability, super fast startup and capture time. Here's a brief mention of other features.1) Large LCD screen for its size. This really helps for focus and also for previewing the pictures.2) Best shots mode: Though it takes a while to get used to different modes to figure out the best possible setting, once you remember that, you're in tune to take great pics. I got fantastic pics of my campus on a cloudy day. The scenary mode allows you to capture intricate landscape details even in the borders.3) Long exposure: You can take night pics with the long exposure mode (upto 4 seconds), the picture quality was awesome.4) Fits in my shirt/coat pocket, no bulky stuff to carry around, can travel with your hands free.5) The superimposing feature, where you and your buddy can take pics of each other with a scenary and merge the pic with both of you in it, sounds like a cool feature (if you're not an Adobe pro). I haven't had a chance to try it though.  After mentioning the coolness factor, please read this also. For indoor pics, the flash is not powerful enough for objects that are say about 10ft away, but for closer objects it's good, or if the room is well-lit also, its good. Make sure you choose the correct white balance. OK, this is a feature you'll have to test out if you're not a pro. Especially, if your room has fluorescent lamps, there is a special setting and I did not get good quality pics with the default setting. The US version of the camera does NOT have MOVIE mode. I don't care for it, if you do, you should look for other cameras. There are cameras which have movie mode for this price. And yes, if you're planning a long trip you have to carry the dock for recharging (you save on battery costs though). The 10M memory bundled is inadequate, additional memory is a must, I bought a 256M SD card which costed me about 80 dollars.", "Date": "December 9, 2003"}, {"Title": "Casio Exilim EX-Z4U - BIG DISAPPOINTMENT !", "Author": null, "ReviewID": "R19FSFKZW6CN69", "Overall": "2.0", "Content": "Pros:The small size of this camera is excellent. Very nice and easy to carry around in a pocket. Great display size. Very nice! 4 megapixel spec, very nice again.Decent quality with landscape photos.Great cool factor! Nice to hold.Cons:Awful pictures of close in subjects or indoor scenes. Digital noise is very intrusive in pictures. You would think that a 4MP camera would take good photos, this camera proves otherwise. My 1.6MP and 2 MP Kodak's pictures are much better. Digital noise ruins most pictures from this camera if the subject is close in. Focus is a slight problem also as it seems to slightly not be flat throughout the scene but the noise, what a waste of time spent trying this camera out. All settings were tried to make camera perform well, photos with people in them close up always looked awful. The lighter colors always have digital noise colored sparkles throughout.Before I forget, the digital zoom is so bad in reproducing an image it should be left off (the controls allow you to do this). True garbage.Summary:The camera is junk. I thought mine was perhaps broken but other reviews agree with my findings. I'm returning it. Buy it if size / cool factor are what matters or if getting the shot is more important then getting a great shot.", "Date": "January 13, 2004"}, {"Title": "Lack of AVI mode for the US only", "Author": "Dan \"danlong9\"", "ReviewID": "R2AVGD11YXMP2A", "Overall": "2.0", "Content": "I was disappointed to find that the US model of the Exilim Z4U camera has fewer features then the foreign model.  Mainly the movie feature is missing. I contacted Casio to find what was up and if an upgrade would be available.  After contacting Casio I received the following reply.Well basically You need the EX-Z4  ( one without the \"U\").  This one is not officially released in the US by Casio IncDo an internet search for the model which should take you to international store that sells themThere is no info available on a future \"fix\"Don't buy the US model.", "Date": "January 14, 2004"}, {"Title": "Love it, Carry it with me all the time", "Author": "John R. Hurley \"hurleyj@optonline.net\"", "ReviewID": "R2GG628KH99L16", "Overall": "4.0", "Content": "I have to admit that this camera surprised me at first.  I did not think I would have liked using it since I am used to larger higher MP cameras.  Because of the small size I carry it everywhere and take more photos on a daily basis. I find that using the Basic Photo mode it takes great pictures that I can blow up to at least 8x11 (or larger)when using it's fine mode.One of its best features is the large LCD screen,  It is just huge for a camera of this size.I have used the \"Best Shot\" mode and find that it sets up the camera for some standard shots and special effects (20 in all)which is great.You can also setup your own best shot mode but I have not done that yet.I don't have much need for a Movie mode in this camera because I have a micro digital Video camera that I like to use for motion shots.  Not having the movie mode in this camera is not a big deal for me. The battery lasts forever but, it needs to because the only drawback is you can only charge it in its base.That means you have to take the base and the ac adapter with you if your going on a trip.  Once you got a full charge I have used the camera for Days (manual says 8 hrs battery time) without having to charge it again.Bottom lineProI like the small size and the quality of the photos it produces. Huge LCD screen.Simple to use and has great features (Onboard 10 MB memory, histogram, 20 BS modes, Rule of thirds grid, Spot meter, Matrix type metering, internal photo rotation, etc...)Battery life is great.Quick startup (once you turnoff the splash screen and startup sound.ConNeeds travel charger, Movie Mode (?), Needs a Customized case.", "Date": "December 2, 2003"}, {"Title": "sweet camera", "Author": "Dawn Cahill", "ReviewID": "R34MM6Y6HFXKWS", "Overall": "4.0", "Content": "I purchased this camera two days ago AFTER I came back from vacation - being very disappointed with my old camera (with film, and a 1 hr photo place.. remember those??) I bought the Casio Exilim EX-Z4 over the nokia for a very vain reason -- it was smaller and cuter. Bringing it home and taking unauthorized pictures of my family and the messy rooms of my home I was extremely surprised at the speed I was able to take pictuers, the incredible sharpness of each photo, how easy it was to change lighting issues and sizes. (being technically - challenged, this was incredible) My ABSOLUTE favorite feature is the \"coupling\" shot feature where I can take a picture of my sister and then switch places with her so that she can take a picture of me and it looks seamless!!! I am unaware of other digital cameras and if they can do this or not - but its phenomenal! I took it out into Manhattan today and took a photo of the silver still-man on Broadway and then a picture of a man looking at a girl's rear end  -- the result is hilarious and it is now my desktop picture. The LCD screen in the back is quite large and makes it very easy to shape the photo you want to captureAlong with the camera, comes a USB cradle/charger making recharging the battery very easy and making picture loading from the camera to your PC a BREEZE. Slide the camera in, hit the USB button and voila! Your pictures are loading and you can then delete them from your cameraI reccomend this camera to beginners (with $500) and I also reccomend that you get a memory card along with it. Once you start taking pictures, don't let lack of space interfere. I purchased the 256 MB card and now can click freely.Excellent purchase... I got what I paid for. Money well spent.", "Date": "October 18, 2003"}, {"Title": "Very disappointed in the Casia Exilim EX-Z4", "Author": "Ian", "ReviewID": "R1T9VO6ARJ1CR4", "Overall": "2.0", "Content": "Before buying this camera I read many reviews and looked at some very impressive galleries. My comments are:Positives:1. Small, light and compact.2. Large LCD screen although too few pixels.3. Ease of use4. Excellent macro results.However, the negatives and inherent quality faults outweighed any positive as follows:1. Within a week of getting my first Z4, the electronics malfunctioned and resulted in the camera `freezing' every time I used the right arrow next to the select button.2. This camera also had problems focusing and pictures mysteriously disappeared during download.3. Picture quality was often poor with excessive `noise'.I exchanged this camera in mid February 2004, and within two days have experienced the following fault:1. Excessive blue tinge on all the pictures, regardless of whether a flash was used. Downloading the Firmware upgrade 1.02 has not improved or solved this problem. All pictures taken with this camera are unusable. Correction of the white balance will temporarily solve this problem until the camera is turned off when this correction is lost.My advice is that until Casio have seen to their quality problems, this camera should be given as wide a berth as possible. I will now return this camera and try exchange it for a different make - possible the Canon A80.As a last comment, Casio, while having a very informative web site, do not appear to have an easily assessable customer care line or comment/feedback section.", "Date": "February 23, 2004"}, {"Title": "But can it take movies?", "Author": "Amazon for everything! \"Amazon for everything!\"", "ReviewID": "R2P757MYW5KPHX", "Overall": "4.0", "Content": "I had an Ex-Z3 which I sent back as soon as I heard that the Z4 was coming out.  After all, the Z4 is supposed to have 4.0 M resolution, better battery management, and 60 sec. movies and all at the same price. BUT...after having waited till it became available and then doing some research apparently there is a BIG difference:  the US version does not support avi movies as did the Z3.  The rest of the world does not have this problem, just US.While I had the Z3 it was great, but not outstanding. I appreciated its compact size and the avi movies.  Picture resolution and color was good, but color was not as good as the Olympus C-2000 (2.0 Mp) I traded up from.  The flash is weak, but it is a smaller camera,  so what do you expect.  The main selling point is the size, because if you don't carry it around, what good is having a high quality camera?", "Date": "October 19, 2003"}, {"Title": "After looking at other cameras....get the Canon S400", "Author": "Amazon for everything! \"Amazon for everything!\"", "ReviewID": "R2L1HHLYPXC24R", "Overall": "3.0", "Content": "I had the EX-Z3 but returned it when I heard that the Z4 was coming out (see review below). I hesistated to buy it since it did not have .avi capability. In the meanwhile, I extensively tested the Minolta Xt (really sucks at everything, would not recommend) and then the Canon S400. The S400 takes superior pictures. The Z3 would frequently take pictures out of focus, but is hardly a problem with the S400. Also, the flash is underpowered but not in the S400. The .avi movies are better in the S400.  The only advantage that the Z4 has are price (but by only $40), lighter (but the S400 is pretty compact) and in the only department that really mattered,  the Z4 does have a much faster cycle time for taking flash pictures.  Even if they came out with new firmware to enable .avi in the Z4 I am sticking with my Canon.", "Date": "January 11, 2004"}, {"Title": "great all-around camera", "Author": null, "ReviewID": "R3JJAFMOVC6J9I", "Overall": "5.0", "Content": "the only thing i don't like about this camera is the lack of a movie mode.but if you set that aside, the things i like most:- it's very compact - the size of a pack of cards- 3x optical zoom, then digital zoom on top of that- strong battery life -- 200+ pictures taken before it needed recharging- nice integration of SD flash card.  i think these are the best cards out there, and you're starting to see readers integrated into laptops, etc., which tells me this format is winning the standards war- key feature is the mode selection -- my last digital had the capability to take night shots, but this sets up your camera with idiot-proof profile selections.  outside, choose an outside mode, twilight?  that's there too.  probably 20 modes to choose from.- handy feature when you're with your girlfriend, you can take the shot in two steps - take part 1, then hand the camera to the person you just took the shot of; they get a ghost image of the left side of the picture, and can frame you on the right.- personally, i don't like to advertise that i'm carrying around $400 worth of camera...this is a tight package that you don't need to wear a harness to have with you...inside your jacket it goes, and no one's the wiser.- playback mode has a calendar, which divides your pictures into the days that you shot them, so you can better manage your collection before you get it onto your pc.the last thing i was looking for when i walked into compusa was a casio...the guy at the counter said he had just purchased one, so i took his advice and i'm glad i did.cheers!", "Date": "November 29, 2003"}, {"Title": "DO NOT BUY", "Author": "Colby Moore", "ReviewID": "RTJTD2LYOPC8U", "Overall": "1.0", "Content": "I bought this camera, despite all the reviews, for some stupid reason. This must be one of the worst cameras I have used. I figured the quality would be decreased by a little bit because of the size, but MAN! My 1.3 megapixel built-in digital camera in my VIDEO CAMERA takes better pictures than this camera in most situations. That's the thing about this camera, if your lighting isn't perfect, your shot will turn out like crap. This is due to the excessive digital noise in the picture. I bought this camera yesterday and took it back today because i knew that this camera would be a waste of money and a bad investment. If you want a camera that is about as small as this one with the same or better features, buy the Canon PowerShot S410 Digital ELPH. For forty dollars more and a 32 mb compact flash card, it is a much better deal for only about forty dollars more. If you do, you'll be MUCH happier.", "Date": "May 15, 2004"}, {"Title": "I am very impressed", "Author": "skater dude", "ReviewID": "R35FL72PIVE61T", "Overall": "5.0", "Content": "Well I wanted this for xmas and I got it, however I was still very skeptical, for such a small camera how could it take good pictures? But I was surprised it takes excellent pictures and is very easy to use, the screen is very large and instead of making my eyes hurt it is a pleasure to look at, the buttons on this are easy to use even with my oversized hands. The best shot feature is wondurfull, it makes this cameras already good pictures even better, I love the coupling shot, I made it look like there was 1 of my friends twice in the same picture. For size comparison, pull out your credit cardand look at it this is how large the camera is and is as thick as the average persons thumb. If I had any complaints it would be that with the internal memory you only get around 7 to 10 pictures depending on the best shot feature and what size the picture file is, so be prepared to spend an extra 50$ on a memory card.Over all I am very impressed casio did a great job.", "Date": "December 27, 2003"}, {"Title": "5 Stars - Only because you can't give it More!", "Author": null, "ReviewID": "R3LGMW5OL69C6V", "Overall": "5.0", "Content": "Unbelievable!  I carry it every where.  Clear image view, downloads easily to computer.  The battery life seams very strong.  I can leave it off the cradle for days and still have almost a full charge.If I have one complaint it would be that the owners manual is only on CD.  There is a paper qick refference guide, but I like having a paper manual to refer to on the go.  After all you don't usually take your computer with you when you go try out your new camera, but it would be nice to have the manual.I've printed a few pictures on a non-photo inkjet printer, Epson C82.  On plain paper the image is reasonable.  On photo paper it looked almost like a store print.  I think with a photo qualily printer the results would be quite professional looking.I've used several of the settings, I'm sure not all as intended.  The pictures are all very good, though I think when I find the time to \"read the CD\" I'll learn when to use what and have even more fun.I love this camera so much I've already reccommended it to 3 people shopping for digital cameras.  One friend and twice now at a camera counter to people I didn't even know.  I pulled out my own camera and showed them pictures I've taken - a subtle way to brag about my four legged kids, ;) my 3 Jack Russells.  I'm thinking abut buying another one for a Christmas present.", "Date": "November 27, 2003"}, {"Title": "Conveniently Usable", "Author": null, "ReviewID": "R16EYSLH0V6WBP", "Overall": "4.0", "Content": "PROS - Digital convenience, `pocket' size, battery life, 4.0 MP, 2\" LCD, Movie Feature, great macroCONS - problematic color reproduction, lag, intense flash, cradleBOTTOM LINE - I recommend this camera to all who want a very compact digital for convenience, don't mind correcting color & are willing to pay the price.I'm writing this review in March 2004 on my first digital camera, the EX-Z4 purchased in December 2003. I bought the gray market non-USA (not Z4U) version on eBay because I wanted the 1-minute movie feature. The 1-minute movies with sound are excellent. They look clear and natural at 14-fps only limited by the 320x240 pixel size. You can shoot as many 1-minute clips as you have room on the memory card. The manual says you can have longer movies with a larger SD card but I haven't seen that with my 256MB card.I use a 256MB SimpleTech ProXTM Secure Digital (SD) Flash Memory Card, with write speeds up to 10 megabytes per second. I was hoping the fast write speed would reduce the lag between shots. Not sure if it has but I sometimes miss shots in quick situations. This is usually due to auto focus lag and write speed lag for 2nd shot. I read that it's fast but is it fast enough? IMHO, Yes for the casual user, no for more serious needs.The color reproduction is not always very accurate. I was a professional photo developer for 5+ years and acquired a very good eye for color balance. (A tip for noticing correct color balance is to look at shadows. They don't reflect as much color as white and usually should be colorless.) Most always noticeable as blue in flash situations the color in normal daytime use is also inconsistent. It's nothing that Photoshop or Paint Shop Pro can't correct with ease. Although not convenient when you want to run over to the local drug store and print a few right off the SD card. I think you might be able to correct the color at the print kiosk.I also just downloaded the firmware update on the Casio web site in hopes to fix the poor color reproduction. I will update this review when I have a chance. Also the flash is very strong sometimes causing people to blink or have red eye.The only other inconvenience is that you need the cradle to charge the camera as well as transfer via USB. Not that big of a deal to me. This camera gets used a lot because it's so small it fits in the front pocket of my jeans. It starts up quickly and is ready to shoot on a whim. You can put a lot of pictures on a 256MB card and you can quickly erase ones you don't want. The battery seems to last so long that I don't even realize it uses a rechargeable. So basically the camera is very convenient and therefore a good value for most of your point and shoot needs.The 4.0 MP picture quality is sharp and with the highest setting 2304x1728 on fine you can print even larger than 20\"x 30\". You get good creative ability with the zoom which is 3X optical (35-105mm) and 4X digital for 12X combined zoom ability. I notice the digital zoom requires a solid tripod or lots of light to maintain sharp clarity and focus. There is even a limited form of depth of field (aperture) control with the custom shots settings. The macro feature allows you to focus as close as 6cm and has awesome clarity. I also wouldn't want to have a smaller LCD viewer than the 2\" on this camera, which does a very nice job. You also get a self timer, audio recorder, alarm clock, nice calendar sorting feature and a bunch of programmable custom shot settings.I couldn't hold out for the Sony DCS-T1 5.0 MP at the time I got the EX-Z4. I would guess the Sony is better, because of the resolution, a Carl Zeiss Vario compact optical zoom lens, 2.5\" LCD viewer and superior movies. Hopefully better color reproduction too.", "Date": "March 29, 2004"}, {"Title": "Great for the price, SO small", "Author": "Herman Mainelli \"Herman.\"", "ReviewID": "R327W3A6XL6X88", "Overall": "4.0", "Content": "This is a great, very small, pocket camera.  It has served me well, I have now had it for a year, and find it to be very dependable and  accurate.  The pictures are either awesome, or grainy, one of the two.  They're pretty much always great with the occasional lemon, but thats probably due to me not focusing it correctly.  The LCD is great, 2 inches, but sometimes looks like there's that \"snow\" on the screen which is weird, but it still functions.  My only HUGE gripe with it is this:  When you look through the viewfinder (the glass viewer, NOT the LCD) the image you see in there is smaller then the actual image that comes out.  So if you took a picture of a ruler, looking through the glass it would be say six inches, and you snapped the picture.  It would really come out showing about 10 or 12 inches! not the picture you thought you took, however the LCD is accurate.  Its great, buy it if you want a really nice small camera for the price.", "Date": "October 19, 2004"}, {"Title": "Width and Height of a Credit Card", "Author": "Scott Canoni \"Tech Guru\"", "ReviewID": "R8EUHM69V0YRA", "Overall": "5.0", "Content": "Take a credit card out of your wallet right now and look at it.  This camera is the same width and height as the credit card and a little less than an inch thick. And it's only 4.55oz including the battery! And it has 3x optical zoom!  Amazing!I don't use the software because it so easily works with Windows XP.  As soon as I plug it into the docking station and hit the USB button, a dialog appears on my screen asking me what I want to do with the camera.  I choose to open a folder to view the pictures as thumbnails.  You can even have Windows XP automatically do this every time.  I then select the photos and hit cut (Ctrl-X).  Then I paste them to my hard drive.  It's that simple and it's fast.You will not be disappointed with this camera.", "Date": "February 12, 2004"}, {"Title": "Great camera terrible picturess", "Author": "H. C. Clinton \"Simon Lazarus\"", "ReviewID": "R1BHRLDAHWNSAH", "Overall": "3.0", "Content": "Just bought the Z40 model here in the UK, and did my market research afterward rather than before. I decided that on balance for my girlfriends needs that I had probably bought the best camera for the job, and although I find it just a bit too small to hold properly, Girlfriend loves it and it is impressive in almost every important area except that all our pictures are terribly out of focus in a circular region all around the image. It's nowhere near as good as our old Kodak 2MP Camera for image sharpness and so dissapointing we are taking it straight back to the store. It's like a great big blur filter has been applied by some retouching software, only it hasn't. I took a shot in the shop when I bought it and when we printed it out at home it shows the problem superbly. It's completely unacceptable, and I can't believe people would put up with it. Perhaps it's faulty. Probably will go for a Cannon, or anything with bigger better optics.", "Date": "August 13, 2004"}, {"Title": "Great screen, Great camera", "Author": "T. Florin", "ReviewID": "R280QYKKLJDXWL", "Overall": "5.0", "Content": "I've had this camera for about three weeks and have taken about 500 photos.  The photos are terrific.  The camera is a joy.  I chose it due to its small size and large screen.  Compared to the competitive products, the 2\" screen is wonderful. My kids jump to see how each picture comes out and crowd around this little marvel.  Battery life has been great.  My only criticisms would be the software that came with the camera (both the casio and the kodak) is poor.  You are much better off with a copy of acdsee.  I would also like the ability to use a small travel charger and not need the cradle all the time.  finally, the cradle is not usb 2 compatible, so I use my USB 2.0 card reader.  I debated between this and the elf and have no regrets about my choice", "Date": "January 21, 2004"}, {"Title": "Everything I expected", "Author": "Jim C", "ReviewID": "RZC4SDLWHBGBO", "Overall": "4.0", "Content": "I've had the camera about 1 week now and love it.  So many features /and controls you've got to read the manual to use/understand them all! I doubt anyone will use them all but it's nice to know they are there.  The camera is very easy to personalize if you like.  Takes GREAT pictures (digital zoom is basically worthless although it is on most cameras).  Most liked features: Small size, large 2\"sreen, very versital.  Dislikes: only one so far... it is too easy to \"format\" your memory card by accident(which erases all pictures on the card even if they are protected).  It should require more than one push of a button to do this.  I wrote to Casio suggesting a prompt \"Are You Sure?\". This has happened twice... once by me learning the camera and once by someone familar with digitals checking out the camera.  So be careful!  Oh and it should come with a case!  Not having movie capability was not important to me.  Only improvement I'd like to see is ability to direct connect to TV for viewing of pictures on-screen (my daughters Olympus has that feature!)", "Date": "December 11, 2003"}, {"Title": "Great value - recommended", "Author": null, "ReviewID": "R1QFPZPYKIST7O", "Overall": "5.0", "Content": "Couldn't disagree more with some of the other reviews. We bought this camera as our second digital on the recommendation of the salesman at the local Apple store. We went to buy another Nikon Coolpix for my wife, but the size and quality of this camera blew us away. I have taken hundreds of photos in the last month or two - indoor and outdoor weddings, museums, family trips, professional shots for websites, etc. Indoor photos are great, if you remember the basics of flash photography (film or digital) e.g. long distance + small flash = crappy picture (No surprise here.) One of the best tricks to use is to turn the auto flash off indoors. You'll be amazed at how good the shots come out using ambient light.The only two criticisms we can think of are the digital zoom is not much use, but that's true for about all the other digital cameras I've used. The other is that manual does not describe the Movie record function that is advertised. But hey, if it's that important, buy a camcorder.Do yourself a favor and buy a 256MB SD card at Costco, Staples or Office Max for ~$60 and you'll be happy. This camera fits in a pocket or purse (even an evening bag), battery has great life, photos are great - can't ask for much more, especially at this price. Highly Recommended!!!!", "Date": "July 4, 2004"}, {"Title": "Excellent Tiny Camera", "Author": null, "ReviewID": "R3DPD8Z14O6DIT", "Overall": "5.0", "Content": "The picture quality is unreal, the features for this size are excellent, the complaints by the other person are wrong.  All the rave reviews cover it so let me add my two cents.  Only downsides, well designed power button is small to avoid it powering up but if you have huge fingers its small.  If you travel you have to take the cradle with you to charge the battery, no direct AC connection to the camera.  Of course buy a 256mg SD card for real use storage.  The USA version does NOT do a 60 second movie, if you want that feature, you have to buy the international version.  ONLY camera I know that does split screen double exposures.  Lots of Excellent features.Overall this is an excellent camera that does not suffer from focus lag and is super easy to use, unlike a lot of other vendors the camera interface is excellent and intuitive.", "Date": "December 2, 2003"}, {"Title": "Works very well", "Author": null, "ReviewID": "R2GI2Z3L3Y1YYZ", "Overall": "4.0", "Content": "I have had this camera for about two weeks now.  For me, the camera works very well.  As another reviewer said, you do have to set up the camera to take the best posible picture. I use the \"Best Shot\" feature and it works very well.  I have taken about 60 photos and all but two have come out perfect. The two that didn't weren't that bad, it is just that the color was a little dim because I had the wrong setting for the picture.  Really, setting the camera up to take the best shot is just a matter of getting used to the camera.  There are only two really small cameras that I have seen on the market that also have optical zoom. This one and the Pentax Optio S4. I bought this one because it has a LOT LESS shutter lag.  I hate that. Especially if you hands are shaky like mine are. So far, I have been very happy with my choice.  I didn't give this camera 5 stars because it doesn't have the movie mode.  Not that it is importand to me, I just am comparing it to the optio S4.  I have a sony mini DV camcorder that I spent $$$$ for that.  THe movie mode on cameras is just a novelty as far as I am concerned but if the other one has it, I guess I need to include it in my rating.", "Date": "November 24, 2003"}, {"Title": "Worth every penny", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "R16YPD3EAYSVLK", "Overall": "5.0", "Content": "This Exilim EX-Z4 is a great little digital camera!  It's about the same size as the Optio S4 from Pentax; in fact the Z4 uses a Pentax lens, so it's possible this is OEM'ed by Pentax?  It's slightly heavier (half an ounce or so) than the Pentax, but, on the other hand, the Z4 has a 2\" LCD viewfinder!  It's just a beautiful viewfinder.  The camera works pretty fast and is always ready at your service.  The 3x optical zoom is wonderful, and just plain awesome in such a tiny package.  I picked Casio because it has a bigger LCD and also it's just a bit cheaper than the Pentax counterpart.", "Date": "November 21, 2003"}, {"Title": "Piece of junk... Don't buy It !!!", "Author": "Raul Perez de Leon", "ReviewID": "R2OB0KGY9V9J11", "Overall": "1.0", "Content": "4 Months and it broke?!  I tried to get the warranty and was told that I had to pay more than the cost of the Camera Itself.  I also noticed that there were several identical cameras with the same defect (The lenses) in the service center.... What a piece of junk and what a terrible service of CASIO..", "Date": "June 2, 2004"}, {"Title": "One star lost for Movie Capturing", "Author": "Zaher Yabroudi", "ReviewID": "R2BJWWS0NN1K0F", "Overall": "4.0", "Content": "I am not going to talk technical & features, other reviews covered most aspects.I think it's helpful to mention that I contacted Casio directly re the support of .avi file format (movies) in the Z4U version (US version), and I was informed that a law suit filed in the USA prevented them from shipping the camera with that feature within the states, and that they may offer free firmware update online when the case is closed so that EX-Z4U supports avi's. For those who wonder, EX-Z4U is exactly the same EX-Z4 without the movie support, therefore, if you were able to get your hands on a Z4, then go for it.I also purchased a SanDisk 512MB SD card which gave me the liberty of shooting photo as much as I needed without the fear of running out of memory.Both are great gadgets, I'm going to add the fifth star when Casio fulfills the promise and offers the software update", "Date": "January 5, 2004"}, {"Title": "Decent camera", "Author": "Maxel", "ReviewID": "R94EJ7Z9GJVGV", "Overall": "4.0", "Content": "This camera took fine pictures for me, no blurry circle or anything, and the zoom problem is because it has 3x optical, 4x digital, if you use the digital zoom, it doesn't actually use the lens to zoom in so it naturally looks very bad. I don't completely understand why Casio put this digital zoom feature in since it really serves no purpose, but if you only zoom in to the little line and no further, you will get beautiful picture for an amateur photographer. One complaint is the LCD is large, so its easily broken. Casio advertises it as being able to fit in a pocket, but the fact is I put it in my pocket once and was walking around, took it out, and the LCD was cracked and useless. I had to pay almost $200 to have it repaired. Now someone knocked it off a ledge while I was using it and then stepped on it so it is no longer in use.", "Date": "July 19, 2005"}, {"Title": "Great for the Average Photographer", "Author": null, "ReviewID": "R21QD9V1Y7C19D", "Overall": "5.0", "Content": "This camera has everything your average photographer needs.  It is very simple to use and takes EXCELLENT Pictures.  It doesn't have a movie mode b/c that is what video camera's are for.  It is easy to take along anywhere you go, so that you can capture all the memories you want.", "Date": "December 30, 2003"}, {"Title": "A Great product that exceeded my expectations", "Author": null, "ReviewID": "R3HFDY99TUCLB6", "Overall": "5.0", "Content": "I bought this camera at a local retailer and I feel as though it has definitely been the best of my purchases. I use this camera only for pictures and it has exceeded my expectations numerous times. I believe this is a quality product at a reasonable price. I would recommend this camera to anyone wanting a digital camera.", "Date": "December 24, 2003"}, {"Title": "Good but not a good as expected", "Author": "supmike \"supmike\"", "ReviewID": "R2ZKZ4TG9T441X", "Overall": "4.0", "Content": "i've had this since it came out.  i like the sleek design but i'm disappointed that ths US version doesn't come with the movie recording feature.  Its somewaht disappointing if you pay ~$400 for a camera.also i miss my sony U-20, a 2.0 meg point and shoot.  the ease of that camera was great. with this casio, you have to pic the setting (like portrait, night scene, scenic, ect) you want to take pictures.  its just too complicated when you have like 20 choices! i just want to point and shoot and get a good quality pic.", "Date": "November 22, 2003"}, {"Title": "BIG DISSAPOINTMENT", "Author": "Micael Kambakidis", "ReviewID": "R2N3EOOK9IL7HR", "Overall": "1.0", "Content": "I bought this camera 3 months ago and since then i have kept it indoors. Despite the minimum usage this camera had undergone it broke TWICE! the second time i was informed by the service technicians that the lenses were broken and had to be replaced - i had to pay additionally 300 Euros !!!!!!!Stay away from this junk!!!!!!!!!!!", "Date": "April 8, 2004"}, {"Title": "Great photo quality, easy use, tiny size!", "Author": null, "ReviewID": "RCCWCYSXA6SWN", "Overall": "5.0", "Content": "I did A LOT of research before buying this camera.  My coworkers are so impressed with my new camera, that 2 of them have purchased the same model!Here are the major reasons I bought the Casio Exilim EX-Z4U:- Tiny size- Excellent photo quality- 3X optical zoom (I turned off the digital zoom)- Ease of use- Quick speedThe only thing this camera is missing is the movie mode.  This feature is available outside of the US on the EX-Z4, but not the EX-Z4U.PS - I picked this one over the Pentax Optio S4 because of the feedback I kept reading about the superior photo quality from the Casio Exilim EX-Z4U.", "Date": "January 24, 2004"}, {"Title": "I own the Exilim Z4 & S3", "Author": "Ronald Lewis", "ReviewID": "R2ZU4KGR57W4TY", "Overall": "5.0", "Content": "the Z4 is a little thicker (still 1/2 as thick as the Canon cameras) but it has some important advantages over the S3.  first, the location of the lens on the S3 is a pain and your finger will get in the way (this makes the Z4 easier to use).  Second, the obvious difference in MP (the S3 is a 3MP and the Z4 is a 4MP) means that the picture will be sharper when you print it.  Third, on the S3, the battery cover is a little weak compared to the Z4.  Fourth, the Z4 has a built in speaker that you can hear all sorts of sounds (good quality too).ok, now that you have read my first paragraph, i will tell you that i LOVE both of these cameras.  they are very light, easy to use, relatively cheap and the feature's are very powerful.  i have owned the Canon S200 & recently the S300.  they both weight just a fraction of the S300 & are easier to use (in my humble opinion).YOU WILL LOVE THESE CAMERAS!", "Date": "November 7, 2003"}, {"Title": "GREAT camera for casual photographers...", "Author": "Kala", "ReviewID": "R21XY6TU0461KH", "Overall": "5.0", "Content": "What I mean is.. this camera works GREAT for people like me who just want to take pictures at family events and parties, not for people who are heavy in to photography and want alot of control over their camera.This camera is tiny (about the size of a credit card, but 1/2\" thick) so it fits easily in to a jeans pocket or coat pocket.  It's incredibly easy to transport.  It's also incredibly easy to operate!  It turns on super quick, you flick the switch to picture taking mode and hit a button.  There aren't 20 million buttons and switches on this camera, so even a novice like me can easily operate it.It has some faults - the zoom feature takes HORRIBLE pictures - so don't use it!  It also doesn't take very good movies.  But for taking pictures at family events, or taking pictures of a new baby, or new puppy (in my case!) it works GREAT.  I absolutely adore this camera and I use it all the time!  I highly recommend it as a camera for digital camera dummies like myself!", "Date": "December 7, 2003"}, {"Title": "Handy product with big LCD, but NO VIDEO RECORDING", "Author": null, "ReviewID": "R29ENGFSI8CJ6T", "Overall": "3.0", "Content": "I bought this product from Amazon which at the time still adverticed video capability as well, which this product is really lacking. As I was only visiting US soil at the time, the offering from Amazon to return the product was not applicable.Otherwise the product has proven to be handy - but this lack of camcorder feature is really a handicap.", "Date": "July 14, 2004"}, {"Title": "It's a good camera!", "Author": null, "ReviewID": "R36DYUEJAANJGE", "Overall": "5.0", "Content": "This camera is a great camera. The only bad thing is the zoom... it's blurry. But I love it. And I don't leave my house without it.", "Date": "July 11, 2004"}, {"Title": "don't use the digital zoom", "Author": "pattiprn \"pattiprn\"", "ReviewID": "R3S61R5E1PXJYQ", "Overall": "4.0", "Content": "I bought this little diddy for my parents for Christmas.  Part of the reason that I chose this one was the ease in using since my parents are not gadget smart.  They have taken some really awesome pictures but the main fault that I see is the digital zoom.  Once you pass the little red line that indicates the change from optical zoom to the digital zoom, you end up with really grainy pictures. So don't buy this or any camera for the added digital zoom in my opinion.  Although I will say that my parents were unable to really notice the grain difference between the optical and digital zoom until I pointed it out.  I have borrowed this camera for a vacation and found that if I didn't go into the digital zoom it worked great.  I did hand the camera over to a guy to take a picture of my hubby and I and it turned out really grainy.  Since I didn't have time to question the man about his technique, I have no idea what happened.  It was an indoor picture and over and over I have heard the theme of bad indoor pictures.  When using the flash you have to be just perfectly distanced from the subject or you will be under-lit or over-lit.  (Dark and grainy or whitewashed and spooky)  I have seen a very slight amount of red eye that most people don't really notice when looking at the pictures but that's just me.I love the fact that the Casio doesn't require hours of lessons to start out using it.  Otherwise it would have been a horrible camera for my parents.  The black and white photos are really incredible too.  I grew up with film that was only color and never got accustom to looking at a subject and determining whether the composition would do well in black and white or not.  I believe this camera is a great way to experience the best of both color and black and white.  In fact I have had some shots in both and the b/w look the best. Since no camera is perfect for everyone I gave this a 4 out of 5 stars, but it is definitely very close to perfect.  Add movies to it and I'm sold...again.", "Date": "May 10, 2004"}, {"Title": "Don't buy this camera - go with the Canon S400", "Author": null, "ReviewID": "R1CJQT9ORR06AS", "Overall": "2.0", "Content": "I've owned many digital cameras.  I keep upgrading.  I had a Canon S230 (3 megapixels) - awesome image quality - the only thing I didn't like was the 2 x zoom.  Saw the Casio EX-Z4U and purchased it 2 days ago.  Excellent view screen, relatively easy control buttons, awful images.  Everything comes out blue.  Had to double enhance all the images on my MAC and through Adobe Photoshops.  The whole point of a subcompact point and shoot is to be able to get out there, take the photos, and then be able to print or email with no additional steps.  For a 4 megapixel camera this was a real disappointment.  I'm returning it tommorrow and buying the S400 by Canon.", "Date": "March 20, 2004"}, {"Title": "BUY IF YOU DON'T WANT TO RECORD MOVIES", "Author": "Sami Paskin", "ReviewID": "R1P2V57O76H8ZY", "Overall": "3.0", "Content": "it would be a definitly 5 stars IF it could record movies. DON'T GET ANGRY AS I DID. Know that this camera DON'T RECORD MOVIES AT ALL! That's the American Version (with the \"U\" at the end) and I don't know why they make it that way. Did not find any advantage compared with the same camera, without the \"U\" at the end (international version).Buy the international version instead.I feel embrassed I got into this bad deal. Great camera (REEEEEALY great) if I did not have this expectation. IT'S A TRAP, not clearly advised at all. Only reading BOTH manuals would give a sure about what I realized and I'm telling to you.", "Date": "December 9, 2003"}, {"Title": "Don't buy this camera", "Author": "John \"blueguy118\"", "ReviewID": "RWWHKA0UHJ8S2", "Overall": "1.0", "Content": "4 Megapixel no way! Takes .5 megapixel shots at best even at highest quality.  Speckled pictures with distorted color is the best this camera can do.  Don't let the small size fool you its no excuse for the poor picture quality.  The workmanship on the camera itself is subpar and fells like a cheap plastic kids toy.  This camera is nothing but junk.  Don't waste your money, buy something else.", "Date": "April 6, 2004"}, {"Title": "i love this camera", "Author": null, "ReviewID": "R1ZA7UMR5T36VU", "Overall": "5.0", "Content": "i bought this camera in october last year and i've taken approximately 4,000 pictures with it since then, and i've been really happy with most of the pictures.  sometimes in low light with the flash off (yes, it's possible), a good shot can be hit or miss, but occasionally there are some really stunning results...often entirely unexpectedly.  i take a lot of night shots, and i prefer the softness of no flash, when the lighting is just right people have been amazed at what this camera can do.  i also take a lot of pictures of live bands, and with no flash and stage lighting you can achieve some beautiful results.  also, by not using the flash i can take 150+ pictures in an evening without recharging the battery (with the flash it's about half that).  my one criticism is that it can take quite awhile for pictures  to \"develop\" and sometimes an even longer time to take the next shot.  you will definitely need a bigger memory card, the fun of digital photography is often the sheer quantity of photos you can take and play with; buy it when you buy the camera.", "Date": "March 25, 2004"}, {"Title": "Buyer Beware! - Decent camera, bad service & false warranty", "Author": null, "ReviewID": "R2TJ7FIS1ZQ7D6", "Overall": "2.0", "Content": "The LCD screen began manfunctioning within the fourth month of light use.  CASIO support now states that \"lens and screens\" are not covered by their warranty despite what is stated in their products and their website.", "Date": "March 22, 2004"}, {"Title": "Wonderful Camera", "Author": "Mel", "ReviewID": "R3OWP5CSOF7Y83", "Overall": "5.0", "Content": "i wanted a camera that fit into my budget. The seller worked out a deal with me and I was able to get this great camera. It works wonderfully and I use it all the time. It also has video. The only compliant I have about this camera is that it doesn't have a microphone so the videos have no sound. But other than that, it's perfect.", "Date": "October 9, 2009"}, {"Title": "Horrible camera", "Author": "George", "ReviewID": "R10DDH2F4QICJ3", "Overall": "1.0", "Content": "I have used many digital cameras and was attracted to this one because of its size and speed.  Even at its highest quality settings, however, the pictures are terrible!  Everything is out of focus and the color accuracy is aweful.  Either the camera I purchased is defective or it is simply a really bad product.  I'm returning mine to the Casio to try to determine which it is.", "Date": "April 22, 2004"}, {"Title": "camera simplicity", "Author": "BEV BYRNE", "ReviewID": "RNWYD64WBB8SJ", "Overall": "5.0", "Content": "I am proud to own this tiny camera with the ease of use. I keep it in my hanbag.My daughter has one and after seeing it I went out to buy one. I am looking for an extra battery and have been unable to find one-elilim np 20. Can someone help me with this.  thank you.Bev Byrne bevbyrne@adelphia.net", "Date": "January 6, 2004"}, {"Title": "ex Z-4U  Not all it could be.......", "Author": "Long Sam \"writing teacher\"", "ReviewID": "R12V1PUXXHC35L", "Overall": "3.0", "Content": "Things to like about this small camera are the many feautures, the large LCD screen and battery life, docking station is a plus for ease of use.  BUT, the camera has problems with color balance in most modes, flash shots come out weak and with a blue tint over the full frame.. Color saturation is not up to a Cannon or a Nikon by any means of viewing, including the finished print. As an outdoor snapshot point and aim its fine, but look at Cannon or Fuji (VALUE) FOR A BETTER DEAL in the $300 price range.", "Date": "January 3, 2004"}, {"Title": "Disappointing Picture Quality", "Author": "Felipe Lesser", "ReviewID": "R3MQBD7G16TBT7", "Overall": "3.0", "Content": "I just got my new CASIO digital camera last night. I was so excited. After conducting lots of research, I chose this model because of its small size, sleek design and ..hey.. 4 M pixels..! The price was competitive too. The design, menu options, ease to use, large 2'' screen are all very impressive. However, I was so disappointed with the picture quality. You cannot imagine! I don't know how the advertise 4 M Pixels...I don't see them anywhere. At the begining I thought it was just the screen, but when I transferred the pictures to the computer, the quality was still poor. Bottom line: I AM RETURNING THE CAMERA TODAY. Casio has never been known for building quality cameras. They still have a long way to go.... I am going back to the traditional: CANON.", "Date": "December 11, 2003"}, {"Title": "GREAT for Mom's who want to capture daily photo ops.", "Author": "S. Sholar \"Quilter Extraordinaire\"", "ReviewID": "R24OIC69BIGIK8", "Overall": "5.0", "Content": "I've had this camera with me every day for almost two years old and I still love it!  I have a toddler and an infant whom present me with constant photo opportunities, so I carry this camera in a small bag in my little purse.  This camera has freed me up (where film and larger digitals didn't).  I can (and do) take pictures all the time (just over 6000 in 21 months).  I would advise people with larger hands (especially men) to get a hold of a model (store/friend) as the buttons are pretty small, but for most ladies, it works great.", "Date": "December 17, 2005"}, {"Title": "It's not soo great..at least not what i expected..", "Author": null, "ReviewID": "R34OE0HWEMT0VD", "Overall": "3.0", "Content": "I bought this camera like a week ago and I wasn't quite satisfied with quality when i started using it.  I had a fujifilm FinePix2600 2.0 megapixel and I even think the quality of that camera was better than this one.  Maybe it's cause, the smaller the camera, the worse the resolution.  I don't know.  For those of you that are expecting to get your money worth, this camera is not for you.  Go get a canon or a sony one if you're going to spend 399 for a 4.0.  Sony has a lot of 5.0 that's even cheaper than this camera.  (the cheapest one i saw was like 330 for a 5.0 megapixel sony camera) Canon is more expensive but a lot better.  I recommend Canon.", "Date": "November 21, 2003"}, {"Title": "Great form, terrible function", "Author": "jerseymca \"jerseymca\"", "ReviewID": "R2XGPVDA36BA8Q", "Overall": "1.0", "Content": "When I got this camera, I was really impressed. The size is great (just bigger than an Altoids tin), the screen is huge, the zoom is 3x optical and you can choose not to use the digital zoom, the camera is very easy to use and set up, the review function was better than other cameras I've seen, since you can really quickly see your photos, store your favorites in the camera's own memory, and use a '\"calendar\" function to see what photos you took on any given day.But... I took about 50 pictures in a variety of conditions. Upon transferring them to the computer, I realized they generally looked terrible. They looked like what people's worst ideas of digital photos would be: lot of \"noise\" - like really grainy film, things not in focus, etc. I also uploaded them to Shutterfly, as I've done with 400+ other photos, and had them \"developed\" to see if the problem was somehow with my monitor, but no, the pictures are unaccpetable for any kind of camera: film, digital, or otherwise. (Oh, and Shutterfly had difficulties uploading several of the photos, for unknown reasons.)I bought this camera because of the small size, the \"cool\" factor, and its features. I also bought it to improve on my current 1-megapixel camera. My 1-megapixel camera (Fuji Finepix 1400) takes vastly better pictures than this camera. I'm returning this camera and am scared off of all Casio digital cameras now.", "Date": "January 4, 2004"}, {"Title": "Great camera (But no movie mode!)", "Author": "Don", "ReviewID": "R1OWUQ7F2XQAU4", "Overall": "3.0", "Content": "This would have been a great camera if it had the movie mode. I love the short little movies I take with my Canon.  I read several reviews but missed the part about movie mode only available in the European market.  It takes great pictures and is very compact.  I love the 'BestShot' modes and the 2 inch screen.  But if I had to do it again, I'd search for another model with movie mode...", "Date": "December 23, 2003"}, {"Title": "Exposing the cheese", "Author": "Donny", "ReviewID": "R2KUTVX6QQH5WW", "Overall": "2.0", "Content": "I have read mixed reviews about this camera. Most reviews say this camera is not all that great. I tend to agree. I think Dawn Cahill's review from New York, New York is questionable. She probably works for Casio. Her review reads like a tv commercial script.", "Date": "October 30, 2003"}, {"Title": "I like it", "Author": null, "ReviewID": "REJO5H0BSHLEG", "Overall": "5.0", "Content": "Easy to use, very small, great pictures.", "Date": "November 20, 2003"}, {"Title": "Poor Image Quality", "Author": null, "ReviewID": "R3V3U5F3OEXM4A", "Overall": "1.0", "Content": "I purchased the Casio Z4 to replace an aging 1.6 megapixel semi-pro digital camera.  Sadly, I returned the Z4 less than an hour later.The Casio Z4, a 4 megapixel camera, produced images that were blurred around the edges, and produced images with detail worse than my old 1.6 megapixel semi-pro camera.  Apparently, the optics in the Z4 are to be questioned.If you are interested in a digicam for very casual image taking, where quality is not a top concern (but size of the digicam is), look at the Z4.  However, if you want a digicam for taking high quality photos, look elsewhere.", "Date": "October 27, 2003"}, {"Title": "Casio!What a good camera", "Author": null, "ReviewID": "R3JZPXYR4U47BZ", "Overall": "5.0", "Content": "Great l;ittle camera..Sent back optio 4 no way the quality equals the casio!!But like the other buyer said Read the book!Oh yes you must also use the CD because it has the manuel on it..I did'nt care for the Casio software!!But \"you get a Kodak also and I found it to be 100% more easy to use...Trust me on this!I bought a card reader (SD) you just put the memory card in and you save the wear on camera!The optio did'nt come near the quality of the Casio but,pics were very good...", "Date": "November 12, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "4-megapixel resolution for photo-quality 11 x 14-sized enlargements\n3x optical zoom lens; audio playback and voice recording\n2-inch color LCD screen; 0.01-second shutter lag; built-in lens cover\nStore images in either 10 MB built-in memory or on Secure Digital (SD) memory cards (memory card not included)\nPowered by a rechargeable lithium-ion battery (included with USB docking/recharging station)", "Name": "Casio Exilim EX-Z4U 4 MP Digital Camera w/ 3x Optical Zoom and Dock", "ImgURL": "http://ecx.images-amazon.com/images/I/41AX0XWQD5L._SX300_.jpg", "ProductID": "B0000BZG0P"}}