{"Reviews": [{"Title": "This is the only show in town !", "Author": "Bob Feeser \"MillCrafters.com\"", "ReviewID": "R2H5FJYSY856JJ", "Overall": "5.0", "Content": "I just bought one of these. Finding one was a challenge in itself. When I told Amazon to email when the item was in stock, I received an email from Amazon that I never received before. I was told it would be a long time before they would be available. Why, because nobody beats this camera.This camera sports the Super Bright 1.8 lense. This Olympus and the top of the line Olympus are the only two in the industry that have it. What it means is a larger opening, which lets in more light. Consequently, the auto shutter speed is faster, less chance to get a blurry shot. Also the background of the shot is brighter and more defined. I was in a camera store, the manager's personal camera was the C-2020, the predecessor to this one. He had shot a picture of a metal guitar, one with the 2040, and the other with the Nikon 950 (which is twice the money) He printed out a large 8\"x11\" glossy. Seeing them side by side, the definition in the shot was the same, I couldn't tell the difference, but the ivy leaves in the background surrounding the shot, were a lot brighter, instead of being dark and ill defined in the Nikon shot.Consumer Reports rated the predecessor C-2020 Olympus as being the number one camera in printed picture results, knocking out even the 3 and 4 megapixel cameras quality. Imagine that, 2 megapixels, half the money, yet the best results. Sounds like an avalanche trying to get in the door on that one. Well CR just came out with the November 2001 issue, and guess what, the C-2040 did it again. Making the number one spot, and this time they gave it special mention, because the quality rivaled that of the 3's and 4's. Usually a print out at 5x7\" size is what the 2 megapixel cameras are good for. Not this one, the crystal clear shot I saw was an 8 1/2 by 11.Ok, on to the camera. Some reviews, including CR, state that the menu was a little confusing. I did not find that to be the case. Shooting, zooming, previewing, deleting, downloading, etc is a breeze. When I tackle some of the more challenging tasks of manual settings, instead of the complete autofocus etc., maybe then I will learn what they are talking about.The picture clarity is unbelievable. I took a few shots of some metal objects, and thought something was strange, their was little dots on the metal. Upon closer inspection, I realized it was the little flecks of dust. They were so clear blown up on a 19\" screen, something you would not see, little individual flecks of dust, bright and clear. The detail was phenomenal. The zoomed in upclose shot, looked like it was taken one inch away, and was larger than life. Like a real life microscope.The panorama feature, which was previously a Canon exclusive is nice. You can take up to 10 pictures, across a landscape, or a room for example, and then the Camedia software which is included pastes them together, which creates a single panorama. If you sent this shot to a friend, they would receive one pic, that they could navigate around, to see the entire room.One thing that really matters to me, is that this is also the best looking camera. It looks smart. Chrome body, with the larger black hub at one end was the style I was looking for before I learned of the C-2040. Many digital cameras have this metal early 50s look that I do not like. This camera is beautiful in its design.When I first picked it up with its .6 of a pound weight, and relatively small size, I thought it was a toy camera. Then when I took the lense cap off, and turned the camera on, the zoom lense gently whirred when it came out, and it was an immediate feeling of, this is high tech. Oh by the way, having had a Nikon FE with 80-120 zoom, (I still do) I wanted a zoom that was more than 2x optical. That feature was available once again, on more expensive cameras. The C-2040 has a 3X optical. Zooming in, and filling the frame with your subject, makes for a interesting shot, and the 3x is very nice for that. The Olympus model that is directly above this one, has a 10x zoom, but it doesn't have the 1.8 lense. For those of us who were into the 35MM SLRs, know all to well that the cameras with the 1.5s were more expensive lenses, and the 1.2s made the lense look like it was all glass.Also the 1.8\" LCD on the back is large, and crystal clear. Easy to read menu functions, and nice picture views.A few final notes, be careful buying one of these for a cheaper price, make sure the camera you buy has the US guarantee. Gray market cameras come without the guarantee. Digital camera repairs are running a couple of hundred dollars these days, so the warranty is nice.This camera also takes short movies, but they never replace a digital camcorder in that regard.The optional remote control is way better than a timer, which this also has, if you want to get into the shot. That way, your not stumbing over things to get into the shot, and you can wait until the ideal moment to take it. Also, you can fire away multiple shots once you are there.You definitely will want to get a larger smart memory card than the 8 meg they supply with the camera. A 64 meg is nice, and the 128 gives you over 300 shots in standard resolution. The panorama feature only works with Olympus cards, so be sure an pick up at least a 32 meg in Olympus and preferably a 64. Then go out and pick up an aftermarket 128 at a bargain, for relatively unlimited regular shooting. More than one card is advisable. Although the smart cards are pretty robust, going on vacation and discovering a defective card would be disasterous. So multiple cards, covers that base.Additionally the rechargeable batteries are nice. A fast charger with a 2 hour charge time is great. The lesser expensive chargers are overnight chargers. You will want to pick up an extra set of 4 batteries, in  addition to the 4 that come with the charger. It is a good idea to keep the lithium batteries that come with the camera in your camera bag, because they will last a couple of years in storage, and always be there in case you get stuck without charged ones.I bought two bags. One which is smaller, but large enough to hold the camera, batteries, and your smart cards, but not large enough to hold the charger, and your lunch. :-) I like that for local shoots and being small, it doesn't look like you were the hired photographer. The other one which is larger, for getaway weekends, is designed to hold your digital camera, with enough room for all of your gear, and even an SLR. Quantaray makes a nice black leather one for that. You may want to visit your local camera store, to actually see the style that most appeals to you, then come back to Amazon to take advantage of the prices.Their is an available AC adapter, but I chose to buy a stand alone Smart Card reader, that reads and writes. You park it on your desk, leave it plugged into the computer. Saves you from wearing out the electronics on the camera, and batteries don't become an issue. The one I bought is 10 dollars more but it reads and writes, that way I can download pictures from the computer also into the card, and then show them at my destination using the combined slide show feature, and the included cord to hook it up to any TV. Great for presentations.I guess I am getting kind of windy. I am just in love with this camera. Having had a 1 megapixel Sound Vision 209 Mini Cam with a fixed telephoto range, and limited capabilities for indoor shots, this camera is a quantum leap. The super bright lense, gives you great low light picture taking ability. Coupling that with an adjustable \"ISA\" setting of 100, 200, or 400, makes it all the more effective for different conditions. I had heard a professional photographer complaining of having only an equivalent of ASA 100 fixed setting on his Canon Digital elph, he obviously wasn't introduce to the C-2040.Using the camera with your PC is a breeze. You plug in the USB cable, or use the smart card reader I just mentioned, then just go into my computer, and you will see a new drive called removable drive. You click on it, and instantly see the file names of all of your pics. You can copy and paste the whole bunch into a new folder, they copy real quick, then just edit-select all, hit delete, and they are wiped from the cameras memory. A true Windows intuitive interface.Store managers personal use camera, Consumer Reports number one pick in the 2 megapixel category, and they are just plain back ordered at most places, shows you that this camera is the one to get.These features and quality at this price is a winner, considering that you will be picking up 150 to 250 dollars of extras no matter what model you buy. So it makes this one a nice comfortable price point. I know with the money I saved over buying a 4, is enough that I can probably pick one of those up in a year or two for the difference. Although I don't know why I would want one, considering the amazing quality of the C-2040.I'm in love with the camera, did I already say that? Find one and check it out. You will see what I mean.", "Date": "November 22, 2001"}, {"Title": "Lovely piece of work", "Author": "Rochelle Crew", "ReviewID": "R2VEHHVVVH3SNO", "Overall": "4.0", "Content": "This camera was a birthday gift. I had asked for a digital point-and-shoot but my husband, a photography instructor, thought better and bought a camera with manual modes.  The camera is a joy to use and takes beautiful photos outdoors and in, with the default JPG format of 1200x1600 pixels.  This is fine if the biggest you want to go is 5 x 7 (8 x 10 if you're not picky).  If you're an amateur, like me, turn the blasted flash off and go with natural light, but remember to adjust the ISO \"film\" speed up accordingly (the default is 100). All compact flash units are a pain, though this does have an option for a separate flash.  Yes, rechargable batteries and an AC adapter are must-haves.  Leave the camera plugged into AC while the batteries recharge so you don't lose the date/time settings you've entered.The parallax distortion in the viewfinder is different from what is described in the instructions -- if doing closeups, use the monitor to center the composition.The nested menus to control the various functions are confusing, my only real complaint about this camera (other than the \"lens cap of doom\" that you MUST not leave on).  You will live with the manual for a while.  Laminate the flimsy paper covers, it gets dogeared fast.The Camedia Master software is confusing -- you click on the \"download pictures\" menu and get a message that there's no communications with the camera!  Obvious this feature must work with some other Olympus camera.  Same message if you click on the little \"my camera\" icon.  The software sees the camera up as a removable drive, and you have to drill down two levels to get to the pictures.  Once there, you can just drag and drop the pix like any other file in Windows.  For that matter, you can just drag and drop in Explorer, if you don't want to look at the thumbnails.  A serious amateur will need to get better editing software, like Photoshop, to manipulate the captured images.  Make sure you program the camera with date and time, otherwise all images are given a date of 01/01/00, very confusing, and the default names will overlap (default names include the date it was taken).All in all, a very nice camera.", "Date": "March 23, 2001"}, {"Title": "Olympus C-2040 Digital Camera", "Author": null, "ReviewID": "R1NZJBD7UN07HL", "Overall": "4.0", "Content": "This is my third digital camera - and I absolutely LOVE it. I'm not going to go into how great it is, because you can read that anywhere... There's just one or two small things that I would like changed about this camera.  The first is one I didn't read anywhere - the lens cap.  MAKE SURE YOU TAKE IT OFF BEFORE SWITCHING THE CAMERA ON!!!  Otherwise the lens will try to extend and not be able to, and it will make a horrible noise that sounds like the camera is being damaged - and for all I know, it might be. Also... it EATS batteries, and they don't tell you what its AC power consumption is so you HAVE to but their ($) AC adapter, instead of using one you probably already have. Also, it's difficult to find a suitable camera bag as it's an unusual size and shape. But despite all this - I still think it's a great camera - the best I've owned so far.", "Date": "February 13, 2001"}, {"Title": "I would have stopped after giving it 5 stars but...", "Author": "\"sandeeptripathy\"", "ReviewID": "R1HG1KQMBY8CI6", "Overall": "5.0", "Content": "As I said, I would have stopped after giving it 5 stars but decided to write the review as well as to make sure you buy it. No, I do not work for Olympus!You can take pictures with incredibly natural colors under incandescent, fluoroscent and cloudy-sky light conditions - WITHOUT a flash! Something many pros would have trouble with using a film camera and filters. I am also doubling my other reviewer friend's comment that 2.1 and 3.3 megapixel line up eye to eye except if you plan to PRINT larger than 8x10 inch or view full size on a 30 odd inch monitor. The other exception is that a 3.3 or better is useful if you plan to enlarge a relatively small portion of a shot. Otherwise, save your money. Do look at the C-700 though if zoom is a priority.", "Date": "August 21, 2001"}, {"Title": "Good Compromise in a Sea of Digital Cameras", "Author": "Mark Kaminski", "ReviewID": "R2AQ2ESZUG5JLU", "Overall": "5.0", "Content": "I really like this camera, which has very good optical elements (an F1.8 equivalent lens) which is not seen in many lower-end digital camera. The light-gathering power is very good... and I even snapped shots off of a screen showing slides (with flash turned off), and only held by hand; it worked!The 2.1 megapixel image is plenty for the average user. This results in a shots that are about 405kb set on default settings (though you can change this), and images that are about 12\" by 20\" (can't remember exactly)... such that when they are printed the resolution is excellent (even to 8x10)! I saw 5 x 7 printed enlargements that I defy anyone to tell that they came from a digital camera.The menu system on the back screen is a bit confusing, but one gets used to it fairly quickly. A remote control might have been nice, but the timer-delay feature sort of obviates the need.My only real trouble was setting up the software/cable for downloading images (and ended up calling Olympus); the \"Camedia\" software is nearly worthless and I prefer to use PaintShopPro7 to edit shots (and any good graphic-editing program would work fine). Basically, you install a CD-ROM in your computer and it walks you through a procedure whereby you end up with a \"removeable disk\" entry in Windows Explorer (only when the camera is plugged in). The manual didn't clearly explain that. You simple open flap hatch on the side of the camera and plug in the cable (which you can leave attached to the USB port on your computer).As an aside, be advised that most digital cameras have a optical view-finder that does not fully \"agree\" with digital one. Only looking at the digital image preview will truly tell you what you are about to shoot. Of course, one can edit their shots later on a computer (croping, etc.)One MUST buy two additional things: 1) at least a 32mb SmartCard (the 8mb is good for about 16 shots) 2) a metal-halide battery pack and re-charger (and I'd only use the Olympus battery pack that came with it as a back-up set) 3) some sort of case (which the camera does NOT come with)... get one to also carry spare batteries and memory cards.All and all, in a sea of competing digital cameras, I really like this one. A good compromise.", "Date": "June 24, 2001"}, {"Title": "Superb Camera!", "Author": "Dave", "ReviewID": "R36IGHZ4LC554", "Overall": "5.0", "Content": "I have a C-2020, which is a slightly older version of this camera model.  This has been a fantastic camera both in terms of quality, reliability and battery life.  Between some friends and myself we have just about every model in this family (C-2000 through C-3040) and we all love our cameras.Quality: I have taken hundreds of shots, mostly outdoor.  I tend to shoot at the high-quality jpeg level so I bought a 64MB smart media card.  Paired with my HP DeskJet 952 I regularly printout 4x6 prints on photo paper that are absolutely perfect.  I have printed a few 8x10 pictures and they are fantastic.  No one can believe they were taken with a digital camera.  I have to zoom in quite a ways with my photo editing software before I can see any pixels.  The only negative thing I can say is that I wish it had a better macro mode.Reliability: It has been rained on, splashed by a wave, and dropped a short distance onto a rock.  Despite all this it is still going strong a year and several hundred pictures later with no negative affects.Batteries: I use the rechargeable batteries and during heavy use they last 2-3 weeks.  During light use they last 3-6 months.  Compare this to most Kodak or Nikon cameras that last a few days of heavy use.A few comments on my accessories:Forget the 16MB card that comes with it.  I keep only mine as a back up.  You will want a 64 MB smart media card.I bought the Olympus T-CON14 tele-converter lens 1.45x (152mm equivalent) and I am very happy with it.  It can retail up to $200 but I shopped around on-line (I went to cnet.com and looked under \"Latest Prices - Camera Accessories - Lens\") and found it for around $79.  My next purchase is the wide-angle lens.I bought the Olympus Accessory Kit (which is the same for C-2000 through C-3040 models), mostly for the UV filter, adapter tube and 43mm-55mm step-up ring, and AC adapter.  I bought it for about $95, which is close to what all those things cost separate.  The mini-tripod, software, and case that come in that kit are not overly impressive but I considered those `free'.  The lens cleaning kit is handy.", "Date": "May 26, 2001"}, {"Title": "Excellent Camera that is Bare on the ESSENTIAL accessories", "Author": null, "ReviewID": "R1L1RVYV3IEH5U", "Overall": "4.0", "Content": "I purchased the 2040 a few weeks ago and looked forward to taking it on vacation. Truthfully, the software [stinks]. Windows 98 didn't recognize the driver even though I followed every step to the letter. I still haven't figured out why the default file type is effjpg or something instead of a true jpg file. Then there is the 8 mg smart media card. Totally worthless unless you plan on carrying about 8 of them. I can't believe they waste money making those cards. I bought a 64 mg card which was very sufficient if used wisely. I knew I was going to take some web pictures so I took them on low quality. The pictures that I thought had potential, I took on high quality. And the lithium batteries!! Cool!!! I haven't worn them out yet but I did have to go purchase rechargeables and a charger for when they do. But, you aren't supposed to download pictures on the batteries so you have to go buy an AC adapter too. No they don't tell you what the voltage is but you can buy off brand adapters that are specifically made for Olympus cameras. I guess that's it unless you want a camera case. I am proud to say that of all the accessories that I purchased NONE were OEM Olympus. Now if you can get through all that [crud], the camera takes wonderful pictures. The menus can be a pain but after a week of use I can breeze right through them to change any settting. The main reason that I purchased the 2040 was because of the f1.8 lens and the 3.0 optical zoom. This camera takes great pictures in really low light. Sometimes it can be a problem though because a fringe evening shot can look a bit brighter than it really is. I would have given this camera five stars if the software worked right and rechargeable batteries/charger were included. I am very happy with the quality of the pictures.", "Date": "August 6, 2001"}, {"Title": "My First Digital Camera", "Author": "beekeeper \"and stings to prove it\"", "ReviewID": "R37LA6A3MQ2E1H", "Overall": "5.0", "Content": "I had been wanting a digital camera for a while and had my eye on the 2040. I take a lot of pictures just for fun and film processing cost and delay were killing me. I wish I had bought one of these sooner.I've had mine for a week and I love it. I took a few test pics just using the default options and then connected the USB cable to my WinME PC. My PC then recognized the camera and then started my photo software. I was then able to manage the pictures on the camera as though it were a connected disk drive. I did not have to use the included software. The images look as good as the ones on my 35mm film camera.I also bought the optional 64MB memory card which gives me 128 HQ or 306 SQ1 shots. That's plenty for a day's work!The only downside is that lens cap. If it's on when you power up the camera balks as it tries to extend the lens. The AC adapter also seems a bit pricey but it looks like one of those have to have items.", "Date": "September 22, 2001"}, {"Title": "Great all-around digital camera", "Author": "Cricket", "ReviewID": "R2R0KH78J867UR", "Overall": "5.0", "Content": "This camera has been terrific thus far.  I have owned it since February of this year, after it was first became available in the US.  (It is my first digital camera)The photo quality is great, and of course you can instantly re-take any pics that don't meet your standards.  I find it very easy it use and the menu fairly easy to navigate.  I have had a lot of success manually varying the shutter speed and opening settings when in low-light or fast-speed settings where the camera's auto-focus doesn't cut it.I recently purchased a 64-MB smart media card to use for this camera.  On the HQ setting (mid-quality = great for normal size photos, maybe not for blow-ups), I can take 128 photos with this camera.  With the 8-MB card that comes with the camera, you can manage 16 HQ pics.This camera is a great value for someone who wants the versatility and ease of a digital camera, as well as the quality you would expect with a higher-end model.  This model has some great expansion capability too...", "Date": "May 14, 2001"}, {"Title": "Works like a Dream", "Author": "Echoleaf", "ReviewID": "RU0GMZWWGHX9H", "Overall": "5.0", "Content": "This is our first digital camera.  (...)we researched a lot of cameras over the last 3 weeks and picked the 2040.  It works as well as advertised, with picture quality as we expected.  The picture quality was the deciding factor, and I think it can be attributed to the 'Super Bright' camera lens.  Low-light pictures are excellent, in fact better than my SLR (this may say more about my photographic skills, but you get the idea).  We also decided on sticking to cameras in the 2 megapixel range. For those who are new to digital camera, 2 megapixels will allow you to print photo quality pictures up to 8x10 inches.  This is adequate for most people.Pros:* Super Bright lens works as advertised - low light and natural light pictures are excellent.* Picture quality is superb - most of our pictures have been taken with the 3rd highest quality mode and look great.  This allows for 128 photos on a 64mb memory card.* Can be used as a point-and-shoot or fully manual camera.* Flash has degrees of brightness you can manipulate.* Photo transfer with USB port is quick and easy - the camera appears in My Computer as a Removable Drive, allowing you to look into the camera like any other folder, copy and paste the images and even delete them from the camera.Cons:* USB link has not worked as advertised in Windows 2000 but works like a dream with Windows 98.  I went to the Olympus website, where there are NO troubleshooting recommendations for Windows 2000 - just Windows 98.  So I emailed tech support, and he writes back with copies of the Windows 98 instructions I found, obviously not paying attention to the fact that I designated my OS as Windows 2000, had specific questions, AND that I had sent the link of the instructions I had found - the same information he emailed to me.  I asked for further assistance, and that was a week ago (the first response took 2 days).* Remote not included ... The timer can be used in the meantime.* No 'sepia' mode.  (You can tell we're trying to find faults...)This camera is probably the best bang for the buck out there.  ...All in all, an excellent first camera and a true value.", "Date": "November 8, 2001"}, {"Title": "A Good Buy", "Author": null, "ReviewID": "R3C5GZGWJ9AP5", "Overall": "5.0", "Content": "I bought the Olympus Camedia 2040 about a month ago.  I don't think I've ever been more pleased with a purchase in my life.  The C-2040 has everything I could want for a reasonable price.  To give you an idea of how much I use this camera, on a two week vacation, I took over 200 pictures.  It's wonderful!  The lens allows for shots in extremely low light conditions, both zooms allow you to get exactly the shot you want without moving yourself around, and the LCD screen lets you compose the photo before you take it.  I love all the options the C-2040 has.  It allows you to edit photos after they've been taken, choose all kinds of options for different types of shots, and play around with settings such as getting more blue or red in a photo.  I find I can do more \"editing\" on the camera than on the Camedia software!  Finally, I recently ordered prints from a photo place online.  Although they're much more expensive than film prints, you only order exactly the photos you want in hardcopy.  They turned out beautiful.  I never would have known that the prints were digital.  Now the downsides. . .Firstly, the C-2040 comes with an 8 megabyte smartmedia card.  Ugh!  You only get 16 photos with it.  As other people did, I went out and bought a 32 megabyte card.  This allows you to take 64 pictures at once.  Secondly, the batteries that come with the camera are not rechargeable.  Practically every two days, more batteries are needed.  I bought two sets of NiMH rechargeable batteries and a charger.  This works fine.  Third, the LCD display shows the picture that will be recorded on the smartmedia card, but the normal viewfinder (the one used on film cameras) is not always accurate.  To avoid problems, I use the LCD screen all the time.  Fourth, the software that comes with the camera is not very useful.  The feature for bringing in photos doesn't seem to work for me.  I just use Windows Explorer to put the files where I want them.  Also, the software's nice for viewing your photos, but not for doing much editing.  As other people have said, a good paint program would do a lot more.  Fifth, to protect your camera, you need to get a case.  You can get a nice one for $16 in a local camera store.  Despite its little quirks, though, I LOVE this camera.  It is definitely worth buying.", "Date": "August 20, 2001"}, {"Title": "Great optics, great features", "Author": "\"tdogwiler\"", "ReviewID": "RBS1XUXHSQ1U6", "Overall": "5.0", "Content": "This is a great camera for a serious or semi-serious amateur that wants full control of all the camera settings and rarely needs to print pictures larger than 8x10 inches.  If you commonly desire larger photos you should stick with film or look for a camera with a higher resolution (e.g., a 3+ Megapixel Olympus).  Olympus cameras are known for the quality of their optics and this model carries on that tradition.  The F 1.8 lens will allow you to shoot good pictures in situations which would be much too dark for many digital cameras.  I highly encourage you to go with the F 1.8 lens.I have used the camera in a variety of settings from full daylight to multi-slave flash photography in caves and have gotten wonderful pictures everywhere.  The pictures that I have had professionally printed on traditional photo paper have been awesome, and the colors are great.I highly recommend this camera for the serious amateur that wants a small, feature-packed camera to carry instead of, or in addition to, your SLR.Things I really like:1)  The optical quality and color depth of the pictures. 2)  The ability to completely customize the default camera settings  3)  The number of optional accessories that Olympus produces for the camera 4)  The include video out cord for hooking the camera up to your TV. This is great for showing your pictures of to family and friends after a trip.There are a few minor things about the camera that you should be aware of:1)  The LCD screen for viewing pictures is 1.8 inches which is on the small side (but comparable to many competitors cameras)2)  If you turn the camera on without first removing the lens cap the camera will have a fit!!3)  There is no bulb setting and the longest exposure you can set is for 16 seconds4)  Unlike its 3 Megapixel cousins, Olympus does not include the RM-1 remote control with the camera.  Buy it separately . . . if you do tripod work or will use the included video cord to show your pictures on your television.", "Date": "August 14, 2001"}, {"Title": "Easy to operate - just read the instructions!", "Author": "MShuman", "ReviewID": "R29O80VHRAP0IX", "Overall": "5.0", "Content": "This is my first digital camera.  So far it has been excellent.  If you can read.....then it is not difficult at all to set up and start using the camera.  In under 30 minutes, I had unpackaged the camera, installed batteries, taken pictures, erased pictures, shot in movie mode, loaded pictures on computer and printed a photo, not bad for a novice!  Being a novice, I almost did not buy the 2040 based upon a few reviews stating it was too complicated, it is not, as stated earlier, just take a few minutes and read the quick start instructions. Enjoy!", "Date": "October 25, 2001"}, {"Title": "More control for your dough", "Author": "David Kadavy \"Author of 'Design for Hackers'\"", "ReviewID": "R2CJ8GWGAI542J", "Overall": "5.0", "Content": "I learned photography on an SLR, so in looking for my first digital camera, I was frustrated to find that most digital cameras in the price range I was looking for were point-and-shoot. In addition to an idiot-proof mode that is good for when you're not looking for a great deal of photographic control, this camera has Aperture priority, Shutter priority, and a manual mode that allows you to control both. I was thrilled to find a camera with these features for under $500!The optics on this camera aren't the greatest. An aperture of 1.8 @ 40mm is OK, and enables one to shoot in some pretty low-lighting situations as well as take some cool low depth-of-field pictures, but with a maximum f-stop of 10, high depth-of-field shots are compromised, and sunny conditions yield little control. The shutter speeds leave a little to be desired as well, ranging from 4 seconds (useless without a place to put a cable release!) to 1/800 of a second.I don't know how they compute a focal range of 40mm-105mm to be \"3x,\" but it is pretty adequate. I don't understand the benefit of some of these super duper zoom cameras: unless you're using a tripod and cable release, or you're shooting at a very high shutter speed, there's no way you can hold the camera steady enough to take a crisp photo. There is also a digital zoom, but that is nearly useless on any camera: all it does is \"enlarge\" the pixels. If you can get your paws on a copy of Photoshop, it is MUCH better for zooming and cropping photos.Being able to select the ISO speed myself makes it easier to make the transition to digital photography, but I don't understand why there would only be 100, 200, and 400 ISO equivalencies available on this camera.If you can afford a more expensive camera, you may be able to get more control, but if this is your price range, then this is THE digital camera to get. You won't find more for your money in any other camera.", "Date": "June 30, 2001"}, {"Title": "It can be as simple or complicated as you want", "Author": null, "ReviewID": "R3I0JTV52CBJLO", "Overall": "5.0", "Content": "The Olympus C-2040 has been nothing short of perfect for my first digital camera.  It can be wonderfully simple for the point and shoot photographers, and it can also be set up for more complicated shots (adjusting shutter speeds, ISO, and many other things that can go over a tourist photographer's head)If you want to jump into the digital camera market, and don't want to feel the need to replace a \"beginner's digital camera\" in a year or so this is absolutely the one.Just make sure you buy a larger memory card to go with the camera.  You'll soon find that since you don't have to worry about running out of film you can take several shots of the same scene to hopefully get that perfect memory.", "Date": "May 27, 2002"}, {"Title": "Upgraded from C450Z...", "Author": null, "ReviewID": "R1QZY3WL2LL3L0", "Overall": "4.0", "Content": "I had my C450Zoom for almost 2 years. A friend \"broke\" it for me...so had to buy a new camera.  I was wavering between C2040 and C3040...but since I'm not planning on printing too many 8x10's, went for the C2040.  I've been very happy so far.  The first adjustment is getting used to the lens cap.  Second is the multitude of options added since the early days!  I changed my default resolution from 1600x1200 to 1024x768.  The latter is just fine for 4x6 prints (which is mostly what I get).  Plus, it allows many more prints on the same storage card.  The quick time movie option is fun!  No audio, but the video looks like old time movies.  It is just fun. Period.  I bought some filters & extra lenses, but since the standard lense expands out 2\" from the body, you need an extension to put on an extra lense.  That is fine except if you use the viewfinder to take the shot, the length does cut into your view. Weird!  Probably not worth getting extra lenses unless you are way serious.  I have been \"beating\" up the camera over the last 3 weeks and the supplied batteries have not died (3CRV?)  I have found that the instructions are straight-forward...but the manual is quite large (compared to the C510).  I bought the C510 for a first-time digital friend.  I am sure glad I bought the C2040Z!...", "Date": "August 21, 2001"}, {"Title": "Too good to last.", "Author": "Frugal Buyer", "ReviewID": "R3PCOM06BWO6O2", "Overall": "5.0", "Content": "A feature that often determines the price of a camera (film or digital) is the quality of the lens. Unfortunately, the general public looks at magapixel or zoom numbers. I think this is why Olympus is looking towards competing with those numbers as opposed to continuing to produce 2 megapixel cameras with fast/bright lenses (which I'm sure costs much more for them to make anyway). The 2040 is one of those. Doomed for \"close-out\", this camera in my opinion is the best combination of a great lens and perfect resolution - by perfect I mean a good balance of clarity and memory used. Bear in mind that many 2 megapixels can take better pictures than some 3 megapixels. From what I see in stores nowadays, Olympus no longer offers 2 megapixel cameras with their F1.8 lenses. None of the other brands offer a lens this fast/bright at any megapixel.  Buy one of these now while they still have it if you want a professional level camera at 2 megapixels, a resolution which is much more than what most of us need.", "Date": "January 20, 2002"}, {"Title": "The Olympus C-2040Z - a second review", "Author": "Alfred T. Miles", "ReviewID": "R9169PX59M1ID", "Overall": "5.0", "Content": "I wish to add further comments to my first review of this camera.  Now that I have had a chance to use it, I know that I made the right decision when I bought the Olympus C-2040Z.  I could not be more satisfied.  It takes some of the sharpest pictures these old eyes have ever seen, especially nature shots.  I have pictures taken by this camera and printed on my Epson C-80 printer that are National Geographic quality.  And I am talking about 8X10 prints in full living color.  This camera has more than met my expectations.  I cannot recommend it strongly enough.  The excellent review by Consumers Reports should help further convince anyone who might be trying to decide which camera is the one for him or her.", "Date": "April 29, 2002"}, {"Title": "This camera is Awesome!", "Author": null, "ReviewID": "R1U1VOZGNOU6O", "Overall": "5.0", "Content": "After several WEEKS of browsing camera websites for reviews and doing research, I finally chose to purchase the Olympus 2040 camera, and I must say, I have been very happy with it.This thing has so many options that it will take you quite a while to figure out everything it can do.  Full manual control is great, and the exposure lock is very handy.In terms of batteries, make sure you buy some NiMh rechargeables for it - try thomas distributing ..  it seems to last quite a while on these.No complaints!", "Date": "September 20, 2001"}, {"Title": "Finally Found My Dream Camera", "Author": "Marsha Tokarczyk", "ReviewID": "RNPLPFB8MXUPP", "Overall": "5.0", "Content": "I just found and bought my Olympus c-2040 zoom after much research and deliberation.  I needed a digital camera first for my business and secondly for pleasure.  I will probably never print any pictures over 8 X 10 and need concise, clear pictures for my website so this is I feel the perfect choice.  I had a lot of trouble locating this camera - finally bought it ...from a reputable camera shop.  I paid [money] after s/h, insurance, and was very happy.  I researched Consumer's Report and every review in Amazon, etc. that I could find for 3 weeks before trying to find this camera.  It was difficult, but successful... I'm told it has been discontinued - probably because of it's success. Olympus can put this f1.8-2.6 lens in more expensive cameras, charge more, and GET IT!  The lens was what I was after.  I could have bought the c-3040 (same lens) for [money] more but it is actually more power than what I need.  The pictures taken from my 2040 are so crisp and clear.  The manual is actually more confusing than just picking up the camera and figuring it out.  I have Windows Me and all it took was a simple plug into the computer and it was there!  So simple!  I was actually fearful after reading the nightmarish reviews about uploading the pics to the computer and let me tell you, I'm NO computer wizard! It's easy, takes great pics in all light, feels good in my hands, and has most of the bells and whistles if you want them.  My previous hp-215 digital camera was a nightmare. The batteries were dead after 12 shots.  This camera is still on the original set of batteries and I've used it constantly since I got it!  This c2040 puts the hp215 to shame.  Do buy a smartmedia card though with more memory.  The one it comes with is just a freebie to practice with.", "Date": "April 11, 2002"}, {"Title": "Great features at a great price!", "Author": "Web Gal", "ReviewID": "RKD9M7SLX9RSJ", "Overall": "4.0", "Content": "I spent weeks researching digital cameras and the more reviews I read, the more undecided I became. But, in the end I bought an Olympus C-2040 digital camera. The main reason why I decided on the C-2040 is the fact that it has the new super bright f1.8 lens. Digital cameras in general have had a history of taking poor quality pictures in low-light situations. The C-2040 and its bigger brothers the C-3040 and C-4040 have same super bright lens, which in my book is the best lens on the market for the price. The only disappointment that I have with the C-2040 is the fact that I have to use the SHQ mode to get anywhere near the quality of pictures that I desire. I am a graphic/web designer and I am by far so much pickier than what the average photo enthusiast would be. So, I have decided to return the C-2040 and I have ordered the 3.34 mega-pixel C-3040. The average user will be more than satisfied with the C-2040 and its list of features. However, if anyone is as picky as I am, I demand only the best in my images. In another year or two I hope to upgrade to a 4+ mega-pixel SLR digital camera and when I do, Olympus will be the first manufacturer that I will look to.", "Date": "March 12, 2002"}, {"Title": "Reviews are great, cost is lower", "Author": "Thomas Ward", "ReviewID": "R3K3JHV20WRJDN", "Overall": "4.0", "Content": "I love the reviews by people that have purchased this camera.  I just ordered it along with a bundled kit that contains a 32Mb card, charger, case and batteries.  The only unfortunate part is that I found mine through ZDnet for $100 LESS.", "Date": "May 15, 2001"}, {"Title": "Excellent, with sharp, rich color", "Author": "Vincent Riccio \"vinzent@myway.com\"", "ReviewID": "R2RNGVC2DBYKJ4", "Overall": "5.0", "Content": "This is my first digital camera bought after researching the web reviews. I took 16 pictures at a 4th of July parade and the results were fantastic. It's easy to use the default mode and just point and shoot with excellent results of clarity and color saturation. I made 2 4x6 prints on my HP 932 and people couldn't believe these weren't photo lab quality. I tried the software on a Windows 95 computer and couldn't get it to work (possibly no Windows 95 driver on the disk) but my Windows ME with USB had no problem with fast downloads.", "Date": "July 21, 2001"}, {"Title": "A great camera!", "Author": "Alfred T. Miles", "ReviewID": "R1MQ9QOW63L3UF", "Overall": "5.0", "Content": "I have had this camera for less than two months, but I already know I bought a great camera.  After researching digital cameras for six months, talking to several people who have them, and reviewing what Consumers Report has to day, I settled on the Olympus C2040Z, which was one of the top rated cameras by CR for the money.  It takes absolutely great pictures, even at night without background lighting.  The color and sharpness are all that anyone could want.  Point and shoot - it couldn't be simpler.  This camera came with the super bright lense, which I highly recommend.  The menu is extensive, and I am sure I will be learning how to use the camera to its fullest potential for months and years to come.  So far, battery life has not been an issue.  I went through over 120 shots before having to change batteries.  I purchased a ZiO card reader with the camera which works great and helps conserve camera battery life.  It is a must-have accessory.  Bottom line:  I strongly recommend this camera.  One can hardly do better.", "Date": "April 11, 2002"}, {"Title": "Nice Camera!", "Author": null, "ReviewID": "R20HYOTSBRFYKK", "Overall": "4.0", "Content": "I was a reluctant convert to digital photograhy and settled on the C-2040 after carrying out extensive research. The clarity of the photos are fantastic and the colours are beautifully saturated. It is very well featured with a good selection of exposure modes and settings, including spot metering. The build quality is excellent and it feels very solid. I cannot go back to film after this!! The f1.8 lens and the ISO400 setting are particularly valuable, allowing you to take natural light photos in conditions that you wouldn't dream of with a film camera.Complaints.. you'll need to get a decently sized memory card - 64mb is useful, and a rechargeable battery set.  It is not as pocketable as I thought it would be, and the lens cap is not integrated. The lens is not as wide as I'd like, though you can get adapters to fix that. You'll also miss the lack of sound on your quicktime movies. The Camedia software is not the best but it does the job. And finally, as with most digital cameras, you'll have to work around the slight shutter delay.Overall though, the camera has given me nothing but joy! It has all the functions a typical enthusiast needs, with the control of a decent film SLR and the size of a reasonable compact snapshot camera. You may baulk at the initial cost of a digital camera, but as soon as you start downloading those pictures it will all start to make sense. For all photographers looking into the waters of digital photography, this is as good a place to jump in!", "Date": "December 25, 2001"}, {"Title": "Great image quality, good value, but slow to focus & shoot", "Author": "S. Webster", "ReviewID": "R3J84W1NQBTQR8", "Overall": "4.0", "Content": "Purchased with a 128MB flash card, which gives about 120 low-compression JPEG 1600x1200 images.  I'm very happy with the image quality, but it takes the camera about 1.5 seconds to focus & shoot from initial shutter press, which is too slow for my style.  However, you can pre-focus by holding the shutter down halfway which reduces the shoot time to about 0.1 sec.The autobracket, white balance, priority and full manual, and flash intensity features are welcome (and necessary for many shots), but it takes a lot of button pushing to access them in the menus.I don't have much use for the QuickTime movie feature; the 320x240 resolution is too low to be useful and it eats RAM like crazy.If you buy this camera, I highly recommend you also purchase the Olympus CLA-1 lens adapter tube and a 43mm filter for same, to get some armor on the delicate zoom lens.", "Date": "November 19, 2001"}, {"Title": "GREAT camera!", "Author": "bookworm5775", "ReviewID": "RRT9RUESX13A5", "Overall": "5.0", "Content": "I'm not up on the technical jargon, but I know what I like. And I like this camera! Unlike some previous reviewers, I've had NO problem with any aspect of installation and use. It worked like a charm right out of the box. Coupled with my new Phillips CD-RW I have been able to create a great system for storing pics on CD. And the camera itself is a breeze to use. The pics are great, and even at the lowest quality resolution, I can print a great 8 x 10 photo. I have been using NiMH rechargeable batteries, and they lasted for a month with lots of use. I find that the 32 mg card is plenty for me, and I can't think of anything else I would need for great pics with total ease of use. I highly recommend this to anyone!", "Date": "August 14, 2001"}, {"Title": "Very nice refined camera", "Author": "Father of 3 tricycle motors", "ReviewID": "R2R82MVHJ871P7", "Overall": "5.0", "Content": "The very fast f1.8 lens is great.  It allows many indoor pictures to be taken without the flash, which saves lots of battery power.  The non-electronic view finder is a bonus when taking pictures in dark rooms or at night.  The c-700 has a electronic view finder that won't work (display anything) in dim lighting.  I used a c-700 at a wedding reception and it was point, guess and shoot... then try again.  I used my 2040 the other night outside taking a picture of my daughters building a snowman.  The dim light of the street light was was enough to find them in the view finder.  Its fairly easy to use.  The 2.11 megapixel is a nice blend of picture quality and picture size on the Smartmedia card.  The only thing I've had problems with is the movie mode and taking smooth movies.  I can't seem to hold the camera still enough and follow my daughters around the room at 100mph.  That could just be me though. I've only tried twice.", "Date": "February 19, 2002"}, {"Title": "Olympus C2040 digital camera", "Author": "Mary M", "ReviewID": "R2P5QBQQDNW3JT", "Overall": "5.0", "Content": "I really like this camera.  The operating instructions included a quick start page of just the necessary basics to get started taking pictures.  The more detailed instruction booklet was clearly written and included diagrams.  This was very helpful. The camera's controls are easy to use.  The picture quality in daylight or flash is very good.  I had a problem connecting the camera to my computer through the USB port.  My computer running Microsoft XP wouldn't recognize it and would freeze up.  The software that came with the camera did not seem to help.  I currently download pictures to the computer through my hp Photosmart printer which can read the smart card. A little round-a-bout, but workable for now.  Overall, however, I am very satified with the camera.", "Date": "January 6, 2002"}, {"Title": "Fabulous camera (once you get it working).", "Author": null, "ReviewID": "RVDL7DV6WSC02", "Overall": "4.0", "Content": "I would have given this camera five stars if I hadn't had so much trouble getting started.  The reviews point out the problem with the driver if you have Windows 98.  My computer is only 3 months old and has Windows Me.  When I tried to download pictures, Windows couldn't find the driver.  After trying the CD rom provided by Olympus and the system disk that came with the computer, I went to the Olympus website and downloaded the driver for Windows 98.  It still didn't work.  Frustrated, I called Olympus the next morning.  I was told that the first time it had tried to install the driver, it had done so improperly, so I had to delete that before it would run with the downloaded driver.  It took a half hour on the phone with an Olympus technician telling me step-by-step what to do before it would work.  The software that comes with the camera stinks.  I use another photo editing program.That said, once it was up and running it's an amazing camera.  Even on full auto it takes amazing pictures under all kinds of conditions.  I took it to Florida and took pictures out a car window, in low light, on the beach and through glass in an aquarium -- all of the pictures are beautiful.  I'm just starting to learn how to use the more advanced functions.  It's a great camera to \"grow into.\"  It takes great pictures on the default settings while you learn how to adjust it yourself to get a desired effect.  I don't find the menus to be confusing once you've used the camera a few times.The 8 MB card is a joke, I don't understand why they bother making and selling them.I highly recommend this camera because of the lens and the quality of the pictures.  However, there's no excuse for the problems with the drivers and the awful software.  That said, I did a lot of research and this is, overall, an amazing camera.", "Date": "December 29, 2001"}, {"Title": "Easy & effective", "Author": null, "ReviewID": "R21PGTHHLKJJ4O", "Overall": "4.0", "Content": "Being new to the digital world of photography, the word intimidation leaps to mind.  This camera offers all the features and functionality that anyone would want, but does so with easy to use technology.  The camera produces amazing pictures, extremely fine quality for the images, and does so without requiring a college degree.  For the best of all worlds - easy to use, full featured, top quality -- pick this camera.", "Date": "December 26, 2001"}, {"Title": "Great camera, great value for the money", "Author": "ganarce \"ganar\"", "ReviewID": "R1WPVU5LA6PZLT", "Overall": "5.0", "Content": "Other reviewers have wrote at lenght about the technical aspects of this camera, you should read them. My c-2040 has been wonderfull as well. I like very much the lens wich is very clear, allowing pictures imposible with other cameras. It also has a lot of pro options wich makes it great afterwards. The learning curve is a little bit steep with some of the options, but  the manual is very informative (yes , you have to read it) .I was amazed by the fact that this camera  use the same interfase of the Olympus E-10 digital SLR, the only difference being the fact that the E-10 puts almost all the controls as buttons (great: you don't have to go in to a menu to change options before a shot).Do buy two 4 reachargeable batteries sets and a fast charger, this puppy eats power like crazy .", "Date": "November 2, 2001"}, {"Title": "Excellent product for the price!", "Author": "\"ndmac4ever\"", "ReviewID": "RL8KR0P7Y09AR", "Overall": "5.0", "Content": "First of all, I do not see any complication to learn how to operate the camera and installing the software. I think the quickstart and the thick detail menus already clear enough to get you started. I came very close to get the canon elph s110 due to its compact design, but the quality is not as good as the c-2040, such as the lens quality and aperture/shutter speed settings, its flash is also weak compare to the c-2040. This camera is really perfect for the price. Its picture quality is really amazing. It also has a lot of settings and allows you to shoot quicktime movie clips as well. If you are looking for a digicam for around 500 dollars, this is your best choice.", "Date": "July 6, 2001"}, {"Title": "The Digital Camera to Buy", "Author": "Michele T. Woodward", "ReviewID": "R2A4NX6C6XM05H", "Overall": "4.0", "Content": "I have had this camera for about two weeks and absolutely love it.  It is extremely easy to set up and use.  Very intuitive, so you can have success if you just skim the manual (my method).  The images are terrific.  I purchased a SanDisk USB thingy which is a much simpler way to transfer the images to my computer than by hooking up the camera, and keeps me from having to have an AC/DC adapter for the camera.  I don't use the Olympus for video, so the lack of sound is not a huge deal for me.  The price is right, the technology is great and I could not be happier.", "Date": "July 3, 2001"}, {"Title": "Olympus C2040Z digital camera", "Author": "maggie labouisse", "ReviewID": "R2PNMHNJU75G3R", "Overall": "5.0", "Content": "Many will wonder why I wanted this camera now, with only 2.1mp when there are cameras out there with HUGE resolution and lots more bells and whistles. The answer is easy--I had this camera and lost it, and HAD to have another one like it (I actually bought TWO through AMAZON!!!)This little camera comes with a 1.8 \"super-bright\" lens which permits me to take wonderful photos in very low light, without the flash. It takes crisp, lovely pictures, and for my purposes, has all the bells and whistles I need. I'm usually taking pix to be seen on the internet, or for small (4x6in) prints. If I were taking pictures for HUGE prints, or for reproduction into a magazine (ha!) then the better resolution available with higher megapixel count would probably be better.I think I bought the only two available on Amazon, but I recommend it to anyone who can find one. MAKE SURE that the camera includes both the download cable, to import the pictures from the camera to your computer, and the AC connector cord, so that you don't have to waste your batteries downloading pictures using the camera's batteries.In case you are unaware of this, downloading your pictures uses much more of your battery's charge than picture taking, too. If you use a card reader, of course this wouldn't even come into play. But if you DO download from your camera directly into your computer, be sure the seller includes the AC adapter cord.This is, as far as I am concerned, \"The Little Camera that Could\" and I heartily recommend it.", "Date": "December 29, 2010"}, {"Title": "Great Camera for the price.", "Author": null, "ReviewID": "RNNMOSFHG9PFR", "Overall": "5.0", "Content": "I have owned this camera for about 8 months now and I just love it. It was simple enough for my Mom to use (and get great pictures) while allowing me to use more advanced features like Shutter/Aperture Priority to get really great photographs. The initial installation was a breeze on Win 98 and when I got a new computer with Win XP I still had no problems. You do not even need to use the Imaging software that comes with the camera. You just need the device drivers from the CD-ROM...All you have to do is attach the included USB cable to your PC, attach the Camera to the other end of the USB cable (while the camera is powered off), power on the camera, and a new drive has been added to your computer that you can drag and drop from. It really doesn't get any more simple that that.The one feature I wish I had was a 10x optical zoom. The 3x optical zoom is a little weak for me but I can't complain because there are no other digital cameras in the same price range with a 10x optical zoom.This is a great camera to take you from a beginner to advanced photographer.", "Date": "March 1, 2002"}, {"Title": "Great pictures, terrific value!", "Author": "MacLabDoug", "ReviewID": "R5HOLDOQHSB70", "Overall": "5.0", "Content": "I love my Olympus 2040. It takes awesome pictures at a great price. The colors are true and the detail is phenomenal. I bought it over the C-3030 or any other 3.3 megapixel camera because unless you're going to print pictures LARGER than 8 x 10, those extra 1.2 megapixels are a waste. 2.1 megapixels fits more pictures on a memory card, too. On my 128 mb card you can take 257 pictures at the default 1600 x 1200. A 3.3 megapixel camera could only fit 164 or so at its default resolution. 2.1 is actually the smarter buy! (3.3 megapixels can only print sharper pictures than 2.1 when PRINT size EXCEEDS 8 x 10. Below 8 x 10, it's virtually impossible to tell the difference between a print from a 2.1 megapixel camera and a 3.3 megapixel camera.)If you're considering the 2040, though, you might want to check out the C-700. you get sound with the movies (no sound on the 2040) and best of all a 10x optical zoom. The 2040 only has a 3x optical zoom (3x is equivalent to about 85mm, 10x is equivalent to 185mm traditional 35mm zoom lens. 3x zoom is merely \"fine\", nothing to jump up and down over.) Plus the C-700 has a new menu structure, although the 2040's really isn't that difficult if you spend some time with it.Be sure to add in the cost of a 64 mb SmartMedia card, though. The 8 mb card is just a waste of time unless you bump down the resolution to, say, 1024 x 768, which you can do in the menus. I recommend you buy at least one Olympus brand 64mb card since only Olympus brand cards can make use of the fun \"stitch\" panorama feature in the Camedia's software. You'll probably only use this feature once in a while, but when you do want to do a panorama (like I did atop the Eiffel Tower) it would be nice not to have to fuddle with changing to the tiny 8mb Olympus card.Other niceties: The 2040 while it doesn't come with a remote, is remote capable. Remote operates zoom and shutter. The lens cap now comes with a cord unlike its predecessors. The flash can be turned off, forced to flash all the time, or be set to auto. Also has red eye reduction.Dislikes: Power saver mode cannot not be turned off. Even with the LCD screen off, after a while the camera goes into snooze mode and takes a second or two to be available. If you hand your 2040 to someone to take your picture, be sure to wake it up for him, or like me, he'll end up confused as to why your camera isn't working. This is easily gotten around by anticipating a shot.ONE YEAR UPDATE:  I've had the 2040 for a year now and I still love this camera.  I've taken over 1,000 pictures and haven't had a single problem with it.  I did find out that the Camedia software (ver. 2.5) must have memory limitations, though.  I had about 550 pics in one folder (I'm building a house and collecting photo evidence in case the builder tries to gyp me)  and it just couldn't handle that many without crashing when I tried to run the slide show.  Simple solution was just to divide my collection into folders.  Buy this camera.  It's great!", "Date": "June 7, 2001"}, {"Title": "I love this camera", "Author": "Phyllis Beard \"phisy\"", "ReviewID": "RTJB14IC0JLLW", "Overall": "4.0", "Content": "This was my first experience with a digital camera. I'm not very electronic/camera savey, but I love to take photos-scenes, grandkids,,everything. I wanted something that gave me the chance to use black and white as well as color. Altho I still need to refer back to the book at times(which is small enough to be carried in my purse) I found the various settings somewhat easy to use. All in all, I like this camera.", "Date": "November 18, 2001"}, {"Title": "Olympus C-2040 Digital Camera", "Author": "\"joejer\"", "ReviewID": "R2XC7Y14U1GR4E", "Overall": "5.0", "Content": "I can only say that I have had nothing but total satisfactionwith this camera.It's easy to use and with the USB connection I can downloadpictures in no time.With 1600 x 1200 res. and 2.1 megapixels I have at least 30 picturesof my own that I use for my desktop background picts that arenice and sharp.If your looking for a good compromise between price and quality,this is the one.", "Date": "January 27, 2002"}, {"Title": "great camera", "Author": "John Nawrocki", "ReviewID": "R209B77NY1BSK6", "Overall": "5.0", "Content": "Olympus makes great cameras!!!! This camera is an exact replacement for one that was stolen & I was so glad I found it's twin. Simple to use & not too many bells & whistles. The most important feature is the lens, because of the images the camera produces. The only downside is the difficulty finding memory cards(apparently they aren't made anymore). This is an excellent camera for those who still like to look through a view finder &/or have trouble holding a small digital one.", "Date": "June 21, 2009"}, {"Title": "I love this camera!", "Author": null, "ReviewID": "R2H36H2YEG746F", "Overall": "5.0", "Content": "I own this camera and have used it for almost 3 years now.  It has been through Christmas, Easter, Birthdays, Anniversaries, trips to Yellowstone and Disney World.  I always get the best pictures.  The pictures my husband and I took at Yellowstone were phenomenal.  They rivaled many of the post cards we saw for sale, especially of the Lower falls.  This is a very easy point and shoot type camera.  I only wish the optical zoom was greater than 3X.", "Date": "October 2, 2003"}, {"Title": "great camera", "Author": null, "ReviewID": "R27A9PJFPO028T", "Overall": "5.0", "Content": "I have had this camera for around two years now. I am in the military and travel alot. I have used the heck out of this thing. It has never failed me. It provides wonderful pictures. I just bought the remote and am looking forward to trying it out. The one down side is: nothing. I did buy a usb smartmedia reader for PC. It sped up the download from the camera like crazy. That is a must. The supplied software is not the best though. It does often lock up my system. And I have a very up to date system.This camera is a very very good one. It is very durable as well. I have flown all over the place toting this thing along my side and have bumped it here and there and never had even a little problem with it.", "Date": "May 14, 2003"}, {"Title": "Great Little Camera", "Author": "Jan Hilton", "ReviewID": "R12KZ42CSUI7GI", "Overall": "5.0", "Content": "I just bought the Olympus C-2040 camera and I think it is a great camera at a reasonable price. The software that came with it is very confusing and I use another brand instead. The lens cap must be taken off before you turn it on or you will be chasing it on the floor.As far as the menu goes its pretty much explains itself.Also buy another card for it, the 8 MB card will not hold much in the fine mode.", "Date": "April 16, 2001"}, {"Title": "Excellent mid priced camera", "Author": "Gregory Clark", "ReviewID": "R1DTI3LN03KU82", "Overall": "5.0", "Content": "I bought this camera as my first digital camera, and I love it.  easy to download pictures to PC via usb.  Excellent features and settings.  Does use batteries up, but get some Lithium rechargeables.  Excellent picture quality, works well as point & shoot if you don't want to learn all about the other settings.  I mostly store & view images on CD/PC but print quality of pictures is high for smaller sizes ie: 4\"x6\", if you want to print lots of larger pictures, you may consider a higher pixel camera.  Overall great camera.", "Date": "April 13, 2002"}, {"Title": "Nice Camera; Awful Software", "Author": "Amazon Customer", "ReviewID": "R2GECWCUBGM29U", "Overall": "4.0", "Content": "Couldn't get the software to operate properly on either of two relatively new computers. Good news: The operating system seems to recognize the camera as an ordinary storage device and handle file management just fine, which makes the clunky software from Olympus mostly redundant. Love the camera!", "Date": "December 27, 2001"}, {"Title": "This Camera is Awesome", "Author": "T. Cull \"trcull\"", "ReviewID": "R35VGTD1BRWDUN", "Overall": "5.0", "Content": "The 2040 comes with just the right amount of manual features to do some really interesting stuff.  It takes amazing pictures in low light and has great resolution.  I only wish the batteries lasted longer and the lens cap stayed on better.  I recommend this camera wholeheartedly to beginners and advanced amateurs alike", "Date": "June 29, 2001"}, {"Title": "TRY Before Buying", "Author": null, "ReviewID": "RE7Q6CAT48O49", "Overall": "2.0", "Content": "After researching Consumer Reports and everything else I could find, I picked the C-2040.  Before purchasing one for yourself - get your hands on one and experiment.My job demands documentation of models etc, so I decided to replace my 20-year-old SLR and go digital.  Features such as zoom, manual focus and accuracy of the viewfinder (for composition) were important to me.  To start off, the 2040's zoom feature is operated by a small lever that zooms very quickly without the precision of a traditional macro lens.  The manual focus feature was the most disappointing - you must guess the approximate distance between the camera and the object you wish to photograph from a complex menu.  I had an economy Kodak camera in the 1960's that utilized that same guessing concept.  The viewfinder was too small to be usefull, especially for close up shots.  The LCD screen is also very small, and the picture/color is below par.  Plus, the manual advises against using the LCD screen much because it consumes battery power.  Overall, the controls and the images are too small (I am 20 yrs old with perfect vision).To transfer your pictures from the camera to a computer, an AC adapter is required, but be aware that it is NOT included with the camera.I returned the camera to the store and am sticking to my old film camera for now.", "Date": "December 31, 2001"}, {"Title": "1st time set up started an argument", "Author": "M. R. Reynolds", "ReviewID": "R30GPT5PXGVU89", "Overall": "3.0", "Content": "The camera comes with an easy set up extra instruction sheet.  Easy?  Sounds good. First the Olympus batteries wouldn't fit. Wife says \"Take it back\" Finally a VERY hard push got them in.  Second the SmartMedia memory card wouldn't connect. Wife says \"Take it back\" Finally a hard push got it in.  Third was setting the time.  This was a major production due to the very complex menu.  \"Wife says \"Take it back\"  Finally it's time, maybe, to take a picture.  Turned camera on.  No picture on the back screen. Hmmmm, this is not good.  Re-read the easy set up extra instruction sheet word for word.  Wife says \"Take it back, it doesn't work\"  Finally in very tiny print we find that there is a \"monitor\" button.  Take some snaps.  So far this was the easy part.  Installed the Camedia software on PC which comes with virtually zero documentation.  Plugged in the USB cable and camera.  Win98SE sees camera but doesn't find a driver.  Easy set up instruction says nothing about software or drivers.  The thick, mostly foreign language instruction book says see driver instructions on the Camedia disk.  I look and look and look.  No driver instructions could be found on the disk.  Based on previous PC experience I point Win98SE to the Camedia disk sub sub directory for drivers.  Win98SE finds driver. Whew. All is good, so I think.  Boot up Camedia and attempt to transfer pictures from camera to Camedia.  NO GO.  Camedia can't find camera.  Call a friend for help.  Friend tells me actually the camera is now just another hard drive.  Shut down the worthless Camedia and let Windows98SE go find the new Olympus hard drive.  FINALLY I find the snaps on the Olympus drive and insert the snaps into some family email.  Time to call it a very long night.", "Date": "June 18, 2001"}, {"Title": "very cool", "Author": "Mike S \"Mike\"", "ReviewID": "RIVUTZL1FB8WO", "Overall": "5.0", "Content": "Wow is this camera cool.  Honestly I have never even owned a camera before because I was just to lazy to deal with the hassles of getting film developed, I always borrowed a relatives. However, the picture quality is just intense and I am thrilled to death by it. The camera is also small and lightweight which was a major buying decision. Also the fact that it only uses double AA batteries was also great, since I didn't want to worry about finding special batteries when traveling.  It did take me an hour or so to get it set up, but's that probably because I am a novice when it comes to cameras, but within an hour or two I was taking great pics and using the quicktime feature for short animations.  If you haven't stepped up to a digital camera your missing out, just the money I saved in one day from taking pictures nearly paid for the camera itself in film developing costs. Right now I am snapping pictures of everything, the trees, the dogs, the little elves on the front lawn, I could never afford to do this with regular film...is it cool!!!!!", "Date": "July 7, 2001"}, {"Title": "Never Again!", "Author": "George Saul \"saulmi\"", "ReviewID": "R2I2B20RVB0QD0", "Overall": "1.0", "Content": "I found the installation of this Olympus camera on my home pc to be a technical nightmare. After I obtained the camera I found the fine print announcing that the driver permiting my Windows 98 operating sytem to recognize the device had to be downloaded from the Olympus website. Easy enough. The very complex procedure to install this driver required  very-slow-in-coming e-mail explanation from Olympus Technical Support. After hours of struggle(and help from some very computor savy friends) I finally got it going, only to find the Camedia software very awkward and difficult. There are far more user friendly and home pc combatible systems available at comparable prices.", "Date": "November 22, 2001"}, {"Title": "A step above for a lower price.", "Author": "James P. Royce \"sierrajim\"", "ReviewID": "R3SRJHGARWCNJO", "Overall": "5.0", "Content": "This is a wonderful camera.  The instructions that come with the camera are at once complete and concise.  It is versatile, it can take motion pictures, it is totally adjustable allowing for wonderful artistic control, and the price is very reasonable.", "Date": "February 12, 2001"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000058TLP"}}