{"Reviews": [{"Title": "Big Step in the Right Direction", "Author": "C. Dsa", "ReviewID": "R1M4W18A31W2NJ", "Overall": "4.0", "Content": "Finally this camera repreents a major move for Fuji. After years of trying to hype up interest in their cameras with SuperCCD claims of 12 MPs etc But falling completely short with excess noise, Fuji has come out with a decent camera this time. This camera compares very well to the 7MP cameras like the Canon SD500 and the Sony P200 and in some cases even better results than the Nikon Coolpix 7900, Sony 150. I think its closest competitor is the Casio Exilim EX-Z750 which although priced slightly higher than the Fuji has some really compelling features.Here are the PROS1) It has a nice sturdy metal body, although not as sleek as and thicker than the Canon SD line.2) Low noise although has purple fringing on some pictures.3) Low light: Actually usable ISO 1600 setting. In some cases this eliminates the need for the the image stablization.4) Very good battery life. Fuji says 500 pictures per charge...really good for this small camera.5) Priced very well. Blows away pricing as compared to the 7 MP cameras which it compares to very well. For example the Canon SD500 is about $175 higher or about 50% MORE than the Fuji F10 with rebate. It is up to you to justify whether the SD500 takes 50% better pictures than the Fuji. I dont think so. In the SD500' defense it does look and feel better than the Fuji and uses the cheap SD cards.6) Finally a good movie mode (at 640 x 480 and very crisp 30 fps)Here are the CONS1) Uses those pesky xD cards which are harder to find, more expensive and smaller capacities than the SD cards.2) No optical viewfinder. This will come back to haunt you in bright sunlight when the LCD gets completely washed out.3) Really stupid design flaw of the use of the dock/adapter for any of the ports, including USB, A/V out, or Power. You just have to remember to carry the dock/adaptor with you at all times.4) Hard to use menu system. Canon and Sony totally blow away this camera is ease of use menu system5) Slim to None manual controls but you are buying this camera for its point and shoot capabilities and not manual controls.. right !!", "Date": "July 10, 2005"}, {"Title": "fantastic low noise and high ISO", "Author": "gadgetman \"likes fiddling with gadgets\"", "ReviewID": "R125O01VBN6WPB", "Overall": "5.0", "Content": "this camera is plain simply awesome. when i finally ran out of battery, i realized i had been using the thing for a FULL WEEK without recharging. the battery life is amazing. and so is the speed. the camera is on with zero delay, it focuses instantaneously, there's virtually no shutter lag. the menus need some getting used to if you come from other brands, but ultimately they're well laid out. the image quality is excellent. iso 80 thru 200 images are virtually noise free. the camera allows you to push the sensitivity all the way up to iso 1600. this means, no flash for interior shots, evening outdoor shots where flash wouldn't reach far enough anyway, all with no shake and very low noise. there is plain simply no other compact digicam out there that can do that. others give up at iso 400, the f10 easily goes up to 800. iso 1600 pix are a bit noisy, but still usable.the only thing the camera is lacking is more manual controls. if you want shutter or aperture priority, you'll have to seek elsewhere. however, there is exposure correction and manual white balance controls.this camera is a milestone. it's worth the money.", "Date": "June 9, 2005"}, {"Title": "Surpasses my expectations", "Author": "SteKar \"A passionate photographer\"", "ReviewID": "R25VMP1G5WDDGW", "Overall": "4.0", "Content": "I've just replaced my Sony DSC-W1 camera with the Fuji F10. All that time, I thought my Sony delivered good picture quality; well, compared to the Fuji it is nowhere close.Based on dcresource and dpreview Web Sites, I decided to purchase that Fuji F10. The pictures it takes are simply truly amazing: colors, accuracy, full of life. For the first time ever, people are actually saying \"wow, this picture of me with your baby is great, could you e-mail it to me?\". The flash is so powerful, that I'd recommend turning down the ISO (you can actually switch to post-shot mode and take the same pic three times and compare them live). Movies are great (compatible with Windows and Mac, even iMovie). The so-called 'terminal' (very tiny connection box used for A/V, USB and charge) is not annoying, though a cradle would have been better.The menu navigations are clumsier than Sony, Canon or Casio, but you'll get used to it in a matter of minutes.My only wishes would be a way to adjust the shuter speed so that going up in ISO does not brighten the subject so much, a live histogram, and a cradle.", "Date": "June 20, 2005"}, {"Title": "Awesome point and shoot camera", "Author": "Bonnie Brown", "ReviewID": "RQTBMFO1DGIPY", "Overall": "5.0", "Content": "I have spent endless hours reviewing almost everything that I can find online about small digital cameras and have looked at numerous ones in stores. I recently narrowed my decision down to the Canon A620, Canon SD550, and Fuji F10. The Fuji F10 was actually the camera I intended to get in the first place but was somewhat swayed by a store clerk and Canon users. The A620 was bigger than what I wanted, and I actually saw no difference in print quality between it and the SD550 Digital Elph when using the auto setting.  I am an amateur, though and do very little with manual controls.I don't doubt for a minute that Canons are good, and it may depend on what you are looking for. However, there is absolutely no comparison between the SD550 and Fuji F10 when shooting in lowlight areas and quite often for color on the finished product. I took several shots in different settings with the cameras set on auto and no flash. The Fuji captured pictures that Canon couldn't get. I personally also found the Fuji easier to handle.  With one hand, you can flip between review and photo mode and don't have to keep re-setting the flash preference each time you use it.  Once I got used to the menus, I personally had little problem finding anything and maybe even less than with the Canon.Fuji's battery life is unbelievable. Although I don't understand the reasoning behind the dongle setup, I didn't find it to be a big deal.  I may buy a separate more portable battery charger for travel that can be plugged into the cigarette lighter too but probably wouldn't need it given how long the juice lasts.  As is the case with many digital cameras, the memory card isn't sufficient.  I plan to get a 1GB card and shoot away.  I am currently not using a card reader and understand that there may be a particular reader that is needed for a 1GB card.I must admit that I do like Canon's Zoom Browser better than the Fuji software, but you can use whatever software you want.  The main drawback that I can see to the Fuji is the lack of an optical viewfinder when taking pictures in bright sunlight, but there is an adjustment for brightening the screen. If you are shooting under those conditions, you should probably have the sun behind you anyway and could probably simply shadow the screen with your head.  There is also no histogram, but I enjoy seeing the shutter speeds when I am focusing.From what I have read, I am also less concerned about a cracked LCD screen or finish wear on the Fuji.  Time will tell. I also considered the Fuji to be a good value at $100 less than the Canon.  Sorry, Canon.", "Date": "January 16, 2006"}, {"Title": "Great image quality", "Author": "Richard S. Lee", "ReviewID": "R37E0HTA7KFT8Q", "Overall": "5.0", "Content": "I'm a professional photographer. I like to have a small camera to keep in my pocket at all times.  I used a Pentax Optio S4i for a year. It was a great little pocket camera (tiny) but the image quality really fell apart when you set the ISO higher than 100. I wanted a pocket camera with image quality rivaling a professional DSLR. This is the camera. There are plenty of things to complain about... the confusing menus, the lack of manual controls... etc.  But I shopped around a LOT and this camera has the best image quality (I've seen) at 400 thru 1600 of any pocket camera on the market at any price. It operates very, very quickly too.", "Date": "November 16, 2005"}, {"Title": "Great camera", "Author": "V. OBriant", "ReviewID": "RTEMOWPZYZOU6", "Overall": "5.0", "Content": "I had a problem with my Canon Powershot S500 and had planned to repurchase as I liked the size and quality of photo for the camera price/function range. But I had got it at a good price and couldn't re-buy for less than $100 more so started looking around at comparable cameras. Hadn't really heard of this one but did some research on-line, CNET, etc, liked what I was reading and decided to gamble on it. End result - I love this camera. I am a point and shoot person who takes tons of photos. This camera is user friendly -- which has me actually  messing with settings and taking better photos. The screen is awesome - 2.5 inches. The photos so far are great, even for me! My only beef with it is the hook-up for downloading and for charging the battery. the instructions have me hooking up three cords for one and two to do the other. Doesn't make sense to me. I bought this for about $325 on amazon and bought a 1G xD card for $85 and think that this camera is really more than worth it.", "Date": "September 9, 2005"}, {"Title": "Really Nice Camera", "Author": "Kris S", "ReviewID": "RYUIMWKMWN9RQ", "Overall": "5.0", "Content": "Takes great pictures. Especially impressive macros, so if closeups are important, this camera is a very good choice. It would be nice to have a greater optical zoom, but that doesn't seem possible on such a small camera. I took this camera on a puffin trip in Maine this summer and just snapped random pictures without trying. I was amazed at the quality. The resolution allowed me to zoom in to a spec on the image and realize that I had great shots of a flying bird in perfect focus. Unbelievable. I had pictures with detail that I couldn't see. Very easy to use too.", "Date": "August 15, 2005"}, {"Title": "Not thin or stylish, but *excellent* picture quality, even at high ISO", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "R2VR8OARKPFSWB", "Overall": "5.0", "Content": "The Fujifilm FinePix F10 is a 6.3MP point-and-shoot digital camera made by Fuji Photo Film Co. of Japan (and in Japan).  Fujifilm is Fuji's brandname here in the U.S.  If I say \"Fuji\" in this review, you know I mean Fuji the company or Fujifilm the brand.While neither thin nor stylish, the F10 truly excels in picture quality.  Whether used indoors or outdoors, the F10 takes sharp pictures with very pleasant colors.  If you ever used Fuji's color film in the past, you know the company is famous for true-to-life color reproduction on film.  This F10 carries on this tradition and the pictures it takes are very pleasing to the eye.The most amazing part about the F10's excellent, superb picture quality is there's very little noise even at high ISOs, such as 400 or 800.  (I'll explain ISO in a bit.)  At 1600, the highest setting, you'll notice some noise when you view a picture at its full resolution.  However, when you print an ISO 1600 picture from the F10 at 5x7\" or smaller, the print quality will still be excellent.(ISO refers to the sensitivity of the camera's sensor.  In the old days of film photography, it referred to the film \"speed.\"  It was also known as the ASA rating before it became an international standard.  The higher the ISO setting, the less light you need for a proper exposure, but also the more noise, or digital specks, you get in the final picture.  This phenomenon is a law of physics.)The bottomline is, F10 takes amazingly beautiful pictures.  I rate its picture quality higher than my 6.1MP digital SLR, the Nikon D70.  I also rate it higher than all my previous compact digital cameras from Canon, Casio, Minolta, Nikon, and Sony.  I cannot describe how much I'm in awe with the F10's picture quality performance.In short: if you want a compact digital camera that takes truly excellent pictures, you should just get an F10.There are two reasons for the F10's top-of-the-class picture quality: 1) its CCD sensor (the camera's eye) is 1/1.7\" in size, which is bigger than most compact digital cameras' sensors; 2) it uses new-generation Super CCD technology developed by Fuji -- there are actually a total of 6.63 million pixels on the CCD sensor, of which 6.3 million are displayed in the final image, which means the extra 330,000 pixels are used to provide additional information about exposure and color.  This extra information, even though not visible in the final picture, helps the camera's ADC (analog-to-digital circuit), which is the camera's brain, produce an awesome picture.Add to the big CCD sensor a superior 3x Fujinon lens (Fujinon is Fuji's brandname for its line of camera lenses) and Fuji's know-how in reproducting eye-pleasing colors, you get picture quality that will make everyone happy.The F10's excellent high-ISO performance also means you can take natural-looking portraits indoors without resorting to the harsh white light of the camera flash.  You know how it is: you take a picture of a group of friends indoors, and everyone in the front looks like Michael Jackson (the guy who bleached himself) and the rest in the back look like dark-gray wolves hiding in the forest.  The F10 has a \"Natural Light\" mode which suppresses the flash, jacks up the ISO, and takes a picture that looks soft and pleasant.  If you did this with most other digital cameras, you'll get lots of digital freckles on your friends' faces.  With the F10, the result is much more pleasing and the freckles much less noticeable, especially in final print (unless you print a poster the size of Niagara Falls).The F10 can also take movies.  You choose from two resolutions: VGA (640x480), which is the default, or QVGA (320x240).  The movies are taken at 30fps so they are pretty fluid.  The VGA resolution means you can actually use this as a camcorder -- just make sure to get a large xD memory card.  (See my review of the Fujifilm 1GB Type M xD card for some details.)Now, if you are a control freak type, the F10 may not be right for you.  This camera is designed as a point-and-shoot, or as they call it, a foolproof photo machine.  You don't get many manual controls.  You can't control shutter speed or aperture.  You can't focus manually.  Even the image quality and resolution settings are simple: whereas other brands let you set quality (i.e., JPEG compression level) and resolution separately, on the F10 you have a total of six choices that encompass both quality/compression and resolution.I *am* a control freak, but I don't mind the F10's lack of manual controls because, 1) I have my Nikon D70 digital SLR whenever I need ultimate \"artistic\" controls, and 2) I bought the F10 as a point-and-shoot for the times when I'm too lazy to want to make any manual adjustments.  You should ask yourself how important manually setting focus or adjusting aperture/shutter speed is for you when you consider the F10.What else is there to say?  Oh, the F10 is quite easy to hold.  It's not ultra-thin or ultra-compact, so it's actually easier for me to hold.  It has a large 2.5\" LCD screen which acts both as the viewfinder (to compose the picture) and playback screen.  It's sharp and bright (and can \"gain up\" to superbright in low light situations) and displays fluid motions.  The F10 lacks an optical viewfinder (which some photo purists will insist on having) but does have an AF-assist lamp to improve autofocus in dim light situations.In terms of ease of use, the F10 is very easy to pick up and go.  You almost don't need to read the manual to get started.  On the other hand, almost all controls are accessed via a menu system, which is not the best kind of control scheme in the world.  The user's guide is your typical Japanese-translated-into-poor-English type you'd expect from a Japanese manufacturer.In summary, like the other reviewers have pointed out, this camera ranks very high in the picture quality department.  As long as you are comfortable *not* having manual controls other than ISO setting and exposure compensation, I bet you'll be very happy with the F10's picture quality.  Its exterior styling doesn't excite anyone, but as columnist David Pogue of the New York Times (and Macworld) points out: in photography, it's the inside that should count -- and he endorses the F10.BTW, the F10 is made in Japan, unlike other similar-priced digital cameras which are usually assembled in Indonesia, Thailand, China, or the Phillipines.", "Date": "December 16, 2005"}, {"Title": "Great Travel camera", "Author": "Ruby N. Garcia \"DSLsurfer\"", "ReviewID": "ROQOL23KAQP3P", "Overall": "5.0", "Content": "If you want a pocket size camera for travel that takes great low light photos - this is the best!  I've used this camera extensively  this last year in my travels and it's been outstanding, it starts up fast, is fast between shots, takes clear, sharp detailed photos, and is absolutely outstanding in low light/night situations.  I don't even use the flash most of the time, I just set the camera to  the natural light setting and I find that most of the time it takes  better photos that way than with the flash. I've used it in churches and museums without a flash and the photos have been clear, well lit, and sharp. And I've used outside at night without a flash with similar results. I've posted photos from my recent Germany trip which were either taken at night or inside, all set on the natural light setting without a flash.  This camera is slightly bulky but I think that is an advantage as it makes it easier to hold the camera steady in low light situations. Plus this camera is very sturdy, I've dropped it at least 3 times, unfortunately, and other than a couple of scratches on the case there were no adverse effects - still works perfectly. If you want a camera that takes very good photos in low light - this is the best. If Fuji comes out with another camera with a larger zoom lens but is just as good at low light and high ISO's I'd buy it in a flash even if it was slightly larger in size. I have absolutely no regrets about this purchase.", "Date": "January 7, 2006"}, {"Title": "Great Camera", "Author": "Peluna", "ReviewID": "RFL8A22DB2C41", "Overall": "5.0", "Content": "I rarely write reviews but after using this camera for six months and recommending it to multiple friends I thought it was time. I am an amateur photographer and own a lot of cameras and equipment. I was looking for a backup when I went out with a film camera to capture things if the camera failed. I spent about two months on the Web reading reviews, visiting Best Buy and Circuit City to handle the cameras, and studying the various features of cameras of this type and price range. This camera came out a clear winner for its size, low light features, and battery power. Although intended as a backup this camera has turned into much more. It doesn't have the optical qualities of a Leica or a Hasselblad but it isn't meant to. This camera is small enough to slip into a bag or puse and keep it there all of the time. The battery power is amazing, I can take about 500 shots on one change (and I take a lot of pictures). Some people have complained about the menu but really it takes very little practice to master it (that said I shoot exclusively in \"Manual\" mode). The pictures look great. I've blown them up into 12x18 and bigger and they loose no quality if taken at ISO 200 or lower. The only disadvantage is the cost of the xD cards, but I bought one 1GB one on Amazon for $80 and it holds a lot of pictures... I doubt if anyone would need more. If you are looking for a compact camera to keep around all of the time that will take high quality photos while allowing the user to mess with exposure etc... this is my best recommendation.", "Date": "December 17, 2005"}, {"Title": "F10 is a Great Buy", "Author": "Brady C. Schickinger \"Brady\"", "ReviewID": "R1QX1XDMD6NLMT", "Overall": "5.0", "Content": "The F10 is my 5th digital camera after having owned an Olympus, Kodak, Cannon, and the Fuji S5000.  I replaced my S5000 for the F10 because I wanted an ultra-compact I could take anywhere.  I haven't been disappointed.The F10 is the ultimate traveler's and everyday camera.  In addition to the brilliant and famous FujiColor, the F10 is perhaps the fastest camera in its class, very solidly constructed, and has amazing battery life thanks to the xD memory chip.  It's most impressive point, other than its speed, is the 800 ISO and 1600 ISO settings which are remarkably noise free and allow no-flash photos in night, indoor, and underwater settings where a flash is neither effective nor desired.Its optics are top-class, rivaled only by Cannon (which often costs at least $100 more for a similar camera).  My only suggestions to Fuji for improvements are:  1) Create an easier menu system to allow for faster changes to the manual controls it offers; 2) Offer a simpler charging/download connection; and 3) Provide better photo editing software (camera's of your quality deserve PhotoShop type software).Again, the F10 is the best choice for the frequent traveler.  I also highly suggest it for snorklers and divers (you can buy the underwater housing for the F10 for $130 on Ebay).While it make lack the level of manual controls a serious hobby photographer may wish for, these people should be looking instead at an SLR or SLR-type camera, not an ultra-compact.  I suspect the problems people have mentioned about the F10 are a result of not reading the manual and not understanding the many manual controls of the camera they have purchased.  The F10 has many more manual options than a typical point-and-shoot that need to be understood in order to be fully appreciated.Once again, Fuji gives us a great camera for its class and price!", "Date": "August 29, 2005"}, {"Title": "ISO1600 But something strange?", "Author": "Curt A. Meyers \"Boilerbots\"", "ReviewID": "R1ODFY2WYW32V2", "Overall": "3.0", "Content": "I read [...]and decided this would be a nice upgrade. I was looking for a camera with a high sensitivity ISO setting. Well it doesn't get much higher than 1600.After running around the house and snapping a bunch of pictures, I see some strange characteristics. You will have to judge for yourself what this means.Indoors in Auto mode, the camera seems to prefer to use the flash but still pushes the ISO up to 800 or 1600. With the sensitivity this high there are noise artifacts in the image. It appears the camera is giving priority to the aperture, or maybe it always forces the shutter to 1/100th and uses the ISO and aperture to adjust the exposure. I would rather it use a slower ISO for better image and color.Also, in the 800 and 1600 speeds I see red showing up in the image where it shouldn't. Taking pictures of items with blue colors seems to cause some red noise to show up.I also noticed in one of my pictures  a section with a large black field had a large white spot on it (not a reflection). Looked like a bad pixel. But in other similiar pictures that area was fine.If I can understand what this going on then I will come back and edit this review. For now I would consider this camera with caution.", "Date": "July 19, 2005"}, {"Title": "SPIFFY!", "Author": "John Alvie Baldwin", "ReviewID": "R1I43XR2PG1AMK", "Overall": "5.0", "Content": "Yeah, yeah, I know...\"SPIFFY?\"...what does he mean????Well, the camera is very \"spiffy\".  It is light, easily handled (although VERY large handed people may have problems - sorry girls!), works VERY well with low-light/natural light situations and the setting on the camera (one of the main reasons I decided to buy this particular brand/model).I haven't done any \"action\" or outside shooting, as I primarily bouht this to take high res pics of indoors situations (for home, and for work), in which the lighting might not be very bright, and a flash - USUALLY - whites out everything - U-G-L-Y!.This camera is excellent, a wonderful piece of technology.  Sure, it would be nicer if it didn't pop-out the lens, but the lens is sturdy, and the open/close mechanics (so far) are very smooth, quiet and quick.Color seems to be on-track, although I've had to use Photoshop a couple times to adjust levels on some flourescent lighting pics (but then I haven't played with the manual settings on the camera, mostly just relying on the \"natural\" lighting setting or \"automatic\".  There was one situation where the \"automatic\" (with the flash) brought out colors in a doll's eyes better than the \"natural\" lighting setting - but both were clear and bright (one of the few times the flash didn't white-out stuff).I've used standard 35mm reflex lens cameras, and some lower-end digital cameras, and I am thoroughly impressed by the price/performance of the FujiFilm F10!!!Great job Fiju!", "Date": "August 23, 2005"}, {"Title": "very pleased w/this point and shoot", "Author": "S. Octaviano \"steveo on amazon\"", "ReviewID": "R3T46A5FNUGA0", "Overall": "5.0", "Content": "This camera is very well made, easy to use, performs great in almost every area, and more importantly -- the wife likes it too!Highlights I find very useful:1) Natural Light mode -- this bumps up the ISO for indoor shots which a) allows you to not have to use the flash, and b) provides great focus in low light which is normally impossible. This is a very unique feature I have not seen any other small camera provide.  Fuji can do this due to the supper CCD and the high megapixels -- a great feature indeed.2) Very long battery life.  Very, very long.  The thing is huge!3) Large bright LCD4) Very powerful flash when you need it.Stuff I didn't like:1) No viewfinder.  Sometimes you really need one.2) Dumb adapter for charging battery and downloading pics via USB.  So dumb, it will force you to go out and buy an xD USB reader and an external battery charger.  These are all pretty inexpensive though.Overall, this is a great point-n-shoot.  You can do some manual stuff, but serious photographers would normally look elsewhere. Also, I don't understand why people complain so much about xD cards.  What's the big deal.  Perhaps they are a few bucks more expensive -- so what.  They are very small and do the job -- it's just a memory card.My second choice was the Canon SD450. This is also a great camera, but more pricey, shorter battery life, and no Natural Light mode which really makes the F10 unique.With my luck, Fuji will soon be comming out with an F15 model that addresses my only two complaints above!", "Date": "October 8, 2005"}, {"Title": "ISO 1600, fast shots, great quality, and finally a battery that lasts!", "Author": "Svavar O. Svavarsson", "ReviewID": "R96Z3E2V0C8YK", "Overall": "5.0", "Content": "I really like this camera. It's easy to hand it to a non-techie friend/relative and say \"take a picture of us\". The 2.5\" screen is awesome and the battery NEVER RUNS OUT!I let my mom (who can barely operate a DVD player) borrow it for a couple of days and when she gave it back she had taken 100 pictures and the battery was still full!The pictures she took were very good. Great colors, and very sharp, focused, and detailed. (I will post some in the gallery)The only problem was that the ISO was too high in some bright scenes. I left the flash on because I found it does not always fire when it needs to in Auto mode. As a result, some of the pictures were a bit too bright, but that's easy to fix and very minor. So make sure you know how (and when) to turn the flash on and off.The most important thing about this camera is that it takes GREAT INDOOR PICTURES. Of course outdoor shots are awesome too, but the crisp ISO 1600 and ISO 800 pictures make this camera the best one out there. I have countless great pictures that would have been impossible (or far inferior) with other cameras.It deserves those 5 stars.", "Date": "July 8, 2005"}, {"Title": "Awesome! Great value pictures are great!", "Author": "Molly Wallin", "ReviewID": "R1NBAG0I62KEJW", "Overall": "5.0", "Content": "I love just about everything about this camera. the pictures print up great and the menu is fairly easy to navigate through without the manual. i'm still learning some bells and whistles. I wish there was a viewfinder and you will need to buy a bigger storage card if you want to take multiple pictures the 128MB stored close to 200 pictures for me. A great value for those who want quality pictures without spending over $500", "Date": "August 5, 2005"}, {"Title": "More than expected!", "Author": "Shamgar \"Jack\"", "ReviewID": "R25S9Q7H0N9M4R", "Overall": "5.0", "Content": "I am somewhat new to digital cameras, but have spent several months researching camera reviews and expert opinions. Two months ago I purchased the Fugifilm FinePix F10 and took it on a 6 week vacation with us. I used it everyday in all kinds of settings. It has been faultless in operation and has proven to be much better than I expected. My priorities were: a camera that was easy to operate, produced excellent pictures, could fit in my pocket, took good quality movies and could be used indoors without a flash. The F10 does all this very well. In fact, it's amazing. I take it with me whenever I leave home, even shopping and eating out! I captured four little kids sitting on the hearth at a \"Cracker Barrel\" lined up like ducks with big smiles..no flash, candid shot! I have great shots of shore birds as close as 6\" from my face in mid-flight (used bread) and movies of pelicans crashing the water for a meal. When was the last time you really had a ball taking pictures? Now, I'm home in the northeast in March..cold,still snow...but, I play my movies of the waves and the gulls and I have a smile on my face. What more can a camera do?", "Date": "March 6, 2006"}, {"Title": "Nice optics and sensor, needs better product design", "Author": "Yong Jin Lee", "ReviewID": "R2VY2ZZVW07PHC", "Overall": "4.0", "Content": "The good thing about this camera is that it excels where it counts most: the CCD sensor and optics. The photos it produces are among the best from a compact camera with up to around 7 to 8 megapixels (this one has 6). The really nice feature of the camera is that it has an effective ISO setting of 1600 that actually produces decent pictures. There were many shots I would not have gotten had it not been for this feature. Since many of my photos are indoors, the high ISO setting is very useful.The things I didn't like are the following:I wish Fuji had adopted the SD card. I have other digital cameras with the SD card, and my Treo and laptop has built inSD card slots. xD cards are more expensive than the SD and no one except Olympus uses them. Certainly you will not find readers built into laptops or PDA's.The battery charger that comes with the unit requires the AC power cord, transformer with DC power cord, and an adapter with a short cord. If you want to download the photos to a laptop, you also need a USB cable that connects not to the camera, but to the adapter block. With my Canon, there is one charger unit that I need to carry around (the laptop has an SD reader). With the Fuji, I need to carry around 4 separate pieces.The body is not as attractive as a Canon or Sony. That is OK, but I also think that it is a bit bulkier than it needs to be. Fuji engineers could have worked a bit harder in making the unit more compact.The GUI on the LCD is quite difficult to follow. I had to get the manual out to figure out the features. I didn't have to do that for the Canon.Despite the shortcomings, I like the camera a lot. It performs where it really counts-- in producing good images. And it is quite portable.One suggestion on the case. Get the case made for the Canon SD550. It is more compact than the one made for the F10, and much cheaper. The fit is quite good... Better than that for the SD550 itself. Canon says that the case will also fit the smaller SD450... It must wiggle around a lot for the smaller camera.If you would like to have the 1600 ISO, but a smaller camera, you might want to wait for the Fuji V10. It is coming in March. It is smaller in size (5MP) and still features the high ISO. Fuji is really the only game in town if you are looking for the 1600 ISO in a compact.", "Date": "February 18, 2006"}, {"Title": "Excellent in moderate to good light", "Author": "pveman", "ReviewID": "R210VB1GN71E7X", "Overall": "4.0", "Content": "I am very impressed that the camera is very usable at the ISO 800 setting.  The ISO 1600 has more grain but significantly less than my Canon A70 had at ISO 400.  That being said, the Fuji F10 does struggle in low light without a flash. The lack of an apature priority mode or a shutter priority mode is unfortunate (the update - F11 - has both).  Manual mode is a little clumsy through the menu but very usable.However it is very good in moderate light without a flash.  In good light it's image quality rivals my Canon 20D dslr(I'm not sure if I should feel good or bad about that).Another drawback to the camera is the bright green focus assist lamp the creates an earry glow on your subject for a second or two before you take the shot.  I used it at a wedding recently and everyone on the dance floor started looking around, wondering what that green glow was whenever I took a shot.But drawbacks aside, I am still glad I bought the camera.I think this is an excellent camera if you:- want a small camera that takes very sharp pictures in good or moderate light- like to take pictures without the flash in moderate light- don't care about a lot of manual controls- want a compact camera with quick response timeIf you are expecting to be able to take low light pictures in all situations you will likely be disappointed.  At the wedding I mentioned above, when the bride appeared on the back of the church to walk down the isle, the camera refused to even take a picture unless I turned on the flash.  Part of the reason I had purchased this camera was to be able to take unobtrusive photos in such situations.Still, in good and moderate light you will be hard pressed to find a camera with better clarity.", "Date": "October 21, 2005"}, {"Title": "Great in low light", "Author": "xlamp \"xlamp\"", "ReviewID": "R34I09QPE4LHBB", "Overall": "5.0", "Content": "I was looking for a camera that could shoot well in low light without a flash. I just want informal shots (and movies) of friends/pets etc to send over email. I've literally surfed through most of the camera reviews on Amazon looking for something suitable. My first purchase was the Canon A620. A nice camera and I loved the movie mode, but ISO was only 400 and under subdued incandescent lighting, the camera could not focus or I couldn't hold it still enough to get a shot that was completely in focus. I returned it to Amazon and they refunded me, which is why I decided to order another from them. Thank you Amazon.I sort of stumbled onto the Fuji F10 and saw that it has ISO of 800 and 1600 and after reading reviews and extended reviews on other sites, I ordered it. All I can say is: It works. It does shoot well in low light without a flash. Just what I wanted. It's smaller than I need and the LCD is exposed, which I don't like, but I have been able to get the photos I want and I have not yet read the instruction manual. The F10 has white balance setting for incandescent and florescent and they make a huge difference in the outcome. The movie mode is great too.P.S. The films look much better on my laptop than on the camera as do the photos.", "Date": "January 13, 2006"}, {"Title": "great", "Author": "D. Tran \"hopeful\"", "ReviewID": "R34DBEMMAGX3RB", "Overall": "5.0", "Content": "I did a lot of research before buying this camera. I wanted a camera relatively thin and lightweight, but still have the ability to make great pictures. W/ 6.3 MP, and at such a low price - i just couldn't resist. I was most impressed with the quality for pictures in the dark. Pictures w/ the flash look like it's a picture from the day. And pictures of the city lights during the night are better than I expected from all the reviews.It takes great, clear pictures and rarely has a lag.The only thing I don't like about this camera is the adapter that is needed in order to charge or attach to ur USB cord to upload pictures. Fuji should work out a way to allow the USB to attach directly to the camera.", "Date": "December 30, 2005"}, {"Title": "My Night time camera", "Author": "John McQuitty", "ReviewID": "R2VZ8Y0U6HXX9R", "Overall": "5.0", "Content": "This is a great camera for low light or night time shots.  It takes great pictures under all circumstances, but excels in low light situations.  Fuji has pretty much solved the noise situation for the higher ISO sensitivities -at least in the F10.  Yup. it is basically a point and shoot.  It does not provide as much \"control\" as some others, but it takes great pictures - which is really what it is all about anyway.  I have a Canon which gives me more control over aperature, shutter speed, etc., but for night or existing light situations, the Fuji F10 can't be beat in a compact camera.  It also takes superb pictures in daylight situations.  It is fast to start up, and has almost no shutter lag.  Very good value for the money. If you are not a \"tech head,\" don't need all the \"control\" - just want good pictures, and can buy only one camera, - this is the one. If you want excellent low light performance without fussing with a bunch of esoteric photo diddly pooh - this is still the one.  I highly recommend this camera.  OK.  I'm not putting down the value of \"artistic\" shots, nor any fully adjustable camera (That's why I have the Canon.).  However, if you are not a professional, (Actually, I think even professionals could benefit by having the F10 \"in their back pocket\"), but want to take  excellent pictures with a minimum of fuss - this is the camera for you.Edit: After several more months of use, everything in my previous review holds true - This is a great little camera.  It makes taking good pictures so easy, that I have rekindled my enthusiam for photography.I have recently added a new digital SLR and several lens to my photography \"stash,\" to go with a couple of pretty nice, but older film SLRS and lens, and the Canon digicam I mentioned earlier.I am a \"returning\" photographer.  I was a photo enthusiast - even sold a few - in the 1960s and 70s, and am now enjoying photography as I once did - thanks to getting enthused about this Fuji.  I shoot mostly in available light and macro as well as fast-moving grandkids, and had thought that available/low light photography and rapid response with digital cameras was only a myth - until I got the F10.  The F10 is light years ahead of my first digital camera - and most on the market now - for low light shooting anyway.  (Note: Check the Fuji F11 for the best of both worlds.  It adds more \"control\" features,but the F10 is still a super point and shoot choice.)Now the digital SLR with a macro lens is better for macro stuff, and for \"set\" shots in available/low light, but for capturing images - i.e. \"grab shots\" - of grandkids in available light, the F10 is just as good - and the point and shoot is faster.  It is also a great back up for the SLR in any lighting situation.My son is an excellent photographer.  He shoots mostly landscapes and the \"great outdoors.\"  He and I will be shooting togather this summer - him mostly the far stuff and me mostly the near stuff, but we will both be using the F10 as a back up.  Yes, it has its limitations - non interchangeable lens, etc.  If you want the flexibility and control of an SLR, get one, but for easy and superbly focused and exposed pictures with very little effort, the F10 is a great choice.", "Date": "March 5, 2006"}, {"Title": "Overrated Images Despite Groundbreaking ISO Performance", "Author": "NewsView", "ReviewID": "RZXIX1MP4URZZ", "Overall": "3.0", "Content": "I own an F10 and have purchased THREE, in fact. The first F10 I returned because it was defective (producing nothing but a blur indoors no matter the setting). The second one was an improvement except when using high ISOs. The third one I am also returning because I took it to a party where most of the shots consisted of people sitting or standing - relatively still - and yet the images obtained in auto mode were blurred by subjects' hand motions, which rendered a greater percentage of photos unusable when compared against my six-year-old 1.3MP Panasonic. I bought the Fujifilm F10 expecting it to deliver every bit as much as the hype suggested. Wrong. There are better cameras, such as the 5MP Panasonic LZ2 and the 8MP Olympus SP-350, that offer more photographic consistency - albeit at lower maximum ISOs - for far less money.Before I explain why the F10 failed to live up to its promise, allow me to make an observation regarding camera reviews in general. Aside from the varying impressions a camera can leave depending on its intended use - outdoor shots during a vacation vs. indoor shots during a party, action vs. portraits or macro vs. wide angle, a percentage of the differing opinions you find in MOST camera reviews can be chalked up to the fact that digital cameras are far more complex than film cameras and don't always come off the production line with equal performance. Despite the often overlooked issue of quality control, the tendency in camera reviews is for people with a good experience to blame people who report worse-than-average results for being ignorant to the proper use of their camera. Rarely does it occur to the reader or existing owner that a reviewer who is describing a poor result may have obtained a camera that is defective and/or was dropped, tossed or otherwise damaged in its long journey to a home or store shelf. Unfortunately, new owners also tend to have trouble recognizing when the camera they are using is malfunctioning. Rather, the tendency is to assume that any and all image problems are attributable to \"user error.\"Now my observations regarding the F10's performance:The second F10 I obtained works much better than the first, yet it still has enough flaws to lead me to conclude that the upcoming Fujifilm F30 would be a better bet for those who are seeking in high ISO performance in a point-and-shoot camera. Even though the F10 is inexpensive, the F30 offers features that the F10 does not, such as improved noise reduction, an \"intelligent\" flash system, a higher resolution LCD and even higher ISOs.The F10 sets a benchmark for high performance in the ISO department. Low ISO settings are somewhat like 100 and 200 speed film, whereas higher ISOs are somewhat like 800 speed film. Most point-and-shoot digital cameras have difficulty with indoor exposures, except with the aid of flash. The trouble with flash is a lot of folks don't like the unnatural appearance flash produces. As a result, the F10 has created somewhat of a cult following for its ability to overcome the limitations of other consumer-level point-and-shoot cameras.The F10 offers user-controllable ISOs that exceed the typical 400 ISO limit of competing cameras, which means that pictures taken without flash under low light are much, much brighter. So if getting the shot - rather than having a perfect image to print out later - is your goal, you'll find the F10 hard to beat (at least for a few more weeks).What deters me from enjoying my F10, however, is the fact that screen resolution and print images - specifically images above 200 ISO or those that lack flash - are too soft. Such images lack crystal clarity yet exhibit enough noise to make printing pictures in the 800-1600 ISO tricky without first using Photoshop  and/or noise reduction software to \"post process\" the images.  Making matters worse, even images shot at low ISOs in outdoor light tend toward a diffuse appearance, particularly in high contrast situations. Consequently, it seems as if the F10, when left in full auto mode, struggles to properly expose images. Only relatively low contrast scenes under good lighting seem to bring out the best in this camera, otherwise chromatic aberration begins to make its ugly appearance. And lest we forget, there is no optical viewfinder, which might be acceptable if not for the fact that under bright sun the F10's LCD is not a star performer.The F10 doesn't have image stabilization, but Fujifilm has compensated by providing higher ISOs so that the shutter speed can remain relatively fast even in low light, thereby limiting the problem of blurred images that result from a combination of slow shutter speed and unsteady hands. At least that's what the advertising claims. While Fujifilm's approach to quasi image stabilization does a decent job in very steady hands, camera shake is still an issue, especially in low light settings. Moreover, capturing a subject that moves - particularly close-up shots of kids or pets - is tricky. Not only do the results tend to come out blurred, but also there's little you can do to compensate because the F10's manual controls are limited.The F10's strongest asset, in my opinion, is its pleasing color reproduction; it does not produce the highly exaggerated primary colors you sometimes find in other point-and-shoot cameras. As a result, the F10's images require little, if any, color correction. Second, with an all-metal body, the F10 feels much better built than the competition. Third, the F10's battery life on a single charge is unbeatable. Unfortunately, the drawbacks to the F10 are too much, in my view, to overcome. Night or day, metering method notwithstanding, the F10 produces images that appear overexposed in some areas (washed out), excellent in other areas, and dark or noisy in other parts of the same frame. Worse, there are few, if any, means to compensate for the loss of detail that accompanies both overly dark and overly bright areas - a flaw that high-contrast outdoor images tend to magnify. That's not to say that the camera's EV adjustment option does not help, but if you plan on making this the sort of camera you can hand off to a stranger during a vacation for a quick shot, the F10 may not be the best choice - unless, of course, you don't mind pausing to adjust camera settings manually in order to obtain results that are difficult to match when left at factory defaults. But that's not where the F10's image problems end. Due to the F10's tendency to overexpose images, the F10 exhibits purple fringing and highlight clipping along colliding areas of light and dark. Finally, the 4x6 prints I obtained from the ISO 800-1600 range - without flash - tended to appear fuzzy to my eye, which suggests that the F10 would benefit from true image stabilization, which it lacks. Even though the F10's high ISOs are a vast improvement over the competition, flash-free images under low light do not pass for postcard/album quality. For this reason, if you intend to print pictures larger than 4x6, you may be tempted to fall back on flash to bring out the amazing color and detail the F10's 6MP Super CCD is capable of producing at relatively short distances under even lighting.Though your results with the F10 will certainly vary depending on the subject, ambient light, shutter speed and the steadiness of your grip, I can't promise that the results of the F10's \"natural light\" mode will knock your socks off. Though some prefer the \"mood\" created by pictures that have a slight haze or mist to them, this camera may not please those with 20/20 vision and/or those who prefer fine detail. My six-year-old 1.3MP camera, for example, cannot properly expose an indoor image without flash, yet with the help of Photoshop it is possible to brighten flash-free indoor shots, which reveals that image details remain intact, albeit somewhat noisy. So while the ISOs of competing point-and-shoot cameras may be more limited than the F10, their focusing and metering systems may perform well enough to permit you to nevertheless print moderately underexposed images with a bit of post processing. By contrast, the F10's ability to produce bright images even in dim conditions immediately catches one's eye, but keep in mind that the F10's unfocused look is not something Photoshop - or even a small 4x6 print - can eliminate or mask. Consequently, it would have been helpful if Fujifilm had included some method by which the user can decide whether they prefer default noise reduction for a smooth look or less detail-disrupting noise reduction for a crisper appearance.To put this into perspective, a lot of folks won't mind pictures that fail to provide crisp detail because their emphasis is not on obtaining professional-looking prints but on the camera's ability to capture a moment in time that may otherwise be lost, say, under typical household lighting. Another group of people who are suited for this type of camera are those who frequently need a camera where flash is not allowed - providing such users have the steady hands of a surgeon or plan to use a tripod. Another group of people who are likely to enjoy the F10 are those who like shooting macro with flash - the F10 does a better than-average job throttling down the flash for close-up detail. But to anyone expecting a point-and-shoot camera that is capable of shooting images across a moderately-sized room without blurring people's hand gestures, don't expect much from the F10; not even the help of flash, the AF illuminator, sports shooting mode or high-speed shooting will eliminate motion blur, which means that unless you intend to photograph fixed objects such as buildings or eBay auction items at close range, you will fail to realize the few strengths this camera offers under ideal conditions/settings. Bottom line? To photo enthusiasts with a discerning eye, sports shooters or even parents of active children, the F10 is not a suitable substitute for a higher-end camera or dSLR - despite claims to the contrary. A better choice for slightly more money is an entry-level dSLR, such as the 8MP Olympus E 300. Like the F10, the E-300 is a discontinued item; it can be found for $500-$700 complete with two lenses, optical viewfinder, RAW file format and full manual controls. Another option is Fujifilm's new point and-shoot camera, the F30, which debuts in May.", "Date": "April 18, 2006"}, {"Title": "Very pleased with F10", "Author": "S. Davis", "ReviewID": "R1BOPSX0G3D22", "Overall": "5.0", "Content": "This is my third digital camera, consider myself a quasi-hobbyist. The F10 is a major upgrade from last camera, that cost me twice what this cost. Pros:-Great pics overall-Wide ISO range has come in very handy, notice a lot of low light outside pictures that look great at ISO 800 without the flash having to fire-Outstanding battery life-Very fast to startup and picture to picture-at 6M resolution, digital zoom pics have minimal distortion- compact size- durable lens design (compared to prior two cameras that both went to camera heaven because of lens getting broken)- flash doesnt seem to be overpowering in most cases (like many of the new Sonys)Cons:- Dangling mess of wires to connect camera to power / PC, not sure why they couldnt make a standalone USB cord- Settings being across two menu functions is a bit cumbersome, menu system in general more cumbersome than Sony or Nikon- Little disappointed that it doesnt do a little better on action in low light with ISO 800 or 1600 (ie inside a basketball gym)- Green light AF illiminator really throws your subjects when taking indoor pics in low light, hard to enjoy picture when everyone is squinting or has a bewildered look on their faceGreat price performer for someone that wants a small camera with cut above the rest performance and enough manual controls to grow into a more serious hobbyist.  Fuji got a lot right with this camera. Bought Sony DSC-P200 and returned it because the flash was so overpowering indoors, like the F10 much better overall.", "Date": "December 3, 2005"}, {"Title": "Great PIctures but not great for taking pics of little kids", "Author": "Kathleen G. Rodrick \"Katmonster\"", "ReviewID": "R1H6U9KYV1BJKW", "Overall": "3.0", "Content": "I have had a Fuji F700 for two years and have absolutely LOVED that.  I assumed this would be an upgrade (with the much bigger screen) and the longer continuous shooting mode.  BUt I was actually very disappointed and returned it after messing around with it a little.  The shutter speed is fast, but the time it takes to FOCUS is unbelievable.  I mostly take pictures of my kids (1, 2 & 5) and was back to what I hated about my OLD digital cameras...pictures of the backs of their heads and totally missed moments. I was so frustrated I wanted to jump up and down on it!The photo quality was superb.  THe continuous shooting mode was disappointing too.  In my F700  I can take five shots in succession (without flash) and then the camera saves.  Perfect for soccer or sledding pictures, or of my boys playing together.  THe F10 allows for up to 40 but it saves each one individually after the shot so there is a big lag between each shot.  So, you can take MORE but not as quickly.ANd then there are the obvious complaints about the cables and the XD card (which luckily I already have.)If you are taking scenery or posed shots this is a great camera.  If you're looking for one to take pictures of your children, look elsewhere.", "Date": "December 17, 2005"}, {"Title": "Great Point and Shoot Camera", "Author": "B. Keane", "ReviewID": "RAFUDUZR08UGA", "Overall": "5.0", "Content": "This is my first digital camera and I love it.  It's small, light, has a long battery life, and takes great pictures.  Believe what everyone says about the speed, it takes pictures fast.  I'm an entry level/tourist kind of photographer, so I wouldn't know what to do with manual controls if it had them.If you're looking for a point and shoot camera, the Fuji F10 is the way to go.  If you're an advanced photographer who doesn't want an automatic camera, maybe look at something else.", "Date": "June 28, 2005"}, {"Title": "Wow", "Author": "Mel Irizarry", "ReviewID": "RXBGLL63T5GU0", "Overall": "5.0", "Content": "Very pleased with this camera especially after buying and returning the Olympus Stylus 600.  Using the enhance color mode reminds me of the FujiChrome 35mm days when I was still using film.  Even the video capture is nice and is stored as an AVI which plays fine under my Linux machines.  This is a worthy replacement for my Olympus C-3030.", "Date": "December 29, 2005"}, {"Title": "Low light dream camera", "Author": "John H. Hill Jr. \"happy dappy\"", "ReviewID": "RL7OPI3IJYK1H", "Overall": "5.0", "Content": "an awesome night adventurer camera. will do 15 secs at iso 1600 with no annoying noise reduction frame.  Less noise at 1600 then my huge sony f-828 at iso 800!! I saw people complaining about the AF assist lamp. Turn it off! This camera has the best AF at low light then any camera I have used! You only need the AF assist in complete darkness, which is rare.  Battery life is cool.  Awesome video too.  I had the canon f550 and it distorted the audio terrible at a live concert.  The f10 compressed the audio considerably but it was way better the canon.Cons: lack of manual focus or apeture control. the gain up when composing a shot could be better in bad light.  I wish it went to slow frame mode like the canon did.  I don't think there is a single perfect small camera on the market yet but there sure are a few that come close.  My advise is, if possible, try a few for a week or so before settling for one", "Date": "December 16, 2005"}, {"Title": "Not short sighted Camera", "Author": "Ladoris Kelsey \"I see EVERYTHING, though not ...", "ReviewID": "R3DMB4R85Z9B83", "Overall": "4.0", "Content": "I love to take pictures of everything and everyone.  No, I do not mean that I go around taking pictures of strangers to the point of being like the character in \"One Hour Photo\" I just love having those wonderful photos to share and look at.The little trick to this one is that my visual acuity is 20/400 at best, that means I'm mostly blind and I could not tell the difference between you and your boss standing two feet away from me.  I know many people in my situation who love to take pictures, even if we don't really see the product.  We share the product.This brings me to how wonderful this camera is.  The Fuji Finepix F10 is my second digital camera.  The size is so much smaller then my first, which makes one of my jobs so much easier.  I am a part time mystery shopper, and taking digital photography is not easy with a heavy large camera.  Try looking like you are having fun taking pictures of a fast food restroom, or sale rack with items falling out of it without being noticed.  The shutter speed and quick charge flash feature are a must have in this situation as well as taking pictures of my beautiful dogs.  The color depth and definition that this camera this able to capture is incredible.I do wish that this Fuji had put more zoom capability in this model, it seems that one has to choose between mega pixels or zoom in a camera and that does not need to be something that a consumer should have to sacrifice.As an end note, even though the video feature is not really what this camera is intended for it is so easy it makes it so much fun to shoot little quick videos of whatever is going on right now and I could never do that with any other camcorder or camera that I have had or used.", "Date": "January 6, 2006"}, {"Title": "Fuji takes a giant leap", "Author": "Bond", "ReviewID": "RCRWIWHN035XN", "Overall": "5.0", "Content": "The F10 is a great camera. Its ISO range up to 1600 is usable as the noise is really low. This is the Fuji's trump card, which blows all the other compact cameras away. The image quality is spectacular. THere is some purple fringing at high contrast images but it is not worse than all the other cameras out there. Highly recommended.Check the reviews on dpreview.com and dcresource.com", "Date": "June 17, 2005"}, {"Title": "Best handheld point and shoot ever made", "Author": "Cerealmouse", "ReviewID": "R1CI27ZAGY08SJ", "Overall": "5.0", "Content": "Ignore the guy saying to hold off for the new F11. Fuji announced it would not be released in the US. It's really no big deal since the only difference is a few additional manual modes, slightly better LCD and a slight tinge of gold color.Do a search on any of the major search engines for \"fuji f10 review\" and you'll see quite a few professional reviews raving about the quality of this camera.Not the smallest or most stylish camera, but in the end its picture quality that matters the most. There is NO OTHER pocket digicam that can take indoor photos without flash besides this one. You'll get a blurry dark mess. For the tech savvy, this camera can handle ISO 1600!!! with little noise, even comparable to $1000+ SLRs!", "Date": "October 15, 2005"}, {"Title": "Still the best 2 years later.", "Author": "Harry Puppins \"tooleyoclock\"", "ReviewID": "R3UYHRN3404EAX", "Overall": "5.0", "Content": "This camera, the Fujifilm F10, now over two years old (retirement age in digital camera years) STILL blows nearly all other cameras out of the water. I have put mine through the ringer in my travels all over the world. This thing has never failed me from the beaches of Waikiki to the deserts and mountains of Chile. My F10 was recently lost in a tragic Disney World vacation disappearing act when I let my family borrow it. After nearly 50 hours of in depth digital camera research to find a replacement camera I have decided to buy ANOTHER Fujifilm F10 because nothing comes close to the awesomeness of this camera.10 REASONS I LOVE THIS CAMERA:1. The feel. This thing is all metal! It is so durable and contours perfectly to your hands. Here in July 2007 I STILL cannot find a camera with these features. Unfortunately the F20 and F30 really fall short in this area. They feel pretty cheap.2. Low light. ISO 800-1600 with little to no noise! What?! Why isn't anybody else able to do this 2 years later?3. The speed. There's no shutter lag. 1/100th of a second to be exact. Plus, the High-speed shooting mode cuts the auto focus and exposure times down a ton.4. The size. Slips nicely in the pocket or in a compartment on my video camera case. I always took it because I didn't have to worry about it getting stolen way down in my pocket. I certainly wouldn't hang a dSLR or even a Canon S3 IS around my neck in most of the big cities of the world.5. Video. This was one of the first compact digital cameras to offer 640x480 30fps video. The video looks great. I was so glad to have the feature when I new my MiniDV camcorder wasn't going to want to operate at 14,000 ft. elevation and -20 degree temps. The F10 didn't even shiver once.6. The screen. Plenty Big (2.5\"). Bright. Who uses optical viewfinders anymore on these compact cameras? Who needs one with such a great LCD screen that gains up when necessary? Also, it is protected by some very hard plastic. I don't know why Fujifilm did away with that on the newer models.7. Flash. This flash is fantastic! It reaches further than some other compact cameras I've tried out. Plus, it compensates well when using Macro. Never blowing out the picture. Supressed flash is great for a little help in a slightly lower light situation.8. Super-Macro! Awesome to get close-up details for listing items on eBay. This is an indispensible tool of the eBay trade. I see so many listings with people attempting to get a macro shot that ends up completely out of focus. They need the F10. And you can get some really artsy shots of items up close leaving the background out of focus. Very cool.9. Never needed a backup battery. A full day of shooting never used up the propietary lithium-ion battery. Its rated at 400 shots. If you take more than that in a day, you need to restrain yourself. Too many people take 1000's of photos that nobody wants to look at. With its well designed auto features this camera will take a great photo every time you push the button. Just take your time aiming it in the right direction.10. Oh yeah, image quality. This is the real kicker. Image quality seems to be getting worse on newer cameras lately to me. These new technologies companies are touting cause WAY too much irreversible damage to the images with their attempts at \"noise reduction\". The F10's Noise Reduction techniques are unparalleled. The images remain crisp and unmuddied. Plus, the colors are very vibrant and accurate thanks to the superb auto-white balance. And there are no artifacts since there is no interpolation require to acheive the 6.3 megapixel resolution. This is the part that keeps me sold on this camera. The image quality of current models remains unimproved 2 years later.If you know of another camera I could love as much as I love the Fujifilm F10 please let me know in case this next one falls victim to another tragic \"left it on top of the car at the last rest stop\" accident.", "Date": "July 12, 2007"}, {"Title": "Fuji fails to honor warrantee - Don't buy from them", "Author": "Walter Jeffries \"Walter\"", "ReviewID": "R39JPD5ZS7A03N", "Overall": "1.0", "Content": "Fuji fails to honor warrantee - Don't buy from themDo NOT buy the Fuji digital camera. They charged me $[...] for a fix within the warrantee period. Their support manager told my wife the cameras are not being built well and dust gets inside destroying the gears. Rather than fixing them they replace them and then they charged me for the replacement even though it still had months left on the warrantee.[...]", "Date": "October 17, 2006"}, {"Title": "This Camera is Great!!", "Author": "L. Quackenbush", "ReviewID": "R374BGGDKHA8FS", "Overall": "5.0", "Content": "The camera was definetly a good pick. I have had Fuji Cameras before, so this one defintely was a great upgrade. I actually bought the HP camera, before this one, and had to return it. The shutter speed was so slow and the pics came out horrible. THis camera is great, even in low light conditions!!Defintely a good pick!!", "Date": "February 24, 2006"}, {"Title": "Happy in New York", "Author": "J. Grubbs", "ReviewID": "R3BNL4R0PZ5S4Z", "Overall": "5.0", "Content": "I bought this camera for an upcoming trip to Paris. I like to be able to turn off the flash and shoot in low light at a higher ISO. So far, in testing it out, I've been very pleased. Highly recommended.", "Date": "September 1, 2005"}, {"Title": "Fast! Fast! Fast! And it takes GREAT pictures too!!!", "Author": "Amazon Customer \"Mike\"", "ReviewID": "R35DCB9X21A24O", "Overall": "5.0", "Content": "PROs:Fast! Fast! Fast! And it takes GREAT pictures too!!!I love it! A real eye-turner (lots of compliments).  I like the dial which a separate setting for scenes (like natural light-no flash) and manual.  It does really well at night, has ISO 1600.I really like the software which transfers the photos to my pc.  It has many options; I have it configured so I just enter a directory name and it automatically copies the photos, creating that directory under `my photos', then deletes the photos off my card, ready for next time.I really like using [...] You can charge the battery while it is in the camera (unlike my Nikon 7900 which my partner just purchased).  I like my Fuji much better.Cons:Not a big one, but it uses a proprietary cable so one connection to the camera, then power, usb & audio plug into that.Bottom line: Love it!", "Date": "July 3, 2005"}, {"Title": "My 5th Digital camera", "Author": "Stringbean", "ReviewID": "R33VJDM0SDSIR1", "Overall": "4.0", "Content": "Bought this after reading reviews - my fifth P&S; digital camera.Good - Great in low light conditions. I teach digital photography at our local school and it's great for inside shots.Small size makes it easy to transport.Negative - Clunky battery charging setup and photo transfer. Too many cables to connect together when one would do.  Picture quality not as good as my old Olympus C-60 but OK for most new users. I would still recommend it for someone buying their first digital camera.", "Date": "February 27, 2006"}, {"Title": "Fuji Finepix F10 6..3 MP Digital Camera - Excellent!", "Author": "T. J. Rosario", "ReviewID": "R3GUIRS90SCTS7", "Overall": "5.0", "Content": "This is a wonderful camera.  A great investment by far!  The pictures come out amazing.  The LCD screen is HUGE!  This camera can even capture shots in motion very well.  I'd recommend this model to anyone looking for a serious intermediate model camera.", "Date": "July 19, 2005"}, {"Title": "One of the greatest Camera!", "Author": "Cindy Burnett", "ReviewID": "REXVO7OXCF9SM", "Overall": "5.0", "Content": "I adore this camera. I now also have the F31fd which is also great. You can't go wrong with Fuji.", "Date": "June 16, 2008"}, {"Title": "Over 3 and still kickin!", "Author": "K. Dimeler", "ReviewID": "R166Y2QU16MH6Q", "Overall": "5.0", "Content": "Figured I should finally review this product. After having it for 3 years, I can definitely say this is the best digital camara I've ever owned. I've had quite a few different brands of camera run through my family & friends and this one always comes out on top as most convenient AND highest quality.It was my first personal camera as well, and I think I'll be sticking with the Fuji brand for a long time. 3 years after getting it, it still has great battery life- I only have to charge it twice a month (tops) and I use this thing ALL the time. Like almost every day. Cam to computer is easy as pie- no software needed. Great quality photos- I'm an art student, so I use this camera for all sorts of things; personal photos of friends, artistic photography, reference photos, and for taking high quality photos of my work. It's never failed me!I have to say, everyone who encounters me using thing is instantly jealous and starts asking about it. Same with photos I post online. People with their own cameras (including my sister, who has two professional cameras of her own) always just end up asking to borrow mine because it's just so darn easy to use and takes great pics! Point-n-shoot, baby. Fast as lightning~ (Yeah that like second start-up time? Awesoooome!)Letting go of this cam will be hard, but I intend to keep it as LONG as it lives! And it's been through its fair share of bumps & dents, hehe. But when I do eventually run this thing into the ground, I plan on buying the most similar cam Fuji has to offer! ;)", "Date": "April 4, 2008"}, {"Title": "Good Buy For Buck", "Author": "Better \"Better\"", "ReviewID": "RIKZZW0CYRWWL", "Overall": "5.0", "Content": "This camera, though less-pricy than some of its competitors, outshines the competition. It might not be the best buy for you if you want incredibly professional quality photos, but for the more casual/ informal photographers, this camera rocks!!  You have your choice of various scene settings, and the picture quality is usually good (even if on the higher ISO settings). The camera also has other nifty features that prevent blurry photos and unfocused shots. My only problem with this camera is that the capture button is sometimes hard to maneuver, and a little resistant at times.  Overall, however, this camera is a good buy for your buck!!", "Date": "February 22, 2008"}, {"Title": "Fantastic camera for travel", "Author": "D. Jacome", "ReviewID": "R2KJG9QAS0IUC4", "Overall": "5.0", "Content": "I purchased this camera in January 2006 because I was tired of lugging around my heavy Canon PowerShot G2 while on vacation. The Finepix F10 has surpassed my expectations in every way. It is very light and compact, and slips easily into all but the tiniest of purse pockets. I can comfortably carry it in my hand when I want to have it ready for a quick photo opportunity. I was concerned about the open LCD viewer, but it still has no visible scratches despite a lot of abuse. The camera turns on and focuses very quickly. The quality of the indoor photos is impressive, even in museums with low light. I never fiddle around with the aperture and other more technical settings, but I've had great results just by forcing the flash on or off and using the macro setting. I can also attest to the long battery life. We went to Europe for 9 nights, and we fried the transformer on the second night. Since I didn't want to take a chance on ruining my camera, I didn't recharge it for the rest of the trip. I took close to 500 pictures (300-350 after the last charge) and there was still plenty of battery life left. The only improvement I'd like to see is an optical viewfinder, since the LCD viewer is tough to see in bright light.", "Date": "August 20, 2007"}, {"Title": "unreliable-fatal breakdown only 1 month after warranty expired!", "Author": "E. Liu", "ReviewID": "RD5L84F2LLDOZ", "Overall": "2.0", "Content": "The title says it all: one month the warranty expired, the zoom feature on the camera broke, making a horrible grinding noise if you attempted to turn it on.  The camera is all but useless.  The Fuji shop said they need to replace the lens assembly, at a cost of at least US$120; for that price, I'm buying a new camera, but not another F10.", "Date": "September 24, 2006"}, {"Title": "Terrible Customer Service!!!", "Author": "C. Allen \"Jason Logue\"", "ReviewID": "R16WIA3HQ9IAJY", "Overall": "1.0", "Content": "The camera is fine as long as nothing goes wrong. Fuji has the worst customer service I have ever delt with. They pass you from one person to another and do everything they can not to help you. Be prepared to deal with the worst customer service in the business. I really hope this helps you.", "Date": "December 23, 2007"}, {"Title": "Great camera!", "Author": "Kristina", "ReviewID": "R2RTMHFI1D83Q5", "Overall": "5.0", "Content": "This little camera is amazing!  The lcd screen is huge!  I think the picture quality is very impressive.  There is enough manual controls for most people and the auto mode takes great pictures.  I would recommend the F10 to anyone.", "Date": "June 17, 2005"}, {"Title": "Love IT", "Author": "Brian Young \"Brian Y.\"", "ReviewID": "RLAVRAO69U1GN", "Overall": "4.0", "Content": "Great everday shooter, but the flash does not have any range. I went to the air and space smithsonian, and a lot of my pictures did not come out. However there is not much of a delay from the time you press the shutter button to the time the camera takes its picture, and night shots do come out nicely. This is the nicest litter shooter I have ever owned, way better then my easyshare.", "Date": "March 2, 2006"}, {"Title": "Fuji Finepix F10 - good buy", "Author": "C. Harris", "ReviewID": "RNDR4RSJTTSQZ", "Overall": "5.0", "Content": "Delivery was speedy.  The Fujifilm Finepix F10 6.3 MP Digital Camera and all features are easy to use as is the software that comes with it.  The 3x optical zoom is wonderful. Clarity of photos is wonderful.  Took the camera on vacation and the battery did not need to be charged until the eighth day.  This was after daily, continuous use.", "Date": "October 17, 2005"}, {"Title": "Great Camera except . . .", "Author": "Leo R. Marcotte", "ReviewID": "R2BLPV0IRHK7IG", "Overall": "4.0", "Content": "The Fuji F10 is an outstanding camera with a small problem:  When shooting in brilliant sun light and trying to frame the picture, the screen is sometimes hard to see.", "Date": "August 18, 2006"}, {"Title": "great camera for the right price!", "Author": "M. Groen \"Yoshi Rider\"", "ReviewID": "R3V6ZO1M7WE4AQ", "Overall": "5.0", "Content": "I recently purchased a f10 at my local walmart on clearance. I would recommend the f10 to anyone seeking an easy point and shoot camera with good battery life.  I tried the f10 after purchasing 2 other digital camera's. The f10 comes with a 16mb xd memory card and the approprate cables. The battery is built in but has exceptional life. I was initally concerned with having only one battery, but the performance has demonstrated there is no need for concern.In terms of the picture performance the camera has a number of settings but takes excellent photos with use of the auto focus setting. It also works well with motion once you understand how to use the autofocus. The pictures with this camera were much better than the 8mp polaroid I had been using. I purchased a 512 xd card and this seems to meet my needs in terms of storage capacity. Overall this is the best camera I have seen for $200. It was rated 1 by consumer reports last year. If you can find one for under $200 its well worth your money.", "Date": "June 20, 2006"}, {"Title": "Best little camera I've ever owned", "Author": "Chris on the west coast", "ReviewID": "R3ALJ86EYC31V3", "Overall": "4.0", "Content": "I've been using this little camera for over 5 years and it has taken amazing pictures for me over the years. I had liked it so much, I bought a little larger Fuji Camera shortly after and found the battery life was sucked away by the bigger screen and lacked the natural light setting the F10 had.  Just yesterday the telescoping lens stopped functioning and I will really miss not having it. But as great as it was, It was past its prime because newer digital cameras have more advanced features and image stabilization which the F10 lacks.  I will by another Fuji I think if I can find a decent successor to the the F10.", "Date": "April 29, 2012"}, {"Title": "Great Camera", "Author": "Jessica Nelson", "ReviewID": "RK4CH1Q4E9ZV6", "Overall": "5.0", "Content": "I have had this camera since 2006 and I absolutely LOVE this camera.I purchased this camera when my other one breaking that I had had since 2001.  I wanted something smaller that would take good photos.I have taken portraits that photographers didn't know were taken with my camera.Even in the low mega pixel mode this still takes very good photos.", "Date": "April 18, 2010"}, {"Title": "Fuji F10 good camera but needs new charger and battery", "Author": "Brian plays Tennis", "ReviewID": "RCGYI2TEMDX72", "Overall": "3.0", "Content": "The Fuji F10 seems like a good camera so far but the charger they included had a European adapter so won't work in the USA, and the battery doesn't seem to hold a charge long.  The seller should have said that.  So I need to buy a new battery charger and maybe a battery.  Also, the camera had sticky substance on part of it I had to wipe off with a damp cloth.", "Date": "July 2, 2009"}, {"Title": "fujifilm camera and seller review", "Author": "Love", "ReviewID": "R3M0SMS88FFX1R", "Overall": "3.0", "Content": "The product is good quality and seems to be performing well. The product was shipped within a reasonable time. It did however come poorly packaged, e.g. without protective packing materials around the item. The order was missing a described memory card initially.The seller was reachable by both email and phone, and he did respond to my concern about the missing card. When I did receive the memory card some time later, it was one that had even more memory than he had said he would provide. Overall, I ended up feeling pretty satisfied with the product and the seller.", "Date": "January 13, 2009"}, {"Title": "Very satisfied with it", "Author": "ManangK", "ReviewID": "RU8LFT0NXUP4M", "Overall": "4.0", "Content": "First off, I am an ordinary point-and-shoot gal with just a little tech knowledge to know enough how to play with digicams.  I am not a photography expert.  So this review is more for users like me.My first digital camera was a Finepix 1 MP when it was freshly out of the market (bought it at $400 then in HongKong). It took sharp beautiful pictures and had very fast shutter speed (an important feature I came to appreciate when my husband had a 4MP Kodak, which could not capture the moment when you take pictures during family gatherings because of its super slow shutter speed which I presumed to be secondary to its higher MP). Because of that, he gave me a 6MP Finepix F10 as a gift (my 1 MP then had been giving me beatufiul pics for 5 years, through abuse of having been dropped at least 2 times from a height of 4 feet or 2 ft unprotected bya camera case, subjected to showers of some water or flour since I do foodblogging). One thing I can say, Finepix really lasts.Now with F10, I am taking better photos with higher resolution as well. Very good in low light,especially when I want to take macro photos of my food.  Ordinary photos of family and friends are very good. Pictures of family during night inside the house has become sharper compared to old Finepix (so it's an improvement). Sometimes I have enough light from the house lights that I even have to suppress the flash and F10 will automatically adjust and give me better, sharper photos.  Its image-stabilization feature and still fast shutter speed are things to emphasize. Oh, and battery power really lasts, that my xD card's capacity is the limiting factor instead.After owning the Finepix F10 and learning to use the additional features and adjusting to the different menu, my husband's Kodak 4MP suddenly went dead, no nothing... (after using it for about 2 years) and we suspected one of the kids probably dropped it (we had no proof).  So on our anniversary I gave him a 12 MP Kodak (because that's what he was used to) though we had quite a wait for Kodak to come up with high MP that uses Li-Ion battery. Kodak seem to have improved on its shutter speed and still takes good quality photos.  I cannot say much in comparison between the two because I do not want to bother learning how to use a different menu.  I brought this up because I want to compare sturdiness.  After 10 months of owning this new Kodak, it suddenly gave us pics with white horizontal lines, worse for outdoors photos, without having been subjected to dropping or water sprays (my husband made sure he took good care of this one, not allowing any of the kids use it).  Good thing we kept the receipt. It just went to the manufacturer yesterday for repair. Hope they won't charge us anything.My F10 is still going...still subjected to flour, oily/sticky hands, dust, sprinkles...Oh, and I love the size...enough for me to handle it. I never liked too little cameras because they are hard to handle.  The casing also appears expensive, not plastic.  Not sure what it is made of.  And yes, it is made in Japan...Love it!Why I am giving it 4 stars???  Because I have not spent enough time with it to truly learn how to use other features/settings which I rarely use.  But for my most-often used settings, I give it 5 stars.", "Date": "September 24, 2008"}, {"Title": "Used Finepix review.", "Author": "James R. Sutton", "ReviewID": "R2LX7TB88TF8JO", "Overall": "3.0", "Content": "I am enjoying the camera with no problems.  Would have been nice to have had access to long term \"insurance\" just as a precaution.", "Date": "May 13, 2008"}, {"Title": "It's great", "Author": "Nancy L.", "ReviewID": "R3M0PD8UD38TMO", "Overall": "5.0", "Content": "The refurbished camera was in great shape and takes fantastic photos.  Only complaint is it did not come with a carrying strap but I don't remember if the listing said a strap was included or not.", "Date": "February 7, 2008"}, {"Title": "Fantastic", "Author": "J. J. Buniag \"Jason J. Buniag\"", "ReviewID": "R1PQCQRXM2WH7K", "Overall": "5.0", "Content": "The product is excellent! It is exacly what I wanted. It's not blurry or putting put dark photos. I would recommend it to anyone.", "Date": "November 7, 2007"}, {"Title": "Terrific Camera....Reliable!", "Author": "chrisw", "ReviewID": "R1KRMXFV9YOEQ7", "Overall": "5.0", "Content": "I bought two of these for my grandkids when they were on sale for $139.  No problems upon receipt, worked like a charm right out of the box.  Technically (eg, shutter speed) much better than my Olympus, you can't go wrong even at a much higher price. The kids are thrilled.  It's been several months now, the cameras are rock solid.", "Date": "September 7, 2007"}, {"Title": "Amazing Camera", "Author": "Kevin Ferrone", "ReviewID": "R2NINVN7Q5SJ24", "Overall": "5.0", "Content": "This great machine, simply put, takes superb pictures.  I have experience using a great number of point and shoot cameras and this is definitely the best.  The features give a great control over what you shoot if you are so inclined to use them and know a bit more of photography.  But if not you can just use the auto mode and take unbelievable pictures.  Pictures I take with this camera often look better than ones I take with my 8mp canon rebel.  The video is also great quality compared to any other point and shoot cameras.  For the price, this camera is spectacular!  If you are even considering buying it then please make the purchase, you won't be let down!", "Date": "March 14, 2007"}, {"Title": "Awesome camera", "Author": "Matt Garza", "ReviewID": "R12YV1HUUS4TCF", "Overall": "5.0", "Content": "I picked this camera up for an amazing 150 dollars at Sam's Club! I was originally going to buy the Canon Powershot a630 but didn't want to pay 100 dollars more. This camera takes awesome pictures and has a great movie mode. I don't know much of the photography jargon, but I know you can adjust the white balance, ISO and shutter speed in the manual mode. Some shots do come out blurry but most look great and I'm sure will look better on a 3x5 photo. I was blown away by the macro mode, I have submitted a macro of my eye. The photo viewer here on Amazon doesn't do the picture justice...when I view it on my computer it's just breathtaking how detailed it is. My old cam was a 2.3 megapixel and I could only take 16 pics on the internal memory, with the fuji f10 and my 1gb olympus xd card, I can take 341 fine-quality 6mp pics. I love this camera.", "Date": "October 16, 2006"}, {"Title": "Wow!", "Author": "A. Karsten", "ReviewID": "R1414OAYIJT6RP", "Overall": "5.0", "Content": "I love this camera!  I am a new mom and wanted a nice camera that was easy to use.  It takes beautiful pictures!", "Date": "December 13, 2005"}, {"Title": "Decent for middle-of-the-road point-and-shoot...", "Author": "Ghost", "ReviewID": "R101LWH18QYP6Q", "Overall": "4.0", "Content": "I bought the F10 mostly to give me another camera that I can use more frequently than my admittedly unwieldy (though absolutely wonderful) Fuji S5000 that I've had for almost two years.  I'm an avid photographer with the skill of an advanced amateur, so for what it's worth, here's my perspective on the Fuji F10.~~~~~~~~~~~The Pro's:**It's small enough to easily fit in any pocket, a portability which was a major selling point for me.**An impressive 6MP capability that can be useful, although I find myself sticking with 3MP to keep file size down.**Photo quality overall is quite good.  It gets grainy in low light with the higher (800 and 1600) ISO's, but for general use, the flash is fine for allowing lower ISO settings.  I need to do a little bit more experimenting with it, but I'm decently impressed thusfar.**After using the xD card for my S5000, I'm VERY pleased that Fuji is sticking to it.  It's small and portable, VERY fast, and consumes remarkably little power.  I now have a 512MB card and 256MB card, neither of which cost me more than $55, and between them, I can take about 1000 3MP photos, more than enough until I can unload them to my computer.  Any complaints about these cards are baseless.**It operates VERY quickly.  It starts up in less than 2 seconds, and once it's focused, the shutter is almost as fast as the 35mm cameras I used to own.~~~~~~~~~The Con's:**My biggest complaint by FAR is all of the cables, caused by the lack of separate ports on the side for the A/V out, power adapter, and USB ports.  In order to charge my battery, I have to use three separate cables which cannot even fit inside my carry case.  I'll have to find a bigger one just to accomodate all of the blasted cables.**Something that really surprised me (based on my prior experience with Fuji cameras) is how loud the F10 is when it operates.  Another disappointment is the slow focus time.  It takes shots really fast, but it is almost negated by the slow focus time.**It doesn't give me as much control over my photos as I would like, and the all-encompassing menu is rather unwieldy...~~~~~~~~~~~Overall, it's a pretty decent camera, but the biggest thing to remember is what you get it for... I wanted a small, decent point-and-shoot camera that I can take and use anywhere, anytime.  The F10 is just that, and it has enough additional features to make it worth paying the extra money over another cheap, standard digital.", "Date": "July 15, 2005"}, {"Title": "Great Product", "Author": "Jack", "ReviewID": "R2CAV9LBKT9QZX", "Overall": "5.0", "Content": "This is a great camera. Besides being compact and slim, the large LCD display is a pleasure. This is also the fastest camera I've ever owned. I can't believe how fast it starts up and is ready to shoot!I've already printed photos and am extremely pleased with the outome.I strongly recommend the F10 for all level of users.", "Date": "May 12, 2005"}, {"Title": "See customer images for glove-fitting leather case for F10", "Author": "G. Ziegler \"Resident of a Perfect World\"", "ReviewID": "R16ATPW3YBA4WB", "Overall": "4.0", "Content": "I bought the camera about a 2 months ago and it's a GREAT camera. I have a lots of details to write about (which I will do later) but at this time I just want to give all of you guys headsup on a GREAT leather case for this camera that I found on amazon.comIf you're like me who trusts OEM over aftermarket, I'm sure you've looked and looked for the OEM F10 case. Finally amazon.com has it in stock but it's nearly $40. Well, they didn't have it before so I took the chance with a Canon PSC-50 case made OEM for S410/S500/SD series. What can I say, it's like it is made for F10 too. Just take a look at the pictures and you'll see. The case doesn't have any pocket or sleeve to store extra battery or card, but then that will make 'compact' in the compact camera useless.", "Date": "August 20, 2005"}, {"Title": "incredible....don't think twice!!!", "Author": "David M. Peace \"-David Peace\"", "ReviewID": "R3K6IYW31NB58A", "Overall": "5.0", "Content": "the image quality on this camera is bar none the best I've ever seen.  it fits well in the hand, and I am just so impressed.  i did all my research online....and got raving reviews for this!  They weren't lying!  ITS GREAT!love it...number 1", "Date": "March 29, 2006"}, {"Title": "My first digital camera & I love it!", "Author": "Book lover", "ReviewID": "R1M0X6SZGLITBN", "Overall": "5.0", "Content": "While I am still learning how to use all the \"bells and whistles\", I think this camera is awesome!  I can suppress the flash, force the flash, reduce red-eye, take pictures in low light..  Best of all, the LCD display is so large I can review the pictures immediately and REALLY see them.  All my friends and family comment on the size of that screen.  At a recent family gathering, everyone wanted to review the pictures immediately rather than wait for me to get home and e-mail them!  My nephew has a camera with a tiny screen and no one was asking to see his pictures because you would need a magnifying glass to see anything!", "Date": "April 19, 2006"}, {"Title": "Bad Camera", "Author": "Tony Lee", "ReviewID": "R1C2T7BQE8EXOA", "Overall": "1.0", "Content": "I ordered a refurbished one.  Took a first few pictures.  They all turned out awful.  Too bad I had to return it and get a refund.  Bad one!", "Date": "October 6, 2007"}, {"Title": "If I could marry a camera.....", "Author": "K. Waits \"LordiorOTR\"", "ReviewID": "R1Z8Q9O3GHNITI", "Overall": "4.0", "Content": "it would be this one.  hahaha.  It is the love of my life.  It takes amazing pictures and videos.  Its easy to use once you get the hang of the buttons and different functions and it can get kicked around, dropped, wet and crushed without having a problem.  The only reason I didn't give it 5 stars is because the sound on the videos can be bad sometimes.  Mainly if you're trying to record live music at concerts.  But the pictures for concerts are amazing.", "Date": "January 30, 2007"}, {"Title": "Nearly perfect point and shoot", "Author": "Benjamin A. Wolff", "ReviewID": "RORHTH9VA3YDT", "Overall": "5.0", "Content": "I love this little camera! After waiting for 10 years to buy a digital camera, I'm very happy with this one. In 1996, I was working in a digital imaging lab with the first point and shoot camera's; and said at the time that I'd buy one when the resolution reached about 2000x3000 pixels, and they were affordable. This camera is what I was waiting for. The combination of the ability to shoot at ASA 1600, sharp images, a good size, and a price under $200 (rebuilt) were the factors that made me choose this camera. The slightly clunky menu system and small capacity XD card were minor problems, but shouldn't stop you from buying this camera.", "Date": "July 28, 2006"}, {"Title": "Fujifilm Finepix f10 camera", "Author": "Joe Cool", "ReviewID": "RMA33HMTLOUIT", "Overall": "5.0", "Content": "Terrific pictures for such a small camera. I particularly like the micro mode.", "Date": "August 30, 2005"}, {"Title": "Dissapointed...", "Author": "R2 \"Rafa\"", "ReviewID": "RFFXI8OE38BSU", "Overall": "2.0", "Content": "I did a lot of research on this camera before I bought it as a replacement for my FujiFilm 4800Z, which I liked very much, and was sure I had found a nice replacement for my wife to use. However, I was very disappointed with the sharpness and clarity of the pictures. I had to return the camera to Amazon. I am not sure if this was a defective camera, but all the shoots were a little bit blurry.... I guess I will have to start my search all over again...", "Date": "January 3, 2006"}, {"Title": "a nice camera", "Author": "Zhiyong Tang", "ReviewID": "R24IC6NFH34Q9M", "Overall": "4.0", "Content": "It is indeed a nice camera although the menu is not excellent enough", "Date": "August 30, 2005"}, {"Title": "Fuji is Improving", "Author": "Robert Brody \"Capt. RB\"", "ReviewID": "RJB4D3IC2IH4G", "Overall": "3.0", "Content": "This little camera may be the fastest P&S; type on the market. It has the least shutter lag and is quite fast overall. It's well designed and handles well. Unlike many other P&S; types, the F10 sports an ISO range that is usable up to 400 or so. Beyond that noise becomes a bit too much to deal with. This is a subjective observation and opinions differ, but I feel it's unusable after 400, though that's still better than other units.The camera does have some flaws, deal killers to some:1) It has virtually no manual controls. The ISO range would pay off more if you could work with the settings, but you can't. This is not a camera you can grow with.2) The optics on the F10 are really not that good. They are somewhat soft compared to my Canon A95 and suffer from a great deal of CA. In fact it's the worst CA I've seen on a camera in this class. It's always good to remember that tiny lenses will generally not measure up and this is very much the case with the F10. Please download full size samples at Pbase.com and judge for yourself.3) No viewfinder. For those who have more than a party mentality about taking pictures, the lack of an optical viewfinder is not a good trade off for a bigger LCD. This is not a good camera for someone who wants to learn or employ proper composition.4) No remote. Cameras at this price point should have a remote.I think Fuji is on the right track with the F10. I also tried the E550 which was very good, if somewhat clunky. This camera's main appeal is the speed, rather than ultimate picture quality which is simply better on several other models in the same class. I won't be reccomending this camera, but I have a feeling the next generation will be worth a hard look. That said this is a perfect unit for folks who aren't nitpickers or for a teenager's first camera. Those seeking a good primamry unit or backup for a DSLR package will probably be underwhelmed.", "Date": "June 12, 2005"}, {"Title": "LCD Screen Breaks Easily", "Author": "Bryan Culbertson", "ReviewID": "RF3NYGWZ8WEZ4", "Overall": "1.0", "Content": "After many long weeks of research I decided to buy the Fugifilm F10 camera because of its small form factor, good picture quality, and low light picture taking capabilities. The camera did fulfull my 3 specifications. The low light picture taking does work extremely well (still grainy, but usable).However, not 4 days after I recieved the camera the LCD display stopped working. Since the F10 does not come with an optical viewfinder this renders the camera completely useless. The camera went through normal pocket use, as well as a 2 foot drop to floor from my lap. Fugifilm claims that the LCD broke because of undue physical stress. While the camera did drop to the floor, it was not a far fall nor a violent one. I assure you I did not run my camera over with my car.Needless to say, Fugifilm is refusing to repair my camera under warranty, and the repair costs rival the cost of the camera. For normal use this type of strictness is unacceptable, as is building a portable camera that is so easily destroyed.In addition, Fugifilm's phone support is terrible. They were more accusatory then helpful. As soon as the lady discovered my LCD display was broken she told me to go to the website and download the repair forms and promptly hung up without so much as a \"Is there anything else?\" I will not be buying another camera from Fugifilm again and I recommend that no one else does as well.", "Date": "January 23, 2006"}, {"Title": "Fujifilm F10 is outstanding!", "Author": "Viking", "ReviewID": "R3A82P3K64T9D3", "Overall": "5.0", "Content": "The speed of the F10 is amazing.  Start up is super fast and I don't miss shots like I used to because the shutter speed is so fast.  Fuji Real Photo Technology is great!", "Date": "May 8, 2005"}, {"Title": "windows xp", "Author": "H. goodman", "ReviewID": "R1GD1ZT9HUNXNM", "Overall": "4.0", "Content": "unable to upload pictures into my pc which has windows xp.  Called Fuji who said it was a microsoft issue.  The image wizard won't start.  Is there a patch or fix for this?  What should be an easy upload that now is proving very difficult.", "Date": "November 9, 2005"}, {"Title": "Ignore everyone else, this is a BAD camera", "Author": "T-BONE", "ReviewID": "R2MHKZK6FYL4QZ", "Overall": "1.0", "Content": "Ok, first off I must say I researched this camera for days, read countless positive reviews about how this is so much better than any other point and shoot camera, but I have to tell you I've had it for less than a day and it is complete JUNK!Anyone who thinks this is a good camera obviously has never owned another camera.  I submit to you a photo comparison I have uploaded into the image gallery at the top of the main Fuji F10 page on Amazon.com.  I took a comparison photo of my face, with the F10 and with a Canon A75, which is a lot cheaper and an older model.  Canon whoops Fuji hands down.  Just go see for yourself.Two main problems with this camera:#1 Color reproduction is not as good as Canon, everything looks washed out no matter what mode you use it in.#2 And this is a big problem... There are these mysterious vertical lines in EVERY picture you take with this camera.  You know those lines you see if you have ever tried to print a photo using an old inkjet printer?  That's what all of these photos look like, and I'm not even talking about printing here!  They look that bad right on your computer screen!You can't see them in the photo I uploaded on Amazon because they automatically resize it, but trust me that you will not be happy with the Fuji F10.  Buy something else.", "Date": "August 29, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "6.3-megapixel sensor captures enough detail for photo-quality 14 x 19-inch prints\n3x optical zoom; large 2.5-inch LCD display\nMaximum sensitivity of ISO 1600; super-fast start-up (1.3 seconds), shooting interval (1.2 seconds), and shutter time lag (.01 seconds)\nPowered by a Lithium-ion rechargeable battery (included); 500 pictures per single full battery charge\nStores images on xD-Picture Cards (16MB card included)", "Name": "Fujifilm Finepix F10 6.3MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41qjdIkbh2L._SX300_.jpg", "ProductID": "B0007GIXQU"}}