{"Reviews": [{"Title": "Digital camera", "Author": "Ruth", "ReviewID": "RYE2M02B992WT", "Overall": "4.0", "Content": "After much research and consideration, I decided to purchase this fine little camera.  This is my first digital camera and it was an excellent choice.  I seriously considered getting a Canon Powershot but was a little apprehensive due to their recent problems with the dreaded e18 error messages.  Granted, this Olympus camera is a new model so not much is known about potential risks, but I was willing to take a gamble and purchase it.  Plus, with an excellent price point, I felt confident about my decision.The large LCD screen is wonderful!  This camera has a nice choice of scenes to choose from as well, but I have felt so far that the auto feature does the job just fine.  It was easy to use right out of the box and took very little time to get used to.  I have a Mac and it was a cinch to plug it in and start downloading pictures.  The software that comes with the camera is not required for Mac users.There are a few negatives.  If you want to take very fast pictures, this probably isn't the camera for you.  It takes a couple of seconds to take the shot. The camera also has a movie feature, but there is no microphone, therefore there is no sound.  This really isn't an issue for me as I was not looking for a video camera.  Out of the box the camera can only take about 7 pictures, so purchasing a xD picture card is a must.  I also believe rechargable batteries and a charger is a good idea as this camera eats AA's for breakfast.  The only other small complaint is peoples faces on the LCD came out a little more pale that I would like, but the digital image on my computer is excellent!I would recommend this camera to anyone who might not have owned a digital camera before or may be tired of the Canon run-around.  Overall, I am very pleased with my purchase.", "Date": "September 23, 2006"}, {"Title": "good pictures,very decent  for the price", "Author": "B. Puri", "ReviewID": "RC1OL20QPHX32", "Overall": "4.0", "Content": "this is a nice camera from olympus ,the big lcd is plus .It's small enough to fit in your pocket and fits comfortably in my hands.The image quality is good ,however the guide setting is very useful and pictures come out pretty clean,sharp and focused.The other settings results in soft images and the dis mode(digital image stabalization)results are noisy but stil usefull upto 4x6 prints.The battery life is mediocore,since it uses aa batteries,i recommend rechargeable they last long.For its low price ,large lcd,and good image quality ,i would recommend this camera to anybody.In the end its a good buy.", "Date": "September 10, 2006"}, {"Title": "A great little camera", "Author": "B. Pool", "ReviewID": "R1MPC6PR4HZ3YC", "Overall": "5.0", "Content": "I bought an Olympus FE-140 originally and played with it for 24 hours before finding an FE-170 on sale. I returned the 140 and bought the 170 because although it has fewer settings the larger 2.5cm screen is much easier to see and the functions are more refined. I wanted a camera I could carry everywhere I go and take good quality pics that would suffice for photo competitions. It is a point and shoot but the picture settings are numerous and of good quality and images print perfectly to A3 size thanks to the 6MP. I also bought a little plastic sunshade that screws onto the tripod hole and not only protects the screen but also makes the screen easy to see in direct light. I also own some large cameras and use them for professional work but the FE-170 is perfect for everyday stuff and a valuable asset. Beware if you drop it the LCD screen can break and I have seen one with a nasty crack in it, but it still worked.I would recommend te FE-170 to anyone. The flash is great, the menu options easy to follow, the digital zoom has been made better in this camera and its the perfect camera for the pocket.Don't bother buying the FE-180 or 190 - they may be a few months newer but they don't have any better features.", "Date": "October 28, 2006"}, {"Title": "Great Camera Good Price", "Author": "K-cee Kit \"CAH-M\"", "ReviewID": "R23OWZA1HTZQW7", "Overall": "5.0", "Content": "I almost did not get this because I could only find a couple reveiws and they werent that good....GLAD I DECIDED TO TRY IT. It really is a great little camera very sharp looking and sturdy. It origionally says it only has the capacity to take 6 pics...but if you change the pic quality it can store up to 60. So you dont have to run out and purchase extra memory right way. It has tons of features that I found it to be fairly easy to use even with out referring back to the manual. Its not difficult so thats a plus.Really my only negative is theres No sound it plays up to 30sec clips with the memory it comes with...really I dont have any complaints its a neat little camera. Very sharp looking and takes good pics I have taken some of my son, pets, scenary, and night time. All were great. I hope this helps I dont understand why most of what I found was negative. Its really very nice.Thanks.....", "Date": "December 29, 2006"}, {"Title": "Not a bad camera", "Author": "R. Beaudry", "ReviewID": "R29PC9BW4B5UAM", "Overall": "3.0", "Content": "I got this camera to replace an inexpensive Fuji that I had carried with me during a military deployment.  Both camera's use the same memory card so I was able to save some money by reusing the memory from my first camera.  The Olympus FE-170 was very easy to set up and use right out of the box.  I like the large screen for reviewing pictures.  The price was right where I wanted it to be and I understand the price vs. quality so my expectations were reasonable for my purchase.  The pictures are OK but sometimes they appear a little grainy compared to pictures from friends cameras.  I may need to play with the settings some to fix that.  It does seem to cause a lot of red eye though.  However I knew what I was spending and the price, size and easy of use help make up for picture quality.  I like the camera but I wouldn't take the family photo for framing with it.  It does take some very nice outdoor scenic pictures.  Overall this is not a bad camera for everyday use.  It is small so it fits in all my pockets and the lens is covered so it doesn't get scratched easily.", "Date": "January 18, 2007"}, {"Title": "Great Camera", "Author": "C. McDonald", "ReviewID": "R3LX7S7UGC11DP", "Overall": "5.0", "Content": "This is a great camera. Low cost, which is always a plus, and it takes fantastic pictures. I have no complaints at all. The coolest thing about this camera, to me anyway, it uses two AA batteries. If your batteries die on you, go buy two more AA's. You don't have to worry about charging it, or buying a second battery. If your on vacation, you don't have to pack a charger, AA's are very easy to come by. I love this camera, and the software bundle is top notch. Edit: 1-23-2007, this camera takes unbelievable pictures, outside, inside, where ever. I have printed out a ton of pictures, they are absolutely breathtaking. I still recommend this camera.", "Date": "January 14, 2007"}, {"Title": "Good Camera Good Price.", "Author": null, "ReviewID": "RJF1ZK9MA51QJ", "Overall": "4.0", "Content": "This camera is really good. I really like Olympus so it was no trouble in choosing a company to buy from. Packed with features, this camera is just amazing. It is compact and the LCD screen is perfect for viewing photos. In when receiving your camera, you may find that it only can take up to around 6 pictures, but have no fear: you can go to the setting and make the picture size smaller and thus, take up to 58 photos without a memory card. The cam will only take 6 pics at first because it arrives set at the largest picture size. And yes, like others have mentioned, it eats AA batteries like a hungry hippo. Believe me, scrambling around the house searching for batteries out of tv remotes, portable cd players, and whatnot is what happened to be my friends problem in using hers. So, that seems to be the only downside. Also included is the camera's picture editor, of which you install on your computer so you can edit and transfer images online or simply browse your taken images. All in all, good buy if you are just getting a cam.", "Date": "October 24, 2006"}, {"Title": "Olympus FE-170 - A Good Basic Camera", "Author": "John Thompson \"Big65Dude\"", "ReviewID": "R1MBD3DK0AVOTN", "Overall": "4.0", "Content": "I bought the Olympus FE-170 for my wife as a Christmas present. She had never used a digital camera before this - strictly a film person. Nevertheless, she took to this camera - as they say - \"...like a duck to water.\" The controls and settings are intuitive and easy to use and the built-in help, or how-to, menu covers anything she could want to do with the camera. I, on the other hand, being a little more experienced in digital photography, nevertheless found the Olympus FE-170 adequate to my requirements as well. All in all, a good little camera for the beginner that will still be responsive as experience grows.", "Date": "January 18, 2007"}, {"Title": "Camera", "Author": "Jennifer L. Johnston", "ReviewID": "R24AHLQP72DEL1", "Overall": "4.0", "Content": "Purchased this camera for my daughter's birthday gift.  The pictures she has taken as a beginner were very clear - she hasn't had the goof ups she has with mine. I am attributing that to the image stabilization.  I loved the menu to help guide her on settings and she really likes the large screen.  It  was a good purchase - her camera is better than mine now (which was an earlier Olympus Digital camera).", "Date": "February 20, 2007"}, {"Title": "Good For Outdoor Only", "Author": "S. Cochran", "ReviewID": "R1JPNMLCW20LY2", "Overall": "2.0", "Content": "My husband and I decided to upgrade from a 2mp to a 6mp digital camera this year for Christmas. Our old camera was an olympus that we had bought simply because the price was right. After 4 years, it had survived much abuse so we decided to go with olympus again. We purchased the fe-170 with high expectations. The camera took great outdoor pictures in bright sunlight. But indoor pictures had a blue haze to them and when we took the same pic with our 2 mp and compared them, the 2 mp was amazingly better. Conctacted olympus to find out if we just had a bad camera and their reply was to tell us to use the flash indoors, like we had never used a camera before! Took it back to circuit city and exchanged it for Nikon coolpix L1 which we are much happier with!", "Date": "December 16, 2006"}, {"Title": "No Sound in Video Mode AT ALL !!!!", "Author": "L. Cortez", "ReviewID": "R2Z1SLON3TUC6E", "Overall": "1.0", "Content": "One thing that bothers me the most with this camera... is that when in video mode, the video takes no sound!!! Similar models from Canon offer digital cameras that record sound; therefore, I cannot recommend this product at all.", "Date": "July 27, 2009"}, {"Title": "I hate this camera", "Author": "Lisa \"kginqts\"", "ReviewID": "RDUVIG34K9KK5", "Overall": "2.0", "Content": "Every photo I've taken has been fuzzy and unclear.Also the color is not true. I know it's the camera as I have Sony camera that is near perfect. I can't wait to get rid of this piece of junk. Plus the Camedia software that came with this camera didn't work on my computer!", "Date": "February 3, 2007"}, {"Title": "Disappointed", "Author": "M. A. Keagy \"bird watcher\"", "ReviewID": "R3UFDS72L3LP2Y", "Overall": "2.0", "Content": "When I received my new Olympus Camera, I was so happy.  I have used several Olympus cameras and have been very pleased in their performances.  But, even though this camera took beautiful shots, the battery life was terrible.  I had to use the LED display for the view finder since there was none included in this camera.  I had to change and recharge the batteries 4 times to take images of one birthday party.  I returned it after talking to a helpful technical assistant for Olympus.  He said to get a lithium battery that it would last longer.  But he didn't know if Olympus had battery rechargers for this camera.  He used a Kodak for his photography.", "Date": "January 3, 2007"}, {"Title": "Olympus top-notch optical quality, as usual", "Author": "RiverGuy", "ReviewID": "RGSZX0BDT4C25", "Overall": "5.0", "Content": "Ok, this was an inexpensive digital camera, purchased new in 2006.  It has taken some absolutely fantastic photographs, far beyond what can be expected in this price range.  Finally just replaced it six years later with an Olympus VR-330, for no good reason other than the new model was on sale.Rugged, easy to use and best lens quality for the money, bar none, this is typical for all Olympus gear.If you understand that optics are more important than mega-pixels, you are probably already familiar with Olympus.  This camera does not disappoint!", "Date": "June 26, 2012"}, {"Title": "Decent camera, but not perfect", "Author": "Lassie VeUss", "ReviewID": "R2FIH8EMV0UTI0", "Overall": "3.0", "Content": "I can honestly say that this camera has served me well for the past 3.5 years.  It was my first digital camera and has captured many memories for me.  It does an excellent job with outdoor photos, however indoor photo quality is often grainy, blurry, or strangely colored.  It also has a tendency to capture a red circle in the eyes of people which can't be fixed with red eye remover in post-production (this is only in indoor pictures, though).  I've noticed that, as time goes on, it's taken the camera longer and longer to snap shots.  This has resulted in having to hold the button down for several seconds before the camera snaps...therefore I've missed several shots (such as someone famous walking by, or a baby doing something cute).  The zoom, while effective, does not capture clear shots and the camera would benefit from a stabilizer feature--especially since it takes so long to snap shots.  I found the camera to be just as usable as any other digital camera, although I'm pretty quick with technology so I'm not quite sure how it would do with children or less technological users.  Oh, and I believe that you can only use the Olympus memory card with in it which may limit you a bit in terms of price and availability.", "Date": "March 14, 2010"}, {"Title": "I love it!", "Author": "Viorica Sandu \"dream-chase\"", "ReviewID": "RMQM4Z0G35Q6R", "Overall": "5.0", "Content": "Very nice under water camera, I am going on vacation oversees to the Black see and I can't wait to use it!", "Date": "June 20, 2009"}, {"Title": "Frustrating!", "Author": "Ebony Curtin \"Kenwoodgirl\"", "ReviewID": "R2V8X3DA3DGXRH", "Overall": "1.0", "Content": "I started having problems with this camera within days of the warranty expiring.The memory card I had for it was an Olympus one, and fully compatible with the camera, and I had been using it with no problems for almost 12 months.  However, I'd be taking pics and a menu would pop up with \"Power Off, or Format\" on it, and I could only get rid of it and continue using the camera by selecting one option.Frequently, the \"power off\" option would not work, as the menu would persist as soon as I turned the camera back on.There were many times where I had to choose the format option, thereby deleting any pics I had just taken on the card, which was really disappointing to say the least.Then, not long ago, it just decided to stop taking pictures at all.Now, when I go to shoot, I can see through the LCD screen just fine, but once the picture has been taken, it comes out black - nothing.I've tried resetting the factory settings, changing the batteries, formatting the memory card, removing the memory card, adjusting image quality, and taken pics on every setting there is, but nothing works.Funnily enough, it still takes video, which can be viewed and played back fine, but no pics.Complete waste of money, and after this experience I won't be buying Olympus again :(", "Date": "July 21, 2008"}, {"Title": "good camera for temporary use", "Author": "starjizzim \"starjizzim\"", "ReviewID": "RBEYHBITFHHCA", "Overall": "2.0", "Content": "My problems with this camera started to happen after six months. The retractable lens started to get jammed. Now the camera will come on then shut off with the lens still out. This camera is a piece of junk and I would never recommend it to anyone.", "Date": "December 17, 2007"}, {"Title": "What is everyone thinking who rates this good?", "Author": "whatever776 \"unimpressed\"", "ReviewID": "R1CYEFRY2EMM3B", "Overall": "1.0", "Content": "I bought this camera to replace an aging Nikon Coolpix 2500 2.1mp.  I excitedy ran out and took pictures of all sorts of things with both cameras in similar modes.  I was expecting more awesome pics, but instead every pic from this camera was inferior - every one!  Anyone who thinks this camera takes sharp pictures is clueless.  Because it was a gift i felt obligated to take it on my trip to europe last year.  I was with a friend who had some european camera with 5 megpxls.  Every picture she took from the same angles came out better.  Finally i dropped it for the first time and it broke instantly.  It would only work in one mode.  I have dropped that old nikon half a dozen times and it still works perfectly. I decided to use it for general work pics after that, and use my old nikon for important photos. after less than a year, the FE-170 had sand in the lens and stopped working. I dont even know where it got the sand i tried to baby it.  anyway, it totally sucks in image quality and reliability. Don't even think of buying it.", "Date": "December 16, 2007"}, {"Title": "Digital Camera", "Author": "Danny R. Hildebrant", "ReviewID": "R2XGLNVIKN5BEL", "Overall": "5.0", "Content": "This Camera is a grate little Camera. That is right little it is perhaps the size of a pack of cigaretts. But Wow what grate pictures you can take with it. When I bought mine I was very impressed with it, So much that when a friend of mine was looking to purchase a Digital Camera I bought them one of these Olympus FE 170 Cameras. You have all the differant settins on this Camera thet you could ever possabibly use and all the soft ware and cables for picture transfer to your computer are included. This is a grate Camera and very in expensive I could not beleve the cost for such a good product. My recomendation if you are looking for a great and in expensive Digital Camera buy this one and get the 512 Memory Card for it. I have done this twice and I have no regrets. Only prase.", "Date": "November 8, 2007"}, {"Title": "Great little camera", "Author": "L. Puello", "ReviewID": "R15E4DW09BF34G", "Overall": "5.0", "Content": "Great image at 6.0 m-pixels, large LCD at 2.5\", very simple and easy point-and-shoot camera. Fits easily in a shirt pocket. A winner!", "Date": "January 9, 2007"}, {"Title": "Dissapointed!", "Author": "Alena K. \"Alena\"", "ReviewID": "R20LXP6RO3ZJIP", "Overall": "2.0", "Content": "I've been very happy with Olympus products and bought this camera to replace my older Olympus D-580 (great camera, by the way) and was dissapointed from the moment I took the first picture. Both indoor and outdoor pictures come out in blueish-greyish tones. Even with the flash the indoor pictures were dull and grey. Flash seems to be not powerful enough to take a good bright picture even close up. The shutter is fast, but it's very hard to take a clear sharp picture - most of my pictures came out blurry. I tried different settings, but still wasn't happy. I liked the small size of the camera and the big LCD but had to bring the camera back to the store. I would not recommend this camera.", "Date": "December 25, 2006"}, {"Title": "Not impressed", "Author": "F. Verdi \"The Philadelphia Kid\"", "ReviewID": "R2UBIQL7HMUE88", "Overall": "2.0", "Content": "I bought this camera in a pinch when the refurbished Fuji I bought for an important weekend crapped out within hours. The FE-170 is a decent camera, but I expected a lot more. The pictures seem saturated to me, with a kind of blue-pink rosy hue. The features are kind of dumbed down, and don't really offer much for those of us who like to tweak settings. No sound on video and no black and white setting. Everything else aside, the biggest problem I've had by far is with red eye. Almost every picture we took inside ended up with red-eye. Far more then any other camera I've used. There is a red-eye flash setting, but it is manual and not very effective. I'm surprised to see that others had so much luck with it, just as I was by how unimpressed I became. I think my old Sony takes a better picture to this day with far less Mega pixels.", "Date": "November 6, 2006"}, {"Title": "Disappointed with this camera", "Author": "Henok Y. Tekolla \"history is written by the v...", "ReviewID": "RJIWG78KEEEY1", "Overall": "2.0", "Content": "Baught this camera thinking that it would be identical to the photo provided on amazon.Later on i found out that unlike the camera that my friend had this camera was smaller and a cheap reproduction from china,didn't look durable at all.Since the return policy highlighted the importence of keeping the product sealed,i didn't get a chance to open it and try it.To be quiet honest i was disappointed by this product.I urge you to take a good look at the picture of the FE-170 versus the product you receive.", "Date": "December 1, 2006"}, {"Title": "Terrible Terrible Terrible", "Author": "Joseph Abello \"joeabello\"", "ReviewID": "RGVNHXORMFNOS", "Overall": "1.0", "Content": "I got this camera as a gift and after taking pictures I decided to hook it up to my computer to upload.  The computer doesn't recognize the camera and I can't upload any photos.  After 6 emails and 3 phone calls in the past 3 days, Olympus still had no solution to my problem.  Don't buy this camera or any other Olympus product.", "Date": "January 4, 2007"}], "ProductInfo": {"Price": "$199.95", "Features": "6.0-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints\n3x optical zoom; 2.5-inch LCD display\nDigital Image Stabilization Mode\n16 pre-set shooting modes\nStores images on xD Picture Cards; powered by two AA-size batteries (two alkaline batteries included)", "Name": "Olympus FE-170 6MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41RC0GG3A6L._SX300_.jpg", "ProductID": "B000H7FXAS"}}