{"Reviews": [{"Title": "Highly Improved Low End L Series", "Author": "P. Yamagata \"1000 Peaks\"", "ReviewID": "R1M3RD82SJDIOA", "Overall": "4.0", "Content": "With the standard proviso that tech stuff always gets better and cheaper, I highly recommend this new camera model for the low price. I have only had it for two days, since Nikon didn't warranty my broken LCD screen on my L4. Please do be careful with the fragile nature of these electronics! I didn't drop it or abuse it, and it apparently broke in my pocket within a padded case!Back to the L10, most everything is better than the previous, low end, L cameras, with improved sound, and what is great for me, voice recording capacity, outside of 20 second voice memos attached to a particular photo. While digital voice recorders are cheap for PCs, I have a Mac and previously, only iPods with accessories, or other costly recorders, can create sound files to be then imported to your computer and then burned to CDs. With just a 512 MB card, you can record for hours.The image quality is a bit bluish, some color cast that hopefully can be corrected with software. The sharpness looks O.K., and for the price, it's fine for me. This makes a great back-up camera, as I use another more expensive L series camera. On the road, I can't afford missing a great scenic shot, or hundreds of those.The L10 is smaller and slimmer than the L4. It carries well in your pocket. It has slightly simpler buttons and controls. The lens retraction is quicker on shut-off, and the zoom is rather abrupt. Other new, handy features are characteristic of the planned obsolescence of most tech items. Goodies that will have you wanting to upgrade!It will remain to be seen how durable this camera turns out to be, but I have high hopes. I intend to be more careful, and never subject this beauty to shock or any possibility of drops.Speaking with a tech support rep, you need to have nickel metal hydride batteries with more than 2000 mAh worth of power, in lieu of what they recommend (Nikon-approved rechargables). Some of my Ray-o-Vacs aren't.I'm using only the approved SD cards, but they now support up to 4GB cards. That's great if you can trust the card not to fail--why I buy several in smaller capacities, and therefore don't have all my eggs in one basket. You'll get enough memory, then at 4 GB, for probably then, a few thousand photos storage.One major thing they can work on are the streaks that still appear in movie mode when faced with bright reflections or sun. Not as bad in earlier L's, these don't appear in final still images, but are seen in movies. You then have to remember not to shoot movies outside of evenly lit scenes. My older Coolpix cameras didn't have this problem. The movie quality is pretty good, but a bit down from my movies using my L5. Shooting movies of a train, the bells and horns are much clearer sounding than the earlier models.Despite what the ads say, I can find no VR feature on this model, and nothing about it in the manual. Unless it is enabled all the time, which it seems to be not, you may wish to wait till this excellent feature becomes standard on all models. For more serious photographers, VR is included on the higher end, new L's.Also, I see nothing about ISO capability to 800, but I haven't yet tried night or low light scenes. One telephoto came out blurred, with no blur warning, there.All in all, this is fantastic technology, all at a highly affordable price, and although Nikon isn't the top rated brand as it used to be, I'd get this as a first, around-the-home and back-up, digital camera, if you haven't owned a good one yet.", "Date": "April 1, 2007"}, {"Title": "Nice, Cheap and Small", "Author": "Jesse F. Ferrell \"Meteorologist\"", "ReviewID": "R3CAHQLOOVJ0ZO", "Overall": "4.0", "Content": "I bought this camera for my daughter and was pretty impressed. It is easy to use, takes great pictures, has a lot of options, and is very small (pocket-sized). In fact it was kind of depressing because I paid $250 for a 5MP this time last year.You will need a memory card for this camera. The internal memory only holds 3 pics at the highest res. 1 GB which will hold 400 pics.The only thing I would warn you about is: If you try to use a used memory card, you will need to format it with the camera though the menu, or with Windows, befor you use it. I tried to use one from my old camera and the transfer software wouldn't work on two different computers, it kept saying \"Enumerating\" and never read the pics. After formatting the card, it was fine. Also, this camera claims to support only specific SD cards from SanDisk, Panasonic and Toshiba, which is weird because I thought SD was a standard. See page 102 of the manual.", "Date": "April 14, 2007"}, {"Title": "Good Little Camera", "Author": "T. A. Busch \"VigaGlum\"", "ReviewID": "R1LKUEF2S17HG3", "Overall": "5.0", "Content": "This small Nikon easily fits in your pocket.  The large screen makes it easier to take pictures that aren't on a tilt (a problem I had with my Pentax). The photos are well-defined, with true color.  I have had this camera less than a month, so I don't know how durable it will be.  So far, so good.", "Date": "May 13, 2007"}, {"Title": "Love my Nikon Coolpix L10", "Author": "Renee", "ReviewID": "R3RGYTPM49ZHWY", "Overall": "5.0", "Content": "I am extremely happy with the performance of this camera.  It is light-weight, compact, easy to use, and takes great photos.  A great value for the price.  Nikon makes a great product, and this one lives up to the name.", "Date": "May 24, 2007"}, {"Title": "Nice little camera.", "Author": "Yankee2NY", "ReviewID": "R19XSHGLNF9K8P", "Overall": "5.0", "Content": "I bought this sweet little thing because I am planning a day in NYC and don't want to bring along my regular camera, which is bulky. This camera is nice and small and would fit in any purse or coat pocket. It has 5 MP and a 3X optical zoom which is great for the price. The pictures I took outside turned out outstanding. Inside pics were a bit pixelated, but I may have had the settings wrong. The camera is easy to use right out of the box.Perfect for a second camera to keep on you just in case.", "Date": "March 22, 2007"}, {"Title": "Not as impressed as I would have hoped.", "Author": "A. Yung", "ReviewID": "REQO5BZCH5WNQ", "Overall": "2.0", "Content": "This camera has only been so-so, for me.  I purchased it to replace a Nikon Coolpix 3.2 that has served fantastically well for the last 2.5 years.  The 3.2 finally died, after much use and abuse.  So, partially based upon the reviews here, I thought the L10 would be an acceptable replacement.It takes decent pictures outdoors, but I'm pretty disappointed with the indoor photos I've taken this past month.  Frequently, pictures come out overexposed when using the flash, and adjusting the white balance hasn't helped too much.  Taking photos with no flash leads to often blurry pictures (albeit with decent white balance).  Hence, this camera is pretty poor for indoor photos.The other complaint I have is with the macro feature.  It's useless, unlike in my previous Nikon.  So I find myself standing back, and using the zoom feature, instead.I'm pleasantly surprised that not having a viewfinder (just the LCD screen) hasn't been a big deal, even when outdoors.Of course, I paid only about $100 for this camera, so whaddya expect?  I wouldn't buy it again, though.", "Date": "July 25, 2007"}, {"Title": "Nice pictures point and shot, no trouble", "Author": "Paulo Ferreira", "ReviewID": "R3457MDNUJNZ0L", "Overall": "4.0", "Content": "I have no trouble with it. Nice and sharp Pictures, fast. Be carefull at night when the light recharge, the recharge time is 4-5 seconds long.", "Date": "May 21, 2007"}, {"Title": "Great little camera", "Author": "F. C. May \"priceofone\"", "ReviewID": "R1P0QRGP52ASHC", "Overall": "4.0", "Content": "I have had two Nikon Coolpix 995 Cameras and hated them both.  I also have a Canon Rebel XT which is a great camera for more \"intended\" use.  But the Canon was too large to tote with me on my last trip to Asia, so, on the advice of a friend, I decided I would pick up a small digital camera in Sinapore for \"pennies on the dollar\".  So, knowing nothing about prices of recreational digital cameras, I picked up this camera for 220 USD and, at the time, felt pretty good about it (again, the same friend suggested that 220 was a good buy).  This place was supposed to be the electronic dumping grounds from Chinese production lines but I paid double what Amazon has it for.  I love the camera because it reliably takes good pictures with little effort inside and out and slips inconspicuously into my pocket when not in use.  I would strongly recommend buying this product from Amazon or one of its syblings such as the L11 . . .", "Date": "March 25, 2007"}, {"Title": "Love it!", "Author": "CristyMarie's", "ReviewID": "R1FJAUEORE84QS", "Overall": "5.0", "Content": "I absolutely love my camera!  It took me a while to go digital and I wish I hadn't waited so long.  I got a great deal on this camera and I bought the memory card and replacement plan that were suggested with this camera and I'm pleased with everything.", "Date": "May 19, 2007"}, {"Title": "A great camera", "Author": "Chun", "ReviewID": "R12CVLS7IICBJL", "Overall": "4.0", "Content": "This camera is compact, light, and it fits in my pocket. I use it for work and personal pleasure. I like the fact that it uses AA batteries. For the price, I could give it a 5 star but the battery life seems a bit short. I could only get around 70 shots with 2x Energizer 2500mAh batteries. I also think it takes a bit too long to start (about 4 or 5 seconds). The LCD is sharp and clear. It's a very good camera at this price range.", "Date": "July 4, 2007"}, {"Title": "Good, but a little outdated", "Author": "RLSd", "ReviewID": "RQBYLSW706OP2", "Overall": "3.0", "Content": "I bought the Nikon Coolpix L10 as my first digital compact P&S; camera. I read quite a few reviews and settled on this camera. I had it for a couple of weeks, until mine had a 'lens error' that basically made the camera inoperable (it was stuck open). It might've been due to batteries running low, but I tried another set (which I now think was also low). But it would've been nice if the camera gave a hint that there wasn't enough battery charge left to extend or retract the lens instead of a generic 'lens error' msg. The LCD turned on enough to display the error msg, and then shuts off after about 7 seconds.I took close to 150 pictures with the original AA batteries that came with it. I returned the camera and decided to upgrade to a more advanced Kodak Z712 IS (7 MP 12x optical zoom & image stabilization) because I wanted to do more than just vacation snapshots once in a while. The picture quality from the L10 was very good, a bit of barrel distortion was noticed in the wide angle and shooting tall skyscrapers (noticed by the curve along the side of the frame where the buildings are supposed to be straight).Another gripe I had with the camera was how slow the auto-focus was. It would basically go through the whole range of focus every time I pressed the shutter half-way and then some. Also because it lacks a AF assit lamp, it failed to focus in dim lighting. This became more annoying the more I used it.The camera tended to keep the ISO low in the auto mode. Which meant to get enough exposure, the shutter speed had to slow down, which meant in most hand-held shots, one has to have very steady hands or the result will be blurred images. Now that I think about it, I probably would've preferred more aggressive ISO bumping because in low light situations, I'd rather get a clearer, noisy high ISO picture, instead of a low noise but blurred picture. Eventually a lot of my pictures came out blurry, including outdoor overcast days with 3x optical zoom. Basically anytime there's zoom & less than ideal lighting, I would have to have rock steady hands to get non-blurry pictures.Overall it's a good camera if you can overlook the issues I mentioned.", "Date": "November 7, 2007"}, {"Title": "BEWARE OF WHICH MEMORY CARD YOU ORDER !!", "Author": "Manuel R. Suarez", "ReviewID": "R2QY5XYC0PL34X", "Overall": "3.0", "Content": "I ordered this item from Amazon a few days ago and have just received it. At the time I ordered, there was an offer of a 1 GB SD memory card advertised with the camera so I bought it too.HOWEVER... the card turns out to be a \"Kingston\" technology brand NOT TESTED AND NOT APPROVED BY NIKON according to the literature that came with the camera (just checked it). NIKON only approves SanDisk, Toshiba and Panasonic.I find it a bit questionable or maybe misleading on the part of Amazon to advertise this card together with the camera knowing that Nikon has not tested and approved this brand. At least a warning to this effect should have been given to the potential buyer.It may be argued that SD cards of different brands all work and all are of similar techonology. However, the customer may prefer to use what the OEM recommends and approves. More so in view of the warning that Nikon indicates in the literature that about the use of 'not approved items\" possibly voiding the guarantee.", "Date": "May 12, 2007"}, {"Title": "For an amateur (like me) GREAT", "Author": "Hpwolfe \"HPWolfe\"", "ReviewID": "R10ZZV0LGEVADO", "Overall": "5.0", "Content": "I bought the L10 in Panama several weeks ago.  My old camera was stolen earlier, and cameras are very expensive in Costa Rica where I live now.  I paid $100.00 which was a little above the Amazon price.I slapped a 2 gig memory card in it and started taking pictures.  I never read the instructions or fooled around with the settings.  (The salesperson set it on automatic for me.)I have a USB card reader for my computer and downloading the pictures is a snap.Since then I lent it to my housekeeper for a child's  birthday party.  She took pictures with it and she let the little kids take pictures.Bottom line--there haven't been any bad pictures yet from an amateur's viewpoint.  I know that it is not adequate for professions, but if my kind use is the kind of use you make of a camera--I highly recommend it.  And my star rating is for this kind of use.", "Date": "September 18, 2008"}, {"Title": "Made a very nice gift, but plan to buy memory, too.", "Author": "Shanna", "ReviewID": "R2104S6WVUY0ZR", "Overall": "4.0", "Content": "Between the price and what you get, this made a very nice gift for my boyfriend. The downsides: It's not the most user-friendly camera; you'll probably need to sit down with the manual before shooting much. It also only comes with internal memory, so you get about seven shots out of the box. You'll have to buy memory to get any more.", "Date": "November 27, 2007"}, {"Title": "Excellent for the money", "Author": "Jeffrey A. Whiting \"JeffW\"", "ReviewID": "R1ON18AEYL3SX", "Overall": "5.0", "Content": "Outstanding value for the money.  Good quality pictures for the casual user.  Be sure to get a memory card with it though, as the on-board memory is a bit small, especially if you tend to take high resolution pictures.", "Date": "August 31, 2007"}, {"Title": "Good as expected", "Author": "R. Sanchez Bosque", "ReviewID": "R2ELB52TZ71O68", "Overall": "5.0", "Content": "Great quality, nice camera, compact, sharp images and easy to use. Useful features compared with a good price. I can say it is a good cost-benefit product.", "Date": "August 30, 2007"}, {"Title": "Good Value", "Author": "Astra", "ReviewID": "R20R0RROEGJ5XH", "Overall": "4.0", "Content": "Takes good and clear pictures. However, it needs a memory card for anything more than 6 pictures.", "Date": "June 17, 2007"}, {"Title": "Nice simple camera", "Author": "WVLibrarydude", "ReviewID": "R34EDYTT9SARJ4", "Overall": "4.0", "Content": "Bought this for Christmas and have been very pleased since.  Simple functionality for taking pictures.  Takes clear decent pictures with very few shaky images.  The best part is the low usage on batteries (use rechargable).  Had a Panasonic that sucked batteries dry before.  In the end, this camera is perfect for quick picts.", "Date": "August 2, 2008"}, {"Title": "Impressed with the pictures, dissapointed with the video quality", "Author": "Eric Montero \"E.Mont\"", "ReviewID": "R31LA7WWEERS5D", "Overall": "4.0", "Content": "This camera is a very good option for newbies or for people who going to buy their first digital camera with a low budget.  Excellent pictures, super strong flash that iluminates everything.  Im very dissapointed with the AVI video quality with I was specting better.  But for the price of the camera, cant be better than it is.I love the autofocus, this is a very intelligent function in this camera because you can take better quality pictures.Other negative thing is that when to take pictures without flash, the 75% of the pictures you take , will came blur.If you need buy a cheap camera that takes high quality pictures, do not hesitate to buy it.  But do not use it to record videos, you will get dissapointed like me.", "Date": "July 9, 2008"}, {"Title": "easy to use", "Author": "Albert L. Trujillo", "ReviewID": "R3V5KCIGUNW2B0", "Overall": "5.0", "Content": "Great little camera. takes great pics and easy to use for my mother who doesn't like to deal with complicated machines. Gave her some basic instructions and she was off and shooting.", "Date": "May 30, 2008"}, {"Title": "One of the best cameras you can get for $100", "Author": "Andrew M Griffin", "ReviewID": "R3A3NMK4PISO0K", "Overall": "5.0", "Content": "Works as described -- takes pretty good pictures, the red eye reduction when manually enabled works wonderful -- but I always had red eye if I left it on auto. Easy to work, never had to touch the manual, everything is pretty self explanatory.  Nikon is a great company, either go with a Nikon or a Canon... but canon cameras for same quality were all much more expensive.", "Date": "April 22, 2008"}, {"Title": "Not bad for the price", "Author": "Ken Baudoin", "ReviewID": "R3V3T507M9A18N", "Overall": "4.0", "Content": "I was looking for a small point and shoot camera that wouldn't break the budget and the L10 fills the bill nicely. My only complaints are the lack of an optical view finder and the fact that videos are in mov format. I use MS Movie Maker so all videos have to be converted to be usable. It's also a little complex to be considered a true point and shoot but it's still a pretty nice little camera.", "Date": "January 24, 2008"}, {"Title": "Nikon Point and Shoot Camera", "Author": "Batang Tondosky \"Bata\"", "ReviewID": "R2KX1JIBJ7JCJJ", "Overall": "5.0", "Content": "I got this product as an upgrade from my Nikon Coolpix 3200. More resolution and more features for the money. Digital cameras upgrade quickly so I expect to upgrade every 2 years. One thing that impressed me was the additional \"face-priority\" setting. Very useful when taking pictures outdoors when the sun is too bright and there is shadow on the face of my subject. The camera does an automatic fill-flash which brings out the most important part of the subject, the face and the eyes.For my purpose this camera does the job. It's handy, it's affordable and the pictures are stunning. I can get another point and shoot digital camera but I stick to Nikon because of the lens. The Nikon color rendition is amazing compared to other brands. I print copies using Kodak paper at my local CVS pharmacy and the result is outstanding.  Happy with purchase.", "Date": "October 9, 2007"}, {"Title": "Great Camera!!", "Author": "Martin Afnaim \"dracules\"", "ReviewID": "R3KJ9VAE7R3U12", "Overall": "5.0", "Content": "This is a great camera. It has all you need.The only thing I didn't like it was that it records video in mov format. But that's personal... In general, a great, compact and smart camera!", "Date": "August 29, 2007"}, {"Title": "Great low-end point-and-shoot", "Author": "David Hazlehurst \"dbh\"", "ReviewID": "R2AWQRP3EGW0BD", "Overall": "4.0", "Content": "This camera is nothing special...just a regular, low-end point and shooter.  But it only cost $106 when I got it, and for that price, it's excellent.  There are no problems with the picture.  It takes photos just as well as any of the more expensive small/slim cameras (i.e. the ones with the small lenses).  The software runs a bit slow, though, and the camera takes a few seconds to reload after each shot.Also, it runs on AA bateries, which is kind of weird.  I'm not used to keeping extra batteries around in case the first set runs low while I'm out.  But that's a minor complaint.The bottom line is, for the price, it's a great camera.", "Date": "August 3, 2007"}, {"Title": "Nikon - Coolpix camera", "Author": "Kimberly Gates", "ReviewID": "R3IXUYG2OFT282", "Overall": "5.0", "Content": "Great camera, great pictures - uses alot of batteries.  I recommend getting rechargeable batteries.  Daughter loves the video options, especially since sound is included.", "Date": "July 3, 2007"}, {"Title": "Easy to use, great pics, nice video feature", "Author": "SB", "ReviewID": "R2FV89UDGZPD26", "Overall": "4.0", "Content": "Just got this camera and so far am quite happy with it. It has sound with the video which is a great feature for a budget camera. Pretty easy to use, fairly intuitive and nice small size.", "Date": "May 12, 2007"}, {"Title": "Best value for a point and shoot camera", "Author": "Albert Chen", "ReviewID": "RY71VS23W1RS0", "Overall": "5.0", "Content": "For anyone looking for a point and shoot camera - this is it. BUY IT.", "Date": "May 12, 2007"}, {"Title": "Awesome little Camera", "Author": "rockrancher", "ReviewID": "R2JNGK3C07C2PJ", "Overall": "5.0", "Content": "I have owned this camera for at least 4 years. I take it on hunting trips as well as snowmobile excursions, so it does take a beating. I did invest in a nice padded case for it, which you are a fool not to, and it will still easily fit in my shirt pocket. I have literally taken thousands of pictures and for the most part they are great. No, this will not produce the quality of my SLR, but it is also a fraction of the price. If you expect it to have that kind of quality, you will find things to pick about. I have had a couple instances where the pictures were blurry in low light, and the speed at which it takes a picture is rather slow, but there again for a camera that is in the $100 range (I bought mine at Walmart for $109 when they first hit the market) it does a great job! this is a great camera for the novice picture taker who wants good pictures and no having to make adjustments to do it.The most outstanding feature in my opinion is the fact that this thing takes two AA batteries and the battery life is fantastic. If you are on vacation or out in the woods and the batteries go dead, just slap in two more and you are back snapping away! No having to worry about finding an outlet to recharge or waiting the few hours to get it recharged. This is probably the best feature of the whole camera as far as I am concerned. My experience has been great, and I would recommend it highly.", "Date": "February 10, 2013"}, {"Title": "COOLPIX is a \"practical\" camera", "Author": "Steve", "ReviewID": "R3S8ZN0EDY0HOJ", "Overall": "5.0", "Content": "Any COOLPIX camera is good, including this one. I always replace a broken camera with a newer version. Simple to use, and small enough for your pocket. Great for sight-seeing, and daily life.", "Date": "January 24, 2013"}, {"Title": "Wonderful camera", "Author": "Kristin", "ReviewID": "RISAZM6JI05NF", "Overall": "4.0", "Content": "I bought this camera like 5-6 years ago. The only problem I had was for about 6 months the camera screen did not want to work and it would shut off even with new batteries in it. I decided I was going to put new batteries in it a couple days ago and it started working again. I was so happy. This camera has been through everything, I have dropped it several times, my kids have dropped it and everything. Nothing has broken on my camera even with all this abuse. I would recommend this camera to someone who has kids who want to capture their kids playing or anything else. With a 2GB SD card on TV setting (which takes pretty good pictures for being the lowest quality) I get over 10000 pictures. Definitely a camera to take to any vacation to capture your fun moments. I would just suggest taking better care of it.", "Date": "April 19, 2012"}, {"Title": "Great camera for the price!!!", "Author": "N.preen", "ReviewID": "R2NKD9Q7BK3MB3", "Overall": "5.0", "Content": "5*****Great cameravery portable and smallI've had it for about 2 or 3 years now and i am amazed with the quality of it for such a small/cheap camera.I use it to film airsoft and atv events while holding the gun or throttle in the other hand and I've dropped it many times and still works perfectly.runs on 2 AA batteries and can record video and take pictures in pretty good quality.I definitely recommend it!-if you want to see this camera's quality.-[...]", "Date": "December 18, 2009"}, {"Title": "DON'T BUY COOLPIX L10", "Author": "V. FEIJOO", "ReviewID": "R1USZXJVJ0ENKO", "Overall": "1.0", "Content": "I bought this camera seven months ago. I paid like $100 for it. I did not use it that much but the shuter button broke. I sent it to Nikon for repair. They sent me the bill for $105.59. I called Nikon and they told me to send by fax receipt so that they can honor warranty. I'm still waiting for answer.", "Date": "October 20, 2008"}, {"Title": "For the price, best camera around", "Author": "B. Warhola", "ReviewID": "R3NWQQH8Y4WN5", "Overall": "4.0", "Content": "I am very happy with the camera. I paid $101 for the money, I couldn't be happier.  Sometimes it takes blurry pictures but that could be from me moving my hand but other than that I'm very happy.  I think this camera is great for the person who doesn't like to mess with a lot of buttons.", "Date": "October 4, 2007"}, {"Title": "Poor Poor Quality", "Author": "N. Nizami \"Techie\"", "ReviewID": "R1M16TFJ89BVG7", "Overall": "2.0", "Content": "I am returning this camera. The picture quality is poor. Left side of the pictures are always dark. Initially I thought that the issue was with the amera screen. However, moving the pictures to computer did not help. The darkness was stil there. It is quite possible that I have a defecteed unit. But after reading the reviews and my own experience, I have decided to look into other cameras.", "Date": "August 25, 2007"}, {"Title": "Not a very great camera.", "Author": "kssood", "ReviewID": "R108VXN6P88MB0", "Overall": "2.0", "Content": "Don't expect that you are going to get great picture quality for this price. The photos doesn't look bright enough in the LCD. camera menu's are OK to use. If you are looking for really good camera, consider buying Canon SD series..", "Date": "August 23, 2007"}, {"Title": "nikon camera", "Author": "jilljgr1 \"jilljgr1\"", "ReviewID": "R24A62ISYDL7R3", "Overall": "4.0", "Content": "We purchased this camera & it was working fine for what we needed.  However, after about 2 1/2 - 3 wks we started having problems with it.  We sent it back & received a new one.  It's been about a week & seems to working fine.  The pics are good for what we purchased it for.  I really like it!", "Date": "July 21, 2007"}, {"Title": "worth of what u pay", "Author": "Hamed", "ReviewID": "RGHPN7ZN6ZL94", "Overall": "5.0", "Content": "I just bought this camera and so far it works perfect. Quality of photos is also acceptable and fair enough comparing to my investment.", "Date": "June 26, 2007"}, {"Title": "Little piece of crap", "Author": "ERP", "ReviewID": "RVTCN1VFXDFY6", "Overall": "1.0", "Content": "After carefully checking every reviewed camera on amazon we decided to purchase a pink one for my daughter last christmas.  She was trully happy, good quality image, blah, blah, blahAfter a month of use the LCD screen went black and since my kid had lost the receipt nothing could be done but I agree... what about their quality?An almos 5 star product should not be allowed such crappy behavior.Now she has no camera.:(", "Date": "November 27, 2008"}, {"Title": "Batteries drain even when turned OFF", "Author": "Brian S. Walker", "ReviewID": "R3H67M8ZQ2HH76", "Overall": "2.0", "Content": "Decent performance, size and price.  But if you use it only occasionally then every time you pick it up the batteries will be dead/low.  Scene mode seems very susceptible, it always thinks the batteries are low after 20 shots or a week of being off.  Been through 10 sets of batteries of all different brands, and the battery type is set correctly in setup.  Would avoid, other cameras seem to have same problem so research carefully.Update: Using the Eneloop brand of rechargeable battery (and using setup to signify so) solved the battery issue.  We now get hundreds of shots on a single charge, even when using the flash.  Camera seems to have an issue only with Alkaline batteries.", "Date": "November 27, 2008"}, {"Title": "Nikon Coolpix L10 5MP Digital Camera", "Author": "Melvin S. Firth \"MSF\"", "ReviewID": "R1TVCMZGZ39S2N", "Overall": "5.0", "Content": "My wife and I purchased this camera for our Grandson's 10th Birthday. This is his first camera and we are teaching him how to take pictures, edit them, store them, and how to respect, protect,  and how to be responsible.", "Date": "November 5, 2007"}, {"Title": "Awesome camera 4 the price", "Author": "A. Jones \"LV Prince\"", "ReviewID": "R6D8HYVJ2N0VS", "Overall": "4.0", "Content": "Camera is great....i love it. Its a lil slow on the saving of pixs but other then that its great.", "Date": "August 23, 2007"}, {"Title": "Camera", "Author": "Bing Jiang", "ReviewID": "RC62VYPA168PG", "Overall": "4.0", "Content": "I like it but I don't know its battery is AA. But it's not too bad. And the shipping is good.", "Date": "August 3, 2007"}, {"Title": "Price is right", "Author": "Earl", "ReviewID": "R1YV6SSFTIAL2N", "Overall": "5.0", "Content": "Shipped and received in a timely manner.  Appears to be an excellent choice for a amateur, such as myself,", "Date": "July 12, 2007"}, {"Title": "Nieces birthday present", "Author": "David K. Tragle", "ReviewID": "R3GRGJ42G5PC30", "Overall": "5.0", "Content": "My niece was ecstatic when she saw that she had received this camera for her birthday present.", "Date": "October 30, 2007"}, {"Title": "Nikon Coolpix L10 5MP", "Author": "Abhinab B. Basnyat", "ReviewID": "R3567KAIDFKLW4", "Overall": "5.0", "Content": "Shipped on time and the item is a great buy for the price.", "Date": "May 23, 2007"}, {"Title": "poor quality", "Author": "hundredrabh \"whacky\"", "ReviewID": "R2NTTNNS3KUQ82", "Overall": "3.0", "Content": "Although the camera is small and light. Easy to use. But it has a poor quality finish to it. The battery cover looks as though it is made of low grade plastic. Picture quality is OK, nothing great, but what else do you expect from a camera $100 or so.In all not happy with the purchase", "Date": "June 29, 2007"}, {"Title": "Problems with the Nikon L10 which I ordered", "Author": "Richard A. Kinz", "ReviewID": "RS178RYA533L4", "Overall": "1.0", "Content": "I ordered this camera [my first digital] in late April and received it via Amazon from DB Roth on Monday, May 5th.  Although the box printing was in English, the instruction manual was in Spanish, all 100+ pages of it.  I contacted Roth and they gave me the link to a website from which I could download a pdf file of the instructions - 135 pages of it.  I tried several times but it froze up each time.  Finally Roth said they'd send me the manual, which I received today - a CD disk.  When I loaded it in - all 135 pages - it was encrypted and couldn't be printed or copied.  So I'm waiting to see what Roth will do now. I had contacted Amazon several days ago and they said it wasn't their problem it was Roth's.  So much for help from Amazon.  I think on Monday, if Roth doesn't send me another order and I return what I have, I'll contact my VISA account and ask for a total refund.  I'd tried to contact Nikon,but that was a total excersize in futility.  I think I'll stay away from Nikon and Amazon in the future.  Meanwhile, the camera sits in the box unused.", "Date": "May 16, 2008"}, {"Title": "Sucks.", "Author": "trisdawg", "ReviewID": "R5HJXN34IO4RF", "Overall": "2.0", "Content": "Poor image quality regardless of price, especially indoors.  Sent it back.  Even the samsungs have better image quality.  For a good budget cam, go for a samsung, kodak, or low end canon.", "Date": "June 13, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.1-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n3x optical zoom; 2.0-inch Super Bright LCD display\nFace Priority AF automatically focuses on the face of your subject\nD-Lighting improves brightness and detail where needed\nPowered by 2 AA-size batteries; stores images on SD memory cards", "Name": "Nikon Coolpix L10 5MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51IY4l40axL._SX300_.jpg", "ProductID": "B000N49WPC"}}