{"Reviews": [{"Title": "Absolutely Horrible Camera!", "Author": "John", "ReviewID": "R2LIASCVYASU87", "Overall": "1.0", "Content": "I bought this from Dell thinking I was getting a bargain at $150. I had originally planned to replace my Olympus c-3000 (3.3MP) but it seems that the photos taken by the Dimage can't even match the quality of those taken by the Olympus. As the other user noted, the low light capability of this camera is dreadfully bad. The flash seems to have a timing issue where it flashes too early; before the camera is able to capture the shot. Resulting with a picture that looks like it was taken without the flash. To make things worse, the camera is unable to focus correctly when there isn't enough light, resulting in extremely blurry shots. To summarize: the flash is useless and the pictures are blurry and also useless. The only time this camera takes any good picture is when there is enough light (outdoors in the sun). Even so, its 5 MP pictures are mediocre at best. I've used 2.1 MP cameras that take better pictures. I wish I had returned it for a refund or a different camera, but I made the mistake of giving it the benefit of the doubt. I kept telling myself \"it must be the settings... it can't possibly be this bad\". So I spent a couple of months experimenting with different settings, trying to produce a decent shot in low light condition. By low light I'm talking outside; noon time; underneath some trees. It's ridiculous that it can't even produce a decent shot under those conditions. I've come to the conclusion that either a) this camera is a piece of crap or b) I got a defective camera. The worst part is trying to find any useful reviews on this camera on the internet. There aren't any! The two previous reviews by the other users here are the only ones I've seen. I guess I'm going to have to ebay this thing. I'm taking my time to write a review so that you don't make the same mistake I did. Hope it helps!", "Date": "August 24, 2005"}, {"Title": "Not Anywhere Near as Bad as You Might Think", "Author": "Lawrence Wilson \"Cubdukat\"", "ReviewID": "RA86BQI7MV0CK", "Overall": "4.0", "Content": "Even though the previous reviewer is right about the LCD screen's graininess and the battery problems, my own experiences with its picture quality have been quite different. I recently took it on a two-week vacation to Chicago, over the course of which I shot around 300 pix, and it performed better than I could have hoped for a camera not even made by Minolta (the camera is actually a re-bodied Pentax Optio50).My main beef with it, though, is that it has the worst low-light focusing performance of any camera I've worked with, digital or film. If I had my druthers, this would have at least some kind of focus assist.True, its images are not as sharp as, say, a Nikon or some of the Zeiss-equipped Sony cams will give you, but it's still highly usable, and I would highly recommend it to anyone looking to step up to 5MP on the cheap.", "Date": "August 23, 2005"}, {"Title": "You get what you pay for..", "Author": "warren4200", "ReviewID": "R261I2P1YTA7C4", "Overall": "3.0", "Content": "I wanted to chime in about this camera.  I bought mine back in July and have had some of the problems mentioned here, namely the short battery life and the blurry pictures.I dont really understand what happened with the camera the first time I put the batteries in, but as mentioned here, they only lasted about 10 pictures, it was absurd.  I think the batteries were bad, because once I put my rechargable ones in, the performance has been average.  It does take more juice the higher quality pictures you take. I usually leave it at 4 mega-pixs. The latch on the battery is not the best as well, but it works fine if you make sure that it is closed correctly.The blurry pictures were only a problem when I was trying to take closeups without a tripod for ebay items.  Honestly, I dont know if this is normal or not, because I had never done such a thing before.Bottom line, this camera is adequate, but I think you are better off with a sony or canon.  Sadly, I thought this cam would be as good at the first Dimage, but it isnt.", "Date": "November 3, 2005"}, {"Title": "returned it", "Author": "M. Thompson \"Poyzin\"", "ReviewID": "R2GPEZDDM4W6IK", "Overall": "1.0", "Content": "I had this camera for approx. 25 days before I gave up on it.  The worst problem was the inability to focus when lighting was the slightest bit dim.  I stubbornly refused to believe this camera was so bad thinking I was doing something wrong.  Thank goodness for Amazon's return policy.  Now I have a Canon A610 and absolutely love it.", "Date": "October 28, 2005"}, {"Title": "Real bad first experience", "Author": "John C. Elsenheimer", "ReviewID": "R2M7G1PB8C2LAL", "Overall": "1.0", "Content": "I chose this camera as a reward for 25 years with my company. ARGH, I've all kinds of trouble with the battery and power indicator. The first batteries lasted about 5 shots. The ones that came with the camera lasted longer. About the 3rd shot with the original batteries the camera battery light was flashing red. I flipped the battery door open ripped the batteries out, put them back in and it said 2/3 strength again. Last night I had 2/3 of a battery, tried to take a shot and it just died. The screen went black, the lense was still extended and that was it. I've gone through about 4 sets of batteries in 45 shots. I used to shoot with an SLR and know what I'm doing but I can't seem to get a clear picture even holding extremely steady. This was my first digital and I'm looking to replace it soon. I've already spent $100 on a SD card and AC adapter for this thing too.Picture quality - YUK.Battery life - a joke.", "Date": "December 26, 2005"}, {"Title": "I am disapointed", "Author": "Geoffrey H. Boutros", "ReviewID": "R3RTS6HTCQLNO3", "Overall": "1.0", "Content": "Three years ago I bought a refurbished Minolta Dimage F100 camera.  It was a 4MP caera that in my opinion was the best.  Funny thing is that I never used it in 4MP and took all my pictures in 3MP.  After 2 years of ROUGH usage by my son, my wife and I, it got stolen.  I wanted another camera that was as good, and with my previous experience with a Minolta, I decided to buy a new Minolta camera that fit all my requirements: sd memory, aa batteries, Minolta, at least 5 MP.  I bought this piece of ____.At first it was great.  Then it got bad, just like everyone else reviewing, blurry pictures, grainy pictures, battery drainage, etc...After playing around with it, I did find fixes for the problems.  The blurry image comes from a very slow shutter speed in auto mode.  Toddlers will not freese for you to take their pictures. I needed to take pictures of my kids in action.  I no longer use auto.  I set it to active.  I set the ISO manually to 200 to fix the blurriness.  I lowered the color saturation to medium to help with the grainy pictures.  As for battery drainage, I had previously bought a bunch of rechargeable batteries that I keep in my camera bag.All those fixes make the camera usable again.  But the best solution to the problems I will do in a month or so.  I will buy a Canon A620.  It may be bigger, but my wife will stop complaining that she hates the camera.", "Date": "July 18, 2006"}, {"Title": "DON'T BUY THIS CAMERA - NIGHTMARE", "Author": "G.L. \"Gillian\"", "ReviewID": "R2J7NA4JELGM9H", "Overall": "1.0", "Content": "I bought this camera this past December for my birthday at $199.  It seemed great at first - takes beautiful pictures, very small, etc etc.I just returned from a vacation in which the camera completely stopped working.Because Konica is no longer making cameras I've had the hassle of going through an outsourced company to get this problem resolved, because I'm still under warranty.The outsourced company has been very helpful, and told me that this camera was NOT made by Konica but another company, and Konica bought thousands of them, and once many of them broke, Konica could not afford to pay for all the repairs.I was told that this camera single-handedly brought down Konica Minolta.If you already have this camera and it works, then great... but for people wanting to BUY it, I wouldn't recommend it... if it breaks you will go through a nightmare to fix or replace it.Konica was incredibly rude to me and denied any responsibility for a product they made.My situation is finally being resolved by Sony giving me a replacement camera because they now own Konica, but it really wasn't worth the hassle.Before the camera broke i'd have given it 4 stars, but after dealing with the situation, I have to give it 1 star.", "Date": "June 27, 2006"}, {"Title": "Excellent Budget Buy", "Author": "TaLi \"Gadgetman!\"", "ReviewID": "RSXAPHIXIMJUW", "Overall": "4.0", "Content": "I wanted a cheap and good camera that has the abilities to shoot photos and do a good job at shooting short videos. The battery cage is a but fiddly. They just don't tell you that regular batteries don't do the trick. Consider going to Radio Shack and buying a 4AA battery charger. I can shoot up to 40 pictures with 2AA rechargeable batteries. Walgreen's Ultra Alkaline SuperCell also work best when in a pinch!The best part about it is that fact that it is almost pocketable and so easy to use with the jog dial that allows you 5 picture settings. Yes, the viewfinder is grainy but at that price what do you expect? Good zoom, good memory economy choices, decent battery life, and a quick wake up time. It is also easy to upload pictures and the protect feature helps against photo transfer loss.The only bad thing is it is too boxy and a bit ugly but it has a strong body and a sleek black velvet case included.", "Date": "January 7, 2006"}, {"Title": "Whatever You Do, Avoid This Steaming Pile Of Poo", "Author": "plainwhite \"plnwte@yahoo.com\"", "ReviewID": "R2TO3Q55B96XGB", "Overall": "1.0", "Content": "I just recieved this camera less than 24 hours ago and it has already bit the dust. After the batteries slowly died this morning, I replaced them and took a picture. About 5 seconds later the LCD display went black and the camera turned off. After several attempts at reviving it, I pronounced it dead and was looking forward to returning it for a better quality camera. I am hoping to get my money back and buy a Panasonic Lumix® Digital Camera since it seems to take great pictures and was given great reviews. As soon as the Minolta camera died I came to Amazon.com to look up reviews and I laughed as I saw the 1 star ratings and horror stories of other customers. At least im not alone. Whatever you do, do not buy this digital camera.", "Date": "December 25, 2005"}, {"Title": "Buying this camera was one of the biggest regrets of my life!!!!", "Author": "AMM", "ReviewID": "R3NV4J5ZXBNOP0", "Overall": "1.0", "Content": "I seriously HATE this camera with a passion!! I just wanted something cheap that took normal quality pics, but no, this camera takes BLURRY pics ALMOST EVERY SINGLE TIME, it's sooooo embaressing bringing this stupid camera with me to events and having EVERY picture be blurry. I almost cried last night at my cousins' wedding because I couldn't take even ONE picture to remember the event. I've had atleast 5 of my friends say \"I hate your camera.\" Well, I hate it too. I will die happy if I can sell it for $100. I bought it for $150 back in November and have barely been able to use it!", "Date": "July 2, 2006"}, {"Title": "mountainredneck", "Author": "A. Fleenor \"mountain redneck\"", "ReviewID": "R2FBKXJQ7G9O4X", "Overall": "4.0", "Content": "This camera was purchased for my wife to have with her all the time. She is a basic novice, and she has gotten very good pictures with this little piece of technology. She uses it as intended, and does'nt expect miracles. It has all of the functions that she needs, fits her hand to a tee, and drives me nuts printing pic's. For your spouse or children who want to enjoy digital photography and have fun doing it, this is a good way to go.", "Date": "May 17, 2006"}, {"Title": "bad battery, great pictures", "Author": "J&C;", "ReviewID": "R2ZRA2P5BD4VL8", "Overall": "4.0", "Content": "I had one of these before upgrading to a Canon PowerShot SD1000. I just recently went back and compared photos from the two and found the Minolta photos to be much more clear and crisp and with beautiful color saturation. I had the same issue with the short battery life and found that using regular alkaline batteries worked better. It seems the batteries drain even with the camera turned off. I verified this by removing the batteries after every use for a time, finding they lasted much longer by doing this. I don't recall indoor picture quality, but Canon isn't all that great indoors either. Besides the battery issue though, I couldn't believe how much better the Minolta photos were than my Canon's at half the price. Of course, the Canon is far superior in every other way and does take nice pictures.", "Date": "February 18, 2010"}, {"Title": "It works for me, even after hitting the highway at 55mph", "Author": "J. Fleischer \"Black Dog Kayaks\"", "ReviewID": "R131ABA7CXI11Z", "Overall": "4.0", "Content": "I bought this camera a few years ago but, after my recent experience with it, decided to write a review.I never had battery issues, as I started off right away with AA Nimh rechargeables.  I don't know why anyone would use anything but rechargeables nowdays.I've found the camera easy to use.  The only things I don't like are the macro feature is useless, there's no viewfinder, and the microphone for video is useless.Having said that, we were in Minneapolis after Easter and, while loading up the car, I put the camera on the roof so I could have hands free to put the bags in.  About two miles down the road, going 60mph, I heard something rattling on the roof.  The camera!  I started to slow down, and, in the rear view mirror, saw a silver flash as the camera flew off the roof.  More silver flashes as it hit the pavement and lay in the middle of the lane with cars whizzing over it.We turned off on a frontage road and went around, expecting the worst.  Fortunately, no one had run over it.  The batteries were gone, although we did find one in the ditch.  The SD card was halfway out and the zoom button was also missing.  I put fresh batteries in it, pushed the SD card back in, closed it up and turned it on...It still worked!  It still takes great pics, although I have to use a pin to push the zoom contacts in or out.This is one tough little camera.", "Date": "May 6, 2008"}, {"Title": "Needs lithium batteries", "Author": "AvgMom2", "ReviewID": "R32ZQ84OP4UNJE", "Overall": "3.0", "Content": "I deleted my earlier review of this camera where I gave it a 1 star because it won't power on whenever I changed the batteries.  After changing to lithium batteries, it was OK.  The camera itself is not bad.  It's easy to use (except in low light) and prints out beautiful pictures.  It's just very picky with batteries.  Since this camera is no longer being produced, you are on your own if you have problems.", "Date": "December 6, 2007"}, {"Title": "You Can Get a Better Camera for Less Money", "Author": "Cavale", "ReviewID": "R2S3H4ZB1YEY30", "Overall": "1.0", "Content": "I asked for a Konica Minolta DiMage G600 for Christmas two or three years ago, and I got this instead. I had specifically asked for the G600 due to it's manual exposure capabilities, which this camera lacks. The person who got it for me refused to give me the information I needed to return the camera. Luckily, someone less inept got me the correct camera for my birthday.This summer, however, that camera was stolen, and I was forced to use the e500. I got to rediscover all over again what a terrible gift it was. It boasts a Burst mode.. and that's about all I can say for it. In low light, the flash misfires, or the pictures come out extremely overexposed. It takes it a good 2 seconds AFTER you hit the shutter for it to actually capture an image.  The pictures are extremely low quality, regardless of whether you put it on the highest or lowest quality settings. It's a tiny plasticy little gadget, that feels like a toy in your hands, and apparently is just as fragile. And there's no viewfinder, so when the LCD screen broke after being left in a cold car over night, that was it for the camera.", "Date": "December 9, 2008"}, {"Title": "Try Something Else", "Author": "Sean Boyer", "ReviewID": "R186KI3Y9S9CX8", "Overall": "2.0", "Content": "This overall, is not a really great camera.  You can probably find a better value for your money elsewhere.  I just wanted something to take out to the bars and get pictures with my friends, and it was always a hassle getting it to actually take the picture.  No matter what setting (night was the worst), you need to hold the button down for 2-5 seconds before it flashes.  Everyone would end up breaking their smile by the time it took.  Also, not it's fault, but I didn't realize it took AA batteries; it wasn't a Lithium Ion battery.  If the camera was NOT EVEN ON, it would drain the batteries.  It would literally drain the batteries within a day if they were in the camera, no matter if it was on or off.  I did a workaround by placing one battery in the wrong way.  As you can imagine, going to the bars and constantly flipping one battery was not my ideal camera.", "Date": "July 30, 2008"}, {"Title": "E500 Battery Drain and inconsistent focus", "Author": "J. Pistana", "ReviewID": "R2F2FTIU1ARJJ2", "Overall": "1.0", "Content": "Do not buy this camera.  Battery drain is fast even with rechargables.  Regular AA batteries do not even work in mine.  New batteries will not even power it up.  I'm going to buy more of the most powerful rechargables and keep many nearby.  My wife hates camera, will not use.Many times it loses its focus ability.  You have to power down and back up again and cross fingers.  When it works, it takes good pictures, but frustration level is high.  Shutter lag is bad, you will miss the action.  Stay away.", "Date": "July 20, 2007"}, {"Title": "Great little camera!", "Author": "Teressa K. Shoreland", "ReviewID": "R141O0VEUYJJKZ", "Overall": "5.0", "Content": "I can't believe there are so many negative reviews about this camera.  I've had mine for three years, and I love it.", "Date": "August 19, 2009"}], "ProductInfo": {"Price": "$229.99", "Features": "5.0-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n2.0-inch LCD; 3x optical zoom\n12MB of internal memory\n5 Digital Subject Program modes; records movies in QVGA format\nStores images on SD memory cards; powered by AA-size batteries", "Name": "Konica Minolta Dimage E500 5MP Digital Camera 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41jtLWF68qL._SX300_.jpg", "ProductID": "B0009NDL0E"}}