{"Reviews": [{"Title": "One (or two) big flaws from perfection", "Author": "Joe W", "ReviewID": "R2KIPZMKGO0JQJ", "Overall": "3.0", "Content": "I bought the GE A730 because it has by far the best feature set of any camera in its class at an unbelievable price. It's pocket-sized, with image stabilization, manual controls, a useful 35-140mm lens (35mm equivalent), a one-thirds grid on the LCD to help with composition and keep horizons straight, and on and on. It also has the best user manual I've ever seen. When I got it home, however, I immediately discovered its Achilles heel. I could not use the LCD in full sunlight, even at its brightest setting, and the A730 does not have an optical viewfinder. Also, the LCD is so reflective that the reflection of your own image blurs the screen even further, even in less than full sunlight. Besides that, I found that the automatic focus tended to hunt in almost all lighting conditions--though, in fairness, that could be just a flaw in the particular camera I bought, or \"pilot error\" due to my lack of experience, and not a general flaw in all A730s. I returned the camera for a refund and called GE Customer Service. I had called them once before with questions about the camera and they were savvy, polite, patient, and eager to please. When I told the person who answered about the problems I had with the A730, I could hear him typing it into his computer. He thanked me, said GE's R&D; department wanted as much feedback as possible, whether good or bad, and said he was forwarding my remarks to them \"as we speak.\" Except for the LCD (and perhaps the hunting AF) the A730 is a landmark point-and-shoot with superb features, at an unbeatable price, supported by excellent customer service. Despite my disappointing experience, I'm not giving up on GE cameras. Almost all new products have \"bugs\" in them that have to be worked out. The company seems more than willing to correct flaws, and if it does, there won't be a camera in the A730's class that can touch it. I'll watch with great interest to see if GE follows through on the feedback, and am looking forward to the release of their E850, which has a 28-140mm equivalent lens, a bit more resolution and all the other fine features of the A730. I hope GE makes the necessary corrections. They are just \"this close\" to producing a camera, backed by a customer support system, that all others will be measured by.", "Date": "June 9, 2007"}, {"Title": "GREAT Camera!! Better than the Nikon L11", "Author": "DXTAC", "ReviewID": "R2Q38QBWKF16UX", "Overall": "4.0", "Content": "I have had this camera for about 2 weeks and I LOVE IT!! I previously had a Nikon L11 and returned it due to the known issue of it just freezing up when it wants. I purchased this camera as a replacement for the Nikon. The Pros:- It starts quickly- Takes GREAT pictures- It's small/lightweight- Has great features that many other cameras in its price range can't touch (Stabilization Mode for one)- It was priced about $60 - $70 less than comparable cameras (I bought mine for $99.00 - $60.00 less than the Nikon)- It turns heads (It's finished in shiny black and chrome)- It has a quicker regeneration time than the Nikon- It fits into my wife's purse or my pocket easily- It is 7MP as opposed to the Nikon's 6MP- It has a Continuous Shot option- Operates on 2 AA batteries- 26 MB of internal memoryThe Cons:- It's physically a little larger than the Nikon, but lighter- You can not turn off the Quick Review of your pics after you take a pic. Therefore the regeneration time is extended- No flash while in Stabilization Mode- LCD screen is a little difficult to see due to the shiny case that covers it. The Nikon won this battle as it was a matte finish and very easy to see in sunlight. A small price to pay for all the other features (hold your hand over the screen)- A sometimes pixelated image while zoomed in close. No effect on the picture taken though.If I could have given a 4.5, I would have. It is a great little camera and I can't wait to see what GE has in store for the future. A GREAT little camera from a company that make everything from Toasters to Jet Engines!!!", "Date": "September 10, 2007"}, {"Title": "Great camera", "Author": "Troy Kennedy", "ReviewID": "RAAYZHQC4TS5E", "Overall": "4.0", "Content": "I bought this camera to replace a $350 first generation SONY digital camera that I've had for over 5 years.  This camera works great.  Large LCD screen and easy to use controls are a plus.  The camera is very well put together - a quality product.  Syncs effortlessly with my Macbook and my PC.  Picture quality is very good.  A great camera for anyone looking for a digital camera at a reasonable price.", "Date": "June 11, 2007"}, {"Title": "Great general purpose camera!!", "Author": "Kirk Pollard \"Kaptain\"", "ReviewID": "RKY93D96OEJ70", "Overall": "5.0", "Content": "I bought two of these after comparing it to quite a few other brand/models in the similar price range. They both work great, there are even more features than I expected. It takes quality shots, loaded with a 2 GB card it holds more than 400 shots, WOW. No regrets here.", "Date": "October 15, 2007"}, {"Title": "GREAT at twice the price!", "Author": "Robert W. Finger \"Bob Finger \"professiona...", "ReviewID": "R1OUSYAG534FTD", "Overall": "5.0", "Content": "Yeeeowwsa! I love this camera. and for the very unbelievable price of under $100 it is a downright steal. I have had a lot of digital cameras over the years and this little wonder has so far outperformed many of them. Many features not found on cameras 3 times the price. I should buy another just to keep in the car...If you are considering buying it, go ahead and get one. It's cheaper than your electric bill and 10X the fun.", "Date": "March 28, 2008"}, {"Title": "Problem with horizontal lines across screen", "Author": "J. Butler", "ReviewID": "R2VDOQOOH9K7W2", "Overall": "1.0", "Content": "My 14 year old daughter was so excited to receive this camera for Christmas.  When she began taking pictures with it, horizontal lines began appearing across the screen.  It did the same once the image was downloaded to the computer.  We tried a different SD card, but that did not make a difference.  We contacted the Online Company we purchased it from (Tiger Direct), and they told us to contact the manufacturer.  We did that and they had us mail them the camera.  Six weeks later, the camera was returned to us in the same condition with a note that they were unable to fix the problem and couldn't do any more for us. So now we're trying to figure out what else we can possibly do to have the situation corrected.  It's very frustrating!", "Date": "March 14, 2008"}, {"Title": "Great starter camera - hard on batteries", "Author": "Paul O'Neill", "ReviewID": "R37P4SOC9FPZLR", "Overall": "4.0", "Content": "I bought this camera for my 8 year old. It's her first camera and it seemed ideal as it looked simple and was well priced. Turned out I was right, it's easy to use, takes quality pictures, she was up and running in minutes. The downside, and it is a big downside, is that it really eats batteries especially if the flash is being used. So if you go for this camera, get rechargeable batteries as well or consider a camera you can charge.", "Date": "January 2, 2008"}, {"Title": "GE digital camera", "Author": "T \"T\"", "ReviewID": "R3VWUZ8X18T351", "Overall": "3.0", "Content": "It's not my \"good\" camera, but it's perfect for the whole \"throw in the purse and go\" use. The more it zooms in, the less the resolution. It's not the camera I would take to the Grand Canyon, but it's great for running around town.", "Date": "February 8, 2008"}, {"Title": "Wonderful gift", "Author": "Angela Holmes", "ReviewID": "RB91SGJ1VZIG5", "Overall": "5.0", "Content": "I bought this camera for my 7 year old niece on Christmas!  She really enjoyed taking pictures with my camera and figured she was ready for her own.  I didn't want to buy her a cheap FOR KIDS camera because their images are grainy most of the time.  I bought her this one, since her favorite color is pink.  She loved it.  I was actually jealous too, because her screen is bigger than mine!! :) It takes very clear pictures and videos, and if a 7 year old can figure it out, it must be easy to use.  :)", "Date": "December 29, 2007"}, {"Title": "Great for the price!", "Author": "R. Snellen", "ReviewID": "R2B0FS9M6CE32Y", "Overall": "5.0", "Content": "I saw this camera in a K-Mart ad for $60.00. My mom had been wanting a digital camera forever so I actually left work in the middle of the day to go get it for her for Christmas. She absolutely loves it! My mom is the type of person who didn't renew her cell phone plan for 7 years because she didn't want to get a new phone because she wouldn't know how to check her voicemail! She sat down and figured out how to work the camera herself. It is that easy to use!Picture quality is great. I have a one year old who is not walking but running and we have so many clear pictures of her. I told my mom that I think I'm going to buy myself this camera (but in hot pink) because I like it so much!The only negative comment is that it does use batteries like crazy.", "Date": "December 28, 2007"}, {"Title": "Mr John Cornella", "Author": "John R. Cornella", "ReviewID": "R210KR366HNNXU", "Overall": "4.0", "Content": "This camera worked as advertised.  GE A730 7MP Digital Camera with 3x Optical Zoom (Black).  The transfer of pictures to my computer was seamless.  How the camera operates was pretty straight forward.  However, there is a learning curve and to get through this I used up the batteries provided and had to replace them to use the camera to take more pictures.", "Date": "October 23, 2007"}, {"Title": "Worth It", "Author": "Greg \"GMo\"", "ReviewID": "R3JA4TCB1VQRNL", "Overall": "5.0", "Content": "It's an incredible product especially for the price. My one issue is the flash is incredibly bright. But that can be a plus as well. Also, the optical zoom isn't incredible but it's good enough.I just bought another for my mom's birthday actually and she's in love with it.", "Date": "November 5, 2007"}, {"Title": "Nice Price/Product", "Author": "A. Carlsson \"Xandica\"", "ReviewID": "RU1HGKG2XAIIC", "Overall": "4.0", "Content": "This was purchased for my daughter, and is a great camera for the price. The only down side to it is that you have to purchase a rechargeable batteries unit as it only comes with AA batteries which don't last long. Other than that, it's a good camera. Delivery was fast.", "Date": "December 18, 2007"}, {"Title": "Nice Camera", "Author": "C. Reeves \"crypticbluerose\"", "ReviewID": "R2KFLNCELP0DXA", "Overall": "5.0", "Content": "It was a great deal at just 100 dollars. This is a nice camera. It is a manageable, sleek size and the pictures are great quality. Ths LCD screen is large.", "Date": "December 1, 2007"}, {"Title": "Great Camera for starter", "Author": "Thomas Manley \"bigtom53\"", "ReviewID": "RNHROSURZ75GY", "Overall": "5.0", "Content": "The camera is great! It has an easy to read manual and the functions work wonderful.", "Date": "November 12, 2007"}, {"Title": "Camera", "Author": "Kimberly K. Roberts", "ReviewID": "R37TM39LM2IPC", "Overall": "4.0", "Content": "Great little camera - especially for the priceI am amazed at the quality of pictures it is taking - even at night.The only drawback is that it does not come with rechargeable batteries.  However, i would definently recommend this camera.  I was very suprised with the quality!", "Date": "January 6, 2008"}, {"Title": "Great Camera", "Author": "Xiomara Delgado \"xiodelper\"", "ReviewID": "R3ITKIOOOCBOLD", "Overall": "5.0", "Content": "This is a great camera. I bought it for my mother and decided to keep it but had to send it to her anyways. Picture quality is great, easy to use, very compact.", "Date": "December 17, 2007"}, {"Title": "A good little camera", "Author": "GeriGee", "ReviewID": "R2ILAFJDEOQ5B9", "Overall": "4.0", "Content": "I haven't used this in enough different circumstances to know everything about it.  I wanted a small basic camera to replace the one that just died on my last vacation.  So far it has been fine.  The pause between pushing the button and taking the photo makes me crazy, but every digital I have used is that way.  I like that the power button is separate from the others, which was not the case with my last camera.  There is no view finder, just the screen. That took a little getting used to, but it makes perfect sense.  I really like the size of the camera and the size of the screen.", "Date": "December 11, 2007"}, {"Title": "Battery Monster", "Author": "S. Poyotte \"Fuming Mad\"", "ReviewID": "R20C2FI0OU9ZOS", "Overall": "1.0", "Content": "I saw the camera, loved it, bought it, now I can't use it because NO battery lasts more than 3 minutes. I have bought 3 sets of rechargeable batteries and charger and it is now obvious that I am wasting money. The issue is NOT the batteries, but the camera.", "Date": "August 24, 2008"}, {"Title": "Great camera for a while, then turns into a battery-eating machine!", "Author": "Beeslersmom", "ReviewID": "RNM3OGV1BOI3A", "Overall": "2.0", "Content": "I received this camera as a gift and it worked well for a little over a year. Then it suddenly started to go through batteries - I would say a new set of batteries for every 20 point-and-shoot pictures taken! I contacted GE about the problem and they were aware of it. They directed me to a patch download to address the issue. The patch worked for about a day then the problem resumed. It did take some good pictures while it worked, but I wish this camera would have lasted a bit longer.", "Date": "May 25, 2009"}, {"Title": "Great for the price but..", "Author": "E. Warden", "ReviewID": "R3KQWPHHQ68BAP", "Overall": "3.0", "Content": "...it does not come with an internal battery so like other digital cameras it will eat your regular batteries with before the night is over.  Get some rechargeables.  Also the USB is proprietary so if you loose you can only order it thru GE.  Otherwise it is a great lil cam.", "Date": "January 6, 2008"}, {"Title": "Fantastic!", "Author": "Ashley Volkerts \"Ash\"", "ReviewID": "R28TT4WNLMJU4A", "Overall": "5.0", "Content": "This camera is great!  So many options, great quality, sound, movie res., everything!  Great portraits and moving pictures.", "Date": "December 26, 2007"}, {"Title": "Digital Camera", "Author": "Thinese D. Daniels \"One Hot Momma :o)\"", "ReviewID": "R2BFYUOZZFIEDA", "Overall": "5.0", "Content": "I am a true photography nut and this camera is just the perfect weapon for my picture-taking arsenal! So far, I have used it to take pictures of my children, myself, my new tattoo; I mean EVERYTHING and the pictures are like Baccarat (crystal-clear) :o0", "Date": "January 21, 2008"}, {"Title": "I liked it, but...", "Author": "Ginny Corbin", "ReviewID": "RJA0O9XO68SXI", "Overall": "2.0", "Content": "Quit working for me after about 6 months. Just turned off and even with new batteries, wouldnt turn on.", "Date": "May 7, 2010"}, {"Title": "Worked great, then LENS ERROR!!", "Author": "Kristin L. Thomas \"Kristin\"", "ReviewID": "R3GL98DHHC6V48", "Overall": "1.0", "Content": "Was a great camera, used often but gently.  After about a month and a half of taking pictures and videos, the camera started having LENS ERROR and it won't stay on or open long enough to take a picture.  I DO NOT RECOMMEND THIS CAMERA TO ANYONE!!!!  We were always careful and there was no reason for the error to have happened.  I loved it, up until we started having this problem.  I have researched it and it seems this is a common error with no corrective measures.  Very disappointed in GE.", "Date": "August 6, 2009"}, {"Title": "Great camera while it last", "Author": "M. Vandenberg", "ReviewID": "R7K87AUY3WXQJ", "Overall": "2.0", "Content": "In a little more than  1 year, I have had 2 GE A730 cameras. GE replaced the first camera because it stopped working during our vacation. (8 months after we bought it.) They replaced it because it was a manufacturer's defect and they replaced it with a refurbished model.  The second one didn't perform as well as the first one.  It was sluggish- sometimes needing to press the shutter button 3 times for just one picture.  It was nice as a backup though.  The size was nice and the fact that it needed 2- AA batteries was very convenient.  The second one decided to quit working at my grandma's funeral. (6 months after GE replaced it).  Absolutely no warning that it was failing.  Let me down once, shame on you, let me down twice- shame on me.  I will not be replacing the camera with another GE.", "Date": "May 31, 2009"}, {"Title": "Don't wast your cash", "Author": "A Customer", "ReviewID": "R2VR0DDV4SVDRE", "Overall": "1.0", "Content": "Very frustrating.  I purchased this in spite of the many reviews about the battery life.  After researching a bit it seemed that doing a firmware upgrade takes care of the problem...it doesn't.  I have yet to take more than one picture with ANY type of battery.  Rechargables don't work at all, lithium takes a picture then dies so there is no way to download, special camera batteries were no better.  Spent $35 in batteries and no camera.  The batteries are still powering my old camera though so they aren't a total waste.  GE was no help.  So either spend extra to get the battery issue solved or get lucky and get one without a battery issue.  Would not recommend this to anyone, regardless of the price.  Stick with Canon or Sony, I've never had an issue with either of those brands.", "Date": "May 11, 2009"}, {"Title": "Best camera you'll find for under $100", "Author": "L. T. Davidson", "ReviewID": "R2BFQGAWRV1WNK", "Overall": "5.0", "Content": "I've had this camera for over 2 years now using it as a weekend warrior and an \"At work\" camera. Taking pictures for bulletins, newsletters, art shots and more. This little workhorse of a camera has features beyond it's price tag. And what's better is that they actually work. Play with some of the settings to get best results. Small in size but big in quality, I would buy 2 of these over a more expensive model. A MUST have if your going on vacation and don't want to bring along your $600 Cannon. You'll still get great shots.It's only down side is slow picture taking speed. Expect to wait at least 2 seconds between shots, the Auto focus can take a little bit of time too. But are expected on almost any sub $200 camera.After 2-1/2 years and more than 10,000 pictures taken, i am still very happy with my little GE. Keep it in your back pocket and go take some pictures.", "Date": "May 8, 2009"}, {"Title": "Decent value for money...A note about batteries", "Author": "S.J. Häsler \"Steve Häsler\"", "ReviewID": "R3KAEJ6XX11D20", "Overall": "3.0", "Content": "I'll agree with most of the reviews that have stated the pros and cons. In short, it offers a lot of features you won't find on other cameras in the $100 price range.  Although the low-end competition is catching up.  (My daughter just received a $85, pink Samsung camera that so far is easily as good -- < http://www.amazon.com/Samsung-8-1MP-Digital-Camera-Optical/dp/B001283FDS/ref=sr_1_1?ie=UTF8&s;=photo&qid;=1213985901&sr;=1-1 >This GE performance is good for a camera of this price, but not nearly as good as more expensive options.  This is our spare camera that my wife uses in her classroom and that we don't have to worry about if it gets banged up.  We also own the Canon PowerShot SD750 < http://www.amazon.com/Canon-PowerShot-SD750-Digital-Optical/dp/B000NK6J6Q > and frankly, the PowerShot puts the GE camera to shame.  For another $80 I would hands down recommend the Canon.  But if you are economizing, the GE is a decent unit.I also must add that after two or three months and minimal use, we found that the camera went dead. The \"on\" button merely flashed when pressed, but the camera would not \"boot up.\"I called GE customer service expecting to have to return it under warranty. The were nice enough, and responsive.  They told me the only solution is to use the expensive Lithium AA batteries.  Regular alkaline for reasons they could not explained, would not work.I tried and they were right, the lithiums worked where alkalines failed. So beware that over time you could be dumping money into expensive batteries, which admittedly last longer.  But my Canon camera has a small, rechargable cell.  So if you use this camera a lot, in a couple years you could potentially spend the extra $80 buying batteries.  And you'd still have a vastly inferior product in terms of picture quality, LCD screen, etc.  Note also, if it is important to you, this is not your father's GE.  It appears to be manufactured by an off-brand, Asian OEM that pays a licensing fee for the right to brand it GE.Yes, Virginia, you do get what you pay for. Or don't pay for.", "Date": "June 20, 2008"}, {"Title": "Decent", "Author": "Patricia Fontenot", "ReviewID": "R3EWY7MY8O0G8N", "Overall": "3.0", "Content": "I like the camera, but it drains the batteries.  Of course, I'm using regular batteries, so maybe the special batteries made just for cameras will be better, we'll see.  The picture quality is ok, but some tend to be fuzzy, even on the stabilizer setting.  Good camera for the money, I guess you get what you pay for, right?", "Date": "January 19, 2008"}, {"Title": "DIGITAL CAMERA", "Author": "Verna B. Green", "ReviewID": "R1KNS7LZ6EN3IN", "Overall": "5.0", "Content": "THIS WAS A HIT AS I GAVE THIS ITEM AS A GIFT.  IT TAKES GREAT PICTURES AND THE PRICE WAS RIGHT.VERNA GREEN", "Date": "January 2, 2008"}, {"Title": "Really...........not what I expected but...", "Author": "Anthony Altamirano \"Tony\"", "ReviewID": "R3QDR42M3SI2LJ", "Overall": "3.0", "Content": "First impression came when I opened the box and took the camera. The camera isn't very strong and I saw and felt that the camera is not of good quality.  Most of parts are made of plastic, the only good thing about it is that makes the camera light. The 2.5\" screen is nice and has a good resolution and color. The optical zoom is not so good nor bad, but the digital zoom is awful. Pictures looks good but on 50% zoom or less on the computer, if you watch them on real size (100%) pictures looks blur and with no clear details. Recording video is nice, videos at max resolution for that camera (haven't tested on less resolution and size) looks clear for a digital camera, just that don't focus good while recording near objects.Pros:Price:In fact is a nice camera for its price, not so good if you want quality pictures, but if you want a cheap and no high resolution camera this one is Ok.Panoramic view:Is a nice feature and easy to use.LCD Screen: Big and clear screen.Photo Editing: You can edit your pictures from the camera (rotate, resize, crop..)Records video with sound-----------Cons:Zoom: digital zoom isn't so good and optical zoom is awfulPlastic: most external parts are made of plastic and seems no so good qualityNo clear pictures: zoomed at 100% you can tellAnti-shock mode: is very poor and takes no clear picturesAs I said is not what I expected but for it's price is ok. Great if you don't ask too much for a digital camera.", "Date": "March 28, 2008"}, {"Title": "Just wish it worked with Linux", "Author": "William Patrick", "ReviewID": "R3LD4YBT9BWZPR", "Overall": "4.0", "Content": "This camera had everything I was looking for.  It's features were great.  The overall quality was fantastic.  The only problem I had was that I could not make it work with the Linux Operating System, so I had to return it.", "Date": "November 20, 2007"}, {"Title": "GREAT camera", "Author": "Nigel K. Faulkner", "ReviewID": "R17Z4Z8EOBOVGD", "Overall": "4.0", "Content": "This is the best camera i have ever had. It does not just take great pictures but it is so easy to set up. it was so easy i got it opened it and started taking pictures The bit that is not so good but the camera takes aa batteries witch means you have to renew the batteries quite often but otherwise it is the best camera i have ever had i recomened this camera.", "Date": "April 20, 2008"}, {"Title": "satisficed", "Author": "Roberto Moreno", "ReviewID": "R12M72JQ63S1VF", "Overall": "4.0", "Content": "it was very nice. it was like  expected. I'm very satisficed.i recommended this product to my friends all the time.", "Date": "January 3, 2014"}, {"Title": "Great camera", "Author": "taxfree4", "ReviewID": "R1FLHTG31X6O3H", "Overall": "5.0", "Content": "I have had this camera for quite a long time and i has performed flawlessly. I adjust the MP's down to 2MP's for everyday shooting and the colors are terrific. With the price so low now $39.00 - $79.00, it is the best buy on the market for the entry level photgrapher or seasoned professional. Although I still very much appreciate the alchemy of light on film the digital age is here to stay and you can embrace it fully for next to nothing with this little gem.", "Date": "June 21, 2012"}, {"Title": "GE A730, best Point and shoot for your money", "Author": "Christophe Morone", "ReviewID": "RNCI9MF2KAK0K", "Overall": "4.0", "Content": "After having an abysmal time trying to take photo's on another Camera I bought for $65 (A DXG model 568), I was in the market for another camera. This GE caught my eye mostly because it had OPTICAL ZOOM as opposed to digital...I hate digital zoom.Strangely enough, the GE was ALSO $65 at the time, so I jumped ship on the DXG and cashed in my lot with GE. I have never regretted that decision.Cracking open the box and actually trying out the camera turned out to be simple, intuitive and FUN. Even the manual controls were straightforward and yielded amazing results. I was able to go exploring and shoot for HOURS on the included batteries, and most of the time the pictures came out razor sharp. The only difficulty it had was in REALLY LOW light shots, because the camera would automatically hold the shutter open longer and motion blurred the image. Getting a cheap tripod fixed that problem.But Speaking of tripods brings up my biggest and really my ONLY gripe with the camera...the tripod mount has plastic threads. YES, the camera served me wonderfully for over 2 years and over 8000 photo, but all it took was my tripod falling over and the metal screw in the mount tore the old plastic threads out of the bottom of my camera. Ooops. My poor baby is a handheld only now...One other think I liked about the GE A730 was that if I set the 10 second timer for a photo, it STAYED ON! My tripod wasn't the greatest and tended to shimmy a little after I pressed the shutter, so those 10 seconds helped eliminate almost ALL shake from my shots. Now this may have just been a firmware or programing glitch in the A730, but every camera I tried after that, including other GE's, the 10 second timer shut off after the picture was taken. I hated that...Sure the screen is sometimes obscured a little bit in bright sun because of the beveled edges directing light into it, but it really wasn't all THAT hard to see the screen even then. My main and only gripe with the A730 is the plastic mounting threads. Other than that, you'd be a fool to pass up this camera.Buy It.Enjoy It.Spread the Love.", "Date": "March 17, 2011"}, {"Title": "Not bad for the price", "Author": "Mom of 4 boys", "ReviewID": "R2L5C4RBQ98AEC", "Overall": "3.0", "Content": "I bought this as my first digital camera because it was on sale for a great price. I think GE kept the price low because this is their first entry in the digicam product field. I bought this at Kmart, not Amazon. The cust. service guy who showed it to me mentioned that the only thing he found fault with is the battery cover, which did not seem too secure. I have had problems with it popping open, but not a major problem, just snap it closed when that happens.Pros:-7mp when most others on the market were 6mp at the time-many features, and easy to use (portrait mode, panaramic, video recording w/ sound, auto or manual focus, color select (b&w;, color, sepia), and many other features-compact-large LCD screen-ease of use-low priceCons:-grainy picture sometimes while using auto focus (I switched to manual mode to try to get past this)-not very tight zoom-delicate designMy camera is now broken, where when I try to zoom, the camera shuts down. This may have been caused by my letting my kids use the camera, but I have always felt this was a very delicate camera.  The lens is covered by a very thin layer that opens when the camera is turned on. This has gotten stuck on a number of occasions (stuck half open when camera is off).I am shopping for a replacement that takes clearer pictures and has more of a zoom.", "Date": "November 28, 2010"}, {"Title": "Camera Gift", "Author": "Cassandra", "ReviewID": "R3QNPDAZWBTM0W", "Overall": "5.0", "Content": "I gave this camera as a gift. This price and Canon name caught my eye. It had every feature I would want in a camera, and that is why I chose this one!  The woman loves it!", "Date": "September 12, 2010"}, {"Title": "Good camera though a little slow.", "Author": "FrostyAir", "ReviewID": "R1TG5BQ8VBC0BS", "Overall": "5.0", "Content": "Everything works great.  The only problem I had was that it's a little slow when taking the picture and when waiting to take the next picture.", "Date": "July 15, 2010"}, {"Title": "The camera works great for what i need it for", "Author": "mig029", "ReviewID": "R1MXYAMO4HHVFF", "Overall": "4.0", "Content": "The only real problem i have with this camera is the fact that point in shoot is impossible. It takes around 10 seconds to boot up and take a picture. Also the firmware must be updated or battery life is crap.", "Date": "July 14, 2010"}, {"Title": "pretty good for price", "Author": "maggie", "ReviewID": "R1M5ZFB8QNEILF", "Overall": "4.0", "Content": "This is a ok protuce good for th price.The video recorder does have sound but the words go faster then the pic so it gets a little screawed up .From the picture stand point it is alright not that great, some days it take very blurry pics.The batterie life is pretty bad i go trough so much batterie with this.The portiblety is alright to it wont fit in your pocket onless your a guy.The colors great! This camera is also very durible, trust me i have hade it for about 4 years, and its still about the same from when i got it!It also has differnt settings to put it on for day time or nite time ect. But i would highly recommend this protuct if you are looking for something cheap!", "Date": "July 7, 2010"}, {"Title": "so-so", "Author": "Northshore McLeod", "ReviewID": "R1UP0H3UJGVIRS", "Overall": "3.0", "Content": "I bought this camera for my wife in 2007. It takes ok pictures and is very easy to use.Never had any of the appearantly common battery issues until early 2010 when the Alkaline batteries would go dead for no reason while the camera was off and put away.Brand new batteries would die in a week of storage. This problem seems to have subsided after I did the recommended firmware upgrade at General Imaging's site.We will see.", "Date": "May 5, 2010"}, {"Title": "Great Camera!", "Author": "Hayley E. Fisher \"Hayley\"", "ReviewID": "R1W47SOOCNNJ70", "Overall": "5.0", "Content": "This camera is probably the best camera I have ever owned. There is only one thing I don't like about it and that is that you have to press the button hard and sometimes a few times to get it to take the picture. I'm no photographer so this could be my own problem, but I have an issue with timing unless I set the camera on a timer. When you click the button and the first flash goes off everyone in the picture always thinks that means it's done, well it's not. It should flash twice and then you will have a pretty good picture. I've never been disappointed with the quality of the pictures I've taken.", "Date": "February 4, 2010"}, {"Title": "I will never buy a GE camara again!!", "Author": "Coolazzmommy", "ReviewID": "R1LW7A4P35WH8B", "Overall": "2.0", "Content": "Well lets start on the housing and display. It is made of a shiny plastic which scratchs very easily, so within a couple of days of getting it I already had scratches all over it. Then, I bought the camara in May 08, I noticed that the battery would die easily. I would buy better brand batteries but they would die within a couple hours too. I do not use my camara alot. I normally would use it for my sons 1 hour soccer game or a field trip, it wouldn't last through anything! In the middle of my son's birthday I am in a panic cause my camara sucks and died while taking pictures! Also, it has a time lapse from when you click on the button to take a picture and when it decides to finally take the piture. You could be clicking and clicking with nothing happening and as soon as you decide to give up and walk away the camara takes a nice picture of the floor while you were pulling it away from your face.Overall the only nice thing is that it is fairly small and pretty easy to use, alos that it is pretty till the scratches start, but thats about it.", "Date": "December 16, 2009"}, {"Title": "Not as stated. They LIED.", "Author": "CatchCarp756 \"Mphz10\"", "ReviewID": "R23Z1B235RBOQK", "Overall": "3.0", "Content": "The product does not perform as it should. it also did not come with batteries as it stated. i am highly dissappointed in my first amazon purchase.", "Date": "October 22, 2009"}, {"Title": "It's an okay camera", "Author": "John P. \"John\"", "ReviewID": "R2W9DQUGAW0B07", "Overall": "3.0", "Content": "Overall, this is a decent pocket camera. It does have a lot of features, with pretty good focus and zoom. It takes SD and SDHC cards. I noticed this seems less likely to turn on with my rechargeable batteries. It may sound funny, but sometimes other cameras I have can turn on with batteries this one won't work with. I think it's because the batteries are old, and the camera might require a little more power. It seems as though the images turn out blurrier more times than my cameras from Canon and Kodak, but it is usually not too bad. There is a video mode (.mov format), however, the audio quality is severely lacking. Do not depend on the video function. I have had this camera since December 2007, and it has held up well. Pretty good build quality. The screen can be hard to see sometimes. It also isn't that bright (at least to me). Overall, I say this is an OK camera. I would try something else a bit newer from a more popular manufacturer.", "Date": "October 13, 2009"}, {"Title": "Camera", "Author": "D. Jelvik \"Gammie\"", "ReviewID": "R3LADMH2MO53VM", "Overall": "5.0", "Content": "great little camera.  I have had for couple years now and haven't had a problem.", "Date": "September 15, 2009"}, {"Title": "Nice nice nice...", "Author": "Victor Ml. \"VMl.\"", "ReviewID": "R2BUX3ET5F03B0", "Overall": "4.0", "Content": "It has several useful and funny applications.Low Cost.Pictures display with hihg quality on the screen.Good option for a low cost camera.", "Date": "April 25, 2009"}, {"Title": "Great Buy", "Author": "C. Melancon", "ReviewID": "R16RPSEBUSR35Q", "Overall": "5.0", "Content": "Takes wonderful photos.  The only issue I have is that is goes through batteries really quick.", "Date": "April 16, 2009"}, {"Title": "Pretty cool cam.", "Author": "Adrian Costiniuc \"costi\"", "ReviewID": "R1CGS6ETWNIFKS", "Overall": "5.0", "Content": "It's an ok cam for the price you pay.Load it with some powerful batteries as it will drain regular ones fast.I shoot in daylight so with the flash off and with 27k mAh batteries and it works just fine.", "Date": "April 12, 2009"}, {"Title": "good for the price", "Author": "Lucy E. Ramos", "ReviewID": "R35ZCEXHX2KE1C", "Overall": "3.0", "Content": "it's definitely bulkier than the picture seems, but it's a decent camera. it's a great camera when considering the price.", "Date": "April 6, 2009"}, {"Title": "Prices on Amazon", "Author": "Mandy Ross", "ReviewID": "R1G1UCUCYSYQ1Z", "Overall": "3.0", "Content": "Let the buyer beware. Just an FYI...I bought this camera at Walgreens today for $65.00.  There are 7-11+ MP cameras on the market now. A 7 MP camera should AT least be under $100.  At the very least. My daughter lost my Sony Cybershot. (5 MP) I can already tell that I liked the Sony better,  but I'm going to give this one an honest try. I think it will do the job.", "Date": "February 13, 2009"}, {"Title": "Not worth it", "Author": "B. Walberer \"BJW\"", "ReviewID": "R3HXVCOAK6YWOB", "Overall": "2.0", "Content": "I already have an expensive but rather bulky digital camera so I wanted to get another camera that is lighter and smaller and that I could put into my pockets. I bought this product because of its features at a comparatively low price. The camera initially worked ok. The picture quality, though, was quite mediocre. And after several months of light use the camera stopped working.In hindsight, I would rather spend a little bit more money and get a more reliable, higher quality camera.", "Date": "October 25, 2008"}, {"Title": "Great 1st time digital camera", "Author": "One4the boys", "ReviewID": "R11I8CPECVPNY5", "Overall": "4.0", "Content": "My 15yr old loves this camera, it fits in his pockets and the screen is larger than we thought it would be.", "Date": "July 31, 2008"}, {"Title": "GE  GREAT CAMERA", "Author": "caseygirl \"CASEY\"", "ReviewID": "R1SZ4PJSXQCC6F", "Overall": "5.0", "Content": "GREAT CAMERA  GE A730 7MP DIGITAL  USE IT EVERYDAY  ALSO PURCHASED SANS DISK AND BATTERY CHARGER  VERY GOOD QUALITY PICTURES", "Date": "July 13, 2008"}, {"Title": "as advertised", "Author": "Josh Javage \"rpgexploiters ubergold\"", "ReviewID": "R256AG5HN3FS77", "Overall": "4.0", "Content": "This camera works as intended, the battery life is not great when taking videos, and the standard memory is a bit low, but the expandability (up to 4gb) makes up for it, thus the 4 of 5 stars on this review.", "Date": "July 13, 2008"}, {"Title": "Great Camera", "Author": "M. Conner", "ReviewID": "R3LWQ74F0UAJ0U", "Overall": "5.0", "Content": "The GE A730 is an excellent camera for $79.99 + S&H.; I needed a smaller point and shoot because I didn't want to take my Digital SLR to the beach.  This a great buy for beginners or for someone who wants a smaller camera. It is easy to uses and has video mode also. It only requires 2 AA batteries which you can find anywhere. Day time and Night time shots were awesome.", "Date": "June 30, 2008"}, {"Title": "camra", "Author": "Lisa Long", "ReviewID": "R2TN6EHS8YAA09", "Overall": "4.0", "Content": "camera is great but we did not receive the carrying case it was  to come with and we thought it came with a memory card by the statement in the description of the camera.", "Date": "June 27, 2008"}, {"Title": "Amazing camera.", "Author": "E. Panteleeva", "ReviewID": "R2DFESJSEWHLB3", "Overall": "5.0", "Content": "I have looked at many different cameras, and this is definitely the best one I found. It is perfect for young people who enjoy taking fast pictures and videos--and a lot of them. There are many flash options, zoom options, a portrait setting, a panorama setting (combining three pictures into one), and the greatest thing is the scene settings--easily switch between taking sports pictures, no-flash pictures for kids and animals, a setting for plants, indoor setting, snow setting, sunset setting, behind glass setting, landscape setting, museum setting, night landscape setting, and night portrait setting. I don't see why pay more if this camera has everything you could ever want. Amazing picture and video quality (great sound quality, too).", "Date": "June 27, 2008"}, {"Title": "Easy, and perfect.. love it", "Author": "D. Sengupta \"taylor\"", "ReviewID": "R2SCSA8ZXSF5P4", "Overall": "5.0", "Content": "I bought this camera cause i needed something for just couple of months.. It turned out to be the great .. The pictures are awesome and its easy to use.. It has great features and works perfectly..  I love it", "Date": "June 27, 2008"}, {"Title": "Very good camera", "Author": "the_awesome_person", "ReviewID": "R2FUGK6SJQ86G0", "Overall": "4.0", "Content": "Ok this is a great camera for photos that do not require tons of zoom. One thing about is that for some reason when you are taking a pic, the screen makes the pic look like there is a light purple fog over the pic. after taking the pic it shows up normal so this problem doesnt really consern me that much. Some say that it takes the pics slow but all that you have to do if you want a quick pic is hold down the button like half-way then when you are ready, bush it all the way down. this makes the camera focus ahead of time so you can get the fastest pic. its a great camera for fun quick pics w/out the need of tons of detail. i totally recomend this camera. thank you and have the best day ever.", "Date": "June 25, 2008"}, {"Title": "perfect!", "Author": "Barrabino Jose Luis \"Pepe\"", "ReviewID": "RB5IDTHVG47WI", "Overall": "5.0", "Content": "the product is perfect!and the service and shiping was perfect too.i am very thankful.", "Date": "June 20, 2008"}, {"Title": "GREAT PRODUCT", "Author": "Clara \"CLARA\"", "ReviewID": "R12U3PMNPZTABD", "Overall": "5.0", "Content": "GREAT PRODUCT AT GREAT PRICE. SHARP AND BEAUTIFUL PHOTOS.LOVE IT. CLARAGE A730 7MP Digital Camera with 3x Optical Zoom (Pink)", "Date": "June 14, 2008"}, {"Title": "great options for the price", "Author": "Rachel J. Attridge", "ReviewID": "R29M1IY86QBA4S", "Overall": "4.0", "Content": "I like the look of this camera, and the price is great.  It takes great pictures and has a lot of features.  You can take pictures in black/white, sepia, panorama and the camera has a good manual setting feature.  There is a little lag time once the picture is taken, so it is not good for successive shots or catching action events.  The LCD screen is also very shiny and can be difficult to see in very sunny conditions, but if you hold your hand over the screen it works fine.  I am overall very happy with it.", "Date": "June 13, 2008"}, {"Title": "Simple and affordable", "Author": "IZzI V.", "ReviewID": "R1G2IQGBWD6AK4", "Overall": "5.0", "Content": "This item is very nice for the price and very simple to use, I would recommend to buy this item....\"However\"....You will need to buy a separate battery recharger and rechargeable batteries, plus a 1gb SD memory card", "Date": "June 4, 2008"}, {"Title": "Unbeatable \"Point and Shoot\" camera", "Author": "A. Kilgore \"gamer grandma\"", "ReviewID": "R1NVLDZFOVDEQW", "Overall": "5.0", "Content": "For its price range this is an amazing camera! The pix are sharp and can be cropped for close-ups without noticable pixel loss.My sister has this camera and my husband fell in love with it. He was especially delighted with the short movies we could make. The SD card can be up to 1GB which has room for over 400 photos. We took several movies and many pix at our last get-together and had loads of room left on the card.We don't use a movie camera often enough to justify the purchase and didn't want a camera that required fiddling with adjustments. There's an \"auto\" choice here that has worked well for us. You also can take a seamed picture that produces a pan-like image. And there's a setting for fireworks that gives you a breathtakingly beautiful picture.A hookup is included that allows you to view your pix on TV. We have the Wii game system and a widescreen TV. We were amazed at how professional our shots were when viewed that way. We Ooh-ed and Ahh-ed a lot!I got the camera for my husband for Father's Day, but took it on a trip before that day arrived. It comes in pink and I would have gotten that. But he would Never have believed the Father's Day part! It doesn't have a viewfinder but that wasn't a problem for us as we use the screen anyway. A CD came with it in case you don't have a photo editor program. There was, of course, a USB cord.We've had several digital cameras that took pix of lesser pixels and lesser quality. I highly recommend the GE A730 for anyone wanting a convenient, lightweight camera for around $100 that gives superior results.", "Date": "May 28, 2008"}, {"Title": "Perfect little point and shoot", "Author": "Jeremiah D. Bartlett \"jdb_333_ephs\"", "ReviewID": "R2CHKFD31ITRU1", "Overall": "5.0", "Content": "I bought this camera to replace my Fuji Film Finepix 230. After having it for only two weeks I am utterly blown away. I was skeptical of purchasing from General Electric as I had never had experiences with their imaging products. But After looking into it I felt it was worth a try, and I am impressed. It delivers on many different levels, and has all the standard features I want in a camera and then some. I am used to paying around $150 for a digital camera generally around a 3.2 MP, and for getting this one for $90 shipped I am sold on it. I had heard that the flash was a concern, that it would drain the batteries too quickly. I have had it for two weeks and have been using it to get a hang of it, figure out all the features, and I have yet to replace the batteries.The Pros:  Supports up to a 4 GB SD card allowing for almost 1200 pictures at 7 MP on best quality, or up to 120 minutes of consecutive video, making it great for camping trips where a computer connection is not feasible  Superior picture quality (might be because its my first digital camera greater that a 3.2 MP)  Many preset scene settings for anything from children and pets to fireworks and the panorama feature is amazing (takes 3 separate pictures while having a ghost image on the side to help align them))  Zoom does not diminish quality  Farley simplistic allowing most anyone to select the proper settings and take extraordinary pictures, while allowing the more experienced photographer to manually set the setting they want.  Quick start up for \"act fast\" pictures (you know those Kodak moments)The Cons:  No eye view (alternate to LCD screen for conservation of battery life)  Small zoom keys (sometimes difficult to press when trying to get the act fast pictures)", "Date": "May 26, 2008"}, {"Title": "Great deal", "Author": "S. M. Bueno \"smihich\"", "ReviewID": "REHINB4BQCZ00", "Overall": "5.0", "Content": "This' a great camera! Small, easy to setup, easy to use and take really nice pictures. It's really a great deal for the price.", "Date": "May 19, 2008"}, {"Title": "I like the camera", "Author": "Taneka C. Scott", "ReviewID": "R10D02BGJHAVDY", "Overall": "5.0", "Content": "I like the camera, and it came in a timely manner.  I did not have to wait long for it.", "Date": "April 17, 2008"}, {"Title": "Great Product!", "Author": "Sara", "ReviewID": "RZLEF0G0DAT35", "Overall": "5.0", "Content": "This is such an awesome camera!!! This is my first digital camera and I am so glad I chose this one. It takes the best pictures I have ever seen. Thank you so much Amazon for such a good product at such a great price.", "Date": "April 10, 2008"}, {"Title": "Excellent Product", "Author": "J. Ramon Sosa Juarez \"Ramon Sosa IT Tech\"", "ReviewID": "R2LGQH43XCU5DU", "Overall": "5.0", "Content": "\"excellent camera, everything that i have hoped for and more\" nice resolution, and very light, this is a must have for newbies on the digital picture media.", "Date": "April 9, 2008"}, {"Title": "great", "Author": "Reynold Haywood", "ReviewID": "RQ5T64X47DU65", "Overall": "5.0", "Content": "Great Camera especially pictures at night with little or no light those pictures are magnificant Great is the GE A730 it has surpassed sony and all top brand name.", "Date": "April 6, 2008"}, {"Title": "Great camera!!", "Author": "gioia", "ReviewID": "R299NT5IEKNNB5", "Overall": "5.0", "Content": "I bought this camera for my 9 year old daughter for Christmas, and it was the best purchase ever.  The screen is a great size and the picture quality is wonderful, even the videos are clear.  If I had to have any complaints, it would be that it doesn't come with a rechargeable battery.  We change batteries often but when you see the picture quality, it's well worth it.", "Date": "January 25, 2008"}, {"Title": "Great Camera!", "Author": "Celi Farias", "ReviewID": "R1P1UZIWYXMH5F", "Overall": "5.0", "Content": "I couldn't believe how great this camera is for the price I paid! Great item! I totally recomend it!", "Date": "January 21, 2008"}, {"Title": "easy to use", "Author": "K. Villa", "ReviewID": "R1JVP2A9XR694Y", "Overall": "4.0", "Content": "a good beginner camera, very light weight and easy to use. luv the features, takes good pics even at night. you can turn off the flash and still get a good picture, only if there is good lighting at the backround. bring extra rechargeable batteries, preferably 2500mah.", "Date": "January 12, 2008"}, {"Title": "GE 7MP Digital Camera", "Author": "Fran Torres \"Latinbella1975\"", "ReviewID": "R15U1WQ41KAS5Z", "Overall": "5.0", "Content": "I love the color of this camera, and I just know Amazon will be quick with this, so I can enjoy it..", "Date": "December 23, 2007"}, {"Title": "Good value in the end.", "Author": "Gee", "ReviewID": "R2NCTDRCC9TLZ4", "Overall": "3.0", "Content": "It stopped working after 3 months, GE(NOT General Electric) replaced it after an additional 2 months, but now it seems fine.  We'll keep our fingers crossed because we where not able to get a refund so we are stuck with it.", "Date": "May 28, 2008"}, {"Title": "i love this", "Author": "Phillip Sanders", "ReviewID": "R1OSOJIL9G8FOF", "Overall": "5.0", "Content": "this is very easy to use and so far has held up great under light use", "Date": "April 30, 2008"}, {"Title": "GE A730 camera", "Author": "M. Fernandez", "ReviewID": "R705JN8T57MQE", "Overall": "5.0", "Content": "I ordered this camera as a Christmas gift for my daughter. She had been Begging for one for months! When she finally opened her present we were surprised to find the Camera had apparently been damaged. Dreading having to talk to someone about a return possibly a refund I waited a couple days then contacted the seller.I was SO please with the service I got... No arguments no hassle they automatically sent me a return slip via E-mail and had my daughter's new camera on its way. We are very happy with the service we received and will Def be buying from them again!", "Date": "February 28, 2008"}, {"Title": "Amazing", "Author": "James Thornock \"supersonicsixteen\"", "ReviewID": "RRG8GCL36JSZT", "Overall": "5.0", "Content": "I'm not a camera expert, but I've learned so much more about cameras in general because of all of the features this camera has. I was trying to be careful buying a camera, and weigh all of the specs, and this one was my choice.  It works like a charm. If you know how to use a camera or not it's awesome.", "Date": "February 18, 2008"}, {"Title": "Camera and Case", "Author": "Gregory T. Chambers", "ReviewID": "R244GNE6VCBL7Y", "Overall": "5.0", "Content": "The camera and camera case was a birthday present for my Granddaughters  16th birthday and she LOVES it.", "Date": "February 18, 2008"}, {"Title": "a great gift!", "Author": "A. Woodward", "ReviewID": "RAWYQ8WQOOV2Q", "Overall": "4.0", "Content": "I bought this as a gift for my 80+ grandfather.  This is an exceptionally easy camera to use - very few buttons to get confused, and the software is just right for a novice digital camera user. (I returned this camera only because I found it cheaper during the holidays at a chain store.)", "Date": "January 25, 2008"}, {"Title": "bought as a gift", "Author": "T. Mcgee", "ReviewID": "RAOHCSUO8SH5B", "Overall": "5.0", "Content": "I bought 3 of these cameras for my daughters, ages 8 and 11. So for so good.", "Date": "December 16, 2007"}, {"Title": "Poor design decisions and non-standard parts make it a problematic camera. Not linux friendly.", "Author": "M. Singh \"bookworm\"", "ReviewID": "R1PPN444GBK0H3", "Overall": "2.0", "Content": "This is not a bad camera, but it has a few problems, some of them show-stoppers.1. The USB connector is non-standard. Its not a mini-USB connector but one of those more \"wierd\" connectors. BAD idea. You lose the connector. How do you replace it ? It has happened to me once before with a Toshiba PDR-10. Connectors ought to be standard.2. Linux does not pick it up seamlessly. I have used Canon and Fuji cameras at work for years, and when I plug them in, they get picked up immediately by hal. Not so with this camera. Its software dependent, and that is a *BAD* idea. I am sure I could make it work with digikam with a little work, but I simply do not wish to own a camera that can't do something so basic.3. The flash is pretty bright, and probably eats batteries.4. There is a DC in (3V) port at the side, but this camera does NOT ship with a charger. Pretty dumb, don't you think ? What is the point of this kind of marketing ? Its not as if this camera has such great features that people will spend time online searching for accessories.Since I was unable to transfer my images to my machine, I cannot say how good the pictures it took were.A somewhat disappointing experience, and I am returning this equipment, less than a day after receiving it. This camera is not junk, but it could stand standardization and some redesign, etc.Pay some more money and get yourself a Canon or Sony or Fuji instead.", "Date": "November 28, 2007"}, {"Title": "Purple...", "Author": "S. Brodersen", "ReviewID": "R38ZTLRWZJCYPF", "Overall": "2.0", "Content": "It is small and light weight camera that starts quickly... however it turns every picture i take purple...", "Date": "June 11, 2008"}, {"Title": "best buy!!!", "Author": "Laura Johnson", "ReviewID": "R2DY3SBF2Y8QI9", "Overall": "5.0", "Content": "THE CAMERA IS THE BEST I'VE HAD...AND ONE OF THE CHEAPEST. IT WAS SHIPPED AND DELIVERED IN AMAZING TIME...ABOUT 3 OR SO DAYS AFTER I ORDERED IT WAS IN THE MAILBOX...I DIDN'T EVEN PAY FOR EXPEDITED SHIPPING!", "Date": "April 12, 2008"}, {"Title": "Camera didn't work", "Author": "C. Jones", "ReviewID": "RTVY5ZSZCKKDL", "Overall": "1.0", "Content": "The camera seemed to be packed with plenty of features, however the unit I was sent did not have a working zoom function.  Needless, to say I returned the camera and now I am going to spend a little extra money on a Canon.", "Date": "January 12, 2008"}, {"Title": "Don't buy it, I returned it!", "Author": "Y. PRADAS BERTOMEU \"Yol\"", "ReviewID": "R2IXLRZCQFXXLO", "Overall": "1.0", "Content": "Previously to purchase, I red all the reviews: some good, some bad; still, I thought that I just needed a cheap \"easy to travel\" digital camera, and the GE seemed to be good enough for that. It is not! it is bigger than it seems, feels like a toy (it's plastic) and for a little more money, you can have a decent one, far better than this.", "Date": "March 12, 2008"}, {"Title": "Camera", "Author": "Howard Fellows \"HFellows50\"", "ReviewID": "R3RUOD4R750WTK", "Overall": "1.0", "Content": "No review @ this time.  I gave it as a gift to my wife and not sure how she likes it.", "Date": "June 5, 2009"}, {"Title": "What the?....", "Author": "P. Bailey", "ReviewID": "R1HOIXQFVLCD4O", "Overall": "1.0", "Content": "When I had ordered the product, it said it was \"In Stock\".  After waiting for many weeks, I contacted Amazon and the buyer to cancel the order as it would not make the deadline in which I needed the product.  I am now being asked to write a review on a product I never got and I had received verification on stating my order was cancelled.  You figure out what my review is!", "Date": "December 24, 2007"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000QGBCVY"}}