{"Reviews": [{"Title": "Camera", "Author": "Trung H. Pham", "ReviewID": "R38LQXCW61HYRV", "Overall": "4.0", "Content": "It price is good. However, you should be ready to buy a seperate memory card so that you can store your pictures. The camera is not working well with moving (even slowly) objects.", "Date": "August 13, 2008"}, {"Title": "LOVE IT", "Author": "J. Evans \"book worm\"", "ReviewID": "R2M0LMGYSKOKG", "Overall": "5.0", "Content": "I ABSOLUTELY LOVE THIS CAMERA. THE BEST FEATURE IS THE RECHARGEABLE BATTERY. I USE IT TO TAKE PICS FOR MY FOOD BLOG. THE PICS ARE VIBRANT AND CLEAR!", "Date": "December 5, 2008"}, {"Title": "Excellent  camera", "Author": "Clinton Perry", "ReviewID": "R25HL2FJC99E6V", "Overall": "5.0", "Content": "I bought this camera earlier this year supposely \"refurbished\" when I got the camera it was boxed like being brand new. It takes beautiful pics and easy to read and understand manual is very helpful. I would reccomend this camera highly.", "Date": "December 15, 2008"}, {"Title": "Great camera", "Author": "James Billy Stinnett \"Bill Stinnett\"", "ReviewID": "R1SRNTZIWTLNCY", "Overall": "5.0", "Content": "I got a very good deal on the camera, and it take very good picture. I used it a lot at car shows,and i get great picture.", "Date": "November 22, 2008"}, {"Title": "Keeps turning off ....\" Help\" !!!", "Author": "Diana", "ReviewID": "R140GXMJ2L6GWJ", "Overall": "1.0", "Content": "This camera was a giving to me a long time ago I never used it  because since day one I had trouble taking pictures it would either turn off on me (with battery fully charged )  or it would tell me about my memory card been full / lock . Its Brand new and Now im trying to used it but I dont know if my setting are wrong or what ? I reset the whole camera and it stills turns off. Also my zoom in -zoom out buttons dont work.  Does any one have any suggestion on how to operate this camera? If not is going in the trash!", "Date": "December 1, 2011"}, {"Title": "its nice and work", "Author": "Akua", "ReviewID": "R2HGMQ02WKQ295", "Overall": "4.0", "Content": "sometime the picture is a little fuzzy but for the price and refurbish its nice i do hair so i wanted a camera to take pictures of my styles which it is doing that function", "Date": "July 20, 2011"}, {"Title": "Fantastic Camera, Great Photos, But.......", "Author": "VegasJack", "ReviewID": "R2NRL1DLWC0SNL", "Overall": "5.0", "Content": "Best digital camera I've owned. Takes fantastic photos, almost equal to my $400 14mp Cannon. Beware though, this company is no longer in business, so there is no customer support. And most important, make sure the camera comes with a user manual as there are none to be found on the web.  I made the mistake and bought one with no manual, and without the manual, I'm not sure how to change the setting to take even better pictures than it already takes in \"Auto Program Setting.\" Can't beat the camera for the price. To bad this company went under, they made a great camera. If you find this camera for sale and it has the manual, buy it, you won't be disappointed.", "Date": "June 13, 2011"}, {"Title": "Good deal", "Author": "Abdulaziz Alkhulayfi \"azzozy\"", "ReviewID": "R4066Y0QWFRR6", "Overall": "5.0", "Content": "Very nice.The seller is very good. The first battery died and he sent a new one.", "Date": "November 23, 2008"}, {"Title": "Buyer Beware", "Author": "T. Northcutt", "ReviewID": "R1FN9VPPUP7KSR", "Overall": "1.0", "Content": "I purchased a Norcent camera the wouldn't operate after one week.  I returned the camera in August (its now November) and haven't received a replacement.  Cannot reach the company via phone (mailbox is full) or e-mail (error undeliverable).  Go to their website and try to reach them for yourself.  Company must be out of business.  Don't buy their unsupported products.", "Date": "November 17, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "Captures high-resolution images up to 3072 x 2304\n2.5\" LTPS TFT LCD, scratch-resistant acrylic panel display\n3x optical zoom and 4x digital zoom\nMovie mode captures video clips with resolution of 640 x 480, 320 x 240, and 160 x 128\nBuilt-in flash with auto, red-eye reduction, always on, slow sync, forced on,forced off\nUSB cable, AV cable, wrist strap and camera bag, user manual and software CD included", "Name": "Norcent Xias DCS-760 7.0 Megapixel Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41EAwn%2BBetL._SX300_.jpg", "ProductID": "B000ZKR6ZC"}}