{"Reviews": [{"Title": "Not  A Digital SLR, But pretty darn good.", "Author": "D. E. Corbin", "ReviewID": "R2EG137DZZ4FVL", "Overall": "4.0", "Content": "I use a pro model digital SLR for my important work and purchased the G5 for a handy travel camera and for candids at parties,etc. I had previously used the Canon G2 for this purpose,but wanted more resolution in case I got a shot that I wanted to enlarge to 11X14. The Canon G5 fits the bill.It does everything I ask it to do and does it well. I agree that the noise produced above ISO rating 100 is unacceptable,but the ISO setting of 50 for the G5 is equal to 100 on other cameras and the 100 setting is equal to 200. I find that with the availability of f.2 to f.3 speedy aperture I find little need to shoot at any higher ISO. As far as the complaints I've read regarding soft images and poor focus,I have not found this to be the case.After taking around 800 shots with the G5 I can say that the images are very sharp with no focus problems.Perhaps the complaints stem from the users technique. Yes,the shutter lag is a pain,but shutter lag is a problem with all compact digital cameras.If you don't need enlargements beyond 8X10 then go with the less expensive G3,but if you want enlargements up to 16X20 and don't want to invest in a digital SLR I think you'll be more than happy with the G5. Shoot at ISO 50 when possible. Keep in mind that a vast number of the best published 35mm images are shot on Fujifilm Velvia (ISO rating 50).", "Date": "October 2, 2003"}, {"Title": "Problem with relative ratings", "Author": "Tony Evans", "ReviewID": "RR02QHI7YQUW5", "Overall": "5.0", "Content": "I recently bought the G5 and I am extremely happy with it. When deciding which camera to buy, I was initially put off by the numerous negative comments (especially on here). But when I compared the G5 with its competition (Nikon, Sony, Olympus etc) it was clearly a hands-down winner in terms of overall features and image quality. So why the bad reviews? Because this is a series, G1, G2, G3 and some reviewers here are comparing this camera against its predecessors. So yes, G3 users may be disappointed with the G5, but only because they've been spoilt with the G3. Giving the Canon G5 1 or 2 stars is plain silly. This is a 5 star camera, and it knocks the socks off its competiton. When reviewers give ratings, they ought to rate the camera on its own merits, or compare it to its competitors, but to give it a low rating becase it doesn't live up to elevated expectations is wrong. It is also very unhelpful to potential buyers who may be put off by the low rating, buy another brand, and end up with a camera that is \"surprisingly good\" and \"surpassed expectations\", but which is sadly inferior. Disappointment noted, but the G5 is clearly the best in its class, and well deserving of 5 stars.", "Date": "August 19, 2003"}, {"Title": "Good all-rounder for serious amateurs", "Author": null, "ReviewID": "R2DUZFSZ9V6IMQ", "Overall": "5.0", "Content": "Buying a camera, like buying most things, is a trade-off - there is no single right answer. On one hand, it's \"horses for courses\" (get something suitable for the type of photography you plan to do). On the other, we each must weigh the features of different models against each other, prioritize our personal wants and preferences against the price, and decide what is best for us. It's subjective and personal.I had already had a Canon Powershot S20 for a few years when I decided to get a Canon G5. Why should I want to do that? Was I dissatisfied with the S20, with its limited manual operation features, 3MP resolution and 2× optical zoom? No; I had originally planned to keep both, but I have found that the G5 is not so much bigger after all, so I am going to sell the S20. I just don't need both of them.While the G5 is still a small camera, there are many things it can do that the S20 cannot. Of course, there are still a few things the G5 cannot do, but for the general sort of photography I do, they are not many.Here are the main issues, chosen partly in the light of other users' (sometimes negative) reviews of this camera:1 Do I need 5MP resolution? Yes - mainly so I can crop a good chunk of the original image when I need to, which is quite often.2 Do I need the 4× optical zoom? Yes. I don't have the wide-angle or tele lens converters yet, but I may get them later.3 Do I need the fully manual control and the many focussing and exposure options? Yes - quite frequently (more often now that I have them, of course).4 Do I like the ergonomics and aesthetics of the G5. No question. A few minor quibbles, but nothing serious.5 Good value for money? I think so. Actually I think that most competing products are also good value for money. We get more for our dollar in photography now than ever before.Comments on some specific complaints that have surfaced in other reviews:1 Chromatic aberration (manifests itself as purple fringing under certain light conditions): I conducted a very thorough review of reviews before I bought this camera, and I decided to risk it. I am glad I did. The problem exists, but under practical (not test) conditions it is rarely noticeable. You may see it in very contrasty parts of a picture (e.g. bright lights against a dark background) when you are using an aperture wider than about F/4. This problem seems to be somewhat worse in the G5 than in some other cameras partly because it has a faster lens, which I hardly see as a fault. In all other respects this lens is as good as any, and better than most.2 The noise issue: at higher gain settings (`film speeds'), all digital cameras show increased noise. The G5, according to some reviews, is rather worse in this than some other cameras. However, according to the same reviews, the G5 shows higher gain than most other cameras for any given setting. ISO 400 on the G5 actually seems to be about ISO 700 on other cameras. In the end, I could not really see any difference in normal use. I use ISO 50 most of the time anyway.3 The viewfinder: to avoid getting part of the lens barrel in the viewfinder at wide angles, the viewfinder would need to be located further from the lens, which would require a bigger body, or else you would have to have a smaller lens. It's just another trade-off. Some cameras avoid this problem by just not having a viewfinder at all. There are times, however, when a viewfinder is the best way to frame the picture, at least for me. I can live with this.4 The lens cap: lens caps are a necessary evil with any lens that does not retract more or less fully into the camera. The G5 has a simple (but nicely molded, not at all cheap-looking) plastic lens cap that comes off quite easily. This is surely intentional, because if you turn the camera on before removing the lens cap, it gets pushed off by the extending lens without damaging the zoom mechanism.Overall rating? I'm giving it 5 stars, partly to offset some of the absurdly low ratings given by other reviewers. Otherwise I'd have given it about four-and-a-half.", "Date": "October 20, 2003"}, {"Title": "The Sweet Spot for Digital Point and Shoots", "Author": "Dom Miliano", "ReviewID": "R1D77UK6Z8KAG6", "Overall": "5.0", "Content": "I love my 2 Megapixel Canon Elph. Small, sharp and reliable - during its time, it was all I could ask for.  I even sold a couple of its pictures to magazines, so what's not to love?  While I have not discarded my Elph, I recently moved up to the G5 because it's better in every way. With a fast 4X optical zoom (all the way out to a 35mm-camera-equivalent of 140MM) and 5 megapixel chip, it could easily become my new favorite camera. The manual is thick but it uses a lot of illustrations and the text is surprisingly clear and simple so the reader should not be intimidated. Not being one to read manuals, I was able to take the G5 out of the box and immediately shoot pictures without cracking the book (the battery came out of the box with a decent charge too - how cool is that?) That's how simple and intuitive the camera is. I have already made a few 8X10 prints on my Canon color printer and they are sharp, show excellent contrast and have good color balance too. Like most auto-focus digital cameras there is a brief shutter lag. It's not too bad but the shutter release is certainly not as quick as one of my 35mm Leicas. Speaking of Leica, the shape and size of the G5 is very close to that of the classic Leica M series cameras. And the clever design of the battery case allows it to serve as a grip - I found it comfortable and secure. (Note: a similar grip is a [$$$]option on a 35mm rangefinder Leica!) I don't like the fact that you can't screw a UV, skylight or other kind of filter on the front of the lens. I like to have a good quality filter on the front of my lenses for protection - but that's me. For the average camera user, there are 2 auto exposure settings that should cover the vast majority of shooting situations. (I used \"P\" and got an \"included in the box\" 32mb compact flash card full of great exposures.) For the advanced photographer, the G5 comes with just about every manual control you could need or want - similar to those on their excellent EOS 1V pro camera. One cool feature is the ability to capture a shot in both RAW and JPEG at the same time. This feature will give you a \"pure\" file with no data loss due to compression and will allow you to make the largest, sharpest print possible. (The manual says that the RAW file is compressed, but there is no data loss - must be a new form of Japanese magic!) Bottom line, the RAW format will give you the biggest file with the most information. I suspect that a RAW file will allow the careful user (i.e., one who is fussy about focus, exposure and camera shake) to make an 11X14 inch print that is as good as any 35mm camera (maybe better!)  When compared against the many excellent digital cameras out there, the Canon is a stand out. Its size, resolution, simplicity, and Canon's excellent reputation for reliability made it and easy choice for me.", "Date": "January 14, 2004"}, {"Title": "Canon G5 is GREAT", "Author": "G. Fiedler \"Genevieve\"", "ReviewID": "R299KNMJADAWGD", "Overall": "5.0", "Content": "I got my Canon G5 on 7-23-03 and I love it.  I took some photos as a test to compare it to my Canon G1.  WOW, what a difference.The depth of field has improved a LOT.  Now, you can photograph the same road, and see a 1/2 mile down the road in clear focus rather than a blurry end.  You can pick out license plate #s two blocks away from where you took the photo.  Ever taken a photo of a purple flower and had it come out blue and awful?  I took photos of some purple flowers and they came out crisp and gorgeous deep color purple.  Like to photograph insects?  WOW, you get to see them CLOSE UP.  The macro function is astounding.  You can see the detail of fly eyes and misquito wing structure.  The detail on my cats teeth is totally awesome using the macro function.  I can see every bit of smile and every little scale on his tongue.  Like photographing nighttime views over a moonlit water?  MAN, it is so awesome using the night scene mode.  You can get moonlight over the ocean and buildings lit up over the bay in clear focus with no pixelation.  They must have fixed that.About the fringing and the noise - if you take photos with a film camera, you know how tough it is to get a good photo at dusk or in shadow.  The digital camera is doing what you tell it to, if it isn't coming out right, try a different time of day or use the flash!  If you are photographing a building against the sun, DUH, it's going to have fringing around the edges.  The sky will look white if you photograph an object with the sun behind it.  Try using the white balance controls - this camera has so much you can test and try out.  Read the manual.  Try every function on the camera before you give up.  Having trouble focusing?  The dumb Conversion Lens Adapter LA-DC58B made especially for the Canon G5 is to blame, in my opinion, because when I take it off, WOW, OMG, the photos are perfect.  I think the adapter blocks the focusing beam.  Pros - quality, crisp, clear closeup/macro photos, great depth of field in focus, rich color tones, tons of functionsCons - a lot to learn in order to use it properly , but the best things in life require work, time, and dedication.", "Date": "July 26, 2003"}, {"Title": "Best price/performance ratio", "Author": "LuckEDoggs", "ReviewID": "R3E73OJSKGC5QR", "Overall": "5.0", "Content": "I've been using this camera for 3 months, and have clicked about 1600 photos as of yesterday. Here's my take on it.- The lens is amazing. Fast and crystal clear. In digital cameras, the lens quality is more important than the mega-pixels beyond a certain point - for me personally that's 3.2MP- The battery lasts forever compared to other cameras in this range.- Tons of features, with amazing customization and configurability. I've taken beautiful photos in extremely low light conditions to very still pictures in high motion environments.- Very capable.- The package comes with everything you need. All the cables, remote control, charger, ac adapter etc... The only thing you have to buy is a big memory card.- The software drivers are nice, but the rest of the software is pretty useless. Download picasa ([...]) - it's better than iPhoto and is now free.- It is big and bulky (smaller than an SLR, but bigger than the S50). I bought this instead of the small S500 - at the time they cost the same; and have no regrets. The capabilities are worth the extra bulk.Read all the reviews of the purple fringing and chromatic aberrations. Here's my take- all cameras have them- personally, I've never noticed it.- the pictures look great when printed out or on the screen.- if you really want, you can fix them using software.", "Date": "August 31, 2004"}, {"Title": "nice camera but various compromises", "Author": "Amazon Customer", "ReviewID": "R3H3TN0OHPVPW5", "Overall": "3.0", "Content": "I bought this camera knowing its drawbacks, and would still buy it again, but just so you know, here are the issues: (1) the wonderful lens is completely exposed w/o the lens cap and the lens cap falls off very easily--it has to, because if you press \"on\" without removing the lens cap, if the lens cap didn't fall off as the lens extended, the gears would strip. (2) to fix the first issue, you can buy the lens adapter and screw on a 58mm filter but this adapter is so large that it interferes with internal flash coverage, creating a black cast in the bottom right of pictures and also, it makes the optical viewfinder unusable. (3) even w/o the adapter, when using the optical viewfinder, the lens blocks a small corner of the view on widest angle. Why use the viewfinder? If you're following action, LCD displays may not have quick enough response from picture to picture. You might want to wait until the replacement for this camera comes along, sometime in the Spring I hear. (Addendum Feb-04. Check out the new Canon Pro-1!", "Date": "December 20, 2003"}, {"Title": "Gets the Big Things Right", "Author": "\"donnygee\"", "ReviewID": "R36NLBDWKEW23G", "Overall": "5.0", "Content": "Bought the G5 after an intensive search, comparing w comparably priced Nikon, Sony, Olympus, among others, having owned the Olympus 3040 for several years.The G5 has a few quirks that some enjoy beating Canon up over: yes, on wide angle shots looking through the viewfinder you see a (small) piece of the lens; yes, the G5's major enhancement over the G3 is a mere megapixel; and some speak of noise at higher ISOs and chromatic aberration in some pics that one would not expect in a $600 digital. I haven't seen a hint of noise (shooting primarily at 50 or 100 ISO) or chromatic aberration after hundreds of pictures, and one quickly adapts to the tiny piece of lens one sees in the viewfinder at the wide angle.How about what's right?1) great pics--vibrant, detailed and sharp2) a fabulously flexible LCD that makes taking pictures from any angle a breeze (not to mention the delight my 5 year old gets in seeing herself as I take the pic.3) excellent, easy-to-use software, light years ahead of the Olympus software I had been using4) coherent, reasonably well written and helpful manuals5) wealth of exciting and genuinely useful features--including ability to convert a shot to RAW after you've taken it, 4X optical zoom (35-140), easy menus to navigate, controls that make sense on the camera body, great panorama function (with excellent software--it works!), strong flash (for a compact), and a whole lot more.This camera delivers high quality pics, sophisticated features, a well-designed body at a size that still fits in the pocket and all at a reasonable price, given what you get.  Highly recommended!", "Date": "December 16, 2003"}, {"Title": "Very good, but not perfect", "Author": "Jeff \"jack of many trades\"", "ReviewID": "R1ELKTRMO5R4Q9", "Overall": "5.0", "Content": "If I could give this 4 1/2 stars, I would, but I can't.  The G5 is a great digital camera for all kinds of users, however is simply too much camera for most people that will want to take snapshots; many people won't even touch on using or even understanding all of the features the G5 has unless they have some photography experience.The lens is quite good, it's very sharp no matter the aperature used, the autofocus is of average speed, and the zoom is roughly equivalent to a 35-140mm on a film SLR - you get a pretty good range of focal lengths as long as you don't need wide angle or extreme telephoto shots.  Bokeh is okay at wide aperatures, but don't expect it to compare with a good SLR lens, because it won't.  Macro shots are very good, with little distortion, sharp focus, and decent bokeh.Image quality of the pictures is excellent - colors are balanced and realistic, and edges aren't oversharpened at all, 8x10s look fantastic but I have yet to print anything larger (The G5 should be able to make a nice 11x14 print).Featurewise, the G5 is very well rounded - it has a full auto mode, which works quite well, except the auto exposure for shots using the flash tends to overexpose the picture (This does not bug me since I usually use manual or priority modes), it had a program mode which gives you some control over the camera settings, and various manual modes including full manual, aperature priority, shutter priority, and also several scene modes for taking portraits, night landscapes, and more.My biggest complaint with the G5 is that it takes very noisy pictures at a given ISO - ISO 400 is utterly useless for taking shots because they are so grainy, ISO 200 is usable but I wouldn't print an 8x10 with it, and ISO 50 and 100 are okay - this camera is great for outdoor shots but if you need something to work with inside without a flash, you are better off with a D-SLR of some sort.Ergonomically, the G5 is great, it's well built, easy to hold, and all of the controls are easy to reach and intuitive.  There are numerous functions however, and it will take most people a while to become accustomed to and comfortable with all of the camera's features.  The flip out LCD is a very useful feature, and it has helped me take many shots that I couldn't have made otherwise.Overall, it is a very good all around digicam, but for some people with specific needs (Long zoom, wide angle, indoor shots without flash), there are better choices.  I strongly reccomend this for people with photography experience, but it is complete and total overkill for someone that wants to take snapshots.", "Date": "January 24, 2004"}, {"Title": "Aesthetic upgrade, except for faster response times", "Author": "Shashank Tripathi", "ReviewID": "R3MJQGZ4STPGZ7", "Overall": "4.0", "Content": "It is simple. Nikon makes the best SLRs. Canon makes the best digital cameras. This is particularly true in the prosumer range, where Canon's Powershot Gx series beats them all with its ease of use (both hardware and software), in looks and holding comfort (which is a subjective opinion, and this is mine), in the sheer realism of the pictures etc etc. I own both the G2 and the G3, the latter being a upgrade more for the purposes of competitive response than anything else -- different bodyline, somewhat higher pixel ratio etc. Now, G5 may come across as the same with little to show for, except its black paintjob and the insiginficantly higher pixel ratio. A tad disappointing for us Canon aficianados who were expecting a bit more from the next in the series. WHAT'S NEW: (1) Black body. Personally, I have gotten used to the silver finish, which appeals to me. I hope Canon doesn't standardize on black and makes the next cam available in both colors. (2) More \"megapixels\" (of course). Which doesn't really mean squat unless you wish to print your photographs on 20 x 30 photopaper.  (3) Video recording with sound for 3 minutes (actually G3 can manage about the same).  (4) This could be an important factor to some of you who believe digicams haven't yet reached their prime given how pathetic their focus speeds are -- G5 rocks in terms of instant clicking. G2 was painfully slow and effectively useless for sports photography for instance, G3 was a remarkable improvement, and G5 now is almost as good as EOS in its response time. Summary: what can I say. Great camera from Canon, but falls short of being spectacular as an upgrade. If you already own G2 or G3, wait for the next in the series by when let's hope the clicking response times should match EOS and other digital SLRs. But if you are in the market for a new digicam, this is easily the best on offer in the semipro category (as are G2, G3 etc if Canon does not make them obsolete).", "Date": "June 23, 2003"}, {"Title": "disappointed", "Author": "C. Brown", "ReviewID": "R2S2L3446F20IU", "Overall": "3.0", "Content": "I bought this camera to replace a 2mp camera that allowed no control over aperture and speed and to give me the greater resolution that would allow larger than 8x10 prints. I was very pleased with the menu structure and layout of the controls but I was very surprised to see the lens barrel visible through the optical viewfinder, obscuring the lower left part of a shot unless the camera is zoomed in. The lens is outstanding, and shots taken at ISO 50 are wonderfully free of noise even in low light. What killed the camera for me is the autofocus. For some reason it often has a hard time finding focus. In several situations from macro to landscape and at various light levels the autofocus would hunt for seconds and then occasionally would give up and lose focus entirely. The conditions mentioned in the manual that might cause difficulty with focus were not present. Of course, I could focus manually but that can be a tedious task using the LCD display (and not just with this camera), especially in bright light. The camera has a good feel and is easy to use but I finally gave it up from the frustration with focus. I bought an Olympus C-5050 which is not quite so easy to use but the autofocus is rapid and reliable. I frequently see a shot where I must get the camera out and on it quickly and the G5 couldn't be counted on.", "Date": "September 18, 2003"}, {"Title": "full featured \"compact\" digicam with 5MP!", "Author": "jemaerca", "ReviewID": "R2XBFK8WSF2QLH", "Overall": "5.0", "Content": "this is a full-featured camera that you use as a point-and-shoot and still have the flexibility to be more creative when you want.  this fills the niche between the excellent canon s50 5MP digicam and the d-SLRs.  pros:- excellent resolution from a small lens - 5MP power!- 4x optical zoom- good metering and good tonal balance - maintains shadow detail- good natural light white balance, strong and balanced colours- allows control over cameras internal processing algorithms - saturation, tone, sharpness- fast lens (F2.0 - F3.0)- low noise at ISO 50 (keep in mind that ISO 50 for this camera is actually ISO 100 for everyone else; likewise, ISO 100 is in reality closer to ISO 200, etc)- shooting priority play mode - simply half-press the shutter during playback and you're ready to shoot- impressive range of manual controls- very good shot-to-shot times, considering the larger files due to the higher resolution- nice metallic black finish - i definitely prefer this to the silver finish of other compact cameras- great fold-out LCD: nice and bright PLUS it folds away when not in use (less likely it'll get scratched)- fairly good startup time, especially for an extending lens camera- the manual focus has magnified loupe and ruler readout- flexible continuous shooting modes (buffer after processing)- RAW file format maintains 12-bits of data- ability to turn JPEG shot into RAW during record review- Compact Flash Type I/II and official Microdrive support- voice annotation feature- has a hot-shoe that allows the use of an external flash- invervalometer (time lapse capability)- AF assist lamp works well- has an included IR remote control- nice optional accessory portfolio to choose from- excellent battery life- USB connectivity cons:- where's the nine-point AiAF that's standard in Canon's own S50?- you'll need to remove from tripod to open the battery/CF compartment- AF Assist lamp doesn't have enough power at telephoto zoom- viewfinder partially obstructed by lens barrel- zoom controller does not have enough steps / multiple zoom speed you would choose the G5 over over the s50 if you value flexibility over compactness (and you don't want to go all the way to the d-SLR range).you would choose this over the G3 because of the higher resolution, which more than makes up for the higher noise levels of the G5.  this is a fantastic camera - highly recommended. enjoy!", "Date": "August 3, 2003"}, {"Title": "MUST to READ, G5 for all, or just like any other CANON", "Author": "Marjan Kotorcevik", "ReviewID": "R24FSQ0JTMY4JO", "Overall": "5.0", "Content": "Hi everybody.I may make few spelling mistakes, but my review for G5 is sharp, true and clear.Let's get started. I bought G5 and I am happy about it. I red prefessional reviews and comparisons and let me tell you something. Regardless what they say about purple fireing and increased noise, canon G5 gets the sharpest and cleanest picture of 5 megapixel sensor out there. I even compared it with fuifilm s7000 (6.4 megapixel camera), G5 brings more details and better colors. The shapes of the objects are original and edges don't diffuse like all other cameras of this price range (+ - $200) except canon digital rebel 300D. All other cameras have problems either with their not enough bright lenses or not as good CCD sensor. They all try to compete with canon and this is how cheap they do it...>They run noise reduction algorithms before the picture is being saved in memory and their pictures loose lots of details, objects loose edges and their pictures look more like a painting. This is why canon has the sharpest picture. If you take orginal G5 photo in photoshop and do noise reduction, the resulting picture will have a micro low noise, far less than any sony, nicon, olympus, or anything else out there, while still keeping the sharpest picture compared to all cameras above. The profesional reviewers fall for this as I can see from what I am reading, and they rate canon g5 as having the sharpest picture but worst noise, sending wrong message to readers about the canon true quality. In fact canon g5 original picture has far the least noise from its 1.8 inch CCD, however canon technicians don't run noise reduction algorithms and leave this option up for users. Or just do this - set up low sharpness mode and you will get the most noise free pics compared to the competition while still being the sharpest.If you ask me I prefer high sharpness, which increases the noise slightly, but improves the contrast and sharpness of the picture. When you print out picture like this you will get the best looking prints since noise levels come in question only if you zoom in the picture in your computer, but for the droplets of the printer good color and sharpness is what counts the most for best prints.If you are looking for better quality and original noise free pictures buy digital rebel 300D. I didn't buy this camera only because my dad would kill me thinking that I spent a lot of money for a camera. Another reason was that this one is smaller and fits very tight in a little bag, making it perfect for \"bring me anywhere\" while having the image of a turist and photo satisfaction of a pro.Made one mistake though....>>>>>>Didn't look at canon S50 - the best value on the market. I give it 6 stars for the price matched with its quality, size and weight. Listen to me. Buy S50 today - or wait for even better deals.", "Date": "November 10, 2003"}, {"Title": "Great Camera But...", "Author": null, "ReviewID": "R269X3FPH1PDF4", "Overall": "4.0", "Content": "This is a great camera but you have to work with it. The build is solid the optics are great, and the buttons and menus are very easy to navigate. I have printed slightly cropped 8x10's and the image quality is amazing many people have thought they were originally shot with film.I only have two problems with the camera  1) The autofocus really does not work well in low light but with a little practice you can use manual focus so I am not to concerned with this anymore.  2) lots of noise above 100 iso. This is not a problem for me as I generally shoot macro or landscapes which I have not needed high iso's for.  So other than these two things the 1000 plus photos I have taken in the last 3 months have completly amazed me.P.S. This camera does it's job extremely well but if you are like me it will only increase your thirst for a digital slr.", "Date": "March 6, 2004"}, {"Title": "Great camera - some disadvantages", "Author": "bm97", "ReviewID": "R2PC6Y2FB1N224", "Overall": "4.0", "Content": "For the price, there are a lot of good cameras available. The G5 scores highest on picture quality, and the level of control you have over your photographs. I did end up choosing the Fuji S7000 because I got a great deal - nearly $100 less than the amazon price for the G5. Also the Fuji has better zoom, and is much faster. However with a smaller $ difference - maybe $50? - I might have chosen the excellent G5. The 600+ shots I got to take with this camera left me really impressed.The G5 has an excellent instruction manual that actually teaches you a thing or two about digital photography every time you look through it. The camera's menu is intuitive and easy to use. I have compared this camera with a few including the Nikon 5400, the Fuji S7000, Kodak DX 4490, and a few others and found it easiest to get \"true\" colors from the G5(I am still struggling with the Fuji). The high quality LCD will show you a fairly accurate representation of your photograph. Nine out of ten digital cameras do not do that. The LCD also swivels - great feature to have if you want to avoid scratches. There are some disadvantages as the other reviewers have pointed out - like the flash getting blocked by any lens attachments, camera being a little too big to carry around conveniently, limited zoom, difficult to hold in one hand, etc. However if picture quality and control are important, the G5 is hard to beat at the price.", "Date": "April 6, 2004"}, {"Title": "Sharp but with problems", "Author": "J Ken Kuzenski", "ReviewID": "R302XG9B42WJWU", "Overall": "3.0", "Content": "I ordered a G5 for work--we do a fair bit of digital imaging.  We were very impressed with the resolution and sharpness of the images.  I was reasonably pleased with the interface, though the other person who tried the camera thought the menus were too complex.  HOWEVER .. this camera had very pronounced chromatic aberration showing at the boundary of light and dark areas in high-contrast situations.  The dreaded \"purple fringing.\"  We had to send the camera back.  It may be that this was an early lens or coating and this will be fixed in cameras produced later than the one we bought (December 2003).  And it might not bother some users at all.  But we thought it was unacceptable for a $600 camera.  :-(", "Date": "January 21, 2004"}, {"Title": "The G3 is better, but most won't believe it", "Author": "James H. Lipsey", "ReviewID": "R2R05JOYRX3F07", "Overall": "3.0", "Content": "Many people will find it hard to believe that they're better off with the nearly identical 4 megapixel G3. Reviews by dedicated digital photo sites conclude that the G5 introduces significant noise into images causing the effect of extra resolution to be cancelled out by the degradation in image quality. Canon had to produce this camera because of our obsession with pixel count and in spite of the fact that all of the reviews of the G3 conclude that its combination of a clean sensor and excellent optics give it an edge over most 5 MP camers.Furthermore, very few people actually need 4 megapixels, much less 5. I had a hard time accepting this myself, until I printed out a couple 8x10s from my G3. 5 megapixels will simply mean that your memory card gets filled sooner, and each image will take longer to write to the compact flash card. Unfortunately, people look at pixel count much the same way as they do processor speed in computers. This is why we see folks buying P4 machines with 15\" monitors and 128MB of RAM.The G3, with its less noisy sensor and lower price is the sensible choice. It's a better camera for less, but most won't see it that way.", "Date": "July 11, 2003"}, {"Title": "A fine camera, but you can get more and better for the money", "Author": "Rudy \"pain-doc\"", "ReviewID": "R3ODP8VWETTOPK", "Overall": "4.0", "Content": "NO, I bought the G3 rather than the G5 because of some less-than-favorable reviews of putting a bigger engine in the same frame. The G5 [other than for the black drag] is a Powershot G3 with a five- rather than a four-megapixel CCD sensor. Canon seems to have put just a finer-grained CCD in the exact same body as the G3, causing chromatic aberration and increased digital noise, with little gain in picture quality, in an effort to keep up with the competition. My suggestion is either to get a G3 (top rated by Consumer Reports) at a great price, or wait for Canon's sure-to-come-soon top quality prosumer camera with larger CCD.The G5 is just an annual model change, rather than a genuinely new revision.", "Date": "November 20, 2003"}, {"Title": "Excellent value, awesome pictures....  but....", "Author": null, "ReviewID": "R34GLZA1LRSX1T", "Overall": "4.0", "Content": "Camera takes awesome pictures right out of the box.  Best value by far in it's price point.  However, the autofocus was just too slow for me.  I shoot mainly action shots, kids sports, moving objects etc, some low light stuff too.  It was common for it to take 4+ seconds to focus in standard room lighting in Auto mode.  I went to a local store and tried the Cannon Digital Rebel.  If you've got the extra $350, do it.  I was totally amazed with the Rebel.  Focus was next to instant, and image quality was the best I've ever seen.  I returned the G5 and am waiting for my Rebel!The G5 is no slouch, and at $650/5MP, you can't find a better camera in my opinion.  Just wish the focus was a little quicker, because I loved everything else about the unit.", "Date": "October 28, 2003"}, {"Title": "Wonderful Camera, Great Value", "Author": null, "ReviewID": "R1B1TE0B2FOB6K", "Overall": "5.0", "Content": "When I was researching cameras, I wrote out a list of requirements that my camera had to have: high quality shots, sturdy build, easy to carry, hotshoe for additional flash, ability to add filters, rapid shot feature, manual and automatic settings, movie settings, red eye flash, timer, programable white balance, 3-5x optical zoom (has 4x), and takes CF cards (cheaper than other memory cards). When I entered all my requirements into [...] only 2 cameras showed up that met my requirements. After comparing the photo quality of the 2, the G5 was the obvious choice. Before getting my G5, I had taken less than 500 pictures in my life. Now, after owning this camera for almost 2 months, I've taken well over 2500 pictures. Yes, 2500. It's just so easy to take a great picture with this camera that you will enjoy taking it with you everywhere!", "Date": "April 1, 2004"}, {"Title": "Who needs a digital SLR?", "Author": "josh e. \"mkeastman\"", "ReviewID": "R25AKF0X3BJDXZ", "Overall": "5.0", "Content": "I am not a professional photographer, but I love taking artful and beatiful pictures. This camera is allowing me to fully learn the art of photography. It is versatile enough to allow me to try anything I want to.I would say that this camera is more than needed if all you want to do is take point and shoot snapshots. You can do that with this camera, but you can do so much more.For someone who, like me, is becoming a serious amateur photographer I would say this a great camera. I have been very happy. I would also say get a photography how-to book. I'm reading \"The Basic Book of Photography\" by Tom & Michelle Grimm. Read that along with the manual that comes with the camera and you can use all the knowledge from the book.Get Photoshop Elements and a companion how-to book. I use Scott Kelby's Photoshop Elements for Digital Photographers. With Photoshop you can make a good picture look great.Get a quality photo printer. I got Canon's i860. It does a fantastic job at making gorgeous prints, and it's quick.With all of these compontents a whole new world is opening up. If you have a Mac, like me, all of these components work together seamlessly.The camera is fun and easy to use. I would recommend it without hesitation to anyone interested in getting serious about photography.", "Date": "February 17, 2004"}, {"Title": "A couple things you don't hear about", "Author": "ness", "ReviewID": "R19GASMAWCY3M7", "Overall": "4.0", "Content": "There's plenty of repetition in the reviews you'll read about the G5. Here are a couple thoughts I haven't seen expressed yet. First, this is a compact camera, and that means the lens is made to tuck well into the body. The protective shell only extends part way out to keep the profile slim, so the fragile lens is somewhat vulnerable when extended. This is also the case with other maker's compact cameras. One solution is to add the lens/filter adapter, but if you've got any sense of style you'll be put off by its contrasting gray color. This, by the way, is the only way to add a protective UV or other filters - the lens barrel itself is not threaded. For a camera at this price and with these capabilities, the user should have a threaded barrel and sturdier lens construction. Second gripe is the placement of the controls on the back of the camera. I have average sized hands, but my thumb constantly bumps either the white balance or set buttons. It's more of an annoyance than a problem though, because they keys rarely engage from the contact.Canon clearly recognized both these issues, because they've fixed both in the new Pro 1.But don't let these turn you off. It's a fine, full featured compact camera.", "Date": "February 12, 2004"}, {"Title": "Full-featured but clumsy...", "Author": "Stratman \"Don\"", "ReviewID": "R150O628W2QSYK", "Overall": "3.0", "Content": "I've been disappointed with this camera.  While it has an abundance of features, the controls are annoying and confusing in many respects.For example, the auto shutoff delay, which is relatively short, can't be adjusted: if you opt to have it enabled, count on the camera being off just when the perfect picture presents itself.The on/off and zoom buttons are small and clumsy to use.  Other controls are nonintuitive: expect to spend a lot of time with the manual.Serious purple fringing is evident in the images, a dissapointment for a maker of Canon's reputation.I'm not a novice: my first \"serious\" camera was a Minolta SRT-101 (in the late '70's), and I've since owned a succession of Olympus, Nikon and Canon SLR's.  Currently I use a Canon Elan 7 for film photography, and it's a fantastic camera.  Prior the G5 I was using a Kodak DC 4800 3mp model for digital photography: it was much easier to use and the image quality was nearly as good as the G5's.If you're considering this camera, be sure and take it for an extended test drive to make sure the controls suit you.", "Date": "February 28, 2004"}, {"Title": "Canon keeps the lead", "Author": "Michael J. Edelman", "ReviewID": "R1ER5DAIDKGCZ0", "Overall": "5.0", "Content": "The G5 is an incremental improvement over the G3 model rather than the revolutionary jump some Canon users were expecting. G2 and G3 users (other than the gear-obsessed) probably won't be lining up to trade in their cameras, but new users, or those upgrading from 2Mpixel cameras will find the G5 to be an excellent choice. It's still not quite the ideal compact for my purposes. The zoom range, equivalent to a 35mm-140mm lens on a 35mm camera, just isn't wide enough for what I want to do. I'd rather sacrifice the 140mm end and get something with a perspective equal to a 24mm-100mm lens, which would give you a long enough focal length for decent portraits and provide a good wide angle for indoor shots and landscapes. That aside, this is still an excellent camera for someone coming over from film. Resolution is sufficent to produce really excellent 8x10s with a little Photoshop fine-tuning. The manual controls are all you'd ask for. The fast f/2 lens allows shooting at high resolution in dim light. And the ability to link to the various Canon TTL flashes proides for exceptional control over lighting. So while I'm not quite ready to trade in my G2, the G5 would certainly be my first choice if I was moving over from film or a lower resoltuion camera.", "Date": "July 10, 2003"}, {"Title": "Canon G5", "Author": "D Studios Photography & Digital Processing", "ReviewID": "R33Z89IV9XVXYY", "Overall": "5.0", "Content": "Wasn't sure if I wanted to buy the camera due to critical information that people have gave the product dissing it and giving bad opinions so I talked to a few professional photographers on the G5 and they had said it was well worth the money for being the best Digital advanced point and shoot so far by Canon,having 12 Eos based features as well.As an amateur photographer I have no regrets at all, it is an awesome camera!", "Date": "August 22, 2003"}, {"Title": "Second G5 I have bought and love it!", "Author": "J.D.D", "ReviewID": "R31CV13YY9J9S", "Overall": "5.0", "Content": "Long review, but I made it funny and informative just for you!Just understand ANYTHING you buy, there will always be something out there worse AND better than it.  There ARE cameras out there better than the G5.  BUT..for what this camera can do, it rocks.I fought in Operation iraqi Freedom on the ground in combat, and had this camera with me in the desert for over a year and not one scratch on the lens OR LCD screen.  Most of the other guys had these dinky point and shoot cameras than had no manual controls on them.  Sure they took good pictures as well, but try to adjust manually when the sky turns dark, and you want that perfect shot. The G5 is awesome.  Just awesome.Its been dropped, stepped on, left outside in the rain, and its still working!  I wouldn't recommend you try this, but its good to know, right?The G5 isn't a $5000- 49 megapixel 5 star fleet commander camera your friend might have bought to impress everyone, but when it comes down to great pictures, DURABILITY, protection of the LCD screen, and manual controls...it beats them all.Let those individuals who think its all about the megapixels buy those fancy laser guided, 22 megapixel cameras. Its just going to be 'obsolete' according to what the manufacturer says in a year anyway; you're G5 will always work, and Why???  BECAUSE GET OVER THE FACT THAT UNLESS YOUR A PROFESSIONAL PHOTOGRAPHER TAKING PICTURES OF TOM CRUISE ACTING LIKE AN IDIOT, NO ONE NEEDS OVER 5 MEGAPIXELS, not today, not tomorrow, not in 300 years.Just because its 2007 and not 2004 doesn't mean we as consumers need any clearer photographs.  If they get any 'clearer' our pictures are going to be invisible!!  In 2045, a 5 megapixel camera is still going to take awesome shots.  Besides, the Hubble Telescope's 'Wide Field Camera' only uses ONE megapixel and look at the shots it takes!  Ya, thats right cousin John, always bragging about your 10 megapixel piece of crap.The whole concept of 'MORE' megapixels is just those idiot companies trying to get us to spend more money we don't have.In my opinion, as an owner of 2-G5's, (bought the second because after surviving iraq, I dropped it in my pool; yes im an idiot, i know) if you want a camera thats going to last, go with this one.And one last thing, when your family members or friends pull out their 40 megapixel government issued, super-expensive digital Pro XLX-2000 camera, bragging about how they can print 400'x400' posters, just slap them across the face, take a picture of their shock with your G5, and walk away laughing.", "Date": "January 11, 2008"}, {"Title": "Compare to Nikon 5400. HA HA HA!!", "Author": null, "ReviewID": "R33Z5M5IOR4JYM", "Overall": "5.0", "Content": "I had to write this to laugh at the guy that said the Nikon 5400 is better.  Yeah it is, just don't plan on taking any pictures indoors, or in any poor light!!  The POS Nikons don't have AF assist.  If Nikon does not get on the ball, they will start losing market share to Casio.The G5 is a great camera.  Funny how people say the S50 is better also, or any of the small P&S cameras.  I have a little piece of info for ya'll, most are locked at 50 or 100 ISO, that's why there is so little noise.Keep your G5 locked at ISO 50, and it will blow them all away!!", "Date": "October 11, 2003"}, {"Title": "Good Full Feature Camera, Some Issues", "Author": "Thomrho", "ReviewID": "R27K8O5V091U5S", "Overall": "4.0", "Content": "I have been really happy with the overall performance of this camera.  I love being able to change how many pixels I want for my photos.  I frequently will use the 5 pixel function so that I can later crop photos as necessary.  Sometimes I wish that the camera were smaller.  Also, we had to send the camera back to the manufacturer because the battery closure warped and the camera kept losing power.  They fixed it quickly and for free.  I was happy with the service.", "Date": "September 19, 2004"}, {"Title": "Great camera, but not so good a user interface", "Author": "Dilip S. Kumar", "ReviewID": "R12K8PQIODDNO3", "Overall": "4.0", "Content": "Let me start by saying that I bought this camera because we couldn't get the PowerShot G3 in time (for the price I wanted). I was more than content with the 3.x Megapixels and wasn't looking to buy a 5MP camera.That said, the G5 is a great camera, with many features that will make your mind boggle (time spent with the manual will definitely come in handy - btw, this is one of the better manuals I've seen). It comes with with an Automatic mode (read as mode for dummies who don't want to deal with aperture, speeds, modes etc.) or you can choose different modes (landscape, portait, nightshot, stitch assist etc...). The controls for these modes is on the top of the camera and is designed well. I tried all of them and it does make a difference compared to the default mode. The stitch assist was also easy to do with the software that comes with the camera. I doubt it that I will use this feature again, but it's nice to know that it exists if the need arises.I was able to get the camera up and running quickly and transferring photos to the computer is a snap (just follow directions - equally well written manual) and you will be fine. What is not designed so well is the series of buttons at the back - specifically the White Balance (WB) and Menu. My hand tends to hit the back of the camera when you are taking shots. Also on extended zoom the lens is unprotected, making me a little antsy.Overall, I feel that this is too much camera for me. I still give it the 4 stars because it takes great pictures (get a 128MB memory stick as the 256MB memory stick has caused problems in the past - the 32MB that comes with it will not be adequate), it is easy to transfer and create an online photo album and the prints (4X6 as well as 5X7) that I developed are decent.", "Date": "March 6, 2004"}, {"Title": "After a year, no regrets.", "Author": "Richard", "ReviewID": "R3O6HBWVDN5ZPO", "Overall": "4.0", "Content": "The lens seen through the view finder I knew about before purchase so I cant complain about that.The Selector icons (auto, portrait etc.,)wore off after only a couple of months!! Cannon did replace the selector gratis, and I have now protected the icons on the top of the selector with a two part slow setting resin (72 hrs), this looks good and works perfectly.Apart from the above this is a great Camera and I have been very happy with it and have taken thousands of great pictures in the year I have had it.My friends wish they had my Camera and when they pull out their fancy Samsungs, HP's etc., there faces soon drop when they see what mine can do.", "Date": "July 10, 2004"}, {"Title": "Buyers Beware! Defects and voided warranty", "Author": null, "ReviewID": "R2QEQ9463ISDN3", "Overall": "1.0", "Content": "I got my G5 on August through Amazon. In December the LCD has stopped working, and a few days later the Camera completely stopped functioning.At the time I was travelling with my wife to Europe and Canon refused to service the Camera. Apparently you can only get US local service to it (they even don't allow shipping back to the States) and get this - I took this to Amazon customer service which warned me that by taking this Camera outside the United States, \"you void the manufacturer's warranty on this item.  This could make any future servicing of the item difficult and costly.\"Since we are due to get back to the States only in 3 months, and I need a WORKING camera to shoot while on vacation, not when I am home, I had to pay today $350 to fix it and replace the \"Optical Unit\".I will never buy a Canon product again.Sony gives you worldwide walk-in warranty, no matter where you are you in the world you go or call a local Sony service center and get your Camera fixed.Now, that Sony offers CF and not just MemoryStick and with the excellent reviews it gets from the user community, there is really no reason to take the risk with Canon. Their Cameras ship with defects and the service is the worst I came across so far.", "Date": "January 14, 2004"}, {"Title": "Worked for me", "Author": "Zia", "ReviewID": "R390NOY2AVD9R", "Overall": "4.0", "Content": "The camera has worked ok for me. I have been using it in my plastic surgery practice and it hasn't let me down so far. However there are a few short comings. First, it didnt come with a bag and i still havent found a suitable bag for it. Pretty mean of Canon ppl. Secondly the auto focus is sometimes frustratingly slow and sometimes just doesnt work. Third the flash is not good enough for indoors. It leaves the corners of the pictures dark.Having said that....overall its a good camera and does give good pictures", "Date": "July 8, 2004"}, {"Title": "Best Camera out there!!!", "Author": "Andrew Humeniuk", "ReviewID": "R26VN55D6AFV2T", "Overall": "5.0", "Content": "I bought the Canon G5 about 3 months ago, best digital camera i ever owned. I still have my ELPH S230 which I carry around all the time, but this one is capable of fully manual and automatic settings, you can do everything  with this little gem. I do not know why the lens cap falling off bugs people so much, would you rather take that great shot with the lens cap on? I would give this camera 6 stars if I could.", "Date": "July 5, 2004"}, {"Title": "Very good pictures do not see all of the bad press", "Author": null, "ReviewID": "R3O2UWAYZ75877", "Overall": "4.0", "Content": "I have had this camera for over a month now and all I can tell you is that if you are looking for a solid 5 MP camera, look no further.This camera is very easy to use but still gives you the manual control when you want it.  My largest gripe is the very poor lens cap.  I see why they make it so easy to come off, due to the lens pops out at start up but I think Canon could have done better with the design of this.Also, the gripe about looking though the view finder and seeing the lens if valid but I very rarely, if ever, use it and secondly only blocks out about 1/16 of the field of view in the lower left corner.In summary this is a great camera and I have no regrets about buying it!!!!", "Date": "October 8, 2003"}, {"Title": "Great camera!", "Author": null, "ReviewID": "R2CK4NZRANA157", "Overall": "5.0", "Content": "I upgraded from a Kodak DC280, which I loved. Kodak just didn't make anything that I felt was an upgrade to the 280. I compared all brands on market and went with this one. I am very happy so far.The zoom and clarity is great. There is alot to learn as far as the functions go, but that is to be expected. It does have a pretty easy \"point & shoot\" capability also.I wouldn't suggest this camera for a digital camera beginner, but it is a very nice upgrade for someone with a little more knowledge and higher expectations.", "Date": "August 5, 2003"}, {"Title": "Still Great After all these years!", "Author": "nikon fan", "ReviewID": "R3V47T22IOOP9W", "Overall": "4.0", "Content": "I bought this camera new in 2004, I like it then and I like it now. It may be getting behind in technological terms, but it is still capable of creating fantastic photos. This is my travel camera, I own several cameras and as the user name implies, a nikon user and huge nikon fan. But Nikon still to date has not made a point and shoot camera that a DSLR user who wants more control should buy. Luckily Canon has, in the Powershot G series cameras.I have used this camera since 2004 and it has been trouble free and never once has it not performed like it should. It gives me lots of control of my photo shoots, has RAW abilities, takes pretty good photos, and is very easy to use.I would recommend anyone who is looking for a camera that will give you the control you like, without having to take your SLR everywhere, look into the G series cameras. If you don't mind some older features, the G5 will do very well for you. Right now they can be found for around $125 or so on ebay, which I think is a real bargain for what you are getting in return. I plan to keep this camera until it just dies, or there are no more batteries, CF, cards or accessories available. That is another thing, you can still readily find all the accessories for this camera, and find them at a very reasonable price.I do not agree with others who have complained about the picture quality or excessive purple fringing, neither have ever been a major problem for me, and I am very picky about the quality of photographs I make. If the photos were not up to my standards, i would have tossed this camera a long time ago and moved on. This a is very nice camera, even today. You don't keep and use something for 6 years if it is not up to standards. Look into the G5 if you are looking for a useful camera that will give you control over your photos, and you can leave that DSLR at home from time to time.", "Date": "February 20, 2011"}, {"Title": "Canon Powershoot G5", "Author": "charles Johnson", "ReviewID": "R11JM9NMJBQN6N", "Overall": "5.0", "Content": "Using the G5 as a backup gives good quality images and allows for raw image capture. I really like it because it is a point and shoot with all the features of a professional SLR. Great camera even better price great deal for me.", "Date": "January 17, 2011"}, {"Title": "Very happy with this camera!", "Author": "smoky \"smokybluz\"", "ReviewID": "R32QW07RT7Y6YZ", "Overall": "4.0", "Content": "It's been a number of years now that I've had my G5 and I've been very pleased with it. At the time I purchased it, it was the only camera with all the features I was looking for. The pictures are very sharp, the colours amazing, and the battery seems to go on forever! I absolutely love the swivel LCD screen and use it all the time (it was the only camera I knew of that had it at the time of purchase and one of the big reasons I chose it). It not only allows for unusual photos but it protects the screen as well. The remote is also very handy! The manual is well thought-out and easy to use. It doesn't come with a case but I was able to find one (Lowepro) at a local drugstore that fit the camera, battery, remote and a couple of memory cards quite nicely!My only complaints are that it sometimes takes a long time to focus-if it does at all-when the subject is low contrast (mind you, even some of those shots come out beautiful in an abstract way). It's also a bit big to carry with me everywhere so I've recently purchased another smaller Canon camera (I'll review that one once I've had a chance to play with it). Also, the design for the memory card slot needs to be redesigned as it's very difficult to get the card out (the 'door' does not allow you to get a firm enough grip on the card... and I've got tiny hands! It must be even more difficult for those with larger hands). Other than that I've been very happy with this camera.", "Date": "May 22, 2008"}, {"Title": "Waiting for the price to drop", "Author": "Thomas D. Tippets \"Dadof7n2001\"", "ReviewID": "R1FS1W6IWW5WFZ", "Overall": "5.0", "Content": "I can't yet afford to buy this camera but, I used it for work when my company provided it while I was in Afghanistan. I used this camera to take shots from a blackhawk and was very impressed with the quality of the pictures. It did get grainy when I used digital zoom but, I have yet to use a camera that doesn't. When the price drops to my price range, I will definately buy one for personal use.", "Date": "July 27, 2007"}, {"Title": "Save Money & Get a G3 or G2 Instead", "Author": "Dawn M. Mikulich \"photographer\"", "ReviewID": "R1FPCHBQTP645R", "Overall": "1.0", "Content": "I currently own a G2 and thought an upgrade was due. Unfortunately, my G5 arrived today with a dead pixel on the LCD. Dead pixels are a fairly common problem to digicams, so it wasn't a huge deal. Because of this, I knew I would be exchanging the G5 immediately but decided to take a few test photos first. Photos from the G5 had more of a grainy appearance and the purple fringing was way out of hand. I read this in reviews of the camera on dpreview.com and other places, but thought that the G5 still had to be an upgrade to the G5.It's simply not the case. Although the camera felt nicer in my hands and physically looks better (I'm partial to the black exterior) it was simply not worth the extra cash. I think most new users would be better off spending less on one of the earlier G series models than spending top dollar on a camera that doesn't live up to its expectations.I am so disappointed that I have no choice but to return my G5 to Amazon.", "Date": "July 15, 2003"}, {"Title": "Don't bother, get a newer model.", "Author": "JamieBaker", "ReviewID": "RXXUAOLI6CB6P", "Overall": "2.0", "Content": "Eww, I sometimes forget the advancements that have been made to cameras in the past 10 years. I bought this for my 3 year old daughter (Yes, she understands how to use Auto mode) The shutter is too slow even with the flash on, Her nor I can get a clear shot. The camera was used so maybe its broken. I suggest going with a G10 or higher if you really want an advanced Point and shoot over a DSLR. Though, just get a T1i or Higher.  Cheap enough, much better.", "Date": "December 9, 2013"}, {"Title": "My first camera long time back and the best one", "Author": "Vivek Ragunathan", "ReviewID": "R302XLVMQJ7IC3", "Overall": "5.0", "Content": "Canon as people know is good at capturing bright and vibrant colors. I have taken so many pictures with this one. It is absolutely great camera for beginners. I still have the camera with me even after 7 years.", "Date": "August 22, 2013"}, {"Title": "Very good!", "Author": "elnina \"elnina\"", "ReviewID": "R2DPAH7F45ZQ0U", "Overall": "5.0", "Content": "This purchase was requested by a friend living overseas.I ordered it for him and had it delivered to my house, because I wanted to prepare it for a long journey and make sure that will not get damaged on the way.The package came well wrapped, so I didn't really needed to put any additional cushions into it.I cannot say how the camera performed, but my friend called me two weeks later and told me that the camera arrived in a great condition, actually looks like new, had all parts as described and the performance is outstanding.Another great purchase at Amazon!!! Thank you!", "Date": "November 29, 2012"}, {"Title": "A pleasure to use", "Author": "Joyce A. Ratasepp \"Kittyfartz\"", "ReviewID": "R18VCIGK11QWIT", "Overall": "5.0", "Content": "This is a very nice camera. The battery life on this lasts for several hours. The picture quality is excellent. It is fairly easy to use provided you actually look at the manual. It does take crystal clear, vivid color photos. I had used the one my husband borrowed from work to take pics of our new grand baby. My photos actually came out BETTER than the ones a professional photographer was paid to take the studio!!It is well worth the list price of around $800. If you can find a deal like I did then I would strongly advise you to grab this beauty!", "Date": "March 6, 2007"}, {"Title": "Awesome Camera!!!!!!!", "Author": "Keith L. Thomason", "ReviewID": "RHL4V1WYHT6UK", "Overall": "5.0", "Content": "I have owned this camera for 3 years and am totally impressed with it.The rechargeable battery is amazing. It holds a charge for a very long time.I use it for ebay photos and it takes great closeups. My next digital camera will be an SLR and I will definitely consider a Canon. For now this camera still meets my needs.", "Date": "January 16, 2007"}, {"Title": "Very durable camera", "Author": "Kolby Kirk \"Kahunna\"", "ReviewID": "R1KKPQG7XX30E5", "Overall": "5.0", "Content": "I bought this camera used in the spring of 2004.  Since then, I have taken over 10,000 photos on many backpacking expeditions around the world.  If the camera died tomorrow, it would have been well worth the money invested in it - but it still is ticking and takes photos today just as well as it did when I first purchased it. It's sturdy body and ease of use really made this a great camera.", "Date": "January 11, 2007"}, {"Title": "LENS ERROR", "Author": "annonymous", "ReviewID": "R379EBL26OGQ7H", "Overall": "1.0", "Content": "The canon g5 takes great photos until LENS error message comes on the screen and the camera stops working. I tried many things to fix with no results. Canon refuses to admit there is a defect despite the massive number of people who have experienced the problem as described at[..]", "Date": "July 26, 2009"}, {"Title": "go with the g2", "Author": null, "ReviewID": "R3PTLXIF0TN1SV", "Overall": "2.0", "Content": "I am a g2 owner and the g5 just didnt measure up to the g2.I got the g5 thinking that I was upgrading but the joke was on me. I did a side by side shootout with the g2 and g5 and the g2 beat it every time.the g5 has a lot of noise and seems to have slower shutter speed leading to lots of blured pictures.I used the same settings on both cameras when testing. If you try to use the g5 with a higher iso then 50 all you get is noise. I have been a long time canon fan and still am but I am sending this one back. All the g5 did was make me love my g2 even more.", "Date": "July 16, 2003"}, {"Title": "This camera rocks", "Author": "Anthony Leong \"tonyl88\"", "ReviewID": "R2YD6I4D03TCPV", "Overall": "5.0", "Content": "I don't agree with the review of some people who rated the G5 with very low score.  I just bought my Canon G5 and the camera is awesome.  The pictures I took with the Canon G5 are very beautiful.  Canon in my opinion make some of the best digital camera out there.  I use Canon, Nikon and Olympus digital camera before and Canon is by far the best.  The only other camera I would be interested in buying is the Canon 10D, but the camera is out of my budget at this very moment. ...", "Date": "July 18, 2003"}, {"Title": "Too many shortcomings", "Author": null, "ReviewID": "R1H9CO8PRHBZ5E", "Overall": "3.0", "Content": "I got this camera a week ago.  I would not recommend this camera to  others.  1) The optical viewfinder is partially blocked by the lens.  I find this very annoying.  It makes the optical viewfinder partially crippled.  2) Chromatic aberration.  If you shoot a back lighted object (say in front of a mirro with flash on) you will see a blue halo along the edge of the object.  3) Camera body not ergonomically designed.  It is hard to hold the camera with one hand, since the camera body does not fit the right hand ergonomically.  You will have to use both hands. 4) One has to remove the lens cap before turning on the camera.  This is also very annoying.  I wish I could keep the lens cap on with the camera turned on.  It protects the camera lens between shots.  5) Camera lens can be easily smeared without the cap.  It is not recessed deep enough.", "Date": "March 31, 2004"}, {"Title": "The Canon G5..  a camera with a touche of class....", "Author": "montana", "ReviewID": "R1WOR99KZAT9CY", "Overall": "5.0", "Content": "G-day..from down under..my name is Montana..ok we have heard the pro's, the cons etc...I my self had a sony V1 for 2 weeks and retuned it for the G5yes the V1 has a faster auto focus and fancy electronic beams night mode, how ever the V1 lcd screen in daylight is hopless and talking about the lcd screen if you are looking threw the view finder your nose is squashed up against it...the auto white balance lets not talk about that..the memory cards to expensive and last but least Sony havent quite got it right with there colours there is a blue cast in every picture..Well now the G5 it feels like a camera looks like a camera, with the focus you nead a little time..it comes good..study the Camera User Guide and you cant go wrong..good pics good controls fantastic Lcd flip-out a poor mans SLR..buy it and let your fingers do the walking POINT AND SHOOT..see-ya..Montana", "Date": "October 13, 2003"}, {"Title": "Look elsewhere", "Author": null, "ReviewID": "RI195DXT9Z5DA", "Overall": "3.0", "Content": "I am huge Canon fan and have found the G5 disappointing --  Pros: Compact body, good battery, EOS dial features, up to 1GB memory, works with Speedlite EX flashes, good stop action photos, good menus, good electronics.  Cons:  The higher ASA does not work.  Flash, particularly EX needed to shoot indoor photos, lots of grain, viewfinder gets the lens in the window!  This camera needs a lot of lite to get a crisp image, indoors or out.  Focus is soft.  I had a digital elph S100 and found that to be better focus.  Get an Elph or SLR but bypass the G5.  This hybrid is lacking.", "Date": "September 7, 2003"}, {"Title": "Excellent camera", "Author": "joe Anselmo", "ReviewID": "R16QGWDU4IYA03", "Overall": "5.0", "Content": "Excellent Camera for advanced hobbiest.  I've had it for 2 months now and love it to death compared to my G2.  Pictures are great at ISO 50 and 100 but noisy above that.  Camera allows full manual control for great pictures but the auto features are lacking somewhat.  If you like manual control and great pictures, but can't afford a dSLR, then this is it.  If you're looking for a point and shoot auto mode camera you shouldn't even be in this price range anyway.joe", "Date": "August 1, 2003"}, {"Title": "-- Good camera.... but the Amazon $50 offer does not apply -", "Author": null, "ReviewID": "R2MUFET4SWQ6QG", "Overall": "4.0", "Content": "Hi,I got this camera, but it seems that as per Amazon policy the $50 coupon for $250 or more in Electrnoics is not valid for this item.So I would reccomend the users to email the customer service in Amazon.com, before buying this.", "Date": "October 13, 2003"}, {"Title": "Don't buy this if you have active children", "Author": "Dennis E. Hall", "ReviewID": "RMBE71JF09BRN", "Overall": "2.0", "Content": "This camera does a little of everything, video with sound as well as images. The pictures it takes can be fantastic. Unfortunately the subject has to be pretty still or in very good lighting to get a good shot. I took this camera to a soccer practice of a bunch of 10-year-olds in the daytime with heavy cloud cover and not a single photograph turned out. That included the few I used the built-in flash on (it couldn't focus). I also tried shooting some pictures at an indoor game that were disastrous because of the quick subjects (10-year-olds again) and low lighting.Even during several outdoor games in bright sunlight it just couldn't hack it. I took several hundred photographs to get 30 or 40 worth keeping. Most of the time I was struggling with the camera trying to get it to focus and snap before the children ran away and out of focus.I also took this camera to Hawaii for a vacation. It did much better when the subject stood still and smiled, but none of the evening sunset-shots turned out.The camera also has a flaw in that the lens blocks out part of the viewfinder. This isn't much of an issue once you get used to using the LED to line up your shots.On the plus side, this camera has a very long battery life and can use the Ultra II compact flash cards. The software was also very easy to use (be sure to read the instructions BEFORE loading it onto your computer, not during).Overall, my recommendation is to spend a little extra for an SLR camera and leave this one alone.", "Date": "February 17, 2005"}, {"Title": "Buyers Beware! Defects and voided warranty", "Author": "Jonathan", "ReviewID": "R2Z5ZU9RA0DF4X", "Overall": "1.0", "Content": "I got my G5 on August through Amazon. In December the LCD has stopped working, and a few days later the Camera completely stopped functioning.At the time I was travelling with my wife to Europe and Canon refused to service the Camera. Apparently you can only get US local service to it (they even don't allow shipping back to the States) and get this - I took this to Amazon customer service which warned me that by taking this Camera outside the United States, \"you void the manufacturer's warranty on this item.  This could make any future servicing of the item difficult and costly.\"Since we are due to get back to the States only in 3 months, and I need a WORKING camera to shoot while on vacation, not when I am home, I had to pay today $350 to fix it and replace the \"Optical Unit\".I will never buy a Canon product again.Sony gives you worldwide walk-in warranty, no matter where you are you in the world you go or call a local Sony service center and get your Camera fixed.Now, that Sony offers CF and not just MemoryStick and with the excellent reviews it gets from the user community, there is really no reason to take the risk with Canon. Their Cameras ship with defects and the service is the worst I came across so far.", "Date": "January 14, 2004"}, {"Title": "WHY didn't I buy this sooner???", "Author": null, "ReviewID": "R33TBV0J8SNWYR", "Overall": "5.0", "Content": "I've been borrowing a digital camera for ages - debating between the digital rebel & the G5.WHY did I wait so long???I finally decided that since I never used my SLR, I'd probably never use the digital rebel.I've used my G5 daily since its arrival & the only problems I've encountered were as a result of my failure to read the manual!  I'd buy it again in a heartbeat!", "Date": "December 14, 2003"}, {"Title": "Don't forget the Memory !!!!", "Author": "Morticia PBK \"Happy mum of 2\"", "ReviewID": "R33HKH46I6D5PI", "Overall": "5.0", "Content": "Don't forget that the G3/G5 are using the Compactflash memories... which mean you can use the 1Go and 4Go megadrives from Hitachi (previously built by IBM). When I go on week-ends/vacation, I'm worse than a japanese busload: I shoot, I shoot, I bracket, I'm at the biggest resolution and I don't worry about the memory.The result? On a 300 to 500 pictures week-end (G3 w/1Go microdrive), I can decently go to my Walgreens and print 5 to 10 AWESOME 8x10 pictures.For less amateurs people, you can use this way the RAW format and still have room in your memory.Conclusion : when you choose your camera, don't forget that you won't have always your computer around to unload your memory sticks. Check also the price per Mo.Go Compact Flash !! Go Microdrive !! Go G3/G5 !!!", "Date": "December 12, 2003"}, {"Title": "A great camera for daily needs", "Author": "A. Gupta", "ReviewID": "R355QX9KFUQ8DP", "Overall": "4.0", "Content": "I bought this camera after reviewing several other camera in the same price range. This is a great camera with most of the features I was looking for including a handy remote to take picture of the whole family. I love it...", "Date": "September 15, 2004"}, {"Title": "Save money and get yourself a G3 or Nikon 4500", "Author": null, "ReviewID": "R1NPT9VKH8458E", "Overall": "1.0", "Content": "All the hype about DIGIC and G5 is just that..The ISO settings at 200 or 400 don't really work well..the photos are grainy in low light when compared to a Nikon 4500.Canon has taken a step back with G5. I am not impressed with the feature set at all", "Date": "August 2, 2003"}, {"Title": "Bad parcel", "Author": "Très fâché", "ReviewID": "RHLN3YDY0FM7W", "Overall": "4.0", "Content": "Amazon, pay atention, may be the store had receive a bad parcel of G5, 'cause two customers had writen a review about bad battery.", "Date": "June 21, 2004"}, {"Title": "don't know yet", "Author": "Hai Nguyen", "ReviewID": "R2LZ6GACREZ0VH", "Overall": "1.0", "Content": "got the camera but cannot really do anything. Doesn't matter how long I charge, I cannot turn on the camera.  The LCD shows \"change the battery\" and shutdown.  Bad QA i guess.  Or they ship a bad battery.  Still nothing from Canon support yet.  No star if I could since I could not even use the camera.", "Date": "June 12, 2004"}, {"Title": "Terrible camera, overpriced, shame on Canon", "Author": "J. Gaspard \"a very picky person\"", "ReviewID": "R3ORW169QFUXUW", "Overall": "1.0", "Content": "I sent this back after 2 frustrating weeks...I got this camera over the S50 due to the faster lens, larger optical zoom and the hotshoe, boy what a letdown.The autofocus is miserable, this camera needs full light to focus correctly and it is VERY slow, if shooting in dim light (anything less than daylight) this camera took at least 10 sec's to focus, ofen it would just give an error beep and make me manually focus. Most flash photos were overexposed badly despite trying to deliberately underexpose.This camera is not worth the price, even if less than list. If you are willing to spend this kind of money spend a little more and get a digital SLR. I really don't want anyone to be dissapointed like I was, what a waste!", "Date": "December 15, 2003"}, {"Title": "battery dead after a few shots", "Author": "Hai Nguyen", "ReviewID": "R39VSDWECZEEHP", "Overall": "1.0", "Content": "0 star if I could since it is almost consider to be DOA. Don't know how good the camera yet. But just after a few shots, the battery is dead. Based on Canon's support, I have to send the battery back for them to check. What a bull!!! Now I have to wait a few weeks before I can use it again if I am lucky enough.", "Date": "June 12, 2004"}, {"Title": "Avoid the G5 due to blue fringing / Chromatic Aberrations", "Author": "Jerry Jongerius \"duckware\"", "ReviewID": "RQ2L287I30XG1", "Overall": "1.0", "Content": "My experience with the G5 is that it should be avoided due to blue/purple fringing (Chromatic Aberrations) within images.  (...)", "Date": "July 22, 2004"}, {"Title": "The best I ever ad", "Author": null, "ReviewID": "R2BJV3Y20RUY8Q", "Overall": "5.0", "Content": "Easy to operate user friendly and the best results", "Date": "April 21, 2004"}, {"Title": "Switch to digital", "Author": null, "ReviewID": "R138DPLZRVLCTD", "Overall": "5.0", "Content": "For a long time film/slide shooter like me, this has been a great discovery and addition. Extremely compact, fast shooting with high quality pictures. Couldn't ask for anything more.", "Date": "June 18, 2003"}, {"Title": "NEVER BUY AT AMAZON's PARTNER SITE - CIRCUITCITY.COM !", "Author": "Amazon Customer \"buddybud\"", "ReviewID": "RU535CESWY6LJ", "Overall": "1.0", "Content": "We recently bought a G5 powershot thorugh Amazon. We know it is a wonderful camera and quite a few of our friends own this camera. Simply superb quality pictures!!Having said that about the camera - a little bit or should I say huge frustration with Circuitcity.com.:-( We bought the camera online(I guess circuitcity is amazon's partner site) and offered to pick it up at a store. When we went to pick the camera up, the package was so badly damaged and they said that was the only piece that they had. I took it as it was an anniversary gift for my wife. When we came home and opened the package, it was missing the USB and AV cables. We went back to the store in an hour's time and they WERE SOOOOOOOOOOOOO RUDE. They wanted us to talk to Canon about the missing parts or go to another circuitcity store to return/exchange the product as they did not have another piece. They would neither get it for us from another store nor would they accept a return without charging a 15% re-stocking fee. All this - for no fault of ours!I am VERY VERY VERY DISAPPOINTED WITH THIS BUY.", "Date": "May 27, 2004"}, {"Title": "Canon Service is Horrible", "Author": "\"frolic55\"", "ReviewID": "R5VF0BI72R0EZ", "Overall": "1.0", "Content": "I have a Canon G2. It broke in July, and then again in August. I've sent it in four times since then to be repaired, and each time they've sent it back without fixing it. I've paid $150 + tons on shipping and I can't even get the thing to turn on. Save yourself the headache and buy another brand.", "Date": "October 27, 2003"}, {"Title": "Disappointed me when i opened the box.", "Author": null, "ReviewID": "R3DPZOBBCMI5TJ", "Overall": "1.0", "Content": "Not only do i agree with the cons of this camera expressed from the other reviewers, the thing that disappointed me the most is that there is not even a simple case for such an expensive camera. A case is absolutely necessary for this camera and now because it is not included, i have to go to a store again, which i don't like because i am a busy person.  In addition, one of my friends spent a great deal less money on an other brand camera but gave me much better quality pictures(i compared all the pictures in my computer). Because of all these reasons, i do not suggest buying this camera with such a high price until it is improved.", "Date": "August 7, 2003"}, {"Title": "Buyer Beware - No Date Stamps On Photos?", "Author": null, "ReviewID": "R1VY68785SGCMS", "Overall": "1.0", "Content": "I own a G3, and it does NOT let you put the date stamp on a photo.  Canon is living in the dark ages.  I'm unsure if this is still a \"feature\" on the G5.  Do your homework before you buy this camera.  At this price point, printing the dates on photos shouldn't be something you have to worry about.", "Date": "November 26, 2003"}], "ProductInfo": {"Price": "$799.99", "Features": "5 megapixel sensor (2592 x 1944 pixels) for enlargements up to 20 x 30 inches\n4.1x optical plus 3.6x digital (15x) zoom lens with autofocus\nRotating/flip 1.8-inch LCD; up to 3-minute video capture with audio; large maximum aperture of f/2.0 – 3.0\nIncludes 32 MB CompactFlash card; compatible with MicroDrives\nPowered by rechargeable lithium-ion battery  (BP-511, included); connects to PCs and Macs via USB 1.1", "Name": "Canon PowerShot G5 5MP Digital Camera w/ 4x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41J77KWTH0L._SX300_.jpg", "ProductID": "B00009W5FF"}}