{"Reviews": [{"Title": "Casio EX-Z1080 versus the competition", "Author": "Truth \"in Yeshua\"", "ReviewID": "R3R9PCOQI35WH6", "Overall": "5.0", "Content": "I recently purchased a Casio EX-Z1080, as well as a Canon PowerShot SD750 and a Panasonic Lumix DMC-FX55K.  I wanted to get the best camera available for the money in a small form factor.I put all three cameras through very extensive testing, and was surprised by what I learned.  First, I'll provide a brief rundown on the strengths versus weaknesses of the camera I chose versus the others.  Then I'll provide a list of pros and cons for the particular camera I found to be the overall winner.Oh, yes, the winner, surprisingly, was the Casio EX-Z1080.  Moreover, this was also the cheapest camera of the bunch by far!The Casio EX-Z1080 had sharper images across the board and reproduced greater detail than either the Canon SD750 or the Panasonic FX55K.  Color accuracy, etc., was also just as good on the Casio as its competitors.  I took dozens of photos of small objects, including objects with fine text, from varying distances.  So long as the focus lamp was enabled, the Casio always took sharper photos with far greater detail.  When the focus lamp was turned off, both cameras took blurry photos.  I suspect the Casio came out on top for two reasons: first, it has a higher megapixel CCD, and second, its digital image stabilization actually outperforms the optical image stabilization of the Panasonic, which was a BIG surprise to me.  Both the Casio and the Panasonic outshined the Canon SD750 on photos; each were sharper and produced greater detail than the Canon.  (My Canon SD750 also had an area of dead pixels in the CCD right out of the box, so it was defective in that regard.)In terms of video, the Casio and the Panasonic take the most compact, high-resolution videos, and the Casio offers superb audio (the best of the bunch).  However, the color balance of the videos taken with the Casio EX-Z1080 is sadly inferior to that of the Canon SD750 and the Panasonic DMC-FX55K.  I found that I could compensate for this a bit with the Casio by increasing the EV value to +0.3, though doing so left my videos looking too bright in places.  (Casio could really use a smaller stepping, such as +0.1.)  Additionally, the Casio EX-Z1080 exhibited considerable pixelation in videos taken in low-light -- much more than the Canon SD750.  (The Casio EX-Z1080's video was higher-resolution and better focused, with superior audio, but otherwise inferior in terms of color balance, brightness and contrast, and pixelation.)  If taking videos in low-light situations (e.g., indoors) is something that would be important to you, then your best choice would be the Canon or Panasonic.  Otherwise, if you have good lighting, the Casio might suit your needs.  (Regardless, the Casio produces much better photos than either of its competitors.)  One more thing: due to the fact that it uses the latest MPEG 4 code (i.e., H.264), the size of the video files, even though they are higher resolution with superior audio, is smaller with the Casio than with the Canon SD750.  (This is also true of the Panasonic.)Both the Panasonic and the Canon have nicer battery chargers, in that each has a rotating plug, rather than a long cord that has to be attached to the charger, which is a downfall of the Casio.  (Due to the cord, the Casio's charger is bulkier and not as portable.)  The Casio EX-Z1080 does, however, have the best battery life of any digital camera of its size, to include the Canon SD750 and the Panasonic DMC-FX55K, though the Canon SD750's battery life is pretty good.So, the Casio is best all around where photos are concerned, and it is the cheapest of the bunch.  Besides this, the Casio also gives you more for your money: a 1GB SD card and a nice case are both included.  The Canon SD750 only comes with a measly 32MB SD card, which is ridiculous (!), and NO case.  While the Panasonic DMC-FX55K also includes a 1GB SD card and a case (not as nice as that of the Casio, I don't think), you pay MUCH MORE for the Panasonic than for the Casio.OK, to the pros and cons of the Casio EX-Z1080.  Pros:- the very best battery life, and a useful electronic in-built battery meter (not found on the Canon SD750)- highest resolution CCD (10 megapixels)- takes superior photos that exhibit both sharper focus and greater detail- outstanding video compression (like the Panasonic I bought)- superior audio quality in videos- generous extras (very nice case and a 1GB SD card included)- the best price of all three cameras I purchasedCons:- inferior color balance, brightness and contrast, and pixelation in low-light situation videos; Casio could learn a great deal from Canon in this particular area, and were Casio to collaborate with Canon on a future version of its camera, Casio could flat out take the digital camera market by storm- wrist strap is a bit small; would fit most women well, but a significant number of men will find it a bit tight to put on- poor plug design on the battery charger, which makes it overly bulky for travel (i.e., it uses a separate electrical cord rather than a rotating plug)- inferior LCD display; both the Panasonic and the Canon offered much nicer LCD displays (larger, clearer and higher resolution, though brightness was not a problem for any of them)- the included printed manual and other reference material is next to USELESS!!!  One has to consult the electronic guide, which is on an included CD, for any truly useful information regarding the camera and its settings, etc.On the whole, I feel one gets a great deal for the money with the Casio EX-Z1080; I got mine at Costco.  Most of us who purchase a digital camera do so for the photos, and here the Casio EX-Z1080 shines.  While the LCD display could be better, as could the battery charger's design, and while Casio could really improve on the color balance, etc., of its video processing engine, the camera is otherwise head and shoulders above the competition--at any price!  You also get a much better package with the Casio for the money (i.e., nice case and decent SD card).  However, if video is what matters most to you in a digital camera, look elsewhere.  Personally, I have decided to return both the Panasonic and the Canon.  I'd rather have a dedicated video camera for those situations where the best video really matters to me anyway.", "Date": "November 10, 2007"}, {"Title": "I liked this camera so much I bought two!", "Author": "Gadget Lover \"I love hi-tech gadgets\"", "ReviewID": "R1GQZYDF55LJFV", "Overall": "5.0", "Content": "I am a long time Canon camera diehard, and my wife is a long time Sony camera user.Recently we wanted to upgrade to smaller, more capable cameras.  I purchased the Casio EX-Z1080 after reading favorable reviews online.  I purchased this for my wife, and she loved it after trying it out for a week.I really liked photos, movie mode, speedy photo performance, and decided to buy a second one for myself, in lieu of some of the Canon models I was seriously considering.Pros:  Small, long life battery, very simple and easy to use, great images, lots of features.Cons:  Not much, macro mode is not as good as the Canons I have used, but still adequate. Movies are only at 25 fps instead of standard 30 fps, but not a big deal in my eyes.So far we both love our Casios and look forward to enjoying it for a long time.EDIT:  I did a side to side comparison to a Canon SD800is, which I was debating about buying, and here are some thoughts about these two cameras:The Casio EX-Z1080 is far more intuitive and usable than the Canon from a UI perspective and physical ergonomics perspective.After playing with the SD800is for several hours, and reading every page of the Canon basic and advanced guide, I'm still confused on some features, and it's definitely a lot more complex to use than the Casio. I skimped over the Casio user guide and it's super intuitive to use.Here are the pros/cons of the two cameras in my opinion:Casio Pros (in relative order of importance):1. UI and ergonomics are super, even my wife who is not a technowhiz figured it in a few minutes.2. ability to easily change most settings very very quickly, which means more flexibility in taking shots3. large, clear LCD screen4. long battery life, one of the longest in its compact camera class5. 10.1 megapixels (doesn't really matter to me because I use 1600x1200 most of the time anyhow, or 2 megapixel resolution)6. sturdy metal case, solid feel, versus plastic case / more fragile feel of the SD800is.7. Visible battery meter shows status in 3 bars, so you can recharge well ahead of the weak battery status.Casio Cons1. digital image stabilization only (means increasing ISO to compensate for movement) - although most images are fine2. lack of optical viewfinder (I use this in bright light, and to conserve battery life if forced to)3. optical zoom only 3x, versus 3.8 on the SD800 ISCanon SD800is pros:1. Optical image stabilization - this is the best image stabilization method, versus digital Image Stabilization which is not really all that good2. wide angle lens - more area for indoor shots3. 3.8 optical zoom4. Optical viewfinder (at the expense of a much smaller LCD)Canon SD800is cons:1. UI and ergonomics are far worse than Casio (I spent 3 hours studying the manuals and still haven't figured half the stuff out like I did with the Casio, and I HATE the hard to push buttons on the back)2. battery life is not as good as Casio, and there's no battery status meter.  The weak battery icon pops up only when it's too late.3. Can only do date and time stamp on 1600x1200 images (I like to date and time stamp every shot so I know when it was taken)3. 7.1 mega pixels versus 10.1 megapixels on the Casio (not a big deal in my book)4. Feels bigger and fatter than the Casio (although they both have the same dimensions, the Casio just feels a lot slimmer, and better)5. plastic case. versus metal case of the Casio (the Casio feels very good to hold)6. much smaller LCD than the Casio7. shiny chrome parts are constantly smudged, and hard to keep cleanSo overall Casio is such a user friendly camera, that it really is optimal for the point and shoot crowd (most consumers).", "Date": "November 28, 2007"}, {"Title": "The best camera", "Author": "Denyel Davis", "ReviewID": "R26K76WWIDM39C", "Overall": "5.0", "Content": "I LOVE this camera!!! I own the casio 1050 and the casio 1080. I much prefer this camera over the 1050. The 1050 has a poor lcd screen and they fixed that with the 1080. This camera also has face detection which the 1050 does not. The picture quality is amazing on the casio 1080. I have 3 kids ages 1, 3 and 8 and could not ask for a better camera. All the extra features are very easy to use. I also love the video. I can playback the video on my camera with audio. The battery life lasts a very long time. I cant think of one con for this camera. It is my all time favorite. Thanks Casio for finally coming out with the camera that I have been looking for. Although the other poster did mention getting a 1GB SD card and a nice case included!?!?! I did not recieve either of those? How did you get those to come with your camera?", "Date": "November 24, 2007"}, {"Title": "I highly recommend this product", "Author": "RHB", "ReviewID": "R3GJLS63W94H79", "Overall": "5.0", "Content": "I have been using a digital SLR Minolta for two years and I have not used one of these point and shoot digital cameras so please read my review based on these. Maybe some or all of these features are already in other point and shoot cameras.To sum it up, I think this is a very good value for all the features you get.Features I like:-I like several pre-programmed best shot features. It has best shot modes such as high sensitivity, business cards, night portrait, old pics. Amazing.-The video quality is so so but for a camera like this I think it is good. After all it is a digital camera not a video camera. I am happy with it. It has features like short video that captures 4 secs before and 4 secs after you click the shutter. I have not tried it yet but I think it uses a buffer memory to do this. Amazing. You do not worry about clicking the shutter too late.-It has auto frame function. It follows the focused person if (s)he moves. I have not used the face recognition feature yet.-It is very intuitive and easy to use. Options are easy to access.-If you buy it online the price is very good for a camera like this-It is small, easy to carry.The things to watch out:-I think the hand strap is weak and looks cheap-It looks like (I am not sure) this is thicker than other Exilims. It still is a small camera.-Most of the information is on the CD provided. Paperback Manual provided gives only basic info to operate.-It seems like there is a slight lag after you click on shutter and while it is writing on the memory. I am used to my digital SLR I guess.Overall I am very happy with it. I'd recommend it.", "Date": "December 20, 2007"}, {"Title": "Beyond Expectations!", "Author": "Dawn", "ReviewID": "R3JA02G3RBU3U0", "Overall": "5.0", "Content": "I thought this was going to be yet another point & shoot that would fall short of my expectations (they are pretty high as I'm a professional photographer).This is a great little camera that captures beautifully sharp photographs.  The Casio EX-Z1080 is simply awesome. This was a gift for my daughter but I like it so much that I'm going to pick myself up one as well in the immediate future. I read the reviews here on Amazon. Thanks to everyone that posted a review. Hopefully, I can help someone in their decision as well.", "Date": "January 4, 2008"}, {"Title": "Super little digital camera.", "Author": "R. Snow \"Snowman\"", "ReviewID": "R343FFUQU3K7WK", "Overall": "5.0", "Content": "I already had two digital cameras, but wanted one that I could put in my pocket and not have to carry around.  After much investigation for features and price, I opted for the Casio EX-Z1080.  I have no regrets.  It has a nice large LCD window that seems bright enough.  I cannot think of anything that I am not satisfied with with this camera.  It has many features that I have not even began to know about or use.  I went to the Casio website and downloaded and printed an extremely comprehensive PDF file (manual) for this camera, which I would recommend to anyone that buys this camera.  I love the camera.", "Date": "January 28, 2008"}, {"Title": "Great Camera", "Author": "Nicholas Morales", "ReviewID": "R9W2018EC9JIM", "Overall": "5.0", "Content": "I recently bought a casio exilim, although it is not the 10.1 mp version I have a newer 12.1 version, it is the best camera by far that I have ever owned. I have recently been deployed to IRAQ and have been using the Casio, and have been amazed at the detail of the photos I have taken. I used a SONY and a Cannon on my previous deployments and was pleased, but now that I am using my Casio, I wish I would have had this camera on my previous deployments. The Stabilizer has allowed me to take fewer photos since I do no not have to keep re-taking photos. I have been in country for 3 months and have not had to recharge my camera once, although I only use the camera on and off; it is still amazing that I do not have to continously recharge my camera. In Conclusion, if you are looking for a great camera at a low price look no further and save yourself the hastle....BUY A CASIO EXILIM. Small, compact, great picture, long battery life, and a million other reasons I can list, but in short....a must buy.", "Date": "February 10, 2008"}, {"Title": "Details matter.", "Author": "Jonathan Oldham", "ReviewID": "R2TB8PHMKMV1FP", "Overall": "4.0", "Content": "This is the second Casio Exilim camera I have owned. The first had only 3MP and the addition of 6MP to my Photos makes a huge difference. The sharpness and contrast in color is extreme. I chose another Casio due to the Best Shot feature which sets the camera up with the optimal settings for the environment you are shooting in without requiring any knowledge of F Stop and Aperture. It is the more bulky of the Casio camera range but the end result definitely makes it worth it.", "Date": "February 8, 2008"}, {"Title": "Great Camera, But One Problem", "Author": "Amazon Customer", "ReviewID": "R16YGJVF1U6BP", "Overall": "4.0", "Content": "I've had several Casio cameras and have enjoyed them all. This is the pinnacle thus far, but I have a problem I'm wondering if anyone can help me with.When taking flash pictures, I hold down the shutter half way to focus and then push all the way down for the shutter release. There's a significant shutter delay of about a half second. When I picked up a Z77 at Best Buy, there was no shutter delay.Anyone have an idea of what's going on?Thanks,Gary", "Date": "February 8, 2008"}, {"Title": "Casio rip-off", "Author": "Test Engineer \"Test Engineer\"", "ReviewID": "R1ZZF7Z49AVTMT", "Overall": "1.0", "Content": "My camera went bad from a VERY COMMONLY reported manufacturing defect \"camera stabilizer is not available\" error message in the model I had. Since this is a common defect from the manufacture, they should have fixed my camera at their expense, but they refused to fix it without me having to pay $100 something for their manufacturing defect plus shipping charges! Don't buy Casio products! They don't stand behind the quality of their products.", "Date": "July 16, 2009"}, {"Title": "battery doesn't work", "Author": "ladynuca", "ReviewID": "R5U5G9ZBCQ9OW", "Overall": "1.0", "Content": "As other people have stated before, the battery on this camera is a piece of crap! It won't charge fully; it lasts for just a few pictures before dying again.  The company sent me a replacement, which didn't work either, and they won't send another replacement. I will never buy another casio.", "Date": "June 9, 2009"}, {"Title": "Best buy, period.", "Author": "GoingUp", "ReviewID": "RQYDL4P2K9OAY", "Overall": "5.0", "Content": "This is probably the best compact digital camera that you can buy at any price. Why? Because the vast majority of non-DSLR digital cameras use 1/2.3\" ~ 1/2.5\" CCD image sensor, but this Casio EX-Z1080 has a 1/1.75\" one! It really does make a difference (less image noise) particularly when you shoot in low light condition.In addition to taking great photos, this camera starts up really fast, has super long battery life, and is easy to operate while packing lots of functions.Note: There's no carrying case included with this camera, so if you're taking it on a trip right away, you should order a case/pouch too.", "Date": "April 23, 2008"}, {"Title": "Casio Exilim EX-Z1080 Camera", "Author": "Jerry T. Neil", "ReviewID": "R241XRIVS42QIC", "Overall": "5.0", "Content": "I am very happy with my purchase of my Casio Z-1080 camera. My previous camera was an Olympus Stylus 300. I was very satisified with the Olympus until it broke. The Casio pictures are clearer and I like the wider screen to view the pictures. The sleek design is a plus. I originally purchased the same camera thru Ebay. The camera was suppose to be a new one, but it turned out to be a refurbished camera. I sent it back and got my money back. This was the first time I have shopped using Amazon.com and I am impressed with their service. The Casio exilim EX-Z1080 is by far the best camera I have owned so far. I would recommend this camera to anyone and I already have. My niece bought a Sony and my Casio takes much better pictures.", "Date": "April 8, 2008"}, {"Title": "Best Little Camera Out There!", "Author": "Mitch \"El Mitchinator\"", "ReviewID": "R2D8TYX4ZHN23H", "Overall": "5.0", "Content": "When I was looking for a camera, I wanted three things:  It had to be small enough to carry in my purse, take great pictures (regardless of the movement of the subjects or the photographer), and it had to have a long battery life.  The Exilim EX-Z1080 excels at all of these.After doing extensive research, I finally bought this camera.  I've had it for a month now and have no complaints.  The battery life on this camera is amazing!  The pictures are high quality, without too much lag time between shots.  I have not used the movie mode, since that was not the reason I bought the camera.  When I do, I will be sure to update this review.", "Date": "March 2, 2008"}, {"Title": "Casio Exilim EX-Z1080 10MP Digital Camera A++++++++++", "Author": "L. Nelson \"mistifogg\"", "ReviewID": "R2V0I0VY67HWHW", "Overall": "5.0", "Content": "Now I do not know much about Digital Camera's so when my old one broke I started to look for a new one online by reading all the reviews at Amazon.com, Target.com, etc.......to see which was the most popular and had the best reviews in my price range!This camera won hands down and I researched for quite awhile before I finally purchased it!It not only looks good and is compact (but still easy to hold), it is easy to use.........it comes with a quick reference instruction page that are very easy to follow!  The LCD wasn't as big as I wanted orgininally (wanted 3\") but I was very happy to find that it is plenty big enough.  The best part of the camera is that it takes GREAT PICTURES and they stay looking great even after you download them.........all of my family was amazed on how good the pictures came out over the holidays.  I guess you can thank the 10MP for that of course and everyone that has seen my camera can't believe it is a 10MP as you can't find them out in the stores yet!Like other reviewers I agree that it can be a bit slow to actually take the picture but it is much better then any other digital camera I have used (of my friends or families) and I would not return it just because of that.........I also think it has a lot to do with the picture taker too.......some shots are just to hard to get if they are moving to fast so use the great VIDEO feature on the camera which works great.I have not used everything by far on the camera but so far I love it......and the BEST SHOT feature is amazing........we use it for eBay stuff all the time and it works great.OVERALL I WOULD HIGHLY RECOMMEND THIS CAMERA TO ANYONE........IT IS A GREAT CAMERA FOR THE PRICE!!!", "Date": "January 16, 2008"}, {"Title": "Excellent Camera", "Author": "Boris M. Kroner", "ReviewID": "R2OXYNHKUIQKXN", "Overall": "5.0", "Content": "My last camera was a Nikon Coolpix and I like my new Exilim much better.  I have really enjoyed the great quality of pictures taken at Church where there is a lot of candle light.  I had a real problem taking those with the Nikon.", "Date": "January 6, 2008"}, {"Title": "Casio Exilim EX-1989 10MP", "Author": "Checkpoint World Team Press", "ReviewID": "R2DG9TLCRN96B6", "Overall": "5.0", "Content": "Camera is amazing.  Very user friendly.  Long battery life. Great videos.  Wide range of options for amateur or professional use.", "Date": "December 18, 2007"}, {"Title": "Ignore the 1 star ratings on the Casio Z1080!", "Author": "Richard Goulmassian", "ReviewID": "RTNEBI6UKWI1", "Overall": "5.0", "Content": "I have used dozens of digital Canon, Nikon, Olympus, Panasonic, and Casio point and shoot cameras over the years.  The reviews that give this camera a 1 star rating are rubbish - especially when they site lens and battery issues as the reason for the poor rating!  Canon and Nikon have had tons of issues with their lenses sticking out and not retracting, batteries go bad - even new ones so buy one on Amazon for a few bucks and don't blame the camera!Yes, the video mode is just average - just slightly better than VGA quality but then all of the cameras from the major manufacturers at that time were doing the same! BUT the pictures you get from this camera are EXCELLENT! Much better quality than comparable Canon or Nikon cameras!  If you want a REAL review - check the review at Trustedreviews.com {trustedreviews dot com if the link gets edited out by Amazon} and see what they thought of the camera. They gave it a 9/10 - nine out of ten rating!  Then check to see how the Canon and Nikon point and shoots in the same price range faired - you will be shocked!My Z1080 is still in use today - still takes great pictures and by the way, the lens still retracts and even the original battery still gives me a couple hundred shots with mixed flash use!If you are stuck on getting a Canon point and shoot, then buy the Elph 100 - great camera with 720p video! Nikon point and shoot cameras are not in the same ball park as the Canons so stick with the Canon line.", "Date": "September 22, 2013"}, {"Title": "it was broken upon delivery.", "Author": "J.D.MCNATT", "ReviewID": "RANACO5HYX9CP", "Overall": "2.0", "Content": "this was to replace one just like it , but it has the same problemthat caused me to order a new one.ie. the battery/ sd card door will not stay closed as it did when it was factory new.", "Date": "July 6, 2013"}, {"Title": "I Guess I used it.....", "Author": "Could have Been Happier", "ReviewID": "R17O9VED86YY0C", "Overall": "1.0", "Content": "This purchase did not make me very happy, I owned it for less than a year and the camera did not perform to my liking. The lens quit retracting and sat there and chattered. I guess I used it,,,,, too much. The last Casio Exilim that I purchased the year before was STOLEN it was the better model as the previous model worked fine. Now I own a competitor's brand camera and just not sure if that is it either. So keep shopping if your looking for a camera that will work. What I look for is a quick snap camera not one that takes a few mili seconds to actually take the picture, this one was quick but the lens quit working properly.I guess I used it,,,,,", "Date": "November 16, 2011"}, {"Title": "Best I have gotten", "Author": "Odajennys", "ReviewID": "R3TS9LVQPHNM5G", "Overall": "4.0", "Content": "I have had Canons, Kodaks, Nikons, Fujis, etc.Never would I have thought that Casio would be the best point and shoot for me:I have simple needs and this camera meets it with these features:-Small-Dedicated Video button and Camera button-It starts up really fast and can take a really quick snap!-Long Battery Life (over 3 weeks without charge on min use) or over 2 days with a lot of use (trip to Europe)-Sound is LOUD-You can ZOOM while shooting video (strange how rare this feature is and how handy it becomes when you least expect it)The cons:-Grainy at night-It isn't for nighttime pics or videos-The charger sucks cause it's not the kind that sticks to the wall.", "Date": "March 1, 2010"}, {"Title": "Value for Money", "Author": "Mr. Hetal Dinesh Patel \"Hetal Patel\"", "ReviewID": "RYXXR5DOYKFWS", "Overall": "5.0", "Content": "Value for MoneyNobody give 10 Megapix and Lithium Battery in such nice Price", "Date": "March 13, 2009"}, {"Title": "Reconditioned OK with me!", "Author": "I. Garcia \"Ella's Grammy\"", "ReviewID": "R12FEKT67B20Q6", "Overall": "5.0", "Content": "I bought this camera to replace another one and I love.  My daughter has the same camera so I know it works well and has many great features.  I was a little hesitant because it is refurbished, but once I got it, all my concerns went out the window.  It looks and works like brand new.  I am very happy and pleasantly surprised with this purchase.", "Date": "August 29, 2008"}, {"Title": "Great little camer - no view finder", "Author": "dogmom \"dogmom\"", "ReviewID": "RZZHOSOSYESHQ", "Overall": "4.0", "Content": "We recently purchased a Casio Exilim, after reading the great reviews on-line.While it is a nice little camera, with many handy features, includng  an exceptionally large display screen, it was missing one rather important feature for me - a view finder!  The vast majority of pictures that we take are outdoors, often in bright light.  From mountains for distant scenes, to close-ups of flowers, etc.  In bright light conditions, it is very difficult to impossible to see what is on the screen, and I need a view finder in which to view what image is being captured.  Barring that feature, I found myself guessing and hoping I'd be getting what I wanted in my picture, with varying degress of success.  However, when I wanted to get some up-close pictures of rain-drops on flowers, I could not capture it at all, since I couldn't see the image on the screen!Sadly, this issue has caused me to decide I need to return this little guy, and find one with an old-fashioned view finder to use when I need it.For those who can function with just the screen, by all means, give it a shot!  For the price, it will be hard to beat.", "Date": "August 4, 2008"}, {"Title": "Excellent camera", "Author": "Jefrey Lizardo", "ReviewID": "R26RBTR7HPEQ9A", "Overall": "5.0", "Content": "What I like the most of this great camera:1) great pictures2) automatic settings to take pictures3) battery, it lasts forever", "Date": "April 12, 2008"}, {"Title": "Best camera I've owned", "Author": "Jordan Mayhue \"Jordan\"", "ReviewID": "R1PVH09CIVD7CR", "Overall": "5.0", "Content": "Let me start off by saying that this is absolutely the best camera I've owned. I love the 10.1MP.All the \"Best Shot Selections\" are great presets and work fantastic. I was so shocked that when I purchased this camera you could zoom in like crazy! See things that you would think you were looking under a microscope at!!The sound works great with the video and the video mode is easy to use.Overall, this camera is great and I just love it, I've read so many reviews on Amazon about this camera and haven't found many that have had anything negative to say about it. I recommend it! Now, take some awesome pictures! = )", "Date": "April 9, 2008"}, {"Title": "Top Notch Camera!", "Author": "dm", "ReviewID": "R38BFBEGX0NFHF", "Overall": "5.0", "Content": "WOW! A truly unbelievable camera. I had a Fujifilm camera (cannot recall the model) with only 4.5 mega pixels. That camera doesn't even come close to this. This camera makes me want to take pictures. Very easy to operate and takes pictures very quickly. Tons of different settings to get the perfect picture for any occasion. **Make sure to lightly touch the shutter button until the square in the middle of the screen turns green to ensure a great shot** I can't see myself every switching to another camera. Worth the price- a magnificent piece of technology.", "Date": "March 26, 2008"}, {"Title": "user friendly", "Author": "William Whittley \"Pocket Aces\"", "ReviewID": "R10VISSFW7V1HU", "Overall": "4.0", "Content": "For a first time digital camera user I found the set up and instructions to be quite clear and easy to understand even tho' I'm a \"Pre Baby Boomer\".I did, however find the print of the manual to be a little to small but; I think the letters on a stop sign are a bit to small.For my use as a fun type camera family pics etc. etc. , it was the perfect choice.", "Date": "February 16, 2008"}, {"Title": "Best compact digital I have ever owned", "Author": "Rebecca M. Shaw", "ReviewID": "R121M0SLIAX97U", "Overall": "5.0", "Content": "Fast, accurate and well built. Takes excellent pictures in all modes and has features not expected in this price point.", "Date": "December 31, 2007"}, {"Title": "terrible", "Author": "John T. Barrett", "ReviewID": "R82OB8XXKSDMN", "Overall": "1.0", "Content": "Overpriced piece of junk.  This camera is terrible in low light.  The camera has a maximum slow shutter speed which means you can't shoot in even moderately low light conditions without the moderately crappy flash.  Instead of using a slow shutter spead to collect enough light, the camera annouces the shot is 'underexposed' and simply uses its maximum shutter speed and you get a dark shot.  Cameras that cost a third this much can do this totally normal function.  Why this works so poorly is beyond me.  I'm annoyed to have to return this piece of junk.", "Date": "April 26, 2008"}, {"Title": "Did not like", "Author": "Stephanie Durand \"Mom of 5\"", "ReviewID": "R2R76C7ALRZUP1", "Overall": "1.0", "Content": "I bought this thinking because of the reviews here that I would love it. Boy was I wrong. I played with the settings and tried to get my pics to come out better but all I got was washed out pics and the clarity was terrible. Movie mode was even worse. I took a video clip of my daughter walking and her face looks like squares of dancing colors.There is a Best shot button (something like that) with tons of options but by the time you get the one you want the photo you were going to take is more than likely gone.I have to admit, I am usually a Canon user but was willing to go to Casio if it was better. Needless to say I returned the camera and I am going back to Canon.", "Date": "March 11, 2008"}, {"Title": "EX-Z1080", "Author": "M. Mullaly \"Wallywirld\"", "ReviewID": "R25KYP475KSRNJ", "Overall": "5.0", "Content": "Great images from a compact 10MP camera.Easy to use, battery last long time...", "Date": "June 13, 2008"}, {"Title": "Giving as a gift, but want one for myself!", "Author": "Sarah Francis \"lexus7321\"", "ReviewID": "R3EX5X2IN2X5BY", "Overall": "5.0", "Content": "My fiance and I bought this camera as a gift for his parents.  The shipping was extremely fast and the camera is amazing.  Although, we haven't used it yet, we bought a Casio Exilim 6MP last year and absolutely love it!  So, we knew exactly what type of camera to buy them and now we are going to register for this one!  You can't beat the 10MP!  Most big retail stores don't even have them in the store right now.  This camera is a little thicker than our 6MP , but it has a lot more power!Their camera recently failed at our engagement party and his mom was really upset.  So, we know that they are going to love it, especially with all of the events coming up!", "Date": "December 2, 2007"}], "ProductInfo": {"Price": "$279.99", "Features": "10 mega pixel, 3x optical\n2.6\" Wide Bright LCD\nFace Detection Technology\nYou Tube Video Capture Mode\nMPEG 4 H.264 Video", "Name": "Casio Exilim EX-Z1080 10MP Digital Camera with 3x Anti-Shake Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51ii-rX7XHL._SY300_.jpg", "ProductID": "B000VH81IK"}}