{"Reviews": [{"Title": "Good image quality but other features need improvement", "Author": "W.P. \"Naive adventurer\"", "ReviewID": "R1IPYYD638CZPG", "Overall": "3.0", "Content": "I am pretty much a point and shooter but I have owned 3 other digital cameras (Fuji and Canon) before this one.  My most recent one was Canon A75 so my review is pretty much based on my prior experience with these cameras.Pros:- Good image quality overall.  Auto focus works well most of the time.- the AF assist lamp and flash are powerful making low-light images come out very clear and, somehow, both the subject and background are balanced.  I can see the background that is like 10 foot behind the subject clearly.  Canon was very poor in this area.  The Canon's AF lamp was very weak and almost useless.  Canon's flash was also bad and pictures with flash often had subjects very bright but background dark.- 5X and 8MP work as advertised.Cons:- battery life is not so good.  I initially used a pair of old (but still good) 2300mAh Sony.  It lasted only a few hours of testing.  I probably took about 40-50 shots and 10 video clips.  The video mode drained more battery and would report that the batteries were dead and shut down after a few seconds of taking video.  The batteries however still had a lot of juice in it and I could still take a lot of pictures.  I switched to a brand new pair of 2500mAh Energizers and the video mode then lasted a lot longer.  So, make sure you get good batteries and bring spares with you.- microphone strength is poor.- when switched to video mode, it has a pre-zoom of 1.5X or so.  This is bad because it forced me to have to step away from the subject (usually my children) and make the sound even weaker.- performance is below average.  Camera turns on quick enough.  There is a noticeable shutter lag but still acceptable once you get used to it.  However, flash charging time is very slow - about 3 secs or so.- burst mode is useless because it's very slow.  no difference than taking consecutive shots manually.- ASR mode is slow.  It takes 1 sec from press shutter to LCD black out to shutter sound play, then another 1.5 to 2 sec for post processing.  I don't consider it useless as most other reviewers say.  It works.  I had some better pictures using ASR when the subjects are far and in shade or low light.  In an indoor situation, it is better going with flash.  Also, because of the shutter lag and slow shutter speed, ASR is not good with moving subjects (but I think Image Stabilizer in other manufacturers can't handle this either).-The size is bigger than expected.  \"1 inch thick\" is misleading.  The slimest part of the camera is 1 inch!  The side that you hold the camera is about 1.3 inch thick and beware that the len is thick.  If you're concerned about the size, check out the 3D image at Samsung website first.Goods and Bads for VIDEO mode:- Now the MPEG4 feature, which is the feature that got me to buy this camera.  Because of the compression advantage, I could use normal SD card (non-high-speed) to record highest resolution video fine.  The video quality was somewhat a mixed feeling and I need to do furthur research on this.  I used DivX Codec and Windows Media Player to play this, did not try the attached software.  I didn't expect the media player to make a difference.  The avi file was actually indicating it's Xvid but I wasn't able to use Xvid codec to play it for some reason.  When played at its native resolution, the videos look OK.  When enlarged to 2X or full screen, the compression artifects become very visible and the video look pretty bad i.e. moving subjects will have clear noise around the edges, low light videos will have noise all over.  Sure I understand the fact that the quality is lower when I enlarge it.  My point is the noise I get when I enlarge a M-JPEG video or a DivX movie is far less disturbing than what I get from this camera.320x160 mode is useless as it's small and you always have to enlarge the video when viewed.  640x320 is acceptable when viewed at its native resolution.- I tried to play some 640x320 files with my MPEG4-capable DVD player on my 21inch TV and the videos look decent enough.  The fast moving subjects look a little jerky sometimes but not bad and the noise is much less noticeable.- I found 20fps very useful for saving storage as the quality is good enough for slow moving subjects (most other cameras only support 15fps or 10fps for slow mode).- Optical zoom works in video mode.  Sound is mute only while the len is moving.", "Date": "March 26, 2007"}, {"Title": "Nice camera", "Author": "T. Tokgoz \"Albatros\"", "ReviewID": "R31R57DJ75IHOM", "Overall": "4.0", "Content": "I am using this camera for 1 month, I have to say that it is bigger and heavier than it seems on the pictures. But when I use and learn more about, I definitely like it. You have full control on every setting with really impressive video recording quality. Good battery life and user friendly menus. The only defect I found is, if you zoom during recording a video, the sound fades away. One of my friend has NV10, and its same. I think this is related with the software of Samsung camera. Whatever, you got a nice camera for a good price.", "Date": "May 14, 2007"}, {"Title": "Disappointed", "Author": "The Devil's Advocate", "ReviewID": "R21HY1UQMSUQB2", "Overall": "3.0", "Content": "I bought this camera mainly for its MPEG-4 movie capability. Because of it's performance in this area I am greatly disappointed. I've had other cheap cameras from the likes of Aiptek and they are more or less on par in video performance with this Samsung. Given that the Samsung costs twice as much I expected more, not DVD quality mind you but video that would be acceptable on  youtube.com. What you wind up with is grainy, poorly compressed video with hardly any sound at all, even in the best lighting conditions. I did all my tests at 640x480 and at that resolution the video was complete crap. If this video was scaled down it looked better but that's a small consolation.As a still camera its performance was much better. The 5x zoom is more than most inexpensive digital cameras, its autofocus was quite good, even the digital zoom worked acceptably well and the color quality was also pretty good. One thing you should disregard in considering this model is the anti-shake feature. As Samsung implemented it, it's nearly useless. Anti-shake is available only in one special mode and the camera takes forever to capture an image in this mode. In contrast, Canon has a similar feature that is available in most shooting modes and it doesn't affect the image capture time.All in all, it's a decent budget still camera but nearly worthless for video (like most still cameras). At $200 I'd say your money would be better spent on a Canon digital camera.", "Date": "March 12, 2007"}, {"Title": "\"advanced\"", "Author": "David", "ReviewID": "RQ1C8X0KI2Y1K", "Overall": "5.0", "Content": "I've had this camera for almost 3 days and I've been playing with it since. I have to say, if you are a bigging photographer this is not for you, or you will struggle with the features for a while. It's pretty heavy and maybe a little too good looking. No view finder! (not that you'd need one) The setting's wheel at the top is very nice. Sometimes you just wanna turn it around for pleasure. This camera has a whole lot of settings. You can pretty much do anything you wish with this camera: change aperture, shutter speed, etc. As I said, I haven't had this camera for long but so far, I love it very much. For those who previously owned or now own a digital camera, the zoom buttons are probably right and left right? This camera's zoom buttons is up and down. It takes some time to getting used to it.", "Date": "June 15, 2007"}, {"Title": "Great!", "Author": "Erica Garcia", "ReviewID": "R2D3YRYLDJDIZS", "Overall": "5.0", "Content": "This camera takes wonderful clear pictures. Especially with the advance shake reduction you can never miss a moment. This camera over all is a great product.", "Date": "April 12, 2007"}, {"Title": "Samsung Digimax S850 8.1MP Digital Camera with 5x Advance Shake Reduction", "Author": "R. Davis \"W4NMH\"", "ReviewID": "R38XUGOKRTSBXQ", "Overall": "5.0", "Content": "Samsung Digimax S850 8.1MP Digital Camera with 5x Advance Shake ReductionAs described in other reviews.Replaced previous one that didn't survive a severe blow to the main body.", "Date": "May 4, 2013"}, {"Title": "Lovve it", "Author": "J Divers", "ReviewID": "RSXAIWLJHJTDY", "Overall": "5.0", "Content": "Used it all the time til the sand put an end to it. The pictures were great and the vidieo was great.", "Date": "February 27, 2013"}, {"Title": "Good Camera", "Author": "Winston Hanley", "ReviewID": "RBXKGRJATA9XG", "Overall": "4.0", "Content": "I bought this camera in 2008... was just starting out with photography at the time and the longer I've had it,the more features I've discovered.I love this camera... The images come out clean and crisp. There are so many menus and options to tweak the camera and once you know how to use it, you'll get great pictures. It's a nice point and shoot that packs a slightly professional look with a very casual layout...I agree with others that video is not the best but if you're NOT looking for a video camera... this is it... I highly recommend this product.", "Date": "July 1, 2011"}, {"Title": "Decent Product", "Author": "craig gennrich", "ReviewID": "R3GRAH8GTP5786", "Overall": "3.0", "Content": "The camera features and operation are great. The problem is that the lens sticks out from the body, so \"slipping\" it into your pocket is not an option. Besides the bulky shape, its a great camera.", "Date": "June 2, 2009"}, {"Title": "Samsung Digital Camera", "Author": "Ms. S. D. Findlay", "ReviewID": "R3MFORY4PYOFCI", "Overall": "5.0", "Content": "I purchased this camera with a lot of research in all aspects, especially as this was my second digital camera.  The result was the Samsung Digimax S850, and as a second camera I was not unhappy with the purchase, infact, a year on, I can honestly say that I made the best choice for me, and can recommend it if you want a no nonsense, easy to follow, excellent picture camera.  I am no expert on cameras, but this one just does what you want and even though the battery life is short, I found that with lithium batteries, it lasts a good deal longer, and I am not constantly trying to find batteries, for that moment.  I would recommend this camera, I like it so much that I bought one for my mum and she LOVES it.", "Date": "July 5, 2008"}, {"Title": "Looking for the warranty", "Author": "adam773", "ReviewID": "R3N2HYOJ9P8QN0", "Overall": "1.0", "Content": "Well, it took 3 weeks to receive because UPS lost it.  Worked for about 4 days until it wouldn't turn on (the lense is stuck in the extended position) and started making a weird beeping noise.  Before that, I had trouble getting it to set to the auto mode but that seemed to go away.  The pictures weren't all that great but manually adjusting the aperture and shutter speed helped.  This is not a very good point and shoot camera.  In short, I would save the money this thing costs and buy something more expensive, which is what I am going to have to do anyway.The good news is that the vendor, PC Universe, was very helpful in getting the product found and delivered to me.  They actually answered their phones right away the several times I called them.", "Date": "May 30, 2008"}, {"Title": "Samsung S850 is good but its a battery hog.", "Author": "D. Peters \"ORV4Me\"", "ReviewID": "R128TYLPBG87AD", "Overall": "4.0", "Content": "Over 1 year later it still works fine, even after a 4ft drop to asphalt.Its fun with a lot of features you will most likely never use. Frame your pics with several premade frames. Record audio to go with your pics. Nice fades during the slideshow. It seems to have all the usual film settings for a mid grade camera, I leave it on auto 95% of the time. Plenty of resolution to heavy crop most any pic and still be sharp. I usually end up making some gentle brightness/contrast changes in editing.Drains NiMh batteries so fast. Keep at least 1 set of spares at all times. Won't even work with some older NiMh. Won't work for long at all with any standard alkaline, somuch that its a complete waste to use them. Never tried the Lithium.Poor battery life is not a factor in picture quality thankfully, so overall I'm happy with the performance and features of this camera.", "Date": "April 21, 2008"}, {"Title": "You get what you pay for", "Author": "R. Boyd \"Customer\"", "ReviewID": "R1LJB8CT4UIK3E", "Overall": "2.0", "Content": "I always had Cannon cameras and they worked great but broke easily and the customer service was horrible.  I bought this camera at sears yesterday and it is back at sears today.  I asked the customer sevice person why the camera was only listed at $123 and he said that he didn't know because he heard that it is a great camera.  After using it for 10 minutes I could tell that the quality was bad.  I bought the camera for the 8.1 MP however it didn't seem to be any better then the ratio on my cannon which was 3.2.  A friend told me that the MP doesn't matter if the lense is bad.  After using the camera for about 25 minutes the batteries died.I only recomend this camera if you want something cheap that takes ok pictures during the day", "Date": "February 17, 2008"}, {"Title": "Don't Like It", "Author": "P. Bye-Erts \"pbye-erts\"", "ReviewID": "R31835KRGL54AN", "Overall": "2.0", "Content": "I have had this camera for a couple of months, and am looking to replace it.  My chief complaint is the lag time in between pictures.  It takes FOREVER to shoot multiple shots, and you can forget about getting a pic of a sporting event.  There also isn't a view finder, so all shots must be taken from the screen.I've only used one or 2 of the features.  I do like the video capability.  However, this camera is NOT user friendly, and needs a lot of study.The size is one of the reasons that I bought it - nice and small - fits easily into a purse.  However, the slow speed just don't make this camera practical.", "Date": "January 30, 2008"}, {"Title": "its just ok...", "Author": "K. Green", "ReviewID": "R36G8TZKU1ERQK", "Overall": "2.0", "Content": "I bought this camera in March. While it isnt a full blown bad camera, it isnt a real good one either. It takes beautiful pictures, as long as you dont put a zoom in. As soon as you start in with the zoom it starts to blur and gives you the little notice that you are shaking. It does this even on the tripod. It also does not work well if your subject is moving... At all...if anything moves before the camera decides to go from \"capturing\" to \"Processing\" your picture is gone. I would say its a good camera for someone just learning to take pictures and not wanting a lot of close ups, on the move type, or wild life pictures. Since the majority of my pictures are wildlife, close ups, scenic, and moving and I usually need to get them taken fast, this camera isnt working for me. I have just today 6 months later purchased a different camera. Like I said, it does take beautiful pictures...when you can actually get the shot you intended.", "Date": "September 1, 2007"}, {"Title": "Camera review", "Author": "Lizzy", "ReviewID": "R35CICJ1LH7U21", "Overall": "1.0", "Content": "This is supposed to be a good camera but I have had very little success with this camera. The seller sent me a defective product.", "Date": "May 18, 2011"}, {"Title": "Do NOT Get This Camera!!!", "Author": "Dave Powers", "ReviewID": "R3IIBEL11ONT4T", "Overall": "1.0", "Content": "Out of hundreds of reviews I've done over the internet this is the very first time I have been filled with rage from the fiery pit of the dragon and hated a product so much from the pit of my soul. So don't think I'm one of these clowns that bash everything. 99.9% of things I get I can figure out and like very much.We use alot of cameras for our internet business. We need a no-nonsense camera that WORKS. We have had plenty before that work great, this is NOT one of them.WHAT I HATE ABOUT IT:- If the universe comes to a dead standstill, maybe you can get a clear picture, but 99% of the time its blurry.- Oh, you want to go into the setting and make it better? Good luck sucker! I hope you have all day and home owners insurance cause you are about to punch a hole in the wall!  Buttons and layout are very non-intuitive and no matter what you do, the camera refuses to take a clear picture.- Most of the buttons are black on a black camera!!! So if you are outside in the shade with perfect vision you CAN'T see the buttons! You have to walk into the sun just to start your half hour of jacking around with the piece of junk to try and get it to work which it never does. But when you are an idiot like me you keep trying anyway.DO NOT BUY THIS CAMERA!!!!!", "Date": "September 17, 2009"}, {"Title": "Not bad, but priced accordingly", "Author": "R. Lee", "ReviewID": "R4Z1L52VDER2C", "Overall": "3.0", "Content": "My mother purchased this for me on my birthday gift (she's in her sixties) and is very thrifty. I saw it and thought well it doesnt look all that trendy. All in all camera takes very clear pics only as long as your subjects dont make any sudden moves. Zoom is good also it stays clear, until you start using the optical zoom at about 3 megapixels or higher. For the price its ok, not the one I would have picked if I purchased it though.", "Date": "June 14, 2008"}, {"Title": "Fast shipping.  Excellent Service for Amazon", "Author": "Peter Kam", "ReviewID": "R31J0Q4VXTLH3K", "Overall": "5.0", "Content": "I received the camera within the estimated shipping date even though it's out of stock.  Always good to buy things at Amazon.", "Date": "August 12, 2007"}], "ProductInfo": {"Price": "$299.00", "Features": "8.0-megapixel CCD captures enough detail for photo-quality 16 x 22-inch prints\n5x Advanced Shake Reduction optical zoom; 2.5-inch LCD display\nShutter speed to 1/2000 second; ISO equivalent to 1600\nCaptures video in one of four resolutions, up to 20 fps at 800 x 600, encoded as AVI MPEG-4 video\nStores images on SD memory cards (includes 45MB internal memory)", "Name": "Samsung Digimax S850 8.1MP Digital Camera with 5x Advance Shake Reduction Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/413rDiLSdZL._SX300_.jpg", "ProductID": "B000MAL46C"}}