{"Reviews": [{"Title": "R817 is a great buy!", "Author": "D. Corbishley", "ReviewID": "R2A9UYCSWAUBR9", "Overall": "5.0", "Content": "Now that I've used the camera for a few months I'd like to update my review (scroll down to see original).  The problem I mentioned about using the camera in bright sunlight can easily be fixed by increasing the screen's brightness.  Battery life has been great, far better than my last camera with rechargeable AAs.  Camera is super easy to use and gives great pictures.  For example, I frequently change modes depending on the lighting and that feature is easily accessed from a button on the top of the camera, not through a series of menus.  Friends have been impressed that you can zoom in video mode, something there cameras cannot do, and the built in help screens.  Used the panorama feature on a recent trip to Vancouver and was simple to use and gave great results.  I highly recommend this camera for its size, features, and ease of use.Original: I'm really enjoy my new R817.  It's easy to use and the buttons are all in the right places.  Menus use are easy to follow.  Friends I've showed it to all liked the feel and ease of use without no dials.  I bought it for the size and zoom and I'm not disappointed.  Like all cameras without a view finder, it can be hard to see the screen when shooting into direct sunlight, my only negative.  Also bought the quick charger for the extra battery and case and like the case.  Looked at the new Nikon L1, but the one in the BestBuy was broken so I have no idea how it works.  I figured this was not a good sign.", "Date": "October 30, 2005"}, {"Title": "Very happy with my purchase", "Author": "Truth Teller", "ReviewID": "R2PVTXT9REZYLX", "Overall": "5.0", "Content": "I first borrowed an r817 (same as r818 except for color) from a friend for a trip to the grand canyon and a trip to Vegas. I was a little worried about the lack of a view finder (only LCD) because I thought it may not work well in bright light or might run the batteries out, but I quickly got over that worry.  The camera did incredibly well in the bright sun light at the grand canyon and I never had battery problems. The panorama mode was awesome!  I was able to create some phenomenal shots using it at the grand canyon.So, I purchased the r818 (same as r817 except for color) myself about a month ago and I am very, very pleased with my purchase.  The camera is small, light-weight and does not compromise on quality.  It is also very easy to use. I actually considered a higher megapixel camera, but after my experience with the quality of photos from my aforementioned trip using the r817 I simply didn't see a need for the additional megapixels.  I actually decided that 5x optical zoom was more valuable to me than the competing 3x optical zoom.My only nitpick on this camera are that the indoor shots can occasionally come out a little off color.  However, the image zone software that comes with does a good job with correcting it.  This is my third digital camera in the last 4 years and I have to say that I am the most pleased with this one.  It is really easy to use and has loads of extra little features.", "Date": "April 21, 2006"}, {"Title": "Very Good Camera", "Author": "M. Bridges \"Shopcat\"", "ReviewID": "R3KRC5KE1DHFP9", "Overall": "5.0", "Content": "I love to try different cameras, I have been using the R-707for a year and like it very much.I have been using this new R-817 for two weeks, and I love it.It supports high speed SD cards, the 640 X 480 Video is Great.The 5X optical zoom is very nice.I carry this camera in a radio pouch with a belt clip (not loop)everywhere I go, in seconds I am ready to take a pic or vid.", "Date": "July 30, 2005"}, {"Title": "Worth the money", "Author": "Richard Baker", "ReviewID": "R1JEIGSMCWPXG1", "Overall": "5.0", "Content": "This is my first digital camera. Prior to this I had a simple Kodak point-and-click model which pretty much the quality of a disposible.  I use much higher grade cameras at work both 35mm and digital.  This camera gives you the 5.1 MP ability though most shots only require the 3MP.  I like the 32MB internal memory though I've also bought a 256MB card for traveling. The 5x zoom isn't as cool as I initially thought it would be and digital zoom works sometimes and not others but you must understand what digital zoom really is.  The camera takes very clear and optimal pictures. Better pictures then I've taken on anything else I've owned before (and some of the work cameras as well).  The size is small enough to put in your pocket but not too small for one with larger hands. The different flash options and shooting scenes can turn difficult pictures into what you want to capture.  The panoramic shot sequence is an especially favorite feature especially for shoreline shots.  I've also bought the R-Series dock and enjoy its ability to transfer my pictures faster and charge two batteries at once.  This camera is worth the price you pay but I believe its a 2005 model so it may not be the most up to date but it does a great job.", "Date": "August 28, 2006"}, {"Title": "charging was a pain", "Author": "C. Faris \"RedSoxTina33\"", "ReviewID": "R1Z6ZU0LTAI66L", "Overall": "2.0", "Content": "I loved the camera, absolutely loved it.  I was using it one night and it died.  I went home and put in on the charger and nothing happened.  The light on the charger didn't flash or the camera didn't even go in after dying.  The second time I used it, I just got back from vacation and put it on the charger.  I was able to turn it on to look at the pictures.  As I was looking at the pictures, it just shut off.  I was unable to find a way to turn it back on or even shut the nose.  I would not recommend it for this reason unless the charger you get is different than mine.", "Date": "April 4, 2006"}, {"Title": "NO OPTICAL VIEW FINDER", "Author": "R. M. Hutchins", "ReviewID": "R3M3EVM9LTG0W2", "Overall": "3.0", "Content": "Just so you are aware -- this camera does NOT have an optical view finder; you MUST use the LCD on the back to target your photograph; there is no eye sight through an optical view finder -- for us who are accustomed to the OLD 35mm cameras, not using an optical view finder is uncomfortable.Furthermore, just so you are aware, this camera uses a proprietary battery (you can't use standard-sized batteries -- ie; AA-sized batteries); you must use the accompanying battery charger to charge the battery.  Thus, no ability to temporarily use AA batteries.", "Date": "September 7, 2005"}, {"Title": "Excellent digital camera", "Author": "Donna Ellingson \"gram9\"", "ReviewID": "R22BNVFX5E5AB7", "Overall": "5.0", "Content": "Very satisfied with this camera.  I am not a pro, but use constantly for personal use and have no complaints.", "Date": "November 30, 2007"}, {"Title": "Great Overall Camera", "Author": "Sheng Xiong \"rock_e_80\"", "ReviewID": "R2M0RDCHM0ZEAL", "Overall": "5.0", "Content": "I've had this camera since 2005 and it has done exceptionally well.  With the correct lighting, this camera can take pictures that look professional.  Ive taken shots that look like they were done in a studio.  Most of the pictures taken turn out normal, and some very ugly.  One thing that was kind of annoying was when you camcorded and you zoomed in/out, it made a mechanical noise which can be heard in the recording.  I lost this camera about 7 months ago and tried looking for the same model. The R817's are pretty hard to find. I now own a Sony T100, which doesnt compare to the HP R817.", "Date": "August 2, 2007"}, {"Title": "Great little camera", "Author": "Diana L. Combs \"Lady Di\"", "ReviewID": "R83DVA37GOMW5", "Overall": "4.0", "Content": "This camera was easy to use, and I love being able to take both video and still shots with the same camera.  It's hard to see the object you are shooting when you are in the sun, but it took some great pictures.", "Date": "June 11, 2007"}, {"Title": "Good Pictures, Terrible Durability", "Author": "A. Berns", "ReviewID": "R2TFKLIAMK4Z5B", "Overall": "2.0", "Content": "This camera took some great pictures, and I enjoyed it's size and functionality for several months.  I was sitting in a lawn chair at a barbecue last weekend when I was passing it to a friend who was also seated.  The camera fell about 2 feet onto soft grass.  THE END.  The lens assembly is shot, according to my local camera store, not economical to fix.  This was about the softest fall a camera could take, and not work, it was like landing on a pillow.  I will not buy HP cameras again.", "Date": "August 22, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.0-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n2.0-inch LCD; 5x optical zoom\n32MB of internal memory\nIn-camera red-eye removal; VGA video at 30 frames per second\nStores images on SD memory cards; powered by a rechargeable Li-Ion battery (battery and charger included)", "Name": "HP Photosmart R817 5MP Digital Camera with 5x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41DSQYXDQCL._SX300_.jpg", "ProductID": "B0009JQROK"}}