{"Reviews": [{"Title": "Good things do come in small packages!", "Author": "\"cutelilangel4830\"", "ReviewID": "RS7H9XU7ILF13", "Overall": "5.0", "Content": "As a first time digital camera user I found the Nikon 885 extremely simple and user-friendly. The user manual is very easy to understand and it is easy to find what you need. The small size is great for traveling. The shutter speed seems fine to me although I heard some people found it to be very slow on their cameras.One of my favorite things about the camera is the movie feature. You can make a 40 second movie without sound and play it on your computer. I was impressed with the quality and even in fine mode the 'movie' only takes up the memory space of 7 or 8 pictures. Which is hardly anything if you have the 128 mb card which takes 80 pictures in fine mode, 157 in normal mode and 302 in basic mode.One of the bonuses of owning a Nikon is that the memory card that it takes is made by several different companies and therefore cheaper and easier to find. The Sonys, on the other hand, only accept Sony Memory sticks, which is very annoying because some computers and printers do not accept the Sony disk, while almost every device will take the one used for Nikon. I bought a device to plug into my USB port that I can insert the disk into to download onto my computer so that the battery of my camera isn't running out while it uploads. Oh while I'm on the subject of batteries another great thing about Nikon is that it has an adapter to charge your battery outside of the camera so if you have 2 batteries, one can be charging while you're using the camera. Oh, and if you are on vacation or something out sightseeing and your battery goes dead you can run into a shop and buy regular camera batteries b/c Nikon made their cameras to accept them too.Another one of my favorite things is the scene modes. This is something that was important for me because I know very little about photography. I really needed a camera that I could just point and shoot and Nikon was the only brand the scene selection feature where you don't have to focus it and decide whether to use flash or not and all that stuff. The twelve scenes are portrait, party/indoor, night portrait, beach/snow, landscape, sunset, night landscape, museum, fireworks show, close up, copy (black & white), and  back light.Well I hope you found this review helpful. Obviously I'm very happy with my Nikon 885. If your looking for a cute, compact, easy to use camera then this would be a good choice. Good luck!", "Date": "May 31, 2002"}, {"Title": "Excellent optics and software", "Author": "Memo \"Digital enthusiast\"", "ReviewID": "R3QPP2TC3KO2YS", "Overall": "5.0", "Content": "I have searched for several weeks for a digital camera, and although I own a Canon Elan 7e conventional SLR, I went ahead with Nikon and I am very pleased for having made this choice.If you want to get a 3-4 MP camera, I would like to tell you why you should consider this camera:1. Excellent optics. Very crisp pictures, good color adjustment. (you can always depend on Nikon because the commpany is dedicated to optical instruments in contrast to some other companies who produce digital cameras, speakers, PDAs, TVs, radios, keyboards etc at the same time! Makes sense?).2. Size: It is compact and light but at the same time gives you the feeling of holding a camera and not some nonspecific electronic rectangular object (which I value very much).3. The zoom: 3x optical zoom is not provided by other brands with similar value and MP. They all offer digital zoom and all of us know what that means!4. Software: Very intuitive and easy to learn. I did not have to read the manual to understand the menus and that is a great plus. The Custom mode offers several settings from room lighting type to bracketing, and several other stuff that you will enjoy using. But the bottom line is, you actually can get to use the camera the way you want to just by the click of  a single button.5. The Macro mode: Fantastic! You can get close up from 1.6 inches and this is real. Try the other cameras and get  a close up at that distance. I have tried but could not succeed. If you are going to use the Macro mode, be sure to try all the brands but when you try, you will see that Nikon has an excellent macro mode.One problem I have encountered is the focusing sound the camera produces when it focuses. However, at day 2, I realized that it was due to the default continuous AF mode and when I switched it to single AF, there was virtually no sound. If that sound had persisted, the camera rating would have been 4 stars and I am so glad that you can actually get rid of that sound. Some people may not find it bothering but I did!Amazon offered it at a great price when I bought it and I don't know if they will continue selling it because it is so good you don't need any better (unless you want to print pictures with sizes > 11x14 inches, where Coolpix 4300 or 4500 would be better suited to your intentions. However, for that paper size, remember that each shot will be of about 2 MB size)I definitely recommend this camera to people looking for 3-4 MB range. Just try it before buying any digital camera. You will notice the difference.", "Date": "December 18, 2002"}, {"Title": "Hard to Outgrow the 885", "Author": "Samuel W. Feinstein \"Sam Feinstein\"", "ReviewID": "R2EOJAFI1KE782", "Overall": "4.0", "Content": "I waited six months to review the Coolpix 885 to see how it was to really live with this camera.  After shooting over 2,000 exposures, I can tell you that I love the 885.  Anyone who is not satisfied with the results has got to buy a new printer and try again is all I can say.  Try taking photos in the FINE mode and you will be very satisfied with all but insanely huge enlargements.  Use the HIGH resolution (.TIF) and it will be difficult to hurt the resolution in any enlargement.  (I know you think you are not enlarging very much, but if you take the center 10% of an image and try to make it into an 8x10 print, that is a monstrous enlargement.)  This camera is good for a family where on might leave the camera set on full autoprogrammed mode and the other would prefer the absolutely total controll offered in the Custom Shooting Mode.  Guess what.  About 95% of the time, you wouldn't be able to tell the difference.  It is a huge plus that the 885 will take macro shots from about one INCH away.  It is a huge plus that the optical zoom range is 4:1 with another 4x digital zoom.  It is a huge plus that you can zoom in 4x when viewing an image in the monitor so you can evaluate focus in critical areas.  My only complaint is that the f: stops are not really f: stops and I wish that were not the case.  You have complete control over the shutter speeds from 1/1000th to 8 seconds, but there are only two apertures to toggle back and forth between.  I guess that's one reason to go up a level, but then you have to deal with a swivel in the middle of the camera and I am always afraid something like that is one more weak link that is destined to break.  Buy at least two rechargeable batteries and 128 or larger Compact Flash Memory.  Buy a USB card reader and don't hook the camera to your computer to download images.  Just read them directly off the card.  This will save batteries immensely.  With the price hovering in the [$] range now, I think the 885 is the one to snap up before it is discontinued.  It's a bargain.", "Date": "September 16, 2002"}, {"Title": "Works okay, but could be a little better", "Author": null, "ReviewID": "R2BHGKL5W71DZV", "Overall": "3.0", "Content": "I bought this camera about 8 months ago. I'm a grad student in a design related subject, so I often need to take several dozen reference pictures in a short period of time (many of which I won't keep).  Digital is a great way to go considering film processing costs.The good about this camera is that the image quality is high.  I use it in high resolution mode, so I have more flexibility to manipulate the photos later in Photoshop.  It also has a surprising ability to shoot in low-ish light without its flash.It is a very simple camera to use.  I don't use any of the proprietary software that came with it, such as the photo organizing software, but instead simply plug it into a USB port and treat it like an external drive.  It also comes with a battery and charger, which seems to last for about 40 or 50 pictures (depending).  I usually leave it to charge in the evening overnight and it is fine.However, there are also a few frustrating aspects.The software that it comes with is pretty much junk, so if you don't already have a graphics package on your computer, this is worth considering.  I never really figured out how to use the photo database program effectively, because it told me it had \"expired\" after only a dozen or so pictures were down loaded (apparently a $[amount] camera still doesn't get you a full licensed software package--which it later prompts you to buy).  I would ignore the included software completely.The camera also really likes the colors red and orange, and they sometimes turn out nearly neon.  Again, if you have Photoshop or something like it, this can  easily be corrected (and it doesn't really bother me).Likewise, this camera doesn't have many modes like B/W and sepia like some other cameras (i.e. Sony) have, but if you are into digital manipulation this is easy enough to do yourself.Like most digital cameras, the memory included is way too small to be useful.  The one accessory that I purchased was a 128 mb flash memory card.  Although 128 mb is a lot, I would say that the minimum needed for this camera is probably 64 mb.  So add about $[amount]to the price for your memory.Other annoying aspects:  there is a pretty big shutter delay from when you press the button, meaning that this camera will not work well for sports or action shots.  Also, even when the battery is fully charged, my camera goes to standby after only about 15 seconds, and takes a few seconds to come back on.  I've tried to change this, but the settings seem to have no effect.  So again, spontaneity is not it's strong suit.Overall, a functional camera that is reliable and works well, but with a few wrinkles.  It is about what I expected from a \"newfangled\" emerging technology.", "Date": "December 15, 2002"}, {"Title": "Great mid-range price with high-end features", "Author": null, "ReviewID": "R3IU3VFXT4H158", "Overall": "5.0", "Content": "I've had this camera for a week and am thoroughly impressed.LOTS of controls (manual) and a dozen \"scene\" presets augment a fine \"auto\" system for point-and-shoot through numerous custom options. And rugged! I just dropped it from waist high onto macadam -- still works fine! (But I won't try it again...)Filters and other lenses readily available. The owner's manual is well-organized and guides the user through a myriad of options. Most of the controls are intuitive and easily remembered, making this camera a pleasure to use.The camera's small size makes it easy to pack along on any outing: which gave me the opportunity to snap photos of a car fully aflame by the roadside last night! The preview screen is on the small size, but adequate. The bundled software package is also good.Check out the web for more detailed reviews, but I couldn't be more delighted (without spending well over $1,000).", "Date": "April 23, 2002"}, {"Title": "One Major Flaw...", "Author": null, "ReviewID": "RN2VQU0V4YEBQ", "Overall": "2.0", "Content": "This camera cannot photograph certain shades of red.  Something on the yellow side comes out, but red with a tiny hint of blue -- this camera simply won't do it.  It's very strange.  Those shades of red get shifted toward orange.  And, *no*, it's not just in 'auto' mode.  In 'cfm' mode, no matter which setting you use (even incandescent, which really cranks up the blue), it still happens.  I've tested this problem with two different 885s and one 995.  They all did the same thing.Why two stars and not one?  Because the interface is pretty good, and the custom (\"cfm\") mode lets you do a lot of interesting things.  I think the optics themselves are also above average... the color problem seems to be something in the firmware.I would suggest the Canon S30 or S40 instead.  The S30 is exactly the same price, and is a much better camera in every respect, from interface to optics.  I've also had a Sony digital camera for a long time, and I think it's very good.  If you do buy a Sony, make sure it has a Carl Zeiss lens -- not all of them do!", "Date": "August 15, 2002"}, {"Title": "The Nikon Coolpix 885 is an excellent buy", "Author": "David Lehning", "ReviewID": "R1OBFLIB4F99V", "Overall": "5.0", "Content": "A friend loaned me her Nikon Coolpix 885 over the 4th of July weekend so that I could try it out. I loved the camera and the quality of the pictures taken at the Fine setting. As result, I went out and purchased one for myself the same weekend. The degree of custom control is also excellent, making this camera good for both the beginner and more advanced photographers. I was very pleased with the image quality even in dim indoor light without the flash.I have read reviews on ohter Web sites where people complained about image quality being poor. I can't understand where they are coming from. The pictures that I took in Fine mode were very sharp and crisp. I used the 3X Optical Zoom and still the pictures were sharp.In the short time that I had my friend's camera, the only drawback I could find was that there is quite a bit of glare in the view finder if you are shooting in bright sun, but other than that, it is an excellent camera for the money.", "Date": "July 9, 2002"}, {"Title": "This is not going to be another Sony commmercial....", "Author": "W. Valiunas \"cne9999\"", "ReviewID": "R217XJT69XRX3D", "Overall": "5.0", "Content": "It is too bad Carlton had to put a commercial for Sony in his review for this Nikon.  Now I have to rebut.  There is one simple fact Carlton missed that was obviously not his primary focus, pardon the pun.  The quality of the photographs.  The quality of the output I receive from my 885 is easily 30% better quality then any thing any of the Sony models can put out.  The color is truer, the gamma is more accurate, and the basic output is far more consistent then any of the Sony's.  Change this setting or that setting...  I don't care.  the bottom line is the final output.  Bottom line... the initial un-retouched photo's this Nikon produces are pretty phenomenal.  Well for a digital camera at least.  After all this is not an F5.I have tried each of the Sony CD models.  They are good but they are no Nikon.  I feel he missed what to me is the most important issue, picture quality.  There are few if any digital cameras available, which produce a better photo then the Nikons.  Sure, some are larger, some are smaller, some are faster, while others have more bells and whistles, and even others are prettier, like the Sony's.  However, not one of them produces a better quality photograph.  Nikon's quality and prowess in the analog camera arena has somehow seeped into their digital cameras.  Their primary focus appears to have been picture quality, not bells and whistles.  Pun intended.  I find that comparing the Sony digital to the Nikon Digital is like comparing the F5 to the OM-4Ti.  You'll have to research that on your own...Don't get me wrong...  There ARE a few things I dislike about the 885.  The little nose print I occasionally get on the LCD display when I shoot, slight design flaw.  You have top pick one up to know what I mean about that.  I also would have changed the pressure required for the trigger.  Nevertheless, the bottom line is that the pictures are \"Smokin\"!One last thing from my craw.  An experience I had with a great Sony audio receiver a few years ago tells all.  Well what I thought was a great receiver when I bought it a few years ago.  I had it for about year.  It served me well.  It had so many features I could never use them all, and was it ever pretty.  Then I got educated on audio equipment.  I read a few rags and talked to a few audiophiles.  Then after purchasing my Marantz SR7000 for about [money amount] less then the original cost of the Sony I really started to get upset with Sony.  Sure my Marantz was ugly compared to the beautiful Sony but...The sound quality of the Marantz was so far superior to that of the Sony.  It was not a small difference but an astronomical difference.  It was such a difference that I vowed never again to purchase another Sony product blindly.  That is without seeing real side-by-side comparisons of the output of whatever the technology I was buying.  I finally saw the Sony's strategy - not to provide the best quality output but to provide the most bells and whistles in the prettiest housings.  Tooling and I.D. is Sony's key.  They do have one very nice line, their Televisions and Monitors and I will not bash those.  However, that is where Sony quality-output begins and ends.  I bet I am really upsetting a lot of Sony aficionado's right now but don't get mad at me.  This is about Nikon, not Sony.  Go to your local high-end shop and ask any guru what they think of any specific Sony product.  Remember I said high-end shop, not Best Buy or Circuit City.  Believe me for the same doe you drop on a Sony \"anything\" you can get a far superior \"anything\" from any decent high-end shop.So enough with the Sony bashing... the Nikon 885 is my concern right now.Fact:  The Nikon consistently produces better quality photographs.  Period.  Just as my Marantz consistently provides me with a far more accurate sound reproduction then the Sony receiver was ever capable of.  After all, my main goal when selecting this camera was to get the best quality photos possible from a digital camera.  No fancy \"this-and-that\".  I just wanted quality photographs.  If you would like to read about the features and the bells and whistles there are several other good reviews on this product and all the other products as well.  My only focus here is to talk about the quality of the output of this camera.Hope you try them all side by side so you can create your own opinion before you buy.  After all that is all this review is.  My opinion, based upon facts I was able to gather firsthand.Thanks...", "Date": "July 27, 2002"}, {"Title": "It's a Nikon, need I say more?", "Author": "Dara Orkand Allen \"wife, mom and technical wr...", "ReviewID": "R2VDWOHZ37EXAB", "Overall": "5.0", "Content": "This is my first digital camera.  I have an original Nikon F and a Nikon 6006 (both SLR's, obviously).  When I ventured into the digital foray, I couldn't bring myself to get anything other than a Nikon.  Boy, was I right!  It's easy to use:  charge the battery, put the starter memory disk in, set it on Auto, and you're off to the races!  You get about 20 pics on the memory disk.  I recommend getting a 128 MB card (Simpletech has a good one), three extra batteries (they die quickly while you're shooting away!), and a case.  All personal preference, and not required.  Enjoy your excellent purchase!", "Date": "November 21, 2002"}, {"Title": "Nikon 885 Review -- Beware of  \"System Error\"", "Author": "Sam Alexander \"Sam\"", "ReviewID": "R1TR9FE1LS4N2O", "Overall": "1.0", "Content": "The Nikon 885 at first glance has the right form factor, features and price.  As a first time digital camera owner it seemed to be a great value.  However, after 3 months of ownership, we are experiencing a \"Systems Error\" message.  Unfortunately there are no clear resolutions to what appears to be a systemic issue with this camera across many customers.  The only resolution is to return the camera to the manufacturer which is unable to guarantee or estimate a return date.  Moreover, the Nikon online customer support web page is absent of any FAQ or other information.  I would not recommend this camera based on my current experience and dissatisfacton with Nikon.  By the way, do not dispose of your original packaging.  Nikon will not support a return/repaire without it.", "Date": "July 27, 2002"}, {"Title": "Don't make the same mistake as I did", "Author": null, "ReviewID": "R2TRFBXQYJTXMX", "Overall": "1.0", "Content": "I've had an excellent history with non-digital Nikon cameras, always believing Nikon was the leader in photography.  Their effort on the digital side has made me reassess this view.  Purchased the Nikon 885 a while back and still having problems.  Did an incredible amount of research, reading reviews, comparing many other 3 mgp cameras, and finally decided on the 885.  One theme I had read about in many reviews was the cyan issue in the photos -- basically anything 'red' in your shot would dominate the picture.  Ignoring those reviews, I still decided to purchase, and am regretting it to this day.  The red in almost every shot stands out, and I mean looks florescent red.  While the rest of the picture is typically fine, the pictures this camera takes is not worthy of the Nikon name.  I've since tried a number of Canon and Olympus cameras, both of which take significantly better shots.  Basically it's a software problem that they haven't been able to fix -- have spoken with Nikon tech people, who have acknowledged the problem, but can't do much about it.  If you want a SLR, get a Nikon -- when it comes to digital, would definitely not recommend Nikon.", "Date": "September 8, 2003"}, {"Title": "ALMOST perfect", "Author": "Donovan Colbert", "ReviewID": "R1V2RATUEHI4GP", "Overall": "5.0", "Content": "I recently bought this camera from Amazon as a replacement for a Sony FD75. The Sony FD75 is a 640x480 camera that writes to floppy disks and has a 10x Optical zoom. I was never very impressed with the optics of the Sony and wanted to upgrade.After a lot of research, I had narrowed the field down to the Canon Elphs, the Mionlta Diamage and the CoolPik 885. All were within the same price range, basic size, and feature set. The Nokia was the clear leader. Buyer beware, this camera is offered in two retail packages. The earliest package does not include a rechargable battery, and many outlets still want the same price for that version as Amazon charges for this version. The Amazon version has the rechargable battery, will still use the disposable battery, and, with no shipping, handling, and tax, is about the BEST deal I could find on this camera anywhere in the US.The Camera is full featured and has a wide range of custom, pre-set, and auto settings. The pictures are crisp, the colors vivid, and the details clear. Great optics. Unfortunately, the one complaint I have that keeps this camera from having a 5 star rating is the *significant* delay between pressing the shutter release and the actual image being taken. Not just recorded to the media, there is as much as a 1 second delay from the time you release the shutter button to the time the image is taken. For taking landscapes, snapshots, and other fairly static images, this is not a problem, but it renders the camera virtually useless for action shots, unless you have ESP. Taking pictures of my 1 year old daughter is very frustrating, because her attention span often doesn't hold until the picture is actually taken. Instead of her flashing a beautiful and charming smile, I get the side of her face as she turns to look at something else as often as not. Outside of this, I would recommend this camera as the best deal currently on the market for a full featured, very portable high resolution digital camera.Late update: I discovered that the delay is caused by the red-eye reduction. By turning the flash off or selecting the non red-eye reduction flash mode, the delay between the shutter release and the picture being taken is reduced dramatically. Perhaps the only fault of this camera is the movie mode has no audio, in comparisson to other similar cameras that do. I considered the movie mode an added bonus, but have found it a great way to take small clips for my website that easily convert into streaming .asf files with the included software. In either case, I gave the camera a 5 star review after discovering the red-eye reduction delay. Honestly, it is probably like a 4.8 star item. It isn't perfect. $100 less and with audio, and it would be.", "Date": "July 26, 2002"}, {"Title": "system error", "Author": null, "ReviewID": "R3FEUT545INWKL", "Overall": "1.0", "Content": "anyone thinking of buying this camera search the net for articles re: system errors. my camera is now dead after 13 months! dont buy it!", "Date": "October 23, 2003"}, {"Title": "best digital camera I used so far...", "Author": null, "ReviewID": "R3SKT7SVBINXRK", "Overall": "5.0", "Content": "I've got this camera for about 6 months now and used it durning normal weather, rainstorms and even in the desert of Egypt. The pictures are allway bright, collerfull and sharp.The camera is east to handle, had a firm grip and the battery is lasting for almost 70 pictures (incl flash and just waiting for the best moment).It realy deserves the 5 starts!", "Date": "July 20, 2002"}, {"Title": "Nikon Coolpix 885 SYSTEM ERROR", "Author": "Phillip Miell", "ReviewID": "RY4VL89TAG5ID", "Overall": "1.0", "Content": "I purchased a Coolpix 885 in April 2002. Within a few weeks I encountered a \"SYSTEM ERROR\" message. I got the camera replaced because it was under new camera warranty. I recently tried to use the custom settings to take pictures in poor light and encountered the \"SYSTEM ERROR\" message again. I believe there is a problem with using this mode. Based on other reviews and given the lack of positive action to address this issue I could not recommend this camera. I have given it 1 star because I have taken around 950 good pictures using the auto modes only.", "Date": "April 30, 2004"}, {"Title": "System Error", "Author": null, "ReviewID": "R1WSFOB4HSUA0G", "Overall": "1.0", "Content": "The infamious \"system error\" appeared on my camera after 12 months. I learned after a searh on the web that this a common eroor in all Nikon digital cameras and the firm is doing nothing to fix it. DONT BUY", "Date": "November 24, 2003"}, {"Title": "System Error problem over and over again", "Author": null, "ReviewID": "R1UF1ZQ667LWR9", "Overall": "1.0", "Content": "I really love my Nikon SLR but would never again buy another compact nikon digital camera. At first I thought I had dropped the darn thing and cause the system error. Now I know better and it has something to do with bad design by NIKON. I am very disappointed and unhappy with this since it took me years to finally decided to spend the money and buy a digital camera. I would have never expected the stupid thing to die after only 1 year of use. If you want to get a digital camera, I think i would look up Canon. Well, atleast I haven't heard too much complaints from others that own a Canon.", "Date": "October 3, 2003"}, {"Title": "Nikon camera's and System Error", "Author": null, "ReviewID": "R1NLQOILYPLUDZ", "Overall": "1.0", "Content": "Had the camera for a few months. Now have got the dreaded System Error message.Removing the battery did not work. Camera is useless now!I will never buy a Nikon camera again!", "Date": "September 1, 2003"}, {"Title": "Nikon 885", "Author": null, "ReviewID": "RDRB45VN2YPV3", "Overall": "4.0", "Content": "great size that fits the hand.  good quality photos.  easy to use controls on unit.  software to pc somewhat complex", "Date": "March 8, 2003"}, {"Title": "I had high hopes for the Nikon brand name", "Author": "tgi", "ReviewID": "R1LTUDBS0FUYCD", "Overall": "2.0", "Content": "I loved the camera when it arrived. The first \"serious brand\" camera I've ever purchased (my prior Kodak DC200 digital had serious design flaws in the battery compartment, causing power \"dropout\" problems) and I really liked the compact size and the flawless optics.But, I'm now about to ship the camera back FOR THE THIRD TIME for repairs for the exact same problem. The zoom lens assembly has a recurring problem that causes the auto-focus to \"lose it\" after several zoom-in/zoom-out shots in sequence, and then all it'll do is say \"SYSTEM ERROR\" on-screen and refuses to power up.Needless to say, this has (Murphy's Law) happened during:1. A wedding;2. A 50th Anniversary;3. 5 birthday parties;4. A Christmas family reunion, some relatives arriving from Australia.It's also got a very disappointing power management issue. Well before the \"low battery\" icon appears, the camera will sporadically power down/reboot upon shooting a picture that requires the flash unit. Yes, it DOES flash, and yes it DOES store the picture. But then you miss the next 2-3 shots because the camera is busy rebooting. Really annoying.I am DEFINITELY unhappy with Nikon, and I receive no response whatsoever to my letters. My next camera will NOT be a Nikon. Plus, now I have to sell nearly a thousand dollars worth of accessories and batteries on eBay.Nikon's lost a customer for life here...", "Date": "June 18, 2003"}, {"Title": "This camera has everything you need......except sound", "Author": "i.lambro \"erikjams\"", "ReviewID": "RKCH9ZOC1GDUV", "Overall": "4.0", "Content": "I have owned the 885 for 1 year, I love it, you can take pictures in almost any condition, Its very easy to use,The optional Fisheye Lense brings picture taking to a whole new level. Also the Wide angle lense almost doubles your picture size. The only thing wrong with this camera is it takes 45 second videos, Which is amazing, But it doesnt record sound.I called Nikon weeks after I purchased it & They couldnt tell me why. I am now buying the 5700 which takes 60 sec. Videos with sound Also has an extra Megapixel & 8x digi Zoom.All in All Its a Great Camera for the price.", "Date": "January 4, 2003"}, {"Title": "System Error and Warning! Remove Lens Cap error NIkon coolpix 885", "Author": "Marilyn Macintosh", "ReviewID": "RIVA4SFSSHNM3", "Overall": "4.0", "Content": "I have had this camera since 2000 and it was my first digital.  However during my sons college graduation last year I received the System Error message (which meant no pictures) and after powering down and up again received the Warning! Remove Lens Cap error (lens cap not on).  I couldn't use it all that weekend but a week later it worked fine so I thought it was the southern heat.  However, it has started with both errors again and I cannot use it for anything.  It even says System Error then it is turned off (hmmm).  Can't say I would buy another Nikon.  I had a Canon for 10 years (old film) and it still working fine.", "Date": "May 30, 2007"}, {"Title": "Fantastic camera...at least for me", "Author": "M. Crumpton", "ReviewID": "R2JGS4ONCM2OR3", "Overall": "5.0", "Content": "I bought this camera in 2001 for $500.  That was alot of money but I have gotten my moneys worth and then some with this camera.  I love everything about it.  I just recently decided to purchase more  megapixels for my scrapbooking but thought long and hard about it before doing this.  I read reviews and searched for cameras and finally decided to stay with the nikon.  I bought a coolpix p4 from Best Buy and got the extended warranty but so far I LOVE this camera also.  I am so sorry it got bad reviews.  I have a fantastic camera here that I am going to sell and don't even know if I want to do that as I have loved it so much.  For me Nikon has been great.", "Date": "May 1, 2006"}, {"Title": "coolpix 885", "Author": "Eduardo Suarez", "ReviewID": "R124U3VNBWZWE7", "Overall": "5.0", "Content": "great camera small and lightweight yet excellents results it has a whole bunch on accesories that makes this camera work like a pro.I've owned one for over a year and no complaints what so ever.", "Date": "October 15, 2003"}, {"Title": "It works for me!", "Author": "Sea Pony \"ponyf\"", "ReviewID": "R3PJN6IRGTBFJO", "Overall": "4.0", "Content": "I bought my Coolpix 885 last fall right before a once-in-a-lifetime trip to Hawaii.  I had only half a day to play with it before we went and that was pretty much enough.  My travel pictures were gorgeous.  I only missed a couple of nighttime action shots and even they ended up being kinda cool because of the obvious movement they showed.  The camera is so small and well designed that I carried it everywhere.  It was never in the way and I got some fantastic pictures.The shutter delay that some people have complained about is a problem but not a big one unless you're a sports photographer.  You learn to accommodate it.  It was the one problem that almost kept me from buying this camera but I'm glad I took the chance.I had no problem with the battery life as long as I didn't leave the camera on too long when I wasn't taking pictures.  I'd charge it at night and it usually lasted me all day.  If I were a real serious photographer, I think I'd want to carry a spare but for vacation snapshots, this one worked just fine.  I averaged about 60 shots per day with no problem.The only complaint I had was that my dinosaur computer didn't want to recognize my camera when I attempted to upload the pictures.  First I had to upgrade my OS.  Windows 98 just wasn't good enough.  Even then it took me a couple of attempts to get the process to work.  That's probably the fault of my computer but it's rather annoying that they don't make the software work for past Windows versions.", "Date": "August 25, 2003"}, {"Title": "Great Camera for Digital", "Author": null, "ReviewID": "R14FAV8L6DA3Q6", "Overall": "4.0", "Content": "I am an amateur the pictures I take are of friends, family and pets.  That said.  I LOVE this camera.  It goes everywhere with us.  (We did get a second rechargable battery and a 128Mb card.)I get great print results and we love being able to e-mail holiday pictures to out-of-towners (the small pik mode is great). We bought it used and complained about color issues but called Nikon they suggested doing a reset and it's been great since.For those of you using Windows don't even bother loading the software!  Windows XP recognizes the camera as a drive and brings up a wizard for you.  Since little retouching is required I just use the retouching from the ofoto.com and the ones I print at home or have them print onto photo paper come out great.My only complaint is the time lapse from pressing the shutter release to image capture. I find that it's better with a fresher battery but most of the people we're snapping are already adjusted to the delay.", "Date": "September 7, 2002"}, {"Title": "Excellent quality camera - Value for Money", "Author": "Sonia J Tress", "ReviewID": "RFZLICN3TYN1L", "Overall": "5.0", "Content": "I have had my Coolpix 885 for 6 months and am very happy with it.  It is very solidly built and small in size, which is handy for traveling.  I normally have the quality setting on fine, size setting on XGA and the picture quality is excellent, very sharp and clear.  I especially like the on-camera feature that allows you to make a small file size copy of pictures for emailing.  It takes the picture file size from 300 Kbytes to about 70 Kbytes while leaving the original untouched.  I found the file transfer software supplied with the camera unsatisfactory - no bother though since I just plug the memory card into the computers USB port using a card reader. The computer then recognizes the memory card as just another drive. I then use Windows Explorer to transfer the pictures to my computer  a very fast way to transfer pictures. The Scene mode is excellent for a point and shoot photographer like me, automatically setting up the camera for 12 different scene types.  The Auto and Scene modes on this camera make it VERY easy to use if you want it that way. If you want to operate it manually it will also oblige.  The cameras use of a Compactflash card allows me to use a memory card adaptor accessory to plug the card into my laptops PCMCIA card slot to place pictures onto the laptop, very handy when traveling.  I would recommend obtaining a larger memory card than the 16 meg card supplied with the camera.  I also love the ability to preview pictures on TV with the very easy to use video cable setup ? just plug the camera directly into the TV or VCR and view the pictures.  This camera has more features than I will ever use but if you want to take quality movies a purpose built video camera is advisable. As with all still picture digital cameras, dont expect quality videos.  The flash red eye reduction seems effective but its power over distance isn?t great This seems to be a common complaint with most digital cameras from the reviews I have read.  Rechargeable batteries are a good idea ? the number of shots the battery is good for varies for each person depending on how they use the camera.  I get about 80 shots per battery charge with the rechargeable battery and about 130 pictures with the disposable. I use the LCD screen all the time and frequently preview my pictures on the LCD screen with the preview feature.  Its a good idea to always carry a spare battery.  I found the owners manual comprehensive and easy to understand.  Overall I am very happy with my purchase and having read reviews for many other brands I am convinced I bought the right camera for me.  It is small, feature packed but very easy to use and value for money.", "Date": "July 20, 2002"}, {"Title": "Good things do come in small packages!", "Author": "\"cutelilangel4830\"", "ReviewID": "R22XKFVJDUVDVS", "Overall": "5.0", "Content": "As a first time digital camera user I found the Nikon 885 extremely simple and user-friendly. The user manual is very easy to understand and it is easy to find what you need. The small size is great for traveling. The shutter speed seems fine to me although I heard some people found it to be very slow on their cameras.One of my favorite things about the camera is the movie feature. You can make a 40 second movie without sound and play it on your computer. I was impressed with the quality and even in fine mode the 'movie' only takes up the memory space of 7 or 8 pictures. Which is hardly anything if you have the 128 mb card which takes 80 pictures in fine mode, 157 in normal mode and 302 in basic mode.One of the bonuses of owning a Nikon is that the memory card that it takes is made by several different companies and therefore cheaper and easier to find. The Sonys, on the other hand, only accept Sony Memory sticks, which is very annoying because some computers and printers do not accept the Sony disk, while almost every device will take the one used for Nikon. I bought a device to plug into my USB port that I can insert the disk into to download onto my computer so that the battery of my camera isn't running out while it uploads. Oh while I'm on the subject of batteries another great thing about Nikon is that it has an adapter to charge your battery outside of the camera so if you have 2 batteries, one can be charging while you're using the camera. Oh, and if you are on vacation or something out sightseeing and your battery goes dead you can run into a shop and buy regular camera batteries b/c Nikon made their cameras to accept them too.Another one of my favorite things is the scene modes. This is something that was important for me because I know very little about photography. I really needed a camera that I could just point and shoot and Nikon was the only brand the scene selection feature where you don't have to focus it and decide whether to use flash or not and all that stuff. The twelve scenes are portrait, party/indoor, night portrait, beach/snow, landscape, sunset, night landscape, museum, fireworks show, close up, copy (black & white), and back light.Well I hope you found this review helpful. Obviously I'm very happy with my Nikon 885. If your looking for a cute, compact, easy to use camera then this would be a good choice. Good luck!", "Date": "May 31, 2002"}, {"Title": "the best lens manufacturer", "Author": "Brian Peyton \"bmp1967\"", "ReviewID": "R2IJ50RY5MAE7Z", "Overall": "5.0", "Content": "the nikon 885 is the best camera I have ever owned. so many features to 30 sec films at 29 fps with no sound.  excellent pictures too.  You must purchase an extra memory card and tripod if your serious about this camera.", "Date": "October 31, 2002"}, {"Title": "Confused at first", "Author": null, "ReviewID": "R1MYUKRE5ALM8Z", "Overall": "5.0", "Content": "The biggest problem I had was loading software as it was confusing. Take some advice, don't try to use the connection to the camera & computer on a USB hub extension it will not work! They said that in instructions & it was true!", "Date": "August 10, 2002"}, {"Title": "Think Twice On This One, You May Like The Sonys Better...", "Author": "Richard R. Carlton", "ReviewID": "R16H02WAMWUH2L", "Overall": "2.0", "Content": "The Nikon Coolpix cameras are great digital units, so I was surprised to discover the Sony Mavica CD cameras are more versitile.  Here is my story:I am a professional radiographer and photographer (25 years now) and I used both the Sony Mavica CD400 & CD300, as well as a Nikon Coolpix for this year's field research season x-raying mummies in Peru. This means the cameras were pushed hard.....blowing sand, huge contrast ranges, high resolution radiographs needed, fast manual control of radical light conditions, etc.....essentially most of the tough conditions and imaging requirements you can imagine. Here's what I found:The Sony Mavica CD300 beat them all. It's not the most expensive or the best resolution but we all thought it did the best job.Mavica CD400: best resolution but extremely slow recording time made it impossible to work with most of the time....the CD300 often got 3-4 shots while the 400 was recording one.Mavica CD300: not the best resolution, but now that I've done some prints for publication from it's highest res setting I will not be buying any more 400s....just not a significant enough difference, plus it's not as heavy or bulky.Nikon Coolpix: not in the running by comparison with the Sonys....although it is more lightweight....we are buying mini CDs for 33 cents each in bulk at BestBuy and getting 140-180 high res images per CD.....they are so easy to format, initialize, and copy on any CD burner that I can't believe we even considered using memory stiks, or USB downloads.The best features are common to both the Sony Mavica CD300 and 400 series though.....manual control of the images, excellent close up abilities, decent wide angle (which can be enhanced with add-on lenses if necessary), and both rapid video and automatic functions with night focusing for flash, etc., etc.Finally! There is a great digital camera....but it isn't a Nikon.", "Date": "July 5, 2002"}, {"Title": "Good choice", "Author": null, "ReviewID": "RTIWJEN3K4FOD", "Overall": "5.0", "Content": "I've had this camera a week or so and I'm very happy with it. The point and shoot options are easy, but there are plenty of bells and whistles if you want to do more advanced photography. The manual is good and easy to follow.", "Date": "May 29, 2002"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0000635UW"}}