{"Reviews": [{"Title": "a great little camera", "Author": "Emma Pearson", "ReviewID": "R1H9T512RNMMR0", "Overall": "5.0", "Content": "i don't know much about cameras, and this is the first one i've ever bought. its small and incredibly lightweight and fits in your jacket pocket. the controls are easy to read and it has a good-sized screen. its easy to upload pictures onto the computer, and the pictures turn out nice. highly recomended!", "Date": "October 11, 2005"}, {"Title": "Not That Great", "Author": "S. Shalabi", "ReviewID": "R35890HJKHWSY", "Overall": "3.0", "Content": "At first I loved my camara, it took really good pictures for a very low price. But then I noticed that I was the only one who was able to take good pictures! If I gave the camara to someone to get my picture taken, it would ALWAYS come out blurry. Also, not a good camara for pictures where the object is at a distance, good for close ups only. I bought it less than a  year ago and I'm already looking into getting a new one.", "Date": "January 20, 2006"}, {"Title": "D435 Overview", "Author": "Tee Time \"golfer\"", "ReviewID": "R1RRJEQIQ6LXGE", "Overall": "3.0", "Content": "I liked the size and compact feel of the camera.  The lack of Optical zoom reduces its' ability to take pictures a bit far away. I would prefer at least 3X Optical zoom. The size of the screen on the back where you view the image to be taken is too small.  Otherwise it was an OK camera for its price. It definitely is a \"beginners\" camera. I needed one one step up!  I will probably gift it to someone and buy a camera with the better features I mentioned.", "Date": "February 24, 2006"}, {"Title": "Useful camera, but with problems", "Author": "D. Roberts", "ReviewID": "R967TZNL6C5Y6", "Overall": "3.0", "Content": "I bought this camera looking for something rather simple to take pictures of service projects sponsored by my non-profit group, Service for Peace. I wanted a camera that was not too expensive, rather light and easy to carry, that would take XD cards (since I already had some from a previous camera), and that would be easy to use, since I often ask other people to take pictures at our events. Naturally, I also wanted clear shots, a durable camera, long battery life, and all those things.Another requirement was that the camera NOT have a zoom lens. All things being equal, a good fixed lens takes better pictures than a zoom lens, and I don't mind moving around to find the best shot. I've also noticed that zoom lenses on digital cameras, because they have to stick out, can be easily dirtied or damaged. Fiddling around with the zoom control seems to make it easy to miss quick candid shots that look really good for documenting projects like ours. With this camera's 5 megapixel resolution, there is no problem cropping down to just the exact picture I need, and since I'm doing it at home with editing software, I can take my time and get it just right. I can also use the same shot for both close-ups and far-away shots.So how did this camera shape up? It is light and easy to carry, and it is simple to operate. It generally works well for documenting my projects. I do have a few beefs with it, however.The most important is that I have been having a problem from time-to-time recently with the camera saying the door for the memory card is not closed, even though it is. This is a problem because the camera will not do anything else until it is satisfied the door is closed. So far, I have been able to get the camera working by opening and closing the door several times, and reseating the memory card, but I know the day will eventually come when I will miss an important shot because of this problem. Also, I fear they day will come soon when just opening and closing the door will no longer solve the problem.Another issue I have found is that if you put the camera in your pocket, it is quite easy to slide the OFF/ON button to the ON position. This does wear out the battery a bit before the camera goes into sleep mode, but a greater problem is that the whole time the camera is in your pocket, the lens is open, and can easily be damaged. A more recessed OFF/ON switch could solve this problem.There is a considerable delay from the time when you press the shutter button until the shot is taken. I know this is a common problem in digital cameras, as the camera focuses, determines the exposure, and the like, but I find it annoying, and it has cost me many excellent candid and action shots. By the time the shutter actually operates, the moment is long gone. I was raised on 35 mm range finder and SLR cameras, and I really value instantaneous response when I take a picture.The last issue I have with the camera is that when pictures are blown up, they are not very clear, even if taken at infinity. The lens is not sharp at all. Previously, I owned a cheaper camera, a Fuji Finepix A200, and the pictures were sharp as far as you could blow them up, but this is not the case with this camera. Another beef I have is that the individual pixels often are colors that jar significantly with the colors of the area they are representing, such as green or blue pixels in the area of a person's face. I assume this is an artifact of the compression algorithm used by the camera, but it looks pretty bad if you need to blow up a section of a picture in a situation, such as on a computer screen, where individual pixels are visible.Still, I do find this camera useful, and although I have been tempted to take it back, I'm still using it. I give it three out of five stars.", "Date": "October 9, 2006"}, {"Title": "Great First Camera", "Author": "Emily Hamilton", "ReviewID": "R2NJAOUY2AZ1S8", "Overall": "4.0", "Content": "This is a great first time camera!!  You can adjust the Mega pixel so you can down load them online.  This Camera goes every where with me!!  I do not like that the zoom does not go very far.  And the biggest problem I seem to have with it is the delay on the picture!!!  It takes about 4 secs to take a pictures after you push the button.  I take alot of pictures where I need it to take right away!  So I learned if you press the button half way down all you have to do it wait for what you want to take a picture of and press it and it takes it right away.  I would recommend rechargeable batteries for this camera.  I use it so much and normal batteries die so fast!! I would go though so many in a day.  With rechargeable I charge them at night and the last all day long!!!  This is a great First Time Camera!!!!!", "Date": "July 28, 2006"}, {"Title": "Good Product", "Author": "J. Cobb \"Cobber\"", "ReviewID": "R2KHV9LHWIHJB9", "Overall": "5.0", "Content": "I do a lot of outdoor activities and wanted a camera that was not too expensive in case something happened to it so I purchased the D435.  I have been extremely pleased with this camera.  I did not expect the pictures to be as clean as they turned out to be.  Even using the digital zoom, the pictures came out clear.  I would suggest this camera to anyone looking for an inexpensive camera.", "Date": "July 6, 2006"}, {"Title": "Good utility camera", "Author": "Janette Draper \"Honolulu Mama\"", "ReviewID": "R3HO1E3REGDWRD", "Overall": "4.0", "Content": "I purchased this camera to replace my older-model lost Olympus Camedia Digital Camera. I give this one 4 stars because I seldom \"love\" any machine or tool (Except my Mac!). But I like this one just fine and I like it much more than my old 3.1 mp version.  No need for a memory card, as this one has enough internal memory to take around 100 HQ pics. I just keep an extra couple of xd cards in my bag to use if the need ever arises.  Controls are simple, well thought out and much improved over my lost model.  Near as I can tell, this one has no optical zoom (digital zoom only). For my purposes that's enough. Good utilitarian camera for beginners or people like me who use it mostly to take family pics or surprising art I see in the natural or man-made world. BTW I easily found all the manuals online.", "Date": "December 5, 2012"}, {"Title": "blurry pics in macro", "Author": "roseysweezers7", "ReviewID": "R3OH4P7HRUML6G", "Overall": "1.0", "Content": "i received this camera as a gift from another amazon customer and although i found it easy to figure out, it came with NO USB cord so i had to purchase one to go with it. i also take alot of pictures of rescued animals and found that every picture  i took in macro of newborn pups, they were all blurry.  the only pictures that came out clear were the ones i took at a distance. i even went as far as downloading the manual to see if there was something i may have been doing wrong, but i had all the settings as instructed and it STILL took blurry pics up close. returned this camera and got a better one. i do not recommend this camera if you are looking for pics with detail and clarity", "Date": "August 31, 2012"}, {"Title": "The D435 remains good value as an entry level point and shoot camera.", "Author": "Ctwilliams \"goblin\"", "ReviewID": "R1SLNRUYG80RDB", "Overall": "4.0", "Content": "I have used the Olympus Camedia D435 camera for several years, mostly as a still camera. I seldom use the video facility which has no sound.Some plus points:Quality build and robust feelEasy to hold and controls easy to useLight and compact design, easily fits into pocket or worn on beltTakes ordinary AA batteriesVariety of photo settingsGood colour definition and sharp pictures obtained in outdoor and indoor conditionsSome negative points:No optical zoomNo special effectsSmall viewing screenDiscernable time lapse in acquiring the subject and taking the photoDated in comparison to newer modelsConclusion.Although dated the D435 remains good value as an entry level point and shoot camera that produces decent photos in a variety of conditions.", "Date": "November 7, 2011"}, {"Title": "Very good beginner camera for the price", "Author": "Jamayla D Wiley", "ReviewID": "R2QTQB46645EU3", "Overall": "4.0", "Content": "Positives: Very nice quality pictures.  Easy to use.  Good options in terms of picture size/compression for a camera in this price range.  Digital zoom doesn't totally ruin pictures.  Takes video with no audio.  Flash works well.Negatives: Eats batteries way too quickly... even when powered off?  No optical zoom means zooming will hurt your quality.  Video quality is nowhere near as good as the picture quality.Overall: A good camera.  Definitely worth getting rechargable batteries for this.  You'll also definitely want an xD Picture Card for it, which are not as common as SD or microSD cards.  A 512meg card is cheap, though, and more than enough for most people.", "Date": "October 13, 2011"}, {"Title": "it's pretty ok", "Author": "Liz", "ReviewID": "R370PM3ZYLN38O", "Overall": "3.0", "Content": "i won this camera, so it was absolutely worth the price. still shots that are at a normal distance are good. it also takes good pictures in minimal to no light (my xmas tree in the dark with just the lights was incredible!) warm lighting it's not so great, and it's also slow to expose, so if the light is just so so, it's not very great. this was my second digital though, and i would at the least buy another Olympus.update: i now have a 10 mp camera, and it's better than this one. if you just need something super basic and easy, this will work. XD cards are a pain in the butt, though.", "Date": "November 25, 2009"}, {"Title": "Battery-Eater", "Author": "Kwong W. Lee \"kwwalee\"", "ReviewID": "R22PEY7UWU2HO4", "Overall": "1.0", "Content": "Bet the designed circuit or the one that I bought has problem. It is a battery eater even it is off. Every few days batteries have to be replaced even it hasn't been used if I don't take the batteries outta it. So far my battery cost more than this camera.", "Date": "August 14, 2009"}, {"Title": "Slow duration time ruins it all!", "Author": "Justin \"Justin Fair\"", "ReviewID": "R2SVMDE9UQ66QU", "Overall": "2.0", "Content": "This is a good camera in terms of its functions--yes, but this camera's achielles heel is that it takes too long to actually take any pictures--they turn out blurry because it doesn't take the picture when you hit the button.  It needs time to focus, or just to respond to your touch.  It is even worse with flash, the camera takes too long to come back after taking a flash photo--so if you want a so-so camera that operates well, you can get this---or you can get that anywhere...it's all about what you need this camera for.  I want to take pictures that I can rely on 100% to take when I hit the button---it's not with D-435...", "Date": "January 12, 2008"}, {"Title": "Great Digital Camera for non technical person", "Author": "T Smith", "ReviewID": "R14XH23OWXJ8C2", "Overall": "4.0", "Content": "This camera is very easy to use.  My non technical wife has no problems with it.  We just remove the memory card and take it down to the drug store and print all of the photos we want.  You do not even need to use the cables are software if you don't want to.  It uses two AA batterys which you can buy any where so you don't need to worry about forgetting to charge the camera.  The photos are bright and crisp and the onscreen menus are very easy to follow.  The screen is large for a camera this size.  My only reason for not giving it 5 stars is that the auto focus sometimes takes 2-3 seconds to focus which can be a bit annoying.  This doesn't seem to bother my wife at all and the pictures are excellent even when enlarged to 8 x 10.", "Date": "November 8, 2005"}, {"Title": "Camera Crazy", "Author": "Jami A. Cohen", "ReviewID": "R3J53BH6FFLCLW", "Overall": "4.0", "Content": "This was a fantastic find.  Quality pictures.  Camera very easy to use.", "Date": "March 1, 2006"}, {"Title": "Camera does not power on", "Author": "Casey Spencer", "ReviewID": "R3A0KPBHU5LBJG", "Overall": "1.0", "Content": "When I opened the camera and took it out of the box, I inserted the batteries and the camera is not powering on, it does nothing at all. What do I need to do?Best regards,", "Date": "August 12, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.1-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n4x digital zoom; 1.5-inch TFT color LCD display\n10 shooting modes; create 10-image panoramas with Olympus Master software\nBuilt-in Help Guide provides brief descriptions of shooting modes\nPowered by two AA-size batteries; stores images on xD cards", "Name": "Olympus Camedia D435 5MP Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41QRJ4J7KTL._SY300_.jpg", "ProductID": "B0009OVRHC"}}