{"Reviews": [{"Title": "Great Camera *User Friendly*", "Author": "Screech \"Amy B\"", "ReviewID": "R1NQHS34UGX11B", "Overall": "5.0", "Content": "First off..I love the color. What's great about this camera is it's small and light weight. It comes w/ it's own rechargable battery and case. Picture quality is great and it is EASY to use.The picture delay is GREAT because the last camera I had was Nikon and it was a 5 second delay until you could take another picture.Pros: Small/compact, great color, Easy to use, picture delay is great, picture quality is amazing (haven't taken too many bad ones at all), battery life never died on me and I used it for 2 hours staright, and rechargable battery.Cons: So far I haven't found any, but I'll update it once I do.  I've only had this camera for about 2 months.Now if only I didn't lose this camera. It should come w/ a tracking devise :)", "Date": "December 2, 2007"}, {"Title": "Polaroid 7,0MP Digital Camera", "Author": "Bobby Rex Simms", "ReviewID": "R3AOZW9L38ZJM2", "Overall": "5.0", "Content": "This camera has worked great, good pictures, good battery life, cute, small and light.Instructions are easy to follow and understandable.I would recommend it to anyone who needs a good reliable digital camera.", "Date": "February 8, 2008"}, {"Title": "Frustrated with brand new camera", "Author": "K. C.", "ReviewID": "R1NSOYFCNEAZ52", "Overall": "3.0", "Content": "My daughter just received this for Christmas. My dh thinks we should exchange it already (two days later) because it keeps shutting off even with a fully charged battery. The battery compartment keeps popping open!", "Date": "December 27, 2007"}, {"Title": "Nice looking and thats all", "Author": "Brandi L. Longe \"branxbran\"", "ReviewID": "R2OJG80UZTYT2E", "Overall": "1.0", "Content": "When looking for a new camera to take pictures of my baby niece I was foolish enough to base a lot of it on the looks of this camera. It is slim and has its own rechargable battery which was great, but after 2 months of use, the camera just died. The screen got a black dot on it and the lens stuck in place. While it did work the pictures taken indoors were either grainy or mostly white and the camera would shut off on its own sometimes. My return went pretty smooth, but still a big disapointment.", "Date": "February 1, 2008"}, {"Title": "Digi cam!", "Author": "Frances C. Barrett \"FRAN X\"", "ReviewID": "R14KJMTWSIDEEZ", "Overall": "4.0", "Content": "Great camera takes beautiful landscape pictures! Not so great with lots of bright lights, but certain setting make it much better. video function is better than other camera i have had both picture and audio is clear. bargain buy, and its small enough to fit in any bag/ pocket!", "Date": "February 22, 2008"}, {"Title": "its not what you really expect for a good camera", "Author": "Maria Wilma Delos Santos \"bubut\"", "ReviewID": "R9WSCGM2XFI60", "Overall": "2.0", "Content": "i thought this product has image stability but nah most of the picture i take is blurred and the quality of picture is no good even you adjust on the menu itself.i regret buying this product sometimes the cheapest one wont give you any satisfaction at all.", "Date": "April 6, 2008"}, {"Title": "Excellent, great investment", "Author": "Sport man", "ReviewID": "RTLYDT513J0RK", "Overall": "5.0", "Content": "Wow, I got this camera for christmas after researching it for a long time. I have had a lot of good experiences with this camera, with limited problems. The only things I would change is to be able to apply zoom when you're recording a video, and to be able to take pictures in b+w, sepia, flourescent etc. Other than that the picture quality is great, the size of the screen is incredible, and the light adjustment is amazing. I am in love with this camera!!!", "Date": "March 20, 2008"}, {"Title": "camera", "Author": "luvsminis \"mini horse lover\"", "ReviewID": "R2F1OAF70MPYUK", "Overall": "5.0", "Content": "i love this model camera. i didnt think i would find another when i spilled water on mine. i got mine at tuesday morning. thank you for selling yours to me!", "Date": "September 9, 2012"}, {"Title": "Great little camera for the money", "Author": "Ktricia", "ReviewID": "R3ENBEC1E8SMDU", "Overall": "5.0", "Content": "I use an old Canon for my 'real' photo work, but when I need vacation shots or something I can upload painlessly to the net, this is my camera.  I spent $90. for it, have had it four months and the battery finally quit.  No problem recharging it and I was off and running again.  Everything I needed came in the box and the thing was so easy to use, I didn't pick up the manual for three months.  The red case color is good, too; makes it easier to find than my old digital.", "Date": "September 16, 2008"}, {"Title": "Love it", "Author": "Virginia", "ReviewID": "R28XCLWHIDJBJ4", "Overall": "4.0", "Content": "It seems to have no delay at all when snapping a shot. It is so small, I can carry it in my bra when I go hiking. It takes beautiful photos too. The only thing that took getting used to is that it too easily slips into video mode so I find that while I want to take a photo, it is taking a video. Other than that. I love it.", "Date": "March 31, 2008"}, {"Title": "Gift for my step daughter", "Author": "Alfred", "ReviewID": "R1HZRIPYGCXDYZ", "Overall": "2.0", "Content": "One problem.  Less than 6 hours after taking it out of the box a small pink dot showed up on the display screen.  While not transfered tot he pictures it was still anoying.  The local Target store would not exchange it for another because I bought through amazon.", "Date": "January 16, 2008"}, {"Title": "Polaroid 7.0 megapixel camera", "Author": "Caleb L. Page", "ReviewID": "RTETEPMH0N7FU", "Overall": "1.0", "Content": "I purchased this camera from the Target store in DC.  It used at Barack Obama inauguration.  It replaced a digital camera that went out at the inauguration. I had used this camera very sparingly since purchase. I am on my way to California today 11/14/2010 to visit family, when the camera suddenly failed to display an image. I was very unhappy. The screen became black.  This is similar to the problems of other reviewers. This of course is my second camera in 2 years, so, you can understand how I feel.  I would not recommend this camera too anyone.  It is very disappointed.", "Date": "November 14, 2010"}, {"Title": "Trash", "Author": "David J. Leinweber \"Pioneering financial tech...", "ReviewID": "R3BE1V938SXDDV", "Overall": "1.0", "Content": "Polaroid cameras are awful. But they are better than their service. Mine died in two days, and I have been waiting for two months for a response from customer service.Find a name brand on sale and save a great deal of aggravation", "Date": "March 7, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "Sleek and stylish\nFits right in your pocket", "Name": "Polaroid T730 7.0MP Digital Camera 2.5\" TFT LCD ( RED)", "ImgURL": "http://ecx.images-amazon.com/images/I/51yGHeGRBNL._SX300_.jpg", "ProductID": "B000NP85EU"}}