{"Reviews": [{"Title": "Great camera--small yet packed with performance", "Author": "Christopher T. Slaterbeck \"Christian Reviewer\"", "ReviewID": "RWZOIV281DG5K", "Overall": "5.0", "Content": "I have been playing around with my Powershot S30 for a couple of weeks now, and I must say I am very impressed.  This is my first digital camera.  35mm photography has been a hobby of mine for over 10 years now, so I wanted to get a digicam that wouldn't let me down.  And the S30 hasn't.  It has almost all the features of my Canon Rebel 2000 (except interchangeable lenses, filters, and a hotshoe), but with a fraction of the size.  The pictures are great.  I have noticed that indoor flash pics tended to be a little too bright, but that was easily fixed by adjusting the flash exposure compensation down by 1/3 or 2/3.  The camera takes pictures quickly (not as fast as my SLR, but that's to be expected) and the pics are of high quality.  The battery life is relatively short, but a fully charged battery was more than enough to get me through over 100 shots, using the LCD screen for all of them, the flash for most, and spending a fair bit of time reviewing the photos.  I *love* the fact that the camera records all the settings you used along with the shot.The camera is small and rugged, so it can easily be taken everywhere.  Even the battery charger is fairly small.  I definitely recommend getting a 256MB card (check out newegg.com) and a USB reader.  At highest resolution and least compression, I can fit 157 pics on the 256MB card.  The only thing I've used the 16MB card that comes with the camera for was to transfer some pics to it so a friend who wanted \"doubles\" could go to Ritz camera and print them out for herself.  Definitely recommend!!!!!!!", "Date": "November 20, 2001"}, {"Title": "3 Megapixels doesn't get any better in a package this small!", "Author": "Rob Deep", "ReviewID": "R82XLXX01NH72", "Overall": "5.0", "Content": "I picked this camera up a few days ago after doing pretty extensive research online and talking to some people on bulletin boards. I wanted 3mp camera in as compact form as possible that used CF cards and had a rechargeable battery. Then I discovered Canon's new S30/S40. No doubt the S40 is a great successor to the S30, but I have no need for 4mp. I've only had the camera a few days and I'm already very content with my decision. It has a build quality like no other camera I've held. I'd say it has a 95% metal casing, only the battery door is plastic, and they mesh perfectly with the design. The sliding lens cover is great. Works flawlessly as a on/off switch and protection for the lens. Gives the camera a great smooth finish too. The LCD is bright and has good visibility in sun light. The buttons are well placed and easy to work with. My only minor complaint is the rubber door covering the usb and power jack. I question it's durability after long term use, but it should be ok.So how do the pictures looks? Fantastic. If I could sum it up in 3 words, I would say: Sharp, bright and clear. The flash is powerful enough to take great low-light/night shots. Just don't get to far away :) Battery life is average. One of the drawbacks to such a small camera, but the battery recharges fairly quickly. Keep the LCD off for mucher greater battery life! Oh, and get a large CF card. The 16mb that is included won't cut. No problems using the camera with Windows XP Pro through my monitor's USB hub. Canon's software is kind of bloated, but functional. If you prefer, just use XP's built in Digital Camera support.Overall, excellent camera for people who want something portable (like the S110, although not quite as small), and a 3 megapixel resolution.", "Date": "November 19, 2001"}, {"Title": "I love this camera", "Author": "the limey \"thelimey\"", "ReviewID": "R3LXF7UOUP6ECB", "Overall": "5.0", "Content": "This is my first digital camera and I am so happy with it.This is what you get...A heavier weight than most digital cameras.  I wanted to know that I was holding a camera, not a plastic toy.Nice, easy to use software.  The stitch assist software that comes with the camera is fantastic!!The ability to take mini movies (if a little small and short)  The microphone picks up the ambient sound pretty well.Multiple choices of picture resolution, but why not use the max resolution if you have the memory (see below).Fully automatic to fully manual settings, so you you can practice your photography without wasting expensive film.Uses standard compact flash memory (no expensive proprietary memory or limited to 128MB)This camera will pay for itself (in terms of saving money on picture development) in about a year.A LOT of fun using it and recording some great memories!Using it...I took about 400 shots over two days at Sea World at various resolutions.  The high speed picture mode captured the action perfectly under many different light conditions.It's great for taking long exposure shots (use a tripod).The 3x zoom doesn't sound a lot but really helps to get better pictures at lower resolutions.The stitch mode on the camera really helps you line up the next shot for panoramas and completely takes the guess work out of it.The flash seems pretty strong (much better than my old standard compact camera)DownsidesIt really drains the battery.  I went through three in one day.  Which is why I recommend getting two more when you purchase (if you can afford it)The cover for the USB port on the camera looks a little flimsy, so I wouldn't use it too muchWhat I would recommend.128MB, or 256MB memory cardsAt least three batteriesA dedicated card reader for the PC", "Date": "January 4, 2002"}, {"Title": "I love this camera!", "Author": "D. Langhorne", "ReviewID": "R1DT4OAN2O2UJ6", "Overall": "5.0", "Content": "This is my second camera so far.  I recently bought an Olympus C3020 and realized after a few days that I really felt ripped off for the money I spent.  I returned it and got the Canon S30 after doing some more thorough research on reviews of cameras.  So far I like everything about this camera.  The metal case, shape and weight feel good in your hands.  Not having to deal with a lense cap is another big plus.  the videos are short and lo-res, but for me it's an opportunity to at least get SOME stuff of my kids on video before they grow up.  Certainly getting a digital camcorder is on my wishlist, but personally until I can get an hour of good quality video at a reasonable price, I'm not ready to spend the money.The battery is GREAT and the fact that it came with both the rechargable battery and the charger was a big plus.  When I was looking at cameras, I really liked the Nikon 885, but when I discovered they sold the camera with a disposable lithium battery(excuse me, disposable??) and no charger, I just could not accept that.  I'm sorry, if I'm spending 500-600 dollars, don't poor-boy me.  I've found that a lot of the cameras in the field out there all have one or more \"gotchas\" like the Nikon did that unless you really look over the specs, it's easy to miss.  The canon does not have any \"gotchas\" that I have found.  Aside from a larger storage card, you really don't need to buy anything else to enjoy this camera.The battery so far seems to have a very long lifespan.  I've been using mine throughout the day and charge it overnight.  I've not run out of juice yet, and I always have the screen on when I use it.There is only one minor things I found about this camera, I wish were included and that is a battery meter so I would know when the battery is getting low.Overall, my advice is if you looking for a 3.x MP camera you really need to look at either this camera or a sony (which I considered, but did not like the higher cost of media and card readers since I don't own a sony laptop :(", "Date": "February 14, 2002"}, {"Title": "A perfect camera for novices and professionals alike", "Author": "A Customer", "ReviewID": "RMIOSCFHLMTMC", "Overall": "4.0", "Content": "If you're looking for dozens of image, flash, zoom, and exposure settings, in a small package, you've got the right camera. The Canon Powershot S30 camera is clearly not a camera intended for photography professionals who want to take hundreds of pictures at different resolutions, want to play with the lighting and other effects, as well as have the ability to zoom into the object many times over. However, it is a complete package. The S30 offers features found in much larger cameras at twice the price for half the price at a much smaller size. The S30 is a compact camera, widely acknowledged as the best bang-for-your-buck camera in its size on the market. The S30 is virtually identical to its cousin the S40, with several minor differences. The S40 shoots at a slightly higher resolution, has one additional shooting mode, and is 4 megapixels as opposed to the S30's 3.2. However, the S40 is commonly found for over [$$$] more, and these features, in my opinion, are not worth the investment. The S30 shoots images at the maximum resolution of 2048x1536 pixels, at a 3.2 Megapixel resolution. Similar cameras of similar sizes offered by competitors top off at around 2.1 Megapixels, without paying premium prices. The S30 offers thirteen different shooting modes, all of which can take advantage of its 3X optical or 10x digital zoom from the automatic, where the ISO speed, flash, and shutter speeds are calculated by the camera, to the movie mode, which can record up to 30 seconds of full-audio AVI film at 320x160 resolution, and approximately 20 frames per second. Other modes include portrait, speed, and slow modes. These can be used to shoot pictures of objects up close, where the foreground recieves more exposure than the background, as well as to capture objects, whether fast or slow, in motion with little blur (fast/slow shooting modes). The camera also allows you, with additional settings, to set the shutter speed, ISO settings (up to 800) and lighting setting with a touch of a button. The S30 accepts both Type 1 and Type 2 compactflash cards, including the IBM microdrive, which comes in sizes up to 1 GB - more than enough space to store approximately 600 pictures, shot at the maximum quality and size on the S30. Because of the camera's size, it might be expected that the battery, card, and all other \"removable\" parts would be hard to access and would require large fingernails. However, Canon has made a small slot on the bottom with several spring mechanisms which allow easy access for the card (when ejected) as well as the battery. The LCD is brilliant, and captures much of the color in the viewfinder. Upon moving the pictures to my computer, I found that they looked virtually identical in thumbnail form as they did at their maximum resolution. You can also set the LCD to turn off or on, in order to conserve battery power. Right out of the box, the camera is very easy to use. The on/off switch is built right into the lens cover, so simply popping in the rechargable battery and flash card and sliding open the lens cover allows for virtually instantaneous use. The \"AUTO\" mode allows for simple point-and-shoot use, with the camera selecting the right settings, auto-focusing, and taking the picture with a fake shutter \"click\" sound. (Installing custom software allows you to customize this shutter sound to a soundbyte of your own creation or choosing). Once the pictures have been taken, the camera also can be connected directly to certain Canon printers to print images directly out of the camera. The camera does have some weaknesses, however. Because of its size, the flash is rather weak, and is quite sensitive if your hand is accidentally cupped over part of it - the image exposure will increase in the top left hand corner. Also, the control pad is sometimes difficult to operate as some operations require that you push it in. I found myself several times pushing the left or right accidentally as I tried to depress the button evenly to produce the desired result. Also, the S30 is a battery hog. An extra battery is a requirement for this camera, as its batteries rarely last over 70 pictures - although I have heard otherwise. All in all, the S30 is an excellent camera with many benefits that far outweigh its negative points. With the ability of both the novice and the professional to take advantage of its 3x optical zoom, manual or autofocus, and its 13 different shooting modes, the S30 is a camera for everybody...at an affordable price.", "Date": "November 10, 2002"}, {"Title": "comparison to olympus c3040", "Author": "Jonathan Payne", "ReviewID": "R2Q1AZ2A4CQHW0", "Overall": "4.0", "Content": "I just had my Olympus c3040 stolen, so now I need a new camera.  Iborrowed a Canon S30 from one friend and an S40 from the other.  Ihave decided to go with Canon, and I am chosing the S30 over the S40because it's faster in a couple of ways than the S40 due to smallerimage sizes.  I am not ready to deal with 4 megapixel images yet.Here's some more information on why I am not going back to Olympus.1: The Olympus is slower in displaying pictures, focusing, gettingready for the next shot, accessing menus, etc.  The canon is just muchfaster.2: The LCD on the Canon shows you what you're going to see in thefinal shot.  E.g., if the shot is over-exposed, you can tell beforeyou take it, and you can see what will happen if you adjust theexposure as you adjust the exposure.  The Olympus LCD always lookeddark and off color to me and didn't seem to reflect reality, andconsequently I never used it except for macro mode.  The Canon's LCDseems very fast as you move the camera around for your next shot.  Iwill use the LCD for most shots on the Canon.3: The LCD is still quite visible in outdoor lighting conditions.4: The menus on the Canon are easily invoked and accessed, and sit ontop of the image you're composing instead of covering the image untilyou've made your choice.  Olympus menus are a pain to navigate, andthey are not very visible in the sun light, whereas Canon menus seemto be right there where you need them.5: Canon uses compact flash, olympus uses smart media.  I had moresmart media cards go bad than you can believe, and smart media is moreespensive than compact flash.6: The Canon's image histogram is a useful and helpful feature forhelping you take better shots.  It's also very cool.7: The Olympus is better in one crucial situation: low light picturesare only possible if you are within flash range.  I have pictures ofmy daughter's indoor dance perforamnce that I took with my Olympuslast year, and now have similar pictures I took with the S30.  The S30ones need to be deleted - they are blurred because there wasn't enoughlight.  The Olympus took amazingly clear and crisp pictures in thatlow light situation, even when fully zoomed.  That's because its lens isf/1.8 and the S30 is the more standard f/2.8.  The Canon G2 has anF/2.0 which is closer, but some of the other functions on that cameraare very slow, and that camera is too big and heavy.In summary, once I used the Canon for a while I couldn't bear thethought of going back to the Olympus and smartmedia.  The one thingthat worried me was the low light photos, but I think I can livewithout that.  I still have a good SLR camera that I can whip out onthose rare occasions ...", "Date": "June 20, 2002"}, {"Title": "Canon S30 - A *Wonderful* Digital Camera!", "Author": "Maoming Mom \"Ashley\"", "ReviewID": "R2W9WGDWOTWZPF", "Overall": "5.0", "Content": "For months, I researched digital cameras...printed off the specs of at least 30 different models.  My search led me to the Canon Powershot S30 and after owning it for a mere three days, I LOVE IT!One of the \"complaints\" I kept reading about digital cameras in general was the poor quality of indoor pictures (too dark or blurred).  This camera takes BEAUTIFUL indoor pictures!  We *tried* to make it blur and took some action shots. This camera took a perfectly crisp picture of my husband wildy waving his arms!  And, the pics of our young children are perfect every time.  The flash is really amazing.The instruction manual is very well written, very detailed, not confusing at all.  In three days, I have already taken pictures (on AUTO) in every resolution, taken three videos with the movie mode and all this was without reading the manual from cover to cover.  The controls, menus and manual are so easily laid out that you can use the camera without a lot of studying.  Of course, to have more control over my pics, I will need to read more about the manual settings.Oh, the battery life...excellent!  There is not an always-present indicator of battery power; however, when the battery is getting low, a red indicator comes on (so there is some warning).  But, so far, I have used the camera quite a bit with each charge and have had plenty of power.  The charging process is very fast, too.  (less than an hour to get a full charge)The cover for the USB connection seems rather flimsy...but, I download my pics using my Photosmart printer so I don't have to use a USB port.  If I was continually opening and closing the cover, I would be concerned that it might not last.  (?)Compactflash cards...keep in mind, the type this camera uses are available everywhere...they are not \"proprietary\" like some brands (Sony, for instance).  That was a big thing for me...I can buy my cards online from many different sites or go out to Sam's / Wal-Mart.  BTW, the 16 MB card holds so much more than I thought it would!This is my first digital camera, so I am not an experienced user nor do I have anything to compare this camera to.  But, I have to say that I am extremely happy with the quality of the photos and highly recommend this camera!  It is A LOT of camera for the price...the 16 MB card, rechargeable batteries and base...GREAT package!BTW, I bought a Case Logic camera bag at WM on clearance that fits this camera perfectly.", "Date": "March 17, 2002"}, {"Title": "A little pricey, but well worth the money", "Author": "Kansas Girl", "ReviewID": "RHGVQGPYI03TE", "Overall": "5.0", "Content": "We bought this camera about 2 weeks ago, and it was easy to set up and use. We were up and running in less than 15 minutes (using the more advanced features in under an hour...(Though make sure you read the directions before you start the set up process, the manual is pretty confusing and out of order somewhat.)IMAGESThe photo quality is fantastic. This is the second digital camera we have owned, and the difference between the Kodak DC210 and this is amazing. We did a lot of research before selecting this camera and I am pleased with the choice. And it has video! You can shoot short films 30seconds to 2 minutes. This is really a fun option, and you can string several short clips together using the software that accompanies this to make your own self-contained movie. Definitely a cool feature. point and shoot plusMy husband and I have different shooting styles, he's more of a point and shooter, and I like to have some flexibility to to try somewhat more advanced techniques. This camera takes great photos on automatic, but is flexible so I can set the settings as I need to, which is great. It's a mix for the novice and the advanced beginner, (and I hear for the intermediate level photographer as well, but I can't speak to that.)Caveats...Batteries and memory. You will need to buy more memory (compact flash which is better than the memory stick options out there.) we found a 256 memory card for $90, so it's possible to upgrade for not that much money. Batteries drain really quickly when you use the camera on review. We also just ordered a second battery, and I hope that will help.(...) All in all a great camera, and we highly recommend it! Good luck!", "Date": "December 8, 2001"}, {"Title": "It must be close to perfect in it's class!", "Author": "John Kinsella", "ReviewID": "R2LMF51OX0AUG7", "Overall": "5.0", "Content": "OK...I had a Digital Elph, which I loved, until it fell out of my pocket on a ski lift. :|  The S30 outperforms it hands down in every category except size.  A few of the things that weren't toally obvious to me from the advertising:  You can do manual focus with this guy.  Also has a Macro mode.  You have complete apture priority, shutter priority, manual, or several program modes to choose from.  1/1500th shutter on the fast side, ability to pick emulated ISO from 50 up to 800(if I remember right).  Raipd fire shutter mode is cool, I haven't seen this on a digital camera before.  Basically it snaps off about 3 shots/sec until the camera's buffer is full, then it starts writing to the CF.The 16MB CF card is a joke..c'mon Canon...you're giving me a camera that I can take 14-16 shots with?  Get real.  I agree with everybody else saying you need extra batteries.  Only other thing I'm still getting used to is this selective focus area - Canon's had this on their film cameras for a few years, but I've been a Minolta guy for years.Overall, due to the creative control this thing lets me have, I'm considering shelfing my film based gear for a while.  The only thing this camera is missing for me right now is interchangable lenses(I'd love to go wider than it lets me).Great camera.  I'd highly recommend for the intermediate+ photographer.  For a beginner it will work great, just the extra features might be a little overkill.", "Date": "February 10, 2002"}, {"Title": "I love this camera!", "Author": null, "ReviewID": "R3DO5GA4V3I1N8", "Overall": "5.0", "Content": "This is my second digital camera.  The first was a Sony Mavica, which my husband bought me one Christmas.  I learned from that camera what was important to me:  high resolution, long battery life, an optical viewfinder, and a small size.  This has all of those things and more.  The Mavica writes to a floppy, and the mechanical process severely limits the speed at which you can take pictures and drains the battery rapidly.  There is no way you can get thru a day of being a tourist with it.  We had to buy an inverter for the car to compensate for the battery drain.  The Sony also had no optical viewfinder.  That mean you had to use the LCD, which was terrible in bright sun and also was another battery drainer.  The floppy disk drive also meant that the camera was bulky.This camera is the perfect size, easy to carry, but not so small your fingers feel fat all the time.  The size of the battery pack is great and I bought a second to put in my pocket which means I have no worries for a full day of shooting.  I used this recently at a ski race and the \"motor drive\" was terrific!  It really tracked the athletes well in its focussing ability and produced INCREDIBLE pictures.  I used the \"fine\" setting and the largest picture size and the motor drive was pretty much able to keep up with what I needed in spite of the large file sizes it was writing (around 800k apiece).  There are tons of different settings on this camera -- you might want to take a class in photography to get your use out of them!  I took classes and was a serious photographer years ago and needed to draw on that knowledge to understand all the settings.  You really need to read the manual -- I am normally not one to do that, but had to on this thing.  I also bought a 256Meg CF card and an adapter so I could just shove the thing into my laptop and deal with the files directly without the Canon software utilities.  This makes it as easy as the floppy disk feature on the Sony.  One beef is that the motor drive setting must be re-set every time you close and re-open the lens cover or it will revert to a single shot mode.  This was a pain on a snowy day as I was closing the cover frequently and each time had to select the motor drive feature again.  Also, if the digital zoom is not turned off and you are using the optical viewfinder, you will not be aware that you have zoomed in closer than you can tell.  I got a view skier-derriere shots by accident this way.", "Date": "February 21, 2002"}, {"Title": "Terrific, fun and easy to use...", "Author": "Donna M. Palmer", "ReviewID": "R19UGIFY04SHBR", "Overall": "5.0", "Content": "This camera is spectacular!  I had no trouble installing it on 2 systems, however I did encounter some small issues when installing the Canon Zoom EX software on a Win98 OS with Twain drivers already installed.  In the end, I got it working without much headache.I received this camera as a gift, and I'm glad I did.  I'm not sure I would have purchased it otherwise, as I was hooked on the Sony Mavica.  For some reason I was sold on the Mavica since you could store images on floppy.  I thought I wouldn't be able to hold enough pics on a Flash card.  Boy was I wrong!  I took well over 50 pics wile at Sea World for the day, at the highest resolution, and my 256 mb card still had memory to spare.  It's well worth getting the 256 mb Flash Memory, but also consider getting an additional battery.  By late afternoon my battery was running low on juice and it alerted me, well before any poor pictures were taken.The clairty and color of the pictures is phenominal.  We took a picture of a sweating soda can when we first hooked it up, and we could see even the finest, smallest sweat bead on the can.  The digital and optical zooms both work extremely well, making it very easy for you to add drama to a picture. The preview screen is so very clear, I had people in the airport looking at pictures over my shoulder in amazement that they were so good. I also liked the weight of the camera.  It was heavy enough to make it feel solid in your hand -- something that I find a lot of the pocket-sized digital cams lack.  Also the sounds it makes when powering on, or even the clicking of the shutter when you take a picture, all serve purpose and are easily identified.All in all it's quick and easy setup has you taking pictures in 10 minutes (after the battery is charged of course).  I found that camera to be intuitive as well -- especially good for those people who refuse to read manuals.", "Date": "April 10, 2002"}, {"Title": "Canon did it again! A great digital camera!", "Author": "A. Schek", "ReviewID": "R35MF3AO08MDD5", "Overall": "5.0", "Content": "I started using the Canon S100 when it first came out about 2 years ago.. it was the best camera in town... Then came the S110, with more features and better battery life... the best just got better! I gave the S110 to my wife and decided to step-up with a 3.2 MegaPix camera... I bought the Nikon Coolpix 885, and guess what.. I returned it 2 weeks later... because the picture quality was so-so... Then I received the S30.. and believe me.. It's the best digital camera I ever had and have seen... it's great! Same quality as the Digital Elph (s100, s110), great features, and most important, great picture quality.PROS:- Great finish, great style, great overall construction- No plastic or cheap materials- Incredible picture quality in all modes- Super fast image processing- Super fast \"ready for next picture\"- Great LCD display- Great size! (not that small as the S110, but still perfect!)CONS:- Heavy for the size. (this because of the good quality materials used)- The \"navigator\" joystick, is kind of not intuitive to move.- Video mode is not good compared to other less expensive cameras I have seen.- Does not come with a case.", "Date": "April 4, 2002"}, {"Title": "Go Canon!", "Author": "Vee", "ReviewID": "RZ5XK69GBLABV", "Overall": "5.0", "Content": "This is my second digital camera and from what I see thus far this will most likely be my last. I think I've found the perfect digital camera. Check out the positives and negatives with the PowerShot S30.Positives: (where do I begin?)* Made of solid, sturdy metal. Feels like a real camera not a cheap plastic toy like other digital cameras.* Has features galore!!! Has standard features plus some pretty nice extras such as:-customizable flash-can change the strength of the flash, helping to prevent washed out pictures which is common with most digital cameras when you use the flash.-flips landscapes pictures that would normally appear sideways. the camera lets you flip these pictures rightside up so you won't have to do it on your computer.-can take panoramic pictures.-the camera is customizable! What does this mean? This camera lets you customize the startup screen. You have an option between clear blue water, evening skyline or a sitting bird. You can change the startup sound, your options include a default theme, science fiction and animal sounds(dog barking or bird chirping). These sounds are designed to presumably match the startup screens but they can be mix and matched. The shutter also has various sounds you can choose from. All these sounds can, of course, be turned off.-this list goes on and on. Check this camera out to see everything.* Superb true true-to-life daytime and night pictures.* Pictures come out crisp and sharp with or without the flash, inbrightly lit or darky lit areas.* What you see is what you get. What you see on the LCD screen is usually how the pictures will appear on your computer monitor or when you print them out. The LCD, when you press lightly on theshutter button, will show you actually how the picture will appear once viewed on screen or on paper. So if your LCD has a bright contrast and you are in a dark room, when you press the shutter button lightly, the LCD will adjust itself to the actual lighting of the room. There will be no deception and you won't have to wonder why the pictures look lighter on the LCD than on the computer screen or in print.* Can record mini movies with sound.* Uses compact flash card.There is much, much more that I can add on to this list but you will have get this camera and see for yourself.Negatives:* Hard to install the driver software on th PC. I had to ask Canon tech support for help. Even then the process was very confusing.* Joystick navigator takes some getting used to. Very hard to maneuver through the menus resulting in accidently going to the wrong options.* There is no power button. You have to shut the lens' lid to turn off the camera. This makes me nervous. I'm always scared that this will somehow damage the lens.* The macro setting isn't the best. Sometimes the macro pictures can appear blurry.* Uses the very expensive NB-2L rechargable battery as opposed to inexpensive, more common rechargables such as NiMHs or other types. Plus NB-2Ls can only be used with PowerShot S30, S40 cameras and Elura 40mc camcorders. I was initially put off by the price of this camera but I must say it is well worth the money.Get the Canon PowerShot S30 if you want superior quality in a small package.", "Date": "December 26, 2002"}, {"Title": "Fantastic buy", "Author": "Lawrence E. Sorensen", "ReviewID": "R3FIICAQJB8K58", "Overall": "5.0", "Content": "After spending a couple weeks researching & reviewing digital cameras, I was interested in the Canon G2 but didn't care for the price on something that becomes obsolete faster than computers!  Liked the digital Elph but not enough features.  The S30 looked like the right one for my first digital camera.  I'm totally impressed with all the functions which many cameras don't have.  The LED screen is bright and clear and takes great pictures in low light conditions, indoor or outdoor.  Canon's printed manual is very easy to read.  Ended up buying an extra battery & 256mb card.  No problems with running low on either yet and if you want to save the battery, you can turn off the LED & sound functions.  You can manually operate the flash too.  Forget about buying Canon's camera bag.  I ended up getting a different bag that was advertized and Canon's manual even states that bags do vary depending on location.  When you slide the camera into the bag, it's so tight that it opens up the front lens cover.  Threw it into the trash and ordered a Case Logic.  Canon's software package is very useful but I find using Microsoft's PhotoDraw 2000 much easier to use for web editing.  I highly recommend this camera and I'm pleased with every detail.  Buy it and you won't regret it.  I know if I would have chosen one of the other brands, I'd still be thinking if I made the right decision over the S30!", "Date": "February 17, 2002"}, {"Title": "Great camera so far", "Author": "Joe Faber", "ReviewID": "R2Q46Y7123KRYO", "Overall": "4.0", "Content": "I just recently bought the S30, and so far, I've found it to be nothing but fantastic. Here's what I like about it most:First of all, the 3MP resolution is nice. I'm sure that 3 megapixels will be ... cheaper in another year, but for the moment, this is one of the cheapest cameras that offers so high a resolution.Second, the LCD screen is 1.8 inches, not the 1.5 on smaller cameras.Third, it's small enough to take with you, and the retractable cover on the front ensures safety when carried around.Fourth, an *okay* optical zoom that's great for a camera of its size.Fifth - and this is fairly important - it offers both full auto and full manual control. For me, as an aspring and beginning digital photographer, being able to choose between letting the camera do it's thing or being able to play around with all the exposure settings myself was really nice.Sixth - a 16MB card. Thank you.Seventh - fairly good software bundle. As a mac user, there are definitely better software packages out there, but you can get by right out of the box.Eighth, complete documentation.I'm still experimenting with taking my first photographs, so I'm reserving final judgement until after having used it for a while.", "Date": "January 5, 2002"}, {"Title": "Why should I comment... the votes are in!", "Author": null, "ReviewID": "R32GK589T1DOYJ", "Overall": "4.0", "Content": "Just check out the majority of these reviews.  There are very few complaints.  This is a great camera.  It is very technologically advanced--I have owned it for almost two months and have still not figured out all the features.  The main thing I love is that it is so, so easy to hook it up to my computer and download freshly-taken pictures instantly.One suggestion, buy the extra memory card (128--click on accessories link) when you order your camera so you can take an enormous amount of pictures at once and store them all on the card until you have the time to sit at your computer and download.  I have never even used the included 16 card.It comes with cables and software, as well as a wall charger for the battery and a small memory card.  My battery has lasted a really long time so far.  I am very impressed.  The wall charger has a green indicator light on it that shows when your battery is charged.  That is a very handy feature for those of us who are in a hurry and cannot keep track of how long we have a battery on a charger!The quality of pictures is awesome!  I bought the Canon photo printer for my computer.  I can print directly from my camera without even powering up the ol' HP!  How great is that?!I love the LCD screen.  Now, I have not taken the little plastic cover off the screen, for fear that I might scratch it.  However, if you spring for a camera bag or carrying case, I believe your fears of harming the screen can be put to ease.Buy this camera if you are looking for a good, affordable digital camera well worth the money.  It includes all the features most novices demand, like zoom, short movie making, auto focus, red-eye reduction, and automatic light sensoring for the flash.Update:  I wrote this review about two years ago and I still have the camera and still use it regularly.  It is still in great condition.  I still love it!", "Date": "November 18, 2002"}, {"Title": "Best Compact 3-megapixel on the Market!", "Author": "A reader", "ReviewID": "R3KQTXHTKDYFZS", "Overall": "5.0", "Content": "I am constantly teased by friends that I am the most thorough consumer they know, so it wasn't unusual when I spent about a month comparing digital camera reviews before buying this camera. (Great reviews can also be found on photographyreview.com and dpreview.com). My criteria for buying a digital camera were that it be a compact 3 megapixel, have a good zoom, have the capability of being manual or automatic, and that it have GREAT image quality. This camera has it all.I took a huge risk using this camera for the first time on a trip to London in February. (I also purchased a 128MB CompactFlash card and extra battery---a necessity). I read the manual on the plane, and set off to take pictures. I took 140 pictures on the 128MB card at highest resolution--even deleted several pictures to fit more.I got home a week later, anxious to see whether the photographs would be a cause to celebrate or to auction the camera on E-bay. I printed the photos myself on a photo printer (more on that later), and they looked like postcards.... the color was awesome, the images were sharp---I was sorry that I didn't take more CompacFlash cards with me!I printed the pics on the Hewlett Packard Photosmart 100, which is a miniscule, portable printer that will print directly from CompacFlash and other media cards (without being connected to a computer)--see reviews on amazon[.com]. The printing quality is amazing, and I now travel with it so I can print my pictures while on vacation.And my friends that make fun of me? Four of them now own this camera and the printer......", "Date": "September 13, 2002"}, {"Title": "Even better than I expected", "Author": "Chewy \"chewystee\"", "ReviewID": "R32XPC77T5QEB3", "Overall": "5.0", "Content": "I've always seemed to have good luck with Canon products so when I decided to dive into digital photography, my short list of manufacturers included Canon.  I liked the compact design of the S30 and the features for the price over others I was considering, so I went with it in the end.  Now that I've had amonth to fiddle with it I have to admit that it exceeds my expectations in almost every way.  The camera is very easy to use and the photo quality is better and more consistent than any automatic 35MM I've ever used.  The software included is also intuitive with features and easy editing capabilities that make it a snap to enhance a less than perfect shot.  When I print the photos I like, the clarity is exceptional even though I am only using an inexpensive HP932C printer.  Crop a shot and put it on glossy photo paper and a routine snapshot becomes an incredibly clear photograph.  I am really enjoying this camera.There are some drawbacks to digital photography.  Some are more universal than others, and most are about cost.  The camera isn't especially cheap to begin with and you need at least a 64MB card to get a reasonable number of shots.  The other additional cost is the extra battery which you should have handy when the one you're using goes dead.  If you're thinking about a digital camera and you've done a little homework, you probably already know that it won't be a cheap hobby.  So, cost aside and considering the ease of use as well as the quality of the photos, the Canon S30 is an excellent product that I feel provdes more than it advertises.", "Date": "February 7, 2002"}, {"Title": "Compact Camera with Full Features", "Author": "\"chemdoctorbob\"", "ReviewID": "RCDX7FPDHE4NV", "Overall": "5.0", "Content": "The Powershot S30 is an easily transportable digital camera that goes far beyond the norm for \"point and shoot\" cameras that it competes against in size and price.  It features a 3.34 megapixel CCD, a 3 x optical zoom, and 3.3x digital zoom, making it comparable to a number of competing products.  What sets this camera apart for the serious photographer is the ability to control exposure, focus, and macro modes in addition to the standard full auto modes.  While slightly larger than the Pentax Optio 300 (a close competitor in price and basic features), it has both full automatic and manual modes, as well as apereture priority and shutter priority modes and 7 preset adjustment settings.  You can use both manual and autofocus, and with autofocus can specify the default averaging focus mode or select an area of the viewfinder to use to focus on an off-center object.  It is possible to automatically bracket pictures to prevent missing the \"perfect shot\".  A virtual \"motor drive\" mode allows taking several pictures in sequence.  A full macro mode allows focusing as close as 0.3 meters.  For those interested, it is possible to record movies with sound (in contrast to the Pentax Optio, which cannot record with sound).  There is also an excellent software package, and included lithium ion battery with rapid (80 minute) charger.  All told, the S30 represents a major breakthrough in low cost, high feature digital cameras that should appeal to the serious photographer.", "Date": "December 3, 2001"}, {"Title": "Great Photos & Convenient Size", "Author": null, "ReviewID": "R8IQBRO75XAAZ", "Overall": "5.0", "Content": "I did my 2 months of research before purchasing this camera a month ago. I wanted a camera that would produce excellent picture quality (3+ megapixel), be easy to carry, easy to use, packed with digital features, and get it for [good price].  I love my Canon S30!  It has met all my expectations.My decision came down to either the Canon S30 or Olympus D-40.  The Olympus is also a very compact camera and had the added feature of 4 megapixel quality at almost the same price.  Why did I choose the Canon over the Olympus?  The manual for the Canon was MUCH more user friendly, and the the Olympus was too small for large hands to conveniently operate.  One word of warning.... Verify the return instructions in case of a defect before you buy.  My initial camera did have a defect.  The feature to display photos on a TV would not work.  After trying multiple TV's and rereading instructions, I brought it back to the store where I purchased it.  Sure enough, it would not work in the store either.  But, when my cable worked fine with the display model of the camera, we verified my camera had a defect. The replacement camera has been fine.", "Date": "March 4, 2002"}, {"Title": "Small, powerful, great pics, fast, and love the short videos", "Author": "Jan", "ReviewID": "R32RSFMPFBW8SQ", "Overall": "5.0", "Content": "...I love that I can go back to fancying myself a photo hobbyist again with the many settings I can manipulate.. but that if I am in a hurry to get a snap, the auto works great.  I love the ability to make short videos to email, and the sound quality, though tinny on the camera of course, is excellent played on the computer or TV.I was also impressed with the speed of this camera, for a digital... mentioned by many folks, which with a 14 year old doing a lot of sports, and two grandsons to catch in action was very important.The first night we got the camera, I was telling my son about how it is supposed to do very well in low light, something my Minolta Vectis S-1 APS camera had great trouble with.  So, being a kid, he did something I never would have thought of doing - he marched into some of our bedrooms at nighttime, shut the doors and blinds, and in the PITCH black, took some pictures.  These babies came out perfect, lit up for all the world as though the room had been bathed in light, super sharp in focus, and my mind was blown.... I cannot see what the point of the S40 would be - this thing kicks out such high resolution pictures, and it is faster than the S40.... great price point... with all the little accessories you need to pick up, I did not want to pay more than [money] for the camera.  The Zoom EX browser software for downloading pics to computer works great - the bundled photo editing software was a complete laugh.  It got uninstalled about 10 minutes after I installed it.  Presently working with the Jasc PaintShop Pro 30 day free trial, and am very impressed.  First bunch of pics had quite a bit of red eye (did not use red-eye flash) and I was amazed at how easy it is to fix the eyes in Paintshop.Fantastic camera!", "Date": "April 4, 2002"}, {"Title": "POWERHOUSE!", "Author": "Kurt S.", "ReviewID": "R1Y448R65Z5N69", "Overall": "5.0", "Content": "What more can I say? I got the S30 after doing much research. Canon has done it again. I loked at the S300, but the S30 was more muscle. It rivals my best $2500 SLR camera. I am an old shutterbug from the old school so I was sceptical of a high end digital camera that can carry it's own weight.  If you shoot alot, have plenty of hard drive space on your PC.The camera takes fantastic shots.I had a 20 x 30 photo printed with near perfection. The Auto mode is true point and click, so those who are afraid of a high learning curve, forget it. There are so many features in this camera. I love the Sepia and B&W; setting. It has settings galore. Cloudy weather, Sunlight, Incandescent, etc..... a true marvel of a camera. A nifty feature is the ability to add custom sounds, such as .wav files to the camera to customize each sound it makes. You can even download an image that the camera will display when it turns on.The camera is a bit heavy, but I like that. It reminds you you are carrying a REAL camera, not a disposable toy. It fits in the jeans pocket just perfect. I had to turn down the flash quite a bit. It is a pretty powerful flash. I got sick of my Sony Mavica and it's notoriously horrible low light photo's.The software that comes with it is adequate. Nothing all that great, as with most bundled software. Novices will enjoy the features. The battery life is short and the memory card is small (16mb), but that is common with every manufacturer. Get a 128mb or 256mb if you want to have plenty of room. The movie mode is pretty cool too. the AVIs are clear, not like MPEG's. GET THIS CAMERA! You will not be dissapointed.", "Date": "February 14, 2002"}, {"Title": "Can this be the best digital camera on the market", "Author": "Charles E. Root Jr", "ReviewID": "R297SQR0ECNTG5", "Overall": "5.0", "Content": "Having purchased 3 different digital cameras that I would put in the everyday users class, this camera easily beats out anything I've seen in the market or used before.Phenomenally simple to use in auto mode, just point and click, although you may find that pictures at night are not the best in this mode, no problem though just move the dial over to night pictures and viola you're the next Ansel Adams.I would recommend getting a Sandisk USB digital card reader to hook into your computer. Then all you need to do is pop out the card from the camera, slide it into your reader and it acts as another hard drive on your machine. It's 10 times easier then hooking the camera up to the computer to download pics.I would recommend anyone to purchase this computer.", "Date": "June 21, 2002"}, {"Title": "A loveable camera", "Author": "L. White", "ReviewID": "RL5MIM6H3QY5D", "Overall": "5.0", "Content": "Great ergonomics, wonderful image quality and lots of control - a loveable camera!After lusting after a digital Ixus at a party I upgraded from the Fuji Finepix 2800 I bought recently to the Canon Powershot S30, which at the moment is well-priced compared with the S40 (the 4 mpixel model) and the other 4 MP models. Reviews suggest image quality of the S40 is a fair bit better than the comparable compacts around like the Olympus C-40Z and the Pentax Optio 430 models.I am delighted with the camera. The images are clear and sharp and colours are deep and beautifully natural. The number of modes give you almost full control over things like aperture priority, time priority, and ISO from 50 to 800, which gives you fantastic flexibility, as well as Canon's photostitch mode which lets you make panoramas easily with the supplied software. All this is readily accessible with all buttons easy to use (except the rocker selector which can be fiddly). It is comfortable and can fit into a coat pocket reasonably comfortably, unlike the bulky and unergonomic Fuji, while being strong (metal body). Despite a couple of weak points this is a great camera that I've basically fallen in love with already.A couple of minor drawbacks as follows: 1. noise in very long exposure shots (night photos) 2. my camera has a dead pixel in the LCD screen 3. the visual viewfinder only gives you 85% of the shot 4. the viewfinder is not electronic 5. rocker menu selector fiddly to use.", "Date": "February 20, 2002"}, {"Title": "Great Camera", "Author": "JnJsbooks", "ReviewID": "R34SXAQEJTDKZ9", "Overall": "5.0", "Content": "We researched digital cameras for 15 months before buying this one. It's awesome! Takes excellent pictures and is fairly easy to use.  I purchased a Kodak 4900 for my mom and it felt so light. I love the weight and sturdiness of this camera. It is all metal! I am used to a point and shoot. This camera has it all. The point and shoot ease with the ability to take more advanced photos. I have had it for 6 months and have taken 100's of photos. The only downside is the battery. I have yet to purchase a second one which would be great for travel. I have not run into any problems with the battery dying. It charges very rapidly and it just takes a bit of thought.  At home I keep it charged and charge it before I leave on a trip. It takes WONDERFUL indoor and even better outdoor pictures. I definetly recommend purchasing a 256mb memory card. The software works well and my pics download within seconds. We don't even need a card reader.  Overall, a great buy! I would now only upgrade to a G2 because It would be great to learn about the lenses. But for the family who wants a point and shoot camera for the kids and one that can take postcard like photos you won't be disappointed with this  purchase. Great job Canon!", "Date": "December 27, 2002"}, {"Title": "Ultimate Camera For Anywhere, Anytime", "Author": null, "ReviewID": "RFRLCE1XQ0QDW", "Overall": "5.0", "Content": "I recently purchased the Canon S30 and have been more than happy with. Although a bit pricey, it is definetly the best buy of all the cameras in its class. The camera has loads of features, some of which I am still figuring out. Although it can be used as a fully manual camera, it works excellent as a automatic camera as well. The coolest features this camera has that many lack is the sitch mode. This mode allows the user to take panoramic pictures and an included program makes it easy to put it all together. Another great feature this camera has is the burst mode which takes multiple shots continuously. Great for action shots. Besides the numerous features the camera comes with, the camera takes amazing pictures! The details and colors it captures is top-notch. The LCD is also a little bigger than other cameras its size and works great in all lighting conditions. I have done extensive research on Digital Cameras and this came out to be the best in the 3 megapixel class.", "Date": "February 12, 2002"}, {"Title": "Tiny camera -- just a little short of being aim and shoot...", "Author": "Sowmyan Ranganathan \"SR\"", "ReviewID": "R3SRAG2IBR0YHF", "Overall": "4.0", "Content": "I was looking for a small but sturdy camera that gave me high quality pictures.  On this, the camera does not dissappoint!The one issue that I noticed early on....too many controls to be a out-of-the-box aim-and-shoot camera.  I think a few times with the manual is absolutely necessary.  The Kodak DC4800 that I owned before was truly an aim-and-shoot camera that I hardly needed the manual for.The indoor picture quality is excellent.  The colors are little bit more true on this camera than my dc4800. I have only used the auto setting so far and every picture has been of very good quality.This is a camera for high quality pictures on automatic, indoor setting for a person who does not mind refering to the manual a few times before getting comfortable with the camera. (Most digital cameras do well in the outdoor shots....so, I was looking at this camera for the indoor shots specifically).", "Date": "March 8, 2002"}, {"Title": "Ditch the SLR?", "Author": "S. Hossner", "ReviewID": "R1VW5YQIRCGURJ", "Overall": "5.0", "Content": "As a creative picture taker, I was not about to throw a couple hundred bucks toward a digicam that only took webshots or Point-and-shoot snapshots.  I wanted a camera that would take great pictures today and tomorrow and protect my investment.  The S30 takes great pix in the Auto and Program modes (just point and shoot!)  But for my creative side, this camera includes most of the features and manual overrides of the higher priced Canon G2.  This gives the camera the ability to capture difficult and amazing shots.  Exposure Lock, Shutter- and Aperature-priority, ISO settings up to 800 ASA.  3 metering modes.  Long shutter times (up to 15s) with noise reduction.  Great colors!  The stitch assist mode and software make for *seamless* panoramas.  Movies are more fun than I expected!  The camera is a joy to use, *very* snappy especially for action shots when pre-metered.Have had it for a couple weeks, long enough to get 4x6 and 8x10 prints back from an online developer.  A few of my better informed friends were highly impressed - would have been hard pressed to identify these as digital pix.Downsides:  limited flash range and no hotshoe.  Manual focusing is virually useless (uses the lo-res LCD).  Buy a bigger flash and second battery.Very impressed and well worth the wait.  No what do I do with the old SLR?", "Date": "July 23, 2002"}, {"Title": "Great Camera, you NEED these accessories.", "Author": "J. Smith", "ReviewID": "R2QN58U443S991", "Overall": "5.0", "Content": "I've had the camera for about 6 months and could NOT have found a better camera for the money.  Picture quality is great, movie mode with sound is an added bonus, plus all the manual features make every picture turn out perfectly.  3.2 meg is the pefect balance between quality and card space used.  The ability to use the RAW CCD data sets this camera apart from even more expensive ones.  But enough about the camera.  The accessories you MUST get include of course, one or two more batteries (Lithium last longer than Nickel-Cad, and can be gotten on the web...  a 128 or larger card (prefer them over the microdrive because the micro can skip while writing if the camera is bumped or when driving);  THE camera bag to get is the Lowepro D-Res 20AW.  The bag holds the camera snugly in place inside it.  It has a shoulder strap or can be worn on your belt.  It has an elasticized waterproof cover that comes out of the bottom of it to cover the already water-resistant bag when on your belt or when carrying.  However, the real beauty of the bag is on the inside.  No scratching of the camera or LCD because it is lined with a soft brushed material.  To save the LCD from scratches outside the bag I use PDA screen protector film cut to fit.  There is a pouch for holding another CF card, extra batteries in front of that, and the bonus is a pocket along the left side that one of those 4 or 5 inch flexible tripods slides into just perfectly.  The bag is also padded all around the exterior.  Both the bag and tripod can be purchased at any [local store]...  The only other thing I can think of right now is the Canon underwater case for scuba diving or to keep the sand and rain off the camera at the beach.  Also would be good for capturing falling rain on the slow shutter setting for that cool effect of streaming water.", "Date": "August 14, 2002"}, {"Title": "Slick gadget", "Author": "Demian L Barshay", "ReviewID": "R1PP8J6PXAQPBG", "Overall": "5.0", "Content": "...It seemed that most camera's had some type of flaw, but when I stumbled upon the S30/S40, most all of the reviews were extremely positive.So [now] we own one.  It's takes excellent pictures inside and out (to the level of a good quality 35mm point'n'shoot).  The built-in capabilities are robust and easy to utilize and the accompanying software is slick and easy to use.Downside is actually indicitive of all digital cameras, and that is the battery life.  The proprietary Lithium-Ion is a nice battery, easily charged at any time, and good for 500 chargings before incurring a...replacement fee.  But since Canon does NOT include an AC adapter (available), you are forced to rely on their battery more heavily.The use of metal in the body and clam-shell lens cover is something all makers should copy.", "Date": "March 7, 2002"}, {"Title": "The best digital camera ever!", "Author": null, "ReviewID": "R2YLO79J5KU6VR", "Overall": "5.0", "Content": "I got this camera for my birthday, and it is the best camera I've ever used.  The quality of the pictures is great, and with a 128 memory card you can take up to 140 pictures.  It has a movie option too which is so much fun to use.  My friends and family love seeing the videos of them, and I send out digital photo albums all the time to everyone.  I would highly recommend this camera to beginners or experienced photographers.  People that have tried my camera are now ditching their older models to upgrade to this one.  It's light, compact, and incredibly easy to learn to use.", "Date": "July 18, 2002"}, {"Title": "Digital Camera that does it all...", "Author": "Tundradude \"erl101\"", "ReviewID": "R2ZEDOALWXA4JE", "Overall": "5.0", "Content": "This camera was the best purchase I have ever made.  After careful searching on the web and reading reviews I settled on this camera.  I purchased this camera a year ago and wanted to wait to write the review so you could hear from someone who has owned for more than a weekend.  Now, of course the S40 is the same price as I paid for the s30 and would purchase that if you have the money.  I thought the s30 was a little more than I wanted to spend, but I have always been into photography and liked all the options, and loved the small size.  I have never once regretted spending a little over my budget on this camera.  I mean, how many digital cameras can you adjust the shutter speed, over expose or under expose, set all different kinds of light setting, adjust the flash, and be so easy to use a person with no photography knowledge can use.  This camera really can do it all!  On top of that, the picture quality is amazing.  Even printing out on my 150 dollar printer with photo paper my friends swear that they were professionaly developed.  If you send them into shutterfly.com, you will NEVER be able to tell they were taken from a digital camera.  I would recommend this camera to anyone looking for a great all around digital camera that can do everything an SLR can do.", "Date": "December 16, 2002"}, {"Title": "Couldn't be easier and takes great photos", "Author": null, "ReviewID": "R3IXICHBL5HG1A", "Overall": "5.0", "Content": "I'm brand new to digital cameras and did a ton of research before buying this camera.  With all of the functions I was worried that it would be tough to learn how to use.  All of the functions are really intuitive and it takes great pictures.  Get additional memory and battery or you'll run out of both very quickly.  Heard other people had problems with the software but it worked the first time for me on Windows98.", "Date": "December 10, 2001"}, {"Title": "Really good performance", "Author": "Marilyn Neilans \"Marilyn Smith Neilans\"", "ReviewID": "RL304W1XIE0E7", "Overall": "5.0", "Content": "I researched digital cameras at length before I settled on the S30.  There were a number of competitors with 3X optical zoom, with compact size, and with sharp display panels. The detail that persuaded me was the battery life - and I am thoroughly pleased.  I took the S30 to a party and not only took 70 shots (many of which were moving targets - dancing) but also spent a fair amount of time replaying them for the subjects' pleasure. The Lithium ion battery held up for the entire party.  The battery also recharges in only 80 minutes, so I did not feel the need to purchase a backup battery -- a big saving.  I did get an optional 128 MB CompactFlash card -- I recommend that.  I took all those shots at highest resolution and still had plenty of memory left. I also purchased a CompactFlash Card media reader which reads the card directly into the computer without using the camera's battery OR needing an AC powercord -- another saving. I cropped several of the candid shots, then printed at 8 1/2 X 11, with excellent results. My friends requested reprints to give to their families for Christmas. I have promised to take the photographs for an upcoming family wedding, and I have no reservations about the quality this camera can deliver.  Love this camera!", "Date": "August 23, 2002"}, {"Title": "My first review", "Author": null, "ReviewID": "R3BXWIGUUURI3U", "Overall": "5.0", "Content": "I always read everyone else's reviews, but this is the first time I've felt compelled to write one of my own. I am compelled because I absolutely LOVE this camera (Canon S30). I almost did not purchase it because the demo one at the local electronics store was pretty beat up and I wasn't sure it could handle all the possible dings that little items like this can suffer. Well, I swore I would keep it in it's bubble wrap and case for as long as possible, especially after reading the review of the person who got the cracked LCD. So far, this camera has been to Tahoe, Norway and Korea and has not suffered one bit. It's very easy to use and very intuitive. The only ding I might give it, is sometimes when trying to navigate through the menus, the set button doesn't always work (maybe I have big fingers?).The pictures are fantastic. I am one who had a decent SLR camera, but never could get great pictures. I enjoy the speed at which it downloads to my computer. I also very much enjoy the panorama feature and how great the pictures look on my 22\" monitor at work (yes, my boss spoils me!!). Definitely purchase another compact flash card for it (at least 128 mb).Anyway, I'm not one to give recommendations normally, but if you buy this, you will not be sorry.", "Date": "December 5, 2002"}, {"Title": "Canon S30 is most bang for buck and it fits in your pocket !", "Author": "akr", "ReviewID": "R6Q5VW7I42KJP", "Overall": "5.0", "Content": "I used an olympus c3040 prior to buying this camera and have thi camera for 4 months now. I like this camera's small size for the same MP/zoom range as the c3040. The small size makes it a little shakier, but you will get used to it. It takes very good quality pictures in daylight and fluoroscent lighting and has multiple white balance modes. You can also set your own white balance, which some people may find useful. I find the color and hue saturation with the factory set white balance great and much better than my previous 3MP camera.Night/Low light pics are not as good if you use the auto mode. Remember to set the setting to P (program) mode for night shots. Manual modes are great for low light situations and this camera works like any other non-digital (SLR-35 mm Film) camera. The RAW format images are useful to make even larger sized prints using appropriate software. I think the software bundled with the camera ... when used on windows 98. All they needed to do was to have windows 98 recognize it as another drive, but they made it twain based instead and boy that really ... for me. I have to go thru hoops to download pics to my windows 98 machine. However if you have XP, it is a breeze to use the camera and once you install the drivers it works like any other camera. I recommend reading the manual at least 3 times before using the advanced functions. The manual is somewhat technical but you need to read it!There is an available attachment for underwater pics, which is also great if you just want to use it in the summer on a beach or to take underwater pictures. As far as I know no other digital camera offers this yet.I also like the Photostitch option that allows you to take multiple pictures and then weave them together to get a large sized (panoramic) picture. You can combine multiple pictures to get a huge poster (even 40x40 inches) for example by using this function.It comes with a 16MB CF card which is rather small (holds 16-24 pics in high resolution and only 6-8 pics in RAW format). Now that 128/256/512 MB CF cards are available you may want to pick one up. However then you will also need an extended battery or an AC power pack as you will run out of power before you use the entire CF card.If you have no computer, this blighter can even print directly to a compatible printer, which is cool if you are travelling.I also would have really liked canon to include a small leather case with this, but then one can't ask for all!I still feel I have not found out all this camera can do even at 4 months and there are many features that I have not tried yet.The multipurpose button is sturdy, but some what difficult to use. Also they could have combined to zoom function to the same button (like in many videocams) for better funtionality while shooting. However I got used to the small buttons now and am really not finding it that much of a problem.", "Date": "January 29, 2003"}, {"Title": "Wonderful Product", "Author": "M. Gentry \"Mike n DFW\"", "ReviewID": "R1HULEKQAY90HQ", "Overall": "5.0", "Content": "I just returned home from a week long trip having just purchased my s30 and like several others on here I debated the s230 and the s30. Wow...what a great camera the s30 is..I really don't have a bad word to say about it except maybe the rocker button on it is a little hard to work. This is my third digital camera and I purchased this one based on its size, my other two were too big to be any use although they took fine pictures they were nothing compared to this beauty.  I've printed several 8x10's that I shot in medium 2 resolution that are flawless and this using an older Epson 880 printer, I can only imagine what high resolution must look like. Anyway you will not be disappointed with this camera...trust me I take a lot of pictures and the s30 just makes it that much more fun. This is one device that delivers as advertised.", "Date": "January 27, 2003"}, {"Title": "The best 3.2 MP camera", "Author": null, "ReviewID": "R34EU4FIFIV72T", "Overall": "5.0", "Content": "The best 3.2 MP camera you can get for that price, can be used as point and shot, but this is not what it made for.Endless features are packed into this relatively small body, very high built quality, feels like a little brick, image quality is a full 10, I did print 8x11 images that are very hard to distinguish from film.If you have no patience to read it's 144-page manual, don't bother, you are wasting your money, I got amazing results once I was able to master it, took me about one month.", "Date": "November 19, 2002"}, {"Title": "Great little workhorse camera", "Author": "Ray", "ReviewID": "R2WPF5DEH67TOV", "Overall": "5.0", "Content": "Well, i just picked this camera up yesterday after returning a Olympus c-3020 that I had bought 2 days prior.The reason I got the Olympus first was I thought I wanted to be able to use AA batteries because of availability and I thought that the rechargable one that came with the Canon would not alow me to take that many pictures before having to recharge the battery. Boy was I mistaken!!!The Olympus only gave me about 30 pictures before i had to replace the batteries. Well after tallying up what batteries were going to set me back ( YIKES ) and visiting Canon's web site to look at the PDF manual to see how long the Lithium-Ion battery lasted (about 150 pics acording to the manual) I imeditately packed up the Olympus at took it back to the store and exchanged it for the Canon S-30.I also picked up a 128 mb CF card at the same time so I can be assured of enough storage to capture everything I might want to take a picture of on vactions, special events etc...I am very happy with the way the camera feels ie. the brushed aluminum case (all metal...no plastic)The picture quality is phenomenal after only a few hours of goofing around with it here at home. I can only imagine what the results will be after i really learn all the little cool things this baby can do.I highly recomend this camera to anyone looking for a mid priced, med-high megapixel camera.", "Date": "May 18, 2002"}, {"Title": "Fabulous Camera", "Author": "Teamorganx", "ReviewID": "R2BUFDBL5VJQTS", "Overall": "5.0", "Content": "This is the best camera I've ever owned.  Very user friendly, great pictures for online and print.  Love the 30 sec video feature, B&W;, antique, ... When purchasing, be sure to get an extra battery even though the battery can be used for a couple of hours. Also get a 256k card, holds up to 200 high quality pics and more if you decrease the resolution giving you up to at least 1000 shots.  LOVE IT!!!!", "Date": "September 20, 2002"}, {"Title": "Not for those who travel abroad", "Author": null, "ReviewID": "R1AH5ZQITP5RJC", "Overall": "4.0", "Content": "I bought this camera because of all the wonderful consumer and critic reviews. However, if you are someone that travels frequently or is out of the country and want to email pics back to family and friends of places you are visiting, then I suggest looking into an Olympus instead. In order to view your pics or email them or just upload them onto a computer, you need to first install the canon software. This is not practical if you are in a random internet cafe in Europe.The Olympus allows you to upload pics using only the USB cable without having to install software. There is a catch on the Olympus too. You can only upload your pictures without having to upload software if you are using Microsoft XP/ME editions. Really do your research before buying.", "Date": "April 5, 2002"}, {"Title": "Compact camera that takes great pictures", "Author": "Dinh Yen Tran", "ReviewID": "R3R8YAB0DLC28V", "Overall": "5.0", "Content": "Canon's S30 fills a nice niche between expensive, feature-laden cameras and point-and-shoots.  Its compact size, snug enough to fit in the palm of your hand and perfect for slipping into a pocket, makes it an ideal companion for those excursions when a larger camera would be too bulky or conspicuous.  The silver all-metal body is sleek and stylish, so much that it's almost a fashion accessory.  It's loaded with features, an amazing feat for such a small package, while at the same time offers unparalleled ease of use.  Lastly, it's a great deal considering its price-feature ratio.The S30 includes the usual automatic presets such as landscape and portrait, but also offers the semi-automatic and fully manual modes that a serious photographer would want.  The following adjustments may come in handy: 1) film speed from ASA-equivalent 50 to 800, 2) spot, center-weighted and evaluative metering modes, 3) three selectable autofocus areas, 4) exposure compensation between -2 and 2 EV in steps of 1/3 EV, 5) continuous drive mode (though maxing out at a modest 2.5fps), 6) macro mode.  While I still prefer an SLR in most situations, the S30 fills many of my needs very nicely.  I use the it to take preview or experimental shots or to take shots that I would hesitate to blow film on.  Morever, the S30 makes your job a cinch when it comes to panoramas.  The panoramic mode shows you a third of the previous frame, either vertical or horizontal, which is an invaluable guide to help you line up the current frame.  I used to have to spend a lot of time in Photoshop to line up adjacent frames and erase the seams between frames.  Canon's Photostitch software does all of that and more, at the click of a button!Picture quality is very good, with excellent sharpness throughout the image and no noticeable softness in the corners at wide-angle.  Macro shots are very sharp, to the point that I decided to do close-ups primarily with the S30.  Colors can be a little flat, but this can be easily fixed in Photoshop.  There is a special \"Vivid\" or saturated mode, but this comes at the expense of losing other controls over the shot.  I've noticed that the dynamic range for the CCD sensor is quite low, much worse than for color negatives or slides.  This is most apparent if you've got a mixed light and dark scene; either the sky would be washed out or the foreground would be underexposed.  This could be a shortcoming of CCDs in general and not one particular to the S30.The S30's 3-megapixels resolution is good enough for a 2048x1536 image, which in turn is sufficient for 8x10 enlargements.  If this is not large enough for your needs, the S40 ups the ante to 4 megapixels.  There is a USB jack for downloading images and an A/V jack for previewing images on TV.  You will want to invest in a CF card-reader however, for convenience's sake.  The storage slot takes Type I or II CF cards, and also accommodates a Microdrive.The S30's compact size is its greatest asset, but is also responsible for a few shortcomings.  The 1.8\" LCD screen is bright and contrasty, but only indoors.  Lacking a swivel and anti-glare coating, it's virtually useless outdoors.  You may have to resort to the optical viewfinder, which does not cover 100 percent of the image.  The LCD displays most useful information, but inexplicably lacks a battery life indicator.  You'd have no idea how much power is left until the low-battery indicator flashes.  To make matters worse, the rechargeable Li-Ion battery has rather short lifespan, between 30-50 shots.  I have to carry 2 spare batteries in order to shoot for a whole day.  The thumb-operated directional controller is rather awkward to use.  You scroll to move up/down and press to move left/right.  To select, you have to press down on the middle.  In my case, to hit select, I had to learn a way to press it just right, otherwise the controller would move left or right instead.  Lastly, while this may not matter much to most people, I frequently use a tripod, which blocks the battery cover and makes changing battery quite a hassle.Despite its shortcomings, I've found the S30 to be an indispensable companion.  I've had it for almost a year and taken it with me on trips to Asia and throughout western North America.  At times I yearned for a more advanced camera like the Canon G2 or even a digital SLR, but more often than not I found myself thankful that I was able to take pictures I wouldn't have taken otherwise with a larger camera. The S30 has more than paid for itself.", "Date": "March 21, 2003"}, {"Title": "S30 or S230 !!!?!!?!", "Author": "Snr", "ReviewID": "RUO75WUCUCWE8", "Overall": "5.0", "Content": "Before I purchased my s30 , I was orginally going to get the s230. Considering that the s30 had a drop of price to 400 , and now it was the same price as the s230 , that made my decision difficult. Many people buy the s230 because of its size, and that was the reason I was going to get it. But before I purchased a camera I played with both of them and the s230 is so small its hard to navigate between the different shooting modes and I knew I would not take the same quality pictures with it and it did not have the same zoom (6x as opposed 10x), I decided to go with the s30 and I am very PLEASED!!!! its great and the menu's are so easily accesible and I love it! the only con is the movie's are limited to 30 seconds each .(but you can tape many of them on your memeory card depending on its size.) Definetly canon is the way to go!!!!!!!!!! now whether you go for size or better camera is your choice , but trust me the s30 is a much better overall camera and it is not much bigger.", "Date": "January 12, 2003"}, {"Title": "Everything you could want -- and more", "Author": "Barbara B.", "ReviewID": "RA6OJMFW7V7Z0", "Overall": "5.0", "Content": "I've owned this camera for about 6 weeks and have taken more than 300 pictures. So far, it has performed admirably under a wide variety of situations. It has all of the options (shutter speed and aperture control, white balance, etc.) that my high end Canon SLR camera has -- and more. I doubt if I've scratched the surface yet. The quality is excellent (although keeping still the fraction of a second after you hit the shutter release takes some getting used to -- a few blurry pics at first). Macro option is incredible.Image compression can be set for very high resolution (good enough for reproduction in quality magazines) or lower resolution (for web images). ...The only minor complaint I have is that it is a very SMALL camera, especially when compared to my big hefty one, which takes some getting use to. People don't take you seriously as a photographer when you tote around this thing. Also, you cannot attach filters or auxiliary lenses (although a session in Photoshop will usually do the same thing).All in all, I am very pleased. In fact, I'm buying a second camera (exact same) for my partner who keeps \"borrowing\" the camera to take shots while I twiddle my thumbs.By the way --- you might be able to get this camera cheaper through other places on the internet, but be careful. There are a lot of rip off companies out there. With Amazon, you know you'll get the product in a timely fashion and they have excellent customer service if anything goes wrong. I have bought repeatedly through Amazon and have NEVER been dissatisfied.", "Date": "June 8, 2002"}, {"Title": "Time to let go my film camera!", "Author": "M. Gao \"ming\"", "ReviewID": "R2PF3JK8Q10V2N", "Overall": "5.0", "Content": "Bought this camera a month ago along with a 128MB sandisk.  Really enjoyed it. Both my wife and I are taking many more pictures and in more occasions than before.The focus is very sharp and len is pretty fast.  The picture resolution is just blowing you up.I found Costco has a print service for digital pictures, 20c for each print. So we tends to take 50 or 100 pictures at once and then select a few for print.  You can not tell this is a print from digital camera, except the resolution is astonishing.It takes 30 seconds video clips as well, though somehow the focus is not that great and with low resolution, the video lookspretty fuzzy.Will stay with static picture taking.", "Date": "April 30, 2002"}, {"Title": "Great camera just the battery dies to quick", "Author": null, "ReviewID": "R3B7JGT2KPTY2Q", "Overall": "4.0", "Content": "I have this camera for like 3 months now. I love it so far other than the battery dies on you all the time and you have to recharge it if you don't have a spair. So if you do get this camera get anther battery or two it be woth it if you are somewhere when your battery goes down and can't recharge it when you need it most.", "Date": "November 26, 2002"}, {"Title": "Fantastic camera!", "Author": null, "ReviewID": "R35810XYC89N6F", "Overall": "4.0", "Content": "This is one spectacular camera for the novice photographer! When I was looking at digital cameras online, I was stuck between choosing from the S30 or the S330, both from Canon. When I went to a store and physically saw the 2 models, I immediately knew I liked the S30 better. The solid silver color was much shiner than the S330's duller and darker silver color. The S30 also felt much more like a camera when holding it. Overall, I am happy that I chose the S30.It is so easy to use and the zoom can take very detailed pictures. The night time scene is one particular option I would like to point out. I just discovered this, so I'm not sure if this works with other cameras as well. If you switch to the night scene option and you photograph a pitch dark area, the camera is able to make out all the actual colors of the thing you're photographing instead of producing a dark picture. This is great for concerts (of course, there's a very big noticable bright flash), but it might be a drawback if you were really aiming to take pictures of the night time.I give it a 4 stars instead of a 5 because of it's problem with battery and my trouble installing the software. If you plan to use this camera for one whole day, you will most certainly need extra batteries. I used the camera for maybe about 2 hours straight before the battery totally went dead (and I fully charged the batteries before initial use too). I also experienced a little trouble installing the TWAIN drivers that are needed if you want to download the pictures from your camera to your computer. I use Windows 98 and for some odd reason, my the manual's instruction didn't work for me. I had to figure this out some other way to install the drivers.Other those 2 minor points, this camera is spectacular!", "Date": "May 26, 2002"}, {"Title": "Great Camera!!!", "Author": "Kyle D. Gendron", "ReviewID": "R2ZE4B1HLDDYOK", "Overall": "5.0", "Content": "We've had this camera for about a month and a half...I've taken approximately 200 pics with it. Awesome is all I can say...I've been into photography for about 15 years. My film camera I spent $[money] on between body, lenses, and flash (a Nikon N70, 2 zoom lenses and a zoom flash). The Canon S30 takes just as good pictures and its easy enough to use that my wife can also use it.Downloading pics to the computer takes 1 or 2 seconds. I can take  a picture, download and post it to the internet in less than 4 minutes.Quality is outstanding. I love this camera. I still have film in my Nikon from my sons birth that I haven't taken out to get developed yet. And unlike my anal photo way that I am, it doesn't bother me because we have the Canon S30.One other great feature I was able to use while taking pics at the hospital, was the black and white feature. Just turn the dial and take black and white pictures of a mother with her new baby.One last thing: upgrade to a bigger flash card, I found a 128MG card for $[money] and I also purchased a 2nd battery for $[money]. Both at other online stores...The battery doesn't take long to charge, but if your in the middle of photo taking it is nice to have an extra...", "Date": "May 5, 2002"}, {"Title": "Best camera I've ever owned - and I've had a bunch", "Author": "AP", "ReviewID": "R31D5580NAA7IB", "Overall": "5.0", "Content": "I've owned about 5 digital cameras in my life and this is by far better than anything I've ever seen.  The first rule about digital photography is that a camera only takes great photos when you take it with you.  If it's too big to carry everywhere you won't get much use out of it.  The S30 has a flat shape and travels well - far better than any fuji, nikon or kodak I've owned before.  Second, the photos it takes are spectacular.  While recently studying abroad I took about 2800 photos and the clarity and color of the shots I took is better than a traditional APS film camera.  I have been very surprised with how well these shots come out when I take them to Costco or Shutterfly for printing (even at 8x10 and larger).  It also has some additional features I tend to use a lot more than I expected.  A lot of cameras out there today offer the ability to take 30 second movies, but very few also offer sound.  The S30 has a built in microphone that makes this feature far more useful and the clips you take much more memorable.  Watching a movie of your friends laughing at a joke isn't very funny if you can't hear the punch line.  This ability to take small clips and fit the camera into a pocket also eliminated my need to buy a separate video camera.  The panorama feature is also a ton of fun to play with and my home now has 30 inch prints of panoramas I've taken in various cities around the world.Finally, Canon has by far the easiest and most intuitive software for organizing and archiving photos on your computer.  Amazingly, the software is simple enough for anyone to pick up but robust enough that hard-core enthusiasts like myself still use it to do nearly everything.  Even the using the camera itself is a no-brainer to figure out.Get a larger memory card and I recommend an extra battery if you are planning on traveling with it.  I am probably one of the most critical people when it comes to electronics but this camera has exceeded every expectation I've had and I plan to hold onto it for a long time.", "Date": "January 10, 2003"}, {"Title": "Great Digital Camera!!", "Author": null, "ReviewID": "R1N0J0XZU7QM09", "Overall": "4.0", "Content": "I researched digital cameras for several weeks before purchasing the S30 for my wife as a replacement for her point and shoot film camera. The camera is easy to use and takes great pictures right out of the box (Of course you need to charge the battery first).  Most of the shots we has taken so far have been in the \"Auto\" mode and exposures both indoor and out are excellent.  The S30 is loaded with so many features it should satisfy even the more advanced shutterbugs.Two things I would recommend, an extra battery and larger CF card as the S30 only comes with a 16MB card and a single battery.  I do agree with some of the other reviews that the joystick takes a little getting used to; otherwise I would have given this camera 5 stars.", "Date": "January 3, 2003"}, {"Title": "Great Camera!", "Author": "Amazon Customer", "ReviewID": "R3CWPEV84NXBS9", "Overall": "5.0", "Content": "I've owned the Canon Powershot S30 for about two months now and am still amazed daily at how well this little camera can take pictures!  Pictures come out so clear it is amazing!  The prints I have made from my computer look EXACTLY like professionally developed prints.  All of my friends have been amazed at the quality and clarity, \"You did this from a computer and digital camera!\" they have often responded.  Not only is the picture quality superb, but the ease of use is wonderful.  The LCD screen features handy little guides that help to frame and focus your pictures just right.  Pre-focusing lets you know if all your elements are right for the perfect picture.I haven't yet ventured into all the more advanced features of the S30 yet, but I hope to soon.  From reading the owner's manual, there appears to be an endless amount of experimentation yet to be had.  Suggestions for use of this camera include purchasing a bigger Compact flash card.  I use of 256mb card and haven't completely filled it yet.  Also look into an extra set of batteries because this camera can drain some power!  These can be quite difficult to find, unlike many other Canon accessories.  You only the original CANON brand battery.  I have only been able to find this battery on the Canon website, but I have yet to check with the more upscale camera stores in my area.I would definitely recommend this camera to anyone wanting to print there own pictures.  This camera has completely replaced by other non-digital Canon camera!  A good accessory for this camera is a good quality photo camera. Epson has a wonderful model for under cost.", "Date": "July 9, 2002"}, {"Title": "very good picture quality for its size", "Author": "R. Li", "ReviewID": "R3QJ4GA2PB944P", "Overall": "5.0", "Content": "I was in the market for a compact digital camera, was looking at the elph or the kyrocera.  The picture quality was not there.  I read about the pending release of the s30 and s40, with comprable quality to the G2 but at a smaller size.  The image quality is definatly there, a little soft in the corners.  The camera also allows manual control of the pictures.One small problem is the lcd screen on the back, does not have the standard anti-reflecting coating other canon's have, but i can live with that", "Date": "December 11, 2001"}, {"Title": "Record your life with this machine.", "Author": "Burak Kilic", "ReviewID": "R1LTWWH9XTVO51", "Overall": "5.0", "Content": "It's been nearly four months since I purchased Canon S30, and I must say that my contentment with it is increasing every day!The image quality is excellent. In the automatic mode, all you have to do is simply pressing the big button. Even if you're a professional, this becomes handy when you need quick and good pics. Otherwise, the manual option is excellent too. If you do not wish to use the flash, then you have to be very careful in holding the machine still; because a slight tremble can create a blur in the whole image. But these are, usage issues, that can be solved very quickly.The size of the pictures varies from your computer's screen to a 8-11 page. It's good that you get big pictures, because you can resize them to any dimension you want afterwards.There's a movie feature, which runs from 30s to 2 min, according to the size of it. I did not know this when I was buying it; but I must say that for the most of the time, I'm shooting movies instead. The reason is that you can record sound perfectly as well and I do mean it! It's in .mov format which can be easily played by any player. Furthermore, I've actually put together an amateur short film, by combining and editing the movies in Windows Movie Maker. It's just wonderful to have this machine.The softwares included with the machine are good, but they have some flaws unfortunately. The picture organizer, called ImageReady, hassles sorting all the images when you add or remove an image, which takes a lot of time when you have hundred images.It's really necessary that you purchase another battery. Having two keeps you safe in long journeys. I also recommend you to buy another memory card. The one that comes with the machine is 16 megs, which is not bad actually, but you might want to get a 256 meg one, and do not bother with loading off your images frequently. This is totally extra, but I also have a memory reader, Intelliflash, which is about 6 times faster than the computer in transfering the images. If you're dealing with many pictures or movies at a time, this might be your solution.If you really want to make a combo with S30 by buying a photo printer, then I would go for Canon i850, for which I have a special review on the product's page in amazon. With the two, you will be able to shoot pictures, transfer them to computer and print them in minutes. What sets a digital camera apart from a nondigital camera is that you can modify your images on computer. If you want to leave things to chance, and wait for results, nondigital is loveable. However, if you want to edit your images, crop some people out or make yourself more beautiful or handsome, digital camera is just for you! I have both of them. I carry them side by side inside my canon bag. (Yes, I'm obsessed with Canon!) According to how I feel about the atmosphere, I use them interchangeably. Also, another thing about Canon S30: I was also once trying to figure out which camera to buy, looking at all zooms and digital zooms of every machine... But, you know what, it just never ends! The next day we will have 20x zooms. So, I grant you, that this machine will not disappoint you by any means. Do what your mind tells you...", "Date": "April 26, 2003"}, {"Title": "More capable than I imagined", "Author": "JRH", "ReviewID": "R1CCPMZAPE5RAX", "Overall": "5.0", "Content": "When I selected this camera I knew the written specs, so it's hard to say I was surprised at what it can do, but I was surprised! The photo modes work great and produce outstanding shots, no surprise there.I was annoyed at first that I can't date stamp the images themselves with the camera, but the S30 records the data and time the picture was taken in the meta-data of the JPEG. In addition, there are a dozen more interesting tidbits in that meta-data, like F-stop, shutter speed and the distance from subject. This kind of detail reveals Canon's dedication to the pro-sumer market. The big surprises came in the movie mode, which does a pretty good job, and with the excellent software Canon bundles with the S30. This software really helps me accomplish the creative things I planned when I bought it.", "Date": "March 10, 2002"}, {"Title": "Outstanding little camera", "Author": null, "ReviewID": "R1Z6H5F32ZOWH9", "Overall": "5.0", "Content": "This is my first digital camera and so far has been exactly what I was hoping for. After looking around a lot, I bought this because it had more features than the smaller Canon Elph's; was smaller than the comparable Olympus models, and seemed to have a higher quality construction overall than the Nikons (note: I am not an expert, just observing). Positive surprises -- really quite easy to use; great quality build and \"feel.\" Also -- after getting used to the fact that you have to leave home w/charged batteries, and after buying a 128MB flash memory card, I find the capacity of the camera sufficient for all normal uses.I have been playing both with printing out photos on an HP Photosmart 1215 printer and w/using the Ofoto software that comes w/the camera. Both are fun -- the Photosmart printer is great to pop out a quick set of photos from a day's outing, and the Ofoto service is quite convenient. They both add a new dimension to fun photography.", "Date": "December 24, 2001"}, {"Title": "all metal case! yea!", "Author": "Mr Chow", "ReviewID": "R3D6RJ0ZBI4JFM", "Overall": "5.0", "Content": "I was going to buy the s110 but it was all sold out! Oh no! Well sitting right next to it was this little jem. Ok so its a little bigger than the s110 but its got MORE...3.2MP with a RAW file output.TOTAL control of image quality.3 settings for JPEG comression.4 Resolution settings from 640*480 to 2048*1537 JPEGPhoto Stich Feature (makes panoramas easy as pie)Nifty sliding cover acts as lens and on/offFast refresh for taking may pictures in a row!4in MacroOf course theres lots more. Pro: Aluminium caseCon: heavy conpared to the plastic bodied onesPro: rechargable batteryetc... go play with it at your local electronics store.", "Date": "December 27, 2001"}, {"Title": "fine, unless it breaks down", "Author": "\"glodene\"", "ReviewID": "R1I5A10O8LDW9D", "Overall": "1.0", "Content": "I bought a Canon PowerShot S30, and it stopped functioning in the middle of a trip.  It was under warrantee, but it took about 4 phone calls to find out where to send it for repair.  When I sent it out, it disappeared for about 2 months, after which I got a letter saying that they wouldn't repair it because I'd damaged it.  After hours on the phone trying to talk to someone, I was finally told, basically, that they couldn't find the problem but, they assumed it must be my fault.  After another hour on the phone to Canon headquarters, they agreed that they had made a mistake and said that they would repair it.  But, they seem to have lost track because yesterday the camera came back in a box unrepaired with no explanation.  I've owned Canons for years, but I would never buy another one.", "Date": "October 9, 2003"}, {"Title": "glad i bought this camera", "Author": "Mark J. \"mjordon2\"", "ReviewID": "RAM2FR6E6YGO2", "Overall": "5.0", "Content": "I shopped around and read a lot of reviews before I bought theS30. I am an amateur photographer with a little more experience than most people and wanted manual exposure settings and manual focus. Many digital cameras out there do not have manual focus. This camera is an awesome machine for the size. the controls are intuitive. My pictures have been turning out great on auto settings.I had been thinking of buying the Sony cameras with the CD-r capability, but have to say that downloading pictures with the Canon is a breeze. The computer even detects the camera as soon as you plug it in to the USB cable. Software was easy to install on both Windows ME and XP and works well to touch up pictures.", "Date": "January 16, 2003"}, {"Title": "Small and Light and Powerful too.", "Author": null, "ReviewID": "R3P5ONC2FYP9KE", "Overall": "5.0", "Content": "I must admit that I am biased towards Canon. I have never had a Canon product I did not like. That feeling continues with my Power Shot S30. The one feature which delights me most is the view-finder. Now, that does not sound like much, but for me it is great. My last $800.00 digital marvel did not have a view-finder and the LCD screen was worthless as soon as twilight approached. Even the fact the the Canon's other features are better and easier to use, the view-finder means that I can use all of those features without banging my head against the nearest hard object in frustration. And better and easier those features are, from the 3x optical zoom to the ability to change to shutter priority.If the S30 has the same quality as my four previous Canon printers and my Canon SLR, and I have no doubt that it does, I'll be very, very happy.", "Date": "June 8, 2002"}, {"Title": "great camera", "Author": null, "ReviewID": "R3AIANS55SDC9S", "Overall": "5.0", "Content": "Spent 2 months deciding on which camera to get, and with the help of amazon's customers reviews made the decision on the S30 over the olympus.  My only hesitation for the Canon was the fact that it didn't take AA batteries.  But I am happy I went with the s30 and the battery has a good life (about 150 pictures I think it said).  Basically I have been taking pictures on \"auto\" since I got the camera, indoor/outdoor all take great pictures.  Very happy with this camera.", "Date": "April 17, 2002"}, {"Title": "Great Camera, but had to return it twice!!!!!", "Author": "Louis Castle", "ReviewID": "R2BJ5D2OXZDB0", "Overall": "4.0", "Content": "I purchased the S30 from J&R; cat. for... great price!! I had to return it twice for the same problem of a burnt pixel, which according to canon was in the CCD not the LCD!! This was something I could not over look since my prints had a green dot in the middle where the pixel was burnt.  Camera #3 seems to be OK. Otherwise, the camera is simple to use with many fun options (movie mode, B/W pictures, audio).  The prints are impressively film-like (Canon S800 printer). I purchased a NEW 256 mb cf-card...works great...it gives me 154 pictures at the highest resolution!! Works well with its own Canon software, but I found that prints using Adobe LE were blurry...don't know why?!?!? Not a big deal. The bottom line is that it is a good camera, with many features, film-like resolution, good price, good looks, and the Canon name.  BUY A LARGER CF CARD!!!!!!", "Date": "March 29, 2002"}, {"Title": "Second digital owned", "Author": null, "ReviewID": "RIAUZTWFFRCOW", "Overall": "5.0", "Content": "I have had the this camera for 2 weeks and have been very pleased.  I also own an Olympus digital.  There is no comparison in the ease of use, the ease of the software, and the simplicity of the menu functions of the Canon over the Olympus.  Olympus is still a good camera, but the large step up to the Canon just shows how good a camera this is.  I am very happy.", "Date": "December 19, 2001"}, {"Title": "Wonderful.", "Author": "Rheumor", "ReviewID": "R6BZ0212Y3SIK", "Overall": "5.0", "Content": "This is a very sturdy little camera, the mid-level entry in Canon's \"S\" line. It features great optics and a decent optical & digital zoom combination, as well as awesome 3 megapixel resolution (enlargements of 11\" x 14\" are no problem). If you had to buy one digital camera for all your needs, chances are you'd find the S30 a satisfying choice. It does require a 2nd battery and a larger memory card to be ready to go, but aside from that, it's nearly perfect.", "Date": "May 27, 2002"}, {"Title": "Excellent camera in small form factor", "Author": "R. Lanthier", "ReviewID": "RVXJNQD4PUC82", "Overall": "5.0", "Content": "This is my first \"true\" digital camera. I have a basic one included on my VHS-C panasonic camocorder, but that is nothing compared to this Canon unit. I was initially attracted by the metal look, solid feel, size, and when I looked at the feature set, said wow! Have not been dissapointed. You will love the features (many pre-set modes and full manual control for the photo-buff), excellent photo quality, and it looks so cool :). Something you will want to buy: a larger CF card, it comes with a 16MB but you will outgrow that after about 7 shots at the highest resolution. Excellent camera, enjoy!", "Date": "January 8, 2002"}, {"Title": "Do not buy a Canon camera.", "Author": "Mallory23 \"Mallory23\"", "ReviewID": "R2IXDHWXGS2TCQ", "Overall": "1.0", "Content": "If you really are going to buy one .. try this search on Google first \"Canon e18\".  Read the reports this returns.The dreaded e18 error affects cameras across the line and means they are pretty much dead (lens will not retract).  Mine got the error a few days ago.Canon has evidence of hundreds of such errors but provides no information on their website.", "Date": "November 9, 2003"}, {"Title": "Well Beyond Just a Point and Shoot Camera", "Author": "max fischer \"max-fischer\"", "ReviewID": "R1C8IHUWGS51LA", "Overall": "4.0", "Content": "Fully automatic point and shoot for the novice in the family but with fully programmable features to satisfy even the most experienced amateur. I'll let sites like Imaging Resource (.com) and others like it comment on image quality and other technicals, which are fantastic, and I encourage you to check these out for the meat of your investigation. For this review, I've chosen to focus mostly on ergonomics, feature set and usability.Pros:- Small sturdy form factor: in the 3 MP category, not as small as the DimageX, but doesn't sacrifice quality so you can hang it around your neck - not that kind of camera- Advanced feature set to satisfy the experienced amateur- Movie mode: capture 30 seconds at a time w/ sound - not a good substitute for a camcorder, but more handy than you would think (e.g. I capture 4-5 golf swings in 30 seconds, download it to my computer and analyze in slow motion/frame advance in Win Media Player 9)- Absolutely fantastic image quality (my layman's opinion)Cons:- On camera flash a bad light source: all 35mm/digital cameras have this problem, but what makes this a con for this camera, especially if you are an experienced photographer, is the S30 can not power an off-camera flash (through a hot sync).- \"Enter/OK\" softkey switch that controls a number of menu functions is a little difficult to master.- No diopter: this means that why you see through the viewfinder is not quite what you get. You must use the LCD to see exactly how it will be framed, but of course this uses battery power.Other Issues:- Proprietary battery: I wouldn't worry about this - the batteries charge quickly (1 hour), are getting cheaper (see this site for the NB-2L) and are Lithium Ion which should last a good while.- Somewhat fragile sliding lens cover - don't handle it roughly and it will function fineAlso, reading the manual is a must - take the 60 minutes and just do it. A word on the other Powershot cameras - the S40, with 4 MP, and the S50 with 5 MP. The S30 is more than adequate to get a 35mm quality 8x10 print - why an amateur would want 5 MP I'm not sure, but if you are a professional, I doubt you're looking at the Powershot series so stick with the S30.If You Buy It:  get (1) a bigger CF card (at least 128 MB - see my Viking review), (2) an extra battery (see my Canon NB-2L review) and (3) a CF card reader to save on battery power.Bottom Line: Not quite a home run, but great mid to high end consumer 3MP - you will not be disappointed.", "Date": "May 29, 2003"}, {"Title": "Owed for 1 year  now", "Author": null, "ReviewID": "R92Z12POPO10J", "Overall": "4.0", "Content": "Do prices go down fast or what?  I brought my camera 1 year ago for 400, and now it is 300.  Now that I have owned this for 1 year, I know both pros and cons of this camera.Pro: very nice pictures overall and great quality too.  The cool feature is the \"night\" mode\".  Switch to this mode, go into a dark room, and then take the picture.  Presto, the pictures comes out in color as if it was daytime.  But sometimes, if you use this mode at farther objects, the picture tends to get overexposed and you get a blurry lighted picture that looks like lighting struck.  Takes excellent everyday pictures!Con: battery life is pretty short..if you plan on going on a trip, I guess buying an extra battery and bring the recharger.- dark indoor pictures sometimes.  I've tried this on several occasions taking indoor pictures.  If your subject is close to you, the picture comes out excellent and great quality.  But if you were to take the picture from far away and try to zoom in at something (such as at a concerthall, or a graduation, the picture comes out dark and dull).  Anyone have suggestions to make it appear brighter?-if you leave it on for a while (1/2 hour), the camera will get very warm.  I'm not sure if this is true of all digital cameras though.", "Date": "May 14, 2003"}, {"Title": "just what I was looking for", "Author": "Anna B.", "ReviewID": "RKWVHJ0TBMARW", "Overall": "5.0", "Content": "I had been looking for a digital camera for personal and family use for a couple of months. Having used the Canon G2 at the art gallery where I work, I was familiar with how a high quality digtial camera works. So I used the G2's features as quidelines for choosing a digital camera for myself. I wanted something smaller than the G2 to make it more portable for travel, etc. less expensive, and yet with similar features. I found just what I was looking for in the Canon Powershot S30. I love it and the images it takes. Image and color capture is great. I still haven't learned or tried all its features, but so far am more than satisfied with my choice and would recommend it highly.", "Date": "February 16, 2003"}, {"Title": "Love it!!!", "Author": "3RAcademy", "ReviewID": "R1E2LYP0OYEZCZ", "Overall": "5.0", "Content": "This is a pretty snazzy one and has lots of things I never use. I mostly keep it set on auto. It takes excellent pictures though. I always take them on the highest quality setting - they are bigger than my screen. But then if I get them printed on one of those Picture Maker Machines - they look perfect. You would never know they were from a digital camera.  (This is a 3.2 MegaPixel camera - the only reason I see to go bigger  would be = the bigger the picture, the more you can crop it and still have a high quality picture). One of the best things about the camera is that it has a rechargeable battery - so I never have to buy batteries or film.  I rarely use my regular camera anymore. Also.. It takes great little 30 second movies, and I love to hook it to a tv at parties and show off all the photos I just took. What fun.", "Date": "February 13, 2003"}, {"Title": "This is the last word in Cool Digital Cameras", "Author": "Eric Feuerstein", "ReviewID": "RGJVW3VBD62OE", "Overall": "5.0", "Content": "I have been looking for 2 months for a good digicam, checked out every site, every review, every everything. I bought the s30 camera and all I have to say is, WHAT A CAMERA!...Whether you are a novice like me who wants to just shoot great pics, or a more advanced person who wants to mess around with all the manual settings, you wont be dissappointed!...Do yourself a favor, stop worrying about whether the camera youre going to buy will be good......dump it and get the Canon s30!", "Date": "January 25, 2003"}, {"Title": "Easy to use!", "Author": null, "ReviewID": "R3EVY76KYHIIGT", "Overall": "5.0", "Content": "I bought this camera in the Caribean so I could get rid of my disposable cameras!  The battery charged in an hour and was ready to use the same day!  I am so pleased with my pictures and the software.  I was lucky that when I bought this camera I was GIVEN a 64mb memory card along with the camera for a very good price.  This camera is so easy to use that you will definately want to get a larger memory card than the 16MB it comes with!  Great camera for vacation, and home!", "Date": "January 20, 2003"}, {"Title": "so satisfied!", "Author": "H. R. piercy", "ReviewID": "R2ZI3D3LGWJKLB", "Overall": "5.0", "Content": "I recently bought my s30 along with the ibook and am set. This little camera is small, sleek, and light. It is easy to use, and after reading the instructions I can even use the fancy features such as preset contrast( to prevent washout) and a 'cockle doodle doo' to signal a self timer shot (makes every one laugh). These are only a few of the many features included. The quality is also exceptional. Digital cameras sometimes have trouble with 'action' shots. This camera took a crisp close up of my girls face, hair in the wind, while swinging. Enlarged to 8x11, it is great. This point and shoot is great.", "Date": "December 16, 2002"}, {"Title": "Excellent mid-range camera.", "Author": null, "ReviewID": "R2JP8TR3JIFHCS", "Overall": "4.0", "Content": "This is a fantastic camera. It will take a while to learn the myriad of features, but it's worth it. Get the 128Mb (or more) compact flash card. You'll thank yourself later. My only three grumbles about this camera are that the battery will last about 1.5 hours, digital zoom is a bit blurry (optical zoom is excellent, by the way), and no camera case came with the camera. Hence, the four out of five stars...", "Date": "August 10, 2002"}, {"Title": "Great camera, taking good pictures", "Author": null, "ReviewID": "RX0F3MB2MVBRK", "Overall": "5.0", "Content": "I had this camera about a week after reviewing the rating and owners comments. I am very happy to have it. I took some pictures in Av mode in door without flash, the picture is still very bright.I noticed that setting the ISO at 800, the resolution is starting to reduce. However,this setting still can be use in the  theater where the flash is not allowed to use.It is also a good tool to teach someone how to take a picture. You can try to take several picture with different settings, then to review them to find out which setting is the best.Highly recommanded.", "Date": "March 27, 2002"}, {"Title": "a great camera at a great price", "Author": "\"bongbongcat\"", "ReviewID": "RXO86UT5RSTBN", "Overall": "5.0", "Content": "trying to decide between S230 and S30 was a hard one: S230 is significantly smaller and much cuter (very much a girl's camera); but s30 has 3x zoom and slightly better optical properties. after going back and forth, i finally decided on s30 and have been very happy with it. bottom line: if you're looking for portability, go for the S230 because the s30 is too thick to fit in your pocket. however, if you're caring a purse/bag/case around anyway, get this one! (i also found a cheaper price elsewhere so make sure you look around.)", "Date": "January 3, 2003"}, {"Title": "One of the nicest cameras I've ever seen", "Author": "Jacque Ngwa", "ReviewID": "RU6V318VX7LTH", "Overall": "5.0", "Content": "I recently purchased this camera for my girlfriend. And goodness!! Its an awesome camera.....!!!This is my second digital camera that I have. People said to start off with an okay digital camera first and then see how that is and then if you want in the future...purchase a better one. Bad advice..if you want a digital camera...start off with a great one. And the S30 is a wonderful start.....many great functions, a really cool toy to have. Battery life is good, options are great, nothing bad to say about the S30. A truly awesome camera..I know its a bit expensive to dish out that much..but its worth it.", "Date": "April 26, 2002"}, {"Title": "Canon S30", "Author": "Linda Calhoun", "ReviewID": "R20GSLDUJ7OO7D", "Overall": "4.0", "Content": "I have had the camera for one week.  It is easy to use, fairly intuitive and takes great pictures. My problem is the horrendous software manual that accompanies the camera.  We have spent more than 8 hours reading and re-reading the manual, installing and uninstalling software but have been unable to get the camera to communicate to my Windows98 Compaq PC.", "Date": "November 22, 2001"}, {"Title": "Great camera, it costs more at half com than anywhere else??", "Author": null, "ReviewID": "R2WKN4JVVB2CK0", "Overall": "4.0", "Content": "I got mine at gateway for $ 419 dollars with free shipping. (coupon) Places like half com and ebay are selling used ones for over $ 500 dollars. Do some research before buying and save a bit of money.", "Date": "March 6, 2002"}, {"Title": "State-of-the-art electronic toy", "Author": "\"pinkytly\"", "ReviewID": "R1BHT0Z3B8ID2W", "Overall": "5.0", "Content": "I own this camera - Canon Powershot S30, for close to 7 months already. I would say I have not much complaints on this camera except it is slight heavy thus I could not carry it around without carryin my backpack as well.S30 Macro shot is sufficient for normal usage (10cm closest), however, I needed more close-up shot. In this manner, I hope to trade in for Canon Ixus 400. But I have no regrets having S30 because it can be used as point-and-shoot and as manual control camera at the same time. I guess I was just getting greedy in wanting my gudget to be in its latest technology and we knew that it is quite impossible unless we buy a new one.I love its paranoma mode. I did a 360 degree shot before and the outcome did not come out as what I have expected due to different lighting but the software knitting the paranoma shots is user-friendly and easy to use. I did other paranoma shots (and not 360 degree or too extreme) and the shots I must say is excellent. I did a paranoma horizontally on a beach scenary.Sometimes,when I press the shoot button to take a picture, the camera did not shoot. I must try the 2nd time before the picture is taken. I also do not know why but I have press hard and deep already, I swear! The battery is still ok, and one lasts me about one and the half hours with LCD on. I bought a spare battery though, just in case.The software is stable since the camera was in the market for 2 years when I bought it. Thus I have no problem on the retracting lens matter. I like the metallic feel of the camera and I just hope that Canon have add-on lens for this series of camera, one day. Think this camera can last with me for the next 5 years or so.No problem with this camera for me.", "Date": "November 27, 2003"}, {"Title": "Great Little Camera", "Author": "A. Baker", "ReviewID": "R3N9G0WVR9UN2L", "Overall": "5.0", "Content": "I've had this camera for less than a week and I couldn't be more pleased. I use big 5MP Sony cameras at school and the little SC30 runs circles around them as far as features and ease of use goes. Be sure to pick up another battery and at least a 128Mb Flash Card. My only compliant is that the camera's size and viewfinder is a little small for my big head!", "Date": "July 10, 2002"}, {"Title": "Canon Powershot S30 is for beginners, too!", "Author": "Kent Haselow", "ReviewID": "R3AZI6YBCHYQWF", "Overall": "5.0", "Content": "I was worried about buying a higher mega-pixel camera than the 1.3 mpixel owned previously; fearing the technology would overwhelm me!  Not so with this model.  The auto photo features are perfect for when I don't have time to figure out the manual dials.  Although I would prefer a less cumbersome way of plugging in to an alternative power source, the basic features of this camera are great.  I just printed a 4x6 photo on photo paper with amazing results!  Well worth the money.  This is a sturdy little camera for beginners and photobugs alike.  I will enjoy figuring this one out.  My family is already sick of me snapping shot after shot.  Nicely done, Canon!", "Date": "May 27, 2002"}, {"Title": "overrated", "Author": null, "ReviewID": "R3NQSZRS20ZLW0", "Overall": "3.0", "Content": "Before I bought this camera from Amazon, I made sure that I read all the raves, pros and cons and trusted the name canon for a great camera.  This camera comes with many features that I probably may not ever need, but its just great having it anyway.  For the price, you'd think they will throw in a carrying case or a 64mb compact flash memory card.  This camera does not take good pictures at night, it over compensates images thus its blur or becomes too 'fake' or 'dark'.  its only great for indoors (the red eye does not work either) and outdoors (during daytime).  its a good camera to have if you are into digital photography, but if its quality pix you are looking for, canon rebel is still the best buy out there.", "Date": "October 5, 2003"}, {"Title": "Good camera, terrible service.", "Author": "JOAN M KIND", "ReviewID": "R1E78EX2ZZLRL0", "Overall": "2.0", "Content": "My camera died after about six months.  I had to send it back three times before they fixed it.  I paid to send it back the first two times, about $15 each time.  When I called the third time and asked to speak to someone beyond the people who answer the phone, I was scolded by the person I was talking to because I balked at calling a toll number.  I was told that Canon could not give toll free numbers to everybody.  I eventually talked to someone who told me to send it in again.  Only, after I balked at paying shipping again did he offer to send me prepaid packaging.  Guess I should have balked the first time.  So far the third \"fix\" has worked for over a year.Very nice little camera.  The service is very poor.", "Date": "September 6, 2003"}, {"Title": "features galore at a reasonable price", "Author": null, "ReviewID": "R2A45UPO6V1O2B", "Overall": "5.0", "Content": "the s30 is well built... very robust on the exterior... and performance has met all of my expectations... i've taken great pictures in auto mode... the manual controls (shutter speed and/or aperture) are great for those photos that the auto mode can't quite get right... flash is great... film iso's of 50,100,200,400,800... night shots are terrific... 3x optical zoom... also got the canon i850 printer to go along with the s30 which produces perfect prints... there are more features that i didn't mention but i am one satisfied customer...", "Date": "December 2, 2002"}, {"Title": "Just received as Christmas present", "Author": "Bj Oconnell \"Quilting Maniac\"", "ReviewID": "R34BLHFHD6I6MS", "Overall": "5.0", "Content": "Although I am still experimenting with this camera, I am enjoying the flexibility of it.  The design also makes it very easy to use.  The manual is organized well with easy to use instructions.  It is a good camera for a beginner or an intermediate photographer.", "Date": "January 15, 2002"}, {"Title": "This is really a great camera to this day", "Author": "Dione A. Watt \"EX25 Designs\"", "ReviewID": "R1CQ1ERYN43IVT", "Overall": "5.0", "Content": "I've owned this camera since 2002.I wanted to purchase a really great camera that was next to professional, as I design websites and have an Interior Designing company and wanted to be able to put up professional pictures of my work on my website.I did an extensive search on the Internet and found that the Powershot S30 was rated in the top 5 cameras at that time for the price range of around $300.00.  This rating was consistent with many top rated sites such as Amazon and CNET.It was not what I was looking for in size and weight as at that time smaller cameras were the rave, but I decided to trade that in for it's features and picture quality.  I went ahead and made my purchase over the net.I have not regretted it.  The camera was just as it boasted.  The pictures were awesome!  I still own this camera to this day and among the sea of 8 mega pixels and all the latest rave, my 3.2 mega pixel pictures sits just perfectly right up there with the rest.On the downside, the camera has a clumsy way of powering up and down, as you have to slide this piece of metal accross the zoom lens.  But this is really nothing to write home about.  Also, the delete image button is a little testy as well, but again, you can get around that.Since my camera is 6 years old now I do have some wear and tear and other problems.  when I power up with that sliding metal, the lens sticks and won't open out and sometimes I have to give it a little shake and a thump for it to open out.  If the lens doesn't open out the camera won't turn on.  And that is all the problem I am having now.  I managed to drop my camera a couple of times and even cause some dents on the body but no internal damages... still works perfectly.I wouldn't bother to buy a new camera until it breathes it's last breath, but now I will have to as I am having problems turning it on.  I think it's trying to tell me to let go and move on.  But I'm moving on to another Canon though, they are tried and true.  Although I must say I own Sony this and Sony that, but the Canon Digital camera to me is much better.So I'm on to researching again... although I do say I still see Canon in the top 5 so far.Dione,Kingston Jamaica", "Date": "September 18, 2008"}, {"Title": "Nice but not so perfect", "Author": "UKJJ", "ReviewID": "R22S2YVPUZ3DGB", "Overall": "3.0", "Content": "My S30 did all it was expected to do as far as imaging resolution and photo quality was concerned.Downside issues with this camera:LCD screen - Poor to zero visibility. OK for auto shooting but useless for creative photography,Auto focus and close-up focus did not work 100% of the time. Continuous focus was hit & miss.Battery life inadequate - 20 mins to 1/2 hr at bestCamera was returned to Canon during Warranty but none of the above issues were resolved.Sold the camera after 18 months of serious useage", "Date": "June 30, 2005"}, {"Title": "Red Eye is a Problem", "Author": "T. David Smith", "ReviewID": "R3DND8BJKSIA4X", "Overall": "2.0", "Content": "This was an OK camera but red-eye was a problem from Day 1.  Also had trouble taking good night pictures.  The 4 Star rating here is WAY too high for this camera.  See the most recent reviews.", "Date": "May 30, 2005"}, {"Title": "Super Camera with Super Options", "Author": "Positive Net Worth", "ReviewID": "R1X86WI85NE57E", "Overall": "5.0", "Content": "I just bought this camera used from another Amazon member and all I can say is Wow! I need it to take pictures for web and print (as a professional photographer and designer), and this camera is packed with all the features I could imagine I need, at a great price. First off, the camera is a good size--small and light and streamlined. Easy to find controls and great display screen. It's easy to use -- I just charged the batteries, popped them in, and started shooting for a client. The user manual is a bit redundant, but with an image of every step of the process, is is handy. I referenced it immediately to be sure I was setting the time/date and image sizes properly.Far away shots of a dim restaurant are crystal clear. Macro shots of product labels are crisp and perfectly lit. No one has red eyes (auto flash setting). Edges are crisp and colors really pop--no washing out or muddy-ing with this.The only problem I've found is that the zoom/focus button is a bit hard to maneuver (right in front of shutter button), but I figure I will get used to it. I bought a 256MB flash card and took large images by the hundreds--I took so many I used the battery pretty quickly (2+ hours), so I would recommend a second battery and a good-sized compact flash card to go with your purchase. I plugged the battery and charger into an outlet, ate a sandwich, and the camera was ready to go again in about 20 minutes. I can't wait to try scenery pics and also some portraits (it has a portrait mode). Also want to try the video capture out.For a used price of [less amount] (new is easily [alot more]), and the price of an extra memory card and battery (bought cheap from online auction), I feel I have everything I could want with a digital camera. And with newer models out, prices should continue falling.After using other people's digitals for the past year (and tons of different brands), I think I picked a gem. I am totally impressed with the digital zoom and glad I opted for a 3 mega-pixel (and savings) instead of wasting big bucks on something more (which I don't need even for print images).Funny thing is, everyone I know spent a fortune on their digital cameras and NEVER use them!! I ask them what kind of camera they have and what features, and they all say, \"I don't know. But I know it was expensive.\" Well, their cameras can gather dust. Mine is going with me everywhere, tucked into my purse.", "Date": "August 3, 2003"}, {"Title": "A great buy!", "Author": null, "ReviewID": "R2AS0O73EHV558", "Overall": "4.0", "Content": "This camera is great for the photography enthusiast.  It has lots of great options and features built-in (e.g. the ability to take short movie clips).However, the \"paddle\" button control is a little annoying.  My fingers are an average size, but it's still hard at times to scroll and use the menu options because of this odd button.  Also, its price is still a little on the high side (I purchased this when it was retailing for about $$$).  However, you do get what you pay for -- this camera is worth every cent.  Otherwise, it's a great camera.  Its size is a definite plus for someone who wants great pictures without the heavy accessories!", "Date": "January 11, 2003"}, {"Title": "Fabulous camera!", "Author": null, "ReviewID": "RPKNVN4MGZAOB", "Overall": "4.0", "Content": "This is one spectacular camera for the novice photographer! When I was looking at digital cameras online, I was stuck between choosing from the S30 or the S330, both from Canon. When I went to a store and physically saw the 2 models, I immediately knew I liked the S30 better.  The solid silver color was much shiner than the S330's duller and darker silver color.  The S30 also felt much more like a camera when holding it.  Overall, I am happy that I chose the S30. It is so easy to use and the zoom can take very detailed pictures. The night time scene is one particular option I would like to point out. I just discovered this, so I'm not sure if this works with other cameras as well.  If you switch to the night scene option and you photograph a pitch dark area, the camera is able to make out all the actual colors of the thing you're photographing instead of producing a dark picture.  This is great for concerts (of course, there's a very big noticable bright flash), but it might be a drawback if you were really aiming to take pictures of the night time.I give it a 4 stars instead of a 5 because of it's problem with battery and my trouble installing the software.  If you plan to use this camera for one whole day, you will most certainly need extra batteries.  I used the camera for maybe about 2 hours straight before the battery totally went dead (and I fully charged the batteries before initial use too).  I also experienced a little trouble installing the TWAIN drivers that are needed if you want to download the pictures from your camera to your computer.  I use Windows 98 and for some odd reason, my the manual's instruction didn't work for me.  I had to figure this out some other way to install the drivers.Other those 2 minor points, this camera is spectacular!", "Date": "May 26, 2002"}, {"Title": "Great photos and User Friendly", "Author": null, "ReviewID": "R3GQIW462IU4U2", "Overall": "5.0", "Content": "I searched, compared, and waited for the technology to be put in a small compact package.  This camera has a lot of excellent automatic and manual features for taking great night and day photos with excellent color.  It also has a 30 second movie option with sound that is a lot of fun.  I like the fact that I can plug right into the television to view photos and movie clips.  The software is also nice.  I would recommend buying an extra battery and much larger compact flash card.", "Date": "December 27, 2001"}, {"Title": "Bought it after months of research......", "Author": "Beth DeRoos \"Beth DeRoos from the California ...", "ReviewID": "RO933H7NZI9RX", "Overall": "5.0", "Content": "After reading everything that Consumer Reports magazine had to say about digital cameras \"A 3-megapixel camera provides some breathing room: files large enough for enlargements, yet not so gargantuan than you'll have difficulty saving, storing, or e-mailing them.\" and looking at the various models that got good ratings as well as mid priced cameras this one is the one I chose.The slide cover was a big draw as well since I take my camera with me when we ski, run, hike, backpack, fly fish, etc and have in the past dropped cameras or at least had them get banged against rocks a lot.  Having a slide cover over the lens rather than worrying about lens cap covers was a big plus. And for a zoom camera it is one of the best.Having a zoom lens was a must as was a camera that felt at ease in my hands. Although I have bought a sturdy neck strap holder so I don't worry about it falling off a cliff or into a river.  I do recommend buying extra card, and will admit the battery could be better, especially if you use the camera a lot.  I bought an extra battery so that I always have a well charged fresh one.The price is excellent too for what you get.", "Date": "August 19, 2002"}, {"Title": "Great camera. Disappointing Mac OS X support.", "Author": "dash-o", "ReviewID": "R1OTAAFR5B0G50", "Overall": "4.0", "Content": "I purchased this camera about six months ago. I wanted a camera that was simple to use, with metal construction, and that took great pictures--and the camera is all that. Sure, nothing is perfect. The goofy rubber cover on the mini-USB port is an anoyance to open, the port is next to the base where the cover is attached to the camera--a real pain, specially since you have to mess with it to download the pictures to the  computer. Another issue is the power adapter. It requires taking the battery out to insert a piece in the shape of the battery. It is not only clumsy, the battery door remains open, and the door is plastic and somewhat flimsy.The serious problem is Mac OS X support. The camera has a \"stitch assist\" feature to help taking panoramic pictures. The actual stitching is done on the computer using PhotoStitch, which automates the task. This software is essential for taking panoramic pictures. The camera software bundle does not include Mac OS X versions of the programs, and although some of the programs are available for download, PhotoStitch is *only* available by purchasing (for $20 more) the new version of the software bundle CD.", "Date": "August 15, 2002"}, {"Title": "No more film", "Author": "Douglas Knuth", "ReviewID": "R1POCZ47164QYM", "Overall": "5.0", "Content": "This is a great camera. It has an array of easy to use features that make set up for various situations very easy.It has a tremendous light range, from bright daylight to dark interiors using default settings.With 3MP images, I'd recommend at least 256MB of flash memory.If you take a lot of pictures a second battery would be worthwhile.  Taking 100 shots in a day was well beyond the limits of a single battery.The biggest problem is the delay between pushing the button and the actual shutter snap.  On moving objects you have to go to the sports mode(with lesser quality) or it will get away.That said, I see no need to ever use a film camera again.", "Date": "June 19, 2002"}, {"Title": "Good Technical Features, Penality for Weight", "Author": null, "ReviewID": "R2OIK50KXVOEEK", "Overall": "3.0", "Content": "I found this camera to be all it was said to be regarding features.  Picture clarity and movie clarity were very good.  However, the camera is very heavy for a camera in this size range.  I can't see it in a case on your belt walking around, and I believe most of us intend to carry our cameras around.  I returned it in search of something lighter.  If you are not concerned about weight, then this camera has everything you need.", "Date": "November 27, 2002"}, {"Title": "WARNING!!  Super Sensitive LCD Screen", "Author": null, "ReviewID": "R1EE0LPTW8Q77F", "Overall": "2.0", "Content": "Less than a month after we purchased this camera the LCD screen cracked and we're still trying to figure out how it happened!  We were religious about keeping it in its case when we weren't using it.  We didn't drop it or do any damage to it otherwise.  The day before we discovered the cracked screen it had been in its case, in a backpack; the only explanation we could come up with was that something in the backpack jostled against the camera and cracked the screen.  Super sensitive?  We think so!  I mean hey, if I had dropped it and heard that splitting sound things would make sense!  Now I'm thinking I should handle this thing with gloves and keep it wrapped in bubble wrap.  Covered under warranty?  Ha ha!  No damage to the LCD screen is covered under the warranty!  So now we've got to shell out an additional $155 so we can use our month old camera.  Unfortunately, this is the second time we've had a problem with Cannon cameras- the first was an APS who wouldn't load film correctly.  I love the feel and style of Cannons, I love the end results, but I don't like it when they don't work!  I'm very, very, very sorry to say that when its time to trade the current one in, the new one won't be a Cannon.  Anyone know any good comparable brands?", "Date": "October 1, 2002"}, {"Title": "Very good for the price these days", "Author": "Anthony", "ReviewID": "R3GXRTOBHTGVMG", "Overall": "3.0", "Content": "I've had my camera for about 5 years now, I think it takes great pictures overall. Redeye is a problem I've noticed like some of the other owners, even if you have redeye reduction turned on it's still a problem. Aside from the redeye problem with flash, it takes incredible daylight photos. Bright, colorful, amazingly clear with alot of nice manual modes and auto mode is also very good. Very durable also, I've dropped my camera many times and it keeps on working.", "Date": "May 23, 2006"}, {"Title": "More than happy", "Author": "S. Belaire", "ReviewID": "R1Y5C8Z4KPZ3L5", "Overall": "4.0", "Content": "I've shot hundred of pictures in the rain, at the beach and have never had any issue other than the sometimes slow first shot issue, mentioned else where.It has been drop off the kitchen counter and lived on with a small dent.I'd gladly buy a newer model if I needed to, but 3.2 megs I have found to be more than good enough for family shots.  In comparing this to my other camera from a computer vendor I'd have to say stick to camera vendors models, they feel and work like cameras, right down to the little mirror/shutter sound that lets other people taking your vacation pictures know that they have in fact taken a picture.I do think the lcd too small at times to determine some options, like the flash mode (red eye).  Perhaps newer SLR digitals will get in viewer features, for when you saving power by not running the lcd display.", "Date": "July 29, 2004"}, {"Title": "Great Quality, Too Complicated for Beginners", "Author": "Diana Tkach \"dianatkach\"", "ReviewID": "RZJ00KUOOPXBS", "Overall": "4.0", "Content": "I bought this camera about a year ago and am still discovering new features. This camera has so many features that I'm sure I'll never learn all of them (I only use the \"auto\" and \"movie\" settings and can't figure out what the rest of them are for). The good news is that it's incredibly easy to use, even for someone as camera un-savvy as me (and this surprises me because I love electronics). The auto focus works wonders. The 3mega pixels are more than enough to deliver clear and crisp photos from a printer. Photo transferring is a breeze with iPhoto (for Macs) and Picasa (it's free for Windows). I also want to point out that it is incredibly durable. This camera lives in my purse (along with an oversized wallet, cell phone, keys, iPod and accessories... The list goes on, but the camera has no scratches and after a year I've had zero problems. No plans to upgrade because all my needs are satisfied with this product... And I've got years of product discovery ahead of me, starting with the functions of the other 11 settings on the formatting wheel.", "Date": "July 24, 2004"}, {"Title": "PowerShot S30 pros & cons after 1.5yrs use", "Author": null, "ReviewID": "R3QL19FASO9MQJ", "Overall": "4.0", "Content": "I've owned a Canon Powershot S30 since may 2002 and am happy with my purchase.Cons:- Joystick used to navigate menu items makes it very difficult to \"click\"/select items especially if in a hurry. Gets worse with age.- Sliding door is on/off switch, means camera is often accidentally switched off when framing shot as fingers press on loose door/off switch. Gets worse with age.- Dust gets on lens easily, under sliding door.- Supplied memory card (16mb) inadequate,  recommend 256mb+.- LCD viewfinder difficult to see in direct sunlight, makes it very difficult to use manual features where small numbers/icons need to be read.- Often a long delay on shutter action, means you miss the framed shot.- Battery life only about 100 shots, seems to get worse with age. Need two batteries.- Bulky & heavy body, compared to many other compact digital cameras.- No protective case supplied with camera.- Software to get images from camera to computer a large-long install, I cant find a way to do it without installing all the software on the CD.- Impressive number settings can be controlled manually but accessing and changing them via menus and buttons is slow compared to an SLR.Pros:- Good quality photos.- Lots of settings can be controlled manually, compared to other compact digital cameras I've used.- Very good software on the camera, especially for navigating and viewing images.- Batteries charge very quickly", "Date": "January 16, 2004"}, {"Title": "Excellent digital camera", "Author": "Mark J. \"mjordon2\"", "ReviewID": "R1DT2U1QFQGZQ1", "Overall": "5.0", "Content": "I have been using this camera for 5 months now and have been very pleased with it. The controls are intuitive and easy to use-my only complaint is that sometimes the master control/cursor button at the top of the camera is difficult to control. Picture quality is excellent and there is good creative control with the exposure compensation and manual focus. The included software works well withmac and windows. The photo altering program that comes with it doesn't have many features, but at least alters exposure and removes  redeye. I wish the camera used AA batteries like my father in laws Sony.-you definitely need an extra battery with this camera.", "Date": "August 6, 2003"}, {"Title": "My first digital camera", "Author": "Nan-Beth", "ReviewID": "R2HD8AURKW6FRA", "Overall": "5.0", "Content": "This was my first digital camera and I haven't stopped taking pictures and printing them on my canon printer.  I cannot say enough about this camera.  It's easy to use and lightweight so I can take it with me wherever I go.", "Date": "July 26, 2003"}, {"Title": "Excellent snaps and breath taking clarity --", "Author": "addagarla", "ReviewID": "R3C1TKV08DA9OD", "Overall": "5.0", "Content": "Ooooooh Boy What a camera, for guys like who don't want more proffesional photography point of view this is an excellent choice. I developed my photos in Costco which is just 2.00 for an 8/12 SIZE photo, its clarity and pixels are breath taking man. Actually I got this camera in a gold box price at 340/- but that is an ultimate deal. If you get it for 350/- also its good. Any how I am enjoying with this camera which has all options except external built in flash light mode which is not a big thing but for night shots its a must for long view shots.", "Date": "April 6, 2003"}, {"Title": "Not quite what I expected", "Author": "Morgan Brown", "ReviewID": "R17LC9OKC7UUH7", "Overall": "3.0", "Content": "...  I'll summarize a few points:1) I saw a couple other \"cracked LCD screen\" comments.  This is NOT BS, people.  Ours cracked after just a month or so of use, and under very questionable circumstances.  It may have been the sun.  It may have been a bump.  We don't know.  But it did cost $150 to get it repaired by Canon.  Not cool!2) Shutter speed: out of the box, you WILL be disappointed with the slow shutter speed (blurry pictures).  The default equivalent film sensitivity is \"in the range of ISO 50 to ISO 100\".  Very slow film for most apps.3) Movies: Don't pay $100 extra for the movie capability.  The movies are disappointing in quality (~200x300 pixels) and length (max 30 seconds)These cons aside, the camera often does perform swimmingly.", "Date": "March 18, 2003"}, {"Title": "S30", "Author": null, "ReviewID": "RYF74I0ICTTVY", "Overall": "4.0", "Content": "I love the S30. I bought this camera specifically for underwater use (with the Canon underwater housing of course!). It is pretty easy to use and has quite a few features for the price. You probably won't need a higher pixel camera than this unless you want poster size prints. Add a 1GB IBM Microdrive, a spare battery, and you are set.", "Date": "February 21, 2003"}, {"Title": "great point and shoot camera.  And its TINY!", "Author": "Marc Swanson", "ReviewID": "RE0VM4JVWNMUF", "Overall": "5.0", "Content": "I used to own a fairly bulky epson photoPC 750z and I wanted a camera that could more easily fit in a pocket (what good is a camera that you never want to carry around with you?).  To be honest, the color on the 750z (which is only a 2MP camera vs. 3 for the s230) was better than on this camera, but I'm willing to sacrifice some quality for the seriously tiny form factor of this camera.  I was also pleasantly surprised at the ability to be able to shoot video with this camera.  I was in NY for new years and took some video at the stroke of midnight....", "Date": "January 15, 2003"}, {"Title": "An Outstanding Camera", "Author": "D & D", "ReviewID": "R3U27FER3MPR99", "Overall": "5.0", "Content": "This is our first digital camera. I wanted one that was easy to use, could take  photos as good as a 35mm camera and allow you to be creative. The S30 is very easy to use.I bought this camera to take with us on a ten day cruise.So far we have taken over 250 photos and printed the ones we wanted, down loaded some into our computer and reused the card for more photos.The photo's were as good as my 35 mm Canon SLR. Everyone that we showed the photo's and the S30 to, were all impressed. Three of them are going to buy this camera.I do recommend you buy a 128mb or larger flash card and an extra battery. For me the battery lasted all day and at night I just charged it up.We are very satisfied and highly recommend the Canon S30.", "Date": "January 10, 2003"}, {"Title": "great camera", "Author": "J. Kaye \"Jimmee\"", "ReviewID": "R2WOFKVCXSDMW8", "Overall": "5.0", "Content": "I had an s10 for 6 months but it didn't do too well indoors with colors and blurred if the subject was moving. The s30 can handle so many more situations and does it all so much better. I've used the movie feature way more then I thought I would. I've been real happy with it so far.", "Date": "June 3, 2002"}, {"Title": "Fantastic", "Author": "Noah D. Karchmer \"hawknoah\"", "ReviewID": "R1XPFGOOM7NCPW", "Overall": "5.0", "Content": "My wife and I got this as a Christmas present from relatives so we could email lots of pictures of our newborn baby to family.  I was planning on buying a digital camera for that reason (and others), but I planned to search for a rock bottom price on a entry level camera, being fairly new to digital photography.  Once I saw this one though, I was absolutely blown away.It's very small, like a small 35mm camera, and it's light as a feather, yet it's constructed very solid with a very cool metal exterior.  The resolution is so good that we are not only emailing the pics and saving them on our computer (which pretty much any digital camera can do), but we're ordering high resolution prints of the JPG's that are better than any pics I took with my 35mm camera.  It's nothing but digital for me from now on!  This way I take as many pics as I possibly can and don't worry about wasting film or running out.  I'm having a blast editing the pics too, it makes me feel like a real photography expert.  I know I've barely scratched the surface of what this camera can do-- I haven't taken movies but I have a digital camcorder so I don't need that feature (although it's nice to have and I'm sure to experiment someday).  Although I couldn't afford to shell out the big bucks to buy a camera this nice for myself, we're so happy to have it.", "Date": "May 26, 2002"}, {"Title": "Very nice camera", "Author": "Robert W. Kane", "ReviewID": "R2LIX84VL6VK3R", "Overall": "5.0", "Content": "This is my first digital camera and I am very impressed.  Definately read the manual first, but after that everything is pretty straightforward. The software installed well on my Windows 98SE machine.", "Date": "March 27, 2002"}, {"Title": "Watch that sliding door!", "Author": "Maddi Hausmann Sojourner \"madhaus\"", "ReviewID": "R1HQPZTVS963XT", "Overall": "3.0", "Content": "I have owned the S30, S40, and S50 and have done everything one can do with these cameras.  Here is my take on the good and bad on the Canon PowerShot S30.This was a terrific small digital camera when it was introduced, but the digital camera market advances quickly and this model has been surpassed by Canon's own S45 (which is an updated S40) and the new S50 (5 megapixel in the same body only in high-tech black). Serious photographers seekng a digital should turn to Canon's EOS Digital Rebel. The S30 and S40 are good cameras if you want lots of features in a small package without paying a lot of money.  The two models are identical except for this: the S30 is 3 megapixel and allows ISO-equivalence of 800, allowing for low-light indoor photography.  The S40 is a 4 megapixel model using a denser CCD, and its maximum ISO is 400.  You can make the pictures smaller than the maximum size to conserve space on the removable CompactFlash cards.  Several modes are available to you such as Sports (high shutter-speed and high resolution shots), Portrait, Night, etc. You can put it in complete Idiot Mode (okay, Automatic mode) and let it select your shutter speed and aperture, or you can pick one or the other and let the camera pick the missing one, or you can go full into Manual mode and pick both. There's even a Movie mode, complete with sound, which creates video clips of 320 x 200 pixels.This small camera fits in a purse or shirt pocket easily and won't get in the way if you're shouldering it in a case (not included, just buy a generic). But you pay a price for the small size: the optical zoom is limited to 3x. And unfortuately, the S30, like all the PowerShot S family, starts out with a focal length of 11mm, which is a very wide-angle view. Even at 3X optical zoom you will max out at 55mm, often not as close as you'd need. There is a digital zoom, but so what? Crop your picture in software later rather than play with that silly feature.  I found 55mm insufficient for shooting across a large room.  If you work closer in this won't be a problem, but it is not a good focal length for shooting children, who stop whatever adorable thing they're doing when they notice you framing that shot.  (And see comment on slow shutter response, below.)The sliding door that covers the lens (and turns on the camera) seems flimsy and can cause problems.  My 3YO niece got ahold of my S40 (remember, this is the exact same body as the S30) and ripped the door off. I was able to reattach it but now it's a loose tooth, ready to fall off again. Even under warranty, my choice was to send it back to Canon for 12 weeks or live with it. I couldn't live without the camera, so I kept it, loose sliding door and all. I've just learned not to lend it to people who can't baby it; a good push and that door is off the camera again.One of the S30's most frustrating limitations is a slow shutter response.  I can't tell you how many shots I've missed using it; I frame it lovingly, I see the perfect moment, I shoot... but no score. The people have moved on, the sun has set, the universe suffers heat-death, and finally the shutter clicks.  If you want a fast shutter then you must have a digital SLR, as almost all the compact-style digital cameras such as this one have the delayed shutter issue. Another note of annoyance on the PowerShot S family: they come with a wrist strap but no shoulder strap.  I don't know what use a wrist strip is for a camera; if I'm not using it then I want my hands free.  I bought a generic shoulder strap but it wasn't a great fit.  At least Canon should offer one as an extra-cost accessory.I give this camera 3 stars; 4 for putting so many features in such a small package, but the loss of one because you can buy the S40 for about the same price and the gain of a megapixel more than makes up for losing ISO 800 (which produces very noisy photos, anyway).  The PowerShot S30 comes with software, but you'll probably want to buy your own image editing package, such as Photoshop Elements.  The package provided is fairly limited. Useful software includes PhotoStitch, which allows you to make your own panaramic style images from a series of linked shots. The included 32 MB CompactFlash card is also too small for typical use, so plan on buying a bigger card. Also plan on buying a second battery.", "Date": "December 28, 2003"}, {"Title": "Just what I was looking for", "Author": "Sean Murphy", "ReviewID": "R2QS9ZI70PCC25", "Overall": "5.0", "Content": "I have two digital cameras now, and have researched this area extensively.  This camera has some great options: Compact Flash memory cards, great zoom power, movie mode, overrides on everything, a panoramic stich mode, it feels high quality (some of the cameras I checked out locally felt cheap).  This camera is so packed with features, it also takes excellent automatic photos too.  We're very happy with our purchase!", "Date": "November 5, 2002"}, {"Title": "E18 error", "Author": "Thomas D. Orth \"curious\"", "ReviewID": "R2LDUHNUTC2OQ6", "Overall": "1.0", "Content": "This was my first introduction to digital photography.  Wouldn't you know, just out of the warranty period, the camera stops working.  I test the battery just before my daughter's soccer game, then hop in the car.  Get to the game and....the thing won't work.  The lens will not come out.  I now own a piece of junk.  I think the retractable lens adds needless complexity to the camera.  I will look for something simpler mechanically in the future.  Maybe it's back to film cameras for me.  I'm tired of 60 dollar ink cartridges anyway.", "Date": "October 28, 2004"}, {"Title": "Canon S30 with HP 7550 Photosmart", "Author": null, "ReviewID": "R1I5JWOKPI1S44", "Overall": "5.0", "Content": "With the compact flash, I can immediately print the pictures by inserting into the Photosmart printer.  While the compact flash is in the printer, I can view the pictures on my computer, send them in email form or transfer them to be edited.  Movies with sound can be made with the camera and viewed directly on the computer by inseting the flash card into the printer.  There is no need for cables or other hookups.  Length of the movie will depend on size of the flash card.", "Date": "October 28, 2002"}, {"Title": "Great Camera", "Author": "Curtis B. Cooper Jr.", "ReviewID": "R1JQRJ6LLNKC1Q", "Overall": "5.0", "Content": "I bought this camera about 4 weeks ago and I love it. Exelent pictures, easy to operate, loads of features, and seems to be well built. It has a good weight and feels good in your hands (small fingers help but not necessary). The only complaint I have is the price dropped after I bought it (thats life). This is a very good camera you can't go wrong.", "Date": "March 25, 2002"}, {"Title": "One of my best purchases in ever.", "Author": "jones.mobile", "ReviewID": "RNQDIEEBQ0905", "Overall": "5.0", "Content": "This camera has been in my arsenal for over a decade.  It has been from Alaska to Maine to St. Lucia & to Rome. It has had prints from 4x3 to 11x18 printed out with great results.  As I look towards a replacement, I am reminded of how much I love this little bada$$ camera.  It is built like a little brick and is tough as steel.  Now that one of the buttons on it's frame is finally wearing off, I am becoming a bit sentimental.I will probably be buying a G16 soon.... or the new SX600...... But this little guy will always be one of the best purchases I have made in this century.  I love you Powershot S30...... And I will pay my respects to you as I put it in storage.RIP my friend.", "Date": "January 26, 2014"}, {"Title": "new canons are better than this one", "Author": "Ketan Patel \"student\"", "ReviewID": "RJOQZUVVX2FGG", "Overall": "2.0", "Content": "zoom is nice and canon quality is there but too big, bulky, and old...like a dinosaur and unnecessary w/ most modern cellphone cameras", "Date": "December 9, 2013"}, {"Title": "The canon Powershot digital camera works well.", "Author": "celinda", "ReviewID": "R38OARADQHQPIO", "Overall": "4.0", "Content": "The cannon powershot digital camera came early and was exactly as advertised.  I am impressed with its clarity. My granddaughter loves it.", "Date": "December 21, 2012"}, {"Title": "Canon PowerShot S30", "Author": "Cristian L. Nitulescu", "ReviewID": "R2177XDPA94B98", "Overall": "5.0", "Content": "The camera was delivered on time. It wasn't a new item, and the description matched the real product.", "Date": "July 15, 2009"}, {"Title": "Canon Power Shot S30", "Author": "C. Frericks", "ReviewID": "R10WCR8VVUKA0H", "Overall": "5.0", "Content": "Love this camera. easy to use and takes wonderful pictures. Was very upset that I could not still buy it in a store. Found it on Amazon.com. We have the underwater case for it also. Takes great pictures of the Coral Reefs in Cozumel Mexico. I would recommend it to everyone. This is our second Power Shot S30 and would buy another if something happens to this one. This one is going to be for special occasions only.", "Date": "January 30, 2009"}, {"Title": "Great!! perfect", "Author": "Sandeepa Mohal", "ReviewID": "R3KIVDE3MMNGEI", "Overall": "5.0", "Content": "I have been using it for 5 years now. never had any problem... Night results are not very very good though, you just need to keep camera still if you want to get them perfect.", "Date": "May 8, 2006"}, {"Title": "Excellent Camera", "Author": "Prabir Das \"PD\"", "ReviewID": "R10RLBRYWB8P44", "Overall": "5.0", "Content": "I have owned this camera for over a year now and taken probably 3000+ pics. I have learnt a lot in this one year about digital cameras in general and this camera in particular. The picture quality is simply superb in most conditions. The one problem of dull pics indoors that the previous reviewer mentioned is definitely something I noticed too. One thing worth trying is to not use the flash and instead use more light indoors if possible. The problem occurs because the flash range is small and it will illuminate only nearby objects. All in all, a fantastic product. I would buy it again if I had to.", "Date": "February 20, 2004"}, {"Title": "Zoom in!", "Author": "J. Frank", "ReviewID": "R3CTL43GVIEGF3", "Overall": "5.0", "Content": "I've had my Canon s30 for a year and a half now, and it's still at the top of its game.  Brushed aluminum.  Weighty, but not bulky.  Crystal-clear screen.  Potentially ridiculously intricate functionality, but simple enough for anyone to use.  And yes, the video function is incredibly handy to have around.The cons cited in other reviews hold, of course: the joystick is difficult to use, you'll want to buy a separate 256 MB card, the battery drains fairly quickly, that sort of thing.  Except for these aspects of its anatomy, it really is a brilliant camera.But here's one pro I haven't seen anyone mention yet: you can zoom in--really CLOSE!--on a picture you've taken, and then scroll around in it.  This is an incredible function, catering to those social settings where everyone gathers around you and demands to see themselves in that last picture you took.  Really handy (and sometimes VERY entertaining).", "Date": "January 8, 2004"}, {"Title": "Canon powershot S30. Great camera!", "Author": "LALAJI \"sachdr2\"", "ReviewID": "R1HT10N2LHYECY", "Overall": "5.0", "Content": "I recently upgraded from a 1MP Kodak camera to the S30 and I couldn't be happier.  Its a good size, takes great pictures, and has a bunch of features. Pros:Excellent picture quality, Functionally diverse, Compact metal case, Retracting lens with built-in lens-cover, light weight and rather small, photo-stitch, Lithium Ion battery, Uncompressed formatConsIncluded media card is small.The Bottom LineIts a great camera for camera enthusiasts or even jsut a point and shoot camera.", "Date": "November 25, 2003"}, {"Title": "the love of my life!", "Author": "Jennifer Chong", "ReviewID": "R3DD40UK34BUOK", "Overall": "5.0", "Content": "I ABSOLUTELY love love love love love my camera I used to own the Nikon swivel cool pix and I have to say that although the s30 is a little bit heavier and larger its way better!", "Date": "July 16, 2003"}, {"Title": "Excellent product", "Author": null, "ReviewID": "R28AL1NTCWUO4Z", "Overall": "5.0", "Content": "I love this camera. It is very tolerant of less than ideal circustances. It takes superb pictures even when the kids move around.", "Date": "June 19, 2003"}, {"Title": "Lens attracts dust INSIDE.", "Author": "\"baccusboy\"", "ReviewID": "R52IQB3X2U8GP", "Overall": "3.0", "Content": "I am very happy with the picture quality, but am sad because it is not as portable as I had hoped.  Actually, it flunked this area.  I was keeping the camera in my coat pocket, and within a few weeks, after taking some night pictures near a fire, I noticed all kinds of dust inside the lens was putting little white blurry dots all over my photos.  They don't show up on the day photos, but they are almost like a cloud on the night pictures.  It's really awful, and I'm really disappointed in this.  Upon further inspection of the lense, it is obvious that the sliding door does not fully cover the lens in an air-tight way.  And the door is sort of flimsy.  Stuff can get inside the edges quite easily.  Also, the lens itself is not a sealed thing.  If you look closely at it, you can see that the lens glass in the front has a very small gap all the way around it. The lens must now be cleaned professionally.  This camera is great, but you must keep it in a case, and I'd also advise you keep it in the \"bubble wrap\" within that case.  So much for \"portability\".", "Date": "March 21, 2003"}, {"Title": "Why did it take me so long?!", "Author": "P. Breckenridge \"Zippersabrat\"", "ReviewID": "R3AFNXWBNQSQKM", "Overall": "5.0", "Content": "I love photography and I'm a computer geek! Why did it take me so long to get a digital camera?  I've had this model for 4 days and love it!  I got an extra battery and a 256 MB memory card at the same time. It only comes with a 16 MB card which I got 18 shots on, one of which was a 10sec video.  Not bad but the battery lasted about 10 shots longer.  The battery charges really fast, 20 min or so. So with two batteries this is a good camera for day trips.  My next major purchase will be a car charger.I also like that you can hook it up to the video in jack on your tv and view you pictures and videos there. You can also set up shots on the tv.I highly recommend this camera to anybody with a resonable amount of geekyness. :o)", "Date": "March 8, 2003"}, {"Title": "Simple to use...high quality pictures", "Author": "Jonathan Ciccone", "ReviewID": "R3F289ARI7TYIM", "Overall": "5.0", "Content": "Searched and searched for a relatively inexpensive high quality digital camera. This one definitely fits the bill. Quick setup, easy to use software, and great quality make this a fantastic buy. Make sure you buy a smart card reader though to help save battery life when downloading pictures.", "Date": "March 6, 2003"}, {"Title": "Great Camera", "Author": "Dan", "ReviewID": "R13TAN1MTJ78FQ", "Overall": "5.0", "Content": "I love this camera. I originally received a HP Photosmart 320 as a gift, but it was too basic a camera and had poor image quality especially if the digital zoom was used (there was no Optical zoom). The person who gave it to me suggested I return it if better quality was something I wanted. So I did some research and came to two possible cameras to trade in for, both made by Canon, the HP reviews just were good enough. I originally went in search for the A40 but being after Xmas it was sold out, so I browsed at the S30 and was convinced to spend the extra money on it, I knew the reviews were awesome for this camera so, So I made the decision and have not regretted since.The S30 takes high quality pictures, no comparison to the HP.Setting up the software was originally a problem, I was using Windows 98 and there was simply no response when the camera was connected. I had the intention of upgrading to windows 2000, which I did within 2 days of my purchase and my problem was gone and I am now able to upload my pictures. Wow they look great.Now, being a Canadian we have cold weather and snow so taking the camera outside is risky, especially when it is snowing, I needed something to protect the camera form the elements. I was able to find the camera underwater casing but it cost was just too much, costing half as much as the camera itself. I do intend to use the camera in and around water, but going any deeper than 10 feet is overkill for me. So the camera case currently is not an option, especially since I am a student with a limited budget. I looked online and came across a British made waterproof pouch called Aquapac which claimed to be 100% waterproof and was rigorously tested. I ordered it and it cost me only about $40.  Now I just have to get some extra memory and a spare battery.If you meet somebody with the Canon S30, they will only have good things to say about this camera and.....Remember to say \"CHEESE!\"", "Date": "January 15, 2003"}, {"Title": "AWESOME CAMERA!", "Author": "Tia R. Trice", "ReviewID": "RJKM4LX73SZWK", "Overall": "5.0", "Content": "I bought this camera in April 2002 (right before I had my first baby).  As of this month Dec 02, I have taken almost 3,000 pictures.  I LOVE IT!!!!!!!  It's small yet durable.  I am a picture fanatic.  I take a camera with me everywhere I go.  Now, I've become so dependant on this digital one, I don't even take another camera with me.  The pictures turn out excellent and it is very quick and easy to download.  The only problem I have had is keeping the battery charged.  I bought an additional battery and think that it is definitely necessary (if you take lots of pictures).  I even take my pictures in a medium resolution and they still turn out excellent.  I usually fit over 200 photos on a 128 MB card.  Well worth the money!", "Date": "December 16, 2002"}, {"Title": "Suggestions for accessories", "Author": "Thomas W. Clement", "ReviewID": "R12C92PLUCHRVP", "Overall": "5.0", "Content": "I bought this for a trip to Australia.  It's beautiful, easy to use and produces high quality pictures.  You will probably need a number of accessories, so you should consider their cost when making this purchase.  (Same is true for other digital cameras.) My accessory suggestions:1.  You need more memory.  I bought a 256MB flash memory card which was enough to store about 150 pictures.2.  You might consider getting a second battery if you're going to be using the camera much between charges.3.  You will need to buy a camera case.  I bought it locally so I could find one that held my accessories comfortably and compactly.4.  I also bought an underwater housing for the camera.  I took 50 or so photo's while scuba diving on the GBR.  Worked perfectly.  If I had known, I would have rented a slave flash unit for even better underwater shots.", "Date": "November 13, 2002"}, {"Title": "Great canera!maybe more than enough for some...", "Author": null, "ReviewID": "R12P08RLJWIHHV", "Overall": "5.0", "Content": "Using the camera in the Auto mode takes nice pictures(basically point and shoot) very nice for the begginers. The maual mode is where you will get it's best. However, Use of the manual mode will take little more understanding in basic operation of camera. What is minimum or basic?Personally--->EX: you should atleast know what the shuttle speed and amperature is. if not, you still can study...but if not planning on professional use, consider somthing cheaper. I bought this and love it. I am not a pro photographer but have basic experience plus  I love challenge/learning. so far the only complaint is the Multi controller which is hard to select. the battery was ok for me. I dont think ill get  an extra. go to local electronics store and try it out.Conclusion:have the money, like new challenge, great pictures... buy it. I dont have bit of regret, but thats me.", "Date": "October 29, 2002"}, {"Title": "First digital camera", "Author": "Gard Karlsen \"Gard\"", "ReviewID": "R1277IFQ3B3Y9M", "Overall": "4.0", "Content": "This is my very first digital camera and I just got it about a month ago. I'm not really an expert on cameras but here are my views when it comes to the camera so far:The camera is nice and compact but it is quite heavy so it is not that easy to carry it aroundin your pocket.I have heard people complaining about the battery capacity. So far it has not been a problem for me but why didn't canon include som battery indicator?It is nice to have a lens cover but it seems a bit fragile at times.The multicontrol button/joystick is not always easy to operate.Apart from this I'm having a great time with the camera and the quality of the pictures are great.", "Date": "July 14, 2002"}, {"Title": "Oversea Travel Friendly", "Author": null, "ReviewID": "R166W44UG0KW63", "Overall": "5.0", "Content": "First of all, this camera really works great, as repeated stated by other reviewers. Just want to point out a few extra good things:1. This camera's menu is highly customizable. You can embed your own picture and voice into the menu system. Most important to me, I can choose from most of the major languages in the world. If you are sending this to friends overseas, this would really help!2. This camera can take video in both PAL and NTSC format, and the battery charger is both 110V and 220V compatible. These are also extremely important if you want to give it to friends in other contries, or simply bring it with you on your trip around the world.3. The 'Macro' function of the S30 works perfect! I took many close-up pictures of flowers, and was really surprised by the professional quality of the photos!Overall, a great, 'oversea travel' friendly camera, and no, you don't need to spend extra money for the S40 simply to increase your downloading time.", "Date": "June 19, 2002"}, {"Title": "Excellent choice!", "Author": "Swati Agrawal", "ReviewID": "RTW2NSMMV0JJU", "Overall": "5.0", "Content": "\"Excellent choice!\"After lots of shopping around, we finally decided on the S30.. boy! was it a good decision! This camera's got it all.. we bought ours at eCost.com (good online experience at a great price!).. it comes with a 16Mb CF card which is nice, but if you can afford it, get an additional 32 or 64Mb CF card. The 30-sec (max) video clips are also sweet! The resolution is really decent and images quality is fantastic. For the money, this is a great deal!", "Date": "April 26, 2002"}, {"Title": "Awesome", "Author": "\"lstraus\"", "ReviewID": "R14KCLHSJ84CTR", "Overall": "5.0", "Content": "After a month of research I decided on the S30.  I couldn't be happier.  I would have sought after the S20 if the blue tint wasn't such a well-documented showstopper (the pictures are some of the sharpest I've seen in this class. The S30 is a bit larger than the elphs, but the sturdiness works.  The lens cover is a great feature, the LCD is good, the download time is fast, the boot up-to-shoot time is fast.  And the pictures are gorgeous - not an artifact in view.  This is a great camera, I highly recommend its consideration.", "Date": "December 5, 2001"}, {"Title": "Great Camera", "Author": null, "ReviewID": "R3V7QIZCPMBQIS", "Overall": "5.0", "Content": "I have owned the S30 for three months and find it easy to use, very good picture quality, sturdy feel, good battery life. Invest in the 128 meg card...you will take lots of pictures.", "Date": "April 1, 2002"}, {"Title": "GREAT UNTIL IT DIED", "Author": "William Calderwood \"Simplicissimus\"", "ReviewID": "RSC10D7M4INSA", "Overall": "1.0", "Content": "For the first 15 months of ownership, I was sure I made the right choice for my first digital camera . Many great pictures, especially available-light stuff, lots of flexibility, rock solid (OK, hefty) feel. Then one day I turned it on to review pictures taken at a wedding the weekend before and nothing happened. No error message, no reaction to replacement with a fresh-charged battery, stone dead. I returned it to Canon Service even though it was a few months off-warranty. They repaired it and returned it very quickly, about two weeks turnaround. I would have called it perfect service except there was no explanation as to what the problem was, what they did to remedy it, and the fact that my MINT S30 was returned with two almost identical, obvious new scratches on top and bottom (clamshell vise?) Now I feel like it is a ticking time bomb that could die again at any time and have migrated back to film and my more dependable 1970s-vintage Rollei 35S.", "Date": "December 14, 2004"}, {"Title": "Great Camera w/ Dead Pixels!!!", "Author": "Jack", "ReviewID": "R1JHW1E1C3O3AO", "Overall": "1.0", "Content": "Well this has been an excellent digital camera.  I have taken lots of baby photoes with it and the quality is great EXCEPT for one or more dead pixels!I have sent it in for a warrantly repair.  But it hasn't been repaired properly.  Now the dead pixel is at a different location.To see if your camera is affected, view the downloaded image at 100% on your PC.  Scan the image closely and look for a \"bright\" pixel.It would have been a 5 stars if not for the HORRIBLE quality control of the CCD.", "Date": "October 30, 2002"}, {"Title": "Very fragile, last only 1 month", "Author": null, "ReviewID": "R2FBBJOARQAA0B", "Overall": "1.0", "Content": "It is just too sensitive of water.Even a few raindrops killed my 1-month new S30. I sent it to repair, but Canon asks me to pay more than the price I bought it......", "Date": "January 30, 2003"}, {"Title": "Great camera - Great pictures", "Author": null, "ReviewID": "R2VP7KFESZ7XV8", "Overall": "5.0", "Content": "I bought this camera about a 1 year ago and it is great. There may be too many features for the general picture taker, but all in all I would receommend it.", "Date": "June 4, 2003"}, {"Title": "Poor Choice", "Author": "BobinTX \"bobbo1107\"", "ReviewID": "R4D9UF2S5XUV1", "Overall": "1.0", "Content": "I have had this camera from about 18 months. It has a horrible redeye problem even with the redeye flash turned on.  Now it has stopped working altogether.  It has developed the dreaded E18 error which means the lens will not come out when you open the camera.  This has happened to a huge amount of these cameras; just search the web for the S30 and E18 code and you will see.  Buy a different camera.", "Date": "October 3, 2004"}, {"Title": "Full Featured Point and Shoot", "Author": "Ben Quinata", "ReviewID": "R26OWU7XAYP9JG", "Overall": "5.0", "Content": "If you used any line of Canon EOS SLRs you will be very comfortable with this little guy.  There isn't much the S30 can't do.I bought the S30 with some consideration for others, like Sony(Overpriced), Fuji, Kodak(minimal features) or Nikon.The only down side is it is a bit cumbersome in large hands.", "Date": "August 23, 2002"}, {"Title": "Great compact camera", "Author": "Luca", "ReviewID": "R1A5F0QE2Y0ZU8", "Overall": "5.0", "Content": "Great camera with complete manual mode.It's always with me, even if it's not as compact as other canon models (e.g. digital elph s300 or s100).Perfect balance between advanced features and price and sizeNice deal!CiaoLuca", "Date": "March 19, 2002"}, {"Title": "Prone to failure after the warrentee expires.", "Author": "Mark J. Urbin", "ReviewID": "R3CKQ1QFUSYTRC", "Overall": "2.0", "Content": "I agree with the reviews by Simplicissimus & \"curious\", it was a great camera until it died.  Mine had a critical failure just over one month past the warrentee running out.  I paid $150 to have it \"repaired.\" What I got back was a refurb with a different serial number.  That lasted less than a year and half before it died.  Given the price when I bought it, this camera has already cost me close to $800.  The repair price that Canon charges will buy a new camera of the same functionality, with full warrentee.  They offer an \"upgrade\" to a newer model, for $220, but that is a refurb with only a six month warrentee.  I would prefer that Canon built a quality product that would last at least two years. I would settle for them at least standing behind their products when they die under normal use.", "Date": "March 26, 2005"}, {"Title": "Very Nice", "Author": "\"scorpion99\"", "ReviewID": "R3DUDUXISABET3", "Overall": "4.0", "Content": "The cammera is very nice. The bed things about it thou are that its pretty big and the \"joystick\" is very hard to operate. Its to samll to use it. But overall the quality of pictures is VERY GOOD. I would recommend this cammera to anyone.", "Date": "September 24, 2003"}, {"Title": "Lens attracts dust INSIDE.", "Author": "\"baccusboy\"", "ReviewID": "R2672YM8WGQK32", "Overall": "3.0", "Content": "I am very happy with the picture quality, but am sad because it is not as portable as I had hoped.  Actually, it flunked this area.  I was keeping the camera in my coat pocket, and within a few weeks, after taking some night pictures near a fire, I noticed all kinds of dust inside the lens was putting little white blurry dots all over my photos.  They don't show up on the day photos, but they are almost like a cloud on the night pictures.  It's really awful, and I'm really disappointed in this.  Upon further inspection of the lense, it is obvious that the sliding door does not fully cover the lens in an air-tight way.  And the door is sort of flimsy.  Stuff can get inside the edges quite easily.  Also, the lens itself is not a sealed thing.  If you look closely at it, you can see that the lens glass in the front has a very small gap all the way around it. The lens must now be cleaned professionally.  This camera is great, but you must keep it in a case, and I'd also advise you keep it in the \"bubble wrap\" within that case.  So much for \"portability\".", "Date": "March 21, 2003"}, {"Title": "Give Me A Break", "Author": "Thomas M. Berning", "ReviewID": "R2P7EEI87NOHL5", "Overall": "2.0", "Content": "I have had this camera for over a year now.  The camera is great until now.  I simply plugged the camera into the USB port in order to download my pictures and all the sudden my LCD DISPLAY turned White.  I have tried troubleshooting and nothing is expalined about this mess.  I talked to Canon and the only option they left me was to ship it in and get it repaired...for $200.00  What a joke!", "Date": "January 27, 2004"}, {"Title": "Review of Canon PowerShot s30", "Author": null, "ReviewID": "R30RN7WKSXALRL", "Overall": "1.0", "Content": "The Canon S30 is overrated. I find that the shutter speed is really inadequate and I have missed some terrific moments because the performance isn't up to snuff. In general, I find the whole lens operation slow. I find that the slider button--for zoom/slideshow operation is actually quite difficult to use. And I have small fingers, to boot. I bought the camera in 2002 and the LCD is pretty scratched up, even though I keep it in a cushioned bag all the time. I have never dropped it or anything like that. Really not good for wear and tear. I am very disappointed with this camera, having heard such great things about it before I bought.", "Date": "February 28, 2003"}, {"Title": "Great Camera!", "Author": "Josh Tournas", "ReviewID": "RCFCRG4FIA93Z", "Overall": "5.0", "Content": "Easy to use, lots of features, excellent price.", "Date": "August 2, 2002"}, {"Title": "Junk!", "Author": "David \"Zeibens\"", "ReviewID": "RQPVZFJ8PUYJT", "Overall": "1.0", "Content": "This Camera, the Canon S30 is a piece of junk. Owned it for two years and it has stopped working.It shows a fully charged battery as low and you can get two pictures before it stops working and tells you to get a new battery.Even at its best it was a terrible camera. Save your money and buy something else.", "Date": "October 18, 2007"}, {"Title": "A Canon is still A Canon !", "Author": "Andy Haryanto", "ReviewID": "R1DPD05A7P2PX8", "Overall": "5.0", "Content": "You know the performance.You know the features.You know the product.And You know the name.It's a Canon Powershot.Absolutely still the best camera.", "Date": "January 31, 2003"}, {"Title": "Good in some areas, fails in others", "Author": "Alfredo D. De Jesus Jr. \"Freddie DJ\"", "ReviewID": "RX288PO4DJ9VX", "Overall": "2.0", "Content": "I bought this digital camera based on the reviews that I found in the Internet.  The picture I took with it looked good, portrait, landscape.  I started shooting for pictures I need to put on my website, ie, up-close, 18inches.  I was so disappointed because I was not able to get a clear and true picture.  The white background came out golden brown and the item I was trying to get a picture off was fuzzy and did not show the true color.  I tried all the settings (including Macro) available but still cannot get a true picture.  I suggest to all the people who bought this camera to try and take a picture of a nice piece of necklace with a white background. I am curious how this would come out.  Please let me know. For me, I am returning this camera and getting an Olympus Camedia C-4000.  I think Olympus has better digital technology than Canon.", "Date": "August 23, 2002"}, {"Title": "I can't wait to own this product", "Author": null, "ReviewID": "R3VWHUDWCLKM9V", "Overall": "5.0", "Content": "Okay, so I don't technically *own* this product (YET!), but I've been doing a lot of research and decided this is the camera for me. I went to BestBuy to take a look at it in person and I was very impressed. It definitely wasn't the fanciest looking camera on the shelf (it looked like a regular point and shoot camera), but a salesman showed me sample images taken from different cameras and the s30 seemed to produce the best pictures in it's class. Upon returning home, I quickly logged on to Amazon.com to purchase this camera. Regarding my purchasing experience, I must admit I had some problems, but the customer service was very good and quick to resolve my complaints. Another word of advice, If you use the \"Super Saver Shipping\" option, it will take quite some time to receive the product.  I ordered this camera on February 17, and I am not expected to receive it until February 28-March 1. Anyway, thank you for all the reviews, as this site helped me tremendously with my decision to purchase this camera.  I am waiting patiently for it's arrival!", "Date": "February 22, 2002"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00005QFZF"}}