{"Reviews": [{"Title": "great deal, great camera", "Author": "J. Pate \"piddyman\"", "ReviewID": "R9B6PHX0M0140", "Overall": "5.0", "Content": "over the last few years i have owned 6 digital cameras, all around the $300 range, canon, fuji, and pentax.  i tend to abuse the camera so this time around i decided to get a cheap, basic camera.  to my pleasant surprise this camera is by far and away the best digital camera i have owned.  i'm not going to go into great detail but the picture quality is surprisingly good, it takes quick pictures, not that long delay one usually gets with digital cameras, and its very easy to use with a solid range of features.  definitely the best deal out there as far as i'm concerned.", "Date": "May 14, 2006"}, {"Title": "Awesome Camera", "Author": "Zenabi", "ReviewID": "R8JPXMPRUPNBK", "Overall": "5.0", "Content": "I am totally new to digital cameras and photography but this camera makes it hard for anybody to tell.  First off, out of the box I figured the entire camera out in about 5 minutes because it's very self explanitory.  The salesman said the batteries in digitals usually last for about 20 pictures...well I've taken almost 50 and I'm not even getting a low battery message yet.  The picture quality is so professional it's scary.  I definatly reccomend this camera to anybody!", "Date": "March 15, 2006"}, {"Title": "Really nice camera at a nice price", "Author": "A.Mick- \"Amy\"", "ReviewID": "R3TLS4SHKWL136", "Overall": "5.0", "Content": "I went all over town looking for a good digital camera that wasn't too expensive.  I had previously owned a fuji film camera and it just wasn't getting the job done.  I went to store after store asking different salespeople what was the best brand, best value, etc.  Almost all of them pointed out an Olympus Camera, and I finally settled on the fe115.  I like products that I can just use right away and not read the instructions for a half hour before I use them.  This little guy fits the bill and then some.  Absolutely great picture quality, and the image stabilization is really nice.  Easy to use camera with great features and affordable (although I paid more at another store...always check amazon first!) I give it an A+!", "Date": "May 24, 2006"}, {"Title": "I'm very pleased with the FE-115", "Author": "owb", "ReviewID": "R2GC11AY09O387", "Overall": "5.0", "Content": "I generally prefer cameras using SD or CF memory cards because their prices are lower for equivalent cards, but this one suited my daughter's needs and I am pleasantly surprised with the performance at this price. Two CD's are included, but I haven't looked at them and she probably won't have any need for them as she already has an excellent photo editing system on her computer. Transfering files requires no special software, you just plug the cord into the camera and into the USB jack on the computer. Windows recognizes it as a remote drive and you copy the files over.A feature I especially like is \"image stabilization\" that helps you take sharp pictures in shaky circumstances. Very nice when using zoom.It also has a supermacro range that lets you focus much closer than other digital cameras that I have used.Basic use is easy right out of the box and reading the instruction booklet and experimenting offers a lot more possibilities. I haven't tried the video modes yet.", "Date": "May 23, 2006"}, {"Title": "LOVE this digital camera!!!", "Author": "D. B. Cohen", "ReviewID": "R2MQEOMUMZHW57", "Overall": "5.0", "Content": "This is my second digital camera.  My first was a different brand and I was not happy with it at all.  But, this Olympus FE-115 is terrific!  I am SO pleased with it!  My sister has an Olympus digital that I have borrowed and it is great, so I went with an Olympus digital camera myself.  And, I am 100% sure I made the right decision.The price is very, very reasonable.  The quality of the photos are excellent.  I went to the zoo and took pictures of butterflies and animals and the pictures look professional.  The zoom is also excellent.  I took pictures of Buffalo that were far away and you wouldn't know it by looking at the photos I took.  It has a stabilization feature that you can set it on (on an easy to use \"wheel\" that you turn) that stops blurriness.  It also has 2 Macro settings for close up photos and super close up photos.  It is easy to use, lightweight, takes only 2 AA batteries (alkaline OR rechargeable), and takes high quality photos.I am very happy with this purchase and highly recommend it.", "Date": "July 15, 2006"}, {"Title": "Ups and Downs", "Author": "K. Berson", "ReviewID": "R1ZJ3XH113JCL8", "Overall": "3.0", "Content": "I bought this camera before a trip to OR. My pictures came out beautiful and the camera is easy to use.The problems I have with it are:Without a viewfinder it is difficult to shoot in dark situations, the LCD screen can't show what you are viewing. Same thing in really bright situations, there is a glare on the screen.I would never again buy a camera with only a LCD and no viewfinder.", "Date": "August 19, 2006"}, {"Title": "Fantastic Camera", "Author": "Fred M.", "ReviewID": "R2D31MAXAL4QYP", "Overall": "5.0", "Content": "I just received this camera a few days ago and i'm very thrilled. I actually took a few try out pictures in my dark living room and to my surprise the pictures were amazing. Nice, small and compact. The ease of use is surprising. Great Camera.", "Date": "June 1, 2006"}, {"Title": "just about perfect", "Author": "Jordan Bissett \"beckspujolsandme\"", "ReviewID": "R3TJ7D0R2GRRQE", "Overall": "5.0", "Content": "For the money spent, I am convinced I could not have found a better camera. I just got back from a semester of studying abroad in Glasgow, Scotland. This was the reason I purchased the camera. It traveled with me to Italy, Norway, Belgium, France and England. And I took over 1500 pictures in those 3 months.The camera is a little short on features and it does some things better than others. It took some time to get used to it and figure out how to deal with the deficiencies and work with it. But once I learned these tricks, the camera took some OUTSTANDING pictures. I have been especially impressed with the sky in many pictures. The camera has been able to expose the foreground well and still pick up specific colors and good detail in the sky (which it seems many cameras have a problem with).I bought this camera, a 512mb memory card and a pack of rechargeable batteries and it was the best $200 i've ever spent. I am going to be applying for some photography internships and my portfolio will consist mostly of pictures taken with this camera.If you need a good camera and can't afford a high-end digital SLR or just want more features than this offers, you cannot choose a better camera than this.", "Date": "January 9, 2007"}, {"Title": "NonTechy Very Satisfied", "Author": "S. Koentopp", "ReviewID": "R38UKRAXOTUQQ0", "Overall": "5.0", "Content": "This little digital camera has met my expectations. It is easy to use and understand how to use. I'm easily confused and overwhelmed by electronic products. I bought this camera after seeing it and exploring it with a friend who had received one as a Mother's Day gift.  I immediately understood how to use it, and could do so easily when mine arrived. Simplicity is a good thing and this camera falls into step!", "Date": "November 27, 2006"}, {"Title": "Inexpensive and easy to use.", "Author": "Julie \"Julie\"", "ReviewID": "R3MM9P4N20EO2T", "Overall": "5.0", "Content": "My daughter bought this camera for a recent trip and she loves it.  It was in her price range, easy to use and takes great pictures.", "Date": "August 14, 2006"}, {"Title": "Camera is okay.", "Author": "Amanda \"Amanda\"", "ReviewID": "R2TLK5RR5LT1RS", "Overall": "3.0", "Content": "This camera is okay if you are in no hurry to take a shot.  The shutter has an extremely long delay after you hit the button.  Scanning through the pictures also has a serious delay.", "Date": "August 9, 2006"}, {"Title": "Very smart little camera", "Author": "Shelly Morris \"shelly belly\"", "ReviewID": "RWUNROTF1TTBT", "Overall": "4.0", "Content": "I bought this camera as a \"first camera\" for my son's 12th birthday and found it to be lots of value for money. It's very user friendly and compact, great for a first time digital user. My only grouse is it doesn't seem to have a microphone (if it does we haven't figured it out yet!)", "Date": "August 13, 2006"}, {"Title": "Great Little Camera", "Author": "P. A. Lawson", "ReviewID": "R3RLW5HMWWVDNQ", "Overall": "5.0", "Content": "This camera has great picture quality and lots of extras that we didn't expect.  The size, quality and price make it a very good camera.  We are extremely pleased !", "Date": "July 13, 2006"}, {"Title": "BUY THIS CAMERA!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Author": null, "ReviewID": "R1NICE81N3M8PD", "Overall": "5.0", "Content": "I'm 11 years old and not exactly a saver, so my hope of getting a digial camera was out the door (and of course my parents woudn't buy me one). Until I found the OLYMPUS FE-115.  With a four and a half star rating, tons of different modes, a sleek model, and for a cheap price, it was the camera of my dreams.  And that was what I thought before it had even arrived.  This camera has billions of hidden features and takes superior pictures not to mention the super macro mode is completely off the hook!  Pleassssssssse buy this camera!!!!!!!!!!", "Date": "July 15, 2006"}, {"Title": "Wonderful product", "Author": "Stephanie Keohane \"shopaholic\"", "ReviewID": "R34J6PS10T7AWX", "Overall": "5.0", "Content": "I was a little nervous ordering a camera without seeing it before, but it turned out much better than I expected. This camera is great and it came very well packaged with all the extras inside! great buy!!", "Date": "June 30, 2006"}, {"Title": "I LOVE IT!!!!  But no audio.", "Author": "Gerald Balmes \"Jerry B\"", "ReviewID": "R3MXSJ9UB4I6FX", "Overall": "4.0", "Content": "Several years I remember trying to figure out my brothers digital camera; a major brand and I just gave up.This Olympus is so easy to use. If and the instruction are easy clear and uncomplicated. Pictures come out great; ease to download and transfer and I had a pic of my new dog on F/B in about 15 min.Ignore the negative reviews. If you can find one of these gems in like new condition GET IT.UPDATE This camera's software will run on windows 7 But do not use the Olympus Master. Upgrade to Viewer 3 or newerSpecs:Key FeaturesCamera Type Point & ShootOptical Zoom 2.8xDigital Zoom 4xSensor Resolution 5.0 MPScreen Size 1.5\"Optical SensorSensor Size 1/2.5\"Sensor Type CCDLens SystemMacro Focus Range 2-50cmFocus Adjustment AutomaticAuto Focus type TTL contrast detectionFocal Length Equivalent to 35mm Camera 38 - 106mmExposureMax Shutter Speed 1/2000 secMin Shutter Speed 2 secExposure compensation ±2 EV range, in 1/3 EV stepsExposure Metering Center-WeightedExposure Modes Automatic, ProgramLight Sensitivity ISO auto (64-320)Light Sensitivity Max 320Camera FlashFlash Type Built-in flashRed Eye Reduction YesEffective Flash Range 0.2 m - 3.8 mCamera Flash Features Auto Flash, Fill-in Flash, Flash Off, Red-eye Reduction FlashFlash Modes Auto Mode, Fill-in Mode, OFF mode, Red-eye ReductionMemory / StorageIntegrated Memory size 28 MBSupported Flash Memory Built-in, xD-Picture Card, xD-Picture Card Type H, xD-Picture Card Type MViewfinderViewfinder Type None, Without ViewfinderDimensionsDepth 1.5 in.Height 2.5 in.Width 3.5 in.Weight 3.95 Oz.DisplayDisplay Type LCDDisplay Rotation Built-inScreen Details LCD display - TFT active matrix - 1.5\" - colorDisplay Size 1.5\"ConnectionsConnector Types 1 x DC power input, 1 x USB, 1 x composite video outputExpansion Slot 1 x xD-Picture CardSystem Requirements for PC ConnectionOperating System Supported Apple Mac OS X 10.2 or later, MS Windows 2000, MS Windows 98 SE, MS Windows ME, MS Windows XP, Microsoft Windows 2000, Microsoft Windows 98SE, Microsoft Windows ME, Microsoft Windows XPBatteryBattery Form Factor Standard form factorFile FormatDigital Video Format Motion JPEG, QuickTimeStill Image Format DPOF 1.1, JPEGResolutionMax Video Resolution 320 x 240Environmental ParametersMin Operating Temperature 0 °CMax Operating Temperature 40 °COther FeaturesAdditional Features Automatic Pixel Mapping (APM), DPOF Support, Date/Time Stamp, Digital Image Rotation, Digital Image Stabilization, Digital Noise Reduction, Image Stabilization, Not Interchangeable Lenses, PRINT Image Matching, PictBridge Support, RGB Primary Color Filter, USB 2.0, USB 2.0 CompatibilityShooting Modes Frame Movie ModeMiscellaneousShooting Programs Landscape, Night scene, Panorama assist, Portrait mode, Self-portraitWhite Balance Auto, AutomaticVideo Capture QuickTime - 320 x 240 - 15 fps - 85 sec - with 28MB built-in memory", "Date": "December 9, 2013"}, {"Title": "Great Digital Camera", "Author": "Amanda Lawson", "ReviewID": "R1JGS9JNJ5NWM3", "Overall": "4.0", "Content": "I bought this camera model, refurbished, for a decent price and I feel like it's been worth it. It runs on AA batteries, and my only problem with it is that it seems to run through batteries pretty quickly. Other than that, it's a great buy that I don't regret.", "Date": "October 24, 2008"}, {"Title": "Good basic camera", "Author": "K. Duvall", "ReviewID": "R10M4ODSV8BDU7", "Overall": "4.0", "Content": "We have had this a while.  It has survived several drops to the floor and two small kids pushing buttons over and over.  The outside is scratched up but it still works.  Decent quality photos.  We will probably upgrade to something with more pixels next time.  Great little camera.", "Date": "September 5, 2008"}, {"Title": "Decent Pictures, but major design flaw", "Author": "L Q \"CaptainObvious\"", "ReviewID": "R1325LCT5K3VWR", "Overall": "3.0", "Content": "I had this camera for about 1.5 years.  It takes pretty good pictures and is pretty easy to use.However, the battery cover's latches are really small plastic pieces that are a part of the outer cover of the camera.  Because it eats up batteries pretty quickly with the LCD screen (covers almost 1/3 of the back of the camera), you have to change the AA batteries fairly often (rechargables recommended).  Over time, the little plastic latches seem to either wear out or just break off from friction with the cover.  When this happens, the camera becomes unusable. Because the batteries push against the cover, without one of the small plastic latches, the camera acts as though it's not getting enough power to take pictures.  You can still connect it to the computer to get the pictures off, but the lens won't stay open for you to take pictures.Apparently, this happens often with the Olympus FE models from a few years ago.  I read that a guy tried to get his FE-130 repaired for the same problem.  It was not covered under the warantee and would cost about $100 to fix.  (See the Olympus FE-130 for other accounts of the battery cover flaw.)Overall, this is a good, cheap camera that tool pictures well.  The \"cheap\" aspect comes into play with its structural design.", "Date": "April 29, 2008"}, {"Title": "NO VIEWFINDER", "Author": "Dani", "ReviewID": "R13VUSZ4TSXHL9", "Overall": "2.0", "Content": "I purchased the camera ..but i ended up returning the camera...I had no idea it had no view finder....I thought all camera\"s had a view finder... I will look at the item description closer from now on...because i ordered it, I have to pay return postage...", "Date": "July 26, 2006"}, {"Title": "Easy to use and slick design", "Author": "Pablo E. Nunez", "ReviewID": "R3QRJ0EISFLWRA", "Overall": "4.0", "Content": "Feels very comfortable to hold and it is very easy to use.", "Date": "August 1, 2006"}, {"Title": "Review", "Author": "Sam Jones", "ReviewID": "RZJ3W1WXQBY4C", "Overall": "3.0", "Content": "Although the camera is nice and small and easy to take pictures with (with the pictures actually turning out nice), if you are new to digital cameras or are not very good with computers, I would not reccomend this camera because the software is extremely hard to use and confusing", "Date": "May 7, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000E9WCH6"}}