{"Reviews": [{"Title": "Very High quality and totally accurate voltage", "Author": "Donald Filbert", "ReviewID": "RWVEQ9T72QWZZ", "Overall": "5.0", "Content": "Many of the speced \"12 Volt\" power supplies operate at 13+ and even 14 + volts.  I have a Nixie clock that specifies a regulated 12 volts - and requires that to be accurate.  This power supply is made of very high quality components and delivers up to 2 amps at a very accurate 12.1 volts.  Great item !!", "Date": "March 18, 2013"}, {"Title": "works great with Swann camara's", "Author": "walter", "ReviewID": "R2GPM9EXKNK1P5", "Overall": "5.0", "Content": "ordered this for a set of 4 Swann camera's. nice to only have one power source instead of 4 no loss of video claritywould recommend this to anyone looking to replace or reduce amount of power sources.", "Date": "December 19, 2013"}, {"Title": "This will power more than one camera", "Author": "GrantV", "ReviewID": "R26AR7S3MKPBN7", "Overall": "5.0", "Content": "I learned that picture quality suffers from voltage drop, but not from length of video co-ax according to the seller. So while my cameras are hundreds of feet from my DVR, it's best to have the power source local to the cameras.So rather than run the power for the cameras from the DVR area the way the professional installers did who originally put our system in, I changed the location of the power cubes. I have the power supplies plugged in just inside our building where the cameras are mounted, so the 12v supply cord only runs about twenty feet. System works 200% good.Each supply conservatively runs two cameras and has been in service 24/7 now for two years and counting.", "Date": "August 9, 2013"}, {"Title": "Amazing product ...removed lines", "Author": "L. Sarver \"awaken812\"", "ReviewID": "R36AVXLBM956AB", "Overall": "5.0", "Content": "I bought a great camera here in Amazon for only $70 the best investment!!! it is infrared/night vision powerful camera LED...but I had lines going up and down and night vision was a horror so frustrating..nothing worked cables and adapters until I got this one. I received it today quick delivery! amazing I will try and post a video so you can see the quality. I have it connected to the computer so that I can save the files into video. The best little adapter for only $10 I am ordering more..I recommend it especially if you are getting those annoying lines.", "Date": "May 24, 2013"}, {"Title": "Wrong description", "Author": "Mark Twain \"S-L\"", "ReviewID": "R1AGLKMOND386Z", "Overall": "2.0", "Content": "I needed an adapter that will deliver 12V 2Amp for my verizon router that I got off eBay. The router requires a 2.1mm input plug and from the description of the product, I thought I got the right product. I was little too short in term of timing. So when the videosecu adapter showed up, I immediately plugged it in the router (attempted to plug in) and it was no go. The input plug for this adapter is not 2.1mm but 2.5mm, making it my purchase worthless. Another trip to local Radioshack and after $4 dollar two 2.1mm input tips and 30 minutes of wrangling with soldering iron, I was able to re-purpose the adapter and check my router. Considering the aggravation, in the hindsight, I should just cough up $27 for the adapter from Actiontech.", "Date": "April 9, 2014"}, {"Title": "Perfect replacement for Numark NS6", "Author": "Duke VonLaserface", "ReviewID": "R31J1R6R6000MB", "Overall": "5.0", "Content": "Purchased for a Numark NS6 and it's perfect. Cord is longer and thicker than the one that ships with the controller and the body has sturdier feel.", "Date": "April 3, 2014"}, {"Title": "Product not the same as what is listed", "Author": "Kizzed", "ReviewID": "RPPVQ7JMAKQBO", "Overall": "1.0", "Content": "Was not what was listed on the site, had to return it within 2 mins of opening it. Wrong voltage.", "Date": "April 1, 2014"}, {"Title": "I bought this for a camera i bought.", "Author": "obed h.", "ReviewID": "R3GII8Y8S14UU3", "Overall": "5.0", "Content": "i bought the trace premises survillance camera which you have to use battery..but it has a ac plug...but the company do not have the ac-adapter so i bought this one knowing the voltage and amp or watts requirement...and baby fit the bill and camera is upand running with out a hiccup....will buy if i buy another camera(which i'm thinking on doing)..the camera is also sold by amazon,the..trace premises by multrie.", "Date": "March 14, 2014"}, {"Title": "Good option for LED strip lights", "Author": "J. Czarnik", "ReviewID": "R2Q164X1GOE5FU", "Overall": "5.0", "Content": "This is a great, UL listed option for a 12V power supply if you're putting up DIY LED strip lights.  (for example under/over cabinet uses).  It has the right markings, and good quality, IMHO worth the few extra $$ over the chinese knockoffs.  Has been in place for couple of months, no issues whatsoever.", "Date": "March 7, 2014"}, {"Title": "exactly what I ordered", "Author": "Heart Codes", "ReviewID": "R16181R7VNU4XK", "Overall": "5.0", "Content": "It arrived quickly.  It is exactly what I ordered, and it works perfectly.  Would order it again, if needed.  No surprises.", "Date": "March 7, 2014"}, {"Title": "Works - What More Can I Say?", "Author": "Jack Kennedy", "ReviewID": "R1MEL8TE4PIVQH", "Overall": "4.0", "Content": "Might be on the pricey side of things, and is surprisingly light in the hand - but it works!I'm a little worried that the internals may not last, as I said - it's a pretty light adapter, doesn't weigh very much. Maybe I'm use to inefficient or beefy circuits, but that's just me.", "Date": "February 12, 2014"}, {"Title": "excellent product", "Author": "powerby50", "ReviewID": "R2VM4IUTXLI5FS", "Overall": "5.0", "Content": "originally purchased the high lights transformer, after it failed miserably , i purchased this one which has a nice long cord and works excellent,", "Date": "October 18, 2013"}, {"Title": "works great for my led lights", "Author": "Matt", "ReviewID": "R16J64WE6FY1BB", "Overall": "5.0", "Content": "using it to power led strip lighting in my kitchen. i have 2 of them.  one of the strips i am using had a connector soldered onto one end & this plugged right in... so that was a pleasant surprise!", "Date": "October 13, 2013"}, {"Title": "led light power supply", "Author": "BOBK", "ReviewID": "RP8HL0K27FP0Q", "Overall": "4.0", "Content": "haven't really given a full trial as i plan to hook 3 strands at once.  so far so good  thanks", "Date": "September 23, 2013"}, {"Title": "12V power for your CCTV cameras or other electronics", "Author": "igen \"igen\"", "ReviewID": "R22I62A0M3TKGA", "Overall": "3.0", "Content": "I bought this along with a splitter to power a CCTV camera.  It works okay, but it's annoying that it takes up so much space on a power strip.  I'd prefer if it was slimmer and had the prongs rotated 90 degrees so it would fit better on a straight power strip.", "Date": "August 16, 2013"}, {"Title": "Does the job", "Author": "Ed Mihalcak", "ReviewID": "R1MROI1JVNREGZ", "Overall": "5.0", "Content": "Bought couple of these to power some real gages in my iRacing simulator cockpit and they work perfect. One is already over a year old and no problems.", "Date": "July 21, 2013"}, {"Title": "Nice replacement", "Author": "jrod", "ReviewID": "R358JFZIL1GU64", "Overall": "5.0", "Content": "I used this as a replacement for an adapter that was going bad and was causing a loud hum on the microphones. I used a power splitter to power 4 cameras and have not had any issues.", "Date": "July 6, 2013"}, {"Title": "Works like it should", "Author": "454Malibu", "ReviewID": "R1O4HOZXTJ4XCC", "Overall": "5.0", "Content": "Power supply for outside security cam. Works like it should. No more lines on the camera. Big enough for most cams.", "Date": "March 12, 2013"}, {"Title": "It supplies power", "Author": "S. Martin", "ReviewID": "R18WUODS2D9MQK", "Overall": "5.0", "Content": "I need a specific power supply for a battery charger the plug must fit and output 12v DC @ 2 amps with somewhere 120 volt input.  So far this item does all that.", "Date": "February 22, 2013"}, {"Title": "great", "Author": "Carlton Robinson \"carlton robinson\"", "ReviewID": "R3LRUC0O7G83S2", "Overall": "5.0", "Content": "Ordered this for a client.  I got no complaints so I guess he was satisfied and got what he wanted", "Date": "February 4, 2013"}, {"Title": "Powers three cameras perfectly", "Author": "tiff_tiff_tiff", "ReviewID": "R40PM8ZUP6IX7", "Overall": "5.0", "Content": "I have this hooked up to three cameras and plan to add a fourth. It is working great and seems well built.", "Date": "March 27, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000VRIK54"}}