{"Reviews": [{"Title": "Wonderful light", "Author": "Busy Executive", "ReviewID": "R4WTXW5UF1G46", "Overall": "5.0", "Content": "I'm a believer in Nikon's \"Creative Lighting System\" (CLS) because it makes it so simple to use multiple portable flashes off-camera to get serious looking professional lighting effects without cumbersome studio flashes. Only problem is that as much as I love my SB-900s (and no, I never had the overheating problem everyone complains about), it's just not nearly as powerful and flexible as the Quantum units. With Quantum's addition of the (separately sold) QNexus unit, however, I can have the best of both worlds: a mix of Quantum and Nikon flash units, all operated under control of the Nikon CLS system.The QNexus unit is the \"glue\" here, translating Nikon's CLS infrared signals to a form the Quantum flashes can understand. You get virtually all the same features except for (high-speed flash), but with a mix of Nikon and Quantum units acting together in unison. Plus, when I need a super-powerful flash with a heavy duty external battery pack, I can use the Quantum solo. Given the flexible Quantum system - interchangeable reflectors, diffusers and bulbs - I feel like I finally have the best of both worlds. Quantum also has their own radio control system, similar to Pocket Wizard...500 foot range that doesn't require line-of-sight placement - although of course, this wouldn't work with the Nikon lights.Of course, the Quantum isn't perfect...it tends to be really heavy (especially with the battery, which can be attached under your camera or worn at your side). Plus, with a Quantum, you'll probably be using some type of heavy-duty bracket, adding even more to the weight. Still, the light quality is pretty amazing...somehow softer and more diffused than the SB-900, while also being more powerful. Still, I also like that the SB-900s can be powered with off-the-shelf AA batteries if necessary, versus the Quantum's custom external power pack. The Quantum is also rather expensive...last time I looked, I could have bought three SB-900s and an SB-600 for the price of the X5, its battery and the QNexus unit.Some will tell you that the Nikon and Quantum units don't work well together because the color temperature of the lights differ slightly. This is indeed true, but the effect is very, very small. I have a color temperature meter, and I find the two are within about 100-200 degrees of one another, with the Quantum being consistently warmer. If I want a precise mix, I simply put a CC05 yellow filter on the SB900, and I find the colors are dead on.Otherwise, the Quantum seems like it's built like a tank and will stand up to even the most demanding day-to-day use. No regrets whatsoever about this purchase.Highly recommended.", "Date": "March 22, 2010"}, {"Title": "Quantum X5dr", "Author": "Kevin F. Pyle \"Kevin P\"", "ReviewID": "R33XQEZHOU0ON8", "Overall": "5.0", "Content": "This is a studio flash that is portable, up to 400ws of flash power,no heat, no running fan noise, just incredible quality of light.Can't imagine shooting without it.  I did purchase it new, ordered it on Amazon, but Adorama cancelled the Amazon order and charged me directly when wanting the shipping expedited, so it came from Adorama, but apparently the box was previously opened, and malfunctionedthe day I got it, and now won't fire at all so this monday, a month later, it goes back to Quantum for service to havethe problem fixed. Quantum Tech support is the best in the industry.Kevin P.", "Date": "April 12, 2009"}, {"Title": "Powerful for wildlife", "Author": "C. Li \"Photo\"", "ReviewID": "R27XXO2TAJZFJR", "Overall": "5.0", "Content": "I want a flash that can flash @ 6 frame/second for my backyard hummingbirds. this one can do it at short distance, but you must tuning at high speed shoot (like 1/2000s)Pros  Powerful with tele-reflector, can reach 600'  can shoot all frames when burst shooting @ short distanceCons  $$$$($3000.00 for my system)  built quality is not good enough  Can not auto-Syn when speed high than 1/320 (must manual tuning)", "Date": "September 7, 2010"}, {"Title": "Middle fish that is about to be devoured!", "Author": "Ali Roustai", "ReviewID": "R3FW2A9KMPS77I", "Overall": "2.0", "Content": "Quantum flashes are more powerful than your regular flash, However they are very very expensive. By the time you add the prices of wireless transmitter TLL options, and overpriced batteries ext your are looking at 2 yo 3 grand to get at best 400 W of power!!!  With the emergence of portable system such as  Profoto B1 and soon to be out , the Chinese lower prices smaller copies that have TTL, high speed sync cheep batteries, and remote all included for a few hundred dollars why would anyone spend this sort of money?", "Date": "April 15, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000LMOH5Q"}}