{"Reviews": [{"Title": "Great quality", "Author": "Paul G. Ziegler \"Aquaskiier\"", "ReviewID": "REGD2ES992XNM", "Overall": "4.0", "Content": "I purchased 2 other night vision cameras and was disappointed.  I spent the extra money to buy this camera and was very impressed with the picture quality.  I can see across my street at night with no problem.  The night vision picture is very clear and bright.  During the day it is so clear it's like looking out a window.I didn't give it 5 stars for one reason.  The price is great but it does not include the power supply cord or any cable.  That's just a  ridiculous way to sell this item.  It's like selling a car without the keys included.  It costs $25 for the power adaptor and another $25 for cable and connectors, not to mention a trip to Radio Shack.Also, you need to take it apart to focus the lens after you set it up.  There were no directions in the box to tell you how to do that so I had to call the company.I would still buy it again (I'm recommending it) but let the buyer beware that you need to spend at least $50 additional in order to hook it up.", "Date": "January 17, 2008"}, {"Title": "Not a toy camera like others for higher prices!  Built big and to last!!", "Author": "Amberman", "ReviewID": "R5COWJ8ATVHMZ", "Overall": "5.0", "Content": "This camera is definitely superior over all others i've seen in both price and quality.There is a BNC female connector on the back plate (male BNC adapters for RCA cables are available at Radio Shack, as is the 12v power converter. Save more money and time. Positive polarity.)I noticed the camera rattling and loose inside. If your camera begins to rattle, open up the back plate and carefully remove the whole assembly - with the plate-attached metal stair-step stand that supports the camera. You can adjust the stand by twisting any loose columns. But be careful not to unfocus the camera.Do not try to open the front of the camera, unless you absolutely have no choice - like to replace the IR ring!The IR ring (infra-red led lights attached to a curcuit board) is held in place separately in the front of the camera with a small white pin connector with wire leads to the camera board. This is convenient because when the IR leds may burn out after a few years, you can just disconnect and replace the ring for cheap.The sun shade slides only if the front and back end screws are loosened. At the top-back of the camera, there are 2 built-in screw fittings that confused me at first. (Be sure to refer to the picture here that shows how the wall connector is put together, or you will become frustrated since there are no instructions or diagrams on how to use the supplied hardware.) Do not try to move the angle of the shade, since the only way it moves is from front to back on slides.The reason this or most surveillance cameras on the market today do not have any audio is because the public privacy law has changed to make eavesdropping illegal in many states. But if you are so inclined, find mini-microphones, transmitters and receivers on the hobby shop sites selling motorized airplanes that employ digital cameras. You might find better prices for mini-box color cameras as well with portable power supplies.Enjoy!", "Date": "March 13, 2008"}, {"Title": "Nice IR, narrow field of view", "Author": "Big Ed", "ReviewID": "R2YUM0Z9PR0AAS", "Overall": "3.0", "Content": "I just installed this camera today.  The picture is good but the field of view is very narrow.  I can only see a width of about 18 feet wide at a distance of 60 feet.  The IR ring is visible at night and makes the camera stand out, something to think about.", "Date": "May 20, 2012"}, {"Title": "Great Camera but \"Long Range\" so insure you want it for that.", "Author": "YADA YADA YADA", "ReviewID": "R33X893CLRPFYN", "Overall": "5.0", "Content": "This is a great camera overall and the company has great customer service. Shipping was pretty quick too. I didn't realize how zeroed in it would be. My mistake in not paying attention to the \"long range\" in the description or understanding that. I used it anyway further back with good results.It was ok with me that there was no audio because I purchased a high range mic for cctv separately and attached it to the back which worked with the video cable that I also purchased separately.I purchased this to obtain license plate numbers of cars parking near mine on my street where I park without paying a fortune for those type of cameras on other sites. I figure if someone does something I can obtain the plate number too. It does do that (only during the day) at about 25 feet even when the cars are moving at about 15 mph and you pause the DVR. I have a CPCAM 4 channel DVR. From where I had it mounted (25 feet) the view was just the plates verses the car and plates so I used another camera for that and moved this one back.Also at night the plates are washed out (at 25 feet) but due to the small area where I can mount the cam at the right angle to view the plates I couldn't experiment with the camera being back further as to not wash out the numbers so I can't judge what it would do a little farther back. The night vision is that good so I think if too close it washes it out.Good high resolution also. When I first installed it and trying to get the right angle I had it halfway on the back part of my car . (I could see the rain drops on the car and the camera was 15 feet away.) Now I moved it back 50 feet and I can get my whole car in from the side as well as the persons face who is standing next to my car.I would say this is a good deal for the price and quality (big and sturdy) with a really good thick bracket. I would definitely purchase this again if I had the need. Make sure you need it for long range and not close up unless it is a small zeroed in area.", "Date": "March 25, 2011"}, {"Title": "Great Replacement Cameras!", "Author": "Zabadu", "ReviewID": "RT822FK81O2US", "Overall": "4.0", "Content": "I purchased two of these to replace the cheap, low quality cameras that came with my DVR System.  They work very well.  Easy to hook up, comes with good stands (though I mounted mine on light stands via the 1/4 inch threaded hole on the bottom) and work as advertised.  These have decent range- I was able to get about 30 feet in a building with no other light sources.These are not super high end cameras, they don't have settings or features to adjust.  They are plug and play cameras that work well.", "Date": "July 17, 2012"}, {"Title": "Camera", "Author": "Rob", "ReviewID": "R2GNZDBYJ1T9HZ", "Overall": "4.0", "Content": "The video from this camera is excellent, it blows away all the cameras I have now, but because of my limited knowledge of lens and poor description I am only giving this a 4 star, the field of vision is very narrow and not adjustable, wish there would have been something in description for the novice", "Date": "June 20, 2012"}, {"Title": "Great Picture", "Author": "Jarad Brinkerhoff \"The One\"", "ReviewID": "R1RXQRGV2KWNKD", "Overall": "5.0", "Content": "I have a Q-see recorder. The cameras on it work, but not that well. I installed this camera and it works great. The night vision on it has a good picture, not grainy. I would say it is really clear for about 220 feet or so. I am very pleased with this camera.", "Date": "July 13, 2011"}, {"Title": "Outdoor Infared Day Night Home CCTV Security Camera", "Author": "Priscilla", "ReviewID": "R3T1XV2OUZOED9", "Overall": "1.0", "Content": "I only got a little page of information. I don't know how to use the single camera because I have no information on what cords or connections or monitor I need.  I need all that information because I am 76 years old and not an electriction. I have turned it over to men to help me and they comment that there aren't enough details about how to put it all together, and what else I need to buy. Really at a loss. I trust Amazon but I don't know about this product.", "Date": "May 9, 2011"}], "ProductInfo": {"Price": "$422.45", "Features": "High Resolution: 540 TVL. Built-in 1/3\" Sony Super HAD Color CCD sensor\n12mm lens, 0 lux with IR LED. Electronic shutter 1/50 - 1/12000 seconds\nDiscreet, bullet-style camera with 54 long range IR LEDs\nSunshield, Anti-ultraviolet. Built in IR illuminator effective up to 120 feet\nDigital automatic backlight compensation; Video out: composite output 1.0Vp-p at 75-ohm", "Name": "VideoSecu 540TVL Built-in 1/3\" SONY Color CCD Outdoor Infrared Security Camera Home CCTV Surveillance High Resolution 12mm Lens Day Night Vision 54 Long Range IR Leds with Free Power Supply CNB", "ImgURL": "http://ecx.images-amazon.com/images/I/51QjZoquFsL._SY300_.jpg", "ProductID": "B000X9QD22"}}