{"Reviews": [{"Title": "Great point and shoot for it's time", "Author": "Scott M. Tiek \"smartwentcrazy\"", "ReviewID": "R2ZVOTOOI703SD", "Overall": "4.0", "Content": "This was my very first digital camera I ever owned.  I purchased it back in 2003 and continued to use it up through 2008 when the zoom lens quit working.  Considering the amount of photos I took and the fact that it saw it's fair share of abuse(accidental of course) this camea held up pretty well.  I always loved the quality of the shots I go with the marco setting on this camera.  I agree with everyone else, it did zap the batteries pretty quick, seems like it went through rechargables real quick so I didnt even bother with those.  I found the Walgreens brand batteries gave me the most bang for the buck and they are plenty cheap!  Also there is still support available for this on HP's website.  If you get this camera I suggest you go there and download any available firmware updates that are available.  It's a pretty simple process and they walk you through it step by step.", "Date": "February 28, 2010"}, {"Title": "WORST Camera", "Author": "D. Herr \"lacie02\"", "ReviewID": "RN6PMPQ3M66SO", "Overall": "1.0", "Content": "This camera was a gift.  The first camera didn't seem to be formatted correctly so we took it back & got another one to replace it.We had trouble from day one.  It EATS batteries, I use rechargeable batteries.  At first I thought something was wrong with the batteries so I purchased a different brand of rechargeable batteries, it didn't change a thing.  I take 5 pictures & Camera tells me batteries are low & it won't process or perform after that.  Clarity is a problem as well.  I spent 5 hours on the phone with several Techs in India, what a joke!SAVE YOUR MONEY & DO NOT WASTE IT ON THIS CAMERA!!!!", "Date": "October 22, 2006"}, {"Title": "Good starter camera", "Author": "Jmar", "ReviewID": "R1FOAK4BZUP1S1", "Overall": "4.0", "Content": "Takes great pics, however you do not want to use ordinary batteries. They won't  last. I used lithium batteries and got good service from them. Camera still works as good as new.", "Date": "January 26, 2014"}, {"Title": "HP 733 Camera Sucks", "Author": "Richard Mercer", "ReviewID": "R28R0FC3K2CTL1", "Overall": "1.0", "Content": "I got a new HP 733 camera and within a year, it just quit. Then I bought another one because it had the features I liked and thought maybe I had a lemon before. Within a year the new one stopped also. Two out of two and always a format problem. And it just didn't do well with anything over 1G Chip. Too much for this old camera to process it seemed. The best was 512 MB and that was OK for little stuff and short trips. Will Never buy one again and suggest you don't. RM in Allentown, PA", "Date": "April 28, 2010"}, {"Title": "still have this camera", "Author": "T. Ives", "ReviewID": "R2O8MILABOL867", "Overall": "3.0", "Content": "I still use, it was my first digi camera bought it in 2003 or 2004? cant remember but it still works but not that good, dropped a few times. it uses lots of battery juice. Rechargables dont work long in it. I paid about [...] or so then. wowwww how things come down", "Date": "December 26, 2008"}, {"Title": "decent first time camera", "Author": "M. Richter \"mel mel\"", "ReviewID": "R3FPQAGQK0R7SD", "Overall": "4.0", "Content": "I got this camera as a gift and it eats batteries but it's not bad for a starter camera. It still takes great pictures. If you buy a memory card for it too it can hold a lot of photos. Not the best, but still pretty good.", "Date": "January 25, 2007"}], "ProductInfo": {"Price": "$199.95", "Features": "Digital Camera\nHP\nHewlett Packard\nCameras\nVideo", "Name": "HP Photosmart 733 3.2 Megapixel Digital Camera [3x Optical/3x Digital Zoom]", "ImgURL": "http://ecx.images-amazon.com/images/I/41FF2W78ASL._SY300_.jpg", "ProductID": "B0008D78TK"}}