{"Reviews": [{"Title": "Best DSLR on the market", "Author": "Alaskan Photo Workshops & Tours \"Visit www.Ph...", "ReviewID": "RUZZNTE3V1N72", "Overall": "5.0", "Content": "Well if you are looking at this fine piece of Photographic equipment odds are you have been to the Canon website and read the specs.  I will touch on a few of the items I have noticed since I purchased mine and have been using it.1st.  The feel, just like the 1D M3, this beast is solid.  Not too heavy, but solid in the hand.  And here in Alaska, I do put the weather sealing to a test, and just like my trusty 1D M3, the 1Ds passes with flying colors.2nd.  Yes its 21.1 MP, but that should not be your main consideration to buy it.  Yah 18x12 @ 300Dpi out of the Camera is nice, but nost people dont print over 16x20, and I have sold a lot of prints from my old 20D at that size or even upto 20x30, as long as you shoot it right in the first place.  But this is also a drawback as well.  Because of the large file size, esp in Raw, and most, if not all, buyers of this body will/should be shooting in raw, be aware that you will need larger CF cards for it.  At least 8gig, I use 12Gig for mine, extreme 3's and they work great!  Also be aware if you use the internal high iso noise processing, it slows down the buffering a lot!!!3rd.  Full Frame, just like the earlier 1Ds models its a ful frame sensor.  That means 2 things, not only does a 17mm or 14mm lens again be a true wide angle lens, but also with the larger sensor the pixels are more refined and this gives better color and less grain.4th.  The colors of the images in the files.  WOW  Again the 14bit processors are great!!!  Esp for raw, where you can import it in as 16bit for the finer details.  One draw back is if you use Photoshop, you will need CS3 to do the raw Conversions, unless you use the Canon program.5th.  You are approaching the image quality of a Dig MF camera, with the portability of a Dslr!  Not to mention you can use all the Canon EF lenses, and this camera really should only be used with L series lenses when possible, except for the fisheye as its not made in an L series but the quality is very good anyways.  As the Quality of the optics is what affects the quality of the image the most, other than settings in the camera, ie shutterspeed and AV, ISO, etc...6th.  Wonderful Accesories for the camera.  I love my wft-e2a.  I use it on my 1D M3 a lot and it works great on the 1ds as well.  Its a great way to control your camera remotely or to send your files to a remote computer for processing and such while you are still shooting.This Camera is great.  I have used the new nikon d3, and its a much improved camera over the past models, but it does not compare to the top of the line Canon!!!!  This camera will not let you down.  The noise if shot right is not even noticed until iso 1600 and then you still got to look.  ISO 3200 is still great (about the same noise/grain my buddy had on his d200 at iso 400!!!!!)!  If you are a Pro and need a camera that can perform the best and give wonderful results, this is it.  It kicks butt compared to anything else in the DSLR market!!!", "Date": "January 21, 2008"}, {"Title": "Wonderful professional camera", "Author": "Hidenori Inagaki \"Hidenori Inagaki\"", "ReviewID": "R26IKRK9T1TL75", "Overall": "5.0", "Content": "I owned this camera since spring of 2008,So at the point of writing this review, I used it for nearly a year.Now, if you are earlier owner, you might have experienced a problem or two.I was unfortunately one of the owner experienced problem, and had to ship it back to Canon for the warranty repair.  So, I was not exactly happy about paying expensive FEDEX freight.But, rest assured, no other nasty problem occurred after warranty repair, and this camera has been workhorse of my photography.Now, let get on the review.This is really wonderful 21.1MP camera, and it is well worth the money.But, you have to determine if you need to use one.At the time of release, there were no other full size sensor camera with this resolutions.Of course, it has been since passed by other manufacture... but I will not going to that comparison.For Professional User.Important thing about this camera is economics.I own EOS 5D as well, and when non-commissioned or low paid project, I tend to bring 5D instead of 1DS MK3.It is due to the fact, overall operational cost tend to be higher on the 1DS MK3 so if does not paid well, there will be no point to bring it out.But, if it does paid well. there are enough justification to own this system, and you should used it as much as you can.And this system is really reliable, once you get past some getting used to.One more note,Now I do own several different system including Hasselblad Medium format.Medium Format Digital System is superior system when you are working in the control lighting environment.  However, it is rather difficult to work with in the outside activity.If you are studio photographer with magazine or commercial client, and do occasional out side shoot, you should own both medium format and this camera.If you are professional just wondering about medium format and full size sensor camera,but without pressing need, then do not bother with medium format.People who uses medium format digital normally has pressing reason such as satisfying client's specifications to own such system.And it is not really versatile system no matter how medium format camera maker and digital back manufacture portray.Canon 1DS MK3 is really versatile system, and it will satisfy most of design agency, publisher or stock photo agency's requirement, and L lens system are reasonably priced for the performance when looking at the economics.For Semi Pro or High Amateurs UserFor semi professional. 1DS MK3 is not going to make best economic argument, if you do not shoot studio.If you are part time photographer who shoots mainly events or doing photo journalism.I will recommend 1DMK3 over 1DSMK3.Also, for photo journalist purpose, nowadays 5D MK2 actually makes a lot more sense than getting 1DS MK3 due to the their HD capability.And for the photo journalist, it is not that good idea to carry bulky system.But, for an amateur user with a lot of spending money,It is one of the best system to get taste of what real pro are using.And it does not cost like price of new BMW, and for the financially resourceful amateur, 7 to 8 grand may not be much of money.When I got 1DS MK3 there were several amateur photographer I taught how to use this camera...Surprising thing is, there are quiet many of amateur owner, and with very limited instruction to them,They were able to create very good quality images.So, kudos to the Canon for new 1DS MK3 interface.It is actually easier for 1DS first timer than older 1DS MK2 for instance.Of course, people who were used to with 1DS MK2 or older tend to disagree on this.Now here are list of main advantage.1. It is 21.1MP, more than most of commercial assignment requires.2. Color depth of 14bit per channel is really useful for RAW work flow process.3. Economical compared to the expensive medium format system, and still get comparable or sometimes superior result if conditions are right.4. Build like tank, and it can take a quiet bit of abuse.5.  For user who are used to with 20D~50D, 5D MK1~MK2, it is really easy to learn interface.6. Dust cleaning is really useful.7. AF + Canon L Lens combinations is superior to the other known system in the market as of 2008-98. Liveview is useful to shoot architecture, land scape, and products.9. RAW file format is supported well by the major commercial software.10.CF slot and SDHC slot actually helps.  It did not occurred to me until I run out of memory card on the locations, and had to run to the nearby local drug store.  At least they carry cheap SD/SDHC at any large drug store chains, and it is a lot easier to find those store than locating nearby large electronic store...11. Battery Life is excellent, it will easily cover half day events with nearly a thousand of picture even with taxing RAW + JPEG shoot.12. Due to its weight and form factor, it is a lot easier to balance with long heavy lens.13. When used with L lens, it is somewhat comparable with expensive medium format digital back.14. Silent shutter mode is somewhat useful.Now here are list of disadvantage.1. It is slightly new form factor for Canon, and there are chance you had to send it to the warranty repair if you got the earlier production model.2.There are something wrong with design of wireless port cap.  It is relatively easy to lose one since it sometimes fell off with limited torque applied.  I lost several of them already... though I stocked half dozen cap after I lost my first cap.3.  It is heavy and bulky.  Thus some times not a ideal for certain situations.4. Compared to Nikon D3X, it has slightly poor SNR on the third party software RAW processing software, so certain journalistic style shoot might suffer.  If you shoot in the studio controlled lighting environment, that should not be a much of issue.5. Many of RAW development software is actually more well tuned for Nikon,  This might to be due to the amount of info Canon release to the third party software developer.6.  It is hard to justify its price for the many of users.7.  However everyone else claimed, it still can not replace medium format digital camera.  Lens resolution and clarity of images is not there yet.  Of course, that is when looking at 1:1 images side by side.8. Silent shutter mode is not that quiet compared to some of the most quiet camera in the market.  So, application such as close quarter Jazz or Classical music shot are still off the table.Overall, I will recommend this camera to who,If you are photographer that shoot tons of weddings at high fee structure, you should get one.  Otherwise, EOS 5D nowadays makes very attractive choice.If you are commercial photographer with clients and sufficient invest in Canon system, why are you waiting?If you are amateur with deep pockets, this is a camera to get, and impress your photography teacher!I will not recommend to someone,Trek photographer who need lighter weight gear or those wild life photographer needs of faster fps should consider other offering from Canon.Any journalistic style should consider 1D MK3 first unless you shoot tons of interview photo.Shooting for hobby or fine arts purpose should really consider 5D mk2 before taking financial plunge of 1DS MK3If you think it is heavy for you, do not get it.  It will be too heavy for you after few hours of holding camera.", "Date": "February 24, 2009"}, {"Title": "The Revolution Continues", "Author": "J. Howard \"Blind Boy Photog\"", "ReviewID": "R3T050IY07HDYR", "Overall": "5.0", "Content": "In every way Canon has done it again. This camera is lighter, faster, and produces bigger, better files than the mk2. If you make a living shooting pictures, buy it, you may never have to upgrade again. If Photography is your hobby or passion and you can afford it this should be your last camera.My five favorite improvements in no particular order.  Faster and more accurate autofocus  Less noise at high ISO making 3200 a viable choice.  File quality that beats many 22MP medium format digital backs.  Live preview, it's cool, fun, and useful.  Improved handling due to lighter more balanced feelYes I know number three will get me in trouble but the price, faster handling, and much broader lens selection make it great choice in the 22 to 30MP range. The 39MP  backs are clearly more detailed and smoother but this Canon will push many a P25 and H3D-22 onto ebay in the next year.Canon has set the standard again the mk3 is truly brilliant. The only better deal may be the well cared for used mk2's easily found on ebay.I just wanted to add a comment regarding cost. Now that my second mk2 has found a new home I can evaluate the true cost of an $8000.00 dslr. I paid $7300.00 each for my mk2s. Sold them for an average of $3620.00 making the cost if you add in an extra battery and firewire cables for three years around $4000.00 each. I anticipate this kind of return for the mk3s and considering they will work in a high demand professional environment for three years or so I'd say the mk3 is a ridiculous bargain.By the way both of my mk3s have performed flawlessly and were spot on with regards to viewfinder alignment.", "Date": "January 16, 2008"}, {"Title": "Truly spectacular", "Author": "Gerald \"polemicallycorrect\"", "ReviewID": "R17V1SD0H9RBO2", "Overall": "5.0", "Content": "I've had the 1Ds Mark III for over a month now and have shot in churches, outdoors and in the studio. It excels in every environment. The first thing you'll notice is the immensely big, bright viewfinder. It barely feels like looking through something! The LCD display is very good as well. Build is very solid. I've used it with the Canon 85mm 1.2 II L and the Canon 70-200mm 2.8 IS L. Both deliver outstanding results and are hand-holdable. The new automatic dust-removal system is very good, leaving only a couple of spots against the blue sky when shot at small apertures, when there used to be countless on the 5D. Image quality is fantastic, and the images are huge, making cropping while retaining a big image easy. The menu system is very easy to operate, custom functions offer a plethora of options. Shutter sound is wonderful, and at 5fps very fast for 21MP. It's expensive for sure, but definitely worth it.", "Date": "January 24, 2008"}, {"Title": "SeattleAmateur", "Author": "MarkABee", "ReviewID": "R2480NLPH4RYB3", "Overall": "5.0", "Content": "Canon EOS 1Ds Mark III 21.1MP Digital SLR Camera (Body Only)I am an advanced amateur and was using the 5D Mark I for the past 2.5 years.  I loved the images but hated the focusing.  In any kind of shot that involved focusing on a subject moving at walking speed, (or less) the 5D would fail to snap into focus.  The second shot would never be in focus.  In lower light situations (typical interior lighting, not candles), the 5D was even worse. Sometimes the focusing would force the lens to go to maximum close/distance as the 5D hunted for focus - even when the lens was basically in focus to start - this was guaranteed to miss the shot.The 1Ds, on the other hand, is great at focusing.  Super fast, subjects snap into focus quickly, and focusing continues onto 2nd shots and more.  And it will focus on lenses that are 5.6 and above - something the 5D did not do (try a telephoto with a filter or extender).  From what I can read, the new 5D Mark II has basically the same focusing system so it is not improved in this area.What kind of shots am I talking about?  Shots of people,kids, basketball, soccer, bands, parades, candids on the street, street life, travel, animals in the wild or at home - I would include most everything except still life/landscape photos. Generally any shot you would not be making with a tripod is a situation where the 1Ds' focusing is vastly superior to the 5D.High resolution is great.  But out of focus shots are not keepers.Finally, the 1Ds Mark III is much more solid than the 5D - everything from the controls to the shutter sound.  I love this camera.  My only wish is that it were the same size as the 5D since most shoulde camera bags don't account for its height.  I don't mind the weight since the the weight of the lenses I am carrying is much heavier than the camera.", "Date": "February 21, 2009"}, {"Title": "Best camera for *my* needs, but keep in mind...", "Author": "R. Kaufmann", "ReviewID": "R2YZR5GEA4MQ5V", "Overall": "5.0", "Content": "I was lucky to get my 1ds III from Amazon in December, and have pressed the shutter about 5,000 times.  (I'm a hobbyist, albeit an insane one.)Like many others, I abandoned the Nikon camp when there was no sensible upgrade to the D100 at the time the 20D was launched.  With the D300 and D3, Nikon now has gotten a lot better, and depending on your needs, one company may be better than the other. In particular, the 1ds III is better at studio photography and perhaps tonal range than the D3.  The D3 is much better at low light photography, and is better for sports photography (especially sports photography that doesn't demand the highest resolution).But, if you're already invested in one manufacturer's lenses, don't switch.  Both Canon and Nikon will continue to leapfrog each other for the foreseeable future, and ain't life grand because of it!Now to specifics:1. As impressed as I am with the resolution of the 1ds III, I'm even more impressed with the dynamic range.  You should absolutely only shoot RAW -- never JPEG!  And make sure your workflow is 16 bit Prophoto; I use Lightroom and Photoshop CS3.2. Spending $8K on a body and using cheap lenses is silly.  I use the 16-35 II zoom, the 24-70/2.8, the 135/2.8, and the 100-400.  I also enjoy the 50/1.4 and the 24/2.8 Tilt/Shift lenses.3. Buy a decent tripod and perhaps monopod.  Gitzo carbon is my favorite, but they're a bit pricey...4. Buy a UDMA compact flash card.  I got the Crucial 8Gb Lexar Media Professional Udma 300X Compactflash Cf8Gb-300-380, and then the Sandisk 8GB EXTREME III SDHC SD Card Class 6 (SDSDX3-8192, Plastic Case) for the SD slot.  For me, the SD card is for overflow.  You should also get a CF UDMA reader.Suggestion for Canon: I'd really like a mode where pictures are striped across the two cards (shot one to CF, shot two to SD, shot three to CF, ...).  This would give a strong measure of protection against one card failure (you'd still have half your shots) without sacrificing space.  I bracket a LOT, and a typical day of travel photography will fill both cards!5. The leads to the next point: buy an extra hard disk to take on the road.  I use a 320GB 2.5\" USB drive.  I download shots to my notebook, do a little editing in Lightroom (tossing the undeniably bad shots), then back up the day's work to the external hard disk.And I'll echo what another reviewer said.  If you take a lot of pictures, think of this camera as a three year investment.  If you take care of it, you'll get a good resale value -- and instead of an $8K sunk cost, you can think of it as a ~$1500/yr \"camera tax.\"  ($8000 - ~$3500 resale - 3*$1500.)  Cheap, huh!Finally, I get a lot of enjoyment out of my 1ds III.  It is one of my truly prized possessions, and has greatly improved the quality of my photographs.  I bet it does the same for you.", "Date": "December 31, 2007"}, {"Title": "Canon's Flagship Camera", "Author": "C. Brown", "ReviewID": "R3F8JB92D8TYV0", "Overall": "5.0", "Content": "I've used several Cameras from Canon, including the F-1N, 10D, 20D, 1Ds, 1Ds Mark II, and now the 1Ds Mark III. This camera will provide you with the tool to capture great work, but you'll need the best lenses. Cheap zooms or cheap prime lenses will produce chromatic aberrations that will make the money spent on this camera a waste. In other words, the resolution of the sensor is so high it exceeds many lenses currently on the market.Why would someone buy this body instead of the Canon EOS 5D Mark II? Because of the build of the body, the durability of the shutter and battery life. These three factors provide the user with a camera that can withstand the extremes of nature while working.This camera is heavier than the 5D, even if the 5D has the optional grip, so if you don't like a camera with mass, this camera is not for you.I have used this camera in the rain, sleet, snow, and the heat of summer. It has performed flawlessly. The resolution provides enough data for beautiful 24\"x36\" prints.Yes, I'm a professional photographer and am immersed in the software and hardware to make photographs. I'm aware that there's much more to photography than the camera body, but it's the camera body & sensor that's the cornerstone for great images.", "Date": "January 24, 2009"}, {"Title": "Canon EOS 1Ds MarkIII", "Author": "Steven Krouse \"KHStudios\"", "ReviewID": "RPVBCRBFH23ZI", "Overall": "5.0", "Content": "Excellent tool for the professional photographer. As a pro with years of experience using 1D series cameras, moving up to the 1Ds was effortless but extremely rewarding. Was making money off of prints from the camera within 72 hours. Build quality and image quality is exceptional. Responsiveness for action sports is accurate, fast and very reliable. Even in low light situations where I am using it at ISO 3200 and f2.8 and wider so that I can use shutter speeds at 1/500 and 1/1000 in high school gymnasiums and pools. So far, studio shots have been blowing me away with the image clarity, contrast and color - especially with L series lenses. Just wish I didn't have to pay the price of a used small car for it and it's impact on increasing my equipment insurance.", "Date": "March 8, 2008"}, {"Title": "The best Canon has to offer", "Author": "The Camera Eye \"rfishjr\"", "ReviewID": "R1R48TIRM3TV55", "Overall": "5.0", "Content": "Ok, the price of this thing is absolutely ridiculous.Yes, Canon was now nice enough, only a little over a year later, to release a lower level product with equal Megapixels (the forthcoming 5D mark II), and do serious damage to my asset value (this camera). Thanks.My previous high end camera is the Canon 5D.It is clear to me that, other than the improved sensor, which gives the latest chip (DIGIC IV), higher Megapixels (21.1) and higher ISO (6400 natively), a very slight speed improvement (3.9 fps) and a bigger, nicer screen on the back (3\", 1 million dots), it's pretty much the same camera as the 5D. Thanks to the Megapixel war, Nikon & Sony have turned up the heat on Canon a bit, so they went higher in those specs than they probably would've otherwise. This is great for the consumer, if those are the only specs you're looking at. And hopefully it will eventually obliterate Canon's ability to put pricetags like the one on this camera on anything (see my first sentence).Of course, I did BUY this camera, nevertheless. Because I could afford to do that. If you can't, then look at what you can, because a lot of insane specs sit at much lower price points.With that out of the way, let's just view it from the perspective of a mid-range user that might want to move up - someone with a 5D or a 10-50D, who might be trying to decide what else he will get from this camera versus just going for a 5D mark II instead, because either is a very valid option: - 45 point AutoFocus. What's so great about this? Let's say you've seen it, and you realize it's a bunch of little points congested in the center instead of the 9 on the 5D mark II and their 6 \"assist\" points. That's just a lot of marketing - 45 is a much bigger number and makes it look much better, right? No, not really. It really IS that much better. I do a lot of bikini/fashion/glamour photography, and therefore I shoot a lot of shots that are of one very, curvy female (ok, yea, I know, I know - it's tough. But SOMEONE has got to do it, and I'm taking the bullet for you guys on this one, OK? LOL). Anyway, as you might realize, a very or at least somewhat shallow depth of field is frequently, in fact is most often, desirable for these types of shots. Curves create a complicated task, and the truth is, the Automatic choice of focal points on the 5D gave spotty results without VERY strict attention to focusing. Consequently, I gave up on it, and set my focus to the Center point and used focus/recompose. This works great most of the time. If the Depth of Field gets TOO shallow, you have to be VERY precise when using this method, which gets very tiring, on both your concentration and your hands/body. However, with the 1Ds Mark III, the advanced AF can be set to automatically detect, and it gives excellent results, with a very low mistake ratio. In observing the points it chooses while I'm shooting, it appears to me that it is very good at recognizing contours, and subtle depth differences, and this is where it achieves it's greatest advantage. - Focal performance with high end lenses. L lenses perform better with any Canon camera. Even moreso with this. FAST lenses, in this case f/2.8 or faster, perform especially well with this camera. This still ties into the focusing system, yes, but it is worth noting that the better lenses take yet another performance leap on this body. This is no accident, rather by design. I say you lose part of the reason (not all of it, make no mistake) for having the L glass if you don't have a high end body. - Dual Memory Cards. Yea, it could just as well be two CF cards instead of a CF and an SD, but whatever. I buy a lot of memory cards anyway. And this is more a convenience than anything. It's nice to be able to write large JPEGS to one and RAW to the other. And if you are shooting with someone who needs the photos immediately and HAS an SD card, this could be a huge plus. It, of course, accepts SDHC also. - Greater flexibility in writing JPEG files. If you shoot mostly or only RAW, this might not matter. But, the fact is, while the 5D and the 10D-50D models allow to write two different quality levels at each JPEG size, this camera has a separate \"quality\" level that ranges from 1-10, much like Photoshop's 1-12 range. When you look at Canon's site and see the estimate for JPEG's of 6-8MB (it was something like that), it was only an average estimate. They've since removed it (probably because the amount of possibilities are too great to post). I have set mine at the maximum quality of \"10.\" My JPEG's are generally between 10MB-13MB in size. One note, however, as I attempted to photographer a fast moving stage event, and was taken back that I had problems with lag in shooting quickly, as it is advertised at 5fps. I believe you would need to step down to a 7 or 8 quality, whatever their test for \"average\" is, to achieve these speeds along with it's buffering ability. I used a Sandisk Extreme III card. Since that speed of card has performed exceedingly well on a 50D that I own, at a pro football game, I think it's safe to say the card wasn't the factor. I was blazing off shots on the 50D at 6.3fps for several seconds and it hardly went into using the buffer it was so fast. The \"writing\" light was barely ever lit whenever I checked right after a long flurry. And that is a 15MP camera - it was set on Large/Fine, which are about 6MB shots, in this case. - Best weather sealing is on these bodies. If you need it, it's worth it. I think the others are fairly resistant anyway, but the comfort of not worrying much about conditions is nice. - The display system on the larger body. Less information is pushed up to the top. The display on the bottom portion is easier to look at, and it's nice to have the memory card info visible down there. - The LCD changing of shooting modes. This might not be something better to some, because if you're used to the other Canon bodies, it can be a bit off-putting at first. But once you get used to it, it's definitely better. Moreover, the simplicity of having the modes you need and no \"dumb user\" modes, which the 5D had largely eliminated while keeping the dial anyway, is still nicer on here. (e.g. - why do I need a \"Sports Mode\" when I can set my focus to AI Servo, and then set a high shutter priority speed, and make ISO adjustments as needed to accomodate light changes - or just shoot Aperture Priority with the lens wide open and make ISO adjustments? Whichever). - Specifically if comparing to one of the new 5D's, my bet is that there will be a very noticeable lag in the 5D mark II compared to this camera, since it is only running one processor versus two on this camera.This is definitely the best of the best.", "Date": "October 22, 2008"}, {"Title": "More detail than a 20x24\" Polaroid", "Author": "Philip Greenspun", "ReviewID": "R1OFKQASTV2XNR", "Overall": "4.0", "Content": "A friend has been doing portraits with a special 20x24\" Polaroid camera for many years.  Polaroid has announced that they are stopping production of the film, so we decided to see if an image from the 1Ds Mark III could be used as a substitute.  We created some images with the 1Ds Mark III in the same studio as the Polaroid, using some basic Canon lenses, such as the 50/1.4.  We sent the RAW files off to Pictopia to have 20x30\" prints made.  The resulting images didn't have the interesting artistic variation of the Polaroids, but they were more detailed.The image quality of the camera is undeniably great.  The user interface is more complex than the Nikon D3, for example, with deeper menus.  Canon gives you dozens of options for what to do with the two memory cards, for example.  The camera sorely needs a \"help\" button.What else could this machine use?  A built-in GPS and built-in WiFi.Do you need it?  Not unless you are going to make some truly huge prints and you are intending to be disciplined about tripod and lens.  Pictopia made us some 20x30\" prints from the EOS 5D (13 MP; one quarter the price) that looked great.", "Date": "January 27, 2008"}, {"Title": "Just what I needed.", "Author": "T. Foteh", "ReviewID": "R2ENURHNZLA8PK", "Overall": "5.0", "Content": "I have a 5D that has been moved to backup duty since acquiring this beauty. The problem I was having with the 5D was that many of my images were getting rejected by the stock agency I shoot for due to excessive shadow noise. I spent hours cleaning up noisy shadows in post, and still got some rejects. Not so with the 1Ds. It produces absolutely clean, perfect, huge files straight out of camera with little or no post work. Even when you turn on the extended ISO and crank it to \"Hi\" (essentially ISO 3200), The images it produces are just outstanding. It may be a bit big and heavy for the casual user, but pros shouldn't be bothered by it. It is actually not much bigger or heavier than a 5D with a battery grip installed. I like the live view when shooting macros on a tripod. It really helps get the focus just perfect. Battery life is awesome. I shot about 1800 RAW files over a 4 day shoot and still had juice left without charging. Bottom line, if you have the cash, and want the best camera this side of a hasselblad H3d-39, then go for it! You can see some images that I shot with this at my site [...] (the battleship was shot with this and the 16-35)", "Date": "June 24, 2008"}, {"Title": "Solid and Reliable Thing of Beauty", "Author": "Jared Haller \"Jared Paul Haller\"", "ReviewID": "R1ZWCNDOXNXHM9", "Overall": "5.0", "Content": "I've owned my Canon EOS-1Ds Mark III for about a year now, and while I felt some remorse at first after having spent almost $8000 to purchase it, I can now say that it was worth every penny.  You can read the camera's specifications at Canon's Web site, so all I'll say here is that this camera is a joy to use and utterly reliable.  I've never owned a finer piece of photographic equipment.  That having been said, there is one thing about which you should be aware before purchasing this model:  This camera's 21.1 megapixel sensor demands the finest lenses.  Some of my old L-series zoom lenses (that worked well with my EOS-5D) are just not sharp enough to use on this camera.  In other words, be prepared to spend even more money if you don't own the newest EF prime lenses.", "Date": "April 23, 2009"}, {"Title": "GREAT camera, stinky controls", "Author": "Ed Freeman", "ReviewID": "R3K1AS4L0RASS", "Overall": "4.0", "Content": "It's definitely an improvement over the 1Ds Mark II, which means it's the best 35 mm format digital out there, period. Auto dust removal is a huge plus - FINALLY - and picture quality, especially noise suppression, is noticeably improved. Downside: Canon's firmware and software and control buttons and dials, which have always been needlessly convoluted and confusing, are, if anything, even MORE convoluted and confusing on this model than the Mark II. How anybody could screw up anything so simple so thoroughly is beyond me. Oh, and another thing - what they call ISO 100 is more like ISO 64 - just so you know. Overexpose everything a half or 2/3 of a stop to compensate. But after all that is said and done, it does make absolutely gorgeous pictures - nipping at Hasselblad's $35,000 medium format heels. Go ahead, mortgage the house and splurge - you won't regret it.", "Date": "June 8, 2008"}, {"Title": "A Technological Masterpiece (!!)", "Author": "Evelyn", "ReviewID": "R3RUKZRT0QAP6C", "Overall": "5.0", "Content": "I've had this camera for several weeks now and have been consistently been amazed by its capabilities. The image quality is extraordinary. I've been using it with a Canon EF 16-35mm f/2.8L II USM Ultra Wide Angle Zoom Lens and have yet to be disappointed. The Mark III is complex enough that it prompted me to read the instruction manual, as well as another book (\"Magic Lantern Guides: Canon EOS-1D Mark III EOS-1Ds Mark III\"), from cover to cover - something I've never done before. The good news is that the Mark III is so coherent and well designed that it only takes reading the manual once to sort out how to make the most of all of its functions. Overall, this is an extraordinary camera.", "Date": "July 1, 2010"}, {"Title": "most versatile camera", "Author": "George", "ReviewID": "RON9DEUWV90IF", "Overall": "5.0", "Content": "The ultimate purpose for a camera is to take photos.  No camera except perhaps the Canon 5D II or a comparable Nikon or Sony DSLR will take better photos in more situations than the 1Ds III.No other kind of camera will do as much as well.  Some, such as medium format cameras costing many times more, will take slightly better photos in a studio and for some landscape or still subject shots but canot be used to shoot anything that moves or needs very wide or strong telephoto.  A Leica rangefinder is more portable and competes with about everything for IQ but is only useful for certain shots.  A point and shoot is very versatile but lacks a comparable IQ.  A good micro four thirds is also very versatile but with slightly less IQ.  No other camera will focus faster or offer a better range of lenses.  Full frame DSLRs can be used to take very wide landscape shots, great shots of kids at play, sports photos, animals at long distances, flash shots indoors, night scenes with wide or strong telephoto, versatile architectural shots, etc.  No other camera offers a better range of filters and accessories.  Canon and Nikon offer a range of zoom lenses that can take every kind of shot, not just the ones that fit a fixed lens.The !Ds III has a lot of positives.  Great IQ.  Very rugged and reliable, maybe more so than any other camera.  Works well with Canon flashes.  Unmatched choice of lenses, many best in class.Here are the negatives I have noted after three years of use:Canon color is excellent but Leica may be slightly better (I don't know about Nikon -- it wasn't a player in this space until I already owned a set of Canon lenses).Focus doesn't work well with some wide lenses.  It is dead on with the 16-35 and the 15mm fisheye but not with the 14mm f2.8 II (the original 1Ds had better auto focus).It is heavy.  A pack with the camera and a complete set of lenses can weigh 30 pounds.  This camera is not made for walking around town.The comparable 5D II is 1/3 the cost and uses the same lenses.  (The comparable Nikon costs $2,000 more, the comparable Sony is about the same cost as the 5D II but offers fewer lenses).The weakest Canon lenses are the wide zooms.  They are very clear in the center but soft in the corners.It lacks an articulating screen, which is useful for shooting the best candid shots of people.But these are minor quibbles.  If you want the best general purpose camera, the clear choice is this, the 5D II or a comparable DSLR.", "Date": "December 27, 2010"}, {"Title": "Amazing camera.", "Author": "JHill \"Studio 20/29\"", "ReviewID": "R2CZKCIXAIDG72", "Overall": "5.0", "Content": "This is the best 35mm digital SLR I have ever used.  The portability of a DSLR with the image quality of P22 maybe even P32 back and with out the hassle.  Highly recommended for the Canon user that can afford to make the jump.  Kudos on shipping as well, got it a day early, was one of the first - thanks.", "Date": "March 29, 2008"}, {"Title": "some part of malfunction", "Author": "sophie1128", "ReviewID": "R3SYBVEZPBF3OC", "Overall": "1.0", "Content": "i bought it from longsell,with some part of malfunction, but he did not tell me.This is not a pleasant experience.", "Date": "November 3, 2013"}, {"Title": "ooooooohhhhhh wow", "Author": "S. McMurphy \"stmphoto\"", "ReviewID": "R34OBIO86Y6BRD", "Overall": "5.0", "Content": "So got this little baby a few days ago... it arrived right on time and was well packaged. Took it out for a little test spin the next day... all I can say is oh my god wow this thing is the best camer I have every had the privlige of using! I had the Canon Rebel XTi, the 1D mark II, and now this camera... it is by far the best camera I have ever used.... it takes fantastic photos (exposures were so good that they required minimal post production work), great color, responsive, and long battery life. This will be my primary camera for years to come... it is great! if you can stomach the price, you will not be disapointed one bit!!!", "Date": "October 2, 2008"}, {"Title": "Exceded my Expectations", "Author": "J. Rock", "ReviewID": "R3PTIOB5KHM9HJ", "Overall": "5.0", "Content": "Paired with the 24-70mm f2.4 L this is perfect for portraits. I can't imagine the picture quality with the 80mm L lens but, it must be extremely amazing.", "Date": "November 6, 2010"}, {"Title": "Camera design has serious flaws for the price", "Author": "Frequent traveller", "ReviewID": "R1F6Y9TBR4NQ0C", "Overall": "2.0", "Content": "One would reasonably have expected an $8,000+ camera to be well designed and well engineered. Sure, it is \"Ok\" but \"ok\" for a much lower price.Specifically:1. It has an unacceptably high incidence on \"Err99\" error codes which disable the camera altogether until it is sent back to Canon for repair.2. It has an unacceptably high rate of viewfinder misalignment incidences where the viewfinder shows the horizon to be horizontal but the horizon in the image taken isn't.3. It fails to operate the programming of Canon's own 580 EX flash (the non-version-II).4. Resolution may well be 21 megapixels, but that is only 25% more in each the two linear dimensions compared to the 5D that costs a fraction of the cost. (square root of 21/13).5. The image \"noise\" at high ISO settings is much higher than that of the much lower priced 5D. This is inevitable since the imaging array of the 1Ds has more pixes within the same area, so each pixel is smaller. For high ISO settings I have to revert to the 5D. This limits the camera's usefuleness to bright light situations only.6. The artificially inflated price (by limiting supply, in the classical supply and demand argument) is outrageous. Canon needs to be taught some humility and customer-relations as soon as other brands offer similar full frame resolutions.", "Date": "February 20, 2008"}, {"Title": "Flawed focus point layout", "Author": null, "ReviewID": "R101DBUFYKLEZU", "Overall": "3.0", "Content": "Compare the 1D vs the 1Ds focus point layouts and you'll see that the perimeter points of the full frame 1Ds aren't far enough from the center to be of much use.1D Mark 4[...]1Ds Mark 3[...]The full frame 5D models have the same flaw.  Track moving subjects using a perimeter focus point, and you'll still have to throw away many pixels later cropping to a pleasing 2/3 composition.", "Date": "April 15, 2010"}, {"Title": "Great camera but no review yet by DPReview", "Author": "Amitava Chatterjee \"Chats\"", "ReviewID": "R3NRMYNQ04XRNY", "Overall": "5.0", "Content": "Great camera. Wonderful images. Fast, responsive, wonderful viewfinder. Good dynamic range. I wonder why amazon.com's dpreview.com web site has chosen not to publish their review of Canon's flagship despite being announced over a year ago.", "Date": "August 17, 2008"}, {"Title": "Short test", "Author": "Aaron Farrag", "ReviewID": "R15G0CQ6BEC9A", "Overall": "5.0", "Content": "I got try the camera for a few minutes in Germany today and I am absolutely amazed of how good it felt in my hands! I thought it might be heavy and bulky, but not at all, it is very ergonomical and I didn't find it that heavy either. The funktions are almoast endless, you could spend 2 days just getting to know all the things the thing can do. the 5 pics a second at full resolution is also pretty impressive. I am already sure that I want to be one of the first to call this Camera my own! I can't wait for the release!", "Date": "October 30, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "21.1-megapixel full-frame CMOS sensor\nLarge 3.0-inch LCD display with Live View and seven brightness settings\n5 fps at shutter speeds 1/500 second or faster (for bursts of up to 45 Large/Fine JPEGs or 15 RAW images)\nsRAW mode; 35-zone metering system; 45-point AF; integrated Self-Cleaning Sensor Unit\nPowered by LP-E4 lithium-ion battery pack; stores images on CF, SD, or some SDHC memory cards\nPowered by LP-E4 lithium-ion battery pack , stores images on CF, SD, or some SDHC memory cards\nsRAW mode , 35-zone metering system , 45-point AF , integrated Self-Cleaning Sensor Unit\nLarge 3.0-inch LCD display with Live View and seven brightness settings\n21.1-megapixel full-frame CMOS sensor\n5 fps at shutter speeds 1/500 second or faster (for bursts of up to 45 Large/Fine JPEGs or 15 RAW images)", "Name": "Canon EOS 1Ds Mark III 21.1MP Digital SLR Camera (Body Only)", "ImgURL": "http://ecx.images-amazon.com/images/I/51oLy4xwFqL._SY300_.jpg", "ProductID": "B000V5LX00"}}