{"Reviews": [{"Title": "The Poor Man's Digital SLR", "Author": "Nick Tropiano", "ReviewID": "R3NA3BKVPOJMNK", "Overall": "5.0", "Content": "Dumbfounded by the deluge of digicams? Spending more time obsessing on which digicam to buy, more than you did buying your house?  Like the fact the users seem to fall in love with this little wonder but are put off by the fact it's only a 2 megapixel camera? Don't worry about the megapixels. The Lumix FZ1/FZ2 is rightfully developing quite a cult following with consumers, photography enthusiasts, and even professional photographers (read \"FZ-1: A Pro-Level Digital Point & Shoot\" by Frank Van Ripper from the Washington Post available on-line at CameraWorks.com) If you can live without more megapixels, this compact camera has so much to offer.  2MP is more than you need for PC viewing, e-mail, and the web. It can and does provide sufficient resolution to make excellent photo-quality prints up to 5X7, and supposedly makes nice enlargements up to 8X10. This is a compact, responsive, point and shoot camera with a robust feature set - including a capable burst mode (great for sports action shots and not found on cameras in this class), and true TTL framing via an EVF. There's enough to this camera to satiate the enthusiast - night portrait, portrait, panning, \"normal\" mode etc., and also has a fully automated mode if you want to let the camera do all the work, and just \"focus\" (pardon the pun) on composition. But what sets this digicam apart is the big zoom fixed Leica lens. It really is a word-class piece of glass with remarkable specs, especially considering its size. Combine this remarkable lens with an effective image stabilization system, and you have a \"different animal\" all together. This is a unique versitile and fun digicam that has  so much more than others in its price range. Its limitations (weak pop-up flash, EVF cuts out in low light, noise above ISO 200, etc) are really more attributable to its class ($300 point and shoot) than the camera.  However, it is capable of producing remarkable images, and once you start shooting with its high quality lens with an IS system, you'll never want a camera doesn't have them.  Plus, it is an excellent value. If you don't do a lot of enlargements or cropping in a photo editor, I would recommend the FZ1 in a heartbeat over any other camera, regardless of the number of megapixels, in its price range, and most cameras that cost two or three times as much.Now a word about megapixels. A megapixel is 1 million pixels (they're the little squares that make up the image...). So, this camera produces images that are 1600 pixels wide by 1200 pixels high.  1600X1200 = approx 2 million, hence 2 megapixels. Since going digital, I find that I view 90%-95% on my PC/laptop monitor. It's convenient, and priting them all would cost a small fortune, since now that I can snap away with wreckless abandon since film (for me) is a thing of the past. (I still use a lab to print. I would rather \"borrow\" the lab's $200,000 printer than own a $300 dollar consumer photo printer, plus it costs much less per print when you factor in the cost of the printer ink...) Okay, so my laptop's highest 32 bit resolution setting is 1024X768, the resolution of the FZ1 (1600X1200) exceeds that. Point is that since I view most of my pictures on a PC now, I gain NOTHING from a higher resolution camera with more megapixels in most circumstances. The 5% to 10% of pictures I print, I usually print at standard 6X4. Anything over 200 pixels per inch (ppi) is considered \"photo quality\" for printing, 150 ppi is considered \"acceptable\".  As you get beyond 250 ppi on a print, the differences in resolution from a normal viewing distance are virtually invisible to the naked eye. IMO, I would fail a blind test, probably, if asked to guess the resolution of a picture between the 200 and 250 ppi range. 1600 (pixels)/6(inches) = 267 ppi, exceeding 250 ppi in length on a 6X4 (Note: technically, this formula isn't entirely accurate but is close enough for government work, and serves better as a quick illustration...). A 5X7 is 228 ppi, and an 8X10 is 160 ppi. Hence, this camera produces \"photo-quality\" images up to 5X7 and \"acceptable\" resolution up to 8X10. Most photo editors worth their disk space, like Photoshop, can resample images using bicubic interpolation to add pixels and boost resolution for the (very) occasional larger print. A very good product for this is Qimage, a free trial is available, and it's quite inexpensive to purchase. A hot shoe would have been nice but my understanding is that a \"digital slave flash\", which are quite reasonably priced, like the Vivitar AF200, work very well when you need a big flash.  Now consider, not a \"scientific survey\" but 3 or 4 folks I know own 3 to 5 megapixel cameras.  (The 5 megapixel guy has a 10X optical zoom camera, made by one of the usual suspects, that cost 2X as much as the FZ1, but he doesn't even attempt zooming out beyond 5X without blurring the image, since his camera doesn't have IS). None of them kept their cameras on the highest setting thereby \"using\" all the megapixels. Why? Because the larger image files cut the amount of pictures they can store on their flash cards in half, their camera annoyingly \"locks up\" for a couple seconds while it writes a larger image file (often very frustrating), and they really can't notice a difference in quality on their prints, and they view most of their pictures on their PC. Let's say you have a 6 megapixel camera that had a cheap lens that introduced all sorts of distortion and a processing engine that rendered inaccurate colors. What would you get? A crappy picture with distortion and inaccurate colors rendered in all their ugly glory in high resolution. The FZ1 has the \"best\" lens on the market, and an excellent, innovative processing engine that provides \"enough\" but not \"extraneous\" megapixels to provide photoquality resolution for 99% of \"real world\" viewing formats. I believe that camera companies are exploiting the conspicuous consumption factor of camera consumers who wear their camera around their neck like jewelery. (The \"name\" + many megapixels = \"the guy\" equivalent of a pearl necklace to wear on a night out). It is therefore a great way for the camera co's to (finally) introduce planned obsolence into their offerings, dispensing with the days when folks held on to their cameras for decades until they finally died. I'm glad at least one manufacturer withdrew from the \"great megapixel wars\" and offered an excellent product based around real user needs and the true advantages of the full range of available technology - like IS and its processing engine, and did so at a very reasonable cost, instead of being just another combatant exploiting one aspect - \"the megapixel\", and the conspicuous consumption factor.  Get the picture?", "Date": "July 7, 2004"}, {"Title": "Great Camera", "Author": "paj \"pajallen\"", "ReviewID": "R8E6PAWH9ECAY", "Overall": "5.0", "Content": "Don't fall for megapixal envy!  A 12x stabalized optical zoom on this 2.1MP camera will out perform a 4MP camera cropped to the same field of view.I've used three digital cameras; a Canon A40 (2.1MP), an Olympus D-40 (4.0MP) and the FZ1.  It is no contest the FZ1 takes the best pictures, has the quickest shutter response, the most accurate color reproduction and an amazing lens that allows shots the others cannot dream of taking...Manual controls would be nice, but not missed much at all. Once again, you cannot crop a 4 or 5MP image to the same field of view as this camera at 12x optical zoom and achieve the same quality.  If you are not making posters, 2.1MP is plenty.You won't be disappointed.", "Date": "October 6, 2003"}, {"Title": "EASY QUICK AND PAINLESS DIGITAL PHOTOS", "Author": "Sir Christian \"christian2010\"", "ReviewID": "R5ZDKZHJYOD5T", "Overall": "5.0", "Content": "This is my first digital camera, having used a Kodak Advantix with some zoom capability for the past several years. The cost of film, development, lost pictures and negatives made the purchase of a digital camera a no brainer. However, the one thing lacking from most digital cameras I had seen was an optical zoom. Digital zoom is almost meaningless, so don't be fooled by ads such as \"3x Digital Zoom\" which doesn't do much alone. I researched various other models, including the Olympus zoom models, but chose this camera because of the terrific price, quality glass Leica lense, compact size and the unbelieveable 12x optical zoom with picture stabilization, which is necessary to take non-blurry pictures at full zoom. The only concern I had was some negative comments by Amazon reviewers regarding low light photos. The first thing I did when I received the camera was take some photos of people in low light conditions at distances over 10 feet with the flash on. I discovered two things: (1) The pictures came out fine. (2) Hey I can use this thing without even looking at the instructions! It is a very simple camera to use, the screen menus are easy to navigate and activate options. The key theme here being the lack of frustration. There is a dial on the camera with little pictures or icons such as: a camera (when you are in normal photo mode), a car (to photo moving objects), a flower (to photo extreme close-ups), a person with a star above them (night photos). It can't be easier than that. Turn that dial to shoot video, press the shutter and you now are recording home video- as long as your memory card permits. I recommend purchasing a large memory card, 128 Megabytes is sufficient, since the 8 MB card that comes with the camera will only let you take about 30 high quality photos. The instruction manual is the best I have seen for an electronic product. Each page has a large heading at the top for the action you are trying to accomplish, i.e., take photos, record video, play back video, delete pictures. This makes it quick to find the topic. Underneath that heading are the simple steps, with diagrams showing you what to do. A positive of this camera is that once you learn how to accomplish an action, it is so intuitive you will likely never have to refer to the manual again once you have tried it.I was unconcerned about some mild criticisms about the lack of manual adjustability of certain camera-tech related functions, which I admittedly do not understand. I am not a professional photographer so I don't feel as I am missing anything, nor will you if you just take casual family, event and vacation related photos.The second day I had the camera I took it outside and shot some full zoom photos with the picture stabilization feature on. I was stunned by the detail, clarity and quality of the pictures I could obtain from objects at incredible distances. I cannot imagine ever using a camera without an optical zoom again. It simply opens up a whole new world of possiblilites for your pictures and frees you from the limitations of a regular camera, without the need to carry around a bunch of bulky zoom lenses like you might see a professional photogopher use.The camera seems very sturdy, comes with a nice strap, fine lense cap with its own micro strap connecting it to the camera if you like, to prevent it from being lost. I was initially dissappointed that Amazon only offered the black model, but it looks nicer in person then on the web page. I am now glad they only sell the black version because it looks sharp. If you want some technical oriented reviews, versus an anecdotal review, there are many fine detailed reviews, with examples of actual photos taken using the camera on the web. I liked the one at Digital Camera Resource.", "Date": "December 13, 2003"}, {"Title": "So Glad I Bought this Camera!", "Author": "snoopydance4me", "ReviewID": "RBZDDPXUCXX20", "Overall": "5.0", "Content": "I researched digital cameras for two months before deciding on this one. Even though this was my first digital camera, right out-of-the-box I was able to take great pictures. Now that I've had it a month, and am more familiar with the features of the various modes, I'm taking even better pics. Here's the most important tips I found:1. Megapixels are important for enlargements. But don't let the 2mp turn you off. If you're not going to enlarge your pics bigger than 8x10, YOU DON'T NEED ANY MORE! Don't make the mistake of paying for more megapixels than you will use.2. The lens quality is just as important as the mp, more than in my opinion, and it's often overlooked. The Leica lens in this camera is awesome! Great quality optics. 3. Optical Zoom, (not digital zoom), is important. This camera has remarkable zoom. You may want to get a tripod if you're using the full zoom on a regular basis, although this camera has a good stabilizer. As with any camera with such a long zoom, there may still be some evidence of shaking if you extend the zoom fully and do not use a tripod. As with almost any digital camera out there, the memory card included is practically worthless. I recommend one with 125mb or more. Other than this, the camera is near perfect.", "Date": "November 15, 2003"}, {"Title": "A great camera for non professionals", "Author": "Roger", "ReviewID": "R1MOKSJH1ZSSY2", "Overall": "5.0", "Content": "I wasn't sure that the 2 megapixel camera was adequate for taking great photos...but what it lacks in pixels it makes up in zoom.  My 3 megapixel Canon Powershot camera was great except at the beach when the kids where surfing 50 feet out in the water. Taking a picture with a 3x zoom left me lots of water and little of the kids.  But the Panasonic with it 12x zoom allows me to better frame the picture and leave out all of that water.  Printing an 8x11 photo is better with 3 megapixels but for a 4x6 or a 5x7 the 2megapixels is wonderful.  The Panasonic also has a 3x digital zoom...which I don't recommend using and I don't use it on the Canon either...the resulting pictures are too grainy.55mm filters fit right on the lens ring adapter kit that comes with the camera and a hood is also supplied.  The leica lens is fast even in zoom....it opens to a 2.8.  Some of the features that I don't see on comparably priced cameras include - image stablizer (crucial for 12x zoom without a tripod), electronic view finder along with an lcd display on the back of the camera (each can display camera settings and information)  a movie mode that allows capturing 10 frames per second with sound (the length is determined by the capacity of your memory card...I've taken up to 20 minute clips of a surfing competition), autoexposure bracketing with the exposure compensation predetermined by the user, shutter speed from 8 sec to 1/2000th of a second.There is one thing that bugs me and one thing that may bug others...my pet peeve is the menu system which uses a ring to navigate through the menu options...I have a dickens of a time trying to select options using the left arrow on the ring...what generally happens is that the ring behaves as if I have selected the up arrow or the down arrow.  Others may dislike the built in flash, good to about 7 feet....but I don't use it.  I bought this camera for outdoor use at the beach and park...and I'm completely happy using it there.", "Date": "April 18, 2003"}, {"Title": "Brilliant features over ride lack of flexibility", "Author": "Daniel M. Cohen \"filmmaker1225\"", "ReviewID": "R2TATKID71TZSH", "Overall": "5.0", "Content": "You can't beat this one for the money, ease of use and overall results. Yes, it's hard to focus in low light indoors, but you see your image immediately so you can retake and compensate accordingly. Yes, it's only 2 megapixels, but I want to see a technical review of Panasonic's new Venus engine that drives it, because I suspect it performs to near the specs of others 3 megapix sensors. Yes, you are limited because there's no manual focus. But the lens is stopped to F2.8 through it's entire range, there's image stabilization (that works!) and the 12 x optical zoom! It's small and fits well in your hand. The battery pack seems to last a long time.  I paid full price (449.00) willingly, so if you can get it for under four bills go for it! This is a lot of fun to use!", "Date": "April 10, 2003"}, {"Title": "Incredible Camera", "Author": null, "ReviewID": "RDDZS84ZSRJOD", "Overall": "5.0", "Content": "I made lots of research before buying this camera. I previously owned a Sony DSC-F707 which I sold because it was too bulky to carry around. The Sony was a great camera but I wanted something with a more powerful lens and an image stabilizer. The Panasonic was the only camera that seemed to fit my needs. I was hesitant at first because my Sony was a 5.0MP camera and the Panasonic only a 2.0MP camera. I read numerous reviews from other owners and researched websites like Steves Digicams, DC Resource and Megapixel.Net that spoke very highly of this camera. What I learned is that megapixels is an important feature to consider when choosing a digital camera, but there are other more important features to consider like the quality of components being used. This camera has a Leica lens. If you don't know anything about Leica, you should do some research and you will be amazed to know that Leica is a high end professional brand that is not cheap and considered one of the best in the world. The other item that stands out about this camera is the processor that converts the image to a digital image. This is a really important feature to consider because the processor is what determines how effective it is at converting the image to the original shot. This camera uses Panasonic's Venus image that does numerous functions at the same time which allows the camera to operate faster and smoother which is similar to the Digic processor on Canon cameras. This processor also increases image quality by 50%, because of this, the photos are far superior to any 2.0MP camera out there. The camera is extremely well built and very rugged. The photo quality from this camera is amazing, it honestly does not seem like a 2.0MP camera. The quality of the photos seems to close to a 4.0MP camera. The lens is extremely quiet and fast. The image stabilization works extremely well and allows you to take photos at full telephoto view without any problems. I highly recommend this camera. You will be impressed with the quality of construction, features and picture quality.", "Date": "April 20, 2004"}, {"Title": "Great camera with few negatives", "Author": null, "ReviewID": "R1ZAXNB3D5MRHA", "Overall": "5.0", "Content": "The bad points first: Auto-focusing can be slow (too slow for close-up graduation photos); cannot imprint date/time on a picutre (although info is stored with file when transferred to computer); batteries last only about 200 shots at max resolution; no manual focusing for tricky situations; cannot mount protective filter without blocking some light (vignetting).Otherwise, a really great camera.  Even 8x11 prints are good enough (the Leica lens really shines).  We also have a smaller 4-meg SONY, but much prefer this 2-meg Panasonic for versatility.  Especially great for paintings in museum that allow photos without flash---the reproductions of masterpieces are really impressive.  The zoom is awesome.  Grainy at 36x but give some prints a artsy look.  Takes better flash photos (not over-exposed) than both the SONY 3-meg and 4-meg that we have.With a 256MB SD card...can take about 25 minutes of Apple Quicktime movie (cannot zoom while shooting) or 300 pictures at max resolution.  Cheap when bought online...", "Date": "June 27, 2003"}, {"Title": "Produces WAY Beyond Normal 2.0 Megapixel Quality Pictures!", "Author": null, "ReviewID": "RBB494JAA9H8M", "Overall": "5.0", "Content": "This is an incredible camera.  Although reviewed in a negative manner for not having many manual settings, you won't find that you need them very often because the automatic settings on this camera handles things so well.  The 12x optical Leica lens is just incredible, and it's actually useable at full zoom due to the stabilization.  The 3x digital zoom is a nice plus, and still produces great pictures when used.  The electronic viewfinder is bright and clear (to see your subject in low light, make sure you change the default ISO 50 setting to ISO Auto).  The autofocus works as well as any other digicam, but I do wish it had a manual focus option for those few times that I've needed it.  I previously owned a Kodak 2.2 megapixel camera, and the FZ1's pictures are MUCH better quality.  Probably due to the better lens as well as Panasonics new image processor which is supposed to increase diagonal resolution by 50% and produce smoother pictures.  My camera prior to the FZ1 was a Sony Mavica FD91.  It has a 14x optical zoom, but only a sub-megapixel resolution.  The quality of picture is just exponentially better in the FZ1, while still offering close to the same optical zoom and in a better quality lens.  Could I have bought a higher megapixel camera?  Sure, but there isn't one with this nice of a lens/zoom.  Most of the higher megapixel cameras just have a lousey 3x zoom and I really needed something more than that after owning the Sony FD91 with its 14x zoom.  ... .  I highly recommend this camera, and feel I will be very happy with it for a long time to come.", "Date": "August 25, 2003"}, {"Title": "No comparison", "Author": "Jose", "ReviewID": "R1WC7GE4KSGUPA", "Overall": "5.0", "Content": "I waited for a product like this for many years, I was worried about it having only 2.1 megapixels, but I said to myself let's try it, I used to have a 3.2 megapixel from Sony and no comparison the photos I've taken with Panasonic camera are way over in quality and with that zoom there is no need to crop a picture to zoom in the part I want to print, loosing quality in the previous procedure.Leica Lens are the difference, Does anyone know that LEICA built microscope Lens, that is why this camera pays for it own.From nature lovers to family pictures it is great and easy to use, if you just are looking for a point and shot use the heart selection, if you are on the photo lover side of manual control use all the other.In few words, great camera.", "Date": "September 30, 2003"}, {"Title": "Puts the fun back in photography!!", "Author": "Bobby R. Pearce", "ReviewID": "R3E4F95AQUKN00", "Overall": "5.0", "Content": "I suffer from a disorder that makes my hands shake so much that I have had to use a tripod and timer for the last few years. With the FZ1 and the IS lens I can now take handheld photos, even at 12X zoom. The EVF is bright and legible and I no longer have to wear glasses when taking photos.The pictures are brighter and sharper at 2mp than my 3.2mp Sony DSC-F505V. This camera has put the fun back into photography for me and it will for you also. It is simple to use for the beginner and the experienced shooter will appreciate the different modes and the versatility that they offer.I highly recommend the FZ1 to everyone. This gives new meaning to bang for the buck and you will love the Leica 12X IS lens.", "Date": "October 17, 2003"}, {"Title": "big bang for the buck!", "Author": "neil koelemeyer", "ReviewID": "R2Y48CP0HT0NIH", "Overall": "5.0", "Content": "Wow, was I pleasantly surprised by the image quality of this camera.  My purchase was decided by the best available optical zoom (12x) because of nature and sports photography.  The quality produced by this unit was a bonus.Easy and fun to use, this camera belongs with anyone who likes to take long shots.  The stabilizing system works very well and the low light performance is very good.I highly recommend this one and amazon. com has the best deal by far.  Oh, immediately order a 256k sd card.  The included 8k card is best left at home.", "Date": "August 23, 2003"}, {"Title": "Just ordered it - great reviews and a fantastic zoom...", "Author": "Michael W. Hawkins", "ReviewID": "RZ0OOZX5XDALS", "Overall": "4.0", "Content": "...Basically, the 12X zoom convinced me, plus many of the advanced consumer functions such as bracketing and burst mode shooting.  I shoot outdoors a great deal, especially sports, and this is a nice compromise between the cheaper cost of a point and shoot and the full features of a digital SLR.", "Date": "April 10, 2003"}, {"Title": "Cool Cam Good Zoom", "Author": "spam \"spam\"", "ReviewID": "R22I17VH1B5AU3", "Overall": "5.0", "Content": "I bought this Camera a few weeks back and have been very happy with it. This camera is very easy to use and has a very good optical zoom. The battery which comes with the camera is very good should last a day if you dont review your pictures often. The macro mode takes good pictures. The day light pictures are of excellent quality but the night time are ones not as good as the day light ones if you are 6-7 feet away from the subject. The image stabilization is pretty good. The camera comes with a 8 MB SD card. But Panasonic was shipping a free 128 MB SD card (I believe offer is valid till Oct 30'03) which holds around 150 medium sized pictures.", "Date": "October 23, 2003"}, {"Title": "Awesome zoom!", "Author": "M. R. A Bohm", "ReviewID": "R3EKYB5IF1E4RI", "Overall": "5.0", "Content": "My partner and I decided we like snapping photos so much, that we wanted one each. We already owned a 3.2 Megapixel Sony Cybershot (with a 3x zoom), and wanted something that could zoom in - without sacrificing the quality.We didn't see the need in buying a hugely expensive camera - as we would prefer to buy a new camera every few years to keep up with the new releases in the market.When I first saw the Panasonic Lumix 2 megapixel camera in the photo shop, the shop attendant tried to talk me out of it. I was taken in with the massive 12x optical zoom! This was not even comparable to other cameras in this price range. Granted, the image quality was only 2 megapixel's, but that did not worry me in the slightest.I use my photos for viewing on my laptop, and sharing with others through email. I find that photos larger than 2 megapixel take a long time to send through, and some email accounts such as hotmail and yahoo cannot accept the file size as it is too large.A nice man in a photo processing shop told me that 2 megapixels is the same quality that a standard film camera produces in photos. Therefore, if I did want to print onto gloss paper, I would not be sacrificing the quality of the photos in any way.My partner and I have just moved to Alaska - and we are loving the zoom on our Panasonic Lumix. It's fantastic! No more missed photo opportunities because the old Sonly Cypershot couldn't get in close enough. The camera barely shakes even right in on the 12th level of zoom power.The dial at the top is easy to use, and makes shifting between types of shots easy. Move the dial from night preferred, to fast moving, to portrait, to movie, you name it. There are loads of options.One of the coolest things I have found with this camera is the multiple click option. Are you trying hard to capture something that is moving? Set the multiple shot button, and just hold the button down on the moving target - it takes 6 pictures in succession really quickly - so you are guarranteed to snap that shot you want.People who see my camera, think it's a really expensive one. I have had people ask me if it is a digital SLR! The lens is nice and big, and the viewing screen is impressive.This camera looks sexy, it performs well - and for the price, it's a steal.", "Date": "August 25, 2004"}, {"Title": "An awesome camera for novices!", "Author": "maxmasa31 \"maxmasa31\"", "ReviewID": "R44CXJV5KYVDM", "Overall": "4.0", "Content": "First, I'd like to say that I've owned about 7 different digital cameras, and this has got to be my favorite out of the bunch.  I travel a lot, so I enjoy taking a lot of photos, and this camera has just made picture taking fun again!  Its controls are easy to use, making it a great point-and-shoot camera for someone who's new to digital photography.  The 12x optical zoom using a Leica lens is the BIGGEST optical lens on a digital camera, and the image stabilization help to make this huge zoom usable without a tripod.  Thanks to the Leica lens, colors are vivid, and the photos come out crisp.I only have two complaints about the camera, but only one is important: it's a 2 MP camera.  With a lens like this, Panasonic should've made it at least a 3.  That's the only reason I didn't give it a 5 star rating...but I was still tempted to.  I like to make 4x6 pics, but 2 MP doesn't make for nice 4x6's.  The other complaint is that many controls and settings are preset, so serious photographers won't like it (but serious shooters would avoid it anyway, because it's a 2 MP).All that said, at this price, you won't find a better point-and-shoot camera with a big zoom lens.  The camera is compact (it still fits in the palm of my hand), has a fast start up time (considering the lens) and a fast shot-to-shot time.  The controls and settings are easy to understand for beginners and did I mention the 12x zoom?  It's a great camera for fun photography.  If you don't make too many 4x6 prints, this camera is incredible--buy it!", "Date": "August 10, 2003"}, {"Title": "Great camera perhaps even in low light 4.5 stars", "Author": "Tahir J. Naim", "ReviewID": "R2TH92DOL92903", "Overall": "4.0", "Content": "I'll be brief.  Megapixels should not be your sole consideration.  I have made 8x10 prints of pictures taken (macro and regular settings) with this camera and they are gorgeous and very detailed (I posted the full zoom photo of the truck with the dent and the macro pic of the devil ducks).  For family and vacation pix this is exactly what I need.  I think the person who wrote that 4x6 prints weren't good didn't have the camera set to the highest resolution (it has 3, with the lowest resolution intended for web viewing only).The low light problem may lie with me as I've re-read the manual and now taken a couple good photos in no light with the flash.  I set the camera to night rather than normal and the flash and image stabilization did the rest.The video quality is alright for the occasional e-mail.As I love the compact size I'm keeping this camera.  I was thinking of moving to a used FZ3 as that model is the same size and has the focus-assist for low light, but may hold off for now.Ideally I'd like a camera this size that could also take decent video with sound occasionally that I could enjoy watching on a TV. This is a little too muddy.  BTW, you can watch photos on your TV, but oddly, you can't transfer pix from your computer onto the camera's flash card and then use the camera to view them on TV. That would be a nice feature also.I also wish there was an ISO setting button rather than having to go into the menus, but oh well.Oh, get a 128MB or better flash card.  I only take pix at the highest resolution and then convert to lower for e-mail on my computer.", "Date": "February 5, 2005"}, {"Title": "Excellent beginner superzoom camera", "Author": "Got Twins", "ReviewID": "R2JOHYWIOK1S7G", "Overall": "3.0", "Content": "I want to just let you know that I am definetely not a pro, but an average person, so that is how I'm writing my review. I got this camera 2 years ago because I wanted a superzoom. Well, with the picture stabilization and the 12X zoom, I got what I wanted, but not much more. If you want to take nature photos, this camera is terrific. If you want to move on to scenery that moves, your going to have to find something else, b/c this camera does not have the shutter speed for it. Also, low light or artificial light does not come out very well either. With flash will look so-so as long as your image is within range, but the background is black. I do love this camera for being easy to use, but I've personally grown out of it. The 2 MP is also outdated.", "Date": "November 9, 2006"}, {"Title": "What a great camera for a great price!", "Author": "Okie in Alaska", "ReviewID": "R39T469138U2X5", "Overall": "4.0", "Content": "I have had this camera for two years now.  I have taken many, many great photos with this camera, it's unbelievable.  It seems to do well in almost all conditions.I uploaded a photo I took of my daughter just last week. The original picture was in color and was fantastic all by itself.  I used virtual photographer to improve on it just a little bit by changing it to black and white and putting a soft focus on it.The very first picture I took with this camera had me hooked.  It's a closeup of my son.  I was trying to decide if I should keep the camera or return it for another. Well, that shot alone made me decide to keep it and I am so glad I did.", "Date": "May 25, 2005"}, {"Title": "One of the best digital cameras ever made!", "Author": "Dr RJP", "ReviewID": "R3AKU52BZH5U8G", "Overall": "5.0", "Content": "I've had my camera for over a year after picking one up on eBay, and it is the best digital camera I've ever used (and I've used a lot).First of all, I totally agree with other reviewers here about how this camera quells the notion that more megapixels is better. I wouldn't know what to do with them if I had them. This camera consistently produces \"film quality\" prints.  Color saturation and tone are excellent, as well as is sharpness.Having an image stabilized Leica lens with a 12x zoom is what really sets this camera apart from the competition. You're never too far away from your subject with this excellent lens.The lens is only half the story because coupled to it is an equally, fantastic CCD imaging system. The time to turn the camera on, shoot a photo, and store it to memory is the quickest I've experienced since my first digital camera: a little Fuji Finepix A101 (which is a simple, point-and-click 2 megapixel camera).Speaking of my Finepix A101, I've taken photos with it and printed off 8 x 10's that many people would swear was taken with an expensive SLR film camera. To put it bluntly, the quality of the photographer also has a lot to do with what you get from a digital camera. I am an amateur photographer -- whatever that means.Despite the many features of the FZ1, I would recommend it for a beginner, but only if the beginner has already had some experience with film cameras and at least knows how to compose a picture with proper lighting and framing.  A few beginners may be intimidated by it, but they shouldn't be: just put it on the \"heart\" setting and fire away to your \"heart's\" content.The biggest weakness of ALL digital cameras is flash photography. There is no way the dinky, little flashes that come with them can do a decent job. They all tend to wash out images. Unfortunately, this camera does not have a hot shoe to allow the addition of an external flash. Photos taken with its flash will only be acceptable if there is sufficient ambient light to begin with.  My advice is to avoid flash wherever possible: instead, take advantage of its fast lens, set the ISO to 400, and use available lighting.Low lighting is problematic for the FZ1 as there is no infrared assist.  What I do is to either point-and-shoot, and hope for the best, or lock my focus on something bright that is the same distance away as my subject.Except for those situations where lighting is poor, this camera will take perfectly balanced shots under most lighting conditions. If you have to use flash, well, then, use it.If you can find a better camera than the FZ1 for the same money, by all means, buy it, but I seriously doubt you will. The FZ1 is as good as it gets!", "Date": "November 18, 2005"}, {"Title": "Don't use the auto white balance", "Author": "Surrounded", "ReviewID": "R73551ZXR622U", "Overall": "5.0", "Content": "After several (mostly outdoor) shots with this camera, I was pleased with the overall performance but puzzled as to why the colors were off.  The reason seems to be that the so-called \"auto\" white balance doesn't really compensate for the available lighting.  My guess is that it is simply a fixed setting based on all possible lighting available on Planet Earth, ergo, only passable for any particular situation.  Images taken in sunlight are improved immensely by using that setting, and indoor/mixed light source images should first be set using the manual white balance feature, if possible.", "Date": "October 16, 2006"}, {"Title": "NIce features and lens but poor picture quality", "Author": "\"shoottarget\"", "ReviewID": "R1SODX017JRW35", "Overall": "3.0", "Content": "Had high expectations with Leica lens but picture quality is below average. Tried developing photos at Costco and Ofoto and it was the camera and not development service. It's fragile and sand got caught very easily. Dissapointing... Avoid. I can now see why the retailers are liqudating this camera.", "Date": "March 27, 2004"}, {"Title": "Panasonic Digital Camera Poor Quality", "Author": "Sheila Willis", "ReviewID": "R2W3RFBULBIYEP", "Overall": "1.0", "Content": "This is the worst digital camera I have ever owned! The night pictures are terrible especially of dark clothing. The Macro Zoom is very poor. PANASONIC should stick to VCR's and TV's! Very Poor Quality! I called Panasonic and they couldn't tell me the problem. Neither tech could answer my questions and on the rude side also. I like Panasonic products but the camera doesn't deserve one star. If you want a good quality digital camera, don't buy Panasonic!! Most of the pictures are not clear. The colors aren't true. I wish I had listened to a bad review I had read of this camera previously!Sheila", "Date": "December 11, 2004"}, {"Title": "complicated", "Author": null, "ReviewID": "R2Q9636Y9LJUTN", "Overall": "1.0", "Content": "I bought this camera 1 week ago, I am still trying to figure out how to use it. The viewing menu is so small I can hardly read it, even with glasses on. I had three people trying to help me figure it out and couldn't do it. I am in the process of trying to understand the manual, that is very hard to do, it is no easy to read. I bought this camera because it was supposed to be a simple point and shoot, not so, there are more instructions to read and understand than anything I have ever bought. I tried to return it but couldn't because I opened the package, how else would I know its complicated and impossible to use? so I am stuck with this thing and I have not been able to take one picture. If you want a simple camera, forget this one. Stick to a company that just makes cameras.", "Date": "August 30, 2003"}], "ProductInfo": {"Price": "$419.00", "Features": "2-megapixel sensor creates 1,600 x 1,200 images for sharp prints at sizes up to 8 x 10 inches\n12x optical zoom and 3x digital zoom for 36x total\nExpandable via Secure Digital memory cards\nConnects with PCs and Macs via USB port\nPowered by rechargeable lithium ion battery (included)", "Name": "Panasonic Lumix DMC-FZ1S 2 MP Digital Camera w/12x Optical Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41PFYMCQ5JL._SX300_.jpg", "ProductID": "B00009RKPM"}}