{"Reviews": [{"Title": "Very small, very nice...but you must like 4/3rds", "Author": "Hiram Grant \"just call me Sam\"", "ReviewID": "R2DY8WST41ZO5P", "Overall": "4.0", "Content": "If you're top priority is a small, interchangeable lens digital SLR, then the E-410 should be the place to start.  There are none smaller, and the telephoto 40-150 is exceptionally short.  It's light weight, and has all the basic features most people want or need in a SLR.  It's basic enough for beginners, and featured enough (and good enough image quality) to satisy most advanced amatuers.However, before you buy, you must understand two things: smaller SLRs and the 4/3rd system.The smaller SLRs from all brands (Canon XTi, Nikon D40/D40x) have trade-offs.  They all use the rear LCD for everything.  Combined with the smaller battery for the smaller body, battery performance is not as good as the next size up (E-510, D80, etc.).  Additionally, the magnification inside the viewfinder is less, making manual focusing (or seeing fine detail) a bit more difficult.The 4/3rd system is also new to most people.  In an attempt to compete with the well established Big Boys, Olympus, Panasonic & Leica now offer a new lens mount, where lenses can be interchanged among brands.  The only problem is that Olympus is the only real line from these three, while Leica is now offering two lenses total, and Panasonic...none.  The only major independent manufacturer currently making 4/3rd lenses is Sigma, and they do not offer most of their line in this mount.  However, for most beginners, the two lense offered in this kit will be all they need.The other major difference with this system is that it is a different \"format\".  Traditional 35mm cameras produced a 3:2 format (which we typically call 4x6 because most labs produce that size of prints).  The typical print from a 4/3rd camera would be 4x5, a more typical size from the older studio medium format film cameras. Now this has it's trade-off.  Since most people will go ahead and make smaller prints in 4x6 size, they'll have to cut off a bit of the bottom and/or top of the photo.  On the other side, they'll cut off less on the typical enlargement sizes, such as 8x10.  I would say usually, it's a good trade-off.  On most horizontal shots, we usually leave plenty of room at the top or bottom, whereas people tend not to leave enough room on group shots to allow cropping from 4x6 to 8x10, OUCH!  This also means that on identical megapixel cameras, the 3:2 will loose more megapixels when cropped to standard enlargement sizes than 4/3rd cameras.  But you can make 16x24s instead of 16x20s, etc.One thing that is more difficult for me is that because the image is a bit more square on 4/3rd cameras, they tend to put the information inside the viewfinder on the side versus underneath the image.  Looking down, reading left to right is more natural for me.Anyway, the product description by Amazon is very detailed, but let me add that the \"Live View\" feature isn't as handy as it seems.  First and foremost, you loose autofocusing (because the autofocusing's mirror system must be moved out of the way).  Can you have it in Live View and still AF right before the shot?  Yes, but it will cause a lag time that will be unacceptable for action or quick candids.  However, it could be a welcomed feature used properly.  You could pre-focus on a bird's nest (that ain't going no where), and use the Live View while waiting for the best time to shoot.Overall, I give this camera very good marks.  If you like the idea of 4/3rd, but don't need a small camera, you might wait for the soon to be released E-510 that has a larger battery and an Anti-Shake feature.  As far as the competition goes, you might look at the Nikon D40x, or Canon Rebel XTi.Nikon D40x 10.2MP Digital SLR Camera with 18-55mm f/3.5-5.6G ED II AF-S DX Zoom-Nikkor LensCanon Digital Rebel XTi 10.1MP Digital SLR Camera with EF-S 18-55mm f/3.5-5.6 Lens (Black)", "Date": "May 9, 2007"}, {"Title": "Thrilled with my e-410", "Author": "Remco", "ReviewID": "R3R5O30U6BFZX5", "Overall": "4.0", "Content": "I am appreciating this camera more every day. Last weekend I took it to a wedding, and in fact I had the smallest SLR at the entire party. It made it easy for me to carry it and take shots the entire day. Also the battery performance was very good (I took more than 150 pictures and the battery was still far from empty).I bought this camera for traveling, size and weight was an important consideration and I really like the camera for this. I take it everywhere.It has all the advantages of an SLR (manual controls, seeing through the lens, interchangeable lenses), with the portability of a compact camera. Your hands should not be too big, if they are you would probably be better off with the e-510.The 40-150 lens included in the kit is very light and portable and produces some excellent quality shots.I like the performance of the camera, it has fast startup and excellent shutter performance.The live view mode as advertised is not that useful, mainly because of the latency when pressing the shutter button. I hardly use the feature.My previous camera was a compact camera (Canon Powershot S50). It took me some time to get used to the e-410 (being a SLR camera) and to learn how to use all its features.", "Date": "September 17, 2007"}, {"Title": "really a great mini slr", "Author": "David Zidel \"diz1356\"", "ReviewID": "R1A0H2B3DI202C", "Overall": "4.0", "Content": "I've had this unit a few weeks...and it seems to preform fine...good quality images....I did turn exposure comp to + 1/3 and noise filter to LOW andNoise Reduct to off....and as far as the 4/3 system...I go to Wolf/Ritz Camera and get their 4 1/2 x 6 in print...it's full frame for 4/3 system..I also have 2 canon 20D's so this is not my 1st slr...I would say this is a great value...and the telephoto lens is very compact", "Date": "September 17, 2007"}, {"Title": "A great lightweight SLR", "Author": "Andrew Rodland", "ReviewID": "R1ORW7BLZK7Y6G", "Overall": "3.0", "Content": "The E410 is my first digital SLR, and in the 6 months I've had it, I've been tremendously happy with it. Olympus has crammed a good deal of power into a compact body. The kit lenses are a bit slow but turn out outstanding images given enough light. The body fits in the hand very well, the controls are well-placed, and the onscreen controls and menus are well organized, so you never get bogged down hunting for what you want.So why only three stars? One, because of the limited (but improving) selection of fourthirds lenses, but mostly because new buyers, unless they need to shave every ounce, would do well to look at the E510. The \"big brother\" of the E410 is only a little larger, takes Olympus's standard, higher-capacity BLM-1 battery, and features in-body image stabilization that works with any fourthirds lens, greatly reducing blur in handheld shooting. For those who understand the 410's limits and want the world's lightest DSLR, I'd recommend it wholeheartedly.", "Date": "December 20, 2007"}, {"Title": "Olympus E-410: An Excellent Entry Level DSLR", "Author": "J. Rios \"The Happy Guy\"", "ReviewID": "R1C2MWSYBXT6A6", "Overall": "5.0", "Content": "As a person who was a serious SLR film enthusiast about 27yrs. ago with a Cannon A1, I decided, after purchasing a good quality digital point and shoot camera a couple of years ago, to get back into photography, but this time digital photography. So, after reading about several new DSLR cameras this past summer, I decided to buy the Olympus E-410 a couple of months ago. The important factors were its compact size, cost, self-cleaning sensor, live view LCD, and ease of use. After two months and about 700+ pictures, I can happily say that this camera is serving its purpose in introducing me to the wonderful world of DSLR photography. In my opinion, one of its strengths is its solid build despite its light weight. The buttons and dials feel good and you're unlikely to accidently change a setting. There is one weakness in the E-410 which deals with backlighting without the use of flash. The only way of correcting it is by going to the EV compensation with a +2/3 or +3/3(this equals 1 f stop), or the manual mode with a +1 f stop exposure. With most cameras, you can simply point and focus on the darker area and press the shutter halfway and you'll see the camera making the appropriate adjustments.In regards to the two lenses that come with the E-410, I really appreciate the performance of the 14-42mm lense. I've taken many excellent close up pictures of flowers with it. Sigma, however, does have a better and faster, but more expensive, f:2.8 18-50mm lense. The 40-150mm lense is nice to have due to its light weight and compact size, but you may want to get the Zuiko(Olympus) f:2.8-3.5 50-200mm lense later on when you can afford it because it's also somewhat more expensive. Overall, the lense kit is good. Right now, I'm now starting to work with RAW format pictures using this excellent camera. Of course, there are other good entry level DSLR cameras such as the Nikon D80, Sony A100, and the Cannon Rebel, but the E-410 had the package that suited me. I highly recommend it! Which ever camera you decide is right for you, make sure you read up on it, ask questions, and enjoy the beautiful world of digital photography.", "Date": "December 2, 2007"}, {"Title": "Small, light, and high performing", "Author": "Passante", "ReviewID": "R1NC8TV7UMSMQE", "Overall": "5.0", "Content": "This is an excellent camera.Over many years, I've shot with many cameras and in many formats: 4x5 inch sheet film in a view camera; 120 film in a Yashica TLR and in a rollholder back on a Speed Graphic and a Galvin medium format view camera; and 35 mm in rangefinders and SLRs -- Canon, Pentax, Rollei, and many Nikon models. Nikon is what I standardized on for 35 mm and eventually digital for 30 years.I bought the Olympus e-410 about a year ago because I wanted something smaller and lighter than my Nikon equipment for pleasure travel. I haven't been disappointed. The camera is light, has a small footprint, and I get crisp, well-exposed images (by the way I almost never use the auto or scene settings).4:3 format: No problem. It makes prints at the standard print sizes of 4x5, 5x7 and 8x10 inches with almost no cropping.Battery life: I find no difference between the e-410 and my Nikon -- but then I never let the battery run down and I always have a charged spare on hand.Live view: Who cares? People who like to wave their cameras around at arm's length, look at the screen, and get unsharp images should buy point and shoots. Anti-shake technology was developed for them. The rest of us hold the camera in both hands (or better still, put it on a tripod) and use the viewfinder.Sharpness: every digital image requires sharpening in post-processing, no matter what camera produces it.White balance and ISO-equivalent: I ran a bunch of tests (just as I have always done with every single different film used with every single lens in every single camera), and I made notes on the adjustments I needed to make in every single white balance/exposure situation. No camera comes out of the box perfect. There are countless hours of very dull testing work associated with photography if you want to do it right -- and it takes less time to do it with digital than in the darkroom.", "Date": "March 21, 2009"}, {"Title": "Olympus Evolt E-410: A Great Compact DSLR Camera", "Author": "Joseph Z.", "ReviewID": "R3N6TI4N5F7CZG", "Overall": "5.0", "Content": "I received this camera as a combination Birthday and Christmas Gift, and have been amazed at the quality of images that this compact, easy to use Digital SLR is capable of producing.  I have attached some sample photos to this product page to show some examples of the clarity and resolution the E-410 is capable of achieving using the two lenses which are provided in this kit.  In addition to being very user friendly, this model boasts 20 different scene modes which quickly allow the first time user to achieve excellent results under a variety of shooting situations.Highly recommended to anyone looking for a lightweight, compact DSLR with a Live View LCD and all the features needed by both novice and experienced photographers.", "Date": "December 25, 2007"}, {"Title": "Finally a return to SLR photography for me at a great price and quality", "Author": "austin_Larry", "ReviewID": "R3QSJ4HGTYZREO", "Overall": "5.0", "Content": "Digital photography is great. No film, bad pictures..poof gone, instant pictures, sharing with friends and family around the world, different ISOs, black and white or color all at the touch of a button. We are all familiar with why we like digital photography. Well I was a 35mm SLR photographer for a long time. I LOVED it. Loved the lenses, loved the control, and loved the results. I even developed my own photos for a time. But digital seduced me. DSLR was simply out of my price range.Enter the Olympus 410. I just received it last week but had an unexpected vacation opportunity come up this past weekend so I was able to take it through its paces. First off do some research. There is a great review above and plenty more all over the web. I did and found the 410 very highly regarded. One of its big selling points to me is that it was designed as a DSLR as where the included lenses here from the ground up. That means that everything is optimized for digital SLR photography and this produces very good results. You will also find from the reviews that it is more compact and lighter than most DSLRs around. I tried a friend's Nikon D60 and it was certainly smaller and lighter than the D60.Over the past weekend I took the best pictures of people and landscapes I have ever taken with a digital camera. If you never have used a 35mm SLR this camera has a VERY well designed menu that will let you shoot in automatic mode right out of the box and also put some of the more common adjustments right in front of you. The auto-focusing is fast and accurate. I was using aperture priority and what happens is there is a wheel next to the shutter button. You simply twist the wheel and the aperture changes. If you were in shutter priority it would change the shutter speed. There is also an exposure under/over button right by the shutter and you can 'bracket' photos very easily with it.I frankly just used the view-finder since I was so overjoyed to be back to SLR photography. However I did use the live view on a macro shot and it worked very well for that. If you are not familiar with SLR cameras you might think what the big deal is. Well ever wonder how sports photographers get their shots? I mean using a point and shoot by the time you press the shutter button and a picture is shot forget it usually. It is because the sports photographers use SLR cameras. When you press the shutter the picture is taken, no lag. If you want to capture good action shots you need a DSLR. Do note though that using live view you are 'back' to the lag in point and shoot digital cameras. You only get the instant shooting with the viewfinder.Also the photo quality is better because the sensors are bigger than on point and shoot cameras. So even though a point and shoot might have 10 megs, its pixel size will be smaller.This kit is an awesome way to get into DSLRs with a quality camera, TWO quality lenses, and good support from Olympus. I asked an email question and it was answered in depth within 2 hours. About the lenses they will take you from wide-angle to a pretty high zoom range. And the bigger lens is not that much heavier or larger than the smaller one. Sure it would be nice to have one lens with the same range as both of these but the price is already amazing for this package. But this is still real money and is not cheap. It would not make sense to get this if it was not also a very good camera, which it is. Many competitors did not design their DSLRs as digital cameras from the ground up, Olympus did with its E series. With this package you can reap the benefit of that decision along with a truly amazing price point.Highly suggested for people wanting to return to SLRs within a budget and digital photographers looking to get much better results and explore the world of SLR control and creativity.", "Date": "January 21, 2009"}, {"Title": "E 410 opinion", "Author": "Eldred Reaney \"Arizona Photography\"", "ReviewID": "R3J8I5DONCFTVZ", "Overall": "5.0", "Content": "I really like my e 410. It's small and light. It takes great pics with the right settings. Out of the box, the default settings smudge details because of excessive noise reduction. Turn off the noise filter! Also reduce sharpening -2. I don't know why Olympus hasn't fixed the problem with a firmware update. Anyway, I really like the camera. It's the best buy in digital SLRs right now!", "Date": "December 29, 2007"}, {"Title": "Love Olympus", "Author": "Darcel Cook", "ReviewID": "R1EJCYVGQ6HBY9", "Overall": "5.0", "Content": "Olympus Evolt E410 10MP Digital SLR Camera with 14-42mm f/3.5-5.6 and 40-150mm f/4.0-5.6 Zuiko Lenses This is a great camera.  Absolutely love the quality of pictures and the ability to use Auto features or get really creative and manually set features.  I researched Consumer Reports before I bought a camera and this was a top 3; they were right.  I got more for the money with Olympus.  If I had a second opportunity to buy a SLR Camera I would buy this one again.", "Date": "May 8, 2008"}, {"Title": "perfect size", "Author": "tracy", "ReviewID": "R30KBU4V9L1ZIK", "Overall": "5.0", "Content": "I love this camera.  It's small enough to fit in my bag and my small hands.  Takes clear, sharp pictures and the menu us so easy to use.  Noise shows up in ISO 1600, but isn't unbearable.  100-400 ISO is quite good.  Can't wait to get the pancake lens for this.", "Date": "January 28, 2009"}, {"Title": "Great camera!", "Author": "Mark Gerney", "ReviewID": "R2HTMK0KV06QHE", "Overall": "5.0", "Content": "This camera is awesome. There is a lot to learn about it, though. I love the lack of shutter delay. The pictures are incredible. Great camera for the price. I got the camera as a packagae with 2 lenses.", "Date": "July 12, 2008"}, {"Title": "newbee", "Author": "C. Stiwald \"Newbee\"", "ReviewID": "R19YMJ6UG44J7N", "Overall": "4.0", "Content": "although i haven't had the camera very long, it seems to be user friendly.i have basically been using the preset modes.the night scene has worked very well. i have tried all the preset modes and i am very happy with them.we purchased the kit with the 2 lens,for distance i will need topurchase another lens the ones that came with it doesn't give me thedistance that my 35mm did.hope to write another reviw after i have usedthe camera for awhile longer.", "Date": "March 9, 2008"}, {"Title": "FAST DELIVERY BUT MISSING AN INTEGRAL PART TO WORK", "Author": "matthew cintas", "ReviewID": "R8RTNXYY0XS86", "Overall": "4.0", "Content": "NOT IN EXCELLENT CONDITION AS STATED. RECIEVED CAMERA MISSING THE BATTERY COVER ON THE CAMERA SO I RECIEVED AN ERROR MESAGE AND DIDNT WORK UNTIL I DUCT TAPED BOTTOM OF  IT. WORKS FINE NOW OTHERWISE. VERY PROMPT DELIVERY.", "Date": "January 9, 2014"}, {"Title": "Great Starter DSLR", "Author": "jaq", "ReviewID": "R3KKC2JYGWE5LA", "Overall": "5.0", "Content": "I got this camera to start learning how to use a DSLR and I love it.  It's small enough but not too small.  It's user friendly and easy to figure out.  Pleased as always by olympus products.", "Date": "May 13, 2013"}, {"Title": "Good Camera.  Product in good conditions as described, good seller", "Author": "Javier Ferreira H.", "ReviewID": "R3Q9XEKG5MOX4I", "Overall": "5.0", "Content": "I bought this camera as a gift for my wife.  We are not photographer professionals but we would like to start taking more quality pictures, and this camera is a good middle solution for us that are not professionals.It was a used camera as advertised and it was in real good conditions and it is still working after one year.  I recommend this seller and also the product", "Date": "January 17, 2013"}, {"Title": "Great digital SLR.  First camera like this for our daughter and she loves it.", "Author": "R. Buchanan", "ReviewID": "RNZKK9S23GF9S", "Overall": "5.0", "Content": "Solid quality, takes great pictures.  Sure, there are other high MP cameras out there, but 10 MP is more than adequate for almost everything an amateur video enthusiast would want to do.", "Date": "January 5, 2013"}, {"Title": "Great", "Author": "Caryn", "ReviewID": "R3QA2WZ27E4ICO", "Overall": "5.0", "Content": "great potential for clear images if used with manual setting. Great camera for a student or a skilled photographer short on cash.", "Date": "December 16, 2012"}, {"Title": "Excellent compact DSLR for beginners and beyond!", "Author": "kk \"kk\"", "ReviewID": "R1A56KNPSUVG44", "Overall": "5.0", "Content": "This is my first DSLR and it certainly didn't disappoint. I got so spoiled by how light and compact it is even with lenses that when I use my brother's Canon Rebel XT series, I hated it because it is so bulky and heavy. The Olympus may not be the best for indoor shots, but in Outdoor, it really shines even for high-speed shots like Airshows or sporting events. I've had the two kit lenses and never really needed more (I would like to get a macro lens).For the price, performance, and value, you can't beat this!", "Date": "February 15, 2011"}, {"Title": "I love this camera", "Author": "Manuel Hernandez \"Manuel A. Hernández Giuliani\"", "ReviewID": "R1JW2A0H5ZSASX", "Overall": "5.0", "Content": "OpinionI love this camera, this is my first DSLR, it is ease to use, it is very light. After a couple of years using it I am taking the photos in raw format and with lightroom making the post procesing and the result are amazing.ProblemsLow performance in poor light and ISO over 800", "Date": "April 16, 2010"}, {"Title": "Olympus Evolt E410- an affordable choice with a good quality", "Author": "Bora Yucel", "ReviewID": "R2RH7SMSNVBWLY", "Overall": "4.0", "Content": "This is an affordable choice for an DSLR camera with a certain quality.Especially for whom are interested in underwater photography like myself this is a pretty good option if you consider the housing price as well.", "Date": "April 14, 2009"}, {"Title": "I love this camera!!!", "Author": "B. Richardson \"Triniflava\"", "ReviewID": "R4XQL0PH83GA1", "Overall": "5.0", "Content": "I love this camera, still learning new things to do with it!! Awesome picture quality and lots of great features!!!!", "Date": "February 9, 2009"}, {"Title": "what I expected", "Author": "Steven L. Derushe", "ReviewID": "R1P50O928XXL0Q", "Overall": "5.0", "Content": "I got this camera and it lived up to my expectations. I loved everything about it. By far the best camera I have ever owned. The only problem that I experenced is focusing in low light, but that is to be expected with the kit lenses. In order to focus better you need to get a faster lens, a f/2 on the apiture should focus instantly. I diden't have the camera very long,lost everything in a house fire, so am waiting to save the money for the e-520. I know I will love it just as much as the e-410", "Date": "November 12, 2008"}, {"Title": "The Evolt 410", "Author": "Michael J. Berglin", "ReviewID": "R2VWTATHT1EW1Q", "Overall": "3.0", "Content": "Let me start off saying that I worked for a company and they were doing close outs on their Olympus line and I got on heck of a discounted price. I basically paid about ½ the price, on heck of a bang for the buck.The E410 is not a bad camera, nor is it the camera to be all.The images are somewhat soft which is problem inherent with the four thirds format. So be it.  I have to frequently adjust the camera's bias as reds and whites will freak the camera out and one gets either over/under exposure.I thought my wife would readily adapt to the smaller size of the Evolt - nope, She prefers her Fuji S9000.Between the Fuji and the Evolt, I see minor image differences favoring the Fuji. Perhaps a better lens on the Evolt might help a bit.But, I will say this, the E410 is a work horse - we've been out in 10 below weather and up to 100 degrees above and the E410 pulls through.  The battery life is great compared to the Fuji.Focus can be an issue - 10 out of every 60 - 70 shots will be soft, and I mean soft to the point of unusable.  So, we just compensate making it a numbers game which is not a problem for us.  When in doubt, reshoot.Would I buy another E410 knowing what I know now - I have to think about that especially if I had to pay full price.  However, considering what I did pay, yeah, maybe.4 May 12 update -We changed our work flow and we only shoot in RAW format now - What a difference it all makes.  With the various software packages we use in our processing, we can come out with some very stunning and highly detailed photographs with the E410 and using only the kit lenses which are highly regarded by all the reviewers.", "Date": "August 21, 2011"}, {"Title": "an outstanding camera!", "Author": "Chillis", "ReviewID": "R3EW4SSZ2A32UB", "Overall": "5.0", "Content": "This is the camera to have whether you're a professional photographer or just getting started.  Once you get use to what setting to use for the best shot you're taking, the results are nothing short of amazing.  Did I mention the price?  I have not seen this camera for less anywhere else!", "Date": "January 2, 2008"}, {"Title": "Evolt-E410 Review Purchased", "Author": "FPrado \"ELP-FHP\"", "ReviewID": "R2L43Y069YREIC", "Overall": "5.0", "Content": "Great experience, great price, got it on time and got exactly what I order. 5 stars experience, Thank you", "Date": "February 8, 2010"}, {"Title": "good buy", "Author": "Joanne Garcia \"misty girl\"", "ReviewID": "R3HGG0X41F6U9D", "Overall": "4.0", "Content": "i always buy my gadgets on amazon and it never fails to meet my expectation. I bought this camera few weeks ago and i am so glad i did it. I'm not whiz on cameras but this particular brand is really a great deal, u got 2 lenses for a good price, what more to ask?. I am still figuring out the ins and outs of it,but i'd tell you that this camera is smart. Easy to use, worth the bucks. Good as a gift or for personal use. When u have one , you'll figure out yourself and fall into it.", "Date": "April 21, 2008"}, {"Title": "Olympus E-410 camera outfit", "Author": "Daniel L. Brothers Jr.", "ReviewID": "R25PZ7HW91VXSL", "Overall": "5.0", "Content": "The shipment was received earlier than expected and was received in Excellent shape.  The camera and lens produce excellent pictures.  The manual is very clear to understand.  I am very happy to have selected this camera outfit.  Previuosly I used a Minolta SRT system for film.  This compares very favorably.  Thanks so much.", "Date": "April 21, 2008"}, {"Title": "Great Camera-Not for beginners", "Author": "Chasidy Little \"C. Little\"", "ReviewID": "R2NUWO9WIDR2VB", "Overall": "5.0", "Content": "Such an awesome camera, but beginners beware.  It has more options than one can figure out.  I have read the instructions about 4 times, and still am trying to figure out things.  Takes an amazing picture, which is all that truly matters.  Recommend for cameraman who knows what there doing.", "Date": "January 12, 2008"}, {"Title": "Smaller SLR with my e-410", "Author": "Sarayut Yooin \"Sarayut\"", "ReviewID": "R2C0MVM7DTKKRU", "Overall": "4.0", "Content": "In my view before you buy, you must understand 2 things: smaller SLRs and it's good for travel.I've had e-410 system about 2 weeks.It made it easy for me to carry it.It seems to produce the good picture / good image  but some picture wasn't good because i try to take a good picture ;-).(the battery performance was very good )The 40-150 len is very good for me.It used for tele picture.Overall ,I would say this is a resonable price...and the telephoto lens is very good.=================Sarayut YooinThailandCons. Last weekend I took it to a birthday party at night.The images was bad because i didn't have the external flash.Maybe the external flash is is important for you", "Date": "February 10, 2008"}, {"Title": "Do Not Buy This Product", "Author": "Kenneth P. Smith", "ReviewID": "RELN3N28RMD04", "Overall": "1.0", "Content": "This was a Holiday Gift for someone who was only in the country for a brief period.  When she charged and inserted the battery it did not work.  The camera could never be turned on.  It was returned. I bought a Nikon for her the next day and am happy with it. I would never  buy Olympus again.I can't comment on the seller since I have not yet received a  credit for the returned camera.", "Date": "January 9, 2009"}, {"Title": "Worst One so far...", "Author": "MECAB \"Erasure Fanatic\"", "ReviewID": "R1E3BPDKAQOMJE", "Overall": "1.0", "Content": "I got the E-410 and returned it .I have an older Minolta digital camera which out shines this one !What is the use to have an \"auto\" and \"program\" mode , when all you get out of it is brown , dark useless photos? If I have to tweak the camera settings on auto mode , it's not worth much .I can take photos in any condition with my Minolta and print them perfectly. With the E-410 , I have to process the photos first and hope that they will make good prints !So much for taken pictures and taking the card to the store to have prints made .What a waste of money !", "Date": "December 28, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "10-megapixel CMOS sensor captures enough detail for photo-quality 18 x 24-inch prints\n2.5-inch Live View HyperCrystal LCD display\nTruePic III for superior image quality in all lighting situations; exclusive dust-free technology for spot-free photos\nLightweight ergonomic design; kit includes 14-42mm f/3.5-5.6 and 40-150mm f/4.0-5.6 Zuiko lenses\nPowered by one lithium-ion battery; stores images on CF, Micro Drive, or xD Picture Cards", "Name": "Olympus Evolt E410 10MP Digital SLR Camera with 14-42mm f/3.5-5.6 and 40-150mm f/4.0-5.6 Zuiko Lenses", "ImgURL": "http://ecx.images-amazon.com/images/I/4185ATUICHL._SX300_.jpg", "ProductID": "B000NVTZXY"}}