{"Reviews": [{"Title": "An embarrasing product for Polaroid!", "Author": "MR IAN STEVENSON", "ReviewID": "R2AKIIJ77TEAI4", "Overall": "1.0", "Content": "I brought this camera, because all I wanted was a cheap digital camera, that would allow me to take quick shots to send to my mum on email. Well, it was cheap, easy to use, but... The photos were useless. You could not  even make out peoples faces in photos, and as for outdoor photos, nothing  was sharp.I believe that this is mainly a result of this cameras very  low resolution. I was aware of this when I brought it, but I thought that  surely if it was not sufficient, then they would not sell it.All I can  say, is stay away from this product, and maybe don't get cameras with such  a low res. Anyway, as for my camera, I'm sending it back!And the only  reason I gave it one star, is because the form will not allow zero.", "Date": "May 3, 2000"}, {"Title": "Run away!", "Author": null, "ReviewID": "R13ETWKKPM54KT", "Overall": "1.0", "Content": "This camera has very poor resolution. I would say you get what you pay for except that this is nearly worthless. The images are NEVER clear and will not get much larger with out looking very poor. This camera cut to many  corners in a effort to be cheap. No flash or anything, it's the equal of  those toy cameras you would buy in a dollar store.", "Date": "April 25, 2000"}, {"Title": "OK .... It's not a great camera", "Author": "C. Ross \"chrislv\"", "ReviewID": "R3KIQFRFKJ73YS", "Overall": "2.0", "Content": "OK ... This is not a great camera. No flash, low resolution pictures and  limited capacity. But what do you expect for $50? For an easy to use, low  priced first step into digital cameras, this is a good choice. The software  is easy to load and operate and the picture quality, though not good, is  sharp enough to get you started on how to adjust digital pictures and use  them on the Internet. The kit includes everything you need to start taking  pictures right out of the box, camera, battery and serial cable. Try it  out, then upgrade and give it to the kids for use with their friends! As I  said, for $50, it's an OK package.", "Date": "May 29, 2000"}, {"Title": "Not much camera - You get what you pay for I guess !", "Author": "Bobby Lentz", "ReviewID": "R3M65Q5WMXPNF8", "Overall": "1.0", "Content": "This camera is very small and light weight.  From there it is mainly bad news though.  First it is not USB compatible - you are limited to having a open 9-pin serial port available on your PC.  Second the picture quality is very poor...super tough to get the lightening right....Third - well to just come out and say it....this camera should say for ages 4 - 12.....it would make a decent toy for a kid, but little else in my opinion.Spend a little more and get a 640 or better camera, you'll be VERY happy you didn't waste the money (as little as it is) on the 320.  Better to go buy pizza or something else...this thing is that bad!!!!", "Date": "October 16, 2000"}, {"Title": "What You See is not quite What You Get", "Author": "eSapien", "ReviewID": "RKM3PJKMVIKL6", "Overall": "2.0", "Content": "Polaroid's real mistake with the Digital 320 is price and packaging. The camera looks (and is priced) more seriously than it performs. Polaroid should probably have played up the \"fun\" angle, made the body bright purple instead of silver, and aimed it obviously at kids or beginners.The image quality is not great. It's about as good as an average webcam. You need a lot of light. The images have a lot of compression artifacting (spotty patches) around the edges of objects. Colors don't reproduce well. As the camera holds only about 18 images at once, you won't be going very far from a PC for long. You can get some quite acceptable results if you: * shoot a single person or object against a simple background. Make the person or object as large in the picture as you can. You can sometimes get closer than the manual recommends. * Forget 320x240. It looks fuzzy and artifacted. Once you have the image in your computer, reduce the size until it appears sharper. Adjust the contrast and brightness to make it more distinct. * shoot in bright light with the light source behind you. Hold the camera as still as you can, or sit it on a flat surface or tripod. (This seems to be a factor with many budget digital cameras.)If you have basic needs, or just want a bit of fun, the 320 will probably be fine for you.", "Date": "December 23, 2000"}, {"Title": "Would be great as a free gift w/every magaz subscription!!!!", "Author": "Gretchen Luttrell", "ReviewID": "RIODV60MPPM7G", "Overall": "1.0", "Content": "I was just looking for the cheapest camera I could find. I FOUND IT!! I'm  not very computer literate, so I was trying to get an idea on how digital  cameras work.  I LOVE the concept (no film, etc.) but I probably took over  200 pictures and had only 4 or 5 that were decent.  The quality is very  poor and the software isn't a whole lot better.  Save your pennies until  you can afford the real deal.", "Date": "August 11, 2000"}, {"Title": "Save some Money", "Author": "A.M.Boughey \"Poetmaster\"", "ReviewID": "R3TGS1E4MOAA41", "Overall": "1.0", "Content": "Digital cameras, like computers approximately double in power and halve in price every 18 months. True, digital cameras are easy to use and fun to play with on your pc, but please save time and money, and don't be tempted by the promise (or price) of anything under 1 megapixel. This camera looks nice, and thats about it - grainy picture quality over 3\"x5\", blocky resolution, and poor light enhancement. Do yourself a favour, and stick with a normal camera until you can afford to really experiment with something worthwhile.", "Date": "November 9, 2000"}, {"Title": "A Total Waste of Money!", "Author": "\"tlevan\"", "ReviewID": "R9SUY5AWNBH0B", "Overall": "1.0", "Content": "This is one of the worst products on the shelves! Sure it's easy to use, but the images are so unclear it isn't funny. For one thing the images  aren't even in color secondly, you can't even see what you took a picture  of. These cameras are absolutely terrible!", "Date": "August 1, 2000"}, {"Title": "Let's face it!", "Author": "Rob Walton", "ReviewID": "R2C67W14MUQW7S", "Overall": "3.0", "Content": "Look, lets face it! If you want the kind of quality you get from a normal camera, either buy a NORMAL camera or spend hundreds on a digital one!I have just bought this camera, wanting something to just take ramdom pic's with. I don't want to have to pay loads for developing, so I chose a digital one! I only paid [price] for it in a 'Cosmopolitan virtual makeover' pack! I only got it for the Camera though!!! er.... and to see what I looked like in a bridal veil! He he!! ;-)So it doesn't have a screen on the back, a flash, a lens cover or more than 2 buttons! What it does do is take pictures that are good enough for the web or just keeping for memories. You won't want to print them out, as the resolution is not really good enough.I read these comments before I bought it, and came to the conclusion that the people who were ranting and raving about how 'bad' this camera was, were the type of people who don't belive in 'You get what you pay for'! I do, I didn't want to pay loads and therefore I'm happy! Especially as I only spent [price], which is about half a night out for me!The software is easy to use, and takes seconds to download or to delete. I get 30 pic's out of it easy. You need lots of light, so if you want to take pic's in a nightclub or in a bedroom when you get home (wink wink), get one that has a flash!!!!Well there we go, I'm no professional photographer, which is probably why I'm happy with this camera! Atthe end of the day, in my opinion, it's a toy, but a good one.Seeya", "Date": "July 22, 2001"}, {"Title": "I should have known...", "Author": "D. Jenkins", "ReviewID": "R1B40IY21GUD6D", "Overall": "1.0", "Content": "I bought this camera on impulse after viewing the AOL Ad.  At this price I should have known not to expect much, and really I didn't.  Yet, even with low expectations, Poloroid was able to plunge me into making many self-deprecating statements and other fits of depression.  The 320 x 240 resolution is too terrible no matter what lighting or other circumstances prevailed. I was so disappointed in my own stupidity, I didn't even have the common sense to send it back.  Truly, this is a case where the advertisers have led the public astray, and I was one of the first.  Poloroid should be ashamed of itself", "Date": "December 10, 2000"}, {"Title": "Polaroid hardly even for kids!", "Author": "Paul J. Geiger \"amazon user\"", "ReviewID": "R3K96PYKN6WSIB", "Overall": "1.0", "Content": "Easy to use but extremely poor resolution. The money was wasted and I did expect better from Polaroid as I'd just read a review of their up and coming back to the market place in the Wall Street Journal-- maybe with  their instant film cameras but not with this junk.", "Date": "July 10, 2000"}, {"Title": "Excellent device for the Price.", "Author": "\"amnond\"", "ReviewID": "R9K3XPJH0VQI8", "Overall": "4.0", "Content": "I bought this little camera and was pleasantly surprised- forsuch a small price you get a camera with 320x240 resolution which is fine for onscreen viewing, and  although the docs say that the camera can only record 18 shots- I was able  to shoot no less than 41 images on one test. The image quality and focus  were very OK! Can the resolution be better? Obviously. Would it be nice to  have on-camera previews? Obviously. Would it be nice if the camera was  faster? Obviously. BUT for those you have to be prepared to shell out at  least $100 to $200 more dollars. In Short- For its price this is probably  the best value you can get today- as long as you remember its limitations  and do not expect it to perform like a $300 machine.", "Date": "May 25, 2000"}, {"Title": "Where did my [money] go???", "Author": null, "ReviewID": "R2ZZIVTXEL1F3G", "Overall": "1.0", "Content": "I was robbed.  This camera is HIDEOUS!  Sure, I know it only cost ..., and the packaging LOOKS nice, but it should be a crime to dupe people into buying this.  Let's see, where to begin?  I know, how about: 1) The camera is deceptively good-looking.  It's light, small and is ergonomically designed.  Hmm... so far so good. 2) Although it's light, it feels CHEAP. 3) It IS cheap.  Both in price and in quality.  Not a good trade-off. 4) The software is lame. 5) (This is the important one) The program would not recognize the camera even though it was all hooked up correctly. Ok, at 320 x whatever, we know the quality is going to be awful, but not this bad. It's not even a good present for a kid if they can't use it. I can think of a lot better things I can do with [my money]! Buy the kids a Playstation game, you'll save ten bucks and they'll probably use it more.  At least the game is guaranteed to WORK everytime. Happy Holidays...you've been warned.", "Date": "November 30, 2000"}, {"Title": "Unbelievable this is still on the shelves..", "Author": "Derrick", "ReviewID": "R18RRR4X2SB04E", "Overall": "1.0", "Content": "I was very disappointed with the product. I was gonna give this to a family member after first testing this product. Made some photos with it and found the camera useless. The qualitity of the photos is so poor. You  need a lot of light for photos inside (next time I would get a flash  camera). Photos outside hardly show the image. The number of pixels are  apparently too low to expect a decent picture. Unbelievable Polaroid sells  this product. I was emberrased to give this camera as a present. Instead,  returned the product and bought a 20USD bottle of wine!", "Date": "July 6, 2000"}, {"Title": "Cool Camera", "Author": null, "ReviewID": "R2XJ32E9UTEF9F", "Overall": "3.0", "Content": "I am a novice user of digital, or for that matter, any camera.  but i have found that this camera is truly fun and easy to use.  The instructions are simple and easy-to-read, and the camera is even more straight-forward.  The only drawback I have had with this camera is that it does not seem to hold the 15 pics promised for the higher resolution.  I seem to be able to only hold 11.  For someone like me, who needs a camera more for the moment than for a long trip, this does not end up being a problem.  For any beginner like myself, I would recommend this camera.", "Date": "October 10, 2000"}, {"Title": "Stop Whining", "Author": "Marc Weiss", "ReviewID": "R1EQGAYMBHBL80", "Overall": "3.0", "Content": "It's really cheap and it functions like a really cheap camera. When you pay this kind of money for a digital camera expectations should be minimal and thats exactly what the 320 is. Its a really fun toy. I admit I was a bit dissappointed in the image quality even considering I didn't anticipate it being particularly good. We paid $19.95 after rebate and I bought 2, one each for the kids. If they loose it or it breaks no sweat. If they enjoy it, I'll spend more next year on a better product. You get what you pay for. It's worth the price.", "Date": "November 25, 2000"}, {"Title": "Awful, don't waste your time or money", "Author": "\"arshga\"", "ReviewID": "R1AG03OO2PJSRF", "Overall": "1.0", "Content": "This camera is just awful. Although you can't expect much at that price, you sould at least get pictures that you can recognize. Just don't bother.", "Date": "December 8, 2000"}, {"Title": "waste of money!", "Author": "Thomas", "ReviewID": "R3OWG4BT0QW7H6", "Overall": "1.0", "Content": "all the effort you go through hooking up the serial cable to your computer is not worth the bad quality photos you'll get from this camera. before you buy a digital cam think first -\"what do I want to use the pictures for?\". Go with a camera that has a flash and 640x480 resolution....", "Date": "December 15, 2000"}, {"Title": "look at the specs before you buy it", "Author": "bildo", "ReviewID": "R2BHFNBIG3H04E", "Overall": "3.0", "Content": "I purchased this camera and had no problems with it.  I saw a lot of negative comments on here about this camera and all I can say is stop looking at price tags and expect to spend some money if you expect high res pictures.  The box says max res 340 by somehting, right?  How much more black and white would you like it?  This camera is great as a point and shoot and comes with some nice software.  I gave this to my daughter and she has had a blast.  For finish and proffessional work break out your check book people and spend dsome money.  Polaroid sells higher end models but they are not free!Read the instructions and if you can not upload check the ports that the camera is hooked up to.  The installation could not be any more idiot proof.  The camera needs to be in upload mode to upload.  READ!!", "Date": "December 29, 2000"}, {"Title": "Great digital camera for beginners", "Author": "\"djsonparkway\"", "ReviewID": "R1XCU81HVJ0DQ3", "Overall": "4.0", "Content": "I've owned my Polaroid 320 for about 6 months now and enjoyed it. I used it mainly for my online auctions. Most of the pictures were fair-good but after figuring out where to take the pictures(because of no flash) and how to use the software my pictures got somewhat better.It's a great camera to buy but I would advise learning about the software and experimenting with the camera before \"officially\" using it. Unfortunately because this camera is not USB \"compliant\" I am unable to use it with my new computer.", "Date": "November 17, 2000"}, {"Title": "One Star is  one too many for polaroid", "Author": "Wolfgang Hackenberg", "ReviewID": "R21F8Y4X7TJ9IF", "Overall": "1.0", "Content": "I just spent the whole Saturday trying to get the ArcSoft software to download the 30 photos from the Fun? 320 polaroid camera onto my computer (it was only going to take 18 shots  according to the manual). Unsuccessful, after several downloading attempts, I started sending an email to Arcsoftware, not expecting an answer in the hurry, I tried [their website] for help and landed here, being offered to buy a book about the camera. So glad I read about the experiences of fellow sufferers and I am sorry for the time and effort we all wasted. Let us send Invoices to polaroid for time spent with such a product. So glad I was saved from actually seeing the results of my efforts. I will be taking it back to the shop in the hurry - no worries. Will have to spend a heap more dollars..., but won't spend them on a polaroid product. A sure way to get happy customers - sell them something bad as long as it cheap. Smart business move polaroid!", "Date": "December 16, 2000"}, {"Title": "Another AOL customer burnt by this product", "Author": null, "ReviewID": "RCTYI0RVEK9TE", "Overall": "1.0", "Content": "Yes, I too was suckered by the AOL ad for their re-packaging of this product. A camera with no flash or flash connector is useless for indoor photos unless you live in a tanning salon. Also, the shutter speed is slower than a 60's Instamatic, making the camera useless for any action shots. This is a 99-cent plastic toy with a memory chip and a serial interface port glued on.", "Date": "January 2, 2001"}, {"Title": "It's all right for having fun.", "Author": "\"lealgetts\"", "ReviewID": "R1Y321RMZ1ON0U", "Overall": "3.0", "Content": "This one is okay. It takes its best photos midday, outside, at about ten feet. If you're too far away, it's not that great. If you're too close up, naturally you'll get a blurry photo. The flash often makes the object being  photographed a big, white glare. It's good for beginners, not too  expensive, and good to practise with. The software is not that great. You  should probably supplement with Adobe. Take a lot of pictures, and know  your camera for the best satisfaction in photoshooting. :-)", "Date": "June 23, 2000"}, {"Title": "A great kid's camera, but not good for much else.", "Author": "Brad P. Gurgel", "ReviewID": "R1KKT6YO29YKWB", "Overall": "2.0", "Content": "This is an extremely simple camera.  It has two modes; the basic point and shoot mode, and a timer mode.  The pictures will not come out clear; you will not be able to see small details such as what is written on a sign in the picture even if you are reletively close to the sign.  You will also not be able to print out pictures much bigger than a couple inches in vertical and horizontal length.  Any bigger of a picture will be extremely blurry. This would be a great camera to buy for your kids.  They should find it fun to use and it is cheap for them to use since film is not needed.  This will save you a lot of money.  The battery life is great, since this camera lacks an LCD screen or flash.  I have used the same battery in the camera for the whole year that I've had it.  The lack of flash is a big problem, however.  Unless the subject of your picture is near a bunch of lamps or under a brighter light, you will be disssapointed at the outcome.  I've also found out that out of a batch of about 20 pictures, about 5 or 6 of them will not turn out very well for some unknown reason, even if you had adequate lighting. This can be very frustrating, especially if one of your more important photos does not turn out. A slow shutter speed also can be a problem.  The picture can be taken with an adequate shutter speed in good lighting, but I have found in a dimly lit room it is tough to take a picture of something that is moving without it being a big blur. If you are looking to purchase an easy to use camera that will take photo quality 5x7 and 8x10 prints, I would suggest the Fuji FinePix 2300.  This camera, like the Polaroid Digital 320, also comes with a starter kit.  The FinePix 2300 is a 2.1 mega-pixel camera. This is a very good price for a 2 mega pixel camera that takes very high quality photos. If you want photo quality 5x7 prints I would not go lower than a 2 mega-pixel camera.  Any camera in the 1 to 1.3 mega-pixel range should be adequate for emails and for posting on the web. In conclusion, this camera is a great camera to get for your kids, but if you are looking for a camera to take pictures to email, print out, or put on the web, you will be dissapointed with this one.", "Date": "July 3, 2001"}, {"Title": "Not -SO-Good", "Author": "John", "ReviewID": "R1HVJXGS30VEVB", "Overall": "2.0", "Content": "I found that the camera was not as good as they had admitted. Oh dont get me wrong for the price it's great ( for outdoors in daylight ) it takes a good picture but still pixelated and it does show up \"boxy\"", "Date": "December 6, 2000"}, {"Title": "FREEBIE FROM a company FOR SWITCHING MY LONG DISTANT CARRIER", "Author": null, "ReviewID": "R278FSAR49PLJR", "Overall": "1.0", "Content": "I read everybody elses reviews and am sadden by a company offering a piece  of garbage to a new customer! Obviously it was or will be pulled from the  market and needed a quick way to get rid of overstock!", "Date": "August 13, 2000"}, {"Title": "guaranteed out-of-focus shots", "Author": "L. Levine", "ReviewID": "RD455VAXN2DPT", "Overall": "1.0", "Content": "When I purchased this inexpensive camera, I expected poorer than average  image quality, but I never considered that the images might be unusable.Every single shot taken by this camera appears badly out of focus.  Shots I took at 5 inches (!) looked no worse than those taken within the recommended 3-6 feet.  Some reviewers seem to think that the poor quality is because of the small size of the images - but on web pages, 0.07 megapixel images should look just fine.", "Date": "August 26, 2004"}, {"Title": "Remember you get what you pay for", "Author": "J. Lachiana \"engfant\"", "ReviewID": "RMDBNT8F803G5", "Overall": "4.0", "Content": "This is probably the only digital camera that you'll find [for the money]. I understand that times are tough these days but anyone that expects spectular performance for what is basically a kid's toy is lying to themselves. The sad thing is it takes better pictures than the low end Sony cameras and they claim to be Megapixel cameras! All this thing does is snap small digital images approx wallet size. No bells or whisles just 2 buttons. So stop complaining that the camera is junk because the thing doesn't cost much more than a disposable and if you get a year out of it you got your money's worth.", "Date": "August 9, 2002"}, {"Title": "LOOK AT THE PRICE -- AND THE SPECS", "Author": "D. C. Squires", "ReviewID": "RO9K2OO9W8IOH", "Overall": "3.0", "Content": "With all of the negative comments from the buyers, etc., one would expect less than spectaular results with this digital camera.  Look first at the specifications -- no flash, minimal memory, etc.  This is a good value for the novice, however, if you are expecting perfection and flawless digital photography, spend some more $$$$.  You get what you pay for.  All in all, it's a fair camera for the price -- just dont expect something for next to nothing.  Great for kids, on-line sellers or just as a \"toy\".  I purchased it (for less than the price noted) not expecting a miracle camera for the price and am pleased.  Now that I know what to expect with the software, I'll save my pennies and purchase a better digital camera in the future.DO NOT EXPECT ALOT WHEN YOU DO NOT PAY ALOT....", "Date": "March 15, 2001"}, {"Title": "This is a toy!", "Author": null, "ReviewID": "RCWWO0QWDXB92", "Overall": "1.0", "Content": "This is a good camera for a child!  Received this as a gift.  I didn't have any trouble taking pictures or downloading them onto my computer.  The trouble is the pictures are unclear, and when you try to print them--the smaller the better--which defeats the purpose of having a digital camera in the first place.Again, this is a good camera for a child who is just getting interested in digital photography.  I plan on saving up and getting a real digital camera in the near future.", "Date": "December 29, 2000"}, {"Title": "Not bad, but not great", "Author": "\"rhoooob\"", "ReviewID": "R1M5VCFCO3IH8R", "Overall": "3.0", "Content": "I got this camera as a christmas present.  It is very easy to use but the pictures are not great quality and blur with the tiniest jerk of the camera.  It comes with good software and with that you can fix some of the pictures, but it has a fairly small chip.  I would reccomend getting this only for a beginner.", "Date": "January 3, 2001"}, {"Title": "This is a cheapo camera - pay a little expect a little", "Author": "\"puppypokey\"", "ReviewID": "R301T5DTK8HM9T", "Overall": "5.0", "Content": "Don't expect a lot from this camera. 8 shots in memory +/-, can't change memory cards, and low resolution.That said, it is a handy alternative to disposable 35 mm cameras. A utility camera. (not one to use on a family vacation or for any detailed pics).5 stars b/c it is worth the price.", "Date": "October 11, 2000"}, {"Title": "A piece of junk", "Author": null, "ReviewID": "R3BPIHDE5Z4RIH", "Overall": "2.0", "Content": "Flash didn't work most of the time and if it did, it took to long to set itself up again.  Had to change batteries constantly!!", "Date": "February 20, 2004"}, {"Title": "good for a first digital camera", "Author": "Angelina Glass \"angelinaglass\"", "ReviewID": "R3TSA55WDCQHV4", "Overall": "2.0", "Content": "This camera is basically only good for someone that doesn't know alot about computers and digital camera.what stinks about this camera, is there is no flash....and you can't buy a memory card to store more pictures, so it's not good for a vacation.the quality wasn't the best, kinda grainy....but if you're just looking for a simple camera to learn the basics of how to work digital cameras, this is a good way to learn w/o spending too much money", "Date": "February 4, 2004"}, {"Title": "Polaroid photo does not work on Windows XP", "Author": null, "ReviewID": "R3LWFH4SL8HOM1", "Overall": "1.0", "Content": "I bought this inexpensive camera locally and after I had opened the package and tried to install it, it informed me it was not compatible with Windows XP.  Therefore, I have wasted my money and as this only has internal pictures, I cannot download them.", "Date": "March 22, 2002"}, {"Title": "Good for only some.", "Author": "Billy Vaughn", "ReviewID": "RMNQWK64G4PM6", "Overall": "2.0", "Content": "I do have to say that I am glad I got this camera for free in a contest. I sell items on ebay and found out that picturs make all the sells.For my big items like cars and truck this is an ok camera. Sure the resloution is not so great but it gives people the idea. But for the items that I just don't feel like taking outside you have to have just the right amount of light. If you have too much or too little it turns out to be a bad picture. And don't plan on taking live action pix. unless you love blury shots.Even a slight move messes it up. But I say Buy at your own risk.", "Date": "February 15, 2001"}, {"Title": "This camera is [bad]!", "Author": "\"jonahandrew\"", "ReviewID": "R2V5K2OR8KZI4M", "Overall": "1.0", "Content": "Don't lower yourself to buying this camera -- even if you feel you MUST have a digital camera.  I ownED it and (a) the photo quality is very low, (b) there is NO flash, and (c) it takes very poor photos (they're low in color, etc..).  I would look to Olympus for ANY type of DIGITAL camera as they good ratings both on the expensive AND budget-priced digital cameras.Jonah Andrew B.Photographer[...]", "Date": "October 10, 2001"}, {"Title": "For kiddies only", "Author": "Bill Fuller", "ReviewID": "R2SNWYTMMJOBC7", "Overall": "1.0", "Content": "The kindest thing I can say about it is at least it is cheap.  There is no resolution to speak of, everything is blurred and almost completely unrecognizable.  Save your money and get something better.", "Date": "January 8, 2002"}, {"Title": "don't waste the [money] go ahead and spend a little more.", "Author": "Russell Turner", "ReviewID": "R16WQZJWOIW67S", "Overall": "1.0", "Content": "This is junk the images are awful.  You can hardly tell what the picture you took was.  forget about low light you have to have max light to even take a picture.", "Date": "November 23, 2000"}, {"Title": "Surprisingly pleased!", "Author": "Julia", "ReviewID": "R1UIETX2YUIW64", "Overall": "4.0", "Content": "I purchased this camera for the sole purpose of sending pictures to family.  I was pleasantly surprised at the sharpness of the pictures.  Considering the price for the camera, it is well worth the money.  (of  course, if you expect this to take professional pictures, then buy a  professional camera!)", "Date": "June 30, 2000"}, {"Title": "Not that Great...", "Author": null, "ReviewID": "R33N0EXDSHDJKZ", "Overall": "1.0", "Content": "I really think Polaroid could have made the camera with more pixels.  The camera is fine for beginners, but beginners should get something out of it besides a small amount of pixels.  What really sucks is that in the sample album, the pictures probably weren't from the camera at all.  They look too good to be from a camera with such bad pixels.  You have to have so much light just to have a good picture.  I really should have NOT bought this camera.  Oh, well.", "Date": "December 24, 2001"}, {"Title": "I love my camera", "Author": "Cynthia F. Utterback", "ReviewID": "R270V57K9C4RJG", "Overall": "4.0", "Content": "I am novice at the computer and this camera was easy for me to install and use. I mainly use it to take pictures of the grandchildren to send over the internet to friends and selling things on auction. No, they are not professional pictures and I've never printed one out but if you just love taking pictures and want to save the picture developing charges...this is the way to go.At least it is for me and I have enjoyed my camera tremdously!!!!!", "Date": "August 11, 2001"}, {"Title": "A Piece Of Junk", "Author": null, "ReviewID": "R3NRKPAQIGOTKZ", "Overall": "1.0", "Content": "I'm ashamed to have chosen one star for this product.  If I was able to click -0-, I would have.  Don't waste your money on the Polaroid 320.  Trying to get the pictures to download is a trauma in itself.  It's a piece of junk.", "Date": "April 12, 2001"}, {"Title": "Good for beginners", "Author": "lawana harbin", "ReviewID": "R5U9YP71B2BBN", "Overall": "3.0", "Content": "I bought this camera for my 11 year old son. It was money well spent. The pictures aren't excellent, however in some lighting situations, they are very good. This camera has been a LOT of fun for my son. The specs say they store 18 pics, but ours holds 40! The software included is fun and easy to use for his age group. In our opinion, this makes a great 1st digital camera.", "Date": "December 26, 2000"}, {"Title": "Not A BAd Camera if You Have No Other.", "Author": null, "ReviewID": "R31O0RNXIC006J", "Overall": "3.0", "Content": "I DOnt Have A digital camera so this one will do just fine.But everything must be done in Bright Light or else the picture comes out poor.i would say if you dont own a camera & dont wanna spend alot of money this is not really alot of money to spend. But dont expect AWSOME pictures the pictures just get by with alot of help with a picture editing program. But hey its my 1st camera & i think i can make it work. (just affaid to grab the camera to tight affraid i might brake it)Buy one for FUN!.", "Date": "December 26, 2000"}, {"Title": "not worth the money", "Author": null, "ReviewID": "R1Y7804K1EJ6QQ", "Overall": "2.0", "Content": "I was given this camera as a Christmas gift. I can't believe that a camera was actually produced in this day and age without a flash. It is useless unless you are outside. Even outside, you can only take close up shots and they don't come out really well.  Forget distance shots!  Other reviewers are recommending this for a child but I wouldn't even waste the money to do that. I'd rather buy a cheaper 35mm camera with a flash for someone just beginning to take pictures.  I'd definitely stay clear of this one!", "Date": "March 25, 2001"}, {"Title": "Not too bad!", "Author": "Eddie Akerman", "ReviewID": "R1EBD46Y8AG3ZJ", "Overall": "4.0", "Content": "I bought this camera as a teenage who whats to take quick cheap easy photos and this camera is perfect. Alright the picture quality isnt amazing, but if you scale it down to 75% and use the software the photos are good enough for me!The camera is very light, quite good-looking and easy to use. It doesnt have a flash - but that doesnt seem a problem to me! If you want great pictures quality and all the extras be prepared to spend £150+, but for £40 this is a brilliant camera!I'd give it 5/5 for value for money and definatley recommend it to any beginner or young person just for a laugh - but its not for professionals! ENJOY!", "Date": "March 23, 2001"}, {"Title": "Great kids' camera!", "Author": null, "ReviewID": "R2OF2N03Z1AWJQ", "Overall": "5.0", "Content": "I got this for my 3-year old son who kept wanting to borrow Daddy' digital camera to take his own pictures of his toys and pets. I used to let him handle my high-end Canon, but was always wary since it was on the expensive side. Luckily, I found out about this cheap entry-level Polaroid model that seemed perfect as a kids' toy, and true enough, he loves it! We upload his pictures together and he has lots of fun telling stories with the shots of toy trucks and cars that he took. Sure, it's more expensive than a 35mm or iZone kids camera, but the advantage is that it doesn't use any film or paper, so you there are no wasted shots and it comes out cheaper in the long run.", "Date": "April 28, 2001"}, {"Title": "Smarter in the future", "Author": "D. E. Denman", "ReviewID": "R2QCQHZJ9K71FC", "Overall": "1.0", "Content": "I would have to agree that this product seems to be more a toy, than a camera.  I purchased the Poloroid Izone last year for my daughter, at half the price and it was a much better product.  I have no one to blame except myself.  I should have immediately returned it to Aol, and will be much smarter about my purchases through them in the future.  I was just so excited to be able to take pictures, upload and send.  Wouldn't embarrass myself at this point.  Would really like to try and sell on the netmarket, but would be too humilating to do to someone else.", "Date": "January 2, 2001"}, {"Title": "I PURCHASED BLURR", "Author": null, "ReviewID": "R18JR9IRJQT2D5", "Overall": "1.0", "Content": "I bought this camera....  Took pics all day long and went home all excited only to find some of the blurriest pictures I have ever seen!  They turned out the same way I see things when I DONT wear my glasses.  Very bad quality.  I would take the camera back and get my money back, but I dont want to put MORE time into a bad purchase.", "Date": "January 15, 2002"}, {"Title": "Very poor camera", "Author": "Alan Bouyssou", "ReviewID": "R2K1B63QFAP4KT", "Overall": "1.0", "Content": "This cheep plastic camera is not worth the effort to produce. The tiny photos are grainy and hard to make out. Don't waste your money on it. I ended up trashing it because it's useless.", "Date": "November 5, 2001"}, {"Title": "Not worth it even if it was free", "Author": "R. Patterson \"Designer\"", "ReviewID": "R2FKPOD0XOA4EB", "Overall": "1.0", "Content": "I cannot express how disappointed the performance of this camera is. I am  an artist and I wanted something easy to take quick reference photos, and I  thought this would be the ticket. The images are so weak, blurred and  colorless. I won't buy another Polaroid camera ever. The software was also  junk.  Don't waste your time.", "Date": "September 4, 2000"}, {"Title": "Does work with Windows XP", "Author": null, "ReviewID": "RTU8KNCG6OM0J", "Overall": "4.0", "Content": "This Camera does work with windows xp except to make it work you have to change the compatibility on the setup file from xp to 95 or 98 so it will work except you have to do some things before.This camera is a great bargain except if it had a flash it would be much better", "Date": "June 12, 2002"}, {"Title": "useless camera!", "Author": "Marlene Arteta", "ReviewID": "R1Y64TET3O53OD", "Overall": "1.0", "Content": "do not purchase this camera. You have to have VERY bright light to get any sort of decent photo. Clear waste of money", "Date": "August 28, 2001"}, {"Title": "LOTS OF FUN", "Author": "MINDY MILLER", "ReviewID": "R2TZTQB1N5IV8V", "Overall": "4.0", "Content": "THIS CAMERA IS GOOD IF YOU'RE LOOKING FOR LOTS OF FUN.  I LOVE PHOTOGRAPHY AND WILL PROBABLY NEVER HAVE THE MONEY TO BUY A REAL GOOD DIGITAL CAMERA, BUT THIS CAMERA SERVES IT'S PURPOSE, IS GOOD ENOUGH FOR SCRAPBOOKING AND FOR THE OTHER THINGS I WANT AND NEED IT FOR.  I'M SURE IT WILL SAVE ME MONEY ON DEVELOPING AND THERE'S NOTHING LOST IF YOUR PICTURES DON'T COME OUT RIGHT, YOU JUST DELETE THEM. I HAVE A VERY GOOD 35 MM CAMERA THAT I ALSO CARRY AROUND WITH ME AND THAT'S USED FOR ALOT OF THINGS ALSO.  BUT REALLY, YOU CAN'T BEAT THE PRICE OF THIS CAMERA AND IT'S GOT A GOOD NAME BEHIND IT.", "Date": "August 18, 2001"}, {"Title": "GARBAGE!!", "Author": "Aaron", "ReviewID": "RESPY1VOSK5YJ", "Overall": "1.0", "Content": "THIS CAMERA WAS THE WORST CAMERA I HAVE EVER HAD, I HATE IT. IT TAKES THE WORST PICTURES I HAVE EVER SEEN AND WITH NO FLASH IT IS A PEICE OF JUNK THAT SHOULD BE THROWEN AWAY. PLEASE IF YOUR THINKING OF BUYING A DIGI CAM BUY SOMETHING ELSE......I am planning on buying the poloroid PDC-700,... ...AND GO FOR VALUE IN THE CAMERA NOT JUST THE CHEAP PRICES..", "Date": "April 20, 2001"}, {"Title": "Not worth the money", "Author": null, "ReviewID": "R3G4D48SPFI7JW", "Overall": "1.0", "Content": "I found this camera VERY unsatisfactory. It seems like a waste to even produce something of such poor quality. No flash, does not focus well on still objects. The pictures are grainy at best, not at all like the ones in the sample gallery. Hardly worth giving this to a beginner, they will only be disappointed in the ability of the camera. If you are a photographer, forget it. You truly get what you pay for. Not worth the shipping cost. What was Polaroid thinking?", "Date": "April 6, 2001"}, {"Title": "UNSHARP", "Author": "Manni", "ReviewID": "R1TUX14SKMVF1E", "Overall": "1.0", "Content": "You can do what you want. Sun or not, with self-timer or not. The pictures are always unsharp.", "Date": "February 20, 2001"}, {"Title": "this product is a winner 5 stars!", "Author": "keith", "ReviewID": "RKTM7XPQ0H3YV", "Overall": "5.0", "Content": "this product is a winner 5 stars! a great starter camera for young or old", "Date": "September 22, 2009"}, {"Title": "couldn't use for anything!", "Author": null, "ReviewID": "R16ANOLZAAQNRN", "Overall": "1.0", "Content": "I bought this camera hoping to use it to take pictures of stuff to sell in online auctions... and couldn't even use it for that, as every picture was very blurry, and it was very hard to get any detail, except with TONS of outside light.  The only thing was able to do successfully was \"impressionistic\" artwork of flowers!", "Date": "May 9, 2003"}, {"Title": "Needs Contact Lenses", "Author": "Belinda", "ReviewID": "R124PAIMGFCQY3", "Overall": "2.0", "Content": "This digital camera needs contact lenses! The images produced by the camera were all blurry, just like my eyes without glasses. I admit that it is easy to use but the resolution is not satisfactory.", "Date": "January 2, 2003"}, {"Title": "Blurry picture", "Author": "Disgruntle buyer \"whizstudent\"", "ReviewID": "RQ7CXLRA0XEG3", "Overall": "1.0", "Content": "I own this digital camera-- thought that it would produce good pictures.. I am indeed dissappointed with this product. I would not recommend this product to anyone.. Now, I am looking for a new and good digital camera or camcorder.", "Date": "December 23, 2002"}, {"Title": "Polaroid Photo Max Fun! Digital 320 Creative Kit", "Author": null, "ReviewID": "R2FA6EQKAR693Z", "Overall": "4.0", "Content": "It would be so much better with a flash but inside pictures dont turn out good at all unless there is a lot of light. The pictures turn out awesome outside during the day. I reccomend it if your just learning about digital cameras.", "Date": "April 7, 2002"}, {"Title": "photomax", "Author": null, "ReviewID": "RKJ7EV7LQWZK9", "Overall": "5.0", "Content": "i took some pics today they were clear and perfect i like this camera alot and i bought it from amazon in 2000 and it has a great look", "Date": "January 12, 2002"}, {"Title": "NO FLASH!!!!!", "Author": "FOREST BLADES", "ReviewID": "R147CE48C9GDOV", "Overall": "1.0", "Content": "NO FLASH WITH A TYPE OF CAMERA THAT NEEDS ALL THE LIGHT IT CAN GET?", "Date": "December 20, 2001"}, {"Title": "checksum error", "Author": "jackie", "ReviewID": "R81KOLT4FXD9Q", "Overall": "1.0", "Content": "I bought this camera while on a trip. Never do that with pictures you can not replace. I was not able to download any of the pictures- kept getting a checksum error. Polaroid tech help was bad, they said it was my pc( a new hp).I tried it on another pc and the same error happened. After one month of going back and forth I am now returning it to polaroid.  I would not  recommend this camera to anyone of any age! Shame on me for not reading the reviews!!!", "Date": "May 7, 2001"}, {"Title": "The Digital 320", "Author": null, "ReviewID": "R107A2CCHQH1V", "Overall": "1.0", "Content": "After using this camera once, I was thoroughly dissapointed.  It seems strange that Polaroid would produce a camera with such horrible picture quality.  I couldn't even see what I had taken a picture of.  To boot, they supply you with a sample gallery of great pictures, crisp and clear.  Then you can begin to take pictures that all look like the worst out of focus pictures you've ever taken with a nornal camera-and thats if your subject is perfectly still.  Save your money and a lot of frustration.", "Date": "March 29, 2001"}, {"Title": "Not even worth one star!", "Author": "Roberta Egby", "ReviewID": "R1Y96HC6S9Q5X6", "Overall": "1.0", "Content": "Big waste of money.  Spent two days trying to unload the camera.  My daughter is not pleased.  Will take it back to the store.", "Date": "December 27, 2000"}, {"Title": "not worth the low price", "Author": "Jackie Reid", "ReviewID": "R8RUH0NXIK6SO", "Overall": "1.0", "Content": "i received this camera as a gift and was so excited! i took pictures, loaded the software and i kept getting \"camera could not be found.\" i exchanged the camera for another and got the same results. i finally got a total refund. i'm still looking for an affordable, good digital camera.", "Date": "December 27, 2000"}, {"Title": "polaroid digital camera 320", "Author": "bonnie armstrong", "ReviewID": "RFSBVBDQNWKGM", "Overall": "1.0", "Content": "this camera was baught as a gift for my 15 yr old daughter as a starter camera . what a joke. it says it is compatible with windows xp sure after u buy it and try to download it then tell me how compatible it is. IT DOESNT WORK!! serious waste or money even a kids camera cause after u buy it you cannot do anything with it except look at it sit there. think about purchasing such a camera. and i dont rate 1 star either i tried to put no star made me put 1 of 5...", "Date": "February 6, 2003"}, {"Title": "HELP", "Author": "KRISTI SMITH", "ReviewID": "R1E16CG1WLORCJ", "Overall": "2.0", "Content": "I RECIEVED THIS CAMERA FOR CHRISTMAS. I HAVE NO YET HAD A CHANCE TO USE IT, BECAUSE WHEN I RECIEVED IT, THE CORD THAT CONNECTS TO THE COMPUTER WAS CUT IN HALF.I HAVE TAKEN PICTURES BUT I CAN NOT RETREVE THEM BECAUSE THE CORD WAS CUT IN HALF. I HAVE TRIED TO CALL CUSTOMER SERVICE TO FIND OUT WHERE I COULD GET ANOTHER CORD, BUT THEY WERE NO HELP. IF ANYONE COULD PLEASE HELP ME OUT, LET ME KNOW WERE I CAN GET ANOTHER CORD I WOULD BE VERY HAPPY. I HAVE TRIED LOCAL CAMERA STORES, THEY DO NOT CARRY THEM. SO IF SOMEONE COULD PLEASE HELP, I WOULD LOVE TO TRY MY NEW CAMERA", "Date": "January 4, 2002"}, {"Title": "GREAT FOR THE PRICE", "Author": "Ann", "ReviewID": "R1MDZCT3Q0C0BF", "Overall": "3.0", "Content": "You definitely get what you pay for!  I purchased mine just to email pictures to my friends and family and it works great. I still use my regular camera for important pictures that I want printed.It's a very simple camera for very simple purposes so if you are one of those cheapskates who thinks they'll get high quality for pennies, you better look elsewhere.  You do need a good amount of light since it does not have a flash, but you can't take pictures without light even with a regular camera. Overall I'm very happy with mine and it fufills the purpose intended.", "Date": "December 26, 2001"}, {"Title": "Ok Camera if you don't want to spend lots of money", "Author": "Amazon Customer", "ReviewID": "R391HJ2GFBZ6HE", "Overall": "4.0", "Content": "This is my first digital camera, and I don't have the pile of money to spend right now so this camera seems to be fine for kids or beginners (not professionals). I took a few pictures of my pet and it turned out ok, but not sharp enough. I emailed the pictures and everyone can still tell it's my pet so it is fine for emails or something simple like that. If you want better pictures and flash to go with your camera, better save your money for a better digital camera. This camera is not bad at all to me, and I saved a bundle too. After I use this one up, and I find work soon, I will save up for a better digital camera. This one is good practice for me to learn how to use one!", "Date": "September 29, 2001"}, {"Title": "Stop -- put your card away! It's not worth it", "Author": "Jim Dare", "ReviewID": "R1MVUUQNA1JT3D", "Overall": "1.0", "Content": "Not only is this camera awfull -- it's not even suitable for kids, unless as a parent you enjoy tearing your hair out while you try and fix serial port conflicts so that the little ones can enjoy a two inch square photo with less than 72 pixels per inch. I will probably never buy another polaroid again based on my experience with this one.", "Date": "May 25, 2001"}, {"Title": "It's pants pants pants pants pants.", "Author": "Nick Hills", "ReviewID": "R26DXPOEU78V2X", "Overall": "1.0", "Content": "I bought this as a cheapy fun camera.  It's not fun it's depressing.  The pictures wether indoors or outdoors are absolutely terrible.  I took mine back and got my money back.  Polaroid have always had a good name in my books, now they have sunk to the lowest of the low.  I eventually bought a l'eprit mn100, same resolution, 500% clearer images, sensor that wont let you take pics in too low light. optimised for indoor lighting.  20 big or 80 small pics and can be used as a webcam. I am now truly happy.", "Date": "December 24, 2000"}, {"Title": "it needs Windows2000 s/w to overcome compatibility problem", "Author": "Rao", "ReviewID": "RHT8CYJGPRKTI", "Overall": "2.0", "Content": "i am unable to download the photoes to my PC b'cos my pc is winodws2000. the s/w provided with the camera is for win98 .so it would be better and helpful to furnish with windows 2000compatible s/w or atleast windows NT compatible.", "Date": "December 5, 2001"}, {"Title": "Shame on Polaroid", "Author": "JSWilson \"coolstar\"", "ReviewID": "R2G3GUWANICYEE", "Overall": "1.0", "Content": "My 6 year old got this camera for Christmas. I did not expect much but got astonishingly less. The resolution is great (for 6 year olds and email). The quality of the pictures is horrible. I would not trust a company that put their name prominently on a camera like this. This camera needs A LOT of light! The compromise on the flash is acceptable at its price. However, there is no excuse for the quality of the pictures, blurry and out of focus, even when a tripod is used to take a picture of a stationary object.", "Date": "January 16, 2002"}, {"Title": "GARBAGE!!!!!!!!!!!", "Author": "Aaron", "ReviewID": "R81H8G6NOHJ35", "Overall": "1.0", "Content": "THIS CAMERA WAS THE WORST CAMERA I HAVE EVER HAD, I HATE IT. IT TAKES THE WORST PICTURES I HAVE EVER SEEN AND WITH NO FLASH IT IS A PEICE OF JUNK THAT SHOULD BE THROWEN AWAY. PLEASE IF YOUR THINKING OF BUYING A DIGI CAM BUY SOMETHING ELSE......I am planning on buying the poloroid PDC-700, if anyone could give me some info on it it would be appreciated, please  email janheit@uswest.net.......AND GO FOR VALUE IN THE CAMERA NOT JUST THE CHEAPPRICES..", "Date": "April 20, 2001"}, {"Title": "Emailing The Photo", "Author": "Ann Reinke", "ReviewID": "R2RBHX6MPME7YG", "Overall": "3.0", "Content": "I recieved this camera this past March.I since have played with it to email the photo's out.The instruction booklet was of no use. Since then I havemissed placed it.I had called the company for help.They were of little help may I say.So here I sit with this nice digital camera, no instructionand not a clue how to email out my photo'sCan you help??ThanksAnn", "Date": "December 28, 2001"}, {"Title": "LOTS OF FUN", "Author": "MINDY MILLER", "ReviewID": "R19GLF3GSH7RP1", "Overall": "4.0", "Content": "THIS CAMERA IS GOOD IF YOU'RE LOOKING FOR LOTS OF FUN.  I LOVE PHOTOGRAPHY AND WILL PROBABLY NEVER HAVE THE MONEY TO BUY A REAL GOOD DIGITAL CAMERA, BUT THIS CAMERA SERVES IT'S PURPOSE, IS GOOD ENOUGH FOR SCRAPBOOKING AND FOR THE OTHER THINGS I WANT AND NEED IT FOR.  I'M SURE IT WILL SAVE ME MONEY ON DEVELOPING AND THERE'S NOTHING LOST IF YOUR PICTURES DON'T COME OUT RIGHT, YOU JUST DELETE THEM. I HAVE A VERY GOOD 35 MM CAMERA THAT I ALSO CARRY AROUND WITH ME AND THAT'S USED FOR ALOT OF THINGS ALSO.  BUT REALLY, YOU CAN'T BEAT THE PRICE OF THIS CAMERA AND IT'S GOT A GOOD NAME BEHIND IT.", "Date": "August 18, 2001"}, {"Title": "You get what you pay for...", "Author": "Gustavo Fischer", "ReviewID": "R3L62WVDWQPNIM", "Overall": "3.0", "Content": "For starters, the camera only works with BRIGHT lights. It doesn't include a flash. Also, the image quality is far from good, so it's just for putting on a web page, for instance, which is what I use it for. On the good side, it is cheap, easy to use, and the battery lasts a long time", "Date": "August 15, 2001"}, {"Title": "Don't expect much....", "Author": "SugaryLemons", "ReviewID": "R3C072Q5T1UHL6", "Overall": "2.0", "Content": "I got this camera so I wouldn't have to get the film developed. lol. I also bought it for simple snap shots. What I like is that you can download the pictures onto your hard drive, erase them from your camera if you don't like them, comes with a battery and cord, you can retouch photos (not in a professional way), add special effects, take video captures, and play with 'photo fantasy' (your face on someone elses body). It doesn't take the good photos (made me rethink why I didn't get a camera with film). This Polaroid is only for kids or those who is new to digital cameras. Start with this model and get familiar with it, then buy a better camera.", "Date": "September 8, 2002"}, {"Title": "not good at all", "Author": "Judy malone", "ReviewID": "R3PELS519GBQDM", "Overall": "1.0", "Content": "this camera is a waste of money, please just take my word on it, it is a good price but you do get what you pay for this is not even good for a kid.", "Date": "May 31, 2002"}, {"Title": "WANTING HELP AND NOT GETTING IT", "Author": "Gwen Cradle", "ReviewID": "R36G2NQAWZ5OED", "Overall": "2.0", "Content": "I BOUGHT THE CAMERA SINCE I NEEDED SOMETHING TO LEARN ON BEFORE TAKING  MY VACATION 07/2002.I HAVE TRIED TO DOWNLOAD THE PICTURES TO NO AVAIL.I'VE TRIED TO CONTACT VIA THe WEB,WHICH IS NO LONGER WORKING.tHE HOURS LISTED FOR AVAILABILITY IS NOT CORRECT.i HAVE YET TO SPEAK TO A REPRESENTATIVE OR SPECIALIST.aT THIS POINT, THE PICTURES REMAIN IN THE CAMERA SO i CANNOT ATTEST TO HOW GOOD,OR BAD THEY ARE.I DO BELIEVE iF I EVER TALK TO A LIVE BODY,I WILL HAVE SOMETHING TO RATE.", "Date": "November 14, 2002"}, {"Title": "I LOVE MY DIGITAL 320 CAMERA !", "Author": null, "ReviewID": "R2IN4VI7ROARQX", "Overall": "5.0", "Content": "AFTER ALL THE NEGATIVE REVIEWS ABOUT THE DIGITAL 320 CAMERA, I HAD TO LET THE FOLKS OUT THERE KNOW THAT I GOT A BARGAIN WHEN I GOT MY DIGITAL 320 CAMERA.LAST JANUARY, THAT WILL BE A YEAR NEXT WEEK,I GOT THIS CAMERA AS A GIFT.  I WAS TOLD THE CAMERA AND SOFTWARE COST ABOUT THIRTY TWO DOLLARS. LOOKS LIKE YOU CAN A GREAT DEAL ON THIS WEBSITE. IF I HAD TO PAY EIGHTEEN DOLLARS IT WOULD BE A TRUE BARGAIN, THAT IS IF THE SOFTWARE WAS INCLUDED IN THE PRICE. IN OTHER WORDS YOU ARE PRACTICALLY GETTING THE CAMERA FOR FREE FOR WHAT YOU GET IN RETURN....DEFINITELY A REAL BARGAIN.HERE ARE SOME OF THE REASONS I SAY YOU ARE GETTING \"SUCH A GOOD DEAL.\"**  SAVE YOURSELF BUCKETS OF MONEY, DOESN'T USE FILM AND  NO TRIPS TO THE STORE TO BUY FILM OR MORE FILM WHEN ALL OF A SUDDEN YOU NEED TO TAKE MORE PICTURES.1.  TAKES UP FROM TWENTY-FIVE TO THIRTY-THREE PHOTOS AT ONE TIME.2.  AFTER YOU DOWNLOAD AND IF YOU DON'T LIKE THE PICTURE(S),  ALL YOU DO IS ERASE OR DELETE THE PHOTO YOU DON'T WANT.**  AFTER DOWNLOADING GO OUT AND TAKE MORE PICTURES....3.  E-MAIL PHOTOS TO FAMILY AND FRIENDS. (USE JPEG WHEN E-MAILING).4.  USE PHOTOS AS WALLPAPER OR SCREENSAVER. (ON THE INTERNET)5.  MAKE A PHOTO ALBUM--FOR INSTANCE, PHOTOGRAPH THE STEPS IT TOOK YOU TO LANDSCAPE YOUR LAWN OR BUILD A DECK.6.  YOU CAN FILE AND SAVE THOUSANDS OF PHOTOS. **RETRIEVE PHOTOS AT A MOMENTS NOTICE......OR TAKE A PHOTO AT A MOMENTS NOTICE.7. ENLARGE, ENHANCE COLORS, USE THE SOFTWARE TO CREATE CHARACTERS, CALENDARS, POSTERS, ETC.8.  COMPARE PRICES AND FEATURES, FOR THE PRICE, IT'S A REAL BARGAIN.THIS IS NOT NEGATIVE BUT JUST A REMINDER THAT YOU NEED TO KEEP THE ON/OFF SWITCH IN AN OFF POSITION WHEN NOT USING THE CAMERA OR BEFORE AND AFTER OR IN BETWEEN TAKING PHOTOS, YOU CAN WEAR DOWN YOUR CAMERA'S BATTERY VERY QUICKLY IF YOU FORGET TO TURN OFF THE SWITCH.HAVE FUN!", "Date": "December 28, 2002"}, {"Title": "polaroid", "Author": null, "ReviewID": "R29R96G8XLGM8", "Overall": "4.0", "Content": "this camera is ok it was a little annoyin because the pics come out to small and when u blow them up there to blurry i think u should of add a type of tool to make the blurryness go away!!", "Date": "January 21, 2002"}, {"Title": "i lost the software to my polaroid digital 320 camera", "Author": "frank m foster", "ReviewID": "R1WP52Z9167DVL", "Overall": "3.0", "Content": "so wood polaroid send me the sofware for my camera  my polaroid digal 320  s/n.049pson106858 to 17427 donert-st hesperia ca 92345", "Date": "October 8, 2001"}], "ProductInfo": {"Price": "$59.99", "Features": "320 x 240 0.07 Megapixel Resolution Appropriate For On Screen Viewing And Emails But Not For Prints\nHassle Free Fixed Focus Lens\nInternal 500 KB Memory Holds 29 Images At Default Resolution\nConnects To PCs Via Serial Port\n9 Volt Battery Included Very Simple Design no flash Zoom LCD Or Removable Memory", "Name": "Polaroid Photo Max Fun 320 0.07MP Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41FTZ2B2JBL._SX300_.jpg", "ProductID": "B00004RFB8"}}