{"Reviews": [{"Title": "Old Pentax lenses can be used with this camera", "Author": "M. K. Buike", "ReviewID": "R3LYTNSO2SF1X7", "Overall": "4.0", "Content": "I made the decision a few months ago that the time was right to buy a digital SLR.  I considered a number of models.  What sold me on this one was that I am able to use my very old, but very good, lenses. [...]I had 4 Pentax ME Super bodies from the 1980's.  My lenses also date from that time.The manual was not very helpful in figuring this out.  It does require a setting change and one can shoot in only manual focus mode with aperture priority.  It's very much like shooting with the old ME's but with a 6.3 megapixel digital image as the result.From the menu, go to \"Custom Setting,\" scroll down to \"Using aperture ring,\" set to \"Permitted.\"", "Date": "December 27, 2005"}, {"Title": "A superb starter dSLR", "Author": "Deacon Thom", "ReviewID": "R1QBM479XVZB6V", "Overall": "5.0", "Content": "I first tried out this camera at a local camera store, and was impressed with its heft, its handling, and its surprisingly simple and intuitive LCD menu.  I decided to take the plunge, and haven't looked back!The pictures are unfailingly good, and the camera performs just as capably as my old Canon (film) SLR.  Better still, since it's digital, I can experiment, see the results immediately,  and quickly delete my mistakes, and try again until I get it right.I can't help but think this will be a great tool for learning more about photography, and sharpening my skills.  And at this price, it can't be beat!  It's easily the most affordable dSLR on the market -- a terrific value for anyone, and an excellent piece of equipment for both beginners and advanced snapshooters eager to broaden their horizons.", "Date": "February 24, 2006"}, {"Title": "Pentax *istDL the best?", "Author": "K. S. Crawford \"SnoopyDog2\"", "ReviewID": "R26G25ZNT4QN01", "Overall": "5.0", "Content": "After reading the \"Wired\" magazine buyer's guide for digital cameras, wherein they rated the Pentax *ist-DL with 5 (out of 5) bars, the Canon Digital Rebel XT with 4.5 bars, the Nikon D50 with 4.0 bars and the Olympus e-volt E-300 with 3.5 bars, and awarded the Pentax the \"Editor's Pick\" award as the best of the bunch, I decided to give one a try. What an amazing little imaging machine. It is small, fast, and, although I have tried to fool the meter with strong backlights and partial frame lighting, I have been unsuccesful. For all those who have been fooled into thinking that Canon makes the best digital SLRs (they certainly spend the most on advertising), you should do your own research. Mine lead me to this Pentax.", "Date": "April 25, 2006"}, {"Title": "the K1000 of digital SLRs", "Author": "Richard", "ReviewID": "R1LH3YSSMZRS08", "Overall": "5.0", "Content": "I decided that I needed to get on-board the digital wave beyond my Kycocera EVF digital camera, meaning I needed an SLR.  I chose Pentax as several newer film cameras, lenses and flash units I own are all Pentax.  The flash units, and lenses for Pentax autofocus, autoexposure (KAF mount) 35mm cameras are interchangeable on the *ist DL, a huge plus!  I love knowing I can use AA batteries, CRV3 batteries or an AC adapter (on order).The DL is a joy to hold, the weight is less than my ZX-Ls and the ergonomics are even better.  A couple of competitors' cameras that I have handled afterwards actually felt clunky to me. The LCD viewfinder is great (please let it be known, to save battery life it will time out much sooner than many folks are accustomed to with digi pocket cameras).  The multifunction dial for auto shooting, or manual settings is pretty muchthe same as other models I have, cutting down the time I needed to read the manual.  The \"slim\" filter feature is a unique feature to Pentax units I believe.The kit lens is sharp and clear, and the equivalent to a 28-80mm lens in 35mm format, which suits most of my needs.  The DA lens does not have an aperture ring, so those of us so accustomed to having one must learn to use the electronic settings (or use an earlier lens, on aperture priority).  A few drawbacks I have read about the DL is that for sports/action use the autofocus may not be fast enough for some guys, and the AF360FGZ flash (I have one)does not swivel.  I can get around those items; to me a big plus is that's been reported that Pentax digitals have less noise than many competitors at higher ASA/ISO settings, enabling you to use it in low light situations with less noise (I still want to call it \"grain\") in your images.  As soon as the weather improves, I am going to really see what this baby can do beyond the test pics I have taken indoors.A great camera to learn digital SLR photography with, just as the old K1000 was for 35mm.", "Date": "March 25, 2006"}, {"Title": "Pentax *ist DL camera", "Author": "M. Mihaly", "ReviewID": "R2LJKLLTCB7N4V", "Overall": "5.0", "Content": "I had researched this camera for about two weeks, and decided to buy one. It is my first SLR digital camera. I am very pleased with the size of the camera, the lcd screen, and menu (Very easy to use). It takes amazing pictures when printed on my Sony DPP-FP30 photo printer, I would recommend this camera to anyone thats on a budget and wants good quality.", "Date": "May 6, 2006"}, {"Title": "Super value for a entry level DSLR", "Author": "X. Ding \"David from Utah\"", "ReviewID": "RZXVKCYW9QQTN", "Overall": "5.0", "Content": "I have thought about getting into Digital SLR for quite a while.  I used to be a point and shoot user and get hooked on Nikon for their outstanding design and vivid pictures. Starting from Nikon 3100, 4600, eventually a 8700, I have tried to shoot in various circumstances and tried to convenience myself that a PS camera is good enough.  However, I never felt satisfied.Before actually purchase the *1st, I have also kept an eye on Nikon D70s, Canon Rebel XT, and even D50. Tried all the models in Circuitcity and BestBuy but didn't feel they were the types I was looking for.  I felt strongly against Canon since their covers and rubs felt cheap and the silver color always remind me of the point and shoot cameras.I eventually decided to purchase the *1st when Pentax offered a $[...] rebate on the camera body.  The operatons of the camera is extremely identical to a film SLR camera, and the camera takes in  most AF and K mount lens, which actually save a leg while upgrading the system.  I purchased a old lens (28-200mm) from ebay for less than $[...]and it worked with the *1st without any problems.Another good thing is the AA batteries used on the camera.  You can purchase 4 AA rechargable Energizer batteries on Amazon for less than $[...]. The camera fits my hand very well and the original 18-55mm lens came with the camera also meet general photograph needs.I have no complains with the camera so far.", "Date": "July 16, 2006"}, {"Title": "Very good camera", "Author": "Omar Armas \"Omar\"", "ReviewID": "R80ASNETIFZYG", "Overall": "5.0", "Content": "Im new to SLR cameras, but have had digital cameras for about 5 years. I bought this one to enter in the in the SLR world and all I can say is it has exceeded my expectations.Before this one I owned a Canon Powershot G3 and a SD30, this one feels much better than those.Maybe for a pro it lacks some features, but for newcomers like me its perfect.I have a lot to study, but my first impression after a few weeks is that I made the right choice.Omar", "Date": "December 30, 2005"}, {"Title": "Best Purchase", "Author": "T. Whiteley", "ReviewID": "R1MI2ZFRWPEIX3", "Overall": "5.0", "Content": "I would have to say for the money, this is the best camera I have purchased.  The only downside is the fact that it doesn't have rechargable batteries.  I had to purchase the AA rechargable batteries.  Other than that is is awesom.  I beleive is takes some of the best pictures I have seen in a long while.", "Date": "April 23, 2006"}, {"Title": "Excellent First DSLR", "Author": "L. Phillips \"lyman123\"", "ReviewID": "R2WVZP85RF86NA", "Overall": "4.0", "Content": "I purchased this camera to take shots of my kdis playing sports - I was tired of blurred images.The camera is good in auomatic mode. There is some focus hunting in low light (to be expected), but it is very responsive in good light.The photos are uniformly well exposed and have good sharpness and color. This is such a huge improvement over point-and-shoots, that I am finding myself reading more and practicing different settings to really push my photography to the next level.I find this camera easy to use in exposure and aperture priority, there is a dial under your thumb to adjust the variable setting.I also appreciate the fact that it takes AA rechargables and uses SD cards - like the other camera we have and the electronics we already have.I also like the small size and relatively light weight for a DSLR.Only thing I miss would be anti-shake, but that would add weight and complexity and cost.This is a fine camera - recommended.", "Date": "August 15, 2006"}, {"Title": "Amateur Photographer with many years of SLR experience", "Author": "Kishore Boyalakuntla", "ReviewID": "R3MBRJ6LCAH5S1", "Overall": "5.0", "Content": "I see several users say it is an entry level DSLR. For an amateur photographer, this is a very good camera and it is not entry level. I used Nikon DSLR before but the pentax pictures are as good and much better in low light conditions. The white balance settings for different temperature ranges work really well. I like to manually pop up the flash and turned off the automated feature. Other than that, the camera was ready to go right out of the box.", "Date": "August 17, 2006"}, {"Title": "Excellent SLR Starter", "Author": "Leo Koach", "ReviewID": "R2F382H5CCDWHH", "Overall": "5.0", "Content": "I just started my real photography about a year ago... with a $50 machine I purchased from a grocery store. I sold that one in a couple of months and bought Panasonic LZ2 for better learning, since I realized I can take good pictures. For a few months usage of Panasonic and take good pictures, I looked for an SLR machine. Actually I was kind of between DSLR and SLR like Digital cameras... took about two months for me to do the search and finally with many suggestions I got Pentax *istDL. I use it about month now, and I must say even I am learning how to use this machine, even full manual option is giving me stunning results. Auto settings for quick shots, but I like to learn full manual so I can improve my photography more... This is the camera you want for the price and quality...A Perfect 10PS: I am going to upload a few pictures. I saw the other pictures there, but somehow my photos could make better statement :) Check the images out, read other reviews, and make your decision. You won't be sorry :)", "Date": "June 24, 2006"}, {"Title": "very pleased", "Author": "(unesessary) \"Scrub\"", "ReviewID": "R38QQV5RJIALDS", "Overall": "5.0", "Content": "A photography course in school opened my mind to it. I then persued a DSLR, did tons of research, shopping around, and came down to this. If you take advantage of the manual controls, photos that surpass point-and-shoot. The AF is amazing, 100% accurate (so far). It has a nice range of controls to get creative with, which are conveniant and \"right there\". Noise at ISO 1600-3200 is acceptable. Fast and responcive. Value. RAW conversion software very simple and right down to the point (and advanced adjustments too).Cons:If you are switching to DSLR from digital point-and-shoot, it may take a bit of time to get comfortable with having to use the viewfinder all of the time. Not numorus, but only a few times the AF did not lock and release the shutter. I am not  optimistic with the auto white balance. Info in the viewfinder (shutter speed, apature, and so on) not so easaly seen when it is really bright outside (not a big deal to think any less positive of the camera).Final opinion:Amazing camera when you do not swich it to AUTO. Two thumbs up, highly recomended as a starter DSLR =).", "Date": "April 10, 2006"}, {"Title": "Packs a Punch !", "Author": "N. Gangahar", "ReviewID": "R2K7AJ6BY5CA6V", "Overall": "5.0", "Content": "Am a newcomer to the world of SLR photgraphy, and after researching a SLR for a few weeks, I had almost decided to buy a canon/nikon. Honestly, did not even consider pentax in my research, and just to see how the rebel and d50 looked and felt,  I visited a 'camera store' and asked the sales person for these models. I also asked her for her recommendations, and she sneaked in this lovely little camera. The pentax surprized me as a package.It was a delight to hold, felt perfect in my small hands and then after a couple of weeks of more research,  where nobody complained about the picture quality or the quality of the product, I knew this was it.I will not go into the specifications as they can be found on a zillion websites and for sure this camera 'lacks' certain features but which one doesnt unless you have $$$$ or more.In the past two months, this camera has been to numerous  hiking trips and I have always got great pictures back. It has 'survived' a few raindrops as well occasionally when the clouds caught me unprepared with my backpack,  but I would not recommend taking any chance with that.As a beginner, an SLR does have some initial learning curve involved and be prepared to ruin some shots if you forget to change the white balance, or other settings. I have just started using raw, and realized the advantages.Almost everything is good about the camera. But it does seem to underexpose a little on the auto modes.Also there are not many lenses made specifically for this camera by pentax unlike canon/nikon. I am not considering third party or older pentax lenses here. This might be a drawback. But I feel that unless you want to go professional, the choices are adequate.To sum this review, I feel this camera is a great entry level SLR which is easy to use, nicely built , delivers quality results an on a budget. I also got a couple of adobe photoshop manuals, which I feel is a wonderful tool along with my camera. Thank you !", "Date": "August 2, 2006"}, {"Title": "Value, convience, and easy of use! Pentax at it's best again", "Author": "Rik Woods", "ReviewID": "R20ZF0K438X54", "Overall": "5.0", "Content": "For the price this is a great entry level DSLR. I purchased it six months ago and have found it wonderful and easy to use. The pictures are crisp and sharp and the functions easy to learn. I use this camera body weekly and love that the lenses for my other Pentax SLR's work with the *ist DL", "Date": "June 11, 2006"}, {"Title": "Best entry-level DSLR by far", "Author": "Dorothy Gray", "ReviewID": "R2A7GCM8QPM246", "Overall": "5.0", "Content": "This fantastic DSLR is not mentioned when the big electronics and photography sites reccommend cameras for those wishing to upgrade to digital single-lens reflex. Why is that? The Pentax *ist DL delivers everything that the Nikon D50/D70 and other cameras in its class do, and for hundreds of dollars less. The camera's functions are intelligently laid out so that you can begin shooting great photos right away, and the manual is well-written and organized, making it easy to learn when you're ready to explore everything the camera can do. The kit lens is better than what ships with some competitors, and the camera is compatible with most older Pentax lenses, making it possible to save hundreds by buying used lenses rather than having to sink money into new digital lenses. Another great feature is that the camera runs on AA batteries, unlike some cameras which use proprietary batteries.The camera has the capability to shoot RAW files and Pentax includes a disc with basic RAW processing software. Photoshop CS2 is probably a better choice for those who will be shooting many RAW photos.One thing I feel compelled to mention is that shooting in any of the auto modes yields photos that are highly color saturated, and this setting cannot be changed. This isn't a gripe as the photos are easily corrected in after-processing in Photoshop.To sum: there's really nothing NOT to reccommend about this lovely little machine. Kudos to Pentax to bringing the world of DSLR photography within reach, and let's hope the word gets out about this amazing deal.", "Date": "July 5, 2006"}, {"Title": "Great Camera Price for the Class", "Author": "A. Ryan \"Dallasdux\"", "ReviewID": "R3DHDJ4IV62BFB", "Overall": "4.0", "Content": "This was a great buy.  Pentax does not have the market presence (not advertising enough) that Canon & Nikon have and even Sony, who purchased Konica Minolta's camera division, will probably advertise more than Pentax. BUT, this *ist-DL is a great camera and for the price, in regards to entry level dSLR's, it can't be beat. Plus Pentax has been running a [...] rebate to make it a relative steal compared to the competition.Professional Reviews state it well. Basically, Pentax is not the leader in any specific camera technology, but instead, it does almost all of those same things 'very well' and for a lower cost.  Doing the initial research, I was worried about availability of lenses.  Those worries were quickly put to rest as I found plenty of new lenses avaialbe in the market from leading manufactures and the great thing about Pentax (K/KA bayonet mount) models is that the *ist-DL accepts all those old lenses.  So, I've got a collection of new and old lenses and all types of ranges.  You can find some great deals on auction sites for older lenses, and the new ones are in the same price range with the Canons & Nikons.Okay, so the camera....I've been very happy with it and it is my first dSLR.  I chose it based on 1) Price  2) Already had Pentax lenses  3) Professional Reviews.  It does everything I could want and I'm learning my new hobby quickly.Functions are easy to use, large LCD, good image clarity are all plusses.  Use 4 AA Duracell rechargeables (2650's) and I've taken over 400 shots without having to recharge yet (about time to do so now).  Only minus(es) are: Shutter is a little loud, Auto Focus in Dark settings is a little slow, and local chain camera stores don't carry much for Pentax (online yields plenty plus best prices).", "Date": "October 5, 2006"}, {"Title": "Really Great Digital SLR at a Nice Price", "Author": "J. Blilie", "ReviewID": "R1C3VHS76OJEOV", "Overall": "5.0", "Content": "I am a 35mm and Medium Format (6cm) film photographer converted to digital by this camera.  I love this camera.  I am used to Pentax LX, MX, ME, and K-1000 35mm cameras and (a huge collection of) M-series and A-series lenses, along with Rolleiflex medium format.  Some tripod work, but mostly hand-held.  I hike a lot (photos:  landscapes of all sorts, natural details, sky drama) and also take candids of family and friends outdoors and indoors (the 50-200 zoom is great for candids.)I had basically stopped doing any photos except business work and snapshots with a 2MP digital ELF (Canon Powershot 110).  The ELF was fine for basic snapshots but has very little flexibility.Since my wife gave me this camera a year ago, I've re-discovered the fun of making photos.  I felt restricted by film costs (and environmental impact) and the limits of the ELF.  Now, I have amazing creativity and flexibility at my fingertips.  I am enjoying this camera more than any other, even the LX and Rollei.  It does everything I ask of it, easily and well.  The auto focus is really great and so are the auto-exposure modes (I was previously an ALL-MANUAL guy.)Laundry list of things I like:Manual or auto-focusManual or multiple auto exposure modesDepth of field previewDelay timer for tripod work without cable release (or remote control)Uses all Pentax K-mount lenses including my old M-series and A-series lenses that I loveWonderfully ergonomic -- all the buttons where you want them, great grip (for right-handers)Fast continuous shooting modeEasy to use and logical menus and functions (I've only rarely needed to consult the manual)Display screen is wonderfully large, bright, and clear; and you can zoom (to 12X) and pan the images -- so you can really make a good judgment about deleting an imageViewfinder is bright and clear, seems to be about 95% of final imageI love the 18-55 zoom and 50-200 zoom lenses (I still want the 14mm)Download is fast and simpleEverything is small and lightweightI put Li-I batteries into the camera last August and they still read as fully-charged (this is after ballpark 2000 photos, 20+ downloads, and hundreds of flashes -- amazing!)I get all the flexibility I want AND my techno-phobic wife can easily use it (!!!)The only feature I've even considered that it doesn't have is mirror lock-up.", "Date": "June 4, 2007"}, {"Title": "great camera", "Author": "William Whicker \"picture man\"", "ReviewID": "R1EH4EYIKCPI7N", "Overall": "5.0", "Content": "The picture quality is excellent once I got the parameters down to where I wanted them. Very easy to use and to learn. Most cameras start at 10MP or higher, but this one is 6MP. The picture quality indicates that pixel count tends to be overrated. At 6MP you can get professional quality photos at 8 X 10 or even larger without any significant loss of quality. Pentax makes great cameras, and I would recommend their products to anyone.", "Date": "November 10, 2009"}, {"Title": "Easy to use AND Takes great pictures - Who could ask for more?", "Author": "Cindy \"Innsbrooker\"", "ReviewID": "R5BOVSTZXRWWP", "Overall": "5.0", "Content": "This camera will give you clear crisp pictures with bright colours as well as capture sequential action shots.  I have been using this camera for personal use and have won several local photo contests with my pictures.  Would suggest that you invest in another telephoto lens (75mm - 300mm) which can be picked up for about $140 (on Amazon).With the wide angle and the telephoto lens, you will have a camera that is a good as it gets.", "Date": "June 13, 2007"}, {"Title": "Pentax *ist DL review", "Author": "D. P. Luebke \"K. O.\"", "ReviewID": "R3DFSO467WZCZU", "Overall": "5.0", "Content": "I have used this camera since February, 2006 but it seems to be out of production already.  After 40 years of film use this was my first digital camera.  I waited for the right one.  I compared this to Cannon Rebel Digital XT and Nikon D50.  I liked the size, feel, and controls of this model.  On a recent extended trip I took 500 images without any problem or issue.  I did have to refer to the camera and flash manuals once and awhile.  You have to do that because these things are not simple point and shoots.  However, you can set this on automatic or Program mode and let the camera work for you.  It even works with my old screw mount lenses and I got a full frame picture of the moon with a 300mm and two 2x extenders.  The beauty was that I could adjust my exposures until  I got it right and see my results immediately.", "Date": "September 18, 2006"}, {"Title": "best choice for amateur phtographer", "Author": "Gpysy Soul", "ReviewID": "RU80TZVDEHG2B", "Overall": "5.0", "Content": "I bought this camera for my friend as the lens on her old canon DC is blurry and it may cost more than $200 to fix. So she decided to buy a new one and I said why not get a DSLR? After extensive research we picked pentax, at that moment there was a $100 mail-in-rebate.Then we spent our vacation in Italy. The trip itself was wonderful. Pentax made it perfect coz we record every single moment with it.Guess what, whoever saw the portraits or landscapes pictures( we shot ~1000) thinks they are taken by a professional photographer.I don't wanna sound humble but hey I am indeed just an amature, only had one SLR and one DC, shot less than 1500 pictures(maximum). I myself was even surprised by the quality of every single picture, just with the 18-55 kit lens. I did read a lot books about digital photography before this trip. If you prepare enough, you don't really need any post-production touch-up on your computer at all.Recommend this to anyone who is interested in buying the first DSLR. You will fall in love with it as soon as you hear the shutter click.", "Date": "November 2, 2006"}, {"Title": "Solid entry level DSLR", "Author": "J. S. White", "ReviewID": "R384XRRJKC1ZHN", "Overall": "4.0", "Content": "The Pentax line has consistently offered the best 'bang-for-the-buck'. This machine feels much better built than comparative offerings from the other DSLR big guys, and has a feature set that's pretty well rounded. If you have any old Pentax SLR equipment around, this is a real bargain; Pentax is the only current DSLR manufacturer whose offerings can use any Pentax lens ever made. I've got an old Pentax 135mm f2.5 that I couldn't stand to give up; it clicks right on my *ist DL and takes beautiful pictures. The kit 18-55 is not bad at all. Just generally this camera is hard to beat for the money. If you have a few extra bucks, though, upgrade to the newer Pentax machines like the K200D (10 MPixel and shake reduction, along with a host of new features).", "Date": "June 16, 2008"}, {"Title": "Brilliant color and easy to use menu", "Author": "Seth Wells \"SethWells.com\"", "ReviewID": "R37LQVQ9ELU0M7", "Overall": "5.0", "Content": "I am an amateur photographer in Seattle. As everyone knows the lighting in Seattle is usually pretty gray. This was a major part of what influenced my decision to buy this camera. In the store, the sales guy let me take pictures with the Nikon D50 and the Pentax ist DL. He then print out my pics and showed me them side by side. We did this with several pictures and this camera won hands down. The Nikon is great, but the ease of use and menu options make the ist the best choice. [...]Buy this camera. It is well worth it. Also the fact that you can get a 2GB SD card for under $50 really makes a difference.", "Date": "September 29, 2006"}, {"Title": "Pentax istDL 6.1 Digital SLR Camera", "Author": "D. Lee", "ReviewID": "RSZOSL03OQCLY", "Overall": "5.0", "Content": "This camera is excellent, easy to use, and takes beautiful photos.  This is my fourth Pentax camera, and they have all been totally satisfactory.", "Date": "November 2, 2006"}, {"Title": "Excellent entry level camera", "Author": "Amazon Customer \"svrider\"", "ReviewID": "R8CTKV930Y8TP", "Overall": "5.0", "Content": "Although many new Pentax cameras have been introduced that offer more features at a lower price, this is still a relevant digital camera because it's easy to use and takes great pictures. At 6 megapixels you can print nice pics at 5x7 and that's what most people want. The user interface is a breeze. With ISO up to 3200 you can shoot in low light, although there will be more grain. For posting to the Web you can even use 3200. I have been using the camera since early 2006 for work (photo journalism), so it gets a workout. It has performed flawlessly, day in and day out. I have old Pentax lenses and they work fine with aperture wide open only. The camera is light and takes 4AA batteries. I added an external flash and by changing the ISO I can shoot in the darkest settings, even with a 150 mm telephoto, great for meetings in dark rooms. Many digital cameras provide a bewildering number of options. This camera has the basics, but that all most of us need and you won't get lost in menu hell.", "Date": "October 24, 2009"}, {"Title": "Amazing", "Author": "H. La", "ReviewID": "R18TCFXVAYOX6C", "Overall": "5.0", "Content": "I was looking for a Cheap beginner SLR, and this one is GREAT. Its not that much more then a point and shoot (actually, its the same price as my point and shoot) and it takes GREAT images. Im going to spain next friday, and Cant wait to use it. I will buy again instantly.", "Date": "March 7, 2009"}, {"Title": "Great SLR", "Author": "Paul Neuhaus", "ReviewID": "R3LZZZFETKWCSJ", "Overall": "5.0", "Content": "This is a great camera.  It is a great buy:  simple to use, takes great pictures, the speed is a little on the slow side (I have not had a digital camera that wasn't), and it has some heft to it.Again a great all around camera for someone who wants to  take great pictures of the family, vacations, and life in general.", "Date": "April 14, 2008"}, {"Title": "This good value", "Author": "kenindallas", "ReviewID": "R3B1PH0FUYKNIV", "Overall": "4.0", "Content": "This is an excellent camera, no doubt about it.Don't fall for the \"sales pitch\" in the store with the megapixel hype. Unless you are printing posters, 6.1 MP is more than good enough for most people. I haven't met anyone able to distinguish between 6mp and 12mp when printed on a 8x10.There are bell & whistles, but frankly as long as you can adjust ISO, Shutter Speed, Aperture, and activate the Denoiser - what other options does a photographer really need ?I like the fact it uses AA regular batteries. High-capacity AA rechargables last as long as the other type, and they are easily and cheaply replaced.People who think you HAVE to get a $2000 15MP camera usually have very little experience shooting. Ansel Adams shot very sharp gorgeous photos 80 years ago with what was (equal to) much less than a 6MP camera...so don't look down on the 6.1 MP, BELIEVE ME, it is certainly enough.Better lenses, will improve the picture quality long before higher megapixels will.So in conclusion, this camera is excellent, and I'd gladly pay 3 to 4hundred for this before I pay 7 hundred of more just to get a few more megapixels that probably won't even be noticed.", "Date": "August 20, 2010"}, {"Title": "Wow! What a Great camera!", "Author": "Amazon Customer \"TexBrandon\"", "ReviewID": "R1YVD30R90DWJ6", "Overall": "5.0", "Content": "This camera is a bargain for anyone wanting an entry level digital SLR. You get 6.1mp with a lens. The camera body is lightweight and it is easy to use. I was able to take it out of the box put in batteries and a memory card and take great pictures right from the start. I bought some bigger lenses and they work great. I highly recommend this camera.", "Date": "November 4, 2006"}, {"Title": "Awesome camera for the price", "Author": "Marjorie L. Moniz \"Marjorie\"", "ReviewID": "RVKG8EZ8DESIR", "Overall": "5.0", "Content": "I've been wanting a DSLR camera for a while now. I have small hands and most of the cameras were large and heavy. Saw this in Walmart and got to hold it and loved the size. This is a great camera for the price. Takes wonderful photos with an easy to use menu and large screen. Highly recommended", "Date": "November 3, 2006"}, {"Title": "Pentax *istDL 6.1MP Digital SLR Camera", "Author": "G. Dawkins \"reddawk\"", "ReviewID": "R2MB6O8Q8KART9", "Overall": "4.0", "Content": "No problems so far... I have had thsi item for about a year and I would not trade it for the world.", "Date": "January 13, 2007"}, {"Title": "Good Camera", "Author": "T. Flores", "ReviewID": "R2BHOMUY5ECR9L", "Overall": "5.0", "Content": "I purchased this camera to replace one that quit working.  I needed one in a hurry for a class.  This was reasonably priced and the quality for a used camera good.  I would purchase from this vendor again.", "Date": "October 13, 2011"}, {"Title": "Pentax rules", "Author": "luvcamera", "ReviewID": "R1PHJ7P5DLI7VQ", "Overall": "5.0", "Content": "I bought this cam originally from Amazon when it first came out and am still using it today....Thank you Pentax and Thank you Amazon for all the fun I am having with itM", "Date": "April 1, 2011"}, {"Title": "Pentax *istDL 6.1MP Digital SLR Camera", "Author": "hoserjewl", "ReviewID": "RE3JSNYIM4F59", "Overall": "5.0", "Content": "Great camera very impressive with lots of extra features.  Very easy to use and adjust to different settings for the picture you want.", "Date": "January 9, 2007"}, {"Title": "BE FORWARNED", "Author": "MAYHEM", "ReviewID": "R2XI4BGSXHLBOB", "Overall": "2.0", "Content": "I bought this camera for $630 december '05. I had always liked pentax and still enjoy many pics from my ME Super. For my first digital slr, of course I had to consider the pentax. I decided to buy it because of the interchangeable lenses.The pictures were nice and I was getting used to it.Then I attached a 60-300 lens that I used on my old ME Super. It would not come off. I figured these things sometime happen.I called pentax and the customer service person told me since the lens worked on my ME Super, to remove it would be covered under my warranty.I downloaded the forms and sent the camera off to Colorado.After I sent an inquiry, a person from pentax called me at home to explain that I should be able to understand that they couldn't warranty removing a  lens that was not a pentax lens ! It was only a pentax mount.(?)I said I bought the camera because it accepted pentax mounts and I expected the camera to be able to release them. The lens worked on the camera, but just would not release.The pentax person told me the best he could do was to give me a coutesy discount. $22.50 off .Charges were $157. My shipping was $17.50.The warranty was useless, the camera is not worth the money, and I will not buy another pentax product again.(Thanks, amazon, for letting me vent.)", "Date": "July 17, 2006"}, {"Title": "Nice but already replaced", "Author": "Gadget geek", "ReviewID": "R3IFJ3GJKOWC5V", "Overall": "4.0", "Content": "Pentax has already replaced this model with an upgraded version.  I like this camera very much but it seems silly to write a review at this point.", "Date": "June 27, 2006"}, {"Title": "good price,perfect pictures", "Author": "Burak Kara", "ReviewID": "R19JDNY4YKW5AZ", "Overall": "4.0", "Content": "ýf you wanna take good pictures this is perfect for you....but if you wanna be professional photographer and tryind hard,this machine is not gonna be enough for you in very soon...dont forget this is very charismatic machine...", "Date": "March 12, 2006"}], "ProductInfo": {"Price": "$799.95", "Features": "6.1-megapixel sensor captures enough detail to create photo-quality 14-by-19-inch prints\nIncludes wide to moderate wide-angle lens\nStore images on separately sold Secure Digital memory cards\n2.5-inch LCD monitor\nPowered by 4 AA-size batteries (alkaline included, rechargeable NiMH recommended)", "Name": "Pentax *istDL 6.1MP Digital SLR Camera with DA 18-55mm f3.5-5.6 AL Digital SLR Lens", "ImgURL": "http://ecx.images-amazon.com/images/I/514CAT8W3SL._SY300_.jpg", "ProductID": "B0009U7MV6"}}