{"Reviews": [{"Title": "Great Digicam for the Money", "Author": null, "ReviewID": "R2RW8PYDPL264N", "Overall": "5.0", "Content": "This is my first digicam and I spent a great deal of time researching this camera along with others. I was looking for a camera...I finally settled on the Fuji 2800Z. To date, I am extremely please with my purchase, as I have found this camera to be an excellent value for the money.Some of the positives of this camera include, a killer 6x Optical Zoom, Sharp and Crisp Pictures, extremely easy to use menu system, 60 second video with audio, and it can double as a webcam.  This camera is pretty much a point and shoot camera so if you are looking for a digital camera that has a wide selection of manual settings, look elsewhere as this camera is not for you. You do, however, have control over the white balance, exposure, and flash settings. Other than that, the rest is automatic.As I mentioned, this is a great little camera, however it is not without a few \"flaws\". As well noted, this camera has trouble in low light situations, specifically the EVF and LCD. In the few weeks that I have had the camera and the several hundred pictures that I have taken, I have only run into 1 situation where the EVF and LCD were useless. This issue can be worked around and should not be a sticking point for those looking to purchase this camera. I personally like using the EVF as, unlike an optical viewfinder, it shows you \"exactly\" what is being photographed without distortion. Finally, if you decide to pick up this camera, make sure that you get some rechargeable batteries and a 128mb Smart Media card. You will be set.In summary, if you are looking for a simple to use, point and shoot camera, with a great zoom, sharp pictures, and a few additional nice features, get this camera. You will be hard pressed to find a better camera for the money!", "Date": "March 6, 2002"}, {"Title": "I am having fun with this camera", "Author": "Hanyu Xiao", "ReviewID": "RFYBANC0V9SXA", "Overall": "5.0", "Content": "I got my Fujifilm Finepix 2800 three days ago and here's my first take.The camera has a good look, and feels sturdy with the all-metal case. Its width is about that of a credit card, so you can say it's small; however it’s pretty thick (comparable to its width) due to its 6x zoom lens, so it won't fit in your shirt pocket. I have only taken indoor photos, and the image quality is excellent. The photos usually look very nice as is, without having to be fixed by a photo editor. The 6x optical zoom was a big factor in my decision to buy this camera. It doesn't work well for me when taking indoor pictures. I would have to keep the camera absolutely steady under the full zoom or the picture comes out blurry. A friend of mine has an Olympus C-2100, which has a 10x zoom. It comes with image stablization, which is probably absent in Finepix 2800 (at least I didn't find any mentioning of it).The electronic view finder (EVF) gave mixed results. On the one hand, it is great to be able to see everything with EVF, including the menus. This removes the need to switch on the LCD just to change some menu settings, and as a result, you get longer battery life. On the other hand, the EVF was completely useless in a low light setting. The room wasn't that dark, but the EVF was totally blank when I pointed the camera to a dark area, so was the LCD. I had to point the camera to the general direction and let the flash do its job. Luckily the picture came out OK, but still I wished I had an optical view finder at the time. The webcam is very easy to set up. You'd use the menu to set the so-called \"USB mode\" to \"webcam\", and then connect the camera to the PC through the USB cable, just as if you were uploading the pictures. Then you'll launch the PictureHello program and that's it. The captured image is pretty dark, though.It is just as easy to take a video as to take photos. The movie is a little dark, tough, when taken indoors. Fuji says in the manual that the operation of the camera is only guaranteed when it's used with Fuji SmartMedia cards. However I am using a 128MB Mr. Flash SM card I bought (...) and the camera took it without incident. I also bought 1600mAh NiMH batteries and a charger from newegg.com. The price was great, so was the service. I highly recommend them.The battery life seems very good. I have taken over 100 indoor photos, all using the flash, and the 1600mAh batteries are still going strong. As I mentioned earlier, it certainly helped not to have to switch on the LCD very often, but I didn't go out of my way to avoid using it.Software installion on my Windows 2000 laptop went smoothly. It was actually a series of independent installations for USB driver, FinepixViewer, QuickTime, VideoImpression, and Microsoft Media Player, etc. You can also install Adobe's PhotoDeluxe and ActiveShare.All in all, I am having lots of fun with this camera. It has its limitations, such as the lack of TV out and certain manual controls. But I would say at this price level you won't find another comparable camera that has such a rich set of features.", "Date": "November 11, 2001"}, {"Title": "Fuji 2800Zoom - Pleased", "Author": null, "ReviewID": "RTOBJ62T9MFL9", "Overall": "4.0", "Content": "(...) I liked the fact that it looks like a camera and that it is quite small, compact and light weight. I did some research, but honestly not that much. I was interested in optical Zoom, and the 6x optical zoom is what made me buy the Fuji 2800Zoom. Most of the other digital cameras in my price range only had 3x Optical zoom. So far I've taken at least 50 pictures and I am very pleased. The software installed easily and worked the first time on both of my computers, Win98 and Win2000 Professional. The only problem I have is that the on/off button is right where the 'take a picture' button is on other cameras, which means that I have turned the camera off, instead of taking a picture on at least 4 or 5 times.I also like the fact that it has both a small eye viewfinder like a regular camera plus the eye viewfinder is also in color. Plus it has the LCD screen. The eye viewfinder is very useful in bright sunlight where you might not be able to see the LCD screen. You can change the LCD brightness also. Overall I am quite pleased with this camera. The Fuji 2800Zoom has 2 megapixels, which at first I thought might be a drawback since 5 megapixel cameras are now available, but now I see that the photos are very clear and sharp at the \"1M Normal\" setting, so that is not an issue. The camera allows you to change the settings for picture quality. There are 8 settings. Naturally the higher the setting the fewer pictures you can record on the card. The lesser the setting the more you can record. But at the Normal setting, on a 16Meg card you can still get about 50 pictures of very good quality. If you need more you can buy a higher meg card to store more photos. That's it, have fun.", "Date": "November 12, 2001"}, {"Title": "Fine  Aperture!!!", "Author": "\"jgodard1\"", "ReviewID": "R16YMTGA46DC52", "Overall": "4.0", "Content": "OK, in a nutshell- This camera takes great quality photos rich in color. The detail really does rival that of higher MP cameras. Much of this can be attributed to two factors. First, the 6X Optical zoom allows the photographer to bring the shot to them without the distortion that is caused by a Digital zoom. Second,  the lens Aperture, the size of the lens opening, is by far the largest of any digital camera I have seen in this price range. This large aperture gives the camera a greater light gathering ability and contributes to vivid color reproduction. The camera's case is made of plastic, which may seem flimsy to some, and will probably scratch if not handled carfully. If you plan on accompanying the 'crock hunter' on an outback photoshoot any time soon, I recommend finding a camera with a metal casing.The on-screen menus are logical and easy to navigate. The menus can be seen via the LCD (display screen) or the EVF (viewfinder). This camera has many amatuer features and they all work great. The movie feature has decent quality video (for a digicam) and good sound. Because the viewfinder is electronic and it's source is the zoom lens, this camera is effectively a digital SLR, which means that the image you see is exactly the image you get -a great plus.This camera's main drawback is it's display performance in low light situations. Both the LCD and EVF are useless at night, and indoor shots may become difficult under low light conditions. This may make it difficult to take advanced shots, as it may be impossible lock the focus on your subject properly. The flash will ensure that the pictures come out great, though, and its not like your wasting film if your subject isn't centered properly. Just fire away! Still its a major shortfall.Software works fine, but you may want to use something you're more familiar with.Get a set of Nickel Metal Hydride rechargable batteries. The higher the mAh the better as this determines how long the batteries will last per charge. I have found a set of 1800mAh batteries and they work great.", "Date": "June 17, 2002"}, {"Title": "Its very very nice", "Author": "Stephen Rice \"STR\"", "ReviewID": "R3A8NKG235V29U", "Overall": "5.0", "Content": "I bought two digital cameras recently. Both of them Fuji. Mine is the 2600zoom finepix and the 2800zoom is the one I got for my wife. ( She thought it was 'cute'.) Personally, I like the 2600 better for a number of reasons. It comes with a battery recharger and two of the 1700mHa batteries by Fuji. The 2600 only takes two batteries instead of four like the 2800 does, and they last a long time.(The 2800 eats up the batteries, you will want to get extra batteries and a fast charger for it.) Overall both cameras are excellent and I give both 5 stars. The 2600 is just a better value when you weigh all features and benefits. You will have to order an a/c adapter for both cameras from Fuji as they are an option, and I had to buy a charger and rechargable batteries for the 2800 after the purchase. It comes with 4 alkaline batteries when you buy it. They lasted about 25 minutes before they were dead.(No lie) I don't particularly like the grainy look in the view finder of the 2800. I'm not fond of the way the viewer goes blank when you take the picture either. The 2600 doesn't have this grainy appearance at all and it doesn't blank out when you snap the pic. Of course the 2600 doesn't have the ability to show you the display and menu in the view finder like the 2800 does. The 2800 video mode is much better than the 2600 and the sound quality is quite impressive too.(No sound on the 2600) The one thing I found after the purchase is that most of the NiMH batteries you will find are 1600mHa and Fuji's are 1700mHa. This may seem slight but it makes a difference in how long the batteries last between charges and how fast they recover after each shot. I found some that were 1800mHa and Fuji told me not to use them as they may damage the camera. I recommend that you find 1700s because the 400mHa difference is quite noticable. The 5 volt a/c adapter for the 2800 and the 3 volt a/c adapter you can get for the 2600 both have plenty of length to the cord and I like that. Overall for the money the 2800 is a good deal but other than the 6x zoom feature it really doesn't take any better pics than my 2600 does. It was harder to find a case that would hold the 2800 than it was for my 2600 and the 2800 is heavy compared to the 2600. I'm glad the 2800 is my wife's camera really. The only time I'll use the 2800 is if I just have to zoom in twice as far for a shot. ... My wife thinks it was worth it and love the camera. I'd recommend either one but value for value the 2600 is a better deal. Fuji has got it going on with these little cameras. They are impressive. If they came with an a/c adapter and carry case and if the 2800 just had a charger and NiMH batteries it would be better but they'd be a lot more expensive up front I'm sure. The fact is though, these are both quite high in quality and supreme user friendly cameras.", "Date": "March 18, 2002"}, {"Title": "Fuji 2800 is a fantastic buy!", "Author": "R. Borsdorf \"bertdorf3\"", "ReviewID": "R21HBS6BINB57A", "Overall": "5.0", "Content": "I've had this Fuji 2800 camera for about 1 month now and I simply LOVE it. I took it on my recent trip to Key West Florida where I got some FANTASTIC quality shots. Zoom works wonderfully, but be very careful on full zoom... even the slightest movement will result in blurry pictures. The 6X zoom is why I bought the camera, and I quickly learned the difference between the digital zoom and optical zoom. The optical zooms in physically (you feel the lens move) while the digital gets you closer like on the monitor of a computer. Every time I zoomed to the full max, I set the camera on a stable surface and got incredibly nice photos!My suggestion is to buy a 128MB card, or two, and take all your pictures at the highest quality. Your choices for quality are BEST / High, mid, low... or MEDIUM / high, mid... or LOW / regular. That's 6 choices. If you have the space available on your card, why not get the best shot? The camera comes with a 16MB, I bought a 64MB, and on my week in Fla., I ended up lowering the quality to accommodate more photos, and when I viewed my pics at home, I saw a difference that didn't please me. If I had taken them all at mid quality, I may not have noticed, but size does matter! Capture the biggest image!As far as the video clip capabilities, I was pleasantly surprised. Takes up tons of space though. And don't expect fine detail. Add the sound and you end up with a jumpy at best, rough video of your cherished moment. If it's video you're after, take along a video camera. I did run home and e-mail the .avi file to all my friends and they were surprised too, simply at the fact that a digital camera can record video with sound. I have used several other digi-cameras that were slim and credit card sized, and I didn't like them. I am a big guy with big fingers, and I like the bigger camera. I can carry it in my front pocket in relative comfort, but then again, I wear big shorts. The camera is 3\" x 3.5\" x 3.5\". A cube. It has a nice grip to it, and it feels secure in my hand when I am on the boat. It comes with a lanyard for hanging on your neck but I never attached it. The lens cap is on a string, so be careful the string is out of the way when you snap the shot. My last digital camera had no lens cover, and the lens got scratched eventually. As far as not being able to see through the viewfinder at night or indoors, it is true, but you can almost always see something distinguishable, and in no time, one gets used to it. You see the captured image for a second after you snap it, so you can see if you cut someone's head off. The biggest problem is when you ask someone to take your picture for you, they get caught up on the fact that they can't see you clearly. Better off just using the self-timer, which is easy to use. I use it often.Pictures are easily and quickly erased if you want to erase them. So easy though, you can erase ones you didn't want to! There is no `undo' button... once they're gone, they're gone.One more feature I fell in love with is the suppressed flash. It allows you to take pictures of cityscapes, sunsets, etc., where there is a subject in front. I took a picture of my wife in front of one of those fabulous Key West sunsets, and it turned out incredibly. I took another of her in front of downtown San Francisco at night, and it too came out awesome. I have read people suggesting the AC adapter, but I see no reason to buy one. A full 128MB card can be downloaded into your computer within 2 minutes, maybe less. The camera, when turned on, automatically opens the image software, but several times in that process, my system has malfunctioned (Win98). I remedied it by simply opening the FinePix viewer first, then turning on the camera. Pictures pop right up, then I select them all, and drag them to another folder. Since pictures on a Smartmedia card are numbered from 0001 to the last, the folder should be empty, otherwise the computer tries to replace like-named pictures. As soon as they're moved, turn the camera off! It's that simple. DO buy some rechargeable batteries. Digital cameras can eat up disposable ones fast.This Fuji 2800 camera is the best buy for your buck, hands down.", "Date": "November 13, 2002"}, {"Title": "Best Camera for the Money", "Author": null, "ReviewID": "ROT12WJSSDWDQ", "Overall": "5.0", "Content": "This is my 2nd Digital Camera. My first was a polaroid. Awful! And I paid more for it then I did this one. I couldn't even print pics because they were not clear and could only be printed in snapshot size. The Fuji finepix 2800 is great.IT has awesome image quality. It has one of the best zooms in its price range, you can take movies 60secs long with sound. This is one of the few cameras even close to this price that you can take movies that long and it has sound. The lcd and viewfinder are both color . You can take pics that can be printed into 8x10's. You can add voice captioning to pics.Its easy to set up and use.  As for the Eve /LCd screen , I haven't had any problem with lighting in my house and I didn't turn on the lights during the day or open blinds and I had no problem using the lcd screen. Now the movies still turn out good but I do reccommend some lighting when shooting those. Another great feature is it is also a webcam. The last digital camera I bought cost more then this one plus I had to pay for a webcam separate. Its like getting a webcam for free. The sound quality is great for the movie footage and voice captioning. I love this camera! I shopped around for a couple of months online and instore and kept coming back to this camera!  I also really liked the added software . The adobe photo deluxe is a great ,easy to use, picture software , plus the 2800 also includes Video Impression for your home movies. You can add animated screens, sound effects, edit and organize your movies, and mail or store them all with Video Impression. This is the best camera package you can get for the money.  Oh and I bought rechargeble batteries , [price] for a set of 4 AA. I also got a charger for [price]. Rechargeable batteries are a great asset to any digital camera owner .  The only other thing I would have liked to have seen for this camera is a camera case/bag. I do think that should have been included but other then that I couldn't ask for anymore!", "Date": "May 1, 2002"}, {"Title": "Fine Aperture - but for what?", "Author": "\"jgodard1\"", "ReviewID": "R3HY4HV6HOFL6O", "Overall": "3.0", "Content": "OK, in a nutshell- This camera takes great quality photos rich in color. The detail really does rival that of higher MP cameras. Much of this can be attributed to two factors. First, the 6X Optical zoom allows the photographer to bring the shot to them without the distortion that is caused by a Digital zoom. Second, the lens Aperture, the size of the lens opening, is by far the largest of any digital camera I have seen in this price range. This large aperture gives the camera a greater light gathering ability and contributes to vivid color reproduction. The camera's case is made of plastic, which may seem flimsy to some, and will probably scratch if not handled carfully. If you plan on accompanying the 'crock hunter' on an outback photoshoot any time soon, I recommend finding a camera with a metal casing.The on-screen menus are logical and easy to navigate. The menus can be seen via the LCD (display screen) or the EVF (viewfinder). This camera has many amatuer features and they all work great. The movie feature has decent quality video (for a digicam) and good sound. Because the viewfinder is electronic and it's source is the zoom lens, this camera is effectively a digital SLR, which means that the image you see is exactly the image you get -a great plus.Considering this cameras large aperture lens, it is surprising that this camera's main drawback is it's display performance in low light situations. Both the LCD and EVF are useless at night, and indoor shots may become difficult under low light conditions. This may make it difficult to take advanced shots, as it may be impossible lock the focus on your subject properly. The flash will ensure that the pictures come out great, though, and its not like your wasting film if your subject isn't centered properly. Just fire away! Still its a major shortfall.Software works fine, but you may want to use something you're more familiar with.Get a set of Nickel Metal Hydride rechargable batteries. The higher the mAh the better as this determines how long the batteries will last per charge. I have found a set of 1800mAh batteries and they work great.", "Date": "February 10, 2003"}, {"Title": "Fuji FinPix 2800", "Author": "\"jwickham7\"", "ReviewID": "R3M5OEH7UUV7BB", "Overall": "4.0", "Content": "Everything said about the dark electronic viewfinder is true.  In low light you cannot see your subject the way you would be able to if you just had a \"see through\" or glass viewfinder.  But in daylight the electronic viewfinder actually will help you center and frame your topic more accurately.The viewfinder and short battery life are the negatives.  But on the positive side this camera takes excellent pictures, quality and colors are beautiful.  I've taken most all my pictures at the \"medium\" default resolution setting and am totally satisfied with the quality.The macro feature is very nice as well.  If you enable the macro feature and crank the resolution up to maximum you can take some incredibly clear, focused, and detailed close-up images.Zoom lens works well and appears to be a positive for this camera because most models don't seem to have a zoom as high as this camera's 6x optical zoom.  Several trips to local camera stores indicated that this camera was a \"bang-for-buck\" model with superior optics and color reproduction for the $399 price tag.", "Date": "January 29, 2002"}, {"Title": "Great camera", "Author": null, "ReviewID": "R1TRCE6YL8HQPN", "Overall": "4.0", "Content": "This is a great camera for the price.  I was looking for a camera with movie mode (I don't own a digital camcorder), and really wanted sound with it.  I didn't need a ton of manual options.  I wasn't planning on printing 8x10's or larger, so 3 megapixels and up wasn't necessary.  I was turned off by Sony's proprietary media.  When it came down to it, it was between the Canon S200 and the Fugi 2800.  The only pluses for the Canon was the sturdier body (metal) and the small size.  But the 2X optical zoom was worthless.I like the 4AA's over other batteries, because in a pinch, I can find them anywhere.  I bought some rechargeable NiMH and am all set.  The 6X optical zoom is great.  After having it, I wouldn't consider another camera without it.The only thing I can bash on the camera is the size and the plastic body.  It is a little bigger than some cameras, but a small price to pay for the zoom.  After a few weeks, I got over the plastic body, but I still worry about dropping it.Get a USB card reader with this (~$30), and you don't need to use the camera to download pic's.", "Date": "July 11, 2002"}, {"Title": "Great camera!", "Author": "Michael R. Then", "ReviewID": "R2DPNARPS2FOGL", "Overall": "5.0", "Content": "I finally decided that the time was right to buy a digital camera.  I knew I wanted a... range camera, and I researched all of the 2.0 megapixel... cameras.  The Fuji camera came out on top for several reasons - 1. It actually looks like a camera.  This may sound silly, but some of the other cameras in this price/feature category were so small that I was afraid that I would either lose it or break it.  The FinePix 2800 feels very solid and sturdy.2. Fuji's reputation.  My wife has a 35 mm Fuji camera that she's had for years and it has never given her a problem.3. Features.  This camera, compared to all other similar cameras, came with the most features.  It comes with the USB cable, all required software, 16 MB flash memory (double all the other cameras), and 6x optical zoom.4. Compatibility.  It DOES work with XP - I hooked it up to my XP PC, and XP said, \"I've found a new digital camera.  It's a Fuji FinePix 2800.  I will now configure it for you.\"  That's all I needed to do.  I have more editing options that I know what to do with.  And that's just from hooking the camera up to my PC!  I didn't install a single piece of software.  My Windows 98SE PC needed the software installed, and installation was quick and easy.- Setup was simple and straightforward.  The instructions are clearly written and easy to follow.  It takes wonderfully crisp and clear pictures.  And with MS Photo Editor (what I use on my 98SE PC), I have all of the basic photo editing features I need.- I don't mind the fact that it eats batteries - it's to be expected with this class of electronic device.  I did order the A/C adapter from Fuji, and I think it's been previously said... be prepared to wait on hold for a long, long time.  The 1st time I called, I waited for 20 minutes and got disconnected.  I called back and waited 15 minutes.  Once I got through, they were very nice and courteous.Final thoughts are that it's a great digital camera, even for someone who has never owned one (this is my 1st).  Compact, easy to set up, and takes crisp, clear pictures.  I feel it's the best bang-for-your-buck out there.  Definitely give this one a long hard look when making your decision!", "Date": "March 1, 2002"}, {"Title": "Perfect mid-range camera (light and fits in palm)", "Author": "Alvin Tanhehco \"kerki\"", "ReviewID": "R2UL7BX5TU5XLY", "Overall": "5.0", "Content": "The FinePix 2800 Zoom is Fujifilm's latest mid-range digital camera. Incorporating a powerful 6x optical zoom lens, the same zooming power as that used on the FinePix 6900 Zoom, the flagship of the FinePix line. The FinePix 2800 Zoom is a highly compact, point-and-shoot model that can make even beginning photographers feel like a pro. The 2-Megapixel CCD imager in concert with Fuji's Advanced Color Technology produces photo-quality 4x6, 5x7 and 8x10-inch prints. The camera's exposure and focusing systems are fully automatic. For those that like to have more control, the Manual mode allows overriding the metering system and using a specific white balance setting. Audio notes up to 30 seconds in length can be attached to your pictures, you can record up to 60 seconds of motion video with sound, and the FinePix 2800 Zoom can operate as a PC-cam for computer-to-computer video conferencing. Images, movies and sound files transfer to your computer in a flash thanks to the built-in USB connectivity. Picture viewing is simple and fun with the included FinePixViewer software that launches automatically once the pictures are downloaded to the computer. Features:Easy to use automatic point-n-shoot cameraUltra-compact and stylish bodyPowerful 6X optical zoom (38-228mm 35mm equivalent)2.1-million pixel RGB color filter CCD imagerImage sizes of 1600 x 1200, 1280 x 960 or 640 x 480Fujifilm's Advanced Color Technology produces better color with more detailRecords 60 seconds (320 x 240) AVI motion video with audio at 10 frames/sec30-second audio notes can be attached to picturesInternet PC-Camera (Webcam) capable64-Zone TTL metering, Program AE (Exposure comp. available in Manual mode)Automatic white balance plus 6 presets in ManualMulti-mode flash (Auto, Red-Eye Reduction, Slow-Synchro, Forced, Off)1.8 inch color TFT LCD MonitorColor electronic viewfinderISO 100 equivalent sensitivityPowered by standard AA batteries, NiMH recommended Even with the big 6x optical zoom lens, the FinePix 2800 Zoom is only 3.7 inches (W) x 3.0 inches (H) x 2.8 inches (D) and weighs a scant 9.5 ounces, without batteries. Bundled accessories include a 16MB SmartMedia storage card, four AA Alkaline batteries, shoulder strap and USB and video cables. In addition to Fujifilm's FinePixViewer, other bundled software includes Fujifilm's DP Editor and Adobe PhotoDeluxe 4.0.-- Steve's Digital Camera Review", "Date": "February 6, 2002"}, {"Title": "The Fuji 2800, a great little camera", "Author": "Robert Jump", "ReviewID": "R365KIOPTGKC68", "Overall": "4.0", "Content": "This camera was my second digital camera The reason I bought the Fuji 2800 was its small size and it's rather extraordinary 6X optical zoom.  I have taken both cameras with me on trips and have found that they perfectly compliment each other.  The Fuji is available for those quick shots and can be used as a point and shoot  The Fuji 2800 is a great camera that is simple to operate and has the ability to take a picture that will print out sharply at 8 x 10.  It has a very good autofocus and the 6X zoom will let you get in close.  The flash has 6 different modes and there is also a white balance feature.  You can choose from a variety of resolutions but I normally keep it on the highest 2 megapixel setting (with a 64 mb card I can shoot about 80 pictures).  On the down side, the view finder is poor in low light conditions; the autofocus still works ok, you just can't compose your shot with the view finder.  Action shots are also a bit tricky due to the electronic viewfinders quirk of freezing the view during autofocusing.  Other than that, this is an extemely competent camera that takes great pictures, is simple to use, and offers great features at an affordible price.", "Date": "October 4, 2002"}, {"Title": "Power little giant! Highly Recommend to a beginner", "Author": "Robert K. Chambers \"azurebuck\"", "ReviewID": "R6189AA9LI3F2", "Overall": "5.0", "Content": "This camera takes great photographs...stunning clarity and vivid colors...it's very easy to operate.  In low light conditions, the LCD/ECD do not operate very well, however...it'll still take pictures...the great thing about digital photography, you can take pictures over and over again...delete the bad ones until you get it right!  It has plenty of features; the manual is easy to read and is actually a tiny course in photography basics.  I was taking pictures 2 minutes out of the box; the next day at a wedding...I took over 100 photos...they were simply stunning!  The couple who got married wished they hadn't hired a professional!  You will get red eye...but there's plenty of software out there to fix that in low light conditions...however, the camera's strength is definitely outdoor photography...I have captured awesome close-ups of wildlife and nature scenes...the digital zoom is wonderful.  Would definitely buy this again!  Make sure to shop around, buy a 64mb or 128mb SmartMedia card, and 2 sets of rechargeable NiHM batteries.  I got a great deal @ Circuit city......", "Date": "June 12, 2002"}, {"Title": "I LOVE THIS CAMERA!!!", "Author": "Manalive \"Allen\"", "ReviewID": "RKF19BT57VF6Z", "Overall": "5.0", "Content": "Where can I start? This camera is an EXCELLENT product! I was apprehensive because 1) I'd had such trouble with complicated hard-to-use techno gear and software, and 2) this was going to be my first digital camera and I wanted to have FUN, not be driven nuts by trying to slog through complications. I had really enjoyed photography years ago on a good 35mm camera. I did a lot of comparisons, and this Fiji just seemed to come out on top for what I wanted to spend. Yet I just HAD to go to a store to try it out first-hand. Boy, was I impressed!! I picked up a display and the controls are so sensibily designed that I was using it-no problem-in just a minute or two. I even took a mini-video on it. (A great feature I haden't even counted on.) Another feature that sold me on this camera was the 6x optical zoom--a must-have feature for creative photography. The sales guy recommended I get a transfer device, and I'm glad I did. You put the memory card in it and download the pics into your computer.  (I got one called \"Dazzle\" and it's a snap.) I also bought a 128MB Smart Card for more memory. If, like me, this is your first digital (or you're upgrading) I COULDN'T RECOMMEND THIS CAMERA MORE HIGHLY! I hope this review was helpful to you. Now I'm going back to having more fun with my new camera!", "Date": "June 10, 2002"}, {"Title": "High quality, easy to use, reasonbly priced digital camera", "Author": "Pangloss \"soldierblue\"", "ReviewID": "R2FOC0CHMU9V48", "Overall": "5.0", "Content": "This is my second digital camera, my first being an early model Kodak DC210 Plus model. The Kodak is a fine camera, but I was attracted to the 6X optical zoom and increased resolution of the FinePix 2800. I also did not want to pay an exoribitant price. After reading a number of reviews, I decided to give this camera a try. I have used it for a little more than two weeks and have been overjoyed with its performance. It is small, light, has plenty of features and the zoom performance is excellent. I could not find anything similar in this price range.  For a beginner or amateur photographer, I don't think you could ask for a better camera. It is simple to set up, has a wide variety of picture quality settings, plenty of options/features and is just pleasure to use. I also liked the built in USB interface (USB cable and software included). I would have liked to have seen an AC power supply included, but for the price I can't complain about the included accessories. I purchased a 128M SmartMedia card with the unit and can get over 350 pictures in the 2M Normal mode, which gives great resolution. This unit also seems to be a lot faster than the Kodak I own. The 2800 also supports video and voice over, although I have not tried either of these features. For video, I use my Canon ZR25M. With no reservations, I rate the FinePix 2800 as an exceptional camera and very reasonbly priced. I highly recommend it.", "Date": "July 31, 2002"}, {"Title": "Excellent Camera.....Good For the mONEY!!!", "Author": "S. Ginting", "ReviewID": "R127WPMEYWEYAC", "Overall": "4.0", "Content": "Hi, this camera is my second one.  My first was Powershot A20.  This camera takes good picture.  The color is a bit better using this camera then the A20.  This camera capture true brilliant color from an object.  Overall performance is a good camera.  The movie function is great too.  The zoom is amazing.  6x optical and 2.5x digital.  The design is very compact.  Every eye stop and ask question about what kind of camera it is....cause it's so sexy.  You can hold it real well.  The lens cover is like a lens cover for camcorder, in seperate entity.  It doesn't cover itself when you turn off the camera.  You have to put it manually.  It uses 4 AA batteries.  You may want to have NiMH rechargeable sets for this camera.  I have 4 sets my self.  The 16MB SmartMedia comes from the kit seems to capture enough pictures in it's low resolution.  Personally, I like using the lowest my self.  I don't like to print them, that's my I bought this camera.  Eventhough the camera has a normal quality for the VGA-mode (lowest resolution), it still delivers Excellent pictures.  You don't have to go high in resolution if you don't have too.  I do still have someting that I don't like about this camera:1.  The LCD is too dark.  My A2 does a better job on this one.  Eventhough only 1.5\", A20 seems to g\\have more pixels on the LCD part of the camera.2.  This camera is lack of manual settings. With Powershot A20, you can go using a few effects like black and white, and more white balance setting choices.  Although this camera doesn't come with those features, it still comes with white balance functions.  It's just limited.That's about it.  95% of the time, I love this camera because of it's results, sexy look, and small size.  You gotta love this camera.  It's nice, not that expensive, and it takes excellent pitures.", "Date": "December 24, 2001"}, {"Title": "Exceeded my Expectations", "Author": "Richard Hagins", "ReviewID": "RG79F536GKYSV", "Overall": "5.0", "Content": "I spent way too much time deciding which digital camera to purchase.  But if I'm going to spend $500+ on a product that I want to keep for a long time, I'd better make the right decision the first time.  I looked at the Fuji Finepix 2800 Zoom and a few of the popular 3mp cameras.  I was very leary to get the 2mp over the 3mp but figured with the 6x zoom and the way lower price that it may have an advantage.  Let me tell you, I made the right decision.  Here's why:Photo Quality:  Incredible.  Better than I could have hoped for.  More than enough.  You can't crop down to nothing, but I printed a few 8X10's and it looked like an actual photograph.  2mp is enough for me.  PLUS, you usually don't even set the camera on the 2mp setting anyway, 1mp is usually plenty.Controls:  The automatic controls are very accurate.  I have used a 35mm Nikon SLR for years and it's nice not to have to fuss with all the manual settings.  This is primarily my wife's camera anyway and she appreciates just being able to point and shoot.  You do have to get used to the 1/2 second delay, but it's not a big deal and common with digital cameras.Viewfinder/LCD - Yeah its dark in low light, but you can still see an outline of your subject in most cases; unless its really dark, but I haven't had much of a problem and the one time I did get my 1 year old out of center I just took another shot.Overall - I'm very happy with this camera.  I can't say enough.  If you're leary about this camera like I was, don't be, it will exceed your expectations.  Oh by the way the web cam feature works great too.  Oh and make sure to get rechargeable batteries, and ac adapter for web cam and download and you'll be set.PS - I estimated that I saved about $200 by going with this camera over some of the other 3mp and in my opinion it can't be beat.", "Date": "July 14, 2002"}, {"Title": "Excellent Digital Camera", "Author": "\"romanks\"", "ReviewID": "R2TL6M4353TPN4", "Overall": "5.0", "Content": "This Camera is GREAT! -- Very nice quality pictures, 6x optical zoom, very nice design -- I Love It.I bought a MiMh reacharable battery by Telepower,... plus a charger ...- it lasts me for almost 200 shots. It is a little bit bulky, so i had to look for the right carrying case, which i found one by Targus... An extra 128mb memory card and i can take high quality pictures at low camera cost. Great value - Recommend to have one.", "Date": "March 4, 2002"}, {"Title": "Great camera", "Author": null, "ReviewID": "R32BVDX5ESF98G", "Overall": "5.0", "Content": "I just got it last week and have taken more than a hundred pictures. Beautiful color recovery and nice focus. Some problems at low light condition for view finder but fine for a digital camera since you can take as much as you want and delete them if you do not like them. Flash gives good compensation in dark, so the quality of picture is not affected. You need to press the shutter half way down to focus but it is a nice feature for me since if the lense is covered in the photography mode, the camera does not try to focus on nothing which bothers me a lot when I was using a olympus with aoto focus. One of my friend who just got a SONY S85 highly appraised it since the color and image are much better from fuji 2800 with ... less on the price tag. Highly recommend for people who want to get a nice point and shoot digital camera.", "Date": "September 23, 2002"}, {"Title": "Well worth it!", "Author": "Brent L. Savage", "ReviewID": "R1RMUN8BS9LOIZ", "Overall": "4.0", "Content": "Best photo quality and features for the cost I've seen yet!Small, lightweight, easy to use and long battery life. I saved almost $100.00 over \" Discount Store \" prices at Amazon!Only two drawbacks that I've noticed are; 1. The image in the electronic viewfinder freezes for a second while focusing.2. Having to navigate through menus to do most things like macro shots. But these are minor and easy to get used to.Put this camera together with a 128 Mb Smart Media card and Ni-MH rechargeable batteries and you've got one heck of a unit. I'm loving every shot!!", "Date": "January 2, 2003"}, {"Title": "Great camera for anyone!!", "Author": "Pradeep", "ReviewID": "R1LIA5Z0ALH0CZ", "Overall": "5.0", "Content": "This is our first digital camera and we love it. The 6X zoom has allowed us to take some outstanding vivid pictures of birds at the feeder and closeup of flowers and people.  The colors are vibrant and true. We are happy with our decision to add 128 mb card and NiMH rechargable batteries ($20 for 8 batteries and charger at SAMS). The only disappointment was that the camera bag recommended by Tamarac does not fit the camera and we had to return it.", "Date": "June 27, 2002"}, {"Title": "It's a great camera...but only in theory", "Author": "Nina", "ReviewID": "R10JRNPOOG3BC6", "Overall": "2.0", "Content": "I bought the Finepix 2800 this evening and I am returning it tomorrow morning.  This camera seems great -- affordable, awesome optical zoom, and compact -- but there are more than a few problems with it.First of all, if you're in a room with soft lighting, the LCD is pitch black.  I tried adjusting the LCD brightness, but it didn't help.  You need to be in a VERY well-lit area to even be able to see what you're taking a picture of, otherwise (I kid you not) it's pitch black.  You end up getting pieces of people's heads instead of a full scene shot.The software installation went just fine, except when I connected the camera to my Pentium 4 running Windows 2000Pro, my computer crashed.  It didn't just crash, though -- it locked down so I couldn't end programs to properly shut down my computer.In case battery life is a concern, it's important to note that the FinePix 2800 runs on 4 AA batteries.  Fuji sells rechargable mAh batteries, but they're VERY expensive ($60 for a 4-pack), and I don't even know how much the charger costs.I was also disappointed with the bundle that comes with the camera.  You get a neck strap -- woo hoo! -- but no case.  I had a lot of trouble finding a case that fit the camera, since the zoom lens bulges out.  I frowned when I saw the camera only came with one-time-use AA batteries, and I frowned more when I saw there wasn't an automatic lens cap.  Argh!This camera just didn't cut it for me.", "Date": "January 2, 2002"}, {"Title": "awesome camera......awesome zoom", "Author": null, "ReviewID": "R7FYNZ35MCQCU", "Overall": "5.0", "Content": "i just bought the fuji finepix 2800, is the best camera you can find for 400$, the zoom is great, the closest competitor is the olympus C-700 the price of the olympus is higher, as well as the zoom is bigger, but the rest of the camera is pretty much the same : 2.1 mp, video&sound, size etc.... so if you are thinking in buying a digital camera, I highly recommend this one.", "Date": "April 16, 2002"}, {"Title": "Decent Digital Camera for the Price", "Author": null, "ReviewID": "R2Q0NQWYYQSZWQ", "Overall": "4.0", "Content": "I purchased this camera in haste with a vacation pending and little time to shop around. I wanted something compatible with the Smart Media cards I already had from an earlier Fuji camera. The 2 MP file size is ideal, giving an perfect balance of image quality and quantity. Pluses:Shape of the camera -- fits in the hands like a conventional 35mm SLR camera (although smaller). This is helpful for those who are used to using 35mm cameras and don't adapt well to some of the funky new digital camera shapes that are available today. Also can be held with one hand if desired.6X Lens -- Great range, allowing for perfectly framed pictures of most subjects.Simplicity -- not much here to complicate matters.EVF -- it is nice to know you will be taking an image of exactly what you frame up in the view finder, however...Minuses:Low light performance of EVF -- There is no way around it, the Electronic View Finder does not function well in low light (like during an evening wedding reception). Leave the camera on a wide angle, point and shoot, and review the image. Repeat as necessary.Lens cover leash is too short -- When the camera is turned on the lens extends out a bit. The lens cover leash can get caught around the corner of the camera body, inhibiting the lens from extending during startup.Auto focus \"freeze frame\" -- When depressing the \"shutter\" slightly the camera auto focuses on the subject inside of two yellow brackets in the EVF. The camera freezes the image for a split second, temporarily blinding you from your subject. If your subject has moved you will have to re-focus. This has an up side to it though -- the freeze frame gives you a split second to review the part of the image the camera is focused on. As long as you don't let up on the \"shutter\" button the camera will remained focused on that part of the subject. This allows you to focus on subjects that aren't in the middle of the frame, by pointing the camera and locking the auto focus directly at the part of the image you want as the primary subject, and then reframing the image so you subject isn't always in the dead center. This makes for good picture composition.Overall, this is a great value in the ever changing world of digital cameras.", "Date": "September 5, 2002"}, {"Title": "great buy for the money", "Author": null, "ReviewID": "R2JWOKHK1WY918", "Overall": "5.0", "Content": "I had been shopping the Nikon 775 when a ritz camera salesman pointed this out.  For the money and a 6x zoom lense I decided to give it a try, and I have been impressed.  I used to do some serious photography with medium format camera's, but sold them all years ago to pursue other interest.  I waited on the digital craze until the camera's became a little better and cheaper, but at my wife's insistance bought a digital camera so that we could have something to record family events.  I wanted one that would not be difficult for my wife and kids to use, as well as something that would take good photos.  This is the camera.  I have had no mechanical problems with it, and it works like a dream.  It is difficult to take photos inside if the light is low, however I've found it easier to just turn on an extra light.  I am a little bummed that the lens is not threaded to take filters, so you have to be carefule not to scratch the lens.  Given the current choices, I would buy this camera again.  If you  have any concerns about mechanical failure, buy it from a dealer that backs up their product.  This is the first time I have bought from Ritz, and was competely satisfied with their service.  Fuji if your listening, fix your low light problems, thread your lenses, and I'll probably buy your next version as well!", "Date": "January 27, 2002"}, {"Title": "Prefer this camera to my Canon Powershot A40  (I own both)", "Author": null, "ReviewID": "R2JH2QMWLMXOE1", "Overall": "5.0", "Content": "I'll keep this review short and sweet.  As a bit of background, I have been shooting and developing my own 35mm film for the past 29 years (strictly as a hobbyist), shooting mostly with older, manual-focus Olympus and Canon SLR's. I purchased both this camera and the Canon Powershot A40 from Amazon in the summer of 2002.  I definitely prefer the Fuji.  Why? 1) Superior optics (in my humble opinion).  I shot dozens of pics  of the same subject matter, at the same distance, with the same  focal length and lighting within seconds of each other in order  to compare the results side-by-side.  The Fuji pics were in all  cases noticably sharper and more accurately exposed.  Colors  with the Fuji were also more accurate, and with better  saturation.  Shadow details are better w/the Fuji also.2) Macro capabilites.  The Fuji's focusing distance in macro mode  is closer than that of the Canon A40 and again, the Fuji  produced sharper, more accurately exposed pics.3) Focal length.  The Fuji wins hands down with a 6x optical zoom  versus the Canon's 3x optical zoom.4) Ease of use.  Again, the Fuji has the edge.  Simpler operation  (especially for novices and casual users)than the Canon, though  admittedly lacking some of the Canon's more advanced features/  options.Don't get me wrong, the Canon Powershot A40 is a decent camera and offers manual operation, which the Fuji does not (albiet in a somewhat limited manner with only a couple of shutter speeds available when shooting manually).  I would also say that the Canon's low-light, night shot capabilities are superior to those of the Fuji as long as you're using a tripod.  Canon's photo stitch technology is also a nice touch for super-wide panorama shots.  Those pluses aside, I feel the Fuji FinePix 2800 is the overall superior camera for the reasons I have stated above and should be on your short list if you're looking for a simple to use, point-and-shoot digital camera capable of taking razor-sharp pics at a reasonable price.  Add to that the only 6x optical zoom in it's class, and you just can't do better than the Fuji. Now what was that I was saying about keeping this short and sweet?  ;)", "Date": "December 26, 2002"}, {"Title": "Only 1 problem that I see so far", "Author": "\"soccer_fan\"", "ReviewID": "R7FKQT5JY44OE", "Overall": "4.0", "Content": "I have never written a review and am a true digital novice so I will stick to the basics. I bought this camera because I liked the way it felt in my hand. Also my son has an older fuji digital that has taken some great pictures with less resolution so I thought this would be a great starter camera. I used it for the first time at a wedding and it did take great pictures outdoors and indoors but and this is the big one, in low light and darker (the all important decorating of the car) you can NOT see anything on the screen or in the viewfinder. I found myself pointing and shooting blindly. Amazingly the pictures turned out ok, not well lit but ok, but it is my major complaint. Other than that, I have found it easy to use and I found myself taking alot more pictures and I think that is the whole idea.", "Date": "August 10, 2002"}, {"Title": "Great Camera/ Poor View Finder", "Author": "an advanced amateur photographer", "ReviewID": "RTSQ7MOL6H988", "Overall": "3.0", "Content": "Yes, it is a great little camera if you limit your shooting to the outdoors or well lite indoor locations. If you're thinking of taking this to a wedding or some other indoor affair, forget it, unless you want to estimate the location of your subject or keep your other eye open to try and compose a decent shot and then go back to the view finder, all the time hoping the party hasn't ended in the meantime.I would have given it 5 stars except for this terrible and practically non-functional view finder in low light.", "Date": "August 3, 2002"}, {"Title": "Exceptional Camera", "Author": "E. Karsten Smelser \"Tech Ramblings\"", "ReviewID": "R22LTW55DTKWTG", "Overall": "5.0", "Content": "No long review here.  This is an exceptional camera.  Pictures are near perfect, feature set is better than most in its class, battery life is best I've had in any digital camera, weight is perfect, zoom is great, etc etc etcOnly 1 bad point:  The viewfinder has a hard time in the dark - still takes pics though...", "Date": "May 26, 2002"}, {"Title": "Strong Competitor.", "Author": "Rheumor", "ReviewID": "R37OJ59Q5F3M8U", "Overall": "5.0", "Content": "This is my first Fuji experience and it comes in the fast growing, high quality, 'ultrazoom' category. For most users, these cameras will be perfect, as they offer excellent resolution (a measurement of digital photo density that determines how much the photo can be enlarged before it becomes too grainy), good optics (quality of the lenses) and very powerful zoom lenses that allow for, well,.....zooming. All of them need larger memory cards & separate card readers to allow for easy download of the pictures into the computer (easily purchased and reasonably priced), but strictly speaking, they are ready to go out of the box. This Fuji is especially attractive with its gleaming, sturdy all steel body. It has all glass optics and a wonderful 6x optical zoom. It is also smaller than you might suppose and feels balanced in the hand. Controls are excellent and allow for lots of user input, or none at all if you prefer to put it on 'autopilot'. The main competitors would be the Minolta Dimage 5 and the Olympus 700. Take your pick, as they are all awesome when compared with anything available even a year ago!!", "Date": "December 6, 2001"}, {"Title": "too DARK!", "Author": null, "ReviewID": "R20XO9XAW5Q6XR", "Overall": "1.0", "Content": "This camera is easy to operate and simple to the point which is a PLUS in my book. However, the LCD and the view finder is too dark. For example, I would take a picture indoor at night and after adjusting the manual option on EV, white balance, and brightness on LCD and view finder, I still could not find the object on the LCD or view finder I wanted to take.  It was pitch black even after I had the whole place lit up.  After taking the picture guessing where everyone or everything is, the picture result is too bright.  Most of them turned out to be a white blurr.  This is not a camera I will recommend to anyone.  Sorry.", "Date": "December 25, 2002"}, {"Title": "Good camera in this price level", "Author": "J. Luo", "ReviewID": "R2CCMZSF2PJBM7", "Overall": "5.0", "Content": "1. I bought this camera 2 weeks ago. I love it. Considering its price, the optical 6x zoom is very attractive while digital zoom will decrease your resolution. Fuji's color is so vivid, I think no one will be disappointed by its quality, --- I took many photes of flowers(with macro mode), birds(with opt.zoom), and my kid's lovely face,... they are almost 1st-level quality.2.This price is only for 2M. Maybe, 3-5M camera is sure better considering the resolution while they often require more dollars. I think pay 250--350$ for top-level 2M digital camera is a good idea because our printer today is in such a level. One who need higher resolution may buy this one now and buy another 3-5M camera in next year, ---- I think totally you pay the same money for 2 cameras compared with buying one 3-5M camera today.Further more, a 3M camera with 3x optical will down to 2M or even less resolution if it has to use digital zoom while 2800 can keep its 2M level with 6x Opt.zoom.  That's why 2800 is [more] than 2600. That's why 2800 stands the top-level 2M digital camera.3.Many complained that the dark viewer. I do not think it is a problem. In fact all the cameras with such kind of viewer have this problem ( not only Fuji). I took some photos at night and they are all OK.4.I have a complain: Fuji should include charger/re-chargable cells/AC-adapter in the package even they raise the price a little bit. it is a joke that they put AA-cells into the package because no one will really use one-time-cell as a power source in such a camera.  So, to do  something convenient for customers, ---- my words to Fuji. I bought it after many days' comparation serfing online. I mark 2800 highest with price and function balance.Generally, this is a good camera for us to buy in this year.I do like it. If I had to choose once more, I would like to focus on it once more.", "Date": "July 11, 2002"}, {"Title": "Fuji Finepix 2800", "Author": "J. R. Johnston \"Keen watercolourist.\"", "ReviewID": "R24DPZASS12BTB", "Overall": "5.0", "Content": "What a beautiful little digital camera. Does everything I could wish for. The EVF is not as bad as some would have you think and I soon got used to it. I found it excellent in almost any conditions that one would be wanting a digital camera for. In any  lower light photography, I would be more inclined to use a standard SLR on a tripod as a larger diaphram opening would be necessary. Digital cameras and Film cameras each have their place in photography and neither does exactly what the other is capable of, so don't expect your digital to do everything.The 5 times zoom is the best I have seen and even the farthest away object in the photo is displayed in all it's detail.The voice captioning is another neat feature that allows you save your images with their own talking display. Fantastic.I have no complaints about this camera and can recommend it to anyone who is contemplating buying a digital camera. It is my second digital camera so I knew what I was looking for when I bought it.", "Date": "December 30, 2001"}, {"Title": "\"Best Bang for the Buck\"", "Author": "Gary Y.", "ReviewID": "R1ILC0XGJV4TL7", "Overall": "4.0", "Content": "This small clumsy looking camera is not what I just described.Unless you have extremely large hands and fingers this is the DC for you. It not only comes with a 2.5X digital zoom, but a 6X optical zoom. The camera is very user friendly. The indoor digital photography is somewhat problematic. Images thru the viewfinder and LCD screen are dark unless in very well lit area. So you have to guess that your subjects are ready for their pic to be taken. Then again it's a digital camera, \"if ya don't like the picture after reviewing it, just erase the frame/s and reshoot another shot.I would recommend this camera to anyone in the DC market, that don't have 800 to 1000 dollars to spend on a higher mega pixel camera. This one fits my budget and needed camera features.", "Date": "December 18, 2001"}, {"Title": "super buy!!", "Author": "Deborah MacGillivray \"Author,\"", "ReviewID": "R6263UGRZ6BX5", "Overall": "5.0", "Content": "This is a super camera, so easy to use.  From out of the box to snapping pictures was a matter of minutes.  Install the software FIRST as instructed, then quickly plug in the USB cord, it will open the images, load them to a website, email them or your can send them to your harddrive.  It opens a fold in My Pictures for you.  You just check which pictures you want to keep and which you want to get rid of.  You have the option of keeping the images on the smart card or you can erase them.So from box to shooting a few minutes, about 5 to install and reboot.  Second to plug in to the computer and instant pictures of SUPER quality.  I could not believe how sharp the images were.You are able to chose to look threw the lens to set it up as with regular SLR.  Or you can compose by looking at the LCD image. Once the image is snapped it shows you a copy on the LCD viewer so you can see the shot. It has 6 times zoom and auto flash.  Even has microphone setting and you can take small movies with and play them in quick time.Do recommend adding the 125MB smart card and you can snap till your hearts content!This is just amazing for this price!", "Date": "March 29, 2003"}, {"Title": "Great camera with one flaw", "Author": "adevally", "ReviewID": "R3P0YDROZ799B", "Overall": "4.0", "Content": "Love the camera. Easy to use. Takes great quality photos. However it is Awful in low light conditions and if I had to do everything again that would make me look elsewhere.", "Date": "December 19, 2002"}, {"Title": "Issues: lens cap, on/off buttons, no image sequencing", "Author": "\"swimsportlisa\"", "ReviewID": "R2WILH0G0HL2Q1", "Overall": "4.0", "Content": "I love the design of this camera. It fits perfectly in your hands! The interace on it is easy to understand, too - even without reading the manual, and I love the zoom lens capabilities. You can close in on your subject's relatively quickly... I took it out shooting wildlife photos and the images were extremely clear and  professional despite the animal's movements and the overcast sky. I do have three issues with this model, however.1) the placement of the on/off button and the shutter are easily confused. I've often gone to snap the shutter and have turned the camera off altogether!2) the dangling lens cap is annoying. It dangles on a string and you always feel like you're going to lose it somehow since it's not built-in.3) there appears to be no image sequencer on this, so your smartmedia files all have the same id numbers and you can't put two cards on the same file on your computer because you'd be saving over your files.solution? Create new folders each time you download a card of images. When you go to catalog the images, though, the fact that you have multiple images with the same file names (i.e. card 0001.jpg and .0001.jpg is a big pain!) If I've missed something here, and there is a way to do image sequencing on this camera, please email me! I'd love to know how.Thanks!", "Date": "November 23, 2002"}, {"Title": "Fine Pix sometimes", "Author": null, "ReviewID": "R3UBL799ROH0OB", "Overall": "3.0", "Content": "I am still learning all the aspects of my Fugi...and in most ways I have been very pleased. Picture clarity and the zoom is very good. I have noticed some trouble with reds and oranges coming out too dark. I am very dissapointed that what you want to capture while zooming is rarely what comes out, due to the delay in pressing the button and it taking the picture. Maybe with practice that will improve, I hope so.  Well, after spending more time with my camera, I am now able to give it higher ratings.  If you follow their directions about taking zoom photos, you can capture what you are trying to without missing much in the process.  Pictures are clear and sharp.  I still think reds and oranges are a bit off, but overall the camera is excellent.", "Date": "November 9, 2002"}, {"Title": "1st time buyer", "Author": null, "ReviewID": "R344D12U6M008W", "Overall": "5.0", "Content": "This is my 1st digital camera.  I probably read too many reviews by disgruntled camera buffs.  I've had it for a few days and love this thing.  It takes great pictures and is very easy to use.  Even on 1MP setting, I was able to take  sharp and colorful photos for printing at home.  The EVF is not a big deal, just have at least one light on if shooting indoors at night.  Get a card reader for your computer, rechargeable batteries, and your set!  I am very happy with my purchase, and excellent price from Amazon.", "Date": "August 27, 2002"}, {"Title": "Great Camera", "Author": "\"dpd34\"", "ReviewID": "R36STP91J5BNOF", "Overall": "4.0", "Content": "I love the camera, except for one thing, the LCD and the view finder screens does not light up very well (people show up as dark images, and I had the room light up with 7x100 Watt lights), when you take pictures indoors. Outdoors it works fine. It like shooting in the dark when you inside, the pictures on the hand turn out great....", "Date": "December 12, 2001"}, {"Title": "Nice camera for just about anything.", "Author": null, "ReviewID": "RYQUHZCEUS43H", "Overall": "5.0", "Content": "I did a lot of research before making this purchase and read a lot of reviews. The most important feature in my book was the 6X optical zoom. The auto focus is right on and the pre-focus option, (holding the shutter button down halfway) is a nice touch. One of my friends was so impressed with mine that he ordered one yesterday, (and Amazon still has the best price). I must say that although the camera is everything I hoped it would be there are a couple minor details that can be a little bothersome. I find that it is difficult to take action shots while using the zoom. Much like a Single Lens Reflex camera, when the shutter is released the viewfinder goes black (something I hadn't considered) so it is nearly impossible to track a moving target. With some practice however I found that with good lighting the photos are crisp and clear. As long as the camera is kept still, it performs well in low light conditions and the flash is more than adequate. I don't care for the software but that is just my opinion.I suggest that you buy  a 128 MB card and some high capacity Nickel Metal Hydride batteries and charger. I used this camera every last week and I haven't changed them yet. I can't wait to take it on a hike this spring.By far my biggest problem with the 2800 is that I don't get enough time with it since everyone else wants to use it ;)Anyone who wants an easy to use camera that takes excellent photographs should consider this one first.", "Date": "April 2, 2003"}, {"Title": "An Inside Disappointment", "Author": null, "ReviewID": "RK6YPLQ3OZKFK", "Overall": "3.0", "Content": "I was so excited when I first got this camera in the mail. I was impressed with how simple it was to use and the amenities it offered. And then I tried to use it inside. Under normal lighting conditions. That's when my excitement turned to disappointment. The electronic viewfinder and the LCD came out very dark, almost to the point that you couldn't see what it was you were taking a picture of. No matter how much light I added, it wasn't enough. Oddly, it did not suffer under flourescent light (I found out when I went to the store to see if it was just my camera or what). Since I bought a digital camera to use primarily for snapshot purposes, I needed it to be suitable in snapshot conditions. To its credit, the pictures turned out fine with the flash and even with a little longer exposure, but not being able to see clearly what I was shooting in the beginning was very frustrating. The electronic viewfinder doesn't leave you with any way to get around the darkness, as a glass viewfinder would. The problem with the dark scenes was too much for me. I returned this camera and opted for one with a glass viewfinder to be safe! Aside from this problem, I would have loved this camera, but it was too big a problem to ignore or work around for me.", "Date": "January 14, 2003"}, {"Title": "Great - got what I expected", "Author": "E. Reavie \"lakotazz\"", "ReviewID": "R2WC5WHEWRBHDQ", "Overall": "5.0", "Content": "I didn't want anything fancy, so I didn't feel like shelling out the $999.99 required for most of the \"good\" digital cameras out there. I think I lucked out with this unit. I've had it for about three months now and love it. Wonderful colour, convenient and as versatile as I need it to be. Sure, as other reviews have stated, the LCD is a little dim (or black) in low-light conditions, but I can deal with it. If I'm desperate to take a picture in the dark I'll use my tripod, shine a light on the scene to get proper focusing, and off I go. By the way, I've been able to get fantastic dusk/night shots with a tripod.I can't complain about the picture quality - sure, it's not as good as other cameras, but I doubt I'll ever look back and regret having used this camera to document my year.", "Date": "November 29, 2002"}, {"Title": "Good condition & sharp pictures Fp2800z (Koray Mutlu)", "Author": "Koray", "ReviewID": "R2ZENOFZ9LL3FB", "Overall": "4.0", "Content": "+ easy shooting on automatic mode.+ clear and sharp photo+ video recording with sound.+ with speaker (watch and listen video file)- manual mode is less.- bad focusing in night shoot.", "Date": "November 29, 2002"}, {"Title": "Good digital camera with a great zoom lens", "Author": "Megan A Blanchard", "ReviewID": "R2F3VBRZR9TJFO", "Overall": "4.0", "Content": "My husband and I looked at reviews and digital cameras for almost a year before I finally just bought this camera.  I have had it for almost 2 months now, and I haven't picked up our regular camera since.  The menu is easy to surf and the quality of the pics is very good.  I like to take pictures of the birds visiting our backdeck, and the zoom lens lets me get right up to them.  The only drawback that I see for this camera is the pause before the actual shot is taken.  That took a bit of getting used to.  I have 5 year old daughters who have learned to hold their smile for a brief second more before relaxing.  I have taken lots of pictures of butterflies, birds, zoo animals and children with this camera, and I have been very happy with the results.  It is especially nice to have a camera where you can view the picture right after taking it, and see if you need another shot.  I would definitely recommend getting a larger memory card.  I got a good deal on a 64 mb card on Amazon[.com] when I purchased our camera, and it has plenty of room for us.  I would also recommend buying rechargeable batteries and charger.  We got a 1 hour charger that is great.  Have fun picture taking!", "Date": "November 21, 2002"}, {"Title": "Fuji Finepix 2800 - Incredible! I am impressed and sold!", "Author": "Doris I. Curran", "ReviewID": "R3VXL3BAM49TTI", "Overall": "5.0", "Content": "After having been used to manual professional cameras (35 mm and medium format) and being very picky about results, I was extremely reluctant towards digital photography. However, this little camera has not disappointed me. It does everything extremely well that it is said to do, and I was stunned by the beautiful results when viewing them on my computer.Now I wonder why I had not done this sooner. I can highly recommend this little powerhouse to anybody who is doubtful about switching to digital. I have, and there are NO REGRETS! Go for it!", "Date": "October 26, 2002"}, {"Title": "Excellent Point and Shoot Digital", "Author": "Thomas Johnson", "ReviewID": "R1O7S5JP0U3KB4", "Overall": "4.0", "Content": "After 3 months of ownership:Very capable little camera with excellent 6x zoom.Could use even more telephoto.Wish it had manual shutter-priority.2 megapixel is fine for regular snapshots, but you need 3+ MP when cropping/enlarging your photos.Great, simple digital camera for typical user.", "Date": "March 27, 2002"}, {"Title": "Great Buy", "Author": null, "ReviewID": "R2XDJ8DOA0GF05", "Overall": "4.0", "Content": "I've only had my camera a few days but am very pleased with what I got for the price.  I was looking for decent picture quality and optical zoom. At 2.1 megapixels the picture quality has been great and the 6X optical zoom is the equivalent of a 38-228mm film camera zoom, more than flexible enough for most situations.  The menus are simple and intuitive.  Installation of the software went fine on my Windows XP machine at home, though the instructions are a bit fuzzy (probably a bad Japanese translation)  However, when I tried to install it on my laptop at work, I finally found something that would crash Windows 2000 Professional when trying to plug the camera in in PC camera mode.  Haven't got that one figured out yet.If I have one criticism, it is an echo of an earlier reviewer, the EVF and the LCD are more or less useless when shooting in low light conditions.", "Date": "December 18, 2001"}, {"Title": "Great product .......but", "Author": "Charles Davidson", "ReviewID": "R38BGSGCAAVMDV", "Overall": "5.0", "Content": "I have had the camera for 6 weeks and have taken several hundred photos, mainly of the America's Cup qualifying races in Auckland.One reviewer complained that the power button and shutter are easy to confuse. I fully agree, and have lost a couple of action shots through the confusion. My biggest problem is with the physical strength of the camera. I was taking pictures from a boat, and the lens gently nudged a bulkhead. This was a gentle nudge, but enough to dislodge the lens, which fell off completely when I shut the power down. The Fuji distributor in Auckland was fantastic, and repaired the camera promptly, and without charge. It was not the first time they had seen the problem, so be warned! I have a 64meg card, and this is more than enough.", "Date": "October 28, 2002"}, {"Title": "Good until something went wrong", "Author": null, "ReviewID": "R25Y937GRJTPHG", "Overall": "3.0", "Content": "I bought this camera before my trip to Australia because I really liked how it felt and the quality of the pictures it took.  Everything was going pretty well with it until suddenly, it can't take a good picture when the flash is required.  Something is wrong with the sensor.  So now any evening or night time pictures are extremely fuzzy or blurry which really puts a damper on how I can document this trip.I have a couple other problems with it:*It is a little larger than most cameras, and even though it is pretty light and the zoom compacts down pretty far and it is comfortable to use, it is cumbersome in the fact that it doesn't fit easily into a small purse, and it is hard to find a small case for it.*It isn't the easiest camera to use, so if you want people to take a picture of you, often times you will find yourself explaining the camera and how it works for a few minutes before you finally get around to taking the photo.*If you are using the higher quality mode on the camera, it often takes awhile for the camera to save it, which is annoying because you have to wait before you can take another.But a plus of this camera is how well it captures light and color.  It can take pictures of sunsets that are absolutely amazing.  The camera makes the sunset look ten times prettier than it actually was.If there wasn't something wrong with the flash on this camera I would probably give it a four, maybe even five stars, but I am fored to wait until I return home from this country until i can get it fixed, which is really annoying.", "Date": "October 7, 2002"}, {"Title": "Can a camera be your best friend?", "Author": "Thentro", "ReviewID": "R35SFQNE6JXFDH", "Overall": "5.0", "Content": "The Answer is yes. This thing is great! Low light, bright light, moving ( a great feature, 4 shots in 2 sec, cool!) still, clooooooose, far, any thing you want! And you get to see your photos after too. The only complaint extends to all Digital cameras with LCDs, you need to shovel in AA's (I left mine on for a few hrs and it ate 4 new ones) put it on powersave and buy some rechargeables.", "Date": "June 17, 2002"}, {"Title": "Fuji finepix 2800", "Author": "Alexander Tan", "ReviewID": "R2IXWITRNH5TZF", "Overall": "4.0", "Content": "After using the camera, the labels on the buttons like \"Power\", \"Back\", \"Display\", \"Menu\" are all gone. I guess the sweat on my palms erased all of the labels. The words \"Finepix\", \"2800 Zoom\", have faded. It lacks an AV out, the 6x zoom is useful but lacks image stabilization. I'll try the Canon A40 if given the chance.", "Date": "April 16, 2002"}, {"Title": "Will not work with Windows XP !!", "Author": "JOSEPH \"Mojo\"", "ReviewID": "R2LG1YGUAMGVU5", "Overall": "5.0", "Content": "This is a wonderful camera.  Easy to use, tons of features and it produces fabulous pictures.  I have had no problems.  That was until I upgraded from Windows 98SE to Windows XP.  Now I can no longer upload my pictures to my PC.  Although XP will detect the camera and load the correct USB drivers, it will not give you a drive designation.  When XP tries to communicate with the camera, it fails and tells to check your connections. ...I finally went to the Windows XP support site which lists digital cameras supported by XP.  This camera is not one of them.  Luckily my notebook has Windows 2000.  Btw, the manual that came with the camera states the software can be used with XP.  Which I fine but it does no good if the hardware does not work with XP!", "Date": "February 18, 2002"}, {"Title": "Great camera-great price", "Author": "Eugene H. Heinbaugh", "ReviewID": "R9DD7DC1K3I2G", "Overall": "5.0", "Content": "I Purchased this camera late July 2002. I used it heavily through the holidays. It goes through a set of 4 batteries about every 16 to 20 mb of pictures give or take for flash or not. I bought a 128 mb card for it and it's good for 266 pics in the medium mode. I think I used 4 sets of batteries for the whole card.  I am very pleased with this camera. It is very user friendly. It takes high quality pics even on the medium setting. I print very nice 8x10 pics from this camera, 4x6 even better. Would I buy it again? You bet I would.", "Date": "June 8, 2003"}, {"Title": "Great Digital Camera", "Author": "Joseph Julian", "ReviewID": "R3ICHLOREDRC1K", "Overall": "5.0", "Content": "This camera is an excellent value for the price. The 6X zoom is very useful and lets you take high-quality photos from any reasonable distance.I read complaints about low-light situations, but have had only two photos that disappointed me and that may have been because I might have suppressed the flash.It is a lumpy little camera, and finding a carry case required some looking, but I found one that works and I take the camera everywhere. You have to get used to holding it, because of the funny shape, but that is easilly learned.Battery life is quite acceptable on JPEG settings, which I use a lot because it makes E-mailing pics better for down-load time to my friends. My first pic was of my garden on 2M setting. My friends on dial-up chewed me out because it took over 2 minutes to download. For prints and blow-ups, though, this is a wonderful setting, though it uses a lot of memory. I also conserve batteries by using the viewfinder for most applications instead of the screen.I suggest buying an extra set of rechargable NiMh bateries and keep them available.I bought an after-market card reader to conserve batteries at Radio-Shack for [a reasonable price].I would like to see polarizer filters and IR filters available to help with hazy outdoor conditions.It is pretty much point-and-shoot for most situations, but there are a lot of nice features I plan to learn how to use soon.I would like clearer markings on the battery box for us old folks to read better.", "Date": "August 1, 2002"}, {"Title": "Great Entry Level Family Digital Camera", "Author": null, "ReviewID": "R2JA6F0A6B6KQ6", "Overall": "5.0", "Content": "I did not have alot of knowledge about Digital Cameras but knew that it was time to try one.  After reading many reviews, I decided to go with this one based zoom capabilities, personal recommendations and of course, price (which was about $50 more when I bought it 6 months ago!) I had been using a nice little 35mm point and shoot and was afraid I would sacrifice the zoom and clarity. I have been very turned off by the grainy resolution of digital photos that my friends get from their digital cameras so I was PLEASANTLY surprised to see that I get NONE of that.  Especially when using my zoom lens - which limits how much cropping I would do. The only negative thing I can say about this camera is that taking pictures in dark or very dim lighting is difficult because of the EVF which is not a lens that you can view through.  The pictures still come out okay, but you have to see them after taking the picture.  The size and shape of the camera took some getting used to but I absolutely love it now.... Also, I have found that it is more cost effective to take my smartmedia out to print my photos or upload them to an online photo center.  You would never know that the 4x6 prints are from a digital camera, and that's what I wanted.I do reccommend a 64mb smartmedia or larger (2 64s would be ideal!) Video takes up alot of space. NIMH rechargeables are a must.", "Date": "February 24, 2003"}, {"Title": "Great Little Camera", "Author": "Kenneth W Jackson", "ReviewID": "R3VRUUJUVKDB2H", "Overall": "4.0", "Content": "This camera takes excellent photos in all quality (image size) settings.Downloads are easy and the program offers a slide presentation which is useful when viewed by a large group.My only complaint is that this little unit is power hungry.  Alkalines and rechargeable last about the same amount of time allowing 30 - 50 shots depending on shooting mode (flash vs. no flash).", "Date": "January 15, 2003"}, {"Title": "This is a great choice", "Author": "Michael Lugassy", "ReviewID": "RB1N5YII763WC", "Overall": "5.0", "Content": "I didn't have time to conduct any special surveys or waste time at computer stores. Luckily, I bumped into this cool digital from FujiFilm and got excited. This piece is great, very small yet powerful and of great quality. Images are sharp, even on low-mode, the 60 sec video option is great and the web-cam ability is even cooler.Installation on WinXP is a snap, menus and configurations are pretty straight forward. I personally didn't look at the manual AT ALL.This is a great camera for your money! Be sure to include re-charging batteries and another memory card at your purchase. Both gets empty pretty fast.And no, I don't work for Fuji :)", "Date": "August 14, 2002"}, {"Title": "View finder", "Author": "Darrel D. Prouse", "ReviewID": "RPG7UXX02MZJS", "Overall": "4.0", "Content": "I recently purchased this camera and have found it to be everything that I need with one big exception.  I find it difficult to view the image that I am trying to include in the picture with either the viewfinder or the LCD display.  This is especially true when there is dim light or there is dark objects around the subject. Otherwise, the images are sharp, the memory that comes with the camera exceeds that of most cameras and with the additional memory that I purchased I can take more than enough pictures even at the highest resolutions.", "Date": "July 21, 2002"}, {"Title": "Great camera!!!", "Author": "Stephaney", "ReviewID": "R1Y6J844775R7K", "Overall": "4.0", "Content": "This is my first digital camera. It is a little big for a digital camera more comparable to a 35mm in size. It is simple to operate and even simple to download pictures on computer! That is one of the reasons I got it is to email pictures to friends and family, it is perfect for that. I keep it on the lowest megapixel setting to be able to email more pictures, otherwise it is too big to send. I purchased a 128 mb card and have taken more than 200 pictures with still more room available! The only negative area is the ability to see what you are taking a picture of in low light setting. You just have to aim and shoot and hope you didn't cut off anyones head! Make sure to use the auto focus or your pictures will be off focus! Found that out the hard way! Not good for action shots, You miss the picture by the time you focus and take the picture. Someone needs to make an affordable camera that takes action pictures better.The zoom is AWESOME!!! It makes editing even better! The next digital camera I would get would be smaller and I would want quicker shutter speed. Other than that I think this camera is great!!!", "Date": "January 13, 2004"}, {"Title": "All my friends envy me", "Author": "\"lusavka\"", "ReviewID": "R2XPA0M6AHUB8P", "Overall": "5.0", "Content": "All I can say is that I love this little camera.  All of my friends envy that I can make simply excellent pictures with it.  Excellent optics.  Especially valuable is the 6x zoom feature.  The only thing that I miss is the ability to see objects in my camera when its dark (when you take a shot in a drak room you do not really see what you will picture). But it is manageable.", "Date": "April 19, 2003"}, {"Title": "Fantastic", "Author": "C. S. BAKER \"missspider\"", "ReviewID": "R319BVHTBKN08N", "Overall": "5.0", "Content": "I had been researching digital cameras in the under [price] range for over 6 months. I wanted something with awesome resolution and something that catches color realistically. I finally found it in this little beauty. It defiantly had the \"most bang for your buck\".I am so thrilled with the Fuji FinePix 2008Z and after having a lesser dig. camera several years ago, the technology has certainly improved by leaps and bounds. I am happy with my second digital camera. The range, versatility, ease of operation & dynamic colors can't be beat. I can't put it down! Plus the software that accompanies it is easy and helpful.The only thing you need to look out for is lighting while using its nifty digital camera feature. Make sure you can get as much light on as possible while filming indoors or the 60 sec film looks terribly dark & bleak.Other than that, the size is wonderful, (it fits very comfortably in hand); the sexy silver body is so darned cute I leave it out near my computer so I can look at it all the time! Don't worry about not liking this camera; I don't think it's possible.", "Date": "March 23, 2003"}, {"Title": "Highly recommend!!!", "Author": "H. Holliman", "ReviewID": "R2E2YRHP5N7AC4", "Overall": "5.0", "Content": "This is a GREAT camera.  The comments about the dark viewfinder are true - it is very hard to see in low light.  The image is being viewed thru the lens, not thru a clear glass like non-electronic viewfinders.  Otherwise, the camera is exceptional.  Most all the controls are automatic, but this setting takes perfect pictures in all light situations.  FINALLY - a digital camera with a healthy zoom!!!", "Date": "March 16, 2003"}, {"Title": "Excelent Camera", "Author": "Amy", "ReviewID": "R39S46RIS6ULXS", "Overall": "5.0", "Content": "I take pictures with this camera for my personal use and for my website and works great!  The color and resolution in the photos are excelent. The 6X Optical Zoom made the photos clear and brilliant and the movie feature it's ok for a digital camera. I use a lot the feature bonus (Webcam) to videoconference and is a great plus. This camera worth the price.", "Date": "February 20, 2003"}, {"Title": "Great option for the novice", "Author": "\"sflinders2\"", "ReviewID": "R2IN37KOQPAAFF", "Overall": "4.0", "Content": "Purchased this camera after weeks of searching for the best deal.  The general consensus is that the camera performs poorly in low-light situations which is true however my experience leads me to believe that it's the type of light that the camera is picking up.  Regular incandescent bulbs are for somereason hard for the camera to pick up while the same low light in a flourescent bulb is picked up very well.  I began using the camera immediately upon arrival without so much as opening the instruction manual.  Camera receives 5 stars for ease of use.  The pictures are superb, clear, clean and vibrant.  Batteries do run down very quickly so I do recommend purchasing rechargeable which can be done very inexpensively.The options found on this model including the 6x optical zoom are a great bargain.  Other than low light performance you will not be dissatisfied with your purchase.", "Date": "February 5, 2003"}, {"Title": "awesome camera!", "Author": null, "ReviewID": "R1RJAIH9QCNRNR", "Overall": "5.0", "Content": "with the 128MB smartmedia card at 1280x960 resolution, you get an amazing 398 photos before having to clear off the card. at 640x480 rez, you get almost a thousand photos. the features on this camera are like having an slr without having to deal with film and developing. an awesome camera!", "Date": "November 17, 2002"}, {"Title": "Gives you what it promises", "Author": "Nihit Kaul", "ReviewID": "R7ACPDCOBJK1V", "Overall": "4.0", "Content": "Have had this camera for nearly 6 months and it has taken some fabulous shots. For the price tag that it comes in at - it is a neat buy. Also the 6x zoom (which was the feature that made me buy it) is just perfect (for me). On the downside it seems to have problems in low-light conditions (as almost all digital cameras do) and that is an area which leaves some things to be desired. Also since the 6x zoom is not stabilized you can use it only in the best of lighting conditions.All in all a great value for money and a good buy for enthusiasts who do not want all manual controls but do desire a lot more zoom power.", "Date": "August 29, 2002"}, {"Title": "A 4.5+ Digital", "Author": "David K. Hill \"beecnul8r\"", "ReviewID": "R3M3WTW3KMD7EA", "Overall": "4.0", "Content": "The Fuji 2800 is the smallest 2.1 meg. DC and has a 6X lens.  The ergonomics are perfect provided you use your third finder to push the button for photos and not your index finger (which naturally falls over the On/Off button).  My wife, the actual \"giftee\" is technically challenged.  I needed a DC with simple to use \"point and shoot\" technology and this one delivers in SPADES!  She is thrilled at the fact that it is NOT a rangefinder (she cuts off heads othewise) and that the screen is bright.  Downloading is easy and Fuji appears quite committed in that they have a special user-only web site that is oriented to their customer needs.  I am very pleased...", "Date": "December 8, 2001"}, {"Title": "design flaw", "Author": null, "ReviewID": "R1HUQP12CLU6GI", "Overall": "1.0", "Content": "I've had this camera for a couple of years, and up until now have been pleased.  The last time that I powered it up, the lense housing extended at a crooked angle, and I got a \"zoom error\" message.  The camera is now inoperable.  It seems many others on the web have experienced this as well.  I contacted the nearest Fuji authorized repair center and was quoted $120 to fix the camera.  I might as well buy a new one for that money (not a Fuji though).", "Date": "June 19, 2004"}, {"Title": "First Camera I Have Purchased Since My Polaroid Instamatic", "Author": "\"scott_95673\"", "ReviewID": "R31VHRK65JFOJD", "Overall": "5.0", "Content": "Nice unit, It is not only great to be taking pictures again, but with this camera it is great fun. I researched digital cameras extensively before I purchased this one. Within Five minutes I was taking great pictures. It was very easy to figure out how to use it. I just kept saying \"WoW\" every time I downloaded another picture.", "Date": "August 18, 2002"}, {"Title": "Best Investment!", "Author": "Renee Klee", "ReviewID": "RZTQVQT9FBEHO", "Overall": "5.0", "Content": "We have had the Fugi FinePix 2800 for 2 weeks now and am still getting familiar with all the features. It takes the most clear and crisp pictures we have ever seen. There is no need to touch up anything. It is very EASY to operate. It's smaller and lighter than I had antisipated. We also purchased the rechargable batteries and charger and upgraded to a 32mb memory card. This was also a great idea. I would suggest getting the bag, too. This is the best investment we've made in a long time!", "Date": "July 21, 2002"}, {"Title": "Excellent Purchase", "Author": null, "ReviewID": "R3VU14EDRTUZMR", "Overall": "4.0", "Content": "Of all the items I purchased for Christmas, this was by far the best!  My girlfriend loves it and it is very easy to use.  The only complaint she has is the camera eats batteries like there's no tomorrow...one way to avoid that problem is to not use the LCD screen to take photos.  I recommend purchasing this camera because it is easy to use and \"very cute\" as my girlfriend says...and for the cost, you couldn't ask for much more.", "Date": "January 29, 2002"}, {"Title": "I have to vote thumbs down....", "Author": "Tracy", "ReviewID": "R20L8ESRHMR9ZN", "Overall": "2.0", "Content": "This camera has some wonderful features, especially for the price. However, the big down fall is Fuji failed to incorporate an optical viewfinder. This makes it nearly impossible in very bright conditions (like the Arizona sun) and dark conditions (any indoor activity with low lighting) to see what you are shooting. You can point and re-take as many times as you need, but I missed too many shots this way. This was my third digital camera, and I returned it because although the prints were beautiful and clear, and I loved the zoom, it wasn't worth sacrificing my compositions for. I played with all the controls to try and adjust, but the only solution was either a tripod or bring your own lighting. I exchanged it for a Canon and am very pleased with it. It has less features and zoom, but at least I can set my picture up the way I want it, the first time. I do miss the XP picture card though- that was extremely fast download and shutter time.", "Date": "April 30, 2003"}, {"Title": "Great little camera.", "Author": null, "ReviewID": "RJ8FM7SCMQXF0", "Overall": "5.0", "Content": "After an exhaustive review of camera's in the ... price range to replace my lost Olympus D-100, I chose the Fuji FinePix 2800 mostly for the 6x zoom. Some of the review had me worried about certain aspects of the camera, but I went ahead and bought it.I was VERY pleasantly surprised when I recieved the camera. The 6x zoom works very well, and the camera is a joy to use. It's not perfect, but the features (and price) far outweigh the negatives for me.Pluses:- 6x Zoom- Great color and image.- USB camera port works flawlessly with Linux for image transfer.- 60 second movies with sound.  This is the one that surprised me. I knew about the ability  to take short movies, but the reality is much better than  than I thought it would be. It reminds me of the old  Super8 home movies my grandparents used to take.Minuses: - No active autofocus. Autofocus doesn't do well in low light.- Lenscap instead of door to protect lens.- LCD viewfinder. Actually, it works pretty well, even in lowishlight situations, if you turn up the brightness setting. I had many more problems with the autofocus. But the viewfinder does take getting used to, and the pause in the viewfinder screen during autofocus is a bit annoying.I haven't had any problems with it eating batteries, since I bought some good high capacity NiMH rechargables. The camera is somewhat short and squat which makes finding a camera bag challenging, but it is comfortable to hold due to a nice right hand grip.All in all, it's a great little camera at a great price. The 6x zoom and image quality is worth the price, and the mini-camcorder feature is just icing on the cake. The autofocus can be annoying sometimes when indoors, but other than that I love this camera.", "Date": "September 4, 2002"}, {"Title": "The best camera for beginners, bar none.", "Author": "Jeffrey A Flores", "ReviewID": "R2TMOGW71A5N5S", "Overall": "5.0", "Content": "I bought the 2800 back in 2001 and it was my first digi-cam (first camera, period). I had it for about 7 years, and then sadly, one day it died, inexplicably. It takes very good pictures for being somewhat archaic and simple. Not a heck of a lot of features, but that was the cool part about it. All you really had to do was point the camera at what you wanted to shoot and pull the trigger. Easiest camera, ever, and it captured years of fun times. I'd definitely recommend it to anyone who is looking for a used first camera.", "Date": "September 29, 2010"}, {"Title": "Zoom Lens Fails to Retract", "Author": "Rich W", "ReviewID": "R35Q0ADBMBYBWY", "Overall": "3.0", "Content": "Lens cannot retract, October 7, 2005I have been an owner of this camera since 2003.  I probably have taken several thousand images and would view the quality quite good.  However, I too now experience the same problem as listed by a couple other reviewers that the zoom lens now fails to retract and as a result the camera is now inoperable.  I contacted Fuji's customer service and basically they say they have no real record of this being a design flaw.  You need to send it to them to get a repair estimate ranging from $30 to $100.  They only warrantee the repair for 3 months.  Since I can buy a new 2800 for $100, it doesn't seem worth it.", "Date": "April 19, 2006"}, {"Title": "higher megapixels...who needs them?", "Author": "Grrgoyl", "ReviewID": "R3KXGL5ND420TS", "Overall": "5.0", "Content": "For the money this camera is an excellent value.  My first digital was a FujiFilm FinePix A201, with only a 2.5 digital zoom and 2 mp, great for starters but I really didn't like any of the pictures taken with it.  I guess the magic is in the zoom, because the 2800 takes crystal clear, super sharp pics that I thought were only possible with either a 35 mm or a ridiculously-overpriced camera with 3 times the megapixels.  I like the 35 mm-style casing, it makes it look like a much more expensive camera, and of course FujiFilm's very simple to use menus.  The interface with my computer is quick and painless and I had a beautiful shot, from shutter to printed copy, in less than 5 minutes.  My only complaint so far has been the delayed shutter speed, not very good for taking pics of animals that don't stay still long, but I can live with this.  Others complain about the viewfinder being too dim indoors, and this is also true, but like another review pointed out, the film is cheap while you experiment. For beginners who want professional-looking prints, this is the camera to use.", "Date": "March 30, 2004"}, {"Title": "Good Value, Good Pictures/Movies", "Author": "Robert G.Walden", "ReviewID": "R7Q5HZR382TLP", "Overall": "5.0", "Content": "Howdy again folks.  I have to say that this Camera is worth its gold.  I bought two 2800's for Xmas on Ebay and another dealer, and I like to say that I tested the cameras (after they were opened) and after testing the longevity of the batteries, I will say the batteries last and long time, compared to some digital cameras that eat batteries for lunch (Canon A60 for example.  My friend and my sister both loved the little camera and said it was so cute, and there friends loved the smallness. The quality of the pictures are great, considering that it is a 2.0 MP camera.  But with Fuji film, they almost always make pictures sharper then what they should be.  I will always give thumbs up for Fuji film for its picture quality, no matter the MP limit.I will have to say, even though this camera is small and cute, its not meant for putting in your pocket or shirt pocket (unless you want this big lump on your chest).  But that would be my only complaint.  I haven't tested this camera for dropping (since everybody always drops there camera at one time or another). But judging from the design of the camera, if you drop on the sides, you are fine, but I don't know what would happen I you dropped it on its front.Movie mode is nice.  The sound is vibrant, and the speaker picks up little things that you might not catch normally.Other then that, good camera.  Highly recommend for outdoors and reliabilty.", "Date": "December 21, 2003"}, {"Title": "Versatile and performant.", "Author": "C.A.Montana", "ReviewID": "R459MODFEQQ5N", "Overall": "5.0", "Content": "I love this little gem. It is versatile, performant, lets you fine-tune all the settings or automate the whole picture-taking process. Powerful zoon, crystal-clear shots in Macro mode. There are a lot of features to play with. You gotta try it.", "Date": "October 16, 2003"}, {"Title": "Finepix 2800", "Author": "Gilbert Reed", "ReviewID": "R1NA61U0CXQ7PP", "Overall": "4.0", "Content": "Excellent camera for anything but low light! Excellent results with the movie mode, which has sound. It will also playback movies with sound. can also replace a camcorder. I have had this camera for almost 2 years. 6X optical zoom is handy.", "Date": "October 3, 2003"}, {"Title": "UPDATE", "Author": "R. Borsdorf \"bertdorf3\"", "ReviewID": "RD6MJYYOPTAUE", "Overall": "5.0", "Content": "Though I still loved my camera till the day I killed it, you need to be careful with the extended lens. I set mine down on the seat in my boat and it fell while turned on, and the lens twisted, giving me ZOOM ERROR. It still takes pictures at non-zoom settings, but it will cost the price of a new camera to repair. So take it for what it's worth... just keep in mind that the long extended lens is a delicate item.My next digital camera will most likely be a Fuji because you'll have a hard time beating the quality of photos that I've been printing up for almost a year now.", "Date": "September 17, 2003"}, {"Title": "Amazing value and quality", "Author": "NewRunner", "ReviewID": "R1ODEYCUV6WRU3", "Overall": "4.0", "Content": "I wanted a digital camera to keep my folks and in-laws at bay with regard to frequent demands for pictures of their grand-daughters. The USB connection to the PC and the nice all-around FinePix software that this camera comes with, allows me to do that with no hassles. The software also can e-mail photos directly, and it automatically makes the photos a manageable file size for attachments. So, for example, a 300kb photo will e-mail as a 80kb photo and still retain great quality in the e-mail.I was also looking for a camera that had decent optical zoom capability because we are often outdoors and I like the flexibility of close-in as well as wide shots. This camera has a very capable 6X optical zoom which I have enjoyed using.Finally, as any parent of young children knows, it is really difficult to get them to sit still. This camera offers a 60-second video capability, which has often come in handy to capture my kids at play or doing something silly.I have received a lot of compliments on the camera's images.Some minor drawbacks - in dark conditions, the camera has trouble picking out images to auto-focus on. I get around this by pointing it a nearby light source that is roughly the same distance to the camera as my subject. In addition, there can be a maddening 1 to 2 second delay in capturing and saving an image. But you learn to live with it - and sometimes what you clicked on is not what you get in the image, but you get used to that, and many times the image you got is better than the original. Also, it is not slim enough to fit in a purse - so it usually goes at my side in a pouch or in a backpack.Overall an excellent and highly recommended all-around digital camera.", "Date": "August 30, 2003"}, {"Title": "I Love My Camera", "Author": "Wayne R. Hilliard \"sunflower06\"", "ReviewID": "R1MU6O4LYTQ7WO", "Overall": "5.0", "Content": "I really can't say enough good things about this camera. I have used it in many different lighting situations. Including taking pictures of fireworks.  The macro feature is great. I have always loved taking experimental close ups of my flowers but was prohibited by the cost of film and developing. The camera does work longest and at its best with rechargeable nimh batteries but they too are worth the price.  Even if I choose to upgrade to a higher mp camera, I'll still keep this one. Its easy to use and a lot of fun.", "Date": "August 22, 2003"}, {"Title": "This is one heckova camera", "Author": "G. Harrington", "ReviewID": "R2OEDOT349G92J", "Overall": "4.0", "Content": "I love it, I absolutely love it.I have had the camera for just over 3 weeks.  I took it on vacation with me and never having read the instruction bookI was able to figure out how to use it in minutes.  Quality of photos is outstanding and the 6x zoom is increadable.  I took a lot of seascape photos as well as some beach shots and that zoom really came in handy.I had no problems with the viewfinder as others stated they have, perhaps because I didn't take any night shots but inside shots were no problem.What really surprised me was that it is not necessary to install the software that comes with the camera so long as you are running XP.  I simply plugged the up usb ports and XP found the camera, no program to mess with.Even with all of these positive comments the reason I rated it a 4 instead of a 5 is because of the way the shutter button and the off/on button are located.  I continually pressed the off button instead of the shutter button  until I got used to it.At this point in time I feel this is a great camera and for the price, I paid less than half of the going price, and I really rate it a 4.9", "Date": "July 23, 2003"}, {"Title": "Best I can find for this price", "Author": "Jasmine", "ReviewID": "R1MPQ6CFASU5C8", "Overall": "5.0", "Content": "I love this small silver camera. It takes pictures with really high quality. I also bought 4 1200ma batteries and a 128m memory card for it. When I went out for a field trip the batteries lasted for more than 3 days. I took hundreds of pictures. Although I did not take pictures with the highest quality this camera can make, they look excellent. It is amazing. All I can say is that I made a right choice.", "Date": "June 5, 2003"}, {"Title": "Great Camera! Great Price!", "Author": null, "ReviewID": "R35BD9OVECH040", "Overall": "5.0", "Content": "I went to several big name (and supposedly reasonably priced) electronics stores and found this camera priced...higher.  I got it here for almost [a lot] less than the big name places.  Some stores didn't have this model at all.  I love this camera!  Easy to use (my 11 year old can use it without help), it's compact and produces FABULOUS pictures.  I didn't care for all the extra software that got loaded onto my computer by the FinePix software program CD.  It doesn't even give you a choice as to whether you want all that extra stuff.  We just loaded it, then deleted what we didn't want.  Other than that little inconvenience, it's a great camera.", "Date": "May 14, 2003"}, {"Title": "Takes great picture!", "Author": "Hayato Iriumi \"coldfusion\"", "ReviewID": "R3FA6NVGVIQSTF", "Overall": "5.0", "Content": "I love this camera. It's not another 2MP digital camera. It takes amazingly great picture with great color. This is my first digital camera, and I compared mine with my friends' camera, and this is definitely the best for the money.", "Date": "May 14, 2003"}, {"Title": "love this camera!", "Author": null, "ReviewID": "R3BLG3K7R16DL7", "Overall": "5.0", "Content": "I've been putting off buying digital.  I liked my old trusty 35mm.  In December I bought the FinePix 2800 from Amazon. It is great indoors and out, snow/water/pets/people - it takes great pictures.  DO buy the rechargeable batteries and a back up set  They last much longer than the regular batteries, and the power cord for downloading is a necessity.  It was easy to learn how to operate it.  There is a slight difference in taking a picture of a moving object but I got the knack of it after a few photos.", "Date": "March 27, 2003"}, {"Title": "Terrific camera, great value", "Author": "Pace Ripley", "ReviewID": "R2ZAU5SVXJ7ELP", "Overall": "5.0", "Content": "If you want a great camera, amazing zoom, enough resolution and [inexpensive] memory - nothing can beat this camera.Extremely simple to use, with very powerful features, it produces excellent images and consumes very little battery power - especially if you use NiMH batteries. It even works on Linux without a hitch. Can you ask for more?Yes. It does not have manual high speed shutter controls. Bummer, but I can certainly live with it. This device rocks!", "Date": "March 27, 2003"}, {"Title": "Issues: lens cap, on/off buttons, no image sequencing", "Author": "\"swimsportlisa\"", "ReviewID": "RA2QVK3DCSKWZ", "Overall": "4.0", "Content": "I love the design of this camera. It fits perfectly in your hands! The interace on it is easy to understand, too - even without reading the manual, and I love the zoom lens capabilities. You can close in on your subject's relatively quickly... I took it out shooting wildlife photos and the images were extremely clear and  professional despite the animal's movements and the overcast sky. I do have three issues with this model, however.1) the placement of the on/off button and the shutter are easily confused. I've often gone to snap the shutter and have turned the camera off altogether!2) the dangling lens cap is annoying. It dangles on a string and you always feel like you're going to lose it somehow since it's not built-in.3) there appears to be no image sequencer on this, so your smartmedia files all have the same id numbers and you can't put two cards on the same file on your computer because you'd be saving over your files.solution? Create new folders each time you download a card of images. When you go to catalog the images, though, the fact that you have multiple images with the same file names (i.e. card 0001.jpg and .0001.jpg is a big pain!)", "Date": "November 23, 2002"}, {"Title": "I LOVE THIS CAMERA!", "Author": "Christina Johnson \"tina_j\"", "ReviewID": "R1V03WN23HVLA3", "Overall": "5.0", "Content": "We bought this camera as an upgrade from our first digital which was only 0.8 megapixels.  This camera takes awesome pictures and the flash card makes downloading a snap.  We have an HP Photosmart printer that the card just pops into and reads as a removable drive, so we don't even need the USB connector.  The pictures are very clear and the menus on the screen are easy to use.  I would definitely recommend this camera to anyone!", "Date": "August 12, 2002"}, {"Title": "Great for a beginner", "Author": "\"vodka_rani\"", "ReviewID": "R2EFUX332XRZ31", "Overall": "5.0", "Content": "Its excellent value for money. The 6x zoom is awesome. But those are looking for more creative control over shutter and aperture, etc. this is not the camera for you. It only gives manual control over exposure value and white balance. Although by playing around with these values you can take some excellent shots too.", "Date": "August 8, 2002"}, {"Title": "Great deal", "Author": null, "ReviewID": "RKEJMB4RG7G84", "Overall": "4.0", "Content": "This is my first digital camera and I must say I'm impressed. The only downside I can see for this camera is the poor visibility on the LCD display in low light conditions. If you can work around that though this is a great camera for the price.", "Date": "July 31, 2002"}, {"Title": "what i thought", "Author": "patil", "ReviewID": "R37HY5M7X8XYWW", "Overall": "5.0", "Content": "When I got my camera i knew it was a 6X zoom, but after reading the booklet which explained everything i knew how to do everything. I'm not that into electronics but I use them in my daily life a lot. So, when my mom got me this camera so i could take it on my upcoming trip i was thrilled. The only downside the batteries finish quickly, but the pictures are efficient.", "Date": "June 6, 2002"}, {"Title": "Fuji Finepix 2800", "Author": "J. R. Johnston \"Keen watercolourist.\"", "ReviewID": "R1BWUAQPSSF8Z9", "Overall": "5.0", "Content": "What a beautiful little digital camera. Does everything I could wish for. The EVF is not as bad as some would have you think and I soon got used to it. I found it excellent in almost any conditions that one would be wanting a digital camera for. In any  lower light photography, I would be more inclined to use a standard SLR on a tripod as a larger diaphram opening would be necessary. Digital cameras and Film cameras each have their place in photography and neither does exactly what the other is capable of, so don't expect your digital to do everything.The 6 times zoom is the best I have seen and even the farthest away object in the photo is displayed in all it's detail.The voice captioning is another neat feature that allows you save your images with their own talking display. Fantastic.I have no complaints about this camera and can recommend it to anyone who is contemplating buying a digital camera. It is my second digital camera so I knew what I was looking for when I bought it.", "Date": "December 30, 2001"}, {"Title": "Lens cannot retract", "Author": "M Lai", "ReviewID": "R1RSIHWE20ONGE", "Overall": "3.0", "Content": "When the camera worked, it was quite good.  But the first time its lens was not able to retract, I was able to get it fixed under my credit card's extended warranty.  Seven months later it happened again and it was out of warranty.  And the repair shop was not able to find parts for it.  I think Fuijifilm needs to issue a recall and refund.  I am doubtful whether I should buy another Fuji again.", "Date": "October 7, 2005"}, {"Title": "Super Value and Great Pictures", "Author": "MICHAEL A COCHRAN", "ReviewID": "RY0DUPNBUXCTU", "Overall": "5.0", "Content": "This camera is perfect for the amatuer photographer who would like to own a nice camera that takes beautiful photographs with stunning clarity!", "Date": "November 8, 2002"}, {"Title": "Anyone notice?", "Author": "Sam W. \"samw610\"", "ReviewID": "R232EWS8MMTF0G", "Overall": "3.0", "Content": "Has any one notice the confussion between the shutter & power buttons??Or is it only me???I keep hitting the power (off) button when I want to take a picture, therefore loosing the picture.Good thing I haven't tried to take \"once in a life time\" photos yet.This is my only real complaint, enough for me to return the camera.I rate 3 stars due to the power button, 5 stars for everything elseOtherwise I agree with everyone els that this has great features and photo quality, for the price", "Date": "September 15, 2002"}, {"Title": "Fuji FinePix 2800 Digital Camera", "Author": null, "ReviewID": "R1CBZ2Z04H23RE", "Overall": "5.0", "Content": "I must be the only reviewer who has actually bought one of these - let alone used one - because despite the claims of previous reviewers, the camera is not made out of metal, but silver painted plastic!Despite this fact, the camera is VERY nice to use: it is comfortable in the hand, and produces sharp pictures with a crisp, clean color balance.", "Date": "December 11, 2001"}, {"Title": "It keeps breaking down", "Author": "beach bum \"beach bum\"", "ReviewID": "R318B2DZAI5Y7S", "Overall": "1.0", "Content": "I bought the camera 18 months ago (June/02). It has broken down twice. The first time (under warranty)was unable to download pictures from the camera to the PC. The USB cable would not seat properly where it connected to the camera. In any event, I had to send the camera to the Edison repair facility. It took 2 months for the camera to get back to me - no charge except the cost of shipping. The camera broke down again in September 03 (out of warranty). This time, no power - simply stopped working. So, once again, off to Edison, NJ for repair. I'm still waiting for the estimate.Maybe I have a lemon. I like the camera when it's working - it just seems to be spending as much time in the shop as with me.", "Date": "December 8, 2003"}, {"Title": "Only had it for one year and it's broken...", "Author": "Marie B.", "ReviewID": "RNBEUT6SU404S", "Overall": "2.0", "Content": "I advise anyone to avoid purchasing this camera! I will say that it worked just fine for the first 8 months, and then I experienced a major flaw that seems to have happened several times to other owners ('zoom error'). The camera lens remains retracted and the camera will no longer function. I was able to somehow get it to work again (after periods of turning on and off, removing batteries and replacing them....etc...), but that was aggravating and I no longer had a reliable camera. It now does not work at all no matter what I try.After reading reviews from other disappointed owners, I am not even going to check into repairing it and I will never buy a fujifilm camera again.", "Date": "July 29, 2004"}, {"Title": "A good friend", "Author": "Shaun", "ReviewID": "R1LHQ8P3CRC8R8", "Overall": "5.0", "Content": "Well what can I add on the subject of this camera.It looks good, performs good, and by God it is good for the price.I bought mine after a lot of searching on the net regarding reviews.By the way mine was bought in Hong Kong and a lot of dealers tried to upgrade me to a more expensive one but I stood firm as this was my first digital camera.I have had it just over one year now and thought I would upgrade to a more expensive one, but changed my mind because this does what I want it to do with great results and is a good friend to me as a novice.By the way the finepix software is also very good for a learner to get by with.No camera case at this price is no big deal either, along with a 6* zoom and 60 secs of movie with sound why sell on as it will be missed as the first you have tried?Anyway mine will be given as a gift to a novice family person when I decide to part with it.A word of warning is that this camera is small and clumsy to handle for a person with big hands like me, and I think one drop on a hard floor will see it off.I use the neck strap for extra protection.Forget the mentions of the little things like lcd light and no case.At this price and a first digital camera Fuji have done a good job, and the pictures, well just WOW for a novice like me, and others to show friends.", "Date": "October 17, 2003"}, {"Title": "Great camera!", "Author": null, "ReviewID": "R2Z1AO7Q13F3PI", "Overall": "4.0", "Content": "This is my 2nd digital camera. My first was the ephoto 780c by AGFA. No zoom, with just under 1mp, took decent pictures for a no frills camera. After dropping it one too many times, it was time to get a new camera. After reading a ton of reviews, I decided on Fuji's 2800.When I first picked it up I thought it felt too light, almost toy like. This is no toy! Going from under 1mp to 2mp is a huge jump. The pictures are crisp, clear and with vibrant colors.My only complaints are,1) the view finder/lcd is usless in low light. This makes taking pictures indoors or at night pretty much a guessing game. Very surprising coming from a camera of this caliber.And 2)you cannot preview the picture you just took and disgard it if you want before going on to the next picture. You'll have to change the setting, look for the picture and then delete it. If you aren't paying attention, you could erase the everything! Who wants to sift though a bunch of BAD pictures if you can get rid of them from the get go?!Other than those 2 things, this camera rocks!", "Date": "April 14, 2003"}, {"Title": "Great Camera for the price", "Author": "\"captpfd\"", "ReviewID": "RNRPBSUJK7Y92", "Overall": "5.0", "Content": "Just received my camera and could not wait to start taking pictures. Nicely packaged and easy to get out of the box. Once out of the box it was easy and quick to learn how to use my new Fuji. I started with some inside photos and then some outside photos, and I could not beleive the quality of the pictures. When I transfered them to my CPU I was quickly emailing photos to family and friends of all the snow. The zoom brought some birds eating in the snow way closer than my old Cannon ever could. Even though that is and always will be a great camera. I recommend the 64 MB smart card even though I never exceeded the 16 MB capacity. I cannot wait to take the camera to a sports event and get some great pictures. Way to Go FUJI, great camera for the money.", "Date": "February 15, 2003"}, {"Title": "First Digital & I love it", "Author": null, "ReviewID": "R3IGE1EIBZGYSI", "Overall": "5.0", "Content": "I've been a photo hobbyist for Several years . Have owned several 35mms with a new Nikon my latest purchase just 2 years ago. Was not a big fan of digital but was sold when in the carribean and saw a realtime comparison of several different cameras. I SOLD !Very easy to use right away, great, clear images. Love everything about it. Sorry I didn't buy one earlier. I still love my 35. but now have a new traveling companion.", "Date": "August 5, 2002"}, {"Title": "Easy to use!!", "Author": null, "ReviewID": "R17WFFZIY2BB90", "Overall": "5.0", "Content": "I work in a camera store ,so I'm always playing with the new items that come in. Fuji's line of digital cameras is great!!  They are so user -friendly that I can take one right out of the box and start using it without even having to read the instruction book! Everything is right there on the viewing screen! The 2800 also feels great in your hand! Has a good grip on it! But most important, the pictures from it are more true-to life color than from most other brands of digital cameras! Prices are affordable,too!!", "Date": "June 6, 2002"}, {"Title": "Great Camera (and it does work with XP)", "Author": "John Galt", "ReviewID": "RB5DZKFMUUJZ2", "Overall": "5.0", "Content": "My first digital camera and I'm very happy with the purchase. Don't know what the previous reviewer's problem with XP was, but like another reviewer said... I just plugged it into the USB port and XP auto-configured the new \"removable\" drive with 0 problems. Highly recommend this camera. Pictures are fantastic and PC transfers are a snap...", "Date": "March 22, 2002"}, {"Title": "Fujifilm FinePix 2800 2MP Digital Camera w/ 6x Optical Zoom", "Author": "dasls", "ReviewID": "RP7ZN84V5KEFS", "Overall": "4.0", "Content": "The Fujifilm Finepix camera was just like new. We have taken some very nice pictures with it and was well worth the price.", "Date": "February 5, 2013"}, {"Title": "Fujifilm FinePix 2800: Still the best after 12 years", "Author": "CJ \"MazPharma\"", "ReviewID": "R2KRZ7CZFK0UMV", "Overall": "4.0", "Content": "Having owned this camera for 12 years I'm still trying to find a decent replacement that takes such good pictures: superb colour and crisp images are the strong points of this fine Fuji product. While my Panasonic Lumix 16 MP is a good camera, it doesn't come close to the FujiPix' colour -- I'm always tweaking fotos to obtain the best result. Neither does the Lumix take such good indoor fotos as the FujiPix. I suspect the reason for the difference lies in the lens, the larger Fujinon being way superior to the Panasonic Lumix Leica lens. The FujiPix is limited by lack of a wide angle lens 2MP max, although I still wonder how it takes such true colour high resolution fotos at this level. If Fuji could upgrade this camera to a 12MP, wide angle version I'd buy it. However, with the pace of technology I'm forced to look at more exotic cameras: best fit will be the FujiFinePix HS30EXR or the Canon Rebel T3. Any advice would be much appreciated!", "Date": "January 21, 2013"}, {"Title": "Everything was fine except no cable to download pcs to computer.  My old one did not fit.  Creates a problem as I have to go to", "Author": "Patricia Carden", "ReviewID": "R30NKDZ55VRJ4S", "Overall": "4.0", "Content": "Everyting worked fine except no cable to transfer pics to computer was included.  I need one or a memory card reader which would accomadate the old memory card (called a smart card).  Otherwise I have to go to Sam;s to have them printed or put on a disc.  Thanks for your assistance in remedying the poor performance of the first agent.", "Date": "January 13, 2013"}, {"Title": "MY REFLECTIONS", "Author": "DON'T WORRY ABOUT IT \"THAGR81\"", "ReviewID": "R1OD0QIBPJKGA7", "Overall": "5.0", "Content": "THIS FUJI FINEPIX 2800 2MP ALLOWED ME TO CAPTURE SOME VERY VIVID PICTURES. THIS CAMERA HAS THE CLEARITY OF A HOT HUMID DAY IN JUNE. THE BRIGHTNESS,SHAPNESS,QUICKNESS OF THIS CAMERA IS UNBELIEVEABLE. AND ITS LIGHT-WEIGHT. BEST CAMERA. MAY I TAKE YOUR PIC? LOL", "Date": "December 30, 2007"}, {"Title": "Wow, what a great Camera", "Author": "Roger Roomes \"Roomes\"", "ReviewID": "RGDAY595KPQEK", "Overall": "5.0", "Content": "This is indeed a wonderful camera. I have had mine now 3 years and it is still going strong. I have even decided to stay in the Fuji Line and get the S9100 which comes out this month. So when I have the money, I will be one click away form another great camera. My Dad has a Nikon and it is a 4MP and the Fuji takes way better pictures, quality and all. The only down fall on the camera, is taking photos in low light situations, it is difficult to see what you want to capture, but when you snap and look at it, wow, it is a whole new world, the photo is clear, crisp and so bright. I have taken wedding photos and get some great close up shots with the zoom, so much so the bride and groom are usually amazed with the quality and how great the Zoom works. Because if how amazed people usually are with the shots, I have started to give photos on a CD as a wedding gift, and guess what, it is a hit, everyone loves it, and I at times capture what the photographer that they hired missed. Also with this little beast of a camera, persons have asked me to take photos and they will pay me, yes for this 2 MP camera. Macros work great for the close ups and the flash is excellent. If you buy this camera, you will be quickly amazed at how great it is and is worth every penny.", "Date": "October 11, 2006"}, {"Title": "Good Camera - except low light and action", "Author": null, "ReviewID": "R2LLJ9LT48K2QF", "Overall": "4.0", "Content": "this is a very very good camera. it's great zoom is very very useful. Voice commenting is also a great feature. Good quality pictures and movies also make this camera great. I will soon get a link and i think the webcam function will great. There is only four problems.1. In low light the screens are black, in general you can guess but it still is annoying2. There is no mode for capturing action, which makes it blurry3. Similar to problem two, the camera has quite a delay before a picture is taken.4. This problem hasn't happened to my camera but it has happened to others, zoom error. It makes me kind of nervous it will happen to mine.In general if you want a cheap camera with good picures, good zoom, and some cool functions this is for you. But if you want to take a lot of action pictures or night pictures check out another camera.", "Date": "June 5, 2006"}, {"Title": "best camera", "Author": "David Mitzner \"camera dave\"", "ReviewID": "R3QHWZ0R3SYCQT", "Overall": "5.0", "Content": "i love this camera it is awsome", "Date": "January 4, 2006"}, {"Title": "Great camera with a great price... but after 3 years another Zoom Error problem", "Author": null, "ReviewID": "R1RS6NN4AKDP5L", "Overall": "5.0", "Content": "I bought this camera after much research and after purchasing(and returning) a few other cameras. This camera takes very good pictures and is very easy to use. It comes with a detailed and easy to understand instruction manual. I would recommend this camera to anyone, especially for first time digital camera buyers. The only bad thing about it is it only came with a 16 MB smart media card, so if you take tons of pics you might need a larger card. I would also recommend rechargeable batteries!!----2004 ReviewI have come back to edit my raving (3 year old) review because, after using for nearly 3 years I also got the dreaded \"zoom error.\" My camera is no longer under warranty so it's just collecting dust on a shelf (I hate to throw it away, it took good pictures, better than the Fuji S3100 I bought to replace it). It did last me 3 years, but I took great care of it and was hoping for several more years of use.---2007 Added info", "Date": "May 2, 2004"}, {"Title": "Very good pix", "Author": "Patrick J. Gilmer", "ReviewID": "R2IS3U5IRRIWEO", "Overall": "4.0", "Content": "I got this camera from DELL as a mistake.  This camera is only 2.0 mega pix and the one they were going to send me is a 4.0 mega pix.  The sent me the new camera, a kodak easy share with 4.0 mega pix...I cannot tell the differance.  ALSO, I find the FinePix easy to use and has a 6x true zoom, unlike the kodak that has a 3x true zoom, then digital up to 10x.  So in other words, buy this one.  I just licked out and got both for the price of one.  One bad thing about the FinePix is that it takes batterys and cannot use other lenses, both suck if you are a camera nut.  The Kodak can take many new lenses and is rechargeable.", "Date": "October 6, 2003"}, {"Title": "No Regrets", "Author": null, "ReviewID": "RHAG5QB9SGTLM", "Overall": "5.0", "Content": "Until now I have always been a die hard Nikon fan, but this Fuji has really impressed me. I get compliments all the time from people who sees the prints it makes, and when I let people borrow my camera, they always like it. I bought this camera when it 1st came out, and paid $400+ for it. Even at that price, I have no regrets whatsoever about purchasing this gem of a camera. It is a perfect size, and takes beautiful pictures. I bought it mostly because it has a through-the-lens viewfinder, but I also enjoy all of the many features I wasn't even expecting. The macro feature is super. My home printer is not great, so when I want really good prints I take my memory card to my local Kit's Camera. The prints I get back are not grainy at all - they look just as good or better than the pics I take with my old Nikon 35mm SLR. It is fully automatic, but also has manual overrides if you want to use them. The auto settings are usually great unless you're doing something artistic. You can even take pics indoors, and they will not look yellow. I take pictures of architectural models indoors, so a colorbalance feature was important for me. VERY easy to use - much easier than most other digital cameras out there. You should also get a battery charger - it will save you money in the long run (only negative point about camera is that it goes through batteries quickly). I also bought a card reader, and it makes transferring the pics to my computer really easy. Card readers go for $20 at any electronics store, and plug into a usb port. I think this camera is worth every penny I paid for it. I reccomend this model to anyone who wants the convenience of a digital and the clarity of a traditional 35mm SLR. No Regrets!", "Date": "July 6, 2003"}, {"Title": "Fuji FinePix 2800 Zoom Digital Camera", "Author": "chad", "ReviewID": "R1LNAB0OYZF4K5", "Overall": "5.0", "Content": "I love this camera!  I recently used it at my sons kindergarten graduation and was the envy of the crowd.  A couple of people inquired as to what type of camera I was using.  I took both still and movie pictures.  My family loved the short films and pics that I was able to quickly send them via email.  This camera makes taking pictures fun again!  Good job Fuji.", "Date": "June 28, 2003"}, {"Title": "great performance for the price!", "Author": "jennifer", "ReviewID": "R1QC0EE7VNJN28", "Overall": "4.0", "Content": "this camera is an excellent choice for either your switch from a SLR or just as your first digital camera.  Its easy to use and has excellent quality.  The 6x optical zoom and digital view finder are great.  the digital view finder allows additional battery life instead of using the battery hungry LCD screen.  mpeg playbacks and sound bites are fantastic.  other cameras with these specs cost so much more.  this is a great buy.  just make sure you pick up some rechargeable batteries and a larger memory card before you start having fun.", "Date": "June 14, 2003"}, {"Title": "Best I can find for this price", "Author": "Jasmine", "ReviewID": "R29RYIB1XWEHQT", "Overall": "5.0", "Content": "I love this small silver camera. It takes pictures with really high quality. I also bought 4 1200ma batteries and a 128m memory card for it (about $80). When I went out for a field trip the batteries lasted for more than 3 days. I took hundreds of pictures. Although I did not take pictures with the highest quality this camera can make (only 1megapixel), they look excellent with bright color. They are very sharp. It is amazing. All I can say is that I made a right choice.", "Date": "June 5, 2003"}, {"Title": "Awesome little camera", "Author": "thezombiereview.com \"CrpnDeth\"", "ReviewID": "R12RQXJRX6E2J6", "Overall": "4.0", "Content": "I have had this camera for about 24 hours, so I hope I am not jumping the gun.  I have put it through all the tests, and this is a very remarkable camera.  Everything is easy to use, pictures are crisp, camera is nice and lightweight, USB connection was a snap (w/XP) and EXTREMELY fast compared to my last digital camera (a very nice surprise).  The reviewer from Arizona was doing something wrong, because I live in AZ as well, and as soon as I read her review I brought the camera out in the sun and the pictures came out awesome.The reason the camera lost one star is because everything they say about low light or night photos is true.  Its the cameras only downfall.  The LCD and the viewfinder become useless.  More than likely, the autofocus won't work either.  If it wasn't for that, this camera would have gotten a 5 star rating.", "Date": "May 10, 2003"}, {"Title": "terrific!!", "Author": "melanie re", "ReviewID": "R275DR8B2CF2TK", "Overall": "5.0", "Content": "We received this camera for a wedding present and it is absolutely wonderful.  The pictures are clear and defined, even in zoom.  It is also quite easy to operate and the size and shape of the camera make it comfortable to hold.  We paired it with a new HP photo printer and the images are equal to or better than that of 35mm.  Really!!", "Date": "May 6, 2003"}, {"Title": "Works for me!!", "Author": "Michelle Wood", "ReviewID": "R10K0SD7LL9DNZ", "Overall": "4.0", "Content": "This camera was my first digital camera purchase.  My decision was between this Fuji and a Kodak that has received good reviews.  I'm glad I went with the Fuji.  I love the way this camera fits in your hand.  I haven't had any of the problems with the lens cap that other reviewers have mentioned.  It's a little quirky in low light coniditions, but I think almost all digital cameras are.  I also really like the video feature - and I actually use it!  Great camera.", "Date": "April 10, 2003"}, {"Title": "Fuji Does It All", "Author": null, "ReviewID": "R2SM094F8FURDM", "Overall": "5.0", "Content": "I am very pleased with all the features this camera offers. Very smart choice indeed. It has great zoom as well as close ups. I was able to take super sharp pictures of honey bees on the flowres. Consider adding more memory and a tripod for ultimate capacity and precision. With some mastering it takes special effect photos too. Go For it.", "Date": "March 26, 2003"}, {"Title": "useless", "Author": "jay", "ReviewID": "R1KKNVRYDIMEEO", "Overall": "2.0", "Content": "This camera is totally useless in low light situations. Only good for outside. It also takes too long to take the picture after you press the button. I took it back and got an Olympus and it is 100% better", "Date": "December 21, 2002"}, {"Title": "Pitfalls - image sequencing, on/off button and lenscap", "Author": "\"swimsportlisa\"", "ReviewID": "R14F9N5NMRFC2O", "Overall": "4.0", "Content": "I love the design of this camera. It fits perfectly in your hands! The interace on it is easy to understand, too - even without reading the manual, and I love the zoom lens capabilities. You can close in on your subject's relatively quickly... I took it out shooting wildlife photos and the images were extremely clear and  professional despite the animal's movements and the overcast sky. I do have three issues with this model, however.1) the placement of the on/off button and the shutter are easily confused. I've often gone to snap the shutter and have turned the camera off altogether!2) the dangling lens cap is annoying. It dangles on a string and you always feel like you're going to lose it somehow since it's not built-in.3) there appears to be no image sequencer on this, so your smartmedia files all have the same id numbers and you can't put two cards on the same file on your computer because you'd be saving over your files.solution? Create new folders each time you download a card of images. When you go to catalog the images, though, the fact that you have multiple images with the same file names (i.e. card 0001.jpg and .0001.jpg is a big pain!) If I've missed something here, and there is a way to do image sequencing on this camera, please email me! I'd love to know how.Thanks!", "Date": "November 23, 2002"}, {"Title": "Great Camara... except for low light situations", "Author": "TechJunkie \"RoB\"", "ReviewID": "RPRFYMYG8CHWZ", "Overall": "4.0", "Content": "I've had this camara for a few months now and it takes great pictures!  Fantastic color.  The 6X zoom lens works fabulous.  The only downfall is it's operation in low light situations.  Your target is difficult if not impossible to seen through the electronic view finder and the flash doesn't always sense that it needs to go off.", "Date": "July 17, 2003"}, {"Title": "Best camera I've ever used!", "Author": "Shane Orchard", "ReviewID": "RT9PVWQ7K9JLO", "Overall": "5.0", "Content": "This camera takes great outdoor photos and beautiful portraits. I recommend this camera to any amature photographer who is looking for a good camera with a low price. HAVE FUN!", "Date": "July 14, 2003"}, {"Title": "A camera for just about all basic needs", "Author": "Amazon Customer", "ReviewID": "R2PUG17BUDP1DF", "Overall": "5.0", "Content": "Well I've taken about 150 pictures now and I am completely impressed. Picture perfect colors and crispness. LCD is hard to see in darker settings. In most settings pictures come out great. Even when zoomed in all the way, pictures are still sharp and clear. Dim flourescent lighting can produce dark pictures but other than that, it's a great camera. Get it if you can find it!", "Date": "May 31, 2003"}, {"Title": "I love this Camera", "Author": null, "ReviewID": "R1HQN70SR6SJZO", "Overall": "5.0", "Content": "I have found this little camera to be a GREAT buy...My pictures are clear and detailed, close ups are\"Fantastic\"........I would highly recommend thisproduct...!!!", "Date": "December 6, 2002"}, {"Title": "av ports", "Author": "chris du plessis", "ReviewID": "RRC7QOSS84EYE", "Overall": "5.0", "Content": "I have just purchased the Fuji 2800 2MP,  which is my first digi camera, and I'm having a whale of a time ,being able to email the shots to all my mates the same minute is really a bonus. The only down fall I can say is that you can't show the pic's via the TV, as is has no AV ports built in which would be positive advantage, so you show them via the usb port on your home computer,and then plug in AV cable from there to your TV, but say you visit someone who in this year 2002 has not got a computer at home, what then!!!easy huddle around the camera, it's cosy", "Date": "August 3, 2002"}, {"Title": "A Big Mistake", "Author": "\"andremellsims\"", "ReviewID": "RQEKI7I09FQWW", "Overall": "1.0", "Content": "After doing a lot of research on the Net, I thought; \"ok the lighting is not good and the display is dark, but a lot of people really liked the camera\", plus Radio Shack has them on sale this week ....  Well I should have taken these reviews more seriously.I bought the Fuji 2800 camera to replace my old trusted Kodak 240 digital camera.  I wanted better zoom and a newer camera with the cool new features.What I got was a camera that did not take low light pictures very well at all and many of my pictures were out of focus.  You might say, well I can live with the low light, I COULD NOT!  I need a camera that produces quality pictures regardless of light.  And my pictures were fuzzy.  NOT good Fuji!  Did you rush this one out the door or what.After calling Fuji's Customer service they told me that I had a defective product and to return it.(Being in denial I thought, maybe I was doing something wrong, because this camera had the zoom I really wanted.) I did not really want to look at another Fuji after that dissappointing ordeal....", "Date": "January 16, 2003"}, {"Title": "What an awsome Camera", "Author": "Hilary A. Price \"hap\"", "ReviewID": "R6D9HMXZ46A63", "Overall": "5.0", "Content": "I was wowed by what this camera can do for the price. It is so easy to use. It is a bit finiky over procedure to download the pictures but that is all that I have found to be hard to deal with. It is so small and light wieght which is good. It takes some great 60sec movies, and the sound that it captures is great. I would recommend that you buy an extra memory card so that you can take lots of pictures. This camera is good for the beginer to the semi advanced. You can definetly grow with this camera. Mac users will love the ease of this camera. The best camera that I found for the price.", "Date": "October 22, 2002"}, {"Title": "Poor Seller", "Author": "David A. Baker \"Artisan\"", "ReviewID": "R2W0BBWQR75FHK", "Overall": "1.0", "Content": "Product recieved non functional with a broken software CD, missing memory card. No response by the marketplace seller. Amazon was outstanding in responding to the problem regardless of sellers poor performance.", "Date": "March 1, 2006"}, {"Title": "No Complaints so far", "Author": "Amazon Customer \"Prasant\"", "ReviewID": "R6RQEH72DY5E9", "Overall": "4.0", "Content": "I have been using this camera putchased from Amazon since early 2003. So far it has not give me any trouble, has been serving me tirelessly. I have taken a few thousand pictures by it, dropped it many times, but the quality has not changed at all, in spite of the fact that I dont take much care of it!A great investment indeed!", "Date": "February 5, 2006"}, {"Title": "Cute Camera!", "Author": null, "ReviewID": "R1DO5AYA3921Z4", "Overall": "4.0", "Content": "This camera is really cute. it has the look of a mini-camera but actually works great! the only bad thing is that there is a short delay between when you press the shutter button and when it actually takes the picture. Also, it needs a lot of extra memory because it only stores 30 pictures with the built in memory. The camera is easy to use and small and has the video feature which is very convienient. I would recommend the camera to beginners and amateurs looking for a cute, fun camera.", "Date": "October 3, 2003"}, {"Title": "JUNK CAMERA BROKE DOWN SAVE YOURSELF FROM TROUBLE", "Author": null, "ReviewID": "RGUWJUOWIKYL4", "Overall": "1.0", "Content": "I bought this camera two years ago for $400. It was taking good pictures except those issues with indoor and pictures at night. Now i suddenly get this zoom error and my camera refuse to retract the lens. I send it to fuji for repair. They want $140 for repair. Camera itself costs 200 now with one year warranty. I think this is junk camera with some cheap parts. don't buy this just, keep yourself away from the hassels.", "Date": "December 29, 2003"}, {"Title": "fatal error", "Author": "katrina", "ReviewID": "R1AHTRPKIYNZMS", "Overall": "1.0", "Content": "Camera worked beautifully until somehow a fatal zoom error occurred.  We can't get the camera to turn on again.  Will not buy Fuji again!", "Date": "May 22, 2005"}, {"Title": "zoom error", "Author": null, "ReviewID": "R3RXSSFS3OCE7B", "Overall": "1.0", "Content": "I had the same trouble another reviewer did.  I was shooting pictures and suddenly zoom error came on and the camera refused to work.  Until this happened I had a favorable review, but now I would say DO NOT BUY!", "Date": "November 23, 2002"}, {"Title": "Flash Card by Simple Tech", "Author": "Norman Roberts", "ReviewID": "R1HGFBTOYQYA7C", "Overall": "3.0", "Content": "The camera works fine other than in low light conditions where the image isn't visible in either the viewfinder or the lcd display. Don't make the mistake I made and buy a FLASH CARD. I thought this would increase the memory and it did not fit this camera. If you want memory purchase a memory card. Since I opened the card package and returned it, I'm sure it will be a costly mistake. If I were to do it all over again I would buy the Fuji 4800 for a few bucks more.", "Date": "November 7, 2002"}, {"Title": "Horrible Quality", "Author": null, "ReviewID": "R199PVUYCZXZPF", "Overall": "2.0", "Content": "Don't get me wrong, this camera takes great pictures. Very good quality even at the lowest setting. As everyone has said, the LCD is useless in low light, as well as the zoom function is akward unless you have rather small hands. BUT, here's the kicker, I have had the camera since Christmas, and today, I get ZOOM ERROR when zooming in to take a pic. I stop, and look at the camera and the lens seems to be crooked.  So I tunr the camera off and when the lens is trying to retract it POPS OFF. I took it to Wolf Camera and they said it will have to be sent to Fuji....I would NOT reccomend this camera if you don't have time and money to hassle with repairs if the camera breaks.", "Date": "January 16, 2002"}, {"Title": "Cheap, Flimsy, Not made to last!!!", "Author": "Heather M. Dunsmoor", "ReviewID": "RK6WS06EX65CD", "Overall": "1.0", "Content": "I had my Fuji Finepix for 6 months before I set it down to answer the phone one day and came back to it a few minutes later and the power would no longer turn on. No problem, I'm thinking - Its under warranty. I took it in for repair and one month later I was told that the camera had had water damage and the motherboard was fried and the warranty was voided and it could not be repaired.First of all, there was no water damage. I had used it outside earlier that day for about three minutes when it had been lightly snowing. A couple of flakes of snow hit this thing and its fried? What a piece of crap! My old digital camera, an Olympus, had had an entire cup of water accidentally spilled on it - to the point where it had water inside the screen for a week, and is STILL working 3 years later.Its OK because I never liked this camera anyway - it was 3 years newer than my Olympus, but was less sensitive to light and took blurry pictures, (even outside in full daylight!) which my Olympus never did. I was always frustrated with it and this gives me the perfect excuse to buy another brand - I'm just very upset that I lost all the money I paid for it 6 months in!", "Date": "January 9, 2004"}, {"Title": "Don't buy this camera", "Author": "L. Payne", "ReviewID": "R2WGQCTJ3TKORW", "Overall": "2.0", "Content": "I picked out this camera quite awhile ago to be my christmas present from my parents. From the get go I disliked the way it handled. It works well, as any camera can with lots of light on still objects. But that is no feat because white balance and lag time are inconsequential with something that has all day. This camera sucked for any type of candid shooting. The time between pressing the button and getting a picture was long enough to ensure that any desired facial expression or pose was either completely altered or not even in the frame. Also, in low levels of light, taking a photo was mere guesswork because the screen would be completely black. For a vast majority of the shots the flash had to be enabled because otherwise the photos would be extremely blurry. The problem however, is that flash makes harsh unnatural ugly color composition photos. Basically I hated it. I bought myself an Olympus Stylus 710 recently and love it dearly. That is a camera that can preform in a variety of differnt situations and lights.", "Date": "July 30, 2006"}, {"Title": "Zoom Error is a major flaw", "Author": "Matthew Temblor \"Temblor\"", "ReviewID": "R2VKJS0913X9BQ", "Overall": "1.0", "Content": "I have had the infamous Zoom Error. This is a major flaw and my camera does not work anymore.Do not think I will buy another fuji for this reason unless the customer service really helps me out. I doubt that will happen based on the other posts.", "Date": "July 19, 2006"}, {"Title": "Terrible vendor", "Author": "David A. Baker \"Artisan\"", "ReviewID": "RM53NHK2HM4DP", "Overall": "1.0", "Content": "Do not buy. Camera never worked shipped with missing and broken parts- vendor is MIA without response. Amazon gets 5 stars for their rapid response and credit card warantee.", "Date": "March 1, 2006"}, {"Title": "No good", "Author": "Jeff Campbell", "ReviewID": "R3B8V0X59M1G", "Overall": "1.0", "Content": "I bought this camera and treated it very well.  After a year and a half of low to moderate use, the lens won't retract.", "Date": "December 19, 2003"}, {"Title": "Not a night camera", "Author": "impitbosshereonlevel2 \"impitbosshereonlevel2\"", "ReviewID": "RK665LJE5OL7H", "Overall": "3.0", "Content": "This camera looks and works great, and for a long time, I had no issues with it whatsoever. The pictures were sharp, and of decent high resolution. Until I took this camera with me to Las Vegas, to take some night pictures. It worked fine when taking close-up night shots with a flash, but when taking long distance pictures, it became practically useless. First, distant images with flash enabled appear dark and blurry. If you disable the flash, images come out nice and colorful. Except they look like someone with Parkinson's disease was holding the camera - the lights are smeared everywhere - even if you stand still as a statue. Now, I know what you're thinking - \"just decrease exposure time\", right? I'd love to do that, if that was an available option.Of the 200 pictures I took, only 2 were useable (and even then, blurry)", "Date": "September 1, 2004"}, {"Title": "2800 camera", "Author": null, "ReviewID": "R3IGRJFXZ0255Q", "Overall": "1.0", "Content": "If it worked I think it would be great", "Date": "July 8, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "2-megapixel sensor captures 1,600 x 1,200 images for prints at sizes up to 8 x 10 inches\n6x optical plus 2.5x digital (15x total) autofocus zoom lens\nIncluded 16 MB Smartmedia card stores 39 images at default resolution\nAutomatically connects with Macs and PCs via USB port\nUses 4 AA batteries (alkalines included)", "Name": "Fujifilm FinePix 2800 2MP Digital Camera w/ 6x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51JXFPT36YL._SX300_.jpg", "ProductID": "B00005QI59"}}