{"Reviews": [{"Title": "Among the elite digital cameras in the market right now.", "Author": "A Customer", "ReviewID": "R204R6QP655TL", "Overall": "5.0", "Content": "After a long month of researching cameras, I finally decided to buy this one. If you are seriously considering this camera, look around for prices, as they vary greatly from one place to the other. First of all, while this isn't a true 4.3MP camera, I think it outperforms 3.3 and 3.1MP hands down. THe resolution, color warmths, color accuracy and sharpness is amazing for a camera of this size...or for any digital camera any size. I have had this camera for a month now and I have never been so proud of an electronics purchase...of course I love my Mac too! Here is a list of PROS and CONS:Pros - The retraction of the lens which gets covered by a metal door is excellent. - The flash works surprisingly well. I used the camera in Times Square in New York (for those who don't know where Times Square is), and the faces came out with a good amount of light, while the backround lights of Times Square came out very nicely also. This camera takes VERY impressive night shots. I think it does better when it is set to AUTO than when it is set to NIGHT mode, although you can create some pretty funky shutter delay shots and play with lights and colors. - The Movie mode is great! Sure, it is not broadcast quality, but what did you expect. I think it takes better movies than the Sony Mavicas. - The USB connection is great. The smart media compartment works well too. - YES! You can set a timer to take pics..up to five seconds I think. - Looks like it came from the Matrix - Want flash? Pop it up. Don't want flash, pop it down. It is the easy.No buttons to press, no setting to set. - Many ISO to choose from, as well as Macro - TOP .JPG resolution is great. Don't be fooled that it doesn't save in .tif formats, the pictures are great! And saves space! - Comes with 16MB card, not 8MB like most of the other guys.CONS - The LCD display is difficult to see in bright sunlight, but at least you can use the viewfinder, unlike the Sony Mavica. - The camera KILLS alkalines, even the ultra alkalines. Don't be stupid. Use the NiHM, 4 are included with the camera, but I suggest going to Radio Shack and buying a quick charge charger. It'll same you lots of money and time, as the included charger takes 12 hours, and only holds 2 batteries. - I would've liked to see Fuji use the IBM Microdrive in this unit. With soo many memory hungry applications in this camera (movie capture with sound, high resolution images), even the 64MB card which I bought wasn't enough for a weekend with buddies in NYC.Conclusion: I showed the images of the trip to my boss, who is a hardcore Sony maniac. He was soo stunned by the quality and features, and price and size of the camera that he bought one for himself! You can't go wrong with this camera. I love it! And so do the editor's of Popular Photography magazine, who recently gave this model its highest review about it's color accuracy.", "Date": "December 5, 2000"}, {"Title": "Easy Small and Fast", "Author": null, "ReviewID": "RYDWTCB02H379", "Overall": "5.0", "Content": "* Just about every type of control (short of manual exposure) that you could wish for.  The controls are logical and easy to use.  Common  adjustments don't require powering up the LCD * The camera is light and  small enough for a shirt pocket, yet feels very solidly made with its  aluminum magnesium case. * The camera is very fast - no noticable delays  after turn on or after a shot before you can snap the next picture. * No  special expensive batteries needed - just 2 rechargable AA NiMH, NiCd, or  in a pinch standard alkalines * Motion JPEG (Quicktime or with the right  codec AVI) movies - you can shoot about 1 1/2 minutes of 230x240 video and  sound with the included 16MB smart media card (6 mins with the 64MB).  Perfect for sending to grandparents. * very fast and easy picture transfer  and management with USBI'm very pleased with the quality of pictures.  There are a couple of more expensive 2.4 MegaPixel class cameras that have  better lenses, but they have poorer colors than the Fuji.  The Fuji gives  nice bright warm colors that give very nice flesh tones - not cold blue  like many other digital cameras.", "Date": "August 9, 2000"}, {"Title": "A Good, Basic Camera", "Author": "A Customer", "ReviewID": "R269CHU73VELG8", "Overall": "4.0", "Content": "I bought this after using a Sony Mavica for about six months.  I loved the Mavica, but wanted better quality images.  This camera has filled that bill very well.Is it perfect?  No, I believe Fuji could have done some things better.  I get error messages from my PC when I use the USB port to  transfer images to my computer, but the images do seem to come across  without error.  When I use the viewfinder, I see only about 75% of the  image that's photographed.  That is, the viewfinder trims off a pretty good  sized border.  Some have referred to this as a 4.7 meg camera.  Perhaps so,  but the quality is about the same as a 2.5 meg camera.The camera is  small.  For someone with big hands, such as me, this took some adjusting  to.  Once I adapted, the controls became easy to use.Photos are stored  in jpeg format, so there's some loss of quality in the image, but I take  all my shots in fine mode, and haven't noticed any problems.  I've not seen  any of the jaggies that I'd occasionally see in the Mavica images.All  images are taken and stored in color.  I wish the camera had a B&W  mode, just to save on disk space when I'm working on that kind of  image.Even so, it does quite a good job, in my opinion. This  is a basic camera.  You won't be able to connect lenses or filters to it.  About the only thing that you'll wish to buy afterward is some additional  memory and perhaps a carrying case.  I suspect that, for most buyers, this  camera will take care of all of their needs.  Others may use it for a  while, and then decide to go on to bigger and better things.  I sold my  Mavica FD-83 when I bought this camera.  I'll probably keep this one when I  move on to a bigger and better product.", "Date": "July 6, 2000"}, {"Title": "Tiny camera performs like a champ!", "Author": "Sean Kelly \"Consultant\"", "ReviewID": "R3BOA4LOXSU7PJ", "Overall": "5.0", "Content": "It's hard to imagine that such a tiny little camera can take brilliant 2400 by 1800 full color digital images, yet it does so extremely well!I bought my Fujifilm FinePix 4700 mostly for my impending baby.  As a simple,  point-and-shoot digital camera, it fits the bill perfectly.  A fully  automatic mode with a preview screen lets you compose great-looking shots  quickly.  Despite the camera's size, its zoom lens pops out to a 108mm (3x)  view.  (And you can digital zoom at lower resolutions.)  There's even a  popup flash on top.If you want a more controlled shot than the fully  automatic mode or the preprogrammed portrait, night scene, or scenery  modes, you can go to a fully manual mode, enabling you to adjust ISO  \"film\" sensitivity, metering, exposure value, white balance,  macro mode, and even manual focus.Depending on how much memory you've  put in (it uses Compact Flash cards), you can even take a minute long or so  JPEG movie, complete with sound.  A tiny built-in speaker lets you watch  and hear the movie you just took on the camera itself.By plugging a  computer's USB cable into the camera, you can transfer pictures and movies  out of it at high speed.  The camera includes Adobe PhotoDeluxe Home  edition for editing.  Or you can view your masterworks on a TV screen using  the A/V output port and cable that comes in the box.What really  impresses me is how Fujifilm fit all these features into such a small  package.  The camera's light and fits into the palm of my hand just right.  Holding the camera takes a little getting used to, and you do have to be  careful not to cover the autofocus transducer-thingamajig.  But it's not  uncomfortable at all.When turning the camera off, the lens retreats into  the body of the unit and a metal cover slides into place, protecting it  quite effectively.The only major drawback is the battery usage.  It's  quite easy to burn through its two AA-sized rechargeable NiMH batteries  before you've even filled up a 32MB flash card.  Leaving the LCD display  screen off and using the viewfinder instead definitely helps prolong  battery life.  The box luckily includes four such batteries (plus a  charger), so you can carry a spare set with you, or recharge two batteries  while using the other two.Overall, I'm blown away at how far  miniaturization technology has progressed.  The features and performance of  the camera are great---but to have all that in such a tiny box is  absolutely amazing.", "Date": "June 21, 2000"}, {"Title": "Beautiful picture quality, easy to use, compact, and sleek", "Author": null, "ReviewID": "R99D9I5QUTZ05", "Overall": "5.0", "Content": "I understood from the get-go that this wasn't a 4 megapixel camera.  I don't plan on printing poster sized photographs and my needs are strictly under the category of \"ambitious amateur,\" therefore this wasn't an issue. The price is very competitive with other mid-range cameras when you consider all of the features and the rich quality of its images.  I appreciated having the option of capturing short videos with sound.  Moreoever, for someone who hates to read instruction manuals, I found that the manual was easy to reference and that the onboard menu was very, very intuitive.I would order a 64 MB SmartMedia card and an high speed NIMH battery charger if you intend to maximize your use of the camera, especially if you like making short video clips and/or using the LCD screen.The pictures printed beautifully on my Epson 880 and I am very happy with my purchase.  I have yet to try to connect it to my television for viewing or perhaps transfering to video format a short clip, but its a nice option to have if you're into that sort of thing.", "Date": "February 23, 2001"}, {"Title": "Digital photography is really here now!", "Author": "J. Fraser", "ReviewID": "R28JV5CCD02AGO", "Overall": "5.0", "Content": "If you are looking for a quality digital camera that can replace replace a 35MM at less the $1000.00, you found it. The picture quality is just fantastic, it is very easy to use, is loaded with features and the USB and  smartmedia storage disks make it painless for photo storage and transfer. I  was looking for a 2+ mega pixel camera (this unit is 4.7!) that was small  in size (about 1 1/4in think and could fit in my pocket), had USB and  smartmedia disk storage, a 2\" LCD screen, a optical view finder, an optical  zoom lens for less then $1000.00.  This is one impressive camera. I have  been experimenting with it for about a week now and have tested all its  many modes. The ONLY weakness where a high end 35mm can out shine this unit  is in very high-speed action. I was not able to adjust the shutter speed to  freeze the blades of a spinning fan, I could do this w/ my 35mm. BUT IN  EVERY OTHER CATEGORY I think this unit is easier to use and produces as  good if not better then most 35mm. I am not kidding.  A few notes:  Batteries last a lot longer then other dig cameras I have seen due to power  saving features,  The optical zoom is nice (3:1) It has a night mode that  takes great night shots. It has a nice macro mode (for close up photgraphy)  A portrait mode that has great skintones. A landscape mode that config's  the unit to take great outdoor very sharp images of scenery.  Built in  flash autotimer and alot more! Short movie capability w/sound! It is a  small AVI format movie (only 320X200) but it is great for a short clip to  email to a friend. It very easy to use. It has easy to use software for  your PC.2 LCD panels, a 2\" one for photo viewing and a circular one  for camera operation.Modes of operation. There are 3, fine normal and  basic. Use normal for just about everything, except a special shot that you  know you plan to blow up then go to fine. The normal mode is nearly as  clear and sharp as the fine except when enlarged. In a 4X6 test series I  took no one could tell the difference between the 3 pictures. The Default  is set at 2400X1800 \"file size\" (2400x1800, 1280X960, and 640X480 are the  choices (IMO use 2400x1800) and quality set to normal. This is the best  choice IMO (normal w 2400X1800 file size) for most if not all shots. In  this mode you can store 77 photos on a 64MB disk! (19 on the 16 MB) (In  basic mode from 180-996 images on a 64mb disk) Transfering the photos to  your computer is a snap. When you plug in the USB cable to you camera the  software fires up and you see the pics. Click and drag to where you want  them. I also bought the Snadisk smartmeadia reader so I don't have to use  the camera to transfer them. (Looks like a mouse with a 2 in slit in it)  These smart media storage cards are the way to go..the y are about the size  of a large postage stamp and about that thick too and hold 64 MB. I can't  say how pleased I am with this product. I think this is the first real step  in consumer digital cameras that will rival any 35mm out there.  To date I  have been printing them on my HpR80 office jet (an ink jet) w/ suprisingly  good results. My next purchace will be a dedicated dye sub photo printer.  But the inkjet does a great job. Viewing the photos on the computer screen  or on a big screen TV is a blast.  Go digital, it is the way to go... it  really is quite good now and reasonably priced.Good luck to you. Jim", "Date": "June 23, 2000"}, {"Title": "Fuji FinePix 4700 vs. Canon Elph", "Author": "Erwin Grellmann", "ReviewID": "R23DRC7VRH0UCI", "Overall": "4.0", "Content": "The FujiFilm FinePix 4700 zoom is my second FujiFilm digital camera.  I took a close look at the new small and cute Canon Elph.  But the Elph gives up some important features for the same price.  Make no mistake, this is a fine camera and I am awed by the flexible features packed into such a small size.  Here are some features that I have have found invaluable:PROS o The Photograph Mode Dial feature is one step up from a fully auto point and shoot camera.  I am very impressed by the Portrait, Landscape and especially the Night Scene modes.  They are optimized settings and take exceptional pictures under those conditions. I found it easy to twist the dial, shoot, then compare results taken in different modes.  Dramatic.  For me this is the single most useful feature of this camera, its implementation is easy and effective.o Generally, for film speeds of ISO 100 you have to keep the camera very still for sharp pictures.  So a faster film speed as this FinePix camera has is a big advantage. This camera has a base film speed of ISO 200 and settable up to ISO 800. (Canon is ISO 100)o Get as large a LCD display as possible.  This one has a 2 inch screen (vs. 1.5 for Canon).  If you use the LCD for framing a shot or to review a shot taken, a nice large screen is worth the extra size in a the camera.o Stay away from unique batteries.  More than once I have wanted to take that \"must have picture\" only to have forgotten my spare batteries in the car, or to find that they were dead.  AA size batteries can be found anywhere, even if you have to take a flashlight appart to get that important shot.  These NiH batteries are 1/10 the cost of Canon's Li batteries.I have owned the FinePix 4700 for one month now.  The FinePix is much more efficient in battery use compared to the older FujiFilm DX-10.  FinPix uses 2 batteries vs. the 4 in the DX-10, and lasts just as long.  This makes it possible for the camera to be lighter by 2 batteries.o The 3X zoom is very nice.  Canon has only 2x (although in Japan I have now seen an Elph with 3x zoom).oSmartMedia seems to be more available and prices are coming down.  If you haven't already discovered, SmartMedia with a PCMCIA adapter is the perfect replacement for floppy discs, especially if you own a notebook computer.CONS oThe viewfinder is small, especially if you wear glasses.  Using the veiwfinder does save on battery power, so hopefully FujiFilm will address this in the next model.  Then I will give it 5 stars.o After one month of heavy use, the Auto Focus does not work and the camera is broken.  I have been unable to get through the busy phone lines at Fuji Film in Edison NJ.  At the moment I have given up trying to get through.  Fortuantely, I live in Japan where service is still first class and the local Fuji dealer accepted my camera for warranty repair.  It will take a month ;-(  Take notice Fuji Photo Film America!  Answer your phone lines and voice messages!", "Date": "May 19, 2001"}, {"Title": "Exceptional Digital Camera", "Author": "Rick Ervin", "ReviewID": "R2DWHO6ZZ489I9", "Overall": "5.0", "Content": "Bought this camera while on vacation in New Orleans.  Added the 64MB SmartMedia Card, and am very happy with it.  Colors are extremely rich and vibrant.  Uploading is a snap using the USB cable.  I don't recommend using AA Alkaline Batteries, as you'll go through them pretty fast.  Get an extra set of the 1600mAh Nickel Metal Hydrides and you'll be set.", "Date": "September 25, 2000"}, {"Title": "Look No Further than the Fuji 4700 Finepix", "Author": null, "ReviewID": "R2D04DSH7K6GON", "Overall": "5.0", "Content": "In short...you HAVE to buy this camera.  I spent a week researching and  visiting my local electronic stores comparing, testing and looking up  reviews.  I recommend going to [...] and read the 50+ user reviews  there.  No other camera has these benefits at this price: Excellent  battery life, USB ports, fast shutter speed, sleek and compact, excellent  color and quality, 80 seconds of movie making time (w/sound), LCD screen,  ZOOM and many other bells and whistles.I did not buy this camera at the  local stores ($800+) or at Amazon ($750).  I bought from a dealer online  for $645 total (s/h $20 product was $625).  If you don't mind paying the  extra, Amazon is a very reputable dealer.  Hope this helps and POWER to the  consumer!", "Date": "August 14, 2000"}, {"Title": "A Few Problems", "Author": "Benjamin Fenster", "ReviewID": "R3MYOZ1S0EN1LO", "Overall": "2.0", "Content": "I had a few problems (some more important than others) after purchasing this camera, which lead me to eventually return it.  CONS* I had trouble getting the auto-focus to work properly.  Since nobody else has mentioned this, it could have been a problem with my specific unit, or even user error.  Still, only one in five pictuers I took came out clear.* The overall controls seem awkward.  The zoom control (up and down arrows) is difficult to use while looking through the viewfinder.  To grip the camera properly, I found my fingers occasionally in the way of the lens.  * The USB software did not function as well as some others.  The contents of the camera's SmartMedia card are represented as a removable disk (with a letter) under Windows.  However, it denies any modification access.  You can view your pictures, but you can only delete them from the camera itself.* Interpolated images.  I was disappointed to learn, even before I bought the camera, that the high advertised resolution is NOT the real resolution of the pictures.  The resolution is still fairly high, but don't use the advertised numbers as your guide to making the purchase.PROSThe reasons I chose this camera originally withstand the points against it.* The LCD screen can easily be switched on and off with a single button to save battery life.* AA NiMH batteries.  No super-expensive unique battery that can only be bought from the manufactuer.  Regular alkeline AA batteries will work (though they die VERY quickly), and NiMH AAs are cheap.* Very compact.  This camera fits easily into a jacket pocket. Once the lens retracts, and the cover flips shut (which is fun if nothing else), the body has no obstructions and the lens is out of harm's way.* Overall ease of use.  While the bells and whistles may be lacking (no Black & White mode, etc), they aren't necessary anyway -- those things can always be done with software later.  This lack of superfluous options makes the menus easy to navigate, and adjustments easy to make.* No games with the flash.  Turning off the flash on some cameras means hitting a button to cycle through ten different settings before \"Off\" finally appears.  Here, it's much more obvious.  If the flash is open, it's on.  If it's closed, it's not.", "Date": "March 18, 2001"}, {"Title": "Good stuff, but save some money for accessories", "Author": "Nepenthe", "ReviewID": "R1RPPW75DPDZTX", "Overall": "4.0", "Content": "Overall I am delighted with the functionality and form factor of this camera, in spite of a few weaknesses. The weaknesses are: 1) It eats batteries. The first accessory I bought was a MAHA MH-C204F home/car charge and two sets of 1600mAh batteries. The second was the AC adapter for use while dumping the pix to the computer. 2) There is significant barrel distortion on wide angle shots. This is widely reported, but should not be considered a show stopper. 3)The AVI files generated in movie mode appear to be non-standard. After installing the Fuji S/W to my machine, Windows Media Player handled these just fine. When sent to relatives (who didn't have the Fuji software), WMP could not play the video and provided only sound. I don't regret my purchase for a minute, and would highly recommend this camera.", "Date": "January 20, 2001"}, {"Title": "Great Camera! -just dont get caught without your Ni-MH bat.!", "Author": "Jeffrey Wright", "ReviewID": "R9C2OI3UER8C6", "Overall": "5.0", "Content": "I reviewed the spec's on this and other cameras for about a month before making my decision.  My biggest concern was support under NT 2000.  None of the product info or reviews mentioned support for the NT OS, but it works like a champ.  NT2000 usb drivers were even included in on the cdrom!  I had the camera up and running in <5min and was transferring outstanding pictures to my NT2000 laptop in <10min.  A brief reading of the manual unlocked all of the camera's secrets.  The camera provides for control over both pixel count (640x480 to 2400x1800) and image quality (basic-normal-fine).  With the included 16MB chip you get ~49 images at 1200x960 using normal quality -which look great!  However, image count drops to 8 at highest settings.  Definitely thinking about a 32 or 64 MB chip.  Red-eye reduction flash is a little sketchy, still some residual effect.  Only real disappointment is poor battery life when using alkaline batteries -REALLY BAD.. I barely was able to run the set up and have enough power for 4 or 5 flash pictures.  Good thing they included 2 sets of Ni-MH batteries (80-230 shots depending on flash and LCD usage).  My 'old' camera is a Nikon 35mm FM2 and although you could argue that it's comparing apples and oranges, I have no regrets over transitioning to this Fuji digital!", "Date": "November 28, 2000"}, {"Title": "It's small, great pictures, and did I mention it's small", "Author": "Ken Kaplan", "ReviewID": "RZSRNSX6BT6WO", "Overall": "5.0", "Content": "This camera is small and light.  It takes great pictures.  Both the clarity is great and the color is vibrant and on the mark.  As a bonus it takes Quicktime movies that you can send over the net if the receiver has a fast connection.  Talking about fast, the download from the USB connection is speedy.  Plus there is little delay after taking the picture until the picture is downloaded and the camera is ready to shoot again.  The camera comes with two sets of rechargeable batteries and the recharger.  Very nice.  But for me, other than the quality of the pictures, I love the size.  I bought the camera for the family, and I don't want to lug a bulky Nikon, so this fits the bill.The only problems that I have experienced are due to the size.  The optical viewfinder is small.  The flash needs to be popped up manually even in auto mode.  That really annoys me since my wife continues to forget to pop up the flash and we get dark pictures.  Hey Fuji, auto should mean auto on the flash too.  Also, you got to watch how your right hand grabs the camera so that you don't cover the auto focus or light reader eye.Obviously, with five stars I am very happy with the camera.  If your not getting good pictures don't blame the camera.", "Date": "October 13, 2000"}, {"Title": "Watch out for this feature", "Author": "Des van Schalkwyk", "ReviewID": "R1A4M0WAAZLJPZ", "Overall": "5.0", "Content": "This camera has an 80 sec Video feature in JPEG format. That means you can  play the video back on your PC. However, to play it back on your TV, make  sure you buy the camera with the right format. In the USA the TV format is  NTSC, whilst the rest of the world uses the PAL format. Look on the side of  the packaging for the correct format when you buy, as it in not indicated  on the camera itself.", "Date": "September 8, 2000"}, {"Title": "Small Camera - Big problems", "Author": null, "ReviewID": "R1EL32UH86ZGIE", "Overall": "2.0", "Content": "This camera is amazing, great pictures, convenient size.  However, the lens cover has a tendency to get jammed and the lens will not come out leaving the camera inoperable.  I have three friends who have this camera and have run into the exact same problem.", "Date": "May 10, 2001"}, {"Title": "Great camera", "Author": "Jeff", "ReviewID": "R324IBBAWOGZ36", "Overall": "5.0", "Content": "I did alot of research before buying this camera. I was looking for a camera that had three specific qualities. 1)Easy to use for the beginner. 2) Produce quality 8' x 10\" photos. 3) Movie mode. This little Fuji fits the bill in all three categories and on top of that the price is very reasonable compared to other cameras and I definitely like its distinct, compact look. To me, it has an oldtime European look to it. This camera produces very high quality photos using its highest setting. I would prefer a stronger flash for indoor shots but for outdoor shots its perfect. The colors on outdoor shots are just amazing. This little camera only uses (2) AA batteries instead of the typical 4. The batteries do last surprisingly long. I was able to click off 36 high resolution shots with flash and LCD screen on and power lasted over an hour. The batteries that come with it are excellent at 1600 mah. I also picked up some rechargeable Monster Cable AA's from 800.com, they are 1800mah and are very long lasting. NOTE: I couldnt wait to for the batteries to charge when i got the camera so I used some duracells. I went through a 4 pack in 10 minutes. Only use these batteries in dire emergency situations. They are not meant to be used for digital camera no matter how much they claim to be. At first the controls on this camera seem complex, but once you actually get into using it you find out how logical the placement of the controls are. Just spend one hour with the manual and camera and you will be an expert on this camera. Also, you can hook this camera up to your TV and play the movie back and do a slide show of all the pictures. I did this for family members at a get together, took orders of who wanted which picture and then printed them out so they would have instant photos of only the ones they wanted. Big WOW factor there! I am sure there are better digital cameras out there, but if you are looking for the criteria that I listed and want get it at a great price this is the one.", "Date": "September 19, 2001"}, {"Title": "Pro review", "Author": "Jim Whitley \"info@jimwww.com\"", "ReviewID": "R287YIR97JVFU4", "Overall": "5.0", "Content": "Well I have just bought this camera and find it fascinating..It is so small yet create great pictures. I originally wanted a small pocket digital that is capable of imitating film and I believe I have found the best 'right now' at it. This camera is the size of a pack of cigarettes. Ok OK yes I like the size.  Features I like... Lens cap built in, Lens quality, incredibly easy software transfer (mind you I use Thumbsplus for viewing and Explorer for copying and pasting to my hard drive), Logical controls, USB interface, Recycle time is incredible .2sec, Image quality. I have made 5x7's and 8x10's out of files downloaded and printed out at a pro lab. Excellent but do not make prints over 8x10's...you may not like them.", "Date": "December 30, 2000"}, {"Title": "FinePix 4700 Experience", "Author": "C. W. Ellis \"C. W. Ellis\"", "ReviewID": "RFQ4E9DB8206R", "Overall": "4.0", "Content": "Takes excellent pictures.  Would prefer more extreme close-up capability.  About 18 inches is as close as you can get.  Detail in high resolution mode is incredible.  Always sharp pictures except in closest close up mode.  NO warning indicator when you have gotten too close on close-ups.  So they end up  fuzzy.But, no worries - just erase it and do it over.Controls can be easily bumped to the wrong setting without  realizing it.  Would like to have external flash hot shoe or socket.Need to get at least the 32Mb smartmedia to keep from constantly swapping out memory when taking very many pictures.", "Date": "May 2, 2001"}, {"Title": "Quite Satisfied", "Author": "Graham Bruce O-Field", "ReviewID": "RL9UY4JT7SQ4B", "Overall": "4.0", "Content": "The FinePix 4700 offers an excellent combination of: - convenient size (handy leather pouch fits on the belt) - high resolution (3 different resolutions and sizes) - easy interface to computer with the USB - good performance under difficult lighting etcIt gets 4 stars from me and not 5 stars because: - has no wide angle mode.  Can't take panorama pics.  Quite a pity because the wider angle is especially useful for interior shots.  And the Panorama would also be great to have - more zoom would be useful - a little more closeup would be useful in macro shots.Other points: - don't get fooled by the so-called 4.7mil pixels - this is an extrapolation and represents no real increase in resolution over the approx. 2.3 mil pixels available.  A less deceiving name for the camera would be FinePix 2300. - the leather pouch would be greatly improved if it had a little space to comfortable accept 2 extra batteries, since an extra set should always be on hand when travelling.-  get the larger sized memory card and get an extra one too (fits in the leather pouch nicely).I use my FinePix 4700 to document my work.  It sees almost daily use.  I am very satisfied with the product.  When travelling I have 2 memory cards and can take up to about 50 high resolution photos (which I rarely use), about 300 or so medium resolution photos (which I usually use) and something like 1000 or so low resolution photos (which I rarely use since they are VERY low resolution)  If they could get a wider angle and panorama then it would suit my purposes exactly.  As it is I am nevertheless quite satisfied with my purchase.", "Date": "May 19, 2001"}, {"Title": "easy to use", "Author": null, "ReviewID": "R2XI9S7XQHA0Q", "Overall": "5.0", "Content": "I just opened the box this morning and by the afternoon, I was sending the pictures to my friends and family over the internet.  The camera is extremely easy to use, and so is the software program that comes with it.  The pictures are very clear and sharp, with this type of quality, who need  35mm cameras anymore?", "Date": "June 10, 2000"}, {"Title": "Pleasant Surprise", "Author": "Don Schwirtlich", "ReviewID": "R3RS2OHEKUC9MX", "Overall": "5.0", "Content": "This is a very good camera - I bought it right before a couple of grandkids came along.  My wife has been ambivalent about digitals because she wanted quality shots like she gets from her 35 milimeter camera.  The quality I get from this camera (and I am a picture taking amateur) is at least as good as she gets with her quality 35.  The batteries do a good job compared to my other digital camera.  I would suggest the 64 mg memory card.  With it, you get 38 highest res pictures at a time.  Also, the usb transfer is so much similar that what I had with my old digital.  My son bought the high end Sony (the fd95) and this Fuji takes as good pictures, the difference is that he gets 10x zoom.  I wish I had 10x zoom - but he wishes he had back the $500 more he spent on his camera than I spent on mine.", "Date": "April 21, 2001"}, {"Title": "Great pick", "Author": "ARuslan \"mdljukka\"", "ReviewID": "R3KY3JUVAAK2ZC", "Overall": "5.0", "Content": "I purchased this camera about two weeks ago. It's an awesome camera.  The picture quality is very, very good.  A friend of mine had this camera for about a year, and he recomended it to me.  I've been taking pictures with it around the city and at some clubs, it's great. The movie option is very cool, you can capture up to 80 seconds of the movie.  The nightscene feature is also very cool.  I took some pictures at a club, where the lighting was very low, and if there's light's in the background, or moving light, the picture comes out with a cool trail effect. It also has a manual mode.  The only thing about this camera is that the batteries run out kind of fast, but what can you do it's a high powered device.  So if I was going to go out I'd take an extra set of batteries with me.  This camera takes 2 1450 mah, or 2 1600 mah NI-MH rechargable batteries, it also takes NI-CD batteries.  Monster Cable makes 1800 Mah batteries, but when I called Fuji, they said that those weren't recomended to use with this camera.  You can get a charger set with 4 batteries ...  Also in the manual and on the box it says that this camera accepts up to 64Mb SmartMedia Card, but on here in the accesories it says that you can go up to 128mb, and Viking support center said the same thing. I purchased the 128mb card and it works just fine. At 1280x960 resolution with fine quality I can take 204 pictures, which is more then enought.  I would also recomend getting a SmartMedia Card reader which conects through the USB port.  That way you don't drain the batteries when you're transfering pictures from the card to your computer, and it also works faster.  For the price I'd say that this is the best choice.", "Date": "April 6, 2002"}, {"Title": "I have had no regrets about buying this camera", "Author": "\"isaacforman\"", "ReviewID": "R38MEHZM9YCE2A", "Overall": "5.0", "Content": "I shopped around for my first digital camera (also looking at Canon and Olympus models) with the following primary criteria: ease of portability, quality of images, and ease of use.Firstly, this camera is a great size, making it easy to carry wherever you go. I wanted the freedom to take photos without processing delays and costs, and also the freedom to carry a camera wherever and whenever, and it has certainly been possible with the 4700z. The zoom lens retracts and is automatically covered when you turn off the camera, making a lens cap and/or strap completely unnecessary. The flash also pops down when not in use.The quality of the photos produced by the 4700z is exceptional. You will immediately notice (especially on a nice day outside) the vibrant colours and clarity. I have had success with the macro mode and the optical zoom also (remember not to factor digital zoom into your purchasing decision with *any* camera).The camera is also very easy to use. You can hand the camera to someone, point out a few buttons (mostly zoom and save/discard), and they'll have no problem in taking a great photo.Buy an extra storage card or two (I have 2 32's and the 16 which came with the camera), and take both sets of batteries when you go out for the day. When taking photos at sporting events, try to get closer to the action rather than relying on the zoom - when you zoom, you accentuate player movement, and also your own movement. Also, try using it with a tripod - I've taken some good photos during the day or at night with a tripod.Finally, the two problems I've discovered in 6 months with the camera have done nothing to put me off it. I would happily make the purchase again if given the opportunity. The two problems have been: left-most button around the secondary LCD requires more force to push than the others; and the flash often needs a nudge to pop it up. Both pretty minor issues.", "Date": "July 17, 2001"}, {"Title": "Fuji 4700", "Author": "Leslie Jones \"bonanza66p\"", "ReviewID": "R9CNI6ZXMNZBA", "Overall": "3.0", "Content": "The Fuji has most of the good ergonomics of the earlier model but they have mysteriously changed the battery system. Both the Fuji and the Leica models had an internally chargeable battery which lasted well and was very convenient. The 4700 requires AA batteries-if you use the screen, they will not last long. I've also found frequent and vexing problems with the camera not wanting to accept smartmedia cards it previously used. This is intermitent but annoying enough to warrant testing a card before you rely on it. The camera is a nice weight and produces great pictures but I am not sure that it's a quantum leap over its predecessor.", "Date": "December 19, 2000"}, {"Title": "battery cruncher", "Author": null, "ReviewID": "R2A2WQZ4JG350Z", "Overall": "4.0", "Content": "This is one hell of a camera! But be prepred to have 2 or 3 sets of fully charged batteries on hand, as you can't get through a smart card on a set of 2 batteries. Nor can they be charged in the camera, so the downside is having to travel with lots of (rechargeable) batteries and the charger, and perhaps an extra one for the car. But it's a small bother compared to the pleasure this inexpensive, compact camera gives you, the amateur or pro photographer, with sharp bright pictures that make you feel more talented than you really are!", "Date": "March 4, 2002"}, {"Title": "AWESOME CAMERA/// AWESOME PHOTO QUALITY", "Author": "coopman", "ReviewID": "REUTXTJRVKC5V", "Overall": "5.0", "Content": "purchased camera about two weeks ago and have not been able to put it down, even in 2400x1200 basic my photos are as good as my cannon 35mm. i also reccomend buying a 64mg smartcard. at my setting i can fit 168 pics. i print on the hp 930c printer with hp premium gloss photo paper and only the experts can tell that i developed my own pictures. this camera is head over heals over the fugi 40i. although it does not have an mp3 player, the settings on this camera are professional (portrait, distance, night scenes). do yourself a favor and pick up one of these cameras today. i have tried them all and this is tops.", "Date": "July 15, 2001"}, {"Title": "Absolutely happy ...", "Author": "Alex Robespierre \"rybrcoul1\"", "ReviewID": "R1GMJYNFJ5RZ9W", "Overall": "5.0", "Content": "I have been analog photography enthusiast for over 20 years.  I shoot about 50 rolls of film per year and my regular equipment includes top of the line Nikon's and Canon's cameras and lenses.  So my expectations of picture quality from a digital camera were pretty high before I bought the Fuji 4700.  My decision to buy Fuji was based on high resolution spec of 4.3 Megapixels. I was very pleasantly surprised with Fuji 4700.  Everything I was looking for in terms of camera's feature and capabilities is there and more.  The greatest surprise came however when I printed my first photos.  I have a relatively inexpensive Canon Photo Printer BJC-8200.  Unless you look real close (like 10 inches or closer) the quality of 8x10 prints is virtually indistinguishable from analogs.  I found out that the key to great picture quality is to use high quality glossy paper -- I use the same paper that came with the Canon printer (I think it is made or marketed by Canon).  I had mixed results with other brands although I am sure there must be some brands that are equaly good or even better.  Bottom line, I love Fuji 4700.  It is fun to use and gives great results. If I had to improve one thing it would be the curved handle on the front of the camera--it does not feel 100% comfortable but given everythinhg else, it is a minor inconvenience. I guess Fuji recognized that and fixed it in the 4800 model.", "Date": "June 14, 2001"}, {"Title": "Great piece of kit", "Author": "Ray L", "ReviewID": "R3EN2TDMTOCWI3", "Overall": "5.0", "Content": "Despite paying nearly double the current price because I bought it when it first came out, I still feel I've had excellent value. It's an easy to use, fast, enjoyable piece of kit. Fuji after sales service is also excellent (refreshingly so). I bought a larger memory card (128meg) giving me the capacity for 700 good quality snaps - fantastic on a long holiday. Download time is virtually instant with the USB cable. If I were buying now, I'd look at Fuji's other models first, but you cant go wrong with this one. The only niggle I can think of is that the zoom isnt great. Enjoy.", "Date": "January 3, 2002"}, {"Title": "Nice Camera... where's the website?", "Author": null, "ReviewID": "R3RRC783YJCTTQ", "Overall": "4.0", "Content": "I tried this camera out over the weekend. It's quite handy... the size is really nice, and the lens retracts into the case with a real metal shutter to protect it. The user interface is decent, and the LCD is readable in most conditions. The second \"control\" LCD was a cool design, allowing the user to reuse buttons in both camera and playback modes.I have to agree with others that the image quality is good, but perhaps not to the levels that I've seen with the real 3MP cameras. This is certainly not a true 4MP camera... look at it as a 3MP camera that makes bigger files.I needed to find the manual, since I was borrowing the camera from a friend. I went to fujifilm.com, and was really disappointed with the offering -- I couldn't even find a _mention_ of this camera, let alone drivers/software/manuals! I had much better results on [...] their canadian site. The manual and information on the camera was easy to find there.", "Date": "November 27, 2000"}, {"Title": "Its a great camera!", "Author": null, "ReviewID": "R1NWP54Z4Z6O7Z", "Overall": "4.0", "Content": "I love the fuji finepix 4700 zoom.  It takes great pictures, and is really small, but there are a few weaknesses. 1.No manual focus ring/you have to use buttons/hard 2.No shutter/apurture priority mode 3.A little hard to hold/finger gets in the way of lens 4.Zoom buttons to close to veifinder/fingers get in the way of your eyes 5.No 1600X1200 modeOther than that-this camera has everything- Great resolution 2.4 mp-4.3mp interpolated Great software easy-instant usb-pictures are sent to computer automatically in 3 seconds-thats all! Flash modes Compression modes up to 1/2000 of a second shutter.", "Date": "August 19, 2001"}, {"Title": "Follow up to earlier review", "Author": "Nepenthe", "ReviewID": "R3US9CE9AXQHH7", "Overall": "4.0", "Content": "Earlier I reported that the AVI's were not 100% compatible and that friends I sent them to were not able to play them.I spoke to Fuji tech support tonight and they indicate that you must use Quicktime to view the 4700's AVI files. Not a big problem if you know ahead of time.Still very happy with the camera. With the new ... price, it is really attractive now!", "Date": "March 22, 2001"}, {"Title": "Disapointing", "Author": null, "ReviewID": "RVHBSYFDZWZTM", "Overall": "2.0", "Content": "I bought it becouse it looked good and had good specs, but here is what I found out!* Optics distort streight lines. and make them curved* Pictures during the day are superb, as soon as it becomes twilight the camera can not focus properly and about 50% of the pictures are useless as they are misfocused.* Claims of 4.x Megapixels are marketing ploy as the CCD is 2.4Megapixel* Batery life is OK, I have seen better.", "Date": "December 12, 2001"}, {"Title": "\"Pop\" goes the zoom lens...", "Author": "JM \"bostonjim\"", "ReviewID": "R31519U6LSUXGN", "Overall": "1.0", "Content": "Worked great for 1.5 years.  Then, this weekend, after taking a perfectly sharp picture, the zoom lense (I kid you not) FELL OFF the camera!  Turns out there are 3 tiny little stubs that hold the zoom lens to the camera body.  Somehow, two of those stubs eroded, and my camera now an expensive LCD display unit.  ...So, other than the fact that I'll never buy another Fuji, here is my assessment:When it decides to focus correctly ...you get AWESOME pics.Blue eye reduction worked well, but really ate the (NiMH) batteries.", "Date": "September 17, 2002"}, {"Title": "Well built, but poor digital camera", "Author": "\"adbento\"", "ReviewID": "R2617GS2117A1U", "Overall": "2.0", "Content": "The 4700 Zoom does not come close to its 4+ megapixel rating.  Any photos taken above the 1280x960 (1.2 Megapixels) resolution are extremely grainy and pixilated.  Also, the shutter speed is extremely slow, and if the speed is increased grainy pixilation becomes even more apparent.  The camera drains batteries quickly when the LCD is not used, but when it is on the batteries do not even last an hour.  I have had this camera for a little over two years and it is now almost completely unusable.  Bright colored dots appear throughout the pictures, and the camera shuts off randomly during use.  Granted, these problems did not exist when the camera was new, but the camera should still be reliable after two years of light use.Though it takes terrible pictures and drains the life out of Ni-MH rechargeable batteries rapidly, the camera is well built and has a beautiful LCD.  The metal case feels strong, sturdy, and expensive.  The LCD produces vibrant, colorful images and is among the best I have seen.  The camera's menus are also fairly intuitive.Overall, much better deals can be found in the market than the 4700.", "Date": "April 14, 2003"}, {"Title": "(Excellent)  big bang for the bucks", "Author": "\"mach1000\"", "ReviewID": "R3AZ0DZ5COP1FF", "Overall": "5.0", "Content": "Read the manual and it gets easy as pie to take fantastic photos.  I recomend monster ni-mh batteries at 1800 mh they work great in this very power hungry digital. This is my 2nd digital and it is so much better it is unbelieveable, although I learned alot about light capabilities compared to film with the low res digital. My pics turn out great even on my old lazer printer a photo printer might be better but I am very satisfied with what I got. The high res mode is great very clear and clean, it makes touch ups and special effects a breeze.  Extra mem cards and batteries are a must.  Anyone with any photo experience will find this a dream come true.", "Date": "November 16, 2001"}, {"Title": "My Husband is happy with it.", "Author": "Sharon G Dwyer", "ReviewID": "R2V1P4JIIMLLS9", "Overall": "5.0", "Content": "I bought this camera for my Husband after doing some research here on the net.  I don't know anything about digital camera's so I had to rely on what I read here at amazon.  I made a good choice with the Fuji 4700.  My Husband loves it. He carries it with him all the time since it's so small and compact.  The pictures that he has taken are awesome, and when he prints them out people can't believe it's from a digital camera.  Thanks to amazon for the info. and the good price.", "Date": "June 9, 2001"}, {"Title": "Great Camera", "Author": "WRK", "ReviewID": "R1VN1MSWIEIXT1", "Overall": "5.0", "Content": "This camera is great for all. First and foremost it takes great pictures, the color is second to none. Second, it is as easy to use for the novice as it is to use for the pro. The auto mode works great and the maual mode allows for a lot of adjustments for the pro. The quality is great in any mode. It has three different DPI modes, as well as three different modes within each DPI mode. The small size takes a bit of getting used to though as you tend to think it might be fragile but don't be alarmed as this camera is as tough as they come. I give it 5 stars....", "Date": "November 25, 2000"}, {"Title": "Ok but not fine!", "Author": "C. Segal \"cs74\"", "ReviewID": "R3EOR0WL2L7US5", "Overall": "2.0", "Content": "Have used the Fine Pix for 8-months now.My PERSONAL experience with it:Pluses: Reliable, easy to operate, nice combination of features, small and handy (but see below), battery life: ok for about 25-35 pictures.Minuses: Have to work hard to get sharp pictures - usually I do not succeed; not really  a 'pocket' camera; red-eye reduction never worked with my kids.Overall: If you can get it for $300 it is a good deal, current price of $500+ seems too expansive for what you get.", "Date": "January 1, 2002"}, {"Title": "focus problem", "Author": "V. Wilkins \"Josie\"", "ReviewID": "R2MY1DZYTAWFWV", "Overall": "3.0", "Content": "You can use auto focus or manual focus, however, make sure your subject remains still for either.  The manual focus requires pushing buttons rather than rotating a lens like standard cameras.  It is difficult to do.  The auto focus feature consists of two steps.  You line the subject in the center of the viewfinder and press the shutter button halfway.  It sets the focus and then you can click the button fully to record the image.  The problem I had with it is that by the time the camera \"set\" the focus, my subject (a 10 month old) was in the next room.  Neither focus feature is good for anything more than still photography.", "Date": "June 8, 2001"}, {"Title": "Focus error", "Author": "I. Tschgl", "ReviewID": "R1EFA8RCVIK8W2", "Overall": "1.0", "Content": "My Fuji Finepix4700 has been workink fine for 2 years but now it shows problems with the optical zoom. The error message \"focus error\" is deplayed in the display.", "Date": "November 27, 2004"}, {"Title": "A constant companion", "Author": "Scott Davis", "ReviewID": "R2EV4RTQXJEMEM", "Overall": "5.0", "Content": "This camera takes fabulously clean pictures. They don't look digital. The colors are pretty. Compared with a Kodak, the colors are muted, easier on the eyes. The Kodak looked like a TV screen with the brightness and contrast overdone. I used it for about a year, and it quit. I must admit that I had dropped it hard once, and it had just gone through a mountain approach during a high wind advisory (I take it in my light plane). So, I really can't fault the camera. Turned out it needed a new flash board. Took 5 weeks and [amt] after sending it to Fuji NJ. I don't consider that bad service, and something you should think about before buying an off-brand asian wonder. I doubt any corner camera shop is doing to do much to a digital beyond cleaning.2400x1800 is great for digital zooming later. Or, for printing, but it is impolite for sharing photographs due to the upload time. It has 9 resolution settings. Three for # of pixels and within them three compression settings. I set it on 1280x960 and average compression. This gives me 99 pics on the supplied 32meg card, about 250k per pic, and great picture quality. The only criticism I can think of is that the flash stinks. I like a bounce flash, and this doesn't have the option. Red eye galore. You have to edit it out later. However, anything with a better or external flash is a lot bigger, so choose your tradeoffs.Scott", "Date": "December 30, 2001"}, {"Title": "Not Win95 compatible", "Author": "Me In Scottsdale AZ \"JustMe\"", "ReviewID": "R18AN2OZH1V4VW", "Overall": "3.0", "Content": "My parents bought this camera and had me install the software and show them how to use it. The box for this camera states that it needs Windows 98, (not supported for Windows 95).  The USB drivers that come with the software won't work on Windows 95 (tried it with on an HP pavillion computer). Ended up buying a smartmedia card adapter that allows the card to be read from the floppy drive which works great....Also the camera is a little akward to hold, its not in the shape of a normal camera. and the lens zoom button is not the easiest to use either (it is on the back of the camera). The microphone for the AVI recording is on the left side of the camera, and its pretty easy to accidentally put your hand over it if holding the camera with both hands.The batteries also take a long time to recharge - 13 hours. Fortunately it came with two sets.The initial AVI clips we made didn't look that good when  viewed in quicktime 4.0, but when they played in the windows media player, it looked a lot better.  I didn't have time to figure out why.This camera was chosen for the better low light sensitivity (ISO 800) and the 3x optical zoom.  Otherwise I would have told my parents to get the Nikon S100 which I own (ISO 100 and only 2x optical zoom though).", "Date": "November 14, 2000"}, {"Title": "mechanical problems - good pictures but not great", "Author": null, "ReviewID": "R1EF1XPEZS52OZ", "Overall": "3.0", "Content": "I agree with adbento for the most part.I bought the camera thinking the 4.3 Megapixels would be good for taking photos and then printing them on my large printer (36\").  I got some pretty good shots but many were not that good and none were great.I had the same problem - The batteries are fine - fully charged .I turn on the camera and it works for a shot, then I try a manual shot and I get a \"battery low\" message (symbol).  After a few seconds the camera shuts itself down.  I do not have the LCD preview on.  When I turn the camera back on it shows the battery full symbol and then a minute or so after use, it again dies after the low battery symbol.I believe this is inherent to the product.I am a light user - taking it out to a few get togethers and parties - but always taken very good care of it - cotton cloth wrapped around it and in a snug camera case - no jossling or bumping and hardly any dust or dirt.  I bought 8 NiMH AA for it as it does go through them quickly.I did take some OK movies with it.  Always good for a laugh.Was good for 2 years - now in the shop and soon to be replaced - bye bye $450 ($700 CDN)", "Date": "September 8, 2003"}, {"Title": "when it works", "Author": "S. G. Cummings", "ReviewID": "RZQRI3NGU4NMV", "Overall": "4.0", "Content": "I have had no battery problems and have gotten amazingly great pictures inside and outside....however, it is now in New Jersey being repaired for the second time in 2 1/2 years.  First the lens cover wouldn't retract.  Now it is in because it will only come up \"ERR CARD\" when turned on.  The good news is it is now under the warrenty from the first repair, so no charge this time.  It is a lot of fun when it works.", "Date": "August 15, 2003"}, {"Title": "Great Camera when it Decides to Work", "Author": "M. Varon \"marty\"", "ReviewID": "R1ZC5BFEXRCC4M", "Overall": "3.0", "Content": "I've had the camera for a couple of years now. I sent it back to Fuji when it was under warranty because it had a hard time recognizing the SmartMedia card. They fixed it promptly. Then I sent it to their repair company in California when it decided to turn itself off randomly. They fixed it and it worked for a while. Now it is acting up again.Now I love the results I get from the camera, but I wish it would work when I want it to instead of when it wants to.I'm about to send it in for repair under the warranty from the previous repair. If that doesn't work, I think I'll give up.", "Date": "August 6, 2002"}, {"Title": "New Digital user", "Author": null, "ReviewID": "RD140UBNJ83Q2", "Overall": "5.0", "Content": "As a new user--my cameras were film type and I had my feelings were that digital was not as sharp as I would like.  I have been suprised with the Fuji 4700 as the pictures are as sharp as with my Nikon and print on my inkjet printer in 8by10 format as sharp or sharper than my Nikon.  I am very pleased with the camera and would recommend the Fuji 4700 to anyone thinking about buying a digital camera.", "Date": "June 2, 2001"}, {"Title": "A great camera!  But ...", "Author": "Wayne", "ReviewID": "R2IXO9CAFIIH4L", "Overall": "5.0", "Content": "Rather than saying what I like about this camera, I'll just say the one thing I don't like about it - it creates AVI files for videos which I can play using the EXIF viewer, and also (surprisingly) using netscape on linux, but *not* on many other platforms.  Why not create mpeg movies?  AVI is not a standard format, it's a cruel joke from Microsoft - some files play on one installation of windows but not another and who knows why ... If anybody knows of a avi->mpeg converter that will work with movies created by the Fuji camera (I've tried a few already and none work) please let me know (wayne@icemcfd.com).  Also an email to Fuji seems to have fallen into a black hole...", "Date": "March 22, 2001"}, {"Title": "oldie but goodie", "Author": "Renaldo Azotea \"revrenny\"", "ReviewID": "R7IWCSJPEPOEW", "Overall": "4.0", "Content": "The Fuji Finepix 4700 is a great camera for its age, the picture quality is very good at the high pix setting.The camera is well built ,the video quality is just good, there are better video cameras out there.This camera is built to last and if taken care of will last for several more years.The only Fujifilm FinePix 4700 2.4MP  Digital Camera w/ 3x Optical Zoomproblem is trying to find another smartmedia card,even best Buy doesn't have them.All in all this is a very good camera.", "Date": "December 29, 2008"}, {"Title": "Great camera. But with flaws", "Author": "L. Sudairy \"Alexandra\"", "ReviewID": "RCI4GVYAJW0K7", "Overall": "3.0", "Content": "I had this camera for 2 or 3 years now. I got it as a gift couple of months after it was showcased.  I will rate this camera according to when it was bought and according to the present time 2004.When Bought:  Great picture quality, has many different settings from basic to fine and also different options of resolutions from 640 to 2400. The manual mode is good, it allows you to control white balance, allows for manual zoom, and changing the ISO up to 800.  I mostly take pictures in this mode since the color is more true once you have adjusted these settings.  I think all settings stay saved for the exception of the manual focus which you would have to reactivate everytime you turn the camera on.  The video mode is great in full light yet it gives very low quality vidios if the indoor lighting is not bright.At the Present:I believe there are better cameras out there, yet this camera at its present price might still be attractive. The issue of focus error starting happening to me only after the camera slipped off of my hands once and landed on the ground. Eversince them I get this message everyonce in a while. The biggest disadvantage of this camera in my opinion is the speed of the shutter. It is quite slow.", "Date": "December 15, 2004"}, {"Title": "Great Pictures while on Manual Mode", "Author": null, "ReviewID": "R76DL0CBQ4H8H", "Overall": "4.0", "Content": "When I first bought this camera (2 years ago) I used the 'Auto' and'Portrait' settings. I found myself taking average quality picturesthen proceeded with the manual setting and the whole perspective onthis camera changed, all I can say is WOW.The camera consumes a lot of battery so make sure you are carryinga fast charger and at least 3 sets (2 each) of fresh batteries.I often have problems with the selector changing the picture modefrom auto to manual or portrait without me turning it. I oftenlose shots while previewing them.Would've I buy Fuji again ? Maybe, the competition is a lotbetter than 2 years ago and unbelieveable prices ...", "Date": "December 27, 2003"}, {"Title": "How long can it last?", "Author": "Peter A. Savigny \"silentg\"", "ReviewID": "R8Z4J4LS72R4Q", "Overall": "5.0", "Content": "I bought this camera because my son was just born and I wanted the ability to point, shoot and decide what pics to keep or lose later.  I am now up to 1800 captures and the camera has worked wonderfully.  The video grab is neat (even at half screen size) and the controls couldn't be easier.  I dropped it hard once and it didn't flinch.  The batteries stay charged for days and re-charge quickly.  (Regular AA bateries, however, drain in about 1/2 an hour!)Just recently, the cover has been making a slight grating noise upon retraction.  Can this be the end?  Will warranty cover it?  Am I to be searching for a new camera soon?  For a quick purchase ($337 new) I am thrilled and crossing my fingers.  A fantastic buy so far!", "Date": "September 23, 2003"}, {"Title": "4-star when it works, big zero when it breaks", "Author": null, "ReviewID": "R3MKU3Y1DJKP82", "Overall": "4.0", "Content": "When the camera was working perfectly (included during an extended European vacation last year), it takes high-quality 3+ (actual) megapixel shots, and has a big, bright LCD. Excellent!But like several other reviewers, I've had the \"random shut-off\" problem, which tech support assured me was due to the Kodak NiMH batteries I was using (much higher capacity than those included)After it started shutting off with *any* battery AND leaving the zoom lens extended/exposed, I packed it back to Fuji in N.J. It was returned a few weeks later, but was only correct for a couple of months until the original 1-year warranty expired in April. Back to shopping; but now I have a dozen SmartMedia cards that are unusable in any of the newer digicams. Oh well....", "Date": "July 4, 2003"}, {"Title": "\"Real world\" excellence", "Author": "Daniel J. Zajic", "ReviewID": "R3CYUO3FTNAK0D", "Overall": "5.0", "Content": "This camera cannot be appreciated based on its specifications alone. The intangible qualities are what make this camera an excellent choice for anyone simply wanting great quality pictures from a camera that operates like a film camera, but has all the advantages of a digital camera.- The pictures are excellent (especially the color), although low-light pictures are a little grainier than I would like.- The flash is VERY powerful considering the camera's small size.- Stainless steel body seems very durable, feels solid in your hand- Camera operates very fast: turning on/off, menu navigation, shutter/autofocus delay, flash recharge, switching modes. In my opinion, this is one of the most important features of any digital camera, and most don't have it!- Battery life is excellent! Only 2 AA's easily last for a day of normal use. I usually get at least 2 days out of them. Fuji has really shown their excellence in this area... the power saving features have obviously made a huge difference.Conclusion: If you want a: 3X optical zoom, pocket-sized camera, for everyday use, that works like a film camera (i.e. very easy to use, and fast), feels like a high-quality product (not a cheap plastic toy), you MUST get this camera. You WON'T be dissapointed.WARNING: If you want extensive manual control, DO NOT get this camera. You WILL be dissapointed....", "Date": "May 2, 2002"}, {"Title": "Two thumbs up! (as Siskel and Ebert would have said)...", "Author": "Peter Walter Edgerton \"pedgerton1\"", "ReviewID": "R1TNH62ISWXJBC", "Overall": "5.0", "Content": "I'd used a 35 mm for years, and was resisting  purchasing a digital camera until I found one that could provide the same flexibility and creativity of manual control, as well as the ease of automatic control,  and provide for high-quality blow up prints.  This camera is it, and at the price I paid at Amazon.com, do not feel I  could have made a better choice for the money.  The 3x optical zoom is a breeze, and the digital zoom is icing on the cake. The instructions are clear and concise both for camera operation AND for syncing with a PC and using the software. Whether your version of Windows will find the right driver automatically, or if you have to step in to the gap and do it manually, set up takes minutes, and you're ready to snap, focus, shoot, sync.I recommend it!  ...", "Date": "July 9, 2001"}, {"Title": "Excellent camera", "Author": "Dan Hazony", "ReviewID": "R3EII8MBDHA03F", "Overall": "5.0", "Content": "I had purchased this digital camera around November, 2000, and I am still enjoying every picture I take with it. It fits in my pocket (a big plus), the pictures are easy to download, and the image quality is quite good. The picture quality is great and it is quite easy to get used to. Two friends of mine have the camera and had recommended it to me. I am extremely satisfied with my choice.", "Date": "March 25, 2001"}, {"Title": "Fuji 4700 Zoom review", "Author": null, "ReviewID": "R3RR5BLKYKUBA1", "Overall": "4.0", "Content": "Great camera, I would recommend to anyone.  The price for such a high resolution is unbelievable.  The only thing that could improve on this camera is the Zoom.", "Date": "March 3, 2001"}, {"Title": "Easy to use, Fast, Compact, Excellent Picture Maker", "Author": "Niran P.", "ReviewID": "R1YKV5KYN7K5CL", "Overall": "4.0", "Content": "Yes it is, but why doesn't it come with a leather cover case. I use to be  an owner of a FinePix700 for almost 2 years. It's a great cam, except the  alloy case is easy to seperate cause' the fastener screw is so easy to  loose and missing. That's it. Anyway! This FinePix 4700 is really  developed.", "Date": "September 18, 2000"}, {"Title": "Fujifilm FinePix 4700 2.4MP Digital Camera w/ 3x Optical Zoom", "Author": "Domenic V. Scotto", "ReviewID": "R2WVGVGJV2YQB0", "Overall": "5.0", "Content": "i  favor this model--i have purchased 4-- i  lose or give them  to my children", "Date": "September 12, 2009"}, {"Title": "Fun, reliable , convenient camera!", "Author": null, "ReviewID": "R2O9XRPGLRK5Q3", "Overall": "4.0", "Content": "So far (6 months in) This is simply the best camera I have ever owned. (I also have a digital Canon camcorder/still camera- which I am very unhappy with.) This is EZ to operate.  And if you don't use the screen viewer while taking regular pictures I found that the rechargeable batteries last a very long time! Its small, convenient and EZ to operate.  The pictures are amazing!The short video clip capability is good,however the sound on the video is only marginal.But otherwise a fantastic choice! UNlike Canon FujiFilm delivered as promised, I am a very happy and satisfied customer.  Fuji does Digital well!", "Date": "June 8, 2002"}, {"Title": "Fuji 4700", "Author": "Bill Sartoris", "ReviewID": "R15JTJLJCT6MIG", "Overall": "5.0", "Content": "I bought my Fuji 4700 in 1999. I've have had  about 4 digital cameras and was not really happy with any of them. I debated quiet a while before I spent $$$ for A camera. I finally bought the Fuji. It only took me about 2 days to learn everything the camera could do. The instructions were so simple and explained well enough a 6 yr old could understand them and learn to use the camera.I've had the camera for 2 yrs now and nothing on the market can compare with it. I have A 64MB Memory card in it and can take 996 pictures in the basic mode and 362 pictures in the fine mode. I dare any Professional Developer to print a better 8x10 picture than my fuji takes. I don't think I will ever need a updated camera.", "Date": "December 6, 2001"}, {"Title": "First Digital Camera", "Author": "Boatguy \"chris989\"", "ReviewID": "R10MVTJXO1PKKC", "Overall": "5.0", "Content": "This is my first digital camera, and after several months of research, I could not be more pleased with this purchase.  It is easy to use for a beginner but has enough advanced features that I don't anticipate that the average home / business user would outgrow it quickly.The menus are easy to navigate, even for someone not particularly adept at with the conventional functionalities of a digital camera.  In spite of its small size, it is sturdy and seems pretty durable.Definitely upgrade to a 64MB SmartMedia card and order extra batteries as well.  Battery life is acceptable but they do have a tendency to run down rather quickly (especially if the LCD screen is used a lot.)  The batteries are relatively inexpensive and it's nice that in a pinch, Alkaline AA batteries could be used.To date, I've taken over 200 photographs with the camera.  The performance is good and the cyle times between photographs and for power up are above average for a camera in this price range.  Printed photographs are excellent, even with a relatively low-end color inkjet printer utilizing photo paper.Besides the quality, it is just plain fun to use and generally gets a \"wow.. cool camera\" comment from others.If you are considering a digital camera, this one should be on your short list, especially at the current price.", "Date": "June 20, 2001"}, {"Title": "Just another review", "Author": "mitek", "ReviewID": "R11SD95T4J67MG", "Overall": "5.0", "Content": "I did an extensive research on this camera, and had a chance to experiment with it for quite a while. The final impression is fairly positive, the good sides clearly outweight the weaker ones.Here is the summary.POSITIVE =================================================== * Very small and compact size, small weight (~300 gramm with batteries) * Excellent color representation. Colors are warm and natural. Probably, best color representation of any compact digital camera on the market. * Fast and 100% painless transition of images to computer; there is absolutely no need to by any additional accessories to that end. Camera mounts itself as a removable drive in Windows Explorer as soon as you plug it in, and you just copy the jpeg files. * Flash does not pop up by itself; no need to play \"outsmart the flash\" game. If you need to disable it, just close it up. * Uses smartmedia cards, which is the most compact media to date (less than 1mm thick) * All small features are extremely well thought-out, as always the case with Japanese companies; and yes, it does have a self-timer and tripod mounting screw.NEGATIVE ==================================================== * The main problem of this camera (and I have not seen this in any prior reviews here) is not the lower-than-advertized resolution (which is huge even as it is, at least equivalent to 2.5+ megapixels), but a so-called \"barrel distortion\". This effect is only present when the camera is set at the widest angle (that is, no zoom). Put simply, this means that if you're looking at a vertical wall at the widest angle, and this wall happens to be at the very side of a viewfinder, it will appear as somewhat swallen outside of the picture. All digital cameras are said to have this effect, but when I looked to check it on this camera, I was able to notice it clearly. If you zoom in, it disappears. Again, I was fully aware of this when I bought the camera, yet that did not affect my choice. * Picture quality is somewhat lower than it could be for this pixel count; it is certainly lower than advertised 4.3 megapixels. * no \"black & white\" mode; * monitor drains power quickly. however, keep in mind that it uses only 2 AA batteries instead of 4, as most of other digital cameras do, and maybe that's why this drain is more pronounced.CONCLUSION ================================================== Seems to be one of the best compact cameras on the market to-date. However, if I were a professional photographer, I'd get Fuji professional camera, Fuji Finepix S1 Pro for ... For everything other than professional photography, this camera is excellent.", "Date": "November 21, 2000"}, {"Title": "Perfect state of the art and great technology example", "Author": "Mayank Parmar", "ReviewID": "R1JDALMIFD1FAK", "Overall": "5.0", "Content": "Crisp and high resolution, pocket size, very convenient for A/V hook up to TV and Computer. very good bright resolution at night.little expensive then other competitors. IT'S WORTH MONEY THAT SPEND.", "Date": "June 23, 2000"}, {"Title": "Manufacture Poor Warranty Coverage (Lense got Stuck)", "Author": null, "ReviewID": "R2XJPAYMYO4ZID", "Overall": "1.0", "Content": "Lense on camera have zoom problem, given msg \"focus error\" where it cost camera to stop function, will not retract or focus either with the camera on or off. Lense will not retract into place (stuck). Warranty is cover only if you provide receipt of purchase or fill out the warranty card. Unfortunately, I don't have neither, so there're no warranty for me even though I provided the serial No. on the camera.", "Date": "June 27, 2002"}, {"Title": "More of a Personal Digital Camera", "Author": null, "ReviewID": "R2XBLUK66DZ1NX", "Overall": "4.0", "Content": "If you are a professional photograper or into graphic arts business this digital camera is definitely not for you. This is more of a family use or personal use camera, like when you're going on vacation and you want to take pictures of places and acquaintances (some memories that you want to take home with you kind of thing). You get the resolution that you desire if you read the manual and follow exactly what it tells you to do (experiement and you'd love the results as you go along). I almost gave it a 5 stars but wait, those optional accessories you would need eventually are very hard to find and some are not even available in the market yet. Don't expect too much for that kind of price. If you want the best you should at least spend over 1.5 grand or even higher for a digital camera that suits your taste.", "Date": "September 24, 2000"}, {"Title": "Fuji 4700", "Author": null, "ReviewID": "R2IIE7446DOCP", "Overall": "4.0", "Content": "Nice camera that takes very good pictures. The sensor needs very good lighting to take the best (sharpest) images. The images taken inside with the flash are not as good as the pictures taken with good natural outside lighting.", "Date": "November 16, 2001"}, {"Title": "So far, so good.", "Author": null, "ReviewID": "RCBEEXJ4OPEOW", "Overall": "4.0", "Content": "Just received this camera - along with a bunch of accessories - in the mail.  Started using it this weekend.  It appears to be relatively user-friendly.  There is a lot of technology packed into this little item.  So far I've been taking pictures on medium resolution since I'm trying to learn how to use it.  But so far I'm quite impressed.  Plugged it into our large screen TV and was impressed with the pics.  Next I want to try downloading the pics into my computer at home.", "Date": "March 12, 2001"}, {"Title": "Not really 4.7 Million Pixels", "Author": "Stephen B Furstenau", "ReviewID": "R3C6GAWCPVOIAN", "Overall": "1.0", "Content": "I purchased the camera on the recommendation of the sales person and the fact that it was 4.7 million Pixels.  When you get it home and read the fine print you find that it is only 2.4 million and that they interpolate (read fake) 4.7.  Even here it is listed with the over 3.0 million pixel cameras, when it is clearly not. I took it straight back to the store after reading the fine print.  I will not do business with a company that mis-represents their product.  What else are they covering up?", "Date": "October 12, 2000"}, {"Title": "Fujitastic!", "Author": null, "ReviewID": "R3KN0TA157S7BW", "Overall": "5.0", "Content": "Bought for no messing, straight forward family pics and this little beauty does the trick. The AVI feature is handy for a bit of live action, though the quality of picture and sound can never beat a dedicated movie camera. Buy it if you want a great quality no nonsense digital camera.", "Date": "April 25, 2001"}, {"Title": "quality of camera", "Author": "fonui", "ReviewID": "R2XK6L1SPYCIEU", "Overall": "4.0", "Content": "it's good for use , I impress it so much. You can to try test it.", "Date": "May 1, 2001"}, {"Title": "This camera is great!!!*", "Author": "chris rosser", "ReviewID": "R1AIDN9BIGSFHS", "Overall": "5.0", "Content": "This camera is great.If you whant it you should by it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "February 24, 2001"}, {"Title": "Need Info Review Fuji 4700 Digital Camera", "Author": null, "ReviewID": "R21HR2TTDF75Z1", "Overall": "5.0", "Content": "I am interested in the new Fuji 4700 camera but I want to be sure it has the practiucal self-timer as well as a screw in port to accomodate a tripod... Can any user provide me an answer to these questions?  Thank you", "Date": "July 3, 2000"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Fujifilm FinePix 4700 2.4MP  Digital Camera w/ 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/416EFEE7YZL._SY300_.jpg", "ProductID": "B00004TH2X"}}