{"Reviews": [{"Title": "A good price for a camera that can function in harsh conditions", "Author": "Gary Blankenship", "ReviewID": "R3RSS1IRR7DLIG", "Overall": "3.0", "Content": "If this were a 35mm camera, it would be like the disposable you buy at the drugstore - not a lot of features, but simple to use with an adequate to good quality of photos. Of course, this is not intended to be a disposable camera in that sense, we're talking about quality of image here. Unlike the book of instructions you get with more sophisticated digitals, the VuPoint has its instructions in small type on one double-sided fold-out page. Once you've gone through them, using the camera is pretty instinctive and it's easy to scroll through the menus to change settings. It's strongest feature is its ease of use, particularly when it's in its waterproof case. Push the on/off button and in a few seconds the camera powers up and is ready to shoot stills. Hit the mode button once, and it's in the video mode, ready to shoot clips at 20 fps in the 640 x 480 size or 30 fps in the 320 x 240 size. With a little practice, it's easy to run all the functions while it's in the case. Like many cameras, it can be difficult to compose a shot on the LCD screen in bright sunlight. The biggest downer with the camera is the digital zoom. I expected the loss of resolution with a digital-only zoom, but was surprised at the loss of sharpness. At 8x, the resulting image should still have better than VGA resolution, but even a small image on a computer screen looks blurry - and these were images shot outside on a bright day and presumably with a high shutter speed. The sharpness is visibly dropping off even at only a 2x zoom. Both videos and stills lost sharpness by using the zoom. The VuPoint also offers in-camera interpolation to 8 megapixel and 12 megapixel files. If these make any difference in sharpness or image quality, it eluded my eye. This will not match the performance of more expensive 5 megapixel cameras. I have a much costlier 5 megapixel Panasonic. When it shoots in the highest quality jpeg format, the resulting files are nearly 2 mb in size. With the VuPoint, those files are only about a quarter that size. That means the VuPoint is using more compression, which in turns costs detail. (On the other hand, you can get four times as many images on a memory card.) To use the 35mm analogy again, if you make an 8x10 print from a high-end SLR and one from the drug store disposable, you're going to see a quality difference. Same thing here. The automatic exposure on the camera works well, except it missed some images at maximum zoom. Since I'm unlikely to use the maximum zoom again, that's not a serious concern. When shooting video clips, the auto exposure did a good job adjusting as the camera panned from heavy shadows to extreme brightness. It's main strength is small size and simplicity of use. It will take pictures my Panasonic never will because it will go places I wouldn't dare take the more expensive camera, such as sailing or kayaking on a wet and windy day. It's easy to store the camera in its waterproof case in a pocket or deck storage bag, or the like, and have it handy at an instant - it can live in a rough and tumble environment where unprotected cameras can't. It's a matter of a few seconds to grab the camera, turn it on, shoot a picture or a video clip, turn it off and put it away. I'm not an experienced video person, but I like the video clips it shoots at 640 x 480. Like most still digital cameras, the zoom will not work while used in the video mode, and given the loss of zooming sharpness with this camera, that's a good thing. One small drawback is the waterproof case mutes the sounds when video recording, but you can't have everything. I like that it uses AAA batteries since it will go places where no battery charger will work. With the maximum 2 gig SD card that the camera will accommodate, you can shoot 2 hours and 23 minutes at the 640 x 480 resolution, and a few more minutes at 320 x 240 (where you're shooting at a higher fps rate.) So far, as long as the zoom isn't used, I'm happy with the stills and videos it has taken on a couple short sailing trips. I loaned it to a friend who took it on a 2-day kayaking trip, and his images look good as well. Battery life appears okay. The two batteries that came with the camera didn't last long, but I didn't expect they would. I put in a couple NiMH's and shot several minutes of video and several stills without appreciably impacting the charge level of the batteries. I put alkalines in before loaning it to my friend and he shot several pictures and video clips, and those batteries appear to have 2/3 of their life left. I haven't tried it underwater and don't plan to anytime soon. All I can say is the waterproof case appears well made and with some silicone grease on the O-ring, I wouldn't hesitate to at least try it for snorkeling. Only a couple pictures have been taken with the flash - it appears okay, nothing special. About what you'd expect from a flash rated for a maximum distance of five feet. For the price of the camera and my intended uses, I'm satisfied, except for some mild disappointment over the zoom.", "Date": "October 27, 2007"}, {"Title": "Great for underwater not so great on Terra Firma", "Author": "Morad W. Hassan \"Scuba Guy\"", "ReviewID": "R5GIXRTGTN713", "Overall": "4.0", "Content": "I bought this camera to take to Cozumel with me on a dive trip. This was my first shot at underwater photography and I was looking for something cheap to see if I liked the idea of taking pictures underwater. My first night there I took some practice shots above water and was extremely disappointed with the shots taken so I threw it in my bag so that I could return it when I got back to the US. On my last day that same camera had been staring at me all week so I said what the heck let's give it a try underwater. OH MY GOD THIS THING TOOK GREAT PICTURES FOR THE MONEY!!!! I was on a crazy fast drift dive and almost all my pictures came out great!!! The only ones that came out blurry where due to that fact that we had to have been moving upward of 5 knots at some points on this dive. The color quality for a camera this inexpensive was great and a little photoshopping did wonders to the color. If there were color filters available for this camera the pictures would have looked like they came from a camera costing 20X as much. I whole heartedly recommend using this as a starter underwater camera, with a little practice you will be taking amazing pictures.", "Date": "January 25, 2008"}, {"Title": "Does what it says", "Author": "bblhed \"bblhed\"", "ReviewID": "R1AMPEIKDDUOIP", "Overall": "4.0", "Content": "I was a little worried after reading some of the reviews on this item, but I really needed something that could take a good getting wet and survive. Well, this will do that, and has done that for me.First I want to talk about the picture quality. I found that as long as I don't try to take pictures indoors at night close up the picture is at least as good as my major name brand higher quality camera. I have taken pictures in rain, underwater, outdoors, indoors, in poorly lit places, in full sun and from a boat with no problems. Indoors in poor light with a flash close up was the only set of conditions that produced poor quality pictures for me. I will be using this mostly outdoors in the day time so no problem for me. I have a \"good\" camera for when conditions are ideal for not killing my camera.This camera is small, light, easy to manage, easy to operate and really is waterproof.Under things I could care less about, the video quality is just about acceptable and the audio is OK at best. I only tried this feature out because the camera could do it. My test will probably be the only time I ever use the video mode. If I want a digital video camera I will buy something made for that purpose, and if I decide to shoot video underwater, I would probably strip off the audio anyway.The down side, the camera takes 2AAA batteries, so they run down fast. The batteries that came with the camera from the factory only lasted long enough to take a few test shots. I am now running rechargeable batteries and have taken about 40 photos with no flash and they still are holding the same charge.Another problem I have seen is that the clock appears to get screwed up at midnight for some reason. I have reset the clock in the early AM and it worked fine all day, but it turns into a pumpkin at midnight. I want to use the camera for photoploting so I just have to make sure I reset the clock when I go out for the day, no big deal to me, I do this anyway when I am photoploting.Bottom Line. It works underwater and wet, the batteries last all day for me, the clock will hold time all day once set in the AM. I like it, I use it and it works for what I want to do with it.", "Date": "June 1, 2008"}, {"Title": "Great camera for the money", "Author": "Benjie Contreras", "ReviewID": "R8H30XLWL7BEV", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_38375381embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_38375381refresh_preplay() {\n\ndocument.getElementById(\"cv_38375381chiDiv\").innerHTML = document.getElementById(\"cv_38375381hiddenPre\").innerHTML;\n};\ncv_38375381refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_38375381so;\t   \n\n\nfunction cv_38375381loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_38375381so = new SWFObject(swfLocation, \"cv_38375381AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_38375381so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_38375381so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_38375381so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_38375381so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_38375381so.setAttribute(\"height\", swfHeight);\n          cv_38375381so.setAttribute(\"width\", swfWidth);\n          cv_38375381so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_38375381so.write(\"cv_38375381flashcontent\")) {\n          fp_resizePlayerSpace('cv_38375381', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_38375381';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_38375381', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_38375381loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_38375381\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2OD8I20PB105B\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2OD8I20PB105B\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R8H30XLWL7BEV\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2OD8I20PB105B/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_38375381duration')) {\n      document.getElementById('cv_38375381duration').style.display='none';\n    }\n    cv_38375381loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_38375381loadSwf(movieID, playerVersion) {\n   return _cv_38375381loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_38375381newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_38375381', 0, h);\n}\n\nfunction cv_38375381resetPlayer(w,h,bw,cc) {\n  cv_38375381newHeight(h);\n\n  cv_38375381so.addVariable(\"resetBandwidth\", bw);\n  cv_38375381so.addVariable(\"cacheCode\", cc);\n  cv_38375381so.setAttribute(\"height\", h);\n  cv_38375381so.setAttribute(\"width\", w);\n  cv_38375381so.write(\"cv_38375381flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_38375381RollOverImg = new Image();\ncv_38375381RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81yGNFHzmZS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_38375381preplay = document.getElementById('cv_38375381preplayImageId');\nif (cv_38375381preplay) {\n  cv_38375381preplay.onmouseover = function() {\n    cv_38375381preplay.src = \"http://ecx.images-amazon.com/images/I/81yGNFHzmZS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_38375381preplay.onmouseout = function() {\n    cv_38375381preplay.src = \"http://ecx.images-amazon.com/images/I/81yGNFHzmZS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_38375381preplay.parentNode;\n\n  var cv_38375381currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_38375381currentClick) {\n      return cv_38375381currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:43 MinsThis is a great camera for the money, took it to Coki Beach in St. Thomas. Here I am feeding the fish. Still shots were also good.", "Date": "September 16, 2009"}, {"Title": "Good starter or kid's camera", "Author": "Encarna", "ReviewID": "R9NKIPFADK86Z", "Overall": "3.0", "Content": "Bought this for my six year old as an alternative to the Fisher Price Kid-Tough Digital camera. The price is about the same as the FP toy camera, plus the waterproof and shockproof casing makes it a better deal for an active kid; you can take it kayaking, to the pool, to the lake, and the waterpark! My son loves being able to take his own pictures and download them to his iPhoto library! The picture quality is only fair; but it's still better than the FP toy camera. Also, the ISO speed only goes up to 200, so using the built-in flash is necessary for indoor and low-light photography.", "Date": "October 8, 2007"}, {"Title": "OK for cheap camera", "Author": "EMTP EJ \"EJ\"", "ReviewID": "RUPWHRLZ67TO2", "Overall": "3.0", "Content": "This is exactly like the camera I got that sported the 'Vivitar' brand, as far as I can tell. Please let me know if this is not correct.I wish I could get more excited about this product, but even though it performed well underwater, my photos were lost because I tried to follow the instructions. The instructions told me to go to the format menu, and so I did and zapped my once-in-a-lifetime photos. I otherwise like this camera, I carry it with me everywhere, every day because it is very, very small and light. Any camera (from other brands) that looks like this one, includingINTOVA INWD-IC600 6.0 Megapixel Digital Camera with Waterproof Housing -180FTSVP Acqua DC-1231Bk 12MP Max. Digital Still Camera with waterproof case (2GB High Speed SD Card & Tripod Included) is probably the exact same device so don't be fooled by claims of 12 Megapixels from other cameras.We got it for snorkeling in the Bahamas and did not want to risk any loss or damage to our regular cameras. I am glad we did that. Get some VERY long-life alkaline AAA batteries and a 2GB SD card to go with this product so that you will able to take a lot of photos or videos without having to re-surface.The waterproof case has a lot of buttons on the back so that you can navigate the camera's controls just as well without the case. When the distance switch on the side is on `flower' the focus is at about a foot or less.This is a SMALL camera and is about the size of larger cigarette box. Be careful with reading the instructions and practice with it (a lot) before you get in the water. Please, please read the instructions for the waterproof case before you try and put the camera in it and use it. The latch may not operate the way you expect and you might damage it!You might consider:Vivitar VIVICAM-6200W 6.0 MegaPixel Underwater Camera with 4x Digital Zoom 2.0\" LCD or SeaLife SL 320 Reef Master Mini Digital Camera", "Date": "December 16, 2008"}, {"Title": "So far, so good", "Author": "LARRY E. THOMPSON \"PopTop\"", "ReviewID": "R64O6SWHGQ8KB", "Overall": "5.0", "Content": "I purchased this to replace an older Canon underwater camera (film type). I am very impressed with the quality of the camera.  I've taken a few underwater pictures in the swimming pool as well as a few above water...they look great.  Will give it a real workout next Spring in the Bahamas.  I hightly recommend the new Duracell LiOH AAA rechargable batteries.", "Date": "August 17, 2008"}, {"Title": "Great Underwater Alternative", "Author": "S. Warren", "ReviewID": "RNNR04HYXHSO4", "Overall": "3.0", "Content": "I purchesed this camera to allow me to get some underwater shots.  My usual camera is a prosumer range DSLR so my expectations for a under $100 camera were not high.  For the money, this camera should perform well.  The alternatives are disposable film cameras and they are not good.  My uther alternative is a $600+ underwater shell for my Canon - Too expensive.  For the money, this camera should serve you well.", "Date": "September 30, 2007"}, {"Title": "VuPoint DC-ST531TBLK-VP", "Author": "ilovelucy \"ilovelucy\"", "ReviewID": "R2DNGQRPZ7UIZ1", "Overall": "5.0", "Content": "I was pleased with the whole process of this purchase.  Billing went smoothly.  I received my camera sooner than I was originally told.  The item came well packaged.  We took this camera to the Caribbean to use on snorkeling adventures.  This camera took as good a picture as did a more expensive Olympus camera we also used.  I was pleased with this purchase.", "Date": "November 17, 2008"}, {"Title": "Amazing!!", "Author": "N. Costa", "ReviewID": "R2A7ZQSAWACNO4", "Overall": "5.0", "Content": "I bought this camera for a trip to Cancun.  I wanted to do Scuba Diving and I brought this along.  This camera package is probably the best underwater camera package for under $100.  The pictures came out clear.  The camera also has video capability with sound. Great buy!!", "Date": "September 5, 2008"}, {"Title": "Takes a little practice - then great !", "Author": "Virginia Baker \"Breastfeeding Advocate\"", "ReviewID": "RQWQAD63DQLQ0", "Overall": "2.0", "Content": "I used this on our recent trip to Tahiti and Hawaii .. Takes a little getting used to but then takes great pictures for the price and the fact you are under water !!!", "Date": "April 30, 2008"}, {"Title": "Great Little Camera For the price", "Author": "Gary", "ReviewID": "R2SG11CM2JADDR", "Overall": "5.0", "Content": "This little camera takes great pictures and video. I used it down to around 30feet. I didn't expect much since it cost less then 95.00 with a 2 gig mem card. I was very pleasantly surprised at the great shots it took I am very happy with my purchase and photo quality ...My only issues is that it seems to run thru batteries fairly quickly. I went thru two sets in about 65 minutes but I also took around 200 photos and four 1min videos. The focal point of the camera appears to be set at approximately 2-9 feet anything closer or further away seem to blur. Still for 95.00 it's a deal", "Date": "April 28, 2008"}, {"Title": "Can't be beat for the price.", "Author": "Joseph D. Maccabe", "ReviewID": "R1XWOH0X8SOIML", "Overall": "4.0", "Content": "I bought this camera for snorkeling at the Cayman Islands. I had used a disposable waterproof 35mm before but we know their limits. I was going to try an inexpensive camera with one of those waterproof bags but they don't seem practical and I have seen reviews mentioning leak problems.  Also, by the time I find a camera and a bag I would be up to the price of this underwater camera. Anyway, the camera works great! I used it about a dozen times with no leaks at all. The pictures come out great. Definitely have extra batteries on hand, but what I did was turn off the digital display when I am in the water to conserve the battery. You can't see the display too well anyway so just point and shoot. I used a 1gb card and left the setting on it's highest resolution. For the price you absolutely  cannot do better!", "Date": "April 12, 2008"}, {"Title": "Don't be scared by the low price", "Author": "T. C. Peterson", "ReviewID": "R2ROX7LJ16EKUA", "Overall": "4.0", "Content": "The VuPoint will get you good underwater shots for a tiny investment. I uploaded my shots from my Caribbean trip, and it was lifelike enough that it was like being back in the current, feeling the cool water rippling across my back.Forget about using the display screen -- it's impossible to see in the water. Just point in the general direction and shoot, and you'll probably get something most of the time. The autofocus and exposure worked surprisingly well. With a $12 1 GB 50x card, the response was perfectly adequate. With the housing, you can manipulate every control on the camera. The only time you have to take it out of the housing (a slight pain) is when you're uploading pictures.It came with name-brand alkaline AAAs, and I went through a few dozen shots without having to replace them.I'd stay away from above-water shots, because the color is a bit off.But it's a very good underwater choice. Why spend $100 for a generic underwater housing when you get the camera and housing for less? Why spend $170 for custom-designed housing (i.e., Canon) for a camera that only cost you 300 bucks, or $600 for a serious enthusiast's camera when you're an occasional snorkeler? Why spend $50 more for a \"name brand\" when the shots (from what's been posted) aren't any better quality? Save the money for airfare", "Date": "March 24, 2008"}, {"Title": "SD card maximum", "Author": "Paris Raven \"Paris Raven\"", "ReviewID": "R1SQH5LL8QZ67P", "Overall": "3.0", "Content": "To M. Charthern: as Mr. Blankenship noted and as listed on the camera's specs, the maximum SD card is only \"up to 2GB\".  So, try that - it works on mine and apparently worked on Mr. B's.For the price, it works well enough. It rains in unpredictable patterns in Paris. Using this, I never have to worry about harming my really good cameras.", "Date": "October 27, 2007"}, {"Title": "Underwater Camera, good cheap option", "Author": "A Customer", "ReviewID": "R2UGWJL47321H", "Overall": "4.0", "Content": "Took it through Underground rivers in Mexico, Cenotes, Xel Ha and itwas Decent. For the Price, you just cant beat it. I went down 20 feet with it and swam all day taking Pics and it worked fine. The Image qualityis kinda grainy, it's not like your regular digital camera so don't expect it, but its better than the throw away water cameras, and it's digital.Also, if you buy this, take a few pics of any good underwater stuff asthey often come out blurry or dark. Not the camera's fault, water picsjust have more chances to go wrong. I would say take at least 3 quick shots of anything you really want that \"water shot\" of and then at least 1 or maybe 2 will be really nice.Good luck !", "Date": "March 11, 2009"}, {"Title": "child's first real camera", "Author": "Whistle2girl \"Whistle2girl\"", "ReviewID": "R3BSQL4BHIH5A7", "Overall": "4.0", "Content": "I bought this for my grandaughter. She loves the water & has enjoyed this camera taking favorite pictures underwater. Very good value for the money. Also durable for an 8 year old to use.", "Date": "January 10, 2009"}, {"Title": "good camera; not-so-waterproof casing", "Author": "V. Jarvis \"mom23lilrascals\"", "ReviewID": "R2BM8PUJGV4XM3", "Overall": "2.0", "Content": "i found that most of the photos taken had to be taken 'blindly'; ie, to point and shoot.  the lcd was useless under water; the viewfinder would have helped. we got some terrific shots of the kids underwater, on a sunny day, in a pool that was clear, too. i wasn't afraid to take the camera into the pool, even with all the splashing, and was able to get wonderful angles i never would have been able to get with my regular camera.the downside is, after one month of having received the camera; probably about a dozen uses, water got into the case.  as i mentioned before, we just point and shoot and hope for the best.  most often, it is too bright to review the photos outdoors.  so i did not even realize that water had already seeped into the camera!  the lcd was filled!  i quickly removed my batteries and memory card, but i don't know the damage they sustained. i'm now afraid to try them elsewhere. the batteries were new, too, and are the rechargeable kind.so, in my case this camera did not even last a full summer.  i did get some great photos. was it worth $85 (w/shipping)?  not to me.  i'm really bummed. the kids really liked it, too....  now i have to see if it is covered under warranty.", "Date": "August 13, 2008"}, {"Title": "Great, especially for the money", "Author": "Golden", "ReviewID": "R1GQ3R3G6HMIRI", "Overall": "4.0", "Content": "I used this camera on a vacation, didn't do anything too crazy with it, ie, scuba diving, we just used it while playing at the pool, lol. I don't recommend using it as a both land and water camera as it's not the best quality (I have a separate camera for \"regular\" use), but the picture quality is really great for the price. Another little bonus is the case floats haha. I dropped it from a boat into the ocean but there it was bobbing along until I grabbed it again.My only issue is that the AA batteries drain really quickly but batteries are easy to find anywhere so not a big deal.All in all, easy to use and fun camera to have, and a great price!", "Date": "June 6, 2008"}, {"Title": "Great for the money, and an excellent snapshot camera", "Author": "W. Evans", "ReviewID": "R3KGZIO9PF28GA", "Overall": "4.0", "Content": "I actually just got this camera today, and have already taken some decent pics with it. I agree with everyone else in that you need to read the instruction manual thoroughly to make sure you are getting the most out of your camera. However, it is capable of taking great snapshots. The only drawback I have found is that it is hard to hold the camera still enough that the pictures won't come out blurry. Sharpness is kind of an issue in general with this camera (it's not unacceptable, but of course it's not going to look like a Nikon). But considering you can get an underwater camera for under $100, I would say this camera is a great deal! I'm planning on taking it on some shallow water scuba dives/snorkeling trips.", "Date": "May 14, 2008"}, {"Title": "Had some problems, but we still got some good Pic's", "Author": "Brenda", "ReviewID": "R1WU2XIWPPBVC2", "Overall": "3.0", "Content": "Bought this for our trip to Cozumel Mexico..  The video mode froze up the whole camera the last few days we used it. So you had to get out of the water, take it out of the case. Remove the batteries to turn it off. Then we just stopped using the video mode.. Pictures were allot better then the 35mm disposable camera we did last time.  Needed to be sunny out for the best pictures.. The video's we did get are better then I thought it would be.  Our friends really liked the fact you can watch what we did, rather then look at all pictures in the water. We got one video with a small sting ray burring himself under the sand. It was awesome!  That was worth buying this camera.The camera itself is cheap and plastic, the water case it nice..  For the price it worked for us.", "Date": "May 8, 2008"}, {"Title": "ok camera", "Author": "Nanecki", "ReviewID": "R2T67WCNZWND5L", "Overall": "3.0", "Content": "some amazing pictures!  Others not so good.  I could not see the picture I  was taking when in the sun or underwater. For the price it takes good pictures.  Keep in mind though it does NOT come with a memory card which I bought one on sale for 14.00.  That is an additional cost.  The camera is small and compact.  For my need it worked well and took some on land and underwater photos on our trip.  P.S.  stock up on triple a batteries. It sure beats a disposable underwater camera.", "Date": "April 15, 2008"}, {"Title": "Digital Camera", "Author": "DLGUS", "ReviewID": "R1LUUKTPJRQD3A", "Overall": "5.0", "Content": "I bought the camera for my teenage son.  He loves it.  He sails in the summer so I liked the waterproof case.  He already brought it to the beach on a rainy day and the pictures came out great.", "Date": "March 12, 2008"}, {"Title": "underwater digital", "Author": "waterbug", "ReviewID": "R2JEP9EE6AZBCR", "Overall": "3.0", "Content": "Good news it did not leak down to 20'(snorkeling at Grand Cayman), but focal length is limited to close shots, if you are scuba diving and have control over your movements then it would probably be ok, but for snorkeling where you are moving most of the time, it does not focus well. Must practice with camera before using I think that would help, which is something I did not do (not likely to jump in the pool in Oklahoma in mid January), also it eats the 'aaa' batteries even when it is turned 'off', so remove them when not in use, otherwise you will be disappointed when you jump in the ocean and your batteries are dead.", "Date": "March 9, 2008"}, {"Title": "Great camera for kayaking, swimming, diving, and decent for land use.", "Author": "Chris Montanye", "ReviewID": "R3F6Y38SB1X6O2", "Overall": "3.0", "Content": "After searching for the perfect camera for both above and below water, I realized that you're going to have to sacrifice some quality if you try to get an \"all in one\" camera.  So I bought another Casio QV-R series camera for land use(I recently lost two in water accidents)and my wife gave me the Vupoint for Christmas.I'm very impressed with the Vupoint.  I took it on a recent outing, and left my Casio at home since I was kayaking a lot.  I took all of the pictures with the camera inside the waterproof case, and most came out very clear.  I think I have to play with the settings to correct for some washed out colors under certain conditions, but overall it did very well.  I think it will do great when I finally get it underwater too.", "Date": "December 30, 2007"}, {"Title": "VuPoint Underwater Camera", "Author": "M. Jackson", "ReviewID": "RP7BMVU2SQZ4M", "Overall": "5.0", "Content": "For the price I am very satisfied.  works great, once I figured out how to use it.  If I worked for Nat Geo, I would probably have something better, but for vacation diving and showing friends and family the underwater world, it works great.  The deepest I had it, was about 40 feet and it worked fine, no water in the case afterward.  I might order another one for others to use when I/we go diving.", "Date": "January 7, 2012"}, {"Title": "Underwater Camera", "Author": "Boricua1966", "ReviewID": "R36G35I1BDN5SU", "Overall": "4.0", "Content": "Great little camera! I've used it to take underwater video and photos. For the most part, it takes good pictures. One drawback is that this camera eats up batteries somewhat fierce so be sure to have a lot of AAA batteries around. Another drawback is that the camera is not self setting You have to set the date on it every time you use it (that's if you want a time stamp on it). Kinda hard to see the pics after you've taken them but for the most part, it takes a good picture/video. The casing seems to work great. It keeps the water off of the camera.", "Date": "March 20, 2011"}, {"Title": "one season use", "Author": "scrimage", "ReviewID": "R20PABQIAAJN1F", "Overall": "3.0", "Content": "I purchased this camera twice.  The first time it was over $100.00.  The camera worked great.  Put it in the drawer took out the next Summer, the camera would come on but would do nothing.Went online, purchased the same camera Summer 2009.  It arrived, used the heck out of it.  Went to pull it out this Summer, same thing as before, camera comes on and nothing happens.  I've changed batteries.Maybe there is a solution and if there is I would like to know what it is.I will not purchase this camera again.  I'll buy the disposible until I can purchase and Olympus.", "Date": "August 17, 2010"}, {"Title": "Not bad at all", "Author": "R. Brownlee Rivera \"Rowza\"", "ReviewID": "RVWFLZQISZK1G", "Overall": "4.0", "Content": "This camera isn't top notch, but it certainly isn't bad. It doesn't have many features like a good lens or good pictures while moving, but if you can stay still enough, it'll be a great photo to share with family and friends. Also, most people don't change the settings on it. Mine took crappy pics at first, but when I changed certain setting on it, the pics now look amazing. I also filmed under water with it, both at the beach and in a pool. You need to get really close if the water isn't very clear, but you can definitely get good pics for a small price. If you're broke, but want a fun camera to carry around to all your favorite places (especially the outdoors) then go ahead and purchase this one. Also, I had no leaks or anything with the case; it's great and sturdy. AND IT FLOATS, so you won't lose it underwater. It's a tough cam.", "Date": "April 12, 2010"}, {"Title": "Great for the Money and Mac Ready", "Author": "WoodTurner", "ReviewID": "R2UQPO3JIYVZ3B", "Overall": "4.0", "Content": "For what I paid [$50] no complaints here. Pictures are sharper than the reviews for me at-least. They weren't until I peeled off the protectant film over the lens. Up until then they matched the reviews and I felt so taken. So I wonder, are others forgetting this also? I haven't tested in water yet, but I'm sure that it'll be better than nothing when shooting the kids in the in the pool and beach next summer. My favorite feature is the USB flip out from the side, no more looking around for a card reader, yay. And it's completely compatible with OS X, as usual nothing to install. Mounts on the desktop like any other drive. Movies are AVI's which open in QT 7 or VLC.", "Date": "November 26, 2009"}, {"Title": "Horrible image quality", "Author": "Michael A. Duvernois", "ReviewID": "R20SXW574ZGSUO", "Overall": "2.0", "Content": "If you get it cheap enough, it might be fun as a canoe camera or to try getting some snorkeling pictures, but the image quality is absolutely dreadful. And the delay between pressing the shutter button and the picture being taken is very long.", "Date": "September 28, 2009"}, {"Title": "You get what you pay for", "Author": "M. Charthern", "ReviewID": "R3TDGD04RM7ULO", "Overall": "3.0", "Content": "This is my second digital camera. My first was a 1.3 MP camera. I finally decided to upgrade because of some pictures a recently reviewed from my friend's 5.0 MP camera. I know not all 5.0 MP cameras are the same. I know you also get what you spend. This camera isn't that expensive so I wasn't expecting it to perform to the same standards as my friend's more expensive 5.0 MP camera. First of all I would like to say I bought this camera based on that it includes a waterproof case. I am a diver so this was the must factor to have when I was shopping for a new camera. Anyways, the camera is fairly descent. I REALLY like that the controls are extremely easy to operate. I played with a few of those expense cameras in the store and those things were a little to complicated to use. The camera is small. No lens cap. Doesn't support high capacity SD cards (BTW I used a 4GB SD card, it doesn't read it and it reformatted to 893MB and lost the original data on the card); this is good information for you tech people. I had hoped the picture quality would be nicer, but it's acceptable. I still need to play with a few more settings then perhaps I will get some better pictures. I like the video capture. Only negative about the video is that there's no sound playback on the camera; you have to use an external source if you want to hear sound. I thought I read a review this camera is a battery hog; I wouldn't be surprised. The batteries are holding up but I really haven't put this camera to a serious test yet. I am still upset over the SD card issue. The zoom function is pretty slow and sounds like it struggles to zoom. Sorry I haven't tested the underwater capabilities yet; I will eventually and update this review. Lastly, this camera does fairly well at night shooting. I was surprised with the amount of light captured. In all it's a fairly good deal for the price. Remember, you get what you pay for. If given the choice to buy this camera or choose another. I would choose this one again. 28 Apr 2008 ***Update*** I am just about fed up with this camera. If something moves, forget about getting a clear picture even in sports mode. Indoor night shots are always over-exposed. The camera is a battery hog, and charging the flash takes so long! Lastly, the time processing between shots is again too long. As stated before I bought this camera for diving. I still haven't had the chance to use it for diving yet. The camera does take good video, but I but the majority cameras can do this. I already have my new third camera. Hopefully it will work better for me then this one. You get what you pay. Memories are priceless, so buy a camera that can deliver. This camera doesn't deliver on land. Maybe it will do a better job underwater.", "Date": "August 7, 2007"}, {"Title": "VuPoint 5 Megapixel Underwater Digital Camera is Terrible", "Author": "Peter T. Robertson", "ReviewID": "R3VWP01DXSJFAJ", "Overall": "1.0", "Content": "This is a terrible camera.  We bought it for use underwater on a snorkeling trip, and the quality, clarity and sharpness of the pictures is awful.  I got much better quality, clarity and sharpness of pictures with the cheap,underwater, one-time use cameras sold by Kodak and others.", "Date": "March 4, 2009"}, {"Title": "Blurry Pictures", "Author": "Kate P.", "ReviewID": "R21CQJOVJ0HLTA", "Overall": "1.0", "Content": "I bought this camera for my husband for Christmas.  He opened it early, but was disappointed.  The pictures were blurry and it was very difficult to focus when taking a picture.  I don't know if it was a defective camera or not, but I wouldn't take the chance. I gave it one star only because it wouldn't register 0 stars.", "Date": "December 13, 2007"}, {"Title": "Dissapointed", "Author": "Rider", "ReviewID": "R2DSJWR9IQF1B1", "Overall": "2.0", "Content": "I bought this camera because it had several favorable reviews. Unfortunately, it was a major dissapointment. The flash has a mind of its own, the pics quality is mediocre and it's definitely over priced. I guess this camera doesn't have much competition in the market hence its popularity. It's a piece of expensive junk.", "Date": "April 15, 2009"}, {"Title": "VuPoint is a Cell Phone Camera in Disguise", "Author": "Angel_Pen \"angel_rising\"", "ReviewID": "R24NLGCTVGJDTS", "Overall": "1.0", "Content": "The VuPoint reviews are misleading, The VuPoint Camera is just a cheap cell phone camera disguised as an underwater camera, and it is not even a good camera at all. If you don't believe me just take a good look at the camera lens and you will notice that it looks exactly like you phone camera lens. Actually, any cell phone currently in the market can take better pictures than this VuPoint. I returned it before I had a chance test the waterproof case, but the case looked flimsy and the locking mechanism does not have a secure lock, it may open accidentally underwater. Also this camera wins the price as the electronic device with the most fake reviews I have ever seen on Amazon. You have been warned.", "Date": "December 20, 2008"}, {"Title": "Dont bother", "Author": "C. Brady \"C.B.\"", "ReviewID": "R1AS1828YAITJ1", "Overall": "1.0", "Content": "Image quality is HORRIBLE, My cell phone takes better images.Returning it because when I turn the flash on the camera shuts down.Very unhappy", "Date": "November 28, 2008"}, {"Title": "Excellent Service", "Author": "Robbin Hagen", "ReviewID": "R3456LLQIMDYDM", "Overall": "4.0", "Content": "I ordered this camera just 5 days before a Hawaii vacation, It quick shipped in 2 days. I'm very happy with this product and I would by from Amazon again. Thank you.Vupoint DC-WPC-ST531TBLK-VP 5 MP CMOS Camera", "Date": "March 31, 2008"}, {"Title": "Arrived too late", "Author": "Lovin Life", "ReviewID": "R1E24ARG9UDVHW", "Overall": "2.0", "Content": "Unfortunately the item did not arrive as prommised!  Was not able to test it out on our vacation.  I ordered the camera and a snorkle set on the same order - both were promised within a week - the snorkle set came as promised, the camera showed up 5 days later after we left for vacation.  very dissappointed with seller - tried to communicate with them and although they responded promptly, they would not offer to expidite or help - by then it was too late to try and order from another seller.", "Date": "February 13, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000P4YQR4"}}