{"Reviews": [], "ProductInfo": {"Price": "Unavailable", "Features": "Menus and controls are very simple to use and the camera would be ideal for a first time digital camera user, although menus have to be backed out of completely before returning to the shooting screen, which can be time consuming and slightly annoying. The zoom rocker is easy to use and provides a smooth zoom movement between telephoto and wide-angle shots.\nBenQ DC C1050: Specifications  Sensor: CCD - 10.1Mp Zoom: 3x optical, 4 x digital Image Size: 3648 x 2736 Lens: f/7.94 - 22.71 Focus: TTL Auto Focus range: Normal: 40cm - infinity, Macro: 10cm Metering: Center, Multi, Spot ISO Sensitivity: Auto, 50, 100, 200, 400, 800, 1000 White Balance: Auto, Sunny, Cloudy, Tungsten, Fluorescent_H, Fluorescent_L, MWB Scene Modes: Landscape, Backlight, Night Scene, Snow, Fireworks, Building, High ISO Portrait, Food, Text, Kids, Sunset. Macro: 10cm Monitor: 2.4in TFT LCD Movie Mode: Yes Storage: 9Mb Internal, SD Batteries: 2 x AA Video Output: Yes Size/Weight: 91.5 x 61.5 x 26mm - 140g Transfer: USB 2.0\nBenQ DC C1050: Modes and Features The program mode of the DC C1050 offers quite a lot of control allowing the user to change the aperture and shutter speed of the camera, resolution, image quality, metering mode, white balance, ISO, exposure drive mode, AEB (Auto Exposure Bracketing), highlight areas, sharpness and effect (phew!). Then there is a movie mode as well as a Shake Free setting which works to reduce blur caused by camera movement by selecting a higher ISO setting in low light conditions. Scene modes offered here include Landscape, Backlight (changes metering for backlit subjects), Night Scene, Snow, Fireworks, Building, High ISO Portrait, Food, Text, Kids, Sunset and a Voice Recording option. One thing I did find slightly odd was that there was no 'regular' portrait mode, just a high ISO portrait mode for use in low light conditions. When I actually took a shot with this function the camera selected an ISO of 100 - hardly high at all.\nAvailable white balance options include Auto, Daylight, Cloudy, Tungsten, Florescent_H, Florescent_L, and a custom white balance for accurate settings when light source cannot be specified. I found this to be a good feature as white balance presets are not always accurate. Metering modes offered are the regular Centre, Multi and Spot and the ISO settings range from 50 to 1000 and of course an auto ISO option. Another thing I found very strange here is that the EXIF data of the shot taken at ISO1000 actually shows ISO1030. The sharpness menu allows the user to select from Hard, Normal or Soft when in Program Mode, and there is a macro mode offered here but this only focuses from within 10cm, which I found quite disappointing judging by the fact that macro photography is supposed to be close-up.\nBenQ DC C1050: Build and Handling  The DC C1050 is very basic in design, with square features, a plastic outer casing and mock-leather strip down the left hand side. The lens is chunky and very prominent giving the camera a slightly retro feel. The camera feels extremely lightweight and slightly on the cheap and plasticky side. On the top of the camera is a small on/off button and a large chunky shutter release. On the back is a small zoom rocker, playback button, menu button, control joypad, delete function and mode selection.", "Name": "Benq Dc C1050 100 Mega Pixels Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/31J3v28DP-L._SX300_.jpg", "ProductID": "B000TSAPSU"}}