{"Reviews": [{"Title": "Very pleased", "Author": "D. Johnson", "ReviewID": "R1OAQCHFGTNGGH", "Overall": "5.0", "Content": "I currently use a Canon 20D, Canon 5D, and Canon Elan7ne with a variety of lenses. I wanted a very good - small \"point & shoot\" digital camera and the Leica D-Lux 2 not only fit that need it exceeded all of my expectations.I'll admit to having some reluctance in buying this camera after reading all the negative internet reviews on it before it even hit the market. I'm so glad I ignored the nay-sayers.While the Leica has a number of pre-sets for automatic shooting that I'd imagine would keep the average user completely happy with the unique variety provided, I was more impressed with how easy it was to use this camera in priority or manual mode. With a minimal amount of practice I was able to quickly setup a shot with an extreme level of control; from setting ISO, white balance, color, etc to establishing the exact exposure I was looking for.My only comparison of this camera would be to the SLR equipment I'm currently using so I can't honestly speak to the whether or not there are \"point & shoot\" cameras as good as this one. But, comparing this camera to my SLR equipment I can honestly say that I'd have no problem going \"small and light\" once in awhile and just using the Leica. The image quality is excellent with this camera.Any complaints? Not really. I'm disappointed that it doesn't have a viewfinder but it's something I've adjusted to. Also, if you are shooting in RAW + Jpeg you'll need to carry a few gig of memory cards around with you.", "Date": "May 24, 2006"}, {"Title": "A very good Digital Camera", "Author": "Jeffery A. Johnson", "ReviewID": "RAYOT1JW3DJJP", "Overall": "5.0", "Content": "I've had several digital cameras.  However none have ever satisfied me.  I use to be deep into photography preferring 2 ¼ format.  Then, for ease of use and carry around I slowly moved to 35mm, trying to stick to Kodachrome 25, this gave good results.  As I got into digital cameras I've had several.  However none have ever satisfied me.  I went to Sony Cyber-shot cameras, because of the good Carl Zeiss lens.  This gave ok results, but it looked like I was using 400 speed film.  I promised myself I would someday get a good quality Digital camera with manual shutter/aperture control.The Leica D-Lux blew me away.  The first shot I took was only a 2 mega pixel, but it looked better than any 4 or 5 mega pixel shot I had ever seen.  The pictures look almost like film, very little pixel distortion.  And the ability to set the ISO manually is a very nice feature.  I am very happy.  The only thing that is missing is a remote shutter cable for the long night time exposures, (they suggest using the self-timer to avoid shaking).If you want a Very good Digital camera, with the control of an old mechanical 35 mm, with the bells and whistles of a digital camera, this is a good choice.", "Date": "May 23, 2006"}, {"Title": "Latest, Superb Compact Leica Digital Camera", "Author": "John Kwok", "ReviewID": "R8TTOA5VE918F", "Overall": "5.0", "Content": "I will be surprised if the Leica D-Lux 2 does not prove to be a successful product for both Leica, and the camera's manufacturer, Panasonic; this is without question the best compact digital camera to result from this successful partnership. I had the privilege of using one that was available for usage at the Leica display booth at the annual Photo Plus East trade show which was held here in New York City last month. The image quality is absolutely fantastic, but this is exactly what is to be expected from a DC Vario-Elmarit f 2.8-4.9/6.3-25.2 ASPH lens with a zoom range from 28mm to 112mm equivalent on a 35mm camera with a Optical Image Stabilizer. It comes equipped with a 64Mb SD Memory Card, but can also accept a Multimedia card. But, best of all, it weighs less than 8 ounces (220 grams) with battery, storage card and lens cap, and fits comfortably within the palm of your hand. Its most novel feature is the opportunity of photographing in 16:9 format (suitable for reproduction on HDTV), 3:2 Leica format, or 4:6 format as still pictures (RAW, TIFF, JPEG) or videos (QuickTime Motion JPEG). When I decide to think seriously of buying a compact digital still camera, then this new Leica digital most definitely will be number one on my list.", "Date": "November 25, 2005"}, {"Title": "A neat camera but with some flaws", "Author": "D. Hall", "ReviewID": "R2HUZVNVC8PJN2", "Overall": "3.0", "Content": "The camera is a fine small camera but with two big problems.  There is no view finder, a real problem if you want to take photos outside in sunlight.  Second, the screen that you use to frame the picture becomes almost invisible in sunlight, impossible to see and frame the shot.  The manufacturers have made an effort to correct this by including means to brighten the screen, but it is not enough. The quality of the shots is good, some noise with the 400 speed setting. The shutter lag is not a problem unless you are shooting several quick shots in a row.  There may be a way to set the camera in burst mode, but I haven't tried that.The size of the camera is great.  It fits into a purse, is light enough that it is not a problem to carry.  It has the advantage of having both a point and shoot automatic mode, and a manual mode so the photographer can fine tune the shots and enhance the exposure.All in all, I'm happy with the product with the exception of the two problems mentioned above.  Why the manufacturer eliminated the viewfinder is a mystery?  What were they thinking?????", "Date": "July 8, 2006"}, {"Title": "Great little product for the price", "Author": "David", "ReviewID": "R1S13KFSEJ7M4B", "Overall": "5.0", "Content": "I bought this product right before traveling overseas. It was a great camera for traveling. it has a good lens. My only gripe with it is the lack of a lens finder. Battery lasted almost two days, taking about 40 pictures a day. Overnight charging, so it was ready the next morning. Seeing as I bought this used, it was a good camera for the price. I was able to get some really beautiful shots with it. Keep in mind, just because it is a Leica doesn't mean it tops amazing high end cameras. It does a good job though of holding its own.", "Date": "July 3, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.4 Megapixel, Up to 3840 x 2160, Up to 16 - 9 VGA 848 x 480, Up to 4 - 3 VGA 640 x 480 at 10 or 30 frames per second\nExternal Memory - SD & MMC Card (64 MB SD Card supplied with camera)\nFile formats - RAW, TIFF, JPEG (Fine / Standard)\nVideo Output - QuickTime Motion JPEG\nSelf timer - With 2 or 10 second time delay", "Name": "LEICA CAMERA D-LUX 2 8 Megapixel Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41ZDQSBEYGL._SY300_.jpg", "ProductID": "B000CEAMRK"}}