{"Reviews": [{"Title": "Fantastic Pocket Digital Camera", "Author": "Bob \"rww319\"", "ReviewID": "R1TR3E24SNN2HP", "Overall": "5.0", "Content": "I purchased this camera on July 29, 2004 and have been very happy with it's performance.  It takes great pictures, easy to use, great menu's and it is very good looking.  The DSC-W1 has exceeded all my expectations and has been a pleasure to use.  If you are in the market for a point and shoot, plus, numerous and easy adjustments, your'll love this camera.", "Date": "August 10, 2004"}, {"Title": "DSC-W1", "Author": "J. Collins \"JAC\"", "ReviewID": "R1PCS5NZGULTI2", "Overall": "5.0", "Content": "Great camera although a little slow when taking pictures in low light conditions.  I got a kick out of the bad review from Dec 22, 2006.  The same thing happened to my DSC-W1, although it is not megaPixels dying.  The dark spots are caused by dirt trapped inside the camera from using it in a dusty location.  I had mine cleaned (including CCD) and the dark spots are now gone.", "Date": "January 5, 2009"}, {"Title": "some good features some not", "Author": "Mr. Greg", "ReviewID": "RLY1G4C7W2GSZ", "Overall": "4.0", "Content": "Likes: The camera has an infinity (sideways 8)feature for focus. I really like this feature! Many of the new cameras only have auto focus and because of this the new cameras blur too much making the video useless in tight shots. So this is a real plus for this camera.Dislikes: In video mode you CAN NOT zoom in or out of your subject while recording a video.Dislikes: The Battery door on this camera breaks very easily. A trick I found was to buy a screw that fits the tri-pod hole and get a washer big enough to cover the broken battery door.If you can find a good used one buy it. but to pay $300 plus for a new one is not worth it.", "Date": "September 29, 2011"}, {"Title": "Favorite Camera Ever!!", "Author": "M.", "ReviewID": "R287EPRRU965X1", "Overall": "5.0", "Content": "Although I received this camera as a gift in 2004 ... I still have never found another digital camera I like as well. It is easy to use and takes great pictures. I have purchased (2) new cameras for my children ... a 9mp and a 10mp (not Sony) and my Sony still takes the best pictures in the house.  Don't know what I'll do if it ever stops working.  It has been a very durable camera and I love the video mode when I have to take short videos as I dont have to haul video camera with me too.Great quality!", "Date": "July 12, 2010"}, {"Title": "Dead Mega pixels after 1 year....", "Author": "D. Ott", "ReviewID": "R2HXQ8Y2E10ED", "Overall": "2.0", "Content": "You got it... I loved this camera until I was on vacation in New Zealand and my mega pixels started to die.  Yes, within two weeks of the first one dying... three of the mega pixels died leaving me with these nasty looking black circles in all of my shots.  I sent it back to have it repaired and they told me it would be the same price as buying a new camera.  So... after a year of a decent camera, I found it just didn't last for the money. I am back on the market for a new camera.  I wouldn't recommend it because of that purpose and the cost of having it repaired after a year when it could also break.  On the plus side, I loved that it was black and could fit in my pocket.", "Date": "December 21, 2006"}], "ProductInfo": {"Price": "$588.00", "Features": "5-megapixel sensor captures enough detail to create photo-quality 13-by-17-inch enlargements\n3x optical zoom plus 2x digital zoom for 6x total\nCarl Zeiss optics; high-resolution movie mode with sound; large 2.5-inch LCD\nCompatible with Memory Stick and Memory Stick Pro media; includes 32 MB card\nPowered by 2 AA batteries (NiMH rechargeables included); connects to PCs and Macs via USB 2.0", "Name": "Sony Cybershot DSCW1 5MP Digital Camera with 3x Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/416X1MQNG6L._SX300_.jpg", "ProductID": "B00022PTTS"}}