{"Reviews": [{"Title": "Works fine as a front door [or back door] entrance camera.", "Author": "DISenchanted", "ReviewID": "R1IOK7VOGBJ3S1", "Overall": "4.0", "Content": "The camera is about the size of a large egg.The mounting capabilities are:- a clip on holder- an adjustable base, that allows mounting on a vertical surface, or a horizontal surface. The angle adjustment is 0 - 90 degrees.There are 6 infrared LEDs, three on each side of the lens.I use 2 cameras to monitor both a front door and a back door.Software will support 1 or more cameras, hooked to your PC's USB ports.The included software allows you to setup \"motion detection\" activity thresholds, to then record either snapshots or video clips.For added security, you can have snapshots emailed to you.Compatible with:-windows media center-XP-VistaThese cameras work fine for web cams and for monitoring the activity in a room, or at a front door.If you want different monitoring software, there are dozens of other freeware/shareware options on the WWW.The night time viewing range with IR is listed at 6 feet [per the Lorex user manual].If you never played with a camera like this, I would say that you should  remember that this is not a telephoto camera; like a bank or casino has.You are not going to see whats going on at a neighbor's house , 6 blocksaway.Unlike CSI on TV, you won't be pulling up the license plate of a car, that is 4 blocks away.", "Date": "November 23, 2008"}, {"Title": "laaame.", "Author": "J. Larson", "ReviewID": "R1TQ7INSHL4ZPP", "Overall": "1.0", "Content": "this is a low resolution, black and white camera with a simple photoresistor that turns on six IR LED's.the software is web browser based, and is not very good.  it might pass as a cheap security camera.i've seen better web cams with better software that cost as little as $5.  i was just astonished it was black and white!  based on the mini DIN connector coming out of the camera which requires that little silver box to change over to USB (which, by the way, does not power the camera - it has a seperate wall wart), i'm guessing this is repackaged web cam surplus from 7+ years ago.even though i didn't buy this with my own money (company), i'm going to go through the hassle of returning it because it is so laaame!  in this case, you DO NOT get what you pay for!", "Date": "May 8, 2009"}, {"Title": "No driver support", "Author": "packrat", "ReviewID": "R3JAFWRJLFHAGV", "Overall": "1.0", "Content": "No driver support for Windows 7 or 64 bit operating systems. The Lorex web site doesn't even mention Windows 7. Camera is useless without drivers.", "Date": "February 17, 2011"}, {"Title": "Nice concept but lots of problems", "Author": "James Young \"jyh\"", "ReviewID": "R29NLA4S4B6URG", "Overall": "2.0", "Content": "I bought one of these from Best Buy.  Tried to set it up but got a hardware failure when I plugged it in the USB port.  Tried it on two other computers and got the same error.  Called tech support.  They said I needed to update my usb drivers for my computer.  Maybe I'd believe that if it happened on one computer but not 3!I took it back and got another one.  This time the driver installed ok but their viewer application wouldn't find the camera.  Took it to another computer and installed and reinstalled the software several times.  Could not get their viewer software to work.  However, XP's native driver saw it ok and would let me view the video.Camera quality as written by others is not all that good but it does have night vision.As I said, it is a nice idea.  I really wanted a camera with both day and night video capability but this camera is nearly impossible to install and then I could never get their viewing software to work.", "Date": "May 8, 2008"}, {"Title": "DO NOT BUY!!!", "Author": "Chris K \"thesandu\"", "ReviewID": "R2XLJ1ZGOK0CSE", "Overall": "1.0", "Content": "This is absolute junk, Terrible video quality. Best Buy is blowing them out for $19.95. It was so cheap I thought I'd try it out. What a waste of money. Hope I get a refund.", "Date": "April 14, 2008"}, {"Title": "Not Bad Considering The Size", "Author": "Steve C", "ReviewID": "R1QZOMW6AEM4QV", "Overall": "2.0", "Content": "If you pick one up on sale for $20 it isn't bad but if you want good video get a full size camera with a real glass lens. This isn't bad for a little toy camera with a 1/16\" lens, about the same as other tiny cameras and webcams.  They claim 640X480 resolution but I think it's more like 320X240 but it's fine for checking to see who's at the front or back door. Don't use the USB adapter though, that produces an even more fuzzy picture. The combination of a low resolution camera and a fuzzy USB adapter makes a combination that produces video where you really can't make out much detail. I took mine apart to focus the lens because you have to turn the front to focus it but it can't be reached inside the case and noticed that it was somewhat better outside the case. The plastic cover on the front seems to distort the video and wash out the color so I drilled it out leaving the front open. With the front open it won't be water proof any longer but the picture is better, at least in bright daylight. The infrared LED's also cause the picture to look mostly bluish/gray so you want to have good light, preferrably daylight, so it's best if you use this camera in a sunny location. Don't expect it to last long if the sun falls right on it though, that will cause the plastic lens to turn white and the picture will go out after a period of time in the sun. To use it in the dark with IR illumination you need to open it up and remove the IR filter that's stuck over the video sensor with double sided tape. It seems odd that a camera marketed as having \"Night Vision\" would have an IR filter but it does. With the filter on it won't be able to see much in darkness, even with extra IR illumination but with the filter removed it's nearly as bright as a real camera, still just as fuzzy as before though.", "Date": "December 21, 2009"}, {"Title": "Advanced Indoor-Outdoor Color Web Camera w Security Features", "Author": "Joe Taxable", "ReviewID": "R3DK6AJJU8A7XC", "Overall": "5.0", "Content": "View, listen and record high quality real time mCam video stream. Set Motion Detection feature to automatically record to your hard drive & send Emails with a snap shot when motion is detected. Remotely view live mCam video & audio stream from any device that supports Windows Media Player.", "Date": "April 6, 2008"}, {"Title": "Not needed", "Author": "WheelChair Man", "ReviewID": "R2HOKDD7U0XUR9", "Overall": "4.0", "Content": "After receiving the item I realize it's not what I actually needed so I sent it back to get my money back.", "Date": "June 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000I00OOO"}}