{"Reviews": [{"Title": "I'm happy", "Author": "Will Mckamey", "ReviewID": "RJ6P3LP0B90JW", "Overall": "4.0", "Content": "I use it for backpacking and camping trips in the Pacific Northwest. I'm not a photo nut, just in it for the memories. I needed something light for backpacking and cheap incase the thing gets destroyed along the way. It has all the features I need and then some. It's light, compact and the weather resistance is a great plus. I took it out to Glacier National Park with a 256MB and it worked out great. Worked well in most lighting conditions. Got some great sunset shots. All in all, very happy with it for the $149 I paid.", "Date": "June 4, 2005"}, {"Title": "this camera rocks!", "Author": "m. johnson", "ReviewID": "R6XATAMWFDIUM", "Overall": "4.0", "Content": "i purchased this camera for myself, as i love digital photography. photoshop can do wonders. anyway, i take this camera everywhere i go and take pictures of random things, and play around with them on photoshop. this camera produces pictures at the perfect size i need. the LCD screen is just the right size and the buttons are not too small. the memory on it is horrible. it hardly holds any pictures. i recommend a memory card with about 52mb for a reasonable price. this camera is a great buy for not a lot of money.", "Date": "September 5, 2005"}, {"Title": "Horrible on batteries, works when it wants to", "Author": "A. Severin", "ReviewID": "R21WE18GQZSKAA", "Overall": "1.0", "Content": "I got this camera as an early birthday present. Less than one week later I had to return it. First the camera turns on by sliding a door that covers the lens over. This mechanism works only when it wants to. Half the time you can't even get the camera to turn on.When it's on it immediately drains the batteries. I changed the batteries twice in three days.Somewhere around the 6 day mark the camera just stopped working completely.In addition the software takes forever to download and ended up corrupting many of my files during the installation process. The pics are ok at best. They are pretty sharp if you're just going to email pics but if you're going to actually be printing them out, the quality is subpar.Overall a horribly disappointing experience and a waste of money. I have since exchanged the camera for another brand altogether and I am much happier.", "Date": "November 26, 2005"}, {"Title": "It's a wonderful camera with great features", "Author": "Thomas Function \"Tommy\"", "ReviewID": "R5GFNFKMXW24X", "Overall": "5.0", "Content": "I've always envied the others around me with digital cameras, but I finally recieved one for Christmas 2005, and it happened to be this one. It has  a lot of different features, all of which impress me.I've also read from other customers that the battery life is horrible, while not horrible, it has poor battery life.But I've devised a plan to just keep the camera off when I'm not taking pictures. It only takes a few seconds for the camera to power up, so unless you want to take a picture of something that will be gone in 2 seconds, keep it on. But if you're just walking around and see something interesting, turn it on.Just keep it off when you aren't taking pictures.I also advise you buy rechargable batteries", "Date": "December 26, 2005"}, {"Title": "Good Camera , no doubt!!!!", "Author": "H. Rodas Barrera", "ReviewID": "R2YOFWXAZGES43", "Overall": "5.0", "Content": "i was scared this was my greatest mistake, since i bought the camera locally and came to amazon just to read the reviews aftewards.if you use the right battery there is no problem. i have been taking lots of photos with flash for the whole week with and still going....go ahead, buy it.", "Date": "September 15, 2006"}, {"Title": "Work well but very picky about batteries", "Author": "John S. \"Product Test Engineer\"", "ReviewID": "R28IRRRJEU96AU", "Overall": "4.0", "Content": "I read all the negative user opinions on the web only AFTER I bought this model.  There are definitely issues regarding draining batteries and inability to turn this unit ON.  Here is my experience and I hope it would be helpful.Alkaline batteries - Forget them.  You'll likely only get 5-7 shots from them.Rechargeable batteries - I already had numerous Ni-MH batteries (hi capacity 2000-2500 mAh) at home so I grabbed a pair of Rayovacs out of a recharger base (where I stored them) and popped them in the camera.  When I turned on the camera the display said \"batteries too low to take pictures\".  So I grabbed a different pair made by Sony from their charger and they worked without any problems. In fact, they lasted a whole day of picture taking and video shooting with plenty of juice to spare.  I have done some research and  experimentation (mixing and matching my batteries with different chargers) since that first day and truly believe the problems others have reported are related to the batteries used.  To avoid problems, you'll need high capacity Ni-MH rated over 2000mAh.  But more importantly, you MUST have a good (smart) recharger that has built-in circuitry to properly monitor the condition of the battery and charge the batteries at the proper rate in order to top them off and then turn itself off at the correct time.  Also, a good charger can trickle charge batteries stored in it for a long time.  A cheap charger will either overcharge the batteries or allow them to drain (either way, the batteries will weaken over time).  Avoid the quick 15 minute chargers as most of these only charge the batteries partially to 85% (as they say: there is no free lunch).  And finally, keep this in mind: alkalines are rated 1.5V while Ni-MH are only 1.2V.  If you have Ni-MH batteries that are partially charged or worn out, or not recharged optimally by a good charging base, you would be putting in a set of batteries measuring well under 1.2V and far below the 1.5V the camera is expecting.  To think of it another way, if you put depleted alkalines into the camera, do you really expect the camera to work?My other digital cameras share the same Rayovacs without problems.  It seems the HP is just very sensative to the level of battery charge and is highly likely to report an error when the voltage is low, which is too bad for I think it's a decent camera for the price.  I also updated to the new firmware available on the HP website.  This does not solve the powering up problem or the pickiness with the batteries, but seemed to have reduced the power consumption.Hopefully my review will have helped others who are frustrated with their experience with this model.", "Date": "January 6, 2007"}, {"Title": "Great Camera, Excellent Price!  This is HP's second generation of digital cameras.", "Author": "Will Everly Jr. \"WWE\"", "ReviewID": "R3F690C8X5WDCM", "Overall": "5.0", "Content": "This camera is one of the first models since Hewlett Packard changed its OEM factory.  Intitially photo file sizes were so large that many users were unable to easily or quickly send pictures, but as more and more people are using High Speed Internet Connections, such as cable or dsl, the larger photo files have become less of a problem.Photos generated by this camera can also be sent directly to a photo quality printer for immediate printing without the use of a computer.", "Date": "September 3, 2006"}, {"Title": "M22 Camera Proven Good With Over 4400 Pictures Taken", "Author": "Electrician \"Chuck\"", "ReviewID": "RZQAW1UNH8IQM", "Overall": "5.0", "Content": "I have used this camera since May 2005 with excellent results in taking over 4,400 photographs. It has performed very well in rain & good weather. Everything about it seems to be of good quality. The reviewer that complained about the flickering display needs to have the batteries fully charged first or else use the Lithium batteries that are sold practically everywhere. I have had a couple of times that the camera did not turn on and it was due to batteries that were not fully charged... The problem was with a different brand of battery charger that said the batteries were charged when they really were not fully charged. A different charger solved the problem. It is a surprize to learn that some people have had problems with such a fine camera as the HP M22 Digital Camera. There are very few other digital cameras that are weather resistant and this is one of the few that is rain proof without the purchase of a special case.", "Date": "August 22, 2006"}, {"Title": "Sucks down more batteries before 9:00 AM than most cameras do all day.", "Author": "Eric Andrew", "ReviewID": "R1POCXEGMBA4GJ", "Overall": "1.0", "Content": "This would be a really great little camera if it wasn't for the fact that I had to change the batteries several times a day.  I tried using alkaline, NiMH rechargable, and lithium, and the results were exactly the same.  When I sent it back and received another one, the exact same thing happened.  For this reason, this camera was completely useless.  There are other issues with the camera, but they're not even worth mentioning since the camera won't stay on long enough to notice.  If I hadn't brought my old camera as backup, I would have been really upset during a recent 3-week trip to Europe.", "Date": "December 20, 2005"}, {"Title": "Balky Performance, Failed At End of Warranty Period", "Author": "Software_Bear", "ReviewID": "R2MN5YVVAT93Q3", "Overall": "1.0", "Content": "There is a small sliding door on the face of the device which activates the camera.  It's performance was balky (sometimes it worked, sometimes not).  I could live with that---but the unit failed after precisely 371 days of ownership (it had a 1-year warranty).  I'll never buy an HP camera again.", "Date": "December 5, 2010"}, {"Title": "Not worth what I paid for it", "Author": "spreadthaalove", "ReviewID": "R22AUZ852U33J8", "Overall": "2.0", "Content": "Honestly, when I bought this camera at full price when it first came out, I thought it was a great deal.  Boy, was I wrong.  The camera is absolutely horrible on batteries. So when I actually wanted to use the darn thing I was never able to because the batteries were drained after having them in for about 20.  I eventually just started popping the batteries in right when I used the camera to save them.  The mechanism that slides over the view finder eventually gave up as well.It did however deserve a couple of stars only because the picture quality of the camera proved to be not so bad.In the end, if you're gonna spend money on a digital camera in the first place, I recommend shelling out a few extra bucks on a pricier camera.  It will definitely turn out to save you frustration and the money it takes to work it in the first place.", "Date": "May 3, 2009"}, {"Title": "Great camera!", "Author": "B. H. Walker", "ReviewID": "R2B8ZYMZKF78YI", "Overall": "5.0", "Content": "I borrowed this camera from my grandson and almost didn't want to give it back.  This camera takes awesome sunset pictures!  Even better than my own expensive camera.  So far, it's no. 1 on my sunset list.", "Date": "September 9, 2007"}, {"Title": "Easy-to-use first digital camera!", "Author": "S. Meador", "ReviewID": "RILU1SRSKEDE1", "Overall": "5.0", "Content": "I have never been good with cameras, but I bought the HP M22 in May 2006. I read the manual and tried all the features to learn how to use it. I took all the photos of my 40-yr. high school reunion, my sister's 70th birthday celebration, my trip to an organizational retreat, and made picture calendars for my family. This is a great little camera for the beginner to learn about digital photography. On a scale from 1 to 10, I would give it a 10!", "Date": "July 6, 2007"}, {"Title": "You need to take a standby camera", "Author": "Nick S", "ReviewID": "R34TZ5LH06B2H4", "Overall": "1.0", "Content": "This camera works whenever it wants. After contacting customer support  he suggested me to do a power reset. I lost confidence on this piece and shopping for a new one.  Probably I will pay more and go to SD450 or SD500Also make sure you carry couple of batteries for a day trip( for 75 pictures) :)", "Date": "December 13, 2005"}, {"Title": "returning after 2 days", "Author": "Brigette H. Reimschussel \"pa massage therapist\"", "ReviewID": "R1P8Q67CN1A0PF", "Overall": "2.0", "Content": "I had the same problem as the other reviewer. my batteries died quickly heck i even bought the energizer lithium batteries that they recommend so much. my camera like hers worked when ever it wanted too. i don't know maybe the other reviewers got lucky and their camera works. when the camera did work i did manage to get some nice pictures of my cats. i'll probably buy a different brand next time.", "Date": "December 2, 2005"}, {"Title": "UNRELIABLE HP Photosmart M22 - Not worth the aggravation...", "Author": "Iris", "ReviewID": "R2YKGNSWW0ORMK", "Overall": "1.0", "Content": "I've owned the M22 for nearly a year & have used it on maybe 10 occasions.  The last time I was going to use it the batteries went dead.  It's taken me some time to get new batteries (about 2 months), but when I did the camera wouldn't turn on.  I called the HP troubleshooting people - they told me the camera was no longer under warranty, (sadly I had not read the fine print that the warranty was for 90 days in the U.S. \"and a one year limited warranty in other English-speaking countries\" - a bit odd) but that I should be using lithium batteries (I was using Duracell Power Pix).  I bought the lithium batteries and still not working.  The HP troubleshooter said I could pay $30 to have the issue troubleshot, but it seems from the reviews I've read here that HP has made a horrible product and no amount of troubleshooting is going to make it work.  I also read in the fine print that they use refurbished parts in their cameras -- my feeling is that if they are using refurbished parts then the warranty should be for a longer period of time and it should be clearly stated on the outside of the package that refurbished parts have been used.  Granted, I bought this camera in a bundle with a photo printer (oddly the printer has a warranty period of 1 year) for a very low price from Target, but a quality product should have been sold.  This experience lessens (if not erases) my trust in what I thought was a reliable company.  HP really needs to remember the importance of quality products and customer satisfaction.", "Date": "July 3, 2006"}, {"Title": "Great on size, lousy on performance", "Author": "Aj Tissier \"ajtish\"", "ReviewID": "R3RZ0MQSOKLD15", "Overall": "1.0", "Content": "I read a review by a professional that described this camera as a great replacemant for all those disposable cameras that you buy, and never seem to get good pictures from. I have to agree totally with this.The camera works good when you are outdoors in very bright lighting, however you have to give it alot of time to focus, and if you use it indoors forget about getting pictures that are worth anything. I had problems taking pictures in a gym that had very bright lighting, all i got was a bunch if fuzy, indistiguishable pictures, a picture of my friend looked like a blob of color on the color of what was supposed to be a hardwood basketball floor.I guess that is the kind of performance i should expect from a $150 camera. I purchased a Canon A520 and am much more happy.On a good note one of the features that i liked was the Adaptive Lighting Technology feature. if you are taking a picture and your main subject is lit and the background is dark, then this technlogy will make the background brighter and more vivid color. This technology is great, if you are able to get a decent picture.", "Date": "May 30, 2005"}, {"Title": "ZERO STARS!", "Author": "zdf", "ReviewID": "R3IH9QX0P6UCM", "Overall": "1.0", "Content": "The story goes like this:Considering the specifications I decided M22 is the camera for my daughter (she is 10): metal case, waterproof, small, no external moving parts, standard batteries, easy to use, reasonable image quality.I have deliberately ignored the internet warnings over reliability considering that every product has its share of bad copies. Big mistake! Twice as big since I live in Bucharest and here the price is twice the price in NY (I have paid about 170$).The first camera the seller took it from the sealed box refused to start. He changed the batteries, and then he replaced them with rechargeable batteries... no result. It was like he took it from its coffin.The second one started nicely. I have played with it a bit but I have failed to notice the aluminum case had a defect, not a big problem, but annoying.I knew this kind of camera does not correctly report the status of battery, so I replaced the firmware with the last released version and then I took about 20 pictures. Then... the camera ceases to work: each time I pushed the shooting button the LCD started to flicker like a psychedelic light and then the camera restarts. Finally, like the one in the first coffin, it refused to start. I have changed the batteries... nothing... dead!The service refused to officially tell me how many HP cameras refused to work but he, unofficially, told me I bought the worst camera. HP proved it has no respect for the customer.Pros: when you start the camera (if it starts!) with the flash button pressed a set of test application start. One of these applications is searching for dead pixels and, if it finds any, it re-computes the interpolation matrix so as to hide the dead pixels. The service guys from Canon asked me about 30$ to perform this operation.There is one good thing about this story: I have learned to listen to internet opinion.", "Date": "June 21, 2006"}, {"Title": "The bad override the good in this camera", "Author": "SergeIII", "ReviewID": "R24GAA7M3FQ105", "Overall": "1.0", "Content": "Besides its sleek look and compact size this camera has nothing good to offer. The digital quality of the pictures are POOR, it wastes  batteries way too fast and you can't zoom in.", "Date": "March 24, 2006"}, {"Title": "Cheap Value for a Cheap Price", "Author": "E. R. Brown \"Errol_44\"", "ReviewID": "R2HPSNHDJ54HNY", "Overall": "3.0", "Content": "I guess it's true that you get what you pay for.  The thing that really disappoints me about this camera is that the zoom function is not actually a zoom at all. It is actaually a \"cropping\" function.  \"Zooming\" with this camera actually reduces the size of your photo rather than giving you a full-size closeup. Very disappointed.", "Date": "January 26, 2006"}, {"Title": "HP M22 Camera- buy stock in battery company", "Author": "Elizabeth E. Peifer \"farmbiz\"", "ReviewID": "RN7VVO10Y76I4", "Overall": "4.0", "Content": "This camera takes great photos and is easy to use.  My 11 year old daughter loves it.  BUT.....  it goes through batteries like candy.  We have been using regular alkaline batteries and our recharger does not load them with enough power to be re-usable.  We are hoping to soon acquire a battery & charger set designed for the camera.", "Date": "January 15, 2006"}, {"Title": "Battery too low to take pictures", "Author": "Skip Savage", "ReviewID": "R3PQKG0QDZBA7N", "Overall": "1.0", "Content": "We also have experienced the disappointing \"battery too low to take pictures\" warning. Nothing wrong with the batteries, by the way. We checked them with our battery tester. Looking for help and will share with others if we find the solution.", "Date": "January 3, 2006"}, {"Title": "SPOILER ALERT digital camera's eat batteries", "Author": "Gerald Balmes \"Jerry B\"", "ReviewID": "R4T8H88F7VK5Y", "Overall": "5.0", "Content": "The HP M22 is most definitely a camera for beginners. It\"s a great camera to have if you are not too into photography but want to take some good pictures..As with the R717 HP Photosmart, the M22 has an Adaptive Lighting setting. The results are also quite similar to the R717 in that pictures usually appear warmer and with a slightly higher contrast than without the Adaptive Lighting setting.Besides Adaptive Lighting, there is also a zoom feature (digital zoom), flash, macro, and multiple shutter settings. In my first days with the M22, I actually found and used all of these settings without referencing the manual or quick start guide. Good job to HP for making a camera very simple to set up and get snapping.The M22 uses Secure Digital (SD) and Multi-Media Cards (MMC). I was able to use my 1GB SD card from my PDA and it worked just fine. Larger photos loaded slower, but after you went thru the pictures once, it seemed that the camera had no problem keeping up with scrolling thru pictures and videos.Image QualityFor the most part, I was pleased with image quality. Pictures with larger amounts of blue and green seemed to have a bluish cast to them when the Adaptive Lighting setting was activated.HP Photosmart M22[larger]HP Photosmart M222x zoom with Adaptive Lighting off [larger]HP Photosmart M222x zoom with Adaptive Lighting on [larger]One of the parts that I really liked about the M22 was the quality at which it took videos. Using my Palm T5 as a part time movie viewer, I was able to get a good idea of the quality of videos. If you have a steady hand, things will come out very well, and the microphone picks up the sounds that you intend to pick up. Of course, the length of the video is determined by how much space you have internally or on your SD card, so choose that length wisely.Desktop SoftwareAs stated in the beginning of this review, the M22 is designed for the novice photographer, or the person who just wants a simple digital camera for vacation shots. The HP Photosmart desktop software assumes this and leads you with well designed menus for all aspects that you would want to do with your photos, including editing, printing, and emailing photos.ConclusionI really liked this camera. And in the family members and friends to whom I took pictures of with the M22, they liked it as well. They spoke a lot about its size and the quality of the pictures. In my mind, that makes for a very easy sell. The M22 is best used for those who are occasional photographers, or those who really want to play Photoshop games with a summer graphics class. It's a very attractive model for a very attractive price. Not much to go wrong with here, but get rechargeable batteries.ProsCompact, easy carrying sizeVery good priceEasy to use out of the boxMenus and buttons well designed for all types of finger sizesConsLarger pictures take time to load when viewing on the cameraLimited internal RAM for photosSometimes a delay when taking pictures (but I have found this issue with many low end cameras)Spec Highlights  4MP CCD (can take photos at 4MPx Better, 4MPx, 2MPx, and VGA and videos at HVGA/320x240 pixels)  36bit Color depth  Lens: f/2.8 to f/6.5  Optical digital zoom, 3x magnification  Normal and Macro auto-focus  Built in Flash  1.5in LCD display  16MB NAND Flash memory (internal)  MMC and SD Card support up to 1GB  Shooting modes: Auto (default), Macro, Action, Landscape, Portrait, Panorama, Beach, Snow, Sunset  White Balance  HP Adaptive Lighting  Mini-USB connector  HP Photosmart M-series dock connector", "Date": "December 25, 2013"}, {"Title": "Not durable, battery compartment has brittle plastic catch.", "Author": "R. Scheel", "ReviewID": "R3G7U7W0SIM5ZE", "Overall": "2.0", "Content": "Took good pictures, but the plastic hooks for the battery compartment door broke after less than a year of use despite not being abused.  Even before that, the sliding lens cover was cranky.  I had picked it for my kids to graduate up to a better camera thinking the all metal body would help protect it a bit and the weather resistance would keep out contaminants, but it apparently needed to be carried around in a sealed and padded case.  I still keep it in our van for an \"emergency\" camera, but have not used it since cell phone cameras got better a couple years back...", "Date": "November 16, 2013"}, {"Title": "Quality camera for the price", "Author": "David J Ward", "ReviewID": "R16KSC2QSSQ18P", "Overall": "5.0", "Content": "I received it in a reasonable amount of time.Well packaged. I put the batteries in and it lit right up, but the time and date stamp adjustment could not be found which really is not a problem for the price as it has a section that allows that feature to turn on and off.Overall a quality camera for the price.I just wish it would take more than 4 pictures without having to add a card.", "Date": "September 20, 2013"}, {"Title": "GOOD STARTER CAMERA", "Author": "James B. Johnson", "ReviewID": "R280QYTSAJJ602", "Overall": "5.0", "Content": "Bought my M22 in 2005. Still works good. No problems. Battery life is good. Pix are good quality. No complaints.", "Date": "October 4, 2012"}, {"Title": "UNWISE PURCHASE", "Author": "William Reynolds", "ReviewID": "R3NSPLFFVMC63H", "Overall": "1.0", "Content": "CAMERA ARRIVED WITHOUT INSTRUCTION INFORMATION, TWO DEAD AA BATTERIES, NO CABLES, A MISSING COVER ON A BOTTOM PORT.DATE ON CAMERA WAS 2005, WHICH WOULD MEAN IT SET SOMEWHERE FOR SEVEN YEARS. THE FLASH DOSEN'T WORK AND THE PICTURES ARE GRAINY. NO WRIST STRAP. BAD PURCHASE.", "Date": "March 29, 2012"}, {"Title": "chuck wagon party", "Author": "gram81", "ReviewID": "R11KGZ8JHTDDDH", "Overall": "5.0", "Content": "I had a chuck wagon party for all the residents and took many pictures in their cowboy hats and bandanas and they came out beautiful, they each got their picture and loved them, it is a Assisted Living Facility,and we have many activities and I take a lot of pictures.  RoseMary Hove", "Date": "October 14, 2011"}, {"Title": "Someone needs an education", "Author": "abc123", "ReviewID": "R1ERGKWTKNBDUK", "Overall": "4.0", "Content": "I've owned this camera for two years and haven't had one problem with it.  My batteries usually last 400-500 shots.  Very few of my pictures have ever turned out bad, and those that did were operator error.  The only problem I have ever had with it is the red-eye.  I have added photos on this site that you can view....you can see for yourself.  I just \"don't get\" the bad reviews that other people have put in.", "Date": "December 26, 2007"}, {"Title": "I love my camera!", "Author": "Happy as a clam \"Kristen\"", "ReviewID": "R15TYMNAGT4W1", "Overall": "5.0", "Content": "I have had my camera for about a year now! You can't use regular old AA batteries, you have to spend the extra few dollars and get the energizer lithium batteries. Then you can get about 100 pictures from the batteries.  I have dropped my camera a million times, and it still works perfectly. The camera I purchased before this one was a kodak easyshare, and it was horrible, it just shut off ALL THE TIME.  So I am happy I picked a good camera the second time around! Also you can get cheap SD cards from amazon, try searching for them.  They are usually like 80% off =) Not a bad deal.", "Date": "November 23, 2006"}, {"Title": "Complete Garbage.....ZERO STARS", "Author": "Nate", "ReviewID": "R15W2W1Z7MNVIW", "Overall": "1.0", "Content": "My cell phone takes better looking pics then this thing does. I was trying to capture the way my girlfriend looked one night because she looked great. The lighting in the room was just right. First, I had to change the batteries. Then, every picture I took made her look horrible. I tried every setting I could find. I turned the flash on and off and adjusted every single thing on the camera. Most of the pictures were extremely blurry. I actually ended up using the camera on my cell phone.", "Date": "May 13, 2006"}, {"Title": "Pure agravation", "Author": "Joshmax", "ReviewID": "R11UKCZ4RTYJO4", "Overall": "1.0", "Content": "I bought this camera for my daughter's birthday.After capturing several pictures the camera kept on showing 'batteries are depleted', I changed the batteries, bought rechargeable batteries (per their recommendation), nothing helped.They sent me a new camera which stopped working altogether after several uses, upon which they sent me another one, which flickered and turned off when turning on.Finally I called them and said I need my money back, I was offered a m407. It's supposed to arrive tomorrow, I'm not too confident about it.", "Date": "March 20, 2006"}, {"Title": "Battery is the only problem", "Author": "C. Chow \"Fast computing\"", "ReviewID": "R130ZGR1COFFJY", "Overall": "3.0", "Content": "With 4MP, the camera took good quality pictures.  Also, a small size camera with its metal case allows me to carry it all the time to take pictures with my son.  However,  the battery is the major problem,  I put in 2 brand new alkaline batteries,  it still give me low battery message and won't allow me to take picture.  Put in fully charged Nimh batteries, it will do the same thing until I reset the camera.  However, same message display randomly when you turn on the camera. It is confusing.  I will try to upgrade the firmware which was released Dec 2005 from HP website.  If it does not fix the issue,  I may retrun it.", "Date": "January 3, 2006"}, {"Title": "Poor Quality", "Author": "Tom Luongo", "ReviewID": "R2569WB6Q6WQUV", "Overall": "1.0", "Content": "Picture quality is very mediocre.  As other posters have noted, a little more money gets much more bang for the buck.  A friend recently bought a Canon Powershot A520 and it seems like much more camera for the money.A firmware upgrade is causing a premature \"Batteries are depleted\" message.  See - [...]Pros - Compact size.  Weather resistant.Cons - No optical viewfinder.  I guess that's a size tradeoff.  Poor picture quality.  I usually shoot with a D70, but even for the money the M22 doesn't seeem like a good value.", "Date": "February 6, 2006"}, {"Title": "Nice camera (when it works!)", "Author": "Mrs Baboo", "ReviewID": "R28DDYKI1DJ90U", "Overall": "1.0", "Content": "I've spent a small fortune on batteries for this camera and tried new and rechargeable batteries. It's gotten progressively worse and now (after 2 years) the camera turns on only occasionally and even then only when it's plugged into the battery charger. It's a shame because it's a nice camera when it's operating.Don't waste your money. Now I have to buy a new camera. You can bet it won't be an HP.", "Date": "March 31, 2007"}, {"Title": "Hunk of Junk - eats batteries, short warranty", "Author": "PJ", "ReviewID": "R2WGSDCWQ1F8P2", "Overall": "1.0", "Content": "We wanted a smallish idiotproof camera b/c one person in the family was a bit intimidated by our Canon's many options.  The HP was reasonably priced and seemed to fit the bill, but was a big mistake.The first set of photos, indoor, came out really poor and yellow-ish.  After that every time we tried to use it it was dead - it seemed to eat batteries (freshly charged rechargeables)  just from sitting around for a week or two.  We'd open the little door, but no red light.  When we put freshly-charged OR new alkaline AA batteries in it and tried to use it immediately it worked only occasionally - it would take proably 3-4 battery swaps to actually work.  These are the SAME rechargeable batteries we use in the Canon and in other devices, with NO problems.All in all we've used it THREE times in almost a year - the initial set of yellow-ish shots, a few outdoor shots that worked ok, and a few indoor ones that were also ok.Today we decided to check on warranty repair since it's almost one year old, and guess what, it has only a 90 day warranty!  Hmmm...it's not too hard to figure out that HP didn't put much faith in this camera.On the positive side, when it worked it did work easily, and it was easy to download the photos onto our Macs.  Unfortunately, \"when it worked\" is the important phrase here - it seldom worked, and after seeing other reviews with similar battery problems, it doesn't seem that ours is unique.  Too bad we didn't get smart and read the reviews before buying it!We're going to get another Canon and the non-tecchie in the family can just set it at auto and leave it there.", "Date": "February 24, 2007"}, {"Title": "Do not buy this camera", "Author": "Alison", "ReviewID": "RRR8JVGCYRK93", "Overall": "1.0", "Content": "The camera is a piece of junk.  I wish I could change my number of stars to 0.  I previously wrote a good review of this camera because it started out working great.  Now, you can't take a CLEAR picture of anything unless it is resting on a flat, non-moving surface.  Otherwise, good luck trying to make out whatever is in the picture. Everyone who has used my camera has told me that it is terrible.I bought this camera as an \"upgrade\" from my previous HP 3.0 megapixel camera.  I want my old camera back!  I don't know if this is just a poorly made model because I haven't had problems with any other HP cameras.  Do yourselves a favor, save yourselves some money, don't buy this M22.", "Date": "July 2, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "4-megapixel CCD captures enough detail for photo-quality 11 x 17-inch prints\nWeather-resistant, all-metal body; 1.5-inch LCD display\nSoftware-free, in-camera red-eye removal\nMPEG-1 movie with sound at 25 frames per second\nStores images on SD and MMC memory cards; 16MB internal memory", "Name": "HP Photosmart M22 4MP Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/413X4ZK6KTL._SX300_.jpg", "ProductID": "B0007PNK00"}}