{"Reviews": [{"Title": "Nikon D300", "Author": "Robert E. Jenkins", "ReviewID": "R3FG37XNMU5XGH", "Overall": "5.0", "Content": "The move to the Nikon D300 was made to take advantages of the newer features that were not present (especially the greater pixel capacity) in the D100 which I had for several years.  It was time to move up.The screen is larger with the ability to display additional information regarding exposure etc. The controls are neatly arranged and handle better than the D100 and it is more comfortable your hands.  Auto focus and exposure metering are much more advanced over the D100.While I am still very much in the \"learn mode\" with this camera I am satisfied the move was worth it.  Having not moved to the D200 when it came out I cannot comment on the value of moving from that model to the D300.I had shopped around on the web only to find multiple cases of much lower prices but they did not include the typical box items of the charger, battery etc.  In this regard be careful of the lo-ball prices.", "Date": "January 7, 2008"}, {"Title": "Amazing Camera !", "Author": "Pedro Paiva", "ReviewID": "R3M9H9OIW1IBSJ", "Overall": "5.0", "Content": "This is the best cost/benefit camera in the market today.I bought this kit with 18-135 lens but if I was to buy now, I'd rather go for the more expensive kit with 18-200 as its a better quality lens and more versatile zoom length.If you can afford it, BUY IT, you will not regret the investment.Bought mine at amazon.com and have no complaints about it. Delivered on time just before Christmas.", "Date": "January 7, 2008"}, {"Title": "Who needs a $5000 D3?", "Author": "Martin L. Howard", "ReviewID": "R3PD7WIE2O4D5E", "Overall": "5.0", "Content": "The D300 is fabulous. Nikon has given the serious amateur/professional a great camera at a very reasonable price. I can't imagine what the D3 does for $3000 more but I don't want to find out. This will be the last camera you ever need (at least until the D400 comes out).Quality and features are what you expect from Nikon. I particularly like the burst modes although you need a fast card to keep up.I recommend this camera to any photographer without any reservations.BTW, I bought mine off Amazon. No kickback from them or Nikon, unfortunately.", "Date": "January 7, 2008"}, {"Title": "Nikon d300", "Author": "JGS \"JGS\"", "ReviewID": "R1BB3UWKB9HO4V", "Overall": "5.0", "Content": "The camera has lived up to the professional reviews that I read during my research. The high ISO performance has been outstanding. My main use so far has been fast action sports (volleyball) inside low light gyms where flashes are not permitted and I have gotten very nice action shots. For those who never venture off the automatic setting of their current camera, I would not recommend this camera since it does not even have one. There is a learning curve, but it is well worth the effort.", "Date": "September 13, 2008"}, {"Title": "This Camera rocks!!!", "Author": "Paul R. Easter", "ReviewID": "R3TLQIG2VM8JKH", "Overall": "5.0", "Content": "I have used this camera professionally since 2008 and it paid itself off several times with all the lenses, two flashes sb800 and the 900! If I upgrade I will not sell this camera it is tough and reliable the Matrix metering is great. Great color, fast focus and awesome for time lapse HDR Photography. There are more expensive cameras with more features and bling but this camera will make 20x30 color prints look fantastic!", "Date": "June 29, 2011"}, {"Title": "Amazing!!!!", "Author": "clicker \"d sam\"", "ReviewID": "R2FOXE1SQI2IOQ", "Overall": "5.0", "Content": "very happy with amazon it arrive on the promise date and well packed, since I got back from a trip I had it for two weeks and very please with it take great shots outdoor as well as indoor thanks Buy Accessories you need to show your web page so we can recommend it to our friends", "Date": "March 3, 2009"}, {"Title": "Nikon D300", "Author": "Gerd Benndorf", "ReviewID": "R1454GH83PRE4D", "Overall": "5.0", "Content": "Excellent camera, for professionals and hobby photographers. I had the Nikon F301 for the last 20 years, and expect that the D300 will bring me as much pleasure for the next 20 years...", "Date": "April 14, 2008"}, {"Title": "Nikon D300", "Author": "Jonathan B. \"Jonathan\"", "ReviewID": "RAFDUC8N3NUIR", "Overall": "5.0", "Content": "Fantastic Camera that just keeps getting better every time I pick it up. I waited for years to jump from 35mm to digital SLR, scary jump when you think how fast technology leaps forward. The Nikon D300 has more features than I know how to use, guess its time to take a digital photography class. I am getting that rush that came long ago with taking pictures and the results are awesome.", "Date": "March 9, 2008"}, {"Title": "Top notch high end amateur camera from a superior seller.", "Author": "Foto Gato \"critical amateur photographer\"", "ReviewID": "R10FVMT2EEQSKC", "Overall": "5.0", "Content": "Other reviews have gone into depth with the d300's superb technical features. They should be carefully considered. This is not a camera for the casual amateur. There is no fully automatic control that casual amateurs use probably 99% of the time. This camera's strengths are in the shooter's ability to control the extensive capabilities that Nikon has designed into the d300. One doesn't learn this camera overnight.  Pros should find the d300 a challenge and valuable tool as well. For me this is a great step up from my d70. And, I can use all my Nikon lenses from my film shooting days. I also want to praise Photoworld, Amazon's sales partner, for the prompt and thorough handling of the order, especially when a problem occurred. Photoworld had processed the original order within 24 hours and shipped via UPS. When I saw no UPS tracking action beyond the pick-up notice, I contaced Photoworld which contacted UPS immediately. After a UPS trace failed to locate the shipment, Photoworld shipped a replacement immediately. Photoworld is a model of superior service.", "Date": "February 12, 2008"}, {"Title": "excellent  camera ,on time delivery", "Author": "Giuseppe Vaghi \"giuseppe\"", "ReviewID": "R6WXQFSKWOH3I", "Overall": "5.0", "Content": "d300 is a state of the art camera and amazon delivered in two days at the best price ,100%recomendable", "Date": "May 15, 2008"}, {"Title": "Superb camera", "Author": "Andrew Poupart", "ReviewID": "R4N7Y3PR1RELP", "Overall": "5.0", "Content": "I'm not going to waste your time by writing a long review. This camera is worth every single penny. Buy it. Shoot it. Be happy. Simple as that.", "Date": "December 6, 2007"}, {"Title": "Best Budget DSLR", "Author": "E. Senturk", "ReviewID": "R2VM2XI1WLMF9H", "Overall": "5.0", "Content": "D300 is my first dslr and I am so happy with that. I bought it with the 10-135mm lens and it is perfect for everyday shooting. My last camera was Coolpix 8800 and I am not going to compare it with d300. If you are planning to buy your first DSLR, D300 is the best.", "Date": "September 1, 2008"}], "ProductInfo": {"Price": "$2,199.99", "Features": "12.3-megapixel captures enough detail for poster-size photo-quality prints\nKit includes 18-135mm f3.5-5.6G AF-S DX ED-IF Nikkor zoom lens\n3.0-inch LiveView LCD display; new 51-point AF system\nIn burst mode, shoots up to 100 shots at full 12.3-megapixel resolution\nSelf-cleaning sensor unit; magnesium alloy construction with rubber gaskets and seals", "Name": "Nikon D300 DX 12.3MP Digital SLR Camera with 18-135mm AF-S DX f/3.5-5.6G ED-IF Nikkor Zoom Lens", "ImgURL": "http://ecx.images-amazon.com/images/I/41l5lG1W5EL._SX300_.jpg", "ProductID": "B000VR9V3E"}}