{"Reviews": [{"Title": "DSC-H1, Very Nice", "Author": "J. Mader", "ReviewID": "R3Q6A0FH2QS6EU", "Overall": "5.0", "Content": "I can't tell you how long I've spent agnonizing over which camera to purchase. At first, I bought the Dimage Z5 and I wasn't satisfied so I returned it. I began to look at both the S2 IS and DSC-H1. From most reviews, the S2 IS came out slightly ahead of the DSC-H1. Though dpreview actually gave the lead to the DSC-H1. What really matters to me is image quality and I could not tell a difference between the sony and the canon. So, I figured with all of the rave reviews both camera's were getting and the fact their image quality was very similar, it'd be best to go in-store and see which had the best feel. I found the S2 IS to be a bit cumbersome, especially with a lense cap that easily fell off. Also, I didn't like the button arrangement or the way the S2 IS felt in my hands. I think when @ full zoom taking pics of birds or other small animals a larger screen will make it much easier for you to find the shot you are looking for. Plus the Sony screen can be seen quite well in bright light. Plus the S2 IS has a bit of a red-eye problem, which the sony does not. The DSC-H1 feels a bit stronger and is very easy to grip. The photos from the camera are excellent right out of the box, so you can be a novice and still take near d-slr shots. In the end, the DSC-H1 felt better, had a nice 2.5 inch screen which made the S2 IS screen seem puny. As you can see from the photos I've submitted, the pics are very nice.", "Date": "July 13, 2005"}, {"Title": "I absolutely love this camera!", "Author": "D. Day \"novice photographer\"", "ReviewID": "R3C17O3E7O2ZLO", "Overall": "5.0", "Content": "I've had the H1 for almost 2 weeks now and i've never taken so many pictures in my life. The H1 is such a pleasure to use. It fits perfectly into my hand, all the controls are right there, no deep menu so that you're fumbling around with settings trying to get the 'best' shot. The great thing about the H1 is that the pictures straight from the camera are awesome. Almost no post-processing has to be done. The colors are vibrant, the images are sharp as a tack and very very little noise can be found (in dark areas or shadows).You can leave all settings in auto and use it as a basic point & shoot camera or you can experiment and learn by using the aperature, shutter speed and manual controls. With the HUGE 2.5\" LCD you can see the adjustments made instantly and how it will affect the picture. The live histogram is another feature that I honestly thought I would have no use for but surprisingly..I am learning from it.The 12x zoom is fun to use. I'm getting shots that I would have never been able to do before. And, with the added Image stabilization...most can be shot handheld!For the person who has always used a digital camera set in auto and wants to learn more about photography (like me) this camera is perfect. And for the person who just doesn't want to mess with the manual controls, well this camera is STILL perfect. You will not see better images unless you're looking at a full on DSLR camera.....which will cost at least a good $1000. For at least half the price and the most fun you will ever have with a camera, the Sony H1 hits the spot.Cons: To be fair I have to say that the size is a little bigger than I would have preferred. I like to bring my cameras with me everywhere so they've always gone in my purse or a pocket. This one DID fit in my purse, albeit a tight squeeze, but I don't feel that it's good for the camera. I went out a bought a leather backpack which is very fashionable and I use that instead of a camera bag.Because of the excitement and the excellent results i've gotten so far from this camera the last con would be....accessories. So far, I have purchased 2 tripods (for nighttime shots), extra batteries, the backpack, a UV filter and I've got my eye on the tele lens to add even more zoom. I find myself wanting every accessory for this camera.You can't go wrong with the Sony H1. Just try it, you'll see. No matter which digicam you do choose, remember to just get out there and have fun with it! Photography should be fun not a cumbersome chore!Happy picture taking everybody! =)", "Date": "July 12, 2005"}, {"Title": "Solid Performer - Great \"Out of the Box\" Pics!", "Author": "Tech Guy", "ReviewID": "R3I8FRAZ8RQ7BC", "Overall": "5.0", "Content": "I've had the H1 for two months and am thrilled with it.  It's been very reliable and produces sharp, punchy, low-noise, vibrant images right out of the box.Like others, the hardest decision was deciding between the Sony H1, Canon S2 IS, and Panasonic FZ20 & FZ5.  I ruled out the Panasonic due to it not using AA batteries and having poor motion video features.  The choice between the H1 and S2 IS was much more difficult, and I spent a lot of time reading all the online reviews, viewing online sample photos, and trying both in the store.When the smoke cleared, I chose the H1 and have been extremely happy with it for the following reasons:Pros compared to the S2:- Solid construction, felt very good in my hand (good ergonomics)- The most punchy, sharp, and beautifully VIBRANT photos right out of the camera I've ever seen for this price level.  I don't have time to post-process every shot, and most of the H1's photos are good enough to print straight out of the camera!  The color tone curve is amazing:  Vibrant reds, deep blue skies, good facial tones, etc.- Noticeably lower noise per ISO setting compared to the S2 IS (Canon takes a more \"purist\" approach by leaving the noise in, which preserves more detail but requires much more post-processing than I wanted to deal with)- Powerful auto pop-up flash with virtually no red-eye, even without using the red-eye mode (Canon S2's weaker flash has more of a red-eye problem, and the S2's flash doesn't pop-up automatically so you could blow an important shot)- Lens cap stays on tight compared to S2's, which reportedly falls off easily for many of its users.- Large, bright 2.5\" LCD display works in bright sunlight and gains up somewhat in darkness (The S2's twist-out 1.8\" LCD, while slick and versatile, was too small to see the image or menus well)- Metal tripod screw mount (S2's is plastic)- Front-mounted clickable jog dial is easy to use for manual and semi-manual exposure settings and flipping through photos during review- Liked how the zoom controls and shutter button felt -- slightly firmer than S2 for more tactile feedback.- Super bright low-light AF lamp is awesome! (Although your subjects may complain about the extreme brightness.) Flash pictures taken in complete darkness within the AF lamp's considerable range came out focused every time.- Live Histogram helps you take proper exposures (S2 lacks live histogram, only shows it after you take picture)- The H1 didn't tend to overexpose photos like the S2's tendency (some of the S2's bright daylight shots looked slightly washed out in the online reviews sample shots).- Battery life is good compared to the S2 once you compare the H1's 2 AA's to the S2's 4 AA's (so just bring another set of AA NiMH's to even it out, they're cheap to buy).Cons:- The H1's movie mode gets approx. 50% more footage on the same memory card (which is good), but the S2's video quality, movie zooming, stereo sound (H1 is only mono), and still option during filming blows the H1 away in comparison.  H1 can't zoom while filming, only right before to set composition.  The H1's movies are fairly good, but not as stellar as those from the S2.- No remote for tripod or remote shots (but can use the 10 sec. timer to eliminate tripod shake)- Included software is sub-par compared to that bundled with the S2.  If desired, you can buy much better photo editing software.- In movie mode at full zoom, the H1's auto-focus continuously hunts back and forth, causing your subject to go in and out of focus.  Solution: Use the manual focus mode, which works MUCH better at full zoom and makes it usable again.- I perceived the H1's image stabilization, while good, was not quite as good as the S2's, but it's still fairly close between them.- H1's 9-frame burst mode is more limited and slower than the S2's unlimited burst.  I don't use burst mode often, so it wasn't a deal-breaker for me.- No in-camera panoramic stitch assist like the S2, but one can use free programs like AutoStitch to accomplish same.Overall, I wanted a 12X zoom camera that took GREAT pictures with little or no post-processing, with a longer-reaching automatic pop-up flash, lower noise, no red-eye for lots of indoor family shots, and better hand feel and easy controls.  To me, the photo quality is the most important, not the looks of the camera, not the cool features, etc.  I simply felt that while the H1 doesn't have as many bells and whistles as the S2 IS, Sony just did a noticeably better job in the camera fundamentals, which is what you need to take good photos.For my personal needs and preferences, that's why I've been extremely happy with the H1 -- best camera I've ever owned, although I'm only an amateur.  You'll need to do a similar evaluation to match your needs and preferences with the right camera for you.", "Date": "September 5, 2005"}, {"Title": "The top 12 Until the Z-30!!", "Author": "Sinister Minister", "ReviewID": "R2HRKH39O3XGT", "Overall": "4.0", "Content": "Yes thats right, the undisputed king of the mega-zoom cameras is Panasonic's FZ-30. But what about before then? Well my friends before then we had two contenders for the mega-zoom crown the Sony H1 and the Canon S2IS. And right up until the Z-30 came out the H1 was giving Canon a sound butt whoopin! Reason being is that it always seemed to me that Canons strongest selling point was that the S2IS could zoom in and out while you made film clips and it recorded in stereo sound. Uh we were talking about a digital Camera right? See I don't give a damn about film clips I'm a photographer, I take pictures not movies and if I was going to make a movie I am the kind of person that would use a camcorder (what the heck Am I thinking?)I own the Z-30 and the H1 and have done shot comparisons with these using the S2IS. The H1 is probably one of the neatest compact cameras I've seen in a long time It is larger but not to the point of being too large (I've seen more compact camera folks going home with these lately!)Has a nice sized LCD screen as well as a decent EVF with diopter adjustment, All the controls on the camera are sane and well placed. And, the lens wich strangely is not a Carl Zeiss (first in nearly 10 years) wich has minimal barrel distortion at wide angle, super smooth and fast focus, as well as producing clear well exposed images!To be honest the H1 reminds me alot of my long lost DSC-F707 as far as picture quality and function. Its ships with Sony's uncanny ability to make a picture lookgreat no matter what the situation, That, by the way is why you don't see Sony cameras with 2000 scene modes...they just plain don't need 'em.The menu systems are easy to navagate and look and operate pretty much the same as always, with the exception of having to set the camera up to use extension lenses in the \"set-Up\" menu. Now when talking 12X zoom the big deal is stabilization, because without it all that extra zoom power is just about useless. Now keep in mind stabilization is intended to minimize the movement you make when your TRYING to keep your hands steady! In low light settings youre still gonna need your tripod (sorry!) So who's works best? Panasonics. Neither the Sony or the Canon Produced stellar results in image stabilization. How well either performs will depend on how bright the shot is and weather or not you got the DT's or something! The Sony also uses only 2 AA batteries to Canons 4 yet gets the same number of shots per charge, has a larger LCD screen and a faster start up time. Another big bang for your mega-zoom buck is that the Sony H1 comes with a conversion lens adapter (Canon Does Not) when you attach a Sony teleconverter lens to the camera your zoom maximum goes from 420mm to a whopping 728mm! (Canon does not)There are telephoto, wideangle, and macro conversion lenses available. (not for Canon)Shot to shot, and burst modes are about the same as other Sony point and shoot models, Its not lightning fast but it ain't slow either.Down side is that the stabilizer is not consistant and at times can have a hard time finding focus in lower light situations, (Canon had this also), Also there is no hot shoe on the camera and to make matters worse the pop-up flash isn't high enough to prevent shadowing in certain cases, The lense adapter and hood are cast in plastic and have a rough appearance but work fine, there is also a memory card door so you can remove the card without having to remove the batteries.You must also remove the lens adapter and hood to attach the lens cap effectively.  Aside from these few things, I have found the H1 to be a great little family camera ( and I think thats who it is designed for, Families.)Now I am not saying that the S2IS is a bad camera its not, I am saying that if you want a camera who's focus is on your images and its video capability the R1 is it.Not long ago I had put the mega-zoom catagory up in a list I will repeat my updated list here.1.(best overall) Panasonic FZ-30 (8MP)2.Sony DSC-H1 (5.1)3.Samsung Digimax Pro-815 (8.2MP)4:Panasonic FZ-20 (5MP)5.Canon S2IS (5MP)As you can see the pro 815 is the new up and comer, but then again it is a huge camera!To wrap this up the H1 builds on and extends Sony's long tradition of building great point and shoot cameras, that take great pictures.With fantastic battery life and great features combined with a great clean, sharp lens the H1 lands solid in slot 2. It makes a great family camera, as well as a great solution for a novice looking for something affordable with a little more power.Thanks for looking and Happy Shooting!!", "Date": "November 21, 2005"}, {"Title": "Excellent Ultra Zoom!", "Author": "8Kids", "ReviewID": "R2MA3Y9W348XZR", "Overall": "5.0", "Content": "I have owned the Sony DSC-H1 for over 2 months now and I have been very pleased with the results.  Before I purchased, I read countless reviews and spent hours researching which ultra-zoom to buy.  It finally came down to the Sony DSC-H1.  I chose it over the Canon S2-IS because the Sony is a better deal.  The H1 includes the following accessories in addition to the ones that are included with both the Canon and Sony: 2100mah rechargeable batteries and charger, lens adapter, lens hood, and 32mb of internal memory (vs. the 16mb card that is included with the S2.  So, for less money you get rechargeable batteries, a lens adapter, lens hood, more memory, and a 2.5in LCD!  (Even the tripod socket on the H1 is metal while it is plastic on the S2).  So you see the H1 (for me) seems like a way better deal than the S2.The H1 is built very well.  It feels very good in the hand and it is very solid.  The large hand grip and lens barrel make it a joy to hold.  The battery door is very solid and doesn't feel like it will break even with heavy use (there is also a nifty hinge in the middle of the battery door that allows you to swipe memory cards without letting the batteries fall out; you can even change cards on a tripod)!  I recently went to Wal-Mart and while browsing around, I decided to look at the cameras just for curiosity sake.  Side by side they had the S2-IS and the DSC-H1.  I picked up the S2 and it didn't feel like a solid, expensive camera like the H1 does.  And then there's the LCD.  After using the 2.5 in. screen on the H1 for a month, I saw just how small the 1.8 in. screen is!  It is so small that it is very hard to see the details of your shot, both before and after you shoot.  So, once you try the H1 you won't want to go back to a small LCD!The camera is very easy to use.  The controls are well placed and with a little practice you can operate the camera without removing your eye from the viewfinder (or LCD).  The flash is very powerful and far reaching; it can be turned down for shooting closer subjects.  Some people complain about the slow recycling of the flash.  It is a little slow but I don't really mind; it doesn't take as long when you have it on low, which is what I use most of the time.  It is only slow at the normal and high levels, but that is expected with having such a powerful flash.  This doesn't bother me as I take mostly outdoor photos (that's why I wanted a 12X zoom)!  If you will be taking mostly indoor shots then you may want to look somewhere else.The 2.5 in LCD makes shooting a real pleasure!  It is bright, clear, and gains up in low light (it doesn't gain up as much as some cameras, like Kodak, but it gains up enough for me).  I also bought a screen protector on eBay to protect the LCD from scratches and fingerprints.The zoom lens is smooth, fast, and has many stops to make precise adjustments.  With 12X you can really do a lot more!  There is some controversy over the lens not being very high quality.  I have not found this to be true.  Most of my shots come out sharp and clear (the occasional shot that is blurry is usually my fault; too slow of a shutter speed, etc).  The Image Stabilization is incredible!  It makes it that much easier to get that low light or far off shot that would have been impossible otherwise.  I couldn't be happier with the quality of the shots that this camera puts out.  The movie mode is also very nice.  It is very high quality also.  It is fun to take movies of some things that you just can't photograph.I have to admit that I was tempted by the Panasonic FZ5 but the small screen, lack of manual focus, and the odd design just didn't appeal to me.Now, on to the accessories:I bought an extra set of batteries for $6 and 2 extra 256mb cards for about $40, and now I am all set for shooting pleasure.  Don't get turned of because of Sony's use of MemorySticks.  Even though they used to be more expensive then SD, they are rapidly falling in price and if you search the internet, you can easily find them for less then their SD counterparts.I also bought a Tamrac Digital 6 camera bag to put everything in and it fits the bill!  I bought this case because it fits the H1 with the lens adapter on (I want to leave it on all the time to protect the lens).  Be sure to check out this case for the H1 as a very high quality alternative to the low quality Sony case (at only $18 this Tamrac case is a bargain)!All-in-all I think that this is a super camera and I am very glad that I bought it.", "Date": "April 12, 2006"}, {"Title": "awesome camera for the budding enthusiast!", "Author": "bombkis", "ReviewID": "R3MWAL4XTNKF1H", "Overall": "5.0", "Content": "i'm not a professional, i'm what i would call a beginner photography enthusiast. i read photography magazines, photography books, and online reviews of digicams regularly.i have had a chance to own both the Canon S2 and the Sony H1 for a month and i can definitely say that you can't go wrong either way, they are both amazing cameras. but i kept the sony and returned the canon...Here's why (nonprofessional personal preference only):1) looks and feels more expensive/professional (got more oohs and aahs). most people could guess the Sony cost around $500, but some people thought the S2 was \"around $250\".2) uses only 2 AA batteries instead of 4 AND comes with 2 rechargeable NiMH batteries (canon provides only alkalines-- uesless!)3) but the main reason was the big LCD screen which made framing pictures outdoors and in the sun much more enjoyable, not to mention showing off the pictures (2.5 inches instead of the 1.8 on the canon)4) got better results right out of the box5) i like the extra dial-knob (similar to the dial knobs on the sony clies) that controls the manual settings on the H1 which works much faster and more intuitive than the canon (manual settings are controlled by the four-way buttons on the back of the camera)...however, on the other hand, the main thing i miss from the canon is the memory format (secure digital is MUCH cheaper than sony memory sticks) and i miss the ability to zoom while shooting movies (which you can do on the canon)...", "Date": "August 30, 2005"}, {"Title": "GREAT value!", "Author": "K. Abbott", "ReviewID": "R3SQP9W0VKFDXG", "Overall": "5.0", "Content": "I had a digital that was a couple years old and was looking for a nice camera for an upcoming vacation.  I spent many hours reviewing different cameras on the market.  This camera is a little pricey, but well worth it.  The optical zoom was the quickest of any of the other cameras I tested.  The combination of 5.1 mega pixels and the 12x optical zoom produces some of the best digital pics I have seen.  When buying this camera, buy the Energizer 15-minute charger with 2500 Energizer batteries.  These batteries last long and recharge in no time.  I got mine at Target for about $30.  This is a camera that is easy to use for beginners but offers endless features for people looking to devote the time to really get to know it.  Bottom line, this is a great camera.  Sony could charge more for it.  Great value.", "Date": "November 8, 2005"}, {"Title": "Great camera", "Author": "K. Dixon", "ReviewID": "R3JL64RU6FV0K", "Overall": "5.0", "Content": "I have had my first digital camera, a Kodak dc280 for almost 6 years. It was definitely time for a new one. I decided to go with a Sony because I had recently purchased the Cybershot DSC T33 for my daughter, and loved everything about it, except the small size.  The DSC H1 is a great camera. It is a nice size to be able to hold steadily in your hand, and is the same shape as the SLR cameras I am used to. I have a difficult time holding the smaller cameras still, and in low light conditions, that makes for a very blurry pic.  The camera was very easy to learn how to use, and with my Windows XP all I had to do was connect with the USB cord, and the computer recognized the camera right away....no long software downloads, unless you want to install the picture imaging software.  I love the 2.5\" viewing screen, and the fact that I can switch over and view through the lens also. The 12x optical zoom is great. My daughter loves her own Sony camera, but keeps stealing mine for the zoom!", "Date": "August 31, 2005"}, {"Title": "Happy with the purchase, not with some of the pictures...", "Author": "Amazon Customer", "ReviewID": "R1L52OYCXZITCP", "Overall": "5.0", "Content": "I bought this camera six weeks ago after doing about a year's research into the digital camera market. After using my Canon EOS E2 for the last four years, it has taken some adjusting to get used to some of the features and the smaller size of this digital. I've now used it in several situations and I am very pleased with my purchase.First off, the good...The camera itself is small enough to fit into a purse, but substantial enough to feel solid in your hand. The LCD display is HUGE and very clear and allows you to actually preview the pics you've taken. The overall set up of the camera is very user friendly and I especially like the function knob and the jog dial. I have found that with this new generation, the response time has improved greatly and it doesn't take forever to turn on or off. It also does an excellent job of recording quickly to get to the next picture. The AV output is a nice bonus for a mid-range entry camera and is a cool feature to show people their pictures immediately or to view pictures with everyone after a day of sight-seeing. One of my favorite options is the automatic bracketing that can be set for either the shutter speed or the aperture. The bracketing is really required because of some of the auto metering problems, which brings me to...The not so good...the auto meter has problems in that it over-exposes basically everything, except on sunny days, when it works the best. Watch out for those cloudy, overcast days. Also, the shutter speed tends to be a little on the slow side in the full auto modes (including the flash), so those sometimes come out too blurry. The manual focus feature is confusing and rather hard to use, especially if you're used to the traditional SLR manual focus.  The multi-burst mode has some focus problems so be careful when using that, especially in high speed action settings. I used it at a MLB game and the wider shots for the base runners did not turn out well, but the close ups of the pitchers in their wind-ups were really impressive.I have yet to use the movie, steady cam, and organization features on the camera. A few comments were made by other reviewers that the steady cam feature does not allow to take good pictures. It does, you just have to be willing to use the manual features more than the auto features.I've really enjoyed using this camera so far but keep in mind you won't be able to use all of the features right out of the box. I found that the pictures that other users have posted here are representative of the pictures anyone can take with a little bit of knowledge and patience. Check out some the digital photography review websites (dpreview) for some more comparison info on this and other cameras.", "Date": "October 23, 2005"}, {"Title": "Best in Class", "Author": "Chase N. Trimble", "ReviewID": "R1RN8AK39YK4GN", "Overall": "4.0", "Content": "What impressed me about the DSC H1:Huge 2.5\" LCD screenAlmost instant power upQuick focusingEasy zoom button (not twitchy like Canon's S2)The jog wheel on the top front of the grip (great when cycling through pictures)Low noiseThe manual settings (aperature, shutter speed, white balance)Crisp, colorful pictures.Bracketing button (takse 3 pictures in succession, each with different exposure values, making sure you get the best exposure possible)Recommended accessories: extra NiMH batteries, hand strap for better grip, UV filter to protect lens from scratches, carrying case, screen protector, wide angle lens.", "Date": "September 29, 2005"}, {"Title": "never miss another shot again", "Author": "J. Jones \"NyMensan\"", "ReviewID": "R2E05HAK8KV6U3", "Overall": "5.0", "Content": "I've had the camera about one month and it has never produced anything but the best pics I've ever taken.A zoom camera is now a must-have in my opinion. For years we've missed shots at school plays, church events, etc since seating is often too far away for 3-4x zoom. With this Sony cam, we capture all those shots important to parents, I didn't believe that a camera could catch the sharpest details of my sons expressions during football games,even at a distance, but this camera does that every time.Sharp, bright, and fast. When you press the button on this cam, there's hardly a lag at all before the pic is taken, my old cam had such a delay that the object in the viewer was always gone by the time the camera actually snapped the pic. Great camera all around, the best I've ever owned.", "Date": "August 9, 2005"}, {"Title": "A++ Camera.  Just don't expect the impossible.", "Author": "Shae", "ReviewID": "R2CQY16P26YWWI", "Overall": "5.0", "Content": "I'll get the negative out of the way first.If you try and take a picture in poor lighting without a flash, yes you will get a poor picture. Guess what, that will happen with ANY camera. Try to pull the same task off with even the best SLR or DSLR and you'll get the same results. Poor lighting, plus lack of tripod, etc, etc, leads to poor pictures.It seems that most of the poor reviews of this camera come from people that:A. Know nothing about photography (Just use the dafalt settings and flash. You'll get fine P/S pics)B. Apparently got a lemon in the batch or are expecting results of a 1,000+ SLR.To be honest this camera outdoes most of the DSLR's on the market currently for consistancy, handling, clarity, and most every other important factor. Aside from megapixels, you can't do much better aside from spending 4,000+ on a higher end DSLR.When I fisrt got my H1 I desided to push it's macro function, because lets admit it, it's really fun. Wow! This thing blew every other camera I tried out of the water. The clarity and colors are unbelievable. I too got annoyed at the poor low light/indoor pictures I got. Then I woke up and realized user error is no reason to fault the camera. I made a nice little defuser \"hat\" out of gauze for the onboard flash, and now we're best friends.The lowlight focus lamp is annoying as hell to the human eye. Well, turn it off. Unless you're in EXTREAMLY low light, you'll still get a good focus. I do birth photography, and glaring orange in your face while you're having a baby is not ok.All in all this is a real workhorse. In most situations it hardly matters that you can't switch full lenses. You won't even really see a need. For those times you do need a little \"extra\", there are some wonderful lens adapters you can buy. The camera comes with an adapter ring, so you're already half way there.Accesories are a bit on the high side, but if you add it up, you're still getting out much cheaper and with more quality apposed to other options out there.In the end, would you rather spend your money on a super fast camera that gives you trash pictures, or a slightly slower (only in low light) camera that gives you pure magic?", "Date": "February 24, 2006"}, {"Title": "Superb class", "Author": "Amit Gaind", "ReviewID": "R2617P6DKG06YI", "Overall": "5.0", "Content": "I was a bit reluctant on buying this camera as there were not many reviews on internet about this product. But I must say that it is simply the best in its class.The low light shots are the best I have seen as compared to my friends' cameras like kodak, canon, and even sony's other versions. I have tried different settings for shutter speed, aperture settings and all, and it is a good learning camera for novice and intermediate level photographers like me. There are a lot of options to try.However I am not very much convinced with the macro mode. You cannot simultaneously zoom 12X and be very close to the subject at the same time. May be the conversion lenses in the market are there for this purpose only.I would have loved if sony had provided me with the screen protector for the camera. The screen is big and more prone to handprints and scratches!Overall I would like to recommend this camera to ama-pro level photographers. By the way I got this camera for $405 at Amazon.com, that was a very good deal in my gold box!!", "Date": "August 26, 2005"}, {"Title": "What a camera!", "Author": "R. Edser", "ReviewID": "R3E4R9C5VWNG5Y", "Overall": "4.0", "Content": "When looking for a long zoom camera I had narrowed my choices down to the Canon S2 or Sony H1. I had actually made up my mind to go for the S2 until I borrowed one for a week. I've written a product review of the Canon S2 explaining why.Always go and try out a prospective camera before deciding, don't base your decision on online reviews alone!In a nutshell, this camera simply takes amazing pictures with beautiful colour. Even more important is the fact that it seems to make you WANT to take more pictures. I find myself sitting at work wishing I could be out taking pictures with my H1.Some of the highlights:* Excellent manual modes with live histogram and preview* Very fast and accurate autofocus* Excellent quality photos* Very bright and clear LCD screen (2.5\") usable in sunlight (not so for the Canon S2)Things that could be improved:* Move from using 2 to 4 AA batteries, because of this:* Shot to shot times with flash are a little slowHonestly that's the only \"con\" I can think of and it's not too difficult to work around. The battery life, although less than camera's with 4 batteries, is still good for a couple of hundred shots. I always have at least 4 sets of rechargeable's handy any way. Overall though I haven't owned a more enjoyable, and rewarding camera.", "Date": "January 9, 2006"}, {"Title": "Great Camera", "Author": "Big Mike", "ReviewID": "R2FX0TE6R6BLGK", "Overall": "5.0", "Content": "The Sony Cybershot DSC H1 has far exceeded my expectations for the camera. The shots are clear and bright with good color and a notable lack of noise - and this is at the more economical 3 megapixel level - and the best news is that the camera is Made In Japan (which no source ever mentioned) which assures you of very good quality IMO.Spend a little and get a 1 gb Memory stick PRO - they are worth every penny you spend - especially when you want faster recovery between pictures and can be gotten from Amazon at a very competitive price point.Also - invest in some 2500 mAh rechargable batteries and a fast charger that charges four batteries at a time - again it will be worth every penny you spend. (Thomas Distributing has great prices and products for your rechargable battery needs).Buying the camera from Amazon was the lowest price from a trusted vendor I could find-Considered the Panasonic Z5 and the Canon S2iS and decided that the Sony at the Amazon price point was the best bang for the buck that I could find after a couple of weeks surfing the web for prices and feature comparisons.Enjoy-Mike", "Date": "February 22, 2006"}, {"Title": "A Good Camera ..", "Author": "Mohankumar Murugesan \"Mohy\"", "ReviewID": "R294F55TQGKCYB", "Overall": "4.0", "Content": "I decided a lot before buying this camera, the tie was between cannon S2 IS and Sony DSC-H1. I finally decided to go for DSC-H1This is an absolutly great camera, the 12x zoom rocks. The image stabilization is also awesome. The only con is that, it has a very bright flash which throws up a lot of artificial light on the subject. The battery life (sony) is also good. But Cannon S2 uses the SD card which has become very cheap, where as H1 uses the memory stick which is costlier when comepared to SD.overall the DSC-H1 is a great camera, but i would rather recommend going for a digital SLR if you are on the passion side of photography, since DSLR's prices are tumbling down.", "Date": "March 26, 2006"}, {"Title": "Not a professional? Not a problem.", "Author": "Toniann Scime \"Librarian\"", "ReviewID": "R18V5W23SMHMFS", "Overall": "5.0", "Content": "I've owned a passel of digital cameras, and with each one, there's been a curve of disappointment: at first, it seems to be just what I'm looking for, and then a month later I'm sorry I didn't buy something else.I've had the DSC-H1 for well over a month though -- I bought it practically the first week of its release because I was so imperssed by the specs. And I haven't been a bit disappointed.I could talk about the features -- there are many. I see a number of other reviewers have talked about those at some length, and I defer to them. For the record, I agree heartily in all regards, both pro and con. Personally, I want to add that the size of the LCD viewscreen alone is a phenomenon. The zoom is as impressive as I was looking for; I recently visited the Bronz Zoo, for example, and got some shots that look as if I had been in the wild, traveling with \"National Geographic\".Because -- I'm an amateur, no doubt about it. I love photography and I've been steadily focusing on improving my composition, choosing interesting subjects. But I don't know beans about specs compared to a lot of other folks -- and I'm having a ball using this camera. So if you're a photo enthusiast -- if you're interested in the art of photography, and need an instrument that will get you the results your creativity needs -- this is an excellent camera for you.", "Date": "September 27, 2005"}, {"Title": "DSC-H1 ... bad experience", "Author": "M. Corbett", "ReviewID": "R34W2QJ6Y7NA9J", "Overall": "2.0", "Content": "I just returned a DSC-H1 for one big reason ... I had major focus issues with this camera. I don't know if I had a defective model, but it was pretty bad overall. Really struggled to focus on stationary subjects, the image stabilizer (yes, it was on) didn't seem too effective, the low-light performance was awful. Basically, every single shot needed a flash to come close to 'good'. Not something I'm willing to do. I just bought a Canon S2-IS and am very impressed with it's pictures and it has none of the problems I had with the Sony. I will say this though, the Sony had a more 'substantial' feel to it. The Canon feels more like a 'toy' compared to the Sony. The pictures are what matter to me, however, and the Sony just didn't compare. I really wanted the Sony to work out and I thought it would based on the reviews that I read. I was very disappointed.Like I said, maybe the unit that I purchased was defective, but the potential of going through the return-process headaches twice kept me from giving it another shot.I should note that I'm not close to a professional photographer, but I've used plenty of cameras in my time. Digital, SLR, etc. The Sony problems were not due to 'ignorance' on my part ... a camera should come out of the box in 'auto mode' taking decent pictures, that's an expectation of mine. The Sony failed in this regard.", "Date": "August 2, 2005"}, {"Title": "Great Digital Camera", "Author": "M. Haroon \"simply genius\"", "ReviewID": "R273C43O9IE56T", "Overall": "5.0", "Content": "I owned a Canon digital camera for the last few years, and while I liked it, I could never get good shots in low light situations. Also, red-eye was always a problem with my Canon. After some research, I decided to buy DSC-H1, and am very pleased with it. I simply could not believe how great pictures come out in low light. While red-eye is still sometimes an issue, it's a lot better than my old camera.Size of the camera is larger than other digitals in the market, but then they don't offer 12x optical zoom. Size was the least of my concerns when making my decision on which camera to buy anyway.Overall, I am really pleased with this camera.", "Date": "November 2, 2005"}, {"Title": "User-Friendly and fun!", "Author": "ARTiCREATE", "ReviewID": "R8IBF6BZHLLHW", "Overall": "5.0", "Content": "I jumped from a 1.3 mega-pixel, no zoom \"toy\" digital camera that only took 5 (blurry) pictures to this INCREDIBLE amazing digital camera, and I'm SO thrilled that I took the plunge!  After doing my research on Amazon --- reading the customer reviews --- I chose this camera because it seemed like one I could use right out of the box, as well as \"grow into\" as I learned more about working with a new digital camera.  It is everything everyone has said about it and more.  The very large image screen was one of the biggest selling points for me.  I couldn't find anything about the software for the camera, which was the only aspect that worried me ... but thankfully, the Sony software is easy to use and you have more than one option on programs to work with your digital images.  I hope this review encourages you to buy this digital camera, as I believe you will be overjoyed with the Sony Cybershot DSC-H1.  [...]*Note:  It is going on two years now since I bought this camera, and I'm still extremely pleased with its performance.  I've never had any problems with it at all.  The photos continue to amaze me with their clarity.  For examples, see some of the photos I have downloaded under the \"customer photos\" section for this camera, many of which are up close nature shots (flowers, bugs, etc.) taken without a macro lens - simply using the auto-focus on the camera.  I have no photography experience, so all the credit goes to this camera, and I continue to recommend this digital camera for those like me who want a GOOD dependable Point and Shoot digital camera. (3-1-07)", "Date": "July 16, 2005"}, {"Title": "Great Camera", "Author": "D. Birks \"Engineer\"", "ReviewID": "RQILK4ZBJ7RFI", "Overall": "4.0", "Content": "This camera makes it very easy to produce great pictures. The display is large and readable in any light. The camera sits well in your hand and the controls are easy to use. Used in its full auto mode you really cannot go wrong.On previous digital cameras I've always used the viewfinder but this camera just seems easier to use if you use the display, even when using the display all the time the battery life has been suprisingly good.One area that needs improvement is the flash. There's the ever present red eye problem, which is to be expected, but the flash is so powerful that any subject closer than 10 ft gets washed out.I spent a lot of time making my decision to buy the Sony vs the Canon and resisted a last minute temptation to buy a digital body for my SLR lenses. I am very happy with the Sony and recommend it.", "Date": "January 26, 2006"}, {"Title": "Great camera", "Author": "Teacher Mom", "ReviewID": "R3C1HHFTTJVNR1", "Overall": "5.0", "Content": "Thus far I have really enjoyed this camera.  I just got pictures back from the photo lab that I downloaded the images to and they turned out fantastic.  I haven't learned how to work all the bells and whistles yet, but I will.  As a matter of fact the school district that I work for has also purchased 2 of these cameras as well.  The zoom capabilities is what first drew me to the camera, because I wanted to be able to take closer pictures of my son playing high school basketball this year.  I would encourage prospective buyers to look further into all the specs before purchasing any camera and then give this one a try.  I'm sold on it!", "Date": "August 3, 2005"}, {"Title": "impressive machine", "Author": "Cassio Nagato \"Japaman\"", "ReviewID": "R21NV7JUP2H598", "Overall": "5.0", "Content": "The H1 from sony is a unique product, considering the awesome 12x zoom, and the steadyshot feature... I had shots from a car running at a 70km/h, from inside, to baloons in the sky, and other ones, impressive for it clear photo.  The lcd viewer, 2,5\" is some great feature, making more easy to view some details. I thought that the big screen was worst in quality, but it impressed me. The rapid new digital processor (inside) makes quick shots clearly, and the focusing device is fast too (at daylight). The batteries longs a lot, and in my all day work, I wasted a 1Gb mem stick pro and changed only once. The only feature I am sad is the multiple shots, that is 4 in 3 seconds, that I think it may be faster, but this will not reduce my admiration for this camera...The movie at 30fps with audio make some short moment very special without losing quality...This is a really good one... I am pretty satisfied with it, the H1 is standart in it's medium-category... hope has only 2 rivals? canon and nikon?", "Date": "October 5, 2005"}, {"Title": "GREAT!! - Fun & easy to use camera!", "Author": "M. M. BRESHEARS", "ReviewID": "R304S0WV2LPXG8", "Overall": "5.0", "Content": "This is my first digital camera and so far I LOVE IT! I spent a lot of time researching and found the Sony DSCH1 to be the best fit for me.Some of the great features that I love about this camera are: 12x optical zoom, super steady shot optical image stabilization (to help from getting blurry pictures), the large LCD display makes it great to review your pics, and you also have the option of using a regular viewfinder (which should be nice on very sunny days, when the LCD may be harder to see), and another great thing about this camera is that it comes with 2 batteries, a battery charger (which I didn't find in a lot of other cameras).Size: Larger than the fit in your pocket cameras, but not as bulky as standard film SLR cameras.Ease of Use: Even before reading through the product manual, I found the menus very easy to follow. The buttons are placed very well for easy use.Overall - 5 *'s - Great quality", "Date": "January 30, 2006"}, {"Title": "Hope your's works.............", "Author": "Randover", "ReviewID": "RDG7N8067DLEQ", "Overall": "1.0", "Content": "Mine stopped working 10 days after purchase.  This was 3 days into the 4 week trip that was my reason for buying it.Sony would not allow me to return the camera for a refund or a replacement.  They required that I ship it to Precision Camera in CT for repair.  Precision Camera diagnosed the problem quickly but estimates a 2 to 6 week wait for parts from Sony!!!!!!!!I called Sony and was told parts are not available because this is a new product.  They reiterated that their corporate policy was \"no refunds, no replacements\".  And they will not extend the warranty to cover my time without a camera!I thought Sony was a better company.  No more Sony products for me.", "Date": "August 1, 2005"}, {"Title": "Awesome Camera for the Vacation Picture Taker", "Author": "Sandy H", "ReviewID": "RYTWIYW0ZO0S8", "Overall": "5.0", "Content": "First, I am not a professional photographer - far from it.  My experience is very limited but I have had several 35mm cameras and a Sony Mavica CD-400 digital camera.  I broke my Sony Mavica and started researching to get a new one.  I waited for this camera to come out because I had great luck with my previous Sony and it did not take any real knowledge to make it work.  I got this camera several weeks ago and I have experimented with it and I have made some mistakes.  However, the problems have been mine and not the cameras. Please don't think the camera is hard to operate - if you follow the basic 6 steps they provide, you will take great pictures.  I really enjoy the 12x optical zoom and the use of a memory stick is awesome.  I also like the internal memory because I can take the stick out and still capture pictures.  I have shot most of my pictures in the 1 Megapixel size and have found them to be superb.  Most of my pictures are vaction and personal (pets, kids, etc.) so I don't need to often use the 3-5 Megapixel setting.  Having said all this - I love the camera and it works great.  I am sure a professional would find fault with it because it is not a upscale professional product.  But for the beginner to some experience person, it is great.  So good luck and enjoy.", "Date": "June 17, 2005"}, {"Title": "Great choice", "Author": "mahgoa \"mahgoa\"", "ReviewID": "R3QOYWV15WR8GK", "Overall": "4.0", "Content": "I am happy with my choice of Sony DCH1 camera. The picture quality is awesome and the 12x zoom really helps in outdoor pictures. I had to install 512MB additional memory as is standard for most cameras. The only flaw I saw with this camera and which may apply to other digital cameras as well is the screen. It is kind of exposed and may get cracked or even dirty by constant use. I would recommend that the manufactures start adding some kind of protective cover or maybe flip it towards inside when not in use as is the case with camcorders.Although a bit bulky than the sleek 3x zoom cameras, i would recommend this product for anybody who is interested in buying a higher zoom camera.", "Date": "January 30, 2006"}, {"Title": "Sony Cybershot DSCH1 5.1 MP Camera", "Author": "Roger G. Solheid", "ReviewID": "R1Y9YG0OFWNIHH", "Overall": "5.0", "Content": "I bought this Sony Cybershot DSCH1 a few days ago and love it. Because I bought it at Best Buys, $309.99 ad error, I only have 14 days to check it out if there is a problem. Not very long. I read the \"Read This First\" handout and it covered everything very fast. The manual goes into lots more detail. I then proceeded to test everything. I was delighted with all the features. I love the large 2.5\" screen, and also a separate viewfinder. The large screen makes reviewing your shots or video very nice. The zoom worked like a champ both inside, low light, and outside the house. I was woried about low light effecting the focus. I had no focus problems. The color on all pictures is very good. Because it warns not to use regular batteries, I went to Walmart and found 4 rechargeables, 2200 ma just like the ones with the camera, for only $6.27. With the 2 they gave me, I now have 3 sets for vacations. I also bought a 1 GB film card, the Pro Duo with holder, which you need, at Costco for only $59. This holds 400 high resolution pictures or unlimited smaller ones. With about 5% of the reviews saying they had problems, I wanted to check out my camera right away. I have no problems and love its med size and fairly fast action between shots. The 12x telephoto does not work in the movie mode. The buttons and dials all make a lot of sense after reading the short guide twice. I can't wait till our Alaska cruise this summer. I'm sure the telephoto will get a workout.", "Date": "February 14, 2006"}, {"Title": "very good all around", "Author": "Z. Li", "ReviewID": "R36GTFF3SH2CQ9", "Overall": "5.0", "Content": "I'm buying this camera after having a Sony T-1, and having limited use of a T-7 and Nikon D70 (my father's) and it's no substitute for  a real dslr, but until then it will do for me. dpreview.com has accurate in depth reviews. I do miss the ability to pocket my camera, but the improved image quality is worth it.", "Date": "August 14, 2005"}, {"Title": "I LOVE THIS CAMERA", "Author": "Catherine L. Hudson \"love cats\"", "ReviewID": "R2N7684THO1L75", "Overall": "5.0", "Content": "I have had smaller sony Cyber-shot cameras with a 3.2 mega pixels.  It was OK but I didn't get the clear pictures that I would have liked.  Also I could not zoom as much as I liked.  I ordered the DSCH1 and am very pleased.  The pictures are so clear I just could not believe it.  I would recommend this camera.", "Date": "August 13, 2005"}, {"Title": "Love the older Sony's!", "Author": "K. Knutson", "ReviewID": "R1K1G1W3JU6CFX", "Overall": "4.0", "Content": "The shutter button broke on my SONY DSCH1. No camera place would touch it. It had to be sent directly to SONY in Japan. That was like $177.I had had it for 5+ years. I bought an expensive Olympus, then a Sony H1 for a replacement. These cameras cost twice as much as this one did. (One would think they'd be BETTER cameras for the price!!) I returned both of them!! The picture qualities were grainy! Sure, they each had their bells and whistles, great zooms, but the bottom line for me is the picture QUALITY! This SONY DHCS1 camera shoots crisp and sharp pictures! I was able to buy a used one (from GamersMarket@gmail.com)for less then it would have been to have the shutter button replaced.The SONY DSCH1 takes 2 recharable AA batteries, and a standard ScanDisk Memory Stick Duo. It also comes with a plastic screw on lens protector, I use when it rains. (The new Sony H1 doesn't!)Not sure what is going on with Sony. Why do their newer ($400+ cameras have fuzzy lenses!!? The newer cameras seem to be like buying a BMW with a plexiglass windshield!!! I think the $500-$1000 SLR camera's would be the upgrade from the DSCH1...not the H1!)I like QUALITY over bells and whistles. This is a great camera!...again!", "Date": "September 20, 2010"}, {"Title": "An older camera that performs quite well...", "Author": "ROBERT G. ONEAL", "ReviewID": "R2QVERS1FK4RG9", "Overall": "4.0", "Content": "I'd seen impressive images taken with this camera, so I sought one out and found it at Amazon. Not many are likely to be buying this older model, but you need to know the following if you do: The image quality is REALLY extraordinary wihtin it's limitations. The combination of great optical zoom, surprising focus 'depth of field' at distance and really sharp resolution (for just 5 MP density) make it possible to take very satisfying landscapes. Indoors the flash performance (out to 20+ ft.) is strong. But the camera ONLY operates on 2 Ni-MH batteries (a 2.4V unit); you cannot use alkalines. It would be wise to have a pocketful of them, too, as (typical for older cameras) the LCD screen eats them alive. Battery life is worse with flash, but if you use the LCD screen for composing shots, it's unbearable. Best to leave the LCD off, use the viewfinder and minimize reviewing pics.This first-generation 'steady-shot' Sony cam will outperform many modern point-and-shoot cameras, absent all the bells and whistles now available. The battery life is its' worst problem. And, you will have to buy a $10 adapter to use the Memory Stick Pro DUO chips. Not bad at all, for what I paid.", "Date": "January 25, 2010"}, {"Title": "Fabulous beginner and intermediate camera", "Author": "Maurice A. Neilson \"btomancny\"", "ReviewID": "R1KXI4NZ4WOXZK", "Overall": "5.0", "Content": "I have had this camera 2 months and all my pictures are razor sharp and crisp.Finding accessories has been a breeze and they work well.Invest in this camera you will be happy.", "Date": "November 18, 2006"}, {"Title": "Here is the REAL DISH...", "Author": "Peter A. Pickett II", "ReviewID": "R1U7I5ZGGTAU8N", "Overall": "3.0", "Content": "Here is the REAL DISH...I agree with all these users with the quality of the photographs, but here is the real dish.I would like to mention first, that this is my 5th Sony camera since 1997 and my last one was the DSC-S85. Before that I used FD mavicasPros---1. Video is outstanding!!! But short in Highest Def mode with 256Mb stick you can get 3 min.2. I love playing with the settings. and has a great manual.3. powers up quickly! (campared to S85)Cons..1. Does not use any remote control that the DSC-S85 uses. That, in of itself prevents me from using it for astrophotography thru a telescope.2. long exposures force an equally long compiling time. a 30 sec exposure takes another 30sec to finish compiling.an 8 sec exposure forces you to wait 8 more sec.3. Multiple exposures are hard to take with moving subject. This is due to the fact that the viewfinder isn't real. just another extension of the LCD screen. I suggest Sony go back to a simple viewfinder.4. Sometimes the camera hangs when trying to take a picture. So you have to let go of the pic button and start over. Not sure what that issue is. Maybe it gets confused to what settings to use.Finally, Sony should have used some of the on board ram to help with long exposures. maybe cache the image and work quicker.", "Date": "September 24, 2005"}, {"Title": "Great camera, Terrible software", "Author": "magoo", "ReviewID": "RA88D5NW4HDHS", "Overall": "4.0", "Content": "This camera takes really great pictures.  Awesome zoom, but the software that comes with it is terrible, you can't even delete a picture with it, you have to open windows explorer and delete the picture from there, quite annoying.  But absolutely no complaints about the camera itself.", "Date": "March 4, 2006"}, {"Title": "Not an SLR but close to comparison", "Author": "John M. Hardiman", "ReviewID": "R33FFML5KD79JA", "Overall": "4.0", "Content": "The potential for a beginning photographer is right here in this camera!Pros:  Comes with a lens adapter, so get creative and buy a decent lens adapter and filter kit. Fisheye, telephoto, wide angle, whatever. A lens makes the whole camera worth while. Make sure they're 58mm threads though.  Manual controls are worth the while. Don't get stuck in automode, you won't get anywhere but pictures of your grandmothers birthday.  Use it professionally and for god sake, read the manual, you will learn a lot more about the camera and photography in general if you just read the manual.  This camera has an excellent video mode. I would know because it was the first camera I started filming skateboarding with. Buy a fisheye, an x-grip, and a tri-pod and get to work.  Camera shoots great photos, yes, now a days we have cameras with over 20mp shots but like I said, this is not a total dslr, it's truly for beginners and amatuers, but that doesn't mean you can't take just as good of a photo. Rember, it is not the camera, it's the photographer and in photography, creativity is everything.Cons:  Because of its incredible LCD screen, it eats batteries like a fat kid eats cake. I suggest buying the energizer battery changer and buying like 10 rechargable batteries along side that.  Once more, this is not an slr, but rather a pro consumer camera with a lot of great features. So if you are looking for something of quality, just go with Canon or Nikon.", "Date": "April 12, 2012"}, {"Title": "great camera", "Author": "Kelly Cranford \"KC\"", "ReviewID": "RMJMH4CP66N6I", "Overall": "5.0", "Content": "I bought this used camera based on the user reviews and the price.  It goes through batteries pretty quickly but takes great pictures.  Lots of features and can be switched to manual - which I intend to learn how to use some day.  Right now, I'm happy with the automatic settings.", "Date": "September 29, 2013"}, {"Title": "Awsome", "Author": "KPD945", "ReviewID": "RJTQMPRJN0XS", "Overall": "5.0", "Content": "I got such a deal on this that I kind of expected junk to arrive, was I wrong excellent camera and could not beat the price, Thank you", "Date": "July 6, 2013"}, {"Title": "Still an amazing camera", "Author": "Jess C", "ReviewID": "R2ICOTVFSH3LZD", "Overall": "5.0", "Content": "Even at 5.1 MP, this is a wonderful camera.  I have yet to find its replacement.  The various functions are wonderful... I took this across Europe and was able to snap gorgeous pictures *while* walking.  The zoom is wonderful as well, I'm having a hard time finding anything to compete with this camera, even with current available technology.", "Date": "March 12, 2011"}, {"Title": "great deal even better camera", "Author": "Doug Puchko", "ReviewID": "R326Q7AOCBZWPS", "Overall": "5.0", "Content": "Not a problem with the cameraJust keep it out of extreme colds or else it will have a hard time zooming, Other than that amazing device and best deal i got for it all year.", "Date": "February 8, 2010"}, {"Title": "Good choice", "Author": "Stephan Clarke", "ReviewID": "R136IXTH4SETMO", "Overall": "5.0", "Content": "I have been wanting to get a digital camera for some time now. Anyone who takes many pictures knows that an entire roll of film will yield (hopefully) a few really good pictures. I wanted the versatility to choose which pictures to keep. I did my homework, researching digitals on the web. I spent a lot of time thinking what I wanted in a camera, and which one I should buy. I finally decided on the Sony Cybershot DSCH1. The clincher was the abundance of good reviews.  The DSCH1 is everything I hoped it would be, and more. Although there is a bit of a learning curve due to the many features, all of the buttons are placed well and the instructionals provided are adaquate. The camera is much quicker than my Ricco 35mm and is fully automatic, or manual if you prefer. This is a camera for more than the average picture taker.Pros: Excellent features, great pictures, ease of use (automatic mode), versatility (manual mode), terrific macro mode, includes video recording with sound, good battery life.Cons: Most accessories including the carrying case must be purchased separately.Missing: panoramic setting and remote jack.", "Date": "August 17, 2005"}, {"Title": "great camera, but, wait for the H2 or H5", "Author": "Garry L. Croney", "ReviewID": "RFJSN7V7IUQHD", "Overall": "5.0", "Content": "This camera took wonderful photos. The 12x with \"steady Shot\" is ready good. But, I will be passing it down or selling when the H5 is released.", "Date": "March 4, 2006"}, {"Title": "WAY Over-Priced, Not Very Good Camera", "Author": "L. D. Smith II \"deved\"", "ReviewID": "RXRK45K473XR2", "Overall": "1.0", "Content": "I bought this camera after having one of the Mavicas for several years - thinking of course that Sony has improved upon their features and design. I was very very wrong.There are several things about this camera that make it seem cheap, and quite returnable:1. Battery: The batteries (rechargeable AA type) must be removed from the camera to be charged. This is the most cumbersome task for the price of this camera.2. Lenses: For any other lens you must use a large plastic ring that attaches not to the camera's lens but to the camera itself. Any type of wide angle lens (I've tried several) causes the edges of the so-called \"adapter\" to actually be in the photographs. This is a very useless and cheap ploy by sony to make this camera versatle. With the plastic ring and then with your desired lens it makes the camera look like a toy. This is not \"my first Sony\". It is quite an embarasing thing to see and use.3. Flash Recharge: The Mavica never had this problem. It takes about 7-10 seconds for the flash to recharge. This is - again - a very embarassing thing about this camera... to have your friends sit there and wait for that \"spontaneous\" snapshot kind of loses the moment when I'm watching the flash recharge indicator blink...blink...blink... Rediculous.4. Zoom: You can't zoom in movie mode. This is the dumbest thing about this camera. You can't zoom in movie mode? Touted with such a great zoom and... well, 'nuff said.My initial impression was that this camera would be a professional, high-quality, Sony product. However, due to the curious shortfalls of basic features I was very misslead by the hype over this camera. There are other issues: 50% of all photographs - even in good light or on a tripod - are out of focus.And, of course, there's the classic Sony snapshot delay. Those of you with Sony cameras will know exactly what I mean. You'd think that after 7-8 years of this that they would fix that. Nope. In fact, on this camera, it's worse. I can't tell you how many pictures of the ceiling or the floor or someones foot I have taken because of this. Dear Sony; Fix this problem.I feel sorry for Sony over this camera. It should be about $199 when you compare it to the features and design of competitor cameras. Glad I kept the box.P.S. I just heard that the DSC-F828 (their brand new 8mp camera) was suddenly discontinued with no explaination. Perhaps they are finally rethinking (or thinking about) their design and usefulness.", "Date": "November 2, 2005"}, {"Title": "continual flashing battery icon", "Author": "Patricia J. Lodes", "ReviewID": "R2P2L4J0H1M714", "Overall": "5.0", "Content": "I have a 12x SONY Super SteadyShot 2.5LCD monitor.  However, I put in new batteries but the battery flash icon still goes off.  What can I do", "Date": "May 11, 2011"}, {"Title": "Awesome Camera", "Author": "Indra", "ReviewID": "R2D042OEZE937T", "Overall": "5.0", "Content": "I've had this camera for about two years now.  It is a really nice camera...not too big in size and it takes better pics than the smaller ones.  I enjoy using it.  Very rich colors.  This camera really capture the pics with the original colors.  I take pics in the dark and it works great.  Sometimes the pics are too white but with better angle its great.", "Date": "July 21, 2009"}, {"Title": "An awesome Digital Camera", "Author": "Juan Carlos \"jmo\"", "ReviewID": "R23WX8SFHKUAN2", "Overall": "5.0", "Content": "Since I could see it, I wanted it!I has a cybershot p75, but I break down it in an accident.I spend time to looking for the best camera for people who want to learn more about photography.I compared between Canon and Sony, and I was some undecided, but the reviews was help me so much.Finally I bought DSC-H1 and I have began to take pictures specially by the night.", "Date": "September 14, 2005"}, {"Title": "Sony Cybershot", "Author": "Faye Stone \"cowgirl\"", "ReviewID": "R26YEQ6F96UEVQ", "Overall": "5.0", "Content": "Great features and ease of use for non-photo experts.  I replaced a DSC- S75 that I was also happy with. I wanted more zoom.", "Date": "August 2, 2005"}, {"Title": "VERY GOOD CAMERA!!", "Author": "P. Majao \"THINKVAIO\"", "ReviewID": "R3KFID3EJYVPCA", "Overall": "5.0", "Content": "I HIGHLY RECOMMEND THIS CAMERA HAS SO MUCH FEATURES...TAKES VERY SHARP PICTURES EVEN FROM SO FAR AWAY...", "Date": "July 28, 2005"}, {"Title": "Sony digital camera", "Author": "EPFrat", "ReviewID": "R1189JIOT83358", "Overall": "4.0", "Content": "Great camera - easy to use.  Still discovering all the bells and whistles.  Only disappointment is that the batteries don't last very long and the camera will not accept regular AA akaline batteries.", "Date": "August 10, 2005"}, {"Title": "best of the group 5mp 12x zoom", "Author": "Luis E. Ramirez Hurtado \"lucho colombia\"", "ReviewID": "R2J96JDODLEUI5", "Overall": "5.0", "Content": "my last camera was a fuji s5000, very good, buy my new sony dsc h1 is amazing", "Date": "October 6, 2005"}, {"Title": "above expected", "Author": "George Baramidze \"George\"", "ReviewID": "R18CP5FL3FESAD", "Overall": "5.0", "Content": "Very good. Above expected even though expectations are always higher with Sony.", "Date": "October 12, 2005"}, {"Title": "Sony DSCH1 Camera", "Author": "Richard B. Smith", "ReviewID": "R3TRH84CUBBETI", "Overall": "5.0", "Content": "I tried the camera at Walmart, liked it, and decided I wanted it.  I checked prices on the web.  Amazon price beat Walmart and Sony direct, so I ordered.", "Date": "August 27, 2005"}, {"Title": "Steady", "Author": "MK", "ReviewID": "R1E6TSTRNWG3D4", "Overall": "4.0", "Content": "This is a fine camera with great lens the only issue would be the size.", "Date": "August 1, 2005"}, {"Title": "Bad auto focus", "Author": "Donald A. Arbogast", "ReviewID": "RKN0WTYHQIY3N", "Overall": "1.0", "Content": "After a week of use the auto focus quite working. I really liked the camera but was dissapointed with the auto focus failure. Had to return for repair.", "Date": "August 16, 2005"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0007WIC1K"}}