{"Reviews": [{"Title": "Finally the right digital camera for me.", "Author": "P. Hodges", "ReviewID": "R4N4FJJ4KO0LV", "Overall": "5.0", "Content": "After holding out for years before making the switch from film to digital, I finally made the leap with the DMC-L1. I have used a variety of DSLRs and digital point-and-shoot cameras prior to this. Specifically, when I was considering the DMC-L1, I was also considering the Canon 30D, and the Nikon D80 and D200 (I already had a number of Nikon lenses).After trying all of the above cameras, I was completely in love with the DMC-L1's feel and ease of use. The shutter speed dial and aperture ring are extremely intuitive to use. Overall, the camera feels much less \"fiddly\" than the other models I looked at -- I didn't like having to drill down through multiple menus on the other DSLRs to get to what I was looking for.Probably the single greatest selling point to this camera is the lens. It's one of the crispest that I've ever used. I have a Nikon 80mm F1.8 that has been my favorite for years, and the Leica lens has almost instantly supplanted it. The zoom range is pretty good for general shooting, and situations where you want to travel light [...].One of the other selling points include the simple but sensible live-view mode, which allows you to compose your shots on the camera's LCD screen. This is a huge advantage for shooting static or slow moving subjects -- you can really compose your shot, re-arrange elements, and use the depth-of-field preview to get a good sense of how everything is going to look. However, because the mirror has to flip down for the camera to focus and meter, it is too slow for most high-speed action work.The Mega OIS feature on the included lens is superb -- I've never used anything like it. There are two modes, but mode \"2\" is the only one I use -- it corrects for camera shake only when you take the picture, rather than continuously as in mode \"1\". I've taken a number of hand-held pictures at 1/4 of second or slower that would have been disasters with a non-OIS lens. Remember to turn OIS off if you are using a tripod, though.Being able to save RAW images was a selling point for me, too. This may not matter as much to others, but I like being able to edit the RAW file before \"developing\" it into an image file.Ergonomically, the camera is good. I would say that the Canon 30D is a better fit in my hand, but since I'm not going to be holding the camera for 12 hours a day it's not been a problem. I find the buttons and their locations to be sensible, and the thumb-wheel although small, works very well. My favorite elements are the two programable buttons located near the shutter release. Depending on the type of shooting I am doing, I reprogram these to my most often used functions (say EV, ISO, or film type). The film \"type\" feature is also worth noting, and may have some appeal to those that don't want to both with RAW images. There are a number of pre-programed \"films\" and two user programable \"films\" that affect the color and feel of the final images. This is a nice way to generate some decent images without going through the trouble of developing RAW images.So in summary:Cons:OK ergonomics -- people with large hands or short fingers may have difficulties.View-finder takes some getting used to. Information display is good, but it feels smaller than others I've used.This camera is not for people who want to take mostly pictures of very high-speed action. It is also not for people who want 20\" X 30\" prints (because of the lower pixel count).Pros:Very intuitive feel, particularly for converts from more traditional SLRsFantastic lensLive View image composition on camera's LCD screenMega OIS image stabilization lensMuch less fiddling than with other DSLRs -- more time shooting, less time looking through menus.RAW + JPEG file formatsGreat expansion options with the Four/Thirds lens line[...].", "Date": "November 25, 2006"}, {"Title": "Terrific DSLR for those with traditional values", "Author": "J. Boutilier \"Jim Boutilier\"", "ReviewID": "R8081U6NFDKFZ", "Overall": "4.0", "Content": "I've been into photography for over 30 years.  During that time I've owned quite a number of film point and shoots and SLR's.  During the last 10 years I've owned a number of point and shoot digitals, super-zooms, and now my first Digital SLR.  Manufacturers included Agfa, Canon, Casio, Contax, Leica, Nikon, Panasonic, Pentax, and Sony.During my DSLR search, I looked at Nikon D80 and D200's.  Canon Digital Rebel, EOS 30D and EOS 5D, and Pentax 100D and 10D, Sony Alpha, and of course the Panasonic DMC-L1.  My search started by pouring over specs and reviews at various sites including DPREVIEW and Steve's Digicam.  Then I took an in person look at all but the L1 at various camera stores.I can't express the level of disappointment I experienced when handling these cameras in person.  All of the sub $1000 models felt like cheap plastic junk.  Flimsy ports and doors, rough cheap feeling controls, and flexing bodies abound, Even the upscale (supposedly)  metal bodied units did not feel much better.  And all of the included kit lenses were complete trash - all plastic, horrid feeling controls, and SLOW.  Now thats not to say some of these can't take great pictures, but I just can't get past the build quality and feel.So the one camera I could not find in local stores was the Panasonic DMC-L1.  The reviews all seemed  to talk about the great build quality, the quality of the Leica lens, and pretty much panned most of the technology, ergonomics, and actual picture quality.  In desparation, I ordered one mailorder (from Amazon).While I was slightly disappointed in the build quality (feel and materials), it was heads and tails above anything else I handled.  You could actually feel the metal.  Controls were much smoother and you got the impression this was higher quality product.  Well it WAS more expensive than any of the others (except the 5D) so I guess that fits.  You just don't get much for $1999 (actually ($1600) these days.After handling and using the L1 for a couple days I find most of the things listed as Cons in the reviews were from prototypes and Panasonic seems to have corrected them in the production version.Feel is good, ergonomics are good, focus is fast, picture quality is terrific and noise is effectively controlled.  Live View works great and is much faster than I expected.  The viewfinder is definitely dimmer than a Pentax, but on par with the low end of some other big name manufacturers and its definitely not \"unusable\".  Viewfinder image size is also smaller than some of the above, but larger than others.All in all I am pleased with this product and for those with traditional values like myself where quality and feel is as important as function, this product is worth a look.", "Date": "February 9, 2007"}, {"Title": "A True 5 Star Digital S.L.R. Panasonic's DMC L1", "Author": "Jack B. Kane", "ReviewID": "RP2K50YOTXR4X", "Overall": "5.0", "Content": "Panasonics DMC-L1 SLR is perhaps the most underrated DSLR on the market.It is a unique deign to those who have only used film SLRs but to those who have used cameras such as the Leica M series, Canon, Nikon, and Contax range finder cameras should fell right at home with this jewel.It is one of only two DSLR on the market that has \"Live View\" LCDThe lens that is supplied with the camera is the finest kit lens of ANY brand camera. It is a Leica lens of 28mm to 100mm (based on 35mm film size) AND the lens has built in stabilization as well for razor sharp pictures even with aging hands.The camera lens mount is the new four-thirds system so that many of the lens made by Olympus, Sigma and Leica will snap right on the bodyOf all the reviews I have read on this camera there are only three negatives that show up (1) Price. (2) It does not feel like a DSLR.(3) Why only 7.4mp at that price?Retail price of the camera ($1995.) covers about 90% of the negatives.However the Leica lens with the built in stabilization alone would be about $1,200. so the body itself would be $800.As for not feeling like a DSLR that covers 5%. See above about range finder cameras.Why only 7.4mp any honest expert will tell you that a mega pixel range of 5 to 7.5 is all you need to make up to 16x20 photos. The race to higher mega pixcels at this time is pure media hype.", "Date": "January 4, 2007"}, {"Title": "OMG, OIS!", "Author": "Real Person", "ReviewID": "R3IP1G8YR9VBJ4", "Overall": "5.0", "Content": "OIS stands for optical image stabilization and is featured in various Panasonic models.  Panasonic put some serious thought into this and came out with a great implementation that REALLY WORKS.  The L1 is a great digital SLR -- as long as you don't already own Canon or Nikon-compatible lenses.  The kit 14-50 mm lens is actually a great value as it includes the more expensive wideangle range.  The camera itself is well built and takes EXCELLENT pictures with little fuss.  I love it.  I'll add more details as I gain more experience with the camera -- but so far, so superb!", "Date": "October 12, 2006"}, {"Title": "it's beautiful and it works", "Author": "new parents", "ReviewID": "RHQF7P76UCZ55", "Overall": "5.0", "Content": "spin the shutter-speed knob and the shutter-speed changes.  twist the aperture ring and the aperture changes.  press the shutter release and the shutter releases.  for the first time since my k-1000 I feel like my camera isn't trying to outsmart me.  everything does what it ought to do.  every piece is where it ought to be.", "Date": "November 17, 2006"}, {"Title": "German optics merge with japanese technology", "Author": "Leopold Lysloff \"Quality nut\"", "ReviewID": "R26LA10STC0QPD", "Overall": "5.0", "Content": "I own this nice hefty camera for a couple of weeks and have been honeymooning with this camera and its wonderful performance. This is my third DSLR (Canon was very fine, Nikon also pretty fine) Shooting in RAW and using photoshop 5 Elements (as well as the included not so shaby software)produced some very impressive pictures. Just ask my family and friends. I must say that Leica optics peek through loud and clear. The pictures are very real and subject matter is so well captured and defined. Colors are very Leica typical.That being said, this is not your all purpose snapshot camera. It's a little big and heavy for that. There are lots of great little point and shoot cameras that will give this camera a run for the money. I keep one in my pocket all the time just for those quick \"Kodak Moments\" The L-1 is more of a tool for the creative artist and detail seeking photographer. (a nut like me). It allows you to go totally manual in the way of the old SLR's. It can receive all kinds of filters for landscapes and special effects. It also reverts back to all auto settings that yield very impressive results. I think that the marriage (arranged one at that) of Panasonic and Leica is excellent. Structual quality is excellent.Now I have learned that the beautiful and responsive Leica kit lens can be purchased seperately to fit other cameras that have the four thirds mount. (Olympus DSLR is a good example) But if you shop this camera carefully, you may find that this whole L-1 package comes out much cheaper. You camera nerds out there may find little faults in button placements or too little this and not enough that, etc. That's just fine. It can be said that every camera has its little faults if you look for them. That's why new models appear every time you turn around. Bottom line is the final result. To me those results thus far have been nothing short of jaw dropping. Comapared to some real megabuck Leicas and megasbyte Hassy's or whatever, it mostly all comes down to the photographer. The L-1 is a wonderful and pretty important piece of equipment. I love it and am waiting to get the new Leica 25mm f/1.4 lens to round out my camera bag and head for the mountains. By the way, get a high quality Polarizing filter and see what fabulous landscapes/seascapes you will generate on you SD cards with this L-1. (I use Sandisc ExtremeIII 2GB cards and shoot RAW)It felt good to say that.If you enjoy photography, this is as nice as you can get for the money (even at twice the price)Go for it.  Leopold.", "Date": "June 1, 2007"}, {"Title": "Camera Intelligently designed", "Author": "Grey Day \"Grey Day\"", "ReviewID": "R28GNI74QRDYTO", "Overall": "5.0", "Content": "I have stayed in the non-interchangeable DSLR realm and shot film in 35mm and 6x4,5 cm formats.  I have been waiting for the technology to sort itself out which it still hasn't done.  The rush to mega-pixels is based on a poor understanding of the technology. Once sensor size is standardized then lens design can be optimized.. this is what the 4/3rds format is about. Mark my words-- Nikon and Canon will have to redesign lenses and while they may be backward compatable they will be under-performers. The 4/3rds format can grow-- Sigma just signed on- how about a 3CCD imager for this format- 22 MP with same size image circle from lens.  Thats what I'm talking about!This camera takes great pictures, has the feel of a real camera.  Add the Leica lens and some great features. It is less noisy than most 1:1/8 10 MP cameras I tested.  The Image Stabilization is optical and great in action. You won't be disappointed.", "Date": "March 18, 2007"}, {"Title": "WARNING - Panasonic's quality control and customer support", "Author": "jimmy.f \"\"It depends on what the meaning ...", "ReviewID": "RJRUMKD8M4L44", "Overall": "1.0", "Content": "I owned the L1 for just 5 weeks when it started malfunctioning. When the shutter speed dial was set to \"A\", it would start rapidly fluxuating between the correct shutter speed as calculated from the Automatic \"A\" mode and 1/4000th of a second. This is most likely because the \"A\" is next to \"4000\" and there is a bad contact or insulator between the two contacts. This renders the camera as inoperable except for Shutter priority mode. Apeture priority and full Auto cannot be used. In addition to this main problem, the instant review feature stopped working and would only show taken images intermitently.To make matters worse, they had my camera for 3 weeks and I heard nothing from them. I called and they apologized and said that my paper work had gotten separated from the camera and that they would have it repaired immediately and I would have it back within a week. Guess what? It's now been 6 weeks and no camera nor communication from Panasonic. I called Panasonic 3 times this past week leaving messages for my Customer Service rep and he is not returning my calls.At this point, I no longer want the camera as my vacation and planned events for which I purchased the camera for have long  passed. Only having had the camera for 5 weeks and then having to have it serviced is like pruchasing a refurb or something and Panasonic keeping it for 6 weeks is totally unacceptable. I am calling Panasonic everyday and they are not responding -- be  very careful...", "Date": "September 29, 2007"}, {"Title": "Panasonic got it right!", "Author": "galechicago \"Music Fan\"", "ReviewID": "R671TKID75XL1", "Overall": "5.0", "Content": "This camera is the best dSLR I've ever used, hands down. Gorgeous photos right out of the box. Color is perfect, white balance is great, and that Leica LENS, oh what a lens. Sharp, no distortions, even at wide angle. I've been shooting at ISO 100-400, and there is no noise. The camera itself is solid and well-built, and even the sound of the shutter feels luxuriously deluxe. I have another Leica, so I expected the lens to be amazing, but who knew the Panasonic camera body would be just as fabulous?The folks that complain about button placement and accidentally changing settings must have big thick fingers or something. I'm a woman with normal-sized hands, and it all seems perfectly comfortable to me. The controls are so intuitively designed, and you don't have to drill down through a dozen menus to find what you need. If I could give this camera 6 stars, I would.", "Date": "December 20, 2007"}, {"Title": "Panasonic DMC_L1", "Author": "Richard Foley", "ReviewID": "R20UFKY9YUIXAH", "Overall": "4.0", "Content": "I preface this review with the note that I am a professional photographer of some 37 years.  I have used nearly every camera from sub-miniature to 11x14 view cameras.  I liked this camera for the past year but was hesitant to purchase it because of the price.  When the price dropped to below $1000 I just had to jump on it.  I am very pleased with the results.  The lens is one of my best.  It is very sharp and I love the fact the f stops are on the barrel.  It handles like my old film cameras.  The only downside I have found thus far is the rather dim viewfinder.All in all Panasonic has a winner here.I have had this camera for about 3 months now and like it even better than before.  Make sure you update the firmware.  It will now take photos even while writing raws.  It works much faster.", "Date": "December 23, 2007"}, {"Title": "DMC-L1 7.5MP Lumix digital camera", "Author": "Addison H. Thompson", "ReviewID": "R1EE3LF9DL7I1C", "Overall": "4.0", "Content": "I deleted my 3 star review after Panasonic's Service Center sent me a new lens when the Elmarit Zoom on my Lumix started to jam. Now they have sent the camera and lens back and I am happier with the camera.  This camera isn't an giant megapixel SLR with the finest lens. It has an amazing lens for the money and it takes great pictures.", "Date": "December 26, 2006"}, {"Title": "A pleasent surprise - DMC-L1", "Author": "V. D. Cone", "ReviewID": "R2BVBUFBBT3WX7", "Overall": "4.0", "Content": "Although I thought this \"four thirds\" camera might be a little smaller than it is, I am very pleased with the ease of use and the quality of the images. It is simple to use and controls are in logical locations. The \"Live View\" has been of value as well as the option to shoot 5 shot bracked exposures for HDR. The camera is a little pricey but the lens quality makes it worth it. Construction is solid too.", "Date": "June 11, 2007"}, {"Title": "Poor lowlight performance, great for landscapes!", "Author": "M. Abdulai \"CycoPath\"", "ReviewID": "R1GDUWHCSA4LS8", "Overall": "4.0", "Content": "I bought this camera when Amazon had them for $799.  I thought it would be a good camera to re-familiarize myself with manual controls and a higher degree of involvement with photography. I was also in love with the design and layout of the controls and the body.I will not get into an analysis of the pros and cons of this camera; there  is enough information out there to provide anyone with a sense of how the L1 measures against the competition.  I will however, contribute a few observations.Even though the viewfinder is dark and small, you adapt to it fairly well.  I used the camera on a 4 day trip to Colorado and found it a lot better to manage than I initially thought.This camera requires patience and a willingness to try different things.  If you just stick it in Auto, you miss the whole point of using this unique instrument.  A tweak here, an adjustment there, and you are rewarded with rich, detailed and well balanced images.You will be stunned at the quality of images this camera produces.  Outdoor shots are beautifully rendered, bokeh is quite good, and the 14-50mm Leica lens is a joy to use, albeit a tad unforgiving when the wrong settings are used.7 megapixels is more than most people need.Low light performance is really poor.  The AF hunts and hunts, high ISO performance is relatively noisy (But why would anyone shoot above ISO800 anyway?) and the built in flash only works well at close range.  One cool feature is the bounce-flash feature, which returns well lit and not washed out portraits, but only at a reasonable distance.I have a Nikon D300 SLR that I use for more professional applications.  I however prefer to use the L1 as a walk around, fun camera.  It behaves very much like an analog camera.Perhaps one shouldn't think of this camera's challenges as shortcomings, but of how far digital photography has advanced and even gone beyond film in performance and flexibility.As long as lighting conditions are good, this camera shines!", "Date": "May 19, 2008"}, {"Title": "Known problem with the 14-50 Leica lens", "Author": "Tandy K. Bozeman", "ReviewID": "R1X0ODQBCDIOK5", "Overall": "4.0", "Content": "This is a great camera with a stunning tack-sharp lens. That said, many owners on the Leica forum have reported a problem with the 14-50 lens that comes on the camera. The lens sometime comes with, or later develops, the problem of binding of the zoom function, which after time locks up completely or at best restricts zoom movement. Also, several new owners have reported that they have received a camera with a lens whose front end is \"loose\" and can be wiggled back and forth. This is alarming, but does not seem to effect the camera focus, at least on my DMC-L1 with its case of front end wobbles. Alas, also my lens seem to be developing the dreading zoom restriction about mid zoom.So, if you do purchase this camera, do carefully check out the 14-50mm lens for what appears to be, or have been, a widespread manufacturing defect. The lens should zoom in and out smoothly. If there is a slight restriction or a \"catch\" in the movement, you're likely in for downline trouble.With a defect-free lens, this camera is superb, and well worth the potential hassle of returning the product for replacement if you find yourself with a lens whose zoom function fails and binds.The DMC-L1 is considerably less expensive than the Leica branded version, and offers the feel and advantages of the range finder cameras like the Leica M3 or the Nikon SP, so loved by photojournalists of yesteryear. Ah, but if only the DMC-L1 was as petite as the old Leica M3.", "Date": "December 26, 2008"}, {"Title": "in love", "Author": "Michael J. Roetzel", "ReviewID": "RXYWDWCJ22TFZ", "Overall": "5.0", "Content": "I love this camera. I've used Canons and Nikons in the past, especially D30s and D40s, and I much prefer using the L1. I almost always shoot manual, and find the actual, physical controls on this to be a great improvement over all the buttons on the Canon. The design/navigation of the menu is also the nicest I've seen on a digital camera (have also owned Sony and Fuji). Picture quality is outstanding. Plus, I admit I really like walking past people carrying their omnipresent Canons and Nikons, while I'm sporting a much rarer Lumix.The single biggest flaw with this is the viewfinder. It really is too dark - a problem common to many dSLRs which don't use pentaprisms like film SLRs. It can be worked around, but it's a real annoyance.Also, be aware that this is not a small, inconspicuous camera.", "Date": "May 20, 2008"}, {"Title": "How can you not love this camera?", "Author": "Maksim Shalvaryan \"333\"", "ReviewID": "RQD3B2J91JZQY", "Overall": "5.0", "Content": "i've held off on writing this review until i had the ability to tinker with it in several different lighting conditions and practical uses. i landed on this camera after reading several reviews recommending it over the Leica Digilux 3, and sure enough, the differences are very minimal. i've had the ability to play with both and went with the cheaper sibling instead. price was, of course, a major decision factor, but also having a heavier body, and the same lens as the Leica made me lean towards the Lumix instead. the picture quality is superb and this camera performs well in all conditions. having all the familiarities of a film camera make this camera very user friendly and if you're transitiong to digital, i think this is the winner. i've shot with other DSLR's and this camera is in a class of it's own. i look forward to becoming extremely attached to it. the RAW file format and four thirds lens options are a huge plus, too.", "Date": "March 10, 2008"}, {"Title": "Great camera", "Author": "too old to care \"too old to care\"", "ReviewID": "R2JCZGEHWKHBHM", "Overall": "5.0", "Content": "I bought this camera to replace my Leica M6 as I move to digital.  As soon as I opened the box I felt that I had made a mistake.  It is gigantic, much bigger than any 35mm I have ever owned.  In fact, it is nearly as big as my 2 ¼ cameras that I use for weddings.After spending some time with it, I realized that I was wrong.  If you are going to digital, this camera is a worthy replacement for any 35mm camera, including Leica.  The many buttons on it make it easy to change modes instead of using the display and scrolling through menu after menu.  Being able to finely control white balance, select different film types, and shortcut common functions make this camera a real pleasure to use.  Even its size is a benefit; it is extremely easy to steady for long exposures.My only regret is that Panasonic has abandoned this type of camera in favor of the more traditional digital SLR and that the 4/3rds sensor is not bigger.  I would love this camera even more if it had 14 or more megs and a bigger sensor.", "Date": "February 8, 2008"}, {"Title": "18months on, time for a review", "Author": "N. Iqbal", "ReviewID": "RA5XUXJ2OFXTR", "Overall": "5.0", "Content": "I have had this camera with the 14-50 Leica kit lens for 18months now. I have seen many new cameras being released every season, with higher mega-pixels, more features, newer technology. But I have still managed to keep this and I can tell you that every day with this camera makes you a better photographer. Using the camera with a good lens makes you really think about the picture before clicking. Its is limited in specs and the high ISO performance isn't stellar. But that aside, this camera has some very innovative features (for its time). In basic photography terms, it has every thing you would need to compose and take great pictures, without all the other gadgets and features that take you away from the photography.Yes, the camera is now pretty dated, but at 7.5 MP, its still produces stunning pictures along with its Leica Kits lens. It also pairs nicely with the Leica 25mm Summilux and The Olympus 70-300mm lens.What I have a unique camera, with a unique design, sturdy build and great picture quality for daylight and twilight photography. For night photography, a good tripod and some patience will stil produce stellar results without having to resort to noisy high ISOs. All in all, a nice camera to own and keep!Plus, I get more compliments carrying this camera than would any Nikon or Canon user and in some vain manner, its a nice feeling to be a snobby elite :)", "Date": "December 7, 2009"}, {"Title": "One of a kind, never to be mistaken", "Author": "Jarrod Sams", "ReviewID": "R2SVUJSYOWY1BR", "Overall": "4.0", "Content": "When this camera was introduced I knew I wanted one.  The look and feature set just appealed to me.  Finally I got one.  It is not a perfect camera for everyone, but get your hands on one and it speaks for itself.  I love using this camera and I find it quite comfortable to use with everything where I expect it to be.  Some features I particularly like are the manual controls, two-stage flash, live view, and the kit lens.The manual controls feel more natural than using menus.  I especially like the quick access buttons on the back and the drive mode and metering switches on top.  Though these switches can change position easily at times, I still much prefer it to delving into a menu.  I also love the two programable function buttons.  This can be very useful, though be warned that one of them defaults to aperture when using a lens without the ring.  But this has its workarounds.I normally avoid using flash, but on the L1 I will try to find a way to use it.  The bounce flash I find especially useful for portraits.  The power of the flash I think is also very good for a built in unit.  Its also amusing to see other peoples' faces when you pop the flash.Live view is a feature many seem to scoff at, but I find it quite useful.  It also helps to compensate for the viewfinder's deficiencies or when you really want to get that unique perspective.And last but not least, the LEICA lens.  I wanted a bright lens, and the L1 comes with one.  Having a quality piece of glass to start with is a real plus and this lens is part of what makes the L1 the camera it is.The L1 has its faults and quirks too.The viewfinder is small and dark.  Though I don't find it to be any darker than the viewfinder on my old Canon AE-1, it is smaller than most.  But it is adequate for ordinary shooting and something you quickly adjust to.  If you're shooting detail you can use Live VIew to check focus and to better view in dark lighting.The auto focus is normally quick and near silent, but it does struggle in dim lighting or under harsh backlighting.  Then the lens racks through its range and can make a bit of noise.  But it is quieter than mechanical focus systems and I find it to be very accurate most of the time.Lastly a few nit-picks.  The flash being located off center from the lens axis can cause uneven lighting, but it is barely noticeable and often only occurs at either close or far distances.  Also, don't use the lens hood with the flash as it causes shadows.  The shutter dial is nice to use, except it doesn't turn 360 degrees.  This makes switching from aperture to shutter priority a slight pain at times.  But it isn't a big deal unless you switch between shooting modes a lot.  Battery life isn't stellar by comparison to some others, especially if you use Live View a lot.  So an extra battery would be suggested.Overall this is a very unique piece of photographic equipment and is one you will either love or hate.  But don't just take peoples' word for it.  Get your hands on one and see for yourself.  I love mine and wouldn't trade it for anything.  I'm proud to own what will surely become a piece of photographic history.", "Date": "September 3, 2008"}, {"Title": "Still loving this camera", "Author": "Thomas A. McCarty", "ReviewID": "R103CF01TLDJV3", "Overall": "5.0", "Content": "It is now a few years later. This camera has survived and unlike the models it was compared to, still viable.Looks may have something to do with it but not everything is based on looks. Others like the Canon or Nikon have most likely been replaced with newer models as they appear. Not so with the L1. It was not replaced as a line. If you own one you know, it is a sweet thing to own. I also bought the f 1.4 25mm. The lens system is crazy cool.", "Date": "March 9, 2010"}, {"Title": "Wonderful", "Author": "Olivier Allain", "ReviewID": "R3VBBW9CXEF2UF", "Overall": "5.0", "Content": "I 've been taking pictures for 25 years with different cameras (OM 1O, EOS 10, LUMIX dmc-fz20, EOS 400d...) and I wanted something special for my 40's. This machine is absolutly perfect. Actually, this was design and created with Leica (this is exactly the same camera as the Leica Digilux 3). Some will say it's only a 7.5MP SLR camera! Indeed, but perfectly \"adjusted\". You can use Zuiko lenses which are great.I do recommand this Panasonic dmc-L1!", "Date": "April 28, 2008"}, {"Title": "Great camera!", "Author": "Q. S. Buenaflor \"lumix dude\"", "ReviewID": "R3INUCM6XK8L0J", "Overall": "5.0", "Content": "considering that you can get the camera for much cheaper than what it originally was priced its a great bargain.  You first get a DSLR with a live view, bounce flash and great analog controls then the 2.8 14-50mm (28-100mm equivalent) Leica lens with Mega OIS.  And with the four-thirds system that is steadily gaining popularity you really cant go wrong.", "Date": "April 21, 2008"}, {"Title": "Fantastic camera", "Author": "Lumix Fan", "ReviewID": "R324GLH51AUC75", "Overall": "5.0", "Content": "I was lucky enough to get this camera from Amazon in December for $800. I don't understand people who say the picture quality is not superb because the lens is sharp as a tack. I have been shooting mostly HDR images on a tripod, the depth of field is incredible. The only things I have found lacking are the battery compartment door is flimsy, the shutter speed dial should have a lock, auto-bracketing should go to +/- 2 EV not just one and finally the RAW capture should not include JPEGS, it is a memory hog. Other than that, the controls, the fit and finish, everything about this camera is great. Until I can afford the Leica M-8, I am sticking with this.", "Date": "April 10, 2008"}, {"Title": "one of a kind", "Author": "Luc Mena \"photodoctor\"", "ReviewID": "R3IOGON06GNDL7", "Overall": "5.0", "Content": "take some time to get to know the camera's features and settings,you'll be amazed by what kind of images it can produce!build quality is fantastic!a very much understated one of a kind camera.", "Date": "March 27, 2008"}, {"Title": "As presented, like new body, very happy !", "Author": "Carlos Mesegue", "ReviewID": "R11SHPR6EKK8XB", "Overall": "5.0", "Content": "Beautiful camera, great seller, as advertised.I own a DMC-LC1, will never part with it and this L1K is just natural progression for me, wanted to experiment with my many older AI Nikon lenses in a digital format, for my taste this is the perfect platform to do it, so far so good, but have to learn all over again to trust my eyes and light meter, one giant and happy leap to the past !", "Date": "December 10, 2012"}, {"Title": "A lot to like/A lot NOT to like", "Author": "S. R. Kimball", "ReviewID": "R38FVSJNEQC86J", "Overall": "3.0", "Content": "I bought into the hype, the great build quality, the retro looks, the analogue controls...but all that wore off fast when I realized that, for me, it was too big and heavy, bulky, and uncomfortable to grip.  What's more, the overall good build quality is ruined by a tacky piece of plastic which surrounds the controls on the back of the camera.  The LCD screen is way too small...I know this camera is from 2006, but still, it is too small.  While I like having the aperture dial on the lens, the shutter speed dial on the top of the camera is terrible.  It stops at the end of its 360 degree movement, then you have to go all the way back 360 degrees if you want to get beyond that point...this may sound like a little thing, but trust me...it is really annoying.  When dialing in exposures for HDR, I found that moving the shutter speed dial took quite a bit of pressure, making it easier to accidentally move the camera and get mis-aligned shots.  The two-phase pop up flash is a nice touch, but I didn't use it much.  I got this camera in great shape for $550.00, so I cannot complain about the price.The image quality was fine for a four thirds camera, but for the weigt, bulk, and price of this thing, you might as well get a DSLR with a larger sensor and better grip.The L1 is a decent camera, but simply not worth the ridiculous prices they were charging for it retail.", "Date": "February 1, 2011"}, {"Title": "Great camera", "Author": "JJ Loh", "ReviewID": "RR49PZE8QQKFS", "Overall": "5.0", "Content": "Not the most advance camera but good enough for normal photo taking. Nice vintage look that is classy and time withstanding. Built seems better than entry level camera and has good grips. Interesting features includes 2 angle bounce flash, aperture and shutter dial and of course Leica looking design and icon. Produces nice looking photos as well. Cons includes slower focus (comparatively), 2.5\" non swivel LCD, lack of accessories. The fact that new cameras does not swirl me to upgrade proofs that this camera is more than good enough for most user. Will be keeping this camera for quite awhile.", "Date": "November 22, 2009"}, {"Title": "This is not a camera for everyone.", "Author": "Fred K", "ReviewID": "RW31LOEA68HZ1", "Overall": "5.0", "Content": "This is not a camera for everyone, but if you like manual controls it is tough to beat at this price.  The image results are as good as anything out there.  I have read complaints about noise at high ISOs, but up the mid range it is certainly acceptable.The only drawback is that the included zoom is the only vibration reduction lens made for this body.  Olympus lenses will fit, but are not VR.  There are also Sigma lenses, and aftermarket adapters for many other lenses.", "Date": "January 27, 2008"}, {"Title": "Excellent....but there is better", "Author": "Gadget Man \"Gadget Man\"", "ReviewID": "R2BPAOWPOADOU9", "Overall": "3.0", "Content": "I was attracted by the retro-style aperture ring, shutter dial, dedicated buttons for various functions, the superb Leica lens.  But after using the camera for about 10 days, and comparing it to my trusty Nikon D40x, I found it wasn't as nice as I had hoped.Unlike other DSLR's I've tried, the L1 has noise...and the noise appears in shadows at ISO 200.  The D40x has lower noise at ISO 800 than the L1 at ISO 400.Next, the L1 is not a well balance camera...I don't know if it is the shape, the lack of real grip or what. But the D40x and other DSLRs I've tried balance nicer.  That might be okay, except that while your right fingers are fiddling with shutter release and buttons on the right side, you have to use your left fingers to re-set ISO or WB...this slows down the action quite a bit.The evaluative meter on the L1 simply is not as sophisticated or as consistent at the D40x...that is one area Nikon really shines in.I do like the two position flash on the L1...works very nicely.  Live View was not as nice as I had imagined.  It's a little clumsy because the camera has to flip the mirror to focus, and flip back so you can shoot the photo.All in all the D40x took a much higher percentage of good shots.  Since I use the Function button to set ISO, I could actually set ISO faster on the D40x (by that I mean, set while maintaining a shooting position.)  On the L1, you have to fiddle a lot with the exposure compensation...setting -1/3 or -2/3 in sunlight, and + 1/3 or 2/3 on cloudy days.  In contrast the D40x gets the exposure right without having to think through every shot.All in all, the L1 is a nice enough camera...I really wanted to like it because of the direct manual controls.  But in the end, it just didn't compare with my D40x...not even close.  I suspect there are Canons, Pentax, and Olympus DSLR cameras that will also outperform it handily.", "Date": "January 5, 2008"}, {"Title": "It's Cool!", "Author": "Chang yeol Lee", "ReviewID": "RFP0673VPJT7H", "Overall": "5.0", "Content": "It is impressive!  Although the 7.5 M pixels seem a little bit smaller than current dslr, quality is fantastic!  I am very pleased to use this camera.  Especially, I purchased this below $800 here. The price is increased much!  But, still it is very attractive!", "Date": "February 11, 2008"}, {"Title": "Super good deal!", "Author": "Chanchai Arreewittayalerd", "ReviewID": "R229GAX1PRAAC0", "Overall": "5.0", "Content": "The Leica 14-50 F/2.8-3.5 itself alone costs $800. It is a SUPER good deal to have the camera and lens at the same price. It is not the best camera but good enough for the price.", "Date": "March 9, 2008"}, {"Title": "Panasonic DMC-L1", "Author": "drobin3", "ReviewID": "R2N0QZPR0CY4VF", "Overall": "3.0", "Content": "Camera body features are so so.  I was really disappointed with the image quality.  Ended up keeping the lens, Leica 14-50 O.I.S., which is excellent and selling the body really cheap.", "Date": "February 16, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000GBTTG4"}}