{"Reviews": [{"Title": "Better image quality and battery usage than the Elph S100", "Author": "\"tholden1\"", "ReviewID": "R84PWBWTMBOWY", "Overall": "4.0", "Content": "I had a Powershot Elph S100 and although I liked the small size I wanted something with more accurate colors, less of a blue cast, and better battery usage.  The A20 fits the bill.  The colors on the A20 are great.  They are more saturated and a lot more accurate than the Elph.  I will no longer have to go in and filter out any blue casting.Low light capabilities are better than the Elph with the exception of focus.  The A20 automatically adjusts to ISO 150 in low-light which is something I don't think the S100 did.  I notice the background in regular and slow-sync to show much more detail at night on the A20.  I have however noticed less accurate focusing in low-light than the Elph.  Pictures also tend to be a little grainier at times perhaps due to the higher ISO in low-light.The battery life is great.  I am using the AA batteries supplied with the camera and I have taken over 150 shots and used the LCD half of the time and I still have not received a battery warning.  The batteries however are listed as \"Industrial\" Alkaline which may mean they have a much longer life than regular AA batteries.I do miss the size of the Elph, the fact it looked just like a regular Elph2 camera, the rugged metal body, the anti-glare film on the LCD (the A20 has none), and the slick look of it.  However, the A20 produces better pictures, has a much better underwater case (goes to a depth of about 100ft), and will last much longer on four AA batteries than the Elph did on its ... proprietary battery.  Of course, for a smaller camera there is always the S300 however it still uses the proprietary battery and is ... more.  Plus, it is still bigger than the S100 was.  The image quality of the S300 however should be the same as the A20 except that the S300 will focus better in low-light due to a better focus-assist lamp.", "Date": "April 26, 2001"}, {"Title": "Overall SUPER....with a couple minor quirks", "Author": "newly preggo", "ReviewID": "R1HESUJ0NDEED3", "Overall": "5.0", "Content": "I wanted a point and shoot camera to take on vacation, that was convenient and takes good quality pix--for both digital use and to print snapshots. The cannon A20 Delivers! Effortless picture taking, sharp quality pix, good colors and a flash that doesn't wash you out. I tested it out at my friends wedding earlier this month....Now the caveats:1. Factor in the cost of a 128mb memory card. That will take approx 128 pix on the highest setting 1600x1200 at superfine compression. I've found that this setting gives you nice 4x6 prints comparable to a film camera. ...2. Battery life: the change battery signal will come up very quickly if using the display. However, THIS SEEMS TO BE MERELY A WARNING--DO NOT CHANGE THE BATTERIES. I've been able to power up again and again after the warning and take the rest of my pix on the memory card.  I also invested in a 5hr nimh quick charger with a spare set of 4 AA batteries ....(NOTE:camera will NOT take those lithium batteries, I called cannon and confirmed this)3. When taking pictures, be very careful of camera shake. This camera is very sensative to this, especially if taking pix without flash in lower light conditions. Be careful or your picture will end up BLURRY. So take a deep breath, hold and snap! Ok, maybe holding your breath until you turn blue is a tad of an exaggeration--See what works for you. Most of my pix have turned out nice and sharp.4. Using the viewfinder only, without the LCD display will show you only about 2/3 of the final pic. (It ends up with space all around.) So, contrary to everyone's posts here: Have fun with the display! Even if it is a battery hog! This is the best way to see the lighting conditions and actual appearance size of the final picture.", "Date": "October 2, 2001"}, {"Title": "Awesome Value for an Excellent Camera", "Author": "Rob C", "ReviewID": "RM4FSNHIHWR3T", "Overall": "5.0", "Content": "This Digicam's awesome. I had mine for 1 week, and the pictures are better than one would expect from an entry level Digicam. I still can't believe this Cam can give me 7.5x pictures that are clear. Wow. But the 3x optical zoom is excellent by its own account. There are just a few minuses. I can't manually set the shutter speed. Though there's a slow sync option, you can't really see the difference. The film coating for the LCD screen is not the top notch anti-reflect kind Canon has on the S series, which can be a pain in the behind if you shoot under the sun like me. Aside from that, very good Digicam. But buying Digicam comes added cost... -1) Viking 128MB Compact Flash Card. You'll need this for sure. At 1600x1200 @ SuperFine, you'll 140 pictures.2) Lowepro D-Res 10 AW Digital Camera Bag. Got to trust me on this. Its the only bag you want your Digicam to be store in. Forget the overpriced Kodak and Canon bags, this baby has storage for 4 additional AAs, special pocket for additional Compact Flash Card, fits your Digicam like it's made to order, and enough cushion and padding to make throwing you Digicam out the window safe. Plus, there's a secret feature on the back if you get the chance to buy the bag.3) Kodak Photolife K1000 AA Battery Charging Kit. AA batteries are way better than proprietary Canon Lithium batteries on the S series Digicams. And with a charger that juices the included batteries up in 2.5 Hrs flat, you just can't go wrong. Did I mentioned Kodak 1600 mAh NiMH batteries last forever between charges?4) SanDisk Imagemate USB Compactflash Reader. This one's totally up to you...this baby can transfer your photos to your PC/Mac faster than from your Digicam, which will give the batteries and Digicam a rest.", "Date": "June 25, 2001"}, {"Title": "The Ultimate Stealth Digital Camera", "Author": null, "ReviewID": "R1O6FA8EER9R6B", "Overall": "5.0", "Content": "I have had my Canon A20 for about 6 months and I love it.  I went from a 35mm EOS to this and have not regretted it a bit.  One thing I didn't want was one of those digital cameras that say \"ooh look at me, I'm digital..\"  I prefer taking great pictures without drawing a lot of attention to myself-- more candid and natural looking photos that way. It is small lightweight and incognito.Before getting the camera I was concerned about image quality being up to snuff and with this camera it turns out not to be an issue.  I never use it at its highest quality setting and I can not tell the difference between my digital photos (even enlarged as 8x10s from ofoto.com) and my non-digital photos!  Any more than 2.1 mega-pixels would definitely be a waste of money-- both on the camera and on the memory required. Really, don't bother.The best and the worst thing about this camera are one in the same:  editing out unwanted photos on the fly.  How awesome is it to just trash the loser photos along the way so you only end up with all excellent photos?  That is probably why I'd say I take better pictures with this camera than I ever have before!  The downside is that it takes a few more button presses to delete that bad photo than I'd prefer.  But, having used Sony and Nikkon Digi-cams too, it's about the same on them all.  I wonder why they're all like that?Accessory musts:Sandisk compact flash card reader [price]64mb compact flash card [price](stores about 100 quality photos)", "Date": "November 28, 2001"}, {"Title": "excellent general purpose camera", "Author": "B. Gardner", "ReviewID": "R1H7W1EHL1P4QJ", "Overall": "5.0", "Content": "I've had the PowerShot A20 for about 8 weeks and have taken several hundred pictures with it of subjects ranging from single portraits, sporting events, macro stills and scenic panoramas. It's very comparable in size, weight and print quality to my  point-shoot APS camera. But it's digital! ahhhh...Pros:ease of use - the entire family *likes* to use it; mode indicators are clear; menus aren't too deepfast - even without locking the focus, the shutter is quickimaging - skin tones are good; strong colors look good; white balance options are simple but effective;optics - 3x optical zoom; good results in a variety of lightingdimensions - about the same as my APS cameraAA batteries - you can find them anywherevideo out - immediately replay your latest photo-fest on TVCons:flash - eats batteries; no hotshoe; weak red eye reductionmemory card - the included card is way too smallflimsy doors - the battery and CF doors don't inspire confidenceRecommendations:read the manual; at least one 128MB CF; USB CF reader; at least 8 AA NIMH batteries; lowepro Z30 bag; and a bigger hard drive! For printable snapshot work, the A20 is a keeper.", "Date": "December 13, 2001"}, {"Title": "Great Point & Shoot Digital Camera!", "Author": "MMM", "ReviewID": "RI553MVM1DKII", "Overall": "5.0", "Content": "I bought the camera for my wife's b-day. She is a professional photographer and she has been interested in dabbling in digital photography. I didn't want to spend a lot of money just in case she was disappointed. We are also going to Europe shortly and I wanted a point and shoot camera that wasn't bulky and something that a novice, like myself, could use. At minimum, my wife wanted controls over exposure, white balance, and shutter speed.After months of research I was down to 3 cameras - the Canon S110, A20 and a Sony DSC-P50. Since they all have received very good reviews it was really down to ergonomics and personal preference. ... My wife loved the A20 because if had excellent ergonomics with a grip on the right side and room on the left side for you fingers. The layout of the buttons on the A20 was also straight forward (as were the S110). All cameras had a solid feel to all of them. Personally, I would have chosen the S110. I love the size of the camera. Overall a great camera that met my wifes expectations. We will be taking this camera to Europe and leaving the 35mm at home. Strengths:Ergonomics - the hand grip and locations of all the controls, lcd, and viewfinder remind my wife of a 35mm camera. The camera also has a build in lens cover when off. Size - not too small, not too big. It is smaller than our 35mm point-and-shoot camera.Photo Quality - excellent excellent excellent. The colors and sharpness are better than I ever expected. Prints come out wonderful. Features - for our purpose it has everything we need. It doesn't have a manual shutter control but that is ok. The auto shutter does a pretty good job. You can affect the shutter speed by placing the camera in manual mode and by using, or not using, the flash.  I also appreciate the camera not having a \"movie\" mode. That is what a camcorder is for. I've seen \"movies\" made with digital camcorders and i don't find them useful or even viewable. Shutter Lag or lack of - this puppy is quick. I pretty much treat this camera like a 35mm point and shoot. This is especially true when the shutter is pressed half way to first set the exposure and focus. Uses AA batteries - this is how it should be (I think the Sony also allows for Lithium batteries). If I need batteries in an emergency I know I can easily find them almost anywhere. I bought a great charger (Maha C204F) and 1800mAH batteries.Price - it can't be beat. Menu Layout - the menus are easy to follow and have a simple hierarchy. I hate having to got through layers of menus to get to where I wanted to go.Download speeds - very quick.Weaknesses:Compact Flash I only - doesn't allow the use of IBM's microdrive. However, a couple of 128MB CF cards have been more than enough for meFlash - it could be more powerful but that could probably be said with all cameras that I've looked at. LCD Screen - the size is fine but it is difficult to read in bright sunlight. I think the S110 has an advantage here.Bottom line ... if you want a great point & shoot camera at a low price then you can't go wrong with this.", "Date": "August 11, 2001"}, {"Title": "Good value, but distinct limitations", "Author": "Diane, genre fiction & wordplay lover \"diane_d\"", "ReviewID": "RB1WIYYVT5G0I", "Overall": "4.0", "Content": "For the price, this is a very good camera for the casual photographer who mainly wants point-and-shoot ease, with a few adjustable features, and a mid-range zoom (3X optical - avoid the digital except for previews!). It's about the same size as a basic 35mm film camera, and I like the hand-hold ridge (although I'm glad I'm not a lefty!). It takes very attractive, clear, and accurately-colored shots IF there is sufficient light (either ambient or within its flash range): everything from scenic panoramas - the included software is easy and produces nice results on the computer - to macro-mode closeups (I recommend pulling back a couple inches, and using the zoom to narrow the view). HOWEVER, the flash range is naturally limited, and if there are deeply shadowed areas in the image, or not enough light in general for a wider-angle view, the picture comes out blotchy and grainy. The ISO comparison is only 100 up to about 150 with +2 exposure - I didn't realize just how limiting this would be when I purchased it.The other main drawback is shutter speed, or lack thereof. Every digital camera has lag between pressing the button and finishing the image file, but be aware that many things add more delay to its focus time and shutter release, too, e.g. automatic focus (which is always on, except for subsequent shots in panoramic stitch-assist and _?_); red-eye reduction flash (which uses a pre-flash red light); and any flash slows down subsequent shots, for recharge time. All this makes it harder to capture a quick moment with sports, kids, animals, special occasions, etc., especially during the period of learning its timing. The \"continuous shooting\" mode helps, when you know such a moment is immanent, but it's still slow, especially when you need the flash.My only problem with ease of use - the controls are mainly self-explanatory, and the manual clearly explains everything (even if it is rather scantily indexed) - is the \"half-depressed\" step of the shutter button, for getting the focus / focus-lock (signalled by the optional Beep) - I've had the camera for several \"rolls\"-worth of snapshots now and, too often, I still push the button all the way before I intend to.Also, remember: You'll need to buy AT LEAST 64 Mb total of CompactFlash memory, to avoid running out, and 2 sets (8) rechargable batteries to \"leapfrog\" in use. (Lithium ones aren't compatible, by the way.) A USB card reader is also worth getting, so you don't have to connect the camera every time - unless you have a printer with a built-in CF slot(?).Overall, if you mainly take still and/or scenic shots in good light, this is a nice, user-friendly, compact, relatively inexpensive option.Oh, by the way, don't bother buying the closeup add-on lens - if I can clearly photograph a pair of earrings and hardly need to crop the image, what more would anybody want?", "Date": "June 12, 2001"}, {"Title": "Winning Budget Digital Camera", "Author": "Henry S. Bailey", "ReviewID": "R1EAOZWTSTVSIR", "Overall": "5.0", "Content": "I looked for a digital camera primarily to use for emailing photos, taking photos to post to a web site, and for use in taking photos for online auctions.  The last thing I was thinking of when I purchased this camera was just how exceptional a job it does of taking excellent photos that can be printed out as 4x6 photos.  It does all of this better than I expected for the price.I had looked at the similar Sony, Olympus, Nikon, and even the Canon Elph cameras, but came away with this one.Aside from MPEGs, video or shots with sound, this camera does everything I have asked it to do.  The extra bells and whistles of some of the other models were not required for the applications I am using.The camera is small, very close to my compact 35mm camera, also very close in price.  It has a good feel to it.  It's built, as are all the Canons I am aware of with a plastic body.  It is certainly durable enough.  One comment left a star off because of durability.  My thought on that is try dropping any digital camera and see what's left of it.  The Canon A20 incorporates an excellent flash, simple straight forward menu...yes, you will have to read the manual...,excellent download time, bare minimum photo editing software, as most of the others do.  The viewfinder, again, as with other brands does not capture the full picture results, but that is a minor point.  It fits great in the hands and acts like some of the compact 35mm I have owned, except that it takes better photos than any of my 35mm cameras.  That was the surprise.  If you want a digital camera at what is very possibly the best price and value, and you want one for printing photos, general web usage, along with a Macro feature, and good zoom range, I have not seen a better camera.  While you cannot control the shutter speed on this model, it does take superior photos in low light conditions without using the flash.  This camera is sensitive, so...depending on what you plan to photograph and the conditions you will be taking pictures in, I recommend getting a decent tripod.While this camera does go through alkaline batteries very quickly, it certainly does not do so as fast as other models I have used, but you will want to get the NiMh batteries (two sets), along with the charger, also a larger memory card.  Toss in your choice of photo editing software and you are off to the races.  I have not used all of the cameras in the 2.1 megapixel range, but for the price, the funtions, and the quality of the photos, I don't think that for my use there would be any point to look further.  This is truly an outstanding product.", "Date": "October 28, 2001"}, {"Title": "Love at first snap", "Author": "John Meyung \"darkstarjwm\"", "ReviewID": "RDLUQQC5WM6JN", "Overall": "5.0", "Content": "Saw the ad, checked it out on dpreview.com, bought it.  Took less than an hour to set it up, take 35 pictures, install the software, download the pictures.  Took pictures that were supposed to be the camera's weak points - low light indoor pictures (poor focus) and some at max flash distance (~12 feet). Everything came out perfectly.  Love the focus, the flash, the speed to focus and the lack of delay once you push the button to actually snap the picture.  Simple to use yet it produces amazing results.  Plenty of advanced features should you decide to use them.  The included Photo Stitch software allows you to stitch multiple exposures into a panorama view.  Minor limitations: only supports USB downloads (no RS232 or firewire), all photos stored in JPEG format (does have choice of 3 compressions - normal, fine, superfine) and finally the zoom lacks fine control in that it always zooms further than I'd like. All in all a terrific value!", "Date": "May 10, 2001"}, {"Title": "No Better Practical Camera In My Mind!!", "Author": "\"aqualungz\"", "ReviewID": "R3GFX8Y420J8R9", "Overall": "5.0", "Content": "I have experimented with several digital cameras.  I have been using a Nikon 990 for the past several months, but it wasnt mine, so I decided that it was time to buy my own.  After endless hours of reviewing, I purchased this camera.  I am so happy I decided to perform such an extensive review!  This camera takes photos highly comparable to the Nikon!  This camera is easy to use, and comes equipt only with (in my mind) the essential options.  This camera gets all thumbs up.  Some have claimed that it is a battery hog, but thats because these people obviously have not used other digital cameras; they all are battery hogs!  Do not even think that of not buying rechargeable batteries (2 sets), and youll have no worries about running out of juice.  I cant even say \"for the price its the best\"; it just simply is one of the best!", "Date": "July 7, 2001"}, {"Title": "Lots of Power in a Simple Package", "Author": "Mr. Austin \"mr_austin\"", "ReviewID": "R2UGPAJLZ0Y0OY", "Overall": "5.0", "Content": "I've had the Powershot A20 for about a week now, and I love taking pictures with this camera!  The lens is great, the zoom is great, the software is great....I've used the Olympus 3000 and a Kodak DC240 extensively, and I can't believe how much friendlier this camera is!  It turns on really fast, it focuses quickly, and if you prefocus, the notorious digital camera shutter lag is almost non-existant!  Make sure you pick up a larger CF card and rechargable batteries, though.  8mb is not enough, and I've gone through 2 sets of AAs in 150-200 pictures...", "Date": "May 21, 2001"}, {"Title": "Excellent photo quality!  A few drawbacks", "Author": "K. Morris", "ReviewID": "R38TIGMBBG426H", "Overall": "4.0", "Content": "I've had this camera about 2 weeks now. I've formed these opinions:Pros: 1.  3X optical zoom lens with Canon lens quality.  2.  Excellent picture quality.  3.  Great full auto mode shooting. 4.  Nice variety of picture sizes and compression options. 5.  Able to take Macro close ups. 6.  Photo stitch several pictures together for a big panorama. 7.  Some manual features available such as forcing a flash or turning it off, and exposure compensation. 8.  Everything you need to get started except a computer is included.  9.  The camera is has a fairly speedy operation.  The time it takes to turn on and snap a pic is just 2 to 3 seconds.  Other operations are generally fast too. 10. Able to turn off LCD screen and greatly increase battery life.Cons: 1.  The 8MB Compact Flash that is included is ridiculously small for a 2.1 Megapixel camera.  You will spend extra money in buying a 32, 64, or 128MB Compact Flash module.  Factor that in to your overall cost. 2.  The LCD screen is tiny.  While you can get a good sense of how your photo will look, those little icons telling you things are tough to read unless you have the eyes of an eagle. 3.  The controls are not very intuitive.  You WILL need to read the manual that explains what they are and how to use them. 4.  The software included is the bare minimum needed to download and print your pics.  You will most certainly want to buy some supplementary software for editing, creating albums, etc.Contrary to what others say, battery life is acceptable.  ALL digital cameras with LCD screens drain batteries fast.  The A20 is no worse than the rest.  You may want to invest in some Ni-MH (nickel metal hydride) rechargeable batteries.  Radio Shack sells some with charger for around $22.Overall, I find the A20 a good point and shoot zoom digital camera.  Canon skimped some of the stuff that comes with the camera, but the camera itself is a fine product.  If you are like me, you will wind up buying a bigger Compact Flash Card, Ni-MH batteries, and some better photo editing software.  Probably spent another $100 for all three.", "Date": "August 4, 2001"}, {"Title": "Thrilled so far!", "Author": "Illusionaire", "ReviewID": "R3JPQ2IIRSTDFP", "Overall": "5.0", "Content": "I must have researched purchasing a digital camera for at least six months, including reading hundreds of customer reviews, before I finally broke down and took the plunge.  At first I was leaning toward an Olympus C-2040, but finances and a re-evaluation of my digital photography needs led me to the PowerShot A20.  I've been using it a lot in the two days since I got it, and it is a *very sweet* camera.  I barely had to look at the manual to get up and running with it, although the manual was helpful in explaining some of the more specialized features.  I plugged it into our TV, and not only can it display pictures from there, I can also use it as a monitor to take pictures! I installed the download software that comes with the camera, and was pleasantly surprised to discover that you have a choice in which image editing program you send the pictures to.  I am not usually a fan of bundled software, preferring to use Photoshop, but the PhotoStitch software that comes with the camera is really pretty good!  It allows you to stitch together images in several ways.  I was concerned when the pictures I took in PhotoStitch mode didn't seem like I had matched them correctly, but the software is incredibly intuitive.  I also like the rapid-fire shooting option.  I used it near the goal at a soccer match yesterday, and it helped me catch the moment when the goal attempt was made!  Later I just deleted whichever rapid-fire shots were blurry or didn't capture the action.  I can also send pictures from my computer to the storage disk on the camera, so if I wanted to create a slideshow to travel with I could!  Like I expected, it is a battery hog, but I bought myself a good rechargeable battery set with charger when I purchased the camera, and I'm going to buy another battery set this week so I can rotate them out for charging.  I also need to get a much larger CompactFlash disk.  I have two of the 8MB ones right now, which work fine for short trips, but it would be nice to just take photos for a while and not have to clear a few of them out for space periodically.Overall I am thrilled with the performance of this camera, and it looks like all my research paid off.  It does some pretty incredible stuff for the price, as well as starting up quickly, being ready to take the next shot quickly, and having a responsive zoom control.", "Date": "July 22, 2001"}, {"Title": "Takes great pictures", "Author": "\"dudek17\"", "ReviewID": "ROIG6M40GCA2H", "Overall": "5.0", "Content": "The A20 arrived yesterday and I have been having a blast taking pictures of my three kids in action.  The camera is very easy to use, I was shooting pictures 5 minutes after opening the box.  So far I have shot 155 images, all on the first set of NiMH AA....  The upload process to the computer was straightforward and works quickly via the USB connection.  The 8MB memory card provided with the camera is not really adequate for too many pictures.  I bought the 128MB Viking flash memory card along with the camera.  It just popped in and it worked.  I like the 3X optical zoom on the camera, it gives me some choice on how to compose the pictures.  The colors from this camera are amazing, very lifelike.  The camera saves all the images as JPG's (in one of three levels of compression).  The JPG's have been easy to email, the files are not too large.  The flash provides good coverage indoors, but I have not tried many shots more then about 10 feet.  There is no short video clip mode which some other digital cameras have, but I thought this was more of a gimmick then a useful feature.  If you want a digital camera which is easy to use and takes great pictures this camera is a good choice.", "Date": "May 16, 2001"}, {"Title": "Canon A20-Best Digital Camera value on the market", "Author": "Donald J. Chiarella \"USAFDON\"", "ReviewID": "R1R5Z3HKRQ5QBS", "Overall": "5.0", "Content": "I was concerned about spending around [price] for a new digital camera. I read reviews and reviews and deceided to go with a Canon A20. Well it turns out that this camera exhibits the fine art of turning out marvelous photos with minimum effort. Once you read the manual and get your hands on the camera, and use it, you will understand how wonderful \"Digital Photography\" is.Fiddle free, simple camera operation and the result is great pictures. Who could ask for more. I've owned my camera about one month, have taken about 300 pictures and the results are marvelous. This is definitely the camera for those who want simply great pictures with minimum effort. It is mostly an all automatic operation with a manual override mode for those who want to do limited exposure settings. I use a 128MB Compact Flash Memory Card that gives me approximately 720 digital pictures at 1024/768 pixel--Medium compression. Beats buying film, and all those other features this camera supports are well worth the [money]I invested.  Don.", "Date": "April 20, 2002"}, {"Title": "Great Camera at a great price", "Author": null, "ReviewID": "RFDXAI2B80LO9", "Overall": "5.0", "Content": "I purchased the Powershot A20 3 weeks ago, and I have found it to be a great mid-level d-cam. I got a Powershot A50 about 2 years ago and absolutely loved it. When I had the opportunity to upgrade a few months ago, I was disappointed with the selection of 2.1MP cameras. I decided to wait on the upgrade and keep my A50 1.3MP. When the A20 came out, I had to have it! The thing that stands out most to me is the speed of this camera. It can take pictures much more rapidly than the A50. Playback occurs almost instantly and the USB interface is so much faster than serial.  Add great picture quality, decent battery life, and 3x optical zoom and you have a great camera.  Moreover, the A20 is the same price that my A50 was 2 years ago! Prices are going down!  The best feature with the Canons is the software. The ZoomBrowser is the best tool I have ever seen for managing images. I have around 2000 pictures stored in the ZoomBrowser from my old d-cam and I can see every picture on the screen at once! This makes it easy to find that great shot from 5 months ago. This software has biased me toward Canons for a good reason.  The A20's shortcomings include mediocre red-eye reduction, a small LCD, and occasional  focusing problems in the Macro mode. These are problems with most Point and Shoot d-cams.  I also miss the sleek metal casing featured by the A50. The A20 is plastic, but this does provide better ergonomics than the metal box of the A50.  The A20's accessory line includes an underwater case and auxiliary macro and tele lenses. I plan to buy these accessories as soon as I find them on the market. These features put this camera way above others at this price point. There are better d-cams than the A20, but their advantages are few and their prices are double. Overall, this is a high quality d-cam with high end features, outstanding software, and a very good price. It is a terrific value and I am happy that I bought it.", "Date": "May 18, 2001"}, {"Title": "I use the A20 a lot", "Author": "Orville B.", "ReviewID": "R3TCE9UA8B53SI", "Overall": "4.0", "Content": "I've had my Canon A20 for about 6 months, so I'm speaking from experience. I'm 80% happy with it.  The colors are good and sharp. I like the optical zoom though twisting the lens to zoom on a 35mm is easier.  I usually shoot on the highest resolution setting, then crop and resize images on the computer.  High and low light conditions can cause some color distortion.  The flash has been acceptable for most shots.  The A20 is a tad heavy due to the four AA batteries.  Ah, the batteries.  There is a flaw in the design of the A20 such that batteries can only be used until the voltage drops a tiny 0.2 volts.  The message to change batteries usually occurs after about 100 pictures but you can still use those batteries for 50-75 or more shots.  Even then the batteries have plenty of juice for a flashlight and most other applications.  Don't throw the batteries away when removed from the camera.  However, batteries are not a problem if you use rechargeables.  Buy a Quantray NiMH Overnight-Charger ($...) and maybe a second set of rechargeable batteries.  I just took 110 pictures in three weeks on one charge of the batteries.Another major fault of my camera is that the TV out does not always work.  I think it is affected by the batteries' condition but I have never proved that.  I could send it back for repair under warranty but I don't want to do without the camera for two months.A (mild) complaint is that the viewfinder does not show all that appears in the picture.  The viewfinder does show a zoomed image, more or less.And now a few words about the software.  It is useful for maintaining a database of photos but if you have a lot of pictures you must use it wisely or it can be real slow -- like 15 minutes to update the database.  For instance, don't add new photos to a folder that has hundreds of other photos.  Load the new photos into an empty folder, refresh that library, then drag them to the desired folder. The layout and printing tools have many good features but also have some annoying hindrances.  I have not found out how to make the default font for captions to be my desired (small) size instead of a large 20 pt size.  I use other software (LViewPro) for general picture editing.Get a 64mb (or more) memory card for the storage of 100 high resolution pictures.  Also get a LowePro case that fits the A20 snuggly and also holds extra memory cards and batteries.  I have the SanDisk Compact Flash card reader which allows transfers of hi-res pictures to the computer each in under a second.  I am glad the A20 makes images in JPG format but I wish there was a resolution setting between the medium and high res settings.", "Date": "March 2, 2002"}, {"Title": "Great from the start -", "Author": "John A. G. Keil", "ReviewID": "RKMHUEL70W05A", "Overall": "5.0", "Content": "After doing an agonizing amount of research, I settled on the Canon Powershot A20 and do not regret it for one minute. I'm amazed by the quality of both the camera and the digital photos it takes. It definitely compares well with some of the film cameras I have owned and exceeds some too. Printed photos right up to 8 x 10 show excellent detail and all colors are true. I'm confident I made the best choice and I'm very happy with the camera.It's easy to handle and all controls fall right to hand. I recommend purchasing an extra compact flash card (at least 64mb), as well as NiMH rechargeables and charger. I also purchased a San Disk reader.", "Date": "December 4, 2001"}, {"Title": "great camera, software hell", "Author": "Heather Bryson Earl", "ReviewID": "R1RG5U9ASI01J7", "Overall": "3.0", "Content": "I bought the canon powershot A20 about a month ago after lots of researching and reading reviews about digital cameras.  I opened it up and right away shot the whole flash card worth of pictures of my new baby.  I was in heaven, after finally finding an easy to use affordable digital camera.  However, quickly, I decended into computer hell and am still there more than a month later.  I tried the no-brainer software installation and camera interface. After much frustration, called Canon support and was told the camera was bad.  So, I sent it in to Canon service, only to have them send it back saying it was functioning fine.  I then got on the line with HP support to check out my USB ports.  After twenty hours of trouble-shooting (with a screaming baby in the background)I took the whole lot to the computer gurus at the fix-it store.  They got on the line with Canon support, who said the camera was bad, send it in.....so Federal Express is loving me at this point, and I sent it to customer care at Canon.  They called and said they couldn't get it to interface with their computer and sent it to repair.  Repair sent it back to me (without contacting me first) and said it works fine and wouldn't be of further assistance.  Got my camera back...takes great pictures butI can't load them onto a computer.  I bought a compact flash card reader which also does not work on my computer, but does work on my father-in-law's new Mac powerbook...so Merry Christmas Dad-in-law...enjoy your new camera.  Great camera-really, really, bad customer service and advice....", "Date": "November 16, 2001"}, {"Title": "Versatile and good replacement for my film-based point&shoot", "Author": null, "ReviewID": "R2PL0O6N3Q3BB6", "Overall": "5.0", "Content": "I've had the A20 for a couple of months now, and it's excellent. I can't add much more to what has already been said here about the camera itself, regarding pros and cons. I must say, I haven't had any inclination to drag my APS Elph out with me so much, now that I have the A20. The A20 is bigger than both the digital and film versions of the Elph, but it really is light-weight thanks to the plastic case and really not that much harder to tote along than the Elph. And it's just hard to beat the instant gratification of digital photography, especially when the results are so pleasing. I think photo quality actually surpasses that of my APS film camera. I also got the 128 MB Viking compact flash card, and in fact will probably order another. I was also pleased with all of the software that came with the camera. Elsewhere, I've heard people put down the ZoomBrowser software, but I found it gets the job done very well and works well with my other software. As good as the camera itself is, what really sold me on the A20 camera was the fact you could get a reasonably-priced water-proof case for it. I did in fact buy the WP-DC200 case and it's awesome. I'm not really into underwater photography, but at least now I can take my A20 out in the snow or on the beach and have fun snapping away, knowing my investment is well-protected. The WP-DC200 permits you full access to all buttons and features. You can also fully extend the zoom lens within the waterproof case. There is an anti-reflective coating on the lens of the waterproof case, which is a must and a very welcome feature. The waterproof case does add some bulk, but no worse than the bulk of my 35 mm SLR. And its design echoes the comfortable ergonomics of the camera itself and is easy to grip, even with small hands. You do need a steady grip and a strong index finger, though, to depress the shutter button. It does take a small bit of practice to feel fully comfortable manipulating the A20's controls through the case. But after awhile it becomes second-nature. I'm also eager to buy some of the accessory lenses and possibly the card photo printer available for the A20. I think it's great that for a camera that is basically a point-and-shoot digicam, so many great accessories are available to extend the A20's versatility.", "Date": "August 26, 2001"}, {"Title": "Picture Quality Won Me Over!", "Author": "Harvey E. Lee Jr.", "ReviewID": "RWQ1NBORMAJGV", "Overall": "4.0", "Content": "I purchased a Kodak dx3700 camera for Xmas for my extremely non-technical wife (no docking station). After reading countless reviews and visiting manufacturer websites, I decided on a Kodak Easyshare Camera. I originally wanted the dx3600 because it had an optical zoom lens. Unfortunately, due to lack of supply and time frame, I had to get to the dx3700 in order to have a gift under the tree. This was my 1st digital purchase. Ease of use and picture quality were my main concerns because we will primarily print the photos.To my surprise, the ease of taking photos and downloading photos was EXCEPTIONAL! I was even surprised that the photos had a date/time stamp and downloaded pictures were automatically categorized into new folders by date (GREAT FEATURE!). In regards to ease of use, THERE IS NOTHING BETTER! Literally, after 10 minutes, we were taking photos and making prints. We were all impressed. However, we had nothing to compare the picture quality to. My wife was also hesitant to let me know that she would have liked a zoom lens.I began to research \"comparable\" cameras with zoom lenses. After thinking about upgrading to a dx3900, I decided to try another brand. I already knew Kodak's picture quality because the dx3900 is basically a dx3700 with 2x zoom.After reading many more reviews and evaluating pros & cons, I decided to try the Canon A20. It was \"only\" 2.1 Megapixels, but it had a 3x zoom and looked like a Point & Shoot. Unfortunately, it did not have a date/time stamp. I purchased one from a retail store knowing that I would return it and buy it much cheaper online. I unpacked it. I immediately noticed that it required 4 AA batteries. The Kodak required only 1 Lithium or 2 AA Ni-MH. The Canon was MUCH more difficult to set up. Kodak had spoiled me. Canon's camera interface and software installation were MUCH more complex. I became nervous because I thought it would be to complicated for my wife to enjoy. I completed all setups. I had her hold the Canon and Kodak, then take some identical pictures with both cameras using the zoom and different settings indoors (where most of her pictures would be taken anyway). I printed them, then gave her a \"Pepsi Challenge\".All of the pictures that she preferred were from the 2.1MP Canon, not the 3.1MP Kodak. The Kodak's were not bad. The Canon's were just better. Contrary to what I would have thought (being a digital novice), she was right. Although Canon's \"ease of use\" was definitely inferior to Kodak's, it had superior picture quality and a 3x optical zoom (remember: the dx3900 only had a 2x zoom). Although we LOVED Kodak's simplicity, we had to opt for picture quality. Although there will be a greater learning curve, picture quality lasts forever (If I can only get her to truly believe that).I returned the Kodak, and ordered the Canon A20 online. I was even able to get the Canon for less than a dx3900. Although I will really miss Kodak's simplicity, every time I look at a printed photo, I will know that I made the right decision. I only hope that battery drain will not become too much of a nuisance.", "Date": "December 26, 2001"}, {"Title": "Another Excellent Canon Product", "Author": "Rob C", "ReviewID": "R1IK9FF8CQNLCC", "Overall": "5.0", "Content": "I just received the A20 this morning, and have been playing with it ever since. The button layout, controls, and interface are easy to understanding and pretty much straight forward unless you got hit on the head by a club when you were a kid... Anyway, compare to the S100, which I also have, I would definitely pick the A20. Besides the fact that the S100 is all metallic, has a much smaller dimension, and a superior anti-reflection LCD screen, the A20 out shines its brother in every other terms... Okay, maybe S100 has a overall advantage in the exterior compartment, but I was looking for easy to use digicam that can give me excellent pictures, good battery life, and ease of usage. The A20 hit all the sweet spot with its 3x optical zoom w/ 2.1MP CCD, utilizes Ni-MH rechargeable batteries, and large user friendly button. I love this digicam... Now, on to my trip to San Diego Wild Life Park.", "Date": "June 22, 2001"}, {"Title": "Great Camera, great software, features galore", "Author": "Stimulus Knot \"Stim\"", "ReviewID": "R8R0MSHWVTFG6", "Overall": "5.0", "Content": "I knew I wanted to get into digital photography but I knew virtually nothing about it. The expert that reviewed the A20 finished his review with the comment that the A20 should be at or near the top of my list. I purchased the camera about a month ago. It is a gem. The 3X optical zoom gives it the versatility I need to compose most shots. The colors are outstanding, especially the flesh tones that are so important to family pics. The macro mode allowed me to take some stunning floral shots. The digital advantage has allowed me to produce our car clubs monthly newsletter using Microsoft Picture Publisher Gold, with photos of the club members automobiles inserted. I purchased the ACK 600 AC adapter to allow hookup to the PC with no battery concerns. The Canon Zoom Browser software is excellent, downloading is a snap with the USB hookup. If you're looking for a lot of camera for the money, excellent photos, good software, \"warm\" color, then look no further. I have also enjoyed the direct hookup to the television set using the connector supplied with the camera. I love this camera. Good Luck!", "Date": "May 28, 2001"}, {"Title": "The Search Ends Here", "Author": "Marc D. Thomas", "ReviewID": "R16R5DUY9OAWCX", "Overall": "5.0", "Content": "I gradually built up my digital camera collection as I searched for an ideal combination of megapixels, zoom capability, image quality, & price.  The search is over.  This is the one.  The pictures I took on two recent trips to national parks in Wyoming & Utah were sharp, breathtakingly beautiful, & when printed out on photo paper by my HP 970 printer looked as good or better than those taken by a film camera.  So much so that many of my friends had no idea that the prints were digital photos.  I repeat, this is the one to get.", "Date": "December 12, 2001"}, {"Title": "Best 2MP camera for your money", "Author": "J. Doyle \"greensock\"", "ReviewID": "R3ARBMXOV2E1F9", "Overall": "5.0", "Content": "This baby shoots great photos with rich, accurate colors, good detail, and it's a pleasure to use. The A20 isn't meant for professionals who need to do lots of manual adjustments - it's perfect for pointing and shooting. You can adjust some settings manually, and there's even a panorama stitching mode, but don't get this camera if you need total control over every shot. Do get it if you want a camera that fits perfectly in your hand (not too big, not too small), has a powerful optical zoom (not like those cheesy digital-only zooms), and takes beautiful photos. You'll DEFINITELY need to plan on getting a bigger CompactFlash card (at least 64MB) and rechargable batteries. This baby drains batteries pretty quickly and you'll find your wallet drained in no time if you only use standard batteries. If you're in the market for a 2MP camera, you should seriously consider the A20. I did the research and couldn't find one in this price range that even came close. I love this camera!", "Date": "March 21, 2002"}, {"Title": "Excellent color accuracy.", "Author": null, "ReviewID": "RGBE64FQ30ZQI", "Overall": "5.0", "Content": "This little camera is great.  Easy to use, light weight, decent zoom, and excellent color accuracy.  It is a battery hog, but at least you can pick up AAs anywhere.Invest in rechargable batteries and a larger compact flash card, such as the Viking 128mb.  A card-reader isn't necessary, because the usb cable can download dozens of pictures in a few minutes.The Lowepro D-Res 10 AW Digital Camera Bag is the best $... you will ever spend.  Small, well padded, and has room for the extra batteries you'll need to carry.  It fits the camera perfectly.  I bought it based on an earlier review said that with this bag, \"you could throw the camera out the window.\"  I have had absolutely no reason to toss the camera, but snuggled in it's bag, it has survived being dropped in parking lots, banged around climbing rocks, hiking, etc.I have been very pleased with this camera and would recommend it over anything else in it's price range.", "Date": "February 8, 2002"}, {"Title": "What a great little Camera!!!", "Author": "\"draggio6\"", "ReviewID": "R2JE4D5IO0M73J", "Overall": "5.0", "Content": "I did my research for about a month before deciding on this little bad boy.  The A20 is is all that and more!  My wife who is a Techno-Phobic finds the A20 to be easy to use as well.  To quote her, \"Is that all I have to do?\"  The picture quality is second to none.  I was horrified by how quickly the Alkaline AA's were drained by the camera.  But a quick trip to [the store] for some NiMH AA's put an end to that.  Do youself a favor and buy two sets.  The camera is relatively small and light, but durable!  The LCD is very nice in all lighting conditions.Also, buy the camera bag that was meant for A20.  I purchased mine at [store] for $9.99.  It is held securely by two velcro straps, so don't worry about it dropping out.  The bag has a shoulder strap and a belt loop so it's your choice how to carry it.  The bag will also carry an extra set of batteries and two flash cards.  The 8MB card that came with the camera was a bummer, but I purchased a 64MB the same day I purchased the camera and soon thereafter added a 128MB.  I've found that Medium Super-Fine mode will yield about 300 pics on a 128MB card.  That's ALOT of pictures.  ....I also love the Canon software that was provided.  It is EASY to use.  My Father who has a Kodak DC3400, and swore by it, loves the A20.  .... this camera [is compared] to much higher priced and larger pixeled cameras.  It is not a fair assessment.  Take this camera for what it is: A great starter camera!  Yes there are better, but, for the price, quality and the Canon name, you cannot go wrong with this choice!", "Date": "January 25, 2002"}, {"Title": "Tremendous camera for the price", "Author": "Joseph K Krolak", "ReviewID": "R1C5DI1V79RASL", "Overall": "5.0", "Content": "I bought the A20 this week and am \"pushing\" it as hard as I can.  I maxed the resolution to 1600-1200 and printed the outside shot on 11 by 17 photo paper...the lens is just terrific, the sharpness of focus from near to far is super.  I have been asked to do some more 11 by 17 prints for my supervisor.  It is a great camera value.  The 11 by 17 print -- from a three year old HP 1000 looked as good as some of the 3 megapixel cameras out there at almost twice the price.  Those of us used to point and shoot cameras will definately enjoy this camera and even those who are familiar with 35mm SLRs will be impressed. The colors seem very strong and the software provided with the camera does its job very well, however, I like more creative control for Altering photos.  It is nice to see that Canon used good lenses for their digital camera, it sure helps.", "Date": "May 24, 2001"}, {"Title": "Best 2+ mega pixel camera out there", "Author": "\"kellimike\"", "ReviewID": "R22EL58YYTS3G6", "Overall": "5.0", "Content": "I researched digital cameras to no end and had a chance to shoot and print some photos with other 2+ mega pixel cameras, in my experience the Canon A20 was the best. The print quality is excellent up to 5 x 7. Anything over this is compromised, but still is better than other 2 mp cameras. Be prepared to purchase rechargeable batteries and an additional memory card. An A/C adaptor is not necessary. The software is excellent and very user friendly.", "Date": "February 28, 2002"}, {"Title": "Do you shoot rapidly moving pets and kids - Youll love it!", "Author": "\"hsap\"", "ReviewID": "R2XUI2849QBPN6", "Overall": "5.0", "Content": "I've had this for about 300 shots (30 saved). I also have four cats, 2 adults and two rambunctious kittens. If I try to use flash, the red eye doesn't work very well on cats, but if I turn off the flash, the shutter speed gets faster and I now have a growing album of adorable kitty pictures. Also took it to a family gathering in a darkened room. There, the red eye was fantastic. When I used Nicad rechargables (I use Monster) I get about 200-250 shots per charge. I always carry a spare set of batteries, and the recharge time is under 4 hours. The Canon case ($10) has room for batteries and an extra memory card. Plus, even though you can control this as you might a 35mm, you can also \"point and shoot\" and you'll still get great pix. Comes with software and cables for PC, MAC, and TV.", "Date": "January 16, 2002"}, {"Title": "A20 - First time buyer", "Author": null, "ReviewID": "R1J53RA78G2U4W", "Overall": "4.0", "Content": "This is my first Digital Camera.  I have found it fairly easy to be up and running (there's a Quick Start Guide).  Battery life so far has been reasonable.  I'm still running on the original batteries after using the LCD extensively, downloading three times, and taking about 60 pictures. I also bought rechargeable batteries and charger.  Also purchased the 128MB SmartCard (it was only $15 more expensive than the 64MB card after rebates). I don't expect to take portraits, but I was able to take pictures of my son's birthday party and send them to my parents a few hours later. They loved it.  Wish it came with a case.  I like the weight - it feels sturdy.  Someone suggested here to buy some of the Palm Pilot screen protectors to apply to the LCD screen.  Probably a good idea since I've kept the original on the camera and noticed a few scratches already.  Canon should recess it just a bit.  Good intermediate camera for the money.", "Date": "November 26, 2001"}, {"Title": "This is a winner!", "Author": null, "ReviewID": "R2Z0KJ9SNZF8KI", "Overall": "5.0", "Content": "I cannot say enough about this camera. After doing significant research prior to my daughters birth, I decided to purchase the A20. Straight out of the box in the delivery room, I began taking breathtaking photographs. My daughter is soon to be the most photgraphed baby in the family if not the world itself.This camera is a snap to use. Point and click and you are off and running. Installation of the software on my Dell computer was also a snap with Windows ME. The pictures download fast using the USB cable supplied. I do recommend that you purchase rechargeable batteries and a larger memory card. Do not get trapped in the whole mega pixel debate. For family use, this camera shoots great prictures. This is a winner!", "Date": "August 3, 2001"}, {"Title": "Great Bargain!", "Author": "Sharon Harris", "ReviewID": "R1X5KFNAOUF7C6", "Overall": "5.0", "Content": "This is an awesome camera in a tiny package.Having used but never owned a digital camera, I spent a lot of time researching various options, with image quality being a major consideration, and ease of use being second.  Having used SLR cameras for years, I am comfortable with them, but I am not all that familiar with digital cameras. After all the research, I decided to try this one...and I am so glad!The camera is straightforward and relatively simple to use, and the software is user-friendly.  I bought a SanDisk reader for download, and would strongly recommend this to anyone as a battery saver.The images from the camera are clear, from close-ups in the house to landscape photos outside, and the color quality is impressive, even without the use of white balance.  I just put it on automatic and shot away.  Saturation of the photos is good, with nice delineation and clean shading.  I am very pleased and look forward to taking many pix with this camera.", "Date": "July 5, 2001"}, {"Title": "No Complaints", "Author": null, "ReviewID": "R3UOTRF5S34PMP", "Overall": "5.0", "Content": "This camera is a fun, but practical gadget.  For the price, the resolution, choice of compression levels, 3x optical zoom, USB connectivity, Canon name, stitch-assist mode, and ease of use make choosing this camera over any other mid-level camera a no-brainer.  You will certainly be disappointed if you try to use standard Alkaline AA batteries with the camera, but NiMH rechargeable AA's are sold in a competitive marketplace and you can buy batteries that can take 150+ pictures before needing to be recharged.  Also watch for the hard waterproof case once it's widely available if you'd be interested in underwater photography, a definite advantage.  The camera will almost certainly be supported under Linux with the gPhoto utility, if Linux-compatibility is important to you.", "Date": "July 5, 2001"}, {"Title": "Great Camera", "Author": "Chester J Ballard", "ReviewID": "R3DHU062V0RUE2", "Overall": "5.0", "Content": "Before this i had a Sony DSC-S85 (799.99) I liked the camera but took it back for one reason only ,the reviews this canon got..Everywhere i look people gave it perfect scores..for the price 299$ at Circit City, now and what it gives you its a must buy. If you dont care for video's,,and just want a great Digital Camera...you cannot go wrong with this at all. It does use alot of batteries but just buy some rechargeable ones and you are all set..it does need better red-eye reduction, but these things alone is all that is wrong with this camera..and software can fix the red eye photos if you want to..the software will not cost you an arm or a leg either.", "Date": "February 20, 2002"}, {"Title": "Very pleased", "Author": "Joe B", "ReviewID": "R1T13VWF1LS6I9", "Overall": "4.0", "Content": "I am an experienced photographer although somewhat new to digital stills.  I have been very pleased with the A20.  The pictures are sharp and the options many.  The only complaint is that the flash head is placed so close to the lens that red-eye is common, even in the red-eye reduction mode.  With the compression options, I can shoot 200+ 1600x1200 pictures on a 128meg compact flash card.  With NiMh batteries, it never runs out of steam.  I was torn between buying a cheaper 'throw away' digital camera and a more expense, higher pixel camera.  I am very pleased with my choice and have not regretted it for a second.", "Date": "February 18, 2002"}, {"Title": "One of the most amazing digital cameras", "Author": "Frank Yeo", "ReviewID": "R3QWEIBMWJHOXF", "Overall": "5.0", "Content": "This camera is simply amazing! I read up on almost all digital cameras finally deciding on this one because of the price and features.Picture Quality - The picture quality is great! It has surpassed all my expectations as a 2 megapixel digital camera. The skin tones are right and colours are not overly saturated. Chromatic abberation is minimal and overall it takes very good photographs. However, camera shake is an issue so you might want to hold the camera still, but this only happens when you turn off the flash in dark conditions. The photographs might appear a little (only slightly) out of focus but don't worry because they will look fine when printed in 4R sizes!Battery Life - Although this camera does not come with a rechargeable battery, I bought 2 sets of 1600MAH rechargeable (Sony and GP) for use. Don't go for anything less than 1600MAH! The battery life is superb even with the LCD screen on.One of the main functions of a digital camera is the WYSIWYG (What you see is what you get) feature, so why compromise by using the optical viewfinder?", "Date": "November 26, 2001"}, {"Title": "good buy", "Author": "\"porkychi\"", "ReviewID": "R1TCO9IYP6XQK1", "Overall": "5.0", "Content": "I recently took the A20, my first digital camera on a trip and was greatly impressed by the color. On top of it all I was most impressed by the flexibility provided by the manual mode.  I just took the camera to the 4th of July fireworks in Boston.  By switching off the flash and adjust the exposure, I was able to capture some nice pictures of the firework.  The power was not a problem, I shot in excess of 80 pictures throughout 40 minutes of the fireworks.  Althought not as small as the S100/S300, its size is decent without the price tag.", "Date": "July 5, 2001"}, {"Title": "Another fantastic feature", "Author": "Amazon Customer \"dwweiss\"", "ReviewID": "R2GU66CMG5CLW", "Overall": "5.0", "Content": "One other feature of this fine camera has not been mentioned - Image Stitch.  I have taken a number of  panoramic image sets using the stitch function.  Canon software which comes with the camera stitches the images together and creates a panoramic view.  The resulting file can be saved in various formats including jpeg and PICT, but also can save it as a Quicktime VR file.  I have taken a number of 360 degree photos.  I love this versatility.  This easy to use camera has the right combination of file size, image quality, ease of use, and versatility.  I have been very happy with the purchase.", "Date": "July 4, 2001"}, {"Title": "Love this camera", "Author": "Hckeyfan99", "ReviewID": "R19QUGPWBE6WDS", "Overall": "4.0", "Content": "After much research over the Canon A20, Sony DSC-P50, or Olympus D-490Z, I decided to go with the Canon.  I have not regretted my decision once.The pictures are crisp and sharp, and color is vivid and intense in bright light and dark areas with the autofilled flash.  (Sony has a reputed problem with taking shots in dark or shady areas) The camera's features are easy and take less than a few hours to figure out and instructions are useful. Camera is very sturdy and construction seems solid, unlike the Olympus D-490Z, where the opening for the lens seems like an expensive accident waiting to happen. There is a macro for taking extreme close ups, panaramic feature, (which I have not tried to figure out yet) timer, and autofill and red eye flash settings. There is also a middle setting of photo saving compression which is lacking on other cameras. But do plan on purchasing NiMH as this will save you much money in the long run.Only a few small irks kept from giving a 5 star review.  Camera and subjects in pictures must be very still when taking pictures or blur is easily visible. Now I'm an amateur and don't know whether all digital cameras suffer from this so just thought it was worth mentioning. View screen is smaller than others and difficult to see in bright sunlight. There is also no medium light setting. What I mean by this is in darker settings, you must either be brighter than bright with the flash, or manually set no flash, which for some reason makes focus more difficult for the camera.  All in all, would recommend this camera to anyone interested in digital photography, even tech illiterates cause the camera is easy enough to figure out. Not to mention the price is also right at $399 compared to other cameras in the 2.1 class.", "Date": "July 1, 2001"}, {"Title": "Hard to Take a Bad Picture with the A20", "Author": "JOSEPH D ORNDORFF", "ReviewID": "RLZR80ZQAB8JT", "Overall": "5.0", "Content": "I've owned the A20 for about six months now. I have nocomplaints. It has taken excellent photos both outdoorsand indoors with just the push of a button. I haven'tseen a need to use any of the manual settings. TheLCD screen is very crisp and gives me a good indicationof the quality of the stored image. Battery life issomewhat of an issue, but this is offset by the fact thatthe A20 uses easily available AA batteries. I use rechargeableNiMH batteries. Turning off the LCD display greatly extends the battery life. Considering thehigh pixel resolution and zoom capabilities, I thinkthe A20 is and excellent value.", "Date": "November 3, 2001"}, {"Title": "What's with this great battery life?", "Author": "\"ntupper\"", "ReviewID": "RPR6MUT5LWDOQ", "Overall": "4.0", "Content": "The disposable AA's that came with it were dead after about 20 shots at highest resolution and the homereplacements were about the same. This camera should be run on three sets of rechargeable 1600 MAH NnMH - one set in the charger, one in the camera and one on standby. I concur with almost all of the other reviews", "Date": "December 11, 2001"}, {"Title": "Beware!", "Author": "Andrew \"andrew_aes\"", "ReviewID": "R363SJXL1MN2Z4", "Overall": "1.0", "Content": "This was the 1st digital camera I bought (after looking at reviews for a year!) In the end I just couldn't find the camera that had everything I wanted so I decided to buy a 2MP camera just to get started, and then a higher MP one when the one I wanted came out.It was a huge disappointment, for 3 reasons: (1) it makes skin tones look brown all the time, and pictures need massive desaturation in Photoshop (sometimes up to minus 35!!); (2) the photos seem to be not quite in focus; and (3) when taking macro shots, you never know what's going to be in focus.On the plus side, the Canon interface is a joy to use and the computer software is very easy also.I returned it after a few days and bought an Olympus C-2100UZ, which is giving me exactly the pictures I would expect from a 2MP camera.", "Date": "November 21, 2001"}, {"Title": "Pays for itself !!!!!", "Author": null, "ReviewID": "RPTUA68WYNWD1", "Overall": "5.0", "Content": "I bought this camera mostly based on reviews here and let me tell you - everyone who rated it high is right ! I'm very pleased with the ease of use and all the extras it has (ex. viewing pictures on your TV by a simple hook up). As most others have stated you need to buy a battery charger and some extra memory (at least 64mb). It doesn't eat batteries as bad as I thought it would. The key is to use the \"non-digital\" mode when possible and view / edit your pictures at one time. I took 75 pictures of my son for our christmas card and was able to pick one to save. I can't imagine how much that would have cost with regular film.Just buy it !!! You won't be sorry !!!!!!!!!", "Date": "November 14, 2001"}, {"Title": "The Best Bargain Camera", "Author": "Clifford Parmeter", "ReviewID": "R3GE7TGN2WH1F9", "Overall": "5.0", "Content": "I recently purchased this camera online along with a Lexar 256MBcompact flash card. I have to say I couldn't have asked forbetter results than the ones I recieved. My first camera outingwas to Storm King Art Center, in Cornwall, NY. I was able toconnect to my laptop with easy. I did installed the softwareprior to leaving me house. I was able to Take 250 picturesdownload to my laptop and begin again. I took over 1,000 photosin one afternoon and the results were AMAZING. This is truelya quality camera. I recommend buy a tripod, rechargablebatteries with charger, and a large memory card if you'll besnapping pictures continually, like myself.", "Date": "October 24, 2001"}, {"Title": "easy fix for LCD glare", "Author": null, "ReviewID": "RVORJXDMXITZJ", "Overall": "5.0", "Content": "I just wanted to point out an easy solution for the glare problem on the LCD with this camera.  Buy fellowe's WriteRight Screen protectors for a palm pilot (at staples etc.) and cut it to fit the screen.  This doesn't cost much and cuts the glare signficantly.Other than that, nice camera.", "Date": "August 23, 2001"}, {"Title": "Great camera with a few problem areas", "Author": "David Solomon", "ReviewID": "RCREF06GMYRPJ", "Overall": "4.0", "Content": "I just bought a Canon A-20 two weeks ago.  In short it’s a great camera.  However, there are several problem areas one should be aware of before buying this camera.  The first big problem is it eats batteries.  Depending on the resolution you are shooing at (I always shoot at the highest) you may only get 20 – 40 shots before the batteries run out.  The solution is to buy several sets of rechargeable batteries and always carry a spare set with you.  The second problem is the flash is rather weak.  In my opinion the subject should be less than 8 feet for the flash to illuminate properly.  Even within this range some shots seem underexposed.  There are some exposure adjustments you can make but I haven’t tried them yet.  Also I don’t want to screw up the exposure for normal daylight since these shots usually seem fine. Another problem arises when shooting indoors with the flash.  The flash refresh seems to be quite slow at times.  I tried to shoot pictures of my daughter swimming and I missed several good shoots due to the delay in refreshing the flash.  I kept holding down the exposure button and nothing happened for perhaps 15 – 20 seconds. This may be due to the batteries running down.  The 8mb flash memory card supplied with the camera doesn’t hold many shots at the highest resolution. Less than 12 I think.  When thinking about spending the ($) or so for this camera you also need to budget an additional ($) or so for a 128mb flash card.  The camera does best in fairly low contrast settings.  If there are bright areas in the background the subject usually comes out too dark.That about covers it on the downside. On the plus side.  Under controlled or even lighting conditions the pictures are awesome.  Colors are really vibrant and very sharp.  For general snapshot photographs the camera is great.  The size is small and very comfortable to hold.  In whole it is a keeper.  Hope this review helps.  Good shooting!", "Date": "July 25, 2001"}, {"Title": "Unbelievable Pictures!", "Author": null, "ReviewID": "R1J1IUT07M22DY", "Overall": "5.0", "Content": "I have had this camera for about a month, and I love it!  I actually purchased the Oympus 510, but it was defective, and no more were in stock, so I \"settled\" for the Canon A20, and I'm glad I did!  The color is SO unbelievable!  My photo looked like something out of a magazine!  I just keep looking at the pictures I have printed in awe, because I can't believe the quality!One thing to consider:  the day you buy this camera, buy rechargeable NimH(?) batteries and at least a 32mb compactflash card.", "Date": "July 1, 2001"}, {"Title": "Wonderful in all respects", "Author": "john", "ReviewID": "R3S6X91KXL7RD", "Overall": "5.0", "Content": "I've had my A20 for about 4 months now, and couldnt bemorepleased...Picture quality is great, and the macro closeups are wonderful(though they do NOT appear on the \"film plane\" as they doin the viewfinder).I dont use the LCD panel while taking pictures , so battery lifeis fine for me. I have it set so the panel flashes on momentarily so that I can verify the pictue, then turns itself off. In this way, I got over 90 pictures before I needed to replace batteries. For sure get some Nickel Metal Hydride batterias (a wally world item) though!Great camera ! You'll like it!", "Date": "April 25, 2002"}, {"Title": "Software not so great", "Author": "Oliver Crow", "ReviewID": "R1D7AJFY4O23MB", "Overall": "4.0", "Content": "After owning the PowerShot A20 for about 6 months I love the camera, but hate the bundled software.  On the hardware side everything is fine:  the battery life is good, the picture quality is good.  I use a 128MB Compact Flash card with the camera, which can store more than 400 pictures at medium resolution (1024x768), which is plenty good enough for posting on websites.  The big downside is the software.  Canon provides a Windows application called ZoomBrowser to use with the camera.  It has lots of fancy graphics, and also lots of user interface problems.  Although the ZoomBrowser interface can fill the screen only a very narrow band is dedicated to the pictures on the camera, making it difficult to see what you are working with.  Whilst downloading the ZoomBrowser window constantly pops to the front, so you can't do any other work on your computer.  The browser interface can get out of sync with the picture files on your hardrive, which is extremely confusing.  Overall it is a bloated package which has lots of useless features, and does a very poor job of the one thing for which it is necessary -- downloading images.  I did find a better solution -- for $10 you can buy the shareware Cam4You utilities from [...]  This program does a much better job of downloading pictures from the camera, without all the cruft.  The interface is a little unpolished, but it functions much better than the Canon software.", "Date": "July 30, 2002"}, {"Title": "Wide angle with flash a problem", "Author": "John C. Chatham \"AUstinJohn\"", "ReviewID": "R2OORES82J4BQM", "Overall": "3.0", "Content": "We bought this camera because it had a wide angle lens which could be purchased and attached to the camera. When the wide angle lens is attached and you use the flash, there is a large dark place, (approx 1/8 of total photo) on the bottom of the photo. It appears the lens attachment blocks part of the flash. Very very poor design.However, in all other uses we are enjoying the camera. I just wish we had not purchased the camera for the wide angle capability.", "Date": "January 25, 2002"}, {"Title": "Wow, what a camera !!!!!!!!!!!!!", "Author": "Richard Fleming", "ReviewID": "R3K03WAD5DP5EM", "Overall": "5.0", "Content": "What a picture taker. Awsome!!!!!! Great battery life, I just returned from a shoot and took over 200 pictures using the flash 90% of the time on one set of batteries. Take professional photo's right out of the box, easy to get started.I can't keep my wife away from it, she has never liked to take picture's untill she tried the A20, she haas become a photo nut like me. If you are a beginer or a pro this is the only way to go. Thank's Canon for a great camera. I have already saved enough money on film processing to pay for it and I have only had mine for 2 months.", "Date": "November 19, 2001"}, {"Title": "Good Camera - EATS BATTERIES!!!", "Author": "\"dboyll\"", "ReviewID": "R47ESUDQ46P8S", "Overall": "2.0", "Content": "I have to start by saying that the pictures I have taken with this camera have been nice. Except for the 20 or so that got wiped out by a CF card error when the batteries went down. I would highly recommend to anyone buying this camera - get yourself a USB CF card reader and dump the images frequently to your PC. And try to avoid reviewing shots you have taken in the camera. Dump the files to your PC and then you can look at them all you like. I would also avoid deleting shots while shooting, as this will put you at a high risk of card error due to losing battery power while reading the CF card. Get a large capacity CF cards and edit the shots when you get home. Another annoying thing about the camera is that when the batteries expire (as they do constantly), the zoom lens is frozen in position. Without battery power, the lens doesn't retract into the camera. The integral lens cap also remains open. This has to have been an engineering oversight. Why couldn't the camera just close the lens and THEN shut down? Duh.Summary:Good camera, Frustrating power and CF card error issues.Don't believe the hype. Shop around and ask questions.", "Date": "January 14, 2002"}, {"Title": "This Camera is perfect for the point and shoot crowd", "Author": null, "ReviewID": "R8V3OFXQG23Z2", "Overall": "4.0", "Content": "This camera is great! It has a 3x zoom, great picture quality and best of all it runs on 4AA batteries which makes it great for vacations. I suggest getting rechargeable high-capacity batteries and a charger. I wish this camera would have included a case as the camera body is made of plastic and the LCD screen is exposed to scratches and nicks. This is a good camera for those new to digital cameras who don't need percise control over the picture settings. If you do need the control I suggest a Nikon Coolpix 990 or a Nixon G1. Overall this camera gets 4 stars for picture quality, size and easy of use. However, it misses the final star for being on a 2.1 megapixel camera when most new cameras are 3 megapixels and above.", "Date": "May 18, 2001"}, {"Title": "Decent Value Camera", "Author": "mad gamer \"jstream99\"", "ReviewID": "R2GN720TN3VK11", "Overall": "5.0", "Content": "Pros:Excellent image quality (note: try use Medium resolution - 1024x768 pixels) for 2.1 megapixels camera. Easy to use. Convenient software and USB Interface Cable to download to your PC. Note: when downloading pics to your PC try to find folderwhere pics have been saved ( usually they under Canon > Zoom Browser > Samples) You can later rename images how you want it instead of reference them by number as 1230-1234432.JPGCons:Requires 4 AA size batteries.Solution - buy only 'Lithium' batteries (I use Energizer) since AA batteries will stand only 15-20 shots.", "Date": "August 9, 2002"}, {"Title": "Great Camera For The Amount I Paid", "Author": "ATN \"atn_machine\"", "ReviewID": "R1CFR9R18ROWTA", "Overall": "5.0", "Content": "I bought this camera factory refurbished. I chose that over the newer A40 because I didn't need movie mode, saving money was more inportant.The shots this camera takes are great, the interface is clean, and it has quite a nice zoom. My favorite feature is the continous shooting.The USB cable takes a little while to start working with my WinME box, as it doesn't recognize the camera on the first try. Instead I use a CF reader. I have 2 sets of 4 NiMH batteries, because all digicams have quite an appetite for power. I also got a Viking 128 meg CF card.I use this camera for sports photography, especially swimming. At an outdoor pool on a sunny day, the shots are bright, sharp, and clear. The ability to shot multiple pics at once means that I can get the exact moment more easily. That's great for the dives at the beginning. However, when I used it indoors under flourescent lights, blurring occured. The shutter remained open too long for the action shots, and you have no control over the shutter. With the white balance set to flourescent, indoor pics do come out clear, as long as there's no action.All in all, if you track down a cheap refurbished A20, you should seriously consider buying it, as it's a great camera.", "Date": "August 5, 2002"}, {"Title": "this baby has everything", "Author": "sandra favreau", "ReviewID": "R2Q43OTZ86ONC3", "Overall": "5.0", "Content": "I researched for about 2 weeks before I finally decided on this camera. I was down to the final choice between the olympus and this one. The reason I chose the canon A 20 was it had a wider iso range and also for the panorama feature. The A20 is so easy to use. I was taking pictures within 10 minutes of opening it.Downloading the pictures was simple and quick with the usb port.The quality of the pics was so wonderful I cannot give it enough praise.Crisp and clear and fantastic colors.Although I agree you do have to order the ac power adapter. It is a guzzler. The batteries I got with the camera lasted 2 hours. I have since got the rechargeables and no problems. The software with this camera however is no use to me whatsoever but that is no problem as I have all my own software loaded that I am used to and enjoy.So forget about the software and just have a great time with this camera. It is the best I have ever owned. and I have owned a lot of cameras.", "Date": "March 13, 2002"}, {"Title": "good entry camera", "Author": null, "ReviewID": "R3L7ZDM7WJ13LF", "Overall": "4.0", "Content": "Good entry camera... didn't do too well at the dark aquarium using the manual settings. It is very good for snapshots indoors and out under reasonable lighting.  Great color reproduction and nice design.", "Date": "February 8, 2002"}, {"Title": "Canon A20 digital camera", "Author": "Robert Burger", "ReviewID": "R1JFV2I6YBFJGB", "Overall": "5.0", "Content": "I recently purchased a Canon A20 digital camera and I am more than happy with it.  The pictures this camera takes are GREAT and the colors are fantastic.  It's also very easy to use. Ni AA's last a long time in this camera ( a long time for a digital camera).  A 32 meg memory card gives me over 140 pictures at small size(640x480), super fine quality.", "Date": "September 28, 2001"}, {"Title": "Out of the box easy", "Author": "J. Ryder", "ReviewID": "RR7ISB6CFWIQZ", "Overall": "5.0", "Content": "This camera can be as simple as point, shoot and you have great pictures. The software is straight forward and easy to use. It really makes picture taking a fun family event. My only complaint is it does not support a USB connection to Windows 95. A NIMH battery charger is a must as well as a larger compact flash card.  It also has many advanced features that will keep anyone interested.  The picture qulity is much better than I expected. Film is done.", "Date": "June 6, 2001"}, {"Title": "Older Canon digital camera the A20", "Author": "Susan T.", "ReviewID": "RDW0VDGP3N7TX", "Overall": "5.0", "Content": "I just purchased another Canon A20.  This one was used.  I use them in my business to photograph houses.  I have 2 currently  being used and this will be the third.  I have purchased other digitals, Fuji, Pentax, Nikkon, and even the newer Canon 510.All have had problems and did not last 6 months.  The Canon 510 has a major design/engineering flaw.  When the batteries die and the camera is in the process of taking a photo, the lens attempts to retract into the camera but gets stuck.  When new batteries are put in, the lens will not move.  You cannot take photos with it.  After the  fiasco with  the new Canon and the other name brand digitals, I decided to try and find an A20.  I did and it works as good as my other two, though it is used.", "Date": "September 6, 2005"}, {"Title": "out of date now", "Author": "Mr. T. Barton \"T Barton\"", "ReviewID": "RM5UW0Y82PNGH", "Overall": "4.0", "Content": "I have been using this little camera regularly since march 2002 when I traded in my Canon EOS SLR (yeah I know but I wasn't using it enough - digitals are so much more convenient).Now I know what digi cameras are all about i'm ready to upgrade to a G5 or something similar. The A20 is fine for most situations but my main gripe is that it cannot cope when there is little detail in the subject; a plain background will produce an almost watercolour result. Where there is a lot happening the results are sharp enough. Batteries run down quickly but I always carry spares.The flash is inadequate.", "Date": "December 3, 2003"}, {"Title": "Great Camera", "Author": "Robert M. Chism", "ReviewID": "R3PP42494M8LEI", "Overall": "5.0", "Content": "This is my first digital camera and I'm quite impressed with it.  The zoom is great, and I love the digital zoom after you have the optical zoom all the way out.  The auto flash and timer are great features, too.  I found that is camera is very upgradable; you can get different lenses, more compact flash cards, a printer that connects directly with the camera, and ever more yet!!  It works really good on a tripod.  It takes some beautiful pictures and has great resolution.  Very nice camera!", "Date": "March 14, 2002"}, {"Title": "Very Good Middle of the road Digital Camera", "Author": "Richard D. Cappetto \"RickDC\"", "ReviewID": "R288Z8YXPPL2J4", "Overall": "5.0", "Content": "The Cannon A 20 is a nice middle of the road digital camera and is versatile and easy to use. In the high resolution mode you can get very fine 4x6s and nice 8x10s. In lower resolution modes you can fill up the cards with lots of pics for use on your computer (web sites etc.,) The camera has OK software, easy to use, but not lots of features; but it does have a cool panoramic feature and on the camera and has software where you can stitch together many photos, which is really cool. The A-20 is ergonomic and fits in the hands nicely. If you looking for a good Digital camera at a good price the A-20 is a good one.", "Date": "February 17, 2002"}, {"Title": "Easy to use", "Author": "Katieq \"readaholic\"", "ReviewID": "R1GGC1Z0YFWZZ8", "Overall": "4.0", "Content": "This camera is a beauty. It is small and compact, easy to use and takes very good quality photos. The software with it is also easy to use. Whilst 2 weeks into the warranty my lense died I found Canon (Australia) reasonably quick in repairing and replacing the lense. Since then it hasn't missed a beat and I am really click happy.", "Date": "February 5, 2002"}, {"Title": "The Best 2 megapixel choice", "Author": null, "ReviewID": "R2FHBMNHP1TLRN", "Overall": "5.0", "Content": "After Reading tons of review and viewing a lot of sample files, the bottom line was this is the best 2 megapixel camera in terms of picture quality.The price is a bit steep when compared to the other 2 megapixel models but it is well worth the investment.Having used the camera for the last 15 days I dont have any regret in choosing this model.This camera needs a lot of battery power and that is not a surprise since all the digital cameras with a LCD display chews the batteries. Get yourself a good set of recharable AA's. (Make sure that you buy the NiMH rechargables since the older type of rechargable batteries will heat up your camera).", "Date": "January 24, 2002"}, {"Title": "Fantastic Quality", "Author": null, "ReviewID": "R18FWEV0IMHAMU", "Overall": "5.0", "Content": "After spending several hours reading the reviews on Amazon for all the different digital cameras available now, I decided onthe Cannon A20. This is my first digital camera and after spending the past weekend taking pictures of everything in site, I'm in love with it. It's easy to use and the picture quality after uploading the images to the PC is fantastic!I'd definitely recommend this camera to anyone looking to buy one in the 2 Megapixel range.", "Date": "September 4, 2001"}, {"Title": "Photography is (now) fun!", "Author": "Ailey Baxendale \"AB\"", "ReviewID": "R1904SWXXVEP0G", "Overall": "5.0", "Content": "I never thought I would enjoy photography so much.We bought this camera while we were on vacation, and the very first photos we took with it were excellent, despite the fact that we had the resolution set to 640 x 480.  The zoom is wonderful - as I learned when I wanted to take a sunset photo but some trees were in the way on the left: I used the zoom to get past them.One of the sunset photos was printed by EFrames.com onto regular photo paper, and I've got it sitting on mydesk:  you can't tell that it was taken with a digital camera.This is a great, well thought-out product that is fun to use.", "Date": "May 19, 2001"}, {"Title": "Average performer at a premium price", "Author": null, "ReviewID": "R3N9M7P7CUQKCB", "Overall": "2.0", "Content": "I'm not 12 yr old, but its the only way I could write the review without the hassle of registering. Sorry. :-)ProsGood design and interfaceExcellent outdoors performance (then again, most cameras are)ConsEats batteries, even 1700 mAh Ni-Mh onesExposure performance is useless indoors and at night, limited by ISO 100/150 onlyThe [expensive] street prices don't justify the performanceI tried three other cameras that were capable ISO 400 exposures and the difference was literally night and day. With the flash on, the picture gets washed out (EV compensation is useless), with flash off, the A20 compensates by slowing shutter speed which results in blurry pics (unless you have a tripod or a rock steady hand).All-in-all, Canon has let me down...big time ! I sincerely expected better from Canon.", "Date": "July 9, 2002"}, {"Title": "Best Bang for the Buck", "Author": null, "ReviewID": "RFO439PCPFJII", "Overall": "5.0", "Content": "No downside here. Easy to use, great quality photos, good software. This is a great choice in this range.", "Date": "February 20, 2002"}, {"Title": "This is a great camera!", "Author": null, "ReviewID": "RCAA3NUMMDL54", "Overall": "5.0", "Content": "I really like this camera.  You get a great camera for the price you pay.  It's easy to use, and the photo quality is way beyond what I expected.  It's also realatively small and light weight, so is easy to carry around.", "Date": "November 27, 2001"}, {"Title": "Got this for a friend in Ohio, he used it once", "Author": "Brian Moore", "ReviewID": "RD5TCMMQ9XN03", "Overall": "1.0", "Content": "I purchased this camera for a friend in Ohio after he fell in the lake while fishing and ruined his.  I was a surprise gift and he used it one time and cannot get the sd card to eject.  He called Canon but there was nothing for them to do.", "Date": "June 22, 2013"}, {"Title": "Best Camera in my life...", "Author": "C. Chiu", "ReviewID": "RIHOFYZK0SEJH", "Overall": "5.0", "Content": "This is my first digital camera, and I've been using it since 2002. It has taken more than 10k photos and still works like a charm. The only reason that I decided to replace it is it's getting bulky, also the LCD screen is too small in nowadays standard.The size: it's a big and bulky, but with 4x AA battery can last you 250+ photos before replacing themBattery Life: i use 1800amh batteries and they last 8 hours before I need a new set of batteryQuality: The usual Canon quality, and it's still beat some of other entry level camera that's released in 2010. The only problem is noise level is quite high at ISO 400.Control: it doesn't have the 4-direction button for you to choose from.Reliability: the best I know! It's been 8 years and it's still going without ANY problem.", "Date": "May 20, 2010"}, {"Title": "Great Small Canon Powershot", "Author": "Bill A. Belt", "ReviewID": "R2UJXXJO83RTPQ", "Overall": "5.0", "Content": "When my granddaughter lost her digital camera I looked around and did a little research on a replacement. This is the camera I came up with and my grad daughter dearly loves it. It is easy to work , easy to carry and very lightweight. The picture quality is very good.She loves the 3X zoom lens. Even after weeks of heavy use the case still looks new.", "Date": "November 14, 2009"}, {"Title": "very good first time camera", "Author": "WM", "ReviewID": "RA0183Q254WLG", "Overall": "5.0", "Content": "This was the first digital camera I owned, and I loved it. The features are endless, there are multiple shooting modes, and it is easy to use.", "Date": "December 28, 2006"}, {"Title": "A Work Horse", "Author": "Peter B. Kingman \"KingMan\"", "ReviewID": "R1CD6Z3PFP84CH", "Overall": "5.0", "Content": "The Canon PowerShort is a workhorse of a digital camera.  I have had mine for 4 or 5 years and taken thousands upon thousands of pictures.  The camera has never failed that I remember.", "Date": "February 22, 2006"}, {"Title": "Excellent Digital Camera For The Money", "Author": "Framyr M. Aguiling", "ReviewID": "R2YET9B24CWJR2", "Overall": "4.0", "Content": "I bought the Canon PowerShotm A20 over a year ago and think it is a fine digital camera. It takes crisp clear pictures that can be easily downloaded to your PC using a SanDisk. The only draw back is that it eats batteries (4 AA).", "Date": "April 19, 2003"}, {"Title": "Canon Powershot A20/A10 Manufacturing Fault", "Author": "Tahir Qayyum", "ReviewID": "R2MWKRIWZIUJWS", "Overall": "3.0", "Content": "I bought Canon a20. And I m really satisfied with its result. Outdoor result is outstanding and it really give natural colors indoor result is slightly dark.. But when u uses manual white balance its good. Alkalinebatteries give good backup time if you didn't use LCD screen. But I suggest to buy rechargeable battries.a biggest fault which I find in it is that it didn't give u the accurate focus on optical finder. Means if you focus a specific area and when u takes a snap of that u get a wide area result.I don't know what'stechnique behind it. but if you use LCD for focusing something then it gives u accurate result. Focus is really good and I also use MACRO mode it's also fine. Panoramic Features are cool but I am trying to get 360 digree picture with it. if anyone of you know technique of that then pls tell me. The only fault which I told u it gives me problem sometime.", "Date": "February 18, 2002"}, {"Title": "Great Camera for the price.", "Author": "R. Mccrea", "ReviewID": "R1YLM237Q8SA5P", "Overall": "5.0", "Content": "Just recieved the camera on the 11th of February and have took some pictures and printed some out. It is very easy to use and the quality is great. I had a Agfa CL30 1.3 megapixel. It worked good, but I wanted a zoom lens and more pixels. This is a very good camera for a beginner also. I would highly recommend this camera.", "Date": "February 13, 2002"}, {"Title": "Beware!", "Author": "Andrew \"andrew_aes\"", "ReviewID": "R29DIF2NZLFYXX", "Overall": "1.0", "Content": "This was the 1st digital camera I bought (after looking at reviews for a year!) In the end I just couldn't find the camera that had everything I wanted so I decided to buy a 2MP camera just to get started, and then a higher MP one when the one I wanted came out.It was a huge disappointment, for 3 reasons: (1) it makes skin tones look brown all the time, and pictures need massive desaturation in Photoshop (sometimes up to minus 35!!); (2) the photos seem to be not quite in focus; and (3) when taking macro shots, you never know what's going to be in focus.On the plus side, the Canon interface is a joy to use and the computer software is very easy also.I returned it after a few days and bought an Olympus C-2100UZ, which is giving me exactly the pictures I would expect from a 2MP camera.", "Date": "November 21, 2001"}, {"Title": "Canon S-20 A Winner!", "Author": null, "ReviewID": "R128CXC6OB457B", "Overall": "5.0", "Content": "I have been an avid photographer for 30 years mostly using a 35mm SLR. I also carry a 35mm Nikon point and shoot. I thought a digital camera would be fun but really didn't expect too much from it in terms of quality images. Before buying this unit I read every review I could find on several models and ultimately settled on this one. I have to say that I am surprized and delighted with the capabilities of this camera.Accessing the menus is simple, the controls are easy to use and the pictures are terrific. The camera rests comfortably in your hand with the zoom control handy to your right thumb. To make sure I wouldn't run low on power, I bought 2 sets of Ni-MH batteries and a charger the same day I got the camera. I take nearly every shot with the display turned off and I don't have a single complaint about battery life. Since I started looking for a digital camera, I have been paying more attention to other people using theirs' and I can't believe how many people use the display when they are shooting pictures. No wonder the batteries run low! Personally, I can't see how they can take pictures like that... well I guess people like the gadgetry. The software is pretty basic but it installed without a hitch and seems to work perfectly. As far as a reliable, easy to use point and shoot digital camera, I think this one is great! I also think that some of my older stuff may be collecting a bit of dust except for the most demanding tasks.", "Date": "September 24, 2001"}, {"Title": "Perfect Camera for First-Time Digital Buyers!", "Author": "John L. Maillard \"Digital Enthusiast\"", "ReviewID": "R16AOLPB5UE4VE", "Overall": "5.0", "Content": "All I know was that I wanted a digital camera. After looking at some high-priced models with major megapixellage (is that a word?), I decided that this Canon was the best. It's quick, simple, and does what it should do best: take digital pictures. Add a Canon S600 printer to your computer, and your images will rival that of any high-priced photo shop! The USB connection is terrific, as well as the video out cable for putting the pictures on my mom's TV after we got back from vacation!! Not much else to say except this camera is highly recommended. Do yourself a favor and get some rechargable batteries, though. This thing uses alot of power like nothing else. A great buy.", "Date": "June 11, 2001"}, {"Title": "great camera", "Author": "\"johnvacaville\"", "ReviewID": "R1Q6BXLM407GS7", "Overall": "5.0", "Content": "This camera is great.  The quality is good, once you figure out what your doing.  It's extremely simple to use and great camera for taking pictures of family and friends.- HelpfulReviews.com", "Date": "October 12, 2002"}, {"Title": "An excellent 2MP camera!", "Author": null, "ReviewID": "R2R6KKFQPF7DPT", "Overall": "5.0", "Content": "This is a great novice point and shoot camera. The ability to use recharable nimh batteries is also excellent as you don't have to buy an expensive proprietary battery. We've got well over 80 shots and still have yet to change the batteries.Highly recommended.", "Date": "June 6, 2001"}, {"Title": "Batteries last long", "Author": null, "ReviewID": "R7T2FMCIX9M1V", "Overall": "5.0", "Content": "This camera has everything I want in a camera.1. Great Battery life.  I'm using rechargable lithium batteries, and I wanted to run them down the rest of the way the other day and charge them fully. (Holdover from NiCad days.) I took pic after pic after pic, I left it on until it would auto-shutoff a bunch of times.  It took forever.  And these batteries are from Nov. of 2001!2. Picture quality is great.  I use smallest of 3 sizes and middle of 3 resolutions for most pics.", "Date": "February 7, 2003"}, {"Title": "My first digital camera", "Author": "Franklin R. Nickau", "ReviewID": "R3SEVXNWUFKWCK", "Overall": "5.0", "Content": "This is my first digital camera & to tell the truth I was scared that I would get a digital, use it once or twice & then go back to my 35mm. But a salesman who know his stuff & spent as much time with me as I needed convinced me. That & the A20 was on sale for a very good price. The camera is easy to use, takes great pictures & seeing the pictures right away is the greatest.Also the 8x10 enlargements are Photo-shop quality. I would recommend it any time, partically for first time buyers.", "Date": "February 15, 2002"}, {"Title": "Quality pictures excellent for e-mails", "Author": "Leonardo \"Life is one big puzzle....\"", "ReviewID": "R86WNBRKG0DRL", "Overall": "5.0", "Content": "I bought the A20 some months ago.The pictures have an outstanding quality, also in a dark environment. The camera is user friendly and the software included with the camera is good.I advice that users buy rechargeable batteries as it consumes lots of batteries when the display is being used.", "Date": "October 24, 2001"}, {"Title": "Great Camera", "Author": "Joe", "ReviewID": "R165JIFWXA5E68", "Overall": "5.0", "Content": "I decided I finally had to get a digital camera just before I went on vacation so I did a quick search on Amazon and came up with the Cannon A20 after reading all the good reviews. This camera has not dissapointed, and works great with windows 2000 pro. The picture quality is awsome as well are all the other features.", "Date": "August 16, 2001"}, {"Title": "Good but expensive power supply", "Author": "\"bellaitalia\"", "ReviewID": "R3H6HIYZ94RKTZ", "Overall": "3.0", "Content": "Easy to use and great shots.  Be aware that you will need to add more money for the AC Power Adapter, otherwise you are always running on batteries, that do not last long...", "Date": "August 4, 2001"}, {"Title": "Fragile", "Author": null, "ReviewID": "R2IFEKCI1T4I6U", "Overall": "2.0", "Content": "I wish the camera reviews could include drop tests likethose done for computer laptops.Because of its metal casing just like for the Canon S10/S20,all the shock from a minor drop is transferred to thecamera lens and interior. As a result, a 3ft drop willdestroy this camera.", "Date": "September 5, 2001"}, {"Title": "Canon Powershot A20/A10 Manufacturing Fault", "Author": "Tahir Qayyum", "ReviewID": "R3A73VVI85JBHA", "Overall": "4.0", "Content": "I bought Canon a20. And I m really satisfied with its result. Outdoorresult is outstanding and it really give natural colors indoor result is slightly dark.. But when u uses manual white balance its good. Alkaline batteries give good backup time if you didn't use LCD screen. But I suggest to buy rechargeable battries.a biggest fault which I find in it is that it didn't give u the accurate focus on optical finder. Means if you focus a specific area and when u takes a snap of that u get a wide area result....BR>I don't know what's technique behind it. but if you use LCD for focusing something then it gives u accurate result. Focus is really good and I also use MACRO mode it's also fine. Panoramic Features are cool but I am trying to get 360 digree picture with it. if anyone of you know technique of that then pls tell me. The only fault which I told u it gives me problem sometime.", "Date": "February 18, 2002"}, {"Title": "super power in a small package", "Author": "Alex \"ssjgoku@socal.rr.com\"", "ReviewID": "R35F8IYRPH3J4R", "Overall": "5.0", "Content": "this is a wonderful camera. the pictures look great even at close zoom. i looks complecated but it isn't.the only i wish it came with is a waterproof case.", "Date": "July 3, 2001"}, {"Title": "Canon powershot A20 digital camera", "Author": "Ronald  Drabish", "ReviewID": "RX6CEW69OH591", "Overall": "5.0", "Content": "The canon powershot A20 digital camera is a great camera for people on the go. It is a very easy camera to use. Just point and shoot. If you love takeing pictures then the canon powershot A20 digital camera is the camera for you.", "Date": "June 20, 2001"}, {"Title": "Battery", "Author": null, "ReviewID": "R27TCK2GZ3XN9S", "Overall": "1.0", "Content": "This is one of the worst cameras I have ever encounted. The batteries have to be replaced after 50 shots. Even if you use re chargeable batteries they only last maybe 75 shots The shortest battey life I have ever seen a a camera.", "Date": "May 13, 2001"}], "ProductInfo": {"Price": "Unavailable", "Features": "2.1 megapixel sensor creates 1600 x 1200 images for prints at sizes up to 8 x 10\n3x optical plus 2.5x digital zoom lens with autofocus\nIncluded 8 MB CompactFlash memory card holds 12 images at default resolution\nConnects with Macs and PCs via USB port\nUses 4 AA batteries, included", "Name": "Canon PowerShot A20 2MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/21R07W58YJL.jpg", "ProductID": "B00005ATZO"}}