{"Reviews": [{"Title": "stylish, ultracompact 4MP point & shoot, but no optical zoom", "Author": "jemaerca", "ReviewID": "RAYEHAOUPBZWB", "Overall": "4.0", "Content": "if canon's sd100 was still too big for you, the sd10 is an even smaller alternative.  but you give up the optical zoom.pros:- 4MP resolution!- ultra-compact at 3.6 x 1.9 x 0.7\" weighing 3.5oz.  this is the smallest canon to date.- stylish, all-metal body and you it is available in four colors: bronze, white, black, or silver.- fast startup.- fast shot to shot times.- minimal shutter lag at faster shutter speeds.- impressive overall photo quality for such a small camera.- 5 point AiAF system.- Quick Shot feature allows you to take pictures without prefocusing.- very good macro performance.- AF assist light is very useful for low-light focusing.- has a metal tripod mount, which is not present in all the ultra-compact cameras.- easy to use menu system.cons:- some redeye.- above average noise.- some barrel distortion.- no optical zoom.- more manual controls would have been nice (or at least some scene modes).- no optical viewfinder - this makes it tough when you use this camera in bright sunlight.- solidly built except for the camera/SD door which feels less robust.- RAW and TIFF formats not supported.- expensive for the feature set but you're paying for the ultra-compact package and the panache of this little gem.- metal body scratches easily.- 32MB SD card provided is inadequate so add $$ to your budget to buy external memory.- proprietary battery - again, a few more bucks for a spare.this is another solid effort from canon.  i particularly like the photo quality (especially coming in an ultra-compact package), the AiAF system, the AF assist light, and the body color options.  not having optical zoom and very few manual controls top my complaints, but i guess some compromises had to made to come up with these features in such a small package.  competitors would be the pentax optio s or casio ex-z3 which are slightly bigger and only have 3MP resolution but have 3x optical zoom. for even better image quality (in a slightly bigger package), also consider canon's sd100.  if you can live with a bigger camera, take a look at canon's a80, which has a lot more features in the same price range.i hope this helps you with your buying decision. peace.", "Date": "October 15, 2003"}, {"Title": "Make sure you get \"standard SD memory\"...", "Author": null, "ReviewID": "R3193SL5SIM5XK", "Overall": "5.0", "Content": "The following website suggested that our SD10 cameras were limited to 256MB of SD Memory:  [...]So, I e-mailed Canon's technical support group, and they replied with the following information:  \"As long as the memory is the standard SD memory card you will have no problem at using any size card you would like with the SD-10.  Hope this clears up any confusion.\"So, If you are tempted to buy a 512MB SD card, just make sure it is \"standard SD memory\" and you will be fine.  I recently bought a 512MB SanDisk card myself because the movies chew through lots of memory.  I am a hard-to-impress techno geek, and I really like this product.  The first thing everyone said when I went to took pictures during Thanksgiving was \"look at how small that camera is!\"  It is tiny!  And, I am amazed at how many features they were able to cram into that tiny package.  I have another 2MP Polaroid digital camera with built-in printer.  It is a monster to carry around.  My justification for upgrading to the 4MP SD-10 was that it would be easier to carry around.  And, so it is.When I went to buy memory, I was a little disappointed at the fact that the SD memory is so much more expensive than the Compact Flash memory.  I found 1GB cards of compact flash out there for around the same price as the 512MB SD memory cards.  So, going with another version of the Powershot that uses compact flash could make economical sense if these memory prices persist.I shot some pictures without the flash in a \"barely-lit\" room with ISO400 turned on, and the pictures turned out to be as bright as if the sun were out.  I was amazed at how well they turned out in the low lighting.The super-macro feature is \"mind-bogglingly-awesome\".  I shot a picture of a tiny piece of lint, and it turned out to show a ton of detail on the lint.  It was as if I was looking through a microscope or something.  That is a super-cool feature of this camera that I have never seen before.I don't really miss the viewfinder since the LCD screen is very high-res and easy to see.  The camera is so small that it almost feels like you are taking spy pictures in an old James Bond movie.If they would just throw a hand-held PC, MP3 player, and cell phone into this camera, I would only have to carry 1 device around with me.  I'm sure versions of this already exist, but just not with such a high-quality version of a 4MP camera.My bottom line is that this camera is still a winner (5 stars) despite the higher cost of memory, lack of a view-finder, pricey cost of the camera itself and lack of optical zoom capability.", "Date": "November 25, 2003"}, {"Title": "If size matters, then this is the way to go....", "Author": "\"ofingado\"", "ReviewID": "R2RIVK9NXJFEZS", "Overall": "5.0", "Content": "I just got the camera yesterday and immediately started playing with it. Like all other Canons, robust built, feels and touched nice and expensive. Didn't have to read the manual since this is my fouth Canon over the past several years in the ultra compact line. I like my camera to be very small and light and still robust enough to survive small accidents. The startup time is excellent, pretty much like point and shoot. The display adjusts very rapidly to different lighting conditions. An optical viewfinder wold have been great, but the display is sufficient for me. The picture quality in daylight is great, evening pictures with flash are good . Movie quality in low light condition is for me at least sufficient with little distortion. The audio playback in this tiny device is loud enough to understand everything recorded. The camera can be customized with different startup pictures and sounds for all kinds of functions. The camera came with the usual software, an updated version of Zoombrowser ex and some editing software. Since I use my own preferred software to organize and edit my pictures (good old photoshop and picasa), I only assume that Canon put together an easy to use software package for the novice user.But the camera also has some drawbacks: It is quiet difficult for people with bigger hands to remove the SD card safely and without breaking the card/battery door. As stated by the previous post, the door somehow doesn't fit the rest of the camera. It is made of cheap plastic (the rest of the camera is metal) and doesn't close all the way. I'm afraid it might break off when changing the SD card or battery in a hurry. (better keep your fingernails long to pull out that SD card!)The battery life seems to be sufficient, but I ordered a spare battery just in case.The leather case that came with the package is well made but a little oversized for the camera. It is also missing a pocket for a spare battery or addtl. SD card.Alltogether it was well worth waiting for this device after they stole my old S 330 about two months ago.", "Date": "November 13, 2003"}, {"Title": "The ultracompact of the ultracompact.", "Author": "Andrew Hamada", "ReviewID": "RSHCU4O53D77C", "Overall": "3.0", "Content": "Eclipsed ONLY by the lower-end Casio Exilim cameras in sheer compactness, the appeal of the SD10 in all its various colors is obvious: 4 megapixel snapshots in a package so compact that it won't even feel like a presence in your pocket.  For those desiring a digital camera half as a camera and half as a fashion accessory, this is the way to go.For those more performance minded, however, consider the following.Pros:-Smallest 4 megapixel digi-cam on the market.-Slightly above average start-up time (especially important for snapshooters, whom this camera is geared toward).-Sleek, sexy design.-Canon's 5 point autofocus system, while not especially powerful, is better than the average ultracompact 4 megapixel camera's system.-Canon's image sensor captures better quality images than most other cameras do, within the same style.-Canon STILL uses Compact Flash technology, which is a significantly cheaper media than sD or xD, so you save money here as opposed to competing cameras.Cons:-Picture quality is noticably worse than Canon's other 4 megapixel cameras (S400/410, A75/80, S45).  You pay for the compactness somehow: apparently this is how.-No optical zoom.  While a larger-than-you-might-think majority of people actually do not have much need for optical zoom in an everyday setting, those purchasing this camera for trips may be disappointed.-NO OPTICAL VIEWFINDER.  Again, most people who purchase an ultracompact digi-cam aren't photo enthusiasts and are content to snap off pictures using the LCD as their only reference, but this is bound to be a factor for some customers.  I wouldn't purchase this camera on this point alone, but only because I avoid using the LCD for anything at all times because of the drain it puts on the battery.  Not to mention Canon compacts have a tiny (1.5\") LCD that warrants use of the optical viewfinder.Having said all that, I have to recommend that anyone looking at getting this camera STRONGLY consider the Canon S410 as an alternative.  It is only mildly larger than this camera and has the same resolution, settings, but much better photo quality.  It also has a 3x optical zoom lens, which ends up being an asset at times you didn't expect (think: those 30th row floor seats at a concert, capturing that mountain view from a distance, that gorgeous woman you spied walking across the other side of the club).Misc. Note for a large number of digi-cam purchasers:90% of people who purchase a camera with higher than 3 megapixel resolution do not need it.  With a 3 megapixel camera, you can make prints of up to 5 x 7 without a noticable loss of quality, and barely any loss of quality for 8 x 10.  If your computer is running at 1600x1200 resolution, the maximum size picture taken by a 3 megapixel camera will more than fill the screen.  The moral of the story is this: do not be lured by larger megapixel sensors that you do not need.  Look at how the camera performs in other ways, and what features you'd find the most useful.  The only reasons you might want a larger resolution camera are: because you intend to crop a large majority of your photos, because you want to make poster-size prints, or because you're a graphic artist that needs to be working with as many pixels as possible to ensure quality.", "Date": "June 16, 2004"}, {"Title": "Great Camera !!", "Author": "Philip Young", "ReviewID": "RCXKR9CA6ZIBC", "Overall": "5.0", "Content": "I got this small camera because I needed a quality camera which I can carry on my belt for those instant shots. Boy, I am extremely impressed with the quality of the pictures!  I also have a Sony F828 8 Megapixel and let me tell you, this camera is up there if you are just printing an 8x10.  It was a bit difficult to tell which pictures came from which camera unless you look really close.  I also have a Sony Cyber Shot V1 (5 Meg) and the Alph is also up there with the V1, but the Alph's pictures are more colorful than the V1. The V1 is also an impressive camera but not as portable and not quite as color-saturated. The flash on this is much better than the Nikon 5000 because the Nikon flash was too bright most of the time and inconsistent.  The color saturation of the Alph is similar to the old Nikon 950, which I love - but the images are much sharper on the SD-10 Alph.  It comes with a very nice leather belt holster about the same size as your cell phone and it's just great for portability, virtually un-noticeable.  I just absolutely love this camera and have it on me all the time. Get one, you won't regret it.", "Date": "January 30, 2004"}, {"Title": "(...) this thing is small", "Author": "doppelganger", "ReviewID": "R255DALAUC7F9", "Overall": "5.0", "Content": "The picture at Amazon makes it look huge in comparison (once you take it out of the box, you will be stunned at the actual size). I almost made the mistake of getting the Casio because it is so tiny, but reviewers said the 4MP Casio was a complete sham (more like 2MP) so I got this one instead. Very glad. Night mode is excellent and everything else is Elph quality- basically what you'd expect. Pretty tough too.Just to be sure, I got a \"standard\" memory card because I was told the other ones wouldn't be compatible?", "Date": "December 7, 2003"}, {"Title": "Excellent Camera, No Regrets!", "Author": "john chang", "ReviewID": "R2L1Z5797R5Y3C", "Overall": "5.0", "Content": "This is perfect for you if you are looking for a small, portable digital Camera. You can take this thing anywhere.Pros:1. Size and weight - I love the fact that you can just drop it in your pocket and head on out. It's small, sleek, and light weigt.2. Picture quality - At 4 megapixels, this is not a technological lightweight when it comes to picture clarity. The pictures I have taken so far have come out excellent.3. Canon Quality - Canon makes great digital cameras that feel sturdy and are well - built.Cons:1. Digital Zoom/Lack of optical zoom - The zoom feature of this camera is not good at all. It's a trade-off for its compact size. When using the digital zoom, the pictures dont come out very sharp.2. Red-eye - You will note a tendency for images to have a bit of red-eye in the subjects. That's not much of a problem if you have image editing software.Suggestions:1. Buy a bigger Memory Card - the one that the camera comes with is too small. At the very least, get a 128mb card, 256/512mb is my recommendation.2. Buy an extra battery - this way when you are out, you can just swap batteries without having to worry about how much power you have left.3. Buy a USB 2.0 memory card reader - If you take a good number of digital pics and your computer has a USB 2.0 port, then a reader is excellent for downloading pictures and transferring it to your computer. USB 2.0 is very quick and where a typical transfer may take approximately 5 minutes, with USB 2.0 the same transfer will take 45 seconds.4. Get image editing software- This affords you the opportunity to brighten images, sharpen images, take the red-eye out, crop images. I use adobe photoshop, but any image editing software should do. It just gives you a greater sense of control over the output.Conclusion:You know that there will be a trade-off in some camera functions for its small size, and for me, I have no regrets about it. I simply can't get over how small the camera is. It excels in close to medium distance images in daylight. At 4 megapixels, the resolution of the pictures is very satisfying. This camera delivers as promised.", "Date": "July 10, 2004"}, {"Title": "Great pictures & looks great", "Author": "Jean S Yee", "ReviewID": "R393VVLNVDJ8UR", "Overall": "5.0", "Content": "My wife brought the bronze version for me for Christmas.  I'm an adv. amateur and have had a number of Canon cameras.  I find it to be a perfect walk around camera to complement my Canon G1 & 1D.  It's a great looking camera too.  Usually, Canon cameras are set up to slightly underexpose to prevent highlight blowout.  But the SD10 pictures come out perfectly exposed right out of the camera.  Skin tone, expecially on light skinned people is great.  On the other hand, with my G1, I usually had to reduce the magenta, bump up the red, and add a dash of green to get the right color balance for light skinned people.  Still, I put all pictures I care about through PhotoShop to get everything perfect.I don't miss the zoom lens at all.  In return I get really sharp pictures.  The macro mode is fantastic, allowing focus as close as 1-1/2\".  Just remember to switch out of macro when done because it stays in this mode thru a shut down.The flash is surpringly powerful but it's no 550EX.  I get just acceptable shots with group pictures but it works well for 2 people.  It does a good job of adjusting the exposure based on subject and distance, but again, its not perfect.  Ex: I would not recommend for weddings (black groom/white bride).  The camera startup is really fast.  The focus speed is also very fast, probably due to the non-zoom lens - much faster than my G1. I was concerned about the level of image noise due to the really small sensor on this camera, but it's fine for 4x6 prints, even at ISO 200.  ISO 400 for dark night shots (no flash)is not usable for me.  I had no problem focusing in low light, such as in restaurants, because of the bright focus assist lightI carry it around all the time and have used it to take snapshots of white board diagrams at work.  Its small size really encourages me to take a lot of picture.  I bought some extra non-Canon batteries & additional charger on ebay at cheap prices.  They works fine.", "Date": "April 2, 2004"}, {"Title": "state-of-the-art little cam!", "Author": "Ana Riet \"Ana Riet\"", "ReviewID": "R3G7EITZD5L7L8", "Overall": "5.0", "Content": "i was completely and absolutely dazzled by how powerful and small this camera is.i've seen smaller cameras in the market, like the infamous casio exilim, but as far as i'm concerned, canon has truly achieved the smallest size a camera could have WITHOUT prejudicing its quality.i've previously owned a canon powershot s110, which has only about 2MP, and i truly loved it. i was almost completely satisfied with my s110, as its image quality was stupendous: the only problems i had were regarding the shooting speed and the camera's size (which, i know, is considered small. but even so, i wanted an even smaller one).so my main goal was a camera which could take great-quality pictures, which had a very short shooting-speed and yet was small enough to fit in a pocket.well, i've come to learn that s10 is well-packed with all the requirements above.previously to buying this camera, my major concern was its shooting speed, as i didn't see any reviews on that. well, here goes the first one:this camera has two shooting modes: one is short, and the other one is shorter. amazing!the \"short\" one is with the auto-focus function enable. it takes about 1 second to take a picture with perfect focus on the angles selected by the user (it draws little green squares on the screen, showing which areas it is going to focus). and to do that, all you have to do is press the shutter button half-way down, wait for its artificial inteligence to focus on the desired subject, and then press what's left of it.the \"even shorter one\" is an \"emergency\" kind of shot. you just simply press the shutter button all the way down, and BAM: you have an almost instantly picture taken. it's truly unbelievable.of course the picture quality in the shortest mode isn't as great as it is in the AIAF (artificial intelinge auto focus - you'll hear that a lot) mode, but it's for sure a big helper for situations on which you don't actually have time to wait up for the camera to focus (not even one little second).other one of the impressive camera features is the possibility of choosing the startup image (the image that is shown on the LCD when the camera is powered on), the startup sound, etc., and, fabulously, the auto-shutter sound - which is great! i, for instance, recorded cartman's voice (from south-park) and set it to play as the auto-shutter goes of. you can have really funny pictures with tricks like that, because the people on subject have no idea of what that sound is and start giggling as the picture is taken. and then, there goes a smiley, happy picture. you can upload to the camera any sound or image on your computer, or use one that is already in the camera.the time the camera takes to turn on is also something to be noticed. it's about one second (or even less). so if you're on a hurry to take a quick-shot, you're most likely to achieve your goal.at last but not least, some people say that the only flaw this camera has is that it has no zoom. well, i say that this camera is flawless. my previously camera had 3x optical zoom / 5x digital zoom, and i don't remember using it not even once, because i mainly take short-distance pictures. so, if to reduce the camera's size they needed to cut-off the zooming feature, i can only applaude them. it didn't make any difference to me at all. in fact, this is probably why the camera is also so fast at shot-taking and at powering on and off: it doesn't have to pull-back an enourmous set of lenses.this camera is what i needed indeed. if you are, in any way, in the needs of what i described above, search no more, because this is the camera for you. i'm 100% satisfied with it.", "Date": "October 6, 2004"}, {"Title": "A Tiny Delight", "Author": "M. M. Jackson", "ReviewID": "R2NUVI81PY1JME", "Overall": "5.0", "Content": "I purchased this camera to use for close-range stuff in clubs, bars, street photography and while having fun (pictures of friends, family, etc.) I wanted a simple point-and-shoot, something with decent specs (wanted at least 3MP) and *especially* something with a form factor as small as possible.The unit fits into my pocket unnoticed...especially in comparison with most other digicams out there with similar specs. The unit starts up fast (uner 2 secs...nice!) and is fast in taking pics and saving them (don't have a high-speed SD card, oh well...) Focusing I wish was instantaneous, but it is way faster than my Dad's old digicam ever was. It takes maybe 2 - 3 seconds on average, sometimes less. Annyoing, but probably endemic with all digicams in the ballpark range.The image quality of this unit is super-nice. Color is pure, natural and \"living.\" Detail is high. The superfine JPEG mode is very nice. I wish it had a \"raw\" option (it may, I don't know how to get it to do that if so), but I don't think it does. Superfine JPEG clocks in at about 2MB per 4MP picture. Not bad, a decent trade-off.Once you get down into Fine territory, you start to see ever-so-slight fuzziness and jpeg compression artifacts. I am the type of person who appreciates HD video-type signals, and like to see the blackhead on the nose of the guy across the bar. So, take this minor gripe for what it's worth.The other \"negatives\" about this unit are no optical viewfinder (you use the review screen to frame shots...believe me, NO big deal AT ALL...preferable for me) and no optical zoom. The optical zoom thing I am of two minds about: on one hand, I have had the *occasional* use for clear zoom. On the other hand, if it means adding even a millimeter to this unit, FORGET about it. So, at the end of the day, it's fine by me.The images are detailed and sharp. As long as you can keep your hands reasonably still, you will get insane detail to images. Slight softness in high-contrast, distanced situations (such as dark text against a light backgrond on a candy bag on the far end of your shopping cart, for example) exists, but I am splitting hairs.The DiGIC chip is awesome...images come out consistenly well-balanced (hump in the middle of the graph) and there are plenty of options for displaying image info as they are shot. Also, there are plenty of manual controls, good white balance, etc. WAAAAY more than a user like myself (I understand these things on a surface level, but mostly just want everything done for me...I like point-and-shoot for my applications).All told, I am very impressed with this unit. It also looks really cool, to boot (I have the silver, and the circular, shiny brushing/grooves on the front look great in club/bar lights or anywhere else...very attractive). Body is metal housing, have had no problems with it. I notice that there are slight dimples if I turn the unit sideways in the light, they were there from the beginning. No biggie, can't see them straight-on.If you are looking for a light, compact, purse and especially *pocket*-sized unit, I can think of no better than this one. Surprisingly I was able to get it new in West Hollywood, CA. for a significantly lower price than listed here.The great thing about this unit is the value factor:a.) good priceb.) you don't have to pay for processing and you can take way more pics with freedom, freeing you to experiment and snap more casual/unposed stuff since there is no extra outlay financiallyandc.) you capture irreplaceable moments in high-detail that easily justify the cost of the unit", "Date": "September 9, 2004"}, {"Title": "Quality pics, shirt pocket portability", "Author": "jj2me", "ReviewID": "R3A6C14L9QW8CT", "Overall": "5.0", "Content": "Got this from Amazon, expecting I might need their return policy.  But it's a keeper.  The number one feature of this camera is its size for such quality images.  A friend with a larger digicam agreed, saying his next camera would be a small one like this that he could have with him always.It is also very easy to use.  After reading the review at Photoxels.com, with their discussion about histograms, I keep it in auto mode, and check the histogram (I set the review details to show for 10 seconds).  If the viewed picture or histogram tell me to reshoot, only then do I go into manual mode and adjust.  Have only had one bad shot (indoors with flash, came out with shirt color off, but that was one of my first pictures when I was playing, so I may have done something wrong, plus it was set at the default fine compression, rather than the better quality superfine compression, which I now use).I thought I might want the Sony DSC-T1 for its optical zoom, but the early reviews of the Sony said indoor photos came out badly.  And the Sony is bigger (114.66 cubic cm vs. 78.52 cubic cm).  I keep this thing in my shirt pocket most of the time.  Don't think that would be likely with the Sony.  Also, the Sony needs its docking station to be able to connect to a TV, so it becomes even less portable.Although Amazon didn't advertise it, I was pleasantly surprised to receive the case.  You can't use the case for shirt-pocket use, though (too bulky)--I'm using a little cloth drawstring bag for that.  But when it's not in the pocket, the case seems to add some protection from bumps.  It's made for belt attachment.Accessories load up the price: 256 MB SD card (Panasonic and SimpleTech seem to have the best ratings for not much more $$), extra Canon battery, waterproof case (but cheap compared to other cameras', and not too big), external firewire/USB2.0 hard drive (Seagate 160 MB is nice, and they seem to couple sales with Seagate rebates), and LCD screen protectors (makes for more worry-free camera handling).Other than the lack of optical zoom, which I will accept in trade for the small size with quality 4MP pics, I have no complaints.  It's been perfect for me, with full auto mode working exceptionally well: point and shoo-shoot (i.e., shutter down halfway to focus, then down fully).  Result has always been great pictures.", "Date": "March 3, 2004"}, {"Title": "Fantastic, Tiny, Stylish, and great image quality!", "Author": "Eric Picard", "ReviewID": "R3PF9U1TL1PVS5", "Overall": "4.0", "Content": "This Camera is very impressive!  I agree with all the positives from above and highly recommend it.There are only two flaws I've found so far (after four days of using it extensively.) First is that there is no way to check the battery life.  This is only mildly annoying, since the battery lasts a very long time, but I found myself getting anxious that I was going to run out of juice in the middle of a shooting session.  Once the battery is low it gives you a warning icon that battery is low - but that's like not having a fuel guage, only a fuel light.  Not good.Second is that there is no range finder.  This means that in low light situations, it can be very hard to make sure that you're aligning the camera properly.  Not a problem for shots of people who are close to you - since the camera has a dim focus light it uses, which does illuminate the people a bit - but for larger images it can be a problem.  It frankly hadn't occurred to me when I was researching the camera - I just assumed it had a range finder.Other than these minor issues, I'm ecstatic about the camera, and everyone who's seen it is impressed.I'm particularly happy with the quality of the Flash. Shooting last night in a darkened bar resulted in beautiful images.  The AIAF autofocus is amazing - every shot was in focus, even though the image was not clearly discernable on the screen.-- Updated after one year --Okay - this camera still rocks.  Everyone who sees it wants one, and everyone we've sent pictures to has been impressed.The autofocus isn't as good as the one on my old $100 point and shoot olympus 35MM.  That is disappointing.  It sometimes takes a few seconds to find itself, and occasionaly fails completely.The Flash isn't as good as I thought before.  It tends to overwhelm the image often.  But its pretty good.  Overall - love the camera.  I'm hoping they've fixed many of these issues in the SD20, which came out this year.", "Date": "December 30, 2003"}, {"Title": "It's smaller than my cell phone", "Author": "lavender", "ReviewID": "RGJK70E64R6N7", "Overall": "5.0", "Content": "I absolutely have fell in love with this machine, and I have been through many digital cameras.  It takes amazing pictures in the dark, fires up fast, and doesn't take long between pictures.  I got tired of taking photos of my kids soccer games, and by the time my fuji finally took the picture, the kids were long gone. I have no regrets, well worth it.", "Date": "December 30, 2003"}, {"Title": "No Regrets at all", "Author": null, "ReviewID": "R3M9B5L82OB34I", "Overall": "5.0", "Content": "Excellent choice for a small size camera (looks bigger on the pictures)...Nothing beats canon with this model. Stylish design with a powerfull 4mpx.On previous reviews I had noticed, that the optical zoom was one of the setbacks of this camera since it does not have it, but the technology that canon incorporated to this camera let the camera work extremely well using digital zoom only..I would recommended to everyone if the size and quality matters.", "Date": "December 11, 2003"}, {"Title": "a review for the non pictophiles", "Author": "Mary", "ReviewID": "R1I87ZRA5WE56", "Overall": "4.0", "Content": "I'm not really involved in the digital photo scene so this won't be a super technical review.I purchased this camera because of the size. It's about the size of a mobile phone, smaller than some, larger than others. It fits perfectly in the phone sized pocket of my shoulder bag.Operation is mostly simple. Power it on with one button, focus and shoot with a different button. The location of these two buttons is pretty ergonomic - they make sense. I haven't taken a single picture with part of my hand shadowing the flash or found any fingers in the shot. In the past 14 months, I've taken over 2500 pictures with this unit and had no fingers in the pictures, so I think that's pretty ergonomic for a small camera.The zoom is digital which makes it useless - if you zoom in, you can just see bigger pixels, so don't buy it for the zoom, ok?Manual operation is hit and miss. Some of the settings I've found to be superior to the default point and shoot mode but for the most part I think you're better off using it in automatic mode. For one thing, it's really hard to find a setting where you can turn the flash off without leaving the shutter open forever. That means I can't use the camera in many museums because most restrict the use of a flash. Of course, a DIY fix for that would be to cover the flash securely with something like electrical tape, but I really don't like the idea of that.Battery life is long, if you use the actual Canon batteries. I purchased a couple of aftermarket batteries and they only last for a couple hours of turn on, take a couple photos, turn off and repeat. So for vacation when you really need to rely on a spare, buy an actual Canon battery. It's worth the extra dough.The case that comes with the unit is quite nice. You shouldn't need to spend more $ to buy another one. I don't like the velcro on the case so much because it gets stuck on the little camera strap and makes the strap look all scuzzy, but maybe you can find a better strap. Any cell phone strap could be used. Try to find one that will fit around your hand for security. I've dropped the unit once and it's okay so far but I wouldn't want to risk any damage.The battery charger is small - no cord. On the US model it plugs into any two prong outlet. Doesn't work well on a power strip because it has a large footprint. But on a regular double outlet with a normal plug in one, this charger will fit just fine in the other outlet. On a totally dead battery it takes about 35 minutes to fully charge it.The manual is descriptive. Keep it handy when you're getting started. Don't just use the quick start guide. You'll want to know how to use those manual settings from time to time. Take it with you on vacation.Video mode is okay. The mic is quite sensitive - better than I had suspected. You won't get a particularly large image but you can find video editing programs that will enable you to enhance the video you record. For fun little snippets to send to friends via e-mail, which is what I wanted, it's great.Sorting through the images and videos is extra simple. Deleting unwanted images is just as simple. Be careful, or you might delete something you meant to keep.The unit does come with a 16mb SD card but that's too small for use in reality. Go to the store and buy a 256 or a 512 MB card and you'll be able to take way more pictures than your battery will allow. You should not need more than one 512 for a 10 day vacation. Seriously. I like that it uses SD cards because they're still quite easy to find. And unlike other camera brands, you can buy any brand SD card.I can tell you that some SD cards are faster than others, which will affect your between snapshot time more than the camera itself. I'm using a PNY card and it's much faster than the card that came with the camera. Unfortunately, most of those cards are made by 2 or 3 manufacturers and then rebranded by the sellers. If you feel that it takes too long to take one photo after another, try a different card. Don't blame the camera.There is a cable included to directly connect the camera to a device. You could use that but honestly I think it's easier to take the card out and insert into a card reader. Many computers have them built in. If yours doesn't, you can buy a reader at any electronics retailer for about $9-30 depending on how many types of cards it can read. All you need is SD reader.Would I buy this camera again? Yes I think so. It's not everything I wanted but almost everything. 4MP is still nothing to sneeze at - the images are quite good. Usually the only modifications I have to make are to orient the photos 90 degrees(I take a lot of portrait shaped pictures, which default to view sideways when you look at them on your computer.)Buy with confidence and enjoy this little thing. Every time I use it people still say \"wow it's such a small camera!\" If that's important to you, you'll really like it.", "Date": "May 4, 2005"}, {"Title": "Canon SD10 (simply the best)", "Author": "Ryan Watkins", "ReviewID": "R36VFDJO9P9N8O", "Overall": "5.0", "Content": "The Canon SD10 has to be one of the best cameras out there for its price. I only have a few things that I don't like about this camera. One of the things is that some of the pictures show a little bit of red eye but when you go to print it out you just click red eye and it takes it out for you so that really isn't that big of a deal. Another thing has to be the digital zoom. When you take the picture it is fine but when you are looking at it on the LCD when you want to take the picture it shows blurry. But if you want to use the zoom... just take the picture and zoom in and print it on the computer. This camera takes excellent pictures and let me tell you is it ever TINY! It is seriously the size of a credit card but you don't want to drop it because you know it will break. I think that anybody who is looking for a camera get this one because it is great! You won't be disappointed...", "Date": "June 24, 2004"}, {"Title": "my new toy", "Author": "cherryosity \"roxyangel808\"", "ReviewID": "R5AH960L3QFR", "Overall": "5.0", "Content": "i used to own a canon powershot s300 digital elph and i loved it.  i gave it to my parents so that they could get into the digital age.  so i researched different cameras and i kept coming to the sd10.  a lot of the reviews said that the one flaw it had was no viewfinder.  i don't really care for it.  i never used the viewfinder on my s300.  im not a professional photographer. i love the size of this camera.  it's the same size as my driver's license! i love the clarity and the quick shot feature.  it used to take forever to take a picture because of the shutter.  now i don't miss a shot!", "Date": "February 4, 2004"}, {"Title": "A camera you'd like to marry!", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "R1XTKLQPRC2YHL", "Overall": "5.0", "Content": "No, the SD10 is not perfect.  For one thing, it could use some optical zoom.  There is *always* a situation that arises when you do need to zoom in just a little bit.  Digital zoom never does it for me.  So Canon, please add optical zoom (even if a paltry 2x) and this will be a 10-out-of-five camera!That said, the SD10 is perfect for the snap-happy.  Count yours truly as one.  It's a take-anywhere-snap-anywhere-view-anywhere-hide-anywhere kind of camera.  The four megapixels are nice, and the picture quality is nothing short of astonishing, at this super compact size or at any size.  BTW, the number of pixels usually does not translate directly into picture quality, just as a CPU's megahertz rating doesn't correlate directly with a system's overall speed.  But Canon engineers are a bunch of smart monkeys, indeed, and every Canon digital camera out in the last three years has just been totally fabulous in the picture quality department.What makes a digital picture top-quality?  The colors have to be natural-looking and balanced, preferably both indoors and outdoors.  There shouldn't be any digitized artifacts (like glowing edges of your new kitchen knife or pixelated pimples on your kid's face).  The white should be white and the black black.  Above all, one look at the picture and you go, \"wow, this is one nice shot!\" (assuming it's meant to be one nice shot).  The SD10, happily, delivers in all these aspects.  One could wish for a longer flash range, but, alas, that's why serious photographers like me have to keep an old-style SLR film baby around with a hotshoe on it.  If you want serious flash, man, you have to use an external flash.  The SD10 does well what it was designed to do.I really don't want to talk to you about the tech specs.  They are meaningless in the real world anyway.  To sum it up, the SD10 is a camera you'll be happy with and you'll probably fall in love with -- a gadget freak like yourself likes all nice gadgets but we don't fall in love easily, but the SD10 deserves to be loved.  If you are anything more than a casual photographer, I recommend you *also* buy a \"more serious\" model like the Canon S410 or Minolta Xg which has more controls and does come with optical zoom, and use the SD10 as a candid shooter.  But, seriously, this is a great camera for all kinds of photographers -- and gadget freaks.", "Date": "May 11, 2004"}, {"Title": "VERY CLOSE TO PERFECT", "Author": "Bargin Hunter \"lexusdcs\"", "ReviewID": "RZQNLK3N3AMAQ", "Overall": "4.0", "Content": "I purchased this camera last Christmas because I wanted a 4 mega pixel camera in a sleek lightweight body. I always use Amazon for the reviews which I read before making a buying decision and I was not disappointed. The unit is great. I just returned from Hawaii and took many pics in varying light situations and they all look super. Colors are vibrant and properly rendered. I agree that red eye is a problem though.Being middle aged, I would have appreciated a bigger screen. That is the single largest drawback for me.  I bought an extra battery and recommend that you do so if you are like me and hate to be caught short. However, I do have to say that the battery life has been good. I also popped for a 128SD memory card and found that to be more than enough to capture the 90 pics taken in large size superfine shooting format. My unit came with a very nice leather case that uses Velcro to secure the case to a belt loop. I found this to work very well and it did not interfere with getting to the camera quickly. I generally shoot pics with a 35MM NIKON 6006 SLR so you could say that I am an experienced photographer. Take it from me; you'll like this camera and the results you achieve.", "Date": "June 23, 2004"}, {"Title": "Small and decent, but no longer a good buy", "Author": "Kaifu Wu", "ReviewID": "R2JNICVN84URH3", "Overall": "3.0", "Content": "I bought this when it first came out a couple of years ago.  At the time it was the smallest 4MP out there, and since my goal was to go \"small,\" i decided that i could live without an optical zoom.  While it served me well, I will tell anyone now that we all need optical zoom.  Photographic quality is good, though there are sometimes too much chromatic aberration (color fringing).  Focus indoors can be slow or impossible, even with flash turned on.Unless you can get a really good deal for this, I suggest looking elsewhere, as there are many other offerings from this class of cameras now -- all with zoom lenses.  I recommend the recent Casios or a Pentax Optio.", "Date": "December 7, 2005"}, {"Title": "Photos have great color & clarity.  Optical zoom not a big deal.", "Author": "smoove", "ReviewID": "R1O6ZZMO4YZ0VB", "Overall": "5.0", "Content": "I recently took this lil cam on a trip overseas and am extremely happy with the pictures that it took.  Color and clarity are top notch, what I expect from Canon.  It's very compact and easy to carry around.  Just be sure it's in a safe pocket or bag, you wouldn't want to leave it behind.The SD10 does lack optical zoom, which is advantageous in some ways.  It's easier to use (no zoom controls to fiddle with) so strangers can just point & shoot in those situations when you want a picture of yourself.  \"Zoom with your feet\".  Not having to fiddle with zoom controls also makes for quicker shooting.  Use a paint program afterwards to crop what you want to keep in the pic.This isn't a replacement for a full-sized digicam.  But it sure gives them a run for their money.  I wouldn't take any other cam on a long trip.  The charger is universal 100-240v 50/60Hz, so no power converter is necessary (just a plug adapter depending on where you're going).", "Date": "July 21, 2005"}, {"Title": "Super Small with Fabulous pictures", "Author": "Adam Petrone \"Adam\"", "ReviewID": "R3N236BW7HTCSP", "Overall": "5.0", "Content": "When I bought this camera it was for it's size. I love a camera that you can just throw in a pocket and forget you even have. I had a logitech pocket cam but the pics we're just terriable, so I went after this canon. Well first impression was what quality. It's metal construction and sleek look wow's you imedietly. But the real wow comes when you see the pictures it takes, They are flawless. I have a canon A-80 and let me tell you these pics are as good if not better than that.OK, It has no Opitical viewfinder or zoom, But who uses viewfinders anymore anyhow, We all use the lcd screens to take our pics.As for the zoom, If thats what you want you'll have to sacrifice size then.Bottom line is if you want a super small high quality camera that takes great everyday pictures then this is your baby. Battery life is superb, I took over 80 pics and still have juice.", "Date": "July 26, 2004"}, {"Title": "BEST VALUE", "Author": null, "ReviewID": "R21PR1DZX67NDO", "Overall": "4.0", "Content": "Okay, here it is, let me break it down.I was in the market for a small digital camera for months. Price was not the central issue but I was waiting to get the best possible deal on the best possible product. When I saw this camera in a bar, I knew it was right. First, It's tiny, much smaller than the image indicated. Its also the nicest looking camera out there by far. Especially in black.Second: It is so easy to use that you don't even have to read the book if you don't want.Third: It takes great pictures. Sony has come out with a new miniature camera, its 5MP and its also $550. If you read the reviews on CNET its reputed to be a stinker. My decision was between that specific sony and this one. The sony has a zoom.Fourth: What do you really need a zoom for anyway? If you're like me, you want the camera to take snapshots, you don't need a zoom for that, if anything having the zoom there confuses things when you ask a stranger to take a photo.Lastly: Don't go somewhere else to buy this product. I did find it cheaper in other places on the net. However, Amazon has no hassels. Don't like it, send it back for free. Doesn't work, NO PROBLEM they'll send you another. All that for about $20 over the minimum you'll find it on the web. $20 for piece of mind, a good deal I think. So what are you waiting for?", "Date": "February 28, 2004"}, {"Title": "Little Beauty", "Author": "Oleeo", "ReviewID": "RH40RGIVWADN5", "Overall": "5.0", "Content": "In addition to all the good things mentioned, this item also has a bonus. Amazon surprised me by throwing in the Deluxe Leather Case PSC SD10, with the color perfectly matching the camera. I was a little concerned before receiving the order, wondering where I could get a case to protect my little beauty. Now problem solved. Thanks Amazon!", "Date": "August 3, 2004"}, {"Title": "REALLY IMPRESSED!!!", "Author": null, "ReviewID": "RJ74K9C8CLAA2", "Overall": "5.0", "Content": "From the moment I recieved this product I knew I had made a great desision in this purchase. The packageing was impressive and it came with everything which I think is a total plus, the case, battery, battery charger and the cords. I recently purchased a more expensive digital camera and had to put more money into the rechargable batteries and charger and the AV cord and the case, and the product packageing was no where near as good as this little camera. Also this camera has an awesome orange light ( don't know the Tech. term )that totally suprises whoever your taking a picture of and can take a picture in a competely dark room, my big camera cant do that. I take it everywhere it is so small, I love it.", "Date": "June 26, 2004"}, {"Title": "Excellent Camera and I tried many!", "Author": "Gustavo Buentello", "ReviewID": "R29M0UHEE7DS8K", "Overall": "5.0", "Content": "First I bought this one Canon SD10, and then I tried the Sony T1, and the Casio Exilim3.2. This tiny little Canon blew both away.  I have the Rebel Digital and this one for a pocket camera.  I also bought the underwater casing which looks and works great.  Trust me if you are looking for a compact camera you will not be disappointed.  It works as nice as the Canon G2, & G3, which I also owned but where to bulky and I wanted something more compact.", "Date": "April 7, 2004"}, {"Title": "great small camera", "Author": "Joseph", "ReviewID": "R3C31JM62YKGEJ", "Overall": "4.0", "Content": "let me note that if i were rating this camera among all other small cameras, i would be giving it a 5.  however, among all cameras in general, including giant ones as big as your arm that cost twice as much, it understandably gets a 4.this is a great little camera.  If you are in the market for a camera that you want to carry around in your pocket, this is it, stop looking.  you won't find one that takes better pictures that is even close to this size.  It still has a nice screen on it too, which i like.  It's easy to use, very few buttons on this one, but it has as many features as any other camera.  It comes with a good Li-ion battery that has great life.  Cameras that use AA batteries are a complete pain in the neck, so I was happy about the battery.  It also comes with a 32 MB memory card, which will store anywhere from 16-72 pictures depending on which size and quality settings you choose.  I upgraded to a 128 MB card and i have never had to worry about even coming close to running out of memory.  The only thing lacking is zoom quality.  It doesn't have optical zoom, only digital, so if you zoom in at all, it makes your pictures grainy.  Anyone that says that this doesn't happen is either lying or just stupid, because it's something that anyone who has ever used a digital camera would know.  However, i am willing to sacrifice zoom for all of the other great things about this camera.  And think about it anyway...if you are just taking a picture of some people, just take a few steps forward if you need to \"zoom in.\"  If you are taking pictures of a landscape, you probably wont need to zoom.  However if you are someone that needs zoom for whatever you use your camera for, then you probably shouldn't be looking at a camera this small anyway, you will need one with one of those giant lenses.  The SD-10 has an awesome macro (close-up) setting, you can get within a half inch of anything and take the most detailed picture you will ever see.  I took a picture of a flower and you could see the veins in the petals when i pulled it up on my computer.Also, not that this really matters, but every time i take this camera out in front of anyone (i got the black one), they all want to see it and compliment how cool it looks.  Now, this isnt why you should buy it, but it is a testament to the physical beauty of this camera.All in all, this is a wonderful camera and it even comes with a small, nice fitting carrying case.  Again, if you need a small camera, get this one, you will not be disappointed.", "Date": "December 11, 2004"}, {"Title": "This little guy packs a lotta punch!", "Author": null, "ReviewID": "R1CXFD1QEGIPXO", "Overall": "5.0", "Content": "Love this camera!  It is even smaller than it appears in the pictures. I have no more excuses for not having my camera with me at all times.  Also very chic...I got mine in black because it looks like a mini-Hasselblad! I didn't install the software included (not sure about that virus thing) but instead just used the software on my XP.  Works fine.  Pictures are clear, clean and crisp.", "Date": "January 10, 2004"}, {"Title": "Canon SD10  Thumbs Up", "Author": "Larysa", "ReviewID": "RSCQ2YT47CUNL", "Overall": "5.0", "Content": "I love this cameraI love the macro, the claritysomeone into photography told me it has especially clear pictures BECAUSE it has no optical zoom and  I have been very pleased.  The only thing is I would like optical zoom, so I am thinking about getting another camera, but DEFINITELY sticking within the canon line.It is super sturdy, I'm ashamed to say it's hit the floor a few times.  Dont get generic batteries, it's worth the investment to get the brand name, they'll last a long time and generic just isn't worth the medium amount of money you will pay.The size is great which is why I can take it everywhere with me.  I love that I can take continuous shots which comes in handy with my godson and his brother and my rabbit.I highly reccomend this as a point and shoot camera.  I happen to know a bit about photography and love it....and the camera is great for me....sometimes I woudl like to be able to set some manual settings but then again the pros SIGNIFICANTLY outweigh the cons...the quality is good.  Using the self timer I have done my own headshots, and theater professionals thought they were professionally done.  Let me just tell you I saved thousands with that instance, and I can just keep updating them and whatnot.  It's great to have a tripod with it sometimes and just try things out.  This is my first digital camera and it's also a great one to start with, why get all the fancy shmancy if you are new to digital cameras?  As a theater major who does makeup, it is invaluable for taking photos of the actors' makeup to keep it the same from day to day and even for other things with \"documentation\"  like if I see a dress I like and I want to go get that fabric, I Just take a pic since I always have it with me, that is one of the main handy features and I have so many pics that I only have because it waas easy to carry around and who wants to lug a huge thing around all day all the time?  I have even used it in craft stores to remember what I wanted to use on a project and so I would remember where it was, what it looked like and sizes and whatnot..it is So handy for things you wouldnt always think of and expect.I really really do reccomend this and all the other elph cameras....zoom or no zoom  but if you DO want zoom go for optical because digital zoom wont really get you anywhere....enjoy :)", "Date": "February 13, 2006"}, {"Title": "The best camera I have ever had...", "Author": "Archaeologist", "ReviewID": "R1VAZELOA19OOA", "Overall": "5.0", "Content": "I will buy another Canon Elph when this one finally dies.  With the option of going up to a 1 GB SD card, the future is wide open.  It is possible to buy a lesser brand 4MP camera for a lot less, but the extra Canon quality is worth paying for if you plan to have your camera for a long time.", "Date": "March 16, 2005"}, {"Title": "Perfect Little Camera", "Author": null, "ReviewID": "R2THQWX75YK77W", "Overall": "5.0", "Content": "I purchased this camera after much research because it was highly rated for image quality, it is made by a relyable company, and it is small enough to go anywhere.  After a few months with this camera I've discovered that this really is the camera that fits all of those criteria.  I take this camera everywhere with me without having to carry a larger bag or purse.  It is easy to operate and turns on and off quickly.  It has pretty good battery life and amazing image quality. I've never had a problem with this camera, but I know I can trust Cannon to provide good technical support when needed.  If you will use a camera mostly for point and shoot or small video this is all you need.  Some people don't like having only an lcd screen, but it has never bothered me.  Also, some people might be annoyed that there is no zooming in movie mode, but I have never needed this feature.  Also if you have big, clumsy hands the size of the buttons and camera in general might be too small for you. If you won't be bothered by these few small details you'll love this camera. For the price, size and image quailty this camera is such a bargain.", "Date": "June 8, 2004"}, {"Title": "WOW", "Author": null, "ReviewID": "RAG4FAGHAL4ZO", "Overall": "5.0", "Content": "I just got my camra today! It's the cutest thing ever. It's smaller than the rest of the camra's on the market. The 4.0 mega pix is a plus too! WOW I love it. It's smaller than my cell phone. You should get it too!", "Date": "July 13, 2004"}, {"Title": "Canon PowerShot SD10", "Author": "\"tom7jon\"", "ReviewID": "R2O3TEPI3WR9BS", "Overall": "5.0", "Content": "Although this is my first digital camera, I believe it may be my last.  This TINY little camera has everything that an amature could wish for, but the best has to be the stitch assistant.  On a trip to Vegas, I successfully took about 8 shots and panned the entire strip, and the included software (on my laptop) took care of the rest.  The photos are top notch, the camera is about the size of a cell phone, and the battery lasts forever.  No complaints here, you will not go wrong if you purchase this camera.If you are looking to purchase a digital camera but don't want to spend too much, spend just a little more and get the SD10, you will be extremely happy with your purchase.", "Date": "April 20, 2004"}, {"Title": "Nearly perfect!", "Author": null, "ReviewID": "R1V9XTP2QQHNQJ", "Overall": "4.0", "Content": "I have had this camera for 4 months, and I absolutely love it!  The picture quality is the best, the battery lasts long, and I don't think cameras of this quality get any smaller.  My only gripe would be that there is no optical zoom.  I just take a normal picture and crop/zoom on the computer.  For all the features and the size, it is definitely worth the money.", "Date": "April 18, 2004"}, {"Title": "Still use it to this very day", "Author": "Mr cool", "ReviewID": "RB6ZH75TA4TZR", "Overall": "4.0", "Content": "Ive had this camera for quite a few years now. Its is a very handy camera to have due to its size. It also shoots quickly (probably due to no optical zoom) and shoots decent pictures. This is a no nonsense camera. Straight point and shoot anyone can use it. I like how small it is cause you can truly take it anywhere. As they say the best camera is the one you have with you. Is very cheap on ebay if you want one. This or the sd20 which is the improved version.", "Date": "August 11, 2012"}, {"Title": "Love this little gadget!", "Author": "Evan Kleiman \"Evan Kleiman\"", "ReviewID": "R3L23TACAWLJJY", "Overall": "5.0", "Content": "While it's not necessarily the best camera for professional photography, it is awesome for everday shots. Being only a bit larger than a cellphone, its sleek size really does the trick to slip in your pocket, and it really impresses people to boot. The only problem is a lack of a viewfinder, but you get used to that quick.", "Date": "December 2, 2004"}, {"Title": "Very reliable!", "Author": "shakez", "ReviewID": "R1HM7177CIZJFT", "Overall": "5.0", "Content": "awesome camera with great options and attributes!megapixels are pretty good, and the print quality of thesepictures come clear.  But the price is a bit too high[...]", "Date": "November 29, 2004"}, {"Title": "My Favorite Camera", "Author": "\"aynnev\"", "ReviewID": "R11ZBRB6603UXT", "Overall": "4.0", "Content": "I have four digital cameras - but this one is my favorite.  The photos are crisp, the camera is very responsive and fast.  It is small enough to carry every day.  The charge is good too.  I would say this and the Casio XFilm are the bext low-end digital cameras around.", "Date": "June 22, 2004"}, {"Title": "lovely", "Author": null, "ReviewID": "R15TPE3F122DIA", "Overall": "5.0", "Content": "The SD10 is my 4th digital camera, and it is by far the most enjoyable.Here are a few of my favorite things:- size (can't be beat)- 4MP!- really nice predictive focus. like the Canon film SLRs I have used, it has that very handy focus frame that pops onto whatever you are focusing on. Very good at reading your mind.- the flash exsposure system is right on the money.- the lens is sharp and fast (no zoom! i find that a plus, actually)cons- i get a lot of red-eye (don't use any red-eye reduction) - but that is really due to the small size and having the flash so close to the lens.- hearing people complain that there isn't a zoom.- i shoot everything at 50 ASA for the best results. at 200-400, there is a really big difference.- people always wanting to hold it.", "Date": "May 5, 2004"}, {"Title": "SD10 is Tops", "Author": "wmn", "ReviewID": "R14OOV4UX4193Y", "Overall": "5.0", "Content": "The camera is compact, very easy to carry around.  Comes with 32MB memory card where most others just provide 16MB. I highly suggest purchasing more memory as high resolution pics take up a lot of space. This camera is easy to use.  The pictures are crisp and clear and colorful.  Fantastic  pictures and easy to use camera makes this SD10 a winner.", "Date": "December 5, 2003"}, {"Title": "Amazing Camera! Don't Pass this Up!", "Author": "J. CAFFREY", "ReviewID": "R34QM74Q9PHTU0", "Overall": "5.0", "Content": "I have had many point & shoot digital cameras, and this canon sd10 is by far the best. 4 mega pixels, amazing picture quality, fast reaction times and such a small, but strong body! I had the Pentax s4i and sold it to get this. Nevermind the Sony T1 either, bad photos! Get the canon! This camera rules.", "Date": "May 31, 2004"}, {"Title": "Tiny", "Author": "Trilgy \"trilgy\"", "ReviewID": "R5XFXYNR49EVC", "Overall": "5.0", "Content": "I just received my camera, my words cannot express how tiny this camera is (about the size and weight of a cell phone).  I have various digital cameras and have found the tiny ones are the most useful, since they go everywhere with you.  Digital zoom quality is very good.  Upgraded my Minolta Dimage, which was a good camera as well, but this thing is tiny.", "Date": "April 7, 2004"}, {"Title": "Truly awesome", "Author": "Alkesh Patel", "ReviewID": "R2ME12BLD8LZAR", "Overall": "5.0", "Content": "I'm not going to repeat the positive reviews, but just state this is probably the best value camera I have ever bought! It's stylish, functional, affordable and absolutely TINY. What more could you ask for? Buy it now!", "Date": "June 18, 2004"}, {"Title": "Great - but images are not perfect", "Author": null, "ReviewID": "R1HGBVKA9N25MW", "Overall": "4.0", "Content": "I've had tis camera for nine months now, I am rarely without it.  It is just too easy to take with me everywhere, so I no longer say \"oh-no, wish I had my camera!\"The ONLY SIGNIFICANT PROBLEM: The exposure of the images are slightly darker at the extreme edges.  This becomes blatently obvious when stitching images -- the slightly darker edges are revealed as dark bars running along the stitch seam.  If you never stitch images, then this won't bother you.  If you like to take panoramic photos, then find a different camera.  I haven't had one successful stitch in the two hundred or so images that I have tried.  I compare this to my other canons (S200, A40) which do an awesome job of stitching.I have never missed the optical zoom.  With 4MP of picture, I have always been able to crop the image to get what I wanted in the shot.", "Date": "April 23, 2004"}, {"Title": "AA batteries...", "Author": "A. champion \"tonysworld\"", "ReviewID": "R3BR4FL7LZCO01", "Overall": "4.0", "Content": "Did you ever experience a moment where you've said \"oh man i wish i had my camera!\" or, you've had your camera and just wished it wouldnt create such a huge bulge in your pocket??  Well problem solved.i was in the mood for buying a small camera and tripped apon this little beautie...at first I was skeptical, thinking Im paying too much for something that might turn out some-how dissapointing...I read the reviews everyday for about 3 days wondering if I should buy it or not. Well guess what happened next...I bought it.so after i bought it, I kept reading the reviews to escape any doubt in my mind.I came home late at night and saw it on the table (considering that im still with my parents and they were home when it was delivered) and was TOTTALLY excited about its arrival...I took it out and 1.the packing was excellent 2.the camera is TINY!! I measured it to everything I could think of...and the closest thing was a pack of cigarettes!! its even slightly smaller than that!!!(slightly)3. once I got it I went on a rampage of photography, the menus were pretty easy, I didnt even need the manual at first to turn it on and start rampaging...(thats good for the men)  hmmmm...now for the reason for the 4 STARS.(though it deserves more of  4 and 3quarter stars)Alot of people gave it 4 considering theres lack of a viewfinder and lack of an optical zoom...believe me, im a hard-to-impress-guy when it comes to quality...the camera compensates the optical with its QUALITY in EVERY pic!! thats right... EVERY pic...but now for the only  major problem on my hands.. i read what was in the box and i saw the ion battery charger with the battery...and at first i was like \"COOL\",and I thought well now the good part is that I dont have to waste gas and precious money to buy more batteries...but the bad part is that it takes electricity to charge up and you have to do that with an outlet...(primarily at HOME) so if your camera runs outta juice and you're without your charger and electricity...boom you miss out on your rampage ...and you cant just go out and buy batteries at your nearest convience store... but i suggest a power a/c outlet that you can hook up to your car lighter....yeah they make'em.. I bought mine at wal-mart...ooh that is an awesome store..and I felt smart about it ever since...  so in conclusion besides the whole battery charger dilema...this camera is awesome in all aspects,  size, quality, and speed of getting those\"quick-shot-moments\" that are impossible to get with a slow shutter camera. I bought the bronze one since my pocket has that quality-for-cheap type mentality, I doubted the color and I wished I could have gotten the black one, but once I got the bronze, i was amazed at the color..to me it looks like looking into a brand-spanking new penny...so shiny and irrestible to look at...actually i fallen in love with the camera (if there is such a thing!)  so besides the charger...if your looking for something compaq, ready to shoot in a second, and where quality meets above expectation, then this is the CAMERA to buy//////// go ahead, DONT wait any longer reading this stupid review...buy the camera NOW!!! TRUST ME IT WONT DISSAPOINT.. :)", "Date": "October 28, 2004"}, {"Title": "UTTER FABULOSITY in the form of a Camera", "Author": null, "ReviewID": "R18XEWZ1NKENHM", "Overall": "5.0", "Content": "*OK so this bad boy is TINYYYY.  You will never have to worry about carrying a bulky camera again, plus its really ultra chic and trendy looking. HUGE PLUS.*Unlike a lot of other digital cameras that take forever to take a picture, this thing is faaaaast. The time between each snap shot is fast too. VERY impressive.*I'm not a professional photog but if your just about quality photos without all the technical craziness then this camera is perfect for you.  Right out the box its super easy to work with without having to first read the lengthy manual(s).*The digital zoom on this thing is more than cute enough to accomodate you and I find that it doesn't distort the photos or comprimose the quality of the pic.  I understand there are a lot of people that don't care for this dital zoom feature but It hasn't been a problem for me.*Its so tiny you feel like its the most fragile thing in the world.  Its roughly about the size of a credit card!*There's no optical viewfinder on this camera (for the lay person its the little hole most people look through on any other camera before taking a picture). I thought that it would be wierd having to look through the screen before flicking it up, and surprisingly its not.  In fact taking pictures is easier now,* I havent used the camera's included software because my computer allows me to download my photos by inserting the memory disk directly into it so I can't comment on that particular aspect.*I'm in loooove.*The ONLY bad thing about this little camera is that its so cute people want to hold it all the time and the belt clip is secured only by a leather velcro strip so it doesnt feel as secure as I would have liked.*This camera is soooooo worth the money. Click that \"BUY NOW\" option immediately and stop fooling around, you know you want it.  = )", "Date": "May 26, 2004"}, {"Title": "FORGETFUL PEOPLE BEWARE!", "Author": "Dean", "ReviewID": "R1E6O8IIGVPI1J", "Overall": "5.0", "Content": "This camera is awesome but it does have some drawbacks.PROS: You can take it everywhere and you will without even noticing, i sometimes forget I have it in my pocket.Great pictures if you mess with the settings a little.  CONS: the charger size.  I was so worried that i would lose the camera that I forgot to keep up with the charger.  The charger is about 1/3 the size of the camera and if you don't have a place to plug it into a wall permanently you will lose it.  I don't have a open plug in my room and my house is full of people traffic and dogs so I couldn't put it anywhere else.  I lost it after 3 charges.Other than that its great.  I haven't checked how much a new charger is but I assume it's not cheap.", "Date": "June 16, 2004"}, {"Title": "Great camera, but Virus on Installation CD!", "Author": "Nik Lim", "ReviewID": "R3EKLSCUXTGCZD", "Overall": "4.0", "Content": "I bought the Canon Powershot SD10 (ixus i) on 22nd Nov andinstalled it on my PC. A few days later all my applications stopworking. I scanned the CD and detected 2 infected exe files on it. I've contacted the local Canon representatives and also emailwhoever at Canon that i can find online but NOT a single person hasreplied my email. A snippet of the email i sent to Canon, with the virus details. Anyone else has this problem? ******************Unknown to me, the The Canon Digital Camera Solution Disk CD isshipped with 2 of the files INFECTED with Win32/Resur.b virus! Afterinstalling the Canon CD, some of my applications stop working. Ittook many hours to figure out what is wrong with my other wordprocessing and image editing software, as all I did was to installyour camera driver. One would not expect such a highly regardedcompany such as youselves to have such sub-standard quality andscreening control as to allow something as damaging as this happen. The infected files on the Canon Digital Camera Solution Disk Ver.14.0 CD (C84-1199 Made in Japan) areD:\\SOFTWARE\\RCTASK\\ENGLISH\\LAUNCH.EXED:\\SOFTWARE\\RCTASK\\JAPANESE\\LAUNCH.EXEAttached is the screen capture of the virus scan. For your information, the virus has cause most of my applicationson my machine to cease functioning, and subsequently infectingother machines on the network. It took many hours to clean up thevirus, and reinstalling all the software and update patches. Allthis due to a camera driver installation CD from Canon! As you can imagine, I am highly disappointed with the wholesituation, which caused me and my colleagues alot of needlessstress andwasted time. I have even tried contacting the Malaysian support butafter being passed on from one person to another and finallyhaving the details of my problem taken down by a very helpful MissGan, who did not offer anything more than other alternatives ofacquiring another copy of the driver - but the damage has ALREADYbeen done.********************", "Date": "December 9, 2003"}, {"Title": "awsome camera, very tiny!", "Author": "charlie", "ReviewID": "R3FY03C9TP73PL", "Overall": "5.0", "Content": "if you need a new camera, want something to fit in your pocket, this ones for you! 4 megapixels, more than enough, this thing is TINY!  id highly recommend this to anybody, if you don't got the money for it, consider getting one for FREE!it got me mine, check it out, its all the information you need on getting this camera for FREE!", "Date": "December 9, 2004"}, {"Title": "becoming warm", "Author": "gal", "ReviewID": "R3LTVK0XOZLVIS", "Overall": "3.0", "Content": "the size is compact n i fall in love with it the moment i saw it. but the problem with this camera is , it becomes warm easily.the battery life too is quite short though many claimed to have good battery life. it just last for about 2 hrs or so.dont know if you would consider that long lasting.the size is too small that u mite lose it if you dont be careful about it.", "Date": "September 26, 2004"}, {"Title": "cool litte camera", "Author": "winstar", "ReviewID": "R3EPLUVWUQBTQZ", "Overall": "5.0", "Content": "i do not have this camera yetit is cool litte camera", "Date": "April 17, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "Super-sleek Digital Elph with 4.0 megapixel sensor--up to 2272 x 1704 pixel images for 11 x 14 photo-quality prints\n5.7x digital zoom, 5-point artificial intelligence auto focus (AiAF), DIGIC Imaging processor\nCapture up to 3 minutes of 320 x 240 video with audio; on-camera video editing capability\nIncluded 32 MB Secure Digital (SD) card; also compatible with MMC cards\nPowered by rechargeable lithium-ion battery (NB-3L ); connects to PCs and Macs via USB 1.1", "Name": "Canon Powershot SD10 4MP Digital Camera (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/4117KZHMFYL._SX300_.jpg", "ProductID": "B0000CN648"}}