{"Reviews": [{"Title": "May possibly replace my 35mm", "Author": "Clifford Simpkins", "ReviewID": "R1PG6QGMUQD2ZZ", "Overall": "5.0", "Content": "What can I say? I really like this camera! I'm a 35mm photo-hobbiest that previously owned/used a Mavica FD-81, and was looking for something that was smaller, faster, and took cleaner pictures. I originally was looking at the S50, but with that model on it's way out (being replaced by the S55 possibly, depending on sales of the P50...I'm told), I looked into (and bought) this model.This camera may actually begin to replace my 35mm. First off, the camera's lens takes some excellent pictures: clarity, color, etc. Combined with the tons of manual override features, it gives me the visual control I found lacking in other models (you can even disable the digital zoom altogether, a big feature for me). And the LCD capabilities also stand out against the competitors: (1) you don't have to use it (a view window is provided, which is centered to the lens...so you really get what you see) and this almost triples your battery life, and (2) LCD image review allows you to zoom in/out of pictures to verify that you got the details you were looking for. Expansion speaking, Sony uses the memory stick technology in their cameras (I can share my 64 MB sticks between my mp3 player and this), it has a slot to attach a more professional model flash, and the camera lens supports add-ons. As well, the speed is phenominal - it takes the pictures quick...and you don't have to half-press the button to focus before you take the pic...just press once and it'll auto-focus and take the picture on it's own.There are only two real downsides of note to the S75: (1) size and (2) ease of image distribution. There are a lot of cameras out there that are both smaller and lighter; however, I found this model to have the same size and feel as my Nikon 35mm, so that didn't bother me. As well, I miss being able to use the straight-to-disk feature of the Mavica. Also, beware - out of the box it's set to 2048x1536 fine (which will blow up to poster-size without pixilating, BTW) - which will eat up the 8MB stick in about 5 pics...reducing it down to 1280x960 let me fit a lot more before I upgraded my memory stick.If size and weight is your ultimate selling point, take a look at the P1 or the P50; but if you want the pictures and the control of a real 35mm, this is definitely the camera for you.", "Date": "July 5, 2001"}, {"Title": "Getting Closer", "Author": null, "ReviewID": "R34672KD27A30B", "Overall": "5.0", "Content": "The Sony DSC-S75 brings digital photography one step closer to the output one acheives with a 35mm camera.The unit fits perfectly in ones hand and is ergonomically well designed. It has an in-camera recharable battery that gives you an amazing amount of shooting power over time. The Carl Zeiss lens yields some of the sharpest prints I have ever seen produced by a digital camera.  Even 8x10s  look gorgeous when shot in the fine mode.The camera has all the bells and whistles that allow the photographer different degrees of control over the image.  Shutter priority, aperture priority, manual overide and digital zoom are but a few.  The macro mode allows you to get extremely close to an object with fantastic results.On the negative side, Sony embarasses itself when it ships this item with only an 8 mb memory stick.  You must factor in the price of a 32mb stick into your budget.  I loved the camera so much that I splurged on a 128mb stick and now I can shoot until my finger gets sore!This aside, I highly recommend this beautifully engineered piece of equipment.  I am beginning to reconsider my reliance on the 35 mm camera.", "Date": "July 1, 2001"}, {"Title": "The best advanced camara for the money.", "Author": "SirWired", "ReviewID": "R2CCONXSMZR41T", "Overall": "5.0", "Content": "This camara is NOT for somebody that want to just take a few snapshots every once and a while to stick on a web page, and maybe make a print once in a blue moon for a really good shot.  If you want something like that, there are camaras that are smaller, lighter, cheaper, and easier to use.This camara is NOT for somebody who is a photo fanatic.  If you want razor-sharp prints the size of posters, or if you want to take pictures of hummingbirds in flight, there are camaras that have interchangeable lenses, higher resolution and better image controls.If you are semi-serious about your photography, require a good lens, decent control over the photos, and spectacular batter life, this camara is an excellent value.Equipped with an excellent (if bulky) Zeiss lens, this camara can produce much better pictures than other three (and even four) mega-pixel camaras that only have tiny, small things.  One thing you must remember is that mega-pixels are useless if the lens cannot deliver detail that fine to the camara.  This lens can.  The 3MP it has will do just fine for any size print up to and including 8x10's.The user interface for the camara is simple enough, which makes up for the somewhat lousy manual.  My only complaint about the controls is that the cursor movement button is hard to center correctly.  This is a minor point, as I have never had it cause a problem other than me having to hit the button twice.The pictures are razor sharp and the camara is capable of perfect white balance.  (For those that don't know, bad white balance is what causes some pictures under flourescent light to look green, and incadescents look yellow.)  All you have to do to adjust it to perfect every time is to keep a white index card in your camara case and then use the \"one touch\" balance control to re-calibrate it in a couple of seconds.You can make small movies with this unit, but they aren't suitable for anything but posting to the web.  Let's face it, this isn't a camcorder.The included rechargable lithium battery is more than enough for a full day or two of shooting, but if you won't have access to a car or electrical outlet, it could be a problem, since it isn't a AA you can pick up at any corner store.  (That means that you can't use this camara for your 10-week trek through the wilderness.)This camara includes only an insultingly small 8 MB memory stick.  However, I believe that everyone with a 3MP camara should own a 128MB chip, and NO camara maker includes one that big.  Buy one when you buy the camara.  Since other manufacturers besides Sony now make them, they are very reasonably priced.You can buy accessories like a flash, an adapter for 52mm filters, additional lenses, etc., but the cheaper non-sony brands are tough (but not impossible) to find.The included software (MGI Photosuite) is not really that good, but not bad for a bundled package.  I reccommend, and use, Microsoft Picture It! Digital Image Pro.All in all, for the price this camara costs, it is the best available and has no competition.P.S. If you have windows XP, you MUST change the USB Transfer mode from the default.  If you don't, it won't work.  See the manual and the sony website for details.", "Date": "December 3, 2002"}, {"Title": "Very good digital camera.", "Author": null, "ReviewID": "R3W04HDTSEROQM", "Overall": "4.0", "Content": "I did a lot of research online and read a lot of reviews before I finally decided to buy the Sony DSC-S75 camera. After using the camera for about a month, here are my impressions.Positives:1. Excellent pictures. When printed on a good printer with photographic paper is virtually indistinguishable from film.2. Loads of features. Allows you to customize your shots the way you want. Menus are relatively easy to use.3. Battery life is excellent, gives you an estimated remaining battery life on the camera.Negatives:1. Relatively bulky, there are smaller 3 megapixel cameras out there, but is ergonomically designed and fits well in my hand.2. 8MB memory stick is practically useless, you need to have at least 64MB.3. Slow taking pictures. I don't know if this is a problem with all digital cameras, but there is about a 1 to 2 second delay from the time I press the button to when the picture actually takes. Meanwhile, your subject could be moving and ruin the picture. I've tried taking pictures of my 2 year old and I have to take 10 pictures before I get one good one.Overall, I think this is a very good camera, which takes excellent pictures and could replace my 35mm camera.", "Date": "August 29, 2001"}, {"Title": "A Happy Mistake", "Author": "\"speedingpullet\"", "ReviewID": "R2EEI29RNNVMO6", "Overall": "5.0", "Content": "I was dead set on getting on of the Sony P1s - it was small and took high quality pictures. Sadly, the store had run out, but an enterprising showroom assistant suggested checking out the DCS-75 instead. I'm so glad I did! This camera is amazing. I've never owned a digital camera before - and wonder why I waited so long now. 3.3 Megapixels is probably more than enough for most people - for snapshots I have the setting down to 640 x 480 and don't go much above 1280 x 960 for anything.  However, should you want to, the camera can take 2048 x 1536 and can save in a variety of formats, including .TIFF. It will even take movies of up to about 1 minute, although the quality of the movies is not fabulous. There are some standard special effects settings too (if you don't trust youself with Photoshop or the like)such as black & white and negative. The menu system is easy to understand although I'd recommend having a quick look through the instruction booklet to find out about all the extras. I found it easy to find my way round the camera after only one reading. The camera has a nice chunky feel - like and old school 35mm - and the handgrip feels good and secure. The LCD is a sensible size at about 1.5 inches (although like all LCDs is hard to see in very bright light)and combined with the viewfinder makes it very easy to focus and frame in just about any light. An adjustable LCD would have been even better, but there you are. The only thing that I found wrong with this camera was the piddly little 8mb Memory Stick. I would strongly reccomend getting a 32 or 64 Mb, as the 8 meg will fill up in about 10 shots if you go for size and quality. Also - some sort of protective covering offered with the camera would be nice: I bought the semi-hard carrying case for it after dropping on a corner and denting the aluminium casing... What more can I say - a fabulous camera.", "Date": "August 28, 2001"}, {"Title": "Close to Perfect", "Author": "Mike Dushane", "ReviewID": "R1R3CWU7W3YO8C", "Overall": "5.0", "Content": "The image quality of the Sony has lived up to my high expectations; it is incredible. As a long-time amateur 35mm photographer and professional graphic artist, I really wanted a true digital SLR digital (couldn't afford $3k with lenses), but as a digital rangefinder, I am giving away very little with the DSC-S75. The manual mode combined with available spot metering gives me the control I need, and the controls are very easy to set - much easier than on most film SLR's. The overall size is small, but the rubber grip gives me a good place to hold it steady. Compared to the Nikon 995, the build quality is obviously superior. The heft of the controls is superb, and the materials are first-rate. The Nikon feels like it is made by Fisher Price. The image quality of the Sony is crisper and the colors truer, to boot. Tell me again why the Nikon is more expensive. The battery lasts a LONG time. It lasted more than 2 hours with the LCD on the whole time and with a lot of flash use. I had presupposed that I'd need a second battery, but I am sure I will get tired of shooting before this camera does on any given shoot.I will list my quibbles here in hopes that Sony might see them and rectify them, but they by no means outweigh my extreme satisfaction with this camera.Quibbles:*Needs more white balance presets - For now I use the one-push calibration, but if you don't have a gray card or a sheet of paper handy, more than 2 measly presets would be nice.*AF lock is awkward to use - It works, but not well at all. You have to push a button to lock focus AFTER releasing the shutter button from its halfway down position, and you risk the focus going blurry again (catching it in the middle of its trying to refocus) before you engage the lock button.*Manual is lacking in detail - There is no guide relating recommended apertures to distances for the different settings of the flash. You either use auto mode or you take guesses at the correct f stop. It also doesn't explain what the camera does with the flash in auto mode. I am sure I'll figure all this out with some experimentation, but as a techie I like to know EXACTLY what is going on.*Metering only shows +-2 stops, and doesn't work at all when in aperture or shutter priority mode and the camera deigns that there isn't enough light to get to the desired exposure. It just blinks a light at you.*The 8mb memory stick is a joke. 128mb sticks are now available for [$$$], but this must be factored into the price.", "Date": "April 24, 2002"}, {"Title": "Expectations were too high and amazingly it lived up to them", "Author": "R. Alvarado", "ReviewID": "RE3B6XGEJ4GKR", "Overall": "5.0", "Content": "I probably spent 2to 3 hours researching my anticipated purchase of a digital camera.  I told myself that I would spend no more than a couple of hundred dollars but the more I looked into it, the more I realized that a decent camera could not be bought for that price.  So I changed my goal to find a camera that had all the features I would need for the least amount of money.  I must have read everything on the net about digital camera's that ever was and I started narrowing down the list to a few names, then finally all roads kept pointing at the DSC S75. So I found a deal and made the leap, fully expecting to be a little disappointed when the camera finally arrived. The camera arrived and I began shooting the same day. Yeah, there was a bit to learn, but the more I learned, the more impressed I got. The quality of the pics are quite amazing. Oh, I also bought the Lexar 128mb stick so I would not have to keep deleting the pics cause I had no more room. I got a fantastic deal here on Amazon on that, even better than you can get on Ebay.  I also bought the HP photosmart 1115 printer and it arrived about 3 days after the camera did.  Anyway, back to the pics.  They came out super good.  Now I am hooked, I just ordered the flash, and now I am checking out the telephoto lense options. Photography many years ago was a big hobby of mine, and I do believe this camera has brought that interest back to life.  This camera has auto settings, aperture priority options as well as shutter priority. This camera has so many cool things to take advantage of that I guess it will be a while till I get proficient with all the possibilities. I wanted to be brief with this review, but with this camera that is difficult. I can just say that I am glad I did my homework, I feel like I got an \"A\" on the exam.  Oh, just thought I pass this one on to you, I read a professional reviewers article on this camera, he that said this camera was probably the best digital camera under the $5000 professional range.  I thought he might be biased, but now I am not so sure.", "Date": "February 24, 2002"}, {"Title": "Buy it NOW!!", "Author": "Gary Teal", "ReviewID": "RVVVQOT4HB0CU", "Overall": "5.0", "Content": "I love this camera!  The images print out very nicely just on my Epson Stylus Color 880!!  I cannot believe the quality of the pictures.Watch out for # of pixels.  If you want to print out a 4X6 pic, choose 2048 3X2 instead of 2048X1536.  But, If you want to use an image as wallpaper of screensaver, then choose 2048X1536.  Adjust photo size in PhotoSuite 8.1, which came with the camera.  The printed images look just like photos real picture quality - not pixelated with kodak premium picture paper for inkjet printers.All my friends are amazed at the quality and cannot beleive the pictures are printed.  I take pictures and then print them out immediately if I want.The camera has all the settings I need, including manual overrides (which I never use) and motion picture with sound recordable and speaker, so I can play the movie clip back and hear it too.  I make a lot of use of the close up portrait configuration (excellent detail close and blurring the background, as well as landscape (no blurring of the background) and twilight configurations.You absolutely need to buy a 64MB or higher memory stick - plan on that as an expense.  These memory sticks aren't cheap!  The [money] I saved buying this camera on sale went straight into memory sticks and camera bag.", "Date": "July 7, 2001"}, {"Title": "What a camera!!", "Author": "Steven C.", "ReviewID": "RTZ4L27UZNC4Q", "Overall": "5.0", "Content": "I purchased the Sony DSC-S75 back in June and have found it to be an excellent camera.  I shopped around and did the research thing and this was the ticket.  As other reviews have stated, the 8mb is a joke.  I bought a 64mb and then a 128mb.  I used the 128 this weekend for a birthday party and could not use it up.  I have found that I can get about 81 shots on the finest setting with the 128mb.  As far as picture quality...it is superb!! The macro lets you take beautiful crisp clear shots on flowers, close ups on faces, whatever.  I went hog wild and bought the tripod, Sony flash, lense adapter, wide angle lense, and filters.  All I can say is if you are looking for a great camera, this is it.  Highly recommend reading all of the manual.  Battery life:  have never lost power and I have been taking LOTS of pictures.", "Date": "August 19, 2002"}, {"Title": "Great, Fun and Worry-free Camera", "Author": "\"cyylee\"", "ReviewID": "R17UFF752S5JLZ", "Overall": "5.0", "Content": "I did an extensive online research before making my final decision to buy Sony S75.  I was considering either Sony S75 or Olympus C-3040.  I am very happy with the camera so far.  S75 has amazing features and so easy to use that I was taking photo ten mins after I opened my box.  The camera has various settings like ISO 100, 200, 400 or auto, different flash levels,different degrees of sharpness and photo quality, different image sizes, different rec modes, indoor or outdoor settings...etc.  The battery is definitely one of the best part about this camera.  It shows you how much time remaining while taking photos and also recharges very fast.  The movie mode is great as well.  With 320x240 image size and 64M memory stick, you can take up to 10 mins of movie which you can play in any winplayer.  The resolution is satisfactory.However, there are still some drawbacks about this camera as well.  The four-way buttom is rather too small to push.  Furthermore, even though S75 produces great photos, I am still not happy with the photo quality it produces.  For serious photographer, you might want to go for other cameras like Olympus or Nikon which will give you sharper images. S75 also does not take good photo when lack of light unless you use manual mode.  Also it is a good idea to buy additional 64MB memory stick while you purchase this camera.  You can get a better deal if you shop around online.Overall, this is still a great camera.  You can enjoy it from the first second you open the box and have so much fun with it without thinking how much you just spend on this camera!", "Date": "October 23, 2001"}, {"Title": "a great camera for performance almost similar to film camera", "Author": "\"rick74\"", "ReviewID": "R20QCQ7W7Q2OX8", "Overall": "5.0", "Content": "I had used to camera for past three weeks and had shot over 1000 pictures all over the attractions in my country,and i must said that this is a very user friendly camera.at first use it really is complicated with its white balance setting.auto or maual.iso setting .aperture or shutter speed setting...But after a few time of outdoor shooting I must said it is the best camera I had used so far.it will probably not be out run for the next three years.And the print out from my HP printer using matt hard paper from Epson And Hp are both brilliant and sharp indisguinable from film shot photo.one bad point i can complained that just only three weeks of usage.the printed icon on the jog dial on top right of the camera is falling off.some printed on my finger.I'm going to send for repair,wander how many user had this problem.", "Date": "August 2, 2001"}, {"Title": "Great 3.3 megapixel camera!", "Author": "Roberto K. Cho \"chorobe\"", "ReviewID": "RLITTH6N7PGR6", "Overall": "5.0", "Content": "...................P>I love the higher resolution, long life lithium ion battery (which is the same my camcorder uses), the great features (ie. manual shutter, aperture, full manual modes), and the quicker shot-to-shot capability in comparison to the camera that I upgraded from, the Sony DSC-P30 (1.3 megapixel).What I did not like was the fact that the picture quality of this new camera with the \"Carl Zeiss\" lens was no better than my 1.3 megapixel DSC-P30 camera! This is not necessarily a bad thing, the very reason why I chose the DSC-P30 a year ago was because the image quality blew away most 2 megapixel cameras...but I had hoped that this more expensive camera would at least have a noticeable difference in image quality...but it DOES NOT in most shooting scenarios (at least not in my eyes)...I can say that because of the flexibility of the manual modes, I have been able to take much much better night pics than with my P30.", "Date": "September 4, 2002"}, {"Title": "Not a bad camera!!", "Author": "jfawver \"fawvman\"", "ReviewID": "R3RHLIFF1LCKSY", "Overall": "4.0", "Content": "This is my 2nd digital camera (my first was the Sony Mavica FD-95).  This is a pretty easy camera to use (Sony cameras have generally been user-friendly) so that the 1st time buyer can just pick it up and shoot and yet has features that you'd want if you were an intermediate to advanced user.  The resolution is great for the money although if I could I'd probably get the DSC-85 model simply for the opportunity for 4.1 megapixel as opposed to the 3.2 that you'd get with this DSC-75.  Also you can get a 3 shot burst with the 85 as opposed to the 75.  But still that's taking very little away from the 75; you still get outstanding pictures with the 75.  A couple of caveats:  although I generally don't use digital cameras for action shots (I do from time to time on an experimental basis; just not when I need money shots) I haven't used it yet for indoor action shots (e.g. basketball games) so I couldn't evaluate the burst option yet.  That said, I also feel that if I did, then you probably need an external flash as the built-in one would be inadequate for action shots.A few more little squabbles:  If you do buy either the 75 or the 85, I highly recommend getting the 128 mB memory stick.  The factory 8mB stick just is inadequate; the down side is the extra $$$ for it.  But it is definitely worth it.  Also I think it records images a little slowly but that may be one of my personal quirks.Overall, I feel this camera does a very good job and I highly recommend it!", "Date": "November 4, 2002"}, {"Title": "Excellent image, built better than Olimpus.", "Author": null, "ReviewID": "R24V6U8O0PVXIY", "Overall": "5.0", "Content": "Excellent camera! Battery life is great and you have a count down in minutes for the battery life. Image is superb. Interface is also easy to use and compared to Nikon and Olympus, much more straight forward. Using the 128mb memory stick will give you over 700 photos on low resolution, which usually is the one you want to use anyway for email a friend, etc. The Sony site ImageStation will let you store albums for free and you can have any photo printed right there (paid service of course). Much better built than Olympus.", "Date": "July 23, 2001"}, {"Title": "Easy to use - Excellant picture quality", "Author": null, "ReviewID": "R3NXJMM0OSP1A4", "Overall": "5.0", "Content": "After a lengthy review of the available 3 and 4 megapixel cameras, I purchased the Sonty DSC-S75 model. I was looking for an easy to use (translated automatic) camera that my wife could use as well as one that would give me the manual options for more flexibilty. I chose the Sony because it gave me all the options I required as well as supporting Epson's Print Image Matching. I have been thouroughly pleased with my purchase from day one.The photo quality is exceptional as is the ease of use. The controls are fairly well laid out, and the menus easy to navigate. When coupled with my Epson 785EPX printer with the print image matching (PIM) the results are tremendous.I chose the S75 over the S85 because I could discern no significant difference between the test photos on DPreview on the 3.34 and 4.1 MP Sonys for the extra $. I use the Epson software for printing quick photos because of the PIM, and the MGI software included I didn't care for. For serious editing I use Photoshop Elements so the MGI suite was not a consideration. I considered the S-5 because of it's smaller size, but it didn't have the features I wanted. After using the S75, it fits well, the size is a little thick, but it has a solid \"real\" camera feel and the thickness is what gives it a better balance. Don't be fooled by the smaller size cameras, for my medium size hands like mine it doesn't work as the controls and feel are wrong (I have one in that size also).The only negative comments I have on this camera are the tiny memory stick included (get yourself at least a 32 MB memorystick) and that you need to use the Sony flash (but I can't remember that last time I needed an add-on so I probably won't purchase it).", "Date": "December 24, 2001"}, {"Title": "everything is proprietory", "Author": null, "ReviewID": "RI3CK5V1RNPQ8", "Overall": "3.0", "Content": "As with other manufacturers,Sony includes a laughably small 8MB memory stick. Absolutely factor in the cost of the 128 MB unit to get the \"real\" cost of buying one.The flash unit (which it needs!) is proprietory (in other words, you have to buy one from Sony) and (no surprise) it's overpriced.The lens cap doesn't attach to the camera... unless you buy a cord from Sony ...The USB cable is non standard- ... DON\"T LOSE IT (like I did)The memory is standard (thank heavens) and is decreasing in price and card readers are getting cheaper.Battery life is very good, but the batteries and cables are (you guessed it!) Sony only and expensive. I would like to get a 12 V DC adapter to charge the a batteries in my car but they cost [money]...... Also, very few lens filters available and they require the use of an adaptor. Weird.There is a long gap between when you \"push the button\" and when the camera actually \"shoots\" resulting in a lot of wasted shots.I would rate this as \"close- no cigar.\"", "Date": "August 6, 2002"}, {"Title": "Excellent Digital Camera", "Author": "TO \"Rollin68\"", "ReviewID": "R205O7OFI9JHN9", "Overall": "5.0", "Content": "This camera is just incredible!  There are so many picture options, The battery lasts forever, It is an ergonomic excellence, and most of all the pictures are incredible.  I am having a great time using this camera shooting life (My children).  I only wish the Memory sticks where larger in capacity.  Looks like Sony has plans for bigger than 128mb in the future.  I have 2 64mb Memory sticks and that is the minimum you need for this camera.  I would like to get a few more as the prices drop (which they are).  ENJOY!", "Date": "August 14, 2001"}, {"Title": "Sharp but frustrating", "Author": "Lawrence R. Hudson \"Fatherhonda\"", "ReviewID": "R1R7B4N38KROHX", "Overall": "4.0", "Content": "I bought this camera to replace a Kodak DC4800 which had difficulty rendering sharp photos indoors (even with the firmware upgrade).  The Sony is much sharper indoors, with accurate focusing and a strong flash.  The MPEG video feature turns out to be more fun than I thought it would be.  My main criticism is that the camera takes too long to set the focus and exposure before taking the picture -- the moment is often gone by the time the camera acts.  Also, outdoor color isn't as good with the Sony as the Kodak, but it is easily corrected with image-editing software.", "Date": "March 2, 2002"}, {"Title": "So far, so great!", "Author": null, "ReviewID": "RACPTE2DA4FRH", "Overall": "5.0", "Content": "Wow, this seems to be living up to the previous reviews.  I was close to buying the Nikon 885 Coolpix but this Sony has a great picture, excellent shutter speed, and plenty of features for such a compact camera.  The only downside to it is your pretty much stuck with buying Sony components (momory stick, battery, etc.) although they are only slightly more expensive than the generics Nikon accepts.  So, if you need a great digital for a good portable size, this is a good choice!", "Date": "July 3, 2002"}, {"Title": "I love this camera", "Author": "Ana Paula \"anap0875\"", "ReviewID": "R1THEET2QX584Y", "Overall": "4.0", "Content": "I bought this camera right before our trip tp Brazil. I enjoyed the quality of the pictures we took. Just keep in mind that the 8Mb Memory Stick is not enough, at all. You will need more than that to store your pics. Another little thing that I didn't like is that it is too slow to take a picture; you push the button and have to wait a few seconds before the picture is actually recorded. I feel that anoying especially when I take picture of my pets. They do not stay steel and I end up having to take two or three pictures so I can choose one good one.Anyway, I like this camera a lot and I do recommend it. I print my pictures at home and the quality is excellent. There are lots of features in the menu, and I have to admit I haven't learn all of them yet. It is very easy to use tough. Besides, it is a Sony, a brand I like and trust.", "Date": "August 1, 2002"}, {"Title": "The Best \"I can Be\"!", "Author": "Robert Witt", "ReviewID": "R1M9IC4X3TOXEG", "Overall": "5.0", "Content": "I have been a proud owner of this camera for several monthsnow.I had stepped-up from previously owning the Sony DSC-S50model and I couldn't be happier! I'm a \"Novice Photographer\" butthis camera is that \"ADVANCED\" to allow me to-be the BEST I canbe! I've been eagarly studying the Opt's Manual and learning ALLthe \"Manual Functions\" as I have'nt owned such a Camera that gaveMe so much Artistic Freedom!  I am truly Excited with this little \"jewel\" and have Not beendisappointed with the Quality of photo's; Nor, the results of this DSC-S75 many options and features!  I would strongly recommend getting the 64 or 128MB Memory Sticks and it wouldn't hurt to have \"More the ONE\"!!!  In Conclusion,i would say; I would think even a ProfessionalPhotographer would be happy with the Quality,Functionality,andHandling of this \"Amaging Camera\" by Sony: You WILL NOT be Unhappy to own,this Camera!!!", "Date": "July 19, 2002"}, {"Title": "Simply the best", "Author": "Katie Vento \"tipiinc\"", "ReviewID": "R3RIW5IM70S3QR", "Overall": "5.0", "Content": "This is the best camera I have ever bought. I originaly bought it in october last year, to sell things on ebay. I have not put it down since. Its easy to use, no manual required and the results are fabulous. It has a traditional zoom in and out lens, built in flash, a good size lcd screen and is nicely compact. I print out my pics using an HP photosmart 1315 printer with results as good as any 35mm I have had developed.The camera is quick to charge with recharges needed infrequently. The sony memory sticks are [high in price] and I recommemd getting several 32 or 64's if you are using the camera on vacation. You could get by with one memory stick if you have computer access and don't mind emailing the picture's to yourself frequently.", "Date": "January 27, 2002"}, {"Title": "5 Years and Counting", "Author": "upbeat1 \"upbeat1\"", "ReviewID": "R1PXB966OL3XHD", "Overall": "5.0", "Content": "I received my Sony Cybershot in 2001 for Christmas. It is now just about 5 years later and my Sony Cybershot is still functioning wonderfully and I have put a lot of miles on that camera! Really good sound quality, really great photos, lots of features... I'm still learning new ones! And what an awesome price. If this one ever breaks down and needs replacing, I wouldn't mind purchasing the exact same one. I do realize there are cameras out there with many upgrades and higher prices, but seriously... this camera does just what I need.", "Date": "October 20, 2006"}, {"Title": "gbware", "Author": "gbware", "ReviewID": "R30ER6U2SJS22", "Overall": "4.0", "Content": "I've owned this camera for about 4 years and have had great success with it.  As other reviewers have stated, the lag time in capturing an image is a major issue - but when I bought this camera - it was state of the art.  For that reason I've upgraded to the Sony DSC-V3 which has practically no lag time - it's great for capturing pictures of my grand-daughter as she zips through the family room.The S75 has been a great camera - aside from the lag time the only other problem I've had is while reviewing images in play back mode, sometimes it will take off with itself uncontrolably scanning through all of the pictures on the stick - very annoying.I'm giving the S75 to my college graduate so can take pictures while traveling on his new job.", "Date": "February 25, 2006"}, {"Title": "Sony S75 Great for the amature photographer", "Author": "Wild42Bill", "ReviewID": "R19HA75I0EWXA1", "Overall": "5.0", "Content": "Love this camera, Sharp pictures, easy to use, tough, a feature for every situation if you chose to get fancy.  Recharagable battery lasts long and charges quick.  Negs would be: slight delay between button pressed and pic taken, but seems this is common at this price range.  Had it 2 years and taken 4000 pictures.", "Date": "August 27, 2004"}, {"Title": "Excellent Pictures", "Author": null, "ReviewID": "R32EX8YGG2NBQT", "Overall": "5.0", "Content": "I purchased A Sony DCS-S75 Digital camera and consider it one of the best buys that I have ever made. The ability to see the picture you have just taken eliminates the guess work from taking pictures. The quality of pictures that this camera produces are outstanding in my opinion. I can down load my pictures to my computer and print professional quality pictures. This camera has many options and adjustments and I have not mastered all of them but the instructions are clear and easy to understand. I would never go back to film again.", "Date": "February 23, 2003"}, {"Title": "Awesome!!  Very Dependable!!  I Love my Camera!!", "Author": "LeAnn Wright", "ReviewID": "R1P3OZARONCQQ9", "Overall": "5.0", "Content": "This is an awesome camera!! I am a die hard \"still camera\" person.  I always said that a digital could never produce the quality and clarity of my Cannon EOS Rebel \"still\" camera.I will have to say I have almost switched completely!! I absolutely love my Sony Cybershot!!  I take pictures alot.  It is very user friendly.  I love that it takes black and white and the sepia tone.  I take pictures that look like professional prints.  I take my memory stick or a cd up to [a local store] and print them on their photo machine.  I can't tell the difference between my still camera and my digital prints.  It also does little mini movies.  They are great to email to grand-ma.  It is very durable.  My husband did his research and found that this one had the most to offer.  I would reccomend this camera HIGHLY!!", "Date": "February 10, 2003"}, {"Title": "my first digital camera", "Author": "alex g.", "ReviewID": "RCYB0XMXZ7F5K", "Overall": "5.0", "Content": "i just purchased this camera over the weekend and i think it's a pretty cool camera. the high points about this camera is the ability to manually adjust the camera's exposure settings (the aperture and the shutter speeds), it's movie mode (you can record up to 10 mins, w/sound), it fits nicely in my hand, and you can print 8x10's (i haven't tried this yet, but with 3.2 mp it shouldn't be a stretch). the only thing i didn't like was that it came packaged with an 8 mb card, which is useless. pick up at least a 64 mb stick and you should be fine. i also don't like that i have to manually put the lens cap on everytime i'm not using it, it should have an automatic cover. overall great purchase, battery lasts about 3 hrs and comes w/its' own charger. highly recommend.", "Date": "July 25, 2002"}, {"Title": "The colors are better then life", "Author": "Laurel \"I love the internet.\"", "ReviewID": "R2G7TCVL0J0783", "Overall": "5.0", "Content": "This old retro camera is still worth picking up, if you can find a memory stick for it. They don't make them anymore. I am going to post a blog about why I still love this old camera. It did not break even when I dropped it. The photos of flowers are better than the eye can see. On people that is not such a good thing, but if you are taking photos of objects, this is a great camera. The zoom is awful and it needs a lot of natural light. If you take a photo of flowers with this old Sony then take another photos of the same photos with a newer camera, the reds, yellows, oranges and pinks will look better and brighter. But, if you can't get a memory stick, then the camera is worthless, so be sure you can get one. When the stick fails, I won't be able to replace it. But, I bought I large capacity stick in 2001 when I got the camera. I love this camera.", "Date": "March 9, 2012"}, {"Title": "10 years old and still going strong!", "Author": "S. H. Moore", "ReviewID": "R2LJISR5W141JU", "Overall": "5.0", "Content": "I bought my Sony DSC-S75 in 2000 from Schiphol airport for the grand price of 600 euros including 64MP memory card and a Sony case. Having almost exclusively used this camera since then, I can confidently say that I know the Sony DSC-S75 from inside out. I have recently considered replacing the camera, as it no longer meets all of my photography needs, but now I'm having second thoughts - why replace something that still works perfectly?PROs- Superb value for money at the current second-hand market price- Takes photos of excellent quality for a non-DSLR- Robust and reliable (even the electronics are fully functional after more than a decade of use)- Good in low-light conditionsCONs- Heavy and bulky in comparison with newer models- 3x optical zoom is insufficient for distance shots- Very slow auto-focus- Small LCD- Memory cards are no longer for sale", "Date": "October 31, 2010"}, {"Title": "Sony Digital Camers Model DSC-S75", "Author": "Roland Mata", "ReviewID": "RQR2SV2QJH6PQ", "Overall": "5.0", "Content": "I recently purchased this camera as a gift after having one of my own for years.  This Sony model camera is very easy to learn how to use and takes terrific pictures, and short mpeg and avi movies with sound.  Has all the manual control features you find on much more expensive models.  The only negative about this camera is that it's hard to find new as it has been discontinued by Sony.", "Date": "October 15, 2009"}, {"Title": "The Best Camera Ever", "Author": "Nursemom2121 \"Thanks, Shannon\"", "ReviewID": "R3B5SD29ML4AS", "Overall": "5.0", "Content": "The is the best camera ever! We bought this camera a Whopping 8 years ago and it takes the best pictures, after about the millionth drop it finally broke and so we have been trying to buy a new one. We have tried 5 different expensive cameras with about twice as many MP's and none are as good as this one! I love this camera, my sister said when we bought a new one she wanted this one because it was better then her camera that was 500 Euros! Too bad it broke! I am thinking of getting the same camera again b/c we can't find any newer ones that are better! This Camera rocks!", "Date": "December 9, 2008"}, {"Title": "Good first digital camera", "Author": "W. McDaniel \"wsm0723\"", "ReviewID": "RDWUA3VX8QVKV", "Overall": "4.0", "Content": "Bought this about 3 years ago and have been very happy with it.", "Date": "November 9, 2005"}, {"Title": "Excellent Camera", "Author": "Pleasant Valley", "ReviewID": "R2PQWS7A9VCZ4O", "Overall": "5.0", "Content": "If you get to know this camera you'll get excellent pictures. I use to have an SLR camera and I haven't use it since I bought this one. By the way I have like 4 years and it is in excellent conditions since", "Date": "August 29, 2005"}, {"Title": "kjb", "Author": "K. Bullens \"kjb\"", "ReviewID": "R30WHGZSJKP8E8", "Overall": "4.0", "Content": "This would get five stars if it didn't take so long to take a picture. As noted in other reviews, there is a significant lag between pressing the button and taking the picture - a real negative when dealing with kids or action pictures.What I like:The ability to take a picture in one size and save it later as a different size. This is great for saving small files for emails, and also saving the same picture in a larger format so it has enough detail to print a crisp and clear picture.The camera uses the same battery, memory stick and power cord as my Sony digital video camera. Less stuff to pack and carry with you on vacation.", "Date": "July 26, 2004"}, {"Title": "Great Camera", "Author": null, "ReviewID": "R2JWJJQE8UPJ4L", "Overall": "5.0", "Content": "Not a Pro, but I can vouch for this camera. Great product from Sony. You'll not be disappointed.", "Date": "March 11, 2004"}, {"Title": "I'm no pro, but this thing's great!", "Author": "Christine Ricks \"buffgato\"", "ReviewID": "RWZJ9CLL02NNQ", "Overall": "5.0", "Content": "I'm what you might call a kindergarten photographer... I've taken a few good shots, but I don't know anything about cameras, and I've never taken any photography classes or even tried to learn much of anything, really. The only two things guiding my shots are the 3 years of art classes I took in grade school and an hour or two with the User's Manual. That said, this camera does a great job! It's so easy to use and the pictures turn out so good! Even a novice like me can take beautiful pictures...just don't forget to read the manual", "Date": "November 23, 2003"}, {"Title": "Great camera!", "Author": "S. J. Dally", "ReviewID": "R3NZQ0KV4PS81N", "Overall": "5.0", "Content": "I love this camera!  The picture quality is great, it's so easy to use, and storage is a snap!  I can't ask for much more.A few of the upsides - You can use either the regular view window or the large color screen to take your pics; replace the 4MB Sony memory stick that comes with the camera with a larger one (I went with 128MB and have yet to run out of room!), and you've got huge storage possibilities; you get multiple resolutions, so your pictures are always clear; you can view the pictures you've already taken, so if you took a bad one you can retake it right then and there.I can honestly say I've only taken a couple of bad pictures with this camera, and the cause was operator error.  If you want a great digital camera for an affordable price, this is the one.", "Date": "June 14, 2003"}, {"Title": "What a wonderful thing!", "Author": "Chuck", "ReviewID": "R2RHOV8O8GTXE8", "Overall": "5.0", "Content": "I am not a photographic fanatic, nor am I an expert in the area of the photography.  I simply bought this because after 2 weeks of research, I decided it was the best price/feature combo in the 3MP range (when it was still available on Amazon).  ...  Was I ever right, I have been strutting around with this and comparing it to my friends and relatives cameras for awhile now, and I love watching the shocked (or jealous) look on their faces when I told them how much, I mean how little, I paid for it.  I am not going to go on about the features since you can read yourselves, but I have taken pictures in every imaginable conditions, sunny, dark, rainy, indoor w/ or w/o lights, even on a sunny day after overnight snow when the glare off the snow was overwhelming, the pictures always come out looking good.  Of course, it pays to read the manual and know some extra tricks.  So good luck if you can find one, don't hesitate to buy it.", "Date": "January 22, 2003"}, {"Title": "Superb camera for 12 years use", "Author": "New Life", "ReviewID": "R3ITEG3A0PSEO4", "Overall": "5.0", "Content": "This is a fabulous camera.  Most of the reviews are from 2001 or 2002.  I have used this for 12 years and it is as fabulous as ever in 2014.  The workmanship is meticulous and nothing has gone wrong in 12 years.  The pictures are as great as ever, and the mini movies I took are lively and capture the fast motion without problem.  All the praises of the other users are true, and I want to add in 2014 that it just keeps going, going, going.  I can take 900 pictures (though I never tried), and about 6 movies without trouble on 16MB of memory.  It has served me fine though more memories would enable more great movies.  I would say In 2014, it is worth 10 times or 20 times it is selling here!  You cannot get a better camera for 20 times the money.It's a shame Sony doesn't produce anymore Memory Sticks for this great camera, and it's hard to find larger memories.  I just wonder what 1GB memory would do for this great camera, but it doesn't exist.", "Date": "May 22, 2014"}, {"Title": "great for everyday pics i might might find the need to take.", "Author": "Leek", "ReviewID": "RG5C1SZHETWBI", "Overall": "3.0", "Content": "I bought this because years ago i bought one new for around 800.00..  At the time it was new tech.  It took great pictures.  I use it for every day pics I might want to take. I can leave it out and close by. It's pretty durable", "Date": "May 21, 2013"}, {"Title": "Excelente camara", "Author": "Anvibe \"anvibe\"", "ReviewID": "R1DAP9HYZ8R05Y", "Overall": "5.0", "Content": "Me impresiono la calidad de las fotos. La he llevado en muchos de mis viajes y la calidad de las fotos siempre fue la mejor.", "Date": "January 30, 2013"}, {"Title": "Fine but older", "Author": "L. Hossler \"LSH\"", "ReviewID": "RAKS7CW9Q1NRH", "Overall": "3.0", "Content": "NIce camera, but video are terrible quality. However, due to age, I dont worry about it being stolen or damaged.", "Date": "December 23, 2012"}, {"Title": "Built like a tank", "Author": "Stone Blue", "ReviewID": "R2YI58Y2YZ7FWQ", "Overall": "5.0", "Content": "and made to last, this is a great camera, if you realize it's shortfalls. Super image quality for what it is. Gotta love it. They just don't seem to build them like this anymore.", "Date": "December 16, 2010"}, {"Title": "By far the BEST Sony camera...", "Author": "Amazon Customer \"Kyler's Mommy\"", "ReviewID": "R12DZRFEZ4Z3WS", "Overall": "5.0", "Content": "I had originally purchased one of these cameras back in 1999 for a trip to Europe.  Since it was Sony and a worldwide company, I was able to purchase the adapter to charge in any country very easily.  That was the first plus for me on this one, with many more to come.The camera takes pictures with ease (especially since this was my first digital camera back then).  Easy to learn on, yet perfect for the expert.  Additional lenses may be purchased (wide angle, etc.) on eBay or any site similar for rather cheap.I had to repurchase this camera again this year because the camera my ex-husband and I had was so great that we fought over it in the divorce and I lost!  LOL.  I bought my new one on eBay (got it for about $50) and still love it.  VERY easy to use, yet it has so many options that I still cannot find on digitals.  I had also owned a Panasonic digital and another Sony, but came back to this one because of all the options and wonderful picture quality.  Very highly recommended!", "Date": "July 9, 2009"}, {"Title": "4.5 out of 5 stars!", "Author": "TB \"Tony Mac II\"", "ReviewID": "R13ADXKPX66YIW", "Overall": "4.0", "Content": "It's a great camera! I am happy and impressed with everything about it!It just falls short in one area..  High Resolution Video limited to 15 seconds is kind of a bummer.When i first bought the camera, of course i was psyched! But one thing that I now wish.. i wish the higher resoltion video recorded--unlimited by time.Besides that.. everything else is great! And it's really easy to connect to the computer--despite 'rumors' i heard.. how hard it was to set up sony cameras with computers other than sony computers.There are advantages and disadvantages to owning this model.. compared to the dsc P7. I was torn between the two--however.. the DSC S75 felt like a more natural camera. I felt the DSC P7 felt a little too small for my hands. Also, the manual options on the DSC S75 made it a nice choice as well.An advantage of the DSC P7 is.. unlimited High Resolution video! The mid and lower resolution video can take up the whole card.. on the DSC S75.. so it's not too bad!Anyways, if you pick this model.. congrats! It's a great choice! I'm just wondering what would of happened should I of gotten the DSC P7(but that problem will be resolved.. when i buy a camcorder.)", "Date": "October 24, 2002"}, {"Title": "Excellent camera, highly recommended", "Author": null, "ReviewID": "R32S0GC3LZHCSR", "Overall": "5.0", "Content": "This is an excellent camera.  We just bought it after having a baby and we have taken so many pictures with it.  It is very user friendly.  The menus are easy to browse through.  I have borrowed a friend's digital camera in the past and it was nowhere near this easy to use.The pictures it takes are excellent.  I don't know how I lived without a digital camera before.  It is great to have a camera that can take such high quality pictures and I can choose which ones I want to print and which ones I'll just save.", "Date": "July 1, 2002"}, {"Title": "Looking to replace your old SLR?", "Author": "John Landers", "ReviewID": "R2K1QP3WDOMFM", "Overall": "5.0", "Content": "Being a novice photographer, I wanted to upgrade to a quality digicam. (3+ megapixels). I owned an OLYMPUS entry level digicam for  4 years. Basically point and shoot. When this camera broke and OLYMPUS wanted over $... to fix it, ... I new it was time to move away from Olympus and tried several other brands. I decided on the SONY DSC-S75. It has adjustable functions that compare to SLR's (shutter speed, aperture settings,manual exposure, etc,) along with 6x digital zoom. \"Memory Stick\" media is considerably more expensive than \"Smartmedia\", but this was not a problem as I own a Sony VAIO computer and Digital camcorder which both use \"Memory stick\". This is a GREAT camera for anyone who wants to move up from \"point and shoot\" to a more advanced system.", "Date": "January 13, 2002"}, {"Title": "Sony Is Great", "Author": null, "ReviewID": "R2J6XXDGISD2Z7", "Overall": "5.0", "Content": "This is my first digital camera.  I did alot of research before I bought this camera.  It was worth it.  The only drawback is not enough memory is included.", "Date": "December 31, 2001"}, {"Title": "Amazing", "Author": "lindros", "ReviewID": "R1BXETWWSVL8V6", "Overall": "5.0", "Content": "After mulling over 10-15 cameras I finally decided on the Sony. Understanding that it uses Memory Stick, I purchased the camera and have been extremely happy and impressed. I give it five stars because FEATURES, PHOTO QUALITY, and EASE OF USE are all top-notch. Even if the storage is proprietary, what else are you going to use SmartMedia or CompactFlash for?You can't go wrong with this Sony.", "Date": "August 29, 2001"}, {"Title": "Our Sony DSC-75 Digital Camera-The One That Does it", "Author": "David Nims", "ReviewID": "R3C6KROXUJYKYT", "Overall": "5.0", "Content": "My wife Cara and I decided to get into the 21st century of Digital Photograpy with our 2001 Christmas present to each other. We are just beginning to \"scratch the surface\" of its seemingly unending capabilities. You can take more photos on a 128 megabite memory stick than you can believe. Choose a format of 600 X 800 and you can fill 2 or 3 LARGE photo albums with your personal images or loved ones. Set it up for an MPEG film clip and record video and audio at once. How about audio with a still, I could go on and on but, suffice it to say that we are 2 very happy Sony Cybershot owners and are still learning about this marvelous world of digital photography.", "Date": "February 5, 2002"}, {"Title": "good camera, software should improve", "Author": "allison r suckley", "ReviewID": "R3JZRSRVPN6R3H", "Overall": "4.0", "Content": "the MGI software 8.1 is unable to get pictures from the camera to the software without making a folder and copying files to the folder.  the mgi 8.1 needs a full sheet of photo paper to print a wallet size photo.", "Date": "July 1, 2001"}, {"Title": "ideal camera", "Author": null, "ReviewID": "R1FK2GCV3UE27X", "Overall": "5.0", "Content": "excellent picture qualityeasy to operateget 64 or 128 MB memory stick to go with itIdeal digital camera for family pictures and travel.", "Date": "April 14, 2002"}, {"Title": "get one", "Author": null, "ReviewID": "R10I03TEB2EV9K", "Overall": "5.0", "Content": "if you need an easy to use, smart camera, and has a great movie mode, this is worth it... I've had so much fun and entertained so many friends with this state of the art digital toy, + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + + +", "Date": "October 13, 2001"}], "ProductInfo": {"Price": "Unavailable", "Features": "3-megapixel sensor captures enough detail to create prints up to 11 x 14\nCarl Zeiss autofocus lens with 3x optical/2x digital/6x total zoom\nIncluded 8 MB Memory Stick holds 8 images at default settings\nMovie mode captures video with audio--store as much video as Memory Stick size will allow\nUses proprietary lithium-ion rechargeable battery (included); connects with PCs and Macs via USB port", "Name": "Sony DSCS75 Cyber-shot 3MP Digital Camera w/ 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41EK1V3ZCJL._SX300_.jpg", "ProductID": "B00005I9PG"}}