{"Reviews": [{"Title": "Don't settle for cheap imitations.", "Author": "G. Grice", "ReviewID": "R20ZIZ02QA0JST", "Overall": "5.0", "Content": "Panavise is the Cadillac of mounting devices. I have used them for many different applications. This one is holding a video camera in our Church. They are rock solid with no cheap plastic parts.", "Date": "January 21, 2010"}, {"Title": "Works Great", "Author": "Marc A Cadorette", "ReviewID": "R3J61AD25NC7H7", "Overall": "5.0", "Content": "This is a much better quality mount than the one that came with my camera.  It can mount a camera in many different ways and holds the camera very securely.  It is easy to get the camera lined up at a good angle with this mount.  I'd buy again.", "Date": "March 31, 2013"}, {"Title": "Strong with Flexible Mounting Options", "Author": "Amazon Customer", "ReviewID": "RWPJMHR43SE15", "Overall": "5.0", "Content": "I had previously purchased a high-end 2MP outdoor camera from Vivotek which came with a mounting bracket.  The cylinder wouldn't tighten at the base, making the camera swing down with the weight.  I purchased this unit hoping that it wasn't of the same build quality.  Well, I was very pleasantly surprised.  This product is of very high quality and isn't moving around anywhere, even with lots of wind twisting on the camera.  I was glad I bought this particular kit because I ended up being able to tweak my setup more than I had intended based upon the flexibility provided with the different options.  I will definitely be purchasing another one of these units when I buy my next camera.", "Date": "November 13, 2011"}, {"Title": "heavy_user", "Author": "John H Puckett \"cctv_user\"", "ReviewID": "R3TXKG076UI60S", "Overall": "5.0", "Content": "These mounts are strong, sturdy, and very flexible for all forms of mounting small cctv cameras. Most of the mounts I've received that came with cameras were too weak and clumsy to do the job. For the money, simply the best design for mounting cameras.", "Date": "October 30, 2006"}, {"Title": "This is a great mounting kit", "Author": "aminus", "ReviewID": "R19OYM62ZNTDP2", "Overall": "5.0", "Content": "This was used first to mount a Honeywell security camera to a window frame. The camera didn't work out in this location and had to be replaced with another camera that didn't require a mount. We were able to use a different configuration of the kit to mount the Honeywell camera to a dropped ceiling. My advise: if you use the mounting kit, hold onto the parts that you don't use for possible future use.", "Date": "December 30, 2013"}], "ProductInfo": {"Price": "$19.99", "Features": "Modular system: Base, Shaft and Head screw together\nSolid steel Shafts [0.5-Inch (12.7mm) diameter] will make a 2-Inch (50.8mm), 4-Inch (101.6mm) or 6-Inch (152.4mm) long mount. 1/4-20 stud with lockring\nFully adjustable at the camera (190 degreesTilt, 360 degreesTurn & 360 degreesRotation)\nKnob and tamper-resistant set-screw adjusting options included. Matching vinyl cover adds a finished look!\nIncludes 2-Inch (50.8 mm) round Base with four 0.188-Inch (4.8mm) holes on 1.6-Inch (40.6mm) bolt circle for solid surface mounting, and a T-Bar Clip for drop ceiling rails\nSolid steel Shafts [0.5\" (12.7mm) diameter] will make a 2\" (50.8mm), 4\" (101.6mm) or 6\" (152.4mm) long mount. 1/4-20 stud with lock ring\nFully adjustable at the camera (190° Tilt, 360° Turn & 360° Rotation)", "Name": "Panavise 845-246W Deluxe Micro Mount (Cream)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Sig16UGnL._SY300_.jpg", "ProductID": "B00009WBYX"}}