{"Reviews": [{"Title": "A very good and sturdy camera in this price range", "Author": null, "ReviewID": "R3PNPLDT87T1LV", "Overall": "4.0", "Content": "Duration of ownership: 2 monthsStrengths: 7MP point-and-shoot camera with a 3X zoom. Easy-to-use built-in help screens. Nice looking and strong brushed-aluminum body.Weaknesses: No viewfinder. Limited choice of settingsOverall Evaluation: A feature of this M627 that I liked is that the camera allows the users to quickly and easily add creative effects and borders to their photos right on the camera using the HP Design Gallery; I can can choose up to 10 different borders, including burnt, soft or torn edges, 12 different artistic effects, such as kaleidoscope, retro and slimming, and four unique color tints. The HP Photosmart Express feature is also nice; it makes makes sharing, printing and saving digital photos easy. The drawback of the camera that I found was the lack of sharpness and color accuracy when taking pictures in night time.", "Date": "December 9, 2006"}, {"Title": "Awesome Large View Screen", "Author": "GA Tech Mom", "ReviewID": "R3V10HC153HUY0", "Overall": "5.0", "Content": "I purchased this camera for my daughter who is in college for Christmas.  She LOVES it.  The large view screen on the back is more awesome than she expected.  No second quessing at what the photo will look like.  She searched for just the right memory card and found a 1 gig SD card and she can now store many, many photos.  The only drawback that she noticed was that the night time pictures seemed to come out slightly blurry, like as if the shutter speed may be not set \"just right\" for the time it is taking for the night shots.  She said she would definitely recommend this camera to anyone.", "Date": "February 23, 2007"}, {"Title": "HP Photosmart M627 7MP Digital Camera with 3x Optical Zoom", "Author": "Mary Kathryn", "ReviewID": "R1VZXUDC2I8PFV", "Overall": "5.0", "Content": "Excellent service. Super camera. Prompt. Fantastic price!! Couldn't be happier!!", "Date": "January 26, 2007"}, {"Title": "DECENT CAMERA BUT DOESN'T ALWAYS FOCUS PROPERLY", "Author": "Cute Chihuahua", "ReviewID": "R1LLDTOITZHIAL", "Overall": "3.0", "Content": "We received this camera as a Christmas gift and I loved it at first.  However as I started using it more I noticed that i doesn't always focus properly.  It is usually when you are taking pictures of brighter colors and also when there isn't a lot of lighting.  I wouldn't say this is a bad camera but their are certainly better models out there.", "Date": "November 29, 2008"}, {"Title": "It works.", "Author": "Sunshine", "ReviewID": "R1DPKUXGYBDLIG", "Overall": "4.0", "Content": "It seems to be working ok....time will tell if it continues to perform well. My other opne just stopped for no reason. I'm hoping this will not be a repeat, because I really do love the pictures they produce.", "Date": "May 28, 2013"}, {"Title": "Excellent Camera", "Author": "T. Vineyard", "ReviewID": "RG2JENBV3VV3A", "Overall": "5.0", "Content": "I purchased this camera a year ago and dropped it. I bought 2 other cameras and returned them. I bought this camera again and love it! I went on a search and was happy to find it on Amazon!", "Date": "September 23, 2008"}, {"Title": "hp has impressed me", "Author": "Mr.BLB", "ReviewID": "R3FF6YOA245SED", "Overall": "4.0", "Content": "My main digi cam is a Panasonic FZ20 which is alot bigger then this hp, so I wanted something that I could carry easily with me and stil provide quality pics. Well, along came the m627 and I am very pleased and happy with it. I was hesitante being that it is a hp digi cam, but I read on it and said what the heck. (It was only 50 or less that I paid for it, cant recall) I love the large lcd, very easy and simple to use which is what I want in a small portable cam. takes great pics, which I was surprised about. the only draw back, it only has 3x optical zoom but thats why I have the FZ20 with 12x optical.one thing though, not all HP cams will be as good as this one or better then this one. I was looking to buying a hp one for my mom for mothers day, a newer model but the pics the demo model was taking were CRAP compared to this model.so, def read and try to get your hands on it before making a purchase.", "Date": "May 12, 2008"}, {"Title": "Cameria unsafe", "Author": "Michael Scannell \"MR Safety\"", "ReviewID": "R1MLVFME37MI0X", "Overall": "1.0", "Content": "This camera has three issues.  The camera has to open and close the lens before it can open.  This will jam after a multiple uses and the will not open. Then the camera will not work.  Also the battery holding area has a clip that is sharp and it cuts the battery that is placed in the camera.  Then when the acid leaks out, it leaves the containment area and stays on the outside.  You will need to replace the batteries often. I have talked with HP they know of these issues, and have stopped making this item.  I would not buy this item.", "Date": "July 11, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Get beautiful 4 x 6-inch prints and enlargements to poster size with 7-megapixel resolution\nGet clear close-up shots from a distance with 24x total zoom (3x optical, 8x digital)\nFrame, view, and edit pictures on the large image display, which is bright enough for outdoor viewing\nRecord video clips with sound\nAutomatically remove red eye, right in the camera", "Name": "HP Photosmart M627 7MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41CSDC0M5ZL._SY300_.jpg", "ProductID": "B000HWNGX4"}}