{"Reviews": [{"Title": "Love it!", "Author": "Chimommy", "ReviewID": "R1RP78QT85X221", "Overall": "5.0", "Content": "I just recently bought this camera and absolutely love it.  I purchased it as an upgrade to my Vivitar 3705 which was a horrible camera.  While the Pentax M20 may not be the top of the line, you get so much for the price!The LCD screen is large and crystal clear.  The settings are easy to change and use. It is simple to go back and forth from taking pics to viewing the ones you've just taken.  Easy to delete unwanted pictures.I find the picture quality to be very good.  I don't have the same problem with blurry pictures as the other reviewers have mentioned.  Only time I have noticed blurry photos is when the camera moved slightly while snapping the picture.  A little icon shows on the screen when that happens so I was expecting it.Over all, if you are thinking about purchasing this camera as a first camera or an upgrade, I think it is a great choice!  I love mine!", "Date": "November 30, 2006"}, {"Title": "Blurry for Unknown Reason", "Author": "BGunner01", "ReviewID": "R1LDT6OK7Y9DJT", "Overall": "3.0", "Content": "My findings are quite similar to those of the first reviewer of this camera.I purchased the Pentax Optio M20 as a replacement for my 5-year old Canon PowerShot A40.  The M20 is a 7 megapixels camera versus only 2 megapixels for the A40.  I first saw the camera offered on one of the home shopping channels and I liked what I saw, but I was able to find one for considerably less money on the internet.After almost two weeks of experimentation with the new camera, I absolutely loved almost everything about the camera -- such as the huge 2.5\" display; extremely easy maneuvering amongst an amazing variety of features/functions; small size; light weight; lo-o-ng battery life on two common AA batteries, etc.  About the only thing I did not care for was the unfamiliar size of the I-USB7 connection cable (small connector that plugs into camera).Even with all the great features of the camera, it didn't take photos nearly as good as my old 2 megapixel camera!  The photos were unacceptably blurry for a 7 megapixel camera.  The photos were not as good as my old camera and barely better than some I've taken with my cell phone camera.  I re-set all the functions to their original settings then experimented with various items such as:  faster shutter speed, higher/lower megapixel settings, varying the ISO, using with/without the anti-shake function, with/without a flash, etc.  I didn't see noticeable improvement.I contacted Pentax via email and I will also call them later to try whatever they suggest to remedy the problem.  However, at this point I think I will be returning the camera for a refund.  I will follow future reviews to see how other people more experienced than me rate the camera.  I liked the features so much that I would certainly purchase it again but right now I think there may be internal problems with the model Optio M20.", "Date": "November 28, 2006"}, {"Title": "Great value in a 7 MP camera", "Author": "Larry Morrison", "ReviewID": "R1UNS49BI87EFY", "Overall": "5.0", "Content": "First, I need to say I'm very pleased with picture quality. I'm not experiencing burry or fuzzy images as some other users. Shutter lag is a problem in some instances, which may lead to premature movement causing blurring. I tried all the modes; macro,portrait,night,scenery,kid,sport.  All gave good results for me. Movie mode worked very well also.  I did find better results using \"program\" mode which allows setting the image quality, color saturation, & contrast as compared to the \"auto\" mode.  I use the full 7MP setting for most pics which uses more memory, but better image quality. Getting a 1 or 2 GB memory card makes this a non-issue.  I also like that it uses AA batteries.  Battery life is fair. I found that rechargable batteries last longer in this camers.  It has Image-Link capability which allows direct docking with Kodak Easy-Share printers. Also I should mention it has a 3.1 lens compared to 2.8 in some other cameras in it's class, but that's really no biggie. Sensitivity adjustable up to ISO 1600 which is great for low light situations. Manual is very user friendly. I'm happy with this camera, & I think you would be too.", "Date": "January 14, 2007"}, {"Title": "Another low-light champion!!", "Author": "Sergi", "ReviewID": "RRSA358MFR9AB", "Overall": "5.0", "Content": "You've got to try this camera to know what I'm talking about. Pictures came out clean and rich.Now, let's talk about the blurring issue. In fact there is no such problem because everybody should agree with me that you don't shake your camera immediately before/after you shoot. And even after a shot(in low-light, indoors) you need to give a time to the shutter lag to close. This shutter lag is slow but we are more concerned about picture quality than anything else.My low light pitures are like WOW! When I show them to people they think it's done in daytime. I won't talk much. My dear friend JUST GO AND BUY IT.You can't regret it. Period!", "Date": "February 1, 2007"}, {"Title": "Good, but could be better!", "Author": "Kelley Poag", "ReviewID": "R3IDEG68YYIAF7", "Overall": "3.0", "Content": "I bought this camera as a replacement for a Fujifilm FinePix 2800 2.0MP.  I noticed at first that the pictures I was taking with the M20 were not quite as sharp as I thought they should be.  I thought it was my imagination until I started comparing shots taken with both the Fuji and the M20.I took shots of the same subject matter at the same time at max resolution in Auto-mode on both cameras and I was SHOCKED at how bad the Pentax shots were when I did a side-by-side comparison.  The Fuji's broad daylight shots were rich in color where the M20's looked as if they were taken on an overcast day.  Shadows were present and easily visible on the Fuji's shot but were almost invisible with the M20.I have to say that as far as the picture taking capabilities go they don't even compare with the Fuji's.What I DO like about the camera is the gobs of features that it has.  I was floored about the video recording with audio.  You're only limited by how much add-in memory you have.The face recognition feature is really a plus too.If the camera took stills as good as my Fuji I'd give the M20 5 stars all around but it just doesn't make the cut", "Date": "November 24, 2006"}, {"Title": "Don't expect to point and shoot", "Author": "Dale E. Miller", "ReviewID": "R3CPL2L83WIJIU", "Overall": "3.0", "Content": "I got this for Xmas, and have spent the day playing with it.  I was on the verge of returning it, but I've decided to keep it.  Here's the trick... The ISO or sensitivity setting determines how sensitive the camera is to light.  A high setting is good in very low light or, I guess, if the shutter is opening and closing very quickly.  If you let the M20 decide for itself what setting to use then it will choose one that is too high.  200 is probably good for indoors, for example, but the camera will choose 400.  This results in a picture with lots of \"noise\"; dark areas will have spots of light, etc.  I think that this is what people are calling blurriness.  Choose the sensitivity manually and the pictures are fine.  Still, if the 6MP Sony is comparable in price, I'd probably lean toward it.", "Date": "December 25, 2006"}, {"Title": "So far Not so Good......", "Author": "D. Villarreal \"dvmarie\"", "ReviewID": "R6HW8ZNLGO0GU", "Overall": "3.0", "Content": "I really like this camera - it has everything I need, and it takes good pictures.  I received it in the Mail around March 5th 1007 - it went into the shop May 1st because the something is apparently wrong with the flash mechanism preventing the shutter to release in any mode that requires a flash.  The problem is too big for the local shop to fix, so they are sending the camera to the factory.  They said it will probably be weeks before I get it back.  Not a good start. I was even more disheartened to see that 4 of the 6 cameras for sale in the display at the repair shop (because people who dropped them off for repairs didn't pick them up) were Pentax digitals (but not M20's).I hope when I get it back I will have years of trouble-free use, but as of now I'm not feeling good about my purchase.I'll write an update in the future.", "Date": "May 18, 2007"}, {"Title": "Decent P&S; Camera", "Author": "CruzCat", "ReviewID": "R2KJSJXBNQRHEK", "Overall": "4.0", "Content": "I have had good experiences with pentax and currently use a k110D DSLR as my primary camera. My wife was going to hawaii on a trip and wanted a simple point and shoot camera and I got her the pentax optio M20.Its a neat little camera, not as small as the Canon S series or the Casio exilims but small enough to tuck into her purse. The camera takes regular SD cards and also 2 AA batteries (rechargables as well) which is a plus IMO. The lcd is bright and although suffers from glare in direct sunlight is useful in composing pic.  The camera menus are easy (descriptive icons and text) for her to navigate the options without reading the entire manual. My wife enjoyed taking pics withthe pentax on her trip. The picture quality is decent and on par with other P&S; from canon, sony etc.  I also considered the sony DSC W7 but got put off by having to invest in the memory stick format and also expensive proprietary batteries.Considering that the camera was around $130, i think this is a great little camera for part time / first time shooters.", "Date": "May 9, 2007"}, {"Title": "PENTAX OPTIO M20 IS AN AMAZING CAMERA", "Author": "Anne I. Spooner \"Ken Spooner\"", "ReviewID": "R2JD5QOJMOSU8V", "Overall": "5.0", "Content": "I received it just two days before a European trip . I took 575 photos there under all types of conditions and at least 400 of them rival any of postcard or better quality I have ever seen. Simple to use , the big screen was a plus and can't say I ever will miss a viewfinder again", "Date": "May 6, 2007"}, {"Title": "Great camera for the price", "Author": "TC", "ReviewID": "R2D0QQJIK22ZCR", "Overall": "5.0", "Content": "I've taken photos in a variety of scenes: outdoor and indoor, at a concert and at fairgrounds at night. The photos all turned out great. The operation is a little slow, but that is all that separates this camera from ones costing two to three times as much.", "Date": "March 30, 2007"}, {"Title": "Fabulous camera! Can't beat the price!", "Author": "Happy Camper \"Stace\"", "ReviewID": "RMDU4WH1N5IVZ", "Overall": "4.0", "Content": "As a professional photographer, I wanted a small camera that I could just keep in my purse for those little moments between shoots with my pro equipment. I replaced my Casio EX-Z60 with this camera, and am MUCH happier. The LCD is wonderful, especially the auto dim that adjusts when it is too bright to view, the size and weight is fabulous and the overal image quality is quite impressive for the price! The only problems I have are that the shutter lags and I would not recomment for \"sports\" or \"action\" shots, and it's a little slow at start up/viewing of images. Other than that, you can't get a better deal for the price!", "Date": "March 27, 2007"}, {"Title": "Blurry pictures", "Author": "C. Bahls", "ReviewID": "R2RNPKZUDTQQ7F", "Overall": "3.0", "Content": "I just bought this camera and love the size and features.  The thing I don't like is the quality of the photos.  They are blurry and out of focus.  I have tried all of the different settings and the only thing that seems to help is to always have the flash on.  My 5 year old Cannon that is a 2 MP took much clearer pictures with much less blur.  I am going to hold onto the camera through Christmas to see what I can figure out but I may have to return.  Too bad because everyhting else about the camera(including price) is great!", "Date": "December 12, 2006"}, {"Title": "all around winner", "Author": "Mrs. J.", "ReviewID": "RZEEHXSIWVDZS", "Overall": "5.0", "Content": "This is truely a wonderful camera. I can't sing its praises highly enough.I have one myself, purchased one for my mom and another for a friend.It makes taking pictures easy no matter what your experience.There is so much the camera can do I am learning new things all the time.I would recommend it to anyone.", "Date": "May 12, 2007"}, {"Title": "great camera", "Author": "B. winterdal", "ReviewID": "R30Z2NIX46N1OU", "Overall": "5.0", "Content": "I got mine a few days ago and I shot some pictures to test the camera. I've read some online reviews about blurry photos. I change some settings like the sensitive to 100, overexpose 0.3, the quality level to 3 stars. I don't use the auto pict setting. I change it to program.It's my personal choice for I want to have some control over the camera.I took picture using all the different modes and all the pictures came out perfectly. I choose this Optio because I have for years an Optio 3.2 megapixel and it is still going strong. I trust pentax with their Optio'sFor the price you can not get e better deal. The LCD monitor is very clear, the cam reacts quikly. The AA batteries are very welcome. The cam is light although I wish the body was made out of aluminium like my oldere Optio.One thing: be carefull not to block the flash, it's position is not the best one but other than that I recommend this camera a 100%", "Date": "March 25, 2007"}, {"Title": "Great buy, great value, great features", "Author": "Andrew D. Kurtzman", "ReviewID": "R18NUCJ47JG8XO", "Overall": "5.0", "Content": "After lots of research I got the Optio M20 for my first digital.  It's 7 megapixals and lots of great features, probably more than I need.  The pictures are great and the movie option is lots of fun. The only con is adjusting for the shutter lag time. A little advance preparation takes care of that.  You won't see a lot of hype for this camera, I don't know why, but you should definitely consider this camera.  Oh yeah, it's small enough to fit easily in your pocket and the 2.5 LCD is awesome.", "Date": "March 20, 2007"}, {"Title": "MEDIOCRE AT BEST", "Author": "J. H. Sandy", "ReviewID": "R1R64ZW0BZY4Y2", "Overall": "3.0", "Content": "Very average camera overall. Good to very good outdoor pictures in daylight. Fair outdoor night time pictures. Fair to average indoor pictures with flash- not sharp and crisp like outdoor daytime pics. Decent battery life. Nice compact size, although a little heavy. Average video with sound. Lots of extra features, although I question how many are really needed or useful. I think there are better 7MP cameras out there, for roughly the same price...Just not impressed overall.", "Date": "July 15, 2007"}, {"Title": "Great Experience", "Author": "Robert W. Monson \"Gamecock\"", "ReviewID": "RLQ7YRG05NMIG", "Overall": "5.0", "Content": "Great experience.  The item arrived earlier than I expected, in great condition.  This camera is exactly what I was looking for - it is compact, takes great pictures and easy to operate.", "Date": "March 28, 2007"}, {"Title": "Camera works well but very fragile", "Author": "CATO", "ReviewID": "R1221MK9SJZEEW", "Overall": "3.0", "Content": "Camera works well with photos almost as good as my film camera. However it is very fragile and the screem broke when it was bumped rendering it useless. It was less expensive to replace than to repair. I would recommend it only if it is to be used indoors due to the weak nature of its screen.", "Date": "February 4, 2013"}, {"Title": "Died as soon as warranty was over", "Author": "Richard Shannon", "ReviewID": "R26GFAMS8EBU57", "Overall": "3.0", "Content": "I had this camera for one year. The shutter button fell off while my son was getting married. No more photos for me!When I got home I looked up the warranty. It ran out about 1 day after the camera broke. So I checked out the service centers that Pentax offered for repairs. When I contacted the one nearest me, they said the flat rate to fix the camera was almost exactly the same amount as I had paid to buy it new.Next time I will buy an extended warranty, or assume that under $100 digital cameras are also in the \"disposable camera\" category.", "Date": "July 26, 2010"}, {"Title": "Pentax Optio M20 7MP Digital Camera with 3x Optical Zoom", "Author": "Anthony Coussa", "ReviewID": "R1TN561YPN01CE", "Overall": "4.0", "Content": "Excellent camera. I am giving it 4 stars only because the alkaline batteries are depleted too quickly. I am now using lithium AA's. They're supposed to last 7 times longer, it they are to be believed.", "Date": "July 30, 2007"}, {"Title": "Great Camera", "Author": "Christine Riley \"cat lady\"", "ReviewID": "R2G86UPEJZL3WD", "Overall": "5.0", "Content": "I love this camera.  The pictures turn out clear and sharp.  The camera is easy to use.  The software has great options for creativity with your pictures.", "Date": "July 4, 2007"}, {"Title": "I like the Pentax Option M20 a lot", "Author": "G. Brick", "ReviewID": "R1N8718VIDT2KM", "Overall": "4.0", "Content": "I have several other cameras, both digital and film but have been using this more than the others lately. Most photos taken are \"record\" shots nowadays and this one is easy to use, handy to keep on my belt, and batt life is really good with the penlights. I have a 2gig card and have never come close to filling it. Movie mode is fun and easy and works well with my Picasa photo program. My only complaint is that there is no eye level finder, I miss that especially since the screen is very hard to see in bright sunlight. Otherwise its really a good little camera and a super value-I paid $120 incl shipping from Ace Photo and Digital. I think the price is a bit higher now but still a good value. I researched ALL compact digitals before picking this one.", "Date": "May 12, 2007"}, {"Title": "Great camera", "Author": "H. Whitmore", "ReviewID": "R5L52O1HL5DOE", "Overall": "5.0", "Content": "This camera has turned out to be the best purchase I've made this year.Very easy to use and it takes great pictures. Even the pictures my son took on a downcast day during our most recent trip came out fantastic. For this price and the performance of this camera, you can't go wrong.", "Date": "April 11, 2007"}, {"Title": "Great camera", "Author": "Karyn L. Fischer", "ReviewID": "RRS9Y18OKQ13O", "Overall": "5.0", "Content": "We bought this camera for our 5 year old who is an enthusiast when it comes to taking pictures. It's easy for him to use because of the picture icons on the menu, it's a large LCD screen, takes great pictures, and it's great value for the money. We are using it all the time, it's compact, fits in a small camera case, and it's teaching him stewardship. He loves it and we do too. We bought this model because it had the best reviews and features for the cheapest price without going too far over $[...]. That was our goal and we are completely satisfied.", "Date": "April 5, 2007"}, {"Title": "Just what I wanted.", "Author": "Daniel L. Schorr", "ReviewID": "R1WE4CCQWKVHO9", "Overall": "5.0", "Content": "The camera is just what I wanted. A small camera, not too expensive, and takes good pictures. This camera shows the battery life and I wish my other camera did. I have had a lot of fun with the camera. There are a lot of features on the camera and they are not too hard to understand. I saw some negitive feedback so I am glad I did not listen to the negative and got the camera. I am happy it is as small as I wanted. I bought the case for it and if fits perfect in it. I wanted something small I could keep in my glovebox for the times I wish I had a camera with me.", "Date": "March 31, 2007"}, {"Title": "Great camera!", "Author": "S. L. MCGINNIS", "ReviewID": "R1O02752MIXXXP", "Overall": "5.0", "Content": "This camera was everything I was looking for, and at a great price.", "Date": "May 6, 2007"}, {"Title": "\"Exactly what I wanted!\"", "Author": "Tante Siets", "ReviewID": "R1PU231G48EWOM", "Overall": "5.0", "Content": "I bought this for my husband for Christmas. He wanted a digital camera for whilst he was hunting. He wanted a camera that fits in his hand easily, has a large viewing screen and is easy to maneuver. BINGO! This is it! Exactly what he wanted!", "Date": "January 9, 2007"}, {"Title": "Pentax Optio M20  Used and still usable", "Author": "Dale Eberhardt", "ReviewID": "R3HZ319HPP006Q", "Overall": "4.0", "Content": "This camera replaces one of the same model that I used a few years, for over 10,000 images.  I especially like the macro feature for flowers. Options for sensitivity and for pixel count are good.  Size and weight make it easy to carry in a pocket.", "Date": "May 15, 2012"}, {"Title": "worst purchase I ever made", "Author": "Anita Penn", "ReviewID": "R1DGCRH1F0XR6J", "Overall": "1.0", "Content": "I have no idea why the reviews on this camera are so good.  I have owned 3 Pentax cameras and loved them all so from the moment I got this camera I could not believe how fuzzy/blurry the pictures were and how washed out the color was.  I thought perhaps I was spoiled by my Pentax SLR camera. (I bought this camera to carry around in my purse or for international travel so that I wouldn't have to lug my big 'ol good camera around and worry about it getting stolen.)  I played with the camera's settings, read the manual and took the camera out and about to try taking pictures in various situations. (outside cloudy, outside sunny, action outdoor, low light indoor, etc.)  The pictures outdoors were slightly better but still not sharp.  I thought maybe I had gotten a dud since the reviews on-line were so good but then I found out that my mother-in-law had the same camera and the pictures were equally terrible.Of course as soon as I decided I wanted to return this camera I found out that Wall Street Photo (seller on Amazon) had a 14 day retun policy and it had been 3 weeks since I purchased the camera.Then the real trouble began.  The camera got stuck in replay mode and would not take new pictures.  It then ceased to turn on at all.  Pentax told me to send it in for repair.  Apparently the batteries (that came with the camera) had corroded and this of course voided the warranty.  The cost of repair:  $91.  Furthermore, Pentax no longer sells this camera and didn't seem to care about my plight.  They insisted that it was not a camera defect that caused the battery corrosion in 3 weeks but that dirt had somehow gotten in the compartment and it was my fault.  What a waste of money.", "Date": "November 6, 2010"}, {"Title": "Not good enough in 2010", "Author": "Vishnu Vijayaraghavan \"states of being\"", "ReviewID": "R3CWHYG3GHX2YH", "Overall": "3.0", "Content": "In the hunt for a cheap point and shoot, based on the stellar reviews in Amazon I bought the Pentax M20. After buying the camera and using it for a little while, I realized that what might have been good in 2006 is not necessarily good in 2010.The good:1. Compact2. Accepts SDHC3. Lots of different scenes and modes4. 640x480 video5. Program mode provides decent manual control over exposure6. Green button gives a idiot-proof mode (but auto/green mode doesn't produce the best pictures)7. Lost of in-camera post processing options (cropping, etc.)The bad:1. Auto mode is pretty bad, almost always I get much better pictures using the program mode2. Poor LCD resolution (makes it more difficult to compose), an optical tunnel viewfinder might have somewhat alleviated this problem3. Poor low light photos, anything above ISO 200 seems grainy4. Photos lack sharpness, almost all the pictures I took lacked sharpness and seemed a bit soft.5. Horrible auto white balance6. Image Stabilization is a sham, doesn't really workDon't bother with this camera if you want good quality pictures. Your cellphone camera might do a better job than this camera.", "Date": "March 19, 2010"}, {"Title": "Great camera", "Author": "National Capital", "ReviewID": "R3NLDV3P3T29AA", "Overall": "5.0", "Content": "I broke this camera, but it was so great to use that I had to have another one, same model, etc. The seller, Fallenleaf, was very easy to work with and get in contact with.", "Date": "April 21, 2009"}, {"Title": "Great color, easy to use", "Author": "SunnyvaleJim", "ReviewID": "R2FLZMH3OHCHAJ", "Overall": "4.0", "Content": "I have had this camera for over a year and have take about 1000photos with it.  Almost all in Auto mode.  Pictures have great colorsaturation.  Focus is good - not significant blurriness excepton horizon in some distant lanscape shots recently.  Perhaps I need to take a close look and clean my lens which I know has caused me bluriness problems in other cameras.  Good size and relatively rugged.I would definitely buy again.", "Date": "August 28, 2008"}, {"Title": "Amazing camera for the price", "Author": "P. Stein \"Bengals Fan\"", "ReviewID": "RZXBWYRLNYTWU", "Overall": "5.0", "Content": "In September, based on last year's Consumer Report recommendations, I purchased both this camera and the Canon S3 for a vacation in Japan. This Pentax was to be my back up. I always carry a second camera. Too many horror stories of ruined vacations.  I used this camera for 260 photos and 3 videos. The Canon for 30 photos.  Incredibly, other than the excellent S3 zoom feature, no quality difference between the Optio and Canon S3. I did use primarily the auto focus in both. Excellent videos, longer than the S3.  Took good low light photos in the Tsujki fish market in early dawn hours, and good outside night photos of lighted buildings in Ginza. Some red eye effect. Awesome pet photos.  You can see every strand of hair on my chow chow. This camera is very easy to use, and takes SDHC cards.  It replaces a camcorder, with excellent sound quality, and is an excellent photo camera.  Original pair of AA batteries died quickly.  Lithium replacements are outstanding.  No viewfinder makes it more difficult in sunshine. On my return, I ordered two more as Christmas gifts for my adult children.  A great gift at a silly list price.  Go figure.  Final note.  I purchased a holster pack fitted at my local camera store, to carry my camera on my belt.  Small enough to fit perfectly.  Stayed on my belt during the long flight to/from Tokyo. Hugged the seat belt. Barely knew it was there.", "Date": "November 23, 2007"}, {"Title": "Great Camera for a Great Price", "Author": "Great Camera", "ReviewID": "R156JBNCWPJWYF", "Overall": "5.0", "Content": "This is a great camera.Pros: The pictures come out very crisp. Battery life is very good with this camera. Most digital cameras burn through batteries, specially non-NHIM and non-NCAD, but this one gives over 50 pics with regular duracell batteries.Cons: The only con I have found is that if the batteries happen to die while the camera is on, the lens will not automatically retract so you have to replace the batteries to close the lens.Besides that, everything else is great. I highly recommend this camera.", "Date": "April 3, 2007"}, {"Title": "Never received camera", "Author": "John Schietroma", "ReviewID": "R1VU0CIZSUKMMV", "Overall": "1.0", "Content": "The camera was ordered through Reiger Store and returned to the store because of a wrong address on the package.  I emailed Reiger Store twice and confirmed that I had given them the proper address.  They have not gotten back to me.", "Date": "December 30, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "What's in The Box - Optio M20 / USB Cable I-USB7 / AV Cable I-AVC7(B), Strap O-ST51, Dock Insert O-DI58, Software S-SW58 (CD-ROM)\n7 Megapixel for stills up to 3072x2304 resolution or Movie mode at up to 640x480 VGA resolution\nBright 2.5 LCD Screen\nMultimode Electronic-Flash\nHigh-quality extended movie captures QuickTime motion JPEG (640 x 480) at 30fps", "Name": "Pentax Optio M20 7MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51VoUbra0vL._SX300_.jpg", "ProductID": "B000HDDKT8"}}