{"Reviews": [{"Title": "Nice camera - no rechargeable battery", "Author": "\"jeremy99\"", "ReviewID": "R3TEDT4ZSSIA9U", "Overall": "4.0", "Content": "I received my camera and immediately started taking beautiful photos.  The menu is easy to follow and I like the scene option and quality of the display. I had compared it to the Sony DSCS70 with the Carl Zeiss lens and it was about the same in price and features, but I went with Nikon for their optics and menu options thining that I would spend the same amount of money. As well, I ordered the CoolPack for \"all\" coolpix 700, 800 and 900 series cameras.  To my dismay the batteries that come with the CoolPack are not compatible with the 880 and the lens filters are not compatible either (I am assuming a step down ring is needed). I promptly returned it. I ordered a 64MB compact flash card for about $100.  I took about 40 nice photos and kabam - the lithium ion batter was drained (it comes with a disposable battery).  Each battery costs $12-13.  Since I intend on taking many photos, I have opted to spend the extra $120 and order the re-chargeable battery, charger and small case.  This is a hefty add on fee for what all the other digital camera's of the same price range come with standardly.  The autofocus makes a rather loud noise. At first I was worried since it does not sound like it is a smooth moving part inside (lots of friction sounds), but I called tech support and was told this is normal for the camera to make these sounds.  The lady at Nikon was professional and courteous, and hopefully correct in her information!  All in all, I expect to take lots beautiful pictures very easily, but if you are not willing to invest about $1100 including the camera and accessories, then this may not be the camera for you.  If the camera had come with the battery, charger and protective cover/case I would have given this a 5 star review.", "Date": "October 23, 2000"}, {"Title": "This camera does it all!", "Author": "\"msdavin\"", "ReviewID": "R1Q2XQF8M3SVU3", "Overall": "5.0", "Content": "For the price of the Nikon 880, you are making a major commitment to digital photography.  The good news is the 880 delivers on all of its promises with few compromises. Incredible \"ease of use\" enables both novices and veterans to create great digital photos.  Image quality is outstanding and the features will keep have you experimenting for many a late night. I admit it, I am in love with this camera!Another advantage you should not underestimate: the compact size and light weight of the 880.  My \"other camera\" is a N70, but size is an issue as I like to travel light.  The 880 always makes the road trip, either in the jacket pocket or briefcase.  Several issues to consider:  The 880 drains disposable batteries faster than any electronic gadget I've ever owned, so unless you have friends who work for Duracell you'll need to spring for the optional rechargeable battery and charger.  Plan to spend another $100 or so for both.  The camera comes with only an 8mb card so you may want to upgrade to 16 or 32mb. The software bundle is light, it will allow you to upload pictures but not much else.  Consider Adobe Photoshop LE or JASC Paint Shop to complete your setup.", "Date": "November 11, 2000"}, {"Title": "Beware of advertised accessories", "Author": "\"ke6dcj\"", "ReviewID": "R1AITE7JILR83L", "Overall": "3.0", "Content": "I love the features of this camera, however, Nikon has to do something about the poor & misleading advertising going around regarding accessories that actually works with this camera.The CoolPix 880 CANNOT use Nikon's flash adapter (SK-E900), and an external flash cannot be synched because there is no flash synch connection.  An internet search of \"Coolpix 880\" and \"flash\" revealed over 15-sites that advertised you can use the SK-E900 flash adapter with the CoolPix 880.  Moreover, you CANNOT use *any* of Nikon's external lenses with the flash \"ON\" because the external lenses' physical dimensions blocks the flash and causes a half-circle shadow.  A quick call to Nikon's 7x24 tech. support confirmed this.  You MUST turn-off the \"flash\" in order to avoid any shadows.Nikon and its dealers need to do a better job disclosing the above limitations of the Coolpix 880.Lastly, you MUST get the rechargeable battery & charger to effectively use this camera.  Buying batteries gets old fast, and you really need two, just to be safe.Otherwise, it is a great camera when you don't want to use external accessories.", "Date": "December 10, 2000"}, {"Title": "Digital is finally good enough.", "Author": "Joel Horn", "ReviewID": "R24PZ417LZD546", "Overall": "5.0", "Content": "I have waited over a year to finally buy a digital camera for myself. We use them at work and I have tried several others. Up to now, the image quality has been OK but not something I want to use for family photos...albums, frames, etc. The Nikon 880 takes a major step in quality. I am not technically capable of describing it, I just know that the results are great. I can now use my digital camera instead of my film-based camera and get the same results for 8x10 and smaller and get all the advantages of digital. the biggest advantage is knowing for sure that I have the shot I want before I go home and find out I missed it. If I don't have it, I can retake it immediately. Its great.", "Date": "October 17, 2000"}, {"Title": "Compact, versatile camera!", "Author": "Linda Y.", "ReviewID": "R2NABISVQ52S2F", "Overall": "4.0", "Content": "Being a photo enthusiast, I didn't want to get a digital camera at first, but since I'm also a long-time web user, the process of shooting a whole roll of film, waiting to get my film developed, picking up the photos, scanning them into my computer, and resizing the images were a bit time-consuming.  I wanted a camera that was compact, took good photos and easy to adjust the settings, and I'd say that the Nikon CoolPix 880 comes pretty close.  After using a manual camera for years, this took a little getting used to.  There are many features on this camera, including pre-set \"scenes\" that adjust light/color/speed for those who just want to point-and-shoot and not worry about the settings - I took this camera on a trip to Mammoth Mountains and took GREAT photos in the snow (There's a scene for \"snow/beach\").  Also, I used the \"Indoor/Party\" scene and the photos came out GREAT.  Another great thing about this camera is its size.  Unlike most digital cameras out there, it fits in the palm of your hand and feels very natural to hold while taking pictures.  The pictures are sharp with great detail and vibrant colors.My favorite thing about digital photography is INSTANT GRATIFICATION!  No more wasting rolls of film - you see what a photo looks like right after you take it, and if you don't like it, hit delete!  No more waiting at the photolab, and best of all, total customization!  The USB lets you download the photos in a flash, and with my trusty photo software, I can adjust colors, change brightness and contrast, and even air-brush out an imperfection or two ;-) and you don't need a fancy color printer to print out great photos - I've been using my Epson printer and using glossy photo paper - output looks terrific.  You can hardly tell that it was produced at home.Now the cons: The CoolPix 880 comes with a 8MG compact flash card, if you are taking photos for only web use, you can fit as much as 90 pics.  If you're going to take higher-rez pictures for printing, you'll definitely need to shell out for a bigger card.  Another common problem with many cameras is battery life - they eat batteries like crazy.  For the planet's sake, don't buy disposable batteries!  Unfortunately, the CoolPix does not come with a battery charger, so you'll have to pay [more] for the charger.  With normal use, the battery will last about 2 hours, so you'll need to buy another battery and have it charged and ready to go.This camera is perfect for those who want to invest a little more for a digital camera that takes great pictures with no fuss.  Highly recommended!", "Date": "November 28, 2000"}, {"Title": "Nikon 880 Great camera - Bad battery choice by Nikon", "Author": "Mickey Jones", "ReviewID": "RM1ZZF5WRML6B", "Overall": "4.0", "Content": "I have previously owned a Nikon 800 and looked forward to the update with the 880. The camera is very impressive in terms of quality of photos and they hay have improved the ease in which you can functionally use the camera features from the 800. There are a number of features such as the preset scenes that are great to assist in certain situations. I bought it based on the previous experience with Nikon, but their decision to use a special camera battery instead of common AA alkaline, lithium or rechargeable batteries has left me with an expensive choice of options. I take a lot of pictures and the battery life in this particular camera is very short, so I can either use the rechargable batteries (which can be a problem in traveling), purchase a number of expensive photo style batteries or another third party battery supply pack (cumbersome). That type of battery cannot usually be found in rural areas that I travel. The other problem is that the base for a tripod does not have a provision for the alignment hole that some tripods have on the mounting plate. I still like the compactflash memory card and I have purchased a higher capacity card for this and other applications I have owned a number of digital cameras over the last five years for both work and personal activities and this is probably the best features for the price and size of camera. I have found that I am looking to other alternative for the future that may or may not include this particular camera. While I would highly recommend this camera for it's usefulness and features, I would be very apprehensive and cognizant of the battery issue.  Also, if I could find a suitable e-mail address for customer service at NikonUSA, I would probably let them know of this issue.", "Date": "October 30, 2000"}, {"Title": "We're almost there", "Author": "Larry H. Phipps \"Buzzwriter\"", "ReviewID": "R1DANVAGKBJ8NP", "Overall": "4.0", "Content": "As a lifelong technology heat seeker, I'm going against type when it comes to digital cameras. It's just for that kind of money, I want all the kinks out. I couldn't wait to pick it up when I was at the camera store. Feels good in the hand, has the great Nikon optics, takes additional lenses and filters, the controls are easy to handle and the 3.3 megapixel resolution does a superb job. So, what's not to like? First, in this class camera I want to have some more creative lighting options -- so it needs the ability to attach/synch a remote strobe. Then, the battery life is suspect -- and could really get expensive in a hurry. While you can pick up AA batteries anywhere, this camera takes batteries that not everyone carries in case your rechargable battery expires on a big photo day (and what's with the $100 option for a rechargable battery when the regular batteries cost $20 a pop? When you figure in options like the batteries and a bigger-than-8 meg-storage card, the price jumps to $1,000 or higher). Finally, I want to be able to take pictures of my non-stop grandchildren in full motion. Two clerks at the camera store spent 20 minutes trying to capture shots of people walking by the storefront in the mall. No luck. Either it's too hard to figure out or still doesn't can't respond quickly enough to get the pictures in mall-bright conditions. So, I'll continue to buck my lifelong early-adopter pattern and hold out for the camera to give me a wee bit more of what I'm looking for before plunking down close to a thousand bucks.", "Date": "October 19, 2000"}, {"Title": "Perfect", "Author": "Scott S. Jeffery \"Dr. Scott\"", "ReviewID": "R21Y8WYZTRTQGJ", "Overall": "5.0", "Content": "My wife and I just moved to texas and have family all over the country, and with our first baby on the way I decided to take the digital plunge. This camera is a gem. I've spent the last 9 months reading every review possible, looking for the right digital camera. I tossed around buying the olympus 2020/3000, the sony s70,The nikon coolpix 950 and the kodak 4800/dc290. Two months ago the 880 hit the market and I couldn't resist. I can't put it down. Figure the ac-adaptor and rechargeable battery into the price (shop around) I got them online for($) no tax and free shipping. The 8 meg card will hold 90 pictures at 640x480, 20 pix @ 1024x768 and about 6 pictures at it's highest resoultion (that's if you use compression). Believe it or not I take most pictures at 640x480 so that I can e-mail them to family. The menus are great. The scene modes are better. The picture quality is Phenomenal! My wife and I just looked at some old shots we took a year ago on a loaner sony mavica, and all I could do is shake my head. There is no comparison. The color and clarity of the 880 is breathtaking. do some more reading... [...] Worth every penny!", "Date": "October 29, 2000"}, {"Title": "great but not perfect", "Author": "James W. Blankinship \"TV Teacher\"", "ReviewID": "R3MXW23WRWDKQV", "Overall": "5.0", "Content": "I'm a professional video news photographer, but wanted something simple for stills for my family use. The coolpix 880 was recomended by a friend who is into still photography.  The pictures are shockingly sharp and vivid, even on the standard resolution setting.  I print up these four at a time on an eight by ten sheet with an old HP 722 and photo paper, and the 4x5s are as good as 35 milimeter film.  If I increased the resolution I'm sure 8x10 enlargements would look sharp. The camera is easy to connect to the computer by a USB port, and downloading, and selecting the pictures for printing is simple. The downside is that on automatic, almost all the pictures appear slightly under exposed, and need minor brightness manipulation, which I have yet to figure out how to do.  Also, there is about a one second lag betweeen the time you push the shutter button and the time the picture is actually taken, which I'm still not used to.  The camera is almost useless without more memory and the rechargeable battery which all cost me about two hundred dollars extra.  This is my first digital camera, and while I've had to get used to all the differences from film, the bottom line is a sharp, clear, detailed picture, and this pocket camera delivers more where it counts the most.", "Date": "January 8, 2001"}, {"Title": "read this before you buy", "Author": "SL", "ReviewID": "R1WKMGQBS2HXWN", "Overall": "5.0", "Content": "The most important element for me is the quality of the pictures. In that regard, the Nikon 880 does an outstanding job compared to past digital cameras. Sharpness, brightness, etc. are all pretty good.  At the Fine Quality/Full Image mode, I can squeeze 81 pictures onto a 128MB Compact Flash card - perfect for a full day's use. I also bought the rechargeable battery, which is an absolute must given that digital cameras eat-up batteries. I like the fact that the camera can also fit a CR5 battery, which is readily available in most shops. That way, if I run out of juice half way during the day, I can always just walk into almost any photo shop and buy an extra battery (some of my older models did not support this simple option). Nikon has preset scene modes that are great to use. I like the fact that I can easily switch to a landscape or indoor mode with a few clicks. The menus are also very well laid out and quite intuitively easy to use. I was a little distraught though when I went to install the software and the computer refused to recognize the USB connection. Then I realized that I had to download the USB drivers from the Nikon website in order for the USB connection to be recognized (the software included is for the \"serial\" connection and the updated software has to be downloaded). This was extra burden I would rather have avoided, but maybe this was a problem only for the early Nikon 880 shipments. I cannot sing enough praise for such a detailed, yet easy to use camera. It can be as simple or as complicated as you want it to be, and that perhaps is its biggest selling point. One irritating point is the \"noise\" the camera makes as it tries to focus. The Nikon 880 makes a lot of \"whizzing\" sounds as it focuses -- a bit too conspicuous in quiet environments. In the end, the Nikon 880 is simply an outstanding digital camera that should last me at least two more generations of digital photography. The only thing that bugged me was that I had to dish out extra money for the rechargeable battery, which in my opinion should have been included. Nevertheless, this is the new ESSENTIAL product for digital photography.-DC", "Date": "March 26, 2001"}, {"Title": "Highly recommend Nikon Coolpix 880", "Author": "\"jguevara@cybear.com\"", "ReviewID": "RT4HHOQ1D0W3W", "Overall": "4.0", "Content": "I have been looking for another digital camera since my first camera (minolta dimage 1500 zoom)was a total disappointment. For the past six weeks I've researched the Internet (Steve's Review, DPReview, Imaging Resources, etc) comparing, as my final choices the Canon Powershot 20, the Fujifilm 4700 and the Coolpix 880. My main criteria are 3 megapixel and being able to take it along wherever I go in my pocket. After reading all the reviews I decided to go for the Coolpix especially considering the ability to do some manual adjustments with the camera, although I consider myself a novice/amateur. I got my camera from Amazon.com four days after I ordered it. I got my rechargeable battery and charger at another internet site where it was cheaper. After playing with the different controls of the camera I was able to even use the manual control and was very impressed with the pictures. I was not impressed with the \"Scene\" mode at all. I prefer the CSM, P and A mode which was very easy to use and get perfect results. The \"Auto\" mode also works very well. The quality of the pictures and the ease of control is almost like night and day in comparison to my prior digital camera. For anyone considering a 3 megapixel digital camera I would recommend this, with the reminder to also get the rechargeable batteries at the same time. The battery that came with the camera did not last long. It lasted only long enough to enable me to study the different functions of the camera and was able to take only a few pictures with the original battery. I would have rated this camera as 5 stars if not for the limited aperture control of only two.", "Date": "December 20, 2000"}, {"Title": "Great camera!", "Author": null, "ReviewID": "R1S9TB4FL0XP12", "Overall": "5.0", "Content": "Here are some of the pros: 1. Excellent picture quality and colors, even indoors and under fluorescent lights.  2. 2.5x zoom.  3. compact size.  4. presets (\"scene\") mode good for amateurs. And cons... 1. You must (emphasis here) purchase rechargeable batteries separately...2. 8MB CF is small, very small.  3. slight red eye problem (and there is no flash socket).  4. Don't even bother installing the bundled software. It's not worth it. However the basic Nikon View and usb drivers work great and make transfering the pictures a snap.", "Date": "October 24, 2000"}, {"Title": "Wonderful camera!", "Author": null, "ReviewID": "RT5A0L814QK4C", "Overall": "5.0", "Content": "I've been using a Nikon 880 for over 6 months and have the greatest admiration for its abilities. It is a wonderful pocket-sized camera. It is designed to be easy to use and powerful for its size. I seldom miss a shot! The photos are super sharp; the color is amazing; and it's fast, compared to other digital cameras. I purchased the rechargeable battery and charger/adapter when I bought the camera. I also upgraded to a 128 MB Compact Flash disk. I find Adobe's PhotoDeluxe 4.0 a useful photo enhancement program. Nikon has maintained its premier position in the camera world with this consumer-oriented camera.", "Date": "May 23, 2001"}, {"Title": "Excellent Compact Digital Camera", "Author": null, "ReviewID": "RLRM262E53GHI", "Overall": "5.0", "Content": "I have been waiting years for an affordable digital camera that could produce satisfactory prints and am more than satisfied with this product.  The image quality is superb and the camera is a joy to use.  The layout is clean, functional and easy to learn.  The one button review feature is extremely helpful in making quick decisions on keeping a photo.  I shoot a lot from the water and the compact size and light weight make it ideal for traveling.  Nikon has a real winner here.", "Date": "October 20, 2000"}, {"Title": "wonderful--but hellish install for Win ME users!!!", "Author": "Robert Nagle \"idiotprogrammer (idiotprogramme...", "ReviewID": "R1DF3J1DZNDDID", "Overall": "4.0", "Content": "I have only had my camera for a month, so regard these as first impressions. The camera is quite intuitive and good in usability (and I should know because I work as a usability engineer!), with enough controls and default features to satisfy anybody. I had an absolutely hellish time installing it with usb on Windows ME. I have since learned that Win ME and USB devices like this one are a major pain in the neck!!! I spent a lot of time with technical support troubleshooting this device. Hours!! But once it was installed, everything was okay. The package came with Adobe Photo Deluxe, which I'm ashamed to confess to loving (it handles a lot of stuff I used to do with Photoshop) The good thing is that their technical support is open 24 hours a day 7 days a week, a really remarkable thing!!!I bought a 96 MB card, which carries about 60-70 pictures at fine. I found the default settings (night, fireworks, landscape) to not work particularly well, but this may be my inexperience showing. This camera really drains memory, and apparently it seems that the LED display must be on for the camera to take pictures. One problem I noticed is that the auto-shutoff feature doesn't work particularly well, and you have to always be on top of that. (sometimes I have to actually remove the batteries to turn it off). The battery charge display is somewhat misleading. A lot of time when it powers up it will show full power, but a minute later, that indicator will indicate only a quarter charge. I'm not a pro, but I had so much fun taking pictures and playing around with the settings.", "Date": "February 7, 2001"}, {"Title": "A good camera with some concerns to be aware of", "Author": "J. Wan \"wanchob\"", "ReviewID": "R2S8OUD8EEQZQ0", "Overall": "4.0", "Content": "The 880 is a compact digital camera which produces excellent images. It does have its good and bad points:Good points:1. Nice body - resembles a standard camera - viewfinder is useful  except for macro when you have to use the LCD to aim. It grips and feels like a standard camera, which makes framing and squaring up an image easier for those trained on old film cameras.2. Easy to use - despite some claims, the instructions are clear, and for the most the settings seem intuitive. It is easy to move between the various preset exposure-speed settings. These are preferrable over the generic \"auto\" setting. The base \"auto\" mode makes too many compromises, and results in images which are just \"off\".Bad points:1. Missing some stuff. It comes with a small memory card, and without a rechargeable battery. Like nearly all digitals the Nikon inhales battery power. You MUST get a rechargeable battery, and a larger capacity Compact Flash memory card. Luckily the price seems to be falling on these. You should also get a card reader for your PC. Hooking up the camera to the PC is possible, but a card reader is far more convenient. No software included.2. The lens cap must be removed manually, and if you forget to do so, you'll get very angry and worrisome sounding whirling and grinding noises. Most basic point and shoot and APS cameras have a warning mechanism to prevent the recessed lens from deploying while the lens cap is on. The on/off switch is convenient, but at times too much so. It can be jostled and you'll reach into your bag to discover it in the \"on\" position with the battery sapped. A firmer switch with a \"snap\" would be an improvement. 3. It is a bit pricey - I think that it would sell quite well, were it [...] cheaper...Still it is a nice camera with good technicial features, and capable of producing beautiful images.", "Date": "October 14, 2001"}, {"Title": "Excellent camera - I'd buy it again!", "Author": "Greg Kieliszek", "ReviewID": "R22KG9CT5Q7EBS", "Overall": "4.0", "Content": "Most reviewers have praised the camera and complained about the small memory card and the need to buy the optional rechargeable battery. These comments are right on the mark. Based on this information, I bought the charger and rechargeable battery and ordered the camera with a 64MB Lexar memory card. I used the disposable battery first and got about two hours of use. The rechargeable battery also lasts about two hours and can be recharged in about one hour. My 64MB Lexar is backordered, so I'm using the standard 8MB memory card. It holds 9 compressed images. Needless to say, I'm looking forward to the 64MB upgrade. Nikon really needs to consider making these upgrades standard. I had one initial problem getting the camera to download to my USB port. I ended up checking the Nikon website and discovered that there is a patch available for Windows ME users. Once I downloaded and installed the patch, downloads are rock solid. On the very positive side, image quality is fantastic and the macro feature works great.", "Date": "January 2, 2001"}, {"Title": "A VERY Cool Camera!", "Author": "Cliff Bauer \"Cliff\"", "ReviewID": "REUJSWCDVLQBB", "Overall": "5.0", "Content": "Three main features of the CoolPix 880 make the camera my favorite of the four I have used extensively.First, the camera is very small! It is no larger than your typical advantix film camera, and is light enough so as not to be a burden in a purse, bag, or even large pocket. As a result of its small size, I find myself taking it most everywhere I go and getting some great shots!Second, the quality is incredible. Though this camera, like all other digital cameras, does not perform particularly well under low-light conditions, the resolution and clarity of the images is incredible if you give the camera a decent amount of light! Edges are crisp, colors brilliant, and details clear.Third, the camera has a variety of helpful but EASY TO USE features. This is important. Unlike the Canon G1, using the more advanced features (such as Snow and Beach mode, Portrait Mode, etc.) is as easy as turning a dial and selecting which mode you want. Really! No fussing with multiple menus and dials. Setting up the date and time, resolution, quality, etc. is also very easy and quick.The only shortcoming of the 880 is that it is by no means a complete camera out of the box. I had to spend quite a bit of money to get a suitable memory card and a rechargeable battery. It's a small pain, but for a camera as cool as this Nikon is, I can live with it.A great buy.", "Date": "March 21, 2001"}, {"Title": "Purchased via Amazon...still happy", "Author": "\"kaiyadog\"", "ReviewID": "RSDXFPX44UYZW", "Overall": "5.0", "Content": "Taking a researched chance, I ordered this product through Amazon reading others' and the editorial review.  Technically it appeared similar to the Canon S20 (competition at the time), but reviews made the difference.Five Stars from me.  Seven months now...still amazing me.Deciding factors: -Technical adjustability -Metering system -Video mode (it's debatable whether I miss audio) -CF slot (compat with my other device and easy PC-Card adapter) -3M pixel -2CR5 battery (can purchase anywhere and same as my 35mm SLR) -Size, size, sizeStill happy with: -Finite control -CF memory -Size -Durability -Easy white-balance calibration (when auto won't do) -Image quality!Also purchased: -Lithium battery and recharger (a must!) -Slide adapter (not heavily used) -64MB CF (probably will go for 128MB and shoot with abandon) -Nikon's Case (works and fits, but I wish had shoulder strap)Aloha.  .d.", "Date": "July 25, 2001"}, {"Title": "Great camera -- a few reservations, however.", "Author": "James F. Hermon", "ReviewID": "RELXCJGI9FSQG", "Overall": "4.0", "Content": "I purchased a Coolpix 880 two weeks ago and have been incredibly impressed with the pictures I'm able to take with it.  They truly rival 35mm shots in quality, especially when combined with a good photo printer.  However, there are a few reservatins I have, mostly the result of the transition to digital photography.First, the battery.  You must buy the rechargeable, and even that won't last too long.  I'm thinking of buying a second rechargeable for use on vacations, long family outings, etc.  I can't imagine trying to keep up with this thing's voracious appetite for batteries any other way.  YOu can minimize drain by shutting down the LCD or turning off full time autofocus, but that seems to destroy some of the reasons I bought the thing to begin with.Second, the \"lag.\"  I put it in quotes, because I think it is mostly a matter of getting used to it.  You push the button the instant you want the picture taken (for example, a one year old coming down a slide); the camera takes it around that time.  Maybe at the top, maybe at the bottom, maybe right when you thought it would happen.  Tricky.  Thankfully, one year olds are happy to go down slides repeatedly (by which I mean all day).  Even in the 2 weeks I have had the camera I have adapted, however, and this is no longer a problem.On the whole, an excellent camera that will become better once I figure out exactly how to use it.", "Date": "March 19, 2001"}, {"Title": "Nikon CoolPix 880 - Good, but...", "Author": "Michael L. Shanks \"MikeLee777\"", "ReviewID": "RKP87FUKTOBZR", "Overall": "4.0", "Content": "My 1st digital, so maybe I'm somewhat biased, got a great deal (less then $500) on camera, battery, and charger was display unit, local Bxxx Bxx had close out on this model for some reason.The good:  GREAT detail, 3.4 meg is fantastic, have had 8 x 10's made, very comparable to 35mm.Easy to use in AUTO Mode Easy to use in SCENE ModeThe Bad:One irritating point is the \"noise\" the camera makes as it tries to focus. The Nikon 880 makes a lot of \"whizzing\" sounds as it focuses -- a bit too conspicuous in quiet environments. MUST have rechager and rechargeable batteriesNo photo editing s/w included.If you get beyond point and shoot, it is VERY complicated!Bottom Line: I REALLY like this camera it takes incredible pictures.", "Date": "July 19, 2001"}, {"Title": "Incedible camera! Does it all!", "Author": "ira_nyc", "ReviewID": "R1VO25NH0MEL7C", "Overall": "5.0", "Content": "I looked at the Coolpix 800 and 880, before deciding on the 880.  It is more expensive than the 800, but WELL worth it you'll see. Here's why:Megapixels. The Coolpix 800 takes 2.1 megapixel pictures, but the 880 take 3.1 megapixel.  (More pixels are preferred to less since this will affect your image quality. And believe me - you will SEE the difference!)Zoom. The 800 has a 2x optical, plus 2.5 digital zoom lens; however, the 880 has a 2.5x optical and the digital zoom.  You always want as high an optical zoom because using pure digital zoom will make your pictures look fuzzy!Memory. Both the 800 and 880 come with 8 MB of CompactFlash, but most people would agree that this isn't enough.  Purchase an additional CompactFLash card for 32 MB or more and you'll be happy you did.Downloading. The 800 only connects via serial port, but the 880 connects via serial OR USB. THe USB connection is MUCH MUCH faster for downloading pics to yoru computer, but the serial (800's only method) is horrendously slow.Batteries.  THe 800 uses 4 AA batteries, but the 880 uses far superior and much longer-lasting 2CR5 lithium batteries. The 880's batteries also weigh less.Price. This is the ONLY reason you shoudl consider the 800 (...) over the 880 (...).  But let's face it, if you have ... for the 800, you should fork over the extra ... and get the 880 so you can have a digital camera that will last you more than a year. The 800 is being phased out by Nikon. Buy the 880 today! It's simply amazing :)", "Date": "April 14, 2001"}, {"Title": "Great Camera", "Author": null, "ReviewID": "RC07W47RJX59W", "Overall": "5.0", "Content": "My wife gave this camera for Christmas and I've had great fun with it.  My only advice would be to figure in the price of the re-chargeable battery and charger as a \"standard accessory\".  I will never give up my SLR 35mm film camera, but this just adds to the enjoyment of photography.", "Date": "January 3, 2001"}, {"Title": "Disappointed!", "Author": null, "ReviewID": "R2PUO4536C6Q5J", "Overall": "2.0", "Content": "I bought this camera because I believed that the Nikon name insured that I would get a quality camera.  I have owned a Kodak 1 megapixel camera, and have used it for over a year with excellent results.  The Nikon, however, took a lot of tweaking to get average pictures.  I took the camera in to a local camera shop, and tried it side by side versus some of the other 3 megapixel cameras (Canon, Olympus).  The results were pretty shocking.  All cameras were set to their highest resolution and set to \"Auto,\" and the pictures were taken by camera professionals.  They were disappointed in what they were selling. The biggest disappointment I have is that the reviews I found on-line (dpreview.com, et al.) were very favorable towards this camera. If you are looking at a 3 megapixel camera, find a store that will let you try out several cameras FIRST, then buy.", "Date": "January 2, 2001"}, {"Title": "Not as good as a Canon...", "Author": "JonathanH", "ReviewID": "R1I6WDCKXOSCOW", "Overall": "2.0", "Content": "I replaced a Canon Powershot S20 with the Coolpix.  Even though I've only taken a few pictures (maybe 25) it clearly doesn't produce the same image quality with comparable file sizes.In normal mode (~700K JPGs) the Canon produced very sharp and balanced images.  In comparison, the Nikon's pictures are blurry and look like they came from a digital camera.  I tried higher quality modes (e.g. fine & high) with mediocre results.Overall I am not satisfied with the purchase and switch.  The nicest feature of the Coolpix over the S20 is that you can attach various lenses to customize shooting.  Lastly, comparing the two bodies (the Canon is metallic while the Nikon is plastic) leaves me feeling like I have a cheaper solution in my hand.", "Date": "December 31, 2000"}, {"Title": "Becarefull", "Author": null, "ReviewID": "RLUCHMC7ELOEX", "Overall": "1.0", "Content": "I just recently bought a Nikon Cool Pix 880 From Best Buy. I had nothing but trouble. The lense was locking up and causing system errors. The lcd screen was on an angle. I called Nikon and they said this was a problem. They said my batteries were no good and that i would have to wait for a system update for the camera. So 6 batteries latter I still had the same problem. Please becarefull when buying this one. However I did return this Camera for an Olympus 3040 all i can say is Incredible Pictures Wow..", "Date": "March 24, 2001"}, {"Title": "Great camera - but missing a bit", "Author": "Amazon Customer \"ttstocks\"", "ReviewID": "RL7F724AED3NA", "Overall": "4.0", "Content": "It is a great camera - it takes excellant pictures, uses the almost ubiquitous CompactFlash media, and has a wealth of settings and options.The minuses:  It doesn't come with a battery charger/ac adapter (you'll have to buy that separately), and it uses annoying batteries. (come on - 'AA' sized batteries can't be that hard to design for)  These cameras eat batteries quickly enough that you really won't want to pay for the expensive alkalines or lithium ions.", "Date": "October 22, 2001"}, {"Title": "It's the extras that are costly...", "Author": "360GUY \"360GUY\"", "ReviewID": "RIHJ8YP1QM3KJ", "Overall": "4.0", "Content": "I am happy with the Nikon 880, however, I also purchased the battery charger, rechargeable batteries, 128 meg compact flash card, flash card reader, Adobe Photoshop Elements software, stepdown ring adapter for lens filters, slide copy adapter, photo glossy paper and textbook.  I would also like to buy the Epson Stlus Photo 1280 printer, but that is for the future.", "Date": "December 6, 2001"}, {"Title": "A unhappy customer", "Author": null, "ReviewID": "R3QSRCMCZ87IGS", "Overall": "3.0", "Content": "Overall this camera is OK. However, the price is not cheap at all, especially you have to spend another $120 to get rechargeable battery and charger. I would rather get Olympus digital camera with high quality, nice features and lower cost.", "Date": "August 8, 2001"}, {"Title": "Watch out for that tiny flash", "Author": "Paul Cheang", "ReviewID": "R4GLRA3KHN6Z3", "Overall": "4.0", "Content": "I cannot say that this camera is bad but for the one year that I owned it, I keep wishing that I can attached a bigger and brighter flash for the indoor group shots.  It does everything exceptionally well outdoor however, the indoor group shots is off the mark for insufficient flash... the pictures of group shot look dark and a bit out of focus on the outer edge.  The lack of hot shoe and the lack of external flash terminal make indoor photographers, like myself, aching for more...If you never have to do indoor photo of more than two or three persons in a groupd then it is a camera for you.If you are serious, check out Canon G2 or Nikon 5000. Both has all you ever wanted in a digital camera.", "Date": "December 10, 2001"}, {"Title": "Excellent Camera", "Author": "Philip Schlump", "ReviewID": "R24ZBNNS3NEHDK", "Overall": "4.0", "Content": "I borrowed this camera from a friend to take with me on vacation when my film camera broke.  The camera performed flawlessly and I have printed out a number of absolutely spectacular photos from it.  Very Impressed!", "Date": "October 6, 2000"}, {"Title": "Digital photography is fascinating", "Author": "Ray Sullivan", "ReviewID": "RUT8G4RJJ4UAQ", "Overall": "4.0", "Content": "Having used this CP880 for about 2+ yrs, I've still on the learning curve and have only scratched the surface . Although most shots are quite good with the Auto sequence, it's nice to have flexibility with manual settings. Be prepared to buy the extras to make your digicam experience practical: 2 re-chargeable Li-ion batteries and the charger; upgrade to a 64 or better yet a 128 MB CF card with card reader (supplied with my Lexar 64 MB CF card. USB connectivity reader greatly expedites transfer of files to PC); optional digital wallet (Minds@work 3 GB portable HD for travel and downloading on the road); belt case (to keep the CP close by for those \"once in a lifetime shots\"). I'm familiar with many controls but the manual is a bit cumbersome. I'm now reviewing \"Nikon Coolpix 880 Photography by Dan Curtin...to pick up more nuances. The CP4300 may be a more current version and deserves consideration. All in all, a great camera. My 1200 shots taken in Oregon,Washington,Vancouver, and Victoria were burned to CD's with relative ease thanks to my CP880 and peripherals. Some of my Butchart Gardens shots were spectacularly polarized courtesy of a hand-held 52 mm polarizing lense from my old 35 mm Nikorrmat!!", "Date": "December 6, 2002"}, {"Title": "Buy the Kodak 4800 or the G1  instead of the 880", "Author": "K. Thiele", "ReviewID": "R15CKFCVQ1SSBO", "Overall": "2.0", "Content": "I am amazed by the number of positives reviews for the 880 ... and can conclude 2 things:  either these folks have little prior experience w/ digital cameras, or my camera is broken.  And although my camera is sorely in need of a firmware update, I do believe it is operating as designed.The good points first ... in good lighting conditions, and when all of the camera's parameters are appropriately set ... this camera has the raw ability to take exceptional pictures.  The lens is quite good (for a digi-cam), and the resolution provided by the 3.4 M-pix CCD is fantastic.  However, such fantastic pictures are rarely obtained.The bad points ...  1) The camera is incapable of automatically setting its own parameters (focus, aperture, speed, etc.) on its own.  Its \"auto\" and \"Scene\" modes stink.  The worst is auto-focus.  Even in bright outdoor pictures, this camera almost always produces focus errors.  So far, I can always guess the distance to the subject and manually set the focus better then the camera can.  And believe me, setting the time on a VCR is a lot easier than setting the focus distance on a Nikon 880.2) Indoor pictures are awful.  With less light, the focus errors increase.  Even more importantly, the \"grain\" is awful (like using an ISO 1600 film).  The \"auto\" modes set the ISO to 400 (max), where grain is the worse.  When I override this (ISO=100), I can reduce the grain, but the dumb camera doesn't compensate for the change in film speed, so I end up with very dark pictures.  Finally, all of my indoor pictures have the white balance heavily skewed toward red/yellow.  The amount I have to \"push\" my pictures with the computer afterwards is tremendous.3) The User Interface ... this is a non-trivial device to master. I probably have invested over 20 hours of experimenting to try to master this camera.  One can just use the \"Auto\" modes, but then one is stuck w/ very mediocre to poor pictures (worse than my old 1-Mpix cameras).  And if one was to use their famous \"Scene\" mode, it takes almost 20 seconds before you are ready to take the picture (10 seconds to power up, 10 seconds to navigate/select the Scene menus). And the manual overrides are very difficult to master.  For example, to set the ISO, one holds down one of 4 buttons while moving the zoom in/out.4) Lots of other annoyances, which make this camera frustrating to use everytime I pick it up.  In a typical social situation (trying to capture the memories), perhaps only 20% of my pictures, w/ the Nikon 880, are keepers.  With my older Olympus D600 (1 M-pix), I would get 80% good pictures in similar situations.I bought the Nikon 880 through the internet, so I don't have the option of returning it.  Why did I buy it ...  I thought it was the best bang for the buck.  Note: when comparison shopping for price, always always add an additional $150 to the base price of the 880 to account for the charger, the rechargeable battery, and a larger flash card.  This camera will eat a $12 disposable CR5 battery in under an hour.  If I had to do it again, I would have bought the G1.  This assessment is based upon playing w/ a friends camera,  and based upon my personal bias toward performance.  My 2nd choice might have been the Kodak 4800 (no 1st hand experience, but my sense is that this is a fairly easy-to-use point-and-shoot that would produce good pictures using their auto modes).Hope this review helps.  Since I am stuck w/ the 880, I will be publishing my preferred settings for this camera on some of the news groups in the near future.", "Date": "May 13, 2001"}, {"Title": "one year old 880", "Author": null, "ReviewID": "R31RH7U4OSVNXW", "Overall": "5.0", "Content": "I have had this camera one year and am still impressed with the quality of it's pictures. It certainly has some flaws ( flash pictures, noisy auto focus) but anyone who claims that this camera doesn't take fantastic pictures doesn't know how to use it or has a broken camera.", "Date": "December 13, 2001"}, {"Title": "Hard to Beat!", "Author": "J. R. Challis", "ReviewID": "R1G2VB3AX8NLPV", "Overall": "5.0", "Content": "I would be hard pressed to find anything negative to say about this camera.  It is my first digital but have owned it for 10 months; used for pleasure plus to send photos to clients attached to email.  Have not received a single durogatory comment from a client.  If fact, they praise the clarity and color.  In short, I strongly recommend it!", "Date": "October 24, 2001"}, {"Title": "The initial battery power message is wrong, don't waste it!", "Author": null, "ReviewID": "R2TN13ENGN6Q6P", "Overall": "4.0", "Content": "Hi guys - got this camera after much umming and erring in January, and it takes great pictures. i wanted to say a word about some of the comments here saying that the initial battery power appears to not last much longer than the initial power up. Well - there's a weird flashing battery symbol that comes on very soon after you've loaded the camera  up for the first time, but if you ignore it, and simply turn it off, it carries on going. In fact I've taken a large number of photos off the first battery, and still haven't loaded up the rechargeable I bought in England. So there you go. I'm a bit dissapointed with the so-called SLR-esque qualities, but this could be through my only just beginning to stray off \"autofocus\" (it's a complicated wee thing). God luck with your photography. Oh yes, and the pixel depth is fine - there's a tiny wee amount of overt white speckling but it's genuinely miniscule and doesn't show up on the vast majority of photos.", "Date": "February 19, 2001"}, {"Title": "Great Camera", "Author": "I. Hartanto", "ReviewID": "R2F7IOOI685KR4", "Overall": "4.0", "Content": "The only reason that I didn't give this camera five star is that the bateery life is sucks and 8MB flash compact card is to little.Picture queality is excellent! User friendly and full pack of features. This is an excellent buy!", "Date": "November 1, 2000"}, {"Title": "Collpix Takes Cool Pics", "Author": null, "ReviewID": "R1TA62UUH43TX5", "Overall": "5.0", "Content": "I just got the camera and I think it is great.  The camera ia easy to use even for someone liek me who doesn't know alot about photography.  The only complaint that I have is the battery life.  But from what I heard, the battery life on all digital cameras is bad", "Date": "October 23, 2000"}, {"Title": "manual lens cap removal very annoying", "Author": null, "ReviewID": "R2WW6TZ208LCUD", "Overall": "1.0", "Content": "After 2 hears of removing the lens shade manually on my Nikon 880I will never buy another Nikon product again. Up to now, I have not found any reference to this irritating procedure in the Nikon manuals, specifications, or camera sale's blurbs. The battery charger & rechargeable battery's extra cost & time to recharge the battery negates owning a digital camera that should provide fast & easy use. The ready light does not go off when the battery is charged. Time between captures is more like 3 seconds,  not 1 second as stated", "Date": "November 18, 2002"}, {"Title": "battery !", "Author": "ayhan olcay", "ReviewID": "R1F16HCZ1JHJVW", "Overall": "4.0", "Content": "Recently i bought my first digital camera .It is great but rapidly depleted batteries are a problem.You have to buy special charger and batteries for camera.It would be nice to use other common battery types wit this camera. ... ...", "Date": "February 24, 2001"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.3-megapixel CCD\nNikkor lens with 2.5x optical zoom\nUses 2CR5 lithium batteries or optional rechargeable lithium-ion battery\nCompactFlash storage (8 MB card included)\nUSB and serial connectivity", "Name": "Nikon Coolpix 880 3.2MP Digital Camera w/ 2.5x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51CPJ6FD6AL._SX300_.jpg", "ProductID": "B00004YV85"}}