{"Reviews": [{"Title": "Feature-packed, but a little bulky", "Author": "A. Block", "ReviewID": "R329NG88CCOER", "Overall": "4.0", "Content": "I recently picked up the S45 in Japan. I own a Nikon Coolpix 2500, which I love for its compact size and rotating lens/flash unit, but wanted a camera with resolution to match my photo printer, a Sony DPP-SV77.My requirements for the new camera were: 4 megapixel, optical finder along with an LCD, 3x optical zoom, and a very compact size (roughly equivalent to the Coolpix).After reviewing the available options, the S45 seemed to be the best fit. Now that I've owned it for a week, I can say definitively that is an outstanding camera, with more features than most users will ever take advantage of.The software in the camera is extremely well thought out. The viewfinder display is clear and comprehensive (but with an option to reduce the complexity by eliminating unnecessary icons), and the various exposure modes are so complete that the S45 easily rivals the new generation of 35mm SLRs in terms of metering and exposure options. This includes aperture- and shutter-priority, the ability to change exposure values instantly even in Program mode, a range of ISO equivalents, EV compensation, and of course a fully manual option.Of course, the digital-only goodies are here as well, including a 15 fps video mode (with sound and *in-camera editing*), a panorama stitching feature that is extremely cool, and voice tagging of the still images.Image quality is excellent, with only a hint of that traditional digital low contrast that seems to be prevalent in all but the ultra high end (6mp) cameras. (Intriguingly however, you can store pictures in RAW [rather than JPEG] mode and change the contrast and brightness in PC software after the fact without quality loss.)My only complaints are minimal: first, I love the fact that my Coolpix shows up as a removable drive directly in Windows Explorer; with the S45 you have to use Canon's included software (which is excellent) to transfer images from the camera. Second, the lens cover (also an on/off switch), while it feels solid, doesn't always close firmly, which makes me worry a bit about its durability. Finally, the camera is somewhat thicker and heavier (denser-feeling) than the Coolpix, which is the trade-off you make for far far more features (at an admittedly higher price).I limited my brand choices to Nikon, Canon, and Sony, and I think that in this form factor there is no camera that even comes close to the S45 (except perhaps the older S40). If you are a sophisticated amateur (or even a pro looking for a backup digicam), you won't be disappointed.", "Date": "December 15, 2002"}, {"Title": "Like Re-discover Photography Again!", "Author": null, "ReviewID": "R3JBUPMA9JO7MF", "Overall": "4.0", "Content": "After over a month experimenting with most of the function/settings, have to admit I'm pretty impressed on both built/picture quality of the Canon newly improved S45. Even at auto mode you can hardly produce a bad shot, provided that I'm a die-hard manual SLR fan of NIKO FM2 for nearly twenty yrs.Rarely need to use photoshop to polish/adjust pics taken by S45, unlike my previous digital camera which I have to spend lots of time to correct digital noise, redeyes..etc.When shopping for digital camera, don't get too obsessed with megapixels or spec. 'number', what's more important are the software/chips which make the camera provide precise light sensing & focus accuracy as well as flexible tweaks when you want your pics to have optimum result at any given changing shooting environment. This point is well taken by users of Sharp's 4mp digital camera which uses Canon G2 equivalent lens but produces far inferior pics than Canon's even though Sharp's camera cost 40% less (so is the quality...). For S45, a large capacity CF card & a spare battery is always a must if you do indoor flash shooting & prefer to store pics at high resolution(which gives you stunning result), costco's website do provide a package deals that include above mentioned extras at reasonable price.LCD comes with a clear plastic cover that gives you enough protection, or you can buy those LCD protection sheets for PDAs then cut to desired size for less than five bucks. Exterior of S45 is a nice brushed metal finish which provides enough protection for its lens. No comment on the software since I installed the camera's driver only & use photoshop to polish when needed.  Twain driver is quickly recognized by most 3rd party graphic & photo album softwares when hooked up with PC.Upon comapring Canon's G2,G3,S230 & S45, S45 provides the best combination between size/function/pic quality criteria & one can hardly go wrong with any of them.", "Date": "March 3, 2003"}, {"Title": "little risk in purchasing a S-45", "Author": "Frank S. Kalich", "ReviewID": "RTNIMUKAXEMEH", "Overall": "5.0", "Content": "The adamfblock (from SF) review above was just about perfect.  Everybody likes this camera.  But nobody thinks any camera is perfect, a rating should be given relative to peers, meaning in this case 5 stars.  If you research this camera you will find no strong argument that any camera in its class exceeds the S-45 in quality/features.  The G3 is a better camera, but too big for my purposes.  I would miss all those spontaneous surprise shots if I ony had a G3, because I would not have it with me.  And while size of aternative really tiny cameras is nice, everyone agrees that the loss of features/quality in those is rather significant (at this point). The S-45 is small enough to carry around most everywhere, I got the little leather container that can be worn on your belt like a pocket knife, that is nice.  If you only have one camera, and want to avoid any driving desire to replace it in the next 5 years, this is a good bet.", "Date": "December 17, 2002"}, {"Title": "Powerful 4 MP camera... easy to use and with flexibility too", "Author": "Richard Go \"yusakugo\"", "ReviewID": "R2HAI1M8A3TX24", "Overall": "5.0", "Content": "The Canon S45 is an excellent digital camera with a few drawbacks.  As far as 4MP cameras go, it is a bit pricey but the quality of the camera build and the features on the camera make it well worth the price.  While the camera isn't exactly shirt pocketable, it is still fairly easy to carry around with you and not overly bulky.On the plus side, the S45 has:1) 9 point AutoFocus2) DIGIC processor which speeds up capture of photos and their quality3) 3x Optical Zoom (who cares about the digital zoom)4) 4 MP picture quality5) Easy to use interface with quick access to manual settings via FUNC button6) close to centered tripod attachment for easier stitch photo taking7) A ton of manual settings (exposure settings, aperture settings, shutter settings, white balance, photo effects, and more!)  Almost all the settings available on Canon's high end G3 camera!8) A pretty tough metal body9) Ability of the camera to take RAW shots for photoediting.On the minus side:1) Decent to weak flash that is better than the S400 but still weak for low light and night photos at greater than 10 feet away.2) Decent to below average battery life... 200 shots on a full charge with LCD on in my experience3) Slide door that protects lens and doubles as power switch worries me in quality a bit.4) Red eye problems with straight flash use but much less so when the red eye reduction is used.5) I wish it had a hot shoe or some other way to add an external flash unit.The camera takes fantastic shots even when in manual mode although its strengths will be found when you learn the manual settings of the camera.  I think this is a better buy than the Canon S400 since they are the same price.  If you're willing to sacrifice a little size... this Canon won't disappoint!", "Date": "April 7, 2003"}, {"Title": "Compact & well built camera takes great pictures!", "Author": "rjpryan \"Ryan\"", "ReviewID": "R1CKK7DYLWBTPW", "Overall": "5.0", "Content": "After extensive research, I decided on this camera as a replacement for my older 2 megapixel Olympus 2040.  I have been very impressed with it so far - it seems very well built (sturdy), is small enough to fit in my coat pocket, and takes great pictures.  The telescoping lens extends and retracts very quickly making it easy to take a picture on a moment's notice - this was a problem with my old camera - it was too slow.  When researching the camera, I was trying to find one that took \"AA\" batteries since they are much cheaper (NiMH).  However, the Canon NB-2L battery isn't too expensive if purchased from a third party retailer (I got a generic one for [$$]).  Also, the included charger is very small and portable with built in retractable AC plug - it's lightweight and easy to throw in a bag and take with you.The camera records the orientation that each photo is shot with in the EXIF header, and if you use the bundled Canon software to download the photos, it auto-rotates them for you.  This is very handy.  Unfortunately, it doesn't work if you use other software such as iPhoto or Image Capture.The mode dial is very handy - it has enough settings on it (ie, automatic, manual, shutter priority, aperture priority, night shot, portrait, movie mode, etc.) that you can quickly flip to the one you want.  My old camera required the use of menu systems to set most of these modes - the dial is much faster.The camera features a stitch mode which allows you to stitch together multiple pictures to form a panorama.  When in this mode, the camera shows you the last picture you took (offset to the side) allowing you to roughly overlap 1/3 of the next picture with the previous one.  Using the included stitch software, I was able to easily make a Quicktime VR movie - pretty cool.  You can also make panoramas with this mode, and unlike some manufacturers (Olympus), this works with any brand of CF card, it doesn't have to be the manufacturer supplied one.The only drawback I've found for this camera is the lack of a USB auto-mounter feature (\"Mass Storage Device\") which many other cameras have.  This feature allows you to just plug in the USB cable to your computer and have the camera auto-mount on your desktop like any other removable disk.  I wish Canon would include this feature since it enables you to completely bypass software for the import process.  This is something I can live without though - the other features make up for it.Overall, a great camera which I would highly recommend!", "Date": "March 28, 2003"}, {"Title": "Definitely one of the best", "Author": "Wes Bernard \"Bookworm in transition\"", "ReviewID": "R2L2923RFXKSUH", "Overall": "5.0", "Content": "When my Nikon CoolPix died after two years, I decided to go back to the brand that I have had all my life, Canons.  I must say that I am not disappointed.  The choice was between the S45 and the G3, I decided to go with the S45 bacause of its size and I figured I could do without the ND filter on the G3.  The S45 is amazing.  Incredible focusing speed and image capture.  My Nikon would take so long to capture the image that the subject would move, ruining the composition, not so with the S45.  It is truly one of the best digicams on the market.  The images are crisp and true to life and the colors are just brilliant.  What can I say, I am back on the Canon train.", "Date": "January 8, 2003"}, {"Title": "Good and bad", "Author": "K. Somridhivej \"skongfah\"", "ReviewID": "R3S1GU1DZNLET5", "Overall": "4.0", "Content": "I bought this camera a few months ago. I really like it but I found some drawbacks on this qonderful camera. (It is impossible for me to find a perfect camera)1. Zoom control is not easy to use. Unlike S400, zoom is locked in step. The control is ok but not as good as traditional SLR cameras or S400.2. When you switch to P, A, S, etc mode the 9 points auto focus function is gone. This is not a big deal though if you can use the other auto functions.3. I wish they change the way len is cover by sliding cover. I don't feel very confident that the len is protected by dust.4. Macro is not working very well. I guess it must be the same as most digital camera.  Ok. Most of these complaint (except the first one) I fully expected when I bought. Why the heck I bought this camera?1. Canon digital camera has the best picture quality. About the same as Nikon but cheaper. Far superior than Kodak.2. Compactflash memory is cheaper than other format. Unlike other, high capacity memory card is available.3. More manual control over S400 but not too much as G serie.I think 4MP is more than enough unless you want pictures more than 8X11. Hope this review helps your purchase decision.", "Date": "July 10, 2003"}, {"Title": "Nice pictures, [bad]editing software", "Author": "James Daniels", "ReviewID": "RQD9S9TY8FLPG", "Overall": "4.0", "Content": "The Canon S45 is basically a revision of the S40 with some newer software included. The S40 is itself a version of the Powershot G3 without the gimmicks like remote control, flash mounting, and a few other tricks. The sensor and optics are the same for all three cameras, the difference is in the software on the camera, the editing software for the PC that comes with it, and the gimmicks.The S45 is a nice camera. The user interface is much better than on the S40, and it still has the excellent color quality and image resolution of a 4MP camera. It is ruggedly designed, has high quality optics and CCD, and numerous buttons that are out of the way for normal use. It has full auto and full manual modes, so it's appropriate for beginners and experienced users.The downside of the camera is the slow startup time. The flash is also in a spot where your finger might cover it if you're not careful. There is some noise at low light levels, but this is true of all CCD cameras, and the S45 is about average in this respect. The images are excellent at high resolution/large file size, but the included 32MB flash card is a joke. Canon should know better, and ship all cameras with at least 256MB cards.The major downside of the package is the photo editing/printing software that comes bundled with the camera. It's user interface is an atrocity, buttons have icons rather than labels, there is no menu tab, etc. The camera is quickly recognized by USB port, and the downloads are quick. Just be sure to get Photoshop or another quality editing software package, rather than relying on the [stuff] that comes bundled with this camera.", "Date": "January 3, 2003"}, {"Title": "The Best 4MP Digital Camera For It's Price!", "Author": "dshaug1", "ReviewID": "RDNUZY77UMFRV", "Overall": "5.0", "Content": "I recently purchased this camera after having previously owned a Fuji Finepix 2600. After owning the 2600 for just over a year the lens mechanism got stuck and the camera completely broke. It had a 1 year warranty which had just expired, and there's no use paying to fix it. I figured it was time to upgrade, so I spent hours and hours searching CNET and other review sites for 4MP digital cameras and I finally found this one. I would have gone with the Nikon Coolpix 4300, except Canon had their Digic chip which was supposed to allow the camera to go from shot-to-shot faster. Also I own an old Canon SLR camera, and I trusted the brand. This camera is a very good transition from my SLR, much better than my old Fuji. I wanted something with image quality close to that of my film SLR, without the bulkiness or price of a digital SLR. So far this camera has done that, producing some wonderful shots. It has plenty of features ranging from customizable shutter speeds and lens aperture to exposure compensation and 12 scene modes, making it great for shooting in any condition. One of the great features is the AF lamp, a brief light that goes off before the picture is taken that helps focus the image. It works great for low light shots. Another astounding feature is the ability to set ISO speed, just like you would on a film camera. My last camera was almost the same price as this one and has none of these features. I guess that shows how much prices have come down in the past year. There are not many cons about this camera. It's smaller than most cameras with the same amount of megapixels, but it's still not as lightweight as some of the Casio models or Canon's digital Elph. The pictures on ISO 200+ have significant noise, even with noise reduction, and the optical zoom could be larger, and the macro is sub-par, but that's really all that is bad about this camera. Battery life is great, although it uses a proprietary lithium battery. Here is a list of pros and cons:Pros:- Digic image processor.- Large array of features.- Great quality photos.- Panorama stitch mode.- Great battery life.- Movie mode with sound.Cons:- ISO 200+ has significant noise.- Poor macro mode.- Lithium battery instead of AA.- Optical zoom could be larger.Overall this is a great camera and many other reviewers agree with me. It's not too expensive but has features of cameras almost twice as expensive. If you're a beginner photographer you might want to stick to something simpler, as the features are more than you need you, but if you're looking to move up from an old digital camera I guarantee this is the best deal you're going to find.", "Date": "November 8, 2003"}, {"Title": "Canon S40/S45 - my 2cents", "Author": "Ken", "ReviewID": "R1TVMSAQCS6OA6", "Overall": "5.0", "Content": "I purchased the canon after a long period of lamenting over the cost and the features of this camera versus a G2, or another brand (Fuji, Olympus).After owning this camera for ~6months I am relatively happy with it.  I picked the S40 over the G2 based on power off to shoot time and abitlity to stuff it in my pocket in a hurry to switch from camera to DV.  The G2 took ~2 seconds longer to power up than the S40, and it is also quite a bit bigger.  The CCD is the same, and I needed the point-and-shoot feaures also so the S40 was the winner.Picture quality is superb, but you have to know how to shoot a good picture to begin with.  The response time to capture an image is great if the AiAE is set to center weight and not evaluative.  This helps to keep the desired target in focus and reduces autofocus times tremendously.The .avi clips are good quality so its a nice feature, but I wouldn't use it as a video camera, more for action type shots that you don't want to miss...", "Date": "June 5, 2003"}, {"Title": "I love my little S45!", "Author": "C. Power", "ReviewID": "R2JWFZCWPI5AEC", "Overall": "5.0", "Content": "I've had my Canon S45 for about three months now, and I am still discovering new features that make it even more endearing.The picture quality is excellent under almost any conditions.  The 4.1 megapixels are more than sufficient, in fact, I often dial down the resolution to save file space.  The movie clips with sound are much better than I expected.  The sturdy silver case with the clamshell cover is my favorite feature.  It fits easily in my pocket, and is easy and quick to open for that first shot.  The software was simple to install and use, and the instruction manuals (almost as thick as the camera) were nicely done.  I ordered a 128mb card with the camera, which holds an amazing quantity of photos and film clips - highly recommended.There are only a few minor complaints.  The viewfinder is very plain and doesn't display the digital zooming effect, so you are very dependent on the LCD screen.  The screen is nearly impossible to see in direct sunlight, and the data is very tiny.  Also, the low battery indicator doesn't seem to appear until there is only power for one or two more photos.  Red eye can be a problem, although coaching the photographed people to look at the pre-flash srobe, as the directions explained, does work well.  And some photos containing horizontal lines can have a jagged appearance at some resolutions, but it is usually minimal.  But I have adjusted to these little problems and don't consider them reason enough to not recommend this little marvel of technology to anyone!", "Date": "May 28, 2003"}, {"Title": "Great", "Author": "steves1019 \"steves1019\"", "ReviewID": "R7UQX9VTZSYFW", "Overall": "5.0", "Content": "Got this about a week ago and I couldn't be happier! Has more features than I will ever use, but it's nice that they are there. Starting up is a snap.  Haven't printed at all yet, but image quality is great.  Downloading pictures to the computer is also super easy. Highly recommend it to who can afford it.Also bought the Wp-Dc300 waterproof case, that this is great. Can't wait to take it scuba diving (good to 100ft!).  It will also be great for the beach, keeps that sand out. it is expensive but when it arrives you'll see why, the quality is fantastic.I had some trouble find a case that would work with this camera.  Saw lots of complaints in the reviews so I went to Best Buy to fit a couple. I found that the Samsonite 801bk fits really well.  The camera has little room to move, it fits a spare battery, spare CF card easily and the video wire (this makes it kinda tight but still works). The case is rather small so its still easy to carry around.Hope all this helps, Good Luck!", "Date": "January 18, 2003"}, {"Title": "Excellent camera...but just shy of outstanding because...", "Author": null, "ReviewID": "RMCPCOCL2K6WR", "Overall": "4.0", "Content": "First off, I love the camera.  The only problems I have had are with redeye (easily fixed with included software), and getting the LCD screen scratched just days after I made the purchase. I just wish there were a cover for the LCD.  I went diving with the scuba housing WP-3000 and got some great shots.  This camera was the talk of anybody that saw it...it almost got annoying at times.  I suggest getting a larger card, and an extra battery.", "Date": "January 23, 2003"}, {"Title": "BANG FOR YOUR BUCK", "Author": null, "ReviewID": "RA4EMM6J4W0R4", "Overall": "5.0", "Content": "What i like about this camera:1) fast buffer (there aren't much waiting for the last picture to be saved before shooting another one, kodak's camera made me wait up to 13 seconds a few time!) this one is within 5 second if the picture quality is high. When it come to taking 10-16 rapid fire shots, there aren't much waiting in saving the file too!2) Features, features...so many. You got photo stitch, a great way to make a 360 picture just about anywhere.3) manual controls, flash control (most digital cameras dont have flash control...but what if flash is too bright for some areas? what you going to do? , canon solves all of these !)4) fast zoom optical lense retract, 1.8 second before first shot taken... beats minolta f100, 6 second! you'll miss a shot before you know it.5) movie mode, up to 3 minutes (which is a lot!) great sound very clear, video quality is good, better than others i have seen.6) customize sound start up screen! (put whatever you want as sounds, it even got themes you can upload from the cd software that is included....tons of stuff to play with.7) replay control... browsing through tons of photos that just got taken? no problem, easy navigational system! love it, you got to check it out.8) solid metal case, nice nice nice but do becareful as well9) zoom optical lense is in the center rather than on the far left side like minolta f100 and sony's digital cameras. This way you wont get your fingers in the way too easily, and plus if you let someone else use your camera , it's better to know that they won't accidently mess up the lense~!10) softwares provided is great, fun to play around with, cool graphics too to try.11) compact flash memory,....... up to 1 gig mircodrive.but honestly you only need 256, = 200 high resolution photos.!12) small, but not too pocket-sized. Surprisingly easy to handle and comfortable. Still i say is smaller than most digital cameras I have seen.things I wish they had done better1) the lense cover, you slide it open to turn on, slide it back to turn off.. have to be careful about this thing. very fragile cover. I wish they used a on off button instead.2) battery is not AA. You have to use their charger + battery, .... ... But i wish it was AA because I have AA charger already. I have to buy spare, which is \"costly\"", "Date": "March 21, 2003"}, {"Title": "Stunningly good product", "Author": null, "ReviewID": "ROA6PE1RHKAI1", "Overall": "5.0", "Content": "I purchased this camera because it has most of the manual features of the Canon G2 & G3 models, but it is much more compact and has a reputation for taking great pictures at the automatic settings. That was a big plus as I'm new to photography as a hobby. I have not been disappointed. In fact, it has exceeded every expectation. Thus far, I have been unable to take a bad picture using the automatic settings! The downside of this (if you can call it a downside) is that it made me a little lazy about learning all the manual adjustments and features to customize a shot!...but I am learning them because this is the greatest, most fascinating little electronic gadget I have ever had! I Haven't had it very long, but so far a very reliable product. If you are like me and hestiant to pursue photography as a hobby because of the potential for wasting film and processing with a traditional camera while learning the craft, this is the ideal digital camera for a novice. For the money, I can't imagine a better product. Very high quality, hefty for its small size but it gives a sense of confidence. Some other cameras feel like toys compared to it. The only reason to avoid this model is that it doesn't have interchangable lenses--but that's the ONLY reason--and you have to get a larger, more expensive model to get that flexibility.", "Date": "January 26, 2003"}, {"Title": "Better than I expected but some flaws remain", "Author": "Kevinkar \"kevinkar\"", "ReviewID": "RWZ77PV0FNM6Z", "Overall": "4.0", "Content": "This camera is highly rated across the board everywhere I look.  It's got almost all the features and capabilities of it's larger sibling, the G3, but in a smaller, more compact, and easier to use package.The output is really good with excellent color and good definition unless you zoom in way too far.  The feature set is quite complete and there are plenty of choices between expert and novice modes.  It's a well made device.  It's also cheaper than the S50 (5 megapixel) which is fine as the 4 megapixel count is adequate for 90% of the population who would buy this camera.My only complaints are that the low light focus capability is poor.  While better than the S40/30 it's still not able to quite focus on its own in a darkened room even WITH the focus assist light.  Some manual focusing is necessary which is also imprecise and a chore.  Also the aperture is a bit slow at telephoto settings which also worsens the focus and severely affects the blurriness of the captured image if you move too much when snapping the picture.Other than these problems, it would have received five stars.", "Date": "May 14, 2003"}, {"Title": "The Canon Powershot S45", "Author": "Lisa Cohen", "ReviewID": "R3KIPWKBHPP1XD", "Overall": "5.0", "Content": "I bought this camera right after it came out. It was recommended to me by my dealer, because I was looking for a digital camera with at least 4 mega pixels, that I could use on land and underwater, in a [certain]price range ...This camera has fulfilled all those requirements beautifully. Things I like about the camera: it's compact, easy to use, has a lot of features that you don't even need to know in the beginning to get started. I started taking pictures right away by setting it to Auto. But as you want to learn more, the camera can do more. It's very easy to use underwater. You turn it on, set it so that the it will power down after a minute of disuse, turn off the display to conserve the battery, pop it into its housing, run some silicon around the o-ring, and off you go. On a recent dive trip, I was able to take photos for two dives on a single battery. Then I'd go back to my room for a bit of rest, change the battery, put some more silicon onj the seal and close it up again. I couldn't believe how easy it was. At the end of the day, I'd go through my shots and delete the ones I didn't like. You can also zoom in on your photos in the display mode to take a close up look without having to hook your camera up to a computer. On land, I recently hooked the camera up to my tripod and took a family portrait with the timer setting. It takes action shots, low light shots, panoramic shots (through stitching), hi resolution shots, low resolutions shots, you name it, this camera does it.", "Date": "July 1, 2003"}, {"Title": "Great pictures", "Author": "Kishore C. RAO", "ReviewID": "R2EVFWEQDRJXAO", "Overall": "4.0", "Content": "pros: The pictures are very sharp and operation of the camera is cool. Software is also good, especially the PhotoStich utility, works without any problems on my Win 98.Cons: Need to handle the lens cover with care, looks sturdy though. The multicontroller is a bit of a pain sometimes, mine has a slight problem when erasing images.", "Date": "April 15, 2003"}, {"Title": "Great point & shoot camera", "Author": "Jaybird", "ReviewID": "R282UMJIVV8PJQ", "Overall": "5.0", "Content": "After 6 months of pretty heavy use, I'm very pleased with this camera. The image quality is superb for a consumer digicam. Many think the S45's image quality surpasses that of the (5-megapixel) S50, and I agree. The S50 suffers from higher image noise, and the extra megapixel doesn't really make a big difference in resolution (2592x1944 versus the S45's 2272x1704).Don't expect DSLR quality, however. Be realistic. All consumer point & shoot digicams utilize very small sensors, so image noise will always be an issue at higher sensitivities (above ISO 100).", "Date": "January 16, 2004"}, {"Title": "For snapshooters only!", "Author": "Mark Taylor", "ReviewID": "R2IOKW9ONV8VR4", "Overall": "3.0", "Content": "I use this camera mainly to shoot small art objects, since I'm an art dealer.On average the quality of photos you can take with this camera is pretty good considering the price. It has a good array of advanced options as well, like RAW format, that later you can convert to a 11MB TIFF file (on average, for 8 bits) or a 22MB TIFF (on average, for 16 bits). Tiff's are uncompressed files, and are the best option if you want to use Photoshop to manipulate your shots.Very well built metallic case. I drop it from 4 feet twice and not even a dent occurred. Well done Canon!The custom option in the shooting menu is also very welcome. You can store all your shooting parameter, like aperture, speed, colour balance, bracketing options, ISO and etc. Very handy!In good light conditions the quality of photos is excellent for a 4 Mpixels camera. Both colour balance and sharpness are excellent. Better stick to ISO 50 or 100 or you will get above average noise though.So far so good. But ...Below average flash. If you use it outdoors as a fill in flash be prepared to get your main subject washed out and overexposed. If you use it indoors, on a birthday party for instance, the flash is not powerful enough even for small ambients. Be prepared to get underexposed photos with excess noise when you blow them up. But I have to be fair, if you take snapshots only, you would not notice it probably.And now about the software that comes bundled with the camera. Remember that in digital photography the software to manipulate your shots is almost as important as the camera itself. And that's the point were the S45 fails to my requirements.The File Viewer Utility does what it should do, but will present to you an interface that would be outdated when Windows 3.1 was the king. Zoom Browser has a better interface but is a jack of all trades and master of none sort of software, not integrated at all with the rest of the bunch. But I could live with both and still rate this camera well.But then there is Remote Capture, which was one of the reasons I bought this camera. As I take pictures of small art objects, light control is top priority and the possibility of connecting the camera to a computer using this software and get a bigger image with all the control options of the camera was really appealing. Forget it! Remote Capture is a prehistoric, poorly designed, not properly tested and buggy piece of software. I do not understand how a company with the reputation like Canon supplies this sort of software with one of their products. I am sure it is only damaging the confidence the customers have in the brand.Remote Capture is ridiculous. You can not save your shooting preferences, so every time you connect the camera you are back to the auto everything default. When you connect the camera, Remote Capture takes total control control, bypassing the camera controls, but without presenting the information that you usually get on the camera's LCD. There is no on-line information of speed, aperture, the focusing area marks, the auto-focus options, nothing! To know if a photo will come out in focus is a lottery. You can only trust in your visual perception from what you see on your monitor.There are so many limitations that I would need too much space to describe. So I will only mention one more: Remote Capture freezes very easily (and I am using XP-Pro!), mainly if you use it in conjunction with a photo manipulation software, like Photoshop or PhotoImpact.Final conclusion: This camera is adequate and a good value for money if you are a casual snapshooter. For this purpose I would rate it as 4 stars camera. But for semi-professional use I can only rate it 3 stars at the most.", "Date": "July 26, 2004"}, {"Title": "A great choice", "Author": null, "ReviewID": "R2U3ALO05K1L8X", "Overall": "5.0", "Content": "Unknowingly my son-in-law and I both bought the same camera a day apart and for the same reasons. This is by far the best camera for the money around. Its flexibility is enormous. Its size is perfect to carry and not be burdened.I love it and will probably never use any thing except \"Auto\" but I still have the oher features is I want. I use a Viking CF card reader to download to photoshop which works perfectly for me. Far and away the best buy around", "Date": "December 25, 2002"}, {"Title": "Nice camera", "Author": null, "ReviewID": "RSOLTYTRGCNCC", "Overall": "5.0", "Content": "I wanted a small compact camera with high resolution and compact flash media II compatible which can fit in your pocket. The S45 was the choice for me. If you used a Canon SLR you will see similar shooting modes on the S45, such as Aperture Priorty, Shutter Priority, and Programmed mode. The shutter speeds ranges from 1/4000 to 15 seconds and the aperture range is from f2.8/4.9 to f8. This will give you some exposure range to experiment with, just like an SLR. The image quality is good with 4mega-pixels. It will never match the high quality image of a SLR Lens and SLR Digital camera, but this is the compromise for all compact cameras.The battery life is good but I usually only take about 50 photos per day when on holiday. At the hotel I just recharge it for the next day. I'm using a 340gb microdrive and it can store about 150 high resolution photos. If you get this camera or any compact flash II camera get the 1gb microdrive, they are inexpensive and you can store some 400 photos at the max resoltuion for this camera. Another reason to get the 1gb microdrive is you can copy your favorite photos from your pc to the camera, then when you visit your friends/relatives you can watch then on a big tv.The video mode on the S45 is simple. During recording its only a 320x240. On TV its like an MPEG1 movie and quailty is very poor, really unwatchable. On the PC it looks fine but the screen is small. Also during video mode you cannot use the zoom lens so forget close ups during recording, unless you are physically moving closer.In this camera there is an automatic red eye flash reduction. Unforutnately I'm one of those people who will close their eyes during the pre flash so most of my flash photos of myself are with my eyes closed or squinted. I wish they would just allow regular flash like on the S20.There is a flash exposure control so you can either under/over expose the flash. I will usually under expose the flash when taking a portrait in sunlight to reduce the shadow. All in all this camera and the future Canon S series has SLR features to play with, if you chose, but still can fit in your pocket.", "Date": "June 26, 2003"}, {"Title": "Might buy a second.", "Author": null, "ReviewID": "RQIYH0YV38GQN", "Overall": "5.0", "Content": "A friend and I bought this for a trip to New Mexico and Arizona, a great decision. The painted desert. The Grand Canyon. What better place to try out a camera? And we certainly tried it out. We took hundreds of pictures and were very happy with the results. We couldn't get over how good the pictures looked and how easy the camera was to operate. I thought it would be neat,digital pictures, but as a long devotee to film, I didn't take them very seriously. I do now. The camera well designed and the pictures quite often are just what you'd hoped for--a rare thing with my old 35mms SLRs. The camera might have paid for itself just in film and developing costs on that one trip. And the printouts look good and you can also easily email them, which we did from the road and was much fun. I would recommend highly using a laptop on a trip, since we filled up the 128 MB card (bought separately and also highly recommended) almost every day and then emptied the card onto the computer in order to have a fresh 128mb for the next day. I've just bought a new Apple laptop and one of the deciding things was portability and storage for the next trip with the camera. One of the best things I've ever bought. A superb piece of equipment. I've seen the future of pictures and it's digital.", "Date": "October 8, 2003"}, {"Title": "For those who like to just point and shoot!", "Author": null, "ReviewID": "R36S1D22101AUG", "Overall": "5.0", "Content": "I bought this camera on Christmas Eve and by Christmas, had mastered the auto mode and was taking some great pictures! This camera is wonderful!  It is not too large nor too heavy (like the G series) but still has most of the capabilities of that series.  For those amongst us who just want some decent pictures - this camera is for you!  It has many bells and whistles if you choose to expand beyond the pointing and shooting. With a simple flash card reader, it is incredibly simple to download the pictures onto your computer.  With 4MP, enlargements including 8x10 are as crisp as a professionals. I have only owned Canon cameras prior to this (the Sure Shot) so did not do any comparison shopping - this camera is the best!", "Date": "May 29, 2003"}, {"Title": "Film wastage no longer a guilt trip", "Author": "Joseph Haschka", "ReviewID": "R3NR87PN21S06D", "Overall": "4.0", "Content": "All my life, I've used cameras that require film. Two weeks ago, my wife and I acquired our first digital, the POWERSHOT S45, and last week gave it an initial workout at Bryce, Zion, and Grand Canyon national parks. This review is by no means exhaustive as I've yet to master all of the camera's features; it's a summary of relatively superficial first impressions.The bottom line is that this 4 megapixel device takes impressively good pictures of such high detail resolution that my wife, a graphic designer, expects to use its output in PhotoShop for her professional work. It's small enough to be easily held in one hand, and is so light as to be barely  noticeable when carried in a small padded bag hung around the neck. (The old 35 mm was a millstone in comparison.) The silvery finish is smudge resistant, as when handled with fingers made greasy with french fries. You may wish to purchase an extra rechargeable lithium battery. After neglecting to re-energize it overnight after taking some ten snaps, the battery pooped out the next day (in the middle of our Bryce exploration) after taking an additional fifty-eight shots. Of course, being new to the digital experience, we were using up a lot of power constantly reviewing our photo masterpieces on the LCD screen. In any case, the power cell recharges surprisingly quickly. Also, we thought it prudent to purchase the larger 256 MB CompactFlash card (for in-camera image storage) to replace the 32 MB card provided.  Speaking of the screen, it's fairly small at1.5 x 1.12 inches, and its display is very difficult to see in bright sunlight. And, if you need glasses to read small print, keep them handy to decipher the system's on-screen icons.While the 3x optical zoom lens is swell as far as it goes, the inability to attach a polarizer filter can be immensely aggravating under certain conditions.The shutter button's surface is smooth and entirely flush with the camera body; I was insecure enough to have to constantly check that my finger was on the button.  One of the camera's greatest strong points is its wealth of features. For the digital novice, this versatility is perhaps an initial disadvantage since it'll take effort and time to become knowledgeable and well-practiced in all of them. Indeed, the 181-page user guide is a prodigious read. But, it is, to the extent that I've so far digested it, commendably comprehensive and easy to understand (with a plethora of illustrations). The provided software and transfer cable made uploading of each day's output to our PC laptop completely effortless. (My wife would subsequently transfer the image files to a CD for future manipulation in PhotoShop on her Mac.)My wife takes a lot of pictures that leave me rolling my eyes and shaking my head. Unfortunately, the digital nature of the POWERSHOT S45 leaves me unarmed with the old argument, \"You're wasting film!\" Isn't technology wonderful?", "Date": "October 6, 2003"}, {"Title": "Great overall, some flaws", "Author": null, "ReviewID": "R3DEE340QC7Z0M", "Overall": "4.0", "Content": "Have had the S45 for a few weeks now.  The pictures are great, the features are top notch, and the size and weight are within my portability limits (just).  The sliding lens cover comes out of its track so I have to hold it down while sliding to get it closed properly. Also, the LCD screen scratches too easily and I worry about the long-term viewability after some solid use.Battery life seems great, and once you've read the manual the menu-based controls are fairly easy.  Movie mode is very cool.", "Date": "May 19, 2003"}, {"Title": "Quality", "Author": "W. Lynn", "ReviewID": "RTS5J3J4NYLVC", "Overall": "4.0", "Content": "I've had this camera for over a year now. I bought it intending to keep it as my #1 active camera for several years, and I'm very happy with it. I paid a lot of it, as I got it as soon as it was available, but I have no regrets going the extra mile. Very very nice image quality, good manual controls, and very sturdy. I have dropped this thing on paved bricks and it survived (albeit with a couple of dents). I have fallen into love with digital photography thanks to this camera.The only minor gripes of mine are: It's a little heavy. Does not have a few features such as flash hotshoe... (look into the G3 or G5 for that). The included Canon ZoomBrowser software is bulky and fairly crappy and you only get USB 1.1 transfer speeds (I'd prefer using a plain CF card reader). Optical zoom is modest (but then what do you expect from this lens.) Video mode is limited to 3 mins regardless of how big your CompactFlash card is.As for Canon themselves - my manager at work got himself a S50 after my recommendation, and my brother also got a S50 afterwards. Two of my friends also own IXUS400s... from what I've seen, Canon are definitely one of the best digital cameras makers.", "Date": "December 31, 2003"}, {"Title": "Great Camera", "Author": "Thomas Dunham \"Los Pepes\"", "ReviewID": "RVLSW2WT8NJVH", "Overall": "5.0", "Content": "I held out for a long time before going digital. It always seemed like the digital cameras that I liked were too expensive, and the ones that I could afford had less than admirable resolution. The S45, however, has a whole lot of features (not to mention a 4MP(!) resolution), and at a great price to boot. The camera has many features for advanced photographers, but is also very easy to use right out of the box, with little or no setup. Downloading images is also a breeze using both the direct-connect USB cable and third party flash memory readers. the built in mic captures sound, and the camera as a whole is solidly built(although I wouldn't want to drop it!).All in all, a great deal from a reputable manufacturer!", "Date": "September 18, 2003"}, {"Title": "Get one before they're gone!", "Author": "Bighairydoofus \"-\"", "ReviewID": "R3S2ZO2BK9TP7T", "Overall": "5.0", "Content": "I'd been waiting for the five megapixel version of the digital Elph, but when the first reviews of that camera came out, I was a little disappointed.  It seems that Canon is having a bit of a problem cramming so many pixels on such a small sensor, resulting in noisy images.What does this mean?  It means that the four megapixel cameras are taking better looking photographs with smaller file sizes.I decided to get the S45 over the S400 after a little research.  The S400 will probably suit most users fine, but if you want to have manual control while still retaining a reasonable camera size, the S45 is great.  The S45 also has the capability to shoot in RAW mode and the S400 does not.  This allows you to store images in an uncompressed state, with all the data from the sensor intact.  I wanted a camera that I could grow into, not a camera that I would completely master in an afternoon.  Right now I'm using it in auto mode and experimenting with the many manual capabilities.Downsides?  While the camera is small, it doesn't fit comfortably in your pocket.  If this is really important, buy the S400.  After all, you won't get a shot if the camera isn't with you.  I don't mind carrying a camera, so it's no big deal.I bought this a few weeks ago when Amazon was closing them out at less than 300 bucks.  They're gone, but still can be found elsewhere.", "Date": "April 6, 2004"}, {"Title": "Excellent pictures", "Author": "Mike J. Oconnell \"mikeo123\"", "ReviewID": "RDN86N142TLXP", "Overall": "4.0", "Content": "This is a great camera. My pictures always turn out well. Every piece of equipment made has some shortcomings... The camera is not an Elph (i.e. heavier and larger). I am into the great outdoors and I hate lugging around a camera, a GPS, water... The smaller and lighter everything is the better. For a camera this big and heavy, I want MORE ZOOM!!!! My camera is sometimes really slow, but not always. I cannot figure out why. It is not a flash needs to charge thing. The color of my photos almost always needs to be adjusted after downloading them onto my computer. One major thumbs up for this digital camera: no low light problems! Yes, it still needs a flash when it is dark, but I can take pictures of sunsets and full moons w/o problems. My bottom line: Cannon makes [really good] cameras! Buy the Elph!", "Date": "April 4, 2004"}, {"Title": "Great camera", "Author": "G. Ware", "ReviewID": "R3KRKD6QC2018I", "Overall": "5.0", "Content": "I spent weeks looking for the right digital camera to replace my old Canon digital camera. I finally settled on the Canon S45 due to it's features, quality and the deal I was able to get. So far I am very pleased with the camera and the quality of the photos. I recently took the camera with me out of state to visit family and upon returning I plugged the usb cable into my Apple powerbook and loaded the pictures into iphoto. All the pictures came out very well, only needed to enhance the image on a few photos. All the photos I took were through the automatic setting. I'm sure once I'm comfortable with the manual controls the picture quality will be even better. I was worried about my choice after reading some of the reviews online about the lens cover that is also used to turn the camera on/off. To my relief this turned out to not be a issue at all. Some reviewers stated that the cover was cheap and came off easily. Not sure what they mean as my S45 lens cover seems very sturdy at this point. I almost went with the S400 due to it's size and features but after seeing one in person it just felt too small to me. Although heavier, the S45 size does feel nice and doesn't seem to be an issue as far as carrying around in a small case.", "Date": "December 29, 2003"}, {"Title": "Good for most people", "Author": null, "ReviewID": "RCSYV2SPVXOKI", "Overall": "4.0", "Content": "I bought this a few weeks ago. It is a very good machine in terms of creativity it offers. It has 8 preset modes (auto, portrait, landscape, night, fast shutter, slow shutter, stitching and movie) and 5 others...The thing with this camera is: bad flash and a bit weight. May be that is my stupidity but I can get no good pictures with the flash. So if you plan to take photo in the middle of the night with the auto feature (one touch shot), think again. But if you plan to spend some time photographing without the flash (which requires most of the time finding something to place the camera on), then buy it (no garantee though :).And, buy a carrying case along with this camera, there is not one in the kit.", "Date": "October 9, 2003"}, {"Title": "Great camera, HUGE instruction manual", "Author": "S. English \"sphenoid\"", "ReviewID": "R3BNO4EI9GYR0S", "Overall": "5.0", "Content": "This camera does not disappoint -- well, unless you were hoping the features were easy to figure out and use.  The camera is awesome and takes excellent quality shots just using the \"automatic\" setting.  (2 months later I am still stuck on the automatic setting!)  The manual, however, is the size of Madagascar, and requires an afternoon (or weekend?) of committment to get through it.  I am sure this camera has many excellent features and their discovery should provide months of entertainment!!", "Date": "June 30, 2003"}, {"Title": "Good camera - except for red eye", "Author": "C. Williams \"csw122\"", "ReviewID": "RTLVKRX14MA9F", "Overall": "2.0", "Content": "Happy with the features, functions, and performance of the camera in all except one area. The red eye reduction function is useless. I'm aware of the physical reasons behind red eye, and undertand it can never be completely eliminated. But most of the photos I've taken of friends and family are absolutely terrible when it comes to red eye. I had a compact Pentax zoom 35mm before this, and the red eye reduction with that camera was outstanding. Cannot undertand how many outstanding reviews I read about this camera with any mention of it's weakness in this area. If you ever plan on photographing someone's face, look for another camera.", "Date": "May 16, 2004"}, {"Title": "Excellent Camera", "Author": null, "ReviewID": "R1X10ZXK53QGDR", "Overall": "4.0", "Content": "I think this camera is fabulous, but there are a few things I wish Canon can address in the near future.1) The smallest size the pictures come is in 640 x 480.  I'm hoping to save the image in a smaller size, something that would fit the standard photopaper size.  That way I don't have to adjust the size of the image in order for it to print correctly on the standard photo papers.2) Battery life is a bit short.  I was taking pictures for my brother's graduation, and the battery died at the most critical moment of the ceremony.  Luckily, I got a spare.  Make sure to get some extra battery, you'll need it.3) The \"Set\" button is sometime tricky.  One time when I want to view how much memory I have left on the compact card, instead, I accidently formatted all the pictures on the card.  Everything happened in less than 2 seconds.  I was so very upset and because the camera has some very memorable pictures I haven't had the chance to save it yet.  And unfortunately, the camera doesn't have an undelete or unformat function.  Luckily, I was able to find a data recovery program and recover all the images.Othere than that, the camera is a superb product.", "Date": "June 18, 2003"}, {"Title": "Very nice camera, set button hard to use", "Author": "Ted", "ReviewID": "R2QADTGAV2ABVC", "Overall": "5.0", "Content": "This is a very nice camera that takes very nice photos. the only reservation i have about it is that the \"set\" button can sometimes be hard to use (the set button is used in menues). The sed button is part of a 5 way button that is hard to operate with gloves on (or for people with poor motor skiils). I would maybe not recomend this to you arctic grandmother, but everyone else should love it.", "Date": "March 1, 2003"}, {"Title": "Canon Powershot S45", "Author": "Leonard Meier", "ReviewID": "R5JIMO9T4KHPH", "Overall": "5.0", "Content": "I purchased my new original S45 several years ago and enjoyed  using it.  I used it so much that I wore the markings off the selection dial.  I could still use it by looking through the view finder to know what settings I had.  I decided to look on Amazon to find a replacement and the replacement I chose was this S45 in new mint condition.  I ordered it and received the replacement in a few days.  I had previously purchased an extra battery charger so it makes it convienient to have extra supplies compatible with the same camera model.", "Date": "June 2, 2012"}, {"Title": "great camera at a low price", "Author": "P. Campbell \"P123456\"", "ReviewID": "RLTEVDQV8R0N4", "Overall": "4.0", "Content": "This was my first digital camera, I've had it for a little over five years now and it's still going strong, even after I dropped and dented it the first week that I got it; this thing is build to last! After researching so many different cameras, I decided on this one based on the many stellar reviews it had. The picture quality is great even while comparing it to my newer (higher mega pixel) camera for regular, medium to small prints. The only problem I have with this camera is, while it's not as bulky as a SLR, it's still not as compact as I would like my everyday camera to be, and hence why I recently picked up a Canon sd1000.If you could find this camera at a low price I would recommend it, otherwise I'd look into one of canon's newer smaller cameras, though I don't know if they are as durable as this thing.", "Date": "May 4, 2008"}, {"Title": "Beware that sliding door!", "Author": "Maddi Hausmann Sojourner \"madhaus\"", "ReviewID": "R11MJH6EBUOEF5", "Overall": "4.0", "Content": "The Canon PowerShot S45 was a terrific small digital camera when it was introduced, but the digital camera market advances quickly and this model has been surpassed by Canon's own S50 (5 megapixel in the same body only in high-tech black).  Serious photographers seekng a digital would turn to Canon's EOS Digital Rebel.  This is a good camera if you want lots of features in a small package without paying a lot of money.Features begin with the generous maximum 4 megapixel image size (you can make them smaller to conserve space on the CompactFlash card).  Several modes are available to you such as Sports (high shutter-speed and high resolution shots), Portrait, Night, etc. You can put it in complete Idiot Mode (okay, Automatic mode) and let it select your shutter speed and aperture, or you can pick one or the other and let the camera pick the missing one, or you can go full into Manual mode and pick both. There's even a Movie mode, complete with sound (although the product info above suggests this is new to the S45, this was available on its precursors the S30 and S40).  These video clips are 320 x 200 pixels.This small camera fits in a purse or shirt pocket easily and won't get in the way if you're shouldering it in a case (not included).  But you pay a price for the small size: the optical zoom is limited to 3x. And unfortuately, the S50, like all the PowerShot S family, starts out at a focal length of 11mm, which is a very wide-angle view. Even at 3X optical zoom you will only come in to 55mm, often not as close as you'd need. There is a digital zoom, but so what? Crop your picture in software later rather than play with that silly feature. But getting back to the range, I found it insufficient for shooting across a large room. If you work closer in this won't be a problem, but 55mm is not a good focal length for shooting children, who stop what they're doing when they notice you right next to them.The sliding door that covers the lens (and turns on the camera) seems flimsy and can cause problems. My 3YO niece got ahold of my S40's (exact same body as the S45) and ripped the door off. I was able to reattach it but now it's a loose tooth, waiting to fall off again. Even under warranty, my choice was to send it back to Canon for 12 weeks or live with it. I couldn't live without the camera, so I kept it, loose sliding door and all. I've just learned not to lend it to people who can't baby it; a good push and that door is off the camera again.One of the S45's limitations is a slow shutter response. I can't tell you how many shots I've missed using it; I frame it lovingly, I see the perfect moment, I shoot... but no score. The people have moved on, the sun has set, the universe suffers heat-death, and finally the shutter clicks. If you want a fast shutter then you must have a digital SLR, as almost all the compact-style digital cameras such as this one have the delayed shutter issue. Another note of annoyance on the PowerShot S family: they come with a wrist strap but no shoulder strap. I don't know what use a wrist strip is for a camera; if I'm not using it then I want my hands free. I bought a generic shoulder strap but it wasn't a great fit. At least Canon should offer one as an extra-cost accessory.I still give this camera 4 stars for putting so many features in such a small package. The pictures are reasonably good, and at this size you can crop plenty out and still print good 4x6 inch images. The PowerShot S45 comes with software, but you'll probably want to buy your own image editing package, such as Photoshop Elements. The one provided is fairly limited. Useful software includes PhotoStitch, which allows you to make your own panaramic style images from a series of linked shots. The included 32 MB CompactFlash card is also too small for typical use, so plan on buying a bigger card.  Also plan on buying a second battery.", "Date": "December 28, 2003"}, {"Title": "Too big, too heavy, and mediocre quality", "Author": "Eddie", "ReviewID": "R123UJE011S42Y", "Overall": "3.0", "Content": "For the price of this bulky camera, you could get a much smaller 5 megapixel Sony camera. Not only is it bulky, but it is heavy, and far too awkward to fit into a pocket. As far as the image quality goes, the outdoor pictures are beautiful as I had high expectations for this camera, BUT the indoor pictures were mediocre and somewhat unsatisfactory. The pictures I took in decently well-lit conditions didn't even match my 4 year old Kodak DC240. I used the Canon S45 at a birthday party and the faces of the people were often dark, slightly fuzzy, and not clear. With the old kodak the faces of the people were still bright even outdoors at night. That is why I am so disappointed with the Canon, because under low level light conditions, it doesn't even perform better than a 4 year old Kodak digital camera. Also, I found the controls less intuitive than on Sony and Kodak cameras. Overall, a big disappointment when indoors.", "Date": "October 9, 2003"}, {"Title": "Excellent Camera", "Author": "Mary Quirk", "ReviewID": "R11UYF5MMDPOAG", "Overall": "5.0", "Content": "This is an excellent point and shoot camera with many many features.  Shooting is smooth and quick, and review and erase are very easy.  Changing feature are also very simple.  love this camera  If there is a \"con\" is that it is slightly heavy and thick, but it has lots of features.", "Date": "August 21, 2003"}, {"Title": "Excellent Camera", "Author": "Mary Quirk", "ReviewID": "R2DYTUOX2OQ5YX", "Overall": "5.0", "Content": "This is an excellent point and shoot camera with many many features.  Shooting is smooth and quick, and review and erase are very easy.  Changing feature are also very simple.  love this camera  If there is a \"con\" is that it is slightly heavy and thick, but it has lots of features.", "Date": "August 21, 2003"}, {"Title": "Great for beginners and advanced users", "Author": null, "ReviewID": "R11CLNFZPSP873", "Overall": "5.0", "Content": "This is my first digital camera but I consider myself an advanced user because I am a graphic designer who works a lot with SLRs and in Photoshop. I tried out almost every single feature on this camera in the first 5 days I had it. I am very impressed. I am very picky about image quality and resolution, and I would not take shots with anything less than 4 megapixel resolution, because I would notice the pixels in the printouts immediately. In my opinion, this camera does great for prints up to 5 x 7, which is all one usually needs. The movie mode is excellent, and I was able to hook up the camera to my VCR, set it to slide show, and record the images and movies I wanted to videotape. Even on videotape, the movie and sound quality is still quite good, almost like from a regular home video recorder.I am very pleased. Unfortunately after 5 days, I dropped the camera onto a hard tile floor. It continued to function, but soon I found out that the lightmeter was way off, so I had to send it to Canon for costly repair...It needed a new optical unit.Digital cameras are much more fragile than SLRs, but this one is remarkably sturdy. I just can't think of anything bad to say about it.", "Date": "February 21, 2003"}, {"Title": "Excellent camera", "Author": "\"kmex\"", "ReviewID": "R1MFLVC1NEBMPE", "Overall": "5.0", "Content": "Aloha thereBought this camera before Xmas here in the UK and have found that the camera is working perfect. This is my first digital camemra and I like it. I especially like the video recording that it can do. It's quite good. I have not yet learned all the fuctions of the camera, but so far it's been very good. I have researched for 3 month on digital camera's before I decided it should be this camera. I like the Ixus, but thought that there must be something else, so I used \"consumer website\" to understand what to look for in a digital camera. I also bought a 256 mb CF card from crucial.com. It works perfectly. The only thing I have for this camera is the battery time. Another reason why i bought it was becuase you can dive with it and that is so cool. Imagine Thailand...Anyway, I can recomend it.", "Date": "January 4, 2003"}, {"Title": "A cool digital", "Author": "Denis J. EVANS", "ReviewID": "R2DAZ97O00O6H2", "Overall": "5.0", "Content": "Jan 2003: My second digital. Had the S45 for 2 months. It is really excellent. Indoor flash doesn't seem to be a problem. Only problem so far is low light focussing in the telephoto mode. It should default to infinity if it can't really see anything. However it doesn't seem to do this. Now I have read the manual - I believe I've sorted this out - MF manual focus needs to be invoked. Will report later.Is wonderful in all other conditions so far. However, none of these compact digitals can rival an SLR - yet!Mar 2003: The focussing problem I discussed above has now been corrected by Canon. See:PowerShot S45 Firmware Update Corrects the incompatibility with certain computers that caused occasional errors in transmitting data from the computer to the camera- Corrects the occasional AF errors when using Active Frame Control / FlexiZone AF.I have tested the upgraded camera and the focussing problem really is fixed! With  v1.0.2.0, this camera is now just about perfect. The \"set\" button is the only remaining problem.  However, you can learn to use that button.", "Date": "January 4, 2003"}, {"Title": "We tested the durability", "Author": "LCTK \"lctk\"", "ReviewID": "R2OWQISK2I22TE", "Overall": "5.0", "Content": "We are a clutzy family and this camera has been dropped multiple times onto concrete or asphalt pavement.  The camera is covered in dents and scratches.  The shutter cover barely slides closed because it's so bent, but THE CAMERA STILL WORKS PERFECTLY.  We've had it for about 2 years.  Of course I wouldn't guarantee the same luck to others.  Best wishes!", "Date": "March 28, 2005"}, {"Title": "Cool features and good looks", "Author": "Sanjay S. Melinamani \"Sanjay\"", "ReviewID": "RO4H8H2ANKJ0B", "Overall": "5.0", "Content": "I had decided to buy the S40 but when this things came out, I just decided to go with this as it is definetely better than S40. More to say much better than sony equivalent. Why pay more for sony when u can get much better & great  camera as this one.", "Date": "May 17, 2003"}, {"Title": "Excelent camera but with few issues", "Author": "Amazon Customer \"madsharma\"", "ReviewID": "R1GL4L60NWYS3T", "Overall": "4.0", "Content": "I have this camera for couple of weeks now and have taken more than 100 pictures. It is an excellent camera, though I have not taken prints yet, but I have seen pictures on TV & computer. Takes excelent movie. Whatever people are saying in the praise are 100% correct. So Why 4 stars??? There are few issues that I have encountered so far, which may not be of any importance to you, but are to me:1. It does not imprint Date on the picture. You can get the date printed on the prints, but that is possible through Canon's ZoomBrowser EX program. which means you need to buy a photo printer also.2. When viewing picture, you can zoom into the picture, but can not take a snapshot of any region. You can do this using any software, but that is an extra headache.I have seen Sony's DSC-P9, and it does both and is also an excellent camera.", "Date": "February 19, 2003"}, {"Title": "Mediocre indoor pics, too big, too expensive.", "Author": "Eddie", "ReviewID": "RRC9OPA166OOG", "Overall": "3.0", "Content": "First of all, I think too many people shopping for digital cameras get obsessed with megapixels and forget what really make the pictures look good. What is important when buying a digital camera is the lens, and the CCD (charge-coupled device) that detects the light. This is particularly important since almost all digital cameras don't do well in low light conditions, including this one. The are lots of chips inside that determine how the picture will look that you can't compare with other cameras unless you use the other cameras. For more information on how digital cameras work go to [...]I have used this camera extensively, mostly in auto mode where I made little adjustments, and I have noticed that the indoor pictures and outdoor night shots are mediocre if not poor. This is especially apparently when compared with the Sony DSC P10, which I also own. The Canon S45 outdoor pics are spectacular, but I am truely disappointed with the indoor shots. In fact, the Sony P10 is a 5 megapixel and it is smaller and lighter. In addition, you have to slide a cover open to turn on the camera, and eventually the cover gets loose after frequent use and just sort of slides open on its own.Also for some reason, this camera gets a little bit too warm after using it for extended periods of time, I don't know why.I also think it's awkward how the play back button is more of a sliding button you hold down instead of on the dial, I think it is a bit more intutive on the Sony. Canon may have a great history of making good lenses, but the electronics in the Sony outdo this Canon.Overall, the Sony takes better indoor pictures, is smaller, lighter, 5 megapixel and cheaper. This isn't a bad camera, it's just the Sony outdoes it in almost every way.", "Date": "December 9, 2003"}, {"Title": "Great Camera", "Author": null, "ReviewID": "R1AD97K4BXXBEC", "Overall": "5.0", "Content": "This camera is great for people who want to be  able to take easy photos in auto mode, but would like to be able to manually chage the aperature.  I got excellent results with this camera. I love it!", "Date": "June 21, 2003"}, {"Title": "A Lot of Camera", "Author": null, "ReviewID": "R2JHC1O17ZDJGT", "Overall": "4.0", "Content": "Been using the S45 for 3 months now. Great picture quality and relatively easy to get started and use. A bit heavier than I would like and I hate the lens cover. Should have a regular on and off switch and a more reliable lens cover. I haven't used the software that comes with the camera. Just using a card reader with XP and a graphics program I was already using. Overall I am happy with the camera.", "Date": "June 13, 2003"}, {"Title": "A Good first time digital camera", "Author": "Bethany A. Muhvic \"Mom of Four\"", "ReviewID": "RSH31IVXZCIC7", "Overall": "4.0", "Content": "This has been a great 1st camera - easy to use but the biggest complaint is that no matter what setting you use - it is not good at removing red eye. The other feature it lacks is that you cannot print the date on the photo, that has to be done by a printer with that option.  If you don't want to have to edit every photo and have the date stamped on it, this is not the camera for you.  Otherwise, it takes nice clear shot and it's great to travel with as it has a good zoom. I have had it 3 years and no mechanical problems at all even though it has been dropped a couple times.", "Date": "March 12, 2007"}, {"Title": "Excellent camera", "Author": "\"kmex\"", "ReviewID": "R4WFIQBBZQ0VU", "Overall": "5.0", "Content": "Aloha thereBought this camera before Xmas here in the UK and have found that the camera is working perfect. This is my first digital camemra and I like it. I especially like the video recording that it can do. It's quite good. I have not yet learned all the fuctions of the camera, but so far it's been very good. I have researched for 3 month on digital camera's before I decided it should be this camera... I also bought a 256 mb CF card from crucial.com. It works perfectly. The only thing I have for this camera is the battery time. Another reason why i bought it was becuase you can dive with it and that is so cool. Imagine Thailand...Anyway, I can recomend it.", "Date": "January 4, 2003"}, {"Title": "for vidyakonda", "Author": "S. Patil", "ReviewID": "R2NV1YVGGL5WFP", "Overall": "5.0", "Content": "vidya, For night shots the light is let in for a longer duration and any movement during that period blurs the picture.try using a tripod when taking night pictures. if you cannot/dont want to use a tripod try using the camera in the timer mode where the picture is taken after a small interval of time ( i think the interval is programmable ) . Normally when we depress the button to take a picture we tend to shake the camera a bit. using the timer will minimize that. i hope this works for you", "Date": "March 10, 2004"}, {"Title": "Not the Canon I've come to expect", "Author": null, "ReviewID": "RBAKOJW21N8EU", "Overall": "2.0", "Content": "The overall picture quality is good.  However, picture quality in dark or poorly lighted environment is not consistent.  Major disappointment is Canon support.  I was unable to upgrade the camera with the latest firmware from Canon website.  When contacted, Canon replied with \"sorry, we do not offer any support with firmware upgrade\".  Definitely not the Canon support nor product quality I expected.", "Date": "October 20, 2003"}, {"Title": "Great camera!", "Author": null, "ReviewID": "R16LM726DLYBSA", "Overall": "5.0", "Content": "A terrific camera for someone of really want to take great pictures.  A little confusing at first...as are most digitals, but the photos are great.  On my second session, I took a picture worthy of a magazine!", "Date": "July 7, 2003"}, {"Title": "photo", "Author": "Rafael Perales", "ReviewID": "R2WSG5JZH3JEP2", "Overall": "1.0", "Content": "I never recieved the camera that I purchase. There no explanation why the seller send me the camera.", "Date": "June 29, 2009"}, {"Title": "worth it", "Author": "Vid \"vidyakonda\"", "ReviewID": "R3L0DV0515GG82", "Overall": "4.0", "Content": "Its a good deal for that price but I have some difficulty in taking night shots. Basically, what ever picture I take in the night shot, they will be blurred. Anyone has got any idea to rectify or improve the condition for the same.", "Date": "February 28, 2004"}, {"Title": "Overpriced, too big, mediocre quality", "Author": "Eddie", "ReviewID": "R17KGIXM46Z602", "Overall": "3.0", "Content": "(...) Not only is it bulky, but it is heavy, and far too awkward to fit into a pocket. As far as the image quality goes, the outdoor pictures are beautiful as I had high expectations for this camera, BUT the indoor pictures were mediocre and somewhat unsatisfactory. (...) I used the Canon S45 at a birthday party and the faces of the people were often dark, slightly fuzzy, and not clear. (...) That is why I am so disappointed with the Canon, because under low level light conditions, it doesn't even perform better than a (...) Overall, a big disappointment when indoors.", "Date": "October 9, 2003"}, {"Title": "echo the praise", "Author": "James R Fuller", "ReviewID": "R1SB3RZGIXVLZ4", "Overall": "4.0", "Content": "of this camera, I bought it for a amatuer photographer, and she said she loved it...", "Date": "July 8, 2003"}, {"Title": "What's wrong with my S45??!!", "Author": null, "ReviewID": "R13TC161T892CW", "Overall": "1.0", "Content": "After all my research, and after using my S45 successfully for almost five months, I have to give it the lowest possible rating of 1 star because it is DEAD.  Something has happened to make it absolutely inoperable.  I open the lens cover: the lens doesn't move.  I try to turn it on by sliding the power lever: nothing.  I searched through all the reviews to find a clue  to the problem: nothing.  I am left with sending it back to \"Customer Support\".  (Do you think I'll ever see my S45 again????)I have taken special care of my S45, and protected it in a camera bag inside an insulated bag.  I have two batteries (a backup, to provide power for extended use), and three cards of varying storage quantities.  I have a card reader, so the camera itself has never been connected to my computer.I emailed a friend who also has an S45, and he said he has no explanation for the failure of my S45, and he has none for the failure of HIS.  (Though he gloats that he used his longer than I used mine!)  I am sad that my $450-plus camera served me for only five months.  If you have any suggestions for me, I would appreciate it.", "Date": "December 30, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "4-megapixel sensor captures 2,272 x 1,704 images for photo-quality prints up to 11 x 14 inches\n3x optical (plus 3.6x digital) zoom lens with autofocus\nIncluded 32 MB CompactFlash card holds approximately 27 images at default resolution; camera is Microdrive compatible\nConnects with Macs and PCs via USB port\nUses proprietary NB-2L lithium-ion rechargeable battery (included)", "Name": "Canon PowerShot S45 4MP Digital Camera w/ 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41MSBD1FWKL._SX300_.jpg", "ProductID": "B00007F8UQ"}}