{"Reviews": [{"Title": "Worked for about two hours, then died.", "Author": "J. Doyle \"Power User\"", "ReviewID": "R3Q9QTE8IO49RP", "Overall": "1.0", "Content": "This worked a few minutes at a time for about 4 test sessions (I planned to use it inside, for a podcast solution)...didn't come back up the 5th time I looked.  It had been plugged in the whole time, and certainly should not have died within a week.I do have other Swann similar products that have worked well for me...this isn't one of them.", "Date": "July 16, 2010"}, {"Title": "Not CCD", "Author": "plokiju", "ReviewID": "R3JDVIQ0MH62DN", "Overall": "2.0", "Content": "The manual specifies this as an SSC Technology Sensor.Pros:Zoom lensfairly smallcontains all the cables, and adapters you needgood resolutionnice color imageCons:does not work with IR lightsdifficult to installSlightly blurry focusYou'll need to have a handheld tv, so that you can adjust the lens during installation. The image goes out of focus every time you change the focal length (zoom). It's a bit difficult to get a crystal clear focus. For one thing, the focus changes at the slightest turn of the knob. Also, objects 50 ft away look fairly clear, but objects 10 feet away look out of focus.I had trouble getting a tight installation. Even after tightening everything to the max, the mount keeps jiggling.The lack of IR sensitivity means it's useless as a security camera. I have the propery flooded with IR lights, so I don't need LEDs on the camera. That's why I purchased this unit. Unfortunately, I can only use this as a daylight only security camera.", "Date": "December 5, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "CCD Hi-Res Sensor produces up to 420 TVL of resolution\n57 Ft. of A/V Cable included\n3.5 MM to 8MM vari0focal zom lens included\nConnects easily to TV, VCR, DVR, Monitor, or Quad Processor\nRobust metal casing and professional design", "Name": "Swann Professional CCD HD420 Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/31DXSQlKS8L._SX300_.jpg", "ProductID": "B000OH58ZG"}}