{"Reviews": [{"Title": "Awesome little camera!", "Author": "Photo Mom", "ReviewID": "R2W2G315HH9Q5N", "Overall": "5.0", "Content": "I am by no means a camera expert.  I am a mother of two kids that wanted a quality camera to catch all the \"photo\" moments.  That meant it needed to be small and lightweight enough to carry around, start quickly so not to miss the shot, and above all, give me a clear picture.This camera has done all of that plus!  This is my third digital camera and by far the best.  The pictures are exceptionally clear, complete photo quality!  The buit in red eye reduction is a wonderful feature as I  like to print directly from the camera to a personal photo printer.  My husband was amazed at the quality of the pictures from this camera.I won't get into all of the features of the camera as most people do not use them, but there are plenty.  It's very easy to change settings on the camera as you become more familiar with it and may want to use specific settings.The camera has a very sturdy feel to it in hand, and has proven pretty durable since I carry it everywhere in my purse and it takes the beating my bag does.If I had to say anything negative it would be that you have to remove the battery for charging.  This is not necessarily a negative, just not what I am used to doing.Again, I am no expert, just a mom with some great photos of the kids!", "Date": "August 17, 2004"}, {"Title": "wonderful", "Author": "scott baxter", "ReviewID": "R1UC9MF6FC9JKV", "Overall": "5.0", "Content": "The camera has a very nice size -- fits equally well in my shirt pocket and in my hand -- and weight. The built in red eye reduction for portrait photography works well.Don't bother with the picture project software; picasa picasa dot com (for windows) or iPhoto (for Mac) are transcendally better.After an hour with the manual you will love this camera.", "Date": "October 13, 2004"}, {"Title": "very compact and good quality", "Author": null, "ReviewID": "R371BGWNYZZ2B9", "Overall": "5.0", "Content": "It is barely larger than a credit card and about 1.5 inch thick. It is a metal case but it is very light weight. Picture quality is good and the shutter response time is reasonable in normal light condition. The product description here is incorrect about the movie mode. It can record movie with audio. The quality is good but it is in QuickTime format. That means you cannot play it with Microsoft media player. It is a little inconvenient. But the quicktime file (.mov) is a lot smaller than the microsoft video clip format (.avi). A file of 30 second clip with medium quality is only about 9M. The software comes with the camera is not very useful. The file transfer using this software is slow. I usually pull out the SD card and copy the file to the computer using a card reader.", "Date": "June 25, 2004"}, {"Title": "Excellent party/trip camera", "Author": "Greg Wallace", "ReviewID": "R2KZFVWRAVR9DE", "Overall": "5.0", "Content": "I have used a professional quality 35mm camera for the last 20 years.  Was in no hurry to buy a digital camera.  Either the quality was not good enough or it required a mortgage.  My equipment was fine for making art quality pictures, but too cumbersome for parties and trips.  This camera is the size of a credit card and still feels good in your hand.  You don't worry about dropping it.  The print quality is excellent.  Easy to use.  I highly recommend it.  Would suggest buying the extra battery and camera case.  There is very little warning when your battery is low.  Looked at the Cannon cameras and found them too bulky for my shirt pocket and not easy to use.  The zoom control on Canon's cameras is terrible.", "Date": "November 20, 2004"}, {"Title": "Easy to use, slight on pic quality", "Author": "J. Piotrowski", "ReviewID": "R1IZ2UWV5NNISI", "Overall": "4.0", "Content": "Don't get me wrong. I love this camera. It is compact, easy to use and looks really cool. The menus are VERY intuitive. I didn't even have to open up the manuel to figure out all the functions. This is good for when other people use my camera b/c I don't have to explain everything to them. I can also operate the camera w/ one hand. I stis comfortable in my hand adn pocket too. All the auto options are nice, however you can't change alot of stuff manually, so if you are really into do-it yourself photos this isn't for you. If you want to the camera to do most of yoru thinking, the Nikon rocks. I haven't been super thrilled w/ the quality of the photos but then again I haven't been trying that hard to get good pics. The software that comes w/ the camera is really good though and the auto redlight removal built into the camera works great.Best function: continous mode (you can take 16 frames in a row w/ no reload time) great for action shots like football or track.Worst part: has a harder time focusing when the flash is turned off.I like it, but at $50 more than the Canon Elph S410 it's up to you if the ease of use is worth it.", "Date": "October 11, 2004"}, {"Title": "Great Camera For Close Ups!", "Author": "A. Parker", "ReviewID": "R9E8YYM3EEG7Q", "Overall": "4.0", "Content": "One of the reasons I purchased this camera was for the ease of taking close-up photos. There are \"macro\" options easily accessed without a struggle on this nifty tiny, and I mean tiny camera. (Don't let the above specification shot fool you. This camera will fit in your shirt pocket.)If you don't like \"small\" cameras, this is not for you. The access to all options on this camera are easy. The dial on the top allows you to change the menu. Then, press the menu button under the screen and make any changes you so desire. The number of options you have with this camera are only limited by your imagination.  I wish I could paste a picture of one of my fish tanks here to give you an example of the close-up detail. The difference from my previous camera is incredible. The auto-focus was a little confusing at first. It does so much auto-focusing, the picture looks a little blurry on the screen, when you push the button down half-way. Then the image becomes clear. You can turn this feature off. The only real drawback is the battery pack. It's an expensive one. Keep an extra on hand. At least there's an energy saving feature. The default is 60 seconds, which is good for saving the battery, but bad for setting up a shot. You can alter the length of time for the energy saving feature, too. In fact, I think you can alter just about any feature on this camera, except the size, the batteries, and the memory it requires!(Also figure into the cost of this camera a secure digital memory card.)", "Date": "March 12, 2005"}, {"Title": "Good photos, problem with battery door", "Author": "mbj", "ReviewID": "R24OQTAUBVVYBM", "Overall": "3.0", "Content": "This was a decent little camera for it's time.  By today's standards it's a bit bulky for the megapixils it offers.  There is a design problem with the battery cover / door.  It's on the bottom corner of the camera and spring-tensioned.  It is pushed down and slid it into a locked position, held by little plastic tabs.  These tabs break off easly, leaving the battery door hanging partially open.  The camera still works, though you may have to use your pinky to tension the battery door.  When travelling we've bumped into a number of people at tourist spots with the same camera.  Most have broken battery doors.  I like the photos it takes, but this flaw that would prevent me from buying it again.", "Date": "July 18, 2007"}, {"Title": "best little camera on the market!", "Author": "B. Renlund", "ReviewID": "R3UXNUR0XBXC", "Overall": "5.0", "Content": "After 8 months with the Nikon Coolpix 4200, I am convinced I could not have found a better camera.  Photos are as good as any I would hope for.  The auto point and shoot setting has yet to disappoint me, and yet the options for special situations let me make the images I want, easily-- from macro mode all the way to photographing the northern lights.  Menus are a snap to use and intuitively arranged, the camera \"fits\" my hand, buttons are where I expect to find them.  The LCD screen shows clear and crisp images that let me know immediately whether I have the picture I want, or should try again.  And presto, a quick cable connection, and everything loads into iPhoto in no time.  -- Hooked, I keep looking at other similar models, and am convinced this is the one I'm happy to have with me.", "Date": "February 18, 2005"}, {"Title": "Good Camera", "Author": "Radiofreeq \"Radiofreeq\"", "ReviewID": "R2FLPIW6NCM5XP", "Overall": "4.0", "Content": "Very good camera but I feel one needs to be a little bit pro in operating this camera. Auto mode doesn't always work good. The SCENE-> Indoor/party mode was good when taking pictures indoors and under light.Few photographs still had some red eye. I think Nikon claims that this is the first camera with inbuilt red-eye reduction. Though red-eye is not eliminated in all the snaps, most of the snaps didn't had any red-eye and they really look great. Also, most of the snaps are shaken probably due to the manual movements while taking the picture. But all the photographs taken using a tripod weren't shaken and are really good.The camera performed very good in pitch dark.Except for the automode which was not working well (when compared to SCENE->INDOOR mode)everything in this small package is great. I really like this camera very much. I had a Kodak DX series before in which the auto mode was very decent and works well indoors and outdoors. And thats probably why I feel the auto mode is bad.Finally, I would say this is a great camera. I would have given 5*'s but due to auto mode, I will have to cut one.", "Date": "January 16, 2005"}, {"Title": "Long Time Owner", "Author": "T. Bottenhorn \"Maddie\"", "ReviewID": "R2TZQTXTYLHXE2", "Overall": "3.0", "Content": "OK, I have had this little camera for two years now and here is what I think:Pros:Good shooting ModesQuality PrintsPlenty of Options for PicturesFast on and OffGood FocusNot Battery powered (yes, this is a pro, cameras EAT batteries)Cons:View screen is too small to be very usefulVideo quality not greatZoom a little underpoweredMenus a bit confusing (even after a couple of years)Overall: A good first camera. When a twelve-year-old begs for a digital camera, this is the one for them! Not for experienced photographers, but it does well enough for day-to-day uses. Great value for the money!", "Date": "December 17, 2007"}, {"Title": "Excellent VALUE .  Easy to use.  Excellent manual.", "Author": "Kersi Von Zerububbel \"Kersi\"", "ReviewID": "R398R0MFQ1KQGM", "Overall": "4.0", "Content": "This is my second digital camera and it is great.  Within about 15 minutes of opening the box I was up and running.  The manual and the Quick Start guide are great.  The color is good.  There is no irritating delay between clicking and the time the picture takes.  This was a big pain in my first digital.  The red eye compensation actually works EXCEPT if the background is orange or red and the flash starts up.  But any of the commonly used picture software packages can readily handle this problem.The movie mode is good provided you have the memory.  The camera comes with one battery but you MUST have a spare specially if you are going to shoot movies.There are a few areas that can use improvement.  These are:01.  You can store only about 10 pics in memory.  So it would  have been good if Nikon included a SDK memory card.02.  Installing and removing the battery is awkward because  in doing so one has to be careful not to press the click  button.  But then something has to give if you want a  small sized camera.03.  The screen size is 1.5\" a 2.0\" size would have been great.All in all though for the price this is a great value.", "Date": "May 18, 2005"}, {"Title": "Replacing my poor beat up camera", "Author": "Y. Olsgaard", "ReviewID": "R2PXQ21I87A76X", "Overall": "5.0", "Content": "This is a replacement for a product that I have used to death in my travels to Europe and Japan.  It's an excellent camera that I purchased for taking photos of artifacts in museums up close... and flowers... not to mention the usual scenery shots.  Great lens, easy to understand settings.  I do recommend that you NOT drop the camera in Trafalgar Square or spill Coke on the lens cover (the old one used to stick because of it).  Despite all my abuse, the old version still worked but the battery door no longer closes and the battery falls out, so when I saw this deal, I just HAD to get it.  It's like my love affair with the 1980 Honda Accord Hatchback- I bought 3 because I loved that particular model so much.  The new camera is perfect. This will make a great gift for my relatives who are gadget-averse but want a digital camera.", "Date": "July 17, 2009"}, {"Title": "Excellent Camera", "Author": "Gabriel de Leon \"Gabriel\"", "ReviewID": "R1TUAPQTBZOFQ1", "Overall": "5.0", "Content": "I bought this camera back in 2004 and since, I have taken thousands of great pictures. It is very easy to use and the quality of the pictures is excellent. It's life has come to a sad end as my 4 and 6 year olders started getting interested in using it. But If we were back in the 2004/2005 time frame I would buy exactly the same camera again. If you are interested in this camera model just make sure you carry an extra battery as a back up.", "Date": "May 29, 2009"}, {"Title": "Great Camera but problem with the battery door.", "Author": "Armando Diaz Salazar \"ADS67\"", "ReviewID": "R27EEUHTWDFFY0", "Overall": "4.0", "Content": "I love this camera, I have owned it for about two years when it first came out. The pictures are of great quality, and have used some of the special modes and have obtained professional photography results, even though I am just an amateur. The red-eye fix is very helpful.  The external metal casing has been durable and scratch resistant.My only drawback is the battery door.  A little tab broke off and I have had to tape the lid to the bottom of the camera.  The  camera works fine, but it just does not feel or look fine now.  Which has me now looking for a new one!", "Date": "September 16, 2007"}, {"Title": "Mediocre Digital Camera", "Author": "DharmaBum \"DharmaBum\"", "ReviewID": "R3MH9EM1GKCSYG", "Overall": "3.0", "Content": "I've had this camera for about a year.  I normally shoot with a 35mm SLR, but purchased this camera for informal, point-and-shoot gatherings and occasions when I didn't want to hassle with a large camera.Benefits:1. It's extremely small and handy to carry around in your pocket or purse for birthday parties and outings.2. It's durable and has survived repeated droppings.3. The pictures are sharp and crisp when properly focused.Drawbacks:1. The flash is blindingly bright.  Whenever you use it, prepare for your subjects to look like they've got a 2,000-watt white spotlight shining on them like crime scene photographs, and the background will fade to nearly black.  When used in indoor settings like restaurants, the brightness of the flash is just ridiculous.  Think \"mug shot.\"2.  Camera shake/blur.  When the flash is not in use and you're indoors, it's very difficult to get a clear shot with this camera.  The problem with the flash has led me to try to avoid using it altogether so that I can get better color and even light, which means I've had a problem with camera shake/blur in low-light conditions.  For example, with the flash turned off it takes multiple attempts to get a blur-free shot in my living room, even in the middle of the day with the window blinds open.4.  The removeable battery.  You have to take the battery out of the camera to charge it, by inserting it in the battery charger that is provided.  This seems like an unnecessary extra step to me.  Why not just design it so that you can plug the charger directly into the camera like other digital point-and-shoots?For casual photographer who will be shooting mostly outdoors and desires a very portable, durable camera, this camera will work for you.But if you will be shooting mainly indoors or with flash, avoid this camera.I recommend the Kodak EasyShare series as a good alternative.  I don't own one, but I've been impressed with the quality of low-light pictures (indoors) that these cameras produce.", "Date": "January 20, 2007"}, {"Title": "nikon 4200", "Author": "stack", "ReviewID": "RQJ7D3DW0TG3T", "Overall": "5.0", "Content": "the camera was sent promptly,, well packed, and arrived inexcellent condition. everything wasas described by the seller.. the camera is in excellent condition' asare the accessories. thisis a 5 star seller..", "Date": "November 16, 2011"}, {"Title": "Nikon coolpix 4200", "Author": "R. A. Stodola", "ReviewID": "R1YZA4IROGOG1I", "Overall": "5.0", "Content": "Very nice camera for the price.  My place of employment bought one a couple years back for almost $400.  Now their down to $119.  Takes very nice close ups.  Easy to use.  Very happy with it.", "Date": "November 11, 2006"}, {"Title": "great camera! =)", "Author": "ichaBuNni", "ReviewID": "R11CBT2VIWJGIK", "Overall": "5.0", "Content": "i love this camera! i have had it for a year or so. perfect size, great picture quality, very easy to use and durable (i dropped it once or twice before). great battery life too! i charge it maybe once every other week, but it's probably because i don't use this camera too often. highly recommended!", "Date": "August 8, 2006"}, {"Title": "Nice little camera", "Author": "R. Nation", "ReviewID": "R2XWYYYCW52C90", "Overall": "4.0", "Content": "Found this camera on closeout at Sears new for 86.00, am pleased with the quality and functions, 4 mp is plenty for your average user, red eye works good.  I was uncertain about the rechargable battery, It's always been easier to slip in a couple extra AA's when needed but we'll see.  Some of these batteries have been recalled so check it out on the Nikon website.The screen size could be a bit bigger, but is fine for me.  If you have poor eyesite, go with a bigger screen.All in all I like this camera and would recommend it highly.", "Date": "August 6, 2006"}, {"Title": "Great \"Step-up or Step-down\" Digital Camera", "Author": "S. Michael", "ReviewID": "R15WCXY5COHKC", "Overall": "5.0", "Content": "I have a Canon EOS Rebel SLR Digital Camera with all the quality and flexibility that this sort of camera entails...but for being able to take family pictures w/o sacrificing all manual control, the 4200 is it.  The price, 4MP, auto redeye reduction, optical zoom, light-weight and small size make it the handiest pocket camera (that can still give you nice picture quality) I have even seen.  One word of advice, as with any digital camera, you need a FAST memory card like the Sandisk Ultra II, if you don't want to w**a**i**t between shots.", "Date": "April 9, 2005"}, {"Title": "STAY AWAY FROM THIS CAMERA!", "Author": "buglady101", "ReviewID": "R2KXP7T8MAB9FY", "Overall": "1.0", "Content": "The title is a bit dramatic, but it is mostly true.  I purchased this camera because of its size and value and was pretty much disappointed on all accounts. There are a number of problems with this camera.1. The knob to change settings is very sensitive and if you dont check every time, you may not be in the right mode. Just putting it in the case changed my settings frequently.2. The lag between pressing the shutter button and when it takes a photo is ridiculous. I have a 3 year old, and this camera just isnt good for action or spontaneous shots. It's like old-time photos where you had to sit there completely still for a minute or two for the photo to take...3. The lag between photo shots is even worse, regardless of the size of your memory. There is no way you can take more than one ACCURATE shot of good quality in 20 seconds.  I was truly disappointed and upset with this problem in particular.4. Battery life. The camera uses 2AA batteries which under normal circumstances, should last several months at least. This camera sucks the life out of those batteries. It might have something to do with the sensitive knob being shifted, but regardless, I was having to change batteries whenever I decided to use the camera because the batteries were always low or dead.The problem is that the camera seemed fine at first, and within a month, began having those issues.Nikon's newer brand of cameras seem to have dealt with these issues, so you might be better off trying a newer model.", "Date": "February 19, 2006"}, {"Title": "Blury inside pics", "Author": "Greg Polsky", "ReviewID": "RVDRYOAZGRGXG", "Overall": "2.0", "Content": "Camera did not take good pictures indoor or outdoor, a bit blury (set to Auto of course)and yes my hand was still.Delay lag is a bit long although Nikon claims that its quick (still takes long to autofocus and then snap the shot)Bit the bullet and spent twice as much on Canon G6 and MUCH BETTER, you get what you pay for.  Couple hundred more at 900 you can get Rebel G but its quite big and plastic.  Liked the feel of the G6, metal, and takes great pics.", "Date": "October 20, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Nikon Coolpix 4200 4MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41S7W4098ML._SX300_.jpg", "ProductID": "B0002805TQ"}}