{"Reviews": [{"Title": "Priced right, compact (pocket-sized), uses AA batteries", "Author": "TJ Hock", "ReviewID": "R2EWJOZA04OCPX", "Overall": "4.0", "Content": "I bought this camera (Canon A460) as a second camera and was looking for a pocket-sized, compact, digital camera that had zoom and video capabilities, took AA batteries and priced reasonably cheap [...] The Canon Powershot A460 is all that.It's small enough to fit into your palm and fits into the front pants pocket easily and is light enough that the camera is not really noticeable after a few minutes. It seems to me that Canon designed it to be carried without a camera case because there is a lens shield that pulls into place to cover the lens whenever it is powered off. (The lens retracts into the camera body when it is powered off, and the lens cover pulls into place automatically). The body is well rounded with no sharp edges anywhere that might catch parts of clothing. The LCD screen is exposed but I pasted one of those see-thru LCD screen plastic protectors (sticky on one side) on it to protect it from scratches. All the camera's openings are well protected by covers. The only cover that I thought had a little more play than it should was the battery cover.The camera powers up extremely quickly. You can focus with either the viewfinder or the LCD screen. One thing that surprised me was that when using the viewfinder, there is no information shown on the viewfinder other than a green light to indicate that the camera is in focus or a blinking orange light to indicate it is not. The LCD mode shows a lot more info (eg, ISO speed, current resolution, etc). But, I guess it makes sense since this is a camera that is meant to be simple, and what could be simpler than knowing when something is in focus or not. That's pretty much all the info that's needed. (Switching to the viewfinder will conserve battery power).I bought a 2GB Kingston Secure Digital card for about $13 on Amazon for this camera so there's plenty of space. The card can be removed and put into a SD card reader that comes with most modern computers and laptops. (My laptop, the Toshiba Tecra A5 has it, and it was bought about 2 years ago). The computer will recognize the SD memory card as an extra drive, and the transfer rate is extremely fast. If your computer does not have a SD card reader, then the USB connector can be used to transfer the images to your computer instead.In video mode, the zoom works only when in the highest video resolution (640 x 480). (This was a surprise to me too. On my Canon Powershot S1, the zoom works in all video resolutions). The video is a little more choppy compared to the Canon S1.There is no dedicated zoom lever. Two of the buttons normally used in menu navigation also serve as zoom controls.(The Canon S1 (my other camera) has a dedicated zoom lever, which is nice). I guess, one of the reasons for reusing buttons for zooming is a more compact design--no lever sticking out that might catch your clothing). Once I got used to it, I did not have any problems using the 2 buttons for zooming.The pictures taken are the usual Canon quality. You do have to pay attention to make sure that your hands are not shaking when you press the shutter since there is no image stabilizer (I've gotten spoilt by the Canon Powershot S1 which has a image stabilizer). [...]The buttons on the camera are designed and placed so that you could operate the camera with only the right hand if so desired. The left hand is used just to stabilize and steady the camera.This camera uses a focus beam light that helps it to focus quickly and and has the much lauded Digic II processor. Both are technological improvements over the Canon Powershot S1 which does not have an autofocus light and only has a Digic I processor.The camera uses AA batteries (either the rechargable or the normal type will work). Easily available power was an important feature for me.I was very pleased with the Super Macro capability of this camera, which allows for extreme close ups. To access this mode, you have to set the camera to \"M\" (manual mode) on the dial, and then press the Func/Set button. This will open up a menu where you can set the camera to \"Super Macro\".[...] This camera (Canon A460) has a \"SCN\" mode in which you can choose different scenes (Portrait, Night, Kids, Pets, Indoors, Foliage, Snow, Beach). I've used the \"Snow\" scene setting and my pictures came out great when I'm skiing and taking pictures. (To access the Scene setting, turn the dial to \"SCN\" and then press the Func/Set button, which will bring up a menu that allows you to choose the settings).I'm really enjoying the Canon A460 and it has filled its role in my camera arsenal admirably. I needed a camera that I could take with me when I'm skiing or snowboarding that was light and small and cheap. It fits into my pants pocket and is pretty light that it does not interfere with my balance, etc. (The Canon S1, though a great camera, was a little too large to fit into my pants pocket or in a fanny pack. However, it is still my preferred camera when I'm able to have a camera case or back pack with me.)Update (4/11/2007)--I've had this camera for about 2 months now and have accidentally dropped it twice from about 2 to 3 feet onto a hard surface floor. Also, have dropped it into a foot of snow while skiing and using the video. The camera is still working flawlessly.", "Date": "March 9, 2007"}, {"Title": "Great compact camera", "Author": "Wayne C \"DIYer\"", "ReviewID": "R3CA7H9E2TIBHB", "Overall": "5.0", "Content": "I'll only mention things that I didn't pick up or remember from the other reviews I've read. I also own a 4.0MP Canon A520, so it was easy to choose the same great zoom lens.The A460 does not have the auto-rotate feature to save photos in the appropriate portrait or landscape modes. The battery and SD card are accessed through a common door, which doesn't have quite the snap and tight fit of the A520's smaller separate doors. The handshake symbol also tends to show up often when taking indoor pictures with the flash disabled - something I don't even think about with the A520. The zoom buttons were actually more intuitive to use than I expected. But I do prefer the SET button in the center of the joypad on the A520, as I tend to forget to reach down and to the left for the SET button on the A460.But I'm nit-picking here. Otherwise, it's a great point-and-shoot camera, with a great zoom lens, and at a great price.", "Date": "June 18, 2007"}, {"Title": "Disappointingly noisy images", "Author": "J. Hansell", "ReviewID": "R2U3BLW78DO8U5", "Overall": "3.0", "Content": "I've used a Canon G3 for about 4 years, and have always been pleased with the image quality. I've tested the A460 against it in several situations and can report that:-it's faster - the powerup and shot to shot speed are excellent.-it's easy to learn and use.-it focuses better and quicker in macro mode.-The flash works well and quickly, and creates reasonably pleasing light in a variety of circumstances.-The images in sunlight or reasonably bright cloudy circumstances are fine.BUT - the images at lower light, without flash, are unusably noisy - a major drawback for me as my intended use is to take a small light camera with me on my evening walks and jogs. If low-light photos aren't important to you, it's a fine choice.", "Date": "April 13, 2007"}, {"Title": "Great for the teen", "Author": "D. A. White \"itemwriter\"", "ReviewID": "R2DOFQ8JOTQEV9", "Overall": "4.0", "Content": "We bought this camera for our grand daughter who is turning 15 in July.  She took 200 pictures with it the first week...loves it.  Video is subpar, but expected with a camera this price.  It can handle up to a 2gig SD card, so she has lots of room for the cruise her grandma is taking her on this summer.  If we had to do it again, we would probably move up a notch, to get better video.  But in her case, as fast as video eats memory, maybe we did the right thing after all.  Bottom line, it's great for the money, and Amazon's price beat almost everyone else out.", "Date": "May 24, 2007"}, {"Title": "Great Camera, Bargain Price", "Author": "Parker", "ReviewID": "R319LQPNT62SGH", "Overall": "5.0", "Content": "This is my first digital camera. It can be used on fully automatic settings, fully manual, or a combination of auto and manual.  It's very versatile that way.  I didn't read the user manuals that came with it, I just started using it.  It took me about an hour of shooting and two sets of batteries to figure out all the different options and features it has.  So I'd say the controls are pretty easy to learn and understand.It's pretty easy on batteries, as long as you don't use the flash.  I put some cheaper Rayovac alkaline batteries (size AA) in it after the first set went dead and the camera has no problem with them.  The flash drains the batteries quickly though - I didn't count the number of photos, but I probably only got 20 or 30 flash photos before the \"low battery\" warning started blinking.  But the warning comes early - you can take another 15 or so photos after the low battery warning pops up.  I don't know how many it'll take without the flash, but it's a lot more than when you're using the flash.The upside is that this camera is VERY sensitive to light, so it hardly even needs a flash.  Frankly, as on most compact cameras, the flash sucks.  It's too bright and flattens images.  But if you have decent lighting indoors, the thing is so light sensitive it takes good photos without the flash.  I suppose you'd need the flash if you were taking photos inside someplace dark, like a pub or bar, but in places like houses where there are usually plenty of lights on, it does great without a flash.It'll record up to an hour of video on a 1G SD card, which is great, because it also has a mic that works perfectly so you get good audio too.The photos are great - crystal clear and sharp.  Most cameras come with a 3x optical zoom at this price, but this camera has a 4x optical zoom.  It really helps, especially when you can't simply step closer to your subject for some reason.Here's the one thing I didn't like about this camera.  Out of the box, on the fully auto setting, it takes very bright, sharp, and high contrast photos.  Great, right?  Unless you're taking pictures of people.Few people look their best with their foreheads, cheekbones, and chins highlighted by bright, high contrast photos while their faces are somehow oddly flattened.  But if you play around with the manual exposure and color settings, you can pretty easily set it right so it takes normal looking pictures.  And because you can adjust only those setting you want to change, you can still benefit from the auto features you want to use.  Once I found the settings I liked, I left it that way and the camera remembers them, so it's still a point and shoot camera, but with my customized settings.It seems very sturdy, much more so than many of the cameras I looked at in stores before buying this one.  It's too heavy to carry in your shirt pocket, but it's no problem in a cargo pocket or in your pants pocket if you're wearing pants with big pockets.I think this is a high quality, versatile camera at a great price.  It's great in almost every way, but just be aware that there's a bit of a learning curve at the outset to find the combination of settings that'll allow you to produce more \"natural\" looking photos if that's important to you.", "Date": "July 17, 2007"}, {"Title": "Canon Digital Camera 460 (4mp Zoom)", "Author": "Arcadia", "ReviewID": "R29INPCD79DJ6", "Overall": "5.0", "Content": "This camera was purchased for a eleven year old as a middle school graduation gift.  She adores it.  The camera has held up to constant use, battery life is good.  The camera is simple and easy to use.  We also purchased a Kingston 2GB SD card so that the movie function on the camera could be used.  Also purchased a flash reader so that the photos could be uploaded to the computer without connecting the camera directly (saves on batteries).  This camera was such an excellent price for the quality and ease of use that we just purchased the same camera again with the Kingston 2GB card and flash reader.  This time, it was a birthday gift for a twelve year old.  We have no complaints - the product is a good product for the price.  P.S.  If you purchase the SD card and reader at Best Buy, you will pay nearly double the cost that you will pay through Digital Media Source.", "Date": "August 9, 2007"}, {"Title": "Best Camera for Research", "Author": "Diva Pearl", "ReviewID": "R2N8VSCXKD2LU8", "Overall": "5.0", "Content": "I love this camera! I am not a professional photographer, however, I love taking pictures and being able to send them to my mom from school. This summer, I was involved in research with my professor. I needed a good digital camera that was able to provide quality images for poster and oral presentations. My images were quite vivid and clear in my powerpoint presentations as well as the appearance on my poster! It was great! Also, the video half of my camera is the bomb!... The sound is all there as well as the picture quality... Once again, a great camera! I love my camera and I take it everywhere I go... Only downside... You'll have to by a large memory card because the one it comes with only allows 5 to 7 pictures. I bought a SanDisk 2 Gig card and it works beautifully. College students who like simple picture-taking...this is the ideal camera for you!", "Date": "July 25, 2007"}, {"Title": "Best Camera for the Price and Quality", "Author": "E. A Rivera \"smartshopper\"", "ReviewID": "R3HLJJNRIO63C", "Overall": "5.0", "Content": "Pros:Best Price, Simple to use, compact, good zoom, enough pixels(you can adjust the amount of pixels on a photo, which saves memory space), uses 2 AA batteries, great quality photos and movies.You must read the advance user manual guide to get the best of it.I also recomend getting the Canon compact camera case, fits like a glove and feels protective.Cons:Memory card with the package only 16MB(I got a ScanDisk 2GB card from Amazon, very good) and the On/Off button is too close and same side as the shutter that you might accidentaly turn off the camera when taking a picture in a hurry.Other: If you use recargable batteries buy the ones with the highest mAh like NIMH 2500mAh and a worldwide charger (Sony has them)", "Date": "September 4, 2007"}, {"Title": "Good camera", "Author": "Sander Olson", "ReviewID": "R2W6TH2E67Z7L5", "Overall": "5.0", "Content": "Good camera - I experienced no problems with it, and found it easy and straightforward to use. The only negative was the relatively small screen size on the camera which can make viewing images somewhat difficult. Recommended for those who want a simple, easy camera experience.", "Date": "June 10, 2007"}, {"Title": "a good price grabber", "Author": "Louis", "ReviewID": "R2I7X82TRSDU3G", "Overall": "5.0", "Content": "I bought this camera as a tentative substitute for my canon s40. The price was just irresistible and I didn't have a high expectation for this. But, hey, this is a powerful digit cam!1. Overall, the photo is sharp and of good quality. The flash light is powerful, so expect to have some shadows in the background when you take the pic inside. Perhaps a little bit too sharp for my taste (Canon s40 produces much softer pictures, though sometimes blurred), so I tend to change to manual mode for a more smooth lighting. The super macro mode is a pleasant surprise, and the scene mode works pretty well as well.2. You can use this to take video for as long as 1 GB memory!3. It is not a real pocket size digit cam. But it is light and is only slightly noticeable in your kakhi pocket. Not in your jeans though. I have been able to carry this in my pocket during my evening walk and it works perfectly.Overall, for a Canon digit cam with a price like this, surely a good bargain!", "Date": "June 8, 2007"}, {"Title": "great entry level camera", "Author": "Lee Francisco", "ReviewID": "R325LF5JYFP9DM", "Overall": "5.0", "Content": "Looking for an entry level digital camera? Steve's Digicam has a comprehensive review of this camera and calls it one of the best entry level digital cameras. [..]You can't beat Canon for great products and excellent value.", "Date": "May 7, 2007"}, {"Title": "Simple to use, exceptional features for price", "Author": "Lisa Baird", "ReviewID": "R1KD85S148MRXE", "Overall": "5.0", "Content": "My 11 year old daughter did yardwork all spring to earn $$ for a decent digital camera.  We then studied reviews, and found the Canon PowerShot A460.  She has carried and used this camera non-stop for the past month, and it continues to stand up to abuses while taking photos better than my more expensive (older) Canon digital.  She loves it, and is the envy of her  group of 11 year old buddies.  They make movie shorts, take it to the beach and sleepovers, roll under the dog, etc.  The controls are intuitive, and under her own power she's figured out how to attach it to the TV to show off her work to family, download photos to our computer and send them to friends, send images to Costco for processing (with my permission), etc. I love that it used AA batteries.  This wonderful little camera is keeping her entertained and educated all summer.  Oh, and the photos really are amazing.", "Date": "July 6, 2007"}, {"Title": "the best choice for us", "Author": "Lightfoot fan", "ReviewID": "R26N8KWP0HEKL6", "Overall": "5.0", "Content": "We've bought a total of 10 of these little cameras for our school.  So far they have been simply superb.  They are easy to use, use AA batteries of any kind (we bought NiMHs), and produce great pictures.  We shopped the market hard for both price and performance and couldn't be happier with our choice.", "Date": "May 18, 2007"}, {"Title": "great camera for anyone to use and enjoy", "Author": "Joser", "ReviewID": "R1F4J1ZK5OP98H", "Overall": "5.0", "Content": "This is a great camera for anyone to use. Its very simple to set up and use, so even the people who just bought their first digital camera can use it with ease. It also allows you to \"mess around\" with the settings if your a more advanced user. The flash works great. A great feature that this camera has is the option to change the type of picture you want. You can change the settings so you can take still portrait shots, kid & pets shots for moving targets, foliage, beach shots in bright sunlight, take great pics of fireworks, and more. This is a great camera if your a amatuer photographer that just takes pictures at special events for some memories, or if your an advanced photographer looking to take some killer pictures.", "Date": "August 14, 2007"}, {"Title": "Very happy with Canon PowerShot A460", "Author": "Rubybear", "ReviewID": "R3AW33N850QSRI", "Overall": "5.0", "Content": "I would highly recommend this camera to anyone, especially a first-time digital camera owner like me.  Although I know it will take me awhile to learn how to use all the many enhanced features of this camera, it was very easy for me to learn the basic operation of just taking and reviewing ordinary pictures.  The picture quality is fantastic, especially for someone used to using disposable cameras.  I did accidentally delete one picture, but I know what I did wrong, and have learned from that.I almost bought another brand of camera that didn't have a viewfinder, only the LCD screen, and I'm so glad I didn't.  When trying to use the LCD to set up a picture, I find it difficult to focus with my own eyes, especially since I'm a bit older and need bifocals.  With the viewfinder, I only need to put my eye up close, no glasses, and the pictures are a lot easier to take.  I would definitely recommend this camera to senior citizens.  I also love that with one little cord, I can hook the camera up to my TV and view my pictures on the large screen with family.  I am still using the first set of rechargeable batteries, after going on a couple of trips and taking quite a few pictures, plus viewing them, so it isn't a battery hog.I haven't actually printed any pictures yet,  just put them on my computer and made a CD for family, so I don't know about that.  However, I've discovered that each picture seems to be about 1.5 mb in size, so I'm sure that would print a high-quality picture.  (I've yet to learn how to change the resolution of the pictures so I can email a smaller file size version with a dial-up computer.)", "Date": "July 1, 2007"}, {"Title": "Couldn't be better", "Author": "Stan Grupinski \"slotstan\"", "ReviewID": "R29YP35VYW433K", "Overall": "5.0", "Content": "I bought this camera as a birthday present for my 72 year old sister and gave her to it on our trip to Vegas.  She said she wanted a really dumbed-down camera that was as easy to use as a cardboard disposable so she could just \"take pictures\" and not screw with buttons and adjustments. In the auto mode it does just that and takes superb pictures to boot.  It will freeze the water in the fountains at the Bellagio, adjust for the very difficult lighting at the Masquerade Show in the Sky at the Rio and take night-time shots of the strip all crystal clear and with accurate color rendition. I had my much more expensive digital camera with me and found myself wanting to use the Cannon most of the time.  The only problem we had with it was fighting over who was going to use it. Great deal for the money and if pushed to say something negative it would the weight and size being just a bit unwieldy.", "Date": "December 11, 2007"}, {"Title": "Nice and cheap deal", "Author": "Bibhas Biniwale", "ReviewID": "RSGG290E0SMNL", "Overall": "4.0", "Content": "Strengths: Great quality pics; Big LCD screen; Easy to use; AA batteries; Long focal rangeWeaknesses: Not the smallest; Does not have rechargable batteries; Too many lights flash before the actual pic is taken; Tiny viewfinderSummary: (Edited June 08th by babsbini) This is one of the best cameras for beginners in the lower price range. The pic quality is great, and the big LCD screen is bright and well-lit.In spite of the varied features that it has, its easy to use. The handbook is also simple and easy to browse through.The camera provides almost a macro mode where it can focus as low as 2 inches.The 1/2000s shutter speed also means that you can take pics of a fast moving subject.It uses the cheaper AA batteries (rather than the costlier AAA) which are also available everywhere. But it does eat a lot of power if the LCD is used regularly, and if the camera is used in the movie mode for too long. A better option would have been to provide a rechargable battery.Once the user clicks, there seem to be too many flashes before the actual picture is taken. I have often had an experience when the subject thinks the photo is taken and they are ready to move after the first flash.I wont say its bulky, but its certainly not the smallest, and does not fit easily in your pocket. I have seen smaller ones with equally powerful zooms and equally good pics if not better.The viewfinder, although well placed, is too tiny and it takes a bit of getting used to peer through it.When comparing consider the Nikon Coolpix 5600 and above and Panasonic Lumex series. Some Fuji FinePix cameras also seem to give a good bang for the buck.", "Date": "July 16, 2007"}, {"Title": "I love my Camera!", "Author": "Kate B", "ReviewID": "R1S4RZZS4YHARD", "Overall": "5.0", "Content": "I am so happy with my new Canon PowerShot A460 5MP. The picture quality is what you expect from cannon, exceptional. It was easy to learn to use. It does not have automatic stabilization, but don't let that detour you from buying this camera. You can easily select the custom stabilizer that works best for your environment. I use my camera mostly for live music events and ALL of my pictures come out great. No fuzzy, grainy or indistinct pictures. Also very impressive is the video quality. I have a digital video recorder and I chose to use my Canon PowerShot over the old Video recorder. Clear, no lag and clear sound. I will continue to use Canon products in the future.", "Date": "June 5, 2007"}, {"Title": "Great deal!", "Author": "iza425", "ReviewID": "R2I5KGDNL1F6HK", "Overall": "5.0", "Content": "This is a great camera for the price. Clear pictures, and has a lot of different modes. The movie mode is good too; responds well to fast action, but the picture is not crystal clear for night movies however it is acceptable. This is my second Canon PowerShot camera. They're well made and can take some beating. My first one lasted for years before it broke and I had taken thousands of pictures with it. By then it was time to upgrade anyway.", "Date": "May 30, 2007"}, {"Title": "Great camera for the money", "Author": "C. Lyman", "ReviewID": "R1DDLMT61XTO6P", "Overall": "4.0", "Content": "Canon has always been a leader in the imaging field. When there is a lens involved, you can't really go wrong with Canon.For an inexpensive camera,this model is great. I have a much nicer and more expensive digital but wanted an alternative for those times when I don't want to lug a larger camera around and also risk something happening to it. My advice to those who don't know much about cameras- forget about the megapixals and digital zoom.That seems to be the marketing ploy these days. Get all the optical zoom (4X optical or more)you can for the camera in your price range.There is nothing worse than looking at a picture you took of something in the distance and not being able to tell what it is. Also, take into consideration the type of batteries the camera uses. If your camera uses AA batteries (rechargable or reg.) you can feel comfortable knowing that you will always be able to run into a convienience store or gift shop to get batteries if you have forgotten to charge up the last time. Tiny little cameras take mediocre pictures and have no zoom.That's where this Canon is a step above. Nice lens - decent zoom.", "Date": "June 26, 2007"}, {"Title": "Neophyte camera user", "Author": "N. janus \"Kitzler Kino\"", "ReviewID": "R9ETF5GJNK2NV", "Overall": "4.0", "Content": "If you do not know anything about digital cameras, and are not prepared to read the manual several times, avoid this product or ask someone to help you out.If you are camera savvy, you may want to spend a bit more and get a better camera, some of my pictures came out blurry when I shot in the morning light and the flash (automatic mode) did not fire.the instruction manual is overly complicated if you just want to take pictures and upload them to your computer.  Probably written by nerds who live and breathe digital cameras!A great buy for the money, just spend another $20 on a 2 gigabyte card and throw the 16 megabyte card that came with the camera out.  No need to buy rechargeable batteries, two AA Duracells last a long time, even when using the playback mode extensively.", "Date": "July 28, 2007"}, {"Title": "Canon A460", "Author": "A. Bencomo", "ReviewID": "R2IU6M6KFG9W2Y", "Overall": "5.0", "Content": "So far this camera has been a great one. Easy to use, good qualities pictures. I took it with me for our vacation and I didn't have any bad picture.", "Date": "August 6, 2007"}, {"Title": "gets the job done", "Author": "Darth Mom", "ReviewID": "R3P9X17HX5J5M0", "Overall": "4.0", "Content": "Not the smallest but not too large for my purse. Takes good pictures, not too difficult to use (ie;to figure out what the symbols are without the book) comes with almost no memory so you have to buy a new memory card or you will only take about 4-5 pictures. Has plenty of potential. Works for me for impulse photos.", "Date": "May 17, 2007"}, {"Title": "I love it!", "Author": "P. Davis", "ReviewID": "RKZ6EIH266V15", "Overall": "5.0", "Content": "Really simple to pull out of the box and just get started, you may want to invest on a larger memory card right away, be smart and have one shipped with the camera. Pictures are clear, easy to focus. Again, I love it.", "Date": "August 9, 2007"}, {"Title": "Very good camera for that price", "Author": "Emmanuel Pelaez \"Emmanuel\"", "ReviewID": "RK3CZWL2ZF2AO", "Overall": "5.0", "Content": "When you are looking for quality you must look at two things:  That the product do functions than you search, for the price than you may pay.  That is quality. It is very good camera for that price.  Only I recommend buy batteries rechargeable additional, because the normal batteries do not last long time.  But buy, with 5MP and 4x, is very good for most user.", "Date": "July 31, 2007"}, {"Title": "I love this little camera!", "Author": "Dawnne", "ReviewID": "R2ZRG5NOFZ47RK", "Overall": "5.0", "Content": "Admittedly, I'm not much of a photographer but needed to get a camera.  I did my research, read the reviews, and selected this model.  I have not been disappointed!  I have tried many of the features, including video, and have not had any problems.  My night-time pictures have turned out great and I am completely pleased with the quality of all the pictures.  I was a little nervous about buying a camera that uses AA batteries since I expected battery life to expire really quickly - I've taken hundreds of pictures and a little bit of video and my initial batteries (the ones that came with the camera) haven't died yet!I highly recommend this camera!!!", "Date": "September 27, 2007"}, {"Title": "Very easy", "Author": "Shipslady", "ReviewID": "R2LAPL7PZLFW8X", "Overall": "5.0", "Content": "This camera is very easy to use.  There are more advanced settings if you want them, but the basic operation suits me.  I especially like that my camera uses ordinary battereis, I no longer have to keep track of a charger and remember to use it.  Now I'm always ready to \"shoot.\"", "Date": "July 20, 2007"}, {"Title": "Nice camera, but flawed", "Author": "michael d collier", "ReviewID": "R1DL0SEIVRA679", "Overall": "5.0", "Content": "I replaced my venerable Elph Powershot S200 with this camera. The build quality is not as solid as the Elph, but at this price, I can afford to replace it every couple of years. The picture quality is outstanding. A ton of features, it is taking me a while to use the camera to it's potential. I've called Canon support, and talked to a living, breathing person for assistance. Customer support is perhaps the best feature of this camera. Exceptional camera, exceptional value.- - - -I liked this camera so much initially that I recommended it to 2 of my friends and they bought it. After living with the camera for 6 weeks, my friends and I have all experienced the same flaw. The battery/memory card door does not close tightly. I talked to Canon about it, and they say they know nothing about it, but I can ship the camera to them and they will look at it. My daughter has an A430, which is nearly identical, but the door works differently, and correctly. I am much less pleased now than when I purchased the camera. Now I have to decide if the flaw with the door is worth the trouble to send the camera back. My OCD tendencies suggest it probably is.- - - -I exchanged the camera for an A560 after a Canon CSR tried to convince me that the flaw is actually a feature. He has a great future with Microsoft! I'm very hopeful that the A560 does not have the same problem.", "Date": "July 11, 2007"}, {"Title": "Amazing", "Author": "Leonard T. Martin", "ReviewID": "R1HZCIV8936UKF", "Overall": "5.0", "Content": "I am a subscriber to Photography Magazine, and one of the professional writers recommended this product.  I am a film addict and after using this product, I am considering purchasing a better digital camera, but for my needs at the present, this is great product.  The pictures are good and this is a very simple to operate.  I am well satisfied with this camera.", "Date": "September 15, 2007"}, {"Title": "EASY TO USE", "Author": "kevin charles", "ReviewID": "R2W6X6PNR8UA7S", "Overall": "5.0", "Content": "i bought it for my 69 year old mom she picked it upand put in the instructional dvd and started using itthe one thing i suggest get a fater sd card for short movies", "Date": "August 31, 2007"}, {"Title": "Great camera at a great price!", "Author": "Esther D. Harvey \"estharvey\"", "ReviewID": "R1QV0SME4V2TFX", "Overall": "5.0", "Content": "This was a perfect gift for my niece at a great price.  She is 13 years old and loves to take pictures of her friends and her just \"hanging out\".  This is good starter camera with all of the features that a teenager needs!", "Date": "November 2, 2007"}, {"Title": "Great Budget Digital Camera Gift", "Author": "amazon buyer \"neil\"", "ReviewID": "R2LVN8MLWRYW91", "Overall": "4.0", "Content": "I bought this camera for my sister.  Consumer Reports said that it was a great budget camera, and it's small enough that she thinks it's cool.  She also liked the brushed metal front.  It's been a few weeks now, and I know she's having fun with her new camera.  If you want a quality digital camera without spending quite as much money, this is a good bet.", "Date": "November 2, 2007"}, {"Title": "Don't look to expensive cameras to get quality", "Author": "jeandulac \"Blueberry Power\"", "ReviewID": "R1AF851RAH3DD9", "Overall": "5.0", "Content": "I have been using my Canon A460 for 10 days now. What I can say about it is that I'm truly satisfied with my purchase. Some days before, I had bought a Canon SD1000 camera but I didn't like it and asked for a refund: too small for my fingers, seemingly too fragile for traveling around because of its compactness. I'm quite pleased with what I bought afterwards: a nice camera, fitting well in your palm, with lots of features, not too long to get used to, well laid out controls, rendering sharp and crisp photos. In some words: really inexpensive for all it can give you. A real bargain!", "Date": "September 26, 2007"}, {"Title": "Perfect camera", "Author": "Ms. L. Herzog \"handspringgirl97\"", "ReviewID": "R1RF8NTQ6ZOSC6", "Overall": "5.0", "Content": "This an amazing camera. It is defiantly worth your money, it has great zoom and pixle qualities. It has lots of features and you can take videos with it. My only suggestion is to buy a memory card a 1 or 2 gb becasue you will definatly use it.", "Date": "September 24, 2007"}, {"Title": "Great Camera Great gift", "Author": "J. Robinson", "ReviewID": "RIFI8SSS840Y9", "Overall": "5.0", "Content": "After doing a lot of research, we purchased the Canon Powershot A460 for our son and his wife as a gift. It is their very first digital camera. It was very easy to use right out of the box. Later that week we learned that our youngest son also has this camera and he absolutely loves it, too. Way to go Canon!", "Date": "August 23, 2007"}, {"Title": "Exelent", "Author": "Kylie Kohlbrenner", "ReviewID": "RUUSM10Q6GYRE", "Overall": "5.0", "Content": "I was verry peased with the camera!! This is the second camera I had bought from this site and would not hessitate to buy again!", "Date": "July 17, 2007"}, {"Title": "Low price, excellent Camera", "Author": "Tanveer", "ReviewID": "R11O2TLREE84Y6", "Overall": "5.0", "Content": "I was looking out for a good brand inexpensive camera and came across this A460. This camera is perfect for my day-to-day need. Good quality pictures with 2\" LCD. It's awesome. With Canon brand, you can't go wrong! Before this Camera, I had always purchased Sony Cameras, and I think Canon is much better than the Sony's in terms of picture quality. I highly recommend this Camera to any buyer who is looking out for a nice camera with a low price.", "Date": "June 14, 2007"}, {"Title": "Canon PowerShot A460", "Author": "P. Houston", "ReviewID": "R35QZ6QW94E3QB", "Overall": "4.0", "Content": "Since I generally buy high-tech stuff when it is about to be discontinued, this camera seemed appealing. I wanted something to be able to post pictures on the internet, and I am not interested in printing that much.Since I am a craftsman, I am interested in posting pictures of work that I do, and techniques that I use.I looked at the new PowerShot A470, and the main selling point with this one is more megapixels.The A460 has 5 megapixels(more than enough for internet posting), and it also has 2 macro modes which the new A470 does not have.I run Windows 98se, and the software included does not work with this OS,but the true test of a digital camera ought to be, that other than cropping and changing the white balance a bit, one should not have to use all sorts of fancy software to get good pictures.So far, this camera is very good, the only problem that I see looming in the future is the weak SD card/battery door hinge, that seems like it is too flimsy for the job it has to do. Also, I plan to get the ac/dc cable to power the camera when downloading images to the computer, using the USB port. This would eliminate having to open the door to get the SD card out, for my card reader.I've have not used the movie mode yet, but it needs an Apple Quick Time version that does not work with my OS, maybe I can find something else, out there. Overall for the money, I am happy with my purchase.", "Date": "May 31, 2008"}, {"Title": "Unbeatable for the price", "Author": "J. Reynolds \"DJ Jefferson\"", "ReviewID": "RGRHE2KFZJ1E", "Overall": "5.0", "Content": "I laugh every time I see a camera with identical optics that somebody paid 3x to 4x as much for.  I'm very happy with my purchase!", "Date": "July 6, 2007"}, {"Title": "GREAT CAMERA", "Author": "BIG ROR", "ReviewID": "R26H0JQIHCWQ18", "Overall": "5.0", "Content": "I am not a digital camera guy, but this camera makes me look good. Easy to use, great price and fantastic pictures. You can not go wrong with this camera!!!!!", "Date": "July 3, 2007"}, {"Title": "Wonderful Camera!!!", "Author": "Susie", "ReviewID": "R3FNLTXMEGY93Y", "Overall": "4.0", "Content": "This is a great camera for its price! It has tons of features that are fun and easy to use.  It also has multiple size settings for photos, which is helpful if you wish to save space on your memory card.  The smallest setting is all that is needed if you are not intending to print your pictures (i.e. if you're putting them on the web) and even at the highest quality setting for these you can still take about 55 (that's using the small memory card included)! For people printing a majority of their pictures, I would suggest purchasing a larger memory card. Batteries seem to last a decent amount of time during usage of the camera.  The coloring and quality of the images seems great!", "Date": "September 27, 2007"}, {"Title": "So good - I ordered a second one...", "Author": "Scienceman", "ReviewID": "R25LNVL4OHAK4P", "Overall": "4.0", "Content": "We were looking for a simple point and shooter and this one fit the bill - it worked so well that we ordered a second one... It is easy to use and worked right out of the box without a glance at the instruction books - Incidently, when we did look at the instructions we found them to be quite comprehensive and clear... A second set of books in Spanish was a nice touch... Printing the pics directly to an HP photo printer is a snap... The A460 is easy on batteries and fits into a shirt pocket... We recommend ordering an additional memory card (high speed - at least 2GB) because the standard card (16MB) that came packed with the camera is just not enough...", "Date": "July 5, 2007"}, {"Title": "VERY HAPPY", "Author": "B. T. Newton", "ReviewID": "R1R9VMXKFQXCHY", "Overall": "5.0", "Content": "I bought this camera to replace an older cannon 2.0MP I bought years ago.  I am completely happy with not only the deal that I got on it, but the quality of the photos.  This camera is worth every hardearned penny it cost.", "Date": "June 27, 2007"}, {"Title": "my first digital camera", "Author": "Susan F. \"Geevon\"", "ReviewID": "RF22P9KIUS3YI", "Overall": "5.0", "Content": "I bought this camera because it had some good reviews, and the price was right. I've had it just a few weeks, but I'm in love with it. Takes great pictures, simple to load to my PC. You should buy the bigger memory card though, because the one that comes with it only holds about 8 shots. I am still learning, but have gotten some great shots. I don't usually print, but upload to York and get very inexpensive prints in a few days. I like that it takes regular AA bateries. I don't think you can go wrong with this product.", "Date": "June 26, 2007"}, {"Title": "great product", "Author": "Joseph J. Annotti \"Joe\"", "ReviewID": "R3OPUN9RGRRPT2", "Overall": "5.0", "Content": "This is a great product! I have never purchased a digital camera before nor consider myself to be technologically apt. However, after doing much research and reading all the reviews, I ended up choosing this camera and it is fantastic. It is very easy to use, has tons of different modes to shoot in, and incredibly simple to synch up to a computer and download pictures. And you can't beat the price! All in all, a great camera.", "Date": "January 17, 2008"}, {"Title": "A great camera at a bargain price", "Author": "Andrew R. Doble", "ReviewID": "R2OI7P0JAJLBPS", "Overall": "5.0", "Content": "I bought this model for three reasons:1) it is one of the few digital cameras to retain an optical viewfinder;2) it is cheap so can be taken to risky places without worrying;3) it has an above-average optical zoom of 4:1and it has fulfilled its promise in all three categories.The photos have not suffered from the clolour distortion mentioned in other reviews, so maybe Canon has fixed that problem in later production.Overall, a great camera for the price.", "Date": "December 30, 2007"}, {"Title": "WORKS GREAT!", "Author": "J. Poole", "ReviewID": "RW2IMRL2Q7GQV", "Overall": "5.0", "Content": "Got this A460 to replace an earlier Canon model that I dropped. This camera is easy to use in a hurry, the pictures are sharp, easy to download, and playback. A few extra memory cards would be good to have on hand if needed.", "Date": "October 24, 2007"}, {"Title": "Good camera at a very good price", "Author": "Ignacio Ferrer \"Igna\"", "ReviewID": "R249NXWMVYPIM6", "Overall": "4.0", "Content": "Canon A460 is a friendly camera, easy to use and with enough MP and zoom  for non-proffesionals. I would recommend it for beginners. I think it is a nice camera at a very reasonable price.", "Date": "October 5, 2007"}, {"Title": "canon", "Author": "Jeanne L. Miller \"Jeanne\"", "ReviewID": "RP8ER6JO1EMPH", "Overall": "5.0", "Content": "for the money this is a great camera, with easy instructions, easy to use, taking great pictures", "Date": "September 27, 2007"}, {"Title": "Just what I was looking for", "Author": "ME \"mecf\"", "ReviewID": "R33K68HPYN077D", "Overall": "4.0", "Content": "I was looking for a relatively inexpensive, easy to use camera and this one is.  The photos are of good quality (not professional but good enough for the family photo album), it's very easy to use, and it's easy to download the photos to the computer.  I would recommend this camera.", "Date": "September 27, 2007"}, {"Title": "great point and shoot", "Author": "S. Simpson", "ReviewID": "R2PRH7WSPE6VRU", "Overall": "4.0", "Content": "We bought this camera after using a friends A400 and loving it.  This was the closest available and we're enjoying taking daily pics.  Pretty bare-bones, it's easy to figure everything out quickly; so you can spend your time taking the pictures, not reading the manual!!  The view on the screen shakes more than the A400 did...maybe just more noticeable because of the larger screen.  The end result is clear, though.  We're very happy with this purchase.", "Date": "September 24, 2007"}, {"Title": "Was this really $230?", "Author": "Teresa Kuet", "ReviewID": "R2LKZ9TJZ2EAMK", "Overall": "3.0", "Content": "I can't imagine anyone buying this for the MSRP of $230.Pros- Powers up quickly- Ease of use for casual pointing and shooting- Auto-focuses quickly- 4x optical zoom -- very cool.  BUT you can only zoom in increments.- LCD screen is bright, though its color is not terribly accurate.- The AA battery life is better than most digital cameras I've used in the past.- The super macro on this camera is amazing.  You can take a picture of something 1/2 inch away and see amazing detail.  I took a picture of a bee on a flower and saw the hairs on its body and the expression on its buggy face.Cons- Somewhat bulky.  I can't put this in my pocket.  BUT, it's pretty lightweight.- No image stabilizer.  Serious drawback.  I can't take a flashless photo in a regular-lit room without the picture looking blurry or discolored.- Night pictures are subpar, for the above reason.- The description of the \"portrait\" shots as SLR quality are deceptive.  I see no noticeable difference between the sharpness of my subjects and their surroundings.- The video quality is not so great.I was content with this camera for a long time because I figured you get what you pay for.  Decent quality camera for $120.  However, there are now better cameras for the same price.  Or, you can pay just a bit more for better quality -- more megapixels, image stabilizer, and better night shots.", "Date": "January 11, 2008"}, {"Title": "Great buy!!!", "Author": "Mary F. Shippey", "ReviewID": "R11P2CGKFOHVHP", "Overall": "4.0", "Content": "My son took a picture of a moving car -- from a moving car!  Didn't even have to focus!  The image was perfect!!  What more can I say!!!  I had a problem with the low light -- but -- I think I am too much of a novice - it was problably my fault.  Not disappointed at all!! Will update as I go along!", "Date": "June 30, 2007"}, {"Title": "Useful for the beginner", "Author": "T. Mahadevan \"Bhagawathy\"", "ReviewID": "R1PJGSJ717M5IF", "Overall": "4.0", "Content": "This is the first camera that I bought for my mom. It is easy to use and has all the basic features. It would be better if had had the panoramic image feature - but this camera has good value for money. The image quality is good  -almost as good as another 12x zoom 8MP camera that I have. Easy to learn to use and it comes with 16MB of external memory. we almost lost the 16MB card that was hidden inside the box.", "Date": "June 26, 2007"}, {"Title": "My Food Camera", "Author": "Jared Prophet", "ReviewID": "R3JHY822CWQPG9", "Overall": "3.0", "Content": "The Macro on this camera Rocks! I keep buying new cameras to replace this one, and can't. They don't measure up in the macro. (You use the Macro to shoot small close objects, Food-Toys-Flowers.)The problem is that this camera is really slow. No one wants to wait for the camera to cycle around before getting to eat their food.Low Light is non existent. No Shudder Speed Control. I shot approx 6-8k photos between June '07 and May '08. Worked pretty good for party photos. Not so good for sports.If you can afford more, spend more. If not, you could do worse.", "Date": "January 15, 2009"}, {"Title": "Great Little Camera", "Author": "J. Gallen", "ReviewID": "RN3X2INQ01831", "Overall": "4.0", "Content": "This is my first digital camera.  I've been hard pressed to give up my 35mm camera ways.  This little camera is simple to use.  Instructions are easy to follow.  Picture quality is fairly sharp. The best part about it is that it is handy, easy to take along and lightweight...beats lugging all the 35mm stuff when all you want to do is snap a couple of quick pictures.  The other thing I love which has less to do with the camera but more to do with the technology is the fact that I now don't have to print a bunch of photos that I don't want. I can print just the shots that I want and delete the rest.The one downfall to the package is the memory card has very limited space so you'll need to upgrade that really quickly.Overall for the first time users this is a good deal for a good camera.", "Date": "October 20, 2008"}, {"Title": "Good value, some shortcomings", "Author": "Ruth in NM", "ReviewID": "R2MI7TNV8KL5G1", "Overall": "4.0", "Content": "I bought this camera at Christmas for my kids (12-year-old daughter likes to do \"KidTV\" videos with friends; 9-year-old son makes stop-motion and live videos of Lego etc. for YouTube). I got it partly because my Canon A95, which in all other respects I *love*, only does 30-second videos; and partly because I got tired of copying VHS-C tapes for them. :-) I picked this model for its combination of price and Canon quality. It has been very useful. Basic modes are very simple to use. The kids have not really explored many of the other options. Image quality is generally excellent. However, early on I did some testing and found that, in addition to the high noise at even low-ish light levels that others have reported, it has some trouble focusing when zoomed (*optical* zoom, not digital). Standing across the room and doing incremental zoom steps on some object, I found that the higher the zoom, the more blurred the image was - not always, but often. This should not happen. It is clearly a focusing issue, not a question of resolution. But the kids have not had any complaints. It appears to be just right for their level of use, and that's what I recommend it for.Update: When I bought this camera, the price was just over $100. I do not recommend paying much more than that for it.", "Date": "September 26, 2008"}, {"Title": "Perfect Starter", "Author": "Kristin A. Schwartz", "ReviewID": "RBBWH4YK89NHR", "Overall": "4.0", "Content": "This was my first digital camera and some of my main concerns were durability and cost.  I was getting ready to go to Australia for 4 months and didn't want to spend too much and chance losing or breaking an expensive camera.  So far, one month into my travels, I am very pleased with my purchase.  I have dropped the camera onto cement from about 2 feet and it shows no sign of trouble.  I find the 5.0 MP plenty and I get good color and clarity.  A viewfinder was a must for me, since I knew outdoor photos in the sun were going to be a large part of my collection.  There are many times when the sun makes it impossible to see what you are shooting and having the optical viewfinder is great!I haven't spent too much time experimenting with all the many features, and there are lots, but I have used the macro and taken some spectacular inches-away shots!  I have also used the video feature which is fun.I can't recall if the instructions say to use lithium batteries, but I went through 10 regular batteries before going to lithium and find it a must.Overall, I love this little camera!", "Date": "September 16, 2008"}, {"Title": "like the viewfinder", "Author": "John F. Monahan", "ReviewID": "R1Q3Z6432IB834", "Overall": "4.0", "Content": "This is actually a replacement for one that I dropped in a river.  I liked it enough to get an identical one.  It is an inexpensive camera useful for activities (like river kayaking) that expose it to damage.  A lot of cameras are leaving off the viewfinder.  I find that with it, I can compose pictures better, especially in bright light, saves on battery power and is ready sooner after powering up (which also saves on batteries).  If it were more water resistant, it would get the extra star.", "Date": "August 20, 2008"}, {"Title": "Good choice, esp. if you want an optical viewfinder", "Author": "J. McDonald", "ReviewID": "R2NZN9NS3MZ0D8", "Overall": "5.0", "Content": "I bought this as a second camera to carry around (my other one is very bulky).  It was a very good deal, especially for the features it has.  It takes video with audio, doesn't burn through batteries, zooms nicely, and seems solidly built.  The thing that cinched it for me was the optical viewfinder.  Almost no entry level cameras have this anymore, and it's really better than an LCD screen in harsh sunlight.  The downside is its size.  It is not as svelte as some of its competition and is at the upper limit of what fits in my pocket comfortably.", "Date": "May 13, 2008"}, {"Title": "Camera", "Author": "S. J. Oliver \"cushman\"", "ReviewID": "R1PUAH9WCUYO5G", "Overall": "5.0", "Content": "I bought this camera for my husband.  He loves it and it is very easy for him to use.  The picture quality is excellent.", "Date": "April 19, 2008"}, {"Title": "Great Deal on Cannon PowerShot", "Author": "Sharie Fonoti", "ReviewID": "R2DP1T62WGN37O", "Overall": "5.0", "Content": "I was given a gift certificate from my son for Christmas and did not know what to use it for.  I have had my 35mm camera for 20 years and thought it might be time to invest in a digital camera.  The camera was a great price and I love it.", "Date": "March 10, 2008"}, {"Title": "great camera for a great price", "Author": "R. Gibbs", "ReviewID": "R1RBAEJRW16TK2", "Overall": "5.0", "Content": "this is a great great camera..i purchased this camera by other reviews that i read...very easy to use... easy to download pictures...if your looking for a basic point and shoot this is the camera to pick, and it takes beautiful pictures.", "Date": "October 30, 2007"}, {"Title": "Stuck Pixel from Factory, Repaired two times still same problems", "Author": "Missing a Pixel", "ReviewID": "R2DQVLSW3A0087", "Overall": "1.0", "Content": "Product arrived with a pixel stuck red.  Unfortunately, I didn't notice until I went to the desert and took some pictures of cloud formations and it was past return policy.  Sent in for repair.  They replaced the sensor and it came back with a different pixel stuck blue.  Sent in again, the exact same pixel still stuck blue.  Broken from factory, 2 repairs, and still have not taken a picture that does not have defects.  I called Canon to get a remedy and I will apparently be just sending it back in and hoping the third attempt at repair will work while the other attempts did not.  I would not recommend buying this unless you want to photoshop pixels out of your photos and deal with some guy from Canon who insists he does not have a Supervisor.", "Date": "December 14, 2007"}, {"Title": "good price", "Author": "Snooky", "ReviewID": "R2GE8QWMURF6JW", "Overall": "4.0", "Content": "Bought this camera for my daughter and son-in-law. Had good luck with my Cannon and the price was right. Don't get turned off by lower resolution of this camera. If you are looking for affordable snapshots you don't need more MP.", "Date": "January 18, 2008"}, {"Title": "Super Product", "Author": "My spunky gal", "ReviewID": "R37HOMY53SJPD2", "Overall": "5.0", "Content": "Canon PowerShot A460 5.0MP Digital Camera with 4x Optical Zoom (Silver)This arrived promptly in excellent new condition. The camera is automatic in every way and serves as a great, economical  camera for a photographer that wants to shoot and go! So many people, when they view my slideshows or photos, ask what kind of camera I use; the quality is exceptional.", "Date": "January 6, 2008"}, {"Title": "excellent", "Author": "Kenneth L. Mcnamar", "ReviewID": "R1IITETPUURJPH", "Overall": "5.0", "Content": "did not have manual, but was easily found and downloaded.  nice little camera.  takes excellent pictures without a hitch. good camera.", "Date": "January 10, 2014"}, {"Title": "An excellent camera", "Author": "Christy K \"Christy/Lover of films\"", "ReviewID": "RZU1WJ0AMZGQS", "Overall": "5.0", "Content": "This is a replacement for the sam camera I had that stopped working after 5-6 years of use.  Easy to use and takes very good pictures. I was happy to find this used camera online. I especially like the eye piece and the use of AA batteries.", "Date": "July 5, 2013"}, {"Title": "A+ Seller", "Author": "mckinzee \"mckinzee\"", "ReviewID": "R3RLH5O0NB687F", "Overall": "5.0", "Content": "A camera like this - was my first digital camera.I gave it to my daughter - how LOVED it.When it wore out - she couldn't find one like it any where.I found this one & she LOVES it.It doesn't have all the fancy settings of some cameras.But it takes really excellent pictures - is a nice size and runs on AA batteries.She has literally taken thousands of pictures with it and it's still going strong.", "Date": "February 15, 2013"}, {"Title": "great 1st digital", "Author": "ag_pob", "ReviewID": "R3LOAA17SNL56P", "Overall": "5.0", "Content": "I shot 35mm Kodachrome II for 30 years with an Olympus OM1 and Zuiko lenses. This was my first venture into digital still. It was such an unknown I did not even know this camera shot video when I ordered it. What a nice surprise - it is not even 720HD so it's not the greatest but it blows away the analog 8 video I was using!!! I liked that I could shoot the still photo's in 16x9 aspect so they display full frame with no issues on a widescreen TV, monitor or digital photo frame. The pics are very nice for the price & pixel count. However, by now there are some nicer point&shoot; from Canon and my new favorite Lumix, that shoot both still & video in 16x9 and at least 720p....The canon cameras seem to be just a bit more vivid and better white balanced right out of the box, the Lumix took alot of tweaking to get it to suit my eye, but it could be done...All-in-all the little A460 has been a reliable point&shoot; that is still giving pleasing images...", "Date": "March 27, 2011"}, {"Title": "Good camera", "Author": "Elise890", "ReviewID": "R1H6TFOB6EJ28B", "Overall": "4.0", "Content": "Camera is very good and reliable. The AA batteries do not last very long though, which can be frustrating. Otherwise it is a solid Canon camera that takes very nice snapshots.", "Date": "December 1, 2010"}, {"Title": "This camera was great at first", "Author": "T. Ching", "ReviewID": "R3NYPBAK6NWH6J", "Overall": "2.0", "Content": "This camera definitely felt right, and the price wasn't bad. I bought this off amazon not too long ago. Whether the camera is aging or not, i'm not too sure. But I do know for a fact that this camera is very unreliable when it comes to taking photos of individuals that are moving, thus resulting in blurry photos and a severely limited flash range. I do know that this camera model is old, but the quality should not be at this rate. Buyers should be aware that this camera is around 2x the bulk of normal camera sizes, thus making it slightly more awkward to carry about. I guess I could bring up the issues it has with taking photos at poor lighting, but i'm sure someone will pounce on my review saying I don't know how to use the functions properly and what not. The honest trust is that this camera is reliable for a good few months, and then simply refuses to work properly. Like other reviewers have said, save your money a little longer and buy that better brand of digital cameras that you do trust.", "Date": "March 24, 2010"}, {"Title": "Good basic camera that does what I need", "Author": "J. McLaughlin", "ReviewID": "RQCNMZS5SA422", "Overall": "4.0", "Content": "I have owned the A460 for some time now and have no complaints.  I purchased it for under $100.00 from Amazon so have no complaints.  I needed a general-purpose camera to take fishing and on metal detecting outings and the camera has worked great it both situations.  I took this camera and two sets of rechargeable batteries on a two-month business trip to Japan, Singapore and Diego Garcia and it did an excellent job.  The only complaint I have is it is a little bulky but nothing I cannot live with. I use other larger cameras for low light work so that was not an issue for me.", "Date": "March 2, 2010"}, {"Title": "Perfect basic \"point and shoot\" camera", "Author": "Nicolas Pujol", "ReviewID": "RBVZ9UGZTDWBW", "Overall": "5.0", "Content": "We've had this camera for 3 years and it has been an ideal device. Some of its highlights:* Low price* Very solid* Takes decent shots* Uses standard AA batteries* Simple to useLow lights:* Resolution a bit low* Could be thinner to fit small pocketsAll in all, for the price, the great pictures it takes and the longevity, I couldn't be more pleased.", "Date": "July 30, 2009"}, {"Title": "good pictures, power hungry", "Author": "Enrique Bozzo", "ReviewID": "R1R4YXEHH30F4F", "Overall": "3.0", "Content": "This is a good camera, it takes great pictures under almost any circumstances. Now, as almost all pocket cameras, it is not easy, much less fast, to put the menu onscreen and start choosing, so you use it almost always in automatic point and shoot mode.4X optical zoom and 4x more in digital zoom is more than most in its class.It has an unbelievable hunger for batteries, and it chews them very fast, both rechargeable or alcaline. That's its most negative aspect, and even with new ones, flash recycle takes several seconds (about 15).Anyway, the pictures are good and 5MP is more than enough.", "Date": "July 24, 2009"}, {"Title": "Canon", "Author": "Gene", "ReviewID": "R2Q55RXJDTNMI4", "Overall": "5.0", "Content": "Hello folks out there:I brought this camera for taking pictures and keeping it on the computer.  I have no intention of printing it.  I am also an amatuer.For a beginner, and one not so familiar in camera usage, it is excellent.The camera came with several booklet, telling you how to use and take care of the camera.  The do's and don'ts.  It comes with a basic manual, which is very easy to understand.  It also comes with an advance booklet with more detailed information for those who are experts or advanced users.I only used the automatic features and I found it excellent.  I took outdoors and indoors pictures.  What amazed me was that after taking my first pictures outdoors, the camera was able to identify the scene.  The first picture it said unidentified but after that it took clear picture.  It also took clear pictures indoors.I am also very pleased with the LCD monitor.  I never use the view finder to take a picture, instead I use the LCD monitor, which makes it much easier, and the picture shown of the object your pointing is displayed clearly.", "Date": "March 6, 2009"}, {"Title": "Good, basic camera", "Author": "Hawk Lady", "ReviewID": "R2TC9BLCU4EGGB", "Overall": "3.0", "Content": "Fine camera.  Does every job adequately.  I purchased it with the Kingston 1 gb. Digital Flash card, and both have functioned extremely well.  The camera is straightforward to use, and if you have used a previous camera, you can step right into this one without any instructions.  The software that comes with it is VERY primitive.  It does not rotate pictures, for instance, and exporting pictures to send as emails is cumbersome and nonintuitive.  You will be glad to use earlier software if you have it.  The Kingston Flash card worked without any glitches.", "Date": "February 22, 2009"}, {"Title": "Loved the Timing!! =^_^=", "Author": "H. Powell", "ReviewID": "R2QTKTJMEOSN07", "Overall": "5.0", "Content": "Thank you very much is all I can say! I ordered two items from on here for my sister's birthday and I was exteremly counting on them getting here on time! The camera was at my house a day after I ordered it! I am thankful! I just hope that the shoes get here as well and as in good of condition the camera was! Thanks!", "Date": "January 8, 2009"}, {"Title": "Great Camera for the Price", "Author": "rjwmets88", "ReviewID": "R2E3CNVLF4U73J", "Overall": "5.0", "Content": "This really is a great camera for the price. It may not have all the features of a camera a few dollars more, but definitely manages to get the job done with quality", "Date": "December 29, 2008"}, {"Title": "Good  camera", "Author": "Martha B. Jensen \"mbj\"", "ReviewID": "R16IWU7IACPXB2", "Overall": "4.0", "Content": "This camera is easy to use. It was a purchase for our 18 year old son. The memory card was small so we upgraded to a larger one. Easy to load pics into iphoto. Recommend to anyone who needs a simple and good digital camera.", "Date": "December 28, 2008"}, {"Title": "Nice little Camera", "Author": "FDJ", "ReviewID": "R1MURJ5QER1KAW", "Overall": "5.0", "Content": "It takes decent photos and videos. It's easy to use and versatile. A good camera for the price!", "Date": "August 8, 2008"}, {"Title": "very happy", "Author": "C. Vargo \"the~chad\"", "ReviewID": "RUVP61MCLYR1S", "Overall": "5.0", "Content": "This camera is exactly what i needed for my intentions. to be able to take pictures of the dates that my girlfriend and i go on, for camping and fishing. it is very nice. if you are you are looking for better detail something that is high tech and look for a different camera. because this is just a common point and shoot and that is what i needed.", "Date": "July 10, 2008"}, {"Title": "Perfect for my daughter", "Author": "Kenneth Stefano", "ReviewID": "R4QUTJQZWB6WX", "Overall": "5.0", "Content": "I bought this camera to replace a cheap Kodak model which my daughter used for about a year before it broke.  This Canon is simple to use, takes great pictures and has nice features.  It's a good value, especially for a young or casual person to use.  The shooting mode selection wheel is somewhat poorly made.  It would be nicer if it clicked into place more solidly.  Otherwise, we're happy with it, like the other Canon cameras we've owned.", "Date": "July 3, 2008"}, {"Title": "awesome value for money", "Author": "Gaurav Arora", "ReviewID": "R2ZBG2BSOF54I6", "Overall": "5.0", "Content": "This thing shoots good quality pics and for around $100, its awesome value for money. Canon rocks in digital cameras.", "Date": "May 30, 2008"}, {"Title": "good stuff", "Author": "Rebecca D. Thomas", "ReviewID": "R1VM1A88U2F7CK", "Overall": "4.0", "Content": "This is a very good camera for the price.  I am completely happy with it and the quality of the pictures taken.", "Date": "May 14, 2008"}, {"Title": "Love It, Love It", "Author": "M. Han \"fsgirl\"", "ReviewID": "R3FE2CIJOHFAM0", "Overall": "5.0", "Content": "This is my first digital camera and was so simple to use.  It made the annual New Year's Day Dinner at my mom and dad's the best we have had in a long time.  It was just fantastic.", "Date": "April 28, 2008"}, {"Title": "Canon without a doubt the leader in digital cameras", "Author": "Thomas M. Grosso", "ReviewID": "RBVQQ7NJRT1WX", "Overall": "5.0", "Content": "The title really says it all.  This was a gift for my 14 year old daughter for her birthday and I bought it because of the beautiful pictures our old Canon still takes.  It is simple to use and has all the features that makes life easy for my girl.  Now to try and find a way to have her stop posting so many pictures on the web.", "Date": "April 21, 2008"}, {"Title": "Rod", "Author": "Rodney Chipman", "ReviewID": "RHWKTQSBULOTF", "Overall": "5.0", "Content": "Canon PowerShot S410 4MP Digital Elph with 3x Optical Zoom Great camera with a lot of features.", "Date": "April 20, 2008"}, {"Title": "GREAT CAMERA. GREAT SERVICE!!", "Author": "Patsy Moustache \"seygirl1\"", "ReviewID": "R16BFU4OZ1QCBH", "Overall": "5.0", "Content": "I am very satisfied with this camera. After using a small kodak camera for a while it was time for a chnage so after much searching and reading reviews i finally decided to buy this camera. no regrets!!! for the orice i paid the camera is really great. it takes great pictures of excellent quality, it is easy to use and works really well.even if i was worried about the complaints about its draining of batteries i am happy to say that this camera uses batteries just like any other avergae cameras. like i do with my othe cameras after i take a picture i turn it off and put it back on when i want to use it again.The best that happened to me was that my friend who is a professional photographer gave me a big compliment for my camera and she is calculating her savings to purchase a few for herself. we were on holiday together and she kept using my cameras for pictures and really loved the quality.i really love this camera. if you want something cool, affordable, works well and takes great photos do not hesitate,,, this is the camera for you. plus the service was great and i received the camera on time and in great conditions.", "Date": "April 20, 2008"}, {"Title": "Good Camera", "Author": "SJV", "ReviewID": "R12ZM27TIXR8N", "Overall": "4.0", "Content": "I've been very happy with my camera so far. It has a distinct improvement over my Kodak EasyShare in how it handles lighting (there's a specific setting for indoors, which works great). It powers up quickly, takes crisp photos, has good color quality, and includes a lot of specialized features for what is essentially a point-and-shoot.The only drawback is that the navigation system isn't always intuitive, which can create problems for people who only need (or can only use) a simple design, but unfamiliarity can be overcome with practice. And since it allows them to include so many specialized shooting modes, I think it's a fair trade.", "Date": "March 29, 2008"}, {"Title": "Great price - some glitches", "Author": "avidreader123", "ReviewID": "R2T1WR75707OK2", "Overall": "3.0", "Content": "Bought this for my 15 yo son for X-mas.  All seemed well (he was very happy!) until we took a cruise on New Years Day.  Three days into the trip (the 1st time her really got to use the camera) the telescoping lens would get jammed up and not retrack/extend. It has done this off and on since that time. We have always been able to get it to work with a little elbow grease.  But it is something that should be mentioned.  Otherwise he has been very happy with it.", "Date": "March 3, 2008"}, {"Title": "Great camera; low price", "Author": "Donald E. Garland \"1tightwad\"", "ReviewID": "R24HBH7RANH10Y", "Overall": "5.0", "Content": "All the new cameras are 7 to 10 meg --- too big to send on the web.  For 8 z 10's this is perfect --- no nobody uses 8 x 10's anyway.  The smaller pictures are perfect as well --- perfect for my level of shooting.  Has all the required features and the new cards are dirt cheap; 1 gb for less than $20.  Use it all the time.", "Date": "February 28, 2008"}, {"Title": "Very easy to use, excellent product, great pictures", "Author": "The Celican", "ReviewID": "R3GD6YI5KXV831", "Overall": "5.0", "Content": "I purchased 4 of these cameras as a christmas gift for my relatives who didn't have a digital camera and who I knew wanted to break into the digital world. After a lot of research online + with prior excellent experience with Canon cameras and camcorders (have 2 other cannon cameras & 1 cannon camcorder), this was a natural choice for me. Price was another consideration. Its very very affordable, entry level camera that consistently takes excellent pictures and videos and lives up to the Cannon legacy. The modes are very basic as compared to some higher end models and qualify for a basic shoot-and-point camera; but then, what else do the uninitiated, middle aged people want??? Its best feature is its ease of use. Just select, point and shoot! I've seen even people with advanced settings often use the \"Auto\" mode more often as a rule than an exception. I myself do!!The only minor fault I noticed was its cheaper-made-in-china look. You expect more from a cannon, and that goes for looks as well. Doesn't look too bad, but closer inspection does reveal a not so smooth finish, and its indeed made in china.Apart from that, there are no quality or functional issues whatsoever.Battery life is great, weights very less, easy to carry around, comes with its own handy software (which you don't HAVE TO install) and definitely worth its money.The best christmas gift I gave ever. And everybody really loved it!", "Date": "February 22, 2008"}, {"Title": "Great Low Price Camera and Even Better Software!", "Author": "James N Simpson", "ReviewID": "R1UIIXOCLOCDFH", "Overall": "5.0", "Content": "I looked around extensively for the best deal in the cheaper cameras that come with decent zoom and pixel size and this camera is a lot better than anything rival companies have out at the moment for the same price.  I've used a few digital cameras over the years and this is as good, well actually better than the ones I used that cost slightly more than it. I was also going to buy a camera bag for this but the shape fits well enough into my pants pockets and the way the camera lens retracts when it is off protects it, plus its so light you don't even notice it, so I don't think I'll bother.What I also really liked about this camera was the software that came with it. I especially liked the stitching program which allows you to join multiple images together to become one image (which saves on uploading to website costs as the one image is a lot less pixel size than the independent photos are). Also handy for facebook albums and the like where your limited to the number of images in an online album. You can either create a wide landscape image of the one thing or stictch totally different images together for example people at a party. Images don't even have to be the same size if you've cropped some and you can use any images on your computer not just ones taken on this camera.  This program's easy to use and after a bit of trial and error you'll be getting the results you want.The only thing I'd advise Canon to fix on the next model is the memory card/battery door.  This is a bit fragile and if you had to change either card of batteries real quick as your subject is moving away you may miss the shot. But if you get a bigger memory card (camera comes with a small 16MB ,about 15 shots card) and use rechargeable AA batteries, replacing them before you head out you should overcome this problem.  This door is certainly not a major problem but still annoying enough that Canon should change this design in future models.By the way you can also get this camera with a dark blue face instead of the grey.", "Date": "February 3, 2008"}, {"Title": "Great little camera", "Author": "M. Dunn", "ReviewID": "R12Z6VGTRSUU4B", "Overall": "4.0", "Content": "Takes good pictures and is light and easy to carry.  I'm still learning how to use it, however, so far it does more than I need!", "Date": "July 28, 2007"}, {"Title": "NOT FOR ME", "Author": "quitosky", "ReviewID": "R2HD155GWL2MEB", "Overall": "3.0", "Content": "Item returned. I have an refurbished Kodak easyshare digital camera and the zoom lens sometimes would not function so i wanted to get a new one. After much research i decided to purchased this camera because of the good review... Not happy. My old kodak that I purchased on ebay and 3 times cheaper takes better pictures than this. The images looked good from the 2inch lcd screen but once i uploaded to my computer, pictures were not that good, not what I would expect from a canon. Also not impressed with video capability.", "Date": "June 13, 2007"}, {"Title": "Terrible! DO NOT BUY IT!!", "Author": "Christina Meyer", "ReviewID": "RFFE1I1BNAJPI", "Overall": "2.0", "Content": "I bought this camera about 3 1/2 years ago. I never liked it but it was better then nothing and a computer store was going out of business in our town and this was on sale. It takes horrible inside photos. It doesn't matter how much light you have. Your photos will either turn out very flashed, yellow, or extremely blurry. I had this camera for long enough and I tried every thing possible to create nice photos and it never did me any good. Outside photos are a little better but still sometimes blurry. I hated the thing and I am so glad I bought my Lumix :). The only plus was how long it lasted considering I have a 3 and 1 year old. Lake water is what did the thing in..Pros:Basically indestructiblequite a bit of memoryCons:Terrible inside photosHeavy!Horrible video quality (grainy and orange)Little optionsTakes a long time to take a pictureOver all this camera really sucks! I have no idea why anyone would give this 5 stars. Polaroid photos are better then this piece of crap!", "Date": "August 22, 2011"}, {"Title": "Bait & Switch", "Author": "Linda's Creations", "ReviewID": "RJJ0X5YV3WPZ4", "Overall": "1.0", "Content": "I was disappointed in my order from Amazon.com. This is the first time I've ordered anything and I was passed onto another company called ABC Deals/ The Electronic Club for the Canon Supershot camera.I thought I was buying a new camera and this one appeared to be refurbished as the box was used; the camera had some nicks on the camera body; and the camera was not factory sealed in plastic.ABC Deals, the company that Amazon.com passed me along to hasn't returned my money in spite of the fact that I returned the camera in a timely manner. They were also difficult to get hold of by phone and email.", "Date": "March 16, 2009"}, {"Title": "camera", "Author": "K. Green \"sweetybeans\"", "ReviewID": "R3CNYE6OT6DHWH", "Overall": "3.0", "Content": "Came in time and in great shape.  Was disappointed to see the same company with the same camera for $20.00 less a week later.", "Date": "March 3, 2008"}, {"Title": "Great Camera", "Author": "Angela Fonceca \"miaange\"", "ReviewID": "R32EVN6KF2U12B", "Overall": "5.0", "Content": "this camera is very easy to use. Perfect for the person that just wants to aim and shoot.", "Date": "January 12, 2008"}, {"Title": "Value for Money!", "Author": "Ace Timothy U. Lee", "ReviewID": "R216IIX7YTWGAF", "Overall": "4.0", "Content": "After i recieve the camera, i conduct some test and it was perfect. I got value for money.", "Date": "October 25, 2007"}, {"Title": "Great Little Camera", "Author": "Jodi Burchard", "ReviewID": "R2A9QS4R1CSQYC", "Overall": "5.0", "Content": "I purchased this camera due to the great reviews and the price.  I have been very happy with this camera so far.  I wanted it for a trip we're taking soon to Hawaii, so I am looking forward to using it there.  I have used it several times already and it works great, plus its easy to use.  You will not be dissappointed with this camera.", "Date": "October 5, 2007"}, {"Title": "Fine merchandise, long wait", "Author": "Ralph A. Eastman", "ReviewID": "RP4ROU7WIL5B1", "Overall": "4.0", "Content": "The Canon PowerShot A460 Camera is everything that I had hoped for and the price was very good. However, I think that a wait of 19 days for delivery was excessive.", "Date": "October 10, 2007"}, {"Title": "Canon Powershot A460", "Author": "Kathleen Graf \"kgraf\"", "ReviewID": "R2USZUULVCYC3K", "Overall": "4.0", "Content": "The user-friendly site allowed me to purchase a last minute digital camera at a great price ($99) in literally two clicks.  The camera arrived the very next day.  I was stunned.  The camera has many options and modes and neat little tools.  Reading its manual is a must though.", "Date": "April 11, 2008"}, {"Title": "Great camera", "Author": "P. Ethridge", "ReviewID": "RB60TY2BXO9DF", "Overall": "5.0", "Content": "Bought this for my wife for Christmas.  It's a great camera that fits in her purse for those impromptu moments that she wishes she had one with her.  very impressed with the images it captures for such a low price.", "Date": "January 18, 2008"}, {"Title": "Christmas Gifts", "Author": "Franklin D. Clark", "ReviewID": "R1CYFYJS1L05NV", "Overall": "5.0", "Content": "Canon products are just trouble free and reasonably priced, These were Christmas gifts for four teens.", "Date": "January 11, 2008"}, {"Title": "Point & Shoot A460", "Author": "Raymond C. Davis Jr. \"(*)\"", "ReviewID": "R3NSZOFBRYBAPR", "Overall": "5.0", "Content": "Great camera, easy to use - one draw back, must get a memory card with more memory... $20.00 or so... , However, GREAT CAMERA.", "Date": "January 9, 2008"}, {"Title": "Canon A460", "Author": "Donald W. Martin", "ReviewID": "R3C4VCL4KEW0TY", "Overall": "4.0", "Content": "This was the second Canon A460 that we purchased to give as a gift, the first to our son and this one for our older daughter.It takes beautiful pics, has user friendly features, and is value priced.I expect we'll buy a third for our younger daughter in the not-too-distant future.", "Date": "January 4, 2008"}, {"Title": "Canon Powershot A460", "Author": "Jack R. Eigensee", "ReviewID": "R2Y9EB1PPFECNT", "Overall": "5.0", "Content": "Excellent digial camera, very easy to use right out of the box, excellent photos. I got this item for a very good price and fast shipping.", "Date": "December 28, 2007"}, {"Title": "Excellent camera", "Author": "Unawatuna A. Gunathilaka \"ugag2000\"", "ReviewID": "R19POSX3FF5XNK", "Overall": "5.0", "Content": "Excellent camera for the prize. Considering the features this small camera has what I can say this is really value for my money.", "Date": "December 23, 2007"}, {"Title": "Not a good camera", "Author": "D. Williams", "ReviewID": "R365GSOV68E2GM", "Overall": "1.0", "Content": "This camera was not up to my expectations.1. It is kind of big compared to other cameras which have more features and at the same price range.2. The picture quality was not good at all. I had a nikon L10 and when I compared it to the pictures from this camera the pictures from my nikon was far better.I regret buying this camera.", "Date": "July 18, 2007"}, {"Title": "Canon Powershot A460", "Author": "L. Nelson", "ReviewID": "RK1VWBXQMW4Q1", "Overall": "1.0", "Content": "If I had realized how grainy and so much like the original digital cameras from the late 90s this was, I would never have purchased it. I based my decision to buy on the price and the reviews, but this camera is not suitable for anything more than a child. The pictures remind me of the square first digital cameras that came out and the grain is like the Disc cameras from the 1980s. NOT a good purchase. Pay a tiny bit more and get a Sony or another model than this one for an outstanding picture.", "Date": "September 24, 2007"}, {"Title": "good product - buen producto", "Author": "antonietta marolo \"antonietta marolo\"", "ReviewID": "R2847HFY9QD2FX", "Overall": "5.0", "Content": "Como siempre Canon nos tiene acostumbrados este es un excelente producto muy facil de usar captura excelentes imagenes y el valor esta  acorde al precio pagado.As always Canon has us accustomed this it is an excellent product very easy of using capture excellent images and the value this chord to the paid price.", "Date": "May 13, 2007"}, {"Title": "Very bad", "Author": "Mohammad S. Aziz", "ReviewID": "R3OCSF5X62NCDH", "Overall": "1.0", "Content": "This camera is really a bad one from the canon.I have bought other canon cameras those were excellent but this particular camera frustrated me as it costs me my attention, time and money for nothing", "Date": "May 29, 2008"}, {"Title": "Cannon Camera", "Author": "Gail A. McCormick", "ReviewID": "R3PXUZ2ZAD5UYN", "Overall": "1.0", "Content": "Canon PowerShot A560 7.1MP Digital Camera with 4x Optical Zoom  ( I think this is the one)  I returned it as I didn't like it at all.  It seems very cheaply made and had AA Batteries, which I also didn't like.", "Date": "October 24, 2008"}, {"Title": "excellent", "Author": "Gerald Kurnik \"wheres the on  and off button\"", "ReviewID": "RACKR7O0NZRGL", "Overall": "5.0", "Content": "I took latin and spanish in school  This was my first megabytes..I'm still learning but ,all in all, this is a great camera", "Date": "October 4, 2007"}, {"Title": "why do you have to give a title to submit your review", "Author": "Jacquelyn Kavannaugh", "ReviewID": "R2PDRAI4APPLF9", "Overall": "5.0", "Content": "Amazon makes it way TOO difficult to review a recent purchase.  You should not have to set up an account or look up your password.  I closed the review several times,but I continued through this process so it would not reflect on the seller.  In the future I will not provide feedback until Amazon makes this process simpler.  Where is the submit review button? Again, not user friendly.  I am beginning to think Amazon doesn't want reviews.", "Date": "December 26, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.0-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n4x optical zoom; 2.0-inch LCD display\n16:9 Widescreen mode for full-screen viewing on widescreen TVs and computer monitors\nDIGIC II Image Processor with iSAPS Technology for superior image quality, fast operation, and low power consumption.\nStores images on SD, SDHC, or MMC memory cards (16MB MMC card included); powered by 2 AA-size batteries (2 alkaline batteries included)", "Name": "Canon PowerShot A460 5.0MP Digital Camera with 4x Optical Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41k5qXKXDXL._SX300_.jpg", "ProductID": "B000MF4Z4A"}}