{"Reviews": [{"Title": "polaroid digital camera", "Author": "B. Ealey", "ReviewID": "R3L3IE98TGS4EU", "Overall": "3.0", "Content": "I purchased this camera almost one year ago so this an informed review.  The pictures this camera takes can't be matched for the price.  The features and ease of use are also outstanding.  By this time you are probably wondering why only 3 stars.  Well, I am about to send the camera back for the second time.  The battery cover is made of a soft and flimsy plastic.  Since the camera runs through regular AA batteries and the SD card is also in the battery compartment, it gets a lot of use and subsequently breaks relatively easily.  If you can put up with the pain of sending it back, the service has been great.  But if for no other reason than that stupid little cover, I probably wouldn't buy this camera again.", "Date": "June 17, 2006"}, {"Title": "Polaroid i832", "Author": "PiggyChiggy \"WiggyHiggy\"", "ReviewID": "R11ZXPFFOXZX00", "Overall": "4.0", "Content": "A must buy for the picture taker! For its low price, you get a high resolution and a user friendly camera. The only problems I have are the indoor shots, which require precise aim and control to reduce blur, and the automatic focus. I like to focus my pix by myself.", "Date": "July 22, 2006"}, {"Title": "Polariod i832", "Author": "Travis", "ReviewID": "R268U8CR3BVUXH", "Overall": "3.0", "Content": "I've had this camera a few years now, just ordered a new one here on Amazon and out of curiosity looked up my old one on here.It has been a good camera, and still works. I'll second the review about the battery cover. I had the camera replaced once for it, but the second one did the same thing. The pressure of the batteries in the compartment bows out and cracks the battery door, and the cracks keep expanding with use to make it fall apart. Now I have tape holding the door together, and tin foil to complete the circuit on the batteries.Photo wise the images were good. I can't go into technical detail, but it was satisfactory for normal use. I did attempt to photograph things like the moon with no luck, it's automatic settings were unable to compensate for that it seemed, or I did not know what settings to use. Also it has no compensation for shaking or movement, a lot of photos are blurry. Taking photos indoors is annoying, with the flash on it is too bright and you have reflections, with it off there is no way you can hold it sill enough to get a clear image without a tripod.I would not recommended this camera for the battery door only. You have to use it a lot to access the SD card. (My computer has a reader built in, and I use it, so I needed to open/ close the door frequently.) If Polaroid had not skimped on quality in this area it would last much longer, and be a good, small, point and shoot camera.", "Date": "January 2, 2009"}, {"Title": "decent camera!", "Author": "V. Fredericks", "ReviewID": "R1CF8QFK9A66KQ", "Overall": "4.0", "Content": "I'm not a big \"picture person,\" I usually only take my camera now and then for special occassions and trips. I've had this camera for about 3 years and it works perfectly for everything I've needed to do. The big downside is there's not much memory included. I paid around $200 for it when it was new...now it's worth much less...but for someone who only snaps a few pictures here and there, it's great. A bit bulky (not a pocket camera) but hey - it does the job, and does it well; almost all my pictures are from this camera.", "Date": "September 9, 2010"}, {"Title": "nice camera if.. auto flash work", "Author": "badda$$  ! \"badda$$-mike\"", "ReviewID": "RZH6DAW9NFB6H", "Overall": "3.0", "Content": "just send mine back today auto flash works sometimes ? takes a lot of dark photo's indoors why auti flash has this problem ? by the 115.00 canon powerflash a470 from newegg and get free 2gb sd card for free add 8.00 for speddy 3 day ship and you will have cannon nu 2 best camera of year for 2008 !  go -", "Date": "May 24, 2008"}, {"Title": "polaroid,", "Author": "M. Romero \"MerrC\"", "ReviewID": "R2QAWOB3QRML6L", "Overall": "5.0", "Content": "well. let me tell you i didnt have problem use it indoor or outdorr, i made it work perfect, you need to focus it or change the scene,, that's all.....", "Date": "June 30, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "Compact digital camera makes it easy and fun to take high-quality images\nDelivers amazing quality with 8.0 mega pixel images on a 2.4-inch LCD screen\nFull-automatic features for point-and-shoot simplicity at your fingertips\nSmooth and fluid 3x optical and 4x digital zoom lets you catch every detail in a tight shot\nDimensions: 3.5 x 2.5 x 1.25 inches (WxHxD); weighs 0.4 pounds", "Name": "Polaroid 8MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/31TDfHzM4JL._SY300_.jpg", "ProductID": "B000ESWPB0"}}