{"Reviews": [{"Title": "Great Pro Camera, but a battery eater", "Author": "Chris McEniry", "ReviewID": "R3JFNRWPHHBGUA", "Overall": "4.0", "Content": "The Fulifilm Finepix S2 Pro improves greatly on the S1.  I shoot  very heavily with this camera, several thousand photos a week and beat the hell out of it.  Having the Nikon constructed N-80 body helps with it's ruggedness, but it is not as sturdy as the D1-X, however it does capture 12.1 Million MegaPixels.  I recommend setting the custom white balance often when attempting to shoot in various lighting conditions to insure optimum accurate colors, otherwise colors may lean toward the red.  Also,  do not trust what you see in the lcd, believe the metering, the display will tend make you want to push a few stops, which is fine if that is the look you are going for, but at first I blew out alot of shots. The ability to use all of my Nikon lenses is a plus, and there are plent of features to play with, so get a big memory card.For the price most digital SLR's cannot touch the file sizes you can get with the S2.  This camera is almost perfect, except....IT EATS BATTERIES, EAT'S 'EM! The camera takes 4 AA's in the loading tray,(which is not the strongest of plastic things I have ever seen and cannot believe that I have not broken it while rushing to trade batteries out on a shoot) and 2 $ 123 lithium ions.  On a full day shoot I go through at least 2 sets of the lithiums and usually 3 with AA(I do always leave it set to LCD preview<to check my lighting>which can be shut off to save juice).  If I use a flash or hook it to any lighting equipment, even worse. They make a fairly expensive power pack for the camera, but for the locations I work in that is not always ideal.Final word cool Professional camera, despite the batteries, but you get more than you pay for in image resolution and picture quality.", "Date": "February 22, 2003"}, {"Title": "Great Camera For The Price", "Author": "Christopher \"Chris\"", "ReviewID": "RO3URC8JWQVWE", "Overall": "5.0", "Content": "I gave the Fuji S2 Pro 5 stars.  You can't really compare it to someting like a Nikon D2H because it's in a completely different price class.  First, I've been shooting professionally for a few years, and about 15 years in total.  I know 35mm cameras.  The Fuji, by far, has produced the most realistic and useful images of any digital camera that I've tried.  It also offers the lowest number of images that need to be retouched.  The previous comments about build quality should be taken with a grain of salt.  The camera can withstand pro use, as long as you are not into moutain biking or extreme sports, you should be fine.  The user interface is somewhat intuitive, but it does take a little getting used to - just like any other camera out there.  Nothing has been \"jury rigged\" - this camera is built on the Nikon N80 (I have one) and both cameras are light but have a solid feel.  They are well built cameras.Overall image quality is excellent.  Skin tones are right on.  I have very few, if any, white balance issues using my SB-80DX flash units.  I never use the on board flash - they stink regardless of what camera you use, it's only for emergencies.  If you are looking to buy a digital camera useful for shooting weddings, portraits, etc, this is a good camera for you.  It's imperative you put good glass on this camera (f2.8 or brighter).  The BEST lens for the money on this camera is Nikon's 50mm f1.8 AF-D.  It gives about the same perspective as a fine 85mm portrait lens.  If you can afford them, the AF-S lenses on this camera are outstanding. The only drawbacks I've experienced is AF speed can be slow with normal lenses (no AF-S) and Fuji's software takes some getting used to, especially if you shoot in RAW format.  Prices have not dropped recently on this camera - it has a large following of Nikon shooters out there, and a TON of professionals are using this camera in the studio and on assignment.", "Date": "January 26, 2004"}, {"Title": "What Do You Expect For the Price?", "Author": "scottyb \"scottyb\"", "ReviewID": "R30WTREI6VFAX8", "Overall": "4.0", "Content": "Granted the S2 is not built like a tank. It was not billed as such and I suggest that anyone who thinks they need that, chili out the $4.5 K for the D1x or $7 K for the 1Ds. I  purchased mine to be housed for undewater shooting. I have shot mostly macro to this point but will now be shooting WA as well. The color saturation and TTL are incredible and equal in quality to my previous N90s/Provia 100 setup. The S2 is the only camera on the market where the TTL is compatable with underwater strobes. You can see some of my underwater photos at [...] .I have used it extensively top side as well. You can purchase 24 2000 MA AA's for less than $30. I have also purchase the lithiums online 24/$30. This makes this setup very inexpensive and convenient to power. Plus you can purchase AA alkalines anywhere to get you out of a pinch.A 1 GB Compactflash card for under $300 will hold 78 shots in RAW at the highest resolution.", "Date": "November 11, 2003"}, {"Title": "Cream Of The Crop, Best For The Price!", "Author": "D. E. Corbin", "ReviewID": "R37PJSN9TONPQH", "Overall": "5.0", "Content": "I was using a Nikon D1 previous to purchasing the Fujifilm S2 Pro and I would have to admit that the camera body doesn't compare well to the Nikon pro bodies.After using the S2 Pro since it's introduction and shooting everything from fashion to action rodeo images,I have to say that the image quality (Isn't that what really counts in the long run?)is top notch.For action shots I shoot in high rez JPEG and for everything else I shoot in RAW format.I feel that the 12MP Raw images are every bit as good as any that can be captured on 35mm film.If one is not getting the image quality expected,from the Fujifilm S2Pro,perhaps they should examine the quality of the lenses used.Are they Nikon's Pro lenses? Are they after market lenses? I find that alot of complaints registered for various cameras are the result or either poor lens quality or of poor shooting technique rather than camera quality.Without getting into the $5,000.00+ digital SLR price range,I feel that the S2Pro is the \"Cream Of The Crop\".", "Date": "November 9, 2003"}, {"Title": "Digital Velvia!", "Author": "Ron Greer", "ReviewID": "R5X63I6KNBZCM", "Overall": "5.0", "Content": "I have owned one for 4 months now and am very pleased with it.  The reviewer that claims it can't take sharp photos is an idiot (he is no doubt the problem).  I have seen 30x40 prints shot with this (by Will Crockett) and they were amazing.  If you love Fuji film you will love the way this camera \"sees\". Fuji has tuned their software and electronics to record images with that fuji look.  Sure the body is plastic but I'm more interested in the quality of images and the images are simply the best.10/04 I've now owned this camera over a year, I've had no problems and have am still very pleased.  Battery set-up could be better,and will be in the up-coming S3, but the this camera is all about image quality and I still believe it's the best of the bunch.1/05 - Sold this camera last month.  Image quality was great but needing two type of batteries, and highh energy consumption are a major pain.  The CCD died on me, in the summer, while on a job, but was replaced by Fuji free of charge.  I'm awaiting my d200's arrival.  As happy as I am I'm glad to see it go.2/05  I have my D200 now and really love it.  Higher battery consumption than my d70s but of course it also has a larger brighter monitor.  check out the D200, it rocks!2/07 I love my D200 but still think the Fuji sensor results are closer to film and I look forward to the upcoming S5.  The D200 body with a Fuji sensor, it should be a great combination", "Date": "December 31, 2003"}, {"Title": "Re: Photo Editor", "Author": null, "ReviewID": "R3HO3UTSWRPW98", "Overall": "4.0", "Content": "Hi, I'm a professional who's making the switch to digital for some things and I bought an S2 to hold me over until the D2H comes out.I want to comment on some of your points:1) The autofocus noise is a characteristic of the lens -- not the camera. A 70-300 sounds like a plane taking off on any camera, not just an S2. I have several silent wave lenses, and they focus as smoothly on the S2 as on my pro film bodies.Also, you mention that the S2 can take 7+ frames per second (FPS)-- actually it can only do 2 FPS. I think you're referring to the D1H.2) I think most digital systems eat batteries. I don't use the rear display often, so I manage several hours from my S2 with the default battery setup that is the camera default. I also use a Quantum battery pack, and have never been disappointed. Sure it's heavy (like you said -- carry an external flash -- the pop-up flash is just as bad as all of the other pop-up flashes out there), but pretty much all modern pro SLR systems are heavy. People wonder why my Nikon FM-2n is still my favorite camera!I'd give the Fuji 5 stars -- the only thing I completely hate is the \"feel\" of the camera. It's \"plasticy\" -- doesn't feel like it has the same build quality as other pro cameras. I wouldn't feel comfortable shooting with it in the rain, for example.If this system was rubber armored, with a little higher build quality, I wouldn't even be considering a D2H next year.", "Date": "August 28, 2003"}, {"Title": "Prosumer Body/PRO! CCD", "Author": "James Seifert", "ReviewID": "R2KFSBDGUZE645", "Overall": "5.0", "Content": "The S2 is a great camera. This camera body is a Nikon N80 body which is a high end consumer level camera. The Nikon D100 is based on the same body. What makes this camera a Professional level camera is its CCD sensor. It is far beyond the rest of the 6  mega-pixel cameras out there. There are many hi-level pros that use this for their studio work. I would hesitate to use in a rugged enviroment (i.e. National Geographic on Location, or National Football League EndZone) because it is a plastic body. I challeng anyone to match the results in the studio with a camera that costs less than $3000.00 dollars. Check out Thom Hogan's website for a detailed review and comparison.[...]", "Date": "September 25, 2003"}, {"Title": "Best Pro Digital Camera for the Money", "Author": null, "ReviewID": "RTCK54E6LLPA", "Overall": "5.0", "Content": "This camera equals and in some cases surpasses its' techincal specs. Put the right lens on, 2000 amp re-chargable batteries and a big CF card and there's little you can't do with this camera. I have large, medium and 35mm cameras. Along with the Olympus ZLR 3000, this is my favorite of the bunch. It's comparably heavy, battery-hungry and rich with features that have to be learned. But what it does- such as rendering of sharp digital photos and spot-on skin tones, it does extraordinarly well.", "Date": "May 6, 2003"}, {"Title": "Fujis s2 pro", "Author": "Allan", "ReviewID": "R3P15NYFV5XR96", "Overall": "4.0", "Content": "Excellent value in this camera for the price. Camera is well balanced & feels good to hold.Quick in raw mode to record especially with new high speed fuji compact flash cards  transfer rate being 6mb per second .... writing files @ 12mb!This giving around 76 images per 1 GB card.Puchased seperatley a Nikon 24>120mm zoom which I'm also very happy especially with its zoom range & image stalisation, lense works fine & balances well with Camera body.Fuji S2 controls are well laid out & easy to use.Has both firewire & USB connection.Gripes:- image through view finder is a bit too small likewise LCD..could be bigger say 2.5 cm. Second battery type is 123a bit of a pain as expensive & not rechargable (REQUIRES 2).Also 4 NiMetal Hydride AA'S can be used which are rechargable...these work fine...no complaints here .RAW images cannot be used in older versions of Photo Shop.Photo Shop CS perhaps has conversion for Fuji RAW format. A light edition Raw format converter is supplied on cd, as is Adobe Elements.The S2 is also supplied with software on CD to convert Raw images to Tiff.Camera has accurate exposure & good tonal qualities... resolution is also greater than other digital 6mp slr's...interesting to see how S3 Pro turns out...& how it stacks up against the likes of Canon D20.", "Date": "November 29, 2004"}, {"Title": "Excellent Digital SLR", "Author": null, "ReviewID": "R1ID63XVXDH5KQ", "Overall": "5.0", "Content": "I have used many digital camera's and while the body could be designed better over all it has the best color, exposure and auto white balance over the SLR's in its catagory.  In my opinion the 12 megapixel mode doesnt give you 12 megapixel quality but more like 9 megapixel quality which is far better than anything for the price.", "Date": "October 4, 2003"}, {"Title": "One Great Camera", "Author": "R. Quast \"rquast\"", "ReviewID": "R2KD66XOWO9FO4", "Overall": "5.0", "Content": "I bought this camera as a back up to the Olympus E3. I find the color and clarity are very good. I also have the 28x80 and the 55x200 lens and they work very well with the camera.", "Date": "October 31, 2008"}, {"Title": "Battery life in the S2", "Author": "Michael Brown \"MikeScone\"", "ReviewID": "R92ZB8S3FU81H", "Overall": "4.0", "Content": "I've had an S2 for three years or so (just replaced it with an S3), and I've found that the battery life is VERY dependent upon use of the rear-panel color LCD display.I spent three weeks in the UK in 2004 with the S2 and no charger, so I made a major effort not to play with the color display. I went nearly all three weeks and took 1800 pictures on three sets of NiMH batteries (I finally put a set of alkalines in two days before the end of the trip).The Lithium cell life depends mostly on flash usage. I usually got four to six months on a set. If one dies in the field, you can use the camera without them. Only the flash doesn't work.", "Date": "May 12, 2006"}, {"Title": "Very good camera!", "Author": "Alex Vox", "ReviewID": "RVPA1NC3C5TAH", "Overall": "5.0", "Content": "It is very reliable, high quality (as all that Fuji does), produces clean , clear, wonderful images with high tone quality. Camera is easy to operate and logically constructed. I've been using this one for couple of moths and it was really joy to use. It has its drawbacks but they are few and minor. Let say they are not troubles but matter of personal taste with equipment. Definitely recommend it.", "Date": "December 17, 2003"}, {"Title": "Great Camera", "Author": "B. Volk \"Life  Photos & Music\"", "ReviewID": "R32F1Q0TBON4Y6", "Overall": "5.0", "Content": "I am a photographer and i have the Fujifilm Finepix S2 and i LOVE IT!!!If you are looking for a good (easy to use camera) then this is the one to buy! It does GREAT black and whites. Color is ok on it.....you just have to work with it. But over all GREAT CAMERA!", "Date": "April 2, 2007"}, {"Title": "good", "Author": "shane", "ReviewID": "R21O11HIIH8DR6", "Overall": "5.0", "Content": "Good camera even after 10 years. The seller is very kind, the camera come with an unusual storage card, which allows me use the camera right way. Pictures taken by this camera are very good.", "Date": "December 31, 2012"}, {"Title": "Photo Editor for School Yearbook's Opinion", "Author": "D.L.C", "ReviewID": "RDEPWHK4Z6529", "Overall": "4.0", "Content": "Reviews are usually worthless to people, unless the reviewers tell the readers what is they believe in wrong with the product. I will dispense the experience I recieved while using this camera for a year as the editor of a acclaimed college prep high school's yearbook. The bad:1) The autofocus of the camera can wake the dead. If you're trying to quitely take pictures w/ autofocus, you minus well throw this camera out the window. Not only is the autofocus extremely slow compared to Canon's, but it is extremely loud. People will notice you not because of the camera, but because of the sound. It's a loud grinding of gears. If you're taking 7+ FPS (which this camera can do), the autofocus will almost ALWAYS leave you with 5 or so blurry pictures, and you will invaribly miss a good portion of the action due to the slowness of the gears.2) It eats batteries. While it eats batteries rather quickly, it does not compare to Olympus's E10. That monster will go through 4 AAs (Fully charged, 1800 NIM-H) in less then 45 minutes, WITHOUT the flash. The S2 has a dock loader that holds 4 AAs, and a bottom loader that holds dual lithiums. Should ANY of your batteries fail, the odds are it will render the S2 inoperable. The 4 AAs run the computer in the camera, and the lithiums run the camera itself. The camera will still take pictures should the AAs fail, but without the computer, there is no way to record those pictures...My suggestions: Carry spare lithiums at all times, AND carry a battery pack, such as the ones Quantum makes. Those last for 4 hours at contiunal use, with onboard flash, using 7 FPS every 3 or so minutes. Lithiums, during peak months, we went through 4 every month or so. Meaning, the average person will probably need to change lithiums ever 2 months. However, the weight of a extra battery pack, plus a external flash, will wear you down before you know it. 3) The flash is...bad. Not much you can do about it. The flash, like many onboard flashes, highlights certain areas, creating pictures with zones of highly contrasting levels of light. Parts are very dark, while other parts are washed out. Just get a external, there's not much I can say about it. Now just some accessories that you would probably find invaluble.1) 340 IBM microdrive OR 512 SM cardLots of space. This camera, on medium quality produces 2 meg pictures. If you're a shutterbug, you'll find that a 128 meg card is insufficent. However, i would lean towards the SM, because they, as a general rule of thumb, record faster. I've spent 10-15 seconds waiting for 7 pictures to record. Not fun, especially during a waterpolo or soccer game. 2) rechargable batteries. Buying 4 Duracell ultras every two weeks is going to cost a arm and a leg. Just shell out $50 for 4 AAs and a good charger, perferable a 1-4 hours. It will be much cheaper in the long run.3) 35 mm lens. Nuff' said.4) 70-300 mm lens, nothing like a telephoto lens to make your day.5) 28-300 mm lens. It's so nice just to carry 1 lens around.6) Filters for your lens. I hate dirty elements, and you never want to touch them. Cleaning a filter is far easier, cheaper and less dramatic.7) A bag, don't get a black one, nor one that says \"Photography\", that's asking people to steal it. heat is the enemy of electronics as well as humidity, get something that reflects as much heat and light as possible.8) A card reader. Even though the firewire is fast, being able to physically pull your card out and move it between comptuers as you do matainece on your camera is invaluble.", "Date": "July 23, 2003"}, {"Title": "Disappointed", "Author": "RiceWoman", "ReviewID": "RE9726MRAUR44", "Overall": "1.0", "Content": "Sorry that the camera was not as the ad had described.  Customer care was good and I was able to return the item.  Just waiting for the credit to show up in my account.", "Date": "September 11, 2012"}, {"Title": "Not a pro camera", "Author": "Carl E. Feather \"cfeather\"", "ReviewID": "R3KQSLZNLUOL1Y", "Overall": "1.0", "Content": "My first impression when I took this camera out of the box was that they forget to put the guts in the cheap plastic shell that holds this thing together. I've never owned a \"pro\" camera that is so cheaply constructed. It feels like it's ready to break at any point and will no way hold up to the beating a wedding or other pro work will subject a camera to. It doesn't get any better in use. The camera is built on a Nikon F80, a consumer body, that has been jerry rigged with electronics from Fuji. It features an itsy bitsy viewfinder that's like looking down a tunnel. The focusing screen doesn't have any split viewfinder for manual focusing, which is an absolute requirement for this thing because its autofocus system is pathetic, unreliable and simply doesn't work right. Exposure is likewise eratic.With a lot of work and a lot of luck, nice images can be produced. But if you want reliability and consistency, forget this camera. Also, don't even think about it if you want to shoot handhold below 1/125. Anything below that, and I get blurred images thanks to the lightweight body and lack of internal dampening. This is the worst body I've ever owned for camera shake problems. I have the D1H at work and can shoot at 1/15 of second with it and no blur. The Fuji would produce a fuzzy mess at that. Also, don't even think about using a cheap lens on this thing. It demands great glass. We're talking ED lenses to get \"pro\" results. It also wants Silent Wave motor focusing on the lenses.In short, buy this camera and you'll be facing an endless pit in which you'll toss money for batteries, cards, lenses and backup.Buying this camera made me appreciate my Nikon F4s bodies all the more.", "Date": "September 17, 2003"}, {"Title": "Fuji S2 Fails", "Author": "Jack Appleton", "ReviewID": "RRKRHPRD7I6UF", "Overall": "1.0", "Content": "I have a Fuji S2 which I bought on July 15th, 2003. The main logic board failed the first week of Jan. 04Jack Appletonjack.appleton@msa.hinet.net", "Date": "January 16, 2004"}, {"Title": "good", "Author": null, "ReviewID": "R39NUD3BSNDTDC", "Overall": "5.0", "Content": "flash whith nikon sb-24 is good and picture's are very good i like the camera whith a nikon and tokina lens!", "Date": "March 6, 2004"}, {"Title": "So-so camera", "Author": "Xin Li", "ReviewID": "R2611DIQI2I9JS", "Overall": "3.0", "Content": "Fuji's s2 is just so-so compared with NIkon and Canon.The imag is soft and color is not right 8 out of 10.will buy 20d", "Date": "September 22, 2004"}, {"Title": "WOW!!! BEST PURCHASE I HAVE EVER MADE!!!!", "Author": null, "ReviewID": "R3EB9QGZUDTOEI", "Overall": "5.0", "Content": "I just bought this thing from Amazon and all I can say is WOW!!!!This is probably the best purchase I have ever made. This thing is everything I ever expected and more!! It's very easy to use as well!I have bought other brands before, and this one just blows everything else out of the water! I have to say, everyone out there who is thinking of buying this, stop thinking. I bought it and I am extremely happy with it the moment I powered this thing on. YOU ABSOLUTELY POSITIVELY CANNOT GO WRONG WITH THIS PURCHASE! I GUARANTEE IT!!!", "Date": "April 26, 2004"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00006JK36"}}