{"Reviews": [{"Title": "Couldn't be Easier to Install and Configure", "Author": "Don", "ReviewID": "RLMLSD0GA8KJ8", "Overall": "5.0", "Content": "The installation of this camera is simply plugging it into a wall socket and either accessing its web based interface via it's IP address wirelessly or wired. Then from there you can set everything, like FTP upload times, new IP address, picture quality, etc. After configuring it all the way I wanted I unplugged it from my PC and the wall and mounted it where it was going to stay. After mounting I plugged it into the wall and thats it. I have done little tweaking to the setting since my initial setup, but I didn't have to move the camera, and when you have this convienence of wireless it is hard not to appreciate it.", "Date": "October 8, 2002"}, {"Title": "terrible low light ability", "Author": null, "ReviewID": "RLRJE1HINQFYR", "Overall": "2.0", "Content": "Ok, I bought this camera to watch my kid in a room while they were asleep.  I'm telling you this camera barely shows anything in anything but full light conditions.  Horrible.  If there is light though, it does ok, hence the 2 star rating.  But low light conditions, 0 star.  This camera also has buggy software and will not accept your router configuration completely.  You must not disable SSID transmission (like I had for security reasons)otherwise the camera doesn't transmit to your router either.  Now this is a basic security issue with wireless routers, you should not have to transmit your SSID to everyone in the world, not good for security.  So if you only need to have this operational in the day and don't care about details, then it will work.  But I personally regret buying it, too expensive for its performance.  Very weak in low light, almost ridiculous.", "Date": "May 5, 2004"}, {"Title": "Amazingly Easy to get Working the Way You Want", "Author": "Frank", "ReviewID": "R3QKBZM6ACG9PQ", "Overall": "5.0", "Content": "With all the features this thing has it is no wonder it is this price. I am sure the price will go down soon. I have a wireless network and I thought it would be real cool to actually have a camera that did everything itself and didn't need a wired connection to my network. I just set it by a plug and it connects to my network with little work at all. Then by entering the IP address of the camera I can configure it to upload a picture every minute to an FTP site which can then be viewed by everyone on the web. It took me about an hour to figure out how all this was working and to make a page to display the image.I would recommend this to someone who has the money or if you're like myself you can split the bill with a friend and share it.", "Date": "September 11, 2002"}, {"Title": "Dlink repair", "Author": "J. demaria", "ReviewID": "R1CK3BN97111AM", "Overall": "1.0", "Content": "I have a DCS1000W network camera that stopped working about a year after I bought it. When I called Dlink about repair they said it was out of warranty (which I already knew) and that they had no repair facility. When I asked them how to get it repaired, the answer was \"we do not repair them\" just throw it away and buy a new one. An expensive lesson..............", "Date": "August 1, 2005"}, {"Title": "Buggy!!!", "Author": "D. Nall \"HFCRacer\"", "ReviewID": "RGJRQ52CL4R68", "Overall": "3.0", "Content": "First the good.  The camera is very easy to setup, and the picture is nice.  Now the bad.  The frame rate is terrible.  I have yet to see 20fps on any setting.  At 640X480, I get 1.5fps average.  I have a DI-624 as my wireless router, and I am very familiar with setting it up, so I don't think this is the problem.  Another annoying thing is that the frame rate is very inconsistant.  One time I had the camera at 11fps.  By the time I got my wife into my office to take a look, I was at 0.6fps.  The camera will also freeze up for no reason.  I use the included software with motion detection and have been monitoring traffic outside my window as a test of the software.  It has great detection, but sometimes the camera will freeze up for 2 hours or more, so what good is the great motion detection if there is no picture for the software to monitor?  Not sure I can recommend this camera for any security operation.  So what is it good for?  Not sure.UPDATE:  I have gotten the camera to stabilize somewhat by keeping the ambient temperature constant.  I narrowed down the times it was flaking out to the time of day that the sun peaked through the window and hit the camera.  The sun was not hitting the lens, but it seemed to be heating up the camera.  I used an IR temp gun to measure the case temp and it was not over the 50 degrees celsius that the camera is rated at, so maybe I got an overly sensitive one or something.  I went ahead and bumped my rating up to 3 stars, which is probably overly generous.", "Date": "March 11, 2004"}, {"Title": "Extremely easy setup!", "Author": "A. Walczak", "ReviewID": "RGWR92PXIZSOO", "Overall": "5.0", "Content": "I bought this camera and had it setup wirelessly in about 5 minutes. Very easy to view the picture as all you have to do is type in 192.168.0.20 into your browser anywhere on your network. Was also easy to setup with WEP encryption. Great Buy overall, and highly recommended.", "Date": "January 25, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000067JZF"}}