{"Reviews": [{"Title": "This is a great camera", "Author": "Alfonzo \"Alfonzo\"", "ReviewID": "R1B3H43SJNAJVS", "Overall": "5.0", "Content": "I have two film SLRs that I use when I want to take serious pictures.  This is my first digital camera. I wasn't going to buy one until I thought they approached SLR quality.For the most part this camera takes better pictures than my Canon AE program.The features are great.  You can keep total control of every feature or let the camera do it for you.Particularly nice is the nightframing shot which lets you set up your shot in infrared and then flash it in normal light.The hologram mode which paints your subject in a laser graph before shooting to control focus and flash also works flawlessly.I was worried about picture quality, but at 5 megapixels features remain crisp and clear even when blown up by several degrees.I'd read online about some color saturation isues, but I've experienced none whatsoever.  On full automatic mode the Sony engineers seemed to have programmed the camera to create a true to life portrait.  A lot of photophiles like higher saturation, and you can get whatever degree of color saturation, crispness, et al by taking control manually.The camera is compact and portable.  You get about 1 1/2 hours of battery life during daytime use, and about half that if you're using the flash.  There's a feature that lets you know to the minute how much battery time you have left.This looks to have all the features of the 717 without the lensocentric style.Originally I was not planning on buying the telephoto lens, leaving that kind of work to my SLRs, but after seeing the image quality, fun, and ease of use of this camera, I'm getting it.Another great feature is that the camera plugs easily into any tv set to review pictures, movies, and even make a slideshow.  I was at a family gathering and this feature proved to be a big hit.As far as I'm concerned, the camera is flawless.Highly recommended.", "Date": "June 26, 2003"}, {"Title": "White Balance Issue:", "Author": null, "ReviewID": "RHNEN462W4981", "Overall": "5.0", "Content": "In response to comments below:  The auto white balance in outdoors indirect sunlight issue is just an idiosyncrasy, not a deal breaker.  It's easy to work around.  Dpreview.com suggests setting the manual white balance to \"cloudy\".  I set the mode dial to \"P\", which is program-auto mode.  Essentially it's the full auto mode except you can adjust individual settings if you like.  In \"P\" mode, which is just one click from full auto mode on the mode dial, I have the white balance setting always on \"cloudy\", and let it do everything else automaticly.  Thus, when I find myself in indirect sunlight, I simply twist the mode dial one click to \"P\", and the white balance is properly adjusted every time.  Very simple.  You can see the adjusted white balance effect on the LCD before taking the photo to decide if you like the manual adjustment....................................All the cameras in this class, like the Canon G5 and Nikon Coolpix 5400 have their own idiosyncrasies.  None are perfect.  But with the Canon and Nikon, no matter what you do, you can't change the slow auto focus/shutter lag.  At least with the Sony DSC-V1, it's easy to correct the auto white balance for indirect sunlight....... just takes one click of the mode dial and you're all set........  This camera does so so many things extremely well, don't let the white balance thing detour you from purchasing it.", "Date": "July 31, 2003"}, {"Title": "I obsessed over the purchase...", "Author": null, "ReviewID": "R3KQ5OYKCPB6Q9", "Overall": "5.0", "Content": "I obsessed while shopping then bought the DSC-V1, and I have no buyer's remorse.  I'm very happy with it. I wanted a camera that delivered a balance of flexible user control, point and shoot simplicity, convenient size and great image quality. This is my first digital camera.  I wanted to get snapshot results that compete with my film cameras for 4x6 and 8x10 photos. I'm more than a casual camera owner: I own two film SLRs (Nikon 8080s), a land point and shoot (Olympus Stylus) and a weatherproof point and shoot (Minolta Weathermatic).I shopped online in detail.  I fell in love with the Canon S50 on paper because it had great specs and it seemed the right size for my wife to manage conveniently too (she likes her Olympus Stylus).  However, I looked at test pictures on the [...] site.  The bigger digital cameras (and the DSC-V1) seemed to outperform the S50, particularly in image sharpness.In the store, I made up my mind and decided on the Sony DSC-V1. I pointed the camera all over the store and at many objects, including my squirmy kid.  The Sony seemed to focus quicker than the other cameras that I played with. The Canon S50 was not as responsive as the Sony DSC-V1.  The low-light focusing aids on the Sony DSC-V1 are impressive.  They are cool too: The lasers remind me of the alien weapon aiming device in the movie, Predator.  Biggests Pros:\"It's the lens, stupid\" -Pictures have GREAT color and image resolution!  I'm simply amazed.  This little camera does a lot with the out-of-the-box, automatic settings.  Be careful not to fall in love with all the snazzy, tiny cameras if you are fussy about your images: You must remember that you can't do anything with a zillion megapixels if your lens is just too small or, worse, plain mediocre.Autofocus Performance -It feels fast and works rather well even in low light.  Errors made so far have been mostly mine.  With practice, I'm learning about the camera's limits. Right Size -The DSC-V1 is small enough to carry and big enough to handle steadily.  I'm clumsy yet this camera is easy for me to use with one hand.Design & Features-The camera has great features and specs, and it feels solid in your hands.  The little door for the I/O ports is a nice touch compared to rubber stoppers on some other brands. For the most part, the buttons actually do what you expect. The manual is well-written and well-organized.  Browsing was enough to get me going.  Without a manual, I bet you could play with the DSC-V1 for 15 minutes and accidentally stumble on how to set 80% of the relevant features.Low Light SensitivityI impulsively snapped several landscapes in the dusk and darkness to see what they would be like.  They were exposed nicely and displayed little/no camera shake. With a tripod, this camera will do wonderfully.Cons:Software - The software that comes with the camera is a little cheesy. After visiting the supplier's Web site and downloading updates, I got the camera squared away with my laptop (Windows 2000) and desktop (Windows XP). Be sure to follow the instructions and download the USB driver for your Windows 2000 machine, first. I did not and had some trouble with my laptop.Other Image Acquisition Software -Not everybody has drivers for their software to handle the DSC-V1 camera yet.  You may have to fuss a bit to get the camera to work with your software.Price-It's high.  It could be about $100 less, and it would be more competitive.Moving up from this compact camera, the next (small) step up would be to an Olympus 5050, a Canon G5 or the Nikon 5400.  From there, you would need to move to digital SLRs.  Net: It's a wonderous gadget with great usability features. It's much more fun than my SLRs because I like the instant gratification of seeing results on my laptop. I was slow to go digital. I'm glad I waited for the DSC-V1.  In a few years, I may add a digital SLR to my toybox.", "Date": "September 18, 2003"}, {"Title": "Excellent color balance and resolution, poor battery life.", "Author": null, "ReviewID": "RSQDLBR00399J", "Overall": "5.0", "Content": "I have an SLR that I use for \"serious\" photography, and a couple of small pocket sized film cameras that I use for \"street\" photography. This Sony is my first digital camera.I use it in a digital workflow with Adobe Photoshop 7 and a Canon i950 photo printer.The color tonality and resolution from the Carl Zeiss lens is spectacular. Prints through the digital workflow easily match the best I've made from my Nikon SLR with prime (non-zoom) lenses. Photoshop makes it easy to edit the pictures, fixing light reflection spots, framing problems, etc.Drawbacks: the battery life is not great. I quickly exhausted my battery on an afternoon-long shooting expedition. I've since bought a spare battery.The camera is small and somewhat hard to hold steady. Also, if you are in your 40s or older, it's hard to see the LCD screen without bifocals.The standard 32MB Memory Stick is a joke. Get a larger Memory Stick Pro - they come in sizes up to 1GB.But don't let the nits distract you. If you are a serious amateur photographer, this is an excellent camera for you. I can't overemphasize how happy I am with the quality of the prints made using this camera and the Canon printer.", "Date": "July 30, 2003"}, {"Title": "sony has a topnotch 5MP camera in the DSC-V1", "Author": "jemaerca", "ReviewID": "R1XT7YYRY7E1Q1", "Overall": "5.0", "Content": "the sony dsc-v1 is a top-notch camera that is more portable than its competition.  it offers full manual control, 5MP resolution, and 4x optical zoom.  i do have a few nits though...pros:- 5MP, 4x optical zoom.- great image quality.- above average resolution, good tonal balance, good color response.- full manual control.- images exhibit very low noise, even at higher ISO.- image processing parameter control (contrast, saturation and sharpening).- very fast auto focus!- quick startup, fast shot-to-shot times (except when shooting TIFF).- fast write times to memory stick.- has NightFraming which allows you to focus and compose your scene in total darkness with the aid of the infrared emitter, then shoot a full-color shot using the built-in flash. very cool.- better than average movie mode.- compared to the competition (canon g5 and nikon 5400), the dsc-v1 is more compact: dimensions are 4.0\"W x 2.6\"H x 2.3\"D weighing 10.9 oz.- solid build quality.- bright, high resolution LCD monitor with anti-reflective coating that works.- battery charges in-camera, charger doubles as AC adapter.- hot shoe for external flash (limited to specific sony flashes, though).- many optional accessory lenses (telephoto, wide angle, filter lenses) available.- histogram in Live view, Record review and Playback modes- USB 2.0 means faster downloads.cons:- colors a bit washed out.- noise levels higher than expected- some purple fringing.- mild chromatic aberrations visible.- higher redeye occurrence.- RAW format not supported.- saving a TIFF file locks up the camera.- continuous shooting capability limited to 3 frames.- minimum ISO setting at 100.- zoom control is oriented differently so it will take a few tries to get used to it.- ergonomic issues: tiny menu and resolution keys, very easy to block the flash and optical viewfinder with fingers, left index finger falls right on top of the pop-up flash, suppressing it.- lots of key functions are buried in menus.- below average battery performance.- no separate user settings.- like most sony products, you pay a premium, pushing up the price.- expensive memory stick pro cards.- uses a proprietary battery so add a few bucks to buy a spare (or maybe two given the battery performance).- the supplied 32MB memory stick is inadequate - again, more $$ for more memory.- you'll need to remove from tripod to get to the battery or memory stick.sony has succeeded in delivering a camera that has virtually the same feature set as canon's g5 and nikon's 5400 but in a more compact package.  it's not perfect though.  RAW format is not supported and writing a TIFF file still takes way too much time.  and there are some ergonomic nits that is uncharacteristic of sony.  still, this is a great package and worthy of consideration.i hope this helps your buying decision.  peace.", "Date": "September 23, 2003"}, {"Title": "Great Camera!", "Author": "G.R. \"gara56\"", "ReviewID": "RFR2KYKNPM3Q4", "Overall": "5.0", "Content": "I bought this camera to replace a 4-year old 1.6MP Sony MAVICA after spending the last two months doing research and reading a lot of reviews.  Every camera I looked at had its Pros and Cons.  I just had to decide which ones were going to have an affect on my final decision.  I ultimately went with this camera, because it was small, easy to configure and most importantly met my needs.  Don't expect to find a camera that doesn't have any cons.  I fell in love with it as soon as I took it out of the box.  I spent the first couple days reading and re-reading the 130-page manual to make sure I understood the different capabilities.  You have to do this if you expect to get the max benefits of this camera.  Even now I find myself having to regularly refer to the manual for help, because I'm not a professional photographer.  This is by no means an easy camera to master in one hour.  Yes, you can point and shoot, but you still have to read the manual and make some initial setup changes. This camera is a big improvement over my old one when it comes to image quality (no suprize here) and overall capabilities. The first thing I did was change the image resolution from 5 to 3.1 MP, because the 32mb memory stick that comes with the camera only allows to you shoot about 12 images (using fine print) and 23 images (using standard print).  You can always set the image size to VGA and can take up to 196 pictures.  I say if you're spending this kind of money, don't set it to VGA, because you pictures will be ok (as with other cameras) at best.  The higher resolution will allow you to print some great pictures on photo paper if you have a good hi-res printer.  I used an Epson Stylus Photo 825 ($100) and the results were great--much better than those you get in the mall. I went ahead and bought two 128mb memory sticks to cover me. The other thing I did was disable some of the camera's sound features (shutter and power-on sound) so I could save on battery power.  I would recommend buying a second battery through the internet since it's cheaper than getting them through Sony.  I also bought a separate battery charger so I wouldn't have to use the camera as a regular battery charger.  The last thing I would want to do is bake the components in the camera just to charge one battery or for that matter a backup. Excessive heat wears down electronic components over time. After I setup the camera, I took several pictures (using the flash) to see how if performed against my 1.6 MP.  The first thing I noticed is that the camera did a great job of regulating the intensity of the flash to make sure it wasn't too bright.  The camera allows you to manually set (3 levels) the intensity of the flash for any occasion if you decide you want to go manual. I connected the camera to my TV to view the pictures and they had extremely rich colors.  I tried doing some limited image editing like changing picture size, rotate pictures, etc.  You can view multiple pictures on the camera's small LCD screen which is very nice. Everything worked well.  I haven't tried the other features yet. A lot of technology went into this little camera so you'll have to be patient.  I just scratched the surface.  It makes no sense paying a lot of money for this camera if you don't intend to fully utilize its capabilities (read the manual). This camera is small in size so you'll have to get used to it and handle it with care.  You can purchase optional wide angle/zoom conversion lenses, but using them disables certain features of this camera camera.  I guess it's because the camera lense expands and retracts and it would bump up against the conversion lense.  The conversion lense also blocks some of the light intensity of your built-in flash.  Sony recommends using an external flash when using a conversion lense.  That means a lot of extra $$$.  Don't waste your money on the optional starter kit for this camera. The camera case is ok for the camera, but the memory stick case and spare battery will not fit well.  It's too tight for my taste. That last thing you want to do is damage the camera's protective lense cover.  I bought a samsonite camera case that is a little bigger it stores my camera memory stick case and spare battery.  You can go bigger if you choose to bring along your AV connecting cable, AC adapter and USB cable.  Overall, this is a great camera. I looking forward learning its many capabilites and taking it with me on my trips.", "Date": "December 25, 2003"}, {"Title": "Excellent Camera: Blows Competition Away!", "Author": null, "ReviewID": "R23VKU6ULC4P1B", "Overall": "5.0", "Content": "I chose this camera because it is the best value for money in its class (on average, about $ 150-200 cheaper than the Canon Powershot G5 or the Nikon Coolpix 5400).The DSC-V1 simply blows the competition away:* design & weight--the V1 is less than 300 grams (10.3 oz exactly), whereas both the G5 and the 5400 are over 350 grams (17.2 and 13.4 oz, respectively);* features--the V1 has the nightshot, which is astounding; the laser-focus, which is outstanding; and an incredible array of customization and adjustment possibilities (LCD brightness, zoom orientation, to mention few).The camera also looks like a work of art and fits comfortably in your hand. The pop-up flash can startle you at first, however you get used to it pretty quickly and learn not to put your fingers there.Still not convinced? Go to dpreview.com; enjoy the V1's amazing sample pictures; and, see for yourself the \"highly recommended\" rating given to the V1 by digital camera professionals.", "Date": "October 9, 2003"}, {"Title": "Finally, a camera for webmasters", "Author": "Tom Smith", "ReviewID": "R37VZXT2WEWYQC", "Overall": "5.0", "Content": "The strong and weak points of this camera have already been covered quite well by other reviewers. I agree with basically all of them. What hasn't been mentioned so far are a couple points that I find irresistable.I often read that consumers have no need for 5 megapixels. These are probably the same kind of people who said that nobody needed a Pentium desktop computer, that it was just too powerful for the average user. Plain and simple, more pixels means more flexibility, particularly when it comes to cropping. With 5 MP, you can crop out a lot of the image and still end up with a good 8 X 10. I do a lot of web work, which generally means low resolution mages. With 5 MP, I can take one shot of a room and split the image up into a dozen or more individual web shots, every bit as good as shooting a dozen small images. 5 MP (and PhotoShop) is essential for that kind of flexibility.Analog video outputs are also high on my list of requirements. This allows me to send what's on the LCD to a television or monitor, doubling the camera's use to include live web cam usage. It also allows you to watch the LCD from afar on an analog monitor at a much bigger image than the 1.5\" LCD. Fortunately, most better cameras include this feature these days.There are a lot of 5 MP cameras on the market, many much cheaper than the V1, so what makes this one worthy of consideration? Stunningly good images through the Zeiss lens and 640 X 480 videos with sound. This camera is small enough to carry around all the time, and you can take an acceptably good web movie on the spur of the moment at any time. With a 256 MB memory stick, you can even take 640 X 480 movies with sound for 10 minutes or more. As memory sticks get cheaper and larger, we will soon be looking at hours of video. The 1 GB stick already can hold almost 45 minutes. The rate limiting factor right now is cost. When 32 GB sticks are out, the 1 GB stick will be standard issue at less than $100. People will laugh that any camera ever came out with only 32 MB.Large, cheap storage capacities are coming quickly. The news as of 9-1-03 is that there is now a material which will allow transistors to be painted onto cheap plastic, rather than the expensive etching of silicon that we currently see today (see this at the Science News web site). High capacity storage will be dirt cheap inside a couple years, so I'd suggest you buy just enough storage to tide you over. 1 GB right now costs as much as the camera itself.Who shouldn't buy this camera? Anybody who can't come up with the scratch. If it's going to hurt, buy something cheaper. If money and portability are only small factors, you might want to consider the F717 instead. Images are a little bit better, and ergonomics are better as well. Also, anybody who can't get past the \"point and shoot\" mentality is buying a lot of power here that they will likely never use. If you are a \"point and shooter\" looking to be a good photographer someday, this is an excellent place to start. Probably the best choice out there for these people. Combine this with the \"Seven Books in One Digital Photography for Dummies\" and PhotoShop (even the lite version) and you've got a stunningly powerful image capturing and editing system that anyone can master. Combine it with one of the Sony photo printers and you'll get archival-quality pictures that last over 100 years. Ahhh....If high res and portability are high on the list, then you can't go wrong with the V1. It never leaves my side, just like the cell phone. I'm a believer.", "Date": "September 3, 2003"}, {"Title": "Excellent Camera!", "Author": null, "ReviewID": "R1N4C8Y91SAUD9", "Overall": "5.0", "Content": "Aloha,This is a fantastic camera.  I did months of research and was all set to buy the highly rated Canon G3.  Caught wind that the G5 was soon to be released, thus delayed the purchase to see what the G5 offered.  The day came, went to dpreview.com to read the G5 review.  Stumbled across the Sony DSC-V1 review and knew right away, the Sony was the way to go for me.Why?  One central reason.  The Sony DSC-V1 takes just as good photographs, yet does it with an auto focus lag and shutter lag that is *twice* as fast as the G3/G5.  The DSC-V1 is just like using a film camera, you hit the button, it takes the picture, with almost no lag.The DSC-V1 isn't perfect.  Battery life is ho-hum, a second battery is a must.  At first it wasn't comfortable in the hand because of the small size, yet I've since gotten used to it and it doesn't bother me anymore.All in all, I'm very very pleased with the Sony DSC-V1.  It takes great photos and is plug and play on my PowerMac running 10.2.6.Highly Recommended!", "Date": "July 25, 2003"}, {"Title": "Great digicam", "Author": null, "ReviewID": "R3JQWO1Z3N8GZP", "Overall": "5.0", "Content": "I have had this camera for about a month, and have already taken 500 pictures. Before V1, I mostly used Sony DSC-S85, although I also played with many other digital cameras over the years. There were a couple of things that annoyed me about S85 -- slow focusing (often over a second), and the large size. The V1 is small and incredibly fast at focusing -- 0.3 - 0.4 sec according to dpreview.com. Compare this to G5 and the other cameras in this class.  Some other highlights of V1:* Noise reduction for images with long exposure. I have taken some night-time pictures with exposures of 5 seconds, and they look great.* The focus is quite accurate, even when shooting in low-light conditions. Definitely better than S85. * This is apparently the first Sony camera whose firmware is user-upgradeable. Sony recently released firmware V.2 that adds several new languages. The next release may address the white balance problem (although I personally haven't experienced it). * This camera can use the larger memory sticks (up to 1GB currently). * There is a decent movie mode (640x480, 15fps). The duration of movies is only limited by the size of the memory stick. So in some special cases V1 can double as a video camera. * Very good image quality. The lens is slightly smaller than S85's, but the pictures look at least as good. Some downsides:* The battery is pricey and doesn't last very long at all. I can shoot about 80 images before running out of juice. Spare batteries are quite expensive. * No dioptre adjustment on the viewfinder. Overall, the V1 has exceeded my expectation. This is the first camera that I like almost everything about, and don't feel the urge to return to the store.", "Date": "August 4, 2003"}, {"Title": "Great camera.. needs a bit of tweeking..", "Author": "Rose M. Swinson", "ReviewID": "R1Z3KA2Z68SLCG", "Overall": "4.0", "Content": "When I started looking for a new camera to replace my DSC-S75, the first place I looked was Sony and I'm not sorry that I did.  I've owned Sony digital cameras for 5 years now and have never had any problems with any of the ones I've purchased (for me or my family).The V1 is a nice package... much more compact than the S75 and definitely the 707 or 717... but is much nicer to handle than any of their smaller Cybershot models.  It seems to have about as many features as the 717 .. except at a fraction of the cost.  Now I'm not a professional photographer, and I fumble around with the controls .. not quite sure what everything does.... So the manual is an important feature for me. This one is well written and answers questions quickly.  Picture quality is superb!  Instead of having the sizes set to 640x480 .. 1280x960 .. or any other combination.. the V1 uses the  megapixel ratings to let you know the size.. ie:  VGA, 1.2M, 3.1M, 5M, etc .. It really lets you know the size your images are going to be when you download them onto your computer.The nightframing & nightshot features are very cool!  You can take a picture .. in pitch black.. and it come out with excellent .. true to life color.The *only* thing that I have a problem with, is the power saving feature.  Once the flash fires, the LDC screen turns off and it 'powers down' for about 30 seconds while the flash recoups.  It comes back on, but that's precious picture taking time that you can't capture!  The S75 has a much better recovery time after the flash fires.  Sony needs to work on that one!  I would usually leave the red eye reduction on, and be able to shoot anytime w/ my flash as a fill... but now that's not such a great idea.  Guess I'll have to buy a flash for the hotshoe and hope that's not an issue there.Ok, so there's two issues.. Where the popup flash is located.  It really is not ideally situated .. as it's right where your finger would be on holding the camera. It's no biggie to retrain yourself to hold the camera different.. it's just gonna take a bit getting use to.All in all, I would recommend this camera.  The pictures are great!  The zoom is fantastic!  The color is true to life!  And the price is reasonable.", "Date": "July 25, 2003"}, {"Title": "Sony CyberShot DSC-V1: To Buy or Not To Buy.", "Author": "R. W. Gonzalez", "ReviewID": "R1G6BWITG6EWWL", "Overall": "5.0", "Content": "I must begin by explaining that I got back into the digital camera market having to replace my Kodak DC240 which was purchased (and cutting edge with 2.0MP) in 2000.  The DC-240 finally went dead and I took it to Best Buy who, on their warranty, gave me the purchase value towards another camera, and thus the DSC-V1.  I have had the DSC-v1 for a little over a week now and have some interesting insights.  I generally look to Amazon for reviews and hope that you will find this one useful.  Please know that I am not a professional, and don't know a whole lot about photography (had a couple of classes in undergrad.)To set this up, I have a friend who, upon hearing that I had this money to spend, recommended that I buy a digital SLR.  Sounded great, but I wanted something that would fit into my pocket.  I was looking at a Kodak with 10x zoom, but when I went to purchase it, I realized that it did not fit into my pocket.  I am more prone to grabbing my camera if I can just toss it in my pocket and take it to a party, to shoot art, or take pictures of my dog!  So now to my take.  Please note that these are not necessarily pro's or con's but observations.-5MP WOW!  Image quality is great.  Coming from a 2MP, I am blown away!-USB2.0 is fast and a definite sales point to this camera.  Make sure you have 2.0 on your computer if you are planning on shooting large images!-The rechargeable battery is nice.  I don't know if I am sold on it yet though.  I am still pondering buying another battery should I be on vacation away from an outlet.-People have complained about the controls, I have big hands and they are not a problem.-I do have a problem holding the camera.  Go hold one before you buy it.  I like the camera and knew this going into it.  My left hand has the tendency to hold down or cover the flash, My right index finger has the tendency to cover the viewfinder.  I will learn to live with it...- The camera has tons of features, which was one of my reasons for purchasing it.  They can get a little confusing though.-If you are looking for a simple point and shoot, or a camera for your grandmother, this is not for her/you.-The display, although small, is adequate and clear.-I was looking into cameras with a greater zoom.  This 4x works great.-The camera works quickly with 5MP images allowing you to quickly zoom in and out and scroll through them.  The LCD displays them clearly-Menus are clear and precise.-The ability to control aperture, shutter speed, and focus is great.  It gives me the ability to treat this camera like an SLR.-The night framing/shot features are nice for shooting at night or indoors.  They allow you to frame a scene on the LCD before shooting the image.-The hot-shoe is a nice feature as I can connect this camera either to a professional flash OR a professional lighting kit to allow me to shoot artwork.All in all, this is a great camera.  If you are just looking for a point and shoot, this camera is not for you.  It is a lot of camera packed in a small package.  Be prepared to read the lengthy manual several times before getting SOME of the features down.  Also beneficial is some knowledge of basic photography, as terms such as metering, ISO, f-stop, and shutter speed are used often, and to fully understand the camera, working knowledge of these terms is necessity.", "Date": "June 29, 2004"}, {"Title": "Great value in a very nice package", "Author": "NewType", "ReviewID": "R1N30GNJIZVVI2", "Overall": "5.0", "Content": "Having learned photography on a film-based Nikon SLR, I'd been hesitant as well as disappointed with digital camera until now. I wanted a camera whose price wasn't too far in the pro territory, but I also wanted a camera that didn't make me feel like I was giving something up by going digital.When shopping for a camera, the things that were most important to me were:-shutter response-image quality-manual controls-intuitive menus and controls-image resolution-compactness-battery lifeI considered these all requirement, and set my standards high by deciding not to buy anything that would compromise any one of these things. These are all things digital cameras SHOULD have because if even one condition is lacking, the camera simply isn't good enough, bottom line.I'd tried out a friend's Canon G2, but absolutely hated it because of the shutter lag - the delay between you depressing the shutter and the camera taking the picture was just intolerable. The image quality and resolution was nice, but I also found the camera too bulky for my liking. I mean, the whole point of going digital was to lose some of the bulk, right?So I waited. I began eyeing the Minolta F100 and eventually the F300. I heard it had fast response. It had a very compact body (especially considering the 5 MP resolution of the F300) and while the image quality wasn't as nice as the Canons, I felt it was good enough that I could live with it. Plus, it had a full range of manual controls - I wanted to play around with long exposure shots or change the f-stop according to taste, and the F300 seemed to fit the bill.However, one thing that bothered me was that the Minoltas had very bad battery lives. I did some research and people were complaining about batteries running down after 50 or 60 shots using rechargeable NiCads. My friend's G2 could shoot 400+ shots on a single charge, which was one of the benefits of its bulk. Not so with the Minolta - the thought of having to change batteries on essentially the equivalent of two film rolls made me hesitate about purchasing.Canon also came out with the G3, but while the speed was much improved, I didn't like its bulk. The Canon S50 was essentially a smaller version of the G3, but I just didn't like the black-colored body compared to sleek silver. Yes, this seems like an especially minor point, but would you buy a car that came in a color you didn't like? If I was going to spend $... for a camera, I wanted to feel good about it.Then the Sony V1 came out. Within minutes of reading the review at dpreview.com, I knew this was the camera I wanted. I quick trip to Best Buy to play around with it confirmed my feelings. This camera is great for its price!The Sony DSC-V1 met ALL the requirements I listed above, with some extras such as the Nightframing and Nightshot modes. Battery life is good - about 100 to 200 shots, depending on flash use (the camera uses superior lithium ion batteries). It's got 4X optical zoom. REALLY easy-to-use controls and highly accessible menus (another thing I hated about the Canons - awful, convoluted menus!). The autofocus is very impressive, courtesy of the holographic metering system. I love the manual controls, too, but the thing that really seals the deal is the jog wheel that is present on nearly all Sony electronic devices. The jog wheel makes going manual a joy, instead of a frustrating experience of stabbing at buttons. If you've ever used film-based SLRs before, you'll know what I'm talking about.In addition, the V1 supports the new Memory Stick Pro format, which is much faster than the standard Memory Stick and also faster than either CompactFlash or SmartMedia, I believe. The Pro format offers capacities up to 1 GB (I bought a 256 MB Memory Stick Pro with mine - well worth it, as the price of the 1 GB stick is as much as the camera itself at this point!).The V1's firmware also appears to be upgradeable, as dpreview.com noted recently. So hopefully the problem of white balance in indirect sunlight will be corrected via a software update in the near future. But as I said, using the manual controls on the Sony is so easy due to the existence and placement of the jog wheel, it hasn't really been much of a concern for me.The only major disadvantage I can think of is that Sony doesn't seem to have too many accessories for the V1 yet. Some, like the external flash units, look ungainly and definitely don't look like it was designed for the V1 (more like the V1 was designed to support exisitng flash units). Hopefully, Sony will increase the offerings of accessories, but for now, the V1 is satisfying enough that I will be more than happily shooting away for quite a while.", "Date": "July 19, 2003"}, {"Title": "at last !", "Author": "G. peck \"gpeck@arctic.net\"", "ReviewID": "R2D3OZ4EPWCNPO", "Overall": "5.0", "Content": "Never mind the picture quality, this little camera works !  I toothed on an Olympus D4040 and i was never able to penetrate its menu system, so i used it at only the most rudimentary level.The sony and i hit it off immediately. Not to say i understand them all, but after two days i can waltz through every feature. What i particularly like about the Sony is:1. the shutter button is always where i expect it -no more frantic groping2. sony has reached a nice balance between burying a feature in a menu and providing it a button on the back.3.The electronic lens cap...love this...no more fumbling with a lens cap that, at altitude and cold, sometimes requires more than the available dexterity. I can fully  operate this camera with gloves.4.the LCD is so sharp that i can photograph a topo map [@1.2 M ] before a hike, and, on the mountain,  zoom and move around on the map better than the original. Very cool !!5. the 40 second audio recording feature is handy to record details of a shot.6. the 10 minutes of video [on a 256 M card] is useful.What i dislike about the camera is the pathetically small battery...the lithium provided weighs less than half an AA ...my Olympus would run for months on 4.  Understandably, the Sony is lucky to make it through a day on one.The flash is another minor problem...it wants to come up under your left finger, but since i rarely use a flash...i don't care.", "Date": "November 3, 2003"}, {"Title": "No more 35mm neckwear.", "Author": "Ray B.", "ReviewID": "R2HMPH2Q5B6OWV", "Overall": "5.0", "Content": "Going from 35mm Nikons to digital cameras is a real culture shock, some change can be good. We wanted a compact digital that could perform like a 35mm Nikon, we compared all the 5 mega pixel cameras and the DSC-V1 won hands down. The Zeiss lens system (zero plastic elements), \"night shot\" and the overall size all are major advantages but the suberb picture quality andthe myriad of print options make this camera a true joy to use. The focusing system on the camera is the most sensitive available and the manual modes give you total control of any shooting environment. Add a DDP-5EX printer and you have camera to print in less than 2 minutes and you don't need a computer! One down note buy an extra battery, they last about 80 minutes in the DSC-V1. This is one investment with great returns, enjoy!", "Date": "November 9, 2003"}, {"Title": "Better than I thought", "Author": "B. Scott \"scottwj\"", "ReviewID": "R1N7WKGK6ZS5BI", "Overall": "5.0", "Content": "My third digital camera: Olympus 1.3MP, Canon 2.1MP and now this.  I considered the Canon S50 & the 5MP Pentax. I choose this one after reading the reviews on dpreview and checking with my local Sony Shop that they would repair it if it went wrong (the Olympus & Canon have both needed repair - within 12 months of purchase - & both manufacturers have fixed them for free and without hassle (I'm now much more confident buying from the U.S. into the U.K.).The camera is better than expected as I don't find the balance as difficult as the reviews say, nor do I have a problem with the flip up flash - it becomes second nature after a while (I've had the camera 2 months).  The camera is a little bit bulky and I can't carry it in my shirt pocket but a belt case has solved that problem.  I've found a second battery useful, although I can only recharge via the camera as I have not yet got a separate charger.  Have not found this an issue and I have been out all day with the camera.The video option is great. I've never really taken to video but this camera (and my three-year-old) might just convert me. It is easy to use.  You can't zoom when videoing nor does the flash work but the quality is acceptable and sound much better than I thought it could be.Recycling to take another picture can take a time but it seems that the flash is the slow-coach and pushing it down allows the camera to come back quicker whilst the flash is charged in the background.The low-light focussing is good, although the very-low contrast focussing uses a red hatching that is displayed on the subject which can be disconcerting and distracting for the subject.  It does allow, however, the camera to be held aloft for a different angle and the area being photographed confirmed.Overall a great product.  No buyer guilt even though I'm now the proud owner of three different types of memeory card.", "Date": "September 27, 2003"}, {"Title": "the perfect camera", "Author": "J. Romano", "ReviewID": "R1T2P2A0XINO8J", "Overall": "5.0", "Content": "if you are a casual photo enthusiast, this is the camera you want! I bought this camera in Dec 2003 after much research, and after buying (and returning) the Sony DSC-P10.  This V1 model has everything you want- fully manual exposure control (which the P10 does NOT have), compact size, a great Carl Zeiss lens, and 5MP resolution.  I had been an Olympus digital camera user for the past 3 years, and loved the image quality... I had some concerns about the lens quality of the Sony cams, but after some tests and comparisons, I am more than pleased with the V1.  And at half the size and more than twice the resolution, this is a killer camera at a great price!", "Date": "December 2, 2003"}, {"Title": "Fantastic camera with only a few shortcomings", "Author": null, "ReviewID": "R37B0BWE3PYBTQ", "Overall": "5.0", "Content": "Let's face it, THE reason to buy a digital camera is to get many features in a small package.  The V1 does just that and takes fantastic photos.  It's basically the F717 in a point-and-shoot package.Pros:4x Zoom lensCompact sizeFull manual controlsFASTEST auto focus available, even in low light (laser assisted)FASTEST auto focus, even with NO light, very cool IR NightshotDATE label your prints....a rare feature on digicams (for some strange reason.)Cons:Relatively short battery life, you WILL need a backup SLOW recharge of flash, up to 10 second delay between flash photosShould come with a separate charger instead of tie up the camera for charging dutiesBAD location for a pop-up flash...akward to hold such a small camera if you can't put a finger on the top cornerMemory stick is still a more expensive storage medium, but at least the capacity has increased with MS ProI've owned a lot of digital cameras (10 of them, in fact), and the V1 is the very best.  My last was the Nikon 5700 which took very good photos but was hard to use and set up.  It also lacked some basic features such as a focus assist lamp (very frustrating.)  The Canon G5 is a worthy competitor, but it lacks the Sony's low light capability and costs a bit more.  Give the V1 a look before you buy.", "Date": "June 5, 2004"}, {"Title": "The Sony DSC-V1 rocks", "Author": "S. Mansour", "ReviewID": "R2CPLIA1LZ1OW3", "Overall": "5.0", "Content": "I invested 3 months of researching and reading reviews on the internet about digital cameras. The Sony DSC-V1 rocks. I have used it for 3 days and I am very impressed with the photos and the ease of use. Sony was the 1'st company to make digital cameras but Canon had been doing a better job until now. The Sony model is clearly a winner over the Canon G5, S45, S50 models. I personally compared the G5 and the DSC-V1 in low light conditions and inside the house and the Sony is clearly a superior camera. It is true that Canon G5 can sometimes produce better pictures in good light conditions but if I can not shoot good pictures in all light conditions then the camera is not a good choice!, the Sony V1 is highly recommended", "Date": "October 25, 2003"}, {"Title": "Very nice", "Author": null, "ReviewID": "R2JK81L12W0Y1J", "Overall": "5.0", "Content": "This camera takes fantastic pictures--partly due to the Carl Zeiss lens.  The colors are acurate, the autofocus is quick, and there is essentially no shutter lag.  Have had no problems with it so far.  Battery life is average only.  Rec second one \"just in case\".  There is indeed a delete all function (delete folder), so ignore that comment from someone else below...it's in the manual...  THe LCD is somewhat small, but sharp and clear--even outside.  You can easily magnify your pictures in review mode if needed.  Rec using adobe photo album and element 2 for your pictures, much better than camera's software.  Make sure you compare prices before buying it (ie, epinons.com)", "Date": "December 7, 2003"}, {"Title": "Beautiful, but not perfect", "Author": "XAVIER EYCHENNE", "ReviewID": "R2YU5IGVICMLKK", "Overall": "4.0", "Content": "This Camera is excellent. It has lots of advantages over other cameras.I also own a Sony DSC S-85, and a Canon S-400.Both of them excellent Cameras too, but with a different consumer target.Sony took some of the best features from the S-85, which is a \"Prosumer\" camera, and made it much smaller, like a compact \"point and shoot\" camera.These characteristics give several advantages to the DSC-V1.If you are the average photographer, you will probably just use the camera to point, shoot, and enjoy! And of course, you will want it to be handy and small.The DSC V1 will do that without a problem, using the Automatic setting, but you will have to learn some basics, (as with all other cameras). If you are learning photography, you are an amateur, or a Pro photographer that wants an small and excellent camera for hanging around, you will truly enjoy the Manual settings, as you can learn and experiment playing with the aperture, the speed of the shutter, the EV, the scenes, the effects, etc.Another great thing is that is not an expensive camera. Comparing the camera with other 5MP cameras, for example, the also beautiful (point and shoot only), Canon S-500, we will see that the prices of both cameras are almost the same. The Canon S-500 is smaller, takes beautiful pictures, and, of course, is a Canon. But the DSC-V1 has a lot of more features, and the best: it offers the manual modes...Fortunately, there is a way to be better camera shoppers, and to learn everything about some of the best selling cameras in the market: [...] is an excellent internet site, that offers professional reviews for lots of cameras, comparisons, lessons, etc. and features of most of the cameras from the top brands.Also, this site contains an excellent review about the Sony DSC-V1, in: [...]As the great photographer Phil Askey tells us in his review, there's an ugly error in the DSC-V1: The Automatic White Balance. For some strange reason Sony simply didn't put the correct temperature settings in the sensor. So, either if you are a \"point and shoot photographer\", or an amateur, you will have to learn and dominate the use of the Manual White Balance feature. No questions asked. That's why I'm giving this camera four stars, even though I love it and I would give it 6 if I could and if the White Balance was at least Average. Good luck on your search", "Date": "May 5, 2004"}, {"Title": "not going to get much better than this", "Author": "gillian pilgrim \"Roberta Jean\"", "ReviewID": "R842JLXYGWBQR", "Overall": "5.0", "Content": "I love this camera.  I'm not going to get into a bunch of details, but I've taken photos aboard an aircraft carrier, inside museums, out in the swamps, at sunrise on the beach... never less than outstanding quality photographs - any bad photos were my fault entirely.  easy to use, fun to play with, small, lightweight... I love this camera.", "Date": "October 4, 2004"}, {"Title": "JUST AMAZING!!!!!!", "Author": "OAR", "ReviewID": "R9PMNF0LBUP6", "Overall": "5.0", "Content": "I bought the sony dscv1 about 3 weeks ago and I've already taken more than 600 photos with it. I have to say it is almost perfect... It's difficult to believe how this tiny little camera take superb photos with extremely true-live colors. This camera can work in fully automatic mode; scene mode where you tell the camera if you are shooting a beach, lake, landscape, snow scene, night scene or portrait night scene. If you want to you can work fully manual changing the aperture from f2.8 to f8.0, shutter speed from 30 sec to 1/1000 sec, and ISO (the image sensor's sensitivity to light) from ISO100 to ISO800. Other modes like shutter speed or aperture priority are available too. The nightframing function let you see through the LCD screen in completly darkness, so you see all with a green tone but when you press the shutter the flash pop up and record the image with natural color... if you want to you can  also record images without the flash using the nightshot function. The hologram AF works pretty well, you just press the shutter half-way down and the camera produces a lasser pattern that \"paint\" the subject helping the camera's foccusing system and showing you what portion of the scene are you pointing. Another great function is the live histogram, this is a graphic where the camera tells you if the picture you're about to take will be under-exposed or over-exposed, so this is continiously changing as you focus on a different subject or as you change the shutter speed or aperture.You can get interesting effects changing the white balance from the factory pressets light sources or telling the camera what is white just framing a white subject under the lighting condition you are working.Other functions include:- changing the focus operation from single focusing (you press the shutter halfway down to focus) to monigoring aF (you don't have to press the shutter to focus) and continuos focusing.- AE lock function. To measure the exposure of any portion of the image so after that you can recompose the picture and shoot with the exposure fixed to that especific portion of the picture.- You can record tv size video only limited by the memory stick capacity.- Can record pictures with sound. (Pretty cool function)- The camera can take 16 pictures in succesion each time you press the shutter with the multiburst function or If you want to you can record 3 pictures continuosly with the burst 3 function. You can also make animated gif putting together consective images.- You can record your images in tiff mode or as a jpg file. Tiff images are not compressed so the image quality does not deteriorate. The only bad thing about this camera is the 32 mb that come with it, since each 5 MP picture in fine quality will be at least 2.0 MB, so you will have to purchase another memory stick. I recommend the sony 128x2 (256 total)Well this is a great camera and it can work as a point and shoot camera, as a fully manual camera or even as a video camera.Thanks SONY!!", "Date": "March 14, 2004"}, {"Title": "Great camera.", "Author": "Heather Penrod", "ReviewID": "R7Q5VGWLO8BGY", "Overall": "5.0", "Content": "After much research, I decided on the Sony DSC v-1. I am extrememly pleased with my purchase. I considered the Canon G5, but did not like the larger size and the longer shutter lag. ... I'll admit the zoom is a little annoying (zoom control is up and down, rather than left and right), but all in all the camera is up to par with what I have come to expect from Sony. The pictures are crisp and clear with excellent color. The camera is fast from startup to picture capture. Highly recommended.", "Date": "August 20, 2003"}, {"Title": "Despite autofocus problems, the best choice for its category", "Author": "Interloper", "ReviewID": "R3KJE64XTOJXU3", "Overall": "5.0", "Content": "I bought this camera 6 months ago but I waited with writing this review until I have enough experience with it. All in all, it's the best choice available in its category, i.e. a compact camera for high-quality photography and unlimited video capability.Plus:-> Compactness. I used to have a non-digital photographic camera and a non-digital Sony video camera: the two together took the better part of a rucksack... The V1 fits into my breast pocket, and knows everything the old ones did.-> High-quality 5 megapixel photos with the Zeiss optics-> Unlimited 640x480 MPEG video capability, with surprisingly good low-light performance-> On-board cutting of videos possible (spares memory)-> Nightshot and nightframing (more of a toy, really)-> Fast USB connectionMinus:-> LCD panel cannot be folded out. This is really annoying when shooting over a crowd or making self-portraits etc. Would not have been a big deal to add this feature.-> Sluggish and rather unstable autofocus, esp. in video mode. Often, when shooting at a subject with a distant wall in the background, the focus periodically oscillates between subject and background. This is surprising as Sony does not seem to have this problem with its analogous video cameras. The problem can be circumvented by manually setting the distance.-> Short battery life (ca. 90 min.), as noted by others.-> No zooming in/out while shooting video (presumably due to power supply constraints?)The other option would be to buy a dedicated digital videocam with still capability. That would do better in the video compartment, at the cost of still image quality. I vote for a dedicated still cam mainly because the quality of still images we make today seems good enough to stand the test of time, while the videos we make today (including professional ones) will only be good for a laugh 10-20 years from now. (640x480, really! And such a drastic quality loss in the compressed format...)", "Date": "August 24, 2004"}, {"Title": "This camera is the most amazing camera i have ever seen", "Author": "joel rosen", "ReviewID": "R1VVXIIBDO8TCB", "Overall": "5.0", "Content": "Hi thereAfter my very bad experience with a casio camera, I bought this camera for just about 150 dollars more than the casio had cost me. this camera however, was about a thousand times better than the casio camera. the nightshot is excellent. movies are great. the carl zeiss lens is something I worship every time I use this wonder machine. the display is fantastic. the menu toggling is extremely fast. the pictures are high quality and taken with  5.0 pixels. the shutter is awesome (just the other day I took a picture of a friend playing baseball, and it showed the ball coming at her in the air without any trails. the picture was crystal clear and awesomely sharp). the camera is only about 700-800 dollars (plus or minus), but it is just like the professional journalist cameras (except its small enough to fit in your pocket). you can put on all these effects like negative, sepia, and solarization which are all really cool. the camera is very light and nice to carry around. and lastly, all my friends remark on the cool design. this camera is really worth getting. I have not at all been disappointed.the camera is all sony's years of expertese put into something barely 9cm big. If you want a camera which is affordable, takes extremely  high-definition pictures, has amazing mindblowing features, and can fit into your pocket.... then the sony dsc-v1 is what you have always wanted.I promise you its the best on the market, and will be for some years to come.Good luck to you on your purchase.joel rosen", "Date": "May 13, 2004"}, {"Title": "Wow...", "Author": "A. Pieterse", "ReviewID": "R3OJXYZYWQEN62", "Overall": "5.0", "Content": "I have probably beaten everyone out there on the amount of time I spent researching and shopping for this camera. I was going for the Sony P10, but decided I wanted more than just a point-and-shoot camera. The V1 is it. For the price you get so much that I am not even sure when I'll get around to testing everything out. I am particularly excited about the nightshot feature which takes the greatest photos in low-lighted or even pitchblack surroundings. My only complaints, and I have read other reviews complaining about the same things, are that the battery life really is too short and you definitely need to get another memory stick (I bought a 256MB memory stick pro). Other than that, purchasing this camera will bring you hours of pleasure at a time and will capture those unforgettable moments (in still or in movie) as life-like as you would like to remember them. Buy it now!", "Date": "October 17, 2003"}, {"Title": "Sony V1 the best you can by in clarity and performance", "Author": "L. Jones \"OCwildlife\"", "ReviewID": "R95O7W1Y74SX0", "Overall": "5.0", "Content": "I had my older sonyFD88 stolen, and was devastated. After a few weeks of undecided confusion, I made a list of all that was important to me in a small camera. I think I made the right choice. The Sony V1 won out, hands down. The clarity in the photos were stunning, and also one of the first thing I noticed was its indoor low light situations looking so great with little \"noise\" or blur. I also love the ability to add lenses with the thread availability of the sony 4x lens. I have had so much fun with macro lenses and filters, and also with a threaded adaptor a tele lens, that doubles the 4x. That surpasses all the small 5 megapixel cameras. This camera has allowed me to enhance my creative juices and rivals with some of the more expensive models, and yet I just throw it in my purse. People are really surprised when I tell them what camera I use, as the normal everyday photographer has no idea what potential they have in their hands when they buy this beauty. It has all the bells and whistles of cameras in the $1000 range, and I compare my photos every day with that scenerio. its a great camera with admirable learning curve as the more you use it. Great buys on it right now too...", "Date": "August 6, 2004"}, {"Title": "It's a Sony.", "Author": "Shahin Jahromi", "ReviewID": "R3A3KUDFLGDNME", "Overall": "4.0", "Content": "Excellent picture quality, I am no expert, yet I can easily see the diffence between my pictures and my friends' Canon and Kodak cameras. Size is pretty decent, I carry it everywhere in my pocket ( that's if I don't mind a bulky pocket though ). The night vision makes people go aaaawwww, but is not as practical as it initially sounds. I got a 256Mb pro stick for movies, and I am pretty happy with it. I could use a stronger optical zoom, and certainly a different location for the built-in flash. Bottomline, I love my camera. It's helping me store my memories in better quality than ever.", "Date": "July 9, 2004"}, {"Title": "Exceptional !!!", "Author": "W. Desai", "ReviewID": "R1ODYHB5FOZALL", "Overall": "5.0", "Content": "I was looking for a compact camera with some manual features. I was considering Kodak LS753 / Sony P100 / Canon S410I found this Sony DSC-V1 open box and bought both DSC-V1 and Canon Powershot S410 from BESTBUY to compare the quality. (S400 seem to give better picture quality than S500 because the compactness for S500 5mp size)  Sony MemoryStick write speed is quite impressive and time between pictures is really small. However flash takes a while to get ready. In case of S410, the time to write to compactflash is too long and flash takes a while to get ready between pictures.  DSC-V1 pictures in low light are just amazing. Nightshot is just perfect. MPEG recording is really impressive. Carl Zeiss lens performs equally good as a Canon or Nikkor lense.  Manual features are great and LCD screen is reasonable size. Close focus pictures really come out well as compared to Canon. Battery life indicator is a plus over S410  Negative aspects are -  - the cost of the camera and cost of the accessories being a Sony product.  - the battery needs to be recharged pretty soon.", "Date": "August 3, 2004"}, {"Title": "ANOTHER EXCELLENT SONY CAMERA", "Author": "Andreia Hamada \"deca-10kmaniacs\"", "ReviewID": "R1K3NP4TX3CQUY", "Overall": "5.0", "Content": "Before you buy DSC-V1, here are some tips about it:The camera is excellent, considering image quality and features. You can manually set the functions or set the automatic mode (helps beginners but provide features for more advanced photographers - get the manual in Sony Website). The image is better than P92, for V1 has bigger Carl Zeiss lens. P92 is very very easy to use, but V1 has a range of features not available in P92.1) it requires extra memory stick (which, as you might now is more expensive than compact flash). 256Mb is recommended. 128Mb provides 80 photos full-quality. (any 5.0 Camera, whatever the brand, needs extra memory though.)2) Spare battery would be useful. The NP-FC11 lasts about 80 minutes and take 2hrs to recharge.3) Unlike old Sony cameras, you can take pictures faster (whether P32, P92 or V1), but when using V1 with flash, you need to wait few seconds to energy recharge (a bad thing if you need the flash and don't want to miss a thing) - but it's like 3 seconds.4) A very nice feature is the nightframing and nightshots - it has infrared visor for very dark places.Comparing to P92, the improvements are amazing. I used them both and found P92 easy to use, but V1 has many useful features, better for those who want to make creative or art photos.", "Date": "April 6, 2004"}, {"Title": "Great Camera", "Author": "William R. McMurry", "ReviewID": "R39J7B2P8LS718", "Overall": "5.0", "Content": "I purchased this camera to eliminate the use of my film camera.  It was worth it.  The picture quality is just as good if not better than my Canon Elph APS camera.  If you are a point and shot photographer use the Auto mode.  If you like more control over your shots, you can do that also.  My only complaint is the 32 MB card that comes with it.  Get a larger memory stick.", "Date": "January 20, 2004"}, {"Title": "Great Camera", "Author": null, "ReviewID": "R20V4NFCBU2IVZ", "Overall": "5.0", "Content": "I had a hard time deciding between this camera and the new Canon Digital Elph 500I am upgrading from 2 previous digital elphsPros:Excellent digital photos (better than my last Elph S400)Excellent night shotsMore features for advanced photographersFaster shutter speedsBetter flashCons:Price for media very expensiveNo battery recharger included (have to charge inside camera or buy a separate charger)Larger sizeFlash in awkward placeSoftware very bad....Canon's software better", "Date": "April 8, 2004"}, {"Title": "Excellent for cross over from amateur to semi professional", "Author": "Mayank \"Monks\"", "ReviewID": "RCENM4NPQ9TMT", "Overall": "5.0", "Content": "I got my V1 about a months ago and I haven't stopped using it ever since. The pictures are very crisp. In the manual mode I can pretty much do anything. The joy of my life came when I froze a falling drop of water at a 1/2000sec stutter speed. I even got it a tele lens that increases the zoom to approx 7X. Some one who does a lot of wild life photography will certainly appreciate the Night shots.It has a wide array of features and they all add an extra special tag to this camera.", "Date": "November 16, 2004"}, {"Title": "Very pleased with this purchase", "Author": "Genghis", "ReviewID": "R3O63UZ23UHJ0G", "Overall": "5.0", "Content": "Excellent camera with great quality in a compact package.  Good ergo.  Clear view screen.  Excellent in-doors with organic flash and even better with added external flash (hot shoe).  Great color outside under sunny through overcast conditions.  Only weakness is a limited optical zoom.  But, on balance, exceptional set of capabilities for the size and weight.  Overall high resolution, great options, external flash, multi-ISO, many white balance settings, nice preset and manual  functions, good AF, small size, infrared for night shooting, MPEG mode ... with Sony quality.  Very pleased overall.", "Date": "October 9, 2003"}, {"Title": "I Even Sleep Next To Mine...", "Author": "Mouse", "ReviewID": "R26OH5UQQQPFGX", "Overall": "4.0", "Content": "I love my new Sony DSCV1 camera.  It's my first digital camera and the instant gratification of seeing your picture on the LCD is great.  Recently I took the camera on holiday to Australia.  Unfortunately while changing hotels, I misplaced my 128mb stick I had bought seperately.  I went into panic mode for a while and then decided to buy another one at a duty free shop in the city.  I bought a Sony 256mb memory stick pro.  Thirty eight photos later, I took it to a shop for printing and they said it had a stratch on it.  I took it to another shop for a second opinion and they said the same thing.  I went into panic mode again.  As a last ditch effort, I took the memory stick back to the guy I bought it off, battered my eye lids and told him how distressed I was about losing all my precious holiday shots, that I couldn't recover because we'd been on a big tour north.He plugged in a Sony portable printer in the shop, and luckily the machine was able to read the memory stick.  38 FREE photos later, I was a happy customer.  The guy even refunded my money for the stick which was faulty as far as I was concerned.  That day I also found my missing 128mb stick. It was a case of rent-a-stick when I needed it.  I was absolutely blown away by the quality of the 5mp photos combined with the Sony portable printer.  People in the shop crowded around to see my photos being printed.  They are amazing.  The guy took one extra print to go on display in the shop to show people what the Sony DSCV1 and the printer combined are capable of.The pop up flash took some getting used to, and my kids think the hologram red laser thingy is cool.  They think I'm zapping them.  What I like most about the camera is that it can be used as a point and shoot type camera for those that don't know much about photography, yet has aperature and shutter features so you can do the 'blurry background and streaky waterfall shots'. It's got a lot of room to grow into it.I like the fact that it can accomodate such features as a tripod, tele photo lenses, extra flashes, polarizing lens etc,  which you can buy later on when you get more experienced.I shopped around heaps on the net and in shops before I bought, but really fell in love with the size and cuteness of the camera, combined with it's smart technology and the fact that the battery can be recharged in the camera.  I didn't want to have seperate batteries that you take out, and my husband would no doubt borrow for his remote control yachts.Putting your pictures on tv is easy and I also run them through the video and take a slide show of them on video as a backup.I'm extemely happy with my new camera and see it will last me for many years technology wise.By the way, I now have a little box that I put my spare memory stick in that is clearly labelled, and too big to get sucked up in the vaccum cleaner.  No more leaving it on the bed while reviewing the contents of my sticks, where it might get forgotton.", "Date": "October 30, 2003"}, {"Title": "Its Superb", "Author": "Abhay", "ReviewID": "R4LINKFNKR1QR", "Overall": "5.0", "Content": "I went shop to buy Canon G5 and the shop keeper showed me this camera. And i have taken Sony-DSC-V1 to my home. I have used Canon G2 which was also very Good, but the sony model is more handy and ith less weight. I feel it is superb.", "Date": "January 13, 2004"}, {"Title": "Even in 2008 the picture quality rocks!", "Author": "S. Lee", "ReviewID": "R2M5VYRG8GLSL3", "Overall": "4.0", "Content": "I have owned my DSC-V1 for at least 5 years and remembered paying over $500 for it new.So why am I writing this review in 2008?  Well the camera has survived many world trips, drops and still works great but I convinced my wife that it was time for a new one.  So we started our research and bought the Panasonic Lumix DMC-TZ5K since the reviews were awesome.Then we took our first picture - we looked at each other and thought - our Sony takes better pictures.  But I really wanted to love and keep this Lumix with HD video and all, so I took a slew of pictures with both cameras and asked my wife to tell me which ones she preferred - 90% of the time the Sony photo was preferred.  So we visited her friend that owned the same Lumix (maybe we got a defective one) and compared more photos (even swapped memory cards) and again the photo quality from the Sony was better.So how can all those reviewers get it wrong?  Because in most cases they never do a photo comparison but if you did, boy would you be confused - I think it is easier to just be happier in your bliss.We also tried a Canon SD850 and go the same results.So I still have my DSC-V1 because I feel like I would have to go with a DSLR to find better photo quality.  You can read all the reviews and specs until you eyes and head spin but in the end the proof is in the picture.I rated the camera 4 stars but I agree with the reviewers about the speed and flash placement but if you want a camera that takes great quality photos, is durable and very affordable then look no further.", "Date": "August 15, 2008"}, {"Title": "Very Slow Flash Recycle, bad battery life", "Author": "nsr \"Photo Hobbyist\"", "ReviewID": "R2ZU9P6C50XCZL", "Overall": "3.0", "Content": "I owned quite few Digital Cameras, but the Camera's I used most before this are Sony DSC-S85 and Canon A80. I damaged my S85 during rafting(still works with Power Supply, but not with battery) and gave Canon A80 to my brother. I bought DSC-V1 because of rave reviews on sites like dpreview, stevesdigicam. Especially for faster focus, so that I can catch my kid in action.So, I will try to compare against S85 and A80.Compared to S85 and A80:1. Smaller than S85 but S85 has better grip, though I hate manual lens cover on S85. Bulkier than A80 and A80 has better grip.2. V1 focusses much faster than S85( 1.25 sec vs 0.6 sec) and still few outof focus because catching kids on camera is not that easy. A80 is faster than S85 but still slower than V1. But Autofocus is more accurate and far superior on A80 out of all three. It covers much area with 9 point AiAF. I tested all three at once, A80 locked focus when S85 and V1 failed. (esp plain background with little contrast). V1 With all that hitech Laser pattern only checks for the contrast in only little center area(though 5 point , but all around/near the center). It fails to focus even when there are object in sides of the frame(not in center). V1 Continous Auto Focus option helps little bit in catching those little kids though.3. Battery life is not even half of that S85, just one hour of typical usage, so extra battery with a charger is must. So extra money/luggage too. In the case of A80, You drop a set of Hi-Capacity Ni-MH AAs and forget it for few weeks.4. Main problem, Flash recoup is really slow, anywhere between 7 -10 seconds. if you choose power save mode, it is around 20 seconds by the time camera is ready for another shot, (as another review has mentioned it). So, any indoor flash photography is a problem especially with kids. It won't let you take photo until the flash it completely charged. If you press shutter button before it charges completely, you have to release, and do it again. With S85 it is less obvious, and A80 hardly noticable.5. Any indoor snaps without flash is ruledout, tried using higher  ISO400, max aperture, exposure compensation etc.  I think both S85 and A80 is little better, but not by much.6. picture quality is on par with S85 I think. I did not feel quality is any better than S85. I felt A80 is little better than these two, especially the JPEG compression.7. Though Canon A80 had rotating LCD, resolution and quality is not as good as S85 and V1.(this has been addressed in A95 with 1.8\" hi-res LCD).I have been experimenting since last 2 weeks, and above were the few things I observed.I considered Canon A95, Sony DSC-W1 and this one(Canon G5 is little bulky and slow autofocus). I was getting all these around the same price, but I though V1 has 4x optical and Zeiss Vario-Sonnar lense( I think Vario-Sonnar is better than W1's Vario-Tessar) and W1 had many complaints about JPEG compression artifacts and not somany manual controls.So, Now, I am thinking should I go for Canon A95? or should  think of Casio EXILIM PRO EX-P600 which is veryfast and comes with Canon lense(this is $50 more).???I hope this one helps atleast some people to decide if this camera fits the bill for them.", "Date": "December 29, 2004"}, {"Title": "This camera takes excellent photos!", "Author": "Dani Nymeyer", "ReviewID": "R22GOX0X77WIHF", "Overall": "4.0", "Content": "This is one of the first cameras I have ever owned, I found that it is a little too advanced for the beginner photographer, but is a great bridge from beginner to a little more advanced.First off, just let me say how pleased I was with the photos this camera takes.  Great, great quality.  I was even more pleased when I took the photos onto the computer and I blew it up several sizes--the pictures stayed nice and clear.Using full automatic mode, I have read some customers complain about color saturation problems...it's almost as if they are talking about a different camera, because I am experienced no problems like that.  This camera makes very close to real life colors...and, if by some chance, you do happen to experience some sort of color saturation problems, there is a manual override that will work just nicely.The camera is very easy to handle all of the features.  It's not confusing at all, even for the more of a beginner photographer.There is only one thing that I am going to have to complain about concerning the camera functions...The shutter speed, I thought, was way too slow.  This camera seems so advanced that you would think that the shutter speed would be fairly fast...but it's not.  You have to hold down the shutter for a few moments before the picture finally takes.  And when it does take, it takes several seconds for the picture to save...I found one flaw in the camera design--the location of the flash.  It's on the top on the very left hand side (left hand side when the lens is point away from you).  It's a weird place because in order to hold the camera properly, you have to lay your finger right on top of the flash.  Which is just fine, when you are not using the flash, but when you do want to use the flash you will want to put your finger right on top of it, because it feels comfortable to do that.  However, you can't use the flash if you do that!  So, then you will probably result to putting your finger on top of the silver band around the lens, but that won't work either because your finger will be in way of the flash.The location of the flash is the only camera design defect that I have come across, though.  Otherwise, this is a nice camera that takes really splendid pictures.  I'd recommend this camera to the beginner photographer passing over to an intermediate photographer.  If you are looking for a compact camera, this is a pretty good compact camera.  It gets great pictures, and is pretty much compact.  Although, it is not completely portable, it's a little bigger than a lot of the compact cameras out there...but, you have to keep in mind the megapixels that you are getting.  5.0 megapixels, and lots of features.  A very nice camera, I am quite pleased with it.  Although, the flash defect has led me to looking for a new camera, because I just find that defect a little too hard to over-come.  Other than that, I enjoyed this camera.", "Date": "December 22, 2004"}, {"Title": "Good Camera for average photographer", "Author": "Randall L. Stegner II", "ReviewID": "R2253A8G8UQGF8", "Overall": "5.0", "Content": "This camera takes THE BEST pictures for a crisp and colorful picture.  I would recommend this camera over ANY camera on the market.  This works well with the Sony Digital Photo Printer DPP-EX7.  Prints great Pictures.", "Date": "April 14, 2004"}, {"Title": "Excellent product", "Author": null, "ReviewID": "R1ZT7PSBZPYZAC", "Overall": "5.0", "Content": "This is an excellent product with countless advantages.  The picture quality is excellent -- ask anyone who is knowledgeable about optics and they will drool over the Zeiss lens.  Like many Sony products, the camera has a tremendous number of fancy features, is easy and intuitive to use and has a beautiful feel and appearance.  Sony is a quality manufacturer and their products instill confidence.  The manual, occasionally a Sony weakness, is quite helpful.  In addition, the price has come down considerably and it is actually a very good value at this time.  There are a few disadvantages with the camera -- it's still superior to competitive products overall but these are things you should be aware of.  Like most digital cameras in this megapixel range, the photos are not a perfect match to the 4x6 format and need cropping (I have heard that a higher megapixel camera may solve this problem if you don't have time for this \"hobby\").  The included Memory Stick is insufficient.  Battery life is short.  The movies this camera makes are grainy with a jittery auto focus but most people are aware that it doesn't make sense to rely on one device for both needs (see Sony's HC-40 for a great camcorder).In the final analysis, another home run by Sony.", "Date": "April 5, 2004"}, {"Title": "Compact package, big features!", "Author": "cspring", "ReviewID": "R1CSV5V8F9JESO", "Overall": "5.0", "Content": "I wanted a camera small enough to put in my pocket for snap-shots of my kids while on the go, but I also wanted some big camera features to be creative with. This Sony is quite compact, yet I love it's big camera abilities, to numerous to mention here. The Carl Zeiss lens adds an incredible sharpness to every picture. The list of accessories for this model is outstanding and will allow creative expansion for the amateur and the professional alike. However, the picture managing software, 'Image Mixer', included with the camera from Sony is an absolute nightmare. I figured out most of the features of the camera before the image program, and now I just use Picasa.", "Date": "March 27, 2004"}, {"Title": "I Love this camera, but you need to read the small print", "Author": "Robert Baptist", "ReviewID": "R1TI6K0V5ATCQD", "Overall": "4.0", "Content": "Up to yesterday I was not happy with the battery in this camera. I bought it in December of 2003 and by July of 2004 the battery would not take a charge.  The second battery (at $70.00) charge up to a week before Christmas and then would not charge either. I read through the reviews yesterday looking for someone with a similar problem and found none.  This sent me scratching my head back to the owners manual. What I found was a message in very small print on page 10 about cleaning the DC plug on the charger or your battery won't charge. I did, and they did! I now own two very fully charged batteries. My review yesterday was 4 stars for the camera and the 5th deleated for the bad batteries. I would now like to make my review a very happy 5 stars.", "Date": "January 29, 2005"}, {"Title": "thank you", "Author": "Lori", "ReviewID": "RRWZXR0JFNATO", "Overall": "5.0", "Content": "I bought this camera about a month ago and have enjoyed the freedom of having a digital camera immensely.  I spent a significant time comparing different cameras and the reviews written on amazon convinced me that this was the camera for me.  I really appreciate all those who wrote in because otherwise I probably would have bought the olympus with a 10x zoom.  After comparing them and reading the reviews I think hands I got the camera that fits my needs better.Thanks for your help in picking a great camera.", "Date": "February 5, 2004"}, {"Title": "The ideal small prosumer digital camera", "Author": "Ruchai Kanjanavanit", "ReviewID": "R1PKCWN9Z08D23", "Overall": "5.0", "Content": "This is my  5th digital camera. I bought it because my Sony DSC-P9 never fullfill my need for a small camera that could produce profsional quality pictures. This Sony DSC-V1 is all I ever want from a digital camera. It small enough to carry around and the pictures quality it produce is second to none. I love it.", "Date": "October 28, 2003"}, {"Title": "Well wort it!!", "Author": "Brandon", "ReviewID": "R1A81PN5NLMGO2", "Overall": "5.0", "Content": "This camera was a great investment that enabled me to take the thousands of pictures that I did on my European tour.  The lens is incredible, the picture quality is phenominal, and it comes with tons of great features.  (helpful hint: you can save upwards of $150 by purchasing this camera through other online sources)", "Date": "October 25, 2003"}, {"Title": "Non-\"tecihe\" review", "Author": "Boris S", "ReviewID": "R4XS5LRSIWHB7", "Overall": "5.0", "Content": "Alright, I'm not a camera wiz, but I do appreciate a good point and shoot camera which makes pictures look like I am. I'm sure most of the cameras on the market will suit 99% of the people out there... at least in terms of picture quality. Here's my \"real-world\" perspective on why I bought the camera:1) Rechargable (externally) batteries (don't overlook this feature, this is why I dind't choose Olympus--convenience!)2) Full size video!! (The quality is great... it's a _BIT_ choppy, but how many of us take really long video's of something really important? Few. But this is nice to have if you need some interesting clips!3) 5-megapixel -- this is more for marketing these days unless you plan on printing 8x10's or larger photo's. The bpp doesnt change it's only the resolution (or in english terms, dimensional size of the print) that changes as you add megapixels. I personally shoot 1.2mp all the time. It's nice though, having the option to take something in 5mp in case I ever want a high-quality print!4) Compact w/4x (analog) zoom. We've all seen 100,000x digital zoom... WHO CARES? You can just \"zoom digitally\" once the print is on your machine, quality isn't going to be greater--I'm pretty sure this is true, don't quote me on it though.So those are pretty much the biggest reasons... which mattered to me, living in the \"point-and-shoot-and-forget-about-it\" world. If you're a \"photo-phile\"(?) then there are plenty of reviews on the web for you!Hope this helps someone... I, personally, love the camera! :)", "Date": "August 9, 2003"}, {"Title": "5 stars all the way", "Author": "polo", "ReviewID": "R3J996PB8JIGEJ", "Overall": "5.0", "Content": "This is BY FAR the best camera I've ever owned. I currently have a 5D and an S90, but I still use the DSC-V1. It just takes unique, outstanding pictures, with \"only\" 5 million pixels.The new high end point and shoots are scams. 12 million pixels? Their pictures look like crap.5 years ago I carried this camera around India for 2 months, and it withstood the nastiest conditions. Humidity, heat, shocks. And really, the pictures are, in my opinion, much better than most point and shoots nowadays.If anything it's a little slow and bulky, but it was way ahead of its time and in many respects still is ahead of today's point and shoots. For what it's worth used, it will beat any recent camera in the same price range -hands down.And the infrared pictures function is beyond words. Why don't they still do it now?!Buy with no, no hesitation.", "Date": "February 19, 2011"}, {"Title": "This is a very capable digital camera 3+ years after purchase", "Author": "Shazaaaam!", "ReviewID": "R3LM8MYBA0Q9JM", "Overall": "5.0", "Content": "I do not agree with the negative comments regarding picture quality on the DSC-V1 as posted by other reviewers.  I do agree, however, with the comments about the flash recharge time and how lousy that performance is.  I got past that by purchasing an external flash and attaching it to the hot shoe on top of the camera (How many other digital cameras in the point and shoot class have a hot shoe????? Huge Plus for the DSC-V1 there).Now, this camera was affected by the CCD issue that affected many camera families (not just Sony) over that last few years.  Sony offered a free replacement of the CCD and I took advantage of it.  I knew I was going to be without the camera for a few weeks, while the repair and shipping took place.  But I had a vacation trip planned during that time, and I needed a camera.So I went out and bought a Sony DSC-T30 7.2 megapixel camera to use for the trip.  It seemed like a great camera, and it's actually pretty capable.  But the DSC-V1 just crushes it in photo quality.  The color shading on the V1, and the depth of field are so much better -- and that surprised me based on the 5 megapixel vs. 7.2 megapixel specs.  My wife still likes the T30 for the size, as it's case fits in her pocketbook nicely.  But I use the DSC-V1 almost exclusively.  The external flash took care of the ONLY negative I could come up with.  I feel I hit a home run with that purchase.", "Date": "September 19, 2007"}, {"Title": "Great with only a few faults", "Author": "Wesley Garner", "ReviewID": "R1KH0T39AM2QR8", "Overall": "4.0", "Content": "This 5MP digital camera from Sony is easily the best out there. The time between clicking the button to the picture being taken is fast. The laser focus is very high quality and works wonderfully. The optical zoom is the higher than all other 5MP digital cameras in the category. The LCD screen is bright and high quality. When it comes to picture quality there are some differences. To be able to get good color balance, the picture mode has to be used, not the automatic. Pictures always turn out too much of a color(red, green, or blue) when automatic mode is used. The flash is slow to charge and creates a very off balance blue color, and the camera ceases to function while charging. The battery life is a little under what is expected while taking pictures. When flash is used, the battery power is greatly reduced.Pros:Great zoomSmall sizeHigh quality LCD screenMany different functionsHigh quality video with soundCons:Battery lifeFlash is off colored, slow charge, causes camera to not function while charging", "Date": "December 26, 2004"}, {"Title": "nice cam! what's up with software", "Author": null, "ReviewID": "R3SREQCU57XKQ2", "Overall": "4.0", "Content": "I had the SDC v1 for 3 week.PROS:-Nice design/very stylish-The auto mode picture quaility is excellent. I had canon s30 and the dsc v1 blows the canon away in auto mode.-controls are nicely mounted-power on and youre ready to shoot in 1 second. other digi cam can take 3 sec or longer to shoot.(like canon) -With so much functions on this camera. you will not find a camera this compact with this much cool functionsCONS;-the software IMAGE MIXER which comes with the CAmera is very cheap. I had Caonon s30 software which was excellent. This sony software stinks bad. I paid 600 dollars for the cam. It should come with proper software to match the camera of this magnitude.-The flash being pop up is mentioned in many reviews, however, i was ok with it as long as i knew not to put my fingers on top of it.-The manual is poorly made. the canon came with 2 diffrent manual for the cam and software and 2 more in spanish. Sony dosnt even give a manual for their software. HOW SAD! You may think this is simple but, NOPE!!!-I have to turn on the camera before i'm able to upload, with canon this was done in automatic.-charging your battery is a joke. you have to buy a seperate battery charger. ohterwise, your camera becomes the charger.(YOu can only charge the batter by hooking up your camera to an adapter) SOny trying to save money in the wrong place.CONCLUSION: this camera is an excellent camera for anything you want to do. however, I am very upset at SONY not the camera it self.THis being the reaons for only 4 stars. SONY dos not take detailed consideration when makeing accesories that comes with cam.I would recommend this cam. its nice camera,but thats all youre going to get.", "Date": "July 9, 2003"}, {"Title": "Oldie buy goldie. Fantastic image quality.", "Author": "Caleb Courteau", "ReviewID": "R2OSKGBGQS3IB9", "Overall": "4.0", "Content": "This camera was released in 2004 so it's been eclipsed several times over in terms of megapixels and video quality. You know what? As long as you're not using it for video, you wouldn't know it's 8 years old. It's fast to start up, locks focus quickly, and most importantly, produces superb image quality. I'm sure sony's sensor has something to do with it, but I think the secret sauce is mostly in the incredible Carl Zeiss lens. In terms of sharpness this camera rivals my Nikon D80 with 50mm 1.8. It's that sharp. As other people have noted the battery life is terrible. I pack an extra and forget it's a problem. Buy this camera, you won't be disappointed.", "Date": "May 25, 2012"}, {"Title": "Great little camera!  Has more features than today's pocket cams.", "Author": "eswan", "ReviewID": "R161DF1WTYN89X", "Overall": "5.0", "Content": "I bought this camera back in February 2004, when it first came out and have been using it ever since. Even though it's just 5 mpxl, it's got a Carl Zeiss lens and my photos look really good blown-up even to 12x18.  Yep!I paid $422. online for it back then, and since I'm not happy with the current pocket models, I've purchased this model again,[at greatly reduced price here] since mine is just about worn out now.It's a little bulky, but it's got a HOT-SHOE [which No Current pocket-Model has] multi-Mpxl settings, Burst mode, AE Lock, mini-video mode, etc., etc...** HIGHY RECOMMEND", "Date": "April 4, 2012"}, {"Title": "It's the Zeiss lens that makes this camera a winner", "Author": "DandyD", "ReviewID": "RNB1KZZKWSDVF", "Overall": "4.0", "Content": "Most people don't realize it is not about pixel size!  It's about the quality of the Lens that give you that sharp clear picture.  The stop of this Zeiss lens goes down all the way to 2.8!  This is an indication of how good this Zeiss lens is.  In summary, this is an \"oldie but a goodie\" digital camera.  Yes the view finder is a little small but it does have an eye piece for focus which is a plus.  This 5MP is way under rated compared to days newer models.  The camera body is a rugged metal compared to the cheap plastic models today.  It's a little larger than the newer models, but again it's the picture it takes that counts.  This is a diamond in the rough.", "Date": "March 2, 2012"}, {"Title": "For a Used Camera It's Perfect", "Author": "D. Thomson", "ReviewID": "R3QM9S6GPR22H5", "Overall": "5.0", "Content": "This is my camera of choice and after losing mine on vacation I searched the Internet for a replacement. The LCD screen is small, true, but the Zeiss lens makes for very clear and crisp quality photographs. I would buy from this seller, Caffe Matteo, again and again for the accurate description of condition and the generously low price. I can't thank him enough, but here goes...Matteo, thank you for your generousity and ethics, you are an exceptional person.", "Date": "September 1, 2011"}, {"Title": "Modern times make them faster and smaller, but this is a great camera", "Author": "Naomi Donabedian", "ReviewID": "R32W8BWWZ5968Q", "Overall": "4.0", "Content": "This camera is a high performer. Handles low light and night time situations very well with low noise and moderate to nice sharpness. The flash is adjustable, bright to low, so it doesn't look harsh. If you want to get serious there is a hot shoe so you can add your own flash, a rarity on automatics. I also appreciate the SLR functions which along with a tripod have taken my still life pictures to the next level. I can't emphasis enough how professional the photos look. I'm an art director and some of my pro photographers have started to comment. Take a look at some of my food photography: [...]My cons include: low battery life, really 30-40 minutes per battery. You will need to buy 3-4 batteries to carry with you, which may mean carrying a charger too, often weighing down otherwise light trips. Don't expect to travel where there is no electricity with this camera unless you have tons of batteries. A small display screen, and relatively bulky size compared to today's standards. The focus function on manual modes is hard to use because the screen is too small, but practice makes perfect. The resolution could be better, but works nonetheless. Regardless this camera is a great deal.", "Date": "January 21, 2010"}, {"Title": "Very good overall camera", "Author": "M. Stone", "ReviewID": "R15XY00YCAY9ED", "Overall": "4.0", "Content": "I need to edit my first review of this camera.  After owning a Sony DSC-S75 (which I love!), a Canon SD1200, a Sony DSC-H20, and a Canon E-1, I think this Sony V1 model is one of the best older digital cameras.  It has 5 megapixels, which is actually just the right size for most people who will be getting prints made.After testing and using some of the new models of digicams with high megapixels, I used to think that more megapixels meant better quality, but that's not true.  I have learned that higher MP on a smaller camera with a smaller sensor means more noise and graininess, there's just no way to get around it.The DSC-V1 does not have this problem.  I have taken photos with this camera that turned out crystal clear with little to no noise whatsoever, when viewed at 100% in Photoshop.  This camera does the best at photo quality that would make great prints.The only downside is that the videos are a little jerky, and the small batteries it comes with do not have LONG battery life.  Sometimes it does have a problem focusing on dark settings, sometimes darker photos might turn out a little blurry, but that could probably be fixed with tinkering with the manual settings like f-stop, etc. if I knew more about that kind of thing.  But for photos in any other setting, like daylight, people, indoors, etc. this camera can't be beat for sharp images and accurate color.", "Date": "August 24, 2009"}, {"Title": "Except Flash everything is good about this camera !!!", "Author": "Raghunath Aerabati \"Raghu\"", "ReviewID": "R3W2UV5YTTAZDA", "Overall": "3.0", "Content": "I own this camera for 3 years now and I found that this camera has some real cool features. Photos are really good. The only problem with the camera is flash. If you ask somebody to take the photos, you have to particularly tell them not to put their fingure on the flash. Orelse, flash does not popup. Also, you cannot take pictures continously on flash because it takes some time for recharge. This is annoying me allot and I'm thinking of buying a Nikon camera because of this damn flash thing.", "Date": "June 2, 2007"}, {"Title": "A capable camera", "Author": "Lux Lucis", "ReviewID": "RDKJGRCN2WOEX", "Overall": "4.0", "Content": "I have owned Sony DSC-V1 for 3 years, and have overall been quite satisfied.  You just need to be aware of the limitations of this camera and try not to push it beyond of what it was designed to do.  Hey, it is a point and shooter, not an SLR.  Outside, in good lighting, DSC-V1 knows few rivals.  The pictures uniformly come out sharp and clean, with realistic colors.  F2.8 stop should theoretically blur some of the background, but I have never been able to achieve this effect.  Inside photography with DSC-V1 is possible provided:1) you do not come too close to the subject (the flash is somewhat overpowered) and2) you know how to utilize manual controls to your advantage.The quality of manufacturing is impeccable, as could be expected from Sony with a Zeiss lens.In 2006, there are better options on the market, but this one remains a solid choice, if you get a bargain price.", "Date": "December 27, 2006"}, {"Title": "Stunning photos captured here.", "Author": "M. Dixon \"Electronics Nut, Snowboarder and St...", "ReviewID": "R2WHCZWEO91JBS", "Overall": "5.0", "Content": "This being my third digital camera I did a lot of research online to find the best camera I could afford. I was open to any manufacturer as long as the pictures were the best I could get in the \"pocket sized\" and full featured digital camera with at least 4 Megapixels. Basically I was pointed to the Sony DSC V1 by most camera review web sites. I bought it and have NOT been disappointed in the least. It takes great pictures and has many great features including the ability to shoot in the dark. Check out the manual and the sample pics. Then go and buy this camera. It's even discounted these days. You can't go wrong. This baby makes you look like you know what you're doing even when you don't.", "Date": "December 31, 2004"}, {"Title": "V-1", "Author": "Eliot Bliss", "ReviewID": "R6VF4UMNN4C5L", "Overall": "3.0", "Content": "The V-1 is way over-rated.Slow shooterFlash recharge very slow.LCD very poor compated to some competition.Px OK but no better than the little Sony P150and not as consistant.And the 150 is MUCH faster in all ways with a terrific screen.Having owned it and tried and tried and tried it,I am selling it.A P150 or P200 & OTHERS, would be better cameraS. (Unless you want to fiddle. I dont.)ALSO, AND VERY IMPORTANT, I BELIEVE THERE IS MUCH TOO MUCH DISCUSSION ABOUT LENSES. THEY ARE NOT THE WHOLE STORY IN DIGITAL AS THE ARE IN FILM. IN FILM CAMERAS, SHOOTING THE SAME STOCK WITH TWO DIFFERENT LENSES WILL QUICKLY SHOW YOU ANY DIFFERENCES.WITH DIGITAL YOU DONT HAVE THE \"SAME FILM\" AND THE ELECTRONICS (CANON CALLS IT DIGICS?)CONVERTING THE IMAGING DEVICES INFORMATION INTO VIDEO IS EQUALY CRITICAL.NEVER BUY A DIGITAL CAMERA BY BEING SOLD ON ITS LENS. BUY ITON COST, SIZE, WEIGHT, FEATURES AND.,.....TEST PICTURES COMPARING SIMILAR SHOTS, TAKEN AT THE SAME TIME AND LIGHT, WITH A SECOND OR 3RD CHOICE. IF YOU ARE A NON CRITICAL USER, FORGET IT ALL, BUY ANY GOOD BRAND. YOU'LL BE HAPPY.", "Date": "October 11, 2005"}, {"Title": "Best of the best.", "Author": null, "ReviewID": "R1YUYZJKIQNHQO", "Overall": "5.0", "Content": "When you really compare those pics that were taken with different brands of 5 MP DCs do you realize how perfect the Sony dsc-v1 machine is. But be careful of its white balance adjust, use it wisely.", "Date": "February 25, 2004"}, {"Title": "oh my god", "Author": "J. Yi \"aadoyy\"", "ReviewID": "R2ISN2G97QWW3H", "Overall": "5.0", "Content": "i've been shopping around for a digital camera for a long time. i was debating from a canon and a nikon.  THANK GOD THAT I GOT A SONY.  i love the night shots, (dont even need a flash for this baby).  i'm not the professional photo taker but this baby has it all plus more.  i cant say anything bad about this product.  i'm loving life.  Plus.  get the sony printer.  it prints out amazing pictures.  (digital photo printer by sony $199.99)  this is also an \"oh my god product\"thank you sony", "Date": "December 15, 2003"}, {"Title": "Great Pictures.  Easy to learn.", "Author": "Michael Thomas McLaughlin", "ReviewID": "RXH69U682W4BD", "Overall": "5.0", "Content": "This is my first digital camera.  The pictures look fantastic.Right from the box I was taking better pictures than I haveever taken with any camera. WORTH EVERY PENNY !!", "Date": "October 17, 2003"}, {"Title": "Hold off", "Author": "Miguel Ali \"Film Director & Political Pundit\"", "ReviewID": "R37KJDVAG1PS9S", "Overall": "2.0", "Content": "This camera really had all of the potential in the world, but sadly, it hasn't lived up to my expectationsYes, when done under daylight, the pictures are beautiful ---- but the indoor and nighttime performance is what disappoints meThe flash is WAY TOO STRONG, thus overblowing many of the nighttime shotsIn addition, I often set my own aperatures with this camera, but in having a mind of its own, the camera will re-adjust the aperture, right as I take the shotughI love Sony products - but I recommend staying away from this one", "Date": "January 25, 2005"}, {"Title": "OKay, for starters", "Author": "Dave Spinks", "ReviewID": "R1A05NVRYAIKWW", "Overall": "3.0", "Content": "it okay but you need way more for range when ghost hunting but not a bad starter IR camera I hate these ratings", "Date": "December 15, 2013"}, {"Title": "Premium Carl Zeiss lenses", "Author": "V. Calvin Hoe", "ReviewID": "R1DQYLP4L54LIF", "Overall": "5.0", "Content": "German optics has standard of quality and Sony (Carl Zeiss optics) & Panasonic (Leica optics) has brought in that as a niche that amplifies the quality.  I am sure that in the 'point-N-shoot' cameras, it really matters very little; unless like me, I like that 'step above' and am willing to pay for it.If you read the digital camera magazines or web sites, the test results will show you the quality difference.", "Date": "May 27, 2006"}, {"Title": "Best Digital Camera I have Found for Night Clubs and People", "Author": "Brian Gilmore", "ReviewID": "R13GLJHUTOOS8M", "Overall": "5.0", "Content": "This camera is perfect for taking pictures in nightclubs or at night.  The main reason for this is the \"Night framing\" ability that allows you to see an IR picture of what you are framing, then when you take the picture it shoots a normal flash (this is not the same as a night shot where the picture itself is a IR image, this just lets you aim.)  In addition, when you don't have the ability to see the LCD, you can use the AF laser emitter to target your images.  Either way, if you get a camera that does not have these features, its always guess work if you have the subject in frame if its dark.I will never buy another camera that does not have these features.  I cannot believe they are not standard on all digital cameras.As for red eye, I would not use the anti red eye feature on the camera.  It makes people squint in the follow flash.  Use either editing software or better yet, get the off camera flash and bracket accesory for natural red eye reduction and shadows.If you are thinking about this camera, accessories I would almost say MUST be budgeted are:  The leather flip case with strap (not the stupid pouch case), extra battery, 512mb memory stick and if you intend to use the 5mp that you are paying for and want to send your pix, you should ABSOLUTELY purchase a copy of Sharegear file sharing software (not a Sony product).  It is hands down the pest way to share video and pix.  It's also the cheapest ($20.00, one time), but that is just a bonus.  (you need dsl/cable to use it effectively).An almost must have accessory is the HVL-F32X smart flash and bracket.  It makes the camera a bit bulky, but dang those images look good.  An external flash off camera will always beat a built in flash for taking people pix.  I don't care how nice the camera is.Another word about the MP's. 5MP is enough.  Higher than that is great if you need to count the hairs on a fly, but the price in storage cost (MB per image) is probably not worth it.  If you don't even use the full MP, then why upgrade your camera?  That's just me.Hope this helps.  FYI I have had this camera for over a year and still think its better than all my friends newer ones.Brian", "Date": "July 13, 2005"}, {"Title": "Replaced a Hasselblad", "Author": null, "ReviewID": "R15AWUFTDC1R1C", "Overall": "5.0", "Content": "I had just sold my Hasselblad that I had had for 28 years and I wanted a camera that would fill the gap. I won an ebay auction for the sony Dscv1 and never received it, so I was ready to get a nikon or canon.  I researched them all (the sony V1, the nikon 5400 and the nikon 5700 and to a lesser extent the canon G5 and rebel).  My biggest concern was the ergonomics of the sony V1, having the flash placed where it was.  I really wanted the small sized camera so that placed sony first. I have small hands so I thought I could adapt to the flash on the left side.  I also liked the Zeiss optics which came with the V1.  The nikons are sexier with the black color and fit well in my hand, but there were so many good features to the V1...night focus, in camera battery charging, a nice sized lens (136mm), no shutter lag, bright LCD etc.  that I returned to the sony and bought it.  Besides, I didn't want another large camera. I am very happy with the V1's small size and Zeiss optics and I have found the V1 easier to handle than the 5400 to handle. I have bought two extra batteries and the difference between 2 and 5 megapixels is fantastic!", "Date": "December 17, 2003"}, {"Title": "at last !", "Author": "G. peck \"gpeck@arctic.net\"", "ReviewID": "R12U5NT5KO5N6E", "Overall": "5.0", "Content": "Never mind the picture quality, this little camera works !  I toothed on an Olympus D4040 and i was never able to penetrate its menu system, so i used it at only the most rudimentary level.The sony and i hit it off immediately. Not to say i understand them all, but after two days i can waltz through every feature. What i particularly like about the Sony is:1. the shutter button is always where i expect it -no more frantic groping2. sony has reached a nice balance between burying a feature in a menu and providing it a button on the back.3.The electronic lens cap...love this...no more fumbling with a lens cap that, at altitude and cold, sometimes requires more than the available dexterity. I can fully  operate this camera with gloves.4.the LCD is so sharp that i can photograph a topo map [@1.2 M ] before a hike, and, on the mountain,  zoom and move around on the map better than the original. Very cool !!5. the 40 second audio recording feature is handy to record details of a shot.6. the 10 minutes of video [on a 256 M card] is useful.What i dislike about the camera is the pathetically small battery...the lithium provided weighs less than half an AA ...my Olympus would run for months on 4.  Understandably, the Sony is lucky to make it through a day on one.The flash is another minor problem...it wants to come up under your left finger, but since i rarely use a flash...i don't care.", "Date": "November 3, 2003"}, {"Title": "The best overall camera on the market!", "Author": "Amazon Customer \"orangedude88\"", "ReviewID": "R12INL0XK85HLU", "Overall": "5.0", "Content": "I shopped around for a month.  Comparing every camera that was 3-5 megapixels and under $800.  Long story short, the Sony DSCV1 had the best overall features.  The best part was the VGA movies with sound, only limited to the memory stick volume.  I was able to replace my older Sony Mavica and my broken video camera with one small package.  The pictures are fantastic (only Canon was better), night shots were great (even has nightvision) and the movies were good quality.  The camera is a little pricier than some others, but you get what you pay for, and my pictures prove it.", "Date": "September 29, 2003"}, {"Title": "DSC-V1", "Author": "Alexander Leybengrub", "ReviewID": "R14X0O73FPZIQL", "Overall": "5.0", "Content": "I have owned this camera for over a week and simply am loving it.Before buying it, I did some comparison and research. While Canon's cameras are very close in quality and also are packed with features, with the current $75 promotion, plus a very likely chance that you already own some memory sticks for your other Sony products, DSC-V1's great quality, small size but an abundance of features, you can't go wrong.", "Date": "September 28, 2003"}, {"Title": "Great features in a small package", "Author": "Bill Staley", "ReviewID": "R1SMT0L7VMZ6DW", "Overall": "5.0", "Content": "I bought a Konica KD500Z in 2-02 for $500, used it for a year, lost it in the car for several months, bought a Sony DSC-V1 for $500 to replace it, found the Konica and let my niece use the Konica for her very active summer.The KD500Z is small and easy to carry. It takes a memory stick and an SD card. It can't take action shots and it can't take good photos in low light. The infrequently used options are not very easy to use. With that said, we took a lot of great photos with it (and a few short movies) and loved having it at hand. I use a card reader to download the photos to the computer. We don't miss the hassle of getting film developed, but sometimes we miss the crisp glossies.The Sony is a better at action shots and in low light, its controls are easier to understand and it takes better movies. But the Sony is a little bigger and takes only one memory stick. (With a 256 memory stick, the battery becomes the limiting factor. I have not run out of memory or battery in either camera. You do need to learn to pace your use. It helps to bring on vacation a laptop with a memory stick slot. During a vacation it would not be a bad idea to archive the downloaded photos to the web or to a CD or DVD. I had to reformat a hard drive after a recent vacation with my laptop.) The Sony battery does not seem to last as long as the Konica, but that is purely subjective. I like the Sony much better.I have not used all the capabilities of either camera. I got another 5MP camera only because I like being able to crop out a lot of the original photo and still have good resolution. (I do not otherwise need poster-size photos). I use Photoshop Elements to touch up every photo and am happy with it. We keep the photos in the \"My Pictures\" folder, a subfolder for every day, and set the screensaver in XP to \"My Pictures Slideshow\" at full screen and let it randomly select and display digital photos.After spending the summer with my niece in her tiny purse, the Konica would not start when the lens cover slid open and needed repairs (outsourced by a good local camera store) costing $172, which I am told is a flat rate for repairing digital cameras!", "Date": "September 26, 2004"}, {"Title": "Excellent little camera", "Author": null, "ReviewID": "R75MZXH6ZF4A6", "Overall": "5.0", "Content": "The camera's not exactly pocket sized, but it is fairly small.  It takes great pictures both indoors and outside.  The macro is fairly good.  Overall I would say that it's a great camera for an enthusiast.I, so far, have no complaints other than the proprietary battery and storage medium.", "Date": "June 26, 2003"}, {"Title": "A nice ghost hunting tool", "Author": "Javier Vargas", "ReviewID": "R2IPS8GPKXTVO2", "Overall": "5.0", "Content": "If you are ghost hunting on a budget this camera is for you. It take very clear picture, It has night shot, and low light mode. You can't go wrong with this one!!!!", "Date": "September 17, 2013"}, {"Title": "Non-\"tecihe\" review", "Author": "Boris S", "ReviewID": "R1CAVCL8GNGF5T", "Overall": "5.0", "Content": "Alright, I'm not a camera wiz, but I do appreciate a good point and shoot camera which makes pictures look like I am. I'm sure most of the cameras on the market will suit 99% of the people out there... at least in terms of picture quality. Here's my \"real-world\" perspective on why I bought the camera:1) Rechargable (externally) batteries (don't overlook this feature, this is why I dind't choose Olympus--convenience!)2) Full size video!! (The quality is great... it's a _BIT_ choppy, but how many of us take really long video's of something really important? Few. But this is nice to have if you need some interesting clips!3) 5-megapixel -- this is more for marketing these days unless you plan on printing 8x10's or larger photo's. The bpp doesnt change it's only the resolution (or in english terms, dimensional size of the print) that changes as you add megapixels. I personally shoot 1.2mp all the time. It's nice though, having the option to take something in 5mp in case I ever want a high-quality print!4) Compact w/4x (analog) zoom. We've all seen 100,000x digital zoom... WHO CARES? You can just \"zoom digitally\" once the print is on your machine, quality isn't going to be greater--I'm pretty sure this is true, don't quote me on it though.So those are pretty much the biggest reasons... which mattered to me, living in the \"point-and-shoot-and-forget-about-it\" world. If you're a \"photo-phile\"(?) then there are plenty of reviews on the web for you!Hope this helps someone... I, personally, love the camera! :)", "Date": "August 10, 2003"}, {"Title": "My 4th digital camera and love it best", "Author": null, "ReviewID": "R3WYX2W9P1X5H", "Overall": "5.0", "Content": "I don't bring this camera with me everyday, it's a bit bulky for a carry with me everyday camera.  But I love it, the quality the build, the exterior design.  I especially love the nightframing and the 4x zoom with good sharp image. I have my Minolta xt with me everyday but it works poorly on low light condition. V1 has a very good autofocusing, a bit slow in recharging the flash thou.You won't regret having this camera around.  This one goes with me on travels.", "Date": "May 7, 2004"}, {"Title": "Way past its prime", "Author": "Ricardo Carreon Quinones \"http://ricardosblog...", "ReviewID": "R3P016E8XLTAVL", "Overall": "3.0", "Content": "A couple of years ago this camera was a very good option given its 5MP, Carl Zeiss optics and nice zoom; however, nowadays it is just below most of the similar priced or similar featured cameras.  The 5MP are no longer a big differentiator and you can probably find better overall packages from Canon and Nikon today.Pros:- Carl Zeiss optics.- Night Shot capabilities.- Convienient size.- Infolithium battery tells you how much shooting time you have left.Cons:- Memory Stick Memory.  Expensive and slow.  You can sometimes pay a $40-$50 premium over similar sized Compact Flash or SD memories.- Slow shooter.  This is specially annoying if you are shooting kids.  By the time the shot is taken, your kid's smile or special gesture is likely to be gone.- Flash is too bright.  Causes flash-lighted shots to be too bright and in many cases to get red eyes.- Colors do not come as natural, especially in challenging light situations, such as late afternoons and some indoors situations.For similarly priced cameras and a good combination of manual/automatic features, I strongly prefer Canon's mid range and prosumer cameras ($400-800 price range).", "Date": "March 29, 2005"}, {"Title": "Nice camera", "Author": "\"youngchi\"", "ReviewID": "R3O75CP778VN82", "Overall": "3.0", "Content": "I bought this camera to replace the Sony s85 that I lost a few months ago (which i loved). V1 has great construction, design, button are better functioning but i have to say that the flash is oddly placed. The flash pops up even in a well lit room and pushing down the flash is another unnecessary hassle.  I expected the picture quality to be better than the S85 but it is not the case. I wouldve choosen the Canon G5 but I have many memory sticks and didnt wanna switch to CF. I regret getting the V1 slightly.", "Date": "January 12, 2004"}, {"Title": "Excelente cámara, magníficas fotos y sorprendentes funciones", "Author": "Rigoberto Marcano \"Rigoberto Marcano\"", "ReviewID": "R1NZR7Y8Q85E42", "Overall": "5.0", "Content": "Esta es una excelente cámara digital automática.1 La óptica de Carl Zeiss Vario-Sonnar Lens es excelente, inigualable, felicitaciones a Sony por la alianza.2 La resolución de 5 MP es más que suficiente para las fotos familiares.3 El tamaño es muy conveniente, ya que cabe en cualquier parte3 Los videos con sonido son espectaculares4 La función de visión nocturna y el holograma láser son sorprendentes para una cámara tan pequeña y de gran utilidad.5 Las baterías son muy duraderas6 Algunas críticas que no le quitan méritos: el encuadre a través del visor es ligeramente más pequeño que el real visto por la pantalla de la cámara; las fotografías son numeradas en orden sucesivo y no incluyen la fecha en la numeración.En pocas palabras: Excelente", "Date": "February 8, 2005"}, {"Title": "Werewolf: Good in day, bad at night.", "Author": "Moon Man", "ReviewID": "R3LJ63NZMKIGD7", "Overall": "2.0", "Content": "This camera:Good, overall. Functions are good, quite good quality. In daylight, the pictures turn out beautifully. (at night, its a nightmare.)Bad: bulky, Color difficulties, small LCD screen, \"Nightshot\" is a joke (weird black and whitish color texture that looks like youre seeing through night vision googles), too strong a flash.", "Date": "December 17, 2005"}, {"Title": "Sony did it again!!", "Author": "\"universoul1\"", "ReviewID": "R1MTU2J856O266", "Overall": "5.0", "Content": "This is a great camera, it is my second Sony and I couldn't have ask for anything more. Easy to use and awsome photos and not to small.", "Date": "September 10, 2003"}, {"Title": "Average Joe - Things that matter", "Author": "Tanuj Mohan \"TanMan\"", "ReviewID": "R1EPSJI3GAVDIH", "Overall": "1.0", "Content": "I bought this camera from Dell based on all the reviews here and dpreview.com and was excited to get a hold of it. Took a couple of pictures and immediately noticed that the zoom button and response were very poor. If you look through the optical viewfinder you immediately smudge the LCD with you nose.I took some pictures and noticed a blue pixel in all pictures taken (viewed at full resolution on screen). AAah! can be easily fixed but you expect perfection out of the box. I exchanged it. The replacement had a white pixel bang in the middle of all pictures. Called Sony heard some crap about it being a high precision system and this was acceptable. Promptly returned the camera. None of the Olympus and Minolta 5 MP cameras friends have exhibit dead/stuck pixels when new. Maybe I was just unlucky... But what is worse is that Sony thinks imperfection out of the box is OK! Must add that the pictures were good though...", "Date": "March 6, 2004"}, {"Title": "Awesome!!", "Author": "\"wolf4540\"", "ReviewID": "R1MOHS3B0KTEJO", "Overall": "5.0", "Content": "This thing is the best. ease of use and compatibility to a Mac. The BEST!!!!", "Date": "December 3, 2003"}, {"Title": "Hate this camera, buying a new one asap!", "Author": "Ckk", "ReviewID": "R3EM1A9RO59V0V", "Overall": "1.0", "Content": "So many little annoying things about this camera! Everytime anyone else takes a picture, I have to tell them not to put their finger on the flash which is placed in the worst place possible. Takes really bad indoor pictures. If the object (say kids)is even slightly moving the picture is soooooo blury! The flash takes so much time to recharge the by the time you want to take another picture the moments has come and gone! Thank goodness for photoshop because I am constantly ajusting the color quality, and red eye. It is so bulky compared to most cameras! The battery doesnt last more than 30 minutes. I would give this camera no stars but it wasn't an option! Don't waste your money. Buy a cannon!", "Date": "July 9, 2007"}, {"Title": "Title", "Author": "Thomas E. \"evil\"", "ReviewID": "RGIQO2WL21MNN", "Overall": "5.0", "Content": "I have not noticed an extra special feature on the descriptions. It's a real pro one. Buttons work randoom. Oh yes!, I am VERY satisfied with my camera. How couldn't I be ? Sony tested it ONE HUNDRET TIMES before I bought it.Honestly... the other features make an excellent camera.", "Date": "January 19, 2005"}, {"Title": "OVERRATED", "Author": "Wolf", "ReviewID": "R1ZJW73ZW2BEVP", "Overall": "3.0", "Content": "WAY overrated - Amazon reviews have certainly sold out.  Nightshot is a joke - it's a black and white image - better off just using a flash.  The aperture only goes down to F2.8, so forget about serious low light color photography with this camera (Cannon C3040 - a four year old camera goes down to F1.8).  Like the other reviewer I had dead cells right out of the box (white and purple spots on the image).  Day time photos look really great but in any light other then bright sun light the photos will blur.  I wish the Carl Zeiss lens was on my old Cannon.  Bottom line is this is another Camera crated by marketers and not photographers. Two because in perfect daylight conditions the Carl Zeiss lens really can produce a nice image.", "Date": "September 27, 2004"}, {"Title": "A fantastic camera with only one serious drawback", "Author": "Laura D. Frederick \"lafredhead\"", "ReviewID": "RW9KYCPS0T6EZ", "Overall": "4.0", "Content": "The Sony DSC-V1 is my first digital camera and I absolutely love it.  I don't really have anything to compare it to, but I have so far only one serious complaint.  I bought a Sony camera in particular because I wanted to be able to take short mpeg movies as well as photos.  The Sony apparantly is the only camera that can take mpeg movies of longer than 3 minutes.  However, this camera only offers two movie sizes:  160 (for e-mailing), and 640 (full size).  The 160 size is so small it's hard to see -- when enlarged to 2x in Real Player, it gets very fuzzy.  The 640 is lovely to look at but the file size is HUGE.  I recorded for 16 minutes and was close to filling up a 512 mb memory stick!  That size just isn't practical for anything -- I can't take a movie small enough to e-mail, or even burn onto a CD -- I'd have to buy a DVD burner to burn even the shortest movie in this size.  What I really need is the 340 size movie, available in other cameras (my cousin's Canon has it).  That is my only really serious complaint with this camera.  The other things (position of the flash, hard to find good grip for left hand, expensive memory, and reds do seem to be a little bit extra-saturated) are workable.", "Date": "June 7, 2004"}, {"Title": "great camera", "Author": null, "ReviewID": "R107P9O47I0GON", "Overall": "5.0", "Content": "sony stylesony qualitysony durabilitysony luxurynothing beats this camera, except for a bigger zoom", "Date": "June 15, 2004"}, {"Title": "Que cámara más extraordinaria!!!", "Author": "R. A. Gochez \"fito33\"", "ReviewID": "R1H2PH98GT9YJ", "Overall": "5.0", "Content": "Recièn he cambiado mi Sony dsc-p10 por la Sony dsc-v1. Que buena decisión!!. La Sony dsc-p10 es una muy buena cámara e incluso mas pequeña y delgada que la dsc-v1, pero que en situaciones de poca luz se comporta muy mal. La dsc-v1 tiene varias característica que aventajan a la dsc-p10. Una de ellas es que la dsc-v1 posee las funciones Nightshot y Nightframing. Nightshot te permite disparar a objetos en lugares oscuros como escenas al aire libre por la noche o a animales o plantas en situaciones nocturnos e inclusive en total obscuridad. La función Nightframing te permite enfocar un objeto en la noche y grabarla con sus colores naturales usando el flash. La calidad de las imágenes es superior a la dsc-p10, èsto gracias a su lente Carl Zeiss Vario-Sonnar. Otra cualidad que hace de la dsc-v1 muy superior a la dsc-p10 es que tu puedes elegir el mètodo de disparo entre: 1)modo automático (el enfoque, la exposición y el balance de blancos son automáticamente ajustados lo que te permite una facilidad de disparo...èsta es la única función que posee la dsc-p10) 2) disparo automático programado (tu puedes cambiar la combinación del valor F y la velocidad de disparo) 3)prioridad de velocidad de disparo (esta función te permite disparar un objeto en movimiento rápido congelándolo) 4) modo de prioridad de apertura (èsta función te permite cambiar la profundidad del enfoque brindándote ambos, el objeto y el fondo dentro del enfoque o disparar a un objeto con un fondo borroso. y 4) modo de exposición manual (tu puedes manualmente ajustar la velocidad del disparador y los valores de apertura lo que te permite disparar en situaciones de acuerdo a tus propósitos). Lo que yo podría decir en contra de èsta extraordinaria cámara es una falla de diseño al colocar el flash (que salta) en el lado donde normalmente tu colocas tu dedo izquierdo para disparar pero creo que nada es perfecto y con el tiempo aprendes a agarrarla correctamente. Otras cualidades en contra y que muchos ya han mencionado (propias de todas las cámaras Sony) son: 1)la poca duración de la batería (que se compensa adquiriendo una de repuesto) y los 32MB del memory stick que es una broma y que tambièn se compensa adquiriendo uno de 128MB ó de 256MB. Espero sea de ayuda. (En español es mejor!!).", "Date": "February 22, 2004"}, {"Title": "Sony missed it on this camera", "Author": "Johnathan Parker", "ReviewID": "RH8AEXBYA69L5", "Overall": "2.0", "Content": "I owned this camera for about 3 days. I returned it 2 reasons:1) The pop-up flash is located on the upper left-hand side of the camera where your index finger would normally go to hold the camera. This prevents the flash from popping up; to accomdate you end up holding the camera awkwardly.2) I couldn't find the \"Erase all images\" function. I think sony forget to add it. I couldn't find it in the manual either.I could have lived without the Erase all feature, but I just didn't like the way I had to hold the camera. It always felt like I was getting ready to drop it.", "Date": "November 27, 2003"}, {"Title": "Poor Auto White Balance ( Blue Cast)", "Author": "John SJ \"john911\"", "ReviewID": "R2ZP3TU3CX9CPH", "Overall": "3.0", "Content": "The Phil Askey / dpreview.com review of the Sony Cybershot DSC-V1 concludes that the camera's auto white balance is \"poor\" in  \"outdoors indirect sunlight\" conditions. I decided not to buy this camera.", "Date": "July 16, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "5 megapixel sensor (2592 x 1944 pixels) for enlargements up to 20 x 30 inches\n4x optical zoom plus 4x digital zoom (16x total)\nNightshot infrared feature; MPEG VX movie mode with audio recording; connects to PCs and Macs via USB 2.0\nIncludes 32 MB Memory Stick; compatible with Memory Stick Pro media\nPowered by Lithium-Ion InfoLithium battery (NP-FC11) that is charged in-camera by connecting an A/C adapter (included)", "Name": "Sony DSC-V1 Cyber-shot 5MP Digital Camera w/ 4x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51BBZM4251L._SX300_.jpg", "ProductID": "B00008O35T"}}