{"Reviews": [{"Title": "This pipsqueak rocks", "Author": "\"tim_sf3\"", "ReviewID": "RGOEC15TW6XEM", "Overall": "4.0", "Content": "I have been using my new Cyber-shot U camera for several days now and I have to say that overall, this little camera is terrific.All I want to do is to take some pictures, have the immediate gratification of being able to see them immediately, crop them and post them on a website or email them. MAYBE sometimes print them out. I have no intentions of blowing them up to 8x10\". In my entire life I have never blown up a photo that big...biggest I ever got was 4x6, so I'm a little surprised why all of the companies are thumping this 8x10 thing.I played with my friend's 3.2 megapixel Sony camera and I was seriously considering buying a more full featured camera such as that, until I saw and tried this camera.Here is my list of pros and cons:---- The good list ----EXCELLENT SOFTWARE:The software driver makes it *so* easy to transfer images to my computer. The camera comes with a USB cord that you simply plug into the camera, and a \"Removeable Drive\" appears in Explorer. There's one folder for still images, and one folder for MPEGS. This was one of the selling points for me for a Sony camera in general.QUICK INITIALIZATION:As soon as the camera is turned on, its ready to shoot. This is an EXCELLENT feature for those of us who want to be able to capture a real-life image that may not be there for too long. Many other cameras have agonizingly-long initialization processes that can seriously impede many photographic impulses.NON-PROPRIETARY BATTERIES:This camera (like some other Sony models) uses a pair of Nickel Metal Hydride rechargeable batteries. I like the fact that I can go to a non-Sony company and buy extra batteries if I need to. Plus, if I am in a pinch, I can buy alkaline batteries and use them (even though alkalines are not recommended because of how quickly they are drained). MANUAL LENS COVER:The cover to the lens is a manually-operated \"door\" that you slide sideways to reveal the lens. Plus it also turns the unit on when it is opened. I like this feature very much because it allows me to control how quickly I can open the unit, and therefore, how quickly the unit is ready to shoot. I DON'T have to wait for some motor to do it's thing and tell me when it's ready to shoot (like most other digital cameras).And by the way, all of the other cameras I looked at had so many delicate moving parts to their mechanized contraptions that I believed that over time I would have eventually lost a spring and would've had to send it to the manufacturer for repair. Most models have super-small moving parts, especially for the lens. Usually they have tiny little doors over the lens. They are very thin and have springs attached to them. I like the idea that I won't be carrying around something so delicate in my pocket.VERY GOOD PICTURE QUALITY:This is a 2 megapixel camera and takes excellent photos for what I need them for (web). I have taken hundreds of shots and am extremely satisfied with the results.SIZE AND WEIGHT:If you've seen the unit, you'll know. It's very light and very small. It fits easily in my pants pocket. You'd never know it was a camera. I don't know many other cameras that fit into pants pockets easily.GOOD DESIGN:It's very intuitive to use and the features are easy to find.--- The not-so-good list ----SMALL PREVIEW SCREEN:The window is too small to let you know if the shot you took is clear. Definitely one of the weaker aspects.BRIGHT FLASH:The flash is a bit too bright. It tends to have a \"drowning out\" effect for images shot close up. I contrast this to my friends Sony 3.2 megapixel camera that did not have the drowning out effect as much. I muted the flash by taping a piece of white paper over it. So far this is working great.CHARGER UNIT DOESN'T DISCHARGE THE BATTERIES:The camera comes with a charging unit to recharge the batteries, but it doesn't discharge the batteries first. The manual recommends that you should discharge the batteries before recharging, and I suppose this has to do with what I have been reading about Nickel Metal Hydride batteries' slight \"memory effect\" whereby battery life can be shortened depending on when they are recharged.For me, the benefit of having a compact camera is that, before I begin my expedition, I am going to grab a fresh set of batteries, drop them into the camera, and then go. I figure the battery life will last me a day at least, so I don' t need (or want) to carry extra batteries if I don't have to.So, this means that I would have 2 options if I didn't buy a new charging unit that first discharged the batteries:a) carry extra batteries and then switch them out when/if the first ones die, which I don't want to do.b) start with fresh batteries and then when I get home use the camera to discharge the partially charged batteries before recharging them. Let's not forget that the camera has a auto-off feature that turns the camera off after 3 idle minutes. So discharging the batteries can be a real chore.NO ZOOM:There is no zoom. But my non digital camera didn't have a zoom either. This doesn't bother me too much. This could arguably belong in the \"good\" section simply for the fact that simple is better here.BAD MPEG QUALITY:I didn't buy the camera to capture mpegs, and this is icing on the cake. However, the mpeg quality is dismally bad.Overall, I LOVE this camera. It amazes me that Sony was able to put so much into such a small unit.", "Date": "February 3, 2003"}, {"Title": "Best among truly tiny cameras, but be sure that's for you", "Author": "Snap, Crackle and Pop", "ReviewID": "R1JJQM7RIFVQS9", "Overall": "4.0", "Content": "As you can see from some of the reviews, this camera gets great marks as something you can always carry, and shoot quickly with.  (The simplicity of the camera reduces the \"shutter lag\" that is so frustrating on some digicams - many digicams miss the shot you want because of a delay between when you press the shutter and when it captures the image.)  With this tiny Sony, you get the benefit of the several generations of Sony design of compact digicams, and Sony's skill at miniaturizing electronics.  For some, this really can be the perfect camera.But there are some big compromises, so make sure this is what you want.  There's no optical zoom, so it's harder to make the most of the somewhat limited pixel resolution by zooming in just the part of the scene you want.  Lack of a viewfinder means you'll drain the battery quicker, and may have trouble seeing what's in the picture in bright sun (which washes out the LCD).  And the optics and flash do suffer on a camera this small.So think about what you need.  This camera will be a dream for some.  But others can get much better quality and lots of useful features - without much more size or cost - in the Sony DSC-P2 or P7.", "Date": "December 12, 2002"}, {"Title": "Sexiest Camera Ever...", "Author": "glenn phenicie", "ReviewID": "RPJPLHX1AK2PJ", "Overall": "5.0", "Content": "Basically, this product could either get a 3 or a 5.  It all depends on the needs of the user.  I recently sold my higher performance digital camera (for which i had bought a couple high quality lenses) and replaced it with the Sony dsc-u20.  The only reason for anyone to give this camera a bad review is because it does not suit their personal needs.  The whole point of this camera is it's size and sexiness.  The common complaints:  no viewfinder, small lcd, no zoom.  These features though (or lack therof for some) are what kept this camera small and sexy.  Bottom Line: This camera can fit anywhere and it looks amazing.  The picture quality is not bad at all.  It boggles the mind to consider the size of this camera, EXCLUDING memory stick and batteries.  If you want to take amazing pictures, get a nice 3 or 4 megapixel sony cybershot with optical zoom.  Keep in mind though, that you wont use your nice full feature camera half as much as this one, as it is ten times as easy to take with you, and it wont discomfort you one bit to have it in your pocket during any regular activities.  Keeping all this in mind, i give this camera a 5.  I can take it anywhere with me and take good pictures.  I never wanted to take my old digital cam with me anywhere because i had to keep it in a case and carry it externally.  This baby can fit anywhere (around your neck even if you feel like looking like a tourist).  Guaranteed to be the sexiest camera you've ever seen.", "Date": "May 13, 2003"}, {"Title": "if you ever wanted to ALWAYS have a camera with you", "Author": "Michael", "ReviewID": "R39B8JDPUMBGLQ", "Overall": "5.0", "Content": "then this is the one.For its small size this camera can't be beat.This camera is basically about the size of a pack of bubble gum and is completely functional as well. The flash is powerfull, the camera \"boots up\" instantly, pictures transfer quickly to your computer, the battery life is good and the picture quality is comparable to the canon digital elph. I have used for almost a month now and taken around 300 pictures. Which is 300 more than I took the month before :). There are, however, some people that have had a few bad things to say about this camera. Most complaints I have read such as the \"battery charge time\" are easily refuted. Sony included a cheap battery charger with the package. I picked up a fast NIMH battery charger from an electronics store and some extra rechargeable AAA batteries for  and the problem was solved, case closed. This is my first and will probably be my only review on amazon. I just wanted to share some info on a great camera. I hope everyone found this helpful.", "Date": "March 28, 2003"}, {"Title": "Great little camera!", "Author": "Joel D. Newman \"commander1836\"", "ReviewID": "RTJG2I0267AHR", "Overall": "5.0", "Content": "After looking into other micro-digital cameras, I thought I would take a chance on the SONY because of it's 2MP and other reviews. I AM NOT DISAPPOINTED.Positives:1.The size and weight are impressive and easy to handle.2.Picture taking clear and simple.3.5x7 quality is 5 outdoors and 4 indoors.Negatives:1.No zoom (which I would sacrifice for weight and size).2.Flash limited in distance. Excellent quality indoor pictures up to 8'.Overall:HIGHLY RECOMMENDED for size, weight, quality and ease of us.", "Date": "February 17, 2003"}, {"Title": "Coolest camera on the planet", "Author": "Randy Rathbun \"total nerd\"", "ReviewID": "R1B00DWSXYO5ZN", "Overall": "5.0", "Content": "Okay, so it is not as good as a full sized 35mm SLR in the image quality/features department. But for the price, and most importantly the size, it is perfect. The size factor is what sold me on this. After owning an Aiptek Pencam SD for a few weeks, I decided that having a flash would be nice. That was one of the things that drew me to the U20. Being small means it travels everywhere with me. I am now never without a camera. It is so tiny you can't help but take it with you, and if you don't you are doing yourself a great injustice. The image quality is extremely good. Not perfect, mind you, but still excellent. There are a few things I wish it had such as zoom, but that would only end up making the camera big, which defeats the idea behind this dude. The camera is also very easy to use. I did have to consult the manual to figure out how to do some of the things on the menus, and I always pride myself in never reading a manual. But once I saw how to change settings I tossed the book to the side and figured out the rest in about 5 minutes. My one gripe is the 15 second time limit and extremely small image size on video. What is up with that? The Pencam SD is able to capture 640x480 video in one go as long as the batteries hold up. Limiting the user the way Sony has with this cam is pretty dumb in my book. I see no problems at all with \"slow shutter speed\". You push the button and it instantly takes a picture. The only time there is any delay is when it is very dark and the camera is trying to focus - but that happens with all cameras. In normal lighting conditions this thing is every bit as fast at snapping a picture as my Canon A1. This camera rocks.", "Date": "March 3, 2003"}, {"Title": "The ultimate (so far) point-and-shoot.", "Author": "ex", "ReviewID": "RVJR5I63SSRMS", "Overall": "5.0", "Content": "You definitely need to hold one in your hands to get just how insanely small it is.All in all an excellent camera. The 8MB stick holds 15 pics at 1632 x 1224, and around 80 at 800 x 600. A 128MB stick would then give you an absurd amount of pics at either res. It conveniently turns on when you open the lens cover; you can do this single-handedly while pulling it out of your pocket, and you'd be ready to shoot as soon as you spot the LCD. The LCD itself, while small, is still very viewable and very good. Transflective, so you can turn off the backlight to save batteries. Batteries do take 13 hours to charge, but the super charger will charge ya a set at around 3 hours. The camera itself is ready to use right off the box; you get the rechargable batteries, the charger, the usb cable, 8MB stick, neck strap thingy and software cd (drivers, image transfer, etc).My only actual compaint is it's inability to get low-light pics. Strangely enough it'll brighten up on the LCD if you've got the flash feature turned off, but the pic itself will be recorded as dark. Granted, if you honestly wanna photograph still life, prone to glare and ruin your shot if flashed at.. you might be better off leaving consumer-level camera county. Although the camera in itself is entirely capable of shooting anything that can be shot at wide angle.Without optical zoom.. you're left with the ultimate point-and-shoot. Extremely small, extremely appealing, very good picture quality, tons of features.", "Date": "April 29, 2003"}, {"Title": "Cool, cool, and useful", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "R3S8J601N1QLY4", "Overall": "5.0", "Content": "When I first saw the DSC-U20 at the Sony Style showroom in midtown Manhattan, I was totally awed.  This is definitely the smallest digital camera on the market today, and the styling is superb, making it one of the things you want to own the moment you see it on display.Under the beautiful skin is a capable digital camera, with 1632x1224 resolution (good for prints up to 6\"x4\") and very good image quality.  The small flash does limit its use in dark settings, and the lack of optical zoom sticks out as a disappointment, but considering the typical use for a camera like this -- quick snapshots, party memories, candid exposures -- the overall package is still excellent and the feature compromises understandable.(For the ultra-cool and compact digital camera with optical zoom -- 3X at that! -- I heartily recommend the Minolta Dimage X and Xi, also available on Amazon.com.)The camera's lens, rated at the 35mm equivalent of 33mm (which makes it a wide-angle), is well made, as is the case with all of Sony's cameras.  The camera has center-weighted auto focus with macro capability, and also center-weighted auto exposure.  Shutter speed is rated in the 1/30 - 1/2000 range, typical for consumer-class digital cameras.  The LCD viewfinder measures 1\", which is quite small but still usable to most people except those who need thick reading glasses.  You get a few digital effects (black&white;, negative, solarize, soft snap, etc.) when you do feel the creative juice flowing.  You can also take 160x112 MPEG-format video clips, but I find this feature pretty much uselessFor power the U20 uses two AAA NiMH rechargable batteries.  You can buy these batteries for cheap at Radio Shack, for example, and the camera kit comes with a recharger, although you can buy fancier ones that charge in less time and condition the batteries as well (actual benefit: unknown).  I've taken about 30 pictures, all with flash, so far, and the batteries are still good.  I definitely prefer these batteries to LiIon since 1) NiMH AAA is cheap and sold everywhere, and 2) they hold more power than LiIon and also have more rechargable cycles (i.e., they can be recharged more times).  I'll update the real-world battery life rating once I get a better picture of it.Weighing in at 4.5 ounces with batteries and sporting the \"I'm just cool\" styling of Sony, the U20 is a little digital camera you'll love and carry with you all the while.", "Date": "April 16, 2003"}, {"Title": "Fun on the go with no software hassles", "Author": "\"guswoolsack2\"", "ReviewID": "RI5PNJTEYZKC6", "Overall": "5.0", "Content": "If you just want an easily available (shirt pocket set-up)digital camera this is the way to go. The software worked on my no-name 98 box - Apple commercials aside. And, it is easy to use. Once you are passed the initial date seting etc. it is the proverbial piece of cake. The Sony case - don't bother - [$$$] for a case that small is ridiculous. Also, watch what you spend on memory sticks - if you are JPEG'ing it to send e-mails you only need the lowest format. I am happy with it. Would suggest Adobe Photoshop or whatever for editing before sending to friends. One other warning - not for the visually challenged - the 1 inch LCD display is not for folks who have put off a trip to the eye doctor a tad too long.", "Date": "December 6, 2002"}, {"Title": "Bring the camera with your everywhere you go ...", "Author": "Ben Liong", "ReviewID": "R3F1WG0KQMN04Y", "Overall": "5.0", "Content": "Sony products has always been known for their style and quality, and this tiny (and I mean tiny) camera is no exception.  Easily fit into your palm, this camera would fit into your pocket without you knowing it's there.  Form factor wise, this camera just can't be beaten. When it comes to quality of photo taken, I found after 3 months of use that outdoor pictures come out near perfect.  The only 2 pictures that I had problem with is in one Chinese Eatery where the light is dim and in weird yellowish colour, and I highly suspect that some of the bigger \"higher MP\" camera would give have given me the same result. This camera does not have zoom, and it does take a while to get used to the fact that you have to bring the camera forward physically.  A camera this small means it is very easy to have covered the lens or the flash without knowing.  But you'd get used to all these and be snapping pictures whenever people least expect it. If you have a normal camera that you find yourself leaving at home most of the time, this camera is for you.  I have it with me almost 24/7.", "Date": "May 12, 2003"}, {"Title": "Disappointing Picture Quality", "Author": null, "ReviewID": "R3B26E9LR5AKDP", "Overall": "3.0", "Content": "I wanted a small digital camera to replace my bulky Kodak, and couldn't resist buying the Sony.  It was incredibly small, looked easy to use, and ran on AAA batteries, which I thought would be rather convenient.  When I tried out the camera, however, I was disappointed with the picture quality.  The pictures it took were too dark and rather fuzzy, even when taken in good lighting conditions, using the maximum pixel setting.  I'm only an occasional photographer, but the pictures this camera took did not meet my expectations.  It was, however, easy to use, and very convenient, and if Sony manages to improve the picture quality, I'll look at this model again.  For now, however, I'll be returning this Sony for an Elph 2MP camera.", "Date": "February 4, 2003"}, {"Title": "Tough, small, great shots", "Author": null, "ReviewID": "R3FS8YA79JKQZ0", "Overall": "5.0", "Content": "I took this to Iraq in order to have a camera I could keep with me at all times.  For 6 months I lugged it around wherever I went.  Despite the lack of a zoom, it took great shots, and with a large (128MB) memory stick, I was able to store many pictures and download them when I had the opportunity.  Just what I was looking for!", "Date": "December 19, 2003"}, {"Title": "A decent little purchase...", "Author": "Riffraff67", "ReviewID": "R369X3KCKDONWY", "Overall": "4.0", "Content": "I bought this camera mainly for posting pics online, but I also intend to use this camera for my magazine article photos. I wasn't too impressed with the photo quality since the photo compression is pretty high (and it can't be changed), but if you shrink the photos (as you'd need to do anyway to post them on the web) then the quality is just fine. Otherwise, the main selling point of this camera is its size: You can bring it just about anywhere! It turns on quickly and battery life (with the included NiMH) is good. LCD screen is tiny but detailed. Make sure to take night pictures within 6 feet of the cam since it the flash doesn't illuminate much farther than that. Not many in-cam features but they're unnecessary anyway if you know Photoshop. Recommendations after purchasing? Buy a quick battery charge kit (it takes the pack-in charger 13 hours to recharge the batteries!) with extra NiMH batteries, a 128MB memory stick, and a travel case to keep it from getting scratched. Main qualm? It's a bit expensive. But hey, it's a Sony.", "Date": "May 1, 2003"}, {"Title": "Major fun camera", "Author": "Paul Merrill", "ReviewID": "R1TU1PJSQS6MAI", "Overall": "5.0", "Content": "I have had it for about a year. It is my constant companion. We ditched 35mm in favor of this baby. Results are not perfect, but for the size & price, it's wonderful. And don't forget that it uses AAA batteries!Having said all that, I am hoping to get a DSC P92 before our next family vacation...", "Date": "May 19, 2004"}, {"Title": "Amazing", "Author": "james p wallace", "ReviewID": "R1XSBQ8O6LMAB4", "Overall": "5.0", "Content": "I am amazed at the high quality of the pictures this little camera takes. I bought it to be my low resolution, take anywhere, point and shoot camera. I was pleasantly suprised by the picture quality. It is much better than other 2 MP cameras I have seen. I don't know if it is the lense, how the camera focuses, or just the software, but the pictures are very sharp. I have also been very suprised at how quickly it starts up. It is ready to take a picture within 1s of turning it on. I have been getting pictures I used to miss while waiting for my old camera to start up. Battery life seems to be good so far too.", "Date": "June 16, 2003"}, {"Title": "4.5 stars wasnt an option", "Author": null, "ReviewID": "R2P5MNXBBW5EIK", "Overall": "5.0", "Content": "The title says it. A perfect camera is cheap with infinite zoom and perfect quality. Not to mention size. This has the price, the size, and pretty good quality. So its close. The good features are the LCD (small but out of the way), the size (smaller than anything else), the start-up time, the photo effects (negative, sepia, b&w;, solarize), and surprisingly good picture quality. The bad is a few dots on one or two of the pictures out of 30 or so, not enough mem comes with it, the difficulty of turning on and off the display, and no zoom (but I dont miss it). There isnt a viewfinder, but the LCD works really well and is small enough to see under any light. In the dark you can see as much as you would in a viewfinder. The point is the Cybershot is small, relatively inexpensive, and has good picture quality to most. I wouldnt exchange for anything else. The size rules. At basketball games or the beach just rip it out of your pocket and youve got a picture 5 sec later.", "Date": "February 20, 2003"}, {"Title": "Pretty Good Camera, with a few exceptions...", "Author": "breaker902", "ReviewID": "RD5C2MW9G2PIX", "Overall": "4.0", "Content": "This is an excellent \"point and click\" camera.  Its 2megapixels give you what you need -- although 2mp's might not be enough for some people.Two Issues:FIRST thing everyone must know about this camera are the red-eye results.  The flash is RIGHT NEXT to the shutter/lens, making it a great candidate for a lot of red-eye, even with the red-eye reduction capabilities (flash, flash, flash, FLASH).SECOND thing everyone must know is that in a dark setting, the camera takes a 3-4 seconds in addition to the flash charge-time between taking pictures.Overall I'm really happy with it.  I bring this camera everywhere due to its compactness. Honestly, it's smaller than you think. Smaller in size, compared to my Nokia 8390 cellphone, but a bit thicker. And the photo quality for the camera's physical size is great. Although the ISO adjustment in dark settings makes it a bit grainy.", "Date": "January 20, 2003"}, {"Title": "James Bond wanna be?", "Author": "H. Min", "ReviewID": "R3CCFWTVF1FMQH", "Overall": "5.0", "Content": "Ok, wow....its so small. Just to give you an idea.  Its smaller then a Nokia 8260 phone in length and just a tad bit fatter. The LCD display isn't that big so its still hard to see how the picture turned out.  Always use red eye reduction because (everyone) will have red eyes.  No zoom and video mode is totally useless and grainy.  Taking pictures at night will sometimes give out picture distortions (litte spots on the picture). OH and the battery charger takes 13hrs to charge and I wish sony gave 16 MB memory stick instead of 8MB.  Now with all these complains...how can I give this camera 5 stars???  Well I bought the camera for one thing:the size(ITS SOOOO SMALL). The camera is also ready to take picture as soon as you open it (so you won't miss those sudden funny moments) My other digital camera (Fuji 2650) had a lag time of like 3-5 seconds when I turned it on.  The pictures are clear and distinct.  I wouldn't recommend this as your first digital camera (go with the Fuji 2650 3x optical zoom and same price or cheaper).  I had the Fuji 2650 but I never took it anywhere because its so bulky (compare to this camera).  I also tried the Sony DSC-U10 and the picture quality really stink (1.3 Mega pixels).  Get this camera if you wanna show off or a camera that can be taken everywhere.", "Date": "January 24, 2003"}, {"Title": "Sony Cybershot dsc-u20 is great", "Author": "J. Livingston", "ReviewID": "R10IYQMZS1MZG3", "Overall": "5.0", "Content": "This is an incredible little camera.  Have had it for about 5 years and it goes everywhere, takes awesome photos without a lot of useless confusing features.  Simple, it works, shoots quickly and holds about 185 images with the memory card.  Easy to pocket and take anywhere, can use regular AAA batteries in a pinch.  Too bad they dont make it anymore.  Sure the newer cameras have a big screen but aren't as easy to carry and manipulate and have too many confusing features.", "Date": "June 19, 2007"}, {"Title": "Great practical camera for everyday use!", "Author": "pfs", "ReviewID": "RMEJWPN5GHWVV", "Overall": "4.0", "Content": "I received this camera about a month ago & since then, take it everywhere with me.  It has become an everyday item for me - along with my cell phone, keys...  Its a great camera if you understand its capabilities.Pros:  nice, clear pics. small size. good flash. quick charge  for multiple pics.  cool features : able to take 5  consecutive pics,black & white, sepia.  coolness gets  you lots of attention! long battery life.  convenience  will allow you to take pics of everything - capture the  moments (discretely).  Easy to useCons:  no zoom, cover easy to slide open when fumbling thru  purse (turns on camera). view finder difficult to see if  pics clear.But if you understand what it can/cant do, you'll appreciate it & use it all the time!", "Date": "November 16, 2003"}, {"Title": "Tough little camera", "Author": "J. Gillette", "ReviewID": "R18HIV2JPHELFU", "Overall": "4.0", "Content": "I've had a u20 for about 3 months now and I think what sets it apart form other compact digitals is its form and shape.  I had originally bought a pentax optio S, but returned it because it always felt like it was one drop away from becoming history.  While the picture quality was not as good as you would accept from sony (no carl zeiss lens), it was good enough for an everyday camera.You will need to get a new charger.", "Date": "September 7, 2003"}, {"Title": "fragile product + short warrantee = not recommended", "Author": "Guarantee", "ReviewID": "R2KOWQX8X3GR9W", "Overall": "2.0", "Content": "During six months of ownership, I didn't handle the camera roughly but I did use it frequently (its size makes it incredibly convenient). Recently, the LCD screen began to take longer and longer before initializing for a new photo. I could immediately replay old photos on the memory chip (so I know the LCD itself was undamaged) but its now gotten to the point where the camera is useless. I tried resetting, I tried a new memory card, new batteries - no good. I went to Sony's cumbersome automated product support site to find my product is out of warrantee and its a flat rate $177 to fix the camera regardless of whats wrong with it. As this is near current retail price, I can only assume they just recycle mine and box out a replacement. For that kind of money I'm buying a replacement... but this time its not going to be a Sony. I'll take my chances with another brand. My old Kodak DC-50 is still going strong years after I bought it... perhaps I'll see what they have to offer.", "Date": "September 6, 2003"}, {"Title": "Works for what it's for", "Author": "Timothy Lin \"Tim\"", "ReviewID": "RKEVPUYLL5OHB", "Overall": "4.0", "Content": "Get this camera if all you need is some quick snapshot.Pros :  very compat size  uses regular AAA battery  almost instant-on ( if you don't use 128MB memory stick )  lens cover double as power switchCons :  noisy picture  image not at sharp/detailed as other cameras at the same price  battery drains quickly ( but you can always bring extra pairs of NiMH rechargeable batts )  the batt charger comes with it is awfully slowConclusion :Get it , if all you need is a point-and-shoot film camera replacement. Don't forget to buy a faster batt charger and some extra high capacity NiMH batts :)", "Date": "January 26, 2003"}, {"Title": "Good things come in small cameras", "Author": "\"ksmith390\"", "ReviewID": "R3V8SDI46Z9YAA", "Overall": "4.0", "Content": "I just picked up this camera last week and it's great! I wanted a really small camera that I could take with me out on the town. This is a party cam...designed to take spontaneous and random pictures that you can e-mail to your friends. The interface on the camera is so simple...I didn't even have to open the directions. The battery life could be longer but that's what you're sacrificing with the size. I would say that this camera is the perfect companion for someone who does not want to pay a lot for a digital camera and wants decent quality out of it.", "Date": "December 5, 2002"}, {"Title": "Many great features, one big drawback.", "Author": "Rheumor", "ReviewID": "RUBFVSSD6APFS", "Overall": "4.0", "Content": "I just got the U10. It's a little gem that will serve as my new glove box cam. I've used it indoors and outdoors, with and without flash, and I'm very pleased with the pictures I've gotten thus far. I took an experimental movie clip (no sound) and it also looks fine. The 2 megapixel resolution (you can also select lower res for computer/Internet use) is crisp up to and including prints of 8\" x 10\". The camera uses 2 rechargeable AAAs (the charger is included) and the battery life is very good. The included 8 megabyte Memory Stick is too small, but I put a 128 meg (Lexar) card in there. One should get almost 200 pics at its full 2 megapixel setting. Settings and menus are simple and the instruction manual is not needed. The size and weight are of course the big pluses here. I gave it only 4 stars though because I felt the price was a bit high for the specs (obviously, the price is the premium for the size) *and* because without an eyepiece viewfinder, one is forced to frame through the tiny LCD on the camera's rear. That is a nearly impossible task in sunlight, making for a significant drawback. Nonetheless, I'm having fun with it and I'm sure you will too!", "Date": "February 1, 2003"}, {"Title": "One of the best electronic purchases I've ever made", "Author": null, "ReviewID": "R2GUG1WHBZ1K57", "Overall": "5.0", "Content": "I just got this as my first digital camera.  I mostly need a camera for when I go out on weekends, and this small size is perfect for my needs.  This easily fits into your pocket and is perfect for group pictures with friends at events/clubs/parties/skiing/canoeing/videogameArcade/horseshoe.I love gadgets, and this is surely one of the best purchases I've made in the electronics department(go get your Samsung s105 phone, handspring treo, t-mobile sidekick, and roomba robovac while you're at it, they'll complete the picture).Make sure you get the quick recharger starter kit, otherwise you will wait 13 hours for the batteries to recharge (as opposed to 1.5 hours).  Ths picture quality is excellent.  Great color saturation.  And not like you need more than 2.0 megapixels unless you're some professional photographer (1600x1200 is larger than most desktop resolutions).  For the ... price tag, this camera is STILL worth every penny.  Just don't expect a ton of features (no zoom, no eyepiece viewfinder)... the price is all justified in the size and sony quality you've come to expect.Don't install the software that comes with it (Pixela), it's nothing worthwhile.  Works flawlessly with Windows XP.  GET IT BEFORE YOUR FRIENDS DO !", "Date": "December 10, 2002"}, {"Title": "Didn't suit my needs", "Author": null, "ReviewID": "R34XC8QOBFYN4D", "Overall": "2.0", "Content": "Pros:  Small; AAA NiMh batteries so you can always have some charged and ready.Cons:  Slow shutter, bad picture qualityThe small size makes this camera perfect for snap shots, but the slow shutter limits the types of pictures you can take.  I tried to use it to use it to take pictures of my nephew but I have to predict when he is going to do something cute a second before he does it or else I'll miss it.  I know I can lock the focus by pushing in the button a little then depressing it all the way when I want the actual shot, but then that means I or my nephew can't move or else the picture will come out blurry.  I wanted this camera so I can take spantaneous pictures, but it's only good for poses.", "Date": "February 21, 2003"}, {"Title": "Deffect", "Author": "Diogo A. B. Maule \"Diogo Maule\"", "ReviewID": "R3TGRZEJGG741X", "Overall": "2.0", "Content": "Sony DSCU20 Cyber-shot 2MP Digital Camera (Silver)+B2Well, I had two of these cameras and they're great when working ok. But the two I possessed had that SAME deffect... the pictures starts to become pink and the screen blackout and the USB does not connect to PC anymore.It used to be good.", "Date": "June 8, 2008"}, {"Title": "TOOK A LICKIN & KEPT ON CLICKIN!", "Author": "S. Howell \"Sandy\"", "ReviewID": "RVJRIB9JO7DRO", "Overall": "4.0", "Content": "Though I've not had experience with this U-20, I can comment on its predecessor, the U-10, which is a 1.3 megapixel version of this camera.When our son in law was deployed to Iraq in Feb. 2003, I wanted to send a digital camera with him. It needed to be very small and lightweight, but also needed to withstand the rigors of life in a fox hole.  The Sony Cybershot DCS U-10 really came through!  When he returned 8 months later the camera  had been dropped many times and had a lot of scratches and dents.  It was very dusty and gritty and even the memory card inside felt gritty. I was afraid the data on the memory card wouldn't be readable.  But also, the little Sony had takin a lickin and kept on clickin! The pictures were very very good for a 1.3 megapixel.  The photos taken inside the tents were a tad dark because the flash only goes about 6 feet, but overall they were good. The photos taken outside were wonderful.  If I had to send another camera off to the Iraqi desert, I'd stick with the Sony and choose another Cybershot U.  It may have its limitations but it was perfect for the need we had.", "Date": "November 21, 2003"}, {"Title": "Works like a champ!", "Author": "A Customer", "ReviewID": "R3M7MM0E6EY8KK", "Overall": "5.0", "Content": "I have a good digital SLR. But what I really needed was a quick easy to use camera that could fit in a pocket and go anywhere. I found the right camera in the DSC-U20. Sure, its limited, but that's part of its charm. Its small and easy to carry anywhere. Its quick to get it into action and the menu is so simple its ... proof. Add a larger memory stick and you'll have a great camera for everyday use. The picture quality is good enough for 4X6 and even will sqeak out a decent 8X10. Color seems good. The physical size is perfect. I carry it around in my front jeans pocket and forget that its there. The memory stick door is easy to use too. For the money your can't go wrong.", "Date": "August 18, 2003"}, {"Title": "A fun little camera!", "Author": "Charles Pinady \"Gwodny\"", "ReviewID": "R14CRCPQDS2JWT", "Overall": "4.0", "Content": "The three things I took into consideration when I was shopping for a digital camera was: size, price and picture quality. This camera met all 3 requirements easily. Size: almost as small as the current crop of cell phones. People couldn't believe how small it was. Personally, it's a little on the thick side so I put it in my pants instead of my shirt pocket. Price: good value for your money. More features than you'd expect from a sub camera. Comes with its own recharger and NI-MH batteries. About 13 hours to charge it fully.Picture quality: I was actually quite surprised by the picture quality. Really. It's more than just decent or average, it's good. Movie quality however is terrible. Don't bother with it unless you are outdoors with lots of light. Also, you cannot record sounds.Bottom line: you'll be glad you gave this camera a shot. Great conversation piece too. Pop in a 128 MB memory stick and you can take up to 244 pictures at 1632x1224! It's just a lot of fun!", "Date": "May 26, 2003"}, {"Title": "Simply Irresistible", "Author": "J. C. Arizaga \"jc\"", "ReviewID": "R2A9VRVZACNOET", "Overall": "5.0", "Content": "Amazing 2MP camera, lacks optical zoom, but definately compensates in size. If you want something simple for everyday pictures, the u2o is for you.", "Date": "April 26, 2003"}, {"Title": "When size matters...", "Author": null, "ReviewID": "R16BM3ZHT38Y4F", "Overall": "5.0", "Content": "I wanted a camera that was small enough to fit in my shirt pocket, easy and convenient enough to take quick pictures, and that offered enough extras to make it all worthwhile.  This one does.  I have taken low light, bright light, movies, moving stills, and others and ALL have come out good.  The only thing to be wary about is that you MUST get close to your subject or the subject will be too small in the picture.  It is easy to download the pics to your PC.  I haven't had any trouble and I'd do it again, but I'd demand a case to keep the viewing screen from being scratched this time.", "Date": "February 21, 2003"}, {"Title": "Great Buy for a small package", "Author": "Tom Beshke", "ReviewID": "R26GDD9B36V176", "Overall": "5.0", "Content": "The Sony Cybeshot DSC-u20 is a fantastic buy and a great little camera. I reolaced my bulky Panasonic Super Disk camera with the Sony and I couldn't be more pleased. The pictures are every bit as good as larger cameras with more mega pixels. You can print an 8 x 10 that is frameable and displayable !I highly recommend this product. It's small enough to fit in your shirt pocket and very easy to use.", "Date": "January 25, 2003"}, {"Title": "Sony has done it again", "Author": "RJP", "ReviewID": "R140C53VJQHJJ2", "Overall": "5.0", "Content": "This camera is amazing.  I've only had it for 2 weeks and I love it.  I already have a 3.3 megapixel camera with zoom (Sony DSC-P1) so this was more of a \"pocket\" camera. Just something to throw in my pocket for \"everyday events\" that I want to capture.PROS:1) The size is the biggest - it will fit anywhere.2) Batteries - It takes two AAA (It came with rechargable ones) but in a bind you can get AAA's anywhere.3)  All the features are there (red-eye reduction, index for taken pics, picture effects, etc....)CONS:1)  There is no zoom - if this is going to be your \"first\" digital camera I would consider the somewhat larger but optically more advanced Sony's.2)  2 Megapixels - This is actually good and bad.  2 Megapixs is at the border of a \"good\" picture (IMHO).  On a monitor, they look fine and they can be cropped slightly; but printing large pics or magging up too much gives a pixelly result. On the other hand, my 64 MB card holds over 120 pictures.", "Date": "December 28, 2002"}, {"Title": "Great Buy!!!!", "Author": null, "ReviewID": "R2V4RZX6HBI63S", "Overall": "5.0", "Content": "This camera is amazing. Is so small that I always carry it with me. The quality of the pictures is really good, and is ready to shot pictures just a couple of seconds after openning the lenses.The two things that I did not like about the camera is that it comes with a very small memory card (8 Mb), so you better buy a bigger one. Another thing is that you can't hook it up to the TV.Since I got this camera I've been taking pictures all the time. All my friends are telling that is an awesome camera. Definetly worth buying :)", "Date": "April 15, 2003"}, {"Title": "A Fun Camera to have", "Author": null, "ReviewID": "R2643BTLZPL02W", "Overall": "3.0", "Content": "I bought this camera for my daughter who is 9 yrs old (An expensive present!).. It is more of a fun camera for the quick snap shot which can be downloaded on to your computer by a usb cable.There is no viewing lense just LCD viewer, fits into the palm of your hand, or top pocket . No zoom so not much scope  for enlargement and due to a low pixel only suitable for the standard shot(However Sony Quality). A Quality gimmick not sure if it is a great contender..needs higher pixel or zoom.", "Date": "December 10, 2002"}, {"Title": "50 -50", "Author": "\"sl26494\"", "ReviewID": "R6FQKNTBQT6R4", "Overall": "3.0", "Content": "Sony have done it again - reduced the size and managed to maintain quality to an acceptable level - the camera its' self is a sturdy little number, and simplicity itself to use - the pictures however are not brilliant, unless all variables are good - such as light - used as a 'second' camera, it's worth it's weight in gold - but for good pictures, everytime, spend a little more and get a bigger (Megapixel & size) camera. Want something that is always there and ready to go, this will do you fine - and with a little patience and practice, it WILL produce some great photos - primarily because you always have it on you and it works so fast and so well! Just be aware that it is what it is, and that is an excellent, if expensive, 'snap' camera - think pentax 110 and you won't go far wrong! Despite expectations not being met, I wouldn't trade it for the world - yet?", "Date": "February 11, 2003"}, {"Title": "The Best Digital Camera I've Owned", "Author": "S. Rocher", "ReviewID": "R1GKKDZAJO0WDZ", "Overall": "5.0", "Content": "This camera works like a charm. The CCD pickup is so sensitive that it blows most 2mp cameras out of the water. When you combine the great image quality with the smallest size of any digital camera out there -- you've got a real winner. Buy this now before the price goes up! You'll be satisfied, I promise.", "Date": "December 3, 2002"}, {"Title": "I like it, but regret it too...", "Author": "Masnya Jawul", "ReviewID": "R3MBH6BEGP1IIA", "Overall": "3.0", "Content": "The main reason for having this stuff is its size. You can put in the pocket or just hang it with strap around your neck. If this can make you happy, this stuff is for you. I thought I'm one, but I'm not.I like to shoot without flash, since some cam flash is not hard enough to light, say a room, and it save power. But this tiny cam can not grap available light good enough to have bright pic, so if you are in low light room, that'll what you get. Do not expect it bright since it doesn't have white balance. Man, I didn't notice it.But if you like to flash, this cam will give you good enough pic when you active its fill in flash mode. It's like you shoot it with no flash. This feature may good enough to think we have what we deserve. But not for me.", "Date": "May 3, 2003"}, {"Title": "Sony DSC-U20", "Author": null, "ReviewID": "RK41XC204J8EB", "Overall": "5.0", "Content": "This camera takes Brilliant color Pictures.It work for me very well.But i have two only need one easy to carry around.", "Date": "February 13, 2003"}, {"Title": "Muy buena camara", "Author": "\"huesso\"", "ReviewID": "R1L0LHSOITMLIN", "Overall": "5.0", "Content": "Me gusta mucho esta camara, es muy portatil y toma imagenes de buena calidad", "Date": "January 2, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "2.0 megapixel CCD sensor captures images up to 1,600 x 1,200 pixels for prints up to 8 x 10 inches\nUltracompact body, weighs just 4 ounces\nIncludes 8 MB Memory Stick\nConnects with PCs and Macs via USB port\nPowered by two rechargeable NiMH AAA batteries (included)", "Name": "Sony DSCU20 Cyber-shot 2MP Digital Camera (Silver)+B2", "ImgURL": "http://ecx.images-amazon.com/images/I/412EPPTAJRL._SY300_.jpg", "ProductID": "B00007E8YT"}}