{"Reviews": [{"Title": "Excellent useability, decent photos", "Author": "Mike", "ReviewID": "R149P3KP6PNXH2", "Overall": "4.0", "Content": "I purchased the Olympus Stylus 1200 after playing with it side by side with the Canon SD870IS, and some Casio model.  The Casio didn't quite seem up to snuff, so it came down to the Canon or the Olympus.  In the interest of full disclosure, I have had two prior digital cameras, the Canon s100 and s500.  I loved the s100 and hated the s500.  The s500 was incredibly slow to prepare to take shots and the only easy shooting options were flash on (which meant overexposure in almost any indoor setting) or flash off (which led to underexposure).  That said, I did take note of all the positive Canon reviews when making my decision.  What tipped the scales for me was the user interface.  With the Olympus, I was able to figure out how to switch to various shooting modes (portrait, indoors, ambient low light, etc -- there are a ton of them) without glancing at a manual or asking the sales assistant for help.  With the Canon, I literally couldn't figure out how to get to the shooting modes so I gave the camera to the salesman and it took him a good 5 minutes of fiddling around to find them.In addition to the shooting modes, the Olympus has a sort of \"action tutorial\" mode that allows you to select your lighting situation, and then gives tips for how to get the best photos in your particular conditions.  After the tips, you can then immediately take the picture with the recommended settings.  Pretty cool stuff for the average amateur that doesn't really know or want to manually fiddle with ISO settings.The only reason I am not giving the Olympus 5 stars is because the image quality is only okay.  In side by side tests with my s500 (under conditions that my s500 could handle, mind you), the photos were comparable most of the time, with one or two photos being slightly sharper with the Canon.  That said, the ease of use and the numerous options that are easily accessible make this a solid camera.  Put it this way, its better to have a camera that takes a photo quickly and with the proper exposure (Olympus) than it is to have a camera that misses shots due to delay and overexposes the shot, even if the shot is sharp and clear (Canon).  At least it is for me this go 'round.  If I could buy a camera with Olympus' useability and Canon's lens, I would.  But as far as I know, that camera does not yet exist.", "Date": "January 8, 2008"}, {"Title": "Piece of junk !!!", "Author": "Chris Cooper \"possystems\"", "ReviewID": "R155KAAONO6LMI", "Overall": "1.0", "Content": "I purchase this new release Olympus camera without seeing it in action and before I could read any reviews. What a lesson learned! I have owned several Olympus cameras in the past and was very satisfied with them. I took about 200 pictures with the Stylus 1200 for a test. All were fuzzy to say the least with terrible color balance and contrast. The one positive I did find is it took low light pictures very well. Bottom line is to stay clear until they have worked out the problems with this model.", "Date": "November 29, 2007"}, {"Title": "great camera for the price", "Author": "I. Davis", "ReviewID": "R2TRD9AEL6LR3T", "Overall": "4.0", "Content": "i believe this camera is a very solid piece of equipment for the price. i'm still getting used to the different settings. when i first got the camera i didn't like it, every picture came out kind of blurry. however, once i learned how to tweak some settings, each pic was coming out clear & sharp. those who say the pics are always blurry just haven't fully figured out how to use this camera. olympus has a great product here, especially at this price.", "Date": "February 8, 2008"}, {"Title": "Olympus  Stylus 1200", "Author": "Hoondoon \"Hoondoon\"", "ReviewID": "R1PFKM15IOIYIG", "Overall": "4.0", "Content": "I bought the Olympus Stylus 1200 for several reasons. The most important one was that I already own an Olympus C-500 and I really like the way that it performs. I already had several xD cards and I wanted to stay with Olympus so that I did not have to buy new memory cards. I love the size of the 1200 -- when it is in your pocket you hardly know it is there.It is light weight and really good looking too. I bought this camera from Amazon.com because they had the best price and shipping was free!!!The camera arrived exactly on the day that they said it would!!I read the instruction manual while the battery was charging.  It is really easy to get started with this camera........the camera almost walks you through all of the instructions. Very easy to use!!I love all of the features and the many choices that I have for each shot that I want to take. I really like the built-in panorama mode........you can allow the camera to do all of the work.All of the photos that I have taken so far have turned out great. Very clear and with very good color. To get a 12 megapixel camera for $170 seems amazing to me. Thank you Amazon.com and thank you Olympus.The only negative thing that I have to say about this camera is that it has no optical viewfinder........but most of the new point and shoot cameras that I have looked at are now minus that viewfinder also.", "Date": "April 7, 2008"}, {"Title": "wonderful", "Author": "A. Bailey", "ReviewID": "R2I353X3E5NB5K", "Overall": "5.0", "Content": "Olympus Stylus 1200 12MP Digital Camera with 3x Optical Zoom (Black)  This is a great starter camera.  It has great, easy to use features.  If you want a great out of the box camera, fun and fast to pictures this is the one you want.", "Date": "August 26, 2008"}, {"Title": "I LIKE the Olympus Stylus 1200!!!", "Author": "Nanilisa Pascua \"Music Maven\"", "ReviewID": "RIWVQ7OT1PB75", "Overall": "5.0", "Content": "Until this camera, I have never touched, let alone aim, pointed and shot another digital camera ~ not counting the camera on my cellphone :), but they are all over the place, especially in my music education capacity. I bought it on a whim, thinking my students could show me how to use this. I brought it to a couple of rehearsals and had two separate male digitechie \"experts\" fool with it (I trust them implicitly) and after about an hour of snapping pictures and trying out the different settings, each of them handed the Olympus Stylus 1200 back to me raving about what a cool camera it is!! They told me they liked the \"huge\" screen, and that a baby could use this ~ it was so easy, AND the pictures they did take all turned out great.  Having overcome my fear of handling such an apparatus, technophobe that I am, I slowly learned to trust that I couldn't really do anything wrong with my new camera, and MY pictures came out beautifully, if I may say so myself! So I give high marks to my wonderful easy-to-use Olympus Stylus 1200 12mp digital camera!!", "Date": "April 2, 2008"}, {"Title": "Great little camera", "Author": "suslik1717", "ReviewID": "R305CMQVHQJ22F", "Overall": "5.0", "Content": "So far so good. This is my 4th Olympus camera and it is very user friendly, small and reasonably priced. My only wish is for it to have a larger zoom but this will increase the size of the camera itself. Highly recommend.I suggest you buy an extra battery for long trips/use. I have three but two will be also good.", "Date": "December 16, 2008"}, {"Title": "Excellent choice - great photos right out of the box.", "Author": "pj", "ReviewID": "R92C28YIIKES", "Overall": "5.0", "Content": "The Olympus 1200 camera takes great photos right out of the box and will take spectacular photographs after applying the knowledge found in it's easy to read manual. Even without the manual and using only the easy onboard guide that the camera presents, your photos will be sharp and clear.It's my opinion that those that have posted a negative response to this camera have left their posts  prior to owning the camera for any length of time and learning its easy features.In an earlier review someone stated that even a baby can use it. I won't say a baby can use it, but I know for a fact that a five-year-old was able to take super photos, and we have the prints to prove it.For those that  are not aware, buying a higher mega pixel camera does not increase sharpness, it only means that the prints may be made larger or cropped without losing as much clarity. If you plan to make reprints no larger than 8x10 the very highest you need is a 8MB camera.This camera, at 12MB is mostly being used to make huge poster size prints. We are very happy with the sharpness and overall results of the Olympus 1200.", "Date": "November 11, 2008"}, {"Title": "Wonderful Product", "Author": "A. Brennan", "ReviewID": "R2UQR0V3XZFHZB", "Overall": "5.0", "Content": "This is a high quality product for a great price! It has 20 different shooting functions and the rechargeable battery saves time and money. The picture quality is unbeatable. I highly suggest this product.", "Date": "May 27, 2008"}, {"Title": "great camera", "Author": "Cristina", "ReviewID": "RDSOB0GCSESMO", "Overall": "5.0", "Content": "great camera!i love it!easy to use,great picture quality,great pictures in the darkness and motion.great design.best camera i ever had from olympus", "Date": "December 23, 2007"}, {"Title": "Excellent camera!!", "Author": "Artisit \"Amateur\"", "ReviewID": "R26GFMZYDXTGGY", "Overall": "5.0", "Content": "I got my Olympus Stylus 1200 yesterday and so far it is amazing!It has a bunch of features and settings with in camera guide that helps you to decide what setting to use in each situation.The pictures have excellent resolution. I'm looking forward to use it on the holidays.", "Date": "December 12, 2007"}, {"Title": "Like it love it", "Author": "Cristian T. Bernal \"pro mod\"", "ReviewID": "R1SZWZ7VS865YQ", "Overall": "5.0", "Content": "Some of the greats I enjoyed it was so happy. I recommend this for those on the go and those who travel a lot.", "Date": "November 21, 2013"}, {"Title": "Great camera, although it could have better firmware", "Author": "M. Esparza", "ReviewID": "R25VXUHCKSHO00", "Overall": "4.0", "Content": "I bought this camera when it first came out about two years ago and i love it. It is great, the photos are amazing and it still works like the day i bought it. The only downfall i would say is that it takes sometime to get used to it and it does not have as many features like many new cameras have, like face recognition. The video it great but it cannot replace a video recorder. If you want a camera that takes stunning photos, last long with proper care and don't really need a lot of the features new cameras have, i will say buy it, if not look for a newer model.", "Date": "August 6, 2010"}, {"Title": "Olympus Stylus 1200", "Author": "K. Nelson", "ReviewID": "R2QKVW8NUDTV7J", "Overall": "5.0", "Content": "Great camera!  Used on trip to China...takes great photos.  Snapped photos without looking (at some places) and was able to edit them into great photographs on my computer.  Small but powerful, very convenient to carry during a trip.  Fits in your palm or your pocket.  Best camera I own.", "Date": "June 7, 2009"}, {"Title": "The hypercrystal display won't last!", "Author": "Anthony Rector \"Soy Ateo\"", "ReviewID": "R1ZTRNGEQ48EYW", "Overall": "4.0", "Content": "I am very disapointed with the durability of this product.  The pictures were good...but the display screen went out in less than a year; now I have to buy a new camera.  Avoid digital cameras without a viewfinder.  Update: the company fixed it for free without delay!  That's good customer service.", "Date": "June 3, 2009"}, {"Title": "Fine for casual photography, not a great pinch-hitter for my DSLR", "Author": "Ashley Z.", "ReviewID": "R3T9R4COH3CO3B", "Overall": "4.0", "Content": "The Olympus Stylus 1200 appeared to have everything I'd want in a small package when I didn't want to carry my DSLR gear, but it comes up a little short. I don't think most of my complaints would apply to someone looking for a nice point-and-shoot for family events and casual photography.Cons:- Image quality: The resolution is nice, but it's apparent that the chip is small, so while I have a good bit of file to work with, it's not super quality.- Slow capture and processing: Shooting at the largest photo size is very cumbersome. After taking a photo, my camera requires at least 5-10 seconds to process the frame and save it. It does have a neat feature when you've gone down a couple sizes where it captures frame by frame, so it's possible to not miss the action. However, I prefer to shoot at the highest quality possible.- Autofocus features not intuitive - I am having some issue with the autofocus features. I don't know if it's my stupidity or the camera. The camera tends to focus on the background a lot, but I've overcome that by focusing on my subject, holding down the button slightly, and then composing the photo (very similar to autofocusing with the DSLR).- No manual mode!Pros- Macro feature - Once you get it to focus correctly, it produces some nice macro shots.- Programmed exposures - Selecting the correct program for exposure does yield pretty decent results. Once you get a handle on what each does, it's easy to decide which one will work for any scene (basically, you don't have to be on a beach or in the snow to use the sand/snow exposure program). Nearly makes up for no manual option.- Panorama shots - The camera is a little dumb when it comes to lining up multiple shots in panorama mode, but when it does, the results are pretty neat. The in-camera stitching is well-done if you can line the shot up perfectly. I'd recommend a small tripod if you're a perfectionist.- Weatherproof - I'm not as afraid of getting this camera a little wet or exposing it to sand because of its weatherproofing. The case is very solid. I do use a waterproof camera case for kayaking trips and other occasions where it could get submersed in water.- Camera size/appearance - This camera fits anywhere. Pockets, purses, etc. - it hardly takes up any room. I guess you can take that with a grain of salt, since I normally work with a DSLR. It's a very slick looking camera too; the black facing is glossy, but hides nicks and marks well.Overall, I'd say it's a decent value for the money. I think I could have gotten a comparable camera with a little less resolution for under the price I paid. I would certainly recommend it to someone needing a camera for family trips, birthdays, etc., a versatile exposure program list, and the occasional novel shot (panorama, macro), but not to someone looking for a camera that performs optimally in all modes.", "Date": "June 2, 2009"}, {"Title": "Great item as I thought I'll buy more in the future thanks", "Author": "Hussain Alsalbookh \"needhost blog\"", "ReviewID": "RWTVQ7B3OTJL8", "Overall": "5.0", "Content": "Thanks alot for this item it's realy good .as in the ad.thankssalbokh", "Date": "September 23, 2008"}, {"Title": "great camera!!", "Author": "Allen Parker", "ReviewID": "R3QFV1L7100W9G", "Overall": "5.0", "Content": "this is a great little camera, the only thing i think it needs is to have digital zoom or more of optical range, 3 isn't much, but asides from that, it's great. i would recommend it.", "Date": "August 25, 2008"}, {"Title": "Great value, great product...", "Author": "C. Tibbs \"Onebrick short...\"", "ReviewID": "RS5X9K8O1R20R", "Overall": "5.0", "Content": "I just purchased this camera from J&R; through Amazon. Great service and very satisfiedwith the camera.  High quality photo. Good manual comes with it but it so well designedyou can go through the entire camera features without using the book at all -- that simpleto operate.  I am fixed now for all events -- the Flip Video and the Stylus 1200!!!!!", "Date": "May 16, 2008"}, {"Title": "Olympus digital 1200 camera", "Author": "Linda S. Hagen \"bloomers\"", "ReviewID": "RNDSN19OI0TQ", "Overall": "5.0", "Content": "This is my second Olympus camera.  I have had very good luck with Olympus products.  I would recommend them to anyone.  I am not a proffessional photographer by any means but the camera does what I need it to and I was also looking for lots of megapixels and this one has it.Thank you.", "Date": "May 12, 2008"}, {"Title": "PERFECT!!!", "Author": "Andres S \"Andy\"", "ReviewID": "R3LGM90L9PUYGY", "Overall": "5.0", "Content": "It is just perfect, you can store a lot of great pics and also good videos, if you are thinking in buying this camera, do not hesitate, I just suggest you to buy your XD ASAP.", "Date": "March 30, 2008"}, {"Title": "olympus stylus 1200 12MP digital camera with 3X optical zoom", "Author": "Laurie d'Ault", "ReviewID": "R8P5L94UM7G9P", "Overall": "4.0", "Content": "I can't say myself as this was purchased for some friends in England.  They seem quite pleased with it, however.  I would like to see an additional review box for gifts.  You can't really rate it yourself, but you can pass on others' comments.", "Date": "January 11, 2009"}, {"Title": "ES UNA CAMARA EXCELENTE", "Author": "David Bisono", "ReviewID": "R2CEA9N9E51E1D", "Overall": "5.0", "Content": "CON ESTA CAMARA DE 12 MEGAPIXELES PUEDES TOMAR FOTOS DE ALTA RESOLUCION.  PUEDES VER HASTA LOS POROS DE LA CARA DE LAS PERSONAS.  BUEN DISEÑO.  MUCHAS FUNCIONES. REP.DOM.", "Date": "June 13, 2008"}], "ProductInfo": {"Price": "$399.99", "Features": "12-megapixel CCD image sensor, perfect for poster-size enlargements\n3x optical zoom; Face Detection technology\n2.7-inch HyperCrystal LCD; Bright Capture technology for low-light photos\nAll-weather body with seals and gaskets to protect from rain, snow, or sand\nCaptures images to xD memory card (not included)", "Name": "Olympus Stylus 1200 12MP Digital Camera with 3x Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Dw-Dv728L._SX300_.jpg", "ProductID": "B000UW3E2Y"}}