{"Reviews": [{"Title": "Just perfect!", "Author": "A. Hochberg", "ReviewID": "RGKECOR1KZ643", "Overall": "5.0", "Content": "This camera does everything I need it to. I was looking for:-AA battery capable. I do a lot of hiking/camping and cannot afford to run out of power like my wife's Kodak rechargeable does.-At least 6 MP, this exceeds that with 8, but you can adjust that down if you want.-Large LCD display. This camera has a 2.8\", which is the largest I have seen on a AA battery powered camera.-Movie mode with audio. This is cool in a pinch for self-explanatory reasons. (There was no mention of this feature on Amazon's description, but I tested the camera out at a retail store, and it has it it!)-Compact size. The L15 is only an inch thick. Just perfect.Also, the interface is so user friendly. I can't believe how easy it is to use. The menus are simple to figure out. I never even looked at the manual.The only draw back I can think of is the delay between shots utilizing the flash. I think I wait about 4-5 seconds before I can take another picture. This doesn't really bother me since I use this outdoors during the day.It is simply a perfect point and shoot camera. If you are looking for the features I was, you willl not be disappointed!", "Date": "October 19, 2007"}, {"Title": "Weak effort, not worthy of Nikon name.", "Author": "Bradford Schmidt", "ReviewID": "RTU3JKYZQ63Q", "Overall": "2.0", "Content": "Brief Version:  Frankly, I'm shocked that a camera as poor as this ever made it past the Nikon quality control department.  Perhaps the problems can be resolved with a firmware update and perhaps not (the firmware on my L15 is version 1.0 - there were no updates available on the Nikon site as of this writing). However, I am extremely disappointed with the L15 and am returning it.  A note on the star rating:  had I been able, I would have gone with 2.5 stars, if only for the inclusion of image stabilization at this price.  However, in the context of this being a Nikon, one of the premium camera brands, I felt rounding down to a 2 was fair.  Furthermore, I do hope this is a helpful review - I know that positive reviews have a tendency to be ranked as helpful, but I have tried to give a full and fair picture (pun unintentional but noticed) of this camera.  I tend to think that those users that love this camera would have a coronary from the pleasure of using a camera not hobbled byt the issues that this one suffers from.Verbose Version:My Background:  First of all, I'm relatively tech savvy.  I'm a bit of a gadget and electronics geek and do a fair amount of reading on a range of related topics.  When I get a technology item that does not live up to my expectations, I search the web, review the manual, and look for firmware updates when and where such a search is applicable.  I have also done extensive work in the digital realm, including design and product photography. I mention this simply to help people avoid the mistake I made of assuming many issues detailed with this camera are user-error.  Frankly - much of the time poor reviews are written by people that either have unrealistic expectations or do not understand how to use the product.  That is not the case for this review.My Expectations:  A dependable point and shoot camera that simply works well.  Exposures should be passable, focus should be relatively fast and accurate, shot to shot time should be within the realm of reason.  I own and use a DSLR, so I'm not looking for a camera that I can use for my professional work, nor do I expect it to perform like a such a camera.My Experience:  With the exception of the first item in that list and one or two other things, my experience with the L15 has been extremely poor.  Here's how it lays out:The (relatively) good first:Image Stabilization:  The L15 has optical image stabilization and it actually works well. Yea.Startup Time:  Quite good actually.  I pick it up, turn it on, and it's ready to shoot without waiting too long.  My last Nikon (Coolpix 4600 as I recall) was much worse in this regard and there is nothing worse than a camera that you carry for those spur-of-the-moment shots that takes so long to start up that the moment has passed.  At least this is not true of the L15.Exposures:  Average.  Handles white balance and exposure about as well as any other camera in its class.LCD:  Nice 2.5 inch display, though it washes out pretty badly in sunlight.  Most do though, so that's common.  I'd rate this one worse than average in sunlight.Stop-Action Movies:  Very neat stop-action movie mode to make animated film.  Takes patience, but it's fun.  Unfortunately you can't delete an individual frame so if you make an error your whole film is shot.  (Caveat: this wasn't a huge deal for me, so I might be mistaken about the ability to delete a frame - I was unable to figure it out or find it in the manual and decided to return the camera before investing any time in searching the web for a work-around).  Downside here is the awful focus system that detracts from the fun of filming (see below).Other:  It's small enough to carry easily, and uses AA batteries.  A requirement for me in a point and shoot.Now the bad:Shot to shot time:  this has been written about repeatedly.  The amount of time this camera takes to write photos to the card is ridiculous.  It can range from 3 or 4 seconds to over 5.  This is WITHOUT the flash.  Using the flash, it can climb to over 10.  Absurd.  And the annoying hourglass on the display just rubs it in.  It can take so much time to write shots to a card that it's just pointless to even consider taking a series.  Since there's no optical viewfinder you can't even set up your next shot while you wait.  Completely unacceptable.  Now, you might think it doesn't sound so bad, but believe me: the first time you are waiting around like a dope holding a brick while your shot disappears you'll think differently.Auto Focus:  Slowww[...]  Can take a ridiculously long time to find focus, and often just can't at all.  Grinds away, creeping towards focus, then can't lock. No real rhyme or reason to why it's good or bad in any situation:  the lighting can be great or it be low enough to require the focus assist, it still just WON'T focus sometimes.  And I'm not talking about focusing on something with no contrast or no image information like a flat wall.  I'm talking about a photo of people sitting at a table, taken from a reasonable distance, and it just can't focus.  No manual focus ability means you are just hosed: you have to move around, try different zoom depths and angles until it can find focus.  Seriously the worst auto focus system I have personally used in any digital camera, and I've been shooting digital since 1997 and have owned well over a dozen cams.Flash: Double flashes every time, in any flash mode.  Really weird.... This isn't when it's set to red-eye reduction - it's ALL the time.  Pre-flash followed by flash.  So people look away or blink just in time for the actual photo.  Others have posted on this.Synopsis: The bad far outweighs the good on this camera.  All the things that really matter in a point and shoot fail miserably with the exception of startup time and image stabilization.  Using this camera in real life situations is an exercise in frustration to say the least, and I can't imagine having to keep using it without at some point hurling it into a wall in frustration.I'm returning it and getting the Canon PowerShot A570IS 7.1MP Digital Camera with 4x Optical Image Stabilized Zoom for the same price (as of this writing, $140).  The focus is faster and more accurate, shot to shot is faster, it has image stabilization, and my experience with Canon Powershots has been good thus far.  I'm hopeful I'll have a better experience.  In the same price range I was also considering the Panasonic Lumix DMC-LZ7S 7.2MP Digital Camera with 6x Image Stabilized Zoom (Silver) which has a wonderful 6x optical zoom, but decided on the Canon for reasons I'll outline in another review.If you are dead-set on this cam, I urge you to try it out at a local store before buying it.  If you can't I'd advise looking elsewhere unless you love to be frustrated.Another really well done and documented review is here:[...]", "Date": "January 20, 2008"}, {"Title": "Great pictures, slow shutter.", "Author": "M. Keefer", "ReviewID": "R1HT0B5W5QFOFV", "Overall": "4.0", "Content": "The Good:The camera takes great pictures with vivid true color in many different lighting conditions.  Image stabilizer works great, I've taken many zoom and low light shots with no blur.  In a low light restaraunt, I was able to take clear, sharp and non-noisey pictures with no flash.Camera has many scene selections and settings as well as a simple point and click mode so it can take good pictures in most conditions.The L15 has a larger than normal screen for this type of camera that is very clear and bright.  Very impressive display, have received may comments about it.Video quality is very good for a small digital camera.  Looked smooth and decent even when played back full size on a laptop disply and a TV.The Bad:As others have commented, the shutter speed is slow.  It took me several attempts to get a decent picture of my three year old.  She would blink or move in the period of time between pressing the shutter release and the camera taking the actual picture.  The delay is far less with no flash but it still creates a challenge getting a pictures of kids or capturing quick moments.After taking a flash picture, you'll need to wait a couple/few seconds before taking the next shot.  I didn't find this to be a very big deal, it has never tken more than a few seconds but some may get annoyed with it, as you can read with other reviewers.Overall:I think the L15 is a great bang for buck digital camera.  I purchased it mostly to take pictures on a trip over seas where I will primarily be taking the usual shots of scenary and people standing in front of scenary so the slow shutter is not a big deal for me.  I wanted an inexpensive small digital that took good pictures in various conditions and I'm very satisfied with this camera.", "Date": "December 30, 2007"}, {"Title": "Slow Shutter", "Author": "San Diegan", "ReviewID": "R1WOX9DZ687JXO", "Overall": "3.0", "Content": "Good camera, but it takes a full second from pressing the shutter button to actual shutter action. That's a big problem when taking pictures of children, sports, animals, moving objects ...", "Date": "December 13, 2007"}, {"Title": "Seems to be the best 2 AA powered pocket camera so far", "Author": "lens", "ReviewID": "R1JVAIC2DIYKFU", "Overall": "4.0", "Content": "I was looking for the best 2 AA powered *pocket* camera - Something fairly thin without the handhold bulge of the Nikon p50 or the Canon A570. Price was not that important, but it seems that no one makes a really high end 2 AA powered camera. All of these are pretty cheap (under $150). I already have a Canon S5IS (uses 4 AAs) and did not want a new battery type for my small camera (Sanyo Eneloops work great BTW). I bought the L15 after looking for months.Good: Uses 2 AAs, thin enough, some nice picture modes (like best shot), image stabilization, pretty good image quality (but I am not a pro).Not so good (or at least strange):Autofocus struggles at times, and not always when light is low. I'm not sure why.Flash recycle is slow and entire camera locks during flash cycling - but this is so for all 2xAA powered cameras so I can't fault NIkon for this. It would be nice if someone solved this however.Plastic case (but it *is* only $130)Not necessarily bad, but could be better:Menus are not complex (that's good) but extra button pushes are required that should not be needed. On Canons, pressing the shutter immediately kicks out of any menu and shoots. Nikon requires you to get out of the menu first.Changing a setting like flash, requires you to go to the selection and then hit ENTER. The ENTER is an extra unneeded button push.The flash always seems to do the red eye \"double flash\" no matter what the setting.Wider angle (like 28mm) wide setting would be nice.Summary: This is a pretty good camera but with compromises. Given the limited choices for this type of camera, I'd buy it again, but if Canon made an SD870is that ran from 2 AAs, I'd have bought that. Unfortunately, they don't. Now that that hybrid NiMH batteries don't self-discharge, these are great cheap batteries for digital cameras. I really hope to see some high quality 2 AA compacts soon, but this will tide me over for now.", "Date": "December 28, 2007"}, {"Title": "its great !", "Author": "Mar \"Marinera\"", "ReviewID": "RN3D6Y6K1DKE0", "Overall": "5.0", "Content": "I got this camera for cheap and its nice litlle cameraits slow but it takes nice sharp picturesno red eye no blurr just what i wanted", "Date": "December 15, 2007"}, {"Title": "Nikon L15", "Author": "jerry 43", "ReviewID": "R1FKQA35ENQEQ5", "Overall": "5.0", "Content": "Excellent addition to my Nikon point-and-shoots.  Easier to use than both the Coolpix 4300 and Coolpix 7600.  I'm comfortable with the Nikon operating methods so this one was easy to learn. Battery life and writing speed seems to be greatly improved over the 7600.  I'm very satisfied with the picture quality of all three cameras.  L15 is light-weight and the optional 2GB SD cards ordered through Amazon/Cameta Camera work very well.  Excellent camera and bang-for-the-buck as they say.", "Date": "January 18, 2008"}, {"Title": "Screen broke in normal use", "Author": "PetersonNY", "ReviewID": "R3U7WMSXBBJE0Z", "Overall": "1.0", "Content": "All I want is a camera that I can carry in my suit pocket to take visual \"notes.\"  This camera seems like the perfect solution.I previously owned a Nikon Coolpix L11.  I had it less than four months, carrying in my suit pocket.  One day I found the screen broken, rendering the camera unusable.  I don't recall ever bumping the camera and I certainly never dropped it.Thinking I might be somehow responsible for the broken screen I did not return the broken L11 to Nikon.  Instead I bought a new camera, this time a L15 since I wanted vibration reduction.  I also bought a Nikon case to protect the screen (although the added thickness make the camera less pocketable.)In two weeks the screen on the L15 broke under the same circumstance -- it was in my suit pocket, never bumped (as far as I can recall) and never dropped.  The camera is just too fragile for everyday use.I've carried cell phones and blackberries in my pocket for ten years.  I have never broken any of these devices.  I'm a 59 year old.  I'm careful with my things.  If the #%@^# camera breaks in my pocket, imagine how long it will last for your average teenager.  The L11 and L15 are lemons.", "Date": "January 27, 2008"}, {"Title": "Great little pocket camera", "Author": "Teresa Gregory \"Aserethtor\"", "ReviewID": "R225FF2KK2PQMW", "Overall": "4.0", "Content": "I bought a 4MP Coolpix a few years ago and I really loved it. The pictures were great, it was easy to use, and it was small enough that I carried it in my purse all the time. But after my grandson was born this summer, I realized that with 4MP I couldn't take pictures of him and crop them very much without losing quality. I stumbled onto the 8MP version at Sam's Club, but went online for a better deal, which I got through Amazon.The camera is similar to my old one, but enough different that I'm having to learn how to operate it. The pictures are fabulous. Nikon uses a glass lens which is wonderful. The viewing screen on the back is larger than the old one making it easier to review shots. The thing I was hesitant about was that my old one used a special rechargeable battery. I did not want a camera that used AA batteries because I know those use a lot of them. But Nikon recommends the Energizer Lithium and claims you can get 1,000 pictures on a set of those as opposed to 440 shots with regular AA batteries and 520 with rechargeables.I had read about the delay between pictures. The old camera didn't do that. When I take a picture, an hour glass pops up and I have to wait to take the next shot, so this camera would not be good for rapid fire. The exception is outdoor pictures. I went to NYC to be in Times Square for New Year's Eve and I got some fabulous pictures with the new camera. During the day, on the outdoor setting, there was no delay. I'm very pleased with it but understand that I really need to take an afternoon, sit down with the book, and learn how it works.", "Date": "January 20, 2008"}, {"Title": "Some problems", "Author": "Auntie Annie", "ReviewID": "RXAWK5HTPYNSN", "Overall": "3.0", "Content": "Some of the features of this product are impressive.  The screen is wonderful: easy to view in any light, and large image.  The quality of the photos is wonderful.  The problem I have had is that the camera goes through batteries too quickly.  Each day I use it, it completely drains the batteries (two AA).  I am going to try another battery type (the camera has settings for several types) but AA is what the camera came set for and had included with it.", "Date": "December 30, 2007"}, {"Title": "Excellent Camera for the price!!", "Author": "Kelly Huber", "ReviewID": "R1LPGRVICKVAKC", "Overall": "5.0", "Content": "Got this camera as a Christmas gift and first used on my trip to Florida this spring.  Very easy to use (I never even opened the instruction book) and pictures seem to be of a good quality so far.  Battery life was short with regular batteries, but after buying some rechargable batteries, it has been much better.  Computer program that came with the camera was also very easy to use.  All in all great camera for the price!!", "Date": "April 9, 2008"}, {"Title": "I love it.", "Author": "C. Trentham", "ReviewID": "R18A753P9YRHNW", "Overall": "5.0", "Content": "I had originally bought a Samsung for a martial arts event that I needed good quality pictures for... it froze within 2 hours of buying it so I ran back to the store and was directed to the Coolpix L15.My requirements were to:Take clear non blurry pictures of my daughter posing with her friends and her new belt, I got that.I needed to be able to take action shots while she did her sparring and patterns. I also wanted to get that one perfect picture as her foot or hand went through the board. The Coolpix has the non flash sports feature that I was thrilled to discover. You simply hold down the button and it takes picture after picture of clear crisp action pictures. You can filter out the ones you don't want later.I also needed something that wouldn't die on me in the middle of the event. I was shocked that I did not need the additional batteries even after using the video feature, micro feature, flash numerous times.Last but not least I was very happy to discover that upon returning home I could connect the camera up to my 56 inch television and view the video and pictures in a crystal clear image. I expected some pixelation but got none.The software can be customized to download your pictures then remove them from the card so it saves you that extra step.There are also other options you can choose depending on where you are and what time of day it is. You can choose the night/date feature to allow more clarity to the subject while accenting the background lighting. If you want a panaramic shot, you can take the pictures and on the screen it shows you the cutoff of your last picture so you can line up your next one. There are too many other scene examples built into the camera to mention here.The stabilization lives up to it's name.I would highly recommend this to anyone. I have a 2GB card that allowed me about 600 pictures on the highest quality of the camera possible.A fantastic buy in my personal opinion. If you are taking portrait pictures there is a small lag time between shots but if you need those action shots this is the best camera I've found yet.", "Date": "February 25, 2008"}, {"Title": "Camera not Nikon quality", "Author": "David G. Gray \"Photographer\"", "ReviewID": "R2AMYC1MMSNPC5", "Overall": "1.0", "Content": "I recently purchased the Nikon Coolpix L15 Digital Camera as a Christmas present.  I also own and have always been 100% satisfied with my other Nikon cameras: the F3, N70, N5200 and D70s.  The L15 in my opinion has 3 major faults. First, alkaline battery life is terrible. Nikon claims 160 shots, but actual usage has been far less [30 to 70].  I was able to find Nikon's answer on their website recently and they indicate graphically that the alkaline battery life is probably no better than 2 to 3 hours due to voltage \"falloff\".  Secondly, after a picture is snapped, it takes roughly 5 to 8 seconds for the \"hourglass\" symbol to disappear and ready the camera for the nest shot.  This is unacceptable when trying to take successive shots of any event. I have never experienced this type of delay before. {I am NOT talking of high speed, continuous shooting).  And thirdly, in taking a normal Flash picture [NOT REDEYE], the flash still puts out an initial, DISTRACTING, first flash before the second, picture taking flash...thus preventing one from getting a candid photo.  These 3 problem areas have completely prevented me from getting acceptable candid pictures of any family gatherings and the camera will make a good paperweight for itself.", "Date": "February 8, 2008"}, {"Title": "Amazing camera for the price!", "Author": "E. Sanchez", "ReviewID": "R38FZKCAQZIDAR", "Overall": "4.0", "Content": "Pros: Huge LCD, great price and good image quality, Vibration ReductionCons: When using the red-eye flash,it takes some time untill you can take the next pictureI bought it because the LCD from my former camera, the Nikon L11, crashed, literallyThe price to repair it would be almost the same price of a new camera. So I bought this one.I don't regret my decision, since the L15 is way better than the L11.It has a lot of shooting modes, such as the easy Auto mode, and the scene mode, where you can choose from portrait, close up, backlight, and many others.It has Face detection and is a very intuitive camera.if you're not planning on spend too much money, but want a good camera, that's the one!", "Date": "January 19, 2008"}, {"Title": "Love It", "Author": "CJG", "ReviewID": "R9S6CEA9EX3KI", "Overall": "5.0", "Content": "I love the camera, the clarity is great.  The large viewfinder screen makes taking pictures and viewing pictures great.  Fairly easy to use, I am still figuring out how to use the face verification mode, but for the most part pretty easy.  The package arrived on 12/24 as Amazon promised and was being used that evening. I would recommend this camera and Amazon to anyone!", "Date": "January 17, 2008"}, {"Title": "Great Entry Level Camera", "Author": "S. Cadwalader", "ReviewID": "RJPDC1HXLDWD9", "Overall": "4.0", "Content": "We have purchased 6 Nikon digital cameras over the last 5 years.  We've been pretty happy with all of them so we keep buying Nikon even after looking closely at Cannon and Sony.  We started with a 3 MP and have graduated over the years.  This one is the best so far on picture quality.  It has a nice large screen and is slim and easy to pocket.  We purchased this one to replace a 4 MP Nikon because it was painstakingly slow to recharge between flash pictures and the lag time for click to shutter release was frustrating.  I'm happy to report that this one is far better in both respects.  The only drawback is the lack of a regular viewfinder.  Unfortunately that seems to be the case in all the entry level cameras regardless of brand these days.", "Date": "January 12, 2008"}, {"Title": "Average camera", "Author": "Ada E. Caceres \"Ada\"", "ReviewID": "R1HRDGS0BL9O9R", "Overall": "3.0", "Content": "The camera takes great pictures and awesome videos but don't get it if you're in a hurry to take a photo. Shutter lag is the worst I've seen with any digital camera. I'm pleased with it but that's because I'm an occasional photographer, just wanting to take some memories of trips, not to capture the critical moment of a sporting event or a child's first steps.", "Date": "January 11, 2008"}, {"Title": "An disappointing camera", "Author": "A regular Amazon customer \"Norrie\"", "ReviewID": "R2H756313JVCGV", "Overall": "2.0", "Content": "I got this for my young daughter. After testing it for over a week mainly indoor, I found it's far less intuitive to use than my Canon Sd1000. But more importantly the qualities of the pictures are very poor in general, including color, exposure accuracy, noise and over or under exposure when using flash. I did side by side comparison with the Canon, which came out far superior in every aspect each time. Despite the low price of Nikon, it's better to avoid this product if you just want relatively decent pictures. My 4-year daughter could use the Canon easily by herself, but doesn't like the Nikon at all, despite it's in her favorite color-pink.", "Date": "January 7, 2008"}, {"Title": "Piece of ----.", "Author": "dacactuskid", "ReviewID": "R5GV517878XZ9", "Overall": "1.0", "Content": "After less than a year, it broke. Ended up in the garbage; could not be fixed. Waste of money and a BIG disappointment.", "Date": "December 11, 2013"}, {"Title": "Not a camera worth the probs that go with it.", "Author": "Maurice S. Murphy", "ReviewID": "RTMYO56HR2B85", "Overall": "1.0", "Content": "Nikon Coolpix L-series: OK-ish starter cameras, BUT the USB (not a normal cable config) > PC is iffy depending on PC & install software CD. 75% of web blogs are full of acquire or power drain probs, or both! What works on my Dell LT fails on my HP tower, even good recharge Ni batteries & their (like memory card, not included in pack) recharger won't last as long as U hoped (off the shelf use 'n toss, or rechargers), a 4GB card hold more data than any battery (2-AA's) will ever fill with memories before it runs out of juice. Audio is OK (inside) but wind blows it to noise outside, the video is best in lo-VGA and degrades as you up to MP's. I went thru two L-15's (1 lens froze in out for ever! Returned for refurb w/new s/n) would not use it for much but lo-end say home inventory use. Zoom drags into focus, fuzz to focus to shoot ='s that moving object U wanted to snap, just left the LCD viewer. Never took a shot I did not have to tweak with A/V progs & Nikon driver d/l's R hard to find & Nikon drops off making upgrades a dated to camera gamble. I will prolly get flamed for this review, but I don't know any of my many photo-buff M8's who ain't complaining about some or all of above Coolpix cons, and their photo Arc © prog is a stills basic and a video joke. Pros: they still sell cheap older (2007-8-9) models so if you want a $150+ P&S; compact that is more probs than it's worth, IMHO buy any model but make it a newer more expensive one, the 'L' oldies are an antique & good luck finding a transfer driver that will even work with Win-7. Even the E-Z setting is more of what the camera wants to do, than what you want it to turn out looking like.  I would not buy any model of Coolpix even if they refunded the entire price as an incentive. Caveat Emptor!", "Date": "November 25, 2010"}, {"Title": "Good little camera", "Author": "B. Le", "ReviewID": "R1G591T17YZ6NU", "Overall": "5.0", "Content": "I bought this little camera for my nephew.  He likes it a lot and have been sending me pictures and video since then.", "Date": "January 26, 2009"}, {"Title": "had it for 6 months now", "Author": "Amazon Customer", "ReviewID": "R1BM3EHVH5L01W", "Overall": "4.0", "Content": "The positives- never read the manual and I can operate it to my satisfaction without having done so (though I know there is probably much to learn if I would take a look). It fits in my handbag so I don't have to carry a camera bag around. The negative- Seems to really eat batteries. A lot.ADDITION- While using the camera recently, I experienced an issue where the camera lens would not retract into the the body when I turned off the camera. There is a \"Lens Error\" message on the display and no pictures can be taken. This appears to be a common problem with the CoolPix series. According to the Nikon support website. there isn't anything the user can do about it except try taking the batteries out overnight. That did not work, so it had to go to Nikon for repair. They took care of it at no charge and the process was fairly painless (compared to other warranty service with various companies that I've experienced.)", "Date": "July 18, 2008"}, {"Title": "Worst Digitial Camera", "Author": "A. Parsells", "ReviewID": "R2ECBY82EG943M", "Overall": "2.0", "Content": "I bought this camera a few months ago and I'm already buying a new camera. The shutter takes FOREVER. I've missed so many important pictures due to the slow speed. Also 3 months after I bought the camera the lens wouldn't close. I sent it back to Nikon because it was still under warranty and they said that I must have dropped it or broken it some how (which I never did) and they wouldn't cover it. They charge me $50 to fix it and I wish I would have just told them to keep the camera. I would not recommend this camera to anyone.", "Date": "June 10, 2008"}, {"Title": "Battery eater", "Author": "Mystery man \"semi-satisfied\"", "ReviewID": "R2BJR3ZJR898DC", "Overall": "3.0", "Content": "For the money, there are better cameras out there, like Sony. But my biggest problem is that this camera eats all the power from the batteries so fast, I got 15 pictures on brand new batteries (thats using flash), and there is no way to turn the flash level down, there are some settings you can play with but basically it's on or off.", "Date": "March 17, 2008"}, {"Title": "Get the L12 instead!", "Author": "J. Coradi \"JennyC\"", "ReviewID": "RM4CMNXLM6DNG", "Overall": "2.0", "Content": "Great little pocketable camera that takes AA batteries that you can get anywhere....  BUT here is the problem:I got an L11 and liked it, but realized that for about $30 more, I could have the same body and useability with Vibration Reduction and greater sensitivity, so I upgraded to the L12 and love it.  Then I made the mistake of getting an L15 (with Visa points) for business use, expecting it to be an inmprovement on the other L-series cameras I had used - WRONG!The L-15 has one fatal flaw in useability:  One must turn on the camera - which includes opening up the lens - to review pictures in memory.  The others don't, nor do my two Canons.  Also, the L15 has LOWER sensitivity and the view/review buttons are in a less convenient location to boot.  So what does one get in a model that is farther along in the series?  A 3-inch LCD (the L11 and L12's are plenty large at 2.5 and 2.8 respectively).If you want convenience and good pics for pretty cheap, get the L12!", "Date": "March 12, 2008"}, {"Title": "Decent camera for the price", "Author": "K. Swensen", "ReviewID": "R1UDTU9D5FCWX9", "Overall": "4.0", "Content": "Bought this camera as a Christmas gift for my wife to have for those \"gotta have a picture of that\" moments.  It is a decent camera for the price, and is small enough to carry in a bag or purse, only down side is the image tracking in the view screen is alittle delayed.  But hey, for the price you can't expect perfection.If you need better quality spend alittle more money for the higher end cameras.", "Date": "January 22, 2008"}, {"Title": "Love the Coolpix L15", "Author": "nocturnaltraumarn", "ReviewID": "R1WIBXKM81FGU9", "Overall": "5.0", "Content": "I recently had to update my camera and after lots of research, decided on the Coolpix L15. Not only do I think this is a wonderful camera line, but it's also very easy to use, in all modes! The L15 offers all the latest options in an easy to use format, and at a reasonable price!", "Date": "January 20, 2008"}, {"Title": "Don't waste your time", "Author": "Donald V. Rundberg", "ReviewID": "R10UNFG42EPQZ5", "Overall": "1.0", "Content": "Bought this camera after returning a Canon that didn't perform as expected.  This camera is horrible and was returned after only a few days of use.Pros: Small size, takes AA's, that's about it.Cons: Under any flash mode you get a double flash (my 8 month old closed her eyes when the first one went off so when the picture was taken when the second one went off, we got nothing but pictures of her squinting).  Transfer speed of the image to the SD card was slow, even with Lithium batteries and a high speed SD card (from the time the picture was taken to the time you could take another one was about 5 seconds).  Then to top it off, when slowly panning the camera to take a picture of a walking child, the image on the screen jumps like it was viewed under a strobe light (cool if you live in the '80's, not so cool now).We now own a Fugi F650 and after only a few days, absolutely love it.", "Date": "December 23, 2007"}, {"Title": "Two Thumbs Down!!", "Author": "Not pleased \"Lindsay\"", "ReviewID": "R13IZHUYCV1PRY", "Overall": "1.0", "Content": "We've had a 2.0m Powershot for four yeaars(which we loved) and decided to get something smaller and light weight.  Well, it's definitely smaller and light weight, but if you ever want to take a picture of anything, you better have all day. It takes about 20 seconds between pics.  You sit there and watch this darn hourglass and keep watching and keep watching.  Finally, it's time to take another pic.  Needless to say, if you have kids, this is a terrible item.  We returned it and got the Cannon Powershot SD 750 and it's the coolest camera.  We can't stop playing with it.  Hope this helps.", "Date": "December 19, 2007"}, {"Title": "A Camera for Everyone", "Author": "John R. \"John\"", "ReviewID": "R3DR1TE93E5W6K", "Overall": "5.0", "Content": "Be absolutely astonished by the ease of use, quality and value. This camera will please the new comer and the amateur photographer.With the 4gig SD Card, you have an amazing 1000+ pictures at 3264 X 2448 resolution and 4400+ pictures at 2048 X 1536 resolution.The EN-MH1 Ni-MH battery's (optional) power up to @450 snap shots, depending on flash use.Nikon as a real winner and Amazon has a great price.", "Date": "January 13, 2008"}, {"Title": "Too slow", "Author": "R. Lynn \"New Mommy\"", "ReviewID": "R2PUDRHSRPR1CJ", "Overall": "3.0", "Content": "I have to say I love the photos and it is a very easy camera to learn. But once you take a photo an hour glass shows up that tells you when you can take the next photo.....are you kidding ?? this is ridiculous. Way too long of a wait between photos. I'm taking it back!", "Date": "December 11, 2007"}, {"Title": "What were they thinking?", "Author": "wrangler", "ReviewID": "R3LW61U707238M", "Overall": "1.0", "Content": "I've owned this camera for a month. 'Dud' isn't strong enough to describe it. It eats batteries. Can't pan with it - the image jumps all over the place. Very, VERY slow recycle. The double-flash is much too hot.What could Nikon have been thinking? There are absolutely no positive features to the camera.There are so many good alternatives, I couldn't recommend this camera to anyone -- even if they cut the price to $29 - or $9 for that matter.", "Date": "December 29, 2007"}, {"Title": "BUY THIS ONE !", "Author": "geisha", "ReviewID": "RMTGKAW3RG6W6", "Overall": "5.0", "Content": "GREAT camera. Got this one for my teenage daughter because it has more storage and image stabilization. Works very well - no complaints. It taking AA batteries fantastic!", "Date": "January 12, 2008"}, {"Title": "Worst Digital Camera I have ever owned!", "Author": "Gordon M. Carpenter \"Daddy G\"", "ReviewID": "R2K6HNWEOJHU8J", "Overall": "1.0", "Content": "Worst Digital Camera I have ever owned! Took 5 pictures on a set of batteries that were supplied with the camera then they were dead. Put in a new set and they were dead after 5 more pictures. Pictures were very grainy and color was off. Flash produced to much light making all of the pictures overexposed. This is my 4th digital camera and I expected alot more from it. I am sure it was defective. I returned it. I am going to use my old camera for a little while longer.", "Date": "January 17, 2008"}, {"Title": "Out of Focus", "Author": "J. Stanton \"realist\"", "ReviewID": "R3BN4UBIEGS7OV", "Overall": "1.0", "Content": "Very Disappointed in this camera. It won't focus properly for a wide array of shots, and can't be focused manually. Perhaps mine is simply defective? Feel lucky?", "Date": "January 17, 2008"}], "ProductInfo": {"Price": "$190.00", "Features": "Supplied accessories - Two 1.5V LR6 AA-size alkaline batteries, UC-E6 USB Cable, EG-CP14 Audio Video Cable, AN-CP14 Strap, Dock Insert PV-15, Software Suite CD-ROM\n8.0 effective Megapixels for high-precision image quality for up to 3264 x 2448 pixel resolution (standard) and 3200x1800 (16 - 9 Widescreen)\nOptical 3x Zoom-Nikkor lens (35mm equivalent 38-114mm) / 4x Digital-zoom\nOptical lens shift VR image stabilization minimizes the effect of camera shake\n2.8-inch high-level contrast LCD monitor with anti-reflection coating", "Name": "Nikon Coolpix L15 8MP Digital Camera with 3x Optical Vibration Reduction Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Xdyy2zASL._SX300_.jpg", "ProductID": "B000VKUZDG"}}