{"Reviews": [{"Title": "Sweet Sweet Micro", "Author": "Steven Thornton", "ReviewID": "RUBTJ6DLVH11B", "Overall": "5.0", "Content": "I've been looking for something to replace/augment my giant three-year-old Sony, which I love but is just too big and heavy to cart all over Europe and around town. Plus the shutter lag drives me nuts. I needed something that was shirt-pocket small, fast, but with enough features to be useful for more than the most basic snapshots. Specifically, I wanted a bit of optical zoom. When I travel, I find I'm using the zoom constantly to frame up the shots a little better. Frankly, I don't care about resolution; 2 megapixels is plenty for me, and that's what I'll use my Xt for most of the time.I compared all of the leading contenders (as of July 2003) -- various Canon ELPHs, Casio Exilim, Pentax Optio S, and even the new \"lipstick\" Sony DSC-U30. Everybody loves to rag on Memory Sticks, but if you already have a Sony camera and a Sony laptop and a good supply of big Sticks, they're a plus, not a minus; going with SD or CF was going to cost me a lot extra. But the Sony dropped out early because of the lack of zoom. The others, well, people like to pretend that making a decision like this is science, but it's not. I read everything I could and took a stab at it. Frankly, from what I've seen I would have rated the others just as high because they are all AMAZING. But I chose the Minolta. And I love it.In short: Optio too slow, ELPH too heavy, Casio has no TV-out (and was out of stock in my local shop, or I might very well have bought it instead).One thing I noted to my great relief with all of these, and which is usually stated nowhere on any of the manufacturer's pages even, is that they all have battery chargers that are small and 110-240 volt, which means you can charge batteries in Europe without a bulky converter -- just the right-size plug adapter, which you can get anywhere for almost nothing. So the problem with the battery isn't a problem at all -- buy a second battery and keep them both charged up overnight and you can snap all day with any of these cameras in any country in the world (unless you're camping or something).What sold me on the Xt was the folded prism lens. Less mechanicals is always good with miniature things, and less fragile things poking out of the front is good too. The Minolta's not as small as the Optio (which is the clear frontrunner in the micro-coolness stakes -- that phrase \"fits in an Altoids tin\" is very tempting. But the Minolta STAYS small even when you're shooting, and because it doesn't have to run a motor so much, it takes faster pictures. Which was probably my #2 criteria after size.I haven't had any trouble at all with the small controls; they're extremely well-designed and you can figure out 90% of what it does just by fiddling with it -- I read the manual but I don't have to carry it with me! If anything, and this is a general complaint with all cameras in this range (and others), there's TOO MANY features, most of which can be found in PhotoShop later. \"Digital zoom\" is a con and could be left out, and who really uses the \"sepia\" setting? But the stuff I DO want is all there, within reason (no f stops, but ISO and Exposure Level controls). I do like the many presets in the Casio, but realistically I know I'll never use them. I'm pretty adept in PhotoShop/PaintShopPro. Note that I have horrible eyesight, thick specs, and big stubby fingers and have no trouble. You might want to trim those nails, though; fortunately I don't have any.Picture quality is excellent. I believe it's a little better than the contenders. The flash is very good, better than I expected; in fact it's a little TOO good if you're at the close end of the scale; I'm going to try the \"square of white paper\" trick on it. Is it the best camera on earth? No. But it's better than the other sub-micros.The coolness factor isn't as high as the Pentax, but then how could it be? But it's faster-shooting. And, really, if the Pentax is a \"10\" for coolness, the Minolta is a 9.6. It doesn't fit in a tin, but it's smaller than you can believe, and the engineering is just as amazing (just because you can't see it doesn't mean it's not amazing -- quite the opposite, I'd say). And, of course, I have a friend with an Optio (and another with an ELPH), so you'll understand I had to have a different one! One unanswered question: is it \"DIMM udjge\" (like \"image\") or \"dim AJZH\" (like \"DiMaggio\")? Another one: why does Amazon \"recommend\" batteries that don't work in this camera? Bottom line: it does everything my big camera does and more, and when I put it in my shirt pocket it doesn't even sag. Comes on fast, shoots fast, enough for no-look street candids. Easy to use. Flat-out amazing. What else are you looking for?", "Date": "July 30, 2003"}, {"Title": "the competition has caught up with this camera series", "Author": "jemaerca", "ReviewID": "RRO83I4K4ENUV", "Overall": "3.0", "Content": "the Dimage Xt is the third generation of minolta's X-series ultracompact cameras.  the first X was a hit because it was ahead of its competition.  but that competition has not stood still and today, there are other (better) cameras at the same price point with the same capabilities.pros:- 3MP resolution, 3x optical zoom.- smaller size than the Xi (this camera's predecessor) with dimensions of 3.4 x 2.6 x 0.8 in, weighing in at 4.2oz.- colors are vivid and natural-looking.- automatic white balance performs well.- has spot metering.- AF locks rapidly and decisively in good light.- short shutter lag in good light.- fast startup.- fast shot-to-shot speeds.- ability to record in movie mode until memory card is full.- supports TIFF mode.cons:- above average noise at ISO 400.- frequent underexposures.- some purple fringing.- corners are soft.- some vignetting.- above average barrel distortion.- some redeye occurrence.- no manual controls.- RAW format not supported.- no AF illuminator - this would really help shutter lag when using this camera in low light.- so-so battery life.- 16MB SD card provided is inadequate so add $$ to your budget to buy more memory.- uses proprietary batteries so again, more $$ for a spare.the Xt is a great looking ultracompact camera but the quality of the images you take could be better.  as already mentioned, there's more competition for the dimage X-series these days.  i would recommend the optio s or casio ex-z3 over the dimage Xt.  for even better image quality (in a slightly bigger package), also consider canon's sd100.i hope this helps you with your buying decision.  peace.", "Date": "September 28, 2003"}, {"Title": "Totality", "Author": null, "ReviewID": "R3EIDGUBV71G06", "Overall": "5.0", "Content": "I lost my X and immediately bought the XT. This is my 4th digital camera. I love this camera warts and all. I bought my original Kodak because it took gorgeous photos (still does) but was so clunky and slow I never used it (still don't).I always have the XT with me. I often audio record 90minute lectures and they only use 40mb (but one full battery). Video is great and you can even zoom while you are taking movies and are only limited by memory. I also use it for storing and swapping computer files. The photo quality is good nottops, as many reviewers have noted. However I always have it with me and have taken almost 2k shots in six months.I never approached a thousand photos with any of my other cameras. So I have lots of great photos. Start-up is lightening fast I catch photos I thought I would never get. For those who have said thay have missed shots focus lock can be slow. Set shutter to continuous,  Lock on somthing big. Then let her rip, you will a catch great animation like series. I have a great Casio wire neck chain for it so when in the woods, at exhibitions or at family gatherings I am always catching great shots. Close-ups are great. The battery will take hundreds of shots (I almost never use flash) and charges in just over an hour! Previously a camera was something I only used for special events. Now I use my camera practically everyday! Who would have guessed.", "Date": "December 3, 2003"}, {"Title": "Fantastic Micro !!!", "Author": "JT in ChiTown \"JT\"", "ReviewID": "R22KOCHPIO8UVO", "Overall": "5.0", "Content": "If your looking for a tiny digital for the average \"point and shoot\" person (and let's face it....if your a pro...stick to film and a 35mm) then the XT is your camera.  Here's the breakdown:Pros:Size.....believe what you hear....this camera fits in your shirt pocket, pants, small purse (for you ladies) without weighing or pulling on your pockets.  I carried it in my dress shirt and slacks at New Years and it didn't seem bulky or noticeable to me or my girlfriend !! The buttons are all useable by both men and women....its tiny without feeling ridiculous or too delicate....its got a durable feel to it....very solid without being heavy !! Battery....I was worried about the battery lasting throughout the night but it never let me down.....all night we snapped pix and of course had to look and show them to everyone on the viewer and it never conked out !!!  Tons of features with easy to navigate menus....the ability to take movies and patch them into the tv is a really cool feature !!Cons:The 16MB memory is a joke....do yourself a favor and buy a 256 sd card right away !!!  This will allow you to approximately 6 rolls of pix (comparably speaking)...instead of 5 or 6 pix !!You will have to practice with it to become proficient....but assuming you took my advice on the memory upgrade...this won't be a problem....its your new toy so play with it !!  Practice, practice, practice and you will get good pix.  Snap pictures in all types of lighting.....it doesn't take long.  I practiced at home before going out on New Years and even after several drinks (or maybe because of them...haha) I was able to take tons of great nighttime pix !! Lastly...you'll have to train your subjects to hold their poses a little longer at night...due to the redeye reduction \"spraying\" effect.  Tell them to hold until the second flash !!Tips:1.Practice (can't stress this enough)2.Use the redeye nighttime setting for all night pix....inside or out !!  IT REALLY MAKES A DIFFERENCE !!3.The auto flash mode is great for all other pix4.Set the camera to the FINE setting (just below TIFF)5.Use the highest resolution for all pix6.Save the pix you want to cd or take the memory card to a professional film developer...you could develop your shots at home but the beauty of digital is that you see all the shots you have as you take them.  BE SELECTIVE !!! I've found that with old film type cameras...not every shot was a keeper....even with digital....not every shot you take is worth putting on paper...so be selective then for mere pennys on the dollar you can have a pro develop your more memorable shots !! Don't waste your money on software...put it into the memory uprade!!7. Hold the shutter button down until you hear the \"click\" !! Many folks used to 35mm cameras (namely my girlfriend) seem to want to press the button down half way or press it and let up before the \"click\"....this seems to cause the pix to blur more often !!ENJOY !!!", "Date": "January 2, 2004"}, {"Title": "Xt is Xtraordinary", "Author": "D. Wyman", "ReviewID": "ROPBNKTBAQM1I", "Overall": "4.0", "Content": "First, the bad news: 1) The plastic tab on the handstrap of the XT can stratch the LCD - DON'T use the strap if you are going to keep the camera in a confined space, such as a pocket - the strap will drift over the LCD and the damage will be done. This is clearly a design defect. If you must use a strap, make your own, one without the power to abrade the LCD.  2) The optical viewfinder shows far less than what the camera sees - I understand about 35% of the image is not visible in the optical viewfinder. This problem, however, is much easier to deal with than a scratched LCD.3) Shutter lag - all digicams shutters seem to suffer slow response time. This makes it tough to photograph people or pets on the move - the continuous shooting option on the Xt helps, so does pre-focusing.That said, this camera has just about perfect, at least for my purposes: on-the-go nature and travel photography. There are just enough controls for unusual conditions - exposure compensation, choice of ISO, white balance, etc - but not so many that they get in the way of simply making a quick - or well thought out - photograph. True, manual control of f/stops and shutter speeds and focus is lacking - but there are other cameras out there with this option. Again, exposure compensation, continuous shooting mode, and pre-focusing help.In particular, I like the east of operation - what controls there are can easily be accessed via the few menus, and the dial and/or various buttons that adorn the camera. Recourse to the manual - printed or on-line - was, for me, not necessary. My primary purpose for the camera is to use it on bike rides - but it's also a great camera for hiking, as well as for travel where you don't want to be burdened with a lot of photo gear (and I have way too much photo gear). For use at social gatherings in large, dark rooms, this might not be the camera of choice, because the on-camera flash is not very powerful - but it does work, particularly if people are fairly close to the camera, rather than across the room.This camera cries out for one accessory - an extra battery. And perhaps two extra batteries. Maybe I like to take A LOT of pictures because I'm a part time professional, but if film is no longer an issue and I can shoot all the pictures I want (subject to the amount of memory I have), why should I be limited by a lack of battery power? And trust me, if you make a lot of photographs, you will run out of battery power! (My extra battery fits in my bike's little patch kit.)I've found that there are generic batteries that will work in the camera ... By the same token, I spent a little more money on storage - I have 256 and a 128 memory cards and, with a 3 megapixel camera, this is more than enough for a at least a few day's of normal photography. (I usually bring a laptop with me, whether or not I have a camera, so I can always download pics from my memory cards to make room for more pictures). To sum up: except for the plastic tab on the strap that can scratch the screen, and a viewfinder that shows less than what the camera sees, and the shutter lag (which occurs with all digicams) I'm completely satisfied with the camera.Oh, one more thing - cameras this small are still a novelty - it makes for a great conversation piece/ice breaker when I pull it out of my pocket....", "Date": "August 14, 2003"}, {"Title": "Excellent camera - small, good pictures, zoom, & features", "Author": "Kaushal Sanghavi", "ReviewID": "R24IX4XJGM6Z2X", "Overall": "5.0", "Content": "So small! (its smaller than most cellphones).3.2 megapixels is just great - clear picture; moreover, minolta has some cool technology that helps to correct the picture if needed.Strong enough flash - but in the dark, sometimes, pictures are grainy - needed to change the ISO setting by hand a couple of times. 128 mb sd card definitely recommended. (can take fine quality pictures at a low compression rate = better picture quality!). Love the cool feature of being able to record your own sounds. The LCD is super clear, so when viewing pictures (esp. when showing it to others just after having taken a picture) its really good. The compactness, I cannot emphasize enough. Its smaller than a nokia 3595, and lighter too (with battery). I'm scared that I'll forget it sometimes, & not realize if I have it or not!The internal zoom rocks!!!! and that causes the startup time to be so fast! I barely turn it on, & its on - unlike most other digital cameras.Good, clear pictures. Easy to use - for both video, & pictures. What else do you want?Might not be as good as cannon s400, but almosst as good - definitely in the same league. You cannot make out the difference 99 times of 100.Oh yes, I've used this as webcam to videoconference too, & it works flawlessly. muchh clearer than most webcams out there! (of course, this should not be your sole critereon when buying this camera ;))A con --A couple of times, it gives a picture a blue'ish tinge with some pictures, but never anything that I cant fix in ACD Foto Canvas (good software - free download - go get it, if you have ANY digital camera).I love this camera, and I still have to read through most of the manual!", "Date": "November 5, 2003"}, {"Title": "Great Camera (for the Great Outdoors)", "Author": "Oscar Bonilla", "ReviewID": "R2RPXUQRDJGGS6", "Overall": "4.0", "Content": "If you're looking for a small camera that takes great pictures OUTSIDE, this is it. The mix of reviews this has received is due, in my humble opinion, to the fact that some people have mostly used it outdoors (the high scorers), and some other people have mostly used it indoors (the low scorers). The reason for this discrepancy is that the flash is not that good. If you're shooting indoor, you really need some other source of light for the picture to be of good quality, if you just use the built-in flash, you'll get a decent snaphsot, but nothing to brag about. Everytime I see indoor pictures I get disappointed at the quality (unless I remembered to use other lights) and everytime I see outdoor pictures I'm awed at the clearness and level of detail.", "Date": "January 6, 2004"}, {"Title": "A marvelous way to capture your memories", "Author": "David Kadavy \"Author of 'Design for Hackers'\"", "ReviewID": "RMPRFY45IACLS", "Overall": "4.0", "Content": "After extensively researching the smaller family of digital cameras available on the market, I chose to purchase the Minolta Dimage Xt, and I am very pleased with it so far. About the only other camera I researched that came close was the Casio Exlim, which is somewhat smaller, but did not have optical zoom or any lense protection, both of which this camera has. The camera is small. Smaller than my wallet, and I have a small wallet. I often take it with me when I leave the office for lunch or just go out to dinner with a friend, regardless of whether I plan to take pictures, because this camera is so small, that you can take it anywhere and it won't be a burden.The automatic mode only adjusts the ISO equivalent from 50-160, so it is not useful in low-light situations with the flash off. However, you can manually set the ISO equivalent to 400. This just takes longer than automatic. The video is of fine quality for capturing memories, though with 15 fps, you aren't going to be making any feature films. I can capture 12 MINUTES of video with sound on my 256MB card. This is sufficient for capturing glimpses of your life without lugging around a huge camera.One of the features about this camera that really impressed me was the e-mail feature. With this feature, you can take your pictures at high-res, then by going through the menu system, you can select which pictures you anticipate wanting to e-mail. The camera will then make copies of those pictures in a seperate folder on your card at 640 x 480, a fine resolution for web.One thing I would change about this camera is that whatever setting you have the camera on, lets say you are in a museum so you have the flash off and consequently have the camera set to ISO 400, when you turn the camera off (or if it goes through auto shut-off) and turn it back on, it will default back to automatic ISO with the flash on automatic. This is my biggest complaint about this camera and it wastes alot of time.I also found the menu system on this camera a little difficult to work with at first. When a dialog box for something like deleting pictures comes up, lets say it says \"delete the pictures: 'yes' or 'no'\" the boxes for yes and no are not sufficiently differentiated to communicate which option is actually selected. One is just dark and one is light. To make matters worse, on some features, the default selection will be \"yes,\" while on others, the default feature will be \"no.\" I think they could graphically communicate which one is selected better and prevent alot of inadvertant picture deletion. Maybe a dotted line?If you are looking for the smallest camera with optical zoom and a flash that you can take out with your friends, and it is near now (September 4, 2003). Look no further. This is the camera for you. If you look around more you will be wasting your time. If control is your priority, you may want to look elsewhere.", "Date": "September 5, 2003"}, {"Title": "Awesome tiny digicam!", "Author": null, "ReviewID": "R2CUQEBRXS0MJY", "Overall": "5.0", "Content": "I'm VERY happy with this as my first digicam.  I've had it for a month and it's SO easy to work with.  I hesitated jumping into the digital world but I'm glad I did.  I won't get technical on you. I bought it b/c: previous Minolta user, 3.2 mp w/digital zoom, tiny size, quick start-up time, enough advanced features but doesn't overwhelm me (111 pg manual, easy to read), sleek, no moving parts, did I mention how small it is?!?! I throw it in my purse, diaper bag, pants pocket, fanny pack - it fits in the palm of your hand...the XT goes with me EVERYWHERE!  I immediately bought a wallet-size case for the tight fit, neck strap and a set of clear LCD Protectors (a must!) I take pictures of something everyday and just know to charge the battery regularly, as well as download the pix to my computer regularly so I haven't used the 256 SD memory card I have.  I will eventually by an extra battery & the Minolta belt case. It comes with a basic Photoshop type Dimage Viewer program that fixes any problems I had in taking a photo.  I'm a mom who takes pix of the kids, eBay items, PT business use and this is perfect for this once-loving SLR fan.  You can't beat keeping only the pictures you like & being able to take photos without lugging a bag of stuff around.  I hated taking a whole roll of pictures & discover only 2 pictures are good.  Picture quality is great for this scrapbooking mom; takes photos fast, real shutter time: ??? - the usual lagtime it sounds like most digicams have but other reviewers say it's faster than most, but it's fast enough not to miss what the kids do...so it doesn't bother me.  Besides there's a continuous advance shot mode.  It makes cool sounds (you can choose or record your own) when you push buttons so you know something \"registered.\"  There aren't a lot of buttons to push to get it to do what you want so it's very user-friendly, even the menus.  XT can take color, B&W and sepia-tone photos; recording movie & audio will be something I use one of these days & another reviewer mentioned that you can focus in on a portion of a photo you've taken (i.e. let's you see if someone's smiling or their eyes are closed)  I read a lot of reviews prior to purchase, professional & consumer and almost bought a Sony Cybershot, but this XT's micro size is it's best feature, you'll want to take it everywhere and you REALLY can. I mean, if you're spending the money, you want to be able to use it ALL the time right?  My husband took a great photo of our ceiling fan, it was on medium speed and the XT made it look like a still-shot...ok, not a big deal but it's just a real cool fun camera - you won't be disappointed with this purchase!!!", "Date": "September 18, 2003"}, {"Title": "Best small digital camera", "Author": null, "ReviewID": "RCVWCCP90SNR9", "Overall": "5.0", "Content": "This is the third very small digital camera I have purchased and is by far the very best.  The highest quality picture setting creates files that are far bigger than necessary for even the finest prints.  The color reproduction is as good or better than any film camera I have used.  The camera is extremely small, yet easy to use.  It powers on in 1 second and seems to be able to keep up, no matter how quickly I continue to shoot new pictures.  This had been the major problem with digital cameras and in the past, I would loose many great shots because the battery was still trying to recharge...Definitely buy the camera...", "Date": "July 30, 2003"}, {"Title": "Almost exactly what I wanted", "Author": "Max Jones \"misterplow\"", "ReviewID": "RK2OV896183YP", "Overall": "4.0", "Content": "I'd really give this 4 1/2 stars if I could--it fits all of my digicam needs and I have only a few minor quibbles with it. I bought this as a replacement for a larger, slower digital camera and I have to say that I really love it. It is incredibly light, it fits easily into my jeans pocket (the camera is a tad smaller than a deck of cards, if that helps you picture it), the controls are surprisingly user-friendly (especially considering the size), and the pictures seem to be very good. I do think the flash could be better (it doesn't really fill the picture the way I'd like it to), but that's nothing I can't fix in Photoshop. Other people here have commented on the technical stuff--I'll just say that it's a nice-looking and smoothly-operating machine (the lack of moving parts on the outside is very reassuring) and I recommend it highly if you need an on-the-go camera for snapshots and such. You should definitely buy a bigger SD card for more pictures and movies, and I went ahead and bought an extra battery just to be safe, but I haven't had any major battery-drainage issues yet. This is definitely a good buy if you're looking for a super-small but good-quality digital camera.", "Date": "August 23, 2003"}, {"Title": "Teriffic small digital camera", "Author": null, "ReviewID": "R32BBLBCLYTCQ1", "Overall": "4.0", "Content": "The little Minolta really shines as an \"easy carry\" camera. Picture quality is very, very good at \"fine\" quality (but - see below). Video quality is not good, but the ability is there, and can be useful. Sure, it takes practice to keep your fingers out of the FOV (a problem that happens w/ small 35mm's too) and to use the focus/exposure lock when you've got backlighting, high contrast, or a foreground subject. Low light needs a steady rest because it operates at about 100 film speed equivalent, so if you're used to a 35mm w/ 400 film, you'll be disappointed. And like all small things, the controls are not easy to use if you've got fingers like bratwurst. And, do invest in extra memory cards, the 16 meg card it comes with is much too small.I've been using mine at work for 4 months in the field as a documentation tool, and just got back from the Galapagos where it really got a workout. I also bought the dive-rated case, which produced great results while snorkeling out there (Dimage and dive case: $450. Underwater video of Green Sea Turtle: priceless). Inside the case, it's still coat-pocketable, and protected from rain, sleet, snow, dust, etc.  This is a great compact camera. I like it better than any point 'n shoot, film or digital, that I've used before. But it's still a point 'n shoot. Size matters.", "Date": "March 1, 2004"}, {"Title": "A superb compromise...", "Author": "Daniel Greenspan", "ReviewID": "R1RCAX51VYDL4F", "Overall": "5.0", "Content": "The XT is the first/only camera that matched my four essentials:- Tiny.- 3 Megapixels or more.- Optical zoom.- Minimal shutter lag.The camera is virtually perfect for its role - a shirt-pocket camera that takes pictures good enough to print. It probably will lose some points on technical merit - such as a little vignetting and distortion when shooting test scenes, but none of these are noticeable on a day-to-day basis.With its portability, fast startup, and minimal shutter lag, you'll be taking pictures when no-one else can. It even doubles as a primitive video camera when the need arises.The only significant issue I've come across is with flash photography when red-eye-reduction is disabled (to keep shutter lag low). The camera, it seems, actually flashes twice in very quick sucession - once to gauge exposure, and again to take the picture. I have found that the first flash causes some subjects to blink such that the picture (and second flash) is always taken when their eyes are closed.I'd also like to see the little charger stand made more useful - it should power (not just charge) the camera, and it would be great if the charger stand would be a USB dock rather than having to fiddle with the USB cable each time.", "Date": "July 24, 2003"}, {"Title": "A couple tips & Tricks to make the camera 5 stars", "Author": "Daft Star \"Daft Star\"", "ReviewID": "R830HVQ4XXNDP", "Overall": "4.0", "Content": "Actually, I would give this camera a 5 star rating if it weren't for the pesky ISO 400 setting. (Normally under low light situations, the DimageXt will jump to an ISO400.) Unfortunately, this ISO is super grainy. Yeah, you'll get your pictures ...but if you want little grain in the picture, you should lower the ISO to a max of 200. Also, when taking pictures with this camera, watch out for your left hand finger. Not only can you easily cover a portion of the lens (causing vignetting) but you can easily inadvertently touch the lens and get your grimy oil all over it. OK - so the juicy stuff. Form Factor - 5 starsFunction Factor - 4 stars. (The pictures can be underdeveloped a little too easily) Additionally, a small but consistent number of pictures had a little more red or purple masking than was needed. This is easily fixed in Photoshop through the auto-color or similar functions. Conclusion: I highly recommend this camera. It's a very fun camera, and if you're like me, a camera like this allows you to take pictures in places you wouldn't normally want to bring your SLR. :)", "Date": "July 3, 2003"}, {"Title": "Excellent Design, Big Disappointment", "Author": "Thomas Collins", "ReviewID": "R3DGZG4HK8EDJL", "Overall": "2.0", "Content": "For more than a year, I had planned to buy this beautiful little camera (not the Xt, but it's earlier models).  Minolta kept upgrading and improving it, and finally I bought the Xt.And it lived up to my every expectation;  wonderfully engineered, very small, easy to use, lots of great features.Only one huge problem.  The quality of the pictures is just plain poor.  I am an experieced photographer and regularly use both film and digital cameras. I know how to maximize picture quality in almost any lighting situation.  This camera does not deliver sharp pictures; not even in 4 X 6 prints, and not even under the most straighforward lighting situations. Since it has a much-more-than-adequate 3.2 megapixel sensor, I can only conclude that the innovative optics in the camera are not up to the task.I would rate the picture quality about the same as -- or even lower than -- one would expect from an old Instamatic point-and-shoot.  At this price, the Xt should deliver much higher picture quality than that.I have returned the camera, and ordered a Canon digital elph to replace it.", "Date": "November 16, 2003"}, {"Title": "Digital Grandpa", "Author": null, "ReviewID": "R3LDKEMYMFJSTR", "Overall": "5.0", "Content": "This camera is easier to use than an old Kodak Brownie, but with several generations of electronic improvement. Don't need a bulky camera bag and the assesories that go with it.  Takes great pictures, and lots of them with an additional 256mb sd card.  Well written intruction manual explains all the easy to use functions and great capability of this camera.  I have owned many cameras, Leica, Cannon, a couple of digitals, etc., over my years as an airline pilot. This small but capable Dimage xt drops in any  pocket and when a photo op comes up it is ready and more than able to take a quality picture.  Very pleased.", "Date": "December 4, 2003"}, {"Title": "Not all memory cards work with this camera", "Author": null, "ReviewID": "R2W6GEMR1WW249", "Overall": "4.0", "Content": "I love the camera, but was disappointed to find that the Viking memory card, which was listed as a \"recommended\" accessory for the camera, is not compatible with the camera.  I discovered this after the camera continually \"froze up\" and refused to reset itself.  I actually sent the camera back to the factory to be serviced, but it was sent back with a note saying that the technicians could find nothing wrong with it.  When I called tech support again, an alert tech asked me what type of memory card I was using, and the Viking card was found to be the cause of the problem.  I tried a Sandisk, and it worked perfectly.Be sure to check the memory card compatibility for ANY digital camera before buying one.  There appears to be great variance in what works and what doesn't.", "Date": "January 29, 2004"}, {"Title": "Great little package", "Author": "CHC", "ReviewID": "R3BU6B2W2PCWB", "Overall": "5.0", "Content": "I just bought this camera to take with me to Harley-Davidson's 100year anniversary celebration in Milwaukee.  I already had a Fuji Finepix 4700 digital camera, but wanted something smaller & easier to carry.  I also chose the Dimage Xt because of it's 3X optical internal zoom which works with the Minolta Marine Case (MC-DG200).  I also wanted to take the camera kayaking and underwater.The Dimage Xt appears to have many features which I have yet to use.  I found taking regular snapshots easy.  However, changing settings was not as quick as on my Fuji.  The small built in flash is not the best. Even group shots at night caused the shutter to be too slow and the resulting photos shakey.  But we have to make compromises for the advantages that the size of this camera provides.  Its so easy to slip into a pocket and have with you for those \"non-Kodak moments\".  Quality of daylight photos were very good.Overall, I recommend this camera to anyone who is looking for a pocket-size camera that will take sharp enough pictures for most purposes.  Add the Marine Case if you want to turn it into a nice underwater digital camera that you can take down to 100 feet.  Add an extra battery too.  You'll need it.", "Date": "September 6, 2003"}, {"Title": "The Minolta Dimage...a handy camera", "Author": "\"chrisman382\"", "ReviewID": "R3293Q17UB6WE2", "Overall": "4.0", "Content": "I bought the Dimage about 6 months ago.  For the most part I have been very pleased with its performance.  It is very easy to use....The controls and settings are very self explanatory and doesn't require a computer science degree to figure out.  In fact, I didn't even open up the manual to learn how to use it.  The construction quality is sound and seems to be pretty rugged.  (Yes I have dropped it at least twice and it still works).  The image quality is decent.  On the TIFF mode, you can't beat it, but at other settings...well let me say I have seen better.  I call it my \"snap shot camera\"  I wouldn't use this camera if I were a professional.I choose this camera primarily for its size.  It is awesome!  Put it in your jacket pocket and go.  Its light and small.  (almost too small if you have big hands)  For those of you that remember the Kodak disc cameras...the Dimage is very similar in feel. For the \"on the go\" folks or outdoors types, I highly recommend this camera.  If you are interested in \"professional\" or \"artsy\" photos...this is not the camera for you.  Here are the pros:light, easy, decent quality shots, rugged (and it always seems to be a conversation piece because of its size, if that is impt to you). Battery life...I have taken a number of long weekend trips without difficulty.  The battery does gripe a little when its cold out...but what battery doesn't.Cons:--the viewfinder..useless. Use the LCD--mayber for smaller hands it might be more useful, but the mits I have always block the lens when I bring the camera to my face.--The Flash...works great in low or medium light...not great in very low light situations.  The images come out blurry. If you plan on taking shots in darkness, take a pen light so the camera has something to focus on.--Shutter delay...seems long.  I have had to redo a number of pics because the subjects thought they had waited long enough and walked away mid-shot. The true test would be to ask if I would buy this camera again?  I would!", "Date": "March 21, 2004"}, {"Title": "Good size and price but disappointing picture quality", "Author": "Ben McEachern \"BenMc\"", "ReviewID": "R2GEGHITNGFWZG", "Overall": "2.0", "Content": "I've owned a Fuji F401 for over a year and been very happy with it.  I decided to get another digital camera and picked this one due to it's even smaller size and the fact that the video length is only limited by the size of the memory card.  Also, it uses SD memory, which I prefer due to it being cheap and available in sizes up to 512MB.  I've found that in spite of it's small size I have no trouble operating it.  I am very happy with it's features and quick response time when navigation menus and managing (reviewing, deleting, etc.) photos and videos.  I don't mind the small LCD and I manage not to get my finger in the way of the lens. My only major disappointment is the picture quality.  I find it very challenging to take a nice picture.  I get blurred, dark or poorly colored shots much of the time.  While the Fuji doesn't have the control over Exposure, White Balance, etc. this one has, I could just fire away with it and get pictures that were brighter with better color and in focus more of the time.  Many of the pictures I take are indoors, which seems to be a particular challenge with the Dimage Xt. The video quality is worse than the photo quality in low light situations.  Much worse than my Fuji in the same conditions.Also, althought the startup time is short, there is a long delay between when you push the button and the picture actually takes, at least when using the flash.  This has caused me numerous missed shots of my rapidly moving 2 year old.  Maybe I will learn the best settings for each type of shooting I do and improve the percentage of good photos I take, but I'd prefer not to have to do this.  I will only use this 3.2MP camera as a backup to my 2MP Fuji.", "Date": "November 15, 2003"}, {"Title": "All the right features, but picture quality could be better.", "Author": "Ramon S. \"rls3360\"", "ReviewID": "RI3SQP8JGQJXG", "Overall": "3.0", "Content": "I looked at a lot of digital cameras before I bought this one. I chose the Dimage Xt because it was the only ultracompact under $300 with all the features I wanted.Pros-Ultracompact size. Take it anywhere you go.-SD card. Small, plenty of memory for the money, acts like a hard drive when you connect to a computer.-Quick startup. You won't miss many pictures with this camera.-Docking station gives you the option of charging battery in-camera (my preference) or by itself.-Auto white balance. This feature seems to work very well.-Auto ISO (50-160), ISO 400 selectable.-3X optical zoom. Amazing for a camera this size.-3.2 MP.-Night mode. Works very well as long as you keep the camera still. Almost a necessity with the inadequate flash.-Makes movies and can be used as an audio recorder.-Reasonable price given all the above features.-Controls are easy to use and understand. In minutes, I was more comfortable with this camera than with my 2 year old, 1.3 MP, Olympus D-460.Cons-Picture quality could be better for a 3.2 MP camera. I think it must be the folded lens.-Flash is underpowered and does not cover wide angles. Night mode makes a big difference, but you have to tell the subjects to be still for a couple seconds after the flash.-Autofocus could be quicker. Results in out-of-focus shots if you rush. Take time to compose your shots.-Easy to take a picture of your finger if you use your left hand to hold the camera steady.Overall, I'm quite happy with this camera. The picture quality could be better, but the small size, features, and ease-of-use make up for it. I will probably get a more advanced camera in the future to take better pictures, but I will probably keep this camera to carry around.", "Date": "November 26, 2003"}, {"Title": "Very convenient, a few flaws", "Author": "Alvy Singer \"alvysinger75\"", "ReviewID": "R2QHNYBSD3ZP3R", "Overall": "4.0", "Content": "I love this camera's easy portability: tiny size fits in any pocket, which was my main criterion. I'm not very organized, so any camera that needs its own bag, supplies, etc., is just going to get left at home. This one is currently in my jacket pocket--I take it everywhere, and snap anything I want whenever the idea pops into my head.I'm mostly a snapshot taker, so the quality is fine with me, although I have taken some nice nature pictures that came out very well. Mostly I use it for taking photos to email, which it does just fine, and the occasional video. I like the video feature: it has audio included, and the video can be as long as the memory card can handle (I did upgrade to a 256 MB card right after buying this, as the included 16 MB card is very small--a common problem with digicams). Obviously the picture quality for videos is not razor-sharp--but you can capture some nice baby playtime or surprise parties or whatever. By contrast, I used a friend's Optio for a weekend, and the video feature has a set length limit; a real drawback, in my mind.I also like the four compression options, so you can choose rich detail for artsy landscape shots, or more compressed file sizes for taking huge numbers of snapshots.Problems: As others have noted, the viewfinder shows a smaller frame than what is  actually captured; no big deal to me. My lcd screen did get scratched also, which is a bigger annoyance but not crucial. I do think Minolta should include a fabric drawstring bag or something, just to slip over the camera and prevent this type of scratching.Otherwise I love it. I have taken it skiing, where a bulky camera would not work, and like I said it goes with me everywhere without any special forethought. It's just what I wanted.", "Date": "March 12, 2004"}, {"Title": "Just wonderful!", "Author": "Gayle Mitchell", "ReviewID": "RUDCRZXFKXLGU", "Overall": "5.0", "Content": "A terrific camera and much better than I thought it would be. It does more than my clunky Panasonic which is a great camera but such a bother to carry. The Minolta is very small and light, will fit into your purse or pocket although you want to get a case so you don't scratch it.  I haven't used all the bells and whistles yet, but I can see it's very fast, shots are good quality and the guide book is easy to understand. You will be up and running within minutes of opening the box! You will never miss a shot with this baby! Charge the battery in the camera while on the stand (quickly) or by itself out of the camera (even faster charging). Be sure to get a larger memory card - the 16MB card that comes with the unit will not be enough if you want to use all the features. I must thank the customer review section as I found the comments most helpful in deciding to buy this camera. You will not regret it - especially if you are not a techie. Believe me, no one will ever know. Kudos, Minolta.", "Date": "August 29, 2003"}, {"Title": "Superb Micro Digital camera", "Author": "Remco", "ReviewID": "R23DF1FYM8M9JK", "Overall": "5.0", "Content": "After testing about 45 digital cameras for over 5 weeks I must say that this little beauty comes out best (with the marine case that you can buy as an accessory).It lasted longest (on battery) and preformed best and was one of the smallest (we only tested cameras between 3.0 and 3.5 MPixels).", "Date": "August 7, 2003"}, {"Title": "sleek and practical", "Author": "K. Gonzales", "ReviewID": "R17V7KS7FDJ8I3", "Overall": "5.0", "Content": "i bought this camera as a birthday gift for my fiance in the military.  he will be deploying again soon and i figured it would be smart for me to get him a camera he could use to add to email communication between us.  i bought it at costco for a very reasonable price, and when he opened it we started playing with it right away.it takes very sharp, high quality pictures, the flash works very well, and it is fast.  it offers several ways to share your snapshots: it comes with a cable that can be connected directly to a printer, cables to connect to a TV, a memory card reader to connect to a computer, and a cable to connect the camera directly to the computer as well.  it is compatible with both mac and pc (which is important to me as i use a mac and he uses a pc), and is very practical for it's price.it will record about 30 minutes of audio which is really cool, and will also record short videos (i think we got it to do just under a minute).  it fits comfortably in a pocket and has a quick startup time, so it's pretty much ready when you are.definetly a great buy!  it leaves me jealous!  my toshiba is nice, but the minolta is so much better.the only thing i can think of that would make it better would be if it came with a protective carrying case, but those can of course be purchased extra.", "Date": "September 9, 2003"}, {"Title": "Super compact camera with great user-friendly menus!", "Author": "C. Chan \"clumpymold\"", "ReviewID": "RAS6QRK5T2A8Z", "Overall": "5.0", "Content": "Strengths:  Small size, light weight, user-friendly, videos for full length of memory card, built-in speaker.Weaknesses:  Memory card (secure digital) is more expensive than most others, camera mode selector not easy to move, takes longer than expected to actually take pictures (but quick start up).Comments:  ... Anyway, this camera is GREAT! Compared to my previous camera which I bought about 2 years ago, they have DEFINITELY come a LONG way in digital camera technology. First off, the 3.2 megapixel quality is more than sufficient for everyday photos. This camera is also great for close-ups (up to 15cm). The user menus are super easy to use as well. Love the sound that comes along with it! The camera makes sounds when turned on/off, picture taken, and when a picture is focused. You can even CUSTOM record your own sounds to some of these features! You can also preview the pictures without actually having to switch to preview mode too. That saves a lot of time! The start up time is also amazing. My old camera took forever to take picture after picture. This one is quick. The downfalls are that the memory card is pretty expensive compared to other makes and taking pictures takes a little longer than I had expected. The camera takes a while to focus the image(s). The camera also sometimes hangs when using the USB connection (I have to pull out and put in the battery).The biggest problem I have is moving the camera mode selector (from image shooting, preview, movie/audio mode, and setup).Overall, however, I would HIGHLY recommend this camera!!!", "Date": "July 13, 2003"}, {"Title": "I love mine, but a few warnings...", "Author": "Rebecca Brusch", "ReviewID": "R1QVM4V4AA8V6J", "Overall": "5.0", "Content": "For me, the compact size of the camera was key.  I also liked that all of the zoom was internal, leaving less possibility of problems with focusing and external zoom damage (e.g. getting sand in the camera if you take it to the beach).I found that it stacked up nicely with others in it's price range; however, I would not recommend this camera for a 1st-time-digital-camera owner.  The features and settings are in depth.  The major downfall of this camera, I think, is that with it's compact size it begs to be taken everywhere, but the camera does not come with a case.  My screen is pretty scratched now, and I've had mine for about 6 months.  I'm not rough on it, it just accumulates, and I'm noticing now that it seems to be from the positioning of the plastic part on the wrist strap.  As a precaution I'd also get a case of some sort.", "Date": "June 30, 2004"}, {"Title": "I want to like this camera, but...", "Author": null, "ReviewID": "R3J9C7O10W4I6O", "Overall": "3.0", "Content": "Bought this camera after comparing to other small digitals.  I wanted a camera small enough to take everywhere as I am constantly leaving my others behind and end up with no pictures.  I think the engineering is incredible in this camera.  Unfortunately, even after playing around with all the easy to use options, I cannot get the camera to take consistently good pictures in the situations that I find myself.  I mostly agree with the other reviews that talk about poor picture quality.  It seems to especially have problems with situations with some backlighting, lots of contrast (white shirt with dark jacket), too cold looking pictures when taken with the flash and a few others.  Outdoor quality is much better.  Speed is good but agree that it takes quite a while for first picture when using flash.Not sure what I'm going to do. At this point, probably will try to return the camera because, in the end, if I can't get good pictures easily, what's the point?", "Date": "January 9, 2004"}, {"Title": "The best just got even better!", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "RYEDO3F96BG03", "Overall": "5.0", "Content": "I've been a fan of the Dimage X series since the first Dimage X was released almost 2 years ago. These are just wonderful cameras that take good pictures, sport an ingenius periscope-like optical zoom system, and are totally hip and useful. The Xt is a bit hard to find on the street as it's new. Internally it's pretty much the same specs as the previous model, the Xi, but it's slightly more compact. Is that a big deal? Well, yes, how could you have asked? The smaller, the better! At least that's the belief of these smart nerdy Japanese engineers. If you have big hands I'd recommend a larger Minolta model like the F series, or a Canon or Nikon or Kodak. But if you just want cute take-anywhere cameras, the Xt is PERFECT. The Casio Exilim may have a cooler form factor, but the Exilim doesn't come with optical zoom so is best for very casual photography like when you feel bored on a subway or bus and want to take pictures of city scenes. The Xt has more uses. For one thing, it's just great for travel photography (as long as you don't need 300mm zoom for Safari pictures). With the release of the Xt, Minolta is now a serious contender in the consumer digital camera field and I think they represent a better value than Canon, my previous favorite brand.", "Date": "July 24, 2003"}, {"Title": "Fast and friendly.", "Author": "M. Robins \"Geek of Many Stripes\"", "ReviewID": "R1QJKNR1NNGLJ9", "Overall": "4.0", "Content": "This is a great little camera. Not sure I can say anything that hasn't been said already about it but overall I'm pretty happy with it.I always use the LCD screen as my viewfinder. The normal one leaves out a good deal (around the edges) of what will actually be captured in the image. A larger screen would be nice, but the pan and zoom in the review feature and the ability to remove all the on-screen notifiers help make up for the small screen.The lack of a normal AC adapter is sometimes annoying.I've had problems with blurred images and the flash will sometimes wash my images in blue. I have yet to figure out how to get around these problems.As mentioned in other reviews, this camera is super portable and starts up fast. It has all the features I'd want in a quick on-the-go camera. It's definitely not for more advanced photo shooting but as a handy vacation/amateur camera, it's awesome. The webcam feature produces much better images than most of the crappy webcams out there, too.", "Date": "January 1, 2005"}, {"Title": "Size matters!", "Author": "D. Garcia \"Luna Boricua\"", "ReviewID": "R3F5EZ5TE2KX1F", "Overall": "4.0", "Content": "I have had this camera for a year.  Unlike other digital or SLR cameras, the small size enables you to take it to places you usually wouldn't bother.  It fits in your pocket, even with the camera case (separate purchase).Accesories I found useful: Marine Case, camera case, extra battery, bigger memory card.  A 512Mb card will hold about 6000 photos at medium resolution.  When purchasing the Marine case, be careful, as there are SPECIFIC cases for each dimage model.It does not do well at low-light situations without a tripod.  It takes beautiful low-light photos if you have a tripod though.  We took it with us to Santorini to take photos of the sunset, and worked beautifully with our tripod.  No tripod?  Don't bother trying!  It will turn out blurry, because of the long exposure time.The sepia and b&w; settings are a plus.  Easy to use, but read the manual if you want to get the most out of it.  I just got mine stolen and am looking forward to buying the same one again.  The four stars is because of the low-light situation, but I understand this can be a problem with other cameras as well.It's a great deal through and through!", "Date": "November 12, 2004"}, {"Title": "Fun, fun, fun", "Author": "Chris Lee", "ReviewID": "R3UU7SJPKC3O92", "Overall": "5.0", "Content": "Dimage XT is a competent digital camera and takes good-quality pictures.  I'm not sure about some reviewers' negative comments.  Maybe they work for competition.  You should not take anyone's word but should try out the camera in a store to see it for yourself.  You'll be amazed at its cool-ness and fun-ness and also good picture quality.  I think this is the best ultra compact digital camera.  If your serious about photography you may want to get a Canon or Olympus SLR digitla camera as your main equipment but use this as a fun, capture-teh-moment-kind-of back-up.  Luv ya all.", "Date": "December 28, 2003"}, {"Title": "Awsome camera", "Author": "D. Adams", "ReviewID": "R1CSU8G0PTT6W1", "Overall": "4.0", "Content": "I am still amazed at this camera every time I take it out.  Untill I saw this one, any digital camera's remotly close to this size where VGA or would lack every feature I wanted.  But somehow, they cramed a 3.2MP camera with a 3x zoom in this tiny case.  And it actually works.  Also, unlike other micro camera's(or at least my Fuji A101) you have plenty of menu options for manual settings.Of course, some quality has to be cut for such a small camera, but the pictures are still stunning.  Low light does create some noise in the pictures, but colors are still quite good.  The flash seems to overpower the image at times, but I'm probably just getting too close to the objects...But with any camera, there are some problems.  THough the size is wonderful, it is hard to keep it steady, say if you where going to take a pic without the flash.  It's also easy to get your hands in the way/on the lens.  Another problem I had was it locking up on me once when I was going though a movie I'd recored.  I just had to pop the battery out and back in to correct this.  Speaking of which, this thing usings a special battery.  It's live isn't too great...  Never actually calculated it, but so far I've not had a problem.All in all, definetly a camera to consider.", "Date": "January 4, 2004"}, {"Title": "Real handy but has limitations", "Author": null, "ReviewID": "RFWYX2EN0MN0K", "Overall": "4.0", "Content": "My main camera is an Olympus C-5050.  The convenience of the Xt is hard to beat for casual use or in outdoor walking around snapshots on vacations.  I would have preferred a backup camera with battery and memory card compatibility with my Olympus, i.e., AAs and xds. Observations:Photo sharpness is generally very good but does not match that of my larger camera.Controls are simple and straightforward but people with large hands may experience some difficulty.  Menus are relatively easy to navigate.Date imprint feature is handy and facilitates organization of prints.Indoor, lowlight capability is limited due to flash range but exposure compensation (and Photoshop adjustments) largely overcome this handicap relative to larger-lens (and bigger flash) cameras.  Even in bright outdoors shots, exposure generally needs stepping up.", "Date": "October 18, 2003"}, {"Title": "A tale of woe courtesy of Minolta", "Author": "Joseph F Grcar", "ReviewID": "R1KQ7VJ2ES5IBQ", "Overall": "1.0", "Content": "The Wall Street Journal's gadget column recommended the earlier but quite similar version of this camera (Dimage Xi) so I purchased one from Amazon.com for the Holidays in 2003. The small size is a delight and when the pictures are good they are great and very easy to download to my personal computer (this may be because I have a Macintosh). However, my first extended use of the camera was on a trip to Japan. I discovered that almost anyway you hold the camera to steady it will place a finger in your photo because the rather wide angle lens is recessed into the body and does not pop out during use. I told myself that I would get the hang of it eventually but in the haste of a Kodak moment I always seemed to forgot where my fingers were. About half the pictures from my Japan trip were obscured in this way. Things went downhill from there. The next extended use was during a family outing. I was happily snapping away but now taking my time to frame each shot (remember the finger). About midday the battery died. It turns out that the battery has a rather short life, particularly if you leave the camera on for a few minutes with each picture to play with the zoom and show off your photo. So I lost half a day of family memories. But its gets better. We spent the 2004 Holidays in Europe visiting friends we had not seen for many years. Right in the middle of recording our vacation the camera stopped working. At first I thought it was the battery but a trip to the experts at a big Minolta dealer confirmed that it had died. The dealer said it would take over two weeks to repair in Europe and we were flying back in less than that (and we had none of our purchase receipts and warranty material) so we decided to repair the camera back in the USA. Upon our return I called the number in New Jersey and followed instructions to mail the camera to the repair center. Nothing prepared me for Minolta's idea of customer service. A few weeks later I got a bill for $110 (half the cost of a new unit) to examine the camera with a promise of more costs if something really bad is wrong (more about this later). What about the 1 year warranty? Well, the Minolta customer service people tell me the 1 year only covers the time from date of purchase to receipt of the camera in New Jersey. If you are out of the country when the camera breaks (and not likely carrying the warranty documents to tell you what to do) you are out of luck. Finally, the invoice says Minolta is not responsible for damage due to dust in the camera even if it is under warranty. So I did a little checking around. It turns out that the innards of this camera are not well protected. In fact, I gather that when the lens screen is open just about anything can fall inside and do some real damage. So this is definitely not a camera you want to keep in your pocket even though that is its major selling point. For the record I kept mine in the leather belt case that I bought from Minolta. I cannot recommend this or any Minolta camera because at least one of them has some serious design defects and the manufacturer's warranty service is flawed, to say the least. Bottom line: don't believe what you read in the Wall Street Journal (but my friends who swear by the Washington Post have been telling me this for years).", "Date": "February 11, 2004"}, {"Title": "Nice little camera", "Author": "E Zman \"EddieZ\"", "ReviewID": "R3DUXULS3GPEOK", "Overall": "5.0", "Content": "This camera is small, about the size of a wallet. It's very easy to use, takes very clear pictures, and has many features.  One is its ability to easily take short videos, which can be edited using PC/MAC software Minolta provides.I've had the camera for two weeks and the battery life seems to be fine.This is an excellent camera for beginners.", "Date": "October 25, 2003"}, {"Title": "Convenient, but disappointing pictures", "Author": "W. Weider", "ReviewID": "RVT6333CSPJZ9", "Overall": "3.0", "Content": "This is a great camera in that you can catty it everywhere.  However, I have been VERY disappointed in the image quality.  The review at [...] really bears this out.", "Date": "September 15, 2004"}, {"Title": "Great size, cool factor....cannot make it take good pictures", "Author": "Gaurav Sharma \"Gadget Guru\"", "ReviewID": "R3RX613YSEJN2Y", "Overall": "2.0", "Content": "I recently bought this camera after reading several good reviews and recommendations.  Only after a few shots I realized that the pictures were not as good as I had expected.  In fact the pictures weren't even half as good as my 2.5 year old 2.0 MP kodak DC3400 camera.  At first I thought that maybe I did not understand the camera settings.  But after reading the manual and trying to take pictures in different light conditions and settings, I have realized that it is futile to try to make this camera take better pictures.  The pictures are grainy in poor light conditions.  They are soft even in good light conditions.  The camera is also very sensitive and the pictures often get blurred even with the slightest hand motion.The good seems to be the cool factor (which is why I bought it), and the use of SD cards (which I think is the way to go).  But after having used it for sometime now, I have realized that the poor picture quality of this camera outweighs the cool factor, and this camera will go back to where it came from.  I will probably end up buying the canon S50 instead.", "Date": "February 10, 2004"}, {"Title": "Great camera, very poor battery life", "Author": "C. Kalinski", "ReviewID": "RV3Y13X1E6XIN", "Overall": "4.0", "Content": "I have had my Dimage for about a year now.  I used to use it often with the marine case while I was out kayaking.  The image quality, features, and responsiveness of the camera are outstanding.  However, the battery life on this camera is horrible!  I think I have spent more in batteries then I did for the camera itself.  Even with the flash suppressed and a new, charged battery, 20-30 shoots is all I can get.  As another reviewer mentioned, it seems to be getting worse with age, making me suspect it is something in the camera circuits.", "Date": "September 27, 2005"}, {"Title": "Nice Package, Bad Follow thru", "Author": "W. Marcil", "ReviewID": "R3TEQ0R2YDGYYS", "Overall": "1.0", "Content": "I am a photographer. I know what a camera should do. I own many. I bought the Minolta, because of its size. I wanted something to fit into my pockets basicly for snap shots. I have had this camera for a little over a year. I have had problems since the begining. The lens cover stopped working after about a month with the camera. I sent it in and it was fixed under warrenty promptly. A few weeks later it broke again, this time in the down position. I never bothered getting it fixed since I could still use the camera. Lately the camera turns on but no image will show up and I will not be able to turn it off. I take the battery out and sometimes it will work other times not. Since it is no longer on warrenty I am dealing with the problem and looking for another camera. To put money into fixing a bad camera does not make any sense.  The camera took fine photos, was easy to use, extemly slow lag time taking pictures, and the reliablity is non exsistent. I paid almost $400 and expect the camera to work better then it did. The lens cover is just a bad design. I will bet Minolta is fixing this camera a lot. Any one want a Xt that doesnt work?", "Date": "March 22, 2005"}, {"Title": "It's there", "Author": "JHadji", "ReviewID": "R2MYMFQ2JY97FY", "Overall": "4.0", "Content": "Not bad - this one is all about size.  Negatives - Doesn't have the great zoom, your finger can get in the way easily and a little slow on the take.  Positive - really easy to carry, has all the necessary features of a good camera and nice resolution.  Battery is pretty good, but recommend buying a bigger memory card.  Bottom line - if having a camera there is the key, the positives far outweigh the negatives", "Date": "March 10, 2005"}, {"Title": "Perfect pictures...", "Author": "Nicole", "ReviewID": "R2Y6VSPAV2C0SG", "Overall": "5.0", "Content": "Recently used this camera as my primary camera on a trip abroad.  I was a little hesitant to the quality of pictures, but was plesantly surprised. When I initally downloaded them to my computer I was very impressed with how the images looked.  The colors were so vibrant.  I had many compliments on the quality of my pics on the computer.When I returned home and actually printed some pictures out, I was very impressed with how well the pics looked. My husband even commented that you couldn't tell if they were from my digital or his (more expensive) film camera.", "Date": "October 16, 2004"}, {"Title": "\"its great !!!\"", "Author": "Steven M. Kilingbeck \"skillingbeck\"", "ReviewID": "R2CDTPAIAVIUEX", "Overall": "5.0", "Content": "90% of the complaints about this camera, are based on the fact that the people didn't take the time to read the manual from front to back", "Date": "February 23, 2004"}, {"Title": "Perfect for my situation", "Author": null, "ReviewID": "R2S8G8O8LRURB6", "Overall": "4.0", "Content": "I have two 35 mm. cameras (including a 1967 Canon FT that runs circles around cameras available today), and I still prefer the look of film over digital.  But I wanted a small camera for those walking-around situations where I would be inclined to leave one of the film cameras at home, and/or want to tweak and crop the images myself on the computer.  The XT is a true \"pocket\" camera, and fits the bill for me.  I agree with many of the reviewers about the indoor limitations of this camera, and find that 5x7 is a practical enlargement limit for indoor shots (although I have made a few really good 8x10 indoor prints in situations where the camera and the subject were really steady). I recommend trying the spot-exposure feature of this camera to concentrate on the main subject.  If you are looking for a camera to use all of the time, I would recommend one of the digital Canons.To digress, I don't know why so many (non-artist or hobbyist)people see an advantage in the enormous amount of time consumed by enhancing, tweaking and printing their digital photos out at home.  (One woman proudly showed me how she used Photoshop Elements to turn a background patch of lawn into something resembling psychodelic Astroturf.) I use a retail photofinisher for all of my images, and then choose only the best 5 percent or so of my shots for my own home enhancement and printing.  Incidentally, I have noticed that many newbies destroy the nuances of their original photos by using the one-click \"enhancement\" features of home photo software programs.  You invested all that money -- take a class, people!", "Date": "January 14, 2004"}, {"Title": "SLOOOOOWWWWW", "Author": "Jay Port", "ReviewID": "R19Y6HU78MTCEH", "Overall": "2.0", "Content": "I had high hopes for this little wonder.  After taking hundreds of pictures I finally sold it.  Reason?  Extremely slow shutter response and blurry photos.  Typically 3 seconds to infinity to take the picture.  I say infinity because about 10% of the time I would push the shutter release and nothing would happen.  Not the photographer's fault, I've been an amateur photographer for over 25 years now.  I know how to hold a camera steady, hold my breath and gently push the shutter release button.  Of the pictures it would take, most of them were blurry.  When it would take a good picture, it was VERY good.  But I want most of my pictures to be decent.  This was a backup solution for when lugging my Canon EOS 10D was impractical.  I didn't expect it to take Canon quality pictures but I did want them in focus and less than 3 seconds \"thinking time\" after pushing the shutter release.  It failed in those areas.  It had a major failure recently with a 512 MB SD card.  I don't know if the camera failed or the card, so I won't point fingers.  All I know is that 300 MB into the card I received a \"system error\" message and couldn't take any more pictures.  Again, unacceptable.  Buyer beware.", "Date": "September 4, 2004"}, {"Title": "Nice quality & portability", "Author": "asitshouldbe2 \"pab76021\"", "ReviewID": "R2ZZTFTB4QS1KE", "Overall": "4.0", "Content": "The small size of the camera makes it ideal for sticking it in a shirt pocket or jacket pocket.  Quality at 3.2 megapixel is as good as any.  Realistically, needs a larger sd card than the 16 mb that comes with it.  The weak point appears to be the lense cover that is suppose to drop down to open when you turn the camera on.  It stuck one time where I had to push it down and it sometimes does not fully drop down until you shake it down. It ALWAYS closes properly. A minor problem since you see the lens cover's edge when looking through the view finder if it has not dropped completely down, so you can make sure it is down before you take the picture.  Overall, based on utility, durability, and ease of use, it is a very good digital camera.", "Date": "February 27, 2004"}, {"Title": "Cannot ask for more!", "Author": null, "ReviewID": "R16Q627GU1H341", "Overall": "5.0", "Content": "Unless you are going pro, not looking for a point-and-shoot one, you will not go wrong with this camera.  Minolta makes wonderful lenses and the most space efficient zoom.  I find the picture quality very impressive for almost no (color, shape, contrast, etc.) distortions closer to the edges, even when zoomed in (which is always the case for many point-and-shoot cameras).Minolta finally perfected it after Dimage X and Xi.  Minor annoying problems such as battery charging method and power management have been fixed.Other reviewers have said it all.  In short, to find a camera with comparable quality and size, you have to go for Canon Elph (which is slightly bigger and heavier) with almost twice the price.", "Date": "February 6, 2004"}, {"Title": "Bought many years ago.", "Author": "gtbhawaii", "ReviewID": "RWQ24ZHTOC4LL", "Overall": "4.0", "Content": "I bought this way back in 1999; the first one arrived without some accessories, and didn't function right - Amazon & the seller took it back and sent me another one - and it still does a real nice job today - for what I want.It's small enough to fit into a pocket, which was my main concern.  I used to own a Minolta (film) camera, and loved it, so I was happy to find a small digital Minolta camera.I wouldn't buy another one, because they've come a long way in digital cameras since then, however, I'm sure I'll consider Minolta on my next camera update.", "Date": "July 3, 2012"}, {"Title": "Lens door stays open... apparently a common fault", "Author": "Amazon Customer \"TampaSailor\"", "ReviewID": "R3HPCYLN27799C", "Overall": "5.0", "Content": "I recommended this camera to several friends who went out and bought one. In one case the camera batteries went dead too soon and also the lens cover would not close. I think it is trying to close and this is what causes the battery to die early. He sent it to a dealer in Montreal who charged 110 to repair and its still the same. I have seen another on this forum with the same problem and noted one on ebay that wont close the lens cover. It's a motorized sliding door. I found another user with the same problem and have seen bad words said about Minolta customer support. I am looking for another camera and you will find mine on ebay!", "Date": "March 13, 2006"}, {"Title": "Nice Camera", "Author": "D. Georgeff \"camera lover\"", "ReviewID": "R3VFA5P7XRLGSX", "Overall": "4.0", "Content": "I have had this camera for over a year and for the most part I am happy with it.- The size is great- It turns on and off very quickly- Easy to useThe only things that I don't like about the camera is its flash and the lag time when you push the button to take the picture.I really wanted a camera that takes pictures right when you push the button but it takes it a second sometimes.Over all I love this camera and would recommend it.", "Date": "November 26, 2005"}, {"Title": "Nice little digital camera", "Author": "C. Smith", "ReviewID": "R1HRNZMNY9ZQOL", "Overall": "4.0", "Content": "Having investigated online for a while, I choose this camera and have been very happy with it.  It came with a 128 MB memory card which is more than enough for the number of pictures I'll ever take over the course of a weeklong vacation.  It also came with a spare battery that seems to be the only limiting factor in the camera's use.  I've used it to take numerous one-handed shots while riding a motorcycle - that's what I like about its size and definitive \"click\".It's quick to startup and downloads fairly quickly onto my computer.  I especially like the ability to crop and title pictures before printing.  And with the new stuff coming out all the time, the price of this unit - new or used - has really come down.  I even found the 128MB card on sale recently for $18!Overall, it's a nice little camera.", "Date": "May 5, 2005"}, {"Title": "Super value", "Author": "Kari S. Campos \"Kari Silva Photography\"", "ReviewID": "R25XT1QPM0JS3Y", "Overall": "5.0", "Content": "I bought this (my 5th or 6th) digital camera based on size as the leading criteria.  I have children and we travel a lot and I wanted something that could live in my purse and be accessible at all times.  I have it with this amazing camera!  I take hundreds of pictures, then keep the ones that I like - something you cannot do with a film camera.  I have used digital cameras exclusively for almost 6 years now, and this one has great picture quality indoors, outdoors, at the beach, in the shadows, everywhere.  I recently purchased the marine case for this camera to be able to use it underwater in the pool and at the beach.  My children (5 & 7) can both take excellent pictures with this camera, proving how easy it is to operate.  It took a little adjustment to holding the camera so that my fingers were not in the way, but after a couple of minutes, it was natural to hold the bottom corner instead.", "Date": "April 21, 2005"}, {"Title": "I love this camera!", "Author": "Cathy D. Bryan \"On the Move\"", "ReviewID": "R2XJYMT3IUY5ED", "Overall": "5.0", "Content": "We bought a Dimage Xi for my 65 year old mom 2 years ago, and she has taken it with her to the Amazon, Macchu Pichu, and Disney World.  The pics are fabulous and she can carry it in her purse or jeans pocket.  She's not very technical but she loves her camera.I bought my Xt this Christmas and it fits in my wallet-style purse so I always have it with me!  It's easy to use, has a fast start-up so I don't miss pictures, and even my 6 year-old can use it.  The buttons have a low profile so it never turns on accidently in my purse, and I don't need a camera case...one less thing to carry.  I have lent the camera to friends and it takes 2 minutes to show them everything they need to use it.  It's perfect for our family's life style.  I even carried it with me during the Disney Marathon this year.  Mickey rocks and I've got the pictures to prove it!", "Date": "March 12, 2005"}, {"Title": "best first digital camera", "Author": "Angel Yamada \"amateur photographer\"", "ReviewID": "R14ZQ7W7WV201S", "Overall": "4.0", "Content": "I was very comfortable with my reflex 35mm film camera (Minolta 7000) and did not feel the urge to get a digital camera until now: entry level had poor quality image and the better were too expensive. The Minolta Dimage Xt changed my mind. It is easy to carry and takes good pictures. Only one con: The time between you press the shutter and the moment that the camera actually takes the photograph is not \"instant\", so many times I found that the picture I got was not exactly what I supposed to be taking. Now, after getting the idea, I am thinking for an upgrade.", "Date": "December 26, 2004"}, {"Title": "Manhattenite review has Wrong Info", "Author": "PopPop \"PopPop\"", "ReviewID": "RW5NFX5SHFAHD", "Overall": "5.0", "Content": "First of all, I love my XT.  I wear it in my shirt pocket everyday at work.  I can whip it out and take a picture in literally seconds.  It has been said by a reviewer that it has \"no self-timing mode. Nor is there a tripod mount.\"Well, that isn't right because I use both features.  The tripod mount is on the bottom.  The self timer is a menu function.The XT can been recharged by using the little stand that comes with it.  The newer XG model has no such feature.  Sad that they would take away such a nice ability to recharge by simply placing it back on the stand.  That's why it was $100 cheaper, I guess.The only fault I can find is common sense... it has a little battery and a little flash.  Don't try to illuminate an entire room full of people with it.  Best used for close \"fill in\" flash.  Still 5 stars in every respect.", "Date": "August 18, 2004"}, {"Title": "Not Bad, But Not Perfect", "Author": "Manhattanite", "ReviewID": "R11TFWYWPA2N73", "Overall": "3.0", "Content": "The compact format is great and the optics are above average.  However, unlike virtually every other digital camera I've used, there is no self-timing mode.  Nor is there a tripod mount.  Worst of all, the shutter lag is very long.", "Date": "July 24, 2004"}, {"Title": "Great Camera, Easy to use!", "Author": null, "ReviewID": "R2IW6QIDF3PEYA", "Overall": "4.0", "Content": "Well, I know nothing about techology and I don't want to spend too much time on figuring out how to use a camera.  This camera is perfect for me! I love it! I brought it for 2 months now, I am still loving it! The ONLY problem I had was the memory card that came with it.. it didn't work.  I thought it was the camera problem, I was going to return the whole thing, but I brought another memory just to see if it was the camera problem or the card.. Thank god it was the card, not the camera.  Besides that, everything else went well, nothing to complain about this camera, this is one good deal.", "Date": "June 29, 2004"}, {"Title": "Very Poor Picutre Quality", "Author": "Gus Jewell", "ReviewID": "R3NJGRC14DVUOV", "Overall": "2.0", "Content": "I recently recieved the Minolta Dimage Xt as a present.  Immeditately I was intrigured by the small design and groundbreaking internal optical zoom.  After several pictures, I soon realized the the shape of the camera did not make up for the poor picture quality.  All of the pictures appear grainy and under lighted.  The flash is not effective even with close objects.  The result is a dark, grainy, [...] picture. [...]  Compared to all Canon cameras the Minolta Dimage Xt produces terrible images.  My brother owns a Canon S200 and we took identical shots his appeared bright and rich with color.  Mine was grainy, dark, and lacking depth or color to the face of the person.  I have replaced my Dimage Xt with a Canon SD 100 which is great.  I am completely satisfied.  Canon cameras seem to produce great pictures.  I would highly recommend buying one instead.", "Date": "January 6, 2004"}, {"Title": "Camera is slick, but picture quality bites", "Author": "\"crosswater\"", "ReviewID": "RS5482XORV64F", "Overall": "1.0", "Content": "We had high hopes for this camera, but it only took a few pictures to convince us that the picture quality just isn't up to other brands i.e. Olympus, Sony, etc.The size and features are great, but photographs taken at night using the flash are reminiscent of old Polaroid photos. Purple-ish, uneven, lacking detail. We haven't taken any daytime outdoor color photos with it yet - but hey, why bother - there are just too many cameras out there that do an excellent job, so this one is going back! I'll put it this way - on a scale of 1 to 10 in this price range, the Sony Cybershot at $199 is a 9, just about any Olympus is a 9.5, and this camera rates about a 1.", "Date": "October 23, 2003"}, {"Title": "Best of the Best for 3MP", "Author": "Trevor \"Tjash\"", "ReviewID": "R1M33LASLUP46D", "Overall": "4.0", "Content": "Lately I have been buying Digital Cameras, Using them for a while then selling them. I have used the HP Photosmart 435 - It was worth the 129.00 but lacked alot, Sony DSC-P32 - Took awesome pictures and had a few extra features, Concord Eye-Q 3040 - Good camera in general but horriable software included camera was really confusing but then again it was only 100.00 new. This camera was the best of all them. It took better pictures then my Concord 3040 Did and it was 4MP. It had tons of features but lacked a few manual features. The size was awesome I could take it anywhere. I just sold it and am expecting a HP Photosmart 935. Review should be up soon on that. But I loved this camera, it had tons of features and was really small. The software was really crappy though being it didn't do a thing. But the camera was awesome!", "Date": "September 4, 2004"}, {"Title": "Sooooo goooood", "Author": "A. Peek", "ReviewID": "R3ABS3D7Q4T6E0", "Overall": "5.0", "Content": "buy it, just buy it.  i could not have been more pleased with the preformace of this little camera (it really is small).  There are sooo many features that i can't even begin to go thourgh them all, just read the editorial above (the official one) it gets most of them.  my favorite however, is the zoom function which allows you to zoom in on areas of images you have already taken.  very cool.  i had the comprable sony model (~3 MP) and i like this one better by far.my one word of advice, buy a 256MB lexar SECURE DIGITAL card! (i found one on amazon.com for about $$$!!)  make sure you get SD and not MMC, as the camera was designed to use SD and will record more quickly to this media.  I love it, you will too.", "Date": "September 5, 2003"}, {"Title": "Terribly unreliable camera.", "Author": "Andrea McKenna", "ReviewID": "RB63O3Y2THEMG", "Overall": "1.0", "Content": "This is my second Minolta Camera and both have broken within 1 year  of use.  The pictures it took while it was working were nice, but it did not work for very long.  This camera is completely unreliable and I will never buy from Minolta again.", "Date": "May 1, 2006"}, {"Title": "Disappointed with the Dimage XT Digital Camera", "Author": "Donald Rozenberg", "ReviewID": "R342XZA2QN9XNE", "Overall": "2.0", "Content": "I have had the camera for about two months and I find that it has three big faults.  Wush I hadn't bought it.1. The viewfinder is nearly useless since it does not show the anywhere near the full area of the actual picture taken. So when it is too bright or inconvient to use the display on the back of the camera, framing the subject is guesswork; I nearly always end up cropping the image.2. The automatic exposure for flash is at least one f-stop too little, but OK for non flash exposures. So when taking flash pictures I have to keep going into the custom1 menu to set the exposure compensation to +1.0.  I often forget to set or reset that setting, so I have a lot of badly exposed pictures.3. The little wrist strap that they stongly advise one to use has  a plastic fastener which scratches the display window, with the result that I was unable to return the camera to Amazon as I wished. Should have bnever used it!The small size and the fast action are delightful.  I will continue to use the camera but experence frustration every time I get a bad exposure or have too crop a third of the picture area away.", "Date": "February 22, 2004"}, {"Title": "my mini xt", "Author": "H. Bowman \"Mailman\"", "ReviewID": "R1IMOQWKR4UYEH", "Overall": "5.0", "Content": "Great little camera!Manuel was pretty easy to understand.Boomers may need time to understand.Yes I'm a boomer!Get the casual case and there is a sakar battery for $18.00 that you can pre-order.Get the screen protector(for sure)Software took time for me to understand(Boomer)Oh Yes!I paid for overnight but it was sent Reg...Watch out for that!", "Date": "October 13, 2003"}, {"Title": "Good camera but there are better options!", "Author": "superman2k3 \"superman2k3\"", "ReviewID": "R3EE8APCKOPQCH", "Overall": "3.0", "Content": "Xt is superb pocket camera with 3MP and 3x zoom, prefect for snapshots. Its got Video out port to show pics on TV and also has a very solid build quality. Xt is a good camera with one fatal flaw. It uses propreitary Li-Ion battery. A new model (Dimage X20) is now available with AA batteries and same size.Ofcourse if you want the best picture quality in a pocket sized camera Canon Elph is the way to go.", "Date": "July 17, 2003"}, {"Title": "Minolta XT", "Author": null, "ReviewID": "R266XNEFT41SMT", "Overall": "2.0", "Content": "I was disappointed with the image quality.  My aunt's 1.2 mp camera took sharper pictures.  I would probably never have noticed if I didn't have that comparison.  I hope I'm just doing something wrong.  The size is nice but not a good trade-off for picture quality.", "Date": "October 24, 2003"}, {"Title": "The Best of The Best and Practical Too", "Author": "Andrew Griffith", "ReviewID": "RYHRUS7H06N1V", "Overall": "5.0", "Content": "I have owned two four meg cameras,Minolta F100,Olympus early four meg.The F100 was a great camera in all its features including simple double A-A recharable batteries that lasted easily using a 128 stick. The Olympus was great except it used batteries like a Texas Oil well,Thats why I bought the F100. Then Came along the Sony two meg DSCU20 my # 3 camera. The U20 is the best small camera I have yet to use in it's basic functions are very practical for point and shoot. Why because it has a fixed lense that allows instant start up for quick pictures that I have made very good 8 X 10 blow-ups on shots that had good framing on the exposure. The 8 meg stick would hold 14-15 picture that averaged 650 KB. I then reviewed my pictures from the four meg cameras and those were 960 to 1.3 KBand later realized that usig my new Minolta XT 3.2 meg camera by setting the image siz to 2048 X1536 and then the quality to TIFF my pictures were much biger in pixel size, 9.2 meg's.The problem was it took ten times longer to shoot and internally record each picture ( about 60 sec) then I moved one step down in pixal size (1600 X 1200) and fine setting on quality and my picture exposures was much quicker and produced about a 900 kb size picture and decided that I would only use the max setting for pictures that I had to have the max pixal size. In short you will realy be impressed with the lowest setting and still have the option from 640 X 480, 1280 X 960, 1600 X 1200, 2048 X 1536 image size along with quality setting's: TIFF, Fine, Standard, Economy. Using the max setting you will fill a 128 meg stick with about 15 picures and much more as you reduce the pixal size of each picture using the above combination that fits your actual needs. I am now with the opinion that a four meg camera is not the best way to record pictures when with some field work you will find that a 3.2 meg ( Minolta XT) is an outstanding developement for range of quality pictures. I still have my Sony U20 because it is a quality built; simple wide angle camera for those quick shots sized perfectly (640 kb) for Email.", "Date": "June 19, 2003"}, {"Title": "X20 is a scaled down version of Xt", "Author": null, "ReviewID": "R2SB50E86EGIZP", "Overall": "4.0", "Content": "This is to Superman2K3.I am not an owner of this product, but let me comment Mon this.While X20 should be a good staff, but it is essenially a scaled down version of Xt.It is 2 Mega Pixel instead of 3 of XT.It is slightly thicker than Xt, because of battery.The prism is replaced with mirror, which is cheaper.CCD is smaller.I am wondering which one to buy, because X20 has USB 2.0, and also as Superman2K3, battery operation is handy.Biggest drawdown would be it has only 2mega pixel and smaller CCD. I might wait 6 months.", "Date": "July 19, 2003"}, {"Title": "Complete satisfaction!", "Author": null, "ReviewID": "R39BSEZ38UQXHH", "Overall": "5.0", "Content": "The product was delivered on time, in new condition with all accessories as stated. The price was within $5 of the lowest.", "Date": "October 31, 2003"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.2-megapixel sensor captures enough detail to create photo-quality 8 x 10 prints and medium-quality prints up to 11 x 14\nNew design is smaller in size and lighter in weight than Dimage Xi\nExclusive folded 3x optical zoom system with 4x digital zoom (for 12x total); movie mode (320 x 240) with sound\nIncludes 16 MB Secure Digital card; also compatible with MMC cards\nPowered by rechargeable lithium-ion battery  (NP-200, included); connects to PCs and Macs via USB 1.1", "Name": "Remanufactured Minolta Dimage Xt 3.2 MP Digital Camera w/ 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51Y6SAWEV2L._SY300_.jpg", "ProductID": "B00008PVXA"}}