{"Reviews": [{"Title": "I've retired my F5", "Author": "J. Odell \"Nature Photographer\"", "ReviewID": "RQN0QTU2BJGE5", "Overall": "5.0", "Content": "I've been waiting for a long time to finally switch to digital.  For the last four years, I've shot 35mm transparencies and scanned them with a film scanner.  For me, switching to a digital SLR (and justifying the expense of these cameras) meant getting all the functionality and performance I came to expect with my F5 and images that I could easily print at 13x19 without any (or much) interpolation.The D2X does all of this, and continues to blow me away each time I use it.  Here's my general highlights of what I find important;1) Build quality and ergonomics are outstanding.  The viewfinder image is bright and I can manually focus my lenses in most situations if I want to.  I don't have huge hands, so some of the controls require a little stretch, but nothing that is too difficult to manage.2) The 3D Matrix II meter is AWESOME.  I get great exposures, even better than my F5.  In addition, the Auto whitebalance is excellent.  It is possible to fool it, but it gets the situation right 95% of the time, especially outdoors.3) Autofocus is incredible.  The 11-point AF system gives me MUCH better frame coverage than I had with the F5.  It's also more sensitive and faster to aquire focus, even in low-light situations.  Although there are reports out there about focusing issues with the D2X, my camera does not have any problems.  What I HAVE discovered, however, is that it's REALLY EASY for the camera to lock-on to an object that is slightly offset from where the focus indicator is.  This is partly due to operator error-- you have to be really careful with your technique, and the fact that the actual AF sensors are MUCH larger than the little reticles in the viewfinder.  At least I can check my image on the LCD to see if I need to redo it.4) The LCD and camera menus are great.  More custom settings than anyone could imagine, but they are easily navigated and you can group them in banks.  The camera also has the nice ability to recall the last several functions you modified, so it's easy to get back to where you were if you change something.5) Battery life is excellent.  The Li-ion battery is small and light, and I routinely get about 700-900 images in one charge.  WAY better than my F5!6) Image quality.  Nothing short of outstanding.  This camera can out-resolve some of my lesser lenses.  I REALLY can see the difference between hand-held and tripod-mounted shots if I'm not careful.  I have as much resolution as I could possibly need.  NOISE:  I don't have any problems using the D2X all the way up to ISO 800.  In fact, compared to ISO 400 slide film, there is less noise with the D2X at HI-1 (ISO 1600) than film grain at comparable ISOs.  At ISO 640 or less, there really isn't any noise issues at all.  Anyone who says otherwise is either reading too many test results or pixel-peeping.  Images viewed at a normal distance look FANTASTIC.In summary, the D2X is a total replacement IMO for slide film.  It may even compete with medium-format in terms of resolution.  This camera is a tool for professionals, and it will DEFINITELY expose any flaws in your technique or lenses.  That being said, I gotta go work on my technique some more!", "Date": "June 10, 2005"}, {"Title": "Awesome, but Demanding", "Author": "Ansel WannaBe \"Nature lover\"", "ReviewID": "R1GS1BP4NGPK2Z", "Overall": "5.0", "Content": "All of the great things you see in the other reviews are true.  This is a fabulous camera with outstanding capabilities.  It is also a very demanding camera.  It is demanding of your shooting techniques.  It is demanding of the lens you use with it.  It is demanding of computer capabilities.This camera captures such incredible detail that it demands proper handholding techniques.  This is complicated by the heft of the camera.  I upgraded from a D70 and thought I had pretty good technique, but it actually took several weeks of effort to improve and really get tack sharp images.  I thought there was a problem with the focus on the camera until I realized images taken on a tripod were perfect.The true capabilities of the camera only come through when used with professional-level glass.  I had used both a Tamron 28-300 zoom, a very good lens, and a Nikon 70-200mm VR lens on the D70 and, obviously, the Nikon VR lens was better.  But, the difference between the same two lenses on the D2X is unbelievable.This camera will also place demands on the computer equipment and accessories.  Be ready to upgrade to 4gb memory cards.  Also, be sure your computer has the RAM to handle manipulating 70mb files.  If you use Photoshop and create many layers, be ready for the file size several times that size.  In addition to memory, you will need to have LOTS of hard drive space for all of the images you will be creating.I can recommend this camera to anyone wanting a professional-level DSLR.  Just be aware of the demands of the camera and have the supporting equipment necessary so that your experience is satisfying, not frustrating.", "Date": "October 17, 2005"}, {"Title": "A wonderful pro camera in every respect", "Author": "Tony Heinz \"i9900 is awesome\"", "ReviewID": "R2PVKLJZT0HS64", "Overall": "5.0", "Content": "I am going to keep this review short and sweet, rather than go on about every wonderful aspect of the camera. You can tell a lot about the camera simply by reading the specs, but they do not tell the whole story.PROS;-12MP have a lot of room to crop, I can crop down to 1/3 of the picture and there is still enough info for a decent 13x19 print.- Images are clean and smooth. I only shoot at ISO 100-200 and the images are noise free for all normal purposes.-GREAT COLORS. I am upgrading from a D70 and the colors are much improved. The D70 had a tendencey to wash greens, while the D2x has wonderful colors.(This is the part that really never makes it to the specs)- Responsiveness/ Handling. Nikon has always had the edge in ergonometrics, but the D2x/H take this to a new level. I have average sized hands and everything is right where it should be. The best thing is how everything happens INSTANTLY. You press \"AF-ON\" the picture is in focus. The viewfinder is beautiful and bright. The mirror blackout is so short you never see it go black in Single frame mode.-Two cameras in one. You can comapre this camera to the Canon 1Ds Mk II for high res landscapes and all that...AND you can compare it to the 1D Mk II for 8FPS sports action in HSC mode.CONS:-It's big. This is not a small camera, in fact it's pretty huge and heavy.-It's expensive. (I think it is worth every penny....Well most anyway)-It demands good lenses to perform best. The D2x can resolve more than many consumer lenses, so wait until you have good enough glass to justify the D2x.CONCLUSION:Great camera for just about anything, if you have five grand go for it, you will never look back!", "Date": "September 3, 2005"}, {"Title": "A very fine tool", "Author": "JLP", "ReviewID": "R2BXKJ84YSXD07", "Overall": "5.0", "Content": "After seeing some examples of photos from this gem of camera paired with a substantial [...] and getting a good price on selling my D100, did I finally make the plunge to a professional level digital camera. I am a serious amateur and I have owned this camera for about three months and shot off nearly 2000 photos under a variety of conditions. The camera is used with an ED glass zoom Nikkor lens G 28-200 mm and a Nikon SB600 flash. And I could not be happier with my new toy, um . . . tool. The image quality is superb with its 12 MP CMOS sensor. The build of the camera is a very durable magnesium body with well placed and well made controls. You can change ISO, image size, autofocus settings, shift from autofocus to manual and a number of other setting right from the camera body. Potentially if I became familiar enough with these controls I could make the changes without ever taking my eye from the camera. Furthermore, the camera is environmentally sealed and meant to be used under a variety of demanding conditions though I do not recommend taking it or any other electronic device into the rain without adequate protection. The grip both horizontal and vertical felt secure in my hands. There is a vertical shutter button with dials on the body to alter shutter and aperture settings. There are locks to prevent inadvertant firing of the vertical shutter button and shifting of the auto sensor for focus and metering. Below the depth of field preview button there is an additional button to which you can aside a variety of functions. I have it set to spot metering. The camera body unlike other Nikons does not come with a pop up flash though it does have a hotshoe. There is an additional sensor for white balance over the pentaprism. For those taking sports the camera has a high speed crop mode which shoots off much faster pictures but at a reduced resolution of 8 MP. There are three selections of metering: spot, center and the new 3D Color Matrix Metering II all of which may be changed from the right side of the pentaprism. I've found the Matrix Metering to be strikingly accurate with just a few times where the metering is fooled but this has been primarily where there have been extremes in lighting such as a night scene with a bright street light in the view. The auto white balance though not perfect has certainly been an improvement over that of the D100. You can also select your own white balance either from a grey card, a white card or even from ambient light. I have primarily use the autowhite balance. When I've had to use autofocus mainly for my cute rocket powered niece, it has been quite fast and accurate. The camera uses an electric cable release. You need to remove a small screw top from the front portion of the camera on side opposite of the shutter. At the time of this review the Nikon brand release MC-30 are not in stock anywhere though I've seen the fancier MC-36 available several places. A third party release such as one from Adorama is less expensive and seems to do the job. The camera performs very well at most of its ISO settings. The lowest is 100 and the highest which is the equivalent of 3200 called \"HI-2.\" The noise up to HI-1 (1600) is actually not bad since it is more like film grain than true digital noise which is neither entirely random nor nearly as pleasing. For those adverse to noise, the camera has an excellent noise reduction system which eliminates nearly all noise up to about 400 to 800 ISO. I have not noted any banding my JPEG images. There are actually a ton of other features which I am not going to detail here. There are a few downsides to this camera. It is quite heavy and large. I'd recommend that you go to your local camera store and hold the camera. Those with neck and back problems may find it too heavy and those with small to medium small sized hands may find it difficult to operate. Also due to its size you are going to attract attention so you'll need to be more vigilent. Because of the high resolution of the camera you need to have excellent technique mainly in holding the camera. The Matrix Metering is so usually right on that you will notice more of your photos will be far better exposed. Though \"correct\" exposure is a matter of artistic intent. You also need excellent glass on the camera. If know you will be using the cable release I would remove the small screw top from the camera body and leave it at home. It is screaming to get lost. Lastly, this camera is expensive and is not for the casual photographer as you will be paying for many features which you will never use. For a comprehensive listing for features I refer you to Thom Hogan, dpreview or Nikonians. For those ready to step up to a pro level camera then the versatile D2X will make be an excellent fit for all many types of photography.", "Date": "May 29, 2006"}, {"Title": "Excellent buy ... excellent camera", "Author": "Walter", "ReviewID": "RDS8SP859PHG5", "Overall": "5.0", "Content": "I've been using the Nikon N70 for 7 years and although I've wanted to get into the digital world - I didn't want to spend a lot of money to get a digital SLR.  The thing is, I got so used to the features with my film SLR that when I bought my first 'point and shoot' digital camera (last year) the performance was so disappointing that I promptly returned it one week after purchasing it.Since I've 'grown' up in the Nikon world - I used my dad's Nikon before I got the N70 - I started to research which digital Nikon SLR I wanted to buy.  I spent months researching - almost bought the D2H during the firestorm sale earlier this year but finally settled on the D2X.After going through months of whether I should buy a D70(s) or D2X I finally read a post in which the author said he made the purchase because he wanted a digital camera that will last him for the next ten years.  I don't know if my D2X will last me 10 years - but one thing that I do know is that I'm extremely fussy and I demand perfection from my camera - of course assuming that I take the perfect picture too :).I didn't want to be worried about the resolution and the speed, i.e. the D70.  The D2H(s) was the next logical step for me but with the lower resolution and the high cost it just didn't make sense.  The speed was a critical thing for me and although I'm not a sports journalist I wanted my camera to be very fast.My advice to anyone looking to buy a digital SLR - if you don't have the money or don't want to take out a loan - buy the D70.  If you like to play with the latest in technology or want the ability to take the best pictures and have complete control over your picture taking - buy the D2X.Beware though - it takes a lot of learning and a lot of practice to master this beast.  I've had it for a couple months and every time I use the camera I'm always learning something more about it, but I love my camera and I love what it does for me.", "Date": "August 20, 2005"}, {"Title": "One of the two best digital SLRs on the market", "Author": "FredM", "ReviewID": "R2PHVXK2HKN86F", "Overall": "5.0", "Content": "I got the D2X last August, knowing full well that a replacement for the D100 (which turned out to be the Nikon D200) was eminent.  I had a job to do in October that paid for the cost of the D2X twice over, and I'm still glad I got this camera when I did.  I now have a D200 as a backup, and am surprised at how many ways it equals the D2X, but if you want one of the two absolute best digital cameras on the market, this is one of them.  (The Canon EOS-1Ds Mark II is the other.)The D2X and 1DS-II have virtually the same image quality (although Canon gets the edge in terms of high-ISO noise), but the D2X is the only choice for those who have a large investment in excellent Nikon lenses.  I personally have no need for a full frame camera, so Nikon's 1.5X sensor crop factor doesn't bother me.The D2X is rugged, versatile, and amazingly fast in operation.  I've used it to shoot football games in light drizzles, lugged it through Europe, and worked with it for critical macro photography.Now that the price of the original D2X has been reduced significantly, and the new D2Xs is more affordable, too, this camera is even more of a bargain compared to its chief rival.  Nikon is providing many of the enhancements of the new model as a BIOS download, so I expect my D2X will remain my favorite camera for at least several more years.  About the only thing it doesn't do well is infrared.", "Date": "July 30, 2006"}, {"Title": "Nikon D2X", "Author": "lomcevak \"lomcevak\"", "ReviewID": "R1PT6UJBH4IZQ7", "Overall": "5.0", "Content": "I've owned 35mm film Nikons (F2, F3HP) since the mid 1970s, and have added D70, D200 and D2X digitals to the fleet. With the D2X, it's doubtful the film cameras are in for much work.There is nothing I don't like about the D2X!Battery life is phenomenal! I've shot over 10Gb and chimped most of them, and the battery level doesn't drop on the indicator. The camera has a high speed crop feature that allows me to shoot 8 frames per second if necessary, and which imparts an additional magnification effect to any lens being used.In addition to the full range of modern Nikon lenses the D2X accepts and meters with all my old AI manual Nikkor lenses as well. Autofocus with it and various Nikon AF lenses has always been quick and sure - I've never missed a shot I wanted due to autofocus lag.Others have spoken of the quality of the images, and I can only say that I can't tell a properly printed 8.5 x 11 D2X image from a film print.The D2X is large - you won't drop it in a fanny pack for a walk around the zoo - but I like the feel and balance. The camera is well-built and sturdy. It's an expensive piece of equipment, and worth every penny.............", "Date": "May 26, 2006"}, {"Title": "This is THE camera", "Author": "Xavier Onassis", "ReviewID": "R30IYVWARPA4EK", "Overall": "5.0", "Content": "I swore I would never leave film.I was willing to absorb the film costs to keep myself involved in serious image making.I owned classic Nikons from the past,Hasselblads,Linhofs......I was unimpressed with all the digital \"toy\"cameras that were rolling out.And was unimpressed with collegues gushing about their new DSLRs,especially when I saw their prints(kinda sorta like film?No!).......Then I started reading reviews of this camera...and went to a local dealer and got my hands on one.BEST made Nikon I ever saw!The images are superb!Sold all my film equipment.Gone.Not missed.Happy and shooting far more images(and keeping more)than I ever have in my 30 year career!", "Date": "October 20, 2005"}, {"Title": "Old by modern standards, but still a \"professional\" camera.", "Author": "Jerry Jackson Jr.", "ReviewID": "R2FRELXQT46E8K", "Overall": "5.0", "Content": "The Nikon D2X might be considered \"old\" technology by current (2012) digital camera standards, but it's still as capable today of capturing great images as it was when it was new back in 2005. The single biggest complaint against this old workhorse is that it lacks the clean high ISO performance of current generation DSLRs.That being said, if you don't regularly need ISO 1600 or higher then the D2X is an AMAZING tool. For starters, the magnesium alloy body is built like a tank and can survive abuse that would destroy a typical consumer-grade camera like the Nikon D3100 or D3200. Unlike the budget DSLRs in Nikon's product line, the D2X isn't artificially \"crippled\" by the lack of important features like high speed sync with Nikon speedlights. The D2X can shoot at 5 frames per second (fps) in normal 12 megapixel DX (1.5X crop) shooting mode or it can use a 2X crop mode (roughly 7 megapixels) to increase the burst mode to 8fps.There are also a ton of other customization options with this camera as well as the wonderful ability to record audio files with any image; this is great if you're a photojournalist and need to make a note about who or what you just photographed. Just take the photo and then press the microphone button on the back of the camera and you can record a note like \"This is a photo if John Doe and Jane Doe outside the courthouse.\" The audio file is tagged with the name of the image so you can identify which audio clip goes with which image.Overall, if you're wanting a \"professional grade\" DX-format (1.5X crop) DSLR then Nikon D2X is every bit as good as the D300 or D300S cameras ... at a lower price on the used market.", "Date": "August 20, 2012"}, {"Title": "You get what you pay for", "Author": "Micah", "ReviewID": "R3BFJONQVTG9GW", "Overall": "5.0", "Content": "This was Nikon's high res camera, and in actual use it really did just put the Canon 1Ds Mkii to shame.  Much better files at any ISO.  Much more color accurate.  More dynamic range, especially at base iso.  And, because of the crop sensor, it was always sharper into the corners.  Especially with wide angles (I always felt that canon's wide, superwide, and ultrawides were soft in the corners to start with--the high res 1Ds series just exposed the flaw).I doesn't hold it's own against today's offerings in terms of image quality (especially at high ISOs), but it is very capable of producing great images.  (Or at least as capable as the person wielding it).  I used it at 3200 and my work flow was just adapted for it.I sold my battle scarred beasty to a student and I now shoot a d700.  ....but a part of me misses that camera.I would definitely take this over anything under a d90 today.  And I'd take this over a d90 if I were going to be shooting in inclement weather or dusty environments.Unlike the d1/d1x/d2h, this camera will still be in use years from now.  It's just that durable and that good.  Even the batteries are durable (Canon had only begun using lithium ion batteries in their pro cameras three years after this camera was released--the 1Ds mkii uses NIMH batts that you can't even buy new anymore).Nikon did everything right when they made this one.  Definitely a robust beast.", "Date": "January 5, 2010"}, {"Title": "Nikon D2X first impressions.", "Author": "MetalMariachi", "ReviewID": "R1MI0HG57IM6RQ", "Overall": "5.0", "Content": "I was looking for a digital camera that would accept and work with all the great Nikon lenses I've accumulated over the past 40 years.I've used film in environments ranging from 120 deg. F and 95% humidity to -30 deg. F in, sandstorms, monsoons and from sea-level to 17,000 ft.I wanted a digital that would hold up like my F3 and F4 did.After reading hour upon hour of reviews and tests I boiled it down to what do I need vs. features that while very neat I may never use.Very well built and solid, this was Nikon's Flagship professional digital in '05.Size and lay out is similar to my F4 while weight is slightly less.Pros:  it will accept and work with all my lenses.The menu is easy to read and controls are laid out in a manner that makes setting up quick even without a manual. I did download the manual on line and brought it up for reference just in case.It feels familiar, so no culture shock, the controls are where my fingers think they should be without having to look for them.Weight to me is a plus; I found I have more stability hand held with a longer lens if the camera is heavier.It balances well with the big super zooms like the Sigma 170-500.With Nikon's firmware version 2, Hi-2 on the iso setting allows up to 3200 plenty fast enough for my needs.Cons:  Uses a more expensive compact flash card instead of an HDSC card.DX format so I have go to a shorter lens to get the same coverage as a 35mm on the F4, but a 300mm now has a 400mm + magnification so it's a trade off.When using older non-CPU lenses you need to set the minimum focal length and max aperture in the menu before they will be able to auto focus.Weight to some would be a con but take a hint from bass players get a wide comfortable strap, and sling it like a bandoleer, it lessens the strain on the neck, keeps the camera out of the way but close enough for easy accessOverall I'm happy with my decision.I feel if I can't get a decent photo with 12mp, 16mp or more isn't going to help.The body I purchased from Adorama was rated E- meaning Moderate wear, maybe scratches.Yup they are there, about 3 or 4 wear spots that you have to look very close to find.It came packed well enough to survive a lunar landing.Update 3 July 2013Brief update.The more I use it the better I like it, after around 200 shots I'm beginning to get the hang of it and its idiosyncrasies.I found one older 28-70mm f2.8 lens that is always super sharp on my F4, has soft focus in AF mode on the D2x, it is sharp in manual though. This is the only lens I have that has this trouble so may be an anomaly in my particular lens.Not a big deal because I purchased a new 17-70MM f2.8 which is quieter, focuses faster and is sharp at all focal lengths. So problem solved.Note: I have yet to find a zoom in any focal length as sharp as a dedicated single focal length lens.With longer lenses I found AF mode to be very important. Either single area or group dynamic works best to eliminate \"hunt\" in low light or for subjects in \"busy\" areas such as birds in leafy trees.In dynamic area with things like slightly moving leaves it will try to correct focus on everything, not a good combination.", "Date": "June 5, 2013"}, {"Title": "Super professional DSLR camera", "Author": "Vladislav Kravtsov", "ReviewID": "R3KBW6J2KNH7V5", "Overall": "5.0", "Content": "The camera was sold as written: Like New condition: very clean, clear, xlnt quality, well packaged, sent and received. Good price for this camera. I'm professional photographer, i steel use DX format Nikon's brend for my work: wedding photography, studio, people, nature, travel.", "Date": "October 3, 2009"}, {"Title": "My first digital camera...", "Author": "J. Christensen", "ReviewID": "R3HE2CBYOR3E76", "Overall": "5.0", "Content": "This is the first real digital camera that I purchased.  Imagine dropping 5K for a camera sight unseen!  It is worth it!  I am an serious underwater photographer, and have shot nothing but film for years. This was the first Nikon camera that I felt was suitable for replacing a film camera.  I was not disapointed.  It is a wonderful camera, and has very very sharp accurate colors.  If you are considering a real digital SLR and are willing to spend the money this is a good camera to consider.If all you want to do is take snapshots, look at a D-70 or Cannon Digital RebelJim Christensen[...]For an incredible review which covers every aspect of this camera an more, check out [...]", "Date": "June 8, 2005"}, {"Title": "Solid camera, great value", "Author": "HC Bresson Jr.", "ReviewID": "RY7E23QVGD5XV", "Overall": "4.0", "Content": "Needed a backup SLR and I had some old Nikkor lenses, so I decided to try out this refurb D2X.  It seemed like a good deal for a one-time flagship.  I was surprised to see what good condition it was in for a camera this old.  Everything works like new as far as I'm concerned.  I just wish it full-frame.  But I don't want to spend that kind of money yet.  Overall, very happy with this purchase.", "Date": "March 21, 2013"}, {"Title": "Pretty sweet camera", "Author": "James Holland", "ReviewID": "R6AXW5HDRVSC6", "Overall": "4.0", "Content": "The D2x is a very fast and flexible camera and well worth the price I paid for it used.  I like the quality of the pictures I get with it and the fact that it extends the focal length of my lenses so that I can put off putchasing longer lenses for a while. One thing I read while researching the D2x was the noise at ISO higher than 800 and it is true. I try not to push my camera beyond ISO 640-800 as I find that the shadow noise is unacceptable, even with noiseware software. I have a D700 for high ISO shots. Overall I am very impressed with the picture quality and build quality of the D2x.", "Date": "October 26, 2012"}, {"Title": "Incredible camera...great price!", "Author": "Paul C. Driessche", "ReviewID": "REFMCJG0GN99P", "Overall": "5.0", "Content": "This camera arrived quickly and in great shape.  It was very difficult to tell that it was used at all.  It is a camera I could never have afforded at full price.", "Date": "September 11, 2012"}, {"Title": "Nikon D2X", "Author": "john", "ReviewID": "R25KOCMXBE5M50", "Overall": "5.0", "Content": "Adorama(via Amazon)exported this item to Australia in a very nicely prepared package with an MH-22 charger and a brand new wide strap.The camera is in excellent condition with only 18k shutter actuations.I didn't buy this product as my only DSLR but more as a collectors piece, OK as modern DSLR's go it's fairly \"old hat\" but it has fine build quality and still captures excellent images.Probably the price, a fraction of it's original cost when new....prompted me to purchase. I immediately upgraded the firmware to the latest version and put in an EN-EL4A battery from another camera and off it went. I don't think it will take long to up the shutter count a bit!Great buy, good service from Adorama and Amazon and a fine ex flagship product...well chuffed!!", "Date": "August 13, 2012"}, {"Title": "Made me convert to Nikon from Cannon!", "Author": "Alicia Riverwoods", "ReviewID": "R2DP9XFYPOFFP0", "Overall": "5.0", "Content": "I am a professional photographer. I have been in the industry since 1996 and have gleefully watched the transition from film to digital and been able to play with many cameras along the way. 3 years ago the studios I was managing began using these cameras.Previous, in studio and in personal use I was a die-hard Cannon girl. After using this camera and the D300 (yes, this one is BETTER than the D300; and dozens of other professionals I know say the same), I have converted to being a Nikon girl!!I personally use this camera for up to 100 clients per week. If we had more need for higher mega pixels that would be my biggest complaint (I wish it was 15++). My only other concern is that when dropped (even from a very short height) or was knocked over (which, after 3 years, has happened a couple times) the lens doesn't seem to hold up as well as my Cannon lenses do. That being said, the body itself has been perfect.Overall, I love it. It's responsive, easy to use, and produces good results. We regularly print 20x30s for our clients and they think the quality is great too!", "Date": "May 3, 2010"}, {"Title": "Nikon D2x dslr", "Author": "Cheryl", "ReviewID": "R3I2ML2CID1NKF", "Overall": "5.0", "Content": "Arrived extremely well packaged. Love, love this camera and that it is in excellent, like new condition.  This may be older technology but it is stellar even next to my D300.", "Date": "June 12, 2013"}, {"Title": "An excellent pro camera...", "Author": "Leo Koach", "ReviewID": "R12HBP3Q8JD48A", "Overall": "5.0", "Content": "I had three D1X before D2X... battery life of the D1Xs was terrible, although I loved the results coming out of them, I couldn't trust for my sessions trusting the batteries... which. I also purchased brand new.My purchase from Amazon was as always, very easy and quick. Camera I received was much better than I ever thought for the price... very well maintained, and only 25K original shutter count. For this camera, which is around 300K shutter life expected, 25K is basically brand new.There are no bad things about the camera, a pro full body, large megapixs enough to print posters... very clean and sharp images... easy to use menu system... and extremely long battery life vs D1X's batteries.I think I will be buying same camera as my backup soon.", "Date": "March 28, 2013"}, {"Title": "Nikon d2x AWESOME camera!!!", "Author": "Anthony B. Bandy \"IceRain\"", "ReviewID": "R227VYV1TYCPGZ", "Overall": "5.0", "Content": "This camera is GREAT! I had a Nikon d2h and the d2x out perform its predecessor with amazing results! The photos are clear and clean and it is very user-friendly. If you are looking for a true professional DSLR with 12.4 mega-pixels but you don't want to spend a arm or a leg, this is the camera for you! Eventually I will upgrade to a d3x or d4 but for the time being my d2x is good enough for me! Remember, this camera when it first came out(2005) it cost $5000 but now it is affordable! Only things I can say is get it, trust me you won't regret it!!", "Date": "January 1, 2013"}, {"Title": "I Love My D2X!", "Author": "Amazon Customer \"Ani\"", "ReviewID": "R1N91IKQJQ23M4", "Overall": "5.0", "Content": "Since the D2x was introduced I've dreamed of owning this camera and after waiting seven long years I was finally able to afford a refurbished model from Nikon and it does not disappoint!I've read reviews and opinions and none of them give this camera enough credit. My opinions are, this camera fits perfectly in my hand, it is solid and with a super zoom lens its heavy but I love it!The learning curve was not hard in fact within just a few hours I was enjoying the features and making some awesome photographs.I know it sounds cheesy but I am super impressed. If you know Nikon cameras and have knowledge of the basics of photography on an intermediate or higher level this camera will produce for you.I read so many reviews putting this camera down for the learning curve but I didn't have any difficulties learning and utilizing the features on the D2X within just a few short hours.I would say if you have done your homework and know the basics of photography and love Nikon then you will not go wrong on the D2X!", "Date": "October 3, 2012"}, {"Title": "Great camera, but I will stick with film", "Author": "William Raby", "ReviewID": "RMPOJ2JF1FDNX", "Overall": "5.0", "Content": "I have been using manual film cameras for years. I wanted to get something a bit smaller, faster, more convenient. For someone used to the electronic 35mm cameras this would be the way to go. Photo quality and convenience is excellent.  The problem I found with it is that in the controlled environment of the studio I would always have it on full manual controls. I was using it the same way that I would use the old fashoined film camera with no batteries. While the Nikon takes excellent quality photos, my banged up old RB67 with a set of KL lenses just blows it away. It cannot even come close to the photo quality of the 4x5 camera. Add in the amazing capabilites of the 4x5 view camera and that is still the studio workhorse.  Of course when it comes to working with models, a view camera is not the ideal choice. I was hoping for a replacement for the 6x7 for working with models. The sets almost always tricked the exposure meter and I was back to using the light meter with the camera on manual settings. No advantage to using a computer camera there. You are still working at manual speed. While the photo quality of the Nikon is excellent, it still does not compare to 6x7 with good lenses for enlargements.  For location shoots with models the computerized automatic everything Nikon comes into its own. It is definitely an improvement over the RB67 in speed and ease of use. But the photo quality cannot match the RB67. The auto exposure and focus is definitely much easier on the models. Is it worth the sacrifice on photo quality? I am still undecided about that.  When it comes to landscape photography the Nikon stayed at home. The 4x5 view camera is the only choice for that.  The Nikon D2X is an excelent camera. But I think that it is not for me. I primarily use medium and large format equipment. Medium format is slow. Large format is very, very slow! And expensive. $2 to $3 per exposure for large format film plus processing. Digital is fast and cheap. For landscape and studio work I will stay with film. Medium and large format film is the way to go there. That is most of my work. For on location work with models, the Nikon gives medium format some competition.  The Nikon D2X is an excellent camera. My problem is mostly with the format and no tthe quality of the camera. If you are doing product photography for a big catalog, the Nikon is the way to go. If you are photographing wedding the Nikon is the camera for you. If you are doing portraits for clients the instant gratification for the client is quite useful. I think that the Nikon D2X would be the ideal choice for sports and wildlife photography where long fast lenses come into play. For the artsy stuff, big formats and film are still the way to go.  I have sold the camera and replaced it with one of those tiny $500 point and shoot cameras. The cheap camera fits in my pocket and does a suitable job for the family photos and such. The cheap camera works great for vacations. I will stay with the film for the professional work.  The Nikon D2X cannot beat a larger format film camera when it comes to studio or landscape work. It may be the choice for working with models on location. Economics makes it the choice for product, wedding photography. Coupled with the big fast lenses it is definity the camera of choice for sports and wildlife photography. The Nikon D2X is an excellent camera. But it is not the camera of choice for the work that I do.", "Date": "February 17, 2006"}, {"Title": "Piece of Junk!", "Author": "STONE A JUDLIN \"cajun 2 step cut short?\"", "ReviewID": "R2IYU5DBA0N1FF", "Overall": "1.0", "Content": "Purchased as a backup to another D2X SLR 12.4 that had some circuitry go bad.  The internal mirrors were filthy; & the shutter release stuck quite badly.  The 1st picture taken during each shoot, returned an \"error\" message.  Once my primary camera came back from repair, I brought this one in to have it cleaned & to have the shutter release action taken care of.  I was told that the cost of repair would be an additional $575.00 (above the original $663.41 that I paid upfront for this \"refurbished\" camera), as there were more mechanical things wrong w/ it than just the shutter release issue.  I was royally screwed by this seller; so, purchasers be wary.  Hard to think that the seller was unaware of these issues prior to placing it on the market.", "Date": "January 2, 2013"}, {"Title": "A genius camera for narrow use.", "Author": "Cecil Fox", "ReviewID": "R1Q2G7AQYDZ0WM", "Overall": "3.0", "Content": "This camera, if used the way its manufacturer demands is excellent. There is a problem. Suppose you have a need to mount it on a telescope or a microscope or a T mount, or on a bellows. Then you are out of luck, saddled with a technical miracle but intended to limit your photography and imagination to what Nikon wants you to have. If you want your camera to serve you in however you need to use it, you are better off with a light meter and a much cheaper rig.", "Date": "July 12, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "Supplied Accessories - Type-B Focusing Screen, Rechargeable Li-ion Battery EN-EL4, Quick Charger MH-21, Body Cap, Camera Strap AN-D2X, A/V Cable\nImage Size - Full Image - [L] 4,288 x 2,848-pixel / [M] 3,216 x 2,136-pixel / [S] 2,144 x 1,424-pixel, High Speed Cropped Image\nStorage Media - CompactFlash Card (Type I / II) and Microdrive.\n2.5 LCD Screen\nExposure Control - Programmed Auto with Flexible Program [P], Shutter-Priority Auto [S], Aperture-Priority Auto [A], Manual [M]", "Name": "Nikon D2X DSLR 12.4 MP Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/51FRV91N9GL._SY300_.jpg", "ProductID": "B0007X7W6K"}}