{"Reviews": [{"Title": "Much better than these reviews indicate!", "Author": "S. Gould \"gouldpjaks\"", "ReviewID": "R18WC4F0TDNDTT", "Overall": "4.0", "Content": "I ordered this camera from Gateway, directly, at a relatively modest price for a 5.25MP digital camera.  The camera was fabulous outdoors but faces and backgrounds had a green cast when using the flash.  I tried various flash settings and finally decided that my camera had a flaw.  I emailed Gateway and received an immediate response asking me to call an agent.  After a brief explanation of my problem I was told that a new camera would be sent immediately. The new camera takes perfect pictures! The detail is incredible and the color is accurate.There are some exceptional features on this little camera such as a sturdy and attractive metal casing, easy to use controls, a multitude of settings which allow you to choose aperture or shutter speed preferences, portrait mode which blurs the background and includes a red eye reduction flash feature, a choice of focal distances including a macro lens feature, movie clips with sound, 3x optical zoom (I reccommend using only optical zoom with a digital camera)and many more. The battery is rechargeable directly in the camera and it stays charged for a long time. There is also a battery life meter as well as an indicator of space available on the sd card.There are some problems as well.  The red eye reduction though helpful is not perfect.  This is a problem that exists with all small digital cameras and can be fixed on your computer.  The time between pressing the shutter release button and getting an image is long especially with a 512MB card.  This may account for the blurred pictures that some people have commented about.  You MUST hold still until the picture appears on your monitor or your motion will blur the image.  (Try keeping your elbows in at your side for more stability.) Another reason for blurred images might be choosing the wrong focus.  If you are set in macro mode and snapping a distant object it will appear blurred and vice versa for close objects and long distance settings. The flash is not extremely powerful but works as well as any other small digital I've used, and I've used many.  This is not a strong suit of compact digital cameras.Overall this is a great value for the price and the photos you get will be as good as or better than any point and shoot film camera you now own. The advantage will be that you can view them immediately, email to friends, and print photos yourself using a photo printer and your computer. No more waiting for the photomat to do its job. Be aware that you should bring along an extra card and an extra battery if you want to be assured of uninterrupted use of any digital camera. Since these items are reuseable indefinitely they are worth the investment.", "Date": "June 22, 2004"}, {"Title": "Stick with computers Gateway", "Author": null, "ReviewID": "R2PDYEIS2W25H6", "Overall": "1.0", "Content": "I picked this camera because it's small, has 5mp, 3x optical zoom and everything else for such a low price. BAD MISTAKE. All pictures taken outside turned out great...but inside pictures were a different story.  If I used the flash, then anything in the picture would be washed out and faces were left almost completely white.  If I didn't use the flash, then the camera had to be sitting on a table for the picture to not turn out horribly blurry.  When trying all the settings, looking for one that would work well for inside, I took 67 pictures of our Christmas tree.  Literally 4 of them turned out acceptable.It turns out bad indoor pictures were the least of my problems.  After 20 days of use, the camera refused to turn on seconds after a picture had been taken.  I tried a new battery and then plugged it in with the adapter, but it had no response.  I didn't hit it against anything or drop it in the 45 seconds between the time of the last picture and it not turning on...so who knows what happened.  Unfortunately, gateway only offered a 15 day money back guarantee...so since I was five days past the guarantee date, my father had to call and hassle them into refunding our money.  As far as a long-term warranty, this camera is only warranted for 1 year.  Kind of scary when it is a $350 investment.With all the bad things that happened, it is possible I just got a lemon...but for $350 I recommend spending your money on a camera from a company known for CAMERAS, not computers.", "Date": "January 1, 2004"}, {"Title": "If Size and Price Matter in Your Digital Camera....", "Author": "Chrissy1018", "ReviewID": "R35CENLW7JCQPF", "Overall": "4.0", "Content": "This is my first digital camera, though I have borrowed a Kodak digital camera before, and when purchasing for myself chose the Gateway over the latest Kodak model primarily because it offered the same features, but is much more compact--a little larger than a deck of cards--a key feature when trying to fit it in a small purse that's already overflowing.The camera comes with a 32MB card, which means when you have it set to the full 5-megapixels you can take about 12 pictures. But unless you're planning to enlarge photos a great deal or want to zoom in on things in detail after taking the photo, 3-megapixels is sufficient, and for that the card holds about 36 photos. Of course, the whole point of a digital camera is be able to take as many pictures as you like without the worry of wasting film, so I bought a 256 MB card: 200 photos at 3mp ought to keep me happy.The lay-out is pretty standard: Zoom lens that closes up behind a shutter when the camera is off, digital display window on the back to see what you're taking and what you've taken, a four-direction set of buttons to navigate the menus (good thing I practiced those controls playing Sega and Nintendo growing up) little wheel around the picture-taking button on the top right to select the mode, a zoom button and a separate power button. I found that when using the viewer to line up the shot the image was often very grainy and difficult to see, particularly in extreme lighting, but once you take the photo, the display quality is much better. Like with most cameras, the photo you've just taken is shown in the display for a few seconds, and you can turn the dial and look back at all the photos you've taken. You can also delete that one that makes you look like you have an extra chin right away, before anyone else sees it. All this viewing used to drain the battery of early digital camera models, but I've yet to run out of battery life, so no complaints on that, and the battery is rechargable.The dial on the top has separate modes for regular, night, action and portrait (which blurs the background) shots. The display window shows battery life, flash/no flash, number of pictures you can still take, zoom level, picture quality setting and auto focus on/off. You can also take a brief movie (we're talking a few minutes max, depending the size of your memory card, but still a nice feature).I actually received this camera the day of a friend's wedding, so it got a test immediately. Having charged it over night, I couldn't wait to start snapping. Overall I got some nice shots once I got the hang of it. My only complaints are that it often took too long to auto focus. So, the bride is coming down the aisle, I line up the perfect shot, push the button, whirr, focus adjust and click--another lovely shot of the back of someone's head. There's also an auto off feature, which is great to save battery power, but when you want your camera at the ready for longer than a minute, it's annoying to have to keep turning it back on.My second test-run was a day at the Bronx Zoo. Now I had the hang of it, and I got some really impressive shots. I could zoom right in for a close-up of a gorilla's hand when it was sitting on the other side of the Plexiglas window so you could see every detail of her fingernails. Or get a nice shot of those flamingos on the little island far away, or right up-close and personal with a Siberian tiger's face.Accessories include PhotoSuite software to view and alter your photos on your computer, a USB cable to connect the camera to the computer, an AV cable to recharge the battery, LI Li-ion rechargeable battery and a 32MP card (as mentioned).This is a very good price for a 5-megapixel camera, and as one of the first that Gateway has produced, I think they've got a very competitive product. I'm certainly satisfied.", "Date": "February 15, 2004"}, {"Title": "Gateway does it with this camera", "Author": "\"fishem\"", "ReviewID": "R2FTOY9SMVLUU8", "Overall": "5.0", "Content": "I was looking for a camera with 4 or 5 megapixels and decided to give this one a try as I have always been satisfied with Gateway products. This camera did not disapoint. It has worked as advertised and all the systems have worked well and continue to do so. I had been worried about lens quality when I bought the camera, but this turned out to be of excellent quality. The pictures are sharp and clear. The camera is easy to use and the instructions that come with it are quite adequate. Indoors or outdoors the photo quality is top notch. The flash works well and can be adjusted to three modes. The portrait and macro features are teriffic and it can be set on a manual mode if desired. The camera is light weight and the lithium battery is very convenient and long lasting on a charge. I recommend this product highly in every way.", "Date": "January 29, 2004"}, {"Title": "Works when it wants to.Gateway customer Service is THE WORST", "Author": "Chrissy", "ReviewID": "R1M40WWEZAEE0J", "Overall": "1.0", "Content": "Like others state, this camera works when it wants to. I get card errors ALL THE TIME. Says \"no card\" sometimes..Even right after I just took a few pictures. I have 3 flash cards...camera does same thing with all 3. I HAVE LOST MANY GREAT PICTURE OPS BECAUSE OF THIS CRAPY CAMERA. GATEWAY WILL DO NOTHING ABOUT THIS AND REFUSE TO ISSUE A REFUND.I think I have seen just about every \"ERROR\" message there is on this camera. With that said, when this camera \"does\" work, it takes some nice pictures. But, for the price of $359 paid, it should at least work right! My advise...DO NOT PURCHASE THIS CAMERA!! SAVE YOUR MONEY!!!GATEWAYS CUSTOMER SUPPORT IS THE WORST I HAVE EVEN SEEN..IT TOOK ME OVER A MONTH TO BE BE TOLD THAT THEY KNOW ABOUT THE PROBLEM BUT DO NOT KNOW HOW TO FIX IT AND A REFUND IS NOT AN OPTION SICE IT WAS OVER 30 DAYS..CUSTOMER SERVICE HAS \"HUNG UP\" ON ME MORE TIMES THEN I CARE TO SAY..MY CREDIT CARD COMPANY HAS BEEN NOTIFIED AND \"HOPEFULLY\" I WILL RECEIVE A REFUND SOME TIME!!  ONCE AGAIN...DO NOT PURCHASE THIS CAMERA...YOU WILL NOT BE HAPPY!!!", "Date": "April 18, 2004"}, {"Title": "Also agree camera is much better than reviews insinuate", "Author": "Andrew \"Andrew\"", "ReviewID": "R36CF66CKDM3DY", "Overall": "5.0", "Content": "I've written two review and each time it's been erased by the dreaded back button, but that's just how persistant i am on proving this is a good camera.This camera comes with all the standard bells and whistles (they're listed above) but it even comes with 5MP! Thats sounds like a good deal to me. I don't know what was wrong with Amazon's cameras but i got mine from BestBuy (and with a much better deal at that) and the colors were perfect. Just make sure you have it on the right settings (night for night; contrast how you like it; sepia and monochrome when you want it; quality: fine is the best one)That paragraph includes the pro's; now for the con's.CONS:You need a memory card, but no matter the camera that's always the case. The one it comes with is always to small (even though the 32mb card it brings isnt that bad)Look around for a better price. At BestBuy they we bought it at $150. It's sold out at BestBuy (with good reason) but it's still available for pick-up in some locations", "Date": "September 17, 2004"}, {"Title": "Missed daughter's bday because of \"protected card\" error!", "Author": null, "ReviewID": "R3BH71G9HPKFI8", "Overall": "1.0", "Content": "We've only had the camera for 3 weeks and now can only take pictures when the camera decides to work.  \"Protected Card\" error started on daughter's bday so we missed shots.I'm very disappointed with the support and the camera.  We bought an extra memory card and ended up paying $450.  It's worthless!  I expected more of Gateway.", "Date": "April 8, 2004"}, {"Title": "Great pictures, until you get random error messages!", "Author": null, "ReviewID": "RJL93S6IPI1IN", "Overall": "1.0", "Content": "I loved the T50 for about 2 months.  My experience has been that it takes great pictures, indoor and out.  But then I started randomly getting the error message \"Protected Card\" when I would turn on the camera or try and delete a picture.  Not every time, but often enough to be very annoying.  Turning the camera off and back on once (sometimes twice) usually solved the problem, but it shouldn't be happening in the first place.As if that weren't bad enough, I've just started randomly getting a second error message.  After I take a picture the screen will show \"Error 5\" and then the camera will turn itself off.  The picture I just took will not have been saved to the card.  Again, turning the camera off and back on once or twice makes it work again, but this is getting ridiculous!I should also  note that Gateway online technical support has been completely useless.  When I first emailed about the \"Protected Card\" error they responded by telling me to make sure I was using a memory card that was compatible with the camera.  When I later emailed about the \"Error 5\" message they responded by instructing me on the proper way to insert a memory card into the camera.Having had the camera for 3 months I am well past the 15 day money back guarantee, but I am within the 1 year warranty period and I am going back to my friendly neighborhood Gateway store to see what they can do about it.  Probably replace it with another identical camera that will do the same thing, but I'm going to give it a try.Caveat Emptor - Buyer Beware!", "Date": "March 20, 2004"}, {"Title": "Camera repair is worthless", "Author": "Scott Dean", "ReviewID": "R2XG75LMQQ7P3E", "Overall": "1.0", "Content": "purchased in Jan 04 the DC-T50.  Needed repair for faulty shutdown and \"error\" message when taking pictures.  Send in for repair on Feb 23rd for a \"10-day\" repair time.  Have made ten requests for information about progress of repairs - with no represenative able to identify if, how, or when it will be repaired or replaced.  Always telling me they will get me the information - but never do.  To date, still only promises to my inquiry... nothing about a deadline as to when it will be returned.  VERY UNPROFESSIONAL RESPONSE AND INFORMATION SERVICE.", "Date": "March 27, 2004"}, {"Title": "No Problems At All In The Past Year", "Author": "M. Harper \"Happy in Chicago\"", "ReviewID": "R1W5YLK6BW9A4Q", "Overall": "4.0", "Content": "I bought this camera about a year ago direct from Gateway.  I have never once had any issue with the camera... No memory card error, no lens motor malfunction... and all of my pictures have turned out excellent.", "Date": "November 2, 2004"}, {"Title": "From concern to delight", "Author": "Leonard", "ReviewID": "RN3ES1XPJJWNC", "Overall": "5.0", "Content": "Got the Gateway DC-T50 this week and have been VERY happy with it. Was ready to cancel my order at first after reading one very negative review; but camera performs exactly as advertised. Excellent photos with no problems so far.  Very versatile and will take some time to completely master. Camera seems to be identical to Toshiba PDR-5300", "Date": "February 14, 2004"}, {"Title": "Returning It", "Author": "T. Reinhart", "ReviewID": "RQQ4RSKUWI33V", "Overall": "1.0", "Content": "Okay, so how can you go wrong with a 5MP camera?  Answer:  If it has a \"Gateway\" label!  I just printed my first batch of photos at an automated Kodak digital printing service, and they were horrible!  CNET reviews gives the Gateway 5MP image quality rating a 4 out of 10.  I'd say more like a 2.  Very dissappointed...  and I am returning this camera ASAP, even though Gateway is charging me a hefty restocking fee - I will not waste another memory image with this piece of junk.  Perhaps they could distribute them in a Happy Meal or cereal box as a kids toy.", "Date": "April 21, 2004"}, {"Title": "Memory card error", "Author": "W. Wood", "ReviewID": "R2I7YV1FFEU7B4", "Overall": "1.0", "Content": "I did not read the reviews here until after I had ordered the camera. Since I had already requested the camera I thought I would give it a chance. I was very disapointed to get the \"memory card error\" after only 1 hour of using the camera. It occured after taking a picture, and that picture was lost. It would work again after turning the camera on and off a few times, but the problem kept recurring. Who wants to put up with that with a new camera?  I expected a lot more from Gateway, even though they did not make the camera, there name is on it. I emailed them to see if there was a software update to fix the problem. There response: \"If you did not purchase the item from Gateway, please contact the manufacturer for further assistance.  I apologize for any inconvenience this may have caused.However, please note that the Protected card error can be resolved by formatting the SD card.  The steps for formatting the SD card changes depending on the model of the card.\"First of all I did format the SD card, and if it needed reformating when a computer was not around to download the pics to, they would all be erased. And second The name on the camera is Gateway. Although I have read who really makes the camera, the email did not bother to tell me who the manufacturer was.The only good thing about all of this is that I bought the camera from Amazon.com. They are sending UPS to my house to pick up the camera for free and refunding my money. I will buy my next one on Amazon.com -- probably an HP Photosmart R707 5.1MP Digital Camera.", "Date": "June 6, 2004"}, {"Title": "Pleasantly Surprised not Digital SLR but...", "Author": null, "ReviewID": "R3AICT9IFKY90P", "Overall": "5.0", "Content": "I've owned digital cameras since they first came out. I've been trying new models, Some much more expensive like Kodak DX 6490. I expected to be blown away by Kodak DX 6490 images. Instead I was disappointed. Indoor images all had lighting issues and lacked detail. Downloading was a big hassle and videos failed to download at all with XP.After reading reading the reviews of the Gateway DC-T50 I was sorry I ordered it and prepared for bad performance. I can't understand the comments about bad indoor shots, unless you don't wait for camera to adjust. One of my indoor shots is so good that I'll probably frame it and hang it up. You can see individual hairs in my dog's ear without macro mode.I do wish videos were unlimited up to card size and that you could use regular rechargeable batteries, just because of ease and availability. Some of the bigger names may have more features & zoom = more $ and possibly better image MAYBE NOT.It's a great value with tons of features. Image quality is ALWAYS subjective. Give it a try you may be pleasantly surprised too.", "Date": "March 8, 2004"}, {"Title": "Do not buy this camera!!!  Please read.", "Author": "Frank W. Burns", "ReviewID": "R2LFIT5USNE0XY", "Overall": "1.0", "Content": "I have been a loyal Gateway customer for years and was excited to learn about this digital camera. I had read both good and bad reviews on this device. I figured for the most part, the bad reviews were either from professional photographers or rare instances of a defective product. Mine may be the latter, but this is a terrible camera. It looks and feels nice, and has a lot of features, but the photo quality is very poor, especially indoors. Most of the photos that I shot indoors came out blurry and out of focus and about 1/3 of the outdoors pictures came out poor as well. I got this camera this morning and read through the manual and got started. Boy was I disappointed. My Panasonic 1.3 megapixel camera blows the Gateway DC-T50 out of the water.I called Gateway customer service (what an experience that was). The first operator informed me that \"that was probably just the quality of the pictures for this camera.\" This is supposed to be a high quality 5.25 megapixel camera! She then told me that Gateway would be happy to take the item back; however they are going to charge me a 15% restocking fee. So when all is said and done, this camera and the accessories that I ordered with it are going to cost me $56.00 to get rid of. I say its money well spent, because this camera is not worth the price of the box that it was shipped in.", "Date": "June 14, 2004"}, {"Title": "Don't buy this camera", "Author": null, "ReviewID": "RK01EFMULYGW7", "Overall": "2.0", "Content": "This camera is only compatible with Gateway brand USB cables. If you happen to lose your USB cable then you are out of luck because Gateway does not sell the cable alone. I don't understand why Gateway doesn't sell replacement parts for its own camera, especially since no other brand works. Curiously, this problem didnt seem at all interesting to the 4 different Gateway employees I spoke with.", "Date": "July 1, 2004"}, {"Title": "This is a wonderful camera.", "Author": "Xi Shi", "ReviewID": "R37N49ZV9L6XAM", "Overall": "5.0", "Content": "I have had this camera for more than 2 years by now. I was surprised to see the negative reviews by others, since none of such bad instance happened to me. When I bought this camera, 5.25 MP was not very common yet. Plus, it is compact, light and stylish. It takes great pictures. It also has a movie mode, which we often used, and one time we recorded a great movie when a family of deer walking through our back yard calmly. The only additional accessory we bought is a 256 MB SD card. With a 256 MB card, we always managed to load the pictures onto a PC and free the card for more pictures. We love this camera, and can't find anything bad to comment on.", "Date": "December 29, 2006"}, {"Title": "Glad I hadn't read the reviews", "Author": "Carey \"GavNJaxMommy\"", "ReviewID": "R3FE67NWIOCM3S", "Overall": "4.0", "Content": "I bought this camera for $199 in 2004. I liked that it was a high pixel camera, had a color LCD screen and had many different modes (macro, black & white, sepia, movie, portrait, etc). In 2 years, I have taken approximately 2000 pictures and several dozen videos. The only picture quality issue I have had was that I kept getting blurred pictures until I turned the automatic flash on, and I have not had any problems with blurring since then. I have used the color format, black & white, and sepia formats, as well. I am VERY \"camera dumb\" and didn't actually get around to reading my manual until just this year, yet I hadn't ever had an issue with using this camera, it is fairly user friendly. Unlike other reviewers, I have never, ever had an issue with any card errors, lenses freezing up, camera shutting off, card erasing pictures, etc.....however, I recently noticed that my battery wasn't holding a charge. We took the camera to the store we purchased it from and they said the camera's battery charger was defective, so they sent us a replacement. It did not work, so my husband again took the camera to the store and they said that there must be something wrong with it, so it has been sent back to the manufacturer to be \"fixed\" or to be replaced with a comparable item. After reading all these reviews, I am fervently hoping that they replace it with a different brand!So, even though the particular camera I have had has worked well for me over the past 2 years, I don't want to chance losing any pictures or having the issues that other people have had. I take so many pictures that not having a working camera for even a couple weeks is very, very frustrating for me!", "Date": "September 13, 2006"}, {"Title": "Unreliable Camera Offers a lot.  Performs Rarely.", "Author": "Waheed", "ReviewID": "R16QULD5JB77T", "Overall": "2.0", "Content": "I bought this camera like others without reading any reviews about it back in 2004.  Back then it cost over 99 dollars.  The first 2 months the camera worked okay.  I did get many blurry pictures, but I also took some amazing photos with it.But after 6 months, I recieved card errors constantly.  The camera would overheat.  Another unfortunate problem is that once it gave me a card error and I had to readjust the card, but the latch got stuck.  It got stuck and would not open no matter how hard you pulled at it.  Eventually the latch became so smooth that there was no way to open it.  The only way I managed to open it is to literally scrape the latch off until I was able to take the card out.  Now the camera battery is wasted, and the charge will only last for 1 hour.Only I could take photos with it, and nobody else could, because I was the only one who understood how to make it take great pictures.  Eventually I got frustrated with it and bought a new camera that works much better.This camera deserves patience to operate, and if you are short on it, do not buy it.  It rarely gives good pictures, but when it does take pictures, it takes great ones.", "Date": "July 18, 2006"}, {"Title": "Too many problems", "Author": "Footloose \"Jim\"", "ReviewID": "R1E36B50EESBIC", "Overall": "1.0", "Content": "When this camera works, it's great.  Problem is, it seldom works, at least not for more than 8 or 10 pictures. Nearly every time I use it I get sporadic, random error messages that render the camera unusable. These include \"No card,\" \"Protected card,\" and \"Error 5.\"  Some combination of turning the camera on and off several times, or removing the battery or memory card usually causes the error to disappear.  But who wants to be doing that all the time?I am returning the camera for repairs.  But based on the poor advice I have received from Gateway supprt, I don't have much faith that repairs will be successful.", "Date": "March 13, 2005"}, {"Title": "Not an expert, but great pictures", "Author": null, "ReviewID": "R5BSC45RIDP8A", "Overall": "5.0", "Content": "I am not a photographer, and this is the highest pixel count camera I have ever had.  The pictures look pretty good to me, and it seems simple to use and it fits in my pocket.  I have not had the 'protected card' error.", "Date": "April 10, 2004"}, {"Title": "Best 5 Megapixel Value", "Author": null, "ReviewID": "R2Q7CL60GRRN19", "Overall": "5.0", "Content": "After reading the Wall St. Journal review of the Gateway DC-T50 I decided to give it a shot.  The photo quality is fabulous, and this is the first high quality digital camera I've owned that is small enough to carry with me most of the time.  I strongly recommend picking up a larger memory card--128MB is plenty for me (it stores about 100 full resolution images).  Battery life is much better than my previous Olympus camera with rechargeable AA's.  8x10 prints have tremendous detail--you can't tell that they're from a digital camera.", "Date": "March 9, 2004"}, {"Title": "Horrible waste of money", "Author": null, "ReviewID": "R1A4RDP1KTZG5F", "Overall": "1.0", "Content": "I am now on my third camera. Each one has had the same problem. I keep getting an error message stating \"Protected card\" (when the care is not protected). It is sporadic and makes the camera virtually unusuable. The message goes away after a while all by itself -- usually after the photo opportunity has passed.Gateway has no suggestions on what the problem is. Tech support just sends a new camera and it has the same problem.This is truly disgusting.I am now trying to get get my money back. I have wasted a bunch of money and lots of time. Also, I wanted  the camera to use in my work and now I have to borrow someone else's camera to bring along as a backup in case this one decides not to work, which is often.", "Date": "March 9, 2004"}, {"Title": "Infuriating", "Author": null, "ReviewID": "R1GOB4SZQREHBN", "Overall": "1.0", "Content": "On my second one which was replaced because it wouldn't obey the command Force Flash. Boy was that a mistake as the second one was worse and gives me Protected Card and Card Error about 1/3 to 1/2 the time. Unfortunately I'm a travel editor who travels the world and does his own photography and this problem makes the camera intolerable. I feel I'm stuck as I've bought 2 X 256 MB and one 512 MB cards and two extra batteries, a large investment for such a flawed product.", "Date": "May 6, 2004"}, {"Title": "Lens motor locks up", "Author": "Robert John McGahee", "ReviewID": "R3VAJD67SKAT28", "Overall": "1.0", "Content": "I ordered this camera 5 January 2004.  I have returned three of them for lens lock-up hardware failure. Each return averaged 4 weeks to get a replacement.  The 4th camera was received 10 May 2004.  The lens locked up on 15 May 2004.  I've put it in my drawer of despair.  At $10.50 shipping costs for service, I can't justify spending any more for this obviously flawed camera.", "Date": "May 27, 2004"}, {"Title": "Disappointed", "Author": "Pegs Tresures", "ReviewID": "R3I629QFKVQQYL", "Overall": "3.0", "Content": "I received this as a gift in 2005 I think , I am able to get a good outside picture,  they are excellent,  and one feature that I have used repeatedly is the movie clips,  I make short movies, load to the computer, loop them in a software, edit, and leave the sound, and can then add low music , set a theme for my movies  I have hundreds of little clips , well thousands now, turned into many fantastic memories,  I have not missed , outside adventures, birthdays,  christmas ,  you name it,  its great for making these little clips........  Pictures inside the house,  is my big let down, I too wish I had taken this back to the store in time,  what a let down,  I had a Fuji camera before, and it took the greatest pictures,  and this camera was suppose to have been a big step up, from my lower megs.  it was not!  The reason the pictures are not good inside is light does not seem to get in the little hole well enough,  I can move my camera back and forth, over my light gray carpet, and it changes from  orangish tint to normal, I have lost many good shots with the camera in the house,  and some I have kept , its been hard trying to salvage shots,  in photo softwares, just because light can not get in good enough.", "Date": "December 26, 2007"}, {"Title": "Avoid!", "Author": "Lea Jacobson", "ReviewID": "R1IHCNFYKT5627", "Overall": "1.0", "Content": "My friend bought this camera for me right before I had my first child.  I was thrilled!!!  Well, the camera was outstanding for about 6 months.  Then, all of the sudden it would tell me error messages such as \"Protected Card\" or \"Card read error\" or \"Low Battery\" even though the card was fine, and I confirmed this with multiple cards, and replaced the battery (Via the mail, you can't walk into a camera shop and get the battery) and the battery really wasn't the issue.Sadly, with all of the functions, this camera turned out to be a bust, and I can't even use it anymore.", "Date": "November 13, 2007"}, {"Title": "Works great for me!", "Author": "JJs Sunshine", "ReviewID": "R37DWBICPC9KJV", "Overall": "4.0", "Content": "Maybe I just got lucky, but this has been a terrific camera for me! I've had it since January 2005, and with 2 little ones around you can bet it's snapped it's share of photos. I did lose the pictures once (thankfully I'd already downloaded them) and realized that I was trying to switch modes while the camera was on. I stopped doing that and the problem never happened again. The memory format error finally happened a couple weeks ago, but really, most hard drives need to be reformatted after a couple years too! Most of the pictures have been great, though the auto flash red eye reduction isn't the best. This little camera has even withstood the occasional unauthorized use by my 4 yr old! It's not the biggest or the best, but for me it's been great!", "Date": "November 29, 2006"}, {"Title": "I love it!", "Author": "Caitlin A. Myers", "ReviewID": "R3TNUB0WP8M0CM", "Overall": "4.0", "Content": "This is a fabulous camera.  I've had it for about 9 months now, and it's served me well.  The only downfall is how quick the battery dies, but that happens with many other digital cameras, as well.  When purchased, I upgraded to a higher memory card.  The included one is fine, but I take a lot of pictures, so for me, it was worth it.  The camera is extremely sturdy.  I've dropped it several times, and although it has a few scratches, it still works perfectly.  It's light weight and small, without being lost.  My only tip for users would be:  when preparing to take a picture, hold the button half way down, so the camera can fully adjust, wait a second, and then take the picture.  Sometimes you just press down and immediately take the picture, it focuses on the wrong area.  But, overall, I really like this model.", "Date": "February 11, 2005"}, {"Title": "Great For First Timers -A Big Fan in Seattle, WA", "Author": null, "ReviewID": "R3J2LA4B455UIP", "Overall": "5.0", "Content": "First time using a digital camera and it was a success !  Without reading the manual, was able to go from battery charging > printing out photos.  Great picture clarity, features are simple to figure out and portability is great.  I recommend this to first-timers.", "Date": "March 9, 2004"}, {"Title": "Gigantic piece of crap", "Author": "M. Biek", "ReviewID": "R2RDBWQLD4S1W0", "Overall": "1.0", "Content": "I'm on my THIRD camera.The first one (bought from Best Buy) worked nicely for 4 months, then started alternately showing \"No Card\" and \"Card Error\" errors despite a variety of batteries and memory cards.  Gateway took that one back, ruled it faulty, and sent me a new one.The second camera has lasted less than 2 weeks.  It makes noices like it's going to take a picture but never takes a picture.  Plus the camera dial is all screwed up.  Half of the positions on the dial show something else.  For example, the \"Movie\" dial position shows the setup screen instead.I've sent the second one back to Gateway, they've ruled it faulty, and are in the process of sending me a THIRD camera.Do not buy this camera!  Spend the extra $50 and get something that isn't going to break all the time.", "Date": "April 4, 2005"}, {"Title": "please look at other options before you buy this camera", "Author": "sem", "ReviewID": "R3IV2QWQSMSY93", "Overall": "2.0", "Content": "I am fed up with this camera. My parents bought it for me because i have a Gateway computer and they wanted to make sure that my digital camera would be compatible with my computer.I'll just make this short and sweet.1 : McGyver couldn't figure out how to turn this camera on.2 : Expect to miss a lot of potentially great shots, because the start up screen stays on unnecessarily long.3 : Expect blurry shots for the first 2 weeks of using it.4 : If you buy a large memory card, you computer will start freaking out whenever you plug the USB into it.5 : If you plug it into a new G5, your pictures may get erased.6 : Customer Service at Gateway won't help.Just get something else. It will save you from so much frustration and anger in the long run.", "Date": "September 16, 2004"}, {"Title": "WORST. CAMERA. EVER.", "Author": "Brian G. Skerven \"BGS\"", "ReviewID": "RMERG1WAH480J", "Overall": "1.0", "Content": "I bought this camera last year thinking I was getting a good deal.  Wrong.  Every problem that has been mentioned in these reviews has happened to me: poor battery charging, card reading errors, pictures not being saved properly on the card and a long list of error messages it flashes every time I turn it on.  Of course, if I take out the battery, re-adjust the card and turn it on just right I can sometimes get one or two pics before it takes a dump.  My advice - spend a little extra and get a camera from a camera company - not a second rate pc builder.....", "Date": "January 9, 2006"}, {"Title": "Piece of Garbage", "Author": "S. Ray", "ReviewID": "R1YL9DDMJJ1SXN", "Overall": "1.0", "Content": "I recieved this camera as a gift, and it is trash. The battery life is the worst, and it only charges the battery when it feels like it. I recently took almost 100 pictures at my cousins wedding and when I went to burn them to a CD, I got a card error. You can't imagine the frustration. I had to tell everyone depending on seeing my pictures that my camera lost \"all\" of the pictures. This hunk of junk was purchased when it first came on to the market. I wish I had found some reviews before I opened the box. I am glad it came with the 3 yr warranty. I am sending that TRASH back. Don't waste you time and or money.", "Date": "June 23, 2005"}, {"Title": "wish i could choose NO stars- dangerous flash, possibly?", "Author": "esporter \"esporter\"", "ReviewID": "R326N0YFLPU8JT", "Overall": "1.0", "Content": "I just threw this out, today.  I had bought a new battery AND charger AND SD card in case any of those were the problem.  I wish I had looked here first and read the reviews, and given up immediately instead of being further nickle-and-dimed to death.ISSUES ISSUES ISSUES!I had all the issues mentioned here AND......screen would also often go blank for no reason and refuse to come back on unless I had the battery (new or old, either) out for more than a minute.  This would happen every few shots.Also when switching in between modes, it would either decide the card was the wrong format, go black or simply freeze up.  Not every time, about every other time.  Randomly.  \"Card cannot be used.\"  or \"Card Wrong Format\" -- not even the same error message would repeat -- but it then would not format the card, either!  This was a 128mb card, but other sizes failed with equal predictability.  That is, 100%, if used for a shot or two.I never even got around to trying the movie mode.NUCLEAR FISSION FLASH - DANGER WILL ROBINSON!The few shots I did get were worthless.  Not one was adequate.  It WAY overflashed esp in the portrait mode whether I was zoomed in or not.  This is when it should know best NOT to overflash.Usually these cameras have underperforming flashes.  This was not the case with mine.  Mine was a real diva of a performer!The photos were basically pure white.  I even tried turning off the flash altogether and it still overflashed, I mean, FRIED, the subject.  And the NO FLASH symbol was right there on the screen...and still it flashed..!I decided to try the +/- bracketing, which appeared on the screen like the NO FLASH symbol did, but the result was that the flash still xrayed the subject, at every setting.Even in landscape mode, the flash was on the atomic scale.  A small child or pet could be vaporized.  Or at least get sunburned... OK, i exaggerate, but only slightly; and seriously, at close range, a flash straight in the eyes can be dangerous if  not piss people off.This camera has made me consider the possibility of demonic possession of an inanimate object...in addition to all of the above, it would not even TURN OFF when I wanted it to!Yes, I said THE CAMERA WOULD NOT TURN OFF.  It turned on fine, just very rarely would it turn off even with multiple repetition long pokes and jabs holdings-down of the power button.  Even with my best cussing...I have used a vast number of film cameras and a wide range of digital, from cheaper than this to professional SLRs.  And this camera is utter crap.  The pinhole camera I made in middle school did better work, and didn't expose me to gamma radiation, or lawsuits, and was a heck of a lot cheaper.", "Date": "August 26, 2006"}, {"Title": "JUST PLAIN JUNK", "Author": "Frank \"Knarf\"", "ReviewID": "R3OPR21E0CS35V", "Overall": "1.0", "Content": "This is by far the worst item I have ever owned in my entire life.  After spending $300, this thing will work once in a great while...I still use an older 35mm as a backup!  It will not do anything now.  DOA  Card error cannot be overcome on this unit.  It took pictures when it felt like it.  I missed a lot.  No wonder Gateway closed their stores.  VERY POOR CRAFTSMANSHIP!", "Date": "July 25, 2006"}, {"Title": "Great Digital camera for its price & how to fix \"card error\"", "Author": "Benson \"digitiger\"", "ReviewID": "R261G79Q97EKTV", "Overall": "4.0", "Content": "I got this camera for two weeks from gateway $199 after $50 rebate. very easy to use and had a lot of function.  Order another 256MB SD and is on the way.  The picture is very good outdoor with enought light, compare to my 1.5MP Sony DV, the picture is much more rich.  The flash light need to be stronger. I had the \"card error\" today.  The cause was I turn the dial between \"A\" and \">\" when I turn it on.  Reset and nothing works, the memory card still works if I put in my memory card reader.  I simply do a quick format under XP. Next I thing you is working again.  What you pay is what you get but I think $200 is well spent. I would recommend if you just want something cheap for outdoor but would not recommend if you take lots of picture depends on flash ligh.", "Date": "May 31, 2004"}, {"Title": "Awesome Camera - Great Buy", "Author": null, "ReviewID": "R3PABAXYTAE7TY", "Overall": "5.0", "Content": "The T50 is definitely the best compact 5MP digital camera out there!  I particularly like it for it's aesthetics (metal case), small size, great picture quality, and its really low price. It's super easy to use too.", "Date": "March 8, 2004"}, {"Title": "buyer beware", "Author": "Amy Watanabe", "ReviewID": "R2T711QU25YMAL", "Overall": "1.0", "Content": "horrible camera. experianced everything said above. i am now actually looking for anyone who still has the box so i can send this hunk of crap back. (...) it would be greatly, GREATLY appreciated and i'll try to do something nice in return.", "Date": "June 14, 2005"}, {"Title": "This Camera Blows the Others out of the Water!", "Author": "Eric J. Eidle \"Egon-Look-Alike\"", "ReviewID": "RXOB7IG4STFDC", "Overall": "5.0", "Content": "This camera is awesome.  I've seen that a lot of people have trouble with error messages.  I haven't had one and suspect it to be something they did while transferring their pictures to their computer or maybe using the SD card in one of those Kodak printer stations at your drug store, etc.Second, the reason why people are having picture quality problems is because they did not read their manual.  This camera has a ton of features and if you don't know how to use them, you're not going to get good pictures.This camera is very easy to use.  Like I said, just read the manual.", "Date": "April 23, 2004"}, {"Title": "Don't waste your money!!!", "Author": "K. Carino \"Kim\"", "ReviewID": "R477ODO5G3XX", "Overall": "1.0", "Content": "This is an awful camera!  I have had ALL the problems discussed in the below reviews - they didn't start immediately, but within a few months, I was experiencing them all!  I wish I had read these reviews before I wasted $200. I consider the camera a throw-away!  I would have rated this camera a ZERO if that was an option.", "Date": "May 4, 2005"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0000ULBIK"}}