{"Reviews": [{"Title": "GREAT!", "Author": "MestaySS", "ReviewID": "R1DXIG3TCI6E38", "Overall": "5.0", "Content": "This is a fantastic camera!  I really can't say enough great things about it.  I just upgraded my digital camera fortress with a Minolta 5D (SLR) and with this tiny baby.  I had an Olympus Stylus 300, 3.2 mp for about 3 years now.  The indoor pictures were always grainy and blurred, but outdoor pictures were beautiful.  However, I felt that I needed more bang for my buck and began researching for a new digi cam.  I came across this Fuji and noticed 1.) 5MP, 2.) Less than $200!!!, and 3.) Xd card compatible (i already had about 512 mb of xd cards for my Olympus camera).So, I began testing out this new baby and found that: it is very tiny and light, every single picture is bright and crisp, and the LCD screen is big, bright and noticeable even in bright outdoor light!The LCD screen is one of the best features.  I always had trouble viewing pictures in outdoor light with my other camera, so my next camera purchase HAD to have a viewfinder.  But I find I don't need the viewfinder option with the camera because the LCD screen is perfect in all lights...that is one of the best features, and for the price, you can't beat it!I can't recommend this camera enough. But I would highly recommend purchasing rechargable AA batteries.  Regular Alkaline AA batteries drain very quickly!", "Date": "April 17, 2006"}, {"Title": "Remarkable camera for the price", "Author": "Alan Ross", "ReviewID": "R3W0KAW6ZI3TW0", "Overall": "5.0", "Content": "I bought this Finepix A500 as a budget replacement for a digital camera that was recently stolen from me. I think its fair to say that you get quite a bit of camera for the money spent here (you can find this camera at several places on the internet for less than $120 , I bought my for 118.99 brand new with free shipping included), it has a 5 megapixel resolution and 3x optical zoom and takes great pictures , in a comparison of picture quality with a friend who has a Nikon that was about 4 times the price of this camera when we took the same pictures in identical situations with same picture settings this camera performed just as well with color and clarity just as vivid. Ok his camera has bells and whistles this one doesn't and more preset picture modes but for the average picture taker this is definitely a winner, great macro shots too and professional-looking clarity and resolution on 8X10 photos as well. The software wasn't quite as elaborate as my other camera's (an HP Photosmart) but I do my general photo editing with either Picasa or the basic Adobe Photoshop (both free downloads on the web) so I can't really see this as a downside either, definitely a satisfied buyer and user here.", "Date": "July 15, 2006"}, {"Title": "Good Camera for a Business Traveler", "Author": "Glen Marshall", "ReviewID": "RCBKR83WC47X1", "Overall": "4.0", "Content": "I bought the Fujifilm Finepix A500 as a camera to pack in my PC case on business travel.  I use it mainly to get candid snapshots in business meetings and conferences.  It is small, discrete, and works well for the purpose intended.  The 5MP resolution allows me to get quick shots without much care for composition, background clutter, etc. since I use a photo editor to take care of those tasks later-on.  When buying this camera note that it does not have a case or much on-board storage.  An XD memory card and a case are necessary.  I also recommend getting a NiMH battery charger to keep battery replacement costs low.", "Date": "June 3, 2006"}, {"Title": "Great for the Price", "Author": "Elizabeth T. Neal", "ReviewID": "R299YNV8LWPSSU", "Overall": "4.0", "Content": "Overall I am very happy with this camera. I got it last month and have already taken 400+ pictures. Here's what I see as its pros and cons:Pros:1. Small and lightwieght (I can fit it into the back pocket of my jeans)2. Easy to use (I haven't opened the manual once)3. 5.1 MP (more than you need for an 8 x 10)4. Price5. Battery Life (runs on 2 AA) I have taken 180 pictures at the highest setting and done a download before having to change them.Cons:1. Slow response time - takes awhile between pictures, hard to get candids2. All my zoomed in pictures turn out badly (possibly because I don't hold the camera steady enough)3. USB and power ports on the side are exposed (a case solves this rather easily)", "Date": "September 27, 2006"}, {"Title": "Excellent camera for the money.", "Author": "Elusive Adhesive \"free spirit\"", "ReviewID": "R2H6RK1DKE8DLN", "Overall": "5.0", "Content": "I got mine today and have been testing it out.  It is small, barely bigger than a credit card (though thicker) and reasonably light.It was easy to figure out how to use, except for how to get into the picture viewing mode.  Turns out there is a special button for it.  But that is the only thing I've had to consult the manual about and I'm not a digital camera expert.  I had one camera before, a Kodak DX3700, and I must say that not only did I pay less for this camera, it is a much better camera to boot.  My old camera only took decent pictures in bright sunlight, and many pictures were blurry.This camera I have only tested inside, so far, but the pictures look great.  The LCD screen is bright and easy to see, and a pleasure to use.  The zoom lens works wonderfully.  Taking pictures is easy and I was favorably impressed by the quality.This camera can also make short movies without sound.  And unlike my old Kodak, the LCD screen is in real-time so it shows exactly what you are seeing through the viewfinder.I don't know what happened to the other reviewer - maybe he got a defective camera?  For me the Finepix A500 works beautifully and I'm very glad I bought it.  It is excellent value for money.  I bought it after reading on a digital camera site that it was highly recommended for its price range, and I can understand why.  It's inexpensive, compact, has a great LCD screen, and takes good-looking pictures.  What more could you ask for?", "Date": "September 5, 2006"}, {"Title": "Fuji FinePix A500 - Great Camera For the Price", "Author": "Atlanta Yankee Fan", "ReviewID": "R177I4OWD3LGA3", "Overall": "5.0", "Content": "I bought this camera for my teen age daughter for general use as it was time for a new camera.  I wasn't expecting much for $130, however; this camera has far exceeded expectations.  Pictures are clear with great color.  Battery life is better than average, the camera is easy to use and we haven't experienced any problems with indoor shots.  The camera is very compact.  Its amazing how something so small can have a generous display and take such high quality photos.  I agree with the previous review, you need an extra XD Picture Card (I ordered the 512 mb) and rechargeable batteries.  Overall - we are very happy with this camera.", "Date": "September 6, 2006"}, {"Title": "Very nice camera, especially considering the price", "Author": "Lucas F. Gonzalez \"MXS\"", "ReviewID": "R3EFVGWENO9292", "Overall": "4.0", "Content": "I picked this up after much hesitation (I didn't like the idea of dropping over 100 bucks on a camera), but as an open box at a nearby store. I wanted a camera with at least 3x optical zoom, and a decent resolution, for casual/semi-artistic use and this delivers to meet my needs.The pictures in daylight with a flash are quite crisp, although the same can NOT be said about dark or moving pictures, as mentioned in an earlier review. The camera has a very hard time focusing in low light situations, and when an object is moving, it gets a lot of motion blur. It was rather hard to get a nice shot of some jack-o-lanterns this Halloween, for instance- most came out obsenely blurry when taken in the dark (no flash of course).I heavily recommend purchasing a set of rechargeable AA batteries. The battery life on this camera is not half bad, but it ends up cheaper in the long run.Startup time is about 2.5 seconds, for those of you who want to take more spontaneous photos.In my opinion, this is one of the best cameras in its price range. Go for it.", "Date": "November 4, 2006"}, {"Title": "Great starter camera for my 8 year olds", "Author": "Roland Reinhart \"Roland\"", "ReviewID": "R224G92V03WRP5", "Overall": "4.0", "Content": "I got burned in the past trying to get away with buying my kids sub-1.0 megapixel cameras, which really were a waste of money and disappointed everyone in terms of quality.I am happy so far with this model. I got two for my sons at about $85 USD each. It's a perfect size for them. Controls are simple. The quality of the photos has been good. It runs on a pair of AA batteries which makes it easy to replace without hunting down a special, expensive size.The only thing that annoyed me was the internal memory is about 12 MB. The default setting allows you to save about 10 photos. You can change the resolution down to 1600x1200 to double the number of photos. But still, for kids running around taking pictures of everything, they fill that up the internal memory real quick.This camera uses an uncommon media format - xD-Picture Card Type M. So now in addition to SD cards and Compact Flash cards I own for other devices, I have to buy XD cards. If I had realized that, I would never have purchased this model camera.I went to the local box stores, and a hard to find 1 GB xD-Picture Card costs $80 -- about the price I spent for the camera. Absolutely ridiculous, considering in the same store they sell 1 GB SD cards for $15-25!Shopping on Amazon, I settled on buying 512 MB xD-Picture Card Type M for about $16+5 S&H; each - the cheapest I could find. If I keep the resolution down to 1600x1200, The specs say 818 photos can fit on a 512 MB card.In summary, be sure you want to start buying xD-Picture Card Type M flash media before you buy this camera. Otherwise, look elsewhere.I hope you found this helpful.", "Date": "April 15, 2007"}, {"Title": "Good but not great.", "Author": "Ice Feathers \"boo\"", "ReviewID": "R2B4HO6ULDM9B4", "Overall": "3.0", "Content": "I got this camera a little over a year ago and was instantly amazed by how easy it was to learn. It doesn't do anything fancy, but I didn't need anything more than a good \"point and click\" camera to carry around. The delay between clicking and the camera actually taking the picture was a bit off, which makes action shots difficult, but still life photos and portrait type photos are great! The only major downside is how quickly it goes through batteries. Yikes! Rechargables are a good solution, but you better NEVER forget to take an extra pair of fully charged if you're going out for an evening of picture snapping. If you're going on vacation, take a lot.I'd give this camera a higher rating if not for the way it died on me. The day after I took some pictures, the camera developed a Focus Error and the zoom lense wouldn't retract, even after replacing the batteries. I emailed Fuji about it and they suggested some things that didn't work, or I could send it in for repair that would probably ultimately cost more than the camera itself did. Why bother?My advice -- shell out a little extra for something better. You'll be glad you did in the long run. If you just want something cheap, this camera is decent, but remember what they say about getting what you pay for...", "Date": "June 11, 2007"}, {"Title": "Just one flaw", "Author": "Michael Dickson \"To improve is to change. To ...", "ReviewID": "R3220WHF8QP4AL", "Overall": "4.0", "Content": "The other reviewers speak the truth, so I will not parrot them. Why do that? But I would like to bring one little flaw to your attention. The on-off button is recessed and so miniscule that if you have anything approaching a beefy paw you will have trouble turning this baby on. Yes, you will. Ditto for turning it off.Other than that, it is a nice camera for what it is. I bought it because I wanted an upgrade. My other camera is the Fujifilm A101, now an antique. The A101 is still a sweetheart. And the on-off button is far better.", "Date": "December 11, 2006"}, {"Title": "Good value for the money", "Author": "Wm Rush \"Dad\"", "ReviewID": "R1JX2K9LES12MX", "Overall": "4.0", "Content": "The A500 is a quality camera that is easy to use and produces excellent point and shoot quality photos. Controls are simple and easy to use.The downside, as you would expect in a $100 range camera, poor low light performance. Even when using the flash in a well lighted room, the delay between pressing the shutter and the actual image capture is enormous. Not very useful for children or partys where people are moving.Overall a good camera for a very low price.", "Date": "January 3, 2007"}, {"Title": "Disappointing.", "Author": "L. Godwin \"LynnBob\"", "ReviewID": "R3V4NB2FN9PQ4V", "Overall": "1.0", "Content": "This is a good camera for taking photos...outside...in good light...if nothing is moving.  I bought it to replace a similar older Fuji.  This camera is not nearly as good as the older one.  Most photos are blurry or out of focus.  Colors are not great.  I wish I could get my money back on this bad boy.  My advice...if you do buy it...take lots of pics quickly.  Inspect.  I've loved Fuji in the past, but this one is a dog and a disappointment.", "Date": "August 7, 2006"}, {"Title": "Got It for my daughter but it is better than mine!", "Author": "Blitzburgh", "ReviewID": "R106XXEWFLRKCU", "Overall": "5.0", "Content": "I purchased this camera for my[..]daughter as her first digital camera.  She loves it!  The camera is simple to use with not a lot of unnecessary functions to confuse her.  She found the menus easy to navigate and understand, and is taking beautiful pictures.  Rechargable batteries are a must for any camera belonging to a [..].The only drawback is that this camera is better than the 3 megapixel camera I use!  I have an older Nikon digital which has some great features (that I really don't use).  So now my daughter can take clearer and sharper pictures than I can!  I should have handed down my Nikon to her and kept this great little camera.", "Date": "May 22, 2007"}, {"Title": "A500 nice introduction to the world of digital photography", "Author": "Mr. D. J. Mordey", "ReviewID": "R4VKR823AFEMV", "Overall": "4.0", "Content": "Excellent value for money as always with Fuji products, its does what is sets out to do and is a simple to use compact camera with enough manual capability for the basic user, it gives clear bright photos for the resolution, better than you would expect on the downside the video capability has no sound, its slow ( shutter lag ) to use and a little over cost reduced in the case design ( looks better than it really is ), the LCD screen is not much use for determining focus or qulaity of photos, menus difficult to use, battery usage quite high, you must get rechargable batteries, but this is common for most digital cameras, that all said, for the price and to get started in digital photography you cant go wrong, but I predict within a few months the limitations may become frustrating and you will want to upgrade, Fuji do some much better compacts than this, if you dont have any more money then buy this and give it to someone when you upgrade.", "Date": "March 8, 2007"}, {"Title": "Nice Camera", "Author": "Big D", "ReviewID": "R3HDW8XSYYRE3Z", "Overall": "5.0", "Content": "I have owned this camera for about 2 months and really enjoy it. I did not want a camera with out a view finder and this is one of the few that I found that has one plus I have owned FUJI products before and like them. The camera is a little bit to small but over all I like it.", "Date": "January 23, 2007"}, {"Title": "Fuji Finepix A500", "Author": "ed", "ReviewID": "RK6DO4AAINDEO", "Overall": "5.0", "Content": "A wonderful camera to use. Ease of use and compact makes it a great camera to take along where ever you go. I certainly couldn't complain of the price either.", "Date": "June 2, 2007"}, {"Title": "Great Compact Camera", "Author": "ScrappyBG \"Brenda\"", "ReviewID": "R3EN3IQRW2UMEQ", "Overall": "5.0", "Content": "Our 20- and 17-year-old children each bought one of these cameras last week.  So far, they're great.  Just a note about the xD cards:  the earlier reviewer is right, they are not as common as other types, but with a little patience, good deals can be found.  Also, we checked the Fuji website and found that either  type of xD card (H or M) was compatible with the camera.  We purchased Olympus 512mb type H cards from Amazon (we got the cameras from another online store) for $15 each.  Since we bought two, we were over the $25 limit required for free shipping.  We ordered on April 11th, expecting to receive them on or after the 23rd (the kids were using a couple of smaller xD cards we had on hand, so no big deal for us to wait), but we received them yesterday, April 18.  My son, the techie, really wanted a 1gb, but I pointed out that he was very unlikely to need to store that number of photos for any length of time, plus larger cards usually mean slower camera action.  The 512mb will hold 486 photos taken at the 5.1N pixel resolution.  I encourage them to put their photos on their computers frequently so they don't lose those memories (we order prints online or use a digital scrapbook program).Other notes:  the photos they've taken look great, the controls are easy to master, the price (under $100) is terrific. Using AA rechargeable batteries is a big plus.  If those run out, you can always pop in a couple of alkaline. I use a Fuji S5100 4mp that I absolutely LOVE, but I wouldn't mind having one of these for times when I don't need the 10x zoom and want to travel light.", "Date": "April 19, 2007"}, {"Title": "A little workhorse!", "Author": "Sayra Adams \"Sayra Adams\"", "ReviewID": "R155R1LUXO6AGB", "Overall": "5.0", "Content": "By far the best point & shoot camera. I use it for my online listings on Etsy. It takes fantastic macro shots...and action shots! I love it so much! The software program is easy to navigate, auto adjust solves all photo issues.The only downside to photo software s I'd like to see a batch tool for resizing my web photos. Buy this camera, you'll be glad you did (believe me I've had some duds, this one isn't one of them).", "Date": "April 19, 2009"}, {"Title": "Great Camera for General Use", "Author": "John Morgan", "ReviewID": "R2MM3OAWA0YFMX", "Overall": "5.0", "Content": "Got a nice price on this camera, installed a 1 GB memory card, and am very happy with it! Helpful book explains nice-looking interface.", "Date": "January 8, 2009"}, {"Title": "Own it, LOVE IT!!!!!", "Author": "Edward J. Kovack III", "ReviewID": "R6MRDZ04NV69S", "Overall": "5.0", "Content": "This is an upgrade to the last Fuji & still have & after using Fuji its no wonder I & Others Love them!!.. They are easy to use & work so well taking excellent pictures!! !", "Date": "January 23, 2008"}, {"Title": "A decent camera in certain situations.", "Author": "J. Reysen", "ReviewID": "R2Q3CVSR9VL2ED", "Overall": "2.0", "Content": "First of all, I got this camera in Best Buy for about $100 quite a while ago. It's a nice camera, don't get me wrong - but only taking pictures outside when it's very bright. I took this camera to a concert, hoping it would suffice - but the batteries ran out nearly 5 minutes in, and the few pictures I was lucky enough to take, had immense amounts of noise and were very grainy overall.The concert was low-light, yes, the the stage had a decent amount of lighting where I figured it wouldn't really matter if I used flash or not. However, I used flash on a few pics, and didn't use it on some others - but overall the results were the same. I even toyed with the different modes, hoping I'd get a decent picture. Nope. As soon as I got home and transfered them to the computer, they all looked like crap - not blurry, just very noisy, and the colors seemed a bit... off.Aside from that, the outdoor pictures I took were rather nice. So if you really have no use for good low-light photographs, and nothing-special-but-decent outdoor photographs, this camera would be right for you. Just make sure you buy it really cheap, and don't make the same mistake I did.", "Date": "December 16, 2007"}, {"Title": "Wow, lots of camera a little price", "Author": "Doug in CA \"Doug in CA\"", "ReviewID": "R1HC7R1Q054Y2N", "Overall": "5.0", "Content": "I bought this camera for my daughter. It was inexpensive and seemed to have good reviews. The surprise was how good the pictures are. I think they are better than my Canon S3's.It does not give the impression of being a real robust camera, but so far it has worked excellent. It does eat the batterys. I recommend getting some high capacity 2700 mha nimh rechargeable batterys", "Date": "June 11, 2007"}, {"Title": "Great Camera", "Author": "Chrystal Starnes \"Chrystal\"", "ReviewID": "R1YE94L79S3WM8", "Overall": "3.0", "Content": "This camera is easy to use and takes great pictures for the amount of megapixels it has.", "Date": "June 7, 2007"}, {"Title": "Great buy", "Author": "R. Neumann", "ReviewID": "RQNGCTWLLXBNF", "Overall": "5.0", "Content": "Great camera for the money.  I needed something to use with the construction business I work with (before/after, quality control, etc).  Also great for family/everyday use.  I love it.  I always have a 512MB card in it, so I can't vouch for the built-in memory.  Quality, ease of use, size -- all A+.  Can't say enough great things about it.", "Date": "May 23, 2007"}, {"Title": "Great", "Author": "J. Brady", "ReviewID": "R1T08S75WHJ4O4", "Overall": "4.0", "Content": "So far so good.  I really enjoy the camera.  I only have one concern though... the power button is a little small and I'm afraid it could get worn out quickly... but other than that... it's great!", "Date": "May 14, 2007"}, {"Title": "Great low-budget camera", "Author": "Paul Jaramillo \"Black Cat\"", "ReviewID": "R2ISMZB8JR4GM1", "Overall": "3.0", "Content": "The Fuji A500 is perfect for someone who doesn't have much money to spend on a digital camera or that does not require a lot of additional features. Its 5 megapixels and 3X optical zoom will allow for very good pictures.It takes about a second for the camera to shoot the picture once you have focused on the subject, though, and the LCD display's refresh rate is rather low, so if the subject moves you may not get the picture you expected. And the camera uses 2 alkaline AA batteries, that won't last too long, so it is a good idea to buy a kit of rechargeable batteries.One advantage is that you can get an underwater housing for this model for about 6 dollars! Such an item can come really expensive for other models and / or brands.May 29th, 2008Well ... It's been about a year since I bought this and I haven't had any problems AT ALL with the camera and I've taken some great pictures with it. I haven't used the water housing yet! It's still in the box. LOL. I have searched for it and it's now a lot more expensive - I am now planning to upgrade to a Fuji S700!", "Date": "May 12, 2007"}, {"Title": "Alright for beginners.", "Author": "Mr Innocent", "ReviewID": "R1HZTHB1U2QBBI", "Overall": "3.0", "Content": "I recently purchased this camera for a number of reasons.1. Price2. I am a Mac user and this camera is compatible3. I previously owned a Fuji and was happy with itI am prety happy with the camera overall for what I paid for it, but there were a few things I didn't know about before.1. Terrible battery life2. Extremly expensive XD cards, which are hard to find on vacation3. Cost, I bought this camera a couple months ago for 200 and now I seen one for about a hundred and ten bucks...which I guess is a great deal for anyone wanting one now.", "Date": "March 21, 2007"}, {"Title": "Good Camera", "Author": "R Quin", "ReviewID": "ROU0ILSWUT7ZN", "Overall": "3.0", "Content": "This is a good camera!It is small, discrete, great pictures, easy to use.One disadvantage is recording without sound.", "Date": "January 9, 2007"}, {"Title": "Nice camera for the cost", "Author": "J. Rose \"Woodworking is fun\"", "ReviewID": "RJ2G08QLJ6PSH", "Overall": "4.0", "Content": "Cons: Xd Cards, zoom button, I would like more buttons on the back for various options, such as delay timerPros: Small, great pictures, very easy to use.", "Date": "January 3, 2007"}, {"Title": "Terrible Customer Service!!!", "Author": "C. Allen \"Jason Logue\"", "ReviewID": "R1KK5FA22PC1C5", "Overall": "1.0", "Content": "The camera is fine as long as nothing goes wrong. Fuji has the worst customer service I have ever delt with. They pass you from one person to another and do everything they can not to help you. Be prepared to deal with the worst customer service in the business. I really hope this helps you.", "Date": "December 23, 2007"}, {"Title": "It broke within three weeks", "Author": "J. Vandegriff", "ReviewID": "R16YY2BKOEM32Y", "Overall": "2.0", "Content": "The camera stopped functioning within three weeks of purchase.  It would no longer close or zoom.  It did however take excellent photos while functioning, so it doesn't get the worst rating.  We are still awaiting the camera's return from Fujifilm.  Sigh.", "Date": "January 5, 2007"}, {"Title": "Disappointed", "Author": "N. Young", "ReviewID": "R38XCND0CAVAXZ", "Overall": "2.0", "Content": "I am a little disappointed in the product.  Having owned another Fuji digital (which I loved!)and going by the customer reviews I thought this would be a good little camera. Picture quality is excellent, but it is really poor on getting candid shots.  The shutter activates so slowly that you don't get the picture that you thought you snapped.  Good for outdoor scenery and stills.  Not so good for photographing the grandkids!", "Date": "December 26, 2006"}, {"Title": "Great Price - Works Perfect - Thank You!", "Author": "Chuck Enslin", "ReviewID": "R258BIFFEEG1WR", "Overall": "5.0", "Content": "This is a great low cost solution for an accident kit camera.  Camera takes a good quality picture and uses 2 regular AA batteries.", "Date": "August 19, 2013"}, {"Title": "Great Little Freebee Camera", "Author": "D. Nick", "ReviewID": "RCC38SJQFFMJ4", "Overall": "5.0", "Content": "I was in the market for a new digital camera. My Canon 2.1 MP camera works great but wanted a higher MP digital camera. I found this Fujifilm A500 in my front yard one day. I turned it on and got a \"read error\" on the screen. I took it in the house and formatted the card in the computer and put new batteries in the camera and turned it back on. I re-formatted the card in the camera and it's been working great ever since. It seems to have decent features, especially for the price I paid... And takes good pictures. It holds 205 pics at the highest resolution with the 512 Meg XD card that was in it.", "Date": "July 18, 2009"}, {"Title": "great for 1st timers", "Author": "M. E. Miller", "ReviewID": "R10C0NU9NXRUVT", "Overall": "4.0", "Content": "as my first digital camera it was amazing. id recommend it for anyone as a first camera. it lasted thru quite a few drops (i can be clumsy @ times), and took great pictures overall. i also used it to take pictures of pictures (my quick way of digitizing older 1980's & 90's printed pictures) and after a few tries i always got a clear shot. i also used at concerts and the zoom is surprisingly clear, as long as u steady the camera. the pros outweigh the cons in my opinion and the only reason im getting rid of it is cause im ready to upgrade. i gave it to another first-timer.pros:-clear colorful shots (incl. pictures of text, scenery, other pictures, etc)-lost of functions to play with-image editing from cameracons:-not good for dark lit places-when shooting multiple simultaneous shots it sometimes stalls-close-ups sometimes blurry-no sound when shooting video-flash is unusually bright", "Date": "June 15, 2009"}, {"Title": "Fujifilm Finepix A500 5MP Digital Camera with 3x Optical Zoom", "Author": "Cheryl A. Bohley", "ReviewID": "R2RHCPATRWX60S", "Overall": "5.0", "Content": "My granddaughter was so excited with her first  camera.  She immediately started taking pictures.", "Date": "December 12, 2008"}, {"Title": "Opinions a year later", "Author": "SpeedoNJ \"Len\"", "ReviewID": "R1J99HRX7GW3IC", "Overall": "4.0", "Content": "I bought this camera at a grocery store a year ago as a substitute for the Olympus they had run out of and it had higher megapixels. So I used it last Xmas and the pictures in doors and out were okay but not remarkable.Then I went to an early season Yankees game this year (they won 1-0 vs Tampa Bay) and my 35mm had a suddenly dead battery, so this was all I had.  Luckily I had sprung for a bigger memory card, even though it's xd instead of sd so it can't be used i9n many other cameras.And the pictures came out okay of monument park and the field, although I wish it had more than 3x zoomPlus, my computer has a slot for xd cards, so no harm done and Picasa seems to make everything look better than Vista.All that being said, it's a year later and this is a back up at best, the price is now down so if it's a $70 camera you want, this may be your baby cause I have no real complaints.  BUT if you want to go to about $100 get a Nikon L18, same size, pixels seem to matter between 5 to 8, colors and zoom work well.Final disclaimer: my reviews are always personal impressions and not based on techical knowledge, you can get that anywhere. And I'm an easy marker for the stars.And with $$$$$$$$$$$$$ for new pitching, the Yankees will win  the World Series again in 2009- Remember baseball fans go to see their team play, Yankees fans go to see their team WIN!!!!!", "Date": "November 24, 2008"}, {"Title": "Not so great color", "Author": "thinker", "ReviewID": "R4U4SN9CRVGEM", "Overall": "2.0", "Content": "I used this several times, took about 50 pictures with camera, I was disappointed.Compare to my old Fugi A201(2 mega pixel), this A500 does not have good color; it may have better resoltion but the color on photo are not as good as A202.When I checked the spec on those 2 camera side by side, A201 has RGB filter on CCD while A500 ihas just high resolution CCD.Anyway, A500 is disappointment.", "Date": "January 8, 2008"}, {"Title": "Lovin' it!", "Author": "Sheryl A. Mccomb \"Mustard Seed Christian Stores\"", "ReviewID": "R8BOY28VSZAHV", "Overall": "5.0", "Content": "My first digital camera, and so far I'm havin lots of fun with it!  I still haven't used all it's many features as yet, but I would recommend this camera to anyone!  I was surprised to find out that my sister, who is a professional photographer, has this exact camera for her personal use.  She also loves it!", "Date": "October 13, 2007"}, {"Title": "Nice little camera and great value", "Author": "Sharon Raber", "ReviewID": "R1R8CS9AWL9E1S", "Overall": "4.0", "Content": "Great camera for the price... pictures are sharp and clear and it is easy to use!", "Date": "October 3, 2007"}, {"Title": "Satsfied", "Author": "L. Campbell \"L. Campbell\"", "ReviewID": "R1N59C8VMKTBVO", "Overall": "4.0", "Content": "This is a good affordable camera.I really don't have any complaints.Just make sure you don't buy any cheap batteries,cause the camera wont operate or go off after a lilwhile.I personally use the lithium batteries with thiscamera and they last me for a long time dependingon how often you use the camera.", "Date": "September 17, 2007"}, {"Title": "So Far, So Good", "Author": "Stacy M", "ReviewID": "R3OORNQIL8UA5T", "Overall": "4.0", "Content": "I just got this camera, and I haven't fully explored its range yet, but so far I'm happy with it.  This is my first digital camera. It's a light-weight, compact camera that makes it easy to take along.  It was very easy to start taking pictures and install the software on my computer.  I just took it with me on vacation in New Mexico and got some great outdoor shots in a wide variety of lighting conditions, and I've also had success using it indoors.", "Date": "August 15, 2007"}, {"Title": "Great Little Camera", "Author": "Artemis", "ReviewID": "R2DDMN0ADHTKGJ", "Overall": "4.0", "Content": "I love this camera in every way except the power button, which is very tiny even for 5'3\" me. Also, you cannot always tell in bright lighting if the picture has taken, although it usually has.What I love is its size and the quality  of the pictures - inside and outside.Downloading from it is a simple process.Buy it.", "Date": "June 27, 2007"}, {"Title": "Awesome results for the price", "Author": "Kelly C. Childers", "ReviewID": "R37SG0377VDVJ4", "Overall": "5.0", "Content": "I am currently building a house and wanted a good, quality digital camera without spending a lot of money.  After almost a week on constant research, this camera was always in the running when searching through everything that was out there.  I was able to purchase this camera and a 512mb card for under $100, and the quality is amazing.  I would recommend this little workhorse to anyone.", "Date": "May 12, 2007"}, {"Title": "Fuji Finepix A500", "Author": "W. Kulterman \"Chi_Bill\"", "ReviewID": "R13Q26FLRPAXI1", "Overall": "5.0", "Content": "I love this camera.  It's small, lightweight, easy to use.  I take it everywhere.", "Date": "May 9, 2007"}, {"Title": "Excellent buy!", "Author": "Ariel Jacobs", "ReviewID": "R1FG2XNTLXQ0SS", "Overall": "5.0", "Content": "I bought this camera for my boyfriend as a gift and he loves it. I'm actually thinking I want one for myself. As far as a basic digital camera, this one is perfect. It takes decent shots, is light, easy to use, and cheap!! I highly recommend it to people who are one a budget or don't need state of the art equipment.", "Date": "May 9, 2007"}, {"Title": "Good Camera for $88", "Author": "J. POLCHOW \"Hockey_Ogre\"", "ReviewID": "RHLVO17UI7MF9", "Overall": "5.0", "Content": "Its a nice little point and shoot for $88pros:-------small & lightweightdecent zoomeasy to use without reading the manualAA batteries for power - easily replacablecheap $6 uw housing  - that's why I bought it, to use underwater see link to WP-FXA500Fujifilm WP-FXA500 Aquamask Underwater Housing for Fuji A400 and A500Has movie record option with sound, records in AVI formatDOESN'T eats batteries like a hungry fat woman at a free unlimited buffetcons:--------xd card  - a little pricier than CF cards  - use type H for max memory speed/capicitymanual exposure option complicatedno flash exposure adjustment, just on, off, red eyehighest iso 400 (cmon fuji - where's at least 800?)movie option grainy and poor in low lightoverall worth every penny of $88.", "Date": "April 17, 2007"}, {"Title": "Fuji have gone really cheap", "Author": "Graham S. Sherrington \"cyberphobia\"", "ReviewID": "R31930HHIBCLIP", "Overall": "2.0", "Content": "No rechageable batteries,no dock, no web cam feature why did I ever buy this.The zoom on it sucks.Should have stuck with my A340", "Date": "January 30, 2007"}, {"Title": "Excellent camera", "Author": "Denise", "ReviewID": "R14QZZ111TYGRI", "Overall": "4.0", "Content": "This is the second digital camera I have owned and I LOVE IT.  It is small, sturdy, and light weight.  I can fit it in my purse easily.  The picture quality is very good.  I did purchase additional memory to hold more pictures.  It is a very good deal for the price.  The only thing that is a little too small is the on/off power button.", "Date": "January 17, 2007"}, {"Title": "Gets the job done....", "Author": "T. Perez \"T.Perez\"", "ReviewID": "R1L0M8FIW3OQ0N", "Overall": "3.0", "Content": "I had never owned a digital camera before purchasing this camera, so I have nothing to compare it to. For a long time I has simply been using my creative cam as a camera and in comparison the Fugi does provide better quality.What I have noticed is that you have to be pretty close to what you're shooting in order for this camera to be effective. The zoom doesn't off much help unless you are already pretty close to what you're taking a picture of. It takes close-ups just fine. It does not work well in poorly lighted conditions.You have to have A LOT OF BATTERIES!!! I have found that I am left high and dry unless I have at least 2 packs of 10 batteries just to take pics at the beach.I have not replaced this camera yet, but I plan to.  I wish I had listened to the many, many reviews that said to spend that extra 50 bucks on a better camera.It gets the job done, but I can't wait to see what a better camera can do!", "Date": "May 12, 2007"}, {"Title": "A waste of hard earned dollars", "Author": "Neil H. Schwartz", "ReviewID": "R1BGJ9ZREO0U62", "Overall": "1.0", "Content": "This is my second Fuji Digital Camera.  The first one failed with a \"ZOOM ERROR\" after only a few months of average use. The camera was useless.  I returned it to the place of purchase, and of course the model is no longer in production.  After an argument with the store manager, they allowed me to trade up to the newer model, charging only the difference.Well After about a year of average use, I got the exact same \"ZOOM ERROR\" message on the newer model.  I do not want to pay $250 every two years for a camera, so this  will be my last FUJI purchase.  When I spend money, I expect reliability, and FUJI misses the mark!", "Date": "March 9, 2008"}, {"Title": "Fair value", "Author": "Rayan A. Almeida", "ReviewID": "R1GFG4HWHEHPCX", "Overall": "3.0", "Content": "The camera looks and feels cheap. But for less than 100 bucks you may not get anything better than this.", "Date": "May 30, 2007"}, {"Title": "Broke within 3 days", "Author": "Jana Clevenger \"iowa2nj\"", "ReviewID": "R12ON54X18CV0I", "Overall": "1.0", "Content": "I have another Fuji Digital camera which has been fine for several years. I bought this one for my teenage daughter for her birthday and within 3 days of using it , the shutter button stopped working. Amazon paid for the shipping back, no problem, but cannnot replace it with a new one because they won't be stocking any more of this model . This leads me to believe that I am not the only one that has had a problem with this camera. Research others as I would avoid this one even though the price is good.", "Date": "March 10, 2007"}, {"Title": "poor reliability", "Author": "Mr. Terry Reysbergen", "ReviewID": "R1U6JVALOJ3GNL", "Overall": "1.0", "Content": "I owned this camera for a bout 8 months and took very good pictures. Than out of the blue I got a focusing error and the lens would not detract. The product is out of warranty and would cost too much to repair. I will never buy this product again.", "Date": "December 21, 2007"}, {"Title": "Perhaps I just got a lemon but I preferred my 2.1", "Author": "Karen L. Sargent \"KarenBZ\"", "ReviewID": "R260B1OIC1ILG5", "Overall": "1.0", "Content": "I have found that MOST of my photos with this new 5.1 are NOT very good at all.  I MUCH preferred my older A2600 which was a 2.1.  The pictures were fabulous with my old camera.  I noticed shortly after getting the camera and taking several photos with it that many of my pictures were blurry.  I sat and read the manual to ensure that I wasn't doing something wrong.  If I do closeup pics, they are very nice, but general photos are most often blurry and horrible.  It's incredibly disappointing.  If I could just replace my old camera I would except that they don't make it anymore.  I used to rave about my old camera, but I am NOT happy with this one at all.  I am going to have to send it to the manufacturer to have them check it out and fix it.  What a PITA since I bought it brand new!!!!!Good luck to everyone else - I hope you have better luck than I!!!!", "Date": "January 4, 2007"}, {"Title": "Sweet! Digi Cam Hero! Got stars in my eyes!", "Author": null, "ReviewID": "R14AMD9WP7GYWT", "Overall": "1.0", "Content": "I am giving it 4 stars...I got this camera today and it is really small compared to my old hp 315 camera. It takes great pictures but the shutter takes a while to snap things like a cat. It has no sound for video ): that realy hurt me but I got used to  it I bought this for a digi not a video. The battries drain if you leave the LCD on a long time...1 hour latter my battries were dead but I was taking alot more videos than pics. Then the ISO settings suck and a dumb I mean up to 400 I would spend more that 40 bucks for this camera which I did get it for that price. I would get a cannon or kodak for a little more money but his camera is great for 40 bucks! so in the end 0 stars, Hope this helps.", "Date": "April 4, 2007"}, {"Title": "No Sound on the Movie Clips (Yuck)", "Author": "Bruce A. Greenwald \"Music Reviewer BG\"", "ReviewID": "R4XWTPH192U1Y", "Overall": "1.0", "Content": "Great photos, Bad movie clips due to lack of sound.", "Date": "November 17, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.0-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n1.8-inch LCD display; 3x Fujinon optical zoom lens\nSuper CCD sensor enhances vertical and horizontal resolution, color, and more\nLCD's anti-glare coating increases visibility in direct light\nPowered by 2 AA batteries; stores images on xD Picture Cards", "Name": "Fujifilm Finepix A500 5MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51VZ8PWGZ1L._SY300_.jpg", "ProductID": "B000DZS20M"}}