{"Reviews": [{"Title": "Takes great pictures, excellent features...", "Author": "Elan", "ReviewID": "R1VH397UH6ZG4Q", "Overall": "5.0", "Content": "I just bought this camera as a gift for someone but I got a chance to play with it a bit.  I really like recent Pentax products, I find them to be  much less generic in their design and features than the competition. I own a K10D which is great and the M30 definitely lived up my expectations from Pentax.The indoor performance was amazing, all the pictures were prefectly exposed -- indoors is where I have generally found P&S; cams to perform poorly.  I analyzed the histograms in Picasa and they were perfect, nice peaks in the middle...Also, there are a ton of features on this camera for those inclined to explore and want to play... Definitely a great beginner camera or a light weight alternative camera.", "Date": "August 6, 2007"}, {"Title": "Best camera I ever had. . .", "Author": "Evelyn L. Katerba", "ReviewID": "R72R32G7VC7ZR", "Overall": "5.0", "Content": "I have loved photography for many years.  So when digital cameras came out. . .I just had to have one.  I wanted something that could fit in my purse, be handy, easy to operate, and take fantastic pictures. . . of ALL kinds. ..  including videos. . . and not cost a lot, oh yeah.  I was checking out Amazon one evening and came across the Pentax Optio M30 7.1MP Digital Camera with 3x Optical Zoom.  Everything you need to capture memories quickly and beautifully.  I have taken my pets'  pictures, great shots of my grandsons playing soccer, and gorgeous closeups of my garden in bloom from all angles.  I then can go to my computer and photo printer. .  and print out and frame what I consider works of art. . . with memories attached.  The price was fantastic. .  under $200 for all you could ever want in a camera.  I've created large poster sized pictures of most of my shots.  Pentax has a great reputation and I want to thank Amazon.", "Date": "July 6, 2007"}, {"Title": "Pentax Option M30", "Author": "J. Borzotta", "ReviewID": "R2LZ9QZ0RZGGST", "Overall": "4.0", "Content": "I used to have a Canon, lost it, and got this Optio. Part of the reason I chose a Pentax is because I have a Pentax 35mm from 1982 and it's indestructible! I use my camera for shooting my art to make jpegs, shooting reference, as well as the usual snapshots. I also use it to shoot stuff for Ebay. So far this camera is excellent. Very easy to use which is what I wanted, I didnt need all the bells and whistles. The big viewscreen is great and all the options like flash selection and especially the selections for what type of shot you;re doing are clear and easy. It's also very light. I havent used it in crowd shots yet so I can't attest to the face/focus features they promote. I've had a little bit of shake when shooting some stills for Ebay, but not nearly as much as I did with the Canon. I've had the Optio for a few weeks, and I would defintitely recommend it for the novice as well as the experienced user.", "Date": "August 9, 2007"}, {"Title": "Great in its class - super compact cutie type", "Author": "Luving it", "ReviewID": "R3VBIDU8F73DHJ", "Overall": "4.0", "Content": "Pro:1. easy of use, no need for the manual. all functions logically laid out in the menu system. easy to navigate. very user friendly!2. shake reduction function. very helpful.3. good looking and small size, at a very attractive price.Neutral: nothing really stand out in its performance.Con:1. horrible IQ after ISO 400+ due to excessive, similar to Panasoic slim cams. Be careful doing low light shooting.2. AF is relatively reliable. So is AE. Better than my experience with Kodak, but not as good as Canon.3. I'd say overall the lens is not as sharp as those I found on Canon/Kodak of similar class.Bottom line: a very attractive and affordable ultra slim point-n-shoot good for outdoor normal light shooting. Use caution for indoor shots. Again, I have yet to find a slim cam that can do indoor shots well.", "Date": "July 22, 2007"}, {"Title": "Pleased with this camera", "Author": "Louis A. Rodriguez", "ReviewID": "R3AHKEG0N4WCWW", "Overall": "4.0", "Content": "This is my 3rd digital camera and I am very pleased with this one.  I previously had a Olympus FE-190 and had to replace it because I dropped it while it was on and the lense would not go back in.  It was the best mistake I ever made.  I hated the Olympus camera because of the poor quality of the pictures.I wanted a small camera that we could take on vacations that would take great pics.  The Pentax camera accomplished this and more.  The only draw back I have is that it really doesn't take great pics in dim lighting but  think this is common with any camera at this price range.All in all this is a great product that I found on Amazon at a great price.", "Date": "September 8, 2007"}, {"Title": "Pentax does it again!", "Author": "Andrea Hollander Budy", "ReviewID": "R2AIMSOH6AGYY0", "Overall": "5.0", "Content": "My 55-year-old husband, who for 40 years has taken only slides rather than print photos, purchased this camera in March 2007.  He loves it so much that we purcahsed the identical camera for our son's 30th birthday this September.  Our son has been using the camera for more than a month now, and he is as enthusiastic as my husband.  The camera takes terrific low light shots and it organizes photographs with an easy-to-use calendar.  We'd recommend it to anyone considering a digital camera.  Pentax Optio M30 7.1MP Digital Camera with 3x Optical Zoom", "Date": "October 17, 2007"}, {"Title": "Good Point and Shoot if you get for the right price", "Author": "W. Brown", "ReviewID": "R1PPUWJ5CUR1M8", "Overall": "3.0", "Content": "I shopped this around and got it for around $80 with a 2gb SD card. At that price, this camera is a good deal. I wanted a shirt pocket-sized camera for landscape and posed shots with friends, and that's what this is. Some of my shots came out absolutely terrifically, fit for printing.I would not recommend it even for a toss-in-the-purse camera if, for instance, you want to get shots of your kids on the playground. Many of my pictures with a bright sky background came out with striations. Also, the shutter lag is noticeably longer than even my five-year-old introductory Canon PowerShot (great camera, but not pocket-sized). If you're shooting active subjects outdoors, you'll miss more shots than the $40-$60 price difference (again, assuming an $80 price for this one) you probably need to get a pocket-sized Canon.Evening or low light pictures have problems consistent with all point and shoot cameras.Menu functions were as easy and intuitive as Canon's.I'll try to post a sample of the best and worst this camera did on a trip to Seattle.", "Date": "August 24, 2009"}, {"Title": "Pentax Optio M30 quirk", "Author": "Donn Hilton", "ReviewID": "R1S2QHEJ9CAMK3", "Overall": "3.0", "Content": "I purchased this Pentax a few years ago and it's time to get something off my chest - ITS DRIVING ME NUTS. I have a Canon and it's fine. I can't complain about the image quality, it's fine for the price. The thing I don't like is that it creates a new folder every day you use it and then proceeds to name each picture from the start in that folder. If you open another folder you'll notice that the pictures are named the same way. You can't just copy the pictures from a folder on the memory card into a single directory and do the same with another folder on the mem card, etc. The reason being that each series of pictures will have the same naming numbering.  The result is the next pictures will over write the first. Ahhhhh. Nuts. All you can do is purchase a bulk renaming software package and do some sort of renumbering for the files on picture files from the memory card.", "Date": "August 26, 2011"}, {"Title": "Buy this camera", "Author": "Benjamin Zeichick \"Big Spring Ben\"", "ReviewID": "R3R3X9RN9QXERW", "Overall": "5.0", "Content": "I got this camera with a very good deal, including a 2GB SD card.  You will love this camera, it is very nice looking, takes really good photos, and interfaces with windows vista (which I use) perfectly. It seems to be last year's model, not that you can tell the difference.  Even the instruction book is for once easy to read.I did a lot of research before buying, and each camera has very mixed reviews..one review will say that a camera eats batteries, the next person says they get great battery life..so you don't know what to get. Same with picture quality, etc. etc. etc.  Finally I settled on this one and I am really glad I did.  It was good enough to get me to actually do a review!Shop around, the prices are variable to some extent. I paid 69.99 delivered and with the SD card and couldn't be happier with this.", "Date": "March 6, 2009"}, {"Title": "Just awesome!", "Author": "Kimberly A. Miller \"Or husband Steve!\"", "ReviewID": "R3LKIA0OMGDFME", "Overall": "5.0", "Content": "Funny story... My daughter had this camera summer 2007, I got used to using it (stills, video, audio tags, etc) I just had to get one for myself! After taking the time to learn all the functions I use it all the time. Compact enough to put in my pocket, durable enough to handle sitting on it if it was my back pocket! Took it to Rio Brazil and it did awesome!! Negative comments on using it in low light or dark... they were just not doing it right or not patient with the operation. I took night shots of Rio from The Sugarloaf that were beautiful.Transferring pictures is easy, use the supplied cable or remove the SD card and use your card reader (if you have one!)Get this camera, get an SD card (2GB or more) and enjoy! You will not be disapointed in your purchase and now the price is even lower!!", "Date": "June 22, 2008"}, {"Title": "This is my \"BABY!\"", "Author": "B. Williams", "ReviewID": "R1A4O9XIE0OMIL", "Overall": "4.0", "Content": "Ever since I ordered this camera last year I've had more joy than I could imagine.  Anything and everything can be done with this from video, audio, and of course, pictures.  I always have it handy in my pocket and I've captured so many aspects with it.  I truly love it.With just a ONE GB SD memory card, you can take up to 5,000 pictures, 30 minutes of video, and 24 hours of audio.  WOW!  There are different simple settings--most with a brief description of what effects it gives.  This camera is so simple.  SO VERY SIMPLE.I have ONE dislike about this great camera:It uploads the videos in QuickTime and I have a Windows based computer and I cannot upload it to my Windows Movie Maker.Otherwise, I'm getting a bigger memory card so I can have MORE fun with it!", "Date": "November 21, 2007"}, {"Title": "exactly what I wanted", "Author": "August West \"Julian\"", "ReviewID": "R1TJ4MKQPFAST2", "Overall": "5.0", "Content": "Was replacing this camera with a previous one that I dropped. It was perfect, exactly as advertized, and came very quickly.", "Date": "April 3, 2013"}, {"Title": "Great Camera", "Author": "Johnson", "ReviewID": "R153UPXVM56STA", "Overall": "5.0", "Content": "A friend bought this camera for me almost 7 years ago. Recently, I dropped it and am so upset with myself for being clumsy. I really love this camera. The quality is great; it is easy to handle, and the battery life is great as well, in additon, the download is a piece of cake. I will definitely purchae future items by Pentax. Best camera I have ever owned!!", "Date": "October 27, 2012"}, {"Title": "Great compact camera!", "Author": "C. Falquist", "ReviewID": "R3JAP4TFYIZLIM", "Overall": "4.0", "Content": "I purchased this camera to have in my purse when I am out and about.  It isn't logical for me to lug around my big Sony, so I wanted a camera with easy to use features that was not going to feel like a piece of junk.I have a 35mm Pentax camera that I absolutely love, so I decided on the Optio M30.  This camera feels solid, despite it's tiny size.  the LCD screen on the back is very clear and easy to see.  The menus are logical, easy to set up, and picture quality is excellent.I don't mind having to take the battery out to charge it.  I have to take my batteries out of my Sony to recharge as well.  As far as battery life, I have been taking photos for several days, and the battery still doesn't need to be charged.The only thing I would say that is a downside on the camera is the shutter delay.  It takes a while holding the button before you actually get a pic, but I didn't expect lightening fast capture in a camera of this price.All in all, a nice little camera.  I will put it to the real test this weekend in Vegas.", "Date": "February 16, 2009"}, {"Title": "Good Camera", "Author": "Pickone \"Pickone\"", "ReviewID": "R3KYAH6W1ILSNI", "Overall": "4.0", "Content": "Recently purchased camera for my daughter, simple to use withoutreading instructions, picture quality good, large screen, probablyas good as kodak z710 recently purchased for twice as much, and hasmore features. Very small also.", "Date": "February 26, 2008"}, {"Title": "Slow on the trigger", "Author": "Steven M. Schmidt \"adaaric\"", "ReviewID": "R2N09XMRQVVIAN", "Overall": "2.0", "Content": "This camera recently broke due to a fall down some stairs and I felt relieved that I could justify buying something else.  It took good pictures, but the lag time between pressing the button and the shutter firing was horrible.  Getting any kind of action shot was impossible.", "Date": "February 26, 2008"}, {"Title": "anyone else's battery go bad on them?", "Author": "Stephen Hoopes \"slhoopes\"", "ReviewID": "R3UMVUKGLTSJHD", "Overall": "3.0", "Content": "I got this camera about 5 months ago and just recently the battery won't hold the charge, anyone else have this problem? Prior to that it's been a great camera, besides not having a cradle to charge the whole camera (you have to take the battery out and place in battery charger).", "Date": "May 29, 2007"}, {"Title": "It will loose all of your pictures!!!", "Author": "Mark Conde", "ReviewID": "R2719O74TON0AP", "Overall": "2.0", "Content": "I really loved this camera when I bought it earlier this year until it totally lost all my pictures by doing something to the SD card. Be carefull with this one because it did ths to me repeatedly with different SD card sizes and brands. Its too bad but I lost some spectactular shts on a once in a lifetime trip because of this.", "Date": "December 21, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "7.1-megapixel CCD captures enough detail for photo-quality 15 x 20-inch prints\n3x optical zoom (with high-ISO shake reduction); 2.5-inch LCD display\nPhotograph from as close as two inches away in Super Macro mode and and four inches in Auto Macro mode\nMovies at 30 frames per second at 640 x 480 resolution\nStores images on SD or SDHC memory cards (21.9MB internal memory included); powered by li-ion battery (battery and charger included)", "Name": "Pentax Optio M30 7.1MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41zZE69eN7L._SX300_.jpg", "ProductID": "B000LY2GP2"}}