{"Reviews": [{"Title": "Great Camera", "Author": "Aaron \"Cfffntc\"", "ReviewID": "R2C846M5ALI0GL", "Overall": "5.0", "Content": "Ive had this puppy for about 3 months now and its great. Not sure what all the complaints are about blurry pictures because it has a feature called stabilization mode which prevents blurry pictures from taking place. There are over 20 different scene modes which allow you to adjust on the fly. I've been able to take pictures for landscapes, family photos, and goof around with it. Me and a friend were able to navigate the menus and take photos with one hand because the other hand was being used to ward off the other person from trying to take the camera. This is a fun and easy to use camera. Shutter speed is slow and if your taking pictures without the stabilization mode you need to hold the camera correctly and squeeze slowly for the shot. Being that its as small as you can get for a camera this isn't anything unexpected. Good bang for your buck.***2 -yrs later*** Camera is still holding up strong and taking great pictures.Cons: Battery life is abysmal. If I leave battery in camera without use, it is usually dead by the time I get around to using it. Bought an extra battery with charger so I can swap it out when I need to. Can't tell you how many times I've gone out and took a couple of pictures before the battery died. Other than that, it's a good camera.", "Date": "March 29, 2009"}, {"Title": "Good", "Author": "Linafer", "ReviewID": "R18W7D2HP9ES9J", "Overall": "4.0", "Content": "I wanted an underwater camera for when I dive but didn't want to spend to much and didn't want a huge camera.  For the price and the size this camera is good.  It takes good pics.  The closer you get to what you are taking a pic of the better.  Also it will take a few seconds for the pic to be taken after you push the  button.  Also you have to be steady when you take the pic.  But overall I have liked the pics that I have taken.", "Date": "January 11, 2009"}, {"Title": "Battery Life not that great", "Author": "Linda", "ReviewID": "R2KT81SSRE5DQE", "Overall": "3.0", "Content": "I'm a little disappointed with the battery life on this camera.  I've had other cameras that have lasted alot longer.  I just used it tonight for a night parade and kept it on inbetween floats and it only seemed to last about 30 minutes.It could need a replacement battery but it is only 3 weeks old.  It works great for outdoor daylight shots, but doesn't really do that great in low light even with a flash.Is is okay for the money, but I would recommend that you save the extra money and get a little more expensive camera.", "Date": "December 13, 2008"}, {"Title": "Does it get any worse than this camera?", "Author": "K. S. O'Reilly", "ReviewID": "R3132ZX7VVOUEY", "Overall": "1.0", "Content": "I have an Olympus 510 (digital SLR) which I am very happy with (when I'm being a tourist) but wanted something small it take to dinner etc and take snapshots of friends (you look silly at a party with a full sized camera).I thought sticking with Olympus would be a bright idea (I have had problems with other brands).  The guy at the store seemed to think this camera would be great for my stated need.What I got can only be described as CRAP.It is unbelievably slow, I miss shot after shot.Every single photo I took at night was either out of focus or completely overexposed; the results were even worse when I had it set on \"night\".The photos taken during the day are better but are not crisp.And to top it off it has a fault (not sure if it is just my one or all of them) half the time when I turn it on it just doesn't work ... red power light is on but none of the buttons work, plus you can't turn it off ... only solution is to remove the battery for a minute.The store I got it from has been zero help ... apparently it is my problem that I was dumb enough to listen to their sales staff.  All up this camera has been a HUGE disappointment.Olympus is capable of making a great camera but this is not one of them.", "Date": "January 10, 2009"}, {"Title": "Olympus Camera", "Author": "Amazon Customer", "ReviewID": "R17NHC045O9865", "Overall": "5.0", "Content": "I previously owned a Olympus camera and this one just happened to be a updated version. My old camera stopped working one day and never came back on. So I purchased this one off of Amazon and I love it.", "Date": "November 4, 2009"}, {"Title": "Keep looking... this one's not worth the money.", "Author": "Shannon", "ReviewID": "RA2RC1T5P17N6", "Overall": "2.0", "Content": "We have had an Olympus Stylus 710 for three years and I've really loved it with the exception that the battery door cracked a few months ago. According to Olympus' customer service department it was going to cost over $100 to have it fixed. Rather than mess with that, we decided to upgrade our camera for about the same price. We saw a sale ad for the Olympus FE360 and decided to go for it. After all, we loved our old Olympus, and this one is several years newer with 1 more MP than our old one, so it should be even BETTER, right?Yeah, not so much.I can't even begin to explain how horribly disappointed I was in the FE360. The shutter speed is AWFUL. It's even slower than our original digital camera from seven years ago, and it's WAY worse than the Stylus 710. I kept telling myself I must have been doing something wrong... so I re-read the manual and I was doing exactly what it said to do. How could a newer camera be *worse* than our old one of the same brand? I'm not sure what they did, but they managed it somehow!Even so, I decided that I'd give it a few days and now I'm kicking myself. I took all our Christmas pictures with it and they are ALL dark and many are blurry. I missed so many \"Kodak moments\" because of the delayed shutter action, and the ones I did end up with aren't even a good quality. We have two young children and any shot with the slightest movement in it was ruined. Thank goodness for PhotoShop b/c I was able to salvage a few of the clear but dark ones. It was almost as if the flash wasn't strong enough or have a long enough range. I took over 100 pictures with this camera and about 80% of them were total flops. Our kids have blue eyes so we're used to dealing with red eye to some degree, but this was just crazy. I could probably have dealt with that aspect if it was an easy fix after the fact but the red-eye reduction tool was completely worthless as well.Another complaint, the cord that you need to connect the camera to your computer to upload pictures is no longer the standard USB cord. It's similar but smaller. What a pain! As if I need one more cord coming out of the back of my computer...One more warning, beware of Olympus' customer service. After deciding to return the FE360 and get my money back I did more online research to find out about fixing my old Olympus Stylus 710. As it turns out, the battery cover I had had an issue with is a VERY common problem across the board with many Olympus digital cameras. It also turns out that although Olympus claims you have to send your camera to their service department for repair, and that it will be a flat rate repair cost of $105 to fix it (no matter what your repair is), and that you cannot order the part and fix it yourself... I asked the customer service rep this question specifically... you actually CAN order the part yourself but not from Olympus. I found it online for $22 from an independent vendor and my old camera is as good as new. All it took was a small screwdriver and about 3 minutes to replace that piece.Don't jump the gun and buy this camera just b/c of the reasonable price. Look at Consumer Reports or another consumer product rating guide and make sure you know what you're getting. Also, make sure you order your new camera from a place that will accept returns unconditionally. I saw several places that charge a 20% \"restocking fee\" if you decide to return it.", "Date": "January 2, 2009"}, {"Title": "not  bad", "Author": "mb \"mb\"", "ReviewID": "RZW4U56JKM9JV", "Overall": "4.0", "Content": "cons:buttons are too small for efficient selectionmenus have to be navigated multiple levels to reach desired settings areaGUI look is badcard writing is a bit slowpros:not bad for the price", "Date": "November 21, 2008"}, {"Title": "perfect giflt", "Author": "Lab \"Chocolate\"", "ReviewID": "R2W1IPO1HTT0WE", "Overall": "4.0", "Content": "Bought this for an Olympus fan to hold him over till he can replace his 500 dollar camera.  It gets use as a tool for the family pictures and does fine.  Afraid it doesn't replace his number one camera but it's name  is truely respected.", "Date": "January 31, 2009"}, {"Title": "Great Little Camera For Traveling", "Author": "Melli \"Racers7\"", "ReviewID": "R4XUNCO9DQLT6", "Overall": "4.0", "Content": "I love this little camera.  I received it as a gift and had it for 2 years.  It finally got sand in it from the beach and doesn't work well but I would like to get another one.  The pictures are not bad although I'm not good with the features.  Some of the pics are blurry if you use the incorrect settings.  The video is great and the sound records at a good audible level.  The battery life was good for a day of picture taking (at least 30-40 pics).  With a flash the battery goes down after the 5th or 6th pic (you can squeeze several more out of it if you cut the camera off immediately after taking each flash picture). But I'm the type of person who organizes all electronics on vacation so everything is charged at night ready for next day.  I also love the cut and crop feature on the menu.  The only cons I see are the USB cord (to your computer) is very short, the 2 sec delay shutter speed and there is no way to delete all the pics through your camera unless your download program has a \"delete all\" pics after transfer which I use from my HP printer.  But all in all for the price it works well.", "Date": "August 10, 2010"}, {"Title": "I LOVE IT!", "Author": "Whitney Richardson \"WHIT\"", "ReviewID": "RTZR048H233XH", "Overall": "4.0", "Content": "I purchased this camera about two year ago and I'm still using it to this day. I compared it to some of the other brands and it was definitely my favorite. I take it everywhere I go and it is very durable. The quality of the pictures are great and it also records video with sound. It is also very user friendly and contains many features that can be used to help improve the quality of your pictures. If it matters, it's also stylish and comes in a variety of colors for those who like to be fashionable.The only thing I don't like about the camera is that the battery is drained rather quickly. Overall this is a great camera and I am happy I purchased it. I love it and wouldn't trade it for any other!", "Date": "October 28, 2009"}, {"Title": "Too slow", "Author": "Gideon'smom*of*4", "ReviewID": "RBL0QZIZK968O", "Overall": "1.0", "Content": "I bought this camera and ended up sending it back the next day.  I need a camera just to capture family moments and I take lots of pictures of my 19 month old.  The shutter speed was way too slow and I never was able to capture the moment as it happened.  I had to hold down the button for a good 3 seconds before it took a picture.  I know that does not sound like a long time but when your taking pics of a moving toddler it makes a huge difference. Also the software was a pain and there was no easy way to erase the memory card after transfering pics.  I'm starting to think my old kodak was'nt so bad.", "Date": "March 5, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "0.7\" Super-Slim, All-Metal Body\nFace Detection\nDigital Image Stabilization\nLi-Ion Rechargeable Battery\nAVI Movie with Sound", "Name": "Olympus FE360 8MP Digital Camera with 3x Optical Dual Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41G84-uBi2L._SX300_.jpg", "ProductID": "B001DFJEJE"}}