{"Reviews": [{"Title": "Great for traveling", "Author": "Elinor Dashwood \"Elinor Dashwood\"", "ReviewID": "RW61A4AEYU81F", "Overall": "4.0", "Content": "I bought this camera in preparation for a sightseeing trip I took to China. I've never owned a camera before and it was **easy for me to use** this one. I still have to learn how to use the manual settings, but it **took some really good pictures** even just on the auto and no-flash settings. The pictures looked so nice that several people on the trip with me who saw how the pictures looked asked me to burn a cd for them even though they were taking their own pictures with their own digital cameras.It is **not too bulky** and **not too heavy**.My favorite pictures are the **landscapes**, **portraits**, **photos of water**, and **night lights**.The **battery life** was wonderful. I had the camera on most of the time every day, reviewed the photos frequently, charged the battery every other night in hotel rooms, and I never ran out of battery at an inconvenient time. I charged the battery without a converter in China, which has 220V power as opposed to America's 120V, and the higher power did not have any negative effects.These good things far outweigh the bad things, which are few but worth mentioning for those who are considering buying this camera.As some other people mentioned, there does seem to be a **slight warp** in the corners of the photo sometimes, but I can't tell if this is because the subject moved or if the angle was weird for the photo or something. It isn't noticable, however, unless it was someone's face.Carrying the camera around my neck by the strap all day for twelve days gave me **rope burn**. Just a caution.The photos that DID NOT turn out very well were **portraits in dim lighting** and **photos of moving objects**. This camera does not take very good pictures from a moving vehicle like a bus or taxi, and photos taken in dim lighting were either blown out by the flash or blurry without it. It may be that I just haven't learned how to use the settings well enough to prevent this, however.", "Date": "June 11, 2008"}, {"Title": "No regrets", "Author": "Tee Ball \"Frank Lee Speaking\"", "ReviewID": "R7E1SUWE4DWX0", "Overall": "4.0", "Content": "There are hundreds of reviews for the Nikon D40 just on Amazon. Tons more at various other websites. Lets keep this simple. If you are disappointed with the best pictures you are getting with your current digicam, buy this camera. If you have the needs of a pro...don't. My previous cameras included Casio QV8000, Canon S1 and Fuji S6000 and this SLR is a quantum leap from those clickers in photo quality. Don't be intimidated by the manual settings and controls on this unit. Just put 'er in auto, shoot and be amazed. The pro level settings will still be there when you are ready to take the next step.The Nikon D40 with the 18-55 and 55-200mm lenses is an unreal value. From everything I've read, the stock lens beats the Canon's kit lens, and it's cheaper. The 55-200VR lens has allowed me to get some awesome wildlife photos, and is so useful for sports and endless other uses like moon shots. I loaned this camera to my brother, who was using a big zoom Konica Minolta Z5, and he had a D40 within days. The SLR format means no shutter lag, and the possibility of 2.5 frames per second, and that means not only that you will never miss the shot, but you'll get shots you never thought possible.Finally, don't be sucked into the megapixel marketing hype. Six is plenty... it's quality that counts here, not quantity. If you yield to the hype and get 12MP, then drop some more cash for a bigger hard drive for your Dell, because you are gonna be amazed how many more pictures you take with a fast camera, especially on continuous shutter.The ups:  *Value! At around $600-700 with two lenses, WAY more camera than any digicam, and cheaper than it's SLR competition.  *Photo quality. Good lenses and great resolution at the price.  *Small for an SLR.The downs:  *Small body means small grip, and it's textured but not tacky like my old Fuji's rubberized grip.  *Zoom action on lens is not very smooth. A little herky-jerky.  *No LCD viewer. Yes I know it's not SLR purism to want this feature, but it's so handy for overhead and odd perspective shots that I do miss it on the moments when I want to shoot in stealth mode with camera in lap, or a macro at ground level. BTW, Olympus has this feature on an SLR.In summary, if you have aspirations of going pro, look elsewhere, but if you just want excellent pictures and a couple of good lenses may be all you will ever need, don't blink. Buy the D40. Also, if you want to warm up your indoor photos, get the SB400 bounce flash. You won't believe how it improves your portraits. Read the Nikon D40 info at kenrockwell.com for more info.", "Date": "September 21, 2008"}, {"Title": "Unless you are a sport journalist, I don't think you can go wrong with this camera", "Author": "Sidarta Tanu", "ReviewID": "R3D1J2Q17O15GP", "Overall": "5.0", "Content": "The 6 Megapixel Nikon D40 is targeted for those who want a relatively compact and light camera yet having most of the important SLR features. The D40 is priced reasonably (cheaper than D50/D80 and Canon Rebel XTi). In my opinion, if you are still considering whether to get a point and shoot camera or a DSLR, the D40 will be a better choice than any point and shoot camera, by far, even those with 8MP or 10MP. But if you are already deciding to get a DSLR or you want more control of the picture taking experience, then I would recommend you to also test the D50 and/or D80 first before deciding to buy the D40. I want you to make sure that you know what you will get (and not get) with the D40. Don't get me wrong though, the D40 is an awesome camera, and I don't think you will regret buying one. There are some limitation with the D40 which shouldn't bother most people, for example, the D40 doesn't have dedicated button to change picture quality, white balance or ISO settings (which generally only professional/enthusiast will care). Once you understand (and accept) its limitation, the D40 is a potent and exciting photography machine.Just like all its (DSLR) siblings, the D40 powers on instantly and take pictures with almost no shutter lag which are the major advantages of a DSLR over a point and shoot camera. In addition to the P,S,A,M mode, the picture quality of the auto settings (auto, child mode, landscape etc) are also very good. With 2.5 frames per second you can capture movement progress in sports like football, basketball, baseball etc. Also great to photograph your family or child (child mode). The D40 is a great all around camera.Some notable new features:1. Auto (no flash) mode. Without this mode the flash will pop-up (on all other pre-programmed mode) even when you don't want to use flash (which can be annoying). The internal flash will not pop up automatically with the P,S,A,M settings.2. In camera editing capability such as black and white, sepia and some filter effects etc. While sounds gimmicky, these features are useful especially for those who doesn't have Adobe Photoshop (or other image editing software).To date, D40 is the smallest and lightest among all the Nikon DSLR (even smaller than the Canon Rebel XT/XTi, however the D40 is more ergonomics). I believe that choosing a camera that fits comfortably with your hands is important. Therefore, I recommend people to test the camera before buying (even if you want to buy online, please do go to a physical store and test the camera first whenever possible).The D40 has only 3 (horizontal) autofocus point (5 for D50 and 11 for D80). If you know \"The Rule of Thirds\", the additional AF points above and below the center focus point (available in D50 and D80) are handy to help create the horizontal third line. However, the 3 horizontal AF point in D40 is still helpful to create the vertical third line. Also one can focus with the middle AF point and after the focus is lock then move the frame upwards/downwards to create the horizontal third line. Just make sure the exposure level is still accurate when you move the frame after you lock the focus.About the 18-55mm II AF-S kit lens: A good lens producing sharp photos (though not a very fast lens). Also decent for close-up/macro photography. Lens uses internal focus technology and focusing operation is silent. A very decent kit lens.Lens compatibility: Notice that with D40, autofocus function will not work for non AF-S/AF-I lens. If you already have non AF-S/AF-I Nikon lenses and want a backup or replacement camera, you will be better off buying D50, D70s or D80. If you buy the D40, it will be convenient to stick with AF-S and AF-I type lenses. I'm not sure why Nikon choose this route for the D40 (whether to enable smaller size camera or from now on Nikon will only make AF-S lens compatible camera). There are a lot of good Nikon AF-S lenses (price range added: low, medium, high) that are fully compatible with the D40 such as:- Nikon 18-55mm f/3.5-5.6G ED AF-S DX (L)- Nikon 18-55mm f/3.5-5.6G ED II AF-S DX (L)- Nikon 18-70mm f/3.5-4.5G ED IF AF-S DX (L)- Nikon 18-135mm f/3.5-5.6G ED-IF AF-S DX (L)- Nikon 18-200mm f/3.5-5.6 G ED-IF AF-S DX VR (M)- Nikon 55-200mm f4-5.6G ED AF-S DX (L)- Nikon 55-200mm f4-5.6G ED AF-S DX VR (L)- Nikon 70-300mm f/4.5-5.6G ED-IF AF-S VR (M)- Nikon 12-24mm f/4G ED IF AF-S DX (M)- Nikon 17-35mm f/2.8D ED-IF AF-S (H)- Nikon 17-55mm f/2.8G ED-IF AF-S DX (H)- Nikon 28-70mm f/2.8D ED-IF AF-S (H)- Nikon 70-200mm f/2.8G ED-IF AF-S VR (H)- Nikon 105mm f/2.8G ED-IF AF-S VR Micro (M)- And several other expensive prime tele/zoom lens like 200-400mm, 300m, 400mm, 500mm, 600mm.High priced lens ($1000+) are usually pro level lens which usually have better construction, faster (f-stop), and produce better quality picture. However, often times, lower price lens will serve your needs just fine. I think it is important to know what you want to use the camera for before deciding which camera and lens to buy.Image quality of the D40 is very good which is #1 factor that I look for in a digital camera.Here are the pros and cons of the D40 in my opinion:Pros:1. Nice out of the camera result picture quality2. Affordable price3. Compact size and light weight4. Large and bright 2.5 inch LCD5. 2.5 frames per second6. B/W, Sepia, several more in-camera editing features.7. Instant power on, fast autofocus and no shutter lag8. Noise is acceptable at high ISO settings. Auto ISO settings available.9. Great 18-55mm II AF-S kit lens.10. Great battery life (400+ on a single charge. 1000+ if flash is not used).11. Auto (flash off) mode available12. 1/500 flash syncCons:1. No direct button to change QUAL, WB and ISO settings2. Grip comfortably but might be a bit too small for some people3. No top LCD and no front command dial4. Autofocus will not work with non AF-S or non AF-I lenses (such as the 70-300m G and 50mm f/1.8D lens)5. No AF/MF switch (have to use the switch on the lens)6. Only 3 autofocus point7. 6 Megapixel (More Megapixel needed to print larger than 12 X 18 at 300 dpi)8. No night landscape mode in pre-programmed settings9. No in camera image stabilization (like Sony and Pentax) but Nikon has lenses with it (VR).10. No depth-of-field preview buttonIn conclusion, the D40 is perfect for those who want high quality pictures, more control (than a point and shoot camera), and have a DSLR experience (instant power on and no shutter lag), without having to carry a bulky camera. And unless you are shooting sports/actions professionaly (which faster focusing processor, faster frames per second and larger memory buffer might be needed), the D40 is pretty much all you will need.Happy Photographing!", "Date": "November 17, 2008"}, {"Title": "Nikon D40 with kit lense", "Author": "William Pugh", "ReviewID": "R1EELEN16SCD9V", "Overall": "5.0", "Content": "This is a great camera.  The stock kit lens is VERY sharp.  I also got the 55mm to 200mm VR and it is great.  I really can't see why anyone would need more than this D40 will do.", "Date": "June 16, 2008"}, {"Title": "D-40", "Author": "E. Marks", "ReviewID": "R2P57ZMMW1TE5X", "Overall": "5.0", "Content": "Got this a my second Digital camera......I have since upgraded to a D-90. D-40 was super and simple to use. Wanted to be able to make more ajustments to such things as White Balance and special effects.", "Date": "April 15, 2011"}, {"Title": "Very nice for starters", "Author": "Rajiv Mukherjee", "ReviewID": "R22BCTALOLKI0D", "Overall": "4.0", "Content": "I have been using a point and shoot and my frustration with not being able to convert what I see into a picture led me to the slr. Before buying I was quite confused as to what to go for. After reviewing a lot of products on different websites, I decided to go for Nikon D40. As an amateur slr photographer, here are my comments. - The camera is GOOD and gives sharp pictures. Easy to pick up the basics (the dvds help). - Get a good lens, that is what matters. I did find switching between the lens a little cumbersome, but then since I bought the camera mainly for macro-photography, I can live with it.If you got the extra buck, buy the 18-300mm Nikorr. - I was worried about the 6 mp against the 10 mp of D40x and later models. Since I never intended to blow up the photo into a poster, probably I can live with the 6mp. Also I read reports about more noise at 10mp because of the extra sensors are packed into the same space. - The pictures come out sharp, and if you work on your photography skill rather than blaming a camera for bad pics, you will be glad with the D40 (Read the manual, not necessarily completely before you start, but along the way). My friend bought a D60 and our pictures looked pretty much the same in terms of sharpness and color quality.- If you are an amateur like me D40 is a good place to start. If you are a professional, you know better.", "Date": "December 16, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "The large 2.5-inch LCD monitor enables image preview at up to 19 times magnification and has large type fonts and easy-to-view menus\nThe D40's high-resolution image quality is made possible by Nikon's high-performance 6.1-megapixel Nikon DX-format CCD imaging sensor\nIntuitive controls make the D40 point-and-shoot simple, enabling even first-timeSLR users to capture beautiful memories perfectly.\nBeautifully styled, the D40 makes high-performance digital SLR photography easier and more convenient than ever.\nA fast 0.18 second startup combined with super-fast shutter response and rapid-action shooting at up to 2.5 frames per second", "Name": "Nikon D40 6.1 Megapixel Digital SLR Camera Two Lens Kit, with 18-55mm f/3.5-5.6G ED II AF-S DX & 55mm - 200mm", "ImgURL": "http://ecx.images-amazon.com/images/I/51BgVVnzDYL._SY300_.jpg", "ProductID": "B0010YA1LS"}}