{"Reviews": [{"Title": "Superb,High Quality Compact Digital Camera", "Author": "Andre S. Grindle \"Andre' Grindle\"", "ReviewID": "R34KAHN34Q2KBI", "Overall": "5.0", "Content": "After a few years of dealing with the great quality but of course bulky Olympus Evolt E500 8MP Digital SLR with 14-45mm f/3.5-5.6 & 40-150mm f/3.5-4.5 Zuiko Lenses I decided upon suggestion I needed a smaller digital camera that was simpler to use but had a very similar image quality of my profession model,just for ease of use on say little day trips and such. My first such attempt at purchasing such a camera was a near disaster with the extremely low quality DIGITAL CONCEPTS 87690 7.1 Megapixel Digital Still Camera. The deal at the store was I'd try to camera and return it the next day if I wasn't satisfied and pay the difference on this one,which was also available. Well it's been a week since I bought this camera and I've taken a couple hundred pictures with it and am extremely impressed with the quality not only of the images,which are in fact nearly the equal of my Olympus professional SLR but the ease of use of it's modes and features. The album has an easy hands on menu along with some internal menu features to control everything from excellent white balance and handy AE metering settings. The macro feature was my main concern here as it does when it comes to most cameras of this type but it too is excellent. I primarily have photographed flowers with this so far and I can set as close as 3-4 inces away from the subject before it goes blurry. This camera has almost all the features as my Olympus pro model and a few more such as a range of scene modes for everything from birthday parties to fireworks,a self timer with a little self mirror feature for self portraits as well as a motor drive for continuous pictures. One of the only mild drawbacks is,as stated previously is the slightly low battery life but,if the camera is shut off after a short time and not kept on for long periods the battery will last much longer I find. Another great feature about this camera is when you zoom in closer the ammount of visual \"noise\" common with these compact digital cameras is kept at a bare minimum and,in broad sunlight or flash use is barely noticible. There are features of this camera I haven't set used but for anyone looking for a near pro quality,budget priced compact digital camera with many handy features this will more than do the trick the same as it has for me.", "Date": "June 12, 2010"}, {"Title": "Awesome", "Author": "Jerry Sanchez \"piratesanchez\"", "ReviewID": "R3GT6GY6E292IF", "Overall": "4.0", "Content": "Simple and easy to operate, lightweight and fits in your handbag or small purse.  It is a Sanyo and even though this camera is just a 7.0 Mpix camera the photographs are high quality.  I love sending these photos over the internet because the pictures keep that quality.  You would love this product.", "Date": "December 16, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001IWHOS0"}}