{"Reviews": [{"Title": "I will come back to this review.", "Author": "Ned Middleton", "ReviewID": "RX2DQM1CBESSA", "Overall": "3.0", "Content": "It would appear that nobody is producing tutorial DVDs about Nikon cameras in the UK - hence my having purchased a number of products similar to this one from the USA.The person wishing to learn about the Nikon D300 camera is either someone who already knows about digital cameras and is moving across to the Nikon D300 or is someone who has chosen this camera as their first digital camera. If, like myself, you fall into the latter category, you are on a serious learning curve and might easily find this DVD contains certain assumptions about your existing knowledge because it uses phrases with which I am not familiar. You might, therefore, wish to study some form of \"introduction to digital photography\" DVD first.This DVD is narrated by a guy whose monotone delivery could send even the hardest insomniac to sleep. The graphics are generally excellent - although the unnecessary moving patterns behind a still picture of a camera function is very distracting.You will need to sit down with a D300 camera as the DVD takes you through the various settings - most of which are explained in a \"this setting does this\" and \"that setting does that\" method of instruction. Whilst this amounts to the briefest possible explanation before moving on to the next topic, it is reasonably good at putting across the essentials.On the down side, there are too many instances where we are referred to the user manual in a very vague fashion without any reference to the chapter or page number. It's a cop out. The useful tips right at the end of the second DVD are only useful if you have the additional software they seem to be promoting.I will come back to this review after I have studied another 3 similar products from different sources and made my own comparisons and might even revise my rating of this product.NM", "Date": "September 3, 2008"}, {"Title": "Well worth the money", "Author": "D. W. Moore \"Enthusiastic Amazon Fan\"", "ReviewID": "RASI9EQS8ZNMF", "Overall": "5.0", "Content": "I first bought Blue Crane Digital's \"Introduction to the Nikon D300\", which is a single DVD tutorial.  It was quite good, but liked this product with two DVDs even better.  The Blue Crane one was friendlier perhaps but the JumpStart guide was packed with information.  For me it was easier to tell what was going on with the JumpStart.I also have David Busch's Nikon D300 book.Between these you get excellent practical advice with regards to setting options on this complex camera.I'm very pleased with all of them.", "Date": "August 3, 2008"}, {"Title": "Great Training for my new Nikon D300", "Author": "AGST \"AGST\"", "ReviewID": "R1HQPIWZVJKOTS", "Overall": "5.0", "Content": "Having tried and reviewed other DVD and Texts for the Nikon D300, this was by far the best. It brings you right to the abilities of this great camera.", "Date": "June 22, 2008"}, {"Title": "Jumpstart Nikon D300", "Author": "Martina Thompson", "ReviewID": "R2YWE9U1PLBRVZ", "Overall": "5.0", "Content": "Jumpstart Nikon D300 - I found the Jumpstart DVDs an excellent tool and easy to follow!", "Date": "February 26, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0010VWDTY"}}