{"Reviews": [{"Title": "Nice camera for the money", "Author": "A. Mehrtens", "ReviewID": "R2JUYB3MV8CZW5", "Overall": "4.0", "Content": "Just bought the camera on black Friday, so haven't had much time to use it. Takes good quality pictures as long as there is ample light. You have to play around with the settings to get it to take decent low light pictures.", "Date": "November 30, 2008"}, {"Title": "Great 10MP Digital Camera", "Author": "George R. Talbert", "ReviewID": "R2161XK6ZE5E7W", "Overall": "5.0", "Content": "I got my BL 1050 7 days ago. I love everything about the camera. It has so many features and produces quality images. It is just the right size to hold. I have taken quite a few night photos(with and without flash) and am quite pleased with the results. I put a 4GB SD card in my camera. It will take many pictures with this much memory. You do need spare re-chargable batteries with you as it uses them up rather quickly, but not to the point of being a problem. Buy this camera- you'l love it.George", "Date": "December 16, 2008"}, {"Title": "Samsung 10.2 MP Digital Camera", "Author": "kathy cooney", "ReviewID": "R29NKS130JOLW1", "Overall": "4.0", "Content": "This is a fun camera to take pictures with because it is so easy and effortless.  The pics are fantastastic - I use the Auto feature mostly and have had wonderful results.  Best Digital Camera I have ever used.", "Date": "February 2, 2009"}, {"Title": "Great quality camera for a good price.", "Author": "Vortec", "ReviewID": "RM59G1Z0ZUJM7", "Overall": "5.0", "Content": "I purchased this camera for someone for a Christmas present and they have been very pleased with it, as it is very similar to my Samsung S85 (which is an outstanding quality camera for it's price as well) camera - just with more features.  I didn't think the 2.7\" screen would be as noticeably larger than the 2.5\" screen but it definitely is.  10.2MP, 2.7\" screen, 5x optical zoom, included case and 1GB SD card...you simply cannot beat this value.  I highly recommend this product for occasional photography and outstanding basic use!  Enjoy taking nice, highly quality photos!", "Date": "January 13, 2009"}, {"Title": "Awesome", "Author": "Forest Junkie", "ReviewID": "R2P16AL22TNHIA", "Overall": "5.0", "Content": "Camera's great.  Does everything I've asked it too.  batteries last a long time and it takes great video.", "Date": "December 20, 2010"}, {"Title": "Fantastic Camra!!", "Author": "Eric Wilt \"Bob\"", "ReviewID": "R7C79XE4FSLSR", "Overall": "5.0", "Content": "Camra works great!!  Easy to use and pictures come out with great quality.  I bought one and now I bought two..", "Date": "August 2, 2010"}, {"Title": "great camera", "Author": "D. Schunke \"dmsklutz\"", "ReviewID": "R2YBK2IMROVYXB", "Overall": "5.0", "Content": "As described - easy to use and download pictures from. Also nice that it came with the SDcard so you could start immediately. Only drawback seems to be the batteries do not last long when using the flash.", "Date": "January 24, 2009"}, {"Title": "NOT THE BEST CAMERA", "Author": "M. Bustos", "ReviewID": "R3VI36K7DH08ZJ", "Overall": "3.0", "Content": "i just bought this camera. its price is really good compared to other camera brands and , and samsung is a good brand.. BUt i just took a picture with low light conditions and it has the crappiest flash i've ever seen!! i mean! 10 megapixels and a crappy flash!? i already got it and i cant return it but if i were u i'll buy something else..", "Date": "January 16, 2009"}, {"Title": "What a great camera!", "Author": "Myles L. Miller", "ReviewID": "R1CSAK27AM8IUY", "Overall": "5.0", "Content": "What a great little camera!  It consistently takes awesome pictures and is very easy to use.  I liked that it was ready to use right from the box with everything you need already included.  It does surprisingly well on a set of batteries, which is good since there is no view finder except for the screen itself.  It also has a nice variety of photo quality and size options.  Overall, I would say that this is an exceptionally good camera for the price.", "Date": "January 14, 2009"}, {"Title": "great digital camera", "Author": "C. B. Main \"mushroom lover\"", "ReviewID": "R3O9IW1W12RCRD", "Overall": "5.0", "Content": "This camera does it all and is super easy to use.  Mostly I use the automatic setting but I tried all the precision setting also and they all work wonderful.  The pictures are clear and  the program that comes with the camera is also great.  It allows you to change anything you want to. chop, zoom, recolor, etc.  I love it and don't know how I ever lived without it for taking pictures.  Also does great videos.", "Date": "January 6, 2009"}, {"Title": "Takes good pictures", "Author": "Terry Davis", "ReviewID": "R30CUIJS0W8B23", "Overall": "4.0", "Content": "This camera takes some really good pictures for the price. The batteries life isn't to bad. Great that it comes with a 1 GB card since most camera don't come with any or a little one.1 con with this camera is when using the higher zoom your hands need to be very still or the pictures will be blurry. But over all you can't beat this camera for it's price.", "Date": "August 23, 2010"}, {"Title": "This camera has major design defects", "Author": "V. ODONOVAN", "ReviewID": "R23V24C9LB9UYO", "Overall": "1.0", "Content": "This camera worked great for about two months.  It then had to go to their repair center for total refurbishing.  The Samsung rep didn't seem at all surprised when I told him the camera would no longer focus at all, had a black shadow on the LCD and would not program properly.  Since it's been less than three months from the date of purchase, I thought they should send me a whole new camera, which they will not do, only repair the lemon I bought.", "Date": "February 23, 2009"}, {"Title": "My Beloved Digital Camera", "Author": "Worgwu Chigeru Rossi \"Chigeru Rossi\"", "ReviewID": "R2IAMFVATFINQC", "Overall": "4.0", "Content": "This Digital Camera is a great one. My friends are even asking me to buy for them.But, I have only one problem, the absence of the AC cable. And I can't even find it here in Nigeria to buy.  This is making me buy batteries always.It is really a great camera", "Date": "January 7, 2009"}, {"Title": "Samsung BL1050 digital camera", "Author": "Susan Hanks", "ReviewID": "R3U2LOW3IJQM3E", "Overall": "5.0", "Content": "Great camera for the money, user friendly, I would definitely recommend this product. Takes clear sharp pictures. Nice little carrying case too", "Date": "January 7, 2009"}, {"Title": "Good bang for the buck", "Author": "K. Nanavati", "ReviewID": "R1AUHGS390DBK6", "Overall": "4.0", "Content": "Very nice camera. Battereis are not rechargeable. Have to use AA batteries. But pictures are excellent.", "Date": "January 6, 2009"}, {"Title": "very good", "Author": "Eldon B. Brown", "ReviewID": "R3N9IDFEY60SRX", "Overall": "5.0", "Content": "this camera is very good for the buck , i use when on trips or just taking pictures when needed.", "Date": "September 27, 2013"}, {"Title": "MAJOR defects", "Author": "Jason Russell", "ReviewID": "R37DBSOZTBV9IF", "Overall": "1.0", "Content": "I recieved this camera as a gift 2 years ago.  When I first opened it up, I was happy that everything I needed was right there in the box, even the batteries.  Unfortunately, when I pressed the power button, it turned on, extended the lens, and then shut off and would not turn on again.  I had to have it sent back and replaced.  As the camera was under warranty, this was no problem.  Fast forward 2 years, which is not a very long time, and the same thing has happened to my camera.  Samsung is willing to fix it...for another $50.  They have made a camera that has a major defect, and are not willing to own up to it. This camera WILL break for no reason. Sometimes sooner, sometimes later, but it WILL fail you.  Do NOT purchase this product.", "Date": "February 1, 2011"}, {"Title": "me encanta lo nitido de las imagenes", "Author": "Randolph R. Santiago", "ReviewID": "RLVZFMUH1JP99", "Overall": "5.0", "Content": "es una camara muy buena, su menu muy facil y pantalla con buena resolucion.estoy contento con la compra.", "Date": "March 30, 2009"}, {"Title": "My new camera", "Author": "C. Lindsay", "ReviewID": "RQZSV1J7OX0NH", "Overall": "5.0", "Content": "I haven't used it a great deal just yet.  However, it takes excellent pictures.", "Date": "January 23, 2009"}, {"Title": "BL1050 REVIEW", "Author": "Tad Martin Alco Co", "ReviewID": "R32VRI1GKDFKUQ", "Overall": "5.0", "Content": "SO FAR THE CAMERA HAS PERFORMED WELL AND AS ADVERTISED. LIKE ANY ELECTRONIC PRODUCT, TIME WILL TELL HOW DURABLE IT IS. WELL SATISFIED AT THIS POINT.", "Date": "January 9, 2009"}, {"Title": "Poor battery life...", "Author": "R. Smith", "ReviewID": "R2QSARIH09GN2K", "Overall": "3.0", "Content": "General image quality seems good, and 5x zoom is nice, but this camera seems to burn through alkaline batteries (2xAA), and is prone to shut itself down when the batteries get low (which can happen very quickly!).  Online documentation and support is minimal.  Provided software seems to work nicely in Windows Vista SP1.", "Date": "January 7, 2009"}, {"Title": "Okay camera for the $$", "Author": "E.E.", "ReviewID": "RELTXA3F8WIH8", "Overall": "4.0", "Content": "I didn't research as well as I should have, but for the $$, I think this camera is a good buy.  It runs on \"AA\" batteries- which is good, but bad- at least they're cheap to replace.  Image quality is decent and there are some good features on this camera.  I purchased it so I can carry it and not rely on the poor images of camera phones.  It suits the need for which I bought it.", "Date": "January 6, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "10.2-megapixel resolution\n5x optical zoom\n2.7-inch LCD screen\nDigital image stabilization; face detection\nCapture images to SD memory cards; kit includes AA batteries, camera case and free 1 GB SD memory card", "Name": "Samsung BL1050 10.2 MP Digital Camera Kit with 5x Optical Zoom (Includes Camera Case and 1 GB SD Card)", "ImgURL": "http://ecx.images-amazon.com/images/I/418noXZVi5L._SX300_.jpg", "ProductID": "B001K55QV2"}}