{"Reviews": [{"Title": "Do you homework 1st  the NV24HD is what it claims to be", "Author": "Randall Kopf", "ReviewID": "R1V84J9HRB2W9P", "Overall": "5.0", "Content": "I'm glad I did not read the poor reviews @ Amazon before I bought my NV24HD. Instead I relied on the Mfr SPECS and bought it. This is a GREAT camera. Anyone who says less does not understand modern technology. This camera fits a small niche... First it is a Point & Shoot with \"Wide Angle\" Optics. So if your expecting a Handycam with 30x Zoom this is NOT your camera. You should be doing limited zooming with this camera as it is limited to 24mm Wide to 85mm Portrait range. The camera is perfect for family environment.  It takes amazing photos and the HD video is decent compared to any P&S; considering it's size. Is the HD Video perfect? no but IMO it's pretty decent. While there are minor issues with the camera the key word is \"minor\". I don't agree the issues other reviewers cite are relevant I.e. its bad for landscape? Well Duh? The NV24HD delivers and is made really well. The AMOLED display is amazing, place this beside any other P&S; with both on and see for your self how much more this offers with the Wide Angle Optics. If you have a need for a P&S; and can accept Wide-Angle to Portrait range optics you owe it to your self to get this camera.[...]", "Date": "May 29, 2008"}, {"Title": "Outstanding camera, especially for the price!", "Author": "Scott", "ReviewID": "R3CQX3ABDGP875", "Overall": "5.0", "Content": "This camera is absolutely wonderful. After shopping around and looking at cameras for what seemed like forever, I finally found this little wonder. Now people may be hesitant, as to the Samsung brand, I was too, but I am in love with this camera. The price tag of only $250 was great as it is probably one of the cheapest HD cameras you can buy (from a reputable brand), and its image quality simply rocks. I must say that I am a more advanced user who was looking around for manual controls to make my images pop, and this camera's manual mode does just that. You can control virtually everything (minus some very complex things like manual focus, but you really don't need control over those in a little point and shoot.The camera takes excellent quality videos in the HD mode (be forewarned that you may need a beast of a computer though to play back the movies smoothly). Also people have been complaining about average image quality from this camera and I see nothing of the sort. Colors are vivid and can be mad more or less so by changing effects either before or after taking the picture. One smart feature that Samsung included was the fact that the camera is so speedy with its smart touch interface that it gives a quick update of filters and effects when you roll your fingers over the button. This is great when you want to take pictures in oddly lit situations and you need to quickly find out what looks the best for your photo.One thing I was really worried about was the pop-up flash on the top of the camera. Moving parts scare me as they tend to break easily and when I looked at the little brother to the camera, the NV15, I saw that the flash didn't really close all of the way after being played with. This flash however feels solid and like it will always close all of the way and will always open promptly with the half push of the shutter button. Not to mention this flash is POWERFUL, it can light up a whole room, not like it's a Canon Speedlite, or anything, but this is by far the best flash in a Point and Shoot I have ever seen.The smile mode is a hilarious feature, people get so surprised when you just hold the camera and when they smile, it just snaps away.  Also, the red-eye reduction is a great feature and just edits away red-eye, unfortunately it can't do pet-eye.Now of course there must be some downsides to the camera. The first camera received from amazon was defective, a whirring noise always came from the lens when it was at the widest zoom. Samsung confirmed this problem and promptly offered to fix it, I was satisfied with their prompt response (although I was unhappy to speak with Raj in India about how removing the battery might fix my problem, do they not think that I would have tried that???) Anyways I returned it and a new one was at my house the next day (way to go Amazon!) This one being without the whirr. I have a complaint about the whole zoom and loose sound thing, I think I could live with motor noise in my video, and even if I didn't like it, you can edit out the video. Another thing to mention is that the software that comes with the NV24HD is flat out weak. It is a photo sorter and basic editor. Basically iPhoto or whatever the windows version of iPhoto is. The last complaint I have is that the camera has no dock. Honestly a little plastic dock would not cost that much and would make me feel better about charging my camera so I wouldn't have to rest it on its brilliant screen or the nice Schnider lens.Even with my little quips about the camera, I have to say that for the price I would rather have this camera any day over a Nikon Coolpix or a Canon Powershot.", "Date": "June 19, 2008"}, {"Title": "All in all, pretty good", "Author": "C. Riley", "ReviewID": "R27RS3QFACVTL8", "Overall": "4.0", "Content": "I've had the camera for about a week [see below for my update after a month and two months].  So far, I am quite happy with the camera.  The zoom has worked well for me and is an improvement over my previous camera.  Likewise, the HD video is great on my HD TV.  I've been looking for a device to replace my camcorder and my digital camera.  In many ways this is the device.The only negative I have noticed so far is that when recording video if you zoom, the audio cuts out while zooming (or a second or two before the zoom starts).  This is not a deal breaker, but it should be fixed so that you can zoom while recording audio.  Seems like a pretty common thing to do.Things to remember:  get a large memory card if you intend to record HD video.  I got a 16GB (SanDisk) card and it is working well and gives well over an hour of video.  As most people know, the internal memory is small so if you are doing any video you'll get about 10 seconds without a card.July 21, 2008:After using this for about a month, I had a few more comments:  First, the battery life is the main drawback so far.  On one trip I didn't get good battery life, but on a different one, I got more than 4 days of pictures (about 220), so watch the battery to make sure you aren't running low.Second, someone has said in the comments that the audio cutting out while zooming is to ensure that you don't record the sound of the zooming and is consequently a feature, I must disagree. I have had a lot of other video cameras that can zoom while recording audio without recording the zooming sound, JVCs, Sony etc.  To me, if you can't record sound while zooming there is a problem: either the sound cut-out or the fact that it would record the sound of zooming is a design flaw because other manufacturers have managed to have this feature for decades without a problem.", "Date": "May 20, 2008"}, {"Title": "One of the only true wide angle compact cameras, but...", "Author": "T. Johnson \"electronics junky\"", "ReviewID": "R1O1T3F9U54U6Y", "Overall": "3.0", "Content": "I ordered and received this camera from Amazon after seeing the ad from Samsung that it had the equivalent of a 24mm lens (on a full frame 35mm camera).  95% of these compact cameras have the widest equivalent to a 35mm which is fine for snap shot of friends, but really bad for photos of a room, or a landscape.  the camera has a great feel, made of matte black metal.  I have a lot of cameras and so I had others to compare it to-- that is where it falls down.  You can't control the automatic noise reduction and even with the sharpening turned all the way down, and the images stabilization turned off, the files look very processed and the detail is very poor..  My favorite \"happy snappy\" is the Canon SD800 IS.  Even though the technical maga pixel count is lower on the canon, and using interpolation to upres the canon file to the same res, using a professional focus chart from Century optics, you can see that the files from the Canon are WAY cleaner, and more color neutral and over all more pleasing.  Even though the SD800 IS doesn't have as wide a lens (equ to 28mm) I much prefer it.  That said, it is really amazing to get HD video out of this little guy!", "Date": "May 15, 2008"}, {"Title": "Amazing little camera!", "Author": "Robert Fischler", "ReviewID": "R2968SP08RARF8", "Overall": "5.0", "Content": "Straight out of the box, I set up the camera with the time and date, and to imprint the date on each photo, and found the interface absolutely amazing.  Samsung has done a brilliant job on it, making the camera very user friendly.  I have used it indoors and out, have printed 4x6 and 5x7 prints, and downloaded images to my Kodak M1020 digital frame, all with excellent results.  Picture quality is great, wide angle zoom gives great flexibility,  and there's no other stuff to lug around!  A camera this small with this much zoom naturally involves some design trade offs, and Samsung engineers have really nailed it,  It won't replace a digital SLR, but for convenience, ease of use, and picture quality, I haven't seen anything in it's size or price range that I thought compared to it!", "Date": "May 24, 2008"}, {"Title": "nv24hd disappointment", "Author": "bobbyo", "ReviewID": "R3F9FKZ1BPT7BY", "Overall": "2.0", "Content": "I just got the new nv24hd and it is a bit of a disappointment. The zoom operates much faster than the autofocus, so images are always blurry while zooming. Movie images snap into focus about a second after I stop zooming. (This is zooming while taking a 720p HQ movie of still objects in a well-lit environment.) The Zoom is also fast--too fast, in fact. The camera zooms from minimum zoom to maximum zoom so quickly that it is hard to get the camera to zoom to a specific level between the extremes. The zoom rocker-switch does not allow fine control of the zoom, and there is no setting for slow zoom, nor is there a \"don't zoom faster than the autofocus can handle\" zoom.Also, if you like to take an audio 'voice memo' with your pictures, this is not the camera for you. The camera can take up to 10 seconds of \"voice memo\" audio after taking a picture, which is short but bearable. (Grandparents & family *love* hearing a sound-bite audio memo with each picture.) However, unlike image size, focus area, and other settings, the 'voice memo' setting resets to the default (off) after every picture. That means there is no way to have this camera automatically take a voice memo after every picture; you have to press several buttons to turn the voice memo feature back on before each and every photo that gets a voice memo. (I spent 45 min, mostly on hold, with Samsung tech support to confirm that there is no workaround to get an audio voice memo after every photo.) Casio & Sony have great voice-memo-after-every-picture settings (Canon & panasonic cameras, and apparently Samsung's nv24hd, do not have passable voice-memo-after-every-picture options).On the plus side:The wide angle is noticeably wider than on my Canon SD850 (28mm).The OLED display is very bright and crisp, easily visible from any angle.The unusual user interface, with ipod-ish buttons along the side and bottom of the display, is very intuitive and easy to work with.The camera build feels very solid and reliable, but small and light.Conclusion:I really like the specs of this camera on paper, and I paid top dollar to  get it as soon as it came out.Since I bought this camera for the wide-angle still photos + 720p movies, I expect I'll return it. The blurry images whenever the zoom is used means zoom is not really useful in the movie mode. So the 720p is nice but blurry images when zooming + inability to limit zoom to a pace the autofocus can handle make the movie mode a real disappointment. And the all-but-useless voice memo settings make me wonder what other badly configured options await as I learn more about this camera...", "Date": "May 20, 2008"}, {"Title": "best wide angle for the price?", "Author": "D. Swift", "ReviewID": "R2CM05KP1P0LAD", "Overall": "5.0", "Content": "I do a lot of hiking, biking and whatnot and miss too many shots because my stupid macho adrenaline-junkie partners generally refuse to indulge me while I futz with my digital SLRs.Problem is, I sometimes need to turn those outdoorsy moments into cash. Since dinky cameras have gotten quite good image-wise, I felt it was time for pocket point&shoot; whose images might be coaxed into commercial use.  My desires, in order of importance:1. Wide angle. A real wide angle, at least 28mm.2. Reasonably crisp images -- a good starting point for Pshop, anyway.3. Manual exposure setting.4. Histogram.5. Raw capability.The Samsung NV24 does not have the last two features. The cameras that do -- Panasonic Lumix LX3, various Nikons or Canons -- are far more pricey. (I did test a different Lumix with imaging hardware similar to the LX3. Unimpressive pixels.) Knowing that the camera would also be a beater (throw camera in jacket, forget about camera, throw jacket into car) made this Samsung, with its 24mm lens and easy cost, worth an experiment.I love this little thing. It feels great in hand. Unlike nearly every other P&S; I've handled, the ND24 is a contradiction. It's light and tiny yet it has a businesslike heft. The body feels like it's milled from a solid aluminum billet. You can actually hold it still. In my pocket it does not feel ready to slip out unnoticed.The image quality is about as good as these teensy chips tend to be. It's plenty good for the web.Some reviewers here complain about software, connectivity, etc. I apologize in advance if feelings are hurt but . . .  this pup is ready for Macs. I plug in the supplied cable. Punch one button on the camera. The camera card mounts and the battery starts recharging.It is a RTFM camera, especially the \"smart button\" feature which is actually its two series of buttons. The interface is a clever X-Y axis setup. In some instances, like tweaking exposure compensation, you sweep your finger across all the buttons to scroll.Kudos to Samsung for the packaging. Small box, no fripperies, mostly recyclable.Finally, although most all modern digicam have ridiculous never-used \"features\" -- like the ability to shoot macro with all smiles in focus at night at the carnival (with and without fireworks) -- the Samsung NV24HD is refreshingly non-grotesque in this regard.Samsung, add to this camera a histogram and a raw file dump and I can name a couple dozen pros who will pay twice as much for it.", "Date": "December 7, 2008"}, {"Title": "NV24HD Digital Camera by Samsung really delivers!!!", "Author": "R. Kopf \"RaZeR\"", "ReviewID": "RVHTUOL885QPA", "Overall": "5.0", "Content": "I received my Samsung NV24HD Camera on April 30th. I bought a 8gb SDHC Type6 Card with it. The camera meets every expectation I had. The picture quality and movie quality is truly great. I say \"Wow Mom Wow\" really it's that good. I took photos of some tulips and it was really windy out but the sun was shining through them. The camera had no problem with amazing results both with photos and video. All settings were the highest quality. The 10 sec HD video was a small 9.4 megabytes again it was true HD. I am adequately impressed with the various shooting modes. Controls on other cameras typically are buried in setups are found on the NV24HD on screen in each mode you shoot in. \"M\" manual mode has immediate control every setting possible F-Stop ISO Etc.The playback and review of photos and videos is fast and easy. It is very fast to zoom in on/out on pictures and navigate Pan using the edge sliders. The AMOLED has to be seen to be appreciated. While there are larger displays on current point and shoots this screen is a serious display for resolution and color depth and saturation. Looking at it while moving outdoors to indoors is amazing as it adapts on the fly. The navigation of the camera operating system is brisk and fast. It will keep pace when you are in a hurry. I took a picture using DIS (dual image stabilization in a very dark area of my pet. The photo was amazing for the light it picked up considering it did not use a flash. The resolution was diminished naturally but as a snapshot it would be almost impossible to get a shot light that otherwise without flash. Via USB there is a option to Connect to PC or PRINTER and transfer via VISTA is just like any SD drive transfers. On the PC the Samsung MASTER software is too slow and performs poorly compared to something like Picasa by Google.IMO this is a Prosumer grade camera and there is nothing cheap about it.The wait is well worth it.See photos I took at:[...]", "Date": "May 1, 2008"}, {"Title": "Great Video Features", "Author": "C. A. Proffitt \"CP\"", "ReviewID": "R1ID7POB9BZJ2O", "Overall": "5.0", "Content": "I'm a professional videographer and I think this is a really special item.  I bought it for the HD video features. I was able to edit the video on Premiere Pro CS3.  I've only had it for a day, but I put it through a few tests. I was surprised by how good the video quality is, and the colors looked great.  The sound was surprisingly good (nothing special, but much better than expected).  I think the wide angle lens on it is also very good.  It's obviously not a professional video camera, but I can imagine using it for very low profile shooting and to capture video when I'm out and don't want to carry a camera with me. I can also imagine using it in situations where a very small light weight camera would be essential.  I haven't put it through enough test to decide if I would ever use any of the footage on one of my projects, but it might fit a niche in a project that my larger video cameras can't fill.  I really like that it has a wide angle lens, and anyone buying this should realize that you are not going to get much of a zoom out of this thing. My only wish is that it shot in 24p.", "Date": "July 2, 2008"}, {"Title": "Video is great, still shots need improvement", "Author": "Amazon Man", "ReviewID": "R1Q9LETX07JRKY", "Overall": "4.0", "Content": "Let me begin by saying I am not one of those camera heads that does a tremendous amount of research before buying a camera and then tests the new camera, out trying each setting so I can do my own detailed review.  I am by no means any kind of expert.  The main reason we bought this camera is that we wanted the HD video functionality it offers.I think the camera delivers nicely on the videos BUT I am disappointed to see that we can't purchase the cradle that allows you to hook directly to your HD TV to watch your videos.  Here I am ready to throw some money at Samsung and they don't even offer it, so I wait.  But I do love the videos and the fact that they use the H.264 codec so the quality is great, & file sizes of videos are handled efficiently.On to the rest of the functionality.  Love the smart buttons, gives you the feel of a touch screen without touching the screen.  Love the wide angle as well.  However, the last 3 cameras we have purchased were Canon PowerShots and they have always had very good picture quality all the way around in my opinion. When taking pictures indoors during the day for instance we have had several pictures turn out blurry.  With the flash on at night also some less than perfect shots.  Comparing them to the only other type of camera that we've ever owned, the Samsung falls short a bit.  The only other beef I have with it is the software that comes with (Samsung Master).  When downloading pictures you are not given many options like deleting the files once they've been downloaded, etc.  Again comparing to the software that comes with Canon which seems much more thought out (probably because Canon has been doing it longer).Overall though, we are satisfied with our purchase and look forward to using it (and for that CRADLE to come out!).", "Date": "June 19, 2008"}, {"Title": "Samsung NV24HD -- Where's the Accessories?", "Author": "DWM \"uclan\"", "ReviewID": "R21TGZ95KYBYI5", "Overall": "4.0", "Content": "When I placed the order on Amazon, the estimated delivery was 1-2 months but to my surprise it showed up in a week on May 12. I ordered this particular ultra-compact because of size and features, ISO up to 3200, shutter, 2.8, focal lengths, etc. Plus, my wife doesn't like to lug around our Canon 40D and it's nice to have someone else take photos sometimes, especially at kids' birthday parties, showers, etc. (if you know what I mean).  I haven't had much time to use it but here's what I experienced so far. Make sure you use a SDHC memory card. I tried a standard SD card that I had around the house and the video was very jerky (I know, duh!). I don't know if purchasing a SDHC Cat 6 vs. SDHC Cat 4 makes a huge difference but the price difference was not significant online so I bought a SDHC Cat 6. The video was much better.  A couple of minor gripes. Us, 50+ types, too vain or reluctant to wear our reading glasses will struggle to read the icons on the dials. Secondly, where and when can I get the accessories? Nothing available on sale at the Samsung and Amazon websites. I would love to get the cradle to hook up via HDMI and an extra battery. Searching the sites, it seems that these accessories are currently available only outside the US. I starting buying Samsung products about a year ago, DLP, Blu-Ray, etc. moving away from Sony, Panasonic and so far, I am satisfied with their products and pricing.", "Date": "May 20, 2008"}, {"Title": "Broken video kills an otherwise good camera", "Author": "J. Myers", "ReviewID": "R3L2ALVMGQ78JY", "Overall": "2.0", "Content": "I bought this camera for two reasons: The 24mm lens, and the H.264 720p video. The lens is as advertised, the video is not.Image quality is average, it seems to have trouble with deep blues (sky, water). Lens could be better and has huge flare in bright light as do most compact cameras. 24mm in a compact is excellent. The ISO 3200 is fun and could be useful in a bar situation or somewhere you absolutely cannot use a flash and otherwise would not be able to take a picture, but don't plan on framing it. 1600 is almost as bad.The H.264 encoded MP4 video files the camera generates are malformed, and do not work properly in any video editing software I have tried (windows or mac). They will usually play, but any attempt to transcode or rescale the video either crashes the application or results in varying errors (other H.264 files from other cameras work fine). Also, the Quicktime player stumbles over the first few frames of the video (windows and mac) and you cannot scrub back and forth at the start of a video due to the bad file. This is worse than it sounds, as you cannot resize the video to a dvd or to an ipod (or anything else) and I can't do any editing of it whatsoever off of the camera. A shame, as without this major deal breaker it would otherwise be a good camera.It should also be noted that while this camera technically records 720p video at about 6Mbps, a good standard definition camcorder will produce superior and in some cases sharper images. I had attempted to scale them down to DVD resolution, however this appears to be impossible until a workaround is discovered.Other minor gripes are the poor low light performance of the video, even compared with other (non-HD) still camera video modes, and the very gimmicky picture mode selector wheel. The included software is horrible, I would get the PDF manual off of the CD and download the free picasa from google.If the video is fixed in the future, I would rate it a 4.", "Date": "May 21, 2008"}, {"Title": "great for what I want it for.", "Author": "Kernel Lucky", "ReviewID": "RT2HH4E4O2OFN", "Overall": "5.0", "Content": "I bought this camera when it was $189.  It's been discontinued and I think folks realize what a bargain the remaining ones are cause the price is $250 today.Though I am a still photographer I bought this puppy cause it shoots video.  I do a video blog and this camera is with me all the time (really compact).  It's great.  HD and 30p.  Perfect for the web.  The quality is more than average but not professional but hey -- looks very good in a web movie that's 700 pixels wide.  Sound is very ordinary to poor but again - you get what you pay for.Essentially I use this camera for roll B stuff or cutaways to my prime footage - I have a Canon HV30 and Canon 5d Mk II for setup stuff with tripod, microphone, etc.  Anyway, I'm almost invisible with this tiny device as I roam all over the place getting visual ambiance and such for cutaways.  It's soooo easy and nobody has a clue you're shooting semi serious video.I don't shoot stills with this so no review about the images.  Strictly use it for movies.  For the price it was a killer deal for my specific needs.  You'll never see it under $200 again and you probably won't see it at all in the future.  Samsung has a new version but I'm sure that's 300-400 dollars.", "Date": "April 6, 2009"}, {"Title": "Great little camera/camcorder but BEWARE of Editing Software!", "Author": "L. Bradshaw", "ReviewID": "R31VQYCM3W4QKK", "Overall": "4.0", "Content": "I have several digital camcorders I use for my kids youth sports games. Lately I started shooting 3 different camera angles for football (with a little help from my friends)...so the Samsung NV24HD is the latest addition to my bag, and it is a great one.Allow me to keep my review simple and focused on this use since there are so many other comprehensive reviews already. The wide angle lens seems to be the coolest thing when shooting the games. Whether at field level action, halftime locker room talks or up high in the crow's nest for \"game film\" footage this little camera delivers!Other than the audio going to mute during zooming, the only potential downside I see is the editing and burning the footage using software. I have a Sanyo Xacti 720p camcorder that also uses the MP4 AVC/H.264 formatand have not had many problems. It is my understanding that the implementation of this format can vary from manufacturer to manufacturer. Not sure what the deal is but my programs are NOT handling this camera's footage the same.I always maintain several applications in this area as well including Sony Vegas, Adobe Premier Elements and Pinnacle. I have grown tired of the Sony Vegas user interface (too busy and complicated) so let me say a couple of things about Adobe and Pinnacle specific to the footage/files this camera produces:1) Adobe Premier Elements: Versions 3 gives a message that it is an \"Unsupported Format\"...strange since this version has always worked with the MP4's off of my Sanyo Xacti. AE 4 handle the files fine. Adobe Premier Elements 7 HATES the format! It's like they were so focused on getting the AVCHD right (and they did by the way) they completely screwed up the capabilities to work with the MP4 AVC/H.264 format!2) Pinnacle Studio Plus 12: Not a big fan of the user interface (look and feel) of Pinnacle Studio but it WORKS, and it works well for not only the MP4 AVC/H.264 format that this Samsung camera uses but all my others. A big bonus that it also handles my AVCHD .mts files very very well!3) Corel VideoSudio Pro X2 will not even allow you to import the .mp4 files from this camera. It will however import the MP4 files from my Sanyo xacti. I see a seperate review that says the implementation or codec of this Samsung camera's .MP4 is flawed. Not sure, but Corel hates it!Hope this helps some people either before of after the sale!UPDATE: Magix Movie Edit Pro 14 handles the .mp4 files from this camera GREAT! Before you can import however, you have to go to the help menu and select \"activate additional functions\" and add MPEG-4, follow the easy steps and the codec or whatever will be added and you're ready. Magix Movie Edit Pro 14 is a SUPER program with one of the best user interfaces I have ever seen.", "Date": "November 14, 2008"}, {"Title": "I really wanted to like this camera", "Author": "Gia Chi Phong", "ReviewID": "R3DLGZF3LF89C8", "Overall": "3.0", "Content": "I though this camera was the answer to all my needs.  With this thing, I wouldn't have to carry the usual DSLR (20D) with 2 lenses, accessory flash, extra batteries, and a camcorder.  Yes, HD video, good brand, good looks, and good value.  What's more? I can zoom while recording, H264 compression, 30fps, stellar video quality and stereo sound, so I thought perfecto!I read many reviews before purchasing and came to expect that this camera would not provide stellar IQ.  Okay. Fine. I can live with average IQ, but the HD is what I really wanted, or so I thought.I had this camera for 5 days and shot in a variety of setting like low light, sunny, cloudy, sunset, indoors, outdoors,etc.  Noise control was actually acceptable but what I found very unacceptable was the smearing and smudging from this camera even at ISO 80 in daylight.  Believe me, I tried everything like turning the in camera sharpening all the way down, using faster shutter speeds to prevent blur, and taking pictures in a variety of settings.My In-Law's 2 year old Canon P&S; is way sharper.  I really wanted to convince myself to keep this camera but it would defeat the purpose of getting it in the first place.  That means I would have to carry the Samsung for video and my 20D for pictures.  I wanted one device that would take decent pictures along with HD video.My final decision is to return this item and eat the restocking fee and shipping both ways.  Maybe next time Samsung.", "Date": "November 6, 2008"}, {"Title": "it is metal", "Author": "Karen Vanderborght", "ReviewID": "R3JW0AUKJZO5LN", "Overall": "4.0", "Content": "a metal body, nice design, quality of the pictures are by now a bit low -certainly in the dark. But it still works.", "Date": "June 10, 2013"}, {"Title": "Great camera", "Author": "Unknown", "ReviewID": "R34NAIW337OJC2", "Overall": "5.0", "Content": "The Samsung NV24HD camera is one of the best in class in terms of build quality (it is solid/metal) and image quality (with suitable light) and ease of use/controls (for common usage).It is very compact and fits well in the hand.Mine survived two drops -- including one on pavement (didn't have the wrist strap on the wrist) and one into a mud puddle (score a direct splat) and continued to work (after clean up) without a hitch.The battery life is super -- time and again I've gone a full day of several hundred photos on a single charge (battery life is about like a Casio and far better than a Panasonic).As with other Samsung cameras, it also provides the convenience of a USB cable/connection that can be used for both charging the battery and downloading photos -- so you can use the camera again and again without every having to \"open\" it.I've taken over 12,000 photos/videos with it and time and again it impressed me with what it was able to capture.", "Date": "April 8, 2011"}, {"Title": "GREAT CAMERA, Solid Construction, Feature Loaded!", "Author": "HOLLYWOODTOYZ", "ReviewID": "R2I5OGCLZOHQ93", "Overall": "5.0", "Content": "This is my second Samsung camera that I have purchased, with my first being the Samsung NV11.  I love both of these cameras, and I wish I would have discovered them before I purchased two different Canon cameras.  What do I love about the Samsung NV24?  It is a solid, finely built camera that takes crystal clear photographs and videos, and it is loaded with features that you normally wouldn't expect to see in a camera of this size and price.My advice for anyone who is considering purchasing this camera:  Read the many reviews posted here on Amazon, and I think you'll emerge enlightened with the truth about the NV24.If you're considering buying this camera, just do it.  You'll be happy that you did.  If you're hesitant about buying this camera and you're not interested in the HD video capabilities that the NV24 is known for, check out the Samsung NV11 instead.  Or you could just go ahead and buy the NV24 anyway. You'll be happy that you did.  Enjoy!", "Date": "February 18, 2011"}, {"Title": "Bought for 720P video", "Author": "Mort", "ReviewID": "RKNFHMMB09QJ9", "Overall": "4.0", "Content": "This camera has been great.  It has great photo and video quality.  One issue it has is the auto mute when zooming, it is distracting and most video cameras don't do this.  Also, I started getting a small black blur in all the pictures which Samsung subsequently fixed.  I have had no problems since.  The touch sense buttons on the bottom and right side of the display are kind of annoying and difficult to learn to use.", "Date": "June 21, 2010"}, {"Title": "Great camera; can be difficult to use", "Author": "Leon Littman", "ReviewID": "R3UGFWAVL34D2X", "Overall": "4.0", "Content": "I got this camera about a year ago and have been pretty happy with it.  The HD video is excellent and clear and particularly good in low light, my one beef being that the sound cuts out when you zoom.  This is not the most user friendly camera - it takes some trial and error to figure out the best settings for every picture and thus is not recommended for a beginner who just wants point and shoot.  But the photographs are good, and the camera does everything.  The smile shutter is a cute feature, but it does not always work; you need to smile fairly wide for the censor to pick it up.Frankly, at the end of the day, there is no shirt pocket camera (including the Canon, which doesn't have the manual controls) that does everything like this one does, and that is why I like it.", "Date": "February 24, 2010"}, {"Title": "Great Pictures/Features. OUTSTANDING 720p video", "Author": "B. Espinoza \"byronvisiado09\"", "ReviewID": "RS456TIVJI0G7", "Overall": "4.0", "Content": "Sadly i couldn't do a video review because my camera got dropped while open so its not working. however i can tell you while i used it it was pretty amazing...the picture quality is superb and the video sold me on it (up to 60 fps) . I do think it can be a little complicated to use but you get used to it with some playing with it. Im not doing a full/competent review at the moment but ill update this later when im not at work.", "Date": "December 9, 2009"}, {"Title": "Nice specs but doesn't quite make the grade", "Author": "George Xu \"George Xu\"", "ReviewID": "RZQMEIDPLC8X0", "Overall": "3.0", "Content": "I have had this camera for more than a year now and frankly I've used it very little. I was originally excited about a little camera that can shoot 720p video and capture ultrawide images. However, when it comes to picture quality, Samsung really failed here. The images are dull and grainy even at ISO 100. For outdoor images, this is not a major problem but the picture quality is just poor for anything indoors. I thought Samsung would be able to correct this through software upgrades but after one patch in June last year, they seemed to have stopped working on make this product what it could be. Last month, I also noticed that there's a stuck pixel in all of my 720p videos. I contacted Samsung technical support to see if there's anyway to correct it but they didn't bother responding.Until Samsung fixes its picture quality issues, stay away. Don't be fooled by the feature review that seems to be overly kind to this average camera. You don't buy cameras based on wonderful specs. You buy based on actual performance ... and for a camera, that's picture quality.", "Date": "October 22, 2009"}, {"Title": "Great Camera", "Author": "A. Mocherman", "ReviewID": "RTA9BSL5OL47N", "Overall": "4.0", "Content": "This camera has done double duty for me as a still camera and as a camcorder. The HD video looks great. Its crystal clear and the compression makes the file sizes very manageable. I can just drag the clips into iMovie and I'm ready to go.I'm more of a filmmaker than a photographer, but I know the basics of still photography and the manual mode allows me to do some more serious shots like long exposures. The battery life is great and the touch buttons are wonderful and easy to use. It makes navigating the features more streamlined and is much better than the typical selection modes in most cameras.The only short-falls of this camera are directly related to the zoom and it is here that the NV24 loses a star. The 3x zoom leaves a bit to be desired. I don't use the zoom that much, but I haven't been to any concerts yet this summer, so I really haven't needed it. For stills, the 3x is a bit small, but I can deal with it.And when taking video the sound is muted until the zoom stops, so the mic doesn't pick up the sound of the zoom motor as it's zooming. So beware when taking video that your thumb doesn't glance the zoom button: even trying to zoom out when it's zoomed out all ready will result in the mic being muted.All in all, this is a great camera and I was very satisfied with my purchase.", "Date": "July 13, 2009"}, {"Title": "Amazing and outstanding camera; especially for the price", "Author": "S. C. Burnside", "ReviewID": "RMUIDFEDR2LS3", "Overall": "5.0", "Content": "I have to say first of all that this is the third Samsung brand camera I've purchased. I love the fact that their cameras work well with Mac computers. This particular camera is great. It's small, easy to use, and takes great pictures. I find myself using much more frequently than my digital SLR, and I've taken fine art shots with it as well. Don't be afraid to purchase this one; it's well worth the money!", "Date": "May 21, 2009"}, {"Title": "Good picture quality, but bad night picture quality. VERY bad sound failure, when recording and zooming at the same time.", "Author": "Eduardo Araujo \"korsario\"", "ReviewID": "R3D57DKUGBGTS", "Overall": "3.0", "Content": "PROS:Great wide image lens and HD video playback on HD TVVery good image quality in light conditions.CONS:When recording video the audio cuts out while zooming. It is a big problem for me, just imagine you are recording and each time you zoom sound cuts out. Samsung must fix this error.Battery life is very short. So, you should buy extra battery if you don't want to miss  those memorial moments.No so good night picture quality.Some Advices:Good option for a HD cam. It is Compact and it offers good image quality.Carry an extra battery always.Use SD cards 4GB or larger (they are chipper now).", "Date": "April 5, 2009"}, {"Title": "Great Point and Shoot", "Author": "Michael Hansen", "ReviewID": "R1IWWDSE3BWAWG", "Overall": "5.0", "Content": "Hands down the best small camara I have ever owned.  I bought it for my Wife for Xmas and we took it to Costa Rica for 2 weeks. I just uploaded all the photo's and Video. Amazing wide screen photo's.  Love love love this camera", "Date": "January 17, 2009"}, {"Title": "Defective Camera, Lame Service", "Author": "J. Arthur \"Cineluxe\"", "ReviewID": "R1UU7DW7425V1B", "Overall": "1.0", "Content": "Bought a Samsung NV24HD digital camera from Amazon on May 24, 2008. When I tried to register it online, I'd get a message that it wasn't a valid serial number. I didn't give that much thought, thinking perhaps they hadn't caught up with their production. Today is July 17, 2008 and they still haven't caught up.I have found the camera difficult to set, difficult to use, and I've been unable to download pictures from the SD card unless I put the card in my Canon camera which works fine. I loaded the Samsung Master software into two PCs running Windows Vista. Neither computer recognized the camera. After an hour on the Samsung tech line it was agreed the camera is defective. When I asked for an address where to send it, I was asked for the serial number. I read it off and they told me it is not a valid serial number. Upon speaking to a higher up it was finally admitted the camera was manufactured in April of this year, \"but we probably haven't caught up.Amazon refused to give me a full refund. They did tell me I could return the camera and I'd receive a partial refund. How much? I asked. That's up to the return department after they inspect the camera. Under those terms they could return me $25 bucks on a $300+ camera.If I send it to Samsung for repair I will not actually be sending it to Samsung. While SONY maintains its own repair facilities, Samsung hires it out to someone on 6th Avenue in NYC. Would I buy another Samsung product? I don't think so.", "Date": "July 17, 2008"}, {"Title": "NOVICE", "Author": "Carlos Midence", "ReviewID": "RCUXVUG2ALJV8", "Overall": "3.0", "Content": "I like the NV24HD my only compliant is the it features and abilities are difficult to learn and to remember. There's a lot to learn and a lot to read, I wish that it were more simple and easier to use in taking full advantage of its abilities.", "Date": "October 8, 2008"}, {"Title": "Not so thrilled!", "Author": "M. V. Vooren \"velvetpaws999\"", "ReviewID": "R3G8JMPRTQ50RI", "Overall": "2.0", "Content": "When I saw this camera while a visiting friend from Germany was using it here, I was mightily impressed. He had taken pictures from the plane, showing the glaciers on Iceland, and these were stunning in sharpness and detail. So I ordered the camera for myself that same day. I found that getting used to the cross-reference button system on the back is very awkward, because the documentation coming with the camera is more than poor. The dials on the top left and right will display their functions on the rear view screen, but it is so fast and short, one has no time to actually read what it is. So that makes it a guessing game of frustration. The camera is best used with a tripod for pictures, since 10.2 meg pixels are nice, but!! if you shake it even the slightest bit, say goodbye to sharpness.It gets worse when taking video clips: One of the reasons why I bought this camera is that it claims you can zoom while taping, well, you can, but!!! no sound during zooming! And the zoom is so fast, it makes for a race car type take-off, no subtle zooming back and forth. Before you know it, you're all the way in or out. Not good at all. When I played back the first set of clips, I noticed that the sound track was finished playing back way before the images were, about 20 % faster. I called Samsung and they said my camera was defective. So, they suggested I have it repaired. When I told them I had not envisioned to buy a \"new and already repaired\" camera, they said that is the way it is, we do not replace flawed cameras, basically that I was unlucky to have gotten a bad apple. I could probably have waited and bought a refurbished one for less. Also, they expected me to pay for shipping in order to get it repaired. Not much of a customer friendly attitude, by my book.Now, I am returning the little cam to Beach Camera, and they haggled with me over the situation: at first, they did not want to take it back, because I only called them after 5 weeks of the purchase. They let you return it up to 4 weeks only. When I told them that the product was flawed and malfunctioning according to Samsung, they finally agreed to take it back, but I had to haggle over the reduced reimbursement amount. They wanted to deduct 15%, I finally, after 3 conversations, got them to deduct 5 % of my purchasing price. I guess I'll return it for that and cut my losses. My conclusion is to stick with camera brands like Nikon, Canon, even Kodak, but no more Samsungs!", "Date": "September 23, 2008"}, {"Title": "Simply Amazing", "Author": "Anh-thu T. Nguyen \"Trish Nguyen\"", "ReviewID": "R10GS000Z92Z8R", "Overall": "5.0", "Content": "This is an amazing camera! I absolutely love it! So compact and sleek plus HD! I went to Disney world and used this camera through out the whole trip! What better way to capture the magic then with this camera!", "Date": "August 17, 2008"}, {"Title": "Coolio little camera.", "Author": "David Fox \"davidwfox\"", "ReviewID": "RLXFE28BCAV4R", "Overall": "4.0", "Content": "I like it - works well. Very small. Great screen and terrific wide angle lens. I'd prefer a touch-screen rather than the buttons. But all in all a good buy.", "Date": "May 21, 2008"}, {"Title": "Weak camera - I sent it back for a refund", "Author": "Geoffrey Unger", "ReviewID": "R2C9U3AYXAN7ZE", "Overall": "2.0", "Content": "I purchased this camera based on the specs mostly - 720p video, stereo audio, 10MP still images, optical image stabilization, and high ISO. Sadly the camera was pretty much a disappointment from the minute I started using it. First off the camera's design and slick body makes it difficult to handle. The pop-up flash is annoying and unnecessary. The user interface, while unique and potentially cool, has very annoying glitches in it's implementation. Overall still image quality was very weak. The auto white balance failed many times in normal indoor light, rendering yellow tinted images. Shooting in low light with the image stabilization rendered images with heavy noise reduction artifacts (the NR can't be turned off) which created strange \"marbling\" and lack of contrast. The so-called \"720p HD video\" looked very poor. The VGA video from my Canon SD 870 IS was far sharper and clearer. The stereo audio was passable, but nothing to write home about. I sent this camera back for a refund and ordered a Canon SD 880 IS.", "Date": "December 17, 2008"}, {"Title": "Didn't last too long", "Author": "timos \"timos2\"", "ReviewID": "RRBDHE5IJUDJ5", "Overall": "2.0", "Content": "Not every camera will have this problem, I'm sure, but my lens jammed in the \"out\" position about the 4th time I turned it on.Batteries are charged, I pulled them out to let the camera reset, and I even tried with the AC adapter.  It grinds the lens motor a bit and beeps what must be an error beeps when I turn it on, and then it shuts down.So back to the vendor it goes.Seemed like an OK camera for the few minutes I was able to use it.  The zillions of soft buttons around the display seems like a way to avoid the expense/challenge of a touch screen.", "Date": "October 16, 2008"}, {"Title": "Nice camera but problem with charging battery", "Author": "Gisella Patharkar \"plant and photonut\"", "ReviewID": "R3VW6KR06KBNN0", "Overall": "3.0", "Content": "I ordered this camera for my sister who has HDTV. She wanted to film a wedding. I practiced with the camera so I could give her a quick intro.Screen nice and clear and takes nice photos. It warned that battery can only be charged when directly inserted into a contact, i.e. no power strip.It worked at my home. However, at the Palm Beach hotel in Miami (fancy hotel) when plugged directly into an outlet, it refused to charge the batteries (she had ordered two additional lithium batteries). In addition even when it is charging an arrow turns red, but it never turns green or stops glowing red, hence only way to check is to disconnect camera and then open camera to check status of battery. We ended up returning camera to the vendor. Plug into camera also leaves some leverage. Unable to watch video on laptop which has Vista.", "Date": "June 14, 2008"}, {"Title": "Hole for tripod?", "Author": "HouseSeller \"House\"", "ReviewID": "R3MOYI4GWOY5AW", "Overall": "4.0", "Content": "Does this have a hole in the bottom to attach the camera to a tripod?  I've seen no pictures of the bottom or specifications saying it does, and I want to use the camera to take pictures of rooms in houses I have for sale, rotating the camera on my tripod and stiching the pictures together afterwards.", "Date": "September 3, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001283GIM"}}