{"Reviews": [{"Title": "Nice Camera", "Author": "Roderrete Mcclure", "ReviewID": "R3BETBNFODXV1F", "Overall": "5.0", "Content": "I install security cameras for a living DVR systems etc.I purchased this camera just for my home great camera for the price!", "Date": "March 12, 2010"}, {"Title": "Sort of a crap shoot", "Author": "Portland Ghosts", "ReviewID": "R1HMLIIKMJYZRB", "Overall": "3.0", "Content": "This is my 4th CCTV day/night DVR security camera I have purchased for my paranormal ghost hunting group and it can be real hit or miss.The first VideoSecu camera I purchased is larger, built out of metal and is solid. Second one was like a mini-me version of the 1st one and about 1/3 the size. The last two (including this one) are made of plastic and the base stand is simply awful. The video quality is decent but it's pretty much 100% plastic and the base truly is horrible. Comes with a power supply and a 50' RCA cable which is nice but you're getting what you pay for when it comes to the price of the camera. I use these for ghost hunting so that's fine. If you are relying on this thing to protect your home or business I would go with something constructed far better than this.", "Date": "December 4, 2010"}, {"Title": "Good camera for price", "Author": "bigfrank", "ReviewID": "R3CX7HEVDE531D", "Overall": "4.0", "Content": "For the price, this camera is what I expected.  The image quality is good enough for general purposes, and really quite good for close range.  The IR is somewhat weak, so don't expect more than about 15 feet in the dark.  For an example, during the daylight hours, the camera can see all the way to the end of my driveway roughly 150' with pretty fair clarity, but at night it can't see to the end of my deck at 35'.  As for what you get, the power supply, 50' of cable, and camera is a good deal for the current price tag.", "Date": "August 17, 2010"}, {"Title": "Very nice!!!", "Author": "Debby", "ReviewID": "R1FUPTJEPOT16", "Overall": "5.0", "Content": "I bought these and then called them a few times asking ? Before they shipped it. I ended up having them upgrade the cameras to more sturdy & metal. It was not that much more & great. I can see all around my home now. I can't believe it. They are so clear!!! The wiring was enough to go all the way around from my TV set. I love being able to check a noise outside by switching to the cameras from a tv program. The box with the remote control was $30 from radio shack. The box fits on the led tv & the four wires go to the back of the box. Easy to install. Cameras are small & people don't see them but it has a wide area view.  When theres a knock on the door; I look on the tv to see of it's a stranger. I love it!!! I can see my neighbors across the street. I was worried about the dogs going nuts every night. Now, I know it was a squirrel!! I went out to run him off. He went to the middle of the road & stared at the house for about an hour. He's back but I just fall back to sleep. Peace of mind!!", "Date": "October 6, 2011"}, {"Title": "Great Price", "Author": "T. Goodwin", "ReviewID": "RSXG6QQJLLKRU", "Overall": "4.0", "Content": "Great IR for the price and works nicely with my tripod. A great starter IR for someone who is just getting into paranormal investigating like me.", "Date": "April 10, 2010"}, {"Title": "DECENT LITTLE CHEAP-O CAMERA", "Author": "Apache Paul", "ReviewID": "RCHZWWSF52XYH", "Overall": "3.0", "Content": "I USED IT INDOORS.  WITH IT'S PLASTIC HOUSING AND MOUNTING BRACKET, I CAN'T VOUCH FOR HOW WELL IT WOULD HOLD UP OUTDOORS.  30 FOOT CABLE LIMITS YOU TOO.  IMAGE QUALITY IS ADEQUATE FOR GENERAL SURVEILLANCE.", "Date": "June 2, 2010"}], "ProductInfo": {"Price": "$351.99", "Features": "36 IR illuminators for night vision. Horizontal Resolution: 520 TV lines. Lens: 6.0mm\nBuilt-in audio microphone and built-in mechanical IR-Cut filter switch\nAluminum housing for indoor outdoor application. Built-in light sensor controls IR activation\nAffordable day night audio video CMOS security camera. NTSC signal system\nPackage including: 4 of security cameras, 1 of 4 channel power supply, 4 of audio video power extension cables and 4 of bonus security warning Decals", "Name": "VideoSecu 4 Pack Audio Video Outdoor Day Night Security Camera IR-Cut Filter IR Infrared for CCTV Surveillance DVR System with 1 of 4 Channel Power Supply and Extension Cables IR809AS WM9", "ImgURL": "http://ecx.images-amazon.com/images/I/51vGNR5kBWL._SY300_.jpg", "ProductID": "B0015ZUJLE"}}