{"Reviews": [{"Title": "Pretty cool little gadget", "Author": "B. Billington \"BillyGoat\"", "ReviewID": "R3SL0OTAWX5SWY", "Overall": "5.0", "Content": "This is the first digital camera I've purchased, and so far I think it's pretty awesome.  I'm a little technophobic, and have always loved taking pictures with my old Pentax 35mm manual, but this camera is great for what I'm using it for, and has allowed me to learn how to take better pictures.As a student I wanted a lightweight camera with a nice lens that could easily be taken on a study abroad trip, as well as on backpacking trips and hikes.  This camera has a Leica lense, which is of great quality glass and this company makes very decent microscope lenses so I figured it'd be a solid quality-over-quantity purchase.This camera has performed exceptionally well on the snowy and overexposed summit of a 14,000 ft peak, and the quality of the pictures are more than I had hoped for.  It's very easy to understand, especially for someone who isn't great with modern gadgets.  The zoom can get very detailed close ups of animals, and there are many options for different scene modes, including candlelight and starry sky scenes, but if you're into not thinking about it the intelligent auto mode is very efficient and consistently takes nice shots.  Manual adjustments can be made to compensate on different exposures, one can edit the picture from the camera before downloading it onto a PC, and it often finds and focuses on faces automatically.Another nice addition is trip planning and the calendar, where if you're going out of country or far away you can set the time of your journey and pre-set the time ahead or behind, which I think is great because I like to know when I took pictures and in what order.  The manual is easy to understand, too.Overall, excellent camera for someone not wanting to spend a lot, like students and most people :)  I think it's a good introduction especially for people who are used to old point and shoot cameras, but it has enough to offer to teach people to be better picture takers.", "Date": "June 19, 2008"}, {"Title": "Like anything, familiarity develops simplicity", "Author": "NeuronPetkowski", "ReviewID": "R41UPZVW066PP", "Overall": "5.0", "Content": "I've owned mostly Nikon Coolpix point and shoots for years and nothing was more complex than the interfaces to these cameras. So when I got the Lumix, I expected the same. But unlike the previous review, this camera was very simple to understand. Maybe going from the harrowing interface of something like the Nikon to something fairly simple like the Lumix made it an easy transition (kind of like driving BMW with i-Drive to a Honda). Don't get me wrong, I love the Nikons, but the Lumix's portability (small, small size), Leica lens and wide angle ability, is simply the best.The battery and SD card placement is well designed (meaning, next to each other with one panel opening to deal with). Trigger button is significant and zoom in and out switch is where you'd want it. The screen IS the back of the camera, which grants a viewing area that's impressive.It's solid in feel and again, small enough for the pocket, bag, and hand palm. It's size is also one of those things that make you think, \"I could lose this\", but that's the price of it's footprint. Just look after your stuff - or yeah, you'll lose it.Pics are very good. At 10MP, details are impressive. The wide angle tends to add a parallax, but nothing that's significantly distorting.Check this camera out, by all means - especially as the vacation documenting device that is simple to take, simple to use and easy on the wallet.", "Date": "June 13, 2008"}, {"Title": "great camera", "Author": "Peter Lundeen", "ReviewID": "R2NPA3OS7VPDNX", "Overall": "5.0", "Content": "This is my third digital camera and by far the best. I used it for a trip to England. It worked beautifully in a wide variety of settings. For the most part I used the \"auto-settings\" and I got great pictures from closeups to distant landscape, indoors in old building lighting to bright backlighted outdoors seens to low light nighttime indoors. The anti-shake features eliminated any user problems for high speed pictures and rapid ready to shoot and multiple shot in a row options. The design for the memory card and battery in the same slot is well thought out and easy to use. I didn't begin to scratch the surface of the additional features since the auto-settings worked so well. I have had Sony Cybershot and Olympus Camedia Ultrazoom cameras before and this is by far the best performance and far better value for the price at less than $200. I recently had a water mishap with my camera that unfortunately caused my camera to die and I immediately replaced it. (taking a full immersion in a canoe mishap is probably more than any digital camera is designed to handle)", "Date": "September 4, 2008"}, {"Title": "Excellent User Friendly Camera", "Author": "J. Miller", "ReviewID": "R3IK4UBZYE356C", "Overall": "5.0", "Content": "This camera is everything I hoped for in a point and click camera.  The shutter speed is much faster than the Kodak or the Canon that I tested out in stores.  The picture quality is great, the extra features on the camera are awesome, and it is small and lightweight.", "Date": "August 23, 2008"}, {"Title": "Excellent camera!", "Author": "Marnie Morneault", "ReviewID": "R1XGC0HX16YTUI", "Overall": "5.0", "Content": "This camera is the best one of the 4 digital cameras I've owned.  the picture quality is fabulous and it is fast!  I would highly reccommend it!", "Date": "August 31, 2008"}, {"Title": "Great Camera...my sister said!", "Author": "Andrea S. \"=)\"", "ReviewID": "R28JI36CHONTHI", "Overall": "5.0", "Content": "I didnt get this camera for myself, it's my sister's. She loves it. She told me it's a little bit complicated, because it has so many functionalities. But it's worth investigating and learning. I know Lumix, and the pictures are pretty great for a point and shoot.Also, i really like the pictures this camera takes with flash. I own 2 cameras, one SLR and one point and shoot. My point and shoot doesnt take very good pics with flash. It's a great PRO for Lumix in my opinion.You're not going to be dissapointed with this camera...plus the size it's perfect, not to big, not so tiny it's impossible to use!", "Date": "July 2, 2008"}, {"Title": "Bite-size camera takes sharp pix!", "Author": "S. Levine", "ReviewID": "R37D9C5VZKQJG5", "Overall": "5.0", "Content": "I wanted a small camera to take on vacation.  Although I've always used Canons, I decided to buy the Panasonic based on its great reviews, the Leica lens, and the image stabilization feature.Well, it certainly is pocket-sized, but since the monitor covers almost the entire back of the camera, it's very easy to see what you're doing.  The \"intelligent auto\" mode makes it relatively simple to use right out of the box.  The camera has lots of nice advanced features, too, some of which take a bit of reading and practice to figure out.  (I'll be working on that for a while.)  It does remarkably well in low light, even without tripod or flash.  My vacation photos came out crisp and beautiful.  Highly recommended!", "Date": "October 26, 2008"}, {"Title": "better than kodakz1275", "Author": "Apoorva Srivastava \"appie\"", "ReviewID": "RKOY89UPBFYX7", "Overall": "4.0", "Content": "after using panasonic 10mp...i realized that the picture quality and the battery are more superior than my previous kodak z1275. I must all add that the image stabilizer is also good.", "Date": "July 29, 2008"}, {"Title": "Great camera for the price", "Author": "David Paganetti \"Chi Man\"", "ReviewID": "R4KZ4HSD0AKS1", "Overall": "5.0", "Content": "Being a novice photographer I wanted a camera thath would take a clear picture and one that i didn't have to fuss with or take ten minutes to take a picture.  The Panasonic Lumix DCM-FS5P-K has proven to be just what I was looking for.  Once I have it set up I can aim and shoot and get clear 10.1  MP pictures.  The price was excellent compared to others in its class.  It is small enough to put in my shirt pocket, but has a large enough screen to view all the action.  I am still getting used to all the manual features it offers and hopefully will be able play with these and get good results. I would highly recommend this camera for a novice like myself. The inital setup was easy and from there I am enjoying the pictures.", "Date": "December 12, 2008"}, {"Title": "Poor focus, slow shutter response, what's the point of using it?", "Author": "jbjb", "ReviewID": "RPO8QYKKNO71V", "Overall": "1.0", "Content": "I bought this as a pocket camera to complement my D-SLR (there you have it, I know what a good camera should produce), and my expectations were low, as I didn't need this to be a 'great' camera.I used the Panasonic to take about 200 pictures in varying conditions inside and outside.  In all environments, about 2/3 of the pictures were out of focus as the camera tried to focus on random things in the field of vision.  The shutter response (e.g., from when you push the button to the time it captures the image) was also incredibly unpredictable (sometimes instant, sometimes 3-5 seconds).The control buttons for the camera are also incredibly small and close together, leading to inadvertently pressing them.I've used many other sub-compact cameras, and while many of them mis-focus some of the time, this Panasonic sets a new (and unacceptable) low.", "Date": "January 7, 2009"}, {"Title": "Good little pocket sized camera. Great for travel.", "Author": "VWBugGeek", "ReviewID": "R4H6WMYKJ9CV7", "Overall": "4.0", "Content": "We bought this camera at an airport on our way to Europe because we had forgotten to pack ours. We didn't have many camera choices and just hoped for the best. Well, turns out it's a good little camera with long battery life. We've since given away our old travel camera and taken this one to several countries. It's light and small and can be tucked into a pocket or purse. Which is great considering all the luggage restrictions these days. It takes great outdoor daytime, indoor flash, and micro pictures. It also takes decent video to share online with friends and family. Drawback: Outside at night and in places like museums with low light where we aren't allowed to use a flash, the photos come out dark and/or fuzzy. But overall, it's a decent and durable camera with a lot of features in a tiny package.", "Date": "September 1, 2011"}, {"Title": "Great camera, but it's not red.", "Author": "married with kids", "ReviewID": "R1V9M5WH0P9YL3", "Overall": "4.0", "Content": "My biggest issue with the FS5R is that the image of it online when I was purchasing it was deceivingly more red than the camera is in real life.  It is very much a pink camera.  Although both my wife and I use the camera, I do tend to be the primary picture taker for the family.  When friends and family and strangers address the fact that I'm using a pink camera I simply have to play it off that it is my \"wife's camera.\"Now, I'm done with the FS5R, let's take that \"red\" R off and talk about the FS5.  We've had the camera for over a year now and while I do have to play with the settings some to get the right shot in the right lighting conditions, I have been very pleased with the quality of the photos we've been able to get out of a point and shoot product.  Outdoors the camera is very easy to get what I want in a quality photo.  Indoors and lower light situations are where the playing with the setting usually come into play.  Although not always the case, the cloudy preset for the lighting tends to be the setting that works best for most indoor situations, but I tend to attempt a test shot at using a couple of the presets and I feel the quality of the image in the viewfinder has been more than sufficient to help me determine which setting is going to get the best looking picture.  Overall, my pictures are important to me and this product has met my demands relative to the price we paid for it.One more thing of note that I don't seem to see in many reviews relates to the durability of the product.  We've tried to be pretty nice to the camera so it will last us for many years, but it has not been pampered by any stretch of the imagination.  We don't have a dedicated case for the camera as it spends most of its time in my wife's purse and our three years old has run off with it a couple times to try his hand at photography, and while I wouldn't suggest allowing a small child to play with this as a toy, it has yet to break or have any issues suffered from its occasions of having been used without proper adult supervision or any issues related to banging around into others things while travelling in the purse.", "Date": "November 25, 2010"}, {"Title": "Great point and shoot camera", "Author": "Audio Guy in NC", "ReviewID": "R38GVKMOULQ5DV", "Overall": "4.0", "Content": "I'm not a professional photographer.  I got this camera to use on the spur of the moment or for those walking moments when you just want to snap a picture.  I like the size, the feel, and the picture quality a lot and recommend it.  I'm into other technologies, and in those, can subject any purchase to exhaustive, punishing tests.  Photography, I'm not able to do that.  But, for what I got this camera for, it is great.  The pictures are clear, it is fast enough for me, and has a classic look that I like a lot.  The Leica lens is a great feature, since I cannot afford a Leica.  I'm sure when \"fighting breaks out,\" this camera will document just as well as a Leica will do.Update:  I have had this for a few months now,and it remains for me, a great camera.  I use it for 'documentary' photos, and in that role it does very well indeed.  It is easy to use, and has a retro look that I appreciate.", "Date": "March 17, 2009"}, {"Title": "Good value for the money", "Author": "P. Daniel \"Killer Catbert\"", "ReviewID": "R17Q69NQ53T7PC", "Overall": "5.0", "Content": "This is an update of a review I wrote January 2009.  I bought this camera on Amazon after doing a fair amount of research and comparison shopping.  My husband and I debated about whether to make the move to a digital SLR with our next camera purchase or stick with a point-and-shoot digital.  We decided to go with the cheaper option and will wait a year or so to take on an SLR.After doing some research and reading reviews, I chose the Panasonic Lumix DMC-FS5P.Pros:*Good, Clear Pictures.  I took a sunset picture over the lake and it looks like a professional took it.  Be sure to play with the different picture modes so you know which one to use at the right time.  The sunset mode works great!*Decent processing time - not lightning speed, but much quicker than our old Kodak so we're not waiting 15 seconds for the camera to process between each shot*10.1 MP and 4x optical zoom is a good deal for the money*A good camera to use if you are not quite ready to move into the realm of digital SLR*Battery life is pretty good, but I recommend purchasing a second so you always have a charged one on hand.Cons (if you can call them cons):*It's small - so it's easy to lose if you don't purchase a camera case for it.*Because it's small, you might be tempted to carry it in your pocket where it could be easily damaged.  Manual even warns not to do this.  When I wrote the review in January, I was worried about the \"easily damaged\" disclaimer, but it has held up well after 1 year of use.*Not a lot of accessories - Tried as I might, I couldn't find a silicone skin that is made for this particular camera.  I thought that it might help protect it a bit from bumps and drops.Be sure you know the level of zoom you will want to use.  My only disappointment with this purchase was that I didn't get a Lumix model with a higher optical zoom ability.  --That's my fault, not the camera.  Overall, a great little camera for the money.  Panasonic did a great job on this one.", "Date": "January 15, 2009"}, {"Title": "Simplicity", "Author": "Amr Marzouk", "ReviewID": "R3S93R9JU2X2ZY", "Overall": "5.0", "Content": "My third Panasonic ,they get better, cheaper and  simpler to use every time . Great Value", "Date": "August 13, 2008"}, {"Title": "To the Blurry Review Person", "Author": "Angel_Boy \"Treat the people around you the wa...", "ReviewID": "R16RSO9LR8GHRV", "Overall": "4.0", "Content": "You need to set camera to auto or a HIGH ISO to not get blurry pictures. If you had yours set to a low ISO--you will get blurry pictures_so you got what you set the camera for. Should have set it on smart scene select.", "Date": "October 18, 2008"}, {"Title": "Lumix FS5K", "Author": "Lee E. Olson", "ReviewID": "RMSFZ7V8VSFX3", "Overall": "5.0", "Content": "This is a great, sharp, easy to use (after a slight learning curve), uncluttered, and pocketable little camera.  I matched it up with a cell phone case and I'm ready to go.", "Date": "September 30, 2008"}, {"Title": "Excellent!!!", "Author": "Maie W. Coronado", "ReviewID": "R6GY1CO4E2ODJ", "Overall": "5.0", "Content": "Excellent!!! A great way to shop... I recomended for everyone. You get what you want without moving from ypur home", "Date": "October 5, 2013"}, {"Title": "I like it", "Author": "Me Too", "ReviewID": "R134V0K1SMW6SF", "Overall": "5.0", "Content": "Great! This is a good item and it will be use for a long time to come.  I like it.", "Date": "December 28, 2012"}, {"Title": "Didn't last", "Author": "Michael R. Beatty", "ReviewID": "R1Z5BCOCMXPPVI", "Overall": "1.0", "Content": "It was a great price on a nice compact camera.  The problem is it started having problems after about 9 months of use.  It would do an auto shut down everytime I turned it on after about 15 seconds.  I checked for patches and updates to the camera's firmware at the manufacturers website but they didn't have one.  I did make sure I had fully charged batteries, etc.  If the Camera was in \"movie\" mode; it would not shut down, only when on \"auto\" for taking pics.  I am fairly \"electronic capable\".  I've built computers from scratch, I set up my wireless network at home for 4 laptops, a desktop, and a wireless printer.  So I can tell you that there was something wrong with the cameras \"firmware\" and the manufacturer did not have a fix or even a download for the \"firmware\" so I could re-install it.  Camera went in the trash can and I will never buy another Panasonic Camera!", "Date": "March 25, 2011"}, {"Title": "Love this cameara", "Author": "Avu Sankaralingam \"Concord, CA\"", "ReviewID": "R1H0CAM5PV61YL", "Overall": "5.0", "Content": "This is a really nice camera and easy to use.  Takes great pictures and the video is fine too.Surprisingly decent video and sound.Battery life is good and response is pretty snappy for the most part.  It is a great looker and the build feels solid.My one misgiving:  Flash pictures in low light situations have really bad color (class plays for my kids).  So I have to turn flash off when I am taking the picture.  Yes I understand that the flash is not meant to light up the whole world...but still I wasn't that far away.  So I'd say the flash is on the weak side.But I still would buy this camera if I had a choice again.", "Date": "February 2, 2010"}, {"Title": "great camera!", "Author": "little rooster", "ReviewID": "R1B2WO6COMS2VN", "Overall": "5.0", "Content": "This is a great camera and an excellent buy. I purchased it for my teenage son and he loved it. Too bad he LOST it on our trip to Israel this past summer along with the over 100 pictures he had taken!", "Date": "November 13, 2009"}, {"Title": "Great, durable camera", "Author": "J. Eynon", "ReviewID": "R2PCCHRTJGV6I9", "Overall": "4.0", "Content": "This is the fifth digital camera I've owned and it was by far my favorite.  Excellent pictures, great ergonomics, and intuitive menus paled in comparison to its best feature: durability.  This camera has been dropped countless times, left on the beach overnight, dropped in the ocean all without missing a beat.  It nearly survived being washed and dried in the pocket of my shorts.  I recommend the Lumix series to anyone who's looking for a pocket digital camera; I just bought another one to replace my old one.", "Date": "February 27, 2009"}, {"Title": "Great Camera!  Takes clear pictures even when you're moving!", "Author": "C.R.", "ReviewID": "R3BBWGHE9391WV", "Overall": "5.0", "Content": "I'm usually not a big picture-taking person and it always seemed like when I used my friends' cameras the pictures would turn out blurry; I guess I'm a bit shakey.  With this camera however, that never happens, and I can take pictures while riding in the car, or at a party, whatever, they still turn out!  Very good for candid, on-the-go photos, and the camera is a nice size as well, so it slips into your pocket easily.", "Date": "February 24, 2009"}, {"Title": "Great Great buy!", "Author": "Krista V. Vanore", "ReviewID": "REPFPFTE3W7SS", "Overall": "5.0", "Content": "I have had a couple of digital cameras in my time...and finding this one was the best money I have spent over all. In between having two Lumix's, I had bought a Kodak point and shoot. Believe me, the Kodak is NO comparison to this camera!The Lumix is small for a digital camera, small enough to slide into your jeans pocket, the perfect size.The back of the screen is a huge LCD screen, it makes taking pictures fun and enjoyable. The settings are easy enough to understand, there are only a few different buttons to deal with, nothing too complicated.I am in love with this camera because at such a good value, it takes TREMENDOUS photos. I lost this camera in Ireland and was sad because now someone else has the pleasure of using it!! The picture quality is great, and 10 MP is quite alot for a tiny point and shoot camera.I would recommend this camera to anyone, a student (like me), a family, young or old. I rave about this camera to all my friends", "Date": "February 15, 2009"}, {"Title": "Satisfied customer", "Author": "C. Johnson", "ReviewID": "RXSCE9IKMQPDD", "Overall": "5.0", "Content": "Excellent camera. Easy to use, can leave it on auto and it will do the rest. One warning to those who are color sensitive: it is bright pink, not at all red. Otherwise a fabulous camera!", "Date": "January 30, 2009"}, {"Title": "Bought as a gift", "Author": "Desert_Dog", "ReviewID": "R29Y42OIVQ17H1", "Overall": "5.0", "Content": "I bought this because of my experience with Panasonic cameras, some on-line reviews and the price point. I bought it for a friend that wanted a small point and shoot to use when she didn't want to carry her SLR. I didn't test it much, but I do like the layout and feel. It also has great optical image stabilization. She is happy with the pictures and I haven't seen the SLR since. This model has just been discontinued because The FS7 and FS15 will be released in late March. I'd look for a closeout deal or wait for the others to release since the MSRP is actually lower then The FS5 MSRP.", "Date": "January 22, 2009"}, {"Title": "Super, Super!", "Author": "Batman007", "ReviewID": "R2UB677QY8LG44", "Overall": "5.0", "Content": "Light weight, super zoom for a small pocket camera, great iA mode which is fabulous if you are taking pictures of active kids like me, nice large screen on the back, buttons easy to work. Great buy overall if you are looking for a good quality lense in a small camera.", "Date": "January 6, 2009"}, {"Title": "AWESOME", "Author": "S. M. Lankhaar \"S.M.\"", "ReviewID": "R2IAONP6KC2RG3", "Overall": "5.0", "Content": "I have purchased many cameras over time, but this camera is by far the best!  The picture quality is amazing.  When I take the pictures and have them developed, I've been asked on several occasions if they were taken by a professional.  This camera is awesome and the price isn't bad either!", "Date": "January 6, 2009"}, {"Title": "My wife loves it!!", "Author": "H. Harrell \"Golfnut\"", "ReviewID": "R3H4MN1YCLD3SL", "Overall": "5.0", "Content": "I purchased this camera for my wife.  She has mastered it in a very short while and loves it.  It's very user friendly and takes the most magnificent pictures.  I rate it among the very best purchases we've made!", "Date": "January 6, 2009"}, {"Title": "Great photos!!", "Author": "artist girl", "ReviewID": "R1AKTQNLEBML3Z", "Overall": "5.0", "Content": "I love this camera. The quality of the photos is fantastic. The way the camera captures the photo even if my hands are moving is fantastic. Rarely a blurred shot. It seems to grab the image and hold it still! Nice big 2.5 inch LCD screen too. Very easy to use. I bought another one for a friend. I've had Canoncameras before and really liked the photo quality but the Leica lense on this camera is just as good..to my eye. I do a lot of photo art work....turning photos into note cards etc and I'm very satisfied with the photo quality. So much bang for my buck and now that these digital cameras are so small....it's easy to keep it in my purse.", "Date": "December 27, 2008"}, {"Title": "somewhat difficult to use", "Author": "Dawn Holley", "ReviewID": "R338G85MUQG8BY", "Overall": "3.0", "Content": "navigating thru the menu proved to be difficult to understand.  The instruction booklet is even worse.  There is no eye view finder and it is difficult to see the object of focus in bright light.", "Date": "December 22, 2008"}, {"Title": "nice little camera", "Author": "Mar \"Marinera\"", "ReviewID": "R37HQ7CUUFY1YI", "Overall": "5.0", "Content": "i got this for 100 dollars and its very nice quality leica lense is the best. i love the nice pictures it makes. its a shame is not a 3 inch lcd but its ok.", "Date": "March 16, 2009"}, {"Title": "Nice, but has problems in low light.", "Author": "Joseph Gonzales", "ReviewID": "R113EID5KX87HL", "Overall": "4.0", "Content": "This camera is nice because of all the manual features, but in low light conditions it takes dark pics.", "Date": "January 6, 2009"}, {"Title": "Great Camera", "Author": "R. Wark", "ReviewID": "R9YDX21NSGA6W", "Overall": "4.0", "Content": "I purchased this for my wife and she loves it - a nice size, easy to use, good features.", "Date": "January 18, 2009"}, {"Title": "Dust inside camera", "Author": "R. Holgate", "ReviewID": "R20BWBKIPSMF83", "Overall": "2.0", "Content": "Awesome functions for the money and a very nice little pocket camera, I purchased after reading several reviews, including those on dpreview.com.  It appears however that the camera I received had dust inside the camera either on the lens or sensor.  Every night shot taken with the flash would reveal the pesky dust sprites, as this camera was purchased mainly as a carry camera to take photos at night, I was forced to return the camera, as there was no way to clean the camera that would remove the internal dust.", "Date": "January 12, 2009"}, {"Title": "Good, but horrible", "Author": "C. Scott", "ReviewID": "R12JTCURR5S5VB", "Overall": "2.0", "Content": "Never purchased a panasonic camera before, and probably wont do it again. The camera it self is well built and very easy to use. But the picture quality is terrrrible, when you zoom into the image on the computer you can see all the pixels are just a big mashed up mess, with no detail at all. Its great if your just making 4x6 prints. But if you want anything else i would stray away from this camera, its processor is obviously not powerful enough for the 10 megapixel censor.", "Date": "December 27, 2008"}, {"Title": "DO NOT BUY.  SHODDY CRAFTMANSHIP", "Author": "Just a Guy", "ReviewID": "R1391Z83NNZWHC", "Overall": "1.0", "Content": "Too bad I couldn't give 1 star.I had an older Lumix that lasted two years.  When that camera was stolen, I purchased this model from my local B & M.  The first time I took it out, I used it 8 times.  I put it back in the case and when I checked the camera the next morning, the LCD display was cracked in the back of it.  This happened when it was in the padded camera bag I had in my pocket.  I emailed panasonic, they emailed me back 5 days later and told me to send the camera with a check for $52.50 and they will tell me whether the warranty will be honored.  1/3 the cost of the camera, just to tell me if they will fix it.  Unbelievable.", "Date": "January 26, 2009"}, {"Title": "A little confusing to use but that could be my fault", "Author": "dori mondon \"dori\"", "ReviewID": "RIOMRSB74DMKR", "Overall": "3.0", "Content": "I've owned this camera for just about a month now after dropping my beloved and four-year old Sony Cybershot into the ocean.  I debated buying another Cybershot (it would be my third) but decided to go in for a little variety instead. My Cybershot sported a Zeiss lens (i'm a former film photography enthusiast). This Lumix sported a Leica lens and you can't really beat the price for a 10 megapixel, leica lens digital with some built in memory and i really wanted the wide angle lens (which is great, as is the image stabilization).  I also looked at the Olympus Stylus of the same size; however, the word \"proprietary\" was mentioned far too often in regards to the Stylus so in the end, I went with the Lumix instead.At this point, however, I'm a little disappointed - the Cybershot was much simpler to use. Dare I say it but there might just be TOO many options on this particular P&S.; I honestly think I might have been better off sticking with an interface I was familiar with.As someone who's tested the usability of an interface more than once in her life (professionally) - I always found the Cybershot to be so simple I had no need whatsoever to view the manual (this has always been my #1 indicator of a good interface). Not so much with this one - I can't even figure out how to delete multiple images at once on here, or whether I have the option to manually set my shutter/aperture. In addition, since I am a photography enthusiast, I find some of the presets wanting and as of right now, I can't figure out how to tweak them to my own specifications.Perhaps it's time to change my tactics and resort to the manual.", "Date": "May 13, 2008"}, {"Title": "Beach Camera", "Author": "T. J. Pfeiffer \"Wise Shopper\"", "ReviewID": "R2YGU244UCKVAT", "Overall": "5.0", "Content": "I purchased a Panasonic Lumix camera from Beach Camera, Edison NJ through the Amazon website.  Beach Camera shipped my camera via FedEx overnight (only charging me for standard shipping).  My camera arrived in perfect condition, and I'm very happy with it. I also paid about $40 less ordering from Beach Camera than what the Panasonic site was charging. Amazon has never disappointed me.  I always find the best deals, and the vendors are top-notch.  I can trust ordering from Amazon, and the customer service is great.  Keep up the good work, Amazon!", "Date": "April 30, 2009"}, {"Title": "Excelent", "Author": "Marco Villamizar", "ReviewID": "RF95WL1WQYHD9", "Overall": "5.0", "Content": "Panasonic Lumix DMC-FS5P-K 10.1MP Digital Camera with 4x Wide Angle MEGA Optical Image Stabilized Zoom (Black)", "Date": "November 22, 2008"}, {"Title": "Noise, noise and more noise", "Author": "L. Wilson", "ReviewID": "R2JJBOIZODUPX2", "Overall": "2.0", "Content": "Nice compact size. Solid feel. But the noise reduction feature reduced pictures to a blurry mess. Even at it's lowest ISO 100. 10 megapixels were way too much for this camera. Just noisy.", "Date": "April 29, 2008"}, {"Title": "a bit dissapointed...", "Author": "Virginia Perez \"Virginia PTY\"", "ReviewID": "R1Z3NXDQY197D9", "Overall": "3.0", "Content": "My husband bought this camera in order to replace my 2 year-old Sony Cybershot that I have been using with a broken LCD screen for the past 8 months.  However, I was so dissapointed because it has no video shooting option, as my old cybershot had..... I have an hyperactive crazy little dog that I love to catch on photos and videos and I cant do it with  my new camera...Hopefully, Panasonic will add this feature in future models... Other than that, resolution is excellent and its very small and handy... great for carrying in a purse....", "Date": "December 21, 2008"}, {"Title": "The photo colors is not shinny", "Author": "Nour", "ReviewID": "RFWFLBRKBQFMN", "Overall": "2.0", "Content": "I don't know. But I have a problem with the colors and noise sometimes when taking shots with this camera. The colors are not that shinny. When taking the photos without flash - even in day light - the photos still seems dark when displayed on my computer screen. It looks fine in the camera screen but not on the computer.", "Date": "August 14, 2008"}], "ProductInfo": {"Price": "$229.95", "Features": "10-megapixel resolution captures enough detail for poster-sized prints\n4x wide-angle optical zoom; Mega Optical Image Stabilized\n2.5-inch Intelligent LCD screen; Face Detection\nIntelligent ISO; Intelligent Scene Selector\n50 MB built-in memory; captures images to SD memory cards (not included)", "Name": "Panasonic Lumix DMC-FS5P-K 10.1MP Digital Camera with 4x Wide Angle MEGA Optical Image Stabilized Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41QFUqBCruL._SX300_.jpg", "ProductID": "B0011Z9VRQ"}}