{"Reviews": [{"Title": "cam", "Author": "Samuel", "ReviewID": "R1P0G9INLBOZPH", "Overall": "3.0", "Content": "This is my first time buying or setting up security camera,  so far I'm not that impressed with this cam. I needed a cam that could read a license plate at 60 ft, this is not it.  The size of this thing seems pointless since there is not much inside, it could have been half the size.  Although, not a good spy cam, it does have a clear picture and night vision is good too.  Maybe I have missed something during setup, easy, since instructions were pretty much a small piece of paper with a drawing of the camera.  I've only had this a about a week and its not in use currently since I have to shove this thing in a birdhouse or something, and since the usb adapter that I ordered was secretly in China, so I cant record anyway.  I have seen a few other cam systems (small, bullet cams) and this has a much better picture, just dont expect good detail at a distance.", "Date": "October 23, 2012"}, {"Title": "great camera for a specific purpose", "Author": "Simple Programmer", "ReviewID": "RAEJSBTYRW11R", "Overall": "3.0", "Content": "The zoom range of 9 to 22 makes this camera limited to specific use. The 9 millimeter wide angle is not short enough to give a decent wide angle view.  22 is not a good tele shot. The clarity of the day and night shots are excellent.  It can read license plat out to about 30`.  Size could be smaller, this is three times the size of other cameras I purchases before.  Adjustment of the zoom and focus is easy to do.  To adjust, you open the panel door on top and move a lever for each function.Purchased this in December, and by Mid-February the night vision feature is no longer working.  this is past the 45 day warrenty,  so I will move to another location where the night vision feature is not as important.  the Infrared lights are working, but the picture at night is completely black.Diappointed that the night vision failed so soon.  I have other camera that are 10 years old, and the night vision feature are still working.I would downgrade my rating to a two, because of the night vision issue.", "Date": "December 25, 2012"}, {"Title": "Camera review", "Author": "A. Martus", "ReviewID": "RSUU5BA5HM6NR", "Overall": "5.0", "Content": "This camera has a great day and night picture. My problem is I wanted a wide angle camera and got a wide dynamic range camera which means you can manually focus from about 10' to 90'.", "Date": "December 8, 2011"}, {"Title": "Beware of this product !  Double Beware of the Ratings", "Author": "theJag", "ReviewID": "R2QKW1FRQVRWMP", "Overall": "1.0", "Content": "1 Year UPDATE:  I have two of these cameras purchased on the Bay.  After one year one is totally dead at night, the other is a blur at best.  The field of view is limited....After doing some research I found that these vendors utilize 3 or 4 different names and all the 5 star reviews on this page are more than likely written by these ladies or their proxies.  Beware of these cameras,  there are better available for half the price.  I purchased two of these cameras in April of 2012.  Initially I was thrilled with the purchase.  Now in December I am questioning my purchase.  One camera is working good.  The second cam has lost \"night vision\" as the illuminators have either lost power or gone out.  I have to assume \"lost power\".  I cannot find the answer because the units do not come with INSTRUCTIONS or SCHEMATICS.  I find it amazing that for over $100.00 there are NO INSTRUCTIONS or SCHEMATICS.  The flaw or the first flaw in these cameras is the POWER / VIDEO CABLES that ultimately hang down from the cams to either the building/pole entrance.  These cables will catch wind and whip back and forth.  Only a few times \"whips\" and the wiring will break.  I have to assume this is what happened to one of my cams.  Zip ties to the mounting bracket will help but I would suggest ridgid conduit all the way to the base of the camera.  This will inhibit directioning but hopefully you won't be left with a worthless camera like I have. I have read reviews from 4 of the sellers \"shell companies\".  They all rave about \"shipping\" and initial impressions.  Feedback is basically \"shipping and initial appearance\".  45 days warranty tells you all you need to know about this product.  It takes two weeks (14 days) normally to get everything to your location and hooked up.  That leaves you 30 days.  By the time you get minimal use out of the unit,  your warranty has expired.  I hope to resolve my issue with the seller.  If that happens I will report back the results.  As of this time I would highly suggest you avoid this product.", "Date": "December 14, 2012"}, {"Title": "One of the best CCTV cameras that I've purchased", "Author": "Norbert Simonis", "ReviewID": "R3ESWP5DPI3UTZ", "Overall": "5.0", "Content": "Great picture.  I've tried quite a few different cameras as I experiment with many, and this is one of my favorites.", "Date": "December 20, 2012"}, {"Title": "Security Camera VideoSecu", "Author": "Marc Yoe", "ReviewID": "R1SEW0G03TA2SL", "Overall": "4.0", "Content": "I have one of these cameras at my self-storage facility along with 7 other cameras on a dvr card in my computer. This camera i have zoomed in about 3/4 of it's capability just to read licsense plates on vehicles entering and leaving my facility from about 35 feet away and it works great. If you need good zooming this camera works well. My other cameras get the whole vehicle but they can't read the plates. I'm satisfied with this camera and the price.", "Date": "December 13, 2012"}, {"Title": "works great", "Author": "M. Paulsen \"Tech guy\"", "ReviewID": "R1XMKCY8P70XED", "Overall": "5.0", "Content": "Couldn't be happier with my purchase to date.  This camera provides incredible clarity out across front lawn and past the street street.  Coupled with other cameras in the 700tvl-ish range and a qt454 dvr I get full d1 on all channels at high resolution 24x7.  Highly recommend, coming into winter and it should work out fine (may update winter effect later if it doesn't perform.)", "Date": "October 30, 2012"}, {"Title": "Clear View", "Author": "Leo", "ReviewID": "RZ2JC67VKVNEC", "Overall": "5.0", "Content": "This camera provided me with a clear view from about 75-100 feet during the day.  I was very satisfied with its night vision as well.  The view angle is not as wide as a previous camera in the same location but it makes up for that with excellent clarity.  The 3DNR is evident of a break-through with camera clarity.  I tweaked the manual focus a bit and was able to bring it back to an optimum focal point. The mounting, and size of the camera is somewhat conspicuous but I was not disappointed, it went together very well. It is a great camera.", "Date": "October 11, 2012"}, {"Title": "Works great,  Very Clear day and night.", "Author": "Mary E. Callahan", "ReviewID": "R20JATSHH840WO", "Overall": "4.0", "Content": "My only complaint would be it's not as wide angle as I had hoped.  Overall it works for what I needed.", "Date": "September 1, 2013"}, {"Title": "Great picture for the price", "Author": "videodude", "ReviewID": "R25GT74AMKSH32", "Overall": "5.0", "Content": "This is the 5th one i bought, haven't have any problem yet.  they are installed outdoor in Michigan weather for a year now.  still humming!", "Date": "May 18, 2013"}, {"Title": "Great Camera", "Author": "naveen hooda", "ReviewID": "R2X18PRYE2QTRS", "Overall": "5.0", "Content": "It's a very great camera easy to zoom and install a very very clear picture. I used it at my store easy to watch every single thing.Thanks", "Date": "February 22, 2013"}, {"Title": "night time vision if you have little light around your area forget this product it will not work", "Author": "bren", "ReviewID": "RJP3OBXVMU69J", "Overall": "1.0", "Content": "had this inside move it out side and it work fine in the day time but at night it has no signal.It dose work inside the building in the night time with little light. buy a cheap infrared camera works fine don't call Sony they only added apart to this camera and say it's not there camera.", "Date": "April 15, 2013"}, {"Title": "Really Good Performance @Price", "Author": "Jorge De La Raza", "ReviewID": "R1F9T5I1384UIS", "Overall": "5.0", "Content": "My first security cam.  Camera is reliable and delivers very useful signal.  The documentation is incomplete so there's a bit of a learning curve, but there's also not too much to it.  The focus at long range is excruciatingly coarse so it's really hard to optimize the picture at distance.  That being said, it is hard to argue with the value of this camera.  The low-lux and night vision is very adequate.", "Date": "January 17, 2013"}, {"Title": "Good zoom camera.", "Author": "K. Lim \"Bklyner\"", "ReviewID": "R2OPZBGXUKVNXI", "Overall": "5.0", "Content": "I replaced my old camera with this one to get a better resolution (to be able to read car licence plates).I am very happy with the zoom and the adjustable focus which let me adjust to the perfect clarity.", "Date": "December 24, 2012"}], "ProductInfo": {"Price": "$140.49", "Features": "Built-in 1/3\" Sony Effio CCD security camera, high resolution of 700 TVL, enabling to obtain more natural high-definition video\nWeatherproof aluminum outdoor housing, stand for use in all weather conditions. Real weatherproof housing resistant to heavy rain and snow\nBuild-in 9-22mm varifocal lens and 30 large infrared leds\nHeavy duty bracket, pan 360 degree, tilts 90 degree\nNTSC system. 12V DC power supply included", "Name": "VideoSecu Built-in SONY Effio CCD 700TVL Zoom Infrared Security Camera Day Night Vision Outdoor Wide Dynamic Range WDR Surveillance Camera DSP 9-22mm Lens for CCTV DVR Home Surveillance System with Power Supply, Security Camera Bracket and bonus Warning Sticker WE4", "ImgURL": "http://ecx.images-amazon.com/images/I/31JAFP6ptsL.jpg", "ProductID": "B001IFELSI"}}