{"Reviews": [{"Title": "First digital camera I've really loved.", "Author": "Kevin M. Powell", "ReviewID": "R2YREFMK98995R", "Overall": "5.0", "Content": "I've had quite a number `point and shoot' digital cameras over the past decade-it seems I replace them about every three years. As a believer in the maxim, the best camera is the one you have with you, they have all been Canon Elphs  But this time...I wanted more.  One of the new compact designs with a big optical zoom, plus the wide angle lens. So it was natural that I picked out a Canon PowerShot SX200IS for an for a birthday trip to Italy.  Glad I checked it out prior to departure - its form factor didn't really work for me ...A friend suggested the Lumix ZS1, which just happened to be on sale for $229 at Costco - a hundred dollars less than the Canon.And I am so glad I made the exchange! The Lumix ZS1 delivers beyond all expectation.  There was a point on the trip where I had a vision - imagine (if you go back to the 70's as I do) having an entire photographers bag - say a Nikon F, with a kit of Nikor lens say a 24mm perspective control, 50mm macro, a couple of zooms, multiple camera backs, the flash, the motor drive- in a package that fits in your shirt pocket.  The last camera that blew me away like this was the Olympus XA (old school 35mm) which delivered amazing optics in a shirt pocket size.Cutting to the chase:Pros:Unbelievable Leica lens. You can't imagine what a difference there is between 25 mm and 28 mm at the wide end.  Imagine taking pictures of building facades and interiors as your eye sees them - and without distortion - extraordinary, and worth the decision to go with this camera alone.  Even better - this lens works at all levels.  This is by far the best the macro I've seen on a point and shoot, and the lens is solid all the way to 300mm equivalent - and yes, the image stabilization does really help - in old school terms, think light weight tripod with a very heavy long lensUnbelievable Panasonic electronics. This has a very simple, yet incredibly rich feature set, all of which is useful, all of which delivers great, real world pictures, with as much real world manual control as you could want. For example - you can set the max ISO -which really gives you control over the F stop (since like most compact cameras there really isn't that much of a range) and shutter speed, there is a very convenient toggle button on the camera body to increase/decrease exposure (+/- 2 f stops), and the IA (Intelligent Auto) is the best auto setting I have ever worked with.  You do have to read the manual, however, and play with the multiple settings to fully realize what Panasonic has delivered.Great sensor.  Images are very sharp below 400 ISO as others have noted.  But ultra low light performance, is what is truly amazing.  Think: extraordinary rendition of Giotto's frescos at the Basilica of St. Francis, tapestries at the Vatican, even the Sistene Chapel ceiling - settings where flash will not help or is not permitted - These demanded ISOs of up to 3200 - and the results look truly amazing - when printed, when projected.Great build quality and ergonomic design.  Part of what caused me to return the Canon - it simply didn't fit in my hand well, and the control layout was awkward.  This one fits perfectly in the hand, and every control both on the body and in the menus is well placed, well conceived.  And it not only feels solid, it looks solid, and that is comforting.Cons (yes there are a few, but they are few)The view finder is bright enough in many situations (be sure to turn on the `auto mode').  But there is no substitute for an optical viewfinder in a bright outdoor setting.Proprietary download cable.  Why not use universal mini-USB to USB like Canon does?Average battery life.  All that zooming of the lens barrel and digital wizardry means that this needs to be charged dailyNo HD video.  I find the widescreen VGA mode delivers very acceptable performance - and because it works with the optical zoom, actually looks sharper than the Canon HD at any zoom setting (Canon is digital zoom). But I think the ZS3's HD video will be even more awesome, and probably will end up being available for the same price point.", "Date": "July 8, 2009"}, {"Title": "Amazing stuff in a small package", "Author": "Alexander Don-Doncow \"Critical Al\"", "ReviewID": "R14FFUQWVZ9WNC", "Overall": "4.0", "Content": "Panasonic finally delivers on the noise end of things.This is the first Lumix prosumer camera that I have seen where image noise is not a serious issue.In fact, just prior to purchasing this camera I had to return a Lumix DMC-FX35K, which I found totally unacceptable in terms of image quality (see my other review).This camera boasts a clean picture with properly controlled noise (very little smudging), it can produce a usable and very printable image up to 800 ISO. Images at 400 ISO are surprisingly good (for this kind of camera).Awesome optics,from a very wide angle to a medium long telephoto, little distortion, no observed vignetting, very acceptable chromatic aberration, a veritable photographic powerhouse in your shirt pocket!Exposure, good if only a bit on the overexposed end (to my taste).All kinds of automation, too much to cover here.Two types of optical stabilization, which on the whole a care little about, in my opinion the technology is far overrated (applies to all brands). You want tack sharp pictures in very low light, lean the camera against a wall a tree or a railing or mount it on a tripod, bean bag or just set it on a table.Very good macro capabilities.Shortcomings, mainly two: 1 - very limited manual controls (that kept me from giving it 5 stars)This limitation precludes its usability as a serious photographic tool (pity!). Albeit, it can still take some tremendous pictures but at the mercy of its automation. 2-  Absolutely terrible Auto White Balance under artificial light, especially the new compact fluorescents. Compensates a bit with an easy to use manual control but that is effective in skilled hands only. Panasonic better come up with a firmware update addressing this issue soon ,else they might start seeing a lot of returns.In summary, a very flexible, well built and powerful camera squarely aimed at the traveler or occasional photo enthusiast.The camera does have the potential to take breath taking images, but it is definitely not a photographers tool; although, given its price, size and sturdiness might work well as a \"just in case\" gadget for those \"ouch\" moments when your main camera is not available.A curious observation:this camera is endowed with a fabulous lens and an almost interminable list of scene modes and other automatic feature, yet it omits simple aperture priority and shutter priority modes which would have probably placed it in a class by itself. As I said before, what a pity!", "Date": "July 6, 2009"}, {"Title": "Great travel camera", "Author": "Pamela Van Cleave \"pamsrollz\"", "ReviewID": "RNB9D62PLYY4", "Overall": "4.0", "Content": "I've just returned from my first vacation with this camera. I previously had a Kodak subcompact.  Weight and size are good, still easy enough to carry in a purse or pocket. The wide angle takes a huge sweep of area in the photos.  Pictures are crystal clear with a touch of roundness at the edges of the landscapes.  The zoom is incredible, but it takes a special touch getting used to the sensitivity of the zoom dial. The zoom was my main reason for selecting this little camera, along with the fine Leica lens.  I used the manual and IA settings, great shots both ways.  Very good photos in low light and with the flash off.  Huge screen for viewing your subject, but I do miss my old viewfinder. Easy to playback shots and review, as well as a quick upload.  Included software is very good for editing, etc.  I still have a lot of experimenting to do, the camera has tons of interesting feaures. Have not seen a downside as of yet, easy to use, battery life is quite good, I shot for most of the day before it wore down, and it fully recharges in a couple of hours. Highly recommend this camera for the travel buff that loves to take pictures.", "Date": "June 25, 2009"}, {"Title": "A $3,500 lens...Costing Around $250", "Author": "Alan  Houston", "ReviewID": "R3M9YAGPFGZM6C", "Overall": "5.0", "Content": "Leica is famous for the quality of their lens designs.  A 24mm super-wide angle lens provides a MUCH greater field of view than the more common 35mm wide angle lens.  That makes it possible to take interior photos that show a large portion of a room, or to take architectural photos of entire buildings, even in tightly packed urban areas.BUT, Leica's famous 24mm super-wide angle lens costs about $3,500.  Now Leica has designed a 25mm to 300mm zoom lens for the Panasonic ZS1 and ZS3 which has even LESS visible distortion (bowing of straight lines, such as doors and window frames) and vignetting (darkening of the photo's corners) than does Leica's famous 24mm lens.  So, the owner of an LS series Panasonic gets the photo quality of a $3,500 lens for less than $250.The Panasonic DMC-ZS1 and ZS3 share a superb Leica-designed zoom that provides outstanding performance from the super-wide 25mm range, through to the 50mm  \"normal\" range waaay up to very long telephoto zoom of 300mm...and the lens provides excellent color and contrast in every part of that very long range.There are NO zoom lenses or digital cameras available at ANY price level that will outperform the Panasonic ZS series for ultra-low distortion, rich colors and excellent contrast throughout the entire ultra-wide 25mm to 300mm long telephoto range of the ZS cameras.The Panasonic ZS series cameras are designed to be easy to use.  Putting them in the \"intelligent auto\" mode enables the camera to make all of the decisions.  You simply zoom in on your subject, press the shutter very slightly to pre-focus, wait a second to see the focus confirmation \"dot\", then press the shutter to take your photo.The camera will automatically switch to the \"macro\" mode if you are taking a photo of something a few inches from your lens, it will recognize a person's face and switch to the \"portrait\" mode for natural skin tones, and it re-adjusts the ISO level and shutter speed to match the lighting conditions for each photo.Outdoors, the \"intelligent auto\" mode delivers consistently fine photos with natural color tones and contrast.  The photos are \"sharp\" due to Panasonic's auto stabilization mode, which makes it possible to get hand-held photos that are tack sharp, even at the full telephoto range of 300mm.WARNING: Flash photos tend to be mediocre, unless you are VERY careful. Indoors, when using flash, the \"intelligent auto\" mode works well ONLY with subjects that are very close...about three feet to six feet from the camera.  Beyond six feet, many flash photos will be darker than most people would prefer.  The solution is to switch to the manual mode, and select a higher ISO of 200 or 400.  These cameras have a tiny flash, and good results require getting close, and the results are best in a well lighted room.  This camera is a \"five star\" camera outdoors in bright sun light, but is closer to being a \"three star\" camera indoors with flash.In the manual mode, users can select from many \"scene\" options, including a \"night mode\" that takes beautiful time exposures in dim lighting.  I took some \"night mode\" shots in a dark coffee shop without flash that perfectly recreate the mood of the dimly lighted room.  Also, in the manual mode, users can set the maximum ISO they want to use, and set the minimum shutter speed they prefer.  So, for a sports photo, you can chose to use ONLY shutter speeds of 1/250 of a second or faster to \"freeze\" the action.  Or, you can switch to the \"sports\" mode, and the camera will select a fast shutter speed, and lock the focus to keep subjects beyond about 16 feet away in sharp focus.The manual options give users dozens of ways to tailor their photos, including ways of fine-tuning the color balance.  The instruction book uses 140 pages to detail all of the options for every type of photo.  It is worth an owner's time to work page by page through the entire 140 pages to learn everything this camera can do.But, MOST people will be happy to simply put the camera in \"intelligent auto\" mode and let the camera make all of the decisions.  With just a hour or two of practice, anyone should be able to obtain fine photos consistently.Digital \"noise\" is always an issue with pocket sized compact digital cameras.  However, with the ZS1, the digital \"noise\" is well controlled.  In an 8 x 10 inch enlargement, it would take a very keen eye to see any \"noise\" in the ISO 80 to ISO 200 range.  At ISO 400, a small amount of noise be visible in an 8 x 10 enlargement, but only if you are looking for it.For people who are \"fanatics\" about reducing digital \"noise\" to a minimum, the ZS1 enables you to select an \"auto\" mode that has a \"locks\" the ISO setting to the ISO 80 to ISO 400 range, or you can \"lock\" the ISO at your choice of ISO 80, ISO 100, or ISO 200. On a bright sunny day, locking exposure to ISO 80 produces photos that can match those made with a $3,000 pro DSLR camera.The battery will last about 300 photos without using the flash, and about 200 photos if you use the flash for about half your photos.  The more time you spend  reviewing, editing, and deleting photos, the fewer photos that can be taken. A \"battery gauge\" tells you the amount of power remaining in the battery so you know when to recharge.  The battery recharges in about two hours or less.WARNING:  The size and shape of the ZS1 make it a VERY easy camera to drop.  It would be wise to ALWAYS wrap its strap around your wrist BEFORE removing the camera out of its case. The ZS1 will fit into a jacket pocket, but it would be much better protected in a padded case.  A camera as nice as the ZS1 deserves being treated as the fine piece of equipment that it is, and keeping it in a padded case is an inexpensive way to protect your investment.", "Date": "August 1, 2009"}, {"Title": "Lars", "Author": "L. Lund", "ReviewID": "R3J3VXHWUDFCZU", "Overall": "4.0", "Content": "Had a previous Lumix and loved it for it's ease of use...bought this one because the old one was dropped and stopped working..my fault...anyway love the setting on this one called: Intelligent mode...takes great pictures in all kinds of conditions...movies are great also...colors are true all around...The one small negative is that when you reach from right to left to use the zoom you can hit the mode dial and then it's not in the right position. The mode dial really should be to the left of the zoom NOT to the right.Love the playback feature where you just flip the switch to quickly see the most recent picture..Last model there were 2 or 3 steps to accomplish this...Battery on this one seems to last a lot longer than on the previous one...All in all love this model...other than that small inconvenience with the zoom and mode dial.", "Date": "July 6, 2009"}, {"Title": "Just Point & Shoot; Great Pics Guaranteed!", "Author": "Pixelman \"Go click!\"", "ReviewID": "R1ZR0KZW4HSXH0", "Overall": "5.0", "Content": "After having used a wide range of Point & Shoot Digicams from different companies, the one camera that has always given me consistent performance in terms of great pictures and good battery life is a Panasonic Lumix FX01, which I have been using since 2006. So, when the time came for upgrading my camera, Panasonic was on the top of my list of manufacturers.My specifications were :I wanted atleast 10x optical zoom.A P&S; type form factor, which would be easy to carry around.After having used a wide range of Point & Shoot Digicams from different companies, the one camera that has always given me consistent performance in terms of great pictures and good battery life is a Panasonic Lumix FX01, which I have been using since 2006. So, when the time came for upgrading my camera, Panasonic was on the top of my list of manufacturers.My specifications were :I wanted atleast 10x optical zoom.A P&S; type form factor, which would be easy to carry around.7 - 10 megapixel resolution.A CIPA rating of atleast 300 photos per fully charged battery.I Googled around and checked out various websites, shortlisting 5 models, ranging from a Sony, a Samsung, a Canon & 2 models from Panasonic - the ZS1 & the ZS3.After a final elimination round, I was left with only the ZS1 & the ZS3. Considering the fact that both featured 12x optical zoom, 10 megapixel resolution, 300+ pics per charge, they exceeded my specs. Some additional sweeteners were that the ZS1 & ZS3 come with 25mm wide angle lens! Sites like [...] too had some very good reviews of both the cameras, so I just had to choose between the two.When I placed the order in early May 09, there was a $100+ difference between the two models. The main differences were that the ZS3 can record High-definition video clips with stereo sound + there are a few other features that are missing from the ZS1.Though I was very tempted to buy the ZS3, I decided to go with the ZS1 and invest the money saved in buying an extra battery + a high capacity SDHC memory card. The rest of the process was very smooth & easy.- Checked the prices of the ZS1 on a couple of websites and Amazon had the best deals, with free shipping too. So placed an order.- Placed an order for an extra battery pack + SDHC card.Everything was delivered without a hitch and after a quick glance through the user manual, I was ready to start clicking... and I have been clicking away since the past 3 months.The main pros & cons of the ZS1 are:- Very good optical zoom (12x) & great wide-angle lens (25mm)- iA (Intelligent Auto) mode is really effective in getting great results.- Battery life is quite good.- Image stabilization is more effective than most models I have used.- Very handy and easy to use!Now the cons:- Autofocus works good, but a manual over-ride would have been really great.- Performance of the camera in low-light conditions is just average.- At higher ISO levels (Above 400), there is a significant amount of noise in the photos in low light conditions.- The mode selector dial is a little vague and easily moves out of position.But then, everything cannot be perfect, can it? and these cons are something that I can easily live with.The bottom line is that at this price point, the ZS1 is a great camera for the casual users, active travellers and anyone who needs a easy to use wide angle camera, with good zoom. I would recommend it without any reservations!Products I ordered:Panasonic Lumix DMC-ZS1 10MP Digital Camera with 12x Wide Angle MEGA Optical Image Stabilized Zoom and 2.7 inch LCD (Silver)Panasonic DMW BCG10 Battery pack (The camera will not work with any other non-panasonic batteries)A Transcend Class-6 SDHC 8GB memory card.", "Date": "August 29, 2009"}, {"Title": "Can't find a difference between 5 and 10 MP settings", "Author": "Scott Roberts", "ReviewID": "R17MA8JSP5V8RX", "Overall": "4.0", "Content": "First the pros:Great zoom and great in low light.  It will be difficult to find situations where you need the flash.  Only the competing Sony can beat it on sharpness during zoom, but that may be because the wide angle lens penalizes the ZS1 on sharpness. Video is VGA/WVGA which I prefer because I only need it for internet video.  I can't imagine the amount of PC time required to transfer, edit, and upload HD. Macro is as good as they get.The \"fair\" attributes, adequate compared to other cameras:LCD size at 2.7 is adequate, but not large as the other reviewer stated.  The smaller screen is not nice, but it helps save battery life.  Without the flash on the automatic setting, color and everything else seems great. My own settings can hardly ever do better.  Lighting is strong unlike the reviewer's comment, but the wide angle makes it difficult to get even lighting in such a wide field.  Backing up and zooming to look more like a regular camera (to decrease the field of view) enables the flash to be more consistent, maybe more consistent than others since you are further away.  If you don't back up and zoom, expect more shadows from the flash because it's too far to the side of the lens, especially on the sides of the wide field.  If the flash were above the lens, the shadows would be beneath the subject and therefore much less noticeable and more natural. But again, low light ability is so good, I do not expect to ever use flash.  I value even and natural light more than the extra sharpness that the flash provides. Operation seems as sensible, good, and fast, about like the others I've tried.  It's \"complicated\" without the automatic setting like all the others, and just as easy and accurate as the other on the automatic settings.  Anti-jitter allows going from 1/60th or 1/30th to 1/8th shutter speed, which is a great improvement for all cameras that have it, despite the comment from the other reviewer about this feature being over rated.Cons:Those who are used to regular digital cameras may not the wide angle which causes a \"fish-eye\" effect.  For example, if you're doing family or people shots, you will need to be a little closer or use the zoom.  On the other hand, the wide angle is preferable in some instances.  For the higher-end user, the wider angle will allow shots other cameras can't get (there's no \"reverse zoom\" on regular cameras).  Microphone is on top instead of in front which causes more echo from ceiling in rooms, the person recording to sound too loud, and many people will be placing their left index finger over the mic.Video:Wide angle is much nicer for video than pictures. Zoom is painfully slow during video, which is intentional because most people zoom too much in videos.  But it does not begin zooming right away and is too slow.  This is my only complaint about video.  As with many cameras, videos are stored as Quicktime .mov files. Editing beginning and end of video on camera is not possible which would have been nice.  Memory usage is 1.2 MB/second so 16 GB class 6 SD card will store 3.8 hours.  For internet usage, I've found converting to .avi with Indio 85% compression was resulted in files 5 times smaller. You must convert from .mov to .avi using one of several free tools online in order for a Windows machine to edit it.10 MP not better than 5 MP:My biggest complaint is that there is no difference between 5 MP and 10 MP settings.  Regular pictures, zoomed in shots, and macro all appeared to be identical quality under 5 MP and 10 MP settings even when letting the timer prevent blur. Selecting 5 MP standard compression compared to 10 MP fine compression resulted in files 4 times smaller with no change in quality under any conditions when blowing the shots up to look at the details.  The smaller files are much less likely to hang your computer up when editing and viewing thumbnails.Maybe the 10 MP is used to get better digital zoom.  This situation may exist with all 5 MP+ cameras.  All this is not relevant to the typical user who is only using pictures for the computer, in which case 2 MP is plenty.Most MP settings are disabled in auto mode:Sadly standard compression is disabled in automatic mode so 80% of users will be stuck with files twice as big as necessary.  My favorite 2 MP is not allowed. I have to use 3 MP. Combined with disabling the standard storage, all my files therefore have to be 3 times bigger than any computer work needs if you use automatic settings.  A typical computer screen is less than 1 MP, so it seems insane that so many cameras (like this one) do not allow 1 MP pictures.  Since this camera is not improved with anything above 5 MP, you basically have only 3  settings in automatic mode: 3 MP (4:3), 5 MP (4:3), and 2 MP (16:9), with forced fine storage (low compression).  The last 16:9 may actually be good for wide computer screens and HD TVs playback.Macro:Macro can show things you could only see with a microscope at 30x. It can show the hairs on the legs of a flea, 1 inch from the lens in sunlight. It can show the detailed imperfections in each R, G, and B emitter in each pixel of my computer screen.Other interesting features:They went overkill on settings for different subjects and lighting conditions. lots of options if you want them. For example, baby picture and flower modes. Focusing and lighting options are advanced, like tracking a subject once you lock on with half a click, or setting lighting to background, foreground, or spot. Individual face recognition is there, but not synced with eyes open. To have almost zero delay between pressing the button and the picture being taken, you have to press half-way first.In short, I think I will get used to the wide lens and even be glad I have it. Certainly I love taking pictures without the flash. The zoom is great. It's nearly a disaster that they don't allow standard storage in automatic settings.", "Date": "August 28, 2009"}, {"Title": "Not what I expected", "Author": "Julie CSD", "ReviewID": "RURHL80YO8EFE", "Overall": "2.0", "Content": "I bought this Lumix ZS1 along with a Sony Cyber-Shot DSC-H20.  The Lumix in general have excellent reviews and people rave about their wide angle, sharp, good quality images, etc, but I found the opposite to be true.  It did have a wide angle, good for including more elements in your photos, but I found the images to be muted and hazy, and most of the time not sharp like the Sony.  This model has 12x zoom, while the Sony has 10x, but I found the Sony to have better reach, and its images were sharper when I zoomed in with the digital zoom.  I did several test shots with both, and in my opinion, the Sony won, no question about it.  The Lumix also has a very weak flash, which seemed to increase blurriness in lower light.  The Sony has a very powerful flash, but thankfully you can adjust its intensity.I thought I preferred a wide angle lens, but honestly, I much prefer the telephoto end and having crisp, sharp images.  That is just my opinion and experience!", "Date": "August 6, 2009"}, {"Title": "Great Resolution!", "Author": "Rodney H. Diramos \"Techie Monster\"", "ReviewID": "R1H5WNRYIEK8MB", "Overall": "5.0", "Content": "We've always used an SLR but found out that we were taking it along less frequently because of the weight. We needed a good quality smaller camera and tried this out.What a pleasant surprise. It could take excellent fireworks at a distance or highly detailed macro shots. We'd like to stop using our SLR for our professional food photography shots because we think the quality of this small camera would work for our purposes - were it not for the fact that our clients think that since we're using a big camera (SLR), we are more professional that way.Great product - must be the Leica lens!", "Date": "July 14, 2009"}, {"Title": "Lovely little travel camera", "Author": "S. Veronica \"superstar\"", "ReviewID": "R1D2A3JVKGTAS", "Overall": "4.0", "Content": "I recently bought this camera to take on vacation with me and I have to say that I love it. I own several other cameras all different types (SLR, DSLR, compact digital, video, etc.) For vacations I usually take what everyone calls my Japanese tourist camera (Nikon D40) because it takes beautiful pictures and while large, it's still relatively compact. Well, this Panasonic has now replaced the Nikon as my tourist camera. Not only are the picture sharp and clear thanks to the Leica lens, but the zoom is just incredible. Shots are fairly noise free even when using digital zoom. Plus you just can't beat it for all this at this price and in this size.While it's not really a pocket sized camera it is certainly purse size and easy to carry around. It's not heavy and would fit nicely in a jacket pocket. Low light performance was good, better than the Panasonic tz5 (which I have also used) in my opinion and the flash range is also very nice.This one is definitely a keeper.", "Date": "July 6, 2009"}, {"Title": "What you wanted in a little \"almost pocket\" camera", "Author": "Noel Hastings \"Emergency Medicine MD\"", "ReviewID": "R3UTCVKZL5MC92", "Overall": "5.0", "Content": "I can't remember how many Panasonic Lumix models I have had now... 3? 5?. I started with one of the first super zooms... added the mini pocket models as well. The last pocket model I owned, the FX-37, was excellent and the larger FZ-28 hard to beat, but I wanted both in one small camera. What do you know... they made the ZS1 with a 25-300mm zoom. In past reviews what I said still holds true in many ways on other models. The lenses on these cameras are amazing, Leica optics can't be beat. What has changed is that Panasonic has put all their efforts into improving their electronics. In the past poor menu design, button placement and chip noise plagued these cameras but I used them for the lens quality. Today, this latest camera has replaced my two camera system and I am very happy.This camera is small, small enough for your pocket but it is big enough that you will notice it there. It is also big enough that it is comfortable in your hand though, which is nice, but not so big as to attract a lot of attention in a crowded market. Probably the perfect travel camera (see the DP Review Travel Camera Shootout review, search Google!). The battery life is excellent, the optics are sharp and color is somewhat warm. The menu system is easy to figure out. The image results are wonderful and although if you dig enough you can find imperfections, please don't compare this to a $2000 professional SLR. It is not, but it is as close as your are going to get for the money and it is way easier to carry around. The flash on this little camera does better than I expected too, which is a bonus. I recently took it on a 3 day backapck trip and took over 300 photos and only needed to switch to my backup battery near the end. That was with a lot of \"on and off\" use which requires lens motor a lot and eats battery life. Not much flash use. Also, the image stabilization works very well and is now a feature I won't buy a camera without.There is only ONE gripe I have with this model and many have had it. The mode dial is the worst design I have seen and surprised since they have other models that solved this design issue. Why did they do this? It only has mode positions that can be selected on about half the dial, the other half is blank, but sadly the dial can be put into these \"blank\" positions. Because of the dial placement without any protection and the anemic click stops, it is easily bumped into the wrong position. It won't mess up your pictures, but you may sometimes find you are pressing the shutter button while in the wrong mode or worse yet, you try to shoot in a situation that requires a quick shutter finger and instead you find an error on the screen that says \"mode dial in wrong position\". Once they fix this issue the camera will have been improved to a full 5/5 stars. Now it is a 4.5/5 in my book.If you want something small, with great optics, great images, a good flash for a small camera and a great battery life (by the way, don't upgrade firmware because all the new firmware does is STOP you from being able to use aftermarket 3rd party batteries which work fine and are way cheaper) this is your camera.... welcome to the Lumix family!", "Date": "September 4, 2009"}, {"Title": "Really fine camera -- a spoiler", "Author": "Ronald K. Goodenow", "ReviewID": "RYZR6C4TXNXTA", "Overall": "5.0", "Content": "I'm a pretty die-hard Olympus user and have worked my way though many of its digital offerings over the past several years, now using the E330 and E510 dslrs with a large number of Olympus and Sigma lenses for some semi-pro and personal use. I travel a lot and so wanted to have a good backup, my wonderful Oly 5060 being too large for most of my pockets and my year old Canon A550 (a fine performer with the AA's I like) being too limited in terms of zoom, particularly at the wide end. I didn't look closely at Oly compacts due to some pretty spotty reviews and my feeling that the company has pretty well stopped innovating in that market.Having read a bunch of reviews I trust I purchased the ZS1 a couple of weeks ago and have given it a real workout, attending a Red Sox game at Fenway Park and then almost a week on the rocky coast of Maine. To stay light when walking around I slapped a long zoom telephoto on my Oly 510 and put my ZS1 in a shirt pocket to cover everything between 25mm and about 150mm, where my Oly 140-600 (35 equiv) picked up. A great combo. No need to change lenses in windy conditions, though if I needed them they were in a nearby car. OK, some main points:- the Lumix takes gorgeous photos with virtually no noise up through ISO 400 at ALL zoom lengths; image stabilization is quite effective; not quite that of my Oly 510 but perfectly adequate- the IA mode, what with its oft use of multiple exposure areas and selection of a scene mode is dead on, and I found its accuracy equal or superior to my Oly in many circumstances (even when I occasionally used one of my other Oly lenses rather than normally quirky long lenses; Oly dslrs have many great qualities but focusing, in my opinion, is not one of them). Of the hundreds of photos taken none had focusing or serious exposure issues. NONE, and exposure ones I had were taken care of in easy post processing- at first I got limited battery time, topping out around 100 pics (with a fair amount of lcd reviewing), but as the battery went through charge cycles time has increased to the point where yesterday in the course of any hour of messing around I got over 650 shots and the battery was still going strong!)- it is very quick to start up and get off that first shot. About the same as my Olys, which go through a sensor cleaning cycle.- though there are no manual controls to speak of I tend to mainly rely on exposure compensation and the camera's regular normal mode makes that very easy; and there are ISO settings as wellIf I have a complaint it is that Panasonic's latest firmware (1.2) does not permit the use of third-party batteries, something that Panny really doesn't tell us, nor did the seller I purchased a clone from. Aggravating. One can download firmware version 1.1, which permits clones, but I didn't want to mess with that. Instead I ran down a rare OEM battery on Amazon, at a premium price, of course.This all means that I have a camera that is a perfect take along. In very informal or business travel it easily provides virtually all the features and quality one would need. In situations where one wants the flexibility of a good dslr, it is the perfect backup or accompaniment. In fact, now and then I think about all the investment in my dslr's, most lenses for which cost twice what the Lumix cost, and scratch my head. If somehow this little camera could take an add-on flash it would be a marvelous product.Finally, it would be great if some of the large companies could settle on a battery standard and stop reaming consumers for that extra bit of hard-earned cash, the main reason I have always preferred AA's in small cameras. Oly has used the BLM-1 for years now in most of its dslrs, beginning with the 5060 point and shoot. They are easily interchanged and clones, which I find very good, readily purchased (Oly also makes a little lithium battery holder which means, practically, that if one needs emergency power one can head to many drug and hardware stores or Walmart -- that stays in my shaving kit). It's especially irritating that Panny is apparently not manufacturing many batteries for my new camera. A stupid situation.-----------Update:Just took the ZS1 and my Olympus E-510 (with three small kit lenses) on a trip and did a lot of comparison shooting. Scenery, family gathering, some event stuff. Some observations:-- focusing on the Panny is more accurate and, in most cases, as fast as on the dslr; it is certainly superior in relatively low light situations and gave me superb results up to ISO 800 and at low shutter speeds-- sharpness on the Panny is a tad less than on the Oly, but can be easily adjusted in post processing-- with a little fiddling I was able to get excellent flash results from the Panny; the 'manual' setting is far superior to the IA one.So I call the camera a 'spoiler'. Is it superior to a good dslr? Of course not. Fewer options and accessories. But for many kinds of travel, candid photography and situations which don't stress the flash it is a heck of a camera; among the best I have owned. For those of us who choose netbooks over heavy laptops and just want to be light and flexible it would be hard to do better.", "Date": "August 29, 2009"}, {"Title": "First impressions - super camera!", "Author": "Chris A. Kantack", "ReviewID": "RE48IH50QF5J3", "Overall": "5.0", "Content": "I'm a big Canon fan.  Indeed I almost bought the SX120IS super zoom instead of this one.  But I wanted the ability to have a super wide angle setting (25 mm) that the Canon camera just can't deliver.  (The SX120IS only goes out to 36mm on the wide end.)  Also, I saw in a number of reviews where the SX120IS exhibited higher than average barrel distortion on its wide angle zoom range whereas the Leica made lens on the Lumix ZS1 shines in exhibiting virtually none of the lens distortions that plague many zoom lenses.Though I've only had the Lumix ZS1 for a few days, I can tell you this:  1.  The Leica zoom lens on this camera really is as good as others have been raving about.  2.  This camera takes great shots both indoors and out.  3.  The build quality of this camera is excellent.  It's nearly all metal in construction and very solid.  4.  I'm not experiencing any of the useability problems that I've read in other reviews.  The controls are  very well laid out.  I don't have a problem with the dial placements or the menus or anything of that  nature.Another criticism I've read about the ZS1 is that it doesn't have aperture or shutter priority picture taking modes.  In my opinion, there are more than enough settings to obtain the desired shutter speed or aperture control that you would need.  Indeed there is a minimum shutter speed setting readily available!So far, in my early use of this camera, the only \"fault\" I can find (if you can call it that) is that the automatic white balance setting isn't always perfect in indoor light.  This is true with any digital camera of course and there are ways to manually correct this.Though I've been taking pictures for nearly 35 years, I haven't owned a lot of cameras.  I tend to find a camera I like and then use it \"forever\".  If these first impressions hold out, I'm going to be using my Lumix ZS1 for a good long time.", "Date": "November 7, 2009"}, {"Title": "update after about a year of ownership", "Author": "H. Chandler", "ReviewID": "R3R88PEJH7JF8K", "Overall": "5.0", "Content": "After about a year of moderate use this camera is doing very well. Recently the camera fell from the seat of my truck to the snow and salt covered road as I got out of my truck.  I didn't realise I had dropped the camera until later, and three hours after it hit the road I came back and recovered it.  The camera did not function at first, but the next morning it was as good as new, presumably because it had warmed up.  Because I had replaced a year old Canon that had failed I was hoping this camera would prove more durable.  It certainly has. I wanted a camera I could carry in my shirt pocket that would give me very good image quality and serve for family snapshots as well as scenery shots.  The lens range on this camera is ideal for me and makes the camera a very versatile point and shoot device.  Image quality seems superior to the Canon I had. I am an older person with an older person's eyesight, and the LCD screen is the best of the few I have used in daylight situations.  This camera has fewer features than many, which is not at all a problem for me.  I wanted a point and shoot camera and the feature set is more than enough, in my opinion, for this sort of use.  The controls seem comfortable and easy to use to me.  I get excellent results from macro shots to full extension of the long range lens and the camera does the thinking for me.  That's not what many enthusiasts want, but as a take along camera that doesn't get in the way and yet is almost instantly ready to capture very good images of anything from a wildflower by the road to a wide angle indoor scene to pulling in a heron on the other side of a stream I find it serves very well.  Battery life seems very good, however the camera software will not allow use of aftermarket batteries, or at least those not approved by Panasonic, and I didn't find any that were.  This may not be a bad thing given the stories of counterfeit and dangerous batteries from you-know-where, but plan on paying around $40 for a second battery (since I wrote this the price seems to have gone down at some retailers).  After a year of use I am so well satisfied with this camera that I have ordered a ZS-3, the slightly more full featured version (because of a sale price, not because of the feature set).", "Date": "November 2, 2009"}, {"Title": "Versatile Tool For The Photographer", "Author": "Phillip Scott", "ReviewID": "ROSJ13EPN60IM", "Overall": "5.0", "Content": "This camera has a great lens and exceptional processing software.  I'm very happy with it.  I considered the LX3, and would enjoy the greater degree of manual control (there really is no manual control on this camera)but the length of the lens, variety of scene modes and compactness of the unit make it a great compromise.  When I need the manual control I'll carry my D200 and the thirty pounds of gear that go with it.  The rest of the time I'll be very happy to slide this camera in my pocket and go.  The product it produces is very satisfactory, although certainly not DSLR grade.  That's not the point anyway.  This is my \"have it with me\" camera.  Fine addition to the toolbox.", "Date": "July 25, 2009"}, {"Title": "I absolutely LOVE this camera!", "Author": "lassdm \"lassdm\"", "ReviewID": "R1M6GUCJ3NMLV9", "Overall": "5.0", "Content": "For many years I used a great Canon 35 MM with a regular lens, wide angle lens and a telephoto lens. I really liked it and it took great pics, but I got tired of lugging around the bulky camera bag and having to switch the lens all the time for different shots.So, for a upcoming Disney World trip I decided to start looking around for a digital camera.The most important thing I wanted was a good zoom lens to match what I had had with my 35 MM. After many hours of researching and reading reviews I decided on a Panasonic Lumix for sure, but then needed to decide which one. Not wanting to spend a ton of money,I finally decided on the DMC-ZS1 12x zoom, 10 MP.It has everything I needed and more.Things I love about this camera:-it already is set up with a wide angle lens, everything fits in the pic!-the zoom is fantastic! It brought up things from really far away-much closer than I had expected.-no more buying B&W; film for cool pictures-you can change to standard (color), sepia or black and white. I took a great pic of my son in a coon skin cap holding a pop gun in Disny World in B&W; and it looks great! I also took some of the 'Tower of Terror' ride in Hollywood Studios in sepia and they also turned out great!-you can change the 'Scene' to anything from food, fireworks, night portrait, sports, and MANY more, at leat 20 different ones. Several of the restaurants we ate a had small thin squares of chocolate with the hotels name on it stuck in a slice of cake or pie and by switching the scene mode to 'food' it took great up close pics and the hotel name on the tiny piece of choc. is super clear!  I also have pics of the kids playing on the beach in complete darkness, but by switching the scene mode to night portrait they also came out very good.-it is light weight-the battery is very small and the battery charger has a fold in plug making it very compact to store.  We were there for 7 days, used the camera every day and charged the battery twice.-the fireworks pics came out very nice from Epcot.-if you don't want to switch the scene for what you need you can just put it on auto and it will focus and flash for you.  All pics came out great.-I like that it has such a large LCD screen.  I was able to hold it above my head and take shots above the crowds, so that other people weren't in my pictures. Since the screen is so large I could hold it up high and  still see what I was taking a pic of.-you can video.  I took a short video, but did not play with this feature much at all.I really played with this camera at Disney and found NOTHING that I did not like about it.  This camera sure gives an average and experienced picture taker more bang for their buck.  You really can't ask for more, BUT....guess what?When I got home I knew I could view the pics on my TV screen, so I plug it in and the camera asks if you want to do a 'slideshow'. I click on slideshow and sit back to watch all the pics on the TV screen.  Well, all of the sudden this music starts playing, very nice music, to the slideshow!! Imagine my surprise.  I had no idea that it would play music with the pics. I just can't say enough about this camera.", "Date": "September 29, 2009"}, {"Title": "A good purchase", "Author": "pr", "ReviewID": "RZZ53W809QE2S", "Overall": "5.0", "Content": "I spent a couple of weeks doing the research (reading reviews, asking around) for a new camera and am very happy with this purchase. Great camera. Photo quality is very good. Well made. Easy to use right out of the box, but with good features, too. A good camera for traveling, which is the reason I bought it. Highly recommended in this price/feature range.", "Date": "July 17, 2009"}, {"Title": "great value for my needs", "Author": "Jonelly \"wk\"", "ReviewID": "RQH252S5NW18S", "Overall": "4.0", "Content": "My initial goal was to purchased the ZS3 but after following the product availability and pricing on Amazon over a three month period and finding very little discount on the product I suddenly came across the ZS1 for $150 less.  HD video is not a priority with me, nor the rather attractive color range of the ZS3.  I could even live with a slightly smaller LCD but the basic engine, the excellent Leica lens, the solid Japanese construction, superb wide angle and zoom fulfilled all my essential checklists.Even though it did not come with a camera case (a detail that irks me from most manufacturers nowadays) there were no other accessories that I needed apart from a decent capacity SDHC card.I am more than happy with the ZS1 and have no regrets in picking it rather than the 33% more expensive ZS3. But if I had a penchant for HD video, I would go for the ZS3 definitely. The vendor, Electronic Expo, was every bit as good as Amazon.", "Date": "September 14, 2009"}, {"Title": "Surprisingly good photos from a very tiny package", "Author": "Amazon Customer \"Brian L\"", "ReviewID": "RO31MLYG2N0XU", "Overall": "5.0", "Content": "I have used SLRs and DSLRs for almost 3 decades but as I get older, I find that the weight and volume of the camera, bag and lenses is a burden which has led to me to often leave the camera behind.  And last year in SE Asia, I had to keep my DSLR wrapped in plastic during most of the Lao New Year Water Festival to protect it from all the spraying water.  This little camera would have been much more useful as it would have been easier to protect and take out to grab a photo of the festivities.  I missed many photo opportunities with the DSLR.I also tried several smaller cameras and have used a few of the \"super zoom\" compacts with zooms from 20X to 26X, but I have't been real happy with the image quality.  The additional zoom length simply compounded image quality problems due to the exaggeration of camera shake at extremely long focal lengths, even with image stabilization.  From my experience, I think the 20X and up zoom capability is more a sales gimmick and leads to lens quality compromises and additional blur from movement.So I bought this camera after reading a dpreview web comparative review of small zooms to see if the ZS1 could deliver quality closer to my wishes.  I have been extremely pleased with it, although I will admit that there is ultimately nothing like the quality and flexibility of a DSLR.  However, I find myself taking the camera more places, taking more shots and having a large number of very nice pictures.  So I begin to think that the trade-off is worth it for me.As a former dedicated SLR user, I feel silly (and amateurish) having to use an LCD instead of a viewfinder and prefer looking through the lens for the clarity of the subject and the additional point of support for getting blur-free shots.  But it is a compromise I am getting used to and the image quality of this camera is very good.I have posted a series of photos I grabbed in my backyard to show the difference between 25 mm and 300 mm equivalent (compared to 35 mm film camera) and cropped two photos and combined them into a single image to show how well the 12X zoom details from 20 feet compare to a no zoom photo from about 2 feet.  I find that the 12X zoom is more than adequate for my photography.My only regret at the moment is not buying the ZS3 to get the higher resolution LCD screen (perhaps I would also use the HD video on the ZS3, but it isn't critical to me).  I suspect that the high resolution LCD on the ZS3 would be helpful in ascertaining while shooting whether a shot is free from blur and properly focused before getting home and putting the photos on my computer.  I think I may order the ZS3 and sell this camera on ebay.ADDED 9-2-09The more I use this camera, the better I like it. The 25mm end is great for many photos, much more useful than having a marginally longer zoom (the predecessor to this camera had a 28-336mm 12X zoom).", "Date": "August 16, 2009"}, {"Title": "Great camera for daytime photos or with flash.  Nightime shots, not so much.", "Author": "S. Douglas", "ReviewID": "RYABSFHKJ2SFN", "Overall": "3.0", "Content": "Bought this camera for a trip to Italy.  We didn't want to \"haul\" our Nikon D40 and few lenses around everywhere with us.  This camera fits nice in a jacket or cargo pants pocket and was very convenient for tourism.I was duped by the 12x OPTICAL zoom and the Leica lens.  The zoom and lens work well together and take some really beautiful pictures.  Other reviewers mention adjusting the zoom can be finicky, as it moves a little too fast - I agree - it seems you can never quite get the frame you want the first try without overshooting it.  This is more a nuisance than a deal breaker.So, I bought this camera because of the optical zoom and Leica lens and completely missed the fact that it is incredibly noisy at low light levels.  My eight-year-old Canon S200 pocket camera blows the Panasonic out of the water when it comes to low-light shots.Well, my poor choice wouldn't have been so bad if we vacationed somewhere sunny and did things mostly during the day.  :/  We spent a few nights getting lost in Venice (in December), so it was dark by 6pm.  Lots of really beautiful sights in Venice at night, and all of my shots are grainy and full of noise, even after limiting the ISO range of the camera.Also, the latest firmware of the camera was only developed to recognize Panasonic batteries - use anything else (i.e. affordable, and you get an error that you are not using an approved battery and the darned thing turns off.  This can be fixed by going back to the old level of firmware - you don't lose any functionality, just gain the option of using aftermarket batteries. (and this camera is fairly power hungry - expect maybe 100 shots to a battery)  The old firmware is difficult to find on the internet, but it is out there.  If you reply to this review with your information, I can send it to you via e-mail.  Such a silly function shouldn't be included in a camera.Pros:LightTakes great daytime and flash photosSmallCons:Proprietary battery firmwareToo much noise on photos shot in low light", "Date": "January 24, 2010"}, {"Title": "Nice Little Camera with a Good Feature Set", "Author": "Joe Blow Consumer", "ReviewID": "RL0WW9FRXUHSX", "Overall": "4.0", "Content": "I've been using Canon digitals for a few years and have really enjoyed their feature set, ease of use, and the fact that they used standard AA batteries.  My intent was to purchase the sx120 but it was missing a few features I felt I wanted (wide angle lens, auto bracket mode) and it was bulkier.  While researching I found a few cameras that met my criteria and decided on the Panasonic.Likes* Wide angle lens 25mm* Auto Bracketing* Image stabilization* Intuitive menus* Nice Build quality* Can zoom while recording video which you cannot with the Canon.* Nice size. Can actually put in your shirt pocket or pants.  You cannot do this with the cannon.* iA (intelligent Auto works well and adjust to macro, etc automatically)Dislikes* No flash intensity control* Thumb wheel turns too easily.* Prefer the button layouts of the cannons (thumb wheel and shutter buttons)to the Panasonic.  I think the different layout might improve the grip.* No manual controls.  Would really like to the ability to set the shutter speed.  :-(  (The canon will do this)* Would like to see more options on the thumb wheel like landscape mode, and night scene.  You can do with the panasonic but you must drill into a menu.  :-(* Non-standard battery.  The trade off here is that this does help make the camera smaller but is limiting when you go out to take a bunch of images with no chance to recharge.  Expensive to replace battery.* (added Jul 2010) Periodically I will shoot panoramic pictures.  The big issue with this camerea is that it doesn't change the file name for the pano images (the cannon does) and this is a problem.  They should be able to address with firmware update but I haven't seen it.  Let me claify, when you take several pictures you want to stitch you cannot tell by the file name that the image is part of a series.  When you go to look at your pics a week later on the chip you may not (probably will not) remember that the picture was part of a series.  You will see the image and say \"whoa what is that\" and think you just have a made bad shot when really it is part of bigger nicer image.  If the file names for panos started with a unique suffix then this could easily be avoided.  I have ended up accidentally deleting images due to this short comming.While the Panasonic is missing some features of the canon (manual controls, flash intensity)it makes up for these with size, and quality. If panasonic could implement a few of the canon's features then you would have an awesome little camera. The bottom line is that the best camera is the one you carry and use.  This camera is not super small but is smaller that some of its competition making it a camera I will carry.", "Date": "December 2, 2009"}, {"Title": "Great camera. Aftermarket battery?", "Author": "Saul Nathanson", "ReviewID": "R3HT1JAKMD0GJD", "Overall": "5.0", "Content": "Have this camera about a week and have taken maybe 1000 pix or more. Results from out door shooting were magnificent. Especially liked the burst mode. Indoor shooting was mixed but I think I need a little more experience. Surprisingly camera was not as bulky as I had feared but it is not light. As to the battery - I followed all the talk about aftermarket batteries. My camera, from Amazon, came with firmware 1.1 which allowed me to use aftermarket battery. I bought one for $27. with a 1200 mah rating (895 0n original). Shot 300 photos today and battery indicator didn't even go down one bar. Will it explode in the future? I don't know I just resent the hell out of Panasonic not letting me decide if I don't want to buy their branded battery for more.", "Date": "August 9, 2009"}, {"Title": "Great Point & Shoot Camera", "Author": "M. H. Eldred \"maegan100\"", "ReviewID": "R26G6S7GC1NVM3", "Overall": "5.0", "Content": "I considered a Nikon L100 and a Canon SX110 IS before deciding to purchase this camera instead, due to similar specifications, but much smaller size.  I am very pleased with this camera so far (I've only shot just over 100 pictures).  The zoom is incredible, and you can even zoom further if you decrease the MP of the pictures.  My pictures have been sharp and clear, even for extreme close ups.  For one picture of a flower I could see the tiny pieces of pollen that had fallen on one of the petals!  The menus are easy to access and use.  Although I was a bit worried about the placement of the shutter button (past the mode dial), I have not had any problems bumping the mode dial or feeling like I'm having to reach over that dial (and I have short fingers).  I have found picture recording time to be pretty fast using a 8 GB, class 6 SD card.  The camera feels sturdy and well made.  Overall I'm very happy with this camera!", "Date": "July 30, 2009"}, {"Title": "Best small digital camera on the market!", "Author": "J. Vaughan-Chaldy \"John Baron\"", "ReviewID": "R3VZXYTFV5C021", "Overall": "4.0", "Content": "I purchased my first Lumix DMC in Jan of 2007 becuase of the 8MP and a 10x Optical zoom and was more than pleased with the results it produced. The more I used it and became familiar with the other features the more I liked it. I shoot on the higest MP and then crop and edit what I want and end up with photos that blow people away.I've purchased two more of the newer versions and now have just gotten the 12x optical zoom version. I bought the new cameras becuase my wife and daughter ended up always borrowing my camera becuase they liked it better than theirs.My wife discovered the video feature and has been using that more than the stills. The videos are awesome. My daughter shoots alot of school events and her albums have are terrific.No regrets with the LUMIX DMC cameras, great quality, travel well and very easy to use and they make the user a better photographer than they really are.John BaronFallbrook CA", "Date": "August 18, 2009"}, {"Title": "Superior", "Author": "William Wheeler \"Experienced Amateur\"", "ReviewID": "R3FB5CUHMW9EZH", "Overall": "5.0", "Content": "The quality of the images is superior to Canon SLR with a $500 Canon lens. That says it all.Eveything works as represented, but the lens and resulting images are truly outstanding. My camera club agrees.Delivery was prompt and thats all one can ask.", "Date": "July 8, 2009"}, {"Title": "My 4th Panasonic Lumix Camera", "Author": "Yarii", "ReviewID": "R2GHZ49PPYVFP6", "Overall": "5.0", "Content": "This is my 4th Panasonic Lumix camera and I hate to say it because it is a super camera, it's my least favorite of the four I have owned. Still worthy of 5 stars though. I thought I'd upgrade from my Lumix DMC-TZ4 Panasonic Lumix DMC-TZ4K 8.1MP Digital Camera with 10x Wide Angle MEGA Optical Image Stabilized Zoom (Black) which I purchased from Amazon in October 2008.  But except for the additional optical zoom on this one (12X versus 10X), an additional 2 MP, and the difference in the millimeters in the Leica lens (25mm versus 28mm) I don't see much difference in the two cameras at all.  Picture quality is what matters most to me, and one is just as good as the other.Other than the above, the only feature that is upgraded in this ZS1 is the ability to use the flash during the Burst Scene.  Using flash during the burst uses lots of battery power, which is to be expected.Also, on the Pet Scene mode you can enter just one pet's name and age.  On my older camera, I can enter the information for 2 different pets.This camera does take fantastic pictures, which almost rival a DSLR, so if this camera will be your first Panasonic, you will be more than pleased with the picture quality.  I can see every little strand of fur on close-ups of my cats.  I have uploaded a couple pictures here, but you need to keep in mind that any picture you see here on Amazon will look much better in person on your own computer.This camera is well-made but most of it is a heavy duty plastic.  The tripod mount is centered on this camera so if you use a mini-tripod it shouldn't fall over.  The mode dial seems to be out of place, it's located where the shutter release is located on most cameras. This camera is Made in Japan.  It's hard to find a Japanese-made point & shoot camera these days.Please Note:  If you plan on buying additional non-OEM batteries for the ZS1, do not update the firmware from the one that comes on the camera.  Once you do that, you will only be able to use a Panasonic spare battery.", "Date": "January 25, 2010"}, {"Title": "Pocket sized pleasure", "Author": "Modemjunkie \"Len\"", "ReviewID": "R1VJXA9ESPP9J6", "Overall": "5.0", "Content": "I have been very happy with my Canon Powershot S2  but wanted a pocket camera with some of the same features. There were two things I really needed: a 10 - 12 X lens and a flash-off override that would assure that the flash did not default to \"on\" when changing modes or restarting.  The first was easy to find, but the flash issue was harder.  I finally went into a local camera store and looked at various models and confirmed that the Lumix DMC ZS1 really had that function and not merely one that changed the setting temporarily.When I got the Lumix home, I discovered that it had the third feature, too - The ability to bracket my shots, take three shots automatically at slightly different F-stop equivalents. I hadn't even tried to look for that feature in a pocket camera, even though it is one of my favorite features when in areas with uncertain or varying light.  This camera greatly exceeds my expectations. And Amazon's prompt delivery let me shoot the fall colors before the leaves were gone, and capture many sunsets and the harvest moon rising.", "Date": "November 16, 2009"}, {"Title": "good choice!! great value!", "Author": "Enjay", "ReviewID": "RZ7Z7PADJCJX1", "Overall": "5.0", "Content": "I'm glad i decided on this camera! worth what i payed and more. this camera is perfect for beginners to photography, one possible problem is that it doesn't have many manual features but when you consider that it's a point and shoot it has great features. don't have the problem some people complain about: the mode dial moving, my mode dial seems secure but i just got it so idk yet for sure. but from what i see so far it is a great camera. I researched a lot before deciding on this particular camera and i'm glad i decided on it. 10 MP is just right, especially considering it's zoom capabilities, quality is good even at highest optical AND digital zoom. definitely a good choice for a point and shoot!", "Date": "October 27, 2009"}, {"Title": "Great \"travel\" camera", "Author": "Ray T", "ReviewID": "RO927IOB74USO", "Overall": "5.0", "Content": "On another camera review website, this was listed as one of the new class of \"travel\" cameras, and I can see why.  I recently used this camera on a 2 week trip to Spain.  As I have an interest in photography, I do take a large DSLR with lenses; however I like a \"point and shoot\" for wandering around at night and situations where I am trying to \"relax,\" such as being in a park.  On the trip, I took about 500 shots with the Lumix.  The lens range, from wide angle to mid telephoto was great.  Picture quality was good, as was focus speed, start up speed and zoom speed.  The camera performed well for a \"point and shoot\" in low light.  One issue was that the LCD did \"wash out\" a couple of times, but that is typical of a camera without an optical viewfinder.  Also, it is probably a good idea to charge the battery daily.  This camera is slightly larger than the average \"point and shoot\" but it still fit well into a pants pocket.  It was a bit too bulky for a shirt pocket.  It seems a very good travel camera for those who want snapshots on a trip and a very good travel camera for those who want to supplement their large DSLR.  I'm glad I bought it.ps  Wanted to add, I use my own \"higher end\" photo processing software, so I have not installed all of the software that comes with this camera.  However, I did install the free panorama maker.  It works great.  As I did not have a tripod, I took freehand pictures and this software was able to stitch 6 together very well.", "Date": "September 30, 2009"}, {"Title": "my first point and shoot", "Author": "Jungatheart", "ReviewID": "R1XXH05FQZT21D", "Overall": "5.0", "Content": "I searched long and hard for a small, lightweight digital camera that would meet my specifications.  As a former photographer's assistant, who studied in-depth at SVA, I never switched from my Nikkormat - a great dinosaur.  The combination of 10MP/12X zoom plus the Zeiss lens sold me.  When I took it out of the box I was WOW'ed.Physically, it fit just right in my hands although I never touched a digital camera before.  The set up was so simple that I didn't really need instructions (but went back and read the entire manual afterwards) and experimented by taking about 50 shots of my cat.  The results were amazing.  I only used iphoto for editing and still produced excellent results.  This camera proved to be beyond my expectations.", "Date": "September 18, 2009"}, {"Title": "Amazing beautiful photos with a point and click!", "Author": "Adam Raszynski \"dontwantit\"", "ReviewID": "R2OB1NL9ZDJNH7", "Overall": "5.0", "Content": "So far so good!I got the camera, an extra battery because you cannot charge from PC (make sure that the battery is compatible with VER 1.2 of the firmware if ordering off ebay or amazon), and a class 10 Transcend memory card SDHC.Slightly bigger than the usual pocket camera.Nice menu and sounds to let you know it's autofocused.You press the button halfway very easily and it beeps pleasantly and a green dot appears on the screen.Shutter speed is fast, and takes the picture quickly.The camera took about 1 second before it was ready for the next photo. Very fast.I am very happy with the feel, weight, size, speed, and ease of use of this wonderful camera.Took about 30 photos outdoors, and they came out stunning!  I uploaded 5 of them to the gallery for this camera.  Please check them out, although it makes a huge difference to view them in high resolution on your PC as a slideshow!Takes video that is very clear and nice.IA mode lets the camera do all the work, and you just point and click.Will review more in a couple months.", "Date": "May 12, 2010"}, {"Title": "Lumix DMC-ZS1: Worked great Vietnam travel pics", "Author": "Restless reader", "ReviewID": "R2G42BDE77RBV3", "Overall": "4.0", "Content": "It's been a few months since I bought the DMC-ZS1 for a trip to Vietnam. I wanted to fully understand the camera before writing the review. Guess what? I still don't understand the camera - the manual is not user friendly at all. However, I learned enough to take some great pictures (I've posted a few for you to see). What sold me was the 25 mm/12x optical zoom lens. I wanted to have a portable camera that could take wide angle shots of stunning landscapes as well as close-ups of people without looking conspicuous. This camera is an excellent value considering all the features that are packed into its compact, well-designed body. The best, most comprehensive review for this camera is at Digital Camera Reviews: [...] If you want to know what my experience has been like, read on.Camera Size/ViewfinderIn terms of size, it's compact but not small or light enough to fit comfortably in your pant/shirt pocket. The body feels quite sturdy and has some weight to it unlike many of its competitors. The 2.75 inch screen is a nice change from the tiny one on my Nikon Coolpix 5200. Before the Nikon, I was using an old, manual Yashica. I don't miss the viewfinder - most are too small in digital compacts to be functional. The one bug I found in this camera: When you're shooting in bright/sunny conditions, rays sometimes appear on the screen. They don't affect the quality of the picture but it is an annoyance.Battery LifeI did not buy an extra battery for the trip - they're very expensive. With a cheap adapter, you can easily charge the battery at your hotel. If you refrain from playing back your pictures and using video, you'll easily get a day's shooting on one charge. So do yourself a favor and don't spend $60 on an extra battery, unless you're gonna be in some remote, godforsaken place. I bought a Class 4 8 Gig SD card (I didn't take video). At the end of the three week trip, I still had plenty of room for pictures on my card.Image Quality/Ease of shootingI mainly used IA (instant auto) and a few of the scene modes. The soft skin setting works nicely for portraits. In IA, you can adjust picture size and color. You can also access \"burst\" mode. There are a few manual settings like shutter speed, white balance and metering. There are also creative settings like Sepia and B&W;, although you may want to save this for your photo editing software.The extended zoom is a big disappointment. It doesn't want to focus. I wouldn't recommend using it on any moving object. Wide angle is the main reason why I bought this camera and I haven't been disappointed with it.My night shots of Saigon came out very acceptable, although there is some noise.  Speaking of flash, I really liked that you could turn off this feature and keep it off. My friend's digital compact always defaulted to the flash setting. She had to turn it off every time she a took a picture.This became a major annoyance for her.The colors are quite vivid and sharp, however, pictures taken in bright light seem a tad over-exposed (even when using Instant Auto). Other reviewers also noticed this in their pictures. This is not an easy thing to correct and Panasonic should look towards improving in this area.Over all, the DMC-ZS1 did me well in Vietnam and I'm very happy with how my pictures came out. This is a great travel camera if you're looking to go beyond snapshots. However, Panasonic still needs to improve in a few areas before achieving the status of a perfect compact camera.", "Date": "January 16, 2010"}, {"Title": "I love this camera!", "Author": "Lifelong learner", "ReviewID": "R8OUY5RPNC2NM", "Overall": "5.0", "Content": "My purposes for this camera are to be able to zoom in (optically), to have easy portability, and to be able to understand the settings fairly intuitively. This camera achieves all of that and more! We take it everywhere. I'm able to take awesome macro shots of flowers (which have inspired my art glass designs) without a tripod. I can take action shots, scenery, and great family photos. We've had prints made and they're exactly what we were hoping for. We had an earlier version of this Panasonic, and it was good, but the zoom was inadequate for my flower shots. This version is a little larger, but not so big that it causes a transport problem, and provides all the features that our other camera had me wishing for.", "Date": "October 12, 2009"}, {"Title": "Loved it", "Author": "Austin K. Itamoto", "ReviewID": "R1XG9N7TWVNB27", "Overall": "5.0", "Content": "I felt that the camera was an excellent buy. The fact that it has 12x optical zoom and 10 megapixels, and all of that with such small dimensions, it wasn't hard for me to like. Although Panasonic's higher model the ZS3 has significantly more features like HD video capturing, I find that the video quality is sufficient for the day to day things. So unless high definition video is something that you are interested in, I would say that the ZS1 is the camera for you.", "Date": "October 6, 2009"}, {"Title": "Excellent for travel", "Author": "J. Stevens", "ReviewID": "R1NVEYPAJFTNCK", "Overall": "5.0", "Content": "I've bought this camera for a 3 month excursion through europe.  10 days in and I love the camera.  It is easy to use and the wide angle is great.  Also, the battery life is fantastic.  I can get through a good 300 pictures before having to recharge.", "Date": "September 19, 2009"}, {"Title": "Great Buy", "Author": "M. Duffy", "ReviewID": "R27CPCFU8805T8", "Overall": "5.0", "Content": "I will reccomend this camera to anyone. The zooming capabilites are amazing. At a sporting event, we took a picture of the field in play. We can zoom in on the acutal picture and see the faces and whats on the t-shirts of the people acorss the basball field. Great buy!", "Date": "September 14, 2009"}, {"Title": "Fantastic little camera", "Author": "P Roberts", "ReviewID": "R14CY3LRL12HV2", "Overall": "5.0", "Content": "For a point n shoot, this is one little fantastic camera. It takes great pics, really fabulous. Colors are just wonderful. Screen is big that is great for viewing and playback. I bought and Nikon and had to return it, and the Canon controls did not seem that friendly. I bought this for my 77-year old mother who loves to travel and take pics of her grandkids, but has to date been given cheap crappy cameras and blames herself for the subsequent bad pics. This has improved her shots out of sight. She has shaky hands so I needed something that was quick to write. It more than fulfills her needs. In Intelligent mode, it gives a great pic. The killer for me was that it can easily be programmed to 1600 ISO for low light shots  - it was perfect for a shot of the interior of a church. Not even some of the Nikon SLRs can touch that performance!! Its face recognition is a marvel, it works fantastically. It even has art filters that are only now being introduced to the big d-SLRs. It has a lot of in-camera processing that is easy to use rather than using software on the computer to get done. Its just a fantastic brilliant little camera. Oh, did I mention the zippy zoom? And I haven't explored half of its functions! Its a great bargain.", "Date": "August 29, 2009"}, {"Title": "Buyer Beware!", "Author": "Anthony", "ReviewID": "R3P6YFW9D5T9Y6", "Overall": "1.0", "Content": "I bought this product, my third Panasonic camera.  It had an optical defect from the start, so I returned it under the warrantee.  I didn't think it would be a big deal.I have now been arguing with Panasonic for over a month.  They are willing to replace it only with a refurbished/used model, whose history is unknown -- and which of course I could have bought for much less than the brand new one I did buy.  They refuse to budge, and are entirely unhelpful.So if you want a new camera, pick another brand!", "Date": "July 9, 2010"}, {"Title": "Glorified snapshooter", "Author": "tertius3", "ReviewID": "R1JB5KX8R32VYX", "Overall": "4.0", "Content": "The ZS1 is a wonderfully light compact camera with a big 12x zoom (the ZR1 has only 8x). The optical zoom can be pushed to 21x, at the cost of resolution. Everything is pretty much automatic. Lots of fun. It has many setting choices (parameters like file size, aspect ratios, metering--accessible on Quick Menu during shooting) and numerous Scene modes (including panorama sequence, for stitching in software supplied on CD). The \"Food\" Scene even made my cooking look like real food! Still more fun. Records 5 sec audio with still pictures. Numerous playback modes. It takes about 160 highest resolution pictures per battery charge. I carry it in a little protective bag, and it still fits in my (pants) pocket!I had trouble seeing the LCD image, camera focus, and tiny icons in raking sunlight, either because the screen washed out, or reflected my sunny face. What do I do, look through a funnel instead, or drape a black cloth over the camera and my head (like the original glass plate view cameras a century ago!)? There's no viewfinder, so we can't hold the camera to our face and avoid the whole problem. (Note that these can be problems for most recent compact cameras, with their fixed LCD screens.) Awkward placement of shutter button on mid line and inboard of mode dial and zoom knob.PC and AV cables, as well as one battery and charger, are included (no memory card, although 40MB is built in). Other acessories are expensive, if not a gouge. Buying the optional AC adaptor to power picture transfers will set you back $130 altogether, due to the additional required cable-connector purchase. The AC adaptor does not recharge the battery. All these are proprietary ($$$) rather than standard cables. Note also that Panasonic firmware 1.2 does not allow the use of non-Pansasonic ($$$) aftermarket ($) batteries as spares.The ZS1 does only 848x640 max motion-JPEG monaural movie (while ZS3 adds AVCHD 720HD in stereo). If the camera won't automatically take a picture I like (for example, depth of field, right amount of motion blur), it is hard to alter settings to something I liked better. The camera has no aperture- or shutter speed-priority modes, let alone full manual control. What a shame! That's why I say it is a snapshot camera, rather than THE gloriously pocketable substitute for an SLR. If you demand such creative controls in a faux-SLR, consider the Canon Powershot SX200 IS (whose feature set in the same form factor is better compared to the Lumix DMC-ZS3, both with added HD video, a bigger LCD, and higher price).", "Date": "September 22, 2009"}, {"Title": "Solid camera", "Author": "Travis M Loux", "ReviewID": "R1R9RSR2RBJ5P3", "Overall": "4.0", "Content": "I used to have a Lumix TZ-1, which was great, and was hoping this would be an upgrade over that.  Most of the technical details are improved (10x to 12x zoom, 5MP to 10MP), but as a general user I can't really tell much of a difference in picture quality.  The camera is noticeably smaller though, which is nice, plus some extra features.  The biggest downfall is that the lens on this camera extends (3/4 to 1 inch) even when the zoom is set to 1x, making it harder to carry around while it is on (once it goes to power save mode or is turned off the lens fully retracts into the camera).  I ended up just turning the camera on and off all day, which was a bit of a hassle.Overall, this camera is great for regular use, with dozens of options that are very useful and easy to navigate.  My only issue was with the lens.  I was worried I would break the camera if I carried it around with the lens extended, though that never happened (I do tend to be paranoid about stuff like that).  The smaller size but less convenient lens makes it a wash with my old TZ-1.", "Date": "August 21, 2010"}, {"Title": "Excellent Camera!", "Author": "C. Chiu", "ReviewID": "R3GKY894B9SC1R", "Overall": "5.0", "Content": "I bought this camera to replace my previous one - Canon A40, an 8 years old camera. I've gotta say I'm quite impressed with the capability of this camera.Size: this camera is quite small. it can be easily put in your vest or jacket pocket. when i visited NYC, i had this camera in my vest pocket the whole time, so i can randomly take it out for a shot.Battery: the battery life claims it takes up to 300 images. i am not sure if it's related to my setting or what, i take 3MP in iA mode, i actually took up to 500 images and couple less than 1 minute video clips in WVGA before the battery ran out. however, i'd still suggest any one who buys this camera to get a spare battery just in case, since this is not AA battery that anyone can replace easily. the oem battery is nearly impossible to find, or just expensive. the non-oem are everywhere, just need to make sure it works with the new firmware. and technically speaking, non-oem are at least 1000 amh+, which hold more juice than oem battery.control: the on/off button is obvious and you can feel with your finger. i can just grab the camera with one hand, turn it on on the way out of my pocket and take photo right when it's in front of me. other control such as zoom in/ out, menu selection is quite standard like canon, etc. nothing too fancy.lens: the 12x zoom is amazing, so is the optical stabilization. i was literally able to take a photo of a concert in low light condition, with 12x zoom, and without worry about blurry image. 25mm zoom is great for take images such as whole building in close distance, indoor image, group shot, landscape etc. i am amazed how wide the angle this camera has without having fish eye effects, or any distortion on the edge of the image.flash: i personally don't like the flash as it literally destroy the original color of the image. but when i need it, it's quite bright for indoor, or outdoor brightening object purpose. the recharge time is short, less than a second as far as i know, but i also heard that as battery gets older, the recharge interval time will also be affected.image quality: since i mainly use iA mode, the images are overall pretty nice. with the optical stabilized lens, i was able to take some indoor shot in low light condition without any blurriness, but the iso might be a bit high and more noisy, still bearable compare to my A40 though. the color is generally accurate, the images are not too grainy. the biggest drawback is night shot, the auto mode with night shot is bad, it doesn't capture enough light or doesn't open up enough. the whole photo looks like a pitch black piece of paper with few bright dots. for night shot, you will have to go manual on the settings to get what Canon or Nikon can automatically do. i generally just set the manual mode for night shot only, so when i need to take the night shot, just turn the dial and it's good to go.overall, i love this camera! quite small, excellent battery life, really good optical stabilized lens with 12x zoom and 25mm side angle, easy to control, and it's really just point and shoot. the only draw back is the battery isn't AA (which is cheaper and can be easily replaced), and the night shot is not up to par unless done manually.", "Date": "June 22, 2010"}, {"Title": "Great Camera.......Fantastic Zoom", "Author": "rifrickendiculous", "ReviewID": "R8O2RPFLNNYYS", "Overall": "5.0", "Content": "I have to start by saying I never write reviews, but after having this camera for only a day, I have to say it is incredible.  I got this camera to zoom in at concerts when I don't have the best seats.  I went to see ZZ Top last night, and my photos look like I was right on stage with them.  I was sitting about 100 yards away.  And the clarity is AMAZING!!!!!!  I couldn't be more thrilled.  And for the price, you can not beat it!!!!  I also took some videos, and even though this camera doesn't record in HD the videos were still great.  I definitely recommend this camera!!!!  I posted a few of the pics on the product page.", "Date": "April 30, 2010"}, {"Title": "LOVE my Lumix", "Author": "SF User \"j\"", "ReviewID": "R3U8NFYJFGXD6Z", "Overall": "5.0", "Content": "Perfect camera for those who are not pro photographers but still want to be able to take amazing pics.  The presets are fabulous and finally you can take flattering portraits of people that aren't so HD that you see each pore on someones face!  Just nice pics, great color and great presets.  Plus the size is great.  You can take the kind of quality pics you would by bringing a huge Canon or Nikon but this just fits in your bag.  Bigger than the Canon elph but not by too much.  Also, takes great low light pics.  That's a huge plus!", "Date": "February 24, 2010"}, {"Title": "Panasonic Lumix DMC-ZS1", "Author": "BHAnderson \"R h Anderson\"", "ReviewID": "R3I9THR1N7NU8A", "Overall": "4.0", "Content": "I own this camera. I have owned Nikon and Olympus pocket size digital cameras. I own a Canon digital SX20- 20X optical zoom. I have been very satisfied with the Nikon. I ordered the Panasonic Lumix after reading reviews about the line of Panasonic digital cameras and because of the 12X optical Zoom. Most pocket digitalis have a 3X or 4X-Zoom - about worthless for me. Zoom is not important if you live in the city and most of you pictures are taken a parties and from sitting across the table from friends and a photo shoot is a trip to the zoo or a trip to the park, but when you live in Alaska and you are trying to catch a Beluga whale as he breaks the surface of the watter, an eagles nest or Doll sheep you need all the zoom you can afford. The Panasonic ZS1 is an above average pocket digital camera with many picture taking options that takes a better than average photo and video and with a 12X optical Zoom it is in a class by itself.", "Date": "December 12, 2009"}, {"Title": "Exactly what I was looking for!", "Author": "R. D. Provins \"Doug6100\"", "ReviewID": "RPSIT4CT8TB8U", "Overall": "5.0", "Content": "I wanted a wide angle point and shoot. This little camera is great. I will start by saying that I an amateur photographer. I have been looking for a wide angle point and shoot in my price point for about a year. I started noticing this Panasonic and took a shot at it. I could not be happier. Our last two cameras were Canon 3MP point and shoots.The camera almost always shoots in 'intelligent auto' mode. Pros:1. Great photos.2. Wide angle, 25 mm lens.3. 12x optical zoom.4. Shoots video. I can finally zoom in or out while recording on a point and shoot.5. Hiqh quality touch and feel. Heavy enough to really seem well built without seeming clunky.Cons:1. This is probably my personal issue only. The camera's red-eye reduction does not seem to work in 'intelligent auto' mode. I have noticed that I have to manually select that option. Not a big deal but I don't like to have to think about these things. Automatic should be automatic. There may be a way to set that to default that I have not discovered yet.2. I think another reviewer pointed this out. I am disappointed that the data port is not a simple mini USB. They have some sort of proprietary connection. Now I have to keep track of that little cable for the life of the camera.Overall, a great camera for less than $200. Now if I could just get the wife to give it back. :D", "Date": "November 21, 2009"}, {"Title": "Big, but worth the extra weight.", "Author": "A. Schram", "ReviewID": "R1L5HES3O690JO", "Overall": "4.0", "Content": "Camera is great, features are awesome (I'm still learning new things every day), but it is a bit large. Not a camera for a woman who wants to carry it around in her purse all the time.", "Date": "October 12, 2009"}, {"Title": "The perfect camera for any occasion", "Author": "K. E. Bass", "ReviewID": "R3CUGHT2YV7SBQ", "Overall": "5.0", "Content": "This camera is perfect for just about anything! I had an older version of this camera and when it came time to purchase a new one, I did extensive research on all brands of cameras. As I read reviews for many cameras, all brands had good and bad reviews. So I went with the one I know. My older panasonic was such a great camera that I decided to buy the newer version and I have not been disappointed! You just can not go wrong with this camera!", "Date": "August 11, 2009"}, {"Title": "Awesome Travel Camera", "Author": "Matthew Powers", "ReviewID": "R2OWIAOAJLEZ1P", "Overall": "5.0", "Content": "I use a Sony A700 DSLR for my \"serious\" stuff, but I love having a good camera small enough to \"whip out anywhere\" and still get a quality shot.  I've used several Lumix cameras over the years and they keep getting better.  Loaded with features, like a 12X optical zoom and optical stabilization, this camera will not disappoint.", "Date": "August 10, 2009"}, {"Title": "Great camera... for one week!", "Author": "Roy E. Meade \"Eigeneng\"", "ReviewID": "R1T91X2WV46IM6", "Overall": "1.0", "Content": "I purchased this camera for a trip to Disney World, and got it just a few days before the big trip.  I liked the Leica lens, optical zoom, and good reviews.  It took great pictures (for a point and shoot), and seemed to be the right choice.  Unfortunately, after about five days of normal use I started to have trouble with the lens.  The camera told me \"Please turn camera off and then on again.\"  That seemed to work the first couple of times.  However, by the end of the week the lens would not retract, zoom, or function at all.  In fact, in order to get the lens to retract, I had to turn off the camer, turn it back on (at which time the lens would retract), and then quickly pop out the battery.  Otherwise, the lens would come out and get stuck.  Needless to say, this was a disappointing purchase.  Luckily, I had my very old Sony DSC-W7 to finish the trip (it weighs a ton, but at least it works).  Frankly, I would advise against purchasing the ZS1.", "Date": "May 22, 2010"}, {"Title": "Candid Feedback", "Author": "V. Jain", "ReviewID": "R1337G41J5LE3U", "Overall": "2.0", "Content": "After a lot of research and reviewing many of the comments from previous users we purchased this camera for our vacation. Unfortunately, we were really disappointed with the indoor picture quality - they were often very dark with the subjects appearing dark in the iA mode and scene mode. We eventually ended up buying a Canon Powershot during the vacation with a much better indoor and also great outdoor pictures even though it has fewer features.", "Date": "October 9, 2009"}, {"Title": "Sony is Better", "Author": "John R. Durish", "ReviewID": "R7JASWJ5LYBTG", "Overall": "3.0", "Content": "This was one of my few departures from the Sony Cybershot line. It worked great for a bit, but then quickly became a worthless brick. By comparison, our Cybershots, Elfs, etc., from Sony have survived many, many adventures around the globe, including an amphibious landing operation with Russian Marines onto the coast of Poland.", "Date": "December 25, 2013"}, {"Title": "Great little camera", "Author": "POAcritical", "ReviewID": "R2JZ3PJM0U838E", "Overall": "5.0", "Content": "This camera is very cool.  I have had it for over two years now and it still works great.  One of the best features are the the panoramic assist mode, where you get a ghost image of your last shot that is shifted off to the side so you can align your next shot so it blend seamlessly.  Using this feature with Windows 7 Stitch creates a great pano shot.  Another great feature is the fact that this camera will zoom while shooting video.  Great little camera and tough too.", "Date": "November 6, 2011"}, {"Title": "Love it", "Author": "L.Perry", "ReviewID": "R16GKMS0TR0PAS", "Overall": "5.0", "Content": "Ive had this camera for about 2 years and I love it.It was my first camera and was the recommended point and shoot by a professional photographer friend.She actually researched to find the best camera for my needs.I take a lot of macros photos as I market jewelry.It is easy to use and takes beautiful pictures.I dont use the IA but it seems to work ok.The leica lense was the key point according to her.I have only had one issue and that was after laying it down on its face once.The lense got stuck and it took several attempts for it to alighn  and retract.So dont do this.I highly recommend and will use until it breaks down.Then I will buy another Lumix.Very happy", "Date": "October 17, 2011"}, {"Title": "great value for the price", "Author": "Gaston \"Bali\"", "ReviewID": "R2KE7P1AT25OHV", "Overall": "4.0", "Content": "Ancester of the Lumix series, this model has been upgraded thru the years. More recent versions (2, 3, 4) now come with fancy features and higher performance level. Still all of my basic needs are covered in terms of usage and, most importantly, quality. I take it with me constantly and use it in a point & shoot mode. At less than $130 i consider it an excellent deal and i congratulate myself everyday. Go find the last copies out there!", "Date": "September 22, 2011"}, {"Title": "Panasonic Lumix DMC ZS1", "Author": "Tizzie", "ReviewID": "R3DXFPO6NOUE2U", "Overall": "5.0", "Content": "Well I bought this camera about 8 months ago. It is my first digital camera and I got because it had a lot of good reviews.I waited this long to write a review on it because I wanted time to really check it out. I have to say that I am VERY happy with the DMC-ZS1!! It didn't take me too long to figure out how to work it and all my pictures so far have turned out great! I have even taken some pics from a moving vehicle and you would never know unless I told you.Great close ups and zoom-ins! Like I said; this is my first digital camera so I don't have anything else to compare it to but I am extremely satisfied with this camera!!! It does all I could ask for and then some. I know if I knew more about setting the shutter speeds and other manual adjustments and not just using auto that I could produce even better pics than I already am. Very nice camera!", "Date": "July 7, 2011"}, {"Title": "Great camera for concert videos!", "Author": "S. Wickman", "ReviewID": "R1PEEGIJT30QJG", "Overall": "5.0", "Content": "This camera purchase was the second one we purchased of the same model. We take a lot of videos of rock concerts (see wickmanfam on youtube) and this camera does an excellent job with the audio. Not many cameras can say that when it comes to rock concerts. The  camera also has a 12x zoom which aids at getting up close and personal on videos and pictures.we highly recommend the camera. We now go armed with two cameras (same model) to shows, usually use one for pix and one for video.", "Date": "May 28, 2011"}, {"Title": "Panasonic Lumix DMC-ZS1", "Author": "M. Kahraman", "ReviewID": "R1QICQ3VAW6NIV", "Overall": "4.0", "Content": "I purchased this camera in may and had several trips and occasions to use it in last 3,5 months. First of all, I must say that it fulfills my expectactions; portability, picture quality, optical zoom and IA mode. Battery life is moderate, therefore I bought 2 spare for long trips. I really love the quality of optical zoom that leica provides.This is my third point&shoot; cam in last 8 years and this is the best of all. For this price you can not get better quality than this. I used to be religious on cameras; which Lumix changed this a lot and I am planning to have another Lumix cameras in the future.The only con is: under very sunny conditions the colors are fading on video mode. This might be my fault, because I did not read the user guide.Overall it is 8.5/10.", "Date": "August 11, 2010"}, {"Title": "ONE OF THE BEST POINT AND SHOOT CAMERAS ON THE MARKET!!!", "Author": "jturib \"R ROSA\"", "ReviewID": "R1JF6HZRCYFFZV", "Overall": "5.0", "Content": "As an avid lover of photography, I take pride in the type of camera/equipment I use and promote.  I was traveling in Europe recently and didn't want to risk losing or damaging my Nikon D90 SOOO I began my search for the perfect Point and Shoot.  I asked several friends and fellow photographers for suggestions.  One of my friends told me that the Lumix is by far the best he has ever used.  I immediately hit the Panasonic website to check out the models, types of lenses, processors..etc.  I was thoroughly impressed with what I was reading.  I decided to purchase from Amazon as I have with dozens of items in the past. The fast shipping was appreciated.  I was extremely impressed with every aspect of this camera!!!  It was extremely easy to use, the construction is solid, the wide lens created incredibly crisp pictures with a lot of depth.  The Film Grain setting created some unreal shots...after 300+ shots between 3 European cities, I can HONESTLY say there was not a bad picture in the bunch!  I recommend this camera to any level photographer. I don't have one negative thing to say about this camera! GET THIS!!!!", "Date": "August 4, 2010"}, {"Title": "Am a novice and I like it!", "Author": "volatile", "ReviewID": "R16V71U9GLZUON", "Overall": "5.0", "Content": "I am a rookie...I just take the camera and click the button...thats all I can do...I dont really understand the complex settings...This camera has proved awesome for me so far...I just shift one button and it goes into video mode...The picture quality is great...both inside and outside...kind of okish during night and in low light...but I have been using it only in the auto setting...maybe I can change around some settings to get better pictures in low light...Also it looks really pretty. I think the battery life is just fine. The video quality just amazed me.Its super awesome...and even the voices are recorded perfectly. Oh I just found out these bunch of auto modes...for landscape, candlelight etc...they are just great!!!", "Date": "July 17, 2010"}, {"Title": "Very Good Little Camera.  Easy To Use.  Powerful Zoom.", "Author": "D. Force", "ReviewID": "R4WM5D70KCEYA", "Overall": "4.0", "Content": "This camera was purchased to replace a 10X zoom Olympus digital camera I purchased about 9 years ago.  It is used for general purpose \"picture taking\". My goal has been achieved.  The unit is reasonably compact.  It fits easily into my shirt pocket.  The picture quality is good even for hand held shots that utilize the zoom feature extensively.  Only two problems have been noted so far.  (1) The Intelligent Auto Mode does not seem to be very intelligent -- several photos taken using it were out of focus due to incorrect interpretation of the intended subject of the pictures.  I use the Normal Picture mode with default settings almost exclusively at this point.  The picture quality is much better. (2) The lack of a viewfinder restricts the camera's functionality in brightly lit settings.  The monitor is not bright enough to rely on for framing the pictures in those situations.  For those two reasons, I rate the camera with 4 stars rather than 5 stars for my purposes.  I have not yet used the motion picture feature so can not comment on it.", "Date": "July 4, 2010"}, {"Title": "Good camera, but...", "Author": "Ordinary Reader \"Ron\"", "ReviewID": "RCK4HISDP3GAF", "Overall": "4.0", "Content": "The digital  images came out well but the LCK screen failed after 2 weeks. I'll tell you later how my customer service experience comes out...", "Date": "May 21, 2010"}, {"Title": "great camera overall", "Author": "Jessie Kristie", "ReviewID": "R3A8XICEB1N6GJ", "Overall": "4.0", "Content": "bought this camera last minute before we went to paramore concert in vegas, reason why is my old one's broken after ~5 years. we wanted to get the zs3 at first and did a lot of research, but it was a little out of budget then we decided to give up the hd option and get this one. another consideration was the zr1 but after reading few reviews, we're really glad we got this one.anywho, really really powerful zoom, two thumbs up! with 12x we could see hayley's leopard prints from upper level seats with no noticeable noise. panasonic also did a great job with the scenes (i'm not much of a pro in technology, so it really helped me a lot)video quality is so so, but the audio is amazing, it really feels like another live concert. should've bought this cam for the green day concert a while back.thank you panasonic, and also amazon for shipping it right on time before we left :)", "Date": "May 19, 2010"}, {"Title": "Great snapshot camera", "Author": "Brian_F", "ReviewID": "R23WMK3RKPUO04", "Overall": "4.0", "Content": "I got this to replace a bulkier point and shoot that had more of an SLR size and shape, from another company.  The Panasonic fits easily into a coat pocket, and OK in pants/shirt pocket.  It is compact but a little on the heavy side.  The construction seems sturdy.Picture quality is good. Even though there is a lot less glass than the bigger camera I got rid of, it still takes good pictures even in low light.  The ISO400 looks reasonable, and the anti-shake really works.  The flash is fine.  Purple fringing and distortion are not bad at all, even at the ends of the zoom range.  The processing has a bias towards smoothness, so the detail is not great at full size on the computer, but fit-to-window and printed pictures look very nice.Battery life, focus, shutter lag, and shot-to-shot speed are all also fine for a point and shoot.  It comes with a Li ion battery, but it has to be removed to recharge.  I like the built in lens cover, no cap to lose or get in the way.There are plenty of subject modes but not a lot of manual control over shutter or aperture.  At least it generally makes good decisions about focus, exposure, etc.  The zoom range is 12x, but part of that is wide angle, so it doesn't really give 12x on the long side.  It is usable to the top end of 9x real zoom or so, whereas I would not use my old camera (a true 12x) above 10x or so because of fringing and shake.Overall quite satisfied.  Miss the viewfinder, and could use a little more zoom, but they put a lot in a small package.", "Date": "May 17, 2010"}, {"Title": "panasonic lumix", "Author": "joanna", "ReviewID": "R2VCK33J4ZED21", "Overall": "4.0", "Content": "Fantastic pictures. The camera is light and comfortable to use. After 2 weeks of use the only problem is the ZOOM - the control works too quickly and it is very difficult to get the distance that is right for the situation. I have several times missed a shot because the zoom was too aggressive and I would have to step it down slowly. It probably would be perfect for a sporting event at which all shots would require the same zoom strength, but it is not good for the street photography that is my love.", "Date": "May 16, 2010"}, {"Title": "Excellent, clear pictures.  Easy to use.", "Author": "sparklepony", "ReviewID": "RGHMOAKXRYNIR", "Overall": "5.0", "Content": "I'm not a camera expert.  I'm a Realtor and a mom, so my camera needs are simple- clear pictures, fast shutters, good motion or low-light color.  When our digital camera broke (a canon powershot, which we had been happy with for 5 years) I asked friends who ARE camera \"experts\" to recommend one- Lumix was suggested an overwhelming number of times.  This model fit our budget and had good reviews.The picture quality is great for my needs- the LCD screen is huge and sharp and amazingly detailed.  The shutter speed is great- no long delay while my adorable kids stop being cute before the photo is captured! The camera itself is a little big, which may bother some people, but not me- it fits into a purse or bag fine, it's a tight squeeze to get it into a pants pocket.  There are plenty of features to excite someone who wants to customize their settings, but it also offers you some standard or pre-set settings, for when you don't feel like fiddling with things.  The battery life is good, also.  The color and contrast have been great, and the zoom offers more zoomyness than I'll ever really need.All in all, this was an excellent buy, and I will join the ranks of people who recommend it to friends and strangers in the future.  Not too expensive, either!", "Date": "May 7, 2010"}, {"Title": "I love it", "Author": "kim angelos", "ReviewID": "R1WNVMWU9HGRXU", "Overall": "5.0", "Content": "this is the best point and shoot I've ever owned.  There is so many features it makes it fun to play with. The picture quality is super, I had a 30\"x20\" photo made from one of my shots and the sharpness and quality were close to perfect.", "Date": "April 18, 2010"}, {"Title": "Very impressed with this camera", "Author": "Rebecca \"Rebecca\"", "ReviewID": "R3AM3T1BJ44KY1", "Overall": "5.0", "Content": "I received this as a birthday present though I got to pick which camera I wanted.  I had asked someone at Wolf Camera which they recommended, and this is the one he suggested.  I LOVE this camera, it does so much and is very easy to use.  The zoom is fantastic.  It is much more \"pockety\" than my old camera, and love how many settings it has, as well as being able to customize settings. I took some pictures at the Flower and Garden Show, some on \"regular\" mode, and some on \"stage\" mode (for staged events), and the difference between the shots was amazing.  The colors were completely different between the two.  The \"stage\" ones had the real colors, while the \"normal\" setting was much more orange.  Just shows how using the appropriate setting can make such a difference in results.I highly recommend this camera.", "Date": "March 31, 2010"}, {"Title": "Razor-sharp in good light if held still; okay in low light; extra-wide", "Author": "B. Bush", "ReviewID": "R3GGYNHMTN2SNC", "Overall": "4.0", "Content": "As others say -- very portable and versatile (esp. extra-wide) and capable of takingamazingly sharp pictures in good light. Image stabilization works well, but for extrasharpness, prop camera against support (I have a 12x picture of 5 people at > 1 mile distanceand you can see what they're wearing.)  So far, results in low light (restaurant)without flash are fairly poor; I've limited autoISO to 400.  Small sensor can onlydo so much.  The processing (computation) is amazing -- corrects all distortionsand aberrations.  For scenery, bracketing exposures and post-processing with HDR imagefusion software makes this almost a mid-range SLR in a tiny silent device.", "Date": "March 4, 2010"}, {"Title": "Great little camera.............", "Author": "Jill Merrill \"Jill Merrill\"", "ReviewID": "R1WS10IUU771H1", "Overall": "5.0", "Content": "This little camera was everything I wanted and more. I personally think it delivers the most you can get from such a compact camera. To get more you would have to go to a DLSR. As a DLSR  user I know what I'm talking about. It has lots of features to adapt to any type lighting, sports, vacation, portrait mode, low light, etc. Great zoom and nice stabilizer. Great quality images too. Although the battery was written up as not lasting long, I have not found that to be the case. It doesn't last as long as some but 700 pics and 6 weeks later I needed to recharge it. Finding all the settings is the hard part but once familiar with the camera is performs great. Very glad I purchased it. Taking it to Costa Rica next week so I don't have to carry my DLSR this time. I got it the end of Dec, 2009. quick delivery too in perfect condition.", "Date": "February 11, 2010"}, {"Title": "Absolutely fantastic!!", "Author": "Nikola Milasevic", "ReviewID": "R1V79UOB0AY8RZ", "Overall": "5.0", "Content": "Boy! This is one great little camera! Just great! So easy to use, Inteligent Auto mode is simply flawless, couldn't believe how good the pics were! Also all those other modes-you have everything at the tip of your finger-just select and shoot, and don't worry-if there is a way to make a picture-this camera will make it! And then some! Must admit-as a Canon Mark III user I was a little bit..suspicious, to say the least, but now! Man! I'm in awe! I bought it for my wife, but, somehow, now I'm using it more then she, hehehe...Super happy with this purchase!", "Date": "February 8, 2010"}, {"Title": "one of the best cameras i'v ever owned!", "Author": "James V. Tucker", "ReviewID": "RAO8LYW59TI8L", "Overall": "5.0", "Content": "top of the line camera , sharp pictures, easy to use, time will only tell how it holds up? for now I'm haveing a blast!!!!!!!", "Date": "February 3, 2010"}, {"Title": "Great camera!", "Author": "Karen L. Sinkway", "ReviewID": "R1L2JPDWVQ02LB", "Overall": "5.0", "Content": "We have owned a Panasonic Lumix in the past and loved it.  I bought this camera as a gift for my husband, since we have been doing some traveling recently.  The options that drew me to this model were the large LCD screen, the 12X optical zoom, the compact size, and the great price. We took it on our last trip and got some great pictures.  We are definitely point and shoot people, so the intelligent auto feature is great for us and takes all the work out of picture-taking.  Great camera!", "Date": "February 3, 2010"}, {"Title": "Perfect", "Author": "Spoonbill", "ReviewID": "R3Q67VAENX17G9", "Overall": "5.0", "Content": "I really love this little camera. I had been wanting to buy it for several months, then the price went so low on Amazon that I just had to get it. I've only had it for about a week now, but I'm having a great time learning how to use it. I especially enjoy it's crystal-clear macro zoom mode. I have taken some fabulous macro pics of ice crystals and close-ups of snowflakes. The details are just stunning. I will try to post them here soon. I have been wanting to take up photography for many years, and I believe is a great start - not as complicated as an SLR, but plenty of options to customize your shots outside of the automatic mode. I plan to use this ZS1 as a learning tool, and then maybe someday graduate to an SLR. Highly recommended!", "Date": "December 29, 2009"}, {"Title": "Awesome camera", "Author": "L. Maxey", "ReviewID": "R171RPXY4FLHA3", "Overall": "5.0", "Content": "I've very pleased with this camera.  I haven't learned all the features yet, but the pictures I've taken are incredible.  The images are clear, and the colors are bright.  The zoom feature is very easy to use, and the close up pictures are sharp.", "Date": "December 13, 2009"}, {"Title": "Quick & Dirty Review", "Author": "M. Rogne", "ReviewID": "R2P05X377OOJMJ", "Overall": "5.0", "Content": "This camera is by far the best digital camera I've ever owned. If you want something that simply WORKS, and WORKS WELL... this is hands down a fantastic option!I'm no professional photographer, far from it... and the fact that this camera lets me take professional-looking photos is phenomenal! Absolutely love it... GREAT bang for buck. Now I'm going to buy one for my wife too... hers will be silver though :).", "Date": "November 10, 2009"}, {"Title": "great camera", "Author": "Ralph M. Kaywin", "ReviewID": "R357YOD90AURFJ", "Overall": "5.0", "Content": "this camera takes fantastic pictures - it has an amazing lens for one so small.", "Date": "October 20, 2009"}, {"Title": "lovely pictures !", "Author": "Mar \"Marinera\"", "ReviewID": "R1HDNQ2V1QMV76", "Overall": "5.0", "Content": "what can i say?nice sharp pictures !fastcolorfulgood in low lightvery happy.", "Date": "October 16, 2009"}, {"Title": "lumixDMC-ZS1", "Author": "P. varga", "ReviewID": "R2A94QW7ZEGJNF", "Overall": "5.0", "Content": "The Lumix DMC-ZS1  10 MP  is a great digital  camera, I just love it.I like the LEICA lens a lot, the pictures quality is GREAT .I like the feel of the cameras body ,it fits in my hand fine ,the Price is very good. Good job LEICA and Panasonic.", "Date": "October 11, 2009"}, {"Title": "Panasonic digital camera", "Author": "Peter", "ReviewID": "RAEXNDMOMTKK3", "Overall": "5.0", "Content": "Took this camera on a week long motorcycle trip to Monument Valley and the 4 Corners in Utah, Arizona, New Mexico Colorado and Texas. Its so easy to use and the tele-photo was fantastic. The weight of the camera was wonderful, you just carry it in your pocket.  Overall the camera is perfect. Amazon has the best prices. Priced this camera at 4 retailers before ordering from Amazon. Shipping was extremely fast had it in less then 5 days.", "Date": "October 5, 2009"}, {"Title": "Awesome Camera, even in low light!", "Author": "D. Witham", "ReviewID": "R1NG9A4L85QR9K", "Overall": "5.0", "Content": "I purchased this camera after my 12 year old dumped our Kodak into a pond, and I can't thank her enough! Took over 700 pictures in Vienna and Prague. The low-light pictures inside churches and outdoors at night are just amazing. I can even take low-light video (with zoom). I'm recommending this camera to my 74 year old mother.", "Date": "August 24, 2009"}, {"Title": "Super Camera", "Author": "Travis Sapp \"Travis Sapp\"", "ReviewID": "R10GCX38XALM8W", "Overall": "5.0", "Content": "The pictures are fantastic, the battery life is unreal and it fits in my pocket! Great camera, very happy I went with a super zoom compact camera becauses the zoom always comes in handy.", "Date": "August 19, 2009"}, {"Title": "Great camera - image stabilization is fantastic", "Author": "Traveler & Skier \"happy traveler\"", "ReviewID": "R1OVZ27KVUDG32", "Overall": "5.0", "Content": "I purchased this camera after reading numerous reviews and barely glanced at the manual before taking it on a cruise and tour to Alaska and the Yukon. For the price, you simply cannot get a better compact travel camera. The camera is comfortable to hold (enough of a grip not to slip around when your hands are either cold or sweaty). I was able to get great shots in low light in Denali National Park shooting through the window of a park tour bus.  Likewise, I got wonderful shots from the rocking and rolling rear platform of a narrow gage railroad traveling at 30 MPH on uneven tracks across White Pass - there is absolutely no blurring in these photographs. I've found the camera to be easy to use and the menu and functions to be rather intuitive. Had no problems and got great pictures.  Do order a spare battery if you are planning an long trip and want to take hundreds of pictures.  I ordered mine online and paid only $44 including shipping.  Only complaint is that close up shots of people tend to be harsh but maybe there is a setting that would soften the images taken with a flash - will read the rest of the manual.  Very happy with this purchase.", "Date": "August 14, 2009"}, {"Title": "Great point-and-shoot gives snapshots a little something extra", "Author": "Silent M", "ReviewID": "R3ITT2L5OTGYP9", "Overall": "4.0", "Content": "I'm a big fan of the Leica lenses on the Panasonic cameras. They've got a bit of work to do yet on making the camera's processor keep up with such a magnificent lens, as sometimes the camera is slow to respond, and I think the super lens is also what makes the battery life a bit mediocre, hence I am knocking off a star. Also, proprietary battery and download cables are slightly annoying.But what beautiful pictures this little thing creates, with fairly easy handling. Great camera if you are looking for a superzoom with image stabilization. I compared it against the Canon superzooms, and quite frankly the Panasonic turns out a higher caliber - the Leica lens makes all the difference. I am willing to put up with the minor issues for those great close-up shots.", "Date": "September 28, 2009"}, {"Title": "super wide", "Author": "Ronald Zappala", "ReviewID": "R8IJNBBTWRLWK", "Overall": "5.0", "Content": "BEAUTIFUL PICTURES....I HAVE USED CANONS FOR YEARS ,BUT THE 25MM LENS IS A WINNER...GOOD EXPOSURES....ONLY COMPLAINT IS THE COMMAND DIAL SPINS LIKE A TOP,WAY TOO LOOSE.....", "Date": "August 6, 2009"}, {"Title": "Camera is great but battery is wrong", "Author": "Lenore S", "ReviewID": "RQ9HZKA6HJMP8", "Overall": "4.0", "Content": "I purchased the Panasonic Lumix DMC-ZS1 10MP Digital Camera with 12x Wide Angle MEGA Optical Image Stabilized Zoom and 2.7 inch LCD (Silver)and am delighted with its size, ease of operation, and quality of picture.  One important caveat: I wanted to buy an extra battery and ordered the one recommended by Amazon: it is the wrong battery for this camera; does not fit.  The company that sent it out has agreed to refund the purchase price but does not carry the correct battery.  It is not available in stores, either, so must be purchased directly from Panasonic.", "Date": "July 30, 2009"}, {"Title": "Panasonic DMC-ZS1 --Lemon", "Author": "Bernice Fallon", "ReviewID": "R2612WWL8JFM14", "Overall": "1.0", "Content": "I purchased this camera in Oct. 09 to take pictures for my 40th class reunion.  This camera worked well for about four months, then it malfunctioned.  The shutter refused to open/close.  Since it was under warranty, I was able to get a \"new\" reconditioned model.  This \"\"new\" camera lens would not focus unless I used the zoom.  Wasted many great shots figuring this out.  Returned this camera and got another \"new\" reconditioned camera.  Panasonic insists that they test these cameras prior to giving to the consumer.  This latest replacement never worked.  Pictures are shadows.....camera was really tested?????I'm currently fighting with Panasonic in an attempt to get a camera that actually works. I'm trying to get a new one instead of a reconditioned one.  I have spent hours trying to resolve this issue. Panasonic's response to comsumer complaints is very poor and very SLOW.This will make the fourth camera in about five months. I've spent more time without a camera so I've lost many great picture oppurtunities.  This camera  has malfunctioned more than it functioned.  I wouldn't risk purchasing this camera if you're looking for reliability, good picture quality and dependibility.", "Date": "August 3, 2010"}, {"Title": "Really disappointed", "Author": "R. Calder", "ReviewID": "R1BDM8TU88IENN", "Overall": "1.0", "Content": "Panasonic DMC-ZS1 = FAILWithin a couple weeks dust had worked it's way inside the lens. Awesome blob at the top of each picture.Menu's look like they were designed in 1996Indoor photos do not come out well, very high level of noise.12x zoom is good, but very slowBattery is pretty good, but you cannot use non Panasonic brandsMy Canon A95 from 2004 takes much better photos.", "Date": "October 24, 2010"}, {"Title": "Wonderful Pocket Camera", "Author": "John A. Lefcourte", "ReviewID": "R2F0Q7D7XVRJD4", "Overall": "4.0", "Content": "I was looking for a Camera to replace my Minolta Dimage A-1 when it crapped out on me. I loved that camera. I could find nothing comparable and looking at specs this caught my eye. I thought that the smaller size would make it more accessible and I was right. I love all the features of this camera: lens, programs, wide angle and zoom but can only give it 4 stars because it lacks an optical viewfinder and is very difficult to use in the bright light of Nevada. My wife's Canons are much more usable because of their optical viewfinders.", "Date": "December 12, 2009"}, {"Title": "Camera Evolution", "Author": "Sojourner", "ReviewID": "R14PSIJD2V2FGX", "Overall": "5.0", "Content": "I have followed the development of digital cameras since they first became available.  Back in the day when Kodachrome was still King.  Its obituary was in the news the other day.  I saw the hand-writing on the wall waaay back then.  The day has come on  like gangbusters.  By comparison this little camera  is really amazing.  The quality of the photos it takes are top notch, due to the wonderful Leica lens married to superb Panasonic electronics. When you see what this small camera is capable of producing you have to know that the day is not far off when big cameras with all the separate lenses etc. will go the same way  the the previously mentioned Kodachrome has gone.Most highly recomended  It is a joy to use!!", "Date": "June 26, 2009"}, {"Title": "So Disappointing", "Author": "Artsycalgal", "ReviewID": "R34ATZOMY67VR1", "Overall": "1.0", "Content": "Panasonic generally has a great reputation and others had given this camera good reviews but even though it took good pictures, the lens mechanism stopped working in less than a year...wouldn't activate when the camera was turned on though you could hear that it was trying.  We got a factory rebuilt replacement from Panasonic and the same thing happened in about the same amount of time. The warrantee has expired so now we have a very expensive paper weight.  I really missed having a view finder in addition to the screen, too, especially in bright light situations.  It was hard to see what you were taking a picture of.", "Date": "November 19, 2011"}, {"Title": "Great price AMAZON only Best source, forget E BAY", "Author": "Gary J. Bipes \"write me\"", "ReviewID": "RZGBDDROE3FUW", "Overall": "5.0", "Content": "I have bought lots of camera's from Amazon. I get one and then find a better on with better features. I do  Aerial photo work. I think I have bought 4 in the last year. At the price Amazon sell for you can do that. I have a couple on my shelf. this last camera works great. I am happy with this one. Kodak is nice but very slow. I did the C net reviews. and my last camera is great who would think Panasonic would have a great camera . I did nikon. cannon. BUT this Lumix DMC-ZS1 is nice. smaler screen than I wanted but It works great. I am a pro so called . camera man in  Nam for the army . combat photo. aerial photo, no more weddings. I have fun with this camera . carry it with on a belt pack. more important than a cell phone. thanks  last words AMAZON", "Date": "April 3, 2010"}, {"Title": "Best Camera I Have Ever Owned!", "Author": "M RMZ", "ReviewID": "R1YO629W1JATF1", "Overall": "5.0", "Content": "It has been a while since we have upgraded digital cameras, our last being a Sony Cybershot 4.1 mega pixel.  We got new phones recently, which have a 5 mega pixel camera so it was pretty silly to be taking better pictures on our phone then camera.  After checking out the Canon SX120 and the Panasonic DMC-ZS1, we decided to go with the ZS1 because we liked the feel of it more.We were not disappointed!  This camera has been awesome so far, the 12x optical zoom makes for GREAT photos of stuff that is far away that we were never able to capture in such detail.  The camera is pretty easy to use, and we <3 it.  The pictures are so clear and crisp.Can't wait to take it to Mexico in March!!!", "Date": "February 14, 2010"}, {"Title": "Great All Around Camera.", "Author": "Pedrum Mahmoodi \"peedol\"", "ReviewID": "R3TPVTVADC4PME", "Overall": "4.0", "Content": "Standard point and click cameras do not provide the picture quality of this camera...in my opinion.  Only differene is that this point/click is a bit larger than the standard point/clicks...but worth the size when it comes to quickness and quality.  Appears that the smaller the camera, the slower as well.  I am happy with this camera.", "Date": "November 5, 2009"}, {"Title": "Great camera", "Author": "Julie", "ReviewID": "R1EPFEWWM46EJ6", "Overall": "5.0", "Content": "Have been using it for quite a while now and it does everything I want it to. Great pictures. Great options.", "Date": "December 8, 2013"}, {"Title": "Great camera when traveling light", "Author": "Eugene T. McNamara", "ReviewID": "R23N3I1LUQ7NM8", "Overall": "5.0", "Content": "I never before reviewed this camera, although I have had it for three years. I just noticed Amazon asking for a review. Sorry for the delay, but It is the best compact camera I have ever used for outdoor photography. I have owned just about every brand, but this has exception optics and a tremendous zoom. When I don't have my DSLR camera and gear with me, which is most of the time, this little powerhouse has provided me with great shots which can be easily enlarged to 16x20. That being said, there is a downside to the camera. It has a weak built-in flash and indoor shots show a lot of \"noise\" and can be very grainy. But for a handy camera to have when traveling light, this does the trick. It's probably discontinued by now and newer models have replaced it, but if it's still available and you can pick it up for a good price, it's worth the investment.", "Date": "November 16, 2013"}, {"Title": "Exc Camera", "Author": "Allen C. Windelspecht", "ReviewID": "RXRZT5WP9IX7D", "Overall": "5.0", "Content": "I have one of this model already and I ordered the same model as a backup and don't expect anything less than the outstanding operation of the original one", "Date": "November 12, 2013"}, {"Title": "good price with quality pictures", "Author": "Wei Long", "ReviewID": "R2BDUAVIT7CQVT", "Overall": "5.0", "Content": "i bought it 3 years ago...it take quality pictures, and OK for night scene.light and easy to carry around, worth for the price", "Date": "July 15, 2013"}, {"Title": "Product was defective on arrival.", "Author": "Ann K. Weitz", "ReviewID": "RWY8GG64HY4Q0", "Overall": "1.0", "Content": "Toggle for telephoto was so loose, almost falling off. Lens shutter would not open and shut properly.  Took a couple of pictures and they were so fuzzy, you couldn't tell what you were looking at.  I am an experienced camera user and although this was advertised as new, with the problems, it looked like either refurbished or maybe it was grey market... If it was new, then it was a true lemon.Only thing we were very impressed with, was Amazon customer service was very helpful in trying to put us in touch with the seller, kept in touch with us by email,  and when seller wouldn't respond to us, Amazon reimbursed us the cost plus shipping.. Amazon deserves a 5 star rating!!", "Date": "March 30, 2013"}, {"Title": "COOL", "Author": "engelly", "ReviewID": "R9GXDJD4WJDCZ", "Overall": "5.0", "Content": "NICE SERVICE, NICE ITEM, ALL GOOD AND RECOMENDABLE!!THEY SHIPPED BEFORE THE DEADLINE AS I ASK CUZ I WAS IN A RUSH.", "Date": "January 29, 2013"}, {"Title": "Excellent", "Author": "Eduardo Romero", "ReviewID": "R2UH9OP1FP80RC", "Overall": "5.0", "Content": "This product is of high quality for me. I love itI recommend this to everyone for their excellent design", "Date": "January 1, 2013"}, {"Title": "A very good compact camera with good video", "Author": "Gyorgy", "ReviewID": "R5Z8KQI2BZP10", "Overall": "5.0", "Content": "I think its picture quality is very good in its class, and the same applies for video recordings. It is a pity that it does not have HD video support. I also have a newer model (ZS5) from Panasonic, which has more pixels, HD video, more features, better LCD, but it is obvious that the picture quality of ZS1 is superior. Even if it is an old model, I am not sure that current models in this class make better pictures. (Of course you shall not compare its picture quality to high end compacts or a DSLR.)", "Date": "November 22, 2012"}, {"Title": "Perfect engagement gift!", "Author": "E. B. MULLIGAN \"Bronwyn\"", "ReviewID": "R1J4VHCFQEVCS", "Overall": "5.0", "Content": "EASY to use with gorgeous pictures.  Easy to take terrific spur-of-the-moment shots. Have used it for ten thousand pictures since 2008 have not found anything as easy, sturdy, dependable, versatile to use that also takes super photos.* 12x optical zoom is a wow how close it brings the image in* 10.1 megapixel DMC-ZS1* 2.7-inch LCD with 230k-pixel resolution, automatically increases brightness, by 40%, in low lighting* Slim body 7.2 OUNCES* LEICA DC VARIO-ELMAR  25mm ULTRA wide-angle lens* record at ISO 1250 with full resolution* Around 12.7 MB of built-in memory* three aspect ratios -- 4:3, 3:2 or 16:9* 16:9 motion images look perfect a wide-screen TV* Built in lens cover* fits-in-your-pocket* shutter interval is 0.5 second* Intelligent ISO reduces motion blur* Accepts large-capacity SDHC memory cards* Shutter release time lag is 0.006 second* Battery life 270 shots on a single charge (CIPA)* ideal for shooting group portraits in a small room* point and shoot no adjusting settings needed* dual image playback displays two images on the LCD* unlimited consecutive shooting 3 frames per second at full resolution* A wide variety of `scene modes' which I still have not tried in 3 years* O.I.S(Optical Image Stabilizer)  reduces blurring from shaky hands* Direct Print allows easy printouts via a USB cable to a Pictbridge-compatible printer* displays thumbnails of nine sequential frames from a motion image (to analyze golf swings, etc)* Venus Engine III image-processor raises the ISO setting and shutter speed based on movement and light* Movies recording standard VGA (640 x 480) and wide-aspect VGA (848 x 480) at 30 frames per second* Date Stamp the date a photo was taken, the day of the week, also stamp a baby's age in months on a photo", "Date": "July 16, 2012"}, {"Title": "stewart", "Author": "stewart", "ReviewID": "R1MPXCDLK7NVDD", "Overall": "5.0", "Content": "Excellant camera the zoom is spectacular and the steady shot gives very sharp images.The video with the zoom is very effective and still shots from distances are very clear. The colours are brillant. One great camera!!", "Date": "July 7, 2012"}, {"Title": "I fell in love with this camera, then it spurned me", "Author": "D. Jackson", "ReviewID": "RJ82MCTZGLRWO", "Overall": "3.0", "Content": "I learned to take pictures using film and an old 35mm. It was difficult to make up my mind on choosing a digital camera. I researched for years before being satisfied with what I heard about the Panasonic Lumix series. From the very first, I oh so loved this camera; it's small, and I could have it with me all the time without lugging a big machine for special occasions only. When new, it took great pictures, and videos, with terrific sound. Everything I'd heard about the camera was true and my expectations with the quality of the photos, and ease of use were exceeded.It worked well, for about a year beyond the assurance provided by the 1 year warranty. Then the camera stopped focusing while I was on holiday. In immediate need of a camera, with no time for the learning curve associated with a new piece of technology, I bought the closest Lumix (DMC-TZ8)I could find to the one I'd already fallen in love with. This updated version worked fine, though not quite as well as this DMC-ZS1. Then my second Lumix went berserk after about six months of use, so that when the camera is turned on the focus mechanism zooms in and out humming non stop for no apparent reason. Given my history with Lumix cameras I would recommend getting an extended warranty, if available. They're terrific while they last, and they do at least maintain their small size. But I wouldn't expect them to last like the old reflex cameras.", "Date": "March 23, 2012"}, {"Title": "Did everything I expected, still working - but do keep it protected in a case", "Author": "S. Saunders", "ReviewID": "R2I8QQ7HUIUXS1", "Overall": "5.0", "Content": "I bought this camera 2.5 years ago and have hauled it around town and on vacations. I'd owned, and really liked, a prior generation Lumix, the Panasonic Lumix DMC-TZ3K, and this camera - the ZS1 - was an upgrade in many respects.The main quibble I have with this camera concerns the automatic built-in lens shutter/cover that closes when the camera is turned off or used in \"replay\" mode, and opens when the camera's turned on or used in \"shooting\" mode. It's made of thin plastic and can be easily damaged. It's the same kind of shutter as on the TZ3 lens, and I learned the hard way to keep the camera protected in a case when not in use. I'd tossed the TZ3 into my purse without the case, and the shutter/cover on the TZ3 was damaged from contact with something in there. Fortunately I'd bought it at Costco and was within the 90 day return window so I was able to return the TZ3 and buy another one. Which I did keep in the protective case with no further problems.I've kept this camera in a case when not in use and the lens mechanism still works perfectly.I also own a DSLR which I can haul out for serious photo taking with all kinds of creative control, but I carry this camera a lot more than the much larger DSLR and have been satisfied with the photos I've taken with it. They won't compete with DSLR photos overall but they are almost always enough for my purposes. I confess that I've used the auto settings on this camera almost exclusively, with the main tweak to force the flash off. I'm sure that if I'd used more of the custom and scene settings available I could have achieved even better results.The wide lens on this camera is hard to beat. So often my preferred shots when traveling are of street scenes, landscapes, and room interiors. The 25mm lens has not disappointed me in this respect. I can also get the whole extended family into a group shot from a reasonable distance. I've enjoyed the 12x zoom too.I decided to post this review as a fond farewell to my ZS1, because yesterday I received its replacement - the Panasonic DMC-ZS9. The price for the ZS9 was so good I couldn't resist it, as it's an upgrade to the ZS1 in so many ways, including more manual controls, better resolution video, and a 16x optical zoom. (You can compare the two cameras at the website snapsort; however the ZS9 isn't in their database, but the ZS8 is so use that one for the comparison. The ZS9 and ZS8 are identical except that the ZS9 records video with stereo microphones instead of the ZS8's mono.)If I hadn't found the upgrade camera at such a good price, I'd not have replaced my ZS1. My rational thoughts are to sell the ZS1 for whatever price it will fetch, but my sentimental side will probably prevail and I'll keep it. Besides, it uses the same battery as the ZS9 so now I have an extra battery.I have no hesitation in recommending the ZS1 as a reliable, versatile and very easy to tote point and shoot digicam.", "Date": "December 24, 2011"}, {"Title": "Great camera", "Author": "Daron K", "ReviewID": "R2JP89FJHKFJBU", "Overall": "5.0", "Content": "Great camera!  I had one issued to me at work which worked very well.  So, I liked it so much that I bought one for my private use!  The wife loves it too.", "Date": "October 9, 2011"}, {"Title": "Sharp images", "Author": "J. Lin", "ReviewID": "R1HVVJXM5HNL0M", "Overall": "4.0", "Content": "This inexpensive point and shoot camera produces sharp image for outdoors photos. Indoors photos are not as good, but I believe it is partly due to my photographic skills.", "Date": "June 25, 2011"}, {"Title": "Very Nice Camera, But Get a DSLR If You Have the Budget", "Author": "D. Zerby \"gradms\"", "ReviewID": "R2DH2NZF28KZZ3", "Overall": "4.0", "Content": "Have owned this camera for over a year now. There are newer models of it out now that might be a better overall choice for a super zoom point and shoot. Is very easy to use and the zoom is substantial. However, for those seriously considering photography as a hobby or wanting to take picture taking to the next level, buy a DSLR with detachable lens. I wish now that I had invested the additional 200 or so dollars to do just that.", "Date": "June 13, 2011"}, {"Title": "Good camera if you learn to use it", "Author": "S. Zmek", "ReviewID": "R31AZXG6I7O1F9", "Overall": "4.0", "Content": "I needed something smaller than my huge Sony cybershot bought years ago. This Panasonic had really good reviews and was the size I desired (something that would easily fit in my purse). The only issue I've had so far (after a year of moderate picture taking) is that I can't get the shutter speed set just right. I either miss pictures because by the time the camera takes the photo, the shot is gone or if I set it to catch objects in motion, the photos end up blurred if the object moves. I've missed a lot of cute shots (of my new puppy) because I'd push the button to snap the shot, but by the time the camera took the picture the puppy wasn't even in the frame any more. For still-life, it's great.Overall a good camera, and maybe it's a great camera and I just don't know how to use it.", "Date": "April 23, 2011"}, {"Title": "Great camera", "Author": "Engineer", "ReviewID": "R3L5OZ5TIYS3HB", "Overall": "5.0", "Content": "Needed a camera that we could take on the fly without lugging around the Canon with all the accessories.  This camera was recommended by a photographer friend that carries this camera on the go. Nothing but good things to say.", "Date": "February 25, 2011"}, {"Title": "The person for whom I purchased this likes it very muchThe", "Author": "Terry G. Werntz \"terrygw\"", "ReviewID": "RRBF26CP6H8VP", "Overall": "5.0", "Content": "This was purchased as a gift and the person for whom it was purchased tells me it is perfect and every easy to use.", "Date": "January 13, 2011"}, {"Title": "Great camera", "Author": "Anthony Joseph \"Jojo\"", "ReviewID": "R39LY47TMWIY7E", "Overall": "4.0", "Content": "This camera works like a gem. It focuses quickly, has a long-lasting battery, several scene options, a good flash and easy downloading. Overall it helps the average Joe take great pictures!", "Date": "January 9, 2011"}, {"Title": "Retruned 1st one, 2nd one works great for my needs", "Author": "S. Sadler", "ReviewID": "R3RUFFQISBN3O7", "Overall": "4.0", "Content": "lens cover stuck on the first one, returned it, and am very happy with pic quality and features so far! great wide angle and zoom, excellent clarity though some bright scenes can get washed out, but I don't know the white balance feature very well. Great for my plant class with macro setting! Not super slim or super light, but if it was, it wouldn't be as good!Would definitely buy one again and recommend to friends!", "Date": "January 2, 2011"}, {"Title": "awesome camera", "Author": "Colleen Richert", "ReviewID": "R37692MYIEE0M8", "Overall": "5.0", "Content": "for those who want a point and shoot camera with ease of use, this is the one. love it, zoom is great and usually in a low light room pictures are not good but with using no flash they are great, even tried some with flash and they were good also, love the camera", "Date": "December 31, 2010"}, {"Title": "Great camera for the price !", "Author": "kmthome", "ReviewID": "R26K1WXOQRVSEA", "Overall": "5.0", "Content": "I have this camera and purchased a second one for my daughter for Christmas. It is easy to use and delivers excellent pictures. Great camera for the price.", "Date": "December 28, 2010"}, {"Title": "Great Camera!", "Author": "Angela Tilley", "ReviewID": "R92LNZ13PHBR0", "Overall": "5.0", "Content": "We have owned many point-and-click cameras.  We like the portability, but have been disappointed in picture quality in no-flash situations.  We have owned Olympus and Canon, but have never been happy with the zoom feature since digital zoom has such terrible quality.  I read about A LOT of cameras before deciding this time.  We were considering an SLR, but the price and size just didn't fit what we wanted in a camera.  This camera sold me on the 12x optical zoom, the great reviews, the Panasonic name (we own two Panasonic Plasma tvs, a DVD camcorder, DVD players, and now a blu-ray player ... all Panasonic).  Let's just say that when it comes to electronics, we tend to buy Panasonic because the quality has always been great, the price is always reasonable for what you get, and we just don't have issues with their products.  I saw this camera, and while it was a bit bigger than our Canon Elph, we decided to give it a try.  Plus, the price was fantastic for what we were getting.  We have been so happy with this camera.  I love the pre-sets that you can use for low-light and no flash pictures.  It has more features than I will probably ever use, but is very straight-forward and easy to use.  We took it out of the box, charged the battery and were able to navigate very quickly because of the user-friendly menus and navigation.  I can't say enough about it and recommend it to anyone who is looking for a point-and-click with better features than your typical camera.", "Date": "December 4, 2010"}, {"Title": "Good, but could have gotten just as good for less money", "Author": "Valerie", "ReviewID": "R2C3VPJAUDYDPE", "Overall": "3.0", "Content": "I was really excited about this camera. I read so many reviews for days. But now, I'm mostly disappointed.Pros:Good amount of pixels for no grainy images.Good amount of zoom for a small camera.Easy to use controls.Easy to transfer pictures to computer.Large display on back to view picture.Seems durable/quality material.Doesn't use store-bought batteries.Cons:Can not see display when in sunlight, which makes it impossible to know what you're taking a picture of in the daytime.Hard to find a small camera bag to fit it properly.Not pleased with picture quality. It does not seem to capture the full color of what it's viewing. It doesn't compensate well in too much light or not enough light. I've tried all the settings/scenes and auto, but it just doesn't capture color or shades/light well.Long shutter lag, cannot take multiple pictures in a row.If you take it on a trip, you'll need to recharge every day.", "Date": "November 8, 2010"}, {"Title": "Great new Camera", "Author": "marie", "ReviewID": "R2XVBO3SKZ5ZYJ", "Overall": "4.0", "Content": "A friend had this camera and had taken great pictures on her last trip to Africa.The quality and sharpness of each picture was superb.I bought with the same expectations and have not been disappointed.", "Date": "November 4, 2010"}, {"Title": "The best there is out there", "Author": "Roland Kyburz \"kibbits1\"", "ReviewID": "RRI370VAZ80K9", "Overall": "5.0", "Content": "This camera i purchased as a gift for my daughter. I have used the older versin for the last 2 years and i would not switch. The lens, the picture the use is absolutely the best.", "Date": "October 31, 2010"}, {"Title": "Great Image quality!", "Author": "FrancescoG", "ReviewID": "R2J4NXAKGWFST5", "Overall": "5.0", "Content": "I have had several compact digital cameras in the past decade.This one has the best image quality and the best lensI have experienced so far, while beingthe cheapest that I bought.", "Date": "October 16, 2010"}, {"Title": "Probably the best camera for its money", "Author": "Dmitry", "ReviewID": "R2RJT330HXXNTJ", "Overall": "4.0", "Content": "The ZS1 offers very good image quality both at base ISO and at higher sensitivities. It shows very good detail all along the 12x zoom range and while at higher ISOs things naturally get worse the Panasonic does, for its price, a fairly decent job. This camera probably is not the best in particular areas, it just works very well all around. The full-metal body is nice to look at and to hold in hand. The user interface is intuitive, even for me who are new to the brand. The lens are fast and covers an incredibly versatile zoom range of 25(!)-300mm equivalent.It worth its money for sure. The only disappointment (but not for me) is an absence of HD video.", "Date": "October 6, 2010"}, {"Title": "Great pictures!!!", "Author": "Vicki McElmeel", "ReviewID": "R20EENFJWVBCEN", "Overall": "5.0", "Content": "I bought this camera for my daughter's birthday. She loves it. The zooom is wonderful and the pictures are awesome. It has alot of cool features. Great camera!!!", "Date": "July 7, 2010"}, {"Title": "love this camera", "Author": "R. Murphy", "ReviewID": "R1OVC5TYCUYNIO", "Overall": "4.0", "Content": "The camera is very easy to use. The Intellegent Auto feature is awesome. Need a steady hand with the zoom. It is a little bit thicker than other cameras put still small enough to shove in coat pocket or purse.", "Date": "June 27, 2010"}, {"Title": "a great portable camera", "Author": "Frequent traveler", "ReviewID": "R1L46PVWEHFDP0", "Overall": "5.0", "Content": "The Panasonic DMC-ZS1 is ready to go out of the box, and delivers great pictures from the Leica lens. Friends were amazed at the quality of the pics from the 12X zoom.  It is light weight,and the battery holds a charge all day even with lots of shooting. The only draw back is the viewing screen is hard to see in bright light conditions. This may not be an issue with the more expensive ZS3 model which has a larger, brighter screen according to the specs. I purchased an 8 GB class 6 card and it is fast and holds many pics and videos. This camera is ideal for travel and casual use of all types and is a real value. The airplane mode was nice for aerial shots taken through an airplane window with no reflections.", "Date": "June 13, 2010"}, {"Title": "The best camera for me", "Author": "D. Zonsheine", "ReviewID": "RQQCXFYY2MWYW", "Overall": "5.0", "Content": "Great optics. [...] top choice for 2008. Great for me as a  [...] winner for a couple of years ago is exactly what I need. I need a very good optics but not the latest product.", "Date": "June 8, 2010"}, {"Title": "simply put ,the best got better.", "Author": "Leornard Sclafani \"dinothecarpenter\"", "ReviewID": "R37EYF8O94WO8Y", "Overall": "5.0", "Content": "About 3 and a half years ago ,i wanted a good camera to take on vacation with us,as i love to take pictures.I went to a company that had a lot of cameras to look at,(best buy) and was looking at the nikons ,then their lenses,it added up to quite a bit of money,and was heavy,the store manager suggested the Panosonic Lumix dmc-tz3,I was quite supprised it had all the lenses built into it,so i bought it, and was very happy i did,its been to quite a few countries now and was working fine, even though i had dropped it two or three times,and bent the lens closeing system,which i straightened out myself,with a knife a year ago, its still working great ,but i thought id look to see if theres any new Lumixs with a higher lens zoom  setting ,my old one is a lumix 10x optical zoom,i went to Amazon,, and seen this new Lumix camera(dmc-zs1) with a 12x optical zoom,i bought it for almost $300.00 less the the first one. When i opened the box it came in,,, the first thing i noticed was its thinner ,WOW!!Me and my wife Pam,, went to this beach we always go to and sat on the shore and i took a shot of what i could hardly see,, a huge ship about 3 miles out,it was about 1/8 inch long,,i zoomed in on it ,now i could see it quite clearly, about 1 inch long,, and seen it was someones huge private boat,,i took the shot ,and when i looked at it on the camera screen, i zoomed in on what i had zoomed in on,,, and low and behold ,i could read the name on it,WOW.And its thinner...Thanks Panosonic ,and especially  thanks to Amazon for making it cheaper.....Leonard and Pam Sclafani in sunny Miami....", "Date": "May 6, 2010"}, {"Title": "great camera", "Author": "P. MacDiarmid", "ReviewID": "RTQGQNKUVN9BY", "Overall": "5.0", "Content": "We purchased this camera recently and couldn't have been happier.  I have previously only owned Olympus digital cameras and have enjoyed them but they had become quite dated.  I bought this camera for the zoom lens.  The shutter speed is outstanding and it takes very good pictures.  I would highly recommend it to anyone looking for a resonably priced digital camera.", "Date": "April 7, 2010"}, {"Title": "If you want optical mag, this is the camera", "Author": "Ridgeman \"Ridgeman\"", "ReviewID": "RDO08PO2UI8ZF", "Overall": "4.0", "Content": "For a camera in this size range, it's got great optical magnification. Controls get easy for the touch buttons and it has a very (too) comprrehensive optical menu. Nice size vie3wing window but I would also have liked a viewfinder. Overall, a pretty good camera. Not sure whether I'll ever use the video and sound capabilities, but it's there if I so desire.", "Date": "March 20, 2010"}, {"Title": "GREAT CAMERA!", "Author": "WILLIAM JOHN RIGNEY Jr. \"MIDWAY41\"", "ReviewID": "RE18V7SXALESL", "Overall": "5.0", "Content": "this is not the first one of these i have had. they make a very good unit that agrees well with what i do with a camera.", "Date": "February 8, 2010"}, {"Title": "I would advice every body to get this camra", "Author": "M. Altamimi \"Altamimi\"", "ReviewID": "R2Y1MGJQLE3I6U", "Overall": "5.0", "Content": "really not lik other cameras. It has nicest picture than others, also fantastic zoom exactly in the near objects or even very far objects. Other cameras have 3 to 4 optical zoom, but this has 12 optical zoom with no chang in the resolution.", "Date": "February 3, 2010"}, {"Title": "Good camera with overly complex features", "Author": "Dave S.", "ReviewID": "R36CY0MCDCXBER", "Overall": "3.0", "Content": "This is a nice camera for the price. It takes okay photos, better than other similar cameras I've seen. My only problem with it is its complexity. It is not an easy camera to learn to use properly. Some of the instruction booklet is difficult for an older, technically chalenged person to understand, yet there are issues that I've had with the camera that seem simple but are not addressed in the book. Also, because of the delay in the shutter, this is not a good camera for action photos or catching a momentary occurance. That said, it's better than what other similar cameras seem.", "Date": "February 3, 2010"}, {"Title": "Panosonic Lumix camera DMC - ZS1 10 MP 12X optical", "Author": "MJ Kirkland, WA USA \"toothcoach\"", "ReviewID": "R101M5IVGMFM63", "Overall": "5.0", "Content": "I love this camera!  It is the third such camera I've had.  One was ruined by a rogue wave submerging me at the ocean.  The second I just wore out after several years.  The pictures are always professional quality.  I always get better results than I think.  I believe it's the Leica glass lens; one of the best in the industry.  great value for the money.  I will continue to purchase these.", "Date": "January 31, 2010"}, {"Title": "Very versatile camera", "Author": "Michael Lee Leimon \"mike\"", "ReviewID": "R3DDSD6FIPY66G", "Overall": "5.0", "Content": "If you are an amateur at taking pictures yet want to document the people around you and the places you travel, this camera is a perfect option. While admittedly, most things are controlled in an automated fashion, there is still a bit of skill required in taking great pictures. The image stabilization works very well, however if you shake the camera too much you can still end up with blurry images. Anyhow, I would say that 9/10 pictures I take with this camera are great. The amount of zoom that this small camera provides is awesome, it gives you the flexibility to either use it as a simple point and shoot for events and parties or you can take pictures of landscapes and or distant objects. In any case, the colors produced are always brilliant. While the camera isn't the smallest out there, it packs some of the most useful features into its compact body. I would highly recommend this camera to everyone, except people who have a desire to set lots of values manually, i.e. (shutter speeds, white balances... etc).", "Date": "January 22, 2010"}, {"Title": "Great Camera", "Author": "A. Jackson", "ReviewID": "R1L38KG221K5A4", "Overall": "4.0", "Content": "Fast Shipping, and although I have hardly begun to look at all the features I like the IA autofocus as the photos I've already taken are good. The only thing I noticed is that there's a second or two delay before a photo is taken and that can be a problem if you want to capture an image instantly.", "Date": "January 21, 2010"}, {"Title": "Great affordable camera", "Author": "Zookie \"duyn\"", "ReviewID": "R2ENHVUYHK75BW", "Overall": "5.0", "Content": "This is great affordable camera. It has a very powerful optical zoom and great image stabilization. The picture comes out perfect even if you shake it while taking the picture. Also took a picture in low light without the flash. The picture comes out very clear. I've had problems with other cameras doing this (The pictures usually come out very blurry if you don't use the flash in low light).It is a little bit larger than most cameras, but is completely worth it because you get a better picture quality and zoom.You also get a nice quick shot. There is no delay after you press the button. (Those of you that have experience Sony cameras know what I am talking about.) It is very easy and straightforward to use. I highly recommend this camera.", "Date": "January 11, 2010"}, {"Title": "High burst speed makes this a winner for me", "Author": "Lenny", "ReviewID": "R1H5VKF5NC3KS5", "Overall": "5.0", "Content": "This is my third digital camera. I've gone Sony Elph before, but chose this based on positive reviews here and the extra zoom (x12 optical really is a big deal).Plenty of reviews have focused on picture quality, and I'm happy to say I'm pleased with it. My previous Elph was a 7MP model with x3 optical zoom. This beats it hands down (though that model was approx 3 years old when I replaced it - due to screen failure).The burst speed is impressive with a SanDisc Ultra II 1GB SD card. It is noticeably slower with a slower SD card. I would estimate that the burst speed is between 2 - 3 per second. I've uploaded some photos taken with full x12 optical zoom, hand held (no tripod) on burst mode.The camera is too big to fit in a pair of trousers pocket, so wearing it on your belt or carrying in cargo pants pockets is the only real option unless you're prepared to carry a bag. Is it worth it? For a night out, maybe not, but for something you really want to take pictures of - this camera is a winner.", "Date": "December 14, 2009"}, {"Title": "Love this Camera", "Author": "Seppy \"AzJuice\"", "ReviewID": "R3CK13G2GBKI5K", "Overall": "5.0", "Content": "Bought this for my girlfriend.  It was really easy to use and the menus are easy to navigate. She is not very tech savvy. Its small enough that she can bring it where ever she goes to catch that embarassing moment that you hope no one saw. Setting up the software on her computer was not difficult either. The Software to download the picture files was easy and clearly laid out. Hope this helps you. Enjoy!", "Date": "December 9, 2009"}, {"Title": "RMD", "Author": "Rose in New Hope", "ReviewID": "R3DN0565D1872P", "Overall": "5.0", "Content": "I have been waiting to buy a digital camera.  I checked out all the reviews on Amazon and everyone gave it great reviews.  I'm glad to say I agree.  It has a lot of functions that I have yet to use.", "Date": "December 9, 2009"}, {"Title": "Great family camera", "Author": "Hoppie", "ReviewID": "R1NDAV0CX6LGX3", "Overall": "5.0", "Content": "We had tried 3 other camera's in a cheaper price range but all had broken within a month. This camera is definately worth the extra money. We've had very clear photos and the zoom is great.", "Date": "December 3, 2009"}, {"Title": "great camera", "Author": "Jennifer E. Nash \"Mamma who loves books\"", "ReviewID": "R26CY2ZGG5CUW", "Overall": "5.0", "Content": "Super camera, takes great pictures and has lots of wonderful options. Sturdy enough that you won't drop it either and the lens zooming options are terrific.", "Date": "November 30, 2009"}, {"Title": "I've purchased four of these!", "Author": "J. Lowe", "ReviewID": "R393COGM51SX9Y", "Overall": "5.0", "Content": "Great camera. So great I bought one for each of my three kids and myself!One of our kids took it to Alaska with him and took some great pics.  Perfect for travel and a very nice camera for the money.", "Date": "November 30, 2009"}, {"Title": "Couldn't be happier : )", "Author": "Kelly Lynn", "ReviewID": "R2P0ZIOFAKEG1F", "Overall": "5.0", "Content": "We bought this camera for a recent trip to Europe.  We had considered buying an SLR, but opted for the less expensive point and click option.  While this camera is no substitute for what an SLR can do, we were amazed with what this little camera could do.  It took very consistently clear photos.  We are so pleased with this purchase!", "Date": "August 16, 2009"}, {"Title": "The crappiest camera I have ever purchased", "Author": "Red Dog", "ReviewID": "R7COF6B3A4W9B", "Overall": "1.0", "Content": "What more can I say, either I got one of the rejects or this is just the crappiest camera I've ever made the mistake of buying. Shortly after buying it I put it to work. I'm a home inspector and pictures are a big part of reporting my findings, particularly for the items that I can't physically show to my clients, namely crawlspaces, attics etc. After the first inspection I was puzzled by the bluriness of all the images I took in the crawlspaces. I came to find out the camera won't focus in darkness without lighting the scene with my flashlight (which washes out the details). Anyway, I gave it a shot again yesterday and the whole focusing mechanism crapped out, nada, nothing. It's going back to the manufacturer in pieces. I'm done with this thing and Panasonic.", "Date": "October 2, 2010"}, {"Title": "Not Very Supportive With Cameras", "Author": "Big Al", "ReviewID": "R1UA1WUUG6RU0T", "Overall": "1.0", "Content": "I purchased a Panasonic DMC-ZS1 for my wife for Christmas and we were happy with what we decided after doing some research. The purchase actually came through Costco, but I thought I'd make my point here as well since I shop frequently on Amazon.com. 14 months later the camera starts having issues with the focus. It corrected itself for a month, but went back to the same error. Costco states that you can return electronics within 90-days so I get that. Once I went to the manufacturer for the out of warrantly product, they could only suggest a new one, which is only 5 dollars cheaper than what I bought new. Having never dropped or misused it in anyway, $100 in my opinion is acceptable to repair or trade out for a refurbished one. My point is, most large companies like Panasonic make a much better effort to satisfy their customers. There may be an underlining factor though which gives me a sympathetic heart. It's made in Japan, who unfortunately just underwent that horrible earthquake and tsunami. My God bless them, and their country.", "Date": "April 12, 2011"}, {"Title": "Photo quality", "Author": "AL-Musafer", "ReviewID": "R2VEQX6EIZQ2A9", "Overall": "4.0", "Content": "Photo qualityMost important is picture quality not higher mega pixel?I wish that panasonic reduce the mega pixel on this camera or use a bigger sensorZS1Effective pixels = 10.1 MPTotal Pixels  = 10.3 MPSensor Size  = 1/2.5Pixel Density  = 41 MP/cmNice Camera good quality and sharp lensSmall sensor 1/2.5 compared to number of mega pixel it hasThis Camera should not go more than 6 Mega Pixel or use a bigger sensor 1/2.3It will be a challenge Camera  If Panasonic do it", "Date": "January 17, 2010"}, {"Title": "I love it.", "Author": "Jeneanne Austin", "ReviewID": "R3TKJR7QJ5LMQC", "Overall": "5.0", "Content": "I haven't even read the manuel yet.  I've taken some outdoor pictures and pictures of a concert in a jam packed club and they came out great.  Even the video I took at the concert came out way better than I expected, with people bumping into me it was impossible to hold the camera steady, and I was surprised that the sound was not distorted like you see in a lot of concert videos.  I love the small size, I carry it in a small compartment in my purse every where I go. I recomend buying a second battery for backup if you want to take videos.", "Date": "January 7, 2010"}, {"Title": "Great Camera", "Author": "Martharoo", "ReviewID": "R13Y94W53D9FVT", "Overall": "5.0", "Content": "A good basic camera that requires little brainpower. Just takes good pictures easily. What more do you want?", "Date": "October 26, 2009"}, {"Title": "Great quality, portability, worth paying for", "Author": "Jurerat Kongkiattiwong \"JK\"", "ReviewID": "R28028X3OKKI58", "Overall": "4.0", "Content": "Lumex has a good len as everyone already knows. Good combination in terms of functionality, price and quality", "Date": "October 22, 2009"}, {"Title": "Loving it!", "Author": "Neroos", "ReviewID": "RZQ6Y3L4IGOM1", "Overall": "5.0", "Content": "When my 5 year old Casio Z4U finally died I went on a camera search. Bought an Olympus stylus 9000 as the specs sounded great. Unfortunately, it was returned as the auto focus in auto mode produced many blurry photos. I was really waiting for the Casio EX-H10 but it was not available in time for my trip.My next purchase was the Panasonic DMC-ZS1 and I am totally pleased with its performance. My biggest surprise was the 12x optical zoom. I figured a 12x zoom would need a tripod mount but this was not so. Hand held at 12x zoom took beautifully focused pictures. I just returned from a trip to the United Kingdom and took close to 300 photos. It even did great from a moving vehicle. All shots were taken in the iAuto mode and the camera did great.The only negative thing is (same as any other point-and-shoot camera) it does not do well in low light unless you are very close to the subject. My mistake was to zoom in on a subject in the low light and of course that made things worse.There is another quirky thing that I noticed after viewing the photos on a computer. I don't know whether it is the wide angle lens or the zoom that causes a vertical perspective distortion, I think that's what it's called. The problem is on the photos I have of tall buildings. The structure in the center would be vertical but the buildings on the sides tilt inwards at the top of the frame. Anyone know what causes that?For someone that does not want to fool around with manual modes, this is the perfect camera as it takes beautiful shots in iAuto mode.", "Date": "September 4, 2009"}, {"Title": "Excellent!!!", "Author": "Sara Bailey", "ReviewID": "RUFGSDBHVH7LB", "Overall": "5.0", "Content": "I bought this camera for my finance and he loves it! I believe this is the most compact camera you can get with this optical zoom. Perfect for concerts when your in the nose bleed section. Great camera - I'm so glad I picked this one!!", "Date": "September 3, 2009"}, {"Title": "Great camera", "Author": "Anita M. Sulzer", "ReviewID": "RRUWO2YZUO6SN", "Overall": "5.0", "Content": "I spent many hours looking for the perfect camera for my needs.  This one suits all aspects.  It takes great pictures and is quite affordable.  Everything I was looking for.", "Date": "August 9, 2009"}, {"Title": "Excelente Camara", "Author": "Orlando Luis Coronado \"olch\"", "ReviewID": "RVEWLDQP6QFAE", "Overall": "5.0", "Content": "La cámara Lumix DMC-ZS1 es excelente, superó todas mis expectativas. La fotos son totalmente nítidas y el colorido maravilloso. El zoom es muy bueno y el video de muy buena calidad. Lo recomiendo 100%.", "Date": "September 13, 2009"}, {"Title": "A good replacement", "Author": "Joe H", "ReviewID": "R2IRPHKU7FHL08", "Overall": "5.0", "Content": "I purchased this refurbished camera after my first Panasonic Lumix DMC-ZS1 slipped through my fingers one day and landed on a concrete sidewalk. Pocket cameras are good as they are meant to fit in your pocket, but not so good when you have big hands and the camera is small. When it was working properly, my first Panasonic took thousands of pictures and I received many a compliment. Since this an exact replacement, I was able to transfer over my memory card and battery back and the camera was ready to go.I was tempted to by a newer pocket camera, but reviews by others indicate that manufacturers are using cheaper and/or thinner materials in their construction. And the repair services for these cameras are horrible. Which means if a new camera is accidentally dropped, it becomes an expensive paperweight!", "Date": "May 22, 2013"}, {"Title": "Lumix DMC-ZS1 one of the best point and shoot cameras", "Author": "silverbearbill", "ReviewID": "R35ZVPQR1SM41X", "Overall": "5.0", "Content": "The quality picture you get by just aiming and pushing the button in any situation can't be beat.And a note about Amazon.  They have the internet business down pat:  Order with a click or two, its sent out very fast and it's in your hands within a few days and in top condition. Thumbs up for Amazon and the Panasonic Lumix DMC-ZS1 10MP Digital Camera. (I liked it so much that I gave it to a friend and went up a step and bought the Panasonic Lumix DMC-ZS7 12MP Digital Camera.)", "Date": "July 29, 2010"}, {"Title": "Great camera...but fragile construction", "Author": "Chris Williams", "ReviewID": "R21276IC1BJDOG", "Overall": "3.0", "Content": "First, I have to say I love this camera. I didn't purchase it for its camera function however, I purchased it to be able to have a portable HD video solution with superior optics (as compared to the \"digital\" only zooms of many of the other single purpose HD handhelds), one that I could easily have with me and whip out to record whenever and wherever an opportunity presented itself.And that that end, for a non-enthusiast like me, it works very well: 720P, stereo mic, wide angle lens, great optical zoom (which can be used while filming) and optical stabilization coupled with short turn-on time and flash memory is a real winner for me.Or it was anyway: about three weeks into ownership, I went to grab to use it and when I turned it on, I saw that the LCD screen had cracked rendering it unreadable. The unit suffered no drop or bump whatsoever, and was inside so cold wasn't a factor. In fact, just to stave off this from happenning, I had purchased and installed an optical glass screen protector which was placed on the unit when I unpacked it. Sigh.Of course, there's no way to prove a negative of course (save the camera itself which has no visible damage that would indicate it suffered any kind of impact); I've been so bitter that I've left it alone since this happened (over a month ago now), bitter because I'm sure this is \"my fault\" warranty-wise.", "Date": "February 26, 2010"}, {"Title": "Great little camera", "Author": "gfa", "ReviewID": "R2K2GZRXAROEC0", "Overall": "4.0", "Content": "This is our second Panasonic digital camera and we really like it.  Small enough to easily keep in in a purse, yet large enough to handle well.  We like its black and silver color and the pictures have been great.  I especially like the grid layout option on the viewing screen -- it really helps to line up objects in a picture just as you want them.  Also, the 12x optical zoom is a real plus -- it is a BIG difference from most digital cameras in the same price range.  I scored a \"3\" on battery life, only because I don't know what the battery life is going to be; haven't had the camera that long.  I think the only disappointing thing so far IS the battery -- our previous camera took (2) AA's, which were always on hand and easy and convenient to change.  This camera takes a special rechargeable battery (I don't like rechargeables) and will no doubt cost a lot more to replace.  Nevertheless, we are quite happy and pleased with this camera.", "Date": "February 19, 2010"}, {"Title": "Serious pocket camera", "Author": "Tim \"Tim retired and skiing\"", "ReviewID": "R1AAPDFM21DRKX", "Overall": "5.0", "Content": "I have owned many pocket cameras over the last 15 years. When I have serious photographic projects I use a single lens reflex digital camera made by Nikon.For casual use I have tried at least four small pocket cameras but none of them would satisfy. The Panasonic Lumix DMC - CS1 offers features of more expensive SLRs but without the bulk.  Even the annoying delay between pressing the shutter key and taking the picture has been minimized in this camera. Don't get me wrong it can't shoot as quickly as a good SLR but for a serious camera that fits in your pocket is unbeatable.", "Date": "January 8, 2010"}, {"Title": "Love it", "Author": "Kathleen Setting \"kat\"", "ReviewID": "R8Q33TV9U6I1", "Overall": "5.0", "Content": "So far so good.  exactly as described.  zoom is incredible and pictures are perfect. easy to use and understand.  my daughter loves it. [she's 15]", "Date": "December 30, 2009"}, {"Title": "WONDERFUL camera!!", "Author": "Amy Whinston \"Amy in Alaska\"", "ReviewID": "ROC954BOBHDOT", "Overall": "5.0", "Content": "My first critereon for a camera is that it should fit comfortable in my bag.  Fortunately a lot of digital cameras are about the same size and fit well.  After that, I like cameras with a good optical zoom.  (Ignore digital zoom, it's crap.)  Most pocker sized cameras have 3x to 5x optical zoom, and if you want anything more than that, you have to go to a bigger heavier camera.  This is the one exception.  It is pocket sized and has a 12x zoom.  (The zoom begins at what used to be 24 mm on SLRs.)  I carry it everywhere.  It has all the usual features most people want, is very easy to use, and I love it.", "Date": "September 17, 2009"}, {"Title": "great product", "Author": "Ryan T. Carey", "ReviewID": "R2B6PYDJC85HN1", "Overall": "5.0", "Content": "haven't used it that much yet but like it so far.  The software it comes with is great also (panarama maker).", "Date": "September 4, 2009"}, {"Title": "Good camera", "Author": "Eugene L.", "ReviewID": "R3AUKBS5PQF0AK", "Overall": "4.0", "Content": "Good camera, no contra... yet. Fixing on iA position (or another) will make you need to check this position every time after switch-on touching, because their close location. BTW, Panasonic (in this class) is # 1 in Japan. The camera being manufactured in Japan has a better (in average) quality.", "Date": "September 8, 2009"}, {"Title": "Not quite what it should be ...", "Author": "Doc \"genee65\"", "ReviewID": "RIRV6170A3Z3Z", "Overall": "3.0", "Content": "I purchased this camera for my wife. Her hands shake a little but I thought the Image Stabilization would win this battle for her. Most of her pictures with this camera are blurred. When she uses my Canon cameras her pictures are sharp as a bell. Obvious difference in the designs.The flash pictures are warmer than natural and when the flash is used in macro (in auto mode) you never know how the lighting is going to come out. It is often like the old focal plane shutters where the curtain moved across the film plane. Good light one side ..nothing on the other.For regular outdoor vacation shots this camera is a dream. The extreme wide angle and 12X zoom are phenominal.", "Date": "July 29, 2009"}, {"Title": "I get annoyed with this camera quite often", "Author": "J. Lutz", "ReviewID": "RU5VNK83Z85TK", "Overall": "2.0", "Content": "Previously owned two Canon's because they had flip-out screens, but we had lots of problems with red-eye. We decided to expand our horizons and try a Panasonic based on the reviews and specs.  Pictures are just okay with no zoom, but it seems that any amount of optical zoom causes awful graininess which is even evident when the pics are sent out for 4x6 prints.  Video is also grainy and the sound records at about half volume--could not find any adjustment for this, so we have to artificially increase the volume in editing software.  I have a really hard time picking which \"scene\" is correct for a good picture, and often lose the opportunity for a shot because I am changing scenes.  Note that I would use the iA mode but this disables some basic options.  Also I can never remember which options are in the quick menu, and which are in the menu menu.  Very aggravating.  For our next camera I think we will go back to a Canon, and just hope their red-eye reduction technology has improved.", "Date": "October 13, 2010"}, {"Title": "New Lumix Camera Carries on Tradition", "Author": "D. W. Bondurant", "ReviewID": "R3LDMPZVQ8CDI2", "Overall": "5.0", "Content": "This is my second Lumix camera from Amazon.  The original DMC-TZ3 had the 10x zoom in compact package, 28 mm wide angle, panoramic pictures, and DVD quality video.  My new DMC-ZS1 goes a step further with 12x zoom and 25 mm wide angle.  Otherwise its the same camera but at a new lower price point.  The controls have been simplified for easier use.Great product, great delivery.", "Date": "February 10, 2010"}, {"Title": "An excellent camera", "Author": "Anurag Singh", "ReviewID": "R3UHYSKD2XP3YY", "Overall": "5.0", "Content": "The camera offers excellent image quality. The 12x zoom was an especially big plus. For it's price it's probably one of the most feature-rich cameras around.", "Date": "January 30, 2010"}, {"Title": "Excellent camera, careful with downloading to computer", "Author": "Mario Fortune \"Fortune Teller\"", "ReviewID": "R376LNW11MSPUE", "Overall": "5.0", "Content": "I bought this camera a couple months ago. I love it. Excellent photos, excellent movies, good and sensitive sound is picked up during movies. This is the best camera I have owned and I have owned quite a few over the years. Fits nicely in my pocket. Be careful when downloading to your computer, though. I lost all my photos and movies during download because I tried to cancel the process after it started. I had over 400 photos/movies on the camera, but I only wanted to transfer two of them to the computer. I hooked up to the computer, opened the folder from the camera, selected the two photos and clicked copy and then paste to the desktop. The computer started to download all 400 items so when I realized this I pressed cancel. Then I realized only a few were transferred to the desktop but the camera had no pictures in it at all. All the rest were lost, not on desktop and not in camera. So my advice is, when downloading to the computer do not interrupt the process or you may lose everything.", "Date": "September 12, 2009"}, {"Title": "unreliable", "Author": "cowboy \"wskay\"", "ReviewID": "R3KQ3TVFAFKZ34", "Overall": "1.0", "Content": "capable pictures though flash is useless past 5 ft.  Video mode returns oversharpened drab images.  Video mode failed after 1 year.", "Date": "May 20, 2011"}, {"Title": "Very good for travel, and general use", "Author": "Sail Away", "ReviewID": "R25QLPZRUPNMPX", "Overall": "4.0", "Content": "The ZS1 is a fine camera.  I find the ZS1 to be a great camera for traveling for several reasons:1) It is highly portable2) It takes good images3) It has good video (good still shots and respectable video combined in such a small size is a wonderful thing when you don't want to lug around a lot of gear.)4) The wide angle lens is fun and usefulOn the downside, the images are not \"spectacular\".  The images are very good, just not great!  So, if you want the eye-popping color and contrast offered by many SLR cameras/lenses, the ZS1 is not going to be able do that.  However, compared to a few other point & shoots I have used, the ZS1's images are very good.Also, as with most point & shoots, even the ZS1 cannot compare to the speed of picture-taking offered by an SLR.  So, if you are taking a lot of pictures of children, sports, etc., point & shoots as a class sometimes miss the shot.  The ZS1 is no different.  I miss a lot of shots with the ZS1, because children do not like to sit still very long.Video loses quality quickly in low-light, as is often the case, even with dedicated video cameras.On balance, though, the ZS1 is a very good camera.  If you want portability, very good images and video, and do not care too much about being able to snap images rapidly, then the ZS1 is an excellent choice.  It is also a SUPERB choice for traveling when you do not want to carry a lot of gear - I took mine to France for 10 days.  The ability to do still shots and video with one compact camera was AMAZINGLY pleasant.All in all, I recommend the ZS1.", "Date": "November 9, 2009"}, {"Title": "The PERFECT Camera.....", "Author": "M. Sneider", "ReviewID": "R3PJ830YYMVSTP", "Overall": "5.0", "Content": "PERFECT!When my old camera died...I searched for a new one that had a large zoom lens...great reviews...but I absolutely did not want one where I could override F stops etc...I narrowed my choice to this one...the ZS-1...the ZS-3...which I passed on because I did not care about enhanced movie taking...and the only other for consideration...the Canon SX200 I believe it is called.The Canon had too much in the overiding category...I would have been paying for something I never needed before.Also...the Panasonic has a Leica lens...I would have considered a Sony...which has a Zeiss lens...maybe Leica is better...but not one Sony point and shoot had a large zoom.The more and more I play with this...the more special it seems. I'm thrilled so far.", "Date": "September 5, 2009"}, {"Title": "Amazing", "Author": "Janelle Bauer \"Nellie B\"", "ReviewID": "R5EPLG7BN88DA", "Overall": "5.0", "Content": "This camera has been amazing so far. I love all of the features and settings that it offers. It also takes great photographs. I love it.", "Date": "July 31, 2009"}, {"Title": "Didn't even last a year", "Author": "Debbie Y", "ReviewID": "R260Y87J9ZQQ7F", "Overall": "2.0", "Content": "I ordered this camera on March 12, 2010 and received it about a week later.  I was happy with it overall while I had it, but after spending about $300 on it, it didn't even last a year.  On Christmas DAY I picked it up to take more pictures and the screen is all white and messed up.  It wasn't dropped, the kids never played with it and such like that.  Just so disappointing since I'm now gun shy over even purchasing a new camera since I researched and researched to find the best one for me that I could afford.  Since I'm a stay at home mom and coming up with the almost $300 for this one was difficult for me.  Just a disappointment.", "Date": "January 27, 2011"}, {"Title": "Warning !!! Poor Indoor Picture Quality. Do Not Wast Your Money!!!", "Author": "repaso \"camzam\"", "ReviewID": "R2YZS4H1ICLUFJ", "Overall": "1.0", "Content": "Most of the indoor photographs taken by this camera are blurred, out-of-focus, colorless, dark, poorly contrasted with poor sharpness. The flash does not produce very good light and there is a gap of time between the two flash cycles when the camera is set for red-eye reduction. This causes a majority of the pictures, taken indoors, to be of poor quality as described above.The camera has several nice physical features such as the zoom, automatic settings, ease of use, portability, LCD screen etc. However, if the final product (developed pictures on the computer and on prints) are poor, then what good are the nice features. Panasonic still has alot to learn about making a camera that can take good indoor photographs before attempting to sell cameras like these on the market.Do not waste your money on this camera. Panasonic needs to get the message from their customers that they need to assure all around performace quality before putting a camera like this on the market.", "Date": "February 20, 2010"}, {"Title": "Works great", "Author": "M. Eggleston", "ReviewID": "R35FZW8PGZFS64", "Overall": "5.0", "Content": "The camera is fast and images are clear. Very few images are blurry (my fault).", "Date": "July 4, 2009"}, {"Title": "Love My New Camera", "Author": "Evelyn Chavez", "ReviewID": "R1XY9S49I7QC5K", "Overall": "5.0", "Content": "I am so happy with the Panasonic Lumix DMC-ZS1. It is by far the best digital camera I've ever bought and I have bought quite a few by the way. I Love the Zoom and the picture quality is very very good. Did I say I am happy with this purchase..also was delivered before scheduled delivery date :)", "Date": "July 6, 2009"}, {"Title": "Not well constructed", "Author": "Skyview Jack", "ReviewID": "R25B7J5RS7RGVI", "Overall": "2.0", "Content": "The camera functioned well, but it fell off my keyboard on to the plastic chair mat on a carpeted floor.  Sadly the digital screen broke and could not be returned because it was dropped.  I was shocked it broke so easily. It was a 2 ft fall, but must have hit just right.  If you buy it be very careful with it.", "Date": "January 15, 2011"}, {"Title": "useless w/o charger", "Author": "bfitia", "ReviewID": "R282BT4MAKBDSC", "Overall": "1.0", "Content": "The product I received was poorly packaged and there was no charger. Without the charger you could not use the camera. I would never buy from this company again and I would think twice about ordering from amazon.Thank you", "Date": "November 28, 2010"}, {"Title": "Panasonic Lumix DMC-ZS1 Digital Camera", "Author": "Kimi A. \"kimi\"", "ReviewID": "R3ROVQN0XVVJ6I", "Overall": "2.0", "Content": "I purchased this specific camera because I was happy with my previous Lumix.  I used this camera on a trip to Disney World for a week and was not happy with it.  It is heavy, rather larger than most point-and-shoot cameras.  I tried to take nice photos at night using the night setting and my pictures came out to dark.  Almost all night photos were to dark, or to light because the flash came on.  The pictures of fireworks were taken using the fireworks setting, and they all came out blurry or to dark.  Even the normal pictures taken during the day did not come out as I had hoped.  My friend had a Sony and all of his pictures, day and night came out beautiful..... I purchased a Sony when I found a good sale.  Now I will sell the Lumix.  Very sad and frustrating experience.  I have a great SLR camera, but who wants to lug that thing around a crowded theme park!", "Date": "December 23, 2009"}, {"Title": "Disappointed for the second time", "Author": "Katarzyna Tomaszewska \"Kathy\"", "ReviewID": "R2H3UIJX0RTPU7", "Overall": "2.0", "Content": "I purchased this Panasonic Lumix DMC-ZS1 10MP camera because of the great reviews and I cannot understand how so many people could be wrong?  There is no picture stabilization whatsoever, many pictures come out blury.  I thought I got a defective model so I contacted Panasonic and they offered to send me a refurbished one instead so I contacted Amazon and they sent me a new one since it was within 30 days.  What a disapointment is the second one too!  Picture quality just sucks.  My mother in law has a $100 kodak point and shoot camera and her pictures are crispier, brighter and never blury!  I thought for more money I was going to get even better than that and I cannot explain what a disapointment it is.  I am no professional photographer, just a busy mom taking a lot of pictures of ther two kids who never sit still, so I was hoping this camera would improve the quality of my pictures and maybe make it a little easier for me, but no.  The zoom looks like a cool feature but when I tried to take the photos of my son on the stage during his first Christmas show - the picture was shaking so bad, everything came out blury!  And it took forever to shoot the next picture, I missed so many cute shots of my son dancing!!  What is the point of such a great zoom if the picture is shaking??  Listen to me and do not waste your money on this camera.  Huge disapointment.", "Date": "February 13, 2010"}, {"Title": "battery doesn't last a day without charging.", "Author": "Debbie R. Baird", "ReviewID": "R1ZP7R6XUXO20A", "Overall": "4.0", "Content": "I was so excited to get this camera but the battery goes down very quickly. It doesn't last a day. I've searched for replacement batteries and they are very pricy. I think my battery should be replaced by Amazon, LLC.Debbie Baird", "Date": "September 8, 2009"}, {"Title": "Non standard USB cable is a huge detractor.", "Author": "P. Frerund", "ReviewID": "R3Q6GX64KITRR4", "Overall": "1.0", "Content": "Camera is great - non standard USB is a huge detractor. I lost mine and can't find a replacement. Would never buy another camera that didn't have a standard cable interface.", "Date": "August 20, 2009"}, {"Title": "Panasonic Lumix DNC-ZS1", "Author": "Golfing queen", "ReviewID": "R1RO76TH4M3XPT", "Overall": "1.0", "Content": "We were very disappointed in this camera. It has a myriad of complicated instructions - the writing is not at all user-friendly. Also, since I have a Mac and not a PC, the software for the downloaded photos doesn't work properly. The quality of the photos on iPhoto is mediocre. They were muddy and dark, even though the shots were taken on the automatic setting with the flash on. Maybe we don't know how to use it correctly, but you almost need an enginerring degree to understand this camera.", "Date": "January 7, 2010"}, {"Title": "10X OPticAL ZoOM", "Author": "MB", "ReviewID": "R10IYS8XHHVYNE", "Overall": "3.0", "Content": "It is a good camera if you need good optical zoom in a compact size", "Date": "September 18, 2009"}, {"Title": "Paid for Never Delivered!!!.", "Author": "Emily C. Swartz \"Emily\"", "ReviewID": "RS070LTEB2EO", "Overall": "1.0", "Content": "The  camera has not arrived. We have called several times and have been told it is coming. The last time we called they said they have no idea if they will ever be able to obtain the camera and send to us.  The cameria was ordered on Amazon.com, paid for more than 1 month ago.  Pretty shoddy!!The producet is Panasonic Lumix DMC=ZSI 10MP Digital Camera. The company that has our $'s but has no idea when they can send the camera is Electronics Expo, 70 Demarest Drive, Wayne, NJ 07470", "Date": "February 22, 2010"}, {"Title": "Amazon is cheating", "Author": "Former Amazon customer", "ReviewID": "R3Q0ODVJ02K69P", "Overall": "2.0", "Content": "The box was already opened. The battery of the camera has been already charged. CAMERA WAS NOT NEW! Amazon is cheating!!!!!!!", "Date": "September 3, 2009"}, {"Title": "LUMIX BRAND UNDERMINED BY LACK OF HONESTY", "Author": "Alvaro I. Vasco \"PHOTONUT\"", "ReviewID": "RU31JVGJ70EZ9", "Overall": "3.0", "Content": "I AM A VERY FREQUENT USER OF LUMIX BY PANASONIC..STARTING WITH TZ1...THE GUYS IN DEVELOPMENT DO NICE IMPROVEMENTS BUT ARE NOT ALWAYS BUILDING ON WHAT WORKS..THE MAJOR VALUE OF THESE POCKET ROCKETS IS THE ASPHERICAL 10X OR 12X OPTICAL PLUS GIGITAL WHICH PEAKED AT TZ5..THE NEW SERIES WAS UNDERMINED BY HAVING A 12X OPTICAL LENS THAT ONLY OPERATED AT 3X WHEN IN VIDEO MODE...HAVING OPTICAL ZOOM IN VIDEO IS MY PRIMARY REQUIREMENT  AND MAKES SENSE...OTHER LUMIX DID NOT ALLOW OPTICAL ZOOM ONCE VIDEO STARTED AND THE SPECS SHEET ARE NOT GOOD ABOUT DISCLOSING THESE FACTS....THE NEW SERIES DMC-Z3 SHOULD ALLOW VIDEO OPTICAL FOCUS DURING SHOOTING ...I HAVE NOT CHECKED...BUT THE TZ5 DID...SOME NEW KODAKS DO ALSO ..BUT CANON DOES NOT...A SPEC SHOULD BE DESIGNED FOR THIS ..AS IT IS A VALID SELLING POINT...WHO WANTS TO BUY 12X OPTICAL AND ONLY USE 3X IN VIDEO..ITS A JOKE...A REAL CAMCORDER TYPE GOES 20X AND BEYOND..BUT FOR VERSATILITY 10X OR 12X IS GREAT", "Date": "September 16, 2009"}, {"Title": "Wish I would have gotten an ELPH", "Author": "onawhim \"onawhim\"", "ReviewID": "R1GMSTRTOT8ES1", "Overall": "2.0", "Content": "I have always been happy with the Cannon ElPH, not quite sure why I decided to change, but I feel like I am using a camera from the stone age. Even liked my Sony camera better. And very clunky. Bad decision", "Date": "November 1, 2009"}, {"Title": "NOT available", "Author": "K. Balvin", "ReviewID": "R19NI9NL5KHL1E", "Overall": "1.0", "Content": "This product was \"not available\" and the company sent me an email after the purchase from Amazon.com.  The excuse was they were out of the item (camera) and not expected to get any more.  My suspicions are that they advertised a great price just for marketing purposes and had no intention of actually selling the item for the quoted price.Shame on you Panasonic!!", "Date": "March 24, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "10.1-megapixel resolution captures enough detail for poster-size prints\n12x MEGA optical image-stablilized zoom; 25mm ultra-wide-angle lens\nIntelligent Scene Selector; Face Detection\nIntelligent Auto (iA) mode\nCapture images to SD/SDHC memory cards (not included)", "Name": "Panasonic Lumix DMC-ZS1 10MP Digital Camera with 12x Wide Angle MEGA Optical Image Stabilized Zoom and 2.7 inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41yY7QEtwfL._SX300_.jpg", "ProductID": "B001QFZMBU"}}