{"Reviews": [{"Title": "discusted", "Author": "disgusted", "ReviewID": "R314EL3V7ANMKG", "Overall": "1.0", "Content": "bought lorex model l23wd from costco. unit lasted 6 mo. then started restarting over and over. shipped to lorex repair facility. they recived 04/14  it is now 05/06 they cannot even give me an approximate date when i will get it or a replcement.DO NOT BUY LOREX", "Date": "May 6, 2011"}, {"Title": "Problems but fixable", "Author": "Scott A. Moore", "ReviewID": "R8E1HBPFMVCIJ", "Overall": "3.0", "Content": "I bought this Lorex setup in 2009 and then installed it at the end of 2012. I had testedthe unit with a included camera and found it working. On install, I found it didn't workfor internet access, although it worked in other respects.Lorex customer service was very helpful, but ended up just telling me that the unitwas too old to repair (after only 3 years???), and that the only thing I could do was getanother one at a %10 discount. I suspect I could have got the same discount for tellingthem I was a Shriner, but who knows. The point is it is not a lot of help.Because the unit was (apparently) now trash, I opened it up. There are about 3 boardsinside connected by cables. After replugging the cables, it worked just fine.The only other issue was one of the cameras had dead night vision. I will probably alsotry to repair that, but if I only just end up replacing it, it is not much at $50 or so.The unit works great now, and meets all expectations. The only thing I was not able to dois view the cameras on my smart phone. Since smart phones were just getting started whenI got this unit, I don't blame them for this. However, I suspect newer units can do this.It won't work on a smart phone because the remote display must be either a Windowscomputer or run Explorer, both not real options on a smart phone or tablet.The only other thing I would mention is don't expect this thing to be a motion detectorif you have cameras outside. They obviously tried real hard to make image motiondetection work well, and I spent many hours setting it up and eliminating areas from thedetection \"maps\". However, it was still generating way too many false detections. Youliterally have to eliminate all plants and even shadows from the picture.At the end I decided that the only way to make this reliable was to use Lorex's optionalexternal alarms to add PIR motion detectors to the system, which are far more reliablethan the optical detection the DVR provides. I notice that the picture in the manualshows the external alarm being used exactly this way, with PIR detectors hooked to it.If you have only cameras inside, this type of detection would probably work for you. Iwould plan on closing all the windows and shades for this. Otherwise when the sunshadows a plant outside, and it is waving in the wind, that will set it off.To sum up, I would have rated this product 5 stars except for the quality control issuesand for dumping all service on the product in only 3 years. I think you should supportwhat you sell, and not tell your customers their only option is to buy another one.They surely will -- but perhaps some other companies' unit, not yours.Scott MooreSan Jose", "Date": "November 25, 2012"}], "ProductInfo": {"Price": "$1,599.95", "Features": "Connect up to 9 Cameras and view locally or via the Internet\nBuilt-in Motion Detection\nChoose Continuous, Scheduled or Motion Detection Recording Modes\nMultiple Camera View, PIP View and Digital Zoom\n4 Audio Inputs & 2 Audio Outputs", "Name": "Lorex DXR209161C9 Internet Remote DVR with 9 Weatherproof Color Night Vision Cameras", "ImgURL": "http://ecx.images-amazon.com/images/I/31w45v4WL2L._SX300_.jpg", "ProductID": "B001RNNWNQ"}}