{"Reviews": [{"Title": "A great camera!", "Author": "cgpetroski \"cgpetroski\"", "ReviewID": "R9FX5EGZ7OCBI", "Overall": "5.0", "Content": "This is one fantastic camera, and I look forward to using it a lot.This is my third Panasonic (FX-01 and FZ-30), and before that I had Nikon digitals, preceded by Nikon film cameras; I had my own darkroom and did my own developing and printing of b&w; for many years.  I have to admit that when I took the FX-580 out of the box, I was a bit disappointed.  I had ordered it to replace my FX-01, which I loved but which did not perform well in low light.  The FX-01 is a beautiful, nice-to-hold camera that is covered with a black rubbery coating, and the 580 appeared by comparison to be plastic and unfriendly.But this is a case where first impressions should be set aside.  I have now seen some of what the 580 can do (its English-language instructions run to 143 pages).  I am already a believer!I was worried that the touch-screen control of many functions might be just a gimmick.  It isn't, and I am especially impressed at what the AFAE (Auto-Focus Auto-Exposure) function does:  When you activate it, it tells you to touch whatever you want the AFAE to work on.  The thing or person doesn't have to be in the center of the screen.  It's like magic, as you watch the change in focus and the correction of the spot-metered exposure happen.  It blows me away.The 12 megapixel images are fantastic.  I took some macro (no flash) shots of some flowers, both outside and indoors, and I enlarged them to my heart's content.  You have to get to the point that you can't tell what you're looking at before edges begin to bleed pixels.Another feature that I know I will use (because I travel a lot and have tried to take lots of panoramas) is the \"panorama assist mode.\"  When it is activated, the edge of the previous image appears on the screen so that you can match it up with the next part of the panorama.  This may not be a new feature with this model, but it is very impressive.Being a diehard Photoshop user, I have not installed the software yet, but when I get to my home computer, I will check it out and report back as warranted.Unless you feel you must lug around an SLR, I think most serious amateurs will be very pleased with this camera.  Lugging lenses etc. isn't necessary with this camera; I'd rather carry a pocket-sized tripod with the 580.  In choosing the 580, I also considered the Leica D-Lux 3 and its Panasonic clone, which would have cost $200-300 more.  In the end, I could not buy a camera, no matter how wonderful, that had only a 60mm equivalent at its long end; I knew that would a source of constant frustration in many travel situations.  The 580s 25mm wide-angle is just short of the Leica's 24mm, and the Leica's lack of a handgrip really worried me - I am not interested in dropping a $700 camera.The only downside so far is the cost of the extra battery:  $49.90 including shipping from Amazon.  It may never even be necessary -- the battery seems to last forever.", "Date": "June 29, 2009"}, {"Title": "Worth every cent - Excellent for serious amateurs and new pros", "Author": "N. Montero \"Calculus/Science Teacher\"", "ReviewID": "R2DV6OIR3R40BA", "Overall": "5.0", "Content": "I have been a serious SLR photographer (mostly scientific photography but also landscape and personal photography when traveling on holiday) for over 40 years. In that time, since beginning with a 2.25\" format Yashica twin-lens reflex camera (phenomenal) and then a Minolta SRT101 SLR several years later, I have been fortunate in my ready access to top-tier Leica film systems and Nikon digital camera systems, which I use heavily.The Panasonic Lumix became my choice for highly compact cameras because: a) their superlative Leica optics reproduce images with astounding fidelity, b) they are so compact, rugged, and lightweight, c) because they have simple (read fast) intuitive controls that include the iA computerized exposure system. The FX580 is now my third Lumix camera and the best to date.The FX580 incorporates an extremely fast and highly intuitive touch screen display that allows you to touch the subject (on the screen) that you want to track and adjusts the exposure + focus rapidly on that spot in a very cool sort of \"moving spot meter\" fashion and can even perform facial recognition if you desire. It also allows you to quickly and effortlessly select the following modes with a simple touch of highly visible \"buttons\" on you large and bright LCD display: iA (uncanny in its accuracy), Program, Shutter Priority, Aperture Priority, Manual (with touch-screen slier bars for shutter speed and f-stop), and high-resolution 30 fps digital video with mono-aural sound (very crisp high fidelity images). Magnification range goes as wide as the equivalent of a 25mm lens on a 35mm format camera.Because of the features briefly noted above, its solid metal-composite construction, Leica lenses, uncanny/quick iA mode, and small size/weight footprint, this is the ONLY camera I lug around on short holidays with the entire family. Yes, when on a serious holiday to exotic or remote sites I rely primarily on my Nikon digital SLR system and utilize the FX580 when taking photographs of people or landscapes when I am pressed for time. BUT do not hesitate to rely only upon the FX580 when taking trips where going with a small footprint (small & light weight) is a distinct advantage. The FX580's images are top-tier for a compact digital camera.12.1 megapixel image size is a definite advantage of this camera but keep in mind that, besides allowing you to perhaps crop more of the clutter away from the periphery of your images, anything above 10 megapixels is only an advantage if you intend to create prints larger than 11\" x 14\". DO NOT think more megapixels =  better or sharper images.***LENSES are the critical strength (or weakness) of any photographic system andLeica lenses (German optics) are among the best in the world since the at least 1940's.Looking for a sophisticated, rugged (yes, the fact that it has a touch screen in no way means it can't take a beating: I can attest that my kids have abused it to no end and it looks and works unscathed), light digital camera for primary use or as a back-up to your digital or film SLR, GET THE FX580, read the manual, play with the controls, and have years of fun taking thousands of photos.P.S. The fully charged Lithium ion battery that comes with the camera takes an average of 350 to 400 12 megapixel hi-res images AND it fully charges in about 2 hours with the enclosed compact charger unit (excellent).", "Date": "July 18, 2009"}, {"Title": "Not a toy", "Author": "Dion Morse", "ReviewID": "R2SHSUJNINOBVW", "Overall": "5.0", "Content": "I've looked at the various reviews done by other owners and for the most part, I was impressed. Impressed to the point of getting one - I spent, I received it and was surprised at one thing no one had mentioned.This is one substantial small camera. It feels as if it weighs almost as much as my M3 Leica, has a spectacular lens and the controls are all there, but you better be willing to spend some time to understand how this camera works. You could just plop it into the IA (Intelligent Auto) and never really explore some of the other options. I did this at first to see how things happened. For the most part, the pix were adequate ... Then I started to work with both the general set up and Scene Modes and was knocked over. This camera delivers on its promise. JUST exploring the Scene Modes, you have 26 different choices of presets for various situations.If you want more manual control, you have Aperture Priority, Shutter Priority and full Manual. The touch pad does take a bit to get used to ... it becomes natural feeling in a short time.In essence, I like it - very much. This is my 8 or 9th digital camera and while it won't replace my DSLR, it fills a 25 mm wide angle / zoom niche which I wanted to explore. Their are bigger MP cameras out there - there are faster lenses out there, but this is where I wanted to be for my travels and even building files of pix of - ah - things. It's very portable, almost unobtrusive but it weighs enough for you to understand you are using something which isn't a toy.If there is a complaint - it refers to the Sub Mini B Male connector which is annoying to use as I can't find a short pig tail with that connection feature. 9 foot of wrapped cord is a bit much even on my desk.In toto - the price is very fair, the quality of the case is off the chart, the lens is remarkable and the final out put is very satisfying. I look forward to enjoying this mini wide angle for a long time.", "Date": "June 9, 2010"}, {"Title": "Would have expected better", "Author": "J. Doerner", "ReviewID": "R56RNDZBXD0DO", "Overall": "3.0", "Content": "Let me start off saying I have a really nice DSLR and just wanted a small Point and Shoot to replace my aging canon elf. I was really excited about this camera after seeing it had all of the features I wanted plus the fact it comes with the leica optics.  The camera itself is built very well, and the features are great.  One of the reasons I bought this was for the manual control over aperture and shutter speed. In the daylight (outside) the camera takes some really great pics, but inside (70% of my shooting) the pics look really noisy.  Even at low iso and on manual settings, the pics come out grainy.  The flash is good but can creates some funny bright spots.  The HD video is good outdoors, but not as good as the sony cameras, and the video indoors is horrible.  I returned it and bought the Sony TX7 (love this camera).", "Date": "February 25, 2010"}, {"Title": "is a great small camera", "Author": "Jonluk", "ReviewID": "RCO0VHITFAMAJ", "Overall": "5.0", "Content": "I have a Nikon D5000 but it is a hassle to take sometimes.  This is a great size that takes great pictures.  If anything it does too much.  There are a lot of features that confuse me sometimes, but \"I make it work\"", "Date": "August 12, 2012"}, {"Title": "Great camera, especially for persons with disability especially when fine motors skills are an issue", "Author": "J. ONeill \"Jim O'Neill\"", "ReviewID": "R24DYGJYOQRI7R", "Overall": "5.0", "Content": "I recommend this camera.  The touchscreen menus make it easy to change settings with ease.  Alternatively, you have the option to let the camera to do the work (AE mode) and it will not let you down.  The camera is well constructed, really compact, and lightweight.  The pictures are crisp in detail and color, even when using both the optical and digital zoom.  You can choice from over twenty scene options, which help those who want to \"just take a picture\" easily defined options.The optical image stabilization feature allows me to take great picture in spite of a disability that can cause hand shaking.  Almost every picture is without blur.  In closing, this camera is worth every penny I spent.  Moreover, the quality, the many features and clarity of my pictures makes 5 times the value!", "Date": "June 24, 2011"}, {"Title": "Excellent camera!", "Author": "RJMassicot", "ReviewID": "R2RJ0BJV00QXLA", "Overall": "5.0", "Content": "After having this camera for almost a year I cannot say enough about it.  It is the perfect size, easy to carry and slip into my pocket.  The battery lasts long enough to not be charged for a 2-3 day trip (using the flash quite a bit)!  It has too many features to list, but the best are the facial recognition and the \"tap-to-focus\" which tracks an object as it moves. After much research I chose this one because many reviews cited it's low-light capabilities. I can only agree with them!  It takes great photos at parties (or any low-light situation). I love this camera and highly recommend it to anyone looking for a full-feature point-and-shoot camera.", "Date": "April 28, 2011"}, {"Title": "This is made in Japan", "Author": "Peter", "ReviewID": "RDXJA1PSOEXQR", "Overall": "5.0", "Content": "I don't believe this is made in Japan, the touch screen is good and quality of the picture is nice with this price. I will buy panasonic stuff again. Small and easy to bring...I like it", "Date": "December 5, 2010"}, {"Title": "exelent product", "Author": "Irakli Karchava \"Irakli\"", "ReviewID": "R1QYW4RU9LRFAT", "Overall": "5.0", "Content": "The quality of materials is exelent,also picture taken from this camera looks like pictures shot by slr cameras.Good purchase for the price.", "Date": "July 22, 2010"}, {"Title": "Nice features, too bad Panasonic can't build a camera to last", "Author": "Harvey Woodmeadow", "ReviewID": "RDWX5KIM1EZIW", "Overall": "2.0", "Content": "We are on our third camera, and it's broken again.The first camera we got when the model # was still FX550. With a good wide-angle, fast lens, manual exposure settings, and relatively small package, it seemed like a good buy. But within a couple of months, there was some kind of debris visible in the images. Something had gotten affixed somewhere to the optics and was showing up in photos, especially with wider aperture and longer zoom settings.Sent the camera back to be fixed under warranty, and instead they sent us the new model, the FX580. At first, this seemed like a pretty good deal. We got the next revision of the camera for a few week's inconvenience of having the camera sent out to the service center. The FX580 took what was already a camera with a great combination of features and made it better.But, six months later, we had the _exact_ same kind of problem, with some kind of debris on the optics.Now, we are already pretty careful with our cameras.  We don't drop them, we don't leave them in dirty places, etc.  And to Panasonic's credit, in spite of us delaying in requesting service for the camera again (putting us right at the edge of being within the 1-year warranty period from our original purchase), they accepted the camera back and sent us a new/refurbished one (can't tell...it was like-new, but might have been refurbished).After all that, we treated the camera even more carefully.  We kept it in the soft fabric sleeve it's shipped in, in addition to whatever bag it was carried in (i.e. our camera bag), were even more careful about handling it, etc.Even so, it's broken again. On the bright side, this time it's not a problem with the optics. However, in some ways the current problem is worse, because instead of getting some photos with junk in the picture, we can't take pictures at all, because the shutter release button is broken (well, if you press _really_ hard, it will take a picture...but that's not really useful).Unfortunately, we need a working camera within the week. Not enough time to go through Panasonic's customer service process once again. We're going to have to get a new camera, and there's no way it's going to be a Panasonic this time, no matter how compelling the features they offer.Given all the maintenance issues, this would have been a 1-star review. However, I must admit that the feature set is still excellent for the size camera. So they get a 1-star bump for that. Still, there are competitors nearly as good, and with a much better reputation for quality and customer service.", "Date": "January 16, 2011"}, {"Title": "An outstanding product.", "Author": "Armando \"Gadgets lover\"", "ReviewID": "R3GRI4LJNSUORG", "Overall": "4.0", "Content": "The size is unbelievable small and the quality of the pictures is very good.The touch screen makes everything easier. I strongly recommend it.", "Date": "December 8, 2009"}, {"Title": "Check your packaging!", "Author": "James R. Marous \"jamesm_arcade\"", "ReviewID": "RS839Z3R0J159", "Overall": "3.0", "Content": "Received this camera direct from Amazon.  The camera had obviously been returned and not inspected.  The USB cable was missing from the packaging.  Make sure you check all your accessories when you open your package.  Amazon told me to go out and buy a new cable and they would refund me the price.  Review on the camera itself coming soon.", "Date": "January 28, 2010"}, {"Title": "Only good, not great", "Author": "WiFied", "ReviewID": "R2OSDL2THR513B", "Overall": "3.0", "Content": "Not nearly as good as the Panny ZS3Panasonic Lumix DMC-ZS3 10MP Digital Camera with 12x Wide Angle MEGA Optical Image Stabilized Zoom and 3 inch LCD (Black), but that camera is slightly big bigger and heavier. Also, the HD movies on this camera are MJPEG, not H.264, so beware of this. I had to send it back for this reason. Get the ZS3 if you can - there is no camera out there now that is comparable to it.", "Date": "August 16, 2009"}, {"Title": "Nice camera though Amazon almost blew it", "Author": "SBB", "ReviewID": "R3UV0FB2JECWHQ", "Overall": "4.0", "Content": "I ordered this \"in stock\" item then watched and waited for a week for it to be shipped.Facing a Christmas deadline, I had to contact Amazon customer service (which takes a good bit of effort in itself) and pay $10 additional before the camera left Amazon.", "Date": "January 24, 2010"}, {"Title": "Very nice camera", "Author": "B. Frid", "ReviewID": "RGPSHEAFWE19S", "Overall": "5.0", "Content": "Nice camera. The whole family loves it. I will buy another one, first got stolen", "Date": "January 23, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "12.1-megapixel resolution captures enough detail for poster-size prints\n5x MEGA image-stabilized optical zoom; 25mm ultra-wide-angle Leica DC lens\n3.0-inch touch-screen LCD\nIntelligent Auto (iA) mode; Face Recognition feature\nCapture images to SD/SDHC memory cards (not included)", "Name": "Panasonic Lumix DMC-FX580 12MP Digital Camera with 5x MEGA Optical Image Stabilized Zoom and 3 inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41etXotg1kL._SX300_.jpg", "ProductID": "B001QFZMAG"}}