{"Reviews": [{"Title": "Works very well", "Author": "sciencectn", "ReviewID": "R1HPA84578WLU5", "Overall": "4.0", "Content": "First of all, don't use the included CD. I think they included the wrong driver, and I emailed VideoSecu about it and they sent a link with the updated software.EDIT (10/17/11): It looks like other reviewers are able to install the software from the CD just fine. It's been almost 2 years since I wrote this review so they better have fixed it by now...EDIT 2: You cannot get remote monitoring on smart phones with this model. Instead, you have to get the PCI DVR from Q-See: Q-See QSDT4PCRC 4 Channel H.264 PCI DVR Card They said it works with Win Mobile Pro, Symbian OS and iPhones.Once I installed that, it worked perfectly. The most awesome thing about it is you can control Pan/Tilt/Zoom functions and watch the live camera feed remotely. You can also download your recordings remotely (but be sure to use Internet Explorer, because the remote monitoring software requires ActiveX).The motion detection and alarm features are also very nice. You can make it record when motion is detected so you don't have the scrub through hours of recording nothing. You can also make it email you when motion is detected, and it can even attach a snapshot of what set off the motion alarm.The frame rate may stutter a lot when you are using more than two video inputs. You also want to be sure that if your cameras are wireless that there is a clean signal with no interference or disturbances. Any bit of interference will set off the motion alarm, and it will record nothing interesting (unless you find static fascinating).Another thing; the DVR software does NOT work on 64 bit systems (but the remote monitoring will).", "Date": "November 7, 2009"}, {"Title": "Crashed my PC and was hit with unlisted restocking fees on return", "Author": "SAV", "ReviewID": "R1HYQLVG9QOPFA", "Overall": "1.0", "Content": "This looked like a great way to get live feeds from a number of cameras and there were a number of stars however I tried for over 2 days to get this to work without crashing my computer and eventually realized that it wasn't going to work for my system.  Every time I plugged it in my computer would beep for 10 seconds and eventually freeze (tried all of my USB ports with the same result).I decided to return the system and therefore contacted the seller.  They gave me a return authorization and told me that I needed to pay return shipping.  That was expected and so I paid return shipping.  Well about a week later I see that I only received a partial refund.  When I reached out to the seller to ask why they told me that there is a 20% restocking fee listed in their terms and conditions.  That's a load of crap.  I read through their entire policy including the return policy (which only references the Amazon return policy and says to call them with \"additional policies that may apply\").  The only place they mention a restocking fee (of 35%) is when a shipment is undeliverable or refused.  Neither of those applied in my case.Summary, I received something that crashed my computer and didn't work, I was able to return it but the end result was that I received back about 60% of what I paid (I lost out on shipping both to and from the seller as well as the unlisted yet very real restocking fee).  The entire experience left a bad taste in my mouth and helped to reiterate why I'm much better off buying only from Amazon (vs. an Amazon retailer) whenever possible.BTW, I noticed that the retailer raised the price after I bought my 4 Channel USB DVR. Guess with an unlisted 20% restocking fee they felt they were better off charging more!", "Date": "April 13, 2012"}, {"Title": "Well worth the money", "Author": "Jeffrey Bryan", "ReviewID": "R2U7TZDYYV2WRF", "Overall": "5.0", "Content": "I needed this item to work quickly and efficiently - and it did!  Good price, quick delivery, easy to use, and there is now a scum serving 10 years.  :)The unit came with a CDROM with all the support software and installer program.  Setup was easy, I just clicked for all the default settings and I was up and running in five minutes.", "Date": "July 16, 2009"}, {"Title": "Junk", "Author": "V.T. Too \"veeteetoo\"", "ReviewID": "R368FDVS5BR0G9", "Overall": "1.0", "Content": "This is a big fat zero. It isn't supported by any recent operating system. Or 64 bit. Or AMD processor. It is a fly by night product. DO NOT BUY. There is ZERO support for this product. But a poorly worded piece of paper that came out of China.", "Date": "January 16, 2013"}, {"Title": "A cost-effective way to keep your business or home monitored", "Author": "Sheldon", "ReviewID": "R31EP19L0UYNKO", "Overall": "4.0", "Content": "This device is a simple, yet effective video capture device to keep your home or business cameras monitored.  With multi-channel inputs, You can monitor multiple cameras, and also record audio.  Be aware that this product is NOT Windows 7 friendly (At time of my purchase).  You will need Windows 95/98/NT/2K/XP to run this device.  The faster and more memory your computer has, The more fluid the video is (faster/more frames per second).", "Date": "January 10, 2013"}, {"Title": "not sure why :/", "Author": "Brialer", "ReviewID": "R1IDS983D5KR8X", "Overall": "3.0", "Content": "I bought this product but it never worked for my cam i tried severial comps with different windows on them still nothing ohh well", "Date": "July 22, 2013"}, {"Title": "Updated Unit Inop", "Author": "SMSgt", "ReviewID": "R21338AVM5RVZD", "Overall": "1.0", "Content": "I have two of these units. The first one came with drivers that didn't work but I was sent a link that supplied the needed drivers and the unit works fine. The new unit, labeled \"New\" came with software that is different from the first unit and doesn't work either. The GUI display indicates there are cameras sending signals but there is no video. I tested the cameras on the first unit and they work fine. I'm now waiting for drivers that will enable my new unit to work or I have to send it back and seek elsewhere for a unit that works.", "Date": "April 19, 2012"}, {"Title": "WORKS!!!!......after hours of trying to get it to work", "Author": "DCH", "ReviewID": "RUWQ1UN4F017O", "Overall": "4.0", "Content": "Using the CD is pointless, well at least mine was as there was no data on the disc. I sent a message to warehouseseller on a Friday night about the issue, and within an hour received a message from a company rep. (julia), with a link to where I could find the drivers. Even though the product description mentioned that it was incompatible with Windows 7, I attempted it anyways. And guess what....it didn't work. I eventually had to install Windows Vista on my comp to get the item to work, and once it did, everything worked perfectly. There is a downside, as the only way the DVR will work is if your monitors resolution is at 1024 x 768. Using the remote software is also easy, all you have to do is enable it in the software settings, then log in to your router and enable portforwarding for the comp you're using, and then type in the IP address of your computer into an internet explorer window, and it should work after you install the activex components. not only can you watch live footage remotely, but also footage that was previously recorded. After all the work I put into getting this device to work, I must say that I don't regret my decision in buying it, considering how cheap the unit is and how well it has worked so far.", "Date": "January 29, 2012"}, {"Title": "Nice DVR for the money!", "Author": "Jesse Ratliff", "ReviewID": "R3FIOJWSLPKRLI", "Overall": "4.0", "Content": "I bought this to allow me to connect IR cameras up to my laptop while doing preliminary investigations on paranormal cases. I was actually impressed with the picture quality. The real downside to quality is the limited frame rate (best is only 30fps) so there are some problems with \"stepping\". If I was granted one wish amongst the improvement research team, it would be that the user not lose sight of video while adjusting settings. Instead, have the control panel come up in sidebar, rather than take up entire screen.Overall, this unit will not give the user tv quality video, but for documenting notes, traffic, and general surveillance, it should work just fine.", "Date": "November 22, 2011"}, {"Title": "would not buy again", "Author": "reader reader", "ReviewID": "RKUOGNGK8EG83", "Overall": "2.0", "Content": "Software is junk!  Everywhere I look on the web I find people that have the same issue.  When you start the \"Super\"DVR program it loads half way and then says something about directdraw failed to initialize and the it closes. I tried it on two windows desktop computers, a windows laptop and you can forget about linux unless you want to write your own driver. Ubuntu doesn't even recognize the device. I was able to get it to work on the laptop but ha I dont have enough disk space to record on that so what is the point.Seems to me that the unit itself gets really hot to the touch when plugged in.", "Date": "April 20, 2010"}, {"Title": "Simple: Doesn't Work", "Author": "Carlos", "ReviewID": "R1MCDWXXBFF9WF", "Overall": "1.0", "Content": "I've tried this item in a Dell I6000 and in a Dell Desktop. Both with Windows XP.If you install the software, and try to open it it will just show a dialog icon saying: \"La operación se ha completado correctamente. .errcode=0x0\" and then will close itself.Another software like Active Webcam will not recognize this as an video input device.", "Date": "February 22, 2011"}, {"Title": "Problem Item...", "Author": "Rodion Khoruzhenko", "ReviewID": "R3J0IAPUV2ZLYQ", "Overall": "2.0", "Content": "Let me start out by saying that I am experienced with a wide range of electronics equipment, and that this review is not from a newbie who couldn't figure the product out. I tried the hardware/software I was sent on a multitude of different computers with the same unpleasant results.I wanted a simple solution for a video surveilence system -Running several cameras to a laptop. It is not practical to install a multi-channel DVR into a laptop, I figured that a USB device like this would be a good alternative.First a *WARNING* - if you order this item from 'WarehouseSeller', you will NOT recieve this item. You will recieve an \"Ezcap3104B\". This will come with knock-off software and drivers that are poorly translated from what is probably Chinese.WarehouseSeller told me that this was an 'upgraded' version, but this is, quite frankly, BS. It is clearly a cheap clone - the software in particular is almost painful to look at. OH - and it doesn't work!I returned the \"Ezcap3104B\" and ordered the VideoSecu DVU104 from the official VideoSecu website. But this too has problems. The hardware appears to be good (even on a Windows 7 computer), but the software does NOT work! Will not display the camera feed.I installed several different third-party trial versions of their software (namely Luxriot), and the VideoSecu DVU104 harware works. It displays the camera, but unfortunately these trail programs are limited to ONE camera - I need more than that for my system, and the full versions of the software are rather expensive!Good hardware, awful software. I am currently in the process of asking VideoSecu support if they have an updated version of their software that would perhaps fix this issue. I will update this review if they give me new information that fixes this problem.In the meantime, I suggest that you STAY AWAY from this item (especially the one sold here through WarehouseSeller).***UPDATE*** (and FIX)So, after contacting their support, they have notified me that several customers have had my issue and offered the following fix:In the settings, ALL of the camera inputs (even if you are using just one camera) must be set to NTSC, or else they will display a black screen.I have added one more star to my review, simply because now that I have it working (after much hassle), I am more or less satisfied.Adding additional cameras makes the frame rate drop sharply, but the system is now usable.", "Date": "April 1, 2012"}, {"Title": "very very poor and incomplete instrctions", "Author": "shaun", "ReviewID": "R3BPKNA7STZ7OF", "Overall": "1.0", "Content": "Right now, this video capture card and associated camera and software setup gets a -5 for wasting a bunch of my time by having very very very poor and 1970 level instructions with 0 customer support on their site.  For people that simply plug and play, Great!!!  For me it is shaping us a big time suck.  Tried it on another machine. Turns out the camera drivers do not work. VideoSecu has no drivers page. GREAT.After looking through the reviews of this product I noticed most of them gave this item 5 stars and this is the only product they have ever reviewed.  They all have names like \"Bob\" or \"Mary\", hail from nowhere, and write 20 word reviews. The useful honest reviews are entirely different. Go figure.  I feel ripped off.  And, surprise suprise, their returns policy states that they only accept unopened items for return.Run from this company.", "Date": "March 30, 2012"}, {"Title": "Be ready to pay for new computer part!", "Author": "Mike", "ReviewID": "R2M37C4GYXF6ZJ", "Overall": "1.0", "Content": "I never write reviews but I thought it was my duty to do so. I thought this was the way to go and save some money at the same time. I know a fair amount about computers and soforth so you know I am no idiot. I was going to use this for my business. I thought I would connect all the cameras and wires before running them to make sure everything is operational. Got everything set up and installed the CD for the software and it didnt work like all my other installs I have done in the past. Once it stoped I thought I would reboot to set everything but it wouldnt shut down windows as normal. At this point I just held in the power button to my computer that I had done before and that was all she wrote.I tried to turn my computer back on and there was no power to it. I freaked out. My business runs on this computer. I guess I should have not done something so risky. My priority was to get the computer back up. I had a computer tech come out ASAP that day. He said he hadent heard of such a thing happening. He said its either your power modual or mother board. If its your mother board, forget this computer. I was freaking out and praying it was just the power modul. After several hrs it turned out that the power mudule was gone. Replaced it and my computer was back. THANK GOD!$250 later I have decided not to use this component and have purchased a DVR. The money I spent today was about the same amount I spent for the DVR. Think twice before using this.......", "Date": "December 1, 2011"}], "ProductInfo": {"Price": "$199.99", "Features": "Watching and recording video on your computer, easy to setup. Fast MPEG4 video compression\nRemote surveillance view. Remote playback function. Support IE web browser,  PTZ control through web browser\n4 channel video input 2 channel audio input\nSchedule mode, record by motion, and auto recycling\nMulti-channel playback, searching by time/date and recording events, images can be zoom/capture/save/print/backup", "Name": "VideoSecu 4 Channel USB 2.0 DVR Network Video Audio Capture Record Adapter for PC Notebook Digital Video Surveillance System 1OZ", "ImgURL": "http://ecx.images-amazon.com/images/I/41kIBMwS5cL._SY300_.jpg", "ProductID": "B001ASDI1Y"}}