{"Reviews": [{"Title": "Best Camera System For Any Computer", "Author": "Armand Lucas \"Nuwire\"", "ReviewID": "R2Z2EBJDRQIX6Q", "Overall": "5.0", "Content": "When I started my security camera installation company back in 2001, Geovision was the first product I sold and installed for my customers. At the time it was revolutionary because it worked so well out of the box and the card installation was easy. My only problem with it then is that it did not give me the resolution I was looking for. After years of experimenting with other camera DVR's and cards, I came back to Geovision and found out that it wasn't Geovision that was giving me a substandard resolution, it was the cheap cameras I was installing. I feel that Geovision packed every feature you will ever use without demanding a lot from your computer your installing it into. I've used some pretty cheap computers for DVR's and Geovision has never let me down. Other cards use up too many motherboard assets including the onboard video card. Geovision even has an app to allow you to watch your camera system on your I-Phone. It's in Beta testing now but I have installed it for a couple of customers and found it to be the coolest feature yet! It even controls Pan, Tilt and Zoom cameras as well!", "Date": "October 17, 2009"}, {"Title": "Geovision knock off card", "Author": "Corptek Jeremy", "ReviewID": "R2V5GFOOXUBVE4", "Overall": "1.0", "Content": "This is a knock off card which means some plant in China made this card it is not a true Geovision product.  The worst part is when I put it in I had to set the region code to Canada to make it work.  Now I have wasted over $500 bucks on a piece of crap card and I have a customer who needs the system in and running by tomorrow.  I don't have time to wait for another card and to wait for a refund.  I really wish people would explain that they are selling a knock off card and put that price point at about $100 which is what they are worth.  Video quality is terrible and there is herringbone in the screen for each camera which tells me there is a voltage differential for the camera video controller chip. This is not a Geovision product it even comes with a burnt DVD with old software not the newest version of the software.", "Date": "July 7, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001BS7IN2"}}