{"Reviews": [{"Title": "Video and advance point-and-shoot in one small camera!", "Author": "Chad", "ReviewID": "RN4DEG0CMYYSI", "Overall": "5.0", "Content": "This camera is incredible!  Pictures are great.  Very easy to use.  It can do it all for you, or you can adjust ISO and other settings to get creative.  Warns you if someone blinked, has smile-detector... you won't be disappointed!  But the real positive is that with a flip of a switch you ALSO get a high-def video camera with stereo sound and zoom.  Yes, zoom is only 4x, but its a fair trade-off for something this thin and light.  Touch screen is incredibly easy-to-use.  Great for touching-up pictures, showing off your vacation videos, etc.  Love the calendar view!  Tips: battery seems to drain a bit fast, so I recommend a spare.  4GB Duo stick a must (minimum).  Also, be sure to get a nice case to protect.  I recommend a  BUILT case (Built NY E-HCS-BLK Small Hoodie Camera Case (Black)) as it fits the camera well and has a hard protective back.  Glad I spent the extra cash over the T90 as the larger screen and stereo sound seem worth it.  It's a head-turner so get ready for compliments!  I think you'll really love this camera!", "Date": "April 16, 2009"}, {"Title": "Not worth the money", "Author": "Aishah Binte Jantan", "ReviewID": "R3TH1AT4TNJNUU", "Overall": "3.0", "Content": "Let's start with the good news; this camera is certainly very svelte and stylish, and the brushed metal finish adds a classy touch to complement the solid build quality. The T900's touch screen is lovely and responsive, and the interface is slightly bland but decently simple to use. That said, I'm personally not a big fan of touch screens on cameras as I find them fiddly and tend to complicate rather than simplify operation.Which brings me on to the most disappointing aspect of the camera - image quality. Colors are adequately vibrant when taking shots in bright conditions, but not outstanding by any means. However, when I took shots at a friend's birthday party in a dimly lit restaurant, the results were poor. Noise was noticeable, color tones looked flat, while black levels were mediocre. Though the camera can take images at up to ISO 3200, the noise in such images is so nasty the I wouldn't recommend setting the ISO at anything above 800. The weak flash doesn't help matters, but more positively, the face/smile detection works well.Video quality is also good for a point-and-shoot camera; colors are bright and black levels are well rendered. It should be noted however, that despite the Full-HD claims, the maximum resolution is actually 720p, and not the REAL Full-HD (1080p). Nevertheless, video recording is one of the T900's stronger points. Battery life is poor though, which is disappointing but expected, mainly due to that massive screen.The T900 will sell like hot cakes among the fashion-conscious and die-hard Sony fans. But to the rest of us, those gorgeous looks sadly conceal a camera lacking in substance and ability with its indifferent image quality. The high price is the final straw; $400 is dangerously close to bridge camera territory (such as the brilliant Panasonic FZ-28). Entry level dSLRs don't cost too much more, either.All in all, there are much wiser ways to spend your money.", "Date": "May 8, 2009"}, {"Title": "Sony DSC-T900", "Author": "M. Bahl \"Gadget Guru Girl\"", "ReviewID": "RVU57BXBE6WUX", "Overall": "5.0", "Content": "I've had every model in this line and this one is clearly the best. Amazing close-ups, fantastic video and great shots of fast moving objects/subjects like kids, pets, cars etc. It's a wonderful replacement when you don't want to lug your large camera around. Changing from picture mode and video mode is quick since it's controlled by a physical button. It's also the smallest and thinnest.Battery life isn't bad but could be better.Get an extra battery for all day events.", "Date": "April 18, 2009"}, {"Title": "Feature Packed but Quality Lacked :(", "Author": "Tommy Madison \"Tommy Madison\"", "ReviewID": "R12K5F5230AMLV", "Overall": "3.0", "Content": "First I have to say that this is my 4th Sony cybershot camera, I have also had nikon and cannon cameras.The Good:It's fast, feels great, feature packed, very compact and slim, screen looks amazing, feels solid, HD Video, steady shot, and much moreThe really bad:It's video and still photos have a ridiculous amount of Chromatic aberration  also known as purple fringing.  50% of photos taken with  any bright light source in it has purple all over.  While this may have been tolerated 7 years ago in Sony cameras,  it shows how out of date or how cheap Sony is being when it come to quality lenses or proper R&D.;  For a nearly $400 camera, Sony customers should demand much much more.While this camera would've been my favorite point and shoot camera to date, my final recommendation would be to stear clear of this model and it's sister the T90Sony,  it's time to wake up and provide the quality that we deserve", "Date": "June 6, 2009"}, {"Title": "Perfect!", "Author": "L. B. Snell", "ReviewID": "REVWXPET5NFS2", "Overall": "5.0", "Content": "This camera is everything that I have wanted and more! My previous camera was an older model touch screen 8mp that I loved. I decided that it was time to upgrade to something smaller (that would fit in my pocket and purse more conveniently). I couldn't be happier with this camera.Prior to getting this Sony, I purchased a Nikon S60 and absolutely hated it. Nothing about that camera was good, it took terrible pictures. So, I immediately returned the camera and went back to the brand that I have known and trusted for many years.The size of the camera is perfect. The touch screen is not pixelated and the display is fantastic.The smart modes pretty much guarantee a great picture!This camera is very user friendly right out of the box (without reading the manual), within minutes I knew where everything was and what every button on the touch screen meant. After reading the manual I learned some new tricks about the camera and some extra features.I absolutely recommend this camera to anyone who wants high quality pictures in a highly portable camera!", "Date": "April 14, 2009"}, {"Title": "Greatly Disappointed", "Author": "A. Y. Wang", "ReviewID": "R32Y2OWRMRV8FX", "Overall": "3.0", "Content": "Before we go any further, I would like to mention that this review will primarily look at the camera's video capabilities as I was hoping to combine a 720p HD pocket video camera with a digital still camera.  Alas, this was not to be.Pros:- Ultra-compact size, VERY pocketable- Fixed lens with 4X zoom- Capable of zooming while recording (surprisingly, this is rare)- Capable of adjusting focus while recording (also surprisingly rare)- Optical image stabilization- Large, high-res 3.5\" LCD screen- Touchscreen menu system (I was surprised to find that I did like it)Cons:- Proprietary data connector instead of mini-USB and mini-HDMI- Requires use of camera dock for USB and HDMI connections- Uses proprietary Sony MemoryStick instead of more readily available SD/SDHC- Lens is prone to significant chromatic aberration, or purple fringing.  In cases where the sun or a bright point source of light is in or near the visible frame, you will get a bright purple streak across the image.- Colors are washed out compared to actual colors- Low light performance is really bad due to the max aperture of F=3.5- Only two focusing options in video mode: Auto and Infinity.  Auto results in a soft focus or focus hunting, and Infinity increases the minimum focusing distance, which makes it tough to record an 18 month old who like to stay up real close.  A single-point focus option would be really nice or even the ability to select a focus area by touching the screen like in still picture mode.- Battery life seemed to be around an hour with taking test shots, downloading, taking more test shots, downloading, etc.  Would be nice to have an AC adapter.  Would definitely recommend extra batts.- Connecting and downloading files to a Mac required setting the camera's USB mode to \"Mass Storage\" instead of Auto.  In Auto mode, the files would not copy via Finder nor could they be viewed directly from the MemoryStick.  iMovie would copy them, but they would be corrupted.  Changing to \"Mass Storage\" mode resolved this issue.  I'm guessing the included Windows software somehow helps the handshaking.  Sony needs to design this to work regardless of OS.I was primarily comparing this the T900's video capabilities against the lower priced MinoHD and Sanyo Xacti VPC-CG10.  The T900 is most comparable to the Xacti, but the Xacti's picture quality in daylight shots was visibly sharper and had much better color even though it was a bit over saturated.  The MinoHD probably has the truest color reproduction, and the Sony is still significantly washed out comparatively.  Considering that this camera is $180 more than the Xacti and the MinoHD, I would expect its picture to blow the them both away.  It did not.  If anything, it only managed to match them in some cases, but in others, it could not even do that.  The washed out color was bad enough, but the chromatic aberration was too much to ignore.I really wanted to like this camera as I've loved my DSC-T7, but it just doesn't pass muster.  If you want to see exactly what I'm talking about, you can see my comparison videos at[...]I did take a few still pictures for comparison with the Xacti's 10MP capabilities, and again, the Xacti held its ground.  The T900's still pictures were victim to the same poor color reproduction and chromatic aberration.", "Date": "June 5, 2009"}, {"Title": "Don't buy it!  Picture noisier and less sharp then the DSC-T300", "Author": "Teri S. Hanright", "ReviewID": "R3E0E687C2QOYM", "Overall": "2.0", "Content": "I own both the DSC-T300 and the DSC-T900. (I am returning the T900)  The 900 takes a noisier, fuzzier picture then the T300. On a side by side comparison, their is no comparison! The T900 is twice as noisy and takes a less detailed picture. Why? Sony made the lens smaller. The 12 megapixels are of no use, compared to the 10 megapixel DSC-T300. The smaller lens cannot gather enough light to overcome the noise. Sony also repackaged the camera making it lighter and thinner then the DSC-T300. The only effect that had was to reduce the optical zoom to 4x instead of 5x. I bought the T900 because of the stereo sound, 720p movie mode. But please, save your money, the camera might be feature rich, but it takes terrible pictures.  Update 8/16/2009... Sony has just introduced the DSC-TX1/H. It has many more new features. Check out the video here on Amazon. It uses a CMOS 10 megapixel sensor instead of the older 12 megapixel CCD sensor. This sensor will be much better in low light conditions. Most of the latest DSLRs use CMOS sensors. Don't expect DSLR quality, :) but it should outperform the T900 and the T300. Finally Sony is addressing the real issues. Don't be fooled by buying a point and shoot camera by the number of megapixels. Small sensors become less light sensitive as the megapixel count rises. Sony should be applauded for using a 10mp CMOS sensor in the new DSC-TX1/H instead of trying to keep the pixel count at 12 megapixels. Bottom line: Stay away from the DSC-T900. A few more bucks will get you a much better Sony Cybershot.", "Date": "August 14, 2009"}, {"Title": "Very Convenient, Elegant Design", "Author": "Ken", "ReviewID": "R1PUITR6LQA2ID", "Overall": "5.0", "Content": "This is the top of the line Sony super compact camera.  It takes great pictures, and a turn of the knob gets you HD video with stereo sound.The best thing is that you can always have the camera with you--no more choice between missing shots or carrying around a larger camera.I hope someday they come out with a wider angle and in-camera panoramic stitching...Kodak has that in some of their cameras, but their cameras are a bit larger.  For small size and quality, Sony has done a solid job...", "Date": "April 25, 2009"}, {"Title": "Amazing Camera!", "Author": "R. Johnson", "ReviewID": "R3BOWDPZHF6IV7", "Overall": "5.0", "Content": "I bought this product a couple of weeks ago and have been using it in Spain for the past 6 days. And I cannot stop raving about how great this camera is. It comes with so many features, takes great pictures and has great quality video. I hate using the flash and I have used this camera in dark settings such as taking a picture in a castle in Segovia Spain. I changed the setting for a dark room and it took a great picture!The only two cons I have are the following:1. Battery life. If you purchase this camera get an extra battery or two and keep rotating them in the charger. This is a pretty big problem with this camera. But it's not enough for me to return it. The features and quality of it are just too good. I bought an extra battery and things have been just fine for me.2. Proprietary memory stick. I wanted a camera that I could use eye-fi with. Since Sony does not have a standard memory card slot eye-fi does not work with Sony cameras. Maybe Sony will come out with something. Tethering to my laptop has been just fine. Pictures and video transfer really fast.The camera has some really great features and this is why I still give it 5 stars despite my cons.", "Date": "May 8, 2009"}, {"Title": "Great for video, horrible for pictures", "Author": "V. Didwania", "ReviewID": "R2P1LJM7TM8UQ8", "Overall": "2.0", "Content": "Sony Cyber-shot DSC-T900 12.1 MP Digital Camera with 4x Optical Zoom and Super Steady Shot Image Stabilization (Black)PROs: Great looking camera that is tiny, easily fits in the pocket, great build quality and finish, fits nicely in your hands, beautiful LCD screen on the back with great resolution and excellent response to touch, and video quality that amazing for such a tiny camera.CONs: For a point and shoot camera that is close to $400, it can't do what it was made for, take good pictures.Considering all the technology that is present in this camera it doesn't really do a great job taking pictures that you would actually want to keep. The flash is horrible and when taking pictures indoors they usually come out grainy, blurry, or almost look edited like cartoons. Black color looks especially awful. Outdoor pictures are better. Even the optical stabilization doesn't work that well as I still had many blurry pictures. This camera is supposed to be all AUTO with the camera adjusting to each scene automatically, which leaves little room for changing settings to get it to work any better.The video quality is the only redeeming part. The dock is also a nice addition.Clearly the battery life is horrible. Also the camera doesn't auto rotate pictures that were taken vertically. You have to press the rotate button everytime. I expected more from a top of the line point and shoot camera from Sony. I used this camera for close to a month trying out many different scenes. My brother has an old Canon SD 1100 that takes far better pictures than this thing. Definitely would NOT recommend it.", "Date": "May 5, 2009"}, {"Title": "I love my T900", "Author": "William J. Mister Sr.", "ReviewID": "R1ZBQEVFCF7KQ2", "Overall": "5.0", "Content": "This camera is a Diamond. I have had it for a couple of months and really love it. The high definition videos are really nice and the stills are very good. The battery life is sufficent for an outing, but for real hot and heavy use, buy an extra. My son bought one and he loves it. I will keep this little gem for a long time. The $380.00 retail is too much for this camera. Shop around and you may be able to get it for under $300.00This camera is not going to give you great videos or stills in real low lighting situations, but come on people it's a compact and you could get hurt shooting in the dark anyway (little humor). Also a beautiful ultra fine 3.5\" display and easy to operate touch screen are standard.", "Date": "June 30, 2009"}, {"Title": "Perfect", "Author": "M. Stanton", "ReviewID": "R8IHH7BPI9YNQ", "Overall": "5.0", "Content": "I have owned a lot of Sony cameras and this is by far the BEST!  From the picture quality to the hi-def video quality this camera cannot be matched.  The auto scene selection works perfectly.  The size of the camera is also excellent.Apple's iMovie 09 brought the video right in with zero issues.", "Date": "May 16, 2009"}, {"Title": "Nice form factor, terrible overall experience.", "Author": "Turtle \"oeplyrcp09\"", "ReviewID": "R34M7RNNJROGBN", "Overall": "1.0", "Content": "This camera looks great at first glance.  But in owning and using the camera for a few months now, I have gone from excitement to regret.  Here are the things I really hate about this camera:1.  You can't just use a cable to transfer photos.  You have to have the dock with you.  What a hassle!  Your other option is to buy a memory stick card reader to plug directly into your machine.  Or maybe there's some custom cable they will sell you.  But why should you have to buy extra garbage just to get photos from your camera into your computer?  The camera should come with a cable that plugs directly from the camera into a USB port.2.  You have to take the battery out of the camera to charge it.  Or buy an AC adapter to plug into the dock.  Again, Sony makes you choose between a bad user experience or spending more money for accessories to achieve a decent user experience.3.  This also means that when you travel, you have to pack the battery charger and dock in addition to the USB cable (that plugs into the dock).  It boggles my mind that they wouldn't just stick a micro-USB port on this camera so all you'd need is a micro-USB cable to charge the camera and transfer the photos simultaneously.  And yes, micro-USB can handle it.  My BlackBerry has a 3.2MP camera and a battery that has more than twice the capacity of the Sony camera.  And the required circuitry can't be too large, considering my BlackBerry is smaller than this camera.The only excuse I can think of is that Sony wants to force you to spend more money on accessories.  And they are counting that the \"average user\" doesn't realize that there is a much simpler and convenient solution like micro-USB.  The other possible excuse is just stupid corporate decision-making trumping good user experience.Either way, I feel completely burned as a customer.  I wanted to return this study in poor user experience, but I had misplaced the battery charger and I didn't find it until it was too late to return it.  Yet another reason to hate all these extra parts you have to keep track of...Worse still, we downloaded our first batch of photos only to find that they were very poor quality.  A lot of blur and grain because it wasn't a brightly lit scene.  The only time I have gotten decent photos out of this thing is when there is a lot of ambient light.Garbage.", "Date": "September 24, 2009"}, {"Title": "Sony cyber-shor DSC-T900", "Author": "Kenneth Tzou \"Man Utd Fan\"", "ReviewID": "R2JKZ2PL6JNDLQ", "Overall": "4.0", "Content": "Too bad this camera does not come with any carrying case, with these kind of quality, a lot more pictures can be taken with proper carrying cases.  The Sony cases that sold separately can't be clipped on.", "Date": "October 22, 2009"}, {"Title": "Buy it now!!", "Author": "J. Bailey", "ReviewID": "R2JJ5UFBQFTBGI", "Overall": "5.0", "Content": "Buy this camera.  Small and easy to use.  Took it on a trip to Europe.  Worked great and took great pictures.  In auto mode, it does all the work for you and just takes a great picture.", "Date": "September 28, 2009"}, {"Title": "The Hybrid I've been waiting for.", "Author": "J. Watts", "ReviewID": "R2KE41WIQCZIZJ", "Overall": "5.0", "Content": "I, like many, have been searching for a device that successfully combines the camera with the camcorder. My new Sony T900 was delivered last week and it's exceeding many of my expectations. The large touch screen on the back allows the design to be simple and intuitive. I thought I would miss control buttons on the back, but I really don't and actually the complete opposite, it's a great feature of the camera for me. The design of the T900 easily fits in a pocket and is definitely on the sleek and compact side of things. Camera feels solid and well built.HD Video Recording:Simply toggle the switch to the right and you're in movie mode. Outdoor shooting in good light produces some very impressive video. Displayed on a flat screen, I'd have to say this little camera easily out performs any other Point and Shoot camera I've tried. Low light shooting really surprised me, and although you can begin to see some digital noise in real dark areas of the video in a low light situation, it's not bad at all, I'm really impressed. I would not hesitate in buying this camera again or recommending it to all my friends. Zoom during video moves at one speed (unlike a camcorder where you can control the speed that you zoom in and out, this could be considered a pro or con depending on your individual taste), but it's a good, moderately slow speed that brings smoother zooms to your video. Audio is crisp and clean and records in stereo, not may P&S; cameras do that. After all, part of the HD experience has to include great audio and this little camera delivers. Shooting video may take a little getting used to because the T900 is so much smaller and lighter than a camcorder, extra thought must go into keeping the camera still and keeping your motions smooth during panning. However, the great optical image stabilization works great on the T900 in movie mode.Still Photos:Like video recording, outdoor and good lighting produce some beautiful photos. Indoor and low light are not as good but I've found the \"Twilight Portrait\" scene mode produces some decent photos. I primarily view our photos on a flat screen, and the 16:9 picture mode is great for landscapes and scenery shots. Even though it's not an Ultra Wide 28mm lens, the wide angle equivilent of 35mm will still give you great landscape shots. Sure a larger zoom would be nice, but considering the slim design, 4X is pretty good and the macro mode works fantastic on this little camera. Overall, for a non-protruding 35 - 140 mm lens, this is really a nice range, great for landscapes and portrait work.Battery life does seem a little short, but I've been shooting a lot of video and spending a lot of time reviewing on the large touchscreen. Definitely need a back up, and I like the US version of the battery charger. Prongs fold out and you simply plug it in the wall (No Cord Mess). I also picked up an extra battery. I did a test of just recording video and I recorded 63 minutes of HD video, the highest quality before I had to recharge the battery.Overall, I'm very satisfied with my purchase. The video and photo quality are impressive. I personally don't think there's anything on the market right now that matches the T900 in the following areas: sleek thin design, great HD video, great still shots, easy user interface, and the \"most pocketable\". It's not the top of it's class in either category, but when you want a camera that has all of the above criteria, you can't go wrong with the T900. As I stated in the title, it's the hybrid camera I've been waiting for.", "Date": "August 29, 2009"}, {"Title": "No still picture during video", "Author": "K. Tze", "ReviewID": "R14J2VIFSQUWHZ", "Overall": "4.0", "Content": "Unlike the T-500 , one cannot take up to 3 still pictures during a video recording. This function was very helpful and I regret to check the specs. of the T-900 for it before buying .", "Date": "August 12, 2009"}, {"Title": "Great picture quality, Awesome video, easy to nav, battery...eh", "Author": "Pam.I.Am \"Art & Soul\"", "ReviewID": "R3UOOCTL0YADU1", "Overall": "5.0", "Content": "The quality on this camera is great. The pictures come out looking crystal clear on the camera and on the computer. I tried the Nikon L100 before this one and needless to say I returned it to Bestbuy and bought this instead (grainy pics, bulky). The best choice I made :). The HD video is a unbelievable. The only bad thing about this camera is the battery life. I charge it every night because it drains throughout the day. I plan to get another battery. Other than that this is a very good camera, well worth the money.", "Date": "July 30, 2009"}, {"Title": "Great Camera", "Author": "Raymond Chow", "ReviewID": "R2K1RM1LQH6BGY", "Overall": "5.0", "Content": "Bought this camera at dell with a coupon that brings the price lower than amazon's price.  Camera is great and the HD 720p video mode is by far the best.  The 4x zoom in video mode does not loose focus or quality by zooming in or out.  However shooting in HD does take up space on the memory stick duo.  Prepare to invest in a 8GB or 16GB memory stick.  I did discover that shooting with the red eye setting on faces caused more red eye pictures.  Put the setting on auto an now everything is fine.  Other than that no other complains.", "Date": "June 5, 2009"}, {"Title": "Bad battery", "Author": "Jose Humberto Esquivel Salinas", "ReviewID": "R3FTBU7UD83Y12", "Overall": "3.0", "Content": "It is a great camera, it takes great pictures. The only problem is the battery. I hate it because it doesn't last an hour.", "Date": "December 12, 2013"}, {"Title": "The best", "Author": "jreed", "ReviewID": "R1K0EYRMPGQWXT", "Overall": "1.0", "Content": "Had this camera before that I paid $400 for but it broke when I seen this one had to have it", "Date": "October 8, 2013"}, {"Title": "Sony Cyber Shot DSC-T900", "Author": "Mae Kennedy", "ReviewID": "RF1NZTRKUX9V9", "Overall": "3.0", "Content": "The holding strap for the camera is broken ( there is no way to attach a strap to hold the camera. The front screen of the camera is scratched.  Cosmetically the camera screen looks totally different from picture. None of this was mentioned in the advertisement.  The camera takes good picture.  The touch screen menus seem to be veryslow when trying to swipe.", "Date": "September 16, 2013"}, {"Title": "Nice Gift", "Author": "DeathBySnuSnu", "ReviewID": "R1P0YA2P397WLF", "Overall": "5.0", "Content": "I gave it to my sister when she was pregnant. She apparently loves it and uses it more as a camcorder. The video options seem to be pretty good on this camera.", "Date": "August 31, 2011"}, {"Title": "Sony Cybershot", "Author": "Bargain Shopper", "ReviewID": "R3VPGNPGG2NUK2", "Overall": "2.0", "Content": "Looks great but its not worth the money. Takes a long time to capture an image and the battery wont last more than 1 1/2 hours.", "Date": "July 26, 2010"}, {"Title": "Great camera", "Author": "Ben", "ReviewID": "RKIUE98INHINE", "Overall": "5.0", "Content": "Very good camera. Takes nice picture and especially HD video. Body feels very solid and durable. I also like the brushed metal feel to it. Stereo video recording! You can zoom in while videorecording! Would highly recommend.", "Date": "February 24, 2010"}, {"Title": "Sony cyber-shot DSC-T900", "Author": "S. F. Brosnan \"casual shopper\"", "ReviewID": "R311IQSQ9H397C", "Overall": "5.0", "Content": "Great camera, everything it was advertised to be , rec'd new in factory sealed box, great price", "Date": "January 17, 2010"}, {"Title": "great camera", "Author": "C. Enriquez", "ReviewID": "R1QD4MUOYX4GMX", "Overall": "5.0", "Content": "i've owned 2 other cybershots before this one. i love how they look. i paid over $500 for each one. they were stolen from me. so i was in the market to buy another one. i love this camera. its real easy too use. awesome picture quality. sleek look. doesnt cost that much for a cybershot.", "Date": "December 19, 2009"}, {"Title": "You won't want to share shapshots without retouching each one...", "Author": "HottWater \"Hottwater\"", "ReviewID": "R3EEIAXP3IU8GF", "Overall": "2.0", "Content": "As I sit here for the umpteenth time retouching pictures that were taken by this camera, I wanted to write a review warning other buyers.No doubt, this camera has the coolest design, easy touchscreen controls with simple menus, and an amazing video function that allows you to zoom while filming and looks great (HD) on playback.But you will be sorely disappointed by the blurry, overexposed photos that are produced by this camera. I'm no novice; I took a photography class in junior college, but I'm definitely not an expert. Still the photos from this camera annoy me so much that I never carry this camera with me to holidays, parties or anything else - if I do, it stays in my purse because it's seriously not worth the trouble.  I have literally stopped being the person with the camera because I don't do anything with the photos afterward (because they suck)! Even on auto-focus, there are blurry rainbows around peoples faces, anything white in the picture is completely blown out exposure wise (glare, hot spots, etc.).I've tried to create custom settings to control for the overexposure, but that only made the situation worse.It's really tragic because the video and usability are exceptional on this camera.  Nevertheless, I'm going to try to get a replacement since I got the warranty and hope that this is just a dud or something. From the other reviews, it doesn't appear that's the case.Sure, you'll impress your friends with the touchscreens and video, but I swear you won't be sharing too many of your pics on Facebook or with friends (unless you spend time retouching each one).", "Date": "December 2, 2009"}, {"Title": "Love It", "Author": "S. Joseph \"ME\"", "ReviewID": "R3ED7P4YNFFFE3", "Overall": "4.0", "Content": "This is my first digital camera and I love it.  The picture quality is very clear and you can even record for long periods of time.  My only qualm is that it's completely touch screen and I'm worried about the screen cracking.  Other than that, it's a great product.", "Date": "September 29, 2009"}, {"Title": "Not yet sure if it's a keeper.", "Author": "The Count", "ReviewID": "R2KTF0MH32TCK1", "Overall": "4.0", "Content": "Had this camera for about a day now and tested it on a variety of subjects. Style and handling are very good, as is the amazingly bright and sharp touch display.As with many digital cameras, i had to tweak some settings to get the optimal results for my personal taste: PGM mode, 200 ISO, vivid colors, auto focus throughout the frame.And yet, it seems that many pictures lack the total sharpness i have expected. even the areas which are focused lack that 'wow, razor sharp' punch. of course you can always add sharping with your favorite software but i was expecting this in a $300+ camera.Still not sure if i will keep this one or try out the brand new Canon PowerShot SD980IS as well, but it does cost $30 more on Amazon at the moment.", "Date": "August 29, 2009"}, {"Title": "Crowd pleaser", "Author": "Daniel Boyden \"Dboyden\"", "ReviewID": "R2O6J8QORNMIGQ", "Overall": "5.0", "Content": "I have had this camera for about a month and never really used it. I recently went to Austin, Tx to see some friends and by the end of the night I had left it out on the table and wandered off. When I came back several people were playing with it and were asking me all sorts of questions. They were amazed by the 720p video and the zoom functionality of it. It is a pretty easy camera to figure out, since I never read owners manuals that is a plus!I am ready for my next outing with it. Great camera!", "Date": "August 25, 2009"}, {"Title": "Great video quality+very good image quality+ease of use=awesome camera!", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "RK9LBAIXWSVFT", "Overall": "5.0", "Content": "I've had my red T900 for a few weeks and here's a list of the things I love, in roughly decreasing order of importance:- GREAT video quality. This camera shoots 720p videos at 30fps, and the quality both indoors and outdoors has far exceeded my expectations. I previously used a T100 but also use cameras from Fuji and Casio for some occasions, and the difference between the T900's 720p high-quality mode and the typical VGA fine mode on other cameras is like day and night. Not only do you get HDTV resolution, the colors are more vibrant and the clarity is just great.- You can optically zoom the lens during video recording. This is a must-have feature for me as I mostly shoot video clips of my kids.- Very good still picture quality. This is no digital SLR, for sure, and the image quality is probably not as excellent as Canon's and Panasonic's compact digital cameras, but it's still very good. I read some reviews before deciding on this camera and I had worries about picture quality, but they were dispelled the minute I reviewed the still images on my PC. Very good contrast and clarity, and they make great prints.- Smile shutter. I never thought I'd buy into this feature, but now I absolutely love it! You can set the sensitivity to three levels, and you can even choose \"child priority\" or \"adult priorit\"! And it really works! This is just totally awesome for taking still shots of my kids. (Smile shutter does not work in video mode.)- Large 3.5\" touch-screen LCD. There're no conventional controls, just touch-screen, like most Sony camcorders. The LCD is 1920x480 in resolution, and the menu text looks a little jagged, but you'll love its brightness, fast speed, and clarity for viewing images.- Fairly easy to use. Sony employs a top-level HOME menu system with sub menus, but it's not too confusing, just a tad harder to figure out the advanced stuff than on an, say, iPod touch.- Stylish and feature-rich. This is quite thin but still features 4x optical zoom with optical stabilization. The zoom also works in movie-recording mode. It takes Memory Stick PRO Duo cards up to 16GB. Battery lasts about 150 pictures with flash. Not bad. It's light-weight so easy to carry in a pocket, too.In short, I love this digital camera. It's perfect for all occasions.[yeah, folks, get the red one!]", "Date": "August 21, 2009"}, {"Title": "amazing camera and seller", "Author": "O. BAJWA", "ReviewID": "R3CE0EPWTGE4O2", "Overall": "5.0", "Content": "this is the great camera i have ever used. its iauto function is good but the main reason i bought it was its HD video quality. that is brilliant. The seller was excellent i received it in 3/4 days", "Date": "August 17, 2009"}, {"Title": "Sony T900 best touch screen camera on the market!", "Author": "Andrea Speeter", "ReviewID": "RU5NIXE5UM7ZV", "Overall": "5.0", "Content": "SONY DSC T900From the easy to use touchscreen to it's simplified chic design this camera is truly amazing!I researched which were the best touch screen digital cameras out there and let me tell you this is it!I have this camera and have never loved a camera more, with 12 MP picture quality is crystal clear even in poor lighting, video quality is HD and unimaginably beautiful especially for a tiny pocket sized camera so whether you are just shooting you and your friends or traveling abroad it's perfect! It has great features - photoshop on the camera where you can access features similar to paint, you can change the colors and there's tons of fun effects. It also has a decent zoom which can even be used while you are filming which is not a feature many pricier cameras encompass. It has a smile detector which although seems like a frivolous feature is so useful! You set it and it waits till everyone in the picture is smiling to take it. It has settings for every type of weather, lighting & a sensor which automatically adjusts to what you are shooting (landscape, portrait etc.) Lastly it is light, compact, sleek and a great buy!", "Date": "August 12, 2009"}, {"Title": "Not bad...", "Author": "Robson Cosmann", "ReviewID": "R36C7RYZORWQX2", "Overall": "3.0", "Content": "The camera is OK... battery goes fast and my old sony camera get colors better tham this one... But still a good camera for the price.", "Date": "June 9, 2009"}, {"Title": "Memory stick!", "Author": "Gerald Shifrin", "ReviewID": "R1PXKLUZHP4QLA", "Overall": "2.0", "Content": "I wish Sony would figure out that we don't need another type of storage media and most of the world uses SD cards.", "Date": "September 25, 2009"}, {"Title": "Battery trouble", "Author": "Sharon K. Allen", "ReviewID": "R1KT3TSCE7CBTM", "Overall": "2.0", "Content": "My daughter discovered when you place this camera in the case toe scerrn lights up when the bottom edge (oppisite the wrist strap) toufches the bottom of the case, when you start to pull the camera from the case the screen goes black, thus uvery time she goes to use the camera it is either dead or very low on battery charge not much use to her with this condition, we sent it to sony they said there was no problem with the camera, we went to BestBuy tried thier display camera and guess what same problem the salesman couldnt believe what he was seeing long story short we have a camera that is useless to us unless you want tochance carrying it without a case by the wasy we have tried 2 different cases", "Date": "June 29, 2009"}, {"Title": "dead in the water with this battery", "Author": "Eli Langer", "ReviewID": "RV2OBEKRBWJ2", "Overall": "1.0", "Content": "this camera despite its appeal, which it has loads of! comes with the most disgracefully poor battery of any electronic device i have ever owned.it is absolutely useless as a camera with a battery that performs like this. and no i dont imagine carrying a pocketful of batteries with me. i have been using the dsc t1 for years and its battery although no larger than the t900s battery outlast it by ten times.  this camera is dead in the water.", "Date": "April 24, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "12.1-megapixel Super HAD CCD image sensor\n4x optical zoom Carl Zeiss Vario-Tessar lens; Optical SteadyShot image stabilization\n720p high-definition movie capture with stereo sound; HDMI compatible\nFace Detection; Smile Shutter technology\n11MB built-in memory; capture images to Memory Stick Duo/PRO Duo Media (not included)", "Name": "Sony Cyber-shot DSC-T900 12.1 MP Digital Camera with 4x Optical Zoom and Super Steady Shot Image Stabilization (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Yc6Hf3W3L._SX300_.jpg", "ProductID": "B001SEQPJ2"}}