{"Reviews": [{"Title": "Best camera for the price", "Author": "S. Boschen", "ReviewID": "R28JO3GYW0K0M2", "Overall": "5.0", "Content": "I bought this camera to replace a broken one for our 4 camera security system. I originally paid over $100 for each camera in the system and found that this one I purchased works as well if not better than the expensive ones. I am very happy with it.", "Date": "September 6, 2008"}, {"Title": "happy and satified customer", "Author": "N. Rai \"nads01434\"", "ReviewID": "R348VE0UX8TQQT", "Overall": "4.0", "Content": "Thanks to the sellers, i found exactly what I was looking for. These cameras works great and I would recommend them to anyone who is interested in purchasing cameras forthere homes.Two thumbs up.", "Date": "December 23, 2008"}, {"Title": "Security Camera", "Author": "JRM \"JRM in Ohio\"", "ReviewID": "R3FM2UDCVEWG3H", "Overall": "3.0", "Content": "The camera worked fine (at first), then it bit the dust for reasons unknown.  I have sent it back to the supplier and we'll see what they have to say.  There attitude was \"send it back and we'll test it to see what's the problem\".  NOT....send it back and we'll send you another...I'm waiting to see what they say.---------------Later...they did send a new unit...but said the power supply was incorrect and I needed a different one...I am pretty sure it's the one they sent with the unit originally.  They said they didn't sell one like that but I found one that seemed to be an exact match on their web site..  Perhaps I'm wrong but that's my story..I just bought a new one from another vendor.  The camera works fine now.", "Date": "June 16, 2009"}, {"Title": "Video Security Camera", "Author": "mirage", "ReviewID": "R1HQKBNB6UFSZH", "Overall": "5.0", "Content": "So far an excellent camera, great color picture, good coverage. I don't use the night vision feature so I can't speak to that. Only one criticism though, the omni-directional mount that came with it is very cheap and didn't work very well, however I had one from the camera this replaces and I used that one instead. I still gave it 5 stars because the camera itself has been great.Update; I now use it for 24 hour surveillance, it does need a small night light in the room at night which is enough to get a very good B & W image with it.", "Date": "July 24, 2010"}, {"Title": "EXCELLENT!!!", "Author": "SHARI", "ReviewID": "R21IFJECIMKLHF", "Overall": "5.0", "Content": "I gave it for a Christmas gift and she couldn't be happier, couldn't have asked for a better deal , the price was right here on time quickly um I really like it I think she's happy. and believe me it is very hard to please her thank you the product work great and I would recommend it over and over again!!!!  Yaaaaaay!  Thankyou , sincerely ShariP.S.  My home security is next, oooooh?!  I can't wait !!!  ;-)", "Date": "January 15, 2013"}], "ProductInfo": {"Price": "$139.95", "Features": "Affordable day night vision video CMOS security camera\nAluminum housing for indoor outdoor application. Metal body housing, mount and sun shade\nHorizontal Resolution: 420 TV lines. Camera Lens: 6.0mm. Signal System: NTSC standard\nIR Illuminators: 36 infrared LED. Built-in light sensor controls IR activation\nPackage Includes: 1 x CMOS Bullet Camera, 1 x metal Bracket, 1 x 12V DC 500mA Power Supply and 1 x security warning sticker", "Name": "VideoSecu Infrared Day Night Vision Weatherproof Outdoor Home Video CCTV Bullet Surveillance Security Camera with Power Supply and Security Warning Sticker CTA", "ImgURL": "http://ecx.images-amazon.com/images/I/51atLkuzkNL._SY300_.jpg", "ProductID": "B001BMIM4C"}}