{"Reviews": [{"Title": "Think before you buy", "Author": "Emily A. Bagley", "ReviewID": "R11Q95JFTGHBP2", "Overall": "3.0", "Content": "This camcorder is reliable and really easy to use! There are some problems with it though, like the fact you can't see what you are taking a picture of or making a video of. It's really light in weight, but that make it really hard to keep it still. the microphone is not very sensitive, so quiet sounds will not pick up so it will make your video sound silent. for a little more money you could get a camcorder that has a viewing screen and far more memory. it has  only 16MB of memory, and it's flash memory so if the battery dies or you chance the batterys before you load the your picture or videos to the computer it will disappear.  Overall this is a great camera if you can overlook the drawbacks and quirks.", "Date": "July 7, 2009"}, {"Title": "Software does not work.", "Author": "Paul C. Laughton \"X\"", "ReviewID": "R1M2XFE39E34W1", "Overall": "1.0", "Content": "If have installed the software for this camera on three different Windows XP computers. The software did not work at all two out of three of the computers. I get the splash screen and nothing more. I have to kill the program with ctl-alt-delete. The software did work once an a third windows XP program. It got far enough for it to down load one video. The software never worked again on that computer. It did the same thing as the other two computers. It would show the splash screen but never get to the select task screen.This camera is junk without functional software.", "Date": "March 29, 2010"}, {"Title": "Amazing $10 for a Video camera and it's not worth the price!! Dont buy this....at any price", "Author": "markh", "ReviewID": "R1NERAG5OTM73T", "Overall": "1.0", "Content": "Dont even bother orderng this - the pictures are aaaawfuuuul.You will toss the camera within an hour just like I did.", "Date": "February 15, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Digital Camcorder Silver\n3 in 1/ Digital Camera Video PC-Web\nCompact Size/Built-in Microphone\nSnap N Share Software\nUpload to You Tube Facebook and MySpace at the Press of a Button", "Name": "Sakar 30690 Digital Camera Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/31esfO6HNcL._SY300_.jpg", "ProductID": "B0019RWMT0"}}