{"Reviews": [{"Title": "One of the best point & shoots", "Author": "J. BURGESON", "ReviewID": "R3VBREF7BK8486", "Overall": "5.0", "Content": "Out of production for years, the Yashica/Kyocera T4 Super is one of the best point & shoots out there. At its heart is its fixed focal-length 35mm f 3.5 T* lens by Carl Zeiss, which rivals many full-size cameras. Combine that with its sold construction and its unusual waist-level \"Super scope\" finder (great for getting candids), and you've got an exceptional camera. Very accurate focusing and exposure mechanisms.", "Date": "April 21, 2010"}, {"Title": "Stoked", "Author": "allison woodruff", "ReviewID": "R1CSH2XSU5WQYP", "Overall": "5.0", "Content": "Just shot my first roll of kodak portra and couldn't be happier with the results. Crisp, clean images with great depth. Gonna carry this thing with me everywhere!", "Date": "October 11, 2013"}, {"Title": "japan from usa", "Author": "mousetv", "ReviewID": "R1FJ8NOU0RH1ER", "Overall": "4.0", "Content": "very very thanks.Since it was the camera which was being looked for, I am glad.United States from Japan,Osaka-City.", "Date": "January 17, 2012"}, {"Title": "It's fun if you find it cheap.", "Author": "Noah Boyer", "ReviewID": "R5AD56LE5W9QR", "Overall": "3.0", "Content": "I saw this camera at Goodwill for $4.99 and grabbed it immediately. Been lusting after the T4 for a while, but there was no way in hell I was going to pay what these go for on eBay. I don't have the superscope, but it has the same lens and yields the same results.I'm two rolls in and I have to say I am quite underwhelmed. The colors are entertaining, the sharpness is reasonable, but this thing has not stood up to the praise it has been getting. It's simply an ok point and shoot with sketchy focusing. I will be hunting for an Olympus Stylus Epic 2.8 next as I hear good things about it as well. Hopefully I can also find one for $4.99 ;-)", "Date": "June 4, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Body in Black, autofocus, Carl Zeiss Tessar 35mm, f/3.5 lens, 4 elements in 3 groups, T* (coated).\nAuto-exposure, Integrated flash, Programmed shutter (1s-1/700s)\nExp. range: EV 3,5-EV 17 (ISO 100); Superscope\nFilm speed DX coded ISO 50-ISO 3200; Infrared active multi-autofocus system\nBattery: CR123A", "Name": "Kyocera Yashica T4 Super Weatherproof Camera with Carl Zeiss Tessar T* 35mm F3.5 Lens and Waistlever Super Scope Viewfinder", "ImgURL": "http://ecx.images-amazon.com/images/I/519MH8EghjL._SX300_.jpg", "ProductID": "B001KPY578"}}