{"Reviews": [{"Title": "Upgrade to a Handheld", "Author": "cirquedusophie \"cirquedusophie\"", "ReviewID": "R2I8RNZ509JTYZ", "Overall": "4.0", "Content": "We recently purchased this handheld monitor to replace a standard plug-in monitor.  The plug in was tough because we had to move it from room to room but we got by.  We looked at alot of handhelds and purchased the Swann due to price and the underlying technology.  Swann makes very good and technologically sound camera and monitoring devices.  They are established in providing security cameras generally and it seems like the baby monitor is a natural line extension.  That said I rated this monitor a 4 out of 5 mainly due to the rather flimsy construction of the camera and handheld monitor case.  The plastic feels rather cheap and I fear the baby getting hold of the monitor and slamming it to the ground.  The clip on the monitor is very novel in that it can be used as a belt clip or as a stand if reversed.  It is still early but we are pleased with the clarity of the sound and the picture works well through walls.", "Date": "December 20, 2008"}, {"Title": "nice design, but very limited range", "Author": "Jim \"Dr. Jimmy\"", "ReviewID": "RUHCSNT2357J2", "Overall": "2.0", "Content": "I bought this monitor in November, but returned it within 30 days.  The screen was very clear, but the range was extremely limited.  I live in a small three bedroom apartment, and when I put the receiver in the living room, the audio cut out completely, and the video kept dropping out.  The distance was about 25 feet.  I do have a wireless network, but I tried the monitor again at a hotel (the baby was in the room, and we tried to use the pool about 40 feet from the front door).  The hotel had no TV or electronics to interfere, but the monitor again dropped out at about 25 feet.  As before, the audio dropped out first, then the video about five feet later.  It was basically unusable for us.", "Date": "February 3, 2009"}, {"Title": "sound quality a deal breaker", "Author": "mavos", "ReviewID": "R1I8DDLG6LM8E3", "Overall": "3.0", "Content": "After doing a lot of research on video monitors I finally settled on this one.  We have a wireless router and really wanted a video monitor that wouldn't interfere with that.  It did not interfere with our router at all, which was a plus.  However, my biggest complaint and the reason why we decided to return it and go with a different product (Safety 1st True Vision) was the VOX sound feature.  The parent unit automatically turns sound off when no sound is detected through child unit (the camera).  When it detects the child making sound it is supposed to automatically switch back on and you can hear it.  If this feature actually worked properly it wouldn't be so bad.  However, when we tested it my baby started crying (very loudly) I actually heard my daughter crying downstairs way before the microphone picked it up.  And at times didn't pick up the sound at all.  The camera was less than 3 feet away at the time. During the same test our daughter was playing happily and very few of those sounds were detected either.  My husband and I decided to test it with our own voices.  He went upstairs to our baby's room and talked at various volumes.  Most of the time the sound did not kick back on until he was mid-sentence (I could see his mouth moving on the screen but no sound was coming from the unit).  After having a sound only monitor for almost 3 years with our older daughter we were used to having continuous sound and the cutting in and out (and not picking up of sounds) was very frustrating for us. We just didn't feel like we could trust the unit to work and alert us when our baby was crying.  We sleep with a fan on in our bedroom year around for white noise, and our kids rooms are at the other end of the house, so we rely on the monitors to be able to hear them. If there had been a way to turn this feature off, then we would have definitely kept it. Because we like just about everything else about it.The video was very clear and color, although somewhat washed out was decent.  The night vision worked well.  I liked that it came with rechargeable (cordless phone type) batteries.  The screen was a decent size.  The price was good.  The camera was easy to adjust.  You can push a button to turn the video off and it will automatically come back on when sound is detected (that is IF sound is detected). We didn't keep it long enough to test battery length.So I guess the bottom line is that if you are looking for a video monitor just for the video aspect and aren't as concerned about the sound quality, then this would be a good product.  However, if you are like us and want a unit that has both video and sound quality then I would keep looking.  We purchased a Safety 1st True View and are happy with it so far.  It has a few features we would change, but I don't think there is a perfect video monitor out there on the market right now for a decent price.  Hope this was helpful.", "Date": "June 30, 2010"}, {"Title": "COULDN'T DO WITHOUT IT!!!!!!", "Author": "Kristina Larson \"Happy mommy\"", "ReviewID": "RBDTPLY3V72SA", "Overall": "5.0", "Content": "I had just an audio monitor before my mother-in-law bought me a different video monitor.  I did not like the video one she bought, so I took it back and ordered this one.  I AM SOOOOOO impressed with the quality of this monitor compared to the other video monitor.  This is a great monitor with several excellent features.  We have wireless internet, etc. in our home and I've never had any interference.  The picture quality is great.  At night it automatically switches to night-vision.  Most video monitors you have to manually switch on the camera each time.  There is a button you can press (I use this feature during the night to keep our bedroom darker) so the picture turns off unless there is noise.  If there is noise it automatically triggers the picture back on so you can see your baby.  There is even a music feature.  You can touch a button or your receiver and music plays from the camera (I do not use this feature).  I turn it off while I'm at work, and charge it at night while I sleep on my night stand.  It comes with a re-chargable battery pack.  I've had this for 2 months now and would not use anything else.", "Date": "February 27, 2009"}, {"Title": "The BEST video monitor", "Author": "J.Bailey", "ReviewID": "RAI88AXMOUJS8", "Overall": "5.0", "Content": "I researched as many video monitors as I could before finally purchasing this one and I am definitely not disappointed. This monitor is simply amazing! The biggest selling factor was originally the digital scramble. I love that it doesn't interfere with our wireless router and the fact that there isn't someone out there watching my son sleep is reassuring.Both units have a battery option. The battery life on the receiver is good and while the range isn't incredibly huge, it works for what we need it to. I never thought I'd need the battery option for the camera unit, but it's fantastic when my son falls asleep somewhere that doesn't have an outlet close by. Both units (and power cords) travel well and are extremely durable.The night vision LEDs provide a nice clear picture without being disruptive to a sleeping baby. They are barely noticeable, but definitely make a difference in a pitch black room. The camera itself can pivot at different angles which works nicely if your baby is a mover in the middle of the night. The only negative is that it clicks fairly loudly as you move it.It is extremely user-friendly! Coming out of the box, you can plug both units in (the handset needs to charge) and just go. No need for the instructions unless you want to use the lullaby function.Honestly, this is an incredible monitor at a very reasonable price.", "Date": "March 13, 2011"}, {"Title": "Barely Ok.", "Author": "Borisovich \"BL\"", "ReviewID": "R2QQEZIJHQEX2J", "Overall": "2.0", "Content": "The main issue with this monitor was that the night view functionality was very weak.  In a dark room, the camera didnt pick up anything that was further than a couple of feet away.  I realize that we would probably be using a night light, but I would expect a better night vision without any additional lighting. The design of the camera and receiver is fairly ugly, not what i would expect for a typical \"baby\" product.  I did not expect any interference issues with my wi fi network, but i didn't try running it and talking on a cordless phone at the same time.", "Date": "February 8, 2010"}, {"Title": "excellent baby monitor", "Author": "momshopper", "ReviewID": "R2VF4FTVB1LFID", "Overall": "5.0", "Content": "This is my 3rd baby monitor and by far the best. The screen is in color and the sound is great. There is no static. It has about the same range as the other ones I have had.", "Date": "February 9, 2012"}, {"Title": "False advertising", "Author": "Gary S. Fye", "ReviewID": "RF1DAS16UKG1Q", "Overall": "4.0", "Content": "I got the camera and it works like it should as advertised but Amazon selling this product I was very disappointed, as far as I am concerned they have lost a customer merely by stating this was a brand new unused product. When I received the camera you could tell the box had been opened and upon removing the viewing portion of the system I could see that it was scratched and the system had a dead pixel, the only saving grace is there was a protective covering over the view screen which prevented the scratches from penetrating the viewing area. I did not send the unit back because it is working for what I needed. It did perform as advertised but as far as being brand new not even close.", "Date": "February 18, 2010"}], "ProductInfo": {"Price": "$199.99", "Features": "2.4 GHz Digital Modulation\n2.36 inch TFT LCD Color Monitor\nUp to 12 feet of Night vision through 9 Infrared LED's\nBuilt-in Lithium-ion battery charger on monitor\nSafe and Secure signal cannot be intercepted\n2.36\" Color Lcd Monitor\nFeatures Built-In Night Light\nDigital Wireless Technology Means No Interference", "Name": "Swann SW233-BDM ADW330 Digital Wireless FamilyCam Monitor and Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41TU5d0sXgL._SY300_.jpg", "ProductID": "B001D0BZ6E"}}