{"Reviews": [{"Title": "Buyer Beware", "Author": "C. Doak", "ReviewID": "R2XF32G5O2AJS2", "Overall": "1.0", "Content": "I am rating the camera, not the seller. I bought the blue version of this camera from Wal-Mart when my expensive digital camera stopped working while I was on vacation. The camera has a \"digital lens\", not a real one. Basically, the problem is that it is a pinhole camera. You MUST hold the camera perfectly still for a couple of seconds for the camera to record the image. NONE of the 200+ photos I took were razor sharp, most were blurred beyond recognition until I figured out what was going on. Please note: 1) I took this camera back to Wal-Mart the next day for my money back and used the camera on my cell phone which I am very happy with! 2) I am not an inexperienced photographer, I have been taking pictures with an SLR camera since the early 80's. I have both a film and a digital SLR, and a Powershot G9. Do NOT buy this camera.", "Date": "October 15, 2009"}, {"Title": "Junk camera", "Author": "Leah \"leahjane10\"", "ReviewID": "R1ED7C7OY455P", "Overall": "1.0", "Content": "This is literally a piece of junk.  I bought it because it was $39, figuring that it would be worth it if it lasted just one year.  After taking the first picture, I realized that I had to return it.  It's VERY slow, the pictures look strange, kinda cartoon-like, even.  This camera would absolutely NOT get a clear picture if the subject moved.  Pictures would show trails of light from the slow flash.Other cons, besides the terrible pictures:- It has no lens cover, it's just open to the world's dust.- The SD card slot doesn't have a cover, either.- It does not come with a paper user's manual.  You have to download the software and get it from the computer.  Not a huge issue, but a pain.- The USB port is on the BOTTOM of the camera.- There is no quick-delete button.- It uses 3 \"AAA\" batteries.- poor quality materials. It feels like a toy.Vivitar should be embarassed!", "Date": "November 10, 2009"}, {"Title": "Cheap camera", "Author": "Scott Haggard", "ReviewID": "R1VX5HOPAW89BJ", "Overall": "1.0", "Content": "The ViviCam 5024 might be most useful as a starter camera for a 4-6 year old.Pros:- Accepts SD and SDHC (high capacity, above 4GB) memory cards.- Has a rather nice 2.4\" LCD.- Semi sturdy construction, doesn't feel overly \"cheap\" in your hand.- Easy to get pictures off of camera with included USB cable, plug-and-play, software not required.- Saves pictures in JPG format, highly compatible.- Comes with wrist strap.- Has a macro mode, but it's activated using an odd manual switch on the side of the camera, and I can't speak to the quality of this mode.- Available in colors like pink, blue, black, purple.- Built in flash.- Anti-shake feature works decent.Cons:- Picture quality is not so good. It's not the worst in the world, it's actually sort of decent, but you might expect better from a 5.1MP like this.- IMPORTANT!!! Can't set date/time on the camera. This means none of your pictures will have correct date/time stamps (in the EXIF data). This is probably the single biggest gripe I have with this camera. The camera just doesn't have the capability, there is no menu option for doing this. The user manual conveniently omits any reference to doing so, and I've done numerous web searches looking for answers. But the camera has very few options/settings, so the simple truth is that you can't do it.- No optical zoom, digital zoom only. It means that you don't get the nifty lens that pops out the front, and it also means that you shouldn't bother zooming any of your pictures unless you want to make them grainier than they already are.- Shutter button (press it to take pictures) is a bit small, a.k.a not super kid-friendly.- Most young kids I know will have a hard time holding the camera still long enough to get a clear picture, so I suspect most pictures will be blurry/smeared.Other Thoughts:As far as point-and-shoot cameras go, if you are used to a $100-$150 range camera, or even more, you will likely be disappointed with this camera's lack of features and quality. If you consider this to be a toy camera, it's much easier to like. As a starter camera for kids, I wouldn't bother getting more than a 1GB or 2GB card, even these will hold quite a few pictures and they can be had for $5-$10 or even less. If you can get this camera on sale, clearance, or with a rebate, that's probably your best bet. I paid 30% less than what I'm seeing it for here on Amazon.com right now, and I'm debating returning the two I bought for my 4 and 6 year olds (girl and boy).", "Date": "September 11, 2010"}, {"Title": "ok camera", "Author": "BigRedBooks", "ReviewID": "RZL3ISPCPBBI9", "Overall": "3.0", "Content": "It didn't take long for the flash to stop working and the pictures are not very clear, but its a good camera for a 7 year old.", "Date": "November 26, 2012"}, {"Title": "Junkitar", "Author": "YourAreMySunshine", "ReviewID": "R13OFRR95FJ1LS", "Overall": "1.0", "Content": "I agree with the folks who rated this one star:  it is junk.I paid @ $65 at Big Lots for the camera (it's gone down to half-price within a year of buying it) and a memory card. I should have put the money toward a GOOD camera.Within the first 6 months one of the very small plastic tabs for the battery door broke off and now the door has to be held shut (maybe a strong rubber band would work).  Picture quality?  My cell phone-a very basic handset-takes better pictures.  Had to change back to my cell phone to ensure I captured a couple of clear wedding photos to remember a friend's wedding-how sad!  Anti-Shake mode must be selected every time the camera is turned on-why isn't that the default?  The memory card is very difficult to remove and forget about any kind of troubleshooting assistance.I wouldn't want anyone to waste even $5.00 on this thing.", "Date": "April 4, 2012"}, {"Title": "What a Piece of Junk!", "Author": "Gondorf", "ReviewID": "R3BGPXH5GNAE8L", "Overall": "1.0", "Content": "To me Vivitar used to be a good product now it means junk.Granted I did not pay a lot for this unit ($35) but I really expected to last more then a year.  That was it one year only, and it just stopped working.The camera was used infrequently, it looks like I took a total of +300 picture.The camera took fairly good picture and was easy to use but to only last a year.I doubt I will buy a Vivitar product.The early failure of digital products is the norm now.  We really live in a dispoable world.  Too many of the digital product make today last just to the warranty or just a little longer so the company does not have to deal with the return of their  piece of junk.I guess I can not expect a new camera to last 20 years like my old Canon.", "Date": "March 15, 2012"}, {"Title": "0 Stars for Vivicam", "Author": "Kato \"kato13\"", "ReviewID": "R3M0FO9DKRDSFX", "Overall": "1.0", "Content": "Vivitar Vivicam 5024 5.1MP Digital Camera, 8x Digital Zoom, 2.4\" Screen, SD Card - PinkMy sister recieved this camera from her son last christmas. I have never seen such poor quality photos from any digital camera. I have tried adjusting settings and still get blurred images. Too bad. One of my first cameras was a vivitar and it always took such great phots I was surprised at the level of crappiness from this cute little purple camera.Sadly, she didn't want to return it for fear of hurting her son's feelings. So she's stuck with a useless piece of purple plastic. DO NOT BUY THIS CAMERA EVEN FOR YOUR CHILDREN.", "Date": "November 8, 2011"}, {"Title": "Do NOT buy", "Author": "JJandG", "ReviewID": "R2VN9S06F6IA5B", "Overall": "1.0", "Content": "Very disappointed with the product my son received as a gift and dealing with customer service of Vivitar.  The very first time I tried to download the pictures from his camera the entire camera locked up.  Only one picture loaded they the camera would do nothing.  I pushed the on button and nothing happened.  Replaced batteries still nothing.  I emailed support and got NO RESPONSE!  So, looked up the warranty information and followed the directions.  I mailed the camera on May 3rd, today May 13th I called to check on the status.  I had A LOT of trouble understanding the customer service person.  When she spelled things using words to represent letters, she went so fast I still couldn't understand.  Then she told me I should have called before mailing the camera \"you should always call before mailing\" she said.  No where in the instructions does it say to call.  She said she is sending a new camera out, but I will be very surprised if it lasts.  My son had been missing his birthday present and I really hope it doesn't break right away.", "Date": "May 13, 2011"}, {"Title": "NO SOUND WITH VIDEO", "Author": "gregory", "ReviewID": "R2WL5YOWJ3YIHT", "Overall": "1.0", "Content": "As I read through some of the reviews, I was not surprised with them. I bought this camera for to take videos. The one option I bought the camera for and it does not do that. As another person stated, nowhere in the product information anywhere does it state in the video mode it has no sound. I would like to think that would be some important information not left out. Never again will I buy anything from Vivitar. I suggest noone else buy from them either.", "Date": "April 9, 2011"}, {"Title": "Toy camera okay for young children", "Author": "Kevin", "ReviewID": "R37J3QU5L9RZRY", "Overall": "2.0", "Content": "If you are looking for a beginner camera for a child under 10 years old, then this will probably work just fine.  It should not be considered as a camera that you would use to take your own vacation photos.", "Date": "June 13, 2010"}, {"Title": "Horrible, terrible, awful", "Author": "Devon Adams \"writer and bibliophile\"", "ReviewID": "RZBD48BKPMX98", "Overall": "1.0", "Content": "This is, hands down, the worst digital camera I have ever used. We purchased it for work, just to use to take photos of electrical boxes and other work-related items. Every photo is blurry (with and without the stabilization) and, if you use the flash, it blows everything out to the point of being unrecognizable.We've played with all of the (very limited) settings, but nothing helps. I have an old Sony with the same megapixels, and it is so far superior, it isn't even comparable. The Vivitar has a far inferior chip, lens (as another reviewer noted - essentially a pinhole lens) and interface. The thing doesn't even focus when you press likely on the shutter button like every other camera out there.The worst part is that we can't even take it back since we (stupidly) inscribed our company name on it before testing it out. Lesson learned.", "Date": "June 7, 2010"}, {"Title": "Great for Kids!", "Author": "C. Brueckman", "ReviewID": "R3Q3L8KW0APBV8", "Overall": "4.0", "Content": "My parents bought this camera for my 9 yr old daughter and she has had more fun with this camera than any gift she has gotten in a long time.  It may not be a professional grade quality camera, but for the price, it is a great gift for kids.  She has taken some great pics with it, and more importantly, is having a great time with it.  Great affordable present for kids.", "Date": "February 8, 2010"}, {"Title": "Junk camera.", "Author": "Eddie950 \"Ed\"", "ReviewID": "RZYCX4ZHB29LP", "Overall": "1.0", "Content": "NO SOUND WITH VIDEO!!! No where does it state online or in the manual that there is NO SOUND for the video mode. I confirmed this with their customer service. This camera is useless indoors, and I mean completly USELESS! Terrible! Spend a few dollars more and get a much, much better camera. NEVER AGAIN VIVITAR!", "Date": "December 29, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "2 4IN TFT PREV SCREEN", "Name": "Vivitar Vivicam 5024 5.1MP Digital Camera, 8x Digital Zoom, 2.4\" Screen, SD Card, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/512sSJPW4RL._SY300_.jpg", "ProductID": "B001VIM2RE"}}