{"Reviews": [{"Title": "A over-all awesome camera", "Author": "Michele A. Mason", "ReviewID": "RVRGQZ37P11IH", "Overall": "5.0", "Content": "I got this camera about a year or so ago, and I love it. The pictures it takes are great (although it's a little slow in taking them) and I'm almost always carrying it around with me, it's very easy to put in a little pouch in my purse. I've dropped it multiple times and it's pretty sturdy (although apon one occasion it was dropped off a table while it was on and it wouldn't shut so I had to send it in to be fixed which frustrated me a bit).One of my only problems with the camera is that it doesn't have many options, (I.e. you can't crop your pics or change the color of them on the camera) although it can always be done online.", "Date": "March 13, 2010"}, {"Title": "OK for most purposes, but requires some patience", "Author": "dale on the bayou", "ReviewID": "R1F1YLUREV2OJC", "Overall": "4.0", "Content": "I bought this camera to replace an Olympus Stylus, the LCD of which broke after being dropped.The camera is lightweight and thin, and you can barely tell it's there in your pocket.While I haven't broken it yet, it looks a little fragile.Takes fantastic pictures.  I wish I could insert a pic I took with this camera, but I don't know how, or if it's even allowed.  It takes decent video (caveat: I only tried video recording once), but the audio isn't quite there.There aren't very many pre-programmed settings (\"scenes\") but enough for everyday point-and-shoots.To access most of the options, one would have to go through the menu, which can be a bit annoying.  The menu itself I find to be not the most intuitive thing.  Also, it always goes into shoot mode when powered on; I wish one could go directly to display mode.The battery life does seem to be a bit longer than average.  (This and my previous Olympus use the same battery, so I can tell.)Finally, when displaying photos, it doesn't move through the photos as fast as I'm used to with the Stylus.If you can afford it, I personally would recommend going for the Olympus Stylus.", "Date": "November 29, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "0.7\" Super-Slim, All-Metal Body\nFace Detection\nDigital Image Stabilization\nLi-Ion Rechargeable Battery\nAVI Movie with Sound", "Name": "Olympus FE360 8MP Digital Camera with 3x Optical Dual Zoom (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BbA6QSniL._SX300_.jpg", "ProductID": "B001DFJDZE"}}