{"Reviews": [{"Title": "Happy I waited.", "Author": "goodwishes", "ReviewID": "R2TN2HKK0E0FX", "Overall": "5.0", "Content": "I am coming from an Olympus C-8080 and a Panasonic DMC-FZ18.  Both of these are decent cameras, but not quite SLR quality.  Also, the Panasonic is the worst macro camera I have owned.  Since I was looking for more options with macro/closeup photography, I wanted a DSLR.  My old SLR was an OM2n (back in the prehistoric camera days).  I considered getting the E-510 or Nikon D60.  Both are decent cameras, but after seeing pictures, decided to stick with Olympus and wait for the 520.  I am glad I did!I normally have a problem with a bit of camera shake and don't use a tripod.  I just shot 400 pics and not one bit of camera shake!  I was surprised to find out that I didn't even have Image stablization enabled.  It is very easy to hold this camera steady.  The lens and the viewfinder are crystal clear.  I stongly suggest that you get the fastest CF card you can to record your pictures, and at least 4GB. I should tell you though, that I am shooting in both raw and fine jpeg format.  This typically takes longer to write. The xd cards are too slow when shooting raw and fine jpeg.  Another thing to make yourself aware of:  Liveview does not seem perfected in any camera yet.  It may take some time, but it is a bit bothersome, because there is a wait between recording photos when using Liveview.  If you don't mind using the viewfinder,or waiting about 2 seconds between pictures, it's not a problem.  Also, my battery compartment door seems to stick a bit.  May need broken in, or it's just tight.On the plus side:  I have only had this camera 36 hours and already feel totally comfortable with it.  I have heard people say that it's not user-friendly.  I disagree with that statement IF:  you have previously owned and used Olympus cameras.  This camera isn't that foreign when coming from Olympus.  Yes, it takes getting used to the buttons a bit, and my thumb does accidentally hit a button, but heck, I haven't even had the camera a couple of days.  I also suggest that you buy the telephoto lens.  Unless you shoot all wide-angle pictures, you will not be satisfied with this lens package.  Regarding the Olympus lenses ... Primo, very good quality for a zoom/package deal.  Much better quality than I expected.  I like my pictures to be as crisp as possible, with the lowest noise (who doesn't?), so I have experimented with shutting noise reduction off and using software to reduce noise.  The results were good in my test results.  The scene modes of the camera are good.  I haven't used them all yet (I had to put the camera down and get some sleep sometime in the past 36 hours), but am impressed with face detection on, macro, night modes.  The flash is fairly strong.  I have never had a built in flash, which doesn't give some type of red eye or blue eyes in dogs, this has not happened yet with the 520.  Impressive, but I would suggest if doing closeup, that you diffuse the flash, or stand back a bit and zoom on the subject. REVISION:  If you use the Macro nature mode, it seems to adjust the flash a bit. Also, if you like to experiment, play withe the \"Vivid mode\" a bit.  I'm usually not a fan of modes, but in bright sunlight, my colors came out exactly as they should be.If you are considering buying a more expensive camera and are NOT doing professional studio work, I would say; don't waste your money.  Get this camera, because you will be impressed.  If you are doing studio work, I would still tell you to get this camera, but get a better lens.  After all, it's not always about the camera, but it is always about the lens.  Anyone who has ever bought a no-name, camera-store \"pushed on you\" lens, knows what I am talking about.When my next lens arrives, I will post more information under the \"40-150mm Olympus zoom lens\".  Highly recommend this camera!REVISION:  Today, I received the adapter to let me use my old OM-2N lenses. I bought a generic one through ebay and it works just fine.  I attached my old Tamron 90mm SP macro lens and began shooting.  First, be aware that everything has to be done manually.  This may not be practical if you need speed when focusing, unless you have mastered, manual focusing.  I find that I shake the camera more with the heavier, manual lens, but with practice, I think that can be overcome.  In other words, if you own the old OM lenses and don't have the money to get a new lens, buy the adapter and be prepared to make some adjustments.If you have a flash/lighting system and a tripod, those adjustments will be lessened.  I don't think I would do this for the life of the camera, but I would use the old OM lens (especially if you have a high quality one), until I could afford a new digital lens.  I also have the 40-150mm digital lens (the one they give in the package deals), and am very impressed with the quality. I have posted some pictures, so you can get an idea of what this camera can do. If you scroll over the pictures, you will see the pictures I shot with the old OM-2N lens. I didn't make any revisions, so that you can get an idea of how the pictures come out of the camera (no photoshop).", "Date": "July 19, 2008"}, {"Title": "E510 / E520 | Awesome - Gem of the mid level DSLR:", "Author": "HiFi.Mr \"Mr.HiFi\"", "ReviewID": "R30C4BQ12202NT", "Overall": "5.0", "Content": "Though I have E510. I actually tried and tested the E520 as well and picked E510 for the 2 kit lens deal and the extra features E520 has over E510 which I rarely care about. I thought to add my E510 review under this to give the readers a better idea about how the Olympus E510/E520 wins over the Canons XSi and Nikon D80 we tested. Hope this helps.Myself and a Canon lover Friend and a Nikon lover Cousin were hunting for DSLRs. We had Film SLRs and few Point & Shoot Digis. We don't want to spend $1500+ for the DSLR and was waiting for the price to come down. When it reached $1000 mark, we started hunting for it and tried out few DSLR models in-stores by carrying our own flash memories and took few sample shots at the same lighting, focal length, ISO, f-Stop and Shutter and narrowed down to most people(s) three choices - Olympus E510, Canon XSi and Nikon D80. I went with E-510 right on the spot after looking at the images on the digital PC monitor in just 4 week end hunting. The other two contemplated a while and my friend went with Canon XSi and my cousin chose D80 as he wanted to use his old Nikon lenses and gears.On a fine evening we got our stuffs ordered online. As soon we returned from work, we were excited to experiment our choices.Right out of the box results: (No tweaking)E-510  - Great Outdoor results with very good natural color processing well exposed. Indoor shots were good natural color tones with a bit dull and underexposed.XSi - Great Outdoor and Indoor results with very little pink tinted color processing with a good exposure.D80 - Great Outdoor results with little blue tinted color processing. Indoor results with very little blue tinted color processing with a good exposure.You can see the pink and blue tint obvious on the skin tone and on the white base subjects. We actually compared the images captured by these three with what we saw with bare eyes. We all observed this very little tone changes when tried out at stores and agreed upon the myth that \"Every brand has it's own way and nothing is perfect\". But still it's too early to decide which one is best.We tried it every evening as soon we come back and with little tweaking as suggested by the reviewers and professionals. In just 3 days - I made everyone to think that - I  WON. Still those guys wanted to give a try because some times the results from Canon XSi and Nikon D80 will have the same color as E510 in long shots and when occasionally (say like one in 100 shots) E510 underexposes the skin tones will look greyish. We almost go as a group for all the functions/festivals and fill with flashes everywhere :)After 3 months of coutinuous use at the same places, here is our findings:Speed: XSi is better than E510 and D80. but thats for just 6-7 frequent shots. after that, the XSi will pop up with \"BUSY\" icon. It is famous and you can see the complaints in Amazon reviews. The other to will be steady through out the the session. no BUSY nothing.Color Tone: E510 is more natural across the lighting conditions. Indoor shots need to have exposure compensation set to either +0.3 or +0.7Indoor Photos: E510 is a bit dull and underexposed right out of the box but after a little tweaking it just blows the other two out of the window with very natural color tones and bright images. It actually chooses the right ISO required where as the Canon XSi always chooses ISO 400 when using flash I don't know why it is set like that.Dynamic Range: Though the pro reviewers say, D80 is more dynamic we haven't came across a situation to prove it. Under most common outdoors shooting, we all three got almost identical resluts and we liked the E510 processing much better than the other two.ISO:upto ISO 400, E510 is noise free. It get's a slight noise pushing in at ISO 800 and at ISO 1600 noise is obvious. Canon XSi is noise free till ISO 1600. Nikon D80 is noise free till ISO 800 and at ISO 1600 it introduces a little noise. It is worth to be noted that we haven't seen a situation that we need to use more than ISO 400 under normal indoor/outdoor common user needs. We actually forced the camera to use ISO 800 and ISO 1600 just to see the results where the camera picked ISO 400 by it's own when you leave it to the camera choise in ISO. This is actually a dark night shot on the river bank pointing the camera at the lighted buildings on the other side of the river and the situation is really dark.Auto Focus: E-510 locks on for sharp focus almost 99% of the time but hunts for focus at low light with too much flash strobes for 4-5 seconds drving you nuts. XSi is zippy but occasionally the focus is not properly locked. When you view on the camera display it looks fine but when blow up in the monitor, it's unfocused. Nikon D80 had the most mis focus. You can see these misfocus issues at both Amazon reviews and DPreview.Image Stabilization: E510 wins hands down. I took tack sharp pictures using 70-300 lens zoomed all the way at 300mm with shutter going down till 1/30. XSi's lens based stabilization is not that effective when we used it with 50-200mm lens zoomed to 200mm. It was effective till 1/40. Nikon we haven't tried it as we don't have IS lens. Not to mention the hefty price my friend paid for the Canon 50-200 IS lens while I paid just $240 for the 70-300 lens as I had an effective IS built into my E510 body.Fit and Feel: E510 wins again with more robust build quality. Nikon D80 is also built good but a bit bigger. XSi looks kind of plasticky and has an uncomfortable grip. E510 just lays in your hand so comfortable and is a joy to use.Value for Money:I paid $760 for the 2 kit lens. Bought the 70-300 for $240 . FL-36 flash costed me $150, totaled to $1150.XSi costed my friend $869 with 18-55mm (Now it is around $500-$600), 70-300mm IS lens for $510. With no flash his kit is now $1379. Flash is another $200Nikon D80 costed my cousin $910 with 18-135mm with no IS !!! He can't simply use his camera hand held as I am using it with my long zoom 300mm or as my friend using his XSi with his 200mm or in low light.Now...you decide which one gives you more dollar for dollar...XSi with 70-300mm auto focus is faster than the E510 with 70-300 mm at the very long end of the zoom. XSi with 300mm zoomed couldn't get sharp results all the time, less than 250mm is ideal for hand held. E510 has effective IS and works all the way till 300mm handheld but had focus hunt when used in a slight shadow area.Follow this link \"[...]\" to tune up your E510 and enjoy the long journey of Digital photography. Good luck.Verdict:We also asked the rest of the people at home and our friends to see the pictures and pick which one looks better without telling them which one came from what camera. The end result is 80% of the images picked by the them who don't even know which camera produced it, picked E510's pictures.We all three agreed that E510 is the best all around DSLR in it's category and we just pay the hyped price for the Canon and Nikon just for the label which produces image quality that is equal to inferior than the low priced, light weight E510. Look no further, go for this little gem and you will be more pleased than the Canon and Nikon users.", "Date": "November 11, 2008"}, {"Title": "A New Era in DSLR", "Author": "Tzar", "ReviewID": "R11A6FTIATL9AL", "Overall": "5.0", "Content": "I have done quite a lot of analysis before buying this camera, have used Nikon D40, D40x, D80, D200, Canon D350, D400, D450; but finally it was the Olympus E520 I fell in love with. I recently bought this camera in Hong Kong, when it wasn't even released anywhere in the rest of the world yet. :DWhy did I like it? The ease of use, I have used a prosumer camera for a couple of years now, and was waiting for a camera with similar ease of use, and Olympus heard my prayers.Technology wise, its one of the best FourThirds system in the market, this has enabled smaller lenses. The Live View is amazing (though I prefer using the optical viewfinder, my wife loves the Live view), it has Face detection and multi-point focus, all I can say is that it is the best as yet (the Canon D450 liveView is really bad), the kit lens is very good too, awesome wide angle. The assisted manual focus is extremely useful; the auto focus is super fast. There are multiple RAW file formats to choose from. The Sensor based Image stabilization works like a charm, better than the optical image stabilization. The playback features are the best, anybody would want to see the photos they clicked a bit closer, it is such a pain to zoom the preview on the Canons and the Nikons, in this even my 7 year old niece can do it. With respect to image quality, you might have seen them on the internet, its comparable to any of the professional cameras.One small drawback i have noticed is the built in flash, its not as powerful as the Nikon, though we can increase the flash power, but the default setting is not as powerful as the Nikon.You can checkout my photostream on Flickr: [...]", "Date": "July 18, 2008"}, {"Title": "Great value for money", "Author": "Agrippa of Queens", "ReviewID": "R1RP8R9SLVP5HY", "Overall": "5.0", "Content": "I evaluated the Canon 40D and new EOS XSI before stumbling onto this little beauty. I can argue that it takes just as good pictures as the 40D - at least in my hands. It's smaller than the Canons and for the price, an incredible deal.Now, not to put down Canon... I actually broke my Canon brand loyalty for this camera, but overall, Olympus did a great job in packing features and ease of use into this camera and once its in your hands, you'll see it.The back has lots of buttons but once you spend 15 min figuring out how to navigate the camera and its buttons, you'll like the ready access to many functions.In terms of image quality, it's breathtaking for those looking to step up from advanced point and shoot cameras. It's not a pro camera for sure but I'm no pro and for what I do, it more than gets the job done. I use it for baby photos, nature macro, nature landscape and cityscape photography and it does great for the variety of environments I shoot in. One thing I find really impressive is the flash. Flash on most DSLR's tend to wash out or harshen images. This camera's flash is just enough but not too much so long as you compose your shots correctly. (Like not having your subject 1 meter from the lens!)Overall - I'm glad I looked at this and Olympus won themselves a convert!EDIT - 8/8/08. After using the camera for a few days, I noticed that when I turned the camera off, a rattle would emanate from the inside of the camera. Distraught, I removed the lens and still the rattle continued. Upset that my new beauty was defective, I boxed it back up and prepared to return it... but before I did, I called Olympus support to see if they had any insight since I could find NOTHING on the internet about the rattling. Well, as it turned out, it was the image stabilizer in the camera body that was creating the rattle! The tech said it was a natural function of the IS \"resetting\" itself. (Remember, this camera has in-body IS, not lens IS) When I turned off the IS, no more rattle. Whew, good thing I called - Olympus support was great and saved a return. Only con is that they should document this in the manual, its a little unnerving at first but you get used to it. Don't worry, the rattle is slight - nothing that will jar the camera from your hands or damage any internal parts. It was that I just never felt something like this emanating from a camera before. Verdict after 1000 shots, still love it!", "Date": "August 6, 2008"}, {"Title": "A Great DSLR - Highly Recommended!", "Author": "C. Martin", "ReviewID": "RA0OJXYPA182A", "Overall": "5.0", "Content": "This is my first DSLR.  I bought this and the Canon XSI at the same time and tried them both for a week.  To make a long story short, I returned the XSI and kept the E520.  It was just easier to take good pictures indoors, which is where I do most of my shooting.  The Canon took more effort to produce good pictures.  Plus I liked the interface of the Olympus more.The XSI has a better viewfinder and a slightly better autofocus system but the Olympus image quality won me over in the end.  Its white balance and exposure was just easier to get right than the Canon.The key is to purchase a camera that you will use and the Olympus does that for me.", "Date": "July 21, 2008"}, {"Title": "My first dSLR, and it blew my socks off!", "Author": "ubat", "ReviewID": "R2UQBNGD26TKQE", "Overall": "5.0", "Content": "Yes, the E-520 is my first dSLR. It took me months to make the leap, during which I did A LOT of research, posted questions in forums, went everywhere my mouse would take me. Here were my reasons for choosing this camera:1. Weight. I have back and shoulder problems, and lugging around a huge camera and heavy lenses was never an option.2. Mirror-cleaning system. One of the issues that held me back for so long, as I'd been reading about the problems and annoyances caused by dust in mirrors (electronic devices are dust magnets!). But Olympus came up with a solution for this, and everybody said it was the best cleaning system in the market. I chose to believe it.3. Camera resources. If you're willing to learn them, you'll become a better photographer, and that was my plan. I no longer wanted to let the camera do all the thinking. Although the E-520 still allows that (auto mode), I wanted more control and a better idea of why I was getting the results I was getting. Thus, I can set everything by hand if I want to. Or not, if I'm having a lazy day!4. In-body image stabilization. Like any point & shoot, the E-520 body is stabilized, which helps reduce camera shake, especially when using those bigger lenses.5. Lenses. As they say, Olympus has great \"glass\". Even the most humble and inexpensive Olympus lenses have a lot of quality. They will surely outlast any camera body, which is how it should be: the biggest investment are always the lenses. Furthermore, the peculiar sensor size adopted by the company (four thirds) makes for twice the reach with no gain in bulk. Thus, for instance, a 70-300 mm Olympus lens is, in fact, a 140-600 mm lens -- a huge zoom in a compact package, which is perfect for me since I do a lot of bird photography. And this takes me straight back to the weight and bulk in item #1.I've had the E-520, plus the \"kit\"14-42 mm, the 70-300 mm and the 50 f/2 lenses for almost two months and I couldn't be happier. In terms of image quality, the differences between this camera and the superzoom cameras I owned previously (Panasonic FZ18, Canon S3 IS) are not only visible, they are incredible. I haven't had any problems with purple fringing, excessive noise, distortion, nothing.It is easy and intuitive to navigate the camera menus and controls to do things the way I want. Oh, and dust? I haven't yet given it a thought: the Olympus cleaning system really works. Truth is, for me it is simply a joy to use this camera. Photography is fun now -- not frustration at seeing something and then having the images be a total letdown.A bit of advice for newbies like myself: join forums, ask for advice, read the manuals and the literature out there (like Brian Peterson), take a lot of pictures then look them through to understand what you did right or wrong. It really helps the learning curve.", "Date": "October 11, 2008"}, {"Title": "E-520 is fantastic value for price -- great performer", "Author": "Steve G. \"Steve-in-Ky\"", "ReviewID": "R26Q6MNS5DAWZ5", "Overall": "5.0", "Content": "*****UPDATE REVIEW MAY 15, 2009*****I've had this camera now for about 6 months...long enough for me to evaluate it some more.  It's about 75% + and about 25% minus.  I find it easy to use.  Some reviewers did not.  At first, it didn't look very sharp on my computer monitor.  And the LCD screen doesn't let you zoom in on preview with much sharpness.  So, until I actually had some photos printed off the card, I wasn't convinced.  It does produce sharp, saturated photos.The ISO goes to 1600, but I was having trouble getting shutter speeds over 1/80th while trying to shoot a basketball game.  Inside, at night, I have given up trying to get sneak photos of my son and his dog asleep in their bed.  After watching the focus flash go off 6 or 7 times, I give up.  Without the main light on, it's abysmal.  Last night, I tried to take a picture of a deer by the road.  I never could get it to focus and had to set it to manual.  Luckily, I got it right and with RAW, and some editing afterwards, got a pretty decent flash picture.  Sadly, my $135 point and shoot would have gotten the picture in focus (the flash couldn't have made the shot).  While for daytime shooting the smaller viewfinder doesn't bother me, in low light it performs poorly for trying to focus.  The lenses don't have a fixed turn on the focus ring, so you can't guess as the ring will just keep on turning.  Other than that, it is a great performing camera.  Anyway, I thought I'd add my thoughts.*****INITIAL REVIEW DECEMBER 4, 2008*****I ordered an E-520; it was shipped on 11/30 and I received it at lunch on 12/02 by UPS w/free shipping.  Can't beat that... (I also found it on a weekend Turkey Day sale for $469.)  Anyway, this is a fantastic camera.I spent 11 years as a paid photographer, doing portraits and weddings, and I worked for a while as a photojournalist, and custom darkroom tech. Every camera has both good and bad attributes.  I'm sick of people trashing cameras over trivial crap.  I want to photograph nature; my family; vacations; etc.  Reading numerous reviews and tiny variances in lab condition tests both confused me and worried me as I toiled over a camera.  When I actually worked as a photographer, I shot everything from Hasselblads to Nikons to Mamiyas as a photographer, but this is my first dSLR.  The old Nikon is retired and now a shelf decoration at home.  Hence I was shopping for a camera to do better than my pocket PAS I take hiking and paddling.  I figured I knew a lot about cameras until I started reading all the test reports on digital SLRs.  Man, it can get confusing.Not to bore you with technobabble, I am extremely happy with the camera and I've only used it for 2 days.  A few of the things I've noticed as of my 3rd day with the camera are:  This camera feels good in my hand.  The grip is shaped just right to get a good hand hold and not be hitting buttons with my thumb.  It feels a lot more like a pro-grade SLR than a consumer grade (at least to me).  The mode and setting dials are conveniently located.  The LCD is good.  The menus, while there are a LOT of them, are pretty easy to understand once you play with the camera a while.  They are bright and easy to read.  I like them better than the Canon XSi.  You might forget exactly where a sub-menu is if you don't use the camera for a while, but I suspect the average shooter won't be adjusting every little setting just to take pics.  My guess is that most people will shoot jpegs and do some EV adjustments, etc.  Plus, there are short cut buttons on the camera that can control the ISO, single vs. continuous shooting, etc.The overlay grid is kind of cool, mostly to play with if you have much experience.  It has a square green box that shows you where it took the readings.  While squares light up on the overlay, through the viewfinder there are 3 focus points.  When it focuses, small red dots light up to show you where the focus is.  You can customize these.  Basically I found this to be very helpful.  In lower light, fast action or lots of differently spaced areas in a shot, it's easy to have the camera get your subject a bit out of focus.  I haven't used the face recognition or auto-gradation (shadow adjustment technology) yet.  Some of the articles say that a lot of the features are for a transition to a higher grade camera from a PAS.  I disagree with that.  While some are cutesy, they would help most anybody, especially in rush situations where you don't have to analyze things and make a quick decision.  And, not everybody wants to scrutinize every situation and become super photographer.  Mom or grandma might want a camera to photograph the kids at football games, or take fireworks pics with on July 4th, etc.  Settings that have automatically compensated for variables (at least to some extent) can and do come in handy.  I've used them in the past.  The day my camera arrived, I did photograph a girls' basketball game at the school where I teach and I was pleased with the results.  People complain the viewfinder is too small.  It is a bit small compared to Canon, but it's still plenty big.  I read where the shape of the 4/3rds sensor causes some of that perception, as compared to traditional viewfinders/sensors which are rectangular.  The read out is a tad small, but the major info at the top such as f-stop and shutter speed is readable.  Those are the important ones.  The small clutter of information at the bottom is more of a learn what's where and just acknowledge it's set.  Once you've set them in the control panel menu, do you really need to squint to read them and remind yourself they are there?  Just hit the info button for the LCD and that will be displayed...a lot bigger.  I used the view finder and 1600 ISO.  It performed as expected, although I did have to adjust the EV controls at first as the girls were too dark...sort of shadowy looking.  The adjustment cleared the pic up fine.  Looking at the pics on my TV and computer, they are well exposed and very sharp, with vivid colors even on natural.  The camera LCD flashes on areas with blown highlights, but in a gym, that's to be expected.  Most any picture will have high and low key areas.  The histograms will prove handy.People complained the LCD focus is too slow.  For stability and a sense of feel for the composure and camera, I used the viewfinder A/F.  Putting my elbows against my chest and the camera against my face is something I've done for many years.  holding a camera out in front of me is just not natural, nor is it good for low speed shots.  Plus, it looks sort of hokey...like my elderly mother holding up a PAS and saying \"smile...\"  Basically, it performed top notch.  Most of the time, I didn't even pre-focus and it caught the action.  The LCD did take a bit longer, but in my opinion, LCD is for landscapes, wildlife, family group shots, sneaky shooting, etc.  The camera does come with a little piece that slides over the viewfinder slots to block light from the sensor when using the LCD.  I put it in one of the card pockets of my LowePro camera strap, so it would be handy and I wouldn't lose it.  I have both the 14-42mm and the 40-150mm lenses and while the depth of field isn't as shallow as I'd like it, and the bokeh isn't comparable to top-end lenses, you wouldn't expect them to be.  Other than the f-stops are not as low as I'd prefer, they are great lenses.  I wish they would blur the background better, but different focal lengths can help the aperture out to some degree.  The 300mm zoom is on my Christmas list.  The 3-pack of lenses would give a person 28-600mm zoom equivalent.  For a hobbyist or even a paid shooter, I would be hard-pressed to think of a situation where you would be wanting more.  I haven't mentioned a lot of the technical details.  You can get information overload on many sites if you want that.  If you want to ask me questions, please do so.  I'd be pleased to hear other folks' thoughts.  I'm experimenting a bit more every day to learn it.  I am very pleased with it.  In my opinion, you cannot go wrong with this camera, especially considering the quality of the pictures, the features, and the price.  I added a Gary Fong puff diffuser for the on board flash.*****UPDATE FEBRUARY 2, 2009*****I've had my 520 for about 2 months now, after doing the traditional wondering about brands and models for way too long.  I had the typical questions and concerns about the camera.  So many reviews by so many labs, individuals, etc. can get quite confusing.Anyway, getting on to my review update.  This camera is plastic, as people have noted.  Big deal.  It's durable, very attractive and feels absolutely great in my hands.  It does not feel cheap in any way.  The lenses don't have a very low f-stop unless you get the higher end ones.  This is usually not a problem in most situations, except speed shots in very low light.  The Live View is terribly slow in low light and drops out quickly in very low light.  I'm not sure why people seem so concerned about Live View.  I use the viewfinder probably 95+ percent of the time.  The viewfinder is quite fast to focus.  Landscapes, trying to focus quickly for people shots or moving objects would be where a sluggish Live View would pose a problem in low light.  It has a lag anyway...not something I would use for any movement.  Use the viewfinder...I do have a big problem with the way the lenses do not have a set infinity point.  While a film photographer, I could guess the distance or set it to infinity if necessary.  You can't really do that as it keeps turning.  I found that out while doing moon and star photography.  A lot of photos of the moom were a bit fuzzy, past what I expected from the moon glow or the atmosphere.  You can't see anything with Live View in total darkness and the images are so small in the viewfinder that it's unusable.  Having a reference point would be handy, although I'm still working on getting good in night photography in general.  I guess reading some articles or books on the subject would seem logical.A disappointing feature is the limitation of the ISO to 1600.  Night sports photography is difficult at 1600, although I think you can probably set it to RAW, and then drag out enough details to be suitable.  I'm pretty new to RAW, so I'm not expert in this area.  Remember, a night photo will never be as good anyway.  So many of the new cameras go to 3200, that 1600 seems kind of wimpy.  But, 1600 still blurs indoor basketball a lot of the time.  While you can pan with the xD card, most of the time you are following the players and decide when to take the photo.It has the obvious limitations for night streets, carnivals, etc. where you need some speed in the shutter.  The camera settings do come in handy to manipulate.  Night shots give that traditional amber look.  While this is handy for effect, sometimes it is unwanted.  That's where setting the camera's white balance to the light bulb icon corrects it very well.  Complicated huh...The related issue of only 3 focus points for the viewfinder has not given me any problem at all.  A lot of reviewers did not like this as most cameras have upped the focus points.  This could be a problem for a brand new photographer, but you soon learn where to focus on.  Way back when, we didn't even have focus points.  Hint: Read all you can on f-stops, depth of field, etc.  I had to learn to take photos when my camera had a match-needle for the f-stop and a dial for shutter speed, and a bulb setting.  Brain power, not a do-it-all camera is the real key to photography.  If you continually rely on the camera to figure it out, you will do a disservice to yourself.The flash is definitely worthy of praise.  It's dead-on; enough said.  It also recharges fast.  Some people have commented that the menu is complicated.  Use the camera for a couple of weeks, experiment with the settings, and flip through the reference manual and I think you'll find it easy to understand.  I must admit that I haven't read it all yet, and still don't know how to fine tune some of the settings as well as I should.  This is sort of a film to digital transition, where one is used to doing it in your head or the darkroom, and now you have to translate that into telling the camera to do it.  I can get somewhat confused if I try to get too creative on the spur of the moment.  I think with a camera this versatile, you need a game plan for your shots.  I guess I really should study the manual more as I get time.A first \"click,\" my point and shoot seems to take a better grab shot in some areas.  But, it's designed to do that...let the layperson take a quick picture, of decent quality.  At first, I was a bit disappointed that my wife's Sony (which cost about $350 when she bought it) too better photos...until I learned how to adjust the camera.  You should remember that the latitude of the 520 is designed to push the envelope past that of point and shoots, and realistically past that of most dSLR cameras anywhere when compared to its price.  That is what makes the difference.  It's amazing how things have come down in price.  I bought my first PAS 5 MP digital in 2004 for the small amount of $500.  Prior to that, we'd paid about $200-250 on a markdown for a 1.3 MP back about 2001-2002.A buddy with a much more expensive Canon and I were doing the previously mentioned night photography.  He commented on how good it was that my entire LCD menu lit up...that it was easy to see and make adjustments to.  He's a good photographer, with a system that probably cost 3-4x what mine did and he frequently praises my E-520 and what a good purchase I made.  It seems to me the models with the top displays in gray scale LCD would be frustrating to read compared to this one.Anyway, bringing my essay to an end.  The features are great on this camera.  The meter and flash are extremely accurate.  The kit lenses are very high quality and embarrassing affordable.  The camera is easy to make adjustments to and easy to use with a minimal amount of effort in the learning curve.  While lots of people talk about paying money for \"good\" lenses up the line, I'm not one of them.  For casual photography, I can't recommend spending $700-800 or closer to $1,000 on a lens.Two deficits of Olympus is while they have a good variety of accessories, aftermarket items are an issue, and their stuff is typically fairly expensve.  I wish the flash models were cheaper.  A very good Sunpak or Vivitar flash is much cheaper than the comparable Oly models.  But, with the 4/3rds sensor system, and the zooms, you'd have a headache to keep trying to remember to make adjustments to keep the flash accurate.  Plus, there is the voltage limiter to keep from burning out your circuits with another brand flash as an added aftermarket cost.My end advice:  Get this camera and I doubt you will regret your decision.  It will give you years of enjoyment, and satisfaction with great photos.  Buy whatever Oly lenses you can afford to (based on your needs and not trying to keep up with the Jones).  All too often, photographers buy stuff so their camera bag looks full, or they can have bragging rights.  Go aftermarket on related items like remote controls, etc.  I do recommend buying a BLM-1 battery.  I just think they last longer--my opinion.  FYI, OwnUser makes a cool battery holder that looks like a motor drive.  It adds bulk (or holding area if you prefer that term), and comes with a remote control and an external battery pack that holds AAs and clips on your belt.  If you want to play around with things such as close up or fish eye accessories, Opteka and other Japanese brands make inexpensive add-ons.  They are cheap in price, but sometimes perform pretty well.  I've used cameras and lenses costing thousands of dollors.  You don't always have to have an expensive lens or camera to get a satisfying shot.  For a picture of the kids or a desk top of photos from the vacation, inexpensive equipment usually does fine, given limitations.  That said, inexpensive elements don't always have as good of multi-coatings (if any), or as good quality glass elements...or plastic in some cases.  However, some perform amazingly well for a budget price.  Try a couple out.  If you don't like them, return them for a refund.In any event, the Olympus E-520, the 14-42 and 40-150 lenses (get the 300 zoom if you like nature) will do an excellent job in almost any job you need them to.  At least, that's my opinion.", "Date": "December 4, 2008"}, {"Title": "First SLR with Real Auto Focus Live View", "Author": "Izzybee", "ReviewID": "R3DJ204KZ2L6BE", "Overall": "5.0", "Content": "Just got this SLR today,have owned many Past & Present. First thoughts are this is a TOP Notch Step Up in a Digital SLR Camera. The Auto Focus in Live View is out of this world, just press the shutter botton half way and you are in focus. I currently Own the Canon 40D and Olympus 510. This is what I have been waiting for,SLR Quailty with the ease of operation of a Point and Shoot for quick easy pictures when you need them. Cant go wrong with this one.", "Date": "July 8, 2008"}, {"Title": "Olympus E-520, an excellent choice", "Author": "anshuman \"Ret\"", "ReviewID": "RKKA517EQQVAW", "Overall": "5.0", "Content": "I was shopping from my first DSLR and finally settled for the Oly E520 after shortlisting it with Canon XSi [450D] and Sony A300. Some of the features that made me go for it are mentioned below:- a nice package with 14-42mm and 40-150mm lenses- the quality of Zuiko lenses [and they are smart to market them as optimized for digital photography]- SSWF dust removal system [which according to some works the best]- Live View [XSi and A300 have that too]- In body Image stabilization, which means that you don't need expensive lenses with stabilization [A300 has in-body stabilization too]- the camera felt better in hand than the other two- the Olympus brand- Intuitive MenuI have both the CF and xD cards on it. The xD card box has a code that activates Art and 3D feature on the Olympus Master 2 Software.For someone who is moving up from the point and shoots, the Oly E-520 is one of the best choices. I have been using it for a week now and everyday I learn something new about it.Overall, it's one of the best and I have no hesitation in giving it 5 stars and recommending it highly!!!!", "Date": "August 14, 2008"}, {"Title": "Excellent Camera, Best Value for the Money", "Author": "T. Port", "ReviewID": "RJ6E6I9FIM3P7", "Overall": "5.0", "Content": "First, it is my opinion that the Olympus e520 is absolutely the best DSLR camera you will find in its price class. Sure, there are more expensive models from other brands that are better. But for the money, you will not find a more capable camera.Also, it is my opinion that there are three components that determine the quality of a photograph.1) the camera. 2) the lens, and 3) the photographer's ability to use the camera properly.So keep those things in mind when deciding which camera to buy, you need a good lens too, and you will need to learn how to use the camera's various features to get the best photos.This is my first DSLR camera. I spent two months researching various DSLR cameras and read many reviews. And I admit, at first I did not seriously consider Olympus as an option because it is not as popular as the two leading brands (Nikon and Canon). Most of my friends and relatives have one of those two brands so I figured they were the best. But I was overwhelmed by the many conflicting reviews I read about Nikon and Canon models. It seems there are many opinionated and passionate brand loyalists out there who love their choice of camera. Which is perfectly fine except for their biased bashing of the other brands.This made it very difficult for me to make an objective comparison between the brands. I had almost given up on my quest for the right DSLR for my needs until I talked with another friend who has the Olympus e510. He let me try it out and I found it to be very impressive and very easy to use. So I read as many reviews about the Olympus cameras that I could find and it turns out that  nearly all those who own an Olympus love it and wouldn't trade it for any of the other brands. So, for reasons I'll explain below, I finally made the purchase and I soon found my new e520 was on the door step. Although the camera is not perfect (neither are the Canon or Nikon cameras), it did not disappoint and I am very satisfied with my choice.  +++ Pros ++++ Excellent construction quality. This camera feels very substantial, sturdy and tough.+ Excellent layout of buttons, and controls. The buttons and dials are easy to find and seem natural and comfortable when using them while taking photos.+ The LCD screen is the biggest in its class if camera.+ Very easy to use. I'm a first time DSLR user and it was very easy for me to learn how to use almost all of the cameras features. For those who prefer auto, no worries, it takes very excellent photos in auto mode. For those who want to customize the heck of the settings, no worries either, the Olympus e520 has more manually setting ability than any of the competition in the same price range. And changing the manual settings is so easy and quick with the super control panel that only Olympus has.+ Image stabilization built into the camera body. This is a big deal. For crystal clear photos you really do need image stabilization. Especially if using telephoto lenses. The difference between Olympus and the other brands is Olympus puts image stabilization into the camera body while the competition puts it into the lenses. Lenses with image stabilization cost more to manufacture than lenses without. Therefore, with the Olympus system you will get more lens for the money since you won't  be paying for the image stabilization.+ Unlike the competition, the entire Olympus system is designed from the ground up for digital photography using the new four thirds standard. This makes their telephoto lenses more capable and much less expensive. And Olympus has a very large selection of lenses to suite your needs.+ The e520 has the fastest continuous shooting speed in its price range and received best scores for color accuracy in independent reviews. It also has the best dust reduction system in the market.+ The kit lens takes very excellent photos and is a more capable lens than the competition's kit lenses. This is because the four thirds system provides higher telephoto ability in the same size lens plus image stabilization is in the camera. Watch out for the other brands' kit lenses. Many of them do not have image stabilization.+ There are many more pros worth mentioning but not enough room!  --- Cons ---- No camera is perfect. And for the entry level price I would expect some cons. Don't worry, this camera takes awesome photos in almost any circumstance. And it also takes awesome photos in poor lighting situations as long as you use the flash. But, if you're looking to take flashless photos in dim light by using a high ISO setting, you may be disappointed by the noise. The image sensor in the Olympus camera is smaller than other DSLRs and therefore is more susceptible to noise at high ISO settings. ISO 100 and 200 have no noise problems in any light condition. ISO 400 has an acceptable amount of noise. Anything 800 or above will produce way too much noise in my opinion. However, this is not a big issue for me because I use a flash when taking photos in dim light. Or,  for night time scene shots, I just slow the shutter speed down rather than adjust the ISO settings. I do sometimes use ISO 400 with acceptable results.- Generally, the auto focus works great. However, in dim light, the auto focus has to use the flash to help it focus. It does this by rapidly flickering the flash like a strobe light for a half a second while it focuses. This can be annoying and distracting to the subject you are photographing. Other brands use a red led to assist in dim light focusing. Not sure why Olympus didn't do the same because the strobe light thing is really annoying. To solve this problem, I bought a hot shoe flash which uses the red led to assist focusing. I like this much better.In conclusion, you can't go wrong with Olympus. They manufacture very high quality cameras and lenses with many features that outshine the competition in the same price range. Too many people tell me their Canon or Nikon is better but then they paid two, three, or four hundred dollars more for their setup. Of course I would expect it to be better. Olympus also has higher end cameras that are more capable than the e520. But for my needs, the e520 is the best value.", "Date": "March 13, 2009"}, {"Title": "very much worth the purchase", "Author": "I. Davis", "ReviewID": "RQWOM8SHBM1S8", "Overall": "5.0", "Content": "The E-520 from Olympus is my first DSLR purchase and I must say that it is an excellent camera. I've taken some great shots with it outside and I'm very impressed. The kit lens (Zuiko 14-42mm) i find to be a great starter lens although in low light situations the auto focus takes much time and can be inaccurate. i plan to get the Olympus Zuiko 12-60mm lens to go with this camera as it handles lower light situations much better. the auto white balance can generally be accurate but i do suggest using either one of the presets or making manual tweaks. while live view is one of the big features in this dslr, as it has been with almost all of their dslr cameras, i find myself having more fun using the viewfinder, which hasn't really given me any problems. the anti-dust system is great, i still encourage cleaning the camera every once in a while as well just as a precaution. I encourage anybody in the market for an entry level dslr to look @ and try the e-520.", "Date": "August 15, 2008"}, {"Title": "The best beginner DSLR in the market!", "Author": "R. Sarma \"rssarma\"", "ReviewID": "R1E02JAYUJXUI7", "Overall": "4.0", "Content": "I started my DSLR experience with the E-510, while this was a quirky little camera that needed cajoling to perform well, the E-520 is nothing like that. After a year with the E-510, I ended up replacing it with the E-520 and what an improvement this camera is! A lot of quirks that the E-510 had (blown highlights, excessive contrast, bad LCD, underexposed mid-tones in JPEG) had been remedied in the E-520 and to add to that a bunch of newer features had been added as well. The most notable ones (for me) are:1. Imager AF in live-view with face detection.2. IS mode 3 for vertical panning.3. Bigger and brighter and a more accurate LCD.4. And by far the best addition, remote flash triggering for up to 3 groups!It's amazing that Olympus could offer so much in a so-called \"beginner\" level camera and to think Nikon doesn't even offer live-view view! This is one of the biggest reasons for me to stick to Olympus as they don't skimp on features even in  lower-level bodies.I have no hesitation in recommending this camera for the first time DSLR buyer as well as a pro looking for a back up body for the E-3. Although compact, it's very nicely built and has a superior and much better build quality than the E-500 as well as similar Canon offerings.I had the two kit lenses but sold the 14-42mm lens and kept the 40-150mm lens. I'm simply amazed with this lens as it offers an effective 300mm focal length in the smallest package currently in the market. I took the E-520 along with this lens to a recent U2 concert and the guards didn't even stop me as they couldn't tell what this lens was capable of by looking at its size! I ended up getting some stunning images with this camera and lens combo.Last, but not the least, I would like to talk about IQ; Olympus has sorted out the tone curve in the E-520 and its MUCH better than the E-510 and allows amazing pictures straight out of the camera. I have no qualms using this camera all the way up to ISO 800, although at ISO 1600 the noise is higher than average and in some cases one will also notice banding in the shadows. I normally switch to B&W; for ISO 1600 and that makes all the difference. However, in a pinch you can get some excellent ISO 1600 colour images as well if you're willing to shoot RAW and carefully process. This is about the only \"minus\" in this camera that I can think of.Overall, this is an excellent camera and gives an excellent bang for the buck and I highly recommend it!", "Date": "September 27, 2009"}, {"Title": "Olympus E-520 camera review purchased from Amazon.com", "Author": "gmswitz", "ReviewID": "R2GCF8GV4GKME8", "Overall": "5.0", "Content": "Over the months I reviewed numerous camera's before purchasing the Olympus E-520 w/14-42 lens. I looked at Nikon, Cannon, Pentax, Sony and the normal brand name camera's. I went to the stores and visually reviewed and handled each camera asking questions with a knowledgable saleperson Olympus, by far, was the best choice for me when you compare price verses bang for the buck. I have been completely satisfied. It takes excellent pictures and has all the versitality necessary for your everyday photo requirements. There are always pro's and con's on every camera and it becomes confusing if you do enought searching, but the Olympus E-520 won me over. I ordered this camera from Amazon on a Friday and had it on the following Monday. Excellent job Amazon! You actually shipped it within an hour of me completing the online order with a confirmation email. WOW! For someone looking for a camera, the Olympus E-520 is a great choice and Amazon is the place to buy it........", "Date": "January 18, 2009"}, {"Title": "e520 vs, e510", "Author": "William Balsam \"Ursus\"", "ReviewID": "R1IJFTFUEGU0X4", "Overall": "4.0", "Content": "Although I ended up buying the e510, the reasons might be of interest to people considering the e520 since both are still on the market. To be sure, these cameras have much in common. They both rate excellent image quality, resolution, color accuracy, very low to low noise from ISO 100 to 1600, and very high shadow detail. In addition, they are both of similar shape and easy to hold and handle. Further, like all Olympus DSLRs they are sturdy and have a low frequency of repair rate.The e 520 improves on the e510 or adds the following features:1) slightly improved dynamic range,2) face detection,3) ability to fire an Olympus flash remotely and still use TTL (the e510 can do this only on manual)4) bigger LCD screen (2.7\" vs. 2.5\"),5) faster processor, and6) more scenes and profiles.However, the e510:1) is slightly smaller2) is slightly lighter,3) focuses a little faster, and4) can be had for less than $550 with 2 lenses.Size and weight were important in my decision because I take my cameras hiking and the added features of the e520 were not ones I considered deal breakers. However, it was the price of the 2 lens package that tipped me over the edge to buy the e510 as opposed to the e520.While these are both very good, sturdy cameras there are some annoyances they share.1. Both apparently have trouble focusing in low light. But, my experience says it has to be pretty dark for this to be a real problem.2. I was aware of the low light focus problem when I bought the camera and figured one can always switch to manual focus. But, the focus ring on the lens requires a lot of movement making straight manual focus less useful than I had hoped it would be. Fortunately, Olympus includes a mode where you can auto-focus and then touch up manually.3. Live view works but, compared to point and shoot cameras, is clunky and will never replace using the viewfinder, not that I want to. (I suspect this is true of all DSLR's with the possible exception of Sony and the cheapest camera they have with a Live View equivalent, the A300, costs more.) Live View is perhaps best reserved for macro shots.4. I'm not sure if this is true of the e520, but on the e510 Live View seems to drain the battery at a very rapid rate. I'd be surprised if I could get 60 Live View pictures from a battery charge. (I've never seen this mentioned in reviews and would be curious if anyone else has had this experience.) However, I do believe the claim of about 500 shots without Live View.I started photography using a 4 x 5 Speed Graflex (yes I know this dates me), graduated to a Canon film rangefinder, and Nikon film SLRs all the while doing my own darkroom work in B&W.; I enjoyed the manual aspects of these early cameras I used and with my digital point and shoots cameras missed easy manual adjustments. I bought this camera so that it would be easier for me to be creative, that is, adjust ISO, f-stop, shutter speed, white balance, etc. And, compared to my Panasonic FZ5, the e510 is much easier to adjust, but still not as easy as my film cameras (not that I would give up digital photography or the digital darkroom). Magazine articles have noted that the menu system is complicated. I don't find this to be true, but then I'm used to Windows. In fact, I find most everything is easily accessible and, at most, just a few clicks away.As noted above, image quality is excellent. I have yet to try RAW because the SHQ JPEG's with minimal compression (1:2.7) are reputed to be as good as RAW. But, as with all cameras with high mp sensors, be prepared for large files; these SHQ images are 6 - 7 mb. Of course, if you want the image quality advantage of a DSLR large file size is inevitable.All in all I am happy with the e510. It is a good sturdy camera that produces excellent images. The lenses are lightweight and well matched to the camera. However, with advances in sensor design, I suspect that in the near future superzoom cameras such as the Panasonic FZ28 will provide image quality similar to today's DSLR without the price, bulk, or necessity to carry an extra lens. For folks who don't want to fuss with a camera or extra lenses but want a large range of lens focal lengths, superzooms might already be a better choice than a DSLR.", "Date": "December 16, 2008"}, {"Title": "5 stars considering the price-point", "Author": "C. Grove \"Man-O-the-Hour\"", "ReviewID": "RF0U3DWY2FJ0U", "Overall": "5.0", "Content": "I bought the e-520 for one simple reason... it has several mitigating features that allow for an overall system price break while still giving pretty good quality images.Yes, I know that other cameras have an edge when it comes to digital noise, dynamic range and number of megapixels BUT from a practical, real-world shooting stand-point you can get great images from the Olympus E-520.The fact that even Olympus's lower range of lenses are pretty good quality means that a person who is trying to scrimp can come up with a good \"prosumer\" camera system.Consider this. You know that the drawback to Olympus's four-thirds sized sensors mean that there is SLIGHTLY more digital noise at higher ISO settings, right? Well the smaller sensor means that my 70-300 f4-f5.6 tele-zoom is really the 35mm equivalent of a 140-600mm!!!... And still at f4-f5.6!!! That's pretty good. And I spent WAY less then someone purchasing a 140-600mm.Now... Image stabilization that is in the lens means that there is a premium added to the cost of the lens. Well, the E-520 comes with GREAT image stabilization in the camera body. No need to add that expense to the lens! Cool!On top of that Olympus tends to price their cameras slightly lower than other similarly ranked cameras. AND they tend to put a couple other features in there for the price... like THE BEST sensor dust reduction system in DSLRs!!! Cool!So far I'm quite happy with the E-520. If the E-620 had come along earlier I might have decided on that simply because of the higher mega-pixels. However, I've been quite happy with the image quality coming from this camera, \"for the price-point\".Check out cameralabs dot com and search for this camera.UPDATE 7/23/09Still a great camera for the price but I would now strongly suggest the E620 unless the difference in price is just something you can't handle. I often find myself needing to crop in and I wish there were a higher resolution to do that with.Also, do not be surprised if you use the 70-300mm zoom and see fuzzy images without a rock-steady tripod. At the 35mm equivalent of a 600mm lens there is not a lot of wiggle room to shoot hand-held, even with the image stabilization built-in.", "Date": "March 31, 2009"}, {"Title": "Exceptional Camera at an Unbeatable price", "Author": "T. Arnold", "ReviewID": "R2GA2WXY2NL26O", "Overall": "5.0", "Content": "If you're wanting to step-up from a point and shoot digital camera, but on the fence about a DSLR versus SLR-like camera, then you can purchase the Olympus E-520 with confidence.  There is absolutely no other entry or mid-priced system on the market that has the feature set for the price that you can get the Olympus E-520 for.  I carefully researched and compared systems that possessed the features important to my family: live view, image stabilization, optical/sensor quality, and finally, PRICE.Buy it now and you won't regret it.  I'm using this camera in Iraq and am amazed at the quality of materials, the brightness of the rear LCD, and the ease of use.  I replaced a destroyed Canon point and shoot and felt right at home with this system.  The myriad of auto function and shooting modes ensures virtually idiot-proof quality photographs that you will be proud to share with family and friends.If you can't already tell, I highly recommend this camera.  I'm even thinking of purchasing an Olympus E-420 for my wife to replace her aging point and shoot when I return from Iraq.", "Date": "December 16, 2008"}, {"Title": "Surprisingly good pictures at this price level", "Author": "G. LO", "ReviewID": "R2R5F01RC84YPW", "Overall": "5.0", "Content": "I looked at several camera models from Olympus, Nikon, and Canon.  While a lot of folks go with Canon or Nikon, I found the values and quality of the Olympus 510 or 520 to be much better.I considered for a long time whether to pay less for the 510 or get the latest 520 for a little bit more money.  I decided to go with 520 eventually and I am very happy with my decision.  I also bought another 40 to 150 mm lensThe focus is very sharp, colors are very good.  Picture quality is much better than I expected.  At first, I used the Auto mode like many other DSLR beginners.  Later, I tried different modes including P, A, S and could really create many different type of pictures.  AE Bracket is very useful.  I found image stabilization very useful.  Occasionally, the pictures under expose a bit particularly indoors.  But fear not, just set the exposure to overexpose by 0.3 or 0.7 and viola, the quality is great.Some complained that 510/520 only has 3 AF points but other brands provide more.  I think that is a good thing.  That makes focusing so much easier when you only need to think about using 1 of the 3 points.  If you use Live View, you can many more focus points.  But so far I use view finder most of the time.  Battery lasts forever.  I have taken hundreds of pictures and haven't had the need to recharge.All in all, this is an awesome camera.", "Date": "September 25, 2008"}, {"Title": "Olympus service rocks!", "Author": "BarryG \"Editor\"", "ReviewID": "R2HVBPSIEP7PLK", "Overall": "5.0", "Content": "I absolutely love the E-520. I have bought five lenses for it so far; my favorite for sharpness is the 50mm f/2 prime lens, but for extra wide, I like the 9-18mm. I have the 70-300mm as well, and it can shoot a bird at 200 feet and put it right in your face.I am also very impressed with the kit lenses. I do a lot of manual focusing and shooting, and these lenses are sharp... truly unbelievable for the price, and they stand up well against some very expensive glass by other manufacturers. Over the years, I have spent a LOT more money for lenses that turned out to be inferior to these.Olympus makes some of the top lenses in the world.The menu on the E-520 was easy for me to understand from the start, but I've been shooting with SLRs for over 40 years. Even though the E-520 is called an \"entry level\" SLR, it might prove daunting for a beginning photographer. Nonetheless, if you are mildly familiar with f-stops, apertures, shutter speed and film speed (or equivalent), I think you'll find this an easy camera to operate.I have spent hours at [...] comparing studio photos and resolution charts as shot by various cameras. Olympus measures very well against the big money cameras in the studio shots. In the resolution charts, though, Olympus falls behind. So, if you need the absolute best digital image money can buy and you can afford [...], buy the new Nikon; or, shell out [...] for a Canon Mark II or III. All these cameras will give you better resolution than any Olympus camera.BUT... Although the price of those cameras is many times higher than your E-520, the quality of their pictures is not much higher. And, by the way, in my opinion the E-520 shoots better pictures than the E-30 or the E-3.I don't do magazine layouts or commercial photography; however, on occasion, I do like to blow a picture up to 16x20 or larger, and the E-520 gives very satisfying results.Moreover, Olympus has given me GREAT service. I have had to return two lenses for various reasons. In one case, Olympus shipped me a brand new lens; in the other case, they repaired the lens and had it back to me within the week; no questions, no hassle.", "Date": "August 12, 2009"}, {"Title": "excellent!", "Author": "J. Nicolas \"who_me2007\"", "ReviewID": "R1A6C17G12BH0Y", "Overall": "5.0", "Content": "This camera is just about excellent. Its size and weight is very ideal, its built and design remarkable, and above all its performance and image quality is very good. And it's got loads of features(withn built-in IS too) that with patient exploring and tweeking, will give you results that's expected of a DSLR made by one of the finest names in the imaging industry. Plus, other than the kit lenses I got with it which aren't really bad, I got a lot more better Zuiko  lenses to look forward to for higher levels of photography. As it is right now, I am very much satisfied with its performance. I will highly recommend this to a fellow enthusiast who aims to reach higher grounds in the art of photography. And the price makes it all worth it. Very good camera...in fact, excellent!", "Date": "March 26, 2009"}, {"Title": "Best Entry Level DSLR", "Author": "Drifter", "ReviewID": "R3FX99E3UI2JCX", "Overall": "5.0", "Content": "I have this SLR with ZD 14-54 2.8-3.5 lens.There no other body and lens combination under one grand that can match the value and quality of pictures I can get from Olympus. The E520 is compact yet has super ergnormics when compared to E420 and Canon XTi, both of which I owned at one time.", "Date": "September 6, 2008"}, {"Title": "Great features", "Author": "Michael A. Baum", "ReviewID": "R21Z0IESLPCPHQ", "Overall": "4.0", "Content": "I've used this camera for three or four months now and I'm very satisfied with it.  I'm not giving it 5 stars only because I haven't compared it to similarly priced Nikon and Cannon models, but I know that although definitely not for the point-and-shoot crowd, this is a good camera for intermediate to professional caliber photographers on a budget.  The biggest limitation would be the relatively small choice of lenses available, compared with the Nikon, Cannon, or Sony.  Also, the live view feature, while sometimes useful, really slows down the focusing and processing speed, to the point that I usually don't use it.  But it's still a nice feature to have.  The built-in stabilizer is particularly useful, and only a couple of other cameras have it built in to the body like this one.  I highly recommend forgoing the kit Olympus lenses and buy a good Sigma or higher end Olympus lens.  I'm using the Sigma 18-50 f2.8 macro, and it's great.  The kit 14-44 Zuiko is ok if you're only taking run-of-the-mill snapshots, but if that's what you're doing, why get a camera this sophisticated to begin with?  I used the Zuiko for a few weeks, but after getting the Sigma (available for about $375, but well worth it) I have yet to put the Zuiko lens back on.", "Date": "May 1, 2009"}, {"Title": "Great Camera for the money", "Author": "B. Christensen \"bcstargazer\"", "ReviewID": "R8I4QVWVYPM35", "Overall": "4.0", "Content": "I have a E410, E500 and now the E520 body. All of these are great cameras. The E520 has a very fast recycle rate on both the images and the flash. It is very easily used as point-and-shoot in auto mode and I can still get all of the effects that I could with a manual film camera. One point I will make very clear. If you buy this as a \"kit\" with lenses don't expect this performance. The lenses that come in most kits are cheap. Don't get me wrong, they work great in full sunlight... anything other though you will likely have slow responses and blurry photos. Many times the camera focus just will not acquire from low lighting. Buy good quality lenses and you will not be disappointed!", "Date": "October 30, 2008"}, {"Title": "Olympus e-520 - User Review", "Author": "Joey Z", "ReviewID": "R6CE40ZXLKLMF", "Overall": "5.0", "Content": "I purchased the Olympus E-520 about 6 months ago after researching cameras for about 3 months.  I looked at the Pentax K200D, Canon XSI, Nikon D40, Nikon D40x, Nikon D60, Sony Alpha 300 as well as the Olympus E-420 and the Olympus E-510.I read all sorts of detailed reviews ([...] has some of the best ones), watched video reviews and product demonstrations on YouTube, spoke to friends and family that owned some of the cameras mentioned above and most importanty, I went to camera stores and actually held (and worked with) the cameras in my hands.This is my first DSLR camera and compared to the competition, I'm very happy with my selection.  I wound up buying the camera body with the 2 kit lenses.  Originally I planned to only buy the body and then either the 14-54mm or 12-60mm higher end Olympus lenses but I decided that having two (lower quality) lenses would give me a nice range to work with as I learn different techniques.  Also I like to take pictures outdoors and am very happy with the pictures I've taken so far.  This is not to say that I haven't taken great pictures at night or indoors, I have and I will say that you can too but you have to learn how to use the camera.  I took loads of horrible pictures at first, lucky for me, my dad (who owns the Sony Alpha 300 and has been taking beautiful photos with SLRs for years) helped me to understand that most of my bad pictures were my fault and not the camera.I'd also like to recommend a book or series of books, \"The Digital Photography Book,\" written by Scott Kelby.  In this series Scott tells you exactly how to acheive a various effect without really explaining the theory behind it.  He will say something like if you want to get that silky warerfall or stream effect this is what you need to do: Switch your camera to Shutter priority mode, an set the shutter speed to 1 or 2 seconds.  To avoid getting a picture that is blown out (because of all the light your slow shutter speed is letting in) it is best to shoot around sunrise or around sunset.  Since the shutter is open for 1 or 2 seconds use a tripod.  Since the water is moving it will be blurry and the surrounding area will be sharp.Books like the one mentioned above will help you to realize that there is a lot you can do with your camera if you only take the time to learn.I read all of these Amazon reviews months ago and really like how people can comment on a someone's review and I recommend that you check out the comments that appear on 1 and 2 star product reviews, sometimes the comments reveal that the user incorrectly reviewed a product and that is helpful to know!All of the cameras above take good pictures.  It's important to feel comfortable navigating the camera menus, you should feel comfortable holding and taking pictures with the camera and you should think about what you'll be using the camera for.I actually just purchased the Olympus MF-1 OM Lens Adapter ($82 on amazon), which allowed me to buy an old Olympus OM 50mm f 1.8 prime lens.  Good glass will help me take better pictures and this adapter helped me to get a good quality lens for a ridiculously cheap price (I got the OM 50mm f 1.8 prime on ebay for $20).The more I use my E-520, the more I love it.  I'm learning so much and appreciating all that Olympus packed into this lovely camera.  You can check out to pictures that I submitted in online photo contests ([...]) by clicking on the following link:[...]Good luck in your search!Joe", "Date": "November 3, 2009"}, {"Title": "Awesome Camera", "Author": "Marvin L. Benoit \"Caribbean sailor\"", "ReviewID": "RX1XVY3Q85U8P", "Overall": "5.0", "Content": "I have been an Olympus Camera user since I bought my OM-1 over 30 years ago.  My first digital camera was the C-3030 camera which provided great use for over 8 years while living aboard my sailboat in the Caribbean.  It was a natural choice to move up to the e-520 as I have a large collection of OM lens and wanted to use them on the new DSLR.  The camera has a feel very similar to the C3030 in both menu and general feel.  After receiving the camera I was really impressed with the quality of the images, both vibrant and great resolution.  Although the original OM lens won't give me auto-focus, this has proved to be a minor problem as I am used to the full manual functions of the OM-1.  The quality of the pictures using the OM lens has been extraordinary. If you are looking for a camera that gives you a lot of bang for the buck I would highly recommend you consider it.", "Date": "September 21, 2009"}, {"Title": "New to DSLR's...", "Author": "Debbie", "ReviewID": "R3QNI03IEUSVCC", "Overall": "5.0", "Content": "This is my first DSLR. I saw it on promo at a local electronics store with the extra lens - It was the best deal I saw on a DSLR. So, I went and read the reviews on this camera and decided to take the plunge.I take loads of pictures of my dogs (show dogs) and thought this camera would give me more definition and clarity...and it does not disappoint.I simply LOVE this camera. The pictures are awesome and for a newby to the DSLR world, it is fairly easy to learn (although there is loads more for me to learn and I intend on doing my homework). This camera makes you want to learn cause the pictures are so awesome and if it's doing such a great job on automatic, I just can't imagine all the things it'll do once I learn a bit more.My friend went and bought a 14 mp Sony and although it is nice, the pictures are no better and the price tag was much heftier...and without the extra lens. Nope...I made the RIGHT DECISION.I'm starting to invest in some accessories. I really want the 300mm lens, but just can't afford it right now (any hints on a good alternative?). I bought a 500/1000 lens for long shots...now I need a monopod cause that lens makes my camera shake (too long to keep your hand steady). I'm also looking at the LOWEPRO 350 which will take both the camera and accessories as well as my 17\" laptop - think that will be my next purchase!BUY THIS CAMERA - it's simply AWESOME!!!", "Date": "July 21, 2009"}, {"Title": "money well spent", "Author": "John A. Milliner \"konfuzd1\"", "ReviewID": "R1JX93UJCEJY2M", "Overall": "5.0", "Content": "i read countless reviews in PC Photo and other photography magazines before deciding to purchase the e-520.  the most common complaint was confusing menus, which have never been a problem for me.  in reality, nearly every setting can be changed with the menu button, but pressing the ok will superimpose your settings over the lcd image, allowing you to see and change them on the fly.  a third option is using the buttons on the camera itself to change settings instantly.  i found this arrangement intuitive rather than confusing.  all reviews i read seemed to agree that this is a lot of camera for the money.  and i've shot some amazing pictures with it already.  i am especially impressed with its low-noise, long-exposure low light shooting ability, and the olumpus' command of color and white balance is nothing short of breathtaking.  want to warm up your shot?  use the manual white balance setting and shoot a light blue piece of paper instead of a white one to give the glow of sunset to a mid-day shot.  i'm even getting some awesome infra-red shots through a hoya r72 filter, with exposures up to 15 seconds.  i got the fl36r wireless electronic flash a couple weeks after the camera, and i'm glad i did.  a few nights later, a train derailed in front of my house, blocking the highway for hours.  that flash lit the scene like daylight out to well over 50 feet, giving very high detail and contrast with shockingly little noise.  i got the only night shots and they've been very popular with neighbors and newspapers alike!  (there were no injuries and no damage except to 11 rail cars and some track, if you were wondering)  i will have some of my work posted at [...].  could you get better shots with a Canon Rebel or the new Nikon?  maybe.  but i have nothing to complain about with respect to the e-520, and i now have an excellent flash, reflector, remote control, extra batteries, four filters and a bag for about what i would have spent on one of those other cameras.  my advice:  if you're reading this, stop thinking about it and buy one!  then get some toys to go with it and have fun with your photography!", "Date": "January 10, 2009"}, {"Title": "A superb entry level DSLR", "Author": "S. Sun", "ReviewID": "R1TSTAM8UYFZXK", "Overall": "5.0", "Content": "I looked at Canon XSI/XTI and Nikon 60D and decided to go with Olympus.  And I am very happy with my decision.The body is light, the pictures are sharp.  AF is very good.  When I showed the pictures to my friends who owned Canon and Nikon, they kept asking me if I improved the pictures on photoshop or not.  I told them no and they didn't believe me.The battery lasted very long.  I took hundreds of pictures so far in the last month and I have only recharged my camera once.3.5 fps is pretty decent.  The only minor complaint is that AF is a bit slow in low light situation, but it is no big deal for me.Overall, this is the best entry level DSLR in the market.", "Date": "October 17, 2008"}, {"Title": "Affordable DSLR Photography", "Author": "Amazon Customer \"helakejr\"", "ReviewID": "R18CJQVA7O0IM9", "Overall": "5.0", "Content": "I purchased the Olympus E-520 Kit for $400 after much online research. The reasons were as follows: photo quality, great price with \"must have\" features including body anti-shake, smaller size/weight 4/3's lens mount (so you will actually bring the camera with you), 3+ actual photos per second to capture your child on the soccer field or freezing a ball in mid-air, live view, Through The Lens (TTL) Auto-focus/Flash, anti-dust, many manual configurations and a true 10 megapixel sensor. After owning this kit for 2 years I discovered: ALL the above is TRUE! The BATTERY LIFE with the standard battery pack IS AMAZING, often I would go for weeks at a time taking 50 - 100 pictures per soccer game without the need to recharge the battery pack. I soon discovered that I needed a better Tele-focus lens, again after much research I purchased a refurbished Zuiko 70-300mmm lens Olympus Zuiko 70-300mm f/4.0-5.6 ED Lens for Olympus and Panasonic Standard Four Thirds Digital SLR Cameras, this is the lens that I ended up using 75% of the time and the standard 14-42mm 25% of the time. I noticed that with my previous point-to-shoot I ended up missing shots and deleting blurred shots about 20% of the time and with the Olympus E-520 about 1% of the time (or 99% of my shots were as intended). My wife noticed that even some of my photos were now suitable to be printed and framed! Another noticeable feature that use of the older Compact Flash (Type I and II) allowed me to purchase an 200x 8GB Lexar card for about $10 which even on vacations was never more than half full with 2000+ photos. Summary: Great value for the money for those that will use auto features 80%+ of the time anyway (that is in point-to-shoot mode). Only CON is no video however, my phone does 720p so I didn't miss it. Remember: The best camera is the one you have when you want to take a picture!", "Date": "January 2, 2012"}, {"Title": "Wonderful camera", "Author": "Big-Z", "ReviewID": "R35VSQ68JXAC6F", "Overall": "5.0", "Content": "This is my 28th digital camera and I love it. I had the Canon SXI for a short while and it was good but did not impress me. This SLR does impress me. It is wonderful for scenic work and for studio work. It is the best buy in a dSLR by far.", "Date": "December 13, 2009"}, {"Title": "Great price", "Author": "A. Jose", "ReviewID": "R2IYFTJPLPFX42", "Overall": "4.0", "Content": "This is my first DSLR and I picked the E520 over Nikon and Canon models because it does everything and more at a much lower price.  Camera works great and pictures are fantastic.  The only complaint is the auto focus is slow in low light but I expected that and the manual focus is not as easy as my old SLR cameras.  Overall I am very satisfied with the camera and after years of waiting I bought the E520 because I think its the best DSLR Under $600 and I paid much less.", "Date": "May 31, 2009"}, {"Title": "New Experience", "Author": "James C. Liebegott \"JaaCee\"", "ReviewID": "RQQZKLGGL2UFJ", "Overall": "5.0", "Content": "I've had a digital camera for several years, but this is the first one with all the bells and whistles.  I'm still learning about all the settings and options, but am very happy with it so far.  Also, my dealings with Amazon on this, an additional lens, and a card were first class, and the prices were quite acceptable.", "Date": "January 11, 2009"}, {"Title": "E520", "Author": "Joseph L. Gill \"axiaman\"", "ReviewID": "R1X77CN5W4653E", "Overall": "4.0", "Content": "This camera is my first DSLR and I am satisfied. A couple of draw backs though and they are a weak flash if subject is more than 15 feet away and the auto focus is terrible if the lighting is not great.", "Date": "January 9, 2009"}, {"Title": "Nice camera, very pleased", "Author": "SamIam", "ReviewID": "R5UMXABGX66JF", "Overall": "5.0", "Content": "This is a great camera for the price. I have had it for about 2 months now. It feels really good in my hand, which I could not say with the same with the D60 or Cannon XS series. In-body IS works well. Autofocus is reasonably fast. Auto exposure works well, even with the annoying flash turned off (it uses the flash to get the white balance I believe). Lots of configuration options. Image quality is excellent.Downside: The included software isn't the most fully featured however.I don't know much about SLRs and am getting my feet wet. This is my first and I am not disappointed. I just shoot in auto mode and it does a very good job. Way better then a point and shoot, and a lot more fun to use.", "Date": "December 8, 2008"}, {"Title": "A pleasant buy", "Author": "njdude", "ReviewID": "R91KMPM048L0R", "Overall": "5.0", "Content": "Just went by the reviews on Amazon and the more expensive model of the same lineage.  I am quite pleased with the speed and quality of pictures.  Hunts a bit in low light, but the colors in the picture are quite good.  Overall, a good buy for the money and an easy picture taker.", "Date": "August 14, 2009"}, {"Title": "Love this camera!", "Author": "Elisabeth", "ReviewID": "RZDYEH4HTQPG6", "Overall": "5.0", "Content": "This is my first dSLR and I absolutely love it.  The camera fits really well into my hard -- others i looked at were a little smaller and didn't fit my hand (even though they are fairly small) as comfortably.  The default menu is great -- everything you need access to is right at your fingertips.  I bought the body only and upgraded the lens and I'm really glad that I did.  I knew I was going to want to upgrade to a lower fstop and saved money by just buying the body & upgrading right away.I would highly recommend this camera!", "Date": "June 24, 2009"}, {"Title": "Olympus e520 is super", "Author": "CoachK \"CoachK\"", "ReviewID": "R2DDAOXBTFQPMT", "Overall": "5.0", "Content": "After extensive research of beginning level DSLRs and finally waffling between the Canon eos Rebel XSi and the Olympus e520, I picked the Olympus for my first DSLR.  I am extremely pleased.  I have taken pictures under all sorts of circumstances and on different settings and am very pleased with the results.  The Olympus is easy to use and can cover a range of situations.  As of yet, I have not had any difficulties or problems. The camera arrived in just 3 days after ordering and was just as advertised.  I'm having a ball!", "Date": "May 5, 2009"}, {"Title": "Olympus Evolt E520 Camera", "Author": "Susan J. Morache", "ReviewID": "R3FL3SSHVP9YAD", "Overall": "5.0", "Content": "The best camera I have ever owned.  Takes excellent pictures.  I have had Canon cameras and have been very disappointed with the quality of pictures.  This camera takes the best pictures yet.  I am very satisfied with this product.", "Date": "April 27, 2009"}, {"Title": "Forget Cannon and Nikon and Sony.. this is the real deal", "Author": "Brad Jackman Clooney \"musicmaker\"", "ReviewID": "R3M0DPPGU4GVGL", "Overall": "5.0", "Content": "I researched heavily in the internet about SLR cameras before I took the plunge.  Afterall, if you are going to spend this much money on a gadget, you better be careful and that you get the best bang for the buck.  Almost all editorials from SLR experts are unanimous about this model being superior to Canon and Nikon offerings.  This 2008 model has all the 4 features that are most desired in a modern SLR, which are: a live view display, dust protection mechanism, image stabilization and dynamic color range.  Among its class and price range, this camera is the only one that has it all.  When I saw the price discounted to almost half and a few hundred dollars less than comparable Nikon and Cannon and Sony offerings (these three brands actually received less favorable ratings but are significantly more expensive), I thought it was a no-brainer.  I had to look twice at the price to make sure I was not mistaken.  Indeed, for a lot less dollar but with a lot more features and quality, this item is real steal!", "Date": "December 15, 2008"}, {"Title": "Right price for a interchangeable device.", "Author": "Dennis Williford", "ReviewID": "R2C460R3FFDCG3", "Overall": "4.0", "Content": "This camera is a real work horse, for a mid level instrument this is a good deal. Technology has advanced a great dealsince buying this camera, nonetheless it continues to serve a great deal of my needs.", "Date": "December 3, 2013"}, {"Title": "First Digital SLR Camera", "Author": "Amelia", "ReviewID": "R37DMBUELKKWGG", "Overall": "4.0", "Content": "I found this camera to be a good starter to shooting with an SLR camera. I like amount of control and customization it has to offer along with a variety of shooting mode options (landscape, portrait, night, macro etc.). The 4/3rds system is a plus as well, as you can buy smaller lenses which comes in handy for traveling.As I said, this is a good beginner camera for the price. However, as I have started learning more and taking more pictures, I have found myself wanting to upgrade to a higher quality camera. If you are a low-light photographer, this may not be the right choice. I have noticed the quality is not as sharp and there tends to be a lot of noise in low-light conditions. However, when taking daylight/landscape photos, this camera can be really great.Overall, good quality camera for the price.", "Date": "February 5, 2013"}, {"Title": "I forgot this gem- 2012 and still a super camera!", "Author": "Jeffrey R. Bissell", "ReviewID": "RYDK45N606KA6", "Overall": "5.0", "Content": "Really forgot this beauty for shooting a wedding-but try as I might with 3 other slurs-the 520 with the better 14 -54 lens and the 36r flash just would not be denied. I put an umbrella on the stand with with the flash on remote and after setting it up, and shooting several shots to get the right aper. and s speed etc. just shot away. Beautiful Olympus color. None of my slrs match the color and easily shoot portraits as well. It was sooo easy. People were quite impressed with the professional quality-my first real wedding! Wish I could show some shots-the lights being off camera made a real difference! I almost missed what the camera could do-it was born for studio shots and portraits.", "Date": "January 24, 2013"}, {"Title": "It was a good value at the time but won't age well at all", "Author": "genocidal_maniac", "ReviewID": "RIG0TO6NDFAD2", "Overall": "4.0", "Content": "The issue, of course, is micro 4/3rds.it is a good like 50% smaller than an APS-C sensor. This means noisier images and bad low-light capability.And low-light is the main differentiator between cameras. Any camera can take good pictures when it's bright and plenty of light.It was a good deal when I bought it. For $450 I got two lenses. A comparable Nikon or Canon would have cost $500 with just one lens.and it works well. But I took it on vacation recently and the bulk was unbearable for its power as an imaging device.", "Date": "November 20, 2012"}, {"Title": "Olympus-E520", "Author": "Allan Hawkins V", "ReviewID": "RLY2EC3G6CSQ0", "Overall": "5.0", "Content": "Hola Gente:My only concern? Only have one format picture relation of 4:3 and I take all my pictures in 3:2 format, so I'll go for the E620.If you buy the body and the 9 to 18mm Zuiko lens you'll ready for panoramic, and is just great!Saludos, Allan.", "Date": "June 26, 2010"}, {"Title": "love it", "Author": "Jan M. Lakin \"pro photogrpher\"", "ReviewID": "R1E5JGF9N9W68Y", "Overall": "5.0", "Content": "i bought the camera as a back up to the E-1, although the E-1 is built much stronger, the e-520 performs wonderfully. I will buy an E-3 eventually, but this will definitely help out in the interim .", "Date": "June 20, 2009"}, {"Title": "Really nice upgrade from an Olympus 8080", "Author": "Terry Quinn", "ReviewID": "R2Q2HOP0Z97G9G", "Overall": "4.0", "Content": "I purchased this camera as a (potential) upgrade for my older Olympus 8080. Now that I have had a couple of rounds with this camera,  I am glad that I did.  While the standard \"kit\" lens is underwhelming, you can get some VERY nice Olympus lenses for not terribly much money. With a lens upgrade,  the pictures you can get with this camera are truly excellent!", "Date": "June 9, 2009"}, {"Title": "Great camera for a beginning DSLR user", "Author": "Chicago Book Addict", "ReviewID": "RSRYN7B655NT5", "Overall": "4.0", "Content": "Prior to using this camera I shot a lot on a film SLR camera as well as a point and shoot camera.  However as I began taking more and more photos for my blog I realized I wanted more features and the ability to use interchangeable lenses.  I got this camera because it seemed like a good DSLR to grow into.  It had a good range of features and was at a very affordable price point compared to the DSLR category as a whole.  I also liked the reviews it got in Consumer Reports.I also liked that I could shoot in automatic mode now using the various settings and eventually use more in manual mode.  So far it has lived up to my expectations.  Even though I don't take advantage of all he features and am still learning I get my money's worth.Among the features I appreciate about the camera is all the different automatic settings.  These are great if you're not comfortable with shooting in manual mode yet.  That said, I've noticed that many point and shoot cameras have more modes.  For example, a friend has a different Olympus model (point and shoot) that has a food mode.  Given I am a food blogger it's one setting I WISH I had.  However, you still do get quite a range of modes and they fit most of my needs well.I also like that as far as a DSLR goes, this one isn't too cumbersome.  Yes, there are smaller ones on the market, especially with the micro four-thirds market, but this one is manageable.  I can tuck it into a large purse or normal sized backpack without worrying about it.  It's still large enough that I don't take it along to bars or parties much, however this would be true for me of most DSLR's on the market.Does it take better quality pictures with a point and shoot?  Overall, my experience is that it does.  I imagine that the picture quality would be even better for someone with more DSLR or general photography experience.  Since I'm shooting primarily in automatic I'm not getting quite the results I hoped for and still have to tinker, but I attribute this to me not the camera.  I don't think that for a novice it necessarily makes for better pictures but co-workers who are more experienced than me tell me the quality is superb.  I'm hoping to get there some day.  That said, I'm very satisfied with the quality I get for my skill level but it certainly won't make your photos look professional if your skills aren't (again, something I fault myself for NOT the camera).Overall this is a great camera.  I've been very happy with the size, quality of pictures, and range of functions.  I highly recommend it for a beginner who is looking to get a DSLR, but wants to start at an affordable price point.", "Date": "May 28, 2009"}, {"Title": "Very Satisfied with the camera", "Author": "Mattaphore", "ReviewID": "R32FYIABBIHI6X", "Overall": "5.0", "Content": "When I decided to purchase an entry level DSLR, I decided upon the Olympus E520 over the Canon Rebel XSi and Nikon D40,D60,D80.The price was great for such a feature packed product, and I really liked the layout of all the information. Olympus gives you 3 ways to access all the essentials (ISO, White Balance, Auto/Manual Focus mode, etc) and much more (Saturation, Sharpness, Face Detection, etc.)Gordon Laing from Cameralabs.com does a great review at [...]All in all, it's a great camera and I'm happy with all my results so far.", "Date": "January 6, 2009"}, {"Title": "Excelente camara digital SLR!!!", "Author": "Pablo Fernandez Leal \"pepegrillo\"", "ReviewID": "R1MS1QBBQUYY46", "Overall": "5.0", "Content": "Despúes de realizar una amplia investigación y preguntarle a familiares y amigos que conocen de fotografía, me decidi por Olympus (Las dos opciones que habia considerado era Canon (Rebel XSI) y Nikon (D60). Ninguna de estas la conseguia por menos de $520. Adicionalmente pude conocer que Olympus fue la primera marca en introducir la opcion \"Live View\", es lider en el estandar Fourth-Thirds (cuatro tercios). Sin lugar a dudas la mejor opcion para aquellos que quiere iniciarse en la fotografía digital con lentes intercambiables.", "Date": "December 12, 2008"}, {"Title": "A + Camera", "Author": "Mass. man", "ReviewID": "R363YR3I07A32Q", "Overall": "5.0", "Content": "I purchased this camera body only about a month ago and wow, I have an evolt 500 and now have the 520 both take great pics, spend the little extra and get the 520 if you are looking at Olympus I highly recommend it, this is an A+ in my book.", "Date": "August 6, 2008"}, {"Title": "Great when it works", "Author": "Picturesque Music", "ReviewID": "R9VPDC5XH2ILU", "Overall": "3.0", "Content": "I've been using this for months now and finally got \"permission\" to sell it. I'll be switching brands to another DSLR; Canon and Nikon are the preeminent brands for DSLR and I wanted to save a few bucks. I guess this time that didn't work.This is my first DSLR. I've had other digi cams, all point and click but wanted better quality images.When this thing focuses the pics are nice, especially outside. The built in flash indoors is ok, too. It takes pictures quickly as well.The biggest problem with this camera is that its auto focus is a total catastrophe. The reason I've waited months for this review is to ensure I had checked into all possible solutions. I've looked online, I've read the manual, I even spent a couple hundred bucks on a nice flash for it. Tried all the various focus approaches, one dot, three dots, manual + auto, etc. Looked into lighting, etc. I didn't rip it out of the box, fail in its use and post online immediately in frustration. Nonetheless, the auto focus on this often just does not work and is during these times of not working worse than a 10 year old Fuji digital camera I got a long time ago.The problem, and you'll note a few others have found the issue, is that it will seek focus poorly. Often it will seek endlessly when in continuous mode, going back and forth over a clean focus but not taking the pic, and even though the lighting is not bad it just cannot for the life of itself focus properly and take the pic. And other times when in single focus mode it has at times actually gone past a clean focus point into the most blurry possible focus and then it took the picture.I'm sure some would read this review and tell me I only deserve to be using $60 point and clicks and maybe that's the case. Or maybe the lens was damaged from the get go (I believe I'm past warranty, so I must have had this since Xmas 2009). Or maybe I have less tolerance for poor behavior. Whatever the case, I'm done with it.", "Date": "September 6, 2011"}, {"Title": "Why I bought a used E520 camera body", "Author": "unclemark", "ReviewID": "R33NMG92QJOVJD", "Overall": "5.0", "Content": "I already had an Olympus E520 with several lenses and other accessories.  I took a spill while trying to get a shot of a bird up in a tree... and broke the hot shoe mount for the flash.  Rather than pay more than twice as much for the (out of stock) E620... I replaced a damaged E520 body with one in very good condition.  I'm not interested in \"video\" capability and a repair would've 1) left me without a camera for an unspecified period and 2) probably would've cost about the same as just doing the replacement.", "Date": "September 20, 2012"}, {"Title": "Olympus Evolt E520", "Author": "Eugeania M. Cowe \"Gina\"", "ReviewID": "RE1C9AGJ9HGNF", "Overall": "5.0", "Content": "I am very happy with this product.  It lives up to the advertisementOlympus Evolt E520 10MP Digital SLR Camera with Image Stabilization w/ 14-42mm f/3.5-5.6 Zuiko Lens", "Date": "January 9, 2009"}, {"Title": "Great camera", "Author": "Diane M. Porter", "ReviewID": "R6YGF8CZN5TQI", "Overall": "5.0", "Content": "This camera was exactly  like described, I had troubles with my recent camera and this was two steps up from my malfunctioning camera, I had all the parts from my old one, so this camera body was a great replacement, and shipped really fast, thanks so much", "Date": "May 31, 2014"}, {"Title": "Fits my hand perfectly", "Author": "runbeerclimbdude", "ReviewID": "R6JDI6CKR1FIP", "Overall": "4.0", "Content": "This camera is my first DSLR after having had a number of Olympus P&S; cameras over the years.  I have larger hands, and this model was one of the few entry level DSLRs that I could grip comfortably.  Similarly priced Canon and Nikon models were simply too small for me.  The performance feels very snappy to me; I'm never waiting for the camera to do anything.  The in-camera image stabilization is great, as is the ability to configure the camera in so many different ways.  At times I am disappointed by the sharpness of the images I take, but that is a minor quibble.  I take so many pictures now, and still love this camera.(The reviewer was compensated for posting this review. However, the opinion stated in the review is that of the reviewer and the reviewer alone. Further, the reviewer independently selected this product to review and has no affiliation with the product maker/distributor, Amazon or the review requester.)", "Date": "January 26, 2011"}, {"Title": "Great Camera", "Author": "Baku", "ReviewID": "R33UMGHJPV9M5K", "Overall": "5.0", "Content": "- Excellent amount of customization and shooting modes- intuitive interface, super user friendly- displays a lot of useful information on a display and allows to changes settings easily from there- anti dust ultrasonic wave function to clean sensor (never cleaned mine so far)- functions found only in higher end DSLRs from other brands- excellent jpeg colors straight from the camera- double memory card slot CF  and XD- in body image stabilization IS, also can be adjusted manually for manual non-chip lens- high quality kit lens- not so great in low light resulting in grainy pictures- 2x crop factor great for reach when shooting wildlife- small sensor- autofocus in low light uses flash bursts which is quite annoying unless you get FL-50R flash that has infrared beams AFall in all is a great camera, that surprises me after so many years with ability for customization for every shooting situation, just recently I looked up Bremizer method and it discussed about assigning and locking your exposure and autofocus to another button. I checked my E-520 and it had that function.", "Date": "January 17, 2011"}, {"Title": "An amazing camera from Olympus!", "Author": "Judith Taylor \"JT\"", "ReviewID": "R2DCTAKV7PP5EQ", "Overall": "5.0", "Content": "I love Olympus cameras, that being said the E-520 is my second Olympus DSLR.. In 2008 I returned to college to obtain my degree in photograhy and Olympus was sponsering a contest for college students. I was intrigued and borrwed the E-3 from the school and let's just say it has benn love ever since :)  In fact I had the camera for two weeks when the school called me to remind me to return it!  I was only supposed to have it three day.The E-3 ws out of my budget, so I  bought this beauty and today even after 4 years and once Olympus sent me a brand new E-520,, which was totally unexpected, I still love this amazing little camera. She is fully customizable, the colors are absolutely amazing and I've been able to use Olympus prime film lenses on it, so nice.  No regrets on the purchase or shooting Olympus they make amazing cameras.  I also owned the E-420, curranlty own E-PL1 snf the VR-340 point and shoot and I've nenver been dissapointed with any of these cameras.", "Date": "May 16, 2009"}, {"Title": "Great buy, great deal, great camera!!!!", "Author": "crystal tear", "ReviewID": "R2V4OVKL2IHB8X", "Overall": "5.0", "Content": "I have done a long research before I decided to go ahead with this camera, I was thinking about Nikon, Canon (like most of us), Olympus (in the past I had p&s; Camedia 4000 and it was excellent camera) and Pentax.Finally I decided to buy this one and I am so very happy with the buy!!!Photos are great and even if you are not advanced photographer you manage to take some good shots! It is easy to operate and relatively light.", "Date": "December 20, 2008"}, {"Title": "Best camera under $600...", "Author": "Raider Fan", "ReviewID": "R14QHI5W0XQRB9", "Overall": "4.0", "Content": "This camera is perfect if you are on a budget and want a digital SLR. Everything so far works great, easy to use, takes crisp and clear pictures. If I had one complaint it would be that the focusing system can be slow at times. I am used to a Canon Rebel and if you have ever used a Canon you'd know what I mean. There is a reason why most sports photographers use Canon, they are lightning fast when it comes to focusing and frames per second. Anyway it is definitely worth the money.", "Date": "January 30, 2010"}, {"Title": "E520 pops!", "Author": "Richard P. Burd", "ReviewID": "R1TY2DOLEIV6FB", "Overall": "5.0", "Content": "I use a Canon Rebel XSI at work. I bought the E520 for my personal use. It's a great camera at a much better price. I wold highly recommend it.", "Date": "July 6, 2009"}, {"Title": "great camera", "Author": "Music Man", "ReviewID": "R219H6WW6Q0ZYA", "Overall": "5.0", "Content": "I've never purchased anything but Olympus Cameras... I have three of them dating back to  the 1980's.  Every Camera has been an excellent camera as the E 520 has also  has proven to be.", "Date": "October 18, 2008"}, {"Title": "Out of focus", "Author": "Soldier Girl", "ReviewID": "R2ZRWYI97PKHYD", "Overall": "1.0", "Content": "Even with all its fancy stuff, my cheap pocket digital camera takes better photos than this camera.  Highly disappointing.  Now I know why previous owner sold it.", "Date": "December 30, 2013"}, {"Title": "E520", "Author": "Stephen A. Jaggers \"Steve\"", "ReviewID": "R1PFGKUYPLJTU5", "Overall": "5.0", "Content": "The Evolt 520 arrived as adfveritized.  It is in good condition and works well.  It is a shame that Olympus abandons their customers with lack of affordable products.", "Date": "September 13, 2012"}, {"Title": "Olympus Evolt E520 - Very Satisfied!!", "Author": "M. Parker \"Loving My Camera\"", "ReviewID": "R1MG88RJZBV0PW", "Overall": "5.0", "Content": "I got this camera for my birthday, November 2008 and LOVE IT!!  I would highly recommend it to anyone!  The delivery of the camera was excellent as well.. arrived just as I was told.", "Date": "December 12, 2008"}, {"Title": "Happy Picture Taking!", "Author": "Amazon Customer \"FG III\"", "ReviewID": "RNIK7U86ZB66", "Overall": "5.0", "Content": "First camera beyond a simple point-and-shoot for me. I am just constantly amazed at the quality of pictures this camera takes...", "Date": "April 26, 2009"}, {"Title": "Broken", "Author": "R. Vera", "ReviewID": "R2TQ14T070KBRM", "Overall": "2.0", "Content": "The XD picture card would not stay (click inside) in the camera therefore the camera would not recognize it had a picture card inserted and I couldn't use the camera at all!!", "Date": "May 12, 2010"}, {"Title": "awesome camera", "Author": "Darkknightt", "ReviewID": "R359A4MDM7AH11", "Overall": "5.0", "Content": "this is my first SLR camera and so far i'm very satisfied with it.  it takes great pictures, lots of manual controls and the speed is awesome.  after buying a few lenses for it ive been experimenting and it definitely is worth the price in my opinion.", "Date": "April 9, 2009"}, {"Title": "easy to use DSLR and the picture is great", "Author": "Yuan Tai Chen", "ReviewID": "RCNP3BQ9E1AJQ", "Overall": "5.0", "Content": "this is the first that I use a DSLR, I think it is pretty easy to use.the picture is also great, but I don't like the auto mode I prefer the aperture priority shooting mode.", "Date": "July 4, 2009"}, {"Title": "Quick Transaction", "Author": "T. Jackson \"G\"", "ReviewID": "RT01BOJJ9KID9", "Overall": "5.0", "Content": "The complete process did not take as long as first believed and my camera was in great condition.", "Date": "April 12, 2009"}, {"Title": "Nice Camera, Cheap Kit Lenses", "Author": "John D. Ruley \"Aviation Photog.\"", "ReviewID": "R3S9SLYJVE0VEB", "Overall": "2.0", "Content": "The Olympus e520 is a good entry-level DSLR with in-body image stabilization, usable live view, and many other nice features. While made in China, it has a metal lens mount, and I was impressed by its overall construction. I wish I could say the same about the bundled kit lens, which is a cheap 14-42mm zoom with a plastic mount. I'm a semi-pro aviation photographer. I got acceptable results on the ground, but noticed a slight but definite blurriness in the air, despite using the image stabilizer. Ordered the companion 40-150 mm zoom separately and when that arrived, discovered that it would not deliver consistently sharp focus at infinity and max zoom, regardless of camera settings, due to motion of the lens end, also noticed the same in the 14-42 mm lens. This is unnaceptable for me. I returned the camera and both lenses for a full refund. Amazon's service was excellent, and the camera is good, but the lenses are terrible.", "Date": "February 9, 2009"}, {"Title": "Why a DSLR", "Author": "John C. Henze", "ReviewID": "RBGMQ7Z2NEMEX", "Overall": "5.0", "Content": "When you have superzoom cams like the Panaonic FZ-28 with a zoom from 28-476mm for only $262 why would you go with a DSLR that will become obselete in a year?I have a system film Nikon but in the flux of e cameras it seems to be almost a throw away to me.Having said that I love Olympus products..............", "Date": "December 30, 2008"}, {"Title": "EVOLT 520", "Author": "IRWIN RUBACK \"2-3 NOTCHES ABOVE AMATEUR\"", "ReviewID": "RWGXA9D23PBYM", "Overall": "3.0", "Content": "A GREAT CAMERA FOR THE AMATEUR IF SERIOUS ABOUT PHOTOGRAPHY, IT HAS AN AWFULLY LOT OF SETTINGS THAT CAN BE USED BUT TAKES A LOT OF STUDYING THE MANUAL TO MASTER ALL OF ITS POTENTIAL.I HAVE YET TO EXPERIMENT WITH CONTROLLING WHITE BALANCE AND BRACKETING BUT I'M GETTING THERE.THE PRICE GIVES MORE BANG FOR THE BUCK THAN THE MID-RANGE NIKON OR CANNON.", "Date": "November 23, 2008"}, {"Title": "My olympus camera", "Author": "Harold J. Winston", "ReviewID": "R1KBX5EMN4O49Z", "Overall": "2.0", "Content": "I thought the camera was a lot more then what it is.I have used it and am not inpressed with it's preforamce.I'm compareing it to my Nikon D100. I'llkeep on trying and see what I getHJWinston", "Date": "July 14, 2009"}, {"Title": "My camera was bad?", "Author": "Mar \"Marinera\"", "ReviewID": "RJJ0HCUJAG90S", "Overall": "2.0", "Content": "I used it for 3 days and did lots of pictures.I owned before this one Nikon D50 and what beautiful pictures the nikon did.I used this one. and i did not get any decent ones.probaly i read it could be the lens?i dont know but i return and got another nikon. I just love nikons. maybe its me to be a nikon fan.", "Date": "July 2, 2009"}, {"Title": "Damaged", "Author": "Jane Eyre \"Jane\"", "ReviewID": "R2E0HCZMJZTPII", "Overall": "1.0", "Content": "My camera's Compact Flash drive slot came damaged. Almost half the pins are bent, thus the camera's ability to not read a CF memory card. Very disappointed in this \"new\" item arriving damaged.", "Date": "January 6, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "10-megapixel CMOS sensor captures enough detail for photo-quality 18 x 24-inch prints\nLightweight ergonomic design; body only, lenses sold separately\nEnhanced in-body Image Stabilization with Supersonic Wave Drive technology\nFace Detection and Shadow Adjustment technologies; Perfect Shot Preview\nCompatible with CompactFlash Type I and II, Microdrives, and xD-Picture Cards (not included)", "Name": "Olympus Evolt E520 10MP Digital SLR Camera with Image Stabilization (Body Only)", "ImgURL": "http://ecx.images-amazon.com/images/I/51O75U4kG8L._SX300_.jpg", "ProductID": "B0019FJM7W"}}