{"Reviews": [{"Title": "Excellent but Noisy PTZ Network Camera by Panasonic", "Author": "Amazon Customer", "ReviewID": "RVVW41EPSY9LQ", "Overall": "4.0", "Content": "Businesses have used security/surveillance cameras for many years, to identify people in certain areas of the building, to watch for suspicious activity, or to catch people in the act of doing evil deeds. However, as technology has improved and prices have dropped, these cameras have now become popular additions to home security systems as well. While many people still choose Closed Circuit Television (CCTV) cameras and recorders, mostly due to their low cost, the added flexibility of network cameras (otherwise known as IP cameras or Internet cameras) is starting to greatly influence homeowners. Network cameras allow easy installation and integration with your wired or wireless home network. While CCTV cameras require a standalone monitor to view the images, network cameras can be controlled and viewed from any computer on your home network, and can also be viewed from outside your network with computers, cell phones and PDAs that have an active Internet connection. But choosing a good network camera that meets your needs can be a bit tricky, as most of the network cameras currently on the market are either low end (relatively inexpensive) or high end (extremely expensive); with very few choices that fall in between. If you're looking for a network camera that you can control pan, tilt, and zoom, it can be very difficult to find a quality device that is affordable. Well Panasonic recognized the strong need for a mid-level network camera, which would offer features that are usually only available on high priced models. They answered this consumer need with the Panasonic BB-HCM527A PoE ceiling mount, dome network camera; complete with motorized pan, tilt and zoom features.Setting up a home computer network and adding IP cameras to this network requires a bit of technical aptitude, so you may wish to call upon the help of someone with a computer technical background if you are not very tech-savvy. This review is for the BB-HCM527A network camera, so I am going to concentrate on the camera itself and not include a long dissertation about home networking in general.The Panasonic BB-HCM527A network camera is NOT a Wi-Fi device, so you need to make sure you are able to run a CAT5, CAT5e or CAT6 cable from your network router, switch or hub to where your camera will be mounted. This model is also a PoE (Power over Ethernet) device, so you will want to make sure your network has a PoE switch, or you will need to purchase a separate PoE injector. Although PoE technology is becoming more popular in business environments, most home networks do not yet utilize this new and somewhat expensive technology. However, the advantage of PoE is that your power travels over the same Ethernet cable as your data; meaning that you do not have to have a power outlet right next to where you plan to mount your camera. I do not have a PoE network in my home, so I purchased the PD-3001/AC 1PORT Poe Injector Ac Input 802.3AF and Cisco Supported, made by PowerDsine. This allowed me to run a cable from my network switch to the injector, which plugs into a wall AC outlet, and then run another cable from the injector to the network camera itself. You now have your power and data connections all in one wire.This remarkable device is a feature rich network camera, with nearly all of the bells and whistles you could want. It is able to pan from -175 to +175 degrees, giving a total sweep of roughly 350 degrees. Mounting the camera to the ceiling is a fairly straightforward process, utilizing the easy to follow instructions and mounting hardware, which is all included in the camera kit. It has a tilt angle adjustment from 0 degrees (straight down) to +82 degrees. The zoom capabilities of this camera are not quite as impressive; offering only a 4.6x zoom (2.3x optical, 2x digital). Still, for most home or small business applications this should prove to be sufficient. Video output can be adjusted between three different resolutions, at up to 30 frames per second. Output formats include JPEG, with three different quality settings, and MPEG4. The light sensitivity of this camera is from 2 to 100,000 lux, and can go all the way down to 0.2 lux when in \"Color Night View\" mode. It also allows 2-way, half-duplex audio, with a built-in microphone and an output for an external speaker (sold separately). Buyers should be aware that there is no built-in speaker in this camera, so it will only allow 1-way audio unless a self-powered speaker is plugged into the camera. All video and audio from this camera can be monitored from your home or business network, or from outside your local network with a computer, or a web compatible cellular phone or PDA; all using a free Internet service called \"Viewnetcam.\" This Internet service is totally free for anyone who owns a Panasonic IP camera, and it gives full access to all of the camera controls, configuration settings, and video/audio output from the camera. I could go on and on, explaining all of the features and specifications of this network camera, but I will simply list them below for your review.Technical Specs:**************** Lens = 73° Wide-Angle* Lens Brightness = F1.9 (Wide) - F2.8 (Tele)* Required Light Intensity = 2 to 100,000 lux (0.2 to 100,000 lux in Color Night View Mode)* Lens Focus Point = Fixed (focal range: 0.5m to infinity)* Zoom = 4.6x (2.3x optical, 2x digital)* Image Sensor = 1/3.6 inch MAICOVICON, approx. 370,000 pixels* Horizontal Viewing Angle = Tele: 32° (optical) / 16° (digital), Wide: 73°* Vertical Viewing Angle = Tele: 24° (optical) / 12° (digital), Wide: 55°* Remote Pan Angle = -175° up to +175°* Remote Tilt Angle = 0° up to +82°* Maximum Pan/Tilt Speed = Pan: 300°/sec, Tilt: 80°/sec* Image Compression = JPEG (Motion JPEG), MPEG4* Video Resolution Settings = 192 x 144, 320 x 240 (default), 640 x 480* Image Quality Settings = JPEG (favor clarity, standard, favor motion), MPEG4* Frame Rate = Max. 30 frames/sec @ 640 x 480, 320 x 240 or 192 x 144* Progressive Scan Video Output* Authentication = User ID/Password, SSL* IPv4/v6 Dual Stack* Supported IPv4 Network Protocols = TCP, UDP, IP, [...] FTP, SMTP, DHCP, DNS, ARP, ICMP, POP3, NTP, UPnP(tm), SMTP Authentication, RTP, RTSP, RTCP, SSL, [...] TLS.* Supported IPv6 Network Protocols = ICP, UDP, IP, [...] FTP, SMTP, DNS, ICMPv6, POP3, NDP, NTP, RTP, RTSP, RTCP, SSL, [...] TLS.* Buffered Images = Approx. 350 images (320 x 240) -standard image quality (16kb per image), with time display, without using SD/SDHC memory card.* Image Buffer = Alarm, Time or Motion Detection Triggers* Image Transfer via E-Mail = SMTP, FTP, [...]* DDNS Compatible = Yes (using free Viewnetcam.com viewer)* Cellular Phone Compatibility = Remote Monitoring* Multiple Camera Views = 4-up, 9-up, or 16-up* Audio Signal = 2-Way / half-duplex* Audio CODEC = ADPCM (32kbps)* Audio Frequency Range = 300Hz - 3.4kHz* Audio Input = Built-in Microphone or External Microphone Input Terminal (3.5mm mini-jack)* Audio Output = Line Output Terminal for External Speaker (3.5mm mini-jack)* Audio Reception = Method: ActiveX / Decoding: ActiveX* Network Connection = Ethernet (10Base-T/100Base-TX)* SD Card Slot for Image Buffer = Up to 2GB SD, or up to 8GB SDHC* Analog Video Output = Analog Composite Plug (NTSC/PAL)* Built-in Motion Sensor* Power Source = PoE: 48V, IEEEE 802.3af-compliant Power over Ethernet* Power Consumption = PoE: 4.4W (view only) / 7.9W (pan-scan)* Dimensions = 6\" (H) x 4 9/16\" (W) x 6\" (D)Since this camera has a built-in motion sensor, you can adjust the trigger threshold and sensitivity settings on a PC, and the camera will then automatically capture and record images when motion is detected. The images can be stored in the camera's memory buffer, to a user installed SD or SDHC card, or they can be sent to you via e-mail or FTP transfer. This makes the BB-HCM527A network camera a great device for a business environment or for a vacation home, for motion detection security. And speaking of security, the BB-HCM527A can also be connected to most home or business security systems, so that the camera will automatically start recording when an alarm is triggered by the security system. Unfortunately the camera lens will not automatically pan or tilt to the area where the motion was detected. Therefore you will want to position the lens in the direction of the area you wish to be monitored in your absence. The camera also has a timer record feature, which allows you to setup days of the week and times at which you wish to have the camera record. Both video and audio can be captured during a motion triggered or timed event. Reading the saved data from the built-in memory buffer or from an installed SD card is very easy, using any web browser. You can also use 3rd party software, installed on any PC on your home or business network, to record full-time or triggered event streaming video and audio. Panasonic gives you a demo version of their own recording utility called Network Camera Recorder with Viewer Software. However, purchasing the fully licensed version of this software will set you back a few hundred dollars, and it is pretty basic software for such a hefty price tag.Connecting this camera to my network wasn't overly challenging; but I have worked in the I.T. support field for over 20 years. Still, hooking this model camera up to your personal home or small business network really shouldn't prove to be very difficult for most people. The camera will acquire an IP address from your DHCP enabled router automatically, once powered up, but I would recommend that you give it a static IP. This just helps prevent any technical routing issues in the future. Panasonic includes a setup wizard CD, which will discover your new camera on your network, and will allow you to configure the settings of the camera and view the video (and hear the audio) output. If you assign your camera a static IP address, as I suggested, then you will be able to easily access your camera from any computer on your network, by simply typing the IP address of your camera into a web browser (with a prefix of [...] The BB-HCN527A camera provides impressive video and audio quality, when viewed from a computer inside your network, and the pan, tilt, and zoom functions are very responsive when you trigger them from the control panel in your browser. Colors are easily washed out by extremes in lighting (too bright or too dark), but the overall image remains clear unless the lighting drops below the required levels. Low light images will appear grainy; looking like static produced by over-the-air analog television signals. Panasonic's \"Color Night View Mode\" does improve colors in low light, but does very little to reduce the graininess of the image itself. I have found the C.N.V. mode to be fairly useless myself.Getting your camera configured for viewing from the Internet (outside of your home or business network) is definitely the most challenging part of the installation process. It requires a little tweaking of your network router settings. The most important thing is to make sure that your router is UPnP compatible, and that the UPnP service is enabled on your router. You may even have to manually add your own UPnP Forwarding settings, if your router doesn't automatically open the correct port for your camera. I ended up having to do this myself, since my router was having problems with the automatic port forwarding itself. I actually installed 5 new IP cameras at once (two of which were the BB-HCN527A model of which this review is for), so I spent quite a bit of time fiddling with router settings in order to get everything working properly. Once your router is configured you will need to open up the Internet settings screen for your camera, from a PC connected to your network, to enable the Auto Port Forwarding (IPv4), and to configure the camera to allow access from the Internet (IPv6). You then register the camera with Viewnetcam.com, which then tracks your camera's IP address on the Internet and forwards it to the internal IP address of your camera on your network. This has to be done as your internal IP addresses are only used by your personal or business network. Your personal network addresses are not the same as your Internet IP address. It's kind of like having UPS deliver a package to your neighbor, and your neighbor then delivers it to you. This forwarding also provides an extra level of security, so that your internal network addresses are never directly accessed by someone outside of your network. Viewnetcam.com does a pretty good job of handling this forwarding task and you should rarely run into any problems on that end. However, if you should have any problems while configuring your new camera, Panasonic has an excellent technical support team, strictly dedicated to IP camera support. I have contacted them a couple of times, to work out some issues I had setting up a Wi-Fi network camera, and I was very impressed with the technical knowledge of both support staff members that I spoke with. Panasonic stands behind their network cameras very well and they will walk you through the entire process of getting it configured to communicate with your network and over the Internet.I have had two of these Panasonic BB-HCM527A network cameras working in my home now for the past 3 months, and so far I have found very few faults in this model. The video image is very good for a camera of this price range, the audio is crystal clear, and the pan/tilt/zoom control interface (using a web browser with an AcitveX plug-in) is simple to use and very responsive. Because of the 350 degree panning sweep of this camera, I mounted them in central locations, between rooms of my house, so that one camera can cover multiple rooms. This type of mounting configuration may not make much sense for those that intend to utilize the motion sensing feature (since the camera has to be pointed in the direction of motion). However, as my wife runs a daycare business out of our home, these cameras allow her to keep track of the location of all children, when they are wandering about the house. My wife keeps a Wi-Fi enabled laptop near her at all times, so she can pull up the cameras and pan them to show different rooms at any time. I really only have a couple of beefs with this model camera, which are actually rather minor. First of all, the zoom feature of this camera is quite limited. The 2.3x optical zoom provides crystal clear images, but obviously it can't zoom right in on something really small at only 2.3x power. The digital zoom adds another 2x, essentially doubling the range, but using the digital zoom distorts the image pretty bad and starts making fine details hard to recognize. In my experience I have always found digital zooms to be fairly useless in almost all digital cameras and camcorders, and this IP network camera is no exception. But since these cameras are mounted in my home, I really don't need a more powerful optical zoom feature. Business owners may want to consider this issue though, as it may restrict their surveillance abilities. My second complaint involves the noise this camera makes when panning and tilting. Panning the camera emits a loud grinding type sound, which can easily be heard from anyone within several feet of the camera. Tilting the camera lens is a bit quieter, but still produces a clearly audible buzzing sound. Zooming the lens is very quiet, with only a slight hum, which can only be heard if you are standing right below the camera. But the panning and tilting noises are definitely irritating and will blow any attempts you have at secretly monitoring somebody's movements within your home. It may not wake you out of a deep sleep, but it will certainly get anyone's attention that is within 10 to 15 feet from the camera. Every time my wife or I pan the camera to look at someone, they always end up looking at the camera, as it's pretty obvious where the sound is coming from. Therefore I wouldn't consider this camera to be a good choice for a discrete nanny cam, for monitoring a nanny or babysitter. As soon as you move the camera lens they will know you're watching them.Overall I am extremely pleased with the Panasonic BB-HCM527A PoE Network Camera. It comes with all of the mounting hardware you should need, and the instruction manual is easy to understand and full of illustrations. Just remember that you will need to provide your own PoE power source (either a PoE network switch or a PoE injector device) and your own CAT5, CAT5e or CAT6 Ethernet cable. You should also consider purchasing and installing a SD or SDHC memory flash card, if you plan to use the motion detection feature, as the built-in camera memory buffer (approx. 6MB) fills up pretty fast. Although the camera has a built-in microphone, for picking up audio, you will need to purchase a portable, self-amplified speaker, if you wish to have full 2-way audio capabilities. This camera seems to be well built, and it comes with a boatload of advanced, very useful features. If it had a more powerful zoom, came with a fully licensed version of the video recording software, and was far less noisy during operation, I could easily give this network camera 5 stars. But even though I can do without the recording software, and I can even live with the meager zoom capabilities, I just can't give anything higher than 4 stars for a device that sounds like an electric blender, every time I move the lens. The engineers at Panasonic should really consider redesigning the motor and gear system of this camera. After all, nobody wants their surveillance camera to scream \"I'm Watching You!\"*** WARNING!: Please be advised that some states have privacy laws, which require that all parties that are involved in being recorded be notified in advance, and may even have to give their permission in writing. Almost every state has a law prohibiting unauthorized audio recording. When considering the installation of a video security camera in your home, especially if it has audio recording capabilities, you should seek legal advice from a family attorney.", "Date": "August 16, 2008"}, {"Title": "Looks good", "Author": "zenmaster43", "ReviewID": "R3CYR0LMUZ8JH7", "Overall": "4.0", "Content": "I haven't had a chance to install it yet, but gee it looks good! Maybe soon, it'll be in place and I can say something mroe then.", "Date": "February 26, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Prgressive Scan\nSimultaneous MPEG-4 and JPEG\nSD Card Recording with Audio\n0.2 Lux Color Night View Mode\nBuilt-in Web Server/IP Address", "Name": "Panasonic BB-HCM527A PoE Ceiling Mount Dome Network Camera with Tilt Motion", "ImgURL": "http://ecx.images-amazon.com/images/I/41EHX%2B7LgrL._SY300_.jpg", "ProductID": "B00171TBWY"}}