{"Reviews": [{"Title": "Not so small, not so featured, good price.", "Author": "Cuello Felix \"Félix\"", "ReviewID": "R2OC7AGZU94Z0A", "Overall": "3.0", "Content": "When I first saw this camera I thought that it was great!. My first camera is a Sony DSC-H7 which is a perfect camera for an amateur like me. But I wanted to buy a cheaper camera to carry with me everywhere and I bought this Panasonic camera.The LCD panel on its back it's big enough but the colors seems a bit pale. It's small enough to put it in your pocket, but it's not small enough to forget that you are carrying a camera.Photo quality is fine. But you will notice that the photos are a bit grainy and in high lighting conditions the camera lose some color on the pictures.I've noticed that indoors photos have more accurate colors that outdoors photos.Lack of sound in the videos makes the \"video function\" boring and almost unusable.However it has many programs and it is REALLY easy to use.It's a cheap camera and you will get what you spend on it. It's a good choice if you are looking a camera for fun, but you won't get quality photos with this gadget.", "Date": "May 30, 2008"}, {"Title": "Great camera, no microphone", "Author": "C. Gorrie", "ReviewID": "R28W3FG0PCDOMB", "Overall": "4.0", "Content": "We have had this camera for a while and it takes great pictures, especially for the price you pay for it. One moot point I did have was that there was no microphone, so no audio in videos.", "Date": "August 4, 2010"}, {"Title": "DIGITAL CAM", "Author": "Tania E. Lara Pretto", "ReviewID": "RUP2T84Q0O4WH", "Overall": "5.0", "Content": "I got this digital cam for my niece as a present long time ago.  I loved the color and the features it has.  For the price is an EXCELLENT choice for anyone (female) to have.  She is studying for Chef so she needed to take pictures of her food presentations and also for her own personal use.  She was very pleased to have it and enjoys taking pictures and uploading them in her computer!  I can recommend this camera as my niece still has it and has had no problems with it.", "Date": "October 8, 2009"}, {"Title": "Great for the price, but...", "Author": "S. Levy", "ReviewID": "R16T805FVL4KQQ", "Overall": "4.0", "Content": "This camera is an amazing camera. With its many settings, you can pick what you want to shoot, and it perfects its settings for it. The color is also a bonus :).Con: The video cant record sound.Con: The pictures come out a little spotty, and some highly \"pixely\", if you get what I mean. Very dotty.Con: In bright settings, color comes out, when it shouldn't. Rainbow doesn't look amazing on brown hair. Or black, or red...Pro: When taken in the right light, pictures come out amazing.Pro: Can zoom up to 18x, which is VERY close.Pro: You can play slideshows in review rode.Lots of other pros, not as many more cons. Hope I helped, this is a great camera!", "Date": "July 20, 2008"}, {"Title": "GORGEOUS COLOR,SMALL,AND TRENDY!", "Author": "Holly Holly \"Holly_Molly\"", "ReviewID": "R3F3ZMT4ZVCKUE", "Overall": "5.0", "Content": "\"ok i just received this really cute pink camera. its has 7.2 mega pixels. thats great for the money.The camera and the pictures are flawless, i recomend to everybody THIS CAMERA IS AMAZING! I WOULD DEFINITELY RECOMMEND YOU BUYING IT! IT TRUELY IS AMAZING :]\"\"", "Date": "December 4, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "Included Accessories - 2x AA Oxyride Batteries, Strap, Video and USB Cables\n7.2-Megapixel, up to 3072x2304 still resolution, QuickTime Motion JPEG 848x480 at 30 fps\nBuilt-in 27MB - We recommend purchasing an optional 1GB SD or SDHC Memory Card for practical usage\n3x Optical Zoom, 4x Digital Zoom 7 elements in 6 groups (3 Aspherical Lenses/3 Aspherical surfaces)\nWide Aperture Range - F2.8/F8 (2 steps) / Tele F5/F14 (2 steps)", "Name": "Panasonic DMC-LS75P Lumix Compact 7-Megapixel Digital Camera - Pink", "ImgURL": "http://ecx.images-amazon.com/images/I/51eeimxtvjL._SY300_.jpg", "ProductID": "B0010TAWYE"}}