{"Reviews": [{"Title": "Exactly what I was hoping for", "Author": "Bdub", "ReviewID": "R33K2FFO568SUB", "Overall": "5.0", "Content": "I recently sold my Nikon Coolpix 8700, and was looking for a new camera that gave me picture quality equal to or better, and was a much smaller camera.  I like taking pictures, but I'm not a photo guy.  I basically want to aim, press the button and let the magic happen.  Taking a chance I decided to try this camera, and I wasn't disappointed.It's got a lot of options to go beyond just auto mode if I want to dive into that.  My main thing was the picture quality though and the quality of photos is excellent.  My wife has a Canon A700 that takes decent pictures so we did a comparison just using the auto settings.  A picture of our dog in the house with all the lights off in one room, a picture with one light on, and a picture with all the lights on.  I figure if the low light pictures are good, then I'll be pretty happy with the daytime pictures.While both cameras did a good job, our preference was the Nikon's photos.  The colors were closer to what we expected they should look like, and to our eyes appeared more natural.  There wasn't any noticeable noise in the photos, and the quality is very, very good.The size of the camera is great.  Shorter than my Blackjack cell phone, and about 2.5 times as thick.  Definitely a camera that I could carry in the pocket of my jeans, or a jacket and not feel weighed down.", "Date": "October 17, 2008"}, {"Title": "Perfection", "Author": "Christina Bartak", "ReviewID": "RJDXPL6ZHCD81", "Overall": "5.0", "Content": "I recently got this wonderful camera for Christmas.  Its perfect, just what I wanted.  Its small, goodlooking.  It takes great pictures.  It has endless options for any type of picture taker.I love the automatic scene selection.  The camera decides by itself the perfect setting for the perfect picture id say about 90% of the time it makes the right choice.  It is possible to confuse it if the picture has a lot of different things going on.For instance if you are outside it will automatically switch to the outside setting and if u go inside it will automatically change to the inside setting without you having to do a thing.One time when i was in the bar it got it wrong though.  It changed it to night time setting automatically instead of party setting so it was a little blurry.  No prob though, i deleted that picture and set it on what i wanted.  C'mon, the camera cant know everything.  Im hugely impressed at what it does know.In general though I also love the automatic setting.  Its foolproof.  You simply cannot take a bad picture on the automatic setting.  All of my pictures are clear and crisp.OMG the editing!  You can edit your pictures while they are still in your camera!  I LOVE IT.  You can turn a crappy picture into gold, the editing is limitless.  You can take a picture of like 10 people at once then go and edit each face out to make portraits!It zooms in great and the zoom does not mess with the quality of the picture, no graininess whatsoever.Ive got lots of friends with similar type cameras and have seen their pictures and i swear up and down theirs compared to mine are complete crap.Do not get anything else if you are looking for a \"git r done\" camera.  Its so versatile.  If your a serious photographer that wants something small and cute this camera is perfect.  But if your like me and wanted something to carry in your purse to make memories wherever you are, its also perfect.Its fast, and easy.  Hardly any delay.  I love smile finder too!  It also has a ten second timer so everyone can be in the picture.This is my first digital camera and im not embarressed to say i was worried about being able to run it.  The owners manual is clear and easy to read.  I highly recommend not just a thumb through but to actually sit down and read it.  After you do that, its a breeze to run it : )I have  zero complaints.  Its perfect for everyone!  I give it an A+  hands down, everyone should own one!LOVE IT!", "Date": "January 5, 2009"}, {"Title": "great camera, poor service", "Author": "Christa \"christa\"", "ReviewID": "R22FLTHDA88RYP", "Overall": "3.0", "Content": "I have had this camera for approx. 4 months.  I am so happy with it in every way but one.  After about a month, the camera read \"lens error\" and would freeze open.  I assumed this was an isolated incident, but it is now happening with more frequency.  I contacted nikon, who told me that this is not a warranty issue.  I have searched the internet and have found that this is a surprisingly common issue.  I really would have expected a company like nikon to stand behind their products.  I would be very leary to buy another one based on this, which is really sad, as I do love the quality and features of this camera!", "Date": "May 22, 2009"}, {"Title": "Good camera, manual mode, high ISO", "Author": "Minh D. Nguyen \"Minh\"", "ReviewID": "R2MIWVIYWOEC9Y", "Overall": "4.0", "Content": "Got this camera for a month, did a wedding and a few travels with it, overall among the best sub-compacts but not perfect.Good points:- Manual mode: surprisingly useable, I usually leave it on this mode, click the side of the thumbwheel to switch from ISO to shutter to aperture, turn the wheel to set each in turn, a little exposure scale shows up to guide selection.  Easy to select ISO up to 12800 (hardly useable, very grainy, 3200 is practical maximum).- High ISO: 3200 fairly smooth, 800 to 1600 very decent, I ended up not using flash for any of the wedding (inside) pictures.Bad:- Night flash mode good but not tyro-friendly, lent to a friend for pictures and most of them turned out blurry, she did not have a steady hand.  Regular flash rather ugly, not what I'm used to with Nikon- Pictures show perfect on the camera screen but a bit dark on my computer monitor; not sure which is \"wrong\", or whether there is some automatic D-Lighting during playback, anyway annoying.Overall good camera, would buy it again, but need to dig into it a bit, the pictures on my computer did not turn out as good as I expected based on what I saw on screen.", "Date": "November 4, 2008"}, {"Title": "Amazing camera, but some things need improvement", "Author": "S. Ahn", "ReviewID": "R214659503H16Z", "Overall": "4.0", "Content": "First off, I have to say that this is possibly the best ultracompact camera to buy at this price range. It's full of great features and can make amazing quality pictures. The different shooting options are fun to play around with and are actually usable in their respective situations. It also has a very high ISO capability - something I was looking for in a camera this small. Also, the shutter/aperture priority settings are really neat and fun to play around with.Now, some things that get a little annoying. First, I have to say the menu system was tough to get used to. It took a couple of minutes of going in and out of different picture stuffed menus to find what I wanted. Not to mention the fact that there's a lag between exiting a menu and taking a picture - and zooming and taking a picture. And like some other point-and-shoots, the lens tend to cause the purple streak to form at the sides of a picture.Obviously taking snapshot photos at 14MP will cause the camera to slow down a little - that's a lot of data that has to be stored in a memory card, but to take that first shot, it takes well over four seconds to load up the camera, something not too appealing to a couple of people who want a camera with lightning fast power on.All in all, the Nikon Coolpix S710 is a great buy for any experienced, beginner and multi-use camera user. It's fun to play around with all the different options, and it's great when it actually is in use. All I want to wait for now is a Nikon ultracompact that can record 720p HD movies.", "Date": "February 12, 2009"}, {"Title": "Great little camera, very pocketable and capable", "Author": "Neil H.", "ReviewID": "R3DL6AHIQUKH21", "Overall": "5.0", "Content": "I love the Nikon Coolpix models in this style and have bought a few of the earlier models. I have found all of them to be reliable and produce superb quality photos. The S710 is really an elegant piece of work, beautifully made and stylish.Like other Coolpixes it has one feature that I believe is exclusive to Nikon, the Best Shot Selector. This is primarily useful in low light situations where the camera's shutter speed will be quite slow. The way it works is this: when BSS is turned on, you can hold the shutter release down and the camera will take up to 10 successive shots, and save only the sharpest one. Since hand-held slow-shutter shots always vary a good deal in sharpness from shot to shot, this feature, discarding all but the sharpest picture, serves as sort of a \"poor man's image stabilization.\" This can be combined with the camera's VR (which is actual, optical image stabilization), the two working together to produce remarkably sharp photos in low light without the use of flash. Since all ultracompact cameras like this S710 have relatively weak built-in flash units, this is a most useful feature.Another feature of the S710 that attracted me to it, and that my previous S-series Coolpixes don't have, is that like the much larger and more \"serious\" digital SLRs, it allows the user to set the camera in Program, Shutter priority, Aperture priority or full Manual mode. This will probably not mean much if anything to people who aren't really into photography, but for those of us who are used to having these controls on our SLRs and DSLRs it is a much appreciated feature. Along with these modes of course are the usual Coolpix scene modes, 16 of them -- Portrait, Landscape, Sports, Panorama, etc., etc. -- and also a Scene Auto Selector setting in which the camera will attempt to choose the scene mode best suited for the existing conditions and subject.The lens is a sharp seven-element zoom with a range of 28mm wide angle (in 35mm camera equivalence) to 101mm short telephoto (equiv.) Maximum aperture is f/2.8 at the short end and f/5.6 at the long end. VR (stabilization) is optical, by the lens-shift method. In my opinion it would be very hard to improve on this lens for this type of camera.Drawbacks? Nothing very serious. The buttons and rotary selector on the right side are somewhat cramped because of that big 3\" LCD monitor, and for the same reason there's no optical viewfinder. This can be a slight problem in bright sunlight, but probably most users will be willing to give that up for the pleasure of the big monitor in a very small camera. Optical viewfinders in cameras of this type are never accurate anyway, while the LCD monitor is by nature perfectly accurate or extremely close to it.Now frankly, I am dubious about putting 14.5 megapixels in such a small camera, primarily because cramming that many pixels into the little sensor means that each pixel is very tiny and therefore requires a good deal of amplification, and the result is increased electronic \"noise\" at anything much above the lowest ISO (sensitivity, equivalent to film speed in a film camera) setting. Unfortunately we are seeing this silly megapixel race in all brands of small cameras. The good news is that you can set the camera to a lower and more sensible resolution. I generally use mine at 5 megapixels and never at more than 8 Mp. These are the highest resolutions I am ever likely to need or want with this type of camera. Using higher resolutions only means getting fewer images on the SD card, slowing down the camera's image processing, taking up more space on the hard drive when the images are transferred to the computer, etc. -- all for no real benefit that I can see, and I have compared highly magnified images at various resolutions.At the camera's Auto setting it will self-adjust the sensitivity to anywhere between ISO 100 and 1600, depending on the existing light, and favoring the ISO 100 end which is noise-free. The maximum ISO when set manually is a whopping 12,800. This means you take take pictures in very low light without flash, especially when using the camera's VR (which is turned on by default), though at this high ISO the image contains a great deal of noise -- even though the camera automatically reduces resolution to 3 megapixels at ISO 6400 and 12,800. It is fun to play with and can be useful in many situations where you can't or just don't want to use flash -- just be prepared for very grainy pictures. Most casual snapshooters will probably never use this feature.Summing up: this is a terrific little camera for the enthusiast. It is really a lot more camera than the typical snapshooter needs, and it is just astonishing how Nikon has been able to pack all these features (I've only touched on a few of the most important ones) into such a slick, pocketable camera. I am sort of a collector-user, and have at least a couple of dozen compact and ultracompact digital cameras in addition to a half dozen DSLRs. Of the ultracompacts, this S710 is easily my favorite.", "Date": "October 5, 2009"}, {"Title": "An amature's professional camera", "Author": "Ashley L. Williams", "ReviewID": "R2IBCUTENDBRB0", "Overall": "5.0", "Content": "Although I've yet to use all the functions that make this camera unique (eg: quick shutter, smile shutter, etc), I've thoroughly enjoyed the image stabilization and scene auto selector.  I must admit though, my favorite part about this camera (and also aesthetically how it looks) is the recognition of photos taken vertically and automatically rotating them to be viewed as you would normally review pics.  It does this on both the display screen as soon as you've taken the pic and as well when you upload it to your computer.If you're looking for a great compact sized camera with \"professional-like\" qualities, you've found it.  I did a side by side comparison (on some website) of the specs of this camera and others that I was looking at (Sony Cybershot, etc), and overall, this seemed to surpass those.  I'm no expert in the camera field, but Nikon's reputation holds true to this camera.", "Date": "January 27, 2009"}, {"Title": "FIXED :):)", "Author": "J. makela \"TALLJERRY\"", "ReviewID": "RT4IMNBQADZ9A", "Overall": "3.0", "Content": "I sent my nikon s710 to fix a lens errorthe nikon S710 was working fine for 7 months then I got a lens error.05/4/2009 Dear Nikon Photo Service Customer:We have received your COOLPIX S710 CAMERA (GRAPHITE BLACK) and entered it into our system asservice order numberfixed:FIRMWARE UPGRADEADJ A-WHITE BALANCEADJ CCDCKD ZOOMING MECHANISMCKD LCD DISPLAYADJ AUTO FOCUS OPERATIONGENERAL CHECK & CLEANCDK FLASH OPERATIONRPL LENS UNITCKD SHUTTER RELEASECOST TO FIX $0.0005/06/2009 In shop05/07/2009 Parts hold ( Product is waiting for repair parts )05/14/2009 Parts hold05/21/2009 Parts hold05/22/2009 In Shop05/26/2009 Order Status:  Shipped", "Date": "September 22, 2008"}, {"Title": "Like to set the Date over and over again? Buy this camera.", "Author": "runyaga \"python enthusiast\"", "ReviewID": "R1DIIH9BRQQZQG", "Overall": "1.0", "Content": "I bought this camera the week it came out.  It was ok for about 4 weeks.  Now everytime I start the camera it asks me to set the date.  This is a common problem with S710.  There are no known fixes nor updated firmware pending for the Nikon Coolpix S710.  So if you like to set the date everytime you turn on the camera; go ahead and buy it.  It's really quite fun filling in the same date multiple times per day while using S710 on a normal day.", "Date": "September 26, 2009"}, {"Title": "Product defect", "Author": "Jane Smith", "ReviewID": "R17YF2OJEWUR71", "Overall": "1.0", "Content": "I have had this camera for about 4 months and it starts having problems to retain time and date. Everytime it is turned on, it asks for time and date. If you do a quick search of this product related reviews, you will find this is a very common problem for this model. I regret that I had not done so before I made the purchase and of course I am very surprised that Nikon has not fixed the defect. It gets really annoying. If you by pass the time/date setup, there is a red flashing warning on screen all the time. But who has the time and is willing to set up the date and time repeatedly everytime to turn it on to shot a few photos from one scene to another?", "Date": "October 4, 2009"}, {"Title": "i look like a pro", "Author": "M. Ker", "ReviewID": "R2GRLEMPZHVMTY", "Overall": "5.0", "Content": "at 50+ there's a bit of shakin' going on with me. my photos were always a bit out of focus.  the automatic optical vibration reduction feature is a brilliant solution. this is my 6th digital camera and i really believe it will be my last.  started w/olympus 10 years ago, moved through sony, leica, canon and am now well settled with this nikon. stellar results.", "Date": "January 13, 2009"}, {"Title": "Buying this was a big mistake", "Author": "shopper", "ReviewID": "RXPSLRUENEZPR", "Overall": "1.0", "Content": "At first I was happy with this camera.  Until it broke.  It just wouldn't turn on.  I took it back to the store, and they gave me a new one.  That one was fine at first, but before long the lens got messed up.  It's flimsy, and Nikon support is lousy; they wouldn't even respond to me.  Now it won't focus.  I wish I never spent so much money on this junky camera.", "Date": "June 3, 2009"}, {"Title": "Very pleased!", "Author": "RST \"RST\"", "ReviewID": "RYPY2O45GF7HB", "Overall": "5.0", "Content": "This camera allowed me to combine a large zoom camera and a small portable one into a single camera.The camera body is metal, the battery lasts a long time, and it takes phenomenal low light photos with very little granularity or motion blur. As well, it takes very good macro photos.  Many cameras these days also have super macro, which this camera doesn't have.I use this camera with my Eye-Fi card and it works very well with it.  Some cameras don't work well with Eye-Fi but this one works just fine.The menu system was very easy to get used to. It feels familiar for someone coming from mostly Fuji and Olympus cameras.This is the best digital camera I've had as far as the overall package of clarity and sharpness and low light photography since my very first digital camera-- an Olympus 1.2 megapixel camera! I've had a lot since then and have been disappointed.Several people here have mentioned \"lens error\" issues.  I had this happen to me twice, I think if your finger is in the way during turning it on when the lens extends, this happens. It happened twice when I thought it shouldn't have, so I exchanged the camera.  Amazon had a brand one to me the next day, no questions asked!Overall, this is a good recommend.  The value of the feature set and performance are more than enough for me to counter balance the possible \"lens error\" issues.", "Date": "October 15, 2009"}, {"Title": "Very disappointing purchase", "Author": "J. Trindade", "ReviewID": "RFYF9EN7ARR7O", "Overall": "1.0", "Content": "This camera has been a pain in the neck...First let's bare in mind this is the most expensive model Nikon has to offer in this category... Now....Like most other point and shoot cameras, the performance in low light/indoor situations is very poor...Shortly after I purchased it however, the real disappointments came along... Every time I turned the camera on, it asked for date and time information to be RE-ENTERED(you had to if ever you wanted pictures organized correctly by date). I had to send it to service and they fixed it...A couple months later, on a trip, as I turned the camera off, the lens just got stuck half way in... After pressing the on/off button several times, the lens finally moved back to the out position only to get stuck right there, to never go back in (or let any more pictures be taken... of course). No need to mention we had to actually buy a new camera for the remainder of our trip...I now have to, yet again, pay for shipping to have it looked at and wait for the service people's verdict...Here's a summary of Nikon's reply: \"Unfortunately you'll have to pay to shipping the camera\", \"We can't guarantee any replacement or refund\", \"if the equipment is unrepairable we might consider a replacement but NOT a refund\", etc....Would anyone want this camera repaired?? it is costing more in time and money to send it to have it repaired (twice in less than a year this far.....)Anyway... I really regret having made this purchase...", "Date": "December 10, 2009"}, {"Title": "Good Camera...", "Author": "T. Beaudette", "ReviewID": "R3Q3BTBW5MZ7BT", "Overall": "4.0", "Content": "I generally shoot my pictures with my Nikon D200, but on a recent trip, I didnt want to lug my large camera up a moutain, so I purchased this little Nikon point and shoot camera. Overall I am quite pleased with it, took some great pictures! The video option was also a nice added bonus. My only drawback is that it is a bit slow on its startup, and focusing, but I am spoiled with my Digital SLR.", "Date": "September 3, 2009"}, {"Title": "Faulty hardware, mediocre quality", "Author": "B. Renfer", "ReviewID": "R3PPCSVSL6JJTK", "Overall": "1.0", "Content": "I purchased this camera over a year ago, enticed by the amount of features it had and its high megapixel count. Upon receiving it, I found the pictures to be especially grainy, but otherwise not terrible. Within a month, however, my battery stopped working correctly, forcing me to reset all settings for the camera (including date, time, exposure, etc) every single time I turned it on. In addition, as I tried it in more lighting situations, I found that the noise problem is horrible. Unless shooting outdoors or with a flash, the photos are incredibly noisy without fail.I returned the camera to Nikon, and had to wait about 2 months before I got another one (I actually had to contact them and re-submit my inquiry 2 months after sending them my camera!). This new one started behaving weird after a week; its autofocus function only works for the first exposure you take on powering on the camera. I submitted another support request, and am hopefully getting rid of this piece of junk asap.So, now I have a \"point and shoot\" that is anything but. I really don't recommend this product, as there are far, far better models on the market (even other Nikons). There isn't a single feature worth all this trouble.", "Date": "November 21, 2009"}, {"Title": "Slow Start up", "Author": "4 Oceans", "ReviewID": "R1NFQ7J1CLHKHI", "Overall": "3.0", "Content": "I have been playing with this camera for a month and generally it is a good camera. However, the start up is very slow compare to other Coolpix. It will takes about 7 seconds from pressing the on power to be ready to shot. 7 seconds is forever since other similar cameras are almost instant on. Some pictures turned out darker then I like but can be fix manually with the camera D-Lighting. I have been using the Microsoft Live Photo Gallery to import and organize my pictures from my other Coolpix and Sony Alpha SLR, and it is a great free tool. However, the \"import new pictures only\" feature does not work with this S710. It will always import everything from the memory card. I was also sold on the high ISO but the grainy picture is a disappointment (for ISO higher then 1600). Overall, it is a good camera but if I have to choose again then I will not buy this model.follow-up: replaced the 8GB Toshiba SDHC with regular 2GB SD and star-up time improved from 7 seconds to 2 seconds.", "Date": "October 9, 2009"}, {"Title": "Somewhat Disappointed", "Author": "C. Kue", "ReviewID": "R1FGOW3E5K43Y2", "Overall": "3.0", "Content": "The main reason I bought the Nikon Coolpix S710 it's because it seems to have all the gadgets that a camera offers, small,easy to use, price was right and lots of cool features like the auto scene selector function. I was looking for a camera that's quick and easy to use \"just aim and shoot\" for graduations, birthdays and weddings. I've seen the video promotion online of what this camera can do with all the features and the color quality was unbelievable. But when I got the camera and tried it for 3 weeks I could not get it to take decent pictures. It doesn't matter if it was a nice sunny day or at a party at night the pictures came out rather orange looking and I was using the auto scenes selector function. It was a big disappointment!! I also owned a Kodak EasyShare camera(got it as a gift)but it didn't take very good picture it always come too dark not enough light even with flash on. But comparing the Kodak EasyShare and the Nikon Coolpix S710 picture for picture the Kodak EasyShare takes better pictures than the Nikon Coolpix S710, so I returned the camera back to Amazon.com for a full refund. Oh, it also freezes while viewing pictures, had to remove the battery and re-insert it to make it work again.", "Date": "November 21, 2009"}, {"Title": "Lens locks", "Author": "Gregg Nelson \"Rich\"", "ReviewID": "R1EAZ423DXYH7K", "Overall": "1.0", "Content": "The camera is a pretty good camera. I have had a terrible time with the lens. I have had to send the camera back twice for repair. The lens keeps locking up and will not function. I have had much better luck with Panasonic digital cameras. They seem to be made better.This is not Nikon's usual quality.", "Date": "October 29, 2009"}, {"Title": "LOVE this camera", "Author": "Dirt Diva", "ReviewID": "R2MYFR6NLIUFK2", "Overall": "5.0", "Content": "This camera takes the best clear, sharp, detailed pictures! Easy to use, big viewing screen, takes great pictures(14.5mp baby!), love the zoom, video w/ audio is great for \"you tubers\". The only negative thing I can say is that I had to send it in due to a \"lens error\" which I had read about before buying.  Have to admit I was using it in a very sandy, windy location when that happened. I wish the video feature had zoom but still the perfect point and shoot camera. I compared price, mega pixles, and wanted a big viewing screen and this was the best by far. My friends are jealous of this camera, great buy. I recommend buying the extended warranty, a extra battery and car charger. Not much more and worth every penny.", "Date": "October 6, 2009"}, {"Title": "A huge disappointment", "Author": "Landenberg Lady", "ReviewID": "R68225GMFXMA", "Overall": "1.0", "Content": "I bought this camera about 15 months ago to do dual duty for snapshots and to take photographs of children's quilts for my website, blog and marketing materials.  At first it was great.  Then, after 4 months, it started asking me for the date every time I turned it on.  I sent it in for repair.  Nikon was good about that and supposedly put in a whole new chip.For the past 6 months, it has been taking horrid photos -- some are in focus, some are not (using a tripod; no changes between shots), all are dark or off-color.  It doesn't seem to matter what I do with the settings.  I pulled out an older Olympus, which is taking perfect shots -- same tripod set-up.  Of course, the Nikon warranty is long gone.No, I've never dropped or mistreated the camera.I won't buy another Nikon.", "Date": "February 14, 2010"}, {"Title": "Great quality!", "Author": "Priscila Martins", "ReviewID": "R1U50IRBPZ83OB", "Overall": "4.0", "Content": "I love this camera! The picture quality in the camera screen is ok, but when you transfer to the computer, you can really see what a great resolution this camera has. Cons: Nighttime pictures aren't so good with normal seetings, you might want to play with the features a bit until you find what works best for you. Turn off the automatic flash for day pictures, they will come out much better... people won't look so white.", "Date": "November 2, 2009"}, {"Title": "Totally useless and confusing.", "Author": "A. Mann \"Commercial Artist\"", "ReviewID": "R2JQWDAGUHD2ZZ", "Overall": "1.0", "Content": "If you are buying a camera with features for manual control and low light settings, this is not your choice. The menus are unbelievably confusing, the focus auto assist (low light) works only out from 3-5 ft. (App) with no manual focus that I could find in it's totally confusing menus.I shoot bands and some fine art and wanted a camera I could keep with me all the time that was small, logically laid out and gave me control on flash/blur shots, over and under exposure and intentually grainy effects. By the time I got this camera to do anything close to what I was trying to achieve, The scene had long since changed and I forgot what I was looking to do.I purchased the Canon S90 which is twice the price with 10 times the useability inc. complete manual control and a ring on the lens that can be set for focus, apature, shutter speed, iso, etc. A dream come true.Summary. If you want a point and shoot the S710 has too much and will discourage you from trying to get \"a little creative\". If you want a camera for creative control, avoid this camera like the plague. Nikon Coolpix S710 14.5MP Digital Camera with 3.6x Wide Angle Optical Vibration Reduction (VR) Zoom (Graphite Black)", "Date": "December 13, 2009"}, {"Title": "Nikon Coolpix", "Author": "Retiree", "ReviewID": "R1RW81ROC0KNHC", "Overall": "4.0", "Content": "Needed a new camera easy to use and small enough to carry in purse for trip.  Would recommend to friends.", "Date": "March 25, 2014"}, {"Title": "Ok during the day, terrible at night", "Author": "Bosto", "ReviewID": "R2B0SY8XRC0CGC", "Overall": "2.0", "Content": "This takes descent photos during the day, but at night, the shots are either too blurry or the flash looks terrible. Also, I bought a leather case that was designed for this model camera (with a magnetic closure), but the camera was a tight fit in it. So, a hair from the inside of the case got stuck inside the lens and showed up in every picture! I had to go through a number of phone calls with Nikon and send it back to the company, who sent it back to me 4 weeks later, only to have the same thing happen to me again. Now, I just use my iPhone 4S to take informal photo & video. If you want to shoot photos only during the day, I bet you could find a much cheaper digital camera than this P.O.S.", "Date": "January 10, 2014"}, {"Title": "SHAME ON NIKON", "Author": "Armando E. Velasquez", "ReviewID": "R216O0OE0LQFXT", "Overall": "1.0", "Content": "This camera model is not worth the NIKON brand, it is the worst point and shoot camera that I have owned. Had problems with the hardware first, the battery lid and at the end the lens cover. I have had better experience with the SONY cameras and my favorite for durable are the LUMIX cameras by PANASONIC.", "Date": "November 9, 2013"}, {"Title": "great camera...", "Author": "ilko :)", "ReviewID": "R4D585DPSQTQZ", "Overall": "5.0", "Content": "amazing camera, takeing amazing pictures... no any problems, still runing like new...it is nonprofesional camera, but the pics are like from professional camera...", "Date": "August 2, 2013"}, {"Title": "A great little camera", "Author": "Rochelle Warfield \"traveler\"", "ReviewID": "RKKPGJGC32OSL", "Overall": "5.0", "Content": "I bought this for my husband who uses an SLR digital Nikon but wanted something smaller that would fit in his pocket when he didn't want to look like a tourist.He loves it. He has used it regularly taking thousands of pictures with it .  It is now on its last legs, but I imagine Nikon now has even more advanced models available in this size or smaller.", "Date": "February 13, 2013"}, {"Title": "Poor quality.", "Author": "jeffr59", "ReviewID": "RM6AF884ZGI51", "Overall": "1.0", "Content": "Camera worked well for about 13 months.  Then it asks me to enter date & time each time I power it on.  It no longer has the ability to store the info.  It's a common problem - search the web to confirm.  I contacted Nikon and they say they can fix for a fee.  I argued it's a defect and they should repair for free.  I told them they must know it's their problem - simply do a web search.  They remain firm it's out of warranty and I must pay.  Some report this problem within a week of purchase.  I took camera apart trying to find an internal battery but did not find one.  So, I'm going to send it back to them and pay whatever price they feel like charging me.  My next camera WILL NOT be a Nikon.  My brother works for a large photography retailer that also caters to the camera wholesale market.  He's been a Nikon advocate for years.  He says he's seen a drop in their quality over the past few years and now recommends Canon.  I wish I'd known this before I bought this pile of steaming fertilizer...", "Date": "August 21, 2011"}, {"Title": "Good camera when it works", "Author": "tdoyle74", "ReviewID": "R25CV7OQESI5XV", "Overall": "1.0", "Content": "Camera is easy to use when it works.  I had to send the camera back due to a lens error (out of warranty cost almost as much as the camera). Once returned I got 2 uses out of it (didn't use on the beach with sand - left in a clean room in fact) and the lens servo locked up again.  So sad.", "Date": "August 7, 2011"}, {"Title": "Not Worth it....", "Author": "BuyOrDontBuy", "ReviewID": "R3UT01YFUYGKJN", "Overall": "2.0", "Content": "I purchased this item 1 1/2 year ago. It started to show signs of faulty construction after 1 year. I barely used it also. After 6-8 months, a lcd pixel went bad. Then a little after 1 year the flash did not work. I have sent it to Nikon, but they got a confusing RMA process for someone who has never RMA before. I asked a Nikon representative and they said I could just send it in, but read on the website and fill out some RMA ticket to make sure you do it right first. The RMA Customer service is pretty bad. They told me one thing while the website was stating another.", "Date": "May 3, 2011"}, {"Title": "nikon cameras... hate em...", "Author": "howzeyez", "ReviewID": "R1SMJGJ8BPRMRF", "Overall": "1.0", "Content": "well, I should have heeded the warnings of a large number of people who submitted negative reviews of this camera... but I figured... what are the chances that the problem would continue in the 4 (I know, I'm an idiot) cameras that I bought for Christmas gifts in 2009... They were a good deal at the time... but how good are 4 useless cameras coupled w/the embarrassment that you gifted loved ones w/a shoddy camera and a useless and unresponsive Nikon customer service department.. I got one camera repaired under their narrow window of warranty coverage and that was after many emails to get a RMA# response to my warranty request.  After I sent it in they lost track of my camera....  which necessitated many emails to keep them on the trail to finding it and repairing it and returning it.. So, I've sworn off Nikon products... it only takes a bad go 'round w/a company's customer service department to loose a customer for life...and of course, some of us disgruntled customers will  then go and report the experience to as many people who seek out a review of the products on sites like this.... are you listening Nikon? ** oh, by the way... the problem was the \"lens error\" message that was referred to frequently by other reviewers of the product.", "Date": "November 2, 2010"}, {"Title": "Unreliable - Stay Away", "Author": "sandiego_tim", "ReviewID": "R2ERUNMD7J5RQH", "Overall": "1.0", "Content": "Purchased two of these for christmas presents.  First one failed (lens error)in first 30 days.  Returned it (thank you amazon)and had it replaced under warranty.  Second one failed 8 months later, this one cannot be returned and is not covered by warranty.  Expensive cameras like these should have much better reliability or should be covered by warranty for a year.  Stay away from these cameras!  I'm going back to Sony!", "Date": "October 5, 2010"}, {"Title": "Hardy Camera, Disappointing Quality", "Author": "Andi", "ReviewID": "R1Y98HXOAYN8GM", "Overall": "4.0", "Content": "I bought this camera because I wanted a point and shoot that still allowed me to have manual settings. When I got it, I was a little disappointed in the picture quality. The contrast is usually pretty flat, sometimes it is grainy. Sometimes it doesn't use the flash when I think it should, etc.  All of this can be fixed using iPhoto, so if you're not picky it's not a big deal. (I usually do some editing anyway so it works out fine.)However, the major redeeming quality of this camera is what happened on Christmas Eve of last year: Running across the yard to help my boyfriend get his car out of a snow drift, it bounced out of my coat pocket. I had no idea what had happened to it, so didn't think to look in the yard where it laid under 6 inches of snow for a month. My aunt found the camera after the snow had melted, handed it back to me, and it immediately turned on and took pictures.It's definitely a durable camera and the picture quality is still doable. I would recommend this camera.", "Date": "August 30, 2010"}, {"Title": "Nikon S710", "Author": "InLongBeach", "ReviewID": "R2KZVIA9PR8XEC", "Overall": "5.0", "Content": "This is a very simple camera to use. It has great zoom capabilities and with the vibration reduction it hard not to take a good picture.", "Date": "August 1, 2010"}, {"Title": "A bit junky", "Author": "Wog B", "ReviewID": "R5ADG7C7DS6GC", "Overall": "2.0", "Content": "I previously owned a Nikon Coolpix 4200 and after about 3 years of flawless service in conditions ranging from zero degree winter hikes to summer boat trips I thought Nikon made the best point-n-shoots. Maybe they do, but the S710 is an exception. The BIOS chip that holds date/time failed several days into a trip to Spain. I didn't bother fixing it, and probably should have sent it back. On my next trip the LCD cracked (it's almost always in a case) and dust somehow got through the casing and into the optics, causing dark spots in my shots.Lots of people report lens errors. I never had a permanent problem, but the lens assembly is very fragile and just nudging it will cause the camera to freeze up.Good points? The low-light performance is decent for a point-n-shoot, and the vibration reduction works okay. Like most Nikons the flash is almost too good, washing out many shots and causing a lengthy recovery cycle after each shot. Like others have pointed out the 14.5 MP is a waste on a chip as small as the one in this Nikon.Can't recommend this, though. Nikon needs to improve the durability before I get another one.", "Date": "July 24, 2010"}, {"Title": "Great Features, HORRIBLE PRODUCT... If that's possible.", "Author": "Dashae Miles \"damiles\"", "ReviewID": "R1YAABHUBFNC5T", "Overall": "2.0", "Content": "Today, 7/1/2010 will be the 3rd LENS ERROR I've gotten on my S710, within two and a half months.  I've only owned the camera for 6 months and I've never used it, aside from taking silly pictures to become more familiar with the settings and features of the camera (which might I add are amazing)!  None of that matters now because I have an event which I will be needing my camera and now I won't have it to use.  The 1st two encounters with Nikon's customer service were pleasant.  This time around, they seemed to be annoyed with me, that I'm reporting their product is a P.O.C., as if it's my fault.  I would highly recommend people to NOT even consider Nikon.", "Date": "July 1, 2010"}, {"Title": "camera", "Author": "Aaron T. Grace \"Aaron\"", "ReviewID": "R1NDAR716SNYJ5", "Overall": "5.0", "Content": "It works good, it has amazing quality when used just right. Im not to experienced with cameras so to get quick pictures with movement like in partyes and such you cant really use the auto mode like you can with some cameras, you will have to mess with some other options. It can get fired up real fast, battery life is great, as for duribulity is questionable cause i dropped it once on some grass, then it started having lens issues after a day or so. But the customer service was great. they fixed it for free.  ok thank later.", "Date": "April 23, 2010"}, {"Title": "S710 Existing BIG Problems", "Author": "Pei Yang \"Pei\"", "ReviewID": "R1090TKVUN08BT", "Overall": "1.0", "Content": "Hi,  I bought this S710 cameral ([...]) in Dec 2009. In March, there occured two big problems. One is it is required to reset the date and time every time I start the machine. The other is there are no any sounds, like the botton sound, shutter sound or video sound I recored,even the sound setting is in the state of \"On\". I have sent the seller two letters by e-mail, BUT received no reply.", "Date": "April 19, 2010"}, {"Title": "don't buy it", "Author": "kary", "ReviewID": "R3KNW247FEPX6Z", "Overall": "1.0", "Content": "The camera does not hold up well...I have had it for a year and it's broken twice with the same issue as other reviewers, \"lens error\". Nikon will not do anything about it.  I won't ever buy another Nikon product.", "Date": "February 27, 2010"}, {"Title": "Pricing?", "Author": "E. L. Phillips", "ReviewID": "R23KEMPVVOC819", "Overall": "3.0", "Content": "I bought this S710 from Amazon on October 11th, three months ago, and it was priced at $189.99.  Now I see the Amazon price is $369.99.  Wow!Stupid me, I didn't realize these little cameras today don't have optical view finders. I missed the view finder is some situations.  I have nowreplaced the S710 with the Canon G11 which has a proper view finder.", "Date": "February 25, 2010"}, {"Title": "Delicate cam with unparalled picture quality", "Author": "Frederick S. Tomaselli \"Fred \"OUTBURZT\u0003...", "ReviewID": "R1JA89E169EM86", "Overall": "3.0", "Content": "Always had Nikon and Cannon camera. I do not like other brands. This Nikon camera has unmatched features, and picture output for an equal camera. HOWEVER, mine broke its 3rd use. I brought it to the Sundance film festival and the way I was sitting in the movie theater pushed the lens in apparently? I have no idea how that much force actually happened. The camera must have been powered on somehow.  I saw someone famous and my girl immediately wanted to take a pic. Only to find out the camera broke. Once in a lifetime opportunity missed. When the camera did work it took the best pics I have seen to date. Its currently at Nikon HOPEFULLY getting repaired under warranty. Lastly its a bit bulkier than most compact cameras which I can live with but its very heavy for a compact camera.", "Date": "February 25, 2010"}, {"Title": "Digital Camera", "Author": "Jay Thrush", "ReviewID": "R29ZQ5M69DJ4A5", "Overall": "5.0", "Content": "This camera rocks with its 14.5 pixel lens and its features. The only con I see in it is in the memory when using motion picture feature. But when adding a memory stick, life goes easier! 2 thumbs up for this camera!", "Date": "February 15, 2010"}, {"Title": "the search continues...", "Author": "C. Larkin", "ReviewID": "R3TR2756VJA6G4", "Overall": "3.0", "Content": "OK I am a camera novice. I am searching around for a camera that takes great pics and I don't have to think too much about it. I want to enjoy the moment and not worry about camera settings. I am wishing for a camera I can just press the button and my pics turn out great. I researched for a month or so before I purchased this camera. I read reviews from both actual owners and experts. I figured I was getting what I was looking for and the 14+ megapixels had me excited. I have owned this camera for 8 months. While the pics are OK they can be a little blurry and/or red eyed. Friends of mine who own cameras with less MP seem to come out with clearer and better pics. The best camera under $400 I have seen is the Canon powershot waterproof. I don't know why that one is better I owned the regular canon powershot and I didn't like it. The search continues....", "Date": "February 6, 2010"}, {"Title": "great canera", "Author": "paul T. Mann \"PTM\"", "ReviewID": "R3QNWY8E3ECOPY", "Overall": "5.0", "Content": "So far, I am completely satisfied with this camera.  I have used pictures taken with it for professional purposes. The 14.5 resolution hepled. It's great to have a small camer with a wide angle feature. I tested the film making capapbility of the camera recently and was truly anmazed at the quality of video and sound.So far so good, I look forward to tryinhg more features!", "Date": "February 6, 2010"}, {"Title": "Prone to lens problems", "Author": "Kristin", "ReviewID": "R1AK8TATPINBTG", "Overall": "2.0", "Content": "I purchased a Coolpix S710 in November 2009.  A month later the camera displayed lens error.  I returned this camera to Amazon and was sent a replacement.  Now 5 weeks later the replacement has the same lens error and I have to now return it to Nikon for service.  This camera was to replace another Coolpix that I had for over a year before developing a lens error.  I recommend looking at other cameras that aren't prone to this problem.", "Date": "January 25, 2010"}, {"Title": "About as good as digital cameras get", "Author": "S. Rana \"sowath007\"", "ReviewID": "R1WVWZTWBMQYTS", "Overall": "4.0", "Content": "I've had this camera for about 5 months now and i don think digital point-and-shoot cameras could be any better than this.. It's very durable and takes high quality pictures with high resolutions as well.. I've compared with other sony and canon brands, which of course are a lot more expensive, but the Nikon s710 really stands out.. You won't be disappointed.Unless of course, u are professional and thus u should buy SLRs instead.", "Date": "December 18, 2009"}, {"Title": "This is an Amazing Camera! Price is so low too!", "Author": "Lewis N. Wendling", "ReviewID": "R1MJSVKYR72K9V", "Overall": "5.0", "Content": "This camera is awesome. I bought it over the summer, as a treat to myself & this thing is the best camera ever! The pictures are amazing and the style is so sleek! Best camera for sports because my sister does cheerleading and the action mood is great. so clean & crisp pictures. Makes a great camera for scrap booking! All & all I give it 5 starts & 2 thumbs up!", "Date": "December 17, 2009"}, {"Title": "Exellent Buy!!", "Author": "Angel Arturo Gonzalez", "ReviewID": "R1AX5UC32QKYD5", "Overall": "5.0", "Content": "I bought this camera and was so nice I had to buy another one for my daughter,she loved it too.", "Date": "November 24, 2009"}, {"Title": "Great camera", "Author": "Barry Tronstad \"travel crazy duo\"", "ReviewID": "R3QPDVKRFUC2N1", "Overall": "5.0", "Content": "Got it for my wife....small, light, panoramic, SD card....fits in your pocket.  Balances my Nikon D 300...", "Date": "November 14, 2009"}, {"Title": "coolpix camera", "Author": "Renee M. Aronson", "ReviewID": "R3JZ9Z9CIS2AGC", "Overall": "4.0", "Content": "I am very satisfied with this purchase.  Received it in a short amount of time.", "Date": "September 11, 2009"}, {"Title": "Very good camera", "Author": "Steven C. Alter \"alteredstate1\"", "ReviewID": "RPDGOY67GF3XC", "Overall": "4.0", "Content": "This is a very good Nikon compact DigitalI have had other Nikon cameras for years", "Date": "September 11, 2009"}, {"Title": "Love this camera", "Author": "Talva A. Lockhart", "ReviewID": "R3OX632QAXL4UM", "Overall": "5.0", "Content": "This camera was a replacement and it is the best digital camera ever.  The picture resolution and quality is the best.  I will totally recommend to everyone but you will have to pay the price but it was well worth it.", "Date": "January 15, 2009"}, {"Title": "On Bright Sunny Days Watch Out No View Finder", "Author": "J. S Thomas \"Jethro\"", "ReviewID": "R1OCE36XDVDSUU", "Overall": "4.0", "Content": "Great little camera, easy to use, nice set of features and takes nice photos.  However, the negative is NO view finder....keep this in mind if you plan on taking alot of photos outdoors.  I was using mine at my sons outdoors sports event and it was bright and sunny. I then realized I could NOT see the viewer as it was washed out by the bright sunlight and I had to just aim and shoot and hope for the best. On this day I wished this had a viewfinder...other than this its a good camera...", "Date": "August 25, 2009"}, {"Title": "Nice camera", "Author": "Onur Buyukceran", "ReviewID": "R1K1JXBSNXSWAM", "Overall": "4.0", "Content": "Pros: easy to set up, easy to use, fast, high quality fine pictures, autofocus works very well, battery lasts forever, high quality materials, look fantastic, 3inch screen.Cons: low resolution screen, have to open the cam while reviewing pictures (i had a canon once which you can review pictures without opening lens)", "Date": "June 30, 2009"}, {"Title": "Just what i expected", "Author": "Jonathan L. Offerdahl", "ReviewID": "RIUEQI021RORQ", "Overall": "5.0", "Content": "Read a lot of good reviews before getting this camera and its lived up to all of them. Very happy with this purchase!", "Date": "January 30, 2010"}, {"Title": "Great Camera", "Author": "Vivian C. Marxuach", "ReviewID": "R31REZ4C3WBBNI", "Overall": "5.0", "Content": "I know there may be more bulky cameras that claim better quality but I LOVE THIS CAMERA.  It is perfect to carry in your purse all they time and never miss a picture moment.  I have been able to document and create yearly albums of the special moments in our family and of every beautiful thing that I see that deserves to be captured, a beautiful sunset, the changing of the leaves..etc.", "Date": "April 12, 2009"}, {"Title": "Nikon Coolpix S710 Digital Camera", "Author": "Ernesto J. Duhart Novaro", "ReviewID": "RKEXMKW1FR0ES", "Overall": "5.0", "Content": "It is an excellent product, excellent quality and takes great pictures. I always recommend Nikon Cameras.", "Date": "February 27, 2009"}, {"Title": "Nikon S710", "Author": "Thanh N. Stough", "ReviewID": "RLDAFESB3NUIR", "Overall": "1.0", "Content": "Just do not buy it.  I was good for me only the first couples of week, I did every thing I could to improve the qualities of this camera but... they weren't there.", "Date": "September 23, 2009"}, {"Title": "easy", "Author": "Dbo \"GRASS MAN\"", "ReviewID": "R2OSMGNZ867WLE", "Overall": "5.0", "Content": "great value,great pictures, and very easy to use... play with it!  it digital.. delete your mistakes... that keeps it fun..and better pics", "Date": "June 13, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001DNZ1P2"}}