{"Reviews": [{"Title": "THE i-Pod of Digital Cameras", "Author": "jhtrdr \"jtrdr70\"", "ReviewID": "R3VV0LHCMARH73", "Overall": "5.0", "Content": "This is THE BEST digital camera I have ever used/owned.  In the time we have owned the camera, the pictures, video, and ease of use have been incredible.  It is really easy to use, has many features which make it VERY simple to use - which is what a point and shoot camera should be.  I've used an SLR, but needed a simple camera to just take great shots w/o effort.  It only has three buttons - one of which is an info button - providing answers to questions about whatever is on the current screen.  I didn't buy it for the touch screen, but it is great for flipping through photos for the one you want.If your comparing with a Canon you should check the Kodak V1073 out first.  I tried using one other Kodak model, and it seemed study, yet compared about the same as the other digital cameras around.  The V1073 seems to be an (successful) experiment in breaking away from the typical Kodak camera, so I would limit my recommendation to only this camera.CANON:  The main reason I switched from Canon was the photo quality.  I don't know if it's the technology or the internal software, but indoor pictures were inconsistent, and poor quality.  The same picture taken seconds later at the same object, place, etc would look different.  It would use the flash the first time, and not the second time??  I read books, blogs, everything.  Changed the ISO until the quality broke down, nothing.  Overall, pictures mostly turn out very dark or too bright with a flash.  I did discover that this seems to be a recurring issue with canon point and shoot cameras as I found on amazon comments.  Tired of owners manuals, ISO settings, etc, I began searching for a new camera, and accidentally ran into this camera in a store.  I finally gave a U.S. camera company a chance, and it was worth it.Background:  I've owned about 4/5 digital cameras, and have experimented with many more.  For the most part, I have bought the Canon series because of the look, weight, fairly ease of use, and very sturdy construction.  However, as with most digital cameras (and technology as a whole) they have way to many features and little clear explanation of proper use.Comment on previous comments about this camera:-\"the Kodak camera lense periodically \"clicks\" as it tries to adjust for lighting changes\"  I have not had this issue during the video mode.  The camera will allow you to lock the focus if is an issue.-\"The battery and memory card Door [poor quality]\"  I will admit, this is the one thing I dislike about the camera.  However, my last $350 canon battery door was no better.  I've had no problems, and really don't expect I will.-\"The battery only lasted for about 30 minutes\" My wife took over 100 10mp photos and uploaded it to our MacBook Pro with another day or two of power left over.  Holds a good charge. \"battery bay latch also very easily comes unhooked\"  Never happened once in the time I've owned it-\"horrible video HD playback on PC\"  HD playback is INCREDIBLE.  However, you do need software (just like you need the right TV and DVD Player) to effectively play HD.  If you have a Mac, you will love this camera and the HD video as the camera video is formated for quicktime.  It also works flawlessly with iPhoto and iMovie.  PC owners - you have an inferior machine which will continue to become more and more inferior as technology moves forward.  That said, I've played the video on my old PC laptop (with a free pc version of quicktime) with equal quality (pc owner for 20 years - recently switched to Apple).  However, I doubt you will have any problem with this camera and a PC.  I bought this camera instead of an $800 video camera to take extended videos of our first 3 month old son - and it works great. Video and photos in one easy to use package.  Not sure why people still buy a camera for photos and a video camera for video.  So many people I talk to still don't realize you can take video on most of todays cameras.Pros: Work right out of the box/great pictures - clear, well lit - Kodak's PerfectTouch does a surprisingly good job of instantly fixing the photo after taken/great functionality/HD video/Clear settings/Touchscreen/info button explains how to setup for 4x6 photos, or whatever you want/very good light adjustment/Apple compatible/delete button offered on the screen right after you take the photo (if it's just a bad shot you don't want)/switches from view photos to take pictures simply by pressing the snapshot button halfway down - so simple!/solid feeling gunmetal construction/many other well thought out featuresCons:Battery door not the best construction/Battery must be charged while in the camera - no separate charger/camera has locked up twice - just remove battery for a sec and replace it - no photos lost - no big deal/only 3x's zoom - i have found it works fine for overall use.Hope this helps...", "Date": "July 21, 2008"}, {"Title": "Kodak Easy Share V1073", "Author": "Kim Wes", "ReviewID": "R268VE6VWYNSRG", "Overall": "4.0", "Content": "We bought this camera for our 17 yr. old daughter who is a picture-taking fanatic.  She had an older Kodak Easy Share and was ready for a new one.  She is having a blast with this new camera.  It's easy to use, she loves the touch screen.  The pictures are so clear and vibrant.  It's a fun camera for any age.  We have a Kodak all in one printer and the pictures print out better than the ones we had done at a store Kiosk.We haven't had a problem with the battery compartment sliding open like other people have stated.  This camera was purchased primarily for pictures not for the video feature, so I can't say anything about that.All in all, I would say if you're an amateur camera buff, this camera should work just fine for you.", "Date": "June 26, 2008"}, {"Title": "Frustratingly decent camera with severe limitations", "Author": "Gene Vostok", "ReviewID": "R33RD94GTNDLKP", "Overall": "3.0", "Content": "It's hard to choose a Kodak subcompact today when Canon remains the standard, with consistent quality through the years. If a particular Canon model is not the leader in it's class it's always a solid 2nd or 3rd, and no company has maintained such consistent standards in this catagory over the years.  With such a time-tested pedigree why would anyone choose to NOT buy a Canon?  Kodak, by comparison, has nearly vanished from the high end, with the majority of its models sub 100$ generic mediocrities.In this context, i purchased the v1273 (the 12 megapixel version of this camera), the second most expensive camera offered on the market by Kodak today.  So how does it fare?Suprisingly well, in fact, but with some significant drawbacks.For the 12mp, the HD quality on my 42\" TV is stunningly acceptable (which creates a zoomed in, 16:9 9mp image).  Kodak's secret is it's \"Smart Capture\" function which automatically applies Kodak's \"Perfect Touch\" technology.  Which is, in a nutshell, automatic post-processing.  It increase saturation, contrast, and other similar values automatically, creating stunning first-time photos without tedius work on the computer after the shoot.  It also retains full access to most manual functions, although this requires a bit of hunting and pecking because these functions are not explained in the manual.And that manual functions are not explained is just the beginning to this camera's drawbacks.  There is no battery meter!  You have to guess about how much charge it has; and this is important, as the touchscreen devours energy.  The screen is completely illegible in bright sunlight - not sort of/kind of dark but completely washed out (98%-99% washed out).  You cannot preview your photos without turning on the lens, and it remains on.  It takes dissapointingly average \"HD\" video, which is all but the exact same as a 4 year old Casio Exilim, only larger.  A camera with better lenses and image stabilization, like the Panasonic FZ-18k, takes vastly better videos, despite the megapixel gap.Perhaps the biggest drawback is with it's very halmark.  The Perfect Touch pseudo-postprocessing technology does well in bright sunny days with blue skies and green plants - but it tends not to choose the correct settings in early or late hours, or at night.  The rich colors of sunsets tend to be washed out as it attempts to brighten the whole scene and make everything equally visible, blue-ify the sky and green-ify the trees around with somewhat oversaturated \"Kodak\" colors.  Sadly getting pictures to look half as good with manual settings is nigh impossible and often the result is comically bad, like some polarized nightmare.Still, with all that said... out of the box, on full auto, it took a better landscape picture on automatic than a full 1000$ Canon Eos 40D on auto (we compared).  If you're an obsessive control freak about RAW data, ect., this camera will not make you happy.  If you want beautiful pictures, on full auto, to show on your 1080p HD TV that make non-photophilles go \"wow! ooh, ahh!\", without any post-processing effort, this, or it's cousin the v1253, which doesn't have a horrible touchscreen, might be the camera for you.Just be sure to bring an extra battery.", "Date": "July 29, 2008"}, {"Title": "V1073 is better than you may think.", "Author": "The Folded Space", "ReviewID": "R1WZNVIQYNYP0U", "Overall": "4.0", "Content": "The 4 stars are relative. Obviously there are better cameras available, but the price is right for the features this camera has. The lack of protruding buttons (other than the zoom) makes the design ideal for pocket or bag. I also like the under-designed body. That's a big change for Kodak towards better products.The image quality is quite good - especially if your main photography goal is convenience. Low light performance is also good thanks to a larger chip than most compact cameras have (7.40 x 5.55 mm instead of the typical 5.75 x 4.31 mm). This lowers the pixel density allowing for greater light capture where many other cameras run the needless megapixel race resulting in grainy photos.The 720p video is perhaps the main reason to choose the V1073. So far I've had good results with the possible exception of the metering going between warm and cool hue shifts when shooting indoors. There is also the purple vertical line problem in small, extremely bright areas that practically all HD compact cameras have.The battery door problems that others have mentioned has not happened to mine, but I never open it instead using the cable to transfer files and charge.", "Date": "November 4, 2008"}, {"Title": "Kodak V1073 Easyshare Camera Review- John Riblet 12-11-08", "Author": "Patricia T. Riblet", "ReviewID": "RYKF8ZAYCHBTM", "Overall": "5.0", "Content": "Personal User Review:  Kodak V1073 Easyshare Compact Digital Camera (December 11, 2008)I have been and continue to be a confirmed film camera photographer as film (and its great variety of choices) gives me the versatility and image quality that I appreciate in the photographic works that I do. Digital photography for me (until recently) has solely been my use of dedicated film scanners to translate film into digital files to make the 10x15 custom digital prints that I do every week. (Although I used to do color darkroom work that activity has with time become impractical for me to continue to do.) Although digital printing is quite different than chemical color printing, digital printing with care and a similar attention to detail (as is required in chemical printing) is capable of quite excellent results.A few years ago my wife bought a compact digital camera for herself and she soon used it more often than any film camera she ever had. I liked the pictures she was taking and I began to notice the strengths of a compact digital camera (that I am sure most compact digital owners are aware of ): the camera's unobtrusiveness and pocket-ability; the great depth of field of its 8mm lens; the new image capture possibilities of having a live preview monitor; the ability to change color, contrast, white balance, and sharpness settings; the ability to take hundreds of images without reloading a new memory card; and, of course, the capability of instantly reviewing captured images (to determine if certain images need to be re-shot). My wife encouraged me to try out her compact camera and after an initial probing out on my part of the camera settings to find the best way for me to use this camera effectively, I found that her little camera was indeed quite a camera for certain of my own desired uses. I, therefore, decided I wanted a compact digital camera of my own. For the next several months I read everything I could find about compact digital cameras. I was not at all interested in the digital single lens reflex cameras (as, if I knew in fact that I was going out to take pictures requiring heavy equipment, I was more than happy to use my film cameras and equipment). What I wanted was a versatile camera that would be on my person at all times for those occasions (sometimes numerous) when photographic opportunities unexpectedly present themselves.I had not previously seen nor handled the Kodak V1073 camera but I was immediately attracted to its published specifications:1. The Schneider-Kreuznach Varigon  37-111mm (35mm equivalent) all glass lens. Iwanted a modest zoom lens as I did not want a longer zoom range lens in exchange for a physically smaller camera sensor. Also, I did not want a zoom lens that zoomed too wide as I seldom use 35mm to 28mm lenses even though I own them. (There is very little distortion in the 37 to 55mm range of lenses.) Schneider is truly one of the great lens companies of the world making lenses for prestigious camera makers too numerous for me to even attempt to mention. I have used and own Schneider film camera and darkroom enlarging lenses and they are among my very favorite lenses. Their optics are truly impressive. (The V1073 Kodak camera Schneider lens combination reminds me historically of the more than 70 year collaboration between Kodak and Schneider when Kodak turned the photographic world upside down in 1936 by introducing the more moderately priced German Retina 35mm camera (with variable controls and with Schneider optics) capable of using Kodak's newly invented 35mm film cassette (making 35mm film in a still camera practical for the first time) and the revolutionary new Kodachrome film which together created both the photographic color revolution and the fully viable 35mm camera revolution for the world.)2. A Kodak made or designed 1/1.63\" size camera sensor with 10 effective megapixels. (Some writers give the effective megapixels as 11.34 because of the larger sensor size). This is a very large sensor size for a compact digital camera of this type and I was attracted as much to this specification of the camera as by the Schneider optics. Also, it was important to me that this is a Kodak made or designed camera sensor. Many people know that Kodak is the pioneer company that in 1885 to 1889 invented cellulose based film and cellulose based roll films (modern films) making photography more broadly available to the public than was the case with metal, glass, and paper plate loaded cameras in the 19th century. Many people also know that later, Kodak created the \"snapshot\" revolution by introducing the Pocket Kodak Camera making photography available to a huge public. I already mentioned above the still later Kodak Kodachrome color revolution and 35mm still camera revolution that was based on Kodak's 35mm film cassette, Kodachrome film, and the excellent Retina camera with superb Schneider optics (not yet mentioning the huge impact that Kodak had on home and professional movie cameras). Yet for some reason few people seem to be aware that Kodak invented the digital camera in 1975 (Steve Sasson, Kodak's chief technician was honored this year (2008) in Cologne, Germany for his achievement). By 1980 or so Kodak's digital pioneering efforts would allow Kodak to provide the public with the service of digitally scanning film onto CD discs to view photo images on home televisions by Kodak's invention of film scanning. Kodak's digital cameras and scanners created the basis and the foundation of the digital photography revolution. Kodak's 14 megapixel full frame sensor Pro DCS camera of 2002 continues to be in class by itself even after all the new innovations of the last six years. When Leica made its first M8 digital camera Kodak designed and made its sensor. And this year (2008) Leica released its astonishing 37 megapixel S2 camera with a sensor (designed and made by Kodak). The Kodak sensor for the Leica S2 camera is 50% larger than a normal 35mm full frame camera although the Leica S2 camera body is roughly the same size as a normal single lens reflex 35mm camera body. And too, Kodak has made a 50 megapixel space station camera sensor which is the largest camera sensor ever made to this point in time. In short, Kodak is the foremost camera sensor designer in the world from its inception in 1975 to the present. Consequently, the V1073 camera with its Kodak designed larger than normal 1/1.63\" size sensor for a modest compact camera of this type immediately attracted my attention.3. The V1073 camera has an internal imaging processing \"engine\" designed by Kodak. That feature of the V1073, also, immediately attracted my attention. As I wrote earlier, George Eastman invented cellulose film and cellulose roll film in the 19th century and formed the Kodak Company. In 1930 Kodak contracted Leopold Mannes and Leopold Godowski Jr. to work with Kodak's Rochester Laboratory Research Staff to perfect Mannes' and Godowski's three color film emulsion process which became known to the world as Kodachrome about five years later ( a truly Revolutionary film!). In 1940 Kodak introduced Ektachrome transparency film which could be locally or home processed with Kodak's E chemistries. (Kodak's E chemistries continue to be the basis to this day of all non-Kodachrome transparency films regardless of the manufacturing companies making the films.) The films made by Kodak are too extensive for me to continue further with this discussion but as is appreciated by myriads of serious film photographers (including myself), Kodak is justly famous not only for its film inventions but even more so for the high quality of its film inventions (particularly for the neutral white balance of its films which permit Kodak films to have richly hued and cleanly differentiated color balances. Kodak continues to make films in all sizes for professional and amateur photographers, and Kodak continues to create new kinds of films, e.g., this year it released Kodak professional Portra ASA 800 film. (The other major film manufacturers also continue to research new film formulations. Film photography is far far from dead!) The fact that Kodak's V1073 digital camera has an image processing \"engine\" designed by Kodak means to me that the Kodak designers of the V1073 image processing \"engine\" had all (to be sure) of Kodak's expertise in film making to draw from to determine the color, contrast, definition, and neutral white balances of its digital imaging processing \"engine's\" interpretation and final rendition of the V1073 images. Therefore, the Kodak designed image processing \"engine\" for the V1073,  in conjunction with the large 1/1.63\" sensor of the V1073, and its modest zoom ratio Schneider glass lens (from a great lens designer) decided for me that I should try out this camera.I purchased the V1073 camera new (sight unseen) on line through Amazon and received the camera and accessories in perfect condition by mail quite promptly.Upon examining the V1073 camera I was pleasantly surprised by a number of things:1. The V1073 is much smaller than I expected. It easily slips into my sport coat handkerchief pocket almost unnoticeably. Since it has a touch activated screen I feel the screen is less subject to scratches so I carry the V1073 without a case in my front trouser pocket along with a small cushion to protect the camera from my possibly bumping into things.2. The camera feels very well made with a good weight and balance. The activation and control buttons on the top and back of the camera have a positive feel and operational ease to them. The camera is clad in a high quality handsome gun metal like looking brushed finish which is easily cleaned with the soft camera bag that comes with the camera. The camera is matte black in color with lighter grey color on the lens housing. Although the word Kodak is printed rather large on the front of the camera, all the printing on the camera is almost invisible unless the camera is held at certain angles to the light. This basic black color of the V1073 along with the discreetness of its visible controls gives the V1073 a starkly simple and modern streamlined look. It is a very good looking camera! (This camera with its German designed lens and American designed sensor has a Japanese designed body and was assembled in China. (By looking at the camera I would be tempted to believe that the Japanese designers consulted with Italian Modern or Scandinavian Modern designers to come up with the V1073's ultra modern look.)3. Some handling characteristics of the V1073: I always practice holding a new camera so that I can activate the significant controls quickly without having to hunt for their location. I soon knew that I was able to release the shutter one handedly with either hand at every conceivable holding angle.  Although Kodak provides an informational CD and an owner's manual, I only looked at the front and rear drawings of the V1073 in their manual which names each feature on the camera and I further looked at the pictures in the manual that gave names to mode symbols on the V1073's monitor screen. The V1073's controls layout is simple in the extreme. The top left camera switch turns the camera on. The Smart Image Mode or the Macro Icon (if activated) appears on the screen and if that is what the camera user wants (auto everything in a 3 to 4 image proportion) then it is simply point and activate the shutter release. Although I can always fall back on this mode if I am perplexed by the lighting and/or subjects before me (which could be true for me in regard to the Scene Modes also) I never ,in fact, use any Scene Mode or auto everything mode with any camera. Therefore, for me after turning the camera on I then press the Mode Icon on the screen and I have a choice of Smart Mode, Program Mode, or Scene Modes. Since I only use Program Mode, I press Program Mode letter P on the screen and then I press the dedicated center rear switch on the back of the camera which displays the menu of the programmable features. There are a large number of programmable control features (which is very very desirable) from color strength, image sharpness, white balance, focusing area, metering area to image proportions and many more. All the feature choices are easily understood upon reading them and easily activated by touching the screen. It takes a bit of time to program all the features desired the first time but once they are selected they automatically come on again when turning the camera on again: the user then merely presses the Mode Icon and then the Program Mode letter on the screen which permits pictures to be taken within two or three seconds. I practiced going through the menu at least a half a dozen times so that I knew where everything was located. In actual use the V1073 camera is extremely fast in changing the custom settings of the camera: the touch screen is faster than dedicated mode switches (and a programmed feature can be programmed, un-programmed, and reprogrammed again quite rapidly). In Program Mode a symbol is visible on the screen so that the user can turn the flash on and off or change from macro to infinity focus and so on. Also, a very small exposure compensation setting is visible on the screen at all times in Program Mode that can be quickly changed at a touch (with no need to be delayed by hunting for it in the menu selections). If there is one variable setting on a camera that I need immediate access to, it is the exposure compensation setting as I usually have the camera setting on spot metering and center focusing and I often need to reset the exposure compensation setting after each picture because of the particular lighting conditions or because I didn't completely like the exposure of the first picture I made of a particular subject when seeing it appear on the monitor after releasing the shutter. The layout of the V1073 camera was very well thought out indeed. Also, it would be very difficult to accidentally change a  setting on the V1073 while using the camera. For example, I never use the video  camera setting on a digital compact camera. I nevertheless have often accidentally  activated the video feature on two different compact cameras that I borrowed which  wasted  my time, my memory card capacity, my battery life, and further lost me my opportunities to take the original images I was after. With the V1073 camera I would say that is very unlikely that its video features (or any other important change features) could be accidentlly activated. Again, as stated above, the layout of the controls on the V1073 camera were very well thought out.4. Some characteristics of the V1073 camera in taking pictures:The V1073 camera's meter and focusing mechanisms are consistently accurate and fast acting. I appreciate the focus lock beep (which I set at low volume (along with the confirmation sounds of the other mode and feature change settings which I also set at low volume)). The V1073 can take pictures as fast as I can compose the image, half depress the shutter to lock on a significant focus and metering area, change the exposure compensation scale by a touch of the screen (if I think this is necessary), release the shutter and then see the captured image appear on the screen to quickly at a glance find out if I had composed, focused, and metered the image correctly to determine if the image needs to be retaken while the opportunity to do so still exists. Then the above image capturing cycle is repeated again and again. Each cycle is usually a matter of a few seconds. I do not wish to shoot any faster than the time required for the image composition and (usually required) camera adjustment cycle. I don't shoot a still camera like a video camera, nor like a machine gun; nor do I close my eyes and indiscriminately activate randomly the shutter in rapid sequence hoping that good photos will jump into the camera somehow. If I want good photographs (with any camera) I need to see (and even feel) what I am doing; then recompose, correct, adjust, and compensate for what I see and when I have captured the resulting images before my eyes, to retake the picture (if need be) on the same day or at a later time (if possible). The V1073 camera accurately, consistently, and unfailingly keeps pace with my picture taking sequences and camera adjustments no matter how fast I am taking the pictures. It is a fully reliable and accurate photographic instrument.5. Some characteristics of the images created on the V1073 camera:The two borrowed compact digital cameras I have experience with required that I spent about a month each of shooting each camera to determine the best custom setting to program the cameras to in order to achieve the photographic results I was seeking. Once I was successful in programming both compact cameras to suit my purposes, I noticed that the pictures from each camera had a clearly distinct personality from each other because although the two cameras had almost identical focal length lenses, they were lenses from two different manufacturers and each camera had different internal image processing \"engines\" to arrive at their final images. Looking at the pictures of the two cameras was like looking at pictures shot on different types of film, each having it own advantages as is the case with different films. Furthermore the custom program settings I made for each camera was entirely different for each camera. Therefore, I was not at all surprised when the custom settings I applied to my last borrowed compact camera did not work the same way on the V1073 camera when I applied the former camera's custom settings to it. Although I got a few good pictures on the V1073 camera on the first thirty or so pictures I shot with it, I knew nevertheless that the custom settings for the V1073 had to be radically changed from the custom settings of the two borrowed cameras to get the results I was seeking. I thereupon studied the V1073's first thirty pictures very carefully on my computer and made the custom settings on V1073 that seemed to be indicated to me by viewing its first pictures. I set out the next day with the intention of further testing the V1073 camera with its new adjusted custom settings I had made to the camera yet from the very first picture I could see that one great picture after another was \"jumping\" onto the review screen of the V1073 camera after releasing its shutter for each picture. I knew I was getting great pictures so I went into a picture taking frenzy completely forgetting that I was to test the V1073 camera for further custom adjustments. I took about 70 pictures on this second sequence of pictures with the V1073 camera. (I had deactivated the orientation sensor on the V1073 camera so I could have a full playback image each time I released the shutter for a picture. This was the first time that I appreciated the value of having a three inch viewing monitor as (after releasing the shutter each time ) I could clearly see whether I had composed, focused, and exposed the image correctly before going on to the next shot. (With my two borrowed compact cameras I had to assume that I had done everything correctly a great deal of the time.) And, it almost goes without saying, it is easier to compose and focus a previewed image on a live three inch monitor (before releasing the shutter to take the picture) than previewing an image on a smaller live monitor. The three inch live monitor previews on the V1073 camera are accurate to the corners and thus can be completely relied on as faithful previews of the images to be captured. (The V1073 monitor screen is difficult to see in sunlight but I have never handled any digital camera that I could see the monitor any better in sunlight. Since I generally set the V1073 picture proportions to 2 by 3 (since I usually make all of my custom prints in a 2 by 3 proportion), if I can't see the monitored image accurately enough in sunlight, I then change the camera image proportions back to a 3 by 4 proportion and guess the composition the best I am able to based on what I can see, and then later accurately crop the picture back to 2 by 3 when viewing the picture at home. This method works for me most of the time.)To return to my second set of approximately seventy test images on the V1073 camera. I always sort my digital images on a computer to give a full fair appraisal to each picture before sorting the images into separate files. I was a little worried about seeing this second set of test images as the images appeared to be so good on the V1073's monitor after taking them that I was afraid I had merely imagined that I saw good pictures. It was very slow for me to view these seventy pictures on my computer because I was stunned by one great picture after another just like I had seen on the V1073's automatic playback monitor after releasing the shutter for each picture. (I had custom set the controls of the V1073 to the settings that would best accomplish my purposes within two days (thanks no doubt to my experience in successfully putting  custom settings on the  two borrowed compact cameras I had worked with for a few months.)) It is hard for me to describe the quality of pictures that the V1073 camera had captured for me (and continues to capture for me). The pictures were accurately composed in the V1073's live monitor before releasing the shutter each and every time. The contrast of all the test pictures were excellent yet fully natural looking. The pictures had a natural unstrained sharpness to them (and all the pictures could be blown up 100% because of the V1073's accurate focusing mechanisms and the incredible resolution of the V1073's  Schneider optics (which would easily permit me to make the 10x15 custom prints I normally make of any of the pictures in this second test picture sequence I was viewing if I desired to do so). The colors of the pictures were astonishing: rich, vivid, cleanly differentiated, accurately hued, saturated color without unnatural exaggeration (white whites, red reds, true blacks, with no color bleeding over to other colors, and the very subtlest of nuances between colors if the scenes had minute color subtleties to capture). I have never seen such color rendered by a compact digital camera before. (There is a Kodak processing shop near my house with a large sign over the entrance that says in huge letters that \"Kodak is Color\".) The pictures had something else that is hard to put into words: the pictures had Body, Presence, Depth, and Image Realism that are \"irresistible\", that \"command\" to be respected and looked at (for lack of vocabulary on my part to say more). All the pictures were virtually without noise as I always shoot all cameras I have used (film or digital) at ASA 100 or below as I get the results I appreciate in photography at the low ASA settings. I keep the V1073 camera on its low manual settings of ASA 80. (The V1073's printed specifications states that the lowest ASA setting is 64 which is either a misprint or a variable ASA setting that is only available on auto ASA mode.) (The V1073 camera is especially good at close up photography which I do great deal of and of rendering the subtle or bold colors of subjects in general that I quite often come upon.) I did not expect this much quality from a modest (at least looking) compact camera. I attribute the image creating greatness of the V1073 to the initial specifications that attracted me to the camera: the great Schneider optics (that I have long respected), the unusually large 1/1.63\" sensor (for a compact camera) designed by Kodak (the world's leading sensor designer), and the V1073's internal image processing \"engine\" designed by Kodak which I am sure utilized the expert input on image creation from the great creator of film and great films, Kodak. I initially was a little reluctant to show my wife pictures from the V1073 camera fearing somewhat that I might have just dreamed that the V1073 is consistently capable of creating great pictures (in that I never hear or read from anyone that would acknowledge a compact camera as being a serious photographic instrument). My wife let out an exclamation of almost disbelief at seeing the first picture from the V1073 camera and continued to do so as I showed her more and more V1073 pictures. My wife's astonished and mesmerized reactions to the V1073 pictures exactly mirrored my own stunned reactions upon first seeing pictures from this incredible but modest looking little camera. The V1073 is without qualifications a serious photographic instrument which if treated seriously with some dedication will give serious results. For those who just want to have fun with a camera, I am more than sure that they can have fun with the V1073 as the V1073 will follow its master whoever that might be and wherever its master might go. When my heavy photographic equipment is at home because I don't expect to be taking any pictures, the V1073 camera will always be on my person ready for that unexpected image creation opportunity that often simply suddenly presents itself. The V1073 camera is worth at least twice the price for which it is selling at. However, the low price of the V1073 camera is not surprising as it has been a Kodak tradition for well over a hundred years to not only pioneer revolutionary new products and services but also to make its revolutionary products and services as affordable as possible to as many people as possible in all walks of life. Kodak the great film inventor; Kodak the great snapshot creator for the general public; Kodak the creator of color film; Kodak the great creator of digital photography and the great popularizer of all of its achievements (far beyond the borders of its own company) to a huge huge public. I can't think of anything I don't like about the V1073 camera (even though any faults it might have would be fully excused by its great image creating capabilities). I like even the little facts about the camera such as its battery being charged in the camera by an outlet converter or by a USB cord on a computer (which I find quite convenient as I always take my laptop computer with me whenever I travel). I like that the V1073's on and off switch brightly blinks when the camera is charging and I like how that light stays on when the charging is completed. I like also how the charging light on the camera is visible to any location in a room without having to come up to the camera to see if has completed charged or not. I have never shot more than 250 pictures in a sequence and the camera battery has never let me down even when I have the monitor on at full continuous power. (The camera also gives a warning message when the battery is low yet that warning comes on long before the camera will stop working and thus several more pictures may still be taken.) I always down load pictures from the memory card at the very first opportunity and recharge the camera no matter how few pictures I have taken. I have considered getting a second battery but so far my usage of the camera has not strongly motivated to do so. To close I highly recommend the Kodak V1073 Easyshare compact digital camera to any serious photographer or to any fun loving photographer.  John Riblet", "Date": "December 10, 2008"}, {"Title": "Decent Camera", "Author": "bEV", "ReviewID": "R3ULFQLXFQWWM6", "Overall": "4.0", "Content": "I bought this camera, the Kodak Easyshare V1073, to replace my old digital Polaroid, yes Polaroid, camera. I wanted something made in this century and a major upgrade, and I think I got both. The touch screen definitely makes using this camera so much easier then having to press a million buttons to do anything like most of the standards on the market.Pros: Touchscreen makes everything easier, explanations for the different modes are in camera, smart capture takes out the guess work, great macro shots, image stabilization works like a dream; your subject could spin like a Tazmanian devil, and it still takes a great still shot.Cons: Touch screen is practically INVISIBLE in sunlight. You have to hold your hand over the screen to make it out. The battery door is flimsy. Lense stays out every time your turn the camera on. Must charge battery in camera.Buy this camera if you are a point and shoot fan, and you want something a little fancier then what's currently out.", "Date": "November 15, 2008"}, {"Title": "Excellent and comparable to pro quality!", "Author": "Chris Girouard", "ReviewID": "R3IEN6SC4QY49S", "Overall": "5.0", "Content": "Kodak has always create the best on the scale of quality v affordability. This camera is no exception. The pictures are extremely crisp and sharp, the videos are HD (720p). If you are a everyday camera enthusiast, this is the camera for you. At under $200, it is very affordable with easily the same results as a $500 Canon or Nikon. The touchscreen works well but is sometimes hard to see in direct sunlight. The camera self-adapts its modes and works well in any environment. 10MP is more than enough for me and just using this camera, you can take pro quality pics with a consumer price!", "Date": "May 23, 2009"}, {"Title": "Fantastic Camera!", "Author": "T. Sloane", "ReviewID": "R1WVWA98NAJ2SP", "Overall": "5.0", "Content": "This is by far the best camera I've owned, and I've owned a few.  I read the cons in other reviews, but at the end of the day I wanted great vacation pictures that I could take without a lot of hassle.  This is definitely a point-and-shoot and yet can also be tailored for other special shots.", "Date": "February 2, 2009"}, {"Title": "Great Camera...Don't Buy From Beach Camera Though", "Author": "C. Delk", "ReviewID": "R175WWPRT8U9LM", "Overall": "4.0", "Content": "This is a very cool camera with a lot of great features.  The touch screen is very cool and easy to use.  Pictures look great and are very easy to manipulate.  There are several different styles and what not available to use, so you honestly have a very professional camera for a great value.  Kodak is a great company and you can know that you will get a good product.Caution though.  Don't buy from Beach Camera as they sold me a defective camera and left me in the lurch.  Once I went up the chain of command at Kodak, they quickly replaced the camera and I couldn't be happier.CraigCharleston, SC", "Date": "June 12, 2009"}, {"Title": "Kodak V1073 Review", "Author": "EW", "ReviewID": "R2ZQSF1BTIY2TJ", "Overall": "3.0", "Content": "I purchased this camera primarily to upgrade to HD video capability from my current Casio EX850.  Unfortunately, the Kodak camera lense periodically \"clicks\" as it tries to adjust for lighting changes, which  shows up on the video.  The quality of the video itself is much more detailed than my Casio, which only shoots video at 640 x 480 30 fps. However, the Kodak sound quality on videos is noticably poorer than the Casio.  Another important note, my PC's Windows Media Player cannot read the Kodak video format and had to use Quicktime instead.  Finally, the cameras battery compartment doesn't lock very well and easily slides open when handling the camera.After a week of use I decided to return it. Although, this 2nd generation HD video capable V1073 is an improvement over the first generation V1053, its still not quite there yet in my book.", "Date": "April 25, 2008"}, {"Title": "Don't Discount Kodak! Love this Camera, Few Flaws!", "Author": "bill.i.am", "ReviewID": "R348VG34HRG36T", "Overall": "5.0", "Content": "I love this camera. I bought it back in Summer 2008, when 10MP was a huge deal and this was one of the very first cameras using touch screen technology. Speaking of touch screens, let me start off with the...---FLAWS---1. Touch Screen: Although I bought it partly because I liked the idea of a touch screen camera, this is probably the part of the camera I find the most problem with. For one, after having the camera for over two years, the oils from your fingers (even though I am obsessive about keeping the screen clean and oil free) makes the screen difficult to see, especially outside in the sun. Even on day one it was difficult to see in the sun. There are no benefits to having a touch screen on this camera that would not exist with a normal screen.2. HD Video: The video quality is great, better than I could have ever imagined, however if you have the settings at \"Continuous Auto Focus\" you can hear the lens clicking, moving in and out, and trying to focus on whatever is in view. This sound is present and very obvious when you play back your video. You still hear the main audio you are trying to capture, however there is this constant noise of the auto focus.That's it, those are my only problems with this camera! It did finally begin to break a month ago, but still works well enough. The touch screen stopped working for a day or two (I got so nervous, thought I would need to find another camera) but came back randomly and I haven't had a problem with it since. Also, my zoom is permanently broken. I didn't abuse it in any way, however it does not allow me to zoom out. To get around this problem, if I have zoomed in but want to revert to the full view, I shut the camera off and turn it back on, which solves the problem in a roundabout sort of way.Now I'd like to share with you my...---FAVORITE FEATURES---1. Image Quality: If you want examples, take a look at my Photostream on Flickr (my username is brmibi) 90% of the photos I have uploaded are taken with this camera. Don't get me wrong, if you are naturally not great at photography, this will not be an overnight fix and jump start you into a photographic career. It will however take what you already know about composing a great shot and help you out a little. If you have the money, yes there are better cameras out there, ones that don't fit in your pocket and cost ten times the amount of this. If you are in this price range however, I believe this is one of the better cameras for image quality that you can buy.2. Portability: Obviously, point and shoot cameras are very portable. Even if you own a bulky, nice DSLR, this might be something you are interested in. Keep it in your pocket or car, take it on vacations so if you do drop it, you aren't dropping a $1500 camera body with a $400 lens (by the way, I've dropped this quite a few times before and it is still working well).In closing, I just want to say a few final words about Kodak as a whole. What really frustrates me is when people see me holding this camera and tell me \"I hate Kodaks.\" Do you really? Or are you familiar with their lower end products, so you verbally announce that you dislike the camera brand because to you it is synonymous with low quality cameras? These same people see my photos in awe and ask what camera I am using \"nowadays.\" I tell them, and suddenly the photo isn't as good in their eyes because of the name. It just frustrates me, and I wanted to tell you not to discredit a camera because of the name on it. Go to your local electronics department and see if they have this camera. Look at it, take some sample pictures, and decide for yourself if you like it.", "Date": "December 31, 2010"}, {"Title": "SICK Camera!", "Author": "Nicholas Blosh \"blaucha58\"", "ReviewID": "R2GZN3XW2TNYJB", "Overall": "5.0", "Content": "So i got this camera a few days ago for photo class in school as a birthday present and jesus, what a great camera. I wouldn't suggest getting it through amazon though, i got it through amazon with a case, mini tripod, and a 4gb sd card, AND a cleaning kit for [...] with free shipping that got it to me in 3 days. Back to the camera, im not going to list all of the great things because there are so many and i don't have that much time but some of the few things that could be better are: the microphone for video recording kind of sucks but its manageable and the quality of the picture in the videos makes up for it, just don't try and use this to record music videos and expect to have amazing sound quality because it isn't going to happen. Also, the screen is great overall because its huge and is a touch screen, but the actual quality of the screen is so so and its pretty hard to see in bright sunlight but again, it is manageable because you can see, just not as well as if you were inside. The camera has like 22 different scene modes i think which is great and most of them are really helpful but most of the time i'll just use smart mode which basically does everything it can to make a great picture. You can crop on the camera which is cool and the 10 MP is great. Awesome camera, even better price, i highly recommend buying it, but through ebay not amazon.", "Date": "September 6, 2009"}, {"Title": "Satisfied Customer", "Author": "L.L.", "ReviewID": "R1QTIRTU85NVD", "Overall": "4.0", "Content": "This is my second Kodak Camera ever owned and I can honestly say I'm very satisfied. I've tried other brands but they alway get returned for a Kodak. The V1073 just like any other Kodak camera  is very user friendly. The pictures come out flawless. One of the things I love about Kodak cameras are there fast shutter speed. You will never miss a moment with this camera. The only small flaw is that the screen is alittle more difficult to see in daylight than other cameras I've owned. But the pics still came out beautifully and really all cameras have that issue on a extra sunny day. The touch screen is just an extra bonus. Not really needed but a cool feature to have. Overall very satisfied!", "Date": "August 2, 2009"}, {"Title": "Okay camera", "Author": "B. Storm \"IBStormin\"", "ReviewID": "R1VANOPT818MPD", "Overall": "3.0", "Content": "Well, I really liked the touch screen, it was really fun to use the camera with the touch screen feature. However, I purchased this camera because my other digital camera has a bit of a hesitation before it actually snaps the picture, but when it did take the picture they were really crisp and clear. With this Kodak however, it seemed like maybe 4 out of 10 pictures at most were crisp and clear, and the other 6 out of 10, kind of had a blurry glow to the edges of the objects in the pictures!! However it did take the pictures very quick. So if you arent a perfectionist like me, then this might be the camera for you, but I myself will keep looking for the right one!!", "Date": "February 18, 2009"}, {"Title": "Blurry indoor photos.", "Author": "M. Chessher \"MC TX\"", "ReviewID": "R3ITP2097N38AM", "Overall": "1.0", "Content": "I've had this camera for almost a year.  Not only has it broken twice (the automatic shutter does not open and close fully) but it takes terrible pictures.  It's so rare that I get a decent photo, I have gone back to using my old-school clunky Sony with a 16mb memory card.  I'm tossing this Kodak and replacing it with another Sony.", "Date": "November 25, 2008"}, {"Title": "Hands down, best camera i have/will ever own", "Author": "Taryn", "ReviewID": "R7OZ4UUM642VR", "Overall": "5.0", "Content": "This by far has been the best camera i ever owned! i get a new camera every year, and nothing has compared to this camera!", "Date": "June 7, 2012"}, {"Title": "total waste of money", "Author": "Dalen F. Snow II \"Krsdad\"", "ReviewID": "R2QDCTH750II0L", "Overall": "1.0", "Content": "I bought this camera cause of the high MP's and of the HD video. I spent another $80 buying the docking station to hook it up to my tv . after a year of it being kept in a nice padded case out of the elements , it turns on then turns right back off. I'm being told since its out of warranty I have to pay to have it repaired. I have purchased extra batteries and chargers for backup , now Im out the $300 I paid for this when it was new , $80 for the docking station and $40 in batteries and chargers. I went with Kodak cause of the name. Im no longer having any faith in the Kodak name", "Date": "February 5, 2012"}, {"Title": "dont buy it", "Author": "sharon", "ReviewID": "RU07ZBJ11980U", "Overall": "1.0", "Content": "after a year using this camera, it breaks. it also would not charge. the picture quality is  not so great either, especially when it's 10mp. i have used over cameras that are cheaper and it is far better than this camera.", "Date": "January 5, 2011"}, {"Title": "Kodak EasyShare V1073 Digital Camera", "Author": "Pugchick \"Pugchick\"", "ReviewID": "R3684IXITTB2HI", "Overall": "5.0", "Content": "I absolutely love this camera!  It was so easy to use right out of the box!", "Date": "February 11, 2010"}, {"Title": "Almost Perfect", "Author": "Scott Seeger", "ReviewID": "R3OWYCWZEXLL62", "Overall": "5.0", "Content": "Great Camera.  The picture quality is more than i'll ever need.  The camera feels good in your hands and has a good simple design.  I love the touch screen and so does everyone that sees it.  I've only have two minor complaints.  The screen can be a little dark in bright light but I've still been able to see enough to take a good picture.  The other complaint is that sometimes the touchscreen can have a mind of it's own, but this is very minor and once you get the hang of it, it's not a problem at all.  I promise if you buy this camera you won't be disappointed.", "Date": "January 4, 2010"}, {"Title": "Kodak EasyShare V1073 10MP Digital Camera with 3x Optical Image Stabilized Zoom", "Author": "Katherine klunk \"Katie- Golden Creativity\"", "ReviewID": "R1U4SVIOCBMLWF", "Overall": "5.0", "Content": "This is, hands down is THE BEST digital camera I have ever owned. In the time that I have owned this camera, the pics, videos, and ease of use have all been incredible and incredibly easy! It is a really easy camera to use & has many features that make it VERY simple to use, and its easy 4 a beginner to learn 2 use as well!- which is what a point and shoot camera should be. I've used an SLR camera for years, but needed a simple camera to just take great shots, especially when your taking quick pics of your kids!  They have to be taken fast and be easy to take or you lose the shot or miss that perfect moment trying to switch lenses.  Its a multi tasking photographers dream camera for a great price!", "Date": "December 27, 2009"}, {"Title": "Broke after one year", "Author": "Sean G. Patterson", "ReviewID": "R3EOLLNI4R19IZ", "Overall": "2.0", "Content": "We had this camera for one year. It worked great for the most part. Then we noticed it started to slow down. The time it took between taking one picture and then being ready to take the next took longer and longer.Then the zoom out function stopped working, so you could zoom in but you would have to shut the camera down and restart it to reset the zoom.A month after that it stopped working completely. It would turn on, the lens would come out make a few clicks then go back in and shut off. Completely useless now.I don't recommend this camera.", "Date": "June 28, 2009"}, {"Title": "Huge Screen", "Author": "Gayle Rogers \"The Wizard of Homes\"", "ReviewID": "R1BNMPOMRC5GJO", "Overall": "4.0", "Content": "This was a gift for my daughter and she loves it. She had a larger Kodak camera but wanted a smaller one with larger screen. This has a touch screen too that makes it so simple.Great camera for the price", "Date": "December 26, 2008"}, {"Title": "Sleek!", "Author": "Noms Services Ltd \"Noms\"", "ReviewID": "R3O6G54WIKT4LK", "Overall": "5.0", "Content": "The camera is one of it's kind. I was scared when I first read the reviews but all that is gone now as I am enjoying the camera. It makes me stand out wherever I go. The earlier reviews, about the battery cover flipping open occasionally, is one giant lie. The battery lid slides neatly in.The touch screen is another fantastic quality it has. It makes it look more like a mini computer than a camera! An almost buttonless wizard! Men, you cant believe the level this camera can give you, when you go to an occasion and as other people bring out their \"camera\", you bring out this \"near buttonless wizard!\"", "Date": "June 15, 2008"}, {"Title": "Malfuntion repair", "Author": "Kathy Glasby", "ReviewID": "R21YH990JB9P8J", "Overall": "1.0", "Content": "Personally I would never buy another Kodak camera.  With the experience I had with my digital camera, it soured me forever.  Got one as a gift, used it for 6 months and it would not hold a charge.  Contacted them, was told to try differant soulutions buying different batteries, even another charger to no good.  Finally sent it in before warranty was up.  Instead of repairing it properly they more or less put a bandaid on it and called it a day.  Worked as long as the battery they replaced and that was it.  More solutions offered, nothing constructive.  Told me to send it in for another 'repair' and because it now had passed the warranty stage it would cost me more than the original cost of the camera.  Hmmmm...good business practice?  If they would have fixed it properly by testing it to see what really was wrong instead of just popping a new battery in and considered it fixed....well, heaven help the person who happens to get a malfuntioning camera from Kodak.", "Date": "May 4, 2010"}, {"Title": "HD Video \"clicks\" with bright flash while recording", "Author": "C. Liao", "ReviewID": "RZWF59JTVSK42", "Overall": "1.0", "Content": "I bought this camera mainly for its HD recording. While the resolution is nice, the HD recording \"blinks\" with a flash of bright light every 5 seconds or so. This is unacceptable for a finished product. Kodak should not release beta-test quality hardware to the market.", "Date": "August 16, 2009"}, {"Title": "Kodak V1273 and V1073", "Author": "TenderBeaverBIZ", "ReviewID": "R158IT45VBCDM", "Overall": "4.0", "Content": "Overall I really like this camera.  I am not a pro Photographer or any thing, but I will tell you what I see.  The picture quality is great for a pocket camera.  Not like my D80, but you can't compare the two.  There are only three things that really bother me about the camera.1.  The LCD screen is hard to see through when you are outside.  I think that it is because it's a touch screen.2.  The battery and memory card Door.  When you are holding the camera the door would slide open.  The door does not lock in place, it just kinda slides in place.3.  The battery only lasted for about 30 pics at 12mp and with 4 15-20 second videos.  Maybe the battery wasn't charged all the way!", "Date": "April 14, 2008"}, {"Title": "Okay photos; horrible video HD playback on PC", "Author": "LargeHeadedMagoo \"LargeHeadedMagoo\"", "ReviewID": "R3723LCL1OC3Y4", "Overall": "2.0", "Content": "Don't buy this camera to use for video unless you don't mind it looking worse than what you'll find on You Tube.  The video playback is horrible on a Pentium IV 3.0GhZ, 2GB RAM, 256MB ATI Radeon, 120 GB Sata-150 hard drive.  Why?  The Quick Time hardware CODEC used by Kodak is incompatible with the software CODEC provided by Apple.I bought this camera because of the advertised HD video recording capability.  I wanted a small device to carry with me to \"capture those special moments (c;  Maybe even velcro it to the inside of my motorcycle helmet for some \"stock footage\" (-:The video records just fine, and plays back on the camera's screen without a hitch.  Copy the video (Quick Time MP4) to a relatively fast PC (with QT 7.4 Pro installed) and the video stalls, stutters, and rarely synchs with the audio.  Heck, I could have taken still photos with my Rebel XT, taped the audio with my ZEN MP3 player, used Microsoft Movie maker, and ended up with a better result!I traded a half dozen emails with Kodak's technical team.  They seem very talented at providing a canned-response: \"Please try our automated troubleshooting web site for this product\".  Sorry, that web site has a long way to go before it's ready for prime-time.  Besides, it doesn't include the option of troubleshooting video recording or playback.  Oops.  I guess the web development team forgot about that part )-:Piecing together other customer's reviews both at Amazon and other sites, it seems that the HD video recorded with this camera can only be played back on either 1) the camera itself or 2) using a Kodak HDTV docking station.  This either gives me the joy of watching HD video on a 3 inch screen, or paying an extra $80-$100 to watch it on my plasma screen.Or, I can use QuickTime Pro (or other video-rendering software) to re-encode the video so that it plays back with a software codec.  It only takes about an hour to re-encode five minutes of video.  The file size more than quadruples, but at least I can watch it without grimacing.Reading the feedback of other Kodak customers, this seems to be indicative of Kodak development and marketing ploy: use a relatively inexpensive camera to bait the customer, then hook them into buying either extra services and/or accessories just to meet basic expectations.Please be smarter than I was.  Buy a decent camera for photos and a separate small format camcorder for home-movies.  Don't try to buy something that does both (at least until the bugs are worked out).", "Date": "June 2, 2008"}, {"Title": "Worst ever!", "Author": "Snap fan \"Duke\"", "ReviewID": "R1S46QD8QMRU61", "Overall": "1.0", "Content": "I  bought  this  camera  and tried  for a week. Do not  buy this  camera  if you gonna use it outdoors. It's  almost  impossible  to see anything on the big lcd screen on a bright day. For indoors low light  situations  is  a okay camera. Movie mode: I can't  say  I recorded in HD quality because you  need the camera dock to view it in your  TV. But when transferred the movies  to the  computer, the  quality  is not  that  great and  it  skips  when played back, and I used a 8gb 150x card. The  movies  in \"HD\" are  limited  to 29 minutes  and  a 8gb card can record about 80 minutes  of movie only. After recording a movie 29 minutes non-stop the camera  took  forever to \"process\" the information, that's terrible. I returned this piece of junk without hesitation. Do yourself a favor  and save your money for better  cameras  out there.", "Date": "September 19, 2008"}], "ProductInfo": {"Price": "$239.88", "Features": "10.0-megapixel resolution for stunning prints up to 30 x 40 inches\n3x Schneider-Kreuznach Variogon optical image-stabilized zoom lens; HD still capture and HD video\n3.0-inch touch-screen color LCD; in-camera charging using the included Li-Ion rechargeable battery\nInnovative smart capture feature automatically adjusts settings for a great picture in just about any environment\nCompatible with SD/SDHC memory cards (not included)", "Name": "Kodak Easyshare V1073 10 MP Digital Camera with 3xOptical Image Stabilized Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/419pFjJN7KL._SY300_.jpg", "ProductID": "B0012BMU2C"}}