{"Reviews": [{"Title": "Z980 ... Good camera (mostly)", "Author": "A. Mccain", "ReviewID": "R1ROU2EF7WJMB9", "Overall": "4.0", "Content": "I recently received my Z980. I am a professional, but was looking for a quick-cam as a backup. This unit takes excellent pictures in all modes. I like the RAW format, as it edits easily on my computer. The camera is very light, so tripod mounting is a must for any telephoto use. In lower ISO ranges, noise is minimal. In high ISO, photos are still quite useable!The only drawback is the memory card/battery door. It is really a pain to close. I don't know how well it will wear, therefore the 4-star rating rather than 5-star. Filters would be another nice option! (What about it Kodak?)I bought this through Amazon and it was shipped by Adorama. Shipping and packaging was excellent. If you want an excellent DSLR substitute, this would be a good choice. The only caveat is READ THE MANUAL. This is a complex camera, and you must read the manual to get the full use from it.**** Update 12/24/2009 ****After 8 months of using this camera, I find it to be quite versatile, and find myself using it for all but extreme telephoto shots (you just can't beat a EOS 40D with 1200mm tele on a solid tripod). The battery door issue I mentioned earlier has proven to be not an issue at all. Low light photos are excellent, but only in manual mode and using an external light meter (or trusting many years of experience using E400 film in low light).I recommend this camera for anyone getting into more advanced digital photography. For pros, give it a try. Depending on the type of photos you take on the job, you may find this quite useable. For nature photographers, like myself, its a whole lot lighter to carry in the field! Get a good, lightweight tripod, and you are set.", "Date": "April 14, 2009"}, {"Title": "Great Picture Quality, Very Nice Zoom", "Author": "Brian M. Edwards", "ReviewID": "R2TWF5AWCFI9WK", "Overall": "4.0", "Content": "UPDATE DECEMBER 2009Kodak now say that their Model AV-8 USB Cable will work to hook this camera up to your TV via RCA connections. I just bought one to try out and it works. It is only SD quality, NOT HD but still better than nothing. Meantime, my camera is working very well. Battery life is very good and I plan to keep this camera ofr a couple of years!Original reviewFirst off, the quality of the photos I have taken are excellent which is what a still camera should be capable of. The pictures have rich vivid colors and are real eye catchers.It has plenty of nice features and the zoom works very well. It is pretty easy to use, has a nice large LCD screen and has a hot shoe, grip accessory and extra shoot button for upright photo taking.The quality of the HD video is better than expected but I am very disappointed no AV cable to hook up to your TV is included (a call to Kodak revealed that it is not even available as an accessory)The camera itself seems fairly well made, but as others have notes, the battery compartment door feel flimsy though it has three locking metal tabs inside which should support it.I noticed a slight noise coming from the camera, Kodak's live help informed me this is normal on \"continuous\" AF setting. I put it on a different setting and it went away. Kodak assured me this is normal.Also the digital zoom is not available on Smart Capture setting (same for some menu settings)The lens cover appeared to be loose fitting at first glance but it seems to be designed this way to prevent damage to the zoom when switching the camera on.I charged the batteries  before using it the first time and now about 150 shots later it still has plenty of charge.I am pleased enough to have decided to replace my DSLR with this because I am fed up with carting all my bulky equipment around and this will suffice for pretty much all my needs.The included software is bare bones, I prefer to use Photoshop Elements,My Pro'sExcellent picture qualityFantastic zoomNice upright grip and side shoot button.Very good HD videoGood low light capabilitiesEasy to use.My Beef'sNo AV to TV cable!!!!! and nothing available (per Kodak)16 hours to charge batteries! ( better is available on their web-site for more bucks, and, no doubt, in any big box store, but make sure you buy the right batteries!)Cheap neck strap (The real thing is about $20 on their web-site, what a nerve!)Lack of decent manualSummary.The only major \"Con\" for me is the lack of AV to TV cable but there way more pluses than minuses. I will update this review as I see fit.Bottom line, you get great photos, it's easy to use, great video and super zoom in an all in one camera. The bonus hot-shoe and side grip/shoot button are icing on the cake.If you want plenty of features in an easy to use camera, this would be a good candidate for you.", "Date": "April 25, 2009"}, {"Title": "Kodak Z980 Experience", "Author": "Kent Wright \"K4thwright\"", "ReviewID": "R3T2KYS4UHD4AE", "Overall": "4.0", "Content": "I bought this camera for my wife for Mother's Day, and she is thrilled with it. I have been a semi-pro photographer since 1985 and have owned and used dozens of cameras since that time, including Olympus, Konica-Minolta, Canon, and Nikon high-end non-SLR digicams. The quality of the images produced by this camera is excellent and will meet or exceed the requirements of any photographer except in a few extreme cases of weird lighting. multi-shot action shots and other circumstances not normally encountered by non-professionals. I have three gripes with this camera: By far the most serious shortcoming is the lack of threads on the front of the lens mount to allow a filter to be attached. This lack has nothing to do with image quality, but being able to attach a clear, UV, or skylight filter is extremely important to protect the lens from damage due to scratches, bumps, dust, etc., not to mention fingerprints. The second problem with the system is the lack of a custom white balance control to permit precise color adjustment. In most cases, white balance can be adequately adjusted by post-processing with an image editor such as Photoshop or Aperture, but nothing beats having proper light balance to start with. Finally, I find the lack of camera Raw support for Macintosh computers to be a real problem for me, although most people do not need this feature and care not at all about it. Both I and my wife found the vertical hand grip to be superfluous because we are experienced in adjusting to holding the camera in either horizontal or vertical position, and all the extra grip does for us is to add extra weight and complication. Contrary to some other reviewers' evaluations we like the rechargeable AA batteries and always keep a charged spare set of batteries in the case with the camera. The batteries that came with the camera hold their charges well, although I use a better charger than the one that Kodak sells with the system. Finally, the Hot Shoe is an absolute plus and puts the Z980  way ahead of all the other super-zoom digicams currently on the market. The ability to add external flash capability to the camera is an absolute requirement for any photographer who aspires to creating the highest-quality indoor photographs.", "Date": "June 11, 2009"}, {"Title": "Great Camera for the price!", "Author": "honemasterT", "ReviewID": "R3SZOJ29YRZ32P", "Overall": "5.0", "Content": "Being a diehard Canon fan, the last two cameras I've purchased have been Kodaks why?Kodak 'Perfect Touch' technology, SMART Capture mode and HD Video.  This camera takes some stunning photos and includes a great feature set for the money!It has a true 'lcd' viewfinder.  I had not realized how much I actually *missed* using a viewfinder from my film camera days.Having a 24X zoom is incredible, for kids sporting activities, getting photos of wildlife etc:  It's an incredible creative tool to have when you are out taking photos!Camera controls are well laid out, menus are intuitive, and the in-camera panoramic mode is very good.  One of the few cameras that will stitch the photos 'in camera' for you!The only negative I have is the lack of a 'custom' white balance. This is a minor issue, as the built-in white balance settings seem to be quite good.I have been impressed with this camera.  I ended up purchasing it direct through Kodak's online store, but there are many avenues available.It's a shame that Kodak does not get the airplay as some of the Japanese Mfg's.  Their cameras are really nice for the money!You can use Quicktime Pro (on the Mac or PC) to edit the movies. You can download the version from the Apple website quite inexpensively.Overall, I am very impressed with this camera.  As an owner of canon powershot \"G\" series cameras for a long time, this is saying something.[..]Kodak EasyShare Z980 12MP Digital Camera with 24x Optical Image Stabilized Zoom and 3.0 inch LCDKodak EasyShare Z980 12MP Digital Camera + 8GB Deluxe Accessory KitKodak EasyShare Z980 12MP Digital Camera + 4GB Accessory Kit", "Date": "April 20, 2009"}, {"Title": "Perfect, except for the batteries.", "Author": "M. Schaefer", "ReviewID": "R17S9SRNYGOYOK", "Overall": "2.0", "Content": "As everyone else have pointed out in their reviews, the Z980 takes stunning pictures quite easily.This review will be less of a feature exploration and more of a tip for Z980 users regarding how to get hundreds of more pictures than the stock Kodak rechargeable batteries. In short, get a SMART charger such as this one: Duracell Mobile Charger With 2AA And 2AAA Pre Charged Rechargeable Nimh Batteries, CEF23DX4N, and Eneloop AA (or Duracell Pre-Charged) batteries.What kept me from giving a 5-star rating is the fact that Kodak broke compatibility with the previous Z Series batteries, the KLIC-8000 and CRV-3. I could take about 200 flash-photos with CRV3s and over 300 with KLIC8000s, and both are cheaply available on Ebay. In upgrading to the Z980 I can no longer use my collection of batteries and chargers that accumulated over the years after owning several Z Series Easyshares. All it would have taken Kodak to make this camera compatible with the KLIC8000 styles batteries is a rearrangement of the battery compartment, which infuriated me originally after I realized that the included Kodak AA batteries could only take about 40-50 flash-photos before losing their charge! Sony CycleEnergy AAs were even worse, which brought me to Eneloop. Four 2000mAH Eneloops take a lot of pictures. I tested a set out and gave up after 400 flash-photos on full power (set in P mode by increasing the flash charge). After 400 photos, the camera's battery meter read half-full. Update: Duracell Pre-charged AA batteries are giving me the same performance as Eneloops.Unfortunately the Z980's included charger uses a dumb timer, and is a poor choice for charging batteries. Look for a charger that is smart (knows when to stop charging) and charges individual cells (not pairs); these types of chargers won't destroy your batteries. The Duracell Mobile charger that I linked to above is a very good choice in that it is smart, charges individual cells, is cheap, and has a status LED for each cell.Update: I docked two stars because of the proprietary raw format (Kodak's own KDC filetype) that the Z980 uses. KDC is an antiquated non-standard filetype, and few programs can work with it. Anyone who needs a real RAW-capable camera definitely should look elsewhere.", "Date": "August 10, 2009"}, {"Title": "Nice intro to the new uber zoom cameras", "Author": "Bandwagonman", "ReviewID": "RGQX6HA8IMB0M", "Overall": "4.0", "Content": "I just bought this camera with the 8 gig accessory package from this website via a 3rd party vendor...I like what I see so far...it's a nice, powerful camera with the cool add-on bottom for vertical pictures...the LCD screen is crystal clear and bright...the zoom is nice - but strangely not as far as I thought...the Kodak online video of the z980 made it seem like you could see miles away up close with this lens...not really. But it's a definite upgrade from my tiny pocket cam's with a measely 3x zoom. Now I can take pictures of my kids playing sports up close...and don't need to spend thousands like my friends for the bulky DSLR's...it's a good compromise from one who used to use the pocket cameras but was hesitant to go the DSLR route...on the downside, the camera feels a little light and cheap? I fear it may break if I ever drop it. But my muscles might thank me in the long run of not having to deal with the heavy weight of those other cameras. Overall, I'm optimistic with this camera and look forward to up-close pictures with that 12 MP clarity. Cool!", "Date": "April 24, 2009"}, {"Title": "Very Pleased", "Author": "Darin S. Schmidt", "ReviewID": "R18K4D9HA6TQ9L", "Overall": "5.0", "Content": "All I got to say is. WOW, def worth the price. Zoom is phenominal and picture clarity is top notch. Some people complain abotu the SD card not being accessible without unlatching the battery door, I feel that is a safety measure incase the spring decides it wants to shoot out your card while your not looking. It has happened to me with my cell phone a cuple times.I have noticed one thing, it may because I'm new to this type of camera, but the night pictures are kinda pixelated. I may just not be using the right setting, or may need a little tuning.Some want to gripe about the Manual it comes with. It is a basic manual, but the menu it gives you is pretty self explanitory and easily navigated.Batteries last fairly long in it, i tool several hundred pics before needing to recharge.One thing that i DO NOT LIKE is the battery charger does not turn off when the batteries are charged. I had forgotten about them and they sat on there all day, maybe a day and a half, hopefully they arent ruined.", "Date": "July 13, 2009"}, {"Title": "A few more kinks to work out, Kodak", "Author": "K. Barnes \"Mom of two\"", "ReviewID": "R3E5MLFK0NKR41", "Overall": "1.0", "Content": "Kodak tried to enter the world of \"close to DSLR\" cameras with this one, and it was a nice attempt. I LOVED this camera for the first two months and then I started to notice picture quality wasn't the same as it had been. 90% of the pictures looked like the subjects were in motion with what I called a \"comet tail\" behind them, or the hands, feet and hair of my children became transparent. Heaven forbid something actually was in motion! The flash also became very picky about when it would go off. Even in \"manual\" mode with the flash set to constantly fire, it would only go off about 20% of the time, making for HORRIBLE and sometimes even unrecognizable pictures. We called Kodak and the tech. support people treated me like I was an incompetent idiot, telling me to first remove my memory card because the problem must be with the non-kodak memory card... and then it MUST have been my  non-kodak batteries that were currently in the camera... and then it MUST have been because I wasn't pressing the correct button. I was instructed to turn the camera to smart capture mode and turn the flash to a constant setting. That's not an option in the Smart Capture mode by the way, and when I told them that, I surely was doing something wrong until I rambled off the flash mode options and it still wasn't an option. It became clear that I knew more about this camera than the guy on the other end of the phone. We sent the camera in for service. The day we received the camera back, I pulled it out of the box, switched it to manual mode, turned the flash on and only 2 out of the first 5 pictures did the flash fire on. Sooo dissappointed! We called Kodak back and the first person I was speaking to asked if he could transfer me, I said sure, expecting to talk to his supervisor and he just did a lateral transfer so he didn't have to talk to me. The next guy did transfer me to a supervisor, who was unbelieveably rude and mouthy. He interruped me repeatedly and wouldn't let me speak. My husband came home and called, got another supervisor who told us this model had been discontinued and was a \"special addition\" (1 says yes 2 say no, at kodak...? who knows?- That tells me they know there are problems with this camera). They wanted us to send our camera BACK in for repairs (what makes you think they'll fix it this time if they didn't fix it last time?) and if they couldn't fix it they were going to send us a 'refurbished' model. They were going to have their manager call us within 48 business hours... a week later we called them. They wanted us to send it back again, we wanted a refund. The product is defective and the customer support was less than desireable. Thank goodness for Wal-Mart, we were able to an exchange for a 'brand new' camera that we got home and took out of the torn box, to open the camera to find the straps already attached, lens cap already attached and took some pics, and the flash didn't work on that one either! We ended up getting a refund from them Wal-Mart. God bless 'em... it wasn't their battle, but they corrected it. I will never buy a kodak again after having owned 4 of them. Never again simply because of the customer service and their inablility to admit they fell short on this model and refund the money.", "Date": "December 5, 2009"}, {"Title": "Great value, great features", "Author": "Richard L. James", "ReviewID": "R3FQCJLQW7FVWA", "Overall": "5.0", "Content": "I bought the Kodak Z980 because my previous Kodak digital had only 5.1 MP and I could see a little pixelization in 12 x 18 enlargements. Kodak offers amazing  value on their digitals, plus excellent documentation/instructions, plus easy-to-reach unlimited phone tech support.  I initiated my new Z980 yesterday at a Hollywood Bowl event, and the full 24X optical zoom used without tripod  was impressive, helped by the excellent image stabilization. Also great low-light sensitivity with the correct settings.  I took over 300 photos (using eyepiece) and still have about half a battery charge left.  E-Z in-camera panoramic stitching is fun.  In short, I think it's a wonderful value. Ignore any friends or store employees who doubt this can be true.", "Date": "June 14, 2009"}, {"Title": "A good camera...I think...", "Author": "Jason Reed", "ReviewID": "RMII92E7JC8FA", "Overall": "4.0", "Content": "I don't ever review items I buy on Amazon, but with this one, I feel I should.  So here goes...I like this camera...I think.  I have only purchased Kodak digital cameras since 2002.  My last one was the P850 which had some really good characteristics to it.  I was certain my next camera would be a Canon or Nikon dSLR, but when I compared everything, I ended up with the Z980. There are some features about it I really like.  The 3\" LCD screen is fantastic.  The picture quality seems to be really good.  I have taken some great shots of my kids.  12MP clarity is unbelievable.  The lenses seem really solid and the zoom (624mm!) is out of this world.  Kudos to Kodak!But, and there's always a but, like the other reviews have stated the SD slot is hidden inside the battery cover door, so no switching cards on the fly.  The camera takes AA batteries (rechargables are included as is a plug in charger).  Battery life seems to be decent with them.  But you can't use your Kodak dock as with every other Kodak I've owned.  The battery door is a bit difficult to work and I too am worried about this door's life span...The camera is much larger than my P850 but strangely lighter in weight?  The screw on base is odd, but does help when taking vertical pictures.  The vertical shutter release is interesting...not in a good way, not in a bad way...it's different.When you weigh out the pros and cons of this camera, like I said, I like it...I think.", "Date": "April 15, 2009"}, {"Title": "Very nice camera for the money", "Author": "Paul", "ReviewID": "RZPSHRUKJM8NB", "Overall": "5.0", "Content": "Could use a little improvement.  I have had this camera for about 2 months now.  I find when trying to turn camera on without looking I keep switching the high/low shutter button switch instead of the on/off switch.  Perhaps these 2 switches should be reversed.  Also, it could use a famale shutter jack.  The biggest improvement I suggest would be a remote control, this would help with time lapse photography and being included in family photos instead of constantly running back to reset the timer. It is an upgrade from my Z712 which I rate at a five star. I am more a point and shoot photographer in all settings.  This camera does a nice job with filling my needs.  I will update this review in about a year.", "Date": "June 16, 2009"}, {"Title": "Great alternative to SLR  UPDATE!", "Author": "M. McDowell", "ReviewID": "R2YFL0I1L2AYC2", "Overall": "4.0", "Content": "I've only had this a few days but so far so good.  I have a Kodak P850 and wanted to upgrade without spending more for an SLR.  I thought my pictures were good with my 850 but these are amazing.  I took the same pictures with both and couldn't believe the difference.  The only reason I'm giving it only 4 stars is because I'm not crazy about the AA batteries.  I really liked the lithium ion battery in my 850.  It lasted forever and wish they would have stuck with that.  The charger that comes with is a 16 hour charger so be sure to have extra AA's ready or get a 1 hour charger.  I would recommend this camera to anyone.UPDATE:I have had my camera for several months now and would like to add that I think the lag between pictures is a little long but not terrible.  I noticed this is selling on amazon for $699.  DO NOT PAY THAT MUCH FOR THIS CAMERA!!  I paid 399 on amazon in June.  If you are going to pay 699 for a camera take the plunge and spend a little more and buy an SLR!", "Date": "June 6, 2009"}, {"Title": "Excellent camera", "Author": "S. Ackman \"saa001\"", "ReviewID": "R3Q03Z6D2QN9XL", "Overall": "5.0", "Content": "I upgraded from several other digital cameras to this one. It is pretty much and all in one camera with wide angle to telephoto.This camera takes great photos with little effort on the users part. Automatic settings will get a lot of people by and for those who want more control, there are other modes they can use to help them.I took some photos of my neices soccer game and the zoom was great. It took stop action photos without a problem.The only very minor issue that I have had is sometimes the colors can be too saturated. I remember reading about a setting for this and I will change it.Over all an excellent camera that takes detailed photos with either wide angle or telephoto options.ADDED 12/16/2009I have used it all summer to take photos of my nieces soccer games. The pictures came out fantastic. The zoom really helped too. Colors were great even on high saturation (I changed some settings and now high saturation comes out great).The only things that I can complain about is that when you are doing a video recording, the camera will not zoom in or out.This is the camera I will be taking with me on my vacation. I have a digital SLR but I only use that for when I want to do something artistic, the rest of the time I use this camera and it provides me with 99% of what I need.", "Date": "May 28, 2009"}, {"Title": "Kodak EasyShare Z980", "Author": "D. Browning", "ReviewID": "R4K5AB0DUE1QS", "Overall": "5.0", "Content": "This camera is awesome. It takes great pictures inside and outside. When I am inside I put it on the low light setting and it takes a good picture. The zoom is great too. I can get a picture of my son on second and third base taken from the first base side and it looks like he's right there. The color turns out great and is very clear. The batteries last longer than other rechargeable ones that I have thrown away in the past. I would recommend this to anyone. My only complaint is the battery/card door. It feels very flimsy and I'm worried it will break easily.", "Date": "June 22, 2009"}, {"Title": "It's a GREAT camera!", "Author": "R. McKeever", "ReviewID": "R3QQ2H1VBA4HPW", "Overall": "5.0", "Content": "This is a camera that is SO easy to use and you get such great pictures!  I could not be more delighted with it and I get such great comments on my pictures from grandkids sports and dancing recitals to birds and butterflies in my garden.  You don't have to be a technical person to get rave reviews on your photos with this camera!", "Date": "June 20, 2009"}, {"Title": "Some important do's and don'ts", "Author": "happy camper", "ReviewID": "R1WDT6Q140H0Z3", "Overall": "5.0", "Content": "I bought the camera refurbished, used it with an 8 gb SD card for a few days, shooting videos and pics around the house to get used to it, then went on a 14 day cruise with stops in St Thomas, St. Marten, Curacao, and Costa Rica, passing though the panama canal.I got some spectacular shots and HD videos I would never have gotten with any camera I owned before. High ISO, the tremendous zoom range, image stabilization, HD Video, all work great.Before leaving, I was having trouble with poor battery life with the Kodak batterys that came in the box. They are 1800 maH. I bought 2400 mHa replacements at Walgreens and the weak battery problems went away. Keep one set in the camera, another in your pocket, and swap when the battery life is still 50% if you want trouble free video performance. (You can work all day, recharge at night.)I ordered a 32Gb class 10 micro SD card, after reading in the full manual (go to kodak web page, the manual that ships is dumbed down.) that up to 32 Gb and micro SD class 10 in an adapter could be used.With the Micro SD card, pictures seemed ok, but while taking a video, if I pressed the shutter release (easy to do accidentally, and ok per the manual), the message \"picture taken\" appeared in the viewfinder, and the camera froze. I waited for at least 3 minutes, then opened the battery case to kill power and \"reboot\". (This can corrupt the data on the card.) Sure enough, the 4th time it happened, the card would no longer read, possibly destroying the first 3 days of my trip!. I switched chips back to the old 8Gb non-micro SD chip, stopped taking videos, and had no more trouble.BTW- if you want to just shoot one photo after another quickly, the camera's default performance of showing the last picture taken for several seconds can be over-ridden by pushing down half way on the shutter. With Class 10 SD cards, the delay is tiny to be ready for the next shot.When I got home, I found that the pics on the corrupt card were all ok when I put the card in an adapter and I transfered all my \"lost\" pics and videos to my PC.I called Kodak Customer service, and they issued an under-warrantee repair order, but said that the micro SD cards in an adapter are known to cause this problem. I swapped the adapter to one that was \"known good\" (worked fine with another micro SD card in it) reformated the micro sd card and tried it again- same problem. meanwhile the 3 regualr sd cards I tried all worked fine.Bottom line, despite the info on the Kodak web page, don't try to use a micro SD card and adapter in the camera. Stick with full size SD cards, and get the fast class 10 for good shot to shot times.Last tip- when not ready to take a picture, leave the camera in Smart Capture mode, no zoom. (Even if it is not turned on). Shoot the first \"grab picture\" with those settings as an \"insurance shot\" (you can always crop later). It all takes very litte time. Then, quickly set the camera to the exact mode and zoom you want, and begin the \"real\" shoot. (You can be making these decisions while you grab that insurance shot). That way, you will always have \"something\", and it takes a very short time. I tend to use the P mode for routine shots or else the High ISO mode for dim or low light. I shot pictures in a cave with no flash and got noise free pictures that look like daylight using High ISO. Also, I think it may work best to not use any telephoto when changing to macro and super macro, since the focal length of telephoto is longer, and the camera may well not be able to focus close enough, giving up and not shooting, or shooting totally blurry pics. with macro and super macro, you leave telephoto like it is when you first tuen on the camera, and move the camera closer and back to fill the frame.", "Date": "February 11, 2012"}, {"Title": "Solid Camera", "Author": "db II", "ReviewID": "R3CXI6P2YSOQB7", "Overall": "4.0", "Content": "I bought this camera new in March of 2009. Since then it has been to 5 different countries and many trips and events within the US. The picture quality and clarity are amazing. I have 2 friends that are professionals, and they point to the Schneider-Kreuznach Variogon optical zoom lens as the key feature of the overall clarity you get from the camera. I have not had any luck with low light shots, which is disappointing. But I have had very impressive results during daylight even at full zoom. The camera has enough features to please the beginner through the amateur user. I found the batteries (Kodak) that came with the camera usually give me 200+ pictures on a full charge and the battery door that a lot of folks have complained about is a non-issue. I gave four stars just because of the noise issues I've had in lower lights and higher ISOs. Other than that, I'd buy another in a heartbeat if I needed to replace this one. The only other con is flickering issues when shooting movies...", "Date": "January 5, 2011"}, {"Title": "Lovin this camera", "Author": "K. Morgante \"Kat\"", "ReviewID": "RHR7C0QWO8KQ6", "Overall": "5.0", "Content": "I'm not a professional photographer but am leaning in that direction with my art/design items. The outdoor photos possible with this camera are fantastic. I most often use the smart capture setting or one of the many options in the scene setting all easy to navigate to. I've used flower, back light and stage often and came out with excellent photos. An in depth knowledge of the camera's inner workings or manual options is not required to generate notable photos.  One day I will pull out the directions to learn more about the manual options, but I'm not there yet. I have also found the action selection which allows multiple shots to be taken in sequence, to be a great feature which I've longed for in a digital, and though I do not think the results have been professional quality, I have some pretty good photos of varied sporting events. Indoor pictures I some times have to play with the selections a bit to get the right lighting effect (or turn on more lights in the location). The battery life concerned me based on the other reviews, however, after the 1st couple charges I have found if I let the camera charge the est. 14 hrs recommended and let the battery drain almost completely/or completely before the next charge, I have hours of usage and really no issue. Now, opening up the usb port section is tricky but also easy once u get use to it. Downfall to this camera is the lense cap. I can't get the thing to stay on well.", "Date": "October 5, 2009"}, {"Title": "Best Camera I have ever owned.  12 MP Digital Camera with 24X zoom!!  What's not to like!!", "Author": "Dubbie \"Tom\"", "ReviewID": "R25LVM581GBJIB", "Overall": "5.0", "Content": "Very nice camera - excellent zoom capabilities, nice color photos, integrates beautifully with my Mac Pro computer.  This camera gives tons of options for many photo opportunities.  Flash automatically activates when needed unless set otherwise.  Lens cover pops off automatically when you turn the camera on!Highly recommend this Kodak product (as I highly recommend Kodak's ESP 9 All-in-One printer)!!My camera was ordered through amazon.com but was purchased via \"Beach Camera.\"  Quality and speed of service was excellent from Beach Camera.  I was very pleased and would order via them again anytime.Hints -  The camera comes with quality rechargeable batteries and I will use them too - but I have found Duracell's Ultra \"Powerpix\" photo-camera batteries to be most convenient and dependably long lasting!  I got a 4 GB memory card for storage on camera - excellent for HD videos and more than a few photos. The higher the MP of the camera - the larger storage card needed.12 MP Digital Camera with 24X zoom!!  What's not to like!!", "Date": "September 6, 2009"}, {"Title": "Great Camera", "Author": "Diane Burch", "ReviewID": "R25WEEH4SI1K7H", "Overall": "5.0", "Content": "I love this camera, I tried cheaper cameras that similar options.  This ones software is alot easier to use.  I have taken some great pics of the kids with this one.  I love that it takes the pic quickly cause with moving targets it allows you to still get a good pic.  It does take a few seconds to be ready to take another pic, but all in all it is a great camera for this price range.", "Date": "July 9, 2009"}, {"Title": "Z980 review", "Author": "L. Forbes", "ReviewID": "R1PYFKH3KNFZ9", "Overall": "4.0", "Content": "This cam fits my needs almost perfectly for pursuing nature photography.  It would have been perfect if the lens could accept filters.  The lens is sharp throughout the zoom range.  There are enough selections to satisfy the point and shooter to the more advanced user and I find the picture quality to quite good when viewed at normal viewing sizes.", "Date": "June 28, 2009"}, {"Title": "This camera  has been great", "Author": "Tw Emrey", "ReviewID": "RCRQHEFB0AITJ", "Overall": "5.0", "Content": "I have been very impressed with it in the 2 months I've had it. We agonized over whether to get this or a DSLR for our vacation pictures and  went with this because of the cost and the compactness of it by comparison.  The video is quite serviceable. I agree with the comment about the lack of cabling to the TV. Hopefully Kodak rectifies that soon. It seems pretty durable: it has already suffered some abuse and has come through no worse for it.  For the price with all the features, it's a real gem as far as I'm concerned.", "Date": "June 28, 2009"}, {"Title": "Excellent at the basics", "Author": "Ciaran Harrison", "ReviewID": "R3RSPBGOZVSUG4", "Overall": "4.0", "Content": "I haven't had a chance to play with the advanced settings but for basic shots the quality is excellent. I took pictures of players 100m (300ft) away from me at a match and they were very good (albeit in good light).The image stabilisation works a treat, my one negative comment so far is that sometimes it takes time to get ready to take a picture after coming on or after immediately taking one beforehand, but that could be me doing something wrong. I have to RTFM and play with it yet.", "Date": "May 13, 2009"}, {"Title": "OK but you can do better...", "Author": "Roberto Vicente \"bodhiu\"", "ReviewID": "R3J3GFYTZADEH9", "Overall": "3.0", "Content": "Just wanted to see how the camera was and bought a used one at Ebay.  Prices have dropped considerably.The true reason I won't keep this camera is that there is too much noise even when shooting in RAW.  The pictures appear sharp and descent but any enlargement shows the problem of fuzz.  Poor sensor...but all the super zooms have the same problem.Kodak did a nice job of simplifying the many features for the average consumer but after many digital slrs, this is a clear set backwards.I highly recommend the Panasonic G series micro dslrs.  Prices are dropped so get in 'cause the photos are super, including kit lens.", "Date": "January 1, 2011"}, {"Title": "Kodak Z980", "Author": "Robert Bringhurst", "ReviewID": "RTDSIMBPN5RXB", "Overall": "3.0", "Content": "Camera shipment was a little slower than expected but still within the promised time Amazon stated. Package was clearly marked KODAK REFURBISHED, but everything was there. Camera functioned properly right out of the box. As others have stated manual is a startup guide only and not the best. Hopefully Kodak will add to the on-line extended manual as it does not add much more detail. Pictures I took are fabulous. No complaints on picture quality. Zoom is too fast but maybe over time I will acclimate to it. One very disappointing issue is the external flash. I have an old Sunpack flash that I attached to the hotshoe. Camera fired flash with no problem, but it fired the on-camera flash regardless of setting in the menu option. Seems like a terrible waste of battery power. I am hoping this can be solved with a software upgrade and is not a permanent issue.Camera is large with an impressive look. I had no issue with the battery compartment latch as others mentioned. I like the attachment that is provided for portrait picture use. It makes the feel of the camera so much better than without. However due to the location of the memory it must be removed to allow access to the battery / memory compartment. I would have preferred the memory slot have been relocated to allow for removal without having to remove this item.Overall NICE camera. Can't wait to get out and take some interesting pictures with it. Next stop French Quarter in New Orleans....", "Date": "November 3, 2010"}, {"Title": "Forget the SLRs, but do you need a huge zoom?", "Author": "John E. Vidale \"conventional Earth scientist\"", "ReviewID": "R1T4KCJUAT6O91", "Overall": "4.0", "Content": "I bought this after getting my daughter the 10X zoom Z915, and desiring something bigger, zoomier, and more expensive to stay king of the castle.  My daughter now leaves her camera at school and uses this one to do her assignments around town.The 24X zoom performs as promised, and the functionality is simple to operate.  I guess the real question is whether one needs such a zoom, which then requires a tripod in all but the brightest light for sharp pictures at full zoom.  The wide lens lets in a lot of light, helping some.The fixed LCD on the back remains exposed and thus also needs a case more than the reversing LCDs on some other cameras.  The constantly adjusting focus, if one uses that setting, is kind of busy and distracting, although it performs well.Overall, the camera is a good compromise between a ton of features and a 600+ mm lens, a moderate price, and the added work to haul around and use compared to a simpler, lighter, and smaller point-and-shoot camera with less zoom.  I can't imagine why anyone but a pro would get an SLR with interchangeable lens anymore - cameras like this are so much more convenient and plenty capable.The bottom line is that this camera is easy to carry in one hand, starts quickly.  It zooms, focuses and shoots fast, and the pictures look great, especially when my daughter takes them.  In the end, although I usually only use a zoom of 10 to 15, it's good to have the ability to zoom further to select the right parameters.  My daughter, the more demanding of us, says the photos from this camera are sharper and just bettter than her Z915, so in the end I'm quite happy with this camera.", "Date": "February 24, 2010"}, {"Title": "Kodak forgot a couple of issues.", "Author": "Downeasta", "ReviewID": "R39WN30UFC0B0L", "Overall": "4.0", "Content": "I bought the camera for picture quality and lens quality and was not disappointed. However Kodak simply forgot a couple of important issues. Why on earth did they not allow the batteries to be recharged while installed in the camera? The feature of my old simple Easy-Share camera which recharges and can be downloaded when placed on its stand is totally missing. The batteries must be removed and placed in a charger that, for some reason, has destroyed two batteries so far. To make matters worse, the batteries can not even be charged in the camera using a wall-wart (power supply) or the USB cable. My second complaint is that in video mode, while quality is high, the format used is .mov, the Apple QuickTime format rather than one of the many formats that can be played by Windows Media Player. Therefore, before editing in a Windows PC the format has to be converted using commercial software. Last, I am a person who likes the option to control a camera using manual settings. This camera has these capabilities, but the use of them is very poorly documented.To sum it up, I give the picture and zoom lens a five star rating but am disgusted with the inconvenience of replacing spent batteries and the poor documentation.", "Date": "February 23, 2010"}, {"Title": "Kodak? this is a better camera than you would expect!", "Author": "N. Pisani", "ReviewID": "R1JBANSZUOWRBG", "Overall": "4.0", "Content": "First I must say, I am a retired professional. I worked only with negatives. That said, enter the digital world, what do you get in today's digital cameras? -everything including the \"kitchen sink\".  At 65+ I have found the digital cameras very confusing with their multi-function buttons.  The Z980 does not have too many functions. This kodak has an excellent lens! Even though many camera reviewers found this camera to be very large, I am comfortable with the size of the Z980. Three things stand out for me. First the most important, the lens, is a Schneider-Kreuznach.  This lens use to be made in Germany, now I don't know. The picture quality however is worthy of the name.  Second is the fact that the camera has image stabilization, which aids getting a sharp picture even if you are not as steady as you once were. Third, I really like the added grip for composing \"vertical\" photo's. Yes it adds size to the camera, buy being able to compose a vertical photo as to seeing the image properly, having a second shutter release designed just for vertical shots is wonderful. I did not rate the battery life as I have not had the camera long enough. And service, have not needed any. I test every new camera purchase in the first days of ownership so I know wether, I want to keep it. I take a few shots and make an 11x14 print in this case a close-up of a blooming rose. Result: color-GREAT, and picture quality sharp as a tack.", "Date": "January 21, 2010"}, {"Title": "Kodak EasyShare Z980", "Author": "Mara L. Price", "ReviewID": "R2X397O2AFCDNS", "Overall": "3.0", "Content": "The pictures are great.  The camera is fairly easy to operate and there are of a lot of options. The only problem I have with the camera are the batteries.  They do not stay charged very log and they tend to fall out of the battery compartment easily.  Other than that, I really like the camera.", "Date": "September 3, 2009"}, {"Title": "Love love love this camera!", "Author": "Squeeble's Companion", "ReviewID": "R3N9X45JXOLJIR", "Overall": "5.0", "Content": "Owned approximately 2 weeks.This Z980 is so much fun ... It has many settings, manual, auto, etc..... If I take a picture that is grainy, blury, or the lighting isn't quite right, I change the setting and it comes out crystal clear.  I've taken moon shots, distance shots, micro close-ups, action shots, portraits ... and am really impressed with the quality of the pictures for the cost of the camera.  The 24x optical zoom is great.My old camera was a digital point and click. It is going to take me awhile to get used to all that this Z980 can do, but I've already learned a lot by trial and error.  If you are looking for a camera that is more than point & shoot, but don't want to deal with lenses of the SLRs, this camera is perfect! ... and easy!Happy picture taking!", "Date": "August 6, 2009"}, {"Title": "Best Digital Camera Made Today!!!", "Author": "J. Ryun \"A Happy Customer\"", "ReviewID": "RXXN9672ZK39X", "Overall": "5.0", "Content": "We just went to the beach for a little trip & took this camera along to give it a test drive... and WOW... did it ever give us a ride!!! The Zoom on this is SOOOOO spectacular & the best digital camera I have EVER used... Huge screen, excellent night photo's & such an easy camera to use...Others have complained about the battery door... I VERY secure and then on top of that is a screw on base that makes it IMPOSSIBLE for the door to move let alone open...We got a 16gig card for this bad boy and let her rip... The 12 mega pixel photos that this took were simply amazing... Actually if you turn the shutter to a slower speed and use a tripod, so not to move, you can actually step the photo's up to almost 14 mega pixels!!!There is really only 1 thing that I would improve upon for this entire camera and that is to have a screen proctor for it... but then again I just forgot to order it when I ordered the camera so now I got to do so =)There are so many features to this machine I do not have the time or patience to go over them all but let me tell you this camera is a very intelligent machine, auto picture stitching for panoramic photos, auto red eye removal, auto focus (you can focus yourself because some times if focus on something close when you are trying to get a picture of something far away) and the smart feature is awesome... my wife picked it up and used it like a pro!!!If you are thinking of getting a nice Digital camera this is it!!! the only thing I would say it to get a nice camera bag to protect it and a screen protector... I am also going to get another set of batteries with a car charger for those \"just in case\" moments...I am seriously thinking I might just get the accessories package with the optional BIG flash (the camera does have one), car charger, extra batteries and screen protector then it will be perfect!!!", "Date": "August 6, 2009"}, {"Title": "Takes great pictures!", "Author": "P. Hinnen", "ReviewID": "R3PHLUVU9Z6LHW", "Overall": "5.0", "Content": "I have had this camera a month now and love it.  The zoom is fantastic.  It takes great pictures.  My 10 year-old took it out and took close-ups of my flowers outside and took fabulous pictures.  Batteries lasted a long time if you charge them before you use them (even though they are pre-charged).  The only negative things were that the battery compartment is hard to close and you have to be in one of the other settings than smart capture or scene to use the focus button (which the manual does not tell you).I have had several Kodak cameras over the years. All have been good cameras. This one is really the best I've had.", "Date": "June 6, 2009"}, {"Title": "Good Camera", "Author": "Joey Mercier", "ReviewID": "R1E3C2U3HQSAZ4", "Overall": "4.0", "Content": "Had a few issues with the camera freezing when we first received this. After a couple of emails back and forth the seller offered a refund. Before returning it I tried a different memory card and the freezing issue seemed to go away. Otherwise takes great pictures and has a good zoom. We didn't receive the vertical grip with ours though.", "Date": "December 30, 2013"}, {"Title": "perfect camera", "Author": "wally", "ReviewID": "R232AEAOJD26BJ", "Overall": "5.0", "Content": "great camera for a great price very easy to use plus it gives you great pictures you can trust the Kodak name", "Date": "November 27, 2013"}, {"Title": "Excellent Camera for the money !", "Author": "Bill Hughes", "ReviewID": "R1ZB29RO0OC37S", "Overall": "5.0", "Content": "I have received so many compliments on the photos I have taken with the Z980. It is amazing for taking photos of the moon ! Everyone says it looks like I'm in orbit around the Moon because they can see the crater depth .", "Date": "September 2, 2013"}, {"Title": "Well Pleased !!!!!!!!!!!!!", "Author": "Anthony W. Smith", "ReviewID": "R3LX4G7HZVOFR8", "Overall": "5.0", "Content": "The wife and I took our new camera on vacation and didn't know anything about it, we just got the camera a day before we went.We were amazed how clear the pictureswere.WOW!...Amazon thank you for the quick service.AWS", "Date": "August 1, 2009"}, {"Title": "Poor After-Sales Service", "Author": "Ian", "ReviewID": "R1TWUXOV2PBO4T", "Overall": "1.0", "Content": "I have had this camera for just over 2 years, having had the previous model for 3 years.The camera met all my expectations - a very good bridging camera that met all my needs and produced very good results.However, within a few weeks of the Warranty expiring the camera no longer worked .. what next?Simple - ask Kodak to repair it! Not so simple .... an offer was made to replace it (at a cost). Sounded like a reasonable offer, however the replacement received was in a very poor condition with a very badly scratched/marked TFT monitor. My own, although well-used, was in almost pristine condition so I was angered that I was informed I MUST, on receipt of the replacement, send MINE or I would be billed for the replacement camera!Strangely they are unable to repair the camera as they NO LONGER HAVE SPARE PARTS!!!More phone calls and they offered a percentage deal on a new camera. Tempting but another ploy to 'hook' the customer into staying with Kodak and buying another product that they probably will be UNABLE TO REPAIR in a couple of years! The old question arises ..'are goods manufactured to deliberately cause problems after the warranty expires?'Irrespective of the rights and conditions they claim they have (and that I have, as a Customer agreed to) I find it unbelievable that Kodak are unable to repair a 'quality' camera that is little over 2 years old. As customers we are being hooked, drawn-in and then thrown away. Such 'offers' from Kodak may be legal but I believe that the response given should be challenged ('product should last for the time you would expect it to and be free of any defects').", "Date": "December 8, 2011"}, {"Title": "Very good, but a little slow", "Author": "A. Girelli \"AZG\"", "ReviewID": "R2X5MTTBISLXOK", "Overall": "4.0", "Content": "Very good camera with excellent quality of image and colors!!But I think that her time of processing is very slow.", "Date": "August 14, 2009"}, {"Title": "i give a 4 star because of some pictures but", "Author": "Mar \"Marinera\"", "ReviewID": "R30VUFSXNWW85Q", "Overall": "4.0", "Content": "This camera haves a lot of issues.its bulkyit feels cheap very cheap !lots of times the flash never shoots !lots of blurry pics.battery does not last very long.but when the pics come out nice. its amazing , very lovely clear sharp pictures. lovely color i think if it not have the issues above it will be perfect camera.also its 2 expensive for a cheap feeling camera like this.", "Date": "September 13, 2010"}, {"Title": "Great Camera", "Author": "Raymond A. Stirling \"mac man\"", "ReviewID": "R1Q37ZFSGHMFL1", "Overall": "5.0", "Content": "The Z980 does everything as advertised. It can be used fully automatic, fully manual or anywhere in between . It is easy to setup and very easy to use.The picture quality is superb. The only negative is the battery charger and batteries included. For the price Kodak should have included better.", "Date": "March 22, 2010"}, {"Title": "Kodak easyshare z980", "Author": "David Santillan \"D&G;\"", "ReviewID": "R1MDWFQ7OTTA08", "Overall": "5.0", "Content": "this camera is the best perchase i've made when it comes to digital cameras. great pictures and easy to use. the optical zoom is amazing. i knew i had a great camera when one of my friends told me that i took great pictures. all that was done is point and shoot. this will be my digital camera i will use for the holidays.", "Date": "March 10, 2010"}, {"Title": "Great Camera!!!", "Author": "Shawn Davis", "ReviewID": "R30JPHAB9297AS", "Overall": "5.0", "Content": "This camera is spectacular! It has great features and you don't come across many cameras with a 24X zoom off of a built in lens and it is 12MP too! This camera was discontinued by Kodak and replaced by the Z950 I believe which is not even close.  If you happen to come across one of these buy it quickly.  Getting more and more difficult to find.", "Date": "December 16, 2009"}, {"Title": "Kodak z980", "Author": "Brian K. Bannister", "ReviewID": "R1YEIC56B7VAPC", "Overall": "5.0", "Content": "The camera is fantastic however the battery charger doe's not fit  Australian power plugs hence it is useless and I cannot charge the batteries so the camera is useless  and I have sent several e:mails to to beach camera's to try and  resolve this problem with  NO success and I'am far from happy. If you wish to sell products to Australia I suggest you fix this problemNOT  HAPPYBrian", "Date": "September 16, 2009"}, {"Title": "Great Camera", "Author": "Tom T", "ReviewID": "R1XLAMJY1TSL7I", "Overall": "5.0", "Content": "I bought this camera for two reasons, good old Kodak qaulity and all the good reviews it receives. I would recomend this camera any time! what a package for the price in comparison to other models and features. It truly is a great camera! I would highly recomend the purchase of the zoom flash for picture perfect indoor shots also!!", "Date": "September 13, 2009"}, {"Title": "Disappointed.", "Author": "William Brennan \"wreckingball34\"", "ReviewID": "R21Q0JV9OYK9MO", "Overall": "2.0", "Content": "I didn't purchase this camera through Amazon, but Kodak doesn't let you review their products so here goes. I have to say that the Kodak Easyshare Z980 was a very big disappointment to me. I was psyched to get my camera so soon after I pre-ordered it, but was shocked to find that the LCD screen was damaged internally. You could only see half of the image. The camera also seemed very cheaply made to me. Some people may like the fact that it was so light, but I would have been afraid to drop it even once. I've dropped my Z712 IS a few times, without any ill effects. Another disappointment was that there was no digital zoom in auto mode. Most people who buy this camera will want to use auto mode, so that was a letdown as well. Also, the SD card slot is INSIDE the battery compartment. What on earth were they thinking? The battery cover is very flimsy and the thought of having to open it every time I wanted to get at the SD card gave me a headache. The Z712 has a separate slot for the SD card. So much simpler. Kodak needs to go back to the drawing board on this one. I gave it 2 stars only because Kodak promptly refunded my money, no questions asked.", "Date": "April 16, 2009"}, {"Title": "I am a long time Kodak Easyshare loyal customer", "Author": "Reviewer In Arizona", "ReviewID": "R4C06YCRL9HS3", "Overall": "1.0", "Content": "but after having a few too many in the past couple years go bad...I do not recommed their easyshare line long term. I invested in lens & all kinds of accessories because when it does work; it is a great camera & gets 5 stars but I have a tempermental turn on/off one, another that the on/off button stopped working & another that takes poor images/blurry brand new out of the box. Thumbs Down long term for this line.", "Date": "January 25, 2011"}, {"Title": "Great picture taking", "Author": "Terry C. Hanauer", "ReviewID": "R2IQRNU7JP892", "Overall": "5.0", "Content": "I got the camera just days before my trip and was nervous about having a new camera.  However, it was incredibly easy to use and the 24x optical zoom was absolutely amazing. The large LCD along with the electronic viewfinder was very nice. The processing time is a little slow but overall it's a great camera.", "Date": "November 27, 2009"}, {"Title": "super camera", "Author": "Mark S. Jones", "ReviewID": "RP7VO2A2D1OG", "Overall": "5.0", "Content": "This camera has many features but is very easy to use. Would recomend it to anyone.", "Date": "February 2, 2010"}, {"Title": "poor customer service", "Author": "Jascentea", "ReviewID": "R2POGYWCJ081NO", "Overall": "1.0", "Content": "I have purchased this Kodak Easyshare z980 comera August 2009. I used it once in Sept. after that during the Christmas 2009, I found that camera took long time (10-15sec) process a picture before you can take another one. I thought that was setting problem, finally in June 2010 I called their tech support, the guys gave me a case#  and asked me call back when I have a camera on hands. I didn't follow up till recently, I called them, they determined that is problem with camera, but warranty is out, I have to pay for the repair even they knew the problem happened during the warranty period.The customer service was very bad, people has very limit knowladge of the camera, but they are very strick on their warranty policy, they told me that the best they can do is that I can buy another Kodak product on line for 25% off..I understand that all electronic products could have problem, but none of them has such a poor service as Kodak has,DO NOT BUY KODAK CAMERA...", "Date": "March 29, 2011"}, {"Title": "Very disappointed!!", "Author": "Kristy", "ReviewID": "R28FU5JQ1J7RX5", "Overall": "1.0", "Content": "So disappointed!  I have only ever owned Kodak cameras and I am an amateur but like professional quality photos for scrapbooking.  I love my Kodak P712 but it has been acting weird lately so I decided to try the new release - Z980.  I liked the fact that I would be able to continue to use my P20 flash with it.  UGH!  I waited weeks and finally got it.  First of all, I noticed immediately that the plastic casing and lens cap are flimsy and feel cheap, and the strap is thin and disappointing.  Remember, I'm coming from the P712, which I know is a different series but was the same price I paid for this one.  Second, I do not like that the memory card slot is inside the battery compartment.  The battery door is not easy to keep closed and this is a battle every time I want to put the card into my computer to download pics.  I know I can use the USB cable to download pics but it takes longer.  Third, I can't charge it on a dock like all my other cameras.  Fourth, and most important, the flash is way too bright.  I tested the camera over Easter and was very disappointed with my pictures, which I know would have been great with my P712.  So, easy decision for me, I will be returning this camera.  Now, I just don't know whether to fix my P712(of which I have new appreciation for) or start looking outside Kodak.  Not too impressed with the Smart Capture feature either.  I felt like I was fighting with the camera to focus on people and not objects.  Finally, the time b/w pressing the shutter button and the pic/flash being taken was too long and the subject moved.  P712 doesn't have this lag time.  Why oh why did Kodak discontinue the P series????? UGH!", "Date": "April 13, 2009"}, {"Title": "No way !", "Author": "JG2323", "ReviewID": "R1WO4MEQXO9BQ", "Overall": "3.0", "Content": "I just bought the Canon SX10iS and was very upset to see that Kodak just came out with an apparently superior camera for the same money.  I was going to return the Canon and buy the Kodak until I learned that this camera doesn't have an optical viewfinder.  The Canon has a very good optical viewfinder, and an articulated LCD screen that you can easily adjust to take photos over people's heads in a crowd, or low down by the ground without having to get on your stomach.  So I'll give up the extra 4x zoom, and keep the Canon.  I actually find it easier to use the optical viewfinder in most situations, except the few that make the articulated LCD screen worth its weight in gold.", "Date": "June 24, 2009"}, {"Title": "Chinese made", "Author": "M. Adnan", "ReviewID": "R332BJ5LY2O2DI", "Overall": "3.0", "Content": "Nikon P90, Kodak Z980 and Pentax X70 is made by the same Chinese company. Sold under different brands, all three cameras are almost identical (with minor differences, like Kodak has hot shoe, etc). If you want to buy this, buy the one that you can find cheapest. In general, Canon SX10 is better.", "Date": "June 12, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "12-megapixel resolution for stunning prints up to 30 x 40 inches\n24x wide-angle Schneider-Kreuznach Variogon optical zoom lens (26-624mm)\nCapture beautiful HD pictures in 16:9 format; capture HD-quality video\n3.0-inch LCD screen; Smart Capture feature\nCapture images to SD/SDHC memory cards (not included)", "Name": "Kodak EasyShare Z980 12MP Digital Camera with 24x Optical Image Stabilized Zoom and 3.0 inch LCD", "ImgURL": "http://ecx.images-amazon.com/images/I/417R4KFx9lL._SY300_.jpg", "ProductID": "B001OC7IXU"}}