{"Reviews": [{"Title": "Photo quality doesn't measure up to the reviews", "Author": "B Howell", "ReviewID": "R7HIRYRL3XYBR", "Overall": "3.0", "Content": "I bought this camera because the reviews I'd seen were very positive, especially around the issue of photo quality (my foremost criterion), and it had a couple features I wanted: 12mp, 5x zoom (wish it had some telephoto effect, though).What a disappointment, then, that no matter what the shot -- close or far away, flash or not, camera auto mode or not -- the focus was quite soft. Perhaps sharp enough for some folks, but not for me. Also, when using flash, the delay between pressing the button and the flash/snap is way too long. And my wife didn't like the lack of an optical viewfinder, although if the photo quality had been what we had expected, I think she would have adapted.All in all, not a winner for us, and I'm grateful for Amazon's return policy -- I sent it back.", "Date": "October 21, 2009"}, {"Title": "Great Camera!", "Author": "Rebecca Georgevitch \"anonymous in IL\"", "ReviewID": "RNIEOO4DD3F61", "Overall": "4.0", "Content": "I began using this about 10 days ago and I love it!  I purchased the Canon 780 but decided to return it - I prefer a 5x optical vs a 3x optical.  The canon is all plastic.  The picture quality is about equal.  Still learning how to use it but it's not that difficult.", "Date": "December 9, 2009"}, {"Title": "Second best gift I gave!!", "Author": "Darren Thornton", "ReviewID": "R1DXS7F8QHMNZ", "Overall": "5.0", "Content": "This past summer my girlfriend and I went canoeing in New Hamshire. She wanted to bring her camera so we purchased a \"dry\" bag. Just so you know, the \"dry\" bag didn't work. Needless to say she needed a new camera. This was the exact camera even down to the color that got soaked. She was so exceited to be back up and running with the camera she loved. The pictures are fantastic, the video is crisp and everything about it is easy to use. The purchase and delivery were flawless. We are both 100% satisfied.", "Date": "January 10, 2011"}, {"Title": "Panasonic makes a great camera", "Author": "The IA \"Phantom\"", "ReviewID": "R10Y3HVVT47LYR", "Overall": "4.0", "Content": "Got this for my daughter's birthday. It's a great medium price range camera.I have a Panasonic Lumix DMC-FZ28 which takes fantastic photos, there is a difference between a camera that takes pictures and one that takes photographs, and Panasonic excells here.", "Date": "March 13, 2010"}, {"Title": "Panasonic LumixDMC-FS25", "Author": "Dan Carrick", "ReviewID": "RQ5LGLQRE5C5V", "Overall": "4.0", "Content": "Pleasantly surprised by overall quality, features and performance.You have to consider Panasonic (based on my experience) right up there with Canon and Nikon when it comes to digital cameras.And you seem to get more for your money with Panasonic.I also have a Panasonic blu-ray player(BDMP-35K) which I think is a great product too (so far).Would highly recommend the Panasonic line and in particular this camera.", "Date": "February 1, 2010"}, {"Title": "Movie mode a problem.  Occasional soft focus.", "Author": "Amazon Customer", "ReviewID": "RVZIU2VG6Q8IL", "Overall": "3.0", "Content": "This camera takes clear and beautiful movies but they are in .MOV format.  I cannot edit them in Windows Movie Maker for Vista without using a third party converter to change them to .AVI .  At times, focus is soft.", "Date": "December 8, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "12.1-megapixel resolution captures enough detail for poster-size prints\n5x MEGA optical image-stabilized zoom; 29mm wide-angle Leica DC Vario-Elmar lens\nIntelligent Auto (iA) mode; Face Detection\n3.0-inch LCD screen\nCapture images to SD/SDHC memory cards (not included)", "Name": "Panasonic Lumix DMC-FS25 12MP Digital Camera with 5x MEGA Optical Image Stabilized Zoom and 3 inch LCD (Gold)", "ImgURL": "http://ecx.images-amazon.com/images/I/4175VKC8NjL._SX300_.jpg", "ProductID": "B001QFZM7Y"}}