{"Reviews": [{"Title": "Great camera", "Author": "The Mad Moleman", "ReviewID": "R26H3O47GRC9A0", "Overall": "5.0", "Content": "This camera replaces a Sony cybershot that I bought five years ago.  The technology has advanced significantly since then.  The biggest advance has been in the algorithms for processing the images (correcting for lighting, vibrations, and scene selection).  I bought this camera right before a trip to Europe, and am overwhelmed with the high quality of the images (great colors).  The camera and the charger are also both nice and compact.  In general this is an excellent point and shoot camera that works wonderfully under most situations using the automatic mode.  The only problem with these newer cybershots is that they lack a manual mode which is nice to have for more advanced users when taking difficult shots.  Setting up the fill-in flash is a little non-intuitive.  This option used to be under the \"flash\" button (auto/none/fill-in) but no longer exists there.  Now you just need to select the twilight portrait mode.  (This is usually not selected by auto-mode in dark situations).  Otherwise, it is a great camera for the general user.", "Date": "May 31, 2009"}, {"Title": "Complicated but very capable", "Author": "Randall Roberts", "ReviewID": "R3HKYPIEFCF2SU", "Overall": "4.0", "Content": "This camera has lots of features and can do just about anything a camera needs to do.  It's actually more complicated that I was looking for.  The auto adjustment feature takes blurry pictures sometimes so you have to find the right setting for some pictures.  I would highly recommend this camera for people who don't mind adjusting the camera settings for each shot.  For someone with a kid, it's probably not the best because by the time you get the camera setup, your kids off doing something else.", "Date": "August 11, 2009"}, {"Title": "Full of tech", "Author": "Diosi Dume \"DJDL\"", "ReviewID": "R1X37IRAN0X35F", "Overall": "5.0", "Content": "this camera is loaded with the cool Sony new features that you usually see on higher models like the DSC-W290. It offers a lot for the price!. I'm very happy with it and the quality of the photos, specially those i get on dark places thanks to the high ISO.on bad points i only complain on the battery charge time (3-5 hours)", "Date": "August 27, 2009"}, {"Title": "GREAT Camera, although It may not worth it.", "Author": "Filipe Oliveira \"Thrill seeker\"", "ReviewID": "RRH312NYH0Y4T", "Overall": "3.0", "Content": "Ok, this is a great camera, with good picture quality, slim body and decent menus.I'm just kinda disappointed because i've had a Sony W130 and the new one doesn't add much up to the package.Except for a couple new Scene modes (food and underwater, features that usually most people won't EVER use), a Spot focus mode and the 12.1 MPxels, it's quite the same, and i'm sure you could get a W180 for almost [...] bucks less.", "Date": "January 29, 2010"}, {"Title": "great camer for the price", "Author": "M. Meeks", "ReviewID": "RETZMQH113Q2R", "Overall": "5.0", "Content": "i spent days researching the internet for a new camera. this is the one i purchased and i'm glad i did. the pictures are beautiful and the features are great. i love the face recognition and the smile detection. it is great for capturing pictures of small children. i still haven't figured out all the features though, but it has easy functions that do all the focusing for you. also, the screen on the back is wonderful. the only thing i would say is that i agree with the people who say it's not much to hold on to. overall, this is an awesome camera for a super price!", "Date": "June 15, 2009"}, {"Title": "SONY CYBERSHOT", "Author": "Hayah M. Kassis \"Hayah\"", "ReviewID": "R1YEQGDQUP03FT", "Overall": "4.0", "Content": "I chose to buy the Sony Cybershot DSC-W220 because my previous camera was a Sony Cybershot that I had for about 5 years. It broke when I carelessly dropped it from a high platform. There was no question that I would rebuy a similar model from Sony. Key to a new product are easy to follow directions and a user-friendly apparatus which is exactly this. Admittedly, I'm still getting to know some mechanisms, but the more I learn the \"cooler\" I think it is. I have confidence in my digital prints and the 12 MP contributes to this.", "Date": "November 17, 2009"}, {"Title": "I love this camera!", "Author": "Clare", "ReviewID": "R1UPUIYOQ2XYUD", "Overall": "5.0", "Content": "My previous digital camera was a Sony Cybershot.  I checked out several brands on Amazon, and in stores, before deciding that the DSC-W220 was the one.  I liked my previous camera a lot, but the plastic on/off switch failed, and it became useless.  My new camera has a metal switch, which is easy to use.  Other improvements are the rechargeable battery, shutter speed, better pictures (and the old one made beautiful pictures).  I also liked the price, the fact the description included \"what's in the box\",and the speedy delivery.  Since the memory stick (from a different vendor) took a long time to arrive, it was a plus that my old memory stick worked in the new Sony, and I could use this to investigate the new features.", "Date": "November 12, 2009"}, {"Title": "Almost perfect", "Author": "twillpants", "ReviewID": "R10VD9ZR34UJ2H", "Overall": "4.0", "Content": "My girlfriend got the W220 for Christmas 2009 so we've both been using it fairly heavily for about seven months now. I like everything about this camera except for one big thing (to me): It doesn't do well in high-contrast situations.This camera will either wash out (overexpose) the sunny spots or blacken the shaded areas, depending on what you're focusing on. I've taken a lot of pictures where the shadowed subjects (usually trees) in the foreground are too dark compared with the sunny background (usually mountains), or the foreground is normal and the background is washed out. This occurs even when using the Landscape setting. I have yet to take a good, balanced picture in these conditions with this camera, though I MAY JUST NEED TO READ THE MANUAL TO SOLVE THIS PROBLEM. [my emphasis] :)This may not be a problem to many users, but if you're planning on using this camera in nature, be prepared for some ghastly shots during the times when the contrast between light and shadow is at its greatest. This was such a deal-breaker to me that when it came time to buy my own camera I passed up the W220 because of this shortcoming.I would love to be shown that I am wrong. Has anyone else overcome this issue?", "Date": "July 12, 2010"}, {"Title": "Great Camera - great great great", "Author": "S. Hathawy \"Shirl\"", "ReviewID": "RKITK889DCVU4", "Overall": "5.0", "Content": "WOW - I bought two of these, one for a friend and one for my mom.  They both loved them.  They loved them.The first thing I loved about this camera was the fact that if you have \"older\" eyes and you can't see the small little buttons, it doesn't matter when you turn the camera on, the button show up on the screen. Tells you what they do and it couldn't be simpler.  The camera has all the automatic modes and all the simple modes.  You could make taking a picture as difficult as you want or as simple as you want.I love the smile recognition feature - camera doesn't take a pix until it sees the smile.  You can set up priorities as to whether you want children in focus or the adults.It even has a fast feature for low light situations (iso 3200)This camera is nice. You can take it anywhere cause it doesn't use much room.When you buy the camera definitely get a carrying container to protect it and a film protector for the lcd screen.", "Date": "December 28, 2009"}, {"Title": "A great camera", "Author": "Karina R. Gomez", "ReviewID": "R1VSFTRIPHUTQV", "Overall": "5.0", "Content": "I love my camera. It's easy to use and takes great pictures.  I've had it for 4 years and it still works great.  I bought a second battery for it since I use it so often.", "Date": "July 29, 2013"}, {"Title": "Its broke", "Author": "mark anderson", "ReviewID": "R6LQ3JN3JZH55", "Overall": "1.0", "Content": "This camera lasted a week before it quit working! Unfortuniatly I was oversees when it quit and it was a year before I came back into the states and could turn it in on warrenty! I still feel Sony or at least Amazon should take it back or in the least, repair it! I therefor limit my purchases from Amazon because of this!!!!", "Date": "July 18, 2013"}, {"Title": "Happy with camera", "Author": "W. Wolfe \"Trinity\"", "ReviewID": "R14VSL0QXXAQP3", "Overall": "5.0", "Content": "I picked this out as a gift from my spouse. I have been very happy with this camera. It is easy to upload picture using the USB cable. The battery holds its charge very well.", "Date": "January 22, 2013"}, {"Title": "Yeh!  Just like my old one.", "Author": "Judy Welliever", "ReviewID": "RJ1XIJWKQV0PT", "Overall": "5.0", "Content": "I wanted a phone like the one I damaged with water.  Didn't want to learn how to operate a new camera.My old one was a Christmas gift, so wanted to replace it with the same.Price exceptional, works great, am very pleased with product and my experience purchasing it on Amazon.", "Date": "November 24, 2012"}, {"Title": "Sony Cybershot", "Author": "Ray Zeller \"zincolorado\"", "ReviewID": "R2JAHJK655R96R", "Overall": "4.0", "Content": "The camera seems a little cheep when first opened but after you handle it for a while it really quite comfortable in your hands. The camera is easy to set up and the settings are pretty easy to figure out. The camera function switches are kind of confusing (I'm a guy we don't read instructions unless we have too) but if you play with it for a while everything starts to make sense. I have great hopes for this little camera and so far it seems as if it will fill the bill with ease.", "Date": "May 11, 2010"}, {"Title": "LOVE IT!", "Author": "reviewer", "ReviewID": "R1V2FA0BJ4RLM0", "Overall": "5.0", "Content": "ITS PERFECT! the color is a litttllleee darker but it still looks fine and the quality of the picture is great! looovveeee it!", "Date": "April 13, 2010"}, {"Title": "Girlfriend loves it.", "Author": "Joshua S. Gilgenbach \"Joshua\"", "ReviewID": "R2AVM9QB5TT09C", "Overall": "5.0", "Content": "Got this for my girlfriend for Christmas and she simply adores it. It has a great picture quality, seems well built and sturdy, looks very sleak and colorful. The color is really nice on this particular model, she really liked the powder/sky blue.Over all I did some research on cameras before I got this one and it turns out it easily paid off. The price seems excellent for the quality.", "Date": "April 6, 2010"}, {"Title": "camera shy", "Author": "S. Creighton \"music lover\"", "ReviewID": "R1U2NM3L85YWAM", "Overall": "4.0", "Content": "The camera is essentially easy to use. It takes a couple of days to figure out the instructions. It is absolutely stupid to sell the camera without the extended memory. The camera only holds 4 pictures.Otherwise, it is a good camera for any novice user.", "Date": "February 10, 2010"}, {"Title": "Replaced my canon", "Author": "Bonnie L. Sturgeon \"Catholic Convert\"", "ReviewID": "R2A685DCYIWM2A", "Overall": "5.0", "Content": "I reviewed many cameras as i wanted to replace my 8.0 canon powershot. This camera more than meets my expectations. It is easy to use, computer friendly unlike in myu opioion the kodaks are. I love the pictures I took and it is a pretty camera. I got the blue one and it is really a teal blue I think. If you want a digital camera for under 200 dollars I really dont think you can do any better than this Sony. I took pictures in my bedroom of my pets and even tho he light was low they all came out great and did not have to be editied. This camera is worth every penny they are asking for it.", "Date": "January 30, 2010"}, {"Title": "Great camera for picture taking only", "Author": "A. Voong", "ReviewID": "R5Z3JLPRGQD18", "Overall": "4.0", "Content": "I received this camera as a Christmas present and love its simplicity of use! The 12.1mp captures awesome quality pictures. The stabilizer and auto feature in the scene recognition automatically decides if the shot needs flash or not. Makes taking pictures simple and easy. Unfortunately, there's no optical zoom during video mode so you cannot capture an action video (e.g. someone snowboarding into the distance or football tossed going long), hence the four stars. The camera composition seems to be made of great quality.  The camera does make LOUD noises during on/off and during other menu manuevers (delete, change settings, etc.) that I have not been able to find out how to turn off.  For a basic picture taking camera, great camera!", "Date": "January 5, 2010"}, {"Title": "SONY CYBERSHOT CAMERA", "Author": "Susan Clark \"wonder woman\"", "ReviewID": "R1ENT385X8FAEJ", "Overall": "4.0", "Content": "Great Camera, bought it for my daughter for Christmas, just what she wanted, nice quality, she should get a lot of use out of it.", "Date": "December 30, 2009"}, {"Title": "Mixed review", "Author": "DRA", "ReviewID": "R6SSOAIW3R52R", "Overall": "3.0", "Content": "Sony makes a great camera .. I own several..but I will not buy another small digital that does not use an SD card as an option. This is becoming a standard in point and shoot digitals and I will not buy any more sony pro duo memory sticks. Sony is losing out on my future business if this does not change...I hope someone from SONY reads these reviews. IF you agree... let future buyers know as well", "Date": "May 3, 2009"}, {"Title": "Sony Cybershot Digital Camera", "Author": "Rua K. Elmosallamy \"Princess\"", "ReviewID": "R70A5XHO6JFM", "Overall": "5.0", "Content": "I purchesed it as a Birthday gift 4 my friend..she was speechless ..she simply loved it...The Camera  takes beautiful pics also the price is very reasonable :) it's just a perfect gift & i deffinitly recomend it.I also purchesed a pink 1 for me :) so KOOL..love it.", "Date": "April 10, 2009"}, {"Title": "Really bad photos!", "Author": "Oklahoma Mom \"Oklahoma Mom\"", "ReviewID": "R2YO4WVA0X0VRH", "Overall": "2.0", "Content": "Wish this baby was better!  I was looking for a light weight alternative to my heavy DSLR camera to use when I just wanted to snap a quick shot and didn't want to lug my DSLR with me.  I really wanted to like this camera!  But sadly, it takes HORRIBLE photos.  There are lots of good reviews for the camera so perhaps mine is a lemon or else maybe all the other reviewers have low standards.CONS:1.) 98% of interior photos are blurry, distorted, grainy, have weird auras and are unusable.2.) Exterior photos are grainy.3.) Lag time from when you press the button to when the photo is taken is very long.  The moment is past by the time the picture is taken.  And it's also blurry.4.) The first week I got it, a pixil blew out (turned green) in the display.5.) Have to buy a separate Sony-only memory stick.6.) Short battery life.PROS:1.) Cute, light weight design.In conclusion, my particular camera is not very good.  Compared to the photos taken with my 5 year old DSLR, these are complete and utter garbage.  Compared to photos my Mom takes with a similar  Canon point and shoot, these are complete garbage as well.  This camera now belongs to my four year old and my two year old.  Although I usually love Sony products, I will not buy another Sony camera.", "Date": "May 22, 2010"}, {"Title": "Great item", "Author": "BRK", "ReviewID": "R2RERSN2JBI4X5", "Overall": "5.0", "Content": "Item bought, shipped out quickly, and arrived safe and sound in a timely manner. Thanks seller!Item itself is a nice light and quick use camera with very good picture quality. Another quality Sony item (so far)", "Date": "December 26, 2009"}, {"Title": "favorite camera", "Author": "LS DeHaas", "ReviewID": "R2X6RNH2KZTG51", "Overall": "5.0", "Content": "This is the nicest camera that I have ever owned. Great pictures, plus ease of use.  Also another excellent Sony product.", "Date": "November 3, 2009"}, {"Title": "Didn't last long", "Author": "radharose", "ReviewID": "R1TMWNZ7AXEP87", "Overall": "2.0", "Content": "I bought this camera a couple of weeks ago, and it has already failed on me.  I'm sending it back to Amazon for a refund.  I was taking pictures the other day, and I was viewing them, then tried to switch back to shooting mode, and the camera lens seemed to be stuck and wouldn't come out like it's supposed to.  A message appeared on the screen that said, 'Turn the camera off and on again'.  That didn't help at all.  The same thing had happened a few days before, and after turning it off and on, seemed to fix it.  That tells me that it's not just something random, that even if I had it fixed, it would probably do it again, so I won't be getting the same camera.  Maybe I was just unlucky and got a faulty one.The camera itself was okay before it got messed up.  The pictures were a little grainy.  After having paid $160 I would have expected better picture quality.  The camera is a nice size, pretty sturdy, and comes in nice colors.  One other thing that I didn't like is that it captures video in a .MOV format, which can not be handled by iMovie.  You have to purchase a conversion software for it, which is another $30 or so, and it takes forever to convert the videos.I wouldn't purchase this camera again, mostly because of the picture quality.  For the price they're asking, it should take clearer pictures.", "Date": "October 28, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "12.1-megapixel Super HAD CCD image sensor\nCarl Zeiss 4x optical zoom lens; Optical SteadyShot image stabilization\nBIONZ image processor delivers speed and precision\nFace Detection; Smile Shutter technology\n15MB built-in memory; capture images to Memory Stick Duo/PRO Duo Media (not included)", "Name": "Sony Cybershot DSC-W220 12MP Digital Camera with 4x Optical Zoom with Super Steady Shot Image Stabilization (Light Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Z-GyH%2BkKL._SX300_.jpg", "ProductID": "B001O9ARDQ"}}