{"Reviews": [{"Title": "Great Little Camera", "Author": "Bill \"WildRavens\"", "ReviewID": "R1736CNU3VZG5Y", "Overall": "5.0", "Content": "December 27After exhaustive research here and on Consumer Reports, I was convinced that there was no really good small camera, but I was wrong. A salesman in a camera store recommended this model and I am glad I bought it. It's fast, and the menu is easy to use. True, there is no viewfinder, but I like the 3\" LCD. Picture quality is very good and rivels that of my Nikon D40X/sigma 18-200mm lens. I would recommend this product to anyone.December 29After a few days of foul weather, I took this camera out to try it in the sunlight, snow and bright sky. Photos continue to be true to color as seen by the eye. I used a tripod which produced some really clear scenes.The \"set\" button on the back of the camera allows me to access the camera's settings ( ISO,etc.) easily and quickly. I especially like the ability to quickly change the EV. And, the battery still has not shown any diminshed power after some significant use.The fotos tend to be a bit grainy in low light...but that's without a flash.I continue to enjoy this camera and would recommend it to anyone.", "Date": "December 27, 2008"}, {"Title": "Nice easy camera to take eventual good memories.", "Author": "Wills", "ReviewID": "R3SNFI7HSG20NS", "Overall": "4.0", "Content": "After trying a lot of compact digital cameras I came back to Casio Exilim line because it's easy to use, and the presets for image control are great. Image stabilization functions perfect and what I like the most from this one is the wide angle lens built-in capability.Nice toy to get memories from eventual occasions when you're not in the mood of carrying a complete semi-pro DSLR (what I do sometimes). If you're all day out, make sure to try to get a charged replacement battery, tat, by the way, it was not easy to find in stores.", "Date": "January 7, 2009"}, {"Title": "Easy To Operate", "Author": "Don", "ReviewID": "RGB2KTMXSK9FA", "Overall": "4.0", "Content": "The camera is user friendly so you don't have to go through several buttons to find what you are looking for.  My wife likes the 3 inch screen which clearly shows what the camera is going to shoot in vivd color without straining your eyes.  I strongly recommend a minimum of 1GB SD card and preferably a 4 GB SD card for the camera to maximize the resolution on your photos without running out of memory.  If you are using the camera for video you should probably get a 10 GB SD card.", "Date": "December 7, 2008"}, {"Title": "Very Happy Daughter", "Author": "H. W. Whitaker \"Jujitsu Blogger\"", "ReviewID": "R1GGJUV79XH1DK", "Overall": "4.0", "Content": "I purchased this as a gift for my daughter and she's been extremely pleased with the quality of the pictures and movies this camera captures. It also has a high 'cool' factor with its flashy red color and snazzy styling. The YouTube upload feature is not that intuitive but is outweighed by the big screen on the back and the rugged construction important for something taken to sleep overs, dance parties and general goofing around. You'll need to be sure to purchase a memory card as the camera does not come with one.", "Date": "January 18, 2009"}, {"Title": "Poor lens makes this cheap camera STINK!", "Author": "Emily Mitchell", "ReviewID": "R1MUAUVAHJGFL0", "Overall": "1.0", "Content": "I was very happy with the Casio Exilim Z55, which has a Carl Zeiss lens.  It was great and took nice pictures.  This one has a cheap lens that does not calibrate well with the software, and so your pics are always too dark or light.  The lens is short, zooms poorly, and is slow.", "Date": "March 12, 2009"}, {"Title": "Great Valve for the price", "Author": "LM", "ReviewID": "R2K3I3L2I2FZ1I", "Overall": "4.0", "Content": "After some research I decided to purchase this camera for myself.  I'm by no means a camera whiz, but by getting this one I take beautiful pictures and it has just enough extras for my needs.  Priced great, delivered in no time.  Easy to operate and just fun to use.", "Date": "February 8, 2009"}, {"Title": "Excellent Camera", "Author": "Polestar \"Northern Exposure Groupie\"", "ReviewID": "R2VKF04BSH3BZQ", "Overall": "5.0", "Content": "The camera is very compact but with a big 3 inch LCD screen.  Easy to operate after spending a little time with the instruction manual.  It has a rechargable battery with charger but I think I would prefer regular batteries for travel.  All in all a good product at a good price.", "Date": "January 25, 2009"}, {"Title": "review of the Casio Exilim EX-Z150SR", "Author": "Sterling Williamson", "ReviewID": "R3G6DT5MT4WE66", "Overall": "4.0", "Content": "The only thing about this camera I would change is the size of the maneuver controls.  I have medium sized hands and  I find I have to be careful when pressing the controls.  I really do like the 3\" LCD screen, however, and the small size of the camera makes it convenient to carry anywhere. I have only used it at Thanksgiving but was happy with the photos I took.", "Date": "December 21, 2008"}, {"Title": "The Big Picture", "Author": "carolyn field", "ReviewID": "R1RSY2VGS1GJRO", "Overall": "5.0", "Content": "This camera is great and I love the wide angle lens. I would recommend it to friends especially those who travel to places like Africa and India like I do.", "Date": "May 9, 2009"}, {"Title": "Great little camera", "Author": "Mark", "ReviewID": "R1R36X1JJXL448", "Overall": "5.0", "Content": "This is a great camera that takes very good pictures. The anti-shake feature is very nice, and the camera is quick to respond, has a ton of settings & is very compact & portable. The wide angle lens is a great feature usually reserved for SLR cameras. The quality is very good overall and I would recommend this camera for everyday use.", "Date": "October 22, 2011"}, {"Title": "So So Camera", "Author": "nobissellforme", "ReviewID": "RRE5N4E8S3TVB", "Overall": "3.0", "Content": "Bought this camera to replace a terrific Cannon Powershot S400 that took a spill into the sand at the beach...not good.I love the size of the screen, the wide angle lense and the compact size of the camera. The camera is very stupid dealing with light. I take a lot of car show pictures and even a glint of light off of some chrome throws it off. You are better off taking pictures in low light with no flash as the flash is useless after 5 feet and washes out the picture if close. I have never gotten it to take a good Macro shot, always blurry and again turn off the flash. the optical stabilizer doesn't seem to do much, unless the subject and the photographer are dead still you get fuzzy pictures. The charger is a reasonable size but the cord is a Joke! The wrapped up charger cord is bigger than the camera and charger put together. Should be like the Cannon charger with fold out AC plug prongs. The ability to charge off of the USB port would be handy.I'm not a photographer so perhaps it is me that doesn't know how to configure the camera but the Cannon was much more forgiving and took much better pictures.", "Date": "January 5, 2011"}, {"Title": "Hooked on Casio", "Author": "Dixie66Ro \"Dixie66Ro\"", "ReviewID": "R3KVGCMMLHM6GH", "Overall": "5.0", "Content": "I am an amateur photographer, and I've been using Casio cameras for years now. This is my 3rd Casio Exilim, and I love them so much that I hardly consider getting another brand, or even model. It has everything that you need (for basic to average user), it's easy to use and to take along. The only feature that I liked better with my previous Casio Exilim was that I could charge the battery by placing the camera into a dock, instead of completely removing the battery. But this is minor inconvenience.", "Date": "May 26, 2010"}, {"Title": "bad camera just hate it", "Author": "Ms barbara \"chisana\"", "ReviewID": "R1IZLK5NOQ4I4W", "Overall": "2.0", "Content": "I don't think I have taken a good scenic photo with this camera.  It stinks.  NOTHING is in good focus or sharp because it forces the camera to use a big f-stop rather than f-stop it down so that the whole photo is in focus.  TERRIBLE>  It will take a photo at f-2.8 and 1/800th of a second rather than at f-5.6 or 11 and maybe at 1/250th of a second.  So makes everything pretty fuzzy and not sharp at all.Also I think because it has a wide angle 28mm lens it needs more light in general to get a photo. I don't think I would buy a 28 mm lens again.  I came to this camera from a Panasonic with a vivid color setting and there is no comparison.I sent this camera on hi density which also helped.I am going to dump this camera as soon as I get back to the US>  I did figure out how to force the camera to remember the ISO which helps but still the photos are just not sharp.Don't like it & would never recommend it to anyone who knows photos.", "Date": "November 14, 2009"}, {"Title": "decent quality, major shutter delay", "Author": "Glenn Gregory Martin", "ReviewID": "R22PSB406UU7PH", "Overall": "2.0", "Content": "I got this Exilim to replace an older Exilim that I had that stopped working.  I didn't do thorough research on this camera.  I simply assumed that it had a  higher megapixel count, so it was probably a step up from what I had.  Boy was I wrong.  This camera has no digital zoom and has a much longer shutter delay.  So long in fact, that it's practically impossible to get an action shot.  No wonder it was \"cheap\".  If you're at all interested in getting action shots, don't get this camera.  If you just want to take pictures of flowers and things that don't move, then you might be OK.", "Date": "July 17, 2009"}, {"Title": "Just what you looking for.", "Author": "Justin Duarte \"-Des Noteo-\"", "ReviewID": "R3164TY6OP6S78", "Overall": "5.0", "Content": "This camera is one of the best you can find for the price. It's small enough to fit in your pocket easy and it is an amazing camera dont be fooled this camera is solid i have NO regrets for getting this camera the only problem is it doesnt come with a memory card and apparently psp memory cards will not work (in case you didnt know) but other than that this camera is perfect for a CASUAL picture taker dont take pictures constantly then be mad if you want something to make a great myspace pic or even more this is the camera to go.  5/5", "Date": "October 30, 2008"}, {"Title": "Not so happy", "Author": "X. Li", "ReviewID": "R1ZZWM5RAH84LT", "Overall": "3.0", "Content": "I have bought 4 exilims and this is my latest buy. My last purchase, a Z250, is excellent - especially the video button and the quicktime file format. This one, has the video button, but the output video is avi format - 1 minute video takes almost 100 MB. So it is impossible to record a long video using a 2 GB card.Also, it does not recognize my 4GB SDHC card - which is another inconvenience.As for taking pictures, it is like my other Exilims - good quality given its small size.Buy Z250, not this one.", "Date": "September 17, 2009"}, {"Title": "Very Disappointed", "Author": "K. Ross \"vegan mimi\"", "ReviewID": "R3910E4L3SLO14", "Overall": "1.0", "Content": "I never thought I'd write a review like this. I had this camera 1 week. The first time I used it I was very happy with the pictures that I took. I went to take pictures a few days later and it wouldn't work. It kept saying \"Lens ERROR\" and shut down. So I guess I will need to go through getting it returned.", "Date": "June 27, 2009"}, {"Title": "One significant shortcoming", "Author": "John E. Sonne", "ReviewID": "R2QJ3CBCS9IJG6", "Overall": "3.0", "Content": "This Casiio Exilim model was purchased for my wife because os a newspaper tech article. The compact size, the viewing screen and the wide angle lens are pluses. However, the ease of turning on the review mode while in a purse and the need to use your fingernail to turn the camera on are frustrating. My wife bought a case but that means she will very rarely use the camera because of the bulk and hassle of that additional equipment.", "Date": "February 15, 2009"}, {"Title": "Faulty on purchase", "Author": "Hiten Patel", "ReviewID": "RUC3BO0USDKGR", "Overall": "1.0", "Content": "I purchased this camera as it had all that I was looking for. On starting the camera, the flash would not set to any other setting except \"off\", hence that never worked. Also, if the camera was at max zooom, the photo woudl freeze the camera and I had to take out the battery to reset the camera.I do own 3 other cameras and am an avid amature photographer.Returned the camera and bought a Cannon.", "Date": "May 30, 2009"}, {"Title": "This camera sucks!", "Author": "LM47 \"LM47\"", "ReviewID": "R9TS6PCCOI3SG", "Overall": "1.0", "Content": "I bought this camera because I was very happy with the Exilim I had that I crushed.  The old one took great pictures and was very easy to use.  I ordered this camera to have in time for Christmas and all the photos from the holiday were awful.  The color is too dark without the flash, too bright with the flash.  There is no macro setting.  Even using auto focus, the pics were blurry.  Not a good purchase.  Amazon, of course, gave me a refund and I got the Elph instead.  I love it!", "Date": "February 19, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "8MP with 4x zoom\nWide angle lens\nYou Tube ready\nCCD shift stablizer\nFace detection", "Name": "Casio Exilim EX-Z150SR 8MP 4x Zoom 3-Inch LCD Screen Digital Camera with 28mm Wide Angle Lens CCD-shift Image Optical Stabilizer (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51m151mVZDL._SY300_.jpg", "ProductID": "B001F9I4BW"}}