{"Reviews": [{"Title": "Coolpix S710", "Author": "LYK \"Lee\"", "ReviewID": "R39H7JT78S2OH9", "Overall": "2.0", "Content": "I purchased this camera in five months ago. The picture quality is very good but it started developing problems after 3 months. It will not retain the time and date. It started to freeze up nd could only be turned off or on by removing batteries.I sent it for repair at Nikon authorized center and was quickly told that this defect is not covered under warranty and will cost $99.00 to repair.I strongly advise against the purchase of this series since I spoke to many coolpix owners and found out they have problems as well.", "Date": "May 19, 2009"}, {"Title": "Dynamite!  An amzaing piece of engineering and design", "Author": "Heavyrunner", "ReviewID": "R1W5TK8H7QUT2L", "Overall": "5.0", "Content": "I am a pro photographer specializing in scenic imaging that is sold at the National Parks in the American Southwest.  My products feature 360 degree VR photography in Flash and Quicktime.  I often volunteer to take pictures of families and other groups of people at the Parks with their cameras so they can all be in a picture.  So I have been handling these cool little point and shoot cameras, and I have seen the great pictures they take when my friends come back from trips and put on slide shows.  So I decided the mini point and shoots have evolved enough so I should get one and experiment with using it for my work sometimes.  I bought a top of the line, 12.5 mp Fujifilm FinePix F100fd.  I returned it after one week.  The pictures were muddy and had to be downsized to about 5 mp before they were sharp enough to use.  And the \"manual\" controls just didn't cut it.So I ordered the Nikon S710 in deep red to try next.  It is a great little camera!  The design is brilliant.  It is a tiny work of art.  I love it and you will too!  I use Nikon SLR and DSLR cameras all the time, and the controls on this tiny point and shoot S710 work exactly the same as the controls on my expensive DSLR Nikons.  The color out of this little camera is spot on, and the images are sharp and very much usable at the highest resolution, 14.5 mp!  I like the lens.  It can't match full size Nikon lenses for regular FX (35 mm) cameras, but it's pretty close.  The high iso capabilities of the S710 are good.  The vibration filtering works great and you can get some beautiful photos in low light situations with no tripod.  I bought a mini tripod with the camera for $5 that works fine and got a nice, two tone burgundy and black case from LowePro for $15 that holds the camera, an extra battery and SDHC card, and the tiny tripod carries great slid through the belt loop, so I have a pretty complete kit that weighs less than a pound and fits in a pocket!The ergonomics are superior and the camera feels natural in my big hands and its comfortable to hold and keeping my fingers away from the flash is just automatic.  The buttons and select wheel work and feel just right and the menus in icon mode make sense and work intuitively.The only thing I would suggest Nikon do to improve the camera is to provide a firmware update that allows you to save images in RAW format.Some reviewers have complained about the camera being slow.  It seems plenty fast to me and I have not found its speed an issue.  The case is stainless steel and the finish has proved very durable so far and looks great!  I love this camera and take it with me everywhere I go.  I am flying to Chicago in a couple of weeks to see Etta James and go to a Cubs game and this kit is the only camera I am taking along.", "Date": "April 15, 2009"}, {"Title": "The perfect digital camera", "Author": "Cajundego \"Cajundego\"", "ReviewID": "RPEE1DNVBC680", "Overall": "5.0", "Content": "I have a D-SLR that I use on a regular basis since photography is my hobby. I wanted a small camera that I could put in my pocket or purse instead of carrying my backpack of camera & lens around when I was just out & about. This camera takes as nice of pictures as my Canon and I am able to adjust the f/stop & shutter speed as well. There are around 16 pre-set modes that are helpful. The 14.5 mp is an added bonus if I want to enlarge my photographs. The case is sturdy and it does come with a ac charger & USB cable. I used a SDHC class 6 memory card to remove any lag time between pictures and for good video footage. You will not be disappointed.", "Date": "October 6, 2008"}, {"Title": "Disappointed", "Author": "OLDS \"You Understand!!!\"", "ReviewID": "R39K5U3XD7RUK2", "Overall": "1.0", "Content": "As many of those providing poor to bad reviews, I had this camera about 3 to 4 months before I had the problem with the lens error as many have described. I had to always make certain the camera was well charged so this problem did not occur regularly. In addition, I have also experienced the problem where the camera does not maintain the time and every time I go to use it I have to set the date and time before I can take a picture with the camera. I also agree that it is not structurally sound.I am very disappointed with this Nikon camera!!!", "Date": "August 30, 2009"}, {"Title": "Absolutely Unreliable", "Author": "Ｌｏｗｒｙ", "ReviewID": "RKMD769D0A3UI", "Overall": "2.0", "Content": "My sister and I bought two Nikon Coolpix S710 cameras and they were both a great disappointment. My camera's lens broke before I even started using it. I turned it on for my trip to Washington D.C. but the screen said there was a lens error that couldn't be fixed. I tried turning it on/off, taking out the battery, shaking it, but nothing worked. In the end, I had to ship it back for a new one and I only had it for two days!My sister's camera worked once before it had problems turning on/off. She would need to remove the battery and reinsert it every time. She will also be returning her camera.I definitely do not recommend this camera to anyone.", "Date": "August 17, 2009"}, {"Title": "Coolpix is not so cool", "Author": "L. Black", "ReviewID": "R7H6ADJUD3UY1", "Overall": "3.0", "Content": "This is a nice small, lightweight camera with very cool colors to select from.  However the sensor is too small for 14MP.  The photos are not as sharp as they should be and the shutter speed is a bit too slow for today's standards.I typically shoot with a Nikon D300 and I wanted a smaller camera to have with me all the time.  When this one was a disappointment, I got a Fuji that works great.", "Date": "January 13, 2009"}, {"Title": "Great camera and lots of features", "Author": "M. Puett", "ReviewID": "R1YNHZVL2020GO", "Overall": "5.0", "Content": "What a great camera.I've had it two days and I am amazed at all of the features packed into it. First of all, it is small. However, the controls are all easy to use, with the most common just a touch away.Pictures so far are awesome and some of the in camera editing features to copy a picture to a smaller size for email or web use is great; I don't have to fire up photoshop to shrink it.This is the best of both worlds, I can had this camera to a novice and they can take great photos and then I can use the advanced functions for my shots.I would recommend this to anyone.", "Date": "June 18, 2009"}, {"Title": "S710", "Author": "Kristina Kazakoff", "ReviewID": "R1L736WV4M134Q", "Overall": "4.0", "Content": "I love this camera. Aesthetically and technically it preforms well.The S710 is user friendly, and in my eyes all Nikon products are. Browse through the user manual and it will make sense right away. The display screen is an upgrade from my old Cannon powershot. I recommend putting a screen protector on it to help extend it's life.For me the best thing about this camera is the quality of images it captures. Also it's still small enough that I take it with me everywhere- just toss it in my bag (while in its case of course). The deep red color is nice- it's something that's not black or silver, so it feels a bit more personal.", "Date": "January 19, 2009"}, {"Title": "Love this Camera!", "Author": "Mainstreet Dalmatians", "ReviewID": "R5IFYD5T94TNF", "Overall": "5.0", "Content": "I just received my new Coolpix S710.  Wow - it is fabulous.  It has so many features - it is by far the best digital camera I've owned.  I would highly recommend it.  You name it and it can do it and the instructions are written very well.  This is a camera that is well beyond the rest!", "Date": "October 17, 2008"}, {"Title": "Great pictures, but already messing up!", "Author": "Tasha", "ReviewID": "R2YN0WPH6DZJKI", "Overall": "3.0", "Content": "I have had this camera about 2 and a half weeks and I am very disappointed. The pictures it takes are GREAT, however, I am already getting the \"Lens Error\" problem that others are getting. I called Nikon Support and they have offered to repair it for free, since it's still brand new but I am thinking I am going to just return it and buy another brand. I am afraid that after repairing it, it will have the issue again and then I will need to pay out of pocket. It's a disappointment as I always hear Nikon is a good brand but I am not impressed on the quality of the product. I would not recommend anyone to purchase this camera.", "Date": "December 9, 2009"}, {"Title": "Nikon Coolpix S710 14.5MP Dogital camera", "Author": "G. Feldman", "ReviewID": "RKZ7I87VYXIFC", "Overall": "5.0", "Content": "Great camera! Easy to use. I like the increased 14.5MP because it's easier to crop and enlarge the picture, without losing any resolution! (Picture is still sharp). Don't forget to order a case, and I prefer an 8GB memory card. Amazon did a great job following the sale through delivery. I wouldn't hesitate to place another order through Amazon!", "Date": "October 8, 2009"}, {"Title": "Three Years Later I Still Like It", "Author": "heavyrunner", "ReviewID": "R1QDUB1LEDOPHO", "Overall": "5.0", "Content": "I reviewed this camera right after I bought it in 2009. I was out shooting wildflowers early this spring of 2012. When I crouched down to shoot a Desert Indian Paintbrush closeup in macro mode, the camera slipped out of my hand. I had not put the wrist strap over my hand onto my wrist and the camera dropped about 6 inches, but it landed on solid granite, lens barrel first at an angle. That was enough to generate \"lens error.\" So be very careful and don't drop your S710 at all when the lens is extended. Apparently they are very fragile in that configuration.I sent the camera in for repair, and I have been charged $87 and the web site says they are replacing my camera with a new unit. I haven't received it yet, but I assume I will, which is a great deal. The case was starting to show some wear in the beautiful red finish so it will be nice to get a completely new unit.If you use manual settings, this is the point and shoot to have. I looked around for a replacement camera and I wasn't able to find another with the manual controls of the S710. Also, it uses a CCD sensor, which many photographers argue produces sharper images than CMOS sensors.", "Date": "March 10, 2012"}, {"Title": "Great features Bad quality", "Author": "Daniel Saliba", "ReviewID": "R26L943ACRODX8", "Overall": "1.0", "Content": "I thought Nikon was a name I would associate with quality such as in Toyota but that was not the case. In less than a year with very little use, the Nikon stopped working with the lens not opening and closing. Major disappoitment especially for such camera that was purchsed for over $200. I bought a Cannon now and so far it has been good.", "Date": "December 21, 2011"}, {"Title": "Good Camera", "Author": "bck177z", "ReviewID": "R3QPRXMF79CQ4Q", "Overall": "5.0", "Content": "Read alot on cameras and decided to get this for my wife for Xmas, takes great pictures but is not the best for action shots.", "Date": "December 28, 2010"}, {"Title": "Nikon coolpix S710", "Author": "Brillo", "ReviewID": "R2IGVDOI6XCZOC", "Overall": "5.0", "Content": "If you are familiar with compact digital cameras you will find this one easy to use.  Picture quality is excellent.  You will need to buy a memory card for it.  Suggest buying one with high speed (class 6) and 4 GB minimum.  Computer interface works fine and is intuitive.  Also got a great price on it through Amazon with speedy shipping.  You also may want to consider a carrying case for it as it does not come with one.  Very happy with purchase.", "Date": "August 7, 2010"}, {"Title": "Do NOT buy from Nikon", "Author": "mdabs", "ReviewID": "R16EEQP7N389E5", "Overall": "1.0", "Content": "No matter what a great deal you think you're getting, don't buy this camera.  It will only cause you headache later on.Unfortunately, I had the same lens error that many many others have experienced due to Nikon's defective product.  Here's my story:  I had the lens error since day 1.  It normally fixed itself after an hour.  The last time, the lens unit would not retract into the camera, and it was rendered useless so I finally sent it in to be repaired - covered by warranty.  Nikon just got back to me telling me my camera was \"damaged\" and therefore, the warranty voided, and that if I want my camera fixed, I owe them $87.00. I never dropped or otherwise damaged this camera.  I believe that what they're referring to is a scratch on the front, caused by taking the camera out of my purse, and putting it back away.  I will not be spending $87.00 for another defective lens unit, so I now need to purchase a new camera.It's unfortunate that they are getting away with such poor customer service. I know I will never purchase other Nikon, and will advise everyone I know against it as well.", "Date": "May 24, 2010"}, {"Title": "Lens system fails!", "Author": "Robert S. Shelby \"BS\"", "ReviewID": "R2HXX5G8NQMX0R", "Overall": "2.0", "Content": "I recently bought this camera and while it takes great pictures, the lens system has failed and will not open.  I took it to a repair place and the estimate was as much as the camera cost.  They said they had to replace the entire lens system since the gears were stripped.  Stripped, after limited use over the last four months?  Buyer beware!", "Date": "May 6, 2010"}, {"Title": "Christmas Disappointment!", "Author": "Connie the Crazy Cropper", "ReviewID": "R2WBB6A4BOEFSS", "Overall": "1.0", "Content": "I gave this camera to my twenty year old daughter and the lens is stuck open. She has tried recharging the battery, but the lens still won't close or take photos!  What a disapointment for her and waste of money for me!Connie in NY", "Date": "April 20, 2010"}, {"Title": "nikon", "Author": "Ramana \"ramana\"", "ReviewID": "R28OI2GHQCEB4I", "Overall": "5.0", "Content": "this is a nice product less expensive and also lot of features. i would like to recommend this product. i purchased only for 190 dollars", "Date": "February 9, 2010"}, {"Title": "excellent little machine, the S710", "Author": "D. Calvert", "ReviewID": "R18O7RFMK4CWKS", "Overall": "4.0", "Content": "Cnet etc is right - that 14mb image takes 4 sec to process - but what fun to have that giant image to crop just the way you like. I'm 5 baby Nikons into my digital photo life and the 710 is far and away my favorite. Gorgeous sensitivity - you can turn off that flash and get the shot, it wakes up in < 1 sec, focuses fast, has a reasonable set of aperture, shutter and manual controls. The program mode is a bit simplified - really just 5 or 6 aperture/shutter combinations - but it's serviceable. I also have a P5000 (for work) and the S710 lacks the P5000's amazing macro capabilities. I suppose this is due to the (very lovely to have) wide angle lens - so minimum focus distance is 10 inches - but again the 14mb comes to the rescue. Shot and crop for a descent close up. And those ugly purple fringes on tree limbs against the sky - they are gone - nice glass on this little one.Still getting used to handling this small machine which lacks the grips of the P5000 and all the other Nikons I've used - so I make sure to slip the strap over the wrist. But small means you carry it always and everywhere - which is the point, no? All this at a nice price.dc", "Date": "December 10, 2009"}, {"Title": "unreliable flimsy construction", "Author": "YNV", "ReviewID": "R1KA7WZ1KB25SB", "Overall": "2.0", "Content": "This is the worst compact camera I've owned, it's poorly built and unreliable and I wish I could return it and get my money back.The problems:1) The build of the lens mechanism is extremely flimsy.Just after 2 months of using this camera some dust or particles got inside and almost every picture we took with it during our vacation was ruined with the black spots. Unfortunately, we were stuck overseas and couldn't return the camera until it was too late. The particles/dust are there to stay and we won't be able to take them out unless we send the camera to Nikon or for professional cleaning (which is way too expensive to do for an ultra-compact camera). The problem is getting only worse, at this point the camera is becoming unusable due to a large number of photo artifacts from the particles trapped inside the lens or between the lens and sensor. We never had this problem before using other compact cameras we own (we have 2 Sony cameras and one Olympus). Our Sony DSC-P150 was even dropped down some pretty steep steps and still continued to operate normally without a hint of any artifacts. This camera was treated in a much more careful fashion and still managed to get particles inside. I can only blame flimsy construction for that.We also had problems with occasional lens error messages and camera getting stuck in mid zoom like others reported.2) The camera is extremely slow for a quick point-and-shoot. We are not photographers and use this mostly in auto mode and scene mode. It takes a while to switch it on and make it ready to take photos, but that's something we can deal with. The worst is the fact that the camera takes forever to focus which makes it very easy to miss important shots. It's also more prone to take blurry photos. Our old Sony P-150 is super-fast and snappy when it comes to auto-focusing and taking the quick shots.3) Photo quality is ok, pictures taken in bright light sometimes need exposure under-compensation, otherwise they turn out overly highlighted. Sharpness of pictures isn't as good as I would expect from a camera with 14mp. The images are softer than what we get from our old Sony camera and when enlarged to full resolution appear blurry. It doesn't feel the camera takes advantage of 14mp at all.The good points about this camera:1) Although it's definitely not the slimmest camera around it's still pretty compact to fit into a small pocket while providing wide-angle capability, which is very useful for group portraits, landscapes and real estate. We bought it specifically because we wanted an ultra-compact that would have a wide angle and at that time (a year ago) this was the only camera on the market like this.2) Pictures have nice color, the color rendition is better than what we get on a Sony camera.3) Nice night shots - it's not difficult to take acceptable night portraits and night shots even if you don't use tripod or any other stabilizing device. This feature is much nicer on Nikon than on our old Sony camera which is unable to take any night time pictures without excessive blurring.Even if we didn't have dust particle artifacts on our photos, I wouldn't be satisfied with this camera's performance due to slowness and soft blurry images. But now, it's pretty much useless unless you are into photoshopping black spots in each and every photo. Nikon needs to take this sad and flimsy model off the market, there is too much competition out there now for compact wide angle and even super-zoom cameras. Personally, I don't trust Nikon's reputation as a superb quality camera manufacturer after experience with this product and would never buy another Coolpix or other compact from them again.", "Date": "November 24, 2009"}, {"Title": "Camera review", "Author": "scribner \"more photos\"", "ReviewID": "RUUZCBK4KHSSL", "Overall": "4.0", "Content": "Great camera and easy to use. We carry it every where we go. The photo quality on the high resolution is great for print work. My kids love it.", "Date": "November 10, 2009"}, {"Title": "Goodbye Cannon - Hello Nikon.", "Author": "James R. Gledhill \"Jim Gledhill\"", "ReviewID": "R1ND6HWQ4UBZJN", "Overall": "5.0", "Content": "I have always had a cannon powershot. Thought I would try the Nikon. I am now a Nikon fan.", "Date": "October 18, 2009"}, {"Title": "coolpix s710 worth every dime.", "Author": "Tremayne Lamont", "ReviewID": "R2W4GK3I49KIOD", "Overall": "5.0", "Content": "the coolpix s710 is an awesome camera. I'm a college student and I love to take pics of the times. Last week I went to a wedding and the photographer was very impress with the image quality of my camera. She said for a digital camera this image quality is very unique. I'm very please with this purchase.", "Date": "October 13, 2009"}, {"Title": "Nikon S710", "Author": "Robert J. Lomoriello", "ReviewID": "R1PW2MF5LMILIS", "Overall": "5.0", "Content": "Best camera I have ever owned - its fast and the pictures are great,as is the wide angle lens. This camera was exactly what I have been looking for. Moving the flash away from the lens has reduced the red eye. Amazon seeems to always have the best prices, delivery etc. - they haven't failed me yet.", "Date": "April 25, 2009"}, {"Title": "quickly captures", "Author": "Lisa Hodle", "ReviewID": "R1I15EK658393H", "Overall": "5.0", "Content": "This camera quickly takes the picture. All the other digital cameras I have had did not respond nearly as fast as this one. The clarity and sharpness of the image is amazing. I love this camera and would recommend it to anyone and 1 last thing is I am no professional but my pics are looking GREAT!!!!!  I LOVE IT!!!!!!!!!!", "Date": "December 12, 2008"}, {"Title": "Quick Review", "Author": "Katahroo", "ReviewID": "RJWYCB70K7HZ8", "Overall": "1.0", "Content": "I had the canon sd870 Canon PowerShot SD870IS 8MP Digital Camera with 3.8x Wide Angle Optical Image Stabilized Zoom (Silver) but returned it because the wide angle lens had too much distortion.This camera looked really nice and had great technical specs so I pre-ordered it. I waited and waited and finally it came in the mail and within a day I sent it back. It is a plastic piece of crap. It is loud, big, heavy, cheap feeling and cumbersome to operate. The pictures were alright but nothing to brag about or pay this amount of money for.I just ordered the canon sd880 Canon PowerShot SD880IS 10MP Digital Camera with 4x Wide Angle Optical Image Stabilized Zoom (Gold)And I love it, it is great and I couldn't ask for anything more.I was trying to be open minded and try Nikon out but they just disappointed me. I'm not a canon fanatic I promise, they are just a really reliable brand and are built really well. I know that all higher- end SLR's and lenses are on par with each other from all companies. It's just Nikon fell short with their point and shoots.", "Date": "November 6, 2008"}], "ProductInfo": {"Price": "$379.95", "Features": "14.5-megapixel resolution for stunning prints as large as 16 x 20 inches\n3.6x wide-angle Optical Zoom-Nikkor glass lens; Optical VR Image Stabilization\n3.0-inch high-resolution LCD; Program, Aperture, Shutter, and Manual Exposure modes\nAuto adjusts up to ISO 3200; In-Camera Red-Eye Fix and Enhanced Face-Priority AF\nCaptures images to SD/SDHC cards (not included)", "Name": "Nikon Coolpix S710 14.5MP Digital Camera with 3.6x Wide Angle Optical Vibration Reduction (VR) Zoom (Deep Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Cx1N0o-CL._SX300_.jpg", "ProductID": "B001DNY67Q"}}