{"Reviews": [{"Title": "Good Performance and Value", "Author": "Jeannine", "ReviewID": "R1KTVB7MJFLPGO", "Overall": "5.0", "Content": "I purchased this unit to add to the wireless camera system that I had bought locally.  This is the secondary camera for the Wireless Color Camera with Receiver 45234 ([...]). First of all, the price was the lowest that I had found.  Shipping was FAST.  Unit came well packed and in perfect condition.  Easy to hook up. Just mount it in your desired location, plug it in, and set the viedo input selector on the receiver. Mine is connected to a tv and vcr player/recorder. Camera image is identical to the original one in the wireless camera system.  If you plan to use this unit at night, do not mount it in a window, as the night vision lights will only reflect back into the camera.  Therefore, either use it for interior purposes, or mount it in a sheltered location outside.  Mine is mounted over the entry door on a covered porch, so there's no weather exposure issues.  If you need an extension for the 8' power cord, the distributor ([...]) can sell you a 15' extension cable for the camera.  You might need the product number to research this:  Wireless Color Camera 45233.  They also carry a battery pack that they say lasts up to 5 hrs. I'm very happy with my purchase.", "Date": "July 22, 2010"}, {"Title": "Might have been good but...", "Author": "acdc", "ReviewID": "RQMQ22O82QCEK", "Overall": "2.0", "Content": "This product should have stated it is an ADD-ON Camera, DOES NOT have a receiver...", "Date": "October 22, 2010"}, {"Title": "Great Security Camera For The Price", "Author": "Don", "ReviewID": "R3PS0MX4A5AZOS", "Overall": "4.0", "Content": "i purchased this camera along with the camera and wireless reciever base set from walmart, the picture quality is quite nice and the night vision is great, i really like the wide viewing angle, i use one camera as a nanny cam in my sons bedroom, and it works great for the times when he starts crying in the middle of the night and i want to see whats wrong without actually going into the bedroom, i use the second camera outside mounted under my porch viewing my entire yard and alot of the street in front of my house, outside view is a little washed out looking but quite detailed, a neighbors car was broken into and the camera caught the whole thing and was clear enough to make a positive description on the person, it was about 8pm so it was just getting dark outside. Overall i say for the price and quality you cant beat it, the range varies depending on your walls and electronics in your home, the only electronic that messes with it is my old cordless phone, my new  cordless phones dont mess with it at all, i also have wireless internet in my house and that doesnt affect anything either.", "Date": "October 4, 2011"}, {"Title": "Not good.......", "Author": "Rl Shuey", "ReviewID": "R35LSUD4MIPBY8", "Overall": "2.0", "Content": "I bought this to add to a GE 45234 camera system I have, but the IR on this and GE 45234 cameras are very poor, plus now one the cameras has been cutting out and has to be reset all the time and the other one IR just quit (BTW they are all in the junk pile as of now) . After buying this camera, I gave up started over and bought the GE 45246 camera system (for about the same price as the GE 45234 camera system) and it works so much better. On this system the IR works great, it has a better signal range, better mounting and I have had no problems so far. For now I would recommend that you avoid this camera and spend a little more money and get the GE 45246 on Amazon.  Here is the link: http://www.amazon.com/GE-45246-Wireless-Outdoor-Receiver/dp/B003OUWACE/ref=cm_rdp_product", "Date": "March 5, 2013"}, {"Title": "Night vision", "Author": "Lori Brucklacher", "ReviewID": "RVEUEEFNPQONA", "Overall": "3.0", "Content": "The night vision is not very visible.  you can only see deformed shadows.  Would not recommend this item for security.", "Date": "January 23, 2013"}, {"Title": "wonderful camer", "Author": "shannon johnson", "ReviewID": "R3NFTV6A94CDST", "Overall": "5.0", "Content": "this camera is great for close range coverage. but do not have 2 of them too close together. there is interference.", "Date": "September 6, 2012"}, {"Title": "Very useful item", "Author": "Karen R. Swanay \"subjective interpretation is...", "ReviewID": "R1Q4IE29N15VI1", "Overall": "4.0", "Content": "This does exactly what it says it does.  We have two because the viewer can show two different cameras.  One is stationary mounted and the other we can put where we need it to watch our daughter.  The camera I have no issues with and does in fact work in what I would call zero light conditions.  So they have been great and we haven't had any problems at all.  The viewer part that goes with this and the whole system together has it's limitations but that's just because of the nature of the product.  I don't think I'd use this as a home security system type item if I were seriously concerned about monitoring something.  It's just too \"iffy\" with transmission due to walls and other items using the frequencies for serious stuff.  However, if what you want is something that would be satisfied by a baby monitor type level of function, then this will not disappoint you.The night vision part of this camera is surprisingly good for the weight of the product.  Were the \"transmission\" issues not there, this would be amazing.  But those issues are things in our home and the limits of the transmission and not product defects.  I'm not disappointed with this thing and I would buy it again without hesitation.", "Date": "October 4, 2011"}, {"Title": "Quick Intel.", "Author": "brokenoz", "ReviewID": "R1RQJ73NGGK791", "Overall": "5.0", "Content": "Fast set up, Great resolution, extreamly low LUX and excellent range...over 250 ft. through 2 steel roofs! Would highly recomend.", "Date": "January 2, 2013"}, {"Title": "Outdoor use not recommended", "Author": "flowerpowerstl", "ReviewID": "R1KNCSDBKCB24A", "Overall": "3.0", "Content": "I mainly purchased to use to see who comes to my door at night but the receiver has to be very close to the camera to work good.  Otherwise a lot of interference.  If you want this for inside your home, they work great.", "Date": "December 22, 2013"}, {"Title": "Held up a lot longer then I expected", "Author": "Kyle R McCombs", "ReviewID": "R33RY6DNNUTFQ9", "Overall": "4.0", "Content": "Held up a lot longer then I expected, I have had one installed outside for a little over 3 years, still works through the rain and snow. It is not the best quality nor my first choice, I went with one of these to do an add on to my existing 16 channel DVR setup but I needed one wireless and my local home improvement store had one in stock so I went with one of these. I recently bought a second one off Amazon to go with it.", "Date": "November 29, 2013"}, {"Title": "Goody buy!", "Author": "Alan Hudson", "ReviewID": "RXIMVZM6Z8JWF", "Overall": "5.0", "Content": "Wow!..Im very impressed..it was easy hookup no hassle instructions and the picture is crystal clear. I gives distinct detail in the night no blurs, no jumping in or out from past equipment. It was worth the purchase.", "Date": "November 18, 2013"}, {"Title": "oops", "Author": "payns", "ReviewID": "R1I85JMQ4Z5V5O", "Overall": "1.0", "Content": "Not what was advertised, not a web cam at all nor is it wireless, i sent it back for a full refund.  The company was eager to work with the return.", "Date": "October 2, 2013"}, {"Title": "Any ideas how to use this camera with my computer?", "Author": "Harridath Ramnarine Singh", "ReviewID": "RWTJ55ECOZGXV", "Overall": "3.0", "Content": "Since I bought this camera, I am trying to use it with my computer but I can't. Do anyone have any idea how to use this camera with a computer?Thanks.", "Date": "August 7, 2013"}, {"Title": "CAME BROKEN", "Author": "Terry Doyle", "ReviewID": "R8X7JBM205IZE", "Overall": "2.0", "Content": "It came broken into pieces, tried to reassemble it but still wouldn't turn on or be able to be found by computer. Asked for a replacement over a month ago, still waiting for it to get here.  It took a long time to arrive originally so waiting for another one is really annoying.", "Date": "June 18, 2013"}, {"Title": "ge security camera", "Author": "Mike Mccain", "ReviewID": "RQTPXXM755B6Z", "Overall": "5.0", "Content": "real easy to hook up.have yet to hook it up to record.just plug it in and there is the picture.with the option,you can see it thru the tv.", "Date": "April 10, 2013"}, {"Title": "Small item but easy to use", "Author": "Leanne \"hablo-pablo\"", "ReviewID": "R1QI5TRSAFI5B0", "Overall": "4.0", "Content": "Small item, easy to use, easy to set up.  Not big or bulky. Does not stick out. Might be purchasing the battery adapter to get rid of the electrical wires. Don't like seeing those. But the quality of pictures is just what I need.", "Date": "April 3, 2013"}, {"Title": "Second purchase", "Author": "Woodrow Royster", "ReviewID": "R36SHOLY3C85LQ", "Overall": "5.0", "Content": "Already had one worked great purchased a second one...this way i can switch back and forward and view two areas of the property..", "Date": "February 3, 2013"}, {"Title": "air soft use", "Author": "GUINEA PIG LOVER 2", "ReviewID": "R3HN6Q4SEBWZVT", "Overall": "5.0", "Content": "I used this to spy on the other team in my airsoft wars It is kinda cheating  buy it works really great and I love it I have used it to spy on the raccons in my back yard", "Date": "January 28, 2012"}, {"Title": "works perfect", "Author": "cheri", "ReviewID": "R15ABWTI4K6TGC", "Overall": "5.0", "Content": "this camera is used to keep a \"clear\" eye on a sick child from any other room...works perfect....easy to set up", "Date": "June 5, 2011"}, {"Title": "No support", "Author": "Michael Willumitis", "ReviewID": "R2ZL7AE2OX0P1F", "Overall": "2.0", "Content": "Not a bad little camera, for the price.  HOWEVER, 4-year old grandson cut the A/V cable to the receiver and a replacement is \"Not Available\" according to \"Jasco Products\".  Camera is 4 months old!Why the product is marked \"GE\" instead of \"Jasco\", I still don't knowPretty sorry customer support, guys!!!", "Date": "December 7, 2010"}, {"Title": "great cam for the price", "Author": "Fleet Admiral \"The Majestic Seas\"", "ReviewID": "R3AFXOB0EPMVIH", "Overall": "4.0", "Content": "i love this security cam..if it had 4 cams instead of two it would be 5 stars for the price. good night vision, and sound pick up is great.. i can hear my neighbors acroos the street talking", "Date": "November 28, 2012"}], "ProductInfo": {"Price": "$123.91", "Features": "Easily view any are of your home, day or night\nIncludes color camera and AC adapter\nCamera features night vision technology for low or no light viewing\nTransmits audio and video up to 200-Feet\nFor indoor or outdoor use", "Name": "GE 45233 Wireless Camera with Night Vision", "ImgURL": "http://ecx.images-amazon.com/images/I/41piaZbw7uL._SY300_.jpg", "ProductID": "B0013V58WK"}}