{"Reviews": [{"Title": "Overall very happy with this camera.", "Author": "Jim Williams", "ReviewID": "R1ZH999LW73BIR", "Overall": "5.0", "Content": "My wife ordered this camera to watch our front door a couple of weeks ago. I installed it under the eve. So far we are satisfied with it. It out performs my other cameras, especially in low light conditions. It does see further at night. and in color longer at night than the cameras I have. These cameras have 28 LED infrared bulbs and light up dark areas very well. If you need more dark/nighttime illumination, get a camera with more LED bulbs in the camera or a separate LED infrared illuminator.", "Date": "March 1, 2011"}, {"Title": "Good, but missing controls for adjusting picture/OSD", "Author": "Tom Servo", "ReviewID": "RO6AH5COIDYBY", "Overall": "4.0", "Content": "For those that don't know Sony's Effio chipset has adjustable on-screen (OSD) controls for adjusting picture details as well as special functions (privacy mask, lens iris adjustments, adjusting day/night trip point, turning Wide Dynamic Range on/off etc). This camera might indeed use the Effio chipset but does NOT have the controls molded into the cable as other Effio cams do. Therefore you are limited to whatever \"defaults\" the manufacturer programmed (and there's no way of knowing what these are).THE GOOD:+ Attractive, lightweight (due to black plastic case).+ Lots of IR LEDs for night vision.+ Comes with power supply.THE BAD:- Not fully adjustable as other Effio cams for the reason pointed out above.- This is not a varifocal cam, you cannot adjust lens to match your desired view - it's a fixed 3.6mm (wide angle) lens.- The seller has used the same amazon product ASIN for different products at different points in time. Therefore the older reviews may not match the current \"Effio\" product - something to be aware of!OVERALL, I would recommend Professional 1/3\" Sony Exview HAD CCD II with Effio-E DSP Devices Dome Indoor Security Camera - 700 TV lines, 2.8~12mm varifocal lens, 36pcs IR LED, 98 feet IR Distance. Vandalproof. WDR (Wide Dynamic Range). OSD Menu. Great Image, Great for Entrance. instead of this camera because it has a varifocal lens plus OSD controls on the cable.Hope this has been helpful!", "Date": "May 3, 2012"}, {"Title": "Decent camera if used in the correct location.", "Author": "FATHERFORD", "ReviewID": "R1OVDRK9GT2G6D", "Overall": "4.0", "Content": "The VideoSecu 700TVL is a solid upgrade for out of the box systems. The image is crisp for analog day and night IF used in the correct location. This camera is great for 30-35Feet, covering a back porch is a perfect example. I have another one point out over an acre and it is lacking.This is not what I would call Vandal Proof.The camera comes with a 500ma power adapter. It needs that much to work correctly. If you are buying a power supply box for all your cameras, keep that in mind.Out of the 4 different camera's I have in my setup, I would rate this one at the top in no light situations. With security lights, I would place a different camera.My CCTV Setup consist of:Aver Hybrid 16channel DVR8x- NightOwl Cameras(came out of a box system)2x- CNB WBL-20S2x- CNB VCL-24VF2x- VideoSecu VD3HBE1x- VideoSecu 18 Output 12 V DC CCTV Distributed Power Supply Box(replacing as it can not meet the demand of my CCTV cameras)", "Date": "October 14, 2012"}, {"Title": "nice picture but horrible instructions", "Author": "J. Bundock", "ReviewID": "RECDVYEXGK0FV", "Overall": "3.0", "Content": "Overall I'm happy with the picture and function. Its just an incredible pain to mount, even after you figure out how to get it apart.", "Date": "August 2, 2012"}, {"Title": "IR LEDs burn out fast. Great picture & vandal resistant though...", "Author": "Dustin Bolton \"Dustout\"", "ReviewID": "R2NQ4D7AHLNIZ4", "Overall": "2.0", "Content": "I've put 8 of these around my house over time as I slowly replaced a cheaper camera.  The picture is great and the night vision quality excellent... for a while.  Unfortunately within 2-3 months a portion of the infrared LEDs burn out.  Just last night my newest one went from all LEDs working to just a small section of 6 or so, making the night vision worthless.  Since there is no warranty you're out of luck once this happens.  For $80 bucks this should not be happening.  It looks like they must have used a really crappy IR ring in these nice cameras. :( If anyone knows a RELIABLE external IR system please reply here so I can at least make this camera usable, else I just blew $80 bucks each.", "Date": "April 27, 2013"}, {"Title": "Top Notch", "Author": "GlassMage", "ReviewID": "R3OQE520OLKW72", "Overall": "5.0", "Content": "Hooked up this cam temporarily to the composite video input on my 720p plasma TV.  I've seen a lot of surveillance cameras, but NONE that compare to the quality of this picture.  Image is next best thing to HD, day OR night.  Have it under the eave, where it won't be pointing directly at the sun, and has at least some protection from the weather.  I was hoping it would be at least 90° viewing angle but it is less, probably about 10° less.  Image quality more than made up for that.  Plan to hook this cam up to a DVR with 3 more just like it.  So far, 5 stars!VideoSecu 700TVL Day Night Outdoor Security Camera Vandal Proof 1/3\" SONY Effio CCD Wide View Angle Lens 28 Infrared LEDs for CCTV DVR Home Surveillance with Camera Power Supply and Security Warning Decal B39", "Date": "February 24, 2012"}, {"Title": "Video Security Camera", "Author": "Rafael Anchia S", "ReviewID": "R19ZD8TCIAEDGZ", "Overall": "4.0", "Content": "I recently bought this video camera and im really happy with it, since i installed it i havent had any problems and everythings like the description said, i truley recommend other customers who might be looking for this kind of recording video cameras to get this one..", "Date": "November 3, 2011"}, {"Title": "decent picture", "Author": "Tim Delozier", "ReviewID": "R1J6N6F7L26EZJ", "Overall": "5.0", "Content": "I purchased 6 of this camera total and I was basically satisfied with them. These cameras are great - they are sleek looking, sharp in design, with good weight and balance. The camera does appear to be well built and the images produced are of good quality, even in total darkness.They mount easily  and have some nice features (like ability to turn off infrared leds at daytime) and wide panoramic field of view. I'm very happy with those cameras and plan on getting more.", "Date": "July 15, 2011"}, {"Title": "Over-rated", "Author": "Dale Johnson", "ReviewID": "R2L1YH1WFIU358", "Overall": "2.0", "Content": "The product feels like it can handle wear and tear, but it still seems inferior. There is no product information such as the brand name , which tells me that it is a generic product. The wide angle is not as wide as I thought.mounting was super easy but I wish it had the sod display as other Effio chipset cameras", "Date": "December 24, 2012"}, {"Title": "Kinda good", "Author": "J. Jones", "ReviewID": "R668O70XFZ1VT", "Overall": "3.0", "Content": "A much better camera than the one that failed on my LTS 4 Camera+4 Channel 320GB DVR with Web/Mobile Phone/i Phone Access (LTD24HTSK). It is not HD but the colors are much better than the stock cameras. In my opinion nothing less than 720p should be legal to sell these days because it is impossible to read a license plate or recognize a face with these old style cameras unless the camera is right up on the subject.", "Date": "April 28, 2011"}, {"Title": "Security Camera", "Author": "L. mccarty \"Mac\"", "ReviewID": "R3MP067NNWVD2K", "Overall": "2.0", "Content": "I have cameras that look like this, purchased three years ago.  The outer ring attaching the camera to base is threaded on the previously purchased ones.  This one has been cheapened by securing the camera to base plate with two tiny allen set screws. In addition this camera is physically reduced from my early purchase.  The night vision does not function as either.  I will not repurchase this product.", "Date": "August 10, 2013"}, {"Title": "Entrance Camera", "Author": "Leo", "ReviewID": "R1ZPIT7UOTB15P", "Overall": "4.0", "Content": "This camera is my second camera purchased at my entry way. It provides the the clarity of view with a wide angle to surveil the perimeter .  The previous unit LEDs -right bank failed after few months of service but because it provided such a good view at the entryway, I bought a replacement. I am satisfied with its performance.", "Date": "June 20, 2013"}, {"Title": "Good camera", "Author": "Bravette", "ReviewID": "R2K37GBZEAO86D", "Overall": "5.0", "Content": "$80 is a little high but worth it. This camera works well and is better than the defender cameras that came with the defender system I recently purchased. It's a wide angle view, good resolution, and it works great to cover the large area in front of my garage.", "Date": "June 13, 2013"}, {"Title": "quick delivery...nice product", "Author": "HENRY GRAHAM", "ReviewID": "R2KBV0R7PJ7YF0", "Overall": "5.0", "Content": "This product is a replacement of a malfunctioning security camera. This camera displays a higher quality picture than the former camera. Nice product!", "Date": "November 21, 2012"}, {"Title": "Great picture at a good price", "Author": "Carlos", "ReviewID": "R1ZQTD174J4OPF", "Overall": "5.0", "Content": "A much better picture quality than the cameras that come bundled with the low end DVR. The night vision is the biggest improvement over my other cameras. The color and the infrared LEDs are much better also. It is clear enough to read a license plate from 50 feet away. Recommended.", "Date": "September 2, 2012"}, {"Title": "Nice camera, clear image, large viewing angle", "Author": "J. York", "ReviewID": "R30ONV5RYQI0AC", "Overall": "5.0", "Content": "I bought two of these to replace narrow-field Lorex cameras that were fried in an electrical storm.  The viewing angle on this camera is quite nice and allows for a wide field of coverage.  The image quality is very nice (low def) with our without lighting.  The nightvision capability works quite well and lights up a good area in front of the camera.It seems quite sturdy and the dome configuration allows for great flexibility in placement.I'm very happy with this camera and would buy another if the need arose.", "Date": "July 21, 2012"}, {"Title": "wide view", "Author": "Richard M. Rupp \"rich rupp\"", "ReviewID": "R21BRAWROF3ROC", "Overall": "5.0", "Content": "has a great wide view and picture quality is really good.the camera came with a very small crack on the lens over the led's. it doesn't seem to effect anything so i did not return. overall the camera works great and night vision works perfect. description said 520 lines,but box it came in said 540 lines.not sure if it makes that much difference on hdtv.", "Date": "August 18, 2011"}, {"Title": "Excellent Buy", "Author": "xanadu", "ReviewID": "R1ZON6I0BTEY4Z", "Overall": "5.0", "Content": "This product was exactly what i ordered.  It was shipped in a timely manner and was in excellent condition.  i would purchase again. This camera shows well at nights.", "Date": "November 30, 2013"}, {"Title": "love this product", "Author": "mike sterling", "ReviewID": "R297G6J72L07MK", "Overall": "5.0", "Content": "easy to set up. great picture that allows for expert and novice alike to have a great video feed to record and night monitoring is amazing", "Date": "August 14, 2013"}, {"Title": "GREAT.....picture love this camera , so clear  the price is worth it must buy.", "Author": "charlie \"mo money\"", "ReviewID": "R1AGSNHKK6XD7O", "Overall": "5.0", "Content": "Great camera great price GREAT PICTURE day and night. so clear  the price is worth it must buy  thanks Charlie G.", "Date": "July 25, 2013"}, {"Title": "Camera for Home Use", "Author": "Timothy J. Dolan \"Tim Dolan\"", "ReviewID": "R3466DU82TWBZ8", "Overall": "4.0", "Content": "I really like the quality of this camera for the price. I have several other cameras of lower resolution, some even costing more. I especially like the night vision with this camera showing much more in a wider and longer range (about 60 degrees and 60'). Mounting was easy and i like the low profile.", "Date": "May 25, 2013"}, {"Title": "Great Analoge Camera", "Author": "Eric Tanner", "ReviewID": "R3TDAAFI37H363", "Overall": "5.0", "Content": "Clear picture with very good night vision.  This was an easy swap using the old wiring for pre-existing analogue cameras.  I would buy these again.", "Date": "April 30, 2013"}, {"Title": "it works", "Author": "BIG DOG", "ReviewID": "RJVBZIDXT48C0", "Overall": "4.0", "Content": "Great product. easy to use and have not had a problem with them yet. Would use all the time. Would let people know about this item", "Date": "March 30, 2013"}, {"Title": "Very nice", "Author": "Aaron L. Dunphy", "ReviewID": "R9BFW824IXYI3", "Overall": "5.0", "Content": "There is no OSD, so you've been warned!  That aside, I didnt find I really needed it anyway.  The picture quality is great at 700tvl and the lighting self adjust unlike other cctv cams I've seen/used.  I'd recommend this cam for the right price. I got it for $89", "Date": "January 7, 2013"}, {"Title": "Let's be fair", "Author": "Shop Surfer", "ReviewID": "R9LUFWJ74O4OK", "Overall": "4.0", "Content": "My title reads: \"Let's be fair\" because though I thought that this camera was going to be a good buy it was a lot less than what I expected.  I did A LOT of research and the specs for this camera seemed right.  The let's be fair part is because a lot of the times you get what you pay for and this seems to be one of those times.  Compare this camera with the default camera that your NVR comes with ( again, you get what you pay for ) and this camera fully surpass them.  But, at the specs I expected more.  With that said though, it does have a good design being vandal-proof, rotating head and the IR lens is OK.", "Date": "December 15, 2012"}, {"Title": "cameras", "Author": "Rebecca   kashef", "ReviewID": "RBL8381BYNJQE", "Overall": "4.0", "Content": "good product for the price. view at night is good. Will reccomend to others.will re-purchase item if neede. good buy.", "Date": "December 4, 2012"}, {"Title": "Good value - decent picture - good nite vision.", "Author": "Mike the K", "ReviewID": "R1RBT404UOEWW", "Overall": "5.0", "Content": "I like this camera: good for the money.  Only 1 out of a dozen or so that I bought had to be sent back.I am looking at the picture from this camera (videosecu $80.00 800tvl) in quadrant one of my 32\" (inches) tv. In quad 2 is a the 600 line model ($60.00 also from videosecu). The difference is noticeable but not huge: there is slightly more detail and better nite vision sensitivity in the 800tvl model.It is nightime and the picture is now B&W;, but I can clearly see the street and my car parked in front of the house. I can't read license plates or id faces in the street, but I can (with two cameras mounted on the 2nd floor) see up and down the street. These are wide-angle (not too wide) which provides better coverage.Last week a guy drove up to the house in the afternoon (with 4 cameras in plain view) in a rented Penske van and told the downstairs neighbor that he was from the electic company and needed access to the basement. PSE&G; of NJ says they don't use rented trucks.  My neighbor wouldn't let him in and when she tried to get his plate he quickly drove away. So don't expect that all criminals will be scared away. While at the front door the porch cam got a fair, not great recording of him. It's difficult because criminals don't stop look up at the camera and hold still for that great ID shot.It's tough to get good coverage all over your property. My brother live in a bad neighborhood.  I got him an 8 channel DVR and 7 cameras: backyard, frontyard, frondoor, porch, driveway, garage, sidedoor. You can never have enough it seems.There are no adjustments on this camera.  With the siamese cable (sold seperately) and power supply (included)  you can plug it direct to your tv (if you have a BNC->RCA adaptor (sold seperately $2-4.00) if your tv has an RCA input jack.  But you really want a 8 Channel DVR. If you buy a 4 channel DVR, you'll probably end up wishing you got the 8 chnl DVR.Forget about having any privacy in public. Those times are gone. Cameras are coming everwhere. Have them on your house and find out what really happens.  Oh did i mention that my next door neighbor with the 4 kids who is always so friendly steals anything not nailed down! Now he stays off my property: mostly.Running the wirea is the big pain: not hard, just takes time. You can even run them into the house through a window though it's Better to drill a hole, say where the cable tv comes in.Mike K", "Date": "October 26, 2012"}, {"Title": "Horrible", "Author": "TreyJ", "ReviewID": "R6NOJK06ZRSW6", "Overall": "1.0", "Content": "Ordered two, Sent one back immediately after tying to mount the other camera. mounting was a pain. left the first one mounted and within 2 weeks it was full of condensation.", "Date": "September 26, 2012"}, {"Title": "Product is okay.", "Author": "Frederick Scott", "ReviewID": "R4RBGG1I9AQM", "Overall": "3.0", "Content": "Do not expect too much from this product.  If you are trying to look at a long distance this is not the product for you in my opinion.  But if you are protecting something that is far away you may want to look for something else.", "Date": "September 23, 2013"}, {"Title": "700TVL ??? I DON't Think so...", "Author": "rnyproduction", "ReviewID": "R12196UEXVMX0U", "Overall": "1.0", "Content": "Bought this you because I wanted to try higher TVL camera around my house.  I have currently a 600TVL camera and I have to say  this production is not a TVL 700. False advertisement.  They should rate this for 400TVL.Although the casing was pretty good.  Not a good product to buy..", "Date": "July 2, 2013"}, {"Title": "Disappointed", "Author": "curt", "ReviewID": "R2ZEVJVRVXHJGR", "Overall": "2.0", "Content": "The daylight picture quality is fairly poor. I identify who a person is within 4-5 feet, but not much further. With respect to the nighttime picture, the \"clear\" viewing distance is even less.", "Date": "May 9, 2013"}], "ProductInfo": {"Price": "$499.95", "Features": "Built-in 1/3\" SONY Effio CCD, Color DSP, Automatic CDS sensor\n700 TVL high resolution. NTSC System\nBuild-in f 3.6mm Lens for wide view. Build-in 28 IR illuminators for night vision\nWeatherproof aluminum housing construction\nPackage included: 1 x CCD camera, 1 x power supply, 1 security warning Decal", "Name": "VideoSecu 700TVL Day Night Outdoor Security Camera Vandal Proof Built-in 1/3\" SONY Effio CCD Wide View Angle Lens 28 Infrared LEDs for CCTV DVR Home Surveillance with Camera Power Supply and Security Warning Decal 1PA", "ImgURL": "http://ecx.images-amazon.com/images/I/51WEYq64ngL._SY300_.jpg", "ProductID": "B001RZAXYA"}}