{"Reviews": [{"Title": "Fun for you toy camera maniacs", "Author": "lightfusegetaway \"I like your photographs\"", "ReviewID": "R36H34O0XA3V39", "Overall": "3.0", "Content": "You might call it a cheap piece of junk, but then you might have expected this to be a real camera. I have seen numerous copies of these cameras and they come under all kinds of weird brand names, but they're all about the same - and they have some potential if you love toy cameras like the Holga or Diana. It's cheap enough that you could buy it, modify it, and start cranking out some wild photos. Plus it has a waist-level viewfinder and takes 35mm film you can get developed at the local drug store. Expect image quality in line with the above-mentioned toy cameras.", "Date": "April 2, 2011"}, {"Title": "Do not buy", "Author": "mrjim", "ReviewID": "R31AZD15YH5MA", "Overall": "1.0", "Content": "I bought one of these cameras and found it to be pure junk. Do not waste your time and money. Take it from me its not worth the effort. When I tried to return it they didn't want it.", "Date": "January 18, 2011"}, {"Title": "this is an evil little rip-off", "Author": "A. Alper", "ReviewID": "R2BLKQ79OD38JZ", "Overall": "1.0", "Content": "Well, Olympia ain't Olympus, for one thing, it has a fixed lens that is made of plastic and a hunk of lead to make it feel heavy.  These were oringinally invented to use in a Chinatown scam, where a little guy ran up to you claiming to have brand new SLRs for cheap.  It is true that they can take wacky pictures, but so can a holga.  you can get them at the salvation army for 2 dollars, don't buy it new.", "Date": "November 22, 2011"}, {"Title": "Would have been a fun addition to my plastic camera collection", "Author": "Mira", "ReviewID": "R3T2U9NENRFKKZ", "Overall": "2.0", "Content": "I bought this camera to add to my plastic camera collection primarily because it has a flash. I was also excited about the auto-rewind. It's focus free, like my other plastic cameras, which i love. It is big, and from a distance almost looks professional. Would make a nice cheap camera to travel with, perhaps. However, when I received mine the flash did not work. I put in brand new batteries, be assured. There was no tell-tell soft whining noise to indicate it was cycling. I even loaded some film and tried it out, to no avail. I had to return the camera.", "Date": "August 16, 2011"}, {"Title": "fake", "Author": "nellikins", "ReviewID": "R37AR6XQA69Z55", "Overall": "1.0", "Content": "these cameras are frauds. Not your fault, probably didn't know. They made a bunch of these under popular names. They are worth about 5.95. I this exact one and found out it was a fraud. Still takes pictures, but nothing else special. Just pictures. :-)", "Date": "October 21, 2011"}, {"Title": "Holgas are a whole lot better", "Author": "Mr. Higgle-Piggle", "ReviewID": "REVGEL3OGB6H4", "Overall": "3.0", "Content": "I bought this used at a thrift store for $10 and that night if fell apart in my hands.  Still I could tell the cheap quality.  The real reason I give it 3 stars is because the case has been a life saver. When I didn't feel like carrying my whole kit around with me, I'd load the little case with \"one\" of my cameras and it's accessories and tote that along.  But if you get one that works it will likely give you Lomography style pics.  What ever you do with the camera, keep the case... it's wonderful for light-load romps.b/b)O(", "Date": "October 5, 2011"}, {"Title": "Trash - designed to con the buyer.", "Author": "Kevin C", "ReviewID": "R28DX7FWV6C0J", "Overall": "1.0", "Content": "Don't be fooled - it is designed to LOOK like a camera with all kinds of features. It isn't. Cheap plastic toy camera, fixed plastic lens, lead weight inside to make it seem heavy. I got fooled into buying one. The flash worked on mine (although the trigger voltage was well over 200 volts so it would be \"bad\" to connect it to any digital camera).  Threw it all away, although the bag was not bad - I kept that.", "Date": "November 6, 2013"}, {"Title": "Returned", "Author": "Maryann Willis \"Max's Lady\"", "ReviewID": "R235RJIRBPSS2R", "Overall": "1.0", "Content": "I returned this item as it didn't work.  If I remember right the flash attachment didn't work even after I put in new batteries.", "Date": "August 1, 2012"}, {"Title": "Brand NEW OLYMPIA DL 2000A Camera", "Author": "Robert A. Axley \"Lost John\"", "ReviewID": "RKQG7797M9QWS", "Overall": "5.0", "Content": "Nice Fool Me OLYMPIA Brand NEW Olympia DL 2000A CameraLook Like A Olympus Camera Neat Camera For The Price It A Little High .It Works I Kind Of Like It. But They Should Put Up That It Not A 53mm Olympus But A Look A Like Not The Real Thing.I Give Them 5 Stars Fool Me Once Shame On You Fool Me Twice Shame On Me. Have Fun  If You Buy The Camera Will Post Pictures Soon A I Can. Lower Your Price Please.", "Date": "August 19, 2011"}, {"Title": "yes", "Author": "C. White \"cwhite\"", "ReviewID": "R3JJ8IH81D01X1", "Overall": "5.0", "Content": "Everyone needs  one and shipping was as promised, quality is as stated, and Amazon is the place to find whatever you need one stop shopping!  I love this vintage piece.  Shipping was as promised!  It was a gift so not sure if it worked okay but I assume so because no feedback otherwise.", "Date": "January 19, 2013"}, {"Title": "Replacement", "Author": "Deborah A. Rinetti \"GREAT GRANDMA\"", "ReviewID": "R1M29ZGYKOPMFY", "Overall": "5.0", "Content": "I currently had an advantage camera system and could not locate film for it.  Was on Amazon and saw this 35mm and gave it a try.  Was amazining surprised when I received it  did not expect it to be of the quaility it is for the price.  Will enjoy for many years to come", "Date": "December 30, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001D4PAL6"}}