{"Reviews": [{"Title": "Excellent Camera Server", "Author": "electronics guy", "ReviewID": "RH80964P77WAJ", "Overall": "5.0", "Content": "I bought this on a Gold Box deal and am very glad I did. First, the image quality is superb. TRENDnet supplies software to assist in setting up the camera but people with a bit of technical experience can go straight to the web interface and set things up there and there are some great features that allow you to set this camera up pretty much however you want.All of the camera settings are configurable - brightness, contrast, saturation, frame rate, resolution, and even settings to synchronize with 50 or 60 Hz lighting or outdoors. It also supports WPA2 encryption and three levels of password-protected access. You can have it grab images based on movement (requires accessing the camera with Internet Explorer to configure that for some reason) or on a time schedule, and either have it e-mail the images or ftp them somewhere. And it supports dynamic domain name configuration so you can access the camera even if your IP address changes.It also supports time and date stamping the images - pretty much a necessity - but it also supports accessing an NTP server to make sure the onboard clock is accurate.And once you get the camera all set up the way you want it, you can save out the configuration file to make it a snap to reconfigure it in case you ever do a hard reset that restores all the defaults.Not that it will matter to most, but this camera server is actually a full ARM-based computer running Linux. If you go to the TRENDnet website, besides getting the latest firmware, you can also get the source code for the camera OS for those that want to tinker.The final issue is just the value. You are getting a video camera and a web-serving computer with both wired and wireless interfaces for this price. I'm glad I got mine and am using it to monitor my front porch for visitors and also as a way to monitor the weather at home. With multiple cameras, it's easy to monitor all sorts of things if someone wants to.", "Date": "July 25, 2008"}, {"Title": "Mac users should not fear this camera!", "Author": "RocketRancher", "ReviewID": "R1FHOIBVO6VBPR", "Overall": "4.0", "Content": "I bought one of these cameras, knowing that it was claimed to be reliant on active-x for the video stream, but my Mac-based application could work around that.  My early experiments at setup and use were with Firefox and, as expected, the live video wasn't available.  I went thru the setup and put it online and then went to a different machine using Safari (v3.1) and lo and behold:  It streamed the video using an ultracam.jar applet.  I troubleshot the Firefox installation and found an incompatibility with /library/internet plug-ins/javaplugincocoa.bundle.  Once that plug-in was removed, the video stream worked under Firefox with the same ultracam applet.  Also tested successfully with Opera v9.62.Wireless setup and performance are nominal and straightforward, as are the function with DynDNS and emailed events.  One must remember that the default IP address of the camera is probably not in the same non-routable range as most use with their LANs.Mac users should not fear this camera.  Sporting features like the NTP clock & timestamp, DynDNS, and price make it a really nice deal.", "Date": "December 11, 2008"}, {"Title": "IF YOU'RE STILL STRUGGLING - PLEASE READ THIS !!", "Author": "cadblu", "ReviewID": "R2XMRG1IR4DZ12", "Overall": "5.0", "Content": "My first suggestion; leave yourself plenty of time. This will not be accomplished in five minutes.  However, I would suspect many of you reading this column are mighty frustrated by now, and are looking to the reviews for assistance.  Fact is you will learn more from these reviews than from tech support!  Here's how to set these cameras up (I have four!)  TRENDnet Wireless Internet Camera Server (TV-IP110W)Step 1.  Lose the disk and the instruction manual. They are of little use.Step 2. Enter the [...] website, find your camera in download section.Step 3.  Download and install SecureView and IPSetup.Step 4.  Power up the camera and install the ethernet cable to your router.Step 5.  Load IPSetup and find your camera, double click and enter the setup program.Step 6.  Select static IP and record the camera number, configure your settings.Step 7.  Hint! for email notification, ping your mail server and enter the numeric IP.Step 8.  Hint! select this NTP time server for your camera <64.90.182.55> otherwise the camera will forget the  time each time you unplug it.  This is a pain to reset! Make sure you enter your correct timezone, e.g. GMT -5:00 for Eastern US Time ZoneStep. 9  Port forward your router using the router setup routine.  Just do a google on port forwarding!Step 10.  If port forwarding doesn't work, select another port, e.g. default port '80' did not work for me!Step 11.  Hint! You don't need SecureView to capture and email images!  Just enable motion detect on the setup screen.Step 12.  To make sure you can view cameras from a remote location, use a laptop and connect to an unsecured wireless connection, enter \"[...]\" and record your IP address.  Now enter your IP address e.g. [...] where the numeric string is your IP and :80 is the port you forwarded under steps 10 and 11.Step 13.  Hint!  Do not try to view camera images on your desktop and wireless laptop at the same time!  You will lose connectivity to your IP Cam!  Each Camera must have a unique port!Step 15:  Sit back and enjoy the view!PS. Trendnet offers Excellent technical support.  They are open on New Year's Day and were extremely polite and helpful.", "Date": "January 1, 2010"}, {"Title": "What's with the WLAN?", "Author": "Hans-Joerg Mueller", "ReviewID": "R3KX22BND0ZB3A", "Overall": "3.0", "Content": "Install and set-up went OK, test position close to the WLAN router went OK.Installed at the intended location the \"W\" started to act up within a day, unplugging and replugging would get it back to work for a few hours.Then it quit, won't even do \"W\" mode when close to the router. Works just fine when on the wire.Reading a few of the other \"trials and tribulations\" I think this one will go back. ;)  :)Update on the above:I obtained a RMA from the seller and a replacement (naturally it's \"pay up-front\" for that! ;)  :) ), but then decided that there had to be a solution to the WLAN problem.There sure was: get EVERY ONE of the settings correct and it works. That includes ALL the Wireless settings including the encryption i.e. if the router is set to HEX make sure the cam settings are in HEX too! The other pit fall: correct channel! for some strange reason the channel setting will revert back to the default (6) unless one sets the channel, selects mode as \"ad-hoc\", then \"apply\". After the \"Apply\" go back and reset the mode to \"Infrastructure\". The channel setting finally stayed!Next project will be getting the focus as clear as possible for the outside, the reviews keep mentioning the excellent picture quality ... not so far! ;)  :)", "Date": "October 6, 2008"}, {"Title": "Verizon DSL installation help & hints", "Author": "David A. Lechner", "ReviewID": "ROVNRPCUHM9T4", "Overall": "4.0", "Content": "If you are going to use this on a remote property or location, here is a lot to help you  -1. Get some cheap sunglasses,break it, and tape one of the lenses over the camera to use it on the outdoors - it is really designed for indoor use & low light - a light sensitive and polarizing filter or sunglass is best -2. Do call Tech support for help - they are great !3. You need to know the IP address of your home ROUTER to enable people far away to look at this over the internet - and unfortunately that IP address is assigned by your Internet Service Provider (Verizon or Comcast for many of you & me too!) . and ... they change that address and give you a new one occasionally.  Normally you can get that from the main screen when typing 192.168.1.1 into your browser and an info page will provide you the 4 numbers you need.4. You also need to make sure that the router has \"Port forwarding\" enable for port #80.  This is a default mode on some routers - not for others.  Logging into the router control panel will have a page somewhere that lets you enable this if need be.  Ignore this step and test - might just work (mine did!).  For multiple cameras they each need to be forwarding on different port #s... 80, 81, 82, 83.... and the router needs to enable all of those ports to be forwarded....5. Once you know the IP address and enabled port forwarding, call a friend and have them put the IP address into their browser as an address - and add \":80\"  (or other numbers for multiple camera situation) into the browser - that should let them see you or your view !!  Note that they need to have Java and ActiveX installed and allowed in their browser !!6. As an example - making up the numbers here - if your router says the IP address is XX.yyy.ZZ.AA then you would put [...] into the browser - then put in the username and password for the camera - and viola - it works !!7. Note that if you power down the router, reset it, or if Verizon or Comcast does some maintenance work, the IP address #s change - so you need a way to get that data when needed!  (I'm still working on that - it'd be nice if you could get it email'ed on demand from your ISP.....)Have fun - great camera otherwise (this imnprtant info above was not in the help or Tech doc CD I got with the cmaera!!", "Date": "December 27, 2009"}, {"Title": "OK camera, bad software", "Author": "Snowstorm", "ReviewID": "R3C5HZ80OSXDML", "Overall": "3.0", "Content": "I bought two of these cameras two month ago. The product itself is OK if you plan to use it in a small room. The quality is mediocre for objects located over 20 ft. away, and the objects seem to be much further away then they really are. The software for this camera (SecurView) is very unstable and I could not set up e-mail function to work properly. I also use IP201 camera from Trendnet, and that one is sold with IPViewPro software. Neither TV-IP110 works with IPViewPro, nor TV-IP201 works with SecurView software, so it's a one big mess. Using my basic HTML skills I ended up creating a web page that I run from my PC to see all my cameras (two TV-IP110, one TV-IP100, and one TV-IP201) on one page. Also, I had to buy another program (Active Webcam) to manage my cameras without headache. Again, the focus in very poor on anything over 20 ft away.", "Date": "November 17, 2008"}, {"Title": "Exceeded my expectations for the price", "Author": "Edward Gaudette", "ReviewID": "R14ASXAKMAWUEE", "Overall": "5.0", "Content": "The TRENDnet wireless Internet Camera (TV-IP110W) exceeded my expectations so much I now have a total of 5 of them. I bought these to monitor a second home from my first.  The setup was very simple and flawless. I admit I'm a geek so the typical non-geek might have a problem with the over-simplified documentation. The camera's settings let me easily set them up for indoor/outdoor monitoring etc. Unfortunately, I did have a problem that when power is lost, the camera gives up trying to find the wireless network, prior to my wireless becoming available. This meant needing to reboot the camera manually. Because I was remote I was unable to do so.  I installed X10 power models on each camera so that now I can remotely power the cameras on/off as needed remotely.  I've had the cameras installed for 6 months now and they have performed beautifully.", "Date": "May 17, 2009"}, {"Title": "Works as advertised; great camera for the money", "Author": "Andrew Arnold \"Mac guy\"", "ReviewID": "R6GIHKAL9NRGG", "Overall": "5.0", "Content": "I bought two of these cameras and set them up inside my home after several houses in my neighborhood were burglarized. I own mostly Macs and I am using the excellent EvoCam software by Evological to manage the cameras and allow me to view them via the web on a single web page. This software allows for more flexibility in responding to motion detection. For example, using an AppleScript I can queue intimidating music on my home stereo. One of the cameras is hardwired to my Time Capsule. The other is connected to an Airport Express (also used for AirTunes). These cameras do not offer good quality images in low-light conditions, however, motion detection still works very well, which is all that I need. One of the reviewers essentially complained that Trendnet was not able to help them configure their home network for them. You cannot expect a company that sold you a budget camera to then provide you with IT training. If you don't know the difference between a LAN and a WAN or what a port number is, then hire your son's techie friend to install these for you.", "Date": "May 1, 2009"}, {"Title": "Works with Iphone and cam-viewer app", "Author": "Lisa J. Browning", "ReviewID": "R2JCT8K10D5T9G", "Overall": "5.0", "Content": "I bought this wireless camera for $69.99 on sale through amazon.  It has crystal clear video and works flawlessly.  I can't imagine why anyone would spend more money or say anything negative about this camera.  I use it to view my dogs during the day and am able to use it with my iphone.  There is an itunes application called cam-viewer that works great with this camera and the iphone.  I highly recommend this camera.", "Date": "January 18, 2009"}, {"Title": "Decent Camera, Though Wait For A Sale", "Author": "Abe Lincoln", "ReviewID": "R3I99O6IW1M2Z2", "Overall": "2.0", "Content": "I have 4 of these cameras (2 wireless, and 2 wired).  They work great for keeping an eye on my house while I'm away.  They were easy to install and configure, though I do networking for a living so if you're not familiar with setting up your router, you may struggle a bit.  The camera provides an average picture quality - not great but not terrible.  The video could definitely benefit from being sharper, and the built-in focus adjustment doesn't help much. I also wish the viewing angle was wider, since I find it doesn't capture the whole room, and I have to pick and choose what I want to see.Aside from that, it's not a bad camera for the money, but I got them on sale when the wired versions were $50, and the wireless were $70 each (even less after rebate).  It's currently listed at $99 each for the wireless with no rebate, and at that price, I'd recommend you look into a Foscam or similar camera.  For $99 or a bit more, you can get a camera that has built in IR lights for night vision, and a tilt/swivel, so you get a lot more camera for the money.  Also, if you buy this camera with a rebate, beware that Trendnet will screw you if you buy more than one - they wouldn't honor the rebate on more than one camera (even though the claim form said they should), and I got stuck paying a lot more for the cameras than I thought I would in the end - their customer service is absolutely terrible.", "Date": "October 23, 2010"}, {"Title": "Works great but a bear to configure", "Author": "Darnell Wiley", "ReviewID": "R2LK832G742OCV", "Overall": "4.0", "Content": "I bought this camera to replace a Linksys WVC54GC that I had for 3 years.  The Linksys never did work correctly.  (I could only get the e-mail alerts if I said \"no video\". But it DID make the video.  I ended up writing a batch file that sent me any videos it found once a minute.  But the number of false alarms...JESUS!)  But it did give me peace of mind after my break in.The IP110 has WAY more features AND it cost less.  But ooohhh you need almost a degree in networking to configure it.  I exchanged a couple of e-mail with tech support before I got everything working.  The manual needs work.  I experienced the hanging and it losing the time when I was configuring it on my own.  But once everything was configured correctly, it has been trouble-free.Two notes for buyers:1. This camera sends photos, not videos.  Even the FTP just sends photos.  It will MAKE motion detector-triggered videos, but it doesn't send them.  I could use the batch file to send the videos like I use to, but the motion detector photos are fast and reliable.  I can connect to the camera remotely from work in less than 10 seconds.2. The manual talks about a Schedule Profile and a Motion Detector profile.  The Motion Detector profile is self-explanatory.  The Schedule Profile is used to have the camera e-mail photos constantly during a certain time period REGARDLESS of the motion detector. Not sure what the point of that is.But overall I am very satisfied.", "Date": "December 21, 2009"}, {"Title": "Excellent camera, I may get another one.", "Author": "Geckobros", "ReviewID": "R3SUSYKY5LP60L", "Overall": "5.0", "Content": "I was skeptical when buying this camera due to the negative reviews however the price was right so I figured I would roll the dice and hope the issue with the camera was not the camera's fault but the level of expertise the user has in IT in regards to setting up the camera.I am in IT and the terminology used was simple enough but realizing that not everyone is IT savvy, I would recommend the person installing the camera has a good understanding of their router as well as navigating the settings .. such as port forwarding and uPNP.  If these concepts are foreign to you or you have never tinkered with your home router then find someone that has experience and have them help you install the camera, it's straight forward and simple to do with basic \"home user\" IT knowledge.  Perhaps this is not necessary if you are comfortable with calling tech. support.  I did not call them so I cannot comment on the type of service you will get but reading through the reviews it seems like they are helpful and patient.If I recall correctly here is what I did..  It took me approximately 45 minutes with the hardest part being on my part in determining where I wanted to mount the camera and actually mounting it in the \"odd ball\" location I decided on.1) I followed the manual's instruction to plug the camera in to my home router with an Ethernet cable (it's wireless but for initial configuration you have hard wire it)2) From a PC that was also connected physically to my router I inserted the CD that came with the camera.3) The camera was found and I used the configuration software to change the cameras IP address to be in the same subnet as my home network.4) I unplugged the camera and set it aside (The manual gives you the step by step but I believe I had to unplug the camera for 10 seconds as well after setting it up).5) I then opened a web browser and created a port forwarding rule that points my external address and port to the camera inside of my network.Note: (For remote viewing, IE from the office or on the road) You will want a static IP on the outside of your network -- this too is explained in the manual.  It shows you how to determined if you have one and if not how to get one.6) I then tested with the included software to see if I could connect to the camera from my inside network.7) While at work I used my external IP address and Port to attempt to connect to the camera from the outside world.  I do not use the included software to do this, the camera includes its own web server.  The software would come in handy if I had more cameras to display but for now, I do not use it so I cannot comment on how good or bad the software is when viewing from the outside world or multiple cameras.I have had the camera running for about a week+ now.  Initially when I configured the camera I used uPnP to set the camera up in my router.  For whatever reason, my router and the camera didn't play nice when using uPnP.  The uPnP setting was gone in my router after the second day thus cutting off access to the camera feed from the outside world.  I then corrected this by disabling the uPnP functionality of the camera and making a static port forwarding rule in the router.  So far the camera hasn't had any issues reported by other users.  I am using both the web interface remotely and a free Android app from my phone to view the camera and no issues that I can blame on the camera.The Android app is called IP viewer lite.  I believe the same author has it available for Ipad and Iphone but there is no free version I could find for my Ipad.My camera I received is on firmware 1.1.0 build: 93.My router is a Linksys router running tomato firmware.If this thing stays solid for a month I will be buying a couple more cameras.  Right now the wife and I use it to watch our dogs that are penned in our garage.  One of them was escaping and we didn't want to come home, open the garage and have him run around and terrorize the neighborhood.  I would like to put one outside but I am not sure how sturdy this camera would be in cold weather... that will be for another review I guess.  The picture is pretty good.  It doesn't give a lot of detail if you have the camera far away from the subject but the detail is certainly enough to keep an eye on your home and such.  The camera is useless without good lighting though.. keep that in mind.UPDATE: 1/18/2011.I have been running this camera and checking it daily and no issues at all.  The camera has not needed to be rebooted since I set it up.. it just chuggs along.  Thank goodness too, I mounted the camera in the ceiling of my garage to keep on eye on a mischievous dog that is penned there while we are at work.I also changed my router.  I wanted a router that worked a little better with my Ipad so I purchased a CISCO E3000 and am running the latest firmware as of today's date.  There was nothing I needed to do to the camera.  In the new router, I port forwarded to the camera and everything has been rock solid.  I am seriously thinking about buying another one of these cameras for the front porch.  The only concern I have is the temperatures get below zero and I am not sure how much this camera can take in regards to temperature.  I would also need some sort of an enclosure to protect it from rain and snow.  If I decide to do this, I will update.  Again, just glad to report that this camera has been rock solid out of the box and I am not afraid to recommend it.", "Date": "December 22, 2010"}, {"Title": "For the price, this little camera does a great job.", "Author": "Just Al", "ReviewID": "R21V4JM0U2FBKU", "Overall": "2.0", "Content": "REVISED 3/21/2011 - Purchased a total of 3 of these.I had to reset them about every 3 days (unplug, count to 5, plug them back in) or they'd just crash and sit there. But over time, one by one, I hard to start resetting them more frequently. (Daily, then morning and lunch...) Now, they all crash within minutes of a reset. Was a good little camera when it worked, but plan on buying something new within a year...REVISED 2/5/2010 - Operator error has now been resolved.I was looking for was an IP camera that could detect motion and then capture a still image every 5 to 10 seconds until that motion ceased. The included SecurView software doesn't allow you to capture a single image, but it will allow you to record a short movie when motion is detected. (You can apparently specify the maximum size of the movie file). Alas, Linux is the only OS that I run 24/7 in this house, and SecurView only runs under Windows.Someone here said that they got this camera to work with ZoneMinder (ZM) which runs under Linux, but I was not successful. (Apparently, there is a kludge you can patch into ZM to skip some extraneous garbage the camera injects into the video stream. I'm looking for something with a smaller foot-print than ZM, so I never tried that patch. BTW, the URI for video is /cgi/mjpg/mjpeg.cgi - don't hit that with your browser though). You can get an image from the camera into a browser by hitting the camera with the URI /cgi/jpg/image.cgi. But ZM didn't like that either, even using the username:password@host/URI format. (Rumor is that the camera is either missing or generating invalid HTTP headers so ZM can't handle it - and sorry dude, it's a TRENDnet problem).I didn't have any trouble getting wireless networking going, WPA2-PRS using AES, (thanks to someone else here who explained the work-around for setting the channel number).  I did have to barrow a laptop running Windows to do the configuration. :-\\ (The configuration software is browser based, but it requires an Active-X control to do video streaming -- in order to set up motion detection in the camera -- so you have to use MSIE - as advertised). But the configuration user interface (in the camera itself) is feature rich and I thought that I'd died and gone to Linux heaven. (The camera itself is actually running Linux, hit the URI /cgi/systemlog.cgi for the camera's syslog).You can specify an NTP server to get date/time at camera boot. You can turn off the LEDs on the front of the camera. You can time-stamp the video/images. You can create user accounts (on the camera) with unique passwords. You can configure an FTP 'event server' (active or passive) to which you can upload snapshots while viewing live video, You can give the camera a name that it uses as part of the path name to where it uploads images via FTP. (Also includes the date). You can configure motion detection (in the camera) using two adjustable portals within the view, and FTP those images to your FTP server. You can configure an EMAIL server for the same reason - I didn't try it, someone else says here says it works. You can specify 'schedule triggers' (based on specific days and times) and upload snapshots to your FTP or EMAIL server. These are all configuration items within the camera.Be aware that there are other issues with this camera. Motion detection (in the camera anyway) appears to be based on changes in the ambient light. (I get lots of false detections at dawn and dusk). Night vision isn't great - street light alone isn't enough. The rumor is that the camera crashes every couple of days too. (Someone posted a work-around for that however: they just invoke the URI /cgi/restart.cgi every midnight to reboot the camera -- and I presume that this person is also running an NTP server, to reset the date/time in the camera.) And, I wouldn't call the software configuration in the camera all that 'intuitive'.Windows users should be very happy with SecurView, which definitely allows you to watch real-time video and supports multiple cameras. SecurView can definitely detect motion and capture movies when motion occurs. (Over a wireless network, I don't think that you'd be able to monitor more than 3 or 4 live feeds).If you want to use this camera under Linux, (to watch live video) you can apparently get ZoneMinder working by patching and compiling ZM yourself. Or, just use schedules and motion detection to FTP or EMail snap-shots up to your server. The 640x480 JPEG images take up about 40K per snap-shot.For the cost, this camera does a terrific job. And now that I've figured out how to use it, I'm going to buy a couple more for home security usage.", "Date": "August 10, 2009"}, {"Title": "Horrible tech support", "Author": "H. Ngo", "ReviewID": "R1I1TIW1NOSU0S", "Overall": "1.0", "Content": "WPA encryption does not work!  Tech support is non-existent and if they can't figure out what's wrong, their solution is to tell you to return it.  This will be my second unit and WPA still does not work.  It is currently flashed with the latest firmware (Build 8.0).  The only way to get it to work is with an ethernet cable or WEP.  Other than that, everything is pretty much solid.Things I've tested:-Motion works fine, but it goes off intermittently.-FTP works as stated-SMTP Email works.I am givin this product a poor rating due to:1.  Poor tech support - reps NOT knowledgeable and don't respond if they can't figure out a solution.2.  Instructions and manuals are junk.3.  WPA does not work4.  Time consuming (due to all of the above) if this is your first setup.", "Date": "January 15, 2009"}, {"Title": "Quite Mac-friendly, but needs Ethernet for setup", "Author": "Civiltongue \"Dave\"", "ReviewID": "RH2TEQKZVZ8LS", "Overall": "5.0", "Content": "I'm very happy with this device.  It does what I need quite well, plus a whole lot more that I may use someday.  I'll likely end up buying more of these.I was initially concerned about the fact that the setup seemed to need Windows.  It turned out that wasn't the case.  However, for either Mac or Windows, the initial setup has to be done over Ethernet -- and my network is all wireless.  Fortunately I still had an old wired router.  I used it to set up an Ethernet LAN with my MacBook and the Trendnet camera.  Then I logged onto the router to find the camera's IP address, and used that to log onto the camera directly.  I entered the wireless network information, rebooted it, and it immediately found the WLAN.  I put my wired router back on the shelf and haven't needed it since.I have a reasonable level of network expertise.  For someone who doesn't, and/or who doesn't have any access to Ethernet, you will need some help with this product setup -- after which I think you'll be well satisfied.As I've come to expect, the Amazon ordering and shipping experience worked well with this product.  I'm a happy camper.", "Date": "April 25, 2010"}, {"Title": "Stops working after several minutes", "Author": "Richard Reich", "ReviewID": "R19JUIFGZLSDQZ", "Overall": "1.0", "Content": "This item is not easy to install.  When I finally got it properly configured, it would run for several hours then simply hang.  Now, it will run for a few minutes and then disappear from my LAN, clearly hung.  Unplugging/plugging restarts it, and it lasts for another few minutes.  Trash.  Back to Amazon.", "Date": "February 25, 2010"}, {"Title": "Good for the price", "Author": "K. Waters \"gamr\"", "ReviewID": "RH05SCS46W1YV", "Overall": "4.0", "Content": "I agree that the quality is not 'that' great, but i'm not sure what people are expecting at this price range. All I wanted was something to allow me to keep an eye on the inside of my house and my animals while I'm at work. This fits the bill fine at a very affordable price. I have one very long room that the camera works much better for, in the smaller room where i have one, it's tough to position the camera to get a good view of the room, so I can only get a portion. May want to consider something else if it's a fairly small space.", "Date": "March 25, 2009"}, {"Title": "Hmm... verdict still out", "Author": "Mark Jt Payette", "ReviewID": "R22D9XR6MTD3XV", "Overall": "3.0", "Content": "Got it to work on the wire (network cabling) but I am having problems getting to work on my wireless network... Did a firmware update but still no luck....It works great on the wire and has some pretty cool features... Since the wireless does not work yet, have not been able to deploy it in my garage for security... May just need to pull a network drop out to the garage...", "Date": "September 3, 2008"}, {"Title": "Frustrating for Mac Users", "Author": "Martin Chorich \"wahnsinnig\"", "ReviewID": "R3CCLCE4QT1Y9K", "Overall": "2.0", "Content": "I bought this on the strength of a review that claimed Mac OS users should not fear this camera. More accurately, Mac programmers should not fear this camera. Ordinary mortals should stay away.  I'm sure it would be a very nice device if I ever could get the damned thing to work. Having the read the documentation about a Windows set up Wizard on the installation disk I lowered myself to borrow a Dell from the office, put on some rubber gloves and proceeded to ruin a perfectly good Sunday afternoon. Set up might have been easier on a ghastly slab of Windows, but it quickly got into the usual arcanum of IP addresses, MAC addresses, subnets and other Internet bafflegab. I know the CSs and EEs out there are snorting with derisive pleasure at my predicament, but I wanted a camera, not a reason to sign up for night classes at the local community college.", "Date": "October 12, 2010"}, {"Title": "Fantastic Product, Once You Figure It Out", "Author": "Buck Dossey", "ReviewID": "RG3W4LAF6A1X9", "Overall": "5.0", "Content": "Admittedly, it took me a bit longer than I had hoped to get the wired camera server working exactly the way I wanted it to.  However, now that I have figured it out, it is absolutely MORE AMAZING than I had even hoped.Installation was pretty easy, but what I didn't realize at first is that this camera doesn't need you to install software on a host computer on the network. It is completely independent from any host software, which makes it really, really cool. No bloatware here.Just log into the camera's IP address (default user and pass is admin/admin), and start configuring.  One of the great features of the camera is that it lets you draw red boxes on the viewing area to set as trigger areas for an event.  If it detects motion, an event is triggered.There are two types of events - FTP and email.  That's right, this camera does off-premises data storage and communication, out of the box.  I have a personal website hosted on Go-Daddy that I upload images from this camera to, kind of as a historical record. It automatically categorizes the photos by date in a specified FTP directory \\ date directory.For the email event, it took me several hours to get it set up. If you're trying to set it up, save yourself some time and create a [...] email account - you'll need it.  You need to know a little bit about outgoing SMTP servers, and if you've ever set up Outlook to connect to a personal domain's email, then you have enough of a skill set. One drawback is that it doesn't use SSL, so using Gmail or Yahoo! Mail's SMTP servers isn't in the question.It took me a while, but check out [...] for an SMTP server that doesn't require SSL. This should be the answer you need to get emails sent to your personal email address.All-in-all, this is a really, really powerful device.  You don't need any other devices on your network other than your router/modem, which means that during power failures / resumes, the device will automatically boot back up and start working once it has power again (no babysitting a host PC).  It's also really comfortable to know that anytime someone comes within the motion detection zone (configurable red boxes in the viewing area, mentioned above), I get a series of still photos within 15 seconds in my inbox, which my phone let's me know have just arrived.  It's like paying someone to watch your home, that also emails you what they see when something changes.  Really, really cool.  Highly recommended.", "Date": "March 6, 2010"}, {"Title": "Beware of Motion Detection alerts", "Author": "E. Gal", "ReviewID": "R1NCC6JO94YNQO", "Overall": "4.0", "Content": "Installation is straight forward and intuitive (It's even easier if one got computing and networking savvy). If you sign up for one of the Dynamic DNS services which are available on the net, then a static IP from your ISP is not required. However when I activate motion-detection email alerts, the camera tends to hang frequently and a reboot is necessary. When motion detection is disabled, the hangs go away. Same thing applies to a 212W model which I also use. Guess Trendnet were short on cash when it came to choosing CPU components for their cameras.", "Date": "August 30, 2008"}, {"Title": "Defective", "Author": "JJ", "ReviewID": "RGZKGLDLS7D66", "Overall": "1.0", "Content": "I tried multiple times to change the ip address with their software but it would not find the camera most of the time. It appeared to finally change the ip address but the computer would never recognize the device.This is the second TV-IP110W I have purchased. The first one worked great and the model IP-501W that I have works great.I returned this one. Amazon took care of the return with no problem.", "Date": "September 8, 2011"}, {"Title": "Good low-priced internet cameras", "Author": "Lyle Johnsen \"Bud\"", "ReviewID": "R1AILJEVJISZMP", "Overall": "5.0", "Content": "I have 3 different types of TRENDnet Wireless Internet cameras on-line 24/7.TRENDnet TV-IP422W Wireless Day/Night Pan/Tilt Internet Camera Server with 2-Way Audio  (Version A1.0R) They are very reliable and should meet the requirements of most home security applications.  Most users, however, will require some technical support to get their first internet on-line and fully functional.  Internet operation may require the user to set up an account with [...] or an equivalent service.", "Date": "November 9, 2009"}, {"Title": "trendnet internet camera", "Author": "J. Murphy", "ReviewID": "R7W5D6321X9RG", "Overall": "5.0", "Content": "Received and installed the software. Since I have a dynamic IP address (most of us do these days) I went to [...] and got a static address. Then ran the trendnet wizard and bam!...I'm on-line.  Really cool and easy. Glad I decided to try it...it was a lot easier than some of the other reviews would lead you to believe.  I would definitely buy another one.", "Date": "August 9, 2009"}, {"Title": "Problems", "Author": "B. Fong", "ReviewID": "R3VAFCEAO5Z3K4", "Overall": "1.0", "Content": "Had problems connecting to WIFI and did not accept WPA/WPA2.  Freezes often. Picture quality is pretty good when it did work. Software is not that friendly.", "Date": "April 3, 2009"}, {"Title": "no secure email support", "Author": "J.", "ReviewID": "R21DONL5UGWP9A", "Overall": "2.0", "Content": "Enjoyed playing with it - fairly simple configuration and setup, good image quality, lots of options to tweak.However, one option it does NOT have is the ability to use secure SMTP for email.  Since most public email servers (e.g. Google, AT&T;, etc.) require secure authentication for SMTP this means the only way you can have the camera email you when it detects motion is if you set up your own mail server and/or network tunnel.  Since this was the main feature I wanted - email notification and offsite storage of the images, I returned it.Oh well.", "Date": "October 12, 2008"}, {"Title": "Pretty good in good light", "Author": "Paul L. Moreau", "ReviewID": "R237S80B4PS2E3", "Overall": "4.0", "Content": "Pretty good camera.  Works fine in bright outdoor light or good indoor light.  Not very good in low light as to be expected since there are nor IR LEDs on it.  I've been using the with WiFi for 3 weeks now and so far so good.", "Date": "September 26, 2011"}, {"Title": "The worst I have ever used", "Author": "Tom Sellers", "ReviewID": "R1ZAH5781E1P92", "Overall": "1.0", "Content": "I should have heeded the other negative reviews. While I can log into it from ANdroid from a dedicated ANdroid IP Cam app, but not from a mobile explorer window in IE or Dolphin, and the image is OK in full daylight, that is the extent of the Pros. After 2 days and 6 hours of fighting trying to get the event server to use smtp server, no luck, it simply will not send email to any of the three SMTP server accounts that I am set up and authorized to use on one of various non SSL ports that they will accept. One of these same configurations has absolutely no problem sending alerts via Webcam XP, so it cannot be a problem initiated by my router or from my ISP's SMTP server. And, that is after the Firmware was upgraded to 1.1.0 build: 66.Once the light gets dim, you cannot see a thing. If you want to use it to surveil your porch, then you must set up a motion activated foodlight that points toward the approaching person from behind the camera, so factor the cost and installation of that light into the equation.And even if I did get past these stages, I have read in other reviews that the motion sensor algorithm to trigger an event alert do not work well enough to use them seriously. So another thing you can factor into your cost equation: some real decent software such as Webcam XP to use with this camera that will cost over $100.00. So perhaps this camera that you cannot use in DIM light, and will not send email alerts, does not seem like such a good deal anymore does it? Unless that is - you can buy it for $5.00, because that's all it's really worth withal.", "Date": "August 25, 2011"}, {"Title": "drops connection", "Author": "JAC", "ReviewID": "R34PZP1ZRS542X", "Overall": "1.0", "Content": "when it works, the picture quality is great, power consumption ~2-3 watts.after setting up the camera with the web interface it worked great for about 5 minutes then it lost its LAN connection from my router, cycling power fixed that problem but then it quickly lost its connection again.  I was able to get it to work for almost 3 hours continuously using the included Secureview software but upon closing the application the camera lost its LAN connection once again and wouldn't work until its power was cycled again.  The firmware it shipped with was a bit outdated so i updated it hoping it was a bug that TRENDnet had fixed, but after updating, the camera had the exact same problems.  This thing is Taiwanese garbage, a $50 paperweight. Granted, this is TRENDnet's bottom of the line IP camera but i still expect the thing to work without having to physically be next to the camera to reset it just to view the image.  The whole point of an IP camera is to view video reliably while your away.  I had read some reviews about the WiFi version doing the same thing but dismissed the warnings as wireless connection problems thinking a hardwired LAN is foolproof, well i was a fool for thinking that, i will never buy a TRENDnet product again.", "Date": "July 9, 2011"}, {"Title": "Works great, no SSL support", "Author": "Sneaky Wombat", "ReviewID": "R3RPWJ4GWK2NXX", "Overall": "4.0", "Content": "I purchased three of these and I love them.  They are pretty easy to get going and easy to use.  I'm not crazy about the java/activeX (depends on browser used) but oh well.  The motion capture works well to the point of being creepy.  The only thing these lack in my opinion is the ability to use SSL/TLS for SMTP auth sending. This is a deal breaker for sending email as a motion trigger, or on a periodic cycle.  Short of setting up your own mail server local on your home network, there isn't an easy work around.I use these to monitor my house while I'm on the road working.  I have my house for sale and the realty agents always seem to leave doors unlocked/wide open after showing the house. Not only can I watch them walk around in real-time, but I know exactly who is at fault when a door is left open because I have a picture with a time-stamp.  If you're looking for a remote monitoring solution that is cheap and easy to get going, this is it.Again, I really wish it supported SSL, but oh well.", "Date": "May 22, 2011"}, {"Title": "Not a bad camera but wish it could be viewed with iPhone", "Author": "Luan C. Do", "ReviewID": "R29UH16EF1IDEZ", "Overall": "3.0", "Content": "I can install this camera with my Verizon FIOS router in about 5 minutes.  This is only because I recently dealt with Panasonic tech support on installing 2 Panny BL-C230A cameras.  The knowledge I learned from setting up the Panny cams is transferrable to Trendnet camera installation.  I have no problem viewing the camera using Safari or IE 9 on a PC or mac.  However, I can't view my Trendnet cam using an iPHone or iPad.  Hence, this is a BIG minus.  There is no sound or tilt and pan, like the Panasonic BL-C230A, for example.  I can't get the Trendnet or Panasonic cameras to work with iCam app either.  But for the price of a GoldBox special, I can't really complain much.  Although it come with a decent mount, I would not pay more than $40 for this though.  I tried out the securview software and it is rated C- at best.  I still need to figure out how I can get e-mail notification, since gmail  does not support SSL.UPDATE:  The cameras have been rock solid so far.  However, I noticed that it does not handle bright scenes well.  The whole screen could be completely washed out by moderately bright outdoors scenes.  Also, the screw hole in the back for mounting the camera is positioned way too close to the antenna.  Hence, it is not possible to use standard camera mounts because there is not enough clearance for a a thumb-screw to fit on the back of the camera.  Although this camera seems to have many drawbacks, I think it's a great basic camera, especially if it could be bought at a discounted price.", "Date": "March 22, 2011"}, {"Title": "Great camera for the price", "Author": "drsuna \"drsuna\"", "ReviewID": "ROMDLTTZ1UP5X", "Overall": "4.0", "Content": "I bought this for monitoring my house and it does the job adequatelyI see quite a few people complained about the picture quality.  It's a cheap camera and it does it job well.If you want good picture in low light, get a camera with night mode.Eating up bandwidth?  Why set it at 30 fps?  3-5 fps is more than sufficient for monitoring.  You are not trying to make a movie here.Wireless is a bit slow on start up, and occasional freeze (~5s) and reconnected automatically.  I don't have to power cycle the device.  It has been running for a week without power cycle.For Remote viewing, any computer with IE will do - you will need to install an activeX when asked.  For iPhone, get a SecurView for mobile.  Remember to port forward in your router.  Here's how to you do it.Get the Mac numbers of the device and tell the router (DHCP) to assign that Mac with a static ip.  Assign a port in the device configuration page (I use 18000; default is 80; I don't use port 80 or 8080 as those are reserved for my WHS) and forward this port to the camera in the router.  Just to be sure, reboot the router and voila you can check out what the camera is seeing.FTP is a pain and you need to setup a FTP server,  I wish it has an option to save the image to a network folder.In other word, it does what it supposed to do.  Great value.If it goes on sale again ($40), I'll get a few more.", "Date": "March 20, 2011"}, {"Title": "FTP Upload Freezes", "Author": "Power User", "ReviewID": "R1RCGX2RWVGKGY", "Overall": "2.0", "Content": "I set up 3 Trendnet IP cameras (2x TV-IP100W and 1x TV-IP410) to perform a FTP upload of pictures when motion is detected and after a set time period. I noticed that after a few days (approximately a week), the camera would stop uploading the pictures.The TV-IP410 was worse - it would freeze up consistently after uploading 27 pictures. The TV-IP110W fared better, but it would eventually stop uploading. Since the cameras are at a remote location, it was a real hassle getting someone to perform a power reset. Performing a reboot over the browser would simply take the camera completely offline. I resorted to installing a 24-hour timer to reset the power once a day.This is just a case of really bad firmware. The TV-IP410 was just issued with new firmware in Feb 2011 1.1.0 build: 47), but it didn't improve the FTP upload - now it stops after teh 46th FTP upload.If you don't care about FTP upload, then the Trendnet camera may be okay for you. I've stopped deploying Trendnet cameras. The cheaper Foscam camera do a much better job than Trendnet. The Panasonic camera are probably the best, but they are higher in price. I am going with Panasonic cameras.", "Date": "March 13, 2011"}, {"Title": "Great IP cam for the price", "Author": "Gadgetter", "ReviewID": "R3HO8AB6JFQB1H", "Overall": "5.0", "Content": "This IP cam works just great if you mastered the setup. To get this up and running do the following:1) Connect it to power AND Lan (wired)2) Install the IP setup software3) Click search in the IP setup. You should see an IP address.4) Change it to 192.168.1.30 (or any other free address)5) Double Click the IP address and you should end up in the configuration software of the camA lot of people have wireless issues. I had the same problems. Here's how it worked for me.I just want to touch the network/wireless menu because anything else should be pretty straight forward.1) Check enable2) Click on the site Survey button and put EXACTLY the same name into the field (EXACTLY)Now, open your router setup and get to the screen where you can see you wireless setupMake sure that ALL settings are exactly the same. If you have WEP it is also important if your router has a shared key or open.Just make sure everything is the same.If you have to change the Channel (preset to 6 for whatever reason) you need to click on Ad-Hoc and then change the channel AND hit Apply.Then go back to infrastructure and hit apply.Again, make sure everything is exactly the same.3) Power off your Router and the Cam and also unplug the LAN wire from the Cam.4) Wait 10 sec5) Reconnect the router to power source and do the same with the cam.Now you should be good to go.(If you have mac filtering in your router please add the mac address of the cam as well.)Hope it works for you.", "Date": "February 6, 2011"}, {"Title": "Near perfect for the price, except BLIND in darkness.", "Author": "Blade \"Blade\"", "ReviewID": "RPFEOPJIV95GP", "Overall": "2.0", "Content": "I really wanted to love these cameras, it was actually hard to send them back.  Some things I really liked:-Good UI, some of the other brands have great Engrish all over the UI.  These have a nice clean look and 95% of the features work in a Non IE browser.  The only reason to use IE is to set the motion detection area.-The motion detection on these is fantastic.  You can specify an area and a trigger threshold.  This means you can dial the camera in to really record what you want.  You get two trigger zones too.  This means you only record the footage you actually want.  Foscam could learn a few things from Trendnet when it comes to motion detection.-Timestamp on images, why can't all cameras have this?  It seems so simple and important.Setup is easy.  I can empathize with lots of peoples complaints about port forwarding, router config, etc.  The truth is, its complicated if you are not well versed in computer networks.  This is no fault of the mfg.Mine were reliable, no crashing, reboots required.Then there was the low light issue.  These cameras are completely blind in darkness.  I'm sure many people are thinking... DUH... When I purchased this I assumed low light would not be good, however I thought it would be similar to other cameras I had, the image would be fuzzy and full of noise.  Not so, you simply get a very dark image.  This is a result of Trendnet's lower limit on shutter speed.  I can understand they prefer crisp motion shots, however, if I can't see anything at all, a crisp shot is worthless.  To put it in perspective, an area of 25x25 lit by a 60watt bulb looks black.  The Foscam and Panasonic cameras have no issues in this regard, however they have plenty of other flaws.  I have to say I'm quite disappointed in what could have been a great IP camera.", "Date": "February 1, 2011"}, {"Title": "Fuzzy smudgy cam", "Author": "MacATDBB", "ReviewID": "REE7KKT1MTRDI", "Overall": "1.0", "Content": "This was a surprisingly easy webcam to setup.  I plugged it in to my wired network, entered the details of my wireless network (be careful in selecting whether your WEP key is Hex or not) and restarted it.  And it came up fine on my wireless network.  The interface was a bit slow but the video streamed nicely.  However I wanted this as a webcam to take a reasonable quality picture every few seconds.  The technical details suggested this could be achieved by setting the image quality to high.This is where things went wrong for me.  The camera takes mjpeg images.  Hence they are of very very low quality as needed for an animated stream of jpeg images.  Even when you select absolutely the highest quality setting, the compression artifacts are still overwhelming and the picture is of a very low quality.  I mean, if you wanted to know if someone was robbing your apartment then sure, you could see someone was inside.  But if you wanted to know whether the misfit was your next door neighbor, elvis, or even ET, you'd be sadly out of luck with this camera.  Dark smudgy shape and light smudgy shape are about the upper limits of its resolution.This is the link to my webcam that uses this camera:  [...]", "Date": "January 12, 2011"}, {"Title": "good starter IP cam", "Author": "desertfox \"desert fox\"", "ReviewID": "RRDF5N3B8V9WE", "Overall": "4.0", "Content": "This was one of the first IP cameras I purchased. It works great with Windows, picture can be viewed from other platforms. Decent quality, static view camera.", "Date": "November 24, 2010"}, {"Title": "Happy with this camera", "Author": "Kendall Giles", "ReviewID": "R7BRSQVE1MOHL", "Overall": "5.0", "Content": "Just what does your cat do at home when you are away at work? Probably not much, but you can easily find out with this handy wireless internet surveillance camera.I've used it with my Mac and I've found it to be a good camera for a decent price. Since the camera has its own webserver, you can easily access the camera's images remotely using your web browser. There are several ways you can configure the frequency of the image updates as well as brightness, zoom, etc. The camera supports MJPEG video recording with up to 30 frames per second as well as TCP/IP networking and SMTP email. You can even set the camera up to only take pictures when triggered by movement. Also, you can have the camera email you the pictures it takes. The camera comes with software that works on a PC, but with my Mac I've not missed it.", "Date": "November 20, 2010"}, {"Title": "Great product, I'm buying another one now", "Author": "B. Powell \"powell789\"", "ReviewID": "R30KDD3FH0JHJO", "Overall": "4.0", "Content": "Reading the reviews, I was hesitant, but I suspected the majority of complaints may have been due to the users' lack of knowledge regarding installation and setup.I don't have any expert IT skills or knowledge either, though I do know the basics as to my email SMTP and my FTP account access. To clarify a few questions, I called my Internet Service Provider and asked them how to enter certain settings for the FTP file transfer process. They basically confirmed what I would have done anyway, but it was a good way to go to get some feedback re: installation.What I can say is, as an average computer user, I was able to get the camera up and running in less than an hour (and I was in no hurry). I also spent a few hours playing with the device settings to find out what I liked the best. In particular, I found the device \"motion detect\" settings to be very sensitive, and I had to experiment by trial and error to find the best sensitivity setting to use with the camera.All in all, the product has met my expectations, and in fact, I've decided to order a second unit to use at another location.*** UPDATE ***I bought a second camera for another location. The basic installation went fine, but upon doing some investigating and speaking to tech support, I found that I could make the basic installation even better by using a service that turns a dynamic IP address into a fixed IP address (via dyndns.com) for a small fee. Now I can not only get motion detect images via FTP, but I can also view live video and control the camera's settings remotely via the internet. It's great! But I wish the documentation laid it all out. As it is, unless you're technically advanced, you need to call their tech support to find out how to do this.I wish they made a weatherproof version of the product (or a suitable enclosure). I have my outdoor-installed camera wrapped in a plastic bag to keep humidity off of it.I read some reviews saying that you \"must use Internet Explorer\" to use the camera because it uses ActiveX controls. I have found this not to be true. I'm using it on a PC with Google CHROME and also SAFARI and it works just fine, I get streaming video and full functionality.Overall an excellent product once you get past the somewhat technical aspect of installation.", "Date": "October 2, 2010"}, {"Title": "Good", "Author": "Me", "ReviewID": "RF166LW58IS13", "Overall": "5.0", "Content": "Works as advertised. If your IP address changes (power outage/modem reset) you have to delete camera from program and re add it. Not hard to do as long as you remember to do so.", "Date": "September 23, 2010"}, {"Title": "Very good camera for the price.", "Author": "E. Williams", "ReviewID": "R22K5KEMNEY3K8", "Overall": "4.0", "Content": "Pros: decent motion capture trigger, web interface is pretty good.  Mounting system is pretty flexible and works well.Cons: The camera will lock up about once a day.  Default webserver requires active-x or JRE to enable streaming video, but MJPG is available (see below).The solution to the lock-up problem is to plug it in to an outlet timer that cycles the power once a day.  With that, works well.---tips:Configuring wireless: when setting up wireless, make sure \"upnp\" is checked.  If your router doesn't support that, make sure to open the port manually, or you likely will not be able to connect to the camera wirelessly.Accessing from non IE browsers: you probably won't be able to access real-time video on non-IE browsers unless you have JRE installed on your device.  To get around that limitation, use this URL: //server:port/cgi/mjpg/mjpg.cgi--Overall: very powerful device that has a few quirks.", "Date": "August 27, 2010"}, {"Title": "Just a toy - Motion detection is useless", "Author": "J. Peterson", "ReviewID": "R3288T3BEE8JVN", "Overall": "2.0", "Content": "This is a really nicely designed unit that packs a tremendous amount of functionality into a tiny package.  But after extensive testing I conclude that it's OK if all you need is a basic camera, but unfortunately the motion detection does not work in practice, and the wireless range is very limited.I was very impressed that the tiny camera unit contains a full web server that handles administration via Internet Explorer, and can e-mail or ftp snapshots when an event occurs.  I had no difficulty setting it up (must do this via wired ethernet, not wirelessly) and getting it running in minutes. Of course it does not have HD-quality video, but you wouldn't expect that from the specs or the price.  Picture quality is good enough to see who's at the door, what vehicle just entered the driveway, who's in the front yard, etc. You can also use multiple units at once, and the package includes software that allows you to view up to 9 at one time.  That's the good part.Now the bad. I REALLY wanted to like this little unit, but:* Wireless range is very limited.  After I got it configured via a wired connection and then checked that it could also connect wirelessly, I moved it to a window in a different room in my house.  No connection.  A laptop and several other wireless devices can easily talk to my wireless router from there, but not this unit, which seems to have very limited range despite an external antenna.* The motion detection capability is worthless.  You configure it via a window which allows you to set up 2 detection frames within the picture and adjust the sensitivity within each.  It also has a moving trace so you can see \"blips\" that indicate when the unit has detected motion so you can tune the sensitivity.  Alas, the motion detection does not work properly.  I have tried for days to tune it, but I either get dozens of false triggers or it fails to detect anything (except for a few false alarms).  Whenever a motion detection event occurs, the unit can be configured to send you an e-mail containing a picture.  The e-mail capability itself works well, but the unit either churns out a large number of e-mails with pictures of nothing happening, or no e-mails at all.  I just watched my dogs walk through the detection zone without tripping the trigger, and a car drove up with driveway also unnoticed, but a few minutes later I got several e-mails of the scene with nothing happening.  It just doesn't seem to be able to detect motion with any degree of reliability, but detects too many other things (such as slight grass motion, variation in sunlight, etc) as motion.  To me, this is worthless, because I don't want to stare at a video image all day long.One further comment on the e-mail capability:  Each e-mail contains a picture as an attachment, thus to look at a picture you have to open the e-mail, open the picture, look to see if it contains anything interesting, then close the picture, then delete it.  You can see if the unit is churning out a lot of false alarms that it is not practical to deal with large numbers of them in this way.Bottom line:  Decent unit if you want an inexpensive but short-range wireless camera, but useless if you need the motion detection capability.", "Date": "July 16, 2010"}, {"Title": "Cool Camera, but Rocket Science may be easier!", "Author": "M. Bentley \"mrb186\"", "ReviewID": "R3SGJNO4WRL1R1", "Overall": "4.0", "Content": "Works great, Finally! (and as an added bonus, it helped me get my wireless printer untethered)I can even connect to it from work, just the way it was intended!  I have my Time Warner cable modem feeding a basic Linksys WRT54G wireless router.  All my laptops and desktops are wireless and I've never had any real issues connecting to the web.  All my PC's could print to my \"wireless\" Samsung Laser printer but only with it wired to the router.  And this is the same way I got the Trendnet TV-IP110W to work initially, but I wanted to get it untethered from the wireless router!Well, after several agonizing hours, here's what worked for me;  Duplicate all settings from your router to the Trendnet cam.  Note that some of these setting are not offered if using the Trendnet setup Wizard, just go thru each category separately:-SSID: same-Channel: same (although you have to select Ad Hoc, change channel, apply, then go back and reselect Infrastructure)-Wep encryption, type and key: same, same, same-IP address: same, but add two digits and make it static (router= 192.168.1.1, cam= 192.168.1.101)-enable UpnP (universal Plug & Play)-change frame rate to 10 (not sure if this is really necessary)I did update the firmware to: 1.1.0 build 93.  I have not fooled with the Event Server yet.  Certainly not a bad deal for 50 bucks after rebate (Newegg)", "Date": "June 17, 2010"}, {"Title": "Very DIFFICULT to configure for remote viewing", "Author": "Sri P. Rangarajan", "ReviewID": "R1QWT9YDR9FAC7", "Overall": "3.0", "Content": "I bought this camera as a security measure to monitor my home when I was away. Could not set up the camera remotely. It works fine when on home network. Numerous call and after spending over 4 hours with tech support, still was unable to resolve the issue.The tech support keeps saying open the port on your router and even after it is opened, it still is not viewable from a remote location. The manual is HOPELESS, does not talk anything about configuring from a remote location, setup of a static IP address, opening ports on the router nothing. Ultimately, tech support falls back on their excuse of \"we cannot help with other routers\". Isn't the camera supposed to work with any router and not just a Trendnet router? I will be happy if they stop playing this chicken and egg game and produce an IP camera that is easy to operate remotely without someone having any EXPERT networking knowledge. They advertise it as a networking camera, but nothing more than a nanny cam that can only be viewed on the home network.", "Date": "May 12, 2010"}, {"Title": "if you think aol is the 'internet' and tivo confuses u.  pass on this", "Author": "S. Davis", "ReviewID": "R2CZYOUWUPRRP2", "Overall": "4.0", "Content": "I debated for a few weeks prior to purchase and read and reread reviews found here. Finally pulled the trigger and bought this and its wireless partner the 110W.  Read, and printed out lots of reviews from here with some great tips and good first person insights.  I am sort of technically inclined, that is comfortable setting up the cable modem and wireless router in my home but i've never been able to get the printer to talk to it and allow wireless printing.  Long story short, opened the boxes, read manual which is junk and as one review suggested threw it out.  Was able to install the two pieces of software and get everyone happy, talking and recording within 1.5 hours. Few key ideas, Secureview software (the one that has multiple camera screen views) should not be run or even opened until you've used the IP config and gotten everything else sorted out static IP addresses, ntp time server (for time and date stamp on video, found address in review here!) etc.  All config and setup stuff is done in each camera individually for all intensive purposes.  You just double click the address in the crummy IP config software window (once you've changed the address from 192.168.1.3 to something else.  Another INet explorer window opens with the camera view (Ta-da!) and setup button for changing all your settings.  Port frwding (so you can see from remote location) is not hard or scary, neither is figuring out your routers internet address just look around in there with a pen and paper and you'll find what you need.  Really. I have not got this emailing me yet.  I have found free FTP server sites but no non-ssl smtp email.  i am really pleased though and bought a 312 day/night with sound to go with the rest. Two viewing the front with motion activated recording (Directed to an old 250GB external hard drive) and one looking out across the back so i can hear the kids playing in the yard while i'm away. pretty cool.  Not super slueth, not high end security, just fun.  Between reviews here and google open on the computer next to me to lookup a few definations i had it all going and learned a few things.  Not really confident that i could have done it without amazon reviewers, manufacturer support resources are pretty weak.", "Date": "April 17, 2010"}, {"Title": "Decent Wireless IP Network Camera", "Author": "D. Topor", "ReviewID": "R3LKGRDZSXNWIU", "Overall": "4.0", "Content": "Small and compact makes this camera nice. Wireless transmission with only the power cable means you can put this just about anywhere. The picture quality is decent, but leaves more to be desired. Easy setup and viewing over LAN or remotely via internet browser. Nice to see what's going on from work without having to install any viewing program. Not bad for what it is, just don't expect stellar detail or megapixel image quality.", "Date": "February 27, 2010"}, {"Title": "buy buy buy", "Author": "T. Rock", "ReviewID": "R28I3T83NKR5E6", "Overall": "4.0", "Content": "i bought a dlink ip camera that never worked the way i wanted so i was skeptical on getting this one. Glad i did though, its easy to setup on your own. i dont have a static ip address but that still was no problem since they send you to a site that would help you bypass this hurdle. port forwarding was another issue you might be faced with but portforward.com took care of that with a list of all modems and the devices attached and how to do the port forwarding. now i have it setup aimed at my front gate so i can see it from work the only problem there the servers at work needs active x to be signed or else it wont load so i cant see it but my wife at work can so i am still good. would have liked the unit to have battries so i would not have to find a power source close to the door", "Date": "January 24, 2010"}, {"Title": "TRENDnet Wirless Camera - You will learn about networking", "Author": "Tim S", "ReviewID": "R1ULL41RTDOVBK", "Overall": "3.0", "Content": "I have not been able to view the camera(cameras, I bought two) remotely yet, which is why I purchased the cameras. I have tried for about a month. The camera set up was kinda of easy, the software is a pain to work with and is very, very slow. It is worth saying again the software is a pain to work with. The documentation is poor. I am  learning about port forwarding on routers and DNS stuff now, all I want is a nice user friendly GUI interface point and click. Not TRENDNet fault, but it would not hurt to have included information on how to  view the camera over the internet. Overall the camera work well within my home network, just cant see it remotely. I have a ticket open with TRENDnet, however its one of those things that affect several systems, type of routers, ISP provider etc etc. It is an educational product unless you are a network administrator.", "Date": "May 18, 2009"}, {"Title": "great security", "Author": "lh man", "ReviewID": "R1ZQRMBIDYM9I9", "Overall": "5.0", "Content": "Had one before ,now the other half of my property is monitored.silent watchman!!!!!!!!!!", "Date": "May 3, 2009"}, {"Title": "Great product", "Author": "K. Mireku", "ReviewID": "R661JKDIBP9JO", "Overall": "5.0", "Content": "Great product.  After upgrading the firmware, I was able to use wireless WAP security.  The picture quality is very good and the software is reliable. Overall, a solid camera.", "Date": "May 2, 2009"}, {"Title": "Great for the price", "Author": "Bob \"Bob\"", "ReviewID": "R2L47FCZSXC9QT", "Overall": "4.0", "Content": "Had camera setup and working in minutes in my network. Instructions were clear and right on.Took four days to get it working over the internet (outside my network).trendnet.com does not have FAQ help for the 110W and the 100W screen shots are not the same Tech support by phone was fast but language skill was a problem. Online support was fast (same day) and somewhat helpful.I thought I had a pretty good understanding of network setups so setting up port forwarding and private IP addresses was not a problem. Also setup a dynamic dns address for free. Still no go after searching online through many forums.The solution finally came from my ISP tech support who had me bridge my DSL modem to the router and SUCCESS.I like this camera. It does what it says. Picture quality is good. FTP works well. I do not use motion detection so I can't speak to that. I'm thinking about buying a Trendnet PTZ for more control over the aim of the camera because I use this for weather photo uploads", "Date": "October 11, 2008"}, {"Title": "Took 10 minutes to setup and so far very stable", "Author": "Y. kim", "ReviewID": "R12WJ1JUZGRWLC", "Overall": "5.0", "Content": "It took me 10 minutes to set this up with wired and then wireless internet.  I guess some people below had a trouble with wireless setup because of router address problem. If your router has 198.168.0.1 address then obviously you should change your set up accordingly, instead of using default 198.168.10.1.  Your camera address can be 198.168.0.30.  I have a 4 year old D-link router.  This will solve your non trendnet router problem.  From internet worldwide, just type your STATIC ip address and password, then you can see what camera sees. Cheers.", "Date": "September 26, 2008"}, {"Title": "Working with MAC and with Airport Extreme", "Author": "Cindy Wardle \"wardlec\"", "ReviewID": "R4YEWAML2PZDK", "Overall": "4.0", "Content": "So just got the camera. I used a PC laptop to actually run the setup. Both connected to airport extreme with ethernet cables to get everything set up properly. Even on your local network you can view the camera using Safari on the MAC by typing the IP address you assigned it in the browser.1. Establish a static IP address for camera aside from default.2. Change Port from default of 80 to (XXXX)3. Got on MAC opened Airport Utilities to manually make settings for porting so I can view over the internet.4. Manual Setup5. Internet tab6. NAT7. Enable NAT Port Mapping8. Configure, add a new, PUBLIC TCP: XXXX (same as what you set up on camera)9. Private IP Address: (static IP address you gave camera)10 Private TCP Port XXXX same as above11. Continue, give a description - camera, done, update airport.When you go to access over the internet you have to enter your public IP address assigned by router. You can easily test this by googling open port testing. This will tell you your IP address and if your port XXXX is open. If open go to browser and type [...]  I had a friend test it from their house and it asked for user name and password. once I gave it to them they were able to see what my camera was looking at.I haven't actually set up the wireless part yet but I was so excited to finally get this thing to work over the internet outside my local network I had to share it. I'm sure setting up the wireless using the WPA key will be simple enough. I got this camera for a simple home security camera to see what was going on at my house while I was at work and this is going to work great!", "Date": "January 22, 2010"}, {"Title": "absolutely will not connect to wireless", "Author": "slackwaredave", "ReviewID": "R2LGI639LMWWKK", "Overall": "1.0", "Content": "The TRENDnet Wireless Internet Camera Server (TV-IP110W) sets up easily on a wired connection.  The image is quite good for a camera of this price.  Configuration interface is straightforward.Now the BAD part:1- camera does hang sometimes requiring rebooting.2- it absolutely would not connect to my wireless.  This is not the only review that states this problem.  I know my way around wireless networking, so the odds are low that the problem is not the camera.  I had my router open in one browser tab, the camera open in another.  Everything was perfect on both.  No deal.  No connection ever.  No WPA, No WEP.  I won't try it unencrypted.  I don't want to run my network like that.I thought for under $100 this would be a good deal.  Not so.", "Date": "November 29, 2008"}, {"Title": "Easy to setup and decent quality", "Author": "Cleve \"good standing\" Steve \"McSteve\"", "ReviewID": "RTZSBPPM54NDP", "Overall": "4.0", "Content": "For the price, it's a great little camera.  Setup is easy for anyone who knows their way around a router.  The software is good.  No compliants.", "Date": "July 29, 2008"}, {"Title": "Save yourself trouble, spend more on a more reputable IP Cam brand.", "Author": "phrolic", "ReviewID": "R1PSLEBIOHH5T7", "Overall": "1.0", "Content": "PROS:- Great price- Decent video quality (not suitable for low light conditions)- Decent inclusive camera softwareCONS:- Camera's IP always defaults to 192.168.10.30 when the camera reboots or if the power is cut. First of all, why Trendnet programmed the cam's default IP as 192.168.10.x rather than something common like, oh, I don't know, 192.168.0.x or 192.168.1.x, is utterly beyond me. Your typical computer user wouldn't have a clue how to access the camera to get the IP within network range. Secondly, if I want to remotely monitor the cam but the power at home fluctuated or went out or what ever, how exactly am I supposed to access the camera to change its IP *again* to the one I set it up to be? I'll tell you how: You're just SOL, Chuck.- Camera does not retain date/timestamp, defaults back to 2007/01/01 any time you make a changes that require camera to reboot, or if the power is cut. Seriously? I haven't had time retention issues with electronics since VHS players from the 1980s.- No HTTPS email alerts. Meaning, if you want to use your Google, Yahoo or 95% of all free email services as your mail server, you're SOL yet again. Sure, you can use your own mail server but that's yet another thing your typical computer user wouldn't dream of having a clue about.- It advertises two-way audio capability but I can't find anything in the manual, in the software OR on the camera's webpage about using the audio. And why doesn't anyone mention this in the reviews on here or other review sites? How... creepy.- The manual is useless and best of luck to you with tech support.Note to Trendnet: Update your firmware to fix the date/time issues, the IP resetting issues, include HTTPS and you will have an IP camera worth every last penny.I absolutely DO NOT RECOMMEND this seventy-dollar paperweight.", "Date": "August 2, 2010"}, {"Title": "Hangs lots, needs better firmware", "Author": "Sparky Technogeek \"Technogeek\"", "ReviewID": "R2DJWE13RBXVL1", "Overall": "2.0", "Content": "I bought this camera because I have had great success with many IP-100W cameras. This one (the 110W) has all new firmware, apparently, though, and it is NOT ready for prime time. I am using the latest \"build 80\" firmware dated September 2008 (from the website) and the camera hangs up frequently, particularly when you are messing with events like ftp or email. the time server works sporadically, and the built in web server has problems with all 3 browsers I tried: firefox-mac, Safari-mac, and ie-win xp. It is totally useless with Safari.The picture quality is excellent but for now I will stay with IP-100Ws. This one is going back.", "Date": "September 20, 2008"}, {"Title": "No email support for Gmail/Ymail. Requires DNS or hosting for most other functions.", "Author": "Spanky Mcdooble", "ReviewID": "R2M1TWKDJT6L9G", "Overall": "2.0", "Content": "I bought this on deal so I bought 2.  I have an Ethernet Pan/Tilt camera but thought these would be cool to Place away from my router. Instructions are poor and I admit I did not call the 24/7 support just because a little look on Trendnet website answered my questions and these don't fit my needs. I could not recommend this unless someone knows exactly what it will and will not do.  I'm dumb and not super tech savvy so here we goPros.1. Works to View from PC on your home network.2. If you already have a server, DNS and compatible email account it is a good price point.3. 36 month warranty. IDK about service though could be life saver or worthless...4. CheapCons1.Does not support free webmail. No Gmail or Ymail. If you know a free reputable webmail service that works with these please say so in comments.2.Requires paid DNS service and a host server to view from outside your home network. Again if I am wrong let me know. I don't' even know what this is. I'm dumb.3.Android app is poor and has never seen an update. Seems to be abandoned. Also requires hosting.4.Requires ethernet cord for setup but does not include one.5.Camera gets and stays hot. Probably a bit of a juice hog to run 24/7.", "Date": "November 25, 2011"}, {"Title": "not working", "Author": "Lee Abeloos \"Plasma\"", "ReviewID": "RV4N0MSL8C56R", "Overall": "1.0", "Content": "For me it a piece of j....When you setup, during the installation IE freeze up, you loose everything you typed in. The time, date can't be saved. I would not recommend it to NOBODY!!!! Waste off money.", "Date": "September 8, 2011"}, {"Title": "Great cameras, crappy software", "Author": "R. Jimenez", "ReviewID": "R3HKCSD2WWJ7T1", "Overall": "4.0", "Content": "I like the cameras, but the securview software is a cpu hog.  It is also a bandwidth hog.  Securview also crashes quite a bit.  In order to get it to work, I had to run securview in a virtual machine via virtualbox.  That prevents it from crashing, but it is still hoggin my dual core cpus.  I have windows 7- 64 bit.  Customer support is pretty much nonexistent.", "Date": "December 19, 2010"}, {"Title": "Tiger Direct has poor customer service, Trendnet has a poor camera", "Author": "Scott L. Fox", "ReviewID": "R2DCTTSOLLAWCQ", "Overall": "2.0", "Content": "I never got a chance to review the product I ordered. Tiger Direct never sent me the order, and when I called after it was supposed to have been delivered, I was told it was backordered. I asked why I was not told that two weeks prior, and was told that an email had been sent, but the email address I was given, was the Amazon order number. I will not order any future products from Tiger Direct. Their telephone customer service is poor. Their on time delivery is worse.As far as the Trendnet Wireless Camera, I picked up one at my local Fry's and have been using it for the past 3 weeks. The image quality is poor in low light, good with normal room lighting. Pointing it out the window into the backyard, completely overpowered the webcam. The screen was completely white, no matter what settings I used. The setup disk was not Mac compatible.If you want a better wireless camera, with easier setup, ( on both Mac and PC), I would recommend the Linksys WVC80N. Cisco-Linksys Wireless-N Internet Home Monitoring Camera Great low light image, great outdoor image, and the setup was a breeze. I am also using an Axis 207W Axis 207W Wrls Network Camera Wireless 802.11G 30FPS In VGA Res borrowed from a family member. I would say that the Linksys is as good as the Axis 207W, albeit larger, for less then 1/2 the price.", "Date": "September 26, 2010"}, {"Title": "Lack of SSL support, low resolution", "Author": "Fourier Transform", "ReviewID": "R3BTIZTXDA7529", "Overall": "3.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moA8G0OJSS8HI7embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moA8G0OJSS8HI7refresh_preplay() {\n\ndocument.getElementById(\"cv_moA8G0OJSS8HI7chiDiv\").innerHTML = document.getElementById(\"cv_moA8G0OJSS8HI7hiddenPre\").innerHTML;\n};\ncv_moA8G0OJSS8HI7refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moA8G0OJSS8HI7so;\t   \n\n\nfunction cv_moA8G0OJSS8HI7loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moA8G0OJSS8HI7so = new SWFObject(swfLocation, \"cv_moA8G0OJSS8HI7AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moA8G0OJSS8HI7so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moA8G0OJSS8HI7so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moA8G0OJSS8HI7so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moA8G0OJSS8HI7so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moA8G0OJSS8HI7so.setAttribute(\"height\", swfHeight);\n          cv_moA8G0OJSS8HI7so.setAttribute(\"width\", swfWidth);\n          cv_moA8G0OJSS8HI7so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moA8G0OJSS8HI7so.write(\"cv_moA8G0OJSS8HI7flashcontent\")) {\n          fp_resizePlayerSpace('cv_moA8G0OJSS8HI7', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moA8G0OJSS8HI7';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moA8G0OJSS8HI7', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moA8G0OJSS8HI7loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moA8G0OJSS8HI7\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"mUB9SXSE5UWK0\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"mUB9SXSE5UWK0\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3BTIZTXDA7529\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/mUB9SXSE5UWK0/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moA8G0OJSS8HI7duration')) {\n      document.getElementById('cv_moA8G0OJSS8HI7duration').style.display='none';\n    }\n    cv_moA8G0OJSS8HI7loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moA8G0OJSS8HI7loadSwf(movieID, playerVersion) {\n   return _cv_moA8G0OJSS8HI7loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moA8G0OJSS8HI7newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moA8G0OJSS8HI7', 0, h);\n}\n\nfunction cv_moA8G0OJSS8HI7resetPlayer(w,h,bw,cc) {\n  cv_moA8G0OJSS8HI7newHeight(h);\n\n  cv_moA8G0OJSS8HI7so.addVariable(\"resetBandwidth\", bw);\n  cv_moA8G0OJSS8HI7so.addVariable(\"cacheCode\", cc);\n  cv_moA8G0OJSS8HI7so.setAttribute(\"height\", h);\n  cv_moA8G0OJSS8HI7so.setAttribute(\"width\", w);\n  cv_moA8G0OJSS8HI7so.write(\"cv_moA8G0OJSS8HI7flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moA8G0OJSS8HI7RollOverImg = new Image();\ncv_moA8G0OJSS8HI7RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81PkbXzM5cS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moA8G0OJSS8HI7preplay = document.getElementById('cv_moA8G0OJSS8HI7preplayImageId');\nif (cv_moA8G0OJSS8HI7preplay) {\n  cv_moA8G0OJSS8HI7preplay.onmouseover = function() {\n    cv_moA8G0OJSS8HI7preplay.src = \"http://ecx.images-amazon.com/images/I/81PkbXzM5cS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moA8G0OJSS8HI7preplay.onmouseout = function() {\n    cv_moA8G0OJSS8HI7preplay.src = \"http://ecx.images-amazon.com/images/I/81PkbXzM5cS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moA8G0OJSS8HI7preplay.parentNode;\n\n  var cv_moA8G0OJSS8HI7currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moA8G0OJSS8HI7currentClick) {\n      return cv_moA8G0OJSS8HI7currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:25 MinsBought this camera to take pictures of my back yard, while we were away for a  6-weeks long vacation. The setup was OK, the wireless is bit tricky, especially if your internet is encrypted. The pictures are OK... The motion detection is software based and can trigger large number of emails and flood your inbox. I fixed it on my outer-wall. I didn't use the software came along with it.. All the setup can be done with IE  not Firefox !). After 2-3 days, I stopped getting emails !!. Found that that it needs to be rebooted after 2-3 days :-(.. Which makes this completely useless. Also, it wouldn't support any SSL/encrypted smtp servers - which will exclude most of the popular email providers (only for sending, not receiving). I tried with an email server which didn't require encryption.. But I noticed a lot of spam messages originating from my address shortly afterwords :-) . be careful when sending the user name and password unencrypted. The dynamic dns service works, but it is useless if it is behind a DSL router (It detect the IP changes from router, not the ISP provider)..... Update after a few months. The-crash-after-three-days continues. Also I notice that my email user name and passwords get hijacked (probably by spammers) very often as it is being transmitted unencrypted. I strongly advice to look for a camera that supports SSL protocol for account authentication. Another concern is that the remote access to this camera (say from office to see the live view at home) requires login over http (NOT https). So, your username and password for this camera could be intercepted by anyone.June 2011.Found a firmware update for this camera. After that, for the past 12 days, the camera is working without any problems. I increased my rating by one star. The SSL woes continue. Will update.Sep 2011.Camera freezes randomly for no apparent reason - you need to power cycle to get it going again. As someone suggested, I had set up a cron job that reboots the camera (the url command to reboot the camera is [...] every day. But even then it freezes.Oct 2012The camera is still working. I have made a time-laspe video with 1 year long photos.", "Date": "August 12, 2010"}, {"Title": "Great little camera for the price!", "Author": "Cyclophile", "ReviewID": "RL960EZYLQ3S6", "Overall": "4.0", "Content": "I bought this with a little trepidation but It works great. I am a Mac person and unfortunately, you do need to downgrade to a pc in order to do some of the configuration (using the ip assign tool, setting up the motion detection).. but since I am bi-OSulal, I have a netbook that did the trick.  (there are bits that require activeX.. which means ie only! Grrr...)Setting up the wireless was a little tricky. Know your router! My current router (from ATT) is a bit kludgy but I got it working fine on the network.But once you have your network figured out, its a snap...My only complaint is the field of view. Its field of view is a little narrow and I'm only able to get a portion of my target room into view (using it to watch the dogs when they're confined in a particular room).Also.. 'specially for mac users.. there's a better app for the recording, etc.. than the one its boxed with.. google is your friend..There's also a nifty app in the app store for Android that'll let you watch the camera on your android phone (assuming you have the cam configured to view outside your network)", "Date": "January 15, 2010"}, {"Title": "IP110", "Author": "Harriram Oumadath", "ReviewID": "R3L46Z2137HBKQ", "Overall": "4.0", "Content": "I bought this as my first venture into IP Security. I must admit, that at this price, it's a steal of a deal. Of course, low light visibility is no good as it is not a day/night. For home users, I would recommend the Trendnet line anytime. Excellent product for my needs. Next stop, Day/Night PTZ for outdoors.", "Date": "May 23, 2009"}, {"Title": "Great, If you can get it to work.", "Author": "S. Haywood", "ReviewID": "R3O2F4ORVY5G2J", "Overall": "3.0", "Content": "This operates great, if you can get it to work.  I went through 3 of them before I was able to find one that worked - Even did an RMA on one.  Finally, got one that worked - and still works.  Each time I got a new one, I followed the setup instructions, whiched worked fine.  After a short time the camera would lock-up and not respond. Tech support was great, but had the same problem.  Kept trying new units and finally got one to work.  This is a great bargin for the money - if it works.", "Date": "April 10, 2009"}, {"Title": "Good Equip, but not easy to set up", "Author": "Thomas W.", "ReviewID": "RX3H4HUDJVRX6", "Overall": "3.0", "Content": "Although the equipment worked well, it was very difficult to set it up through the computer.. took the help of a computer \"expert\" to get it up and running..", "Date": "December 7, 2013"}, {"Title": "Not secure: Beware.", "Author": "Glenn Connery", "ReviewID": "R3CFS6XPDIL5AB", "Overall": "1.0", "Content": "\"A few weeks ago, a blog called Console Cowboys exposed a security vulnerability in some models of Trendnet home security cameras...\"[...]", "Date": "September 4, 2013"}, {"Title": "Good for the price, just dont shake it", "Author": "James A Kinter", "ReviewID": "R1BJDZVYMJHGU7", "Overall": "3.0", "Content": "This camera (I own 2) is OK quality for the price (<$75).One issue I have is that vibration seems to knock it out of focus, even with the focal ring around the lens taped down.So there must be something internal loose on both cams.One is mounted atop a tower in a wx-proof box to stream live video across the mesh network to the webserver:[...] .While the other is mounted to a portable cooler:  [...] @ 1:42 to 2:55 in the video.I had set the focus perfectly, but by the time we got the push-up pole extended up, the focus was off, and seems to get worse after the wind moves it around a little. Or on the cooler-cam, it would go out just walking around with it.I guess if you set it on a desk and dont touch it or have the washing machine across the house vibrate your desk it would stay perfectly focused.Ill probably go Foscam next time.I have used those at a buddy's, and they are rock solid and great video, and under $100", "Date": "July 14, 2013"}, {"Title": "Lots of interference.", "Author": "Jeremy Wilcock", "ReviewID": "R3ZYGNKV5FUFW", "Overall": "3.0", "Content": "This camera is ok. I used to to monitor a printing station at my job about 30' away through a wall.  You should know that it's susceptible to interference. Even someone just walking across the room will cause interference.", "Date": "May 8, 2013"}, {"Title": "Excellent Camera.... but you must know how to modify your router's setting", "Author": "seanece", "ReviewID": "R1I7KPOVVKNQ23", "Overall": "5.0", "Content": "Overall this is a great little camera. The picture is very good for what I am using it for (viewing inside home).I see a lot of reviews for this product complaining about the Wireless Function. Please follow the directions and CD provided. Also, you will need a moderate amount of EXPERIENCE modifying your router to ensure the Static or Dynamic settings are correct as well as your IP range.Please, PLEASE read up on basic internet setup for your house before buying this product.Again, my camera is flawless and I highly suggest the camera, but some settings you may need to know how to modify yourself. Please do not blame the camera or manufacturer.P.S. Also, update the firmware to ensure OPEN-SHARED capabilities.", "Date": "January 14, 2013"}, {"Title": "Great Camera!", "Author": "Afobos", "ReviewID": "RK7T6JJ4XKVV2", "Overall": "5.0", "Content": "I've got three of this cameras monitoring my house and they work great come rain or shine.  Sometimes they'll freez up and I have to unplug them and plug them back in but it doesn't happen that often.  If I had them wired in it wouldn't happen at all so it's probably due to signal strength.", "Date": "March 11, 2012"}, {"Title": "Working good for the price", "Author": "Marian Boricean \"Born in 1977 passioned of te...", "ReviewID": "R1GFV4CBBAZRP9", "Overall": "3.0", "Content": "I have bought this camera to use it with Zoneminder in linux. I don't have a Windows computer in the network where this camera is installed, therefore, I could not fully test it in the browser (Requires IE and activeX plugin installed).It's not a bad camera (I am still struggling to get the wireless working) for the price, but next time I will buy an Axis.", "Date": "December 23, 2011"}, {"Title": "Excellent Camera for the Price but Not for Novice Users", "Author": "CrazyRussian", "ReviewID": "R2MBVZTPV6AHN4", "Overall": "5.0", "Content": "I love this camera. I have set it up so that it drops images to my FTP every few seconds. There are apps available for both Android and iOS devices so that you can view the camera remotely.You need light to get a good quality image. In hindsight I should have bought a camera with night vision but it's a minor gripe since those cost a lot more.Another con with this camera is that you have to be more or less computer savvy. What this means is that you need to be able to log in to your router control panel and set up port forwarding if you want to monitor your camera remotely (outside of your house). If you want to record images, you need to have access to an FTP server.Otherwise, this is an excellent buy for the price.", "Date": "November 29, 2011"}, {"Title": "Great camera for the price", "Author": "Charles Gallagher \"Lessards Gutters\"", "ReviewID": "RBBRQUNZZBKD7", "Overall": "4.0", "Content": "I got this for a gift form my brother.  The camera was a little difficult getting it all set up and I am a computer nerd.  I would give this 5 stars if it came with a better how to setup video/diagram.  I would recommend this to anyone who is needing a cheap camera and has some computer/networking skills.  Its wireless range is pretty good, atleast for my router.  I have it mounted on my back porch to keep an eye on my dog.  ITs atleast 100 ft from router and there are many walls inbetween router and camera.", "Date": "September 6, 2011"}, {"Title": "Bad product, better options available.", "Author": "Dan \"Dan\"", "ReviewID": "R2T401WZ8CTRVT", "Overall": "1.0", "Content": "The good:The spces are nice, and the box it comes in is green, and green is a nice color. With a wired connection it works well from my testing.The bad:The WiFi range is terrible. Spotty connection from 30 feet away through 1 wall with a high power router. From the same spot my iPhone has full bars for my network. The web user interface cashes over WiFi if any packets are lost. Once the web interface cashes it does not recover until you unplug and re-plug. I updated to the latest firmware (V1.1.0.104 - 3/2011) to no avail. Sent it back as defective by design.Bottom line:Do not get this product! I went with the Foscam FI8909W-NA. It's infinitely more stable and reliable with much better range on the WiFi and a wider angle lens. Only down side is that I'm only getting 2 fps, which I can live with because it doesn't crash incessantly like this TRENDnet TV-110W did.", "Date": "August 21, 2011"}, {"Title": "Would have been happy if they'd just sent me one working unit...", "Author": "dave", "ReviewID": "R2O4QAIG10J2VW", "Overall": "2.0", "Content": "First off, I work for a network consulting firm and even I was banging my head against the wall with this thing.You don't need the software to install, just type the IP of the camera into the address bar and you can access the web interface.  You can use the IP finder tool off the CD; the other software is useless.The only design flaw from a software/UI perspective is the email notification server.  Anyone who has an actual working unit, use gmail-smtp-in.l as your email server and have two gmail accounts, one to send and one to receive.  Don't use authentication or it won't work.  Credit for the tip goes to a guy in one of the other camera forums badmouthing this one, heh.  As far as the sensitivity issue, you're on your own....Hardware is a different story.  The issue I had with both cameras sent to me was that they wouldn't hold a configuration.  I'd set it up, two seconds later it went back to defaults.  Firmware updates didn't resolve the issue and probably exacerbated it because it got even buggier.TrendNet support sent their two replies and then stopped responding, so defective units must be the norm for them.  Too bad, good price and most of the features I wanted; just send me a working product next time and I won't have to return them - twice....", "Date": "July 18, 2011"}, {"Title": "FTP and image clarity", "Author": "John J. Wallace \"JJWallace\"", "ReviewID": "R2OIBJSRNZJVZM", "Overall": "3.0", "Content": "I've been running this camera for several months and have four negatives: 1) The filenames on ftp images are unique, which means you can't ftp an image to a web site without some active scripting to present the \"latest\" image.  Tech support said that's the way it is and no hope for future upgrades. 2) The live streaming website really hangs a lot.  I've given up trying to find out why and have a utility power timer set to power off for four different one minute periods through the day - this has dramatically improved my camera's net availability.  3) In order to support live streaming the compression is so high the images is highly pixellated.  I'd be happy with a once a second update or slower if I could get a sharp image, but no such option.  4) The live streaming image requires Java (vs. Flash) which is useless for viewing on my Android phone, coupled with my first comment means I have no means to view my camera from my phone.One other nit is that the mounting threads are so close to the antenna that I had to purchase an extender just to mount the camera on a stand I have for the camera.  I think this camera has value if you just want a remote view on the world but these issues keep it from getting a five star review from me.", "Date": "June 9, 2011"}, {"Title": "SW Install Failed - Consistently", "Author": "William Evins", "ReviewID": "R2SI7DC036GS6M", "Overall": "1.0", "Content": "Installing the software failed with an infinite loop. Resulting in the camera not being functional. I have many years in computer network support and this was an easy fail.", "Date": "May 22, 2011"}, {"Title": "Good product easy to use, nice app for droid", "Author": "Patrick Murphy", "ReviewID": "R3IWQJUKK3A5WZ", "Overall": "5.0", "Content": "Pretty easy to setup, you just need to forward a port on your wireless router.  Once you get that, the rest is easy.  All items that connect to your wireless router get assigned an IP in sequence, xxx.xxx.x.101, xxx.xxx.x.102 one of these will be the camera.  You forward a port say 800 on the IP address assigned to the camera.  Keep in mind, if you restart the wireless router, the camera may get reassinged and you will need to forward the port on the new IP it gets assigned.It works great so far.  Had it for about 4 months.  I can check in on the house over the internet on my droid and take snap shots.  I haven't tried the motion detection and automatic notification.  Thinking of buying another camera, maybe the one with two way sound next.", "Date": "April 10, 2011"}, {"Title": "Worth every penny", "Author": "B. Benito \"brian\"", "ReviewID": "R7YPRIFQ37CIJ", "Overall": "5.0", "Content": "I bought this camera to install in my living room to watch my newborn twins from work.  Installation took a little over an hour because I refused to install it by using and following the directions that came with the packaging.After I gave up trying to instal via my own intuition, the camera was up and running in 10 mins.  I bought two cameras in the original purchase and am considering with buying 2 more to install facing the front door to keep an eye on the hooligans in my neighborhood.Thumbs up with this camera and I am looking to buy a outdoor housing as well.", "Date": "April 8, 2011"}, {"Title": "Great for the price", "Author": "Adam Caron", "ReviewID": "RUB2KUJF7GNBJ", "Overall": "4.0", "Content": "I have two of these in my house and two at work.Pros:* Quality: Decent quality picture considering the size and cost, provided there is a reasonable amount of light. A darkened room with light from 1 window will be fairly low quality. A darkened room with no light inside will be unusable. If you are expecting HD cinematic quality from a double digit priced camera, you are probably going to be disappointed.* Setup: very easy to use and setup. If you don't have basic knowledge of networks and opening ports and such you will probably have issues, but I doubt that is different than any other camera. With basic router knowledge you should have no problems setting it up. Also had no problems getting it to save snapshots via FTP, everything is pretty self-explanatory.Cons:* Low light: Not really bad considering the size of it and the fact that it is not billed as a low-light camera, but keep in mind that it needs normal-indoor lighting for a good picture.* Setup: only complaint I have is getting it to use an NTP server to set the time. For some reason so matter what I do it never seems to set the time automatically, so whenever the power is pulled I need to manually reset the time and date.* Mobile connection: The cameras require Java or Active-X applets that most mobile browsers don't seem to like. There are work-arounds available through undocumented functions but it would be nice if they were more directly supported.* Reliability: occasionally stops responding randomly for no reason and needs to be unplugged and plugged back in to reset. Only happens once every few months, but something to keep in mind if its placed somewhere inconvenient.Overall, even knowing the limitations and quirks, I continue to buy them and it was my first recommendation when we needed 2 cameras for work.", "Date": "February 26, 2011"}, {"Title": "reasonable picture", "Author": "alchemyiam", "ReviewID": "R37QD2971HRFKT", "Overall": "2.0", "Content": "I found the setup reasonably straightforward using both the advice on Newegg and Amazon (and accomplished using the Trendnet IPSETUP software).The Trendnet Secureview software was not so impressive. I moved to another package (vitamin d) and found motion detection, film clip storage etc. a breeze after that.System runs well on Google chrome and picture good if care taken to setup focus and other camera parameters.Update 12/31/12Eventually gave up using this device. Trying to keep the software running, PC setup, IP address up-to-date etc. etc. was too time consuming. Eventually went with the DROPCAM webcams - software is a breeze to setup, good quality image, good night vision etc.", "Date": "February 7, 2011"}, {"Title": "Decent quality camera, average software", "Author": "LeFrog", "ReviewID": "R2NJU58QWX6LY5", "Overall": "4.0", "Content": "I bought 3 of these cameras during lightning deals. Around $50 this camera is a good deal.Here are main points.Pros:- easy to setup- no subscription or fees to view cameras from the Internet- user account (for just viewing) + admin account (to setup)- decent quality picture- automatic emails on motion detectionCons:- setup only works with Internet Explorer (activeX plugin)- very poor motion detection- recording software does not support large disks- no night vision, very low quality in low light environments", "Date": "January 16, 2011"}, {"Title": "Hardware ok - software awful - support a joke", "Author": "Ronald Albury", "ReviewID": "RGGJ5I8XFV61S", "Overall": "3.0", "Content": "The hardware works fine ... it does everything it is supposed to do (although not as sharply or clearly as I would have liked).  However, the software they supply to interact with the camera is awful.Much of the software set-up was counter-intuitive, and the documentation they provide is nearly useless.  When I ran into some problems (after I had owned for about 8 months) I downloaded and installed the software update.  However, the install program for the new version didn't properly deal with the previous version's DLL's and after installing the new version the application refused to run at all.  I contacted their support group and their only suggestion was that I find a backup of my system from prior to installing their software and restore my system.Conclusion:  If you buy this camera plan on either spending lots of time screwing with the software, or else buy a different software package (there are several out there that work with TrendNet cameras).", "Date": "September 20, 2010"}, {"Title": "Hardware good - software awful - support a joke", "Author": "Ronald Albury", "ReviewID": "R13XW4CCG4HB3", "Overall": "3.0", "Content": "The hardware works fine ... it does everything it is supposed to do.  However, the software they supply to interact with the camera is awful.Much of the software set-up was counter-intuitive, and the documentation they provide is nearly useless.  When I ran into some problems (after I had owned for about 8 months) I downloaded and installed the software update.  However, the install program for the new version didn't properly deal with the previous version's DLL's and after installing the new version the application refused to run at all.  I contacted their support group and their only suggestion was that I find a backup of my system from prior to installing their software and restore my system.Conclusion:  If you buy this camera plan on either spending lots of time screwing with the software, or else buy a different software package (there are several out there that work with TrendNet cameras).", "Date": "September 20, 2010"}, {"Title": "Difficult Install - Great once it is setup.", "Author": "David H", "ReviewID": "R11TMVAISOTJ4C", "Overall": "5.0", "Content": "I read most or all recent reviews before purchasing this product so I was well aware of the difficulty in the installation. It was, but with help from tech support cameras are fine now.  I purchased 2 of these here at Amazon for $65ea and installed one in back and other in front of my home.Pros. Watch from anywhere you have internet access.  Reasonably good picture.  Blinking LED in front of camera can be on or off.  Motion detection/eMail notification.  Great techinical support.  PEACE OF MIND - Knowing I can call my local Police at a moments notice.Cons. Difficult to install and setup.  Not for outdoor/night time use unless brightly lit.Overall, I am very satisfied.*******************************UPDATE***********************************************April 28,2011: both cameras have been up and running since October last year. Have had no problems. I purchased an EVO 4G cell and found two free android apps to monitor my cams. Both apps were done by Trendnet...Secure View Mobile and TrendyCam.now I can monitor my cams on my cell by touching one Icon.SWEET! Going to Europe soon, so I will update if this works overseas on the EVO...************************************************************************************", "Date": "September 7, 2010"}, {"Title": "Love the quality. Wish it had Mac Software.", "Author": "jimmy", "ReviewID": "R28DN0223GIGHY", "Overall": "4.0", "Content": "Quality is great for the price. It takes a little extra know how to setup with OS X since it doesn't have a quick installer. I'm going to purchase a few more. Cam Viewer works great with iPhone 4.", "Date": "August 6, 2010"}, {"Title": "Nice camera", "Author": "Amazon Customer \"techie\"", "ReviewID": "REZYPK79QUK5K", "Overall": "5.0", "Content": "This works well for local and remote monitoring. The included instructions make local setup simple, but for remote setup you should watch the video from TrendNet on Amazon and Youtube. The shows you how to set up the camera and a router with a free DNS service, which adapts to a changing IP address from your service provider. I have seen the camera freeze occasionally, but a reset from the web browser will start it up again. The date and time will have to be set, too.", "Date": "July 19, 2010"}, {"Title": "Ok camera when it doesn't lock-up", "Author": "Researched buy in SF Bay area", "ReviewID": "R2G2M486FVGWBY", "Overall": "2.0", "Content": "I've had this camera for about 6 months.  It took me three or four hours before getting it reasonably well setup, with ftp picture captures, etc.  Never did get the email alerts to work.  Works well with iPhone's iCam app, and the app's motion detection seems to capture things that make sense for a motion capture than I could get with the Trendnet software.  My problem has been wired or wireless the camera locks up and apparently loses its connection to my network.  Maybe this is a problem with my network but not sure.  Anyway, I was getting only ~1 hr between lock ups, so sent a ticket to Trendnet.  After a few emails back and forth over a few days, I was issued an RMA.  Sent the camera back and got a replacement about a week later.  I hooked it up same as the previous one, and 23 minutes later it froze (green light stopped blinking).  I will retry a few times and see if things are consistent, and possibly try on a few different connections I have.  If the same thing happens I may try a different brand to see I get the same behavior as it is too late to return this one...", "Date": "June 1, 2010"}, {"Title": "Flaky product, horrible instructions", "Author": "Ian T. Bui", "ReviewID": "R2DHFPLJBL2JKC", "Overall": "3.0", "Content": "Couldn't configure the camera at first. Nothing showed up in the Config GUI. Contacted Trendnet support, and after a few email exchanges I was told to send unit back. Got a new one, which came up right away. Apparently the one I had was defective somehow.Everything went fairly smooth after that. But there's no instructions on how to configure the camera for remote monitoring, which is what we bought it for. Perhaps I'm missing something in the User's Guide, but I still can't find that info. Any help would be much appreciated. What I want to do is be able to monitor the house from our iPhones.The camera itself is not bad. Picture quality is reasonable. The power cord (black!) is too short though, so hanging camera from ceiling can be aesthetically unpleasing.Update: After logging out of the webcam, when I logged back in I could no longer see the Live View. Tried rebooting the camera from the GUI, tried unplugging power. Nothing has worked so far. Not sure what the problem is. What a frustrating purchase...", "Date": "May 9, 2010"}, {"Title": "Keep looking", "Author": "Frank Dwyer \"Enjoy Life\"", "ReviewID": "R244HY7GCL615L", "Overall": "2.0", "Content": "I do not have a great deal of experience with video cameras. I have 10+ years experience in computer networking. I can tell you that this product produces decent quality video but the recording is just about worthless. Motion recordings do not work while contant recording takes up enormous amounts of storage leaving the product useless for my application I purchased it for. The wireless signal needs to be excellent for the device to work properly. If you havent already be prepared to relocate your access point for optimal coverage of your property, deal with constant connection issues or be faced with approx 15 ft wireless range. In the end I wish I never purchased the product. Dont be fooled into thinking your getting a great deal here. Not being bitter I am thinking I need to spend a bit more money to get the product I need. I will end up using this product for my website streaming live footage of my aquarium. I havent done that yet so cross your fingers.", "Date": "April 14, 2010"}, {"Title": "For very basic needs only.", "Author": "Senior Frog \"Hungry Man\"", "ReviewID": "R1MTDM9H9KX2A0", "Overall": "2.0", "Content": "I replaced an existing camera that stopped working with this TrendNet model.The software is much harder to setup. The camera required \"Reboot\" everyday to stream video. Fortunately this can be done remotely. The email alert, motion sensor and upload of frames to email doesn't work. Lighting conditions have to be perfect to get a decent video.If this is your first Internet Camera, you may like it simply because it's cool to be able to see what's going on in your house while your gone. But if your used to the features found on something like the Panasonic BL-C111A Network Camera. You will not like this camera.I've come to depend on the ability to pan, tilt and email upload of camera frames when motion is detected. With the TrendNet, if your not watching when it happens, you won't see it. That's a big flaw!My previous camera (a panasonic) wasn't perfect. But it did last 2.5 years, required very few resets and up until it died, I would have recommended the panasonic.The Trendnet is barely better than a toy.", "Date": "March 23, 2010"}, {"Title": "Very good camera for the price", "Author": "Mostafa Sobh", "ReviewID": "RQTIVVULRVV5T", "Overall": "4.0", "Content": "This camera is very good for the price and easy to install. Just follow the instruction provided then configure your router for port forwarding. If you don't have a static IP address then just use a no-ip service. I was able to access the camera remotely after the configuration. The night version is very poor but if you have lights then it has a very clear picture.", "Date": "January 26, 2010"}, {"Title": "Good product for the price", "Author": "S. Russert", "ReviewID": "R2IX5ZG6MIUB1L", "Overall": "5.0", "Content": "The image quality isn't great, but hey, it's 640 x 480.  I use it for a webcam view of the mountains, and wish I had a telephoto lens.  But, the install was easy, it actually has lots of configurability, and the wireless works great (probably 50-60 feet from my base station). For views of a room, or area of the house, the picture is good.  It can be configured for artificial light or daylight, and adapts well. I'm happy!", "Date": "November 17, 2009"}, {"Title": "IP110W - Delighted with it", "Author": "John Warner", "ReviewID": "R3FQSHCV3K4EGN", "Overall": "4.0", "Content": "I bought this on sale and I'm so happy with it I have ordered another off sale. Image quality is better than I would have expected at this price. To get better you'll have to spend much more. I don't give it 5 stars because of it low light quality. But this isn't sold as a night cam. I would also have liked access to a couple of extra settings on the network set up but the average user would not care about this so it isn't perfect but not far off. For simple casual use this is a great buy and an easy way to keep an eye on things around the house from work. I think someone else here has pointed out it has Linux at its heart which is nice. The UPnP ability is a nice feature in your home network. For the price I haven't seen a better camera.", "Date": "May 17, 2009"}, {"Title": "okay IP cam", "Author": "George Gorospe \"GG\"", "ReviewID": "R3L0W8JO22URKX", "Overall": "3.0", "Content": "the date and time even with the latest firmware the date is only up to 2008", "Date": "April 10, 2009"}, {"Title": "Awesome Nanny Cam for the price", "Author": "ZombieTalk \"zombietalk\"", "ReviewID": "R1ETNC9X73J52Y", "Overall": "5.0", "Content": "I was surprised at the resolution of this camera. I have been using it as a nanny cam for about a month and it always works just as expected.I only have one small complaint. When the camera loses power, it forgets the date and the time. I still rate it a 5 cause the date/time on it are unimportant to me.", "Date": "March 26, 2009"}, {"Title": "OK camera, somewhat lousy interface", "Author": "ET", "ReviewID": "R1BQKBE3E4GEJC", "Overall": "3.0", "Content": "The image quality is pretty good - definitely no more resolution than panasonic but aggressive noise reduction, so it looks a lot cleaner, though I would argue it's too smeary. Live view is laggy. FTP allows a maximum of 2fps upload. Also, there is a 4mb chip inside, but whatever it's used for, it's not to buffer images. at ~30kb each 640x480 jpg, you better have 240kbps pipe to and from your ftp server if you don't want to drop frames. Unit and wall wart get quite warm, even with wireless disabled. No external on/off switch. Must use IE to configure the motion sensor (some have reported IE tabs in FF works, but it didn't for me). Mine didn't have WPA, only WEP. Tried a firmware update and the interface claimed the FW didn't match the unit (yes I double checked).I can't totally dog it, because it's half the price of the panasonics, and it does more or less work, though its a hassle to configure, but the panasonics are better cameras w/ a better interface. Barring an epiphany, these will be going back.", "Date": "March 16, 2009"}, {"Title": "Good value for the Money", "Author": "Jes1510", "ReviewID": "R39JKU6X14Y5RY", "Overall": "4.0", "Content": "I bought this camera for a project without knowing for sure how it would perform.  The video is nice and smooth over a Wireless G connection and latency is less than a second.  Images are nice and crisp and look great for a cheaper camera.  The power supply is rated at 5vDC and 2.5A although I have not measured the power consumption.  Overall I'm really pleased with it.Setup was a breeze if you take the time to read the instructions.  Keep in mind I am definitely what would be called a technical guy but even I read the instructions.  Everything worked great the first time.If anyone cares, this camera does work out of the box with the latest release of Roborealm.", "Date": "January 14, 2009"}, {"Title": "Excellent product!", "Author": "Eric M. Mieses", "ReviewID": "RI2NV6IMLY2BV", "Overall": "5.0", "Content": "Picture quality is top notch. I would like this camera to work at night but is not designed for that. During day light is awesome. Recommended.", "Date": "October 6, 2008"}, {"Title": "Great Camara for the price", "Author": "M. Pereira \"magon\"", "ReviewID": "R1P9KKM3EQHYU9", "Overall": "4.0", "Content": "I had a previous survillance wireless camera at home and now I ordered 2 more cameras. This amazing device has a really good quality on the image, has night vision,speaker/mic to listen the room where the camera is placed. Also, I can reach my cameras over the internet from any laptop or from any iPhone or Android.I definitely will recommend this camera for your home, small business, home/business", "Date": "October 26, 2011"}, {"Title": "Great with ZoneMinder", "Author": "Muddy \"David VT\"", "ReviewID": "R2C9QKCG81M854", "Overall": "4.0", "Content": "This successfully replaced an old USB webcam and allowed me go green by turning off a PC that interfaced the old USB webcam.It took me a couple evenings to get the TRENDnet to work properly but it was a good challenge since the outcome is fantastic.I installed zoneminder on ubuntu 9.04 on VMWARE ESXi4 on a Quad Dell 520 Desktop Inspiron.  No suprises and the webcam works great!!!The ESXi4 install is being used to clean up my office of numerous power consuming computers.Buy the TRENDnet and enjoy it!", "Date": "June 25, 2009"}, {"Title": "Camera works well but...", "Author": "Schnauzer", "ReviewID": "R1XHT06SGBEJPK", "Overall": "4.0", "Content": "This is a good internet camera and works well when it is WITHIN a home network.  It is not easy to set up however.  I had to make several calls to TRENDNET tech support to get the camera working and it only works inside my network.  In other words, I cannot view the camera from outside my network.  It may be something in the router or the modem, but neither TRENDNET nor VERIZON could get it working when trying to access it from outside my home network.  That was the frustrating part.  Right now I am using it within my netowrk to keep an eye on my cats upstairs.", "Date": "December 29, 2008"}, {"Title": "Tottaly will not work!!!", "Author": "Randy M \"rdm\"", "ReviewID": "RFQ6RWHCZNTFE", "Overall": "1.0", "Content": "I've set up lots of internet cams. U just plug them in wired (at first), install software to detect it and set it up. But this Treadnet TV IP 110W? A huge no go! The cam was detected, but will not keep a stable wired IP. Online-offline. Back and forth. And totally unable to access this to change IP or view via their software. You know.. we shoud not have to F... mess with this stuff like this to get it to work. It should just do its thing. Period.This cam is going back asap. At least Amazon is paying for return ship. Will NEVER buy any trendnet items again... never ever never! Setup should always be a no brainer. This internet cam is a total waste of time.", "Date": "April 6, 2010"}, {"Title": "Confusing setup", "Author": "LookOutBelow", "ReviewID": "R2Z0DA23LGJ95D", "Overall": "2.0", "Content": "The instructions for this camera were  too ambiguous (flow/order of screen prompts incorrect, missing steps, vague, etc), and after spending 5 hours with this product, I decided it was no longer worth having.  Although the camera components  do seem like they are made well, I only will give this product 2 stars because consumer electronics should be easier to setup than this.  You need to have prior knowledge of IP addressing and network setup, and don't expect a well thought out install wizard to do it for you.", "Date": "September 26, 2009"}, {"Title": "Didn't work", "Author": "Amazon Customer", "ReviewID": "R1KKGZXBFZDFWC", "Overall": "1.0", "Content": "Stopped working after 2 hours... whenever I would go to the webpage it would just stop working.  I tried it wireless and wired.  Sending it back for a refund.", "Date": "March 5, 2009"}, {"Title": "Does Not Work In Sunlight", "Author": "Reed White", "ReviewID": "R291BTFCC6IP4U", "Overall": "3.0", "Content": "I gave the TRENDnet TV-1P110W camera three stars because it works well in normal room lighting, but produces a [useless] white screen when pointed out the window at terrain lighted by sunlight.  In other words, this is not the camera you want for looking at your yard through a window.  In my experience, an Axis 207W works well for both inside and outside views, except that the Axis 207W seems to hang every week or so (requiring a power cycle reboot).Mac users should note that a Windows PC is required for setup.  Afterwards, a browser on a Mac seems to work for most functions.  (However I don't think the digital zoom works on a Mac.)This camera has a handy FTP feature, which enables the user to send a series of .jpg files to a host computer.  The feature works, but I could not find a way to simply send a file on interval or event with the SAME filename every time.  This is what you need if your application is to update a photo on a website every time there is movement or on an interval of, say, 30 seconds.I have some computer savvy, yet I find setting up a new webcam to be frustrating at times.  Anyone who is computer-phobic should definitely expect to invest time and frustration in setting up any unfamiliar network webcam -- but the result will hopefully justify the effort!", "Date": "June 17, 2010"}, {"Title": "Bad Compatability.  Bad Manual.  Does work, sort of.", "Author": "SH", "ReviewID": "R79XJDLL7HM2F", "Overall": "2.0", "Content": "I bought this as a Christmas gift for someone.  The day after Christmas, the price is almost half what I paid a few weeks ago.This camera has mediocre image quality and works terribly in dim situations.After fighting it for hours, I discovered it has no ability to use DNS names.  Only IP addresses can be used.  So if you want to set it up to synch with a time server, you have to use the IP of the time server.  Once I got past that, I discovered there is no abillty included to log into an email smtp server securely.  So it won't work with hotmail, gmail, or maybe your own ISP.  This may require leaving a computer running to send email or log the images.The manual is horrible with bad English and simply no explanation whatsoever of the menus and features.  There was a printed multi-lingual quick setup manual and a semi-useless PDF manual on the CD.The included cord on the A/C adapter is way too short.  It's also black while the camera is white/silver.  That may seem like a small factor.  But considering it comes with a fairly nice, heavy mount for the wall, the cord is too short to get power to it.  Then there's this black a/c adapter dangling in the middle of the wall with an extension cord.Motion detection has two regions that can be set, which is handy.  We've found it works inconsistently.  For example, in about a 5-10 second period, it sent about 30 emailed imaged even though it was set to send 1 email every 3 seconds.  This may again be due to the bad manual and lack of explanation of how any of it works.I'd have felt better if I got it for the 60 bucks it's on sale for now instead of the over one hundred I paid.  For 60, it's an ok deal, even with the problems.", "Date": "December 25, 2009"}, {"Title": "Easy to use", "Author": "Mark Lee Welton", "ReviewID": "R24GKFZRJ2IAYI", "Overall": "5.0", "Content": "This product was very easy to install.  Not being an IT person this product scared me, but it was very easy to install and use for basic security use.  I am purchasing three more of these cameras.", "Date": "January 6, 2009"}, {"Title": "Small camera", "Author": "J. S. Butler", "ReviewID": "R1M6DWQEWXAKPR", "Overall": "4.0", "Content": "This camera is a nice compact one. It is average quality but it is easy to set up and works good.", "Date": "May 7, 2009"}, {"Title": "Better When It Cost Less", "Author": "Amazon Customer", "ReviewID": "R3EXIAWZNW25F1", "Overall": "4.0", "Content": "This product was much better yesterday (4-14-09) when the price on Amazon.Com was $67.96 (guess they figure we all have big tax refund coming).  Price jump of $40.00?  If you want it, buy it from TigerDirect.Com or CompUSA.Com where the price doesn't go up 40% overnight!", "Date": "April 15, 2009"}, {"Title": "Piece of junk", "Author": "Papa Carlo", "ReviewID": "R1ALHY4GZS52AW", "Overall": "2.0", "Content": "If you want from time to time to look at your place through the monitor the camera will do the job.  Kind of as the image quality is very so so.But if you want to rely on this as the security camera look somewhere else.I installed it over my porch. The camera worked fine. I set it up to send motion activated images to my ftp server.The first thing I noticed that even though there is a lot of light the quality of the images is such that you will not be able to recognize the face even if the person is looking straight at the camera.But that is of no importance as in a week the camera stopped connecting to the computer. Sometimes it still sends some images to the ftp server when it is pleased but I do not see it from the computer anymore.", "Date": "November 26, 2010"}, {"Title": "awesome", "Author": "G. Brendel \"GABE\"", "ReviewID": "R3HSLEZ6Z59XSG", "Overall": "5.0", "Content": "I have 2 Wireless cameras, they work perfect, in (my particular case) I have to many problems to make it work remotely,because my router ,great factory soport , I can see the cameras with my IPHONE, IN CASE YOU CAN'T MAKE IT WORK DON'T GUIVE UP, JUST CALL SOMEBODY ELSE . IF YOU ARE INTERESTING TO GET A 24 HR CAMERA THIS IS THE WRONG ON, YOU NEED TO BUY THE DAY AND NIGHT.THE PICTURE I HAVE IN MY iPHONE IS PERFECT BUT STILL YOU WILL HAVE A 5 SECONDS DELAY UNFORTUNATELY IS NOT A 100% REAL TIME, BUT IN MY COMPUTER IT IS A 100% REAL TIME.AFTER ALL WAS A GREAT DEAL AND IT WORKS GREAT", "Date": "May 5, 2009"}, {"Title": "Not a trustworthy Company", "Author": "B. Offor", "ReviewID": "R2Y0J0HQVPTPF1", "Overall": "1.0", "Content": "The company advertized a $30 rebate for each unit sold. I bought 4 and the company refused to honor the rebate for no reason. All requirements were met. When I spoke with the customer rep Gol, she said they were sorry that it is one rebate per family. It was not what they advertized. However, they sent 4 cards out to me and claimed the household was rejected because rebates were already processed for the address. False advertizing.The camera is for day light use only, period. The resolution is very poor if you want to view the image on a full screen. The frames are very slow that from onr frame to the other takes very long. It is a cheap camera and that is the only good thing about it. However, it is a waist of money. I will not buy from this company anymore, not even for other products from them. Before delving into buying this product, company with other models.If you know IP networking very well, it should be a synch to setup and it only works on windows. I suspect that the better reviews this camera get is from the company, they login to boost the review.", "Date": "March 17, 2010"}, {"Title": "Know What I'm Doing - Camera Didnt Work", "Author": "M. McNeil", "ReviewID": "R3BS4LZ6JV65TX", "Overall": "1.0", "Content": "I'm a reasonably experienced person when it comes to setting up network items - with several other IP cameras, network servers, etc. - and this one didn't work.I tried it with both their 'wizard' and manually setting up the camera - both failed.  The camera lost all IP and other settings each time it rebooted, making it essentially useless on a network.  And their tech support didn't supply any helpful info, either.The camera is on its way back to Amazon (which, by the way, was efficient in managing the return).", "Date": "December 2, 2009"}, {"Title": "Needs EXPERT networking knowledge to get this this running", "Author": "Sri P. Rangarajan", "ReviewID": "R1T9CD63022MR7", "Overall": "2.0", "Content": "I bought this camera as a security measure to monitor my home when I was away. Could not set up the camera remotely. It works fine when on home network. Numerous call and after spending over 4 hours with tech support, still was unable to resolve the issue.The tech support keeps saying open the port on your router and even after it is opened, it still is not viewable from a remote location. The manual is HOPELESS, does not talk anything about configuring from a remote location, setup of a static IP address, opening ports on the router nothing. Ultimately, tech support falls back on their excuse of \"we cannot help with other routers\". Isn't the camera supposed to work with any router and not just a Trendnet router? I will be happy if they stop playing this chicken and egg game and produce an IP camera that is easy to operate remotely without someone having any EXPERT networking knowledge. They advertise it as a networking camera, but nothing more than a nanny cam that can only be viewed on the home network.", "Date": "May 13, 2010"}, {"Title": "cannot configure", "Author": "bern777 \"bernie1@mediaone.net\"", "ReviewID": "RJE9TX9VVEFXY", "Overall": "1.0", "Content": "The software is bad and support is awful. After wirking on this for over a month I gave up.... Cannot view over internet. Support gives brief answers that are usually irevelent......................", "Date": "April 30, 2009"}, {"Title": "I am not a router expert...", "Author": "psquare", "ReviewID": "R1OR5WF6ANCJQJ", "Overall": "1.0", "Content": "...but I guess neither are their customer support \"experts.\"  To make a long story short, after finally getting a hold of someone that spoke english, I was told to call ATT and then call them back. After calling back with ATT's instructions and still not getting any results, I was finally told by these \"extremely helpful\" individuals that \"oh yeah\" if you have an ATT (2wire) modem and you cannot get a static IP address from them then you are basically out of luck. I would have to purchase a static IP address from ATT if they would sell me one (which he doubted they would). Considering that not many people have ATT DSL lines (yes, I am being sarcastic) that should not be a problem and they obviously don't see a need to warn consumers. If you want to lose your shipping charges and waste three hours of your life go for it and buy the camera. P.S. If you have a case number assigned, such as when you call back a second time, be prepared to wait much longer for assistance.", "Date": "August 1, 2008"}, {"Title": "Easy to setup and work great...", "Author": "S. Charney \"Scott\"", "ReviewID": "R147EC4ZJGMTWG", "Overall": "5.0", "Content": "I purchased two of these recently.  I was a little skeptical, but after reading all the reviews, couldn't pass up on the price.  We've been wanted to setup a wireless security system for some time, so finally broke down and purchased these.  The setup via the installation CD makes getting them on your home wireless network a breeze.  The setup for remote viewing was a little more complex, but once I found a TRENDnet DIY setup on YouTube, life was a breeze.  They went step by step on how to setup the remote viewing.From start to finish, all setup and running in about two hours.  That included the time looking online for how to do the remote viewing.  The SecurView software is great, as you can watch up to 16 cameras live.  Works great with two cameras.  Does bog down my PC a bit if I want to multi-task, but if all I'm watching is the cameras, it works great.Great product, plan to buy more TrendNet Cameras to complete the system.", "Date": "August 20, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00125KR1E"}}