{"Reviews": [{"Title": "Fun little camera for shooting slow-mo.", "Author": "K. Shin", "ReviewID": "R2QFXNPWTJZEQE", "Overall": "4.0", "Content": "As a simple point and shoot, this camera delivers a ton of options geared towards non-experienced photographers, meaning, no manual controls. But on the flip-side it gives you a whole bunch of custom shooting modes. Almost to the point where it feels like a type of pseudo-manual control. Instead of setting you aperture to wide open for portraits, you just set it for portrait shooting. Instead of setting a high shutter speed at your kid's soccer game, you set it to high-speed sports. I can live with that.As for video, the title of this review sums it up. Don't expect to shoot anything of real quality with this camera. First of all, you need a lot of light. Otherwise, the noise is pretty bad. Secondly, this being a CMOS sensor, the jello-effect is pretty pervasive. Plan on using a tripod or monopod whenever possible. Handheld footage is pretty awful, even with the stabilizer turned on.Despite this, I did have fun recording my golf swing at 210fps. And when it comes down to it, this camera is meant for fun and it delivers.", "Date": "April 6, 2009"}, {"Title": "Casio Exilim FC100 = FUN", "Author": "Jason L. Hall \"Hallvalla\"", "ReviewID": "R2QSENQALW4G3B", "Overall": "5.0", "Content": "Just received this little powerhouse today and have already made a panorama and a high speed video. Really easy, and just really a fun little camera - and it has its flaws, of course.One quick note: you must feed this camera LIGHT, especially in the high-speed video and 30fps burst modes. Expecting anything decent indoors or at night and you'll be disappointed. The regular still pictures are fine, though. I viewed plenty of high speed clips on YouTube and indoors you will get flicker (usually from flourescent lighting), but it still does the job. This camera shines outdoors.There are three main functions that are really great and unique (can't emphasize unique enough) for a P&S.;1. High-speed video: the 30 - 210 is awesome. 210 on its own is good too, obviously. 420 is good for a science experiment or something that you really don't care about the size and resolution (plus massive compression). 210 FPS will show you a whole new world. And it does do 1000 FPS, basically useless but if you need to see how a lighter works then well, 1000 FPS is for you.2. 30 FPS burst: This is really a nice feature. The FC100 takes 30 6 megapixel shots in one second. Think about that for a second, very cool. And the images are clean and clear. Quality is fine, unless you're a pixel perfectionist. I did a quick panorama of San Francisco (from Alameda) by simply clicking on the shutter button and moving the camera (quickly) from left to right. Stitched them back together for a nice panorama that I didn't waste a lot of time taking manual pics. But this function has some many other uses. I'll probably use it most of the time for any old pic because you can select the best (camera also will do this automatically for you) and delete the rest. Pretty cool. You can even set it to start taking images BEFORE you hit the shutter (when you hit the shutter, the camera has already cached a specified number of images in case you miss something by a fraction of a second. I'm not using the SLOW feature that basically is another way of doing the above.3. 720P Video: One of the other reviewers didn't like that this camera doesn't allow autofocus (or zoom) during HD video. I use a different camcorder for video, so I just like having the option just in case. Looks nice.The high speed features are more than a gimmick, imo. The 210 FPS and one-second 30 FPS (@ 6 megapix) burst modes are worth it alone. This camera isn't made for a family portrait or the second coming of Ansel Adams. Use it what it's good for - outdoor sporting events, fast action, even your dog chasing a squirrel - and you'll be happy. I am.This review by CrunchGear nails it: [...]", "Date": "April 2, 2009"}, {"Title": "Auto Focus does not work during Video.", "Author": "R. Reinhardt \"What do I know?\"", "ReviewID": "R32K756WQ5ZIX1", "Overall": "3.0", "Content": "I have a 4 year old Casio EX-Z750 that I love, so I know something about what a great camera Casio can make.  This one fell short for me because of one simple reason.  Auto Focus does not work during Standard or HD movies.  A bigger problem is that you can't even get focused and then start videoing because it has something called \"Fixed Focal Length\". This is technical jargon for \"We were too lazy to do the focus right.\"  My 4 year old Casio EX-Z750 auto focuses during video.  The videos that the old camera takes are awesome.  The videos this one takes are all blurry because of the focus issue.  Hopefully Casio will get their act together and put together a firmware to fix this.  I have contacted support and let them know about my discontent with this and if others do as well, I think it can be addressed.  Like I said, their camera could do it 4 years ago.Beyond my HUGE complaint.  The high speed video is awesome.  It takes great pictures and video of action.  They got the part that most people are buying this camera for right.  The problem is I bought it to also take awesome regular speed HD videos.  I purchased a 16 GB card for it since I knew that it would eat a lot of space to do these videos.  The problem here is that the camera will only take videos up to 4 GB in size.  This means 18 minutes.  54 minutes in standard.  Yes I can have 4 4 GB files on one card, but if I am going to video a performance of something I don't want to have to hit start and stop every 18 minutes.  This isn't a deal killer like the lack of focus, but it's annoying.  You cannot change the detail level to something like EP, LP, SP like with a video camera.  Just 18 minutes or 54.  The camera records video in MJPEG.  This means huge file sizes.  My macbook pro easily opens the files and visual hub quickly converts them to smaller MP4 files without loosing much quality.  I wish the camera recorded in h.264, but it's okay that it doesn't for this price.It's nice having a dedicated video button, but they put it in the wrong spot.  I am constantly hitting the camera button next to the play button to start videos.  I am sure I will adjust over time, but that's where the button should have been.  Another thing I miss is that my Z750 allowed me to choose to have the right and left selects switch between white balance. It's still easy to change, I just miss that ability.  The white balance on auto works well and the manual white balance fixes when it doesn't.The camera mechanicals are a lot slower than my Z750.  The Z750 blasts the lens out of the body in what seems like an instant and is ready to start taking shots.  The FC100 takes a couple seconds longer in turning on and off.This is not a bad camera for the price, but Casio had a chance to make an awesome camera for the price.  Hopefully they will get their act together and fix the focus issue.  If they do, this is a 5 star camera for me.  Til then it is only 3 star.", "Date": "March 29, 2009"}, {"Title": "High speed video, for around $300=Unbelievable!", "Author": "nikon fan", "ReviewID": "RO4B2BZ3A34VB", "Overall": "5.0", "Content": "First and foremost just the fact that you can get a camera for under $300 that will take 1000FPS video is enough to buy this camera. Find me anywhere where you can get this type of performance in a camera in the $300 price range, I think you will find that it is impossible. I just don't believe that the naysayers understand the kind of incredible performance this camera is capable of. This is a one of a kind camera that is at a price that is unheard of.Having said that, the quality of the video is OK, but again what do you expect for $300, c'mon. It is a steal at this price, and the video is useable and not meant for high quality video, it is a fun way to experiment with super slo-mo. I have found that this camera is everything I had hoped for, it take adequate still photos, and has 1000FPS capabilities, unheard of in a camera in this price range. I have read for this price we expected............, a Point & shoot camera is designed to take all the thinking out of picture taking and leave the decisions in the hands of the camera. They are not for the thinking photographer, they are for a novice who may not have a grasp on basic photography. Sorry but it is true. You want control over your photos, pony up at least $900 and get a quality consumer grade DSLR, then you can have some say in how your photos come out. No RAW ability, OK, no control, no shutter, aperture, or manual controls, no control. small CMOS sensor = NOISE, too many pixels jammed into too small of a space, sorry, you are not going to get high quality photos. You will get usuable photos up to 8 X 10, good precieved sharpness there. Pro quality, no, too much noise, snapshot quality, yes very good for that type of shooting.Having been a photographer for 25 years I have spent over $25,000 on photo equipment, this is my first Point & Shoot, why? Because it will do 1000FPS, that is amazing, and I will use it to create some fun family videos, quality is good enough to create fun useable video for your family slide shows. I will carry this with me all the time and shoot anything that looks like it will be interesting, there are so many possibilities with this camera you should only be limited by your creative abilities. Do a search on-line and see what people are doing with this camera, you will find some seasoned photographers now have a tool that was before out of reach. You now have an ability with this camera that was reserved for professional videographers who could fork out many $$$$$. You can get it for around $300, I love it 5+ Stars, and for the price I will get a second, for some really interesting video shooting. Don't let some talk you out of a capable camera, you will not find a more affordable capable camera anywhere. Casio really hit a homerun with one, Casio is a reputable company who has been is business for many years, they wanted to come up with a camera that the consumer could have that gave them abilities that were only for the photographers who had lots of dollars to spend on equipment, you now have that ability. Sorry, but high speed video is not a gimmick, it is used everyday in film making by those who have way more abilities than most of us. Get the camera you will like it, if you don't I'll take it off your hands cheap.", "Date": "June 22, 2009"}, {"Title": "Decent camera, but it has its downsides. [WARNING: LONG REVIEW]", "Author": "SeekayFilms", "ReviewID": "RDB9YMOCULZAJ", "Overall": "4.0", "Content": "Ever since I bought a Canon PowerShot SD1000 7.1MP Digital Elph Camera with 3x Optical Zoom (Black) in August of 2008, I have been taking tons of pictures. Almost daily. When it finally died after about a year of use (in August of 2009), I bought this camera, mainly because it had the ability to shoot videos in High Speed (210, 420, 1000 fps). To emphasize how many pictures I take, I have taken over 6500 photos since I've gotten this camera. I'm not disappointed with my purchase, but I'm not overly thrilled either, and here's why.Because this is such a long review, I included this Review Order:Video-HD-STD-High Speed-Editing-SummaryPhoto and Photo Settings-Photo quality-Zoom-Settings-SummaryBatteryOtherEndVIDEO:I think a main reason that people will want this camera is because it has the ability to shoot in HD video. 720p HD video, to be precise. For the people who don't know what that means, like myself, it means that it shoots in 1280x720 pixel dimensions (If you want to know how big that would show up on your computer, then just google \"1280x720\" and some images will come up that are that size). I don't know how many fps it shoots in, but I would assume 30. This HD video is all fine and dandy, except for a few problems. Unless you're videoing in daylight, there will be a noticeable amount of noise in your videos. Not the audible noise, but image noise, which kind of looks like static. Also, it takes up around 3.5 MB for every SECOND of video. That means that if you have a 30 second video, it will take up around 100 MB of storage space on your computer, which, to me, is a lot.My personal preference is to use the STD video (the smaller resolution). The dimensions on the STD version are 640x480, and it shoots in 30 fps. This only takes up a little over 1 MB for every second of video. This is the smallest resolution that you can get on video (while still including audio). It has the same problem with the HD video regarding daylight shooting. If you're shooting in anything other than natural daylight, there will be noise.On to the High Speed video. (One main point that I'd like to make first; High Speed video on this camera ONLY works in natural light. If you try it with light bulbs or something, you will get a strobe light effect during playback) There are four different options that you can have for this. You can shoot in 210 fps, 420 fps, 1000 fps, or 30-210 fps, a cool little feature that allows you to shoot in 30 fps (normal speed) and then switch into 210 fps (making it seven times slower). Armed with this, you can come up with some pretty creative video shooting ideas, such as someone running up to a wall in regular speed, then right before they jump onto the wall, you can slow it down. You have to be pretty quick with your fingers, though. ONE DISADVANTAGE ABOUT THE HIGH SPEED VIDEOS. No audio is recorded. At all. That was a bit of a disappointment when I received this camera. I don't remember seeing it being addressed before, so I'm addressing it here. Okay, now into a more detailed view of the high speed video. The 210 fps and 30-210 fps video settings are shot in 480x360 dimensions. The 420 fps video setting is in 224x168 dimensions. The 1000 fps setting is shot in 224x64 dimensions. My personal favorite is the 420 fps setting. It's at a decent slow rate, but it's not too small to see what's going on.The editing is pretty nice, better than the Canon had. With this camera, you can cut the beginning, end, AND middle. One downside though, when you import it onto your computer, whatever time you edited it becomes the time that it was taken. That's not a huge detail, but it bothers my partially-OCD mind.Summary of Video:HD video is superb in quality, as long as it is in natural light. However, the file size for it is very large (kind of a 'go figure' aspect, but I'm including it anyway).STD video is a good setting, as long as it is in natural light. Not overly huge in file size.High Speed video was a little bit of a letdown for me, but if you can live with only using it in natural light and having it not be in the wonderful quality that you see on Mythbusters or Time Warp, then it's pretty nice. My personal recommendation is to use the 420 fps almost all of the time.Random comments: You can't shoot video in Macro. This was a huge blow for me, what with my first camera being a Canon and stuff. Also, THE VIDEO DOES NOT AUTO FOCUS. I don't think any point and shoot camera does that. When you start to record a video, it's fixed in the focus that it started with. You don't notice it when you start recording 10 feet from an object and then move 5 feet away from it. But if you started 1 foot away and then move closer, you'll notice.Now on to the actual point of a camera, the photos.PHOTO AND PHOTO SETTINGS:First things first: It does not have a viewfinder for your eyes. All it has is the screen. Nothing else.The quality of the pictures is very nice. Comparing photos from my Canon to this Casio, I actually think that the Casio is better in most ways. The flash isn't as severe (you can actually choose the intensity of the flash, which is awesome even though I usually don't use it). Here are some options when it comes to picture-taking:Resolution: 3456x2592, 3456x2304, 3456x1944, 2816x2112, 2304x1728, 1600x1200, 640x480.ISO: Auto, 100, 200, 400, 800, 1600White Balance: Auto WB, Daylight, Overcast, Shade, DayWhite Fluorescent, Daylight Fluorescent, Tungsten, Manual WBColor Filters: None, Black and White, Sepia, Red, Green, Blue, Yellow, Pink, IndigoExposure: -2 through +2Slow Motion View*: 1sec (30 fps), 2sec (15 fps), 3sec (10 fps)Slow Motion View Speed**: Slow (1) through Fast (8)Lag Correction***: 0.3 sec, 0.2 sec, 0.1 sec, OffFlash: Auto, Flash Off, Flash On, Red Eye Reduction*There's a button on the camera that allows for \"Slow Motion view\" that will display the next few seconds in slow motion, based on the option you chose. \"1sec (30 fps)\" would display the next one second in 30 different frames. \"2sec (15 fps)\" would display the next two seconds in 30 different frames, and \"3sec (10 fps)\" would display the next three seconds in 30 different frames. A good idea for people who are into sports.** This controls how fast the aforementioned slow motion view plays back the frames, from Slow to Fast.*** Just in case something happens and you're delayed in pushing the shutter button. This fixes the lag that your reflexes create.A little detail I'd like to make about the zoom. 1x-5x Optical is very nice quality. The digital zoom following the optical zoom isn't the best, but it works as well as you can expect it too. It washes out the subject a little, but not enough to panic over. If you want to see how powerful the zoom is, look in the \"customer images\" section. I uploaded a picture under \"SeekayFilms\" that shows how much zoom 20x is.Note about how far the lens extends: With no zoom, the lens juts out 1.25 inches (3cm). At the highest magnified zoom, the lens juts out around 1.4 inches (3.5 cm)This camera has a lot of \"BestShot\" options, too. To name a few, there's Auto, Macro, Children, Sports, Sunset, Autumn Leaves, Nightscene, Fireworks, High Speed Antishake, Multi Motion Image, Move out CS, Move In CS, Prerecord, etc. I'll explain the ones that are mostly special:Nightscene: Takes between 10 and 30 pictures, then compiles them into one for a nice, blur-free night image.Fireworks: Leaves the shutter open for around 2 seconds. Good especially for lightning pictures (but that may only be me).High Speed Antishake: Same concept as the nightscene setting, but this one is intended for daylight photos.Multi Motion Image: Now this one is interesting. You'll need a tripod for it, though. Or a REALLY steady hand. I'll use an example to explain it. Suppose you were watching a snowboarder go off of a jump. If you took the picture right as he left the ramp (and didn't move the camera at all), you would have a picture that included him on the ramp, just leaving the ramp, in midair, etc.Move Out CS: Another tripod-requiring mode. Let's say you wanted a picture of a bird flying off of a branch. You find the bird on the tree. You make sure that a box on the camera display surrounds him. You press the shutter button. Then he flies off. As soon as the camera detects that the bird is leaving the box, it snaps a succession of 30 frames that you can pick and choose from.Move In CS: Same concept as above, but this is for if you wanted a picture of the bird flying onto the branch. As soon as the camera detects something entering the box, it snaps a succession of 30 frames that you can pick and choose from.Prerecord: This is for videos. It prerecords 5 seconds of video. So if you start recording the video at 1:10:35 PM, you'll have all of the video from 1:10:30 PM through 1:10:35 PM.Another thing that I like about this camera is the \"30 Frames Per Second\" shooting mode. You put the camera into this mode, and the next time you press the shutter button, it will take 30 frames in one second at a resolution of 2816×2112 per photo. Then you can choose \"Save All\" or \"Save Selected\". I find this to be a very fun thing to do when my dog is running around the backyard.Summary on the photos:I actually really like the photo settings on this camera. There are some \"eh\" parts, but all-in-all I think that the photos are pretty good.One thing that annoys me, though. It has a lot of problems with focusing at night, especially if I'm zoomed in on something.BATTERY:I almost forgot to add this. The battery life of this camera is pretty good. I used to find myself charging it every three days, but recently, once a week works out pretty well. There's a bar that tells you how much battery life is left, but it tends to fluctuate randomly, depending on what setting you have it on. Sometimes it goes down to empty right after I take a picture, then returns to 2/3rds full. It takes between one and two hours to charge it fully, but it's not a necessity that you keep it charging that long. Usually what I do is I stick it in there before I go out somewhere, then just take it out when I'm ready to go.RANDOM NOTES:This is a surprisingly durable camera. I mainly only say that because I dropped it into snow in my backyard and couldn't find it for three days. When I did find it, it still worked. One bad thing, though. Before that happened, the lens cover had been having some problems. When I turned the camera on, it wouldn't open all the way. I began to suspect that it did this in cold weather. After leaving it in the snow for three days, it has been having this problem permanently. I contacted Casio about it, and they said it was something that would require me to send it in for a repair. I might end up having to do that sometime soon, but given how many pictures I take, it's not an idea that I smile upon.Also, the strap that it comes with isn't that great, at least not for my hands. So I just used the one from my deceased Canon camera. You also have the ability to put it on either the right side of the camera or the left side.SUMMARY:This is a decent camera for $217 (the current price). When I bought it in August, it was $250. Seems pretty durable, except for the lens cover. It seems like a very daylight-oriented camera. The video has a lot of problems if you're not shooting in natural light, which is a bust if you want to video something at night. Photos turn out decently when taken at night. I've noticed that, right after a sunset, there's sometimes a noticeable amount of noise in my outdoor photographs. But only in some of them.All in all, I wouldn't highly recommended this camera, but I definitely wouldn't label it as a horrible camera.Sheez, I hope that's everything. I'll probably publish this, then remember something to add. Oh well, such is life./review", "Date": "December 17, 2009"}, {"Title": "Happy with my purchase", "Author": "A. Hearn", "ReviewID": "R1ASNMO97DH1B4", "Overall": "5.0", "Content": "I did a lot of research and read countless reviews of this camera before I purchased. I bought it for three reasons; (1) as a pocketable, more handy companion to my large Nikon D300 DSLR, to be used when a quick snapshot or video is more important than image quality, (2) slow-motion capability - you can't get this kind of capability at this price anywhere else, and (3) high-speed continuous shooting to help capture elusive action shots.I went into the purchase knowing it is not the best point-and-shoot out there but I wasn't simply looking for a point-and-shoot. The incredible exclusive features of the camera were more important, especially those made possible by it's high-speed capabilities.Most of the pros and cons of the camera have already been stated in other reviews. On the plus side, I like the sturdy construction, ease of use, large bright LCD screen, simple menu structure, ability to directly control all parameters except shutter speed and aperture, high-speed continuous shooting, slow-motion video, ease of downloading images, great anti-shake that works well for photos but less well for videos, HD videos look great, and precapture functions. Battery life has not been a problem so far. I haven't used the flash at all.On the minus side, the quality of photos could be better and less grainy at higher ISO levels, although it is certainly acceptable for most shapshot situations and most of the purposes for which I will use the camera. I wish the battery charger was the type that simply plugs into the wall socket instead of having a big bulky electrical cord.Having done my research and knowing what to expect before buying, this camera met or exceeded my expectations.", "Date": "October 4, 2009"}, {"Title": "Slow-motion footage is awesome!", "Author": "Orion S. Lawlor \"Dr. Graphics\"", "ReviewID": "R3MBAGEGLB6W2F", "Overall": "5.0", "Content": "I've owned a lot of digital cameras, but bought the EX-FC100 for its slow-motion capabilities, which are truly incredible.  It will shoot 210fps--7x realtime--at a respectable 480x360 pixels, and you can watch the cat react to a bouncing BB, or shoot gorgeous footage of liquids splashing.  But it really gets going in 420fps mode--14x realtime--at a tolerable 244x168 pixels, where you can watch flouresent lights flicker blue and brown, watch your engine's fanbelt spin, or even (if the lighting is right) watch slow bullets like .45acp zip through the air.  There is also a 1000fps mode where raindrops float down ever so gently, but it's an almost uselessly tiny 244x56 pixels in a weird flat banner-ad aspect ratio.  Slow motion is awesome.  However, you'll definitely be using the onboard video trimming feature, because in slow motion it takes a long time for interesting stuff to happen.  I was also bummed that audio isn't recorded in slow motion mode.The other unique feature the camera has is a prerecord capability: it continually records either 6 megapixel stills (at 30fps) or any video mode to an internal buffer.  This allows the camera to simulate negative shutter lag, by grabbing the picture in the buffer from *before* you pressed the button; or \"Prerecord\" video recording mode, where it stores 5 seconds of video from before you pressed the record button.  Neat stuff.Other than that, it's an ordinary SD card camera.  Stills look fine, with the usual slight graininess in high-megapixel modes.  High-definition video has the weird skewed \"jello effect\" common to CMOS sensors, especially in low light.  My one minor annoyance with the case is that it's almost too thin to hold with one hand, but that's also nice to fit the camera in a pocket.", "Date": "June 20, 2009"}, {"Title": "Great slo-mo camera, but don't order from ANTOnline.", "Author": "H. Goble \"hg161\"", "ReviewID": "R1FDC4B8UNOGME", "Overall": "5.0", "Content": "My coach has this camera and the slow motion video he has been able to capture is incredible.  Even at the 400 frames per second setting motion is slowed down incredibly.  Sports motions that happen so fast you can't really see them are now easily seen.  Anyway, I couldn't wait to get one of my own so I purchased from ANTOnline since at this time many sellers are only pre-ordering.ANTOnline sent me an email saying that my order was lost in transit from their regional warehouse to their shipping hub, so it hadn't been shipped to me yet.  I asked why they didn't just have the regional warehouse send another one, they said it was Amazon's policy.  That's just too fishy, if they haven't shipped yet Amazon could care less.  It's far more likely they just don't have any in stock and don't want to say they lied about having them available.  They cancelled my order which made it so I couldn't leave any negative feedback about them.  Save yourself some time and steer clear from ANTOnline.", "Date": "April 3, 2009"}, {"Title": "A lot of BANG for the money.", "Author": "Edward Reynaud", "ReviewID": "R161QHP4EKA6OR", "Overall": "5.0", "Content": "I was surprised that a camera this affordable could shoot such quality high-speed slow motion video. I video tape my golf swing every few weeks and the quality is every bit as good as that on the TV broadcasts. Plus it's a pocket sized digital camera. WOW! Buy this camera.", "Date": "August 1, 2009"}, {"Title": "Perfect camera for point and shoot.", "Author": "Edward Olsen", "ReviewID": "RABWJD1XMZ86S", "Overall": "5.0", "Content": "This camera is not meant for pros.  They will complain about how it doesn't do this or that and how the whoozit could be better.  The basic fact of the matter is though, that this camera is for the regular user who just wants to take some really cool videos of whatever they are looking at.  This is like a camcorder and a camera all in one.  I've taken about equal parts video and photos with this.Caveat: Buy a big memory card.", "Date": "July 5, 2009"}, {"Title": "Outdoor camera", "Author": "Cal Wiemers \"calgw\"", "ReviewID": "R3UCYZ284TMXLY", "Overall": "2.0", "Content": "This is a great outdoor camera.  Start is quick, focus is good for single shots.  The 'action' stots or 'continuious' shots are great if the focus distance is not changing.This should be labeled a 6meg camera.  You you are not using any options or other settings, it will do 9meg.Great things:30 shots burst is great outside if the focus is not changing.The Pre record shots are great to adjust for shutter delay.Menus are easy too use and has a seperate record button. Very handy.High Speed video is fun but not need.The size and weight is good.  Easy to carry in your pocket.5x zoom works great outdoors.Not so good:Anti shake does not work well.There is about 1 sec between single shots if you want auto focus ( and you will ).'All Auto' shoot does not do well.  By the time you adjust for light, setting the 'best shot' and flash, the opportunity is long gone.The auto flash does not work at all. Always too dark of too bright. It takes about 3 shots to to get the flash manually adjusted.Bottom line: Usless indoors,  great outdoors.", "Date": "August 5, 2009"}, {"Title": "So so camera with fun gimmicks", "Author": "pika2000", "ReviewID": "RI0SHKI2ODLD4", "Overall": "3.0", "Content": "Just a brief impression.1. Very quick startup. When pressing the on-button, the lens pretty much \"jumped\" out.2. So so build quality. Body is plastic. With mine, the plastic borders feel very flimsy. The battery door is not great either, sometime doesn't easily lock-in.3. Image quality is so so. 9MP is great, allowing you to crop pictures and still get decent size. However, images suffer from extreme noise reduction. Outdoor images under bright sun-light are less detailed and less sharp than they should. Image noise vs noise reduction is an ongoing issue with compact digicams as manufactures keep cramping megapixels into those tine sensors. If you want a good compact with good image quality, look elsewhere.4. This camera can record video in 720p. Pretty awesome feature for a compact digicam, but don't expect high quality videos. Still, they're watchable and very good for fun videos uploaded to Youtube HD.5. High speed video recording is the main seller of this camera. This is where the fun/creativity begins. This is pretty much the main reason I bought this camera. The video resolution is greatly reduced though, and downright unusable on the advertised 1000fps mode.In the end, it's still a fun camera. The main reason to buy this digicam is for the high speed recording and 720p. I consider the picture taking capability as a bonus. There are other cameras with better image quality for cheaper.This camera has a cousin, the FS10. Both have most of the same features, and similarly priced. The FS10 is more compact, and the lens doesn't protrude. However, it doesn't have image stabilization, and weaker zoom.", "Date": "June 7, 2009"}, {"Title": "Great coaching tool", "Author": "Robert R. Romero", "ReviewID": "R20JQUVSQ1X4MG", "Overall": "4.0", "Content": "I bought this camera after using the other Casio Hi-speed cameras because of the smaller size. I am pleased to say that it is doing all I wanted and expected. It took a while to learn the camera functions so I would recommend reading the manual front to back. I downloaded the pdf from the Casio website.Pros-small sizeCons- short battery life", "Date": "June 27, 2009"}, {"Title": "Nice Camera", "Author": "Denise D. Konstenius", "ReviewID": "RZGOH7AP97H79", "Overall": "5.0", "Content": "Nice little camera for the money.  Works according to its stated functions and performs like a camera in this price range.  Slow motion is cool.  One thing I would like to clear up is the camera will only take 30 pictures in one second and then stop.  The camera will not take 30 pictures per second until the memory is gone.  I assume a software patch or hack could remove this limit I believe the camera is probably capable of taking 30 fps until the memory is gone but the software will not allow you to do this so the software acts like an arbitrary rule that says you can't take 30 fps until the memory is gone even though the camera can likely do this.  Maybe there will be a software patch or hack in the future that will take that limit away of course that will probably void the warranty.  This camera takes good video both slow motion high definition and standard definition.  The product has a size similar to a credit card or drivers license except thicker.  The camera fits good in a shirt pocket.  The zoom isn't bad but this is not an SLR.  Over all good small camera for the money that takes good video but it would be nice to take the limit off the number of pictures can be stored in CS mode.  The reason it would be so nice to store unlimited pictures at 30 fps is good quality movie making would be possible using a digital audio recorder and this product.  Also the other three high speed models all have this limitation of only a set number of CS shots.  The only major technical comparison between this model and their high end unit is the optics.Jeremy G. Konstenius", "Date": "May 30, 2009"}, {"Title": "Nice", "Author": "Dylan W \"Dylan\"", "ReviewID": "R1COR8J0XESIA1", "Overall": "5.0", "Content": "First off, prior to owning this camera I owned a casio ex-z75, not a bad camera but it had some problems at the end. No for the ex-fc100 I am very impressed with the picture quality and the ability to slow down time to get that perfect shot. Another thing that I have found most amazing is the ability to shoot video at 1000, 420 or 210 fps. The only fault is the darkness created at these frame rates. I also like how it only takes a second to turn on the camera in case I ever needed to take a picture in a hurry that would be great to have.After mentioning pros you probably are looking for a some cons,  The first one is the size of the video at 1000fps, but what more can i expect at that speed?, another fault is the darkness created at these frame rates. I would have more faults but I haven't spent enough time to discover them all.If you do purchase this it may take a while to learn all of its little features, and extras, I am still learning!", "Date": "April 1, 2009"}, {"Title": "Awesome", "Author": "Jack R. Headley \"wiremup\"", "ReviewID": "R2XDU75TMODKWI", "Overall": "5.0", "Content": "So far so good. Very easy to use and I learn more each time I use it. The slow motion video at 1000 FPS is amazing, just wish it was larger on screen of computer. Only draw back so far is that I use an Apple computer and they don't have software for Apple yet. You can use your iPhoto but not the you tube app. They say it's coming this month but we'll see", "Date": "April 18, 2009"}, {"Title": "So far so good!", "Author": "Izzes Gram", "ReviewID": "R2IYNLLIVEPD1B", "Overall": "4.0", "Content": "I got this classy looking little camera 2 days ago and so far am loving it.  The deciding factor will be when I have a chance to take videos of my grand daughter. (I'll add more at that time) The few videos I've taken I see no problem with the focus and I did have a problem with that when I tried the SX12. I am on the search for the perfect point and shoot with great video quality and have decided there is no PERFECT for me.  I'm just too picky!  Having said that, I'm giving this camera 4 stars for the things I DO love about it.  I won't even go into how many cameras I've tried at this time!1.  perfect size for me .. not too small, but small enough to slip into a shirt or skirt pocket.  Fit nicely in my palm while walking around the Harbor last night.  Keep the wrist strap on!2.  takes photos fast!  I was surprised at how quickly it snaps off a shot and is ready for the next one.  My husband was taking a picture of me and I told him to hurry up and take it.  He said he'd already taken 4!3.  The fun feature is the slow mo video.  Can't wait to show my son.4.  So far the quality of the photos are stunning.  Haven't captured my birds yet, and that will be another deciding factor for me. (Need to keep my dog locked up so she doesn't scare them off!)  Speaking of my dog, I've gotten some great shots of her.The only thing I DON'T like about it so far is where the cover for the battery and memory card is.  Makes it hard to get the card out, but not hard enough to make it a deciding factor.", "Date": "June 6, 2009"}, {"Title": "Addition of High Speed is Unique, Camera is Mediocre", "Author": "T. Hawkins", "ReviewID": "R2D6YGPF5DUM8O", "Overall": "2.0", "Content": "I bought this camera with big hopes for taking High Speed video but sadly was instantly disappointed in several ways:The Good:- The camera seems easy enough to use- Shoots quickly with fairly little lag- Photos look acceptable- Addition of High Speed as a feature is intriguing*The Bad:-*The actual High Speed video you can take with this camera is terrible.  You are forced to take lower and lower quality video as you shoot higher and higher speed.  At 1000fps the videos are terrible, virtually unusable.- The build quality of this camera was _extremely_ low... I took it out of the box (presumably brand new) and could visibly see 5-6 large pieces of debris/dust inside the LCD screen! That's unacceptable.Summary:This seems like an okay camera but high speed video isn't fully baked, if that's what you're after either wait a few generations or look in a much higher price range.", "Date": "December 17, 2010"}, {"Title": "Overall best of four", "Author": "S. Decker", "ReviewID": "R1OCJTC8KHDI2F", "Overall": "5.0", "Content": "I wanted to replace my Canon Powershot A95 which took good pictures but the shutter lag time was causing me to lose candid shots of my grandkids. Considered DSLR's but was told at the camera store that the newer compacts were much better in shutter lag time. So I tried a few. A Fujifilm Finepix F70EXR, a Nikon Coolpix L100, a Nikon Coolpix S710, and the Casio Exilim EX-FC100. I took pictures of the same scenes and lighting and nightime shots too. Shutterlag on all 4 were acceptable. Of these four the Casio took the best pictures in all scenes and lighting. Colors were excellent and the lens gave me a better perspective of the shot taken. (The image taken was the same as if I was looking at the scene with my own eyes. The other cameras seemed more distant.) Don't know if this makes sense to you but it sure makes the shot better. One surprise was my old Canon A95 pictures were also better than the Nikons or the Fujifilm. I'm not knocking the Nikons or the Fujifilm but in my opinion the Casio Exilim EX-FC100 was superior. Taking videos is so simple. Press one button and you have switched from snapshots to taking HD video! I used a tripod to take my granddaughters Christmas program and the video was as good if not better than my video camera. Some minor cons of the Casio: The cover over the USB plugin to transfer pictures to my Imac was maddenly in my way and had to use both hands to keep the cover away and plug the cord in; it is also a little difficult to get the memory card out of it's slot. It is too close to the cover. I highly recommend this camera. The price at Amazon was also a major buying point.", "Date": "December 24, 2009"}, {"Title": "Casio EX-FC100 For High Speed Video", "Author": "A. Leventhal", "ReviewID": "R1ZXANUCQ18LHF", "Overall": "5.0", "Content": "I purchased this product specifically for the high-speed video function to film my golf swing.  The camera performs just as I anticipated and that's why I give it a high score. 30 fps movie clips are not able to capture golf swing sequences.  The camera's 210 fps mode is perfect for showing swing flaws, etc.  I've improved my swing leaps and bounds in four weeks, and I've been playing golf longer than I care to admit.  The camera has a 1000 other functions that I don't care to learn.  I'd rather spend the time playing golf.", "Date": "April 5, 2010"}, {"Title": "Great for high speed, bad for stills", "Author": "bongo", "ReviewID": "R1V0KX4BTMDN37", "Overall": "3.0", "Content": "I bought this because I had an exilim that I loved a few years back.This camera's construction is a little flimsy (although it's pretty light, especially considering the amount of kit they squeezed into it) and still photos didn't really impress me. I wound up returning it for a Lumix DMC-ZS3 that I love.Other comments about the casio:It can effectively take a multiple exposure, which is cool, but the tech still isn't quite good enough to mimic film, so if you don't have the right conditions, the multiple exposure looks a lot like a digital camera failing to mimic film... think chunky bytes that don't look anything close to what you saw when you took the picture.It has some great settings where you can set it to automatically start shooting high speed video as soon as the subject (i.e. a bird) enters the frame, and it has a button that temporarily records a few seconds of whatever the lens is picking up, then plays it back to you in slow motion so you can snap the shutter at the optimal point. These features are great for nature photography or if you find yourself taking photos of, say, a dolphin doing tricks at seaworld, but in the unit I bought, the still photo quality was poor, which was a deal-breaker for me.", "Date": "January 26, 2010"}, {"Title": "Amazing Little Camera", "Author": "Johnny London", "ReviewID": "R22BJ0K5SIIF99", "Overall": "5.0", "Content": "This is a well-constructed, intuitive, fun camera.  If all it did was slo-mo, it would be worth 250 bucks. But it does a lot more. No, it's not DSLR quality pics, but it's not $1200, either.  My 70 year old mother would have no use for it, because it has too many bells and whistles. But if you're a bit of a gadget nut, you'll enjoy the heck out of this camera.  My favorite feature is switching between 30 and 310 FPS on the fly; you can make some compelling videos which people really seem to enjoy watching.  There's a new model coming out in April/May, and I'll probably get that one too. It'll be 10x zoom instead of 5x, and 10MP instead of 9. It's gonna be $100 more.  But there's nothing wrong with this one, if you can't wait.", "Date": "January 25, 2010"}, {"Title": "The EX-FC must mean EXtra Fun Camera", "Author": "Trojan LRey \"trojanlrey\"", "ReviewID": "RF5PTPYNXZ1WF", "Overall": "5.0", "Content": "Where would we be without AMAZON reviewers sharing their experiences.  I had a catalog of gifts to choose from as an incentive award and noticed this little beauty.  Of the dozen or so cameras to choose from, the reviews on this one kept catching my attention.Here's the thing.  It's a very cool, very fun, very innovative gadget camera.  But the one thing that is missing is a decent instruction manual. It comes with a quarter inch thick, 4.5 inch square, 150 page manual.  But its in 8 sections with each one devoted to 3 languages that share the same alphabet.  The 22 pages devoted to English also share print space with Spanish and French.So, after trying to figure out all of the buttons, featues, and settings for a couple of weeks, I went back to re-read the reviews.  Everything you'll ever want to know about how to get the most out of this camera will be based on reviewer notes.Thank you AMAZON reviewers.  Without your tidbits I wouldn't have realized all the neat things this camera does.  The unusual features included in the CASIO engineering really require hands-on experience to fully comprehend all it can do.  It takes a leap of faith to buy this camera over other comparable slim point and shoots, but it's worth it.I wanted something to replace my Canon A560 which basically lives in my travel bag as a convenience camaera.  But I can't stop playing around with this CASIO FC100.Its not a toy but it won't replace the workhorse camera you use for really important shots either.  It is, however, an ultra-sleek, make-my-friends-envious, hope-my-kids-don't-take-it-over, photo-memory-maker.  Get it for the fun of it.  You'll enjoy having it.", "Date": "December 12, 2009"}, {"Title": "Good point and shoot", "Author": "Dustin T. Mayer", "ReviewID": "R2SL1QY677KR74", "Overall": "4.0", "Content": "4 stars is about as good as you can get. 5 stars is what I would call perfect, and we are 5 years away from an SLR that fits in your pocket for 200 bucks, so yeah. BUT, that aside. I like this camera. It's my second Exlim, I bought one about 4 years ago and it's been a GREAT workhorse point and shoot. These are quite rugged, good battery life, and a very good lens. I do a lot of action shots, and even mounted this bad boy to my motorcycle and recorded a ride on the Highways of California (because my friends wouldn't believe the nuttyness).I would like larger buttons (for gloved fingers) but I ALWAYS want that, but then the camera would be huge. If you have ever had an Exlim, this performs just like any other Exlim ... just a good good camera.But, I'm sure you really want to know about the High Speed feature. It's good. That simple. It's not great. I give it a 3.5 stars. It's satisfactory for what it is. First off, it's small video. Don't think you'll be shooting the next Matrix or Rambo, but those cameras are thousands on thousands of dollars. This is less than 250! I took it to the gun range and made a cool video of a pistol shooting. You can see the slide move back and the casing eject, but that's all. and it moves slow and smooth.The 210 and 410 frames a second are better, with bigger resolutions, just make sure what ever you are shooting in HS you have WELL LIT. Outside sunlight is best. The more light the better.OH, I almost forgot, the low light features.This is the best camera I have ever used for low light shooting besides my Canon Digital Rebel XTi. No joke, the low light shooting is just unparalleled. It made a dark and overcast sky look like dusk, and dusk look like noon. I have to use the time stamp just to remember, because it sure as heck looks 3 hours earlier when using that feature.", "Date": "November 22, 2009"}, {"Title": "Great camera", "Author": "R. Hall", "ReviewID": "R1QD863GOJLN84", "Overall": "5.0", "Content": "The picture quality is great, especially when using the \"Sport\" setting for shots with movement.  The camera is very user-friendly - easy to navigate to different options.  The 30 frame-per-second feature is a fun one also!", "Date": "October 24, 2009"}, {"Title": "Great product, A lot of features, very cool slow mode", "Author": "Tobias Fünke \"Tobias Fünke\"", "ReviewID": "R4DULMZKN0IK8", "Overall": "5.0", "Content": "Pros: great battery life, Slow-mode video is awesome, Records HD video at up to 720p, crisp clean picture quality, A lot of features, best shot mode,Cons: Features somewhat complicated, 720P HD recording limited to 18-20 minutes, my zoom button top sticksOverall great camera. It has a lot of features, maybe too much for the average camera enthusiast. The slow motion camera recording is awesome although it is best to work outside (inside is dark and grainy, no matter how much light there is), the best shot mode is great to pick out the scenery you want to take photos in quickly.", "Date": "September 25, 2009"}, {"Title": "Casio High Speed Digital Camera", "Author": "Russell B. Parry", "ReviewID": "R3LBK25AQRJR9A", "Overall": "5.0", "Content": "We have owned several Casio Digital Cameras - This is a total unit of high tech pleasure to use. Most small digitals are slow to react when you press the button for a picture. Not this new Casio unit....As a matter of fact with the super speed setting you can get the grandsons swinging the bat multi times and than pick the best phote to save in file.Everyone should try this fine piece of technology at a fair price.It is great to have the 5X over most camera's only have 3X.............OUTSTANDING!!!!!", "Date": "August 9, 2009"}, {"Title": "THE BEST!", "Author": "Helloooo!!!", "ReviewID": "R2V6JRIX52C6M2", "Overall": "5.0", "Content": "Plain and simple, this camera is amazing! This is my third digital camera and so far the best.  It takes amazing pictures, is extremely easy to use, and has many features.  If you are thinking about getting the camera you will not be disappointed.  The more you use it the more you love it!", "Date": "July 22, 2009"}, {"Title": "Casio is Picture Perfect", "Author": "networkn", "ReviewID": "R1EJAXUP9W22JL", "Overall": "5.0", "Content": "Casio has a hit with this little camera.  I took it to hawaii on vacationand the video camera in addition to the Hi Def pictures where excellent.  Lot of settings on camera to choose from the Best Shot feature makes it easy.  Definately a winner.  Be sure and get at least a 4GB Memory Card.", "Date": "June 25, 2009"}, {"Title": "Fun with all the functions!", "Author": "Andy Kang", "ReviewID": "R8ZIZIYTZCAYW", "Overall": "5.0", "Content": "So many things to play with on this camera.  Still learning the functions this camera has.  With a 2 yeas old running/jumping around kid, high-speed burst shooting is great.  This function itself worst the price of the camera.  Loved the HD video.  It is great to see the video on the screen.  Can't wait to connect to a HDTV...  Haven't really tried the high speed movie yet.  Like I said, still playing...", "Date": "June 22, 2009"}, {"Title": "Expensive, but worth it if you need 30fps capture", "Author": "SloMo \"forepj\"", "ReviewID": "R2Z7EWTVKJY6LT", "Overall": "5.0", "Content": "I love this camera.  I have a six month old puppy and this allows me to capture beautiful images and slow motion video of her as she plays with her friends.  I would imagine if you have an active child or want to shoot anything with fast moving subjects you're going to love this camera.  The HD video is gorgeous as well.  If these features aren't a requirement, you can get a comparable camera for half the price.", "Date": "May 5, 2009"}, {"Title": "Cannot edit video", "Author": "Christopher J. Hansen", "ReviewID": "R1RBJF37S2OJIW", "Overall": "3.0", "Content": "I bought this camera to shoot video. It was sold to me that way (I loathe salespeople and marketers). Whilst you can shoot video to put on YouTube, it CANNOT be edited. I contacted CASIO and they said an alternative editing software must be used, and they don't know what that is. I scoured the earth looking for anything that could edit this format and none exist, to my knowledge. This is a complete failure based on my needs. Everything else about this camera is great and highly entertaining (slow-mo is amazing) and the picture quality is fantastic. But I already had a camera that took great pictures. Now I have one camera that shoots great pictures and one that shoots fantastic ones. I still don't have a camera that lets me edit video. I'm a little upset about it.", "Date": "January 15, 2011"}, {"Title": "Great for Wakeboarding/Snowboarding", "Author": "Midnight Show", "ReviewID": "R1N562FWCG328T", "Overall": "4.0", "Content": "I bought this camera just because it was portable and can take multiple pictures quickly. I wanted this for snowboarding and wakeboarding for catching all the action.I've only used it for wakeboarding so far, and I don't use the camera on it's highest speed, just 15 fps, but it produces great results.It's nice to finally have a digital camera I don't have to try and time the picture and only get one shot before the actions over. I get it every time.", "Date": "August 20, 2010"}, {"Title": "Awesome Camera", "Author": null, "ReviewID": "RKM50YVKQNQXC", "Overall": "5.0", "Content": "I am a young aspiring photographer, and I got this camera for Christmas.I love the 210 F.P.S.mode on this camera. The quality is awesome and it awes all that see it. The pictures, especially in macro mode. It creates vibrant pictures, and beautiful high speed video outside.PROSGreat H.S. video Awesome zoom and picture qualityNice build and sleek lookCONSHS Video is hard inside and in low-light conditionsTurning on and off is loud, and takes about 3 secondsOverall great camera and great buy.", "Date": "March 28, 2010"}, {"Title": "Great if you intent to use it for a toy.", "Author": "Frank Jones", "ReviewID": "RIWH33KA84FO", "Overall": "4.0", "Content": "This is a great toy camera.  Great for those of use with big shooters that needed a neat little toy.  Some of the shots this thing has pulled off are amazing.  The IS is subpar and the picture quality is pretty bad, but that isn't this camera's forte.  The high speed capabilities of this thing are amazing.  A few months back I had my big canon out at the NHRA nationals but was getting miffed at missing the launch shot.  I wanted the perfect shot seeing the sidewall buckle at 8000+ horsepower of top fuel madness. But I missed it every time even with 3.5FPS, I'd either blur it from too small of F and too slow of shutter, or just flat out miss the shot.  I thought for a second and whipped my little toy out putting it at 30 fps 15 before and 15 after press and guess what?  Time and time again I got the perfect shot that I was looking for.  Yes it is grainy, and yes the IS is really bad, but seeing about 12 frames of the launch was simply amazing.  I then noticed a helicopter coming in and set it to 30-210fps high speed video and took a great video of the bird coming in.  It was so fast that not only was the main rotor slowed enough to see, but even the tail rotor was caught in action.  I took another video of a moutain dew bottle as one of the cars came by and it was awesome to see the liquid dancing from the vibrations of from the top fuel monsters.Please do not think of this in terms of megapixels, while it may have 9.1mp active if you want the IS to work well you set it at 6.  If you want the high speed you set it at 6. Even at 9mp my ancient Canon 6mp 300d could outshoot this thing in terms of quality(I have a T1i these days), but that's not what this camera is about.If you want a tiny camera look elsewhere.  If you want a great shooter, then look elsewhere. If you want a fun camera that you can throw in your pocket that takes reasonable pictures while being a tad porky, then this is for you.Personally I love it!", "Date": "January 14, 2010"}, {"Title": "A mixed bag but trick functions are cool", "Author": "A. Butterfield", "ReviewID": "R1KCEVJQF32BWQ", "Overall": "4.0", "Content": "I was a bit surprised to find, when I took the Casio out of its cute little box, that for one thing it's silver, not white, and for another, that it's barely any smaller than my Panasonic ZS3 and nowhere near as dinky as, say, a Canon Elph. It's also made of plastic, and feels a bit plasticky (even the tripod socket is plastic). The battery compartment door is a horrible thing: it's over engineered and hard to close, feels very fragile, and creaks every time you take a shot unless you contort your thumb to not press on it. In fact, if you have your wrist through the included strap, you'll have to contort your hand, because even for my average hands, it's too short. This is a remarkable oversight. I recommend buying a new strap along with the camera.Photo quality in 9 megapixel mode is very dependent on exposure. Use the histogram to make sure you don't under-expose and the EX-FC100 is capable of a surprisingly detailed and natural performance at ISO100. I got the best result by setting sharpness, contrast and saturation to minus two in camera and tweaking these things later in Photoshop. Do this, especially if you've kept the camera really steady, and you'll be surprised how good photos look, even when viewed close up. But I wonder if it's reasonable to expect this level of effort from a point and shoot. A problem, especially given the slow maximum aperture of the lens (an odd decision on a high-speed camera), is that the sensor-shift image stabiliser doesn't work very well. I know some people say it does, but my experience with two Panasonic cameras tells me that Casio's system isn't nearly so useful, for video or stills. This is a shame.As a regular camera, it has its good points though. It's reasonably snappy in use, has a focus-assist lamp that works well, a highly customisable interface with a live histogram (though annoyingly the histogram disappears while you change exposure compensation). The 5x 37-185 lens sounds useful, but it's neither particularly wide, nor particularly long, and just think of the 25-200 lens on the physically much smaller Panasonic ZR1... Still, it's better than nothing.The big question is this: do the high-speed functions make up for the EX-FC100's limitations? Well, they are darned clever, and great fun. And really easy to use. Some of them, like the high-speed night scene mode, actually work rather well (that mode lets you take night shots in a very casual way, though they don't look fantastic, especially if you forget to set the ISO to 100). And you'll never tire of seeing things in super-smooth slow motion, like your cat, or your kids.Or will you? Only you know that.Bottom line: this is a pretty average, even rather below-average camera in some areas, though with a bit of care and experience can take decent photos thanks to a good lens. But it has some completely unique and fascinating features. I sure wish those features were on a slightly better camera. Maybe the replacement that's just been announced (the EX-FC150) will be a better all-round camera. Even so, I liked many things about the EX-FC100. It's grown on me.", "Date": "December 9, 2009"}, {"Title": "Casio Exilim review", "Author": "SJH", "ReviewID": "R1ACHZ6VWX4VLT", "Overall": "5.0", "Content": "Great camera.  Very happy with the photos taken thus far.1st trip was to Yosemite and while it's almost impossible to take a bad picture there, the photos turned out even better than I expected.The 30 frames / second feature is great for taking action shots.  And, I've also used the video feature.  All were very easy to figure out and get going right away.Still many unexplored features but this camera has delivered all I need and more so far.Only negative and it's slight -  is the position of the power button.  Somehow, when it's off, from time to time, I've hit the power button to inadvertantly power it back on.  It hasn't been an issue yet and the battery life is good but I'm afraid someday I may turn it on and accidentally leave it on too long.", "Date": "December 7, 2009"}, {"Title": "Outstanding electronic gadget", "Author": "DK \"Coach\"", "ReviewID": "R219FFY6VPF83Z", "Overall": "5.0", "Content": "While many of the features of this little toy are gimmicks, they are none the less wonderful gimmicks.  For 200 bucks, it's a fine point and shoot camera.  The added bonus is in the slow motion video and other fun tricks.  I've only had it for a few weeks, so I can't speak to the durability of the camera.  I have had another Exilim camera for about 3 years, which has been surprisingly durable (it's much tougher than it looks or feels).Pros:  Lots of fun.  Features galore - many hidden away only to be discovered by accident.  Slow motion video is a blast, although 420fps and 1000fps are so poor in quality that they are unusable.  210fps is really great for sports.  I've already used the 210fps video to shoot players on my basketball team to break down their layups.  Very cool.  I can see it being useful for place kickers and other sorts of athletes.  There are several shooting modes that use the high speed feature - although often in connection to still photos.  They are confusing at first, but well worth the effort.  Way more features than you realize at first (and none of them are explained in the book - fun for the experimental types).Cons:  Poor battery life.  Battery requires removal for recharge.  Odd shaped USB plug (Hey Casio! \"U\" stands for UNIVERSAL!) Also the manual is useless.  The HD video is fun for quick little movies, but will never compare to a real HD video camera (note: the audio is surprisingly not all that bad).Helpful hint:  Buy a really fast SD card (mine is 20mps) if you want to use the video feature (otherwise you'll start to drop frames after a few seconds).  Play around with the variety of buttons and switches.  Unlike the \"Best Shot\" feature of past Exilim cameras, these ones seem pretty good, and there are some cool effects hiding in the \"BS\" menu.  Have fun!", "Date": "November 27, 2009"}, {"Title": "Great little point and shot with fun extras", "Author": "John Temprile \"Jt\"", "ReviewID": "R1G6C9ZR9ZDH5U", "Overall": "5.0", "Content": "The camera performs pretty well in low light scenarios.  Its very small, the battery lasts a good amount of time, the the slow-mo features make it really fun.  Great little package!Don't expect shots like a DSLR, but its more than great for casual use.", "Date": "October 19, 2009"}, {"Title": "High speed camera", "Author": "Kris Soetemans", "ReviewID": "R2PGLRH8SGM9ZC", "Overall": "4.0", "Content": "Very good for the high-speed-video feature. You can even take 1000 fps (so 1 frame every millisecond).Wonderful for technical analysis of moving objects.Also the 30 fps feature is nice to take portraits of people in clear daylight, but not to be used in (darker) in-house-situations.", "Date": "October 11, 2009"}, {"Title": "Good Choice", "Author": "William Clinton", "ReviewID": "R1LH2PJ03FVNBO", "Overall": "5.0", "Content": "I bought the other model first and returned it because of it's size. This one is definitely a keeper. I wanted the slow motion capability but also a pocket camera. It takes great shots and is great to take on vacation. The slow motion works great but needs a lot of light. I have been pleased.", "Date": "August 31, 2009"}, {"Title": "Love this camera!", "Author": "Jonathan Damas", "ReviewID": "R3DVLYJOP2OGPB", "Overall": "5.0", "Content": "It takes excellent photos which gets many great comments when I show off the pictures taken from it. Almost all the time people ask me \"Did you take these with this camera?\" So thats a good sign. I also love the fact that it can take many pictures at once and automatically select the best one so you almost always get the best shot. It's design on the outside is also very impressive with it's black sturdy shell. In all it is an amazing camera and I love it. As someone who always does online shopping and reviews the items before buying I think anyone would love this little gadget.", "Date": "August 21, 2009"}, {"Title": "Best Digital Camera I Have Owned Yet!!!", "Author": "Mike NYC", "ReviewID": "R2K9MW1GIW8FY9", "Overall": "5.0", "Content": "I had been searching for a new camera to replace my old Olympus, and I originally had tried another Olympus which did not end up working out.  Through Amazon I cam across this across Exilim and I am so glad I did.Please keep in mind the I am not a professional photographer, but for an amature like myself who likes to take pictures of places and people, this has been the best digital camera I have owned so far.The pictures are indcredibly crip and clear both on the camera display and on the computer.The fuction is amazing, and although slightly grainy the pictures still come out amazing on full zoom!The camera always to you add color filters (including black & white) take slow motion shots among a plethora of other ways to edit your photo right on camera.The only thing negative I could say about this camera at all is that its slightly thicker than I though it was, but the amazing quality makes that easy to overlook.Buy this one!", "Date": "August 20, 2009"}, {"Title": "OK not so great!!!", "Author": "Wild Horse", "ReviewID": "RYEE4FT3XVXNB", "Overall": "3.0", "Content": "Pros:1. 210 fps recording is greatcons:1. Substandard still picture quality. No matter where I take the picture, noise always present!2. No zoom during Video recording3. Disable digital zoom works for some time only. As soon as you change any setting digital zoom enables itsefWith given price, I expected much better quality for still pictures...Sorry Casio, I am moving on with Cannon or Panasonic...", "Date": "May 2, 2009"}, {"Title": "LOVE IT", "Author": "Emily E. Boswell \"Emily Boswell\"", "ReviewID": "R1TL9JSEI3SPDM", "Overall": "5.0", "Content": "I first had a Casio Exilim Z60, which was impressive. I read the reviews on this one and was sold. The zoom on Casio Exilim's can't be beat. If you're at a concert, even in the nosebleed seats, you can snag excellent pictures. The user guide it comes with doesn't tell you much, so you sort of have to do your own research to learn how to use all of the excellent capabilities that it has. Thanks to the internet though, it's not too hard. Plus, its just fun to play with and figure it out. Very user friendly. Holds a charge like a dream, too. The high speed functions are my favorite, there's no picture you can't capture.", "Date": "December 5, 2011"}, {"Title": "Product Problems", "Author": "William R. Kilps \"cigars & spirits\"", "ReviewID": "R1P8RP4CLRLPIO", "Overall": "3.0", "Content": "I've owned this camera for a year now.  I encountered some problems with the camera's toggle switch zoom; it simply stopped working.  I sent it in for repair and Casio covered it and repaired the problem.  However, the problem has occurred again--- one week beyond the one year date of purchase.  I'll be contacting the customer service department first thing Monday morning.  I can only hope that it will still be covered under the previous repair warranty.  But, this should not be happening.  It's poorly constructed.", "Date": "October 8, 2011"}, {"Title": "Photo quality not great", "Author": "Ameer Hamza Adhia", "ReviewID": "R3VPENHUP5X2X5", "Overall": "3.0", "Content": "Remember this: I always compare cameras against the qualities provided by Canon and Nikon. So the photo quality, as compared to them, is not great enough. In these times, I expect all brands to be thoroughly competitive. This is not so. Although I never purchased this one, I took it from my sister to check its quality of photographs. And even in bright day light it wasn't really upto the mark.", "Date": "March 24, 2011"}, {"Title": "What an Incredible Camera!!!", "Author": "Barney Snow", "ReviewID": "R1RQHQ1MZ4XN7J", "Overall": "5.0", "Content": "I am rather certain I have not written a review of an item previously, although I've purchased thousands of items (either personally, or for my now defunct business).  I guess you can check to see If that is true.  Anyway ....I've gone through four $89-$129 cameras over past 2 years ... but due to their quality, circumstances, and my clumsiness, they became unusable for my purposes (which are as general as general can be).I thought all these cameras were pretty much the same.  They're not ... but you already knew that (I was the last one to find out!).Anyway, this Casio camera is BY FAR the best camera I've owned.POSITIVES: Here are the things that impress me about this camera:1. The shutter clicks the very moment you push the button -- there is no delay.2. Takes close-up photos.3. With the click of one button, instead of taking one photo per button push, you can set the camera to take 5-10-15-20-25 or 30 PHOTOS PER SECOND (not video, mind you, but photos!), so you can get that perfect photo of any person or activity.[By accident I discovered that I could use this 30-photos-per-second feature to analyze the start of my daughter's swim events, from her start off the block, until she entered the water (we could analyze quickness, form, everything).  I can imagine one could use this frame-by-frame feature to analyze many things -- such as, in baseball, a batter's swing during a practice or a game.]4. If you set the delay to take a photo, you can take up to 3 delayed photos at one time ... each separated by 3 seconds, something similar to those photo booths they used to have in the malls ... way back in the day:(5. The video is the clearest of any camera I've owned.  Incredible video.  I don't know if it is technically hi-def or not, but it sure looks like it to me.  [There is also a high-speed video option on this camera, although I have not used it.]6. NOT COMPLICATED!!!  The settings on this camera are EXTREMELY easy to identify and set -- just by fooling around with the camera for a while (i.e., you don't even have to read the manual).7. The button for taking photos is on the top of the camera, as per a standard camera, while the button for taking video is on the BACK of the camera -- so you never have to switch settings from video to photo again, or be confused by what setting you're on.8. The battery lasts FOREVER.  I have a back-up battery I keep with me, and I have never had to use it ... because the icon on the camera has never shown the battery as anything but completely charged! -- even after an entire day of taking photos and video (I charge the battery after every use).9. Accepts up to a 16gb hcsd card, so no need to EVER worry about memory space.POSSIBLE NEGATIVE:1. This camera takes 9 Mega-pixel photos -- which is PLENTY enough for me. or just about anyone.  I mean, I remember when they went from 6MP to 8MP ... and I nearly dropped dead!  Now the new cameras are up to 14MP AND more!  9 Mega-pixels are plenty enough.2. When taking multiple photos per second, each photo is 6 MP.Overall, this camera is absolutely fantastic!", "Date": "March 12, 2011"}, {"Title": "Great for golf swing analysis; so-so still photo camera", "Author": "BZ \"CoffeeNut\"", "ReviewID": "RTYHDFENQCZ7F", "Overall": "4.0", "Content": "I bought this as a pocket camera for the driving range.  My husband and I can quickly record each other's golf swings and review instantly in super slow mo and excellent detail.  It's a lot more convenient than my husband's high speed camcorder that he uses to give professional golf lessons and the video quality is just as good.  Captures high speed video even in moderate light (overcast and sunset).However, image capture for still photos is average at best.  I've experimented with different lighting, distance, flash, and other camera settings and picture clarity on still shots is sub-par.", "Date": "February 10, 2011"}, {"Title": "Slow Motion Feature is Great", "Author": null, "ReviewID": "R1WVYZFPOO0BD", "Overall": "5.0", "Content": "I purchased this camera for its slow-motion video feature. I coach baseball and wanted a camera that could be used for analysis of hitting and pitching and was less than $600. I was skeptical that a camera priced under $200 could be sufficient. But this camera works exactly as I had hoped. Using the high speed feature at 210 frames per second, I can get great slow motion video that can be replayed on the LCD screen while I'm on the field with one of my players. And it can easily be downloaded to my computer. And the Continuous Shooting feature can grab 30 still-frame shots per second also! That is another decent way to analyze athletic movements like swings. For the money, this is a great camera. Buy yourself a high capacity SD card and an extra battery and you'll be having lots of videos to look at. The still shots look fine as they are no better or worse than the typical point and shoots priced under $200. But it's the video feature that really makes this one a great buy.", "Date": "January 26, 2011"}, {"Title": "GREAT for video ... if the light is good", "Author": "BiOzZ", "ReviewID": "R16556CO9Q1X0X", "Overall": "4.0", "Content": "this camera showcases all the technology that will be in every camera 5 years from now ... but does not have the quality to matchthe 30-240-420 and 1000 FPS video works GREAT if you get proper light for many fun and intresting applications from video taping your kids shocker game to investigating the extremely interesting world around at 30X slower than you can see it with your eyesthe 30FPS rate for photographing is amazing (my $8,000 professional DSLR can only do 4 FPS) so it can make any one be able to get the perfict picture and the ability to take a picture BEFORE you hit the shutter button was really helpfulid say if you want a pocket camera for outdoor video or sports photography or slowmotion video and you dont want to spend $500 than get this cameraif you want a good quality point and shoot get a canon or a nikon ... if you want a good quality anything camera get a nikon DSLR", "Date": "December 23, 2010"}, {"Title": "Well pleased", "Author": "Joe", "ReviewID": "R2NFJO7VC802HU", "Overall": "5.0", "Content": "Well pleased. Camera will do far more than an amateur like me needs. Has large display and operation can be simplified with auto settings.", "Date": "December 18, 2010"}, {"Title": "Great Camera, Great Pricing", "Author": "James Porter", "ReviewID": "RFLVAA7CFL147", "Overall": "5.0", "Content": "Thanks Amazon.  I saved over $100.00 from other pricing.  The camera got to me the next day and I am very happy with the purchase.  Easy to use, great HD. 1000FPS for fine details........", "Date": "November 1, 2010"}, {"Title": "A leap forward", "Author": "CHUS01 Fan", "ReviewID": "R170DPC55QMNVT", "Overall": "5.0", "Content": "Casio really understands the digital camera business.  In the beginning you got the present form, with a little zoom and a screen on the back.  Then came video.  Now you have burst modes, easy access to the video with the movie button, and high speed video.It's good to get a little extra with each new camera.  Casio keeps innovating, and more importantly, translates that innovation into easy-to-use features that are fun and that everyone can try.This particular camera has astounding battery life, takes great pictures, and is quicker than similar cameras.  The burst mode lets you get great pictures where everyone looks good, and the high speed video is a fun extra.", "Date": "October 30, 2010"}, {"Title": "An excellent choice.", "Author": "Happy Customer", "ReviewID": "R30PGK0JN4TSYS", "Overall": "5.0", "Content": "After much deliberation, I made the decision to purchase this camera, and it was definitely worth it.  The Casio Exilim EX-FC100 has both style and function.  The sleek design makes the camera look good, and the settings are pleasant to navigate.  The best shot selection is also a handy way to visualize the different photo presets.  The functionality of the camera is excellent; I have been able to take high quality shots that I am satisfied with.  The high speed function brings another dimension to my film projects, giving me the edge over other creators.  The only problem is the storage management with the camera, but that's due to the small SD card that I am using.  Overall, this camera is an excellent choice.", "Date": "September 27, 2010"}, {"Title": "Great Camera!", "Author": "Brian", "ReviewID": "R3UJ3GME9SL1I2", "Overall": "4.0", "Content": "I really enjoy the youtube easy uploading feature and many other great features this camera offers!", "Date": "September 25, 2010"}, {"Title": "Great camera!", "Author": "Lori A. Malone", "ReviewID": "R23DEWF5SW78WH", "Overall": "5.0", "Content": "This camera is great!  Picture quality is A+!!  It fits in your pocket easily.  The one complaint I had was that it was so small that I could not get a good grip on it when pressing the button to take a picture.  My daughter loves it though, and has no complaints!", "Date": "September 17, 2010"}, {"Title": "Great value", "Author": "Gregory Giesler", "ReviewID": "R3IUBLXCGPWTB9", "Overall": "5.0", "Content": "Great features and value for the price.  Very easy to use and takes great pictures.", "Date": "July 21, 2010"}, {"Title": "Casio High-Speed Exilim EX-FC100 9 MP Digital Camera", "Author": "Igor Alexeff", "ReviewID": "RCMX6QALCOACH", "Overall": "5.0", "Content": "The high speed movies of 1000 frames per second are very useful. I first heard of the Casio high speed cameras while visiting a research institute in Kharkov, Ukraine last winter. They were using the EX-F1A to photograph plasma discharges in air.Igor", "Date": "June 14, 2010"}, {"Title": "Awesome little camera", "Author": "R. L. Holdren", "ReviewID": "R2ILR2NDERG6F1", "Overall": "5.0", "Content": "I did some research on this camera before I bought it and liked what I read.  After I bought it and used it, I was even more impressed.  I enjoy taking digital pictures and especially enjoy taking action shots and videos, and this little camera delivers!  I barefoot waterski and race motocross and have gotten some unbelievable pictures and videos with this camera.  The 30fps is what does it for me as far as the single shots go, and the 1000fps is what does it as far as video goes.  The slow motion on the video is extremely impressive and leaves you going...wow!  All my pictures have been crystal clear and I love everything about this pocket sized camera.  The battery life is excellent but I enjoy taking pictures and video so much I think I'll buy at least one more battery.  I also bought two 16gb memory cards which I enjoy filling to capacity and may end up buying more of those too.  For such a small camera, the 5X optical zoom is awesome too!  There are so many different types of settings available to get the perfect picture, if you somehow manage to screw up a picture it would have to be the users fault, not the camera's.  I can't say one negative thing about my little camera...two thumbs up from me!", "Date": "May 16, 2010"}, {"Title": "great product", "Author": "Adam Matlack \"baby huey\"", "ReviewID": "R2YEAJX2194ITD", "Overall": "5.0", "Content": "This is a wonderful product for Golfers! i use this to slowmo capture my swing and its perfect.  Its also a wonderful teaching aid in most sports.. you can really break down and show a person what they are doing and what they need to change.its also a great normal function camera.  The regular pictures are as to be expected and the hd video is of sound quality.I would recommend this for sport fans and or golfers!", "Date": "April 26, 2010"}, {"Title": "Great for slow motion video", "Author": "J. Vierra \"Joe\"", "ReviewID": "R26HRD44HOK32F", "Overall": "5.0", "Content": "This camera is great for taking decent quality slow-motion movies.  I've used it to help me improve my golf swing.  The 210 frame per second video mode is perfect for this.  You will instantly be popular at the driving range if you bring this camera.  My daughter is sprinter on her high school track team and I was able to use this camera to help her improve her sprinting technique.  Coaches had told her what she needed to do to run faster, but there's something about me showing her technique compared to faster runners using this camera that made her motivated to make the changes necessary to run faster.  The camera is small enough and light enough to take with you in a pocket or a golf bag.  The quality of photos and HD videos is pretty good - so it's usable for more than just slow-motion.  I wish the camera had a higher resolution slow motion mode something like 640x480 at 100+ fps, because I would use it to make higher quality slow motion video to include on DVDs.  The resolution at 210 fps looks good on the camera screen or a smaller window, but doesn't look so good on a full TV screen or computer screen.  You can easily edit videos on the camera which is handy to trim the beginning and end pieces of videos you shoot at high frame rates which tend to have lengthy chunks you want to remove.  Nothing like it in the market at this price point, so 5 star ratings - even though it's not perfect at all aspects of picture/movie making.  Though now I want a higher resolution device that takes slow-mo movies because it looks so cool!", "Date": "April 14, 2010"}, {"Title": "Best option for fun", "Author": "Caio Orsolini", "ReviewID": "R3EKA9M1NSZJ1H", "Overall": "5.0", "Content": "Just a short review: this is of course not a professional cam like those DSLR's. But, for a small camera, it takes pretty good pictures, I think maybe even better than the previous Sony I had... Anyway, pics are good enough for most uses. But the big thing about this camera is the high speed features, such as the ability to take 30 pics in 1 second and especially the high speed videos (up to 1000fps). It is just fantastic. And for a fair price. I think you will not regret if you buy this camera.", "Date": "April 3, 2010"}, {"Title": "Best little camera", "Author": "Stosh", "ReviewID": "R35GC7FECJW3VG", "Overall": "5.0", "Content": "This has to be my best camera ever.  I carry it everywhere in my computer case (small enough), and it takes great pictures.  The high speed feature works great (still and video).  I am amazed at the versatility of this camera at this price and it is so much fun.  The fact that I can take photos in low light conditions without using the flash makes it so versatile for me.  I recommend this camera to everybody!", "Date": "February 14, 2010"}, {"Title": "great value - capable camera", "Author": "J. Doane \"farscape forever\"", "ReviewID": "RUMAK50XIRLDX", "Overall": "5.0", "Content": "For decades I've wanted a high-speed video camera and this one finally makes it affordable. At work I use a $25,000 high-speed video camera and have wanted something for myself for hobby use at home. At about $200 this camera is perfect for my needs. At 200 fps it takes care of my hobby needs (like filming a pair of dice rolling or a top spinning). The 400 fps is OK but pretty rough and the 1,000 fps is almost unusable. Still, at $200, the ability to shoot 200 fps is remarkable. I love this capability! The still images are OK but not great. Don't let the 9 MP resolution trick you into thinking the images will be awesome- there's a lot more to image quality than pixels, namely the quality of the optics. While this camera is perfectly acceptable for snapshots you're not going to get great photos. For pocket-camera snapshots I recommend the Leica cameras. But, anyway, for a camera that can take snapshots and also let you shoot high-speed video this camera is a remarkable value. I'm very happy with the purchase and highly recommend it if you like specialty video.HIGHLY RECOMMENDED!", "Date": "January 10, 2010"}, {"Title": "Casio Exilim FC-100: Great Array of Useful Features", "Author": "Ken \"Ken\"", "ReviewID": "R3AQA8BJOXE1ZS", "Overall": "4.0", "Content": "In 2 years I've taken over 3,500 shots with this camera. It has a nice sharp lens and is amazingly small in view of such a large features list.The item which Casio forget to include with the FC100 is a large, comprehensive PAPER manual that teaches you how to use all of its many modes and features. The lack of such a manual leaves you on your own to learn via the internet and trial-and-error. The features are subtle and easy to forget how to use without a good manual to refer to. I recently found from Casio that a paper manual is available:\"Thank you for contacting Casio America. Apaper manual is availablethrough 800-706-2534 option 1 for U.S.customers for a price of $10 and Ihave listed the live help line below.As a reminder our live help line is800-435-7732.\"  END OF MESSAGE FROM CASIOThe most valuable features for me are the night and anti-shake modes in which the camera takes up to 30 shots, then integrates their light into one combination shot, without the use of flash. These are BEST SHOT modes 12, 13 and 15.The useful movie speeds are the slowest, most \"normal\": 30 and 210 fps. The faster ones are strictly for action/effect you have no other way of capturing; could be useful in some industrial situations to record parts/product movement.A few months ago, I discovered that removing the original battery to charge it (this step should not be necessary), I lost the date/time setting, and was required to reset both, as if I were using the camera for the first time. I've ordered a non-OEM battery of higher capacity, and will revise this review based on whether it fixes the problem. Despite the problem I still love this camera.", "Date": "December 16, 2009"}, {"Title": "Slow Motion is Worth It.", "Author": "D.K. \"D.K.S.\"", "ReviewID": "R7IWNJDDS19VB", "Overall": "4.0", "Content": "This camera produces good point and shoot pictures. It seems to have trouble with very dim light + flash shots. The subject is bleached and the background is off color and under exposed. Well lit or wider angle shots it does an acceptable job. The slow motion feature is what makes this camera worth the money. If you don't care too much about slow motion then maybe a different model is for you. The 210 FPS mode is MONEY! 420 FPS is usable under some circumstances and the 1000 is almost worthless. NOTE: High speed video requires a lot of light. Out door daytime shooting or heavy indoor lighting will be required for good results. The only complaint I have is about the video features, there apparently is NO or very poor compression or used for writing the video files. The resulting files are huge. A 15 minute HD video consumes a 4GB card. I use software to compress my videos otherwise my hard drive would soon be full of poorly compressed videos. In any case for the price this little point and shoot camera is worth the money.", "Date": "December 15, 2009"}, {"Title": "Maybe my expectations were too high", "Author": "Michael C. Mantion", "ReviewID": "R8APALBRAFEUB", "Overall": "3.0", "Content": "It is a fine camera, lots of great features.  Sadly the video is just too grainy.  Even in high light situations it is lacking.  The high speed works ok, except again to much pixelation.  So yes it is cool, but you really won't get footage that will amaze you.The anti shake is not as good as others I have used, the battery life is a bit short as well.If the high speed looked better it would be worth so much more, sadly, I tried it a couple times and have no interest in it any more.  Just get a $100 dollar camera.  If you really want the High speed like I did, get the SLR type models.  The point and shoot just doesn't cut it.", "Date": "August 3, 2009"}, {"Title": "Casio digital camera is awesome!", "Author": "N. Avery \"Leave No Teacher Behind\"", "ReviewID": "R37QUR21E01UNH", "Overall": "5.0", "Content": "After much researching and recommendations from professional camera people, I bought this Casio camera. I have had other brands of digital cameras-notice I said, \"had\". They all were great for a little while, then broken lenses,etc. This Casio is like a pro-camera with all the bells and whistles and the video clips are amazing. No more Canons for me!", "Date": "September 20, 2009"}, {"Title": "Full of promise, disappointing in execution.", "Author": "Robert J. Hrabak", "ReviewID": "RREN1FLTE74NL", "Overall": "1.0", "Content": "We have a 5 month-old baby and our 7.2 MP Sony camera is notoriously slow to grab pics of her in full-smile.  I thought the high speed functions of this camera (slow mo capture, continuous shutter) would be the solution.Unfortunately, this camera under-delivers across the board.First, the camera is not intuitive (this coming from a gadget-lover).  If I couldn't figure out how to make simple setting changes, I can't imagine how my wife would fare with the camera.Second, while 9MP sounds good from a quality standpoint, features such as Slow Mo and Continuous Shutter can only be used at 6 MP or below.  Also, flash cannot be used in these modes, so forget about using these features in lower light or indoors.And finally, onto the flash.  Even with setting the flash intensity to -2 (using the manual to finally figure out how to accomplish this), the flash was way too intense, washing out most evening indoor shots.Overall, this camera is a huge disappointment.  I would not recommend it for any skill-level photog.  It's way to difficult to use and the results are very poor.", "Date": "July 20, 2009"}, {"Title": "Defective sensor", "Author": "Paul Kamen", "ReviewID": "R1WS28TWAYO0JU", "Overall": "1.0", "Content": "Shortly after Amazon's 30-day return interval had run out, I noticed that the lower left corner of most of my photos is blurry. Checking back, I see that this problem existed to a greater or lesser degree right from the frist days of use. Have not yet attempted to return to Casio for repair or replacement.", "Date": "September 22, 2009"}, {"Title": "I'm sorry but ... Casio sucks", "Author": "Daniel F. Lynch", "ReviewID": "R3B3LRQFHU5EZF", "Overall": "4.0", "Content": "Although in the overall scheme of things not a big deal, this just ticks me off. I just twittered this out. I really think I will hang it on a flower hangar or something out in my yard.DON'T BUY CASIO PRODUCTS!!! I bought a digital cam for Cindi in Decemeber. Used it for taking pics of her jewelry ... LENS ERROR . DON'T BUY CASIO PRODUCTS!!! They accused us of damaging it!!! by dropping ... UNTRUE ... I will hang it in my front lawn as a monument to ...DON'T BUY CASIO PRODUCTS!!! corporate greed. Thanks CASIO for calling me a LIAR!!! The camera could not have been jostled in some manner ..DON'T BUY CASIO PRODUCTS!!! ... from the manufacturing location and it just FAILED!!! Never again CASIO!!!While it was in working mode, it was a very good, fast camera. Too bad the company won't stand behind it.--", "Date": "February 18, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "9.1-megapixel resolution\n5x optical image-stabilized zoom\n30 shot-per-second high-speed burst shooting (6 MP images)\nHD Movie function\nCapture images to SD/SDHC memory cards (not included)", "Name": "Casio High-Speed Exilim EX-FC100 9.1 MP Digital Camera with 5x Optical Image Stabilized Zoom and 2.7-inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41vta-cfiDL._SX300_.jpg", "ProductID": "B001OTZR22"}}