{"Reviews": [{"Title": "Great camera system. Fantastic seller support too.", "Author": "Walter B. Fisher", "ReviewID": "RVV4UV3XQ6DA", "Overall": "5.0", "Content": "I had recently purchased a \"wireless\" camera package from another supplier and found that they sucked. I had no product support from that seller and could not even get my money back.I decided to pursue another product and found this one on Amazon. After reading other reviews of the product and the fact that this is a \"hard wired\" camera, the only way to go in my opinion, I purchased the system.Installation was easy, and the cameras work perfectly. I was in the electronic security business for over 19 years and these cameras have picture quality close to cameras costing more than twice the amount. The support when I had a question about the product was prompt, courteous and complete. I RECOMMEND this seller and product if you are in the market for \"hard wired\" security cameras. For the price, this is an exceptional buy!Walter B Fisher", "Date": "August 4, 2009"}, {"Title": "Great camera It is WIDE ANGLE View", "Author": "Myron \"Mr. Fixit\"", "ReviewID": "RIJBW1TNP7QLT", "Overall": "5.0", "Content": "I sure wish that there was a standard way to express how wide or narrow the lens view is. I was pleasantly surprised to find that this camera was very wide angle, maybe 90 degrees or maybe more.  I see my whole front yard, and quality is very good when compared to cameras of similar price.  The night vision is not as wide and is average for this price range. Great deal in my book", "Date": "September 2, 2008"}, {"Title": "Great Camera", "Author": "Scirocco 2", "ReviewID": "R3BV7NNECEO6IZ", "Overall": "5.0", "Content": "I am not a \"GURU\" so Lets keep it simple.Pros:sony supehad technologywide anglelong range for night visioncool designgreat bang for the buck and easy to installreally good looking designcons:ITS PINK....IR ISNT AS WIDE AS THE THE LENS CAN SEEthe overall craftsmanship is decent. not spectacular. the movable parts of the camera are not really even. kinda looks like it was hand crafted (up-close).def. made in china or mexico.conclusion:great camera if you dont care about the looks and are currently on the \"WIFE ALLOWANCE\" budget. \"ITS ----> metalic PINK\". doesnt really look pink in the picture.... but it is. trust me.great picture quality during night and day. would i buy another.......hmmmm yes, but only under one condition. get rid of the \"PINK\" housing.  great wide angle without the fish-eye.  compared to whats out on the market right now, its a pretty good deal.", "Date": "May 19, 2009"}, {"Title": "I can see at night so good", "Author": "Daniel D'jesus", "ReviewID": "RS8THY4QPE9DT", "Overall": "5.0", "Content": "It work good. The place where I put this camera is so dark and I see everything very good", "Date": "September 12, 2009"}, {"Title": "Love These Security Cameras!", "Author": "A. Ward", "ReviewID": "RDUXZF1KWMT9Q", "Overall": "5.0", "Content": "I looked for a long time before I settled on these particular cameras. They were easy to install and they produce a clear picture, day and night. I will be buying two more of these soon.The third party vendor through Amazon.com was easy to work with and answered all my questions before I purchased. I have had no problems with these cameras.", "Date": "January 14, 2010"}, {"Title": "Enjoyable gadget", "Author": "F. Huffman", "ReviewID": "R3UU39HYGC6KHM", "Overall": "5.0", "Content": "We bought this to watch the wildlife that comes around our country home. It really is a very nice little cam.One complaint there were no instructions. We mananged to figure it out, but it should have instructions included and what is called the instruction sheet has no information for installing.The range is very good, however the distant areas of the infrared night view makes objects seem very small.This may not be a problem when using the camera for security and viewing humans rather than small animals.Anyway, we are loving this thing.", "Date": "December 21, 2009"}, {"Title": "great for the price", "Author": "C. Farley", "ReviewID": "RCJAIDU8W3XMI", "Overall": "4.0", "Content": "This camera installs easily, closeup (50-70 feet)during the day is great.  If you try to see further (500') it looks like your looking thru the wrong side of binoculars.  Nite vision is not too good unless you have a source of light.  To be fair, I have it aimed at a driveway in the country and was trying to get a good view of objects that are between 500 and 700 feet away.  I can see my barn great though and it is about 70' away.", "Date": "October 8, 2010"}, {"Title": "Surveillance Camera -", "Author": "sammyo41 \"Sam\"", "ReviewID": "R2JVCNC24DOLIP", "Overall": "5.0", "Content": "The camera worked without a single problem. After mounting under the eaves it shows not only the deck area where the entrance door is located; it also shows the whole driveway and further out, at night I can see headlights from the highway which is a couple of blocks away.As I have been bed ridden 90+ percent of the time it really helps me feel more secure knowing who is here, I have a motion detector which alerts me to check.In time I would like to add two more so I can see different areas of my property and the many animals I attract with plantings and seeds, etc.You can feel at ease when you click on purchase this camera!", "Date": "September 12, 2010"}, {"Title": "Good Value", "Author": "Morgan Motors", "ReviewID": "R27L3K7ZNCOSXT", "Overall": "4.0", "Content": "I was nervous buying this camera as there are so many options.I am happy with it's size and it's abilities.It has a wide field of view and works pretty good at night. I would say (in my experience) that this camera is great for the price range. I suspect if I wanted better, I would be spending quite a bit more.I am considering buying one more of the same camera - so take that for what it is worth.", "Date": "February 11, 2011"}, {"Title": "Great price and camera", "Author": "D. Kehr", "ReviewID": "R2BM8KWKLB2AOE", "Overall": "5.0", "Content": "At first I was sceptical to buy this camera at first but I read all the reviews and done my research on it and finally came to a conclusion that it's not bad for the price compared to more expensive ones. It has all the features I need and much more. The price is very good since it is day and night and is weatherproof compared to much more expensive ones. The camera its self is great since it has a long cord it can be placed anywhere without having to buy a longer one. The only thing that I wish was included was a manual on how the wires were connected but after a little playing around I finally got it working. Other than that everything was great. It is a must buy item even though it is a pinkish colour.", "Date": "February 3, 2010"}, {"Title": "you wont be dissapointed", "Author": null, "ReviewID": "R3Q2CMWAN6A0TB", "Overall": "5.0", "Content": "this camera for the price is well worth it,thanks to the other reviews i bought this,the cable it comes with is very thin but it gets the job done, it made it all the way around my house..it is pink ,youll get over that quick picture is 8 out of ten..ill rerate this in a month or 2,i would buy again bang for your buck", "Date": "August 19, 2010"}, {"Title": "Nice Camera - Good Quality for Price", "Author": "R. Pollard \"MDScientist\"", "ReviewID": "R1BTBEQ6XQ2927", "Overall": "5.0", "Content": "Being new to the surveillance scene, I've purchased several security cameras to get a feel for the Price vs Performance curve.  I am very pleased with the video performance of this camera but cannot yet attest to its longevity.  This camera may say Sony but I've seen it on other websites, such as chinavasion, and it's definitely Chinese made.  It's cheaper from chinavasion, not including the huge shipping fee and four week shipping time.  I paid $85 with the included 100' zip-cord cable and power supply and is the best price I've found.  It arrived promptly and well packaged.  The video is much better than the non-IR bullet camera I've purchased at $115 and much better than the less expensive models I've tried.  The only real deficiency of the camera worth mentioning is the poor rectilinearity of the lens, i.e. straight lines appear to be quite curved, especially at 20' or less.  Would have expected a slightly better lens in this regard for the price.This camera has good night vision from ambient light and the IR is decent to about 60'.  The IR's projection is much like a flashlight's beam so it doesn't illuminate the entire field of view as mentioned by another reviewer.  However, no camera in this price point will.  One interesting thing, the IR LEDs must be near-IR as they do emit a soft red light; so if stealth is the object, this is probably not the night camera you want.The fov is quite impressive, I have no difficulty getting my entire front yard from the front porch (approx 75' deep X 150' wide) with its f 3.6mm lens.Bottom line is this: for the price the color video is very good in typical night-time household lighting and perfect in daylight.  The night vision is acceptable for viewing objects center of view from 60' or less and seeing objects (only) beyond that or in the periphery using ambient light sources such as street lights, full moon, etc.Oh yes, I almost forgot... it is pinkish in color, but it is by no means hot pink :)", "Date": "July 7, 2010"}, {"Title": "you wont be dissapointed", "Author": null, "ReviewID": "R2WHJSMLV3MUS0", "Overall": "5.0", "Content": "this camera for the price is well worth it,thanks to the other reviews i bought this,the cable it comes with is very thin but it gets the job done, it made it all the way around my house..it is pink ,youll get over that quick picture is 8 out of ten..ill rerate this in a month or 2,i would buy again bang for your buck", "Date": "August 19, 2010"}, {"Title": "This \"Toy Like\" Camera will dissapoint", "Author": "Johnny", "ReviewID": "RVQQ5UOW4917X", "Overall": "1.0", "Content": "The other reviewers have said this camera is great \"for the price\" but you have to ask the question: \"If the product is manufactured so cheaply, it is unusable. Is this really worth purchasing?\"The camera image is \"OK\" but not that great. The housing looks to be cast aluminum but I would not trust it to be waterproof or weatherproof.The little mounting plate and adjustable arm are unusable: So cheaply made it is not even installable.There are two types of infrared cameras, the type that show a pale red glow from the front and the type that do not. This camera does have the red infrared LEDs so that when the camera is on you can see a quite noticeable \"red eye\" staring at you.Finally, I will not attack DIGIAIR (The Distributor), or Warehouseseller (The retailer) for offering this sub-par product. That is what they do. I am a little upset at AMAZON. They have some control over how the products are advertised and the claims made by the advertisers. I find the description of this product to be misleading almost to the point of falsehood. \"1/3\" SONY CCD IR Color Infrared CCTV Camera\" might lead some to believe this is a Sony camera. IT IS NOT! There might be one tiny component inside the camera made under some patent Sony holds but that is as far as it goes. If I were a representative of the real Sony Corporation, I would not appreciate the use of my company name associated with such a product.Treat this product as a toy. Find something cheaper if you want to play with analog CCD tech. Look elsewhere, nothing to see here.", "Date": "September 5, 2010"}], "ProductInfo": {"Price": "$374.95", "Features": "Built-in 1/3\" SONY Super HAD CCD, color DSP, automatic CDS sensor\nBuilt-in light sensor and 3.6mm lens for wide view angle\n420TV lines. 0 lux with IR LED. NTSC system\n26 build-in IR illuminator, IR illuminator effective up to about 54 feet\nWeatherproof housing. Water, dust and crush resistant glass coating", "Name": "VideoSecu Bullet Security Camera Day Night Vision Infrared Outdoor Built-in 1/3\" SONY CCD Weatherproof 26 IR LEDs Surveillance Camera for CCTV DVR Home Surveillance System with Power Supply, Extension Cable and Free Security Warning Decal 1OF", "ImgURL": "http://ecx.images-amazon.com/images/I/518gwt9BD3L._SY300_.jpg", "ProductID": "B001A8H2FW"}}