{"Reviews": [{"Title": "Exellent camera at an affordable price", "Author": "Loxodrome", "ReviewID": "R2FXQCE2VZ80ZI", "Overall": "5.0", "Content": "I was hoping to buy a Kodak easyshare camera, but the store didn't have what I was looking for, so I figured I'd \"settle\" for this camera. However, when I started using it, I realized I hadn't \"settled\" at all! The camera takes extremely clear pictures, and it has all the features an expensive camera would, like face detection and anti-shake. If you are one of those people (like me) who are searching for a camera and frantically reading customer's reviews, take my advice: you will not be disappointed with this camera.", "Date": "May 20, 2008"}, {"Title": "exelent cam", "Author": "Erick Salazar CH", "ReviewID": "R37BYU551UQR7C", "Overall": "5.0", "Content": "Hello, I just recently bouht this camera, and I have take excelent pictures, I definitely recoment this one, the zoom is great, as a personal recomndation try to use this one w/4GB SD", "Date": "June 29, 2008"}, {"Title": "Not great quality, very fragile", "Author": "M. Natal \"aluckywish\"", "ReviewID": "R2FLT3XLN9NPV7", "Overall": "2.0", "Content": "I ordered this camera from Amazon and have had it for less than one year. At the beginning, the camera worked just fine. Over time, I noticed a few problems.The quality of the photos are definitely not the best, even after modifying the settings. A lot of pictures get washed out by the flash, and when the flash is not on the pictures turn out grainy. In addition, I find it impossible to take a picture of anything small or any focused images. The picture turns out too blurry to make out what the object is. Wider shots in natural light seem to turn out the best.Another fault of the camera is that it's very fragile, even for light use. The camera started to break down only after a few months after I started using it. While in view mode, the buttons on the camera began sticking and the interface would freeze up. Restarting the camera fixes the problem if I hit the power button repeatedly. Then about a month ago, the memory card slot broke. The card will not stay inside without being ejected. I have to tape it down so that it won't pop out.Overall, the camera was okay for the price I had paid for it. However, I regret this purchase because it started breaking down far too quickly. I've never purchased a camera that broke down less than one year after purchase. I highly suggest passing this over and going for a higher quality camera. The investment will pay itself off as opposed to purchasing this one.", "Date": "June 23, 2009"}, {"Title": "Casio Exilim EX-Z9 8.1 MP Digital", "Author": "Burt Carrasquillo \"Burt\"", "ReviewID": "R2BZM31JAIJEB", "Overall": "5.0", "Content": "This is one of the best camera's out there.If you want to purchase a camera that is reasonable in price plustakes excellent picture this is the one for you. This little camera also records so you get everything you wouldwant.The price is excellent. I checked this camera out at Best Buy it was twice the price. I did a lotof research before I made this purchase.", "Date": "June 26, 2010"}, {"Title": "Poor image quality", "Author": "Bruw \"the strong arm\"", "ReviewID": "R269F0IF17S93V", "Overall": "1.0", "Content": "I posted a review of this camera earlier and I do not know why it did not post.Anyway, this camera has extremely poor image quality. The images were unbelievably grainy. I bought it because I was looking to save some money. That was a mistake because I just ended up sending it back.I would recommend a higher quality Casio.", "Date": "October 24, 2008"}, {"Title": "Great little camera!", "Author": "Debora A. Landro \"dal\"", "ReviewID": "RM1967Y6B7SDH", "Overall": "5.0", "Content": "This is a great camera. For it's size and price it takes amazing photos and is very easy to use.", "Date": "October 15, 2008"}, {"Title": "lack of information about size and weight", "Author": "Peter R. Thomson", "ReviewID": "RLU3BTLFE22HY", "Overall": "1.0", "Content": "My buddy has a Casio that sure looks this camera but it does not measure 8 by 10 by 6 and weigh 2 pounds. Do I have the wrong camrea. I need small and lightweight, any inquiries into the specific data about this camarea are avoided, why?", "Date": "October 2, 2008"}, {"Title": "Very fragile", "Author": "Troy J. Lee \"T\"", "ReviewID": "RHUNR9ZSKN0PO", "Overall": "3.0", "Content": "I got this camera about 6 months ago..I have been happy with it at times, but it takes very bright photo's..everyone's skin looks pale even when I change it to other settings. I did LOVE the flower setting though..It took great pics of flowers. I couldn't take a picture of the Moon...it was just a blurr.I dropped it on the carpet yesterday with the lens out and it got stuck and wont work now..It is so stuck there is no getting it out..The camera is ruined now. I have taken some good pictures with this camera and then some not so good pictures. I guess its not a Bad camera..just not that great either. Very fragile...I cant believe that dropping it on carpet completely destroyed it.", "Date": "October 24, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0014V0VPS"}}