{"Reviews": [{"Title": "The best value in an Alpha?", "Author": "Hiram Grant \"just call me Sam\"", "ReviewID": "R3E05GTQ4HUX1O", "Overall": "5.0", "Content": "Having previously reviewed the Alpha 200 and 350, it seems a bit silly to review the Alpha 300.  After all, the Alpha 300 is a 200 with Live View, or a 350 with 10 megapixels instead of 14mp.  Right?Well, pretty much that's the case.  But there is also a corresponding price difference.  Is Live View worth an extra $100?  Is 14mp worth an extra $200?For my money, yes, Live View is worth the $100 because of the way Sony has implemented this feature.  Unlike most systems, you won't see a loss in autofocusing performance (or a loss of autofocus completely), nor will you alter the way the exposure and white balance are determined.  Add to this the articulated screen that makes extremely low or high angle shots easier, and I say \"YES\"!  Any drawbacks?  Yes, this screen is a bit thicker, and pushes you back a bit when looking through the camera.  Also, the way Sony implements Live View does mean you only see 90 percent of what you'll get on the image.OK, is 14mp worth the extra $200?  I don't know, but I don't think so.  We really need more critical comparisons from people with true scientific methods of measuring the difference in image quality, but there are a few assumptions that will probably hold true, based on previous cameras.  The 14mp will give a superior image in good lighting, when ISO values (the fake \"film\" speeds) can be set to higher quality settings.  You won't see this difference on an 8x10 standard photo, but probably could in very big enlargements or severe cropping of photos.  Keep in mind that the \"1.4x and 2x teleconverter\" option you have with Live View is nothing more than cropping, with 2x dropping your effective megapixels in half.Past cameras would suggest, however, that the higher pixel density of the 14mp camera would be a drawback in low light conditions, in particular when we have to raise the ISO settings.  Thus, they may not even be as good as the 10mp sensor for these applications (but we still need critical testing to confirm this assumption).So, for my money, I'd say the 14mp is probably not worth the money for someone shooting an even variety of shoots, but might be for a landscape/wildlife photographer.Compared to other brands, I think the Alpha 300 wins on features compared to the Canon Digital Rebel XTi or Nikon D60 (Live View, stabalization in body).  The new 12mp Canon XSi is more in the price range of the 14mp Alpha 350.  In any case, with 3 new Alphas, and the new D60 and XSi, there's no more excuses!  Get a camera and start taking great photos!Sony Alpha A200K 10.2MP Digital SLR Camera Kit with Super SteadyShot Image Stabilization with 18-70mm f/3.5-5.6 LensSony Alpha DSLRA350K 14.2MP Digital SLR Camera with Super SteadyShot Image Stabilization DT 18-70mm f/3.5-5.6 Zoom LensNikon D60 10.2MP Digital SLR Camera with 18-55mm f/3.5-5.6G AF-S DX VR Nikkor Zoom LensCanon Digital Rebel XSi 12MP Digital SLR Camera with EF-S 18-55mm f/3.5-5.6 IS Lens (Black)", "Date": "May 11, 2008"}, {"Title": "A300 - a fine camera indeed", "Author": "Gil", "ReviewID": "R3KC6PTQ8WBI4X", "Overall": "5.0", "Content": "I had to choose between the a200, a300 and a350.  Like another reviewer said, I think the a300 hits the sweetspot.  The Live view is a feature that I might have to add to my list of requirements for future upgrades.One of the things that annoyed me about shooting with a dslr were my glasses.  To prevent them from being smudged, I'd flip them up when pressing my face against the eyepiece.  Spend an entire day doing this and it becomes a royal PITA.  I've only used the camera for about a week so far and I can already see that I'll be relying on Live view a lot.The other major benefits of Live view are: 1) being able to shoot pics from the ground level perspective (great for kids and dogs) without multiple trial and errors or crouching/laying on the ground (my back thanks me), and 2) shooting over a crowd of heads, fence, glass partition, etc.The image doesn't track as smooth as I'd hoped, but it's good enough for framing the shot.  It shows you the autofocus points as well as providing a live histogram (i love it!).I upgraded from a Minolta 5D and I think I'll miss the depth of field preview as well.  Small price to pay for all the other great features.In summary, get this camera if you're not heavily invested in other lens systems.  I haven't checked out the competition since I'm one of the surviving members of the Minolta clan, but I'm sure others have competent implementations as well.", "Date": "May 14, 2008"}, {"Title": "Lives up to high expectations. Great entry-level+ DSLR.", "Author": "Robert Correll", "ReviewID": "R19T6R1DXR6T93", "Overall": "5.0", "Content": "My first DSLR, and I am very satisfied.Why I bought it:Live View - excellent implementation. This was my number one purchase point for this camera.  Fast switching to and from the Optical Viewfinder. You can use Live View outside of the studio and it acts just like a standard consumer digital camera screen. Screen tilts, which is handy.10MP - this is the sweet spot for price and capability. The Alpha 350 has 14MP, but I decided to save the money and buy a few accessories right away.RAW+JPEG - I wanted a camera that shot RAW+JPEG and didn't skimp on the JPEG. You can shoot high-quality JPEG and RAW at the same time.Great photos - has to do that.Good surprises after I got the camera and started using it:Ease of Use - very easy to start using right out of the box (recharge the battery first).Steady Shot - gives me the confidence to shoot without a tripod and it has a nice readout on the LCD that tells you when you're shaking.Battery life - I've been taking quite a few photos the last week and have yet to recharge the internal battery.Display Button - easy to press and review your photos. Very easy to get back to shooting.Minor Bad Point - in-camera flash is very low and kit lens casts a shadow if you are too close to your subject. I got an HVL-F36AM external flash with the camera so I don't have to worry about this too much.Some mention that the viewfinder is small, but I used it all day today because of the bright sunlight and was happy with it. I was sitting in our vehicle and noticed a tank in my side mirror. I decided to take the photo using auto focus but that didn't work, so I focused manually on the tank about 30 yards behind me through the driver's side window in the left side mirror and got a perfectly sharp picture using the Optical Viewfinder.Great camera!!", "Date": "May 17, 2008"}, {"Title": "Started off pleased. I am not so pleased now.", "Author": "Ticktock \"Ticktock\"", "ReviewID": "R3NCTKP7UKSLYM", "Overall": "2.0", "Content": "I purchased the Sony A300 5 months ago through J&R; Music World. The camera came to me quickly and with no apparent problems. Since then I have used the camera several times to take photos of my grandchildren and also some landscapes.  I always mount the camera on a sturdy tripod. When it is not being used, it is stored in a padded camera case. The last time I turned on my camera the LCD showed a white screen with just a couple of lines running through it.  I did not bang it, drop it or otherwise abuse it. The camera comes with a 1 year warranty. Since I purchased a Sony product I did not expect to have a problem with them honoring my warranty.  They gave me instructions to send it to Precision Camera Repair. After about a week I checked Precision's online repair status and I had a message saying that repairs were delayed because they were waiting for payment. When I called they told me that the camera showed some small scratches on it's base so the camera was obviously abused and therefore they would have to charge me $254 to repair it! I went ballistic. Precision's customer service person told me that maybe they could reduce the repair cost and immediately reduced the charge to $175.  Now you may say that my argument should not be with Sony. It should be with Precision Camera. However when I called Sony Customer Relations they refused to intercede and told me I was out of luck.  My argument is with Sony because they are using an obviously unscrupulous repair service.  How do I know they are unscrupulous? Because I have since found out that what they did to me, they have also done to other people.  There are many complaints about them at these websites: [...][...] Sony's Customer Relations Department turned a deaf ear to my complaint. I had no choice but to pay for a repair that should have been covered by the warranty.I am very disappointed with the durability of this camera and the way Sony handled my problem.", "Date": "November 11, 2008"}, {"Title": "Sony A300 is a great D-SLR", "Author": "jrshan", "ReviewID": "R1SBEL4BWYJ5T1", "Overall": "5.0", "Content": "I've had the A300 for about a month now - I've been using it regularly and am very pleased. I did a lot of research before choosing this D-SLR and IMHO the A300 offers the best bang for the buck in its class. My decision was based on the image quality, Sony's innovative LiveView functionality, in-body stabilization, lens availability (without any confusion as to what lens is compatible, what lens is stabilized or has a focus motor...) and price.I use the LiveView and OVF interchangeably and both work very well for me (and I wear glasses). I find LV and the tiltling LCD particularly useful when using a tripod as it's no longer necessary to contort my body to the OVF to see what the camera sees; it's also very useful for candid shots and to get over peoples' heads (or fences at zoos for example). I've found the LV/tilt-LCD incredibly useful to be able to place the camera on a wall or post or less convenient spots when there's no tripod, and be able to compose and shoot a great night shot.I find the camera responsive - no complaints there - AF is fast and accurate. Metering is flexible, accurate and consistent. Battery is great - lasts a long time and with the % display, I know when I'm running low.The built-in image stabilization has saved many a shot for me where lighting was marginal - I would not want to have to do without this feature.I'm pleased with the image quality (even when I forgot to reset the ISO from 800 after some indoor/no-flash wedding shots). The camera has lots of buttons so I don't have to go searching through menus and if I do need to do something that doesn't have its own button, the Fn button generally gets me there quickly - a well thought out interface that works for me.I have the Sony 18-70 and 75-300 kit lenses and I'm happy with both as they provide great flexibility in range, and they're sharp enough for me. All in all I'm very happy with this tool and if my shots don't come out the way I expect them to, it's more likely my problem than any lens or camera limitation.Knowing what I know now about this setup, I'd definitely make the same decision to buy it.", "Date": "June 8, 2008"}, {"Title": "A true DSLR value", "Author": "WILLIAM IMHOF", "ReviewID": "R2H6BWELDEMKEQ", "Overall": "4.0", "Content": "I researched affordable DSLR cameras and chose the A300 for its rear screen viewing when desired, its 'in the camera body' anti shake system, its comfortable shape and weight, and its excellent picture clarity. The A300 is NOT a 'dumbed down' DSLR. Its sophisticated (yet easy to use)features should satisfy any photographer. Controls are perfectly positioned, settings are easily reviewed, delay time between pressing the shutter release and the picture being taken IS NON EXISTANT. Audio noise is unobtrusive. Bracketing is simply achieved. and the kit lens is fine for general use. As I take Nature photos, I opted for the Tamron 70-300mm zoom lens as a quality yet less expensive alternative to the Sony zoom. I would buy the Sony A300 again without hesitation. [Nevertheless, if you have an extra $400, the new 350 is an impressive choice indeed.]", "Date": "July 22, 2008"}, {"Title": "Best Camera, I mean it", "Author": "P. Chebib", "ReviewID": "R18J8HY5CKVAPR", "Overall": "5.0", "Content": "After researching all the available DSLR's cameras online with in depth reviews from reputable unbiased sites, I found the sony alpha 300k, to be the best price/product available.I have tried the nikon D 60, and then returned it,.I am aamazed at the sony alpha 300 ease of use and excellent pictures quality. All the features included, i.e.: tiltable screen, live view, extra foucs, steady shot and the 2 lenses i got with it, I thought this to be a steal...I am a beginner with DSLR's but not with photography,..I thought i will be using the live view, but I find myself shooting more with the OVF.All the reviews about the small size of the OVF are bull, you see what you are supposed to see and what you need to see to take excellent photos... the CF feature is great.I bought the extra flash (199, ONLY 99 W/SPECIAL COMBO OFFER), the pictures qualities at night are amazing, it adjust automatically to the zoom degree to give excellent exposure.I bought extra batteries, sony alpha bag, and uv protector lens. I think i'll be bying the 28-300 mm zoom sigma lens once the price drops some more..Overall, after spending hourse of reserches, I was drawne to the this sony alpha 300,..i did not know about it befiore, but i am extrmely pleased with the pics quality. ps the 14 mp, does not make a lot of difference unless you are shooting in macro, as the lens mount is the same for the 300 and the 350, in fact it may blurr the puiture by trying to insert more mp through the same size lenses,.. i am glade i stuck to the 300 and saved me 200 dollars.The camera built and feel is excellent very pro, and is very well designed even for the smallest fingers, has a great grip and feels well buils, unlike the nikon d-60.So all of you who may be confused about the camera or what to get: the sony will not disapoint, I am picky by nature and can not find flaws in this machine yet... just make sure to get the extra flash (wireless), and some extra zooming lenses,.. you'll be happy you did.Amazon deliverd the camera in under 1 week, excellent conditions. Just buy the CF, i found the transcend brand to be exceptionaqlly good and fast. get the 8 gb it is a bargain and do not forget the CF reader as most computer doe not have ability to read cf yet. it cost about 15-30 dollars depending on brand.Happy photography dslr style.paul  06 29 08", "Date": "June 29, 2008"}, {"Title": "Great camera for the price!", "Author": "Erick Morales \"\"ERICKTIME\"\"", "ReviewID": "R16046X8SFNAWG", "Overall": "5.0", "Content": "camera takes good pictures, good for the price. It has everything i was looking for in my first digital slr camera. super steady shot image stabillization is a plus for me, you can buy lens for half the price if you are on a budget. I also like the live view with its x 1.4 and X 2 which adds extra zoom to any lens(ONLY ON LIVE VIEW) the flip screen lcd is useful when shooting with live view. to shoot different creative shots, overall i am satisfied with my camera and looking forward to learning how to shoot great pictues and develop better skills in photography.", "Date": "April 30, 2008"}, {"Title": "Excellent camera for the price", "Author": "Adrian", "ReviewID": "R5EE4MIZDPOL9", "Overall": "4.0", "Content": "This is my second dSLR. My first dSLR was the Canon D350. It took excellent pictures, but dSLRs were still evolving and I found the 1.8 inch screen too small to view, and when I viewed pics taken on it, I missed defects in photos, like out of focus areas, because of this. Thus I sold it.As an aside, I still have my film SLR Canon EOS 500 from ages ago. Took lovely photos but obviously not used anymore :)Come 2008, I felt it was time to get my feet wet again. All dSLR's have huge screens (remember the 1.5 inch ones of yesteryear?) and there are more choices than ever before.I tried to order the A300 from Amazon but they didnt ship to Singapore. I bought it from a Malaysian website instead for an equivalent price. As the camera comes with no memory card, I bought a 8GB type III compact flash card for SGD$120. I've since found ther camera is cheaper from Hong Kong. Any lucky travellers to HK wanting a Sony Alpha should go tot Mong Kok and ask around. Same for the Lens- 18-200mm was offered at HKD$3100- before any haggling!Reasons why I chose the Sony Alpha A300:1. Large LCD screen with tilt- I have loved tilting screens since I first got my Sony DSC 30 back in 2000. In fact, all my dig. cameras can tilt- Kyocera SL300R, Nikon S4, Nikon S10.2. Price (of course!)3. Longer zoom than the competitors.  I've always found lens which stop at 80mm (35mm equiv) quite useless. It's just too little zoom for most people. Thus this lens was much better. In fact, combined with the 1.4x and 2.0x zoom ability (it's a button on the top right of the back of the camera) makes it even better. Doing this does reduce resolution from 10 to 5 megapixels, but it's there if you need it.4. Good reviews from many people, including the 23 reviews on this site.5. Relatively lightweight (see below)How have I found it since?I've only taken about 50 photos, but they have been quite good. As I am not a professional photographer who views photos under an electron microscope at the subatomic level, I have no problems with the photos at all. Ones taken in the day at great. Ones taken indoors are obviously not quite as perfect, but certainly quite useable. Face detection is good, and I always have vibration reduction on too.In terms of user friendliness, It's not too bad. I can take most genral photos on auto, but I still need to consult the manual for some things, like how to zoom in when viewing taken photos.The price of the camera means that I did compare it with prosumer cameras too. Many of them were had incredible zooms, but were correspondingly heavier eg Fujifilm s100fs is almost 1kg. I used to have a Sony f828, which was also almost 1kg, and it was a hassle to carry around for lengths of time. The weight difference between the A300 with kit lens and the prosumers is very noticeable and carrying the A300 is very easy.I had intended considering the 18-200mm or 18-250mm lens, but at this stage, I dont think the weight addition offsets the benefits, especially since I can use the nifty 2.0x button I mentioned above. Obviously, using the 2.0x on a 18-200/250mm lens would be heaven itself, but for now, I'll make do :)Woah, that's a lot of writing- if you made it to the end, thanks for your patience!For the above 23 prior reviewers- thanks for your time in penning your thoughts. Every review helped!9th June 2009Sad to say but I'm quite disappointed by the Sony alpha 300. I was initially blown away by the features and price, but after taking a few hundred photos, I'm quite disappointed by the photo quality. They dont seem to be as sharp as the Canon 350D I had a few years back and they seem noisy, even at 100iso. Perhaps I am doing something wrong, or I have a bad camera. In any case, I dont use it anymore adn find my 2.5 year old point and shoot takes sharper photos, so I use that now.", "Date": "September 5, 2008"}, {"Title": "Good camera", "Author": "B. Anderson \"B. Anderson\"", "ReviewID": "R3A6NKXFCUIBAX", "Overall": "4.0", "Content": "I am not unfamiliar with DSLR's and in fact I bought this to replace a Nikkon D40. The sony is easier to use and takes great pictures. However, the flash is a pain in the rear because it is mounted very low. It will leave shadows (from the lens) if you are not careful. I don't use the flash much so it really doesn't bother me. The ability to preview your shots with the LCD is a nice feature, but only use it when you absolutely have to. I recently took 400 shots using only the LCD and the pictures all looked great on the LCD, but they were over/underexposed when I uploaded them to my PC. The photo quality was actually a little bit worse than the D40, which was a disappointment because of the higher megapixel. I have not bought a better lens yet, but that will fix the problem. The problem with that is I could have bought the Nikkon D60 kit for the cost of a high quality lens. I still give it 4 stars. The price is right and the LCD is handy, but do not rely solely on your LCD. If you have the extra money I would recommend the D60. This is a great entry level DSLR I just wish the kit came with a better lens.", "Date": "June 30, 2008"}, {"Title": "Did not meet my expectation..", "Author": "D. Arce", "ReviewID": "R1RTSDJOOW47T1", "Overall": "4.0", "Content": "I'm a long time digital camera user for more than 12 years. The last camera I had is a Sony V3 with a built in Carl Zeiss lens. A very good and a descent camera with a little problem at indoor shots (poor flash).I bought this camera for traveling and vacation with the family and this is my very first SLR camera. I upgraded my old camera hoping for a better quality pictures. The Alpha 100 had very impressive reviews at Amazon.com and that made me decide to buy the Alpha 300 with the kit.I have taken several outdoor shots for both V3 and the new alpha and compared the image side by side. The result was not a big difference as far as clarity. The picture taken by alpha was just a little bit better only because of higher mega pixel. I had a very high expectation and I'm not too happy at all. With my disappointment, I thought of returning the camera but I decided to give another try. I have read opinion of other reviewers who are not too happy either and strongly recommend the 16-80 Carl Zeiss lens. Bought this to a local store and planned to return just in case.(I'm telling you, these lens are very expensive. The price of the lens is even more expensive than the price of the camera kit). Anyway I did another side by side test and the Zeiss lens performed a lot better especially when you zoom in at every detail of the image so I decided to keep it.Overall the camera kit is okay when you are taking pictures without cropping or editing. Otherwise if you are very picky in term with picture quality and clarity then look around. You have to remember that I did not compare with the other brand of the same category. But the money I spend with the Carl Zeiss lens, I could have bought the more expensive version of Nikon or the other brand.My only complain so far beside the cheap lens is the low location of the built-in flash. Raising up quarter of an inch could have prevented the shadow of lens to the subject taken at least 2 feet away. For this an external flash is required.The things I like are.Live ViewI will tell you the advantage is. Because you can be tilt the screen, in the crowd you can raise camera and you can still see you subject as well as on low elevation.I myself want to be in the picture once in a while. When camera set to live view, it will turn to a point shoot setting and people who have a very limited experience can still take good picture. My youngest kid he's 9 can take it 99% good quality pictures I guess with the help of thebuilt in stabilizer.Low light and ISOIt can still take good picture quality without the use of flash.Built-in stabilizer", "Date": "June 11, 2008"}, {"Title": "Better Than the Alpha 350, IMO", "Author": "Yoshmann", "ReviewID": "ROT2JWXTYJ7OU", "Overall": "5.0", "Content": "I took the plunge, and purchased an Alpha 300; Sony being rather new to the SLR arena, there wasn't much information to go off of at the time.  I'm happy to report that this camera performs VERY well, impressing all my Nikon and Olympus loyal friends during multiple photo shoots.The Live View is very useful for awkward position shots; low down, up high, etc. and is the envy of most other camera owners.Picture quality is very high, even in low-light conditions.With the capability of 3 frames/second, I don't see any reason in going for the Alpha 350, which only manages 2.5 at best.  10.2MP is more than enough, even if you're shooting billboards, IMO.All together a very versatile camera, with more than enough features and capability to keep you busy for a long time.  I think only die-hard professionals would need much more.", "Date": "August 8, 2008"}, {"Title": "Forget Sony......", "Author": "G. Spitzer \"the traveller\"", "ReviewID": "R391JIDXL2WBF7", "Overall": "2.0", "Content": "Following one week of using my Sony A300, it was no longer working. Upon Sonys' request, it was sent to one of their repair centers, who advised me that the LCD (an interior piece)was broken and not covered by the warranty. I contacted Sony who stated that it was my fault, that the interior piece was broken and that I had to pay for the repair ($151.00), they called me about four times to restate, that I was responsible, it seems that with Sony the customer is always in the wrong.Sony Alpha DSLRA300K 10.2MP Digital SLR Camera with Super SteadyShot Image Stabilization with DT 18-70mm f/3.5-5.6 Zoom Lens", "Date": "October 13, 2008"}, {"Title": "Not all it should be", "Author": "S. Teeney", "ReviewID": "R3FM2R9SAFE2T7", "Overall": "3.0", "Content": "I purchased this camera about 6 weeks ago with the optional Sony 75-300 mm lens.  I took over 1100 pictures, including landscape, air show (w/ 300 lens) and on vacation in mountain terrain.  I should note this was my first camera purchase in over 5 yrs, having used a Sony Mavica 5MP camera all these years.  On auto mode the pictures were hit or miss, sometimes the sky was washed out in color, I'm talking about taking one picture after the other just seconds apart on a sunny cloudless day, other times it looked fine.  I used aperature and shutter priority modes with mixed results, again just inconsistent exposure one shot to the next.  It did not help that I got dust on the sensor when I put the very first lens on!The one constant on all the pictures regardless of which mode I used was a lack of sharpness with either lens, in any zoom range.  I have read the kit lenses are not the best and that detail suffers, I have to agree.  When I looked at photo's taken using my old 5MP I noticed no difference, and acturally preferred the old camera's quality.  I'm sure in an experienced DSLR user the results would have been different.  In the end, the issue of dust on the sensor, did not realize this is common among DSLR camera's (of note I tried the camera's cleaning mode to no avail), the lack of pop in the pictures (a $500 lens upgrade would take care of that I imagine)and on top of that lugging around a bag with the other lens just took the fun out of taking pictures.  I now know I was not ready or did not realize how much time a DSLR would require.  So I returned the package, and have now purchased a prosumer camera, much easier to operate!  I wrote this review mainly for people like me that have used a simple point and shoot for a few years and got carried up in all the hype the DSLR camera's have gotten lately.  They will take the best pictures in the right hands, but for me an upgrade to DSLR was just too much of a jump.  I gave 3 stars for disappointing detail and softness of the lenses.  Just know what your getting into.", "Date": "November 11, 2008"}, {"Title": "a great entry-level pro camera", "Author": "Dr. S. Tejesh", "ReviewID": "R25BXRKPH01DLF", "Overall": "5.0", "Content": "i'm not a professional nor a novice, i have researched most of the entry-level DSLRs (going to the nearest bestbuy,is the best bet).Compared oly 510, canon xti,pentax 200d,and believe me this is over-all,one of the best built and most functional DSLRs in the market..altough two of them have in-camera image stabilization..the amazing lcd and the excellent live-view are just few of the features that got me hooked,the kit lens is not that bad either and the image quality is highly commendable..so what if it has a proprietary flash-shoe, it's not like u would buy all the accessories at once.. save up and buy the best(ahem, pardon me for the bias)if you are in the \"professional\" zone you wont be looking at these cameras anyways.. moreover sigma and tamron are already making excellent quality lenses for sony SLRs, stop fretting about flashes and lenses, if the body feels right, whether it's sony,canon or olympus,go ahead.. get the rest of the accessories slowly..i'm more than happy with this cam.", "Date": "August 30, 2008"}, {"Title": "Versatile camera that is simple enough for a novice and feature-filled for an enthusiast!", "Author": "P. Fadul \"Gadget Hoarder\"", "ReviewID": "R37B9IO0VSKC72", "Overall": "5.0", "Content": "I've had my fair share of point and shoot camera experience, dabbling in small Olympus and Pentax cameras as well as trying out more advanced, full-featured Canons, Samsungs, and Casios, but I was tired of taking mediocre pictures with compact cameras featuring small sensors. This A300 is my first digital SLR and I went through tons of research to finalize my decision on this model. The other models I considered were the Canon XS and XSi, the Olympus E510, and the Nikon D40x. The Sony Alpha 300 is a superior camera to those listed above for the following reasons:1. IN-CAMERA IMAGE STABILIZATION VIA SENSOR SHIFT. While I intended to use a tripod every now and then, I realize that my shooting will predominantly be handheld, and image stabilization is important. It roughly allows you to shoot at a shutter speeds 4 times slower than one can while holding a camera. For example if you can typically keep a camera steady for 1/40 seconds, you won't have a problem with a 1/10 shutter speed with IS on (not exactly, but a good rule of thumb). The Canon XSi had IS, but it was in the lens. IS in the lens works well, but makes the lens bulkier. With the Sony A300, you don't need to get an expensive lens with IS. That would've been the case if you go with Canons and Nikons.2. MINOLTA A-MOUNT LENS SELECTION. Yeah, yeah, I realize that Canons and Nikons have huge libraries of lenses. But the Sony Alphas have the Minolta A-mount lenses at their disposal. This means cheap lenses (featuring IS, see above) with quality lens glass. And by cheap, I mean cheap! A must-get is the Minolta Maxxum 50mm f/1.7 prime lens. When the Alphas were introduced you could get these for as cheap as $50! Now they're upwards of $100, but try finding a lens with an f/1.7 aperture for the other cameras (with IS!!!) at that price! Great lens for low light conditions. Another must-have is the Minolta beercan telephotos (I don't have it yet but it's on my shopping list!). On top of that, Sigma and Tamron both make lenses for all aperture and price ranges for the A-mount.3. LIVE VIEW AND LCD TILT. Live View may be a gimmick to some, but I feel you can be more versatile when shooting when the camera isn't pressed to your face. Shots in the air and shots close to the ground are a breeze with the tilt screen. Almost all photo magazine publications rave about the Live View that Sony Alphas have. This was one of the reasons I chose the A300 over the A200. I know that the optical viewfinder is smaller than most (around 80%?) but that doesn't bother me. The Live View feature was important enough to scratch the Nikon D40x from consideration. I suggest you go to your local electronics or camera store to see first-hand how well this camera operates.4. IMAGE QUALITY. I hear complaints that the A300 doesn't perform well in high ISO settings. I think it performs superbly. For a good picture, you'd like something under ISO400 anyway. Nikons outsource their sensors to Sony, so if Nikon cameras have great quality I would tend to believe that Sony's Alpha series won't be too shabby either. The 10MP is good enough for me. According to benchmarks, the A300 is a bit faster than the A350 at the highest resolution, but if I had the resources I wouldn't hesitate to grab the A350 over the A300. As far as color and quality goes for A300 pictures, I've been very pleased. Well-exposed shots feature vivid color. The A300 color settings can be customized to your liking in the camera. All the pictures I've taken with sub-par color or exposure have usually been my fault, not the camera's.5. ERGONOMICS AND DETAILS. The A300 isn't too light nor too heavy. The Canons are very light and I feel like it's a bit harder to hold a steady shot when you don't have a solid camera in your hands. The menus are simple and straight-forward. The proprietary hot shoe may not work with Nikon and Canon flash systems, but it's mechanically sturdier (Sony took Minolta's great design) and is compatible with Minolta Maxxum 7000i and 5000i flashes, among others. The lens mount on the camera and the kit lenses are steel, which is way better than the plastic mounts that the entry level Canons and Nikons feature.6. ISSUES SO MINUSCULE THAT THEY DON'T BOTHER ME. Using the kit 18-70mm kit lens and the built-in flash will result in a slight shadow from 18mm up to approx. 25mm. I suggest either use an external flash, or zoom higher than 25mm. It's not a big problem at all. It's only at wide angles. As stated, The optical viewfinder is smaller than most, but fine for me. Support for the Alpha series isn't as good as Canons and Nikons in camera pro shops, and the customer service usually don't know a lot about these models.I got this camera for a steal of a deal. The camera kit with 18-70mm lens, and another 75-300mm Sony SAL75300 lens, a free Epson photo printer, a photography for dummies reference book, and some freebies from Snapfish all came out to $599 plus tax! It hasn't been 20 days since I've had my A300, and the picture count has already surpassed 1,300! It's such a pleasure to use that I hate putting it down. I can't wait for my next vacation so I can use this amazing piece of machinery! If you choose the A300, you will be very pleased and I guarantee you won't have buyers remorse!", "Date": "January 7, 2009"}, {"Title": "A300K Review", "Author": "MRA \"MRA\"", "ReviewID": "R2XYWBYBHLAGJR", "Overall": "4.0", "Content": "The A300 is, but for one flaw, an excellent camera. My pictures are consistently good. The controls are not bad. I would prefer more dials and less menus; however, the critical functions are readily accessible through the function button.The flaw I mentioned deals with the vulnerability of the (LCD) liquid crystal display. Because that display swivels, it stick out further from the camera body than would otherwise be the case. As such it is more likely to be damaged or scratched. Note that, unlike the Olympus E-510, the LCD does not swivel against the body for protection. Incredibly, Sony does not make available, at least for the US market, any attachable protective covers. The \"Lens and Accessory Compatibility Chart\" on Sony's US website does list a plastic sheet (part # PCK-lS3AM) as available for the A300 (and the A350). The \"Accessory\" catalog, at pages 9 and 18, lists the same part. Nevertheless, this part is not available in the US. This was confirmed to me by phone with Sony Customer Support and by letter dated May 8, 2008, from Sony Customer Affairs, that Sony Marketing has made the decision not to make this protective part available in the US. No reason was given. The part is available in Europe, but, not for shipment to the US.This is poor decision by Sony. Putting aside the question of listing the part as available when in fact it is not, the camera needs this part. Sony does make such protective devices available for the A200 and A700. The A300 and A350 need this protection more than the A200 and A700. The decision to deny American buyers the protection offered to Europeans is senseless.I am sure that the aftermarket will eventually remedy this oversight. Until then, unless you have a compelling need for live view and/or a swiveling LCD, stick with the A200.", "Date": "May 14, 2008"}, {"Title": "awesome camera", "Author": "D. Campbell", "ReviewID": "R3NVVCWNBKHGJG", "Overall": "5.0", "Content": "I upgraded to this camera from a Konica Minolta 5D. I'm very happy with the quality and ease of use with this camera. I can use my minolta lenses as well, As a matter of fact, the kit lens on the sony doesn't seem to be all that great really. So I'm using my kit lens off my km5d and am a lot happier with the results. I like the live view preview ability but mostly still shoot through the view finder. I recommend this camera to anyone. From the first time dslr user to the pro.", "Date": "July 19, 2008"}, {"Title": "Take a picture, it'll last longer....", "Author": "Daniel J. Arthur \"SgtDan\"", "ReviewID": "RG2LDPZMNQPUM", "Overall": "5.0", "Content": "Let me be honest, this is my first DSLR...and it is AWESOME!!!  Ok, so I've already established that I'm no expert and by all means, take my review as you will.  I do have to say that my brother, who is a serious amateur photographer (has his own studio, but it's not his main profession), has a Canon D40 (I think that's the one) which was a bit more expensive than mine.  Well at his daughter's second birthday we put our cameras head to head and the Sony a300 consistantly came out ahead.  Boy was he mad that in the category of overall picture quality the Sony came out AHEAD of the Canon!  Who would have thought that?  Sure, sure, he has more options, better positioned buttons and might have a frame (or fraction thereof) per second faster.  Either way, what counts most - picture quality, ease of use, reliability and speed - are DEFINITE winners for the Sony a300.  I'm sure if you're reading my review you've already read a few others touching on the tilt LCD screen, the OVF eyestart auto-focus, the in camera stabilization, and much much more.  I can say for the money, you won't find a better DSLR out there.  I've only had the camera for about a month and a half and taken almost a thousand pictures and have yet to find a drawback.  I'll update this once I do, but don't hold your breath....", "Date": "October 6, 2008"}, {"Title": "LOVE LOVE LOVE IT", "Author": "NRM", "ReviewID": "R2PGJKFSW4Y3H6", "Overall": "5.0", "Content": "I received this as a Christmas present. Within 3 days of having this camera I had taken almost 600 pictures. I have owned many cameras (pentex, kodak, etc... ) NONE were this good. You really have to try to get a blurry picture. I was changing the zoom and took a pic and it still came out clear. I tried everything and kept it on the auto setting for type of pics and it was always clear. I am not a camera buff and it will take me some time to learn all the features, but so far so good. I would highly recommend this to someone without a lot of picture taking knowledge that just wants a good camera like I did.", "Date": "December 28, 2008"}, {"Title": "An ideal entry level DSLR", "Author": "zeevb", "ReviewID": "R32DEW1D1K68SE", "Overall": "5.0", "Content": "After using point-and-shoot digital cameras for several years I've decided to switch to a DSLR. My two main reasons were: shutter lag and low-light performance.Having 2 Canon point-and-shoot digital cameras, I naturally got interested in the new Canon Digital Rebel XSi. An interesting features for someone like myself who is used to point-and-shoot cameras, is the Live View shooting mode which allows you to frame the picture using the screen instead of the viewfinder which is very similar to the way most of us use point-and-shoot digital cameras.When researching further I discovered that the way Canon implemented the Live View mode is not suitable for fast action photo taking, but more for tripod based accurate photographing.A couple of months I heard about the new Sony DSLR cameras.  I was surprised since I didn't know Sony manufactured DSLR cameras. I knew that the Sony brand is well known in audio and video equipment market but I wasn't familiar with the fact that they had professional DSLR cameras.After some reading I've discovered that Sony is indeed a newcomer to the DSLR market and that their entrance initiated in 2005 by jointly developing DSLR cameras with Konica-Minolta and eventually buying their entire DSLR business at 2006. Again, what caught my eye was the live-view feature that Sony implemented in a innovative way which does not hinder the camera's performance (especially the quick focus) when using it.Another feature that the new Sony cameras have (and Canon's don't) is in-body image stabilizer which works with every lens you attach. On the downside Sony's cameras do not perform as well as Canon's in high ISO settings and they have a much smaller variety of lenses available.Eventually, I've decided to buy the Sony and I don't regret it. Live view performs very well and the view finder is very good (although many reviews say that it is too small). I was also very fortunate to get 2 Minolta lenses from a relative so that was a very pleasant surprise and together with the in-body image stabilizer they produce wonderful photos.The camera is very agronomic and you can get to most settings with very few button clicks. High ISO setting noise starts to appear above ISO 400 but whether this is an issue depends on the size of prints you are going to produce. Other then that, the image quality is wonderful, of course this depends a lot on the type of lens you attach to it and there are very high quality old Minolta glass that matches this camera.", "Date": "August 8, 2008"}, {"Title": "Top notch camera", "Author": "aglowucannotsee \"aglowucannotsee\"", "ReviewID": "R6OY6ISS2GQE1", "Overall": "5.0", "Content": "I've had this camera for close to a year and still love it.  It takes beautiful pictures with little effort and has a ton of options if you want to delve in to them.  The tilt-able viewfinder comes in very handy when taking pictures down low (like with children or animals) and when the camera is on a tri pod or propped somewhere using the timer.I would highly recommend an external flash as the one on the camera isn't the greatest, although built in flashes never really are.  The Sony flash will actually work with the camera wirelessly so that even without being attached to the camera it will go off when you press the trigger.  Nice if you want to get lighting from some odd angle.Only real con to this camera is that it doesn't take video.  Would be a nice addition, and would make for less devices to carry.I did have the screen break on me.  Not sure what happened exactly but the camera was left alone with a small child and then the screen was broken.  We suspect it was hit or dropped.  Despite this, Sony fixed it under warranty with no charge.  We were pleasantly surprised.", "Date": "October 8, 2010"}, {"Title": "Digital Photography accessible to newcomers", "Author": "W. Webb \"Titanic Core Extra\"", "ReviewID": "R40D85FQSWD2M", "Overall": "5.0", "Content": "The Sony Alpha 300 is a very nice mid entry level camera to anyone with a desire to explore digital photography.I had first purchased the Alpha 200, and about a week later, Sony launched the Alpha 300. I was able to return my out of the box camera, and ordered this newer model. I am glad I did, because of all the features that this camera has, as I will briefly describe below.It is a fantastic piece of equipment that allows amateurs, and mid level photographers to engage in their creative shooting, while using some of the advantages of a point and shoot camera.One of the main features that makes this camera so desirable is its 'live preview' feature on its LCD screen.I was used to shooting photos on a Sony Cyber before upgrading to a digital SLR. The few days I had the Alpha 200 I hated the fact that I had to look in the viewer. But with the Live preview function in this camera, I was satisfied of being able to shoot as I had already been shooting for about 3 years, and do it with much better results with this 10Mb pixel camera.I spent a couple months shooting with the automatic setting, which is just as using a point and shoot camera.The real power of this camera is unleashed when you start playing with the other shooting settings. I have already transitioned into only using this camera on its manual setting, and being able to create certain moods in the photographs I have shot, all by controlling exposure and aperture, the two technical elements that are required in photography.They are easily controlled and can be changed on the fly, while photographing your subject matter, by a simple button and a dial.A less known feature is the ability to take 3 shoots per second, with different exposure settings, using the EAB (Exposure Auto Bracketing) setting, very useful for those who want to combine 3 shots into one, using postprocessing with either Photoshop, or any other graphics program.The camera is compact, its weight is very manageable, and the life of the battery allows you to take as many photos as you want to create photographic essays on whatever subject you like.I definitely recommend this camera to anyone getting into the fantastic world of digital photography. As I said, you can set the camera in automatic, and learn to use it, and gradually play with the other settings until you are using it as it is meant to be used.", "Date": "April 2, 2009"}, {"Title": "A300- A best choice for beginners", "Author": "S. Chandran \"Saab\"", "ReviewID": "R1GUUNTRGI5F3Q", "Overall": "5.0", "Content": "I purchased the Sony A300 after a few weeks of exhaustive analysis ' The 10.2 MP camera delivers more than it expects. I was in doubt with A300 and A350, but now I realized that a bigger MP does not have much to do with the picture quality. When comparing with A200, I think the live view is worth 100$. Overall very good product which keeps Sony in front among Nikon D40, D60 and Canon starter series.", "Date": "January 12, 2009"}, {"Title": "Great entry level DSLR", "Author": "C. White", "ReviewID": "R2952R7VX9FWPW", "Overall": "5.0", "Content": "After reading dozens of reviews on lower end dslr's, I decided on the Sony A 300.  Mostly I choose this camera over the canon XSI, both within my price range, because of the \"kit included lens\" that came with the Sony and Canon.  It just seemed amateurs and experts agreed that the canon stock kit lens wasn't as good as the Sony kit lens. So that meant buying the Canon and then buying another lens to accompany the camera.  I've had the Sony for about 2 months and I haven't been disappointed. I've used the camera on a daily basis, taking 100's of shots. Now,  I'm just an amateur photographer, but I've been at this for about 12 years and this camera really takes beautiful shots, both indoors and out.  I've recently purchased a 70 by 300mm Sigma DG Macro lens for the Sony and the results are most pleasing.  Sony has done a great job with making this camera user friendly.  So, if you're just a little bored or disappointed with the typical point and shoot digitals and want to jump up to a DSLR, then I would highy recommend the Sony Alpha 300.", "Date": "January 8, 2009"}, {"Title": "Love this camera", "Author": "LDS", "ReviewID": "R17KNNZEGD9PU3", "Overall": "5.0", "Content": "I have had this camera for a little over a month and just love it. I did read the manual the second day and now I can get even better shots of flying geese using the motion setting and the anti-shake button.  The auto focus is great for someone trying to get that once in a lifetime shot.  It is easy to use even without reading the manual and I was really impressed with the quality of my pictures.  I would recommend this camera to anyone.  My only regret is that I didn't order the Sony 500mm lense, but maybe next Christmas.", "Date": "November 18, 2008"}, {"Title": "ABSOLUTELY LOVE IT", "Author": "Jessica P. E. Torres \"JessTBueno\"", "ReviewID": "R2WL4VE93XFW3E", "Overall": "5.0", "Content": "This is a GREAT camera!!! The tilting lcd screen is fantastic and definitely worth the upgrade from the A200. I also bought a tripod (recommended) and so tilting the lcd screen came in really useful when the tripod went higher than my head! The camera feels great in the hand and the buttons are well placed. There is so much to this camera and I am excited about learning how to use everything. Definitely worth buying extra lenses, filters, extra battery etc to make this the perfect package.", "Date": "July 15, 2008"}, {"Title": "Great experience with this camera.", "Author": "D. Crum \"crumvoc\"", "ReviewID": "R3H9P4R4C0UHHW", "Overall": "5.0", "Content": "I have had this camera for about a year, having \"moved up\" from a canon FTb film camera I have had since the 1970's.  (Still works perfectly, by the way.)  The Sony A300 is my first digital SLR, but I have had a few digital point and shoot cameras in the past (the Olympus C765 is my favorite \"old\" camera.)The Sony is plenty feature rich for a slightly advanced amateur like me.  I have taken some great shots with this camera.  It has no shutter lag to speak of, the  \"live-view\" feature is extremely helpful.  I have asked it to do some difficult shots, like time exposures (automatic setting) inside St Peter's in Rome.  Great, beautiful results.  Image quality is very good, excellent sharpness.  Color is maybe a little over saturated, but that can be fixed easily in post production.The stock 18-70 f3.5-5.6 kit lens is nice, but I'm starting to lust after faster glass.  I also purchased a Tamron 70-300mm zoom lens for the Sony which has been great for taking sports pictures from the sidelines.  Tamron AF 70-300mm f/4.0-5.6 Di LD Macro Zoom Lens for Konica Minolta and Sony Digital SLR Cameras  These new digital cameras have such great ASA ranges, that even pokey lenses like the Tamron's can shoot good photos in limited light.For the price, I am very happy with this Sony A300.  My only other comment is I wish it had (high quality) video recording capability.", "Date": "May 24, 2010"}, {"Title": "BIG Bang for you Buck", "Author": "ace009 \"ace009\"", "ReviewID": "R3NXNKPB2DL9YI", "Overall": "5.0", "Content": "I have been using a film SLR (Pentax) camera for some time and wanted to graduate over to a digital SLR. I went around looking for a beginners digital SLR and had to choose from Sony A300, Canon Rebel XSi and Nikon D60. Looking at the prices and the reviews I decided to buy the Sony A300. One of my more accomplished friends bought the Canon XSi at the same time while another of my friends swore by a Nikon. But after a few months, I have realized that for over 95% of our photos the Sony is just as good, if not better than the Canon or the Nikon, and about 20% cheaper. Also, the image stabilization is awesome and since the stabilizer is in the body, and not in the lens, each individual lens is way lighter. The sensor is as good as the Nikon one and maybe a hair less sensitive than the canon one in very low lights (noticeable at 1600 ISO or over). But, I have realized that a 1600 ISO picture is important low light conditions and mostly when all efforts to improve exposure fails, making it very rare. So it is not worth the 20% of price difference for me.The LCD is way better than the Canon XSi for sure, giving you a much better review of the picture.The menu is easy to handle and the controls are really good. However, the battery life is about as good as the canon, and not as good as the Nikon one. But a second battery easily solves that problem.By the way, it might take you 2-3 months to really become up to date with a good digital SLR if you have never used a dSLR before - till then, you shoud not pass a judgement on the camera.Overall I am glad that I bought the A300 and Love taking pictures with it. I think the A300 gives a real great bang for your bucks.", "Date": "January 18, 2009"}, {"Title": "Awesome Camera for the money..", "Author": "Michael A. Walker \"Gadget Guru\"", "ReviewID": "R2NLO5ZYBDQIRP", "Overall": "5.0", "Content": "For the money you cannot get the features this camera from any other competitor. Make sure you read all of teh features and what this camera can do, for one it has 2x Teleconverter built in! that means my 300mm lens is now a 600mm lens. Wow! Even with the standard lens you have good telephoto! Plus it has live view! and an adjustable LCD? for $599? out of this world for an extra $100 over the A200, i bought that at Wal-Mart and took it back and orderd the A300 with overnight shipping!", "Date": "September 15, 2008"}, {"Title": "Best Camera in this price range, hands down.", "Author": "Tiras", "ReviewID": "R1HYJ9IB0B23JJ", "Overall": "4.0", "Content": "I have owned the Sony alpha A300 for a little over a year now. Coming from a traditional film camera background, I find this camera very easy to use while supporting all the features that I need. Sony's liveview is the quickest you're likely to find, and the technology incorporated into the A300 is second to none, and the very useful in the body shake reduction (coupled with legacy minolta lens compatibility) make high quality lenses quite affordable when compared to other camera brands.With that being said, I am slightly disappointed with the image quality straight out of the camera. I find that with stock glass, images tend to be a bit soft, and need richness added in post processing. (This should be expected with a camera in this class though.) The average user who is likely to purchase a camera in this price range will probably not notice much of a difference between the Sony and its competition, and I've found the Sony to be a much better price. I am simply suggesting that the body outperforms the kit glass, and stepping up to a G series, or zeiss lens would really help with the lack of richness. (I'm probably being picky here. A person will likely never notice unless his images are printed over 13\".)This camera really shines when a person leaves the stock modes and sets picture style, and aperture to his liking. The lower ISO's perform beautifully, and I personally don't ever have a need to venture beyond an occasional ISO 800, so noise has never been an issue for my work. Autofocus could be a bit quicker, but again, of the cameras in this price range a person isn't likely to do much better. All in all I love this camera and find it very enjoyable to shoot with.", "Date": "April 9, 2010"}, {"Title": "First DSLR, great value.", "Author": "M. Abdallah", "ReviewID": "R1K8KELDAGKGP6", "Overall": "5.0", "Content": "This was my first Digital SLR camera so I spent some time researching it and other Sony models and Comperable Canon and Nikon models.I think the A300 is a better value because it comes with a better lens than the new models (like A330 and A380).  On the A300, the standard lens is 18 - 70mm while on the A330 & A380 you get a 18 - 55 mm lens.  The only advantage of a 330 or 380 is they come with an HDMI cable so you can see the pictures on your TV.  You get an RCA cable with the 300.  But this is for still shots only as these cameras do not take video.  The 380 has a 14MP resolution, so it is a little slower 2.4 frames/sec vs 3 frames/sec).I prefer the 300 over the Nikons and Canons because of the lower price (about $100 less) and also because it is easier to use and has some more features like the ability to shoot through the LCD or viewfinder, the steady shot (in camera, not lens), 3200 ISO and the tiltable LCD screen so you can take pictures while holding the camera overhead or low to the ground.", "Date": "September 26, 2009"}, {"Title": "great and easy to use", "Author": "lifeisgood", "ReviewID": "R1KTCCZZU7LBM0", "Overall": "5.0", "Content": "I bought the camera to replace my old 35 mm Cannon, it is as fantastic but digital, I only wish it could also take video, how difficult is that? even my cell phone can. Great product.", "Date": "April 23, 2009"}, {"Title": "Great value DSLR for the beginner", "Author": "Christopher T. Chan", "ReviewID": "RTC4JOBPJL7Z8", "Overall": "5.0", "Content": "This is a great DSLR camera.  I've been completely satisfied with it.  I originally decided on Sony because the ability to re-use my old Minolta Maxxum lenses (which is a huge plus).  The Live View was a big selling point for choosing the A300 over the A100 or A200 (as well as over Canon and Nikon), it's definitely worth it for the LCD tilt and taking pictures like you do with point and shoot.  My kids and wife exclusively takes pictures that way.The stabilizer also is very good and helps alot - as I mentioned, even my son (7 yrs) can take very good pictures.My only complaint is the popup flash, I wish it was a little higher and possibly a little more powerful.  I do see some pictures have a shadow from the front of the lense cover (or overhang - not sure that its called).Overall, a great DSLR camera for the beginner, you will not be disappointed.  I would definitely recommend purchasing the LCD cover to protect it from scratches.", "Date": "February 22, 2009"}, {"Title": "Best DSLR for the price", "Author": "mom2boys", "ReviewID": "R2YZ4YALQ04X4N", "Overall": "5.0", "Content": "I compared this camera with the Nikon.  Live View was the deciding factor.  This camera is great.  Pictures are super clear.  I have not had much time to use all the features but many think that the photos were taken by a professional.  I shot on auto mode!  Sports shots come out great, the clarity and speed are really wonderful for an amateur photog.Downside, you can get some shadow as the flash pops up quite low and can cause shadow with the lens.I recommend getting the accessory kit with the extra battery as I am always forgetting to charge it.", "Date": "January 5, 2009"}, {"Title": "Amazing!", "Author": "Metehan Karabiber", "ReviewID": "R1AJRJJJYCU0TW", "Overall": "5.0", "Content": "I bought this camera recently. Modestly, I thought this was one of the best decisions I made! The camera is amazing, it looks beautiful, it takes very, very good pictures, and the price is unbelievably good! I am not a fan of Sony products, but I just loved this. I don't write reviews very often, but I so wanted to share my excitement!", "Date": "July 22, 2008"}, {"Title": "Good Camera for price", "Author": "wholesome housewife", "ReviewID": "R1R6PFGTBUUYFG", "Overall": "4.0", "Content": "Good Camera for price. It has an amazing focus. It takes action pictures great. The one draw back is that it doesn't zoom very far. We are planning on buying a telephoto lens. But great starter camera.", "Date": "December 18, 2011"}, {"Title": "Good value", "Author": "DCGeek1", "ReviewID": "R6QAKILUCE5MI", "Overall": "5.0", "Content": "This is my first DSLR, the only decent camera I had before was an Olympus C2100UZ.  I bought the Sony six months ago, on the recommendation from someone I trust with these kind of things.  At the time this camera had features that other cameras had which cost a couple hundred more.In particular, this camera had Live View.  You can take pictures from the LCD screen in the back.  A lot of entry level cameras didn't have this in early 2009.  It's a fast Live View design, too.  It doesn't slow down the shutter.Live View might not be relevant a real camera purist.  But for someone who's trying to drag his family into the DSLR world, the Live View helped get this camera adopted quickly.While it's not a Nikon or Canon, there seem to be a lot of old lenses out there that work with this camera.  My first additional lens purchase was an inexpensive used Konica/Minolta 50mm f1.7 prime lens for portrait shots.  With this lens, I am now a novice who spent way less than a grand and can even shoot good pictures indoors without a flash in many conditions.It's been a good camera so far.", "Date": "January 31, 2010"}, {"Title": "Sony Alpha DSLRA300K 10.2MP Digital SLR Camera with Super SteadyShot Image Stabilization with DT 18-70mm f/3.5-5.6 Zoom Lens", "Author": "R. Schmidt \"Ebertski\"", "ReviewID": "RQQJ9GH92D445", "Overall": "5.0", "Content": "This is my first slr camera and so far I am very happy with it. I always owned Sonycamera's and never had any problems with them. All the options and features that are on this camera are great.", "Date": "October 18, 2009"}, {"Title": "sony a300", "Author": "David C. Mcsloy", "ReviewID": "RPRSLUB9VRVHA", "Overall": "5.0", "Content": "works very well, I love this camera, it is light in weight ( great for travel or walk around ), uses more reliable cf flash memory cards, has anti vibration built in to camera, unlike canon and nikon that build it into lenses that are more expensive . It also has a tilt up screen, anti-dust vibration and many other features, All that and it is easy to use, with a great 18-70mm kit lens, for a bargin price for a 10mb dslr.", "Date": "July 7, 2009"}, {"Title": "Sony camera", "Author": "V. Paredes", "ReviewID": "R4ALX43Z483CU", "Overall": "4.0", "Content": "I love this camera...great for starter. Still so much to learn about the features...some confusing.", "Date": "May 12, 2009"}, {"Title": "Great DSLR for moving up from a point-and-shoot because of Live View", "Author": "R. Remington", "ReviewID": "RYF9M5JIQ0Z9U", "Overall": "4.0", "Content": "There is really only one reason to choose this camera over the more established Nikon and Canon offerings and that is Live View. To put it simply, this is the ONLY DSLR with the ability to use the LCD screen to compose and take your picture with no sacrifice in focus speed vs. using the optical viewfinder. This is similar to how you use a point-and-shoot. Thus it is a great camera for those who prefer to take pictures using the LCD screen.Canon and Nikon both offer a form of live view that relies on contrast focus to take the picture which is slower and less accurate.I happen to love taking picture using the LCD screen in part because I wear a motorcycle helmet taking pictures which won't allow me to use the viewfinder on a traditional DSLR. Those who wear glasses or who like to shoot from the waist, ground, or overhead will also really appreciate this.If this feature is not important to you, you are better off getting the Canon or Nikon as they are a more mature platform with more support than Sony DSLRs.Keep in mind that the larger sensor on a DSLR allow a much better picture than any point-and-shoot. You will really notice this in low light/indoor shots where you can take pictures largely without flash which always looks so much better. You will also notice a much faster frames per second rate and much more flexibility in composing shots using custom settings.Those who simply want a point-and-shoot simplicity can set it on automatic and get great looking shots.", "Date": "May 4, 2009"}, {"Title": "Greate Value Product", "Author": "Mr. Hetal Dinesh Patel \"Hetal Patel\"", "ReviewID": "R2PWCITRXXKPCA", "Overall": "5.0", "Content": "I think for Taking Corner Shot, High or low Height shots the Live LCD is boon.Camera Battery rocks, Decent options for Lense from G, DT and Ziess Lense.Camera is very very affordable compared to same Feature in Nikon and Canon where we have to pay more then $ 500 for just Normal Lens with VR (Vibration Reduction) as it inbuild in Sensor.I think CMOS Sensor could have render image Better but Price Vs Value Ratio may go up then.", "Date": "March 13, 2009"}, {"Title": "Stellar for the price", "Author": "Joseph A. Barrow \"3rd Man\"", "ReviewID": "RUXJ5KBLQMNV0", "Overall": "5.0", "Content": "I bought this camera at Circuit City's going out of business liquidation sale for $480 to capture my first family vacation to Puerto Rico.  During our 8-days in P.R. we shot over 1500 photos on beaches, rain forest, resorts, restaurants, driving down the road, etc.  The only accessories used were a standard UV filter and high speed 4GB CF card.Pros:- Exceptional Battery life.  Took close to 800 photos over three days before battery needed replacement.- Very intuitive menu.  My wife, who has never used a SLR or DSLR was able to take great photos with this camera (menu setup also makes it easy to teach)- Tilting live view screen.  Nice feature if you want to avoid bending down to take pictures of the kids or get some low angle shots.  Also nice to take pictures over obstacles (walls at El Morro fort)- Compatible with Playstation 3.  I just plugged the camera in to my PS3's USB port and was able to upload the photos into the PS3 hard drive... which brings me to the next point  -- Absolutely stunning photo quality!  After uploading the photos to my PS3, I viewed them full screen on my 65' Mitsubishi HDTV (1080p, connected via HDMI cable).  The results are stunning.  Clear, vibrant colors (all photos shot at 10mp.)  I can even zoom in another 50% and the photos still look good.  We're talking the equivalent of a 31x56 inch photo!- Great instruction manual.  I wasn't expecting the instruction manual to provide a crash course in photography, well done.Cons:- The flash is mounted low and creates a shadow when shooting on objects closer than a few feet- 10mp means really large files and slow transfer times.  But that should be expected...- LCD:  Doesn't sit flush with the back of the camera...  This would be a great improvement.I highly recommend this camera to those new to DSLR's.  Just make sure you budget for all the gear to go with it (good protective case, cleaning kit, UV filter (cheap investment that will save your lenses, CF card.)", "Date": "February 13, 2009"}, {"Title": "Very pleased with this DSLR camera", "Author": "N Doxey", "ReviewID": "R3M2H1OTHFX2GQ", "Overall": "4.0", "Content": "I spent two months reading reviews and looking at the sample pictures taken with various cameras posted on various websites. At first I got caught up in all the specs of different models and the technical aspects of the descriptions.  The more I read the more I was inclined to purchase a high end camera and lens.  But, I kept saying to myself, \"Do you really have to spend $2,000-3,000 to get a good picture?\"  I kept looking at the sample pictures between cameras and decided not to spend 2x or 3x more for a picture that is a little better. In the end, I am glad that I purchased a Sony A300 with the kit and telephoto lens for $600.  I did purchase an additional lens, the Sony DT 18-200mm f3.5 zoom (used $250).  That is lens I use the most. I really like that lens and the results I get with it and the A300. For me it came down to value, liveview, and image stabilization within the camera itself.I have used the camera for two months and continue to learn its features.  Overall, I am happy with the results, the quality pictures. The mistakes I make in failing to get 'the shot' rest more with me than the camera. Some reviewers stated that good photographs depend more on the photographer than the equipment. I believe that statement.  So I'll keep my money in the bank, thank you.  I will continue to use my small P&S; and superzooms when I don't want to carry something as big as a DSLR around.", "Date": "February 2, 2009"}, {"Title": "Very nice!", "Author": "Luchnia", "ReviewID": "RN2TVKFB72ABU", "Overall": "5.0", "Content": "I bought the Sony Alpha 300 in December and really enjoy this camera. The more I use it, the more I like it. It is a camera that really grows on you.For somewhat of an entry level DSLR camera, this is one great camera and anyone that gives it enough time to really get familiar with it will certainly enjoy it. As with all cameras there are pros and cons. You need this lens, or that lens, etc., but each step is important and as you use it you learn all those additional things.This camera is fairly simple and easy to use and once you really get familiar with it (take some time to get familiar with the various features and settings). You will surprise yourself at the great photos you can take. I have seen great photos come from some of the \"not so expensive\" cameras.So the \"art\" of the camera really boils down to the one behind the lens taking the pictures :) You never know when you might catch that \"perfect\" photo and this camera can do it!", "Date": "January 31, 2009"}, {"Title": "Amazing camera", "Author": "Diego E. Chavez Muñoz \"Diego\"", "ReviewID": "R2OQHSV2DBK9J8", "Overall": "5.0", "Content": "This is a really amazing camera. Its easy tu use and it has a lot of modes to shoot under any cirumstances.", "Date": "January 28, 2009"}, {"Title": "Bravo Sony", "Author": "Christine M. Rutkowski \"CRNA\"", "ReviewID": "R2EQTB67GDIQNU", "Overall": "5.0", "Content": "As a Sony advocate I applaud the Sony Alpha! Sharp pics! Flip screen is awesome! Move over Canon and Nikon !I upgraded from a Sony F828 (which I still use! and it's in excellent like new condition and trouble free since the day it arrived).Sony stands behind their product!The only glitch with the alpha is the must  purchase of a convertor which allows one to use MemorySticks. Personally, I feel that for the price of this camera Sony should include the adaptor.", "Date": "November 20, 2008"}, {"Title": "An Excellent Choice", "Author": "genews", "ReviewID": "R3M3Q6UYV5C3MN", "Overall": "5.0", "Content": "The Sony Alpha a300 is an excellent choice for a modern DSLR at Sony's very attractive price point.  The fully functional Live View [with real AF, tilt LCD and automatic viewfinder curtain] adds an exciting and useful facility [especially on tripod with a remote shutter control].  The Super Steady Shot feature [Sony's in body image stabilization] works very well and makes the function available with any lens.  The a300 user [even more so the a350] will likely appreciate the full image quality available from the image sensor using Sony's pricier lenses, but the Minolta A-mount allows continued use of the many fine Minolta AF lenses and accessories.  The Smart Teleconverter [digital zoom] is useful on all lenses and works very well.  The build quality is good, but the camera should be handled with some care.  All in all the a300 is a very useful DSLR and very attractive at Sony's pricing point.", "Date": "November 4, 2008"}, {"Title": "Excellent Camera and Lens Kit at an Affordable Price", "Author": "David De Sousa \"The Automation and Control Guy\"", "ReviewID": "R1QP8DX2PTU1FZ", "Overall": "5.0", "Content": "This is my very first DSLR Camera. I spend some time reading articles and magazine reviews trying to decide which maker/model to buy. I was already inclined towards either the A-350 or A-300 so I decided to look and try them on a store, which happened some 6 weeks ago at a Sony Style Store.Both models are beatiful and ergonomic, with 200 US$ being the difference in price for and additional 4 MP I finally went for A-300X kit, and bought the vertical grip with the 200 bucks I was saving.I have taken some 600 shots with the camera so far, and I am really glad with the results. All in all this is an excellent kit for the price, and the vertical grip  makes handling the camera more confortable for me dur to the additional height it adds to the grip area.", "Date": "October 27, 2008"}, {"Title": "Sony + Minolta = Looks & Specs to back it up!", "Author": "Raymond Fong \"SUPER DUPER '24' Fan\"", "ReviewID": "R1TYBU5QYPLHXY", "Overall": "5.0", "Content": "I just bought the A300 about a month ago, and it is everything a serious amateur wants in photography.  I've compared it with other DSLRs of the same level from all sorts of big brands (Nikon, Canon, Olympus, etc.), and I decided to get the A300.  Minolta has a lot of history and prestige when it comes to making camera body and lenses, and Sony just seems to make improvements on every product they get their hands on.My girlfriend complains a lot about how I tend to move towards more bulky and heavy cameras, and so she stays clear of being the photographer when I bring the camera.  But with the A300, she loves to use it because of its design/compact design, weight (pretty light compared to other DSLRs of the same level), and overall simplicity on operating the darn thing.Sorry if this review doesn't provide the Pro's and Con's on specifications and other technical aspects of the camera; I'll leave the Specs page of the product description for that.", "Date": "October 2, 2008"}, {"Title": "almost perfect SLR", "Author": "Steven Podvoll", "ReviewID": "R1GU9FKLIDH4BH", "Overall": "4.0", "Content": "I finally broke down, replaced by beloved Nikon FTN film SLR *and* my Canon A650 with a digital SLR from Sony.  I can't believe it took this long for someone to figure out that digital SLRs sorely lacked the live view features available on many digital point-and-shoots, and that the live view feature should facilitate waist-level and over-the-head shooting.  This Sony has that, and more.  For example, image stabilization is in the body, not the lens.  This enables the stabilization feature with a wide variety of \"legacy\" lenses from Minolta, Vivitar, Sigma, Tamron, etc.Yet the Sony Alpha is *almost*, but not quite perfect, hence only four stars.  The Alpha has two shortcomings; it is not available without the kit lens which, although it covers an adequate range, it's largest aperture is still small; it requires a proprietary battery and I prefer the ability to run down to a local convenience store when my camera runs out of juice.  Otherwise, the Sony Alpha is a total pleasure to own and to use, IMO far preferable to the competition from Canon and Nikon.", "Date": "January 31, 2009"}, {"Title": "Love this camera!", "Author": "Diane Slusher \"mamaslush\"", "ReviewID": "RRW5GXX29UUQV", "Overall": "5.0", "Content": "Great camera for the price.  Easy to use.  Great pictures in the auto mode.  Even better when I over-ride and try new things thru aperture or shutter speed variations.  I'm really enjoying this camera!", "Date": "August 13, 2008"}, {"Title": "Perfect Point and Shoot D-SLR", "Author": "Chris", "ReviewID": "R2NRFMICWC8ES8", "Overall": "5.0", "Content": "This is exactly what I have been looking for: A D-SLR that can be used like a point and shoot most of the time (just with better picture quality and a lot faster) but gives you the flexibility of a SLR when you have the time and leisure.", "Date": "July 10, 2008"}, {"Title": "Worth the Extra", "Author": "C. Dilworth", "ReviewID": "R3GMVIUZ13GNXY", "Overall": "5.0", "Content": "This is an outstanding camera.  A perfect balance between options and simplicity.  And boy is it fast.  I have small children and it is wonderful for catching fleeting expressions.  Also, if you are looking at whether to get the A200 or the A300, get the A300.  The live view alone is worth the extra money.  I didn't think I would use it as much as I do, but its really handy.  While I am not planning on splurging on any accessories right now, its nice to have the option out there.", "Date": "June 22, 2008"}, {"Title": "Expected more than what I found", "Author": "Vinaykumar Soneji \"Vinay\"", "ReviewID": "R19KTSF5PZZDPU", "Overall": "2.0", "Content": "I have been using various sony cameras right from P9, P10, some fancy handy types which came out as limited editions and lately using DSC-H1 past 2 years now. I decided to buy a new series alpha of sony and is when I finalized the A300 and bought. The contrast, clarity, liveliness on the true colours is all that is lacking in A300. My DSC-H1 is excellent comparing to A300. The pictures from A300 look as if somebody has set an extra film of colour which ruins the results and photos look like they have been stored for many years. I am talking of clicking the photos in either \"P\" mode or \"Auto\" mode. So not as expected. Otherwise, the look of the camera, price, some extra features are not matcahable with other brands. Sony stays quiet exclusive in those terms.", "Date": "December 26, 2008"}, {"Title": "Fantastic and easy to use", "Author": "Byron R. Stinson \"techie\"", "ReviewID": "R2EWY7T4NEGI5N", "Overall": "5.0", "Content": "I have been using the a300 for about and a month and I love it.  These are the best pictures I've ever taken.  I am still learning to take advantage of all the dslr goodies, but it is simple to take professional looking shots right out of the box with auto settings.  The articulating live-view and auto-focus are nearly perfect.My dslr research led me to Sony and I am very glad it did.  Amazon (and Electronics Expo) gave me a great deal and fast delivery.  Great camera!", "Date": "June 12, 2008"}, {"Title": "Horrible Camera", "Author": "mark", "ReviewID": "RBP8X1HA09XI8", "Overall": "1.0", "Content": "This camera is a piece of garbage the other lenses I bought were just as bad the focus was horrible and took for ever I would no reckamend this to anyone", "Date": "March 22, 2013"}, {"Title": "Good SLR for an amateur!", "Author": "M. Tom", "ReviewID": "R3FWSD7OBC0US9", "Overall": "4.0", "Content": "I had considered several Canon and Nikon models before settling on this camera and I could not be more satisfied. I have taken over 10k photos in the last one year I have owned it. I use it along with my Tamron 18-200 and Sony 50mmF1.4 lens and the image quality is quite good. The most impressive thing about this camera is it's battery.The tiltable lcd makes taking overhead and low level photos a breeze. Some shots taken with this camera have been uploaded in [...].", "Date": "April 15, 2010"}, {"Title": "Software beware with Vista 64bit", "Author": "NJM", "ReviewID": "R2PLTK2647HOBX", "Overall": "4.0", "Content": "I purchased the Sony DSLR A300 the first of 2009 and downloaded the software on my 10 year old 32bit computer, the software worked good.  A few months later, I up graded to a new computer with Vista- 64Bit processor.  I loaded the program on my computer and did a reboot as it asked, the computer did not start up again, I received an error message \"Windows failed to start, a recent hardware or software change might be the cause\". Even though Sony's site says the program will work with Vista, it does not.  I got my computer fix and tried again with the same result, the software program is now on the way to the dump", "Date": "October 5, 2009"}, {"Title": "well worth it for the money.....", "Author": "Christian F. Marilla \"peacemaker\"", "ReviewID": "RBR8Y7YTOB2M0", "Overall": "5.0", "Content": "my wife is very well satisfied with the product and im also satisfied with the pictures that were taken.....", "Date": "January 27, 2009"}, {"Title": "Good camera from Sony", "Author": "Tullio Fontana", "ReviewID": "RS37RJJ2UPY25", "Overall": "3.0", "Content": "The A300 sits between the featureless A200 and the A350. It's a good camera, with excellent dynamic range and one of the best Live View implementations out there. However, the kit lens is mediocre to say the least and as a result, the camera's performance is compromised. My camera was defective and even though the problem was not a serious one, I returned it and went for a refund, which I used to buy the new Olympus E520.", "Date": "October 9, 2008"}, {"Title": "Real time view", "Author": "Hongbing Zou \"Good user\"", "ReviewID": "R1RE3VOO1BVCW8", "Overall": "5.0", "Content": "The is lowest price DSLR carera that has the realtime lcd view. It's very good and easy to use, the picture is very clear.", "Date": "May 12, 2008"}, {"Title": "Great camera", "Author": "Michelle C. Mix \"Michele\"", "ReviewID": "R121W3GB5MEZYT", "Overall": "5.0", "Content": "I really love this camera.  It is very easy to use.  I was so happy to know that my Minolta lens and flash were compatible.  I would highly recommend this camera.", "Date": "May 31, 2008"}, {"Title": "Forget about your old DSCF828 Accessories", "Author": "Capt Dials \"Boatpoker\"", "ReviewID": "R2J8W27MEAY3BM", "Overall": "4.0", "Content": "Don't get me wrong; I do like this camera. BUT, if you're an old DSCF707 or DSCF828 user--such as me (I have both), forget about any of your old stuff working on this camera.I'm disappointed that even the lens cap does not have a lanyard anymore. The high-end flash for my 828 will not fit the A300 and forget about the batteries, chips or even the USB wire plug being the same. Making matters worse my two Sony remote control tripods won't plug in to the new camera.I'm more than a little bummed that as an avid Sony Pro-user (daily) that everything has to be bought again. The old 828 unit even came with a charge plug slot, now this new one you have to remove the battery. They could have done better. But, alas, in fairness, I paid more $$$ for the 828 so they had to cut somewhere...just didn't expect EVERYWHERE!UPDATE 9/2/08--I may have to send this back--this camera does not appear to imprint a date stamp on the photo like the F828. It appears the date only imprints when your have a \"compliant printer\" which does me no good because I print to .pdf--for investigative work (email). I have a note into tech support but after doing a search of the issue I've come up with a blank. Had I known it would have been a no purchase for sure. I sure hope I'm missing something here. IF this gets corrected I will report back.", "Date": "August 27, 2008"}, {"Title": "Don't waste your money. Purchase a Nikon or Canon...", "Author": "A. Javier \"Giturdun13\"", "ReviewID": "R3G8ETAD3WRXWS", "Overall": "1.0", "Content": "I purchased my SONY Alpha 300 several months ago. Since then almost 75% of my pictures are bad using the flash. This is not due to the plastic guard the attaches to the front of the lens. If it was the guard, the shadow would occur all the time. I don't think the Sensor is bad because the shadow occurs when using the flash...strange. The shadow is a black arc that appears at the bottom 1/4 of the image. I am waiting for a response from Sony on the cause. Regardless if they can fix it, I have a lot of good pictures that have been ruined. Maybe SONY should add Photo Shop in camera package to fix the bad pictures. I should have went with a proven camera, such as Canon or Nikon.To be fair...If you're lucky to purchase the camera without this problem, Congrats. I would otherwise rate the camera 5 Stars. The images are awesome. I purchased the camera after reading a Mag review stating the Menus blew away the competitors. Since I am new to digital SLRs the Menu ease of use was a big deal. The Menu is easy to use, I hardly used the users manual.Just beware when buying this camera...are you confused now?From my experience this camera is 1 Star.", "Date": "December 6, 2008"}, {"Title": "It's like a toy", "Author": "JeffP \"JeffP\"", "ReviewID": "R2VYG1P2J4Y8B0", "Overall": "2.0", "Content": "I bought this and returned it for a Nikon D90. Poor quality and it felt like a toy compared to the Nikon D90. Don't waste your time or money. Go with Nikon or Canon.", "Date": "February 12, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "10.2 MP for high-resolution image detail\nKit include DT 18-70mm zoom + 55-200mm telephoto lenses\nHigh sensitivity (ISO 3200) with noise reduction\nTiltable 2.7¿ LCD screen for high/low angle shots\nIn-camera image stabilization", "Name": "Sony Alpha DSLRA300X 10.2MP Digital SLR Camera with Super SteadyShot Image Stabilization with DT 18-70mm f/3.5-5.6 & DT 55-200mm f/4-5.6 Zoom Lenses", "ImgURL": "http://ecx.images-amazon.com/images/I/418kH08-BxL._SX300_.jpg", "ProductID": "B00138R12I"}}