{"Reviews": [{"Title": "The Nikon Coolpix S52c - A Great Point And Shoot Camera With Wireless Features", "Author": "Mark \"Technology, Music and Movies\"", "ReviewID": "R3SJTX9CTVRL9K", "Overall": "5.0", "Content": "The Nikon Coolpix S52c 9MP Digital Camera Zoom with Wi-Fi (Vibrant Black), has all the good stuff that's included with the S52 plus the added wireless antenna and related features.  Certainly it's brother, the Nikon Coolpix S52 9MP Digital Camera (Midnight Black) is a great all-around  point and shoot camera. Both offer great performance and value that is best in class.  While I originally got the basic model, for only $30 to $50 more this guy gives you a great wireless feature.  Even if, like me, you don't use the wireless upload much now, at the discounted Amazon price it's worth having for the future.Canon's newer models have been steadily adopting some of the features that Nikon has had in it's Coolpix S series for years, such as the 3 inch screen and scroll controls. I still prefer the Coolpix overall out of point and shoot models in this price range, but the Canon's have some advantages and wider popularity.  When it comes to the wireless in this version Nikon leads the market with this feature.The screen on this camera is an AWESOME 3 inches of clear and durable optical lens quality glass.  This has the nicest screen out of any point and shoot camera out there, though the opaque controls on the Canon's screen are slicker.  You may want to get a screen protector.  But careful handling of my S50 has proven to me that the glass is very durable and not easily scratched.Functions And FeaturesThere are some interesting functions, included red-eye correction and image cropping.  Once again, most people will be loading their pics on their computers and then dealing with those edits.  Still, it's nice to be able to do them.  These types of functions have become almost like minimum requirements for top point and shoot subcompact cameras.The control wheel lets you scroll through your photos when displaying them on the screen for review.  It only takes one button to delete a picture.  It's also easy to access all the menu functions.  Switching between camera mode and video recorder mode is just as easy, and reviewing your pictures via play mode is accomplished with one button as well.The zoom on this camera is internal as with all S50 and S51 models.  That means no waiting for the lens to zoom in and out, and no worries about the mechanical issues with those external lens extension cameras. That makes it easier to accept the 3x optical zoom. Digital zoom should be ignored when making your purchasing decision.  Always compare cameras to each other with the optical zoom in mind.This is a huge plus for this camera, and helps to maintain the slim profile. Some of those super-slim cameras aren't nearly as thin when they are turned on and the lenses are sticking out. There are thinner cameras, but none of them are as affordable and as packed with features as this one.This is an update to the S50 and S51 versions and adds more megapixels (9M!) so that you can produce prints up to 16X20.  More megapixels never hurt anybody. :)Picture taking is good, and if you get a faster memory card it will be better.  There is definitely a lag though, and using the light-hold then click technique worked best for me.  The Auto settings are good enough for most basic uses.  But low light and nighttime situations just don't perform as well with auto.  So the short answer is, if you have to shoot in low light, set the ISO manually! There's also a \"High ISO\" option that seems to work ok, but setting it to 1600 seemed to work best overall.Testing the wireless upload feature has convinced me it can perform well for some people.  But there is a lot that goes into connecting to a wireless access point.  Getting the pictures up on the website is the easy part.  Configuring access to a secured wireless access point took some time.  Clearly, unsecured Wi-Fi is a piece of cake.  After taking a little over 1 hour to set it up once, I can say it was well worth it.  I don't think I'll use this often, but it will do in a pinch.  Uploads are too slow to be used for video, but can be used for a few pictures easily.  Once again, uploading is slower than I would like but will do in a pinch.The video recording features are pretty similar to prior models.  The video quality is great, but sound quality could be improved.  Video quality depends on your memory card quality and speed even more than pictures.  And rest assured, this card is SDHC compatible so choose a nice class 6 card till the faster class hits the consumer market later this year.  And also keep in mind that your computer probably isn't SDHC compliant (unless it's very new) so get a set with and SDHC reader included or transfer pics from your camera and not from the card.Comparing The S52 To The CompetitionCanon obviously has a few models that rule this space, best among them being the SD1100 IS and the SD790 IS.  I actually still prefer the 770 over the 790, but whatever. There are good reasons for choosing any of those, but none of them have the internal lens.  If you want that feature, the Nikon stands alone.  For regular shooting conditions, Canon's image processing system is faster and more reliable.  But the low light performance of the Nikon is better than the lot of them.The body of the camera is nice and thin.  When you consider that the lens is internal and does not protrude, this guy is thinner than almost everything out there, including the Casio Exilim.When choosing between this camera and other options, you need to be aware of a few points.  The Sony Cybershot T300 10.1MP Digital Camera with 5x Optical Zoom (Black) is a nice camera that also performs well and perhaps has a better responding auto-detection mode for low light situations.  But I tested the S52 by setting the ISO manually to 1600.  The results were somewhat surprising and produced better quality pictures in low light than Sony's auto setting.  Obviously you can also manually set the T300's ISO, but the differences are negligible at that point.Other things to consider is that you must use Sony's proprietary Memory Pro / Duo, which is more expensive with fewer speed options available. The T300 has a thin body, but the sliding lens cover adds considerable thickness and I personally find it annoying.  In addition, the T300 is much more expensive and not even close to the S52 in terms of value.  In fact, the Canon's are also more expensive relative to features, and Nikon really is the best bang for the buck here.The Nikon Coolpix S600 10MP Digital Camera with 4x Wide Angle Optical Zoom (Slate Black) has a widescreen capability that may appeal to some and 1 megapixel more for a total of 10.  When you add in the greater zoom magnification, that camera is a great option for many people.  Just keep in mind that the S600 does have an externally articulating lens, so it's much less compact than the S52 when actually in use.  I am just too hooked on this internal lens to use the S600 full time.The first real con you should be aware of is that your battery will need to be recharged after a few full days of use.  That is pretty normal, but it did annoy me at first that I didn't have a spare battery.  So get yourself a spare battery and keep it charged, which is good advice for any camera.  Because this uses one of those proprietary batteries, it doesn't offer the ease of use that comes with models that use AAs like the P60.  The other con is that you have to buy a little case for this camera, which seems like something that should be included.Review your options with a mind towards the kind of shooting you need to do.  Bottom line, get yourself this camera if you want to have a nice camera for everyday general use.  This camera is durable, easy to use and loaded with features.  And if you don't mind a few more bucks, the added wireless feature is a nice extra that will no doubt become more common with other entries in this group planned for later this year.Enjoy.", "Date": "June 3, 2008"}, {"Title": "Excellent Photos, Abysmal Audio", "Author": "P. Griffin", "ReviewID": "R1EVSYPA0Q1XYP", "Overall": "2.0", "Content": "I was so excited to receive my brand new CoolPix S52 (Eco-Green), and the photos were really quite excellent. I was also pleased that it was very easy to learn how to use the various camera features. HOWEVER, when I used the movie or voice recording modes there was a very high level of awful static sound recorded EVERY TIME. I upgraded to the best memory card I could find, and that did not make a bit of difference.Naturally, I returned the camera under Warranty (with sample video/audio) to Nikon TWICE for repair or replacement. To my dismay, they returned it to me both times stating \"Your unit was thoroughly checked and was found completely within the factory standards\". They also said not to expect the sound quality to be excellent because it didn't have a \"sophisticated microphone\". Maybe so, but it shouldn't be so poor that you cringe when you listen to the playback.I was so disappointed that I sold the camera used and replaced it with a Canon PowerShot SD850 IS (Digital Elph) Canon PowerShot SD850 IS 8.0 MP Digital Elph Camera with 4x Optical Image Stabilized Zoom that I am extremely happy with (both photos and sound are fantastic).Bottom line - if recording movies is important to you, don't buy this camera. It will be a big disappointment and a waste of money. If you decide to buy it, be sure to test the movie and sound recording modes soon after you receive it to be sure you are satisfied.", "Date": "August 1, 2008"}, {"Title": "Beware - Features Missing", "Author": "WS", "ReviewID": "RLO8W56QQ5H1S", "Overall": "2.0", "Content": "For some reason Nikon has removed two features from the Coolpix s52c that existed in the Coolpix s7c thereby crippling the Nikon s52c.First, you should be aware that unlike the Coolpix s7c, the Coolpix s52c is missing the Panorama Assist feature found under the Scenes option. Why Nikon would remove this feature is a mystery to me.The Coolpix s52c is sold and advertised as a WiFi camera. Unlike the Coolpix s7c, which can wirelessly transmit pictures directly to your own computer hard drive, the Coolpix s52c can only wirelessly transmit pictures to Nikon's MyPictureTown web service or email. Not a great option if you don't have a very fast connection to the Internet. And what happens if Nikon discontinues their MyPictureTown web service? The WiFi feature of the Coolpix s52c becomes useless.It really is a shame that Nikon has crippled the Coolpix s52c in these two areas. I hope Nikon will restore these two features in a future firmware upgrade.Until then - buyer beware.", "Date": "August 6, 2008"}, {"Title": "Not quite as good as I hoped...", "Author": "hannibalsmith \"hannibalsmith\"", "ReviewID": "R30CNFR3E6UQKH", "Overall": "4.0", "Content": "On the good side, the photos I've taken with this so far are great.  Nice colors, sharp, and low noise.  I have no complaints as far as this unit's actual functioning as a picture taking machine.  And, as others have said, its really small, and the whole lens is internal to the camera body - it doesn't telescope outwards like some other competing models which keeps the unit thin, even while in use.But a few things dissapointed me - none are deal breakers, but...* Camera connects to computer via USB interface, but the connector on the camera is not a standard USB or mini-USB connector.  Instead have to use proprietary cable included with the camera.* The menu system is a bit odd - its not unlearnable, but its not all that intuitive at first either.* The materials used on the exterior of the camera a) are slippery - the strap is definetly needed - and b) are all glossy or shiny, so fingerprint very easily.  Its pretty much impossible to touch the camera without leaving visible fingerprints and smudges.  Couple that with some buttons and other controls that really are just too small (and I don't have large hands), and I think it leaves a bit to be desired, ergonomically speaking.* The lens cover does not close when in playback (not shooting) mode - seems like it should - especially because a couple of buttons are located in the perfect position to lead to accidently touching the lens.* The color is listed as \"black\", but its really a dark brown, and when the sun hits it the brown comes out a lot more.  If that's important to you, be forwarned.  It seems like the s52 (not the s52c model reviewed here) is available in a color that is actually black, but the s52c is not.", "Date": "July 18, 2008"}, {"Title": "WiFi is a waste", "Author": "J. Hofman \"Plastics Guy\"", "ReviewID": "R2XKB4K2CJCEBL", "Overall": "3.0", "Content": "The camera itself is great.  The WIFi feature is a waste because it limits you to sending a down-sampled version of your image to a Nikon-owned web site - NOT your hard drive, which would be a much better use of the networking feature.Hopefully they will kick-out a firmware update that un-cripples this feature.  Why would I want to upload an image to someone else's web site (with limited storage).", "Date": "September 3, 2008"}, {"Title": "Great Choice for Picky Snapshooter", "Author": "Virginia Reader", "ReviewID": "R2ER0WL6ZQP7CP", "Overall": "4.0", "Content": "Are you looking for a quality digital camera that takes great high-resolution snapshots? One that easily slides into your pocket? One that is reasonably priced? Well, there are lots to choose from, these days. Give the Nikon Coolpix S51 or S52 consideration.I am a bit picky and I was looking for something more than simple point and shoot for a recent sightseeing trip to Italy. My days of film cameras are over, but the versatility of an interchangeable-lens 35-mm SLR was on my mind. I loved the Nikon FS2S I used for over 30 years. Yet, the bulk of camera and several lenses—and the cost—was of major concern. What if I dropped an $800 camera or worst, it was stolen? I decided to forego the advantages of a new digital SLR and try getting by with the much cheaper and smaller Coolpix S51C. The model with the \"C\" has Wi-Fi capability. I'm not a professional photographer, so really good \"snapshots\" with a bit of creativity better categorized my style this trip.Here are the things I really like:First, the picture quality is wonderful for such a camera. The high-resolution setting yields sharp pictures suitable for prints 8\"x10\" and beyond. Regrettably, there is no RAW format, but the dynamic range has pleased so far. Second, the size and weight. I can't say enough about how great it was to slip the camera into my shirt pocket—a bit heavy there—or pants pocket. Here are some more things I like about this camera:- The settings are easy to make with the thumbwheel control and built-in settings software.- There are a variety of pre-set modes: landscapes, sunsets, museums, etc.- Vibration reduction works surprisingly well.- Almost always, exposures are right on. I did find that manually increasing or decreasing exposure helped in a few unusual lighting situations. This is quick and easy to set.- The pre-set mode I really like, one you won't find in most other cameras, is panorama assist. This is really neat. Set it and take the first picture. Then one-third edge of that picture appears in the LCD screen, transparent so that you can line up and overlap the next picture. By taking a series of pictures this way you can later create an ultra-wide panorama photo, or if you go all the way around, a 360-degree panorama. Software is provided for stitching pictures together to create the panorama from the individual shots. Traditionally, such pics require a better camera, tripod, and patience. I made several panoramas, even handheld. Works great!- Battery life is pretty good. I bought two extras so I would never run out. Since I shot mostly without flash, one fresh battery charge would last much of the day, maybe 100 or more pictures. I'd recommend carrying at least one extra battery and recharging at night. I got a cheap, compact recharger and extra batteries before my trip.Some so-so features:- The lens is of fairly typical zoom range. It works well for most shots. There were a few times I wished the telephoto was longer. The digital zoom that goes beyond optical zoom adds lots of pixel noise and is unsatisfactory. I won't use it again unless I see Big Foot or a UFO. As for the wide end, it is just okay; not wide enough for great interiors. I just love really a true wide-angle lens, something comparable to a 21mm on a 35mm film camera, but that is unavailable in this type of camera. Again, the zoom range is average, but the quality is very good—it's a Nikon lens.- Memory card. The memory card that comes with the camera is just too small unless you want to shoot just a few pictures at a time or only shoot medium- or low-resolution. I bought a 4 GB high-speed card and am glad I did. It stored almost a thousand hi-res pictures. I did swap out to a second 2 GB card after two weeks and came home with over 1400 photos, never having to offload images to a computer.And here are a few dislikes:- The polished metal case is slippery. Use the hand strap or risk dropping it.- The lens is in the corner. If you are not careful, you can get your finger in the field when shooting. You will learn how to hold the camera after a number of fumbles.- Even when selecting one of the pre-set modes like landscape, the auto-focus takes a moment to adjust itself. The lag between pressing the shutter and taking the picture might be a fraction of a second, but a fraction too late for that great shot. I wish I could turn off auto-focus and have several presets from which to choose.- Wireless Wi-Fi. I thought I would be able to transfer pics through my home wireless network to my desktop computer. Not so, or at least I haven't gotten that to work and can't find anything in any manual. I was able to send several pics to the Nikon server called Picturetown. But, that transfer choked because the wireless is just too slow to handle hi-res pictures. Don't count on sending anything but a few low-resolution pictures to grandma via the direct wireless feature. If you don't absolutely need the Wi-Fi feature, save the money and get the cheaper S51 or S52 model that has everything else and is a tad smaller and lighter.Now, one day, perhaps soon, I'm going to buy a digital SLR—a Nikon, of course. I like looking through a viewfinder and setting focus myself. Most of all I want a great wide-angle lens. But I am very happy with my Coolpix S51C and will continue to use it on many occasions.Seeing Italy? I know you will be happy. I think you will be happy carrying along a Nikon Coolpix S51 or S52 too.", "Date": "July 6, 2008"}, {"Title": "I love this camera", "Author": "Scott Wise", "ReviewID": "RTV6W5I321YAL", "Overall": "5.0", "Content": "This camera has an incredible set of features for the price.  It takes great pictures and is fast.  The only issue I have with it is the wireless.  In the advertising they make it sound like you can upload the pictures directly to your PC and that isn't true, you have to set it up to go through a web site then copy to your PC.  other than that, greta camera, good price, excellent quality.", "Date": "August 15, 2008"}, {"Title": "A Jack of All Trades", "Author": "New York Nick", "ReviewID": "R1WK6TWQ7LX2XL", "Overall": "5.0", "Content": "A huge step up from my previous camera, Canon S80. I use this camera for work and the image quality is much improved. I was attracted to this camera for it large screen and \"Slim, stylish all-metal design\". The screen size is excellent, but I'm not sure what Nikon means by all-metal design. Maybe the chassis is all metal, but the case is plastic. In any event, the S52c is very slim which gives me the covert abilities sometimes needed to get the job done. The reasonably fast rate of shutter operation is welcome as well. The biggest selling point for me was that there are no moving/ telescopic parts at extend if the camera accidentally turns on in your pocket. Overall, this camera is excellent for a point-and-shoot and I look forward hopefully toward many years of service.", "Date": "July 8, 2008"}, {"Title": "Fraudulent Sale", "Author": "Carlton M. Grady", "ReviewID": "R1UIGGLSXLW7XE", "Overall": "1.0", "Content": "This camera was sold to me as \"new\" condition with one year warranty.  6 months later the camera broke, so I sent it into the Nikon Repair center and was promptly informed that the camera was refurbished and the warranty was only 90 days, so guess what, not covered.", "Date": "March 5, 2012"}, {"Title": "very disappointed", "Author": "peanut butter", "ReviewID": "R2PQI0QVWUEL0D", "Overall": "2.0", "Content": "I have a canon sd870 and am really happy with it. Recently I ordered a coolpix s52c for my mom, since the review looks great and I want to try out a different compact DC. I have to say I am very disappointed with coolpix s52c, for the following 2 reasons:1) the shutter speed is very slow. After shooting one photo, it takes about 3 secs for user to shoot the next one, since it takes awfully long to save a photo. My canon sd870 only needs 1 sec, by comparion. This is the main reason I don't like this camera.2) the buttons are hard to press. A lot of times I thought I pressed on a button however camera didn't respond, so I had to press hard again and again.I am returning this camera.", "Date": "September 29, 2008"}, {"Title": "great value point and click camera", "Author": "Duncan Henderson", "ReviewID": "R2LM1FJ9APLZLQ", "Overall": "4.0", "Content": "My wife and I have been using this fully featured camera extensively for the last few days and we are very happy with the results. I love the way that it automatically uploads all recent photos to the internet when plugged back into the recharger - this has got to be the future of all digital devices. With my previous digital camera this involved connecting a cable from the camera to my PC and then uploading manually from there.My only gripes are:1) It took me several hours and several calls to customer support to get started with my home WiFi connection. They were a bit lost with this feature and amongst other things, had me download and install connectivity software that I didn't need onto my PC. The user manual was poorly written and misleading. In the end I figured out that I was simply using the wrong WEP setting, but the camera was not giving me any error messages or feedback to indicate that.2) The myPictureTown website is a bit basic. It would have been nice to have had some photo editing features there, but I am using the camera's built in editing to 'fix' the photos before uploading. Also, as someone else mentioned - what if Nikon pulls the plug on this website?", "Date": "January 4, 2010"}, {"Title": "they send me another model (wrong model!!!)", "Author": "Eduardo S. Loureiro \"Eduardo\"", "ReviewID": "R1DX24E0P04975", "Overall": "1.0", "Content": "I bought the model S52C, with WI-Fi, and they send me the model S52, without Wi-Fi, and the only reason to want this old model were just the wi-fi possibility!!Disrespect the consomers!", "Date": "November 4, 2009"}, {"Title": "Nice camera!", "Author": "Luis Rebolledo", "ReviewID": "RZW5JCGJJS48Z", "Overall": "5.0", "Content": "I bought the previous model for my mom gift without the Wi-Fi and it worked real good, it's very compact and it has a nice resolution. I decided to buy the new model with Wi-Fi and it works real nice, it's easier to download the pictures now.", "Date": "January 16, 2009"}, {"Title": "+++++++", "Author": "Olegfrog \"Olegfrog\"", "ReviewID": "R1T6AYKDIMWF45", "Overall": "5.0", "Content": "Nikon Coolpix S52c 9MP Digital Camera is a very nice tool indeed!!!!I am absolutely happy to own it! And Wi-Fi ability is actually very handy! Instead of promising photos to your friends, you send them right away (if there is a wireless i-net connection available of course).", "Date": "January 11, 2009"}, {"Title": "Nikon Coolpix", "Author": "L. Dickerson \"Lisa\"", "ReviewID": "R2P9IKFTAC1EUV", "Overall": "4.0", "Content": "I am enjoying the ups & downs of learning all the functions this camera has to offer.  It has so many options for different kinds of pictures it can be confusing and hard to remember where to go.  I do like all the options but for me it might have too many.  I guess I should have picked a camera with more just shoot and go since I am not a huge photo taker.I have friends that really enjoy the Wi-Fi option and I thought I would also but didnt realize I needed to subscribed to T-mobile to be able to use that option.  Not decided if I will continue after the free trial offer yet. (cant find a cost for it)My husbands hands are larger and has a bit of trouble holding it and focusing on the points of interest.  Myself I have no problems.Overall the camera is good for the money spent with all the options it has to offer.", "Date": "December 28, 2008"}, {"Title": "Amazing Camera!!", "Author": "Nikon lover", "ReviewID": "R3LTF7EFFYCR0A", "Overall": "5.0", "Content": "This camera has everything that I wanted when I sought out to buy a camera.  I wanted something small that can be thrown into my back pocket or my purse.  I wanted a large screen to display the pictures on, and I wanted it to look cute.  The Nikon has all of that.The only thing I would have to say I dont like about it, which is so minor, is that when reviewing photos, the image doesnt flip to the way you are holding the camera.  That was something about my old camera that I loved, but I would give it up to have this Nikon.  Its FABULOUS!", "Date": "December 27, 2008"}, {"Title": "Great Camera", "Author": "FE", "ReviewID": "R167V3S1H9FXLH", "Overall": "5.0", "Content": "Best point and shoot camera.  WiFi an added bonus with one click email of pics.  It's small, fits in a cell phone case and easy to use.  Good features too. A good compliment to a SLR when you don't want to be carrying around a full size camera.", "Date": "November 25, 2008"}, {"Title": "Great Camera", "Author": "JPru", "ReviewID": "R1J936KADTRSXZ", "Overall": "5.0", "Content": "I haven't had the camera for too long but this is a great camera. It has the automatic picture settings as well as the manual settings. Takes great pictures and a great price.", "Date": "June 27, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "9-megapixel resolution for stunning prints as large as 16 x 20 inches\n3x optical Zoom-Nikkor glass lens; Optical VR image stabilization\n3.0-inch high-resolution LCD display; 170-degree viewing angle\nWireless capability; e-mail and store pictures directly from the camera in Wi-Fi open access hotspots\nCapture images to SD memory card (not included)", "Name": "Nikon Coolpix S52c 9MP Digital Camera Zoom with 3x Optical Vibration Reduction Zoom with Wi-Fi (Vibrant Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/412LyOHAEWL._SX300_.jpg", "ProductID": "B00176IJFO"}}