{"Reviews": [{"Title": "CAMERA", "Author": "sarah taylor", "ReviewID": "R22FJLJVUD0DEB", "Overall": "4.0", "Content": "A SIMPLE CAMERA AS A GIFT FOR MY MOM FOR HER TO GET INTO DIGITAL THIS IS A BEGINER CAMERA FOR HER AND SHE ENJOYS IT..THANKS", "Date": "January 14, 2013"}, {"Title": "Polaroid used to make good products but not this!!", "Author": "Tia D.", "ReviewID": "R15JCSZGDTKIFH", "Overall": "1.0", "Content": "I bought this camera around 4 or 5 years ago (in Dark Blue though not green) and have NOT been happy with it since day one. It takes 2 AA batteries which only last a good maybe 10-20 mins or for about 6 pictures! I usEd this at my kids graduations and had to keep putting batteries in it the whole time and should I mention the pics it takes are not good no matter what settings you use. I managed to get a few good pics out of this camera but I am always saying how much I hate this camera...don't make the same mistake I did, you'll miss out on alot of memories if you buy this. I hope they stopped making this one. TWO THUMBS DOWN!", "Date": "December 13, 2012"}, {"Title": "LOVE THIS CAMERA!!", "Author": "Kayla", "ReviewID": "R3UE95AS1MHZ6R", "Overall": "5.0", "Content": "My husband bought me this camera 5 years ago, It still takes amazing photos. I love the fact of the material it's made of. It's not metal its almost a cloth feel. Very nice. Easy grip to it and if it gets dirty just take a damp cloth or a baby wipe and wipe one boom dirt is gone. I have always wanted a great working camera and one that fit my personality. THIS IS IT!! 5 years running and still a huge hit. LOVE IT. I would defiantly buy this camera again if mine ever broke. :D", "Date": "November 29, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Polaroid i835 8 MP 3x Optical/4x Digital Zoom Camera General Features: Green design\n1/2.5-inch CCD sensor 8.0 megapixel resolution 3x optical zoom 4x digital zoom 3.0-inch LCD\nJPEG (EXIF 2.2), DCF, DPOF, AVI image compression AVI video format PictBridge compatible\n32 MB built-in storage SD compatible for expanded memory (up to 4 GB, not included) USB interface\n1/1000 second - 1 second shutter speed", "Name": "Polaroid i835 8MP 3x Optical/4x Digital Zoom Camera (Green)", "ImgURL": "http://ecx.images-amazon.com/images/I/41rAS7-FbOL._SY300_.jpg", "ProductID": "B001L1JZCG"}}