{"Reviews": [{"Title": "lousy close ups", "Author": "Susan Baird \"suezme2\"", "ReviewID": "RASQN655MPG7M", "Overall": "2.0", "Content": "My first digital camera was a Casio Exilim Z4, which I loved.  It was very easy to use, took very crisp close-up (macro) photos and had a dock for re-charging.  Then, I dropped it.  So, I bought this Z9 and have been trying and trying to get some clean close-up detailed photos, but no luck.  For me, it's a waste of money and I will be looking for another camera.", "Date": "October 11, 2008"}, {"Title": "Pink!!!", "Author": "T. Joyner \"overseas orderer\"", "ReviewID": "RYRE5T2KRUDEH", "Overall": "5.0", "Content": "I LOVE THIS CAMERA!!!  It's pink, and it takes pictures!  I wish I had gotten it a long time ago. It is slim, and the pictures are of a good quality...just what I needed.  Why would I want 10 megapixels when I don't use this camera to make a living? Also, there aren't too many bells and whistles...very user friendly!!", "Date": "July 19, 2008"}, {"Title": "Great Compact Camera", "Author": "Janneke Bogyo \"janb\"", "ReviewID": "R1X4TO7VL8ZIQQ", "Overall": "5.0", "Content": "The most wonderful feature of this camera is its almost-total absence of that horrible lag time between the push of the shutter release and the actual taking of the photo!  For a change I don't miss those pictures of my grandchildren because a camera takes too long to actually take the desired shot! This camera is notable for that one feature alone but besides that, it is easy to take along in a pocket, has plenty of extra features and takes great pictures.  What more could I want in a camera!", "Date": "October 6, 2008"}, {"Title": "Not bad at all!", "Author": "Pheetoe", "ReviewID": "RVBTFYGB2WWDW", "Overall": "5.0", "Content": "I bought this camera for my little sister for Christmas last year and its been great, she loved it, pictures look great, its pink, which she loved. The camera's video mode was pretty good for what she regularly uses it so honestly i think it was a good purchase for a reasonable price at the time, i give it a 5 star since i asked if she still liked it today 1 year and 4 months after and she still likes it. c:", "Date": "June 25, 2010"}, {"Title": "do not buy this", "Author": "JMT \"JMT\"", "ReviewID": "R3AICTRA54DJ67", "Overall": "2.0", "Content": "a total waste of money. this camera takes terrible pictures. the one positive i found is that it has a fast flash. other than that, it is larger than the older model exilim. it has less features. it is a pretty color but then again, i would pay double for a brown camera if it took better pictures than this pink one. seriously, i could take better photos with a disposable film camera. i can't wait for this one to break so i can buy a different camera.", "Date": "April 7, 2010"}, {"Title": "Casio Exilim EX-Z9PK Review", "Author": "DG", "ReviewID": "R16B7O9RT6PMTI", "Overall": "4.0", "Content": "This little camera works very well for the price.  It has a wide screen for viewing and can zoom in or out very easily.  If you want a camera and don't want to spend too  much, order this one.  Make sure to go to Amazon so that you get the complete package for the price.  Other retailers on the web will try to scam you into paying separately for the battery, but J&R; Music World won't.  I purchased it from them through Amazon!", "Date": "May 3, 2009"}, {"Title": "Lens error", "Author": "R. Salas \"Sal\"", "ReviewID": "R2LXSQ8N2EEEC8", "Overall": "1.0", "Content": "Before you buy this item look up the lens error problem it keeps having dont waist your money on this camara", "Date": "January 14, 2009"}, {"Title": "casio best starter digital", "Author": "Lindy", "ReviewID": "R2EIBFJ51DCIHX", "Overall": "3.0", "Content": "This is excellent starter camera. gave it 3 stars instead of 5 because it doesn't have a dock in which to place the camer for download and recharge. having to extract the battery for recharge, and dealing with the inserting of cable into the camera for download is not only a pain, but seems to lend itself to breakage. I bought this for my aunt to get her into digital world, however she needs help with the downloading and recharging, as her fingers aren't as nimble as they used to be. my casio has a dock and i love it; don't know why all cameras don't have this feature. in closing, CASIO is simply excellent in my book....good quality for reasonable price, and ease of use. looking forward to their new version with higher zoom capacity....when the prices come down a little.", "Date": "September 13, 2008"}, {"Title": "Well..........", "Author": "M. Hartinger \"Serina.h\"", "ReviewID": "R39XWQ7VKC4T7M", "Overall": "3.0", "Content": "Well I think it is a great camara ecpecialy  if you like pink!!!!But ..... It is very fat I thougt it would be skinny cause of the amazonPictures but NO!!!! Also it has a takey red part on it to coverThe memory card slot. I love the best shot option whitch let's u choseWhat the pic will turn out like!! Also if u like zoom don't get this product!!!It has horribal zoom thanks for reading my truthful input hope it helps!! :)", "Date": "May 2, 2009"}, {"Title": "It's OK. Nothing to brag about.", "Author": "J. Mena", "ReviewID": "R7MT4MRJT3GD5", "Overall": "3.0", "Content": "I have had this camera for years (around 5). It has never done well in low-light and the zoom is lame. This has about the same megapixel as a smartphone. My friends always had sharper and clearer images than I did. I will say it is one tough cookie because it's been dropped countless times. Also, it's quick to focus. Maybe this is a good gift for a kid or pre-teen. I would suggest you save up and get something better.", "Date": "December 16, 2013"}, {"Title": "Great deal!", "Author": "Ken M.", "ReviewID": "R3I1D7VLT4WB23", "Overall": "4.0", "Content": "I'm a fan of casio and picked up a couple of these older units for my kids.  they are easy to use and take good photos", "Date": "October 8, 2013"}, {"Title": "Nice and pretty", "Author": "Tiko", "ReviewID": "RYE5SG4CUTFI7", "Overall": "5.0", "Content": "I have had this camera for more then 4 years and I love it. I love the color, it is so pretty. It is light and easy to wear around, just drop in your bag. Photos are decent and battery life is really good.", "Date": "November 24, 2012"}, {"Title": "Disappointed", "Author": "Mel", "ReviewID": "R1SSKUCIG2LKPA", "Overall": "2.0", "Content": "Purchased this camera to replace another Casio Exilim model. Totally disappointed. Camera a little bulkier than expected. Picture quality not as great. Zooming worsens picture quality (did not experience this with other model). Minor grievance - no black/white or sepia setting. Color of camera is true to picture, pretty good battery life, USB cable plugs allows direct transfer from camera to computer (fast transfer)", "Date": "November 20, 2010"}, {"Title": "Don't buy it just because it's pink", "Author": "C.W. Knits", "ReviewID": "R2PJ3Z6NOGN5AC", "Overall": "2.0", "Content": "My daughter wanted this for her birthday, probably because it is pink, but she said one of her friends had it and that it was great. Not so. The photo quality is lousy and the camera is inconsistent in how it functions. Sometimes it works, sometimes it doesn't.", "Date": "March 8, 2010"}, {"Title": "Just as described! New!", "Author": "Ashley Cox", "ReviewID": "R2F2PKH7ODD65V", "Overall": "5.0", "Content": "This company is great to work with! I have bought 2 cameras from them. Both items were shipped very fast. The first camera had a faulty battery so the company sent me a new one free of charge. The 2nd camera's auto focus was broken so I emailed them about it. It was about 2 months after I ordered it becuase I had just started using it. The company had me ship the camera back and offered to fix it free of charge. I will definltely order from this company in the future. Their customer service is amazing!", "Date": "January 21, 2010"}, {"Title": "overall a good camera", "Author": "Glenna D. Hill \"Hebron\"", "ReviewID": "R32TUH9GO75W9T", "Overall": "4.0", "Content": "The Exilim camera is an overall good camera,have not used it a great deal yet, I'm fixing to go on vaction and plan to use it much then. I have taken a few pictures of my brothers dogs and did get some red eye; I may have had too much light; I did not have this problem when taking pictures of my family members. I did go in and adjust the red eye reduction on the camera and have since taken a couple of more pictures of the dogs, but have not checked on my computer if they still have some red eye. It does appear after making the picture bigger that there could still be some red eye. I hope not because this is a big minus in picture turn outs. The rest of the camera I am happy with, it's user friendly and I think it will be a great first digital; I'm just hoping that I can figure out the correct lighting when taking pictures as this may have something to also do with the red eye that I'm coming up with. I would suggest buying this camera to others, especially if it is a first time digital.", "Date": "October 14, 2008"}, {"Title": "Disappoint with this new one.", "Author": "X. Chen", "ReviewID": "R3B09XNV9RERAH", "Overall": "1.0", "Content": "I had old one with difference model for couple years. I was happy with it. After I loss it in the trip, I brought this new model. The new one is bigger than old one. Battery is not comparable with old one too. The new Camera was broken in just one month.", "Date": "April 27, 2009"}, {"Title": "Good camera at a good price", "Author": "Mrs. JSE", "ReviewID": "R2ZY5TFRV7Q3JT", "Overall": "4.0", "Content": "I bought this camera for my little sister who is a senior in high school. She loves it. It takes good, clear pictures, and is small enough for her to take anywhere.", "Date": "February 22, 2009"}, {"Title": "Good buy", "Author": "Janice L Cody \"GrannyJanny\"", "ReviewID": "RLCAIJRO0W2NT", "Overall": "5.0", "Content": "This is an excellent camera.  Great features and terrific picture quality.  Nice size.  The price was wonderful, the shipping time was fantastic and free. I would definitely recommend this camera.", "Date": "January 12, 2009"}, {"Title": "8.1 Mp Digital Camera Review", "Author": "A. Mason", "ReviewID": "R2NVH2KSDV46FC", "Overall": "5.0", "Content": "Shipping was really really quick & the product was in perfect condition.  We are very happy w/the camera.", "Date": "August 15, 2008"}, {"Title": "Good product for the price", "Author": "D. Miller", "ReviewID": "R1OXDTDECWP09F", "Overall": "5.0", "Content": "This is a good basic camera.  If the photographer in your life is a point and shoot person.  It makes a good product.  Not too many features to cause confusion.", "Date": "January 4, 2011"}, {"Title": "Confusing Features, bad pic quality, dies easily", "Author": "Naoki9 \"Naoki\"", "ReviewID": "R3G4AZD6R2MM66", "Overall": "2.0", "Content": "I bought this camera after owning a canon for 5 years. Canon is the absolute best. Everything else pales in comparison. Canon's are durable adn worth the money. Casio's are cheap flimsy and just poorly made.The digital camera market is shady. You end up paying about $30 more for the card, charger (which you may lose), time spent on figuring out how to get your pictures off the card and just the overall headache of working a camera.Yes, I am bitter I spent so much money on the Casio. Maybe after a couple more months it will grow on me.", "Date": "November 27, 2009"}, {"Title": "Great camera for the price.", "Author": "Martha B. Spencer \"Bookish woman\"", "ReviewID": "ROS2PKLDC9D2G", "Overall": "5.0", "Content": "I am completely pleased with this camera. Still figuring out some of its features, but really like all the settings for different kinds of shots. The quality of the photos is great.", "Date": "April 21, 2009"}, {"Title": "Great service but lame camera.", "Author": "Patrick James Moore \"Patrick Moore\"", "ReviewID": "R33I1KJBI2H3K8", "Overall": "3.0", "Content": "Ordered this camera for my GFs sister and it shipped very fast. Only thing is that the battery won't stay charged and the camera freezes when you go to record a video. Not the sellers fault just a bad job by the company.", "Date": "September 18, 2008"}, {"Title": "beware of return penalty", "Author": "Brenda K. Bowen \"BKB\"", "ReviewID": "R2YB8N3GLGWGPG", "Overall": "2.0", "Content": "Buyer beware I ordered this camera based on the reviews however, I found the camera to be less user friendly than the Pentax camera I previously owned. I decided to return the camera but after talking with customer service found that it would cost me $29.00. $20.00 toward restocking and $9.00 to ship my 1pd camera. now I agree the return cost should be mine but give me a break 6ave is just trying to make certain the consumer will keep the camera based on the financial penalty if what your purchase doesn't fit your needs. I'd go through someone else unless your 100% sure of your purchase.", "Date": "November 11, 2008"}, {"Title": "rockstar", "Author": "Amazon Customer", "ReviewID": "R72P3AO054TCL", "Overall": "4.0", "Content": "Love it, great for what I need.Great pictures and small enough to fit in a clutch purse.Very easy to use.", "Date": "October 23, 2008"}], "ProductInfo": {"Price": "$159.99", "Features": "8mp with 3x zoom\nFace Detection\nYou Tube ready\nBest Shot modes", "Name": "Casio Exilim EX-Z9PK 8MP 3x Zoom 2.6-Inch LCD Screen Digital Camera (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/51tzo6zbWmL._SY300_.jpg", "ProductID": "B0014V0VOY"}}