{"Reviews": [{"Title": "A happy suprise", "Author": "Huang-san Wang \"Sundye\"", "ReviewID": "R3CUBLIYDUDVPV", "Overall": "5.0", "Content": "While I am having Nikon SLR D200 for sophisticated situations, the Panasonic Lumix TZ1 used to be an excellent gear for my \"point and shoot\" purposes. I have been happy in every aspect except that it is little bit too bulky to carry around to meet instant shooting needs.I have been looking around for its replacement. I require that it should be thin and light for easy carrying on my waist belt, in addition to other requirements such as fine picture quality, a big optical zoom magnification,  a good movie option, plus price considerations.During my recent trip to Tokyo, I paid a visit to Yodobashi Camera, the largest camera department store in Japan. There I came across with Ricoh R8. I was very impressed with its 10 mega pixels, 7.1x optical magnification, super 1cm closeup photos, its lightness in weight, and its stylish product design. Putting together, it outperforms its rivals including big brands such as Canon, Nikon, Olympus, Sony, Casio and Panasonic.  My observation was later confirmed by the sales attendant that it was indeed the best selling item of the same category there in Yodobashi Camera.Having played with this camera for two weeks since then, I have been very happy with it. I find it is easy to operate, vibration resistant. It produces fine quality pictures, indoor or outdoor, portraits or close-ups. Picture taking of moving objects? I did not have chance to observe. The response time in the Macro mode is bit too slow, but acceptable in view of the price.It is interesting to add some side points. While we were traveling around in Tokyo, having her hands on my new Ricoh toy, my wife quitted taking pictures with her Nikon Coolpix S4 which has been in use over two years. Besides, my daughter, an industrial designer in Chicago, has good comments on the pictures I took. More than that, she borrowed my Ricoh R8 to take close up pictures of her jewel designs that she is preparing for an art show. She has been surprised with the pictures such a compact camera can give.", "Date": "August 15, 2008"}, {"Title": "This is a nice camera", "Author": "Michelle M. Ress \"safoocat\"", "ReviewID": "R1V7VSN6MCWY39", "Overall": "5.0", "Content": "The Ricoh R8 is a fine camera. It doesn't have the highest zoom, just 7X, but does it ever have a nice macro mode.With the trimming feature you can really get some nice close ups. The battery life is decent, it uses an SD card, andthe LCD is magnificant. It is also small enough to fit in your pocket. I found the flash adequate as well. I would highlyrecommend this camera.It does three kinds of bracketing, exposure, white balance, and color mode ie black and white, color, sepia. So it can be used for HDR photography.It also has a retro look to it, very boxy about the size of a pack of cigarettes, quite solid feel and made of metal. The control button has a nice snap to it. It can be held with one hand for taking pictures. The camera comes in black or silver.What could be better is the SD card slot could be on the side so you don't have to take it off the tripod to access the cardand if the tripod mount is screwed in all the way it turns the power off but that is easy to avoid by using the tripod tightening nut. All and all it's one of the best cameras and has replaced my Casio Ex-Z750 which I used for years.Recommended. 9/10/12", "Date": "September 10, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0015Z5P86"}}