{"Reviews": [{"Title": "Super duper!", "Author": "Nse Ette", "ReviewID": "R2B70XYTPHK2C4", "Overall": "5.0", "Content": "I'm amazed there hasn't yet been a customer review on this amazing gadget. The Z200fd is the latest in the Z series from Fujifilm. I've owned the Z1, Z3, and Z10, and first thing I noticed on holding this is that it's heavier. This is due to the more expensive looking and feeling finish; shiny black enamel-like finish to the front, and stainless steel back, which makes me realize now just how cheap the plastic Z10 felt. As ever, the design is eye catching, and the camera is incredibly miniscule for the hefty punch it packs, smaller than a 160gb iPod (though a bit thicker). The Kate Moss of digicams. :-)Powering on is still by sliding back the front panel, though this time it is done diagonally. Now while this may look fancy (which it is), I find it also makes it more difficult to accidentally turn the camera on while putting it in ones pocket or bag, something I found out rather painfully with the Z10 when I whipped it out at a dinner party to find the battery was totally drained as the cover panel had slid open when I put it in my pocket. The \"Z\" symbol in front lights up (nice and Star Trekky) for a few seconds and also serves as a countdown timer (for self timed photos) by flashing until the photo is taken.The major attractions for me were the larger pixels; 10 megapixels (my 1gb XD card takes 207 shots at full resolution or 18 minute movie clips at 30 frames per second at a resolution of 640x480. You can get more images in, or longer movie times by lowering the resolution), the larger, very crisp toughened scratch resistant 2.7\" LCD (on which you can preview 4, 9 or up to a hundred images in a 10x10 arrangement, or images as a slideshow), and the larger optical zoom reach of 5x (as with all others in the Z series, the zoom lens is non-extending) which is also wide angle (No more stepping away from the subject and landing in the pond behind :-)).The rear (made up almost entirely of the 2.7\" LCD) reverts to just one wheel (the 2 wheels on the Z10 confused me from time to time) which scrolls, as well as clicks up, down, left or right, through easy to follow menus or images, as well as zoom button, and the menu/playback button.The camera takes XD and SDHC memory cards, and additionally has 52mb internal memory (good for 10 images at full resolution). Images can be stored in folders; My pictures, Family, Travel, Events, Favorites, as well as a folder that can be password protected, keeping safe those your torrid shots. Battery life is excellent (about 200 shots per charge), I almost always forget I need to re-charge the battery.Now, onto image quality, what it was built to do. Incredible! Especially in low light conditions; dinners, outdoors at night, etc. There are various photo modes (I noticed there's a new one for underwater shots, hmm!) flash and ISO settings to twiddle with, though not enough for you if one is a pro. Good enough for me, especially the face detection/automatic red eye removal (this now gets a separate button atop, beside the shutter button) which basically takes the photo for you. I still wish there was a separate button though enabling one to switch from still to movie mode.  As it is, one has to go through the menu to access that.You can edit photos too; clip, rotate, reduce to blog size (convenient for emails as file sizes at maximum resolution is close to 5mb) and even send or receive images with other IR enabled cameras by infra red. I tried it with my PC (which is IR enabled) and it didn't work though, shame!There's an AV cable to connect to your TV to view images or movie clips (it uses the same port as the USB and has a nice little cover for the port on the side), and as ever, the Finepix software is first class. Photos up to A3 size can be printed in crystal clear resolution.This camera will not please those who are used to extensive manual settings and loads of tinkering with ISO levels, white balance, and other photographic jargon, but if you're like me, and just want to be able to whip out your camera, and without much fuss, capture the moment, this camera is for you.  Super!", "Date": "December 2, 2008"}, {"Title": "Great Camera!", "Author": "TLH", "ReviewID": "R1L4MNSM46RAFR", "Overall": "5.0", "Content": "I am what you call a \"technology idiot\" so if I can use this camera and figure out the features, anyone can. I am so pleased with this camera. I love the sleak look. It's light and easy to pull out and turn on for fast pictures. I love the features and how easy it is to use. I only have a few complaints... the black smudges easily and gets fingerprints on it rather quickly, so I'm forever wiping it clean. The other complaint/problem I've been having (but maybe because I'm a techno idiot, I can't figure it out) but everytime I upload pics, I only want to upload the new pics, but for some reason, (I checked the settings over and over again) ALL the pics upload... and I don't like that because at 10m, it takes a while... But overall, I'm pleased. I did my research, and was skeptical because it's a new product, but I would recommend this camera to anyone...", "Date": "March 6, 2009"}, {"Title": "Love this camera", "Author": "Matt", "ReviewID": "R1X6678AN0AX30", "Overall": "5.0", "Content": "This is my fourth Fuju digital camera and my third \"Z\" camera.  I love this camera.  I purchased this to take photos I can enlarge and have printed several 16\" by 20\" prints that look great.  I like available light indoor pictures for a more natural look and this camera's dual anti-shake feature makes it possible to take clear pictures indoors without a flash.  I have made several videos that look great also.  The camera is a great size and a beautiful deisgn.  My favorite camera ever, by far.  I recommend this camera 110%.", "Date": "December 29, 2008"}, {"Title": "Fujifilm FinePiz Z200fd is the BEST", "Author": "Yu J. Choi \"YuJin Choi\"", "ReviewID": "R2VAKLQ26HD694", "Overall": "5.0", "Content": "I used to own a Sony Cybershot and it broke in a year.. I take photos every day literally and I guess it couldn't stand that much usage? Anyways, I wasn't happy with it..But I read some reviews on Amazon about Fujifilm and I bought this camera..First of all, I hate pink. It reminds me of Paris Hilton andsocialite drama-ness.. BUT, this pink is classy. I like it A LOT.Second of all, the camera focuses SOO WELL! It focuses SO well even inside in the dark! The face recognition is also terrific! My sony cybershot didn't focus at all inside buildings, so I was VERY pleasantly surprised..Third of all, the video quality is SOO great.. I payed half the price I paid for Sony, yet the video quality is better and the sound is too!Fourth of all, it is just so little and compact. and the slider cover is just so cute.. i like that it goes diagonally..The pictures taken in the dark can have some blue noise (if you zoom in a lot on your computer), but it compensates by focusing extra well!But when you're outside, it's SOOO pretty! The colors are so vibrant.Actually, I recently took pictures of fireworks and, even though it was in the dark of the night, the fireworks came out so crisp and clear! so pretty...Overall, I really LOVE this camera... LOVE LOVE LOVE!!", "Date": "July 9, 2009"}, {"Title": "Gorgeous pictures, high quality product", "Author": "AZ Guy", "ReviewID": "R2RUEP0QO026TA", "Overall": "5.0", "Content": "I have a Fuji S5200 which I couldn't be more pleased with but wanted a camera that I could slip into my pocket, keep in the car or throw into my computer bag on business trips.  I've owned the Z200fd for a little over 8 months now.  I have used it in so many conditions: snow, rain, bright sun light, at the beach, in the desert, on a lake, landscapes, parties, concerts, fireworks, museums and for auction sites.The Fuji Film quality is unmatched.  I've had film developers tell me that they rarely see such clear, high quality pictures.  I've added a couple of pictures I took at a concert to a band's blog and they now use them on their website.  Most of my friends ask to use my camera when taking photos at parties even though many people have a camera because of the quality of the pictures.  I work for a Fortune 100 company and a couple of my pictures have been blown up to 18x24 and framed outside of our main customer conference room because of the crystal clear quality.  Again, these were photos taken with the Z200fd and not with the entry level pro model S5200.Fuji cameras come with software and a USB connector that make uploading simple.  You can buy a mini tripod that screws into to bottom of this camera and make this your camera of choice for every occasion.  The camera comes with multiple settings for many of the situations I described above so you don't have to worry about aperture or low-light/backlight situations.  It is very easy to use for the novice and a handy alternative for the pro.", "Date": "August 17, 2009"}, {"Title": "Great pocketable point-and-shoot!", "Author": "Keitheaux", "ReviewID": "R1KITNQEFG32RT", "Overall": "4.0", "Content": "I recently bought the Fuji Z200fd to replace a defective and poorly designed Canon A480 which I returned to Amazon. I'm very happy with my Fuji! It's small and thin but feels heavy and well constructed. Battery life has been excellent, and you can buy a spare battery for it for less than $30, but I've never found a need to do so.  I like the fact that it doesn't etend it's lense outside of the camera body, which makes it less likely to catch on anything or be damaged. The lens cover slides diagonally across the front to power it on, making it less likely that you will turn it on accidentally putting it in your pocket or a case. It takes both XD & SD cards which is a plus if you have some of the XD cards around from an older Fuji. Takes very good pictures and has a number of special shooting modes. Menus are a little complicated at first, but you learn them the more you use the camera. Doesn't have an optical veiwfinder, but the LCD has worked well for me. Great little camera!", "Date": "September 22, 2009"}, {"Title": "Excellant camera, compact but takes great pictures.", "Author": "CA Guy \"Cameraguy\"", "ReviewID": "R178QBJ4W2RHHU", "Overall": "5.0", "Content": "Excellant camera, compact but takes great pictures.  The only problem we have had is that it is somewhat difficult to use in bright sunlight as there is not a 'viewfinder'.  All in all we are very happy with the camera", "Date": "August 21, 2009"}, {"Title": "good product", "Author": "Wei Yao", "ReviewID": "R17YUE7AR37GPK", "Overall": "5.0", "Content": "Good color and pictures, but it is not so good when take short distance photos. Overall it is a good product worth what you pay.", "Date": "February 20, 2009"}, {"Title": "Amazing Camera, Super pictures in Low Light", "Author": "Sujit Kumar Mahapatra \"Sujit\"", "ReviewID": "R1LM29EZRM9HK3", "Overall": "5.0", "Content": "I loved this camera. It takes great pictures in low light without flash. I was surprised at how good the picture was without flash. I have used many difital cameras in past, none of this quality.Pros:1) Amazin picture quality in low light2) Many mode selection such as Party, Snow, Underwater (Needs a waterproof cover), Museum etc Which are not there in many leading brands3) Amazing video quality4) 5x Optical zoom with image stabilization5) The shutter to switch the camera on/off is kind of kool.6) Ability to take 2 pictures consecutively with/without flash. Shows both of them side by side to compare. .. And Many more.Cons:1) Bit tricky to operate the controls and change the settings. Need to get used to it.2) Not very fast in taking simultaneous pictures. need to wait a little longer.3) It's MSRP.Overall A Great camera worth buying.", "Date": "March 16, 2011"}, {"Title": "Good, not great.", "Author": "romance lover", "ReviewID": "RQHYBRKK76O3J", "Overall": "4.0", "Content": "I've had this camera for about a year and a half now. I use it a lot and have explored many of the different features it has.Pros:the color is gorgeous! I'm obsessed with pink so I was happy to find such a lovely color in a camera.The build is very sturdy feeling- though my husband DID manage to put a small dent in the front metal cover somehow! So, looks impervious, but it's not.I love how it turns on. Just slide over the front cover and it's ready to go in a few seconds. This is a great feature- Just make sure it's on the photo-mode 'party, outdoors, etc) that you want beforehand.I like museum mode. It mutes the camera, and turns off the flash. And that's come in handy. ('forbidden' pictures in European cathedrals, anyone?)The battery life is good, and it charges fairly quickly. You do have to take out the battery to charge it though.The size is great. I have the case for it too, which is nice.Cons:The picture quality is less than perfect I've found. This is a 10mp camera- the pix should be gorgeous- yet I've never found them to be so. They mostly look good, and produce nice prints, but I've not been very impressed.Focus- Many of the pictures I take look good in the LCD, and when i put them on my computer, they actually look blurry. Many times I have to take 2-3 pictures of the same thing b/c they keep coming out unfocused. I'm not a professional but I flatter myself that I can take a decent photo, standing still! This is probably my biggest complaint with this camera.Couples timer doesn't seem to work so well- it jumps the gun everytime I try it. I like the 10 second timer instead.still haven't figured out how the facial recognition feature benefits me.It's a pain in the [...] to cycle around the menu and pick the picture mode you want. It wastes time and you could miss pictures.The video quality isn't so great and the microphone doesn't sound sterling.The Fuji photo software it comes with is pretty much useless.it is SO EASY to put your finger over the lens when using this. Other people using your camera will also do this, being less aware of it than you are.All in all, you will get compliments on the camera, it has nice features and lots of photo-modes, but at the end of the day, the pictures look less than perfect.", "Date": "December 6, 2010"}, {"Title": "Cute camera, nice features, bad quality", "Author": "Razzberry", "ReviewID": "R38OE8M7PL6T52", "Overall": "3.0", "Content": "The size of this camera is great, especially for girls who doesn't wanna carry a big camera.I love that the camera has a feature which takes two pictures at once, one with flash, one without flash.But the quality of the pictures is pretty disappointing.It was good for a while, but I'm looking to get a better camera.", "Date": "November 23, 2010"}, {"Title": "Excellent design, terrible images", "Author": "Kenan", "ReviewID": "R1JN1G6SP305JX", "Overall": "2.0", "Content": "I gave this to my younger brother after the dissappointment..I expected a lot from this camera..Design and everything are perfect, but when it's come to the image quality, it's not very successful..If you're under the sun, pictures are okay, but if there's low light or indoors with flash, terrible..I'll buy Fuji only with a high quality sensor like EXR..", "Date": "August 2, 2010"}, {"Title": "Beautiful", "Author": "Nic", "ReviewID": "R2CR4PJFWNO8H3", "Overall": "4.0", "Content": "My cannon elph stopped functioning after using it in the snow and I replaced it with this one. Honestly, the cannon pics were better in quality, but not too much better. This one looks great and takes decent pics so I'm happy.", "Date": "July 29, 2010"}, {"Title": "LOVE the PINK!", "Author": "G. Matsusaki", "ReviewID": "R3N8IBZGM3KGUP", "Overall": "5.0", "Content": "I am a FUJI fan.  Saw this PINK and just had to have it.  It has a nice big viewing screen, pics come out nice. I just take pics for family and friends, nothing professional, so this is great for me.", "Date": "April 6, 2010"}, {"Title": "Poor Construction", "Author": "C. Tran", "ReviewID": "R39M564OE1286U", "Overall": "2.0", "Content": "Ok,when I got this camera, I was super excited about it's sleek design...loved how you just slide the cover off to turn this on.  I have had it almost 1 year when you day, my husband takes the camera to take a picture of our son in the snow.  He goes to slide the cover off and it slid right off!  We couldn't get it back on, like some sort of magnetic part was not holding it anymore or something.  I called Fuji and was told to send it in with the date and proof of purchase since it was a few days shy of the 1 year warranty.  I just checked on the status of the camera and Fuji wants $50 to repair the cover and I was told by the customer rep that this was not covered under \"manufacturer's warranty\".  I asked her if that was not covered under the warranty than what was? She told me that only electrical components were covered.  I argued with her that there is obviously some sort of manufacturer defect in the product since the lens cover just slid right off.  I was basically told that there is a charge to fix the cover and that's that.  I asked her that if this same thing happened after I had only had the camera week, would Fuji still not honor the warranty and she said \"yes, I would still have to pay for it even if I had only had it for a week.\"  What kind of customer service is this???? I asked to be forwarded to her supervisor and just shot off and email to him...let's see what the response is....I will update later.  But honestly, if this the the kind of customer service that you get from Fuji, I would not buy another one of their product.", "Date": "March 15, 2010"}, {"Title": "GREAT", "Author": "Holly Ann Monday \"Happy family\"", "ReviewID": "R1PRSMA9HCPDNF", "Overall": "5.0", "Content": "I love this Camera! It has a long lasting battery and it's easy to use...The pictures turn out wonderful!!!", "Date": "February 23, 2009"}, {"Title": "very pretty, easy to use", "Author": "badkat \"badkat\"", "ReviewID": "R3Q428HQEEERRJ", "Overall": "5.0", "Content": "its nice to look at, and its nice to see what it does. they really went above and beyond with this one, i will write another review when i have more experience with it, but it is really nice, and so far, i like it A LOT.", "Date": "September 29, 2009"}, {"Title": "Fine camera", "Author": "R. Luebbe", "ReviewID": "R2LWEG2OIILE2L", "Overall": "5.0", "Content": "This product is true Fuji.  Love the color of the picture, it's settings and the ease of use.", "Date": "January 12, 2009"}, {"Title": "Don't waste your money!!", "Author": "Proud Mommy", "ReviewID": "RD4GH0EBZKDJV", "Overall": "1.0", "Content": "When I first received this camera I hated it because it has no option to put the date on pictures. Also when you take a picture with camera held sideways you have to manually flip it right side up (waste of time but not a huge deal.) I got over that and tried to like it. Overall it is cute and somewhat easy to use. After having it over six months now I am looking for another camera. Pictures on this are horrible (grainy, blurry, ect.) You sometimes have to retake a shot five times before you get a somewhat decent looking picture. Usually I just give up because it is too hard to have the kids cooperate that long. I wish I would have listened to my husband and spent the extra money on a Nikon or Cannon but.....even my old Kodaks were way better than this piece of junk.", "Date": "July 6, 2009"}, {"Title": "what a bad camera", "Author": "Mar \"Marinera\"", "ReviewID": "R38DXXH8P6EXT1", "Overall": "1.0", "Content": "this is one of the wroste cameras i ever had ! dont buy this camera the pictures are really really bad not even colorfull pictures out doors .", "Date": "March 15, 2009"}], "ProductInfo": {"Price": "$399.95", "Features": "10-megapixel sensor captures enough detail for photo-quality 18 x 24-inch prints\nWide-angle 5x optical zoom lens; 2.7-inch LCD display\nFace Detection optimizes focus/exposure for up to 10 faces; Dual Image Stabilization for blur-free pictures\nWirelessly transfer images to IrSimple-equipped devices, including other digital cameras\nStores images on xD or SD memory cards (not included); powered by lithium-ion battery (battery included)", "Name": "Fujifilm FinePix Z200fd 10MP Digital Camera with 5x Optical Dual Image Stabilized Zoom (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Kr7UUhoaL._SX300_.jpg", "ProductID": "B001D0G578"}}