{"Reviews": [{"Title": "Pro photographer loves it", "Author": "Richard S. Lee", "ReviewID": "R13ON67BJ24QYU", "Overall": "5.0", "Content": "I'm a professional photographer and I've owned a Fuji F10, F30, F50 and now the F100. The F50 was the only dog of that group. The F100 I feel has just as good low-light performance as my beloved F30 but with twice the resolution. You can look at my blog at [...] and click on the \"Produce\" tag and see that weeks #122 and up are shot with the F100 at ISO800. The color and sharpness are stunning. With the F30, I always had the camera set on minus 1/3 or 2/3 stops to avoid overexposure. I think that problem is solved on the F100. I love the extra wide-angle we have now. That really extends the usefulness of the camera.As for the pink banding problem... I really don't want to start calling people names, but honestly, I've always found that there will be a group of people who approach photography from an \"engineering\" standpoint rather than an artistic one. We need the technical nerds to do tests and such, but I've never seen this problem show up in a real-world photo. I've seen a lot of stunning photos by some good photographers done with this camera and none of them suffered because of this problem.", "Date": "April 26, 2008"}, {"Title": "Much better than I initially expected", "Author": "Ray E", "ReviewID": "RSV2Q1GLIUIKL", "Overall": "4.0", "Content": "Let me say right off the bat that I'm an owner of a previous F-series camera, the F31fd.  I love that camera but I wanted the image stabilization and the wider wide-angle, which the F31 doesn't have.When I first opened the box and tried out a few dozen shots, I was disappointed.  Using the F100 as I had used the F31, I thought the results weren't as good.  I wasn't used to the new controls, I missed the Manual-Aperture-Shutter- priority and the top-mounted Mode dial.  (By the way I haven't encountered the purple band issue.)But after several weeks I've changed my mind.  The lens is sharper, the zoom is greater (on both ends), the response is just as quick, and I'm finally accustomed to the new rotating 4-way control.  I never use Scene Modes, but the new Portrait Enhancer is awesome.If you're new to Fujifilm pocket cameras, you will LOVE the F100.  If you're like me and you previously owned an F31, I say give the F100 a chance.Hints for those who owned the F31:* in bright contrasty daytime shots the F100 underexposes where the F31 overexposed.  Use \"Spot\" metering in bright daylight on the F100 and your problems are solved.* Sunny shots seem a touch more bluish on the F100 than the F31.  Use \"chrome\" or even better, set White Balance to \"shade\".  Works great.* again in low-light shots, the F100 exposes more accurately where the F31 overexposed.  Forget Exposure Compensation, use plain ole AUTO mode (yes!) on the F100, it works fine.* Miss the Manual mode for very dim lighting?  Use \"Night\" mode, it now works automatically all the way down to 4 or 8 full seconds.* With the new 4-way control on the F100, does the Menu-within-a-Menu annoy you?  Easy fix: just HOLD DOWN the OK button longer and you jump straight to the inner Menu.  (This is not in the manual!)", "Date": "May 28, 2008"}, {"Title": "Designed by committee", "Author": "Doctor.Generosity", "ReviewID": "R2N438D81ICGY4", "Overall": "3.0", "Content": "I bought this because I hoped it would be an upgrade from my favorite digital camera, the Fujifilm F30. Unfortunately, it is not better overall.The F30, which is out of production, developed something of a cult following in techno-nurd circles because it had the incredible sensitivity of ISO 3200 with low noise (speckle). Fuji accomplished this with their \"Super CCD\" using hexagonally packed, larger sensors for greater fill factor and the ability to capture lower light intensities. (CCD photodiodes typically operate pretty close to the quantum limit of efficiency, so there is no possible improvement except by larger pixels.) The technology was brilliant but worked well only up to about 6 megapixels for the small chip size used in pocket cameras. Unfortunately Fuji's marketing people were not as imaginative as their semiconductor team and did not know how to persuade the buying public that dim light image quality is more valuable to the average photographer than pixel count - which it is.  Caving in to the pixel race, later Fuji F cameras had more but smaller pixels, giving up the extreme low noise, low light capabilities. As a result used F30's sell at high prices on eBay.Now comes the F100, which Fuji advertises as the pocket camera to end all pocket cameras, state of the art in every way, and which is supposed to extend the low light theme to 12MP, offering ISO 3200 for full resolution and up to an astounding ISO 12,800 with pixels reduced to 3MP.So, how does it work? I've just spent the better part of a spring day comparing the F100 images directly with my F30 under various conditions.Unfortunately, no, they did not manage to repeal the laws of physics. At ISO 3200, the 12MP F100 with its necessarily smaller pixels gives rougher images than my 6MP F30.  And as for the ISO 12,800; forget it, it's a gimmick. The images are so rough as to be useless. This irritated me; borders on deceptive advertising.The higher pixel count does stand up better to higher magnification or cropping. In good light where it is possible to use ISO 200, the F100 gives wonderful photos which can be cropped or blown up significantly more. But for the unique higher ISO range for which people look to Fuji, the F100 is actually a bit worse in image quality. Disappointing.Otherwise, the F100 gives the impression of a pile of disconnected features There are worthwhile features in the F100 over the F30; one is the wide angle lens, the equivalent of 28mm, uncommon on pocket cameras; another is active image stabilization which allows slower shutters. Also F100 accepts SD memory cards whereas the F30 only took oddball proprietary xD's. In my tests however, the benefit of the Wide Dynamic Range feature seemed hard to discern. The battery seems to discharge pretty quickly. The nice aluminum case of the F30 has been replaced with Chinese plastic. (By the way, I read about a \"pink banding\" problem with the F100 but did not observe this.)Otherwise, some of the annoyances of the F30 remain; a strange USB connector which won't work with your non-Fuji cables. The movie mode, for me one of the really cool features of a pocket camera, has not been improved at all; it is still not possible to zoom the lens while capturing a movie. The zoom itself is too hard to control, always overshooting one way or another - Hey guys, what would be wrong with a simple manual ring to zoom the lens?Most Japanese cameras and all Fujifilm cameras including this one are marred by byzantine, obscure, hard to remember menu systems, packed with a plethora of \"scene modes\" certain to be ignored by the type of user who would buy an advanced digicam in the first place. They serve no purpose except to clutter things up. The other day in a store I saw a digicam that boasted of \"Fifty Scene Modes!\"  Fifty?? Hey folks, what happened to the idea of a POINT AND SHOOT camera??Overall, I admire Fujifilm which is one of the world's premier imaging technology companies. But as with many large corporations, its products are designed by uneven committees; brilliant CCD people, me-too market people, and an interface team who muck things up based on false assumptions. Companies which produce really great products, like Apple, do so because one person with excellent design sense governs the whole development.Bottom line: I was disappointed because the F100 was not a clear advance over my two year old F30. It does have a nice wide angle lens, and if you don't mind the high price you may love it. In good light the photos are superb. But overall it does not give the sense of a well integrated product. Once the dim light capabilities are compromised, the F100 is just another camera which competes with many others.", "Date": "May 4, 2008"}, {"Title": "A very good pocketable compact camera", "Author": "E. Lee", "ReviewID": "R1UPYEV2NDE1M", "Overall": "4.0", "Content": "I think overall this is one of the better compact digital cameras (that is pocketable) in its class. Other cameras that I would consider in this class are: Panasonic TZ5 and Canon SD870IS.OK, first of all, the issue of pink banding. Out of 200+ test images that I made, I noticed 2 of them have minor pink banding, and these are shot at ISO1600. I am guessing some batches of F100fd do exhibit this problem worse than others. I've seen samples on the web where pink banding is obvious even on ISO400 and ISO800. On my ISO400 and ISO800 samples, which I took in various low lighting conditions (outdoor dusk, indoor incandescent lighting, indoor daytime in dark room), there is no noticeable pink banding. Fujifilm will release a firmware in May 08 to fix this issue, so this could end up as a non-issue in the future. For me, pink banding is not an issue since I will never use ISO1600. And I only print less than 0.01% of all my pictures, I can crop the pink banding out if necessary.I think F100fd is a moderate improvement over F50fd. With F50fd, ISO800 has too much noise. But with F100fd, ISO800 is quite usable. In fact, I think F100fd might have the best low light performance in its class. F100fd also has a very good edge-to-edge sharpness performance in wide angle.While I think F100fd is overall a very good compact camera, no camera is perfect. Here are some of its weaknesses:- Overpriced. I think $299 is the fair price for this camera.- No manual control (A/S mode). F50fd has it.- No flash compensation. To be fair, not many compacts have it either.- No Auto Exposure Bracketing. Panasonic TZ5 has it.- No histogram. Useful to check over/under exposure.- 5x zoom vs TZ5's 10x zoom.- Controls are not user friendly.- Short battery life. F30/F31 can shoot more than 500 pictures with one charge.- LCD screen size. Panasonic TZ5 has a 3\" and 400k resolution screen.- Pink banding? Unless Fujifilm can fix it 100% with new firmware.UPDATE:After two weeks of use, here're more observations:- 300+ shots in one charge (about 30 shots or less using flash).- Generally fast auto focus performance, unless in low light which sometimes it hunts a little bit.- Zooming in and out is too fast, almost have to try a few times to get to the desired zoom distance.- Acceptable LCD performance in daylight, at noon, the LCD is still visible, so framing under bright daylight should not be a problem.- Shot to shot time is respectable, generally about 1 to 2 second. But if flash is used, it could go up to 3 to 4 seconds.I was contemplating getting the Panasonic TZ5 due to its superior features, but I think for now I am sticking to F100fd, and wait for the next TZ6 or TZ7. Panasonic has been improving the TZ series, so the next TZ could be a great one.", "Date": "April 25, 2008"}, {"Title": "Overall, impressive", "Author": "kakistocracy \"kakistocracy\"", "ReviewID": "RTNDJD9XBE4WQ", "Overall": "4.0", "Content": "I tested the F100fd I received through Amazon for the pink banding problem described by the previous reviewer, and it does not appear to have that problem.Also, I compared shots with this camera in moderate daylight to my Canon SD950 (both are 12MP and similar in size). I shot the same scenes at ISO100 (ISO80 on the Canon) and at ISO400. In terms of noise levels, the results were practically identical. The automated exposures and color turned out to be quite similar as well. At ISO400 on these cameras, fine details and textures are largely blurred out relative to the lowest settings, which produce a very fine-grained noise. I would tend to avoid using ISO settings beyond 400 on these cameras.Before receiving this camera I was concerned that the very useful 5x lens zoom range (28mm-140mm) might be compromised by distortion and softness, but the results are impressive for a camera of these dimensions. Over the middle range, the sharpness was slightly better than that of the SD950 (zoom range 36mm-133mm), especially near the frame edges.Recently, Canon released a 5x zoom model (SD890IS) with the relatively less useful range of (35mm-180mm). It has a 10MP sensor of smaller dimensions (1/2.5\" vs 1/1.6\").On the basis of my (so far, very limited) experience with this camera, I would rate it one of the best in its category. The minus one star is for the lack of manual shutter/aperture controls (available on the F50, F30 and other earlier Finepix models) and for apparently not controlling noise any better than Canon at ISO levels up to 400.", "Date": "April 9, 2008"}, {"Title": "Great picture quality, but just too slow", "Author": "S. Chung", "ReviewID": "R1H5444AKVEMD9", "Overall": "4.0", "Content": "I assume anyone who's reading this review already has looked at the specs, so I won't regurgitate them. I did a lot of research and finally settled on a top 3 list of point-and-shoot cameras in August 2008, which were the Fujifilm F100fd, Canon SD770-IS, and the Panasonic TZ5.My main criteria were:1. Picture quality2. Low-light performance3. Speed (boot up, focus speed, etc.)This is how the F100fd stacked up against the other two.The F100fd's main selling point is its low-light performance. I found that although the low-light performance was good, it wasn't as good as it was hyped up to be. ISO 400+ pictures were a bit grainy -- much better than my previous Canon, but not near as good as I had expected. In decent light, the picture quality was superb, the best of any point-and-shoot I've used. 5X zoom was great, and although cumbersome the menu system was acceptable.  I also loved the feature where it takes two photos when you press the shutter - one with a flash the other without, to see which one comes out better.  However, the killer was speed. The time it takes to actually snap the photo after you press the shutter button is just too long.  Focus and time-to-shoot was too slow, and by the time it actually took the picture the moment was gone most of the times.By comparison, the Canon SD770-IS speed was superb, it took photos almost instantly, and was the much lighter and smaller than the other two cameras.  Overall an excellent point-and-shoot.  It takes very nice pictures, almost as nice as the F100fd. However, it does very poorly in low light, and you basically have to plan on using the flash all the time. My camera also did poorly in bright light, most of the pictures in sunlight were over-saturated. (The front panel of this particular camera was popping out a little, a manufacturing defect, which may have affected the light meter on the camera).The Panasonic TZ5 had the best of both worlds (almost).  It did much better than expected in low light - almost as good as the F100fd. There is more noise than the F100fd, but the overall picture tone and sharpness are still excellent.  In terms of speed, it was almost as good as the Canon, and much better than the Fuji.  It also had some nice features like continuous shooting (at about 2 frames per sec), 720p video (but which records similarly to a decent 480i camcorder), the nicest LCD screen of the three.  The flash isn't very good, and it's the bulkiest of the 3.So overall the Fuji had the best picture quality overall and had good low-light performance, but was just too darn slow.  The Canon had great overall picture quality and was the fastest but with sub-par quality at low and bright lights.  And the TZ5 was in between, good overall picture quality, decent at low light, and with good speed.  So I ended up choosing the TZ5 because it was a good compromise and my kids can't sit still.  But if shooting speed is not a major concern for you, the Fuji will give you wonderful quality pictures.", "Date": "September 9, 2008"}, {"Title": "Fantastic Image Quality", "Author": "Stephen Standifird", "ReviewID": "R34Q4LJC744B50", "Overall": "5.0", "Content": "I recently picked up this camera and could not be happier. It's not going to win any style awards and it does not have all the controls some of its competitors have (though it has most of what I want). The thing that sets this camera apart is the image quality. And, quite frankly, nothing matters more to me than the quality of the image coming out of the camera. I do not make this comment in haste. I initially purchased a Sony W170 based on some of the reviews I had seen of this camera. I was not at all happy with the results. I then found a good deal on a Panasonic DMC-FX37. I did a bunch of test pictures (both cameras, same settings, multiple ISO values). The Panasonic proved slightly better but not much. The amount of noise in both was quite high. I was not expecting a point and shoot to match my Nikon D40x. However, the quality of image for these two cameras was making me question by decision to try to get a point and shoot for travel. I decided to give the Fuji F100fd a try before abandoning my search for what I consider a usable point and shoot. I am VERY glad I did so. The images from the F100fd are much better than those from either the Sony or the Panasonic. I repeated the test pictures take with both the Sony and Panasonic using the F100fd. High ISO values create challenges for all three. However, I find the 800 speed quite usable on the Fuji. Not so with either the Sony or Panasonic. And at 400 ISO, the Fuji is much better than either the W170 or the FX37. The pictures are sharp. Noise is not an issue and both color and contrast are great. The quality of image allows you to enlarge and crop your pictures significantly. This is not possible if the quality of image is lacking. The F100fd is surprisingly close in performance to my Nikon D40x at lower ISO values. It may be missing a couple of the key features that other cameras include. However, if image quality is at the top of your list, I doubt you will find a point and shoot that outperforms the F100fd. As for the pink banding issue, my understanding from reading posts is that this was fixed some time ago with a software upgrade. I've done a fair amount of shoot with this camera at night and have not had any problems whatsoever. I see this camera as a great choice for someone looking for a point and shoot but is primarily concerned about image quality. I'm very happy I decided to give this camera a try.", "Date": "March 7, 2009"}, {"Title": "Hands Down Best Compact On The Market", "Author": "K. Bennett", "ReviewID": "R1EFNTWPOHIBUV", "Overall": "5.0", "Content": "I am being very open and honest when I say this is the best compact on the market. Please note when I say this I am specifically refering to image quality. Things like looks, feel, menu layout, options, weight...ect are a mater of personal preference and who can judge that for you. I will admit I am not a professional photographer but I don't need to be to see which pictures are more pleasing to the eye. Isn't this what it is all about?In short the Fuji F100 take beautiful, sharp colorful high resoloution pictures. I specifically compared it against Sony's DSC W170 & Canon's SD870 IS. The only reason I ever tried these other cameras is because I currently own a Fuji F31FD and wanted something with a real image stablizer. After reading all of the raving reviews I purchased the Sony DSC W170 and the Canon SD870 IS. I took various pictures with both cameras around my house on a sunny day,, inside and outside. To my suprise they were not even close to my Fuji F31FD or the Fuji F100FD. The descrepancy is such that it makes me wonder if Sony and Canon pay reviewers to give them great reviews. The reality is that the Fuji blows them both out of the water. Don't get me wrong, both Sony and Canon will take nice pictures outdoors, (Pictures on par with the Fuji) but as soon as you come inside the difference is day and night. The reason is very simple. Fuji cameras have a larger sensor that capture more light with less noise. This makes pictures taken indoors brighter and sharper with an overall look that is much, much more pleasing to the eye. Not to mention pictures taken indoors with Fuji never have the white spots that both the Cannon and Sony would have at random. This alone was a deal breaker. Since these spots are totally random you never know when your photo was going to be ruined by them. Never an issue with the Fuji! I realize most people think Sony and Canon's are great but it just make me think they don't really know the difference, or that they value something other than image quality about their cameras, hince giving them great reviews. Both the Canon Elps series and Sony DSC are very popular and are the cameras most people will buy, but remember in most cases the crowd is wrong and this is definatietly the case here. The Fuji takes excellent pictures outdoors and the best of any compact indoors. Don't let these so called professional reviews cost you a 15% restocking fee. Just go buy the Fuji and know none of the other compact even come close. Highly Recommended!", "Date": "July 14, 2008"}, {"Title": "One of the best little cameras!!", "Author": "Radio Man \"yarns13\"", "ReviewID": "R2DIVC1I6EYIEI", "Overall": "4.0", "Content": "I have a Nikon SLR, but like many dragging a big camera around can be a pain!I own an older Canon Elph SD-450 which actually takes rather GOOD pictures..except in low light and well..it's just too old now. I was trying to update my Canon with the newer technology out there..Face detect,image stabilization,better movie mode. From a lot of research I initially wanted to buy the Fuji F100fd but kept getting scared off about the pink banding issue, so I bought a Canon SD 950. The Canon IS a very good camera but I was finding the face detect worked less than 50% of the time and anything shot at 200iso or above looked rather noisy and the pictures were rather washed out. Flesh tones with the Canon tend to be TOO pink overall.To fast forward I did buy this Fuji camera..and overall I feel it's a bit superior to the Canon 950. Pics come out with a bit less saturated colors BUT now I realize colors, especially skin tones look more natural with the Fuji. Face detect works much better with this Fuji as well. That being said, at full 12 megapixels I can see a bit of noise in pics 400 iso and above rendering face detect a bit useless in some cases. To sum up, OVERALL this Fuji is VERY good. A little messing with some of the settings and this Fuji takes GREAT pics overall. I like many, wish \"they\" could make a point and shoot with a bigger sensor and maybe no more than 8 megapixels..but till then to me..this Fuji is about as good as it gets till then. Also I should mention I have seen NO NO pink banding in any pics..and for those who shot pics in total darkness in a drawer LOOKING for pink banding?..well isn't that a bit crazy??? I recommend this Fuji...great camera overall!UPDATE: All I wrote above I still feel. But after coming back from vacation and analyzing the Fuji pics at full resolution I now realize most pictures are just too noisy,..and all lack detail..like for example seeing hair as hair instead of cotton like hair.  Long story short I returned this Fuji...got a Panasonic TZ5 and I like it MUCH better and though the TZ5 is suppose to be a bit noisy above 200ISO it's MUCH more quiet and detailed than the Fuji 200 iso-800. I still feel the Fuji IS one of the better tiny cameras out there..but you may want to try a Panasonic TZ5 with 10 times zoom..and NO purple fringing...you may be surprised just how good the TZ5 is compared to the Fuji.", "Date": "July 16, 2008"}, {"Title": "A point and shoot camera", "Author": "Tom North \"TomN\"", "ReviewID": "R2BZR2W44IHLM7", "Overall": "5.0", "Content": "Yes, under extreme circumstances and with some effort you can create a picture showing a slightly blue / purple speckled black in dark objects or shadows. This is at the extreme left 2% of the photo, visible when artificially enhanced in Photoshop, and difficult to see when printed.The Fuji seems to have less noise and better resolution at ISO 400 and 800 than other cameras in it's class.  It is a wonderful little point and shoot camera with limited manual control.  Would prefer 4 1/2 stars but not an option.", "Date": "April 17, 2008"}, {"Title": "Better indoor image wide-angle, comparing to SD870is & TZ5", "Author": "Jeffrey D. Doan", "ReviewID": "R1W7MTZDT7ZTMG", "Overall": "5.0", "Content": "Costs more than both the Canon SD870is & Panasonic TZ5 (all are wide-angle), but produces the brightest indoor images.  I bought all 3 to compare and ended up keeping the f100fd as I'm just tired of grainy & dark indoor pictures.Zoom range is decent, a little heavy, video is only standard, costs more.  But I really like the dual-shot feature which take 2 consecutive pictures, one with flash & the other without, as I no longer have to decide whether to use flash or not.Anyway, go for this one if you want the better indoor pictures.", "Date": "October 15, 2008"}, {"Title": "Point and click at its best", "Author": "Patxi 77 \"AK\"", "ReviewID": "R2QBMHOBIFK3QY", "Overall": "5.0", "Content": "I bought this camera as a replacement for my previous compact. It has delivered on the key requirements:[1] Easy to use: This is a classic point and click. Auto mode delivers great photos. Very important![2] Low light performance: Amazing indoor photos. For low light performance, megapixels don't matter. What matters is the size of the sensor. This camera has a bigger sensor than the average compact, and it shows. Tons of indoor pictures, with great quality and no flash.[3] Makes good pictures: Clear, no noise, good zoom.[4] Smart automatic features: Tracks faces and makes sure they're on focus, removes red eyes automatically, auto-stabilizer works, etc... And without pushing a button or touching a setting.[5] Takes good video. Quality is good enough to share over the internet and to keep records.[6] Compact size, very light weight.I've had it for over a year now, and it still works great. I'd recommend it to anyone who \"just needs a good camera\".", "Date": "February 20, 2009"}, {"Title": "Clear, sharp photos in dim places.  Small with a 5X zoom", "Author": "J. Youm \"Amazon shopper\"", "ReviewID": "R2NT2QL0Y9UOWD", "Overall": "5.0", "Content": "I have a Canon Powershot S3IS that is somewhat bulky to carry around, so I was looking for something small. I also wanted a camera that took good clear photos in dim indoors environments.  After doing some research, I found that this Fuji camera was one of the best point and click cameras for my needs.  As you can see from the images that I uploaded, it takes wonderful pictures in dark environments without the grainy noise that usually comes with ISO1600.  Of course, if you blow up the image, you'll see those grains, but at 12 mega pixels, most people will be content with a photo that fills up their 15 inch screen, not a 1:1 pixel by pixel blow up of the entire 12 mega pixel image.", "Date": "February 7, 2009"}, {"Title": "Great all around Camera", "Author": "G. Ward \"HDFAN\"", "ReviewID": "R3E654910KWRDL", "Overall": "4.0", "Content": "I agree with the reviewer on April 9th,  Trevor sounds like you read some reviews on dpreview and never actually had the camera or have you? LOL. By all means please buy the Canon 800 IS or 870 and get stuck with over 40% of your shots with dust spots from the flash being too bright. \"Some\" Fuji cameras have had this issue on early production runs, so far I haven't seen it pop up on my camera because I been too busy taking great pictures.  The unit is built solid, has nice 5X zoom and a very easy to navigate menu system. The low light is almost as good as the famous F30/F31 but it does much better out doors than the last models.", "Date": "April 13, 2008"}, {"Title": "Pros & Cons", "Author": "J. ARCA \"green pumas\"", "ReviewID": "R3Q6836N86XAZO", "Overall": "4.0", "Content": "Pros:- 28mm wide angle, great for group shots- SD or xD card types- High ISO Image Quality better than 1 f-stop better than f50fd and almost as good as f31fd- Optical image stabilization- Dynamic range maintains shadow details that would otherwise have been lost- Good automatic flash adjustmentCons:- Menu much less intuitive than predecessors.  Useful options buried--may make you miss the shot.- Slow start up time.- Less than average battery lifeQuality:I leave this at ISO400 (AUTO).  With the camera at the other ISO AUTO modes, it prefers the higher ISO's when indoors, producing ugly noise.  ISO 400 is almost as clean as ISO 100, where ISO 100 will produce shots that are too dark indoors.  I also took a shot of a subject about 1  1/2 feet away with flash, and surprisingly used just enough not too overexpose it, where my other digicams would have.Design:The dial around the menu button is unnecessary, since you could do the same with the 4-way button action.  I never needed to scroll through shooting modes or photos quickly.  Miss a dedicated selector for shooting modes, and single button press for menu.Wish List for the next model:- If they made a slot for just xD or SD instead of both, they probably could have fit a larger battery with higher capacity.- Sacrifice 5x zoom to make it smaller & lighter.  Make 3x: it 28-105mm.- Dedicated shooting mode dial as on the f31fd.  Easier menu.- Zoom buttons, which is more comfortable, instead of a rocker.- The return of manual settings.", "Date": "July 18, 2008"}, {"Title": "Good available light pics but very limited manual controls", "Author": "T. Vo", "ReviewID": "RRCDOPDHEKQI6", "Overall": "3.0", "Content": "I own an F30 and love it and was hoping this upgrade would be even better.While the wide angle, face detection and image stabilization are welcomed enhancements, the lack of manual control for setting the aperture (the A/S selection on the F30 dial) and some other user interface related annoyances have forced me to return this camera for a refund.In addition to the lack of A/S control, to do exposure compensation requires that you access the menu and a couple of submenus. On the F30, you can hit the +/- setting and change aperture and exposure compensation rather easily.Turning the dial on the F30 to switch between different shooting programs was much better than going through a circular menu on the F100FD - at least for me anyway.So while the camera is great for a casual snap shooter who doesn't care about manual controls, those users who have used the F30 and are used to the UI there will most likely be disappointed by the F100FD.For those F30 users wanting to upgrade to the F100FD, I would say please do so with caution. As for me, I'm going to save my $350 and stick to my F30.In summary ...What's hot?- Good available light photos- Face detection (though it seems more of a cool feature than useful one)- CCD based image stabilization- Comes with separate compact battery charger (unlike F30)What's not?- User interface is a step backward- Lack of manual controls may be a showstopper for some- On the expensive side", "Date": "April 14, 2008"}, {"Title": "A Great Compact Camera with Great Low Light Ability", "Author": "Shawn C.", "ReviewID": "RQSXZ2WFWNS4K", "Overall": "4.0", "Content": "Most of the compact cameras now-a-days are good in outdoor bright light but perform poorly in low light. Not so with this Fuji F100fd. I would have given it a 5 but due to the camera's programming always try to use high ISO unnecessarily, I would have to give it a 4.  As a result of that, you should ususally leave it in \"M\" mode and choose the lowest ISO possible without hand movement blur.  Camera has a setting for you to leave it in Auto-ISO(Max400,800,1600,3200).  Because this camera is for my wife, so I set it at auto-ISO(max400).Pros:1) Good image quality if in proper ISO setting2) DR setting to diminish bright light clipping--a rarity for a compact3) Excellent low light capability up to 400 ISO; 800 ISO still quite useable4) Useful zoom range 28-140 mm5) Good 2.7\" screen can still be seen when wearing polarized lense (my Cannon SD870 screen is no good when wearing polarized sunglasses)6) EV(exposure) still adjustable when using slow sync flash unlike Cannon SD870.  F100 would change shutter speed to compensate for the exposure adjustment.7) Soft flash in macro mode; subject doesn't get blown away as much.8) Excellent macro image qualityCons:1) Camera usually chooses higher ISO unnecessarily. Needs manual override2) Dual mode Image stabilization not as effective as my Cannon SD870 and it also causes ISO to increase.  Too bad you cannot select just the IS.3) The lense starts at 3.3f which is too slow, should be at least 2.8f this plus the ineffective IS force you to choose a full stop ISO higher.4) Flash is relatively weak & when using flash the white balance is incorrect(images appear too cold).  Use slow sync flash->much better.5) Auto focus sometimes not reliable (compares to SD870)6) Menu controls/button layout not as convenient as the SD870, esp when you need to change the settings a lot.*Battery life: I got 246 shots(76 flashes) in my first charge which is higher than what I expected after reading many reviews.Summary: not quite the choice for snap shots, often times, you need to manually select the ISO value for the optimal image quality.  As I use the camera more and more, the camera began to grow on me.  Fuji still hasn't changed the main issues in F100df's replacement--F200EXR.  When Fuji changed #1-4 in the \"Cons\" above, I'll be upgrading my SD870.", "Date": "May 5, 2009"}, {"Title": "Good replacement for F50fd", "Author": "Kamran", "ReviewID": "R3W3K0YYNP3LRF", "Overall": "5.0", "Content": "I had F40fd camera and them F50fd. F40 was better than F50, but just a little bit. Now I bought F100fd and very happy. It's much better than F40 and F50 (image quality, zoom, etc) and I'm almost sure this camera will serve me for years...", "Date": "June 15, 2008"}, {"Title": "Picture quality superb, but some annoying features", "Author": "A. Tegtmeier", "ReviewID": "R1XRDOJC7HZ4QH", "Overall": "4.0", "Content": "First of all, the picture quality is really superb. Colors are life-like, images are crisp and detailed, the face detection feature works well and although not quite as good as the legendary F-30 (which I also own ... well, my wife uses it all the time, so I had to get a camera for myself ...) at higher ISO settings, up to ISO 400 there is really no reason for any complaints.An added bonus is the wide angle lens, that also has a useful tele feature. My former camera, a Ricoh R-7 (not sold in the USA, I believe - got it from Germany), had a 28-200 lens, but was terrible at ISO settings above 100. What it had, though, was a very fast reaction time, both at power up and in shooting mode.That, I am afraid, is the real Achilles Heel of the F-100 fd. It takes the camera a long three to four seconds to be ready for shooting and the time between pictures is also measurably long. Trying to get images of a baby, a toddler and a teenager at home can be somewhat frustrating with this camera.Also, the fact that there is no dedicated button to switch from still image to video really hinders a smooth operation in family shooting situations. You have to go into the menu to switch the mode, which will take invariably longer than just pushing an outside button.The menu itself is not bad designed at all, but I wished it had a physical menu wheel (like the F-30) instead of the electronic variety.Another grievance are the dimensions of the camera. The F-30 is kind of bulky, but it came out a few years ago when this was state of the art. The F-100 adds to this bulkyness by having the lens protruding out of the body when it is shut off - not by much, but it leads to a degraded ability to carry the camera in a shirt pocket or so.The lens itself moves in seven to eight steps from wide angle to tele - depending on your ability to push the zoom lever for a fraction of a second more or less. While a real step-less zoom cannot be expected for such a price, it is only a minor annoyance and a limitation I can live with.Another drawback is the tiny battery - I get appr. 180 shots out of it, a far cry from the 350+ pictures the F-30 delivers.One final grievance is the layout of the buttons on the backside. There is no place to rest one's thumb while shooting one handed, without touching some input element here.So, to sum it up:Picture quality is superb, handling is barely average, battery life sucks and the size is tolerable.But for most of these limitations, a work-around can be found and all in all I am very pleased with the camera, because for me picture quality is the most important factor and in this area, the F-100 really delivers.", "Date": "March 20, 2009"}, {"Title": "2 Years later the camera functions have locked up", "Author": "G. Pergande", "ReviewID": "R17H503Q9G9H79", "Overall": "1.0", "Content": "I bought this 2 years ago on a recomendation from a photographer for its features and durability.  First the zoom button started sticking once in a while, then all the time and then all in or all out.  Next the lens shade would only open half way and if you didn't catch it your picture would be blocked.  Now the zoom is stuck out and is pretty much finished.  It's almost like it was never lubricated and as time went by it just locked up.  I thought the Fuji brand was top rate but I will never purchase another.", "Date": "September 1, 2010"}, {"Title": "Great Compromise", "Author": "KenF", "ReviewID": "R1MDU1A0O7A6A7", "Overall": "5.0", "Content": "I take pictures primarily to remember and share events. I like to enjoy the moment more than shooting for the sake of shooting.  But I like great IQ too, so I want a small camera to fit in my pocket that takes great pictures when I need it in a variety of situations.All P&S; cameras have their shortfalls but the f100fd fits my needs better than anything I have found. The key is to work around the shortfalls. If you want a camera that you don't have to think about to get great image quality the f100fd does okay but generally picks higher ISO than is needed.  The result is loss of detail. I use the manual mode and ISO 200 for most situations.I like to shoot at EV -2/3 because the default settings have a tendency to clip highlights. I don't mind post processing to adjust that later. I might lose some shadow detail but I prefer that to clipped highlights.For low light indoors I use Auto 400, Auto 800 in a pinch. The 800 is okay for small prints but these days I mostly view images on a computer or make DVDs for TV. For that you need lower ISO and high resolution, especially if you want to do some cropping. If the subjects aren't moving I like to use ISO 200 and the 2 second timer to steady the shot. I always use the image stabilization which is not optical but helps some.PROs:12MP resolution with larger than average sensorExcellent detail at 100-200 ISOGood P&S; low light performance at 400 ISOSolid build qualityFast operationUseful 28-140mm equivalent zoom rangeFits my pocketWish list:Longer battery life (buy some spares)More manual control (F30 had Aperture and Shutter Priority)Easier to reach EV adjustmentHD video", "Date": "November 14, 2009"}, {"Title": "Great compact point and shoot", "Author": "S. ORourke", "ReviewID": "R1FPUN2R5ZOS16", "Overall": "4.0", "Content": "Over the past few years I've owned a Canon G2, Canon S2, Fuji S9000, a Panasonic TZ3 and now the F100fd.  All of these cameras had pros and cons, but after buying the TZ3 I rapidly grew tired of the extremely poor indoor quality and noise that I actively sought out newer and smaller (compared to the beefy S9000) super CCD Fuji.IMO the F100fd is a marked improvement over the TZ3 for indoor photo quality and below are some of the pros and cons I've found with this camera.Pros:* Larger CCD than typical point and shoots (compare pixel density on dpreview) yielding decent to good indoor image quality.* Nice color balance and saturation, especially when set to \"chrome\"* Ok movie mode* 28mm wide angle which is huge for outdoor shots.* Fun burst mode albeit at 3MPCons:* Slower burst mode (@ 12.1 MP)* Slightly weak flash (but the norm I think in this price range)* Slower than average write times", "Date": "September 2, 2009"}, {"Title": "Best DC I used", "Author": "H. Zhang", "ReviewID": "R3UX52YQST48QH", "Overall": "4.0", "Content": "I like this DC so much. very easy to use with many scenarios to choose from and it performs much better in the night than sony and cannon.however, i didn't give 5 star b/c the design of the lens. Unlike other DC's internal lens, this lens is easy to get dirt. Plus, there is some problem with the lid. it doesnt fully open after 3 month use.overall, i like this DC and am willing to get the fd200.", "Date": "July 22, 2009"}, {"Title": "Survived the Brazilian Amazon", "Author": "BeeDeeJay", "ReviewID": "R316GN0BQTHN7U", "Overall": "5.0", "Content": "I am not a professional photographer. I can probably be classified as a moderately knowledgeable amateur. I was attracted to the FinePix F100fd because of its reputed low light abilities and small size - just what I was looking for.  I received the camera just a day before heading off on an adventure to the Brazilian Amazon. I did a very brief scan of the manual (which I did not take with me). I would have to learn it as I used it.The photography I was particularly interested in was a night time cultural festival. It would be much like a night time outdoor music concert in a stadium. Lots of colors and movement.I was not expecting great things. A previous trip to this festival 8 years ago did not produce very good results with my 2MP digital camera of that era. I was primarily interested in preserving some memories of this unique festival. A professional would likely find fault in what I found to be satisfactory. I set the quality at maximum (12M). For most of my photography I set the ISO to limit at 1600 and set the Scene position to N (natural light - without flash). Picture stabilization - On. I also experimented with full AUTO, Night, and Fireworks.I am happy with the results. I took about 1000 pictures and some video over the course of several days using SDHC memory cards. My initial review is that about 80 percent of the photos I took are keepers. I have not run them through my photo editing program yet for additional enhancement. My first experience at taking video was satisfactory in my view. The camera did well for my level of expectations. Those pictures I took in daytime lighting are quite impressive in my opinion.I had one glitch the first night of the festival with a lens autofocus error. Maybe a little residual dampness from a rainstorm I was caught in earlier in day? It resolved itself when I swapped out the battery later on.The camera exceeded my expectations. Very happy. Especially considering the price after rebate I paid.", "Date": "July 8, 2009"}, {"Title": "A good compact camera, despite some flaws", "Author": "Carmen Sandiego", "ReviewID": "R1IGQIU33RNR7M", "Overall": "3.0", "Content": "I've had this camera for around a year, and have used it in a wide variety of contexts (indoor low light with/without flash, outdoor tourism).Pros:* Outdoors in good light, the pictures are in most cases very good and detailed, with natural colors. One exception: in contrasty scenes, the shadow detail is poor (worse than my previous camera, a Canon PowerShot SD800 IS). For instance, in a street scene where the light is weaker at street level than on the buildings, details of peoples' faces are lost.* Very good lens, excellent zoom range (better than the small Canons). This is a major reason I chose the camera.* \"Flattering portrait\" mode is fun, if gimmicky.* Very good long exposure pictures quality: I've used this extensively to take pictures inside darkened buildings (e.g cathedrals)* Strong metal case, robust high quality construction: I've dropped the camera on concrete, which dented but didn't break it.* Some useful modes that work well (eg snow, museum)* The scroll wheel is great for navigating a large volume of photos* Low light performance at iso 1600 can be remarkable for a compact, if you're lucky (but see below). Plenty of examples to be found if you look for this camera on flickr.Cons:* High iso performance (at 1600) is very unreliable. Sometimes the pictures at this iso are good, but other times they are washed out, noisy, and lacking detail. The best cases seem to have been in settings such as concerts, where the musicians are relatively well lit: the high iso then avoids the motion blur one would get with lower iso and longer exposure. Of course, at this setting, the camera should be set to 3mp resolution, since more pixels are redundant at these noise levels. This is a pity, since 1600 seems the lowest iso at which low light social shots (eg at dinner parties) start to make sense.* Even at iso400-800, much of the fine detail (grass, hair) in a scene is lost.* iso 3200 and up is useless on this camera* Occasional severe focus errors for pictures at close range and/or in low light (e.g parties).* Unintuitive user interface: where to start? No access to exposure compensation without going into the settings menu (to access this, you need to hold down the \"menu/ok\" button for about a second). Huge number of modes, that have to be scrolled through endlessly. Did you know the camera can be placed in \"slient mode\" (no AF light or beeping) by holding down the \"disp/back\" key? I only discovered that after 8 months - why no menu option?* With/without flash mode: this is a great idea in principle. Unfortunately,the \"without\" mode usually defaults to iso 1600, which is one level above what the camera is reliably capable of.* Increasing the dynamic range makes very little difference to highlight clipping, in my experience. However once you increase the iso to 400 for a 400% dynamic range increase, you lose a lot of shadow detail.So in conclusion: The camera is great for outdoor daytime photography, long exposures at night, and indoor flash photography. That said, it seems the designers realized that iso 1600 is a sweet spot in terms of low light social photography w/o flash, which is why the camera often defaults to that setting. But unfortunately, the sensor technology is not quite there. Judging from dpreview, the f200 exr is also lacking in this respect, although it has improved the dynamic range performance. Still waiting for a compact camera that works in low light!", "Date": "June 21, 2009"}, {"Title": "No compare", "Author": "J. Michel \"Key Man\"", "ReviewID": "R2EPX46CO8AX3W", "Overall": "1.0", "Content": "Good luck with Fuji on their customer service. I guess I am spoiled by the F31FD I had as far as product goes. I bought the F100FD and it is truly as piece of crap. It has been for repairs twice already and still takes pictures that are too dark. It is weird as well because they first show up on the lcd the way you would want them to and then they darken in the next second and thats the pic you get. Next the lens would not retract.I wonder if their is a lemon law for camera's. Anyway, as much as I loved my F31 and my scansnap (other than the software), I will be much more prudent about buying anymore of their products in the future.As in not buying unless spectacular in the public opinion. Same goes for HP as well.I wish company's would stop these pixel wars and give us a camera like the F31 again.", "Date": "May 10, 2010"}, {"Title": "Love everything but the purple banding", "Author": "Glory Mooberry \"artist at large\"", "ReviewID": "R2TU8SRG8ZBY5V", "Overall": "4.0", "Content": "Haven't explored all of the attributes yet, but am fairly pleased with the ones I've used.  I love it's ability to take photos in low light!  I've run into purple banding a few times and missed a few shots (but had my Nikon P90 to cover the situation).It's heavy for a small camera - I actually think the P90 is lighter.  But it takes very good pics and will go in really close.", "Date": "October 22, 2009"}, {"Title": "Fugi F100fd", "Author": "Kevin Henry \"khenry\"", "ReviewID": "R1EUD4XWIFRG2S", "Overall": "4.0", "Content": "Great little camera.  But not so small you will loose it.  Does well in low light and has great battery life.  I would buy again.", "Date": "September 15, 2009"}, {"Title": "Great cam for cheap", "Author": "R. Sorak", "ReviewID": "R2KFQMRQ0GMI6A", "Overall": "4.0", "Content": "I've not noticed any pink banding in the over 1000 pics I've taken so far with mine....After the $100 rebate this cam was a real steal, and I'm very happy with it.", "Date": "June 24, 2009"}, {"Title": "Excellent camera for an excellent price", "Author": "Christopher Robinson", "ReviewID": "R1F8WCI5D8MKOJ", "Overall": "5.0", "Content": "Overall I think this is a great camera. I have not worked with all the functions yet, but I'm getting there. I love the TOP/FINAL modes, very effective during the daylight. Supposed to be an excellent low light camera, I like what I've seen so far, but not a whole lot from my previous camera's, but like I said I'm still adjusting to the camera. Takes gorgeous photo's. I'll have to write another review once I've had the opportunity to use it in most modes. So far I love it though.", "Date": "June 9, 2009"}, {"Title": "Great camera if you take the time to learn how to use it", "Author": "Alex Perry", "ReviewID": "RMJX2931MWQEZ", "Overall": "4.0", "Content": "I was not too impressed with the image quality and versatility of this camera, but now that I've used it on several occasions and scanned through the manual, I love the wide-angle lens and the low-light picture quality.  And after the $[...], the price can't be beat. :)", "Date": "June 1, 2009"}, {"Title": "They made a great product better", "Author": "E. A. Franklin \"eaf14131\"", "ReviewID": "R3MXD6FCMCEH5K", "Overall": "5.0", "Content": "I ruined my Fuji F650, which was an outstanding camera (they don't float or resist water too well). With a Fuji rebate, this F100 will cost about the same as an F650 replacement.This camera is a little smaller, has more pixels, and does more than the F650. Pictures are clear, zoom is effective, the movie feature works well as do all the other features.A great camera for the price.", "Date": "May 25, 2009"}, {"Title": "Best Camera for the $$$$!!!", "Author": "lifeloyalsigmachi", "ReviewID": "R1B3FOEFYVIPGF", "Overall": "5.0", "Content": "The clarity and overall picture quality is quite stunning for such a reasonably priced camera.  You won't be disappointed with image quality, only the menu features, which seem sort of tedious to operate.", "Date": "May 22, 2009"}, {"Title": "Great Camera", "Author": "Dave", "ReviewID": "R37J3VK0DIWEKA", "Overall": "5.0", "Content": "I started with the F10, still use it.Love this camera, for a carry around pocket snap shot camera.", "Date": "May 12, 2009"}, {"Title": "Nice Clarity", "Author": "Kalyan K. Gudivada", "ReviewID": "RKBHI4FOD636G", "Overall": "4.0", "Content": "For this price, this is excellent camera. Forget ISO values whatever other stuff. this is having big resolution with very good quality images.Pros: Too much clarity, No Cam can beat this in sun light / day time, BIG prints, $[...] rebateCons: Flash is not too big enough for more than 10 feet distance. Night mode is not good.", "Date": "April 28, 2009"}, {"Title": "Died in 6 months", "Author": "bookcrazzzy \"bookcrazzzy\"", "ReviewID": "RQ2YIWQFW5FTJ", "Overall": "1.0", "Content": "I bought this camera, got an excellent case for it and took excellent care of it.  Used it very little.  Have had it six months and it is dead.  I hate that.", "Date": "June 27, 2010"}, {"Title": "Worst indoor auto focus performance", "Author": "Y. Hu", "ReviewID": "R3TBY5R6VO5Z0E", "Overall": "2.0", "Content": "I return the camera in less than 24 hours with great disappointment.After owning Fuji F20(stolen) and F40(girlfriend took it), I was pretty excited about getting a F100fd.  Reading from all the online user reviews, I was expecting a good camera with great Fuji picture quality and anticipate more noise due to the higher pixel counts.However, this camera has the worst indoor focus performance ever.  It failed to lock on the object correctly or simply refuse to focus in a typical office with fluorescent lighting.  It wouldn't even focus on my desktop telephone that's 3 feet away.  I had to press it 7-10 times to get a focus confirmation.  Sometimes, even with focus confirmation, you still get a out of focus picture.It won't focus on Plasma TV (basically fluorescent lighting).It focus perfectly on LCD TV.It won't focus when my office light is on.It focus when I turn off my office light.This only happens when there is fluorescent lighting presented.  Outdoor focus is quick and accurate.  I suspect it has something to do with the 60hZ refresh rate generated by fluorescent light.My friend's Fuji F200EXR and my 6 years old Canon all acquired perfect focus under the same condition on the same object.I called the seller, explained my problem, he told me that's the way this camera is.Not to mention this camera also has the worst user manual interface.This really makes me wonder why this 8th generation Super CCD is such short lived in the F series.[...]", "Date": "May 26, 2009"}, {"Title": "a scanner", "Author": "Coolcat700 \"coolcat7_00\"", "ReviewID": "R245U7Y0KT7NVW", "Overall": "5.0", "Content": "I bought this camera to mainly use as a scanner and to also use as a camera.  The camera works very well.  The difference between pictures is night and day between this camera and my old konica camera.  The camera takes good shots of documents which is the main reason why I got the camera. The camera takes good pictures of people and scenery.  Hope this helps someone.", "Date": "May 24, 2009"}, {"Title": "an excellent underwater camera", "Author": "xandolli", "ReviewID": "R1NVPL6SLN5GV7", "Overall": "4.0", "Content": "It's light, portable and easy to use. I use this mainly for underwater photography and get stellar images. Only if the battery life could be improved, it would be perfect.", "Date": "December 21, 2010"}, {"Title": "So disappointed in this camera", "Author": "Shell", "ReviewID": "R2EY7526Q336HH", "Overall": "2.0", "Content": "I am so disappointed in this camera.  The size/weight/and layout is great however it takes horrible pictures.  It does an OK job outside, but every picture I take inside is grainy and hard to see. I certainly could never have any of these pics printed to a nice size to frame, I can barely post them on Facebook. I bought this camera for a trip to Disney because we had too much stuff to bring the big D-SLR but I really wish I would have purchased a different camera.  Keep researching and find a different compact!!", "Date": "September 12, 2009"}, {"Title": "Pink banding IS a problem", "Author": "Bertalan", "ReviewID": "R1NPCCLAHH8GQJ", "Overall": "1.0", "Content": "I don`t understand why people downplay the pink banding problem that is noticable not only on iso800 & above shots, but on pictures taken of high-contrast objects as well. I saved many shots to my memory card from my friend`s f100 and I am not at all satisfied! Outside pictures are great in general, but banding appears on high contrast areas!I hope lots of people will return the camera so fuji`ll be forced to finally do something about it! We, customers should step up aginst the megapixel rate as well. The F100 with same sensor, but 6-7 megapixel and pink banding fixed would be as close to perfect as current point & shot cameras can be. It`s not right to make it look as \"ah well all cameras have this problem\". At least something may change this time as LOTS of people are upset with this camera, check camera forums all over. I believe massive consumer complaints may progress the industry as other manufacturers are watching the case closely. Spread the words, do your part!", "Date": "April 19, 2008"}, {"Title": "surprisingly poor performer", "Author": "spin_nin", "ReviewID": "R2VMA0VJQI3V4G", "Overall": "1.0", "Content": "I've been a fan of Fujifilm cameras since they used film.I'm sorry to see that, after using this camera, Fujifilm is going in the wrong direction.If they would've just added the wide angle lens and 5x zoom to the F50fd they'd have a winner. Instead they removed the ability the choose the type of image stabilization in favor of one generic image stabilization mode that is ineffective. The dynamic range that was added washes away all fine details and gives the term watercolor noise reduction a whole new meaning.The price is astronomical for the poor performance this camera provides.If you want a good camera with a wide angle lens and more zoom look to the Panasonic Lumix DMC-TZ4S 8.1MP Digital Camera with 10x Wide Angle MEGA Optical Image Stabilized Zoom (Silver) or for a wide angle lens with less zoom try the Canon PowerShot SD870IS 8MP Digital Camera with 3.8x Wide Angle Optical Image Stabilized Zoom (Silver). If you want a great camera that delivers excellent detail, great low light shooting, go back to the Fujifilm Finepix F50fd 12MP Digital Camera with 3 x Optical Image Stabilization.I'm sorry to say that it appears Fujifilm has lost their way with the F100fd.", "Date": "August 4, 2008"}, {"Title": "Avoid this camera. Has pink banding issues.", "Author": "anonymous \"anonymous\"", "ReviewID": "R9V3SIG882PHP", "Overall": "1.0", "Content": "I followed the advise of some of the others who commented on the camera and said their wasn't any pink banding issues. They are completely wrong. At ISO 400 you can definately see a pink banding issue on the left side of the image. The sad part is, depending upon the lighting, the pink banding even shows up at ISO 200.FujiFilm has yet to acknowledge the issue which is very poor customer service. Google F100fd and pink banding if you want to read more about the issue.It is a great camera in daylight as pictures \"pop\" out at you, and with little noise. It takes very clean and crisp pictures at ISO 100. If it wasn't for the pink banding issue, I would give this camera 5 stars.", "Date": "April 17, 2008"}, {"Title": "Still learning this camera - looking for input", "Author": "Anne Hurrle-Kazek", "ReviewID": "RF5O2JAPT3SIF", "Overall": "3.0", "Content": "This is the third Fuji Finepix I have had. Previous to the F100fd, I had the F60 fd. I thought you would control wide angle differently but apparently it's just wide and then you zoom. Am I wrong?!? This model still has some of my favorite modes but I am struggling with the manual mode in regard to interior shots. I used to use manual and adjust exposure compensation in order to shoot interior views with windows. By adusting it negative 2/3 I could get decent lighting and see view through window, instead of getting a big white or hot spot. Can't seem to obtain the same results with this one. Any helpful hints from anyone that may read this are welcome. Thanks!", "Date": "May 12, 2009"}, {"Title": "Eh.", "Author": "oleg \"oleg106\"", "ReviewID": "RMKNE8I1KRE7D", "Overall": "2.0", "Content": "I briefly owned the F50fd and made the mistake of buying this one, both cameras are equally bad - good thing I was able to return it.  I've previously owned many ELPHS (now SD950) and a few DSLR cameras.CONSDesign -- the flash gets in the way, camera looks and feels cheap, interface is not intuitive or polished, uses proprietary USB cableIQ/AF -- Not great, noisy images at almost any ISO, camera is slow to AF and writeDid not work with my Transcend 150X 4GB SD card -- a card that has worked in every camera/reader (works fine with SD950) - this appears to be a known issue.Battery life is terrible.Don't have anything good to say about it, get a Canon SD950 if you're hungry for a high quality pocket 12MP camera, or get SD850 if you want to save some money.", "Date": "July 2, 2008"}, {"Title": "Waste of money. Great specs, but it doesn't happen.", "Author": "Jennie Holtzclaw \"Jennie\"", "ReviewID": "R2RGM3QXLPLQXV", "Overall": "1.0", "Content": "Waste of money. Great specs, but it doesn't happen and its a big camera, not small. I will keep it short. I have owned many Fuji cameras, I buy one each time a new model is introduced. Low light performance is poor, not any better than the prior model, maybe worst. Buy plenty of extra batteries, it has no battery life. Lots of blurred pictures despite its phony baloney image stabilization system. Sorry I purchased it, it will become a ebay item so I can move to another manufacture of cameras. Last, the charging is a stand alone unit. It was better when you could just simply plug the power direct into the camera and charge, that was easy. I guess those review these, don't really use these them in every day life. I do, PASS ON THIS CAMERA!", "Date": "August 3, 2008"}, {"Title": "FYI inquiring minds want to know, just what is in the box...", "Author": "Mtn. Mama \"Judy\"", "ReviewID": "R30I5BQ3Z5A1UP", "Overall": "3.0", "Content": "Although I do not yet have this camera in hand, I thought I would share this info with whomever else has an inquiring mind.After searching throughout the entire listing, I found that there was no mention as to what comes with the camera. So I inquired of customer service here at Amazon.com who told me they didn't have access to the information I was seeking either. But they provided me with the phone number for Fuji.The person I spoke with at Fuji, told me that ANY new purchase would include the following:1) battery2) charger3) owners manual4) software cdI don't recall if he said it comes with a memory card or not. It wasn't important to me since I have several lying about anyway.I learned a long time ago to never assume (especially when you're getting a great bargain). And I'm anxious to give this 'baby' a try!", "Date": "May 7, 2009"}, {"Title": "Another Loser from Fuji", "Author": "Trevor Goodchild", "ReviewID": "R1DAD3VR2JZN4D", "Overall": "2.0", "Content": "I have at various times owned the f10, f30, f31, f50 and now this f100...but not for long.  As I'm sure you're all aware the f30/31 is more legend then camera.The f100fd suffers from a \"pink banding\" (google: f100 pink banding) issue in the left hand side of the image which makes the camera utterly useless.  Its not clear if this is a design flaw or a problem with the first production run.Otherwise I thought the pictures it took look reasonable and look forward to re-reviewing it once this issue has been solved.", "Date": "April 8, 2008"}, {"Title": "DO NOT BUY THIS CAMERA", "Author": "J. Mcconnell \"JaneInMA\"", "ReviewID": "R3N1RX3O9LOHOX", "Overall": "1.0", "Content": "I have had this camera for 12 days and it is malfunctioning. It has a lens error which makes it impossible to use. I have treated it the same as my Canon Sd1000 which have had no issues in 2 years. Customer support from Fuji is extremely unpleasant and unhelpful. I would not advise anyone to buy this camera.", "Date": "January 29, 2009"}], "ProductInfo": {"Price": "$349.95", "Features": "12.1-megapixel Super CCD captures enough detail for photo-quality poster-size prints\n5x wide-angle optical zoom lens; Dual Image Stabilization mode\n2.7-inch, high-resolution wide-angle LCD\nFace Detection 3.0 Technology, featuring Automatic Red Eye Removal\nStores images on xD or SD/SDHC memory cards (not included)", "Name": "Fujifilm Finepix F100fd 12MP Digital Camera with 5x Wide Angle Dual Image Stabilized Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/512CmqXvVyL._SX300_.jpg", "ProductID": "B0012Y6VQA"}}