{"Reviews": [{"Title": "Early days, but already good value for money", "Author": "Justin", "ReviewID": "RMHNTZ1T6A808", "Overall": "4.0", "Content": "This is an early review (a pre-ordered camera only arrived a couple of days ago) so I've only spent a few hours using it.Quick summary - in some ways the camera is surprisingly limited, and it's a bit bulky (and very ugly), but this is overshadowed by having a built-in photo-printer at the price of a regular digital camera. It offers the instant-printing of the old Polaroids, but with greatly increased digital flexibility, and lower operating cost.With an overall thumbs-up in mind, some other notes:The camera functions are quite basic and bare-bones compared to pocket cameras today, though are more advanced than a cellphone camera. There is no zoom, just \"digital zoom\". There are too few buttons to operate camera settings on the go without navigating through menus, so if the environment isn't suited to just point-and-click, I'm likely to miss my shot, and if the conditions are too challenging (low light and high movement), I'm likely to fail to get a good shot.- The camera does turn on quickly though - it takes about two seconds from pressing the ON button to it being ready to take a shot.- Navigating your photos on the memory card is going to become a problem. Your options seemare just NEXT and PREVIOUS, and once there are thousands of photos on the memory card, that is going to be frustrating. (The ability to print any photo at any time, plus the cheapness of large capacity memory cards means that there is incentive to carry a lot of photos around in this camera)- The LCD screen is nice and large. I guess that since it's a large camera with a bigger battery because of the printer, you might as well put a well-lit big screen on it.- I haven't used the video recording or voice memo functions, so can't comment on them.- On the highest quality settings, 5MP photos are saved as JPEGs at about 700kB. So compression artifacts can be noticeable, but this is not an issue if you are only using the photos for the built-in printer.The printer... well you can read the reviews of the previous Zink bluetooth printer - it's the same as that. There are no consumables other than the photo paper. The photos are also all stickers, which is really useful. The photo-print quality is mediocre which, given the cost of the consumables and the portable nature of the device, is impressive. I'm quite pleased with it. Loading more paper is far simpler than any polaroid film camera. Simpler than a desktop printer, even.- The (Zink) paper is cheap compared to polaroid film or to inkjet printing. That's something REALLY nice - the device does not rape you on the price of the consumables, instead, prints are so cheap that you don't need to worry or second-guess yourself before hitting the print button.- You can print any photo on the camera, as many times as you like, and you have some (very) limited editing functions available. (And since for a few dollars you can put a 4GB memory card in this, you could load it up with a library of thousands of useful photos and graphics and labels that you can print and stick if the need arises, without compromising the ability to use it it as a polaroid camera)- What should be the most useful of the editing functions is being able to crop the photo before printing it, however the crop operations only zoom and step in large increments, so you can only get a crude approximation of the cropping that you want.- You can add a decorative border to your photo before printing, from a selection of pre-set border graphics. This would be an astoundingly useful feature if you could edit or create your own borders (it would allow you to include your contact info on photos, for example). It would help even if the supplied borders were less useless. As it is, the feature is as taunting in its potential as it is frustrating in its uselessness. I hope that this will be addressed at some point through software - a utility (to import your own custom-made borders to the camera) should not be difficult to provide.- The nature of the printer seems to be that colors are offset from each other by ten or so pixels, so if your image is thousands of pixels wide, ten pixels is nothing and the everything is colored correctly, but if your image is hundreds of pixels wide, the colors might be offset by a mm, which looks terrible. So it will print your photos fine, but if you're putting your own graphics onto the memory card, and they're low resolution, consider interpolating them up to photo resolution.I haven't spent much time with the accessories, but- The camera case has a useful little pocket in it for photo-paper refills.- The photo software is a bit buggy.For the price, I think this is good value with a lot of function. At the same time, it still appears to be early days - I'd expect that in a couple of years, there will be fuller-featured photo-printing-cameras that address most of the shortfallings of this first device. In the meantime, this does the job, at a good price, and hints at the future (while looking like the past).", "Date": "August 5, 2009"}, {"Title": "Everything It Claims to be, but...", "Author": "J. TOWNSEND", "ReviewID": "REKOFJPWEVZE5", "Overall": "4.0", "Content": "The Polaroid Pogo Camera is everything it claims to be. But...It does turn on pretty fast, so it is ready to take pictures with only a mild amount of anticipation. It is easy to set up. It is easy to use, but could be easier if it had a more intuitive buttonology (the manual provided is also somewhat poorly written), especially once in printer mode.  It is a 5.0 mp camera but with only digital zoom and relatively slow reaction time.  5mp digital photography was great 8 years ago.  The large LCD is great and easy to view. I haven't had any trouble with it even in sunlight.  It does use SD and SDHC cards, and with 5mp PIX, you don't need a huge card to store thousands of pictures.As a printer, you can select any of the pictures you have taken for printing (made easier with the large screen). Like the Pogo printer stand-alone, it prints 2 X 3 pictures on Zinc paper. The advantage over the printer is that the camera can do a small amount of editing internally (cropping and red-eye removal, for instance) and can print 50% more pictures on a charge than the stand-alone (which I also have). I have gotten over 40 prints without a recharge (25 is the rated number). The huge advantage is that you don't need any cables or extra accessories.  The small prints are still cheaper than the old Polaroid films (about 30 cents a print) and cheaper than my inkjet photo printers per print as well.The camera is about 3/8 in thicker than the printer alone and still fits into a shirt pocket.  It is bigger and heavier than most point and shoot cameras of today, but then again, they don't have the printer capability.The camera printer combination is a huge winner for foreign travel and for parties with kids.  It is still a huge magnet to watch the picture come out of the camera and be able to give it to the subject right away. Kids love to watch this. People who you don't know become friendly when you hand them their picture.Yes, it would be nice to get a 3X5 or 4X6 print. But it would no longer be a shirt pocket size.Yes, it would be nice to have a better camera with better resolution, better zoom, etc.Yes, it would be nice to have better instructions and be easier to use.BUT, the combination camera-printer is still a winner.JT San Diego", "Date": "September 15, 2009"}, {"Title": "Pogo Instant Digital camera is good to go", "Author": "Donna J. Karl \"Donna NP\"", "ReviewID": "R1KT1B02K5FG2P", "Overall": "4.0", "Content": "The Pogo instant digital camera that I recently purchased is fantastic! I'm a nurse practitioner and use it to take photos for mothers of them with their newborns. Though the photos are only 2\"x3\", they are borderless and can be taken close up so the photo itself seems larger.  The image is clear and mothers love these photos.  The photo's adhesive backing is an additional convenience. I highly recommend the Pogo camera and its many features.", "Date": "August 31, 2009"}, {"Title": "New and Improved Polaroid Camera", "Author": "S. R. Miller", "ReviewID": "RQ7Y173I2075R", "Overall": "4.0", "Content": "We were very pleased with this camera. Our company needed to update the cameras that we use for our corporate teambuilding photo scavenger hunts. We needed something that was lightweight, easy to use, had decent pictures and wouldn't break the bank with film. The Pogo Camera worked perfect to fit our needs. Of course we ordered them at the last minute and needed them within two days. They came without a problem.Ease of Use - On the way home in the car I put in the film strips and starting taking pictures. It was really that easy. The film is a cinch to load. I hadn' even opened the instruction book. It is just that easy to use the basic camera. What was pleasantly surprising was the wide range of things the camera can do. I mean it is still an instant camera so keep in mind it is what it is. It has the ability to use a memory card and download to the computer. The camera is smaller than the old poloroid so it can easily fit into a bag or backpack.Battery Life - we used them for a two hour event and the batteries stayed charged. We had no battery problems at all. They are also very easy and quick to charge.Picture Quality - the quality of the picture is good, better than the old polaroid. The size worked well for us. We didn't need to have 4 x 6 pictures and having the ability to download them to the computer gives you another option. They groups that we worked with liked the idea that the pictures had a sticker back to them. They were going to post the pictures on a photo board outside of their dinner function so that everyone could see themThe camera is what they advertise it to be. We were pleased with it and the photo paper. I would recommend this camera for those looking for a polaroid instant camera. I could see this being so popular for a birthday party or special event. We ordered ten cameras for our event and were very pleased. Also, they came with several packs of film strips and a nice little camera bag.", "Date": "September 29, 2009"}, {"Title": "Fun, but far from perfect", "Author": "feysidhe \"feysidhe\"", "ReviewID": "R1BZWWVHF5IG41", "Overall": "3.0", "Content": "There are reasons you buy a camera like this one, and none of them have to do with getting fabulous pictures.  The \"fun\" aspect of this camera cannot be overstated.  Kids LOVE it.  Even grumpy kids can be coaxed into a smile if you take a picture and turn it into a sticker on the spot for them.Pros:* Compact* Easy to handle* Different settings for different situationsCons:* Battery life. And this is a big one. The battery can only take about 20-25 pictures before it needs recharging.  For a \"party camera,\" that's not acceptable.* Overheats easily.  Like the battery issue, I found when I took this to a kids party that I was frequently having to wait for it to \"cool down\" before I could use it again.* Print quality.  Yeah, it's not good. The pictures aren't bad when you take them home and put them on your computer, but the prints are less than optimal.* Zoom.  What can I say?  Don't use it.  Just get as close to your subject as you can, because if you use \"zoom\" all you're going to do is create a HUGE pixelation and a blurry mess.  You can't \"zoom\" in or out--you're either in \"wide\" or \"telephoto\" and \"telephoto\" is a disaster.* Menus. This is a fairly minor quibble, but the it's hard to figure out what setting you want. It's not intuitive.Would I recommend this product?  Not as your only camera.  It's a fun toy, but not a great camera.  It might be better to get the Polaroid CZA-10011B PoGo Instant Mobile Printer (Black) alone, and use it with whatever camera you already have, if that's possible.", "Date": "July 10, 2010"}, {"Title": "Just what we needed.", "Author": "Paddy \"paddy52\"", "ReviewID": "RV9C39AAXPA8V", "Overall": "5.0", "Content": "We wanted to take a picture of our patients to include in their file for identification purposes.  After looking at several rather expensive options we decided to try a digital camera and the Polaroid Pogo printer.  It worked great for us and with the sticky back on the photo we could mount it right on the patient folder.  When they announced the camera/printer combo was coming out I started watching for its availability.  Just like the convenience of the original Polaroid it's point, click, print.We have 2 of the Pogo Instant Cameras and take anywhere from 10 to 50 photos a day.  Other than the paper being a little bit pricey (which is offset by not having to buy expensive hardware and supplies for alternative solutions)everything about the camera/printer is great for us - handy, easy to use, low initial cost.I don't think I would use this camera for vacation photos but for our need it is just perfect.", "Date": "November 16, 2009"}, {"Title": "Great for Wedding reception!", "Author": "S. Gunter", "ReviewID": "R90H0QNE4E3QD", "Overall": "5.0", "Content": "I bought this camera to use to make a picture guest book at my wedding reception and it worked great. I did plan ahead & have it located near an electrical outlet. It worked fine & took pictures & printed while it was plugged in.IT was GREAT! Picture quality is better than the old Polaroid, but not quite comparable to other photos. It's fun because it's sticky.", "Date": "November 13, 2009"}, {"Title": "All around great camera !", "Author": "Kenneth C. Heller \"invesigatorkch\"", "ReviewID": "R3U5APOGIH2C0A", "Overall": "5.0", "Content": "I have not run into some of the problems the others have complained about... where else can you have  digitial - video - instant print for one low price..... I think the ones complaining about it must work for the other guys.......  anyway I really like everything about it..... works well.... lots of choices ...... easy to operate IF you read the manuel......... sounds like some haven't....", "Date": "December 22, 2009"}, {"Title": "polaroid pogo 5.0 instant digital camera", "Author": "pook \"shop-o-holic\"", "ReviewID": "R2JZDUNI0FL870", "Overall": "4.0", "Content": "The camera is great. The only complain I have is that I wish the photos were bigger. Camera is a little bulky but that must be expected due to the build in printer. Overall, I'm happy with my purchase", "Date": "September 3, 2009"}, {"Title": "Fun camera", "Author": "A. Donaldson", "ReviewID": "R2VZ6Z26X1USOS", "Overall": "4.0", "Content": "I used the camera to photograph each couple/person that attended a wedding reception. Photo was put in sign in book by signature.  Printing was a bit slow for this use but people had fun with it and photos made a nice addition to a signature.", "Date": "August 29, 2010"}, {"Title": "Ahead of its time - Initially a Big Technogadget Bang but now a sizzle?....", "Author": "Alex \"Office of Green Army Propaganda\"", "ReviewID": "R154YCS921E2SV", "Overall": "4.0", "Content": "I have been using various Polaroid cameras for years to support geology fieldwork.  It's great to be able to take pictures in the field, print, and stick them directly in one's field notebook.  I started with the \"teenie\" I-Zone Camera but moved to the Olympus/Polaroid Camedia C-211.  The latter might have been the first and only digital camera that included a built-in Polaroid picture developer.  I saw both the I-Zone and the Camedia become obsolete when Polaroid announced it would discontinue the production of film.  Hence, I was elated to hear about the Zink-Polaroid Pogo Camera.  For what I do it is perfect.  It is MUCH smaller than the C-211 and the pictures are of much better quality.  However, as noted elsewhere among these reviews, the camera is a \"bare-back\" minimal camera - no zoom, two settings (close-up and landscape), and very little battery life (I got about 3 hours out of mine).  I have had issues getting focused images out of the \"close-up function\" - it's little improved from the point and click I-zone in this regard.If you are a scientist or engineer in need of a convenient in-the-field-prints camera this is the best it gets - however, don't expect a sleek, small, fast, high-resolution, great zoom piece of art.  It is not.I am generally surprised to see how little advertisement I have seen for this camera.  Most people have never heard of it and alarmingly, the originally flashy sales setups that appeared when it first came out have all disappeared.  Indeed, two of the major retailers here in North Carolina who slated to sell the camera no longer do (although they still sell the individual printer).  I suspect this camera might either be followed up by a MUCH more advanced version soon OR will be discontinued.I would opt for the printer-only version of this gadget (a quarter the price of the camera+printer) at this point and wait for the Pogo 2.0 - assuming there will ever be one.", "Date": "November 24, 2009"}, {"Title": "Poor photo color", "Author": "Fanny", "ReviewID": "RABG92FG1UTS1", "Overall": "2.0", "Content": "Polaroid CZA-05300B PoGo Instant Digital CameraPurchased this camera in May 2010.  Pleased, at first, with quality of photos and ease of operation.  However, photos now print with yellow tint.  Have tried to contact polaroid support via phone and email with no response.", "Date": "December 8, 2010"}, {"Title": "A Good Product for a Good Price", "Author": "Cmpkittykat", "ReviewID": "R1C1QSU0T0APDV", "Overall": "4.0", "Content": "For a point-click-print device, something unavaible elsewhere, this does exactly the job.  Though it was much larger than I expected, this is a minor detail compared to the delight that accompanies point-shoot-and-printing.  I use it in the field as I sketch to capture small moments and stick the film directly in to my book.  It usually can print up to five or six in a row (one right after another) before needing a minute or two to cool down, which, to be honest, is perfect, cause you rarely do this.My only suggestion is to get a memory card to add in to it, otherwise you'll only be able to store like 10 pics max.But for the price, it is a perfect product and a lot of fun.  It is not a 'serious' digital camera, for those of you who are looking for HIGH HIGH quality images, but for the purpose it is design to serve, its fantastic.", "Date": "August 13, 2010"}, {"Title": "unsure", "Author": "lilddock", "ReviewID": "RHIJ218JZM8NC", "Overall": "3.0", "Content": "As soon as I saw this camera I wanted it. It is a very good idea for a camera but there are some things you should know before buying it. IT IS BULKY. It is HUGE I knew from other reviews that it was kinda big but when I got it I was shocked. Make sure you actually read about the size and all of that which I obviously did not. It takes pretty good pics and they prints are okay so far, they kind of had a blueish ting though.Overall I like it but i'm still unsure. If you are unsure about buying it online I would suggest looking at it in person then decieding. It has not proven itself worth the money yet.", "Date": "April 30, 2012"}, {"Title": "Digital Camera", "Author": "Beckorita \"Teacher and Mom\"", "ReviewID": "R3NPAIY7AZPAMN", "Overall": "5.0", "Content": "Love this camera...my daughter wanted a camera that \"wasn't ugly and big like the original polaroid cameras\" (she is 13 years old) and we discovered this product on-line.  The pictures are very clear and although small, it is a fun camera to use.  I bought her a scrapbook to go with it and since the pictures are stickers, she is able to print and make a scrapbook page immediately.  I like that it is digital so you aren't printing bad photos.", "Date": "January 12, 2011"}, {"Title": "Way underrated camera. Love it!", "Author": "Pupsqueak", "ReviewID": "R2SPKW5D5BDXYO", "Overall": "5.0", "Content": "After reading other reviews of this product I crossed my fingers and ordered it. Well, I was not disappointed! It is a GREAT point and shoot and very fun to use. The picture/print quality was pretty darn good! Far better than what I read in other reviews. You simply have to know what you are buying and what to expect.If you are looking for the most compact point and shoot with the greatest megapixels then this in NOT the camera for *you*.The 5 Megapixels this camera has is more than adequate for normal print size (do your homework on the \"resolution myth\" regarding megapixels) 5 Megs are more than adequate for the 2x3 mini prints that this camera produces. Also the cost of each print for me currently was only 25 cents apiece. Not bad and very comparable to normal digital printing (how many 8x10 sheets of photo paper have been wasted on small images? And what does that cost you?) Plus, you still have the ability to use PC interface to print larger if you wish. The physical size of the camera is slightly larger than most compact digitals currently available but not uncomfortable to use (I'd say about the size of a small paperback novel), but considering the printer is built in.... it's very compact indeed! I felt the menu was extremely user friendly once you went through the features a few times. In my opinion, this camera has been way underrated because too many people didn't know what they were buying and expected something different. I love it. Fun to use, teens should love it, with lots of applications for the great quality 2x3 pics. The instant gratification of a print is priceless and much like the old Polaroids. I hope this product succeeds because it's a great format.", "Date": "December 11, 2010"}, {"Title": "Good as advertised", "Author": "fritoboat", "ReviewID": "R2U0WYYAA7A3F9", "Overall": "4.0", "Content": "I purchased this as a gift for my sixteen yr old step daughter. It is definitely not the best camera on the market for the price. The photo prints are on a small 2x3 format, and average at best. However, I knew this going in to the purchase, and couldn't pass up the neat factor of the instant print. The camera was received with extreme giddiness. After a couple test photos, the internal memory was full, so off to the store for a 4g SD card, and some more Zink paper. Even though the camera is large, and boxy, she loves it and has already started using the camera for everyday moments. Its not a 14mp camera, nor a high end photo printer, but it is exactly what she wanted, and she can't stop smiling for the camera.Polaroid CZA-05300B PoGo Instant Digital Camera", "Date": "July 21, 2010"}, {"Title": "WOW! Very impressed!", "Author": "Lois Suh", "ReviewID": "R93MH15ML7WUR", "Overall": "5.0", "Content": "I recently purchased the polaroid pogo instant digital camera and I have to say that it is one amazing device. I switched from a canon digital camera to this and I regret not having done it sooner. The camera is actually much smaller and lighter than I was originally expecting. The picture quality is pretty amazing. I use the camera to take pictures of my mom's agriculture and the various growth status of her vegetation. The pictures come out amazing and the instant pictures are the best part. I can print the pictures out instantly and scrapbook it. I bring the camera everywhere!Also, I am planning on purchasing the fujifilm instax mini 25 within the next month or so. I will write another review comparing the two cameras.", "Date": "May 17, 2010"}, {"Title": "Great fun - poor print quality", "Author": "U. Unrath", "ReviewID": "R3TBIPSDJ2JD4I", "Overall": "3.0", "Content": "My wife wanted an instant camera for Christmas. I didn't want to buy an original Polaroid as it seemed to me a step backward and the prints were very expensive.When I found this camera I was skeptical at first but bought it because of the good reviews.Trust me, this camera is a lot of fun especially if you have kids. There are so many occasions when you just want to take a snapshot, print it out and (because the prints are adhesive) stick the picture somewhere. The quality of the pictures and especially the prints leaves lots to be desired. This is an expensive but fun-filled toy.Pros:Easy to operate.Zink technology is clean and leaves no mess.Prints are cheap.Super fun!Cons:Print quality disappoints (the colors are distorted and oftentimes show stripes in the printout)Image quality is mediocre at best.On-board memory is pitiful - you really need an extension card. Then again, since the images are not of great quality we discard them quickly after printing (no need to keep them given the poor quality)", "Date": "May 1, 2011"}, {"Title": "Great Camera!", "Author": "L. Broyles", "ReviewID": "RCHEXV66MXYDE", "Overall": "4.0", "Content": "I wanted a good camera for pictures to take of my grandson! I love it and I can even print some pictures off for his mom to take home when we catch him doing funny stuff! I wish it printed bigger pictures but the picture quality is great!", "Date": "February 6, 2010"}, {"Title": "If You Want a Taste of the Vintage Polaroid Experience it Is Here!", "Author": "Samuel J. Perry", "ReviewID": "REFLK04REF2ZV", "Overall": "5.0", "Content": "If you are looking for a slick digital camera, look elsewhere.  If you are a Polaroid fan, or want to be, this camera is your new best friend.  First of all, the camera is relatively bulky. If you have seen the Polaroid PoGo printer, this camera/printer combination is about 1/3 thicker.  It will not work well in your shirt pocket.  As for the electronics of the digital camera itself, it is very reminiscent of the earlier digital cameras.  The LCD screen is not terribly bright, making it difficult outdoors on a sunny day.  The menu provides choices that modern digital cameras generally handle automatically, but that's all part of the experience.  When you review your photos, you will wonder about the quality but when you see them on a large, crisp, computer monitor you will probably be pleased with the 5-megapixel digital images.  So, first, realize that this is a digital camera, capable of supporting an SD card with a size of 4GB which can hold thousands of pictures this camera creates.  Note also that the camera shoots video clips which  are of acceptable quality although the sound leaves much to be desired.  Now that you know this is a camera, recognize that it is also a printer.  While you never have to print a picture, if you choose to, it produces  photos 2x3 inches with a water-resistant glossy finish.  These are rugged little business-card sized photos.  Unlike the original Polaroid, you can now shoot a number of pictures, select your favorite, do some minor editing within the camera it self, and print the image.  If you like what you see, you can print as many copies as you like.  I remember wasting so much film with my Polaroid years ago, but this camera allows me to view the pics and even edit them, prior to printing anything.  The cost of the photo paper (called ZINK - for Zero Ink) is quite inexpensive.  You can find it for about 33 cents per photo if you shop around.  Since you only print your favorite pics, I suspect that a pack of 100 sheets will last quite a long time.  Bottom Line:  Like I said earlier, if you want a state-of-the-art digital camera, go elsewhere.  If you want a nostalgic trip into Polaroid land, grab this camera.  Despite the rather primitive digital camera, the less-than perfect prints, and the clunky size, I love it.  I have my Nikon for when I want to get serious, but when I am just looking for some fun and sharing the Polaroid magic of an instant photo with others, I grab my Polaroid.  This should not be your first camera, unless you are a child, but if you already have a nice digital camera, this will be a fun addition to your collection.  That's why I give it five stars because it lets you relive the Polaroid experience.", "Date": "April 11, 2012"}, {"Title": "old school gameboy size camera", "Author": "J. Vignone \"Djangotheclown\"", "ReviewID": "R2NTR7LMD64UVW", "Overall": "3.0", "Content": "I bought this camera about a couple of months ago, I didnt expect it to be so huge when i opened the box for it, but I put its size in the back of my mind and tried it out anyways, I am a bar hopping kind of person, this thing is way to bulky for the back of my pocket and people were asking me if my camera was from the 80's.I like the fact that it has a built in printer but like people have said before me the size of this camera is way to big. It remains in the house for whenever we have house parties and I use it indoors for that mainly now.", "Date": "January 23, 2010"}, {"Title": "I bought two cameras on Amazon and both stopped working within five months", "Author": "Junior of California", "ReviewID": "R2C5HY22V6P40E", "Overall": "1.0", "Content": "This is a great camera when it works. It is a digital camera and it prints within a few seconds. The problem is this camera does not last very long. I used this camera for about three months and it completely stopped working. The camera simply would not turn on. At first I thought the problem was the charger. I bought another charger for it and learned that the cherger was not the problem. I really liked this camera so I bought a second one (thinking mine was just the \"Lemon\") I had the same problem with the second camera. It worked for about five months until it stopped working. Note: I purchased both cameras on Amazon. I recommend to save yourself the headaches and money aswell.", "Date": "July 6, 2013"}, {"Title": "Polaroid Instant Digital Camera is great for family fun!", "Author": "Reviewchatgirl32", "ReviewID": "R3UYUY21LRL1Z8", "Overall": "5.0", "Content": "Polaroid Instant Digital Camera with ZINK Zero Ink Printing Technology Z230E is a great portable camera and is great for trips on the go. I was impressed how this camera was super fun and provided many hours of quality sharing with my family. I like how this Polaroid digital camera was able to print my pictures off within a minute and was able to be used for my scrap-booking hobby. My children also had fun with the adhesive, sticky-backed photo paper which was great in making greeting cards. I would highly recommend this product to anyone looking for a great little instant camera that is affordable and ink free!", "Date": "November 16, 2011"}, {"Title": "Nostalgic Camera!", "Author": "Lawork4me", "ReviewID": "R3OR610Z9MCQ0C", "Overall": "5.0", "Content": "I must admit that I have read some of the other reviews and was surprised because I really love my new polaroid instant digital camera. It is fast, the photos are flawless and I really love the part of being able to put them into a photo album. It's has a bit of the future and a bit of the past combined into one camera. Others described it as bulky but considering that it prints your photo what would one expect? I think it is just the right size and wouldn't trade it for anything. Thanks!", "Date": "November 16, 2011"}, {"Title": "As Advertised", "Author": "Wayne", "ReviewID": "RS75RXV8FLZB1", "Overall": "5.0", "Content": "The camera is small enough to carry in a purse or on its attached tote strap.  The picture and print settings are easy to understand and adjust; and settings do make a difference in picture quality, brightness, etc.  Colors are vivid and true but also can be adjusted to your preference.  Printing is as easy as one click and a 30 to 40 second wait.  There is no picture smearing or smudging. It is fun and easy to use!!", "Date": "January 5, 2011"}, {"Title": "Pogo Go Go (Please)", "Author": "Pub. Def. \"Pub. Def.\"", "ReviewID": "R2W6U3NW8U6U92", "Overall": "1.0", "Content": "My dear wife bought this for me as a holiday present. I thought it was pretty cool at first being modernly retro, sticky back photos and all that. Unfortunately it quickly wore out its welcome. The resolution of the photos is terrible. The printed photos are tiny and not very good. It would spit out numerous blank sheets instead of the desired single photo. If that wasn't bad enough it kept giving the message to \"wait while cooling down\". The last straw was a couple of days ago when between the non-printing, spitting out 4-5 blank photos and the wait message it took over 15 minutes to finally get the one shot I wanted to print. This thing is just not ready for prime time. Back it go gos like a pogo.", "Date": "January 7, 2012"}, {"Title": "Something is wrong with the price!!", "Author": "alonrishi", "ReviewID": "R2S60IJLR3W461", "Overall": "2.0", "Content": "The price for this Polaroid poGo as listed here is $499.However, on the Polaroid website, the camera is $199.", "Date": "May 11, 2011"}, {"Title": "Polaroid Instant Digital Camera with Zink Zero Ink Printing Technology", "Author": "Catherine H LeGate", "ReviewID": "R1NO7MVQ386S68", "Overall": "5.0", "Content": "The camera was purchased for my teenager for Christmas. She loves it! Especially because the pictures are printed instantly! The quality of the pictures is wonderful and a lot better then the old polaroids of the 1960's! The only downside is the photos are a lot smaller then the older cameras. But the picture quality makes up for the size!", "Date": "October 6, 2013"}, {"Title": "great gift", "Author": "Annemarie", "ReviewID": "R52IQDUUNUS3S", "Overall": "3.0", "Content": "I purchased this as a gift, about 5 months ago. The quality of the printed photos was not great, although that could be a fault of the paper used, which was not purchased directly from Polaroid, so may have been damaged. The camera is big for today's standards (twice the size of what other cameras are), and the photos taken are not good resolution if you plan on printing them in a larger format than what the built-in printer can handle (even just 4x5). That being said, the camera functions as expected and the technological innovation definitely makes it a great gift. It's also a gift that \"keeps giving\", as the photos make great vacation souvenirs to give away to friends, especially it is great to put a smile on the faces of kids and grandparents. Once the novelty wears off though, you realize that this is not necessarily a product worth purchasing for yourself, at least in my opinion.", "Date": "August 22, 2012"}, {"Title": "Polaroid Instant Digital Camera", "Author": "Dotfak Review", "ReviewID": "R1ZN2HISYB6IOJ", "Overall": "5.0", "Content": "This camera is a mobile easy to use camera that will work just for what you need it for and where you need it. It brings clear images and it is very useful", "Date": "December 1, 2011"}, {"Title": "Old Stlye with a twist", "Author": "AustinB", "ReviewID": "R1QI1HLCNX3ZG9", "Overall": "4.0", "Content": "Its a great tool, too bad the battery really suck! I like it for its ability to give instant print, great for scrapbook.", "Date": "November 30, 2011"}, {"Title": "My First Camera", "Author": "Moses Jones \"Broken Blade\"", "ReviewID": "R3F6R3830FNKME", "Overall": "4.0", "Content": "This is my first camera. I like that it is very simple to use. The pictures that it takes are lively and vibrant. This camera is definitely worth the price that I have paid for it.", "Date": "November 28, 2011"}, {"Title": "My New Camera", "Author": "lauralove", "ReviewID": "R5JVTQAENRI7I", "Overall": "5.0", "Content": "I hv lots of puppies and take lots of pics.  I needed a new camera and this Polaroid Instant Digital Camera was just what i needed.  I love the printing Technology......wow!  The color is great on the pics and my pups look great when I download the pics online.", "Date": "November 16, 2011"}, {"Title": "Polaroid POGO", "Author": "happyshopper", "ReviewID": "R3HK9W4DN9J6DX", "Overall": "5.0", "Content": "This camera is compact enough to carry in a purse. It is functional enough to allow you to have immediate photos or enables you to save your photos and print later. Print size is only 2\"x3\" but photos can be saved to a disk and printed through another printer in larger sizes. Exactly what I was looking for.", "Date": "December 28, 2010"}, {"Title": "Gray Market: BAD seller.", "Author": "Rico Salomar", "ReviewID": "R366X73UEFDB0Z", "Overall": "2.0", "Content": "Bought this from Adorama. Beware: this is a gray market product, and does not include a cable to charge the battery in North America.Now I'm stuck on Christmas morning with a very expensive present for my daughter that she cannot use.Infuriating and unacceptable.", "Date": "December 25, 2010"}, {"Title": "camera", "Author": "sheila", "ReviewID": "RDDJI2OHFC372", "Overall": "3.0", "Content": "I loved at first but then after about 5 or 6 pictures it said I had no memory left. It should come with more memory.", "Date": "October 8, 2012"}, {"Title": "Good quality for a toy", "Author": "José Santana", "ReviewID": "R6JP6D5J8UD56", "Overall": "4.0", "Content": "In general it is a good product for the price.Four Stars: The duration of the battery is low. In some prints are not color lines, and the paper is not cheap.", "Date": "September 21, 2010"}, {"Title": "very convenient, and fun", "Author": "Moshe Miller \"part time contractor\"", "ReviewID": "R2ZV2HLHPL4AZE", "Overall": "5.0", "Content": "This is not your typical digital camera, but it really cool. theres nothing like printing the picture on the spot. seeing it on the screen doesnt cut it for me, so i like this camera alot!", "Date": "April 20, 2010"}, {"Title": "Had to return camera", "Author": "donna finn", "ReviewID": "R2V39NILJ1D236", "Overall": "1.0", "Content": "I had to send the camera back because the brightness button does not work.  When you look at the screen you cannot see anything.  Very disappointed!!!", "Date": "January 6, 2013"}, {"Title": "Poor workmanship", "Author": "Kathleen J. Kravitz", "ReviewID": "R2B2DHIWZIRBO8", "Overall": "1.0", "Content": "I own the Polaroid Z230E.  It is the second one I bought. I use the camera to give photos as gifts when I travel to remote areas.  My first camera's focus broke this past January 2012 in Southern India.  When I returned I bought another as I knew I would want it on a subsequent trip to Southeast Asia.  I brought the new camera with me to Cambodia where it works only intermittently.  It shuts off after one or two prints and will not restart until back in my air conditioned room.  I have three batteries and changing batteries did not help.  The camera may be affected by the heat. In any event it is useless for my purposes.", "Date": "December 6, 2012"}, {"Title": "Review", "Author": "Dawn N. Bundick", "ReviewID": "R3564OWPFI7VHI", "Overall": "3.0", "Content": "Not ideal for printing a vast quantity of photos at one time. It tends to overheat and then won't print out for up to 2 minutes. The pictures are also very small, good thing is you can take horizontal or vertical pictures. Not at all what I expected.", "Date": "January 11, 2010"}, {"Title": "It's Okay...", "Author": "tmhiester", "ReviewID": "RSNZD1YGTDCNG", "Overall": "3.0", "Content": "It is a great idea, but needs work.  The printed pictures are too small and the picture quality could be a lot better.Polaroid CZA-05300B PoGo Instant Digital Camera", "Date": "November 29, 2010"}, {"Title": "Polaroid PoGo", "Author": "Ponavis", "ReviewID": "R130GQT1WGBSHM", "Overall": "2.0", "Content": "Too bulky and doesn't have the feel of a real Polaroid. It is a lot bigger then the pictures appear and it feels as if you just bought a first generation digital camera.", "Date": "October 31, 2011"}, {"Title": "the battery is very bad quality", "Author": "Yaoyu Chen", "ReviewID": "RWCBBB9QZG91Y", "Overall": "2.0", "Content": "Battery life is very short. Only can take about 10 pictures. Picture quality is poor. It is not stable. I won't recommend anyone to buy it.", "Date": "October 9, 2009"}, {"Title": "Rip off and unresponsive", "Author": "Cathi", "ReviewID": "R25035VAV9FMVA", "Overall": "1.0", "Content": "I ordered a Polaroid with all the accouterments almost a year ago.  Used it once then put it away until my next vacation.  When I took it out the charger did not work.  I went and purchased a charger for it and it still did not work.  I contacted the seller who gave me a phone number for Polaroid.  I called the number and they only have recordings saying to contact the manufacturer, but provide no name or phone number for same.  When I went back to the seller on this they just provided polaroids number again.  When I called the seller I was placed on hold for over 15 minutes when I finally had to get off the phone.  This is a sham in my opinion and I would warn anyone against using this company as they fail to be truly responsive.", "Date": "February 24, 2011"}, {"Title": "zink", "Author": "missyfox64", "ReviewID": "R14U9ESWOTKJ4X", "Overall": "3.0", "Content": "i have not bought this but i do have the printer. i know some reviews are commenting on the wieght of it....... its zink, so it will be a heavier camera.", "Date": "November 22, 2011"}, {"Title": "Waste of money", "Author": "LSDP \"LSDP\"", "ReviewID": "R3EVI41C0EFO6Y", "Overall": "1.0", "Content": "The camera is so bulky, the prints are too small & have bad quality. What a waste of money. I thought I'd be able to save by printing straight from the camera instead of via my regular printer, but I'd rather do the latter because you compensate for the quality with this ugly item.", "Date": "October 10, 2010"}, {"Title": "Can't Review it Yet?", "Author": "Tracy A Sebastian", "ReviewID": "R9RD1Y29MXVSJ", "Overall": "1.0", "Content": "Why can't I review this yet, you may ask. Because I live in the US. Ordered from Amazon US. It arrived with a UK plug. I can't charge it to try it. Oi.", "Date": "May 3, 2011"}, {"Title": "The worst camera in the universe!", "Author": "Susin Garcia \"It Finder\"", "ReviewID": "R28IREBZGSF54E", "Overall": "1.0", "Content": "I went on an International 2 week vacation of my lifetime and made the HUGE mistake of taking this camera along! This is truly the worst camera I have ever purchased. I am now stuck with no pictures and this gigantic VCR sized camera and an 80 pack of Zink paper. Trust my words. Do NOT purchase this camera. Terrible picture quality, bulky, minimal fun frames to choose from...The list goes on and on. I'm disgusted that this was even approved for sale! Total junk!", "Date": "August 14, 2010"}, {"Title": "poloroid pogo", "Author": "Ahuva Horowitz", "ReviewID": "R247AH286VXL4", "Overall": "1.0", "Content": "The camera is very cool and the pictures come out nice bur I am very dissapointed in the size of the camera. In this day and age when cameras come as small as to fit in your pocket this enormous camera feels like it was created in the 70's. Not to sound paranoid but as with other new products I have a funny feeling that a slimmer and smaller version is slready prepared so Poloroid acn reintoduce the \"new and imrproved\" version next holidy season. For those of us who got suckered into buying this one? Too bad, huh?", "Date": "October 4, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Digital camera with integrated printer instantly delivers full-bleed borderless images that are dry to the touch\nFeatures automatic image quality optimization with water-resistant, tear-proof, smudge-proof and peel-off prints\nPrints 2 x 3-inch borderless color images in under a minute\nPrint speed: 60 seconds per print, from snap to share\nAccessories Included: 10 sheets Polaroid PoGo ZINK Photo Paper, rechargeable lithium-ion battery, AC adapter/charger, USB cable", "Name": "Polaroid Instant Digital Camera with ZINK Zero Ink Printing Technology Z230E", "ImgURL": "http://ecx.images-amazon.com/images/I/411PFRzPMdL._SX300_.jpg", "ProductID": "B001RIYUJQ"}}