{"Reviews": [{"Title": "Excellent", "Author": "Christo \"CJK\"", "ReviewID": "RY9Q6F4FTEH8F", "Overall": "4.0", "Content": "The resolution and size of the screen on this camera is absolutely incredible. Pictures and video look really sharp. Screen is anti-reflective too. HD video is outstanding. Taped a table tennis match, the video and sound were both extremely clear and the movement was incredibly smooth, due to the 30 fps. I am not so impressed with camera's auto mode, while indoors, yet.  Colors were off, maybe due to the white balance and low light. I find myself using the \"P\" mode mostly and making small adjustments to the white balance and adjusting the \"my colors\" section.  Overall its a beautiful looking camera and feels good in the hands. I like the two tone color scheme. You have to watch your fingers, on your left, hand so they don't block the flash, it's very easy to do.Update: Digital Zoom.Most people advise you to disable digital zoom because of the resolution degradation when using it, however on this camera the digital zoom is fantastic, with very little resolution degradation seen and digital zoom can be used while in Video mode.Update Foliage Program mode,8/2009:I have been using the foliage mode for outdoor scenic shots lately.  In this mode the greens, blues, are brilliantly enhanced making scenic pics pop out with bright color, some may like or dislike for the colors do not represent the true colors viewed.  I like this mode,  especially if the light your shooting in is not right, this mode will brighten the colors and make your photo less boring.  I recommend previewing each shot before you move on to make sure the colors are not too saturated. I found that as the light changes this may happen.Update: March 2010Get the Canon S90, much, much better camera than the SD970,.  The S90 also has low light sensors that make any indoor picture almost perfect.  With the S90 you get professional results!", "Date": "April 16, 2009"}, {"Title": "SD970 or SD960", "Author": "L. Yang \"Dragon\"", "ReviewID": "R3LXH1987OUZ7K", "Overall": "5.0", "Content": "This review is to help those who are deciding between Canon SD970 and Canon SD960..................SD970......SD960......CommentOptical zoom...5x..........4x..........PlusLCD size.........3\"..........2.8\"........plusLCD dot ......461k........230k.........Big plusZoom Blur......yes ........no..........noThe 5x optical zoom makes the picture 50% larger. So, I think it is a worthy improvement. However, it is offset by the wider angle lens of SD960.The LCD size and resolution are a very worthy improvement. Although it is 3\" vs 2.8\", the actual screen sizes are quite different because SD970 has 4:3 aspect ratio and SD960 has 2:1 aspect ration. For normal 4:3 pictures, SD960 can only use 2/3 of screen to show the picture while SD970 uses all screen. With twice many pixels, you can view the pictures quite well. It is almost better than most of small stand-alone picture frames in the market. I actually can use SD970 as a very comfortable reading glasses for the fine print on the medicine bottle. I played one SD960 in a store and I can not see whether the picture was in focus very well.The zoom blur did not produce great pictures, although it was fun to do.I think the price difference (~$65) is a little bit large for the performance difference. But, I do enjoy the differences.Other comments:(1) mini-HDMI cable: I was not aware how great the HDMI feature is until I bought one cable from a local store. It is a great experience that many people can view the slide show and HD video on your HDTV. Although I complained about how expensive the cable was. But, the experience justifies the purchase of the cable. I bought a cheaper 3rd party HDMI cable and it works well.(2)Sound quality of HD video:I guess Canon engineers just did not have room to put the microphone at the front surface of the camera, they put it on the top which can be easily covered by your fingers. But, the more annoying issue is that, because the top surface is tilting backward, your voice becomes much louder than the people in front of you. In addition, you need to make sure your hands do not rub the camera when shooting. Otherwise, noise will be generated.If you zoom when shooting video, the camera performs only digital zoom. And, it will record a quite noticeable noise when the zoom action stops.Overall, I still rate this camera 5 stars because it is well designed and built. The user interface is better than my 4-year-old Canon S3 IS and isfar better than other brands.Finally, it was very amusing to see how hard my brother-in-law had to try to prove his >$5000 Canon 5D dSLR is still a far better camera than this little thing. Yes, my SD970 lost in most of picture quality categories. But, it did not lose without a decent fight. At the end, my sister-in-law is thinking of buying a SD970. So, it lost a battle but won a heart!!SD970 is a camera for two person, one want to just point and shoot for precious moments and one wants to use the program mode to make great pictures.", "Date": "May 14, 2009"}, {"Title": "Wonderful results; just be patient with the manual", "Author": "M. Stewart", "ReviewID": "R234T2NGRXYS56", "Overall": "5.0", "Content": "First off, be aware this camera comes with no memory card, so unless you want to be like the kid that got a battery-powered toy for Christmas, and no batteries, plan ahead!  Also, the A/V cable included is for standard RCA video inputs, which is fine, since almost everyone has something to plug that into, but for the HD output, you'll need the optional Mini-HDMI Cable.  I've tried both cables, and if you have an HD TV, you'll want the HDMI cable.The manual is pretty brief; it omits some information such as how to set the \"owner name\" in the camera (hint: use the \"Camera Window\" software and click on the magic icon in the upper right corner), and how to upload custom startup images and sounds for the camera operations.  The manual was obviously not proofread by a native English speaker, and many parts tell you what a setting is, but not how to get to that feature.  There appears to be about 3 different types of menus, depending on the mode.Now for the neat stuff!  There are 3 modes, video, camera, and auto; the main differences between camera and auto are that auto mode trys to figure out everything; and does a pretty good job.  Portrait?  Landscape?  No problem.  The camera mode lets you fiddle with everything, and has several preset modes for common situations, and for fine-tuning things like white balance, and ISO speed. These various \"Program\" features have an auto-preview of the effect when browsing through the menu choices, which is a nice touch.You cannot set aperture priority nor shutter priority, but you can give it some hints to approximate this; there is a \"kids & pets\" mode that obviously is high shutter speed priority.I've taken about 100 images in the last couple days, and have been very pleased with the results.  The digital zoom image quality is fantastic.  I needed to use a tripod on a cloudy day when the effective zoom was 20x, but the resulting image showed no jaggies at all.  The macro focus worked so well, that when I tried to move the camera a little closer in, the lens hit the sidewalk!Viewing photos and videos on the camera is pretty easy.  It will automatically group photos into categories based on the auto mode (portrait, etc.) or you can put photos into categories manually, to filter what you want to see.  The \"shake\" method to advance from one photo to the next didn't work too well for me; I had to give it a pretty good shake, and I couldn't seem to have it go backward.  The auto-rotate feature for viewing photos taken in portrait orientations works great.The video function works easy and you can upload the videos to your PC (in .mov format), and the software can convert it to .avi format also.", "Date": "May 2, 2009"}, {"Title": "Canon SD970IS Highly recommend - Great Point & Shoot", "Author": "Joshua D. Daniels \"J.D.\"", "ReviewID": "R1G8FC8ZL540WB", "Overall": "5.0", "Content": "I bought the SD970IS camera after weeks of doing research online and physically going to electronic stores to view the cameras in person. The three cameras that I was choosing between were the Canon SD780IS, SD960Is and finally decided to buy the SD970IS and here's why:When I started looking I first read reviews on cnet.com and amazon.com. Cnet.com gave all the models a good to very good rating, however they didn't like the price to feature ratio with the SD970IS but everything else was great. The retail price for the SD970IS is $379.99 and I guess based on that price I would have probably not bought it, but as always I researched the pricing online and amazon.com once again had the best price at the time which was [...]. At the time everyone else including buy.com, bestbuy.com and even ebay was selling it for close to full retail.I previously owned a Nikon S50c and it worked fine it just seemed like a camera that you had to \"baby\" and didn't fit comfortably in your hands. The SD970IS is not as compact or slim as my old Nikon or the SD960IS or the tiny SD780IS but it can still be placed in a pocket. The most important thing is however that it feels great in your hand and doesn't seem fragile like the Nikon or the SD780IS.I've been using the camera now for a couple of weeks and so far here's my list of pros & cons (very few):PROS:1. 3.0 LCD inch display with double the resolution of all three cameras.2. HD Video is amazing with HDMI out3. Picture quality is amazing including the 5x optical zoom and even the total 20x digital zoom is great.4. Battery life is much better than any other cameras I've owned (approx. 250 shots)5. \"Blink\" indicator that works great if someone blinks6. The auto feature on the camera (I know that some reviews state that this function doesn't work very well, however I never take it off this setting because it adjusts to every shot automatically and I haven't had any issues with picture quality in this mode.)7. Menu navagation is very simple and straightforward.CONS:1. Slightly bigger than I'm use to but still very compact2. Noisy when zooming in and out (may be due to 5x optical zoom)", "Date": "July 10, 2009"}, {"Title": "almost a great camera but better options available", "Author": "R. Lutz", "ReviewID": "R3LZB6VZ6SFEQQ", "Overall": "3.0", "Content": "I am a big canon fan and have been patiently waiting for the release of the SD970 since canon's announcment prior to the 2009 PMA.  In the following review my basis for comparison is the new sony w290 and my experience owning a canon SD700.  I sent the SD970 back to Amazon after using it for about 1 hour.What is good:1.Great screen2.Solid feel, amoung the best I have seen for an ultracompact3.Picture quality is the best of the ultra-compacts that I have seen4.You can program one of the camera buttons to perform functions as you wish.  I used this feature to start the video modeWhat is not so perfect:1.After focusing, there is an annoying delay when pushing the take picture button.  So when you have that perfect moment when your kids are finally smiling and push the button you have to wait about a third of a second.  It does not sound like much but it is the difference between getting a great photo and an okay one.  The picture quality is outstanding, but if you can't capture the moment - it just does not work for me.  The sony w290 which does not take the same consistant quality of pictures does react much faster.2.Filming in HD.  The camera allows you to zoom in and out but when playing back the clip you can hear a significantly irrating sound similar to someone eating potato chips right next to you.  This is not cool and was a big disappointment.  (the sony w290 does not allow any zooming - if you assume that having the ability to zoom and an annoying sound is better than not having the ability to zoom - you'd be wrong, its that annoying)3.There is no continous shooting mode while in the Auto-everything setting.  So if you are like me and like to hold down the capture button to make sure take a few photos - you are out of luck.  The sony w290 lets you do this.SummaryGreat photo quality, but disppointing delivery.  My personal conclusion and recommendation is to purchase the sony w290 (basically the same features), which does not take quite the quality of pictures but will allow you to snap photos in continous mode and much faster response times on snapping photos.", "Date": "April 16, 2009"}, {"Title": "Great camera", "Author": "Myron R. Grover Jr.", "ReviewID": "R3G915SBQE5EZ2", "Overall": "5.0", "Content": "I wanted a camera with great image quality, HD movie capability, pocket size, more than 3x optical zoom and very good image stabilization.  The SD 970 IS does a great job meeting these criteria.  The photos are of superb quality (typical of Canon cameras).  I can crop and blow up an image with little loss of quality.  The 5X optical zoom functions smoothly.  I would prefer 10x zoom but the 5x is adquate.  Actually, on a bright sunny day the digital zoom  (20x) works reasonably well.  The image stabilization is rock solid.  The 720 HD video is very good.  I have a Mac and I use iMovie and Quicktime to edit the video.  The camera doesn't allow one to use optical zoom during movie taking. You can zoom in on subject before shooting using the optical zoom to compose and then shoot the movie without loss of image quality.  You can use the digital zoom while shooting movies but the image quality decreases. There was no bothersome noise while playing back a movie. I am most pleased with the size of the camera.  It fit easily in my pants pocket.  However, I found a small leather carrying case on eBay that I like very much.  The case orients horizontally on the belt and the camera fits snugly in the case and it has a very tight fitting belt clip and a magnetic lock to secure the camera.  [...]This camera has many extra features that you can read about but I wanted to focus on my basic needs. There were several aspects of the camera that could be improved.  The LCD screen is hard for me to read in bright sun light.  However, the screen images are sharp, bright and true in normal lighting conditions.  Finally, I would have liked an optical zoom that works during movie shooting.  All in all, I love the camera and and highly recommmend it.", "Date": "May 11, 2009"}, {"Title": "Another Solid Product from Canon. Don't be Fooled by It Point and Shoot Label!", "Author": "Charlie Brown", "ReviewID": "R3QHQXYBPON84B", "Overall": "5.0", "Content": "I was on the market for a while looking for a replacement to my four years old Canon SD320 Digital Elph, which after many years of solid performance just started to show it was way behind on all the advances on sensors and overall improvements coming from the booming of the digital camera market over these years. The SD320 was my first digital camera after playing around  for years with a Canon Rebel EOS SLR film camera which took amazing pictures but not only it wasn't digital but it was not also that practical to carry aroundMy initial feeling was to go back to the SLR days thinking the advances on digital cameras would allow me to find a great but not that bulky or heavy camera -at least not heavy for my standards- that I could carry around without much trouble. I didn't want to carry a big lens so my first consideration was a Canon G-10 or G-11, which I considered a nice mid-range SLR, not too big, not a victim of the known limitations of the point and shoot cameras. I was lucky to being able to use a G-10 a very good friend that uses it as his `pocket camera' (you have to see the lenses he has on his other SLRs) lent me for a few weeks. Even if I was very impressed with the capabilities of the G-10 and the amazing pictures I got from it, I realized I wasn't ready to carry a camera this big around and wasn't really into the aperture/shooter speed/etc ordeal I once enjoyed with my old SLR. Even by giving away all that flexibility and realizing I probably wouldn't be able to take professional-like pictures, I decided I wasn't ready for something bigger than a point-and shoot. I also wanted a camera I can hand to my wife in auto mode and still take great picturesBeing a long time Canon user, I started with a Canon but didn't neglect other brands. After doing plenty of research and looking at the advantages and disadvantages of its competitors from Fuji, Sony, etc, I decided Canon was still good enough even if it was behind brands like Fuji on sensor capabilities according to many credible sources. I gave Canon the benefit of the doubt and decided I was going to stick with a brand of camera I knew, with the menu I knew and with the defects I knew how to tweak to reduce its impact on the pictures. There are no perfect Cameras and Canon cameras maybe far from perfect according to many, but for me they are like that old car at the right price that if you know where to kick-it you can make it overcome its drawbacks. So I stick to what I knew, I didn't want to go through the learning curve of a new brandI was among this SD970 IS and the newest Canon models of point and shoot, the SD980 IS and the SD940 IS. Honoring the motto of optical zoom is king I quickly discarded the SD940, even if the wider angle lens would have give me more flexibility in what basically a point and shoot is used for: take picture of people. But during the years I learned than a good optical zoom is one the things needed to close the picture quality gap between a point and shoot and an SLR camera. As my friend likes to say, more glass, more quality. It was not that easy between the SD980 and the SD970 though, being the former an advanced model of the later. The SD980 has a wider lens range with the same optical zoom as the SD970 (5x) and just because it's newer it should have a better sensor and a better lens, but this isn't always the case. The SD980 was also slimier and sexier and that touch screen was really something I wanted to try, but at the end I played it safe as at the time I bought this camera the SD980 had been on the market for just a few days, and I went for proven vs. hopeful, even if the SD980 looked impressive and at a better price.So I bought my little SD970 and took it on its maiden trip to the United Kingdom and Spain. One word: Astounding little camera. Just to set the framework of the review, I didn't use the auto-setting but only the program mode, so I cannot say how the auto mode works but as they are using the same lens and sensor I would be surprised if results are much different. The first thing you will notice is the superior dynamic range this camera has for being a compact camera. It can capture way many if not all variations of colors and shadows and moves easily across the color pallet with ease. The second thing you will notice is how easy is to play with the different possibilities within the program mode and the amazing results you will get from all the combinations. You really have to be a professional to realize the picture you've got are not made with an SLR camera, picture quality looks as good or very close as much more expensive camera with bigger sensors, which leads me to the third point: the sensor does a great job even if small being a compact camera sensor. One of the things that worried me of this camera was the high mega pixel-small sensor combination which is a recipe for picture noise. I'm not sure what's the obsession of camera makers on increasing the pixels while equipping their cameras with substandard sensors (maybe is the belief that more MP = better pictures). In my opinion, anything over 10 MP for a compact camera is risky considering the size of the sensor it can carry, but 12 MP is the top, I wouldn't buy a compact camera with more than 12 MP, is a marketing myth that not necessarily means better pictures. Being the SD970IS at the top of the range for its sensor, in none of the pictures I took there is noticeable noise even at low light conditions. I was greatly surprised by this. I was even able to take great pictures of close subjects using the macro (macro mode, not digital macro) with a background blur typical of bigger SLR cameras, and as expected pictures of landscapes and fields were among the best I've obtained, even when compared with my old SLR. The 5X optical zoom delivers as expected, and the digital zoom is not that bad. Even if you get some image distortion -as expected- using a digital zoom (or digital macro for that case), it's not noticeable at first glance and much scrutiny is needed to realize a particular picture has been taken with digital zoom or digital macroI didn't use all the modes but I realized that the vivid color mode and the one that increased the green were the best to take pictures of people and landscape respectively on true colors. The various ISO also worked great although the auto-ISO mode worked pretty well too. One mode I found useful particularly on taking pictures under backlight overcast conditions, very common in UK at this time of the year and that easily overexpose pictures, was the bright light mode that made the sensor compensate for the backlight with superior results. This reminds me of one defect of the camera: It has a tendency to overexpose pictures on open, bright conditions and you will find yourself more often than not manually playing with the ISO settings or sticking to the bright sun mode. But see, as I said is a defect you can overcome if you know the camera well and play with it a bit. Another amazing thing is the display screen, very bright with great definition where you can see the pictures very close to the way they'll look once printed or displayed on a bigger screen, and it doesn't scratches easily. Canon really put a very good quality screen on this camera, cannot say the same of my old SD320In addition to the tendency to overexposure, I found the flash takes way too long to recharge and the battery life is not great particularly if you are like me and look plenty into the screen to see how the picture you just took looks like. Carrying an extra battery is a must, a thing that can be a turndown for some. Also, if it says that the battery is \"slightly depleted\" showing two bars which according to the manual means that you can take many more pictures, get ready to change the battery soon, it's not true. But again, this is one of those defects you can overcome if you're aware and readyIf you like to take movies you will find that HD movies are real and look gorgeously wide on your HD TV, crisp and clear, but the sound wouldn't be that great. Well, that's because the microphone is positioned on top of the camera and sound waves naturally pass over it with less intensity that if it was positioned in front of the camera. Also, the microphone DOES capture the sound of the digital zoom as many said here so my recommendation is to don't use the zoom while filming and go the way of the steady cam and walk in an out or follow subjects closely. It's great for family movies but I wouldn't see as a great way to film distant objects or situations needed to zoom in and out. But hey, go the Tarantino way an abuse the steady cam. If it works great for him it will do for you! Also, be careful not to cover the mic with your finger -thing easy to do because or where the mic is- or you will have a Chaplin movie then! Movies are also saved as .mov format which gives you grater flexibility for watching them on or exporting them to different media playersIn summary, one of the best point and shoots around for the price now that it's well below the price it was when launched. At that price I agree with many that claimed it was overpriced. Oh, one last thing: don't buy it for the \"shake or tilt\" feature of the display to move along the pictures taken (don't tell Canon, but it isn't that good)", "Date": "November 2, 2009"}, {"Title": "Great camera, exactly what we needed!", "Author": "staceycat72 \"Stacey\"", "ReviewID": "R1PLD5DUJDQ6UJ", "Overall": "5.0", "Content": "We own a Canon SD870 IS and a Canon 40D SLR. We purchased the SD970 because of its 5x optical zoom and its HD movie capability. This is an impressive compact camera! It blows away the older 870 (which I loved when it was new) and the HD movie quality is good. The movie quality is not as good as a $1000 HD camcorder, but for a compact camera, it is superb. We have a new baby and my husband recorded several HD movies of the baby while we were at the hospital. Out-of-town family said they felt they really got to know the little one based on the quality of the videos we sent out.", "Date": "May 13, 2009"}, {"Title": "Do not buy - get the Canon SD890IS instead", "Author": "Dr. Macenstein \"total geek\"", "ReviewID": "R3GX3TTO1KK8EQ", "Overall": "2.0", "Content": "Just thought I'd post a quick warning on this camera. I just ordered  it Tuesday and got it yesterday (Thursday) and am returning it today (Friday). I bought this camera because my wife accidentally got water on our Canon SD890IS this summer and it would no longer turn on. Fearing water, we then bought a Water Proof Canon  PowerShot D10 figuring we'd be at the beach and such, so why not? Well, we soon found that while that was a great point and shoot for waterparks and outdoor shots in general, it was not nearly as good at indoor shots as the SD890IS was. So I looked into getting a new SD890IS and saw the SD970IS. Figuring it appeared to be the newer version of the SD890IS, I decided to get it instead. I knew going in that it did not have the optical viewfinder of the SD890IS, but I figured perhaps the increased megapixels, larger LCD and the idea that perhaps I might one day use its video recording if I saw Big Foot or something and didn't have a real video camera around might make up for it.The problem is (for me) that this camera DOES NOT take good indoor pictures. Even in reasonably well-lit rooms, at night, the shots would either be blurry or yellow. It has a hard time finding a good white balance, and while perhaps you can finesse the settings to get a good-looking shot, I planned to use this on AUTO just like the SD890IS which always did an amazing job. I think the main problem here might be that the flash is nearly TWICE AS SMALL as on the Canon SD890IS. On THAT camera I could move my arm while shooting a running kid in a poorly lit room and get crystal clear pictures, but not on this. Even at night outside we would get better lit pictures than on our Canon 20D SLR.Other issues I found (but was looking for having read other reviews here) are:1) slow shooting speed - if you want to shoot kids, this thing is slow2) noisy zoom - I did not try to shoot video, but I believe people who say they heard gear noise on footage3) Beach Camera (who Amazon is using to sell) seems to have a 10% restocking fee. REAL Amazon purchases don't seem to have this, but I guess I should have read up more on it before buying.I would definitely say get the SD890IS. Sure it is 10 Megapixels instead of 12, but you don't need more than 6 megapixels anyway, so don't buy into the hype. Both have the 5x Optical zoom, and the SD890IS is noticeably faster, takes great indoor pics, and outside as well, of course. I just ordered a new SD890IS, and can't wait for it to arrive.", "Date": "October 9, 2009"}, {"Title": "SD 970is - perfect all-in-one EDC camera", "Author": "Ralph Shipp \"Craig Shipp\"", "ReviewID": "RMB760WXXEBXB", "Overall": "5.0", "Content": "I've been using the SD970is for a few weeks and it has proved to be just what I was looking for. My goal was to replace my trusted SD950is and Flip MinoHD with one camera. You see the 950is didn't do HD videos but now the 970is does! So, I'm down to one every day carry camera and I love it. The photos are great and the videos are even better than the Flip. With the Flip I had to use a monopod to keep things steady but with the Canon I can do a great job hand holding. All things considered this camera is a great photo/video combo and it's well worth the money. Plan on at least an 8gig memory card (I have two 4gig cards and I often find myself needing both).Sample videos:[...]", "Date": "May 12, 2009"}, {"Title": "Nice photos but overpriced and limited movie functionality.", "Author": "J. Musto \"Toolman Joe\"", "ReviewID": "R3HTNTJ5SV9IPJ", "Overall": "3.0", "Content": "Nice photos but overpriced and limited movie functionality.This camera takes very nice photos and had an incredibly sharp LCD display.  I only used it in manual mode during the short time I had it, so I can't speak for the program mode although many have complained about it.  I noted a few major issues (at least for me).  First is that the camera has no optical viewfinder.  I realize many point and shoots omit the optical viewfinder but that was a deal breaker for me.  While the display is very bright, I still found it difficult to see it in bright light.  Also, when shooting a moving object at slow shutter speed it is hard to follow the object as the display goes black.  Last, my camera developed a dead pixel after only 2 days.  I initially thought the dead pixel was on the LCD display but even worse, it was on the CCD imager!  That means the stored photos had a red dot on them.  I also had the dreaded lens error occur once.Overall, I cannot recommend this camera.  It costs twice as much as the SD-8900 and only offers a few limited features over the 8900. One feature is 720p HD video recording.  The problem is once you start recording video, the focus and zoom are locked.  You can use digital zoom but not optical.  Unlike with still photos, the digital zoom quickly degrades the image when recording video.  It makes it look worse than analog TV.  Also, if your image is out of focus when you start recording, the whole recording will be out of focus.  The only was to adjust focus is to stop recording, focus then start recording again.  What were the engineers at Canon thinking???  This makes the camera pretty useless for video recording.  Frankly, the recorded image wasn't that impressive even without using digital zoom.  It looked as good as a DVD but not nearly as good as an HDTV signal at 720p.  That said, the camera is primarily a still camera and it did take very nice still images and with 12MP, you can actually use the digital zoom and still retain good clarity.My problem is there are many $200 cameras that do just as good a job as the SD-9700, so why pay $350?One last note:  I used to shoot weddings professionally using a medium format (6 x 4.5cm) camera, so I know about quality and sharpness.  While everyone is touting huge megapixel numbers, the reality is that most people need no more than 6MP. 6MP will give you an 8x10 that will be indistinguishable from a 35mm print.  In addition, the optics in most point and shoot cameras are the weak link, not the imager.  You can have 20MP but if the lens is inferior, it won't make any difference.  The only real advantage to more MP is that you can use digital zoom and/or crop the picture significantly while still maintaining excellent clarity.  If you shoot weddings or product photography, a 12MP or larger camera is useful but then you wouldn't be using a point and shoot anyway, right?Bottom line is I returned my SD-970 and purchased an SD-890.  It has most of the features of the SD-970 at nearly half the price.  It also has an optical viewfinder, which is invaluable when you are in bright sunlight.Joe", "Date": "July 9, 2009"}, {"Title": "Like the camera", "Author": "Bob", "ReviewID": "R1IPR75AMYWH49", "Overall": "5.0", "Content": "A former journalist who used to take photos on the job, I had sworn off cameras because I have spent so much time worrying about all that photography stuff. But now I'm headed on a vacation in Europe and I need a camera to snap up the memories without too much effort. This camera may just be it: auto-focus, auto-color correction, auto-speed, auto-timer, auto just about anything. Imagine my surprise when I accidentally snapped a perfect picture of my left foot while checking out the camera for the first time? Went to the zoo and got some great shots of the usual wild animals. Zoom made this easy too. And the camera is so small, you are basically inconspicuous when shooting. Only downside so far is instruction manual is in very small characters. Hard for old guy to read.", "Date": "May 20, 2009"}, {"Title": "Great photos, OK video", "Author": "Glenn Chung \"family guy\"", "ReviewID": "R29YSJY62SF0OF", "Overall": "4.0", "Content": "This is our third PowerShot digital camera, with our first dating back to 2003. The camera is fast and the auto settings for photos do a very good job of getting decent photos in all sorts of conditions. The LCD is very nice and remains fairly visible even on a sunny beach. The form factor is great and the body is just the right size: small enough to pocket, big enough to hold.The video is 720p, which is just fine. The built-in HDMI is a nice bonus, but you'll need to purchase a mini-HDMI to HDMI cable separately. We got one on Amazon for $6. The video itself is decent, but heavily compressed. To be fair, the compression is only visible in shots that stress the codec (e.g. uninterrupted blue sky, which ends up looking like shifting blocks of blue). Lens or imaging flares (vertical lines in the image) are also quite apparent when shooting against intense light sources. Since these are just for the family video album, we don't really care about this stuff, but we would not use the PowerShot in any production setting.Overall, another fine addition to the PowerShot family.", "Date": "June 14, 2009"}, {"Title": "INCREDIBLE flagship Canon Camera.. worth every penny", "Author": "Jon", "ReviewID": "R1O9BBL9IHMRJ6", "Overall": "5.0", "Content": "Pros: every single detail.looks, weight, picture quality, hd video quality, extra features, menu options, menu navigation, PICTURE QUALITYYYYYYYYYY, price for what you get.. and did i say PICTURE QUALITYCons: HD video a little grainy indoors with low light.. with good lighting it goes away.balance of camera sitting with full lens out isnt that good. just retract the lens first.Summary: ALL i can say is wowowow.I owned a Canon SD 750 for a while and loved that camera and finally sdecided to upgrade to the 970.", "Date": "May 18, 2009"}, {"Title": "Pretty sick camera and the price is nice", "Author": "KDC \"Fynack\"", "ReviewID": "R1FU26O7MSB25K", "Overall": "5.0", "Content": "Traded in my SLR to get this camera and its definitely worth it. Kinda got out of photography since it was so cumbersome to carry and SLR. Bought this and i dont miss it one bit. The HD video is awesome and this camera also does wide shots. You can also use manual setting which are great so i have no complaints at all. One thing to keep in mind is that these have great screens and need to be in a case otherwise they will crack in ur pocket or bag. I speak from experience.", "Date": "April 16, 2009"}, {"Title": "Canon 970 - A great camera!", "Author": "Richard J. Plouffe", "ReviewID": "R1XTEA1K01G7LP", "Overall": "5.0", "Content": "This is the third Canon compact camera I have purchased and it is, by far, the best.  Its ease of use and versatility make it a must have.  The HD movie capability put it over the top for me.  With memory so inexpensive now, taking long HD video clips with the same device as photos cuts down the amount of equipment you need to take with you on any vacation.  If you are even thinking about upgrading your camera, the Canon 970 should be at the top of your list.", "Date": "June 11, 2009"}, {"Title": "Substantial Upgrade from the SD870IS and Minimal Learning Curve", "Author": "David Perrodin", "ReviewID": "R2TGNUBPWZHSUY", "Overall": "5.0", "Content": "MY REVIEW:  I purchased the Canon SD970IS in June, 2010 to replace my Canon SD870IS which suffered from a failing display after four years of use.  Beyond the screen failure, I was very satisfied with the SD870IS and opted to again purchase a Canon.  The SD970IS is very similar to the SD870IS in manner of use - I mean, the buttons were identical to the older camera, utilized the same battery, same charger, etc.  However, the SD970IS is a major upgrade over the camera it replaces - and I am VERY satisified with this purchase.  The advantages of the SD970IS are numerous:  display is bright and very crisp - like a high definition TV; zoom range is improved; the \"Auto\" scene mode selection is efficient; low-light, sunlight and other environmental conditions are handled much better with the 970s versus the 870; the camera is again substantially constructed (like the 870) \"feels solid when held\"; photo quality is sharp!SOME SUGGESTIONS IF YOU PURCHASE THE 970:  12.1 megapixels require a fast memory card.  Opt for a higher-end card with a high transfer rate (32MB/SEC) or higher (especially if you use the video option) - you won't regret that decision as it will prevent you from having to wait a second or two for the image to \"write\" to the card.  I bought a SanDisk 32MB/Second 8 GIG high-transfer card for this camera and it works like a gem!  Order an extra battery.  Although battery life is good, a back-up battery is inexpensive and can easily be packed in the camera case.  The wall charger that comes with the camera is slick and will charge the battery in about an hour.  I also ordered a Koo case for under $10 -- and the case has firm padding and is built for rugged use and certainly will protect the camera.  I will keep the camera in my old Sony Cybershot case for most excursions, though - as it's larger and I can easily store the entire support system for the camera, from charger to extra cards.CONCLUSION:  An outstanding camera for under $300.  This camera is intuitive, well-built and takes great photos.  For most people, this camera will meet and exceed their expectations for a higher-end point-and-shoot camera.  Again, I am completely satisified with it and would recommend it to anyone.", "Date": "June 5, 2010"}, {"Title": "Camera is great!", "Author": "J. Elliott", "ReviewID": "R13JSJENIDY363", "Overall": "5.0", "Content": "After much researching, I decided to buy the CANON SD970 IS.  It takes great pictures even in a darken room with a moving baby.  The software is nice and the pictures can be organized and flagged.  Excellent quality for the price.", "Date": "January 7, 2010"}, {"Title": "I bought it for the video!", "Author": "Mark D. Theobald", "ReviewID": "R32TYRY89XM45H", "Overall": "5.0", "Content": "I bought this camera for my daughter after reading all the reviews on how great the video is. I was not disappointed! Both the video and still picture quality is awesome.Before I gave her the camera, I had a chance to use it to make a video of my SIP & PUFF kayak project to post on YouTube. The video can be seen at the link below.My only wish is that the camera saved video in a format that is directly compatible with YouTube. Not to worry though... I found a really great and free converter program at RadVideoTools to eaily convert the MP4 file to AVI with no loss of video quality.Here's the video link:[...]", "Date": "December 21, 2009"}, {"Title": "Canon 970is camera", "Author": "S. Roche", "ReviewID": "R1V84X6TMYHY3K", "Overall": "5.0", "Content": "This camera is a step up from my 870is camera which is a very good camera.  The 970is at 12 megapixels and a greater zoom range provides an even better quality photo and I am extremely happy with it.  The price is very reasonable and I really like being able to carry it in my pocket with no fuss.", "Date": "December 19, 2009"}, {"Title": "My first Canon camera", "Author": "Liz", "ReviewID": "R3E1RYPRPVYO9T", "Overall": "4.0", "Content": "This is the first time I tried Canon. I wanted to try different brands of point and shoot cameras and I've had a Nikon and Sony in the past. I thought it was time to buy a new one when my Sony of 4 years started to suddenly not respond appropriately. I mainly chose this Canon model because this is the only model that has the size proportion and screen that I like. It's true that it's noisy even if I already adjusted the volumes; but I tend to keep my camera on most of the time so as not to miss a nice shot whenever I'm out taking pictures, so it helps remind me to turn it off. I also find that there is a lag in response when shooting pictures unlike my Sony, that I've missed some good shots. However, when I do get the shots I wanted, the pictures look so good and the movie mode is wonderful as well. The function dial and some of the buttons are still a little confusing but I'm giving myself time to get acquainted with it a little more. Overall, I'm happy with my purchase and if it gives me 4-5 years worth of good service, then the price is just right.", "Date": "June 23, 2009"}, {"Title": "Canon PowerShot SD970 IS... I love it!", "Author": "CRUZ GARCERÁ", "ReviewID": "R2GLMIUO5UOYRM", "Overall": "4.0", "Content": "Canon PowerShot SD970IS 12.1 MP Digital Camera with 5x Optical Zoom and 3.0-inch LCD (Silver)I like it very much, I love its design, I like its selecting wheel, although I think it could be difficult to use or control. The quality of its videos is amazing, they seem a video camera recording, and you can zoom while recording. I'm very happy with it!!", "Date": "November 24, 2009"}, {"Title": "Good compact and performing camera", "Author": "Jose C. Enciso Verduzco \"satisfied customer\"", "ReviewID": "R1J3MNT4SD8OC4", "Overall": "4.0", "Content": "This camera is compact and takes good pictures.  It's macro mode (taking close-up pictures of small objects) is really awesome.  One of the best I've seen in consumer cameras.  I didn't quite like the zoom lever since it's too short and you end up almost using your fingernails to move it.  The location of the buttons is not that intuitive as in Kodak cameras for instance.  This is an excellent and convenient camera.", "Date": "June 10, 2009"}, {"Title": "Awesome Camera! You won't regret it.", "Author": "kevinae102", "ReviewID": "R95XN6IQ9F36Q", "Overall": "5.0", "Content": "This camera is awesome.  I have owned it now for about a month and have taken hundreds of pics.  The quality is great.  The facial recog is nearly perfect.  I mainly bought this for the extra zoom which is very useful.  The lcd screen looks like that sort of purple anti glare that you see on nice high end cars. Very cool.  Battery lasts forever.  I didn't charge this thing for almost 3 weeks of taking pics everyday.  You won't regret this purchase at all. Great low light shots too.", "Date": "June 2, 2009"}, {"Title": "Great Camera", "Author": "J. Thompson", "ReviewID": "RMYSL1JHIRII5", "Overall": "5.0", "Content": "I used this camera for many events since purchasing it.  It take great pictures and the colors are vivid.  My only complaint was at a birthday party in a bowling alley, some of the pictures came out grainy and dark.  After a few adjustments it did clear up.  The videos are great!", "Date": "June 1, 2009"}, {"Title": "canon sd970is", "Author": "Marta \"MG\"", "ReviewID": "RG1BMPT0VJ8UK", "Overall": "4.0", "Content": "It's a great camera and looks really elegant, by the look and feel in your hands you can tell that it's a better quality camera. I love that it has 5x zoom and 12 mp. It's not the smallest one, and not really one of the cheap ones, but I bought it to have it for a longer period of time to take great pictures. I like the kind of rounded shape of it; it feels really comfortable holding it in your hand. I didn't really have time to play with the functions of the camera, so far I was only taking pictures on AUTO mode, and I know pictures can be better if I adjust and customize it a little, once I read the instructions... However, I'm happy with the camera, although the cost is pretty high, as for me, a student. Adding to it, I needed a good camera to take good pictures outside, and also close-ups of the models I build, and I think the camera works really well for me in this case.", "Date": "January 7, 2010"}, {"Title": "Great camera", "Author": "Brian \"GJ\"", "ReviewID": "R168IV15T9DG8", "Overall": "5.0", "Content": "This is a great camera and I am loyal to the Canon brand because it has never steered me wrong.  I use this as my portable compact camera, and a Canon 40D Digital SLR as my \"professional\" version. I purchased this Canon SD970 camera as a replacement to the Canon SD800, because it was lost after being lent to a family member. Oh well, it gave me an excuse to go camera shopping, and I was able to stop by the Canon booth at CES and try out ALL their cameras to find the one I liked the best--size, features, display, and hardware shape.The LCD display is huge and crystal clear. Works great, even in direct sunlight. The display itself is completely flush with the back panel--there is no recess bump for dust, dirt, or grime to find a home, AND you aren't looking at a display that is recessed behind another piece of glass.  There is no peephole viewfinder, but one isn't needed because the display is awesome. The zoom is quick, smooth and quiet.You get a video mode, a programmable camera mode, and a full-auto camera mode. For the majority of pictures, you can live with the full-auto camera mode. The only real changes I usually ever make is to turn off the auto-flash. And that's because this camera works great in low and nearly no-light conditions.Controls on the back are arranged great and easy to use. There is a dedicated button to picture review/playback, and its not small and hard to use.It has both a 4-way directional button, and a surrounding scroll wheel.Have I mentioned that the LCD display is crystal clear and large?  Both both pictures and functional menus are easy to read.No, I didn't expect a SD memory card to come with the camera. And if one did, I would expect to discard it because OEM's are not going to bundle a large memory card anyway. Since you are on Amazon, go and purchase at least a 4GB SDHD card, or wait until they go onsale at your local warehouse club. Speaking of which, make sure you are using a SDHD card. The newer SDHD cards have a much faster read/write speed, which will pay for itself in being able to take pictures quicker and navigate your photo album quicker because you aren't waiting for a slower SD card to catch up.The charger is great. Its a small block that holds the battery that is plugged directly into an outlet. No cables or wires needed. Its only drawback is that its size will prevent you from being able to use an adjacent outlet.It has a mini-HDMI connection for video output, and a mini-USB connection for transfer of content to your PC. No drivers needed, just plug it in and go. Data transfer speed is OK, but I don't use the camera's own data transfer via mini-USB. Instead I use the SanDisk ImageMate All-in-One USB 2.0 Reader/Writer (also found here on Amazon).", "Date": "September 20, 2009"}, {"Title": "Outstanding Mac-friendly, low-light camera for dummies", "Author": "anonymous", "ReviewID": "R1ZRGPGKIEWNO2", "Overall": "5.0", "Content": "June 26 2009: I rate this camera 5 stars. I love this camera. Excellent point-and-shoot camera for photographic numbskulls like me. It is intuitive. The buttons are fine. Bought it a couple weeks' ago, took it on a camping trip and it was exquisite. Still know only a fraction of what the camera offers and have to sit down with it and learn/experiment more. If I discover later that it has drawbacks, I'll edit this review.I did quite a bit of research looking for a point-and-shoot digital camera to replace our old 2002 Canon Powershot G2 camera which still works fine after 7 years. I wanted a new digital camera, finally narrowing it down to either the Canon Powershot SD970 IS or the Sony DSC-T900.GOOD THINGS ABOUT CANON POWERSHOT SD970Surprised at how tiny it is but is big enough for fingers. Superb in low-light (a must-have). It is Macintosh-friendly (a must-have). Of the Canon Powershot ELPH lineup, the SD970 has the largest LCD at 3-inches (as do models 790 & 880); others have only a 2.5- or 2.7-inch LCD. Be sure to buy an SDHC card separately because the camera doesn't come with one, and in order to operate, there must be an SDHC card inserted (I got a 32GB SDHC card but you can get a 4, 8 or 16GB).ACCESSORIES I BOUGHT AT THE SAME TIME~ Centon 32GBSDHC6 32GB CLASS 6 SDHC Flash Memory Card~ CANON NB-5L Equivalent Charger & Battery Combo for OEM PowerShot CB-2LX & SD790 / IS 890 IS ~ Sandisk MicroMate SD/ SDHC Memory Card Reader~ Slim Version Kroo Camera case for Canon Powershot SD Series(to knock around with) This case holds the camera in a protective shell and hooks onto a belt. (I got the \"slim\" version, whatever that is. A similar item is called \"Kroo Camera Case for Canon Powershot Camera Digital Camera\" without the word \"slim\" and has a different stock number. Probably somewhat different than the \"slim,\" but I can't tell the difference from descriptions and photos on the Internet.)~ Mountainsmith camera/gear bag Reflex II (size Medium) (6 x 4 x 5.5-inches) (holds all the above gear with room left over) (I love Mountainsmith products, having several.)~ Sanyo Eneloop 4 Pack AA NiMH Pre-Charged Rechargable Batteries w/ Charger (for the charger)~ Sanyo Eneloop 4 Pack AAA NiMH Pre-Charged Rechargeable BatteriesBAD THINGS I READ ABOUT THE SONY DSC-T900 THAT SEALED ITS FATEThe Sony camera comes in a bunch of exterior colors but who gives a hoot what color the outside of the camera is? Silver is just fine. Exterior color is fluff; it's dumb for a company to put resources towards several exterior colors of a camera. I care about the innards. Multiple exterior colors: 1 strike against it. Sony doesn't care about Macintosh, period. Sony is for Windows people only. Sony keeps asking \"What's a Macintosh?\": definitely a major strike against Sony (as a brand). {Raspberry} Reviewers said the DSC-T900 is bad in low-light: another strike against it. Reviewers said that battery sucks: a fourth strike against it. Since it had four strikes against it, I didn't buy it.", "Date": "June 26, 2009"}, {"Title": "Great camera", "Author": "Nathan Estep", "ReviewID": "R24L0QTQ8A9X5P", "Overall": "5.0", "Content": "this camera is great. it takes great pictures and easy to operate. i love the many ways to thumb through pictures on the camera. i also love the zoom lens. gets great close up and fare away pictures.", "Date": "May 12, 2009"}, {"Title": "Great little camera", "Author": "Janet Crenshaw \"Janet14\"", "ReviewID": "R2MT9V9WQB5UAG", "Overall": "5.0", "Content": "I've been having fun with this camera.  I used to find that most of my photos turned out blurry.  Not now.  The image stabilization really works.  I held up my camera while in a car driving 70mph and took photos out the window and even THEY turned out sharp.  And it's very good at focusing on the object (NOT the window).  I've been so delighted with the results that I got a second one for my husband.", "Date": "September 21, 2010"}, {"Title": "A solid well built camera.", "Author": "karl", "ReviewID": "R1KCIP38TU6ZEN", "Overall": "5.0", "Content": "This camera is not one of the cheap and flimsy digital cameras that cannon has started to produce. Instead for the extra investment made on this camera you get many more and better features and image quality. In looking at this camera before buying i saw that it supposed to allow you to shake the camera while looking at images to go to the next one. This feature is terrible done and only a few time since buying the camera have i been able to get the image to succesfully advance by shaking the camera.  Other then that though the camera has been working great ever since I got it. The battery is also far superiour they my last cannon camera and I find that i rarely have to charge the camera.", "Date": "September 5, 2010"}, {"Title": "Canon", "Author": "Joel", "ReviewID": "RPK7O00UGU7JK", "Overall": "5.0", "Content": "I have bought the camera from Beach Camera thru Amazon. the quality is good and it deliver to our home (Philippines) in just one week which is ahead of time. I enjoy using my camera now and im looking forward to buy more items at amazon.", "Date": "August 27, 2010"}, {"Title": "Love the camera!", "Author": "Cylon", "ReviewID": "R1XVJBO3FK71OC", "Overall": "4.0", "Content": "I've had many Canon cameras. And as far as point and shoot go, this is by far one of the best ones!I love it!", "Date": "March 3, 2010"}, {"Title": "Great camera!", "Author": "N. Moghaddam", "ReviewID": "R2YTOQ0ABKT6O3", "Overall": "5.0", "Content": "the camera works great and takes wonderful pictures! i will never own anything but a Cannon", "Date": "February 1, 2010"}, {"Title": "Good camera and great service", "Author": "Chien-kou Shieh", "ReviewID": "RIY874916LJHY", "Overall": "5.0", "Content": "Didn't have a lot of time with this camera just yet, but I first used it for a wedding and had a lot of fun finding its features. The buttons are a bit stiff for ease of use, but once you get used to it, and are sure to be careful, it works just fine. Canon provided great service for some of my camera's problems, so now it works very well. I don't know about the price, since many cheaper cameras have the same features, but the zoom blur and creative light options add a bit of fun to the camera. Great for a point and shoot.", "Date": "January 23, 2010"}, {"Title": "Canon Cameras are where its at.", "Author": "Norman B. Stempler \"Amazonian\"", "ReviewID": "RX3UNA563TOOY", "Overall": "5.0", "Content": "This is the fourth Canon Camera I've purchased. It has the largest LCD screen (3inches), very easy controls, easy to figure it out whether you use it automatically or manually. Can't go wrong and reasonably priced.", "Date": "December 27, 2009"}, {"Title": "Very Nice Camera", "Author": "Everson Freitas", "ReviewID": "R1CQ1OYUQJOSPZ", "Overall": "5.0", "Content": "Amazing camera. Nice pictures ans colors. Incredible performance for a point and shoot camera. Very happy with this camera.", "Date": "October 17, 2009"}, {"Title": "Great Product!", "Author": "Cyndie P. Bubis", "ReviewID": "R3F1FUPIAHTFO4", "Overall": "5.0", "Content": "I had a SD950IS and replaced it with this camera.  I love the HD video and I find the quality of pictures to be great (provided you have enough light).  I found turning off the flash can cause some blur if the object is in motion, but provide a good amount light and it's fine.", "Date": "September 12, 2009"}, {"Title": "Glad I bought this one", "Author": "holyfoley", "ReviewID": "R1E0Z8T3DZBK97", "Overall": "5.0", "Content": "I love this camera!!!!  It is easy to use & the zoom is awesome.", "Date": "September 7, 2009"}, {"Title": "Not regret buying this model", "Author": "Yokybear", "ReviewID": "R340NSOP3AW3D5", "Overall": "4.0", "Content": "The color of the camera and picture is nice. Photos are colorful. Friendly function.Start up quickly. I haven't tried every mode to take a picture but i like it.The only thing that i would mention is it takes a while to start taking another shot. ( I think it specify in the product specification already). I would say that each camera has its unique, so you may not get all you want in one camera.", "Date": "July 10, 2009"}, {"Title": "Take nice picture, but noisy", "Author": "S. Oktavia", "ReviewID": "RVLQIHDYEXY3B", "Overall": "4.0", "Content": "Love this camera, is small, compact and the most important is take picture sharp, nicely and easy to use.The only problem I got is, it makes sound like..rgh..rgh...not to loud, but sometimes is annoying. I'm not sure, that's OK sound or something wrong with camera, I just had it almost 2 weeks. Anybody know or notice?", "Date": "May 31, 2009"}, {"Title": "Great digital camera to take along wherever you go", "Author": "Leigh Hanlon", "ReviewID": "R2NZI9BLCRQJO2", "Overall": "5.0", "Content": "I've been shooting with the SD970 IS for about five months now. It's a versatile, capable little camera. At first, I thought I'd miss being able to shoot RAW images, but that hasn't been a problem -- I always shoot at the highest resolution and  convert imported JPEGs to Photoshop format before post-processing. The macro and digital macro settings work well, and the video is good enough that a friend used some of it professionally as part of an online promotion.I don't typically use the face-recognition focus or closed-eyelids alert, but these things do work as advertised. Nor do I use many of the special shooting modes like Portrait, Sunset and such. Some I do find useful are Zoom Blur, Night Snapshot and Long Shutter (which can deliver an exposure of up to 15 seconds). I also use Stitch Assist, but getting in and out of this function is so time-consuming that I usually just guesstimate the overlap and align in Photoshop later.The only thing I miss is the ability to shoot time-lapse video, which was actually quite useful for me in the SD950 IS.So far, I haven't missed an optical viewfinder, either.The best thing I can say about the SD970 is that I frequently use it alongside my Canon EOS 20D SLR when shooting events professionally and clients have been satisfied with its results.", "Date": "September 12, 2009"}, {"Title": "Too slow to use", "Author": "B.W.", "ReviewID": "R3HGX3E8HDVVH2", "Overall": "1.0", "Content": "I have used several Canon digital Elph cameras and have enjoyed them.  Generally they take great pictures and fit well in your pocket.  I have also used Canon DSLR's including a D20 (which I absolutely love), Digital Rebel, and the new 7D.I understand that a point and shoot camera will have a slight delay compared to a SLR, but the SD970IS DELAY IS SO BAD that the camera is almost not functional.  I have missed too many shots and cursed at this camera too many times.  The 720p video is nice, but that is all this camera is good for.Sorry Canon, I love your cameras, just not this one.", "Date": "January 24, 2010"}, {"Title": "A great camera", "Author": "T. Stratton", "ReviewID": "R1OBBI9EOM1DCI", "Overall": "5.0", "Content": "While I have always been partial to Canon cameras, this one continues their record.  This is a great camera.  The results are as good as my SLR digital, for all practical purposes.  It's small enough to slip into a shirt pocket for easy access when you need it.The extra 5X zoom is a plus.  Print and picture quality is supurb.  I highly recommend this camera.", "Date": "December 17, 2009"}, {"Title": "Canon camera", "Author": "D. Owen", "ReviewID": "R3CH4C5LOGLEF2", "Overall": "5.0", "Content": "I have been very pleased with my recent purchase of the Canon SD970IS.  The picture quality is great.  I must say it does a lot of thing I will not every use.  However I am super happy with the pre-set settings that are already installed.  The 5 time zoom is great.  I have had a canon with a 3 time zoom before this one.  I can most diffidently tell a difference.", "Date": "October 26, 2009"}, {"Title": "Happy vacation", "Author": "A Beagle \"Bambi\"", "ReviewID": "R15DQW5AGKFGR7", "Overall": "5.0", "Content": "We were going on a long vacation and I didn't want to carry my Canon EOS but wanted quality pictures. After reading online reviews, I purchased the SD970IS.  Received camera quicker than expected and was up and running immediately after charging the battery.  Fantastic picture quality using my HP C8180 printer.  Since we had just purchase HDTV, the HDMI abilities was also a factor in the camera's favor. Get this camera, anyone can use it.", "Date": "September 25, 2009"}, {"Title": "Great addition to Canon Digital Elph line", "Author": "Patrick C. Mowery", "ReviewID": "R2IXQOIWG8YY6B", "Overall": "5.0", "Content": "The new Canon SD970IS Digital Camera represents the expected quality from this legacy of point-and-shoot cameras.  The ease of use is much enhanced over the 5 MP Elph we replaced.  The view screen is larger; anti-motion and 5X digital zoom, and the auto mode-select all work smoothly and quickly.  We also find it easier to photograph toddlers, since the time lag between pushing the button and the shutter click is much shorter.  The exposure monitoring also follows faces well, so the subject is less apt move out of the area of optimal exposure.  Finally, the CPU and photo storage rates are significantly faster, so larger image sizes can be used routinely.  Thus, sharp 8x10 images are the norm.", "Date": "June 21, 2009"}, {"Title": "Great point and shoot!", "Author": "J. Boon", "ReviewID": "R2IXPM9RXXF71", "Overall": "5.0", "Content": "I am very happy with this camera.  It takes clear, rich pictures.  The large LCD display is amazing for previewing and sharing photos.  I love all of the programming and lighting options.  I am able to be creative with my shots with just a few smooth spins of the dial.  If you are a novice like me who appreciates great pictures with ease, you will love this camera!", "Date": "June 12, 2009"}, {"Title": "Perfect pocket picture-taker", "Author": "Fils", "ReviewID": "R3G7QKS376ND17", "Overall": "4.0", "Content": "Easy to use, FANTASTIC pictures via the 12MP capture, video turns out incredible (even takes HD video), perfect camera for wonderful pictures.  Only gave it four stars because it's not great in backlit situations, but it's so feature rich that this issue is probably my fault. Other than that, overall it's a great camera and highly recommended.  In fact, as an owner of a digital SLR, I find myself grabbing this camera over the SLR more often than not.", "Date": "June 8, 2009"}, {"Title": "a great camera only if it can last longer.", "Author": "Yue Z.", "ReviewID": "R3FWHYG1C7T6YH", "Overall": "3.0", "Content": "it can take a good pictures and so I like it in general. However, it apparently the lens frame is made from plastics and is not strong enough.  the lens of mine stuck and cannot open/close only after 1 and half year, since it passed the warranty so I chose to buy another one because the repairing cost was close to buying a new one.", "Date": "December 6, 2013"}, {"Title": "No regrets, I love my Canon Camera's.", "Author": "Philip B Doxey", "ReviewID": "R1KS1ER6TYASA2", "Overall": "5.0", "Content": "I've owned a SD970 for 4 years, I enjoyed it that much that I decided to get another one as a back up, I was lucky to find this one on Amazon, The camera is great, Ive taken over well 10.000 pics with my first 970 and its still going strong, I hope to do the same with this one.My original 970 goes everywhere with me, I use it for my work, its easy to carry in my jacket or pants pocket, I've got a soft side case logic bag that it slips in to protect it.The 970 takes amazing pics, The camera was built in Japan and is solid as a rock, the quality is fantastic, I like things that are well made and easy to use, this fits the bill perfectly.", "Date": "January 12, 2013"}, {"Title": "Great Camera but not perfect", "Author": "Lauren C", "ReviewID": "R2XZXY7BKTF0AZ", "Overall": "4.0", "Content": "I've had this camera over a year and the picture quality is great for a point and shoot. Great colour capture. The LCD is one of the best i've seen in it's class.The only cons that i would mention, is sometimes the auto focus takes longer than i would like, and sometimes missing that special moment. The flash is also not the best for those night time scenes.Also when video recording, there can be a lot of noisy feed back captured if the surrounding is breezy.Other than that it's a great point and shoot camera, maybe a little above the average price range but i still love it. Also note before buying...there are no manual options in this camera but lots or settings to choose from.", "Date": "June 10, 2012"}, {"Title": "2 years of joy then POOF!", "Author": "M. I. Forbes \"Mamamia\"", "ReviewID": "R61HYU0JP02XY", "Overall": "2.0", "Content": "Bought it for myself to replace a stolen Nikon and thought the world of my new little $300 Canon for 2  wonderful years. Family gatherings had our point & shoots pitted against each other and mine won every time. 5 stars all the way. Size was perfect, screen was clear, large and bright, options were easy to use and excellent pictures were almost guaranteed. I  bought extra batteries, a sweet case, then cherished and protected this little delight against theft, injury, cold, hot, wet & sand. 2 years and 1 month later at a beautiful photo op in Jamaica I turned the camera on, the lens came out, opening screen appeared, a funny whirry noise, blinking and chimes, then the error message that I needed to restart my camera. My heart sank. I'd seen this after my daughter dropped a camera in the past but my Canon had not been dropped, crushed, abused, loaned out, touched by a minor, or anything but coddled! Lens has been out ever since and that's that. Do these things have a life span? My heart is broken and I don't want to go through this again. I think I'll go back to Nikon.", "Date": "November 12, 2011"}, {"Title": "Not great indoors!!", "Author": "hearrean", "ReviewID": "R14OVSUTFXNAST", "Overall": "3.0", "Content": "Considering the price for this camera, I feel it should do a much better job with indoor pics. Those pics are always washed out & don't depict the true colors of items. Oh, I'm sure with a lot of playing around with the manual adjustments, it could be improved. But this is advertised as a \"point & shoot\" & there are cameras out there, with a lot lower price tag, that take better pics indoors.", "Date": "August 29, 2011"}, {"Title": "Perfect Camera for me", "Author": "cannon lover", "ReviewID": "R12SXF57BA87K9", "Overall": "5.0", "Content": "Everything is fine with this camera, I've had it for a year and no problem at all. It's just perfect!", "Date": "May 11, 2011"}, {"Title": "Great Snap and Go Camera", "Author": "Nichole \"Nichole\"", "ReviewID": "RP5NLYCWRLD1K", "Overall": "5.0", "Content": "I reviewed this camera a lot before I decided on it. This camera does a great job for the price. I use it for vacation pictures, family pics, everyday pics, everything! The picture quality is very good, love the big lcd screen, etc. There are so many features to love!", "Date": "April 27, 2011"}, {"Title": "Amazing little camera, even more amazing photos!", "Author": "Big Red", "ReviewID": "RKALQWZIK254S", "Overall": "5.0", "Content": "I bought this for myself in Baghdad a few years ago, and my Dad loved it so much, I bought this one for him.  (He was surprised at the quality, (he is a camera tech fan, and owns a few SLRs).This camera is small and very user friendly.  It allows you to shoot in all kinds of conditions and pull out the perfect shot.  My friends always ask for my pictures when we all take them, because mine are always so clear and nice.This camera comes with nice easy software too, which allows you to stitch a HUGE Panoramic shot (really awesome feature)Great photos, great battery life, awesome features, and really easy to use.", "Date": "February 3, 2011"}, {"Title": "pretty good cam", "Author": null, "ReviewID": "RW2P02N5MEI6L", "Overall": "3.0", "Content": "i've had this cam for a while now..so far so good.takes good quality pictures...been exploring most of its features which i find handy..2 things i don't like about this cam though are: 1) no viewfinder; 2) takes a while to focus that sometimes you end up missing the moment that you actually wanted to take pictures of...other than these, it's a keeper!", "Date": "April 3, 2010"}, {"Title": "Lens error", "Author": "Steve Martin \"Steve\"", "ReviewID": "RXZI7XUD92WK4", "Overall": "3.0", "Content": "I didn't get to use this much. Almost immediately (within a half hour) the lens stopped retracting all the way in and then there was a lens error message. So I returned it and bought a Lumix, which isn't all that great either. I'm just glad it failed quickly before I wasted too much time learning how to use it, or before the warranty was up. Anyway, the best thing about these cameras is that they're small and easy to carry along. If you want good dependable pictures it will take a while to learn how and you might be happier spending that time on an SLR.", "Date": "October 13, 2009"}, {"Title": "Not Impressed", "Author": "Stephanie M. Corbett \"Stephmb83\"", "ReviewID": "R4NWY5GATNWHV", "Overall": "2.0", "Content": "I was very excited about getting this camera but have been disappointed with it ever since I first used it. This camera takes forever to focus and actually take the picture....takes away from the whole point and shoot aspect. From the time I press down the button, it usually takes 3-5 seconds to snap the pic, if it even snaps at all! By this time, what you were wanting to take a pic of has probably moved/changed. Sometimes it's not able to focus itself at all and you're standing there holding down the button and nothing is happening..it's very frustrating. Especially when you're trying to capture a quick moment. It's also annoying when you give someone the camera to take a pic of you and your friends and you're having to stand there smiling forever waiting for the camera to take the pic. Even in automatic mode, the lighting is messed up in most pictures....either too much flash or the flash won't go off at all even though you're in a dimly lit area. Good part about the camera is that it takes excellent videos....but if that's all I wanted I would have gotten a video camera. Also, the little metal cap that is on top of the shutter button fell off within a few months of having the camera. I am now in the process of purchasing a new camera..... of all cameras I've used, Kodak has been the most reliable. I expected much better quality and ease of use from Canon....lesson learned.", "Date": "March 28, 2010"}, {"Title": "Compared w/my older 890 the photos in auto STINK! blury and LOSS OF DETAIL!!!!! in LOW LIGHT", "Author": "J. Berger \"Liberals destroyed my education I ...", "ReviewID": "R2ZIV9EHL1MAN8", "Overall": "2.0", "Content": "I took 2 photosone (1) with my Canon PowerShot 890 and one (1) with the 970 I bought.(which I am sending back!)  I took them in identical lighting conditions of the same subject (my Russian Peterbald) THE LOSS of detail!! and this is a higher megapixel then my 890 is unreal.  I am so disappointed.  The cam body is also lighter then my 890.  The screen on the 970 is great. The hd video EH not that much difference although there is an improvement but this cam is going back.  I am sorry you should not have to set and manipulate etc a cam it should take CLEAR photos in auto bc as we all know not everyone has the time to sit there and change settings you need something that fires up and bam. OH and by the way, I develop film, use a manual cam as well, but I like having a point and shoot handy for those moments where u just need to quickly take a pic. I cannot believe the loss of detail..my jaw dropped.  The only comparison I can make is if you took a photo in photoshop or adobe and added blur to the entire picture.where as the old cam you could see the whiskers, the fur on in PERFECT detail etc, pores etc, the NEW SD970, YOU COULD SEE NOTHING, THERE WAS NOT DETAIL everything was eh, you could see my Russian Peterbald, but if you tried to zoom in at all, grain, nothing, zero NO DETAIL, if u care about ur photos, or details, or plan to edit or don't ...DO NOT GET THIS CAMoh and btw I will be MORE THEN HAPPY to send the test shots to ANYONE side by side...as they are coded as to which cam took which shot, and u can see for urself", "Date": "March 3, 2010"}, {"Title": "compact and awesome", "Author": "Sudheer Gollapudi", "ReviewID": "R1VIGEZVYPKSI1", "Overall": "4.0", "Content": "I was initially looking to buy a camera which would give best pictures and and at the same which would be easy for me and for my wife to carry around.So i started my search with the sony cameras and i was very much interested with the way Black Cyber-shot® T900 Digital Camera was shown in their website but came to know from amazon reviews that the snaps doest come with a better quality from the sony cyber shots cameras.I started to look at the canon camera reviews from amazon and i found that SD970IS delivers a great quality and its perfectly true.The camera is very compact and its very easy to handle and operate.The Auto mode of the camera works great and it takes the perfect picture for you even at a very low light.The video is awesome too.i enjoyed shooting videos on this camera than the snaps and the HD quality is amazing.The battery life is impressive too.Couple of downsides which i see about this camera is it doesn't take the picture at the exact moment,which means that there is a slightly a couple of seconds delay while taking the picture and this might disappoints you if you want to capture the moments of your children and the color of the camera is not that good as it looks little dull.Over all a perfect camera and i really like using it.Go for it !!!", "Date": "July 23, 2009"}, {"Title": "SD970IS Review", "Author": "Grimjack", "ReviewID": "R2U8DKY9Q1CJVA", "Overall": "4.0", "Content": "This is a nice little point and shoot to carry around.  I bought it because it has one of the longer optical zoom ranges in a point and shoot; I don't like the digital zoom feature on any of the point and shoots as too much detail is lost.  Overall it's a great little camera to tote around and it produces nice, every-day pictures with great color.  I am a little disappointed with it's autofocus on landscape and garden shots, it does not always pick appropriate points of focus.  It's low light performance is not particularly great either, although that is pretty typical in this level of camera.", "Date": "October 8, 2010"}, {"Title": "amazing quality, difficult to use", "Author": "Wang Weijia", "ReviewID": "R2ELC2X45GC3B6", "Overall": "5.0", "Content": "Quality exceeds imagination, however, it is this quality that makes shooting a little bit difficult, since you need to hold completely still.However, good stuff for geeks", "Date": "April 18, 2010"}, {"Title": "This is better than my Sony Cybershot", "Author": "Ted Cummings \"theo\"", "ReviewID": "R14YAOLNLELU5H", "Overall": "4.0", "Content": "Pretty good camera, but certainly not perfect.  One strange thing about the movie is that if you zoom in on a standard picture and leave it at that; then switch to movie, the movie zoom begins at that level of zoom and will not zoom out.", "Date": "December 10, 2009"}, {"Title": "Dead/Stuck pixels on two separate orders.Zero Stars if I could.", "Author": "Max", "ReviewID": "RMZ8FVVPHCAGU", "Overall": "1.0", "Content": "PROS:  Camera is loaded with features. Ordered it brand \"new\" from Amazon's online shop for \"Three hundred and twenty-eight dollars.\"CONS: Very upset about camera. First order had two white stuck pixels. One in the middle of the screen and other on top right of the LCD screen which found its way on all pictures and 720p video capture. Thought about just dealing with it but was well within my rights to exchange for another one so I did within two hours of noticing it.(Amazon has wonderful quick 24 hour customer service. They sent me out a replacement even though I still had first order. Repacked first order and dropped it into a UPS drop-Box and they Fed Ex overnighted the 2nd one. )Received the second one two days later. Found out the replacement Canon PowerShot SD970IS had the same issue. Now two smaller white stuck pixels at totally different locations which could be seen on pictures but not necessarily in video mode. I was very agitated by this. I ran all sorts of tests to make sure I was not crazy but the dead/stuck pixels reared their ugly heads each time. Took pictures in pitch-black conditions and different modes and was always able to notice the stuck pixels. Called Canon USA technical support to see what they could do but all they wanted me to do was ship it to them instead so they could work on it, a process which could have possibly taken up to 2 weeks or more. I needed it quickly. I decided on giving up on ordering this high-priced camera and just got a refund in the end from Amazon. I did not want to get a third one and find out it had the same problem. I'll just wait until another version comes out.", "Date": "July 31, 2009"}, {"Title": "Comfortable, Reliable, and Affordable Point-and-Shoot Camera", "Author": "Bharat Shah", "ReviewID": "R1OZR7M584OST5", "Overall": "5.0", "Content": "I am an advanced amateur photographer, using basic photographic equipment, without any bulky paraphernalia. I prefer the camera do the basic settings, and like to concentrate on the picture itself, occasionally using manual controls. This is my fourth Canon digital camera. First was stolen, second was damaged, third was the most expensive SX????IS worth $400. I had to return the last one promptly, because although it took excellent stills, with a marvelous zoom, its video was dismal.I have this camera for about a week now, and I have tried out its various capabilities. I can easily, and happily live with this camera, it seems. It is easy to hold and operate. The viewfinder is large. I like the rechargeable batteries over the \"AA\" ones. Zoom is more than adequate. Image stabilizer could not correct my intentionally rotating and severely shaking the camera, but it did compensate for my pushing the click button using my wrist rather than one finger.Video clips are crisp, and audio is excellent. It is much better for a running commentary by the photographer because of its microphone  which is on the top left, away from the shutter button. Once its location is known, it is easy to avoid obstructing it. The flash is not obtrusive at all.Probably this camera is not perfect, but I have not found any negatives yet, despite my trying. In the past, I have found Canon's customer service to be prompt, professional, and friendly.", "Date": "August 24, 2009"}, {"Title": "Lens Error", "Author": "Skinny (one)", "ReviewID": "R3O1ZOZ3F1W3EX", "Overall": "2.0", "Content": "I gave this camera a try and after 1 week I got the dreaded lens error I read about on amazon. I bought local and returned it for another one. Willing to give it another shot as it is a nice camera, if it fails again I will update and not be giving it another chance.", "Date": "August 12, 2009"}, {"Title": "I am returning mine!!!!!!!!!!!!!", "Author": "M. Llaneza \"MiLla\"", "ReviewID": "R2MICO00JVH5Z3", "Overall": "2.0", "Content": "I did lots of research before making up my mind about which point and shoot to buy.  Quality and portability were a must, and after reading hundreds of reviews I purchased the Canon Power Shot SD970IS.  I loved how fast I received it.  Amazon doesn't play with its orders, but the magic ended as soon as I laid my hands on this little guy.  It feels good, and operating it isn't difficult at all, however, the white balance is off, it takes too long to shoot, causing you to miss the magic moments (not good when taking photos of your children) AND THE VIDEO REALLY SUCKS!!!!!  As excited as I was of this purchase, I am returning it.  Not the quality I expected from this camera.", "Date": "June 1, 2009"}, {"Title": "Awesome Camera with great features", "Author": "T. Keough", "ReviewID": "R1JWBO5NDBQIHY", "Overall": "5.0", "Content": "I looked around at a number of cameras and this one had all the features I was looking for. 12 Megapixel, small, 5x optical zoom, large 3 inch display. It is compact and easy to carry, yet has a 5x optical zoom. The view screen resolution is excellent and a great size at 3 inches.The pictures are beautiful.It is fully automated for taking great pics with a quick point and shoot. It also has a number of nice effects you can easily add - macro zoom, black and white, or black and white with 1 highlighted color, blur effects and more.I am very happy with the quality of the camera and the results.", "Date": "August 10, 2009"}, {"Title": "Nice camera overall", "Author": "B. Smith", "ReviewID": "R1JKVIYFIBAKF2", "Overall": "4.0", "Content": "Happy except that deleting a pic requires an extra step now so slower, and wish they would use the same battery as older cameras so they would be interchangable.", "Date": "June 9, 2009"}, {"Title": "so far very good", "Author": "B. J. Lilly", "ReviewID": "RSFALJ6YGJ040", "Overall": "4.0", "Content": "Only had camera for a short time.  It appears to be very good.  I THINK THAT WE SHOULD GIVE ANOTHER REVIEW IN A YEAR. BJL", "Date": "June 5, 2009"}, {"Title": "Another Day w\\SD970", "Author": "Phil Bachicha", "ReviewID": "R30OWCMNEHM1QD", "Overall": "4.0", "Content": "I've had my SD970 for about 2 months and I'm reserved happy.  The features are exceptional, great feel and look, excellent photo quality, easy to use and I would recommend the SD970 to anyone including the experts who wish to carry a pocket sized camera for those impromptu photo opportunities.  That's my happy interpretation.  As for my reserved side, kind of pricey especially if you do not intend to use all the features (but Canon has a camera designed to suit your needs at a lower price).  At the SD970 price a 10X digital zoom would of been nice and that pesky auto focus noise (what gives with that).  Otherwise I am a happy photo opportunist and will upgrade in a few years (my last camera was a Canon SD900) hopefully with another Canon but who knows there are other companies that deserve another look?", "Date": "June 16, 2009"}, {"Title": "Movie playback", "Author": "Irene", "ReviewID": "R3U45PBZT43JEF", "Overall": "1.0", "Content": "I am very disappointed as I just used this camera to record some precious moments recently, discovered I could not see any movies in my computer at all. I did install the solution disk by following the user guide, tried several times in different way but all failed.I ordered the same mode camera for my sister back in July from this seller, it was very good. This second one turned to be a disaster. My old Canon A1000 IS even does a great job than this one regarding the movie recording/playback.Now all precious moments that I recorded were gone, a big lost.", "Date": "November 28, 2010"}, {"Title": "SUPER - until the lens gets stuck, and it will!", "Author": "M. Sherer", "ReviewID": "R2YXEAFEEDW4WI", "Overall": "1.0", "Content": "I loved this camera for a year then the warranty expired and the lens stuck in the open position and it is not economical to fix.  After doing some internet search for a solution I discovered this is a very common problem with dozens of Canon models, it is called error 811, there are entire websites devoted to just this problem.  This camera is too expensive to only last a year, I have beautiful photos of the Italian coast, but I won't be buying another Canon.", "Date": "July 2, 2009"}, {"Title": "A huge disappointment", "Author": "Night owl", "ReviewID": "R2AL743YUKCY8B", "Overall": "2.0", "Content": "The auto setting on this camera produces the worst results of any digital camera that I've ever handled. Out of ten shots POSSIBLY two will be in focus, and they are either over exposed or under exposed. I had gotten this as a replacement for my Nikon Coolpix; the Nikon was my third coolpix and the battery door had broken on every single one of them. The coolpix is also rather slow, so I thought that I'd give the newest Canon powershot a try. What a colossal waste of money! The camera has yet to produce ONE acceptable photo and I've shot over a thousand in all kinds of lighting situations. Maybe if a person has the time to use every special function to set up each and every shot they might get something decent out of it, but if you want a \"point and shoot\" camera that takes great photos on the auto setting, then avoid this one at all costs!", "Date": "May 25, 2009"}, {"Title": "This camera is the world's biggest disappointment!!", "Author": "R. Norton", "ReviewID": "R2DJGLUZBRMTEI", "Overall": "1.0", "Content": "As a mother of 2 young children with no inclination toward photography, I just needed a portable, point-and-shoot, catch-my-kids-in-action easy to use kind of camera. I owned an older Canon Elph for 5 years which I absolutely loved, so I was easily talked into this complete POS PowerShot. What a disappointment!! I absolutely DETEST this camera! Hate it! I find myself actually cursing it regularly.It's incredibly slow, has far too many settings for a mom on the go who just wants good pictures of her wild children, and no matter what I have it set to, it always misses the moment. Everyone who has tried it in an attempt to help me (including 3 photography-inclined friends) has had the same experience and they all conclude this camera sucks.Heed my warning and find another option! This camera is a complete waste of money, and for a mom on a really tight budget, I'm completely bitter for having wasted my money.", "Date": "December 30, 2009"}, {"Title": "Usual Crap of manufacturerers", "Author": "Electron \"Electron\"", "ReviewID": "R2GZIGLWXH6QLA", "Overall": "1.0", "Content": "Ok, so all the intelligences bla bla bla icontrast, iblink, ilaugh, icry, iiiiiiiiiiiiii, and canon ends up making a camera with HD movies but don't you dare move or breath while recording or god forbid zoom:  You will end up with a bunch of crackling sounds that are some of the most irritating especially when you realize it ruined a once in a liftime moment: ? class graduation, birthday ......I do not want a camera that goes to the moon !!!!! I just want one that does a good basic job while on earth !!!!!!!!", "Date": "May 27, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "12.1-megapixel CCD captures enough detail for photo-quality poster-size prints\n5x optical zoom with Optical Image Stabilizer\nHD movie shooting capability plus HDMI output\nNew Active display technology for quickly switching between images during playback\nCompatible with SD/SDHC, MMC/MMC Plus/HC MMC Plus (not included)", "Name": "Canon PowerShot SD970IS 12.1 MP Digital Camera with 5x Optical Zoom and 3.0-inch LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51zYRqscCKL._SX300_.jpg", "ProductID": "B001SER46A"}}