{"Reviews": [{"Title": "Don't waste your money", "Author": "Bridgett Licata", "ReviewID": "R21J6EXX772X9S", "Overall": "1.0", "Content": "I bought this camera for my 9-year old daughter who has a budding interest in photography.  It is advertised as a 5 megapixel camera with 8x digital zoom.  When you use the zoom feature, even at the smallest amount of zoom, the pictures become grainy and fuzzy beyond recognition.  Without the zoom, they are also fuzzy and grainy.  It's as if the camera is unable to focus.  I thought the waterproof case was cute, but not cute enough to make up for the total lack of quality in the pictures.  Some of the reviews I read described this camera as good for children, but I disagree.  Don't you want your children to be able to print their photos and enjoy them?  I think any child using this camera will be quickly bored and unimpressed by photography.  I returned it and ended up paying shipping twice and also shelling out 10% for a restocking fee.", "Date": "June 2, 2008"}, {"Title": "Perfect thing for a kid.  Not so good for adults.", "Author": "C. Stoneham", "ReviewID": "RJCZQBGKTLELX", "Overall": "2.0", "Content": "I bought this to test for an upcoming trip to Hawai'i (want an underwater digicam for snorkeling). I was initially impressed by the housing but the camera was awfully light. A quick inspection showed why. The SD port cover is a rubber \"plug\" (similar to the covers for USB ports, etc on most digital cameras). No big deal, but I could see it coming off with rough use. The menu was extremely basic and didn't even have an option to turn off the barely audible \"beep\" that followed each button press. You also couldn't change the length of playback which was barely a second. Switching \"modes\" resulted in the display disappearing while the change was made then reappearing (the first time I set flash to 'always on\" the display didn't come back up for 5-6 seconds). \"No big deal,\" I thought, since it was a $60 u/w digicam (I own a Nikon D200 so certainly wasn't expecting to use this on land). I took a few shots then pulled them up on the computer. Aye, there's the rub...The shots are really quite poor. The lens may be fixed focus, but it's a relatively narrow cone in front of the camera. Approximately 60% of the image was out of focus. There's a noticeable circle in the middle that was reasonably focused with increasing fall-off towards the edges. Furthermore, the shutter speed was iffy at best. A shot of my refrigerator with flash \"on\" resulted in a very blurry picture. These shortcomings might be mitigated underwater, but I doubt it. Judging by my brief experience, I would strongly suggest avoiding this for any \"meaningful\" photography (above or below the water).I give it 2 stars because it's probably ideal for a child as a first camera. The waterproof case was pretty tough and seemed to be up to the task of protecting the camera from rough handling. The poor picture quality would not be a huge issue for a child. The latch to open the case required enough dexterity that a curious child would not be able to open it on accident.All-in-all, I could see a 4-6 year-old having hours and hours of fun with this at the beach or pool. Mom and Dad, on the other hand, are likely to be sorely disappointed.", "Date": "May 29, 2008"}, {"Title": "Fabulous digital camera!", "Author": "Earl Martin", "ReviewID": "R25MYAD2DEZDXN", "Overall": "5.0", "Content": "This pretty pink camera takes videos with audio, pictures both closeup and more distant with radiant clarity.Highly recommended!", "Date": "October 21, 2008"}, {"Title": "Not a good deal", "Author": "K. Anderson", "ReviewID": "R16EEV94A95DAF", "Overall": "1.0", "Content": "Now i am talking about the camera only. The shipping was great, and return was easy. The Camera however is not so good. Most of the pictures i took (30-50) were blurry. The only pic that came out good were taken with in a few feet, and no motion. I took a picture of a car across the street, a moving car, and used the digital zoom, none of the pic came out good, not even ok. My 11 year old wanted to keep the camera and i would not even keep it for her, no point in having a camera that does not take good pic. I liked the deal, and that it was underwater too, thats why i took a chance. I did not even try to use the underwater case, i knew i was not going to keep the camera so there was no point. If you are going to take up close pic, of non moving objects, and not use the zoom this camera might be ok.", "Date": "September 30, 2008"}, {"Title": "Vivitar 5188 Pink - No Optical Zoom", "Author": "Amazon Customer \"Ryan's Mom\"", "ReviewID": "R2OTSCTZCX2A4Y", "Overall": "2.0", "Content": "I returned this camera because it didn't have optical zoom (the kind you control). I had purchased it for our vacation in Destin, FL later this month...wanted zoom. Was a good camera except for that. The pink plastic camera body was a little disappointing, function was fine. Underwater housing was neat, but I didn't get to use it.  This camera is fine if you don't need optical zoom.", "Date": "June 9, 2008"}], "ProductInfo": {"Price": "$99.95", "Features": "8x digital zoom\n5.0MP CMOS image sensor\nRecords movies up to 640 x 480 at 20fps\nUses SD¿ memory up to 2GB\nIncludes waterproof case, batteries, connecting cords and software", "Name": "Vivitar VIVICAM-5188PNK 5.0MP Camera with 2.0-Inch LCD and Waterproof Case (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41JEm77KrPL._SY300_.jpg", "ProductID": "B0013FWE4Q"}}