{"Reviews": [{"Title": "Great pocket camera (4.5 stars)", "Author": "C. W. Hacker", "ReviewID": "R3OQEPQWKCI9KB", "Overall": "4.0", "Content": "I have been using DSLRs for several years, and currently use the Canon 40D and a wide selection of lenses. I bought this camera as a pocket camera that is easy to take anywhere, and for its HD video capability, as I'm currently in Thailand for several weeks doing some geology research for my master's thesis, and it's impractical and annoying to lug around my big camera everywhere. Therefore my expectations may be different - I am not expecting perfect image quality, full manual controls, etc., because I have my other camera for that kind of thing when I want it. I'm not sure that I would want this as my only camera, because the image quality isn't perfect, but if I didn't have a DSLR I don't think I would notice.In any case, the main thing I have been using this for is taking HD video. This is excellent, and looks phenomenal on a computer screen. I haven't tried playing it on a TV but I assume it would look excellent there too. It is 720p, not 1080p like the new DSLRs will do, but it still looks great - surprisingly great, even, considering the size of the camera and its lens.Others have apparently had trouble using the AVCHD Lite codec, but I have not. I can import the .mts files flawlessly into the Kdenlive video editor on OpenSUSE Linux 11.2 with KDE 4.2. I'm not sure what the status of this codec's support in the popular Mac and Windows video editors is, but if you're using Linux, don't worry about it because it works great and the quality and file size are much better than using MPEG2. As it's a small camera with a small lens and few manual controls, video is not going to look like that from a professional camcorder or from a new DSLR with HD video, but it's easily as good or better than that from the small sub $1000 HD camcorders that are available. Manual control of exposure compensation and ISO for video isn't apparently possible - a workaround is to use the scene modes, which works decently well. The night scene modes give pretty good high-iso (i.e. grainy) video at night, even in dark bars and clubs (or here in Thailand, riding in the back of a tuk-tuk). I really like that there's a dedicated movie button - you can immediately start recording a video no matter what else you're doing on the camera by hitting the button.The camera's responsiveness is very good - obviously not like a DSLR, but much quicker than I'm used to from point and shoots, including other recent models that I've handled. You don't get full manual controls, but if you know what you're doing you can almost always get exactly what you want out of it. I usually leave it in \"Normal Picture\" mode, which gives you the most manual control. All other modes will either default to use the flash if the camera deems it necessary (which, as in most point and shoots, is almost all the time apparently), or will use the built-in LED to aid focusing, both of which are extremely distracting if you want to be discreet (or if you just don't like the look of straight-on flash).You do have to know what you want to do with the camera if you use \"Normal Picture\" mode, it's not just point and shoot - but you will get the best results. The \"Intelligent Auto\" mode works OK - it tries to decide the best scene mode for you based on what it thinks you're taking a picture of. I would suggest just dialing in the scene mode yourself (there are a lot to choose from) as when I was trying that mode it would sometimes choose the wrong thing. That would be the best mode if you wanted pure point-and-shoot action, though.Image quality is probably about on par with other point and shoots with folding optics. I don't know too much about this as I'm used to my 40D and other DSLR images. It is certainly more than decent for my purposes, though. Impressively, I've been taking high-iso shots without flash in really dark Thai bars and clubs that turn out ok - they are relatively long exposures of 1/2 to 1 1/2 seconds (or more) so I steady the camera on something, and there is motion blur, but I think that adds to the photo. The image noise in these cases is very obvious, but not overly distracting. Don't expect the results you'd get from a DSLR with a fast lens, and you won't be disappointed. Definitely practice your technique in various situations to get the best results with this camera.Menu navigation is a little strange at first. I am not sure if it is really non-intuitive, or if I'm just used to the excellent navigation on DSLRs. I think users of point and shoot cameras probably have different expectations - most probably won't have a problem with this. Once you get the hang of it it's not really a problem, anyway, but for me it really was strange at first. All the controls you want (all the manual controls available in \"Normal Picture\" mode) are quickly available by hitting buttons on the back. You don't have to dig through menus to get the the settings you need most often. It's a similar setup to that on the Canon Powershot series, and probably other cameras as well as far as I know. I really like the different auto-focus options they give you - there are more options than on my 40D, and similar options to the professional series DSLRs from Canon and Nikon. Obviously, they aren't going to work as well as on those cameras, but I quite like the \"1-area High Speed\" and \"Spot\" focus modes, which are very fast and work quite well. Unfortunately there is no manual focus, and in tricky situations it can be hard to get it to focus on exactly what you want - in those cases try \"Spot\" focus, but even there it doesn't always give you what you want.Now, of course, the big thing about this camera that calls for the high price - because let's face it, for the specs on this camera it is pretty expensive - is that it's waterproof. This works great and is really a lot of fun. I took it into the cold Pacific Ocean at Newport Beach and it held up great. Taking underwater HD video is a lot of fun. [...] I will have some more videos, from Thailand, up soon as well. I've also taken it in a hotel pool, and it worked great there too. Even if you don't plan on going snorkeling or anything with this camera, it being tough and waterproof is a great feature - I don't ever worry about just slipping it in my pocket. It's the rainy season here right now and I don't carry an umbrella, so I could easily get soaked at any time - I would be very careful with a non-waterproof camera, but don't have to think twice about always carrying this one with me.Do be careful, though, and be sure to read the instructions - there are some things you should do to take care of it so that the waterproofing holds up. The waterproof seals really could be better than they are, but if you take care of them I think they should hold up pretty well.One thing you might also want to watch out for is battery life - when I took it to the beach, I only got about 25 minutes of video recording and a few photos before the battery (which was fully charged beforehand) was completely dead. The Pacific is quite cold, of course, which may have been the reason for the short battery life, but it is something to be careful of. Extra batteries are annoyingly expensive, and I haven't seen a third-party version available yet, but I would have to recommend getting one because so far it seems that the battery life is unpredictable. I left it recording video on my desk with a fully charged battery to see how long it would last, and it went about 2 hours (which is about what you can fit on the 16gb SDHC card I got with the AVCHD lite codec). That seems pretty good, but in real life use you will probably get considerably less life out of the battery.The zoom range is pretty decent; I usually stay at the wide end and I appreciate that they give you the 28mm equivalent - a lot of other point and shoots are at their widest at 35mm, which is significantly less wide. The lens is not exceptionally fast - which I assume is due to the folding optics design - but it normally is fine, even in dark places as I described earlier. I don't really ever zoom in too much, because with the slow lens it's usually blurry except in bright light. The optical image stabilization works well, and is active during video recording (if you want it to be) to remove some of the jitter, which is kind of annoying in videos, and which you'll get a decent amount of with this camera due to its small size.Macro images are nice - you can get quite close. Be careful about the \"Macro Zoom\" mode, though - it is actually a digital zoom! You can get much closer, but the image quality really suffers. This looks especially bad if you use it during video. I suggest simply never using this option. The regular macro mode works fine. You can get closest by zooming to the widest setting, which seems weird, but it works.The camera is pretty stylish and has a nice feel and heft. It feels really well built, mostly metal, and not all smoothed out and boring like most modern electronics design. If you're into gadgets, you'll really appreciate the industrial styling of the camera, and the weight. The screen is very good; it is bright and visible in direct sunlight and will automatically adjust the brightness depending on where you are (if you set it to - you can set the brightness yourself, too). One problem with the design - and one inherent to this type of camera with folding optics - is that you will often find your fingers covering the lens until you get used to holding it. Kind of annoying, but understandable due to design limitations.Overall - I think this is great as a pocket camera, for its HD videos, and as a backup for another camera. I personally would not want it as my only camera - I would choose my DSLR. I would not hesitate in recommending it to anyone who isn't interested in a DSLR, though, and who wants a tough, neat little camera, great for traveling. To be honest, I've taken very few shots with my 40D, and quite a lot of them (and a heck of a lot of video) with this in the week or so I've been in Thailand so far.", "Date": "July 16, 2009"}, {"Title": "Love this camera", "Author": "T. Szymanski", "ReviewID": "RC2HA59ICTRRN", "Overall": "5.0", "Content": "This camera is great! Here's why I (filmmaker/parent)bought this one instead of others:1. Wanted to shoot HD video anywhere, any time, without having to lug around my HVX.2. Shoots on memory cards, unlike the Sony P.O.S. I bought that shoots HDV and if the camera breaks you're up a creek. If the camera croaks, at least I can get the footage/pics off of it.3. I have kids, so I never know when I'm going to want to shoot it, and this camera is easily small enough to fit into a cargo pocket or pants pocket (I'd recommend getting a body glove neoprene cell phone sleeve to put it in - fits perfect).4. I have kids, so it has to be waterproof/dusproof/indestructable since I want to take it to the pool, camping, hiking, etc.Pros:- Shoots video super-instantly and easily, recording with one button push vs. my wife's olympus which makes you go through menus.- Video is SUPER-smooth, probably because of the super-wide angle lens. I mean, rediculously smooth.- Stills look great too.- Did I mention nearly indestructable.Cons:- No lens cap at all - bad design - an indestructable camera where the lens is always exposed? always carry it in something.- STUPID USB cable that's proprietary and DOESN'T charge the battery when it's plugged in.- AVCHD Lite looks good, will import into Final Cut Pro like it's a P2 card, but is otherwise kind of a pain to deal with. The Panasonic software blows.- Expensive battery, but definitely get a spare.- Took some figuring to get the settings right for shooting with (min. shutter speed, mainly. I'd rather a photo or video be dark than blurry).- No intervalometer (sp?). That would have been cool.- Speaker/head phones jack - as a filmmaker, to put videos on this to play back to show people would be cool, but the speaker isn't great.Overall:Great camera. The next version will hopefully have a few more improvements.", "Date": "June 11, 2009"}, {"Title": "Fantastic product", "Author": "DYu", "ReviewID": "R30W4S1CPLJ98V", "Overall": "5.0", "Content": "I went going on a Carribean cruise which was going to include snorkling and scuba in addition to lots of beach time.  I wasn't planning to get a new camera but I saw that some new underwater cameras were coming out and thought I would check it out.  Now, first of all, I am a huge Canon fan and probably would have bought their underwater camera (DC10 I believe), if it didn't look like a toy.I didn't test the 3m theory by taking it scube but I did use it extensively on the beach and snorkling.  It took some great pics and I had a lot of fun just bringing it in the water and watching people get paranoid for me.  One great moment was when we got caught in a torrential rainstorm and I was happily taking pictures while everyone else was trying very hard to protect their cameras.Couple of notes:Get a foam floating strap.  Keeps the camera relatively close to the surface so it won't sink to the bottom.Olympus Foam Float Strap, 202212, RedIf you want to take widescreen pics, these won't come in at the full 12M.  It gets downsized to 9M.Outdoor pics were fantastic - much better quality then I thoughtPlenty of features to play with including beach mode, food mode, burst mode (easier then I remember my Canon).For some reason, power on takes a couple of seconds, tough to get used to after my instant on CanonBattery life good for one day, my Canon would go for a couple days.HD video came out great although make sure you have a procedure to convert them to friendlier video files.All in all though, very happy with my purchase!", "Date": "June 17, 2009"}, {"Title": "Panasonic DMC-TS1 First Impression - case information", "Author": "T. Leistiko", "ReviewID": "R29OLQ8XNUNH9X", "Overall": "5.0", "Content": "I was very excited to learn of this camera.  It promised to be everything I wanted in a camera of this style, and it has delivered.For specific image quality information, I suggest you look to the professional review sites.  This is the best image quality on the market at this time for a waterproof and shockproof camera ... good enough to say you aren't making an image quality sacrifice by choosing this over less rugged pocket cameras of this size and style.  I chose this camera with the belief that the pictures taken from this will be much, much better than the pictures from the camera that is left in its pouch for fear of damage and better than the ones taken by a non-functional camera damaged by sand, dirt, and water.  With most cameras you get zero chances to drop it.  I hope never to test the feature, but this camera is designed to survive a drop from normal holding height.I chose \"Sea Green\" color.  It is a pleasant, muted color.  No reason to fear this color.No lens cap or cover!  I think this is great because the built in ones seem as delicate as the lens.  Here there is no slot for crud to get into.  However, your lens is exposed at all times.  Even though Panasonic claims to have a tough, strong lens, I would take extra care to protect it during storage.  Since it is waterproof, there is no excuse for not have grit rinsed or blown away before gently cleaning.  My bigger concern from no lens cap is in the choice of case, which I will describe later.Interface and display.  There is no optical viewfinder and that is fine with me.  The LCD is useable outdoors.  If necessary in direct sun, both the lens and LCD can be shielded by your other hand when taking a picture since the camera is thin and doesn't have a protruding lens.  The user interface on screen is good.  The Intelligent Auto setting gives just the necessary options and is good for people who don't want to mess with many options.  This is true for both movie mode and picture mode.  There is a Quick Menu button which lets you quickly change most shooting related options without going into a setup mode.  With a dedicated movie button, there are no dials or menus needed to switch between movies and still shots.  This is good because the dial is not easy to turn.  You also don't need to turn the dial to playback.  The movie button location is a little awkward, but at least there is not confusion.  The power button, picture button, and movie button are all separate in position and feel so I won't push the wrong one like I have on other cameras.  The zoom switch, just in front of the shutter button, gets the job done but does not have great control.  It might just take some getting used to.  For those who will try to use this camera with an insulated glove ... forget it.  Once you get it on, you will be able to push shutter with a gloved hand, but that is about it.  I did not find much need to turn the dial in normal usage, which is great.  I do like that it has settings for sports, beach, and snow, plus a user defined scene, which is a great way to get to these commonly used presets.Battery.  If you are going to take a lot of video, then a second battery will be necessary.  I think this is true of all small cameras.  The battery is model number: DMW-BCF10.  It has a separate wall charger with flip out AC prongs.  You have to remove the battery to charge.  Some people don't like this, but the charger is small and convenient to travel with, and it is more convenient to charge outside the camera when you have a second battery.Low Light.  Not going to win any awards here ... but not horrible.  My other pocket HD video capable camera is a Kodak V1073 which has a large image sensor and does really well in low light for a pocket camera.  But, it isn't waterproof, the screen is unreadable outside, and has less zoom so I would happily used the TS1 instead in almost all cases.Video.  AVCHD Lite is a key feature here.  AVCHD is compatible with Blu-ray players so this is the way to go for the future.  You can always choose MJPEG if you want, but I see little reason to.  I was able to play and edit without any trouble using Nero 9 on a several year old laptop.  Still not a good distribution format as friends and family may not have the technology to view it, but you can always author and burn a DVD with your favorite video editing tool.  Inside video with good (but nothing done special)light was very watchable, but I could find some noise if I looked for it.  Outside in daylight is great.Software.  Does it come with any?  I didn't bother looking or even reading the manual.Waterproof and Shockproof.  Test on your own camera.  I will trust Panasonic on this for now.Cases.  Since the camera has an exposed lens, I am more concerned about the case than with others.  I worry about a soft floppy case constantly rubbing against the lens as the camera is carried, wearing off any optical coatings and/or scratching.  My thought is that a case with a stiff backing should be less likely to do this if facing the lens towards the stiff backing when placing into the case.  The Rezo models have a stiff backing, the Tasca don't.Here is the list of what I looked at or tried.All Lowepro models:Tasca 20:  Tried it.  Too small even if forcing it.Tasca 30:  Should fit, but probably will be a little big around.Rezo 15: Fits pretty good.  Sticks out of top about 3/8\" (1cm) but flap still fold over and can velcro (about 3/4 of velcro contacts).  Will hold extra battery and still close.  (Many complain that the battery can slip out when getting the camera.  Get a small rubber band and put around the battery and it won't slip out).  Has a stiff backing.Rezo 20: Slightly different design than the Rezo 15.  I haven't tried it, but it should fit.  Will be a little thicker than the Rezo 15.  The main case is zippered, and extra area has a flap.  Has a stiff backing.  This will close much safer than the Rezo 15.  Update: Bought one from Amazon.  Exactly as I described.  Same outline as the Rezo 15 but slightly thicker ... but plenty of room in the outer pouch for battery and memory.  Since that pouch can stay closed when pulling out camera, and since camera is completely zipped (no velcro) everything is much more secure than the Rezo 15, but generally seems very bulky after putting the nicely sized camera in it, even though the camera fits as perfect as you could expect.  This is the case I will use for now and recommend to those who want something that will really protect and encase the camera.Overall, after owning for just one weekend, this camera is exactly what I expected and what I was looking for ... a camera I don't have to worry about.  Update:  After much more usage I am still very happy with the performance of this camera.  I am getting great video from such a small camera and pictures have been better than I expected from a camera of this style.", "Date": "April 27, 2009"}, {"Title": "Almost perfect! Almost!", "Author": "C. Huang", "ReviewID": "R2I9CNA4RHH1H3", "Overall": "4.0", "Content": "I bought this camera when there were no review on the internet, so I actually had a hard time to pick out what I wanted. I was comparing to Pentax / Fujifilm / Olympus models.  First thing I've noticed, the LCD in the TS-1 isn't 3\", but it's the most responsive in the dark, less lagging, and sharper than others. TS-1 is also the one that has 720p HD recording compare to others.The camera dimension is probably the biggest one among all the models i've been looking around, and it's surely one of the most expensive one as well. However, the face recognition, 720p video, 12 megapixels, the feature list is going on and on, and TS-1 seem to be the best choice.i am not going to be in detail about image quality or lens quality as a pro review like [...] or some other pro websites, because I don't have those pro equipment to justify enough and accurately reviewing in scientific manner.  However, I can review as an user, my words and perspectives.= Image quality =Image turns out to be sharp! colors aren't too shabby, but can be washed out if you have high contract scene. Both skin tone and natural shots looks very clean and nice. It's 100 out of 100 score at outdoor especially at day light.High ISO can be a little noisy, even in the day light you might experiences a little noise. It's not a CANON, but colors are more vivid, things look more lively compare to canon point n' shoots. Over all experiences, I like Panasonic's color system better.Night shots it uses black fame technique, which means if you take 30 seconds to take the shoot, it will take another 30 seconds to re-process to black out the noises. It works fairly well! Night shots are pretty clean.As we always wanted from point n' shoots, is to be able to compare to our DSLR from the image quality perspectives. The truth is, due to the limitation size of CCD, you just can't get that kind of image quality no matter how advance image chip is.  However, comparing to other digital cameras at it's price, TS-1 image stands out! (compared to canon 780IS, canon's image just can't compare!)Ai modes are somewhat usable but not ideal. They are often pretty dumb. Preset modes aren't necessary smart about when to flashing the flash, or subject is behind or in front of the scene. Shutter speed isn't ideal either! Auto (semi-manual mode) allows you to change settings, but shutter only go as far as 1 second. If you want to do long time exposure like 30s, 60s, you really need to turn into \"night landscape mode\" and there aren't that many options to choose from these preset modes.  In the other word, the manual controls are very limited.There is a LED autofocus assistance lamp. It's annoying that it will pops up as bright as the flash itself, and there is almost no way to turn it off. Even you turn the lamp off from menus, it will still pop up when it needs to focus in the dark. I wish they've used infrared ray!!!!!!= Video quality =720p is sharp! Video recording on TS-1 is a bless! It auto focus on subjects! you can auto-tracking the moving subject. Zoom in and zoom out is quiet fast and quiet. video quality is a little softer than actual video recorder, but it beats VGA! It's probably one of the sharpest video recording I've seen in this price range (on a compact digital camera, not DSLR or delicate video recorder).microphone on top of the camera isn't perfect, but at least i do love the idea to include noise reduction software in camera. I was on the ferry filming, the noise reduction does take away lots of background noises! This is pretty awesome design!= Flash =Flash obviously has issues! It fires inaccurately because it falls to know how far your subject is.  It's always full amount blast! If you are too close, things tend to be too bright (especially on macro mode), if you are too far, flash still fires anyway (even flash light doesn't travel that far).Flash option is hiding under \"left\" button, is not as easy as other camera where there is a delicate \"flash\" button to press.Flash is located nearby the lens. Unlike some other models or DSLR where Flash is above the lens, it tend to create more \"red eye\" effects. Not only that! Flash also cause reflection on your dirty lens. Due to this camera has no lens cap, when lens is a bit dusty, flash reflects and picks up those dust spots.  You will see \"SNOW\" effect in your image.  This is a very annoying issue!! It makes flash almost unusable!  However, this issues happens to many compact camera, especially waterproof cameras because you have extra piece of glass in front of your lens for protection, and it often picks up dust.= camera body =Solid, heavy, but well built. Since it's waterproofed, I often wash with soap after coming back from the beach. It's very handy and nicely sealed! When I open up the battery compartment, I often hear the air pressure sound! This is not just some silicon rubber cap! The design is very well done compare to many.Camera body is brush metal look, but scratch easy! Sometimes I almost think, this is suppose to be outdoor camera, why do I need a camera bag?....  After a few weeks of usage, it shows hair thin scratches on the surface, so I guess it's not as tough as I think :(This is an internal lens focus design! Although lens isn't as big as LX-3, so the image quality might be a little worse. However, because your lens is no longer \"sticks\" out, it's less mechanical failure, and more comfortable in your jean pocket.= battery life =Is not bad, but not great.  It will last a day, but not several days. Extra battery would be recommend if you have a long trip. It's sucks you can't charge battery while it's in the camera. Battery is like canon and others, you need to use \"THEIR\" battery, not just any AA or AAA.You can't charge through USB when connected, this is kinda stupid too!= connections / software =It also sucks that you have to use their \"USB\" cable, not just any micro-usb port. Their software is just like any canon/nikon/pentax software.. the driver sucks, bundle software sucks, they are pretty useless if you already have picassa, aperture, iphoto, photoshop....On windows, life sucks a little. You need to install your own driver, and use their own \"SOFTWARE\" because it's a AVCHD \"LITE\" codec, not AVCHD spec, so many video editors won't pick up correctly or you will have sync issues on recording time.  This camera doesn't come with RAW image format, so no advance editing for photo either.On the mac, everything is just works.  When you turn on the camera while hooking up to USB, it can be a card reader (you can import photos if you want). Better yet! if you run iphoto09, it automatically picks up the camera. You can import images right into your iphoto without extra driver or anything.  Video is the same too!  imovie09 will automatically picks up TS-1, and ask to import! Import AVCHD Lite is painless in mac, you can basically click on import.. no need to install drivers or anything.= Operations =Start up is pretty fast compare to many. Focus is fast and accurate. Face recognition doesn't always work, but it will fall back to other focus mode, so it's always right on the spot.No manual focus is one let down, but it wasn't too bad. I am mainly using it as a point n' shoot candid camera anyway. However, if there is a manual focus, that would be nice!= Over all =It's an excellent outdoor camera. Waterproof works well, image quality is pretty nice, colors are pretty natural (not as washed out as Canon), well body building quality, starts up fairly fast, autofocus is fast and accurate.=== PRO ===- fast start up- fast autofocus- nice face recognition (need to add more profiles though)- well balanced color setting- nice waterproof feature- solid camera body- internal focus, it's often better idea than \"sticks out\" lens design- pretty nice 720p video recording- very bright, responsive LCD at back (but why not 3\"?)- just works perfectly without additional software or anything on a mac- video recording has very accurate auto-focus, you can zoom in / out and still remain focus (lacking this option from many compact cameras)- Just about right size and right weight (could be even better if they trim some fat though)=== CON ===- flash has issues- noisy on high ISO (expected from small CCD)- no lens cap, lens can be expose to danger- brush metal design is awesome but easy to scratch- wish to have microUSB connection- hope that USB can charge the battery or in camera battery charge option- preset modes aren't that easy to access, and often they are more than confusing. Wish for more manual operation optionsI high recommend this camera to outdoor lovers, it's a very good all around camera!  However, do not recommend if people are looking for DSLR like performance, manual control freaks, or looking for something super cute and compact.", "Date": "August 20, 2009"}, {"Title": "Excellent, best waterproof camera overall", "Author": "michaelbuddy \"michaelbuddy\"", "ReviewID": "R2VDG6UVY2AFAH", "Overall": "5.0", "Content": "Until this month there were only 2 or three viable options in Waterproof cameras. All were limited, and one, the Ricoh was priced WAY too high.This Lumix, my father-in-law just bought last month in Japan, same exact camera, different model number. I played with it several days. The images are very nice from what I can see. They are just as good as most other point and shoot digital cameras out. Probably not the best of the best, but definitely good. We shot outdoors and inside in restaurants without flash. We got decent shots. Basically put it up to most digital cameras and it fares fine. But with the water and shock resistance and HD video capabilities, you have a a huge win with this camera.In my opinion, this Lumix beats out Olympus, Canon, FinePix, Pentax and Ricoh for the all around status. Why? This Lumix is Water and Shockproof. Has a 10 ft water proof (which is enough for most people) Does HD video 1280x720 with Audio. Takes SD cards including the 32GB SDHC High Capacity cards. This and the video is huge for me. The Olympus does not take SD, and is limited. You can put 4 hours of HD video on a 32GB HCSD card on this Lumix. Awesome. Get a couple 32Gig cards and you are more than covered for an entire vacation with a lot of filming. Great pics, great video, all weather with just this slim camera. That's why I love it.The design is slim (the new Canon waterproof blue camera is awesome, don't get me wrong, but it's kinda big and round (and video isn't as good).This Lumix doesn't have as good a zoom as the Canon, but it's decent, and sure, it can't go as deep as the Canon, however it's small enough for the pocket, durable, takes great shots, goes deep enough in the water for most, takes the best video as all.This is the reason I think it gets best all around. If you only care about super small size, get the finepix. If you want the best underwater performance photos, get the Canon. I wouldn't recommend getting the Olympus unless they change to SD cards. Olympus' MicroSD and XD are both lame limited formats. With this Lumix you are ready for all kinds of things and it's easy to put in the pocket. Because the video is so good, I think it makes it the great all around rugged vacation camera. And I'd even consider shooting fun movies with it where perfect audio isn't required, as the quality is much better than some video cameras out now. (I haven't figured out how good the sound is yet on the HD video, so I can't speak to that, but they say it's decent quality.)Some youtube videos were posted where people with this camera were using it effectively as a helmet cam and they even hooked it to their motorcycle and did driving videos. Stuff like that is why I'm so excited to buy my own. (helicopter / RC airplane / balloon camera shots this would be great being light and video is good)Lastly, the Macro is very nice too. I'm sure there's better macro elsewhere if you compare, but this does very well and has an LED light for it too. If you have kids and you'd like for them to learn cameras and play and experiment, I think though this is not a cheap camera, it's durable, can do all kinds of nature shots and video of bugs, leaves, snow, rain, tadpoles,  and is going to perform well under some stress. I feel like with a water and shockproof camera, you're getting components that are going to last for a while and you'll hopefully only need to replace the camera when a better one comes out (or you lose it.)Hope this was helpful!", "Date": "April 27, 2009"}, {"Title": "Picture Quality inadequate / cost of ownership too high", "Author": "J. Stewart", "ReviewID": "RJ0MIAZYIJ4JZ", "Overall": "2.0", "Content": "I wanted to replace my point & shoot (Canon SD7000is) before my summer vacation as the zoom is starting to stick.  I did research and got excited about this new Panasonic DMC-TS1 because the reviews said it had decent image quality, great features and was waterproof / shock-proof to boot.  Unfortunately after a week of testing I am returning it because the image quality (using the intelligent automatic settings) is just not good enough and very disappointing compared to my 3 three-year-old 6 megapixel camera.I ran a series of tests using my old Canon and the new Panny to take equivalent pics at the same time in various settings - indoor day, indoor night, outdoor (sunny and overcast), low light, kids in motion, macro close-up, etc.  Unfortunately the Panny was substantially worse in almost every category.  Specifically the color was consistently less natural and often washed out, it handled simple motion terribly compared to the Canon and it relied on the Flash in two many situations.  The most disappointing was daylight pics.  Introduce any natural brightness at all and the pics all end up with a slightly washed out look.  The old Canon by comparison handled these situations beautifully.  They both are almost useless in low light.  The only category where the Panny wasn't substantially inferior to the Canon was macro - it took beautiful macro shots.I never tested underwater because the store had fine print on the return policy that invalidated it if submerged, even though it was designed for that.  However, if you read the user manual on the waterproof features there are several major caveats.  First, even though it is also \"shockproof\" up to five feet, if you ever do drop it the company will no longer warranty its waterproof features.  Even if you don't drop it, the manual says you need to have the Panasonic Service Center replace the seal every year.  So I called Panasonic to find out what that costs.  Unfortunately, they threat the seal replacement like a repair and they charge a flat rate of $140 plus parts.  In other words, to maintain the waterproof feature of your waterproof camera, you have to pay almost 50% of its original cost every year to maintain it.  If you pay for an extended warranty, be careful to make sure it isn't voided by underwater use - some are - and even if you have one that isn't, they will void it if you don't do as Panasonic species and replace the seal annually.  Either way, that makes the waterproof feature very expensive.I did not do much testing of the manual controls or changing the default automatic settings.  This will be a family camera and I need it to be truly point-and-shoot for the other users.  So while it may perform better for those willing to play with the settings, I can't recommend it as even a decent point-and-shoot.", "Date": "May 11, 2009"}, {"Title": "Fun and Enjoyable Little Camera", "Author": "RS", "ReviewID": "RV3N55BA4BYE3", "Overall": "4.0", "Content": "I've been using my DMC-TS1 for over a month now and am quite satisfied with its performance.  Those who are real sticklers for image quality in this size-range should really be looking into either the LX3 or the G10, but those aren't waterproof, weatherproof, and shock resistant (which should make up a large part of the reason why you're considering this camera).  I looked at sample shots from the other waterproof cameras from Pentax, Olympus, Fuji, and Canon.  The only one that proves competitive is the Canon D10.  In the center of the frame of wide-angle shots, the image quality of the D10 is clearly better than that of the TS1, but as you move out to the edges (especially toward the right, upper corner of horizontal shots) there is excessive softness in the D10 images and they become worse than the TS1.  The TS1 displays some minor softness throughout the image, and is not as sharp as the D10 at the center of the frame, but is consistent in detail and sharpness levels throughout the entire frame.Here are some TS1 pros and cons based on my experience:Pros:  * Feel confident using the camera in any weather conditions.  * 28mm at the wide end with only minor barrel distortion.  * Zoom range is suitable for most types of picture taking.  * Some fun and usable settings, like starry night (for time exposures), pinhole, and macro zoom.  * Has an auto bracket feature for bracketing exposures.  * Color reproduction seems natural for the most part (see below), though perhaps not as vivid as the default setting on Canons.  * Can shoot in two types of HD video, as well as regular video if I want that.  The HD video looks great and sounds fine.  Some complain that AVCHD Lite is not usable with current software on the market, but I've been using Handbrake to convert my AVCHD Lite videos without much difficulty.  * Image quality is about as good as or better than what I'd get in most any other general consumer point & shoot.  * Start up time is fast and shutter lag isn't really noticeable.  * I should list sturdy and waterproof here, but I'm not going to intentionally test the former and haven't yet tested the latter.Cons:  * Some mild softness in images generally, especially in lower light environments, but nothing really noticeable unless you're looking for it; however . . .  * Noticeable softness at the telephoto end of the lens, though that's not too surprising given the lens design.  This mostly occurs in low contrast scenes, so don't go taking any telephoto shots of fir trees off in the distance.  * The color range that is perhaps less faithfully reproduced than others seems to be reds.  They're a little washed out.  * The regular Macro setting gets only as close as 5cm (I've been spoiled by the 2cm of my old and reliable Canon SD700).  * AWB has trouble with indoor lighting, but I've never come across a point & shoot that didn't have that problem.  * Sometimes the focusing could be more discerning--which I suspect is not a problem with the Canon D10 (I've owned many Canons in the point and shoot range).Finally, I did knock one star off of my review for image quality, but that's in comparison to what I think the ideal should be, and currently nothing on the market matches that ideal.  So, compared to what's on the market in waterproof cameras, I'd give this a 5-star review.", "Date": "July 1, 2009"}, {"Title": "Survived Australia's Great Barrier Reef", "Author": "VLSI_Engineer", "ReviewID": "R284XF6QI17CZO", "Overall": "5.0", "Content": "I purchased this camera for a snorkeling trip to Australia's Great Barrier Reef.  To make a long story short, we were not disappointed.  As somewhat of a film/slr/dslr junkie, I have quite an arsenal of equipment (Nikon D70, D90, D700, FM2).  Besides this camera, I brought a point and shoot Canon SD1200, and a D70 on the trip.- It's really nice that the strap cinches and locks around your wrist.  Waterproof cameras usually do not float and the TS1 is no exception.  If you let go of the camera over a stretch of deep reef, it is gone.  Cameras are lost in the reef all the time.  The cinching, locking strap prevents this from happening.- The camera body does an extremely good job of resisting salt build up.  We had the camera in the water for a good two hours in heavy 30 knot winds and stronger than usual current.  The salt build up cleared up after soaking in fresh water for 30 minutes (I wish I could say the same for my hair).- Water/salt does not stick to the hardened lens which is very important because water droplets usually cause focusing difficulty.  Furthermore, as most peope know, when you have a snorkel mask on and are in ocean water, it's impossible to see any LCD on any camera under water.  Regardless of the camera, I often find myself shooting video underwater blind at the widest angle.  The same is true for the TS1.  However, the difference is that the TS1 is reliable enough in terms of color, exposure, and focus that I don't need to see the LCD underwater.- When you bring the camera out of the water, the TS1 has reed-thin drainage lines that move water away from openings.  I found that it is best not to open the camera until the pooled water near the buttons has drained to the bottom of the camera and the exterior is completely dry.- The still pictures underwater were sharp, in focus, and exposed properly.  The AVCHD video underwater was stunning.  When I look at the high definition videos, I am still in awe of what this camera is capable of.  The video is extremely smooth.  In fact, it's a lot less choppy than my high def Panasonic SD5 camcorder.- In daily usage, the camera performs well.  In fact, well enough, that for daylight photos, I left my DSLR in the hotel room and just kept this camera in my pocket.  Of course, (as with any compact) I cannot say the same for night photos.Having a tough, waterproof compact allows you to focus on enjoying your vacation instead of protecting your equipment.  Also, as of this writing, this is the only compact that does AVCHD lite video that is also waterproof.  This turned out to be one of the better camera purchases I have made.The camera is an extremely good value, especially when you consider what it would cost to get an AVCHD camcorder and a waterproof housing (and the larger size).", "Date": "September 25, 2009"}, {"Title": "Exchanged Olympus 8000, Settled on the Panasonic TS1", "Author": "Vance Skinner", "ReviewID": "RPRV8TK1IX9D7", "Overall": "4.0", "Content": "First let me say I am not a professional and this Panasonic TS1 review is purely my use of the camera (thus far) in comparison to others I tried and returned while looking for the \"right\" camera.  We have a Fuji s700 for our day to day use and wanted a \"pocket\" size camera for trips and use around water.  Like most people, image quality in all sorts of settings is important.We originally purchased and tried the Olympus Stylus Tough 8000.  The 8000 has a slightly better build quality than the TS1.  Both cameras are suspiciously identical in size and layout, right down to the actual battery and compartments.  The 8000 is all metal, while the TS1 is mostly metal and some plastic.  The layout of the 8000 is excellent, a bit heavy in the hand, but solid (a tank).  The layout of the TS1, while not exactly terrible, is not quite as user friendly and feels significantly lighter than the 8000.  I give the edge to Olympus for button layout and overall feel.  Some differences for reference are that the Olympus started quickly, while you have to hold the on button for the TS1 a few seconds.  The placement of the zoom on the top of the TS1 and the stiff feel was also a negative in my opinion.Some professional reviews complained about the Olympus camera menus.  I happened to find the 8000 menu very user friendly for a novice (difference between a general consumer and a pro).  It was hard to look at other cameras that did not have such a clear menu that was easy and fast to manually switch different modes, settings and speeds etc.  The Panasonic menu is somewhat less intuitive and just not as \"clean\" looking from a graphic/icon perspective.  If you are familiar with smart phones, it's like going from an iPhone to an old Palm menu. But, the Panasonic has a lot more manual user options, which beyond its lesser appealing graphical look, puts more control in the users hands.  Similar to the 8000, there is a quick menu, which is quick to reference, while also having the standard menu of all options.  Also, Panasonic's face detection is much more responsive on the TS1.The \"auto\" mode of the 8000 was terrible.  The majority of pictures taken in auto mode were not up to our standards.  It wasn't until I used the manual features and bumped down the pixels as well as the ISO that the pictures started to look better.  As with many camera's, dark lighting and indoor use resulted in average to poor image quality.  Pictures in good lighting were good.  Regardless, the 8000 always produced soft images, which was its only downside in my opinion.  Which brings me to the TS1.  Much like the 8000, it took some fiddling with the ISO speeds and lighting choices to achieve good to excellent pictures.  However, even in \"auto\" mode the camera takes good pictures even at higher ISO speeds. The details are crisp and clear in good lighting or while using the flash.  The color can even be changed between vivid, standard, natural etc.  These are subtle differences that consumers like myself appreciate and actually can see in the pictures.CONS:Zoom button placementSlow zoomStiff buttonsBattery must be recharged separatelyClumsy access to side compartmentsPROS:Good to excellent image quality (auto or manual)Good indoor image quality with flash and low lightingProduces some crisp imagesHigher optical zoom than similar camerasExcellent face detectionSeveral manual user options", "Date": "April 26, 2009"}, {"Title": "Rugged Camera. Picture Quality Could Be Better.", "Author": "JEK", "ReviewID": "R2NHQZDHSSMF1K", "Overall": "3.0", "Content": "I purchased this camera for my wife to keep in her purse so she can capture those \"kodak moments\" of the kids wherever they are especially during family vacations at the beach. Here are my brief pros and cons:PROS:> Water Resistant - Took decent pictures even when wet.> Rugged - All orifices are sealed with gaskets.> Manual Controls - User can customize settings to best fit their situation.> Ergonomics - Lightweight and small. Can fit in shirt pocket or purse.CONS:> Picture Quality - Surprisingly grainy pictures for a 12MP camera even in low ISO's.> Battery Life - Battery runs down too quickly compared with Canon Powershots.> Video Quality & Sound - OK video quality for a HD camera. Sound is even worse.", "Date": "September 14, 2009"}, {"Title": "An underwater camera that's not three years behind regular cameras", "Author": "Tuukka Toivonen \"tuukka\"", "ReviewID": "RJO16SOIROSO7", "Overall": "5.0", "Content": "I bought this to upgrade from a Pentax Optio W30 that I carried everywhere for a couple of years, including about a hundred dips in the river.  The Pentax was very reliable and still works perfectly well, but this camera is the only one I'm carrying now.What's good about the Panasonic Lumix TS1 as compared to the Pentax Optio W30:+ 28mm equivalent wide angle.  I found I was shooting 95% of my pictures at the widest end of the Optio (about 35mm) and still often wishing for a wider angle.  The TS1 finally delivers a wide angle.+ Much better image quality than the Pentax.  ISO400 is actually usable now, and I can leave auto ISO on!+ Optical image stabilizer.  Every modern camera has this.+ 720p HD video.  The Pentax only does 640x480 MJPEG that turns into a muddled mess with sensor noise and JPEG artifact.  720p from the TS1 looks great.+ Quiet autofocus and zoom.  The motor can barely be heard in videos if there's no other sound.  Underwater, these sounds are magnified, and you can even hear the image stabilizer working in a quiet spot, but when do you need the sound in an underwater video?+ Quick bootup, fast focus.+ Zoom review option.  This is great--it shows you a zoomed-in view after each photo so you can see if it's actually in focus.+ Separate photo trigger/movie record buttons.+ Good exposure and color balance control.  I can leave everything on auto, with iExposure enabled to help with high dynamic range scenes, and images almost always come out fine.What's not so great:- Lens not very fast, with a maximum aperture of f/3.3 at the wide end that falls off quickly to f/5.9 at the tele end.- Image quality okay, but not great.  12MP is excessive for such a tiny sensor; the lens can't resolve detail at that level anyway--with a 6MP sensor of the same size, this camera could take awesome photos.- No pan focus mode.  I liked that option for underwater shots on my Pentax.  This can be sort of worked around by using autofocus lock, but it's not quite the same thing.- No manual focus at all!- Macro mode has trouble focusing on close-up objects and seems to prefer the background, even with spot focus enabled.  With lack of manual focus, this can be a problem.- No manual aperture/exposure time setting or raw image recording.  I don't believe there's an underwater camera currently made that has these.- Minimum macro range not as good as the Pentax.- Have to hold power button down for one second for camera to power up, needlessly doubling bootup time.- No manual \"turn display on/off\" function.  This is a shame, since the display powerup is very fast.  Automatic power saving choices are limited.- Holding down buttons to scroll a picture has the usual 1-second delay before the key starts repeating that's been in digital devices since forever. It's almost 2010 now and we're all used to pressing keys, can we maybe get this down to a quarter-second like on our computer keyboards?- There's a bug or incompatibility that causes HD video recorded by this camera to be played at double speed by some software.  In Windows, at least Media Player Classic Home Cinema (MPC-HC) plays the videos perfectly.The camera also has tons of \"scene modes\" which I haven't gotten around to playing with.  All in all, it feels like a modern point-and-shoot that performs adequately on land as well as under water.  And takes awesome HD video without focus/zoom noise.", "Date": "December 21, 2009"}, {"Title": "Great camera....Bad company", "Author": "Butch \"whatevva\"", "ReviewID": "RUCJQSKOC2J5A", "Overall": "3.0", "Content": "I have now had this camera for 9 days. It takes awesome pictures, and incredible video!!I finally got the courage to try taking some underwater shots in the pool. I checked the seals, which of course haven't seen sand, dirt or been open more than 3 times, and went into the pool, got some great video. I let the camera dry overnight and opened it this morning to remove the card and download the pics to my PC. The card was wet! and so was the battery! The camera still works fine and the compartment has dried out, but obviously something is leaking so I called Panasonic. After being shuffled through their system for 20 minutes, I was ulimately told that they would replace the camera for $140. I asked about the 1 year warranty, and all I got was that this was their policy. They suggested I call the dealer that I bought the camera from, which I did. He said the return policy is 7 days and there was nothing he could do. I told him the camera is defective, and to just send me a replacement and get credit for the defective unit. He told me that Panasonic does not reimburse, and any defective camera refunds have to be \"eaten\" by the dealer. He then told me that if he had his way he would never sell Panasonic products due to thier policies. He then offered to replace the camera, but is would be a final sale and he would NOT do it again under any circumstances. I agreed, but then he told me he didn't have the same coler, which I like, so he has agreed to take the camera back and credit my account. I'm unsure as to whether I'll buy another one. I really love the camera, but this issue, along with another major issue with a phone system from Panasonic, has me doubting that I should ever deal with this company's products again.", "Date": "August 17, 2009"}, {"Title": "Great all around - Waterproof that works!", "Author": "D. Francey \"MtnXf\"", "ReviewID": "R2VQUG4M9WUIRO", "Overall": "5.0", "Content": "Ill start with 3 complaints keeping this from being perfect.1. Audio in videos clicks often if you aren't gentle about releasing the zoom buttons.  The camera dims the audio volume when zooming to avoid picking up motor noises.  This takes much better audio than my old kodak M1033 which distorted easily at concerts.  THIS IS A GREAT CONCERT CAMERA for being tough and being able to pick up LOUD noise without cracking and distorting.2. Lens placement means I am often covering the lens and my pictures have blurry dark spots in the corner.  This is a common anchor point for steady shots.. so I get a lot of finger prints on the lens.3. Sky is often washed out, but I fixed that with some manual tweaks.This takes 720p video (at 59.97 frames per second - verified with sony vegas Pro 9).  I have set my camera to take 16:9 shots even though it takes a few Megapixels off the size it looks great and matches the aspect ratio of new TVs and new monitors.Underwater use has been fun, being waterproof makes it less risky to take places, like kayaking where you aren't there for underwater shots, but there is a high risk of water damage.I have only tested underwater in a lake.  Lakes in Maine are full of minerals (brown/rust colored) so the pics tend to be darkened.  Ocean or pool would be much brighter and less distorted.  I got this camera to take to high risk events like sailing, kayaking, biking and its perfect for the job.  I also use this for filming drum covers, drums are loud, this camera can handle the audio and fast movement in videos.Color tones are beautiful. greens in particular remind me of my first sony, they are deep and eye catching.I have not tested facial recognition, or really any special features but macro.  Macro mode is much better than the olympus tough cameras and my previous kodak M1033. I also like having a dedicated video button versus having to goto a menu or restarting the camera in video mode.Editing video is a breeze with sony vegas, my old kodak took quicktime files which are basically useless on a PC without wasting hours converting video.  You do need a good computer to edit video.  Filesizes of videos is much more manageable then my kodaks 720p videos (the video looks much better too, stays in focus better and adjusts to light changes faster).Someone before this said you need a gaming computer to play HD video.. I disagree. The videos play on my desktop and both of my 3 year old laptops. So, unless you own an eMachines (junk and probably cost less than this camera) or a 4+ year old computer, you probably wont have trouble.  (desktop is dual core 3.0ghz 6GB, laptop 1 is 1.5ghz dual core 2GB, laptop 2 is 2.4ghz single core 1GB).  Its not a fault of the camera if your computer cant handle HD video, HD video takes a lot of processing power no matter what it came from, so clean the background programs out to free it up.I give this camera 5/5 for taking near SLR quality pictures from a point and shoot, especially with macro images.  Waterproof that works, and video quality that is top of the line with compatibility to work with.**FOLLOW UP** Its been almost a year and it has had no issues. Waterproofing has held up fine, Ive tested it in swimming pools now too, and video is crystal clear.  Video editing is now supported by windows movie maker.  Battery life has been great, I bought a spare non-OEM off eBay for $7 and it works fine with the camera.  Battery has made it through filming a 1.2hour concert in HD and a 3 day camping trip where I took ~40mins of video and ~300 photos on a single battery charge.  AVCHD is SO much better than .MOV files for editing.", "Date": "July 4, 2009"}, {"Title": "I LOVE THIS CAMERA", "Author": "firebirdbandit", "ReviewID": "R3G3XRURAUBUZD", "Overall": "5.0", "Content": "Pros:1.) Very easy to use and navigate the menus etc.2.) Takes great HD videos3.) Works great underwater4.) Olympus Floating Strap works great with this camera5.) Easy to upload any video to youtube6.) Photo Quality is excellent for a small Point and Shoot7.) 4.6x zoom and large LCD8.) Takes SD memory cards9.) small battery last a long time (at least when new)Cons:1.) Software currently doesn't work with 64 bit Vista - this is a huge issue for me2.) It's not easy to convert the AVCHD video format to something usable on the computer so I have to keep this setting on Motion JPEG format for computer use.3.) Battery must be charged outside of the camera (not a big issue for me) I would like to get a spare though.5.) A little expensive but overall I feel it's a good value due to all the features6.) Zoom button located too close to shutter button7.) Waterproof seals recommended to be replaced yearlyOverall I love this camera and would defiantly buy it again. It's the best underwater video / photo camera you can buy. Video quality is excellent, so much better than most from a digital camera. I found it very easy to use and set all the settings. The camera is heavy but is easily kept afloat with the Olympus Camera float strap in saltwater at least. I tried it in my fish tank and it works great. So far I find the quality in auto mode much better than my Canon S3 IS digital camera. In closing I can't wait for more electronics to become waterproof. As of right now this is one of the best waterproof digital cameras. I would pick this over any model of the Olympus and Canon. I usually favor Canon cameras but this Panasonic is really testing me.[...]", "Date": "May 6, 2009"}, {"Title": "Relieved - Great Camera (Picture and Video)", "Author": "MavMax", "ReviewID": "RWZGRI2K1GNEV", "Overall": "5.0", "Content": "I really wanted that one feature in my next pocket-sized camera: WATERPROOF. But I was very concerned after reading many negative tests & reviews about waterproof cameras in general. It seems like - finally - one manufacturer got it right with this piece of equipment.Most important to me were the following criteria:1. Waterproof- 10FT is plenty for my purposes2. Picture quality- Beats the competition, except for the Canon PowerShot D10 12.1 MP Waterproof Digital Camera with 3x Optical Image Stabilized Zoom and 2.5-inch LCD, however, the D10 is twice as thick, offers only 3x optical zoom and no HD-video recording.3. Shutter-lag- What good is a point and shoot camera, if you can't get the shot you want due to a 1-sec \"waiting-period\"? Something which you may experience with other \"waterproofs\". No annoying level of shutter-lag with the Lumix TS1.4. Size/Style- Really like the looks... not as thin as my Casio Exilim, but the Exilim won't make it out of the pool - undamaged.5. Zoom- 4.6x optical zoom; starts at 28mm and goes up to 128.8mm (35mm equivalent). Great range (since my Canon Rebel XSi standard lens reaches 18mm-55mm).6. Adjustable screen-brightness- Sufficient; really helps in bright sunlight by the pool or at the beach (since there is no viewfinder).7. HD-Video- HD-Recording: 1280x720 pixels, 60p - AVCHD Lite (SH: 17Mbps, H: 13Mbps, L: 9Mbps)... or... 1280x720 pixels, 30fps Motion JPEG. It has a mini HDMI-exit for direct HD-TV hook-up.- You can also switch to... 4:3: 640 x 480 pixels, 320 x 240 pixels @ 30 fps ... or ... 16:9: 848 x 480 pixels @ 30 fps Quick Time Motion JPEG for easy file transfer between camera and computers8. Lens-quality- Thank you Leica!Verdict: Great product for a fair price (paid $300).", "Date": "October 24, 2009"}, {"Title": "Take the plunge, it's well worth it!! (no pun intended)", "Author": "L.S. \"L.S.\"", "ReviewID": "RYWCDMM5YQFUH", "Overall": "5.0", "Content": "First off, I am an electronics fanatic and normally scour the internet for reviews/research on products before making a purchase.  Never though have I left a review myself, but this time I feel I must due to the great quality of this camera. I am even more compelled to submit a review, since my last camera was the Sony DSC-T500 which can't come close to the Lumix DMC-TS1 on what I consider is one of the most important aspects of a digital camera.First off, the camera is very well built and classy looking.  There is no reason to assume it is a tough/waterproof camera at a glance. It would look just as at home in the water as well as out on the town.  The photos themselves look wonderful and unless you pixel peek and want to make poster size prints, this camera will do just fine.Some of the complaints I have read in other reviews include, no lens cover, only 10ft waterpoof, and 15 minutes max record for video.  First off, no automatic closing lens cover is a good thing in my opinion. Normally when you power down, the lens cover closes. Well consider being at the beach with your new waterproof camera and having a few grains of sand get dragged along between the lens and the lens cover as it closes over them.  I'd much rather deal with cleaning fingerprints than a scratched lens.  Now some will argue that the uncovered lens will get scratched anyways.  Well, keep it in a camera case when not in use, and you should be just fine.As far as the 10ft waterproofing goes, this is plenty deep enough for general swimming, snorkeling, and sudden downpours.  If you plan on using it for scuba diving, there now is an optional deep water case that Panasonic makes for this model that will allow you to go down 140 feet.  While some of the other waterproofs go down 30 feet, they do not have this option let alone any good HD video recording.  Therefore in actuality they are more limited in use than the Panasonic.15 minutes max video record is for European models only due to some E.U. law that would reclassify it as a camcorder which in turn would change the import tax rate on it. Atleast this is what I have read.  I have the U.S. version, and there is no limit as to how long you can record a AVCHD video clip unless obviously you run out of memory. By the way, the video looks great on my Panasonic Plasma tv through both the HDMI connection and the SD card reader on my bluray player which does recognize AVCHD video.Now one of the most important aspects of a camera besides photo quality is battery life.  Obviously without batteries, even the very best digital cameras are nothing more than a paperweight.  As a comparison, my Sony DSC-T500 with its actally very nice 3.5\" touch screen is a battery hog.  After fully charging a battery, I would get an average 30-50 photos along with appox. 10-15 minutes max of AVCHD video before the battery was drained.  Those large touchscreens are terrible for batteries and in my opinion, harder to navigate through than standard buttons. Now in comparison, the Panasonic Lumix DMC-TS1 was MUCH MUCH better. I started with a full battery and was able to get on only 1 charge -- 75 photos with flash, 75 photos without flash, full zoom cycle 100 times and 90 minutes of AVCHD video set at the highest settings. I was using a Transcend 16gb sdhc card.  This alone makes this camera 100% better than the Sony. Not to mention the photo quality is better, it uses cheaper priced easier to find sdhc cards and has the HDMI and A/V ports built into the camera instead of having to use a docking station for these features.It really is a great camera for everyday use as well as slightly more extreme situations.  While not as small as some of the other Panasonic cameras, it is still very pocketable.  With the waterproof and shockproof case, AVCHD video function, which by the way is super easy to use with its own dedicated record button, EXCELLANT battery life, great photos and usefull accessories (i.e. deep water case), it will now be the only point and shoot camera I will use.", "Date": "September 22, 2009"}, {"Title": "Best overall HD video hybrid pocket camera. TS1 is AWESOME!", "Author": "D. Carr", "ReviewID": "R1DTH6YOVKFWBU", "Overall": "5.0", "Content": "Like you, I read the other reviews on the TS1 and wasn't sure what to think.  After now having the camera for a few days, and taking lots of photos I can say that this camera offers some great features in a very well made camera that makes this one stand out.I am an avid DSLR user, and this camera does all the things that my Nikon DSLR doesn't:1. Shoot 720p video (or any video at all for that matter). The video is stunning. If you are looking at low end \"flash camcorders\" forget it, get this.2. Take it underwater or shoot in the rain.3. Throw it a bag and take wherever you go, or stick it in your pocket (Put it in a camera case to protect expose outer glass over lense)4. Can bang it around (shockproof), though I don't recommend using that feature, just good to know it can take a lick...5. Option to record a 5 second audio clip to accompany your still photos (I love this feature, especially when shooting photos for work)6. Record to internal memory (called the \"clipboard\"). Good for not mixing those \"photo documentation\" shots with your normal recreational photos7. Hook up directly to HDTV via HDMI cable (sold separately).  See more on this feature below.The only cameras that I found to compare to this in the $300 range were the Sanyo Xacti CA9 (HD), the Canon D10 (non-HD), and the Olympus Stylus 8000 (non-HD). I decided that the Sanyo CA9 was going to be a junkier unit than the Panasonic, with lesser image quality and features.  The Canon and the Olympus don't shoot HD video (which was a deal-breaker for me).  The Canon is a lot bulkier due to its better waterproofing than the TS1 (10m vs. 3m).  I was just looking for a snorkel cam, not a diving cam, so I'd rather not have the bulk. I have never been a fan of Olympus, especially due to their proprietary memory cards (xD).  The zoom range on the Panasonic is, I think, superior to these other cameras, especially due to its true wide angle capability.  I also have owned Panasonic and Canon digital cameras, and find the Panasonic beats the Canon in ease of use.  The TS1 allows optical zoom while shooting video, Canon's typically do not.The AVCHD format for the video seems very good.  I think Sony and Panasonic developed this format so that you could fit a good amount of HD video per stored gigabyte of memory space.  A lot of users seem to have trouble with this format since it is not well supported on the PC, and you'll have to use the included Panasonic software, which probably isn't all that great, or buy a software like Sony Vegas.  I use a Mac which is fully compatible with the AVCHD format without loading any other software. Just attach the camera, and iMovie imports the videos quickly and it ready to edit them, and convert to post to the internet. If you area  PC user, you probably have to figure on buying Vegas in order to manage the videos off this camera. This camera can be your camcorder - easily.  I know it's not 1080p, but I am of the opinion that 720p is way better than 480p, and not much less than 1080p.  Keep in mind that the higher the resolution, the bigger the hard drive and more computing time you're going to need to deal with it.  720p hits the sweet spot, at this time.And as I mentioned earlier, the hookup to an HDTV is accomplished via a separately sold mini-HDMI to HDMI cable.  This is a non-proprietary cable, so you can easily pick one up at Amazon for less than $10.  A really cool thing that I found out by surprise was whenI plugged it into my Panasonic Viera Plasma HDTV.  Once plugged in, you actually operate the camera to play photos, movies, etc. using the TV remote (that's right, the TV remote, right from the comfort of your couch). No one else has this type of a feature on a digital camera.Also, it was great that Amazon included a FREE 4GB Class4 memory card with the purchase, which I will now use with my Nikon D40 (sorry, Amazon!) to replace a slow 1GB card I had in there.  I'm using a Transcend 16GB Class 6 card I purchased for the TS1, which can store a little more than 2 hours of 720p HD video on the single card.So if you're looking for a great hybrid HD movie camera, the TS1 will not disappoint.  The controls are well built and easy to operate.  If you don't have a pocket cam to complement your DSLR, you should, because you're missing out on a lot of photo opportunities.  And if you're going to get a camera or camcorder, you should be looking for one that offers the quality of HD video. And when you can get all this and take it in the water with you, you have a VERY versatile camera that will do so much more than your old cameras did.I do have one negative item to point out on this camera.  With most cameras, when you review the shot you took, you can quickly hit a button or two and delete the photo while still in shooting mode.  Not so, with the Panasonic.  You have to go into review mode, and then hit three buttons to delete the photo.  A bit annoying.  Other than that, I really don't find any other problems with the camera yet.", "Date": "November 8, 2009"}, {"Title": "An all around camera", "Author": "Fulbert T. Chan", "ReviewID": "R26ZTQKM6RM04H", "Overall": "5.0", "Content": "If you're the type to go through reviews after reviews before purchasing an item, well hopefully i can help.After spending over a month researching and going to stores and reading all the reviews and head to head comparisons from the canon D10, Olympus tough 6000 and 8000 and Pentax w60 and the Lumix ts1.  I finally decided on the TS1 for my all around camera and the camera to bring for my vacation to Hawaii.Here's the pros and cons i encountered now that I've had it for 2 months.  I won't go into detail about photo quality since you can get that info on other digital camera reviews sites.  But I can say that my photos have turned out great especially if you know what this camera excels at.Pros+ durable enough to take on hikes and to the beach without worry.+ takes great photos and videos underwater+ HD video+ wide angle shots.+ 5x zoom+ no issue w/ battery life (lasts all day and night)+ multitude of manual options and scenery choices+ has point and shoot setting for the photo challenged+ doesn't look like an underwater cameraCons- Maintenance, if you take it underwater you have to before hand make sure no particles on the camera's doors, ie lint, and/or dirt. But that is to be expected when you purchase an underwater camera.- seals do seem like it needs to be a bit thicker but i never had a problem w/ water getting to the battery compartment even after a week of constant drenching in the ocean either snorkeling, or kayaking. I did however clean it everyday if used in the ocean as per the instruction.- the zoom button isn't in the best spot (in front of the capture button) and I wasn't thrilled that it was a slider type.I highly recommend this camera if you need it for a vacation and also one that you can use everyday.  It's not perfect but against the other cameras in its class, this one has all you will need.", "Date": "October 23, 2009"}, {"Title": "More Than I Expected", "Author": "Kailua Steve", "ReviewID": "R229U2FIFSXSDX", "Overall": "5.0", "Content": "This is my third Lumix. We have a more expensive LX-2 -- top of the line in its time -- which is an excellent almost-pocketable camera. I also bought a cheaper FZ-28 for hiking, which is disappointingly noisy. This camera is /very/ nice for what it is. It's smaller than I expected, which is a good thing. It's also lighter than I expected. It's not a tank, like some of the Olympus cameras. [I'm neutral whether that is good or bad.] It tends to flare some since the lens is covered by a piece of flat glass with no sun shade, but as long as you watch where the sun is, that's not a big problem. I have gotten it wet while hiking but haven't yet taken it underwater. There are lots of YouTube videos from people who have. I expected the door for the battery and SD card to have some kind of lock on it (like the Sanyo waterproofs) so one doesn't accidentally open it underwater. If someone made a camera condom for this model, I'd probably use it just to cover the door. It exposure brackets only +/- 1 E.V.; I'd prefer 2 so I could shoot HDRs when the situation requires it.But it takes _wonderful_ video. The raw video on a large screen television is gorgeous. It has a nice wide lens, adjusts focus and exposure quickly (and in small increments). I use AVCHD Lite with a Mac. The first time I used it as a videocam was at a dog show. I posted the results on YouTube under \"Beck - Best of Breed.\" Most recently I shot \"Moanalua Valley Trail - After the Rain\" with it. I'm very pleased with its macro capability too. I bought the green color; it's subtle and doesn't look cheap or industrial. It's rugged enough that it gets used a lot. Although I bought a second battery, the battery for this camera is not a skinny little toy. I've never had an issue with the first battery running down but I tend not to use a flash.I'd recommend this camera if you regularly do any kind of outdoor activities and take an extra second or two to see where the sun is relative to the camera.", "Date": "October 16, 2009"}, {"Title": "Great for what it is....", "Author": "J. Graves", "ReviewID": "R1SWM33S0ANI5M", "Overall": "5.0", "Content": "I've been through a few waterproof cameras this summer and the Panasonic TS1 is the one I'm sticking with.To give a bit of background, I've tried the Canon D10 and the Fuji Z33WP.The Fuji Z33WP had some of the worst image quality that I have seen in a while.  It was very compact and worked as described in water or out, but the image quality and quirky video mode was too much for me.The Canon D10 was very good.  My only complaint there was with it's size, battery life and lack of HD videos.I finally turned to the Panasonic TS1.  I've been very impressed with the IQ in and out of the water thus far.  It does a very good job as an every day, carry around camera.  The IQ rivals typical compact P&S; cameras.  The bonus here is the video mode.  Outstanding video from such a small camera.  This one is a keeper.  Very good battery life as well.The truth is that none of these cameras is going to be as good as a normal compact P&S;, but the Panasonic comes the closest and does the job quite nicely.", "Date": "July 26, 2009"}, {"Title": "Good for what it is", "Author": "B. Greenstone", "ReviewID": "RJIOY6P6MU54Z", "Overall": "4.0", "Content": "I've never seen a \"great\" digital pocket-sized cam before, but going on the assumption that all of these tiny cameras with tiny optics and sensors will basically suck compared to a DSLR one can put this into perspective.  The TS1 is pretty pricey at $400, but it is fairly feature packed.  The video mode actually works quite well, and the AVCHD compression is exceptionally good.  This is really the main stand-out feature of this camera because the general image quality of the still shots is pretty marginal, but still in-line with what you'd typically get with these kinds of cameras.  There is a fair amount of JPEG artifacting, and I don't know why for $400 this thing can't save out RAW.  It really should.The auto controls work reasonably well, but there is only fair manual control.  There's also no lens cover of any type, and this doesn't come with a case.  For the price, it should have a case since it seems too easy to scratch the glass over the lens.I bought this to take kayaking, rafting, and on hikes where carrying my Canon 450D would be a pain.  I don't expect the best images, but most of the flaws of the files can be fixed simply by importing the JPEG's into Photoshop's Camera RAW importer and tweaking the whitebalance et.al. there.For what it is, I like the camera, but you'll never get professional shots out of this or any other camera with a  1 cm lens.  That tiny lens means you'll have to deal with slow shutter speeds and high ISO's, so you'll get grainy, blurry images.  Although the Optical Image Stabilizer does work well to reduce some of the blur from slow shutter speeds.", "Date": "June 3, 2009"}, {"Title": "Panasonic Performance in Afghanistan", "Author": "J. Olmstead", "ReviewID": "R3RJS0EQBZDMKL", "Overall": "5.0", "Content": "Before deploying to Afghanistan I wanted to get a camera that would hold up to the abuse of an over seas tour. After three months with this camera constantly riding in the lower cargo pocket of my pants it has held up wonderfully. Even with the constant bumps and bashes, dispite the slight dents in the face of the camera, it's still working great. It's survived monsoon rain and endless dust and dirt without any problems. Battery life is great and it's always ready to go. My only disappointments are the amount of time it takes to turn on, which sometimes causes me to miss those last minute photo ops, and it's poor photo quality at night. Other than that, I'm very satisfied with the performance of this camera!", "Date": "March 27, 2010"}, {"Title": "Panasonic Lumix DMC-TS1", "Author": "Michael E \"Michael E\"", "ReviewID": "R162VQP3AYJTRE", "Overall": "5.0", "Content": "Great value, This camera does for the waterproof/shockproof camera market what ipod does for the mp3 player scene. Head and shoulders above the rest. True high quality images and effective underwater capabilities. Can be used as a point and shoot or use in manual mode with a cornocopia of options to set or overide the default ones, change auto settings if you feel the need. Point being, the option is yours. Seems to have as many features as SLR! Check out the other online reviews to confirm my opinion or get tech reviews. Well worth the price. A huge value in a compact package and fills a void for those who don't want to sacrifice image quality or worry about rain,wet hands,beach sand,ect.  Outdoorsmans prayers have been answered at last! This has been one of best purchases! I can't wait for the next rain soaked vacation!", "Date": "June 9, 2009"}, {"Title": "Great little camera, haven't tested the durable features yet.", "Author": "jabdigital", "ReviewID": "R38QLJ1AD9EIAY", "Overall": "4.0", "Content": "I waited for a few months to pick one of these up, and the camera has been great. The HD video quality is fantastic, and the functions/features were well thought of. I like the stored face recognition, the scene modes, and the birthday storage which has the exact age of whoever you are photographing (mainly meant for animals, children...etc). I have not tried the underwater function yet, but the summer is almost here for me to test it out. The images are great, but really only with sufficient light. Daytime shots are sharp and clear, and nighttime shots with flash are clear as well. The only issue is the camera is noisier at lower light than the previous Canon Powershots I have owned. This criticism is offset by the added benefits of the waterproof feature, HD video quality, and a few other customization features. I definitely recommend this camera.", "Date": "May 27, 2009"}, {"Title": "Excellent Hybrid Camera", "Author": "Aaron L. Fown", "ReviewID": "R2SZD9WOA1UK0H", "Overall": "5.0", "Content": "This camera has continued to delight me for the past few weeks since I received it. It is small and tough enough to carry anywhere, and the pictures it takes in good light are just unbelievable; no distortion, low to no noise, and super sharpness and near HDR looking range. It boggles my mind that a camera with folded optics can work this well. But there are two bonuses I couldn't have expectedOne, it has a phenomenal macro mode. It takes just lovely pictures of objects as small as 1cm in size, and viewing the pictures on a large screen shows near-microscopic details. Plus, the lens position allows for ant's eye view pictures by just holding the camera upside down and using the in camera photo editing (!) to rotate the resulting picture.Then, there is the HD video. . .on the sharpest AVCHD mode, the video is just unbelievable. Many full sized camcorders from just a few years ago are no match for this tiny marvel. Further, unlike the TZ5 the continuous auto focus actually works, and is not distracting or headache inducing on play back. It does produce a tiny bit of servo noise, so if you want the best audio it's still best to turn CAF off. On my sample the audio is good, not great; it would be nice if it had a microphone port, but you can't have everything. It even takes -macro video-, a unique feature. I have a video up on Vimeo of a test of the macro video capabilities; it might be worth taking a look at if you are interested in the video capabilities of this camera.[...]Overall recommendation; buy it! You will not regret your purchase. As solid feeling as this camera is, I'm sure it will serve me for years.", "Date": "May 12, 2009"}, {"Title": "Camera Leaks!", "Author": "S. Krieger", "ReviewID": "R23LGT56AV43T9", "Overall": "1.0", "Content": "This camera failed the first time I brought it into the water.  I prepared the camera according to Panasonic's directions, went into a shallow pool, went underwater, took 6 images, and the camera stopped working.  I sent it in to Panasonic, they denied warranty coverage.  I've now dealt with 5 different departments at Panasonic, they all tow the company line, claiming I abused the camera and their only offer is to sell me a refurbished camera at half-cost.  They've been a total nightmare.That said, watch out....it's a great camera, until you ask it to do what it's supposed to do.", "Date": "September 4, 2009"}, {"Title": "Great camera ... until it hit the water!", "Author": "D. Wozny \"TurboDiesel\"", "ReviewID": "R3R5K0RJLAJHKZ", "Overall": "2.0", "Content": "I hate to give this camera a bad review, because the truth is I really like it!  Picture quality is great, it's packed with features, and it seems a very rugged little camera.That said, we bought this camera with the intention to use it while snorkeling in Maui.  As you may have guessed by now, it worked GREAT until we we took it in the water.  It took a few really nice pics and one very good video, then it stopped working.  I decided to take it snorkeling at the hotel beach the day before our excursion to try it out, and that was the end of it.I was very careful to check and make sure the doors were properly secured, and there was no foreign matter on the gaskets.  I rinsed it off properly and let it dry.  Once I opened the battery compartment door, I knew why the camera wasn't working, as there was water inside.  (Only a small amount, but apparently enough)  This was a major disappointment to say the least!So, if you want a camera that has great features, is quite rugged, and can be used in wet (non-submerged) environments, then this is a great choice.  If you want to use the camera underwater, though ....  (There are lots of reviews of people who have used the camera successfully underwater, so perhaps mine was defective?)Fortunately, I had only had the camera a couple of weeks, and Amazon was great about taking the camera back and refunding my money, so that part was a happy ending after all.  (I like this camera so much that I'm thinking of pickup up the new TS2 Lumix model.  Hopefully we'll have better luck with that one, since it's rated for deeper submersion...?)", "Date": "April 2, 2010"}, {"Title": "Use it in sea water, and you have a brick.", "Author": "Tummybug", "ReviewID": "R1X6XLDS4SRZ6S", "Overall": "1.0", "Content": "This supposedly 'waterproof' camera is not.I used mine 5 times in total, once in the sea, and this was the kiss of death for this expensive gadget.Even though the 'water damage' seal is intact, the camera wont turn on, that's it.Very unimpressed, I thought I would not take a risk buying this branded camera, turn out to be a useless piece of rubbish.", "Date": "November 15, 2009"}, {"Title": "Fantastic!  Everyone whos sees it wants one!", "Author": "esoterra23", "ReviewID": "R3KD8FAHAKZGJP", "Overall": "5.0", "Content": "I am so pleased with my purchase of this camera.  The LCD is big and looks really good.  The camera is small and light-weight, making it great for taking pics or videos just about anywhere.  I bought this as an update to our mini-DV video camera and to replace our old 2MP point-and-shoot digital camera.  In fact, when I came across this product on Amazon, I was looking for a compact HD video camera.  Because this looked so much like a typical point-and-shoot still camera, I had my reservations as to whether it could function as a full-featured video camera.  So I read lots of user's reviews before making my purchase and found that almost everyone loves it, especially for video.  The video quality is stunning, much better than I'd expected.  I was even impressed by the recorded sound quality, when playing back the videos on my PC.  Before I read the reviews, I thought that the underwater feature was just a selling gimmick.  Once I played with it in the pool, I discovered that the reason everyone raves about the underwater capabilities of this camera is because it works so well.  Once you shoot some family videos in the pool, any buyer's remorse goes out the window.  After seeing my camera, my sister-in-law ordered one, and now my mom wants one too.  All in all, the camera is smaller, lighter, and works better than I had expected.", "Date": "September 21, 2009"}, {"Title": "Excellent camera for snorkeling", "Author": "Alexander Scoble \"BloggingITGuy\"", "ReviewID": "R3FX25HDBFXC0", "Overall": "5.0", "Content": "We bought this camera for our honeymoon to Negril Jamaica. We used it for all 4 snorkeling trips that we took as well as for swimming in the ocean multiple times and never had a problem with it.It takes decent pictures in or out of the water, but I wouldn't count on being able to get good shots of fast moving fish, which is pretty much an issue with any point and shoot camera anyhow. They just don't do action well.All in all though, if you need a camera for light underwater use (no more than 10 feet deep) then I highly recommend this camera.One last thing, it does not use a standard USB jack for transferring pictures, so don't make the mistake we made on our trip and not pack the cable. We ended up just putting the memory card in to our Canon camera, so it ended up being ok, but you should be aware of this. It uses a mini-HDMI cable instead.", "Date": "January 4, 2010"}, {"Title": "good rugged camera", "Author": "TheCeladon", "ReviewID": "R1ZKRB09TAMLCO", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2YN0611WKTX8LembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2YN0611WKTX8Lrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2YN0611WKTX8LchiDiv\").innerHTML = document.getElementById(\"cv_mo2YN0611WKTX8LhiddenPre\").innerHTML;\n};\ncv_mo2YN0611WKTX8Lrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2YN0611WKTX8Lso;\t   \n\n\nfunction cv_mo2YN0611WKTX8LloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2YN0611WKTX8Lso = new SWFObject(swfLocation, \"cv_mo2YN0611WKTX8LAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2YN0611WKTX8Lso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2YN0611WKTX8Lso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2YN0611WKTX8Lso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2YN0611WKTX8Lso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2YN0611WKTX8Lso.setAttribute(\"height\", swfHeight);\n          cv_mo2YN0611WKTX8Lso.setAttribute(\"width\", swfWidth);\n          cv_mo2YN0611WKTX8Lso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2YN0611WKTX8Lso.write(\"cv_mo2YN0611WKTX8Lflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2YN0611WKTX8L', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2YN0611WKTX8L';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2YN0611WKTX8L', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2YN0611WKTX8LloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2YN0611WKTX8L\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m26KQZGHTU4WZX\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m26KQZGHTU4WZX\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1ZKRB09TAMLCO\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m26KQZGHTU4WZX/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2YN0611WKTX8Lduration')) {\n      document.getElementById('cv_mo2YN0611WKTX8Lduration').style.display='none';\n    }\n    cv_mo2YN0611WKTX8LloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2YN0611WKTX8LloadSwf(movieID, playerVersion) {\n   return _cv_mo2YN0611WKTX8LloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2YN0611WKTX8LnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2YN0611WKTX8L', 0, h);\n}\n\nfunction cv_mo2YN0611WKTX8LresetPlayer(w,h,bw,cc) {\n  cv_mo2YN0611WKTX8LnewHeight(h);\n\n  cv_mo2YN0611WKTX8Lso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2YN0611WKTX8Lso.addVariable(\"cacheCode\", cc);\n  cv_mo2YN0611WKTX8Lso.setAttribute(\"height\", h);\n  cv_mo2YN0611WKTX8Lso.setAttribute(\"width\", w);\n  cv_mo2YN0611WKTX8Lso.write(\"cv_mo2YN0611WKTX8Lflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2YN0611WKTX8LRollOverImg = new Image();\ncv_mo2YN0611WKTX8LRollOverImg.src = \"http://ecx.images-amazon.com/images/I/910wqBI-fpS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2YN0611WKTX8Lpreplay = document.getElementById('cv_mo2YN0611WKTX8LpreplayImageId');\nif (cv_mo2YN0611WKTX8Lpreplay) {\n  cv_mo2YN0611WKTX8Lpreplay.onmouseover = function() {\n    cv_mo2YN0611WKTX8Lpreplay.src = \"http://ecx.images-amazon.com/images/I/910wqBI-fpS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2YN0611WKTX8Lpreplay.onmouseout = function() {\n    cv_mo2YN0611WKTX8Lpreplay.src = \"http://ecx.images-amazon.com/images/I/910wqBI-fpS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2YN0611WKTX8Lpreplay.parentNode;\n\n  var cv_mo2YN0611WKTX8LcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2YN0611WKTX8LcurrentClick) {\n      return cv_mo2YN0611WKTX8LcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 3:45 MinsThis is an updated review.  So far so good.  I've taken this camera into salt water at least 50 times with no problems.  The more I use this camera the more I like it.  For video I've been using the motion jpeg setting instead of AVCHD which seems easier to edit.  For regular photos the quality is what you'd expect from a point and shoot camera.  What I like most about this camera besides it being waterproof and rugged is the wide angle lens.  This camera has turned out to be my favorite of the half dozen or so digital cameras that I've owned over the past few years.  Now it seems that an updated and improved version of this camera has come out.  Go for it!", "Date": "December 29, 2009"}, {"Title": "Panasonic DMW-BCF10PP Battery ONLY!", "Author": "Jim B.", "ReviewID": "R3ERSS2FEILJ56", "Overall": "4.0", "Content": "According to the Panasonic web site, on the firmware update page for the DMC-TS1, if you install firmware update version 1.2 in the DMC-TS1 camera (or if v1.2 is already installed), then the ONLY battery that will work in the camera is an \"authorized\" battery.From the Panasonic page as of September 8, 2009:----------[ Warning ]For our customers safety, after this firmware update your Panasonic Digital Camera cannot be operated by unauthorised 3rd party batteries.(Currently there is no authorised 3rd party battery available in the market.)----------Therefore, it seems that the only battery(s) that will work in the TS-1 camera is a genuine Panasonic battery, such as the Panasonic DMW-BCF10PP that is included with the camera. Note the PP at the end of the battery model number.I bought a Power 2000 brand,  model ACD-302 Rechargeable Battery, listed as a replacement for Panasonic BCF-10, at the same time that I bought the camera. The Power 2000 battery looks physically identical to the Panasonic battery, and fits perfectly in both the charger and the camera. But when the camera is powered up, the camera displays a message that the battery cannot be used, then powers off.----------Added September 14.The Lowepro Ridge 30 case is a good fit to the TS-1. The case easily holds the camera and wrist strap, two or three extra batteries in the pocket with the Velcro flap, and several memory cards in the zippered pocket.The case has a belt loop to... er... put the case on your belt. It also has a detachable, thin shoulder strap. Well made, and claimed to be water resistant. (No need to send the case back to Lowepro every year for new seals.)", "Date": "September 8, 2009"}, {"Title": "Enclosed lens system is of great value", "Author": "V. Calvin Hoe", "ReviewID": "R2YIY0CZ3QUY6U", "Overall": "5.0", "Content": "I work in the wind turbine construction and service business.  The Panasonic TS1 will fill the bill for several reasons.  The weather/water tight case will help keep the dust out.  The drop proof will sure help in dropping breakage.We inspect the turbine pieces during construction; so we take lots of pictures for QA/QC.We document all repairs for before/after results.  So lots of pictures.Extremes of weather (cold) is a factor yet to be tested.  So far, the replacement factor has dropped to less than 30% since we started using the TS1.  Most of our cameras fail because of dust getting in the optics; which in this case is inside the camera.One camera failed when resin from composite got to the power button.  Cannot take the camera apart to fix that problem like the cheaper cameras.I shall up date this file as time goes on.", "Date": "August 30, 2009"}, {"Title": "An Outdoorsman's Dream Camera", "Author": "Michael E \"Michael E\"", "ReviewID": "R1ZYGDWUO0BJTS", "Overall": "5.0", "Content": "Here is the cold hard truth, It's the only high quality waterproof,shockproof camera on the market that can take incredible high quality 12mp photos (even hd video)! All the point any shoot settings can be manually reset/set to please even the pickiest snob photographers. Oh, did I mention, it fits in your pocket! As a hunter,fisherman, boater I've been waiting years for a camera of this quality that not only can get wet,but actually perform UNDERWATER! Some of these reviewers need a reality check and realize this is a quantum leap in the digital camera sector! You can pick any camera apart, there are hundreds for sell, but only 5 compacts exist that can take water environments and this is the best of them. Your other options are ,buy a huge diving SLR, wait 3 more years for the next leap in technology, or put a sandwich bag over your existing camera and hope it doesn't rain or you ruin it with a wet hand. Trust me, it will! Bottom line, if your an outdoorsman or a beach or pool bum who would like great photos in all environments, buy this one. And remember,  waterproof also means dirt and dustproof.Technical info is available on several sites if you need it. This was one on my best purchases.I can't wait for the next rain soaked vacation!", "Date": "July 14, 2009"}, {"Title": "Very nice camera, Great pictures", "Author": "W. Blum", "ReviewID": "RFRK8VPOSOIMK", "Overall": "4.0", "Content": "Upgraded from an olympus waterproof camera; the Panasonic takes much much  better pictures. Only thing I noticed is I sometimes get my finger in front of the lens in movie mode but I am probably still getting used to holding.I am using a 32gb sandisk (class 4) memory card with no problems in hd video mode. Pictures at full resolution are between 4 and 5 mb. Camera power on time is fast and shutter lag is good (i've used many digital cameras and this one is one of quickest i have used)I would say pictures are almost comparable to brothers panasonic dmc-fx150 which has full extending lense. I would recommend that camera if dust and water wasn't a concern. Almost the same size closed up.I would like to have time-lapse / interval record mode otherwise 5 stars best compact waterproof camera available.", "Date": "June 22, 2009"}, {"Title": "Great features and picture quality, but it leaked", "Author": "James M. Reid", "ReviewID": "RPVOSBJKG15OR", "Overall": "1.0", "Content": "I was looking to replace my point and shoot digital camera and I decided that the underwater, durable cameras had reduced in size and price enough that I could go with one of those as my primary daily camera. I went with the Panasonic Lumix DMC-TS1 because of its size and its ability to shoot 720P AVCHD video. The camera took great photos and very good video and I would highly recommend it as a durable outdoor digital camera. However, it is simply NOT capable of being used underwater reliably. The doors on the device for accessing the battery, SD card, and HDMI port are simple \"snap\" doors. It needs some type of clamp system to create a better seal. The very first time I used it underwater, it leaked and the camera broke. Luckily, I was still within my return period, so I returned it for a full refund. There are other underwater cameras that are better constructed for underwater use, but they don't have the feature set of the Lumix DMC-TS1. This is Panasonic's first entry into the underwater camera market, so hopefully next year's model will have the same, if not better, feature set but a better method of sealing the camera.", "Date": "November 21, 2009"}, {"Title": "To Boldly Go Where No Camera Has Gone Before", "Author": "S. Sethi \"Camera Cassanova\"", "ReviewID": "R3611E4XJFDII3", "Overall": "5.0", "Content": "Though it has a couple of annoyances which are the awkward Zoom button and no lens cap, it is a Magnificent camera. Image Quality is great, thanks to the Leica lens.You can go Anywhere, never worrying about water, rain etc. This is the perfect complement to my Olympus E510 DSLR. I take it everywhere and have taken great shots. It's like having a SUV to complement your Sedan.Best part, you can switch between photos and Video recording immediately, with no dials to turn.To sum up, if it were a Car, it's not a Land Rover, but a Porsche Cayenne, Solid, Refined, Comfortable and Reliable.To top it off, when feasible, how about a 32GB SDHC capacity?? With one or two of these cards, storage problems would be a thing of the past.", "Date": "May 29, 2009"}, {"Title": "Works well, seems solid", "Author": "N. Hoy \"NateHoy\"", "ReviewID": "R15L82WJ8BCDSQ", "Overall": "4.0", "Content": "Image quality in bright light is really excellent, flash is very good for a camera of this size and class, and the waterproofing does the job (took a few pictures from underwater in the kitchen sink the first day, figuring if I ruined it in water I'd better do it early).  Response time is very good, camera is loaded with features (and the facial recognition works surprisingly well).PRO: - Waterproof (which was the primary reason I bought it). - Better than average battery life (lasted about a week of light use). - Macro mode is really impressive, though the flash can \"white out\" the macro really easily if you're not careful composing your shot. - Nice wide angle lens.  You don't know how handy that is until you convert to a wide angle camera. - No external moving parts.  I like that in a ruggedcam. - Big, beautiful, bright screen and easy controls. - Build quality:  Doors are all nice latched things with spring hinges, waterproof seals look really good, all nice alumimum with very little plastic. - 720p video.  It's da bomb.  Even casual clips of stuff look really good.  Not \"BBC Planet Earth\" good, but far better than a camera this size seems like it should be capable of.  Audio is relatively clear, and the images are just amazing. - Picture quality.  Wow.  Just... wow.  In outdoor light (even clouds) images are just, well, astonishingly good.  Crisp, clear, colors seem good. - Obviously replaceable gaskets on the doors.  Because stuff wears out.  No idea how much replacements cost, but the current gaskets are well-made and look durable, and any damage to them is going to be visible.NEUTRAL: - Exposed lens.  Torn on this one, because I don't want moving parts in a ruggedcam, but I'd like the lens protected when not in use.  It is nicely recessed and seems durable, so I'll mark this as a \"neutral\" - Large and heavy for the \"teeny camera\" class.  But then again, it's waterproof and needs to be rugged, and you need a little extra heft.  It dwarfs my Elph, but still fits in a pocket easily.  For the \"small waterproof\" class, this does well. - MTS video default.  I disliked this at first, until I learned that Linux Mint supports the video format easily (it just doesn't like the file extension, so I had to associate that with a video player).  With the right codecs (right in the repositories), all of the popular Linux video editors had no problem loading it, editing it, and transcoding it to anything I wanted.CON: - Indoor photography is a tad noisier than I had hoped without flash use.  Not terrible, but not as good as I had hoped.  Image stabilization seems to work pretty well, though.  It's better than my old Elph, so I'll give credit where credit is due for a tiny camera like this with a small lens. - Connector on the camera side is not USB.  C'mon, guys.  I know the connector has other uses than USB, but put a USB-Micro or USB-Mini port on the camera.All in all, it's a great all-around camera, and it's almost a bonus that it's waterproof, even though I bought it primarily for that reason (I kayak quite a bit, and want something I can just strap to my PFD and not have to tuck in a bag every time I want to roll).  It responds well, the controls are relatively simple, it has decent 2-3 keypress shortcuts for a lot of the features, and it certainly looks like they knew what they were doing when they built it.If you want a waterproof camera, reviews are split between this and the Olympus D-10.  This has a slightly better shape for pocketing, and is a bit cheaper.", "Date": "April 23, 2010"}, {"Title": "Panasonic DMC T151 Review", "Author": "G. Speck", "ReviewID": "R1G5ZWWVKSIY77", "Overall": "4.0", "Content": "Am totally please with functions for all aspects.  I bought this for snorkeling and kayaking but have used it also for hiking as it is impact resistant. Most photos are excellent. The video is as good as my Cannon HV20 and functions well underwater.  I disagree with other reviewer on the video button, it is separate from the shutter release.  You can switch to video by simply pressing the red video button on the rear to start and end the video shot.  There is a blue cast when shooting directly into a backlit sun shot, but that is the only flaw.  Good presets and easy to get used to.  The AVCHD lite imports easily into IMovie and related programs. Does great upload to You Tube in HD.", "Date": "January 18, 2010"}, {"Title": "Leaked after 4 days at beach", "Author": "Snorkeler", "ReviewID": "R1ZOU76NXBOS1V", "Overall": "1.0", "Content": "I bought this camera for a trip to Hawaii. It leaked after the 4th day on the beach and the camera failed. The instructions are extensive for keeping the camera from leaking. I believe I followed the instructions in the manual. I have returned the camera to Panasonic, 10 days ago, and have not heard back from them.", "Date": "December 31, 2009"}, {"Title": "Panasonic Lumix DMC-TS1", "Author": "Ken2", "ReviewID": "R3NLK0BCNWLTTY", "Overall": "5.0", "Content": "Its only waterproof to 10ft, but thats all I need.Its small enough to fit in your pocket fairly easily.The features and menus are well thought out and easy to use.Video quality is very good. As of now, this is the only waterproof pocket size camera with HD video, and Zoom during video. It works well and the quality is great.The picture quality is good as well. Nice sharp pictures.I haven't dropped it yet to check the \"shock proof\" part of it, but hopefully that goes well.I'm definitely happy with the purchase.", "Date": "December 21, 2009"}, {"Title": "Not Waterproof! Decent Pics", "Author": "Michael Cain", "ReviewID": "R2A9PFLP9FX8IG", "Overall": "2.0", "Content": "I took the camera on a couple boat trips, and even went body surfing with it, and it held up well. The camera was rugged, as advertised. It didn't mind getting wet.Pictures were decent, not great, quality, but easy enough to tweak with freeware.The video format was irritating, as I can only download it with Panasonic Software. With that, the quality was great.*****Then I dove underwater to take a picture of a fish.  Though I was only about three feet underwater this was enough to break the waterproof seal.  Four weeks on and I am still trying to get it replaced under warranty.  Currently no one is answering the phone at the Panasonic McAllen Exchange Center.", "Date": "November 25, 2009"}, {"Title": "Excelent choice", "Author": "R. Miranda", "ReviewID": "RPK9WJ25JPJXC", "Overall": "5.0", "Content": "I brought this camera recently, and I must say it has exceded my expectations. The quality of the photos is really good, the waterproof system works with no problem and the HD videos in daylight are truly amazing. One of the things I really like is how long the battery life is. I thought the lithium battery would be a problem, specially when you go out on vacations and you don't have a place to plug the charger all the time. Anyway, this little battery lasts so much that's not an issue. This is the perfect camera. Totally Recommended.", "Date": "October 29, 2009"}, {"Title": "Great camera all around", "Author": "Christina M. Fan", "ReviewID": "R2K9R3HFFEF874", "Overall": "5.0", "Content": "I was looking for a waterproof, shock-proof camera that was vacation-proof and me-proof, seeing as how I tend to be a little clumsy.  However, I did not want to spend the money if I was going to be getting a camera that could not really be used for normal everyday use with friends, family, pets, etc.  I was very concerned that it was even possible, because I had been reading reviews on other cameras and there was a lot of mention of compromised image quality.  I had read great reviews on the Canon d10, but the camera was a little bulky when I saw it in person, for a camera that I wanted to bring everywhere with me, or slip in my pocket or purse.I decided to pay the extra money for this camera, and I'm glad that I did.  The images come out great above water, and the HD video is solid.  Even my brother commented that the pictures looked really great, when using my camera at a family event.  I also used this camera at the beach (the water in CA is a bit murky for any clear pictures) and filming my brother swimming (so he can look at what he needs to work on).  The camera worked great above and under water, and the video looks clean.  Underwater photos don't look 100% sharp like above-water pictures do, but honestly, if I showed someone the picture, they would never notice.One comment I noticed in other reviews was that the buttons were a little small  or closely placed, but I haven't really had a big problem with that.I got the green camera.  It's a nice shade of green, nothing too flashy but not boring either.", "Date": "September 19, 2009"}, {"Title": "outstanding camera for the price", "Author": "M. Liebschner", "ReviewID": "R3B7COH1RS9LBR", "Overall": "5.0", "Content": "We only have this camera for a month now and haven't used all the features, but this camera is one of the best we had in a long time. This far, we owned 6 digital cameras, everything from ultra compact to a larger size body - from cheap to moderately expensive. I don't think we will ever use all the features but it's great to browse through them and get to learn them. There are also two demo video's on the camera to demonstrate some of the features on the go.Due to the small size, the flash isn't as powerful as with larger cameras. Just something you have to deal with with any compact or ultra compact cameras. The other thing is that the lens doesn't have a cover, meaning there is always a chance that some finger smudges are on the lens when you take it out of your pocket.It's very easy to switch between picture mode and taking movies, just press the movie record button while in picture mode. I love this feature, there is no fiddling around with buttons to switch from one to the other. However, the one thing I couldn't figure out yet is to display the length of the movie while you are recording instead of posting the remaining maximum time you have for recording the movie. That would be nice to find since that helps to determine the movie size. I rather have two small movies instead of one large.Battery life is good, I am not concerned about not having a spare battery.", "Date": "August 27, 2009"}, {"Title": "For Use with new Windows Movie Maker", "Author": "J. Toren \"There is a God and I'm not Him\"", "ReviewID": "RIS9K5ZGS2QWF", "Overall": "4.0", "Content": "Hey if you have Vista or Windows 7 make sure you get the new Windows Movie Maker that can handle this video. I simply drag and drop the file into Movie Maker and then chop it up how I want it and save my new movie.  Worked like a charm!Pros: Great at pictures and video. I used it on a mission trip to Alabama with my youth group and it did its job well. I even took pictures and video while in the Gulf of Mexico. I could put the camera on the Intelligent Auto mode, hand it to the kids and not worry about it getting wet or dropped and at the same time get good pictures or video. It is very easy to use.Cons: Protect the screen on which you view pictures! I tossed this camera in a pocket in my backpack for the ride back from the Gulf of Mexico and when I pulled it out the screen was scratched up right in the center. I think I had my keys in the same pocket of the backpack but this camera sure wasn't as tough as I thought it would be. Now I worry about the lens. I talked to Crutchfield about returning it and they would have let me but I still elected to keep it (outweighing the scratches were the free memory card and camera case from Panasonic).Pointers: AVCHDLite that people complain about isn't that big a deal. Free programs that you can download and use with the .mts file (that is the file type AVCHD hides in some obscure random folder so look for it) are VLC media player or you can install the FFDShow MPEG-4 decoder which when installed helps Windows Media Player play your .mts files flawlessly.", "Date": "August 20, 2009"}, {"Title": "Another TS1 bites the dust.", "Author": "Tummybug", "ReviewID": "R1ZR1MHDCFA0YI", "Overall": "1.0", "Content": "I really should have read the reviews more carefully before buying this expensive camera.The point is that some TS1s seem to be waterproof, some not. Mine was of the latter type. Sea water killed it, even though I followed the instructions manual to the letter.I am very unhappy about this purchase, will most definitely NOT buy Panasonic ever again.", "Date": "November 15, 2009"}, {"Title": "Works good but some big problems too.", "Author": "A. Heyer", "ReviewID": "R2W87N2BNG0DB5", "Overall": "3.0", "Content": "I have been using this camera for about 1 week. Taking pictures underwater is really nice. I never went yet at more than 3 or 4feet. Fish pictures can be good even if the camera is sometimes a bit too slow.My main problems is that I have been suffering condensation on the lens on the first week, without being in the water. OK I was on a boat in the bayou with real high humidity. But I dont see that as normal for a waterproof camera. Am I supposed to return the camera? (edit: it is normal according to the company: not to me as it did not even went under water)Other than that my wife enjoy the camera and the automatic mode. I miss do not have priority mode. The camera is a bit poor on very low lights (concerts) but acceptable. Maybe 8megapixels with higher sensitivity would have been better.I am glad I bought a spare battery because it does not last very long. I mean my wife can make 200pictures in a little time and then it is over. I think I need to buy a car charger too for the road trips.The lcd screen is not bright enough under high sun. My previous lumix was better on that point.The power button is a bit frustrating but not as much as some reviews said.Global picture quality is very nice. Video is working well too. I still think it is one of the best point and shoot waterproof camera. For the price I would have love loved to have a adapted neopren casing.Edit: After two years camera stopped working. I opened it was all oxidated inside. Obviously water entered in it. I never dived with this cam and took it not that much under water, allways washed joints and never in the water with baterry trap open. I did not make the joint replaced after one year, not worth it for the price of the cam. To me it was a bit of a disappointing end. I lost a couple of picture that were still on the built in memory (damn proprietary cable). My wife miss this camera, but I dont. I am still looking for a camera like that with better ISO and better water abilities...", "Date": "September 15, 2009"}, {"Title": "Versatile and not-so-versatile", "Author": "K. Ong", "ReviewID": "R3PUELVGAH2DXJ", "Overall": "3.0", "Content": "A month after I bought this camera, I took it to an aquatic park to try out the waterproof feature. Complying with all of the precautions noted in the user's manual, water somehow seeped in where the battery was store, and the camera promptly stopped working. Panasonic is now replacing the camera. Aside from that, it takes great HD photos and movies.", "Date": "August 30, 2009"}, {"Title": "Couldn't Ask for a Better Camera", "Author": "Joe H Jones III", "ReviewID": "R3CQHK0K42P01A", "Overall": "5.0", "Content": "I have owned this product for over 3 years now and absolutely love it.Most recently my wife and I took this on our honeymoon to St. Lucia.  This thing still functions and performs like it did the day I pulled it out the box.  I took this out while swimming in the ocean and snorkeling in the ocean.  While at St. Lucia we got hit by Hurricane Ernesto and naturally I wanted to take a video of the ocean and tide.  The video quality produced by this camera exceeds my expectations still today.  I took this camera on a jungle mountain bike ride also and actually had an incident and fell right on top of the camera.  The camera had zero issues with it after the fall!  I weigh 165 lbs. and fell directly onto the camera.I am also an avid hiker and take this camera with me on all hikes.  It has worked flawlessly in the cold atop a 14,000 ft mountain with 40 MPH winds, snow and ice, and temperatures in the teen's.My wife is a photography nut and would say this takes mediocre to average pictures.  But for someone that is an outdoor enthusiast looking for a sturdy camera that will last and take what I consider great pictures and video, chose this one.", "Date": "January 2, 2013"}, {"Title": "Camera leaked", "Author": "J Smith", "ReviewID": "R3OKCD5ZSN1ML1", "Overall": "2.0", "Content": "Camera lasted less than 2 years before it leaked water after being submerged to about 3 feet in fresh water. Both door seals were carefully checked each time it was taken into the water, including the time it leaked. Not sure it leaked through one of the two doors however as the batter and SD card were dry. Water first appeared near the top of the screen, later fogged over the lens.Was a good camera up to this point, taking reasonable photos, rugged, and small.", "Date": "June 19, 2012"}, {"Title": "Crapped out on 2nd underwater trip", "Author": "S. Fischer", "ReviewID": "R34JRQ15U6LXQP", "Overall": "1.0", "Content": "I purchased this camera back in Aug. 2009 shortly after it was introduced.  The intent was to use it while snorkling in the Caribbean on a cruise. I used it underwater on three different dates during that cruise.  Although the viewfinder had a bit of fogging everything else seemed to work ok.  Per the instructions, I soaked it in fresh water after use and thoroughly dried it prior to opening the battery door.  At this point, I'm still happy.Took the camera with us again for use on a western Caribbean cruise in Jan. 2012.  Again intended use is snorkling photos.I again examined the camera's battery door and made sure no sand or foreign objects were in the battery door seal.  (Even used Panasonic's little brush).  Took the camera into the water on the first day of snorkeling (never under 5 feet, I might add) and that was the last time the camera functioned.  I first noticed that my setting had changed on its' own from \"underwater\" to randomly changing settings.  Brought the camera out of the water and attempted to change the scene setting again to \"underwater\".  No luck. Tried turning the camera off, then on again.  No luck.  The final death occurred when the camera refused to even turn on again.VERY DISAPPOINTED IN THIS CAMERA!.Paid $340 to J&R; through Amazon back in 2009 for the limited functionality of this camera.I also see that my case is not an isolated one.  MANY other folks have encountered the same problems.", "Date": "January 16, 2012"}, {"Title": "Good for a super compact, but no good for low light", "Author": "Kaichu Dento", "ReviewID": "R3GDE1PMAVX7L7", "Overall": "3.0", "Content": "I've had this camera for about a year and a half, but no flash working for the last year now. Loaned it out and it came back that way, so no idea what caused it to quit, although the rest of the camera is still in daily use.One reason I chose this camera was that I wanted to have as much zoom as possible, but not to have to deal with the breakability of protruding lenses, which I have broken every time I've owned one.Today I tried taking some shots of a couple bears and the slowness of this camera caused me to miss out on a couple great shots as one of the bears was walking. The best thing about this camera for me is simply that it stays right at my side day in and day out. I just wish they would offer one that had better low light capability and operated quicker between shots.", "Date": "August 30, 2011"}, {"Title": "Sold it", "Author": "AS \"Amazonian\"", "ReviewID": "R1AXMPL72OYRKA", "Overall": "1.0", "Content": "Didn't like it, couldn't stand the picture quality. The shutter lag was intolerable, I would click to caputure a moment and it failed every time. It was hard to photograph kids.", "Date": "September 1, 2010"}, {"Title": "Not waterproof", "Author": "B. Williams", "ReviewID": "RG3UABGD6YKHT", "Overall": "1.0", "Content": "Great camera as long as you do not submerge.  I checked all everything out and the first time that I submerged the camera the battery compartment leaked within a few minutes and now does not work.  I looked online and found that this is an issue.  I am extremely disappointed that this happened.  Before this happened I used it out of water and absolutely loved it.", "Date": "August 2, 2010"}, {"Title": "Not waterproof under 10 meters. Not waterproof under 10 feet.", "Author": "P. Clydesdale \"white trash art\"", "ReviewID": "R1T42YUB6ERVAF", "Overall": "1.0", "Content": "I bought this camera after losing my last Lumix to a leaky bottle of water in my backpack, specifically because it was waterproof. I took it in a pool yesterday in less than 10 feet of water and water leaked into the compartment that houses the battery and memory card. It is ruined. I am finished buying Panasonic Lumix cameras.", "Date": "July 6, 2010"}, {"Title": "High price to pay for 4 uses...", "Author": "Namita Bisaria \"Namstar\"", "ReviewID": "R2WV76GXFLOQ6X", "Overall": "1.0", "Content": "This camera, albeit a great buy for taking fabulous underwater pictures, is not made for extensive use for underwater snorkeling.  After four days of snorkeling in Hawaii and following the directions for cleaning and locking the battery and memory card compartment correctly, the camera filled with water in about 4 feet of water and ceased to work.  That's a huge shame for a week's worth of images and 200+ dollars.  I don't know how many users have attempted to really use the camera beyond a fish tank or two, but it's something to consider.  Maybe it won't happen to you.", "Date": "June 12, 2010"}, {"Title": "leaked at the first time", "Author": "F. Rickert", "ReviewID": "RK5DV0EQ87FLB", "Overall": "1.0", "Content": "on the first day i went snorkeling in vietnam the camera leaked! i'm really disappointed and can defeninitely not recommend the camera, if you want to use it in the sea.", "Date": "June 1, 2010"}, {"Title": "Great Camera for All Weather", "Author": "V. Wilson", "ReviewID": "R25ZMDOQ8UY8S9", "Overall": "5.0", "Content": "I love this camera. I'm an occasional photographer, so I wanted something small and easy to use. Bought this to take on a recent trip. It poured the rain every day and the camera worked flawlessly. Got great shots of a sculpture garden in the rain. It has exceeded all my expectations. Haven't tried it underwater yet. Battery is easy to charge and easy to change. Auto-focus works great for me, since I don't care to spend a lot of time with settings.", "Date": "May 20, 2010"}, {"Title": "Panasonic Lumix DMC-TS1", "Author": "Josh Sprague \"JS\"", "ReviewID": "R2O4LK6PH2NGAB", "Overall": "1.0", "Content": "I bought this camera hoping that it wouldn't be too cumbersome and assumed picture quality was a no brainer. Overall it's heavier than most digital cameras but that is to be expected as it's waterproof and shockproof so I'm good with that. The picture quality is absolutely horrible though. That part simply amazes me since so much work was obviously put into making a strong robust camera. I would not recommend this camera to anyone unless you want something waterproof. I've had 3 megapixel cameras years ago that take better quality pictures. I'm an experienced photographer and far above the average Joe when it comes to understanding manual settings as well as the automatic ones. I've tried many of the automatic default features, didn't even get into much of the manual stuff, and none of the auto features on this camera take good photos.", "Date": "May 19, 2010"}, {"Title": "NOT 100% WATERPROOF BUT 100% WORTHLESS", "Author": "Sebastien Franssen", "ReviewID": "R3KUCXH4X6ATNB", "Overall": "1.0", "Content": "Not much to say... I was looking for a waterproof camera. I have used it really carefully but it leaked after 10 minutes underwater.Panasonic doesn't want to replace it. So be warned... Considering the number of people complaining about the issue I would imagine that their \"waterproof\" camera is not yet 100% reliable", "Date": "May 4, 2010"}, {"Title": "A Mini Studio", "Author": "Photobug", "ReviewID": "R10RZUM9LDRGUU", "Overall": "5.0", "Content": "This is quite a little camera.  Just took it on vacation for two weeks, and although I did not submerge it, it did survive the rains of a hurricane.......!  The photos are very sharp and the colors are good.  Video is excellent in 720P, but did notice that the whites tend to blow out easily .  Suppose a white balance is in order.  Be advised, the AVCHD Lite format that is used for the HD video recording may present format issues on your PC if it is not running Win 7.  Mac's will have no problem with the format.  If you have questions about the video capabilities of this unit, type ' Panasonic DMC-TS1 ' in a YouTube search and check 'em out in HD.  It sells itself.", "Date": "April 18, 2010"}, {"Title": "Pretty decent for the price", "Author": "Online Shopper", "ReviewID": "R1B9FAG8GSAX62", "Overall": "4.0", "Content": "Not a bad little camera at all.  Indoor shots are good, outdoor shots are much better and video is good too.  For the price I paid it is a great little travel camera.  I haven't tried the underwater shots yet, but it will be the only camera I take on vacations as it is much smaller than my mega zoom Panasonic camera.  I am sure the new TS2 is much better, but the price I paid for this one couldn't be beat.", "Date": "April 14, 2010"}, {"Title": "A rugged little camera", "Author": "Amazon Customer", "ReviewID": "R16ZLX01WECZYM", "Overall": "4.0", "Content": "This is a fine camera for the money. The only substantial shortcomings are the placement of the lens in the upper left corner of the body which makes holding the camera a little awkward and the clustering of the controls in the lower right of the back making them easy to accidentally hit while using the camera. Also, it would have been nice if they used a standard USB cable for the interface so one wouldn't have to worry so much about losing the one that came with the camera.", "Date": "March 29, 2010"}, {"Title": "One of the Best Travel Cameras", "Author": "Big-Z", "ReviewID": "RMPK6RW9TT66L", "Overall": "5.0", "Content": "I have owned 32 digital cameras since 1992 and so I am very picky about image quality as the number one factor in keeping or selling a camera. I only have four of the 32 at the present time and this camera is one of them. Picture quality outside in plenty of light is amazing and compares very well to my 35mm digicam. Pictures are clean, bright, lively, and just plain beautiful. Even looking at side by side comparisons with this cam and my 35mm at the pixel level reveals little difference. The optics and the HD processor are great. Movies in the new format are amazing as well. It is a keeper.I cannot attest to its sturdiness or seals since I only plan to use it in rain and snow, so no testing underwater for me. In low light indoors, it is similar to other great pocket cams but not much better, but out in nature, it is outstanding. I like all the Panasonic cameras I have had over the past few years and another Lumix is on my keeper list. This is THE best travel camera for the price to date, since it is small, relatively light, and has no protruding lens. In short, there is no sacrifice in picture quality for the folded optics or the waterproofing.", "Date": "March 23, 2010"}, {"Title": "Great camera for fly fishing and underwater video", "Author": "Steven Adkins", "ReviewID": "R3KHWCK9PH28Z0", "Overall": "5.0", "Content": "I use this camera for fly fishing and could not be happier. It works great and takes awesome pictures. From fish to flies (nice macro settings) and underwater video of releasing trout, I am very happy wiht my purchase. I looked around and compared the other cameras features and prices and picked this one. It has 720p video, waterproof, shockproof (dropped it yesterday in the South Fork of the Boise while I was landing a rainbow, still works great), and takes great macro for flies and insects.I had read the reviews and was concerned about battery life and have been very happy with the amount of time that it keeps a charge. Also read reviews about the waterproof seals and have no complaints about it. I do try to air out the camera after every trip and make sure the seals are clean.Great camera that I would recommend and buy again in a heart beat. Worth the money on a camera that will be on my vest for years.", "Date": "March 22, 2010"}, {"Title": "Good little camera", "Author": "James Strutz", "ReviewID": "RVY0PFCTPXQ88", "Overall": "4.0", "Content": "Everything works as advertised. Image quality is very good for a camera in it's class (waterproof point & shoot). The menu and control layout is typical Panasonic, which is to say, easy to understand & practical. All the most used controls are quickly available, and the rest aren't hard to find. The wide zoom lens is very practical, and seems to focus well. Image quality up to 400 ISO is decent enough, and barely acceptable at 800. The competition isn't any better, and some are far worse. Panasonic's image stabilization is first rate as well, and video quality and ease of use are tops.The only real criticism I have is the potential for flare. This is nothing new, and no other waterproof point & shoot seems to do any better. But if you are shooting with the light in front but off to the side, try to shade the lens with your hand or you will get light streaks.The one other minor gripe is that the lens should be mounted in the middle instead of along the edge. In this position it is far too easy to get your finger in the picture, or to smudge the glass.", "Date": "March 17, 2010"}, {"Title": "Sturdy almost pocket sized", "Author": "Amazon Reviewer \"Phil\"", "ReviewID": "R11PK98JKWMH77", "Overall": "5.0", "Content": "Great build quality with tons of optional picture taking modes. Relatively easy to use and remember the various functions available. Terrific picture quality - but don't expect the same quality you would get from a top quality SLR. (I do own a top quality SLR to compare the results with). I have made excellent 8x10 prints and pretty darn good 13x19 prints as well. I haven't used it underwater yet however but the sealing seems adequate.", "Date": "March 10, 2010"}, {"Title": "Amazing camera with video capabilities!", "Author": "D. Roberts \"d rock\"", "ReviewID": "R2BFTRNTHPHN6D", "Overall": "5.0", "Content": "This camera really is incredible. For the features that it has, the waterproofing, and the video quality it was a knock out for me. Now, for those of you who have been looking up the specs on this camera, it says that you can record 720p at 30fps. Actually I have run multiple tests and the version that I got runs at 60fps (I got a Class 10 SDHC card though so I am not sure if the speed of the card matters or not). I have heard mixed reviews about this and some people say it runs at 30 some people say it runs at 60, so I would imagine if you bought a fast SDHC card then you could probably record at 60 as well. It really looks incredible too. The video roughly in SH mode runs about 22 to 26 mbps. Which is pretty uncompressed. The pictures are really really good as well. The only thing I will say is if you are expecting this camera to blow you away with pictures, then you have to be in a good lit area. The macro is absolutely astounding though, it truly is as good as they say, you can almost get just a few mm away from a subject and still take a clear, high def picture. For me, just the ability of the waterproofing, video options, and the Ai photo capabilities I was sold on this camera. This also is round 2 or 3 ( I cant remember) for Panasonic doing a waterproof camera and it really shows. All of the ports are protected in a nicely rubber lined sealing and the screen is a very nice large size. I would completely recommend this camera if you are looking for a great camera, camcorder, and rugged tag along.", "Date": "March 9, 2010"}, {"Title": "Love It!", "Author": "Dee \"Dee\"", "ReviewID": "R3NP966XB6140U", "Overall": "4.0", "Content": "I just purchased the Lumix - TS1 and I love it.  I am a basic user and I found the camera very easy to use.  The pictures are crisp.  The only critism I have is that it has a bulkier body than I would like and the lens is exposed.  But I bought a protective sleeve for it and even though it is bulky, it still fits in your pocket.", "Date": "February 21, 2010"}, {"Title": "Great Camera", "Author": "Photog", "ReviewID": "RLJF2OD621JTC", "Overall": "5.0", "Content": "Great camera.  I spent a lot of time researching all the cameras in the waterproof/freeze proof category.  Its easy to use. High quality pics and video.  I use it snorkeling, surfing, snowboarding, ice skating.  No problems with underwater use as long as you follow directions. (make sure the doors are completely closed and rinse after.  If you have an active lifestyle and want a compact camera to go with you, this is the one.  I'm very happy.", "Date": "January 30, 2010"}, {"Title": "Excellent Camera for the outdoors!", "Author": "A. J. Menard \"Al Menard\"", "ReviewID": "R1SZK05BISZFN2", "Overall": "5.0", "Content": "Purchased this camera to go on a cruise where I was planning of scuba diving.  Pushed the camera well beyond its depth limits.  Came back with great photos of stingrays, coral and fish.  Most people I showed photos to were amazed by the photos and the camera that took them.  It is rugged, and easy to use.  I left my SLR on ship and only carried this into port each time.  Video is crisp, with good color, and easy to shoot.  That was the second most amazing thing, getting such vivid HD video (720) of course underwater at a great price.  Filming while scuba diving was easier than while snorkeling as you can concentrate on being still while being able to breath and maintain buoyancy, more difficult while navigating with a snorkel.A great camera that I would recommend to anyone.In winter I plan on carrying this while snowboarding and shooting video in the terrain parks etc.  Used to always worry about the condensation etc with my other cameras going from really cold to the lodge.  Not anymore.Nothing bad to say.", "Date": "January 22, 2010"}, {"Title": "Waterproof, shock proof, slim, compact, beautiful, what more could you ask for?", "Author": "Praneeth Wanigasekera \"cricket lover\"", "ReviewID": "RT23WC2UR4RLZ", "Overall": "5.0", "Content": "I've finally found a camera that fits perfectly into my lifestyle. I don't need to worry about taking this on a rafting trip (I have a 100 beautiful pictures to prove it), I don't have to worry about putting this thing in my pocket going snowboarding, don't have to worry about \"waterproof cases\" for snorkeling, no worries about drizzle and rainy conditions: this can handle it all with ease! While doing all this, it still looks like a fashionable \"normal\" camera.To add to this, the camera has excellent image stabilization, much better than Canon powershot series that I have used. If you have shaky hands, no worries with this camera, you really have to try hard to get a blurry picture. Another cool feature is the \"intelligent auto\" mode which sets all of the settings automatically adjusting light, focus, etc to just right, although I prefer the regular auto mode for night pictures.Only weakness I can point to is a weak flash (night shots can sometimes not be illuminated enough), and the lack of a lens cover. Also, don't forget to wipe the lens well after it gets wet or night shots can get spotty from dirt in the water and stuff.Other than that, this is an amazing camera and I recommend it enthusiastically to anyone.", "Date": "January 21, 2010"}, {"Title": "***Very pleased***", "Author": "MAC \"Mac\"", "ReviewID": "R1JVFWWYI9BXLO", "Overall": "5.0", "Content": "I purchased camera 1 month ago and took it on a Disney cruise vacation. It delivered some spectacular pictures and very quick and efficient. I dropped it and also took some great underwater snorkeling pics. My children also were able to take wonderful pics ages 7 and 9 easily. The record mode is easy to use and a great feature for high quality HD video. I definitely would recommend it so far.Battery life is pretty good.", "Date": "January 20, 2010"}, {"Title": "A Very Nice All Purpose Camera", "Author": "J-Stroke", "ReviewID": "R26FUVHUZJU0X0", "Overall": "4.0", "Content": "I like to canoe and I don't want to have to carry any more \"stuff\" than necessary.  The electronics I do carry need to be waterproof - cell phone, GPS, solar charger, and camera.  I took a chance and ordered this Lumix six weeks before it was released because it claimed to not only be a waterproof still camera but also an HD movie camera.  I've had it for months and have really abused it.  It's been dropped, squashed and dunked more times than I'd like to admit. On my last outing while shooting a video I dropped it in the mud and rinsed it off in the creek, all while it was continuing to record. I am very satisfied with its durability and I'm amazed I haven't scratched the lens or compromised a seal.Still pics are very good (keeping in mind it's a point and shoot). There's not much of a zoom but I was more interested in the wide angle, which is as advertised. I compensate for the limited zoom by shooting all pics at 12MP and blowing them up later as needed.Movies are okay but don't expect it to compare to a dedicated HD camcorder. The video quality is very good but the \"stabilization\" is limited and the zoom feature does not pan in and out slowly and smoothly; it has one zoom speed - fast. Bottom line, the HD video component is a great bonus feature on a very nice compact waterproof still camera, nothing more.The rechargeable battery seems to last forever, even when shooting videos, but I do carry a backup for long trips. If you plan on taking many videos get a couple of SD cards of at least 8GB.All in all, I am very pleased. If you have the money and space to lug an HD camcorder with you in addition to your compact camera, you would be better off doing so. But if you want a small package that does nothing great but many things well, this is it.", "Date": "January 5, 2010"}, {"Title": "Very nice quality pictures", "Author": "Raghu Inti", "ReviewID": "R3HA7BHJJOS96H", "Overall": "5.0", "Content": "I am a beginner (basic user) camera user. I was using the Lumix FZ5 with good results and was looking for a waterproof camera. It was a toss up between this and the canon D10. I chose this for its portability and wide angle.Bought this camera for our trip to Florida. It is an excellent waterproof camera, worked well in/on the beach. The pictures were sharp. The colors were accurate. A little too much noise at higher ISO levels, but that is pretty standard at this camera level. In low light situations, the flash is a little too bright and makes the pictures appear a little artificial. Love the videos it generates. Very portable and great looking camera, unlike the egg shaped canon, which can look out of place for every day use.I recommend this camera with very minor reservations (not enough to drag it down to 4 stars).", "Date": "January 4, 2010"}, {"Title": "well.. not that impressed!", "Author": "missceline", "ReviewID": "R3W01L6S0GI5Y1", "Overall": "2.0", "Content": "Well, after a trip on a beach and our old Sony cybershot camera getting sandy, we decided to look into the \"tough Cameras\".  We were very excited about getting this Panasonic.  After  a few weeks of use in different circumstances we were a bit disappointed though about the image quality.  Low light images are so grainy I feel like back 10 years ago technology.The very good thing was the macro. I was very impressed by the picture quality and as well the Wide angle which can be useful.I am sad that the overall quality is not as we expected, because we really wanted a \"tough camera\".  But what the point of having it \"tough\" is the quality is not met?I am returning it and getting a regular point and shoot Canon PowerShot instead!", "Date": "December 15, 2009"}, {"Title": "Died after 3 pictures underwater", "Author": "Naoyuki G. Saito \"shibaowner\"", "ReviewID": "R1E4DT2412T5TT", "Overall": "2.0", "Content": "We would like to think that this is not a typical experience, but in our case, this camera did not work out.  We purchased this camera days before our cruise vacation.  We were actually very happy with the camera (features and portability, especially) and the picture quality, even though I thought the pictures with flash appeared a bit harsh.Unfortunately, the camera died just after 3 pictures underwater while snorkeling.  It appears that the lid/gasket protecting the battery/SD card compartment was faulty on ours.  When we opened the lid (which was latched closed at the time of this \"event\"), some water came out.  We let the water drain out and we dried the compartment the best we can.  However, the camera never turned on.On the other hand, we are very happy to report that the helpful people at Amazon has arranged for a prompt return and refund.  We were very impressed with their customer service on this occasion.Pros:  Compact, Appears to be sturdy, Good color selection, Decent picture quality for a compact cameraCons:  Menus a bit confusing (too many options), the shape not quite good for steady grip, photographs with flash appear a bit harsh, our camera did not hold water out (probably an isolated case of a defective camera).", "Date": "December 6, 2009"}, {"Title": "Better than I expected", "Author": "William J. Kelly", "ReviewID": "R194SEVEJP9E81", "Overall": "5.0", "Content": "I bought this camera to replace a four year old Sony Cybershot and wow have I been impressed. I wanted something a little tougher and waterproof this time so I didn't need a case to take it snorkelling and this fit the bill. Under water pictures turn out great as well as every day pictures. I was concerned that the image quality wouldn't be up to snuff after reading some of the reviews but they are far and above better than the pictures taken with the old Sony. For the price and the features you can't go wrong!", "Date": "November 28, 2009"}, {"Title": "Got this camera for kayaking", "Author": "Kevin Lawrence", "ReviewID": "R3VBLTWTSSBE7V", "Overall": "5.0", "Content": "I wanted a waterproof camera that I could take with me in my sea kayak and have readily accessible. I've been using a Nikon Coolpix 4300, but was missing too many pictures opportunities because of the time it takes to remove it from the water-tight bag I carried it in. I also couldn't use it when there was a lot of spray in the air.The Panasonic DMC-TS1 has solved those problems.  With its non-protruding lens it is even smaller than my old Coolpix and slips easily into a pocket on my PFD. I can pull it quickly from the pocket on a moment's notice to capture a picture and can do so at any time in any conditions (as long as I'm able to take at least one hand from my paddle).  I haven't tried putting it in the water, put it has done quite well in fresh and sea water spray.Picture quality is better than I expected.  I'm still getting familiar with all the settings and features, but I'm just blown away by the technology in this little package.  It pays to understand the various settings so that the camera can be used to its best advantages.  I suspect some of the disappointments and complaints I read about in the reviews come from not understanding the operation of the camera well enough.I've tried the video a couple times and have also been impressed with this feature.  This is the first video-capable camera I've ever had and I'm looking forward to doing a lot more with it.", "Date": "October 18, 2009"}, {"Title": "Panasonic TS1 is almost perfect", "Author": "Griselda G. Santos \"JC\"", "ReviewID": "R2H7YMYNL3YZCJ", "Overall": "4.0", "Content": "This camera is similar to when I bought my Canon digicams where the quality of the images are very good for a point and shoot.  I would recommend it to anyone who is looking for a small, waterproof and takes great pictures not as good as DSLR but still very good.  Even the HD video is very good and because it uses AVCHD lite files it records longer videos so that's a bonus.", "Date": "October 14, 2009"}, {"Title": "Great camera, only 4 faults so far...", "Author": "N. Ho Koon", "ReviewID": "R1H69QWPY4RG0X", "Overall": "4.0", "Content": "I bought this camera for my vacation to the US specifically because of its ability to record in HD while being both shock and waterproof, and extremely portable; I don't think there's another camera like that out on the market!It takes excellent pictures and video on the ground, in water and in the air! It has an aerial photography setting which really forces the focus to stay at infinity; I've never had a camera that has that option!The problems that I have with this camera however are:- Proprietary battery - I'm accustomed to owning cameras that use AA or AAA batteries since you could just switch batteries if they die- No manual focus- No manual shutter/aperture control- A bit slow to react", "Date": "September 17, 2009"}, {"Title": "Excellent camera", "Author": "P. Baker \"satisfied customer\"", "ReviewID": "RBEWU4ICVCAJ4", "Overall": "5.0", "Content": "We lost our last camera when it accidently went overboard off the kayak with me.  This camera has been nice because it is very compact, still takes high quality pictures, and I don't have to be anxious about it when we're kayaking and exploring the beach.", "Date": "August 24, 2009"}, {"Title": "Leaked and dead", "Author": "G. Wolf", "ReviewID": "R16U2MRBKDNDJ6", "Overall": "1.0", "Content": "Owned for 2 months - survived a trip to Mexico, in the ocean and pools, no problem, but the next time I used it in water (in a 3 foot deep pool), it leaked, - camera suddenly turned off and I saw fog on the inside of the lens. After drying, I checked the seal, opened the battery compartment, water drops everywhere.I had a 10megapixel Olympus, which I took down to 50 feet while diving, never had an issue with leakage. Panasonic did not get it right with this one, with their seals.Going to contact the manufacturer, see what they say on a return...such a pain in the neck, even if they do come through on a replacement.My suggestion, if you want a waterproof camera, is buy an Olympus.", "Date": "June 20, 2010"}, {"Title": "Great pocket camera", "Author": "Michael B. Harris", "ReviewID": "R14UD7OUXW9NZM", "Overall": "5.0", "Content": "Bought to suppliment my DSLR and it is a great addition. Focus, tracking and picture quality are very good.Oh and drop it or dunk it in a stream and keep taking pictures. Freaking fantastic in the rain too. Goes places I would never dream of taking out my DSLR and then I get to take great looking pictures.", "Date": "October 3, 2009"}, {"Title": "any recommendations for SDHC card?", "Author": "J. Fong", "ReviewID": "RCD7DLPPYDK86", "Overall": "5.0", "Content": "I've had this camera for a couple months now and have used it at three different beaches in and out of water.  It has held up admirably! With temperature changes, the camera lens does tend to fog up a bit. Sometimes a simple wipe across the lens cover works, but other times the build-up is inside and there's not much you can do except dry it off and let it sit with the battery door open for a bit. I think this is most noticeable when there are big differences in water and air temperatures! (duh!)anyways, it's been great and the video is fantastic. it's strange why the video seems to come out so impressive, but the pictures seem to be relatively at par or just a few hairs below normal point-and-shoot cameras. though, for waterproof/shockproof units, it is head and shoulders above the rest.One problem I had when I first purchased the unit is that the video function would keep stopping. It meant sometimes I could only take 15 sec clips and other times maybe 3-4 minutes.  It was hard to tell why that happened, but now I'm always a bit afraid that it's going to turn off in the middle of a recording and so am not prone to leave the unit recording (i.e. on a tripod) without having to constantly keep checking on it.  It seems to be better now, but I'm still a bit nervous about that.  Anyone else have this problem?Other thing is that I bring a big ziploc bag with me when I travel to soak the camera in freshwater after I've been in the ocean (this is recommended in the manual). It keeps salt deposits from building up in the nooks and crannies (i.e. around the buttons and openings) when the seawater dries off.I had a quick question for other owners about recommending SDHC cards.I want to take as long and continuous HD video footage as possible with this camera.1) What is the largest card and what speed do you recommend (class 4? class 6? 15mb/s?)?2) What is the maximum length of time you have been able to record in one clip? (I want to be able to record a 1-4 hour series of presentations without having to constantly check the camera.)I recommend the camera to anyone who wants to take good portable videos (we're talking much better than youtube - but you have to find a good converter to go from MTS to other formats) and needs the ruggedness this unit offers!  All in all, I'd buy it again without hesitating!", "Date": "September 26, 2009"}, {"Title": "waterproof fail", "Author": "C. Alexander \"DC\"", "ReviewID": "R28NEHRW17VP0N", "Overall": "2.0", "Content": "This was a great camera for a couple of years until it leaked. It only went on 1-2 trips a year so, it is not over used by any means. I was always very careful with the doors to keep out water/dust/sand, etc. But, no use, it eventually gave out and is now ruined. Not sure how it is leaking, the seals have always looked clean and solid, but somehow it's leaking. I don't think our current technology has fully developed to accomodate a water/shock proof feature for under a few hundred bucks. I was hoping this camera was more durable than a few trips.", "Date": "December 25, 2013"}, {"Title": "Very good camera", "Author": "Josh Obudzinski", "ReviewID": "R1XR795LN20QP", "Overall": "5.0", "Content": "Use this camera everywhere and for everything.  It is great.  My daughter has dropped it and we bring it in the pool the ocean, nothing is stopping it.  Just need to make sure to rinse it off after a day of fun and let it air dry but great purchase overall.", "Date": "September 16, 2013"}, {"Title": "TS 4", "Author": "Louis Rothman", "ReviewID": "RDU6TYWG2GQJ3", "Overall": "5.0", "Content": "Great camera.  The TS 4 was substituted for the TS 1.  Much newer version. I would reccomend this camera for the novice photographer.", "Date": "August 17, 2013"}, {"Title": "Four years later, still going strong", "Author": "B. Sanger", "ReviewID": "R1QWWH6A77JY5", "Overall": "4.0", "Content": "After four years with the TS1, I thought about getting a new waterproof/shockproof camera lately and even sampled one of the newer Panasonic Tough models. In the end, decided to keep chugging along with this oldie but goodie. It is still waterproof and shockproof and takes better pictures than the TS5 from Panny. The newer models have a lot more bells and whistles - WiFi, GPS, colorful little menus - but in the end, it's about picture quality for me. This baby has been used extensively on trips to Aruba, Mexico, Ireland, Egypt, Nevis and a lot of domestic trips as well. In the water, on the beach, mountains, jungles, horseback, camelback and it still hums along just fine. The only complaint we've ever had about it is that the sun can mess with the video, causing lines in your recordings. However, I simply try to avoid those situations when recording video now. Guess I'll keep going with it until it breaks down.", "Date": "August 10, 2013"}, {"Title": "Great Camera", "Author": "Vance Richards", "ReviewID": "R1YLHRZ11M5HGN", "Overall": "5.0", "Content": "This is a great camera, easy to use in all modes and the quality of the pictures are great.  Highly recommend", "Date": "July 15, 2013"}, {"Title": "Why do I love it!", "Author": "Scott", "ReviewID": "RJMUKZW91VARM", "Overall": "5.0", "Content": "I use my iPhone for most pics these days, but to be able to zoom, and more importantly, get it wet, this baby takes excellent pics, is durable, and yes, I have used it in, around and under the water successfully.  For these reasons, there is still a place of a point and shoot camera in my life.", "Date": "July 3, 2013"}, {"Title": "Bought this for my son when he went in the Navy", "Author": "tim smith", "ReviewID": "R3VAGMPIXK30X0", "Overall": "5.0", "Content": "Great camera, heavy duty, water resistant, he has been using it to get some great memories. If you know someone that is hard on camera equipment, this is the camera.", "Date": "January 6, 2013"}, {"Title": "Great camera for hiking/adventures", "Author": "J. Coon", "ReviewID": "R27P251OC82HNK", "Overall": "5.0", "Content": "I wanted to take nice pictures on a trip to Costa Rica, and didn't want to carry around a big camera... this one did the job just fine! Takes great pictures, and the Sunset mode takes very cool pictures of the sky. I have one 30\" picture hanging on my wall", "Date": "December 28, 2012"}, {"Title": "I would get this camera over and over again!", "Author": "Sonya", "ReviewID": "R2GYGN4JEWV9D0", "Overall": "4.0", "Content": "I bought this camera for New Year's 2010. The first place I brought it was into Mammoth Cave National Park on the wild cave tour. I was told most cameras get damaged while crawling, and if not then, when trying to take a photo getting filled with dust. My camera did not have that problem. I got quality photos in the cave and because of the water proof features it also kept the dust out.Next, I took this camera to Key West four months later, where I snorkled with it. I again took many quality photos while under water.Two months later I took it into the Atlantic Ocean in NJ, pools in St. Petersburg, and teh Gulf of Mexico and the camera still works perfectly fine.I've \"dropped\" the camera numerous times to show others how awesome it was...and it still is awesome.HOWEVER, I cracked my screen showing off. :o( The camera still takes AWESOME pics, I just need to replace the small piece of glass in front of the camera.I would recommend this camera to anyone, and I will definitely buy another one when this one is gone...which doesn't look like it will be for awhile.", "Date": "December 15, 2012"}, {"Title": "durable, with pretty good quality of image", "Author": "C. Koontz", "ReviewID": "R7ZFQGY8TTL5O", "Overall": "4.0", "Content": "This camera has withstood several seasons in the desert and mountains. My only issue is with the zoom. It claims to be an optical zoom, and yet the resolution seems to get way worse when zooming in.", "Date": "October 21, 2012"}, {"Title": "My beach camera", "Author": "My First Underwater Camera", "ReviewID": "R2LD41I7MYQLQV", "Overall": "4.0", "Content": "Wanted a camera with right pixels and rugged for underwater photography for my Miami trips and the pools.I got just that and the images came real good. Had to read the quick start guide and the detailed manual for optimally utilising the features available.", "Date": "November 18, 2011"}, {"Title": "Took on Cruise and to Mexico", "Author": "Adam", "ReviewID": "R2O362WVHHP89C", "Overall": "4.0", "Content": "I bought this camera in 2009 to take on a cruise to Mexico and again to the beaches of South Carolina in 2010. It has performed great as an all around camera and camcorder. Picture is is decent not great, but if you know how to use photo editing software then the images can look fantastic with just minimal adjustments.  As for the water resistance, once again the TS1 was great - I used the TS1 underwater in pools taking photos and recording video as well as in the ocean at Tulum, Cozumel, and Playa del Carmen, Mexico with no issues at all. As for preventing the TS1 from being damaged from water, you MUST (as with any waterproof electronic device) FOLLOW instructions. It was a great buy in my opion, because you do get 720p HD video recording and the ability to zoom while recording. Incredible features for the price versus many other cameras.4 Stars(instead of 5) only because of photo quality versus price paid and I would have liked better photo shooting in darkness. However, other features such as variable zoom distance depending on image resolution and the HD video recording could push it to 5 stars arguably.", "Date": "September 13, 2011"}, {"Title": "This camera is not waterproof. Stopped working after one use.", "Author": "Linda Lam", "ReviewID": "R3BWRBYHBFDXYM", "Overall": "1.0", "Content": "I was very excited when I brought this camera to our Cancun vacation. The first day it was fine when we used it in the pool for a little while. On the second day, it stopped working after a few shots. It turned out that water had leaked into the camera! The color on the pictures that we took had too much blue in it and turned all the faces blue. This is not a good camera at all. I am very upset that I wasted so much money on this one!", "Date": "August 18, 2011"}, {"Title": "Loved it when it worked, but should have lasted longer before leaking", "Author": "ks", "ReviewID": "RJTHKRAA9XPLQ", "Overall": "3.0", "Content": "Owned it and used it camping and underwater for about 2 years.  Then one day, without warning and without any visible signs of wear or dust in the seals, it leaked water inside, permanently destroyed.  I think it should have lasted longer, particularly since it was quite expensive, i cared for it as instructed and visually it looked as good as the day i bought it.", "Date": "July 18, 2011"}, {"Title": "Not sure how they can sell as waterproof", "Author": "NJB", "ReviewID": "R13IINQRG0Z3MT", "Overall": "1.0", "Content": "Made it on two snorkling trips. On the trip it developed a leak. Expensive mistake. I should have went with the Canon. And listened to all the reviews on Amazon. Live and learn.", "Date": "July 17, 2011"}, {"Title": "Leaked", "Author": "B. Dudley", "ReviewID": "R348V8Z330TJLA", "Overall": "1.0", "Content": "I have owned several Panasonic Lumix branded cameras, but this one was a disappointment.  The controls are a little awkward, but I wrote that off since what I wanted was a water proof camera.  I guess I still want a water proof camera since this one leaked through the battery door and the camera is now ruin.", "Date": "May 24, 2011"}, {"Title": "Ok as long as you don't get it wet!", "Author": "Dr. P. R. Stauffer \"eldoggo\"", "ReviewID": "R12AUK19EEFMN8", "Overall": "1.0", "Content": "second water vacation.;  First day.  Snorkeling and staying close to surface. Camera stopped working.  $200 to exchange!!!!  The camera is just over a year old and had very little water exposure. Trash.  Nice heavy build quality and probably OK for mist next to a water fall but do not plan to swim with it- NOT A GOOD CAMERA FOR WATER.", "Date": "May 23, 2011"}, {"Title": "average photos, lasted less than two vacations", "Author": "scott greenberg", "ReviewID": "R2QIQIVIUHW6PR", "Overall": "2.0", "Content": "I bought this camera about a year and a half ago.  went surfing in costa rica.  video was extremely shaky and unsuable when on a surfboard- en with stabilization on, but it survived the trip.I just came to the virgin islands and went snorkeling. camera stopped working after 10 minutes and I was staying on the surface- maybe the camera went down to 3 feet.build quality seem really good but it is a terrible waterproof camera. Pictures and video average.  But if the camera can't really handle the water then it isn't really worth buying- not the camera I would use for dry land pictures and definitley will not be buying another one of these for the water.  Haven't contacted the company but I am sure The cost to fix it will be prohibitive.", "Date": "May 16, 2011"}, {"Title": "My constant outdoor companion!", "Author": "A. Fandl \"classics nerd\"", "ReviewID": "R2EWPPVQOQD6B6", "Overall": "5.0", "Content": "I bought this camera last summer (2010) to take on kayaking trips.  It's wonderful!  I am just your average point-and-shoot amateur, and it suits me perfectly.  The quality of the photos is amazing, and it definitely is waterproof.  I recommend getting a floating wrist strap for it though: recently my kayak capsized and the camera had not been directly attached to the boat, but the bright orange floating strap ensured that I easily retrieved it from the swift current.  After it had been floating downstream, fully submerged, for about 5 minutes, it worked just as well as before my boat had overturned.  I was able to upload all the photos like normal, and I can't even tell that it took a tumble in the river!", "Date": "April 18, 2011"}, {"Title": "Plain  Great!!", "Author": "Eugene Brana", "ReviewID": "RHI4J5P5A7OGS", "Overall": "5.0", "Content": "This is one of these thing that I consider a must for traveling. Quality of the pictures are great (Not perfect) camera size is exactly the size that you need for portability and handeling. Beside, water, and shock proof what else is needed?", "Date": "April 7, 2011"}, {"Title": "This is a great outdoors companion camera", "Author": "Trapshooter \"UncleGuido\"", "ReviewID": "R2VF2CTEKHPNFL", "Overall": "5.0", "Content": "I purchased this camera about 1 ½ years ago, primarily for photos taken from a Kayak.  I have shot well over  1000 pictures with this camera and I have not been disappointed with its performance.  It has been in the duck blind, the pheasant field, the ocean for underwater pictures, and on the ski hill during snowstorms.  It weathers everything and takes good pictures.  It has been dropped, dunked, taken into salt water, and it still works like a charm.  It works in freezing cold temperatures and scorching hot climates.The construction is very rugged, and despite the use/abuse I have given to it, it looks nearly new.  Most importantly for a waterproof camera, it has not leaked.My kayaking takes me both in salt and fresh water.  In the summer I kayak a lot on and near Lake Tahoe, and the waves frequently break over the bow.  I keep this camera in the pocket of my PFD (lifevest), and it routinely gets wet, even drenched. When it is wet, you have to be careful to get the drops off the lens, because this will mess up the shot.  Other than that, the camera controls are easy to manipulate, and they are intuitive.", "Date": "April 5, 2011"}, {"Title": "This thing is a champ", "Author": "Manuel Altamirano Jr. \"Manuel Altamirano\"", "ReviewID": "R3BI67RGKS35JE", "Overall": "4.0", "Content": "Takes great pictures and is an all around great camera to have around. After breaking 2 previous cameras due to sand getting into them; this one is just a perfect care-free solutoin. The wide-angle is perfect for self portraits and tight spaces.", "Date": "April 4, 2011"}, {"Title": "Seals are failing", "Author": "Pablo509 \"paulf509\"", "ReviewID": "R27D0N6VA9WGRY", "Overall": "2.0", "Content": "I've had this camera for about a year now.  I have taken the camera on 4 trips and the camera has been in salt water perhaps 15 - 20 times.  I only snorkel so the camera has never been deeper than 5 feet and I rinse and dry the camera after each use.On my last trip. While I was in the water I turned the camera on and noticed the LCD flashing (or flickering).  I turned the camera off and exited the water I took the camera back to my room, rinsed and dried it, and opened it up (took the battery and SD card out).  I played with the camera several more times during the reminder of our trip and the problem seemed to go away.  It appears that one of the seals may have leaked, as the problem is now gone.  I am not confident I can take this back in the water with out replacing all the seals.  I bought this camera expressly for use while snorkeling. I would expect the seals to last longer than a year, especially given the care that I showed the camera (and the price of the camera).As far as picture quality goes, it is average at best. I have a Sony digital camera (8 MP) that I bought in late 2007 or early 2008 that takes better pictures than this Panasonic. The picture quality degrades more in low light situations (like dusk). Given the options available today I would probably choose another brand of waterproof camera.", "Date": "March 30, 2011"}, {"Title": "Great Camera for the Outdoors", "Author": "N. Barrett", "ReviewID": "R3B8C1SJWI4KDY", "Overall": "4.0", "Content": "I've had two of these cameras, lost the first one during a snowboard trip in Lake Tahoe (hint: take a picture of your business card so that if you ever lose it someone will hopefully return it to you).  It is a great durable camera that you can take anywhere and shoot anything.  This camera has been with me surfing, snowboarding, and on safari in South Africa and has worked like a champ.  I think picture quality is great for this type of rugged/waterproof camera.  You won't get the picture quality of a high end point and shoot or SLR but I'd rather sacrifice minor picture quality for the ability to take this camera anywhere and capture those moments rather than no pictures at all.  The macro feature is also awesome on this model.  The only negative I have for this camera is the waterproof depth rating (<10ft).  That said, I have never had a problem with the camera leaking.  I definitely recommend this camera and would purchase again.", "Date": "March 20, 2011"}, {"Title": "Annoying movie format", "Author": "_LARS_", "ReviewID": "R1MQXGJ4XXNI7O", "Overall": "3.0", "Content": "Generally like the camera but the videos that it take are in some annoying video format that makes it very hard to get them off of the camera (if you don't use the software that comes with the camera).  Panasonic won't let you download the software after you've bought the camera so if you lose the install disc you are basically screwed with video.", "Date": "March 20, 2011"}, {"Title": "Beware!", "Author": "kmtk24", "ReviewID": "RY9GORCJN7F18", "Overall": "1.0", "Content": "I Purchased the Panasonic Lumix DMC-TS1 on 02/3/10 along with the Panasonic marine camera case.  One of the main reasons for purchasing the Lumix DMC-TS1 was the \"waterproof\" camera itself.  I thought in the seemingly rare case that  the marine housing were to leak  the camera itself would be \"waterproof\".  I thought I had a good back up plan.  However on a shore dive (only the third vacation of using the Panasonic camera and housing), the housing leaked allowing water in the case.  The shore dive was fairly shallow, no greater than 30 feet.When I returned to the resort from the dive, I quickly removed the camera from the housing that was 1/2 full of water.  I rinsed the camera off with tap water to rid the salt water.  I let the camera air out for 24 hours before reassessing.  I expected the camera to turn on, when it failed to turn on I was shocked.  This is the first time the camera ever came in contact with water and it was while it was in the marine housing.  My brother has a Canon that accidently got wet when his housing leaked and it still works, and it is not advertised as being a \"waterproof\" camera.So I have two failed pieces of equipment from Panasonic each costing over $200 dollars.  It happens to be 3 weeks over the year warranty.  I have the wonderful opportunity of mailing in the defective equipment (at my cost) and for $45 I can have their technician look at it.  After it has been assessed, a repair fee will be given and thankfully I can apply the $45 dollars to the repair fee.I  have a Sealife camera and marine casing that has never leaked over the years of use.  If you are planning on taking pictures while diving, you might want to consider other cameras.", "Date": "March 12, 2011"}, {"Title": "DON'T BUY THIS CAMERA!!!!!", "Author": "A. Waggoner \"Waggonab\"", "ReviewID": "R2TV29AM219FME", "Overall": "1.0", "Content": "My wife and I are professional photographers.  We take the majority of our photos on vacation with the same camera I use at weddings (Nikon D300s).  It is fantastic.  However, I wanted an underwater camera I could use while snorkeling both for photos and video.  I read through several of the reviews here on Amazon, and decided this had the best HD viedo quality out there.  The first time we used it, it was great!  5 months later we used it again in Mexico, and I started noticing water behind the glass and in front of the lens that was distorting the quality of the video.  Also, there was water behind the lcd screen.  when we returned from our vacation, I immediately contacted Panasonic to replace my camera.  I was happy with how fast they did this.  However, we just recently got back from a cruise in the Caribbean, and the camera didn't work more than 10 minutes before it completely stopped working.  We were able to retrieve what little footage we had, but were unable to use it the remainder of the trip.I contacted Panasonic this time wanting my money back.  I don't think they deserve a third chance.  Needless to say, their customer support has been appalling.  The people themselves haven't been too terrible to work with, but they are obviously given no power to make any type of decision to take care of the customer.  They are simply refusing to refund me my money, and are going to send me yet another camera that I won't even take on vacation with me, because I have no faith in it's reliability.  I will never purchase another Panasonic camera again!!!  Please don't make the same mistake I did.  I purchased this camera from Amazon, and am going to see if they will at least refund me my money if I send back the new camera they send me this time.  I'm not counting on it.", "Date": "February 25, 2011"}, {"Title": "Waterproof Seals Failed", "Author": "Zara", "ReviewID": "RB6UKIMWP1YK5", "Overall": "1.0", "Content": "I am really disappointed in this camera. I was able to use this camera approximately 10 times and poof! Even following carefully the instructions to avoid water intrusion the water got into the camera. I snorkel in the ocean with a floating vest, so I don't go deep past the established limit of the camera. I also did not like the lag time turning on the camera and between shots. I found it a little hard to see the screen so sometimes I had to guess as to where to point the camera. In the video playback on the computer you can hear the motor of the camera zooming in and out. $200+ wasted. On the positive side I like the look and size of the camera and how easy it was to carry it around and how it fits in your hand. It would help if the buttons where a tad bit more prominent.", "Date": "January 31, 2011"}, {"Title": "great camera for travelling/adventure but not for low light shots", "Author": "savera", "ReviewID": "R1UHY8I7H543HF", "Overall": "4.0", "Content": "I got this as backup for my Nikon D80 in places where it wasn't easy or convenient to use.  I got it for the fact it's waterproof and shockproof. It's good for taking pictures where there's lots of light, good for outdoors, water activities, etc. but not an ideal camera for low light such as parties. The quality isn't that great but that's not why I purchased this camera so overall I'm happy with it but just wished I could get better pictures in low light.  Compared to other waterproof and shockproof camera, it looks more sleek and stylish and not that bulky.", "Date": "January 18, 2011"}, {"Title": "Decent camera, but not fully waterproof", "Author": "Evan", "ReviewID": "R27LBLM9OOAYAD", "Overall": "4.0", "Content": "I got one for my brother, and made sure he knew how to care for it before he used it.  The first time he took it to the pool, it worked fine.  The second time, it leaked and broke.  Even within 30 days of buying it, Panasonic wouldn't stand by their product.  Luckily, Amazon came through and took it back.  My brother bought the newer but more expensive TS2, which is much better.  If you're going to get your camera seriously wet, go with the TS2 instead.Panasonic Lumix DMC-TS2 14.1 MP Waterproof Digital Camera with 4.6x Optical Image Stabilized Zoom with 2.7-Inch LCD (Silver)", "Date": "January 15, 2011"}, {"Title": "Leaked", "Author": "Amazon Customer", "ReviewID": "R374LPC1448BGV", "Overall": "1.0", "Content": "As with other reviewers, this leaked. It worked fine for about a year and then one day it leaked and that was it, despite all the seals being in place. The construction is frustrating because you have HDMI and AV digital inputs, which I imagine few use and it was these ports that were the cause of the leak.", "Date": "January 12, 2011"}, {"Title": "Great camera, very sturdy!", "Author": "BlueSkieyes", "ReviewID": "R36OIMHP1Q6D8S", "Overall": "5.0", "Content": "This camera has worked pretty well so far. My favorite part about it is the sturdiness--can get wet or go under water, get muddy or sandy, etc. I've dropped it a couple of times on accident and it still works perfectly. I've broken OTHER cameras before just by taking them to the beach and getting a grain or two of salt in the lens, but THIS camera is built like a fortress. And it comes with really sweet photo software, with a feature for making panoramas.My only qualm with this camera is that it does not take good low-light pictures. (But then again, the only brand of point-and-shoot cameras I've seen take good low-light pictures (sans flash) is Canon.) Other than that, a great camera!", "Date": "December 31, 2010"}, {"Title": "Exactly what I wanted and what was advertised", "Author": "Kaya W.", "ReviewID": "R3TEDSLMZO8KI9", "Overall": "5.0", "Content": "I needed a camera that was dust and waterproof. I'm very hard on my equipment and this product has been awesome. Its been droppend and taken to the desert with highly alkalai dust, and gone mountaineering and come out perfectly. Dropping it once did put a tiny little dent in the metal housing but that's why it's metal right? Plastic would have surely cracked. The photos are a little soft but being able to get photos realiably is important to me. Battery life is very good. I'm very pleased with the wide angle and it's zoom.This is a camera I would recommend to friends and family.", "Date": "November 30, 2010"}, {"Title": "sucky", "Author": "Corey Alexander \"Corey\"", "ReviewID": "R2UV86NZWVZKUO", "Overall": "1.0", "Content": "quick shipment but arrived broken - do not buy from this seller they refused to answer my emails", "Date": "November 10, 2010"}, {"Title": "Good but not great", "Author": "Nija Mashruwala", "ReviewID": "RUI36CWXLH9KL", "Overall": "3.0", "Content": "I may have been expecting too much when I got this camera. I found that while I like it, I don't love it like I had expected to.The biggest pros are that it takes great pictures in well-lit settings and most outdoor locations, the video quality is generally quite good, it works extremely well with my computer (a Mac), and that it is very durable and relatively portable. The user interface is a bit nonintuitive, and while the number of camera and light options is good, they aren't always useful. A peculiarity to this model is that I have to hold down the rather small On/Off button for about 2 seconds to get it to turn on, yet only have to tap the button to turn it off.The biggest cons are the amount of noise, the color quality in lower light or indoor pictures, and that the back screen gets scratched and smudged when I keep it in my purse. Accurate color correction on my computer (I use iPhoto) is generally hard to do for low-light pictures because of the poor color information and amount of noise. Minor issues for me are that it connects to my computer via USB but doesn't charge through it, and that it is often uncomfortable to hold.I haven't tested the water resistance or the seals. Even though battery life hasn't been a problem, I plan to buy an extra battery to keep charge and swap out when I need to, just in case. Overall, I am happy with the camera, but do feel that it is over-priced for what it does. If I were to purchase a similar camera now, I'd seriously consider the DMC-TS2, which wasn't out when I bought my camera.", "Date": "November 3, 2010"}, {"Title": "Great for the beach!", "Author": "Jamie", "ReviewID": "R2ODWCPEA50ACY", "Overall": "4.0", "Content": "I love this camera!  I bought it about 4 months ago and have taken it in the ocean, the swimming pool, etc.  I haven't noticed any leaks and it still works as well as it did the day we got it. The picture quality is great for a point and shoot.The only issue I have is that the LCD screen scratches easily.  I've never dropped it but I have had it in our beach bag with sand, coral, rocks, etc. and the LCD screen has quite a few scratches on it.  It's not really an issue to me because it doesn't affect the pictures, but I know it might bother some people.", "Date": "October 14, 2010"}, {"Title": "Wide angle on land or at sea", "Author": "sun state", "ReviewID": "RR79YLQ3PK1F1", "Overall": "5.0", "Content": "Excellent vacation camera on land or at sea, incredible video,Wide angle lenses A+.", "Date": "October 4, 2010"}, {"Title": "Better than expected - great \"active Dad\" camera", "Author": "P. Burke", "ReviewID": "R3UHGRDUHULWI", "Overall": "5.0", "Content": "I bought this camera after having gone through a series of brands and styles of digital cameras over the years.  I found I was doing more and more short video clips of the kids, so I wanted a camera that would take high def video and good birthday and wedding kind of photos, but also a camera that I could take fishing or boating and not worry about it getting damp.  After lugging around a lot of camera bags, I also wanted something that would easily go into a jacket pocket.I really wasn't looking at Panasonic, but in searches and reviews this camera just kept coming up over and over.  Being on the higher end of the cost range in relation to stated features, I got this with some trepidation, but I've had this camera for about 4 months, I've taken hours and hours of video and thousands of photos, and I have to say it has been a great buy.  I have taken a few underwater photos, just to see if it worked, but I don't think I'd take it diving....overall, I have no regrets.The Pros:Great video and picture quality.Very good battery life and reasonably priced extra batteries.Shock proof - I have \"tested\" this feature on more than one occasion.Video screen quality.Very good image stabilizationPre-set \"scene\" modes that make sense and actually work.Relatively easy to use menus and buttons.The Cons:No view finder...not really a con once you get used to it and battery life is good even with the big screen on all the time.The outer metal case is tough, but it dents and scratches pretty easily, more cosmetic than anything else.The recessed lens is great for shockproofing....hard to clean.Fair to adequate sound quality.  This is really the biggest con.  Given how nice the video quality is, the lacking sound quality is really an issue.", "Date": "September 30, 2010"}, {"Title": "The coloring was off on this camera", "Author": "D. Beck", "ReviewID": "R1X3ADRQY11CQF", "Overall": "3.0", "Content": "My brother and I both ordered this camera.  The color on my camera was off and all the pictures had a blue tint to them.  My brothers pictures came out great though.  I had to return my camera because I did not care for the coloring at all.The service from Amazon was excellent!", "Date": "September 29, 2010"}, {"Title": "Great camera", "Author": "Colorado skier", "ReviewID": "R1WNRGH52XVTZJ", "Overall": "5.0", "Content": "I have had this camera for 4 months now and have tested it in several countries and a few oceans.  This camera's metal body feels very strong.  I've even dropped it from 5 feet onto a hard floor and no damage at all.  The waterproofness is excellent also.  I've been snorkeling in the ocean several times and never had a leak.  The seals still look brand new.  This camera's been wet and dusty.  Not a problem for it.  I thought the lack of a lens cover would be an issue with scratching and it turns out not to be the case.  I had a Samsung waterproof camera with a movable lens cover and I returned the camera for several reasons.  One of which was the cover would jam with just a little bit of sand or dirt.  The Panasonic does not have this problem.The underwater photos are of acceptable quality.  The biggest issue is finding water that is really clear to start with to make great photos.The video feature I use a LOT.  I then edit the video on my MacBook and make DVD's with it.  The finished product is very nice and all my friends have loved their videos.My only complaint is this...  The included software for the panoramic picture processing does not work very well with my Mac.  It's a downright pain in the kartukis.", "Date": "September 27, 2010"}, {"Title": "AWESOME CAMERA--- and can withstand my hard knocks.", "Author": "S. Lindquist", "ReviewID": "R2M1QGJ6M43IA8", "Overall": "4.0", "Content": "AWESOME CAMERA--- and can withstand my hard knocks. This camera is great.  It is the fourth 'pocket' zoom I have bought.  --- I carry it on my belt, at work, outside... - the last two cameras were broken thru my tough use, and dropping...I gave it 4 stars on picture quality, only because it does not have as good a lens as my previous Lumix 10x zoom... pocket camera... -- but that camera was larger and had a lens that extended, so I would expect better photos...For a tough camera... this one is great....I would buy it, again... hopefully, I won't have to!", "Date": "September 25, 2010"}, {"Title": "NOT Waterproof", "Author": "JasonHanley", "ReviewID": "R3MZZJ5LSWF807", "Overall": "2.0", "Content": "Good picture quality, and excellent HD video.Bad design. Case is not waterproof, as claimed.As many reviews state (see also DMC-FT1 -- same camera) the camera stops working after a few underwater trips.I was lucky enough to get about 5 or 6 snorkeling runs with it, but on the last one, I snapped two shots, and it was done.This is basically a very expensive disposable underwater camera.Not recommended.", "Date": "September 25, 2010"}, {"Title": "cruise camera", "Author": "Darrell A. Johnson \"Eagle Hunter\"", "ReviewID": "R3ANFOBJL7BPN1", "Overall": "5.0", "Content": "I did my homework and it paid off. I love this camera as did all the people that saw me use it on my recent seven day cruise. I put a floating strap on it just in case I droped it while snorkeling in the deep and it worked great. My pictures look professional above and below the water. The movie mode is great and very easy to use. This thing is small enough to slip into your pocket while dressed in a suit and tough enough that it did great on the zip line in Isla Roatan. People would ask me if it was waterproof as I was about to put it in the water, that was my time to brag on my new camera. I took over 400 shots with this thing in all conditions and never had to delete a picture because it was bad. My desktop picture on my computer looks like one from National Geo. but I took it with my Lumix DMC-TS1 12mp. Our pictures were only missing one thing... a sitting fee from a professional photographer, the results are the same. To say the least I AM IMPRESSED. My kids 14 and 11 even took good pictures with this thing. It also did great while tubing in a cave in complete darkness. Love it! Glad I got to review it. But most of all glad it is mine.", "Date": "September 22, 2010"}, {"Title": "Great camera", "Author": "Bigdeezs", "ReviewID": "R13NVT1IJON2GV", "Overall": "5.0", "Content": "I love this camera. It takes great photos even compared to non-underwater cameras. I havent takin it underwater and dont plan to. My last camera broke from sand damage and I got this one to make sure that doesn't happen again. I dont even want to test its water proofness. One thing i hate is that the video is taken is either .mov or avchd formats. Why cant these things just take .MPG or .AVI format. Stupid apple and quicktime nonsense. I end up converting all my videos now...ugh.", "Date": "September 21, 2010"}, {"Title": "Major Problem with \"Waterproofing\"", "Author": "Catherine Hovell", "ReviewID": "R1M4N4BEPWYM2B", "Overall": "3.0", "Content": "We have owned and liked this camera for nearly a year, and had fun with it near and in water on many occasions.  I took it with me this past weekend on an outdoor adventure that was a bit more rugged... and was horrified to look down at some point in the day to see the battery / SIM card door had popped open.  Goodbye, waterproof-ness, and, as I was in water at the time, goodbye, camera.  Fortunately the SIM card was still readable, but the camera is a loss.If you're going to use this camera in wet and rugged situations, you might want to consider taping over the two critical doors.  I have seen rubber sleeves for some other similar cameras, but am unable to find one for this camera... the sleeves help protect those door openers, for sure.  Too bad none are available for this model.", "Date": "August 19, 2010"}, {"Title": "Great camera for active use", "Author": "Alison", "ReviewID": "R2HUTAF9IFNDPQ", "Overall": "5.0", "Content": "We have gone through a number of cameras as we are active and take them with us.  After the last one was ruined by water again I did some research and discovered this one.  Have used it now on two vacations and love it.  Very durable and waterproof on the boat!  Doesn't matter if it gets splashed while taking fun pictures.  The speed burst fuction is great and you can catch some fun shots.  You just have to be willing to go back and sort through a TON of pictures to find the ones you want to keep since it takes so many.  The batter life is not as long as I would have liked so I purchased a second battery to keep on hand.", "Date": "August 16, 2010"}, {"Title": "Top notch images even if it's a water camera", "Author": "John Ss \"Johnny S\"", "ReviewID": "R16VIO7348J0R9", "Overall": "4.0", "Content": "We got this camera for our Great Barrier Reef Trip, where we did 3 days of snorkeling in up to 10ft of water.  The camera performed with no complaints.  We've now had this camera 5 months and are quite happy using as our every day point and shoot.Pros:The images are very sharp and colors are vibrant.Camera use is very easy with many shooting modes including food, face, pet, panoramic, etc.Not bad shutter lag in low light situations.Very sturdy and durable.Cons:It may be Panasonic, and a little nitpicky, but the push button feel and sound selection of the clicks are electronicky and seem cheap.", "Date": "August 12, 2010"}, {"Title": "i'm happy with this camera", "Author": "Locutus", "ReviewID": "R3GJZJ8U63XP5J", "Overall": "4.0", "Content": "This camera takes really nice pictures for its price ($228) and it's even water proof. I wouldn't suggest anyone to submerge it under water because I've heard about all the problems ppl were getting but at least it can take some water spills with no problem.", "Date": "August 8, 2010"}, {"Title": "My second and probably not my last Lumix", "Author": "S. Zemlo", "ReviewID": "R1A0WK8NSM705B", "Overall": "5.0", "Content": "First off... for all you people complaining about the AVCHD format... here's a converter that works very well if you don't have decent editing software.[...]This camera does everything it says it does. I know there is a lot of discussion about just how waterproof it is or isn't, but I gotta say... mine has worked just fine from kayaking, to pool parties, to swimming in the ocean.  I did get a little fog inside the lens at the beach, which probably isn't a good thing, but it went away and still works just fine.  I think as long as you are very thorough when checking the seals before you close it when changing the battery or SD card, it will be as waterproof as they advertise.  Now I'm not ruling out the possibility of defects. So I guess it may be a lottery situation like with many electronic devices.As far as picture and video quality... obviously not the BEST, but definitely great for what the camera is designed for and the price.  The pictures are a little washed out sometimes (not all the time), and the audio on the video is definitely lacking (once it's gone underwater your lucky to hear anything unless you tip it upside down and tap the water out of the mic holes), but considering digital cameras this size even 5 years ago shot medium quality video (at best), it is a very good camera.Obviously there will be improvements in the world of compact waterproof cameras in the years to come, but for right now, I don't think you can ask for anything better for this price.", "Date": "August 5, 2010"}, {"Title": "Awesome little camera", "Author": "LgT", "ReviewID": "R3UDUKARLJJ8O1", "Overall": "5.0", "Content": "I bought this camera primarily for its ruggedness and underwater capability. Did extensive research and decided this camera offered the best combination of image quality, features, and design out of all the \"rugged\" cameras I looked at. I already own a Nikon D40 DSLR and several lenses for the times when I need serious image quality and flexibility, but if I'm going to trade off capability for portability with a compact camera, it would be nice to get some new capabilities in exchange, and this camera delivers.Image quality is decent for a compact. Not anywhere as good as a DSLR, but certainly better than a lot of Sony and Olympus models I looked at, which smudge every last ounce of fine detail into what looks like a water painting. I usually shoot mine at the 5MP setting to save on memory capacity, and I don't see much difference between this and the 12MP resolution. There's just no way this tiny lens and sensor will capture 12MP worth of detail, not even close to my 6MP DSLR. The bonus of this option is the extended zoom feature, which uses only the center portion of the sensor, thus allowing me to zoom in closer without degradation in image quality, unlike regular digital zoom.Some other notable features I like:-relatively fast auto-focus for a compact-usable zoom range, starting at a moderately wide 28mm equivalent focal length-optical image stabilization-easy exposure compensation-\"intelligent exposure\" to tame the highlights and shadows in high contrast scenes-macro shooting-adjustable white balance (no fluorescent preset, but can set custom WB using a white/gray card)-variety of scene modes, including long exposure and lower-rez high speed burst (about 7fps)-dedicated button for HD video recording with optical zooming and image stabilization-nice-looking design, doesn't resemble a plastic toy cameraThe waterproof capability seems to hold up just fine. I submerged the camera in my sink, and saw no problems. Also took it on a wet and wild boat ride where it got splashed with salt water as I was filming video, then washed it off under a faucet when I got home, and the camera performed without a hiccup.Overall, I'm fairly happy with this camera, and the price is very reasonable for the capabilities it offers. In fact, it spoiled me, and I would not buy any other compact camera unless it offered at least the same kind of ruggedness and features.", "Date": "August 2, 2010"}, {"Title": "Great Picture", "Author": "Fat Daddy", "ReviewID": "R2KOBP1IGUUDB2", "Overall": "4.0", "Content": "Love the hi res videos this camera produces. It makes some internal noises that can be loud when playing your video back. I haven't tested it in water yet. But the sound is super, the picture is amazing, and it slips into a pocket. I gave the portability a four, because the lens placement is in a precarious spot. I often put my fingers across it, and have to be conscious of it while shooting. I ordered the back up battery, so I never run out of time.", "Date": "August 2, 2010"}, {"Title": "Very decent.", "Author": "Cat Tree", "ReviewID": "R2I02OXTD73VLE", "Overall": "4.0", "Content": "Very good camera, especially for the price. Quality photos. Good lens. The under water feature works well. The camera is pretty and sturdy, the software smart enough and the AI setting works well. Video was better than expected. Recommended.", "Date": "August 1, 2010"}, {"Title": "Great pocket Camera.", "Author": "MTRCTYLARRY", "ReviewID": "R2U0C1KECHDXB0", "Overall": "5.0", "Content": "Great little pocket/travel Camera. Pictures are very clear and crisp. Only wish it had a little more zoom.", "Date": "July 23, 2010"}, {"Title": "Nice camera but...", "Author": "Becky Sue", "ReviewID": "RFBO8E6M49D77", "Overall": "4.0", "Content": "I ordered this camera as a gift, and it functions well, but the focus motor broke about 2 weeks after receiving it. I hope Panasonic will replace the camera with a new one, not one that's been refurbished.", "Date": "July 19, 2010"}, {"Title": "worked great but NOT waterproof!", "Author": "amberuna", "ReviewID": "R33H2KPM9CK3XD", "Overall": "2.0", "Content": "I really loved this camera and had it over a year. I took it to the beach and it worked great in the water, but a year later when I took it in the pool I double checked that all the compartments were secure but water still made its way into the battery compartment and the camera was ruined. However, I really did love the camera up to that point. I do think it takes great pictures and I am sad that I can't use it anymore. I just want to let everyone know that the 2nd time I used the camera in the water it did not proove to be completely waterproof. Next time I want a waterproof camera I am going to splurge for the Sony DSC-T900 and the MPK-THH Marine Pack. My father has this and it works great!", "Date": "July 13, 2010"}, {"Title": "Lumix Fun Camera", "Author": "Helix", "ReviewID": "R2FHOC6Y4N2GED", "Overall": "4.0", "Content": "Most fun I've ever had with a camera - playing in and below the surf and no worries of water on the camera.  Nice video, good picture quality.", "Date": "July 8, 2010"}, {"Title": "Easy-to-use.  Good all-round camera.", "Author": "ambric", "ReviewID": "R2QTDWXTRTUNAF", "Overall": "5.0", "Content": "We have had a few Casio Exilim cameras before this one as carry-with-you snapshot devices.  Those were slim and inexpensive, but one died due to a drop in shallow water and the other due to a drop onto concrete.  Those experiences made the Panasonic's water- and shock-proof claim attractive.  We used it on a mission trip to Southern Texas and I will not go back to Casio.  The picture quality is notably better, especially the outdoor pics.  We took it in the ocean and captured some really great video, too.  I like the \"iA\" feature which automatically selects a scene mode based on what the camera sees.  It works pretty well for most conditions and helps you get good shots without having to mess with settings.  The start-up time is also very good.  Taken together, these features mean I could whip it out and grab a shot at a moment's notice (which is important in a snapshot camera).  My favorite feature, though, is the wider angle lens.  I was really surprised how much more you can fit in a shot with it.  It actually takes some getting used to as you have to either move closer or use the (very adequate) zoom to get close enough to see people's faces.  It's much better than the old \"scoot in a little closer\" while backing up to try to get everything in the picture.  The menu setup is pretty intuitive, too, unlike some cameras I've played with (like an Olympus which was terrible).  Overall, I am very pleased with the camera and would say the extra cost was definitely worth it.", "Date": "June 30, 2010"}, {"Title": "Good quality if you want a tough camera", "Author": "Susan I. Spark \"swim with da fishes\"", "ReviewID": "RJ1ZBKPI4E6JZ", "Overall": "4.0", "Content": "I wanted a pocket size camera that could be knocked around a bit (e.g. clumsy, outdoors person).  This camera is quite good for that.  Its \"baptism\" was on a tubing trip in Texas, and it was submerged rather a lot without issue.It isn't necessarily great for distance pictures if you want to try and zoom in a bit.  What surprised me is the amazing quality of macro shots.  I did not expect that, but it is exactly the type of picture I love taking.  I can use full zoom within a few inches of the subject, and the detail is impressive.I will be going to Hawaii in a few weeks and am thrilled to have this camera.  To be honest, it will not be my main camera.  But it is a great accessory camera and to bring along when a bigger camera is too big or delicate to risk.  It will be far more maneuverable than the \"underwater bag\" I used last time for my larger Canon.If you do not need a sturdy camera, there are far better options.  The feature of this is really that it takes decent pictures and you don't have to worry about it getting beaten up.", "Date": "June 28, 2010"}, {"Title": "Nice camera for the beach", "Author": "BC", "ReviewID": "R2HJJPDF9AAU3T", "Overall": "4.0", "Content": "Good quality pictures, decent video.  Great substitution when conditions are too hazardous for my dSLR.", "Date": "June 18, 2010"}, {"Title": "A Great Camera if you can hang on to it!!", "Author": "Michelle S. Peters \"Michigan Angler\"", "ReviewID": "R1H3Y0IB6BKBIH", "Overall": "5.0", "Content": "I purchased my Lumix DMC-TS1 in January 2010 to use when we go fishing.  I wanted a camera that not only could take digital pictures, but one that was waterproof.  I used the camera successfully for 5 months until it was stolen on our fishing trip last week in Northern Michigan.  I am still upset that someone would take or find something that is not theirs.  They got a great camera!I liked how easy it was to use and the quality of the pictures.  I never had a chance to use it underwater or take video.I just ordered another Lumix replacement, but upgraded to the DMC-TS2.  We shall see how well this camera works.", "Date": "June 15, 2010"}, {"Title": "Best possible camera for that price", "Author": "Chancho Salvaje \"Chancho Salvaje\"", "ReviewID": "R2QI6GNMN3UJV8", "Overall": "5.0", "Content": "It is a great camera. The underwater performance is great. I used for a shooting a video about rivers and combining the underwater videos with a Canon's 7D footage was seamless. The quality of the lenses is really good.", "Date": "June 9, 2010"}, {"Title": "Good 2nd camera to SLR", "Author": "Richard D. Roth Jr. \"Sujost\"", "ReviewID": "R1LF2SXN79JZ7", "Overall": "4.0", "Content": "I have used a full size DSLR for years but can't always cary it.  This is a sturdy camera with very good image quality.  Check out [...] and [...] for un biased reviews.  This camera comes in the top two for water/shock proof units.  So far I really like it and haven't had my SLR out since I bought this because it's always with me now.", "Date": "June 3, 2010"}, {"Title": "Amazing value!", "Author": "Jim Hern \"jimbohio\"", "ReviewID": "R3QAP2TZDL9480", "Overall": "5.0", "Content": "I am a video producer and this unit just saved me THOUSANDS of dollars by allowing me very good quality images above AND below water!!! In addition, I did NOT have to lug all sorts of equipment, just this little camera that fits in my pocket or around my wrist! BRAVO Panasonic!", "Date": "May 12, 2010"}, {"Title": "Love this camera - perfect for snorkel", "Author": "Katydid \"Katy\"", "ReviewID": "R22JANTVFXTV5D", "Overall": "5.0", "Content": "We purchased this camera for our big trip to South America.  We particularly wanted an underwater camera for use in the Galapagos.  The camera is easy to use with one hand.  Although the water was murky at time, it took great pictures.  The stablizer was good for pictures taken while we were in the zodiac going to and from the boat.  We didn't have to worry about getting wet.  The only negative I can think is that we had a challenge to keep our fingers away from the lenses.  We took lots of video and pictures - the battery would hold up for an entire day of many shots.  It recharged quickly when needed.  I am so glad we have this camera.  It fits in a pocket or slips into the fanny pack.  Great little camera.Panasonic Lumix DMC-TS1 12MP Digital Camera with 4.6x Wide Angle MEGA Optical Image Stabilized Zoom and 2.7 inch LCD (Orange)", "Date": "May 10, 2010"}, {"Title": "Durable", "Author": "D. Burns \"DKB\"", "ReviewID": "R2SZLVQ4Q9LEVZ", "Overall": "5.0", "Content": "I purchased this camera right before a family trip to the Dominican,  We took over 500 photos and additional 30 videos.  The camera performed flawlessly.  It was used in and around the ocean, beach, and pool.  Simply rinsed it off with water, and wiped it dry with a cotton beach towel.  The added bonus was the kids using it to take underwater pictures in the pool.  It kept them busy for hours.  With the editing software that came with the camera, it was easy to crop and personalize the pictures.  The only problem that we have had is the format for the video.  I couldn't just save it and play it.  Probably my lack of technical savy.  I feel the camera is worth every penny I spent on it, and would recommend it to anyone looking to have a compact camera they can throw in their pocket and really take almost anywhere.", "Date": "May 10, 2010"}, {"Title": "Takes beautiful pictures with loads of optional settings!", "Author": "Z. Marine", "ReviewID": "R3DEVU1Q0CNRPP", "Overall": "5.0", "Content": "I've had to throw away my last two cameras because of recurring lens errors due to dust getting in the optics, so I bought this camera as a way to end that annoying cycle.  Having said that, I was quite taken by surprise at how great this camera is!  I haven't tested its underwater or shock-absorbing capabilities, but the pictures it takes are gorgeous!  On top of that, there are oodles of settings you can use to adjust things how you want (specifying ISO, aperture time, red-blue color settings, white balance, etc.).  For an amateur, there's definitely more than enough options to meet your wildest wishes.  Add to that the fact that the camera is beautiful and I really couldn't recommend it more.  But if it has a lens error in a year I'm coming back and writing the most scathing review imaginable.", "Date": "April 13, 2010"}, {"Title": "Great little camera", "Author": "Martin", "ReviewID": "R3KQZV34U0C948", "Overall": "5.0", "Content": "I haven't actually taken this under the water as yet but in six months on terra-firma (up mountains, in the baby's mouth, in sub-zero conditions, on boats with spray)this is a great performer that you don't need to worry about. That's what I was after a rugged camera that I could take anywhere.Plus the HD video is better than from my Flip Camera.Impressive.", "Date": "April 12, 2010"}, {"Title": "Panasonic created a winner", "Author": "Michael A. Warrick \"<><\"", "ReviewID": "R2T4JTHETVGJYG", "Overall": "5.0", "Content": "Best little camera I ever bought.  Great picture quality.  Hi-def video is beautiful and always in focus.  I take it mountain biking and hiking.  It never disappoints.  I love being able to not worry about it.  I filmed Shamu while getting soaked!  Great stuff to share with others.  The only complaints are that the record button for video is so small you can't work with ski gloves and the zoom control is very stiff.  Other than that, I love to show off my cool indestructable camera.  Plus the orange looks way cool.  No regrets!", "Date": "April 5, 2010"}, {"Title": "blurry photos", "Author": "Cicero", "ReviewID": "RPKJZ9GKBE10X", "Overall": "3.0", "Content": "Bought based upon good reviews, but the camera takes blurry photos unless you are _absolutely_ still. Thought it might be this unit so went to a store and tested theirs, same result.Can't return it but wife bought an Olympus - I plan to EBay this one.", "Date": "March 28, 2010"}, {"Title": "Shadow to the left?????", "Author": "J. S. Gideon", "ReviewID": "R2LKM5V50CFVLU", "Overall": "3.0", "Content": "Got this camera on Friday and noticed that indoor shooting with a flash leaves a shadow or shaded outline to the left of the person or object I am taking a picture of.  Does anyone know how to resolve this?  If I cant fix it I am sending it back.  Other than that I have no complaints of this camera.  Outdoor pictures are great.  I havent tried submerging it yet due to the warranty limitations.", "Date": "March 21, 2010"}, {"Title": "Love it!", "Author": "Navi", "ReviewID": "R2WBRASADWOOIE", "Overall": "4.0", "Content": "I originally swore by the canon digital elf cameras, as I hadn't found a pocketable one that had nearly as good quality for my lighting conditions, and my uses. However, my canon's keep breaking, partially because I let my kids take pictures, and occasionally they get dropped (usually it's a lens error), or one time my son snitched it and dropped it in his water table. I had researched the cannon waterproof/shockproof camera, and found reviews on cnet.com for other, similar cameras. This one appeared to be the best overall, bsed on the review. I found it here on Amazon and purchased it. I've taken quite a few pictures with it and am very pleased. One thing I like better than my old canon cameras, is that the flash doesn't seem as powerful, so I don't end up with whitewashed pictures. Getting the video to work was a little tricky, but then I didn't read the user manual. ;)", "Date": "March 1, 2010"}, {"Title": "Love it so far.", "Author": "DanC", "ReviewID": "R25OLB8598NKTM", "Overall": "5.0", "Content": "Okay, I'll submit this now even though I have not yet used all aspects of the camera, like the video option.  So keep that in mind.  Anyway, I have a Pentax DSLR and it's great.  But sometimes you just don't want to carry it and the lenses around.  So with an excursion to Chicago coming up I gave in and bought the TS1.  Due to my bad habits of kayaking, sailing, cycling and just being outside a whole lot it had to be a water resistant (\"proof\" is a big word) camera.  This seemed to be the best combination of protection from the elements, portability, and picture quality for me.  I hate tons of menus, \"options\", and clicking!  Good for me that a short go over of the instructions was all I needed to get on my way.  I found the menus easy to deal with and sensible when I wanted them.  First time using it was in Chicago walking around at night.  I had read some bad reviews on low light performance from this camera so oh well I thought.  Holy cow the pics looked amazing!  Now this is in the city with lit up buildings and such but still night.  The detail and evenness across the photos really surprised me, in a good way.  These were all taken hand held so we can assume the motion stabilization works well.  Color was also excellent.  Next day, cold as crap but full sun.  Again the pics look great.  The viewer was easy to see even with the bright day.  Also did well at a snowy mountain bike race later on.  Fun.  Inside was good as well.  I did find the auto white balance seemed to have some trouble with some types of lighting.  But this is not a big deal in my opinion.  One it was not that bad, and I put my pics into the computer and can doctor them some anyway.  A little tweaking and they look just right.  I do this with my DSLR too by the way, I'm sure most of us do.  One big factor for me; this camera has a wider lens than some of the others, 28 rather than 35mm.  You won't be sorry you've got the wider angle.  I found the camera to be very user friendly.  Of course I read the reviews and wondered about all the negative things that where said.  But remember the reviews were overwhelmingly positive.  Also I think some people tend to compare it to a thousand dollar DSLR or something. Well it's not that.  Remember, we want to carry it in our pockets and call them \"point and shoots\".  Short is I love this thing so far.  It's a lot of easy to carry and use fun and looks great.  Sorry to not have got in under water or used the video yet, maybe we'll expound on that later.  Thumbs up for now.", "Date": "February 28, 2010"}, {"Title": "tct2", "Author": "tct2 \"tct2\"", "ReviewID": "R2E3EJ28U7RPLG", "Overall": "5.0", "Content": "I have had my TS1 for about a week now, and i am very impressed with the quality. I wanted a camera I could take with me anywhere and not have to worry about breaking it. So far I am impressed with the picture quality granted my last camera was a nikkon cool pix 5 mp and this camera shoots much better as it should. I have shot some HD video with the camera and it has turned out great. I read that the camera will write to an sd card at 17 mb/s. I bought an 8gb SDHC class 2 card which will hold about 1100 pictures at the highest setting. My only question is if the class 2 card is limiting my HD recording capabilities as far as quality? Could anyone answer this for me? The only quall I have about this camera is that there is no lens cover wrather hardened glass, which I would not want to put to the test, because if that scratches all your pictures will show it. I was stuck between this camera and the Casio Ex-1, I chose this camera because I previously had the Casio camera phone, granted it was only 5 mp but the image quality was horrible so I went with the TS1 and am very glad I did so. Overall Great Camera and would recommend it to anyone especially for the price.", "Date": "February 24, 2010"}, {"Title": "So Far So Good", "Author": "James P. Rivers \"JR\"", "ReviewID": "R10UT3LOVFZK9K", "Overall": "4.0", "Content": "Have not be able to take underwater phot's yet but so far the picture quality and ease of use has been fantastic. The wide angle lenes allows for a great view of the whole gang!Will be taking it on a cruise in June and will report on underwater capabilities....", "Date": "February 15, 2010"}, {"Title": "Two words: THE BEST", "Author": "Umalib", "ReviewID": "R1KQ6A2WEGJ90C", "Overall": "5.0", "Content": "I've dropped my camera twice already (clumsy queen!) and have not had any problems with the it. Still need to try the water feature.Great pictures. STURDY, just perfect for me. LOVED the color.The manual says that it might not work properly below -10°C, but I used it in a colder weather, and although I did notice that it was making an extra effort to focus objects, the pictures came out great!Thank you Panasonic for building such great products!", "Date": "February 13, 2010"}, {"Title": "Excelent for the common user!", "Author": "Willem Schol \"wschol\"", "ReviewID": "R2VN8GFDYM6S7S", "Overall": "5.0", "Content": "Before buying this camera, I read a lot of review's that supported and condemned it. After taking in consideration everything, I made up my mind and bought it. The truth is I'm extremelly happy with my desition. Pictures are great, quality also. It has lots of features and it's very easy to use. I would recommend it to any common day-a-day user, that only want's a good camera to travel with and to use it to remember those trips. For expert's, I really don't know. I'm not, so I don't know what this camera lack's of to satisfy their needs.", "Date": "February 5, 2010"}, {"Title": "Met my expectations", "Author": "Juan Z", "ReviewID": "R100H9E94BJ16D", "Overall": "4.0", "Content": "It is the kind of product that I was looking for. Very robust and no problems taking pictures under water. The HD possibility is great. I am happy so far with this product.", "Date": "February 5, 2010"}, {"Title": "I love this camera!", "Author": "D. Butler", "ReviewID": "R1TAPR2G38IHIQ", "Overall": "4.0", "Content": "This camera is great! It's easy to use and I love all of the great features. My only complaint is that occasionally I get a blurry picture but I think it because I need to change the settings. I'm really happy with this camera, I love it :)", "Date": "February 1, 2010"}, {"Title": "Panasonic Waterproof Camera", "Author": "riffmaster1998", "ReviewID": "R1JBHMFKU1P2VG", "Overall": "5.0", "Content": "I was very happy when I started using the camera.  I picked this camera over the Canon waterproof because I read that the video capture was in 720P where as the Canon was a lower resolution.  When I started using the video capture, I was really impressed at the clarity and quality of the picture.  The only drawback I found was that the camera could easily scratch when in your pocket with car or house keys.  The colored finishes are very nice also. I have yet to submerse it into water.", "Date": "February 1, 2010"}, {"Title": "Perfect!", "Author": "T. Vaite", "ReviewID": "R1L8N31YRE17XB", "Overall": "5.0", "Content": "Totally waterproof. I live on an island were there is 90% of humidity in the air, I go to the beach very often with my friends and always have fun moments to capture in videos or pics, so this camera is perfect! Great image and sound quality, easy to use and carry around. I definitely recommend this product.", "Date": "January 31, 2010"}, {"Title": "very pleased but a little dissappointed", "Author": "REY", "ReviewID": "R32MWRK5YKZ354", "Overall": "4.0", "Content": "this little camera delivers the goods, picture color are very good, other point and shoot camera that i have used, gives me a yellowish color when the flash is utilize, but not this camera. the colors are really good. the battery life don't last long , a camera case is necessary, as the face easily scratch, i think the coating on the face of the camera is not strong , i put the camera in my wife's bag, when i took it out , my new camera is scratch. beside these 2 failings, i would not hesitate to buy this camera again, yes it is a buy!!!!!", "Date": "January 17, 2010"}, {"Title": "Good, but could be better", "Author": "Jonathan T. Sweet", "ReviewID": "R2PN7R1BAMMYZD", "Overall": "3.0", "Content": "Overall I'm pretty happy with the DMC-TS1. It's a capable camera, and I'm hoping the others reviewers issues with failure in the water are just flukes (I haven't gotten mine wet yet). Power does seem to be an issue (ran out of juice after shooting about 50 minutes of video).My biggest peeve is the video capabilities. The software that came with the camera won't work on my Mac, so I've had issues trying to convert the AVCHD movies. You can switch to recording Quicktime movies, but they are limited to 2GB (which is only about 15 minutes of HD Quicktime).This is by no means the best camera I've ever owned. In the end I think it's overpriced for its feature set. Most users would be happier with something else.", "Date": "January 14, 2010"}, {"Title": "Big and rugged, but interface is not very good", "Author": "T. C. Ta \"Devil Doc\"", "ReviewID": "R30N4SAMKDJ1LI", "Overall": "4.0", "Content": "I bought this camera for a snowboarding trip and then for snorkeling when I go on vacation. It is indeed waterproof, and takes decent pictures, but the interface is horrible! The screen is littered with cryptic icons and menu settings are buried under layers of controls. I would recommend this camera for anyone who wants a rugged camera that can hit the sand, surf, and snow as well as parties, but it's not as slick as Sonys or Canons.", "Date": "December 24, 2009"}, {"Title": "Good durable all in one camera", "Author": "Paul A. Caffrey \"PAC_review\"", "ReviewID": "RT6PSHD438O8K", "Overall": "4.0", "Content": "Like a lot of things, you really cant't have it all in one at a great price and be completely pleased.  This camera come pretty close to what I wanted and needed. I needed something that is small relatively durable and reliable with decent picture quality.  I haven't used it much yet, but so far it seems to be everything I had relisticaly expected. It doesnt have a peep hole to shoot through so the LCD can be a little hard to see if the sun is on it and I do wish the new digital cameras came with a small memory card to use while deciding if the camera is what you want.", "Date": "December 23, 2009"}, {"Title": "Nice camera", "Author": "Jia-ming Lin", "ReviewID": "R2DNEQOY5UH1ZV", "Overall": "5.0", "Content": "This is a water, dust, and shock prove camera. You wouldn't expect to see all these functions on the same device years ago, and this is it! It is not super ease to use cause a lot of freedom is there for your own decision. Take pictures in the way you want!", "Date": "December 10, 2009"}, {"Title": "Nice Camera", "Author": "aj \"aj\"", "ReviewID": "R2H78625Q9KGUK", "Overall": "4.0", "Content": "This camera works very well.  A little spendy, but the image stabilization makes for very high quality pictures.  Video and panoramic modes work well. It is a little bulkier then some digi-cams, but its easy to use and should be very durable, so it should pay off.This camera is much nicer then the Olympus Tough 6000 a friend had.  (Although his does have some added panoramic modes).The only problem I am having is the included software didn't load fully, so I can't work with videos yet.", "Date": "November 30, 2009"}, {"Title": "Very nice and highly portable", "Author": "Adam Safier", "ReviewID": "R29BXV7UGUP972", "Overall": "4.0", "Content": "So far I have used this camera for snapshots and have not tested the waterproof function.  Overall it is a very nice camera.I did have to increase the exposure permanently because the default pictures were a little dark.  The shutter button and zoom button are next to each other resulting in occasional confusion when I press the zoom button when I mean to press the shutter.  This is a matter of getting used the setup.  I am fairly used to holding the on button to get the camera going but I wish you had to do the same to turn it off.  A few times I pressed the off button instead of the shutter and turned off the camera.  These are minor issues and a matter of getting used to the tool.The pictures seem sharp but the colors are not as vibrant as I imagined they would be. Still, they are pretty good for a snap shot approach with a really small camera.  The 4.6X Optical Zoom function is smooth and lets me frame shots the way I want them.", "Date": "November 28, 2009"}, {"Title": "Nice little point and shoot!", "Author": "Aaron Lippincott", "ReviewID": "R2N8N5NR472USM", "Overall": "4.0", "Content": "Panasonic Lumix DMC-TS1 12MP Digital Camera with 4.6x Wide Angle MEGA Optical Image Stabilized Zoom and 2.7 inch LCD (Green)I just bought this camera in October '09 s a replacement for older point and shoot. I haven't had a chance to explore all of it's capabilities, but it is easy to use. I can't wait to test it out underwater next season. I did try the panorama stitching capability with the software that came with it, and it works quite well, providing a seamless 3-D picture. I like the size too, fits in a pocket or in a small case on the belt. I also have a DSLR, but this camera is nice for when I don't want to lug the big one around. Oh yeah, and the 720p video is a great little feature. Not quite as good as my 1080i Sony HDD camcorder, but more than adequate capture the moment. For the price this is a great camera and I would definitely recommend it.", "Date": "November 24, 2009"}, {"Title": "Nice Camera, decent video", "Author": "Aslan", "ReviewID": "R1UZH52Q2TX7X1", "Overall": "4.0", "Content": "I did a lot of research before purchasing this camera.  I needed a 'tough camera' after drowning my previous Nikon CoolPix while kayaking.  My requirements were water proof, compact, and can zoom while shooting video.  Of the various tough cameras this, and the cannon, are the only ones that can zoom while shooting video. The cannon is not as compact.  The only drawbacks of this camera are the shutter lag which you get with most all of the point and shoot models and it takes about 1/2 second to start up.  The pictures and video are very good for a point and shoot.  You can even shoot in high definition video mode.  It is not an SLR so don't expect that level of performance, but for what it is, it is great.", "Date": "November 19, 2009"}, {"Title": "Great small camera", "Author": "Roger B. Hansen \"Motorcycle golfer\"", "ReviewID": "RFTDM0LIA3EJ4", "Overall": "5.0", "Content": "This is a great camera for harsh conditions. I ride motorcycles a lot and have ruined to many cameras. I think that this will last more than one trip", "Date": "November 18, 2009"}, {"Title": "great camera", "Author": "Kansas girl", "ReviewID": "R26QXNW5LHYX73", "Overall": "5.0", "Content": "Great camera.  Quality pictures for a point and shoot.  Worked perfect in the water.  Took it to the beach and worked great.  Great camera to take on vacations...you don't have to worry about it getting wet.  I hooked it on my wrist and carried it everywhere.  Love the features that most of the other point and shoots don't have.  It gives you some options with the flash and adjusting the exposure, which is nice.  Video is also good quality.  Would definitely recommend this camera.", "Date": "November 11, 2009"}, {"Title": "Excellent value for the price", "Author": "John", "ReviewID": "R1JTMD07BQU5PX", "Overall": "5.0", "Content": "Fits well in the hand.  Takes great pictures.  Easy to use right out of the box, but the directions are necessary to take advantage of all the features this camera offers.", "Date": "November 2, 2009"}, {"Title": "Great Pictures - Still New Though", "Author": "Tim Johnson", "ReviewID": "R1UWCWQO2J0ZVE", "Overall": "4.0", "Content": "Have used the camera for 2 1/2 months - it takes great pictures and HD movies.  My teenage daughter used it for a trip to Disneyworld she came back with great pictures and movies of July 4th fireworks.  I've used it for nature photos and people/portrait shots at a family reunion, and it does a great job. We shoot everything in 16 X 9 aspect ration and pictures and HD movies look beautiful on our Panasonic 42\" plasma.  (Mini HDMI to standard HDMI cable not included.)  We use a Transcend 16 Gb SDHC card and it's been happy with the card since it was first inserted.  The only reason I didn't give the camera 5 stars is that we have not tried any underwater shots yet...if it works as advertised there, my review will be FIVE stars.  I have no hesitation recommending this camera, although if you don't care about the waterproof capability you can probably find a cheaper camera that takes pictures as well.", "Date": "September 13, 2009"}, {"Title": "Love it so far...", "Author": "Sarah Girard", "ReviewID": "R2RXEK5KVDVEUM", "Overall": "5.0", "Content": "So far I love this camera. I've had it for about a month and have had no problems yet. Everyone loves it and compliments me on the quality of photos and that it's 12MP! Although I must admit I haven't used it underwater OR dropped it...but I plan on bringing it underwater next week when I go on vacation, so cross your fingers it holds up.The only complaint I have is transferring the images to my computer:1. I tried three different USB camera card readers, and only one of them worked. And even then, the transferring is incredibly slooooooow. And I haven't been able to figure out how to move my videos onto my computer...2. I tried the installation cd (twice), but both times it froze up my laptop, so I gave up on that.3. Lastly, I tried plugging in the camera with the included USB cord (which was my last resort because it drains the battery in the camera). This way seems to be the quickest, although I still can't locate my movie files...Hope this review helps someone. I would definitely recommend this camera, and if I had to I would absolutely buy it again.", "Date": "September 13, 2009"}, {"Title": "Great Camera", "Author": "Ryno", "ReviewID": "R3RGG1V0VHEXQ4", "Overall": "5.0", "Content": "The camera does everything that it advertises. It takes great pictures above and below water as long as the water is clear.  The video feature works quite well also.", "Date": "September 10, 2009"}, {"Title": "great outdoor  camera", "Author": "Jaime Sada", "ReviewID": "R347YGCGHNOZUO", "Overall": "4.0", "Content": "Its a great camera for all situations, rafting, hicking, swimming etc. Nice image quality, good performance.Image quality suffer if you have a backlight ilumination.But I recomended after all.", "Date": "August 18, 2009"}, {"Title": "Smooth skin at last!!!", "Author": "Cindy A. Orozco", "ReviewID": "R31KW2KJWKVUV3", "Overall": "5.0", "Content": "This camera has many great selling points, but I'm having fun with the scene selections such as soft skin. It allows me many options and the owner's manual is easy to use. Thanks.", "Date": "July 1, 2009"}, {"Title": "SIZE & USABILITY", "Author": "Edward Kaplan \"FastFoto\"", "ReviewID": "R3DK6XOZDTV5LQ", "Overall": "5.0", "Content": "The Panasonic Lumix DMC-TS1 is all the camera that I'd hoped it would be and more. It's my first pocket camera that actually fits in my pocket. The JPEG mode of the movie mode is excellent when it's finalized on a disk. The HD mode is great, but it's appreciation is limited to using directly to an HDTV. The software that came with the camera lives up to the claim of vertical stiching, plus the camera itself has a stitching setting the helps align a portion of the previous shot with the next.", "Date": "June 24, 2009"}, {"Title": "It was fun for the 10 days", "Author": "Jason Mcgorty \"jasihn\"", "ReviewID": "R21ZX8HGO92VC1", "Overall": "3.0", "Content": "I bought this camera for a vacation in Italy for 2 weeks, half expecting it to break at the beach.  The first time I placed it in water I cringed, but the waterproofing appeared to work fine.I took some fun photos at the beach and inside of fountains in Rome.  About 3/4 of the way into the trip the screen flickered.  I shut it off and when I turned it back on again it made a very bad grinding noise and said the battery can't be used.  It never worked again.I give it 3 stars though since it was a fun 10 days.  Sure it costed about $5 a picture but I got some good shots!And I've been in contact with Panasonic and Amazon about what to do as I didn't mistreat it or anything.", "Date": "August 14, 2009"}, {"Title": "Consider alternatives, particularly for video", "Author": "Kenneth P Kloppenborg Jr \"kenincolorado\"", "ReviewID": "RG7TLB1L89G0V", "Overall": "1.0", "Content": "Before buying the Panasonic DMC-TS1 consider other options, like flushing $400 cash down the toilet instead.  You'll save yourself a lot of time and frustration.The camera takes mediocre pictures and does seem to be waterproof and shockproof, as advertised.  The (slightly) extended zoom is useful - IF you can get the auto focus to work.  Auto Focus doesn't work in any sort of low contrast situation - a cloudy day with snow covering the ground, for instance.  One would expect that selecting \"Landscape\" mode would fix the focus on infinity, but it doesn't.  Don't bother looking for a manual focus.  Panasonic left this commonly available feature out.  Even if the camera did focus in snowy weather, the controls are near impossible to operate with gloves on.  The camera CAN record audio - but only during a movie or 5 seconds at a time when you take a picture.  Panasonic left the audio only recording  feature out too.  The form factor is also a problem and I've ruined many a picture getting a finger partially over the lens which, by the way, has no external cover when the camera is off.Battery life is poor in my experience.  So you need to buy a second battery.  Buyer beware !!!  Panasonic has sabotaged the camera by planting a logic bomb in the camera programming making it impossible to use any battery not manufactured and sold by Panasonic.  Users of other batteries - even ones with the correct electrical characteristics - will see the message \"You cannot operate the camera with this battery\" and the camera will shut down.  Expect to pay a premium for a spare battery - if you can find one at all, availability being another Panasonic problem.If you're buying the camera for AVCHD Lite video, patience is required.  Panasonic could have chosen to make this the best feature of the camera, instead the included software makes actually using or backing up video a long, confusing, frustrating slog.  Panasonic claims their camera is suitable for use with a 500 MHz computer.  It is - but you can't play video.  I'm using a 1.76 GHz processor and can only play at 10 fps.  The fine print requires a 2.16 GHz dual core for the video the work, so if you don't have one of the latest in processors, expect disappointing results.If you're new to AVCHD and expect to drag and drop your movies like the more standard .mov  file - forget it!  AVCHD movies must be saved in a strict hierarchical directory structure to play at all.  Complicating matters is that the camera itself uses another format to store the videos and conversion must be done during acquisition using the software that comes with the camera.  The software Panasonic included is apparently prone to getting clobbered by other applications in the Windows  XP environment.  I've had to reinstall several times as error messages flagging lost CODEC's and .dll files randomly appear after days or weeks of normal operation.  There's a panorama maker which makes good looking panoramas - at extremely low resolution - nowhere near suitable for actually printing.  There's two other photo editing programs which seemed generous to me until I figured out I needed one to acquire the videos and the second one to actually edit them.The software is buggy.  The ArcSoft Media Impressions application window spilled off the bottom of the monitor.  All the function buttons were invisible because they were at the bottom of the window, below the bottom of the monitor.  You can't point and click to resize when you can't see the lower window border, and the ALT - Space menu had no effect.  The very basic window resize function simply didn't work.  The program couldn't be used owing to a programming blunder of astonishing magnitude.  A different \"View\" option brought the functions to where they were usable - but then other things disappeared off the bottom of the screen.  MediaImpressions also tendes to take up 100% of the CPU cycles even when it is idle.  I've had to use the task manager more than once to kill it.  The Panasonic PhotoFun application was oft times confusing due, apparently, to lack of familiarity with the English language.  Having figured all that out, I found there were some recorded videos that simply refused to be acquired or played.  The camera could play the videos all the way through, so the information was there, but PhotoFun could not acquire them, could not even see them on the SD card.  Near as I can tell, these videos are effectively lost.  If you're going to take videos that absolutely, positively can not be lost, another product is recommended.  According to some online forums, many have simply thrown away the included software and gone out and paid more money for software that had some actual utility.I wouldn't buy this camera if I had known.  For the future, Panasonic goes to the very bottom of my list next time I think about buying a camera.", "Date": "December 13, 2009"}, {"Title": "underwater usage", "Author": "Russell W. Claus \"phobos\"", "ReviewID": "R6WYV32HCDFRA", "Overall": "1.0", "Content": "Initially, I enjoyed this camera and it worked well, zoom was a little troubling, but not enough to make up for the underwater feature. Used on first snorkeling vacation: everything was great. Second snorkeling vacation, salt water leakage, dead camera. I worked to keep the unit clean.I don't think I would recommend this product.", "Date": "November 23, 2009"}, {"Title": "Well pleased", "Author": "Randall Garrett \"Sr. Sketch\"", "ReviewID": "R1H63BP2U16SAZ", "Overall": "5.0", "Content": "I review and test various products used by field service workers - that is, people who make their living working outdoors a good deal of the time vs. those who work indoors, primarily behind a desk.  One of the tools they use for every job is a digital camera.  The vast majority of these people are self employed vs. draw a salary from a large corporation and equipment they purchase is paid for by themselves.  Perhaps the single most common point of failure for digital cameras in this price range is the zoom lens mechanism.  Thus, this camera one of a few we recommend for outdoor use.  The 28mm (equiv) wide setting is most appreciated by users and the zoom is adequate for most conditions.  The waterproof, dust and drop ratings are appropriate for these people.  This particular camera is very well received by this market.  Photos made are more than adequate.  Of note - the primary aspect ratio for photos is 4:3 vs. the more consumer desirable 16:9.  As with almost every camera in this price range, unfortunately there is no optical viewfinder and the flash is characteristically weak.  Will be purchasing the newly announced Pentax Optio W80 next to test.  The previous W60 was inadequate.  Hope these thoughts help a prospective purchaser.", "Date": "July 6, 2009"}, {"Title": "Excelente producto", "Author": "J. Alberto Romo Garza \"Jorge Romo\"", "ReviewID": "R3UOINTU4GWHZA", "Overall": "5.0", "Content": "Toma muy buenas fotos con una calidad excelente y sobre todo que siempre salen bien. Es muy dificil que una foto salga movida. La construccion se ve solida y de buena calidad. Muy recomendable.", "Date": "April 5, 2010"}, {"Title": "Panasonic Lumix DMC-TS1 camera failed within 1 minute of touching watter", "Author": "G. Brooke", "ReviewID": "RR9BI6VQQEC3Q", "Overall": "3.0", "Content": "I purchased the camera for a 7 day Caribbean cruise.  We had hoped to take pictures while snorkeling in Cozumel, swimming with the sting rays in Grand Cayman, and hanging out on the beach in Jamaica.  The pictures quality was fine and we took a number of pictures on our first two days of the cruise.  I was surprised to find I preferred the quality of my old 8MP Cannon SD1100IS for pictures taken indoors.  But the real reason we bought this camera was to use in the water and it failed miserably.  I did not get a single picture while snorkeling in Cozumel, because the camera failed shortly after jumping in the water.  Luckily my brother-in-law had a Cannon D10 underwater camera we could use while in Grand Cayman.I sent the camera back to Panasonic and the Customer Service was fantastic.  They replaced my DMC-TS1 with the latest model the DMC-TS2.  The DMC-TS2 has been great.  I've taken the TS2 snorkeling in Cancun, on day hikes in in the rain, to the pool many times, to the local water park and on several canoe trips including a three day float on the Devils river which included snorkeling.  The camera has taken quite a bit of beating and has remained totally waterproof.  I definitely recommend the TS2 and Panasonic customer support.", "Date": "March 31, 2010"}, {"Title": "Fine camera but be sure test its waterproof capabilities", "Author": "Howard Ostrow", "ReviewID": "RGDJA9G6VB1ZQ", "Overall": "2.0", "Content": "I have been looking for a camera that I could take on water related activities such as kayaking and snorkeling and that could also function as general purpose digital camera.  I was delighted when I read the specs.  The camera worked fine until I took it for some light snorkeling.  I was able to take 5 pictures before it died.  I took the pictures with only my head underwater.  The next day I noticed condensation in the camera itself.  So much for it being waterproof.  The SD memory card still had the pictures on it so I was able to salvage them but the camera was useless.  Amazon was great at exchanging it so I try another one which I have yet to be able to do.  The camera did work just fine for taking pictures while kayaking and it did survive one dunk in the ocean.  Note:  The camera will not float so I bought a floating collar which worked well.As a digital camera it takes very good pictures.  The software takes a bit to get used to, just like all modern digital cameras.  The camera is not \"fast\" in that you have to leave some time for \"recovery\" in between pictures.  I'm using very fast rated SD card so it's not the memory that is the issue.  My one gripe is that there is no cover for the lens so scratches are going to eventually an issue.  There is no viewfinder which I kind of miss so you have to rely on the LCD display which is very viewable.  As for the orange color it helped  me spot it when it fell out my pocket into the water.", "Date": "February 6, 2010"}, {"Title": "Rugged Waterproof + Fantastic Picture Quality = Win", "Author": "Michael Trotman", "ReviewID": "R11S3D7TXUICNB", "Overall": "4.0", "Content": "I originally purchased the Olympus Stylus 1050SW 10.1MP Digital Camera with 3x Optical Zoom (Silver) but the photo quality was terrible.  Yes, the Olympus was sturdy and waterproof, but I was so disappointed with the photo quality I stopped using it.  Finally Panasonic entered the rugged camera arena and they have figured out how to deliver excellent photo quality in a rugged design.  Read this article from infosynch and you can see comparisons of photos taken with three different rugged cameras.  The Panasonic wins in every category hands down.[..]", "Date": "December 12, 2009"}, {"Title": "Perfect!! camera for all moment!!! woww under water!!!", "Author": "F. Miranda", "ReviewID": "R1XG23ERLGDT6F", "Overall": "5.0", "Content": "Increible under water..good resolution, excelnte videos under water..must to buy..this camera is amazing!!! plus in the night has a light that turn on automatic..really funny this cam!!", "Date": "September 17, 2009"}, {"Title": "Panasonic Lumix DMC-TS1", "Author": "Amazon Customer", "ReviewID": "R20WBD4Z3FWICI", "Overall": "4.0", "Content": "Solid cameraThree reasons I brought this camera:1. 720 video capture is not bad for a digital picture camera2. Waterproof3. use SD instead of XD memory like the OlympusPicture quality is nothing to be excited about..It would be nice if it can waterproof to 33 ft like the OlympusCons:It is kinda expensive..", "Date": "September 12, 2009"}, {"Title": "Island + Rainy/Hot weather = grueling conditions for a camera", "Author": "principessa", "ReviewID": "R1UCRVQJ6U8T1J", "Overall": "5.0", "Content": "I live life ruggedly, so, this little thing fits just perfectly into the kind of rough and tumble life I lead.  I had owned probably at least 5 to 6 digital cameras in my lifetime, and several film cameras both point-and-shoot and professional SLRs and then... I had a son, who loves to take pictures as much as I do.  Well, 2 of the digital cameras he broke.  I tried to get him a kiddie one, and that got wet with a drink spillage.  The others got ruined with the sand and the elements.  I used to have a light olympus that was waterproof and boy was I totally excited by that, especially at the water park where I was taking great close up shots in the children's watersplash area and sure enough my camera fell into the water.  But I was so proud it didn't get spoiled.  Well, the photos were mediocre.  This Lumix on the other hand, I get all sorts of compliments for great photos taken!  For all the hassle saved on repairs and heartaches over broken camera pieces, I was ready to fork the money over and grab the cool looking piece of equipment that takes (better point and shoot pictures) than my current Canon 10zoom.  I love my canon, but it's too bulky!  And it drains battery like nobody's business!  (I used rechargeable AA for the canon).  The Lumix, I keep it in my purse and I charge it probably every other week (Thank you for slim rechargable batteries!)  The only drawback is the HD, and I have a Mac, so they don't mesh.  Pls fix this (Panasonic?) (Or anyone, please let me know if there's an update?).  IF you're planning on getting the Tz-7 (Panasonic's 10x version, just know that the screen isn't so great (cracks easily) I bought one and within a week, blech).  Google the \"problems with TZ7\".  I recommend getting this Lumix TS1 instead.", "Date": "September 12, 2009"}, {"Title": "HD Jetski Camcorder!", "Author": "John R. Mcalpine V \"Mac\"", "ReviewID": "R17HJB16GBLPLF", "Overall": "5.0", "Content": "This camera does exactly what I want.  I can capture great quality images and videos without fear of damaging my camera from water or abuse.  Check out our video from our MACSBOOST Honda Aquatrax watercraft.  We were cruising down the Waccamaw river with friends.[...]I was holding the camera by hand while driving at over 50mph!  The video is very smooth and steady when the ride was not.  I assure you that I'm not that good holding the camera!The image stabilization is remarkable!The camera has proved tough enough to live in my trunks pocket while we riding a standup Jetski too.", "Date": "August 1, 2009"}, {"Title": "NOT RUGGED & TERRIBLE CUST SERVICE! BEWARE!!!", "Author": "E. Melcher", "ReviewID": "RIVAQZLHBW03Z", "Overall": "1.0", "Content": "DO NOT BUY THIS CAMERA!  DO NOT FLY WITH THIS CAMERA!!!  BUYER BEWARE!!!We purchased this camera last spring to use on vacations in the pool and snorkeling.  Camera worked well until we took a trans-Atlantic flight and placed the camera securely in a camera bag in the overhead bin.  When we arrived at our destination there was a large crack in the LCD viewing panel on the back of the camera, while there was no damage to our video camera or the other camera contained in the same case.  Needless to say we were not impressed that our supposedly 'rugged' camera broke in a situation when no damage should have come to it.  We feel the air pressure in the plane caused this crack.Upon contacting the Panasonic customer service, they told me it would be covered under our warranty, but apparently THEY LIED.  After spending more hard earned cash to mail them their easily broken camera, we received a letter saying to was not covered under warranty and please pay $200 for someone else's refurbished junky camera.  I was incensed and spent many hours trying to fight with their customer service on this, but my pleas feel on deaf ears.  So, I asked them to send the original broken junky camera back to me and now 2 weeks later, I have still not received it.PANASONIC IS A TERRIBLE COMPANY WITH INFERIOR PRODUCTS AND RUDE CUSTOMER SERVICE.  BUYER BEWARE.  IF YOU BUY THIS CAMERA DO NOT FLY WITH IT!", "Date": "November 5, 2009"}, {"Title": "Panasonic Lumix DMC-TS1", "Author": "SlingerDun", "ReviewID": "R3EAKIK2YETBNR", "Overall": "4.0", "Content": "Almost two years and tens of thousands of images later and it's working almost good as new, except for the auto-focus bracket(s) which locks in - disappears - then engages again IF the shutter remains half pressed. No big deal, but it is now slower than before and it never was fast, except for the interface.Besides dropping it from over 5 feet and debris collecting between the rubber water seals; keeping the lens protected and smudge free seems to be the biggest concern with this camera, along with a charged battery.Battery life is mediocre at best and spares are expensive: NON PANASONIC BATTERIES DO NOT WORK IN THIS CAMERA ONCE THE FIRMWARE HAS BEEN UPDATED TO ~ Ver.1.2Image quality is still average, it's still water and dust proof, plenty of micro scratches on the exposed lens that do not effect image quality.Japanese earthquake prices have climbed closer to the $400 tag this camera was released with over two years ago.", "Date": "August 30, 2009"}, {"Title": "Not a good everyday camera", "Author": "Hal", "ReviewID": "RM8JGLS78H8FE", "Overall": "3.0", "Content": "I bought this camera after reading some good reviews about its image quality and HD video capabilities.  I currently own a Canon Powershot G10 and a Canon 40D digital SLR and have been very happy with the great image quality of my Canon cameras.  The thing I like about the Panasonic Lumix is that it takes very nice HD video both on land and in the swimming pool.  The video motion is very smooth and the colors are very accurate.  I also like the compact size of the camera and the very well designed wrist strap.  I liked the wrist strap so much that I ordered an additional one through Panasonic to use on my Canon G10.  Almost everything else about this camera, I find that it is inferior to my Canon G10 and  that it is not a good choice if this is the only camera you own.It is very difficult to take a sharp photo with this camera due to its poor image stabilization, poor indoor lighting performance, hard to hold camera steady while pressing the shutter button due to its small size, poor computer auto white balance.  Almost half of all the pictures I take end up blurry.  The menu system on the Panasonic camera is poorly designed and counterintuitive.  My Canon G10 is a really pleasure to navigate through the menu system and making setting changes before taking the photo.  Battery life on the Panasonic is poor especially if you take video.  The video while it has great image quality is difficult to work with as most computer will stuggle with editing the AVCHD format.  This format requires a computer with the latest processors and lots and lots of memory.  Indoor pictures if taken without flash are basically useless as the images are grainy and blurry.  I also prefer the colors of the Canon cameras over those of the Panasonics.  In summary, I would say the the Panasonic TS1 is a better camcorder than it is a photo camera.", "Date": "June 22, 2009"}, {"Title": "blurriest pictures EVER", "Author": "Kristie G", "ReviewID": "R3B03IY9M8P2MD", "Overall": "1.0", "Content": "oh my, I have to say I hate this camera. hate. it's a strong word, but really I don't have a better one to describe it. I have owned nikons, canons, pentax, etc. I was quite excited to try this one because it has a leica lens, but unfortunately I don't see any benefit from it being a leica- think picture sharpness must have been sacrificed for durability.  It's really horrible.  lack of depth, lack of contract, lack of quality.. worst. camera. ever.", "Date": "February 21, 2010"}, {"Title": "Horrible audio quality", "Author": "Poseidon", "ReviewID": "R3P6HRTEX5UFJW", "Overall": "2.0", "Content": "The video quality of the camera is pretty good. I compared it with a creative vado HD, and the TS1 was much better in almost all respects. However, I was greatly disappointed to note that the TS1 records an excessively high background audio noise (hiss). It is excruciatingly high and is extremely distracting when viewing any video. I have had to do further audio processing to remove the noise, but that adds another step to my workflow. I tried it with the 'wind cut' feature on and off. It didn't make any difference, though I didn't expect it to since the only videos i have taken so far are in my room, which is pretty quiet. Compared to the Creative Vado HD, the audio noise is so high that I am wondering whether I have been shipped a faulty unit.I would love to receive comments from other users' experience with the audio quality of this camera. Of course, to hear how bad the background noise is, you would have to be recording with normal conversational volume in a quiet room.", "Date": "June 7, 2009"}, {"Title": "Is not waterproof!", "Author": "Alaska Anna", "ReviewID": "RS0LW400SSP1R", "Overall": "1.0", "Content": "I did a lot of research on buying a camera to be able to take on my Hawaii trip & do some snorkeling with.  I wanted one that had great picture quality, zoom features, & most importantly - ability to take pictures & high quality video in & out of water.  I found that this camera looked to fit my needs.It worked ok for taking pictures above water.  The zoom wasn't very good & hard to operate, it didn't freeze action in auto mode, there isn't too much manual control & if there is it takes time to get to.  The design of the camera made it hard to put the wristband around your wrist and also take a picture.  You had to really hold the camera funny.The worst part of this camera for me though was that it completely died the moment it touched water.  We went to a lot of trouble to get a waterproof camera so we could bring home underwater shots from this trip & despite checking to make sure nothing would mess up seals & doing everything recommended it's just a badly made product and the water came flooding in.  We called the company hoping they could help us by sending a replacement immediately so the thousands of dollars we've spent on a Hawaii trip wouldn't be wasted & we could still get our underwater photography but they were VERY unhelpful, no apologies, just got a - well maybe after you send it back to us we'll check it out and in a month or so we'll send you a refurbished one.We ended up finding a place to rent us a Olympus older model for $20 a day and just rented it for one day.  I talked with many other people over there and they had the new Olympus and were very happy with it's preformance & water tight seals.  If this camera could actually produce what they advertise it would be a great camera, otherwise you may want to wait till they get their kinks out in the waterproofing area.There is the Canon D10 but it didn't have very high quality video & no sound.  The Olympus seems to be the most reliable & best quaity out there currently.", "Date": "March 10, 2010"}, {"Title": "Good Product. As expected. No compains. If you compare prices and is the best, there is no hold back to it.", "Author": "MARCOS Y YOSIDA", "ReviewID": "R3Q2Z4CJNT9MBT", "Overall": "5.0", "Content": "Good Product. As expected. No compains. If you compare prices and is the best, there is no hold back to it.", "Date": "February 7, 2013"}, {"Title": "Worthless", "Author": "A. Castricone", "ReviewID": "R3H5KHE73QWFBL", "Overall": "1.0", "Content": "I bought this camera six months ago never really had any problems with it until I took it in the water bout waist deep. I followed all manufactures specifications. After wading in the water about waist deep for approx. 10 minuets the camera never turned on again. It was right at the beginning of a trip to a remote festival in Ukraine and I was not able to take any pictures of my trip really ruined my vacation.", "Date": "August 25, 2010"}, {"Title": "HD Video Caution", "Author": "Marycarol M. Skaggs", "ReviewID": "R3K908SPN0RX3V", "Overall": "3.0", "Content": "The camera is very comparable to the Olympus Stylus waterproof with some differences other reviewers have mentioned.  The on-button does have a delay.  I didn't think it was a big deal at first, but now I see that it might cause me to miss some shots I'm trying to get.  The image stabilizer is every bit as great at that of the Stylus!!  Shake the camera all around, snap the pic, and it still comes out perfectly clear.  Yay!The real issue that I want to alert other readers about is the HD video.  The settings on the camera are HD or MPEG.  What I didn't know is that the camera will only take up to 8 min of vid in MPEG mode, while in HD I can create videos as long as the card will allow.  The problem is that nothing I have recognizes the new video format, and I can't use any video I've taken in the ACVHG lite format.  So if you're getting excited about the HD, please make sure that it's not so you can email them or post them onto FB, and also make sure that you have Windows 7.  The software will burn the HD vid's onto DVD, but that's not how I wanted to use this.Overall it seems to be a good camera so far, I'm just a little bummed about the video issue.  It shouldn't be that hard.", "Date": "February 15, 2010"}, {"Title": "very good model", "Author": "Mohamed Elhati", "ReviewID": "R4FC3PZMYC0WP", "Overall": "5.0", "Content": "It deserves more than its price. It is very good camera from all prospective 'specially from the standpoint of the average user.", "Date": "December 4, 2009"}, {"Title": "best photo quality", "Author": "Douglas A. Kaye", "ReviewID": "R1DVIL411FXXVJ", "Overall": "5.0", "Content": "I purchased the camera from Amazon last week and have shot several photos of flowers and birds.  The pixel quality is unreal, the best pictures I have ever taken.  I have to say it is the easiest point and shoot I have ever used.  Light and compact the view screen is clear and intuitive.  I like the battery life so far, and look forward to using the HD video feature.  The internal memory is a great idea, but I will purchase a SD card soon.  Thank you, Doug", "Date": "August 9, 2009"}, {"Title": "could be better, I would suggest for you to wait for the TS2", "Author": "J. Gonzalez", "ReviewID": "R2RFDIYAXCDG4X", "Overall": "2.0", "Content": "I purchased this camera and I really wanted to like it . Waterproof, shockproof camera with 12.1mp , 4.6x optical zoom and hd recording ? you can't go wrong with that until you receive it . What they forgot to mention you is that this camera if for any reason at all falls even within the 5 feet the guarantee, it will void the waterproof warranty if you dont send it back for inspection prior to dunk it underwater . What kind of warranty is this? I was not happy with that . It also states that you need to take it every year for the sealant replacement to ensure the camera is still capable of going underwater. This is a camera that requires lots of maintenance . Also the picture quality is blurry at times and in low light conditions is horrible. I did like the part that if you want to take pictures the optical zoom increases without sacrificing picture quality but the picture quality to begin with is not that great. HD recording however was a little nice but it wont record at 60 frames per second which i think its really a turn off because fish underwater move really fast and you dont want that ghosting effect while recording fast moving things. The camera is kinda bulky and the construction is not as strong as the olympus waterproof cameras. The battery compartment tends to leak if you are not really careful, I think this is a major problem with the camera because there's been lots of reports of people complaining about the camera leaking and breaking even after following the instructions given on the owner's manual. The idea was good but since this is the very first camera that panasonic releases , I suggest for you to wait for the next upcoming model to see if they improve all those flaws from this camera. I know the new camera coming in april will have better construction and will be 14.1mp . Hopefully they will fix all those bugs from the AI setting and add 60 frames per second to their recording . I ended up returning and I got a Sony cybershot tx7 , it is not waterproof but its way better than this camera in every other category. If you want something for waterproof , I suggest you instead spent on the canon waterproof camera instead of this one.", "Date": "February 14, 2010"}, {"Title": "Camera okay, but power options are a show stopper", "Author": "CRAIG LYKINS \"Craig\"", "ReviewID": "R3N1HUKDLRZR7B", "Overall": "1.0", "Content": "This very expensive camera does not come with a power cord to charge the battery.  You must remove the battery and plug it into a wall outlet.  That is not very convenient if all our outlets are hard to access.Fine. So I purchased the DMW-AC5 cable, which Panasonic claims is compatible with the Lumix series of cameras.  This is a VERY expensive power cable indeed. And guess what? It does not even plug into the Lumix DMS-TS1 unless you buy yet another adapter cable.What a scam.  You end up paying 20-25% of the price of the camera all over again, just to charge the stupid battery.So, I am done with Panasonic cameras.  Learn your lesson Panasonic.", "Date": "January 12, 2010"}, {"Title": "Great Camera for the Money", "Author": "Mark Schow", "ReviewID": "R1XB4RWX9KCM6M", "Overall": "5.0", "Content": "Very good camera for the money.  Because it's waterproof you only get the digital zoom - an optical zoom is better, but that's the trade.  It takes good photos.  I don't think you can adjust the aperture - or at least I can't find it.", "Date": "January 25, 2010"}, {"Title": "solid camera", "Author": "Matt", "ReviewID": "R1NJ029VP1DZ0L", "Overall": "4.0", "Content": "Solidly built.  Completely adequate image quality for a PAS camera.  Lens tends to fog on the inside in cold water...went swimming in Maine in 57-60 degree water and the inside of the lens seemed to fog up.  Macro mode works excellent.  Needs a longer-lasting battery.  In all, not as good as my last Canon PAS but still perfectly acceptable.", "Date": "September 15, 2009"}, {"Title": "NOT waterproof", "Author": "Eric Jain", "ReviewID": "R1RUZLMS8MGDDA", "Overall": "2.0", "Content": "I liked this camera -- until I tried using it underwater, as advertised. It lasted all of two minutes. Turns out this is a common problem; sent it for warranty replacement and got a DMC-TS2 back. Hope I'll have better luck with that model!", "Date": "April 15, 2010"}, {"Title": "not user friendly", "Author": "Tien D. Bui", "ReviewID": "R3FGFRZZOIP5TX", "Overall": "2.0", "Content": "Originally had the canon D10 water proof camera and wanted a \"smaller\" waterproof camera so bought this one which it was.  I found that the \"on\" button was difficult to push and often took several times to push.  Granted it is flushed with the case to prevent accident off and on, it usually takes me several times to turn it on. Also, the turn on speed and the start video speed is a bit slow.  The user buttons are not as friendly as the canon. Also has features that do not make much sense like the \"note\" function. Why? Pictures in the factory setting tend to be a bit \"yellow.\"  Took it snorkeling and did some rigorous \"slashing\" and it leaked and cause the SD card to malfunction.  I had to dry it out.  Now...the real annoying thing.  What the heck is up with the movie files format (MOV).  None of the common viewers will play it.  Also windows move maker can't open it.  All the conversion programs include Quicktime Pro shrink the image quality.  Why why why?  A previous reviewer wrote..\"Others have apparently had trouble using the AVCHD Lite codec, but I have not. I can import the .mts files flawlessly into the Kdenlive video editor on OpenSUSE Linux 11.2 with KDE 4.2.\"  Are you kidding me?  This is greek to me.  Other cameras have simple movie files.  Why do you have to convert it?I totally regret getting this camera.", "Date": "January 5, 2010"}, {"Title": "Dead after 5 uses", "Author": "Tummybug", "ReviewID": "R1MEAM4URYN3SL", "Overall": "1.0", "Content": "Very simply put. I used this camera 5 times in total, twice in the pool (no problem), once in the desert (no problem), and once in the sea, which killed it.The day after the sea experience, it would simply not turn on. What gets me is that I did everything I was supposed to do with it, as stated by the manual (ie not jump in water with it, not keep in water too long, rinse it afterwards, etc...), it is and remains dead.Very disappointed with Panasonic on this one, I loved the camera while it worked, now I keep staring at my expensive brick.IF you want to buy a camera that can die on you for no apparent reason, go ahead and get a TS1. I wont make the same mistake again.", "Date": "November 12, 2009"}, {"Title": "Defective camera with abysmal customer service", "Author": "Heather", "ReviewID": "R1EB23SMA3Y9RT", "Overall": "1.0", "Content": "I have little to say about this camera because when I received it, it was completely defective.  I was informed by an associate at a battery specialist store that BOTH the battery AND battery charger that accompanied this camera were defective--the battery would not charge and the charger was too weak to charge anything.  Therefore, this camera is useless.  Unfortunately, Panasonic's customer service phone line does not even allow you to speak to a live person.  At this moment, my camera is on its way to a Panasonic facility for an undetermined amount of time until they fix this problem.  Amazon has not been of any assistance either, claiming it is the manufacturer's responsibility, although they sold me the defective product.  If I could do it all over again, I would buy the previous Olympus waterproof camera I had--never had a single problem with the product, manufacturer, or distributor.", "Date": "March 2, 2010"}, {"Title": "Love the features of it", "Author": "J. Payne", "ReviewID": "R1Q5HZFP0OU79Q", "Overall": "4.0", "Content": "Amazing features. Waterproof, shock proof, dust proof, me proof (kidding) for this price is great! Some lighting outside doesn't produce the best pictures but granted I haven't read the manual completely. Still working on that. The HD video quality is amazing.", "Date": "June 6, 2009"}, {"Title": "Poor placement of video button", "Author": "JaxHomeInspector", "ReviewID": "RACS7MY4ZMT51", "Overall": "3.0", "Content": "Overall the camera is not bad. I use it primarily for business and needed one that's water/dust/shock proof and this one meets those needs and appears to take good photos. I do home inspections and carry the camera in a case on my belt. I usually have it set to turn off after 2 minutes so I'm not turning it on and off constantly. However, when I leave it on and I need to take it out of the case, the video button is right where my finger needs to grab it and it starts recording... very annoying. To stop this from happening I had to turn it off after each picture. Considering I take more than 60 pix for each inspection it's annoying to have to do this. Also, you have to hold down the on/off button for a count of 2 in order to turn it on, another annoying thing. I returned it and ordered the Olympus 8000.", "Date": "December 5, 2009"}, {"Title": "Battery issues -  F.Y.I.........................", "Author": "N. Harris", "ReviewID": "R27G5KDBGOJ5AG", "Overall": "1.0", "Content": "Camera is a good one!  I've taken many pictures in the last few months, and the quality is great. I haven't dropped the unit or taken into the water yet, so I can't give any info on those counts.....The battery issue is my main concern.  A recent firmware upgrade by the manufacturer has ensured that ONLY OFFICIAL LUMIX BATTERIES will work on this unit. If you are considering purchasing this unit, please factor in the expense of buying highly priced replacement / additional Panasonic batteries, as you will get a message on your camera that reads \"This battery cannot be used\" if you try any of the 3rd party batteries (They wil work when you first take them out of the packet & insert tem into the camera - It's after you've charged them that the battery will no longer be accepted by your camera).I just wanted to put that out there, as I would have avoided buying this camera if I'd have known that Panasonic were going to hold their customers over a barrel with 3rd party purchases...They'd probably say that it was a safety precaution, etc.I've given the camera 1 star to get your attention....The camera itself is great - It's the issue of battery availability that loses the other 3 stars it deserves.", "Date": "December 15, 2009"}, {"Title": "Horrible product! Failed to turn on after first use.", "Author": "Mavi Ayicik", "ReviewID": "R8A2US3TPJRAG", "Overall": "1.0", "Content": "First of all, although the wider lens is nice, this camera has very poor performance with low light conditions compared to my Canon G9. I bought it for the waterproof capability. I used it under water one time, and followed all the instructions. I have to say some of the underwater photos were decent if enough light was present. The second time, the camera failed to turn on whatsoever, and I missed taking pictures of sea turtles.", "Date": "November 12, 2009"}, {"Title": "I sent it back", "Author": "Earl \"Photo feller\"", "ReviewID": "R1OREJI0Z7XA67", "Overall": "1.0", "Content": "This camera was advertised as \"water resistant up to 10 meters\" but they failed to mention that you need an \"optional\" underwater housing. The battery life was 3-4 hours, my Samsung went three days. Really hard to use, manual was confusing. I sent it back and got a Canon Powershot and I love it.", "Date": "November 13, 2009"}, {"Title": "TS1 is not waterproof!", "Author": "E. Kardon", "ReviewID": "R1JRELH9J30BEY", "Overall": "1.0", "Content": "I recently bought the new Lumix TS1 for a snorkeling trip to Hawaii. I carefully read the underwater directions to make sure I was using it properly. After 20 minutes in the water the camera shut off.  The battery terminal was soaked, camera broke and my brand new memory card was ruined as well.I have no idea if my camera was defective or if they simply are not as \"waterproof\" as Panasonic stated.Other things I did not like about the camera include...-the zoom slide is awkward to move-the video button is poorly placed on the back side of the camera-4.6x zoom is weak", "Date": "May 10, 2009"}, {"Title": "Did not receive item", "Author": "Elma S. Watson \"E.W\"", "ReviewID": "R1EN4I09F13VW", "Overall": "5.0", "Content": "I did not receive this item.  I was very  disappointed as I had ordered this for my husband's birthday. I was very pleased with Amazon's response.  They did investigate and returned my money.  I was not pleased with UPS' response.  They basically accused the homeowners of delivery address of lying about the delivery.  Homeowner was home when \"supposedly\"  delivered and did not find item at doorstep as UPS claims.  Maybe Amazon should consider using different delivery method.  The other two items that I ordered, the battery and memory card, were delivered by USPS and they got to us.E.W.", "Date": "February 7, 2010"}, {"Title": "Lumix DMC-TS1", "Author": "Rodrigo Martinez Ayal \"lemrodrigo\"", "ReviewID": "R3A8IBG7J00DAD", "Overall": "2.0", "Content": "Very slow betwen each picture, so BIG, so HEAVY, poor quality picture. I'm selling it on eBay.", "Date": "January 9, 2010"}, {"Title": "stupid flash position", "Author": "Amanda Moreda \"Fernando Fernandez\"", "ReviewID": "R34LUU5JPY2P9Z", "Overall": "1.0", "Content": "The flash always leaves a shade to the left part in the wall if the person is 30 cm of wall or curtain etc , they listen well always it leaves to the left part of the photo a shade, the disigners of the camera left very far the flash of the lens and this produces this unbearable shade in all the photos all the settings exept when  is in the beach or exterior photo ,,but try dont shoot in a room ,i lost 395 bills in a orange one but i am very disapointed with this camera.you need a gamer computer to replay de hd videos .all the photos in all settings looks washed horrible washed ,there is no settings to change for that allways is washed ,the only good thing is leica lenses but not to paid 400$ for a piece of glass, i compare all the photos taken with my old pentax optio s4 that only is 4 megapixels", "Date": "May 25, 2009"}, {"Title": "Would be great if it worked", "Author": "A. Walsmith \"lovenhate381\"", "ReviewID": "R3C2O0PQWWR4IV", "Overall": "1.0", "Content": "There is no warning that says that this product does not work with ipods past generation 3.  The speakers work, but not the video.  I already had speakers.  So now I have a beautiful looking paper weight.", "Date": "February 1, 2010"}], "ProductInfo": {"Price": "$399.99", "Features": "12.1-megapixel resolution captures enough detail for poster-size prints\nWaterproof to a depth of 10 feet, shockproof from falls up to 5 feet, and dustproof\nRecords AVCHD Lite HD video\n4.6x MEGA image-stabilized optical zoom; 28mm wide-angle Leica DC Vario-Elmar lens\nCapture images to SD/SDHC memory cards (not included)", "Name": "Panasonic Lumix DMC-TS1 12MP Digital Camera with 4.6x Wide Angle MEGA Optical Image Stabilized Zoom and 2.7 inch LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/31RgbkEhqOL._SX300_.jpg", "ProductID": "B001QFZMBK"}}