{"Reviews": [{"Title": "Great features, a great option if you don't want a D-SLR", "Author": "CasinoKing", "ReviewID": "R3GUZY90ZDZWSQ", "Overall": "5.0", "Content": "Was considering upgrading to a D-SLR type camera from my typical point-and-shoot camera, but I have to admit I was intimidated by price and complexity.  I found the Fujifilm S8100fd to be the perfect blend of advanced features, price and complexity level.  I wanted something that had a good telephoto/zoom lens and this one is awesome.  The stability really helps keep things from being blurry and the advanced modes (multi-shot, movie, flash and no flash at same time [sounds odd, read the manual]) are really cool.  This camera helps me take better pictures in almost any scenario.  Add in an 8GB SDHC card and you have the ability to store thousands of photos and hours of video.  Love this camera!", "Date": "May 8, 2008"}, {"Title": "Love the Camera", "Author": "Xavier Davis", "ReviewID": "R2O8ZM9YC9A2A7", "Overall": "4.0", "Content": "I've had the camera for about a month now.  I would consider myself a very amateur photographer.  But I love this camera.  It's more than a point and shoot but not quite a DSLR, I'd call it an advanced Digital camera. It can be used as a point and shoot but I think as your experience grows with the camera, the functionality and use of the camera becomes one of its greatest strengths.The only con I have is minor.  The face detection function doesn't seem to trigger as often as I think it would (considering 90% of my photos are of my baby son) and often the detection picks up things that aren't . . . well faces.Other than this, it's a great camera. Even the video capture is impressive.  Highly recommended to those who want more than a point and shoot but don't want to commit to the more expensive DSLR cameras.", "Date": "April 21, 2008"}, {"Title": "Great camera for a mom who wants all the moments captured", "Author": "T. Pal", "ReviewID": "R3KEHO15KVLWJ0", "Overall": "5.0", "Content": "I'm not an expert photographer by any means...I was a frustrated mom who was always missing important moments because my sleek & slim camera that fit into my backpocket would not 1) shoot fast enough to capture the moments, 2) zoom in close-enough, 3) focus fast enough, 4) take pics in the darkest of auditoriums.I did a little research and in the short while that I've had this camera (2 months), I have found many reasons to love this camera, here a few main ones:a) The auto feature is truly awesome, as long as you remember to click open the flash - it will use the flash as needed...(drawback - flash doesn't open automatically in auto feature - pro- this is one of the few cameras in this price range that has a built-in flash)b) It has the most zooming capability for a camera in this price rangec) love the editing features available on the camera - you can crop/edit pics ont he camera itselfd) it has a sports feature that takes like 25-30 pics every 5 seconds (or something like that)....I've tested it and have 60 shots of my daughter jumping up and downs and it captured every strand of her hair flying in mid-aire) I took pics in a pitch dark room that only had black lights with people dancing and the pics came out looking like all the lights in the room were on and people were posing for the picsf) I only bought the SD memory card and I can take like 400-500 pics before I have to worry about running out of space (and you can still take the card out after it's full and still take quite a few more pics on the camera's basic memory).g) it uses regular batteries - nothign is more infuriating than you're camera running out of battery juice and you can't find replacement batteries at the local grocery/pharmacy store when you're on vacation.The main drawbacks to this camera that I noticed are:a) there is no Fuji bag that fits this camera...you will have to get your own generic camera bag (don't understand why Fuji just doesn't make one to come with it)b) It's not sleek and compact (for those potential buyers who are looking for that)....for moms this is not really a problem because generally your purse is the \"family purse\" where everyone's belongings finds its way into your bag/purse....this is actually one of the mid-range in weight for cameras that are comparable to its featuresc) none of the local stores carry this model(Circuit City/Best Buy/Frys/Ritz Camera/etc)to play around with prior to purchasing - I was able to only purchsae it from Amazon - I had to guess when comparing to other models in the store in terms of size/weight/feature capabilities/etc.I've already made some amazing photobooks from the pics that I've taken from this camera.", "Date": "September 3, 2008"}, {"Title": "Fuji Comes Through Again!", "Author": "Video Man", "ReviewID": "R3ICDGEIWZ71JP", "Overall": "5.0", "Content": "We have had a Fuji S5000 for about 4 years, shot over 18,000 pictures with the camera.  We shoot pictures of our daughters softball, 5 sequential shots at a time.  It really adds up on the picture count, of course we don't save all of those pictures.  You always get at least one good one out of five.  Wanted to replace the old S5000, internal battery backup had died. When you replace the batteries, had to reset the time, date, etc.Did a lot of research for a replacement and settled on the Fuji S8100fd.  The two biggest reasons was: 1) Option for 7 Frames per Second or 16 Frames Per Second. 2) 18x Zoom.We have been very, very, very pleased with the picture quality and the very high frame rate.  It was a great purchase!Cons: Cannot screw a filter on the end of the lens, that option has saved the lens on the S5000.  We do not like the lens sticking out, ie not protected like the S5000.  Will have to be a lot more careful with the S8100fd.Would buy it again!  Great Fuji product!", "Date": "May 31, 2008"}, {"Title": "A really GOOD camera!!", "Author": "Philip Schneider \"Phil Schneider\"", "ReviewID": "RDT0BV8CQU4FH", "Overall": "5.0", "Content": "I am not a photographer, and I have no wish to set this and that and that and that in order to take a picture, nor do I want to trust an auto that produces pics that nobody wants to look at.  THIS CAMERA SOLVED THOSE PROBLEMS.  I use auto and sometimes the anti-shake and sometimes the fast shot for moving objects, that's it.  On 18x full optical, the shots are better than anything I've ever gotten on a digital (and I've had three or four of slightly lower price).If you're like me, and simply want a camera that will take the shots you expect without undue preparation and messing around, this is the camera for you.", "Date": "June 2, 2008"}, {"Title": "You get your money's worth", "Author": "A. K. H. Botchford \"Hawley\"", "ReviewID": "R1DRYLY8JWFQ58", "Overall": "4.0", "Content": "I've used Fuji products for many years.  I've had an S7000 for several years and love it but wanted the added zoom and megs.  The S8100fd is lighter, well laid out, and does all that I want in a camera.  I was a professional photographer about thirty years ago but left that career to work for Fuji for about six years.  I started using Fuji products at that time (employee discount!) and haven't stopped.  I was hooked on both their film and cameras.  Fuji continues to make great inovative products.  The biggest negative on the S8100fd is the sharpness on the rear screen when reviewing pictures.  You really can't get a confident feel for the quality of what you just shot until you review it on the computer. My S7000's screen is much better.  I also can't get used to the speed control for the zoom.  It is too quick for precise adjustments.  Other than that, it is the most camera for the money right now and I love the wide angle to tele opticals. The pictures have been sharp and well balanced for color and contrast.", "Date": "May 15, 2008"}, {"Title": "Waiting to 'fall in love' with this one . . .", "Author": "Sue Phalen Lavey \"Sue\"", "ReviewID": "R1H5RHTIKYC6N", "Overall": "3.0", "Content": "My Fuji S5200 went 'black' after three years, so I purchased this S8100 in hopes that it would give me the same great success I had experienced with my previous Fuji.  So far, I have not had the same results. It offers more features and an increased zoom, but I miss the photo quality.  Portrait mode doesn't seem to be as good, black sometimes appears purple in low light conditions, and noise while focusing is a little distracting.  I've only had this camera for a month and I'll continue to try different settings to improve on photo quality, but I sure miss my incredible Fuji S5200!", "Date": "July 27, 2008"}, {"Title": "Awesome Pictures 18x Wide Angle Dual Image Stabilized", "Author": "G. Chris \"Please believe me!\"", "ReviewID": "RID2B6DJ74IJT", "Overall": "5.0", "Content": "I bought this camera from a local camera shop during my vacation and it is wonderful. I needed something besides my point and shoot with image stablization and this fits the bill. I wanted great photos and didnt mind a bag to haul around. It is easy to use, has great zoom and photo clarity. The focus is fast so we rarely missed what we were after.", "Date": "September 17, 2008"}, {"Title": "Great Machine, but...", "Author": "Chinhung Pang \"Keith Pang\"", "ReviewID": "R13DF606D14PY4", "Overall": "4.0", "Content": "With the 18x zoom lens, you can do almost everything you want.  I have taken couple shots with the 18x, very details, but your hand need to be very steady, even with the stablize function on.  This is normal however.  The only thing which is weak on this machine is the video, you can't zoom during video is taking.  The new Nikon P80 can zoom.  Many other brand offer the zooming in video taking like the Panasonic, and canon.  Other than that, if you are a part time pro, it is more than enough, face recognization, M, P, S priority, you name it, it has it.  Saving picture is a little slow.  i haven't printed any pic yet, but will soon.  Size and wt is pretty much the same compare to the the Nikon P80, Panasonic, Olympus.  these are the only 4 brands having 18x zoom camera.", "Date": "June 24, 2008"}, {"Title": "Great camera for someone who just wants great pictures", "Author": "I. M. American \"GreyGhost\"", "ReviewID": "R3VUYBVKWYJFNJ", "Overall": "5.0", "Content": "I have had my camera for about a month.  I am not a photo hobbyist just want good pictures.  I use it on 10MP mostly but can take low resolution frames for posting on the internet.  The the 18X zoom really makes it easy to use as I don't have to move around a lot to frame my pictures.  I can also take macro and super macro pictures which is great when I am trying to explain something to someone on the net and I can take a cloe up picture and send it to them.  The 4 AA batteries is also great because sometimes my rechargables run out and all I have to do is put in regular alkaline batteries and I am back to taking great pictures.  The feature of digital screen or viewfinder is great for preserving the batteries and I really like that feature.  The review pictures after you have taken them is easy to initiate and recover from to be back to taking more pictures.  I am using a 4G sd card and at 10MP I can shoot 1500+ frames before I have to download.  I have not used the video feature yet but I look forward to it being as great as the rest of the camera", "Date": "August 2, 2008"}, {"Title": "Loaded with features...", "Author": "Floyd Goodrich \"Jim G.\"", "ReviewID": "R1OHKRFCSAP1E9", "Overall": "4.0", "Content": "Great camera in good light but gets grainy in dim lighting, but most digital cameras are that way. Shot a picture outdoors with only the full moon as lighting using ISO 1600 and it looked like daylight. The zoom works nice and the shake prevention seems to be good although you will normally need a tripod at the full 18x. The AVI video is very good but the sound is a little harsh and tinny when you play the movie on a computer, sound could be better. The multitude of functions are all well laid out and easy to use with very little searching through endless menus. Has a nice clear big LCD screen and the electronic viewfinder is good for using outdoors in bright sunshine. The flash is very good and lights up a large area, one of the best I've seen on a P/S type camera. The macro functions are second to none. Using four AA batteries is great and no recharger needed. You can take pictures in nearly total darkness that look great, although a little grainy using high ISO settings. Wish it had an auto lens cap. Overall a very nice camera with a ton of useful features and a joy to use. I highly recommend this camera.UPDATE: After using this camera for a lot of shots I find that a lot of pictures it takes looks washed out and not saturated with color, not every picture, but enough to make me return the camera and order a Canon Powershot SX110IS. I also didn't like the big lag time from pressing the shutter to taking a flash picture. A nice camera but has some annoying issues. A three star camera.....", "Date": "October 14, 2008"}, {"Title": "Love it!", "Author": "Tami531", "ReviewID": "R36ES80JBF1BFN", "Overall": "5.0", "Content": "I did a lot of research online before buying this camera. So far, I just love it! I have to take a lot of pictures in low light without a flash and this camera is really coming through for me in those conditions. I highly recommend it!", "Date": "June 19, 2008"}, {"Title": "Fujifilm Finepix S8100fd Digital Camera", "Author": "R. Nelson \"soccer dad\"", "ReviewID": "R2FC3LSP89UVOV", "Overall": "5.0", "Content": "I use this camera for taking pictures at soccer matches.  The camera is easy to use and takes very good action shots.  I am pleased with the performance.", "Date": "April 25, 2008"}, {"Title": "Great Camera!", "Author": "David", "ReviewID": "R1ZB4CT5G7BUOL", "Overall": "4.0", "Content": "If you don't have the money for an SLR but want something better than a point and shoot, then this is the camera to get. I've had this camera for over a year and have taken absolutely amazing pictures with it. I've taken well over 12,000 shots with the camera, so I know how the camera will perform in certain conditions. I mostly keep it in the manual modes, so I don't have much to say as to how it performs in the automatic modes only that when I used them, the camera produced good shots, nothing special but still good nonetheless.First the lens and auto focus:The 18x optical zoom is generous, definitely getting you close to your subject, however you get a bit of lens distortion at the full focal length. You can tell that the picture was taken from a distance Not a bit deal to me, an annoyance to others. Auto focus works well, fairly fast in daylight, but takes a bit longer in low light. An AF assist beam helps quicken the time in low light which can be turned off if you prefer. Manual focus leaves a lot to be desired, its somewhat buried in the menus, uses the zoom control in combination with the exposure button, and is very slow. Most people won't be using the manual focus so its not that big of a deal, especially since the auto focus works so well. You can select different areas to focus on, continuous focusing, and of course the face recognition. I don't often use the face recognition feature, just because its easier and faster for me to point the camera at the person, focus, then move the camera back and take the picture. It is cool however to see the camera find the faces and remove the red eye, if any, after the picture is taken. On a side note, the camera \"remembers\" the faces so when you go to review a picture that you've taken with face recognition you can press that button again and the camera will zoom in and show just that persons face, press it again and it will cycle through the faces of others if it found those as well. Macro and super macro modes work excellent. The super macro mode opens up a whole different type of photography. You can get extremely close to the subject and see details that you would certainly miss with other camerasResolution:Its ten megapixels, what do you expect? The image size is about 1.5 to 2 megabytes at full resolution, i can fit around 700 pictures on my 2 gig card. Other image sizes are also selectable on the camera if you want to save space. I was a disappointed that I couldn't shoot in raw, but then again this isn't an SLR, so don't expect it to be. One disappointing part of the camera is the noise from higher ISO settings. I don't usually go above ISO 400. ISO 800 is grainy and grows worse as you go higher. Unfortunately, the auto modes will often set at ISO 800, and in burst shooting ISO 800 is the lowest you can set.Body:The camera feels well built. The rubber grip makes it easy to hold and feels much nicer than the textured plastic found on other camera models. The camera's not heavy, but not light either. Buttons are easily accessible and are also surrounded with a rubber grip.Misc:Video; I consider this a bonus on a camera, cameras are supposed to take pictures, camcorders take video. Video quality is fair. You can't zoom while recording.Burst shooting; works great, provides a really cool effect, however as mentioned earlier the noisy ISO 800 ruins the details of the group of photos.Flash; works well, only mentioning it because of how it's activated. The camera can't raise the flash you have to manually raise the flash with a button on the side. I love that it does this because if i want it off i push the flash down and thats it. Other cameras take a few button presses to turn the flash on or off.Sadly my camera is failing. I've taken it in for repair but it would cost upwards of 300 dollars to fix. The main circuit board is fried as well as a few of the motors that run the lens barrel. Even though I've only had it a year and it's already broke, I still rate it four stars because; one, I've not seen anyone else with this problem, and two, I've used this camera excessively, well beyond that of an average user. The camera would sometimes get warm/hot after taking several hundred pictures in a row. I figure this was what was frying the circuits. Again the average person won't take as many pictures as I do each day so this will most likely not happen to you.This is a great camera, it's served me well and I'm sure it would serve you well also.", "Date": "July 29, 2009"}, {"Title": "Very Pleased", "Author": "Lulabelle", "ReviewID": "R3LIHGU76V5XEY", "Overall": "5.0", "Content": "It's worth the extra $100 over the next step down.  Great photos right off the bat, and I'm sure they'll get better when I learn everything about the camera--just have to find the time to check out the cd/dvd that came with it.I make closeup shots of animals, and fast-moving shots of sports events.  Great results for both.", "Date": "October 18, 2008"}, {"Title": "Best Camera - Best Price", "Author": "L. Ammons \"Honey215\"", "ReviewID": "R1FW5HSZP31J8R", "Overall": "4.0", "Content": "Easy to use once I got the hang of it.  Be careful not to push a lot of buttons without knowing what they are for and how to use them. It does what I wanted it to, such as, moving water suspended.  The quick speed made it possible to get impossible pictures. I am still learning the many features this camera has to offer.  I shopped everywhere and through Amazon.com, I got the best price.", "Date": "January 9, 2009"}, {"Title": "Best bang for my buck(s)!", "Author": "squinja \"squinja\"", "ReviewID": "R1CPPKACRFK50O", "Overall": "5.0", "Content": "This is my first time buying anything from the brand Fugiilm. And I must say this fair priced digital camera blows the doors of my previous Olympus. Granted my Olympus was a 3 megapixel and technology has far advanced since 2002. However this camera has an excellent optical zoom and even more zoomier with the digital zoom. I haven't monkeyed around with aperture, shutter speed, white balance, yadda-yadda-yadda but if your so inclined, a person can get all techy if they want to. I'll post some pics when I get a chance. Very good digital camera for well under [...] bucks! :)", "Date": "April 14, 2009"}, {"Title": "Fujifilm Finepix S8100fd 10MP Digital Camera", "Author": "Robert D. Keller", "ReviewID": "R1PMJKKOH9ST3Y", "Overall": "5.0", "Content": "This is a very good camera for the price, and although others had a lower price, I chose Amazon because of their reputation for fairness and honesty and trustworthiness.  There are a lot of companies on the internet with bait and switch tactics that you must avoid.", "Date": "January 7, 2009"}, {"Title": "So Far,  Very Good", "Author": "Pat Anderson", "ReviewID": "R3MKATJDZ4YI8U", "Overall": "5.0", "Content": "I am enjoying a new world of zoom lens and a variety of camera options.  I've had the camera only a month, but my pictures have been great.  I used the night option and got great pictures at a granddaughter's play( no picture taking allowed ! ) dark auditorium...  Distance, shoreline and Lake Michigan came out perfect with zoom lens on a sunny day.  Inside with flash does all I would expect.  The instruction CD, after I copied all info on paper and made a note book to carry with me, seems to answer all my questions  -  so far.  Am about to try it in the \"old west\", southern AZ, I can't wait.  I purchased a 2GB Fujifilm XD chip through Amazon, good price, and the camera is easy to download to the computer, fix the pictures the way you want and then e-mail to the store to develop.  I think one of the best features is the old camera style viewfinder with the adjustment dial along with the LCD moniter.", "Date": "February 20, 2009"}, {"Title": "Easy to use, bitchin' zoom", "Author": "Lily Ball \"Toph\"", "ReviewID": "R1YMPRRV5RFUEN", "Overall": "5.0", "Content": "Pros: The macro function works very well.  The zoom is excellent, very useful for taking photos of details on buildings, and of animals without scaring them away.  The view screen is great, and controls are easy to use once you use it for a bit.  I dropped it once from about two feet, and have not found anything wrong with it so far.Cons: When the zoom is fully extended, it can be hard to keep steady and photos can get a bit blurred, but that's to be expected.  I wish there was a battery indicator to let me know how much juice I have left.  I have yet to discover a lens cap that stays on 100% of the time until I want it off, and this one is no different.Overall, I'm very happy with this camera.", "Date": "May 30, 2009"}, {"Title": "A GREAT ALL-IN-ONE CAMERA S8100FD", "Author": "F. Borke \"Fritz B\"", "ReviewID": "R33KM0B7KD5LGB", "Overall": "5.0", "Content": "THIS IS THE BEST CAMERA FOR THE BUCK. IT TAKES FANTASTIC PICTURES INDOORS IN LOW LIGHTING(WITHOUT A FLASH) AND OUTSIDE. THE MULTISHOT WHERE IT WILL TAKE THE PICTURES VERY FAST AS LONG AS YOU HOLD THE BUTTON IS A GREAT FEATURE FOR ACTION SHOTS. IT TAKES GREAT VIDEOS ALSO. I RECOMMEND THIS TO EVERYBODY. I KNOW 6 PEOPLE THAT HAVE BOUGHT THIS CAMERA AND ALL LOVE IT. YOU WILL NEED AN SD HC CARD 8GB(RECOMMEND). RECHARGABLE AA ARE A MUST.AND A MICROMATE SDHC USB CONVERTER IS NEEDED TO TRANSFER PICS TO YOUR COMPUTER.", "Date": "March 4, 2009"}, {"Title": "Great Camera for the price", "Author": "M. A. Brown", "ReviewID": "R2CD16XTZMMQEX", "Overall": "4.0", "Content": "It isn't an SLR, but it is as close as you will get for this price. Lots of features, but good on-screen menus and \"every-day\" functionality for the photographer that ISN'T a professional. Although, even my semi-pro photographer father was very impressed and expected it to be much more expensive than it was.", "Date": "January 11, 2009"}, {"Title": "Not what I had hoped for", "Author": "cascade hiker", "ReviewID": "R1WFGBZOEXPZIU", "Overall": "3.0", "Content": "Had this for about a week, and was a little disappointed with the battery life and noisy, grainy pictures above 200 ISO.  Distortion apparent in wide angle shots.  Great zoom, but overall, pictures didn't seem particularly sharp.  Probably not a bad budget superzoom for strictly outdoor photos in good light, but I decided to spend a little more and get a DSLR for better image quality in less than ideal lighting, and the added versatility.  Thanks to Amazon for excellent return policy.", "Date": "February 18, 2009"}, {"Title": "great camera but..", "Author": "Sami Abi Sleiman", "ReviewID": "RF0TWFVQLLIB0", "Overall": "4.0", "Content": "i bought this camera from amazon since a month, i was wondering weather to buy  the nikon p80, or the canon g9(my sister has)i found this camera great but it has some weak but acceptable points:1- shooting in auto mode is a problem since it shoots with hi iso making some noise even in acceptable light condition, the g9 is much better in this aspect. so always shoot with manual (p) mode2- the lcd could be better, the g9 also has much superior  lcd qualitythe nice things about this camera is the picture quality, very sharp and precise, macro also is good. focus is great and i noticed a better focusing than the g9 and also focuses fasteras far as i know, i find this camera very good.", "Date": "August 26, 2008"}, {"Title": "A great choice between a point and shoot and full SLR", "Author": "jim", "ReviewID": "R2OXY3DETH15S5", "Overall": "5.0", "Content": "I still want good pictures, and the \"in your shirt pocket\" point and shoots don't deliver. I am willing to have my camera hanging on a strap, and most of the time, pictures are taken at events, so the size of the camera is not so important. This has a great lens! It takes in a lot of light, so it is \"fast\", and clear, even in fast action when a flash is not used. The LCD screen is excellent, and the programing very easy to understand. I came from the \"old school\" 35mm film SLR period, having used very good Nikon equipment. This camera has allowed me to enjoy taking pictures again. I did not want to go back to cases of equipment with exchangable lens and such. This camera is serious enough for the amateur professional to really enjoy the new digital format.", "Date": "February 27, 2011"}, {"Title": "Extraordinary", "Author": "Altagracia Aristy", "ReviewID": "R1LOX7ZIWP5AF", "Overall": "5.0", "Content": "Photos in this advice, don't doid justice to Fujifilm Finepix S8100fd.If you want to see, what is this camera, please go to [...]Altagracia Aristy Flickr photostream, and enjoy.I have a new Fuji HS10, but I not sale my extraordinary Fuji S8100fd, she don't loose value, she increase her value.I now my english is poor, sorry.Altagracia Aristy", "Date": "December 29, 2010"}, {"Title": "The best camera for the amateur photographer", "Author": "Gunasekhar Tirupati \"Gunasekhar\"", "ReviewID": "R2CT3M3D6Y6Y71", "Overall": "5.0", "Content": "Hi,I bought this in Germany immediately after seeing it in an electronics store. Well the initial days were tough for me to get good pictures because I don't know much about photography and the camera settings. I have spent few days in educating myself on digital photography.after two months.... my photos are praised by many people, by my friends and people whom I don't know. What I like most is1. strong colors in pics2. The optical zoom (I love it)3. Built-in shooting modes (no need to scratch head)4. face detection and image stabilization5. Adjustable image sizes based on mega pixel selection6. All buttons seems to be perfectly placedWhat I don't like1. The lens cap is always an obstacle2. Some times the images are blurred for no reason.3. The slowest shutter speed is only 4 sec. There is no bulb feature.4. Some times the colors are very light that they don't look good (May be I have to learn)Totally this camera was the best for the price (I bought for much low price at the time).For a beginner and amateur photographer this will give great experience.CheersGunasekhar", "Date": "November 18, 2009"}, {"Title": "just what I wanted", "Author": "Janet M \"older but wiser\"", "ReviewID": "RQU51ZK46IOB9", "Overall": "5.0", "Content": "Fujifilm Finepix S8100fd 10MP Digital Camera with 18x Wide Angle Dual Image Stabilized Optical ZoomBetter than I expected.  I like the convenience of the AUTO settings, but for shooting sunsets or low light subjects I can do my own settings.  The video with sound is also very good.  I think if you want to graduate from point and shoot, you'd be very satisfied.", "Date": "June 28, 2009"}, {"Title": "great", "Author": "William F. Cox \"fuzzycreek\"", "ReviewID": "R8UJ0KBTQR41J", "Overall": "5.0", "Content": "Fuji has outdone themselves with this camera.  Easy to use.  Great pictures.  no problems encounter with this product.", "Date": "June 12, 2009"}, {"Title": "Solid All-around camera", "Author": "M. Hurley \"Ascerbic Mac Geek\"", "ReviewID": "R2YSYUM7QH8HN9", "Overall": "4.0", "Content": "My wife and I bought this camera to take with us on a long vacation. We wanted to be able to take high quality photos of our family and the places we visited as well as inside museums and beautiful buildings. It performed admirably. The color quality seems to be quite good and the photo resolution is excellent with little noise. My only minor issues are a strange banding which appears only on the screen in bright light (it does not appear on the photos themselves) and this camera's utter lack of high-speed capability. We rarely use high-speed photography so it's not a big problem, but if you're looking to shoot a sporting event or other fast-moving subject this may not be the camera you're looking for. All in all, a very satisfactory purchase and one we do not regret in the least.", "Date": "June 7, 2009"}, {"Title": "Nothing like it for this price", "Author": "Baixinho \"Moose\"", "ReviewID": "R862KLQGSLFQ4", "Overall": "5.0", "Content": "If you want performance in low light and intend to use it at 18x zoom a lot STOP and go get a SLR. For all other uses this is the best you can get. The macro function is great, color saturation is beautifull and up to half the zoom range the focus is sharp and quick. Zooming beyond half point will make the focus slower, contrast and sharpness also suffers at close to maximum zooming. But, again for this price...", "Date": "May 22, 2009"}, {"Title": "Fujifilm Finepix S8100fd 10MP", "Author": "ladybugmom \"mom Thier 300\"", "ReviewID": "R2CGFS9UTMRFPM", "Overall": "4.0", "Content": "I have been more than pleased with the camera. I'm an amatuer and have been able to take great pictures, especially close up. I enjoy taking pictures of birds and this camera takes excellent photos, the pictures are clear and detailed. I recommend the camera. It has many features and I have not looked into using them but will once I find time too. I've had comments made to me about my bird pictures like \"It is as if I'm intruding on their privacy because the picture shows so much detail when close up\". Karen Hayes Thier March 09 - purchased Nov 08", "Date": "April 1, 2009"}, {"Title": "Great Performance", "Author": "Chin W. Wong \"Amosw\"", "ReviewID": "R2D9XAI72G6X2M", "Overall": "5.0", "Content": "I have used the camera for few weeks, the result is great. Especially take snapshot for near object and far scenery. It is also very easy to use. There are still many functions I haven't tried yet, but I believe this is a great camera. Of course, great price too.", "Date": "March 21, 2009"}, {"Title": "I am in love!", "Author": "M. Sherrell", "ReviewID": "RKW576N6YDI96", "Overall": "5.0", "Content": "Granted, it has taken me a long time to want to actually bust this thing out and use it, because it's a lot of camera for a beginner, but I think I have gotten over SOME of the fear of dropping it. :) This camera is great and offers lots of variety in features. The zoom is AMAZING and the pixels are beyond what I thought they would be. The menu and things are hard to find if you aren't an instruction manual reader, but trust me, this camera is a great buy and I got a wicked good deal on it!", "Date": "March 16, 2009"}, {"Title": "Very Good Camera with Room to Improve.", "Author": "John Jiang", "ReviewID": "R2P39SK2KAODAK", "Overall": "4.0", "Content": "Lots of neat functions. It takes great pictures with enough light. With low light, the AUTO shooting mode is not good at all. However with some learning and trying in A, S, P or M modes, quite good picture can be taken. Love the Continuous Shooting function. I have taken almost 500 pictures already. The 2500mAh batteries are still working fine. The Low Battery indicator has not shown up yet.My only complaints (as compared to my Minolta) are the camera is a bit slow:1. taking picture - quite often after I got a good focus and pressed the button, the picture was taken maybe a tenth of second later. By that time, my little boy already moved.2. charging flash - sometimes it's fast enough, but sometimes quite slow.Overall, it's a very good camera. I would recommend it.", "Date": "March 9, 2009"}, {"Title": "fuji finepix s8100", "Author": "Susan Davignon \"susan davignon\"", "ReviewID": "R4CI0ZRU6PPDM", "Overall": "5.0", "Content": "I find the fuji finepix s8100 easy to use and takes great pictures. I especially like the macrozoom feature as I like taking pictures of insects and the like. I also enjoy the video feature for the wildlife in my area. I recommend this product and am glad I purchased it. The price was the best feature as I have noted the price of comparable cameras.", "Date": "February 25, 2009"}, {"Title": "Cudos to Fujifilm", "Author": "Bruce Johnson \"TW\"", "ReviewID": "RRLU5OX4KPYUX", "Overall": "5.0", "Content": "I've had this about 3 weeks now. It's my 3rd digital camera. I really just want good photo quality, manual & auto modes. This has many features I will never use, like movies.It also has lots of great & very usefull features I never thought I wanted but am glad to have as I become more familiar with the camera.It's nice to be able to use various memory cards, I already had SD's & like em' fine. AA batteries are handy. I take most of my pictures outside in direct sunlight so a viewfinder is needed but the LCD is usefull as well. Instant zoom is something I didn't want, now I use it regularly. It changes the framing dimensions, minimizing the need to crop later on. Aperture priority is handy for a clear subjest against a soft focus background, (not as good as a fully manual.)I like the f setting for sensitivity control & the chrome position (color level of kodak chrome film.)Not the crispness of my friends $1000 DSLR but not bad by any means.Very nice wide angle & super zoom, though the stabilization is over taxed at max setting, still usefull.A lot of snap for the money. I'd buy it again.", "Date": "January 20, 2009"}, {"Title": "Exelent camera", "Author": "Manuel Rojas \"Aapl Up\"", "ReviewID": "R2PNT6LTCECCN6", "Overall": "5.0", "Content": "The quality is perfect and it has many options for beginners and advanced users. I love it", "Date": "December 16, 2008"}, {"Title": "Fujifilm Finepix S8100fd", "Author": "Glenda L. Powers \"screenname\"", "ReviewID": "R3A7BPSZCBD51T", "Overall": "5.0", "Content": "I was reluctant to buy this for two reasons:  1) the wide swing on reviews, and 2) I couldn't believe that a camera this inexpensive could do what it claims.  But, I went ahead and took a gamble and am not disappointed in the least!  I'm able to use manual settings to my hearts content, obtain a very high level of detail in macro mode--and, with the image stabilization, I don't have to wait for my very-hyper Pam chi to tire out before clicking some clear pictures!The only complaints I have, is that the 2-second delay is hidden in the set-up controls rather than on the top of the camera like my last Finepix (I use that feature quite often), and the lens cap doesn't click into place like the prior version...I would have paid a little more to keep that feature.  I suspect that the lens cap design was changed to save on manufacturing costs, but it would have been needed to accommodate the 18x zoom.", "Date": "March 31, 2009"}, {"Title": "LOVE IT!", "Author": "Hadassah", "ReviewID": "R1FXOZNNHYK1RZ", "Overall": "5.0", "Content": "I bought this in MAY of 2008 when it was a bit pricer. I will have to say its a steal if you were to buy it now. I love the camera. I started out using the camera to begin taking photos of  nature etc. After using it for almost 8 months I have learned so much about the cameras features and how to use them all properly. I am still learning but each thing I learn it shows in the beauty of each photo I capture! It works fine, in fact I went to buy a nice camera case in BEST BUY just a few days after I bought it. While I was in the store I took my camera with me . I had it around my  neck then Bam out of nowhere it drops on the ground.  I was so pissed at myself. Part of the camera broke where you turn it on. I got home checked it out. It was still working as if nothing happened. I had only loosed the on and off switch. SO i got some crazy glue and wala! Perfect. Really buy it! GOod luck", "Date": "November 30, 2008"}, {"Title": "My fist camera experience!!", "Author": "Milkywaykisses", "ReviewID": "R38HR7NAMHFI4D", "Overall": "5.0", "Content": "yes it is, believe it or not. This is my first digital camera and I am not disappointed. Im a late bloomer into the digital camera world. Although, I have to say that it wasnt because I new nothing about cameras or what to look for. Its just that when it finally became imperative to have one handy for those special occations, there were so many of them in the market that I took my sweet time looking for a camera with what I wanted that still fit into my budget. Im also NOT a camera wiz but more of an ameature photographer that had an idea of what to look for. So what I was looking for was a camera with all kinds of functions to play with. yeah, thats right. if you dont have the patience to experiment or a clue on where to even start, maybe this isnt the camera for you. Just go for one of those slim Canons that does everything for you. One great feature in this camera is the zoom (18x!!). I did not want to keep switching lences for every shot I wanted, much less lug them around in a backpack! The thing that kinda sucked was the no-zoom during recording. yup, just like everyone else said before me. You kinda have to set the zoom before you start. Everything else is as described and I am really enojying playing with my FUJI s8100fd very much.", "Date": "November 21, 2008"}, {"Title": "Great deal on the camera", "Author": "jerry b hanley", "ReviewID": "RR8ECWG98165W", "Overall": "5.0", "Content": "This is my second used camera purchased on Amazon.  If my luck holds out, I just may not buy another camera new, period.  The camera came as advertised.  I popped in new batteries and a memory card, and started taking pictures.  This is also my third Fujifilm Finepix camera, so operating the S8100fd was a snap.Thanks to the seller and Amazon for providing a nice deal, reasonably quick delivery, and a bargain price.", "Date": "July 25, 2013"}, {"Title": "Good Camera", "Author": "Mary J Beyer", "ReviewID": "R35RXXB7KM76N2", "Overall": "5.0", "Content": "Even though I returned this camera, I still think it was a good camera.  The reason I returned it was because I found another fuji with a higher optical zoom and more MP for the same price.  I did give up the panoramic feature that this camera had but the next one I ordered did not.", "Date": "June 27, 2013"}, {"Title": "Fujifilm Finepix 10MP Didital Camera with 18x wide angle dual image", "Author": "charles wayne leonard", "ReviewID": "R239EI5RPF8XLQ", "Overall": "5.0", "Content": "this product works very good great pictures easy to use . would buy again if i needed it realy useful, also will do a video with a turn of the dial", "Date": "May 25, 2013"}, {"Title": "Once I got to know it!  WOW!!", "Author": "Lynda", "ReviewID": "R1FSHVDPRD53Z9", "Overall": "5.0", "Content": "Well,it took me awhile to get to know this camera.  It is in between a point and shoot and DSL because it can go sooo manual  you can get lost...or you can point and shoot but what a waste to only do that!  If anyone says it is not fast..they have not set it at continuous 0,03 and kept firing!! She never misses a shot!It does take awhile to do the storing but I think I need to upgrade the memory card..hoping that will improve the storage time. The beauty is you only have to take one shot or several on the continuous mode. Sometimes it is almost too clear with the 18X on wet hair you can get a slight distortion because of the clarity..This camera is teaching me to take photos because it is so usable and although not simple it is all there...one tip..it helps to read the manual...lol...LMP", "Date": "December 18, 2012"}, {"Title": "Great Deal", "Author": "crino", "ReviewID": "R3NT3YT8NN2MNW", "Overall": "5.0", "Content": "After two Fujifilm cameras (2003 & 2007) I needed a new one.Found great deal - low price & quick delivery.Camera is excellent.", "Date": "November 9, 2012"}, {"Title": "Great camera, but, doesn't come with an instruction booklet", "Author": "Shana \"That's my opinion- I could be wrong!\"", "ReviewID": "RXHBG3SOYBC6F", "Overall": "4.0", "Content": "This camera takes great photo's and has a lot of great features. It has many features that you'd find on a more expensive camera. I'm an amateur photographer and I bought this as the look and the feel of this camera reminded me of the older more quality made camera's like my old Pentax. I purchased this mainly because of the 18x zoom and the 10 megapixels. I'd recommend this camera for some wonderful close-up's.Though, at times the stabilizing feature doesn't seem to work as well as I'd like, the shutter speed sometimes is slower than I'd expect on certain settings. Though, it could be something I'm doing wrong.The other thing about this camera I was a bit disappointed in was that it didn't come with an instruction booklet. You can print off the whole booklet but, when you purchase this nice of a camera I think it should already be printed and in the box with the camera. I don't want to use all my printer toner just to print an instruction booklet and it isn't user friendly to look up the info on your computer. I bought a cheap Samsung digital camera and it had a nice book with it, so I expected there to be one in with this camera.Overall, this is a great camera for the money and takes really good photographs.", "Date": "June 12, 2011"}, {"Title": "fuji fine pix camera", "Author": "Bobby", "ReviewID": "R2HIFV55PA5XJA", "Overall": "4.0", "Content": "pretty good camera, a few small details I don't like, the lenscover falls off always, not a quite as easy to figure out as my older one, but it sure has a lot of features for the money", "Date": "November 15, 2010"}, {"Title": "Love this camera", "Author": "Chuck", "ReviewID": "R3PZIZ5WQPJQG3", "Overall": "5.0", "Content": "I have had this camera for two years now, and can't say enough good things about it.  The 18X zoom with the stabilized optical zoom is great.  While taking pictures of Whooping Cranes down in Texas last winter, I saw several people who missed getting great shots because they where to busy trying to put on their telephoto lens.  I really love how easy it is to use.  I would recommend it to any one who wants a good picture that is may be not professional but will bring you joy from the results, and praise from those you show your pictures to.  Of coarse if a professional was using this camera, then I am sure it would look like a professional picture.A great camera for the price.", "Date": "October 7, 2010"}, {"Title": "Excellent point and shoot camera", "Author": "DDL", "ReviewID": "R2ATLK5UAHBUA5", "Overall": "5.0", "Content": "I bought this camera a year ago and I absolutely love it.  It's easy to use and has lots of great features including settings for macro shots, a special setting to take pics of fireworks, and the option of taking \"continuous\" shots when holding down the shutter button (which is great if you're taking photos at a sporting event). It has a video option which I've used and both video and sound are of good quality. You have the option of using the viewfinder or display screen (it's easier to see using the viewfinder if you're out in the sunshine).  It's not a small camera so I gave it an average rating for portability - perfect for a large purse or tote bag.  It has a nice zoom.  The image stabilization works great - I use this camera when we're out in the boat and even when I take shots as the boat is moving and rocking on the water - they come clear!  I use disposable batteries and they last quite a long time.  In the last year, I've only changed the batteries twice. I'm not a professional photographer. I use this recreationally and to take photos of my children.", "Date": "September 11, 2010"}, {"Title": "Beat point and shoot camera", "Author": "Neemund \"Freelance Bum\"", "ReviewID": "R3NCNSH3THYK9P", "Overall": "4.0", "Content": "I've been using this camera for about two years now, and love it.  It does everything that I want in a camera, and does it well.  I spent 2 months reviewing cameras looking for the best non-SLR camera I could find, since I wanted something a bit smaller than an SLR that would not require me to carry 2-3 lenses to compete with the abilities of an SLR-like camera.  The 18x optical zoom is amazing and has allowed me to take many great shots, the same goes for the super-macro feature.  I keep the digital zoom turned off since I will never use it, Photoshop will blow up an image better than the camera ever can.  Being able to use rechargeable AA batteries makes owning this camera cheaper since I take several sets with me when I travel, getting about 200-400 pictures per set depending on flash use.The two things I don't like about this camera are the image sensor and picture format.  I take virtually all of my pictures at fine 10MP, ISO 64.  These pictures look very nice, unless you need to zoom in fully to blow something up in Photoshop, where the image looks somewhat grainy.  But this is probably as good as you can get in a non-SLR camera due to the image size.  The other feature that I would like would be RAW image formats, but I can live without it.  I'd give it 4.5 stars if that was possible, but gave it 4 instead of 5 since it's not perfect.", "Date": "August 14, 2010"}, {"Title": "Came as promised!", "Author": "S. C. Pyle", "ReviewID": "R30CMVKKKNWDGT", "Overall": "5.0", "Content": "This camera was a gift for our son for his wedding.  He is absolutely pleased with this camera.  It came in a timely fashion and everything was as promised.", "Date": "June 2, 2009"}, {"Title": "Fuji Camera S8100fd opinion", "Author": "Williams J. Sanabria \"Bill\"", "ReviewID": "R1CG92E6X14DIP", "Overall": "5.0", "Content": "Excellent product, received on time. unfortunatly I didn't recieve information about whether the guarantee apply Internationally.", "Date": "May 4, 2009"}, {"Title": "Fine Fine Finepix", "Author": "doxieluv \"Camano island girl\"", "ReviewID": "R4PUSBU3XKLYY", "Overall": "4.0", "Content": "Hi,I am still learning the camera, but so far I love what I have done.  The close-ups are great and the sunset feature wonderful.  As I continue to learn the camera I will probably increase my rating but am hesitant in case it is more complicated than I like.Linda (Camano island girl)", "Date": "March 23, 2009"}, {"Title": "Good Quality Camera", "Author": "G. Klein", "ReviewID": "R1KDSKBER5E89L", "Overall": "4.0", "Content": "I have had Fuji ditigal cameras for years.  I wanted one not only with a high megapixel but also a long zoom.  This one met all of my requirments and I am pleased with it even though it is a little heavier than I would have liked.  I like the fact that it will use both the xD card along with the SD card.  The one drawback is that is takes 4 AA batteries.  All in all, it is a good camera at a decent price.", "Date": "March 5, 2009"}, {"Title": "Fuji is a great bargain", "Author": "J. Marish", "ReviewID": "R1MJS00SHMQJQF", "Overall": "4.0", "Content": "I owned an older version of this camera and never had a problem with it...I got loads of compliments on the quality/vibrancy of the pictures I took with it so I decided to upgrade to the newest version of the same camera.  It's awesome!  There are loads of new options on it such as the flash/no flash and zoom options.  The quality of the pictures is even better with the new version...if you don't want to spend a lot but want good quality pictures, durability and ease of use, go with this camera.  You won't be disappointed.", "Date": "January 27, 2009"}, {"Title": "LOVE IT", "Author": "Bryan Payne \"mommy of 2\"", "ReviewID": "RSPBTKT68ZN4Z", "Overall": "5.0", "Content": "This camera is my fist experience with a fuji camera, I don't think I will ever buy another brand.  This camera is awesome.  The zoom is amazing!!!!  This product would be great for anyone...  Takes great photos, has many settings and is very user friendly.", "Date": "January 23, 2009"}, {"Title": "fujifilm finepix s8100", "Author": "Max", "ReviewID": "R1SYO3MC6IVVQI", "Overall": "4.0", "Content": "This is a great camera especially for the price. Has all of the features and more that more expensive cannon and nikon similar cameras have. The pictures are great. I like the feature that lets you take two photos one with flash and one without at the same time. Usually the one without flash is better, even at night. The only thing I don't like the user manual is on a cd (pdf file) and a hard copy cost $16 from fuji which is unfair.", "Date": "January 7, 2009"}, {"Title": "What Happened, Fuji?", "Author": "Kurt Schanaman \"Lost between the covers...\"", "ReviewID": "R1WEDTJPHJWYJY", "Overall": "2.0", "Content": "I've been an avid stock photographer for aeons, and wanted a good cross between point-and-shoot and dslr instead of hauling around the more expensive equipment.  After reading many positive reviews about this rig I took the bite and got the bullet.This camera is fine for those who want clear pictures on a computer screen or a digital picture frame. However, when doing stock photography, this thing is terrible - absolutely terrible. The images in anything but bright sunlight are riddled with digital noise in shadow areas.  Indoors, you better have a couple of studio lights if you want decent photos because if not, you will get washed out faces and lots of hot spots due to the fixed onboard flash (no hotshoe for an electronic flash to do bounce with).  Your only hope is to at least tape a piece of parchment paper over the flash to soften it a bit.  But you WILL find that you have to use it if you don't want to go higher than ISO 200.  And if you do go higher, your photos will begin to show the inadequacy of the sensor in this camera.I'm very disappointed in this camera and it now sits on the shelf collecting dust.  I may give it to our 4-year-old son for Christmas this year as a child's playtoy and will just simply carry my Nikon D40 with me everywhere.  At least it gets me the shots I need for my customers.  They like the photos taken with the D40 but the photos taken from the 8100fd are generally rejected.If you are doing anything other than outdoor daylight photography, I wouldn't recommend this camera if you are into quality.", "Date": "February 19, 2009"}, {"Title": "pretty good camera for the money", "Author": "Mars", "ReviewID": "R68Y19J36OUXZ", "Overall": "4.0", "Content": "Easy to use and the image quality is pretty good, battery life is good too.", "Date": "September 16, 2009"}, {"Title": "Good camera. . .", "Author": "Lamar Welch", "ReviewID": "R48KME9LZPEUE", "Overall": "5.0", "Content": "The S8100 Fuji is a good camera. . . just like a true SLR except the fact you can't change lenses, everything else is very good.", "Date": "August 19, 2009"}, {"Title": "fujifilm finepix s8100fs 10 mp digital camera", "Author": "Margie A. Quigley \"PEZ HEAD\"", "ReviewID": "R19ESGOLRPD0HZ", "Overall": "4.0", "Content": "I LOVE ALL ASPECTS OF THIS CAMERA ESPECIALLY THE FAST SHUTTER SPEED. HOWEVER, I AM FINDING IT DIFFICULT TO TAKE CLEAR PICTURES AT NIGHT OF SPORT EVENTS LIKE CAR RACES.  SEEMS TO BLURR???", "Date": "July 16, 2008"}, {"Title": "fujifilm S8100 10mp 18zoom digital camera", "Author": "Beverly J. Wright", "ReviewID": "R3L902B7LTWFCF", "Overall": "4.0", "Content": "I wanted a good camera with a pretty good zoom for wildlife pictures.After trying out my new camera I changed my settings to use the 5 megapixle mode rather than the 10. The 10 was grainy in my picture program.I had to make the picture smaller to correct that.The red eye functionis nice as well is the multiface focus.I replaced my S5200 Fujifilm forthe bigger zoom and also the view finder is not sealed good enough tokeep out tiny dirt particles.It doesn't affect the picture,but when Ilook thru the view finder I see all these little specks and I traveldusty roads most of the time.I hope this one will be better sealed.Therest is yet to see.", "Date": "February 3, 2009"}, {"Title": "big mistake", "Author": "Nemanja Jovanovic", "ReviewID": "R138SWLRMPTB68", "Overall": "2.0", "Content": "Image sensor has a lot of noise.Zoom works fine, but plastic can not hold optics properly centered and image is not sharp (out of focus).It is a big step back in quality from older products.Do NOT recommend.", "Date": "May 15, 2008"}, {"Title": "great", "Author": "Peggy Delahoussaye", "ReviewID": "R1QOZI3KPI6W1P", "Overall": "5.0", "Content": "I am new to camera's so i didn't know what to be expecting, but i was really impressed with the amount of features this camera posses. The 18's optical zoom is amazing it really helps when i want to take pictures of people that are doing thing embarrassing and then making fun of them. The flash is ok but it is not the best i have seen. The picture quality is amazing. Overall this is an amazing camera for the price and i suggest buying it.", "Date": "November 26, 2008"}, {"Title": "Started off okay but then got worse and worse", "Author": "Skyler Kogachi \"nytesky\"", "ReviewID": "R2JZ89W7G9RRFG", "Overall": "1.0", "Content": "I should have returned this camera soon after I bought it, but it was okay, so I decided to live with it.The interface is not intuitive, and makes it difficult to master unless you use all the functions often. It took decent pictures in bright light, but there was a lot of noise in what are light levels that don't need a flash in my Canon point-and-click camera.Over the first 6 months, the noise levels got worse and worse, making the camera completely unusable indoors. Of course, it is no longer in warranty. A completely waste of my money. I should have never taken a chance in buying a brand that I didn't have direct experience with and will NOT make that mistake again.", "Date": "March 18, 2009"}, {"Title": "Fuji 8100 camera", "Author": "Jimmie Shelton \"JR Shelton\"", "ReviewID": "R2GLKV0PV3GYU4", "Overall": "2.0", "Content": "I find the camera a disappointment. The macro option is totally unsatisfactory. Who wants to tote 2 cameras? The Fuji 8100 for everything but close-ups, and another with a functional macro. I'm really dis-satisfied.........JR Shelton", "Date": "May 27, 2008"}, {"Title": "Didn't work out", "Author": "Michelle Anderson", "ReviewID": "RY0SGXQ0UQY5I", "Overall": "3.0", "Content": "Never received the camera, was damaged before it made it to me.  Seller did refund, but was not electronic.", "Date": "March 6, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0012Y0BIE"}}