{"Reviews": [{"Title": "A perfect example of how a company can straight up lie to you.", "Author": "S. Easton", "ReviewID": "R3BG24JBP0DQC3", "Overall": "1.0", "Content": "I'm embarrassed to even admit that I bought this piece of junk. It was on sale at Radioshack for $50 (Black Friday), but as soon as I turned it on, I wanted to chuck it through a window. You know that feeling you get when you have made a big mistake? Like a lightheaded, stomach ache kind of feeling? Yeah, got that.Nothing advertised about this camera is true. Well, sort of. It says 8.1 mega pixels, which may be right, but mega pixels don't matter when you have a terrible lens. I kid you not, my old camera phone takes MUCH better photos than this Vivitar. It also advertises 'Optical Zoom,' and by that they mean: 'Turns image into pixilated mess.' I would say it has to be seen to be believed, but... just trust me. My Vivicam even has a sticker on it that says 'High Definition.' HiDef what? What about any of this is HiDef? 'Auto Focus Zoom Lens?' 'Antishake?' Where the heck is all of this? Vivitar sits on a throne of lies.The best part is the trash symbol on the right side of the nav wheel, which you would think would be the 'delete' button right? Na. If you want to delete a photo, you have to go through a flurry of menu screens. All the symbols on the camera are just there for show. They got one for 'timer' 'flash' and I'm guessing 'outdoors' but none of them actually do anything. There's even some holes at the top that look like a speaker, but surprise! No sound.I would like to find the Radioshack employee that conned me into buying it and force feed him my purchase, but instead I have decided to keep it as a reminder to never buy something on a whim without reviewing it first. Or just stick to name brands.", "Date": "January 17, 2010"}, {"Title": "Misleading advertising. (Or should I say lying?)", "Author": "J. Welch", "ReviewID": "R3QJ50KX65WT73", "Overall": "1.0", "Content": "Optical zoom apparently doesn't mean what it used to. I could live with the non-intuitive buttons/menus and the abysmal image quality, but the fact that there IS NO optical zoom while the advertising on the camera, on the box, and here on Amazon insists there is takes this camera (and the company who peddles it) to a new level of terrible. The camera LOOKS like it's zooming, but it's not. See this review if you don't believe me:[...]If [..] deletes the internet link, just go to the [...] and look for their review about this camera.", "Date": "April 8, 2010"}, {"Title": "Choose another kind", "Author": "R. Dzielinski", "ReviewID": "R22TTI1ZNXN8Y6", "Overall": "1.0", "Content": "A true waste of money.  Grainy images, a non-intuitive menu, difficult playback menu.  The flash always defaults to off, so when taking indoor shots, you must press the flash button to turn it on.  Take a shot, want another? Don't forget to press the flash button.  I do not have a single positive thing to say about this camera.  Bought it for my 11 year old...he deserves better.", "Date": "February 19, 2010"}, {"Title": "DO NOT BUY!!! THIS CAMERA = JUNK!!", "Author": "Chad Poindexter \"Stick\"", "ReviewID": "R173ZML4LDSVCP", "Overall": "1.0", "Content": "My wife got this camera for me for a Christmas gift last Christmas. She went into Radio Shack looking for a good camera for about $100 and the employees quickly pointed her to this camera. They must have given her a good spill because when she got home she was so assured that this camera was a great camera she opened it and threw away the plastic sleeve it was in and then charged it so that it would be charged Christmas morning. I really needed a good camera that took good pictures for gear reviews I do so when I saw a new camera I was stoked. At least until I took a picture...This thing is junk. The controls are difficult to maneuver through but that would have been ok if the picture would at least be good. The pictures are awful. They look awful in the display and even worse when transferred over to a computer. I asked a buddy to take a picture of me in a well lit area standing about 10 feet away so there was no zoom used whatsoever, and the picture was miserable. This thing is not even worthy enough for my kids to play with.So, a few days after Christmas we took the camera and all the books and wires back to radio shack, but since she threw away the plastic sleeve it was in they could not accept it back. I got a little upset but knew it would not make a difference so we left and now have this crappy camera sitting around.So, please do not buy this camera. It is cheap crap.To make up for it I am getting the Panasonic Lumix FH20 this year. This is what a camera should be for this price range.", "Date": "November 21, 2010"}, {"Title": "blurry", "Author": "K", "ReviewID": "R3139RZN64ZHI9", "Overall": "1.0", "Content": "The camera does not work properly. I know a lot about the settings but nothing fixes the blurriness. I believe the auto focus is broken. I am returning it. Otherwise, I like the product and it's features...if it only worked.", "Date": "December 31, 2012"}, {"Title": "The worst", "Author": "John Barry", "ReviewID": "R7X8IKHL8626A", "Overall": "1.0", "Content": "Beware, this is an absolute piece of junk!  Terrible picture quality.  Overall difficult to use.  Worthless instruction manual.  There are few products in life as disappointing as this - it is that bad.  Finally I threw my camera in the garbage it was so frustrating and worthless.  This is unworthy of even a one star but the only way to post this review was to at least assign that to it.", "Date": "December 10, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.1 Megapixel Resolution\n2.4\" Screen, Antishake\n2 X Optical & 8X Digital Zoom Lens\nSD Card Support up top 8GB", "Name": "Vivitar ViviCam 8225 - Digital camera - compact - 8.1 Mpix - supported memory: SD, SDHC - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/413ux2gNjrL._SY300_.jpg", "ProductID": "B001VIG9VY"}}