{"Reviews": [{"Title": "Rebutting the  Cons", "Author": "Jacqueline Buemi \"Be the Light you Wish to See\"", "ReviewID": "RJGF0PRIKJM78", "Overall": "5.0", "Content": "***Updated 10-7-11****After 3 years of use, this camera is still awesome and I'm literally gonna wait till it breaks or there is a an iphone with a high megapixel to match before I get rid of this.  I've taken it to the sandy beaches of California, farms of Ohio and Water parks of Wisconsin.  This camera still works great.  I've had to have it cleaned (due to my rough use on it). I've dropped it, left it in a the sand during a windy time of day, and let my 3 year old take pics with hit.  Nothing has ever broke and I'm very happy with the battery life. Some superficial/light scratches on the screen but none I\"m worried about.  I am not sure how long it lasts but I charge it maybe every couple of months - and I have now taken nearly 8000 pictures (that I have kept on iphoto) and perhaps more that I deleted.  So happy! :Now the original review-This review is based off of several days of use and a THOROUGH review of the manual.  If you are interested in seeing specifications and actual pictures of this camera (which I suggest you do) I recommend visiting websites that offer extensive these types of reviews [...]First, lets review what seems to be common CONS to the camera.POP UP FLASH.  Contrary to some reviews, this camera is not hard to handle/hold nor does the pop up flash get in the way or feel flimsy.  Notice Canon has made three designs to combat this problem (e.g. indented thumbprint above controls on back of camera, curved body on right side of camera, and about 3/4 inch space to place finger behind the flash. As I right this review, I am playing around with the flash and notice it feels sturdy; not flimsy.  Also, the further the distance between the flash and the lens allows for a better red-eye reduction.NO VIDEO (optical) Zoom.  This camera offers excellent video quality for a \"point and shoot camera\".  It is 720 so expect that quality - no more no less.  As for the zoom, it only has a digital zoom (i.e. less quality than optical).  Nonetheless, it should not be a deal breaker - unless you are in the market for a digital videorecorder.  I recommend a stand alone video recorder at this point.  Would it be nice to have a zoom, sure, but honestly, this is not a big deal.NOISE - Indoor use.  PLEASE believe me when I say I find very little if any noise on indoor shots (when using the camera correctly (e.g reading the manual!!!).  There are many ways to adjust this camera - MANY ways!  Again, I am reviewing pictures I just shot today inside my local library and find them very pleasing and no noise!FIT/FEEL of Camera.  This camera does not feel flimsy.  This I think I can promise you.  Actually, when I got the camera in my hands, I was suprised to feel and see it was thicker than I thought - but not too thick.  Still able to put in pocket (although not if you are wearing tight jeans).  If you are looking at this camera, chances are you doing so because of the aesthetic body - and you are right.  When/if you put it in your hands, you'll understand that it is, well, sexy and fashionable.I have put forth what I saw as potentially \"deal breakers\" to some people and find all of these supposedly negative points not so negative.  After thorough research and an extensive review of the manual, I find this camera to be excellent.Finally, let me try to state what I believe to be the absolute best features of this camera.1. Quality.  The only way to defend this point is to recommend doing research.  Many websites have posted pictures this camera has taken - many of them stunning.  I even saw a side by side comparison with the SX200IS rival - the TZ7.  It was a picture of a night time view of a major city.  This camera won hands down.  And as for video quality, I was happy with the quality - if you expect 720 and not blu-ray quality.  It honestly is great- oh yea, and I notice that when shooting with video, the image seemed to have little or no shake  I was suprised about this).2.  Function.  You can immediately use this even if you never used a camera before.  Thank canon for the \"easy\" function which lets you only hit the shutter button: it does ALL the work for you, and has hints/tips on the screen as you shoot.  Or if you are not so novice, you can turn this camera into a complete manual function and create your own aperture, shutter, and ISO values.  This is the reason I bought this camera; so I could go more manual while my wife could just point and click).3.  After having this camera, I have noticed that CANON has not marketed this camera well enough.  It has LCD image brightness control that changes on screen depending on how bright it is where you are shooting.  Very nice to view the lcd.  Also, the LCD has been layered with a scratch resistant coating!Finally, in my opinion, this camera's best feature is its versatility.  What I mean by this is that it takes excellent pictures and allows you to grow with the camera - this point needs to be emphasized.I suggest that you truly do your research (as you are doing!!:) and you may see as I did that no matter how many cameras I reviewed, I kept coming back to the SX200IS.  I am glad I have it.One final point.  If you do get this, please review the manual.  It is your bible and will really help you understand the camera if you want to turn it into more than a point and shoot.  I wrote this review because I was SHOCKED at the criticisms this camera received.  I agree that this camera can be fine tuned (longer battery life.....etc...) but these are by no means deal breakers.  Don't worry, whatever camera you get, it will be soon outdated - all cameras get their annual tweaking.  Having said that about camera's getting outdated, note that I chose this camera for the features it has for the price it is.  Having taken it home, I realize that I am more than getting my money's worth.  I am honestly concerned about answering any questions you may have.  I wish I could ask people questions before I buy things, so please feel free to comment and/or ask.  Best wishes.***Updated 4-6-08****For those interested in comparisons, I have recently compared the SX200IS vs the Panasonic TZ5 [...].  Unbelievable, I was able to find same scene shots taken by these two different cameras.  This is hard to find.  Plus, being that the TZ5 is really the main competitor to the SX200IS, it makes for an interesting comparison.  If you do review this website, particularly notice the \"city night shot\" and ISO 400 setting.  In my opinion, the SX200IS is much clearer and offers a more accurate picture.  Again, the SX200IS is a winner to me!***Updated 7-26-09***After 4 months of extensive use, this camera is now having power issues.  When the camera is turned on, and then turned off, it automatically turns on when I do not want it too! :  It will go back to be fixed.  So in terms of reliability, I am a little disappointed.  Nonetheless, given the quality and features of this camera, I will GLADLY keep the camera and GLADLY have it fixed.  Even with this electronic issue, it is still the best camera out there.", "Date": "April 3, 2009"}, {"Title": "Great overall digital Camera", "Author": "Eric \"Home Purchasing Agent\"", "ReviewID": "R3FJ1J7TQRNZ9V", "Overall": "5.0", "Content": "I received this before a weekend trip and it turned out to be a very well rounded camera. It's not as small as an Elph but it's still just small and light enough to carry around in your pocket or purse for easy access. The 12x zoom lens is terrific and in well lighted situations even the digital zoom creates clear, sharp pictures. The offset is that you lose the f2.8 aperture of other 3x camera's.I tried most of the scene settings and they all produce slightly different results. The AUTO setting uses a higher shutter speed and ISO setting than Portrait. In Program mode you can set the ISO setting to 80 or 100 and have the camera adjust the shutter speed. The foliage setting does enhance the greens. If you have enough light the indoor setting works better and uses a faster shutter speed while Night snapshot uses a slower shutter speed and produces a better overall shot in lower light. In all but the low light scenes the camera does tend to over expose the shot slightly so I ended up using the exposure adjustment at - 1/3 or -2/3's to compensate.I really liked the ability to adjust the settings to get a well exposed picture out of a range of situations that you can't always get with an Elph and the zoom lens allows you to frame a shot from just about any distance. The pictures are clear, bright and on par with other Canon camera's in it's class. There's plenty of features to play with like face detect and blink detect and the Image Stabilization works very well.If you are ready to step up from a point and shoot camera to one that provides more control, has a better zoom but is still pocketable the SX200 IS is well worth putting on your list to check out.", "Date": "March 31, 2009"}, {"Title": "I really like this one!", "Author": "E. Goldblatt \"Clearsky\"", "ReviewID": "R1EFHKPW1H3JWP", "Overall": "5.0", "Content": "Canon SX200Well - I read in another post that someone likes to try the latest camera - me too! Check out my other reviews as I'm always in the market for a P&S; that take at least 720HD Video. I've been using the Sony T500 and Canon G7 for most of my pic/vids until now! Since my last review, I've tried at least 6 other cameras and camcorders - all where returned for one reason or another; let's see - there's the: Samsung HZ10, Panasonic TZ5, Sanyo 1010, Leica D-Lux4, Leica Clux3, Sony CX12, various other cameras at the local store. I have great news! This new Canon SX200 will be my \"go to\" camera - at least until something better comes along (my trusted T500/G7 will be laid to rest). I'm giving it a 5 Star rating - is it perfect however! No, but for MY needs, it great.Pro's:1) Great picture quality - generally speaking indoor pictures are  pretty good, noise low on anything below 400ISO, comparable to my Canon G7, much better than my Sony T500, as good - if not better than my old Panasonic TZ5. Outdoor - outstanding - what you would expect from a Canon, sharp, clear, good color, nicely exposed. Have not fooled around with manual settings, but nice to have.2) I like the design and find it easy to hold (no slippage in my big fat fingers!). Other cameras make it easy for you to hold your finger over the mic or flash, but not here.3)  Flash - I do not mind the pop-up. No big deal for me! Works good too!4)  Menu's are pretty easy to navigate - no problem here.1) HD Video - I really like the quality of the video, nice wide screen playback on my 40\" Samsung HDTV and looks great on the desktop. Playback is easy and smooth, no problem. (not diggin' the digital zoom - see my cons). Codec actually works with my Windows Media Player without any hick-ups or wiggles. It's not perfect (like \"Sunrise Earth\" HD quality), but pretty nice for taking shots of the kids and grandkid, etc. Again, plays nice on the HDTV. Sound quality is only mono, but SOOOO much better than the Panasonic TZ5 (my deal breaker for the TZ5) it's no comparison. The Sony T500 beats them both for sound quality - it's stereo! Remember, during video you can NOT optically zoom this camera, but you can digitally zoom - it's not great, but will get you a little closer if you need.6) IS - works great7) Zoom nice and smooth - focus is fast and accurate.8) Battery - pretty good - seems to last me the day - I bought an extra just in case.9) Auto Focus works like a charm, even in low light - no problem here.10) Macro looks great - took some beautiful shots of flowers and roses in my backyard.11) Easy to carry around - not to big, not to small either - just right!12) Overall quality and \"feel\" is nice! Seems well built and should hold up to many outings with the kids and hiking around.Cons:1) No optical zoom with the Video. If this camera was able to optically zoom, it would be as good as it gets for a point and shoot with HD Video! Come on Canon - what's up with that!!!! Panasonic can do it -why can't you! Do you want your customers to jump ship when the new Panasonic TZ7 comes out??????? If SOMEONE could.......please, please, please, hack this and help me. Maybe Canon will do some kind of firmware update and allow optical zoom. I can put up with the motor noise of the zoom for this ability!!!!!!!! While you're at the firmware hack - if you could disable the flash pop-up that would be nice too!2) Indoor shots a bit soft, but just about all P&S;'s are, the SX200 is pretty darn good though.3) In the Auto mode, the camera automatically (hence \"auto\" mode) picks the setting it thinks it needs for the best shot. For example, if you real close to an object, it will automatically switch to Macro, then turn back to other modes if you take another shot - this process takes a little time (maybe a second or two) to switch. I do not mind because that is what is supposed to do, it just takes a \"learning curve\" understand what is happening.Anyway, these are just the things that really stand out. Of course there are other functions that I really like and others that I will rarely use.Just one camera geeks opinion, I've read the above folks comments and agree with some, disagree with others. Each piece of tech has it's quirks (like the flash popping up when the camera is on; or it feels slippery; or whatever). It's hard to try something new, but with all of the cameras I've tried, I can tell within a few shots (I have my test shots all picked out for comparisons) if I'm going to like it or not. The SX200 was the first in long time that kept me inetested, testing, and ultimately claim this one as a keeper! Interested in your opinion - just me nice!!!! Oh, and one more thing - PLEASE don't tell me to go and get a DSLR and a dedicated HD Camcorder - been there, done that!", "Date": "April 2, 2009"}, {"Title": "Bought a Panasonic ZS3, returned it for a Canon SX200", "Author": "Firelock1776", "ReviewID": "R2LA84ULW4NDJM", "Overall": "5.0", "Content": "I have been a Canon shooter for many years, both DSLRs and point and shoots. I own a Canon G7 for personal use and have been extremely happy with it, but I am tired of having to add attachments for wide angle and telephoto photography. I also wanted a camera that is small enough to put in a jacket or shirt pocket easily. I decided that of the cameras currently on the market, either the Panasonic Lumix ZS3 or Canon SX200 seemed to be what I was looking for. I researched the product thoroughly and chose the Lumix ZS3 based on multiple reviews that gave that camera the nod over the SX200. (Specifications-wise, these cameras are near twins.)After several days of testing the ZS3 I was unhappy with it. The camera had poor low-light performance, a weak flash, and bad color balance and contrast. (See my review of that camera on its Amazon product page.) I returned it and bought an SX200. This camera is a gem. The quality of the photos are what I was expecting from a camera in this price range (better given how much cheaper it is than a ZS3). The zoom is very fast which allows you to focus on the action quickly and get the shot you are looking for. (The zoom on the ZS3 is slow in comparison.)The camera performs well in low light--much better than the ZS3. There is very little noise and Canon's optical stabilization allows for lower ISO and shutter speeds. The SX200 has a powerful flash that illuminates the subject very well and at a good distance. I am sure part of the reason for this is the much maligned pop-flash, as this helps the flash clear the large lens barrel. Also, the fact the flash pops up when not in use is something that I barely notice. (Sure, it would be nice if it didn't.) The overall quality in low light will not compare to a DSLR, but that is to be expected.I will say that, like my G7, this camera seems to struggle a little in very bright outdoor conditions. Specifically, highlights have a tendency to get blown out if you are not careful. Even when using the exposure compensation this can still be problematic. However, the day has to be VERY bright for this to be a problem. Also, this is where Canon's variety of shooting modes helps, as using the Shutter Priority mode has helped me in this situation to get good results.The build quality of this camera is excellent. The physical controls are very well-done, and the on-camera software is first rate and much better than the ZS3. The Canon software is not only easier to use and has more controls, but it just looks better with excellent fonts and translucent menus.The color saturation and white balance are excellent, and the different shooting modes (program mode, aperture mode, manual, etc.) give the photographer a wide range of options that are not available on the ZS3. I use these modes probably more than half the time.I almost gave the camera four stars on the account of it not having optical zoom in video, but at this price point and given all the other excellent features of the camera (wide angle, 12x zoom, excellent software, etc.) I don't think that would be fair. The HD video is of excellent quality, though I have to give the nod to the ZS3 on the video overall.The only other negatives are the door to access the data ports, which has a flimsy plastic hinge, and the lack of a \"super fine\" quality mode for the jpegs like they had on my G7. (I really wish they would include RAW, but I know they reserve that for their high-end cameras.)Summary:Pros:Excellent physical qualityExcellent on-camera softwareGood low light performancePowerful flashGood HD videoExcellent color balance and contrastVariety of shooting modes and manual controlsCons:No optical zoom in videoFlimsy hinge on the data ports doorLack of super fine quality modeTendency for overexposure in highlights on very bright daysOverall, an excellent buy especially for the price.", "Date": "June 29, 2009"}, {"Title": "Mixed Bag: Not for beginning point and shoot users", "Author": "Jonathan High \"jonhigh4\"", "ReviewID": "R38EPP9PSE6NIC", "Overall": "3.0", "Content": "UPDATEA lot of people are comparing this to the Panasonic DMC-ZS3; I just bought one so I have both. After spending some time with each I've come to the conclusion that, despite the similarities, they are different camera for different audiences. Here's where each excels:PANASONIC* For a very powerful point-and-click / don't think about it camera, it can't be beat. The Intelligent Auto almost always takes great pictures under almost all conditions. The Canon Auto doesn't even come close and esp for indoor pictures you have to select specific scenes - or use manual controls - to get a good picture.* Video: True optical zoom + AVCHD video format support. IMHO the Canon's video really is toy-like without optical zoom.* Features: Here again the Panasonic runs circles around the Canon:- Much faster burst mode- Takes 3 aspect ratios at once (e.g Normal + Wide Angle)- Twice as many scene modes- Focus locking (e.g. a moving animal)CANON* Manual Camera Controls: (e.g. ISO settings) I honestly have never used these before, but I'm disappointed the Panasonic doesn't include any, as I'd like to start to learn more about them. I can see how this is a big omission if you're a semi-professional photographer.PICTURE QUALITY* Auto Point-and-Shoot: Panasonic. I've taken pictures with high motion, low-light conditions, etc. I never thought possible (for me). If you know very little about ISO, etc. This is the camera for you.* Manual and Best Possible Pictures: Looking at a LOT of samples, it's clear the Canon has a slight edge over the Panasonic here. I'm sure this is because Auto still can't quite take a picture the way a professional photographer would. I've always always been very partial to Canon cameras (until now) because they do seem to have the best picture quality, and the samples I've seen seem to show this is still true.Realistically though, most of use won't take the time to adjust manual controls for every picture - in which case I'm confident the Panasonic will often take better pictures than the Canon (esp indoors or low-light conditions).So overall, even after owning maybe 5 canons over the years, I'd recommend the Panasonc hands-down, with one exception:If you're looking to learn more about professional photography and manual camera setting - but not ready for a real professional camera yet, the Canon might be a really good place to start, as the Panasonic doesn't have these.I'm keeping both - but thee Panasonic will be the one I use 95% of the time.*** INITIAL REVIEW ***I've owned a half-dozen Cannon digital cameras over the years, this is the first one I'm not entirely impressed with.PROS* The 12x optical zoom* Wide angle pictures* HD video recording (digital zoom only)* New features: Blink detection, etc.CONS* Auto Mode: Maybe I have a faulty camera; if not Auto mode is useless for indoor photos. Auto mode seems VERY aggressive with setting the shutter speed, etc. The problem with this is its settings usually mean you have to hold the camera rock-steady or you'll get very blurry pictures.Also (with Auto Mode) indoor pictures are soft, include lots of noise, and the colors are off.Doing some experimenting, you can get around these problems by switching to another picture mode, like Indoor. But, IMHO that defeats the entire purpose of Auto Mode. Yes, it's a simple turn of a dial to get the right mode - but I think even that disqualifies this as a true \"point and shoot\" camera.I think this would be a good camera for people who want more control over their photos - without having to be a professional photographer. But I can't recommend it for someone who just wants to push a button to take a picture.", "Date": "April 15, 2009"}, {"Title": "Avoid AUTO and \"EASY\" modes", "Author": "Spinner's End", "ReviewID": "REK8WQJ6O9G8L", "Overall": "5.0", "Content": "I almost sent this camera back.  The shots were SO \"noisy.\"  I was shocked that a Canon camera at this price point could produce such lousy photos, when the Canon point and shoot camera I bought for $199 about a year ago takes great shots.Then I read the manual (go ye, therefore, and do likewise!)  and the reviews, and started taking the breath-taking shots I expected from a Canon 12 MP camera with 12 x OIS.  The secret:  DO NOT SHOOT IN AUTO OR \"EASY\" MODE!  The ISO setting is too high, resulting in \"noisy\" photos.  I am an experienced digital photographer, but when I'm taking snapshots of my daughter running and playing, I like to shoot in AUTO.  I now shoot in PROGRAM mode much of the time, specifying the ISO setting I wanted, and let the camera do the rest.  The scene, kids & pets, indoor, and portrait settings work well, as with other Canon models.The only complaint I have about the camera, other than the useless AUTO and \"EASY\" modes, is that the access door for the HDMI and USB ports is flimsily constructed and attached.Many reviewers dislike  the pop-up flash, but I prefer it.  It cannot break, even if you have your finger on the panel when you turn on the camera.  It was designed for the user to be able to hold/push it down when flash is not desired.  Having a pop-up flash, rather than one in the body of the camera, reduces red-eye, to some degree.  The lens barrel extends 1.875\" at 12x optical zoom, so the flash  probably had to be moved up to avoid a shadow when zooming.The movie mode is the best I've seen in a still camera, but the footage does not look like HD to me.  The footage looks pretty good on my computer display in a large QuickTime window, but is not good enough for a larger screen (TV).  It would be perfect for shooting YouTube footage, or anything you intend to share on the web.  For everything else, I'll continue to use my Canon HD video camera that shoots in 1080i.  I didn't buy this camera for the video shooting capability, so that it shoots decent (though not HD) video is a bonus for me.This is a well-rounded point-and-shoot camera with a BIG, HONKIN' LENS, fantastic zoom and resolution, well organized menus, and lots of useful features.  The MACRO (which works well in AUTO, oddly enough) is DREAMY.  Shooting in full MANUAL, or shutter and aperture priority, yields predictably wonderful results.  I recommend the SX200IS to anyone who is looking for a full-featured point-and-shoot camera, and is comfortable shooting in any mode but AUTO.", "Date": "June 18, 2009"}, {"Title": "A new Powershot - with GREAT capabilities.", "Author": "Tarun Chachra \"Tarun Chachra\"", "ReviewID": "R2O9LYDQVRF4K4", "Overall": "4.0", "Content": "HI All,First off, let me start by saying that I am a Canon fan-boy.  I love their product lines in the point and shoot category.  I have owned several Canon Powershots and this is my newest acquisition.Basics:Whats in the Box:CameraHand StrapBatteryChargerUSB CableAnalog Video CableDocumentationCanon Software version 46Whats NOT in the Box and Should be:Mini-HDMI to HDMI CableSample Memory CardONLY GRIPE:The NOT portion above automatically pulls this review down to a 4 star.  Why? Because if you are going to put a mini-hdmi port on your camera...you should include the cable.  Even CREATIVE includes a mini-hdmi to hdmi cable with their Vado Video Cam.  Come on CANON!  And no memory card to start playing out of the box..whats up with that?  $349 for this camera would surely be able to give Canon enough to throw in a memory card..and cable.  Enough Gripes...now on to the good stuff.PROS:I love the look of this camera.  Take a look at the images I have attached and ascertain for yourself.  Canon has refined the lines on their power-shots so much so that they look like professional cameras.From the time you press the power button to the time you take your first shot is about 1 second...which to me is pretty fast.  Turning the camera off takes an extra second or so because it has to put the flash back down and bring the lens in.The zoom (12x optical zoom) is amazingly fast when compared to other cameras (Lumix TZ5) that have a lens that is about this size.  When the optical zoom runs out, it does get a bit slow on the digital zoom...but that is to be expected on all cameras.  I timed about 1.6 seconds from wide-angle to telephoto at full speed.  It moves faster as you put more pressure on the switch.  The range is 28-336mm.  NOTE: One of the cons here is that this amazing zoom can not be used for Video shooting.A fully charged battery should give you about 280-300 shots depending on conditions, flash usage, light compensation, etc.The face self-timer option lets you be in a photo, without having to sprint across the room while the self-timer counts down. The camera will simply wait until any other face is detected, and it will take 3 shots in 2 seconds.The custom self-timer option lets you select both the time you need and how many pictures you want to take.  Awesome feature.The Optical Image Stabilization is awesome and works really well.The LCD (which is an issue on most cameras for bright outdoors) is amazingly bright and high quality.  It is easy to see what you are shooting indoors under heavy lighting and outdoors.One of the few cameras in its class that allows you to use it in FULL Manual mode...although it does not save files in RAW format.HD video at 1280 x 720 (720p) at 30 frames/second, with mono sound in h.264 format...which means more video due to higher compression.Amazing automatic red-eye removal....tested on my daughter with eyes that will put any cameras red-eye feature to shame.  We finally dont have to do any post editing on her eyes.  YEAH!!!I will be getting in to photo related details once I have had more time to experiment with the different shooting environments.  So far I can see that this camera shines in bright light but seems to have some noise that causes detail loss over iso 200 in low light.  Keep checking on this review for updates.Cons:Again, no included memory.No HDMI cable.Battery Life could be better (not a deal breaker).Flash takes a bit of time to charge after firing.Optical zoom not usable in video mode (my lumix tz5 allows it)Low light performance is lack luster..there is some detail loss.As I mentioned above..this review is a work in progress and I will be updating it regularly as my experiences with this camera increase.  Please ask any and all questions via the commenting system here and I will answer them to the best of my abilities..  Thanks and I hope this review is informative.", "Date": "April 3, 2009"}, {"Title": "This thing is awesome...", "Author": "Amazon Customer \"tpanek\"", "ReviewID": "R1MLRO7Y939VPD", "Overall": "5.0", "Content": "I read all the reviews of this camera here on Amazon, as well as seeking out photography websites looking for recommendations for the best small point and shoot camera. Despite a few bad reviews here, everything else I saw was pretty positive, so I decided to go for it. I am SOOOOO glad I did.From the moment it came out of the box, it was love at first site.The display is large and clear and crisp.The photos is takes are wonderful. I have seen low reviews talking about \"noise\" and \"blurriness\" and the only thing I can guess is that these people never took 5 minutes to figure out how to USE the camera. Set to the indoor setting, pictures taken inside are clear, crisp and brilliant. No noise. If you use the Kids&Pets; mode, motion shots are almost always perfect and without blurriness. If you try and take every picture on \"Auto\" you are going to get a mixed bag of shots on ANY camera, that is why the camera comes with different settings.I've also seen complaints about where the flash is and how hard the camera is to hold. It is true that when turning the camera on, the flash has bumped my finger a few times. But this is hardly a deal breaker. So it bumps you - it isn't as though it is causing injury to the camera or to you, for goodness sake!!!! So it bumps you and you move your finger - big deal! I cannot fathom why anyone would care about this. As far as being hard to hold, maybe if you had the hands of a 7 ft NBA player or a 350lb lineman, it might be a bit small in your hands and hard to handle - but so would ANY small camera. But both my husband and myself have had no issues holding on to it. If you are worried for some reason, that is what the camera strap is there for. Personally, I love the fact that it EASILY slips into a pocket so I don't walk around looking like a tourist, or have my hands full of camera while I want to be site-seeing.The function section of this camera (SCN) is SUPER fun. You can take pictures where you turn everything in the photo black & white except selected color(s). This yields some AWESOME artsy shots with no effort (seriously, take pictures in candlight, where the color of the candle light is the only color - AMAZING!!!!). You can also swap colors to take wacky, fun photos.  People will think you are a photography genius, and all you did was point and click.  There is also a straight B&W; mode, and sepia mode, like most cameras.All in all, I CANNOT imagine having chosen any other camera.", "Date": "October 13, 2009"}, {"Title": "Excellent SLR replacement/backup", "Author": "M. Chesner \"Nomad of Mod-Blog\"", "ReviewID": "R3JFK2DH52386M", "Overall": "5.0", "Content": "The Short Version: I love this camera. While it has a few clear weaknesses, it more than makes up for them in quality, ability, and manual controls.Background: I am a photography enthusiast. Not the kind who stalks around taking random pictures of strangers, or who wanders the forest looking for interesting plants. The kind who enjoys taking pictures at events: quiz meets, softball games, weddings, etc. to share with friends. I own a Canon EOS 50D (digital SLR) but also like to have a smaller point-and-shoot for travel or situations where the \"snap-click\" noise of an SLR is unacceptable. My last point-and-shoot had proved bad for the lower-light situations where I tend to shoot, and a wedding was coming up that I wanted to cover. In the past, I had always gone for ultra-compacts but this time around I wanted something that could handle both low-light and long zooms while still being pocketable. I tried an Olympus Stylus 9000 (returned due to impossibility of focusing reliably and blur indoors) and researched the Panasonic Lumix DMC-ZS3. But in the end, I chose the Canon Powershot SX200 IS and purchased it from Amazon.Com.The Good: This camera is a joy to use. It has an automatic mode, a \"super-easy\" mode, 5 scene modes, a dedicated \"special scenes\" mode with less-used options, video, full manual, aperture priority, shutter priority, and Program mode, like an SLR. Unlike the competition, the camera has nearly as much customizability as an SLR and the controls are fairly easy to use due to a new menu structure for Canon camera. The pictures are clear, crisp, and has relatively low noise even down to 1600 and 3200, when compared to other point-and-shoot models. The SDHC card slot will accommodate even the largest 32 GB models of memory card (yes, I tested with one those those) and saving to card is quick. The 3.0\" LCD on the back is also clear and crisp. And I love the \"selective desaturization\" mode in the camera. And how do you beat 12x zoom (28 to 300mm equivalent lens) in this size package?!The Bad: The camera is not perfect. First, while very pocketable, it is not an ultra-compact - it is about as long as an iPhone but 4 to 5 times as thick and it is has definite heft in your hand and pocket. Second, time from shot to shot is not quick, even in \"burst\" mode, sometimes taking a full second or 2 to recycle between shots. Third, battery is life is only moderate - over the course of a wedding and reception (about 8 hours) I went through 3 fully-charged batteries, and the batteries themselves take over 2 hours to recharge. Finally, when zoomed to the extreme, the camera often finds it hard to find a focal point and may vacillate between two of them, forcing you to let go of the shutter and recompose the shot. This lead me to lose a few really critical photographs.The Bottom Line: This camera is a keeper, but you'll want to keep your SLR for the most important or challenging occasions. The 12x zoom is great for getting in close or finding a good wide-angle option. It is pocketable, has a plethora of manual options to allow you to get the best shot, has several really fun auto options, and comes in at under $400 even at the expensive shops. How much did I like this camera? Let's just say that I am now one of 3 friends who all own the Canon PowerShot SX200 IS.", "Date": "May 20, 2009"}, {"Title": "Great first impression- really a 5 star camera!", "Author": "S. Beverly", "ReviewID": "R2AEN083N5P9RV", "Overall": "4.0", "Content": "I purchased the Canon Powershot SX200IS after much research on the web. I have been looking for a small camera that I can carry with me everyday: I'm doing the Project 365. I would still like my shots to be better than ones I take with my smaller point and shoot or my cell phone. I discovered these wide angle/ultra zoom small cameras and have been debating back and forth about a few of them. My choices boiled down to this one and the Panasonic Lumix DMC-TZ5. While the Panisonic has some great features, like the optical zoom in video mode with stereo sound, I decided that I was mainly buying the camera to take still shots and the Canon seems like a camera I can grow with as my photographic abilities increase. The Panisonic has no Manual settings, but the Canon has everything from Easy mode that just lets you take shots and chose whether you want the flash or not, to full manual. I first ordered the Canon from the lowest price website online and they gave me a run around including trying to sell me more stuff that I didn't need and extended warranty. As long as I was willing to buy one of their package deals, they had one in stock, but when I declined all the extra stuff they put me on backorder. I finally canceled the order and went to another discount site that looked like it had it in stock. After I ordered it my order showed up as backorder and that went on for a month. I called twice and was told two different dates, both not acceptable to me so I canceled that order too. I ordered it from Amazon yesterday and had it in my hot little hands today, less than 24 hrs later. Great service! It all boils down to you get what you pay for.As far as the quality of the camera is concerned, it is a little larger than my old iPod, but I like the heft of it; It feels substantial. It's going to take a little getting used to the power on button being on the left side of the camera; it feels better to me to turn it on with my left hand. I'm used to a camera with a grip area on the right side so I am going to make sure I use the strap as I am afraid I will drop it. The door for the battery and media card feels substantial as does the flash. The door where you hook up the cables feels a little flimsy though.I started playing with it the moment it arrived and, I have to admit that I had to check manual to get the hang of some of the features, like turning on the IS feature. (My husband was shocked! lol) It's not visible in all modes. I am pretty savvy when it comes to figuring out techy stuff, but this has allot of different features to delve into. I will read the manual all the way through though so I don't miss any of the cool features like doing some actual editing (cropping, red eye removal (not on pets!) and rotation). It even rotates the photos in playback mode when you turn the camera from horizontal to vertical.Overall I am very satisfied with the camera and look forward to many years of learning how to take better and better shots with this baby. I'm very impressed with the results I've gotten and, in the automatic mode, the camera senses what your subject is and chooses the appropriate mode to shoot in and it is very good at that. (See a shot of some glasses I have in a garden window. The room was pretty dark, but the camera compensated for all the light coming from the window. I was very impressed.) It's small enough to carry with me in my purse so I don't miss those important shots and it will be a great little camera to take on vacation with me. I love the 28-336mm lens and the fact that there's no lens cap to fiddle with or lose. I have taken some super macro shots (0-.79in) and they are amazing. I will post some soon.The camera fires up very fast so you won't miss your shots; seemed like less than a second from pushing the power button to ready to shoot.I thought I might be bothered by only having the display screen but it is very easy to see in bright light. It automatically adjusts for night viewing. I also understand that the screen is scratch-protected.One fun little thing I discovered is that you can display the time alone on the screen by holding down the FuncSet button and pressing the power button. This might be good if I need to check out what time it is; us retired folk don't have to wear watches anymore! =)One other thing I did was to get the 1300mAh battery and a 16 gig SDHD card which gives me about 5000 shots. It does not come with any media card.All in all, this is a great camera to learn on. It even has a hints and tips mode that you can turn on and off and, if your shot is overexposed, the whiter areas of your photo \"flash\" during playback so you could retake the shot if you want. I plan to update this review as I learn more and add more photos. I think this camera is a great value for the money. Good hunting and best wishes.7-4-09 - after having this camera for awhile, I tried to upgrade my star rating to 5 stars but the Amazon edit mode won't let me do this. I love this camera. And it's small enough to have with me all the time so I don't miss photo opportunities. The more I use it the more impressed I am. You can't go wrong!", "Date": "May 1, 2009"}, {"Title": "Love this camera!", "Author": "M. Herrin", "ReviewID": "RP1OBKH4DVIO7", "Overall": "5.0", "Content": "This camera does everything I hoped it would do. I have a smaller Canon and DH has an SLR Canon. I wanted something for travel sized between the two that would take better pictures in low light and would zoom. I returned from Europe with wonderful pictures at night with no flash (had to prop to prevent shaking but the camera warned me). beautiful pictures of interiors where the camera seemed to create light, and a decent shot of Notre Dame Cathedral zoomed from the second floor of the Eiffel Tower.  I knew the optical zoom was 12X but did not realize digital zoom goes up to 48X - what fun!  The pop-up flash does not bother me at all. If you happen to have your finger on it (doesn't happen often) it just waits until you move your finger to pop up.  I got great videos of the traffic in Paris and Rome - the video does zoom digitally - why all the complaints? I am not a professional but returned with over 5GB of photos and love them all.  I don't understand complaints about quality and battery life was always adequate for a full day. I charged each night. Love, love love!", "Date": "July 31, 2009"}, {"Title": "Lens Error, Restart Camera", "Author": "A. Cantu", "ReviewID": "R36DNBDZRBVDNS", "Overall": "1.0", "Content": "After only 5 months my this camera has quit working for me. I'm getting the now infamous \"Lens Error, Restart Camera\" message and apparently there is nothing Canon will do about it. I checked online to see if I might be able to fix the problem myself but all I found were other disgruntled buyers with the same issue. Very sad indeed. Anyway, just thought I would share this with everyone who was thinking of buying this camera. Please call Canon and ask them what you should do if you get this error message, there answer might be the best indicator as to whether you should buy this camera or not.", "Date": "March 4, 2010"}, {"Title": "Terriffic Zoom - Great Bird Photos", "Author": "Michael McKee \"mystic cowboy\"", "ReviewID": "R2X9B8L4A74UUZ", "Overall": "5.0", "Content": "The best camera is the one you have with you. I walk either on the shore or in the woods every day and am a passionate if novice birder. I've used this Canon to capture images of birds that I couldn't identify in the field. The long zoom is amazing, especially with the image stabilization. This camera is small and light enough to slip in my vest or coat pocket and as such has become my constant companion.The images it takes are good. I've compared it against my SLR a Pentax K20D. In good light its images stack up well against the jpegs shot with my SLR's kit lens, though they aren't as sharp as as those I take with my better lenses. This doesn't do RAW files to compare to, which are always richer in image information. In lower light and at higher ISOs the difference between this and the SLR becomes major, which is typical of a point and shoot. This is not a great low light camera, but that's not why I bought it. To further emphasize that, point please understand that the flash is pretty anemic. But that's not what I bought this for. Look at the Panasonic Lumix DMC-ZS3, which should be out soon for better indoor capability. It has a better flash and somewhat better low ISO performance.In daylight, even under medium overcast this PowerShot does a great job. I especially like the manual exposure and focus capabilities this camera has. The Panasonic against which this model is pitted is brilliant at auto exposure, still there are times when I want full manual control and this gives it.I'm new a movie taking so can't really compare the abilities against dedicated movie cameras. I do love the fact that I can simply push a button and start taking a clip. Yesterday a bald eagle fought the heavy wind about 100 ft overhead and I got a great 2 minute movie of it struggling with gusts. Of course the microphone picked up the heavy wind sound but it doesn't seem to in more normal weather. The movies imported directly into FinalCut Express for editing. They're taken with the h.264 codec, which I've found in other circumstances gives good quality at comparatively small file size. That seems to be the case here as well. It also takes HD movies. Since my we got a widescreen TV, my wife only wants to watch wide screen video. That's covered with this camera.For good light and where you'd want a high power zoom as well as pretty good wide angle, say landscape, wildlife or stree photography, I wholeheartedly recommend this camera.", "Date": "April 2, 2009"}, {"Title": "Excellent camera with little or no cons", "Author": "B. Norris", "ReviewID": "R1R8KSRIYHUIGD", "Overall": "5.0", "Content": "First of all, the HDMI a/v door has been said to be flimsy and cheap by many. The door is plastic and it moves around and is on a rubber hinge. This is specifically designed that way. It is not an oversight by Cannon. It is a protective feature that allow you to plug and un-plug your cable using your fat fingers without damaging the door or hinge, which is bad. If the door or hinge bends, the door does not close and dust settles in. Pretty smart of Cannon huh?Night shots and low light pics are great. Many reviews state otherwise but it is not Cannon's fault if someone does not know how to operate or adjust the camera to appropriate settings when taking these shots. IF you only use easy or Auto for every pic, you wasted a great deal of money on this camera when you could have bought a more simple point and shoot without all the options and settings for half the price.Camera is compact and can fit in my pocket but I wear baggy pants. IF you wear these slim pants people wear tody, no way will it fit in your pocket. This is not really a pocket camera (like the Elphs) but for the amout of optical zoom, it is quite small. Compared to the ELPHS, it is probably 0.5 inches thicker and 1 inch wider.It is somewhat heavy but not anything that will be bothersome or affect pics; remember there is a big lens in this camera. Probably extends 3 inches.Video is great and has 4x zoom. However, quality diminishes with zoom. Appears to be a digital zoom in video mode.I have a Cannon HG 20 so the video was a deciding factor for me but if it is for you, check out zoom quality before you purchase.Another cons I have seen on multiple reviews is the placement of the flash. The flash is located where some would place their left index finger (on top of the camera, but fortuantely Cannon thought of that (despite the reviews) and the flash pops out and the moves forward so 75% of the top of the camera, where some would place thier finger, is still available. I am one of those people and there are no issues at all with the place ment of the flash: even if you want to put your finger on the front of the camera.", "Date": "May 7, 2009"}, {"Title": "I Bought Both the Canon SX200IS and the Panasonic ZS3", "Author": "DDorm", "ReviewID": "R33M5JZLNV05ZG", "Overall": "3.0", "Content": "Overall, I was happier with the Panasonic ZS3 and I returned the Canon SX200.  Historically, I have really enjoyed Canon camera's and have been very satisfied with my S3 IS over the years.  In fact, I think my S3 IS takes better pictures and video than the new SX200, but the SX 200 IS smaller.  I don't consider myself loyal to Canon or Panasonic.  For me, it all boils down to ease of use and print quality as I actually print 4x6 pictures on my Epson photo printer.I agree with the other reviews that the Canon is probably capable of taking good pictures by tweaking the settings, but I needed a camera that I could quickly hand off to a family member or friend and have a reasonable chance of getting a good picture.  I don't understand why the Canon, in Auto mode, raises the ISO to 800 and uses the flash for an indoor picture. It seems unnecessary to me.  Overall, I thought the indoor pics were not up to par with the ZS3.  The Canon outdoor pictures were fair but not better than the ZS3.  I also found the pop up flash on the SX200 to be a neat concept but in the end, annoying.  I kept hitting it with my fingers.  I think the build quality of the SX200 is good but so is the ZS3 and ZS3 is built in Japan.  Good luck!", "Date": "May 1, 2009"}, {"Title": "Seriously Flawed camera", "Author": "Walter Timpone", "ReviewID": "RQF0RLWCPJLTP", "Overall": "1.0", "Content": "When this camera works, it works beautifully.  But......I have had two and both suffered from the same flaw:  after some use the lens jams (sometimes opened and sometimes closed) and the camera becomes inoperable.  I sent the first one back to Amazon and received a replacement; the second one malfunctioned after the return period expired so now it has to be sent to an authorized repair center that I have yet to find.  I can understand this happening once but twice on two separate cameras indicates a design flaw, making it a camera to avoid.", "Date": "August 22, 2009"}, {"Title": "WORST PURCHASE EVER!!!!", "Author": "H. Anderson \"H Anderson\"", "ReviewID": "RFUPNF5DJTQ2V", "Overall": "1.0", "Content": "BEWARE of the Powershot SX200!!!I bought one and it got a lens error 28 days after purchase.  Returned it and got another one.  It got a lens error 65 days after purchase.  And now they want me to pay $130 to fix it.  Plus I had to spend hours to find out what was wrong with my camera, pay shipping because it was still under warranty only then to find out that they wanted to charge.  No phone call.  No email.  Nothing.  I had to track them down.  Canons have changed and there customer service has too.Waste of time and money.We were so careful with the second one - afraid it broke because of  human error.  But no they are LEMONS.  UNRELIABLE.I had only ever bought canon cameras - a number of them and even for gifts.  Never again.  Canon's customer service was so RUDE and was put on hold for extended periods.  Completely turned me off canons forever.", "Date": "December 21, 2009"}, {"Title": "good but could be better", "Author": "Ervin \"Ervin\"", "ReviewID": "R1DRP0C5C6WEOS", "Overall": "4.0", "Content": "just got this after reading some of the reviews.  here's what i think.  picture quality it good, even at iso400 like all the other reviewers said but it is still a point and shoot, so don't expect slr type of lens speed.pros:-great zoom 12x-great video quality (no optical zoom but it has digital)-manual control, for a compact which is great!cons:-flash pops up (this doesn't bother me as much but it is annoying)-compact size but longer...from the picture it looks to be a good size but it is a bit longer (width) and thicker than i would like.all in all, a good compact (not sub-compact) with manual controls and good picture quality.  i've had nikon cameras all my life and this is my first canon (i know, i know), the only reason i didn't get a nikon is because they don't have a decent super-zoom compact, there's the p6000 but...lots of issues with that.  anyways, nice camera!", "Date": "April 6, 2009"}, {"Title": "Love the Zoom on the Canon PowerShot", "Author": "K. Moe", "ReviewID": "R2NADLALQYA8K6", "Overall": "5.0", "Content": "I took my new camera for a 4-day visit to So. Africa's Kruger National Park, and was exceptionally pleased. Being a Canon fan, learning the features was pretty straight-forward. The camera feels good in my hand and I liked the color more than I thought (all my others were silver or black). I liked the direct dial to the camera modes (over the menu); the compact size for a 12x zoom is great; the zoom is awesome for such a small package, however it went from optical directly to digital and I prefer to do digital adjustments on my computer. This is my first camera without a view finder and it took getting used to it. The 3 inch screen is nice and bright, although a bit challenging in brilliant sunlight. I am quite happy with the image quality, probably due to image stabilization, but I also used the kids/pets mode for animals in motion. The colors are crisp and clear. The flash, as reported, is only effective for subjects pretty close in, well under 10 feet. I didn't try the low light feature as I didn't have a tripod. I'm really glad I purchased a back up battery (the Lenmar DLC5L equivalent to NB-5L) as it was usually mid day when it went out; either battery lasted about a day and a half of constant on-off, a lot of flash and only a little video. I got the Transcend 8 GB SDHC Class 6 flash memory card which was plenty for my trip. I'm very happy with my purchases and highly recommend this camera for those who like to zoom and frame their photos.", "Date": "November 7, 2009"}, {"Title": "Amazing!", "Author": "Shari Halliburton \"rosebud\"", "ReviewID": "R18S2MOQQC6H5Q", "Overall": "5.0", "Content": "You won't find a lot of technical terms in my review.  I'm a mom who wanted a great camera for photos of my kids, of landscape scenes, and to capture special moments.  I, like most, did quite a bit of research on cameras prior to this purchase.  I had been very happy with my old Canon Powershot S500 that has lasted me for 5-6 years and was partial to the Canon brand.  That didn't stop me from checking out other brands, however.  I looked closely at every camera that offered an increased zoom in the $150-$350 range.  My main goal was to find a camera with a great zoom.  I'm no professional with the camera and really don't need a lot of fancy extras.  I know enough to take some good pictures in various lighting settings, but I can do without a digital SLR and prefer to do so.  I initally was led to the Canon SX 110 IS, again mainly due to the zoom and the Canon name.  The more I looked at it the more I realized I didn't want the clunkiness of it.  I do a lot of hiking and I'm a mom who likes to carry a small purse, so I wanted something easy to tote.  I began my search again looking for a camera that had that portability factor as well as the mega-zoom.  I finally found it in this camera.I have had the camera less than a month and have already been amazed at the photos I have been able to produce.  Even in low light settings the pictures come out clear and sharp.  I was able to take some great shots of my daughter on stage from a dark audience at well over 60 feet away.  I had a man behind me ask what type of camera I was using because he was so impressed with the shots he had seen on my camera that he was going to run out that night and buy one!  I also like the fact that this camera uses a rechargeable lithium-ion battery.  I didn't like the idea of going through dozens of regular  AA batteries, regardless of how convenient they are.  That was another factor in me not purchasing the SX 100 IS.  I did buy an extra battery for this camera, just in case, and would highly recommend doing so. I also ended up with a 16 GB memory card...much more than necessary but again, peace of mind.  It is well worth the time to read the manual for this camera.  You will find that the added features are quite simple, but I have to say the auto mode takes incredible photos.All in all, this is one smart camera.  The zoom is simply amazing and the stabilization allows clear, sharp pictures to come through.  The face detection is a great features that works well in action shots.  The huge 3 inch LCD screen will ensure you get a fabulous shot.  I was one who used to depend on a view finder and it has taken me some time to get used to not having one, but this large screen does help.  The pop-up flash does take some getting used to as well, but I have yet to find it awkward or uncomfortable in any way.I am not one to use a camera for video features.  We have a great Sony camcorder that we use for that purpose soley, so I can't be fair in reviewing that feature.I think this camera would serve a wide range of photographers.  The ease of use and the quality delivered by Canon ensure that regardless of your purpose, the pictures will come out fantastic, which is the ultimate goal of any of us.", "Date": "June 7, 2009"}, {"Title": "Broke in 39 days", "Author": "Michael \"tardog\"", "ReviewID": "R38T25IPFOPFI3", "Overall": "1.0", "Content": "I bought this camera December 15 2009.January 21, 2010 the automatic lens cover malfuntioned. Cannon will not cover under warranty- Wants $ 160 for repair. Says it was broken due to \"mishandling\". It was kept in a padded case, never dropped.It failed due to faulty workmanship or design.I have had good cannon products in the past. This is not one of them.I am also surprised at their response.", "Date": "February 1, 2010"}, {"Title": "Great pictures in a compact size camera", "Author": "CMB", "ReviewID": "RKOG6C7VI47XN", "Overall": "5.0", "Content": "For those having trouble with noise on indoor shots I recommend using the \"indoors\" setting.  This is very easily accessible on the dial and does yield significantly better results than \"auto\" or \"easy,\" so when my camera is just sitting around the house waiting for the dogs to do something cute that's where it's set (see exception below though RE: low indoor light).Macro is a little tougher to find (you have to be in the \"P\" mode on the dial or the foliage scene mode), and while the manual says you can't use zoom past the area that will show yellow in the zoom bar on the screen, in my experience you can't zoom at all in macro without blurring your shots.  But once you figure that out, the macro works great.The zoom is also outstanding.  I took a picture of a building across the river (approximately a half mile) and  I was able to magnify the image on my computer enough to read the lettering on the building before the image got too pixelated. Will try to post this.The only disappointing images I've had have been in low light using the indoors mode.  But I've gotten good results indoors in low light using the \"auto\" or \"easy\" modes. On the other hand, I've had outstanding results with backlit subjects.  I took a couple pictures of my husband and dogs outdoors with the sun behind them that came out great.  Then at a party I took several pictures of people sitting inside in front of windows; it was early evening in late May and still very bright outside.  Not only did all the people come out great, but in several pictures the scenery visible through the window also came out great, which I find pretty amazing.The pop-up flash does not bother me.This camera fixes everything I didn't like about the SX100 (which took great pictures but was too big and had very slow flash recycle).I've always loved Canon's unique feature that lets you customize the self-timer for multiple shots.  By setting it for 5 or 6 I always get at least 1 group shot where everyone looks good.", "Date": "May 23, 2009"}, {"Title": "Great Zoom", "Author": "Anav", "ReviewID": "R3RG99IUSGREON", "Overall": "5.0", "Content": "I sold my Canon G7 because its zoom lens was pretty poor once it moved into digital zoom mode.  The SX200IS has an optical zoom to 12x and takes very sharp photos even in the 10-12x range.  It's easy to use and can be used by novices (just set it on Auto mode) or by pretty advanced users (you can manually control almost every aspect of the camera).  The only new learning required for using this camera is to move your fingers off the pop-up flash at the top of the camera (not a big deal).  Definitely recommended for someone who doesn't want to lug a big camera but wants a lot of features and control.", "Date": "July 6, 2009"}, {"Title": "Quality and performance you'd expect from a Canon, despite quirky flash.", "Author": "Michael Pieracci", "ReviewID": "R3EYJEFF9GHYXC", "Overall": "4.0", "Content": "A few thoughts on the Canon SX200 IS:1. Flash always pops up on power-on: This has been the greatest criticism of this camera. The flash is in the way but perhaps not as obnoxious as many make it out to be. Once you use the camera you'll see why:* When you feel the flash and push it down you'll understand how Canon made the hinge mechanism. You can press the flash down any time, it won't break the camera or fall off, it'll just lightly snap into place.Place your finger over the flash, power-on, your finger won't feel any mechanism of the flash moving which suggests that it's not being pushed up but perhaps released. Remove your finger, flash pops up.* The camera knows when the flash is up or down. With the camera powered-on and the flash set to Auto, you can press the flash down and the on-screen indicator will change to Flash off.* Whenever I watch someone handle this camera they place their left index and thumb to hold the camera and unknowingly cover the flash. When they move their finger they say \"oh, there's the flash.\"* This smart mechanism seems the right compromise to this flash design. I hope a future firmware update will allow the user to choose the pop-up actions.2. On/Off button is too far left: It's unreachable by your right index finger when held in hand. Placing it closer to the shutter would make it easier to operate with one hand.3. Set flash to Off, it remains off after power-offs and ons. An excellent feature. Too bad the flash pops up each time.4. Extra auto features: Get close to something, it switches to macro automatically. Super-macro available as well under manual control. Face detection kicks in and follows faces nicely.5. Feels fine in one hand: Every camera requires time and technique to adapt to operation in one hand. Although the power button is not in an ideal place, this camera works well in one hand. Features such as the flash staying off and auto-macro enhance the usability.6. Picture quality, camera speed: Both are excellent and consistent with Canon quality.", "Date": "April 27, 2009"}, {"Title": "Accused of having PROFESSIONAL photos!", "Author": "Minnesota", "ReviewID": "RU6VIYSHBSUCH", "Overall": "5.0", "Content": "I was printing photos at home today on my canon selphy 760 (nice compact printer by the way), and decided I wanted to get some 5x7's and collages done.  I went online and ordered some prints from Walmart.  About a half hour after placing my order, I received a call from the photo lab at Walmart.  Curiosly I answered the phone and the lab lady told me should would NOT print my photos until I got a signed relase from the photographer's studio.  I said, \"What?\", \"Those are my photos I took with my own camera\", (actually my niece took them with my Canon SX200 IS of my wedding).  She was quite snippy and stated that she felt they looked like they are taken by a professional and was insisting that I sign a relase before I can have them printed.  At first I was mad. I explained to her they didn't need anybody's release, they were my photos taken with my camera.  After hanging up, I couldn't help but smile, these were photos taken at my wedding which my 15 year old niece took with my canon sx200!  I was so pleased.  My ex-husband and I just got re-married and decided not to spend money on professional photos this time (we had professional photos taken the first time we got marrried).  I have to admit I was worried that I should have spent the money and hire a photographer since it really was an important day for us.  I guess we didn't need to spend the extra money afterall.  I have 4 cameras including the canon S3IS, Canon SX200 IS (the camera we used for our photos), the Panasonic Lumix DMC FZ28 (which also takes high quality photos, just seems the SX200 takes more vivid photos), and the casio sx-12 (a ultra compact with nice but not exceptional photos).  These photos really do look professional and I had the camera set to auto mode so my niece wouldn't have any trouble.  This camera is awesome. I guess I got my professional looking photos (without the price).**I only used auto mode, and got wonderful results.  I can only imagine what results I can get if I play around with the settings.Before buying, I looked at cnet.com  [...]I love cnet.com, although I do feel 90% confident in the editors review, I understand that their reviews are based on a \"test\" for that item, and not everyday use.  I therefore place more value in the average users review, becuase these are the people who bought the camera and are using it to take their photos which can include different settings (inside, outside, weddings, sports, landscape photos, etc...).", "Date": "June 3, 2009"}, {"Title": "Over 2000 Pictures Taken", "Author": "David Heaston \"pinche cabron\"", "ReviewID": "R36A413TT526OF", "Overall": "5.0", "Content": "I have had the camera for about 2 1/2 weeks and this was the product I have been waiting for many years-compact size for traveling with a large zoom.  Since the camera has been released, I have read all the reviews I could find, including the comparisions to the Panasonic. Although most of the professional reviews rated the Panasonic higher, I decided to stick with Canon because of the following-I have owned 4 Canon Elphs, Canon has been in the business of making cameras for many years and I don't really care about video.Many have complained about the pop-up flash.  At first, I was somewhat irritated about the flash being extended all the time, but after after a few days I hardly even notice it anymore.  In fact, many times my finger prevented the flash from operating and did nothing to change the quality of the photos I took(in properly lighted situations).I have used all the possible picture modes with the exception of \"Easy\" and the camera performs flawlessly for me. I live on the beach in Florida and have many pictures of tropical flowers and boats in my sample collection that were extremely sharp in contrast and with great colors.  The closeup features on the camera are just what I was hoping for in sharpness and blow away my Elphs by a long shot.In reduced light or at night-time, I have taken pictures of my stained glass lampshades and the colors were reproduced perfectly.  This also goes for my hound dog who never likes to stay still when I take her picture.  By using the 'Kids and Pet' scene mode, the camera again worked flawlessly and stopped her movements so I could get great quality pictures of her.  I have a waterfall in my backyard and the same scene mode stopped the water flowing over the rocks so the stream appeared to be stopped- a very nice effect.The zoom!!!!!!!!! Just wonderful.  I used the digital zoom at about 32X to take a picture of a flower blooming in a neighbors yard.  I am not a fan of digital zoom pictures at all, but the photo appeared to very crisp and sharp.  I take pictures of the sea birds near my house and the zoom is perfect for those hard to get close ups.The software inside the camera can be used to enhance or repair photos, and again this is a feature I never used before.  I can take a picture into the sun of a person and by using the correction in the camera, they don't appear to be blacked out like with my Elphs.The battery takes aproximately 250-275 pictures and I am very happy with it's performance.  The LCD screen looks fine to me even in the bright sunlight.My only wish was the camera was the same size as my Elphs, but I am sure that will happen in the not too distant future.  It fits easily into the pockets of my shorts and feels solid, although a bit heavy compared to the ELph.Lastly, these are just my impressions and everyone will have specific likes and dislikes about any brand of camera.  I almost pushed the buy button on the Panasonic competitor, but I remembered what a professional photographer told me before I purchased my first digital camera: \"Go with a brand that has been making camera for a long time.\" If you do decide to purchase the Canon SX 200, I think you will be pleasantly surprised. If not, return it and get the Panasonic which by all accounts is a very fine camera also.", "Date": "June 23, 2009"}, {"Title": "Amazing Camera", "Author": "J. Kennedy \"superjeef\"", "ReviewID": "R1TU04J9H01OJE", "Overall": "5.0", "Content": "I am not a professional photographer, but I wanted a nice camera with me when I went on a trip to Europe.  The Cannon Powershot SX 200 IS has more than served me well.  It takes outstanding pictures, and the built in panorama stitching mode works wonderfully!I also love the look of this camera, it is gorgeous and the perfect compromise between compact size and a full set of features.I would definitely recommend this camera to anyone that is not a professional but still wants a camera that is capable of taking the very best pictures.", "Date": "April 28, 2009"}, {"Title": "Satisfied with SX200IS", "Author": "G. Schwartz", "ReviewID": "R2BGCLAYZV0NMO", "Overall": "4.0", "Content": "* Fully meets my expectations.* Looking forward to CHDK providing the capability to optically zoom during video.  Digital zoom with 12 MP is marginally OK.  It would also be nice if CHDK provided RAW capability.* I was concerned that thickness of nearly 1.5\" would be a problem ... it's not for me.* Lots of valuable features that will take several weeks, and a few hours in the owner's manual, to fully appreciate.* Access to all the features is initially a bit of a challenge, but once Canon's scheme is understood, and practiced, it's not an issue.* Of particular value is the camera's ability to be set in a mode that produces excellent results for most any situation, yet requires no more input from operator than composing the photo.* \"Blink detection?\"  What next?* Now I can get excellent photos of subjects & situations that made using my digital SLR difficult or impossible.* Very fast start-up and shutter release.", "Date": "April 24, 2009"}, {"Title": "Very nice looking, great little p&s; camera...", "Author": "John C. Walborn \"jmanbroncofan\"", "ReviewID": "RJ7R5SLLNMSQQ", "Overall": "5.0", "Content": "Played around with it quite a bit today. Sharp pictures, very good options for the casual photog. The optical zoom is quite sharp and the digital zoom is as good as one could expect. Camera is definitely a big larger than the competition, but that 12x zoom lens has got to go somewhere. Bought for a vacation to Cancun and I think it will be perfect.", "Date": "April 15, 2009"}, {"Title": "I wish it was mine", "Author": "Joshua Holland \"jman\"", "ReviewID": "RGZTXG50KS8XI", "Overall": "4.0", "Content": "Got this camera as a gift for my brother and his new wife.  I had the opportunity to use it at the reception.  I normally use a canon 450D, and really enjoyed using this to snap shots at the reception.  It took great pictures, the auto setting does a fantastic job, and the manual settings are fun to play with.  The menu is easy to navigate and reviewing pictures is a breeze.  The construction is solid, the size was a little bigger than i thought it would be, but it is still small for all the features.  As many people point out the flash pop up takes some getting used to, but it performs well taking shots in indoors.  I was impressed at how well the shots of the cake cutting came out I was in the crowd shooting with my arm in the air and the zoom out over half-way with the flash on and the pictures came out great, they looked like i was in the front of the crowd.I have since recommended this camera to a friend who purchased it and really enjoys.  My brother and his wife also really enjoy it.  I really enjoyed it, I wanted to keep it.  The camera is easy enough for anyone to pick up and take great shots and also has depth that a techy can enjoy.", "Date": "September 14, 2009"}, {"Title": "Canon PowerShot SX200IS", "Author": "GinaAmara \"ginaamara\"", "ReviewID": "RHNGQO0P069WQ", "Overall": "3.0", "Content": "After researching this camera and reading rave reviews, I replaced my point and shoot with this model. This camera makes beautiful crisp outdoor pics. But like any point and shoot, indoors, if the subject is too far away for the flash to reach(approx 15ft), not going to get the shot. I was however able to make some beautiful video of my child's recital from the back of the room, great zoom for video. Sound quality great. Pop up flash is a bit of a bother as it pops up everytime the camera is turned on. Easily hooks up to hdtv for viewing. A little bulkier than I had expected.", "Date": "August 22, 2009"}, {"Title": "JUNK", "Author": "Greg Harley", "ReviewID": "RJFMSNXBW79VP", "Overall": "1.0", "Content": "Bought this camaera for my wife for Christmas  It has never worked right. Cammera freezes in the open position and will not turn off  until I removed the battery. Then we must recharge the battery  and it will do it again after just a few pictures are taken. Never should have bought it .", "Date": "February 6, 2010"}, {"Title": "I love this camera", "Author": "Anonymous", "ReviewID": "R2QBJ5T9P4YI", "Overall": "5.0", "Content": "I purchased this camera to replace a stolen Canon Powershot SD1100 IS.  Instead of going with the 1200 update, I opted for this (more expensive) model primarily because I wanted the zoom.  When you learn a few things, the SX200 IS is markedly superior camera and the photos I am taking are breathtaking.  Auto mode is okay; however, experiment with the manual settings for fantastic photos.  It is a point and shoot as long as you choose the right settings and they may not be what you are used to.  Read the manual.  It's easy.  Canon's color is always good (in my opinion) but this color is the most realistic I have ever seen.  Skin tones are exceptional.As for the camera-style, I think it is gorgeous ... a retro looking slighty-boxy, black (the red looks good but I am a traditionalist).  The flash location has never bothered me.  I like that it is slightly bigger than my teeny Powershot; I have small hands but had a hard time holding the SD1100.  This camera is way more comfortable.  The screen is beautiful.  I guess the only other thing I have to say is that I hope I have it for a long time.", "Date": "August 28, 2009"}, {"Title": "It Does It All", "Author": "George", "ReviewID": "R3QE6EZ85Y12VU", "Overall": "4.0", "Content": "This is my fifth digital camera, three of which are Canons.  In my experience, Canons have provided the best images and this camera is no exception.  I was considering a DSLR, Canon for the most part, (having used a 35mm SLR for years prior to digital) but decided on the compact SX200IS instead.  It had everything I was looking for, good auto ability, manual adjustments, wide angle ability, and most of all a long (12x optical) lens.  This camera provides all the features of a DSLR, (except lense interchangeability and a viewfinder) and still can fit in a pocket.  Although a little larger than the little ones out there, it still goes into a pocket or it's case on my belt and I take it everywhere.  If I had to hang a DSLR anchor around my neck, it would be staying in the house or car and not taking pictures.The automatic pop up flash is no big deal.  I don't even know it's there.  However, the multipoint focusing in Auto mode can lead to a lot of bad, blurry shots.  I use the P mode with center focus and that irritation is gone.  Indoor shots are great, especially when using Indoor mode.  Battery life is very good. I'm surprised how good the 3\" screen is and I don't miss a viewfinder at all. The functions, features, and adjustments are numerous but accessing them is intuitive.  Reading the manual and practicing with the camera are essential.DSLR owners may pooh-pooh me when I pull this camera out of my pocket, but I'm taking the pictures while their cameras are paper weights somewhere.", "Date": "August 28, 2009"}, {"Title": "Makes me appear to be a better photographer than I am.", "Author": "J. A. Mccormick \"Tonton Jeannot\"", "ReviewID": "R2MIB5T7HP339U", "Overall": "5.0", "Content": "I bought this camera for a month long vacation to France.  The camera was very easy to use, and the image stabilization was excellent.  My close vision isn't very good, but I could trust the camera to take a clear picture even if I wasn't wearing my reading glasses and couldn't see the viewfinder that well (not the viewfinder's fault, everthing's a blur up close without my glasses).Also, the battery was a great improvement on the previous battery technology.  With my previous Powershot, after one day of pictures, the battery would run out.  With this one several days passed and the battery still did not run out.  In fact I would change to a recharged battery just to be safe after a few days, I never was caught with my power out.Also it's pretty tough.  I have a nice little case, but more often than not I just would dump it into my regular bag with all my other traveling junk.  The camera was no worse for wear.I love this thing.", "Date": "August 4, 2009"}, {"Title": "Love the Canon SX200IS", "Author": "B. Powell", "ReviewID": "R1HIBJP4NYMUDS", "Overall": "5.0", "Content": "I bought the Canon Powershot SX200IS because of the HDMI output. I love taking widescreen pictures and HD movies with this camera and showing them on my 52\" Mitsubishi DLP TV. Wonderful detail and picture quality of both stills and movies. This camera does everything I want it to and more. Very happy with the results. Looking forward to taking it on vacation to California next month. I bought the 16gb class 6 Transend SDHC and it works great too.", "Date": "April 13, 2009"}, {"Title": "Nice Point & Shoot", "Author": "H. Dinh \"shooter\"", "ReviewID": "R1YPTQWP31401R", "Overall": "4.0", "Content": "After so much anticipation, I got this camera from another retailer before Amazon had it available. Just a note, I am not a first time P&S; user; I had several of them before this. My main camera is a Canon 5D MkII, this camera impressed me so much that I decided to get a Canon P&S;, thinking that I will get the same deep color saturation and image.After shooting it for a week, here are what I found:1. Camera is hard to grip. There is no grip on this camera, the enlarged end does not count as a grip! It is kind of slippery, so you can't shoot it with one hand. I had to add a strap and wrapped it around my wrist, afraid that I drop the camera.2. The flash popped up on power on and close when you power the camera off. This is a major issue for me. I hate it! Wish I can pop it up only when I need like my Panasonic DMC-LX2. It is also flimsy, I am afraid I break it off if I am not careful.3. Noise noise and noise. Less noise than the Canon G10, but they are there even at low ISO. Images are soft, I guess from noise reduction algorithm. This is another major issue.4. HD video is fine. This is not my main reason to get the camera. For $200, you could get a real HD cam that could do 1080p. I shot some video, but did not get to try it on my TV because I don't have the cable!5. Long end zoom image is visibly soft.I have a Canon A620 and a Panasonic DMC-LX2. Either one of these produces mush sharper and clearer images than the SX200 IS. I tested all three of them by shooting the same thing, under the same lighting condition. The result prompted me to give up on this camera. Guess I just shoot with what I have.I gave it 4 stars because I think most people would be happy with this camera. I expect a lot more from a camera that cost $ 350.", "Date": "April 1, 2009"}, {"Title": "Zen and the art of the consumer digital camera", "Author": "Working Poor \"JD\"", "ReviewID": "R2FVOAB1XCGZ9M", "Overall": "5.0", "Content": "I will try to be brief.  The reviewer who recommended doing your research/homework was absolutely correct.  However, do not get too bogged down in the details, as you will only become further frustrated.  Digital Photo Review, Megapixel dot c, are good resources.  I own too many Canon cameras (according to my wife), but this is because I LOVE CANON, they have yet to disappoint me.  I would bet that for everyone that loves Canon there are a few who \"love\" another brand.  Point being; unless there is some HUGE advance forward in technology, the differences are often razor thin (at this level).  The Power Shot line up has been solid.  I have several different models and use them all.  If you want high quality video, buy a decent video camera.  If you want high quality -photographs vs. snapshots, buy a quality DSLR, high quality point and shoot ... buy high quality point and shoot.  Even the Canon 5D MII (my dream machine) does not pull off -outstanding video-, but the photographic possibilities are off the charts, and that is almost a 3K camera.  To each his own, but do not expect your VW bug to out perform a Porche, and you will be fine.  This gadget, yes gadget, is more than most will ever use.  I spent a few days with it, and never \"maxed out\", within reason.  ALSO: It has a 12X Optical, Not Digital.  \"Digital Zoom\" is a marketing gimmick, the exact same as \"cropping\" on a photo suite.Hope that helps ...", "Date": "May 20, 2009"}, {"Title": "Awesome camera", "Author": "M. Conrad", "ReviewID": "R2E37YIZ992OSU", "Overall": "5.0", "Content": "I waded through hundreds of camera reviews before settling on this one.  I wanted low light performance, good picture quality, optical zoom to a decent degree, SDHC cards, decent battery life, and have it be relatively pocketable.I first bought a Fujifilm F30, which while its a bit old, it was reputed to be king of low-light.  I was very happy with the night performance, but not really satisfied with the picture quality.  Then the lens cracked on me, presumably from temperature.  Bah.So then I went hunting again and settled on this one.  Its quite a bit more expensive, but I am 100% pleased with it.  I'm a photography novice, really, and I'm able to get absolutely perfect shots with this camera.  It's night performance is not as spectacular as the F30, but its more than adequate for my needs.  I'm totally satisfied on that front.  The battery life seems quite good (I have yet to run it below 50%, but then I don't take all that many pictures/videos), and the optical zoom is amazing.  Image stabilization allows me to get great shots at full zoom *in dim light* without a tripod (though I have pretty steady hands).  The menus are intuitive enough that I don't need to carry the manual with me, its small enough to fit comfortably in a belt pouch (but not really what I'd call small)  It's lightweight, and has a nice sturdy shell (though I would never want to drop it while the zoom lens is extended)I was impressed that the pop-up action of the flash (which people have expressed annoyance at) is not motor driven, its a neat design where it's either spring-loaded outward or inward.  So, there's no harm in holding down the flash with your finger, or pushing it back down if its already out.As a bonus feature, I've found that the videos are fantastic.  I actually have videos of 4th of July fireworks that look like they were taken with a modern high-end video camera.  (and yes, that means it was capturing video perfectly at night)Ok, negatives:It doesn't snap a picture very quickly.  Trying to catch shots of ice-skaters whizzing past generally failed, because the shutter would never fire when I wanted it to.  However, I just switch to video and its more entertaining anyway.The videos are HUGE.  We're talking 5MB a second.  But they're also high-def, and you can't really expect a tiny video processor to fully compress the video.  Get a large SD card and compress them with your PC.As with any camera, you'll run into situations where the technology fails.  For instance, it has a horrible time focusing on glossy white objects.  Read the manual to discover tricks for dealing with these circumstances, like focusing on a different object an equal distance away and then holding the button while you turn toward the glossy object.When you look at bright lights, you will see large blue vertical lines on the screen.  Don't worry, these will not be on the final picture.When you look at bright lights in video mode, you get the same vertical blue lines and they DO show up in your video.  This is bad.  But, not a showstopper by any means.  How bright?  A frosted light bulb is usually OK, where a visible-filament is usually not ok.All in all, I am 100% satisfied with this purchase.  It was expensive, but I feel like I'm using the best pocket camera I've ever put my hands on.  It does everything I want and fully meets all my needs.", "Date": "January 4, 2010"}, {"Title": "Excellent Camera", "Author": "Ehud Nathaniel", "ReviewID": "RJ2I57Q6Q53BG", "Overall": "5.0", "Content": "I will not attempt to add to the amazingly detailed and professional reviews already available for this camera - which, btw, were one of the main reasons I chose this camera.I will just describe my experience with it.I was looking for the 5 things in a new camera: Compact form factor, excellent picture quality, mega-zoom abilities, HD movies recording and an image stabilizer for indoor long exposure where I want to avoid using the flash.For me, this camera has answered those requirements - and almost perfectly so.The image quality - and in various indoor and outdoor settings as well as various light situations - is just excellent. Same goes for the HD movies it records.(Almost) No need for to carry another gizmo any longer.I have only 3 issues with the camera:1. Once a movie recording has started, the zoom cannot be changed.2. The batteries are Cannon propriatory and I cannot use standardized (and rechargeable) batteries.3) The location of the flash is where one would hold the camera and it's just an annoying engineering decision.However, I know about all this issues prior to purchasing the camera and hence I would rate this camera as an (almost) perfect 5 stars.Well worth every penny invested in it.", "Date": "November 15, 2009"}, {"Title": "Probably the best pocket camera on the market today!", "Author": "Adam Petrone \"Adam\"", "ReviewID": "R3EHSERHKSKPSG", "Overall": "5.0", "Content": "I've owned this camera for a few months now. I recently bought the new SX20IS as a superzoom. I'm asking myself why. The SX200IS does everything I want out of a camera. I might return the SX20IS because it really isn't any better than the SX200IS. I take this camera with me all the time. It's pocket size and considering it's a 12X zoom and takes flawless HD Video it meets all my needs. This even takes much better low light pictures than the SX200IS. It's picture quality is second to none in this price range. I've taken party pictures in Hall lighting and pics at my local airshow and all Of them came out beautiful. There aren't many cameras with a 12X zoom and HD Video that will fit in your pocket, considering that and it's photo quality and would highly reccomend this camera. I like the SX20IS but it's size makes it a hassel to carry around, the SX200IS is the money.", "Date": "September 21, 2009"}, {"Title": "Excellent Camera!", "Author": "Shailesh S. Dongre", "ReviewID": "RCOHXDXKF65TE", "Overall": "5.0", "Content": "I bought Canon PowerShot SX200 IS from Amazon.com almost a month back!And, I am so happy that I made the right choice for the money I paid to get this baby!The amazing 12X optical zoom will blow your mind away...with a sharp image quality....thanks to 12 Mega-pixels!The Strong Points -1. Excellent picture quality2. 12 MP ensures crispier and sharp images in good color3. 12X optical zoom and 3x digital zoom = 48X overall zoom4. Lots of manual controlling options to turn yourself from an amatuer photographer to level 2 or 3 photographer5. Easy controls6. Some coolsfeatures like color swap.... for eg. you can turn a red-flower into a blue flower! :)7. Face detection, imagestabalizing, shak proof8. Night time photos are of very good quality if not excellent9. Even at 12MP, the average image size on disk is between 2 to 4 MBThe Weak Points -1. The battery runs dry after some 225+ photos in one go (So buy a spare battery)2. HD Video takes huge space.... a 1 min video can be 150-200 MB! (So buy a 4 GB SD card)The bottomline - An excellent camera from Canon!", "Date": "September 8, 2009"}, {"Title": "nice form factor, great zoom, but better off with SX110IS", "Author": "Antonio Farias", "ReviewID": "R2ES1SFWRO4RAU", "Overall": "4.0", "Content": "i waited for this size camera with an exceptional zoom to come out from Canon last year, but ended up settling for the Canon SX110IS.  having now purchased the SX200IS, i have to say that while i like the smaller form factor and the 12X zoom (verses 10x on SX110IS), the insistent flash is a pain, although it does take significantly better indoor photos than the sx110is, and the camera isn't small enough that i can pocket it significantly better than SX110IS.  i honestly prefer rechargeable AA batteries of SX110IS, but wife prefers the Canon specific battery of SX200IS.  overall a nice camera, but i don't think it was worth paying twice the price of SX110IS.", "Date": "June 25, 2009"}, {"Title": "What a camera.", "Author": "Jean M. Fleck \"Camera buff\"", "ReviewID": "R2IHOHCAC3IUXK", "Overall": "5.0", "Content": "After purchasing both the Panasonic zs3 and Canon sx200is I came to the conclusion that the Panasonic was going back,the zs3 is a decent camera and I basically went by the reviews before buying it,but realized most people just want a P&S; camera that takes nice photos and dont explore the possibillities of it,thats not for me.I need to use Manual conrols at times which the sx200is has and zs3 doesnt,there are situations where the Aperture needs to be changed for example etc.Some of the reviews on the sx200is are not in favour of the pop up flash,well after using for over a month I can certainly say that its not problem at all.I also am a Macro Photographer person and as well as regular Macro this camera has Super Macro and the name says it all,its Super.I also print a lot of 8x10 pictures and they are very professional looking,cant beat that.As for the Video aspect of this camera I find it just great,I have hooked the camera up to our 37\" TV and the videos are extremely clear,this I am very excited about,as I like recording.So in conclusion,I highly  recomend the Canon sx200is.", "Date": "June 11, 2009"}, {"Title": "Pocketable performer", "Author": "Ross A. Brunetti \"RB\"", "ReviewID": "R38LJ3WZNKW1N5", "Overall": "4.0", "Content": "1. The image stabilization works very well.2. The lens performance is surprising, considering the zoom range and size. The edges are softish and show chromatic aberration when you look closely, contrast could be better, but this is a 12x, wide-to-super-telephoto range lens the size of a walnut! Congrats to the Canon engineers.3. Fits nicely in a pants pocket. Just recheck the shooting mode dial after you pull it out of a pocket, because...(see next)4. More shooting options than you can shake a stick at. I leave it on aperture preferred, because that's what I'm used to from days of film SLRs. But I've been caught off guard by the mode dial being moved as I pull it from my pocket. A lock button would be nice, except...(see next)5. The small size and the many controls make for tiny, fiddly buttons, dials, and so forth. Maybe if I practice enough I'll be able to do exposure compensation and bracketing without taking my eyes off the LCD screen.6. Megapixel ratings are not an automatic indicator of image quality. The Canon does well, but falls just a bit short in quality compared to my Nikon D40 with 6.3 mp when viewing images at high magnifications because of (other than relative lens quality) maze artifacts. Again, you won't notice unless you're really cropping a picture (which is what I often do, because even 300 mm equivalent is short when photographing wildlife under most circumstances).7. Battery life is very fine.8. The flash isn't useful beyond about 7 feet at the low (read: good image) ISO numbers. But, it's a tiny little thing. Can't expect much. You can bump the range to 20 feet or so by changing the ISO to 1600, and get adequate family reunion snapshots of Cousin Jane and so forth.9. (edit, 7/1/2010) I just posted a pic of a male California Valley Quail taken with the Canon, and I'm quite happy with it. Check it out, taken at max zoom out of the jeep window before the little guy could fly off. It's an about 1/3 center crop of the original. A little soft, a little edge color in the out-of-focus background elements, but I'd never have gotten the shot pulling the DSLR out of its bag because these little guys don't hang around.On the other hand, I've not yet been able to get equally satisfactory results in close focus. Not a failing, I'll say, just that compromises had to be made, and close focus lost out. It's a big deal for me as most of my nature photography is of plants and flowers, but not enough to stop me from saying that this is one fine compact camera.", "Date": "September 1, 2009"}, {"Title": "Perfect mid-sized camera", "Author": "Christopher P. Cashman \"chris cashman\"", "ReviewID": "R6HWEM3PP14HK", "Overall": "5.0", "Content": "I've had mine for several months now and the problems most people find with this camera (specifically the pop-up flash placement and the lack of optical zoom in movie mode)  don't bother me at all anymore.First I'll cover what i LOVE about this camera, then I'll address the concerns others have voiced.The real features for this camera seem to go unnoticed by most people.  It has aperture, shutter and manual focus.  This is unheard of in non-SLR cameras!  It allows you to get crisp, sharp and artistic photos of portrait, landscape and macro that have previously not been possible with a compact camera.  Because of this, I don't even really consider this a true point-n-shoot.  More like a compact SLR.Also, the 12x zoom that is the first draw for this camera also seems to let in more light because of its size.  We all know more light through the lens makes for  a better photo.My only wish is that the continous shooting was a little faster, but that's what my SLR is for I guess!  So for an easy-to-carry camera this one gets my money if you are going to an event that is difficult to pack your SLR and all of it's accesories.As far as the compaints others have made:The flash positioning is actually not bad.  If your hand naturally sits over that spot and you don't need the flash, just keep your hand there.  The mechanism that pops the flash up is designed to slip instead force itself up, so you can hold it down if you prefer.  It doesn't seem like it might break, which was my main worry when i purchased it.I'm not even getting into the HD movie optical zoom issue becaue this is a camera, not a video camera.  That's just a bonus feature to begin with.", "Date": "May 22, 2009"}, {"Title": "Canon PowerShot S200", "Author": "soxgirl", "ReviewID": "R3O36TYST5O1SL", "Overall": "1.0", "Content": "Typically I would never have spent this much money on a camera but one of my favorite things to do is take pictures so I thought I would splurge and treat myself.  This was not without plenty of research beforehand with the hopes of finding the perfect camera.  I saw the great reviews for this camera on amazon so I figured I couldn't go wrong. Boy was I wrong... I may have been one of the unlucky ones who is now unable to use my camera after just having it a little over a year.  The camera is in excellent condition and has never been dropped but it won't work.  The camera turns on and off and I can view pictures that are stored on the memory card but I cannot take any pictures as they all come out completely black.  The lens does extend but the LCD screen is black. I tried to contact Canon about this only to be told that they stopped making this carera so they no longer have any parts to repair but I could pay a fee and get a refurbished camera. I'm highly disappointed. I do not feel like spending hundreds of dollars to get an already used camera when the camera I have is pretty much brand new in my eyes. At this point, I will not be buying another Canon product.  I do not believe I should pay anything for this issue that appears to be continuous by many. I wish they would do the right thing because they are losing a lot of customers.. including those that have been with them for years.  Such as shame since I loved it when it was working.", "Date": "June 22, 2011"}, {"Title": "Very Nice Camera", "Author": "J. QU", "ReviewID": "R2YUNZIN8RFYDG", "Overall": "4.0", "Content": "This is my 2nd Canon Digital Camera.  Overall, i am very satisfied with this product. The pictures taken  in sunny, outdoor settings are stunning.720P HD videos shooting is easy and quaility is very good.  Camera Software user interface is very intuitive, and has some advanced editing features as well.Here is some short-comings I've noticed:.(1) if you takes a lot of pictures with kids playing sports where your subject is in motion, this camera is not a good fit.  The continuous-shooting mode is slow. (~1 shot/second range)in addition, the LCD \"blanks\" out for a 1+ seconds after each shot so you have a hard time following your subject while in continuous-shooting mode.  The \"Servo AF\" mode tends to over-compesate so i general turned that off.(2) If you would like to take picutres using the camera's 12X optical zoom, pls make sure you use a tripod since very small hand motion at that range can make the shot producing a lot of noise (\"foggy\" pictures).(3) The \"Auto\" mode in indoor setting doesn't always detect the current light condition.  It's best to put the camera in \"Program\"(P) mode and manually select light condition and sensitivity.In general, this camera does not take good pictures in low-light conditions without the flash.", "Date": "October 12, 2009"}, {"Title": "Nice camera, but pricey for the quality", "Author": "xeno", "ReviewID": "R1C14P1A8V825S", "Overall": "4.0", "Content": "I'll preface my review by saying that I am the owner of a Panasonic TZ5, and my opinions on this camera are based on a comparison of the two.First off, if you don't own a TZ5, then you may really love this camera.  It has tons of great options, an excellent 12X zoom lens that was very smooth (and quick), and a variety of modes that are easy to set.  If you understand the many adjustments that can be made in taking a picture, then you will really enjoy the manual modes on this camera.  It comes with several levels of manual picture taking, with each level allowing more and more customization, with the highest level leaving it all to the photographer.  This allows someone with the know-how and experience to get the most from the camera.  I did play around with this a bit, but for the most part I want a camera that takes good photos with as little adjustment as necessary.Things I found to be negatives:Pop up flash - I always had my finger right where the flash pops up.  Eventually you may get used to this, but it did annoy me.Lower quality LCD - Was grainy even when outdoors, and indoors it was very grainy.Bulk - The camera is a big larger than the TZ5, and didn't really feel comfortable in my hands.  Canon made one end of the camera larger in an attempt to give you something to grip, but it just felt a bit awkward to hold, in my opinion.Speed - A bit slower than the TZ5 overall in processing the picture after taking it.Some thoughts on the modes:Outdoor mode - Makes some odd choices with the exposure - In comparison to the TZ5, a blue sky would come out much whiter in some areas.Auto mode - Pretty good at selecting the right ISO, flash strength, etc.Indoor mode - Better than the TZ5 - Good white balance, still a bit grainy.Macro modes - Offers two versions - One \"regular\" macro and one for extreme close ups.  Took some nice close up shots that were very clear, even when zoomed.All in all, I found the camera to be mostly on par with the TZ5, with the TZ5 having the edge on overall PQ and ease of use.  For a next generation camera at $350, I would expect better performance.  You can get a TZ5 for $100 less and similar performance.  However, if this is your first experience with a larger Point and Shoot with extended optical zoom, your likely to be pretty satisfied.  I'm sure next years model will be much improved.", "Date": "April 8, 2009"}, {"Title": "Great zoom camera", "Author": "Nathan Scherer", "ReviewID": "R19RFSMEMQ4B7P", "Overall": "5.0", "Content": "I was previously looking at budget cameras and settled on the Fujifilm Finepix J38 for about $95.  I figured companies had this point and shoot thing figured out, and pretty much anything would take good photos these days.  I was wrong, and found out sometimes you do get what you pay for.I restarted my search, this time focusing on cameras with greater zoom capability, since I had decided to up my budget and didn't need anything tiny.  I decided on the SX200IS, and haven't regretted it.  It take good photos indoor and outdoor, without too much noise, and the 12x zoom lens is great.Noise level is one of the things I hated about the Fujifilm, and this camera is much better in that regard.  I would have loved to see what this looks like with an 8MP sensor since it could have reduced the noise level even further, but it takes fairly clean shots even in poor lighting conditions.  If the lighting is good, such as in a room with windows during the day, the images are very good with little noise.  Zoomed out to about 50% size or less, it's barely noticeable.  In comparing similar indoor shots, I would say the noise is slightly worse than a Canon EOS 50D SLR (over $900 without a lens), and comparable to a Canon SD1200IS.  All this testing was with auto mode, so fine-tuning with different scene modes or manual control (if you know what you're doing) would perhaps improve things even more.I also looked at the main competition from Panasonic (Lumix TZ5 or some such), and found on one review site that at full wide angle with the flash on, the lens actually casts a shadow in the photo.  Unbelievable, and a deal breaker for me.  It's not like that is some kind of obscure shooting situation.There are lots of other detailed reviews, so I'll just be brief.- Lots of shooting modes seem to work very well- Easy to use.  I mostly use three things: auto, indoor, and flash control.- Pop-up flash seems sturdy enough unless you abuse your cameras and presents no problem for holding it- Image quality is good- Zoom is awesome- Price is quite fair for the value- Good battery life (though I don't use the flash much)- The charger is nice - compact and light, and the plug folds in.  Good for travel.- Big, clear screen; can get washed out somewhat in sunlight but still usable- Small enough to be very portable, but not a shirt-pocket camera.  Then again, who makes a shirt-pocket camera with 12x zoom?- Not particularly good for macro work; it has trouble focusing at very close distances sometimes- As with any small point and shoot, shooting with the flash is iffy.  Not a knock on this camera, I think it's very hard to get really good shots with a flash unless you have a nice external flash like with an SLR.- Image stabilization works well, everything comes out sharp unless there's just not enough light.- Video comes out well if there's good light, grainy if too dark (nothing you can do about that).  The frame is good enough to capture the action such as hyperactive kids.I took this on a vacation to Europe and it performed great.  For anyone traveling with this camera, the battery charger does accept 240 volts, though of course you'll need a plug adapter.  I was taking something like 150 photos a day and I never needed more than two batteries.  The camera gives you a warning when the battery is low and I've never had it just die on me - always plenty of time to get a spare.Also, there are some ridiculously inexpensive 3rd-party replacement batteries and chargers for this camera available on Amazon, or at least they used to be.  They have slightly less life than the OE battery but still great value.  Either way, I do recommend a spare battery as you don't want to get caught with a useless camera and a great shooting opportunity.  I would attach some shots but I don't see how.This model has been superceded by the SX210IS, which I understand is very similar.  Buy it!  I did a lot of research, and I don't think there's a better compact digital camera on the market, period.", "Date": "February 6, 2010"}, {"Title": "Good camera", "Author": "havalina \"havalina\"", "ReviewID": "R2ZC2C9RAJYB7I", "Overall": "5.0", "Content": "I like this camera. I've had it 6 months. It performs better in low light conditions than any point and shoot I've ever seen. The color quality is sometimes a little weak. If only SLR's weren't so large and expensive!I love the pop-up flash because I really hate the flash and so I can just close the flash with my finger when I'm taking a picture and don't need flash -- instead of pushing the buttons on the camera. When you're taking pics of kids and animals, that extra 3 seconds is nice; I actually think it's pretty clever design.I don't know how they fit so much zoom into this little camera, but it's impressive! I mean, it's a lot bigger than the new tiny cameras - but it has a million features. It's as big as it could be and still fit in your pocket, which is what I wanted.I read it had crummy battery life so I bought two batteries when I got it for big events or camping trips so I wouldn't have to have access to a charger and wait. HOWEVER like I said, I've had the camera six months and only had to re-charge the battery about once a month. I took about 2-300 pics at my brothers wedding and didn't have to change the battery. So, I probably didn't need the second battery but I don't mind having it.", "Date": "November 13, 2009"}, {"Title": "Great zoom", "Author": "Ginny", "ReviewID": "R2SYQZTT0K5MCZ", "Overall": "5.0", "Content": "I purchased this camera because I read about the 12x optical zoom.  I have a great Cannon Rebel with interchangeable lens, including a zoom lens, but it is not always convenient when on vacation with little kids and multiple other things to carry around.  Also, I always worry about taking the Rebel to the beach and getting sand in it.  This camera was great for our beach and zoo family vacation.  At the zoo, we were able to get amazing animal pictures with the zoom lens, and I got some other great candid pictures without having to carry around my separate camera bag. I still need to learn more about all the features, but for not really spending much time, I did get very good pictures from our vacation.", "Date": "September 6, 2009"}, {"Title": "Avoid This Camera", "Author": "Gary", "ReviewID": "RO6B5L1LO0D88", "Overall": "1.0", "Content": "These cameras have a design flaw in the lens.  After some period of time, you will get a \"Lens Error\" and the camera will be dead.  Mine lasted just under 90 days.  Now I'm in warranty hell.  I send it in, they pull a beat-up camera off the shelf and send it, and it lasts for a few weeks or months.  Repeat until the warranty expires.  Given that Canon knows about the problem and won't make it right, I will be avoiding all Canon products in the future.As expected, I sent the camera back and got a camera (who knows if its the same one) in about two weeks.  Three weeks later is stopped storing pictures.  Of course, you don't notice that sort of thing until you want to see the pictures of your vacation.", "Date": "April 6, 2010"}, {"Title": "The only bad Canon we ever bought", "Author": "JPinCA \"Jim\"", "ReviewID": "R32VL0JI0HU342", "Overall": "1.0", "Content": "This was the fourth Canon PowerShot I have bought for my wife. I have had one four years ago that took a five foot fall onto pavement and other then a small scratch it worked fine. We have had the SX200IS for less then three months, never had an accident with it, kept it very clean, treated it like a baby. It just froze with the lens extended and said lense error on the screen and restart. It could not be restarted with even the battery removed and replaced. Canon said it would have to be sent in. The good news is we got it at [...] so returning and replacing it should be easy.", "Date": "October 4, 2009"}, {"Title": "Fourteen Months And Then Lens Error.", "Author": "Bobby L. Ready \"bready\"", "ReviewID": "R2OKMTRG5ZC6PH", "Overall": "1.0", "Content": "Worked great for fourteen months and then the lens would not retract and it gives me the len's error code. I just sent it off for repair and am not happy to have to spend the money to fix it.  Canon should have to recall this!!!! Someone should start a class action. This will be my last Canon product.", "Date": "June 21, 2011"}, {"Title": "Good at first..", "Author": "NY Dad", "ReviewID": "R16BTHD5BFHCMO", "Overall": "1.0", "Content": "I purchased this camera about 2 years ago. At first it was great, easy to use, good battery life, nice size, good pics, etc. After about 6 months while on vacation I went to turn it on and I got a \"lens error\" warning and the camera wouldn't power up. I was disappointed because I didn't get to take any picture of the trip but I knew it was under warrantee and would be fixed, which it was after paying for shipping etc to the cannon repair facility. When I got the camera back the invoice said \"dented lens cover\" which I thought odd because there was no signs of damage when I sent it in and I inspected the lens area when I saw the message \"lens error\". No big deal, they fixed it so I was fine with it.Fast forward about 10 months, on vacation with my wife and child, about two days in. We were taking some family pictures at sun set using the timer, then the wife got annoyed with the timer thing so we asked a couple to take a picture of the three of us which they did. I turned the camera off and we headed back to the hotel but I couldn't resist another photo op with my son smelling the local flowers, that's when I went to turn the camera back on and again I got the same error message \"lens error, restart camera\". I turned it off and back on but nothing, same error.  You can imagine my frustration now I had two vacations that I wouldn't be able to document by photo.When we got back I went through the same drill with Canon but now they want $150 (before repairs) to look at the camera since the warrantee had expired (from the date of purchase not the date of repair). This is complete BS!!! I've always kept the camera in a sturdy camera case that I bought on Amazon (shortly after purchasing the camera), it was never dropped or mishandled. Canon's customer service sucks and obviously the construction of this camera sucks as well!!!I wouldn't buy any of their products or recommend them to anyone. I feel bad because my mother-in-law bought the same camera based on my recommendation (before all of these problems)", "Date": "May 23, 2011"}, {"Title": "BEST Point & Shoot EVER", "Author": "M. Bardo", "ReviewID": "RHRY9IVL6NAMY", "Overall": "5.0", "Content": "Camera is the best point and shoot i have ever owned.  I have owned two sony P&S; and a canon P&S;, and by far this is the best.  The optical zoom is AMAZING.  The 720P HD movie quality is amazing.  The problem with the flash popping up is not a problem at all.  It isn't even in the way.  I was skeptical about people saying there is no zoom while recording a movie.  They are WRONG.  True, there is no OPTICAL zoom, but there surely is digital zoom, and there is NO problem with that.  The digital zoom is VERY adequate.  If you want a better camera for videos, go buy a camcorder.  This camera is for pictures.  The pictures are EXCELLENT!!!  The only down side i could say is that the black is more of a dark, dark brown.  I wanted a black one, but opted for the blue one, which is VERY nice.  BUY THE CAMERA!", "Date": "March 11, 2010"}, {"Title": "works good", "Author": "J. McIntosh", "ReviewID": "RUZHCVK9XX0R1", "Overall": "4.0", "Content": "I think this is a good camera and would recommend it.The two complaints that I read about is that the popup flash is annoying and the zoom feature is disabled in video recording mode.I actually think the popup flash is a great feature.  People haven't liked the fact that you can't disable it by keeping it from poping up.  This is true, but an important feature that people failed to mentioned when I was reading the reviews is that the flash is actually really easy to push down with your left index finger and that when you push it down, the flash is automatically disabled.  So this is a quick and easy feature to disable the flash and not an annoying design problem.  So forget the flash as a problem and think of it as a feature.The other problem is not having zoom when recording videos.  It actually turns out that you can't change the optical zoom while videoing, but the digital zoom still functions just fine.  While it would be best to have optical zoom functioning, the problem with that is that the noise from the optical zoom motors would kill the audio in the recording.  So having the digital zoom work instead sacrifices video quality for audio quality for zoom functions.  Of course you'd like both, but at least you know what you're giving up optical zoom for...I guess I also read that the Panasonic competitive product has a better screen for viewing pictures.  this may be true, but I guess I don't miss what I haven't experienced.  The screen on this camera is just fine.Love the 12x optical zoom.  That's the reason I bought the camera.Bottom line is that I think this is a good camera for the price.  If you have the budget and want better pictures, buy a better camera, but this is just fine for taking pictures of the family, vacations, etc.Good luck.", "Date": "March 10, 2010"}, {"Title": "Just returned from the Mexican Riveria", "Author": "Trina L. Stroope \"TStroope\"", "ReviewID": "RR5TIR02CV41J", "Overall": "5.0", "Content": "We took this camera on vacation and really FELL IN LOVE WITH IT.  It had just enough functions that we could make it take lovely, high quality photos and had enough options on it to make it just plain F U N.  The sunset, foilage and beach functions are AMAZING.  I would suggest this camera to anyone that does not want to carry a large SLR camera, it has many functions (but easy to use) but is compact.  The battery was GREAT for all day photos.", "Date": "December 23, 2009"}, {"Title": "overall worth the purchase but not without issues", "Author": "J. Quaintance", "ReviewID": "R3OEUAGAPCVQBX", "Overall": "4.0", "Content": "I picked this camera up for my wife a week ago with the intention of using it on a fall colors motorcycle ride around Colorado. we both played with the camera quite a bit before the trip in order to familiarize ourselves with it before hitting the road and were very pleased from the very beginning at the interface and usability.first, the pro's:1. in my amateur photog opinion this thing takes spectacular photos, the auto mode really does seem to do a good job at picking the right setting and getting the shot but for outdoor use and scenery photos, i was just blown away by some of the color in the pictures.2. the interface is slick, everything about it pleases me. but this is the first point n shoot digital camera i've bought in a few years so it might be run of the mill, i dunno.. but its definitely a huge step up from my older sony and unlike the DSLR we have, my wife instantly felt right at home playing with different shooting modes etc. this was very important to me.now.. the drawbacks:1. construction quality has me a little worried, the second day we had the camera we noticed that sometimes the flash popped out even with flash disabled.. ok.. but then on the trip it became a quickly progressing problem and by 2 days of solid use the flash always popped out when you turned on and wouldn't retract when turned off.. you had to manually push it back down which i'm sure isn't great.. and yes, the flash does get in the way of your grip but i'd say thats a minor nuisance at most... the upside is this is my first exchange experience with Amazon and i gotta say.. thumbs up to them! replacement camera is on its way. also, besides our problem with the flash.. the door covering the mini hdmi/usb ports is pretty flimsy feeling to me.. again though, I think if it weren't for the flash dud we had i'd not even be making a point about construction.2. battery life, i was a little surprised to find the battery dying before a full day's ride on the bike, this is the first digital camera that hasn't lasted a complete day before getting a recharge in the hotel room that night... luckily i bundled my purchase with a second battery which was dirt cheap... also, keep in mind this is shooting several hundred photos a day... in a three day period she racked up 900+ shots on the bike.3. it's not as quick at shooting as like say my sony DSC-T130 but again, this may not be the cameras fault.. i might need faster media given the increase in MP/image size.overall, the picture quality and ease of use is what counts for me and this camera is aces in both.", "Date": "September 22, 2009"}, {"Title": "Wonderful prosumer point and shoot", "Author": "pax lingua", "ReviewID": "R312I82D813L13", "Overall": "5.0", "Content": "Pros: Nice features/settings, Bright LCD, excellent image quality, Good Low-Light Performance, Lightweight/Portable, durableCons: not for amateurs who wish to remain amateursThis is a very solidly built camera with a large array of options to create the desired pictures in-camera. Although it does not have a grip, it is very easy to hold securely - the curvature of the right side of the body and the rubber pad on the back of the camera do the trick.I would not necessarily recommend this camera to photographers who just want great pictures out of the box. The variety of adjustments can assure immaculate pictures, but they will need to be used occassionally to get the desired results. The learning curve to make full use of the camera could be quite a long one for true amateurs and lead them to be critical of the camera although it might not be designed for them.For those who wish to have a point and shoot but are also motivated to become \"prosumers\" over time and don't want a bulky DSLR-like camera, the SX200 IS might be the best choice, and if you like HD movies (albeit without optical zoom), the only choice.", "Date": "August 29, 2009"}, {"Title": "Sleek, Stylish and Professional Creativity - GET IT!!!", "Author": "Amazon Customer", "ReviewID": "R3ENA57G4W41WF", "Overall": "5.0", "Content": "I was looking for a new camera and this one was irresistible.  I had a small Canon elf camera before and just wasn't getting the shots that had a WOW factor.  After buying this camera and using at the zoo and the park I am very satisfied.SizeThis size is bigger than my elf but when you see the zoom lens expand it seems like a marvel.  How do they pack this massive barrel in such a small camera?  I showed my neighbor my new gadget and he was equally perplexed.  How do they do it?QualityThe feel is good with plenty of goods to have you going for months.  The camera gives you a full line of features that make you feel like you are a professional.  I took some pictures at the zoo of 6 kids.  My wife told me the picture looks better than actually seeing them there.  Now how is that possible I do not know but the color, contrast and skin tones are off the charts.ZoomThe zoom is the ultimate feature of this camera.  With a 12X optical and 48X digital you are in the driver's seat for some amazing photographs.  I found that you rarely need more than 12X anyway.  I was considering buying a 24X optical zoom camera that was much larger.  After using the 12X I found that is about as much zoom as you want unless you are doing Moon Photography.  Really, anything beyond 12X gets distorted from atmospheric conditions.  If you take a picture of a landscape you will get a saturation of blue tones so the super ultra zooms are truly over kill in my opinion.ProsZoomHD VideoBattery LifeSizeConsFlash-It is almost a deal buster-Pops up anytime the camera is on... Why?", "Date": "June 28, 2009"}, {"Title": "Another Terrific Canon", "Author": "Jay Powell", "ReviewID": "R1VM0AON693GG", "Overall": "5.0", "Content": "I use Nikon SLRs, but I have always chosen Canon \"point and shoots\", because of their quality, high quality pictures they take and simplicity of use.  The SX200IS takes the point and shoot up a few notches with sophisticated features to please most photographers.  You can still set it on auto and let the camera make all decisions for you, but you can also set it on full manual like any SLR and set the shutter speed, apeture and flash to satisfy your creative side.  I even experimented with the camera's movie taking ability and found it easy and fun (I did not read the manual first).  Many reviews take issue with the flash popping up and down as the camera goes on and off, but come-on, if this is your biggest complaint it must be a good camera.  You adjust to your finger getting \"tapped\" as the flash cycles up and down.  I would buy this camera again.  The only negative is it is slightly larger than my last Canon point and shoot, but that can be attributed to the capable (and great) zoom lens.", "Date": "June 11, 2009"}, {"Title": "So far so good.", "Author": "Benny", "ReviewID": "R38R286BMAL26J", "Overall": "4.0", "Content": "Fairly good pics. I have a 40D, and its not going to compare to and DSLR. But I wanted a point & shoot that would do fairly good video. I took some sample videos, and was happy with the quality. [...]I think the fact that the flash pops up ALL the time is stupid. It should only pop up when the flash is needed/operated. I would perfer the flash to be integrated, IN the camera, instead of popping up, but that is the price that you pay for the extended zoom. Else you'd get a really bad shadow.The ON button is in the absolute WRONG place.The screen is nice. The macro and supermacro are AMAZING. I was able to focus on an item literally 1cm away from the end of the lens.The ability to do manual settings on a P&S; is great! I love the dial on the back, vs 4 arrows for navigation.My last P&S; was almost 9 years ago, I have only had DSLRs since, and I'm pleased.I would give this a 5 if the flash wasn't ALWAYS up and if the ON button wasn't where it is.", "Date": "April 15, 2009"}, {"Title": "Nice Camera .... but", "Author": "jerryk \"Jerry\"", "ReviewID": "R3AV6FLM7R2DD4", "Overall": "4.0", "Content": "For a point and shoot, this camera is the cream of the crop.  Huge optical zoom...manual settings, large LCD screen.I bought this to carry with me while jogging ect...when I don't want to haul my 40D and 100-400 lens around.  Using a 40D and L series lens as a comparison, this camera doesn't do that badly.  By far the best pictures I've seen come out of a point and shoot.  In good lighting, if you know what you are doing, the 12X lens does an outstanding job.Now for the but.....I was worried about the large lens when I purchased this camera.  Each time you turn power on, the very large lens is extended out of the camera as the lens is initialized.  If this fails....you have a $350 dollar paper-weight.  Sure enough, after about 3 months, I turned this camera on and it said \"lens error, restart camera\".  I had to send it to Canon repair to be fixed.To be fair, it was repaired under warranty, and the process to send it in was quick and fairly painless, but it does point to a weak spot in the design of this camera.  If you want a small camera format, with a big optical zoom, there's a price to be paid.  That price is a dicey lens mechanism.", "Date": "September 21, 2009"}, {"Title": "Wonderful outdoors. Terrible indoors.", "Author": "Kevin Nicholls \"jaded, aging hipster\"", "ReviewID": "RKYAK4AGYNQUF", "Overall": "2.0", "Content": "Our \"big\" camera is a Canon Digital Rebel XSI with several lenses and speedlites. But that's not really something you want to carry around all the time, so I picked up the PowerShot SX200 IS as an upgrade from our aging Canon PowerShot SD500, hoping it would bridge the gap between the Canon SD series and an SLR.Initial impressions were very good. The SX200 is built very well and feels quite solid. There were no loose or creaky parts, and while the popup flash is annoying at first, it doesn't take long to stop putting your finger over it. In terms of size, it was bigger than our old SD500, but not as big as the PowerShot A series was.Start up time is incredibly fast. You can start taking pictures almost as fast as it takes to move your finger from the power button to the shutter. However, this was where the wheels started to fall off. If you turn on any of the features (face detection, blink detection, etc.) the delay between pictures is nothing short of infuriating -- and this is with a Class 6 Sandisk Extreme III SDHC Card that we normally use in the SLR.Outdoor pictures were quite good, with reasonably true colors and little distortion. The 12X zoom was responsive, tracked well, and distortion was reasonable at full zoom.Indoors... Unless you're really close to your subject, the SX200's indoor performance is nearly hopeless. The small flash is just too small to be useful in most situations. No amount of tweaking with the settings can change that the flash just doesn't have the ability to fill much of anything. So, indoor pictures in medium light have somewhat clear subjects, but the remainder of the pictures turned out grainy. In low light, subjects appeared to be standing under a spotlight in a tunnel. As such, using the zoom indoors is nothing short of an exercise in futility.Keep in mind, my basis for comparison is an SD series camera that's nearly four years old, not the SLR. And using an SLR, going in to full manual mode was not difficult or mysterious. The SX200 simply has an abysmal flash, and that kills the functionality of this camera.", "Date": "January 14, 2010"}, {"Title": "Lens Error", "Author": "Smartbox7", "ReviewID": "R12P5XCBBOTT0Y", "Overall": "1.0", "Content": "It's a great camera when it worked.  I was one of the unlucky ones who got a lens error.  Had it for 1 year.  Oh well.", "Date": "March 21, 2011"}, {"Title": "Sx200 lasted about 20 months and now DOA", "Author": "W. Lindstrom", "ReviewID": "R14F9UVN0314QJ", "Overall": "1.0", "Content": "First have to start by saying the camera has experienced a known flaw in Canon software \"lens error, restart camera\" where the lens is in the open position and stays that way. At this point the camera is useless and becomes scrap.  Unfortunately I have found out too late to avoid this purchase but certainly will avoid Canon products in the future. There are many claims and comments online having this same problem across multiple models of Canon products. This camera is in like new condition but Canon states this problem typically is the result of abuse.I can only say that while this camera worked it did take wonderful photographs, the face tracking worked well and color, focus were both well done and accurate.  I honestly cannot go on too long with the merits of the SX200 since it is now dead for no more a reason than that I turned it on.", "Date": "March 7, 2011"}, {"Title": "It's ok, but I expected More", "Author": "Eric Ruth \"Eric R\"", "ReviewID": "R21VIRGMQKF8C8", "Overall": "3.0", "Content": "I got this camera about 6 months ago, as a replacement for my SD600, which is a 5mp Elph Camera which I liked very much.  I bought this camera because it had a 12x optical zoom, and it was 12mp, which I assumed would be a great step up from my SD600.  I was right about the zoom,  It's awesome.  I also shoot with a T1i DSLR, and this camera has about the equivilent of the 250mm zoom, which is great.  For outdoor pictures in good light, it takes very nice pictures.  Take it inside, and try to take pictures with moderate indoor lighting, and it all goes to \"h e double toothpicks\"  The colors are aweful, and the camera immediately jumps to iso1000 or iso1600, and the pictures become grainy and green/yellow (in other words...terrible)  I've since put this camera on a shelf, and purchased a used SD880, which is much more like my SD600, and i'm much happier with the pictures.I would have had this camera on craigslist already, if not for one thing.  VIDEO.  This camera takes AMAZING 720p Video.  It's absolutely the best I've ever seen from a P&S; Still camera.  That said, the video does have drawbacks.  It won't use the optical zoom during shooting.  Once you start a video, if you want to zoom in, you get \"digital zoom\", which kills the video quality.  If you zoom in before you start shooting, the camera will make use of the optical zoom, but then you can't zoom out until you've finished shooting your video.", "Date": "May 22, 2010"}, {"Title": "Great camera", "Author": "Bobby J", "ReviewID": "ROJHR0HUD7ALU", "Overall": "4.0", "Content": "I've owned four digital cameras before this one; three were Canons.  I have been consistently impressed and satisfied with the cameras.  I got this to replace a (very well-built) Canon A620.I'm a basic camera user.  I like taking pictures and videos, but I'm not a good enough photographer to worry about the minor details and settings.  This camera is pretty good at taking pictures on Automatic, and the scene settings are great.  I usually get some arguably amazing pictures, but that's mostly thanks to Canon's cameras more than my skill.  But conversely, I sometimes get some pretty bad ones, usually due to waiting for a camera to respond or set up a shot, or just Automatically choosing a wrong setting.  Though I'm sure if I took the time to learn more, I could eliminate some of these problems.  I really only use Auto or Night, but if I did choose to go more in-depth, I'm sure the details would be fantastic.Pros:-The zoom is spectacular.  12x OPTICAL zoom is amazing.-Very good night pictures, even on Auto-Colour is vivid and beautiful-Automatic Macro focus is sometimes very useful-The HD video is great.  I mean it's no Planet Earth-quality video, but my first camera had 15fps 480x320 video, so this is a huge improvement-Photo storage is efficient.  I can save many more pictures and much more video per GB than on previous cameras, even set at 720p video-Survived a 1m fall, with no noticeable damageCons:-I frequently find myself wishing I could force a flash in Automatic mode-The manual settings are difficult to use, even to try to force a flash-It's easy to automatically move the scene dial, which sometimes means being in unfamiliar settings-Automatic focus isn't as good in low-light situations-Auto focus also isn't too good in Macro with zoom.  Macro is best used up-closeNeutral:-The camera is bigger and bulkier than I had expected, but is not terrible.  It's just small enough to fit in my jeans pocket, but is a tight fit.-Battery life is good.  I haven't had a chance to go anywhere touristy yet, but it lasts probably a whole day under moderate-heavy use.  I prefer cameras with AA batteries which I can replace on-the-fly and not have to wait to recharge.  A second battery would partially solve that problem I suppose.Overall, a solid camera that provides great results.  Definite recommend to anyone who wants a great camera and can't yet afford or justify a DSLR.", "Date": "March 22, 2010"}, {"Title": "Real Bargain!", "Author": "B. DEGER", "ReviewID": "RFXKI3FWS318A", "Overall": "4.0", "Content": "I purchased this camera app. 4 months ago and every time I use it, I just find something new and amazing about it. This user friendly canon makes photographing so easy and fun. Everyone thinking to have a semi-professional camera should buy it. This is a confession of a longtime nikon fan...", "Date": "February 22, 2010"}, {"Title": "Pleased thus far!", "Author": "Sydney Brown \"AB\"", "ReviewID": "RR6O9CXM6NFSN", "Overall": "5.0", "Content": "I'm a simple point and shoot kind of girl and this camera delivers!So happy I didn't go with another camera, my CANON is excellent. No horror stories...yet, just beautiful, clear, crips, beautiful images. And that's just point and shoot!Can't wait to figure out all the bells and whistles. Whenever I show friends pics, they always ask what kind of camera I'm using.", "Date": "February 14, 2010"}, {"Title": "Freaking AWESOME! I can't believe it is point and shoot cam!", "Author": "Alex Vox", "ReviewID": "R4MXB6OCVU90I", "Overall": "5.0", "Content": "I am experienced photographer with successful history of international competitions who was on a market for smaller camera which could travel with me most of time. I own also sx110is and say it is very decent cam for the money. I read reviews about sx200is and ordered it from Amazon indirectly (I earned some points with thankyou program). I must say after I received the cam ( about 2 weeks) I can't believe the level of technology and finesse Canon packed into this cam.First of all it produces nice images with grate picture quality. On ISO levels below 400, in good lighting conditions  it is better or equals than Pentax k10d!!!! I shot number of shots on the same focus length and I was amazed to see images coming out of this came. I need a camera for mostly nice lighting days and this baby outshoots any other camera in 12m level! Yeh, you can get some slightly nicer shots with DSLR setup of $1200 body and $3000 worth of lenses but man, let givea credit where the credit is due!The physical quality of cam is another song to sing! It is real JAPAN made cam (sx110is) is China made, and while I like 110 a lot for its value and capacity, the all metal body of sx200is, its amazing \"clicking wheel\", the lens are out of this world. If you buy DSLR, to match this level of optical performance, you must be prepared to cash out a lot!Video out of this cam retires to hell my little camera I was using. In good lighting the quality of HD 720P out of this baby is to be seen to be believed. I really appreciate that canon went toward smart 720p in this cam and  not 1080i for many reasons.I must say, I am greatly thankful to Canon for making such amazing quality unit so inexpensive. I handle it in my hand as a jewel. Really amazing tool, amazing cam, outstanding engineering.", "Date": "January 30, 2010"}, {"Title": "Great Little Camera", "Author": "K Hanson \"K Hanson\"", "ReviewID": "R22EVRT635IA4X", "Overall": "5.0", "Content": "I am a professional photographer and wanted a little camera to keep in my purse.  After a lot of research I selected this one.  I am happy with my selection, it foots the bill perfectly.  I don't have to carry my big camera bag with me all the time.", "Date": "January 30, 2010"}, {"Title": "Amazing camera!", "Author": "Henrique Pimentel Reis \"Henry Reis\"", "ReviewID": "R1BCIB4PN87MRF", "Overall": "5.0", "Content": "I bought this camera after an extensive research. I read hundreds of reviews and I was sure it was the best camera available on the market in its category. After two months of use and more than a thousand pictures later (thanks to a great honeymoon, I must say!), I can say this camera is AMAZING.For a great detailed explanation, please read the \"Rebutting the Cons, April 3, 2009\" review by Jacqueline Buemi. It explains perfectly why this is the best camera you could possibly buy.Buy this camera, you won't regret it.", "Date": "January 26, 2010"}, {"Title": "Captivated", "Author": "Ben", "ReviewID": "RH39EEZKP3QDI", "Overall": "5.0", "Content": "Purchased this one because porting my digital SLR (Rebel) with lenses, etc, became a nuisance during business travel.  Yet, I wanted versatile and high-quality optics.  I am truly amazed by this instrument and lens in particular.  28 mm aperature, wide angle and a phenomenal 12x optical zoom.  The best optics I've ever seen on a point-and-shoot camera.  Battery life has been great; the LCD display is huge.  Have not tried the video capture yet but have used for several hundred still shots already and I'm captivated by the quality from the macros to the wide angle to the zoomed-in shots.Includes many of the programmable settings of my SLR so I rarely use the Auto or Easy settings.  But for novices, I assume these settings are fine.Transfer software is a little goofy (I'm used the EOS software for my SLR). So I don't use it.  But the SD card can be read directly by my PC (unlike my Rebel which wants to reformat between the camera and PC).Highly recommend this camera to anyone who wants uncompromised quality. Assuming you have some basic photography skills, the output will be superior.", "Date": "December 9, 2009"}, {"Title": "Amazing!", "Author": "Napaloo", "ReviewID": "R14GHWALG3ACZU", "Overall": "5.0", "Content": "This camera is absolutely fabulous! It shoots amazing video at night, and gets great crisp colors mid-day at the beach (no wash outs!) The zoom even caught individual whiskers on seals I shot swimming in surf a couple hundred feet from the beach and unblurred shots of flying pelicans!If there is one thing that could be improved on it's the editing software for this camera, it's really bad. Then again, most camera software is inadequate in alot of ways, or the company will screw it up w/updates if it's not, so this really isn't a big deal. This camera is worth every penny!", "Date": "September 10, 2009"}, {"Title": "THE ULTIMATE COMPACT DIGITAL CAMERA !", "Author": "Thomas A. Gioia", "ReviewID": "R52UYLG47I0O6", "Overall": "5.0", "Content": "The Canon PowerShot SX200IS met and exceeded all my expectations. The photos are crystal clear and the 12X optical zoom is a fabulous feature not found in many compact cameras. Overall a great purchase!", "Date": "August 31, 2009"}, {"Title": "Best in Class", "Author": "4play", "ReviewID": "RNEQ2UZLU8TK4", "Overall": "5.0", "Content": "I read a lot of reviews for point and shoot digital cameras. The Canon PowerShot SX200 received high marks in all of them. I would have to agree. This is a great camera. The zoom is incredible and the picture quality is outstanding. It has tons of features of which many I may never use, but the auto mode is fine for most photos I take.  If your in the market you can't go wrong with this camera.", "Date": "August 16, 2009"}, {"Title": "Everything I hoped for.", "Author": "Christine W. Loxsom", "ReviewID": "R29EN4UH1W3E7T", "Overall": "5.0", "Content": "It's easy to use and takes incredible pictures.  Can point and shoot on auto or use other features.  Battery life is great.  Took some really great recordings as well.  Very happy with the new camera.", "Date": "August 10, 2009"}, {"Title": "Good, versatile camera - point-and-shoot plus some", "Author": "Jimmy Parsons \"jimus83\"", "ReviewID": "R38UTK97177KWQ", "Overall": "5.0", "Content": "We bought this camera as a gift for a relative, so my review will be limited to the short time I've looked at it. It was bought to replace an aging Canon Elph, for someone who doesn't necessarily use all the capability the camera has. One consideration was the large LCD. I like the long zoom, which allows close-ups of flowers and other subjects the owner will be photographing. The nicest new feature is the automatic switching the camera does between regular and macro focus distance. That really is a plus for someone who forgets to switch to the macro mode in close-ups. The only immediate weakness I notice is the weak flash, but that's not new to Canon point-and-shoots. This camera's opening the flash unit every time it's powered on is somewhat disconcerting, and my fingers typically were on the flash when it tried to open. I suppose you would get used to it. Overall a great-looking camera. We probably could have found similar features in a less-expensive Canon model, but the owner is pleased with this one.", "Date": "June 24, 2009"}, {"Title": "Flawed camera.", "Author": "Felonious", "ReviewID": "RFHDGMSP2JTHA", "Overall": "1.0", "Content": "Had the camera for about six months now. Very happy at this point that I bought an extended warranty.Anyway, I'm not sure if its a problem with just my camera, but from day one I have had problems with the camera not focusing correctly. If anything is in motion at all the picture is blurry. Even staged portraits often come out blurry. I love the zoom ability of the camera, but couple it with the focus problems and it is darn near useless. When the pictures do come out, they come out very nice, but this camera does have problems with low light situations. Additionally, the battery life sucks. I shot around 100-120 pictures in around 1.5 hours and had to change the battery... sounds like a lot of pictures, but really its isn't when half of them are out of focus.Last weekend, the camera started having other problems. You look at the display on the back and the image on it shifts left and then right over and over again. I mean big jumps that could take half your subject out of the frame. Put an ear to the camera body/lens and you can hear it constantly adjusting when it is doing this. So, returning this piece-o-junk today... not going to get another one if I can help it.", "Date": "October 12, 2009"}, {"Title": "The most versatile ultra-zoom comact camera", "Author": "William D. Bygrave \"Beach&Garden;\"", "ReviewID": "RLUMS7WO6ENQM", "Overall": "5.0", "Content": "First let me say that in either automatic or manual mode the SX200 takes stunning photographs in both bright and dull light, and its night shots are marvelous.Here are the features of the camera that I like (in no particular order of preference):- i-Contrast , which brings out details in dark areas of an image.  It can be used either before or after taking a photo. I live by the ocean where seascapes and landscapes often have a wide range of bright and dark areas.- Editing colors in the review mode.  I take lots of photos of flowers, generally using the \"foliage\" mode; sometimes an image is improved when switched to \"neutral\" or \"positive film\" colors.- Trimming photos in review mode.- Fast, smooth, and precise zooming.- Manual focusing, especially the distance scale shown on the LCD.  But it takes practice to get proficient using the manual focus.- Manual aperture control.  I like to have maximum depth of field in my seascapes and landscapes, for which I always use f8, the SX200's smallest aperture.- Manual shutter speed control.  I take lots of night scenes, usually with a tripod, so I often use exposures of several seconds at ISO 200, where noise is not noticeable.- The image stabilization is the best I have ever used.  Shots at shutter speeds as slow as 1 second have little or no visible camera shake.- The wide angle lens is nice, but it would be even nicer if it were wider.- 12 Megapixels are valuable when using digital zoom to extend the telephoto range beyond the maximum optical range of x12.  At 12x optical & 2.5 digital (x30 total) with ISO100 the SX200 produces excellent 8\"x10\" photos and very good 11\"x14\" ones.  Digital zoom on this camera is fantastic compared with my previous digital cameras.- The LCD screen is sharp and easy to see in bright sunlight.  Manual brightness adjustment with the display button takes only a second.- Function hints that appear of the LCD are helpful and easy to read.- The SX200 has a stylish body made mostly of metal; it is comfortable to hold; and it is manufactured in Japan.- The camera fits snugly in a Zing case, which in turn fits comfortably in my pants pocket.  There is even room in the case for a battery, memory card, and a lens cleaning cloth.- The software for transferring images to a computer and then editing them is user friendly.  I fine tune most of my images with the first level of editing: auto adjustment, color levels, brightness, contrast, sharpness, trim, tone curve, and red eye.  I rarely need to go to the external editor.- The battery charger is elegantly simple.- Unlike some other reviewers, I actually like the SX200 User's Manual.  It is better than other Canon manuals that I have used.  I read most of the manual during the 2 hours while I was waiting for the battery to be charged up.- Red-eye with indoor flash shots is less frequent with the SX200 than the Elph SD850; perhaps because the flash is farther from the lens.  I can optimize flash pictures by adjusting the flash power and/or aperture, and ISO.And here are some SX200 features that could be improved to make an excellent camera even better:- The plastic door on the output socket compartment feels flimsy and needs to be shut carefully.- I would happily trade off the maximum focal length to get an even shorter minimum focal length (wider angle lens) such as the x12 lens on the Panasonic DMC-ZS3.- I'd like an ISO higher than 400 before the image gets noisy.- A minimum aperture smaller than f8 would be valuable.- I'd prefer a manual flip-up flash rather than one that pops up automatically when the camera is switched on.- No live histogram; but one is displayed immediately after every shot when the \"review information\" is set on \"detailed.\"- The wrist strap is not Canon quality.  Mine frayed after only two weeks and 1,000 photos.- Longer battery life (I always have a fully charged spare battery on hand.)(I never use video so I am unable to comment on those features of the SX200.)Summary:  This is a terrific travel camera for a photographer who needs an ultra-zoom compact with both manual and automatic controls.  The SX200 is not perfect but it comes close.  I bought my SX200 at Amazon for $325.  For my requirements, it is better value than its nearest rival,the Panasonic DMC-ZS3, which might be a good choice for a beginner with no intentions of progressing beyond automatic snapshots or a person who wants a compact point-and-shoot ultra-zoom without manual controls and is willing to shell out at least $425.", "Date": "June 15, 2009"}, {"Title": "Research, read, compare, prioritize and take the fall.", "Author": "J. George", "ReviewID": "R3BRJTH97REZ6G", "Overall": "5.0", "Content": "The SX200 is for keeps. Its not a perfect camera, its a point n shoot, a very good P&S.; It has 12x zoom and 12 MP. Following is the competition and why I opted for SX200 :-1. Canon SX10 - Too bulky, too slow to startup2. Panasonic ZS3 (TZ7 in Europe) - Zilch manual controls(but ZS3 has optical zoom in video, SX200 doesnt have that)3. Nikon P80 - Very poor indoor shots, too bulky, average reviews overallAs for the SX200, startup is real quick, zoom is great and hyperactive kids stay in the frame :).I noticed some noise while zooming in low light, but thats okay. Check out the 2 pics I uploaded from my Lake George Trip over the Memorial weekend this year.", "Date": "May 20, 2009"}, {"Title": "Another Lens Error", "Author": "yanstep", "ReviewID": "R1UCIV7PNUUUME", "Overall": "1.0", "Content": "I really am a fan of Canon cameras and was quite happy with the performance of this camera until I got the lens error, which turned this camera into a paper weight. I hadn't dropped or abused this camera at all. Last photo was taken in a restaurant, so it was a clean environment. Then, I saw a nice sunset and tried to turn on camera and the lens would not extend. Since the camera is out of warranty (had it about 18 months), I took it apart to see if there was anything obvious. After removing the covers, the lens assembly looks to be pretty much sealed. There is a slight clunk inside the lens when shaken. I had a S50 before and that worked, even after my wife dropped it on concrete from about 4 feet. The SX200 was taken very good care of, and always kept in a padded case between uses. I don't know what could have happened to my camera, but honestly I'm thinking that there is a design flaw with this one. It is a great camera when working.", "Date": "May 31, 2011"}, {"Title": "Another Failed Lens Victim", "Author": "monomomo", "ReviewID": "R1KUIWGDT1NDSZ", "Overall": "1.0", "Content": "Like so many others before me, I, too, found myself with a lens that would not retract, no matter what I did.  Totally disappointing.", "Date": "May 16, 2011"}, {"Title": "White balance and color fidelity are poor", "Author": "ITE", "ReviewID": "R2HVLIN9Z1VXDV", "Overall": "3.0", "Content": "It's easy to get sucked into buying this camera for its outstanding zoom, but after using this camera for the last four months I would not recommend it.  It has a number of flaws which, while not obvious on the first use, become very frustrating.  In spite of being a supposed upgrade to the powershot I bought 5 years ago, this camera often takes worse pictures even after considerable effort to tweak the internal settings.Issues:1) While the 12X zoom at first seems very impressive, in practice it is impossible to hold the camera still enough to keep the image crisp.  Without using a tripod, one can only effectively get something like a 3-6X zoom.  (With a tripod, the 12X is very impressive on such a small camera!)2) The auto white balance in the camera is very poor.  Taking pictures without modifying any of the internal settings often yields photos which look washed out or completely dark.  It is true that one can \"fix\" this problem by turning on the manual white balance mode and setting it by hand for every photo.  This is quite a pain considering that white balance is usually handled automatically without problem by most cameras.3) The camera cannot accurately capture the color purple.  This problem cannot be solved with any amount of tinkering with the internal settings.  Take a picture of a purple wildflower and look at it later on your computer and it will be blue. (It's also obvious that the color purple is off in the LCD viewfinder).  Had I been more careful in my research, this defect is visible in the sample images on Imaging Resource in the pictures of the Macbeth color checker which appear unsaturated in the purple square. Thus, I don't believe that this is an issue with just my camera.  It is also not easy to correct this issue using Photoshop afterward.", "Date": "May 1, 2011"}, {"Title": "Amazing Camera", "Author": "M. Jaworski", "ReviewID": "R1G5ZMQX0RNR1P", "Overall": "5.0", "Content": "Amazing camera in such a small package. Only complaint is that the dial on top to change shooting modes is hard to read (symbols are small and not intuitive). With time you get used to it, but other cameras are easier to select modes with. Pictures are fantastic. Great picture quality in automatic mode, but also lots of flexibility for more advanced photographers.", "Date": "December 8, 2010"}, {"Title": "Dissapointed", "Author": "Patrick Clancy", "ReviewID": "R264IX1OBPND1D", "Overall": "1.0", "Content": "I bought this camera a year ago and loved it, but as the lens was opening the other day I got an error message saying \"Lens error, restart camera\".  After some internet research it looks like this is a common problem that Canon knows about, but won't aknowledge.  Looks like I am going to have to buy another $300 camera, but it won't be a Canon.", "Date": "August 10, 2010"}, {"Title": "Great for the Price and Capabilities", "Author": "S. Li \"O.o\"", "ReviewID": "R1SA7YC6Y40G52", "Overall": "4.0", "Content": "1. Big LCD (3 inches)2. Very sturdy construction (run over by a car and the only damage is some scratches on the metal backplate. I don't recommend this... I only found this out by accident, heh)3. 12x optical zoom that goes up to 48x with digital zoom (still really good photos if you can hold the camera really still. Image stabilization helps with this)4. Good picture quality (not GREAT pictures but good ones. Not the crispest pictures around, which is apparent once you select the \"actual size\" option on your PC. You also see some softening at the edges)5. Manual mode (shutter speed ranges: 15\"-1/3200; aperture ranges: f3.4-f8.0. Shutter speed can be set to 1/3200 BUT you'll almost never end up using this option as the aperture only opens as wide as f3.4 so you'll almost always get extremely underexposed photos. The light meter assists in helping you select the aperture and shutter speed but in my opinion, it's best to let the Auto and scene modes handle the aperture and shutter speed.)6. Lots of neat little features that aren't unique to this camera but are nice to have (facial recognition, lots of scene presets, picture stats, etc)7. HD 720p video capture capability (excellent quality. 1280x720 resolution)8. Looks good and a bit chunky but that's fine... I like my 12x optical zoom9. $264 at time of purchase (pretty good price for a camera with so many features)Not the most comprehensive review out there but I hope this helps :)", "Date": "July 4, 2010"}, {"Title": "Amazing Camera", "Author": "W. Stirgwolt", "ReviewID": "RAQCMKI42PT6", "Overall": "5.0", "Content": "This is a great camera.  Large camera features and functionality in a small package.  Zoom and lens stabilization are super.  Image quality top notch.  Good battery life.  And it all fits in your pocket.  No regrets buying this camera.", "Date": "April 19, 2010"}, {"Title": "Fast, great images. Excellent Zoom!", "Author": "Jitesh Mehta", "ReviewID": "R1UGFRXMZVEQJ5", "Overall": "5.0", "Content": "Title says it all.Only drawback is that it does not have a viewfinder so you cannot conserve battery by turning off the LCD.", "Date": "March 8, 2010"}, {"Title": "Produces high quality pictures, wonderful colors and I never had any problem with this camera.", "Author": "Rona Gail Cho", "ReviewID": "R3XX06K86YN1F", "Overall": "5.0", "Content": "I got this as a gift from my father last November. I'm using this until now and so far I have never encountered any problem with it. Picture quality is superb! I even have some pictures which can be mistakenly taken by a DSLR. I especially love how I can set the settings manually (such as the focus, aperture, shutter speed and color)and the great number of features I can choose from! Recording video is really not bad considering I am using a device which mainly functions as a camera and not as a camcorder so I suggest you don't complain about it at all. With proper lighting, video quality could be really great. When it is dark though, of course the result would be grainy, as any other video camera or camera (on the same price range) would result to.One great feature is the panoramic shots you can create using photostitch, a software included when you buy the camera. You can merge 3 or more photos into one using this and it is very user friendly too!I highly recommend that you buy this camera and try it out for yourself. It is great for people who want to try photography as a hobby but wouldn't really want to invest too much on it. It will give you a great and hassle-free experience!Here is a sample of a picture I took using this camera. It was taken at night with personalized settings and automatic flash. [...]", "Date": "March 8, 2010"}, {"Title": "Canon SX200IS", "Author": "Robert C. Koestler \"Saroko\"", "ReviewID": "R2RDTEEEI43BA", "Overall": "5.0", "Content": "This is a fabulous camera. Who needs an SLR? This one does everything. The IS is superb. I have taken portraits of people 50 feet away in dimly lit rooms. I use ASA 3200 for a lot of indoor work and get pictures not too noisy that are quite suitable for internet slide shows. I seldom use the flash.Excellent battery life, easy to carry.My only complaint is the time between pictures is a few seconds.", "Date": "March 7, 2010"}, {"Title": "Love the Canon", "Author": "Kailee Erlandsen", "ReviewID": "R1KKQOESUDCLH9", "Overall": "5.0", "Content": "My husband and I had a Nikon Coolpix until I accidentally put it through the washing machine. We hated out coolpix, so ruining it with the washing machine was a great excuse to get a new camera. After researching different cameras in our price range, we decided on this one. And it's worth the money! We love it. It takes great pictures, is easy to use and we can't find a single thing we don't like about it!", "Date": "February 10, 2010"}, {"Title": "The compact camera with more professional features", "Author": "G. Arteaga", "ReviewID": "R326AAENNF2ZO2", "Overall": "5.0", "Content": "Has more variables to adjust and personalize than comparable offers from other brands.", "Date": "February 4, 2010"}, {"Title": "Manual controls make this an outstanding camera", "Author": "A. Tegtmeier", "ReviewID": "R1M01Q6YBSB8Y4", "Overall": "4.0", "Content": "I own four digital cameras, each with a specific area of use.This camera is used for drive-by-shootings - I drive through the landscape and take pictures of opportunity. I usually only use my SLR for planned pictures, because it is too bulky to carry with me all the time, and if I only take a few pictures during those tours, it is not worth the weight to carry around.The SX200 fits this profile better - it is smaller and lighter as a SLR, yet has many manual controls, that other compacts lack. I predominantly use the aperture priority function, as I do with my SLR, to keep control over depth of field. It also has time priority and complete manual settings, which makes it an ideal camera for those of us who like to keep control over their settings. It also has HD video on board, which is a very nice feature, although I only use it very occasionally.The lens is sharp and the 12x zoom factor is very useful.The color rendition is superb, with very neutral and clear colors outdoors (I haven't used it indoors yet).The visual noise is acceptable and the only quality issue I have with the pictures is that the resolution could be higher for a 12 MP camera.But other than that, I love the camera, it fits my needs perfectly and though it is a tad bulkier and heavier than the normal compact camera, it is still small enough to be carried around in your jacket pocket.Only small annoyance is that the flash always pops up when you turn on the camera, regardless if you need it or not. For the first few instances, this can be extremely puzzling, but I got used to it and my fingers do not get in the way very often anymore.Battery life is tolerable, about 250 shots without flash.The LCD screen tends to very grainy in low light conditions, but in daylight it produces a picture that is very clear and with accurate colors.The camera starts almost immediately and shutter lag is usually not an issue either.Pros: very good picture quality, adjustable settings galore, HD video, large zoom factor, very good color accuracy.Cons: somewhat bulky (but still smaller than a SLR), annoying pop-up flash, grainy LCD screen in low light.So why no 5 stars? Because of the pop-up flash and the less than superb resolution. Both things could be an easy fix in a newer version ...", "Date": "January 14, 2010"}, {"Title": "Amazing Zoom Camera", "Author": "MICHAEL MCDANAL \"Midan\"", "ReviewID": "R2169KJITF5G53", "Overall": "4.0", "Content": "A great camera far as picture quality, zoom range and ease of use. However, the constant flash popping up is a pain and the camera is difficult to hold one handed. It needs some sort of a side hand grip to make it easier to grip when using.None of these minor drawbacks is enough of a reason to not buy this well made camera.", "Date": "January 11, 2010"}, {"Title": "Best I've ever owned!", "Author": "Lynette Hettinga \"Miss Pavarazzi\"", "ReviewID": "R15936I4VSQXVJ", "Overall": "5.0", "Content": "It is so easy to use! But also take the best pictures of any camera I've ever owned! The pictures in low light have even turned out! I haven't even had to use anything but auto yet! If I try manual who knows how much more I can do! The zoom is so much more then I've got with any other camera. LOVE IT!", "Date": "January 9, 2010"}, {"Title": "Love it", "Author": "Casual nurse", "ReviewID": "R3EOX06D46Y4BL", "Overall": "5.0", "Content": "I have had many Canon cameras, but this one is the best. Very easy to use and review pictures. The large screen on the back is awsome. Easy to delete, zoom, and pictures are true to color. Have not tried the movie part yet co can't evaluate that part. Takes good pictures in low light and sunset pictures are great on the sunset setting. Transferring pictures is easy and necessary cables came with the camera. I did alot of research on cameras and the 12x zoom was a big selling feature for me. You can stand far away and get a more natural picture when taking pictures of pets or people without a pose.The pop up flash that everyone talks about is anoying but not a big deal. I recommend this camera to everyone!Shipping was fast and in less time than advertised.", "Date": "November 5, 2009"}, {"Title": "Canon Powershot SX200IS", "Author": "Peter A. Lewis \"Pete Lewis\"", "ReviewID": "R3P2F5O17I14YK", "Overall": "5.0", "Content": "Excellent camera.  I was looking for a 12x zoom that would fit in my pocket, and this is it.  I only wish it had a viewfinder.", "Date": "November 2, 2009"}, {"Title": "SX 200 is", "Author": "A. Brinkland \"rip rap rup\"", "ReviewID": "R2GZM8SLJ1DUE0", "Overall": "4.0", "Content": "I really miss the view finder. It is very hard to find moving targets using the LCD monitor. This camera is also a bit slow when taking action, like soccer photos, I rarely seem to hit the target shot.For other types of shots this camera is great and the color is just fantastic.Like other cameras the menu gives you a wealth of possibilities, if you are an expert. I wish that the right hand grip was rough and not smooth, and the always unfolded top flash when camera is on, is a constant nuisence. The 12 power optical zoom is great.", "Date": "October 24, 2009"}, {"Title": "Canon SX200 IS", "Author": "Me", "ReviewID": "R3CFDOBL8NCU9M", "Overall": "4.0", "Content": "I have only had the camera for a few weeks and haven't had much time to play around with it, but it's quite simple to just pick up and start taking pictures.  So far I have been very impressed with both the still picture and video options.The one drawback that I have noticed is that when I am taking pictures, if I am holding the camera with one hand instead of both hands, I frequently hit the \"play\" button which displays the pictures already taken.  There have been many times when I am about to take a great photo of our kids and then it switches to the play setting and I lose the opportunity to take it.  The button is just in a bad place on the camera.  That is the only drawback I have found so far.  Other than that, I am very satisfied with the camera.", "Date": "October 11, 2009"}, {"Title": "Top quality video for low price", "Author": "Betty \"Scuba Betty\"", "ReviewID": "R10RUJ245I831D", "Overall": "5.0", "Content": "I was stunned at the quality of the HD video and the zoom photos on a safari in Tanzania.  The 12X optical zoom and image stabilization from a moving vehicle while photographing lions, rhinos, cheetahs, etc. was unbelievable!  Other members of my safari want copies of my video and photos.", "Date": "October 3, 2009"}, {"Title": "Really good", "Author": "one shot", "ReviewID": "R3BHRN9EZC0NG3", "Overall": "4.0", "Content": "The camera is really good, with a couple of glitches. The glitches are slow to the next shot and a slight hitch in slewing the magnification.", "Date": "September 16, 2009"}, {"Title": "Finally, a perfect camera for my uses!", "Author": "Marjorie Schnapp", "ReviewID": "RILPZVZASJYS8", "Overall": "5.0", "Content": "I have worked my way through at least 5 cameras, used while traveling and for recording family events.  I always wanted at least a little more zoom capacity, while retaining clarity and ease of taking pictures.  This one fulfills my wishes perfectly, without the size and inconvenience (to me, at least) of putting on additional lens, etc.  The software that came with the camera also provides me with an easy way to trim, reduce red-eye and a number of other features.  This Canon PowerShot well deserves the 5 stars I've awarded it.  Incidentally, I discovered this particular model while talking to a fellow bus traveler in Mount Rushmore....we were so impressed with the viewing surface.  M. Schanapp", "Date": "September 9, 2009"}, {"Title": "Great camera but stopped working without warning", "Author": "L. Ryffel \"Photog Italia\"", "ReviewID": "R2G4MN6IN4A4AA", "Overall": "4.0", "Content": "I got this camera for a twelve week study abroad program in Europe, and got thousands of great photos.  The flash produces pretty natural colors, and the image stabilization works really well with the flash off.I did a thorough read-through of the manual and found most of the functions really easy to use.  I did generally shoot in auto mode, though.  The zoom has to be the best I've ever used.On the LAST DAY of my 12 weeks trip (luckily) I went to turn on my camera and the Canon symbol flashes on the screen, then a little message that says there is a lens error and the camera needs to be restarted appears, a green light flashes a few times, and the camera turns off.  This happens even when I try to turn it on in the picture view mode (without opening the lens).  Also, even when the camera is turned on my computer no longer recognizes it.  I have changed the battery and the memory card, and neither changed the results.  There must be a problem with the internal computer, but I will have to get a licensed repairman to take a look.Please comment if you have had a similar experience.", "Date": "September 6, 2009"}, {"Title": "Good but could use a better lens", "Author": "gawlfor", "ReviewID": "R3BYKJT2A6M9NQ", "Overall": "3.0", "Content": "I was very excited to get this camera. I've had Canon products in the past that I've loved, and I was especially excited for the 12x optical zoom. I've had it for 6 months now and must say I'm not as pleased as I'd hoped to be. The photo quality is ok, but my old SD 600 with 3x optical zoom and a Zeiss lens had MUCH more crisp pictures. This camera also seems to have trouble focusing at times, even when it's not zoomed out. I do enjoy the wide angle lens, and the zoom has gotten me many shots that I wouldn't have gotten otherwise. But really I'm overall dissatisfied because I want my pictures to be more crisp, and it's just not happening no matter how hard I try.", "Date": "March 7, 2010"}, {"Title": "Good camera", "Author": "M. Duong", "ReviewID": "R394NKLYK8P5KJ", "Overall": "4.0", "Content": "It's a very good camera overall.Picture quality is very good, but not as good as the Canon SD550.Zooming is excellent.The video quality is excellent in HD mode; however, it's very big in size (433MB for a 2'30\" HD video).The focus can't be changed during videotaping.It's a little bit too big for carrying in the pocket.", "Date": "December 9, 2009"}, {"Title": "12Mp/12x Power pocket camera", "Author": "Robert B. Hailey \"haileymon\"", "ReviewID": "R3JUSN2OUU18K9", "Overall": "4.0", "Content": "I bought this camera to replace my sd600 (which I love) I needed more pixels and more glass and I got both.The 12x zoom, while a bit twitchy zooming, is a wonderful thing. Now I can take the SX200 with me on motorcycle trips and leave my 30# bag of big Canon SLR's and lenses at the studio. It's quick to fire up but slow on the draw, ie, there is the inevitable shutter lag. The big screen is bright and clear, the HDMI video is crystal clear. (would like to be able to zoom during video recording) The super macro is incredible. I can put the end of the lens right ON the subject and the shot is clean and clear. Got an 8Gb card and a spare battery. (battery life is less than I'd like) Flash is weak but red-eye isn't a problem. biggest negative I've got is that I cannot shoot in RAW mode as I have gotten used to its flexibility. All in all, a great little camera.", "Date": "June 29, 2009"}, {"Title": "Wow!", "Author": "David", "ReviewID": "R1VZPLRZ7V1KOY", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo22GSCZRLF999GembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo22GSCZRLF999Grefresh_preplay() {\n\ndocument.getElementById(\"cv_mo22GSCZRLF999GchiDiv\").innerHTML = document.getElementById(\"cv_mo22GSCZRLF999GhiddenPre\").innerHTML;\n};\ncv_mo22GSCZRLF999Grefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo22GSCZRLF999Gso;\t   \n\n\nfunction cv_mo22GSCZRLF999GloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo22GSCZRLF999Gso = new SWFObject(swfLocation, \"cv_mo22GSCZRLF999GAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo22GSCZRLF999Gso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo22GSCZRLF999Gso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo22GSCZRLF999Gso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo22GSCZRLF999Gso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo22GSCZRLF999Gso.setAttribute(\"height\", swfHeight);\n          cv_mo22GSCZRLF999Gso.setAttribute(\"width\", swfWidth);\n          cv_mo22GSCZRLF999Gso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo22GSCZRLF999Gso.write(\"cv_mo22GSCZRLF999Gflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo22GSCZRLF999G', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo22GSCZRLF999G';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo22GSCZRLF999G', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo22GSCZRLF999GloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo22GSCZRLF999G\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3RV1WR9EFQL30\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3RV1WR9EFQL30\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1VZPLRZ7V1KOY\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3RV1WR9EFQL30/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo22GSCZRLF999Gduration')) {\n      document.getElementById('cv_mo22GSCZRLF999Gduration').style.display='none';\n    }\n    cv_mo22GSCZRLF999GloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo22GSCZRLF999GloadSwf(movieID, playerVersion) {\n   return _cv_mo22GSCZRLF999GloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo22GSCZRLF999GnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo22GSCZRLF999G', 0, h);\n}\n\nfunction cv_mo22GSCZRLF999GresetPlayer(w,h,bw,cc) {\n  cv_mo22GSCZRLF999GnewHeight(h);\n\n  cv_mo22GSCZRLF999Gso.addVariable(\"resetBandwidth\", bw);\n  cv_mo22GSCZRLF999Gso.addVariable(\"cacheCode\", cc);\n  cv_mo22GSCZRLF999Gso.setAttribute(\"height\", h);\n  cv_mo22GSCZRLF999Gso.setAttribute(\"width\", w);\n  cv_mo22GSCZRLF999Gso.write(\"cv_mo22GSCZRLF999Gflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo22GSCZRLF999GRollOverImg = new Image();\ncv_mo22GSCZRLF999GRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81fIPRx1thS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo22GSCZRLF999Gpreplay = document.getElementById('cv_mo22GSCZRLF999GpreplayImageId');\nif (cv_mo22GSCZRLF999Gpreplay) {\n  cv_mo22GSCZRLF999Gpreplay.onmouseover = function() {\n    cv_mo22GSCZRLF999Gpreplay.src = \"http://ecx.images-amazon.com/images/I/81fIPRx1thS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo22GSCZRLF999Gpreplay.onmouseout = function() {\n    cv_mo22GSCZRLF999Gpreplay.src = \"http://ecx.images-amazon.com/images/I/81fIPRx1thS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo22GSCZRLF999Gpreplay.parentNode;\n\n  var cv_mo22GSCZRLF999GcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo22GSCZRLF999GcurrentClick) {\n      return cv_mo22GSCZRLF999GcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 3:32 MinsGreat Camera. Great Price.", "Date": "January 30, 2010"}, {"Title": "Several years later, still amazing", "Author": "Escella", "ReviewID": "REA26BRMMS8RF", "Overall": "5.0", "Content": "I bought this camera from a Best Buy maybe 3-4 years ago, and I've come back for another one, because mine was stolen at summer camp.I never had the lens error everyone is complaining about.I dropped it out of my second story window while trying to take pictures of the rain, it tumbled down the roof and into mud. After I cleaned it off and got all the junk out of it, aside from a few scratches, worked flawlessly.I'd never even heard of the lens thing until now... Hopefully my replacement wont have that problem because I love this camera. I bought a newer canon powershot and the battery was crap. My old one never died. I could take pictures every day, and videos, on a week long vacation and never have to charge it!Buy this camera. It does amazing things and takes amazing pictures.", "Date": "May 23, 2013"}, {"Title": "Great Camera - Great Price", "Author": "Neil S. Swain", "ReviewID": "R1NBKAMWHAJ6HU", "Overall": "4.0", "Content": "I believe I caught this camera as the model was being discontinued, and I couldn't be happier. The price was fantastic and the only design flaw I don't care for is the spring loaded flash that pops up goes easily unnoticed before you turn the camera on. Just from the natural way of holding the camera, the flash can be held down by your fingers and cannot deploy. A small issue when you see the quality of pictures, especially in low light settings.", "Date": "February 1, 2013"}, {"Title": "Lens Error", "Author": "jessmith", "ReviewID": "R3ENB7MOFW5D7R", "Overall": "1.0", "Content": "Like SO many others, this camera was great while it was working, but then one day the battery died while the lens was open and that's when we too were inflicted with the notorious 'Lens Error- Restart Camera' issue. We've only had the camera for 2 years and during that time we've treated it very well. 2 years might be a long time for a cheap camera to work, but this is a nearly $400 Canon camera so we expected to get more time out of it. This is clearly a manufactures issue and it's incredibly upsetting that a company as well-known as Canon would produce, sell and then refuse to take responsibility for an issue that is clearly affecting so many of their customers.  If we'd gone the cheap route then maybe this would be something we'd expect, but this camera was NOT cheap. We won't be buying Canon products again in the future.", "Date": "January 5, 2012"}, {"Title": "Complete agreement with Ms. Jacqueline Buemi of April 3, 2009", "Author": "John", "ReviewID": "R2JZBYNFDZPWB6", "Overall": "5.0", "Content": "There is nothing I can add to Ms. Buemi's review, other than that I am a professional photographer and have sold images taken with the SX200.  It is the perfect pocket/dashboard camera - small, excellent quality in all areas, and easy to operate on a moment's notice.  One of her most valid points is:  READ THE MANUAL!  If you do this and apply the knowledge to your use of the camera, you will agree that Canon has done it again!", "Date": "September 10, 2011"}, {"Title": "Good High Quality Point and Click", "Author": "Craig W.", "ReviewID": "R1I3BYDURPOZ3D", "Overall": "5.0", "Content": "This is the first camera that I have ever purchased on my own, and the first digital one at that. That being said I carry this pretty much wherever I go just in case I find myself needing it. The design of this is amazing, from how compact it is to the shape of the the hand grip it all feels so comfortable. It's shaped in such a way that even one handed shots are easy and come out clear. The fact that it has 12x zoom makes it so much better, for the price you could not find a more equipped camera in this size range. With all of the various photo options from landscape to pets and kids there really is no function that this could not fulfill. Now the flash is hidden in a compartment that flips up when the camera is turned on and sometimes my finger gets in the way, but its hard not to notice when it's trying to pop up. It can also appear to be noisy when starting up, but I can't imagine any more so than another camera with a retractable zoom.  All in all this is a great camera for someone like myself who is new to the photography scene and just want to have something simple, but I'm sure even those who have had a camera before would love it as well.", "Date": "September 6, 2011"}, {"Title": "Great - as long as it's working...", "Author": "Katydid215", "ReviewID": "RMB65JKDOWT7X", "Overall": "2.0", "Content": "I received this camera as a gift from my father for Christmas, and we were all so impressed with it! It's probably been the best camera I've owned...that is until it quit working out of the blue one day. Yes...the infamous Canon lens error. I tried all the tricks I could find online to fix it myself, but to no avail. I broke down and called a local camera shop who chuckled when I told them the issue. They said they'd have to send it to Canon - apparently Canon doesn't authorize anyone to work on their cameras - and that the repair cost starts at $150 and goes up depending on Canon's determination of 'fault.' Basically, they'd send the camera to Canon for repair for $150, but I could walk away with a significantly higher cost at Canon's discression. The Camera shop recommended I just purchase a new camera. They were clearly unimpressed with this issue, which they were quite familiar with. I felt so bad because my father felt terrible, like he had purchased me a 'dud.'I should mention that this is the second Canon camera I've had that's quit working for no apparent reason. I will be switching brands until I hear that Canon has improved their quality and customer service. Too bad because their cameras are fun to use.", "Date": "August 31, 2011"}, {"Title": "Excellent Buy", "Author": "Meribell", "ReviewID": "R2Y2LES5SQ96HP", "Overall": "5.0", "Content": "This camera has all the bells and whistles, but it's heavy and not as compact as some of the others on the market. but the picture quality and zoom is amazing!  Overall I wouldn't trade it for any other camera.", "Date": "April 26, 2011"}, {"Title": "Exactly what I hoped for", "Author": "Rick Stubbs", "ReviewID": "R2GHBMQE16E9BT", "Overall": "5.0", "Content": "Everything about this camera has been exactly as advertised, and I have had it for over a year.  Great pictures, great zoom, nice portability, and Canon quality.  Highly recommend!", "Date": "February 19, 2011"}, {"Title": "Great camera", "Author": "Olympia", "ReviewID": "R20L9URNHKRF5R", "Overall": "5.0", "Content": "This is a great camera - small enough to take everywhere, great optical zoom (12x), great image quality, and manual overrides for great control.We own two of these - my husband uses the automatic settings most of the time, but finds it easy enough to try other settings & modes.  We hike a lot, and find that the battery lasts several days, even when we are shooting pictures all day long.  The still image quality is outstanding; have not used the hd video so can't speak to that.  Would recommend this camera to anyone who wants high-quality images without lugging along a bulkier SLR camera.", "Date": "November 17, 2010"}, {"Title": "Great digital camera", "Author": "hannahmorgannah", "ReviewID": "R814CFTTS4KUD", "Overall": "5.0", "Content": "Easy to use camera.  This baby takes great pics.  The only flaw, I think, is the flash.  It is always active when taking pictures.  I cover it with my finger when I think a flash is unnecessary.  Other than that, I love it.", "Date": "October 21, 2010"}, {"Title": "Almost Perfect!", "Author": "justforfun", "ReviewID": "R3UAQ2E7JG6TBM", "Overall": "5.0", "Content": "I love this camera!  It is so close to being exactly what I wanted at a great price.  I wanted a wide angle/big zoom camera with adjustable controls for going beyond snapshot taking that is portable, affordable and takes great pictures.Pros:  It takes GREAT picture!  (Lots of positive comments from people who didn't know I changed cameras.)  The lens combination is what I like best.  The zoom allows me to take candid pictures of friends and family without being intrusive.  (Still visible, but not in their face.)  Landscapes actually turn out and catch the essence of the beauty.  Combined with the image stabilizer my photos have improved enormously!!  I've used the macro and super macro lenses for flowers in my yard.  They work wonderfully.  I love that it has a wide angle lens and the 12 mega pixels is not the overkill that I thought it would be.The settings aren't all just gimmicks.  I really can control what a picture will look like.  Color, light, depth of field can all be adjusted without having to remember aperture and shutter speed settings, but you CAN use them if you're fluent in them.The image stabilizer works!!The video wasn't a consideration for me and I've barely used it, but it IS HD and looks amazing!  The sound is pretty good too.In over a thousand pictures since I got the camera, I've only had two pictures with any red eye at all.  Most pictures have been outdoors, but even so, the pop up flash (which hasn't bothered me) works great.As others have said, read and then reread the manual once you're more familiar with the camera.  There are so many features, it's hard to remember them all.Cons:  I MISS the optical view finder!  The camera has some warning icons built in to warn you about possible closed eyes and camera movement which helps in bright sunlight.All flash options are not available on all camera settings.  It is annoying to take a picture, look at it, realize it would be better with a fill in flash and have to change the setting in order to find the flash option.There is a bit of a learning curve to realize its potential, but that's also part of the fun!I gave it a 5, because I really love the camera and it seems to be an excellent buy!", "Date": "October 17, 2010"}, {"Title": "Perfect combo of size and features!", "Author": "jlrichar1", "ReviewID": "R2YJY2X7LHRMG1", "Overall": "5.0", "Content": "Great camera!  Great battery life!  Amazing features!For anyone who is tentative about this camera b/c other reviewers claim that the features are lacking...put your reservations aside!  I will say that the manual is a bit lacking--it does mention all of the features but it definitely doesn't explain how to use them or the extent of their use as well as it could.  So, you will need to devote some time to playing with the camera and the manual to figure out exactly what the camera can do and how to do it.I will say that this is not a point and shoot camera...I mean, it does point and shoot exceptionally well!  However, the artistic features of this camera is what really makes it spectacular!  Sepia, B&W;, single color, enhanced color, contrast, manual settings, etc.Anyway, great camera!", "Date": "July 24, 2010"}, {"Title": "Nice cam, nothing to complain about", "Author": "Jim Verstale", "ReviewID": "R2X2U6F9A1788E", "Overall": "5.0", "Content": "I own this cam for about 2 months, so far, and I love it. It is real japan made, strong and nice. The image quality exceeds my expectations from a little cam and the awesome lens lets me shoot from tele to wide and macro. I am very happy with it. Oh yeh the vide is superb too!", "Date": "June 26, 2010"}, {"Title": "Great camera with great manual features", "Author": "mike", "ReviewID": "R3D66E5S5UVMZB", "Overall": "4.0", "Content": "Everything to love about this camera. Only had it a month so durability is still unknown. Already made it through a backpacking trip and some family events. Small enough for my pockets, but I'm a big guy with big pockets.If you are looking to do manual adjustments and create your own style then this camera will work for you.Plus the zoom is great, easy to control and digital zoom can be turned off witch is great.Wish there was a traditional view finder, but those are hard to find today.Great camera, Cannon is easy to understand and well made.", "Date": "May 31, 2010"}, {"Title": "Great camera", "Author": "Donna McFarland \"Bead to be happy\"", "ReviewID": "R1P4VL6G3AIA3Y", "Overall": "5.0", "Content": "I love the picture quality, ease of using, and size.  Not too big, not too small.", "Date": "May 27, 2010"}, {"Title": "The best upgrade for me!", "Author": "Erica", "ReviewID": "R23CB3T3030263", "Overall": "5.0", "Content": "I am very satisfied with this purchase of this camera! It is a major upgrade for me from a 3MP camera with a lousy macro function and no manual controls. I absolutely love the manual controls, in fact all the pictures I have taken of since I got it has been on the manual function. The images are wonderful, and can be made even better with a little bit of touch up on Photoshop (brighter, tone, and sharpen). I really enjoy the camera's super macro function, it really makes a huge difference than my previous camera which only made close things a little sharper. I would really recommend it and reiterate my happiness with this awesome camera! Wonderful! Especially if you want to learn and play with the manual function, you can not go wrong with the Canon Powershot SX200IS!", "Date": "May 6, 2010"}, {"Title": "Great camera", "Author": "A. Mazmnanian \"photography lover\"", "ReviewID": "R347WX6J9FWEII", "Overall": "5.0", "Content": "Canon never disappoints me. If you want to get a nice digital camera this is one of the best, if not the best, from the Power-shot series. Battery life is pretty good, the image quality looks great. If you know how to set it up to the Manual setting correctly, the images look like professional pictures. Since, I haven't played with it yet, (one of my photographer friends put the settings on the Manual), I go with Auto, which automatically chooses the best setting for the picture. Very good camera and convenient to carry for traveling. I had two other Canons before, without any problems. I highly recommend.", "Date": "April 1, 2010"}, {"Title": "wonderful advanced amateur cam!", "Author": "daKine34", "ReviewID": "R3L8QIEWTDQQXX", "Overall": "5.0", "Content": "this camera takes amazing pics, the super zoom is wonderful and crystal clear, the numerous functions/settings make picture taking even more enjoyable!", "Date": "March 8, 2010"}, {"Title": "Love this camera!", "Author": "A. Harms", "ReviewID": "R3LGJH6FX22RQ9", "Overall": "5.0", "Content": "This camera is fantastic.  I wish it were a little smaller.  Other than that, perfect!", "Date": "March 7, 2010"}, {"Title": "Nice high quality easy to use, with excellent photo quality", "Author": "Mark Nickelson", "ReviewID": "R3EBMA56SSDZ3G", "Overall": "5.0", "Content": "I bought this camera for my wife for her trip to Peru.  She broke the last point-and-shoot I bought her and I'm actually glad she did!  This camera takes fantastic photos, and I do mean fantastic!  I told my wife she needed to review the manual with this one and really learn how to use her camera so she could get the most out of it.  I'm not sure she really needed to because the easy function is really, well, easy.  The vividness of the colors in the shots was simply outstanding.The zoom was one of the main reasons I chose this camera because I knew she would be in the mountains and be taking a lot of scenery shots.  With 12MP you can crop quite a bit but the zoom did come in handy.The only cons I can think of is the night shot settings.  I think the easy button doesn't quite cut it there, but with manual settings I'm sure it will work just fine.  Also, the first shot speed is a bit lagged (confirming what was reported in Consumer Reports).All in all I'm very happy with this product and would recommend it to anyone looking for a reasonably priced compact camera with a short learning curve.  (when I saw all of the photos she took I had to ask her when she became such good photographer!)", "Date": "March 6, 2010"}, {"Title": "The BEST.", "Author": "Hyungbum Pyun \"Ben K\"", "ReviewID": "R18EDRAYVSPKY", "Overall": "5.0", "Content": "IF YOU LOOKING FOR THE CAMERA TO USEING FOR pic some picture in home or outside sometimes, CHOOSE THIS CAMERA.This is what you looking for.", "Date": "February 24, 2010"}, {"Title": "Great camera", "Author": "Nance \"smile giver\"", "ReviewID": "R1F4DJ5GVJ6EBG", "Overall": "5.0", "Content": "Wanted a camera that had more versatility than our little Canon elph but didn't want the bulk of an SLR.  This is a great camera.  The images are very good but it is the ability to utilize a 12x optical zoom in a very portable size that makes this camera.  Am enjoying it very much.  Hard to beat a Canon.", "Date": "February 11, 2010"}, {"Title": "Rush's Revue", "Author": "Rush A. Kerlin Jr.", "ReviewID": "R1DLREZXO59HT5", "Overall": "5.0", "Content": "Camera is as good as advertised. Have no idea how long the battery will last as I do not use it that much and have had it only a month or so.  Otherwise, it is great.", "Date": "January 30, 2010"}, {"Title": "great camera", "Author": "W. Donovan", "ReviewID": "R31KEP1O9I78KM", "Overall": "5.0", "Content": "my girlfriend loves it! thanks canon for making a great product! the color accent is our favorite feature.", "Date": "January 7, 2010"}, {"Title": "Best point and shoot I've ever used!", "Author": "D. DeVincenzi", "ReviewID": "RIHNBCBTJAAR", "Overall": "5.0", "Content": "I did a lot of research before purchasing this camera, and I can now safely say that I made the right choice when I bought the SX200. The picture quality is excellent, the full assortment of manual controls is great, and the overall build quality of the camera is second to none. I have yet to encounter an aspect of the camera which I do not like. I would have thought the ever-present pop-up flash would be distracting and cumbersome, but you really don't notice it at all. Another aspect of this camera that really impresses me is how fast you can take multiple pictures. In good light, I can easily squeeze off three pictures in less than two seconds. That's a great feature that no other P&S; I've ever used has been able to match. Overall, I really can't see how you can go wrong with the SX200 and I would recommend it to anyone looking for something more than your average P&S; camera.", "Date": "January 7, 2010"}, {"Title": "An Excellent Purchase!  Very happy!", "Author": "Goosey \"Goosey\"", "ReviewID": "R1286ZF32AQUMA", "Overall": "5.0", "Content": "The first digital camera I owned was a Canon, and it had gone everywhere with me for 6 years and outlived many cameras owned by friends and family. So when it came time to purchase another camera, I didn't look anywhere but to Canon.  I initially was going to go up to the DSLR, but with all of the outstanding specs and reviews attached to this camera, I decided to give it a chance and I am extremely happy that I did.  Not only is this camera a steal for its price, but it is very comparable in quality of pictures to that of the DSLR without the fuss and baggage.  This camera, while bigger than the PowerShots, is still compact enough to fit in your pocket, purse, or whatnot, for easily accessible photo opportunities.  The variety of options for photo shooting (night time, aquarium, snow, fireworks, sunset, etc.) are very useful and provide for more photo options while maintaining excellent quality.  It is also suited with a Li+ battery, as opposed to the AA battery operated Canons, which I prefer, and it has a remarkable battery life.  The screen is large and the resolution is excellent.  It does take some time to get accustomed to all of the new features attached to this camera, but once you do, you are limitless in the style and types of pictures you can take.  While being a little less user-friendly than the PowerShots, it is still a relatively easy camera to operate.  Overall I am very happy with this purchase!", "Date": "January 6, 2010"}, {"Title": "Great Camera!", "Author": "Scott", "ReviewID": "R633HN8067LD9", "Overall": "5.0", "Content": "Returned a Nikon Coolpix s630 because some pics were blurry. Not one blurry pic as yet with this camera.  I had an old Canon from 2002 that we just loved. Hardly any bad pics from that camera either.This is a great point and shoot camera with easy to use adjustments for an amateur like me.  Highly recommended.", "Date": "January 2, 2010"}, {"Title": "great all around camera", "Author": "John Del Valle", "ReviewID": "R6NZNVZ0UR1W8", "Overall": "5.0", "Content": "works great. takes great pictures, only complaint is it takes a little long for second shot.", "Date": "December 25, 2009"}, {"Title": "Canon SX200IS", "Author": "Richard", "ReviewID": "R36ZHD7F78EF8C", "Overall": "5.0", "Content": "What an awesome camera !!!!!!  I have not yet learned all about all the possibilities, but I'm so happy with the 12X zoom lens and the wide angle.  I first saw this camera when my cousin bought his and I was amazed at the size of the lens at first viewing.  I investigated more about the camera and finally decided that this was the camera that I wanted.  We recently went on a cruise to the Western Caribbean and my pictures are so much superior to others that I saw.I highly recommend this camera to anyone who wants awesome pictures with terrific zoom qualities and extremely good low light results.  Check this one out before buying any other point and shooter.", "Date": "December 25, 2009"}, {"Title": "zoom, zoom, zoom!", "Author": "J. Reynolds \"true amateur\"", "ReviewID": "R3IIVC46UM5VSN", "Overall": "5.0", "Content": "This is my 3rd Canon digital camera and the best so far. The zoom is superb. Got so many great pictures I have entered several in a photo contest.", "Date": "December 19, 2009"}, {"Title": "Awesome camera", "Author": "R. L. Basinger", "ReviewID": "RTFU4D0M8AFUX", "Overall": "5.0", "Content": "Overall, I love this camera.  I've been using cameras with a lot of features for more than 25 years, so for me this is easy to use.  But I can see somebody being overwhelmed by the various features and settings if all they've ever used is a point and shoot. For those people, there's an \"Easy\" mode that will take care of everything for them and they can learn everything else it does a feature or two at a time.  It's too early to rate the battery life.  Because I've just been playing with it a lot, I don't know how it will do in real life situations, but so far it looks like I'll be happy with it.  I bought a spare battery at the same time (Amazon Marketplace) that turned out to be defective.  As soon as I brought it to the seller's attention, they sent me a new battery and a prepaid return label to send the dead one back.  Very good customer service.  What really impresses me is the zoom in a camera this size.  At full telephoto of 48x (12x optical and 4x digital zoom), I have handheld some shots that by all rights should have shown a lot of camera shake, but they are in relatively good focus.  I haven't printed any of them yet - just viewed them on my laptop, but they look pretty good.  I imagine they'll be great when I use a tripod.", "Date": "December 11, 2009"}, {"Title": "GREAT BUY!", "Author": "Tibs \"Tibs\"", "ReviewID": "R2CABWY82AT5ON", "Overall": "5.0", "Content": "Worth every cent. Excellent quality pics and video: crisp, great color, great audio. Excellent quality when used even by a novice or first timer, yet all the features available for those more on the pro side. I use a large capacity card and keep an extra battery on me. I am sooooooooooooo pleased with this!!!", "Date": "November 24, 2009"}, {"Title": "Great camera in a small package", "Author": "T. Bickford", "ReviewID": "R2EM3445878GRP", "Overall": "5.0", "Content": "We bought this camera from Amazon just before a trip to Europe.  We didn't have much time to go over all of the features before leaving but managed to get some great photos.  The zoom is excellent, picture quality is excellent and it is very easy to use.  Battery life is also good.  Have not used the video feature yet so can not comment on that.  I bought an 8GB card to go with it which allowed for some 2,000+ pictures to be stored at high resolution.  I highly recommend this camera if you are lookig for a compact design with loads of features and great optical zoom.  Also pleasantly surprised to find it was made in Japan not China.", "Date": "November 4, 2009"}, {"Title": "Solid and Sleek Performer", "Author": "Cville Dude", "ReviewID": "R3SQBE64GH6SIC", "Overall": "5.0", "Content": "I've been a big fan of Canon and this is my second point and shoot made by Canon.  After trying Olympus and Sony I believe Canon offer the best value today.The SX200IS is an ideal camera for taking a lot of close quarter shots.  The wide angle lens give great depth and perspective to photos.  Photos of people, babies and objects look much richer with this camera than others I've used.  After comparing the same shots with others cameras I'm convinced this is a great value.  The 12MP is nice but not as important as the lighting and auto-features this camera provides.This camera is bigger than the ultra slim models and wont fit in your pants pocket (unless you wear giant pants) but the extra features and image quality make up for it.", "Date": "October 21, 2009"}, {"Title": "Great Camera", "Author": "Y. KIM", "ReviewID": "RSXDM82T6E3EQ", "Overall": "5.0", "Content": "Nice Camera...recommended.  It's bit pricey but definitely worth buying.  I have few digicam that can take just plain photos.  This one will definitely do some magic with closeup photos, sunset, catch movement....I was amazed to see the quality of photo when I took a picture of MOON.  With 48x combined Zoom came out great...play around with the software provided...you can print amazing photo.This is one of few cameras that give you all the different photo settings, manual setting with 12X zoom.Watch out that popup flash...you may drop the camera...but once you get used to it, it won't bother you.", "Date": "October 8, 2009"}, {"Title": "Great product I ever owned!", "Author": "C. Fan", "ReviewID": "RP1GL872SP3AA", "Overall": "5.0", "Content": "You can still use zoom function while making video. One only cons is you might need a 16 G memory card if you want to take movie for 1 hour long.", "Date": "September 20, 2009"}, {"Title": "Lens Error", "Author": "Sally", "ReviewID": "R1CG1TCYLTJWME", "Overall": "1.0", "Content": "I purchased this camera 14 months ago. I do not use my camera everyday, perhaps a day or two a month. When I was going to take a picture by zooming in last week, my lens got stuck open. I got the apparently infamous message, \"Lens error, restart camera\". My camera would not start. My warranty expired two months prior so when I called Canon for help they said to mail it in, which cost me $15. After searching online before I even spoke with the person I knew what they were going to tell me--it was my fault for the error from having dropped the camera or getting sand or water in it. I know that I didn't do these things, as I take care of my camera and have not brought it to the beach before. I also knew they would charge me $130 to fix it and ship it back with a 90-day warranty on the repair. After haggling with the customer service representative she offered me a 20% discount on labor, taking my bill down to $115 (mind you a new one now costs $200), or selling me a refurbished camera for $40 less than the brand new camera with no warranty since it's refurbished so its warranty expired. I have owned Canons in the past and been very pleased, but this camera is a LEMON!! You do not want to waste your money on it. It's such a disappointment, and I am disappointed that Canon has sold such a bad camera and not taken responsibility for its manufacturing error. It's an embarrassment that they would sell it, as it has forever tarnished my impression of Canon. I will not purchase another Canon camera after this experience.", "Date": "December 28, 2010"}, {"Title": "Lens Error", "Author": "JustP", "ReviewID": "R3I21D5ATORLDZ", "Overall": "1.0", "Content": "Had the camera for about a year. Was overall happy with it, but the moving parts started to wear out on me.  The flash would start getting stuck and then one day I got the infamous \"Lens Error\".  This made the camera unusable. While it lasted the camera was nice, but I couldn't recommend it.", "Date": "September 15, 2010"}, {"Title": "Avoid Entirely", "Author": "PT", "ReviewID": "R1RZOJS54K38NN", "Overall": "1.0", "Content": "I ignored the warnings from others about the fatal \"Lens Error\" that renders this camera unusable. Canon refuses to warranty this condition. Camera was never abused in any way and is 3 months old. Apparently, this afflicts many Canon cameras.Shame on Canon. This is highly irresponsible.", "Date": "September 14, 2010"}, {"Title": "Auto mode issues", "Author": "M. Knapp", "ReviewID": "R16QA1U4FUC0TF", "Overall": "3.0", "Content": "I was very disappointed with the Auto and Easy modes indoor picture quality. Good to great pictures can be taken when in one of the manual modes but I purchased this as a high end point and shoot camera. In the Auto modes colors are washed out and any lighting fixture in picture becomes a white blob from high ISO setting these modes usually choose. Focus also struggles in these modes. I would welcome any advice or software updates to camera to fix this. I have seen this complaint from other feedback sites so expect this is normal for this camera. Like everything else with camera, unfortunately I need a good Auto mode camera where I can reasonably expect good results when passing it off to my wife or children. Wanting to love it but still debating whether to return.", "Date": "December 24, 2009"}, {"Title": "Great Picture and Video Quality!!!", "Author": "D. Mattoso", "ReviewID": "R295D0AHV1FM2S", "Overall": "5.0", "Content": "This camera is great.  I just got it in the mail a few days ago, and it works wonders!I immediately started shooting some pictures, and the picture quality is unreal.  Real HD (well...pretty much!).  There are a lot of different features, and once you know how to use them (I am still learning by the way), you will be amazed and consider yourself a professional photographer!  You can crop, change colors etc all in the camera.  I love it!  The only \"bad\" thing (which really isn't that bad), is that I basically bought this camera to replace my old PowerShot, and thought that I could use the battery from the old one as an additional battery for the PowerShot SX200 IS.  But, the battery from SX 200 IS is shorter and wider, so I can't really use the old Canon PowerShot battery.  But that's ok though! The life of the battery is great!The picture colors are ridiculous, really! They are so vivid.  It looks like I am litterally holding what I shot.  The zoom, no comments! It's FANTASTIC! You can take picture from so far away! It's awesome...I am very impressed and proud of this purchase!  I agree with the \"negative\" reviews:  its not for point and shoot users.  But it can be.  Just change the setting to \"Easy\" mode OR the \"Manual\" mode and you're good to go!It's a little bigger than your regular digital cameras out there, but nothing crazy.  It fits better in larger hands anyway...:-)", "Date": "October 23, 2009"}, {"Title": "PowerShot SX200IS", "Author": "D. Vachhani", "ReviewID": "R1UPEAEUVGHP9H", "Overall": "4.0", "Content": "I'm thrilled with the clarity of the photos and the zoom...it's amazing.  The only thing critical I can say...is that its tough to be steady when you get up to 48x and I'd prefer to have the choice of the flash popping up...though you can hold it down if its in the way.Overall, I'm impressed with the photos and its very easy to use.  My family absconded mine to take on safari in Africa...and it was worth it!", "Date": "September 4, 2009"}, {"Title": "Canon PowerShot SX200IS", "Author": "Claudia De Caravantes", "ReviewID": "R37TJPD0S6FKJK", "Overall": "5.0", "Content": "Best camera.  Easy to use, easy to carry.  Great resolution.  Great pictures.", "Date": "August 29, 2009"}, {"Title": "canon powershot sx200is review", "Author": "Jean M. Young", "ReviewID": "R3GSHM17HIGV1", "Overall": "5.0", "Content": "I love this camera.  It is small and sleek and takes the best pictures I have ever taken.  The zoom is incredible so I can be far away and get those candid shots no problem.  My hand shakes a little but this camera takes care of that.  It also takes care of red eye.  Want a small powerful no fuss camera...this one is for you.", "Date": "August 11, 2009"}, {"Title": "very good advanced point and shoot", "Author": "Poe", "ReviewID": "R28FTZJJIVOUCS", "Overall": "4.0", "Content": "I upgraded to the SX200 because I wanted a small p/s that had some advanced features.  The SX200 has manual aperture and shutter speed controls if you want complete control (of course the aperture range is only from 3.5 to 8.0 - not a large range), or you can put it on the \"easy\" setting and just click away not worrying about any of the settings.  The camera is larger than some ultra-compact cameras, but with a 12x zoom you sort of expect that.  Before you buy any camera, you have to figure out what you'll be using the camera for ultimately.  This camera is not a dSLR, and will never match a 1DS, 5D, 20D, etc. - this camera is only $300!  Also, if you want a strictly point and shoot and nothing more, look at canon's elph or A series cameras - the SX200 is probably more then you need.  But if you want the best of both worlds, then you have found your camera.", "Date": "June 15, 2009"}, {"Title": "very good", "Author": "Shihai He \"shihai\"", "ReviewID": "ROOCG5R6Q5UXB", "Overall": "5.0", "Content": "this camera is between easy ones and professional ones. relatively easy to use and the pictures have high quality.", "Date": "June 1, 2009"}, {"Title": "Nice camera in a small package", "Author": "D. Davidovic \"EnjoyReading\"", "ReviewID": "R27OS26KH6U6CL", "Overall": "4.0", "Content": "I was considering moving from my Powershot to a digital SLR but decided to try this one first.  I am very happy with my choice.  Although not as full-featured as an SLR with lens interchangeability, it is a great little camera with lots of features and still pocketable.A couple of things could be better.- Yes, I do have the tendency to have my finger over the pop-up flash preventing it from popping, but not the end of the world.- The dor to the USB connector is the flimsiest thing I have ever seen.  If that door lasts 6 months without breaking off I'll be amazed.  I had the same issue with my little Powershot and you'd think they would have improved it by now.  I see scotchtape (or a return) in my future.", "Date": "April 27, 2009"}, {"Title": "SX200IS - a complete compact camera", "Author": "William Lim", "ReviewID": "R2Y67F7MN3OTIH", "Overall": "4.0", "Content": "Only comera with 12x optical zoom with optical image stablizer system.  Furthermore with 12 megapixels and 2 inch TFT color LCDD widescreen with wide viewing angle everyone will like to own one.  One camera to bring along for any holiday.Highly recommended esp those who wants to travel light.", "Date": "April 24, 2009"}, {"Title": "It's ok but it's going back", "Author": "K. Chamberland", "ReviewID": "R9WL7M57CNFWS", "Overall": "3.0", "Content": "I have a Panasonic DMC TZ5 which is great but I am always wanting to try the newest thing out. I have been know to get a new camera every year searching for the perfect compact camera. Well, I gave this canon a try, found too many things I didn't like and now it is going back. Thanks to Amazon for making returns so painless.CONS:1. The canon takes great outside photos but inside shots leave a lot to be desired. They are not well focused and colors are not true, no matter which setting you use.2. I also do not like the pop up flash. It feels rickity and is in a position to be bumped all the time since it located right where you put you left fingers. You cannot make it stay down even when you set the flash to forced off. I'm sure that some point it will get broken off.3. the camera does not go to sleep so it can be awakened by just touching a button; it actually shuts off and needs to be turned back on when a photo op comes along. Also, if you spend too much time reviewing your photos and then try to go back to shooting, you can't. It has shut off. ALthough start up is fairly fast, it is not as fast a a button push for wake up. Time means the difference between getting that shot of a lifetime or not.4. it is very slippery and easily slips out of your hand. There is no good place for your right fingers to make it feel secure and no anti-slip strip to keep it safer.5. It is not as easy to use as they claim.You want easy - go for the Panasonic.PROS1. Great outdoors photos with good color.2. The one thing it did for me was make me appreciate what a great camera the Panasonic TZ5 is. If you are in the market for a new compact camera get the Panasonic.", "Date": "April 2, 2009"}, {"Title": "Love the camera, but it broke after 45 days with \"lens error restart camera\" message", "Author": "Scott McMullan", "ReviewID": "R378IWAMWCIBEI", "Overall": "3.0", "Content": "I am a big fan of Canon point and shoots, having had an s110, s400, s800, and now sx200 over the years.  The sx200 takes wonderful pictures and movies...But the lens mechanisms have to be fixed!- My new canon sx200 just stopped working after 45 days -- the lens won't close and I get a \"lens error restart camera\" message that I can't get rid of.- A couple years ago, my canon s400 suffered the dreaded E18 lens error after 18 months of use and became a wonderful paper weight.I would take it back but Amazon says my return window just expired May 9th :-(So now I have to go through the hassle of getting a warranty repair for a camera that I no longer trust.Canon I hope you're listening!", "Date": "May 15, 2009"}, {"Title": "expected more", "Author": "Evgeny Kolev", "ReviewID": "R13IAOA2TZ5W1L", "Overall": "3.0", "Content": "I spent months reading - reviews, comparisons, characteristics. Decided to add a Canon to my collection and go with the Canon SX200 IS and not the Panasonic rivals ZS1/3 (DMC-TZ6/7 in Europe) - my other and close choice.Ordered the camera online. I knew I am not getting a viewfinder (this class of 'compact super zoom' basically decided to skip it, which is quite painful especially when shooting in bright light). I also knew of the annoying feature to have the flash out every time you want to use the camera. Didn't expect the following problem - the door on the battery/memory opens every time I touch it (e.g. trying to get it out of the camera bag), while at the same time the door on the the AV outputs has top be struggled with to get it opne. Played with the many functions - all nice, but the quality of the pictures weren't as impressive as I expected. The HD video is OK only at no or minimum zoom, so I decided no zooming in video mode (which was one of the nice features the camera has).And then the big disappointment came when after only 175 shots the camera broke - the lenses + flash came out and never went back in.Which ruined half of my vacation for which the camera was purchased. Back in the US - took it to the service. Got 10 days later a refurbished different camera - the letter said mine couldn't be fixed for the lack of parts (!?). They used FedEx which was completely inconvenient for me, but added a news et of battery-stripe-charger, so the wasted time and gas might have been worthed (not).Took about 50 shots with the \"new\" camera + some videos. The videos came up with striping, so I might be visiting the service again :-(Not the quality from Canon I expected - neither in the performance, not the mechanics.", "Date": "September 13, 2009"}, {"Title": "Superb!", "Author": "Coal Monger", "ReviewID": "R3XFM0U6G3WXR", "Overall": "5.0", "Content": "I debated over this and the G10. I chose the SX200 because of the zoom. It takes excellent photos!It is not a tiny pocket camera. It has some weight and size to it.Excellent job Canon!", "Date": "May 25, 2009"}, {"Title": "Zoom lens is VERY VERY FRAGILE", "Author": "snowblue", "ReviewID": "R1J2P41E5UWKYT", "Overall": "1.0", "Content": "I owned this three months. I hit the ON button by accident while it was in its case. The zoom lens popped open then shut now it WONT open at all.I contacted Canon and they wanted $175 to fix it. The gears inside he lens are CHEAPLY made. DO NOT BUY THIS CAMERA.", "Date": "July 17, 2011"}, {"Title": "This is the One!! Canon SX200IS", "Author": "Robert H. McBride \"RV Driver\"", "ReviewID": "R2DZBU2ZHRO0FT", "Overall": "5.0", "Content": "I read reviews and comparisons for several months before purchasing the SX200IS.  Save yourself the trouble and get this one before it goes away.  I like it way better than the 210 which is already marketed as its replacement.  (Mine is red, and it's a nice dark maroon.)  Until Canon replaces the SX20IS and includes a larger sensor (as in the Sony NEX3/5), there is no reason to go with a larger body camera with the small sensor used in most point and shoots.  I almost bought the SX20IS, but realized I should wait for the larger sensor.  Until then, I am even happier with this camera that I expected to be. The 12x optical zoom, including wide angle in this small a body is an excellent compromise.For some BACKGROUND PERSPECTIVE: Consider that I have been taking pictures for over 50 years, including the last 40 with two Canon FT-QL SLRS with all the appropriate lenses, and a Sony DSC-85 for the last 10.  The Canon SX200IS allows me to do anything (and more) I could do with the SLRs and four lenses from 28mm to 400mm (560mm on the SX200IS), all in one package that fits in my pocket!  The ten years from the Sony 3.3 MP to the 12 MP Canon also gave me a great leap in image quality.  Leaving the image quaility on the highest setting gives photos of about 3.5 MB each.  That's plenty of data for editing, cropping, printing or projects (like photo books), and everyone that looks at my photos is amazed at the color and quality of the images.  I have had the SX200 for about two months (an early Fathers Day gift to myself) and have taken about 400 photos (not counting any I have deleted), mostly on Auto, including a wedding reception and a military funeral.  I already made four photo books, and they all turned out very well.READ THE User's Manual, and then read it again!!  I'm still learning more cool stuff this camera will do.  BTW, my camera included a small format copy of the manual (Canon reads these reviews, I guess), but I had already downloaded it from the Canon website and had it printed and bound in large format, so the small copy stays in my bag with the camera.  That's the other thing, this camera goes everywhere I go, since it's small enough to fit in one of the pockets of my shoulder bag that I take to work and in the car on weekends.I like the ability to control exposure and focus myself, and I am still learning all the various options.  If you just want to turn it on and take great pictures, don't worry about it.  Just do it, and you'll be happy.  The videos are great too, BTW!The pop up flash is NOT an issue. Your left hand first finger gets used to the notch behind it, so you forget it very quickly.Quality, Solid construction!  Nice finish.", "Date": "July 16, 2010"}, {"Title": "Great Camera", "Author": "B. Wertz", "ReviewID": "R2ESQSRAUDTBKL", "Overall": "5.0", "Content": "On our initial impressions this camera is everything we wanted and more.  We bought this camera two days ago to replace our PowerShot SD630.  The SX200IS is just a bit larger than the SD630 and is still pocket size and easily transportable.  The various modes available on the camera are great that make it easy for point-and-shoot users.  The 3\" LCD screen is a lot sharper than our previous SD630.With its small size, 12x optical zoom, HD video capability, and huge 12 MP picture size at $350 half of what my previous camera cost I couldn't be happier with this camera.", "Date": "June 13, 2009"}, {"Title": "Great in many ways", "Author": "BadBrad", "ReviewID": "RL094M3UU8Y57", "Overall": "4.0", "Content": "Overall I am very pleased with this camera. The quality for such a small camera is very good and the 12x zoom is fantastic. I have had trouble with the HD video filming for longer than 30 seconds or so. For some reason it just cuts of and saves the video. Smaller videos appear to be fine. I have looked at settings but can't seem to see anything restricting the length of the video.Overall a great buy in such a small camera.", "Date": "June 8, 2009"}, {"Title": "Love it", "Author": "FGL", "ReviewID": "R3JA3BB1HRVN3C", "Overall": "5.0", "Content": "Love it. Small. Manual and automatic. Great videos. Great price. Holds a charge for a long time.Fits in jean pockets.", "Date": "November 6, 2013"}, {"Title": "Unhappy with camera, want to return it", "Author": "mary furness", "ReviewID": "R12YGY478ABFQ8", "Overall": "2.0", "Content": "Extremely disappointed in the camera's ability- or NON-ability to focus in midrange.  Had one before and this is why I bought another, but it will not focus from 3 ft to about 20 feet with zoom", "Date": "October 18, 2013"}, {"Title": "Wonderful", "Author": "Shep", "ReviewID": "R35D3LXY76DLB", "Overall": "5.0", "Content": "Totally Happy with purchase. Meimei is the BOMB!!! Very Nice to work with. A 100% favorable buying experience! Camera was more than described", "Date": "September 1, 2013"}, {"Title": "As a put in your pocket point and shoot", "Author": "Not_you", "ReviewID": "R2HTUI73R48LMZ", "Overall": "4.0", "Content": "...it is easy, lots of pixels, fast, all in all for what it is a great grab and go camera with very good results.", "Date": "June 16, 2013"}, {"Title": "Gift", "Author": "Sheryl S.", "ReviewID": "R31WUYKY50SO3G", "Overall": "5.0", "Content": "I purchased this as a gift for a my novice photographer husband. It takes great pictures and the manual makes it easy to learn.", "Date": "March 26, 2013"}, {"Title": "I love love love this camera", "Author": "D. Ottinger \"Amazon buyer\"", "ReviewID": "R1942FZ2TB0AZF", "Overall": "5.0", "Content": "This camera is so easy to use and takes the most beautiful pictures I have ever had....I would definitely buy this exact same camera again if anything ever happened to the one I have.", "Date": "March 18, 2013"}, {"Title": "Best Camera!", "Author": "Ann Neubauer", "ReviewID": "RFAL4P9ZS5MVZ", "Overall": "5.0", "Content": "I loved this camera. It has everything you want and need in a point and shoot with tons of additional options like manual, etc. I actually dropped mine in the Gulf of Mexico - EEK! And I went right back to cannon and bought the same model (newer addition!). It's worth every penny. The zoom is AMAZING and it still fits in your pocket.", "Date": "January 24, 2013"}, {"Title": "Great quality !!", "Author": "Isaac Dyck", "ReviewID": "R28X2ABVWXI2NI", "Overall": "5.0", "Content": "absolutely great quality of pictures (i receive this one in less time than expected)simple line : great camera and by a great price...!", "Date": "December 19, 2012"}, {"Title": "I love this camera!", "Author": "s.patton", "ReviewID": "R3P13JMVZLGCDI", "Overall": "5.0", "Content": "This camera has gone everywhere with me and I absolutely love it! It takes fantastic pictures. We have a boat and I use this everytime some is wakeboarding. I'm able to catch them in mid air when they jump or wreck. I fell off the boat seat while taking pictures and broke the flash :( I taped it down and have used the camera like that for about a year now. I can't take night pictures of course, but the fall didn't affect its day performance at all.", "Date": "December 11, 2012"}, {"Title": "Quality Camera with Great Features", "Author": "M. Hockett", "ReviewID": "R27IQVEM99XJGZ", "Overall": "5.0", "Content": "The camera produces fine pictures with rich colors.  The anti-shake lens system is quite effective when zooming in distant subjects at x12.  It has a better quality elevated flash that is very effective, and the rechargeable battery retains its charge impressively.  The camera costs more, but it offers more.", "Date": "November 3, 2012"}, {"Title": "Good durable camera", "Author": "Neel", "ReviewID": "RBRPW25ZR1W9Z", "Overall": "4.0", "Content": "At the time this camera was released, it was a gem for its era. Even now, it can compete with decent cameras. However, for those who are thinking of buying it, I would suggest a camera that has video incorporated into it as well. The new Canon Powershots, while around the same price (or less) usually are equipped with 1080 P video quality. That will not need to act as your main video camera but it will be useful in random situations, like when your video camera is out of charge.Overall the camera is excellent. The 12X optical zoom works remarkably well. In addition, the camera has up to 48X digital zoom. Digital zoom sacrifices pixels for zoom and most editing software can do it, but it is nice to be able to visualize your \"zoomed\" photo on the camera itself.I once dropped this camera from about four feet onto solid ground. The result was that the bottom of the zoom lens was damaged. This did not affect the camera much. I see it as a well worth investment because it has lasted over 3 years. Now I am only think of replacing it because I would like to have a video camera and a still camera in one device.Recently, it has begun to glitch as well. The glitches include disorientation of photo and the cameras defiance to follow preset settings. This is nothing major because it can be fixed by quickly restarting the camera.I am confident that if you take good care of the camera then it will not experience and major problems till after 5 years. I would have recommend buying it 2 years ago but now I might suggest looking into other canon models because they have more feature like video ability, more optical zoom, more megapixels, and some are even cheaper.-----------------------------------------------------------------------------------------------------------------------------------On the link below, you will find another Canon Powershot that Amazon is selling. It is $180 cheaper and has 1080 P video. It only lacks higher zoom but it has more megapixels:http://www.amazon.com/Canon-PowerShot-Stabilized-Wide-Angle-Recording/dp/B006UMM1UO/ref=sr_1_1?ie=UTF8&qid;=1342571610&sr;=8-1&keywords;=canon+powershot", "Date": "July 17, 2012"}, {"Title": "Great for pix, cheap material", "Author": "Jack", "ReviewID": "RQRIO5HFPF2D6", "Overall": "2.0", "Content": "I purchased this camera a little over a year ago.  I read a review that stated that the bottom, where you put the battery in, was made of plastic.  I thought to myself 'Hey its a Canon, they wouldn't make it cheap enough to break, its probably hard plastic.\"  Well, the camera takes great pics, BUT unfortunately, the bottom broke, and I believe its not holding the battery in properly, so my battery life doesn't last long now.  I called Canon to see if they could help me out with this issue and they said it would cost approx $125 to fix.  So, I am going to try to figure out a mickey mouse way of fixing this.If you are looking to get this camera, know that it takes wonderful images.  I have had no internal issues with it, and have taken semi professional looking images with it.  I am somewhat saddened that I am going to have to replace it with another camera, but I cant handle cheap material.  I truly can't believe they went with cheap plastic to hold the battery in place.  Stupid move.  If you buy it, baby it.  It's not worth spending $125 to fix.  Enjoy....", "Date": "April 19, 2012"}, {"Title": "GREAT CAMERA for 15 months then LENS ERROR", "Author": "Quinn", "ReviewID": "R2H8L3YDOQSG03", "Overall": "3.0", "Content": "I have to say, I enjoyed this camera when it worked great for 15 months.Then out of nowhere, I received the Lens Error.I had to repaired, but even when it was repaired, it was not the same afterwards.This camera shot great photos, videos, and is a little clunky to carry around.You won't be putting it comfortably in your pants pocket anytime soon, but it takes great photos.However, the lens error part was heartbreaking.Really came out of nowhere!", "Date": "February 22, 2012"}, {"Title": "Canon SX200is is a lemon", "Author": "Camera Guy", "ReviewID": "RXRQPCS6KOASW", "Overall": "1.0", "Content": "We've had this camera for just a little over a year. It has had problems since day one, as it became sluggish in operation almost immediately. However, when the lens cover leaves quit opening and closing all the way we had to return it to Canon for repair. They supposedly fixed it but conditioned their repair \"as is.\" Now just a few months later the lens cover leaves are no longer opening and closing. Of course they won't fix it under warranty. We are very disappointed.", "Date": "November 21, 2011"}, {"Title": "Perfect camera for me", "Author": "Aaron Hageman \"aaronus\"", "ReviewID": "R2CA4GQ7XTFX3S", "Overall": "5.0", "Content": "This camera is the perfect one for me.  I purchased about the month after it came out.My camera needs include long range zoom for when I'm up on a mountain, as well as very close up shots for the tiny flowers God made.  It can focus all the way up to touching the lens...although you might block out the light.Take note, though.  This camera does not support RAW format, but since I don't do professional editing and sizes, that's fine with me.  The flash is almost pathetic in its lack of brightness.  Low-light shots often don't turn out well.The scroll wheel on the back of the camera is life changing.  Instead of clicking through all of my pictures, I just roll the wheel and go much faster.The camera's easy to hang on to.  The LCD screen is lovely.I've read about Canon's updated models in this line, and they all seem to lack one or the other of the qualities I appreciate about this model.  They might not have the focus all the way to the lens, or they might lack the scroll wheel.  They did improve the low light issue, though.If you need a good all around camera that is not too heavy, has super zoom options, good quality photos of all sorts, and allows manual controlling or automatic settings as you prefer and learn, this is a great choice.", "Date": "October 22, 2011"}, {"Title": "you look better in the pic than real lfe...", "Author": "donial", "ReviewID": "R2J02FKMDYLABE", "Overall": "5.0", "Content": "Takes amazing pictures, the color looks amazing and NEVER washes people out...taking pictures with this camera,makes the pictures look better than all other cameras and better looking than real life...I have owned ALOT of different brands, and by far this is my favorite...Years ago I had a 35mm canon and it was my favorite,until I used the life out of it...so I knew I wanted to spend a little extra money to get another canon,thank god I did!..you will not be disapointed!Video: Unlike some digital cameras, this camera you can zoom in and out after starting the  video.And the sound is great too...", "Date": "March 5, 2011"}, {"Title": "Great Camera", "Author": "H. Miller", "ReviewID": "R3AZDF6KB496JG", "Overall": "4.0", "Content": "This is a great camera for taking wildlife shots. With a combined 48x zoom, you can take closeups from 100's of yards away.", "Date": "February 14, 2011"}, {"Title": "Great Camera", "Author": "mikeyc", "ReviewID": "RHVRJS0JBPMAS", "Overall": "5.0", "Content": "This is one of the fastest point and shoots you can buy. Had this camera for about 6 months very happy", "Date": "January 1, 2011"}, {"Title": "Great camera for its price", "Author": "Fabricio Marin", "ReviewID": "R1AGG871IL1PXB", "Overall": "4.0", "Content": "I must say, for a camera at this price im quite pleased. Ive had this camera for over a year now and its still working okay. the reason i say \"okay\" is because the picture quality seems to be diminishing. Lots of noise is created when zoomed in above 12X or when the ISO is set above 400 (i find this very disappointing) Taking pictures at 48X zoom or 1600 ISO is pretty much uselessI however, edit my photos on Photoshop to reduce the noise and improve the overall quality, see for yourself: [...]", "Date": "November 27, 2010"}, {"Title": "Canon PowerShot SX200IS 12 MP Digital Camera with 12x Wide Angle Optical Image Stabilized Zoom and 3.0-inch LCD (Black)", "Author": "L. Ocampo \"osl\"", "ReviewID": "R3EL70ZFMVBQEW", "Overall": "5.0", "Content": "I think it is an excellent choice if you want a compact camera with many functions and an excellent optical zoom. it takes great pictures in different ways you handle.", "Date": "October 21, 2010"}, {"Title": "powershot sx200IS", "Author": "t.l.g.", "ReviewID": "R325M2C0M3MAHD", "Overall": "5.0", "Content": "This product came in a timely manner. It was packaged in its original box with all its instructions and warranties. The camera is light weight and  easy to adjust from one mode to the next. The battery life is excellent I can charge it and use it over the next 2-3 weeks without another charge. The product is well made and solid it is a little bulky but if your looking for a pocket camera this is not it but it easily slide into a jacket pocket or purse.", "Date": "October 19, 2010"}, {"Title": "Canon Powershot Sx200IS", "Author": "Emily Ginko", "ReviewID": "R2ORDX56HFHN3B", "Overall": "4.0", "Content": "Small enough to fit in a pocket and powerful enough to get close-ups without all the attachments one has to carry with bigger cameras.  As a teacher and Mother it fits all my needs in a camera", "Date": "September 13, 2010"}, {"Title": "Canon SX200IS", "Author": "David Porter", "ReviewID": "R5CPCCYBCY58J", "Overall": "4.0", "Content": "A recent vacation allowed me to exercise the SX200IS's abilities. I had already decided that the Auto mode did just fine in any of the things I had tried, so all pics, indoors or outside, were shot in auto. I ran the lens from full wide to full optical plus digital zoom, taking pictures of Mt. Rainier, St Helens, the Columbia Gorge and Japanese gardens. In most cases the camera was handheld, with no rest. Despite the not-so-hot images I saw on the LCD, the finished product on the computer turned out beautifully. The naked eye (mine at least) could find no sign of degraded resolution, even on the longest zoom, even in 8x10 prints. I had previously noticed that the \"sharpen\" tool in Picasa did not seem to alter the images at all, in contrast to the older digital camera I had used, where all images were greatly enhanced by Picasa. I have had no problems with the camera in the year I have been using it (a lot). I would recommend it to anyone who wanted to have high quality images with an easy to use point-and-shoot.", "Date": "September 11, 2010"}, {"Title": "Good camera.", "Author": "duckrabbit", "ReviewID": "R2D06F6POP8V97", "Overall": "5.0", "Content": "This camera has met or exceeded all expectations.  It's very easy to use and so far has been problem free.  The captured images are top notch. A professional photographer or someone who is extremely particular about one small feature or another might be able to find a problem, but the average person should be very happy with this camera.", "Date": "August 19, 2010"}, {"Title": "Picture Perfect!", "Author": "Shauna M. Sherman \"I'maGem04\"", "ReviewID": "RASA5XY2JWQBN", "Overall": "5.0", "Content": "The camera is easy to use, takes stunning pictures, and has a nice look. I am completely satisfied.", "Date": "July 2, 2010"}, {"Title": "Great Camera", "Author": "Eve1", "ReviewID": "R3R2OOIX0LPYL8", "Overall": "5.0", "Content": "This is a great camera.  I received it very fast after I ordered it.  It's easy to use, but also has controls where you can adjust more like an slr if you prefer. I am an avid photographer and wanted a smaller camera that I could have with me all of the time.  While this isn't as small as some of them, it is small enough to carry in a purse or pocket.  I had a smaller camera and was not pleased with the time lag in shooting and some of the pictures did not come out very well.  This camera has a 12x zoom, which is great for a camera this size.  It also takes great pictures whether you're taking them on the go or setting up a shot.", "Date": "June 24, 2010"}, {"Title": "Very Good Camera", "Author": "Ralph E. Garside", "ReviewID": "R1OAFRHB76PM4M", "Overall": "4.0", "Content": "I am very pleased with the quality of photos taken, and surprised at length of battery life. Charged once a month ago and still using. I am a little disappoint with flash location and its pop up for I seem to always have my finger over it and hope it does not get damaged from holding down.", "Date": "May 24, 2010"}, {"Title": "Bush Pilot", "Author": "Bush Pilot", "ReviewID": "R1OMGFRQM2KZLM", "Overall": "5.0", "Content": "Great camera. Lots of features. Like the solid feel and Cannon lens. Takes great pictures and is easy to use. Don't like the pop up flash. May be able to disable so doesn't get in the way, but haven't researched this yet. Apparently zoom does not work in movie mode when using optical mode.", "Date": "May 1, 2010"}, {"Title": "Great Product", "Author": "Donna K. Schirmer", "ReviewID": "R13QSXGTCEYGVH", "Overall": "5.0", "Content": "I ordered this for my daughter for Christmas.  She loves it and carries it everywhere we go!  Great product.  Thanks Canon", "Date": "February 11, 2010"}, {"Title": "The best you can get for a compact camera", "Author": "David Russel", "ReviewID": "R9BG5X55ACDX2", "Overall": "5.0", "Content": "It doesn't have everything, but it has quite a lot for such a small camerathe manual options are great and enables those who know how to use them to get some creative photo shooting, while the auto modes are very smart enabling normal point and shoot users to get really good pics too.the lens is quite big for such a small camera and the zoom too is great.the only two drawbacks I see in that little monster, is the fact that the flash can't be closed, it has to stay up while the camera is on.the second one is that the continuous mode is useless when the camera can only shoot 0.8 frame/second, but I suspect you can get better from such a small camera.overall, in this size range it's amazing, If you want more you'll have to go to SLR range", "Date": "December 28, 2009"}, {"Title": "Awesome images and HD Video", "Author": "John T. Mason IV \"Signal6\"", "ReviewID": "R2Z2YJFOZ5SKEL", "Overall": "5.0", "Content": "After reading some of the reviews, I was a little concerned about what I might get, but it was unfounded. Other than the small problem where my finger sometimes holds down the flash (it's in a bad position), this is an amazing camera.It's my first Canon, and I was not disappointed. I took this on a trip to Central America into some rough country and it held up well. Also, the HD video was of amazing quality. The sound was way better than I have ever heard on a camera like this, and the picture quality was first class.This was a great buy! I would highly recommend it.", "Date": "December 15, 2009"}, {"Title": "love it", "Author": "Kimberly Clark \"Kimberly Clark\"", "ReviewID": "R1YKU8WQXP59K0", "Overall": "5.0", "Content": "the zoom is great.  cant see so far away yet can stick the camera into my pocket", "Date": "December 8, 2009"}, {"Title": "finally made my decision", "Author": "Army_Wifey", "ReviewID": "R2K9I9VT4IBXF3", "Overall": "5.0", "Content": "First just want to share my experience...I got this camera before thanksgving, but there's a problem...I returned it to amazon, because there's a tiny dead pixel on the LCD I dont know if thats normal, it did'nt give me a peace of mind and it's so annoying everytime you look at your LCD, so i returned and amazon replaced it for free, Thanks for them.I really love this camera, made a lot of research then it really convinced me to buy this, all I can say this camera is compact and very powerful for zoom, you'll get used to the pop out flash...also got my review for this camera at this link:[...]Hope this also could help for some buyers!", "Date": "December 4, 2009"}, {"Title": "One of the easiest cameras I have used", "Author": "Michael D. Moraine \"Mike, \" movie buff \"\"", "ReviewID": "R1ZXPDP7VRCQO1", "Overall": "5.0", "Content": "This is one of the easiest cameras that I have used with excellent results, not for a pro, but very well suited for us laymen of cameras", "Date": "November 25, 2009"}, {"Title": "No Rewards for Customer Loyalty", "Author": "Jim Zacks", "ReviewID": "R2YCSNQ4PXVMYJ", "Overall": "1.0", "Content": "I have bought two of these cameras, one for my daughter-in-law and one for my wife and for me to use as a pocket camera.  When it was functioning the camera performed well, as I have come to expect from the many Canon cameras that I have owned.  However, one of the two cameras jammed with the lens partially extended and had to be sent in for repair, about 3 months out of warranty.  It had not been mishandled or otherwise abused, it simply jammed.  After complaining to Canon about the lack of reward for customer loyalty or the fact that it was only 3 months out of warranty Canon offered to reduce the standard repair cost my a very modest amount.  In an age where companies spend large sums of money to attract customers, it seems foolish that they were not willing to go the extra mile to cover this repair completely to retain a good customer.  Obviously my previous instinct to return to Canon automatically rather than go for the camera with the best review has been extinguished.", "Date": "November 10, 2010"}, {"Title": "Disappointed Canon fan", "Author": "M. Kim", "ReviewID": "R319A75VVF9XRO", "Overall": "1.0", "Content": "I am a fan of Canon and I have owned many Canon products in the past with no troubles, however, my recent purchase of Canon PowerShot SX200IS has been very disappointing.  This could be an isolated incident but I am not a happy customer.  I bought this camera because it's a Canon and because of its powerful zoom lens capacity and digital picture quality, however within days (2nd time taking picture on the 10th day) of purchase the zoom lens stopped retracting and became completely useless.  I usually don't buy extended insurances offered by retailer b/c I will simply refuse to buy same brand if it falls below what I come to expect from certain products.  I have sent in the camera to the Canon Factory Service Center for repair at my time and cost.  I am waiting for its return.  I have never sent in a product back to manufacturer for repair before.  Let's see how this repair thing works out.", "Date": "November 5, 2010"}, {"Title": "Fabulous Little Camera", "Author": "C. Maloney", "ReviewID": "R12R2RKX7OMVGC", "Overall": "5.0", "Content": "If you are looking for a camera that does it all..but is simple to work...this is it!  I am not the techie kind of person.  I wanted simple with flexibility and have it with this camera.  Plenty of settings from Automatic to portrait to landscape to action and if you want to set shutter speed & apature you can do that too.  It even has video capabilities.The ease of use is a godsend.  One button the turn it on, one to zoom in and one to take the photo.  You press down the button to take the photo 1/2 way and it focuses the shot. Push down the rest of the way and snap your photo.  If the camera can't focus on what you are trying to shoot because you are too close or some other reason then the button won't go the whole way down.  I like this feature.  I'm sure that it would be more valuable in a film camera...however no use wasting memory for no good reason.Photos come out clear.  It's easy to delete photos as you go or all at once.  I haven't worked much with the video settings yet.If you need a reliable camera that takes great photos this is it!", "Date": "October 17, 2009"}, {"Title": "Lens Error and Canon refuses to fix this consistent manufacturer's problem", "Author": "J. Bray \"Toby Wan Kenobi\"", "ReviewID": "R3EVZZJNX96K5Z", "Overall": "1.0", "Content": "Same problems as many other 1-star reviewers.  Out of the blue, I kept getting a lens-error.  I've had this problem on other cameras, but it was only a temporary problem.  On this camera, it is a permanent problem and makes the camera unusable.  Canon is absolutely no help as they continue to manufacture cameras with this problem (google \"lens error\"+ canon) and refuses to make better cameras or fix them without $180 fee.  I am currently shopping for a new camera and it won't be a Canon.", "Date": "January 6, 2011"}, {"Title": "Excellent!", "Author": "Becka \"Becka\"", "ReviewID": "R2XPJD18KM67L5", "Overall": "4.0", "Content": "This is a great camera- the macro is just as amazing as I expected. My only complaint is that the image quality is a little worse in low light, but that may be just in comparison to the superb macro images.", "Date": "January 8, 2010"}, {"Title": "Power Pack Camera", "Author": "Tintin \"Tintin\"", "ReviewID": "R3BFXX8H5IWSWJ", "Overall": "5.0", "Content": "This camera is for folks who wants to take a leap to intermediate level of picture taking. For people who want more than just point and shoot. Since a lot of features have been placed in this camera it is a little bulky compared to SD1200IS which was my alternate choice. Most of the major store that i went to don't have this model on display so i have to bite the bullet and order it and than find out if it is easy to carry around in my pocket. What i found that it does not easily fit into trouser pockets. However overall i love this camera's capability. One of the thing to watch out from is the popping up of flash. To avoid dropping the camera it is a good idea to always put your hands through the wrist strap and than operate the camera. The popping of flash gives less area to grip the camera. I wished they kept the flash design same as SD series. The flash recharging time is excellent.", "Date": "October 29, 2009"}, {"Title": "Amazing Camera!!!!!", "Author": "Carley Manning", "ReviewID": "R2XY5DTTTTURFC", "Overall": "5.0", "Content": "This is the best camera I have ever owned.  The features are great and the picture is just amazing!", "Date": "July 1, 2009"}, {"Title": "Did Not Last for a Few Months", "Author": "Alex", "ReviewID": "R38KXVU4QHQYYA", "Overall": "1.0", "Content": "I got my Canon SX 200IS on February 2010 and it stopped working today (November 2010) without any reason. It gives an error \"Lens problem, restart the camera\" and Canon company charges 94$ to repair it. I don't know what to do. I spent lots of money on it and it does not work now.", "Date": "November 10, 2010"}, {"Title": "Not fast enough", "Author": "Nanzilla \"Nanzilla\"", "ReviewID": "R3VGRA9082HQX0", "Overall": "3.0", "Content": "My Canon Digital Elph from 2005 has a slightly faster shutter speed. I like to catch action, and although this camera takes incredibly better photos than my Elph, the frames per second are severely lacking for 5 years later if you want to continuous shoot and get some action shots.It's a bit big and the battery does not last as long as my 2005 camera either.I did return it, just waiting for my refund.", "Date": "March 14, 2010"}, {"Title": "Nice product", "Author": "Linda Rainville", "ReviewID": "R2XYJZBXACRFC1", "Overall": "4.0", "Content": "This is a nice camera but it does have a learning curve as there are many options available. Any problems with it I think have been operator problems (me) not the camera. The more I use it the better I like it. I was using a Sony camera so this is a bit different. I love the 12x optical zoom and that is mostly the reason I bought it.", "Date": "September 12, 2009"}, {"Title": "another hit from Canon", "Author": "Smith", "ReviewID": "R1J5ZFETVP9N4I", "Overall": "4.0", "Content": "I recently purchased Canon's PowerShot SX200IS.  I have fount it easy to use with lots of options.  It takes great pictures.  The only thing I don't think is well done as the rest of the caamera is the flash but overall it is a great camera and I would recommend.", "Date": "May 26, 2009"}, {"Title": "Nice Camera....but", "Author": "ckar", "ReviewID": "RLLIHRJW7SNPI", "Overall": "3.0", "Content": "The build quality is great, aside from the plastic door for the inputs.  However, the flash is a real pain.  No matter what, every time you turn on the camera the flash pops up.  I found myself having to adjust my grip on the camera.  Why wouldn't Canon just incorporate the flash into the body of the camera like most of their other PowerShots??!!!  My pictures at high-zoom levels were pretty average.  I've come to the conclusion that if you want big zoom, buy a DSLR with a big lens!  Pocket point-and-shoots just can't compare when it comes to producing nice images at high zooms.", "Date": "May 21, 2009"}, {"Title": "It took a long and hard research, but this one won.", "Author": "Jen", "ReviewID": "RGMRDMN9XZQ14", "Overall": "5.0", "Content": "This camera is great for beginners and  advanced users. I would suggest reading the manual if you want to be technical with your photos. Can't complain about video otherwise I'd get myself a camcorder or the CANON SX20 IS which was my other debate but I needed a compact camera for now.  I can't complain about this camera because I used to have a cybershot, so it's a major upgrade!", "Date": "December 4, 2009"}, {"Title": "Excellent all-in-one camera", "Author": "PeaceForAll", "ReviewID": "R3BYMQJ670C6JH", "Overall": "5.0", "Content": "I have come to firmly believe that Canon's point-and-shoot quality and clarity is simply unbeatable in the industry for many years now. I have owned SONY, Olympus, Fuji in the past. Tested several Panasonic and other cameras. Nothing even comes close to Canon's quality of outputs.Some people here compared this to Panasonic DMC-ZS3. HELLO ??? This new camera is  12.1MP while the DMC-ZS3 is 10MP only.  You may ask whether extra 2.1MP makes a big difference? Well for 350+ bucks and for my kid's close-ups and editable portraits, HELL YEAH!This is an awesome compact camera with great beginner to professional features. It would take me many months before I realize its true potential but its intuitive manual and on-screen interfaces guide me whenever I need to play with advanced settings.If you are on tight budget and want to buy just one camera for your family, this is it.Of course, this camera has its flaws like bad placement of flip-up flash, slightly bulkier, but Canon's quality outputs more than make up for such flaws.", "Date": "June 21, 2009"}, {"Title": "Great camera - as long as you keep it indoors...", "Author": "Richard C. Layne, III", "ReviewID": "R35IUFK0I0NPQN", "Overall": "3.0", "Content": "My first impressions with the camera were fantastic. It was like buying a point-and-shoot with the legendary Canon picture quality, only with SLR-like controls and a big-ole lens slapped on top - the perfect solution for an adventure traveler that wanted high quality photos, but couldn't be troubled to carry around a big DSLR. The DIGIC4 is an excellent processor, and the camera benefits from it by an almost magical ability to capture detail in even the most extreme \"bad contrast\" situations. I was very happy for about 6 months.I bought a Pelican 1010 to protect the camera, which fit like a glove. My thinking at the time was the pricey (by comparison) camera was worth a $20 case to protect, and I would just carry it in the little Pelican when I wasn't taking a picture. Then, despite these precautions, a few particles of dust managed to work their way INSIDE the outer lens. I tried blasting canned air through the body (very carefully), but couldn't reach it that way. Unfortunately, it was right in the middle and very obvious on pictures. I planned to limp along until I could pick up a new camera, but after a few months the dust finally worked itself out and I thought my problems were over.Wishful thinking. The problem came back in the middle of an 11-day trek across the Navajo Nation and got progressively worse. It also started affecting the camera's ability to open, close and zoom the lens... I'm guessing due to dust grit blocking the fragile plastic gears on the inside. The flash stopped going back in on power-down at about the same time. While Canon might have been able to repair it for a \"modest\" fee, there was no way I would be able to send it in, let alone get it back in the middle of a trip like that. Left with either gently nudging the lens to help it along, or not taking pictures, I chose the former and managed to get almost 3 more days from it before it ultimately gave up completely.By comparison my wife's little Canon SD1100 has continued to function great despite us having it out in a SAND STORM during this trip. Of course, if I could remove the lens when I'm in camp and clean the unit, I probably could have saved it (our friends with DSLRs did this very thing after the sand storm). I know it is an apples to oranges comparison, but the point is if the USER cannot remove the lens and clean the camera then the designers should design the camera to be nearly dust tight (as they did with the earlier  SD models).At first I thought this might just be the usual problems manufacturers run into when they first bring a new concept to market. However, I've since picked up a new SD900 camera and not 2 weeks later the same dust ingress issues have happened. Now, just months later, the lens is acting up as well signaling the imminent demise of the camera. It seems they've managed to screw up my beloved SD-line as well. I remember my old SD750 ran for years, and the lens worked fine all through the time I had it. It even worked with sand grinding away at the gears in it during the month or so before I upgraded. That same SD750 is still going strong today as my friend's camera... as the saying goes: \"They just don't make 'em like they use to.\"", "Date": "October 13, 2010"}, {"Title": "Good product", "Author": "Darwiche Yossi", "ReviewID": "R3P98W4G24YP44", "Overall": "4.0", "Content": "Possitive: Very nice camera, with very good and nice functions, excelent quality, excelent zoom.Negative: Not small, medium size", "Date": "September 25, 2009"}, {"Title": "Canon SX200 IS Review", "Author": "Kimberly \"Piano Cat\"", "ReviewID": "RRZMEZ83XXZBW", "Overall": "4.0", "Content": "I still am in the testing stages of this camera.  I FINALLY GOT IT!!!  Let me recommend to any interested buyers to go the EXTRA FEW DOLLARS to purchase this from a TRUSTED website.  I had ordered this from about 2-3 other websites for $20.00-$30.00 cheaper and they ALL ended up being \"bait-and-hook\" schemes!!  So far I REALLY love this camera.  I have previously had a Fuji S1000 which had some very similar capabilities to the Canon SX200, but WHOA!!  I like the Canon SOOOO much better - especially how compact it is for SOOOOOO many extra and awesome features.  I have to keep testing the super macro setting so that I can perfect that, because the Fuji seems to be able to do a better job there - but I've only have it for a week so I've got more to experiment.  With the 12.1 MP, the shots have been incredibly clear. And with the 12X zoom - I can see things I didn't think I would be able to see!!  Haha! Lets hope this camera continues to impress me!!", "Date": "July 1, 2009"}, {"Title": "I love my new camera!", "Author": "Leah Marie", "ReviewID": "R4YX3X3LI2WGY", "Overall": "5.0", "Content": "The pictures are great. Very easy to use all the extra functionality outside the AUTO feature.", "Date": "June 23, 2009"}, {"Title": "Fatal \"lens error\" message", "Author": "J. Gentry", "ReviewID": "R3KLBZ74ZADXDV", "Overall": "1.0", "Content": "This camera worked great for 9 weeks then I got a \"lens error\" and now it's too late to return it to Amazon and Canon won't fix it. Don't risk buying this camera.", "Date": "September 6, 2009"}, {"Title": "Dropped then Lens Error", "Author": "Scott", "ReviewID": "R165M0YLCXRCA2", "Overall": "3.0", "Content": "Well, very much liked this camera...small enough to fit in my pocket but with a nice zoom lense. Then I dropped it. Sounded a little grindy after that then the lens error.  Sounds like it might be a problem with the camera generally, but since I dropped it I can't fully blame canon.  I did get about 4 years out of it.  Canon wants $111 to fix.  Talk about setting the price right at the point of indifference.", "Date": "March 3, 2012"}, {"Title": "Bad choice", "Author": "Marilyn Greene \"MGLadybug\"", "ReviewID": "R1DO341P4BHSW7", "Overall": "1.0", "Content": "The camera is heavy and hunky -- definitely too bulky to carry in my purse.  But much more important:  It takes lousy pictures.  Photos taken on automatic are out of focus and poorly exposed.  I could not wait to send it back.", "Date": "November 9, 2011"}, {"Title": "I think its good ?", "Author": "D. Brown", "ReviewID": "R1XF0ZEE96YF0G", "Overall": "4.0", "Content": "I dont really have any experience with any good cameras so i really dont know what to compare this to. I do know the features seem really manual, which i probably would re think if i could go back. i knew this going in by reading other reviews and i thought what a good way to learn about settings, etc but its pretty over my head.i havent had the camera to long, so i am still hoping i figure it out and get better shots. it might help if i finish reading the manual ;) the zoom on it is amazing, it is a bit heavy to carry around and no way it will fit in to my jean pocket. i like that you can trim and resize images and videos right on the camera. i wish it it had a few more special features like the color settings and accents, but i guess they have photoshop for that now. the panoramic stitch option is a nice touch, i have yet to try it.the video is nice, like the hd quality, but you cannot use the zoom while locked in video mode. bummer. the playback sound is weak on the camera but when you actually play it on the computer/tv it picks up voice just fine.the battery life seems really low, i think for me it was around 120 shots, which when you are on a trip or a hike that goes quick. i just ordered another battery and keep it in the carry case.", "Date": "October 9, 2010"}, {"Title": "Overall good camera", "Author": "S ks \"S ks\"", "ReviewID": "RCEIOBC0O4PZK", "Overall": "4.0", "Content": "Good: 12x zoom, wide angle, picture quality, HD video, scene modes, face detection timer, eye closed sensor, NTSC/PAL, manual settings, color accent, color swap.Bad: No optical zoom while video capture, flash remain outside all the time when camera is on.Overall a good camera.", "Date": "December 5, 2009"}, {"Title": "Canon Power Shot - a great choice.", "Author": "Mary Lou Browning", "ReviewID": "RZWCAR6JW2PNR", "Overall": "4.0", "Content": "I travelled to Switzerland last Spring and one of the people in my group had the SX 200IS.  I was so impressed with her photo shots that I could not get, that I purchased this SX 200 IS camera for a trip to China, replacing a previous model Canon that did not have the 12x wide angle zoom.  I was amazed at what this camera could do and during my trip in China my co-travelers could not believe the great shots that I was able to get. My camera was stolen and I have just replaced it with the same model in spite of many sales people trying to convince me to upgrade to HD.  I am very satisfied and love the results that get with this SX 200IS.", "Date": "November 29, 2009"}, {"Title": "Lost All My Pictures", "Author": "Jannie \"Gal\"", "ReviewID": "R3LFJCHPPAJH74", "Overall": "1.0", "Content": "After 3 months, the camera gave me a Memory Card Error message. I was unable to use the camera and I was unable to access the memory card from another camera or from a computer. I lost 3 months of pictures because I was unable to access the memory card. I ready other reviews where people had the same problem. I would not recommend this camera.", "Date": "June 23, 2010"}, {"Title": "new all-in-one camera", "Author": "J. Isaacson \"Julie\"", "ReviewID": "RQH5RZ5G0IFPT", "Overall": "5.0", "Content": "I love it.  It's easy to use and takes great pictures.  It's small enuf to take with me all the time.", "Date": "September 29, 2009"}, {"Title": "Good camera for the money, good zoom and lense", "Author": "hippie kicker", "ReviewID": "R128F5UNO4SET3", "Overall": "5.0", "Content": "this camera replaced an underwater olympus camera that was stolen. i very much like the zoom on this camera. it has 12x optical(lense)zoom and 48x overall(digital) zoom. the picture quality at 48x is very surprising, much better than i expected. good value at the 321 i paid for it, i dont think its worth much more than that if any at all. amazon could have shipped it a little better instead of just throwing the box in another box... but the camera works.", "Date": "August 20, 2009"}, {"Title": "Great camera", "Author": "Bob Schwartz", "ReviewID": "RAW7MXGTD6UV9", "Overall": "4.0", "Content": "This is my first digital camera but it's easy to use so far.  I'm learning how and this camera makes it very easy.", "Date": "September 21, 2009"}, {"Title": "Techage", "Author": "Vinh Q. Tran \"techage\"", "ReviewID": "R1P7YQEMKPKQBC", "Overall": "5.0", "Content": "Easy to use, Simple controls/menu, Nice features/settings, Bright LCD, excellent image quality, durablePro* Great picture* Great HD video (720P)* 12x zoom* Made in Japan* 28mmCons:HD video is recorded in .mov format; I have to convert them for my PS3", "Date": "April 6, 2009"}, {"Title": "Buyer beware", "Author": "Raftman \"Sir Raftman\"", "ReviewID": "R29N8SG74RO9VL", "Overall": "5.0", "Content": "Great Camera buy it here.  Found it for $229 at \"Camera Giants\"  super deal uh!  No way!  Ordered camera then was told to call for order verification. The Rep. then tried to sell me another battery because he claimed the original would only last 20 minutes! Battery cost $99.00.  Then he tried to sell me more memory cost $149.00.  When I explained that I own numerous Canon cameras and am well aware of what might be needed he quickly told me it would be a couple of weeks before they would ship the camera!  I called the next day to check on the status and was told it was back ordered and wasn't expected until late June!  I cancelled the order.You get what you pay for stay away from Camera Giants and stick with Amazon....", "Date": "April 9, 2009"}, {"Title": "Too High Tech for its own good", "Author": "Attap \"Attap\"", "ReviewID": "RUO8KG4TA7O5Y", "Overall": "1.0", "Content": "AllJust to balance the rave reviews out there. Are some of them not written by Canon employers I wonder!I bought this camera based on the rave reviews about a year ago. I wanted something compact but which offered a fast processing speed. Even back then people were warning of the flash issue etc.I - like many others who have written reviews - was happy with it during the \"honeymoon period\".After exactly a year it just stopped working. Lense is stuck in the half way posn. It has not suffered any knocks etc. I was just downloading pics and it went US. Warranty only for a year.So DONT BE SUCKERED IN BY THE RAVE REVIEWS which have no doubt been written by people who have only had the camera for a short period of time. Read the reviews who are not impressed with the camera and they all have the same issue: CAMERA LENSE AND LACK OF AFTER SALES SERVICE. You have been warned! Its a too high tech for its own good! Save your money and go for something more reliable!", "Date": "May 15, 2010"}, {"Title": "GREAT CAMERA", "Author": "HELENA WEGLOWSKI \"HELINX\"", "ReviewID": "R1NBFBLHN7P7AF", "Overall": "5.0", "Content": "BOUGHT THIS CAMERA ON A CHANCE. I LOVE IT. TAKES GREAT PIX, ESPECIALLY GREAT FOR DARK SETTINGS AS CAMERA ADJUSTS AUTOMATICALLY WHEN SET ON AUTO MODE. GREAT PRICE FOR THE QUALITY OF PIX TAKEN.", "Date": "November 9, 2009"}, {"Title": "Overall Good Camera", "Author": "Alan Hardin", "ReviewID": "R2IJV01OG9A7X9", "Overall": "4.0", "Content": "Bought this camera to replace my 5 year old digital elph 5 megapixel.  I bought this model for three reasons:1. Because it's a Canon.2. Because it has a 3 inch viewing screen (I don't know why Canon doesn't include this on all models).3. The 12 x optical zoom.Overall this is a really great camera with lots of functions and takes high quality pictures.  Not quite small enough to fit in your pocket but still a decent size given its functions.My only complaint (and it's a minor one) is the pop-up flash.  I don't know why Canon could not have put in a built in flash.  It is annoying to have the flash up even when you don't need it.", "Date": "November 9, 2009"}, {"Title": "Disappointment", "Author": "David Belleville", "ReviewID": "R1T0TDBPU69T1Q", "Overall": "3.0", "Content": "Personally, I'm not really impressed with the camera.  Canon can do much better, especially for the price.Besides all the other issues:The photos have heavy noise filtering and then sharpening.It seems to have trouble consistently focusing.The photos are a bit under-saturated even in bright daylight.Here are about a thousand photos my kid took with it:[...]", "Date": "December 9, 2009"}, {"Title": "a mini slr & hd camcoder pack", "Author": "V. Chandrasekaran \"Venky\"", "ReviewID": "R2JOJBIJ3HMLT1", "Overall": "5.0", "Content": "Got this camera few days before.I know the lens is locked when shooting HD, but normally your subject is at a constant distance so zooming in beffore taking video is not a big inconvenience. This machine is a killer in its manual control.The camera body is not that great, i has some thing to improve, but given its might i dont care about the body. After all im buying camera for its picture and Video.A good hibrid camera, im not going to buy a dedicated videocamera for videos.Many compare it with Lumix Z3 , but come on this guy is s mini slr.", "Date": "November 26, 2009"}, {"Title": "Not as good as the reviews", "Author": "K. Kosiak \"Vergasguitar\"", "ReviewID": "R35SHVSHERUUC0", "Overall": "3.0", "Content": "We liked the zoom, but were pretty unimpressed with the picture quality. We are trying to upgrade from a 3.1 megapixel Kodak and honestly, we really couldn't see much better picture clarity with the canon. You'd think that jumping up 4X in MP we'd see a remarkable difference. We didn't.We liked the camera, software is easy to install and use, and the zoom was nice, but too much money for the quality of pics. We are returning the camera and going to try the Sony Cypershot.", "Date": "November 4, 2009"}, {"Title": "Not found as anticipated", "Author": "SM", "ReviewID": "R3F3H1630BY5PK", "Overall": "4.0", "Content": "Review of the camera was very good. So, decided to buy it. Picture qualities were not as expected. Surprisingly my older canon powershot 650 IS produced better pic than this camera.", "Date": "November 22, 2009"}, {"Title": "pretty good", "Author": "deany \"deany\"", "ReviewID": "RHP3S46XL3EVI", "Overall": "4.0", "Content": "I like the camera.  Didn't know you need a card to store pictures. Many other cameras have enough internal memory to store pictures.  If you are not a camera buff it will take getting used to.  All cameras with features take getting used to.  I wanted a camera that has enough features (Optical zoom and megapixels) that I would not need to replace it the following year. I browsed through the manual the day before I was going to use it.  I was able to take pictures without being chained to the manual. Wish it came with a case.", "Date": "July 5, 2009"}, {"Title": "Disappointed", "Author": "Nancy Reeser \"Don Reeser\"", "ReviewID": "RU1MPU0VJEGGZ", "Overall": "4.0", "Content": "Canon SX200 This is a wonderful camera and it should be easy to learn to use it but the instruction booklet stinks. First it is too small and the print much smaller than makes for easy reading. The pictures of the LCDare so dark I have to use a magnifier to see what the icons are. I have 20-20 vision so I suspect I'm not alone with my thoughts. Come on Canon,you make a fine camera but spend a few more bucks and make the booklet easier to read, esp. for the novice trying to improve his photo skills.", "Date": "June 28, 2009"}, {"Title": "Not worth the wait", "Author": "ed", "ReviewID": "R1R9ILM2IF6LRK", "Overall": "1.0", "Content": "Had to return this camera after waiting over a month.After owning several Canon p/s that I was very pleased with and still own two, the sx200 is not at all what I expected. I have just returned it.The pop-up flash is just a really bad design for several reasons.The camera body has a very slippery feeling, and nothing really to anchor it in your hand with any feeling of safety from dropping.I fear it will be a real energy eater recharging batteries and replacing much to often.Bottom line, Canon has made a mistake with this camera.Guess I'll look at the Olympus 9000, or wait for the Panasonic tz7", "Date": "April 7, 2009"}, {"Title": "NOT A POINT & SHOT CAMERA", "Author": "J. Baez", "ReviewID": "R448YIGZQ7TR", "Overall": "3.0", "Content": "It just doesn't take such hot pictures. My Canon PowerShot A610 took much better pictures. I'm more of a point & shot person so maybe it's me. But if you're like me a point & shot person don't buy this camera.", "Date": "August 28, 2009"}, {"Title": "A shame", "Author": "M. Lara", "ReviewID": "R1O1WOMW06W7FC", "Overall": "1.0", "Content": "I don't really like this product!I find that is not comfortable the pop up flash.The lens retraction is really TOO slow the same as the shooter (easy to lost THE moments).The auto setting MANY times fails (really bad), you can't trust on it to take a good picture... Is better to use manual settings.The light capture is deficient the most of the times (it's a shame, maybe the worst).It was a big deception for me.Canon PowerShot SX200IS 12.1 MP Digital Camera with 12x Wide Angle Optical Image Stabilized Zoom and 3.0-inch LCD (Red)", "Date": "October 13, 2009"}, {"Title": "Disappointed ...sending back", "Author": "M. Ghosh", "ReviewID": "RV2PJ1Y21ADJ9", "Overall": "1.0", "Content": "Waited 2 months to get this camera. Got it today evening and took 50+ shots indoor and outdoor. Very bad quality indoor shots. Lots of noice and noice reduction distortion. Feels like $100 camera.I am going to return.", "Date": "April 2, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "12.1-megapixel CCD captures enough detail for photo-quality poster-size prints\n12x optical zoom with Optical Image Stabilizer; 28mm wide-angle lens\nHD movie shooting capability plus HDMI output\n3.0-inch LCD screen; Face Detection, Blink Detection\nCompatible with SD/SDHC, MMC/MMC Plus/HC MMC Plus (not included)", "Name": "Canon PowerShot SX200IS 12.1 MP Digital Camera with 12x Wide Angle Optical Image Stabilized Zoom and 3.0-inch LCD (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41vZi23UqtL._SX300_.jpg", "ProductID": "B001SER45G"}}