{"Reviews": [{"Title": "Easy to operate. Great pictures.", "Author": "rollo", "ReviewID": "R2ECV5YACRO7K0", "Overall": "5.0", "Content": "This is a nice camera, but I must address the one problem that everybody complains about in respect to this camera as well as others by Olympus. Short battery life. Don't use regular alkaline batteries or NIMH rechargeables (that Olympus recommends). They work but for only a few shots. Use only lithium batteries in Olympus cameras and you can just keep on shooting and shooting and shooting. You won't ever have any more battery problems. Lithium batteries are a little pricey but they work very well.", "Date": "June 9, 2009"}, {"Title": "Olympus FE-310", "Author": "Henry F. Haake", "ReviewID": "R14XYOU2YF5ZQ4", "Overall": "4.0", "Content": "The camera works well and is easy to use.  I did not like the way the batteries died so quickly.  If you get this camera I would recomend getting the rechargable batteries, they hold a charge much better.", "Date": "February 1, 2010"}, {"Title": "Okay for outdoor photography, slow to focus indoors", "Author": "K. Franklin \"Are we there yet?\"", "ReviewID": "R2DWRNA5V9YV31", "Overall": "3.0", "Content": "There is a lot to like about this camera - and if you want a small, automatic digicam that uses ordinary AA batteries, this is a good one - UNLESS you plan to do a lot of indoor photography under low light situations.  I found that in night-time photography, under low light situations, the camera could only achieve a focus lock in 1 out of 7 attempts.  When I turned on a few lights it was fine.  Outdoors, or in any bright light, it was just fine - great, in fact!  Close-ups were great, colors great, interface great.  BUT too infuriating under the above conditions, so I returned it.", "Date": "September 7, 2009"}, {"Title": "Wow User Friendly", "Author": "Susan", "ReviewID": "R2D2I5HMTIJLKX", "Overall": "5.0", "Content": "I had purchase this camera 1.5 ago and loved how easy it was to use and it tookgreat pictures.  Then on vacation, I asked someone to take our picture and he dropped it.It didn't work as well so I purchased the next newer model, of the same brand.WRONG, it wasn't easier to much to.  So I got back online and bought this one again.Love it !!!  I take lots of pictures with the family, work and sightseeing.", "Date": "November 9, 2011"}, {"Title": "Olympus FE-310 8-Megapixel Digital Camera - Orange", "Author": "J. Kohler", "ReviewID": "RN0YHDY7B4K4L", "Overall": "5.0", "Content": "The camera is used on a daily basis for field visits and works great. You can adjust the megapixels. It has different settings. Oh yeah - awesome color!", "Date": "December 29, 2008"}], "ProductInfo": {"Price": "$104.50", "Features": "Box Contents - FE-310 digital camera, USB Cable, Audio/Video Cable, Manual, Wrist Strap, 2x AA Batteries, OLYMPUS Master 2 Software CD-ROM, and Warranty Card\n8-Megapixel - Up to 3,264 x 2,448 resolution JPEG stills, 640x480 at 15fps AVI Movie Mode with Sound\n20.5MB Internal Memory - We recommend purchasing an optional 2GB xD picture card for practical usage\n2.5 (6.4cm) LCD, approx. 154,000 dots 2 Steps Brightness Adjustment\nMaximum Aperture - F3.2 - F4.8", "Name": "Olympus FE-310 8-Megapixel Digital Camera - Orange", "ImgURL": "http://ecx.images-amazon.com/images/I/51ZXrPixY4L._SY300_.jpg", "ProductID": "B001DLQDRE"}}