{"Reviews": [{"Title": "A Nice Little Camera with lots of zoom", "Author": "Bob", "ReviewID": "RTEN1EVA044SL", "Overall": "5.0", "Content": "*Updated 18 July 2009I bought this camera to replace my Olympus SP 565UZ.  Overall the SP 590 out performs the 565 with the exception of its much higher price.Zoom:  I think most people who are looking at this camera are doing so because of the 26x zoom feature, so I will remark on this first.  In my armature opinion the zoom on this camera is awesome.  Obviously when you are stretching out to the full length of the zoom you are going to want some kind of support (such as a gorilla pod if you're a backpacker like me) because dual image stabilization can only do so much for you to prevent blurry pictures of something that is miles away.  I have been able to capture some pretty good photos of objects that are not easily viewed by the human eye.  I do recommend using light filters, but I definitely give this feature 5 starsPhysical features:  As a previous reviewer noted, right out of the box this camera feels pretty cheap due to its larger size and remarkably light weight.  After handling it for a while I defiantly think it is more durable than the 565 was though.  Its access doors are much beefier than the 565's and it has an aluminum casing around the lens that you can grab onto.  I like this feature because the 565 had almost nothing to hold onto in the front when you wanted to add that extra two handed stability to your shot.  Once you throw some batteries into the camera the weight does go up and the cheap feeling goes down.Battery life - I love the fact that the SP 590 takes AA's instead of a Li-ion batteries (this was a deciding factor in me not getting the Nikon P90) because it guarantees that I can just pick up another set of AA's on long trips or camping where you're not around a reliable power source long enough to recharge your batteries.  I just took this camera on a two week backpacking trip and I went through two sets of Sony 2500 mAh Ni-Mh batteries.  Conservatively speaking I took well over 1000 Pictures and about 40 minutes of video on just those batteries.  I give these batteries and this camera's use of them 5 stars.Operating software:  A note on some of the software features.  The SP 590 has a built in \"beauty\" feature and a few other \"picture fixing\" programs, these features seem mostly like a gimmick because it takes a lot of time for the camera to process the images, and it's something that is more suitably done on your computer with photo editing software.  If you are in \"beauty mode\" don't plan on taking any quick shots because you can expect a 10 or more second delay between shots.Manual features:  As I've said before I am an armature at photography but one of the major reasons I bought this camera was because I had mastered what few manual controls there were on most point and shot cameras and I wanted to take the next step.  The SP 590 offers plenty of room for me to grow in this department.  This is no DSLR but it is a good in-between camera.  I do wish that there was some way to use a manual focus, like there is on the SP 570uz, because when you are using the zoom it's hard to get the camera to auto zoom on the item you are trying to capture especially when there are items like power lines between you and the shot you want.Media Card: I've said it before and I'll say it again, it finally seems as though Olympus gotten over their proprietary high horse when it comes to XD media cards.  The SP 590 and all other new Olympus cameras come with adapters to allow the use of Micro SD cards.  The problem with previous cameras was that if you wanted to take a panorama picture you had to have an OLYMPUS brand XD card.  This is not an issue with the SP 590 as it allows you to take panorama shots with any card or even just the internal memory.  The 590 also recognizes the higher write speeds of Class 4 and Class 6 Micro SD cards.  Which has solved one of the major headaches associated with VGA videos on the previous models.Video:  The SP 590 offers VGA video recording size of 640x480 at 30 frames per second.  Because the 590 recognizes the higher write speeds of the class 4 and 6 Micro SD's you can now record 20:00+ min videos without having to purchase a high speed XD type M+ card.  Another major complaint of Olympus cameras has been addressed with the zoom feature in video mode.  The SP 590 DOES allow you to zoom in and out while taking video, a feature that is not common on previous models.Megapixels: This camera does take up to 12mp shots which is great if you plan on blowing all of your photos up to a poster size image or larger.  But I usually print no bigger than an 8x10 and I don't want to fill my computer up with picture files (a 12mp picture uses over 2.5mb of space) so Leave my camera at 5mp (which only uses about 1mb of space).Over all:  Even though I feel the price is a bit high right now I give this camera 5 stars.  It fits well in the hands and takes very good pictures.  It's compact enough to take around on trips and you don't have to worry about having extra lens as with DSLR's, but you still get some of the desired features as a DSLR.", "Date": "May 12, 2009"}, {"Title": "Good for snapshots and more...", "Author": "Blair \"Biblical Hebrew Made Easy!\"", "ReviewID": "RVU3ZB1VH5HHP", "Overall": "4.0", "Content": "I've owned this camera for a month now. Here's how I rate it:PROS:-Great zoom capacity - fast.-All the shooting modes you could possibly want (I believe there are 28 picture modes)-Automatic,Manual, Program, Aperture priority, Shutter priority modes on dial-Dedicated Review mode on dial for picture viewing-Capability to go full manual ; reasonably good manual focus to infinity.-Good construction & solid build (droped it from about a 12\" and no damage was done)-Olympus Master 2 is bundled with the camera. Nice basic image editor.-Offers ISO 64-Easy menu to navigate (in color to boot!)-2.7\" LCD Screen-Liveview (lets you see picture on LCD before shooting as it will appear)-Various drive modes; Single, sequential, high 1(6 fps at 5mp), high 2(10fps at 3mp), bracket and more.-Various Auto-focus options to meet the way you want to shoot and compose.-Powerful built in flash-Amazing Macro capabilities- 3 Light Metering Options (ESP, Spot, Center-weight)- Good battery life if you follow some of the tips to keep your battery life optimal- Image stablization works reasonably well. There is a definate differance between shooting and comparing with this option on or off, but don't expect miracles when shooting with slow shutter speeds.CONS:-Shooting above ISO 100 will produce noticable noise. Only ISO 64 produces noise free images.-AF can be slow to acquire especially at full zoom or low light settings.-Image Quality is inconsistant. If you don't plan on view your images at 100%, the image quality is top notch. If you do view at 100% at 12MP the image quality is very frustrating. Some are sharp, some not so much regardless of use of tripod or not. Overall, the images are \"soft\".-Needs plenty of light-Not good for fast action if you want noise free images - although Full time AF and AF Predict are available and work reasonably well.-AF focus issues. Regardless of how accurately you focus, the images may not come out sharp even when the camera is stabalized by use of tripod, monopod, etc.SUMMARY: If you are going to use this camera for snapshots of the family, vacation, wildlife, etc. I would give it a five star rating as you will rarely view or print out your images at 100%. It is a great camera for learning the basics of camera operation and composition.If you are looking for a compact DSLR that you wont need to buy glass for - this camera will terribly disappoint you.  The image quality and consistancy simply is not there. It has often been compared to DSLR's, which simply is not fair. If you want a DSLR, buy a DSLR. This is a point and shoot with an obsurdly long zoom range and a large host of options that is very portable and easy to carry.Personally I have successfuly used this camera to shoot various snapshots and also have successfuly used the camera to sell micro-stock, albeit many rejections due to technical reasons - but I expected this as it has a smaller image sensor and cant produce the image quality of DSLRS with much larger sensors (even by 4:3 standards, I think 12MP is pushing it at this sensor size). Then again, to buy an entry level DSLR and all the lenses to get the range of this camera you'd be looking at a minimum of about $800 for a cheapo body and cheapo lenses which probably wouldnt fare all that much better against this camera...CONCLUSION: Buy it if you want a great all purpose / travel camera! The price has dropped well below MSRP and its a great value! If you are looking for a DSLR, why are you looking at this camera? Save your pennies and buy an E-Series camera from Olympus!", "Date": "July 28, 2009"}, {"Title": "An excellent, hi-res, versatile camera.", "Author": "Bruce", "ReviewID": "R219VPJ8RKP1EP", "Overall": "5.0", "Content": "I wanted a camera to take bird photos to substantiate sight records and to take landscapes and panoramas to print up to 12x16\" and this seems to do the job well.  I've had the camera for a few days and have found it well made (much plastic, but light to carry), quick to focus in sunny or moderate light, and the lens seems excellent for a zoom.  The \"movie\" mode works well, and there are a number of other worth-while features I've yet to try.  The image-stabilization has allowed me to take sharp hand-held photos at maximum zoom by leaning against a fixed object.  So far, it's been a pleasure to carry (when compared to a slr plus lenses) to use, and the results have been pleasing.", "Date": "April 28, 2009"}, {"Title": "Awsome little camera!", "Author": "T. Williams \"Timus Prime\"", "ReviewID": "R1Z2OKSRD6A86A", "Overall": "5.0", "Content": "I've owned a Canon Rebel XT for the last 5 years.  The problem with a real SLR especially a Canon is that in order to take nice pictures in a variety of setting you need 2-3 different lenses(very pricey with a Canon).  My son graduated from high school in May and after the ceremony wife promptly informed me \"I NEED A CAMERA THAT CAN ZOOM IN! Like the people who sat in front of us!!\"  I concurred.  A camera that can't what you need it to do is pretty worthless.  Fast forward to July.  Michael Jackson passes and my wife is a huge MJ fan said she wanted to go to his funeral.  So we booked plane tickets to LA.  We figured we could visit her sister while we were there.  She also reminded me in her words \"We need a GOOD camera!\"  I could have debated the fact that the Rebel XT is a GOOD camera as long as you have all the lenses but like I said without them it is pretty useless.  So I set out researching \"Mega Zoom\" cameras.  None of them have consistently good reviews.  It seems that you trade one thing or another between models.  One has a good battery life but not so good pictures.  Another takes good pictures but has a terrible battery life.  Still some have old school image stabilization.  Then I came across the Olympus SP-590UZ at the Costco website.  There weren't many reviews to be fond but it seems that the Cameras in this family of Olympus Megazooms have a good set of feature without any major trade offs.  Not to mention that 26X zoom is one of the highest right now for a Megazoom. The Costco price of $399 was something I was willing to pay since it is about as much as I'd pay for a cheap zoom lens for my Canon.  The only problem was that to order the camera from Costco would take 4-7 days and we were leaving for LA in two days.  My search for a place where I could buy the camera and have it the next day led me to Amazon.  It worked out well that the camera was $50 less than Costco and that was pretty good seeing how Costco was $50-70 less than other people.Now for the actual review:This camera takes amazing pictures.  The zoom lens worked exactly as expected.  One thing that you have to be aware of though is that the more you zoom in, the more light you're going to need.  The pictures we took outside on a tour of the \"stars\" homes turned out really well.  The pictures that we took in the Japanese restaurant at my son's farewell party before shipping him off to college also turned out well but zoom amounted to the left foot and right foot. Using the camera's zoom resulted in many streaky and blurry pictures.  The quality of the picture when done right would rival something in Life or Nat Geo.  I maybe exaggerating a little but not much.  I have never taken better pictures in my life.  And yes.  The pictures are far superior to the Rebel.  I know the Rebel is 8mp and this camera is 12mp but I think the biggest advantage is the image stabilization and the logic in this camera.", "Date": "August 3, 2009"}, {"Title": "decidely cheap feeling", "Author": "Hokie Fan \"Hokie Fan\"", "ReviewID": "R2VLYD3MM6QPC3", "Overall": "3.0", "Content": "I just purchased - and returned - the new Olympus 590UZ 26X seperzoom.  It is a very large brick of a camera body and I can see hand cramps if trying to carry it all day (and I am a big guy).  It has a very cheap feel to it - the plastics are very hard and the chrome tube of the barrel sounds hollow - not the quality I expected from Olympus at this price.  I loved the feel of the SP-570 and thought this would be better but it was much worse.The long lens had difficulty focusing at mid -zoom to its extreme at dusk.  I suspect all low light will be hampered by the aperture restraints of a 676mm lens.The image stabilization was also ineffective at mid-zoom and out.  Even with a steady hand this thing will require a tripod to get clear shots.There are neat features on the camera like panaroama that stiches inside the camera, a new double exposure feature that worked very well as many other pre-set scenes.  The camera interface has been simplified from thesp-570 and was enjoyable and easy to navigate and use without cracking the manual.But for a camera that promised to be the only lens you have to carry I was very disappointed in both performance and feel.I suspect that other new superzoons tryng to reach out past 20X will have similar issues.  I am now back to deciding between the Canon SX10 IS and Lumix DMC-FZ28 as the two best with realistic barrel lengths.", "Date": "April 5, 2009"}, {"Title": "Not perfect, but what camera is?", "Author": "David R. Hertz \"Photo Hobbyist\"", "ReviewID": "R2R6PS4JVVSSIX", "Overall": "4.0", "Content": "I've had this camera now for about a month, and am generally very pleased with it.  If your photo interest is wildlife or birds, it's a great choice.  The viewfinder works well and is necessary when zooming out. I've been able to get full (26X) zoom shots with no vibration blur, shooting handheld (brace yourself well) with no tripod.  Don't expect much zoom capability in in low light, however. Lens sharpness is not what I had hoped for, but for most purposes it's sufficient.  The camera is fairly compact and light for its size.  Wish it had RAW file capture, but......No camera is perfect, but this one is very good for the price.", "Date": "May 20, 2009"}, {"Title": "I hate that I hate it!", "Author": "Angel118", "ReviewID": "R14NRXGN9YSFE0", "Overall": "2.0", "Content": "OK, so let's get to the point. Loves everything about this camera. Light weight for what it is. Controls are pretty self explanatory if you know cameras. Battery life is awesome..or it's the Olympus rechargeable I bought! But here we go...I've been using this since June and I have to give up on it. The focus just isn't there. Doesn't matter the focal length - close, medium or full zoom the auto focus goes nuts trying to find a focus point when you think you have it...snap. (oh and you miss things will it goes nuts) Only to find out when you download the image, it's barely web quality. I hate that I now hate this camera. Come on. Kids in halloween costumes - how hard is it to focus on that. So sad to report that I'm shopping for another camera. It's so close to a perfect camera, everything I wanted but one thing I can't live without is a sharp focused photo.", "Date": "November 3, 2009"}, {"Title": "An Amazing Camera", "Author": "J. Head", "ReviewID": "R2YNXQX0FZGN1B", "Overall": "5.0", "Content": "The SP 590 UZ Olympus camera is amazing. I took some images from atop Pikes Peak and at 26x I could see cars and trucks on the streets of Colorado Springs below in the photograph.....the camera was hand held.The close up settings render very good results. The colors of the photo's are so good I don't have to make any corrections with Photoshop. The 28mm wide angle setting takes fantastic landscape images.The camera fits in my hand perfectly and it is comfortable when looking through the view finder. My only complant is the lack of ability to use a lens filters.I can honestly say that the SP 590 UZ is the best camera.....both digital and non digital....that I have ever owned. It is also very easy to use with several programmed settings for different situations. I have put the camera on a tripod and taken some good images of the moon at 26X.I have been pushing a shutter button since 1974 and consider myself an experienced photographer. I can honestly say that the Olympus 590 UZ is a great camera for both an experienced or a first time photographer.", "Date": "September 11, 2009"}, {"Title": "Excellent light and versatile camera", "Author": "Warrenton Naturalist \"Bob\"", "ReviewID": "R2KULH8KIUSUI6", "Overall": "5.0", "Content": "This camera has provided me great pleasure and excelled for the purpose I purchased it - nature documentation.  It is a continuing wonder how Olympus was able to get a lens group to go from a 35mm camera equivalent of 26mm to 676mm with an excellent macro capability.  It has provided tac sharp images of plants, dragon flies, damsel flies and butterflies, which were subjects I wanted to use the camera for.  I have a first generation digital SLR and this camera generally takes far better pictures.  It is not perfect, and certainly no competition for the current generation SLRs as far as image quality in demanding requirements, but it is far easier to carry on long walks with other equipment.  The image stabilization works well, even at full zoom, hand held, in reasonably good light.  The \"reasonably good light part\" may be the slight weakness of this camera.  Without moderately good light, the auto focusing can sometimes be difficult on small objects and some noise is introduced in the images.  However, I don't want to overstate this problem, as this is certainly an issue to some degree with other cameras in this class.  In any case, I would highly recommend this camera for anyone who wants a very versatile and light camera - until next year when some manufacturer comes out with an even more marvelous camera.", "Date": "June 20, 2009"}, {"Title": "Excellent semi pro camera", "Author": "Ganesh C. Nandy \"GCN\"", "ReviewID": "R2SCVT8K1IWZTB", "Overall": "5.0", "Content": "So far I have been very pleased with the camera.- The picture quality is very good- Going from wide to zoomed is definitly a plus- Light - easy to carry- Great manual adjustments- All the connections covers are solid - big improvement from previous versionsOlympus lived up to its quality.", "Date": "April 18, 2009"}, {"Title": "Wonderful machine!", "Author": "Maria Santa Cruz", "ReviewID": "R11JIZSZ8PCCM1", "Overall": "5.0", "Content": "Truly wonderful camera... I have had it now for 3 weeks, taken well over 800 photos and love this machine!!  I highly recommend it!Pros: It is intuitive to use, great photo quality, good color resolution and feature loaded, battery life is great -I got 3000 mah batteries and have taken over 400 photos on one charge and still had a full charge indication, I especially like the fact that I can use regular AA batteries and not proprietary packs as with other makes  , micro SD card was a BIG decision maker for me and it works just fine (I got the 8 meg card), features like panorama, double exposure and fireworks are great, Manual features are good and intuitive to use, I looove the program mode which allows you to tweak some features, Back of camera is uncluttered and buttons are simple to find and use without looking, I mostly use the viewfinder and find its resolution great, some have complained in other reviews that autoflash is a drawback - i personally love that feature since I like to take pix under natural lighting conditions, I do very little filming but what little i have tried, is great, Resolution: i take all my pix at full resolution giving me a chance to edit on my PC as needed, some have complained that the camera has a cheap feel to it - I did not find that to be the case - I tend to strap the camera to my right hand so I can use it when needed, having a heavier camera would be an issue. Anyway, a large lens means more light getting inside hence the size... I was a tad worried about focus sharpness as some reviewers stated - worries were unfounded, pix are perfect. Image stabilization works as advertised but does tend to suffer in low lighting conditions (as to be expected). ISO options up to 6400 is handy but useless - Photos turn out overly grany as to be expected. In good lighting conditions, the camera works as promised, a charm to use. In low lighting read \"cons\" further down...  Night photography (WITH tripod) works very well when ISO is set to 100 to 400. If set to AUTO it tends to go to much higher values and pix turn out grainy. Display works very well even in bright sunshine, portrait features are great. This camera is great, it does not pretend to be a Pro DSLR or anything like it so don't compare it with oneCons: under low lighting conditions (with no flash use) or extreme zoom, autofocus CAN hunt. Low lighting photos (without flash) are tricky.Conclusions: I give this camera 5 stars,  I would recommend it to anyone, that simple!", "Date": "January 3, 2010"}, {"Title": "Pretty good point and shoot camera.", "Author": "William R. Smith \"Bill Smith\"", "ReviewID": "R112PPW6JZOLK7", "Overall": "2.0", "Content": "Olympus SP-590UZ 12MP Digital Camera with 26X Wide Angle Optical Dual Image Stabilized Zoom and 2.7 inch LCDThe Olympus SP-590UZ is a very acceptable point and shoot camera except that it autofocuses poorly in low light.When I tried to use it as a more sophisticated camera I found the features very difficult to use. At first I blamed the badly written manual but I then realized that the camera system was a fault. Having had a long career as a successful software engineer I recognized a product of horrible software engineering. In order to use a feature you have to know what other features have to be turned off or on in order to make your desired feature work. In software engineering terms the features are \"pathologically connected\"", "Date": "July 2, 2009"}, {"Title": "Olympus Rocks!", "Author": "Lucky", "ReviewID": "R3IVB31U5HWJXX", "Overall": "5.0", "Content": "I bought this camera after totally exhausting my Olympus C-750 UZ for eight years.  I was not disappointed and found the SP-590UZ well worth the wait.  We recently went on vacation and relied 100% on this camera for all our memories.  I was not disappointed.  It was easy to use and simple to switch modes.  The on screen cropping feature is so much easier.  The 12 MP gave us crystal clear pictures, even after cropping to a desired size.  The playback features for the HDMI television screen is great, with plenty of options.  Thank you Olympus for your continued dedication of fantastic pictures and digital cameras to capture detail.  OLYMPUS ROCKS!  If you want an reasonably priced camera that can do it so many things withoutOlympus SP-590UZ 12MP Digital Camera with 26X Wide Angle Optical Dual Image Stabilized Zoom and 2.7 inch LCD having to switch lenses all the time, this is it!  You won't be disappointed! Read all of the options for this product, it does it all!", "Date": "August 25, 2009"}, {"Title": "Good for what it's for...", "Author": "smartypants \"pantsonfire\"", "ReviewID": "R1UMMGO5W28Q3Q", "Overall": "4.0", "Content": "This camera is great at doing what it was meant to do:  Combine a decent zoom feature in a small-bodied, hand-held, relatively cheap package.It is inexpensive enough that I can take it on vacation without worrying too much about breaking it or having it stolen.  It takes great photos close-up and pretty darn good ones from a distance.  It is not a professional photography setup, OBVIOUSLY, so if you are looking for a professional quality camera, look elsewhere.However, this is a very nice crossover camera or compromise if you are tired of the snapshot quality of your amateur photos due to limited control of an automatic camera, but don't want to spend a thousand bucks on a camera and lenses you only use occasionally.Pros:+ One camera does it all on vacation, without having to worry about switching lenses for wildlife photos.+ Price point is great, when you consider the quality and convenience.+ It has a real viewfinder, so when the light is weird, you are not totally dependent on the LCD panel (which is large and in color BTW).Cons:- Batteries die and die and die some more.  Automatic lenses eat batteries - it's a fact.  However, this thing is a total battery hog.  Even just turning the camera on engages the lense!  Why on Earth?!- You can't turn it on at all without removing the lense cap, not even just to view photos in the memory.- The battery door hinge is right next to the connector for a tripod mount, almost touching it, so you CAN NOT change the batteries without upsetting your tripod setup.  You can't do stop-motion with this thing at all because of this limitation.My advice?  Buy it!  But also get a large camera case, so you can fit in all the extra batteries you'll need to pack.  (I bought the special case for this camera and it is way too small.)  And DEFINITELY invest in a bunch of rechargeables with a car charger.I am actually very pleased with the camera, even with its limitations, because of its flexibility and the low price-point.  You get a lot of bang for your buck, even if you do have to mess with batteries a lot.", "Date": "May 27, 2010"}, {"Title": "Poor owners manual", "Author": "Janice Carver", "ReviewID": "R38NMO6W5AGGGW", "Overall": "4.0", "Content": "The camera performs ok. The owners manual was of very poor quality. I even used a magnifying glass to try to read some of the blurred symbols.Before purchasing camera, go to Olympus home page and lookup online version of owners manual. The printed version is just as bad as this.", "Date": "October 12, 2009"}, {"Title": "Olympus SP-590UZ 12MP Digital Camera with 26X Wide Angle Optical Dual Image Stabilized Zoom and 2.7 inch LCD", "Author": "Joung R. Cook \"JR\"", "ReviewID": "R5EOB636KSDW0", "Overall": "3.0", "Content": "I bought this after I had ruined SP-500UZ, an older 10X model that fits in my palm.  A couple od drops of orange juice around shutter totaled it.  SP-590 is about a cm wider, 1.5 cm taller, and 2 cm deeper than SP-500.  It is amazing theat Olympus made it zoom 26X optically with this size.  I am not a professional photorapher and rarely print larger than 4 x 6, which does not need 12MP sensor.  So I nearly exclusively use 3MP mode unless I come across an image I want to enlarge larger than 8.5 x 11.  It is nice to have the reserve capability. It gives me every capability that any SLR camera with expensive zoom lens would offer.  It indeed is a replacement for most complete set of SLR package; from pretty good wide angle 27mm to ultra high zoom nearly 700mm.  But there are some down sides.  The images are not as clearly defined as I like, not even as goos as SP-500.  They do look like images from inexpensive long telephoto lens, even at a low zoom.  The focusing seems to often take a long time to settle down.  A minor inconvenience but it is detrimental in quick shooting situation.  It is not even close to a regular telephoto lens is sticking out in the front.  But it is physically thick for a point and shoot digital camera.  Perhaps that is the reason for less than satisfactory image qiality.  There seems to be a limit as to how low an optical distortion can be achieved within such tight physical space.  Yet this is the best camera I know that would give wide angle to ultra zoom in almost point-and-shoot digital camera size.  Of course with other bell and whistles like 12MP, image stabilization, white balace and so on.", "Date": "May 16, 2009"}, {"Title": "Very versitile compact digital camera", "Author": "David Siegfried", "ReviewID": "RFQUROL3SOYAA", "Overall": "3.0", "Content": "I have had this camera for about three months now and have had a chance to take photographs in many different situations. Olympus is currently the leader in the ultra-zoom compact digital market. (I don't like to call these cameras point-and-shoot, because the features are as advanced as many SLR cameras.) In my opinion, this is one of the most versatile compact digital cameras available right now, although it does have its drawbacks. Here are the pros and cons of this model:Pros:The lens range.  The ultra-zoom lens is the main feature of this camera and the reason most people are considering this model. It has an effective zoom of 26-626mm, which is the largest range of any zoom I have ever used. I don't know of any SLR lenses that have such a wide zoom range. Plus the 5x digital zoom increases the effective focal length to a ridiculous 3130mm. It is generally inadvisable to use digital zoom, however I used it for a moon shot and got excellent results (see my photo under customer images) so don't fully discount this feature. In addition, the lens is relatively light and only extends out 2.5\" at maximum magnification. And it does all this with a relatively fast f/2.8.Controls.  This camera has all the controls of a full-featured camera, from fully automatic to manual control of just about everything. I won't run down all the different settings, but it has shutter speed ranging from 1/2000 second to 15 seconds, and ISO from 64 to 6400. It has two macro modes for extreme close-up photography and several modes of auto-focus as well as full manual focus. This makes it very versatile for both the novice and experienced photographer.Image Size. 12 megapixels is at the high end of compact digital cameras. The images at full resolution are huge, large enough to be printed at 11 x 17. I mostly display my images on screen so the advantage for me is that they can be re-sized to increase sharpness and reduce noise. (Pushing the size to 12 megapixels does seem to introduce more noise in the image.)Viewfinder. It has a very large 2.7\" LCD viewer as well as a true viewfinder (something many compact digitals are doing away with these days).Menu. The Menu is pretty straightforward, there aren't multiple levels to have to bury through.Image Quality. The image quality is quite good, particularly at ISO 64 and in the wide and mid-range of the lens. Sharpness leaves something to be desired, however, and drops off noticeably at the long end of the zoom (see cons).Ease of use. The camera does not have a steep learning curve, and feels good in the hand. The controls are not all that complicated, especially for an experienced photographer graduating from an earlier model (I am moving up from an Olympus C-5050 Zoom and this camera is a joy to use by comparison.)Flash.  I am not a fan of most images produced with a built-in flash, however the flash is decent, produces more natural colors than my previous C-5050 and I like the fact that the flash is never engaged unless it is popped up.New Modes.  This camera has some new modes such as Beauty Mode and 14 different scene modes. Being an experienced photographer I like to have control of the way the camera shoots, so I probably won't use these much, and can't give an opinion of them except that the Beauty Mode does do a nice job of softening face wrinkles.Cons:Lens sharpness.  This zoom lens is a joy to use however the images it produces are not nearly as sharp and clear as I would like. Of course when you pay under $400 for the entire camera, there has to be some trade-offs in the optics. This built-in lens is never going to rival any of the high-end SLR glass from Canon or Nikon. The lens is not crisply sharp at any focal length: at the wide end there is noticeable softening of the image around the edges; the lens performs pretty well in the low to mid-range of the zoom but image quality at the far end of the zoom is equivalent to a cheap telephoto, with quite a bit of chromatic aberration. These imperfections can be compensated for my shooting at the full 12mp and then reducing the image size in Photoshop. Then sharpening must be performed to make the images look good. You can get some really great shots, just don't expect full professional quality with this lens.Noise. The noise levels are a lot worse than I would like, beginning at ISO 200. ISO 400 is pretty poor, and starting at ISO 800 the images are really unacceptable in my opinion. ISO 1600 is just terrible, but for some reason the image quality improves at ISO 3200. I had hoped for better low-light performance with this camera, so don't buy it if that is your goal or else stick with the flash when shooting indoors.Quick Menu. Although the menu is greatly improved over my C-5050, the quick menu seems to be lacking. I wish more of the controls were easily accessable, particularly exposure compensation +/-. My previous Olympus had a dedicated button for that.No RAW mode. It really bothers me that camera manufacturers are leaving RAW mode out of the newer cameras. I am sure that the image quality of this camera could be improved if the RAW versions of the photos were available. Image processing in a camera is never going to match what you can do with Photoshop. Casual users usually skip RAW, however I think they should keep RAW mode available for enthusiasts like myself. This is a high-end camera, it should have RAW mode!Static LCD. The LCD doesn't pivot or move in any way. My old C-5050 had a pivoting LCD and I'm disappointed they didn't retain this feature. It comes in handy in tight spots.Movie Mode. It's only standard resolution but the videos look very good so that's not really a con for me.Conclusions: This is a highly versatile and fun to use camera, particularly the zoom. Although the lack of sharpness in the optics was a disappointment initially, when the images are re-sized and sharpened they can be quite spectacular. I have impressed my friends and family with the images I have obtained with this camera, particularly the macro and long shots. (Please see the photos I uploaded for examples; my descriptions all end with my initials, DJS.)Although these are not professional grade optics or sensor, the SP-590UZ is a great piece of equipment for the price. It's a take-anywhere-do-anything camera. I'm finding it a pleasure to use and I highly recommend it for all outdoor hobbyist type of shooting, where it excels preferably at ISO 64 or ISO 100, or indoors with a flash. Look elsewhere if your shooing situations are primarily indoors and/or low-light situations.Final note: Olympus came out with an even longer 30x zoom, the [Olympus SP-800UZ 14MP Digital Camera with 30x Wide Angle Dual Image Stabilized Zoom and 3.0 inch LCD]. But they dumbed it down with exposure control being strictly automatic and there is no viewfinder. As opposed to this camera, it's a true point-and-shoot.11-20-2010 Update:I am downgrading my rating from four to three stars. This camera is still easy to use, but the new Canon SX30 SI super-zoom that is out now has a longer range, better optics and less noise. The noise on this Olympus at 400 ISO is barely acceptable. Olympus needs to produce a better sensor with less noise and better lens sharpness if they are going to keep up with Canon. See my review under Canon SX30IS 14.1MP Digital Camera with 35x Wide Angle Optical Image Stabilized Zoom and 2.7 Inch Wide LCD for details!", "Date": "July 6, 2010"}, {"Title": "Great superzoom", "Author": "Apryl S. Brown", "ReviewID": "R2NOEO6OA8TWEX", "Overall": "4.0", "Content": "Overall, I like it, I did a lot of research before deciding on this camera. My biggest complaint thus far is the XD pix cards, not a big fan.None of my videos have sound to them, don't know if I've done something wrong or if it's a defect, have yet to figure it out and since I don't use that feature very often, it's not a huge deal to me but something I def. need to look into.", "Date": "March 2, 2010"}, {"Title": "Olympus SP-590UZ 12MP Digital Camera", "Author": "Erik B. Christensen", "ReviewID": "R1GLA3JGXW1DIU", "Overall": "4.0", "Content": "Bought this camera as a replacemnet for my Olympus SP-500 UZ. I like the extra wide angle as well as the 26X optical Zoom. Have taken about 1000 pictures since I bought it a month ago. It feels good to handle, even taking pictures with single hand holding, image stabilization works very well. It is an impressing camera.I really like the wide angel as well as the 26 by optical zoom, but am still getting familiar the various avaiable settings, it seems slightly more complicated than my previous model.I have only 2 negative points to mention:1. It seems to eat batteries, and I find myself changing settings to conserve battery power by turning off review, and using the viewfinder in stead of the LCD.2. The lens cover is solid but does not stay on, any little touch or bumb and it falls of. It does not have a nice latching mechanism like the lens hood on my SP-500 UZ", "Date": "February 11, 2010"}, {"Title": "Olympus SP590UZ", "Author": "Katherine Linfoot", "ReviewID": "R1LXZGGV45FFQW", "Overall": "4.0", "Content": "Love the camera.  I chose it because it has the option of optical viewfinder.  I wouldn't want it any other way.", "Date": "April 6, 2011"}, {"Title": "Olympus SP-590UZ", "Author": "R. Johnstone", "ReviewID": "R1V52B55JYJVMR", "Overall": "4.0", "Content": "Full automatic to full control. A good range for the more ambitious amateur. Olympus should create a camera that allows lens filters. This doesn't without and extension tube and wide angle distortion. The cable that comes with the camera allows you to download to your computer. I'm using a 4 GB SD card but Olympus recommends a 2 GB card. It seems to be working. The camera comes with very little memory. You will definitely want to order an SD card to allow you to take more than a few pictures. I wish there was a good instuction maual to go with the camera. So much potential, so little time.", "Date": "February 22, 2010"}, {"Title": "Great general use camera", "Author": "J. Schroeder", "ReviewID": "R2XEOSD94EFGIO", "Overall": "5.0", "Content": "This is an excellent camera for general use, though it might dissapoint a professional (only jpeg output, as far as I can tell so far).  That comment also illustrates my main problem with the camera.  It has many, many great features - but they are poorly documented.The range of the optical zoom is amazing - and can be extended with a cropping option, without hurting picture quality, to over 30X.  Add the optional 1.7X telephoto lens (from Olympus) and you have a camera that can also be used for astrophotography - though at that magnification, you need a tripod.For general use, the auto-stabalization works fine.  There is also a remote shutter attachment available for tripod use.Lots of automatic shooting modes - plus a full manual mode.  Can't think of anything more to ask for there.", "Date": "February 14, 2010"}, {"Title": "Olympus 590UZ", "Author": "R. Cunningham", "ReviewID": "R1Q3YGNCATQF0K", "Overall": "4.0", "Content": "This is a decent camera, with a really long lens.  Lots of features will keep you busy learning.  It's not a DSLR, but pic quality is adequate for most people.  For the money,{around $300}, it's a great deal.", "Date": "January 30, 2010"}, {"Title": "Wonderful Camera", "Author": "L. Stone", "ReviewID": "R1NF8Z076Z18PC", "Overall": "5.0", "Content": "I have had this camera for almost 2 weeks and I love it.  I find that the controls are easy to use and the camera is well balanced.  I am a 5'2\" female with a small frame and this camera fits in to my hands quite nicely.  My Dad who has very large hands also had no trouble with the controls.  It can be used right out of the box on auto, and after browsing the manual it is easy to figure out all of the menus.  I would not recommend this camera to someone who is challenged when it comes to electronics, but for any one who can navigate cell phone menus you should have no problems with this camera.  I am up-grading from a Kodak Z-712 and I can not believe the difference in the cameras, not only in the quality of photos but also the camera in my opinion is better built.  I would recommend this camera.", "Date": "January 29, 2010"}, {"Title": "GO  OLYMPUS !!!", "Author": "Alexander Kostromin", "ReviewID": "RM1793J7TLWGT", "Overall": "5.0", "Content": "I have 35 year experience in Photography. This camera has very good parameters such as zoom, which is simply amazing. Quality of pictures and videos that it produces is excellent and price is very good. Before I had a film camera by Olympus which was very good. GO OLYMPUS !!!!!!", "Date": "December 4, 2009"}, {"Title": "Great Camera, I'm still playing with the different settings", "Author": "School Marm \"Sara J\"", "ReviewID": "R3741MEO25QZLW", "Overall": "4.0", "Content": "I am an amateur photographer. I take pictures at parties, trips and special occasions.  A friend of mine recommended this camera. I'll be traveling to Europe later this year, and wanted a good easy-to-use camera to bring with me.I really love the 26x zoom feature of this camera. I went on an architectural tour of Boston, and was able to zoom in on the detail of a building that was a couple of blocks away from me.  The zoom control was pretty fast which was sort of frustrating.  Still the zoom-in detail of the buildings came out very nice.There is also a feature for shooting close-ups if you would like to shoot a picture of a petal of a flower or intricate embellishment on fabric.I'm still trying to learn how to use the flash in a party environment.  It takes about 3 seconds for the red-eye light and series of flashes to occur before the picture is taken.  Sometimes the pictures come out blurry, or sometimes there's too much flash, or not enough.  I need to keep playing around with the settings.Over all, I'm happy with this camera.  I know there are a lot of features I still need to discover.", "Date": "November 29, 2009"}, {"Title": "Researched it...bought it...LOVE IT!!", "Author": "W. Burks", "ReviewID": "REBSBXNICX40F", "Overall": "5.0", "Content": "Read the reviews for all models you're interested in and then make your own decision.  That's what I did, and it led me to choose this one.  It's an AMAZING value here at Amazon w/ an already discounted price, NO TAX, and NO SHIPPING.  All of these factors made this exceptional camera available at an exceptional price.  I LOVE the zoom...it's the furthest zoom available without purchasing an SLR. When I zoom, I get amazing, up close pics of my kids on the baseball field, my sister graduating in a large stadium, etc. Everyone who sees my camera and what it can do is instantly envious.  I have bumped the long zoom lense a couple times, and it didn't break...very durable.  Buy it, you'll love it and feel like an accomplished photographer!!", "Date": "September 12, 2009"}, {"Title": "Just what I needed.", "Author": "Cathrine loew", "ReviewID": "R3DUCT3LPPN4LM", "Overall": "5.0", "Content": "This camera is perfect for the price.Lots of attachments are available!Takes a multitude of different styles to fit all occasions.", "Date": "March 18, 2013"}, {"Title": "This is a great camera.", "Author": "wayne myers", "ReviewID": "RTIZ6UI4OTXSI", "Overall": "5.0", "Content": "This Olympus camera is great.  The zoom is the reason I bought this camera and it out performs my Canon SLR with a 300mm lens.  The focus is very quick for a digital all-in-one and picture color is outstanding.  Another great feature is the use of AA batteries instead of a dedicated battery that requires a special charger.  If I run out of rechargeable AA's I can use alkaline AA's to tide me over.", "Date": "December 28, 2012"}, {"Title": "Second TIme Around", "Author": "Dixie Sutton", "ReviewID": "R2JBAGV3U9VXH4", "Overall": "5.0", "Content": "I bought this same model of camera about 3-4 years ago and I love it.  It was my first digital SLR camera and I found it a great beginner as well as an advanced user camera.  The screen got broken in an accident and I tried another model but was not happy.  I was so happy to find this camera at a great price in the Amazon warehouse.  I had never purchased any thing from the warehouse before but I wanted this model of camera again because I was so comfortable with using it and loved the quality of pictures and everything about it.  I have now had the camera a couple of days and tried it out and it is just the same as the old model and I could not be happier.  Thank you Amazon for always being there.", "Date": "June 21, 2012"}, {"Title": "Wish I had never purchased it", "Author": "A Working Mom", "ReviewID": "R31K5XYN0ODDF1", "Overall": "2.0", "Content": "Why I bought it: It sounded good \"on paper\" and in most of the reviews.Good things: I love that it takes AA batteries and it has had great battery life. I don't feel it is \"cheap\" feeling as some other reviewers have complained; it has a good weight with the batteries in it, not too heavy to hold all day. The picture quality is good when the pictures turn out right, but there are a lot of pictures that don't turn out...Major complaints: It takes forever to focus (and thus I can't get the several shots/second as I like to do). In fact, there is often a delay and there have been several times when I press the button to take a shot and nothing happens. I STILL haven't figured that out. The image stabilization does NOT work. I'll admit I've tried taking pictures mostly on Auto mode, but even after reading the manual it's difficult to use in other modes. I have tried. Frequently pictures that are taken are blurry or otherwise of poor quality.Minor complaints: The neck strap broke within a few days of my putting it on (slid out of the slots). The lens cap never fit snuggly. If you turn the camera on, the lens cap immediately falls off because the lens automatically extends. You can put the camera in review mode every time you turn it off and that won't happen, but it's a design flaw and shouldn't require that kind of preplanning on the part of the photographer just to ensure the cap doesn't pop off.MAIN POINT: I wish I had never purchased it and am still looking for something that meets my needs.", "Date": "June 6, 2011"}, {"Title": "If only the lens would not stop working...", "Author": "TJP9668", "ReviewID": "R2W3FR5KPH8J6F", "Overall": "4.0", "Content": "I've had this camera for just 11 months - it replaced another Olympus SP series (earlier model) camera that ironically (?!?) had the EXACT SAME PROBLEM occur without any accidental or purposeful damage to it.  Yesterday in the middle of a day of tourist photo shooting my lens stopped working - turn on the camera and the lens will not activate - no zoom, no wide angle, no capability of taking photos.  The battery indicator is full.  I can access the menu and review photos but that's all.  I did not get any dirt or oil on the lens or within its housing.  I'm truly at a loss and can only be thankful I carry a \"backup\" point and shoot for such occasions.  I'm not sure if this is just something that has happened to me TWICE with the same SP series camera but I am severely disappointed.I otherwise LOVE the mega-zoom, the AA batteries (only use the 8x longer Energizer type because otherwise the camera eats batteries for breakfast and is hungry by lunch time but with the long life batteries I can get about 500 photos out of a set of 4), and the quality of photos.  Another downside is that I have worn off the labels to the buttons on the click wheel.  I've put about 3500 photos on this camera before its untimely demise and put about 5000 photos on its predecessor.  I like Olympus, have only Olympus cameras (my 3rd ultra zoom, my 5th overall) and their XD format memory cards so I'd greatly appreciate the ability to remain brand loyal.", "Date": "April 17, 2011"}, {"Title": "I should have believed", "Author": "KP", "ReviewID": "R10IY20KNS045F", "Overall": "3.0", "Content": "I've always had Olympus camera's, and this is the worse I have had...I read reviews that said it was hard to get a sharp pic when fully extended, and that is so true.  I'm really good at holding a camera steady, but this is very hard to keep steady when extended to 26X. And the camera is heavier than I thought it would be.  Also, it doesn't take very good low light shots, just like I had read from other reviews...I also don't like that you only have the choice of 12MP or 5MP, nothing in between.I should have believed the other reviews...but I will keep the camera, and use it with a tripod when I have something far away that I want a close up of...It seems ok when you aren't shooting with it fully extended.", "Date": "December 23, 2010"}, {"Title": "Nice camera", "Author": "Tony  S.", "ReviewID": "R75AONN8VX97R", "Overall": "5.0", "Content": "This is my second Olympus camera and I am very pleased with its performance so far. I am no expert by any means and I can use this camera without any problems. The picture quality is excelent with the exception of low light pics. My last Olympus wasn't good in low light, dawn and dusk pics either. Even on its low light settings. Not sure why. The 26X zoom is awesome, and the main reason I upgraded. I take alot of widlife pics and it really brings distant critters in close. Big LCD screen, easy navigation through its functions and AA batteries I can buy anywhere. Overall I'm very happy with it.", "Date": "December 12, 2010"}, {"Title": "Performs As Advertised", "Author": "DoubleDAZ", "ReviewID": "R29ZT278MF9TUB", "Overall": "5.0", "Content": "I won't add to the reviews that have already been posted except to say the SP-590 performs as advertised and as expected.  My wife loves it and I'm quite surprised by the image quality.  We bought it mostly because new digital cameras, other then dSLRs, seem to be dropping the viewfinder and that is a necessity for us.  To be sure, there are plenty of things I don't like about it, but that's why I have a dSLR for myself.  :)", "Date": "August 25, 2010"}, {"Title": "pleased with Olympus sp590uz", "Author": "James W. Hepp", "ReviewID": "R22KI1DE43D4XF", "Overall": "5.0", "Content": "This has more features than the Nikon L110. I had one of those first and thelense when extended locked 3 times in the first24 hrs I had it , so back it went and I ordered an Olympus. It has more features. It has threads at the end of the lense housing that I bought an adapter that allows me to transfer all my slides to a memory card to put them on the computer and then to a flash drive. It works great", "Date": "April 22, 2010"}, {"Title": "Olympus SP-590UZ", "Author": "J. Edward Vaughan \"Ed\"", "ReviewID": "R1CEZ3OY2OAKA4", "Overall": "5.0", "Content": "The Olympus SP-590UZ does exactly what I bought it for starting with the fact it has a 26 optical stabilized zoom, then it has 12MP for clear photos. Also it uses regular AA batteries so no problem running out of power. Then the price was good for the feature that makes it a good deal.I have been using it  since I bought it for all my photos since it is easy to use, does a good job on close-ups, and then you can zoom in on something that you would not be able to get a photo of. It is also lightweight because it is mostly plastic.I would recommend it to anyone looking for  a camera for the reasons I did.", "Date": "April 11, 2010"}, {"Title": "Camera review", "Author": "Stanley Horwitz", "ReviewID": "R1130H2LR626I9", "Overall": "5.0", "Content": "I have used a lot of digital cameras, but this one is by far the most compelling in terms of the wide range of features it offers and its 26x optical zoom lens. I love the in-camera panorama and the double exposure features. The camera yields very clear images, and it offers good manual controls. For the price, this camera is loaded with useful features and functionality.", "Date": "February 11, 2010"}, {"Title": "Easy Right Out Of The Box", "Author": "E. T. Obrien \"Timtruro\"", "ReviewID": "R3FSJXLYYZ9458", "Overall": "4.0", "Content": "Pros: This camera was easy to use right out of the box.  I am basically a point and click guy but the various programs allow a wide range of flexibility.  I love the 26x zoom but do have trouble keeping it steady at 26x without a tripod or some other stabilization.  The macro and landscape shots are great.  Very light weight and priced right compared to Canon and Nikon models with fewer features.Cons: Thought I would see a great deal of difference in picture quality between this and my 3 megapixel Olympus but have not.  I probably will as I blow up some of the shots to larger sizes.  The manual is difficult to follow for the more complex aspects of the camera.Overall:  A very good product for the price.", "Date": "January 22, 2010"}, {"Title": "olympus sp-590uz camera", "Author": "the buyer \"the buyer\"", "ReviewID": "R1FP6XE2IIBHQN", "Overall": "5.0", "Content": "so easy to learn how to use and even easier to use! great product 5 stars!", "Date": "December 31, 2009"}, {"Title": "Cute, Awesome Little Camera!", "Author": "Spastic Cat", "ReviewID": "R3F81SIPU7F38V", "Overall": "5.0", "Content": "I like this camera very much! It exceeded all my expectations. I would recommend buying it!", "Date": "November 6, 2009"}, {"Title": "SHAM - DO NOT ORDER THIS MODEL", "Author": "B. Logan \"soakbear\"", "ReviewID": "RII4KQPRT9YFR", "Overall": "1.0", "Content": "Would have loved to be able to review this camera but I was NOT sent the right camera. I was sent an SP810, newer yes, but totally a different picture card and needs proprietary batteries! I was replacing an older Olympus and picked this one specifically - they claimed there were none in stock and it said 13 were available! The price difference was ridiculous and they would NOT refund me the same price I could have gotten the 810 elsewhere. I kept the 810 as I was in urgent need of a camera for a wedding I was photographing, but I still revert to using the older Olympus even though it has a broken battery door now... the company offered to give me a battery to the new camera to appease me, but they never sent it! I let them know I was unhappy as I could have had FREE Prime shipping if I had ordered the 810 elsewhere! They were very uncaring and thought I should be happy with the new one even though it was NOT what I wanted!! Do not buy from them!", "Date": "October 28, 2013"}, {"Title": "Very very good camera", "Author": "JOSE MACHADO JUNIOR", "ReviewID": "R406POZYXIRYD", "Overall": "4.0", "Content": "I really like this camera, although I believe its features can be a bit difficult to operate.Completely worth buying.", "Date": "March 9, 2010"}, {"Title": "Very Good if you have never used an Cam From Olympus", "Author": "S. Bryant \"Music Lover - Urban Mics\"", "ReviewID": "R2U64Y44DTPDFI", "Overall": "3.0", "Content": "I really like this camera, but I am no where near the WOW I thought I would be. I upgraded from a 4 year old Olumpus C-770. That had a 10x Zoom (the best at the time). So when I went to 26x Zoom I just knew I would get great shoots from far away. But as odd as it might be, I tested it head-to-head with my old C-770 to find that the Zoom is about the same. True it is a lager pic, but the range is about the same. As well the C-770 can shoot RAW. No Raw with this one. The only think I can think of that makes this better would be the over all speed. But that was really not work the money I paid. But I like it just the same. I wont be let go of my old C-770 that is for sure. This is in now way a replacement (or an upgrade for that matter).", "Date": "December 1, 2009"}, {"Title": "As good as expected", "Author": "Just Us", "ReviewID": "R2PHK8DUGTDJKG", "Overall": "5.0", "Content": "Purchased this for my wife (amateur photographer) as a supplement to her Nikon D40x (primarily for the zoom capabilities - zoom lenses are a little steep for her DSLR).  She has only used it once but she absolutely loves it.  Small, light, easy to use, anti-shake is terrific and the image quality was excellent.  As I said, she's only used it once, so it's a small sample size but looking good so far.", "Date": "April 11, 2009"}, {"Title": "12 MP 26X opt zoom Olympus camera", "Author": "John Baird", "ReviewID": "R1C3LQ7NVKO3G9", "Overall": "5.0", "Content": "The camera exceeds all expectations functionally and its interface with humans is logical; even the printed instructions are polished and compact. I am pleased.buying it through Amazon was a joy too. It was at the door within hours of the time I pressed the 'submit' button.", "Date": "May 24, 2009"}, {"Title": "Colors are bad", "Author": "mia_y", "ReviewID": "R107XKOQ2E1HII", "Overall": "2.0", "Content": "When I purchased this camera, I have not seriously considered about the color.  Since I was getting more interest in taking pictures, I wanted to buy the camera which offers more features (including some manual) than what I currently have (DMC-LZ7: Panasonic). I was actually thinking of buying DSLR type, but, I thought it will be better for me to try out point and shot SLR style camera, so, I can learn more about the camera, and how to take the pictures. Then, I can spend more money in camera later.  I researched and studied a lot about the camera, and I ended up buying 590SZ.  I bought this camera in Aug of 2009, and at that point, this camera offers most features (for the price) than others.  It even had some build in Photoshop functions which I thought it will help on picture quality. Especially, this is Olympus which is one of top brand name for the camera.However, I was so disappointed with the picture quality... I mean, the color. Even with full auto mode, this camera doesn't control the light very well, and the color of the picture is just horrible. At least I feel that way.  Sometimes, too dark, sometimes, too bright, so the true color doesn't show up much. Even with manual function I tried, it didn't give the rich color which other camera offers without even special setting.  All the pictures that I took look so faded.  And the picture quality (at least the color) of my old Panasonic camera (DMC-LZ7: very low end automatic camera) is so much richer and vibrant.  OK, I tried some of the presetting mode.  It takes so long to take one shot (the processing time), and I don't think I will use this mode often because I want to take the moment pictures.  I don't have time to adjust the setting too much, and the moment doesn't last.  Hope, I can just take picture with the proper setting of light, and focus, and iso. Or sometimes, I can just change one of this for the great moment picture. Moreover, the colors of these presetting features aren't any better.  I also, found out that the Photoshop functions that this camera offers really useless as I can touch up later with my computer software if I need to (I don't usually).Fast moving (sports) feature takes OK picture. This camera offers image stabilization, and 26X zoom, so, it takes sharp image and reasonable picture at long zoom.  But, the long zoom in stabilization mode is very shaky.  And, again, color is the issue for me. Compare to Panasonic F35 and Canon SX20IS, the color of 590UZ is way too faded. It could just be me, but I really don't like the color of this camera takes. Even Fuji S1800 (less than half of the price of this camera) take easier quality shot with better color. Simply compare the colors of the pictures (sample pictures (uploaded by people) in Amazon) taken by all the cameras that I have mentioned including 590UZ, you will see what I am talking about.I owned this camera for a year, and was trying so hard to figure out the right setting for the color, but I could never find the setting that I like. And even, when I see the photos that was taken by other people, I don't think I like the color.  I think I have to buy another camera. But never Olympus again.Oh, Btw, I didn't have a complaint about the battery life on this camera.", "Date": "September 17, 2010"}, {"Title": "Like a SLR camera", "Author": "Juan Sousa \"jjccsspp74\"", "ReviewID": "R3SGMV0MCT7GRE", "Overall": "5.0", "Content": "It's a very versatile camera. It have a lot of functions, so it works as a professional camera. Is very useful to persons who like take pictures with a personal touch, without the newest automatic features, although this camera have it!!!", "Date": "June 6, 2010"}, {"Title": "Great camera", "Author": "Darlene Gray \"mountain dweller\"", "ReviewID": "R1DBKGUC4CAC4H", "Overall": "5.0", "Content": "I'm very happy with this camera.  It has many features and I'm still learning to use them all.  The physical size is wonderful which makes it easy to take everywhere and the pictures are great.", "Date": "May 3, 2010"}, {"Title": "Excelente camara", "Author": "Santiago Cordero", "ReviewID": "RQG1EW97XHZNV", "Overall": "5.0", "Content": "Excelente camara, el zoom muy bueno, la calidad de imagen excelente, la estabilidad de imagen increible, esta es una camara comparable a una SLR, aunque no de lente intercambiable, pero yo estoy muy contento con la camara.", "Date": "October 4, 2009"}, {"Title": "Amazing! Well worth the price.", "Author": "Michelle Salgado", "ReviewID": "R128TSTOZTSTE1", "Overall": "5.0", "Content": "Olympus SP-590 UZ 12 Megapixel Digital Camera with 26x Wide Angle Ultra Zoom + (8) AA Batteries + Case + Cameta Bonus Accessory KitFantastic Camera with loads of features! Zoom works very well for taking close up photos of small subjects. Perfect for serious amateur or even someone who takes pics of kids in action.", "Date": "July 12, 2009"}, {"Title": "26X, I don't think so", "Author": "CDWalker \"CDWalker\"", "ReviewID": "R3OT4V5AOMR15", "Overall": "3.0", "Content": "The reviews below cover a lot of ground, so I'll just write about my disappointment.  I don't believe that the zoom is 26X.  I have a Sony with 15X zoom (I've used the heck out of it ... the shutter button just sproinged off the other day giving me the opportunity to upgrade!) and I've taken comparison views of the max of each of these cameras' zooms and the image is identical.  That was a tremendous surprise to me. I chose the Olympus to take me to further distances and am tremendously disappointed that it doesn't.  I'm thinking I am going to return the camera.", "Date": "June 18, 2009"}, {"Title": "Dissapointed", "Author": "Rhadames Tellez", "ReviewID": "RS6ACVC8OD1BT", "Overall": "2.0", "Content": "Definetly not what we expected. The quality of the pictures were subpar. We continue searching for the right camera.", "Date": "September 29, 2009"}, {"Title": "I EXPECTED MORE", "Author": "Chase", "ReviewID": "R1PEWM8CAO7HVS", "Overall": "3.0", "Content": "I THOUGHT THE SP 590 UZ WAS GOING TO UPGRADE THE SP 570 UZ BUT PERSONALLY I THINK IT WAS A DOWN GRADE  THE BURST MODE  IS A DISAPPOINTMENT THE SP 570 SHOT FASTER AND GAVE ME 30 SHOTS THIS ONLY GIVES 25 SHOTS AT 10 FRAMES PER SECOND THE ZOOM IS NOT A BIG DEAL THE IMAGE QUALITY IS JUST LIKE THE SP 570 WHICH IS FINE, BUT SINCE THIS WAS A NEW CAMERA I EXPECTED MORE,.. THE FIRST TIME I SHOT A MOVING PERSON AT A BURST MODE  SOMETHING WENT WRONG WITH THE EXPOSURE AND FOCUS AND I USE AUTO FOCUS, THE SUBJECT WAS OVEREXPOSED AND OUT OF FOCUS...A COMPLETE FIASCO AS A FIRST TRY OUT, AND I'M NOT A NOVICE ABOUT CAMERAS I GOT ABOUT 20 DIGITALS AND THE BEST IS THE PANASONIC LUMIX DMC FZ-28 YOU JUST CANNOT MAKE A MISTAKE WITH THIS HONEY THE QUALITY IS GREAT THE BURST IS FLAWLESS AND THERE IS NO INTERVAL BETWEEN SHOTS I CAPTURES GREAT CANDID SHOTS AND SPORTS ALL THE TIME...THIS IS THE BEST BY FAR OF ALL THE HI-END POINT OF SHOOT, I HOPE THEY COME WITH A NEWER MODEL WHICH I'M SURE IT'LL COME WITH LOTS OF NEW GOODIES..DO YOURSELF A FAVOR BUY THE PANASONIC LUMIX DMC FZ-28 YU'LL SAVE SOME MONEY AND YOU'LL HAVE A SUPERIOR UNIT.M.B.", "Date": "March 26, 2009"}, {"Title": "no lens cap", "Author": "Lyndal", "ReviewID": "R14ZVH1WXXLS2C", "Overall": "1.0", "Content": "new product came with no lens cap sent email to Olympus no answer from that company yet??? Hoping someone will make this right and get me a cap.Lyndal", "Date": "October 11, 2011"}, {"Title": "dont buy this - here's why", "Author": "Amazoner \"reader, thinker, doer\"", "ReviewID": "R2K5XUU6BQR3P6", "Overall": "1.0", "Content": "The cam has many great features - BUT it evidently doesn't output RAW. In this price range, you should get RAW. The competition all have RAW - for a reason. Canon G11 has RAW. Nikon 9000 has it, but its a weird version of RAW, so jury is out on them. Look around. Don't tow your Ferrari with a bicycle called jpeg!", "Date": "October 13, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "12-megapixel resolution for photo-quality, poster-size prints\n26x wide-angle optical dual image stabilized zoom\nPre-capture scene modes: Multiple Exposure, Soft Background Focus and Beauty Mode\n2.7-inch Advanced HyperCrystal III LCD screen\nCompatible with xD Picture Cards and microSD memory cards (not included)", "Name": "Olympus SP-590UZ 12MP Digital Camera with 26X Wide Angle Optical Dual Image Stabilized Zoom and 2.7 inch LCD", "ImgURL": "http://ecx.images-amazon.com/images/I/41MtvjR4zTL._SX300_.jpg", "ProductID": "B001P06Q66"}}