{"Reviews": [{"Title": "Shoot For The Moon", "Author": "A. D. Lum", "ReviewID": "R2LXYF1FGIUA2Y", "Overall": "5.0", "Content": "If you don't care to know about the art of photography and you don't like to read manuals, don't buy this camera and you can stop reading right here.  Otherwise, read on.I can take any camera and take bad shots with it.  But if I use most modern cameras to their full potential, I tend to end up with great shots.  By that I mean using correct focus, exposure compensation when necessary, and selecting the proper ISO, shutter speed, and aperture for the situation.  Those are just the basics.  There are also other adjustments and tweaks like Face Detection, D-Lighting (Nikon's term for bringing out more detail from dark areas of the photo), white balance, etc..Essentially, if you know how to use all those things (and your camera lets you adjust them yourself), you can end up with some pretty great shots from any camera.  You can get creative in ways that auto-only cameras will not allow.  Some people end up with blurry shots because they don't know how to take sharper shots.  Better shooters can take sharp shots - or they can make them blurry on purpose for an artistic effect.  I personally can't stand blurry shots - except for the occasional shots where only the subjects are a bit blurry (to accentuate motion).This camera has 6 settings that affect the sharpness of the photo - and that doesn't include aperture.  One of them is the macro focus setting.  Although normally used for close-ups, you can keep it in \"macro focus\" in most of the different shooting modes (Aperture Priority, Shutter Priority, Program, etc.).  The other setting is the Sharpness setting.  By default, the camera is in the middle of the scale.  Some might consider the middle of the scale to be too soft.  Simply click it up to the \"sharp\" level, or one more for the sharpest level.  There are also two clicks down to increase softness.  1 macro + 5 sharpness levels = 6.Why would someone want a soft (not so sharp) photo?  One example is portraits.  In general, people don't like portraits of themselves that show every pore and hair on their skin.  Softening particular subjects can also convey a delicate beauty - say a ballerina resting on a chair.So for those who complain about this camera not taking sharp pictures out of the box, all you have to do is turn it up.  For extra measure, use a small aperture and a good tripod.  You will see the difference.Not all sub-SLRs offer as many options as the P80.  In particular, I like the high-powered zoom, the camera's ability to correct wide angle distortion, the overall compactness (considering the zoom), and the logical way things are laid out.  The image tweaking controls that are most useful are also the easiest to access via the circular multi-control on the back.  I also like that the flash doesn't pop up unless I want it to (it has a manual switch to pop it up).The P80 is easy to carry around and covers all the bases (video, wide angle, super zoom, full manual control, etc.).  If you know the features of this camera and know how and when to apply them, you'll end up with spectacular shots.  It's that simple.This camera has nice features that you may not always use, but for those special occasions, they are nice to have.  One of these features is the ability to move the focus point around.  With your trusty tripod set up, you want to get a surfer off to one side, gazing out over the sea.  But you don't want the ocean to be in sharp focus because you want to immediately draw your viewer's eyes to the surfer.  By clicking the circular button, you move the focus point over the surfer and set the camera to also meter on the focus point (so that the surfer is perfectly exposed).  Add a little flash fill if you like, and Voila!  Instant art.Night shots really benefit from an adjustable focus point.  Say you want a shot of a lonely lighthouse on a cliff at night.  It's off to one side of your shot to give it a more dramatic frame.  With the focus point in manual and the camera set to meter on the focus point, move the focus point closer to the lighthouse until what you see in the LCD looks properly exposed.  If you have to keep the exact focus point a little bit away from the lighthouse to get the right exposure, no problem, just set the focus to lock on infinity (I'm assuming you aren't standing right next the lighthouse).  The same concept will work for public Christmas tree displays at night.  To get the right exposure and focus, move the focus point onto or near the tree that most interests you.Want to take pictures of your friends, and maybe get in the shot yourself?  Switch on face detection, hit the self-timer and take your place next to your friends.The sports mode will have your friends lining up to get their golf swings and tennis serves photographed.  The camera shoots 13 frames per second in the default mode, sacrificing everything for speed (aperture, ISO, etc.).  So while your shots from this mode won't make the cover of SI, everyone will get a kick out of seeing themselves in a stop motion sequence (up to 30 frames).The camera has two modes which help you get the best shot in unusual circumstances.  In Best Shot Selection mode, it shoots up to ten shots as long as you hold down the shutter release button.  Then it automatically selects and saves the sharpest picture in the bunch, discarding the rest.  In Exposure Bracketing mode, it applies three different levels of exposure to the same shot.  One of them is likely to be just what you wanted.  Exposure bracketing can even be fine tuned to your liking (read the manual to learn how).With a single press of the shutter release, this camera can automatically take and assemble 16 shots, 1.1 seconds apart, into a single picture.  You get a picture made of 16 consecutive \"scenes\".  This is good for things like a cat playing with a ball, or you and your buddy making funny faces.Do you wonder who or what knocks over your garbage cans when you're not home?  The P80 can shoot time lapse sequences, firing once every 30 seconds to once every hour.  It turns off between shots to conserve power, or you can buy an external power supply.Hate crooked pictures?  Push the DISP button to lay down a grid which you can align with horizontal or vertical objects.  The grid also helps you position subjects according to the \"Rule of Thirds\", which even amateur photographers should know.The digital zoom is cool!  It doesn't just enlarge and crop - it interpolates to fill in detail that might otherwise be lost.  If you go full optical and full digital zoom, you can see the craters and \"seas\" on the moon!  Use a tripod, lock the focus on infinity, turn off VR, and use a 2 or 10 second delay to allow the tripod vibration to settle.I'm quite pleased with my purchase.  If you're the creative type and a camera nut (you actually read the manual and experiment), you'll probably be very pleased; producing countless pictures suitable for framing.  If you just like to point and shoot, this camera is probably not for you.But don't just take my word for it.  Go to Flickr and do a search on \"Nikon P80\" to see what this camera can do.", "Date": "May 25, 2008"}, {"Title": "Average Image Quality, some quirks", "Author": "RonAnnArbor", "ReviewID": "R6SCME0OX9VB3", "Overall": "3.0", "Content": "I tried this camera this week, and found myself returning it within a couple days. In all honesty, I had read good things and I had hoped perhaps this would serve me as a bridge camera between my Canon G9 and my dSLR camera.First, it is nicely made, and feels good in the hand. It works smoothly, and is relatively quiet during operation. The lens is high quality, and it has the standard Nikon layout on the selection dial. Curiously, it maintains the separate setting on the dial for SETTINGS which should be standard for all creative zone options. This is similar to all other recent Nikon cameras.In use, the camera feels more like a point and shoot than a true tool of the trade -- and therein my average review. If you are working your way up from a point and shoot and not quite ready for a dSLR, this might be the camera for you.But based on my observations: the camera had a difficult time focusing in low-light conditions, and then defaults to grainy high ISO defaults -- sure you can set that, or use Manual mode, but it won't work right out of the box in auto or Programmed Auto  or Aperture or Shutter mode.The image quality is fair -- many photos needed saturation boosts -- they just seemed bland out of the box. Again, this is programmable, for those who venture into the menu, or those who like playing with photoshop.In general, all photos looked soft, and they all need sharpening in photoshop. This is something I would clearly not want to waste my time on with every photo taken that I might want to use for print purposes. The image quality just us NOT what you would expect with a camera of this price. That being said -- the image quality is consistent from closeup to faraway landscape. There is no noticeable loss of IQ with longer focal distance shots, which is better than most superzoom compact cameras I have seen. Closeup macro shots appear the sharpest: if you like taking photos of bees on flower blossoms, this is your baby.While the photos do not lose IQ at the far range of the considerable 18x optical zoom -- they suffer from severe purple fringing at that end -- worse than many other superzoom ultraportables I have seen.The VR works as promised -- provided you are moving and your subject is not moving. I couldn't get clear images of moving objects without significant futzing with the settings.The shutter lag is considerable, nowhere near the rapid response of a dSLR -- and compared to my Canon G9, significantly slower than that as well.This compares favorably to the Canon S5 and might in fact be better than that camera -- but the image quality is not better than the Canon G9, which remains the absolutely best Image Quality camera out there at this price point (without the zoom lens, of course).I'm not going to rant and rave and say this is a terrible camera -- it just seems incredibly average at this price range -- take a look at the Canon G9 for faster shutter speed, better image quality, and similar manual control.I will say one thing -- for those who like to isolate their subject from the background (i.e. blur your background, with good depth of field) the Nikon P80 excels at that -- I haven't quite seen as nice aperture priority images in a point-and-shoot as I have with this camera.But overall, it's a highly priced point and shoot, which won't satisfy advanced camera users.", "Date": "May 6, 2008"}, {"Title": "SEISHA SEICHU", "Author": "NeuroSplicer", "ReviewID": "RD28DMSDU727I", "Overall": "4.0", "Content": "This is what practitioners of Kyudo, the Japanese martial archery, seek: \"correct hitting is in correct shooting\". And this is how this camera makes you feel after mastering and getting used to its controls and abilities.After months of research I decided and bought this ultrazoom. SLRs take better pictures but I refuse to carry all the extra equipment when on vacation. NIKON P5100 was the choice on the other end but it lacked both the x18 tele and the wide end zoom.The (close) second contender was OLYMPUS SP-570UZ but here is why I found the NIKON a better choice and did not regret it: although the OLYMPUS comes with a larger zoom (x20) it is controlled solely by an awkward (motorized) ring that requires both hands and has an uneven feeling. Moreover, both cameras sport 10MP but, contrary to the OLYMPUS which just had more mega-pixels crammed onto the old (550 & 560) sensor, the NIKON comes with a newly developed sensor. On top of that, I avoided the slow and limited XD-cards OLYMPUS seems stuck on. On the other hand, I missed on 2mm of wideness and x2 on tele zoom.I have been using the camera with undiminished enthusiasm for over a week and I have only good things to tell you about it. It took me a while to familiarize myself with the settings - full auto will not get the best results under any conditions. Once that harmonious point is reached though, this is the camera you would want to be using in most situations.Where it looses the 5th star: the flash does not pop up automatically when needed. Forget to do so and a high (and noisy) ISO creeps in. So yes, this piece of equipment is not without its caprices...Heisenberg's Uncertainty Principle (and Zen masters) warn about the observer altering the event being observed. With NIKON P80 one can obtain the shot visualized either from very close or from afar. And it does so with simplicity and style.", "Date": "May 10, 2008"}, {"Title": "A Superb User-Friendly Multi-Use Camera", "Author": "tomato cow \"JSC\"", "ReviewID": "R3PB9K5GTJND4I", "Overall": "5.0", "Content": "I've been using this camera in a variety of situations and subject matter and I just love it. As a professional in the field, I wanted a camera that would have the zoom capability and the image quality of more costly (and heavier, bulkier 'pro' equipment) combined with the spontaneity and efficiency of a point a shoot, one-hand camera. This camera DELIVERS all that for me in a great little package that is easy to use, light to carry, superbly intuitive to navigate and still yields excellent high quality images. At $400 out the door at a retail store, I couldn't be happier with my purchase. I compared it with everything else in that price range and it just blew the others away. If you have $800-$1000 sure, go ahead and get one of the next level dSLRs like the D40 or D60. But if you don't want to be messing with lens changes and like to 'shoot-on-the-go', then you simply can't do better than this camera. It's a versatile, easy to use product at a reasonable price.", "Date": "May 10, 2008"}, {"Title": "Nikon Coolpix P80 ~ ultimately a disappointment", "Author": "Joseph W. Aubele", "ReviewID": "R3B9T8VWPLL9KO", "Overall": "2.0", "Content": "I'm a Nikon fan, and saw this as a economical way of getting DSLR-like features.  In particular the \"super-zoom\" functionality and sports shot setting -- seemingly perfect for the games my children play -- motivated me to pull the trigger on this purchase.I'll leave the in-depth analysis of the camera to others who are more knowledgeable but what has me disappointed are the streaks of light that showed up on several hundred photographs I took, using the high speed continuous setting in the sports mode, late in the afternoon (between 4:15PM-6:00PM) on Saturday, May 10th.After consulting the manual I found the following on page 47: \"If bright objects such as the sun or electric lights are captured during high-speed continuous shooting, vertical streaks of light may appear in the recorded images.  We recommend that you avoid capturing bright objects during high-speed continuous shooting.\"Precisely my problem.There are multiple settings in the sports mode (as well as the manual setting) to try, so I will be doing that before delivering the box to UPS for return, however it is troubling to discover that the fastest programmable shutter speed (1/4000) is best suited for . . . shooting in the dark?If I fall in love with this camera (and end up keeping it) I'll be sure to update this review.UPDATE: Went out recently and tried other settings/features -- images are crisp without any hint of the problem encountered in the sports setting.  As a result I'm bumping my rating up to three stars (though it doesn't appear that Amazon will allow for such a revision?).Will continue to update as developments warrant :)FINAL UPDATE: I emailed Nikon support about the light streaks that appear in photographs when using the sports mode (what they called \"bands of overexposure\").  They were very honest in their assessment -- there's no way to eliminate the problem entirely.  Their recommendation was to utilize the exposure compensation setting (-0.3 or -.07) to ameliorate the effect.  Though disappointed, the quality of the images overall (especially macro) is so good that I have decided to keep the camera.  The overall rating of Amazon reviewers (3.5 as I write this) seems absolutely correct!FINAL, FINAL UPDATE: Purchased a filter adapter from NEXTPhoto.net and a circular polarizing lens.  This has all but eliminated the bands of overexposure that showed up in the high speed continuous, sports shooting mode.  I have also discovered that, with an infrared filter (R72) the P80 is capable of some nice infrared photography (as long as I keep the ISO setting at a maximum of 200 -- 400 and above is very noisy)!FINAL, FINAL, FINAL UPDATE:  As my meager skills as a \"photographer\" improved the limitations of this *class* of camera (i.e. \"superzooms\") left too much to be desired, especially in low light, fast action situations (i.e. image resolution was very poor, and very noisy).  Ultimately, I sold the P80 and am looking at entry level DSLRs (e.g. Canon Rebel Xsi).", "Date": "May 11, 2008"}, {"Title": "Well Worth the Money", "Author": "W. Ingersoll", "ReviewID": "R37AA654SZDUX9", "Overall": "5.0", "Content": "I don't normally post product reviews, but I wanted to throw in my two cents on the Nikon P80--especially considering the number of negative reviews by seemingly impatient people who used the camera for a day or two and felt compelled to return it. To read their reviews, you'd think this camera was manufactured by blind monkeys.Rest assured, this camera takes fine pictures. In most people's hands, the Nikon P80 produces clear, vibrant images. Will it get you published in National Geographic? Not if you returned it the day after you bought it! Besides, even the best cameras can't make up for a lack of skill.I purchased this camera because my previous point-and-shoot, which served me very well for 5 years, was too limited in its capabilities for what I wanted to do. On the other hand, a full DSLR camera was more than I needed. I saw the P80 in a local store and realized that it was the type of camera I was looking for. I read the reviews here, and had to filter through the poor reviews because the reviewers seemed too dismissive and too harsh in their judgments.I will be using this camera mostly for outdoor use. I do a lot of hiking, canoeing, and snowshoeing, and along the way I take a lot of pictures. Some of these pictures wind up in print, both B&W; and color. The camera I had been using was small enough to fit in my breast pocket, which made it easily accessible and allowed me to be spontaneous. But a smaller camera has obvious limitations, which I sometimes ran into while trying to prep a shot for publication at 300 dpi. Don't get me wrong, that little 5-mp point-and-shoot worked well for me, but I wanted to see what I could do with a larger, more sophisticated camera.The P80 is too big to fit in my pocket, but it is light enough that I won't mind taking it on week-long wilderness hikes. I have only owned the camera for 2 weeks now, and so far I have only been using the automatic settings while I get a feel for its capabilities, but already I have taken several shots that I like very much. The resolution is perfect for what I'll be using it for. Chances are, if I used a tripod the images would be even sharper. A full-size image works out to be 9 x 12 inches at 300 dpi. You can, of course, set the camera to take smaller pictures.One thing I've noticed from two weekend hikes is that the battery has a more limited life compared to what I'm used to with the smaller camera. Having been sure to fully recharge the battery the Friday night before my trip, I have been getting the \"low battery\" indicator by Sunday afternoon on both trips. Granted, I've had a bad case of \"new toy syndrome\" and over time I will probably learn to conserve battery power better. In the meantime, I plan to buy a back-up battery. It couldn't hurt. One thing that I've missed is an indicator that tracks battery power from start to finish, not just one that flashes when the power is low.Another minor fault--which I can learn to live with--is that the on/off button can be a little too easily triggered. While trying to put the camera back in my backpack, I've accidentally touched the button and turned it on a couple times.One thing I wasn't clear on when purchasing the camera from Amazon was what it came with. For the record, the following items come in the box with the camera:* Battery recharger* Rechargeable battery* USB and AV cables* A strap long enough to hang the camera from one's neck* Software CD, especially helpful for managing the file upload processThe internal memory is good for ~18 images at full resolution. I bought a 4 gb SD card, with a capacity of ~850 images.So, if you're looking for a camera somewhere between a POS and a DSLR, don't pass this one over thinking it only takes grainy, blurry images. It is a fine camera, especially for the price I bought it for. I haven't regretted it, and I am looking forward to getting to know it better.I give it 4-1/2 stars.", "Date": "August 19, 2008"}, {"Title": "Nikon p80", "Author": "Donna Shields \"roncinante\"", "ReviewID": "R2P2ZFNMNUB9P8", "Overall": "5.0", "Content": "It is simply my point and click.  This might be  to complex for the entry level digital user because like other reviewers I use a Cannon. Yesterday at a swim party I used the L400 lens for the distance face shots, but I used the p80 for the cake and presents shots. To me Photoshop is as necessary for photos as a good lens.  I know I lose a lot of shooters when I add all the complicating issues.  This little camera is very light and is in my purse at all times unlike my Cannon.  I use it to all of its potential.  You have to read the book and practice to enjoy all it can give. I love the spot meter and focus used at the same spot. I can shoot faces in the dark and have face colors that are quite good and from my purse to photo takes seconds. I love this camera, it is with me and in a restaurant or on a walk with the dog all those times when I never planned on taking any photos.", "Date": "June 8, 2008"}, {"Title": "An interesting camera", "Author": "Renee Aubuchon \"reneesarah\"", "ReviewID": "RAL8DRN40QPKY", "Overall": "4.0", "Content": "My interest in this camera is about obtaining mega zoom and macro abilities at a reasonable price.  While this camera is classified as a point and shoot, and it certainly can be that, it does have some overides such as aperture and shutter priority and manual.  Without the overide capabilities I wouldn't have been interested since I want creative control of my shots.  Just out of the box last night I found that the macro worked fine as did the mega zoom.  Mid range shots had stunning clarity.  I noticed some noise on low light macro shots.  So far I like this camera.It would have been great if Nikon would have included RAW image processing.  I would have much rather had that than the capability to make short videos.  I also would have liked it if it were possible to thread filters on to the lens, which it is not.The user's manual is really clear and understandable for someone used to working with DSLRs.  I was able to load images on my computer using USB1 and Windows XP with no problem.  I ignored the Nikon photoloading program and sent the images to Photoshop.I would definitely suggest getting an additional memory card, since if you are shooting on the 'fine' setting it does not take long to fill up the camera's internal memory.  For example if you shoot 10 images at the 'fine' setting the 50 MB internal memory will be full.When this camera arrived at my home via shipping through Amazon the driver just left it on the doorstep.  I would have rather a signature had been required than risk a $400 camera being swiped off my front porch.", "Date": "May 8, 2008"}, {"Title": "Sweet camera", "Author": "Brian Klemm \"bk2\"", "ReviewID": "RIKID703MS4AL", "Overall": "4.0", "Content": "My desire was to find a camera that was in between my pocket Canon SD1000 (a truly wonderful camera, but no optical zoom) and a more expensive and heavy SDLR. The Nikon P80 fits this \"tweener\" area nicely.I have owned the camera for about 6 weeks and have taken over 1000 pictures with it. It's accompanied me to a pro football training camp, kayaking and canoes trips, parties and multiple family occasions. My original concern that this camera would be too big to tote around is simply not the case. It's become a wonderful companion.A bullet list of observations:- The zoom is incredible. I shut off the digital zoom feature completely. Found that I didn't need it and figured it would maximize sharpness. I do less cropping of pictures now with this camera than before.- The sport shooting mode is wonderful. I use it more than I thought I would.- I shopped around extensively and the reasons I chose this camera over the comparable Sony and the Canon, Lumix models were: This camera had a better zoom, used SD cards, had a more solid feel and had simple controls but yet had equally extensive features. Above all the others it felt good in the hand.- Although this camera can act as a \"point and shoot\", by no means is this \"juniors first camera\". I really think the best way to get better results is to take the time to learn about the camera controls/features (RTFM) and learn about how to take pictures. In addition to my purchase of this camera I also bought the book \"Understanding Exposure\" by Bryan Peterson which has increased what minimal knowledge I had about exposure.There are some annoyances with this camera.....- It's slow. If you don't learn to use the camera in other priority modes or manual - you may get frustrated at the slow shutter response and missed shots. I've also found it's slow to zoom focus. The flash also requires some wait time as well (to be expected).- I want to put a lens filter to protect the lens but ... #1 I can't find any and #2 doing so would require a different lens cap. Many have complained about the cheap plastic lens cap, but it's actually designed to easily pop off when you turn on the camera. A more solid lens cap would over time screw up the lens drive. It just looks cheesy.Anyhoo, the camera's not perfect, but I felt I did my homework and made the best purchase for my needs. I am pleased with it and have already recommended it to friends who I think have beyond basic interest in photography.I hope this information helps anyone who is considering this camera.", "Date": "September 7, 2008"}, {"Title": "Excellent, Just Excellent", "Author": "J. Carroll \"J Carroll\"", "ReviewID": "R1OBRZD26VQE2C", "Overall": "5.0", "Content": "Just got this camera last week.  We are novice users and found this camera to be very easy to use.  The instructions that came with the camera are great and the in-camera instructions are excellent as well.  We took our new camera for a test drive at our kids soccer games on Saturday.  The shots we were able to get are FANTASTIC!!!  We can actually see our kids in action, up close and in focus.  The sports mode is wonderful.  We really enjoyed zooming in on the picture after we took it to see even more detail.  The battery worked really well.  After 280 shots it was still going strong.  280 shots in one afternoon.  Who would have ever thought we would take so many pictures.  With our old camera we were lucky to take a handful.  It was just so much fun to shot that we just kept going.  We will play around with all of the settings over the next few days, but so far it has really WOWed us.", "Date": "May 19, 2008"}, {"Title": "Nikon Coolpix P80 is a Great Mini SLR", "Author": "iconoclast", "ReviewID": "R19FEU8U4SR93Q", "Overall": "5.0", "Content": "The Nikon Coolpix P80 is the digital camera I wish I could have bought five years ago, but cameras with these features did not exist, and if they did, the prices would have been out of reach for the casual photographer.This compact digital SLR has an astounding 18x zoom lens, 10 Megapixel resolution, a large LCD screen and a bright through-the-lens viewfinder. In addition to several photo resolutions, the user can choose from several different aspect ratios--16:9 TV, 3:4 TV, different computer screen sizes, and 1:1 square, great for online auction photos.The Coolpix P80 is considered a hybrid camera, since it has all the features of a much more expensive digital SLR, but you cannot remove the lens. It has a diopter adjustment to allow the user to take photos without glasses; the ability to turn off the LCD display when using the SLR viewfinder, and an easy-to-use menu.The camera is as simple to use as an automatic point-and-shoot for the casual user, plus all the bells and whistles like shutter priority, aperture priority and auto-focus. You can shoot several frames per second for still photos and can take videos.Oh, and the price is 25% less than the small 4 Megapixel camera that it replaced. I recommend purchasing a two-year warranty extension, available for about $15, a bargain.", "Date": "June 13, 2008"}, {"Title": "There was a quandry in our house", "Author": "T. Gabriel \"People ask me what I do in winter...", "ReviewID": "R1O942MA841LZH", "Overall": "5.0", "Content": "My wife and I have been film photographers for over 30 years together. By myself I have been taking photos since the '50s.Before we trudged into the land of Digital, we wanted a relatively inexpensive camera to test what all the hype was about. I had claimed at one time that I would give up photography before I went digital. The last three rolls of Kodachrome 64 cost us over $30 to buy and have processed.We anticipated the D700 but did not know when it would be available. To see what we could do with digital, we bought this little gem. We have taken over 3,000 pictures with it since we got it in June. It rests on the shelf now because we got our D700 (and D3 for good measure).While we used the P80 we were impressed with the quality and features and its ability to translate what we were seeing into meaningful shots.  This camera could never be mistaken for a professional or even advanced amateur camera but what it can do is allow a photographer to develop his art. If you are a reasonably serious beginner, this is a perfect camera. It does not have changable lenses but does not need them. Besides, if you have an interchangable camera, you should have high quality glass to go with it, not what camera makers are making for the consumer market.It has been a lot of fun, playing around with this camera. We have a lot of shots we are very happy with. There are limitations but for the kind of camera it is, the Nikon P80 is at the top of the list.", "Date": "September 15, 2008"}, {"Title": "The ultimate compact camera", "Author": "Aj Viljoen", "ReviewID": "R363CXZ1SKSA1Y", "Overall": "5.0", "Content": "I use this camera every day - I go nowhere without it.As a pro photographer, I started using compact cameras two years ago, when I got tired of hauling heavy pro equipment around with me while on vacation.My first compact cameras - the Nikon S-10 and the Nikon D-70 - were good, but not perfect. When I saw this camera's specs, I bought it without hesitation, and wow, I am impressed!It does EVERYTHING one would expect a compact camera to do with ease, and much more. It is easy to use, It is light. It comes packed with features.The auto-programs and auto-white balance are spot-on. Focusing is quick and silent. The zoom is excellent, and the min f-stops are impressive throughout the focal range. All of this at an unbelievable price! You simply can't go wrong in buying this camera.If you know my reviews on this and other sites, you will know that I don't easily award more than three stars to a product.This camera deserves its five stars - it is easily the single best online purchase I've made all year!", "Date": "September 23, 2008"}, {"Title": "Great Camera!  Ignore the negative reviews.", "Author": "Art", "ReviewID": "R3QAX24BFDSSC", "Overall": "4.0", "Content": "Ignore the negative reviews.  This is a good starter camera for beginners who is just starting to get into the professional photography field.First of all, the negative reviews about this camera are from people who have probably been in the business of taking photograph's for a long time and probably could not afford to buy an expensive professional camera and end up getting a Nikon P80.  BIG MISTAKE!!  You hear there complaints about the Nikon P80 and comparing it from other similar cameras they've owned or used in the past and want to up-grade.  If they want to up-grade to a better camera, WHY GET A SIMILAR CAMERA LIKE THE NIKON P80?  Get a PROFESSIONAL NIKON CAMERA FOR HEVEN'S SAKE!!This is an awesome camera!  I've been taking lots of photographs since I purchased this camera a week ago and I've been having lots of fun with it.  I love the 18x Optical Wide-Angle Zoom-Nikkor Lens and the New Sports Continuous Scene Mode that can shooting up to 13fps plus the Bright 2.7-inch LCD and electronic viewfinder.NOTE: I purchase the NIKON P80 at Costco's for $[...]. When I purchase the NIKON P80 at Costco's, it came with a Carrying Case & a 1GB Memory Card Package.  This is a good starter kit.Ignore the negative reviews.  THIS IS A FUN CAMERA TO HAVW AND I LOVE IT!!  I GIVE THIS CAMERA 4 1/2 STARS!!", "Date": "May 13, 2008"}, {"Title": "Please learn to use camera.", "Author": "G. E. OCONNOR \"Fab04\"", "ReviewID": "R1N1QHPJ2ZLEY2", "Overall": "5.0", "Content": "This camera is an excellent piece of equipment from Nikon. You must learn to use it before you critize or return it. It has a nice sharp focus. The streaks you see or read about in the samples or prior reviews are due to the user having the exposure compensation on a positive setting. This makes the picture much brighter than it needs to be. The compensation results in over exposed  and streaky shots. Please note the situation you are in and beware; for example if you are in direct sunlight you would not need to use the exposure compensation. Camera is very intuitive and I would consider it user friendly. Just give yourself a chance and read the manual before you post negitive reviews. For the price you are getting a real decent camera. I am even pleased with the digital zoom which I used at an indoor concert. The VR realy works and helps you to keep you camera shake down to a minimun. Also try using the VIVID or More VIVID settings . I believe you will be pleased with the outcome. I owned many SLR's over the years and I bought this camera to use while I am getting over a cranky back. This gives me the leisure to get 27mm to over 460mm without carrying a bunch of expensive and heavy lenses. Also the 4X digital gives you even more flexibility to reach subjects you could not reach without  an assortment of expensive and weighty lenses.", "Date": "June 25, 2008"}, {"Title": "Great Value for Price - More than Just a Point N Shot", "Author": "Charles Gallina", "ReviewID": "R2D9UT3TSJCZ2", "Overall": "5.0", "Content": "I have this product for two weeks and gave it a full workout over the Memorial Day Holiday.  I am very pleased with the image quality and features. I shot with all modes and felt that it delivered what it promised for this price range.  My ony recommendation is that the flash should pop up automatically when it is needed and the lens cover should be built in much like when the Panasonic went from the TZ1 to the TZ3 which I also own. I would also have liked a hot shoe for flash and the ability to protect lens with a UV filter.  Minor stuff for this type of camera which gives you more creative control without the big price tag.Of course if you want to step up to the pro-amateur DSLR type cameras and spend hundreds dollars or more than you should expect all of the above.", "Date": "May 27, 2008"}, {"Title": "It's a tradeoff:  zoom power vs. image quality", "Author": "Emily Weiser", "ReviewID": "R26A1ZNS1R6UAV", "Overall": "3.0", "Content": "I was very optimistic about this camera, but like several other reviewers, I'm returning it soon after receiving it.  I made a direct comparison between this camera and the one I've had for 4 years (Olympus C-750UZ, 10x, 4MP).  The P80 certainly had better zoom range on both ends, was very user-friendly, and faster than my other camera.  Noise in low light was a bit better on the P80, which also had faster shutter speed to help prevent blurring.  However, my Olympus outperformed this camera in a very important area:  image quality.  All of the images from the P80 appear \"soft\" (except very close-up in macro mode, which turned out quite nicely).  Despite its age and lower MPs, my old camera clearly outperforms the P80 in this regard.  Online research indicates that other 18-20x cameras have a similar problem with image quality.  Maybe the technology just hasn't advanced far enough (yet) to produce quality output in such a compact package that includes a telephoto lens.Other than the image quality (which may be just fine for someone who's not making a direct comparison with something they're already very happy with), this is clearly a quality camera.  Aside from the image quality I would certainly give it 5 stars (but unfortunately that is my priority, worth two stars to me).  If you have your heart set on getting a super-ultra-zoom, this could still be the camera for you.  Personally, if I do decide to upgrade in the near future, I will probably go with something less ambitious in terms of zoom power.  I love to take full-frame pictures of birds and other wildlife (which you usually need a decent zoom for!) but I'd rather have a great image with some extra margin than a merely fairly good full-frame image... which is what you get with the P80.", "Date": "May 13, 2008"}, {"Title": "Dynamite all-rounder with flexibility to grow", "Author": "Paul Misencik", "ReviewID": "R3OI7O9CPIM07X", "Overall": "5.0", "Content": "I can't find much to complain about with my new P80, with its enormously flexible lens, compact dimensions, low weight, and overall picture quality.  Even some of things I have heard others complain about, such as the press-on lens cap and \"uncomfortable\" viewfinder seem like nit picking to me.  Make no mistake, this is a dynamite little camera.I'm what you might call a true \"prosumer.\"  I shoot images for myself, but also for magazine articles and other media.  Even on some of those jobs I now find myself reaching for the P80 over my D40, because the wide array of manual controls allow me to create essentially the same results with a lot less hassle.  Plus, the wide zoom range and host of advanced features means I can carry just one little camera to get a job done quickly and easily.  I hardly every use the full \"point and shoot\" auto mode, preferring instead to maintain at least some control over the aperture and/or shutter speed, and the P80 makes it very easy to navigate and switch modes on the fly.  The multiple flash settings are also very handy, and overall I am blown away by the results I can achieve.  Much better image quality and much more \"DSLR-like\" results than I ever expected.The only two things I wish it had are a manual zoom ring that I could use with my hand (although the motorized zoom has good precision and speed) and a threaded lens barrel to take filters and such.  But these are nothing that would keep me from recommending the camera to virtually anyone.I never looked at super zooms before, sticking pretty staunchly to the idea of DLSRs, but then I heard that an increasing number of top-level photojournalists are using them because of their incredible flexibility.  And now I see why.  The P80 is a fantastic little camera.  If you're a bad photographer, it will help you take better pictures, and if you're a good photographer you can use it pretty much as you would a DSLR, generating excellent and creative results with very little expense or hassle.I highly recommend the Nikon P80.  Heck, I wouldn't even change the lens cap.", "Date": "December 5, 2008"}, {"Title": "My Take of the Nikon P-80 10.2 MP 18X", "Author": "John D. Wagers", "ReviewID": "R3L44H48IPE3UB", "Overall": "5.0", "Content": "First off let me sayI bought this camera with out touching one on faith it would be good and I previously have used 35MM and had a Canon powershot A-95 Excellent little Camera but it didn't do as much as I wanted I ordered the P80 , an Extra battery and a 4 gig card for it got it in about a week(Slow) have had the camera about 6 weeks and I am very pleased with it, it takes excellent pictures it will do more than I can tell it too, I'm still learning the menus. If you set the camera correctly it will take an excellent shot, if you try to make it do something you have not set it to do then you will get a terrible photo but it is not the camera's fault its yours! If you read the manual and follow what it tells you as you learn it will take an excellent picture if you try it by the seat of your pants you will loose several shots but you will figure it out and eventually you will be happy with it. I have taken almost 900 photo with it is 6 weeks and lost maybe 15 not a total loss but blurry or poor color or out of focus MY FAULT! Setup is very easy to do and can be altered anytime I tried the fireworks setting on the 4th of July and did it free hand(needed a tripod) I was surprised how nice it took fireworks considering it was freehand! it has not been a disappointment for me it has been a joy and I think you might enjoy it too it is rated as slow on some things but its great for me because it does what I want and the way I want if you are advanced in your knowledge of photography you may not like it and on the other hand you may, I hope you do! This is my first Nikon and it is not a disappointment to me! Hope you enjoy it! JD", "Date": "July 24, 2008"}, {"Title": "Impressive little camera", "Author": "J. mcnalley", "ReviewID": "R3MJMWWQZKETTJ", "Overall": "5.0", "Content": "Nikon doesn't seem to advertise this, but the P80 actually has a manual focus mode. This was a pleasant surprise.Image quality is fairly good for a compact super-zoom lens like the one Nikon included in this camera.** Update **The P80 didn't stand up to the test of time. My initial impression was that the P80's image quality was good considering the long zoom range, but newer cameras have demonstrated that much better IQ is possible. The P80 is still a great value camera for someone who prioritizes the super zoom lens over everything else. Photographers concerned about optimal image quality should look elsewhere.", "Date": "May 8, 2008"}, {"Title": "GREAT Camera! AMAZING Pictures!", "Author": "Bonnie Kozak", "ReviewID": "R3QEM4FKNH5X93", "Overall": "5.0", "Content": "This is a GREAT camera that takes AMAZING pictures! And the 18x zoom is unbelievable! If you are not quite ready to buy the SLR professional, then this is DEFINATELY the camera for you! I did A LOT of research before I bought this camera, and I LOVE IT! The picture quality is AMAZING- even at a VERY FAR zoom! It is CRYSTAL CLEAR!!! I am shocked! You will not go wrong with this camera if you are wanting a great camera with AMAZINGLY CLEAR pictures, then this is for you!", "Date": "June 7, 2008"}, {"Title": "Better than a SLR", "Author": "D. Kubicki \"real world economist\"", "ReviewID": "R48ST1L4JN3V8", "Overall": "5.0", "Content": "I have been a professional photographer and this camera is the most awesome I have ever owned. The still pics are excellent quality and it weighs less than just one of the many lenses I use to lug around. No more changing lenses and taking a chance on dropping something or missing a shot while hassling with all of that. BUT the coolest trait was when I was asked to video some thing, I didn't have to pull up and turn on a different camera. I just rotated the dial on top of this and push the shutter. THAT is what I call Awesome. I reccommend that you also get a 8GB SD/HC card to use for lplenty of capacity and an extra battery because you won't want to stop shooting once you start. The software will let you make the widest panorama shots you have ever seen including 360 degrees. If you like the bigger heavier more expensive SLR's buy one but this camera converted Me.Sandisk 8GB Ultra II SD HC Secure Digital SDHC Card (SDSDH-8192, Static Package)", "Date": "June 12, 2008"}, {"Title": "Just the Thing for documenting a Quick Trip!", "Author": "F. S. L'hoir", "ReviewID": "R23RXO2HN8PSFA", "Overall": "5.0", "Content": "I like this camera!I just returned from a three-week trip to Italy, Holland, and London, and I found my Nikon P80 to be easy to manage, after several readings of the manual. Not too small, the P80 fits comfortably into my hands and does not wobble as the smaller cameras tend to do. Although I do miss taking splendid photos with my 1974 Rollei SLR with the three lenses and polarizer, I do not miss the weight, the limitations of rolls of film, and the encumbrances of all the accompanying paraphernalia.I especially like the P80 because it is inconspicuous, and one can get candid shots of street life without being intrusive. The easily managed diopter allowed me to use the viewfinder without my glasses. The monitor made it easy to view photos quickly; and the battery charger worked splendidly (I took two Nikon batteries, and charged one every night.). I was also pleasantly surprised at the macro feature which allowed me to copy family photos from my brother-in-law's album, which were taken in the 1940s and '50s.As other reviewers have suggested, reading the manual is indispensable, but one ought not to be tied to it. For instance, I discovered that in the northern latitudes with their bright autumn light, so beloved by the Dutch painters, the \"sunset\" setting worked better than the automatic, or even the plain \"landscape\" settings (I didn't care much for the automatic setting which tended to over-expose the pictures). I also experimented using the shutter and aperture priorities; took night pictures that were eventually successful, and discovered the video option, getting some fantastic shots of the changing of the guard at Buckingham Palace (As I discovered when I downloaded the photos onto my computer--a painless process--the sound of the guards' commands and their marching feet, as well as the clip-clop of the horses' hooves, comes through loud and clear. Unfortunately, so does the yak-yak of the surrounding tourists!). Not knowing how much memory I would be using, I took two 4G memory cards and shot 1800 pictures and 31 short videos, which improved remarkably during the second week, as I was getting used to the intricacies of the camera (and was recovering from jet-lag). As a result, I have a thorough documentation of my trip, which I wouldn't have gotten with a cumbersome SLR.Although for the next trip, which I intend to be more leisurely, I might invest in a real DSLR (with a polarizing lens), the Nikon P80 was perfect for what proved to be whirlwind tour of Europe. And any lapses in color or light and shadow, I was able to compensate for for with Adobe CS3.P.S. I must mention a minus, and that is a matter of preference. I do not like the 18 mm wide-angle lens, since it make buildings \"collapse\" in on each other visually; but with experience, I have since learned to shoot at 28 mm for architecture.", "Date": "November 5, 2008"}, {"Title": "Nikon P80 not for beginners", "Author": "Freddie B", "ReviewID": "R1KXBP7J3GB8WG", "Overall": "4.0", "Content": "I purchased the P80, primarily for 18X telephoto ability, it's versitility and its light weight. This camera is not for beginners but is ideal for those who want more control over their shots than a point and shoot allows. To understand all the features of this camera and to produce good shots it is a must that you read the the User's Manual. This camera provides all the control I need to make great pictures.  eg: Backlight, white balance, manual/automatic focus, shutter or aperture priority and much, much more.  A neat feature is the ability to take panoramic shots that are stitched together via supplied software.  When you take the second picture a faint image of the first shot is present so you can align the shot precisely. You will need to buy a memory card as one is not included and an extra  battery would be helpful because you have to recharge the battery externaly which makes the camera unusable for that period.  It took me awhile to get comfortable with the operation of the P80 and I am still learning. If you are willing to spend some time getting to know this camera you will definately enjoy it", "Date": "August 28, 2008"}, {"Title": "Outstanding camera if stepping up from a basic point and shoot", "Author": "Bryce Gaunt", "ReviewID": "R1RC6YYTSIO0XS", "Overall": "5.0", "Content": "I bought the P80 to replace a 3 year old 3mp basic point and shoot b/c I wanted a more powerful zoom and to take bigger pictures. I considered a digital SLR but could not justify the $$$ for no more pictures than I take.I was almost scared off from the P80 b/c of negative reviews about image quality, excessively lag times, etc.This camera is all I was hoping for and more. I will agree w/ other readers that you have to read the manual. Before I did this the few sample pics I took looked bad, however after 5-10 min reviewing the manual I now consistently take outstanding pictures.Compared to my basic point and shoot, it has a much quicker start-up time, a much smaller shutter delay, a fantastic zoom, etc. I have even found that the sports mode which takes 13pics / sec takes great pics and coupled w/ the 18x zoom allows me to get the close up sports pics I was missing before.If you are an advanced photographer, then maybe a more critical review is warrented. However, if you are a novice, don't be negatively influnced by criticial reviews comparing this camera to much more expensive digital SLR's. My conclusion is that this camera has most of the features of a digital SLR at a much lower price allowing me to take fantastic photos.", "Date": "July 26, 2008"}, {"Title": "best I've owned", "Author": "Steven S. Massie", "ReviewID": "R18YUIXYQR692N", "Overall": "5.0", "Content": "I have had this camera for a month now and I love it.  I have nothing negative to say about it.  It will zoom about a half mile and still looks great.", "Date": "June 16, 2008"}, {"Title": "Nikon Cooloix P80 Digital camera", "Author": "Morris L. Marshall \"AZMarshall\"", "ReviewID": "R14PEN2G0U49XZ", "Overall": "4.0", "Content": "The Nikon Coolpix P80 is a superzoom camera similar to the Nikon Coolpix 8800 I previously owned.  The P80 has a greater telephoto capability (18X versus 10X) with a wider zoom range than the 8800.  It also has a larger sensor than the 8800 (10 megpixels versus 8).  It's price is nearly half the price of the 8800.  Unfortunately, some features have been omitted to help achieve that lower price point. The P80 does nor have a hot shoe for a Speedlight.  It does not have a remote operation feature.  The camera body is smaller and feels less substatial that the 8800 camera body.  That is good thing for carrying the P80 but seems to be a detriment to steady holding.  The P80 is a better camera, but I miss some of the omitted features.", "Date": "May 27, 2008"}, {"Title": "MyNikon P80", "Author": "Milind C. Vagal \"model railway doctor\"", "ReviewID": "R23E02TC33QSWG", "Overall": "4.0", "Content": "I bought this as a replacement for my Olympus CZ730U that I used for 4 years and was thrilled at the unique features and clarity of the P80.The zoom performed extremely well though at times it hunts when trying to get into focus at maximum zoom. I have disabled the digital zoom which to me is useless in any camera.In night mode there is some difficulty to get the camera to adjust to ambient light even if flash mode is on.You can shoot great perfectly focused photos of moving objects or if shooting from a car and you want to get that unique photo moment.I mostly photo shoot model trains and macro details feature is very important. The P80 does an excellent job in macro mode though the flash is disabled in this mode and cannot be used for back fill.The scene modes are awesome though using this camera for well over two months, in portrait mode there is some difficulty in adjusting the focus to show the blue box, but even with the red box and flash fill photos turnout very well.In lowest resolution the frame advance is very fast and you can shoot multiple shots without waiting for the camera to save the photo.This is a con when shooting 10MP FINE which is the highest resolution this camera can shoot, it nearly waits for a full 5-7 seconds before it is ready to shoot another frame.The video quality is mediocre and wish that Nikon put more oomph into this mode qiven the fact that the lens is very powerful to shoot. Yet another con is in video you cannot zoom the entire range of the lens which gets you to at most 3X-4X optical zoom.Also the video is restricted to 30 min. clips max but it does create folders that you can edit with the most simple editing software like WMM in Vista. But this is a handy feature to have in the camera if you forgot your camcorder, otherwise stick to a professional camcorder.The battery life seems to be very good, at least for now since it is new, though I purchased a spare just in case (especially for vacations).I use a Delkin Pro 16GB SDHC that can store 10K photos in 1MP resolution or well over 3.5K in 10MP mode. Great card from Sams Club.Overall I must say this camera is a good performer for my application at least in the two months that I have it. I have not ventured to other A/P/M features but feel this will turn out to be as good as the Scene mode.Hopefully this will not get outdated for at least 5 years to come. This was a good bargain from Amazon and is great value for the price paid.", "Date": "October 18, 2008"}, {"Title": "First Impression of Nikon Coolpix P80", "Author": "K. Gallagher", "ReviewID": "R1LIYTMD6ZDS5B", "Overall": "5.0", "Content": "I have only had this gem of a camera for one day and my first impression is very positive. I was a bit worried after reading some of the reviews, but so far I am very happy with this camera. I am not a professional, but I do know a good picture when I see it. I was looking for something more than the typical point and shoot with a better zoom lens. I did my homework and read the manual before my camera arrived and was able to produce very sharp, clean pics of my very active Boston Terrier dogs. So far it has been very easy to set up and I was able to take my first photograph within a very few minutes. The zoom is incredible for a camera at this price. The video mode was very easy and recorded a surprisingly clear clip. I can't wait to learn how to use the manual mode. As previously posted, be sure to read the manual and you will not be disappointed with this camera.", "Date": "August 26, 2008"}, {"Title": "A Camera for the Birds", "Author": "Dixie R. Smith", "ReviewID": "R3HQ9RO6MTZA12", "Overall": "4.0", "Content": "This is a great camera for nature photography.  Following my recent purchase, I spent two weeks photographing, sans tripod, migrating hummingbirds.  The long zoom, high resolution,vibration control,and continuous shooting mode led to some great photographs. The close-up mode has also been very useful while photographing plants.", "Date": "August 24, 2008"}, {"Title": "Love this Camera", "Author": "AJ", "ReviewID": "R319QAQE22B0CC", "Overall": "5.0", "Content": "I have owned the P80 for about a year now and can't find a better replacement. Reading other comments I feel that some clarifications are necessary since most negative comments are simply pilot errors or unreal expectations, you have to realize that issues like a blurred image, even with Image stabilization can easily happen of you are using a long zoom lense, shots on anything above 10X do bennefit from a tripod, also, if your subject is a mile away there will be a lot of atmosphere in between, UV light, humidity, or even dust.  Usually people don't realize that the light from the flash is nt going to reach on your subject enough to make a diffrence if you are 40 or 50 feet away and of youthought a portrait was fuzzy, well that is another word for soft, other cameras can give you a sharp picture and show too much skin detail so you can reduce the sharpness on the P80 you get a softer picture, you however can increase the sharpness. About the Pixels, 10 is way more than enough, unless you plan to make posters out if your pictures and ASA setting of 400 or more will allways show noise (even on 35MM film) specially at higher MP settings in low light, set to 5MP.  Cheaper cameras can claim to have 14 MP but they accomplish this by dividing pixel size through the software with bad results.The inside thread on the lens allows for a 38mm adaptor ring and I usually have a UV filter for protection and a rubber hood, you will have to zoom in a bit to avoid seen the hood in the frame but don't forget your were using a wide angle setting right? To be able to have the range of wide angle and 18X zoom in one single lense is wonderful, you would have to carry around a big heavy camera with at least two telephoto lenses to cover that range, in 35mm equivalent 18X zoom would be about 486mm lens, check around for the price.  Battewry life is very good, on vacations I charge the battery overnight and have enough for a full day of use.", "Date": "August 20, 2011"}, {"Title": "Great for concerts", "Author": "fireflycat \"fireflycat\"", "ReviewID": "RWBGFRJR3796E", "Overall": "5.0", "Content": "I got this camera specifically to take concert photos. I was following the Pearl Jam tour--in large stadiums and arenas--and then the Eddie Vedder solo tour--in small theaters and concert halls. This camera worked GREAT for both! I could zoom right in on the band and capture every drop of sweat. I did my research to figure out which settings would take the best shots, but it turned out that the \"Automatic\" setting took the best shots of all, so the camera was smart enough to let me point and click and enjoy the shows.  I'm glad to have it.", "Date": "November 22, 2008"}, {"Title": "Fabulous Camera!", "Author": "hdc919", "ReviewID": "R1LFBESM3227XG", "Overall": "5.0", "Content": "This camera is really great.  The size and weight are perfect.  It takes wonderful photos indoor or out.  The LCD display is large and clear even in sunlight (a problem with my other digital camera).  I use the camera to take photos for painting, mostly portraits, and the clarity of the 10mp allows me to blow up images to concentrate on specific features without any quality loss or pixelation.  I am very happy with this camera; I have recmmended it to friends.  Great buy!", "Date": "June 29, 2008"}, {"Title": "Nikon P80 - Great Value for a Point and Shoot", "Author": "Sharon in Buffalo \"Sharon\"", "ReviewID": "R3CNESLDF9XD0L", "Overall": "5.0", "Content": "I bought this camera because I didn't want to drag my Nikon D200 with me on vacations.  I've had it a month, and I think it will be a great vacation and family events camera.  It's small enough to keep in your pocket.  It can be used by anyone, from first time user to experienced photographer. You can adjust aperture, shutter and manual exposures.  Especially amazing is the 18x optical zoom.  The facial recognition and in-camera red eye fix is perfect for family events.  Prints come out sharp and with good color.  I would highly recommend this camera.", "Date": "June 23, 2008"}, {"Title": "Read the manual and its a GREAT camera!", "Author": "Steven Howell", "ReviewID": "R2O5TU6CO19LKY", "Overall": "5.0", "Content": "I love this camera!  Im a total novice but I think people that have issues with this camera are not reading the operating manual well enough.  If you do, it will give you all the help to your qusetions you need!  Its great!!!!!!  I LOVE IT!!!!!", "Date": "June 15, 2008"}, {"Title": "Better choices", "Author": "fiddler \"imbuzz\"", "ReviewID": "RYFYAS5HBW2LK", "Overall": "3.0", "Content": "I have had this camera for only 2 days and it is on its way back.  Its not terrible but it satisfies neither uses of a good Digital SLR camera or a convenient point and shoot.  It is not in the class with for example a Nikon D40X as a (near) pro backup type of camera that I had hoped it might be for all the reasons you read elsewhere in these reviews.  On the other hand it is far too bulky to replace a top point and shoot like the Canon G9 or Nikon P5100 which give equal or better performance in the critical areas.  An 18x zoom is a great idea but the rest falls flat and with that much zoom there should be more wide angle capability than 27mm.  Nikon is usually pretty good at getting it right eventually and hopefully they will some day soon fill this gap.", "Date": "May 8, 2008"}, {"Title": "Depends on how you plan on using it...", "Author": "Toni, mom of 3", "ReviewID": "R1TKXGJ911HXYY", "Overall": "3.0", "Content": "I begged for this camera as a Christmas gift.  After using it for several months now, I wish I hadn't!  I agree that the Nikon Coolpix P80 can do amazing things.  The manual is extensive, and for someone into photography who wants to set up the camera for each shot, it is a good camera.  I, however, am a stay at home Mom who just wants a camera that produces a high quality picture for cropping, enlarging, etc.  I want to be able to pick up the camera and take a quick shot of my children doing something goofy or spontaneous.  This camera is slow to turn on.  It also has a slow \"reaction time\" between photos, especially if using the flash.  Speaking of the flash, it is \"automatic\", but it does not automatically open when the camera turns on. Therefore, if you are in a hurry and just snap a shot, you then realize you need to open the flash, wait for it to \"charge\" and the moment is gone.  I have many grainy, yellow pictures where I should have had the flash open but didn't think until too late.  It also is difficult to just snap a quick picture without getting a lot of blur.  You must set up for each shot. At my niece's graduation, I was asked to get shots of her accepting her diploma from a closer vantage-point.  By the time the person in front of me got out of the way, I snapped quickly so as not to miss the moment, and ended up with a blob.  I felt awful! Had I put the camera on a tripod and taken the time to adjust all the settings I am sure the photos would be great, but \"on the fly\" it just isn't very forgiving.  The zoom is amazing, but it is nearly impossible to capture the photo without blur. Again, a tripod would solve that problem.This camera takes MUCH better pictures outside in natural light than it does inside.  Outside photos are bright and sharp, even without any preplanning.  Inside photos are most often off color, grainy and dull.  I'm sure there are settings that could improve these issues, but I don't have the time or desire to run through several menus selecting settings before I take a photo of my daughter's newly missing front teeth.Overall, if you are looking for a \"photography\" camera on a more ameteur level, this is a good choice with its many features.  If you want a point and shoot camera for spontaneous use, the Nikon Coolpix P80 is not a good choice.", "Date": "July 13, 2009"}, {"Title": "Great camera for the price.", "Author": "Kim", "ReviewID": "R1OUY6SWVOTOIQ", "Overall": "5.0", "Content": "While waiting for the DSLRs to come down, I chose this nifty little point and shooter that does much more. I'm far from an expert but the quality of the photos is very good and I love the in-camera editing and D-lighting options.You must read the manual and familiarize yourself with the many functions if you want to get creative and experiment but you can also take it out of the box, charge the battery for two hours, set it to automatic and just click away! The image quality really is quite good.I also purchased the Sandisk 4GB memory card as advised by other reviewers and I'm glad I did- you can store over 1000 photos on it. I recommend it as well.", "Date": "August 2, 2008"}, {"Title": "Great on paper - not practical", "Author": "R. Sankala \"Desi\"", "ReviewID": "R2DD1U6T044CAJ", "Overall": "3.0", "Content": "I was very impressed about this camera for following:- specifications on paper- body, size, weight and style- 18x wide angle zoom lens- battery and SD card choice/performanceFollowing disappointed me:- Auto/Scene mode NOT much usable in different lighting scenarios, jumps to ISO 400+ and pics turn grainy- Other modes including manual were usable, but did NOT get consistent results- Program mode was most usable- Auto focus not fast enough, terrible in indoor/low light- LCD is terrible, compared to canons'- Viewfinder is dull but I managed with it- Pictures turned out grainy in most occasions, unless I fudge settings- VR is NOT much of a help in close-ups, and when used with non-auto modes. Only useful on super zoom situations.I played with it for about a week and took over 100 pics. Most of them were grainy as I took more indoor. Outdoor show graininess when enlarged. I compared quality with Canon S5 IS with pictures taken in the same place and lighting - P80 picture quality is grainy.Returned it to tigerdirect and probably will go with Canon S5 IS or Canon SX 100 IS.", "Date": "July 26, 2008"}, {"Title": "Older model, but great camera!", "Author": "Kenneth Marcum \"Harley Man\"", "ReviewID": "R3SPWHT9OE91Z8", "Overall": "5.0", "Content": "I can not really say anything bad about this little camera from Nikon. It's been around for a few years now but still demands top marks. I bought mine when they first came out and have taken THOUSANDS of pictures with it! Never had a single issue. It would be wise to purchase an extra battery or two as well as a couple extra memory cards if you are a shutter bug like me and my wife.  It catches action shots perfectly with no blur. The picture quality is second to none!! I have taken lots of pictures of lightning with this camera and they look awesome!! I shoot a compound bow as well and use this camera to catch the arrow in flight... It does a great job, but you have to time it just right!! The video mode (and sound) is great too, but you can't zoom in and out while filming very well. BUT, for the money, you simply can't complain! I can take pictures and upload them straight from the camera to my computer or printer or straight to Facebook if I want.  Or pull the card and take your pictures anywhere!! Sure, there are a lot better and newer cameras out there, but they carry a lot bigger price tags too! If you want a great, compact camera and great value - the P80 is for you.As with all my reviews, the above is only my opinion of an item that I own or have tested.  Depending on the overall rating that I give it, It is possible that I may have either purchased or tested a faulty unit or an exceptionally good one.  Your experience may be better or worse than mine.  Paying attention to the up or down trend from several reviewers will help you make your decision.Best of Luck!!", "Date": "November 25, 2011"}, {"Title": "My thoughts after 2 1/2 years of use", "Author": "Kristen", "ReviewID": "R2B7B1PL37CTDB", "Overall": "3.0", "Content": "I purchased the Nikon P80 the same month it debuted in the US. The zoom was amazing at the time, in comparison to other cameras in its price range. It was a good purchase at the time, and while I realize there is a new version of this camera available, I thought my experience with this particular camera might be helpful to those researching this type of point and shoot.To begin, I am a very amateur photographer, and the P80 was an upgrade from my Panasonic Lumix. I enjoy macro photography, and I had gotten to the point where I'd outgrown the capabilities of my Lumix... and I was reluctant to purchase a DSLR at the time. The zoom capabilities of this camera are impressive. However, after about 12 months of moderate use, the zoom function slowed tremendously. The motor grew more noisy, and the camera's overall performance was sluggish. I cleaned it, reformatted the Extreme III SDHC card I was using, but it didn't help any. Now, I am not a photo guru, but in my opinion, this camera was not made to last. With how fast this type of technology improves, it might not matter as a camera like this will be obsolete before it dies of 'natural causes'. But I paid four hundred dollars for a camera that started to poop out after only a year. This is why I chose the overall rating.This camera will do a fine job taking quality photos in good light... but its overall performance is disappointing in low-light environments (as over reviewers have mentioned). With how the prices of entry-level DSLRs have come down lately, I don't see how this model is practical for the majority of photographers. I have just upgraded to my first DSLR, and I have to say that the P80 is just about as heavy and awkward as my new Sony a390 with the 18mm-55mm lens attached. Granted, when turned off, the P80 is more compact, but not by much... and considering the quality of my a390 over my P80, and the fact that right now, they are very similar in price... if you are looking at this as a possible upgrade, go all the way and move up to a DSLR!", "Date": "December 2, 2010"}, {"Title": "Cool!!!!!!!!!!! Pix Nikon P80", "Author": "Stephanie T. Dixon-salmon \"Nyah\"", "ReviewID": "R22GG9WWALWWTK", "Overall": "4.0", "Content": "I bought this camera at Amazon online store and from all the bad reviews I probably wouldnt have bought it, but after reading a few reviews from some professional photographers I immediately understood why the general consumer would have a problem with it. I am from jamaica and I ordered it online and shipped it to a friend in the states that took the camera back to jamaica for me, I asked her to take a few photos just to see that it was in working order before she actually took it to jamaica, when she arrived in the island and i took the camera from her, i noticed the photos she had taken on her trip to the States were all over exposed and were in bad quality and I remembered instantly reading back to similar complaints made by first time buyers that it just took aweful pictures in automatic mode, but I also remembered the professionals saying that the best camera in the world took aweful pictures in the hands of the unprofessional and the unwilling to educate, so I then started reading and from the knowledge gained from the manuals and just fooling around, I found that the camera was totally capable of creating some really good shots, 100 times better than the one my friend previously took in the states, point of the story is, if you are not into manually doing things and reading is not your thing but instead the new lazy way of the world then this camera is not for you....... but if you are old fashion or professional and want a camera that you get what you tell it to do, instead of you get only what automatica gives you, then this camera is a sure winner, everything irie!!!! Cool Pix!!!!", "Date": "February 21, 2009"}, {"Title": "Too much noise", "Author": "R. Steven Crabtree", "ReviewID": "R3GVPRIW5V2HZ1", "Overall": "3.0", "Content": "There are many compact super-zoom cameras to choose from and all perform very similarly.  There are some differences so selecting from this group should depend on your preferences and shooting style.  I selected the Nikon P80 based on some reviews and have been very disappointed.The Nikon performs okay in good conditions, e.g. outside on a sunny day.  It is not very good for indoor/ poor lighting conditions.  It is terrible for continuous shooting such as for sports at frame rates of 4 per second or higher.  The problem is that the camera automatically adjusts the ISO setting with certain settings.  Continuous shots at 1.1 frames per second are okay but at 4 frames per second it is not okay due to noise.  At any ISO setting above 100 the noise becomes unacceptable.  Shooting at four frames per second, on a bright sunny day, resulted in so much noise that the pictures were unacceptable.If all you want is to shoot still shots outdoors in nice weather then this is a great camera.  If you want to shoot indoors, in poor light, or continuous mode, then get the Panasonic FZ28 or Cannon SX 10 IS.There is a very good review of the top cameras in this category on the dpreview web site.", "Date": "February 14, 2009"}, {"Title": "Nikon P80", "Author": "James", "ReviewID": "R2RM5IGKPDWTVN", "Overall": "5.0", "Content": "I just got my Nikon Coolpix P80, on Dec 5, it is a Christmas present to myself. I love it!!!! I am not a pro photographer or anything like that (except when it comes to taking X-rays) but with the quality of the images that I have taken so far they are amazing. I am still learning how to use this camera, but I think with some time in reading the manual over I will get it. I had a Kodak 6.1mp before and this just blows it out of the water.The price for this camera was unbeatable too, compared to Best Buy, Walmart, and other retailers.", "Date": "December 6, 2008"}, {"Title": "Great Value and Performance", "Author": "C. L. Sumrall \"Photo Newbie\"", "ReviewID": "R36PQ4S5IOE2VD", "Overall": "5.0", "Content": "This camera gives you plenty of features for the money.  I did a lot of research before buying, and I am well satisfied with my choice.  The Nikon Coolpix P80 has performed well, is easy to operate out of the box, and is a great choice for those of us who want more performance than a point and shoot digital, but can't justify going the SLR route. I read online that it had a slow reaction time, but  with the various modes, I have had no trouble snapping photos of my dog, birds, etc. I am still learning more about it's features using the manual, but I was able to figure most of it out on my own: the menus are easy.  For some more specific advanced settings, it does take a minute to get it situated, but that doesn't often come up and is pretty standard.  I would reccomend it to anyone in the market.", "Date": "November 3, 2008"}, {"Title": "Nikon Coolpix P80", "Author": "A. Engemann", "ReviewID": "R2BX45BV9JC647", "Overall": "5.0", "Content": "Outstanding little camera. The digital viewfinder eliminates shooting blindly in bright sun. Great features for the price. This camera is one notch below a DLSR and much lower in cost.", "Date": "August 26, 2008"}, {"Title": "ALL I WAS LOOKING FOR", "Author": "J. BOLIVAR", "ReviewID": "R2H6EFWUA834VA", "Overall": "5.0", "Content": "i was looking a excellent camera, with great zoom, good battery life, high mega pixels, then i start to thinking between this one and the canon ISS5, and i decided NIKON, THIS CAMERA HAS EVERYTHING, CAN RECORD VIDEOS AS LONG AS YOUR MEMORY CAN, CAN TAKE SEQUENCE (SPORT), HAS THE FACE DETECTION TECHNOLOGY, THE ZOOM IS AMAZING, HAS RECHARGED BATTERY AND THE BEST OF EVERYTHING IS THE PRICE I BOUGHT IT FOR 330$, IF YOU ARE LOOKING FOR SOMETHING NOT TOO SMALL BUT THAT CAN MAKE A LOT OF STUFF EVERYTHING IN ONE, DEFINITIVE  U HAVE TO BUY A NIKON IN SPECIAL NIKON P 80...", "Date": "August 19, 2008"}, {"Title": "Fantastic digital imager", "Author": "H. Clopper \"photo taker\"", "ReviewID": "R359ZNFAJFIG7Q", "Overall": "5.0", "Content": "This camera surpassd my expectations about a small digital SLR wannabe.  I have other SLR's and a 10X optical zoom digital, but this one is the easiest to use and has \"way more\" capability than any other camera I own.  For the competent experienced photo taker this one is a must!", "Date": "August 17, 2008"}, {"Title": "Love It", "Author": "ArnieJr", "ReviewID": "R2UWS1SCHK43B1", "Overall": "5.0", "Content": "This camera is everything I had hoped for and more! I was trying to replace a 35mm Minolta with several lenses, flash equip. etc. I think this will do it.", "Date": "July 24, 2008"}, {"Title": "Love the Nikon Coolpix P80 camera!", "Author": "O. Wiseman", "ReviewID": "R3QQNJS6DFJUAM", "Overall": "5.0", "Content": "Fabulous camera... even for the shaky beginner, it takes flawless pictures.The best feature is the 1-finger zoom that lets me \"stage\" the picture very quickly, together with the easy to use special settings and menus to ensure that my picture doesn't suffer from the dreaded 3B's: blurry, boring or bleached out, even from a moving tour bus on a European highway!Our best picture was taken from a boat in an underground cave, in almost total darkness, with just a bit of light reflecting off the underground lake.We paired our camera with a small bag and an 8GB SD chip, plus an extra battery which we carried with us fully charged. Thus we could change the battery on the fly and never ran out of power.Amazon's order came quickly and securely, thanks!!!!", "Date": "July 12, 2008"}, {"Title": "Not such a great camera", "Author": "onestopnyc", "ReviewID": "R257KYI7XQVE9Q", "Overall": "2.0", "Content": "Well, after reading about it in the NYTimes I was excited at the idea of having a camera with a zoom 18x and for that price range. I currently own a Lumix FX100. Let me tell you that I returned the Nikon yesterday after 2 days of trying to get a decent picture out of it. First off when zooming all the way to 18x you would see shadows on the corner of the picture. The noise was pretty bad and most pictures even in low ISO looked grainy. I could barely get a focused picture out of it and often would have a blurry subject with a focused background (and no I wasn't focusing on the background since my subject was in the center). Finally the video mode although of good quality would not work on my mac. The files are saved in .AVI format and I tried every player I have including Quicktime which usually plays AVI files, but nothing, every single time it crashed. I researched a bit and found out that Panasonic had a similar camera but with 8.1 megapixels for less than $300. Ratings are amazing and the camera is sold out in most stores so that must be a good sign. I have ordered it and will hope it performs better than this one.", "Date": "May 9, 2008"}, {"Title": "Buyer beware...", "Author": "Richard L. Edwards", "ReviewID": "R3HXT9ODOB1TGX", "Overall": "1.0", "Content": "I bought the camera for my wifes b-day.  What a nice looking camera and it had all the functuality that one needs for a camera in this price range.  The problem, our when taking pictures of our daughter playing in her soccer games, we noticed on sports mode that there was a green line on every third picture.  Every third picture had a green line running down it.  We took it back to Best Buy where the manager swapped it our for another camera, exactly like it, a Nikon Coolpix 10.1.  While we were there, the Geeksquad guy came by and said lets take a look at the model, the one in store that they show potential customers.  Guess what?  It did the samething.  So we opened the new camera, took it out of the case, fired it up on sports mode and guess what?  It did the samething.  Best Buy pulled the camera from the display and has sent the 7 back to the manufacture.  True story.  This happened at the Best Buy in Cedar Park, Texas.  We then bought the Sony Cybershot for about $425, and we love it.  Plus the Cybershot lets you take pictures rapidly with zero lag time.  Thanks Nikon.  Go Sony.", "Date": "September 27, 2008"}, {"Title": "Wow!", "Author": "p0.An", "ReviewID": "R3BH5SP8QE12ZY", "Overall": "5.0", "Content": "This review is a little too late, but may serve as a reference for other similar nikon products.3 years after buying the camera, it still works as good as it did on day one.Takes excellent daylight pics.A lot of noise is seen at high ISO levels (night pics with flash turned off), but that is what could be expected from a camera of this range.Manual setting are just what you need as an amateur photographer and the camera does good justice in that aspect.18x zoom is good, but impractical unless used with a tripod. Also image quality suffers slightly with 18x zoom.Overall, a very good starter camera for budding photographers. Just the right step before putting down $600-700 on a DSLR.", "Date": "February 6, 2012"}, {"Title": "Great camera, good value", "Author": "Hurrijeff", "ReviewID": "R1T21MJSKAADV", "Overall": "5.0", "Content": "Let's face it, if your a professional photographer this is most likely not the camera for you and your not paying for a \"professional\" camera. If your like me you need a camera to take photos mainly for yourself and to share with family and friends. This camera will far exceed your needs. Most of us will never utilize all of the features available in this camera but they are there. It takes great pictures and is very easy to use. Sometimes I wish it had a hot shoe but would I really want to lug a flash around Disney, probably not anyway. The camera has been working flawlessly now for over 3 years and 8000 photos and videos so I'm giving the Nikon P80 an excellent review and 5 stars.", "Date": "November 26, 2011"}, {"Title": "Excellent Gift", "Author": "N. Turnquest", "ReviewID": "RP9CK9T75GG48", "Overall": "5.0", "Content": "I bought this camera as a gift for my boyfriend. I didn't want to overwhelm him with a DSLR. This camera works great as a point-and-shoot but with the flexibility of a few more advanced options. But the major selling point of this camera for me was its incredible optical zoom. Most point-and-shoots won't take you to 18x. And I really wanted my gift to rival the more expensive DSLR models. He loves the camera...although I will admit that's partly because it has the famous Nikon brand attached to it. And the rapid-shot mode is totally awesome! It's really cool seeing the frame-by-frame effect when shooting a subject in motion. The closest competition I remember seeing are Canon cameras. If you're shopping for an amateur photo buff, this camera is the perfect fit. They'll get great photos without having to be an expert.", "Date": "August 13, 2009"}, {"Title": "Comes As Advertised", "Author": "D. Houde", "ReviewID": "R2QZP0DCZW0M32", "Overall": "5.0", "Content": "The reviews of the P80 seem to be a \"mixed bag\" here on Amazon as of late. The camera is focused on being a gateway product between the typical compact or pocket camera's and the entry level DSLR's found on the market. The P80 does require that the user actually read the including Instruction Manual to be able to take full advantage of all features. Many pre-set Scene Modes are available including (Portrait, Landscape, Night Portrait, Party/Indoor, Beach/Snow, Sunset, Dusk/Dawn, Night Landscape, Close Up, Museum, Fireworks, Copy, Backlight, Panorama). The camera is very intuitive and easy to navigate using the bright LCD screen for actions such as changing Scene Modes and reviewing pictures. While I personally love the camera, I can see how others may find it difficult to use in a \"point and shoot\" setting especially in Auto Mode. If you're just looking to take quick pictures and have no interest in photography, you may want to pass on these higher end compacts all together.One of the biggest problems I've read about was the Autofocus and how many images would come out blurred. I have not found this to be an issue. Please remember that this camera does not (nor does any other camera) have a brain. You need to tell the P80 what to do as you would with any other device. If you're taking a shot of a subject in the distance and there is something in the foreground of your view, the camera may focus on the foreground image instead while blurring out the intended subject. The user can easily adjust the focus settings appropriately. Again this requires that the user read the Manual and learn the appropriate settings.The issue of slow recovery time does exist but not only on the P80, but other high end compacts as well. For photography purposes I don't see this as an issue, but for \"point and shoot\" users this could be a problem.The 18X zoom is great and comes as advertised.The Scene Modes work great and so do the Shutter and Aperture priority settings. I would stay away from the Auto Mode as I would normally do with most camera anyways.Physically the P80 is appealing and does not feel cheap. It's slightly smaller than I expected but I've grown to like that about this camera.Overall I'm very happy with the Nikon P80 as it delivers on everything it promised in the marketing material. If you're looking for an entry level photography camera give this one a try. Point and Shoot users may want to stick with the compact/pocket digital cameras.", "Date": "July 20, 2009"}, {"Title": "Compact yet powerful", "Author": "David Connick \"Gooner4ever\"", "ReviewID": "R277S7FLNOEFQB", "Overall": "4.0", "Content": "This review is not going to discuss technical attributes because I don't have the expertise to do that.  I simply wanted a compact and lightweight camera with extensive zooming capabilities at a reasonable price.  With the Nikon Coolpix that's what I got.  The camera has all the functions an occasional, amateur photographer like me needs.  The fact that the lens is not interchangeable is a mixed blessing.  While it's the case that the inability to change lenses reduces flexibility, the range of the lens certainly meets all my needs and means that I don't have to be bothered with carting additional lenses around.  So, on balance I'm satisfied that this camera meets my photographic goals.", "Date": "February 9, 2009"}, {"Title": "Nikon P80", "Author": "Paul Garland", "ReviewID": "R2KKX0TPO3IJJW", "Overall": "5.0", "Content": "I use a Nikon D300s and a D80 all the time.  And I am kind of a lens hog - too many lenses....  Plus I use a Nikon L18 point and shoot when I'm out walking the dog.The P80 is a really fine little camera.  Cheap too.  Incredibly long optical zoom with built in vibration reduction.  It does movies too.  And to do macro with the DSLRs I have spent a LOT of money on lenses, extension tubes, bellows, reversing rings, etc.  The P80 gets up as close as anyone could want to get and then some.No complaints at all.  It is just a great package in every way.I bought mine to use with a GigaPan, so it was important that it would shoot in manual mode (shutter and aperture) at ISO 64, do manual focus, allow VR to be turned off, and do fine with white balance preset manual.  The mountain setting for manual focus beats what I can get with any of my SLRs, and this camera has a nice long lens for a point and shoot.Only complaint:  Too bad they don't put a little larger sized sensor (like on the on this camera.  It would then be unbeatable.I also wish Nikon would get rid of the name \"Coolpix\" which at least to me cheapens these nice little cameras.", "Date": "February 8, 2009"}, {"Title": "Nice camera but my kids move to fast for it :(", "Author": "mom 4 \"jess\"", "ReviewID": "R3B01CN260GPP9", "Overall": "3.0", "Content": "I bought this camera recently because my truck got broken into and my favorite camera in the whole world got stolen. I was so excited about this new camera because of the 18x zoom but having all of my kids in sports, the action shots I took didn't come out clear and no matter what I did I could not get any good pictures. For someone with a little less action I think this camera is very nice but as for me, I had to return it for something a little faster.", "Date": "January 31, 2009"}, {"Title": "Happy with the P80", "Author": "gabby123", "ReviewID": "R2CTZMA37GCYBM", "Overall": "5.0", "Content": "I bought this camera as an upgrade to my point and shoot.  I wanted higher quality, greater creative control, and that 18x zoom without having to spend DSLR prices and carrying bulky lens.  I was worried due to some of the negative reviews.  After owning this camera 5 mos and taking thousands of primarily landscape and wildlife pics, I am very happy with my purchase.The camera does require reading the manual carefully and taking some time to experiment with the different settings.  In the beginning I took some blurry pics, but with some patience and practice, I am getting great shots out of this camera.  It is light weight, easy to use, and the ability to rapidly change from a wide angle shot to a closeup zoom in, is great.It is not a DSLR, but is a versatile, high-quality camera, that allows you to learn and expand your photographic skills and produce some great shots.", "Date": "October 27, 2008"}, {"Title": "So far, so good", "Author": "PAG", "ReviewID": "R14CQFLQHYTUM7", "Overall": "5.0", "Content": "Reading helpful reviews on Amazon guided me to expect the best of this camera and to avoid non sharp images.  The camera is complicated, so I have taken a lot of time to learn it, and have taken few pictures.  In my first set, taken of a garden in early morning, but blazing sun have been decent.  Sharp, and pleasant.  More later.  I have now 3 Nikons, D300, D80, and P80.  Got this camera for portability.  There is transfer from the DSLRs to this one.", "Date": "August 8, 2008"}, {"Title": "Great camera - very easy to use, very flexible and good pictures", "Author": "Irwin L. Goverman \"govy1\"", "ReviewID": "R2EM1DA8I1QIQ6", "Overall": "4.0", "Content": "I've used a Canon Pro IS 2 for years and switched to the P80 for a trip to Italy with over 500 pictures.  This is a very easy camera to use, and the controls are intuitive, easy to access and offer a great deal of flexibility.  Nice form factor, very light and small.  I don't know why there's so much negative about picture quality -- the pictures compared very well with my other point-and-shoot and the IS 2 in terms of quality.  It IS a little slow to start up, but normally that's not much of a negative.", "Date": "July 28, 2008"}, {"Title": "Read Reveiws; Read Manual; Enjoy", "Author": "Mr. S. GARZACORONA", "ReviewID": "R3ABD8ZG5WQ2UV", "Overall": "4.0", "Content": "I have owned 4 Canons in the last 10 years and cannot complain for the quality in materials and performance.  I was hesitant to change to Nikon since I'm somehow acquainted with Canon's \"point n'shoot\" strenghts and weaknesses. I don't regret having changed. The camera is very good and the menu is really easy to navigate.Nikon's P80 is great; but you need to read the manual and take a trip out for a weekend to try different combinatioins in different lighting conditions. I have tried it at the beach with the kids running around; birds walking at the beach; lizards at tree branches; and fireworks at night.  Nothing but great results.The various shooting options that you get with this camera and the many many perks are the perfect step-up from straight forward point n' shoot to more flexible shooting. I'm more than satisfied with my purchase.The only two cons so far are; (i) horrible lens cap (I would pay 10% more to get a self-retractible lens cap) and (ii) plastic of camera body feels a bit cheap (I guess I'm just used to Canon's metal body).", "Date": "July 12, 2008"}, {"Title": "Good camera, comfortable and good images", "Author": "Jay Zerbe \"abstract art junkie\"", "ReviewID": "R19XNWTZH3CDCS", "Overall": "4.0", "Content": "My only disappointment with this camera is that I read all the BAD reviews AFTER I purchased it! :( However, it has worked out well for me. Stabilization is good, and I have not found the images noisy (as the BAD reviews say), but they are a bit soft. The feel of the camera is wonderful! I have used small point-and-shoot cameras for several years, and am happy to be back to this format (used SLRs in my film stock days). Color balance is excellent. I also like the option of the manual flash. It lets me switch quickly back and forth between using it and not using it easily when doing table-top photos of items for e-bay. I also really like the wide-angle to super telephoto lens included! For the price, this is a fine camera!", "Date": "July 3, 2008"}, {"Title": "Good Camera", "Author": "Brandon Foley \"flyinhi5150\"", "ReviewID": "R1DZN2A2NZXAI7", "Overall": "5.0", "Content": "This camera takes very good pictures. The pics outside are excellent. When taking pics inside you need to watch and not zoom in too close, but the pics are still good. I figure there is a setting within the camera to make the pics inside even better. I do not have any complaints with this camera.", "Date": "June 22, 2008"}, {"Title": "coolpix 80", "Author": "Murray L. Herr", "ReviewID": "R2HJFWR339GBAJ", "Overall": "5.0", "Content": "so far i love the camera.i have been taking lots of pictures with it & have had great results with it. if a complete photo dummy like me can get great pictures with this camera it has to be good.", "Date": "June 12, 2008"}, {"Title": "Decent bridge camera", "Author": "C. McColl", "ReviewID": "RZ6U2EI6YYLIF", "Overall": "4.0", "Content": "This is a great camera if you aren't ready to shell out the big bucks for a Digital SLR, but also want something of better quality and capabilities than say a pocket sized point and shoot camera.  Nikon has three different camera series: L (\"Lifesyle series\") S (\"Style series), and P (\"Performance series\").  The Ls are your basic, slightly more bulky, everyday point and shoot styles. They typically run off of AA batteries, hence are slightly more chunky in shape. The menus are very simple, and the price range is usually $100 or less. The S series emphasizes a more stylized, sophisticated design...your touch screen menus, compact hard metal bodies, slim make. These are usually $115-150 price range and use the lithium-ion rechargeable cell battery. The P series is where you're at before you get to a DSLR, & it's a great bridge between the two in my opinion.  Depending on your model, you can expect to pay anywhere from $200-350 on a P series. I owned the P80 for about a year before selling it and upgrading. It served me very well in a variety of situations, though it was certainly not flawless.Pros:  1. Superior zoom/lens quality. You might see that 18x optical zoom and be skeptical, but I was very pleasantly surprised. Even fully zoomed in, I produced crystal clear beautiful images. Of course how shaky the person operating the camera is plays a big role, but with a steady hand you will get great shots. 2. Actual ergonomics. The camera is big, but not so huge that you feel you can't take it everywhere with you. I wore it strapped around my neck while riding bike trails, and as long as the lens cap was secure, I wasn't worried about it. It feels and appears to be very solid and well made.  3. Great battery life. After a full charge, I usually could get nearly 300 shots before having to plug it back in. I am also not big on using my flash though, so that plays a lot into it. 4. Helpful manual. Some cameras give you a 5 page booklet and then you're on your own. Or worse, you get a 'digital manual', CD, and no literature whatsoever. Nikon's manual was not only thorough in explanation of features, but also provides the user with helpful tips in a variety of shooting situations. Lots of illustrations to take the guesswork out also.  5. Full manual controls. Provided you know how to use these, you'll have a lot of fun experimenting. I was able to take some really nice potraits while in manual mode, with the camera effectively fuzzing out the background and sharply focusing on my subject. Sport mode was nice when wanting to shoot several images in succession, however takes some getting used to because unlike a DSLR, you won't hear the clicking of the shots being recorded each time. You hold your button down and it will record until you let go pretty much. Kind of neat, except then you have like 30 images that are nearly identical and have to go through and weed out the bad ones.Cons: Not that great indoors, unless using your flash, which is unfortunate because a lot of the time the flash ruins the ambience of things.  Without the flash, most of the pictures took on a golden tone, sometimes almost orange, which was rather annoying.  Also very noisy indoors!!  They didn't look that bad on the LCD, but when printed you could definitely notice.  The LCD in general could be irritating, because the pictures looked great on there...but on my computer or printed from a lab, they looked much more drab.  It can be kind of tedious having to go in and edit each and every picture just to add some saturation and contrast.  I've owned a variety of Nikons and Canons...I must say that Canon seems to be far better in the way of vivid, sharp color straight out of the box.  The software the camera comes with is definitely lacking. It is basically just for photo transferring, not much at all in the way of actual editing. I was also looking forward to taking some great panoramic shots with this camera, but it doesn't offer in-camera stitching so I didn't bother half the time.  The software provides a stitching tool, but in the end it's just not feasible for someone who takes a lot of shots to go back and locate those specific three. Especially when you have to wait til you're on your computer to do so.In general--very nice camera, good buy for the price. The zoom is great, and the 10 megapixels are nice for making large prints. My complaints are/were only minor in the end, as overall I got some very nice quality photos from this.  I would definitely agree with other reviewers though in that the more experienced photographer will be finicky with this camera's noise level and other 'little quirks' as described. If you don't care about the minute details though, leave the camera on Auto and have at it.", "Date": "February 21, 2010"}, {"Title": "The best camera ever!", "Author": "Sarah", "ReviewID": "R24LZQO5719LWG", "Overall": "5.0", "Content": "This camera is the best camera that I have ever had.  Yes, there probably are better cameras, but I have never experienced them and this camera works just the way I need it to.  This lightweight camera has amazing features and takes the best pictures.  My favorite feature on the camera is the rapid action shot.  On the dial wheel, you can find it by locating the picture of a runner running.  That feature is really good when you need to take pictures of children running and playing around or, my favorite, when you take fireworks.  I have gotten some really good shots of fireworks at just the right moment.  Shots that would not have been possible if I have not had this shot.  All in all, I definitely recommend that you get this camera for all of your photography needs.  This lightweight, attractive, reasonably cheap camera is the perfect camera for you!", "Date": "August 29, 2009"}, {"Title": "Good inexpensive camera", "Author": "Mary K. Park", "ReviewID": "RVWL8ME0G9WB4", "Overall": "5.0", "Content": "This is a great little camera!It's light, but still has enough of a body to really hold on to and get a steady shot.A memory card or two is a must. Set on the highest megapixels, I found that the camera itself will only hold about 39 images, but the memory cards are pretty cheap.If you're going to take pictures all day, a second battery is a must as well. But if you have down town between shoots or activities, it also charges quickly.I love my CoolPix P80", "Date": "August 11, 2009"}, {"Title": "Very disappointed", "Author": "Barry P. Garozzo", "ReviewID": "R3585CO1A54E0W", "Overall": "2.0", "Content": "I recieved this camera as a Christmas present from my girlfriend for the Christmas of 2008.  I have been using it now for about 7 months, and overall am very disappointed.To save space, ill tell you what my biggest problem with this camera is.  The focus is HORRIBLE.  I've taken soo many pictures at this point (thousands) and i would say at least 80% of them have been very soft focus.  And its odd, because some photos look out of focus in the LCD and end up being very sharp, and others that look sharp in the LCD are soft when viewed on my computer.Second, noise is present in almost every photo I have taken.  It boggles my mind that there is grain in the photo i took at ISO100 and in daylight.  It has ruined a lot of good photos for me.I have used every  feature this camera has to offer over these months, thinking maybe I just had the wrong settings or had to tweak something, and nothing has helped.  I have read many reviews that say the same.My original digital camera, a 2 megapixel kodak took better photos than this.  I am big on photography, and am very dismayed that my first digital camera has better quality than this.  Since I have  yet to get a new dslr, i've resorted to my old Canon Rebel Film Dslr camera, which blows this out of the water.", "Date": "July 19, 2009"}, {"Title": "Digital Camera", "Author": "Aivlvia", "ReviewID": "R32XZQ9UNMNV66", "Overall": "4.0", "Content": "A nice camera for what I wanted it. I am working on learning manual settings and this camera is simple enough to allow me to do that without having to spend $1000 to do it. The zoom is fairly nice although occasionally the automatic focus makes it go funny and it takes a bit to make it work again. The autofocus is ok. Definitely better than you basic digital camera. I have enjoyed playing around with some sports and multi-shot settings.", "Date": "July 4, 2009"}, {"Title": "So far, so good", "Author": "Linda Merrill \"Decorator and design blogger\"", "ReviewID": "R3G1MMYMLC2BL", "Overall": "4.0", "Content": "I'm enjoying getting to know my new camera. I would say that when taking fast photos, it has a slow recovery time, which can be a bit annoying, but it's also possible that I should be using a specific mode for it. However, the images are clear and crisp, it's easy to handle and offers several modes which I think will improve my overall picture taking, when I get to know them.", "Date": "June 16, 2009"}, {"Title": "Does what it claims, easy and intuitive", "Author": "Martha Gay", "ReviewID": "R1PQYRRSBGBPZ4", "Overall": "4.0", "Content": "I wanted a full-featured point and shoot camera with a long zoom. The Nikon was on sale and I bought it without a lot of shopping around. I love it. I haven't found any claims to be false or misleading. It just works. Unlike some other digital cameras I've used, the P80 seems intuitive. For example, to select features, one sets the mode on the dial and then hits the menu button. One is then presented with menu choices for that mode. It does cool panoramas and shoots video in several formats. It's very light-weight.I'm very pleased with the image quality. The squirrel on my deck (at 18x-shot through the window) had discernible whiskers.I'm still playing with the software.The case that comes with the \"kit\" seems pretty useless. For now I'm storing cables, etc., it it.This is a good camera for people with some photography experience or tech-savvy beginners. The total novice might find the wealth of features a bit confusing.", "Date": "May 6, 2009"}, {"Title": "Love the new Camera", "Author": "Carol E. Brooker", "ReviewID": "R2SA1CFKDNSHM0", "Overall": "5.0", "Content": "I'm still playing and checking out all I can do with my new camera and so far I love it.  I'm signed up to take a photography class and can't wait to learn more.", "Date": "May 2, 2009"}, {"Title": "Great camera", "Author": "Joanne Held \"Desert Lady\"", "ReviewID": "R3RVHO2JDM4FAU", "Overall": "5.0", "Content": "Great camera for the price. All automatic  with many of the features of an SLR.", "Date": "April 24, 2009"}, {"Title": "It's a good camera", "Author": "RKBGAP", "ReviewID": "RV6BO6201JV4J", "Overall": "5.0", "Content": "I've had the P80 for about a month now and I have to say that I really like this camera. As one of the previous reviewers stated, you'll need to read the manual and have some knowledge of aperture and shutter settings. Not a broad knowledge but at least an idea of what it's about. Out of the box I was dissapointed at first. It did seem to have a hard time taking clear pics in low light. But, after playing with the settings and getting out of the auto mode, I was very pleased with the results. One you get it set up, the way you want, it sorta becomes a point and shoot but has the ability to adjust very quickly. It's not really a point and shoot so don't expect it to be. But, if you'll spend a little time reading about the settings and play with it some, you can take some very nice pics. This camera replaced a Sony DSC S50 which was more basic and was maybe a little easier to set up, but this camera flat out takes better pictures. Oh yea, you'll love the zoom if your used to a 6x like I was. Get it, study it and have some fun. I recommend it.", "Date": "April 19, 2009"}, {"Title": "Nikon Coolpix P80 review + Amazon + Broadway Photo", "Author": "Niika21", "ReviewID": "R2CEOQLF7JNXBJ", "Overall": "4.0", "Content": "All in all, this is a good camera.  I was looking for a camera with a good optical zoom, that is why I chose this camera. Nikon makes quality products, and this camera is of very good quality. I am not a professional by any means, just someone who really enjoys photography, and I have gotten many beautiful pics out of this camera.  It is great in daylight, but I have had trouble getting clear pics at night.  However, I will contribute my fuzzy pics at the moment to user error, as I have not read through the whole manual yet, and I know there is a lot to learn about this camera. It has the look of a professional camera, though it is entirely digital. Large LCD screen, with option to turn it off and only use the viewfinder, which I do often. Comes with software to transfer pics to computer, and is easy to use.  As of right now, I am very happy with this camera. [...].", "Date": "April 9, 2009"}, {"Title": "Good Step up", "Author": "Scott Jason Hervieux", "ReviewID": "R3TBAZ4MW9ENOG", "Overall": "4.0", "Content": "I had this camera for about 6 months now and have taken 100's of photos with it.  This camera is a good step up from any point and shoot, and not as expensive as a true D-SLR.  With it's many settings, you get the feel and quality of an SLR camera.First - well built and feels good in my hands.Second - many settings, allows me to take good nighttime pictures, and pictures with great detail.Third - with it;s 18x opticle zoom, I can take many wildlife pictures with great detail.This by far is the best Camera that I have owned.My only CON with it, is getting to know all the settings.  I tend the messup the ISO setting alot.  Most of the time I use AUTO-ISO unless shooting at night.Update 4/2/2011 - 2 yrs later this is still my heavy weight camera.  Still taking great pictures.  I think I figured out most of the settings when I need to adjust them.  But the auto settings still work the best.  I used this for semi-professional use in weddings.  This is more suited for still pictures than video.  Video is VGA quality, and tends to eat 2gb cards quickly.  Still quality with the right settings can match HD cameras. I wish I could upload pictures here to show you.", "Date": "March 8, 2009"}, {"Title": "WOW", "Author": "Shawn Rohbock", "ReviewID": "RFBFXPGLBFFS", "Overall": "5.0", "Content": "What a camera!!! This baby is well built, inexpensive, and very VERY impressive! Its a must have for anyone who is looking for a point and shoot camera!", "Date": "March 5, 2009"}, {"Title": "Great Camera-Easy to use", "Author": "Evan M. Soto \"Sleeps\"", "ReviewID": "R2UCGK36WR6I7P", "Overall": "4.0", "Content": "When I first picked this camera out it was after a very long debate in my head. I couldnt decide if I wanted to get the Panasonic because of its Leica lens or this because it was a lot cheaper and just as comparabole in image quality. Well we both know what I chose. All I have to say is that it is a very functional camera and the next step up from a normal p&s;, but it will definitley move you in the right direction for when your ready to take the DSLR challenge", "Date": "February 20, 2009"}, {"Title": "Great camera to take baby pictures", "Author": "E. Mizin", "ReviewID": "R16BRB0B4G9PRF", "Overall": "5.0", "Content": "I've had P80 for about six months now and think it's a great camera.  I particularly like the 18X zoom and the colors.  One note on the colors is that they seem to turn out much better with flash on, even outside in natural light.  Overall, a great camera.", "Date": "February 15, 2009"}, {"Title": "Wide Angle Lens--like what we actually see with true color.Read the manual", "Author": "Alexander E. Maas \"Alex Maas\"", "ReviewID": "R1TEBQXYJNE3CF", "Overall": "4.0", "Content": "I am not any type of professional photographer.  However, I once read in a column by Marilyn vos Savant, the woman with the world's highest IQ, that the reason photos never seem like being there is because photos do not present what we actually see.  She suggested using a wide angle lens to make photos more like what we actually see in real life.I tucked this information in the back of my mind, until someone I know went to Costa Rica and brought back photos with one of the Panasonic Lumix models that fits in your pocket but has a built-in wide angle lens.  And boy, was I ever impressed--when I thought I had actually read a bad review of that particular camera on one site or another.  The wide angle lens did make all the difference, especially in landscape photos.What I never liked about the Panasonic Lumix  models is the color is somewhat off.  I shoot photos for the Ebay and often the color is off, meaning I have to make sure the light is just right.  With this camera, this is never a problem.Some people complain that it is not perfect for videos or something like this. I think people are really expecting quite a lot from a digital camera these days.  It is NOT a video camera--do you expect a video camera to take great digital photos also?  Probably not.Also it does 18X telephoto--you would have to buy two different Panasonic Lumix models to do the same thing.  I was going to do this since those both fit in your pocket and this one does not. It is not gigantic, but it is rather big.Finally, having a wide angle lens is completely different than being able to take a photo in the widescreen mode.  This only means that the camera has internal software to convert photos to a 16:9 mode--it has NOTHING to do with the ability for the camera to take a wide angle photo.  Some reviewers get very mixed up with this.If you are looking to buy a videocamera, then BUY a video camera.  In the same vein of thinking, both Panasonic and Canon make video cameras with built-in wide angle lenses.  Unfortunately, the Panasonic models take grainy photos.  The Canon model is the FS100. I will review that one later in a separate review.Also, Polaroid has just come out with a 32GB SD card, and I expect other companies will follow. This is not a true HD camera and does not have a hard drive.  If you buy one of those and want a wide angle lens also, it will most likely cost you about twice as much.  I could not justify that expense, but I can certainly understand why people would want a hard drive and HD. However, IMHO, the only thing that looks great in true 1080p HD are movies originally shot for iMAX, such as the last Batman movies.  Almost anything else will look just as good on 1080i with an upscanning DVD player.There are all things that people nt need to think about before investing in a camera.  Of course, in 2 to 3 years, this will all change, and technology will cost less.  However, I prefer to not spend so much money upfront, but others will see it differently.If you are running a low-margin business, you have to be careful not to spend too much, as there are always unexpected expenses.", "Date": "February 4, 2009"}, {"Title": "Nice Camera with Great Picture Quality", "Author": "Pranay Gadhawe \"Pranay\"", "ReviewID": "R2O6O2GH5HKACJ", "Overall": "4.0", "Content": "I purchased this camera 2 months back and i like the picture quality of the pictures taken from this ,battery is also good only drawback with this is it is a bit slow in processing.... rest it is really one of the best choices for high end zoom cameras.", "Date": "January 18, 2009"}, {"Title": "Great camera for the money.", "Author": "S. Stone", "ReviewID": "R7CQWHM8BXZO2", "Overall": "5.0", "Content": "I was so sick of my crappy, old digital, and my 35mm film camera.  I wanted something to take great pictures, that I had some control over.  After reading many reviews on several cameras and getting so confused by the contrasting viewpoints, I bought this one mainly because of the name.  Here's the skinny, I got it out of the box, took some pictures in my living room, and started thinking; maybe I screwed up and should have bought something else. Then I broke down and got out the manual. In short, the more I use it, the more I LOVE this camera. My advise is simple; If you intend to be a professional, or get paid, go ahead and shell out the money for a better camera. If photography is are more of a hobby, and you like taking pictures, this is a great camera. If you are not willing to learn, read, and experiment, then buy a more basic point and shoot.  This camera will take some awesome pics and it will take some crappy pics, depending on how you set it.", "Date": "January 9, 2009"}, {"Title": "I'm learning a lot!", "Author": "J. Nicolich \"fixadix\"", "ReviewID": "R1FD0EJU8BG023", "Overall": "5.0", "Content": "First, a word to the wise, watch where you get your camera from. I was scammed first time around. Go to [...] to check out the online store you are buying from first; that said....If you are like me and would like to own an SLR camera someday, then this is the transitional camera for you. I am uninformed when it comes to anything but the auto feature on a camera. The book that comes with the camera is so easy to learn from! I am already trying my hand at the manuel settings and getting amazing pictures. I bought this camera to get a bit artistic but also take bunches of photos os my kids and their sports. We've had so much fun playing with the sports feature. I had my son jump up and down and the camera took so many frames in such a short time. When reviewing the pictures in the camera, it looked like a flip book so now we are going to make some flip books using this camera.The zoom is really great as well. The only thing I don't like is that if you have pics on the cams memory and then insert a sd card, the pics in the cam will be deleted. Even my old simple one could copy the pics to the card. And I thought I read people say it did not have an attachment for the lens cap, but it does have one. Be careful the package is tiny so you may get it lost in the \"stuffing\". I did my homework extensively before buying this camera and for the money...by far the best you can get!!!!!", "Date": "January 9, 2009"}, {"Title": "Wow, a lot to learn ... but happy to do it", "Author": "Linda", "ReviewID": "R27NA94HPEY4Y4", "Overall": "4.0", "Content": "This camera is WAY more complicated than my last little 1.3 megapixel point-and-shoot was! Seems on every available surface there's a button or indicator or compartment, and they're not all that intuitive.As for my experience, I have zero training beyond the basics, but nonetheless I made enough selling photos from my last camera to pay for it and then some. This time around I'd like to do the same or better. I can compose a decent picture, but don't ask me about f-stops or ISO settings. I'm trying to learn, though.My first outing I made the mistake of going to Dog Beach. I hadn't read too much of the manual beyond inserting the battery and attaching the strap, so this was basically point and shoot with auto settings.Trying a new camera on fast-moving, unpredictable animals was a mistake. I got a lot of snout or butt as they moved out of the frame (there is a significant delay after pressing the button). My second outing I went to a glider port late in the day, still without reading the manual.I got a little frustrated at times, pressing something I shouldn't have and then trying to get out of it, for example, but that's really my own fault. After deleting a pic, I couldn't figure out how to go back to shooting, so after pressing every possible button, I just stopped deleting them and figured I'd do it later. (I think I figured it out now, though.) When I tried dealing with all the menus and settings, it was hard for me to be ready when a good shot presents itself.I found it took very nice pics that definitely were a step up from my last camera. With a little \"contrast masking\" in photoshop, they look good! I got some noise, but I'm hoping to learn more about how to control it or at least to reduce it in photoshop. It seems every \"fix\" just introduces new problems.Since I'm trying to take my photography to the next level, I probably should have gotten a camera that outputs \"raw.\" I didn't realize this camera only outputs jpg. Still, it was a fabulous price for an intermediate camera. Just make sure you read the manual!", "Date": "December 24, 2008"}, {"Title": "Another positive for P80", "Author": "SpeedoNJ \"Len\"", "ReviewID": "R23QJCD13PBO40", "Overall": "5.0", "Content": "I can't believe I haven't reviewed this earlier since I now have had it for 4 months.  It was my first \"real\" digital and the one that gets used the most.Many reviewers have said that you need to read the manual, and i n this case even Ido it. You can find many things you can make this puppy do, (like B&W;).  I don't know if it's my imagination  but when I put the card into the computer with Vista, then replay them through Picasa, the latter look 50% better.  Could it be like the old \"worst phot processing in  town ala 35mm)?Set this up during a rainy day on vacation (bummer) so I'm more in  tune with it than any of my other purchases.Will reveal my ignorance, but can't decide on a #1 among similar grade from Panasonic (sharpness, but color seems off) or Sony (no complaints) Just don't like Canon-some are great, most a lot of blur and funky color.So I draw no professional opinion other than that I'm very happy with this camera and with digital photography in general for the instant gratification.  Also think thta you could help any cause with a class 6 8GB memory card if the camera will take it.Someone said the battery recharge doesn't last long enough- have gone 500+ then charged because I felt guilty.", "Date": "November 24, 2008"}, {"Title": "Lightweight and great for nature pictures", "Author": "S. A. Guerra", "ReviewID": "R232DHRVA2OOVL", "Overall": "5.0", "Content": "I bought this camera to carry in my backpack for nature photos instead of carrying one of my DSLR's.  I just downloaded some pictures I took this weekend and was very pleased with the quality of the picutres of some quail and deer I photographed.  My only complaint is that the viewfinder could be a little brighter.  Sutter lag isn't bad.  I think I am going to love this little camera.", "Date": "November 9, 2008"}, {"Title": "This is a great camera if you know what you're doing", "Author": "Jason R. Johnson \"Smart Shopper\"", "ReviewID": "R1W4Y1WS3HOCFP", "Overall": "5.0", "Content": "Like all the other reviews, if you read the manual and actually try to learn how to use this camera, then it is great. If you don't know what you're doing and are not willing to learn. Then you are going to be one of the negative review writers on here. It is as simple as that.I had a pretty high level knowledge of cameras going into this purchase but I still found myself doing quite a bit of reading to get the hang of all the settings to make the photos come out just right.I absolutely recommend this camera to people who are very serious about their photos and don't just want a point and shoot camera. But this is also not for highly advanced users who would be better off with a DSLR and different lenses. This is the in between camera for people who call them selves amateur photographers but are too broke to buy a DSLR.One more comment about Nikon products in general. They are built to last, if something breaks it is probably a fluke, check your camera over when you get it and you should feel that it is built tough. My last Nikon was run over by a car after being dropped from my moving vehicle. It was still in one piece and looked in such good condition that I thought it would turn on. It did not, but it held up so well to that kind of extreme. I was able to pop out the memory card and battery for use in this new camera. This was an older version of the P series you are looking at on this page too.", "Date": "October 3, 2008"}, {"Title": "Good camera , prosumer I would say", "Author": "Silent Reviewer \"Biswajit Jena\"", "ReviewID": "R3LXSAJ8LYH9V0", "Overall": "5.0", "Content": "I always waned a point and shoot with good zoom and good mega pixels. I did not want to buy a SLR and also wanted to take good pictures. After buying this one, I took this to Universal studios, San diego and other trours we made with our family. I would say great pictures.This camera is a little bit slow in starting up. Also a little bulky. But it is meant to be as it holds a big zoom lens. But its great camera for the price.", "Date": "September 20, 2008"}, {"Title": "zoom zoom", "Author": "Kelly L. Eydgahi \"Kelly E\"", "ReviewID": "RSNLRKIURB1HY", "Overall": "4.0", "Content": "Love this camera, and can't really think of any downer, except that I sometimes have trouble with widing a shot back to normal in video mode once it has been zoomed in.  As far as the awesome pictures it takes...you can be hundreds of feet away and look like your standing right there.  Just came back from CA & I got some SWEET pictures.  Still experimenting, but absolutely love the camera and feel it's WELL worth the price!", "Date": "September 7, 2008"}, {"Title": "Great zoom, great pics, slow startup", "Author": "Amy L. Dangelantonio", "ReviewID": "R32QPPR9I32AVM", "Overall": "4.0", "Content": "The vr on the camera takes clear pics when zoomed all the way out even when your not holding it completely still.It can be sluggish to start up when I try to take a pic in a hurry.  I love the camera and would recommend it", "Date": "July 20, 2008"}, {"Title": "All noise, all the time", "Author": "chas", "ReviewID": "R22XBZSN5MSBZU", "Overall": "2.0", "Content": "I got tired of waiting for Canon to come out with a new superzoom, and decided to buy a P80 instead. Unfortunately, the P80 operation can be frustratingly slow and the pictures are noisy. When fixing the auto ISO to a range of 64-100 the pictures are still noisy. Even when fixing the ISO to 64 I regard the pictures as noisy compared to the results I can get with a Canon. Comparisons to pictures taken at the same time of the same subject with a P80 and a Canon SX100 show clean looking shots on the Canon and speckled noise in the clear areas (like the sky) on the Nikon P80 images when viewed at 100% in Picasa, for example.The P80 also appears to be very sensitive to electrical fields. When shooting near an AC distribution transformer (those green boxes you see in suburbs with buried power) the P80's computer went nuts, the colors in the viewfinder shifted to yellow and green only, and the camera couldn't even be powered off. Resetting the camera by removing and replacing the battery brought it back to life. A day later at the same site I had the same issue, only this time the camera would shut down after taking one shot. It took a reset to get the camera to work properly again. I haven't had these problems with the P80 at any other locations. At the same location my wife's Canon SX100 had no problems.The P80 lens has a nice wide angle and good range, which is the main reason I bought the camera. The P80 also has pretty good anti-shake performance, but it has very slow operation when using the viewfinder, lots of image noise and apparently is quite sensitive to electromagnetic fields. I would not buy this camera again. Next time I will wait until Canon comes out with a new model.", "Date": "October 19, 2008"}, {"Title": "Nikon P80", "Author": "nikon user", "ReviewID": "R2BTE5LGNGSWYD", "Overall": "1.0", "Content": "The Nikon P80 picture quality was very disappointing to me.  The images contain a lot of noise.  Even in daylight conditions.  The zoom lens is great.  If Nikon could integrate the image quality of the D80 into the P80, they would have a GREAT camera.  Otherwise, I think that Nikon should recall the P80 and scrape their name off the case.  The P80 is not worthy of sporting the Nikon brand name.", "Date": "January 6, 2009"}, {"Title": "georay", "Author": "georay \"cameraguru\"", "ReviewID": "R3LUT6YHZRR1JI", "Overall": "4.0", "Content": "agreat little camera the sharpest one i have tried on my hd screen computer and hd tv; it is the closest to my nikon d300 as for as sharpness, but------------ i was outside in the sun taking bird pic AND THE ZOOM LOCKED UP i had to put camera in the shade turning off an on several times before the lense would retract.  THANKS AMAZON FOR YOUR 30 DAY MBG", "Date": "June 7, 2008"}, {"Title": "Serious hardware problem faced", "Author": "Jaya", "ReviewID": "R1DT0CTTBZ2PRJ", "Overall": "1.0", "Content": "http://www.amazon.com/gp/product/B00176BDD4/ref=cm_cr_rev_prod_titleNikon P80 worked wonderfully for about a month. Then I found the image at minimum zoom had a black ring on the left side of the screen. This disappeared on zooming.Got it repaired, there was some problem with the lens assembly, I was told. But now the camera is not the same as a new one in its feel.As I bought the camera in US and am in India now, couldn't get any free service or replacement due to some international warranty issues, I was told by Nikon India office in Mumbai; had to pay a hefty sum for the repairs. Was thoroughly disappointed with the experience.", "Date": "October 3, 2008"}, {"Title": "Only the Zoom and the brand name is good...", "Author": "Nikesh V. Sudha \"Nike\"", "ReviewID": "R2VF7PSEIVFV94", "Overall": "2.0", "Content": "Before I bought this cam, I was about to buy the Lumix FZ18... this cam was released just before I bought the Lumix, so I took a risk, and went for this one... but was really dissapointed with the confidence I had in Nikon. Other than the 18X zoom and manual focus, i dint find anything impressive at all in this cam.. I took this cam on a trip and found that the zoom was amazing, but with blackening of the edges at full zoom. The shutter lag was also tad too much. The major dissapointment for me was the sensor quality, unless in good lighting conditions, the pics were far too grainy and noisy for me. Macro capabilities were good, barring the grainyness of the images in low light. So I had to return the cam, after 2 weeks of trials. I have hence bought a Nikon D60, with which I am far more happy, but a lot more empty in the pockets ! :D", "Date": "June 15, 2008"}, {"Title": "Nikon Coolpix P80 camera review", "Author": "Joyce Johnson \"Panda\"", "ReviewID": "R3PRLFIHZN9OVM", "Overall": "3.0", "Content": "I recently purchased a Nikon Coolpix P80 camera from Amazon after doing extensive research on all of the current \"prosumer\" cameras on the market.  It had a wide zoom range was compact, sufficient megapixel count and the backing of Nikon.  It has proven to do a good job with one exception.  There are no provisions for using any lens accessories; i.e screw-in filters, lens hood, cap.  The front of the lens is not threaded.  I have searched for push-on accessories, especially a lens hood and found nothing.  This is unheard of and really a serious omission.", "Date": "August 30, 2008"}, {"Title": "Looking for a camera to capture small children in action?", "Author": "Norman S. Nichols \"nichols\"", "ReviewID": "R260J1NHLQBKIO", "Overall": "2.0", "Content": "If you are an amateur photographer and want to be able to snap pictures quickly on auto mode and have a better zoom than a point and shoot...DO NOT buy this camera...It is very slow writing to the card, regardless of card speed...The Kodak Z series cameras are much faster even with a cheap card...This camera takes great pics but you best not be in hurry.", "Date": "January 20, 2009"}, {"Title": "P80 image stabilization motor failing after 3 months", "Author": "Mr. Matthew Boxberger \"Matt B\"", "ReviewID": "RDNITXQ0641Z6", "Overall": "2.0", "Content": "I bought the camera mainly for the wide angle lens and image stabilization.  Both worked well for the first couple months, but now the image stabilization motors are apparently failing - lots of buzzing, the picture jumps around in the view finder, and eventually they pull the lens all the way to one corner or side, and I have a crescent shaped black image on one or two edges of my photos.Look like I've got to dive into the warranty repair process - what a headache. :{A minor quibble is that it won't mount as an external drive in Windows XP - you're foced to use the 'get photos' wizard which takes a much longer time to pull the photos off.", "Date": "January 14, 2009"}, {"Title": "Good performance, but don't expect like DSLR", "Author": "Jae H. Yoon", "ReviewID": "R1WJC5HV7PEN9E", "Overall": "4.0", "Content": "It's overall good digital camera. I sold my D80 & Nikon 18-200 VR and got this. It has 18x zoom, which is great(about 480mm in 35mm camera).I love its custom white balance feature. Also, with its 'Vivid' feature, it's got nice contrast in pics.Manual features are little bit uncomfortable, I think it's becuz I used to use DSLR. But it's okay.Flash isn't bad. It's not like the one from those cheap camera. It actually works well enough that I wanna use it indoor. (I used to use SB800 though.)There's one BIG con about this product I think.Which is, the NOISE from ISO!..I know it's nonsense to compare with D80 for noise reduction, but....From ISO200, you can see a lot of noise in the picture. Even from ISO100, if you zoom in black color in pic, you can see noises. So, you might wanna stick to ISO64 and use flash, or get some noise.The size of P80 isn't that big, and not heavy. There's lens cap you can attach from strap so you don't lose.Overall, I think it's great point&shoot; camera that looks like DSLR but not as good as DSLR.(but price wise, P80 is the best)", "Date": "October 18, 2008"}, {"Title": "camera", "Author": "A. Sampley \"murphydogpaws\"", "ReviewID": "R1OMET88OC9UL7", "Overall": "5.0", "Content": "I've had this camera for a long time now and it has proven to be very good no complaints here", "Date": "December 9, 2013"}, {"Title": "The exact camera I was looking for", "Author": "JohnnyRocket", "ReviewID": "R3UH4U1EATJIQF", "Overall": "5.0", "Content": "This camera looks exactly like the one I needed to replace. I haven't used it yet. Happy with it nonetheless", "Date": "November 2, 2013"}, {"Title": "Love it!", "Author": "Jenn", "ReviewID": "R1KNJTCKNGVUZB", "Overall": "5.0", "Content": "Love this camera, great shots, much shorter delay, which is great when you have a toddler! Very happy with my purchase!", "Date": "May 13, 2013"}, {"Title": "You can't go wrong", "Author": "Larry E. Lowery", "ReviewID": "RAE158VA6L4FU", "Overall": "5.0", "Content": "Everything I expected and more.  You can't go wrong with a Nikon camera.  Easy to use for professional quality shots", "Date": "February 25, 2013"}, {"Title": "Nice camera", "Author": "S ks \"S ks\"", "ReviewID": "R1OL0ZWT4228CR", "Overall": "4.0", "Content": "I bought this one too long ago about 2009 as a gift and reviewing now.My friend is still using this camera. Now there are so many good cameras with less price and higher resolution.", "Date": "February 20, 2013"}, {"Title": "Great gift", "Author": "Bob", "ReviewID": "R2TA1DN8A25ZX", "Overall": "4.0", "Content": "This was a gift to my wife and she loves it. She said it is easy to master. Picks up available light fairly well.", "Date": "June 9, 2011"}, {"Title": "A great camera for some who appreciates photography.", "Author": "nicoforeverm31", "ReviewID": "R85S8VBKM1YTW", "Overall": "5.0", "Content": "I have been very satisfied with this product. The picture quality is simply wonderful at ISO settings at 400 and below. I have recommended this camera and Nikon to many friends, and i anticipate to use Nikon cameras in the future. Easy to use, takes great pictures. This is what I know about this camera after using it for a few months now. The P90 and P100 seem to be improvements on this good design.", "Date": "November 3, 2010"}, {"Title": "I love this thig", "Author": "Kenny", "ReviewID": "R2AES4HMRRP0CB", "Overall": "5.0", "Content": "I have owned this camera for a while, and although setting your preferences isn't the easiest, once it is set, the photo out come is great, professional quality. I use this camera for all my photography shots that I intent to use professionally. Whether it's at a wedding or putting shots together for a web site. This thing is one of the best in it's price range!", "Date": "October 16, 2010"}, {"Title": "A Great DSLR Alternative", "Author": "NMITGuy", "ReviewID": "RB9F7TW7R0ICQ", "Overall": "5.0", "Content": "I've owned this camera for over a year now and have experienced NO problems with it whatsoever.  It is jam-packed with settings and options, programmable f/stop, ISO, etc..., battery life is good, picture quality is excellent!  I've taken some full-zoom shots of the full moon with this camera that came out stunning and really surprised me that I could get such great detail.  If you are in the market for a camera that offers a lot of features you would expect to find on an expensive Digital SLR camera, I suggest you take a look at this one.The only con's with this camera is that I would have loved a swiveling view screen, this would be handy.  Although this is a point and shoot camera, it is styled like a DSLR camera, which makes it a little less portable than your typical point and shoot.I take a lot of nature shots and this camera does a great job with closeups as well as distance shots.  I've also filmed some hockey games with this and the sport mode does a great job of capturing the action and shooting in video mode is great too.I would not hesitate to recommend this camera to anyone seeking my opinion.", "Date": "April 30, 2010"}, {"Title": "So frustrated!", "Author": "Jennifer Jones", "ReviewID": "R2WQLMLPDAOVEN", "Overall": "3.0", "Content": "I have had to send this camera back to Nikon two times. At first I loved it, then it started giving me problems focusing. Even outside, I understand that some camera's just don't work as good indoors, or in low light. But when it started giving me problems outside, I sent it back. When I got it back, it has worked ok. But it has recently started giving me problems again. Also, my pictures started coming out really blurry, and/or grainy.Something is up with my aperture setting as well...while it worked fine at first, I noticed alot of my pics are turning out green! I am a beginning photographer, so I don't know everything there is to know. But this camera has been so frustrating. I loved the zoom, and the compactness. And, I have gotten some really good pictures with it. However, I don't think I'll be getting a Nikon again.", "Date": "April 5, 2010"}, {"Title": "great beginner to avid enthusiast", "Author": "Paul Valencia", "ReviewID": "R1OCJGUNRMJVAT", "Overall": "5.0", "Content": "great for indoor/ outdoor use very inexspensive for the quality of pictures. a little slow at taking pictures but :( butt all in all a good camera for under 300", "Date": "January 23, 2010"}, {"Title": "Love it!", "Author": "Cyirra", "ReviewID": "R22T3SZEV53JW0", "Overall": "4.0", "Content": "I have had this camera for about a year and have taken more than 3000 shots with it. The only thing that I have trouble with is when useing for close up work it does not always want to focus, but if you zoom out then back in you can usually get it to focus on what you want. The file sizes are large enough that you can crop and still keep it at a large enough size to get nice sized prints (4x6, 5x9, never tried getting 8x10's). Awesome for those that enjoy taking photos, may not satisfy those that are looking to sell. I have never been disappointed with image quality. I bought a Canon Rebel XSI (SLR) to replace it but when I used it I was VERY disappointed in what I got and went back to my Nikon.--I am adding to this review, years later now.  I still use this camera heavily and am still loving it! I may upgrade to something with more zoom in a few years but as long as this one keeps meeting my expectations I will not be changing.  Sure the focusing can be finiky but I think it is still worth every penny.  I have probably shot over 10,000 pictures with this camera!", "Date": "January 10, 2010"}, {"Title": "Everything I wanted.", "Author": "Kathryn M. Vanveen", "ReviewID": "R2CIHIFZ5QLXGD", "Overall": "5.0", "Content": "I was forced by a poor timing situation to buy a lower level camera for school.  For fun I kept researching after class started and found out this was what I wanted.  I've been waiting for eight months and I finally bought it.  I Love It!", "Date": "December 28, 2009"}, {"Title": "I love this camera!", "Author": "M. Adams \"TeachersCanDo!\"", "ReviewID": "R19JPDJM5842CV", "Overall": "5.0", "Content": "I'm definitely a novice.  There's a lot I need to learn in order to be able to take better photos, but this camera is easy to use.  I can take pretty good pictures with it...just pointing and shooting.  I haven't learned a lot about the settings yet, but I'm sure that when I do, my photos will be even better!  So far, I have captured some really great photos of my kids and of the mountain scenery here where I live!  The camera is fun to use, and I figure I will just keep experimenting with it to see what works for me!  I cannot believe Nikon has discontinued this camera!  The Nikon Coolpix P80 is easily portable.  I carry it in a large padded camera bag that will hold other accessories and other \"non-camera\" things that I need to carry with me.  It could easily be carried in a much smaller bag with all the things that you need just for the camera...extra batteries, extra memory cards, etc.  It's very light weight and easy to use.  It's the kind of camera that makes a novice want to learn more about taking really good photos!", "Date": "November 2, 2009"}, {"Title": "excellent", "Author": "M. Cajulao", "ReviewID": "R1WCGO1GF0TFCT", "Overall": "5.0", "Content": "this is an excellent camera. it is everything that i expected it to be and more. i am very pleased with this purchase", "Date": "March 26, 2009"}, {"Title": "Love it!", "Author": "Dawn Lindamood", "ReviewID": "R1NWHU2UBILCCT", "Overall": "5.0", "Content": "This is a great camera! Not too bulky, and I can get those far away shots!", "Date": "February 24, 2009"}, {"Title": "I am extremely happy", "Author": "John Lancelot", "ReviewID": "RE4A9PJ22O6U3", "Overall": "5.0", "Content": "This is my first camera with so much functions. so far all my previous cameras were point and shoot. I like this camera for it's ease of use and the image quality.I don't want to blame the camera for bad quality for my operational skills. I am still learning how to use this one and so far i am so exited.Please get with with additional memory and battery for long time operation.I will update soon as i go mastering this camera.", "Date": "February 9, 2009"}, {"Title": "best i've had.", "Author": "mark twain \"marktwain\"", "ReviewID": "R2A3W078KZ5NQ4", "Overall": "5.0", "Content": "this camera is the best i've had. even my mom says she's goin to steal it from me. =]. and all my friends talk about how they wish they had one. if your an ameture photographer, this is the camera for you. it takes great quality pictures, and it's at a great price. =].", "Date": "February 3, 2009"}, {"Title": "Perfect for the Average Camera User", "Author": "KGL", "ReviewID": "R1PH9ACKG85TH3", "Overall": "5.0", "Content": "Sooo I was afraid to buy this camera becuase all the reviews made it seem like you had to be some camera pro to use it....but I bought it anyways and am sooo glad I did!  I am the average camera user, love taking pictures and wanted a digital camera that was nicer than norm.  There are tons of features that I don't quite understand yet (I have only had it for 2 days)but I took it to the beach yesterday evening to take some test shots and they came out great!  You can use it as a point and shoot and the picture is great, if you are willing to spend some time and effort into learning all the different features, your pictures will be even better!  The 18x zoom is amazing, just have to have a steady hand!  I think if you like to take pictures and are willing to mess around with the settings and want a camera a step above the normal point and shoot, this camera is perfect (especially at this price).  Yes the lens cap is kind of cheap but the camera is worth it!", "Date": "January 30, 2009"}, {"Title": "LOVE IT NIKON P80", "Author": "lala \"lala\"", "ReviewID": "R25OF3827K69SW", "Overall": "5.0", "Content": "I received my camera, charged the battery, was charged in two hours just like it states, and was using the camera within seconds.  It is so easy to use, pictures are great, zoom is awesome!  I love my new camera!!!", "Date": "January 29, 2009"}, {"Title": "Nikon P80", "Author": "Boydaki \"Manny\"", "ReviewID": "R2U79JL01MUG3I", "Overall": "4.0", "Content": "Very satisfied with my Nikon P80. Used it in a birthday party and took 281 plus pictures and 72 pictures in a ballroom dancing. Satisfied with the pictures. Some were blurred because of subject movements but those are expected with digital cameras. Color is excellent. Did have some red eyes. Difficult to focus if telephoto is used. Overall rating is very good. Cute camera and design is nice with rubberized right hand grip. Frequent mistake is to turn the camera on with the lens cap attached. Will be corrected with frequent usage.  There are many features that I still need to explore.", "Date": "January 28, 2009"}, {"Title": "A lot for the money", "Author": "Breanna \"grandma 1\"", "ReviewID": "R2NDCSDPG3GU94", "Overall": "4.0", "Content": "This camera has a lot of wonderful features but unfortunately, it is over my head and I'll never use half of them. I think it will be great though to take along on our next vacation.  The zoom lens is phenomenal and the sports continuance picture taking is great when you have small active kids who never stay still for more than 2 seconds.  LCD screen is very bright and easy to see.  It does well in low light.", "Date": "January 28, 2009"}, {"Title": "my 4th nikon", "Author": "geemariee", "ReviewID": "R1I46Q31621QCP", "Overall": "5.0", "Content": "My grandfather had a nikon when I was still too little to hold the camera.. my first, second, and third cameras were nikons but this? is by far the best.  I'm very into my photography and this camera just fits perfectly into my hands, its easy to use and the quality of the pictures is just incredible.  I wanted the D80 but unfortunately couldn't afford it.  If anyone has that same problem, I would absolutely recommend this camera as a more affordable choice.  I actually took a clear, up-close shot of a full moon. Who knew?!", "Date": "January 28, 2009"}, {"Title": "P80", "Author": "venice96 \"venice96\"", "ReviewID": "RTEB6QJIJKPE0", "Overall": "5.0", "Content": "very happy with this product not had time to really know what it can do as I have only had this for about 4 weeks,but the zoom is great and the ease of use is good pictures of fire work display is very good no blurs every thing nice and clean", "Date": "January 24, 2009"}, {"Title": "Wonderful Camera!", "Author": "It's just me \"Vikki\"", "ReviewID": "RZXOB9DEC9J6S", "Overall": "5.0", "Content": "I did alot of research before purchasing this camera.  It is everything I wanted.  It is a point and shoot camera, but also a step below a dslr.  I have taken many pictures with it and it does a fantastic job.  I joined a Nikon P80 club and have learned so many helpful things.  The 18 X Zoom is great!  I love the panoramic pictures I can take too.  Amazon was definitely the place to buy this camera, it was alot cheaper than the other places plus I trust Amazon.", "Date": "January 23, 2009"}, {"Title": "Great camera for those who want a little more control than a point and shoot", "Author": "Valerie Gaffney", "ReviewID": "R2TXSUFYN2MN1D", "Overall": "5.0", "Content": "Bought this for my boyfriend who has been jealous of my professional SLR camera for years.  He wanted something that he could be a bit more craetive with, while at the same time having the option to just use it as a point and shoot.  Camera comes with a very nice, large, viewing screen.  The Viewfinder isn't what you would expect.  When looking through it you see a mini digital screen, which is pretty neat.No complaints.  Best feature: Turns on and off VERY fast.  Great for when you don't want to miss a moment :)Ps. I suggest getting a second battery for the camera.  If you use it like my boyfriend does, then you're going to go through the batteries life pretty quickly.  He has to charge it a lot.", "Date": "January 19, 2009"}, {"Title": "Nikon P80 Delivers", "Author": "SusieC", "ReviewID": "R1HR2QTS2QK56N", "Overall": "5.0", "Content": "Very happy so far with my Nikon P80. Zoom is fantastic. Takes great photo's. Easy to use. Only feature I would change is making the flash pop up automatic versus doing it yourself, but I'm used to it already and enjoying the camera. Can't wait to take it on vacation. Excellent value for the price compared to others.", "Date": "January 18, 2009"}, {"Title": "Nice Camera", "Author": "John H. Mcdermott, Jr. \"mic mac\"", "ReviewID": "R2LO7C7ES2WKAS", "Overall": "4.0", "Content": "I would have given this camera a 5 star, but there is a learning curve that not everyone wants to do. Very sharp pictures. Battery life could be better. I would recommend buying another battery if you shoot a lot of pictures. I would recommend this camera.", "Date": "January 17, 2009"}, {"Title": "A Low Budget Beginner's All-Purpose Camera", "Author": "Penetralia", "ReviewID": "RM0ST9QYTUMD0", "Overall": "4.0", "Content": "The Nikon Coolpix P80 10.1MP Digital Camera with 18x Wide Angle Optical Vibration Reduction Zoom (Black) is a great model for a beginner or person on a low end budget.This camera features:* 10 Megapixels and Video Camera functioning* 18x optical wide-angle Zoom-Nikkor lens with VR image stabilization* 2.7-inch HR LCD* In-Camera Red-Eye Fix, Face Priority AF, D-Lighting, and moreThis all-in-one beauty is highly recommended for any tyro; however, the Canon G10 would be most beneficial for intermediate to advanced users.", "Date": "January 15, 2009"}, {"Title": "Wonderful photographies", "Author": "Federico Sánchez \"Frederick\"", "ReviewID": "R33CL3PKG5CZBQ", "Overall": "5.0", "Content": "Wonderful photographies, with the Nikon COOLPIX P80, 18X Manual zoom,internal memory of 50MB", "Date": "January 13, 2009"}, {"Title": "Nikon coolpix P80", "Author": "Jonnie Myers", "ReviewID": "R1UZI61CDBFS1G", "Overall": "5.0", "Content": "This camera is great!  I am still learning all the features of the camera and I am having fun with it.  I have not used the video function.  The photos are amazing compared to my last camera.  I have recommended this camera to everyone I know.", "Date": "January 13, 2009"}, {"Title": "Happy", "Author": "Penny  Guinn", "ReviewID": "R1GW1IG3DNSM2E", "Overall": "5.0", "Content": "The camera was shipped in an efficient, rapid manner. Everything was received as described. I am very happy with the service.", "Date": "January 13, 2009"}, {"Title": "New Coolpix Camera", "Author": "William Joseph Diett", "ReviewID": "R21TB6ATC713LM", "Overall": "5.0", "Content": "Our new camera is more than we expected. It is small enough to care comfortably, yet does everything a much more expensive camera does. We are very happy with our purchase.", "Date": "January 12, 2009"}, {"Title": "The perfect choice for me", "Author": "Kathleen Leary", "ReviewID": "R15T6HF90F25DN", "Overall": "5.0", "Content": "Haven't had the chance to use it yet but am very excited to learn...the camera definately met my expectations.", "Date": "January 11, 2009"}, {"Title": "Great price for a great camera", "Author": "T. W. Peterson", "ReviewID": "R2XZUOIBG7BZDO", "Overall": "4.0", "Content": "I think this is camera does a good job of making a rookie photographer(like myself) feel like they know what they're doing. Easy to use, great pictures. I'd recommend it to anyone.", "Date": "January 9, 2009"}, {"Title": "I LOVE this camera!", "Author": "Erin C. Silva", "ReviewID": "R1KN2XHK45RSVG", "Overall": "5.0", "Content": "First I will say that I am a recreational picture taker. I am by no means into photography or an experienced camera user. I am a Mom who takes millions of pictures of my family and pets and our vacations.I purchased this camera for our Xmas trip and I cannot say enough wonderful things about it. There are tons of settings, many of which I am still learning to use. I took tons and tons of pictures experimenting with many different settings before our trip to be sure I took clear pictures.I am still learning to how use some of the settings. I play with the camera constantly to learn. Last night I learned how to take black and white photos which came out amazing. And I am still working on apiture (sp?) etc.All of my photos came out amazing on our trip with the exception of some at dusk and it was simply due to the fact that I didn't know what setting to use. Some I got right, some were dark.But the quality of my pictures is amazing.The battery life is amazing. I charged it before our week long trip and I took a few hundred pics over that week and never had to charge it once.I am very happy with my purchase and I can't wait to learn more about how to use it.", "Date": "January 7, 2009"}, {"Title": "Nikon P80", "Author": "Marshall Goldman \"motorman\"", "ReviewID": "R22FFCR5VEGVV", "Overall": "5.0", "Content": "Have had this for less than a month. So far great pictures and easy to use. Per usual, instruction manual leaves out some important things and sometimes steps to perform tasks. All in all very happy so far.", "Date": "January 7, 2009"}, {"Title": "Smart Camera with Amazing Results", "Author": "Zain Abbas Naqvi \"Zain A. Naqvi\"", "ReviewID": "R2FXPAOG39CBTZ", "Overall": "5.0", "Content": "From a Kodak 5.0 MP to Casio Exilim 8.1 MP, followed by a Nikon 5100 12.1 MP, i bought this Nikon P80 .. and i found P80 the best amongst this lot.  In a limited budget i.e. less than 300 US$ i would say that this Camera is the Best !!! Especially 18x zoom & wide angles. More over the different modes it had for shooting like night mode, museum mode, landscape, portrait, backlight etc it makes easy for the beginners like me to take some good pictures.Its vibration control is pretty effective, despite of many shaky attempts by me, this camera has rarely produced a blur picture.With given price ( i bought it for US$ 271) , Brand Nikon , 18 X, Wide angle, Many Modes, Editing n Cropping Options, Hybrid Digital SLR i would give this camera 5 stars & its a HOT BUY for less than 300 US$ !!!", "Date": "January 7, 2009"}, {"Title": "beginner amateur review", "Author": "E. Lowry", "ReviewID": "R6EW215S8V6XY", "Overall": "4.0", "Content": "I bought this camera to hone my skills before buying a full dslr camera. It is a good camera. It is  a little complicated at first mainly because I'm just a beginner learing how to use the aperture and film speed settings to the best advantage. I expected a little clearer photos but I am changing the focus mode to a more clear photo and it is working. I used the black and whie setting which is cool. I have not figured out how to use the sports cont mode. It is light and easy to carry.", "Date": "January 7, 2009"}, {"Title": "awsome Nikon P80", "Author": "James Howard", "ReviewID": "RBK8IW5FIXH83", "Overall": "5.0", "Content": "The P80 is exactly what I have been looking for..It has excellent focusing zoom and vibration reduction for my old hands with a view finder I use instead of the viewing screen. I don't like to focus on a subject using the screen.The P80 is so good that I feel I will never need another camera, and I have only scratched the surface of what it can do...Amazon.co, thank you for being there.  I shopped price on the internet and found scammers with most of the low priced cameras and was relieved to find you, a honest company, offering an excellent price. It is a pleasure dealing with you.thanks again,  james howard", "Date": "January 6, 2009"}, {"Title": "Coolest Christmas present ever", "Author": "Ezrider", "ReviewID": "RMXOZB4RL8LW1", "Overall": "5.0", "Content": "Got this for my adult daughter who is in love with it.  even without reading the how to use she is whizing through the different settings with ease. User Friendly & beautiful pictures the zoom is amazing...she's only had it a week & some so I haven't gotten printed pics yet but their coming! Will write more detail later", "Date": "January 6, 2009"}, {"Title": "Nikon p80", "Author": "David J. Vandenberghe", "ReviewID": "RJFD7V5A0MXQ3", "Overall": "5.0", "Content": "Item was as advertised, brand new and works perfectly.  Very happy with this purchase.", "Date": "January 6, 2009"}, {"Title": "Excellent Camera for Advanced Point-and-Shoot Cameras", "Author": "Joegie V. Gelladuga \"blue_omega_rush\"", "ReviewID": "R1BEMHW6O5FV1Q", "Overall": "5.0", "Content": "I bought this camera for personal use and it is totally excellent. Fast response, best picture quality, high ISO, excellent burst shots, and long battery operating time performance. Highly recommended.", "Date": "January 4, 2009"}, {"Title": "GREAT CAMERA", "Author": "Lily Ann Plumb", "ReviewID": "R37QV5W8ZV0ZCL", "Overall": "5.0", "Content": "I just received this Jan 2 and I have never used a digital camera and this one was picked for me by my daughter. I LOVE IT!!! It really is easy to use for beginners. The quality is GREAT!! If you are sitting on the fence about buying this: BUY IT YOU WILL BE HAPPY YOU DID!", "Date": "January 3, 2009"}, {"Title": "Great Camera", "Author": "Zhuoshi Xie", "ReviewID": "R2KUEQNDJK9OT9", "Overall": "5.0", "Content": "I used to use a Kodak EasyShare CX4230 2MP Digital Camera with 3x Optical Zoom camera (a true POINT and SHOOT), and just upgraded to this. For me, this camera is excellent. It gives me all the control I need.Contrary to what some other users have said, it doesn't require carefully reading the handbook to get how to use it. You might have to skim the instructions for which controls what, but other than that, the camera's display is pretty self explanatory.People have said it's slow, but I don't find it that much slower than other cameras I've tried, and certainly much better than my old one.Like all other cameras, it can take bad photos and can take good photos. I find that it tends to take better photos in manual modes, when you KNOW what you're doing. So if you want to get this camera, and take stunning photos, take a little time to learn the basics of photography.", "Date": "December 31, 2008"}, {"Title": "Good camera,", "Author": "M. Rice \"Rysmomma\"", "ReviewID": "R5D23CC31VA4D", "Overall": "4.0", "Content": "I love my camera, there are so many setting that I have not let my manual get to far away from me yet. I am enjoying it greatly and as I learn to used the different setting I am getting great pictures!!", "Date": "December 5, 2008"}, {"Title": "Great Hybrid", "Author": "Torrey S. Moss", "ReviewID": "R17HBCTFI5EQG1", "Overall": "5.0", "Content": "Pros- Takes easy pics that look great.  Easy navigation.Cons- I guess if I had to pick one i would say that stupid lens cap, but overall not that big of an issue.I bought this camara for a trip to Tahiti for 5 weeks.  Easy to operate on all the presets which does a great job to just point and shoot.  Portrait shots are amazing.  Cool panaramic assistance.  Still playing around with some of the manual options but seems to be the perfect camera for me.  A perfect hybrid camera for the in-between DSLR and the point and shoot babies.", "Date": "October 24, 2008"}, {"Title": "nikon p80 excellent", "Author": "lab guy", "ReviewID": "R2DMT0X913QSU4", "Overall": "5.0", "Content": "Recently purchased the Nikon P80. We've only taken 10-15 pictures so far but the camera works and functions well above our expectations. I honestly do not know how anyone could expect anything more for the money. We are completly satisified with the camera.", "Date": "October 18, 2008"}, {"Title": "Good Camery, but has learning curve", "Author": "Harshdeep Mehta", "ReviewID": "R2PGP52TEFLDYB", "Overall": "4.0", "Content": "Good Camera for SLR hungry people, photo quality, lenses, battery everything is good. But having bit learning curve, may be because first time i m handling such camera.", "Date": "October 18, 2008"}, {"Title": "I Love My Nikon P80", "Author": "Sports Scribe", "ReviewID": "R224RYGCYEPI9X", "Overall": "5.0", "Content": "When I was looking to upgrade from my old Kodak C-300 series, I did a bit of shopping around, but the choice was either a Nikon or Canon even though the old Kodak served me well and I am not getting rid of it. (It gave me beautiful pictures of a recent holiday, but I needed a bit more power and function).After looking around at the Olympus SP570, Kodak Z1285, Kodak Z812, the Canon S51S and the P80, I narrowed it down to the last two. I read some of the other reviews and I was a bit hesitant, but I decided on the latter and I have no regrets.My P80 has taken some absolutely fantastic shots once I read the manual and got the settings right. I changed the IS0 to 400 and use a fine quality. The closeups are clean and sharp and I have taken a few with the sports action setting.I am still learning how to use a lot of the stuff. One of the drawbacks is that it is very unstable when you crank it all the way up to 18x, but I doubt I will need to do that very often.I also bought the kit with the battery charger etc. and that has been great as well. But don't just take it from me. Try it for yourself!", "Date": "October 9, 2008"}, {"Title": "Good small camera", "Author": "Juan Roestel", "ReviewID": "RR1UHS0VCND4U", "Overall": "5.0", "Content": "I purchased the Coolpix for business pictures in my office. The camera offer good performace at a very affordable price. Highly recommended purchase if you are looking for a quality and easy to use camera.", "Date": "October 6, 2008"}, {"Title": "From a 7.1mp, 4x zoom to a 10.1mp, 18x zoom. WOW!", "Author": "E. Hoydic", "ReviewID": "R2DTXO7GF4H4L8", "Overall": "5.0", "Content": "I used to have an Olympus camera...just for my daily adventures. I thought it was great when I first bought it. I felt the desire to get a new, better, higher mp and higher optical zoom camera and WOW I'm glad I did. I'm taking pictures about a football field away that come out CLEAR! I'm taking pictures of things that my mom cannot view through her binoculars. This camera is awesome. I just got it today and haven't really played around with it, but for what I need it for, I'm quite satisfied.", "Date": "August 18, 2008"}, {"Title": "Good Camera", "Author": "Y. Yen", "ReviewID": "R3BOA0UAISIZ8D", "Overall": "4.0", "Content": "Really good camera. Great image quality and lens. Nice and quick customer service. Don't listen to those who say terrible service. Try it yourself.", "Date": "August 12, 2008"}, {"Title": "Just what I wanted", "Author": "A. Krueger \"busy writer\"", "ReviewID": "R285D82JMG7K8H", "Overall": "4.0", "Content": "I was looking for a point-and-shoot camera, but with more zoom than the inexpensive cameras offered. This camera was exactly what I wanted. It's easy to use, but I've been able to get a lot of distant shots I couldn't get before. I took it on a recent vacation, and all of my pictures came out sharp and clear. My only complaint is the pop-up flash seems kind of cheap. But overall, I'm very happy with it.", "Date": "July 7, 2008"}, {"Title": "No problem with the camera, but amazon's pricing disappoints", "Author": "Jan Gilbert", "ReviewID": "R1VWA006ZF5BH0", "Overall": "4.0", "Content": "I received the camera on the 6th, as promised, and am satisfied with it so far.  It does what I expected it to do: take good pictures for this decidedly non-pro camera bug.  While my shirtpocket Canon SD900 is a great little camera, I wanted the Nikon for the zoom mostly.  The size is a little large, but a carrying case will solve that.  Good hand fit.What I don't like is Amazon's pricing system.  Those of us who ordered early paid $400 for this puppy; those of us who waited a week can get it for $369.95. NEVER PRE-ORDER.  I feel somewhat ripped off, but I'm a big boy and have learned my lesson at a cost of only $30.  It won't happen again.", "Date": "May 12, 2008"}, {"Title": "Buena Camara, vale la pena.", "Author": "Gary Gutierrez Nunez", "ReviewID": "R1WM1CBE2KS2U8", "Overall": "5.0", "Content": "Soy un fanatico de la fotografia, pero no soy muy bueno con las camaras en el modo manual, asi que compre esta camara porque me gusto el zoom del lente y la cantidad de megapixeles. Tengo una semana con ella y en realidad he aprendido mucho con ella. La calidad de las fotografias haciendo enfoque selectivo con el reconocedor de la cara son excelentes, es impresionante. Otra cosa que me gusta mucho es el zoom, el cual puede enfocar a largas distancias sin perder resolucion o verse borrosas las imagenes. Creo que es una camara que vale la pena para aquellas personas que necesitan aprender de fotografia antes de saltar a una camara tipo SLR, asi si no te gusta no inviertes tanto dinero y puede ser utilizada por cualquier persona en tu familia. Lo unico que esperaba fuera un poco mejor era la calidad del video, pero al hacer unas tomas al aire libre es muy ruidoso el sonido por el viento y la calidad deja mucho que desear.A pesar de todo creo que  vale la pena.", "Date": "June 27, 2008"}, {"Title": "2 years of use", "Author": "Christina D Weidle", "ReviewID": "R9P0Q3G50VFFV", "Overall": "2.0", "Content": "At first I loved this camera, I loved the zoom and different features. About 8 months after I purchased it I dropped the camera about 2 feet, it was in the camera case and that was inside a quilted bag. The LCD fractured and so I sent it back to Nikon, it was not covered by warranty. I loved the camera so I put another $120.00 to have it repaired. It never seemed to be the same after that. The settings were altered and I constantly had a hard time focusing especially on faces or at night. I also noticed green streaks when I took pictures in the sun. I kept thinking it was something I was doing wrong and kept going back to the manual but it did not improve. About a month ago I bumped the camera on a wall while in its case again not very hard I was carrying it on my shoulder and it swung to the side and now it will not focus. I was going to send it back to Nikon after the first of the year but the camera was stolen, the week before Christmas. They got fooled. I am now looking for a new camera and will not purchase a Nikon. I have always loved Nikon cameras, this was the 6th Nikon camera I have bought, for myself and children. Two of my daughters cameras are also having trouble focusing, cool-pix S570. After reading the reviews it seems as others have also had problems with Nikon's function following a bump or a drop. They should be a little more durable than what I have experienced.", "Date": "December 31, 2010"}, {"Title": "Works best outside.", "Author": "VB", "ReviewID": "R1TZF1YJT1647I", "Overall": "3.0", "Content": "I have had this camera for about four months now. My initial impression was that this camera was extremely noisy in low light conditions. I attributed that to me not using the camera properly. But then after getting really comfortable with using it in manual mode for a few months, it looks to be even worse under low light situations. It does really well with outdoor shots of course, but when it comes to take quick pictures of my one and a half year old, my old 3.1MP Nikon 885, does a far better job both indoors and outdoors!", "Date": "November 9, 2008"}, {"Title": "Nikon P80 -Great travel camera", "Author": "Rod", "ReviewID": "R1YUMTN9O6FJQP", "Overall": "5.0", "Content": "I needed a camera for a last minute trip, I had been looking at the Nikon D90 but not sure I would be able to learn enough about it to shoot good pictures also didn't really want to spend the $1000 for the body and $600 for the lens I wanted (18 X 200mm) then found this point and shoot NikonP80 with 10MP and a 18X wide angle V.B. zoom . What a great camera out of the box shooting. Really didn't have time to learn to much so I kept it on auto and just shot. Very nice pictures and the few that were off I've seen now how to adjust for them. You have a scene mode that gives you plenty of options, and if you know how to go manual you can fine tune all you want. I found a deal at $335. no tax and free shipping from Amazon. Battery life is great .I bought another battery just in case but didn't need it. I took about 300 pictures. very compact and nice to carry around, all in one , no need for other lenses with this wide angle and a great zoom it's all you need. The vibration reduction worked great on the zoom photos.", "Date": "October 16, 2008"}, {"Title": "It's a Nikon!!", "Author": "K. Mcgrath \"kmphotofreak\"", "ReviewID": "R8973DHXVLJHI", "Overall": "4.0", "Content": "This was my first digital camera. It's a great little camera with nice optics. If you want a megazoom buy it. I must say though I returned it for a d40x, I'm use to using 35mm cams back in the day and I love it.", "Date": "August 22, 2008"}, {"Title": "Are you aware of this?????", "Author": "george spelvin", "ReviewID": "R11XBXSOEJBKME", "Overall": "1.0", "Content": "I had been monitoring the price of this camera for a few weeks and found, while checking through Amazon's merchant list, a seller (CameraSpot) offering it for $199. Now with any independent retailer I would be very suspicious, but not with Amazon. I thought they screened their merchant lists and all but eliminated this bait and switch tactic. And so, I ordered this P80 at the $199 price.When I returned to the website several hours later, both the price and the merchant were gone, but my credit card had been charged for the $199. So now I became suspicious. I called Amazon and expressed concern that perhaps their system has been hacked, but I am told - by someone who barely spoke English, I might add - that this sort of thing happens..i.e..that retailers offer a low price on Amazon and cannot fulfill the order. She then assured me that if a refund was not issued within the next 2 billing cycles, Amazon would help me to try and resolve the issue. Though she was very polite, she was also evasive and talked in circles.Frankly, I was shocked to find that this sort of tactic was permitted on Amazon. Evidently, they do not screen their merchants and so consumers are at the same mercy as they would be if dealing with Broadway Photo or Abes of Maine (2 of the more commonly known culprits of this type of deceit).There was a time in which I thought Amazon was a safe place in which to transact business. Clearly, that is not the case. I would like to add now that the camera which I ordered through Amazon today from CameraSpot is listed as available at $299 on their website.I expect to receive an email tomorrow from CameraSpot telling me that the item is not in stock. Either way, I will update this review with whatever happens when it happens.Buyer beware. Buyer beware of Amazon.Update*****I was contacted by Amazon.com today to tell me that my order was cancelled. No reason given by them, except a lame apology. CameraSpot also contacted me and expressed their dismay that the camera was not available, but that they had a better camera that they would let me have for a discount because I was so valued a customer. It was the Canon sx10is which they were willing to sell me at the discounted price of (drum roll) $399.99. I can get it through legitimate sources at a lower price than their 'deep discount'.I cannot say that I'll never purchase from Amazon again, but I will never purchase through them with any confidence. As far as I am concerned, Amazon is a shill for questionable and corrupt online retailers.", "Date": "January 22, 2009"}, {"Title": "Got a dud", "Author": "A. Martin \"music junkie\"", "ReviewID": "R1HAIB3W3JAEX8", "Overall": "1.0", "Content": "I was impressed when I found out that Nikon was coming out with an ultra zoom point and shoot but from the time it arrived, I couldn't get good pictures with it. I don't claim to be a professional, but I tried using it in the full automatic mode and manually and pictures were always poor. It's possible that the camera was just defective but after using it for a week and getting very poor results, I am thankful to Amazon for taking it back.", "Date": "July 8, 2008"}, {"Title": "P80 Noise", "Author": "JD55", "ReviewID": "R2XN7MUM84F64N", "Overall": "3.0", "Content": "The P80 at $399 certainly had the right specifications in terms of megapixels, zoom, brand name etc...  I ordered the camera just before going on vacation.  I noticed that even at ISO 200 some of the indoor pictures exhibited noticable noise.  On my vacation I knew I would need to take indoor pictures with less than ideal lighting.  I immediately returned the camera.  (Excellent return policy and procedure with Amazon!)  I decided to buy the Nikon D40 with the kit lens.  I would have purchased from Amazon, but I would not have had enough time for delivery.  For about $50 more I bought a D40 at a local shop for $450(Great camera for the money!) .  I suppose if you shoot primarily outdoors in good lighting the P80 would be fine.  Perhaps my expectations were too high since it was a Nikon.  I see the price of the P80 has come down a bit, but for a little extra the D40 is the better camera and the better deal.", "Date": "June 16, 2008"}, {"Title": "Great product at a fantastic price", "Author": "Joshua A. Hopkins \"Hpknsjsh\"", "ReviewID": "R2L7Y1YC4ZTAVW", "Overall": "5.0", "Content": "Extremely pleased with the camera and the whole transaction. Exceeded my expectations throughout the deal.", "Date": "March 31, 2009"}, {"Title": "Gr8", "Author": "James", "ReviewID": "R2HCVZEVR2U2VQ", "Overall": "5.0", "Content": "This is a great all around camera. its pretty small for its large zoom capabilities. it takes great pictures. I love it i strongly recomend it. Anyone who wants to start photography should get one. =)", "Date": "January 19, 2009"}, {"Title": "Lightweight 8800 replacement", "Author": "Douglas Hunter", "ReviewID": "RCKTQ722AVO2E", "Overall": "4.0", "Content": "Found this camera on Amazon for $210. Awesome camera at twice the price. Beautiful color saturation and great lens. Able to shoot candid pictures at 300 yards. We bought this to supplement the two Nikon 8800's we already use but just may have found a replacement.", "Date": "January 19, 2009"}, {"Title": "camera review", "Author": "Sharleen H. Hathaway \"tiger\"", "ReviewID": "R19V755BXS62RJ", "Overall": "5.0", "Content": "I purchased the camera as an early christmas gift for my son who was going on a Missionary  trip to Nicaragua. He had recearched it and picked it out for me to order. It was everything that he wanted We were pleased with the quick shipment and no shipping charges and he is very pleased with the camera. Thank you for making my first purchase such a success", "Date": "December 22, 2008"}, {"Title": "Good camera.", "Author": "David P. NADOR \"DaviNator\"", "ReviewID": "R2KJZIVHD3OZDJ", "Overall": "4.0", "Content": "Simple to use with great zoom and video. Slow to write the pic between takes though.", "Date": "December 4, 2008"}, {"Title": "Awesome Camera", "Author": "Amazon Customer", "ReviewID": "R26DGC2VNHFJHI", "Overall": "5.0", "Content": "I had previously owned this camera, and my toddler smashed it, so I was so glad to find this gently used camera, in better conditionthan expected! And super fast shipping too! What a great seller!!!", "Date": "March 22, 2012"}, {"Title": "Good camera", "Author": "Andres Espinoza \"K5-Chaos\"", "ReviewID": "R3R88MLIEP5JAE", "Overall": "4.0", "Content": "I'm just an amateur user. This is my fourth digital camera. All my previous one were Canon. I switch to Nikon and not bought the S5 because a couple of negative review.So far I love the camera but I have to deal with one BIG DISAPPOINTMENT. You can't override the preview image. That means you have to wait till your picture dissapear to take the next one. All my ultra compact Canon did that but you can't do it with this. So buy a fast memory is worthless because you have to wait anyway. I wrote to Nikon and they confirm me that so I hope they fix it for next one (or if it's possible to upgrade the firmware)Next step = SLR", "Date": "July 6, 2008"}, {"Title": "Excelente câmera.", "Author": "Osvaldo Amaro De Junior \"asjr78\"", "ReviewID": "R2YSS7L7289U1O", "Overall": "5.0", "Content": "Não entendo porque algumas opiniões foram tão ruins para esta câmera. Ela possui todo o tipo de regulagem, e até mesmo no modo automático as fotos ficam com uma qualidade excelente, principalmente as cores na impressão.", "Date": "June 28, 2008"}, {"Title": "Promising but...did meet expectations", "Author": "Val Cosmos \"Citizen of Universe\"", "ReviewID": "R2ZCTW2EJIX1Y0", "Overall": "3.0", "Content": "I`ve been in search for a advanced pre-SLR camera for several days after my old Kodak 6490 was lost. I once owned Nikon D70... so i`m familiar with what a good camera should feel like.  This camera has a solid construction but the image quality indoors is average. That`s what i check cameras for in the first place. Most of them are capable of producing decent images in a bright light, but the anti-shake sistem is something you greatly rely on when taking pictures indoors.  When i use a camera in a dim light not only do i make sure that anti-shake sistem is on, i also hold a breath and take a burst of shots as to increase a chance to get a good quality shot. Besides i set ISO settings to 400 MAX, so i don`t get much grain... All of the pictures are lifeless and blurry. I`m greatly disappointed and the camera went back to store. I`m buying a Panasonic xz8 tomorrow.", "Date": "June 2, 2008"}, {"Title": "Disappointed", "Author": "Mark Woods \"Mark\"", "ReviewID": "R1JDSOUETN0JHV", "Overall": "2.0", "Content": "I was so excited when I heard about an 18x zoom lens in a compact camera that I ordered it a month before it became available.  Unfortunately, I was very disappointed with the performance.  While the zoom lens was truly great to have, the time lag between turning the camera on and being able to take a shot was way too long.  To make matters worse, the time lag between pressing the shutter and it actually taking a picture was also too long.  I wanted the camera to take pictures of my grandkids, but with those time lags all I would get is empty space.So I returned it and bought a Nikon D60 with two zoom lenses, which is fast in all respects.", "Date": "May 27, 2008"}, {"Title": "Good Camera", "Author": "PhotoMaster", "ReviewID": "R2X5HPOM1RNQ8V", "Overall": "4.0", "Content": "Alright, don't get me wrong this is a stunning camera... for beginners. I bought this camera two months ago and I have taken great photos with it. The only thing I regret about it is, it doesn't have interchangeable lenses. That means you can't buy another lens off of Nikon's line of Nikkor lenses and put it on. I am now purchasing the Nikon D5100. Hopefully that will satisfy me. The zoom is phenomenal, although when you get into digital zoom it gets blurry. The camera is small but I don't mind. Get it used, it's cheaper and with mine (135.00) it was practically new!", "Date": "June 4, 2012"}, {"Title": "I broke it", "Author": "A", "ReviewID": "R3E0DIZNIUENH7", "Overall": "3.0", "Content": "The major problem with this camera is the quality of indoor pictures. The camera would distort color tremendously. It's great outdoors, but i need a camera that can do both.Also, I took it to a party (even though it was indoors so the camera was worthless) and it completely broke when i dropped it.This camera is ehhhh. I wish I had gotten a smaller camera for everyday use", "Date": "June 30, 2010"}, {"Title": "Decent camera -- very bad in low light", "Author": "George E. Burgyan \"GBurgyan\"", "ReviewID": "RCJRK7CCH1O49", "Overall": "2.0", "Content": "One of the key reasons I purchased this camera is for the zoom range and the low light capabilities. It would be an OK camera except for the fact that it can't focus in low light conditions. My two year old Canon can do what this brand new camera can't -- focus properly.I was planning on taking it on a month-long vacation, but it's staying at home. It's a waste of money since it doesn't do the job as well as my old camera. Maybe a warranty repair might fix it. I've been shooting Canon for the past 15 years and tried Nikon this once. My mistake.", "Date": "June 16, 2008"}, {"Title": "blurry pictures,  with direfent settings.", "Author": "D. Perez", "ReviewID": "RGAD1PU57IMLF", "Overall": "1.0", "Content": "After reading some negative reviews, i was not sure wether to buy it or not, but finally i decided for the Nikon P80. Because some 5 star raters said i just need to read the manual and understand how to use it properly.I took some pictures in auto mode and i was not happy. All were blurry.I read the manual, i made a chart to write down what setting i used in every picture so i could see the diference. I used diferent: shutter speed, aperture, Dial mode ( P, A, S, M, and auto), Diferent Image quality, white balance, and diferent ISO, with NR  ON, ( NR stands for Noise Reduction),  Flash: Auto and Fill flash, with auto focus.Yes i took more than 70 diferent pictures using diferent settings,  the same day, same place. People's skin looks grany, noisy and blurry.I am not the kind of person who likes to return items, i really like this camera, but picture quality is really bad. I had bought an extra battery, i have to return. I purchased an extra battery because i was planing to keep this camera of course. I took the time to test it with diferent settings, same results. Ugly and blurry pictures.No, i dont recomend it. A less expensive camera can take better pictures. Battery life is about 70 shots.Wide angle, not really makes a big deference.I  had to to use it , so i could see how this camera worked. Totally disappointed.If you have this camera and are happy, congratulations !But, Don't you think a point and shoot camera should take good pictures in auto-mode?Thanks to Amazon's return policy  i could return it.Amazon: Great seller.", "Date": "August 9, 2008"}, {"Title": "Dull Pictures", "Author": "S. Lew \"Susan\"", "ReviewID": "R39Q2D97TYDQ5", "Overall": "1.0", "Content": "I got the Nikon P80 about 10 months ago. I took a lot of pictures (in Hawaii) lately. I am very disappointed with the pictures quality. Most of the pictures are very dull and faces are very dark, even in a sunny day. I used \"P\" mode most of time.", "Date": "April 30, 2009"}, {"Title": "The New Coolpix P80, 3 Stars!!", "Author": "lourdes", "ReviewID": "R2UGLQRVT20MAZ", "Overall": "3.0", "Content": "-------------Lo Negativo :-------------- Cuando hay mucha luz la pantalla LCD refleja unas rayas verticales color morado que se graban en las fotos (ver fotos de la galeria).- La estabilización VR no es tan buena, principalmente cuando alcanza el maximo zoom, la imagen tiembla mucho.- La información EXIF de cada foto, en modo playback, no refleja el valor ISO con el que fue capturada.- Los videos no son tan de buena calidad, totalmente horribles, cuando se hace zoom se distorciona la imagen.- El modo de escena panoramica no es muy \"amigable\".- El control para ajustar los valores de Manuales (apertura y velocidad) no es muy practico.- Desde el ISO 400 en un ambiente a iluminacion media, se nota presencia de ruido en la imagen, ¿q tal en 3200 o 6400?.- El maximo valor de apertura es de f8, muy limitado a mi parecer para tomas donde se desea un buen enfoque del fondo y los detalles.- Las tomas con el zoom digital son practicamente inservible (ver imagenes en galeria).- La calidad de la imagen, no es la gran cosa como esperaba de una Nikon.-------------Lo Positivo :-------------- Bonito diseño, muy comoda para tenerlo en la mano.- Se puede hacer zoom mientras se graba video, aunque lastimosamente la imagen queda muy distorcionada aun en la mejor calidad segun la camara.- Usa modos de escena bastante estandares, ya conocidos en muchas marcas.- Alcanza una velocidad de obsturación de 8 seg., cuando la mayoria llega a 2 o 4 seg., esto permitira realizar tomas con mayor tiempo de exposición.- Su alcance de zoom optico de 18x, es muy bueno, aunque la imagen no queda tan nitida.*** Tres Estrellas!!", "Date": "May 13, 2008"}, {"Title": "My iPhone makes better pictures", "Author": "Ali Q. Asaad", "ReviewID": "R3EU3QER4OJIMV", "Overall": "1.0", "Content": "I bought this Nikon Coolpix P80 and I did few shots and all what I got is blurry pictures. This is he worse digital camera I got. I gave it to my 10 year old son and he didn't like using it too due to poor photo quality. Don't buy it, you better using your iPhone cam.", "Date": "November 14, 2010"}, {"Title": "Software?", "Author": "Jim Sinsoporte \"Jim Sinsoporte\"", "ReviewID": "R1Y9TFMJG1KYNC", "Overall": "3.0", "Content": "This is an expensive point and shoot camera. I just assumed a company as classy as Nikon would include basic photo editing software. PHOTO EDITING SOFTWARE IS NOT INCLUDED. So you better have some from your old camera. I guess that's why the in-camera editing is touted so highly. I think I will return this camera and get a Canon that comes with good software. Nikon recommends on the phone that you buy their newest, less than friendly software.", "Date": "June 26, 2008"}, {"Title": "Nice name bad camera", "Author": "David J. Koser \"David\"", "ReviewID": "R2A30KX1ZGDX2L", "Overall": "2.0", "Content": "I will make this extremely short. For the price you pay for this camera and quite frankly the quality you expect from the name do not reveal the true quality of the camera. You would be much better off buying a lumix fz18 for less money and better quality. I definately do not recommend this camera to anyone, I personally sent it back and bought the lumix. Take my advice I spent slot of time researching.", "Date": "June 15, 2008"}, {"Title": "Look elsewhere for quality", "Author": "L. Radcliffe \"Siggyfan\"", "ReviewID": "R16Q7KY2KDFSTX", "Overall": "1.0", "Content": "I bought this camera YESTERDAY with overnight delivery...I am returning it TODAY!  Do not be fooled by the 18x zoom advertisement.  While the zoom is probably it's only good quality, my Sony H5 with a 12x zoom captures basically the same 'distance' zoom, but with much better clarity and crispness.  The flash on the Nikon is horribly designed with a push button release, the time between shots is a little long in my opinion, the movie mode is a total joke!  30 seconds of video at the highest setting is a big upset--very very disappointed in this camera.  The photo quality is very grainy and almost upsetting to my stomach!  Even with ISO set as low as possible, the 'grain' seems to be there for the long run.  I took several indoor photos, several outdoor photos, several zoom photos....just very very disappointed in this camera as a whole.  I suppose if you are only taking pictures of rocks and flowers, then this camera may be ok for you--but then again, so would a cheap disposable camera from your local drug store.  Don't take a chance losing your precious memories to this 'cheap' camera.  I was looking for a higher zoom to replace my Sony, but after seeing the Nikon's poor capabilities, I will stick with Sony from now on.", "Date": "May 8, 2008"}, {"Title": "Price fallen immediately after purchasing the product", "Author": "Jeevan Joseph", "ReviewID": "R3PPC6P3EXJX0R", "Overall": "1.0", "Content": "I purchased this camera for $299 during Thanksgiving holidays. but i observed that its price fall to $230 now. This was an immediate fall after most of the customers purchased the product. this is really hurting..", "Date": "January 8, 2009"}, {"Title": "Nikon P-80", "Author": "Harry P. Begier Jr. \"fireatty\"", "ReviewID": "RUBU8Z8LFHKRW", "Overall": "1.0", "Content": "I am not happy with this camera. Get a lot of blurry pictures. I am going to return it and opt for a higher level camera.", "Date": "June 2, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00176BDD4"}}