{"Reviews": [{"Title": "Camera worked great at first", "Author": "Natalie Crowell", "ReviewID": "R2BT1TH4GHLJC3", "Overall": "2.0", "Content": "This camera worked great until one night I accidentally knocked it against something (not hard at all, most cameras would have survived) and from then on the lens would not come out.", "Date": "March 15, 2013"}, {"Title": "A Very good camera", "Author": "Ernest C. Upchurch", "ReviewID": "R2YSJRDA3LXYAC", "Overall": "4.0", "Content": "I believe the M883 is one of the best digital camera's I have ever used. It is simple to use, takes great photo's and I would buy it again. I have a couple of newer digital camera's, but I prefer using the Kodak M883 for most of my photography.", "Date": "March 11, 2013"}, {"Title": "Kodak Eashshare M883 Digital Camera", "Author": "Patricia Hume \"P. Hume\"", "ReviewID": "RKEFI9SMUPE11", "Overall": "4.0", "Content": "After buying my daughter a Kodak Easyshare and seeing all the bells and whistles.....I had to have one too. Screen size was very important to me. My husband and I are getting older so we need bigger pictures to look at. It's also 8.0 mpix, optical zoom 3X and came with a free memory stick. This camera is compact, lightweight, easy to point and shoot while getting high quality pictures.The only downside is the quality of the videos and slightly dark pictures. They are grainy and hard to discern. Be sure there is always enough light for a truly good picture and this camera is sure to delight. I love mine!", "Date": "October 9, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Thin, stylish all-metal red body- SD/SDHC/MMC expansion slot\n8.0 MP for prints up to 30 x 40 inch (76 x 102 cm)\n3x optical zoom lens - 5x advanced digital zoom\nHuge 3.0-inch (7.6 cm) wide-angle viewing LCD\nHD Still Capture - Face detection technology", "Name": "Kodak EasyShare M883 8MP 3x Optical Zoom Digital Camera (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41SwTsqu3eL.jpg", "ProductID": "B0015UJ1YK"}}