{"Reviews": [{"Title": "Amazing", "Author": "Missy", "ReviewID": "R1HXR9T3JY77OY", "Overall": "5.0", "Content": "I have had this camera for about 2 months now and I am still LOVING this camera. it has 10.3 megapixels (really shoots at 10mp) and an amazing deal for that. takes great quality pictures every time. i've only had a blurry picture when it was completely my fault (i accidently moved my arm before it was shot, etc etc) the zoom is nice as well. A nice feature is the panorama shots which stiches pictures taken together! I would definitly recommend this to everyone looking for a new camera.", "Date": "November 14, 2008"}, {"Title": "CAMERA'S GREAT, BUT DELETE THE SOFTWARE!!!", "Author": "Susan K. Haynes", "ReviewID": "R3I6TH4UVEGVX9", "Overall": "5.0", "Content": "I just got this camera 6 days ago, and though I had a Canon with many more features, this one beats it because it is user friendly for ANYONE, and it takes fantastic pictures!  It takes shots of my 2 year old neice running or walking, my dogs in motion, low light, daylight, has easy buttons to use that even I can understand (and I'm not good with electronics) and can do many things I may never want to do.However, the Kodak EasyShare Software is a joke, and I agree with all of you who have complained about the \"EasyShare\" software that comes with the M1063, but--GOOD NEWS. YOU DO NOT HAVE TO INSTALL IT INTO YOUR COMPUTER TO GET THE CAMERA TO WORK! If you did install it, UNINSTALL IT, AND CALL KODAK. All you have to do is call the Kodak toll free number 1-800-235-6325, listen for option to \"put in a 2 digit code\", in this case the option number is 20 and wait for a customer service rep to come on the line. Simply explain to her (I called 2 times before I got a person who knew what she was doing) but just tell them you'd prefer not to use EasyShare software and ask them to tell you how to just download photos from the camera into My Pictures, or wherever you want them to go. In my case, I wanted them in My Pictures so I could use Snapfish online services, and voila! within a few minutes, the camera was working and installing photos from the camera into My Pictures AFTER I UNINSTALLED THE EASYSHARE SOFTWARE. Had it not been for that woman, I was going to return the camera today 3-24-09. Folks, you DON'T HAVE TO USE EASYSHARE SOFTWARE, but I can't explain how to do it--they know at Kodak how to make this happen, though and don't even use it themselves! Just keep calling until you get a person savvy enough to help you, because it can be done. They'll take you places you've never been before on your computer, but they do know how to do this.", "Date": "March 24, 2009"}, {"Title": "Great Camera. Highly Recommended!", "Author": "WhtDaddy", "ReviewID": "R2TT4OYM709GVZ", "Overall": "5.0", "Content": "This is a great camera, especially for the price.  I got mine on black Friday for $79.99.  It takes great pictures, it's 10.3mp but shoots at 10.1mp.  Pictures are crystal clear, it is extremely easy to use, very very slim compact design with a massive screen, video capture is great and records in 480p high definition.  The zoom feature is amazing!  The pictures are great quality even when zooming all the way in.  I was on one side of my yard and my friend was about 20feet away and I used the zoom feature to capture a perfect face shot even from 20 feet away!  I am highly impressed with this camera, if you're debating I highly recommend it!", "Date": "December 25, 2008"}, {"Title": "Nice camera, shame about the software", "Author": "Kay", "ReviewID": "RICE77EAJWYDC", "Overall": "4.0", "Content": "Although I haven't been using this very long, it seems so far to be a very nice camera, maybe a few too many features for the average point-and-click family snapper (unless you have a hobby such as genealogy which requires it, most people are probably never going to use something like the document setting for instance) but relatively simple to use and one can avoid the more complex bits if one doesn't need them. It takes good quality pictures and I'm especially pleased that the flash doesn't seem to wash out my indoor subjects quite as badly as my previous cameras did.However, the software is DREADFUL. A fault of Kodak's recent home use products is that the software is often geared towards the latest, highest-tech systems and most people simply do not have the fastest, newest, biggest computers available in their homes. On anything else, the software takes a very long time to start up and even the so-called \"one touch\" download (which is actually a several-stage process) takes an interminable length of time to fetch the pictures from the camera to the hard drive. It took over 20 minutes to download 48 photos (mostly shot at 5MP), which with my old camera/software (Sony Cyber-Shot with Picture Motion browser) would have taken 3 or 4 minutes. I also couldn't do anything else on the computer while the photos were downloading; whether this was a memory overload problem with the computer or whether the EasyShare software requires the computer to be dedicated solely to itself during downloads I don't know. Finally when I first installed the EasyShare software, it overwrote some of my DSL modem's files and I had to repair my internet connection.Overall I think I am going to be very happy with the camera but I'm very frustrated with the software. I am looking for alternate download software to bypass the Kodak EasyShare software completely for the initial transfer from camera to hard drive.", "Date": "March 22, 2009"}, {"Title": "A sleek and attractive piece of garbage", "Author": "K. Tevald", "ReviewID": "R16TUEJ3VM0IZP", "Overall": "1.0", "Content": "***BEWARE THIS CAMERA***I was looking for a decent camera to stick in my backpack this summer while I hike along the Appalachian Trail. I chose the Kodak EasyShare M1063 10.3 MP Digital Camera with 3x Optical Zoom because it is small enough to pack easily and it had all the features I wanted.The camera arrived VERY fast. I was pretty excited. I couldn't stop looking at it while it charged. It is a beautiful , sleekly-designed unit with a very solid feel to it.I had read all of the reviews on Amazon about this camera, and while I noticed a few were bad, the vast majority were good, and I felt confident that I had bought a good camera.Finally it finished charging and I couldn't wait to take some pictures. So I hiked up nearby Cedar Mountain and took a 10.3 megapixel picture of the town of Newington. The 8gb memory card I ordered hadn't arrived yet and the internal memory is only large enough to store 1 picture taken at 10.3 megapixels so I headed for home. I was very pleased with the camera's menu and functions. It is very easy to use. The picture I took looked great on the nice sized digitial screen on the back of the camera.I couldn't wait to get home. At 10.3 Megapixels I should be able to make out my friends houses. I was anxious to see exactly how much detail would show.A feeling of excitement made my fingers fumble a little while I was plugging in the USB cord.I moved the picture to my hard drive and opened it up ready to say WOW.........I couldn't believe what I saw....The picture I just took was large but the quality of it was a freakin' joke. ABSOLUTELY HORRIBLE.I couldn't believe it. No name brand company would sell something this bad. The other negative reviews I read crept into my brain and I started to worry......I decided maybe I had done something wrong, so I went thru the instruction booklet very thoroughly. The instructions are very poorly written and offer very little about the cameras actual usage; however the on-screen help menu built into the camera is fairly comprehensive. After making sure I had the right settings I went out to the front yard to take some pictures.I tried every setting from 10.3 megapixels to 1.3 megapixels and I tried all of the different light and color mode combinations and soon I came to a realization that really bummed me out.....This camera is incapable of taking good pictures.EVERYTHING LOOKS LIKE CRAP AND IT IS SO BLURRY AND GRAINY AND BAD THAT NO DETAIL AT ALL SHOWS UP.This is not my fault, my hand is steady and the cameras blur-warning confirmed this by flashing a little green hand. (which means my hand was very steady)I was looking at one of the 10.3 MP Pics I had taken of my frontyard, the grass looks literally like a child scribbled with a green magic marker. there is no detail whatsoever.This camera is especially frustrating because the features, the design and the digital screen are all TOP NOTCH.......THE PROBLEM IS THAT IT TAKES PICTURES THAT LOOK LIKE THEY WERE TAKEN FROM A CRAPPY CELLPHONE.This is my second digital camera, and my second Kodak. It will be the VERY last Kodak anything I even consider for purchase. This camera is so bad it is offensive.I know there are a lot of good reviews and tho I cannot understand how anyone can be happy with this piece of garbage I want to warn you that this camera takes AWFUL pictures.I have never returned anything that I have purchased thru Amazon before. I do not even know what the return policy is.......But this thing is completely , totally and utterly WORTHLESS, so I am hoping I can send it back......DON'T BE FOOLED BY THE POSITIVE FEEDBACK LIKE I WAS. THIS CAMERA WILL NOT MAKE YOU HAPPY.", "Date": "May 10, 2009"}, {"Title": "Super Little Kodak!", "Author": "JRTLVR \"queni\"", "ReviewID": "RYE2A1R13LSNZ", "Overall": "5.0", "Content": "This is my third digital camera - the other two are both Sonys.  This was purchased to replace the original Sony 3.2 model.  I am ecstatic with both the quality of the photographs and the incredible ease of use!  It fits easily in the smallest purse or a man's shirt pocket and has features that even my big Sony with a 12x optical zoom doesn't have.  I think that the price on this little gem is EXTREMELY reasonable for all the features it has in such a compact little package!If there was one criticism I have, it's that the software makes no provision for removing the \"green-eye\" syndrome that you get photographing pets with flash.  Other than that, I think it's absolute perfection!  GO KODAK!", "Date": "December 20, 2008"}, {"Title": "I love it.", "Author": "Helen Wright \"Sailor\"", "ReviewID": "R377PL4V81B0MX", "Overall": "4.0", "Content": "This is my second kodak camera and it is the best camera i have ever owned it's fast easy to set up and takes beautiful pictures. I'm military and deployed at the moment and Amazon was still able to ship my things in two weeks that's just amazing. i would recommend this camera to anyone that just wants to take good pictures fast and easy.", "Date": "December 16, 2008"}, {"Title": "Such a disappointment- Grainy photos, Poor detail, THIS is 10 MP?", "Author": "Alison Ginter \"Goddess Alison\"", "ReviewID": "R3UUWIPX5JJNAM", "Overall": "2.0", "Content": "I pre-ordered this camera and was so excited to receive it!  I already own a Kodak easyshare Z612 which takes beautiful, high detail photos at only 6 MP, but I was looking for a more \"pocketable\" camera because the sheer size of the z612 keeps me from taking my camera with me and taking as many photos as I'd like.  So, I went with the M1063 because of it's slim design, it's array of features (scene selection, HD, etc.), upgrade in MP's, and it's PINK!When it finally arrived, I immediately started snapping away...only to find that on the on-camera screen, the pictures didn't look very sharp at all.  In fact, many of them looked grainy...some looked dark (as if I hadn't used a flash)...and unfocused.  I also noticed that the \"face detection\" technology never really seemed to pick up any of the faces I was trying to take pictures of!  I thought maybe it was just the little screen and things would look better on my monitor, but once I uploaded them to my computer, they only looked worse.  Magnified to 100% and you can really see how unfocused and grainy the pictures really are!  Now if 6 MP was detailed, I certainly expected 10.3 MP to be SHARP...but I find that these photos are LESS DETAILED than my 6 MP photos!  Take a picture of my cat with the z612, and you can see each individual hair...use this camera, and it's just a confusion of black and white fur.  The only photos that seem to come out decent are ones taken within an arms length; beyond that, it's a mess.If it weren't for the mere fact that you can enlarge these past 4 X 6, I'd say I can take better photos with my iphone.  Sigh.It's a pretty camera and has nice features, but it simply doesn't deliver on the Kodak quality I've come to expect.  I'm going to be returning it.", "Date": "September 23, 2008"}, {"Title": "Good Deal", "Author": "H. Scivinsky", "ReviewID": "R2U37PJXJH25RU", "Overall": "5.0", "Content": "Purchased this camera because I wanted one that would fit in a shirt pocket. The size is just right, it is easy to use and it takes great pictures. Had other Kodak cameras in the past and they always performed well.", "Date": "January 30, 2009"}, {"Title": "Not worth the money!", "Author": "Javier Perez-albert", "ReviewID": "R2FURIFLD2ZYVP", "Overall": "2.0", "Content": "Bought the camera after reading the reviews, it sounded like a safe buy, especially for the price.Here is what I like: daytime picture quality, size, battery life.Dislike: you can't see the screen in the sun, its not bright at all!!also, HORRIBLE night time picture quality, and i mean really bad.one more: my old digital camera (canon powershot) had an easy to find power button (it was elevated). in other words, i could stick my hand in my pocket and push the ON button while i was pulling the camera out, which is great for those spontaneous shots. With this camera, I find that i have to pull it out, then find the button, then turn it on. Its just a poor design by Kodak.Video quality isn't great, and the sound picked up by the mic is pretty bad.The interface for deleting pictures is awkward too: you have to press the delete button, then move the cursor up to select that you want to delete the picture. after it deletes the picture, it takes you to the next picture and asks if you want to delete it as well, when it should in fact just take you back to picture taking mode, or a plain preview mode.sorry for the long negative review, but i really am disappointed by this one. I am now buying a new panasonic because i don't dare to take this one with me to a trip out west.", "Date": "April 28, 2010"}, {"Title": "best little camera", "Author": "Donna F.", "ReviewID": "R6V100KWQTSYV", "Overall": "5.0", "Content": "Kodak EasyShare M1063 10.3 MP Digital Camera with 3x Optical Zoom (Silver)I bought this camera hoping to get the most\" bang for my buck\" and I was not disappointed.Although small,it has a very solid feel to it.It is very easy to use and takes great pictures, and the camera menu is very easy to follow.I'm pleased that I chose this camera.", "Date": "January 26, 2009"}, {"Title": "A Great Buy!", "Author": "Fair-reviewer", "ReviewID": "R307QLXBF85Z9J", "Overall": "5.0", "Content": "Twice as good as the Olympus (errrrr) it replaced for half the price!!If you are looking for a thin small camera like this, this is the one to buy! If your pix are dark, retake them with the ISO setting. You can take pix in b&w;, sepia also.Love it!", "Date": "January 3, 2009"}, {"Title": "Perfect!", "Author": "K. Anderson", "ReviewID": "R2W76U823HFPPR", "Overall": "5.0", "Content": "After going through two digital cameras [buying them and returning them for various reasons] I finally found one that fits me. It's red, has 10 megapixels, and it takes very good pictures! I bought the bundle for a good deal and I am still playing around with it. Overall, this Kodak is awesome and I think it's worth investing your money in!!", "Date": "December 24, 2008"}, {"Title": "Great and Easy", "Author": "J. Cottrell", "ReviewID": "R2AT8Y5H50KTX6", "Overall": "5.0", "Content": "Being a single mom I need an easy camera that gets good quality photos. I found this one EASY to use and the directions when I had time to read them were easy to understand. The photos were good. There may be graininess when you super zoom in and such...but an experienced photographer should know not to expect miracles. Even in a darkroom there will be graininess. It's up to the editing software to correct it when you aren't happy. I like the camera it's easy, good quality, and heck it's pink! My kids are able to use it and so is my mom.", "Date": "February 16, 2009"}, {"Title": "Never again", "Author": "D. Satterlee \"dvdsat\"", "ReviewID": "R1VBWF1OCKL7VN", "Overall": "1.0", "Content": "I owned a Kodak Easyshare for years and was pretty happy with it except for the docking system.  I felt good enough about Kodak to try out this camera for my next upgrade.Within 1 week the first camera  stopped turning on even when fully charged so we returned it.  The second camera worked for about 1 month.  During that time we took the family for the first time to a memorable trip back east to historic places like Washington DC.  Upon return home we found out that about 70% of the pictures turned out blurry.  This will be my last Kodak purchase.", "Date": "August 24, 2009"}, {"Title": "DO NOT BUY THIS CAMERA!!!!!", "Author": "Denise M. Luppi \"dmluppi\"", "ReviewID": "RBEW74JCPYIFC", "Overall": "1.0", "Content": "You will regret purchasing this camera. I got it for Christmas last year (2008), and it worked incredibly well - at first. While its pictures were neither as clear nor as sharp as some other cameras', I had anticipated a much lower quality picture due to its relatively inexpensive price. I made sure to take extra care of my camera, always leaving it in a protective case and using it only about once a week. However, my appreciation for this camera swiftly ended in last March, three months after I bought it. Its flaw was simple - after I turned the camera on, its light would flash on and then it would turn off. I sent it in to be repaired, but picture quality diminished greatly after it was fixed. One month later after it had been \"fixed\", the same problem again occurred - it would not turn on. I sent it to be repaired again, and was sent a new camera in the mail. I took no pictures with the camera, just plugged it into my computer to load some pictures. A few days later, I tried to turn it on but discovered I could not. Yet again, this crappy camera would not turn on. I hate this camera with a passion. DO NOT BUY THIS!!", "Date": "August 12, 2009"}, {"Title": "Malfunctioned Within 13 Months of Light Use", "Author": "Stan W.", "ReviewID": "R2RFGDLL8UKDUY", "Overall": "1.0", "Content": "The camera malfunctioned after 13 months of light usage.  When the camera is turned on, it turns off within 1 second.  Tried another new battery.  It still will not turn on properly.", "Date": "January 15, 2011"}, {"Title": "M1063 LCD screen", "Author": "Don \"tinman\"", "ReviewID": "RIYSUDSDKJUN3", "Overall": "1.0", "Content": "LCD view screen lasted 7 months. View screen french fried. Kodak wants half the value, plus shipping to \"repair\". I think not. There was absolutely no abuse, dropping ect .... disappointing value.", "Date": "May 20, 2010"}, {"Title": "So Slow", "Author": "Jessica Sammons", "ReviewID": "R2IGDZUCHMTRWL", "Overall": "2.0", "Content": "I recently purchased this camera to update my old Kodak camera. I decided to purchase this one because it was similar to my old one. So far, the camera is easy to use and easy to transport; however, the time it takes to let me take another picture is too long. When I read reviews there was no mention of the delay in between pictures, but there should be! There is about a 15 second delay in between taking a picture and being able to take the next, which is a lot of time! Overall, the camera is not bad but I would look into getting a different brand if you want to take those \"in the moment\" pictures.", "Date": "May 17, 2010"}, {"Title": "Great affordable camera", "Author": "Christopher W. Brown \"Chris B\"", "ReviewID": "R16JF6V16RAN8F", "Overall": "5.0", "Content": "This was a great camera for the price it takes amazingly clear pictures haven't really used the blur reduction or the nite settings yet but so far it's made me happy.", "Date": "March 31, 2009"}, {"Title": "great little camera", "Author": "Kathleen Kunces \"Kathy Kunces\"", "ReviewID": "R2ZAOHQ92MJ17Y", "Overall": "5.0", "Content": "I love this camera!  It's a good size - great pictures.  It was also a good buy and the seller was super fast getting it to me!", "Date": "March 26, 2009"}, {"Title": "Great little camera!", "Author": "Lynn", "ReviewID": "R185S84PDXEPPR", "Overall": "5.0", "Content": "I love this camera.  It can take a lot of different types of pictures but is still easy to use, which is great!  It's also pretty small so you can take it just about everywhere.", "Date": "March 12, 2009"}, {"Title": "Great quality picture for a camera in this calss", "Author": "Sean Trotter \"Sean Trotter\"", "ReviewID": "R3SJ0QG8JQC71X", "Overall": "4.0", "Content": "Me and my girlfriend just purchased this camera today and after initially looking for the Fuji 8.2mp J10 we were drawn to this camera. What won use over in an instant was not any features or optical zoom which is what I always look for 1st, but the quality of the pictures. I was upgrading from my eBay special Sony DCS P52 3.2mp, it served me well for my 1st digital camera, but it was time for a serious upgrade simply because I love taking great pictures. This camera is a great by for a 10MP in its class. although we have had it a short time. The picture quality is the main feature I was look for, if a camera can not do that well then what is it good for.", "Date": "February 27, 2009"}, {"Title": "Kodak 10.3mp Digital Camera", "Author": "Deborah K. Vollmer \"debv\"", "ReviewID": "R3LQB9S17WP1PQ", "Overall": "5.0", "Content": "I got this camera for my daughter and she loves it.  It is easy to use, takes great pictures that are clear, blur-free, and have great color.", "Date": "February 24, 2009"}, {"Title": "its ok but not great", "Author": "Mar \"Marinera\"", "ReviewID": "R150MQERUI7P1B", "Overall": "3.0", "Content": "This camera for me is not worth 5 stars.its ok nice colors but not great. the M-1033 is much better quality then this camera. i have owned both i preffer the 1033 also the videos are great from the 1033the videos here are really bad. do not recommend.", "Date": "January 4, 2009"}, {"Title": "point and shoot that only points", "Author": "James K. Richards Jr. \"jimbo\"", "ReviewID": "R1HTXC31M3GDF1", "Overall": "1.0", "Content": "i read the mom's review of her taking pics of her kids and loving this camera; that is why i wanted a point and shoot.  nothing fancy, just wanted to take pictures of my 1 year old.  however, no matter what setting i put the camera on or even lowering the megapixels, the pictures came out dark and/or blurry.  i even tried changing the flash from auto to other settings.  i was really disappointed in this camera.  from reading reviews, i guess it's a 50/50 chance", "Date": "April 1, 2009"}, {"Title": "Photos", "Author": "princess", "ReviewID": "RPUR1PUOR563", "Overall": "5.0", "Content": "I love the camera other than the fact I have a hard time seeing what I'm taking in the sunlight.  It makes it so you can't see what you are aiming at ... so you are taking blind.  But the pictures turn out beautifully if you get the subject you want.", "Date": "March 4, 2013"}, {"Title": "Loved it", "Author": "Monicet Alicia Marquez", "ReviewID": "RXCSGL6XD0FJ6", "Overall": "5.0", "Content": "I am very happy with this purchase. It is a very friendly camera and it take beautiful pictures, I would recommend it", "Date": "October 29, 2012"}, {"Title": "Worst camera ever!", "Author": "Robert", "ReviewID": "R2MCC7P9C4VSMG", "Overall": "1.0", "Content": "This camera is aweful! The first one I had did not have all of the firmware loaded, so I got a replacement. The first problem was involving the software. It was not recognizing all of the pictures when I would upload them to my pc. Then the flash and lighting began to not show up properly in photos. And finally, when I try to zoom it powers off every time. Do not buy this camera.", "Date": "January 12, 2012"}, {"Title": "Not worth the money", "Author": "Gamergirl", "ReviewID": "R186YPCXY1CO8P", "Overall": "3.0", "Content": "Overall this camera is good. Takes nice pictures,I havent had the issue of burring pictures, decent video if in a well lit area (outside on a sunny day)and pretty simple to use. However, ive had this camera for 2 years not and the battery life on it sucks. You charge it and if not used within 2 days it dies. i understand batteries die but, youd think for $30 for a battery.. itd be more than 2 years. Also if you dont use the camera for a few days it resets itself. You have to reconfigure the date and such.Its a good camera for someone who doesnt mind it draining batteries... best of luck!", "Date": "August 1, 2011"}, {"Title": "This is disposable camera. Do not waste money on this product.", "Author": "PetulantScholar", "ReviewID": "R1BJKPIJ09NOT5", "Overall": "1.0", "Content": "Do not waste time or money on this product. For the price, it definitely is not worth it.I've had this camera for a little over a year. It will no longer hold a charge, or even turn on. I've tried different chargers to no avail. I'm VERY disappointed in this product, and would not recommend it.", "Date": "March 31, 2011"}, {"Title": "not good", "Author": "K. Lopez", "ReviewID": "R3D26Q6DLQ4PF9", "Overall": "1.0", "Content": "wasn't happy with this product, i had to return it because it made a noise. Low quality. wouldn't recommend it to anybody.", "Date": "September 25, 2010"}, {"Title": "Great Camera, But Get Rid of Software", "Author": "Kristin", "ReviewID": "R2FO3ACVOTSOHE", "Overall": "5.0", "Content": "This is a great camera. It's sleek, compact, and the clarity of the pictures is great, even in zoom.I've noticed a lot of problems with the Software however, so here's some quick advice: Do not install the Software. There is a much, much easier way to get your pictures off of your camera. This is how to do in on a Windows computer.1. Go to Start>>My Computer.2. A little picture of the camera should appear if you have it plugged into your computer.3. Just click on the camera and look at the folders. Your pictures should be there.4. Just drag your pictures into wherever you want to store them on your computer.Nice and simple, without having to worry about any of the software.", "Date": "August 27, 2010"}, {"Title": "stopped working and never held a charge", "Author": "kelche", "ReviewID": "RRO9VCMZ7XP0C", "Overall": "1.0", "Content": "I used this camera for about a year before it stopped working. I was happy with the picture quality and features, although it never did hold a charge. If I didn't use it for awhile when I did go to use it the battery was always completely dead. But, now it has stopped working completely. When I press the on button the lens opens and then closes again immediately. After searching around online for a solution it seems like this is actually a very common problem and of course it is just outside of the warranty. Very disappointing.", "Date": "August 24, 2010"}, {"Title": "Difficult to see image in daylight and difficult to download.", "Author": "Barbara Beal", "ReviewID": "R13U8F9RDVU3G8", "Overall": "3.0", "Content": "We really preferred the Fuji we had before.  This camera is difficult to see the image in daylight and difficult to download to computer.", "Date": "December 28, 2009"}, {"Title": "Looove this camera!!", "Author": "Kelsey E", "ReviewID": "ROROBIMYNJDJB", "Overall": "5.0", "Content": "This camera is great. I got it for Christmas of 2008 (also at a Target Black Friday sale for $79.99) and I do not regret the purchase at all! I'm often amazed that my little camera can take such clear pictures and it's been very fun to have.The shooting modes are great and the video is very clear. However, I've noticed then when I'm taking a video the camera lags bit. It's hard to describe, but when I move the camera it takes maybe 1/6 of a second to show the move on the screen. It hasn't been a problem for me at all and I really don't mind it, but I thought I should mention it.Occasionally I end up with dark pictures, but most of the time that's due to the lighting conditions. No matter how expensive or amazing your camera is, you don't typically get good pictures in bad lighting. It's just a fact. The outdoor pictures are fantastic though.I've had no problems with the battery life, and I don't really have to charge it all that often.One thing that I don't like are the buttons on top of the camera. The flash button and power button are both small, and they both feel exactly the same so I often press the wrong button when trying to turn it on quickly. Again, not a huge problem, but worth mentioning I think.All in all, this is a GREAT camera. I absolutely love it, and I'm sorry that other reviewers haven't had as great of an experience. I definitely recommend it and I would buy it again if given the chance.", "Date": "December 14, 2009"}, {"Title": "awesome camera", "Author": "Deborah Jones \"djones\"", "ReviewID": "RI6YW95KM9JI2", "Overall": "5.0", "Content": "This camera is very nice in size and use. The camera card is easy to insert and remove. The camera has all the functions I need and it also helps me center my photo's. It is small enough to fit in my pocket.I couldn't get service at Wal-Mart to buy this camera. Amazon had it to me in two days. And at a price I could live with.", "Date": "October 24, 2009"}, {"Title": "5 stars minus one for software", "Author": "E Mackes", "ReviewID": "RNCW41SI69K86", "Overall": "4.0", "Content": "I received this camera for Christmas and it is performing well so far.  It holds a charge, is incredibly portable/available, and takes nice clear photos.  Playing with the different settings is fun, especially the ones for sports and children to avoid motion blurring.  I don't use the associated software as the software from our old camera captures the pictures just fine.  I can wholeheartedly recommend this simple to use and fairly inexpensive camera.", "Date": "April 12, 2009"}, {"Title": "excelt", "Author": "Gregori Cardenas", "ReviewID": "R2IGCA27GQQIA", "Overall": "4.0", "Content": "I am very good product in accordance with the supplier. I recommend it highly", "Date": "April 10, 2009"}, {"Title": "Inexpensive snapshot camera.", "Author": "Alex", "ReviewID": "R1TEFZM806FVG1", "Overall": "3.0", "Content": "Got this last Black Friday for $79 and it's been in use since Christmas '08.  At that cost this has been a good camera.  You will get a lot of noise in low light environments if you let the camera make decisions for you, but, having very few manual controls means you have to trick the camera into providing the settings you really want.  The camera will take some nice pictures but you have to work for it.At current retail price, you'll probably be happier with an equally priced canon model, but for $80 it's pretty good.Camera is small and fits nicely into a pocket.  Battery life is good.  Never used the software.  Don't use the digital zoom. If image quality is your top priority then you should spend more for something with better optics and a few more manual controls.Best use:  outdoor/indoor with bright light. Casual shooting.  Online video and photo sharing.(see my images above)", "Date": "July 5, 2009"}, {"Title": "the BEST!!!!!!", "Author": null, "ReviewID": "R3AD4BRRK6QFMV", "Overall": "5.0", "Content": "I love this camera!! I got it for my 11th birthday. before i was always using my moms camera. sometimes she would take even the pictures i took, for herself!!  This camera is wonderful! If you have $125, BUY THIS CAMERA NOW!!!!!!!!!!Pros:1.after pushing the shutter it only takes 1 or 2 seconds to take the pictures2.if you are deleting a picture but then if the delete menu is still up and you decide you want the picture back just push undo delete and youll get the picture back3. you can enhance the picture or crop it ON THE CAMERA4.3x zoom5.your color mode can be sepia, low color, natrual color or black and white.6. when charging the battery you dont even have to take the battery out of the camera7. HUGE lcd screen8. its a kodak, enough saidconsyou have only have the lcd screen so its hard to see your pictures in sunlight, otherwise NO CONS!!if i had to choose between my moms expensive camera and my cheap camera i would choose mineTHIS IS A GREAT CAMERA!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "June 22, 2009"}, {"Title": "crisp and super clear!", "Author": "JAQI \"watch collector\"", "ReviewID": "R35UNXCP5N4GCL", "Overall": "5.0", "Content": "I don't know about the other person who gave review on a PINK Kodak like this one.My sister got my this as early Christmas gift and it's RED.RED means lucky and money so I didn't mind the color.The performance AAA++++ really happy.Very Crystal Clear and I am super happy and satisfied.I rate it as 10 and 2 thumbs up and 2 big toes UP!that's happy I am.I'm not sure if color matters bec.the other person who made comment on the pink kodak tells the opposite.sorry to hear that.:(", "Date": "December 1, 2008"}, {"Title": "Excellent Product", "Author": "Gracie Collins \"giftbear\"", "ReviewID": "R2UNZOYUAZMZO8", "Overall": "5.0", "Content": "This is an excellent camera for anyone from no experience to experienced. Very easy to operate.", "Date": "March 2, 2009"}, {"Title": "great buy", "Author": "Jorge I. Irizarry \"Izzy\"", "ReviewID": "R1F3DHC53ER6SX", "Overall": "5.0", "Content": "Nice camera. I bought this years ago and still working perfectly. I dont use it much this days but it still work just like new.", "Date": "January 6, 2014"}, {"Title": "Fair camera", "Author": "Donnie B.", "ReviewID": "RA3AW0HVWOTJ3", "Overall": "3.0", "Content": "I bought this camera for my girl friend as a replacement for one that was ruined by rain.  The camera worked OK but the battery has no life to it at all.  I have a much cheaper camera that takes pics just as good.  I am not really happy with this camera.  The pics are fair at best and the built in battery sucks.  I would not recommend this camera to anyone.", "Date": "January 2, 2014"}, {"Title": "rateing my camera", "Author": "Kati", "ReviewID": "RNRZS42BQSBFZ", "Overall": "4.0", "Content": "I enjoy using my camera and can't wait to use it more.I like all the uses of the camera and the different portrait types there are.", "Date": "August 12, 2013"}, {"Title": "Excelente compra", "Author": "Scarlett Salazar Araujo \"Scarch\"", "ReviewID": "R1IPR7H1J7YP79", "Overall": "5.0", "Content": "Excelente compra. Una de las mejores compras que he hecho, excelente calidad, la cámara ha salido muy buena, Recomiendo la compra", "Date": "December 22, 2011"}, {"Title": "Most disappointed", "Author": "JHi \"jenchoc\"", "ReviewID": "R3GL76CUPKY420", "Overall": "1.0", "Content": "I bought my camera about 2 years ago, and don't tend to use it often.  I wanted to use it for an upcoming special event, but not only is it not charging up, there is NO life in it whatsoever.  Out of warranty.  Being Kodak, I would have expected that it wouldn't need to be used all the time to maintain usability.  While the functions are appealing, and it's a nice compact camera, I would strongly recommend finding an alternative due to the evident known faults that have been mentioned in other reviews here.  Not impressed, Kodak :-(  My camera was not purchased from Amazon, so therefore this review is solely regarding the item, not the service of Amazon.", "Date": "June 14, 2011"}, {"Title": "Nice starter Camera", "Author": "Erica", "ReviewID": "R2N8YNP5TQQKZA", "Overall": "4.0", "Content": "This is the first digital camera that I ever own. I really like it. It takes good pictures and videos. The only disappointment with this camera is its battery life. I find myself contantly charging it. Besides that, a great starter camera.", "Date": "March 31, 2011"}, {"Title": "ONE GREAT BUY for Digital Camera!", "Author": "S. Bates \"MissouriMan\"", "ReviewID": "R3SOR8BXEDELZN", "Overall": "5.0", "Content": "I cannot say how please I have been with this digital camera. After using it heavily on vacation trips and any type of picture taking for past 1.5 years.  It also takes great digital video.  Not hard on batteries like other cameras.  Easy to operate, takes excellent quality pictures and you can adjust pixels settings to how much you want to save on disk space or picture quality.  Many settings for different scenes or settings of pictures and red eye reduction is wonderful. Excellent value and very reliable, easy to use. It works well.", "Date": "February 9, 2011"}, {"Title": "camera KODAK", "Author": "JorgeVVictor", "ReviewID": "R15UN2JRWX2Q53", "Overall": "1.0", "Content": "I made a mistake, to buy a used camera and (bad) repaired, I sent  back to fix the problem, I recived back with the some problem", "Date": "January 6, 2011"}, {"Title": "my review after a year of my life with it, owning it, destroying it, and repairing it and still using it", "Author": "Kabol, Johnathan N. \"rhetorics\"", "ReviewID": "R1GD5Z08FNY7RR", "Overall": "5.0", "Content": "i bought this a year ago after the desire to switch from the much larger z760.  this camera went on sale at office depot for $99.99 with a free camera case.  so i bought it and sold my old one for $50.  basically, it was a fifty dollar upgrade for twice the mp and twice the preview screen and better overall coloring.i'm very picky about every investment i make and i looked into this model--and a few key others--for several months before purchasing.  there are standards i look for in any camera and these are those standards:-is it easy to use, or will it infuriate my woman-does it have a nice display screen, and can you kill the screen to conserve battery life while still shooting-does it have a strong many favorable reviews-it has to have a li-ion battery--the days of aa's and rechargeable aa's is long gone, the li-ions last a month and charge in forty minutes-is it sturdy, of quality construction-it must use an sd card, because of the universality of secure digitals i feel more secure taking them to any store for the occasional printing-does it feel good in your hand-does it have a view finderthis little guy passed everything except the viewfinder..  i do miss that function because when you are taking wide angle shots with heavy zoom, it is easier to center a pict through a view finder than a screen; plus on a bright day the viewfinder is easier to see than the lcd screen.  but i deal with that because it is a minor desire and the rest is the most important.this camera can be easy to use by setting the automatic flash, or you can advance it if you wish for specific targets like the dew on a peddle or the yawn of a puppy.  for our household, we need a fairly universal camera.  my woman cares less about capturing details than about capturing memories.  i prefer to gather both at once.  so the camera has to be easy to function for her and also offer the functionality of someone in desire of more pristine captures.this does it all.i have not used the software that came with the camera.  i never use the software.  it's my opinion that the less software on my computer the better.  computers are easier to police for maleware and spyware if you maintain minimal programs on them.  that is why i choose sd card cameras.  sd cards are the most universal.i did destroy this camera once by knocking it from a shelf into a cold cup of coffee.  the camera fit perfectly and the camera submerged completely.  it was so dead..  i had to take it completely apart and dry everything out.  (the first thing i did was remove the battery and sd card.)  i took a blow dryer to the lens, that was the last to dry off.  i had to do that several times before the lens would remain clear, before it would not continue to fog up.all back together, that was months ago and the camera still works perfectly.i am not a man to put belongings in cases.  that is why i do not purchase cheaply made items.  i use them.  abuse them.  there are scratches on the lens and dings on the unit.  i have dropped it plenty of times and even gave it a swim in cold coffee, and this unit stands up the way i expect it to:  completely and without disappointment.  i recommend it to the casual memory collector.  it shoots black and white, high color, natural color, low color, and sepia.  you can change the pixels in use to conserve sd card storage, and you can designate the type of shot you want to capture--landscape or up-close or motion or daylight or cloudy..also, this unit has a max card capacity of 4gb hcsd/sd card.  so dont buy an eight or sixteen gig card and expect to use that in full function.  though, with a 4gig card at max settings, this card will capture almost two thousand pictures.  i shoot several times in order to try and capture perfect individual shots and deal with the editing later, but even in akumal, mx for a full week, i only took six hundred photos.  that's not a whole lot, but it's also not a few..  a two gig card--for a thousand picture--is all you need and those are very cheap now too.  so this camera, in my estimation, is a great investment for the casual family or home shooter.  economical and versatile, you cant ask for more.( except maybe a viewfinder ha )p.s.-  i think i'll add a video review later.  though a bit grainy for a \"480p\" video feature, the vid functions well in favorable lighting.  outside, too, though if there is wind present it will remain present in the home vid.  though, i can only preach that if you are in need of a camera AND a camcorder, that you purchase both.  camera home videos are often not as clear as the desired effect sought.  that's my take...", "Date": "March 31, 2010"}, {"Title": "Good Camera", "Author": "D. Miller \"home gym rat\"", "ReviewID": "R2LVGRYNBCBJG5", "Overall": "4.0", "Content": "For the cost, this is a good camera for taking a few pictures every now and then to capture a few memories. Its compact and easy to use. It is not going to give you high quality pictures though.  It is almost impossible to take pictures of anything that is moving - i.e. children who can't stand still.  I use this camera for pictures that I put on a digital picture frame.", "Date": "March 6, 2010"}, {"Title": "PINK LOVE!", "Author": "cherie L. vieira", "ReviewID": "R34ZGTSUQJNKQY", "Overall": "5.0", "Content": "I just received this camera in the mail.  It's so light and easy to use.  Picture quality is amazing!  Love the pink color!  There is so much to do with this camera!  I have had three digital cameras in my life and this is BY FAR my favorite!I received it so fast too and I live on an island!", "Date": "January 30, 2010"}, {"Title": "Camera", "Author": "Ryan A. Davis", "ReviewID": "RUOKUOLYDEX5E", "Overall": "5.0", "Content": "This camera is awesome.  You have great zoom capabilities, Very easy to charge and takes great pictures.  The draw back of this camera is the battery life of the camera.  It usually only last for one session or day then you must recharge your camera.", "Date": "November 2, 2009"}, {"Title": "Great pictures, no sound", "Author": "Shaggy's Girl", "ReviewID": "R2J772J272W9RB", "Overall": "4.0", "Content": "I bought this camera to take on vacation and was thrilled when it arrived.  Not only is the small size perfect, but the camera has a bunch of options that make it easy to get a perfect picture every time.  I also love that the battery charges in the camera, making it a snap to plug in whenever it is running low.  HOWEVER, after owning this camera for about a month (and only using it a few times) I tried to take a video and realized that my camera is no longer making any sounds, let alone recording any.  The Kodak support people were very helpful though and I'll be sending it in for repairs after my vacation.", "Date": "October 5, 2009"}, {"Title": "Excellent Camera!!!", "Author": "David Shioshvili \"D3286S\"", "ReviewID": "R38QQ0W5EIYVKK", "Overall": "5.0", "Content": "Excellent Camera!!! It takes very clear and high quality images and the video mode shoots like the real one. If someone is looking for high quality camera for low price this is it!!!", "Date": "October 2, 2009"}, {"Title": "GREAT", "Author": "Leonard Wiggins", "ReviewID": "R183G5NX3W1GHJ", "Overall": "5.0", "Content": "Perfect quality,I got great pictures of over 500 people in costumes at the Otakon.Such precision on every picture,truely amazing!", "Date": "September 9, 2009"}, {"Title": "Terrible Camera!!!!!", "Author": "Mary Pierucki \"Mary\"", "ReviewID": "REJBWDYLW90JG", "Overall": "1.0", "Content": "This is a HORRIBLE camera!!! This is my 3rd Kodak digital camera.  I bought this one because I loved the other two.  It takes aweful pictures unless you are outside in the sunlight.I bought this camera in December 2008.  Took it back thinking something was wrong with it.  Got the same camera and it is as BAD as the first.  I have taken at least 500 pictures in the last 5 months trying to figure out what I'm doing wrong.  I would be nice to say that 50 have turned out good.Very pixilated, blurry pictures.  I even spent over an hour on line with Kodak trying to figure it out.  I will never buy Kodak again.", "Date": "May 21, 2009"}, {"Title": "Kodak M1063", "Author": "G. Hansen", "ReviewID": "R2I5TBFS17NFFX", "Overall": "1.0", "Content": "This camera is awful. It constantly jams in the open position and Kodak's advise is to remove and reinsert the battery. Sometime this camera won't open and then you have to plug it into the charger even though it's fully charged. Pictures are grainy. Camera is a piece of junk and I will never buy another Kodak camera again.As to Beach Camera where I bought it from - when I called them they understood my concern and issued a return authorization number. My refund was processed swiftly and accuratly. I would buy from Beach Camera again - just not any Kodak product", "Date": "September 11, 2009"}, {"Title": "Easyshare software is a pain", "Author": "MathLover \"mathlover\"", "ReviewID": "R12KY6QWBCX3IU", "Overall": "2.0", "Content": "This is an ok camera for taking family picture.But the easyshare software that comes with the camera for transfering pictures to pc is a pain.Everytime I transfer pictures using this software ( I have latest copy of it), it skips some of the pictures from transfer. I have called their support twice. They told me to do a routine - delete some files on my pc , then rename some folders and transfer again. But I have to do it EVERY TIME i need to transfer pictures. Because everytime some of the shots I have taken are not transfered to my pc.Very disappointed! Will not recommand it.", "Date": "July 22, 2009"}, {"Title": "Good in some ways", "Author": "A. C Hernandez \"trini2dbone\"", "ReviewID": "R21FHPVDQNPCO9", "Overall": "2.0", "Content": "KODAK MD1063This camera works well for a casual \"picture taker like myself.There are some disappointments:The camera CANNOT shoot videos in dim light.It does OK in hte daytime, but nothing at night or dim lighting. What's the sense in having a feature that you can only use half the time or less?The camera can supposedly be hooked up to your TV. However it comes without the required connector cable, and guess what? This accessory(cable)seems impossible to find. I haven't found it yet.Again, what's the sense in having a lovely feature that you can't use???Sorry KODAK I can't give this one more than two stars.ANTHONY COLIN HERNANDEZTRINIDAD AND TOBAGO", "Date": "February 26, 2009"}, {"Title": "A Great Little Camera", "Author": "Sterling N. Davis", "ReviewID": "REBQVL2U9JL3E", "Overall": "5.0", "Content": "I bought this camera to supplement a fuji S5100.  Because the fuji is a much larger camera, I was looking for something simple and compact.  The Kodak M1063 is compact, but it is not a simple camera.  Don't get me wrong, it is very easy to navigate the different functions.  What I mean is the camera does much more than I expected it to.  Also, the quality of pictures is good as any camera of this type that I have seen.AAAAA+++++snd", "Date": "January 29, 2009"}, {"Title": "A decent buy, but better camera is less expensive.", "Author": "Diana", "ReviewID": "R3JCGZNDYEK75P", "Overall": "4.0", "Content": "This little camera has gone everywhere with me for the last three years.  It's lightweight, easy to select lighting (flash, red eye, no flash, etc) and focus (landscape, low light, close-up, etc).  Unlike some cameras, there's not a big delay in snapping a picture and the face detection feature is great.  My daughter got the Kodak that the next step down and about $30 cheaper; she gets much better landscapes than I do, which is disappointing.  Her camera is just as easy to use.  Not sure what I paid the extra $30 for.", "Date": "September 26, 2010"}, {"Title": "Cannot see the subject on the LCD in outside sunlight.", "Author": "B. Poeschel \"dingding\"", "ReviewID": "R31O0YVOVXJNVD", "Overall": "3.0", "Content": "I like this camera really well, I am older, never had a digital camera, this looked good , so Voila>>>>> bought it.... I do not have any problems with the software, my pic's load just great....everything is wonderful...........EXCEPT......when I'm outside I cannot see the subject in the LCD, as it is too bright....inside pic's are wonderful, but cannot see anything in the LCD when outside.......other cameras have a little 'peephole' they look thru to solve this problem, but this camera DOESNOT....all you have is the LCD.....", "Date": "August 11, 2009"}, {"Title": "~*~*~*~*~GREAT LITTLE CAMERA~*~*~*~*~*~*~*~*~*~**~*~*", "Author": "Susan Fowler \"coffee lady\"", "ReviewID": "R3T6L9KGP9IQ0Z", "Overall": "5.0", "Content": "THIS IS A GREAT LITTLE CAMERA. I BOUGHT IT FOR MY 20 YEAR OLD DAUGHTER. CUTE, SLIM, FITS IN HER TINY LITTLE PURSE. TAKES NICE PICS. SHE HAS A LAPTOP AND HAD TROUBLE WITH THE LAST DIGITAL CAMERA TO PUT PICTURES ON THE LAPTOP. SHE SEEMS TO HAVE NO TROUBLE WITH THAT ISSUE WITH THIS CAMERA. I KNOW THATTECHNICALLY THAT IS NO HELP. SHE IS PICKY AND SHE LOVES IT, SO IF U ARE IN THAT BOAT, THIS MIGHT BE THE CAMERA FOR YOUR OLDER TEEN/NOT A TEEN ANYMORE! OH, AND !!!!!!!!!!!!!EXTREMELY QUICK SHIPPING!!!!!!!!!!!!!!!!!", "Date": "March 26, 2009"}, {"Title": "Mine broke after 5 months", "Author": "Bob", "ReviewID": "R2DTYX2Z5IRP0T", "Overall": "1.0", "Content": "I purchased mine and it stopped working five months later. I sent it in for repair since it was still under warranty.  The camera was repaired ( a new main flex circuit and cpu), but I also received a note saying the battery (which is sold with the camera in the same box) was defective.", "Date": "July 28, 2009"}, {"Title": "Camera does NOT stay on even when charged", "Author": "H. J. Watkins \"AlwaysUSESreviews\"", "ReviewID": "R3FO62G1F425EI", "Overall": "1.0", "Content": "I purchased this camera from Target last yr since they had a great deal being it was Black Friday! Well, the first camera I bought that day, broke 2 weeks later...it would not turn on at all...so I luckily was able to return it. But I loved the camera so I exchanged it for the same thing....this time it worked....BUT, now, it is fully charged and when I go to turn it on, it will start up like it is going to, then it shuts right down....this happened 4months later....so now, I am screwed...no returns or exchanges and I'd have to PAY Kodak to fix it....OK, so if I pay them $50 to fix it, when the thing only cost me $89....now I am way overpaying for this junk!VERY VERY VERY disappointing....I am not sure what it is with society today...we all have these great electronic tecnological tools yet they crap out on us shortly after....why???? SO WE GO BUY SOME MORE.....I tell ya, we bought a $2399 fridge from Sears...and guess what, not even a yr later, the repair man has been out 4 times replacing all kinds of parts.....yet, if you had a fridge in the 50s, the thing prob still works great!Just venting...but I would stir clear of this camera.....but don't just take my word....or this site...look at other reviews...look at my complaint and see how many others really do have the same issue!!", "Date": "October 26, 2009"}, {"Title": "great product", "Author": "O. Jenkins \"oj\"", "ReviewID": "R32PG6VS2YDM92", "Overall": "5.0", "Content": "great picture quality. very worth it overall, especially for the price. i would definitely buy this camera again.", "Date": "June 1, 2009"}, {"Title": "Kodak Easyshare M1063 10.3 MP Digital Camera", "Author": "Francine Bolduc \"Yorkie Lover Always\"", "ReviewID": "RGLD076IPKYQ2", "Overall": "5.0", "Content": "I purchased this camera for a recent cruise. This is my second Kodak Digital. It takes clear pictures with great detail. The color is great. I am not the best picture taker and mine came out great. It showed the true color of the beautiful agua blue water of the carribean and the bright island colors. The only down side I found was it does not have a view finder and if you are in the direct sun it is hard to see the picture you are taking, but not a major porblem. I also purchased a 4GB card with it. I had a 2GB. I filled them both!!!", "Date": "May 31, 2009"}, {"Title": "Quite disappointed", "Author": "Sara", "ReviewID": "R37W3DJM9VZG5Q", "Overall": "2.0", "Content": "I purchased this Kodak camera in February and was able to take it on one vacation. By early April, it was defunct. The camera would turn on but would not stay on even with the battery fully charged. Upon taking it to the repair shop I learned that it would cost more to have the camera fixed than I paid for it originally so I gave up on it. I also noticed in trying to upload the photos from the camera to my computer that approximately 20% of the photos simply wouldn't transfer. I ended up having to use a card reader to extract them. I had issues with the Kodak Easy Share Software causing my computer to freeze up and once the camera quit working, I vowed I would never purchase another Kodak digital camera. I never dropped or mistreated the camera in any way so I am still unsure why it died. Needless to say, I would recommend spending a bit more money for a nicer camera. I recently purchased a new one of a different brand and have been much happier with it.", "Date": "April 17, 2009"}, {"Title": "my comments", "Author": "Daniel T. Cavanaugh \"1golfdude\"", "ReviewID": "R1UK8FZWRUORN0", "Overall": "4.0", "Content": "I like everything about my camera and the buying experience was great.  If I had one comment it would be the instruction manual.  They lean too much on photo's to instruct you how to use the camera.", "Date": "March 17, 2009"}, {"Title": "Blurry pictures and poor picture quality", "Author": "packersmark \"Packersmark\"", "ReviewID": "R1SCL4DL1YSBCX", "Overall": "1.0", "Content": "This camera had terrible picture quality.  If this is 10 MP then I hate to see what a lesser Kodak camera does!  Every picture we took came out blurry and was very disappointing.  I ended up going back to an Olympus camera that costed a little more but has 12 MP and takes great pictures... I had an Olympus before and that is what I was replacing it with was this Kodak, however Kodak doesn't have the quality it used to... they have third party vendors making products with Kodak name and I think this must be one of them.Buy Olympus, more camera for a few bucks more but better quality photos and less problems.", "Date": "April 20, 2009"}, {"Title": "very pleased", "Author": "sweetness", "ReviewID": "R3MCL4WVJP00WL", "Overall": "5.0", "Content": "I was a first ime buyer. I was very pleased with Amazon preformance. I recieved my camera on time and the product was in good shape as stated.", "Date": "November 17, 2010"}, {"Title": "great camera but not ten mpx.", "Author": "Led", "ReviewID": "R25I854W8OFJKG", "Overall": "3.0", "Content": "its a good camera but it's not 10 mega pixels it's more like 6 or 7", "Date": "September 16, 2010"}, {"Title": "kodack red camera", "Author": "miss.tootie \"tootie\"", "ReviewID": "R1Y9FTDI2JTH49", "Overall": "5.0", "Content": "love the slim line  and all the extra and the 3 inch picture on back and the red color is wonderful", "Date": "January 13, 2009"}, {"Title": "Great Buy", "Author": "Ivis", "ReviewID": "RSLDEIUZ8ARUL", "Overall": "5.0", "Content": "For the price this is a great buy.  Easy to use and it takes great pictures.", "Date": "May 7, 2009"}, {"Title": "1063", "Author": "Aubrey Z. Honeycutt \"Writer in the making\"", "ReviewID": "R2NOT9OVLH50G4", "Overall": "5.0", "Content": "Loooooooove it! The panorama function really blew me away. I love the point and shoot quality. It focuses so fast and takes really excellent pictures. I love all the picture taking options as well; back lit subjects, far off scenery, fireworks, beach during the day. they go on and on.  Highly recommend this camera.", "Date": "June 10, 2009"}, {"Title": "Great Gift", "Author": "Mrs. Margie Dickerson \"Grandma\"", "ReviewID": "RJJLYPGWWW45B", "Overall": "5.0", "Content": "It was a wedding gift. The couple had it on their wedding gift list. They have said they love it.", "Date": "July 6, 2009"}, {"Title": "kodak easyshare", "Author": "Kathy Estes", "ReviewID": "R2RC9GYEYI6HZU", "Overall": "5.0", "Content": "Fast service [arrived a day early] seller had info to contact them if there was any issues. Product is great as well as the price. Nice doing business with you.", "Date": "April 18, 2009"}, {"Title": "Not a good camera for indoor pictures", "Author": "Jason M. Wilson", "ReviewID": "R161YHPEGFLRWU", "Overall": "1.0", "Content": "I bought the Kodak Easyshare M1063 10.3MP to replace my old 3.1MP Easyshare camera that had broken(a good camera for the time).  I thought it would be an upgrade however that was not the case.  I just had twins in December, this is when I bought this camera.  About 2 out of 200 pictures where not pixaladed or blurry.  This camera is not good for indoor pictures because the flash doesn't have enough light.  I brought it back to Bestbuy, where i bought it, and the guy agreed there was a problem with the design of the camera.  I then replaced it with a Cannon A590 8MP ($110 camera) and what a differance.  It takes great pictures for a point-n-shot.  I will never buy a Kodak ever again.", "Date": "March 2, 2009"}, {"Title": "Great Little Camera", "Author": "G. N. Thayer \"Dings Girl\"", "ReviewID": "R3EMJOVZME6L9A", "Overall": "5.0", "Content": "I really like this little camera.  It has great on-screen descriptions of the views.  You really have to buy a SD chip though because the camera does not have much memory of its own. Pictures are great.  This is my second easy share camera, so I knew it would be as good or better than my older one.  I am not disappointed.", "Date": "July 8, 2009"}, {"Title": "Taking it back today!", "Author": "B. Cook \"health nut\"", "ReviewID": "R66ZI3F6KHF5Q", "Overall": "1.0", "Content": "Most of my pictures come out blurry with this camera and I'm returning it today.  It may very well be something I'm doing wrong but I've gone through the troubleshooting and still can't get a clear shot.  I need something more user friendly I suppose.", "Date": "February 10, 2009"}, {"Title": "Not for people with astigmatism", "Author": "Angry customer", "ReviewID": "R3RGCO0E8GT5ST", "Overall": "1.0", "Content": "I bought it and began installing the software. It showed a message , you need small font. Well, I cant use small fonts. Well done Kodak", "Date": "December 23, 2009"}, {"Title": "not for everyone", "Author": "sacvalley", "ReviewID": "R3N2FCE38QKI5I", "Overall": "2.0", "Content": "This is a nice camera that I would have enjoyed except that it's not compatible with the Picasa software that I've been using for a few years. I don't want to have my photos on two separate editing/email sites.So nice camera, but doesn't play well with others.", "Date": "January 8, 2009"}, {"Title": "HORRIBLE", "Author": "E. Brune \"cameragirl\"", "ReviewID": "R2E8MUJOY0641R", "Overall": "1.0", "Content": "I just got this camera today...I've used it for 2 hours and I'm returning it today. The picture quality is horrible, I compared it with pictures from my old 5 MP camera and the old camera's pictures are better. I doubled checked that I was shooting in 10 MP mood...but 10 MP don't mean anything when the camera lens is so bad.My old camera was a Panasonic Lumix DMC-FX8, this was a great camera because of the Leica lens. I'm going to stick with the same brand, like I should have done in the first place! I'm buying the Panasonic Lumix DMC-FS3A (it's only $110 at Best Buy).", "Date": "December 29, 2008"}, {"Title": "Fast Service", "Author": "C. visa Rewards", "ReviewID": "R839DETD02CHG", "Overall": "4.0", "Content": "I deeply recomend friends and relatives to use Amazon.com for their purchases. I got great service, good price, and fast shipping. Amazon has lots of items to choose from.", "Date": "April 9, 2010"}, {"Title": "Nice Camera", "Author": "A. Barrera", "ReviewID": "R5K1HKHGT82SE", "Overall": "5.0", "Content": "So far so good, but it was a Christmas gift so we will see how it holds out...no complaints so far.", "Date": "December 28, 2008"}, {"Title": "THIS CAMERA SUCKS", "Author": "James David Gheen III \"sweetjo\"", "ReviewID": "R2YZ2RDZR9J8Y8", "Overall": "1.0", "Content": "This is a piece of crap camera. The buttons are tiny. The battery door is flimsy. The pics aren't anything special and least but not last, the, battery life is so short, i have to keep charging it everyday, even when i dont use it!!!!Kodak sucks.", "Date": "January 12, 2009"}, {"Title": "DON'T DEAL WITH AMAZON", "Author": "Camille D. Robertson", "ReviewID": "R1N7SJIS3FMHPV", "Overall": "1.0", "Content": "I ORDERED A KODAK EASYSHARE 1033 DIGITAL CAMERA AND RECEIVED A KODAK 1063 DIGITAL CAMERA.  AMAZON WOULD NOT CORRECT THEIR ERROR NOR SEND ME THE CAMERA I ORIGINALLY ORDERED .I WAS NOT HAPPY WITH THIS TRANSACTION.THEY ACCEPTED A RETURN, BUT WOULD NOT RESEND THE CAMERA I ORDERED.I WOULD NOT CONSIDER PURCHASING ANYTHING FROM THEM.", "Date": "February 10, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "10.3-megapixel resolution for stunning prints up to 30 x 40 inches\n3x optical zoom lens with optical image stabilization, 5x digital zoom, HD still picture capture\nLarge 2.7-inch indoor/outdoor color LCD; in-camera charging using the included Li-Ion rechargeable battery\nBlur reduction technology; High ISO (up to 1600) captures the details in low-light conditions and fast-action situations\nCompatible with SD/SDHC memory cards (not included)", "Name": "Kodak Easyshare M1063 10.3 MP Digital Camera with 3xOptical Zoom (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/513fqEfW8xL._SX300_.jpg", "ProductID": "B001BX4NSK"}}