{"Reviews": [{"Title": "Very Good Camera in Low Light", "Author": "M. L. Chesner \"CRCHAIR\"", "ReviewID": "R8PABMA3E1IUX", "Overall": "4.0", "Content": "This is a great little camera.  It takes very good pictures in all light situations, but is especially good in low light when compared to other digital cameras.  I brought this along on a recent outing to New York City and didn't use the flash at all.  As with all cameras, not every picture taken in low light is perfect, but this camera does a better job than any other camera I have owned which includes other Sonys.  It is about the size of a deck of cards, so although it is larger than some cameras in Sony's lineup, it is still small enough to fit into your jeans pocket without feeling like the whole world knows what you are carrying.", "Date": "June 13, 2008"}, {"Title": "Amazing - another great Sony!", "Author": "DocRWM \"docrwm\"", "ReviewID": "R3APGXE1EKLT5T", "Overall": "5.0", "Content": "This is the 6th Sony camera of camcorder that we've owned.  My wife wanted a slim camera to carry in her purse for shots of the children at outings and such.  We already own the Memory Stick media and NP-BG1 batteries and chargers so a Sony that uses these was our first choice.  No one, NO ONE, else had the new DSC-W150 or W170s on discount other than Amazon when we bought ours.  The Smile technology and child first choice are AMAZING.  The quality of the pictures is terrific but the ease of point and shoot with presets or all auto is great for pull it out on the spur of the moment, turn it on (fast), point and shoot!  The quality of the Very Fine movies is also really amazing.  I know that its still 640x480 video but 30fps and the speed of the new Mark 2 cards makes this usable footage - its not the same as our Sony DVCs but its good enough and its with us ALL THE TIME!  Wow.  Great 5x optics, wider angle than the W150 (which is nice as many slim cameras make it hard to do photos of groups unless you are way back), and it uses the NP-BG1 and newer NP-FG1 battery packs so its compatible with our DSC-H7 and its support materials!!UPDATE: Nov 12, 2008:Well, we've had it for several months and two big trips.  We took over 2000 photos with it during our week at Walt Disney World.  I also had my Sony DSC-H7 with us.  After the first day and comparing the two sets of photos that evening, I carried the W170 for the rest of the trip.  Its SO much smaller, took great photos, and was easier to use (also was easier on the battery) that I took more photos than I otherwise would have with the bulkier camera.  The Videos, when converted with Vista to DVD, are AMAZING!  Are they as good as our Digital Video tape Sony?  No, but then again this camera is 1/10th the size!  Just plain impressed with the performance of this little camera.", "Date": "July 27, 2008"}, {"Title": "poor image quality, but otherwise very nice", "Author": "Ed Sejud", "ReviewID": "R39A6OV0QRGW24", "Overall": "3.0", "Content": "I bought this camera because the consumer reviews were excellent, and my first impression of the camera was very good also, based on size, handling characteristics, and the way photos displayed on the 2.7\" screen on the back of the camera.  However I had business distractions and didn't display my photos on a full-size screen until after the Amazon return time expired. The image quality of my camera (perhaps I have a lemon) is very poor when compared to my three year old Olympus point-and-shoot.  I was shocked at how \"soft\" the images were when viewed on a 15\" computer screen.  I took identical comparison shots using a tripod and self-timer to verify that I wasn't seeing motion, but in sunlight or low light, the images are visibly and objectionably soft.  Around bright patches, such as sky showing through the leaves a tree in the foreground, there is heavy blue fringing, and some sections of the photos are \"foggy\" as though a fingerprint was on the lens, but there were no fingerprints or debris on the lens.  There are noticeable blotches of off-color (like \"noise,\" but bigger) in shadow areas, even at low ISO.  I should have tested the camera better, sooner, and I blame myself and my schedule for not doing that.  Here is the lesson:  (1) Don't buy a camera unless you can thoroughly test it immediately, including judging the image quality on a large screen, not the screen on the camera. (2) Order the correct memory chip the first time, so you don't get delayed waiting for the correct chip to arrive. This Sony is not compatible with all SD memory chips. (3) Compare the camera against another camera of known qualities, but do in time to take advantage of Amazon's return option.  I've shipped my camera to the repair center in Texas and it hasn't returned yet.  If they fix it satisfactorily, I'll amend this evaluation to say so.OCTOBER 17, 2008 UPDATE:  The camera was promptly returned from Sony service in Texas with no notation or explanation regarding what repair, if any, was done.  The post-return images seem very much like the former ones I complained about.  However, I have softened my criticism a bit because I think my original expectations were too high.  This is a quite small, light, easily carried and concealed camera with intuitive controls and it has a reasonable optical viewfinder.  For it's size, it does the job well enough, so, in retrospect, I think I was expecting a bigger camera's performance from an instrument I purchased on account of it's very small size.  That expectation might have been unreasonable in some degree. I also have a Canon G10, which costs twice as much and is two and a half times heavier.  The Canon takes lovely pictures, but I find myself carrying around the Sony most often because it is so small and so light (6 oz. with battery), which is a compelling argument in its favor.", "Date": "August 16, 2008"}, {"Title": "Way To Go Sony!", "Author": "Brandie Woodward \"Spock4Pres818\"", "ReviewID": "R3Q3A32UBGQF1R", "Overall": "5.0", "Content": "I just got my Sony Cybershot today to replace my horrible Casio Exilm, that I was so disappointed in.  I took this out of the box, and I immediately loved it before even putting the battery in.  It is the perfect size.  I myself don't like the extremely thin cameras.  I find them more difficult to get a good grip on to take a good photo.  This is very comfortable to use, and I love how easy the controls are and the handy dial to change the photo settings.  It is still small enough to fit in your pocket.  The color is so nice.  Just so you now it is not really red, it is more of a magenta or deep pink color.  So, if you want a deep red color, you might be disappointed.  I took some test photos of my cats, and I loved them.  They were ten times clearer then they would have been on my Casio camera.  The color came out so nice.  The video  is nice too.  I like also you just pop the battery out to charge, and the charger is not big and bulky with a long cord.  You just plug the battery in, and the whole charger just plugs into the wall.  I have a mac so I didn't need to use the software or install anything for it, so I cannot comment on installation, but I am sure it is not a big deal if you have a PC.  It works great with iPhoto.  The only thing I was disappointed in, is that you cannot adjust the zoom when filming in video mode.  I am so happy with my choice, and I am selling Casio camera on Ebay.  Highly recommend!", "Date": "May 23, 2008"}, {"Title": "Very Good Features & Quality, But Oversimplified", "Author": "Dean Segal", "ReviewID": "R8JZOKAN35Y3W", "Overall": "4.0", "Content": "Love this camera.  Great low-light capability, zoom of 5x is very useful (and the wide 28mm is good), nice pocketable size, good control layout, fast response for shooting and playback even with the high 10.1 megapixel, good screen clarity, (but wierd slight lag in \"focusing\" in reviewing - why?).  Also selected this because one of the last remaining series with an optical viewfinder for when it is very bright outside or when my reading glasses are not handy, (just wait- it will happen to you too).  I think only Canon still has optical viewfinder models available.  Viewfinder is  only approximate of real view at various zoom levels, but errors on side of giving more than you see, which is good - you can always crop later.  But my real beef is that with all of this face and smile detection junk, (come on, do you really need a smile detection with such settings as child vs. adult, etc?), they should have kept some way to choose aperture or shutter priority.  As a minimum, there should have been a \"sports\" or \"action\" mode and a \"near & far focus\" mode.  Anyway the camera is fast (high EV), so in many cases, action blur is not a huge problem.  The shutter button is elongated and you need to be pretty well centered on it for proper actuation - surprising quality design slip for Sony.  Like I say, love this thing but I give it 4 instead of 5 stars because of of the drawbacks indicated.  One of the best choices out there overall.", "Date": "June 22, 2008"}, {"Title": "Outrageously awesome!", "Author": "Glennpok", "ReviewID": "R11523A9UGQG4V", "Overall": "5.0", "Content": "Outstandingly sharp and clear pictures! Movie mode very clear as well even when my niece was jumping on the bed, it was not blurry thanks to the optical image stabilizer.  Solidly built, well-made. 5X zoom is more than adequate.  Sony didn't goof on this one!", "Date": "May 30, 2008"}, {"Title": "Impressive Camera!", "Author": "snapshot shooter", "ReviewID": "R3N87LEX45V1OD", "Overall": "5.0", "Content": "I am not a professional photographer but I enjoy taking pictures.This camera lets me do just that.I find myself looking for things to photograph as I'm driving or walking..some times it's very annoying because it's a little hard to turn that, \"lookin for shots\", off.It's like ,if I said to you DON'T think of the color Blue!The camera is easy to carry,so I take it everywhere.The batteries have not run out on me yet,but I do recharge it every night.I think the video it takes is really good but not as good a camcorder.So camcorder=9.5/10 and Sony DSC-W170=8.5/10.Also,erasing a shot you just took and did not like is fairly easy, but yet, just difficult enough that you won't erase by mistake.There are a lot of \"practical\" features to this camera,some I've discovered just playing with the camera.But some you must read the user manual.The camera also has a \"Users Handbook\" which I feel is better than the Owners Manual but they both have very useful information for the camera.I really like taking a picture,seeing it immediately,and knowing if its a keeper,or,I need to take it again.Result...you have a camera full of pictures you want and no bloopers.Next..upload to a computer or printer for hard copy pictures or e-mail to whomever you wish!One last comment!Another reason I purchased this camera was the combo of 28mm\"Zeiss\"lens with 5x OPTICAL Zoom.Together they make a fine combination for taking great photos and you don't have too be a genius.I hope you will enjoy this camera as much as I do!Well,as they say..It just does'nt get any better.If you buy it,they will come...beautiful pictures that is!", "Date": "June 8, 2008"}, {"Title": "Seems like a good camera", "Author": "bio_hazard391", "ReviewID": "R327S3Y483D6Q", "Overall": "4.0", "Content": "I don't actually own this camera, but I was looking at buying either this one or the W150, which is slightly cheaper.  I went with the W150, but I tried this one out while I was comparing the two, and since I don't see any reviews for this product yet, thought I could help out with what I know about this product.This camera has a slightly wider lens (28mm) than the W150 (30mm).  Another difference is that the W170's battery power is marked on its retail box as slightly less efficient than the W150's.Obviously the main reason this camera is more expensive than the W150 is because it goes up to 10.1 megapixels, while the W150 only goes up to 8.1.  More megapixels in the 8-10 scale shouldn't be a big concern, because unless you are taking large scale poster pictures you don't necessarily need a camera with a megapixel rate of over 5 megapixels.  I tend to keep my megapixel setting low because when the photos are uploaded to a computer, I don't like dealing with large file sizes.  However, I suppose having the option for that extra megapixel setting can be good to have, in case you would like to take a large cropped picture.Overall, when I was testing out the camera I didn't find it to be really any different than its counterpart, the W150.  Besides what I mentioned above, it's virtually the same; 5x optical zoom, optical viewfinder, 2.7\" screen, same camera settings.  Pretty much it comes down to how many megapixels you want, and contrary to the popular belief, the average camera user doesn't need double digit megapixels.  I bought the W150 simply because I didn't think the 2mm additional lens width and 2 extra megapixels that came with the W170 were enough to shell out an extra 50 bucks.  Still, if you feel you want those slight upgrades, then by all means I'd say buy this camera.  I enjoyed using it, I just didn't see the need for those slight upgrades when the W150 suited me fine.", "Date": "May 20, 2008"}, {"Title": "Yes another sony", "Author": "Skullie \"AmericanEuro\"", "ReviewID": "R3PX3B1HE9NP9J", "Overall": "5.0", "Content": "I bought this camera to replace my Canon SD700IS which i was never very happy with.  I had a sony 7.1 megapixel before but it was stolen and i replaced it with the Cannon due to all of its \"great\" reviews.  I never liked the dreary picture quality of the Cannon and i compared my old SD700 with my new Sony and OMG I finally have a camera that takes great colorful and vibrant pictures.  The picture quality is remarkably better than the Cannon.  Although i have yet to use many of the other features on the camera, i am extremely happy with the one feature that matters most and that is PICTURE QUALITY", "Date": "July 29, 2008"}, {"Title": "Better than Canon", "Author": "Ian Jennings", "ReviewID": "R1Q0QKQQ3A88KJ", "Overall": "4.0", "Content": "This is a great little camera. I especially like the viewfinder, so that in sunlight, you can see your subjects easier. I purchased a Canon Powershot A720 IS, but sent it back, as the viewfinder and actual view were miles out. Unacceptable by Canon's standards I believe. This Sony is more expnsive, but a better performer. Thr viewfinder is not perfect, but more accurate than the Canon. One doesn't expect single lens reflex standards, but the Sony is good. Using the viewfinder, you need to get as much as you can in the view itself though. The camera manual is only on the CD, but there is a brief version in paper. The sensor seems pretty good tp me, and the preview screen has a high refersh rate (I believe that is the correct saying...) Lastly, this fits in your pocket, yet still gives a great performance.", "Date": "June 28, 2008"}, {"Title": "Perfect-almost", "Author": "J. Spence", "ReviewID": "RO48L7LU95AJD", "Overall": "5.0", "Content": "I purchased this from BestBuy just because I didn't want to wait for shipping and I needed a camera this weekend. Anyway, after going through a few Kodak digital cameras, first a 5 MP and then a 8mp I upgraded to this wonderful Sony 10mp that is just fantastic. I had it out of the box and taking pictures within 5 minutes. I posted a fantastic picture of a butterfly under product images. That was taken impulsively in easy mode.I love the smart smile technology, what a spectacular idea that was. To those of you who are unfamiliar with that technology as I was smile shutter will wait for the subject being photographed to smile. It displays a smile meter and when the perfect smile is made it knows just when to take the perfect shot - it's awesome if you learn to use it correctly.I also appreciate the fact it has built in slide show feature with music. The single USB & A/V cord makes it easy to connect to a computer or a TV. At first I did not know if I liked the fact that I could not choose the perfect scene mode but I will tell you that this is one smart camera and consistently and flawlessly will choose the best conditions to shoot the picture.This also comes with a rechargeable battery with charging station that is a sure winner. The only thing I can think of that I wish this had was a Panoramic mode that \"stitched\" together multiple photos like my kodak did on board the camera. But thats what photo editing software is for I guessI also enjoy messing around with black and white photographs. If you place this in personalized mode and select B&W; color mode it will take B&W; photos that will blow you away.Bottom line: If you are considering a camera that is above a entry level camera but not quite a SLR but is capable of producing \"WOW\" photographs, go to an electronic store and give this one a try, you probably will not be disappointed.ADDED AFTER 3 MONTS OF OWNING:Still am happy with this camera. One drawback is although it has a lot of buttons and features which I enjoy, there are stff limits as far as shooting your pictures in a manual mode. Also, I am having trouble in almost any mode of the camera noticing different shades of red. E.g. if shooting a red flower with all red leafs but at different depths, the camera just sees a blob of red. Now having it, I sill like it lots, might drop to 3.5 to 4 out of five on stars. Still worth looking at but I may have bought a SLR camera though more expensive, but I do like this size. I am torn on my review of this. In ways I enjoyed my 8mp Kodak better. Also, no panoramic mode on the sony.****4/2010 UPDATE****I still love this camera! It has become my baby. I purchased a spare battery pack and with two I never run out of juice. I also purchased a Nikon D60 (DSLR) camera and extra lenses. Why am I telling you this? Because I still find myself grabbing this Cybershot when I run out the door. I recently took a trip to Las Vegas and brought only this Sony. I left the Nikon at home because of it's size and price is something happened to it while in Vegas. Anyway my point: when I returned home I posted my photos on my [...] site and a few days later a friend of mine who happens to be a amateur photographer complimented me on my night shots of Vegas. He started inquiring into the settings I was using and I realized he thought I had used my professional Nikon camera to take these pictures. He was shocked when I confessed that the pictures he liked were from a hand held point-and-shoot camera.The overall point I am trying to make is at first I wished there were more buttons and configurations to play with. Now however I see the ease of simplicity and how beneficial that can be. I have also learned that if you take care of this camera, it will last years and I also think having to use 'Sony parts\" such as batteries, memory sticks, seem to also be nice because everything works flawlessly together, consistently.Complaints: Still wish it had a panoramic mode that 'stitches' a series of usually 3 photos together such as available in Kodak and others.Other note: after using a Nikon D60 DSLR I have noticed that the sharpness on the Sony is not quite as good as a higher priced or quality camera but don't misinterpret that because the Sony does take great clear, sharp pictures, I am talking about being able to see the fuzz on a plant leaf or something that small. I developed, or I guess 'printed' is the proper term now, 300 pictures just to have hard copies, just at my local Wal-Mart because its cheap, and they all came out just as good as any film camera (not professional level) I have ever owned - just to clarify.Also, 8/10 times I find myself using this over my Nikon D60 as I can just grab it, put it in jacket/pocket and go. Very easy to travel with!!!************10/2010 UPDATE *****************Still love this camera - have been looking at some of the newer models coming out for point-and-shoot cameras but I must say this has held up very well and still works like new. I have taken this camera to biology and anatomy lab for school and it's been spectacular. After having this for a few years now, I know I got my money worth out of this product! I don't know if I could ever part with it.", "Date": "September 6, 2008"}, {"Title": "Pretty close to perfect", "Author": "M. Johnson \"lavenderwings\"", "ReviewID": "R3MJ61JEB9JEVU", "Overall": "4.0", "Content": "As an owner of several digital cameras over the past 10 year, here is my opinion for what it's worth.  I put a lot of thought and research into choosing this camera and while I haven't owned it long, I plan to update this as I learn.The camera really rocks in many categories.ProsThe screen is beautiful, not bad even outdoors.I love the red color of the camera!The scene selection should prove helpful, haven't used it yetZeiss lenses do seem to be very high qualityThe flash is one of the features that closed the deal for me.  I tried all of the cameras at best buy side by side. When taking a photo inside with a flash, many cameras, including my old canon made everyone look white and washed out while the background was very dark or even blank. Not on this baby. The color, indoors and out, foreground and background really seems well lit and very even in tone.ConsLose the smile thing, both for picture taking and editing.  The one in editing is just creepy looking.Want really creepy photos? Make the person have a smile intensity of 5, and then do it again and again and again..... It looks like a worm stretched across their face. Also doesn't detect faces if they have mustaches.This seems designed for a lot of portraits, but I like landscapes and sports events.Where is the panoramic stitch type help? One of the cameras out on the market right now has it where they show a little bit of a ghost image of the last shot to help line up the panoramic shot.  Even my cameras that are 5-10  years old had something for panoramic.Can't they add the little plastic thingy that tightens around your wrist so you don't loose this $300 gem?Why no sport mode?I want pics of kids at their sporting events and such, still trying to figure out how to take good photos inside with poor lighting and speedy kids at volleyball. They are ending up blurry.  I am sure there is a setting that will work, just not sure what it is yet.I do like how some of the other models have lenses that don't stick out and move, so particles don't get caught in them.Why does the underwater case cost nearly as much as the camera?Looking for a good blog to learn tricks about my new toy...", "Date": "September 15, 2008"}, {"Title": "Excellent Little Camera", "Author": "TheNewJane", "ReviewID": "R2FDCJZEWLS1K5", "Overall": "5.0", "Content": "I have been using this little camera for a couple of weeks now, taking photos daily.  I am very pleased with its compact design, ease of use, crisp clear photos and convenience.  I often wear it on a neckstrap and tuck it in my pocket.  It fits in a little pocket in my small purse and goes everywhere with me.  I am particularly impressed by the quality of the macro shots of flowers that I love to take.", "Date": "June 13, 2008"}, {"Title": "Sony Cybershot digital pocket camera", "Author": "R. L. Autrey \"Anime fan\"", "ReviewID": "R16FT3ARY6CMYR", "Overall": "5.0", "Content": "The Sony model DSCW170 camera is entirely satisfactory, considering its size and cost.  It produces very beautiful photos of architectural and landscape subjects; it is harder to use for good photos of people because of the inherent delay of a fraction of a second between composing the picture and actually capturing it.  One comes away with more respect for the daguerrotype photographers, whose models had to be still for minutes, not just a fraction of a second.  It is annoying that it is not shipped with at least a one GB memory chip; the chip is a separate purchase, from a separate supplier.  Unless you are using the full 10 megapixel image quality, the four GB memory chip I purchased is probably overkill - it permits you to store more than 1000 photos at 5 megapixel quality.", "Date": "August 29, 2008"}, {"Title": "Poor image quality, poor fit an finish", "Author": "service-specialists", "ReviewID": "RAOCXH3TMYEV4", "Overall": "2.0", "Content": "Don't make the same mistake I did and buy this camera based on all the \"great\" reviews here.  Most people writing reviews here are amateurs (since only an amateur would buy this camera) and don't realize just how awful this camera's images are.  I bought this camera for my sister after insufficient research, only to be shockingly disappointed.The images are simply incredibly noisy, and Sony tries to cover up this massive shortfall by adding massive amount of digital \"noise correction.\"  What causes all this noise?  This is simply a bad camera with a very insensitive CCD.In very bright light, you will see noise even in darker colors.In medium light or with a flash, you will see noise in all shades except whites and the brightest colors.  This is how most of your pictures will look, like junk.In low light, the noise problem is so overwhelming that \"noise reduction\" kicks in, trying to hide the fact that this is a poor quality camera.  The \"noise reduction\" basically makes the image look like a pastel painting, and removes pretty much all the fine and even not-so-fine detail.The end result is you will get less detail with this \"10 megapixel\" camera than I did with an Canon 4MP camera 6 years ago.  If I had to rate the image quality, I'd say the camera takes pictures with about as much detail as a decent 3 MP camera.The build quality is also lacking and unsophisticated.  Though the camera looks nice in pictures, it feels cheap in your hand.On the positive side, the 5x zoom is nice, and so is the user interface.  Buy the 8 MP Canon, it is cheaper and takes much much better photos.", "Date": "December 4, 2008"}, {"Title": "Read reviews- tested- disappointed", "Author": "Katja Roessner \"Knuti17\"", "ReviewID": "R3DTBULXYL4ANA", "Overall": "3.0", "Content": "Thought I am a pro after years of photography and wanted to replace my old Canon Ixus 40 now. The new camera was supposed the ONE for snapshots, outdoors, indoors, everywhere! Nothing big to carry and always in reach. Did research the internet, read all the reviews of you guys and made decision to order the Sony DSC-W170 camera. I did like very much all the design stuff, fancy functions, the wide angle and zoom BUT....when it came to moving targets (like my 2-year old) and in addition to that it was indoors- then sorry folks, but this was very much unsatisfying! To resolve the issue with the trick of going up to ISO400- sometimes it works, sometimes it does not! The high ISO already starts to demand ist contribution and as a matter of fact its more a matter of luck than something you have control over. Wish the camera would allow me to fix the shutter time and would adjust the rest automaticly- without exceeding useful ISO- values. I would still have the flash- option to make sure I am not demanding too much. To summarize: besides all the great features, nice design etc. I have to send it back. Because Amazon has outsourced that part to an alternative provider I am loosing 15% of the value in the first week already by opening the package- bit of a shame! Have to test next time the camera of my fortune at Best Buy and then order it at Amazon, if its worth. Lessons learned!", "Date": "June 15, 2008"}, {"Title": "sony makes the best", "Author": "Hasan Huseyin Aktas", "ReviewID": "R2SIIR6X0WGCMU", "Overall": "5.0", "Content": "i highly recommend this prodct of sonydont trust all the reviews.some people just dont like one thing about the product and can give low stars.this is a great camera if you are not a professional.if you are, you can buy these complicated ones...i bought it for myself and very glad to use it,battery life is great as i read from the reviews.", "Date": "May 30, 2008"}, {"Title": "So much better than my old Canon...", "Author": "A. B. Mason", "ReviewID": "RD68PDCVAFF2K", "Overall": "5.0", "Content": "My last camera was a Canon, and I was never satisfied of indoor shots (usually of my cats).  I should also note I have fluorescent lighting, that added to the problem.  I reviewed Fuji, Panasonic, Canon, Olympus, and Sony cameras before making this purchase.  The first two pictures I took when I got home almost blew me away.  The sun was going down, and all the lights were off in the house, and the high ISO setting and Easy setting was still turning out some really nice pictures.  You need a tripod for the twilight setting, but other that that, this camera is *awesome* for indoor shots.", "Date": "August 3, 2008"}, {"Title": "Perfection.", "Author": "D. Callahan \"artsy chick\"", "ReviewID": "R2G2IE3L2XL9B6", "Overall": "5.0", "Content": "I recently purchased this Sony Cybershot model. This camera is amazing in every way.  The pictures come out crystal clear and bright on the camera and computer. I took a picture of a bee on a flower and set it as my desktop. The picture is so clear and vibrant, even enlarged, that I can't help but stare. Even I, an impatient teenager, have no problems with shutter lag. I snapped pictures of road signs from a moving car on the high way and still managed to get clear and readable signs. I have nothing to complain about. The only thing is, I would suggest purchasing a second battery, as this fun to use camera will have you snapping away. Before you know it the battery is gone. Also the charger that comes with it is untimely sluggish. No complaints about the camera. Sony has made perfection.", "Date": "July 17, 2008"}, {"Title": "The Image Quality Is Manageable", "Author": "Randall Culp", "ReviewID": "R10RLLG2OWQ1T4", "Overall": "4.0", "Content": "I agree with the \"poor image quality\" review and would add the following comment:  The camera appears to optimize speed of the shot with available light by summing pixels together, hence the objectionable softening of the image.  It's trading off the blurring of a slow shutter with the blurring from putting pixels together to get enough light.The camera also gives you some control of the processing through the \"Program Auto\" mode, where you have access to settings like ISO (film speed).  When I switch from Auto Adjustment to Program Auto and set the film speed to 80, which forces the camera NOT to sum pixels (much), the resolution of the image is quite visibly improved.  Because I've slowed the camera down, though, using this setting frequently requires a tripod.  I get acceptably sharp images in natural light when using ISO 80, and if necessary can experiment with turning off other corrections like the Dynamic Range Optimizer.With all that said, I got this camera for snapshots and for that purpose it cannot be beat.  Yes the softening of the pictures gets worse in low light (pixel summing again) but the camera gets good pictures in ridiculously low-light situations.  I have found virtually no situation in which I could not get the shot, in natural light, no matter how little of that there is.The camera is pocketable, slim, lightweight, and that automatic optimizing means it's always good for the shot.  For those reasons, this is the camera I use.One objection:  mine has an annoying habit of spontaneously switching modes (display mode back to camera mode, or auto to easy and then back).  It's intermittent -- it comes and goes.  It has not yet stopped me from getting a shot, just a nuisance.  Don't know if it's in the design or just a problem with my camera.", "Date": "December 29, 2008"}, {"Title": "Great ~ Quality camera!", "Author": "J. T. Fears", "ReviewID": "RR5F858OVBM94", "Overall": "5.0", "Content": "I'm not a professional but am very picky about my photos and picture-taking.  The Super Steady Shot guarantees a great picture EVERY time and with awesome color/clarity.  Other great perks about this camera include the red eye reduction, face detection, smile detection, White Balance, awesome REC mode for continuous shooting, Scene Recognition, Underwater mode (you have to buy the special case for this), and editing modes from the viewing menu...  the list goes on and on!  Both I and my husband are blown away with this camera.  We have friends that own other Sony Cyber-shots and they are very happy with them.  This is not a touchscreen... if you are looking to buy a touchscreen be very careful with it.  I know someone who had it in his pocket and hit something which busted the touchscreen. This was not replaceable and unfortunately ruined a good Sony Cyber-shot.  He turned around and bought another one.  They are GREAT cameras!", "Date": "August 1, 2008"}, {"Title": "Best Camera for Realtors and Appraisers", "Author": "Mr. Scott R. Reineke \"TwinsFan\"", "ReviewID": "R1YBDX2ZDI8HLA", "Overall": "5.0", "Content": "I am a realtor who has spent nearly 5 weeks testing cameras to use that can fit rooms into one shot.  I have 4 sony cameras. H3 W70 p10 and the touch screen N1 which is my personal favorite.  I am a sony guy, but I needed a 28mm wide angle camera. I tried the Panasonic tz5 and the Panasonic fx35 which is a 25mm wide camera but has no zoom.  I went to Best Buy to buy the Tz5 for 350.00. I told the salesgirl that I wish Sony made a wide angle camera and she said \"they do!\" My descion was that I would try it since I already had 2 extra BG-1 batterys (which work for all the new sony's) and memory sticks so I saved on the extras.  I bought the W170 on the spot went home and took some photos of a couple of rooms at my home. WOW!!! I can tell you right now that this will replace my N1 and my H3.  Too bad it does not have the touch screen like the N1 but, the 1st 40 pictures printed so nice that I am willing to wait until Sony builds me a wide angle camera with a touch screen.", "Date": "July 19, 2008"}, {"Title": "Motor stopped in 6 weeks, Made in China unlike most Sony", "Author": "G. Hoefer \"Hoefdaddy\"", "ReviewID": "R2J0J408YWMHAR", "Overall": "3.0", "Content": "Loved the camera from the moment I bought it, great zoom, great functions. I have owned a many cameras and was very happy about the versatility and clarity of the W-170. One sunny day I took a round of 10-15 fotos, pressed the power button to turn it off....the lens failed to retract all the way.Now just 5 weeks after purchase I have sent it to the service center.One more piece of advice. I used to work at Best Buy, their replacement/repair service is great and on the spot. I regrettably bought this camera at Sonysyle store and when I tried to get a new one just one week after their 30 return policy with my 3 yr service agreement, they said I had to ship it to Laredo, TX and it would be 10 days to 2 weeks to service or replace and I had to pay and ship it myself...Best Buy, Never!I have tracked the status of my W-170 that I sent last week. USPS said it was delivered on June 21st, now it's June 25th and they have no record of it.It does take incredible shots and the smile function doesn't work well!", "Date": "June 25, 2008"}, {"Title": "Great for the price, but not as good as the older cybershots..", "Author": "AkaTako-net", "ReviewID": "R317R6ZLBJIGJK", "Overall": "2.0", "Content": "I bought this camera to replace my older Cyber-Shot (DSC-W5). I was very excited when I received it because I really loved my old camera - wore it out in fact! But after trying for a month to adjust to it, I am really disappointed. Pictures in low light are grainy no matter what MP setting I use. Auto-focus doesn't work so well. Bright colors are super saturated. Response time for pushing function buttons seems slow (like review, menu, changing from auto to landscape, etc.).It is a great price for a cheap, decent camera. I guess I just got spoiled with the older version? The newer one is not nearly as good. I wish I would have spent the money on getting the old one repaired instead of wasting it on this one.", "Date": "September 30, 2008"}, {"Title": "E91:01 error", "Author": "tech & wine guy", "ReviewID": "RWEM2U642UQK7", "Overall": "1.0", "Content": "The camera is good. But only after 2 weeks of use, I got the E91:01 error. (Google for it). Initializing the camera didn't help. Sony's online chat support was profoundly uninformed and unhelpful and asked to send the camera back for repair (shipping costs mine) since as per the \"analyst\" it has an internal malfunction. So now I have a camera with no flash. I can take pictures fine except have to turn off the flash.Anyways this is going back to Amazon. They already issued an RMA. So buying this camera is a gamble -- a significant number of people get the E91:01 error and Sony's tech support is clueless.", "Date": "January 6, 2009"}, {"Title": "Sony Cybershot DSCW170/R 10 with 5X Optical Zoom", "Author": "Reds the Best", "ReviewID": "R195EEYJ97IRL5", "Overall": "5.0", "Content": "I researched and compared cameras for a couple of months before deciding on this one.  I also have a Sony Cypershot 15Xzoom DSC-H7.  We bought a Nikon Coolpix L18 for our son, which I would NOT recommend. To me Sony's are the best!  My little red Cypershot is GREAT!  To this day, I still haven't sat down and looked at the manuel, but it's so easy to use, takes great pictures and it fits in my pocket or purse.  I'm sure once I really check out what all the features of this camera, I'll find it even better!  Thanks!", "Date": "October 4, 2008"}, {"Title": "Sony Cybershot DSCW170", "Author": "J. Kovatch", "ReviewID": "R3T5PH58YBZMDL", "Overall": "5.0", "Content": "Works perfectly. I especially like the Super Steady Shot feature, none of my shots are blurred.", "Date": "August 29, 2008"}, {"Title": "Sony's top of the line Cybershot", "Author": "Scott A. Ingalls \"Ingalls Angels\"", "ReviewID": "R2JTFJIKWGPQU7", "Overall": "5.0", "Content": "http://www.amazon.com/gp/product/B0012XZQGC/ref=cm_cr_rev_prod_titleI've been very happy with this new 10.1MP model.  I had two of the older models, they were decent, but not special.  The DSCW170/B has integrated all the features Sony offers into this camera, the result is something special!  Honestly, I get the same quality pictures with this camera as I do my DSLR.", "Date": "July 30, 2008"}, {"Title": "Take a look at some pictures on line.", "Author": "Robert Grant", "ReviewID": "R1RNQZAXGPD36I", "Overall": "5.0", "Content": "I always like to wait until I have used a product before I say anything good or bad about it.  So far I have been pleased with the camera.  For the price of the camera the pictures I have taken and the movies I have made are very good.  The only bad thing is pictures taken using the flash don't turn out very good.  But you can take pictures in low light that do turn out good. For a look at photos and videos taken with the Sony DSCW170 on line use this link.  Copy and paste.  [...]Click on the Traveler Videos to see some videos taken with the camera.  The videos will look a little choppy due to the web site's size limitation.  You can also see some raw photos taken with the Sony. Click on Traveler Photos, look for the ones labeled rangerbob1957. The battery time is good even when making videos but is sure is nice to have a back up.", "Date": "November 23, 2008"}, {"Title": "only small complaints", "Author": "Amy Warfield", "ReviewID": "R321HRQPLQJRFI", "Overall": "4.0", "Content": "Well this camera seemed amazing at first. It took clear pictures most of the time. But as i started to use it more and in different kinds of lighting that you can forget taking a decent picture after sundown. The image stabilization is poor and you have to fight the camera to focus on up close objects clearly.HOwever it is a good camera and sturdy, takes great pictures during the day time though its focus is still off. or maybe thats just me? Sometimes ive gotten the shot i wanted with a bit of luck. My complaints about this camera are common for newer sony cybershots. You can't get everything you want in one package...", "Date": "November 10, 2008"}, {"Title": "Not for everybody", "Author": "Carlos de Palo Alto", "ReviewID": "RLZ4BGYWFJJRX", "Overall": "4.0", "Content": "This camera gets a bad rap because of focus problems, but its fine lens compensates for its shortcomings.  I was very unhappy with my photos until I stopped using most of the automatic functions.  I recently took the camera on a hike and took over 200 shots, of which 15 were out of focus (most at 5X).  Wide-angle shots with this camera came out great.  I only shoot in Program Mode, with ISO set at 200 to force the camera to use a faster shutter speed.  I use central point autofocus, and almost always use the 2-second Self Timer, particularly at 5X.  The lens on this camera has great depth of field, so scenic shots are quite impressive.  I only use the Normal color setting, because the Vivid setting is total overkill.  I do not use the Auto White Balance either; I set it to the type of light which is present.If you are a casual shooter, you will probably be dissatisfied with this camera.  I can't understand why Sony didn't do better testing before releasing this model.  I don't care if it has a 9-point focus system;  I'd rather have 1 point that works than 9 that don't.  But if you do not need a camera for action shooting, I think you will be very happy with the results for most other situations, especially scenic photography.  Just work around the camera's limitations.  Good color, good white balance, good lens, good detail!", "Date": "February 23, 2012"}, {"Title": "horrible image quality - image quality like 3MP", "Author": "crayzeeshopper", "ReviewID": "R3HQ9ORRGSJIBV", "Overall": "1.0", "Content": "I fell for all the \"good\" reviews on the product here and purchased one of my own.I used to be a Sony fan. I would only purchase Sony cameras, my last camera was a DSC-S600 6MP (Sony Cybershot), and I was excited to purchase a new camera after my old camera broke. After using this camera, I will never buy another Sony again. The Sony's back in the day were made with great quality, but it seems like the only thing Sony has going on for them now is their brand and not their actual products.The pictures are really grainy in any situation. The subjects do not have strong edges and everything is really fuzzy. The only way you can get \"okay\" quality pictures out of this camera is if you take Macros, but even those are full of noise. If you like crisp and clear pictures of your subjects, then this camera is not for you.My old Sony was Made in Japan, but this one is Made in China, maybe this has some significance as to why the quality is so cheap. It feels really cheap to the touch and it has a poorly made shell.My old Camera 6MP, takes hands down clearer and better pictures than this camera. Even though this camera is advertised under 10.1 MP, really you will be investing in a 2-3MP Camera.Save yourself the trouble and hassle of dealing with a poor camera and go with Canons instead.", "Date": "July 10, 2009"}, {"Title": "focus was out but sent it back.", "Author": "jerbo56 \"jerbo56\"", "ReviewID": "R23TPW3BANKT7L", "Overall": "4.0", "Content": "I got this camera as a gift and have been using the dsc p200. Wanted to upgrade to the 5x optical with a 10 mg camera. I took a ton of test pics and saw that the focus was out ( as mentioned by someone giving it a bad rating).  Tried every mode, reset camera as suggested by sony tech team and then sent the camera to sony for repairs.Turn around time at the larado center in texas was one day ( so i thought at first it was just the way the camera was and that I would have to live with it) However, got it back with an explaination that they replaced the optical sensor unit (whatever that is) and now the camera takes clear shots.I have heard all the bad sony reviews however my story, other than having to send a new camera back, was a positive one.", "Date": "January 19, 2009"}, {"Title": "Image Quality Not As Expected", "Author": "M. Larimore \"RatingsFan\"", "ReviewID": "R1L5J1DE0TUNNF", "Overall": "2.0", "Content": "I bought this camera after much research-  My initial impressions were good.  But when I brought up my first picture on Photoshop I immediately realized that something was wrong.  The picture quality was not good. I tried all the settings and I took a lot of comparision shots with my Canon S80 and the Sony.  The daylight shots are fine.  The flash shots are terrible.  Very grainy, speckled and fuzzy; like another reviewer stated here.  I thought that it might be a faulty camera, but when the daylight shots came out fine I came to the conclusion that it is the camera.I have pulled my S80 off eBay and I'm returning the Sony.  Now I'm looking at the Sony W200, W300 and most likely going to get the Canon SD100.  If you buy the WD170 camera, take test shots before comitting...UPDATE- After looking closely at all the reviews, I have come to the conclusion that all of the subcompact cameras suffer the Sony image quality problems to some extent.  I am sticking with my Canon S80 for now...FINAL UPDATE- At the last minute i gave the Canon SD880 a try - Glad I did.  It takes much better low light pictures than the Sony.  On the whole better pictures than the S80 and much smaller.", "Date": "January 5, 2009"}, {"Title": "LOVE IT!", "Author": "S. Marino \"ol' beach bum\"", "ReviewID": "R1AMQ5UTUNC1OJ", "Overall": "5.0", "Content": "What a great, small camera. The pictures are so clear.  Easy to use in light and dark conditions. Very happy with it.", "Date": "September 3, 2008"}, {"Title": "Great Camera", "Author": "Sarabjit Kuckreja", "ReviewID": "R3K4988N5F8LGH", "Overall": "5.0", "Content": "I had a Sony DSC-W90(8.1 MP) before this one and I simply loved it. I lost it recently and bought this one. It is pretty much similar to the W90 with a couple of additional features like smile detection and a bigger optical zoom (5X as against 3X in w90).", "Date": "August 2, 2008"}, {"Title": "Met my expectations for a digital camera", "Author": "ecmedia \"ecm\"", "ReviewID": "R2SQL9WJ1AE51K", "Overall": "5.0", "Content": "I have had a 5 MP digital camera and I was ready to upgrade.  I am no photographer, just a casual user that likes to take photos of my family in various situations.  We went and looked at several cameras in stores, did some research online, and found out that for an average consumer who wants a great camera without the bells and whistles, this is it.We have now used it for a while and have taken pictures in many conditions.  All have turned out to be great.  So for anyone who simply does not have the time and technical background to research what camera to buy for a family, this is a safe choice.", "Date": "July 30, 2008"}, {"Title": "Sony Cybershot DSC170/R 10.1 MP", "Author": "rainforest \"rainforest\"", "ReviewID": "R8KMIVC25M9TA", "Overall": "1.0", "Content": "I love this camera.  The pictures are flawless, generally with a size of 1 MB.  The screen is big enough so I can see the quality of the picture. Excellent zoom option.  The camera size is perfect to keep in my purse.  One thing though is that the red of the camera is not pure blood red but rather a very dark pink-red, which I happen to love.  I am looking for a gel case to avoid bumping and scratching its surface. I wish a fitting one for this camera was recommended to my when I bought it, so I could buy them together.A year later....I loved this camera so much that everybody in my family got one.  Turns out that few months later it gave serious problems with the dial where the type of photo is selected.  It just got a mind on its own and started turning around by itself.  The picture quality is not the same as it used to be.  The four cameras showed the same error after the same time so it is not fun to expend all that money for a disposable camera...", "Date": "August 12, 2008"}, {"Title": "Not as impressed", "Author": "Tabatha", "ReviewID": "R1SBKKVW3WAW8", "Overall": "4.0", "Content": "I really expected improvement over my other Cybershot but feel I down graded in quality. This camera offers some more options my old one didn't but I've noticed that images don't focus like my old camera did. As I gave my sister my old one, this one will have to do for now. Overall, it's not bad and I did buy it used so maybe it had some rough treatment before. The images still turn out well, so you know when the focus isn't working when you take a picture so you can retake one, hopefully. Oh, and again it may be due to the being used thing, but the reaction time between red eye flash and snapping the actual photo is really slow.", "Date": "April 28, 2013"}, {"Title": "As Good As Compact Cameras Get", "Author": "MyBeesWax \"A Music Fan\"", "ReviewID": "R1TXMPNA19HBLC", "Overall": "5.0", "Content": "This is a major upgrade from my antiquated 2 MP Canon Powershot camera. I'm simply thrilled by the sharpness and quality of the pictures this compact camera captures! At the highest resolution, the amount of detail this camera picks up is phenomenal (as long as you're in a sufficiently illuminated setting).There are three major reasons why I picked the Sony DSC-W170 over other brands/models of cameras. (1) This camera has a 28 to 140mm wide angle lens to capture a wider field of view for establishing the context of the subject or subjects in the shot. (2) The 5x optical zoom lens enable impressive close-ups (3) The image stabilization helps to keep your subject properly framed even if you have shaky hands like mine.The camera also takes macro shots. The clarity, sharpness, and detail of the macro shots is astounding. I'm having a lot of fun with this - You can actually get real creative with this!You can also take videos at 30 fps (480 x 640 resolution) with this camera. I should caution you about an inaccuracy in the product description. As of this writing, the product description reads \"the length of your video limited only by the capacity of your media.\" DO NOT BE MISLED! Like all point-and-shoot cameras that are video-capable, the length of the video on the DSC W-170 is limited to 10 minutes. You would need to restart the video after every 10 minutes if you wish to continue shooting.The Sony Cybershot is, of course, not exempt to the problem that's inherent in all compact cameras -- \"noise\" in low light conditions. The problem is more pronounced in compact cameras than in dSLR cameras.In case you're deciding between this and the 8.1 MP DSC-W150 -- my friend owns a DSC-W150 and I can see that this camera produces significantly better quality pictures.A quick word on memory cards - You can actually use a regular microSD card with this camera if you use a microSD card to MS Pro Duo Adapter (such as this one). It's worked very well for me.---As far as compact cameras are concerned, the Sony Cybershot DSC-W170 is about as good as it gets. If you're looking for a compact camera that you can easily slip in your purse or backpack, you can't go wrong with the DSC-W170.", "Date": "September 16, 2009"}, {"Title": "I wanted to love this camera", "Author": "TC", "ReviewID": "R8TFSAYXEPTMH", "Overall": "1.0", "Content": "I wanted to love this camera.  I have a sony cybershot that is many years old and only a 3 MP.  It was time to upgrade.  I'm partial to the sony brand-so I bought this.  What a mistake.  I took several pictures inside and outside and the colors were not good.  I tried different settings.  I read and reread the manual.  And I took pictures of things within seconds with my old 3MP camera to compare the two.  This camera had more yellows and darker images.  I was not happy with 1 picture I took from it.  In contrast, almost every picture from my old sony was fine.  I am not a camera expert--thus the desire to buy \"point and shoot\".  But is it too much to expect a new camera to take better pictures than one that is 5 or so years old?  In the end I returned it and went with panasonic.", "Date": "May 13, 2009"}, {"Title": "Best camera I have owned yet!", "Author": "Carl B. Charping \"Carl B. Charping\"", "ReviewID": "R2YS12T8GMB0YG", "Overall": "5.0", "Content": "Best camera I have owned so far!  Forgot SONY products use SONY equipment. Regular USB cable doesn't work to transfer to/from computer but it did come with it's own cords BUT didn't come with memory card.  Once again, SONY only product!", "Date": "February 17, 2009"}, {"Title": "All the right features in this camera!", "Author": "Brian Stadtmiller \"power-user\"", "ReviewID": "RZ51M1S7R33IG", "Overall": "5.0", "Content": "I got this for my wife to replace her 3+ year old casio, which took OK photos, with some effort.  I have a Nikon and have used all kinds of digital cameras as well.  I did some research online and at consumer reports to select this camera, based on specific criteria such as:  short shutter delay, good optical zoom, image stabilization, high \"asa\" capability for low light shots w/out flash, size and cost.  This camera does a great job across the board.Firstly, the photos my wife is getting out of this are really impressive!The best she has ever gotten by far.No more blurry action shots, amazing ability to take flash free shots indoors without sacrificing image quality, and the short shutter delay means she actually gets the shot at that key second.  I am very satisfied with the camera, and love the results.  (One thing i did was turn off the digital zoom so she can never get a degraded zoom shot.)  Anyhow, for the price, this camera is perfect.  Would not change a thing.  Oh, it looks nice too!", "Date": "February 6, 2009"}, {"Title": "Sony Cybershot 10.1MP Digital Camera", "Author": "John Coulter", "ReviewID": "RARQBKIBAEXUP", "Overall": "5.0", "Content": "I can't say enough about how much I like this camera.  I borrowed my brother-in-law's older model Cybershot to shoot photos of him at his recent Master's program graduation.  I've been a Canon user for many years and had not owned a Sony camera since the Mavica days.  The Cybershot camera was so easy to use and took such great pictures I had to buy one for my family to use when I returned home!  The menu interface is very easy to use and navigate and the steady shot and face detection programs work great.  Smile detector is pretty gimmicky, but it does work and is very helpful if you have one of those people in your family that you can just NEVER get to smile!  The thing is built like a tank and has a big preview window (one of my constant complaints about my last Canon point and shoot).  The battery lasts forever (about 4-5 hours of continuous use per charge) and comes with a very easy to use charger.  The camera even has a neat slide show program you can play on the camera that gives your photos some neat transition effects and sets the whole show to some midi music.  All in all a great purchase and I'd buy another one if something happened to this one.  I liked it so much I even recommended one to my mother and father-in-law and they bought one too, so we have 3 Cybershots in the family now.", "Date": "January 18, 2009"}, {"Title": "Incredible while it worked", "Author": "Thiago B. Ramos", "ReviewID": "R3BU0M0XDSSSKN", "Overall": "5.0", "Content": "It is a pretty good and complete camera. The only problem was that after 10 days of using it the LCD just went black for no reason, although the camera was still working. I had the inconvinient of having to send it back to Sony by mail during the seasons' vacations for repair.", "Date": "January 12, 2009"}, {"Title": "Another Awesome Sony Product", "Author": "Colby", "ReviewID": "R3L4G6CDM786ZC", "Overall": "5.0", "Content": "I purchased this camera to replace my older Sony DSC-W5. I loved the image and build quality of the W5 but, I wanted a smaller/lighter camera. The DSC-W170 also offered twice the megapixels, a wide angle lens, 5x zoom lens, bigger/better LCD and a rechargeable Li-Ion battery. The DSC-W170 is very well built, unlike some of the cheaper plastic cameras on the market. For example, Sony used a metal tripod mount instead of a plastic one. Sony used a high quality Carl Zeiss lens on this camera, much like other models in the Cyber-Shot series. However, it's a wide angle lens, so you can fit more people in a shot without backing up. On the back, you will find a beautiful 2.7\" LCD, displaying an impressive 230k pixels. Features are where the W170 really shines. It features Sony's \"Super SreadyShot\" optical image stabilization, which really helps reduce unwanted camera shake. The face detection works very well, as does the smile shutter. A new Sony feature this year is child and adult priority, which amazingly works. \"Happy Faces\" is an in-camera editing feature that can make a person look like they are smiling, which works to an extent. Battery life is rated at ~400 shots, which is accurate and plenty long enough for most people. Noise is not usually a problem if you don't go above ISO 800. It also has an \"Easy\" mode that takes away the more advanced/confusing functions. Some of the other reviewers mentioned poor image quality, which is not true. I wouldn't expect a compact point & shoot to get better results than a chunky DSLR. Image quality is excellent and most users will be very happy with the images this camera can take. Overall, the Sony DSC-W170 is a high quality camera that should satisfy anyone looking for a compact point & shoot camera. I hope this helps!", "Date": "January 3, 2009"}, {"Title": "Great camera", "Author": "Ian Sassoon", "ReviewID": "R1R99TVPDYNV4S", "Overall": "5.0", "Content": "I just got one of these for a trip.  It was very easy to use and took incredible pictures.", "Date": "December 26, 2008"}, {"Title": "Love It  * Love It * Love It !!", "Author": "KC \"Bargain Hunter\"", "ReviewID": "R1ETK3UL4WK50M", "Overall": "5.0", "Content": "I am a PICKY Shopper and Shutterbug.  My other camera died tragically earlier this year and was ready to be replaced anyways.  So I researched the heck out of cameras all summer and got this one. It is great! Nice pics!  Took pictures of fireworks at night and family in an outside christmas celebration. Took pics inside with no flash and had wonderful light balance (INSIDE WAS ON \"AUTO ADJUST\") It worked beautifully !!!! Nice crisp clear pics.  It is great for a beginner and also has a lot of bells and whistles for us shutter bugs who want more.  Great price ! other stores had this at $270+ dollars.", "Date": "December 10, 2008"}, {"Title": "Great camera", "Author": "Douglas W. Decampos", "ReviewID": "R2YWOQN6D62QBW", "Overall": "4.0", "Content": "I bought this camera to my dad for his birthday and I had to try it. I was amazed with the quality and features this camera has and its size. I took some picture in NYC using the HIGH ISO and the photos were with just a few noise. I took pictures of my girlfriend's cats and they were awesome. Also I took it to a big party and the quality in a dark disco was awesome. And finally I used it to take pictures and record the F1 GP the shots quality were good too. Very impressed with the quality of the movie recorded. My only issue is with the smile detection, some time it does not allow me to take pictures but I did not have time to explore the manual. I am wondering to buy another for myself.", "Date": "November 19, 2008"}, {"Title": "Great Camers", "Author": "Kay Evraets", "ReviewID": "R3F0A0QH3AQLYV", "Overall": "5.0", "Content": "Love this camera. Its easy to use with great features. The smile button snaps the picture when it detects a smile...wow it actually works. This should make those Christmas pictures perfect. I also love the easy button...great pics no thought to it!! Finally you experts out there there are enough settings available to you to customize your shots.One thing I forgot to mention the wide angle feature to fit the whole scene in should come in handy on my upcoming trip.Nothing to not like about this camera.", "Date": "October 26, 2008"}, {"Title": "Great camera", "Author": "Ben Nadel", "ReviewID": "R2XARX0UMSQ105", "Overall": "5.0", "Content": "I got this camera for my friend's birthday. It's been a great little camera. The quality of photos are very nice and it takes really quick shots. It seems to be very good about not blurring shots even when there's a lot of movement. It also has a great, albeit very cheesy slide show feature in which you can watch a camp-like farewell of photos set to sappy music :) I have no complaints at all.", "Date": "October 20, 2008"}, {"Title": "COULD NOT BE HAPPIER", "Author": "Double A", "ReviewID": "R1YZIUTJ5IQP76", "Overall": "5.0", "Content": "I bought this camera after already having a canon from about the same class. My expectations weren't too high, but I knew I wanted something good.  I was dead wrong in thinking that it was a typical point and shoot camera.1st off, the lens is absolutely amazing.  It has a very high quality zoom.2nd, It is very elegant and cosmetically appealing, and definitely not too thin.3rd, The features are amazing!!! From the clever smile mode, to face and scenery detection features, this camera has just about everything! It even has an EASY shooting mode for the camera unsavvy people.It is simple and easy to use all the while being an incredibly ideal, proffesional camera for amateur and hobby photographers.There are NO annoying little things that other cameras have and I love this camera a lot.", "Date": "October 13, 2008"}, {"Title": "My DSCW170 Review", "Author": "Barry L. Cech", "ReviewID": "R3RVQC9NJP7GFJ", "Overall": "5.0", "Content": "I purchased this camera over a month ago and have taken a couple hundred pictures with it so far.  The picture quality is incredible for such a small \"pocket\" camera.  The camera itself appears to be well made.  The battery/card compartment is nicely laid out.  The door to this compartment looks/feels like it is a little cheap.  Although I haven't had a problem with mine what-so-ever, I believe if you weren't paying attention while opening or closing this door, you could force it easily enough and possibly break/damage it.  This is the only possible problem I can see having with the camera other than dropping it.I really like the big disply in the back and the \"stable\" feature.  It REALLY cuts down or just about eliminates blurry pictures.  The camera I had before this was the Sony Cybershot DSCS730 7.2MP Digital Camera with 3x Optical Zoom.  That camera was ok, but I had blurry pictures it seemed 1/2 the time.I really like and use the Red Eye fix feature in the camera which takes the Red eye out after taking the picture and while reviewing your pictures.  The \"smile\" feature the camera has really works and is quite incredible.  I've used it with family or group photo's.  The camera wont take a picture until one person which you can select actually smiles.  Very cool....I didn't think this feature would actually work, however it does, and does well.Another nice feature I like and use frequently is the ability to plug the camera in to the TV and watch the photo's.  It comes across on the TV like a computer screen saver.  The photo's come and go and there's even music if you want it.  Or you can just manually scan through the pictures on the camera and watch them with the family on the TV instead of all huddleing around the computer monitor.Finally, if you have big fingers, I think this camera could be a little difficult to operate.  Some of the buttons and the dial in the back could be hard to operate.Unless something mechanical happens to this camera, I think I've finally found the right \"point and shoot\" camera for me.", "Date": "October 12, 2008"}, {"Title": "A great little camera", "Author": "Kaleidocherry", "ReviewID": "R1EXUE1NAAP4S2", "Overall": "4.0", "Content": "I spent a great deal of time on Steve's Digicams website reading reviews and looking at sample pictures.  Primarily I use my camera for blogging and not for prints, so the way the pictures look on the web is what I used for a guideline.  Specs-wise I had actually one-click-ordered the new Nikon Coolpix S610 from Amazon before panicking (because there were no reviews or sample pics for that anywhere yet) and cancelling the order.  It was then down to this model.  I went to a local electronics store and checked it out (as well as looking at the competition in case there was something I missed) and ended up taking this nice red one home.The only two things I see \"wrong\" with this camera are that you need to use the Memory Stick (so I had to buy one, whereas we have 3-4 SD cards already) and that you can't operate it with one hand.  My old 2.3 megapixel Canon was set up in such a way that you could hold and shoot with your right hand (assuming your hand was steady enough).  With this one, the pressure of my palm presses the menu buttons accidentally.  I'm still not sure I'm keeping this one, but I am thinking about it.", "Date": "September 30, 2008"}, {"Title": "Best digital camera ever...", "Author": "Yngrid Silvestri", "ReviewID": "R2KPVSWWLSN0YY", "Overall": "5.0", "Content": "I highly recommend this camera to everyone, specially to those willing to start in photography. This camera has a perfect resolution, bright-beautiful colors. Very light, easy-to-carry, easy-to-use...perfect for everybody. A great investment.", "Date": "September 7, 2008"}, {"Title": "Cybershot DSC W170", "Author": "H. K. Wong", "ReviewID": "R3GQOUM5LY0O1I", "Overall": "4.0", "Content": "Pros:A good camera for the money. Has one of the better steady shot logic compared to other cameras of its size. Does a good job in low light conditions. The build quality feels solid and durable. Good video quality.Cons:Interface takes time to get used to for all the fetures this camera packs (But isn't really that bad, just takes time). I wish that this camera was able to zoom during video recording.", "Date": "September 5, 2008"}, {"Title": "Excellent!!!!!", "Author": "K. Wendland", "ReviewID": "R1CB3R4XX07ZF8", "Overall": "4.0", "Content": "It was a great product and well worth the money was shipped fast and everything that was described was included", "Date": "September 3, 2008"}, {"Title": "excellent camera", "Author": "M. Argueta \"tekusangel\"", "ReviewID": "R24W1L84VBVZUK", "Overall": "5.0", "Content": "I was looking for a camera that would take good pictures and I found it.  This camera is amazing!  I have taken pictures in well lit areas as well as in doors and have had very  nice pictures in both scenarios.  I highly recommend this camera.  The only thing I am not happy about is not buying is sooner.", "Date": "June 5, 2008"}, {"Title": "a good choice!", "Author": "Ronald Diaz \"stevecool\"", "ReviewID": "R35BRZUSPXVYJD", "Overall": "5.0", "Content": "well, this cam is amazing, the smile shutter is good, a lot! 10 pixels are enought to a afficionated photographer, the 5x optical zoom help a lot when you want to be a little bit more near, the ISO is good too, almost 3200, the slide show with music is the best, no like other, the display its good, if it would be tactil, it will be a better cam, in conclusion, a very good invertion", "Date": "June 5, 2008"}, {"Title": "NO ZOOMING DURING RECORDING VIDEOS!", "Author": "Jose Luis Sepulveda \"Seppy\"", "ReviewID": "RG4CQ1P4817Q7", "Overall": "4.0", "Content": "THIS CAMERA IS ALMOST PERFECT BY A NOTCH. THE REASON I GIVE IT 4 STARS INSTEAD OF 5 IS THE FACT THAT YOU CANT ZOOM IN OR OUT WHEN RECORDING VIDEOS. WHEN I FIRST PURCHASED THIS CAMERA FROM BEST BUY I NOTICED THAT I COULD NOT ZOOM IN OR OUT DURING RECORDING OF VIDEOS. I CONTACTED SONY CUSTOMER SUPPORT AND AS SOON AS I GAVE THEM THE MODEL OF THE CAMERA AND THE PROBLEM I WAS HAVING THEY TOLD ME RIGHT AWAY THAT THIS CAMERA DOES NOT HAVE THE FEATURE OF ZOOMING IN AND OUT WHILE RECORDING VIDEOS. IM THINKING ABOUT TAKING IT BACK AND GETTING ONE THAT HAS THIS FEATURE!", "Date": "September 9, 2008"}, {"Title": "great camera, surpased my expectations", "Author": "K. Laurence", "ReviewID": "R3EW2IIFR4ZQ98", "Overall": "5.0", "Content": "This camera has tons of ingeneous features. My favousite is the smile feature, lots of my friends do not smile for pictures and now I create goofy smiles on them. Also the setting that takes the pictures automatically once the person in the picture smiles is great. I love the huge screen. I was very impressed with the technology.Down-side:I am not a gadget/ technology person and did not know I had to purchase a memory card with the camera. It is a little  thicker than I thought, but no big problem.I love my camera and all the avaiable accessories for it.", "Date": "July 14, 2008"}, {"Title": "Worth buying for the price", "Author": "Ashwin Kumar Sukumar \"Lucky Aswin\"", "ReviewID": "R3HNOB24B5Y1UZ", "Overall": "4.0", "Content": "I bought this camera last week, and took several snaps. The picture quality is amazing. Its so light weight and easy to carry anywhere.Thanks to amazon to bring this at a reasonal priceAswin", "Date": "August 27, 2008"}, {"Title": "Just what i was looking for", "Author": "Amazon Shopper \"lg_cdn\"", "ReviewID": "R30I68WAFO9MCQ", "Overall": "5.0", "Content": "great photo quality in a variety of lighting situations. fast start up (better than my older Sony). one of the only newer cameras that still offers a viewer in addition to the digi screen - which is needed in bright sunlight.", "Date": "August 17, 2008"}, {"Title": "Very Good Photos!", "Author": "Rickies", "ReviewID": "R2PSUGVEGX6LEV", "Overall": "5.0", "Content": "I think this is a great camera. I have about 5,000 photos of my childs and the best photos I ever took of them were taken last week with this camera!The size is perfect, I think that if sony made it smaller it would be difficult to handle. The photos of faces are great and the interface with the televisión is great, it makes a slide show of your photos where you can choose the kind of show, which pictures would be in it, etc.The only bad thing I can find on this camera are the photos on poor light, they are pixeleated even with the ISO function, they seem like my old 1.5MP Photos.", "Date": "August 1, 2008"}, {"Title": "Sony Cybershot W170", "Author": "Ashley Sanchez \"Ashley S.\"", "ReviewID": "R1PXT9XEV3EB60", "Overall": "5.0", "Content": "Excellent product and Face Detection funtion is great. also included external memory in your Cart is strong necesary", "Date": "June 20, 2008"}, {"Title": "Good Camera for Features", "Author": "R. Raiz", "ReviewID": "RNTVAUM3OMO5L", "Overall": "4.0", "Content": "I'm posting a review of my camera.I like it, maybe for the many features it has, including a Smile mode that allows you to wait until someone smiles, which triggers the camera to take the picture.Thank said, the pictures are either sharp or blurry, despite what settings you use.  I have found that I get the best results on automatic, and let the camera decide how to take the best pictures. Otherwise my experience has been mixed - some of the pictures are great, while others are blurry, despite the fact that this camera features 'anti-shake' technology.The other good feature is the size - not too small, so you can hold it correctly in order to stabilize the shots, and enough heft to feel confident in your focusing on the object.Finally it has 10 megapixels and a 5X zoom lens, which is also by Carl Zeiss, so you know you are getting a quality lens.All in all I can recommend this - just don't expect it to equal the quality of more up to date cameras.", "Date": "May 4, 2014"}, {"Title": "excellent camera", "Author": "Cornelia M. Carroll \"Connie C\"", "ReviewID": "R1FWQJM5ZAIAGU", "Overall": "5.0", "Content": "Last one I had fell out of my pocketbook, I never noticed it  and I ran over it. I  wanted the same camera", "Date": "May 25, 2013"}, {"Title": "Quality", "Author": "jdn", "ReviewID": "R3RF31SHDQJ9L6", "Overall": "4.0", "Content": "I bought this as a gift and my girlfriend really enjoyed. She loves taking photos and this worked well and was fast and its small size easy to carry around. ITs not a professional camera by any means but it is good for casual photos.", "Date": "April 24, 2013"}, {"Title": "Sony dscw170", "Author": "Charlie A. Hill Jr.", "ReviewID": "R16VVEZULM7QNW", "Overall": "3.0", "Content": "Camera came with no CD or inst book,but this was pointed out in description.The only problem I have with the camera is the On Off button won't respond when pressed sometimes.I wanted a camera with a optical viewfinder because they are hard to find in a point and shoot..This is not my primary camera I use it for everyday pocket use.", "Date": "July 9, 2012"}, {"Title": "Have Used it For Four Years", "Author": "Tyler Fullington \"tswmcello\"", "ReviewID": "R29291Q5LL9GIP", "Overall": "5.0", "Content": "This camera has been with me everywhere for the past Four years. It can take everything you throw at it, and then more. I have always been satisfied with the picture quality and the only complaint I would have is when you take photos with low light and the flash doesn't activate, you end up with a yellow hue on everything. However, this doesn't usually bother me, during the day you can pull perfect photos over and over again form this camera.", "Date": "January 23, 2012"}, {"Title": "Even a 15 year old wanted one", "Author": "H. Williams", "ReviewID": "R2N6OWBZ8EFIK4", "Overall": "5.0", "Content": "I am working on a digital camera at my going on 16 year old daughters request. And she wants my Sony DSC-W170, which I also want, and enjoy. Let this say it all.", "Date": "May 9, 2011"}, {"Title": "Great camera ... if it only worked properly for more than 6 months!", "Author": "Maxmiliano A. Keen \"Max\"", "ReviewID": "RHM4GX54X9IH", "Overall": "2.0", "Content": "I have a love-hate relationship with Sony. I love their design but find their products very unreliable! I've had these issues for years across various different products: 2 stereos, 1 DVD player and 2 digital cameras ... the last one which was the DSC-W170. The camera's features are great ... intuitive and easy to use. Don't feel like I miss anything that I would like to have. The quality of the photos is also great, having been regularly complimented for my pics and often drawing a \"shock\" surprise when they find out I took the pics with a small pocket digital camera! But what is a HUGE issue to me, has been the unreliable quality of the camera. As with all my other before-mentioned Sony products, the camera started having glitches after only 6 months. In the case of this camera, the issue I have is that the \"settings\" start to change automatically and in total random order when I turn on the camera! It is as if I were moving the setting dial repeatedly and in all directions. The camera just does this on its own. Sometimes it doesn't do it and works fine ... in other occasions it does so continuously and in other occasions sporadically. It would seem that it's got a mind of its own. Trouble is, I have to \"wait\" until the camera stops fooling around ... and sometimes miss a great pic opportunity altogether. The previous camera (another model) had similar issues, only that it would show its temper by simply shutting off and refusing to turn on.Bottom line: I recommend you do NOT buy this camera (or any other Sony product). It is great, but it will let you down after a few months. In my case, I will buy a Lumix which a friend of mine has had for some years and has worked reliably and with just as good quality. Sad to give up on Sony's great design ... but I feel the brand gives me no other sensible option.", "Date": "January 19, 2011"}, {"Title": "I love this camera.", "Author": "Abhishek Reddy Tummala \"Abhi\"", "ReviewID": "RUZ3KTQ1CQEJC", "Overall": "5.0", "Content": "Its been two years since I bought this camera and even today it works so perfect that I do not feel the necessity in purchasing another one. The picture clarity is perfect and also the pictures taken in the dark also come out so nice. I love this camera. The video recording is not of that good quality when compared to a HD cam but its nice. The LCD panel is also nice which helps me to see the pictures which I take with full quality. Its the best cam for me and most important its worth the price paid for. I would recommend this camera even today to anyone.", "Date": "June 8, 2010"}, {"Title": "Great quality photos, easy to use", "Author": "Nicholas A. Young \"biz mac guy\"", "ReviewID": "R1DF6YYEI2EF5D", "Overall": "5.0", "Content": "We had always purchased Olympus digital cameras, and when our last Olympus failed to impress, we decided to try the Sony. It has been a great camera, takes excellent photos, and has given us no hassles. Like any small digital, in very low light you must hold the camera very still, but it has been better than the Olympus cameras we've had in the past. Syncing to the Mac is very quick and easy, and charging is simple as well. No complaints!", "Date": "May 30, 2010"}, {"Title": "black spots", "Author": "Lissa List \"proud progressive\"", "ReviewID": "ROVKLWTXH0EUD", "Overall": "2.0", "Content": "I loved this camera until after the 2nd year of use I have black spots on my shots.  Very poor longevity.  I've seen other people with camera having the same problems.  Not bad if you want black spots in all you pictures.", "Date": "March 28, 2010"}, {"Title": "Sony just can't get past the Betamax thing....", "Author": "R. Hill", "ReviewID": "R38V555MLNINB4", "Overall": "1.0", "Content": "The camera works fine, but is it any better than the several dozen competitors in this price range?  Is it so much better that customers should have to put up with the Sony proprietary memory card and USB cables?  My daughter promptly lost the cable....no biggie, surely one of our other dozen USB cables we have here would work....only took a moment to see that the camera connector is totally unique and no where near any kind of industry standard.  And Sony wants $35+ for a replacement cable.  Best deal here on Amazon is $20.  All other USB cables (standard connectors) are way less than $15.  and of course, can't just pop out the memory card and plug it into my laptop reader....nope, it's proprietary as well.  gee, thanx for that.Why does Sony insist on steadfastly refusing to use any industry standards?  Makes ya think that maybe the Sony engineers and management are still a bit miffed at loosing the Beta/VHS battles back in the 80's.....come on Sony - get over it and quit taking your customers for a ride with your proprietary, but no better than any other manufacturer's, connectors and memory cards.Because of Sony's obvious arrogance and contempt for their customers, I will never buy another Sony product, nor recommend one.", "Date": "March 7, 2010"}, {"Title": "Worked fine for about a year", "Author": "Jared Coles \"jayrck\"", "ReviewID": "R2RZRQ7WQ7KMRR", "Overall": "2.0", "Content": "This camera took great pictures and video and was great for what I wanted, but now for some odd reason when i turn it on the lens goes in and out about 3 times then the lcd display says \"turn camera off and on again\" I cant get it to go back to normal no matter how many times i have turned it on and off. Many people with the same problem seem to be able to fix this by banging on it because this is usually caused by dust getting stuck in the lens, i tried everything and still can not get it to work. So now i have a useless camera. Not happy.", "Date": "February 27, 2010"}, {"Title": "pleased with Amazon's quick service and the Sony Cybershot (DSCW170) that I purchased recently", "Author": "Poseidon's Pal \"Caribophile\"", "ReviewID": "RIL2I0SDS3FH4", "Overall": "4.0", "Content": "I recently purchased a Sony Cybershot from Amazon.Com. In that this product is no longer being made, I had problems finding it with some other vendors while others were downright deceptive--offering a refurbrished version and trying to pawn it off as new.In any event, the camera came in great condition and works well thus far. The ultimate test, though, will be how it performs on my vacation to the Caribbean, which begins the week after Christmas. I also bought a marine pack for this camera so that I can use it both as a splash and an underwater camera.The pictures I've taken thus far with this little gem have been very good--it's a 10.1 megapixel. As someone who often sells photos to accompany my articles, some of the photos that I've taken with this camera appear to be saleable. On the other hand, the photos are not quite as good as those that I take with my Sony Alpha (DSLR) or with my 35mm film cameras. On the other hand, it is much more portable than these cameras. The 28 to 150mm zoom is very good and the camera boasts lots of other features.I would recommend buying this camera. I also highly recommend buying products from Amazon.com. They've always been professional and prompt in my dealings with them.", "Date": "December 23, 2009"}, {"Title": "Died within 17 months", "Author": "A. Duong \"Photog\"", "ReviewID": "R151ZSZSXZMMNE", "Overall": "2.0", "Content": "I bought this camera for my wife.  We only used the camera occasionally since normally, we use my Digital SLR.  Recently, it started taking picture with a blur and orange tint. I thought it was camera shake and low lighting but that was not the case. So much for the $300 we spent.", "Date": "November 2, 2009"}, {"Title": "SONY CYBERSHOT dscw170", "Author": "Cheryl A. Koster", "ReviewID": "R1UY1JVJWMYQQT", "Overall": "5.0", "Content": "Great camera!  Small size easy to take places.  I appreciate the eyeview for picture taking in the sun.", "Date": "September 20, 2009"}, {"Title": "Great buy...", "Author": "Tanmay K. Padhi \"Tanmay Kumar Padhi\"", "ReviewID": "R1D2PIK9NBDGQB", "Overall": "5.0", "Content": "This camera is really great..It's very handy and photo quality is damn good...I like this...Over all the camera looks sexy :-)", "Date": "September 3, 2009"}, {"Title": "Love it and would recommend", "Author": "N. Alfadel \"aroundtheworldandbackagain\"", "ReviewID": "R6B2MO4IAUMAU", "Overall": "5.0", "Content": "So this was my first digital camera, and after going through a brain overload researching which would be best for me, I finally decided on this one and I'm glad I did. If you're looking for a decent digital camera that is user-friendly, takes quality pictures, has a view finder, good battery life, and not too bad of a zoom (5x) than look no further, seriously. The pictures come out great, it's really easy to figure out (even before skimming through the user manual) and the LCD screen is the perfect size. I have no complaints except that it lags for about 3 or 4 seconds before it pulls the lens back into the camera to turn off. But seriously people, 3 or 4 seconds? isn't it crazy how people find a problem with waiting 3 seconds!?! NOT that big of a deal unless you are the most impatient, anal person around. Plus I don't remember it doing that when I first got it, so maybe I mishandled it or kept turning it on and off too many times. Either way, it doesn't interfere with my enjoying the camera regardless.Overall, it's a perfect point-and-shoot for the price and its features, plus I like the design, it has a sleek look and nice shape. Great for vacations and taking random pictures of friends and family and I forgot to mention, the color and lightning is just fantastic. I took it to a concert that was outside and it was night and it captured the stage and the crowds of people waving their hands PERFECTLY. The colors were exquisite. Like I said, quality. It definitely does not disappoint - does what it said it would do plain and simple. I'm a happy customer :)", "Date": "June 26, 2009"}, {"Title": "Great camera!", "Author": "Stephan Peter Konig \"Costa Rica Pro\"", "ReviewID": "R2K15FEBX349U4", "Overall": "4.0", "Content": "This is one amazing little camera. Small, but of high quality, it takes great pictures of excellent resolution and quality. Be careful before you erase something, though. There is no undo! By accident my wife erased all background songs right at the beginning and if your are not careful you can easily mistake a video for a bad photo and when you erase it, it is gone. I also do not like that it cannot be directly hooked up to your computer out of the box, so a card reader (not included!) is essential...", "Date": "June 21, 2009"}, {"Title": "Good Digital Camera", "Author": "Edmund W. Choy", "ReviewID": "R2Z2KNWXCU0L29", "Overall": "4.0", "Content": "A little bit expensive.  It is bulky, but has all the functions that I need.", "Date": "June 17, 2009"}, {"Title": "Good in daytime, but not so good in low light", "Author": "Drake", "ReviewID": "R3D5DYUBHJRWRN", "Overall": "4.0", "Content": "The camera takes great pics outside during the daylight hours, but at night or inside the pictures or not that great and have noise. Overall the camera is not bad.", "Date": "May 21, 2009"}, {"Title": "the sony camera", "Author": "Joseph Budu \"...the only kindness I have to o...", "ReviewID": "R3EAPW60ZH8E19", "Overall": "5.0", "Content": "its simply sleek and nicethe only problem i have with it is that u can't zoom in/out when taking video shots...", "Date": "May 3, 2009"}, {"Title": "Amazing Quality Pictures", "Author": "yomo910 \"Mo\"", "ReviewID": "R26ZA88YO023W6", "Overall": "5.0", "Content": "i got this camera after having the nikon coolpix which i had for three years. it was horrible their was a 10 second wait in between each picture...and i take alot of pictures. so when i finally bought a new camera i decided to go all out on a good point and shoot. after much searching i found this one. ITS ANMAZING!!! the quality on the picturesis absolutely amazing. the pictures look lifelike. not to mention the camera has a great fell to it and it looks really nice. not too mention its myriad of features. its smile shutter works absolutely amazingly. it always gets a great smile. this is the best camera i have ever seen. i have had it for nearly a year and im still in love with. even compared to other cameras i see people use... these pictures come out so much better. you must get this camera.", "Date": "April 13, 2009"}, {"Title": "Pictures are GREAT! Not meant for moving pics tho", "Author": "M. Pomeroy", "ReviewID": "R1D044FX3CAWA8", "Overall": "4.0", "Content": "I absolutely looove the pictures from this camera. Its sooo much better than my 5 MP that i had last time. It didnt click that when it said \"Steady super shot\" that it wasnt meant for spoting events or what not. Nonetheless it was worth the money compared to the deal and a major upgrade to what i had last time", "Date": "April 5, 2009"}, {"Title": "Very pleased!", "Author": "L. Hoberman", "ReviewID": "R36WJM6BF85LZ4", "Overall": "5.0", "Content": "I bought this camera for my daughter's 25th birthday. She wanted a 10 megapixel, 5x zoom camera. She said it takes great pictures and is very happy with it. I have an older Sony for the last three years and am very happy with it as well. Amazon offered the best price around and free shipping. I have bought a few items from Amazon and have never been disappointed.", "Date": "March 11, 2009"}, {"Title": "Great camera", "Author": "Roseanne M. Cavanagh \"gift giver\"", "ReviewID": "RLRQO4UUW2HO7", "Overall": "5.0", "Content": "I purchased this camera for my granddaughter's 19th birthday and she loves it.  She was also very happy that it is compatible with her laptop, which she had thought it would not be.  It's a perfect size and takes great pictures.  She loves all the features it has, especially the \"smile face\"!!", "Date": "February 21, 2009"}, {"Title": "SONY DSCW 170", "Author": "Praveen K. Dasari", "ReviewID": "R2PF242N062R08", "Overall": "5.0", "Content": "This camera is great. I had used a Sony T300 but I somehow liked this one better. Its not exactly compact but not too big either. Image stabilition is good and picture clarity is really good. I have had no problems with it so far. Infact, I like the videos in this one better than my Canon HG20 camcorder. After using this I just returned my Canon HG20 and am looking to buy a Sony SR 11..If you are ok about the size..this is a good buy. The only thing I wouldlike in this is the zoom feature for video.", "Date": "February 16, 2009"}, {"Title": "Love this camera!!!", "Author": "Jill A. Santos \"JAGS\"", "ReviewID": "R13HDMPW05GHR9", "Overall": "5.0", "Content": "I've had my Sony camera now for a little over a week, and I love it!  It has so many features, and the compact size is great.  I especially like the in-camera retouching.  You don't even have to crop your pictures on the computer, you can do it right on the camera before you upload them or print them.  The only feature I wish this camera offered is, to be able to take black and white pics.  Other than that, I am very pleased with my purchase and recommend it to everyone.  The shipping was also excellent - fast!", "Date": "February 16, 2009"}, {"Title": "Best Camera On The market Today For The Price", "Author": "David S. Bernstein \"Sosec\"", "ReviewID": "RLMSLE94KAFCW", "Overall": "5.0", "Content": "This Camera Was Well Planed When They Designed It. There Are Way Too Many Features To List. You Can Take Pictures From Low Res All The Way Up To 16:9 Wide Screen capability And Huge Size Files and Ultra high resolution. Get The 8 Gig Mark II Chip And You can Get Almost 4000 Picture @ Over 3 Meg A Piece. The Quality Of The Pictures And The Size of The Camera Will Astound You And It fits In The Palm Of Your Hand. The Stibility Control Can Take A Picture Even If You Have A Condition That Wont Allow You Hands From Shaking. Also The Camera Has 10.1 Mega Pixels. Great Product At A Great Price What More Can I Say!!!!!", "Date": "February 12, 2009"}, {"Title": "Greatest Camera!", "Author": "Laura Peynado", "ReviewID": "RCCZT9LXAI9DG", "Overall": "5.0", "Content": "I owned an Olympus Stylus 710 or something like that and it took horrible pictures! I sold it and started comparing Sony cameras.. I finally chose this one and am glad I did! It takes GREAT photos in every kind of lighting and the Smile Shutter is great...GREAT CAMERA for a GREAT PRICE!5 stars!", "Date": "February 12, 2009"}, {"Title": "Pleased-very nice camera", "Author": "RBM \"Sevenoaks\"", "ReviewID": "R3FCSAB5S8SOT5", "Overall": "5.0", "Content": "I did a lot of research and settled on the Sony Cyber-Shot DSC-W170 based on its very positive 4-1/2 star reviews and the fact that it has a Zeiss lens. The lens was an important issue for me.My prime DSLR is a Pentax K-10D but I wanted a reasonably priced carry-every-day pocket camera. So far, this has exceeded my expectations.The controls almost go to infinity and yet you can choose EASY shooting mode for the quick photos. The LCD screen is clear and easily viewed.This is a very solid, well designed and easy to manipulate camera with exceptional fit and finish.You will need to purchase a Memory Stick Duo Adaptor for the Sony 170 but everything else is included. Even though this is a first blush review everything works perfect, pictures are very crisp and sharp. Time will tell as is true in anything but I would not hesitate to recommend this camera to a friend.", "Date": "February 11, 2009"}, {"Title": "Sony Cybershot 170 camera", "Author": "Marie E. Sonnenberg", "ReviewID": "R2RUZ0D5GW2WPC", "Overall": "5.0", "Content": "I had a older model of this camera and was very happy with it. I wanted to update and I got this one again and I am very happy with how it works. Very easy to learn.", "Date": "February 11, 2009"}, {"Title": "Sony Cybershot DSCW170R", "Author": "Orlando A. Corpuz", "ReviewID": "R31S9LFE9KVROC", "Overall": "5.0", "Content": "This camera is amazing!! takes excellent pix close and far.  Reading the manual is very helpful and I am still learning all the ins and outs of the camera.  One observation is that my kids keeps insisting that the color red is not really red but a bit on the pinkish side.  Overall, would recommend this to anyone who is looking for a stylish camera!", "Date": "February 9, 2009"}, {"Title": "great little camera", "Author": "Karen P. Fletcher \"seminolewind\"", "ReviewID": "R3MTBB8DYLNSYJ", "Overall": "5.0", "Content": "Nice clear pictures, easy to use and carry.  Ready for use quickly.  The 5 stars is in comparison to same spec cameras of different brands.  I'm a photography buff and I do not put up with mediocre pictures.  I will keep this one .", "Date": "February 5, 2009"}, {"Title": "Nice camera...", "Author": "K. Hincher \"Khincher\"", "ReviewID": "RCVRDVSMTQZH8", "Overall": "4.0", "Content": "This is a very nice camera, takes amazing pictures, the only thing is the battery really doesn't stay charged long at all. Other than that, its overall a good camera!", "Date": "January 31, 2009"}, {"Title": "Sony Cybershot Digital Camera", "Author": "BRITT SMALL", "ReviewID": "R2U17UOUEDZUGN", "Overall": "5.0", "Content": "This Sony camera is a great piece of photographic technology, shooting 10 megapixils, with lots of adjustment possibilities.", "Date": "January 31, 2009"}, {"Title": "Sweet Camera", "Author": "James D.", "ReviewID": "R1HTP7LF5CEZSD", "Overall": "5.0", "Content": "I realy like this camera, it takes great quality photos for a great price. Everyother camera iv'e ever had use AA batteries, I really like that this one is rechargeable. I also like the smile shutter, I realy doubted it would work, but it amazingly does.", "Date": "January 29, 2009"}, {"Title": "Sony cybershot camera", "Author": "Busy Grandma", "ReviewID": "R25KGOAY9C41WH", "Overall": "5.0", "Content": "This camera is TERRIFIC!  It takes such clear pictures, you will not believe it.  Easy to use.....small to take with you.....a purchase that you won't regret.", "Date": "January 21, 2009"}, {"Title": "Brilliant Camera for day to day use (non-professional)", "Author": "Scott H. Hekman \"SlowSand\"", "ReviewID": "R2FTHZM6S0DAN0", "Overall": "5.0", "Content": "We got this camera on Christmas day and over the next week we took almost 400 pictures without breaking a sweat.  It's turn-on time and it's quick flash reload time are great.  We're pleased with this purchase for sure.", "Date": "January 12, 2009"}, {"Title": "Easy to Use, Excellent Pictures and a Great Value", "Author": "sitobe_99", "ReviewID": "R2H6D1JU9U4BP6", "Overall": "5.0", "Content": "The Sony Cybershot DSCW170 is extremely easy to operate which is very nice for anyone intimidated by electronic buttons and dials. The large screen and graphics make viewing a real pleasure. The Super Steady Shot provides very clear pictures of fast moving grandchildren and the video's are perfect for those of us with short attention spans and not much patience for a long home video. The size and weight make it very easy to transport and be available for that instance when a quick shot is needed.I highly recommend this camera to anyone for travel and family occasions.", "Date": "January 11, 2009"}, {"Title": "Spots before your eyes", "Author": "Patricia Harrelson \"Author of Between Two Women\"", "ReviewID": "R3RM6ECJOPZM12", "Overall": "2.0", "Content": "Everything about this camera was great EXCEPT the blue and white spots that kept showing up on pictures. Not all of the pictures, just some but enough to feel discouraged and disappointed. A web search indicated that the spots were probably caused by the flash bouncing off dust particles in the air. But, why we wondered, did that not happen with other digital cameras? A little more investigation suggested that in the Sony Cybershot, the short distance between the lens and the flash MIGHT be responsible. Not knowing for sure and unable to control dust and/or when the spots appeared, we decided to return the camera.", "Date": "January 11, 2009"}, {"Title": "Great little camera", "Author": "Sarah M. Ransom \"sarahmr929\"", "ReviewID": "R952418N8YB38", "Overall": "5.0", "Content": "This camera is fantastic! It is very resilient. I got it wet while traveling and it was foggy for a half hour and then dried itself out. It also bounced around my purse for three weeks in Europe with no problem. It takes great pictures and works well at night. The zoom feature works very well and switching between the easy and auto feature is easy. I would recommend this camera to anyone looking for a light camera they can take anywhere.", "Date": "January 8, 2009"}, {"Title": "Love my little Sony camera", "Author": "Texas \"Grandma\"", "ReviewID": "R1YU07ZXW4BK83", "Overall": "5.0", "Content": "Needed a pocket sized camera to have handy and capture the moments in everyday life.  The dsc-w170 is wonderful.  It has many functions, yet you can start taking great picture right out of the package.  We have the Sony Hybrid and love it but considered it too much for hauling around on trips and everyday stuff -- thus this Sony purchase.Also with a memory card it can dispaly thousands of pictures -- great brag book - can just do a slide show and share!!", "Date": "January 7, 2009"}, {"Title": "Sony Cybershot", "Author": "Chris L. Martin \"Creations by Chris\"", "ReviewID": "R2HAYW9K8XR3X4", "Overall": "5.0", "Content": "I love the camera. This is my third Sony and would never purchase another brand. They are easy to use and take amazing pictures. I have a custom bridal business and use the camera to keep a portfolio of my creations. It never disappoints.", "Date": "January 7, 2009"}, {"Title": "OK but.........", "Author": "William P. Sapienza \"Bill Sapienza\"", "ReviewID": "R1PD035411WRIZ", "Overall": "4.0", "Content": "This is the 2nd Cyber-Shot camera that I have purchased. It is a great little point and shoot. This model however seems to be much more sensitive then the 120 I previously owned. Many of my photos are blurred. I use this model exactly as I did for my 120 and the % of bluured shots is greatly increased on the 170. Seems a mono or Trip Pod will need to be my next purchase although that removes the convenience of ownin a point and shoot.So the camera and its features are ok but the Jury is still out.", "Date": "January 6, 2009"}, {"Title": "Good beyond belief", "Author": "Paul Bachorz \"paulbach\"", "ReviewID": "RCB9G9AZ6L14K", "Overall": "5.0", "Content": "Full of fun features that are easy to use and fun to experiment with. For example, the automatic slide shows on a TV with music is a real eye popper. How can all of this fit in a camera so small?Lens quality is superb, but this is a Zeiss lens.The only drawback is having to use Sony's special chips. But I bought a couple of 2 GIG cards on super sale. And, the cost of digital storage is dropping faster than the Dow Jones.The perfect \"tweener\" camera. It is between the tiny full of compromises cameras and the bigger prosumer cameras. It does not do RAW but then it is a tweener.", "Date": "January 6, 2009"}, {"Title": "Sony Cybershot", "Author": "Westie Mom", "ReviewID": "RIB89U01QRPCF", "Overall": "5.0", "Content": "Bought this camera for my 21 year old daughter and she loves it.  The screen in the back is just the right size and so far no complaints!", "Date": "January 5, 2009"}, {"Title": "Best Point & Shoot I've ever owned.", "Author": "Jason Lander", "ReviewID": "R1OGM8AW5LQ7EO", "Overall": "5.0", "Content": "I have owned several point and shoots over the last few years and have close to 20,000 pictures posted on Flickr from these cameras.  All of these cameras were Canon's.  While the picture quality of these cameras was decent to good the actual camera itself wouldn't hold up.  I was buying a new one every year because something would break or stop working.I went in search of a more durable camera and ended up with the Pentax Optio W60 because of its claims of durability.  It was a durable camera but took the worst pictures I've ever seen.  After playing with it for 2 days I sent it back.I did more research and narrowed it down to this Sony and some other Canon's.  I wanted to make a change for nothing more than to see if I could keep a camera longer than 1 year without it breaking.  Not only is this Sony durable and easy to use - the picture quality is incredible. The focus and the realistic colors are so amazing I want to go back and retake all of my pictures.", "Date": "January 1, 2009"}, {"Title": "Awesome Camera", "Author": "Jungle King", "ReviewID": "RHNT0TCDJ2HWT", "Overall": "5.0", "Content": "What a great purchase - I am very happy with this camera's capability & preformance.", "Date": "December 30, 2008"}, {"Title": "Much improved Sony Cybershot", "Author": "mamma loca", "ReviewID": "R2KYUS22UFM08E", "Overall": "4.0", "Content": "I already have a Sony Cybershot 5.1 mp- but I got the DSCW170 with 10.1 mp for Christmas. The last one took terrible low light photos, this is where Sony Cybershot is much improved. This camera takes great photos even in low light and I can even get clear photos of my daughter who never sits still. One downside the \"red\" color camera looks more a dark pink and not a full red.", "Date": "December 27, 2008"}, {"Title": "Great camera!", "Author": "L. MATSUMOTO", "ReviewID": "R2VC7HPHJI2EDQ", "Overall": "4.0", "Content": "I had a Sony T100 I purchased about two years ago. It was very difficult to navigate through the menus, etc. The photos never came out great. They always had a red/orange tint. So I decided to try this model even though it is somewhat of a downgrade in models. To my surprise this camera takes better pictures than the T100! Shots in low light come out great and of course day pics come out fabulous! Also, since the main functions and shooting selections are on the dial, it's much easier to navigate and find the settings you want. I'm still testing it out but so far I am quite pleased. One thing I do miss on the W170 that I had on the T100 is the sports shooting. I used it a lot shooting pics of football games. Can't understand why they didn't include this on the W170. That's the one reason I gave it four stars.Additional info after having camerca for a few weeks: So, I've had this camera for about a month now and had a chance to take pics during the Christmas and New Year's holidays. And I must say that I am quite pleased with how the photos came out. The colors were vibrant and very true to color. Using the various settings allowed me to set the camera for the right lighting situation, etc. I use Photoshop Elements to touch up photos but I haven't had to use it much with the W170.", "Date": "December 26, 2008"}, {"Title": "Great camera !", "Author": "einar", "ReviewID": "R2YTWQKJYYP9OM", "Overall": "5.0", "Content": "This camera is so easy to use !  Replaced my wife's older Nikon with one.  Takes great pictures, LCD screen easy to see, one of the few digital cameras left which has an optical viewfinder to use if light is too bright to see LCD.  Get a 4 gig memory stick & download to PC with supplied USB cable & software.  Smile recognition feature is great for taking pictures of our grandkids - shutter won't trip until a smile is seen !", "Date": "December 24, 2008"}, {"Title": "Easy to use and works great", "Author": "m.g.", "ReviewID": "R527EBZPJZG3T", "Overall": "5.0", "Content": "Where I work, I'm able to play with a lot of cameras and see the good, bad, and ugly of each of them.  Slowly but surely, I started playing with the DSCW170 and DSCW150 (150 is almost exactly the same, except it's a 8.1mp camera) and learned to love them.Customers couldn't believe how fast I could take a photo of them and it almost always turned out looking good (98% of the time), and with a ton of features, easy to use dial that explain what each mode will do on screen, and a sleek design, this camera is an excellent bargain.One other thing, you can get it for $229.99 at Circuit City.", "Date": "December 24, 2008"}, {"Title": "DSC-W170", "Author": "Dev", "ReviewID": "RANL3NRFRUN87", "Overall": "5.0", "Content": "I originally purchased this small camera as a replacement for my 10.1 mega pixel Casio Exlium. Although I thought the Casio was a good point and shoot, about 90% of the shots were flat, lifeless, and constantly \"soft.\"I am able to spend a lot of time with various cameras where I work, and after playing with the Sony, I was amazed. Rich vibrant colors, sharp definition, and the the anti-shake, well, is hands down the best when compared to various Canon, Olympus, and Nikon models.Recently, I was on vacation with my girlfriend here in Colorado. Every day for a solid week, I took no less than 100-150 shots a day, mainly in the Easy, and landscape modes. Every thing from indoor shots, mountain shots, portraits, wildlife... Well, during that time frame, I charged it no more than twice, and have hundreds of cherished pictures from it.Hands down, the best small point and shoot on the market.", "Date": "December 17, 2008"}, {"Title": "Awesome!", "Author": "Baylan R. Hefferman \"Reid Hefferman\"", "ReviewID": "R3NK2H591VCP9J", "Overall": "5.0", "Content": "It is easy to use (I figured it out in about twenty minutes) and the picture quality is second to none. I am not going to waste anyone's time who decides to read this review. Short and sweet, I am very happy with this purchase and would recommend it to anyone of my friends and/or family.", "Date": "December 16, 2008"}, {"Title": "Very Nice Camera", "Author": "Elias Yazbeck \"Yazbek\"", "ReviewID": "R2EHXRHB6RJNGZ", "Overall": "5.0", "Content": "great images, battery last long, shoots in the dark w/o Flasher, big screen, after i bought it i just though that i would have got the Touch screen one, but its ok i can live with it.", "Date": "December 16, 2008"}, {"Title": "Love it", "Author": "Amazon Customer", "ReviewID": "RJ26K4UL1GJMM", "Overall": "4.0", "Content": "I am very impressed with this camera.  I bought it for a trip to tour Louisianna plantations with my Mother and sister.  They both loved my camera as well.  It takes great photos 95% of the time.  The other 5% is me.  I'm still figuring out all of the abilities of the camera and getting it to do what I want it to do.  I am very happy with this purchase.  This is by far the best camera I have bought.", "Date": "December 15, 2008"}, {"Title": "WONDERFUL CAMERA", "Author": "Grace", "ReviewID": "R19BGOLQG93VYW", "Overall": "5.0", "Content": "DSCW170 is compact, lightweight, takes good pictures and is very easy to use.The price and Amazon's FREE shipping...wow  wonderful !!!!", "Date": "December 10, 2008"}, {"Title": "Best Compact Camera I have owned !!!", "Author": "Tom D \"Navy Aviation Vet\"", "ReviewID": "R3NKGW9J3K8I96", "Overall": "5.0", "Content": "The \"Super Steady Shot\" is unbelievable. All the pictures I have taken have been blur free without using a tripod. Want a picture indoors without using flash to get that natural feeling this the camera is for you. Can't say enough about the auto focus. All the options you could think of. Amazon's FREE shipping arrived fast and packaged very well.", "Date": "November 29, 2008"}, {"Title": "Great little camera", "Author": "N. DeFelice", "ReviewID": "R2UD0I2PTLQQPH", "Overall": "5.0", "Content": "Great little camera, but packs a big punch.  This camera has lots of features, but is consumer friendly.  This camera comes highly recommended.", "Date": "November 23, 2008"}, {"Title": "Good on some points.", "Author": "S. Patlolla \"reddynet\"", "ReviewID": "R2GWFMJ00QTZFB", "Overall": "4.0", "Content": "Cons:1)Takes time focus on some modes.2)Complex Menus3)Taking pictures is Slow for some modes and Image processing takes quite time on easy mode.4) Auto focus doen't work well all times.Pro:1) Good Quality pictures, if you have patience.2) Manual adjustments, for your specialized needs.Overall its good camera, for point shoot.For beginners I suggest you to read and do some R&D; before accussing the camera.", "Date": "October 15, 2008"}, {"Title": "Good deal on DSCW170", "Author": "Nick", "ReviewID": "R30Z160SW05M4A", "Overall": "5.0", "Content": "I was impressed how fast my camera had been delivered. I ordered it in the morning - between 4 and 5 am on Wednesday, and on Friday I had it delivered! Amazing! Camera works great. Well, Sony is trying to keep its brands up to the mark: no matter what products are. Excellent brand, nothing else to add.", "Date": "October 11, 2008"}, {"Title": "Excellent point and shoot", "Author": "packer42", "ReviewID": "R3SDZ5WHGH2W59", "Overall": "5.0", "Content": "I had the 7.2 MP cybershot and this is an excellent upgrade.  I am still able to use my base memory sticks and the quality of images have been great.", "Date": "October 3, 2008"}, {"Title": "So easy to use", "Author": "J. R. Masser \"Crime Solver\"", "ReviewID": "R1LPIYPASIOKP0", "Overall": "5.0", "Content": "I purchased this item for my boss.  He's technically challenged but this camera was so easy to use that he picked it up and started using it right away.  I absolutely recommend this camera.", "Date": "October 3, 2008"}, {"Title": "Amazing", "Author": "Ramon David Sifuentes", "ReviewID": "R2FNE6BRJTDOYD", "Overall": "5.0", "Content": "The best camera I ever had. Better than my not-so-old Olympus Stylus 1200. Amazing underwater shoots...The correct Marine Pack for this camera is the Sony MPK-WD.", "Date": "September 28, 2008"}, {"Title": "Great PHD Camera", "Author": "Kenneth Janoski \"Technical - but not an expert\"", "ReviewID": "RMW9ZKTHNLX3", "Overall": "5.0", "Content": "This is my second Push Here Dummy Sony Cybershot.  (The first one was three years old and ended up at the bottom of a lake -- it dried out over 3 days and still worked!)  Simpler to use interface than previous models, good technical improvements (steady shot), and more compact form factor.  Tested all cameras at local big box retailer, there is some good competition, but liked the interface (easy to use settings) and form factor of this one best.  I love the pictures it takes -- but I am not a pro, so I'll leave that rating to others.", "Date": "September 27, 2008"}, {"Title": "So Far So Good", "Author": "Amazon Customer", "ReviewID": "R1EE1EBRYIVX4P", "Overall": "4.0", "Content": "Have had this camera for just a few days -- so no detailed comments, but it takes pretty good photos. Wanted to comment that the product info doesn't mention a charger and battery are included. I ordered those separately and have returned the charger but kept the battery -- an extra battery is a good idea -- the batteries for this camera don't last as long as others I've used. And many thanks to Amazon for the easy return options!", "Date": "September 13, 2008"}, {"Title": "Fantastic Camera!", "Author": "P. Keyes", "ReviewID": "R13IJ3PBQ3R3WU", "Overall": "5.0", "Content": "Got this a few weeks ago and have been busy trying out my new camera...it is fantastic, takes awesome pictures, is so easy to use, small enough to fit in a pocket or purse, batteries stay charged for a long time (something that was a big feature).  I love love love it!", "Date": "June 30, 2008"}, {"Title": "Sony Cybershot", "Author": "Y. Pabellon", "ReviewID": "R20VEWUVJQC2KJ", "Overall": "5.0", "Content": "Great item! It has great resolution and its also good to take pictures in motion. The shipping was faster than expected. The battery life is excellent!", "Date": "July 25, 2008"}, {"Title": "Sounds good on paper but creates substandard Pictures,", "Author": "Vivian T.", "ReviewID": "R3HFNACZONJT0X", "Overall": "1.0", "Content": "We bought this camera to replace an older Sony DSC-V1 5 MP. From the reviews and the specs it sounded like a great camera. Unfortunately, when we started using it, we were very disappointed. The camera itself is just the right size. Not too small but easily fits in a pocket. Feels solid. It's pretty easy to use and has a nice big LCD. Most of the pictures we took look good on the LCD screen however when we uploaded them to the computer, we noticed that only about 20% actually looked okay. The camera did well in bright lightning although even then it had a hard time focusing on even slow moving objects. However, in indoor shots even using the flash, the images would be grainy, details would be lost. The camera would have a hard time focusing. Tried the different settings on the camera without any improvement.When we then tested it against the five year old DSC-V1, the old camera with 1/2 the megapixel produced sharper pictures under the same conditions.So buyer beware. Our camera is heading back to Amazon. If you want to try this camera, buy it from a place that will let you return it if you are not satisfied.", "Date": "March 7, 2009"}, {"Title": "Poor indoor pictures", "Author": "C. Glasgow", "ReviewID": "R2A9EQ46A9ABH9", "Overall": "1.0", "Content": "I have owned this camera since July.  My pictures taken outside are good, but any pictures I take inside are terrible.Everything from them being very dark (even with the flash, and in a room with all the lamps on), to having them people look like they have jaundice!  I just downloaded all of my pictures from Christmas and out of 100 of them I would say that 10 are alright.After having an Olympus for 8 years, I thought I would get a new camera with more mega pixels.Plus, with a sony you have to use a \"duo stick\" memory card.  The types that is never on sale for a really good price.I would never buy a Sony camera again!", "Date": "December 28, 2008"}, {"Title": "Amazing", "Author": "Nelson Andres Rosales", "ReviewID": "R231RJ1RE3JAFT", "Overall": "5.0", "Content": "very nice camera.. i bought for my mom but im planing to buy one for me because i has a lot of features for the price.", "Date": "September 15, 2008"}, {"Title": "camera ciber shot", "Author": "Jaime Garcia \"Apache\"", "ReviewID": "R2YTGOY4OQU3DM", "Overall": "5.0", "Content": "Real good item. I've got what I wanted seeing the prop on TV. I've got pretty nice pictures from it, family, scenery, fun pictures whit the smile  gadget. I think I've got a real good price for it. Congratulations.", "Date": "June 21, 2008"}, {"Title": "Not what I expected", "Author": "M. Edwards", "ReviewID": "R20FWFFL7FMUWJ", "Overall": "1.0", "Content": "I bought this carmera with high expectation that the quality would be perfect since it is a 10.1 megapixcel carmera.  The photos are awful.  At nights even worst, you can never get a photo if it does not look as if it is in motion. Secondly it comes out really dark.  I reget the money I paid for this carmer.  i had an old hp carmer of 2.1 megapixcel and the quality of photos were alot better.  don't take your money and buy sony carmers. It is just not good", "Date": "March 28, 2009"}, {"Title": "Great Features, Great Price, and Great Service. A triple play.", "Author": "Woodard E. Copeland", "ReviewID": "R197HPZW7PE645", "Overall": "5.0", "Content": "Nothing better than a triple play. The seller got this camera to me ASAP. It has all the features, bells, & whistles I wanted. Had a really good price compared to the rest of the places I shopped. Was so good I bought this one for my wife and another for one of my daughters.", "Date": "March 21, 2009"}, {"Title": "Great Camera", "Author": "E. M. Green", "ReviewID": "R2K8I1H5F3X0EY", "Overall": "5.0", "Content": "I love this camera! It's such great quality! I had recently bought this very camera, but in pink about a year ago. The reason I bought a new one was because of my own stupid actions. Long story, short I messed it up pretty badly. I'm not going to lie I can be VERY clutzy sometimes.I missed this camera so much so I bought it again. And I'm very happy with it. It takes beautiful pictures. You can visit my deviantart page to see. I take photos with it and they come out the best! I'll show you a link down later.And I love the fact that I can record videos! That's the only way I'd be able to upload my videos up to youtube! If you're curious about the quaility you can check out my channel too! XDMore of the recent ones are used with the awesome camera! :]Well, thank you so much Amazon for selling this camera. It's perfect for me! :D[...]", "Date": "March 20, 2009"}, {"Title": "Amazing pics!!!", "Author": "L. J. CHETTY \"freespirit81\"", "ReviewID": "R1TUQON239UF4H", "Overall": "4.0", "Content": "I love, love, love this camera!!!Takes great pics even in low light! I actually read a bunch of reviews on this w/site before purchasing this camera and I see now that all the best reviews are true!! Only taking reg pics right now and I love it...can`t wait to use ALL the features when travelling!:)", "Date": "January 18, 2009"}, {"Title": "Sony is sony...no more to say", "Author": "Moyad F. Alrabadi", "ReviewID": "RMJWMNC7VXQC2", "Overall": "5.0", "Content": "This is my second sony and you know what, after I gave my first one away I felt so bad so I started looking for another one And I saw the reviews for w170 and I bought it.The only thing I have to say is this camera is amazing. the only thing you need to get the maximmum of this camera is an 8 gig sdhc card.", "Date": "January 17, 2009"}, {"Title": "BEST OF THE BEST", "Author": "P. Garcia \"HomeStudio\"", "ReviewID": "R2OEHPB86D6IUC", "Overall": "5.0", "Content": "This is an easy product to describe... for its price its easily one of the most powerful cameras i ever had. Pictures are colourful, sharp and definetively BIG, 10.1 MP is no joke!The Camera itself feels pretty solid and goodlooking, actually that was one of the main reasons that i bought it because i don't like how \"Canon's\" looks like no matter canons are great machines..to me is a perfect 10/10.", "Date": "November 29, 2008"}, {"Title": "Great Camera", "Author": "J. Martin", "ReviewID": "R5EPL64XCPOGA", "Overall": "5.0", "Content": "This is a great camera for all around use.  It takes very good pictures and its very easy to use.", "Date": "October 24, 2008"}, {"Title": "Gotta love the face detection feature", "Author": "A. Hanson \"ClubDubMama\"", "ReviewID": "R205Y3YJ71FFAM", "Overall": "5.0", "Content": "Awesome camera... I bought it because of the face detection feature.  The battery has a long life!", "Date": "September 29, 2008"}, {"Title": "Good camera with one huge flaw", "Author": "loafer", "ReviewID": "R1GWVVSXR5GCFX", "Overall": "1.0", "Content": "This camera takes decent pictures in a variety of situations, including low light.  In fact, it is the best of the four cameras that I have tried in low light situations without flash.  However, it has one flaw which caused me to return it in favor of a canon a2000, which is, while the lens is extended, the camera makes a continuous grinding noise, like a cheap plastic wheel spinning.  It is not loud and you have to put your head to the camera to hear it.  Big deal, right?  Here's the thing.  When you record video, the microphone picks this sound up.  Anything recorded indoors (or any situations without much background noise) will render a recording with this grinding noise in the background.  I don't want that in my family videos.  I thought it was a defective camera, so I exchanged it.  The second camera did the same thing.  I talked to sony support.  At first, they tried to deny it, then finally called it a \"normal function\" of the camera.  So, I returned it and bought a Canon A2000, which is bulkier, but has the same amount of mp and has a 6X optical zoom.  One more note, what's with the price fluxuation?  I bought it here (from Amazon, but other sellers were competitive) for $179.00 a month ago, and now the price is over a hundred dollars more???", "Date": "February 21, 2009"}, {"Title": "I got a lemon.", "Author": "J. Alexander", "ReviewID": "R3LAPDJ5P0EDSD", "Overall": "1.0", "Content": "I got this as a Christmas gift for my wife.  After completely charging the battery it worked for about 2 pictures.  Then everytime I tried to take a photo the camera would flash and click but would power off.  No I did not accidentally hit the power button.", "Date": "December 26, 2008"}, {"Title": "Awsome camera!", "Author": "Ana C. C. Santos", "ReviewID": "R208Q4VJ3ZL4JS", "Overall": "5.0", "Content": "As many Sony products this camera is great! it has so many functions, it shows the pictures as slides with sound playing back. Best purchase!", "Date": "June 19, 2008"}, {"Title": "Excellent Camera", "Author": "Kuppast", "ReviewID": "R2YTEZ1SBTGT9O", "Overall": "5.0", "Content": "I like sony cameras because of their quality products. The pictures are nice and camera is easy to handle. Sony rocks........", "Date": "February 27, 2009"}, {"Title": "good condition", "Author": "Adeshola Andu \"adeshola andu\"", "ReviewID": "R1FDID8J6MXNQ3", "Overall": "5.0", "Content": "Sony Cybershot DSCW170/B 10.1MP Digital Camera with 5x Optical Zoom with Super Steady Shot (Black)", "Date": "December 12, 2008"}, {"Title": "Awsome Camera!", "Author": "Jim McGiveron  http://nosmokejim.blogspot.com...", "ReviewID": "R382124PZGTKJU", "Overall": "4.0", "Content": "Sony has been around for a long time,and they have a great reputation,allmy stereo components are Sony.This Sony camera is compact,lightweight,and takes great photos.Great zoom,much better than most cameras,the overall performance is awsome!", "Date": "November 4, 2008"}, {"Title": "Sony DSC-W170 its the best choose! 10.1 mp!! do you want more?", "Author": "Betty Josefina Franco", "ReviewID": "R3SUT1WPEJTBZC", "Overall": "5.0", "Content": "ok it a 10.1 mp camera, easy to use, the lcd screen its the best!!!, the battery 10 points!!you can take a lot of pictures with no problems!!!", "Date": "June 6, 2008"}, {"Title": "Una Camara Espectacular", "Author": "Guillermo Escalona", "ReviewID": "R25AXZ6NNWB13P", "Overall": "4.0", "Content": "SaludosEs realmente una camara excelente, excelentes funciones, sin embargo son tantas que aveces selecciono la equivocada y sale mal la foto; eso es lo unico que tiene que tomar en cuenta la persona que se decida por estos modelos, NO hacen todo el trabajo por nosotros.Es realmente comica la funcion del smile shotter, y estoy feliz con la calidad de la imagen y el video. Aparte que ahorre mucho dinero adquiriendo el producto a través de Amazon.Todos saben la calidad y los beneficios de tener una camara Sony Cybershot DSC-W... son realmentes unicas en su tipo.", "Date": "January 24, 2009"}, {"Title": "Not good enough", "Author": "Willis José Rodrigues Filho", "ReviewID": "R2DAYJ9VK5NN5X", "Overall": "5.0", "Content": "This camera it's not good enough!!!You can't make zoom while you are filming something. The resolution is not so good that I though.", "Date": "February 24, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "10.1-megapixel Super HAD CCD captures enough detail for photo-quality poster-size prints\nCarl Zeiss 5x optical zoom lens; Smart Zoom feature\n2.7-inch Clear Photo LCD display; Face Detection\nSmile Shutter mode; in-camera retouching\n15 MB internal memory; capture images to Memory Stick Duo/Pro Duo media", "Name": "Sony Cybershot DSCW170/R 10.1MP Digital Camera with 5x Optical Zoom with Super Steady Shot (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41cMp7WTJfL._SX300_.jpg", "ProductID": "B0012Y2JTS"}}