{"Reviews": [{"Title": "Nice features but average quality pictures", "Author": "DH", "ReviewID": "R28O8TC64KT8XP", "Overall": "3.0", "Content": "Firstly, I love the styling of the EX-Z9, it's a neat, tidy camera that looks and feels cool.  With the right case it's pretty much a go anywhere camera.  I've got large hands and sometimes the controls can be a little fiddly, but I manage okay taking shots.  Some reviews have criticized the LCD screen, but I find it does the job nicely.  Although it is a budget entry level camera, it does have a decent set of functions to allow you to play around with settings, if you get bored with the auto mode.  The access to the battery and SD card is easy and efficient.  You will find some detailed reviews of this camera on some of the more well known digital camera review sites.  The EX-Z9 is generally rated as an average camera.  From my experience with the camera,  8 months, the photo quality is a little hit and miss.  This is the general theme of the reviews I have read also.  The camera often struggles to deal with anything but perfect lighting conditions.  It hasn't been a good performer when taking pictures at night, or in harsh light conditions.  Thankfully, I enjoy snapping away and will take plenty of shots of a subject, in the hope that I may get a good one.  And for snapping away it's a nice little camera, just don't expect great shots every time.  Macro mode is pretty useless by the way, the EX just can't get in very close as it struggles with focus.  The movie capture is good.  Important note, if you want to explore more of the features of  the camera, toss out the hard copy manual that comes in the box and download the manual in pdf form from the casio web site, and I think it may also be on the Amazon page.  The hard copy manual doesn't tell you even the basics.  CONCLUSION - I like my Casio EX-Z9, for it's styling and portability and it's good price.  As a budget camera that takes average shots it is a good little buy.  If you really are concerned about photo quality then you may want to look elsewhere.  p.s. attach the cord to the camera and put it around your hand or wrist when you use it, these cameras are so small and easy to drop, particularly when you give it to your girlfriend or wife to take a picture  (-:", "Date": "January 27, 2009"}, {"Title": "Great Camera!", "Author": "Mintyfresh319", "ReviewID": "ROXL2KQ2UNH65", "Overall": "5.0", "Content": "I actually had the older model of this camera but accidentally left it on an airplane, so I came back and ordered another. I LOVE it. It takes quick shots and I love that the self-timer feature has the option of taking multiple photos at once--minimizing the trips running back and forth from the camera to the crowd. Get it!", "Date": "January 21, 2012"}, {"Title": "excelent camera.. i love it", "Author": "Tony", "ReviewID": "R1ZS3TS1BPDNQH", "Overall": "5.0", "Content": "I once had an HP camera and it only lasted me a year, then by warranty they gave me another and I also drive a year, so I decided not to buy more cameras HP. That is why buy a camera CASIO. This is a very good camera. their roles and everything he does, even I have and I do not regret buying ityo antes tenia 1 camara HP y esta me duro solo un año, luego por garantia me dieron otra y me duro tambien un año,asi que decidi no comprar mas camaras HP. Por ese motivo compre una camara CASIO. Esta es una muy buena camara. sus funciones y todo lo que hace,aun la tengo y no me arrepiento de haberla comprado", "Date": "January 5, 2011"}, {"Title": "Meh.", "Author": "Dawn", "ReviewID": "R2AYMG8PNS1BHU", "Overall": "2.0", "Content": "I got this camera when I was in ninth grade, lemme just say that I loved it--until, suddenly, it \"broke\" (a.k.a. a friend stepped on it when she accidentally took it in the dressing room) and messed up the shutter.  It wouldn't close and it couldn't be fixed.The photos are good quality for a simple point-and-shoot, though, so that's good.  As a photography student I needed something a bit, well, better.", "Date": "October 13, 2010"}, {"Title": "Horrible!", "Author": "Amazon Customer \"Poopsmear\"", "ReviewID": "R2709O5P5C3V1I", "Overall": "1.0", "Content": "Horrible Camera.  It stopped working 4 days after the warranty expired!  My quote was 100 dollars to fix, no thanks, I sold it.  Horrible customer service, horrible product.  I'm going back to Sony.", "Date": "December 22, 2009"}, {"Title": "Great!", "Author": null, "ReviewID": "R1Y2YZEN7MGJRL", "Overall": "4.0", "Content": "This product was easy to use and the pictures are good. The camera is small and will fit in any pocket. I am not disappointed I purchased this camera.", "Date": "July 5, 2009"}, {"Title": "Great Camera", "Author": "C. Fernandez", "ReviewID": "R2O9TMFU4EASVZ", "Overall": "5.0", "Content": "I've owned this for almost a year now and I consistently get compliments on it! The quality is excellent and the flash is bright when necessary. For $100 this camera was perfect.", "Date": "May 4, 2009"}, {"Title": "CAMERA IS AWESOME", "Author": "Eloy E. Wilton \"B wil\"", "ReviewID": "RX2EV2IBRV1EQ", "Overall": "5.0", "Content": "sHipping was fantastic from this guy.  Love the camera...does a great job with any function. GREATTTT", "Date": "April 14, 2009"}, {"Title": "long time casio fan- unhappy", "Author": "heather \"heather\"", "ReviewID": "R26J2J53FLEJ8R", "Overall": "2.0", "Content": "We had the first generation of the casio exilium, that finally died a few months ago.. so it was a no brainer to get another.  However, I am very unhappy with this version. Most of the pictures are blurry and and light balancing is never correct.  For a camera that is supposed to be a point and shoot, it misses the mark.  I would return it if we hadn't waited to so long. Anyway, if  you only want about 1/2 of your photos to come out, this is the camera for you.", "Date": "April 6, 2009"}, {"Title": "Compact and full features for the price", "Author": "Jorge Roman", "ReviewID": "R21DVBL4I0V7SQ", "Overall": "5.0", "Content": "This is a compact camera and have many features that makes very attractive for a point and shotter, begginer user for a digital camera.Plus, the casio warranty comes with a extention over latinoamerica wich makes easy go to an store, wich are a lot in Venezuela for example, and change the damaged camera.I forget, the huge lcd screen makes very very attractive.", "Date": "March 24, 2009"}, {"Title": "nice for the price.", "Author": "Joseph A. Bocci", "ReviewID": "R11CKXJT3VB7OZ", "Overall": "5.0", "Content": "bought one for my son, daughter and wife and they all love it's ez to use function and semi pro results. you won't be sorry for this one...sweet colors too. the green is RAD!", "Date": "February 27, 2009"}, {"Title": "I really like this camera", "Author": "Robert Colladay \"Do be do be do...\"", "ReviewID": "R5OGKJRQ0MZD", "Overall": "5.0", "Content": "This camera is exactly what I was looking for.  Does better than average video (the better the lighting the better the video), and great snapshots.  The battery life is acceptable but I will probably be buying another backup battery.", "Date": "February 18, 2009"}, {"Title": "Fantastic Deal for a great camera in price range!", "Author": "Paul M. Merullo \"Rockinpablo...Ola!\"", "ReviewID": "RJYIRYX0OCL2X", "Overall": "5.0", "Content": "Wow, found this camera on Amazon for at least $40 cheaper than anywhere else, plus the peripherals (case, 4G card) were cheaper as well. The camera itself has a lot of functions, and I am a complete digital camera beginner. A little time learning the functions is helpful. For the most part with my limited knowledge I have gotten some really cool pics. My friend who knows more about them took pics of me and they came out great! Camera comes with software that's easy to use and upload pics. I have not yet used the video capture/Youtube feature, but apparently does up to 10 mins of vid. Pretty cool, well constructed little machine. Screen is pretty big too to view on. Very happy customer. Thanks Amazon!", "Date": "November 9, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "8MP with 3x zoom\nFace Detection\nYou Tube ready\nBest Shot modes", "Name": "Casio Exilim EX-Z9BK 8MP 3x Zoom 2.6-Inch LCD Screen Digital Camera (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51Opyonws7L._SY300_.jpg", "ProductID": "B0015ZW4OE"}}