{"Reviews": [{"Title": "Great Deal & Amazing Camera!", "Author": "K. Jones", "ReviewID": "R3QU1EK5EDRMPI", "Overall": "5.0", "Content": "I think this is a great deal (I got it for [...]).  If you are paying the full [...] that they say it is worth then I don't know if it is cost effective.  Let me review individual items so you know what you are getting.First off, this bundle comes with screen protectors.  I think that is a waste.  The camera comes with a think plastic screen cover for the display.  So why would you want to put a thin flexible cover on it instead?The camera case it comes with is okay.  I am glad it came with one because otherwise I wouldn't have one, and it saved me the effort of going out shopping for one.  But I think it is a bad case.  It comes with several removable dividers for the main compartment, but if you put any of them in then the camera doesn't fit.  From my experience people who use SLRs have multiple lenses.  This case does not allow you to carry more lenses around with you.  It can however fit the charger, spare battery, spare memory cards, your hood, and the memory card reader that this kit comes with.The memory card reader that it came with is great!  It can store an SD card in it and then it has a hard plastic cover that closes the card inside keeping it safe.  So you can use the card reader to store an extra SD card.  It also comes with a USB extension cable which is great if you have too much congestion to fit the card reader in a given USB slot. (An interesting note about the memory card: the one that came in my package was not on the list of \"supported\" cards for the D90.  This doesn't mean much at all, but if you care about it then be aware. Although it may be different for everyone who buys this package. I say that because the picture of items is not completely accurate. The tripod is different colors and the memory card reader is different.)I haven't tried the lens cleaning kit yet, so I can't evaluate its effectiveness.  It looks to me as though I will go through the cloths and solution quite quickly though.  So you probably want to invest in a bulk size container of cleaning solution and cloths.The spare battery that it comes with actually has more juice than the one that Nikon sells with the camera.  That makes it even better!The memory card size is dependent on you.  If you take pictures at the standard quality then it can hold about 2100.  If you are taking pictures at the highest quality then it can hold about 1000.  And if you are taking pictures using RAWs it can hold about 530 pictures.The monopod is exactly that.  It has a fixed mounting point.  It has the option of a spike tip bottom or a rubber bottom.The tripod is very light.  It has a lot of easily adjustable parts.  It has two built in levels to help you keep it angled correctly.  The part that mounts on the camera has a quick release from the tripod, to allow you to easily pick up your camera and carry it around.I can't say much about the lens it comes with, because a lens is very specific to the situation that it is being used in.  The quality of the lens is great, so that is not in question.  Let me explain what I mean.  When I bought this package I knew nothing about advanced photography.  I had only ever used a point and shoot camera on Auto mode.  So basically I had no idea what lens I wanted.  I suggest that if you don't know much about lenses then you do some research before you buy this. I will give you some info in basic terms.  The lens it comes with  is a zoom lens.  I like having a zoom lens because it means that you aren't locked in to one set position.  The problem with zoom lenses is that they don't let in as much light as a fixed lens, so to compensate you will have to have longer exposures in low light conditions (Obviously if you use the flash this isn't an issue, but the built in flash isn't very good.).  A fixed zoom lens lets in more light which allows you to take pictures using faster exposure times.  This results in less chance of blur.  The lens it comes with has Vibration Reduction.  Vibration Reduction is a nice feature, and it does help greatly, but it uses a significantly higher amount of power. The lens it comes with also focuses much faster than the old lenses used to.  I almost never miss a shot due to focus lag, which is much different than with a point and shoot camera.Now let me review the camera itself.  As I said when I bought it I had no idea what I was doing or what any of the features were.  It only took me a week to learn most everything.  Obviously I am still far from a professional.  But I also now know how to use the manual mode very effectively.  The best way to learn is to use the camera and experiment.  The manual does a very good job of explaining things, but you will still have to look up terms here and there.  My suggestion is to use [...].  It helped me a lot.  My point about this is to say that the camera is not too complex.  It has a very nice and simple interface.  Although if you plan on buying it and just using it on Auto mode, then this camera isn't right for you.  You don't really need to spend this much money if you aren't going to use all the features that it comes with.  The camera itself is a solid camera.  It functions great and is very fast!  The main reason I wanted it was to be able to take pictures fast.  It turns on faster then you can more your finger from the on switch to the shutter release button and press it.  It shoots 4.5 frames a second which is plenty fast enough for an advanced amateur. The built in flash on the camera is just the same as a point and shoot camera.  It is better than nothing, but it isn't very good quality at all.  The camera itself takes amazing pictures!  They are so much crisper and higher quality than even a good point and shoot camera. The battery life on the camera is very good.  Nikon claims 850 shots per battery.  If you drain the battery taking pictures in bursts then you can get over 1500.  If you turn the camera off when you aren't using it then you will also get well over 850 shots.  However if you leave your camera on for extended periods of time between shots then you will get around 850 shots per battery.Bottom line: I recommend this package if you want to get serious with photography and you don't have all the gear that comes in this kit.I'm not going to give out my email address, but if you have any questions and there is a way to contact me through amazon then feel free to.  I hope this helps.", "Date": "October 31, 2008"}, {"Title": "Simply Outstanding", "Author": "Stephen P. Scafone", "ReviewID": "R3QVMYBRXHSW9", "Overall": "5.0", "Content": "I am new to DSLR cameras and to be honest I was very intimidated when I opened the box.  Now, a few weeks later, I am in love with this camera.  Never, and I mean never, will I ever go back to a point and shoot camera.  I am not a pro, nor will I impress you with vast knowledge about this cameras features, but what I will tell you is the picture quality is simply amazing.  It's like I haven't ever taken a photo before.Once you get familiar with what f stops do, what shutter speed does, how a flash will effect you pictures, you will get somewhat addicted to taking pictures.  And once you realize how changing these settings change your pictures, you will quickly be taking high quality photos.  Do a little reading, most of it for free all over the web, you will be able to produce stunning pictures.  The battery life for this camera seems to last forever.  I have to keep digging my charger out of the drawer because I use it so little.  The viewfinder was very confusing at first.  Mostly because I never handled a SLR camera before.  Do yourself a favor and read the charts in the manual that explain what each one means.  This seems obvious but many people shy away because they feel they will never get it.  Trust me, you will.  I went with the D90 because of the live view on the LCD.  To be honest, I use it very little and would rather use the viewfinder now.  Focus seems to take longer with live view and I'm sure it would eat the battery up faster.  The LCD displays pictures nicely and I can't think of one complaint about it.  You will have to hold down small buttons on various locations on the body of the camera while turning a control wheel.  This was also confusing at first but it seems almost natural now.  The only button location I do not like is the depth of field preview, I have a little trouble finding it without looking, but I use it very little anyway.A tripod is a must to get nice photos, which is why I'm glad I picked this kit package.  Yes, it's not a expensive model and it has a cheap feel to it, but it gets the job done.  The cleaning kit is also very important as I had to use it 2 weeks in.  The SD card seems to save photos very fast, faster then anything I will ever tap into.  Not sure why I needed 2 USB card readers, since most computers have SD slots built in, but that really wasn't the selling point of this package for me.  The extra battery was DOA, would not take a full charge.  However, the fine people of ACE photography who sold me this kit shipped me a new one ASAP.  The camera bag is a little small but gets the job done and protects your camera.  It is not going to withstand a major impact like a hard shell case would, but for most regular folks it's fine.I also purchased the remote shutter release which is a nice addition to have.  I have used this many times with low light, longer shutter speeds.  The UV lense filter they sent was the wrong size and does not fit the lense.  That is the only major complaint I have.If you are looking for your first SLR camera, this kit is it.  It has everything you need to get going.  I'm not sure why they call this an entry level camera.  The photos I have taken rival that of pros.  Perhaps it's the smaller things, like not being weather proofed.  I don't know since I'm not a pro.  Nikon has my business from here on out until they sell me a lemon.  I really don't see me buying another Nikon for a while but if I do, they have my business.  Just remember a couple of things.  I never handled a SLR camera before and after 4 weeks, I am taking great photos and have learned how to use the majority of it's major modes and features.  I am far from a pro but my photos are looking more and more like that with every passing day.  You will make a wise purchase if you get this kit.", "Date": "March 27, 2010"}, {"Title": "Pretty good", "Author": "M. Zhao \"Skipper\"", "ReviewID": "R2WR2LNNYZ6NAT", "Overall": "4.0", "Content": "Very good product and service.  Only wish to know in advance that the shipment was in two batches from two different places. I thought they shipped wrong and had to call to confirm, only to find out the second one was on the way. Other than that, all was perfect.", "Date": "December 28, 2008"}, {"Title": "Great product and service", "Author": "Y. Shen", "ReviewID": "R21TQZX65WVY7Y", "Overall": "5.0", "Content": "As an entry level DSLR camera user, I found this one great. Easy to use and has advanced functions that you can use when you have more knowledge of photography later on. The accessory kit is helpful, you get basically all that you need.", "Date": "October 15, 2009"}, {"Title": "Camera is great", "Author": "thecameraman", "ReviewID": "R51W5RFM925FQ", "Overall": "5.0", "Content": "The p90 is an great camera! Shoots fast, its easy to use, and if you are looking in the menu and dont know what something is just hold the ? button and it tells you. the 18-105 lense doesnt zoom that much, but after you take the pic you can trim and zoom in really far right on the camera. THIS SELLER SUCKS (Ace Photo Digital) though. They didn't sent the right bag, or a tripod and the camera wasn't vac sealed. I sent them an email and they said they would send the right bag and a tripod. then I didn't hear from them for a long time. I had to send another two more emails before they would respond. They kept it short and just said the items were in the ready to ship stage. Then the next day they sent an email saying, Unfortunately the items in question are no longer available. So the camera is very cool, just buy it somewhere else.", "Date": "May 19, 2011"}, {"Title": "Ace Photo Digital", "Author": "OldCanUser", "ReviewID": "R2DAAWU47VI8AR", "Overall": "5.0", "Content": "My review at this time is for the company Ace Photo Digital regarding the Accessory the Battery Pack (ZE-ENEL3E). I discovered at least 4-5 months, well outside of the warranty, after I purchased the Nikon D90 and the Accessory Battery Pack (ZE-ENEL3E) that the accessory battery pack would not take a charge. I contacted Amazon who contacted Ace Photo Digital. Ace Photo Digital contacted me almost immediately. They waived the warranty and sent me a new battery pack. They could have just cited the warranty and they would have been well within their right not to do anything. I deem this to be excellent customer service and could not let this act go without saying something. Thank you Ace and a special thanks to Neidy Betancourt, your Customer Satisfaction Specialist.", "Date": "March 1, 2011"}, {"Title": "Over The Top", "Author": "John Smith", "ReviewID": "R2ZKAM9N44ZF98", "Overall": "5.0", "Content": "This camera is awesome.  There is no way to tell the feel of this body.  It feels good and delivers great photos, and can fix what you missed.  The video feature is overplayed, but acceptable.  A larger sensor would be nice.", "Date": "April 20, 2009"}, {"Title": "nikon d 90", "Author": "Jennifer A. Mcclary \"Jenn\"", "ReviewID": "R7S9B7MD2D7E2", "Overall": "5.0", "Content": "I absolutely love this camera, the quality of pictures are excellent.  It is a very good camera for action shots at the kids ball games. I am not very good with electronics but this camera is easy to use and even I figured it out.", "Date": "April 23, 2010"}, {"Title": "The Nikon D90 is a great buy.", "Author": "F. Yans", "ReviewID": "R17G26MB96YZU7", "Overall": "5.0", "Content": "All I have to say is that for anyone wanting a great camera for someone experianced or as someone looking to start taking professional level pictures, this camera is the one.  Either in Auto or Manual mode this camera has it all.  If you are one who likes shooting video, the 1080p video feature gives some of the best video available without having to purchase a seperate camcorder. The extras added to the package save you money in the long run and make it worth while spending the little bit of extra cash.  Follow the link and see for yourself what a great experiance the Nikon D90 can give you.  Nikon D90 DX 12.3MP Digital SLR Camera with 18-105mm f/3.5-5.6G ED AF-S VR DX Nikkor Zoom Lens or one of the bundle kits offered Nikon D90 Digital SLR Camera with 18-105mm AF-S DX VR Nikkor Lens [Outfit] + 16GB Cameta Bonus Accessory Kit", "Date": "March 16, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Nikon D90 12.3MP Digital SLR Camera - Body (includes manufacturer's supplied accessories)\nNikon 18-105mm f/3.5-5.6 AF-S DX VR ED Nikkor Lens - 5pc Deluxe Lens Care Cleaning Kit\n8 Gigabyte SD Secure Digital Memory Card - Secure Digital USB Card Reader - Universal Memory Card Wallet - Pack of LCD Screen Protectors\nAdditional EN-EL3E Reachargeable Lithium ion Replacement Battery - Well Padded Multi Compartment Gadget Bag with Pockets & Strap\nFull Size 59\" Tripod W/Case - BONUS!! Jumpstart DVD Guide to Digital SLR Cameras - Free 25 Quality Prints (Promo code # on invoice)", "Name": "Nikon D90 12.3MP Digital SLR Camera With 18-105 G ED VR DX Nikkor Lens + 8GB DLX Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/510oyt9XyVL._SY300_.jpg", "ProductID": "B001GMQLA4"}}