{"Reviews": [{"Title": "A Nice Little Camera for Family and  Vacation Photos", "Author": "Timothy B. Riley", "ReviewID": "RJJED124H5BJ0", "Overall": "4.0", "Content": "I bought the Pentax Optio M50 as a gift.  I chose this model for the following reasons:*  It is small and compact enough to always have with you*  It is very stylish (especially for a young girl). We got it in Pink to go with her pink iPod.*  I wanted a camera with a minimum of 8MP which is plenty for home use (I have advanced digital SLRs with 8MP and they take pro-quality images)*  The zoom ratio (5x) was much better than those found on other cameras in it's class (usually 3x)*  I like the feature that automatically detects and exposes for faces (although the \"Auto-Smile\" feature seems to be a hit-or-miss feature so I don't suggest using it)*  It is a good value for the priceA couple of things to be aware of though:*  There is no optical viewer, you must use the rear screen to compose the image*  The \"shake reduction\" feature is not true electronic image stabilization, which you can find or higher-end cameras.  Instead it raises the sensitivity of the light sensing chip in low light which allows the use of a higher shutter speed at the same time giving you less detail in the resulting photo.  Nice feature, but not as nice as IS which reduces or compensates for actual camera shake electronically.Over all this is a great buy.  Just a few years ago a camera like this would have cost at least twice as much.  Considering it's features this is a very good value and Pentax is a name that you can trust.", "Date": "September 14, 2008"}, {"Title": "Light weight and beautiful pictures", "Author": "Graciela Saud Sandoval", "ReviewID": "R244VK6528FVLE", "Overall": "5.0", "Content": "It's a powerful camera even when you get it light weight at first impression.I recommend it, take beautiful pictures. Great quality.The smile capture feature is great, so fun!The zoom is a little to sensitive, it goes fast to the max value and you often have to zoom out to get the point you are looking for. But great if you want to go to the max zoom in fast.I'm very pleased with my camera.", "Date": "May 13, 2008"}, {"Title": "Great little camera.", "Author": "V. Valle", "ReviewID": "R8Y4XMPDZ84OT", "Overall": "5.0", "Content": "It's small and very light so you can take it anywhere.  Icons that are fun and easy to use.  Takes great pictures. I love the soft flash mode, the warm skin tone mode and the rechargeable battery.  The only thing is that I got it in pink, great color, but my little granddaughter thinks it's her toy!", "Date": "September 24, 2008"}, {"Title": "Mostly good.  A couple of small complaints.", "Author": "J. Jerome", "ReviewID": "RD06E5CWG9DLQ", "Overall": "4.0", "Content": "First the positives: - The screen is large and clear. - Camera body is compact and seems very durable. - The menus are surprisingly easy to navigate considering how much functionality is crammed into this tiny device.  The manual is over 200 pages long; you'd expect this to mean the camera is complex to use, but it's actually very intuitive. - Auto focus works well, even at very close distances, and the shots are clear and free of shake. - Mounts up to a computer just like any standard USB device.  F-Spot under Linux sees it just fine.Now the negatives: - Focal length of the lens is such that indoor shots tend to curve straight lines at the edges of the frame. - Has USB connection, yet will not charge the battery through it.  You have to remove the battery from the camera to charge it. - Charger is small and light, but its power cord is large and heavy.  This means the charger rarely stays where you put it; the cord's weight pulls it off the table.  I solved this problem with an old cord and a plug (see pix: [...] and [...]  But most people probably will not want to tinker this way.Some people have complained that it does not have an optical viewfinder.  I rarely ever used the optical viewfinders on my previous digital cameras so this does not bother me.All in all I like it much better than the Kodak it replaced.", "Date": "December 12, 2008"}, {"Title": "Great little camera!", "Author": "S. Johnson", "ReviewID": "R19WT3BWMXJGPO", "Overall": "5.0", "Content": "I have really enjoyed using this camera in the last few weeks. It takes great pictures, but what I like, perhaps most, about it is the speed of picture taking. It takes it's first picture nice and fast so you can actually get a picture of what you wanted! And it also takes consecutive pictures fast as well. I would highly recommend this camera for someone who wants to take good, easy pictures while having a bunch of great features too!", "Date": "November 23, 2008"}, {"Title": "Camera may be ok, but Pentax Isn't!", "Author": "J. Cannata", "ReviewID": "R15QNH5M7MQ69D", "Overall": "1.0", "Content": "I bought the M50 a few weeks ago new...got a lemon...wouldn't focus, and the colors weren't anywhere near true! It happens. I sent it back to Pentax under warrantee, on my dime, with a detailed description of the camera's problems, fully expecting them to make it right. I got it back a few days ago and they didn't do a thing to the camera!! Nothing was fixed even though they sent a report with the camera saying it was! I talked to the retailer I bought it from, and since they are reasonable people, they refunded my money. If you bought one and it works well, I'm happy for you. But if you have problems down the road with it, be prepared to be completely disappointed with Pentax customer service! Based on my experience with Pentax, I certainly won't buy anything they make again!", "Date": "December 6, 2008"}, {"Title": "Very slow reaction time - not for people with kids", "Author": "MDV \"Matt V\"", "ReviewID": "R2VZPPAX6EU2YG", "Overall": "1.0", "Content": "Overall very disappointed and not unhappy that it recently died after an incident at a waterpark.  This camera is not for people with kids who need to capture the moment quickly.", "Date": "September 3, 2009"}, {"Title": "Decent Camera", "Author": "S. Deaven", "ReviewID": "R2I6F0GHDXD5MH", "Overall": "4.0", "Content": "Nice camera for the price. I like the auto smile feature. Lightweight and easy to use.  Able to recover photos after they have been deleted.  Would recommend this camera.  I bought 2 of them.  A pink one for my daughter and a blue one for my son.  They both enjoy using these cameras.", "Date": "November 29, 2008"}, {"Title": "Great camera!", "Author": "J", "ReviewID": "R29GFZ1CICCJ36", "Overall": "5.0", "Content": "My Dad gave me this camera as a gift and while Im not too prone to taking pictures, when I do its nice to have this camera around. Plugs straight into your computer for easy transfer and takes amazing shots!", "Date": "November 9, 2011"}, {"Title": "Poor picture Quality, Not the Best Camera.", "Author": "April", "ReviewID": "R1AXVF96OJBHP8", "Overall": "2.0", "Content": "The reviews sounded great, but once I got the camera I was pretty dissapointed to say the least! For the money, yes...It's an ok camera, (If you really don't careabout having a ton of blurry pictures)", "Date": "April 21, 2011"}, {"Title": "Great camera", "Author": "Claire", "ReviewID": "RWF7H1P2HHBIZ", "Overall": "5.0", "Content": "This camera is awesome.  It is so small and portable.  I take it everywhere.  The picture qaulity is amazing considering it's size.  The only downfall would be the quaility of pictures at night or indoors under light.", "Date": "July 24, 2010"}, {"Title": "Poor picture quality", "Author": "Saly", "ReviewID": "R359MVR3VWGX2I", "Overall": "2.0", "Content": "The specifications sounded great but the picture quality didn't live up to it.  It's very easy to use and carry around, but colors look washed out the always a bit blurry.  I expected more from a 8MP camera.", "Date": "April 4, 2010"}, {"Title": "Love It!", "Author": "Nicole \"Nicole\"", "ReviewID": "R1QVV5GPG448TY", "Overall": "5.0", "Content": "This is the best digital camera I have ever had. GREAT pictures quality! just LOVE it!", "Date": "January 19, 2010"}, {"Title": "Daughter loves it", "Author": "B Happy,Fish \"WJP\"", "ReviewID": "R3S7LQHEWHOSY9", "Overall": "5.0", "Content": "Bought this for my 11 year old daughter and she loves it.  Uses the basic point and shoot to keep things simple.  Just make sure you dont misplace the charger.  You can't acess the memory with out the battery power and there's no way to charge it up without a charger or optional AC power.  Pics are good and it's easy to use.", "Date": "January 7, 2010"}, {"Title": "Dissapointed", "Author": "Kat lim Ruiz Kuan", "ReviewID": "R27H95FSSEVM8L", "Overall": "3.0", "Content": "This camera is pretty simple to use, It does have smile shutter, though it doesn't work too well.What I most dislike about this camera is that the night pictures are terrible!, really terrible!. Can't do them at all.Indoors are slightly better but really bad in the outside.I wouldn't recommend this camera.", "Date": "October 4, 2009"}, {"Title": "Pentax Optio M50", "Author": "M. Drumm", "ReviewID": "R3B1NM3E3VETY6", "Overall": "4.0", "Content": "Bought this for our 15 yr old daughter.  She was able to read the instructions and start using the camera the same day.  No problems and it is working as advertised.", "Date": "August 16, 2009"}, {"Title": "Excelent camera!", "Author": "Aquarius \"blackblue\"", "ReviewID": "R3K8SZRC54M67N", "Overall": "5.0", "Content": "Bought this camera about a year ago in a local store. I'm very happy with it. It's easy to use, and you get excellent pictures. With so many choices out there it's overwhelming when you are out to buy a camera. There are many excellent brands out there. I almost feel you can't go wrong with any of known name brands. I've owned Canon, Pentax, Sony, and Nikon. Happy with all of them. There are always new camera's on the market, so I'd say shop a little for what's recent, and make a decision depending on your needs and budget.", "Date": "May 1, 2009"}, {"Title": "Great little camera!  My wife loves it.", "Author": "Anthony", "ReviewID": "R361B8NTSVM5YW", "Overall": "5.0", "Content": "I bought this as a Christmas gift for my wife.  It's a great little camera with some very nice features.  I especially like the panorama mode.  It allows you to take 3 pictures and the camera automatically stitches them together.  Really cool!", "Date": "February 4, 2009"}, {"Title": "Wonderful camera, wonderful price", "Author": "Kelly Haren \"hydroman\"", "ReviewID": "R3QO4WZ6YASTG8", "Overall": "5.0", "Content": "Ordered two cameras for Christmas for my teenagers, free shipping, arrived within a few days. They love them and the pictures look great!  Excellent zoom for a mini camera and it fits easily in their pockets.  Great deal for 100 bucks!  We have a Mac and the camera works great with it.", "Date": "January 23, 2009"}, {"Title": "Great Camera", "Author": "Carol L. Burkholder", "ReviewID": "R25J01CBOQUN6S", "Overall": "4.0", "Content": "I recently purchased the Pentax Optio M50 8MP Digital Camera with 5x Optical Zoom.  I love it!  I had a 3x Zoom on my previous camera and missed many pictures because the zoom wasn't adequate.  This little camera is terrific.  It has features that I wasn't looking for but am glad they were included.  It is very easy to use and I would recommend it to anyone looking to purchase a digital camera.", "Date": "January 15, 2009"}, {"Title": "Excellent value and wonderful product", "Author": "Dr. Mary Guen Wright \"Guen Wright\"", "ReviewID": "R2701G34CF7WZN", "Overall": "5.0", "Content": "I was pleasantly surprised about the wonderful camera and the features that were easy to use for someone who is generally inept at electonics. I recently took it on a trip and got some wonderful shots from the vacation and enjoyed it's small size but great quality.", "Date": "January 7, 2009"}, {"Title": "Great Camera!!", "Author": "Nancy L. Flippin", "ReviewID": "R3HH5HWKSMY7HY", "Overall": "5.0", "Content": "After a lot of research, I chose this camera for my teenage daughters.  I purchased two in different colors.  This camera had all the features they wanted, plus the right size.  This camera fits in their purses and travels well.  They have really enjoyed playing with it.", "Date": "January 7, 2009"}, {"Title": "Good camera", "Author": "Xin Guan", "ReviewID": "R1E85CPDP29BK0", "Overall": "4.0", "Content": "I have bought a pink M50 for one month. It works well. I am pleasent with its good looking, small size, and 5x optical zoom. But it only have digital shake reduction, not optical, so sharpness of the picture will be reduced when I used this function. However, considering its price, less than 100 when I purchased, it is a good choice.", "Date": "January 7, 2009"}, {"Title": "Fun to use GREAT pictures", "Author": "Kirsten D. Frye \"Kirsten\"", "ReviewID": "R1IL9G0FI5Y6LV", "Overall": "5.0", "Content": "This camera is phenomenal.  I originally had a Nikon Coolpix and was VERY unsatisfied with it.  This camera's options are SO easy to use and take beautiful pictures. A+++++++", "Date": "January 6, 2009"}, {"Title": "Nice camera!", "Author": "M. EXELBIRT \"Onesoul\"", "ReviewID": "R1BVN1GX351QJ3", "Overall": "5.0", "Content": "I bought this pink camera for my 8 yr old daughter who enjoys taking pictures.  She has slowly progressed to this level throughout the years.  We started off with disposable and then handed down our hand me down cameras as we bought more advanced ones.  She loved her camera and we find it to be easy to use for any age- colorful and has a lot more function then my Canon ELF.  It even has a panoramic shot feature! It is a little slow on the shutter when taking a foto- but other then that it is awesome.  We wanted a camera that didnt need AA batteries and included its own battery with charger and we could not beat the price we got it for.  It is a super camera. It is so user friendly that I am considering buying one for my 80 yr old Mom.", "Date": "December 28, 2008"}, {"Title": "great cameral", "Author": "John J. Gschwend", "ReviewID": "R2RDX6KBCIXSZ", "Overall": "5.0", "Content": "This camera with it's 5 power zoom is great. 100 percent pleased with the features on the camera and the prize cannot be beat.", "Date": "December 28, 2008"}, {"Title": "Camera", "Author": "Debi Kerns \"helilover\"", "ReviewID": "RW2E2YQK90NV4", "Overall": "5.0", "Content": "This camera is awesome.  It is handy being so small yet takes great photos.  The zoom is an excellent feature.", "Date": "July 26, 2008"}, {"Title": "Nice features but too flimsy", "Author": "B. Scharf", "ReviewID": "RXU06CKRFDQLB", "Overall": "1.0", "Content": "The camera takes very good pictures and movies.Unfortunately I owned it for about a month before the LCD display cracked.  Pentax considers cracked displays a non-warranty repair and the repair costs more than the new camera.  Considering the camera wasn't dropped or abused, I was very disappointed.This is my 4th digital camera.  I have also owned several PDAs.  I've never had a problem with a cracked display or any other mechanical failure until now.When engineers design a product, they have to balance cost, durability, weight and other factors.  While this camera has a lot of nice features for its price, it is just way too flimsy to be a good deal.", "Date": "December 18, 2008"}, {"Title": "pentax camera", "Author": "Janice Mayo", "ReviewID": "R216NG7G061ATO", "Overall": "5.0", "Content": "i love it i shake alot and i tryed my brothers and i took great pic's i was impressed. i had to have one. i do scrappbooking and need to take good pic of my family. i have two other camera and this is the best when u have shakie hands.", "Date": "July 2, 2008"}, {"Title": "DONT BUY THIS CAMERA", "Author": "ladywolfe31", "ReviewID": "R3A4S9BKWCQ9VV", "Overall": "1.0", "Content": "I bought this camera for my mom for Christmas and have had nothing but problems with it. I am saddened that Pentax, a name I normally trust, would create such a piece of junk. It will drain the batteries in minutes, without a memory card it will hold a whopping 1 picture on it's own, and it has trouble comming on when you change the batteries or take out the memory card. It's like it needs to re-boot itself for 15 minutes. I don't advise anyone to purchase it.", "Date": "February 12, 2009"}, {"Title": "maddog", "Author": "Ronald Maddox", "ReviewID": "R3VZFNC6KZGITD", "Overall": "5.0", "Content": "the camera is excellent, takes great pictures and is easy to operate. we liked it so much and our grand daughter liked it we bought her one.", "Date": "June 17, 2008"}, {"Title": "RIP-OFF", "Author": "Liane E. Proctor", "ReviewID": "R3K62A4PQATNVO", "Overall": "1.0", "Content": "I ordered this camera on 6/6 and have never recieved the product!!! Today is 7/11. I sent several e-mail's to the seller and I kept recieving notice that the e-mail was waiting to be delivered, for over 2 WEEKS!!! You can bet, whoever the seller is, CHARGED MY CC# within minutes of my purchase.This is the second time I have purchased something from AMAZON.COM and not recieved the product. NO MORE BUYING ANYTHING EVER AGAIN FROM AMAZON.COMNot that it matter's they never do anyhting about thes rip-offs EVER.. Sucks", "Date": "July 11, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.0-megapixel CCD captures enough detail for photo-quality 16x 22-inch prints\n5x optical zoom; Digital Shake Reduction\n2.5-inch LCD monitor with wide viewing angle\nFace Recognition AF and AE\nCapture images to SD cards (not included); 51.1MB of built-in memory", "Name": "Pentax Optio M50 8MP Digital Camera with 5x Optical Zoom (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41p9D4TnGvL._SX300_.jpg", "ProductID": "B0012QE49Y"}}