{"Reviews": [{"Title": "Excellent Choice", "Author": "Senor Borracho", "ReviewID": "R1B3NUM8LDYJVZ", "Overall": "5.0", "Content": "I recently purchased the SCNC2607 IP-Cam to use as a video server that I could access from within my home on my PC's and iPhones, as well as to access the video from anywhere outside my home LAN if I want.Not requiring any special software to access this camera is the single most important item for me.  If you want to be able to log into a camera from anywhere in the world, on any machine that has a connection to the internet and a web browser of some type, this is the one.  There is also an included application called \"Multi Live\" which allows you to view up to 4 cams in one window.The camera itself was pretty easy to set up, and the image quality is superb!  No tricky setup decisions are necessary by the user to decide what type of streams are available to whoever logs into it from whatever platform.  If you log into it on an iPhone through Safari, the iPhone negotiates with the camera server software and automatically appends the URL with the \"/en/mjpgmain.asp\" extension.  If logged in from Internet Explorer, the basic URL automatically appends the \"en/avmain.asp\" extension.  All you need to do is type the URL of the camera into your browser and the rest is taken care of automatically.Safari on the iPhone will not process the audio stream, but this is not a problem with the camera, it is a limitation with Safari.  I have read that Safari on a Mac computer will also not process the audio stream.  I have tried various iPhone applications to process the audio stream, without success.  But the designer of IP Vision by TTrix software has written me that an upcoming version will process audio.  I have also tried this camera on a Sony PSP-3000 with the current firmware version (installed on 02-10-09) and current Flash update, but the device chokes up on memory limitations and can only process the jpeg still image.  Some tablet PC's and/or WiFi portable media players like the Nokia N810 or Archos 605 might work, but I haven't tried them.The default image quality settings don't need to be tweaked to lower quality settings unless your upload bandwidth gets maxed out.  For one login to the camera (over the internet from work) I was able to use the maximum quality settings and didn't see or hear any problems.  My connection at home is cable internet with about 128 Kilobyte upload and 5 Megabit download, so I was worried about upload speed.  With 8 users logged on, there could be issues requiring some settings tweaks, but that's more than most people are probably going to be worried about.  If you connect within your LAN then you don't need to be concerned with upload bandwidth, because the data isn't passing through your modem.There is a color setting, moonlight setting, and night vision setting, but I choose to let the camera do what it thinks it needs to do and have left these controls in automatic.  The night vision works even in absolute darkness, and the image is crisp and clean. There is a setting for motion detection, with variable parameters to offset alarms or recording from occurrences like ceiling fans or a bird flying past a window.When viewing the camera on your browser, you have some easy control buttons available to take snapshots in either .bmp or .jpg formats.  You can also record to your hard drive, in the .asf format.  Recording can be stopped and started with the \"Record\" button, or started with the button and stopped by a maximum file size input that anyone logged in can specify.  These picture and video controls can be run by anyone you authorize in either the admin account or any user accounts you set up.The user accounts (an account created that is not the admin account) has no access to your settings for the camera, so it's a good one to send to Mom and Dad or your crazy aunt.  When they get to the logon screen, if they choose \"Enter\" they can see what's on your camera and record what they see and/or hear.  If they try to enter \"Settings\" then they are presented with the login username/ password box again.  As long as they don't have your admin password, then you are safe from unauthorized changes to the camera settings.For up to 8 concurrent logons, you don't need to create 8 separate guest user accounts.  One will suffice.  I have logged onto one guest account through a browser on my PC over the internet, through my iPhone on WiFi over the internet, and also through another browser on the same PC but using the LAN IP address.  That's pretty cool to be able to log on over LAN or WAN while connected through the same router the camera is connecting to.  Like if somebody chops up your internet cable connection with a ditch digger, you can still see the cam by using the LAN address.The instruction manual supplied with the camera is very good.  I only found one typo and it wasn't important.  It was not translated three times from an original language using obscure clucking noises and hieroglyphic symbols.  An email to tech support was answered promptly and with great attention to detail.  The techies are REAL ENGINEERS, not some morons in monkey suits with a license to confuse and aggravate.I mentioned before that the camera \"itself\" was easy to set up.  That is true.  What might be a bit challenging for some is the router configuration.  I suggest while waiting for the camera to be delivered, brush up on your router's help files.  Find the range of IP addresses your router is assigning to devices automatically, such as 192.168.1.25 through 192.168.1.125, because the IP address you choose to assign to the cam to make it a permanent host will be somewhere outside of that range.  Also check to see if your router has the latest firmware.  My Trendnet TEW-452BRP had a glitch with running DDNS updates, even if all the fields were input properly.  This would have caused me great frustration had I not checked the website first.If you want to access the cam from outside your LAN, then read up a little bit on DDNS.  I'm using a free account from \"no-ip.com\" and there is a brief primer on using this service in the camera instruction manual.  Check your router to see if it has an automatic function to update your current IP Address to a DDNS server. It doesn't have to, as your PC can do it for you automatically every time it boots with a free program you get after registering, but why not be redundant if you can?  If you decide to set up DDNS so as to access the cam through WAN, then find out how to give the cam TCP and UDP privileges on a specified port number, typically using a function called \"Virtual Server.\"  Otherwise you would open \"DMZ\" or perhaps \"Special AP\" to give the cam connectivity rights.Be warned that DMZ opens all ports, which might be dangerous.  Special AP is for programs which require multiple connections that are blocked by NAT, so again that might be dangerous as well.  Using Virtual Server only opens the ports necessary for functionality of this specific device, so it is the best way to punch that hole through the wall into the WWW.  And remember, if you are restricting access to the router by use of MAC numbers, shut that off when first installing the cam or else you won't get it to connect.  Later you can turn it back on.None of this is rocket science, but if problems do occur, the Engineers at Sharx are competent and they are committed to not letting you fail.  It even says so in the instruction manual!", "Date": "February 15, 2009"}, {"Title": "Actual video from Sharx VIPcella-IR SCNC2607 IP Network Camera", "Author": "SecurCam", "ReviewID": "R3N1RIMM96O8CK", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_30347621embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_30347621refresh_preplay() {\n\ndocument.getElementById(\"cv_30347621chiDiv\").innerHTML = document.getElementById(\"cv_30347621hiddenPre\").innerHTML;\n};\ncv_30347621refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_30347621so;\t   \n\n\nfunction cv_30347621loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_30347621so = new SWFObject(swfLocation, \"cv_30347621AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_30347621so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_30347621so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_30347621so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_30347621so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_30347621so.setAttribute(\"height\", swfHeight);\n          cv_30347621so.setAttribute(\"width\", swfWidth);\n          cv_30347621so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_30347621so.write(\"cv_30347621flashcontent\")) {\n          fp_resizePlayerSpace('cv_30347621', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_30347621';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_30347621', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_30347621loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_30347621\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2PF8C3BUQPAAR\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2PF8C3BUQPAAR\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3N1RIMM96O8CK\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2PF8C3BUQPAAR/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_30347621duration')) {\n      document.getElementById('cv_30347621duration').style.display='none';\n    }\n    cv_30347621loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_30347621loadSwf(movieID, playerVersion) {\n   return _cv_30347621loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_30347621newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_30347621', 0, h);\n}\n\nfunction cv_30347621resetPlayer(w,h,bw,cc) {\n  cv_30347621newHeight(h);\n\n  cv_30347621so.addVariable(\"resetBandwidth\", bw);\n  cv_30347621so.addVariable(\"cacheCode\", cc);\n  cv_30347621so.setAttribute(\"height\", h);\n  cv_30347621so.setAttribute(\"width\", w);\n  cv_30347621so.write(\"cv_30347621flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_30347621RollOverImg = new Image();\ncv_30347621RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81A%2BquE4CHS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_30347621preplay = document.getElementById('cv_30347621preplayImageId');\nif (cv_30347621preplay) {\n  cv_30347621preplay.onmouseover = function() {\n    cv_30347621preplay.src = \"http://ecx.images-amazon.com/images/I/81A%2BquE4CHS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_30347621preplay.onmouseout = function() {\n    cv_30347621preplay.src = \"http://ecx.images-amazon.com/images/I/81A%2BquE4CHS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_30347621preplay.parentNode;\n\n  var cv_30347621currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_30347621currentClick) {\n      return cv_30347621currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:41 MinsSharx Security VIPcella-IR SCNC2607 Wifi Wireless 802.11 g Cell Phone enabled IP Network Camera with built-in Web Server, Microphone, Infrared and Moonlight Color Night Vision", "Date": "January 7, 2009"}, {"Title": "Great for baby cam + iPhone!!!", "Author": "A. Tryba \"atryba\"", "ReviewID": "R1VWGU2GH30BD8", "Overall": "5.0", "Content": "If you are like us and many new parents, you may have purchased an inside-the-house video baby monitor - such as the Summer.  In this day in age, however, an even better solution is one that works both inside your house AND outside your house on your cell phone or at work!This Sharx SCNC2607 is amazing and perfect for our baby cam.  Great picture during the day and absolutely awesome images at night when there is no light in the baby's room!  This was exactly what I was looking for when looking at the more expensive solutions such as Axis, Sanyo, etc (which were going to cost me over $500!).  I was concerned that the Sharx would be of lower quality but I've been very pleasantly surprised...Here are some benefits we've found by having the Sharx SCNC2607:1. When Daddy is at work, I can keep a small window of the baby's room on my screen to see my little girl whenever I have a spare minute!2. We have the camera setup as an icon on Mommy's iPhone so she can easily click on the camera and view the baby's crib.  Whenever Mommy is away (and the Nanny, Grandparents, or Daddy is watching the baby) she can view into the room and see her little girl.  Even inside the house we found that Mommy carries her iPhone around with her and its more convenient to have 1 consolidated device rather than also carrying around the Summer receiver.3. We setup the Grandparents with an secure account to be able to look into the webcam and see their granddaughter anytime...  We actually turned off the audio though to ensure we maintain some privacy in our conversations within the baby's room :)...4. Screen size using the Sharx and the iPhone is 2x the Summer screen and has a much larger viewing angle.So how hard is this to setup?  I'd rate it on the moderately technical side.  If you have any experience setting up a wireless network at home then it should be a breeze but you need to configure some things in your router.  You'll take the camera out of the box, plug it directly into the router, run their little IP Finder software, then go into the camera and setup passwords, user accounts, etc.  On the router (I have a Linksys), you'll need to go to the Applications & Gaming tab and setup Port Forwarding so you can securely tunnel into your home network to see the camera.  Not difficult but I can see how someone with no experience may struggle a bit.  Good news is that the camera comes with one of the best installation guide's I've ever seen that walks you through it all and even gives you steps to setup your own URL (through DDNS).There is one thing you should keep in mind when going with a webcam instead of an inside-the-house monitor - the webcam is a `passive' device.  Meaning you need to go to the webcam on your iPhone to see the camera.  The inside-the-house versions that are `always on' enables us to put the baby to bed and listen to the monitor when she wakes.  You can enable audio on the webcam but you still need to have it up on the iPhone to hear it (and likely Mommy is doing Facebook, etc).  If I were to do this over again, I would simply buy a cheaper audio-only inside-the-house monitor to hear when the baby wakes up and use the Sharx for the video whenever I want to see the baby.  (Or I could go old school and just listen for the baby to cry but what type of a techno-daddy would I be then :)?)I'll finish with the customer service I received by the guys at SecurCam.  One word - fantastic.  I first purchased the SCNC2602W.  However, I didn't realize that this camera didn't work with my iPhone or non-Internet Explorer browsers.  I contacted the folks at SecurCam and they explained the issue and very quickly helped me out by selling me the 2607 even before the product was officially launched!  They've been awesome at responding to my technical issues, have a great online support setup, and flat-out great products.  In the day in age where everyone is cutting back and outsourcing their support to overseas - these guys set a new standard in personalized support.  I'd not only purchase additional cameras from them, but if they went into business on other items I would not hesitate to purchase them also.  Keep up the great work guys!!!", "Date": "January 18, 2009"}, {"Title": "Extremely easy to set up but performance is so so", "Author": "oneforjule", "ReviewID": "R1SPMFNWTRKTU1", "Overall": "3.0", "Content": "The manual is very well written and easy to follow. I got streamed movies to my iphone in 30 minutes. However, the camera has very limited wireless range. The signal drops to 1 bar when my laptop still has 4 bars of signal. At this point, the image quality and frame rate deteriorate to almost unusable. The weakness seriously limits where you can install the camera and render the \"wireless\" part almost useless, because at such a short distance, you can probably wire the camera for better data transport and security. I am not impressed by the image qulity as well. In a well lit room, the color of image is purple-ish and blurry. On the other hand, the software appear to intuitive and stable. Simply put, nice software (including the manual) but mediocre hardware. At this price, I cannot say that the money is well spent.", "Date": "September 22, 2009"}, {"Title": "Great Camera; Sharx is an expensive re-branded version", "Author": "Beechfuzz", "ReviewID": "R22GLGBTYVWKOT", "Overall": "5.0", "Content": "Everyone needs to know that there are at least three versions of this camera floating around.  There is, 1) this camera (Sharx SCNC2607), 2) Y-Cam Black SD, and 3) LTS LTCIP830MV-B.  All three cameras are EXACTLY THE SAME.  They are all the same camera (all the internal parts are the same), just re-branded.  The only difference between them is PRICE.  Sharx's camera costs around $300; the Y-Cam's camera costs around $285; and LTS's camera cost about $150.  Newegg sells the LTS version for $150 + free shipping; I bought mine from an Altex store for $160.  Y-Cam makes housing units for these for $100 if you want to mount them outdoors.  So, there is absolutely no reason for anyone to pay more than $150-$170 for this camera.You can download the firmware and software upgrades only from Y-Cam's website (which makes me believe that they are the original manufacturers of this product).  On Y-Cam's site, click on \"Downloads\" on the left side.  A page will load asking you to register; scroll down to where it says \"Don't want to register?\" and click the link to access the downloads.  The firmware will be for the \"Y-Cam Classic - 2nd Generation.\"  From this page, you can also download the latest MultiLive program (free).  MultiLive is the software bundled with the LTS version of this camera (I assume it's also bundled with the Sharx and Y-Cam version too).  When I upgraded my camera's firmware to 3.38, it kept all my wifi , detection, and other settings, so that was nice.For $160 (what I paid for the LTS version), this was an excellent buy.  I don't think you can get any better than that.  The night vision is great compared to any other sub-$200 IP Camera.  The WIFI range is also good.  I have the camera mounted outside above a floodlight on the front of my garage (12 or 13 feet above the ground) while my router is at the other end of the house, about 50 feet away.  The camera gets about 2 bars of signal strength, which is good for that far away considering how many walls it's communicating through, and the picture is still great.The web interface is on spot for a $160 camera.  You can adjust everything from the light frequency, microphone volume, 11 different streaming modes, on-screen display (if you want the time and date displayed on the picture), nightvision settings, etc.  There also a plethora of options for motion detection, alarms, and automated scheduling.  You can set it up to automatically upload videos and pictures to an FTP server or other off-site location, and email you when an alarm is triggered.  You can also set up different areas on the screen with different Motion Detection thresholds and sensitivities.  For instance, if you have this mounted above your driveway, you can configure the camera to make your entire driveway super sensative with a low tolerance for movement (to monitor for intruders wanting to break into your car or garage), and you can configure the sidewalk and street to have a lower sensitivity and higher movement tolerance (to prevent false alarms triggered from random cars driving by or neighbors walking on the sidewalk).The MultiLive software that comes bundled with it does a pretty good job too, though I'm sure that there are more advanced professional versions for commercial use.  But for home use MultiLive is good enough.  MultiLive knows when the camera sets off an alarm, and it immediately starts recording and saving the video to my computer. A one-minute video takes up about 5.4MB of space.  That's with the highest quality setting the camera can handle.  MultiLive allows you to specify how long you want it to record video whenever an alarm is triggered.  For instance, I have it set to record for 15 seconds whenever an alarm is triggered.  That way if false alarms occur during the night (which they do every few minutes thanks to my motion sensor floodlights turning on whenever a bug flies in front of it) then you won't be using up too much disk space for false alarms.The picture quality is pretty good for a 640x480 resolution picture.  There is some low-light ISO graininess when recording in low-light indoor settings.  The night vision picture quality is okay.  Not the worst, but not the best.  For me, the picture is a bit washed out.  The edges of one of my cars blends in to the dark ground and is hard to see.  But that may be because I have a 20w CFL lightbulb turned on all night lighting up the driveway.This camera is really for indoor-use only.  However, I have it mounted outside anyways.  I sealed the edges of the lens and shell of the camera with clear silicone, so we'll see how well it holds up.  Alternatively, you can order an outdoor housing unit for it for $100 from Y-Cam's website.The web interface works best with Internet Explorer.  It does work in Firefox, but it's a little glitchy, and the camera doesn't display in Firefox.  I haven't tried a Mac or in Google Chrome yet.Pair this camera up with a router that supports dyndns accounts, and you can view your camera from any internet connection.I'll update this post as I use this camera more.", "Date": "June 7, 2010"}, {"Title": "Excellent IP Camera with Outstanding Tech Support", "Author": "Geronimo", "ReviewID": "R2V8UXLZZBKUV", "Overall": "5.0", "Content": "I purchased Sharx SCNC2607 camera for home security, so I needed it to be easy to set up, reliable, have good image quality, and work in all lighting conditions.  I have tried similar cameras from other major manufacturers, and none of them work near as well as the Sharx.  I normally write very brief reviews, but this one is worth a deeper look:Setup:First, when I unpacked the camera, I found a very thorough 44 page instruction manual that came with the camera, and it was all in English (how often do you find that these days?).  I followed the setup steps which are simple.  Plug the camera into a wired network connection, figure out what IP address the camera is (use the software included on the disk to do that), open internet explorer, and http to the camera.  I did have to disable the windows firewall, as it was causing the video to be disconnected after a short period of time (same thing happened on other brand cameras).  Once I did that, I never had another problem.  My first impressions of the video quality were holy cow, this is really good quality compared to other brands.Included Software:The included software is pretty decent, especially considering the price point of this camera.  This is not a professional megabuck camera, so I wasn't expecting professional grade software.  It allows viewing and management of up to 4 cameras at the same time, is pretty easy to use, and ran on my XP Pro computer without a hitch.  You can set recording schedules, motion detection, max file sizes, and supposedly max amount of disk space to use.  There was no help menus or documentation provided for the Multi-Live software, so you are on your own for this.  Fortunately, it is pretty intuitive.  I played around with max file sizes, limiting them to 2mb each.  I did this so that in the event of a break-in, the files would break on about 30 second intervals.  I have my security computer mirroring files to a hidden NAS device elsewhere on my network every 30 seconds, so if someone were to break in and take the computer, there is a pretty good chance the video would be copied to the other drive by then.  Anyway, the only problem I found with Multi-Live is that it does not seem to limit how much space it will write for video files.  In other words, if you are not monitoring your hard drive, it looks like it will just fill it up until the computer locks up due to no free space.  I have an email into tech support on this issue.  Other than that, I noted that you must have the Multi-Live software running in order to record video.  You can also record video on motion detection with just the camera, and not install the Multi-Live software, but I also found that you must have an Internet Explorer window open, and be pointed to the IP address of the camera (have it on-screen).  If you do not have an IE window open, or the Multi-Live software running, the camera will not record video.  I was hoping for a direct feed to a NAS device, but this is not currently supported (tech support says it is in the works, but a fairly low priority).  Again, not a deal-breaker, but a nice to have option.Micro-SD card:This camera has a micro-SD card slot in the bottom, which allows you to also record to the memory card at the same time as to a computer, or by itself with no computer.  You can set continuous recording in specified segment lengths, or on motion detection.  This works well, except for some unexpected behavior I noted.  I was anticipating that when the memory card got full, the oldest files would be over-written by the new files, thereby keeping the most recent video on the card.  Instead what happened for me is that as the card got full, the camera kept recording (or so I thought), and wrote 5 zero byte files.  Once it figured out the card was full, the camera went offline for about a minute, while it erased the entire card, and then started recording again.  It should be noted that the camera was offline not only for the memory card, but also for the Multi-Live software, and IE browser windows.  In a nutshell, you better hope the card doesn't get filled up during a break-in, because you would lose everything, and have a minute or so while the camera was down.  I had a 32mb (very small) card that I was testing, and got about 10 minutes of video at max resolution.  The instructions indicate it will support up to an 8gb card, but don't state what type of card to buy (micro-SDHC I would presume, and nothing indicated about what class of card to buy).  This is the only part of the owners manual that was lacking on documentation.  As another reviewer indicated, there is zero information on their web site in the form of FAQ's or additional guidance.  Fortunately, they have excellent and very responsive tech support.  I emailed them Labor Day weekend on Saturday, and got a response within 1 hour.  On a Saturday!  It appears their tech support are actually well-educated in the product, are not located in India, and provide thorough responses.  I only wish they would document their info on their web site in the form of FAQ's or a knowledgebase.Performance of Camera in Low Light:I tried this camera in all lighting conditions, from a well lit room, to zero light, and everything in between.  Out of the box, the camera is set to go into night vision mode when the light is very low.  It also goes into black and white mode when very dark.  The quality of the images in a well lit room are outstanding.  No graininess, good color, and it captures motion pretty well.  In a low light situation, the camera goes into a moonlight mode, which cuts the frame rate by a factor of 4, and increases light amplification by a factor of 4.  The result is very good image quality, but reduced frame rate.  I think this is a great compromise.  In a no-light situation, the infrared LED's come on to provide light for the camera.  They glow a dull red, so someone would be able to spot the camera in a dark room.  The video switches to black and white, and is of surprisingly good quality.  The LED's provide good light for the camera out to about 15 to 20 feet.  Plenty enough for even a pretty big room, but I would not expect this to work facing outside a window, into your driveway or yard.  The manual states that the window would reflect the infrared light, and blind the camera.  The video in night vision mode is good quality and clearly defined.  The frame rate also appears to be cut down in night vision mode, as motion is not captured well.  However, for a consumer grade camera, this works as good as I would ever expect it to.  Very acceptable performance, and much better than anything else I have found on the market.Other Thoughts:I plan on buying more of these when the budget allows.  The camera provides excellent quality video, is easy to set up, works well (albeit with a couple small caveats as noted above), and the tech support is outstanding (the clincher for me).  Do not waste your time on other brand cameras.  They did not work well for me in most respects.  For me, if Sharx fixed the issue with the SD card, and fixed the issue of the camera consuming your entire hard drive when recording, it would be a near perfect camera.  Otherwise, I rate it very good to excellent.  I would have given it 4 stars, but the quick response by tech support on 3 occasions moves it up for me.  On something technical like this camera, you need a company with good tech support.  Sharx excels at this in my mind.UPDATE:Per Sharx' tech support, they can resolve the issue of the camera erasing all files on the micro-SD card once it is full, and have only the older ones roll off.  I had no choice but to give them my login information to my camera, and have them update it remotely.  Not my preference, but they did the update quickly.  I am still testing the issue of recording to the micro-SD card.  For some reason, the camera seems to lock up and shut down when recording continuously to the card.  However, I was testing it using a 32mb card.  Sharx tech support says they only currently support 1-4gb cards.  This may be the issue.  More to follow.", "Date": "September 7, 2009"}, {"Title": "Great Camera - Provides Peace of Mind for a Reasonable Price", "Author": "Pen26", "ReviewID": "R1W0I753Z4F4V1", "Overall": "4.0", "Content": "Overall review:Excellent product. I have recommended to family and friendsI would give it five stars if one issue with short blanks in the video could be corrected (under Video section).  I have not found a camera that isn't significantly more expensive than the SCNC2606 or SCNC2607 that would receive 5 stars.If you are considering saving money by purchasing the SCNC2606, please keep in mind it does not have good low light capability and will not work at night or possibly evenings.My setup:SCNC2006 and SCNC2007 running firmware 3.39The software was installed on a computer running Windows XPI am using a Linksys by Cisco wireless router WRT320NI viewed the cameras remotely on another computer running Windows XP and another running Windows 2000I also view the cameras remotely using my Droid X phoneHardware:The camera hardware was fairly robust with a sturdy housing measuring about 3.25\" by 3.25\".The infrared illuminators occupy an area about 2\" diameter on the face of the housing, with the camera lens in the middle.A detachable antenna protrudes from the top of the camera 4.5\", although it does have a joint in it that allows it to be turned 90 degrees.A metal base is included with a ball and socket joint that allows the camera to be rotated from side to side and pitched up (but not down from straight ahead).The power cable is about 10 feet long, which allows the camera to be mounted quite a distance from an outlet. The power cable on other security cameras is not so long.Also included is a short ethernet cable for setup, but if you have a wireless network it won't be needed after the setup.Software:MultiLive software is included for recording videos onto a computer on the same network. Installation is easy. The software is fairly straightforward and easy to use. You can record video from multiple cameras simultaneously using MultiLive. See more below under section titled \"Computer Recording (MultiLive Software)\"Setup:A printed, 56 page instruction manual is included with the camera. Don't let the length of the manual scare you. It is written in great detail so that anyone can install the camera. It was also clearly written in English first, not a foreign language poorly translated into English. The manual leads you through all the steps to get the camera fully functional, including wireless network setup, adjusting camera settings, allowing access to your camera from the internet with a password, setting up a free DDNS for remote viewing, night vision settings, emails, ftp uploads, recording to a micro-SD card, recording video on a computer, and viewing videos from a smart phone.I consider myself moderately skilled with technology and the installation was not difficult. It took me about 4 hours one evening to do the complete setup, and maybe an hour or two over the course of a week to make final tweaks to settings.The camera supports WPA2, as well as WPA and WEP for wireless security, with password lengths from 8 to 63 characters long.In the camera setup you can create a schedule by day (Monday through Sunday) and time (12:00 am through 11:59 pm) for when to send email alerts. So if you plan to be out of the house between 8 and 5 Monday through Friday, you can set the schedule for that.The tech support for Sharx is essentially only through email. They do not provide a phone number to call, only an email address. This certainly concerned me, with all the setup difficulties I had previously with cameras from other manufacturers. However, they are extremely prompt and very thorough in their responses. They usually responded within 15 minutes of my email, even after normal business hours (but don't assume this will be the case - I'm sure they want to go home as much as everyone). I only had to email them a few times, and never required a phone call to explain what I was having trouble with (mostly setup on my Droid X). In the event that you are truly stuck, they say they will call you when both parties are available.Operation Overview:Once you get the camera set up as you want, it basically needs no effort from the user.The camera detects motion based on detecting a difference in video. It does not matter if that difference is just due to a pet, or the reflection of a car headlight through a window at night. The motion sensitivity settings, including threshold to register as a change and sectors within the viewing window to evaluate for changes, can also be adjusted during setup. You can adjust it so that a person walking in front of the camera will be considered \"motion\", but clouds breaking the sunlight and thus changing the lighting conditions of the room slightly will not be considered \"motion\".When the camera detects motion, it will send an email with a picture of what it sees and it will start recording video.Videos can be recorded to either a MicroSD card installed in the camera (sold separately) or to a computer on the same network using the provided MultiLive software. The camera can also transmit videos stored on the MicroSD to an FTP site. See more details under \"Computer Recording (MultiLive Software)\", \"MicroSD Recording\" and \"FTP Recording\".If you get an email from the camera, you can log onto the free DDNS website you created to see the live video from the camera. When viewing live video you also have streaming audio, so you can hear if someone is in your house. However, there is some random \"noise\" with this - you might hear a knock or bang that isn't actually there.If you are trying to view the live video from your cell phone, but don't have a strong network connection, another option is to view the continuously updated photos. These are uploaded every few seconds and are nice if you don't have a strong network connection on your phone and can't view the video.If you don't see or hear anything going on, but want to see what triggered the camera, you can also log onto the camera's settings and download the recorded video (assuming you're recording onto a MicroSD card).Video:The recorded video quality is pretty good. The quality is probably good enough to identify someone if they are within 10 to 15 feet of the camera. However, if they move very fast or if they never face the camera, this may be more difficult. I recommend placing the camera so that it points towards where an intruder will slow down to pick stuff up and possibly face the camera.The transmitted video quality is decent on a phone, although probably not good enough to identify someone. The transmitted video is usually a lower frame-rate than the recorded video so you can watch over a cell phone service's wireless network, but this can be adjusted in the setup.There is a slight delay between a change in the scene (motion detection) and when the recording begins, but this is less than a second.The cameras have auto-exposure and adjust to changing light conditions during the day and early evening.The video recorded when in night vision mode is obviously not in full color with somewhat reduced quality. It is still good enough to see if someone is in your house and all your stuff is still there (or not).The video frame-rate and resolution are both adjustable in the camera setup, as is the length of the video clips recorded. Each clip will be stored as a separate file.I have found that some slight blanks in video (sometimes up to 2 or 3 seconds long) do occur and sometimes frequently. This is both on transmitted and recorded videos. I have not found a solution to this issue and was told by Sharx that the cameras may not be capable of recording at the resolution and frame-rate that I chose without causing this issue.  Unfortunately, I want the resolution and frame-rate in case I need to identify someone using the video evidence.  I can live with this, but this is definitely an area for improvement.Motion Detection Notifications (emails):The cameras are very good at detecting motion without being disturbed by slight changes in lighting. You can easily adjust these settings so that it will trigger when you want it to. I've only had a few false alarms (a couple times heavy clouds blocking the sun did trigger it, a fly flew in front of the camera once, and a piece of plastic film fell off my TV).When the camera detects motion, it will send an email with a picture of what it sees. Overall this works very well. There have been several times that I have come home early and forgot to disable the email option on the cameras and received a picture message on my phone shortly after walking in the front door.You don't need an email client on your home computer, and you don't even need a computer at all. The camera contacts your mail server, for example a free Gmail account, and instructs it to send an email on your behalf. You can program the camera to send emails to 3 different email addresses. These email addresses can also be those assigned by your mobile phone provider so that you can receive picture messages on your cell phone, even non-smart phones.While a change in the video scene will trigger an email alert, sounds will not. So even if you can hear people talking on the live video, unless something changes in the visual scene in front of the camera, you won't get an email.Remote Viewing (via PC):Remote viewing from a PC works very well. The video and sound come through pretty good, although the video will likely not be at the same quality and frame-rate as the recorded video.You can log onto your camera using the camera's external IP address or you can use DDNS to help you remember a name instead of a numeric IP address to see live video or still images continuously updated (every few seconds). The free DDNS service I used for remote viewing, no-ip.com, works very well. Sharx recommends no-ip.com along with [...]. Both provide free accounts, but they do require you to log in at least once a month to let them know you're still using the free account.DDNS should only be installed on one camera for an entire network. If you install it on more than one camera, there will be too many updates and the DDNS provider will block the free account. With one hostname (updated by one camera) you can access up to 252 devices on your network, just by using the different port numbers.When logging on remotely you can also adjust the settings of the camera. This is helpful for a few reasons. If you come home from work early and need to disable the email alerts, you can adjust the schedule before you leave work. Also, if you receive an email alert, but watch the live video and don't see anything, you can access the MicroSD card and watch the video of what motion the camera detected. You also have the capability to adjust the motion detection sensitivity, but I would not recommend this without being there to test in person.Remote Viewing (via smart phone):Remote viewing from my Droid X works very well. The video and sound come through pretty clearly, but again the video quality isn't the best.Basically, everything that I wrote for the PC Remote Viewing applies to the smart phone remote viewing.I created bookmarks on my phone's browser to access each camera's video as well as the main setup menu for each camera. When selecting a camera's video bookmark, I have to then click on the live video button \"3GPP Live\", the continuously updated photos button \"Picture Live\" or \"Setting\" button. The main setup menu bookmark takes me to all the setting I can adjust, such as schedule and motion detection sensitivity.I've only experienced a few issues with watching the videos over my Droid X.1) When I added the second camera it seems to have some issues processing logins for multiple cameras. My phone kept giving me an error that the video could not be displayed. This may have to do with password processing on the Droid X. I finally figured out how to overcome this pretty easily and quickly. I go to the video bookmark and select \"setting\", then click on the \"back\" button. This takes me back to where I can select the video button \"3GPP Live\". This then takes me to the live video and only takes another couple seconds to complete.2) When trying to access the MicroSD card from your phone, it is very slow. The phone is trying to evaluate a lot of information, so it makes sense this might take a while.3) The last issue is just bandwidth on the phone's network connection. If you're in a poor service area, you're not going to be able to view live video.Computer Recording (MultiLive Software):I found that recording to a computer was unstable. I never could determine if the network connection was lost, if the router was overwhelmed, or a problem with the software or computer, but I frequently came home from work to find the computer had stopped recording. When this happened, the only way to restore the connection between the camera and the recording computer was to power off the camera then turn it back on. Recording onto a computer also required the computer to be on 24-7. An additional concern with this is that if someone breaks into your house, it's very possible they will steal a computer, taking all your video evidence of the break-in with them.MicroSD Recording:Recording onto the MicroSD card works well.The card has to be 1 GB or larger, and from one of these 4 brands: SanDisk, Lexar, PNY, Kingston. Both MicroSD and MicroSDHC work fine.If the card is ever filled, the camera will automatically over-write the oldest files first.You can adjust the recording rate over a very wide range (over 100:1). With typical settings, you can record 24 hours at medium resolution (320x240) with a 2 GB MicroSD card, or 60 minutes of high resolution motion detection recording per GB.If you want to adjust the frames per second, it is adjustable from about 2500 kbits/sec to 20 kbits /sec. For kilobytes instead of kilobits, divide by 8.If the camera is powered off while it is recording a video, the video file may be corrupted. Consider this when selecting the video clip lengths in the setup.FTP Recording:I haven't actually used FTP recording, so I can't comment on how well it works.Here's what I do know about it:With the addition of a MicroSD card (1 GB or larger) the camera can automatically transfer the video or snapshots from the card to a standalone hard drive that has the FTP server feature. No software is involved, no computer involved, just directly from the camera through your router to your hard drive, such as the MyBook World Edition. If your drive does not have the FTP server feature it wouldn't work, so it's important to check. NetGear ReadyNAS will work too, Apple Time Capsule won't because it doesn't have FTP and is always dependent on a Mac to be connected.Night visionThe night vision capability of the camera is pretty good. The video is not the best quality and is in black and white, but is sufficient for determining if someone is in the area in front of the camera. Sharx claims the SCNC2607 can use its infrared night vision to see in total darkness up to 35 ft, which I believe is probably true. The infrared illuminators light up the room nicely.I highly recommend buying the SCNC2607 over the SCNC2606, unless you don't care about the camera working in the evening or night, or if you have good lighting in the room 24x7.  The low-light capability of the SCNC2606 is poor.The night vision does have three minor issues:1) The camera lacks an optical filter to remove colors not seen by the human eye, sometimes changing the colors in the video when in daytime mode. This only happens in some lighting conditions and with some materials. In the daylight the colors on my camera look pretty good. Even when the colors are somewhat modified, it shouldn't prevent you from identifying an intruder.2) The infrared illuminators do transmit some visible light (red). It's not very bright, but in a totally dark room you can definitely see them. This could be an issue if an intruder saw this and found the camera.3) The infrared illuminators also may attract bugs when this is the only light source in a dark room.  I keep a clean house, but there have been at least two occasions when I received a message from my camera that it detected motion in the middle of the night.  Upon reviewing the recorded video, I see what appears to be a small bug flying across the camera, brightly illuminated by the infrared illuminators.  Not a big deal, but something to keep in mind so you don't freak out if the camera alerts you to motion in the middle of the night.Wireless:The wireless range on the camera is pretty good. I have my wireless router located in one room with the cameras in other rooms. The signal from one camera has to penetrate two brick walls to reach the router, but still manages to do it.Here's what Sharx told me on the wireless range:Wireless range depends on what's between the router and the camera. In a typical US wood frame/sheet rock home with wood or vinyl siding you can go up 2 floors or 2 rooms over. If your router is centrally located in a 3 story home you can get good reception everywhere provided you don't have lots of metal furniture. If there was no obstruction, like outside line of sight or a very big hall, you can get over 150 ft.General guideline - If you take your laptop to the location where you'd want to use the camera, and if your laptop can get 50% signal strength from your router, then you should be okay. However, if your laptop has trouble getting a signal from your router before you even buy one of our cameras, then buying a camera won't magically cure your existing wireless networking problems.I would like to point out two potential issues relating to any wireless connections:1) Interference - If there are a lot wireless devices in your area (apartment building) or you use a cordless home phone you can have interference in the wireless network.2) Dropouts - Whether the cause is the camera or the router, wireless networks can lose connection. This has happened to me a few times (not many) in several months. I recommend verifying the connection every week by checking if you can still see live video remotely. If the camera loses connection to the network, it will still record any video, but it will not send you an email when it detects motion. When the network connection is lost, just pull the power plug, wait a few seconds, then plug it back in.Pros (most of which are very important):Pretty good video qualityFairly good sound qualityMotion detection works very wellMotion detection emails with pictures is very reassuring when awayNight vision is effective for determining if an intruder is present or if your belongings have been disturbedRemote viewing of live video from a computer or smart phone is greatRemote viewing of recorded videos is helpfulRecording options are good (MicroSD card or possibly FTP, not so much for the networked computer).Wireless network connection allows you to place the camera anywhere within a reasonable distance of a router without running cablesSetup is easy compared to other wireless network camerasCons (most of which are minor issues):Wireless connection can be lost (true for any wireless device)If an intruder steals the camera and you only record onto the MicroSD Card they take the evidence with themVideo blanks for up to 2 or 3 seconds, sometimes frequentlySlight delay from motion detection to start of recordingRandom noise in viewing live videoInfrared illuminators are visibly red and may attract insectsPower turned off during recording may corrupt that video fileMore difficult to hide than 2606 model, due to infrared illuminators", "Date": "January 10, 2011"}, {"Title": "Feature Packed and High Quality (if you're windowless)", "Author": "J. Cheshire", "ReviewID": "R162JK6Z7U4FJ1", "Overall": "5.0", "Content": "We've recently had some trouble with neighborhood kids setting off acid bombs and we wanted to try and catch the hooligans in the act. I did quite a bit of research on outdoor cameras, but all of them required coax wiring and AC wiring to the mount point. It just wasn't worth the effort, especially given the high price. That's when I found the Sharx SCNC2607.I was a little apprehensive about spending so much money for this camera, but I was swayed by the many great reviews. I have to say that I'm impressed by the feature set of this little guy, and the image quality is outstanding.Because I want to keep an eye on the front of the house, I have this camera mounted with 3M Command Strips and pointed out my home office window. During the daylight hours, this works incredibly well. However, once darkness hits and the IR kicks in, the reflection of the IR illuminators on the window make night vision completely unusable. This isn't a problem specific to this camera. All IR cameras pointed out of a window experience the same problem. I have chosen to solve that by purchasing an IR illuminator (about $60) that I have put in the front of the house. This works incredibly well and I can see quite clearly at night. The IR illuminator looks like a bright spotlight shining out into the yard when viewed through the Sharx, but it's invisible to the human eye.The only other minor issue I've encountered is that the ActiveX control used to view the video in Internet Explorer will cause IE to crash if you change a lot of settings while watching the camera. Fortunately, IE recovers well from this and the tab is recovered and video continues. The only reason I mention it is that there doesn't appear to be any servicing path for the software (downloadable updates), so it's hard to know if these types of problems will be addressed. However, it's not a big deal since once you configure all of your settings, there's really no need to reconfigure anything. Therefore, no stars knocked for this.You can use Windows Media Player or QuickTime Player to view video on the camera as well. If you're on Windows 7 or Windows Vista and you're using WMP, you'll need to disable audio on the camera due to a licensing issue with the audio codec necessary to play audio. On QuickTime, you'll want to disable 3D acceleration in QuickTime preferences. URLs also differ based on what you're using to view the camera. You can view the URL for any stream by clicking links when you are setting up streaming.You can also use third-party software to record video and watch more than one camera, assuming you aren't happy with the MultiLive application that ships with the camera. I am using LuxRiot to record video, and even though it doesn't list Sharx specifically as a supported camera, the SCNC2607 puts out a standard stream that LuxRiot can easily consume and use.If you're looking for high-quality hardware in a security camera that has the flexibility to meet your needs as they evolve, this is a great choice! You definitely get what you pay for in this arena, and this camera is one that I highly recommend.", "Date": "January 19, 2010"}, {"Title": "Pricey, but lots of features.", "Author": "PacificNorthwest \"C\"", "ReviewID": "R2LMOL2FF0US0Q", "Overall": "4.0", "Content": "I've been very pleased with the Sharx camera and its performance.  After running the Sharx camera for a few weeks, I've also discovered a lot about IR cameras, wireless cameras, and the Sharx itself.I thought I'd share this here as it might save you some time with your own decisions.  There were some unexpected issues I encountered, but this is more related to IR & wireless technologies than to this camera.Quick Background on my set-up:I purchased this camera when looking to set up a system to monitor my home for security purposes.  I live in a dark neighborhood, and was looking for a solution that was web-enabled.  After searching for the right products, I liked all the features the Sharx offered and bought 1 of them, for its IR & wireless capability.  I also purchased two D-Link DCS920 Wireless-G Internet Camera ($85 ea.).---------Sharx Camera Pros---------1) Good manual, with excellent explanations and walkthroughs (you can tell Sharx is a small shop by the detail in the manual)2) Fairly easy setup.  I had it running in a few minutes.3) Nice day-time detail in the images the camera creates4) Web-access is awesome.  We love being able to check the front door image from anywhere, by connecting to the camera's web server.5) I can also use my iPhone from anywhere to check the real-time video.6) the wireless connectivity performed well for me7) the camera's software is stable - I haven't had to reset the camera.---------Sharx Camera Cons---------1) Price is high!  But the camera does have a lot of value in IR/nightvision, its integration with web software, size, wireless support, etc...2) Probably not so easy to set up if you're not technical.  Have someone help you.So, that's what I can pin on the camera.  But, since you would be purchasing a *Wireless IR* camera, there are a few things you should know first.---------IR Cameras Can Be Tricky!!---------1)  IR cameras don't see in \"normal\" colors.  For instance, blues and greens and up looking purple. Think about a security scenario in which someone robbed your home.  Cops ask, \"What color was his jacket?\".  You'd say, \"Purple!\".  Well, you don't really know the true color of that jacket.  In that sense, this camera won't help you.2) You _cannot_ point an IR camera out a window and expect it to see outside that window.  The IR illuminators will reflect off the glass, blinding the camera.  To get pictures at night you will need to mount the camera outside. (in a safe, dry place)3) Nightvision can only see so far, and that's limited by how far the IR illuminators project.  In my installation, it's about 10-15 feet from the camera.---------Wireless Cameras May Not Be Your Solution---------This camera did fine in relatively perfect wireless conditions:  1 wireless camera, and not much interference from neighbors.But, If you are thinking about setting up more than 1 wireless camera, then you are asking for trouble.  Wireless technology is not great at streaming video.  I ran into issues with 2 cameras, which started to degrade video performance very quickly.  3 cameras was terrible, and the video was so bad I couldn't rely on it for security purposes.  Again, not the fault of the Sharx.Wireless is __GREAT__ for not having to hard-wire cameras to your network, which can be a pain.  But, it's just not reliable like a wired connection.  Additionally, the video quality on a wired network isn't an issue at all, with more than 1 camera.---------Compared to the D-Link DCS920---------  D-Link DCS920 Wireless-G Internet CameraThe DCS920 is cheap, does not support IR, and is fairly reliable.Well, the DCS920 isn't a bad day-time camera, if the sun is out.  But the biggest hindrance to this camera is its inability to see in low light.  It's pretty bad.  It does not have IR, but it still has a lot of trouble at dusk or when most folks would think this camera *should* be able to deliver some sort of image.  But other than that, it's a fine camera for the price.  I use this camera in coordination with the Sharx, as it serves as a day-time camera that actually sees in true-color (unlike the Sharx).---------Summary---------Overall, the Sharx is simply better quality in all aspects.  Is it $200 better?  For me, yeah.Think of the Sharx as a high-end, does-it-all camera.  It's got wireless, IR, a built-in web server, authentication, mobile phone access, and microphone, all-in-one.  Pretty cool!", "Date": "January 19, 2010"}, {"Title": "Very nice camera, easy setup!", "Author": "Jeff", "ReviewID": "R25MT43UPBFNC3", "Overall": "4.0", "Content": "After trying different crummy baby monitors out there, switched to this and we love it.  The picture quality is great, and the setup was very easy.  The manual is very detailed and walks you through much more than you will need to know.I would recommend to anyone that you read the directions on your router and assign the camera a reserved IP address - what that means is that anytime the camera is turned on, your router will always give it the same IP address, say it is 192.168.0.10 - then in any web browser on your network, all you do is type in \"[...]\" and hit enter, then when you get to the camera Save that page as a Bookmark.  Then drag that bookmark to your desktop and voila at any time you just double-click that icon and instantly you are looking at what your camera sees.When you first setup a reserved IP by the way you will need to first connect the camera to the router, then in the router settings find it under Connected Devices (or however that is worded in your router), and write down the Mac ID (00:24:F4:.....) those digits, then plug those into the reserved IP section and name your camera something like Sharx1 or such.  Most devices you buy tell you the Mac ID somewhere on the box or on the back of the device, this does not so you have to dig it up.In an iPod touch (I have that but not an iPhone), if you do also then open safari, type in the same address as above and get to where you can see the camera (iPods can see but will not have sound so you know), hit Save to Main Page and then you permantly can just hit that icon as well and boom are right in.  (These directions are for when you are at home on the same network, enabling from when you are away from home is covered in the manual).It's a very nifty device, I would give it 5 stars except I also seem to have trouble with the wireless from just a few rooms away from the router, seems it needs to be very close for wireless to work, I was ok because our house has Cat6 outlets everywhere so I just plugged it in and with that there are no issues, but be warned if you have to have wireless you will need to be somewhat in a near proximity to the router to work right from what I can tell so far.I would not be discouraged from this though, the built in web server is such a great feature and it is sooooooo much better than anything else I have tried on the market, I would recommend anytime and am in fact going to add a 2nd one soon.", "Date": "October 2, 2009"}, {"Title": "From an IT professionals Perspective", "Author": "M. Bildaci \"Silent Guy\"", "ReviewID": "R31UKN0SE50RKU", "Overall": "5.0", "Content": "I was quite hesitant to purchase this item, after having several unsuccessful experiences in the past with other IP cams. But with this item, I did see that, the technology is finally maturing, with affordable and quality products. I have used the wireless feature, and it is working without any glitch. In the past, wireless was always a problem with other IP cams. I was considering to get Axis cameras, but due their expensive nature, it is hard to justify the expenditure, however, researching on the web for 2 weeks or so, I have decided to go with Sharx.One statement. I never leave feedbacks. I am so much impressed with the support service of this company, and the quality of their product, that, I really feel, it is unfair for people to NOT know what is out there...so, buy it, you will not be sorry.", "Date": "August 4, 2009"}, {"Title": "All round decent camera...", "Author": "JME \"Magohnem\"", "ReviewID": "R40KNAQT6OY7K", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_38984791embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_38984791refresh_preplay() {\n\ndocument.getElementById(\"cv_38984791chiDiv\").innerHTML = document.getElementById(\"cv_38984791hiddenPre\").innerHTML;\n};\ncv_38984791refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_38984791so;\t   \n\n\nfunction cv_38984791loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_38984791so = new SWFObject(swfLocation, \"cv_38984791AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_38984791so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_38984791so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_38984791so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_38984791so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_38984791so.setAttribute(\"height\", swfHeight);\n          cv_38984791so.setAttribute(\"width\", swfWidth);\n          cv_38984791so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_38984791so.write(\"cv_38984791flashcontent\")) {\n          fp_resizePlayerSpace('cv_38984791', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_38984791';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_38984791', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_38984791loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_38984791\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"mNTS6NQFITUX5\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"mNTS6NQFITUX5\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R40KNAQT6OY7K\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/mNTS6NQFITUX5/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_38984791duration')) {\n      document.getElementById('cv_38984791duration').style.display='none';\n    }\n    cv_38984791loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_38984791loadSwf(movieID, playerVersion) {\n   return _cv_38984791loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_38984791newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_38984791', 0, h);\n}\n\nfunction cv_38984791resetPlayer(w,h,bw,cc) {\n  cv_38984791newHeight(h);\n\n  cv_38984791so.addVariable(\"resetBandwidth\", bw);\n  cv_38984791so.addVariable(\"cacheCode\", cc);\n  cv_38984791so.setAttribute(\"height\", h);\n  cv_38984791so.setAttribute(\"width\", w);\n  cv_38984791so.write(\"cv_38984791flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_38984791RollOverImg = new Image();\ncv_38984791RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81wortMOM1S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_38984791preplay = document.getElementById('cv_38984791preplayImageId');\nif (cv_38984791preplay) {\n  cv_38984791preplay.onmouseover = function() {\n    cv_38984791preplay.src = \"http://ecx.images-amazon.com/images/I/81wortMOM1S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_38984791preplay.onmouseout = function() {\n    cv_38984791preplay.src = \"http://ecx.images-amazon.com/images/I/81wortMOM1S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_38984791preplay.parentNode;\n\n  var cv_38984791currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_38984791currentClick) {\n      return cv_38984791currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:19 MinsNice camera, great features, EXCELLENT support.The camera is a little over-priced but delivers all it promises. Fully-automatic, you will not find a lower-end camera that does all the features of this camera.Excellent image quality (though living things are rendered \"pink\" - a side-effect of the night vision). Microphone works well.I am knocking one-star off because of the just \"OK\" WiFi range.Overall, I am very happy with the camera.Here's a short night video of the night-vision in action (3rd party CCTV software and FPS lowered due to night-vision).UPDATE: October 2012The camera has run flawlessly for 3 years. Today when cleaning the cam,  I realized I needed a small replacement part and contacted the manufacturer. Guess what - he got back to me in less than 10 mins on  a Sunday night and hes sending the part for free. Simply amazing support! I changed my review from 4 to 5 stars. Sharx cant be beat.", "Date": "October 31, 2009"}, {"Title": "Not in this price range", "Author": "SMXSteve", "ReviewID": "RTN8UCWUIKD2Q", "Overall": "2.0", "Content": "First, I am amused when I see reviews that get the highest rating yet it is the only item they have ever reviewed. Who is marking these reviews as helpful? They are obviously biased reviews. This is a good camera but there are better in this price range.I own a Panasonic Network Camera BL-C131A. I have had it for just short of a year but it has worked flawlessly. I thought the Panasonic was too expensive until I got this Sharx. My review is based on a comparison with my Panasonic since they are in similar price range (actually the Sharx is more expensive).These are both indoor cams. I use mine to look outside through a window.MotionThe Panasonic has full tilt and swivel which is fantastic. I have it mounted on the front porch and can view from my driveway on the East and  swivel over to the mailbox on the West.The Sharx is stationary.Build/DesignThe Panasonic is light gray and has a rounded/hi-tech look. It came with a bolt but no bracket. It has a short/stubby antenna.The Sharx is black and square and, to me, is less noticeable as a security cam except the antenna is about 4 inches long - all online pictures show it as a stub. It comes with an excellent bracket and bolt that mounts similar to a camera mount. I prefer the design of the Sharx.Setup/installationBoth are relatively easy to set up for someone who works with networking.Cam qualityIn the daytime they are both good for about 50 feet. You may not recognize the face but you can definitely see people, cars, animals.The Panasonic does well both day and night (with lighting of course). It is only in color so depending on your lighting will depend on what you actually see at night. But it also has adjustments for brightness and white balance. The color is better on the Panasonic even on cloudy/rainy days. It also looks like a live cam.The Sharx does a little better job at night with its \"moonlight\" option but it is also black and white. The live cam actually jumps, like it skips frames. Birds and squirrels always look like they are hopping across the yard. Color is also lacking, all the greens look purple. I tried several adjustments but nothing changed.SoundSound quality is good on both, that is the sound inside the house. Which is good because when I am away I can check the cam and look outside but I can listen inside.User InterfaceThe built in Panasonic user interface is well thought out and looks like they put a lot of effort into creating it. One nice feature is an error log showing the last 20 errors. For me it has been FTP issues which is awesome because I know if there is a problem or not.The Sharx is one of those companies that doesn't get it - software makes great hardware, without good software the hardware isn't any good at all. The Sharx interface is just plain uggggly. No error log. It took a long time to figure out if the FTP was working or not. I will give them credit for one thing, they made the settings open up to a separate page so you can make changes yet still view the image.WiFiI have had the Panasonic for several months with no issues connecting to it. While I haven't had the Sharx that long it also seems to keep a pretty constant connection.FeaturesThey both have the ability to save images and video periodically or based on motion. I haven't had the Sharx long enough but the Panasonic has done a great job. Besides motion detection, the Panasonic also has a sensor that detects heat. But since mine looks out a window the sensor doesn't work well if at all.You can adjust Panasonic color, brightness, etc. Not the Sharx.They both have zoom which is nothing more than zooming in on the image - the camera itself doesn't actually zoom so the image gets fuzzy.They both have the capability to FTP images, send email, and be setup on a web page.ManualPanasonic comes with a CD which installs a PDF manual. Or you can view it on their website.The Sharx comes with your standard paper manual but with colored text and images - the one thing they seemed to put extra effort into but it may be a bit too explanatory. If you are an advanced user you might get a little frustrated finding what you need. Beginners might find it overwhelming. I will give them credit though, it looks good.SupportPanasonic is superior. In fact, they have a great website that not only offers tips and FAQs but examples on how to code your own controls on your website. They also have excellent phone support on the installation and use of the cam.Sharx - zero support period. In fact, there is very little sales information and no technical information. For support you have to fill out an online form. Haven't tried it so I don't know if it works or how well. The only place I could find that this was an indoor cam was Indoor Only was marked on the box. Not in the manual nor on their website - not even the Amazon description.Night Vision?Both cams are for indoors only but the Sharx comes with night vision. But since you can't hang it outdoors what's the point? If you point it out a window all you get is a reflection of the night vision LEDs. I suppose some people feel the need to monitor their kids at night instead of getting up and checking on them like we have done for thousands of years. But the night vision is basically worthless.For the price and support I am sticking with Panasonic even though I still think it is a bit of money for a single security cam. But with no support and a lousy interface I can't recommend Sharx especially in that price range.", "Date": "December 12, 2009"}, {"Title": "Will not work if you have an AT&T; 2701HG-B router", "Author": "Ron", "ReviewID": "R3V37HN6W394A9", "Overall": "1.0", "Content": "After reading the reviews, we thought we would spend the extra money on this device instead of the LTS model since we wanted to hook it up and be done with it.  Unfortunately, the product failed on step 1, connecting to our wireless network.  I could only get it to connect to my AT&T; 2wire 2701HG-B with either no wireless security enabled or with WEP.  Seeing that WEP security can be broken in a few minutes and no security is not an option, the product is useless to me.  I contacted the manufacturer and they confirmed their product will not connect to a 2wire router using WPA or WPA2 security settings.  I wish I would have known this from the beginning as it would have saved us a lot of time.", "Date": "August 20, 2011"}, {"Title": "Great night vision wireless camera", "Author": "C. Crocker", "ReviewID": "RU2G0HUKSRK4Z", "Overall": "5.0", "Content": "There are so many good things about this camera it's hard to sum up in a short review. First, the setup is straight forward...plug the camera into your router run the included software to discover the camera and you're off. If you know how to find out a device's IP address, all you really need is a web browser to configure the camera meaning it works on Linux, Mac and Windows. The wireless is stable and supports several encryption methods including WPA & WPA2. It has a built in web server so once you have it configured there is no need for a computer other than for viewing the streams. In terms of streaming, the camera has several options and can simultaneously stream 3 different signals (primary, secondary, and a mobile). The mobile stream is great if you want to view the camera using a mobile device such as an iPhone. The camera has a moonlight mode which is ideal when you have only minimal light and the infrared is great for total darkness viewing. The camera has a wide angle of view so it makes for a great nursery monitor, etc. The camera has a built-in feature which allows you to alarm on motion events and be notified either by e-mail, FTP, or HTTP. All-in-all this is a great camera and for all that you get the price is right. If you don't need night vision, then consider the SCNC2606 which offers everything the SCNC2607 does minus night vision. Check out my review on the SCNC2606...both are great cameras...you won't be disappointed with either one.", "Date": "February 23, 2009"}, {"Title": "Really glad I bought this Sharx unit", "Author": "RadThink", "ReviewID": "RAJI7MF150FYO", "Overall": "5.0", "Content": "We needed a night vision (in pitch dark) camera to keep an eye on our baby who is just starting to sleep in the crib by himself and we are always concerned he likes sleeping on his side and is going to turn over on his belly (as he hasnt figured out how to turn back). While we are sleeping in the other room or downstairs it becomes quite tiring to go check on him every so often.Sharx security camera SCNC2607 to the rescue!!! Problem solved.It took me two days to research the cameras online and I narrowed it down to the Panasonic unit and the Sharx unit and all the good comments and feedback from folks who had purchased Sharx made me feel good about ordering the unit. The iPhone support was paramount for me.I first ordered it from Amazon - website said will ship in 1-3 weeks! and then after I ordered it showed \"Temporarily out of stock\"!!! I wasted a day on this and then ordered from another seller MJ Electronics who was selling it for $250. What a useless guy. I emailed and asked them if they can ship immediately. They responded saying they had it in stock (5 word reply). Then I placed the order and 2 days later - SAME crap - out of stock?!! SO I gave up and ordered straight from the manufacturer for $299 (same as Amazon) and used Google checkout. Voila! Camera arrived in 3 days!Manual seemed quite informative (lots of pages :-)). Some info seemed repetitive but they have tried to make it really simple. I spend about an hour on the setup and had it working perfectly with secure wireless on my Mac, PC laptop, iPhone! with AUDIO too! Its awesome. I read in some comments that audio would not work on iPhone. Not true. The free STREAMER app supports rtsp streams and does audio as well (not great - but more than sufficient for my use). Some reviews said Safari does not support audio. Again not true. I set up the camera and clicked on Primary Stream in the browser screen and it switched to quicktime plugin and I get audio in Safari too!My setup: I have a Mac (Snow Leopard), Apple Extreme router, iPhone and the camera and router are in adjacent rooms. I have tested the camera in complete darkness and it is great. With single bulb room lighting the colors are a bit off but I dont care about that.I will try opening up for intranet access tomorrow to see if my wife and my inlaws can connect from work or out of state to view our kid. Will try to update review after that. But I do not expect issues based on what I have seen.Finally, I read a lot about their great tech support - but I have not had reason to call them - thats the best kind of support - when you dont even have to call them! :-)Good luck!", "Date": "June 10, 2010"}, {"Title": "Decent camera but overpriced", "Author": "KM", "ReviewID": "R1AC4P1Z36E80M", "Overall": "1.0", "Content": "This camera provides essentially the same quality as AirLink 101 SkyIPCam777W, but costs twice as much and does not have pan and tilt. I was happy after I bought it but needed a few more cameras and didn't want to spend a fortune. Finding SkyIPCam777W allowed me to see that such camera does not need to cost $300. Sharx may have a bit better color in the afternoon, although I haven't compared them side by side - I may do that later. At this point I would be undecided about which one to choose at the same price level, but twice the price for less features is unjustifiable.", "Date": "December 25, 2009"}, {"Title": "It works (mostly) and support is there... but, how much is it worth?", "Author": "John M. Petersen", "ReviewID": "RTX714BJOCNIA", "Overall": "2.0", "Content": "I purchased this camera almost exclusively based on the customer rating. I have found that most of the time, the rating accurately indicates how my experience with a product will be.Unfortunately, the ratings on this product aren't really about the product itself, they are about the support and documentation.The camera is OK, really no better. Is it extremely reliable? No, I've had it crash on me. Colors - terrible - that IR cut filter from the more recent model would've been helpful. Resolution - mediocre. Framerates - again, mediocre. User Interface - meh, it's usable, but has little enhanced function.The camera was purchased so that we could watch our newborn daughter in her room, to make sure she was OK without actually getting up every few minutes. It works acceptably on ipad and android phone. The recommended app, TinyCam Monitor Free, does not support audio with this camera. Audio is supported using the mobile web interface, however, it drops the resolution down to the point of unusability.My wife liked being able to watch our youngest so much, we got another camera for our 2 year old's room. Now, at this point, I hadn't looked at the documentation nor contacted support, and, figured I'd take a gamble on a much cheaper camera, the Foscam FI8910W Wireless/Wired Pan & Tilt IP/Network Camera with IR-Cut Filter for True Color Images - 8 Meter Night Vision and 3.6mm Lens (67° Viewing Angle) - White NEWEST MODEL, which didn't have many product reviews at the time, but, appeared to be much the same, with pan and tilt, for 1/3rd the cost. This camera has BETTER video quality, with a whole bunch of features, including working audio on the same TinyCam Monitor Free Android app. This caused me to realize, 2/3rds of the cost of this product is basically for the small manual (something like 60 pages) and pedantic support which tells you to look at the manual (I did eventually contact them).Furthermore, there was a piece of paper included with the camera stating not to return it to the vendor... Seriously? Would've been nice if that was clearly stated on the product's description page. While Amazon has been great to me, I have the strong suspicion that trying to return this product would be more hassle than others.And, setup of IP cameras is pretty trivial if you know how to get IP addresses from the MAC addresses on your router (look at the dhcp lease table). I thought there would be more to this...", "Date": "July 4, 2012"}, {"Title": "won't work via wifi", "Author": "dave", "ReviewID": "RYJ9175DZ42VB", "Overall": "1.0", "Content": "It detects the wifi connection and can be confiogured.  However,  once you disconnect the computer it doesn't work - I have spent severeral hours trying toget this to work - i give up....", "Date": "May 24, 2012"}, {"Title": "Fantastic Baby Monitor", "Author": "E. Kesteloot", "ReviewID": "REL4GHMSQRU8N", "Overall": "5.0", "Content": "I'm a first-time parent and admitted geek, so please temper my comments accordingly.In the mobile's place above the crib, we mounted the Sharx camera.  It's been fantastic.  We have a computer on in the living room so we can watch him \"sleep\".  Basically, we hear a noise on our conventional baby monitor and our attention is drawn to the live feed from the crib.  Another nice feature is that you can go get the baby once he's awake but before he's ticked-off.  The night-vision is great.  It's a black-and-white display that captures everything from subtle movements to blinking.We've exposed the camera on the web for the grandparents.  They absolutely love it.  Both sets of grandparents are out of state, and it gives them a window into the little guy's life.  They actually bought a second camera to set up near the \"Pack-n-Play\".OK, some objective comments:  - At first blush set-up seems difficult, but the authors walk you through each detail (including some nice plain English definitions of industry/technical terms)  - You've seen some comments about the color picture being \"pinkish\".  It's due to this being the night-vision version.  The color is a little distorted, but an easy compromise given the outstanding picture in a pitch-black room.  - Technically, the camera performs well.  For fellow geeks:  I've set it up to FTP a snapshot every 15 seconds to a local server.  I have a script that runs daily to put together a time-lapse movie.  It's a great way to get an idea of how he slept.  - I was a little concerned about the lack of a technical forum on Sharx's website.  Instead you just get an email address.  Believe their bold, highlighted statement on the back of the manual \"We pledge that we will not let you fail.  Contact us with any questions, no matter how simple or how complicated.\" - their response to emails is prompt and thoughtful (i.e., they actually read the entirety of the email and respond accordingly).  NOTE:  The issue I had was with my home network setup, not the device.  They were just as responsive as if the problem was with their equipment.  - Based on the manual's recommendation I purchased the IPVision app for my iPhone - worked like a champ.  It also streams nicely to my wife's Blackberry.By the way, I did try the \"Panasonic BB-HCM511A Network Camera with Two-Way Audio\".  While it allowed you to zoom, it's performance in low-light was unsuitable for my purposes.Should you decide to go with the Sharx product, I think you'll be pleased with your purchase.Should you have questions, I'll happily respond to any comments.", "Date": "April 25, 2010"}, {"Title": "Better than expected", "Author": "E. K.", "ReviewID": "R1XKBU0JA4MDZP", "Overall": "5.0", "Content": "I don't often write reviews about products, but I wanted to take the time to leave a glowing review for this camera.  The other reviewers have done a great job addressing the ease of use and interface aspects of the camera.  When considering this camera, I was a bit concerned about the image quality and framerate when using the wireless connection.  On my 802.11g network, I am getting great image quality and framerates.  I would say it is very close to a wired connection, which surprised me.  The IR nightvision on the camera is also superb.  It would have been nice if they used IR LEDs that were completely out of the range of human vision (so there would be no visible red glow), but at this price point I am not disappointed.  I was on the fence about this camera simply because Sharx is not a commonly known brand name, but have been extremely impressed.", "Date": "October 15, 2009"}, {"Title": "Quality, fun product", "Author": "r_a_b", "ReviewID": "R2ZBTWYZUC7VJ4", "Overall": "5.0", "Content": "I wanted a \"security\" camera to access remotely, and this product is excellent.  I, too needed some help finding my camera image on the Web.  Sharx tech support called my landline phone after quickly answering my email query.  This was a Sunday--how is that for service?The issue I had was using a Web IP setting instead of the router's IP address; I would have eventually found the error, but tech support quickly had me up and running.  The picture quality of my \"bird feeder cam\" is amazing.  Even with the wide field of view and distance from the inside-behind-double-pane-glass window to the bird feeder, I could still identify a robin (yep), many sparrows and a cardinal.I am going to security-lock the camera down, but remind anybody that allows open access to pay attention to the audio settings and the various low-light choices (you may see high-quality images reflecting from your window at night).  With a few adjustments it did not take me long to eliminate my reflections.I am looking forward to seeing what my cats really do when I am not home, but may put the camera to serious use watching the weather and my house, too.  As a matter of fact, there may be another Sharx camera in my future.", "Date": "February 15, 2009"}, {"Title": "Awesome camera, great company, fantastic value!", "Author": "Jason King", "ReviewID": "R3J1P5Y4JS0NZO", "Overall": "5.0", "Content": "I am so happy with this camera. Yes, setting it up can be a little challenging but the company was SO helpful... they walked me through all of it. It works perfectly, the image quality is great. and I feel so much safer leaving my house unattended now. Highly recommended. I can watch video of my house from my cel!", "Date": "January 22, 2009"}, {"Title": "Excellent camera, even better customer service", "Author": "Anna", "ReviewID": "R1XIJ1CWL9TC5", "Overall": "5.0", "Content": "I got the Sharx SCNC2607 for a multi use camera: baby cam, doggycam, and camera to keep an eye on the telescope when I am inside. After reading many reviews and doing research I decided on this one as the IR was supposedly excellent, I could broadcast over the internet so my husband could tune in while deployed, and although it is similar/same as other branded cams like the YCam  I heard nothing but positive about Sharx customer service. I am not disappointed on any count. Opening the package revealed a well built camera with a nice thorough manual written in English that actually makes sense and covers many typical situations for setup. Following these instructions I was easily able to get it broadcasting on the internal wireless network in our house within 5 minutes.Next I went to set it up for external broadcast and this is where I hit a snag. I could not get it to work right due to my configuration (a non-industry standard router connected to an Apple Extreme Wireless broadcaster all on a foreign network which is unreliable at best). I sent Sharx an email to the customer service email in their manual and, to my great surprise, I had a response in 15 minutes. Not only this, but they emailed back and forth troubleshooting for the next 5 and a half hours until we finally were able to get the crappy router I had to fix its PnP and DMZ to see the wireless camera outside of the local network. Let me say that this was NOT a camera problem but a problem with my router and they spent the time to not only learn a random Chinese-made router that is not widely used and badly interfaced and help me adjust its settings to work with my jerry-rigged setup. They very easily could have just said, contact your ISP who provided this POS router and ask them what settings need to be changed, but they didn't. They spent all evening and well into the morning (my time) fixing my router's settings. I have never seen a company with such excellent customer service and am rightfully impressed.Now that it is all working, my husband can tune in to us while deployed and the grandparents can check in on their granddaughter.Overall Impressions (1-10 with 10 being highest):Build of camera:......... (9) ----as mentioned in other reviews the IR lights shine red at night but otherwise everything looks solid and well builtManual: .................... (10) ----not just a one page connect this as you get this so many electronics but a through, well detailed manualPicture: ....................  (8)----Daytime looks great, as mentioned in the manual and other reviews it can have a tint of pink but that is typical with IR system without additional filters which can add to why many decent ones are very expensive-nighttime was fantastic. I could easily make out my daughters entire room with the IR sensors on and enough detail to check on her. When set to keep an eye on the telescope I used the Moonlite mode and the red lights around the scope were enough for it to work through the window well enough that I could keep an eye on its progressSound:....................... (8)----a second or two delayed from the picture but that might be my network problems. Otherwise sounds great and sensitive enough to pick up my daughter quietly talking in her bed when she woke in the middle of the night.Ease of local setup:.....(9) ----Took only 5 minutes after reading the manual instructions. You need a little knowledge of your local network (not quite plug and play but simple enough if you have a basic knowledge of your systemEase of external setup: (5)----For most systems, this is probably just as simple as the internal network, but if your router isn't set right to begin with you will have to access all of your internal router's settings which might be a daunting task for those who have never done it. I am well versed in my local network settings and interface and due to my non-typical system setup it was difficult even with the customer service's assistanceCustomer Service:.........(10+)----one of the best customer service experiences I have ever had. As mentioned in my review they took the time to fix my system settings that had nothing to do with the camera itself. Responded very quickly and spent several hours going back and forth until the problem was resolvedPrice for what you get:...(8.5)----while, yes, the camera is expensive it is much higher quality, picture, and sound than any other baby-cam I have tried. Its well-built sturdy feeling design and sleek look make it fit in just about anywhere and the web interface and the fact that you can set it to view with sound, over the internet and record videos via a motion or sound alarm or other various settings make it well worth the price.If you have this camera on your list, just go ahead and get it. You will be happy you did, I certainly am!As soon as I throw in a mini-SD card I will record some videos and post them as well in my review as soon as I can.", "Date": "December 22, 2011"}, {"Title": "The best camera out there - period", "Author": "D. Joshi", "ReviewID": "R26XW125U6K3K9", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moYSXBZGII8HPNembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moYSXBZGII8HPNrefresh_preplay() {\n\ndocument.getElementById(\"cv_moYSXBZGII8HPNchiDiv\").innerHTML = document.getElementById(\"cv_moYSXBZGII8HPNhiddenPre\").innerHTML;\n};\ncv_moYSXBZGII8HPNrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moYSXBZGII8HPNso;\t   \n\n\nfunction cv_moYSXBZGII8HPNloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moYSXBZGII8HPNso = new SWFObject(swfLocation, \"cv_moYSXBZGII8HPNAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moYSXBZGII8HPNso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moYSXBZGII8HPNso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moYSXBZGII8HPNso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moYSXBZGII8HPNso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moYSXBZGII8HPNso.setAttribute(\"height\", swfHeight);\n          cv_moYSXBZGII8HPNso.setAttribute(\"width\", swfWidth);\n          cv_moYSXBZGII8HPNso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moYSXBZGII8HPNso.write(\"cv_moYSXBZGII8HPNflashcontent\")) {\n          fp_resizePlayerSpace('cv_moYSXBZGII8HPN', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moYSXBZGII8HPN';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moYSXBZGII8HPN', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moYSXBZGII8HPNloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moYSXBZGII8HPN\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1YF2SAOP8C6JC\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1YF2SAOP8C6JC\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R26XW125U6K3K9\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1YF2SAOP8C6JC/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moYSXBZGII8HPNduration')) {\n      document.getElementById('cv_moYSXBZGII8HPNduration').style.display='none';\n    }\n    cv_moYSXBZGII8HPNloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moYSXBZGII8HPNloadSwf(movieID, playerVersion) {\n   return _cv_moYSXBZGII8HPNloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moYSXBZGII8HPNnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moYSXBZGII8HPN', 0, h);\n}\n\nfunction cv_moYSXBZGII8HPNresetPlayer(w,h,bw,cc) {\n  cv_moYSXBZGII8HPNnewHeight(h);\n\n  cv_moYSXBZGII8HPNso.addVariable(\"resetBandwidth\", bw);\n  cv_moYSXBZGII8HPNso.addVariable(\"cacheCode\", cc);\n  cv_moYSXBZGII8HPNso.setAttribute(\"height\", h);\n  cv_moYSXBZGII8HPNso.setAttribute(\"width\", w);\n  cv_moYSXBZGII8HPNso.write(\"cv_moYSXBZGII8HPNflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moYSXBZGII8HPNRollOverImg = new Image();\ncv_moYSXBZGII8HPNRollOverImg.src = \"http://ecx.images-amazon.com/images/I/715quNMufUS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moYSXBZGII8HPNpreplay = document.getElementById('cv_moYSXBZGII8HPNpreplayImageId');\nif (cv_moYSXBZGII8HPNpreplay) {\n  cv_moYSXBZGII8HPNpreplay.onmouseover = function() {\n    cv_moYSXBZGII8HPNpreplay.src = \"http://ecx.images-amazon.com/images/I/715quNMufUS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moYSXBZGII8HPNpreplay.onmouseout = function() {\n    cv_moYSXBZGII8HPNpreplay.src = \"http://ecx.images-amazon.com/images/I/715quNMufUS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moYSXBZGII8HPNpreplay.parentNode;\n\n  var cv_moYSXBZGII8HPNcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moYSXBZGII8HPNcurrentClick) {\n      return cv_moYSXBZGII8HPNcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:07 MinsExcellent product - the day I received it, I put it outside in the backyard to see how it would work. Image was very clear and the camera was about 80 ft away from the router with 2 walls (and the backyard's external wall) - thought image would be distorted - nothing of that sort - absolutely flawless.Fast forward to 3 am or so when I hear the wind howling, and the rain coming down - *ack* there goes my camera! I did read about it being weatherproof but if you look at the camera it doesn't really look like it could do the job - but it did! Has been working perfect for the last 2 weeks - in the cold, rain, and now it's warming up - solid little bugger. Works with my mac (snow leopard)Dropped connection maybe once or twice, but comes back up quickly - within a minute. Compare this to my Axis 207 MW which drops connection 8-10 times a day, and takes 15-20 minutes to get back online.Buying 2 more of these (Setup is very easy)", "Date": "March 18, 2010"}, {"Title": "Wireless failure x 2", "Author": "chillwater", "ReviewID": "R1ZHD1TTFI825E", "Overall": "3.0", "Content": "Have two of these and the wireless on both is now gone. Sharx replaced one when the wireless stopped working and also gave me back the old one so I can use wired. Very nice of them and they were very responsive to my emails. Saddly, the second camera wireless has now gone out. Both lasted 4 or 5 months I think. Coincidence? Just so you know, I know what I'm doing.", "Date": "February 1, 2010"}, {"Title": "Great product!", "Author": "Amazon Customer", "ReviewID": "R1PXHMB8TMETE9", "Overall": "5.0", "Content": "Outstanding hardware and software (as far as I can tell).  After a break in a few weeks back, I installed this camera and added a 1 TB hard drive to my old XP machine and I now have 24/7 coverage of my boathouse and dock.  The night time pictures are great, and the software is easy to set up to your liking (you can trade off image quality to decrease the load on your network or accomodate your storage limitations).  The sensativity slider in the alarm set up page allowed me to reduce the number of false alarms.  The ability to remotely monitor the dock when I'm away from home is also neat.  I'm thinking of ordering a few more to give me complete coverage of my house as well.Update:  The XP machine gave up the ghost a few months ago, but it worked great with Vista Home Premium 64 and now Win 7 HP 64.", "Date": "August 3, 2009"}, {"Title": "WOW!  Great camera, great service", "Author": "gail", "ReviewID": "R1K65HQT7XV27W", "Overall": "5.0", "Content": "Wow,this is really easy to use. I had alittle trouble with the initial setup(my fault). I emailed securcam and in 5min. my cell phone rang with a tech. to help me. I wasn't near the camera at that time, so I emailed the tech at 10:00pm to let him know I was available and he called me back at 10:05pm at night. In 5 min. the problems were fixed. The camera was blocked by some metal in my roof. He tested the camera on the internet with me. I was up and running in minutes.  I purchased this camera from this company because of the great reviews. They were all true.", "Date": "February 2, 2009"}, {"Title": "Amazing value, but customer service is the best part", "Author": "Artemis Smythe", "ReviewID": "R1DR8LMB0WE40B", "Overall": "5.0", "Content": "I've had an SCNC2607 running for about 18 months now, and it works great.  After many months of use, the external power supply (wall plug) did fail.  I contacted Sharx, who replied by email within an hour and had me mail the camera back to them.  They identified the issue and sent me back the camera with a new power supply free of charge.Customer support also helped me with some configuration issues over email when I first set it up.  It's rare to experience this kind of customer service in this day and age!  Sharx may be an unfamiliar name, but I'm a fan.I also noticed they continue to add new features and refinements via firmware updates.  Nice.", "Date": "September 24, 2011"}, {"Title": "Good support", "Author": "M.Holle", "ReviewID": "R1QRDVERN2312V", "Overall": "5.0", "Content": "I purchased the 2607 model over the weekend, received it on Tuesday and had it on my local network within 20 minutes. Then I spent the next several evenings trying to get it up on the internet. If you're not a techie, this can be frustrating. I had no idea about ports, static vs dynamic ip's, or intranet vs internet until i began this project. The manual by itself is worth a read just to better understand your network.I had an older 2wire router that doesn't support UNpN - things got tough until i scanned to the very back and found my answer on appendix B. Assigning a static ip baffled me - chosing a compatible local ip range must use the first three GROUPS of numbers on your net, i mis read this as retaining only the first three numbers. The point is slow down and read carfully. When i finally gave up and emailed tech support, they responded within minutes - got home that evening and had everything running on the internet using no-ip as a host.Very good camera, decent picture although my next one will be the xx06 model to avoid the color washout with the infrared units. Excellent tech support and a well written manual. Definetely reccomend sharx products...Do not use the website contact, they don't respond to the inquiry, rather just send an email to info at sharx security dot com.", "Date": "March 12, 2011"}, {"Title": "Exactly what I needed", "Author": "Joseph S. Barnes", "ReviewID": "R3O3B1RH91730R", "Overall": "5.0", "Content": "First let me say the reason for all the high marks on this product is not just because it worked exactly as advertised but when I was having difficulty with getting everything to work Sharx Tech Support was the most professional and Quick to respond that I have ever dealt with. Now on to the Review and how I used this device and got it up and working.I am part of a small organization that basically wanted to monitor a single room that is closed off from the rest of the area. Any closed circuit or dedicated system we were looking at were very cost prohibitive. We managed to use a couple of devices to make somewhat closed circuit system of our own. We took the Lacie Wireless space with its built in NAS and this Wireless Security camera Since this Camera can record directly to Network Attached storage it made for a very low cost, small footprint solution to our issue. The camera covers almost the entire room about an 18X15X8 room. We had some trouble configuring the device to record to the NAS, but after a quick trouble shooting session with Sharx (the tech support treated me like a person and not a script) it was determined that their device was working exactly as expected. After a much longer trouble shooting session with Lacie they came to the same conclusion as Sharx and I did and that was the device was bad. They quickly replaced it and when this one was set up everything work perfectly. The Camera connects and records to the WirelessSpace no problem and it is separated from any other network so only people with access to the wireless signal can get to the camera. Its a great little system and comes in for less that 500 for the whole setup. Considering every other system we looked at was in the thousands of dollars range I would say this is a Great solution for our needs and just might be the solution for you. Its worth looking at for the price you can't beat this quality.", "Date": "February 1, 2011"}, {"Title": "Best Pet Cam!", "Author": null, "ReviewID": "R2GK0GK1XN8MDH", "Overall": "5.0", "Content": "Love Love Love this product! works really well and relatively easy to set up. Picture clarity is excellent! I'm buying another!", "Date": "October 1, 2010"}, {"Title": "Fabulous Customer Support", "Author": "Chris Harnish", "ReviewID": "RTO8FNS18P64T", "Overall": "5.0", "Content": "In setting the camera up, we had an issue with an overly complex AT&T; modem/router. The Sharx tech, Ray, worked with me and then with me and the AT&T; tech until we got it right. I felt totally taken taken care of. Their statement on the back of the user guide is 100% true: \"We pledge that we will not let you fail.\"The user guide gave particularly detailed and easy to follow instructions for setting it up with an Apple Airport wireless router, which is rare for user guides.", "Date": "September 21, 2010"}, {"Title": "Get this Network Cam!", "Author": "Scott E. Russell", "ReviewID": "R29XI53549L35F", "Overall": "5.0", "Content": "I've been looking at wireless network cameras for added security in my house. I first bought a Panasonic BL-C131A network camera and had nothing but problems with it's wireless performance and accessibility from outside my home network ([...]). After struggling with the Panasonic for a week I decided to return it to Amazon, which if you've never returned an item, it was easy as pie.After I did the return I noticed the Sharx network camera, in particular the SCNC2607. I was a bit hesitant on purchasing the Sharx camera since I had such a bad experience with the Panasonic. But after my return was accepted I ordered the Sharx.The camera was delivered yesterday and after getting it unboxed and connected, it was setup in a matter of minutes. Of course there are setting such as the motion detection settings that need to be tweaked but all in all the setup was a breeze and only took a short time.What is nice about this camera is that it does not require a Windows computer with its software to do the initial setup. Once the camera is connected to the wired LAN it can be setup all from within a web browser.I have an Apple Time Capsule router with Comcast high speed internet and have no problems at all setting up the camera and accessing it from outside my home. Another nice feature is that the camera has a built in dynamic DNS client that can be used to setup external access to your camera. I use DynDNS and it's fully compatible.I also had a few questions for Sharx and if you email their info email someone will answer very quickly to help. Along with a great user manual there should be not problems in setup and support.I know this camera is a bit more than others like the Panasonic but it is well worth it. It has a great picture and is easy to setup. Give it a try.", "Date": "August 26, 2009"}, {"Title": "Price worthy product", "Author": "Joe.V", "ReviewID": "R1X97Q1D3BAGRW", "Overall": "5.0", "Content": "Purchased the SCNC2607 since I wanted to see my newborn while away on duty. Didn't expect much, mostly since I was not familiar with the brand name and that it's pretty cheap compared to similar products. I picked this particular camera (in a hurry) thanks to the positive reviews on Amazon.What I needed was 1. Clear video 2. Mpeg-4 (for smooth stream) 3. Wireless 4. night vision. After having it running for two moths I must admit that I am amazed on the quality of this product.I work for a large organisation where we currently work with top brands like Axis 221 and 233D, Panasonic I pro. The other day we were comparing my Sharx with Axis 221, a camera that is 4-5 times more expensive and the Sharx totally owed, both on the quality of the stream, nigh vision and triggers.I had to contact customer support once since I had a issue with delivering the product outside the states and can confirm that they are extremely customer friendly and professional as stated in multiple reviews.I would really like them to construct this camera in a pan/tilt/zoom version preferably with both mpeg-4 and H.264 compression.I can totally recommend this product.", "Date": "June 24, 2009"}, {"Title": "Powerful, feature rich camera, AND great picture!", "Author": "George Whittam", "ReviewID": "R13P2RGQB772OP", "Overall": "5.0", "Content": "HIGHLY recommended!There are many interesting products coming out of China, but support is a major concern.  After extensive research my client and I decided on the Sharx cameras.  We were a little skeptical because of the unfamiliar brand name, but the few reviews on here helped us make purchase.  Not only are there no other cameras that I am aware of that can do everything this one can (WIFI, night vision, access from cell phone), but it actually DOES everything advertised.Best of all their support is top notch, which is crucial with a product so complex.  Even the user manual, although brief, is very clearly written and helpful for even the less experienced user.  Still, I wouldn't expect someone who's never setup a router to dive into it without some additional guidance from the manufacturer.The color image is great, but might have a magenta (pinkish) tint when shooting indoors with incandescent lights because the CCD sensor does not have an infrared filter on it, which any ordinary digital camera must have to generate accurate color.  The lack of filter allows the camera to pickup IR images in total darkness, illuminated by its built-in IR illumination.  They even kick on automatically when needed, a setting that is configurable.  In fact EVERYTHING is configurable on these cameras.  They even stream multiple formats simultaneously.If you are Mac user you might need to contact Sharx about how to properly view the video stream with audio, but it is very easy once you understand how it works.  My client was psyched when he could watch from his iPhone while at work and keep an eye on his sick dog.Now we just need a waterproof housing to mount it outside the house, and we'll be all set!You can get one from SecurCam, just search the web for them.", "Date": "February 13, 2009"}, {"Title": "Great Product, Great Customer Service", "Author": "ER", "ReviewID": "R355T77OBLTJJY", "Overall": "5.0", "Content": "I bought Sharx SCNC2606, and Sharx SCNC2607, and SCNC2607W over six months ago. This review is for all of them. The cameras work as advertised and I can describe them all as AMAZING products. I'm not a tech savvy, but I followed the well written manual until I got them all working without a hitch, utilizing almost every single feature including saving to a NAS drive. Their incredible customer service is a different story. I had issues at first saving to my NAS drive, because of the way I set up my NAS, not because of the cameras, but Sharx customer service walked me through the NAS set up and the problems were solved. Never told me contact the NAS drive manufacturer. You can sense how well driven they are to make the Sharx products successful.", "Date": "January 31, 2012"}, {"Title": "Performs as advertised", "Author": "Catalin Goilav", "ReviewID": "ROMTNDP2W51HG", "Overall": "3.0", "Content": "After receiving the camera, setting it up was almost a breeze. My only comment on the installation and configuration is that for me it was not very clear immediately if the camera needs to be unplugged or not from the network cable to test the wi-fi. I found it in the manual eventually, but after some trial and errors.The manual is quite comprehensive, although a bit non professional.The quality of the image is not very good (lack of sharpness and purple tint). I give Sharx credit for mentioning the tinting in the manual, however that is not an excuse. Regardless of infrared or not, the camera should be able to switch from purple tint to super clear and correct colors when there's enough light. I get purple tint even in normal day light which is not ok.Other than that, I find the fact that I can move the camera any time from one location to another super convenient. I only need a power outlet and that's that. Give it power and it's back up and running.They should have included a clamp for mounting the camera on cribs, desks and other indoor ledges. I was pretty dissapointed with the mounting system which only allows screws.Overall it's a good camera for mediocre expectations which was also my case. I use it for baby monitoring where I need to catch movement and noise bot not extreme detail.", "Date": "December 3, 2009"}, {"Title": "Pretty good for the price.", "Author": "J. OHalligan", "ReviewID": "RAH2WJT04ABW8", "Overall": "4.0", "Content": "No a bad unit for the money. Easy to set up and the video quality is great on your home computer or laptop. I use this as a baby monitor and to see my son while I'm at work and missing him. I'm thinking of adding a few more for security cams at home also.  I can use it on my iPhone (the reason I got it) but the video is chopy. On my iPhone it looks as though the video is about 10 frames per second and I cannot get it to stream in 3G mode. Over all a good camera. I did a lot of research and and mostly happy with the camera. If I could watch full motion video with my iPhone I would give the camera 5stars.", "Date": "September 13, 2009"}, {"Title": "Great little camera for the price", "Author": "pulmd", "ReviewID": "R37TFPBFDVMZY0", "Overall": "4.0", "Content": "We bought this camera to use as a baby monitor.  I priced a number of other similar camera systems out and this is definitely the best value for this type of item.  It does take some network setup knowledge, as it's not the simplest thing in the world to set up, but the customer service on this is the most responsive and best of any kind of electronics company out there.  I only wish we could get it to send pictures to my Blackberry.  It sends stuff to the iPhone just fine and the internet web access is easy to use.  I know this is asking a lot, but I wish it had a panning function too and I realize that would add quite a bit of complication to the technology.  Its lens is sufficiently wide angle enough to catch most of the baby's room when we mounted it high in a corner.", "Date": "August 2, 2009"}, {"Title": "BEST BABY MONITOR EVER!", "Author": "Deb A. Longua", "ReviewID": "R25DH6O3LLG6YE", "Overall": "5.0", "Content": "As a new mom, I was looking for a baby monitor that would provide a large, clear view of my baby, while keeping minimal equipment on hand.  Since I have a computer (MacBook Pro), I figured there must be a way to see my baby on my computer.  I found Sharx Security Cameras and contacted them to see if they had a product that could hook up to my laptop wirelessly. They had just launched the VIPcella Camera #SCNC2607 with infrared. I ordered it immediately, and have been EXTREMELY impressed with the camera's VERY clear view in daylight (with color), and it's EXCEPTIONAL night vision capabilities! What's even cooler is the fact that I can also pull up the view on my iPhone, and my husband can log in and view from his PC at work!  And we can record it if we need to!  This is such a brilliant idea, because it's close in price to a typical baby monitor with video, yet it's clean, simple, and we can use it later for a security camera for our home!  Additionally, I was equally impressed with Sharx customer service and technical support who enabled me to get my new camera up and running!  I am not very techy, so it was important for me to have someone walk me through the process! GREAT-EASY-COMPACT-AWESOME!!!  Deb", "Date": "January 20, 2009"}, {"Title": "Very close to perfect, but not quite", "Author": "Tim N", "ReviewID": "RSFE6CC0AR6I8", "Overall": "5.0", "Content": "(Review updated in August 2012, moved to 5 stars, updated comments.)This product is more expensive than others on the market, and it seems this is because of the Infrared capabilities. This is well worth it.Initial reactions for the product are quite positive. The setup instructions are written very well, including directions on setting up no-ip.org or other methods of streaming. These directions are quite literally step-by-step in some cases, telling you exactly what is on the screen and what to click. This is well done. Also, the product itself seems to work as designed, wirelessly streaming data, and sending emails or other alerts as configured.I'm updating my review from a 4-star review to five-star review. My only outstanding gripe:- Browser support. I use Chrome, and not all configuration features are available. In fact, I didn't even know about four or five key features until I tested this on IE. This is quite shocking; why would a web-based configuration tool not be written to comply with browser standards? Note that streaming seems to work on any browser type.Previously when I left my four-star review, I was unaware of the IP Camera app for Android. This app is not developed by Sharx, but it allows me to view the streaming video. Frankly I don't see a need for Sharx to waste development time making something in-house if it already exists and works with their product.The main reason I'm upgrading this from 4 to 5 stars is Sharx support. I had some glitch on my router that made the streaming part of the camera stop working. Sharx called me and we worked it out. It was some of the best support I've ever had. The support is US-based, and clearly these are people who understand the inner-workings of the product (and even of their customers' routers), and they aren't off-shore drones just blindly reading a script.", "Date": "November 16, 2010"}, {"Title": "A great buy I am very happy", "Author": "Tuco \"dindy_g\"", "ReviewID": "R3153C5H61CR25", "Overall": "5.0", "Content": "I bought one of these cameras last year after several \"incidents\" outside my townhome.  I got tired of sitting in the window watching and realistically I could not be there all the time.  So far this camera has helped me to catch who was letting their dog run loose and crap all over my sidewalk.  The other day it helped me to know which kid was using my yard for bike stunts.  I am very happy with the results of this camera and am getting one for my backyard.  I have this sitting in my front window and it is angled so I can see my entire front lawn including my cars parked in the front.  I work in IT but I still needed to check the set up guide for some things but it was really easy to get up and running on my home network.  I keep memory cards in it at all times but I enjoy being able to pull it up fron anywhere on the web to see what is happening at the house while I am at work.  It works OK at night if I leave my 100 watt front lantern on.  I do not use the IR feature because it would just reflect back onto itself from the window glass and I do not want to freak people out who walk by thinking I am some kind of weirdo filming them.  I only really check the footage when I see something amiss.  Make sure you have it set to save \"thumbnail\" photos as it makes it easier to pin point what time frame to check when you have to review like 8-10 hours of footage.  It is a shame you cannot trust people to do the right thing and respect your property anymore but this camera has really given me peace of mind knowing that when I see something damaged or changed at my house I can find out who did it.", "Date": "February 18, 2011"}, {"Title": "Very good camera for baby monitor", "Author": "throwback1986", "ReviewID": "R1TVSCGHWJQABP", "Overall": "5.0", "Content": "The camera is easy to setup and use.  The audio quality greatly exceeds other cameras (looking at you Foscam!) and the picture quality can be configure to be as good as your network will support.  I use the Baby Monitor HD app on the iPhone and two Sharxcams to keep an eye on the little guy.", "Date": "April 23, 2013"}, {"Title": "Works Great", "Author": "Bobo", "ReviewID": "RJRYSOC0D5I3A", "Overall": "5.0", "Content": "I got two of these plus half of dozen Panasonic BL series cams.  Yes, I know it would be cheaper to get one of those Swann camera set.  But I really like where this does not require a unit like a server to host all my video stuff.  I got both units mounted outside the house.  One in the front and another in the back.  Both are outdoors and screwed in under the gutters.  I have night vision enabled.  It is not the greatest night version but compare with other brands, I'm very happy with the quality.  A little clearer would be nice but for the price I paid, I will good.Mobile - I used an app called \"IP Cam Viewer\".  Both Android and IOS versions are available.  This app has a feature where you can see all your cams on one screen.Setup couldn't be easier.  Enter a static IP, the camera is done.  Externally, I open a specific port per camera.  So for camera 1, I have port 8081, camera 2, 8082, etc.  I like ports so I can block them remotely quickly.  Also, I installed a small client from Dyn DNS client.  It runs on any of your machines internally (firewall) and update Dyn your public IP so you can access your camera(s) from the Internet using DNS name.  In my case, it would be something like [...]For the Panasonics, I was able to mount the entire thing wirelessly.  Meaning, I have a camera connected to a battery pack, and the battery pack to a solar panel.  I have all these screw on top of my tree.  So I don't have have to run power or ethernet.  One thing is Winter time, the battery may not charge so there are times where I don't have camera power.  I couldn't get this unit to work in that configuration.  Panasonic works, don't know why.In addition, I set each camera to upload to my  Godaddy page.  If you purchase a domain name, you get like a 1-3 web page free.  You really don't need a web page, just set your cameras to ftp the photos to your domain name at GoDaddy.  I UPS everything, except the on up on the tree.", "Date": "February 14, 2013"}, {"Title": "Great camera.  Horrible mount", "Author": "S. Griffiths \"judgement\"", "ReviewID": "R6D4Q9M1PPUBM", "Overall": "3.0", "Content": "I love this camera.  It was easy to setup. Takes great video.However, here are my complaints:1)  The images are over exposed when in with the IR Illumination on.2)  The mount that the camera comes with is horribly designed.  Almost useless.  The camera flops all over the place and it is very difficult to tighten the mount enough to keep it straight.  It also is hard to point the camera in very many orientations.  The mount is overly complex and I needs to be completely redesigned.3) The power supply should employ a right angle connector so that it doesn't get in the way of the mount, allowing for greater range of motion.", "Date": "May 5, 2012"}, {"Title": "Outstanding Product Combined With Great Service", "Author": "Charles E. Wallace", "ReviewID": "ROI5XZK85EIWO", "Overall": "5.0", "Content": "This camera is excellent. Compact size, superb picture, and overall great functionality. Most importantly, these guys provide the best level of technical assistance I have ever experienced.  I am a novice setting up wireless networks, and the Sharx team was there at every step helping me get  the camera connected to the network. They were friendly, helpful, and, instantly responsive , real time. And I loved therir instruction manual. It is written in \"real English\", not a cobbled translation from a technical manual. I would recommend the Sharx team to anyone, anytime. I wish more tech companies understood and practiced the service model Sharx  uses.", "Date": "April 30, 2012"}, {"Title": "Excellent product", "Author": "YK", "ReviewID": "R3A2RJOTKZAS28", "Overall": "5.0", "Content": "Bought this about a year ago. Have been very satisfied.The installation while not trivial is very well documented in the manual. The manual deserves a special mention as I think it is the one best, most detailed guides to installation that I have seen.The product works very well. We can clearly see what's going on at night time using the night vision mode. The picture is pretty sharp and the colors are pretty good.The most important thing is the ability to access the camera over internet.I have tried several browsers (IE, Chrome, Firefox) as well as Safari on mac and iphone and it worked on all of them although I could only get sound on IE using the Active-X plugin from Sharpx.", "Date": "September 18, 2011"}, {"Title": "Good camera but I sent it back", "Author": "Gregory S Williamson", "ReviewID": "R2JDY4JE3DMYSL", "Overall": "4.0", "Content": "I like this camera but I could not stream the video to my iPad2 with audio. This is not a problem with the camera, I just could not find a player for the iPad that can play password-protected MPEG4 streams. I could view the JPEG stream, which has no audio, and the picture was fine, the infrared is great for viewing a dark room, although I did have to refresh the browser once to reconnect to the stream -- the image was frozen. I was using this for a baby monitor and the screen deceptively showed a frozen image of the baby sleeping. The stream connection issue is probably not an issue with the camera -- more likely it was a problem with the network or the browser. In any case, my hope to stream video from the baby's room to my iPad2 was dashed. Maybe a better McGuyver could get it to work, but I thought it would be easier to send this camera back and buy a video baby monitor.I did try streaming the MPEG4 stream with audio wirelessly to my Windows laptop (with IE/ActiveX), and it worked fine although the web page layout was wonky, with the video overlapping some of the controls on the page.If I needed a security camera to catch the neighbors dog messing on my lawn, or see who was stealing my newspaper off the front stoop, or see what was eating the tomatoes out of the garden, I would buy this camera again. I just don't need that at present.", "Date": "September 17, 2011"}, {"Title": "Outstanding Product", "Author": "2 year Customer - outstanding product", "ReviewID": "R11IH5ZDSTXH4N", "Overall": "5.0", "Content": "As you see in the title I am using the cameras for 2 years. Shortly after I got the first camera I was so impressed that I got a second one since I had add. areas to monitor.My overall rating is 5 stars with no exception and I am using a lot of the cameras features: wireless and wired network connection, SD disk and Network Attached Storage (NAS-Drive), remote monitoring from work PC, Android and IPhone, motion detection, different levels of user security, different streaming configs., Night Vision, different alarm schedules, email notification, cont. recording, snapshot on alarm, video on alarm.If you monitor your baby/child over your phone while you are at friends house, etc. or if you have to monitor a property of yours that is unattended for a long period (get an email notification on an event and check your camera for the recording triggered the email) - the cameras cover a large spectrum of surveillance needs.A view words about the company and the customer service:Sharx customer service is a good as the camera - 5 STARS. You normally wouldn't need them because the camera sets itself up automatically - but lets be honest - we all are special, have special need, our network setup might be improper, or the situation we want the camera to use for might be special and you haven't figured out how to configure the camera to meet your needs (because you are new to the subject) === The company is there for you ===One weekend my router failed and I noticed it by using the camera. I thought it was the camera and contacted Sharx. They exchanged a few emails with me and help me understand my issue (the router) and got me back running during the same weekend!!!Bottom line: I did a lot of research, had different products from different companies, after I found Sharx my needs are met and I would by another cam from them in a heart beat if I have the need for it!", "Date": "September 17, 2011"}, {"Title": "Great Camera from a Great Company!", "Author": "DMA", "ReviewID": "R30707GGLVJ8M4", "Overall": "5.0", "Content": "I received this camera over a year ago as a gift and I couldn't be happier with it.  It is both easy to install and use, and the video quality is wonderful. To be able to be on the other side of the country and login to see what is going on in your home is comforting, having it work correctly is priceless.  If you ever have questions or need help, SharxSecurity responds to your emails in a matter of minutes and get any problems resolved.  I would highly recommend them to anyone!", "Date": "September 15, 2011"}, {"Title": "Great instructions", "Author": "BenRen \"brendanr0011\"", "ReviewID": "RFBU93BGXZ85V", "Overall": "4.0", "Content": "Seems like a bunch of these cameras are very similar.. attach to wired network, set up for wireless, switch to wireless, configure dynamic DNS for access anywhere, set up email alerts, etc.  The winning aspect of this camera was a set of very precise instructions that I could follow without a hitch, for OSX and a Time Capsule.  Got it all working within an hour or so, and didn't need to use the promised tech support, but appreciated the fact that it's offered.", "Date": "September 9, 2011"}, {"Title": "Great little cam", "Author": "Rick Scott", "ReviewID": "RUVSV52YLYH9V", "Overall": "5.0", "Content": "This IP Cam does what it says! Simple to set up, easy to view online, on my iPhone and iPad. I bought the iOS IP Cam Viewer app, $2.99 and it works great on both iPhone and iPad. Now when I have a motion detector go off at home I can view from anywhere in the world. Great stuff!", "Date": "July 15, 2011"}, {"Title": "Sharx Security - Firmware V4.21", "Author": "James M. Martin \"Mike\"", "ReviewID": "R2BNJVACDXM9E4", "Overall": "5.0", "Content": "Does anyone have a phone number for Sharx Security?  I need the latest firmware release and can't figure out how to get in contact with them.", "Date": "February 25, 2011"}, {"Title": "Excellent Camera and Manual", "Author": "Appreciates Quality \"G\"", "ReviewID": "RR07U270L8C2U", "Overall": "5.0", "Content": "This is an amazing product.  Takes some time to setup as it does everything you need.  The manual is great and there email support was patient and very helpful.  Tried a Cisco camera first, no manual, install disk did not see my network.  Tried it on two computers.  Gave up and bought this.  You do have to understand your settings but the manual explains them step by step.  They also have an outdoor camera.  This is sold on the sharkxsecurity website.", "Date": "February 18, 2011"}, {"Title": "Excellent Camera with an Excellent Manual", "Author": "David Burkhart", "ReviewID": "RPJG6U8FW07O2", "Overall": "5.0", "Content": "This is a great camera. The manual is possibly the best written manual for a technical product that I have ever encountered. It is written in clear language, and anticipates many of the confusions people may have. Make no mistake--this isn't completely plug-and-play (not network device like this is), and if you are completely unfamiliar with networks, you should read the manual carefully. I had one question I wasn't certain about, so I e-mailed their support, and got an excellent answer very quickly (and, yes, had I read the manual more carefully I would have seen the answer).The camera has great picture quality, and the night feature is great. I'm glad I didn't go with a cheaper option.", "Date": "November 5, 2010"}, {"Title": "Works well - as expected based on reviews here", "Author": "Karl Fronk \"gadget man\"", "ReviewID": "R3KYZ1MBNTR8OQ", "Overall": "5.0", "Content": "I like this camera. Easy to set up. This may seem like a minor detail, but even this expert had to repeatedly reference the well written manual to get it set up correctly. Can record video within camera on microSD card. Sends emails on motion detection which is nice. Can watch live video on cell phone. Has been connected since the day it was set up - no issues reconnecting when power fluctuations knocked out internet.", "Date": "October 4, 2010"}, {"Title": "The best stand alone web network camera for the iPhone and iPad", "Author": "Amazon Customer", "ReviewID": "R20UMUGO67VVBS", "Overall": "5.0", "Content": "I am not a network person so I was greatly pleased at how easy this was to set up.  This security camera helps monitor our vacation home.  It has been running 24/7 since December with no glitches which is almost unbelievable in the computer world.  One of the best things about this video security camera is that it is easy to access from the iPhone and the iPad.  We even had a situation where we were worried that the caretaker's cat had snuck back in minutes before the house was closed down for the summer.  We were able to verify with the camera's help that the cat was not inside because we could see the cat on the back porch looking in through the sliding glass doors (whew!)The manual is excellent.  I am now considering a multi-view setup with additional Sharx cameras.", "Date": "September 20, 2010"}, {"Title": "Excellent Application - Great Customer Support.", "Author": "DV_User \"DV_User\"", "ReviewID": "R32OZGRF1Y57OI", "Overall": "5.0", "Content": "The Camera delivers exactly as advertised. You pay a premium price for a premium product.I had some problems to view the Camera online from a remote location because of some home networking complications. The Customer Support was highly qualified and very responsive. They provided me with detailed technical but yet simple instructions on how to make the Camera work within my home network (AT&T; Router, Wireless router and VOIP Phone adaptor). After a couple of emails everything worked exactly as advertised.Thanks!A Very Happy Customer.", "Date": "August 26, 2010"}, {"Title": "Great Product, Great Support", "Author": "b-rock", "ReviewID": "R3QU07AAS42W9M", "Overall": "5.0", "Content": "I purchased this after buying and returning the Sharx 6206 model, as the moonlight mode on the 6206 did not see well enough in low light to serve as a suitable baby monitor.  The night vision mode on the 6207 is great and overall I would recommend any of the Sharx cameras.The camera comes with a detailed instruction book, written in plain English, that walks you through every step of the setup.  I did have a few complications as my new setup on my router was conflicting with the previously established configuration.  I sent several questions to Sharx support and got quick responses every time, helping me to establish connectivity with the camera over the internet and configure DDNS.My only complaint is being unable to hear the sound from the broadcast on my iPhone, but I understand that to be an iPhone issue rather than something with the Sharx camera.Bottom line, this is a great product and definitely worth the money.", "Date": "August 5, 2010"}, {"Title": "worth it", "Author": "the dude \"Festivus\"", "ReviewID": "RZ0FVACMGXZNY", "Overall": "5.0", "Content": "I had some difficulty setting up the camera, but this is mostly my fault because I have 2 routers.  However:  I contacted them for help via email on Sunday and they responded within 30 minutes.  They responded after 3 more queries in a timely fashion and helped me each time.  I am now able to view the camera over my wireless network and on my blackberry.  The picture is amazing and the IR nightvision is quite remarkable.  I don't have any experience with the other manufacturers mentioned by other reviewers, but if you're afraid that this company doesn't stand behind its product - don't be.", "Date": "February 8, 2010"}, {"Title": "Good Camera, Outstanding Support", "Author": "Geraldo V.", "ReviewID": "R7GPFUJDVS2TC", "Overall": "5.0", "Content": "1. Supports iPhone/iPod Touch Safari browser.2. Supports RTSP streams to Blackberry Media Player/Web Browser3. Support by email is very fast.  A sound issue found in the evening was acknowledged and fixed via email/remote firmware update in less than 10 minutes.4. Overall, the camera works rather well.I highly recommend this camera and Sharx to anyone interested in netcam technology.", "Date": "February 8, 2010"}, {"Title": "Great Product, Great Service", "Author": "Matt", "ReviewID": "RBKNGP360UHCC", "Overall": "5.0", "Content": "I purchased two of these cameras a month ago for security.  I had tried two different cameras before buying these.  The other two cameras would not work with my AT&T; e-mail, which like gmail requires SSL to connect and send mail.  This camera works well and was very easy to set up with its universal plug and play (upnp).  The cameras automatically set up my wireless router's port forwarding.  I have a DSL router in front of my wireless router, so Sharx helped me set up port forwarding in the DSL router.  This was not difficult.  Sharx helped via e-mail and offered to set up a telephone appointment which I did not need.The Sharx technical support is the best technical support I have come across in years.I highly recommend this camera.  I think these would make great gifts for families with young children and for people who enjoy technology.  The camera met all my expectations, which were high after trying two others.Thanks to Sharx for this product and their service.", "Date": "August 18, 2009"}, {"Title": "execellent security camera", "Author": "Roby Hartono", "ReviewID": "R2OSPYA7MCX4PL", "Overall": "5.0", "Content": "everything is very good on this security camera....especially if you need extra feature during the night time where there is no light on the surrounding area.", "Date": "May 17, 2009"}, {"Title": "superior customer service", "Author": "Ellie", "ReviewID": "RKS3YOIXCTIFF", "Overall": "5.0", "Content": "Fun camera to have, We got it for security reasons, but are enjoying watching the nightlife around here.  seeing much more than we expected. Footage is very clear.  If I could give 10 stars for customer service, I would,  I'd never set up wireless anything, and was nervous about getting the new wireless router connected as well as the sharx camera.  felt I was in over my head.  The sharx customer service was exceptional. I ran into something I did not know early on in the process, Sharx sent me handout, pictures  explaining the process and then called to walk me through the process, and continued to walk me through the rest of the setup. I am new to video taping and they have answered all me newbie questions with true help and patience, even on things not directly related to their camera.  A real pleasure to work with. Highly recommend this company.", "Date": "April 1, 2009"}, {"Title": "Good Little Camera", "Author": "David Feeney", "ReviewID": "RZ9GDZPFV6CT8", "Overall": "5.0", "Content": "I consulted with a security company about installing security cameras for our home - the quote I got back was $1400 for two cameras and a DVR.  I decided instead to try this solution as the price was better and the reviews were generally good.  Overall I am pleased with this product; it performs as advertised and the support is very good (albeit via email).  The one thing I would warn others about it the night vision does not work well when the camera is looking out of a window.  The IR light reflects back on the camera and the image is poor.  The 'Moonlight' setting works well to compensate for this, especially if you have at least a little light outside at night, say from a streetlight or neighbor's house.So, if I had known this I would have saved a few bucks and bought the regular model without the night vision.  Also, the colors with this model are off due to the requirements of being able to see in the dark, which I don't do, so that's kind of a bummer, too.  If you have the need to see in complete darkness, inside, then this is the one for you.  If there is some ambient light and/or you are pointing it out a window I would suggest the SCNC2606.", "Date": "September 12, 2010"}, {"Title": "Sharx VIPcella SCNC2607 Camera", "Author": "J. Herman", "ReviewID": "RY8QH25WLF4WG", "Overall": "3.0", "Content": "Not knowing anything about security cameras, I purchased the Sharx camera based on various reviews I read in different websites. I tried it for a week and it might be okay for some people, but it did not work well for me. I adjusted the position of the camera, I adjusted the infrared on the camera, but nothing seemed to improve the night picture. The people at Sharx are fairly prompt at responding to inquiries for help. The short of it: Needless to say, Amazon was gracious in allowing me to return the camera.", "Date": "August 14, 2010"}, {"Title": "don't waste your time with anything else", "Author": "Rowol", "ReviewID": "R1ASE1PENXZ5M5", "Overall": "5.0", "Content": "I researched this product for a lot longer than I would like to admit.  I finally bought both the day and night capable versions 2606 and 2607 models and could not be happier.  Set up was a breeze.  I had one quick question and Sharx support could not be more helpful.  In fact, they didn't rush me off the phone like other companies and actually showed me other features of the camera that I didn't even know existed.  I use the night cam to monitor my little boy.  It has never failed in complete darkness.  Perfect when I'm on the road and want to check him out on my iPhone.  Simply awesome.  Between picture quality and ease of use, it's a no brainer.  Stay away from the PC only cams.  This works on my Macs and PCs as well as multiple phones.  Simply amazing!  For once, a product that not only does what it says, but does it better!", "Date": "December 18, 2009"}, {"Title": "Good cameras!", "Author": "Darla", "ReviewID": "R2LXHBL2C1DU6B", "Overall": "4.0", "Content": "Love our new cameras.  Excellent customer service at Sharx too.  Straight forward set up and your security camera is on the job.", "Date": "November 4, 2009"}, {"Title": "Best IP Camera", "Author": "S. Kalarakis", "ReviewID": "RKY24WNNZPFY7", "Overall": "5.0", "Content": "Setup the camera took less than 5 minutes. Day and night mode excellent. Microphone works good. Planning to get 2 more.", "Date": "September 12, 2009"}, {"Title": "LOVE IT!", "Author": "Joe Long", "ReviewID": "RGU6AAY5ZVKGB", "Overall": "5.0", "Content": "I love this camera. The image quality is excellent!  It took me about ten minutes from the time I open the box, read the manual for the first few pages, and voila, it is working beautifully.For sure, I will buy a couple more for my house security.  The best product!", "Date": "August 19, 2009"}, {"Title": "Not better than any $50 camera", "Author": "Amiram Saban \"amiram2000\"", "ReviewID": "RNHCBZNLNZ0B0", "Overall": "2.0", "Content": "I have purchased this product based on high average rating and company's commitment that they \"will not let you fail\". The high price make me believe that this is a good reliable product. Boy was I wrong.  Sharx first response arrived after 4 days by e-mail  (I could not find a phone number). Their 2nd response came after 10 days, and their 3rd response have never made it.  This product is no better than any $50 cameras. Do not worry about risking $300 on a bad product. Do worry about spending 30 hours trying to make it work. If you have free time, then this is the right camera for you.", "Date": "December 31, 2010"}, {"Title": "Customer service was outstanding.", "Author": "M. Williams", "ReviewID": "R1ZX1FDBCCDDL4", "Overall": "4.0", "Content": "First the good news: This camera did everything it said it would.  I was able to set it up on the internet for use with my iPhone and web browser at work.  Great!  I was really pleased.  The manual was very thorough and easy to read and follow.Now for the bad news: I bought this camera in August of 2009 and used it continuously for a month.  After that, it was no longer needed and put away. I took it out last month to set it up again and it will not power up.  I have tried different sockets and checked the wires but nothing.  I have contacted the company for a replacement and  I am waiting to hear from them.I will report back when I hear from them.7/30/10Update:  Customer service was outstanding.  I explained my problem in an email and after a few attempts at troubleshooting, they asked me to return the unit citing that it was a problem with the adapter.  I now have a new unit.  I am very pleased with the outcome.  However, I will not let it sit in a closet ever again.", "Date": "July 14, 2010"}, {"Title": "Quality product", "Author": "Mike S.", "ReviewID": "R33UCVS4PII8WU", "Overall": "4.0", "Content": "I have the camera installed outside in a plastic ycam weatherproof case (~$125 from the US distributor). Wireless ran okay for a while. I had to run an ethernet cable due to the number of wireless signals in my area. Living objects are pink / purple. The camera's focus is excellent. The daytime picture is very clear. Nighttime video, with IR on, has a lot of motion blur and cloudiness. Bugs love the IR. IR illuminators are available from other sources. I may buy another one of these cameras or a ycam (same thing) in the future.", "Date": "September 29, 2009"}, {"Title": "Great Camera!", "Author": "V. Dutka", "ReviewID": "R37TBHKP750P00", "Overall": "4.0", "Content": "This camera is easy to set up (assuming you are familiar with setting up network stuff) and the quality of the images is great. It works very well in all light levels, the images are sharp/clear and works on a Mac/iPhone. I just wish that you can hear sounds via a Mac (it only works with PC's using ActiveX controls).", "Date": "June 21, 2009"}, {"Title": "Who are the 5 star review?", "Author": "Pac Lay", "ReviewID": "R1GGZBEZWCSDSZ", "Overall": "3.0", "Content": "How can this product get so many 5 star?This camera have the same feature set as other camera cost 1/3 but does have a better picture at low light.  Took me hours just to get wifi working.  I have the Trendnet 110W and took me less than 30 mins to setup.Pro:Good picture in low lighting.Good Motion detection(only in good lighting condition)easy setup if you just want to view the feed with network cable.Con:when setup email and fty alarm, can't test whether it is working.Wifi is vary picky(certain channel, only 8 character passkey for wpa3#FTP not working#still waiting for tech support)", "Date": "November 8, 2009"}, {"Title": "frustrating support", "Author": "ben", "ReviewID": "RKTVADROSKXIW", "Overall": "2.0", "Content": "camera setup took several hours, and that was with support on the phone.  After it was set up, everything worked great.  Except that to record using their software, multi-live, it has to be open and the computer has to be running in order to receive videos.  This is not explained in the manual.  This was very frustrating for me because I couldn't understand why I wasn't receiving surveillance videos.for people who live busy lives, tech support leaves a lot to be desired.  They prefer to support you via emai.  However, even then they selectively answered my questions...I asked the same question about 4 times, in separate emails over a period of two weeks (they don't always respond immediately).  I got one person to agree to talk to me on the phone to set up one camera initially; the next time I tried to speak with someone I missed the scheduled phone appointment (you can't just call in, they don't answer the phone). I have not been able to get a tech on the phone in the last 4 weeks.  Since they prefer to use email, it can take weeks to get issues resolved, at least it has been this long for me.  I've actually been begging to have a phone conversation with tech support, humiliating really.For those who think like a techie, setting these cameras up might not be a serious challenge.  If you don't and you're a busy person, this might prove to be a frustrating experience.", "Date": "October 29, 2010"}, {"Title": "Doesn't work through window at night", "Author": "jj", "ReviewID": "R350BJX9S3ZLI", "Overall": "1.0", "Content": "Dont purchase if you are hoping to monitor through a window at night, all you see is bounce back lighting against window coming from camera. Connection problems and not easy to use.Otherwise the image quality is decent, but I could never get it to stay connected and use iPhone for monitoring.", "Date": "May 29, 2012"}, {"Title": "can't say enuthing but great camara", "Author": "Dr. Harold Osborne \"hw\"", "ReviewID": "RQQFRD3JYF7X9", "Overall": "5.0", "Content": "these cameras are the greatest and there tec. support is better then anything i have ever used you will just love what they can doo a lot better then wilife they stink had 6 of them and lost  5 of them afer 1 year don't buy wilife", "Date": "October 7, 2009"}, {"Title": "Great customer service from Sharx!", "Author": "VHX2195", "ReviewID": "R3L6HCDFTZLI85", "Overall": "5.0", "Content": "It took me about ten-fifteen minutes of total work to set up this camera, and I had one minor problem (which was my fault for not reading the manual closely enough)--Sharx customer service emailed me back with the solution within a couple hours.  With so many products these days you cannot hope for a response within weeks, if at all, so to get help so quickly is really super customer service.  Before this I had the Panasonic camera, and the video quality of the Sharx is definitely superior, although the Panasonic has a longer wireless range.  And of course the Panasonic is useless at night, versus the night vision of the Sharx!", "Date": "October 6, 2009"}, {"Title": "So-so camera", "Author": "nicubunu", "ReviewID": "R11J0NVZLKFORE", "Overall": "2.0", "Content": "From a technical point of view the camera  is so-so, the part I was unhappy the most is the support: on the manufacturer website you won't find any \"support\" section with FAQs, help or documentation. The only thing you can do is to send an inquiry from a very simplistic web form and wait to be called back, during the work days and when they are not in the filed, at a customer site. Which does not work well when you are in a different time zone. In the end, the support  engineers will give some generic answers and will offer to connect remotely and configure the camera for you, black magic, without you knowing what happened.Back to the technical side: the image quality is OK (not great), the camera works OK with Firefox, lacking only a few additional and little useful features present only in Internet Explorer. A problem for me was the camera work in wireless mode only then the LAN cable is disconnected, so you have to make the initial settings with a LAN connection and hope for the best when switching to wireless.", "Date": "March 3, 2009"}, {"Title": "I love this company and their products", "Author": "Gail Olbrich", "ReviewID": "R2FU7N14LEQ8XX", "Overall": "5.0", "Content": "I love this camera.  It does everything that was advertised.  It was fairly easy to setup, but I did have a couple questions along the way, mostly due to my router being very old.  I went online to the Sharx website, filled out their contact form, and was contacted via email (my preferred method) right away.  Their help was wonderful.  Clear, simple, polite, precise. I wish I could think of more adjectives.  I will buy from them exclusively in the future.  I have never had a more pleasant experience with tech support on any product at any time.", "Date": "October 30, 2009"}, {"Title": "Worthless", "Author": "D. Gordon", "ReviewID": "R3VOSE2W6RN269", "Overall": "1.0", "Content": "I received this product today about 5 hours ago. I have read the manual and attempted to follow it to a T. I have had to reset the item twice because when I followed the instructions the item became invisible to my computer. For 300 dollars this product should have been very simple. Instead I find out the only way to contact support is through email. The only way to look onto this product from another computer or a cell phone is by signing up with a website and hope you get a free IP address. I am extremely frustrated with this and realize that this is a waste of time and money.", "Date": "July 31, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001P4NHUA"}}