{"Reviews": [{"Title": "Great value for the money.", "Author": "Xairboater \"Keith\"", "ReviewID": "RV6F6LOTHQHFK", "Overall": "4.0", "Content": "The Panasonic BL-C101A Fixed MPEG-4 Network Camera is the 3rd Panasonic Network cam I have purchased in the last year.  The images are OK depending on lighting condition, which I knew before I purchased.  Definitely not a low light camera.  I like the 1 wire POE connection!  Adding the camera to the recording software was easy.  This product is a great value: where else can you get an internet/mobile phone accessible security camera with recording software and Panasonic quality for a little over $100?", "Date": "August 23, 2010"}, {"Title": "Poor image quality", "Author": "Greg", "ReviewID": "R35170YOZ7WGL2", "Overall": "2.0", "Content": "I purchased this camera as an upgrade for the older BL-C1A. Unfortunately the image quality was terrible (especially when compared to the clean image from BL-C1A). Unclear if the problem was specific to my unit or a general problem. The MPG4 encoding is great and even MJPEG encoding is much faster. The microphone is a nice touch and the field of view is improved over the BL-C1A. However, none of this can make up for terrible image quality.", "Date": "January 16, 2010"}, {"Title": "POE is indeed PROPRIETARY on this BL-C101A camera", "Author": "T. Gale", "ReviewID": "R9I5TL019LQLU", "Overall": "3.0", "Content": "This camera uses Panasonic's \"Proprietary POE\".  POE is P.ower O.ver E.thernet. In a small business setting, I need the thing to work with my POE switch. Instead, Panasonic wants this to be powered by their proprietary device. I give them credit for naming it properly. The box actually says \"Proprietary POE\" in large letters. It's too bad that Amazon couldn't reveal that to customers. I returned mine but will soon buy something a little more expensive from Amazon's selection of true POE cameras. The specs and other reviews indicate that this is a nice camera and a good value. It gets three stars for not including this critical specification in the description.", "Date": "December 16, 2011"}, {"Title": "Great product for the price", "Author": "K. Nikolai \"Photographer\"", "ReviewID": "R118X7K7F0SKSM", "Overall": "4.0", "Content": "I had a project to install several cameras for remote viewing - web-cams. This being my 2nd foray into security cameras and it being five years since my first attempt, I was overwhelmed by all the choices 'out there'. I settled on the Panasonic BL-C101A because of good price and my lifetime history of reliable products from Panasonic.There is quite a learning curve to get these or any IP cameras viewable over the internet. Don't expect perfect response and quality video - not so much because of the camera, but because the upload speed to your ISP will limit playback quality - and the more cameras you have, all need to share whatever bandwidth is available.Another issue with viewing from the web at remote locations is needing a static IP from your ISP provider - or a dynamic DNS service to update the IP address and make the camera available to you. Panasonic provides a link to an assistance service which works just fine - that is: [...]And finally, there is the router and your modem. In my case I had to call the ISP and luckily got good support and a live phone link to the router company tech. folks so I could 'bridge' the modem and the router which is needed to allow port forwarding (open to the internet) to work. The router then logs into the ISP and takes care of the connection credentials - whew. In hindsight, using a 'switch' instead of a router might have made the bridge unnecessary - more homework to do.The hardware here was fine quality and the installation was made easy by the fact of not having to power the camera at the monitoring point - thanks to built in (but proprietary and limited reach) \"power over Ethernet\" capability. These units also transmit audio and have additional software functions such as recording, at the camera location.", "Date": "July 21, 2012"}, {"Title": "Good Value - POE adapter is a bother", "Author": "Nancy L. Leist", "ReviewID": "R1ML0766G1BV80", "Overall": "3.0", "Content": "I bought this for a great price of $54.99 and for the quality I think it is a good value. I choose wired because the location for the camera had weak wireless reception. However, I expected the BL-C101A to be physically configured like the BLC121A when used in wired mode. I missed that it used POE. But even if I had seen that, I would not have realized that the POE adapter would be a seperate component from the camera itself and that I would need 2 ethernet cables. More components and wires than I wanted in the camera location. The POE adapter should be shown in the product pictures or made more visable to the purchaser. For some scenarios the separate POE adapter could be a benefit, but not for all and not for mine. Had I known this I would have spent the extra money for another BLC121A and just used it in wired mode.", "Date": "December 22, 2011"}, {"Title": "Good Value", "Author": "J. H.", "ReviewID": "R9SQWAJ8RMBHK", "Overall": "5.0", "Content": "I've had this camera for about a year. For the money, it is an excellent value. Has a decent quality image, good features and the built in POE injector is a real plus. In this price range, it's hard to find a better camera. Just realize that you'll need good lighting to get any kind of image at night.", "Date": "October 29, 2010"}, {"Title": "Wired POE Fixed Camera", "Author": "Luna_Blue", "ReviewID": "R3HZTEM4FJQH2M", "Overall": "1.0", "Content": "Purchased a refurbished BL-C101A fixed camera for security at the house.  Was much easier to configure than the similarly owned BL-C121A run in wireless mode.  Thought I was getting a deal with the refurbished model. You get what you pay for. Picture quality is ok with adequate lighting. Not very impressive and would not rely on outside of 20 foot range.  Camera has difficulty discerning contrasting brightness (i.e. light on one side of the image with dark on the other). Night mode is a joke - don't even think about using this camera in poor/no light conditions.  Even more concerning is the reliability. After about 4 months of service, the device starting cutting out intermittently. Not sure of the problem, but would encourage others interested in this camera to purchase brand new.", "Date": "July 17, 2012"}, {"Title": "No Jpeg, OK now", "Author": "Paul L \"Paul\"", "ReviewID": "R25N527IBO7T5S", "Overall": "4.0", "Content": "Gives good images but would not recommend this item if you want to get images/photos from it. Does a Panasonic PNC format and there is no way to convert this to any other format.Video OK but that's not what I wanted. (have yet to work out how to save that)Very difficult to get the FTP working, not working yet, not tried the other methods, http/email to get data out but at first glance look equally difficult.Will update as I continue but that 30 days is looking goodGave it 3 stars for quality only but would give zero poor for supportUPDATEGot it all working, was able to get the FTP working, be exact as error report meaningless.Upgraded to 4 stars. Would give it 5 if didn't do active X for sound.Works good on iPhone but no sound.I use this to watch my pool being built in back yard, nice to be able to listen to what being said.It give sound through IE OK though. (loud)Video works good now also though this is not what I use.Very difficult to setup.", "Date": "June 10, 2012"}, {"Title": "If it can't be set up, it's as good as broken", "Author": "Bebbia J.", "ReviewID": "R2196QHQH98X06", "Overall": "2.0", "Content": "I was very disappointed with my purchase of 2 BL-C101A units.  While the images aren't great, they're satisfactory.  Rather, my problem is with the software which makes it nearly impossible to set these cameras up to meet their advertised potential. For instance, I eventually gave up trying to set them up for motion detection email notification.  There is some nonsense in the manual about not supporting web-based email clients and it seems to be true.  I have much more success setting the Edimax IC-3030Wn cameras up, and the picture may even be better. I'd recommend those, for which I paid $30 less over these.", "Date": "March 12, 2012"}, {"Title": "Worth every penny", "Author": "Steve T.", "ReviewID": "RGQTHICA5KFJY", "Overall": "5.0", "Content": "This is a great little camera for the price.  Setup was a snap, I was up and working in no time.  After playing with the settings for a little while, I had it set up just the way I wanted.  You don't have to tweak the settings if you don't want, I just wanted a larger image and I use static IP's on my network.The image quality is amazing, I was blown away.  Compared to the D-link camera it replaced, there isn't any comparison.  When my outdoor camera dies, it will be replaced with a Panasonic too.The one thing that concerned me after I set it up was the lack of ability to capture a snapshot to put on my website.  You can FTP an image by setting up a timer trigger, but the choices are 1 sec (too often), 1 min (too often) and 1 hour (not often enough).  After poking around all the different pages that you can view and looking at the source code of them, I finally found the link.  Add \"/SnapshotJPEG?View=Normal\", without the quotes, to the end of your camera URL and you will see a snap shot with no menus or other data, just a jpeg.  There are lots of options you can put and you have to have at least one or no image will display.  Of course, you need to set up your router to forward to the port specified to the cameras internal ip address.  Just check your router manual to see how to do that.Bottom line, if you are looking for a low price, quality camera, this is the one to buy!", "Date": "September 8, 2011"}, {"Title": "Works great for about a year and then fails", "Author": "Dogmata", "ReviewID": "R3ULKSDXOEO760", "Overall": "2.0", "Content": "Do not buy. These will work great for about a year and then something fails internally... they will then attempt to boot, fail, boot, fail, over and over again. I've had 4 of these things fail, all put into service at the same time, on surge protectors, in different areas, and they all failed within a month of each other.", "Date": "January 29, 2014"}, {"Title": "Excelent expirence in home", "Author": "Daniel O. Fong C.", "ReviewID": "R3TDQDP67EETAN", "Overall": "5.0", "Content": "Bacauae i have more than one working very Well and i have never problems in 5 years used it in home.", "Date": "January 15, 2014"}, {"Title": "Good value for the money", "Author": "P", "ReviewID": "RMWQDFQV90B7H", "Overall": "4.0", "Content": "Good low-cost camera for listening and watching from afar, but the low resolution and night sensitivity betray it's $100 price.I have even installed some of these outdoors under eaves (make sure they never get wet, though) and the only problem with that sofar has been the occasional spider setting up shop in front of the lens.You can find much better IP cameras, but most dont include audio (which was a necessity).There is even a free gadget/sidebar for Windows 7/Vista (CoconutView) that lets you see a thumbnail of this camera on your desktop.Software is underwhelming; there needs to be an easy way to record without having to buy a 3rd-party app.", "Date": "December 12, 2013"}, {"Title": "Fit for home surveillance purpose with no hassles or gimmicks.", "Author": "Ahmad Hussain Ashkanani", "ReviewID": "R15GE62AELS1ZH", "Overall": "3.0", "Content": "It has great value, but it would be even better if it were smaller. Would buy again if i don't need a PTZ.", "Date": "March 2, 2013"}, {"Title": "Power over Ethernet doesn't run over 98 ft", "Author": "Jason Miller \"Jason Miller, Weekend Oasis Vac...", "ReviewID": "R2Z1GGXORXRMT9", "Overall": "5.0", "Content": "After the other model I've used for years wasn't available, I purchased this one. I use these cameras to monitor vacation homes for weather and driveway access. This is the 4th one that I've deployed. I link them all to a central website I created for security monitoring.  This one was power over ethernet. After running a CAT5 cable from my office upstairs, down 2 floors, under the floor, and backup to the front window to monitor the porch, I terminated, hooked up, and no power. Upon further investigation I discovered the adapter supplied cannot run over 98 feet. So, if you plan to hook into an office, power with the adapter, and run to a camera 98 feet away, it won't work (it even states it in the manual). I ended up putting the adapter at the other end, right next to the camera. Luckily I had a power outlet.All and all, I am pleased.One note to everyone, if you want to make your life easier search for the cams via mac address on initial install.If you have more than one on the network and want to access via the web, you must assign a unique port to each camera (ip address:port).", "Date": "June 3, 2012"}, {"Title": "Bought 2 and Very Happy", "Author": "Gepetto", "ReviewID": "R10PL1FQXONKKZ", "Overall": "5.0", "Content": "I bought 2 of the \"big brother\" cameras to this Panasonic camera.  I had 2 BL-C111A cameras at our lake home for monitoring over the internet.  Unfortunately we had a nearby lightening strike and both cameras got zapped.  They had served us for 7 years!!!  So I ordered these \"refurbished\" units at less than half the price of an identical BL-C111A replacement camera.  This camera has the exact specs of the higher priced unit but lack the ability to pan the lens.  Zoom is still offered.  Bottom line is that the units I received were NOT refurbished.  They were new and I swear the image quality is better than the old 111As.  Highly recommended.", "Date": "March 11, 2012"}, {"Title": "Panasonic BL-C101A network camera", "Author": "Jeffrey J. Wentz", "ReviewID": "R1TQ1S3E3GGP1K", "Overall": "5.0", "Content": "Great product for the price, works as stated & arrived in a timely manner. I would recommend this to any one who has a computer and has a network set up or knows how to set up a network.", "Date": "February 8, 2012"}, {"Title": "Died less than a year after purchase", "Author": "C. Bailey \"cbailey139\"", "ReviewID": "R1N9S3EF5Y10L4", "Overall": "1.0", "Content": "I liked this well enough when I bought it, but now it has stopped responding and a factory reset has not fixed it. I have one other Panasonic BL-C101A, and three other cameras from the same product line, and they are all still working - as this one was - so I'm sure I didn't just miss something. It just died.I have now spent more time than the product is worth to verify it's really the camera itself that died, and hunting around through the product docs and on Panasonic's web site for warranty information (which I can't find). So I don't know if this is still under warranty. It is not worth working on further, but it is worth dinging them in an unfavorable review. I might add, the docs and other product support means ought to make finding warranty information easier. It may be in there somewhere, but I give up.", "Date": "December 18, 2011"}, {"Title": "good product", "Author": "meep \"meep\"", "ReviewID": "RXICL225M5VDO", "Overall": "5.0", "Content": "easy to set up if you have some understanding of IP addressing. pointed browser at the .253 address on the home network, set up the user account.I really like that the power supply injects power over the ethernet cable, so there is only one wire to run.Resolution is fine for a general security cam. It is a reasonably solid unit with thick metal bracket.Low light sensitivity is ok for what it is.... As it approaches dusk outdoors, inside spaces without lighting become too dark to be useful.Running mine with a synology NAS (surveillance station) and the integration was straight forward.Would love to see an IR model for nighttime use.", "Date": "August 13, 2010"}, {"Title": "Camera almost works as advertised... but not quite", "Author": "L. Mo", "ReviewID": "R3CR9NN8ZJIBNN", "Overall": "3.0", "Content": "I was hoping this camera would function as a motion detection camera that would record clips & upload them to my FTP- unfortunately it cannot do this. (FTPing of MPEG4 clips)This camera was purchased to replace the BL-C1A (also a good product).  My only gripe with this product is that it cannot FTP the MPEG images to a server of your choice.  It WILL store the images on the camera for viewing; however the camera does not have that much memory, and unless you enable overwriting the stored image, you will maybe get 20-30 seconds total mpeg4.I don't understand why it cannot FTP the image out- its already storing the clip locally.  Conversations with Panasonic support have verified this, and they also add that NO PANASONIC cameras- even their professional products- allow FTPing of the MPEG4 clips.If you plan to use this camera as remote-viewing, it works perfectly.  This camera works as advertised in all regards except for the aforementioned one.", "Date": "June 24, 2010"}], "ProductInfo": {"Price": "$129.95", "Features": "Simultaneous MPEG-4 and JPEG\n3 Lux Color Night View Mode\nUp to 30 Frames per Second2 CMOS\nBuilt in Web Server/IP Address (IPv4/v6)\nPlug and Play Installation", "Name": "Panasonic BL-C101A Fixed MPEG-4 Network Camera (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/4174EWMqH6L._SY300_.jpg", "ProductID": "B001BBS7ZW"}}