{"Reviews": [{"Title": "Brother printer cartridges", "Author": "Beboh", "ReviewID": "R30B81HWLSL6BH", "Overall": "5.0", "Content": "These are original (not generic) catridges for Brother printers.We have ordered these several times before. They print well, no mess, are easy to remove and install.The ink is very long-lasting, just don't change the cartridge when the printer says it's low. Wait until the printer tells you the cartridge is EMPTY.", "Date": "June 16, 2010"}, {"Title": "Brother!!", "Author": "wogan", "ReviewID": "R3HAPNE3FH3W70", "Overall": "5.0", "Content": "These ink cartridges work brilliantly, their slim designs are easy to handle and install into the printer. They should be part of the consideration of what printer you choose since if you are printing something with a lot of yellow for example, you do not have to replace a whole cartridge that includes 2 other colours. The price is right too, since this is cheaper than even using my professional discount card at my local office store and these are genuine Brother cartridges, not refills either.The only irritation I do have with the printer is that it will tell you the ink is low-replace...I can print quite a few pages before it says will not print anynmore, the cartridge is empty. If I am in the middle of printing job, as soon as I replace the cartridge, it picks up where it stops. So, I always have refills sitting there ready to go when my printer stops rather than just low.", "Date": "November 12, 2009"}, {"Title": "Sophia-Global sells generic Brother cartridges", "Author": "joco", "ReviewID": "R2YQWAHX4X6KY1", "Overall": "4.0", "Content": "It would be helpful if reviews stated which shipper sent the product.  Usually, Amazon links all reviews of the same product together, regardless of the shipper, so it is confusing when one person says the product is genuine, yet another states it is a generic rip-off.I bought what was stated as a \"genuine Brother product\" for LC613PKS cartridge, shipped by Sophia Global.  The cartridge was not recognized by the printer, and it was re-installed several different ways.  I needed to print right away, so when I purchased and installed a genuine Brother cartridge from a local store, it worked just fine, so the problem was with the cartridge that I received from Sophia Global.When I notified the shipper, Sophia Global, of the problem, they revealed that their cartridges are generic, NOT genuine Brother products.The genuine Brother cartridges are very good products.  The ones that Sophia Global sends are highly deceiving because the word \"Brother\" is printed on the cartridge.  However, be forewarned that Sophia Global does not sell genuine Brother products, regardless of what the Amazon description claims.", "Date": "March 5, 2012"}, {"Title": "Stick with the branded inks, and you won't go wrong", "Author": "Ophelia Mourns", "ReviewID": "R3CNEJVVM3RSR4", "Overall": "5.0", "Content": "Many people swear by \"compatible\" ink cartridges, by my experience over 20 years is that I'd rather spend a few more dollars for the piece of mind that a Brand cartridge gives you, without the worries of the cartridge not quite fitting right or gunking/gumming up the machine. Amazon's price for the 3-piece color pack is comparable to other retailers, with the added benefit of no shipping charges, taxes, and fast delivery. And, of course, Amazon's good reputation. Inks are vibrant and have a healthy \"life,\" even with moderately heavy to heavy printing.", "Date": "February 3, 2011"}, {"Title": "Questionable product", "Author": "Ar \"Avid Reader\"", "ReviewID": "R2KZJDZQZ1R2U", "Overall": "1.0", "Content": "No orginal box. No expiration date. Came in plastic bag. No way to tell when ink expires or if cartridges have been refilled.", "Date": "May 18, 2012"}, {"Title": "Original product, great price", "Author": "M. Rodriguez", "ReviewID": "RJFV0NA0DLOSM", "Overall": "5.0", "Content": "I have purchased Brother cartridges several times before and never had a problem. These are 100% original, and compared to other name brand ink, so cheap and long lasting. Will definitely buy again.", "Date": "November 1, 2010"}, {"Title": "Totally inadequate quantity", "Author": "Ed Rowan", "ReviewID": "R1XWP1X3XT1DGO", "Overall": "1.0", "Content": "The available pages that these cartridges print is about 1/3 of what is stated by the manufacturer. The machine cleans the cartridges every time I printed so I got about 1/4 of the use for my money. In addition, the indicator says the cartridge is out when it still has at least 2/5 ink visible.  IN addition, although Amazon sells this as a manufacturer cartridge, Amazon does not (I repeat) DOES NOT stand behind the product.", "Date": "January 23, 2012"}, {"Title": "Not to the usual high standard of Brother", "Author": "wauwis \"wauwis\"", "ReviewID": "R3EWE4RY1UWIWU", "Overall": "1.0", "Content": "After a few weeks, the yellow all leaked out.  Amazon had a replacement in my mailbox the next day. The next time I will try a set of generics.  No need to pay the high brand name price.", "Date": "November 30, 2011"}, {"Title": "A quality product from Brother", "Author": "Brady Turner", "ReviewID": "R2F79UNE4XKY5P", "Overall": "4.0", "Content": "Excellent print quality from these LC 61 Brother ink cartridges. Prints approx 350 pages. Constant cleaning of the print heads will shorten the ink supply. Overall, I will still continue to use original Brother ink for my printer.", "Date": "January 27, 2011"}, {"Title": "Brother Ink Cartridges", "Author": "Ed J", "ReviewID": "R8CJR6LQD49K8", "Overall": "5.0", "Content": "This is the item I was looking for and reasonably priced.I like the free shipping.", "Date": "July 15, 2010"}, {"Title": "Poor quality junk", "Author": "S. Johnson \"Rockhamster\"", "ReviewID": "R1Z6HQJK0OCG7A", "Overall": "1.0", "Content": "I received these cartridges and have installed the magenta and yellow cartridges. Both of them are showing low ink and I haven't even printed with them yet. I will never order from this company again.", "Date": "April 18, 2012"}, {"Title": "Very satisfied", "Author": "Lewis Buttery", "ReviewID": "R30H733Z4DGBPO", "Overall": "5.0", "Content": "I have ordered this ink pack many times and every time it arrives as promised very quicklyLew", "Date": "September 28, 2010"}, {"Title": "Printer ink", "Author": "cp", "ReviewID": "REQMHALIWKQGP", "Overall": "5.0", "Content": "great quality, just as stated in ad. Fast shipping. Will purchase from this seller again.  Thank you", "Date": "September 22, 2010"}, {"Title": "don't buy these from Speedy Inks", "Author": "Gene M.", "ReviewID": "R1XXR178T950WL", "Overall": "1.0", "Content": "Received OEM Brother LC61 black/cyan/yellow/magenta from SpeedyInks.  For some reason, they take the cartridges out of the Brother box, and ship them individually wrapped.  The problem is, the Brother expiration date is printed on the box, not the individual cartridges.  I have only small-medium printing needs, these cartridges should have lasted months.  Instead, due to cartridge clogging, and the need for multiple automatic cartridge cleaning procedures, which uses a lot of ink, I have used-up all four cartridges in under 3 weeks!  Apparently the cartridges are very old and dried out.  Remember the adage:  you get what you pay for.  Recommend buying from Office Depot or Staples, and just go ahead and pay more!", "Date": "March 7, 2014"}, {"Title": "Ink cannot be detected by printer after several reinstallation of this item", "Author": "Amaz YL", "ReviewID": "R2YDGCYCM7U7U0", "Overall": "1.0", "Content": "The item was bought in Aug. When I use the ink this weekend. My printer told me the ink cannot be detected. Very bad quality. I bought two sets of the item. I will reutur them to Amazon.", "Date": "January 13, 2014"}, {"Title": "Inferior Replacement Cartridges", "Author": "JR", "ReviewID": "R2TSYLXUPOD347", "Overall": "1.0", "Content": "Very dissapointed in this product.  The printer does not recognize some of the cartridges, therefore, it will not print.  There was a very short return window so I am just stuck with defective products.", "Date": "June 8, 2012"}, {"Title": "Is a plastic bag really packaging?", "Author": "Skier Bruce", "ReviewID": "RSVE56IZECFLH", "Overall": "3.0", "Content": "The cartridges shipped in a plastic bag.  No sign of the Brother box!  Which means there is no guarantee of authenticity nor do you know how fresh the cartridges are since the expiration date is on the missing box.", "Date": "January 17, 2012"}, {"Title": "Printed not more than 20 pages", "Author": "A2L", "ReviewID": "R1JJ6PDFJ9230S", "Overall": "1.0", "Content": "I had ordered a blank and color ink cartridge pack for my brother printer. I could hardly print 20 pages and the printer started displaying a message that it is running low on ink. The earlier ones printed more than 150 pages for sure.... I'm not sure what's wrong with the ones purchases recently. Not a happy camper!!", "Date": "January 3, 2012"}, {"Title": "no problem", "Author": "kathyh", "ReviewID": "R3BVHPXSKXO9SG", "Overall": "5.0", "Content": "These are easy to load, am not sure about the amount of ink they hold, but thats the printer I bought!  So far, no problem.", "Date": "September 26, 2010"}, {"Title": "excellent", "Author": "Dolores Riordan \"short hair\"", "ReviewID": "R32RH0V1SEC8T6", "Overall": "5.0", "Content": "product was fine......it came w/o delay and I have nothing bad to say only good", "Date": "August 16, 2010"}, {"Title": "Real deal", "Author": "Amazonwoman73 \"It's YOUR life...YOU run it!!\"", "ReviewID": "R309B0Q4UV431Y", "Overall": "5.0", "Content": "Opened the box & received the Genuine Brother inks just as I ordered.  At this price, it's wise to stock up now.  I'm a happy customer.  Thanks Amazon!!!", "Date": "June 12, 2010"}, {"Title": "Buy The No Name Replacements Instead", "Author": "Randy L. Witham \"C-17A\"", "ReviewID": "R2XYMSUITR6MDP", "Overall": "5.0", "Content": "Work great, BUT I later saved me big $$$ over Brother named replacements by buying no name replacements here on Amazon.  Was afraid at first, but all my cheapo replacements have worked flawlessly, and print same-same. Save your money. Randy", "Date": "June 9, 2010"}, {"Title": "Love this item it is just as promised", "Author": "P. Butruch \"Cat lover\"", "ReviewID": "R1QZWKSAEPCVDQ", "Overall": "5.0", "Content": "I bought this ink and I got exactly what was described NO BAIT AND SWITCH I will definitely order again.  The boxes may be broken but the product itself it in perfect condition.  All I can say is thank you for saving me money.", "Date": "May 5, 2010"}, {"Title": "Brother Quality Continues", "Author": "A. Terhune", "ReviewID": "R1AIHAZ50SBZ1H", "Overall": "5.0", "Content": "The quality of printed photos requires optimum ink performance. I would not trust generic brands or refilled cartridges.", "Date": "April 21, 2010"}, {"Title": "GREAT DEAL", "Author": "A. Love", "ReviewID": "R2QYOZU1FSM0GB", "Overall": "5.0", "Content": "PRODUCT IS AS GREAT AS ADVERTISED. RECEIVED ITEMS ORDERED IN LESS TIME THAN PROMISED. ARRIVED IN SOLID PACKAGING. WOULD PURCHASE THIS PRODUCT AGAIN. HAVE USED IT AND THE QUALITY COULD NOT BE BETTER.", "Date": "March 22, 2010"}, {"Title": "brother ink cartridge", "Author": "C. May Evans", "ReviewID": "RLTVMMA1UBCTQ", "Overall": "5.0", "Content": "This product is well worth the money shipping was very fast.  This product also had a very good price, the stores are alot higher.", "Date": "January 30, 2010"}, {"Title": "Great value", "Author": "Phyregiver \"Phyregiver\"", "ReviewID": "R1HZ3B6Z9KJ9ET", "Overall": "5.0", "Content": "I've never had inkjet cartridges that lasted as long as they do, plus the price point is great.  Ink quality is also excellent.", "Date": "January 20, 2010"}, {"Title": "Expired cartridges?", "Author": "cg", "ReviewID": "RYM1U9509TT07", "Overall": "1.0", "Content": "Cartridges received without Brother box, just in individual plastic wrappers. The wrappers say \"Use the ink cartridge within the expiration date printed on the box\". Without the box, there is no way to tell if the cartridges are expired.", "Date": "February 28, 2012"}, {"Title": "Ink doesnt last long", "Author": "Balajikumar", "ReviewID": "R1OJ3FFQ71BLN5", "Overall": "1.0", "Content": "Ink quality is good..but it doesnt last long..i wud have hardly taken 8-10 pages(only text) print out..The ink is over...very disappointed.............", "Date": "November 2, 2010"}, {"Title": "2 of them were not recognized by printer.  Not genuine?.", "Author": "RIS", "ReviewID": "R3511F942KOG9J", "Overall": "1.0", "Content": "Yellow and blue were not recognized by printer and red last very short time.  Those came in shrink wrap and they look like Brother product but I don't believe they are genuine.  They did not come with original box.  Even though I bought them from Amazon about a year ago, I kept them in my desk drawer unopened so they should not be dried out.  I thought the problem was my printer so I bought very cheep ink cartridge to try and that worked fine.  Now I am positive that the cartridge on this page are defective.", "Date": "May 6, 2014"}, {"Title": "Everything comes out in pink", "Author": "Lucy S. \"book\"", "ReviewID": "R1USZ9HDAPCVUT", "Overall": "1.0", "Content": "Cartridges does not work as advertised, they probably old. When color pages are printed with all new cartridges - everything comes out in pink colors, even original blue and green turns out pink.", "Date": "April 26, 2014"}, {"Title": "Careful with the seller on these!!", "Author": "Derek Parent", "ReviewID": "R2XI2HIAK078Z2", "Overall": "1.0", "Content": "Ordered these cartridges and they looked nice when arrived but the quality is lacking.  Replaced the Cyan and Magenta and they work for awhile, enough to justify the price.  Just replaced the Yellow (didn't need to replace it right away like the others) and that maybe printed 4-6 pages before it has registered as empty.  Empty???  Contacted the seller and they will not replace since it is \"outside the return window\".  How is someone supposed to know there's a problem until you have to replace the cartridge?  Tired of companies not standing behind their products and hiding behind a lame excuse like a \"return window\".  Would I really waste my time contacting the seller, asking for a replacement and writing this review for a $5 product if I didn't actually have a problem with it?  Recommend you only order if your going to use right away so you know if get DOA cartridge and can return inside their \"window\".", "Date": "April 6, 2014"}, {"Title": "because my printer was printing fine before and now the level of printing is very", "Author": "Annette Wingate", "ReviewID": "R3215S1EIGNH5V", "Overall": "1.0", "Content": "is it possible that some of it is dried up? because my printer was printing fine before and now the level of printing is very bad", "Date": "March 27, 2014"}, {"Title": "dried up and didn't work", "Author": "Jonathan D. Kelly", "ReviewID": "R1TQ1GNMOL9VXI", "Overall": "1.0", "Content": "they were dried up and stopped working after a month.  printer wouldn't function and reported that he ink was out.  I bought new in from BB and haven't had an issues for 3 months.", "Date": "January 25, 2014"}, {"Title": "Use", "Author": "Woman", "ReviewID": "R2L7PVWPQYPEPS", "Overall": "1.0", "Content": "As with the black ink that I bought from you, the colors are not working.  I have printed only 6-7 items and the printer is telling me I am out of ink.  I am greatly disappointed!", "Date": "January 11, 2014"}, {"Title": "very low capacity", "Author": "N6AC \"n6ac\"", "ReviewID": "R2K2LLCFF5JRMG", "Overall": "1.0", "Content": "These cartridges have extremely low capacity - I ordered a full set of color plus black ($38), put the new set in, printed a few color pages, had poor results, ran the print test in the MFC-J630W, and had some gaps, repeated, then two of the colors disappeared entirely. Tried online chat help, got dropped. So spent an hour on the phone with Brother support, who led me through a special head-cleaning sequence. This EMPTIED the brand new cyan cartridge so that I couldn't even print a new test page. Brother says I have to buy more ink and repeat this deep clean! Holidays are not a nice time to be out looking for ink cartridges. I really feel ripped off.**** Update - 6 months later, I am quite happy with a generic substitute from Amazon: I'm using \"HI-VISION HI-YIELDS Compatible Ink Cartridge Replacement for Brother LC61\". This is 3 cartridges of each of 4 colors (and each visibly full of ink unlike the 'genuine'), and yet costs less than 1/4 the price of a set of 4 'originals'.Don't believe Brother when they say the generic will destroy your machine - the machine eats ink in frequent \"cleanings\", and the stock cartridges are a money-printing machine for them. They should be ashamed.", "Date": "December 26, 2013"}, {"Title": "DEFECTIVE CARTRIDGES- YEILD-ZERO  NO COLOR WHAT SO EVER!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Author": "A. Simeone \"sausy_italian\"", "ReviewID": "R6B4A4DX0QPIM", "Overall": "1.0", "Content": "These cartridges are empty or dry.  Purchased this Aug and kept in cool/dry/dark place, so they should of been fine.  WHAT A RIP OFF!!!!  And now when I tried to use them, I find I have no recourse with this defective product.  DO NOT PURCHASE THESE, UNLESS YOU NEED SOME EMPTY CARTRIDGES!", "Date": "December 10, 2013"}, {"Title": "Magenta Toner was Spilled Everywhere", "Author": "AK VORTEC", "ReviewID": "RJCC6QPDZJG3L", "Overall": "2.0", "Content": "Got the three pack, blue and yellow were fine, but the magenta cartridge apparently exploded and went everywhere. I am now somewhat skeptical of buying toner online, especially possible non-OEM toner.", "Date": "October 23, 2013"}, {"Title": "Not goodproduct -- not Amazon fault", "Author": "Margaret C.", "ReviewID": "R3O43PBJNEHSH3", "Overall": "3.0", "Content": "These cartridges seem to run out quickly, had to make an emergency expensive trip to Staples so iI could use my printer, not a\"happy \" camper", "Date": "October 21, 2013"}, {"Title": "Change, change, change...", "Author": "JimKaye", "ReviewID": "R1BEZEPL4NQ0RR", "Overall": "4.0", "Content": "Brother isn't the only company making small ink refills that tell the printer they are empty when they are 1/4 full yet; others do the same thing.  As a consumer, I'm sick and tired of companies bilking us.  They charge more for products that they claim are superior, with more technology put into them, but they are pretty much the same as half the price printers when it comes to the looks of the prints.  Sure, they claim to be able to print at 1,200 dpi, but I wonder if that's what's going on.  The quality just doesn't match up to the claims. The human eye cannot tell the difference very much between 600  and 1200, but from the rest of the claims, 'long lasting ink cartridges' they are full of beans. With the single warning system I have, telling me when each one goes low, I'm changing, changing changing ... it seems like every time I use it.  I only have a couple prints a week, for finished work samples going to clients, yet I'm buying new 4-paks of C-M-Y-K once a month.  They are more expensive than my HP brand, which held almost 3 times as much ink, and with that printer, I only purchases a 4-pak once a year almost, about once every 8 - 10 months.  My costs have tripled for ink refills. It's not the economy raising the cost of living, it's companies finding ways to make you buy more often, with add-ons on top of it all.", "Date": "January 14, 2013"}, {"Title": "OK - seems like they aren't too stale.", "Author": "Tommy \"Tommy LE\"", "ReviewID": "RC21293M9AFX", "Overall": "4.0", "Content": "The supplier taught me that the problem with these cartridges is that Brother doesn't necessarily see and use all of the ink.  You have to take them out and shake them.. This particular batch is the first time I've experienced this in the two years I've owned the printer.  Can't say what's really the culprit, only that the shaking works.  Hopefully your cartridge won't have any reside splashing around when you do it - be careful. Luckily, mine was yellow when I exerienced that.", "Date": "December 11, 2012"}, {"Title": "These work well", "Author": "SC", "ReviewID": "R2AICHBD0O8JPI", "Overall": "5.0", "Content": "I have ordered this package a few times and they work well.  I have not had any issues.  i ordered some compatible cartridges previously and they ruined my printer.  Will never do that again.", "Date": "December 7, 2012"}, {"Title": "Poor Quality, Good Price", "Author": "Newton", "ReviewID": "RK1TEU5OJNX9F", "Overall": "2.0", "Content": "Ordered these because of price. Product is labeled the same as what I had been using but it is not the same. Every cartridge I have used has not worked properly.  One or two have not worked at all. I guess I got what I paid for.", "Date": "September 24, 2012"}, {"Title": "Yellow Color Ink Empty", "Author": "hanouny", "ReviewID": "R2WTSRT880HQJA", "Overall": "1.0", "Content": "I bought two sets. The yellow cartridge cartirdge in both sets were empty, I had to shake hard to get the printer print my work. The other colors have no problem.", "Date": "June 22, 2012"}, {"Title": "BROTHER INK", "Author": "BLITO", "ReviewID": "RSUD3HI63VYJ1", "Overall": "1.0", "Content": "I HAD A VERY BAD EXPERIENCE WITH THIS PRODUCT...SOME CARTRIDGES CAME WITH EITHER NO INK OR CLOGGED. I LIKE BROTHER PRODUCTS..BUT THESE CARTRIDGES ARE EITHER TOO OLD OR JUST FAULTY...", "Date": "June 4, 2012"}, {"Title": "printer doesn't work now", "Author": "Joy", "ReviewID": "R3SCFMG212RO68", "Overall": "1.0", "Content": "purchased item on 4/4. when I placed them into my printer it didn't work. very disappointing.  So, I contacted customer service @ 4inkjets 1-888-321-2552 and he said to contact and return item to amazon for a refund. He said they (4inkjets) couldn't do anything for me.So disappointed.side note ** other reviewers said the brother ink is in-fact brother ink.. but its STARTER packs vs the regular packs. so if you can get it to print, it will only print like 500 pages vs 1500... something to think about when you order an item from this company. (thus the cheap rates I suppose)", "Date": "April 9, 2012"}, {"Title": "Brother OEM LC61 ink", "Author": "Theodore", "ReviewID": "R2GLKBWEUP0N2J", "Overall": "5.0", "Content": "Ordered aftermarket \"re-filled\" ink cartridge and they damaged my printer. Yes, they were cheap and they usually give you plenty of them for a great price but I got burned. My printer got damaged and had to spend $100 to buy a new printer. This time I didn't make the same mistake. I ordered the OEM ink that came in two days and after I installed it the printer worked perfect just like it should. NO more those cost cutting nonsense cartridges. Go OEM, keep your prints and printer in perfect condition without the drama and ....save money by not running to the store to buy a new printer.", "Date": "February 20, 2012"}, {"Title": "OEM Printer Cartridges", "Author": "JUST-JIM", "ReviewID": "R1QZEPJO1HNK8A", "Overall": "5.0", "Content": "I stopped using generic ink when I destroyed my Original Brother AIO printerthat was less than 1 year old. This is my second ink order from Amazon. Thecartridges are original from Brother. Amazons (not the marketplace vendors)price is at least $10.00 less than my local B&M; stores and arrive in 2 dayswith no shipping charge (prime membership).", "Date": "November 20, 2011"}, {"Title": "Brother LC613 PKS 3 piece color pack", "Author": "Toppergem", "ReviewID": "R2A083C6SHFTTG", "Overall": "5.0", "Content": "I always come to Amazon.com for all of my computer and printer related purchases.  It is convient and the quality of the merchandise is excellent.", "Date": "August 31, 2011"}, {"Title": "Just what I wanted", "Author": "Donna Mireles", "ReviewID": "R32B6ABXSRV4UG", "Overall": "5.0", "Content": "Just what I wanted and just in time.  I ordered this for Mom's printer while on a visit to her.  Lucky for us, it arrived before the end of my week-long visit and I was able to install it for her.", "Date": "August 30, 2011"}, {"Title": "Great Value beats everyone", "Author": "Dano", "ReviewID": "R6KTGY5O5DB3G", "Overall": "3.0", "Content": "Great purchase price. As far as the product leaves little to be desired, but thats is fault of the printer doing too many cleaning cycles when printer is inactive. Drinks ink , more than I drink soft drinks.", "Date": "August 13, 2011"}, {"Title": "Great Price", "Author": "HuffmanFamilyof4", "ReviewID": "R2M8D1RSVNYSJ2", "Overall": "5.0", "Content": "I'm always looking for ways to save money and printer ink is no different,great price for all 3 colors exept black", "Date": "July 24, 2011"}, {"Title": "Original ink", "Author": "Dajenel", "ReviewID": "R2W506ZQLJIE2U", "Overall": "4.0", "Content": "I bought these 3 cartridges together and they arrived on time, their price is perfect. They are original Brother and do not show any inscription that say \"starter\"; however, I will see how long they last.", "Date": "May 7, 2011"}, {"Title": "These are genuine Brother cartridges", "Author": "Dave_W", "ReviewID": "R15ALNPO8M1PL3", "Overall": "5.0", "Content": "This is a good price for this item, since these are genuine Brother cartridges. They still cost way more than \"compatible\" cartridges, but I've just never had much luck with those. As always, Amazon shipped right away and they arrived in 3 days.", "Date": "April 27, 2011"}, {"Title": "I like my Brother!", "Author": "David A. Derolph", "ReviewID": "R25Q3E8BX4J4F2", "Overall": "5.0", "Content": "My Brother printer ink, I mean. :) This was my first purchase of printer ink through Amazon.com and I'll be a repeat customer. I compared prices to local retailers and found a bit of a price advantage by buying online, plus the convenience of ordering from home and not having to drive to a local store. As other reviews have said, these are Brother brand cartridges, not generic after-market products. I opted for the regular shipping but it was still a fast delivery; I received the shipment just a few days after placing the order.", "Date": "April 7, 2011"}, {"Title": "great product and timely", "Author": "petersburgwave", "ReviewID": "R1COQY74FQJ837", "Overall": "5.0", "Content": "they shipped way faster than expected and i am very satisfied with this product.  i go through ink so fast that it was wonderful to have more on hand almost immediately, especially when i live very remotely in alaska.", "Date": "March 22, 2011"}, {"Title": "Review", "Author": "Chrissy", "ReviewID": "R35BYGXZSGJODZ", "Overall": "5.0", "Content": "This cartridges that I ordered are as they described them to be. Loved the products for the price. I will buy from again. Thank You!", "Date": "January 9, 2011"}, {"Title": "Great product", "Author": "Angella Allen", "ReviewID": "R27RMMMW5ZNGBA", "Overall": "5.0", "Content": "This product was sent to me immediately upon my order, it was a very fast turnaround. I've had no issues with this product.  It works great in my \"brother\" printer.", "Date": "December 25, 2010"}, {"Title": "very happy!!!", "Author": "Treila", "ReviewID": "R1WJGNPMHFXH4C", "Overall": "5.0", "Content": "i was very pleased with the price. I was more happy no shipping fees. I will buy in bulk and in advance from this supplier. Best deal ever.", "Date": "December 22, 2010"}, {"Title": "Brother Color Ink", "Author": "Donna in KS", "ReviewID": "R257WF563RMSSV", "Overall": "5.0", "Content": "No problems.  Came in quickly, and the ink seems to be ok so far.Thanks for the good service.", "Date": "November 2, 2010"}, {"Title": "for my home multi-printer", "Author": "Celery", "ReviewID": "R2S8LFD0LEQRAO", "Overall": "5.0", "Content": "The product worked as specified in my brother printer. They arrived in quickly and in perfect condition from Amazon.I took my used cartridges to my local Staples for recycling and for $2 staples rewards per cartridge.#updateAfter ordering these a few times, i ended up buying generic cartridges at a lower price.  I wasn't printing anything important so a lower quality ink wasn't a problem.", "Date": "March 20, 2010"}, {"Title": "Brother Color Inks and Tuners", "Author": "Daniel Salemzadeh \"Danny\"", "ReviewID": "RWCHYKT4J1MFK", "Overall": "5.0", "Content": "the quality, fast shipping, and condition was as describedthe price was good as well", "Date": "October 21, 2009"}, {"Title": "Dissapointed", "Author": "Peter Smith", "ReviewID": "RQ55NNS0AG9LC", "Overall": "1.0", "Content": "The Magenta cartridge never worked - the printer (a brother MFC-J270w) just didn't recognize it. The yellow cartridge lasted no more than a dozen or so pages or light use before it ran out.", "Date": "August 3, 2012"}, {"Title": "not what I expected", "Author": "tamila", "ReviewID": "R22NV9B2AI6IJO", "Overall": "1.0", "Content": "I received this item about a month ago I already use all of them not worth the money or your time I DO NOT RECOMMEND VERY DECEIVING ADVERTISMENT. it ask for a rate does not rate waste time and money cartridges are only good for 5 copies each  you spend cheap you get cheap. I just change the last of the cartridges and not one drop of ink that is just a rip off. yes not a satisfied customer. just very sad, unfortunately it is just a bad item do not waste your money.", "Date": "August 26, 2011"}, {"Title": "Printers  edge", "Author": "Amazon Customer \"big red\"", "ReviewID": "RGZJ4KKDXHD0K", "Overall": "4.0", "Content": "I will only use Brothers inks . I found out the hard way that cheap ink are inexpensive but they can damage your printer, CHEAP INK RUINED MY LAST PRINTER!", "Date": "April 11, 2011"}, {"Title": "Great ink!", "Author": "Szymon Sikora", "ReviewID": "R2PH8DTYO9S98R", "Overall": "4.0", "Content": "This is my 1st time ordering ink from amazon along with the Black cartridge. I really like the price of these cartridges! I paid just a little more than what one cartridge would cost you. If your wondering why this review sounds a little unorganized, thats because I only wrote 2 other reviews other than this one. Comment on what you think I should improve in my reviews. Let me just finish this review by saying, the shipping was fairly cheap and fast and the ink is actually OEM not the cheap china knock off you get in bulk (30 cartridges for $15. Well, thats all!", "Date": "February 20, 2011"}, {"Title": "right on time", "Author": "FRANKIE  D.", "ReviewID": "R23X0LS46HDDAX", "Overall": "5.0", "Content": "need i say more ? this is something everybody need's if they have a printer.yes i need'd it !thank you", "Date": "May 28, 2014"}, {"Title": "love it", "Author": "bret frelow", "ReviewID": "R1WJF9E67N2SYC", "Overall": "5.0", "Content": "if this item is available when i need to replace them i will buy them again and again if possible", "Date": "May 28, 2014"}, {"Title": "3 pack in cartridge", "Author": "CAT Rach", "ReviewID": "R2EEA0FDLCYE64", "Overall": "5.0", "Content": "This is the best of Brother ink to be used in the Brother printer.  It was also a very good price sold by Amazon.", "Date": "May 27, 2014"}, {"Title": "cheap ink?", "Author": "kansas boy", "ReviewID": "RRJEJSYF3EGGB", "Overall": "5.0", "Content": "ain't no such creature. I've tried various discount inks with varying degrees of results, but the ease of using the Brother cartridges is a major selling point in itself. And even the discount inks rarely sell less than the price offered by this jobber. And did I mention the mess and damage some of the discounts did to my Brother printer? Discounts are not worth the reduced price, quality by itself is a an important category.", "Date": "May 19, 2014"}, {"Title": "Good quality", "Author": "Colin", "ReviewID": "R2V7443388H548", "Overall": "5.0", "Content": "I have had good luck with Brother OEM ink (not refills). However, my printer is now old and acting up. Time for a change.", "Date": "May 10, 2014"}, {"Title": "Arrived well packaged; have only used one color so ...", "Author": "Al Neuman", "ReviewID": "R3IYB35I4T52QH", "Overall": "4.0", "Content": "Arrived well packaged; have only used one color so far with no problems and really don't expect problems with the others. Worked well.", "Date": "May 3, 2014"}, {"Title": "Brother LC61CL 3 Pack Ink", "Author": "J.C.", "ReviewID": "R2SBFJGQ1YLXAD", "Overall": "5.0", "Content": "Brother recommends their products and I agree with them. Easy to load and lasts the length of time they promise.Thank you Brother", "Date": "April 16, 2014"}, {"Title": "OEM Package of Color Ink Carts for Brother LC61 series", "Author": "Ronald Meersand", "ReviewID": "RP41GAEVMC85E", "Overall": "4.0", "Content": "These are the exact replacement carts i have used for almost 3 years with this printer now. They should work fine, i have these set away in storage for use as needed in the future.", "Date": "April 14, 2014"}, {"Title": "Very satisfied!", "Author": "Persnickity", "ReviewID": "R3B5M5LOGTMSIF", "Overall": "5.0", "Content": "I've ordered from other places and ended up with cartridges that just would not print.  Not the case here!  I've had no issues at all and their shipping was really very fast!  Will order again.", "Date": "April 11, 2014"}, {"Title": "The ink works great", "Author": "Regenia Frazier", "ReviewID": "R2ESY9K3KOXHO6", "Overall": "5.0", "Content": "I am very pleased with the quality of this ink and will purchase it again and again when I need ink for my printer. Thanks", "Date": "April 5, 2014"}, {"Title": "EXCELENT SERVICE", "Author": "marvpapa", "ReviewID": "R2DOSE1BQ3BSFH", "Overall": "5.0", "Content": "IT WAS MORE THAN I EXPECTED. THOUGHT IT WOULD BE ALL YELLOW. WAS DELIGHTED I  HAD 3 ASSORTED COLORS.  WHICH IS WHAT I WANTED. MARVIN  IN MALIBU", "Date": "April 4, 2014"}, {"Title": "Better than no-brand cartridges.", "Author": "Magnate", "ReviewID": "R1KNBFPNXSFVDV", "Overall": "4.0", "Content": "I used to buy the no-brand cartridges, but they leaked, streaked, or just didn't work.  I switched back to Brother and they work great.  I just prefer the high-yield cartridges over these.", "Date": "April 3, 2014"}, {"Title": "brother ink", "Author": "sally orr", "ReviewID": "R129G69FL3GKZK", "Overall": "5.0", "Content": "I didn't know if these would be the real thing after reading some stuff.But they are and work well for us", "Date": "March 22, 2014"}, {"Title": "same as purchased  in stores except cheaper.  I would recommend this to anyone with a  Brother printer.", "Author": "Barbara Crady", "ReviewID": "R1GRJOW0FJNGOE", "Overall": "5.0", "Content": "This is the exact same product as I purchased at the office supply store only lots cheaper!!!  I would recommend anyone to purchase this product", "Date": "March 16, 2014"}, {"Title": "good product", "Author": "Paul", "ReviewID": "R1F9A8KLPYMX1B", "Overall": "4.0", "Content": "seemed to be full yield. I didn't have any leaks like some other users had.  they seemed to work as described", "Date": "February 28, 2014"}, {"Title": "didn't work", "Author": "p johnson", "ReviewID": "R2VEBSVTV3RRJ6", "Overall": "4.0", "Content": "I had to order colors again, because when I ran out of yellow the other day, I put in  a new one which didn't work.  I just received today a package of 3 new colors and when I put the yellow in, it was okay.  Now I have blue ad magenta extra.  It's okay, just glad I wasn't my printer.", "Date": "February 24, 2014"}, {"Title": "Good quality", "Author": "Sean Bryan", "ReviewID": "R2A8CXDJKLJQJ7", "Overall": "5.0", "Content": "Longer lasting, fine a pristine quality ink. And I use my printer daily. Brother makes so good quality printers full stop", "Date": "February 5, 2014"}, {"Title": "Not recommend.", "Author": "Hyeran Sim", "ReviewID": "REO24P871VDSN", "Overall": "2.0", "Content": "I choose this product, because of brand name.But print out is not clear enough.I am not recommend this item.", "Date": "February 1, 2014"}, {"Title": "always works", "Author": "art halbur", "ReviewID": "R18AY8EB8A7NAC", "Overall": "5.0", "Content": "never had a problem with original Brother ink. not sure if yield is 500 pages or not because daily automatic cleaning uses  some.?", "Date": "February 1, 2014"}, {"Title": "Great Product", "Author": "Starlinda", "ReviewID": "R1XR5GLUB82ZUT", "Overall": "5.0", "Content": "They work well  and print with my printer. I will definitely invest in alot more of these for my printer. Thanks!", "Date": "January 31, 2014"}, {"Title": "Brother 3 pak", "Author": "Cheryl R. Mortensen \"grandmacherbear\"", "ReviewID": "R3EOE6EIRWYTR8", "Overall": "5.0", "Content": "Does great and awesome deals through Amazon.We got this for the BRAND 3 pak. Thank you for these great deals.", "Date": "January 30, 2014"}, {"Title": "It works", "Author": "Arie Tal \"Victor\"", "ReviewID": "R2XVRJ2SM93CGU", "Overall": "5.0", "Content": "same as I wrote about the black ink from brother. It works as expected without any nasty surprises. costs more than the replacement but no need to replace the printer due to bad ink or spills...", "Date": "January 29, 2014"}, {"Title": "Brother is the Way to Go,", "Author": "Brother Randahl", "ReviewID": "R3QA2L506R14V7", "Overall": "4.0", "Content": "I have Brother Printers. Very Efficient, Very Reliable, Great Tech Service. Ink lasts. Very Good Product. Not as expensive as other inks, I have found.", "Date": "January 25, 2014"}, {"Title": "Great price, fast shipping and good quality for Brother printer color cartridges", "Author": "RSSSWIS", "ReviewID": "R1YTV4VDS7B76E", "Overall": "5.0", "Content": "I needed the color cartridges for my Brother printer ASAP. This seller came through with a real fast shipment. The seller upgraded my shipping to Priority as part of the price. The cartridges were still in the original packaging and fit my printer perfectly. They  are original replacement cartridges for my machine. I will definitely consider buying from this seller again.", "Date": "January 25, 2014"}, {"Title": "Authentic Brother Ink", "Author": "Ginnie", "ReviewID": "R1G4CQJT8GEBQ4", "Overall": "5.0", "Content": "I chose this rating because this is my second order with this product; and the cartridges are genuine Brother replacement ink cartridges.The cartridges are a perfect fit for my MFC 490 model; and the ink lasts for a long time. The colors are vibrant and have never blended or bleeded together.Amazon delivery was efficient and fast as usual.I would recommend this product to anyone that needs LC61CL cartridges due to the price and value.", "Date": "January 25, 2014"}, {"Title": "Brother LC61 3-Pack Ink Cartridge", "Author": "Kathleen S.", "ReviewID": "R328QVSBPI8YSK", "Overall": "5.0", "Content": "This is a great product at a good price. The cartridges were full and the ink quality was very good.  I was satisfied with the purchase, overall, and will certainly order these ink cartridges again.", "Date": "January 23, 2014"}, {"Title": "Worked perfectly", "Author": "Rocklyn Hamilton", "ReviewID": "R1TGW3XGEU3HNO", "Overall": "5.0", "Content": "I have installed these cartridges already, and they show up filled to the top.  That's important to me, because I have had some that did not.  I would guy from this person or company again.", "Date": "January 22, 2014"}, {"Title": "Pretty printing", "Author": "Andrew G. Davis \"Andy Davis\"", "ReviewID": "R3RTR3PQWCPXXA", "Overall": "5.0", "Content": "I do a lot and graphics also.  I tend toward the largfe size as the smaller ones make me antsey. See my remarks on the largfe black.", "Date": "January 20, 2014"}, {"Title": "Get What You Pay For", "Author": "Patrick B", "ReviewID": "R15UGP1K9BUOFN", "Overall": "5.0", "Content": "I tried a couple of 'cheaper' cartridges from other suppliers for my Brother printer; the first result was completely garbage, and on the second try the cartridges weren't completely full of ink. So, I decided to bite the bullet and get genuine Brother cartridges. These appear to be the correct cartridges. They fit perfectly and have performed well for the past few weeks. Sometimes it's just simply nice to get what you pay for . . .", "Date": "January 14, 2014"}, {"Title": "Haven't used yet so I will comment on expedious efficeincy of delivery", "Author": "Book Addict \"Book Addict\"", "ReviewID": "R70WL3R8UXHSD", "Overall": "5.0", "Content": "I love Amazon locker!  I ordered my ink and it was delivered on time and without delay.  One of the packages wasn't vacuumed sealed but it was sealed.  I've had no problems in the past and don't expect any, now.  Otherwise, I wouldn't have given 5 stars!", "Date": "January 13, 2014"}, {"Title": "Love It!", "Author": "Katrell N Perry", "ReviewID": "R24ZBKZW34RW8Y", "Overall": "5.0", "Content": "I love it when I can find ink cheaper than what the stores sell it for!  Amazon always has what I need for a great price!", "Date": "January 13, 2014"}, {"Title": "Great product great price..", "Author": "Mark", "ReviewID": "RQ5U7L6KADWTC", "Overall": "5.0", "Content": "I have been using these inks for a while and I have not had any problems.I highly recommend them.", "Date": "January 9, 2014"}, {"Title": "Hard to tell what's genuine and what isn't", "Author": "Bruin Fan", "ReviewID": "RUY7WJB9BOX33", "Overall": "2.0", "Content": "Bought these from Amazon, but it said the seller was Speedy Inks. It was billed as \"genuine\" Brother, but the cartridges came in plastic bags, not the original boxes. When I sent an e-mail about this to Speedy, the response was that I needed to contact Amazon because it came from them. I let it go and put a couple of the cartridges in. The magenta went pretty fast, with no warning. That was the last straw for me -- the Brother machine guzzled ink and cleaned itself almost every time I turned it on. The cartridges got nowhere near the number of pages they advertise. I chucked the machine and got an HP Envy 4500. So far, so good. No self-cleaning, sharper printing. (And no, I don't work for HP.) I won't be buying any more ink from Amazon (or Speedy Inks), if I can't trust if something is \"genuine\" or not.", "Date": "January 8, 2014"}, {"Title": "Brother? Ink cartridges", "Author": "Carl", "ReviewID": "R1GQWDLA4RXBXU", "Overall": "2.0", "Content": "Contrary to the description provided these cartridges do NOT fit into a Brother MFC J410W printer, and therefore the box that is provided containing information about whether or not these cartridges will fit into your printer SHOULD BE CHANGED!", "Date": "December 31, 2013"}, {"Title": "Fast service and great price!", "Author": "Kittentail", "ReviewID": "R2CRVPACHXVFNG", "Overall": "5.0", "Content": "This is a quality product for my Brother printer.  Others clog up the jets so I have determined to only purchase their ink.", "Date": "December 29, 2013"}, {"Title": "Affordable Quality", "Author": "Ron Tacan", "ReviewID": "R3MWCEIWYPR0AQ", "Overall": "5.0", "Content": "Paid a lot less ordering online rather than buying the full pack at our local store.  Great investment and does the job perfectly!", "Date": "December 27, 2013"}, {"Title": "good vaue", "Author": "geebee", "ReviewID": "RTZH5WKOFCFI1", "Overall": "5.0", "Content": "cartridges are too expensive generally.  i found these, and they were more reasonable than others.  as well, they are not knock-offs, but genuiine brother brand.  a good value and hey have not dried up..", "Date": "December 27, 2013"}, {"Title": "exactly as expected", "Author": "Ayesha", "ReviewID": "R1E35I34ES76Z6", "Overall": "5.0", "Content": "These are real Brother cartridges and not some knock off. Great color, lasts a long time, and a great value.", "Date": "December 24, 2013"}, {"Title": "Better then the cheap versions", "Author": "Ryan", "ReviewID": "R3FHALOA8776TM", "Overall": "5.0", "Content": "these are oem quality and work better then the cheap ones I've gotten on ebay, they last longer and give a better print quality", "Date": "December 21, 2013"}, {"Title": "The yellow ink leaks", "Author": "Theresa Kuzianik", "ReviewID": "R1CKR3WALAMW2D", "Overall": "2.0", "Content": "I had to go to Office Max  to buy another yellow ink cartridge so my Brother all in one would print again.", "Date": "December 20, 2013"}, {"Title": "Brother LC61 3-Pack Ink Cartridges", "Author": "J. Merker \"pin whiz\"", "ReviewID": "R8RSK9DGJ7LG8", "Overall": "4.0", "Content": "Although somewhat expensive, these cartridges work very well with my Brother printer. Other non-OEM products do not provide the same kind of quality print output that I get with these.", "Date": "December 17, 2013"}, {"Title": "yellow cartridge didn't work, kind of a bummer", "Author": "whitney h schrader", "ReviewID": "R1FTFG8O1NRQRD", "Overall": "2.0", "Content": "I don't know if it was my printer or the cartridges but the yellow ink cartridge did not register in the printer so I'm still without full color printing capabilities. kind of a let down.", "Date": "December 9, 2013"}, {"Title": "Go Genuine ink, prolong your printer's life", "Author": "reza47", "ReviewID": "R10F5FFQ41RWK3", "Overall": "5.0", "Content": "For printers \"Genuine\" ink is a must. This is 4th replacement and unit is working flawlessly.Easy clean hassel free replacement", "Date": "December 6, 2013"}, {"Title": "Good printer", "Author": "D. LUCREZI", "ReviewID": "R28KOGI59L62YQ", "Overall": "5.0", "Content": "These ink cartridges work great in my brother LC61 all in one printer, I have owned the printer for several years and have been very happy with it.", "Date": "December 3, 2013"}, {"Title": "This Inksa, Stinksa!", "Author": "Rex K Pruitt", "ReviewID": "R3K5L5NO65EGS4", "Overall": "1.0", "Content": "2 of these went bad before they were empty.  I had to replace with my \"Knock-Off\" brand from Orink that I ordered from Amazon for a fraction of the cost.  Not buying this again... :-(", "Date": "December 3, 2013"}, {"Title": "This is the genuine article & a great product!", "Author": "khughes", "ReviewID": "R2U6K96G8J7MKX", "Overall": "5.0", "Content": "This is the genuine article. These cartridges arrived in the original manufacturer's packaging and work beautifully. Wish they provided the black cartridges as well.", "Date": "November 25, 2013"}, {"Title": "Where is the yellow ink???", "Author": "Book Lover", "ReviewID": "R12ZFRRNK044CR", "Overall": "1.0", "Content": "This supposed authentic Brother ink arrived with an EMPTY yellow cartridge.  The other two colors are pale.  I have my doubts they are authentic.  While Amazon has a very generous return policy it really is worthless for ink cartridges.  Just money down the drain.  I learned my lesson, will buy only from a reputable STORE where it comes in a real Brother box and I can return it if it happens to be one with NO ink.  What a scam.", "Date": "November 21, 2013"}, {"Title": "Garbage", "Author": "Tom from Hoboken", "ReviewID": "R377B1OREYSGG3", "Overall": "1.0", "Content": "I ordered the color set and the black set.  Black and Yellow did not work.  All 4 were not sealed properly, and the ink was dry on 2 of 4.  No point trying to return something so cheap, no idea if they would have been responsive or not.  I can't be bothered with my time wasted.", "Date": "November 9, 2013"}, {"Title": "Brother LC61CL Ink cartridge", "Author": "JT TRAN", "ReviewID": "R2POYQDKJLSXBW", "Overall": "1.0", "Content": "printer can not recognize the cartridge, keep saying insert the cartridge even there was one in there. Cheap product from China", "Date": "November 5, 2013"}, {"Title": "Pleasantly stunned by terrific customer service", "Author": "NYCPatsfan", "ReviewID": "R3DG1I855KRLMS", "Overall": "5.0", "Content": "Let me point out right away that this five-star review is for the excellent customer service, and not the product itself.I had to write this review because I was taken aback (in a very pleasant manner) about what they did once I reached out to them to discuss about the inks that I purchased thru them.None worked when I tried them a few weeks back but then, I had purchased them more than a year back and so there was always a chance that the inks had dried. Nonetheless, I emailed them to inquire why the cartridge's were not working and exchanged some emails with the customer service rep who initially thought maybe my Brother printer (purchased more than four years ago) could be at fault.  However, when I found that some generic cartridges seemed to be working - albeit, poor and shoddy quality - the customer service immediately refunded my entire purchase WITH the shipping costs.Needless to say, I was stunned because(a) this pertained to a purchase made more than a year ago,(b) there was always a chance that the inks could have dried after more than year of non-usage (I use my printer sparingly),(c) I never asked for the refund and my emails with them were purely to figure out what could have gone wrong so that I don't make the mistake again,(d) they could have just given me a credit - thereby forcing me to buy it again only thru them - or offer a new three pack to try, and(d) there was no need for them to refund the shipping costs and making me whole on the entire purchase.I am so impressed by their service that I intend to purchase the inks thru them again once this crappy generic ones are done.Great job guys!!PS: They neither requested nor encouraged me to write about this btw.  In this sneaky age of influencing the customer reviews, I am happy that old-fashioned terrific customer service exists in the online world.", "Date": "October 28, 2013"}, {"Title": "Color ink", "Author": "Diana K. Stagg", "ReviewID": "R3S6UC80S92IHD", "Overall": "3.0", "Content": "It took a while for the machine to acceot the ink, i wasted a lot cleaning the machine.Next time I will make sure it is Isabella ink", "Date": "October 27, 2013"}, {"Title": "A good price", "Author": "Julie", "ReviewID": "RQUTYN60UMK5B", "Overall": "5.0", "Content": "The price for this 3 pack is much cheaper than I can buy at my local store when buying authentic Brother ink cartridges.", "Date": "October 24, 2013"}, {"Title": "Excellent quality", "Author": "va2dc", "ReviewID": "RV46GFHKVV6BW", "Overall": "5.0", "Content": "Yes, these are pricey and do not last very long, but the quality is great and they are certainly a better bet than those cheap and potentially dangerous for your printer knock off cartridges.", "Date": "October 12, 2013"}, {"Title": "Leaking Yellow Ink", "Author": "Brian C", "ReviewID": "R3OFWS6NAIVHWB", "Overall": "3.0", "Content": "Have purchased from this provider in the past.  This was our back up so we would always have suppies on hand.  When the time came to use it, the yellow cartridge had lost its seal and was leaking inside of the vaccum pack.  Can't tell if the product was poor quality or if this was just a manufacturing mishap.  Bummed that we can't print until another order arrives.", "Date": "October 10, 2013"}, {"Title": "great price great ink", "Author": "G.Ruggiero \"juniors\"", "ReviewID": "R2FWBYEEEWKFOR", "Overall": "5.0", "Content": "great price great printer ink. The ink you come to love my brother I name you can trust for more then 30 years", "Date": "October 8, 2013"}, {"Title": "Almost scrapped a $300 printer because of this low quality ink", "Author": "Amazon Customer \"bjkrebel\"", "ReviewID": "R2Y6EHJAOLQIX5", "Overall": "1.0", "Content": "The ink did not come in the retail package as shown on the picture, and did not show an expiration date.  After using it for a short time, I had the yellow print head clog.  Cleaning fixed it.  Then the blue head clogged, and cleaning had no impact.  I limped along without any blue ink for a while, and then the pink head clogged and could not be cleared.  I had never had these problems before, and almost bought a new printer.  Then I saw reviews that it could be the ink.  I bought a new package at a retail store, with a valid expiration date, cleaned the heads, and all is working perfectly again.", "Date": "September 20, 2013"}, {"Title": "This product was as descibed OEM.", "Author": "jeffrey", "ReviewID": "RPWETOH5FZ7VD", "Overall": "4.0", "Content": "This was exactly how it was described.  Original from manufacturer.  It 's the only way for me, thanks, till next time.", "Date": "September 18, 2013"}, {"Title": "brother replacement ink", "Author": "jasrock", "ReviewID": "R1XID54GA1975U", "Overall": "3.0", "Content": "Hard to judge really printer had not been used in a while and ink ran out after running a few cleaning cycles. Sosince I really did not get to print It was not overall favorable", "Date": "September 15, 2013"}, {"Title": "arrived on time", "Author": "ma barker", "ReviewID": "RGJL1V6A0J3X7", "Overall": "5.0", "Content": "Use these all the time. Dependable and constituently good. When I find a good thing I stick with it.Excellent.", "Date": "September 14, 2013"}, {"Title": "Printer Ink", "Author": "nan", "ReviewID": "R1WT22SQIQGZJK", "Overall": "4.0", "Content": "I've bought this before so was not surprise .  It is as advertised. Printers ink doesn't turn me on but one must have it.", "Date": "September 12, 2013"}, {"Title": "Trick for those who only need to print in Black", "Author": "AaronSr", "ReviewID": "R1Y8TW6F25CVBE", "Overall": "2.0", "Content": "\"Thankfully, as suggested in someone's comment on amazon.com, there is a solution that doesn't involve getting a different printer or unnecessarily buying more ink. After placing a piece of electrical tape over a \"window\" on each colour cartridge, we were able to \"trick\" the printer into thinking the cartridges were full.\"", "Date": "September 9, 2013"}, {"Title": "wanted to love it", "Author": "czstar", "ReviewID": "R3JCJPS6NQDB8U", "Overall": "1.0", "Content": "Unfortunately, the quality of this ink is not the same as the manufacturer. I wasn't looking for high quality prints so I tried this. I noticed that the cartridges leaked when changing them which the original cartridges didn't do. After a few months the ink leaked all over the inside of my printer and the printer stopped working.", "Date": "September 9, 2013"}, {"Title": "Expensive but never a problem", "Author": "Christopher A. Morgner", "ReviewID": "R2ULBCXT2S540E", "Overall": "5.0", "Content": "I tend to buy the less expensive non OEM inks but was having a little trouble with my printer so went to the Brother ink. All is well now.", "Date": "September 9, 2013"}, {"Title": "Not Working!!!", "Author": "Ana S.", "ReviewID": "RNLTS7JR6WGJ6", "Overall": "1.0", "Content": "I ordered this package in 2013 and tried to use it within a months or so with no luck - test print didn't show all colors as suppose to. After each \"cleaning\" mode it was getting better and better, but still not as it suppose to look. After 6 \"cleaning\" modes Maganta cartridge was empty!!! The one I just replaced!!! I printed the total of 1 page (8,5x11) and I was out of Magenta!!! After 2 more cleaning runs I was out of Yellow!!! The same thing happened with the Black (not a part of this package).I thought someone was wrong with my printer, so I just gave up and didn't try to use it until today. Of course it was not working, so I went to the store to look for another printer, but decided to buy a new package at the store in person and check my printer one more time.... and it worked!!!!!!I wish I didn't blame my printer in the first place and contact the seller.If you are receiving your cartridges without original box - request replacement! The exp. date is only on the box and not on the package, so you might be getting old cartridges with expired and dried ink. This is what I think happened to me.", "Date": "August 29, 2013"}, {"Title": "WORTH THE MONEY", "Author": "Cristy D. McCoy", "ReviewID": "R3N7EJQ8O1FZKZ", "Overall": "4.0", "Content": "NO NEED IN SPENDING A LOT OF MONEY FOR INK....LASTS JUST AS LONG & COPIES ARE JUST AS CRISP & BRIGHT", "Date": "August 28, 2013"}, {"Title": "Great", "Author": "Bridges2012", "ReviewID": "R1O5WGT3UCDTV2", "Overall": "5.0", "Content": "These are genuine Brother ink cartridges, and they work perfectly.  (There really isn't anything else to say about this item, but I have to fill up space!  Ha!!)", "Date": "August 22, 2013"}, {"Title": "BROTHER LC61 INK CARTRIDGES", "Author": "maria", "ReviewID": "R2AXXXPJ12H1DH", "Overall": "1.0", "Content": "VERY DISSATISFIED WITH THE COLORS.  I ENJOY MAKING GREETING CARDS,AND THESE COLORS ARE TERRIBLE. GREENS COME BLUE  PINKS ARE AWFUL  AND FORGET ABOUT GETTING A RED COLOR  THAT IS WISHFUL THINKING..WHEN I MAKE THE CARDS WHAT I SEE ON MY COMPUTER IS NO WHERE NEAR THE COLORS THAT COME OUT. I RATE THESE A  ZERO..  SORRY BUT THEY ARE POOR COLORS.", "Date": "August 15, 2013"}, {"Title": "Genuine product at right price.", "Author": "EdBud", "ReviewID": "R2VN1TE8FHIW8S", "Overall": "5.0", "Content": "Bought this and some generic cartridges to have extra on hand . Figured at least one set of genuine product would be a good idea if the other stuff didn't want to work.", "Date": "August 15, 2013"}, {"Title": "I can't really tell you f these are factory fresh or not. The black mate to these gave me fits!!", "Author": "GunHawk", "ReviewID": "R35DYUZPVHV6AU", "Overall": "3.0", "Content": "I can't really tell you f these are factory fresh or not. The black mate to these gave me fits!! Who REALLY knows if you're getting a refirb or not!!?? I needed to get in on the ground floor of copier ink! I'd be swimming in $$$, not ink....", "Date": "August 7, 2013"}, {"Title": "Genuine Brother OEM ink", "Author": "Dave", "ReviewID": "R1CFZ2MBCFFU5A", "Overall": "5.0", "Content": "I read a lot of reviews where the buyers were dissatisfied with their purchase. I called Amazon and told them the ASIN #,  the young lady stated that the ink was sold by Brother. When making your selection, don't always click on the cheapest price.The key is to take the time to know who it is SOLD AND FULFILLED by!", "Date": "July 27, 2013"}, {"Title": "It's Ink", "Author": "Mike", "ReviewID": "RZ0LBKSNPNLI5", "Overall": "4.0", "Content": "The ink cartridges fit my printer perfectly. They last fairly long for home usage. Have bought this item several time from Amazon. Cheaper than buying at the store.", "Date": "July 16, 2013"}, {"Title": "Great ink", "Author": "Pamela Gabriel", "ReviewID": "R1HWF2JLJS60JP", "Overall": "5.0", "Content": "I have been using this ink in my printer for about four years now.  The quality is very good and they last a long time.  Please note that the color ink is not waterproof and will run.  The black ink is waterproof.", "Date": "July 13, 2013"}, {"Title": "works just fine in the Brother MFC-495CW", "Author": "dd25", "ReviewID": "R2JAJRXS897FUT", "Overall": "5.0", "Content": "This works just fine in the Brother MFC-495CW.  I don't replace the cartridge when it's LOW, I wait until it won't print unless I replace it.", "Date": "July 6, 2013"}, {"Title": "All the ink seems to deplete too soon.", "Author": "Dutto", "ReviewID": "R1L1AWOJAXUDC7", "Overall": "2.0", "Content": "I am VERY disappointed in this product. I bought the Brother MFC-795CW version 5.1 printer 4-20-2011. I replaced all the cartridges 9-17-2012. Although I rarely make color copies, I had to replace all the cartridges today, 7-2-2013.", "Date": "July 2, 2013"}, {"Title": "Better Price Than Office Supply Stores", "Author": "John \"RetiredTeacher\"", "ReviewID": "R3SVGXCGMX4VMA", "Overall": "4.0", "Content": "I was not able to find a better price at Office Supply or Discount Stores.  I was happy to see that the cartridges were genuine Brother mrechandise as advertised and not Knock-Offs.", "Date": "May 5, 2013"}, {"Title": "Color Ink Cartridge", "Author": "Maureen A. Powers", "ReviewID": "R15JMTXMWSPYYW", "Overall": "3.0", "Content": "See what I said about the black cartridge, it looks like the right ones, but until we use them we have no way of knowing if we Love them", "Date": "May 1, 2013"}, {"Title": "brother ink cartridges", "Author": "Jean Burk", "ReviewID": "R2F2PJDR6CS9CY", "Overall": "4.0", "Content": "they work in my printer, that is the main thing.  Have ordered ink cartridges before and still have them because they didn't work, although were supposed to be compatible with my printer", "Date": "April 18, 2013"}, {"Title": "Caution Advised", "Author": "R. Williams", "ReviewID": "R14RBDU672VKG2", "Overall": "2.0", "Content": "You often get what you pay for.  I ordered Feb 1st 2013 and received the product about 10 business days later. (2 weeks).  I didn't have an immediate need for the cartridges so they were placed, unopened, into proper storage.  A week ago I installed the three new cartridges into the brother printer. (A FINE PRODUCT BTW)  The Red and Yellow cartridges worked just fine, however the magenta one was FAIL.  It was DOA on arrival and I didn't know it until it was too late to return it or get a replacement.  Be advised that even if it is a fail or DOA once you open it and prep it to go into the printer, you cannot exchange or return it.  However you cannot know that the cartridge is trash until you do just that.  Catch 22.  How convent.My advise is that you do get what you pay for so CHECK these cartridges out as soon as you get them.  Otherwise you might end up with duds.", "Date": "April 12, 2013"}, {"Title": "These cartridges did not work", "Author": "KS", "ReviewID": "R3II8JES0UUGOF", "Overall": "1.0", "Content": "These cartridges did not work, they were not vacuum sealed as local store purchased ones are.  Wasted good money on these.", "Date": "April 9, 2013"}, {"Title": "Brother ink cartridges", "Author": "Frederick J. Albano", "ReviewID": "R10I4XBE1VKC6O", "Overall": "5.0", "Content": "was very happy with items, came well packaged if wanted items appear again I wouldn't hesitate to think about buying again", "Date": "April 7, 2013"}, {"Title": "Actual brother ink works as needed", "Author": "Jordi M. C.", "ReviewID": "R2VUXDNF3AHVY1", "Overall": "4.0", "Content": "Our brother printers seem to only work when we use real brother ink.  This product did the trick for us.", "Date": "April 7, 2013"}, {"Title": "Defective or generic ink.", "Author": "Richard Shum", "ReviewID": "R2ANV13TFOYQ6F", "Overall": "1.0", "Content": "Printer Model: MFC-J410W. Ink cartridges are terrible. Color ink does not mix well together and comes out looking nothing like what it should be (unclear, fuzzy, colors off-tone). Thought problem lied with the printer but realized it was the ink. Will never be buying from seller again. Bought these cartridges as a backup and used them past the \"Return Window\".  Deceiving advertising.", "Date": "April 5, 2013"}, {"Title": "Good", "Author": "Amazon Customer", "ReviewID": "R3F51WNF4JDRF9", "Overall": "5.0", "Content": "This product is as described and it worked in my printer just like new so I will definitely re order", "Date": "April 4, 2013"}, {"Title": "Good", "Author": "2011 Malibu \"tongsuen\"", "ReviewID": "REF3B30HX1RP1", "Overall": "4.0", "Content": "It's the original Brother, it better be good.But 4 stars instead of 5 because it's so expensive.That's how printer companies make money selling cheap printers!", "Date": "March 30, 2013"}, {"Title": "Great Product", "Author": "Brooke Eubanks", "ReviewID": "R2FKSO1Q4IG9UA", "Overall": "5.0", "Content": "Great experience ordering with this company and also a great product.  It was at my home 4-5 days after ordering, and the price is really hard to beat.", "Date": "March 30, 2013"}, {"Title": "Can't print without toner!", "Author": "blueyz", "ReviewID": "R29QU5A745G44W", "Overall": "4.0", "Content": "Happy that I could get real \"brother' toner for my machine - I don't really trust refurbished ones, they tend to leak. Thanks for helping me print my coupons at home.", "Date": "March 29, 2013"}, {"Title": "Wonder where they got these", "Author": "YVFAD", "ReviewID": "R2UY3KE6E2HK15", "Overall": "2.0", "Content": "My printer would not read (2) of these were new and installed properly. I had to run to staples and buy new ones!", "Date": "March 28, 2013"}, {"Title": "okay", "Author": "Guru \"noyoon\"", "ReviewID": "R1WR6URM195WJ4", "Overall": "3.0", "Content": "price is okay, it can be better priced. I received what was described on line. can't tell how long it will last...since I don't print as much...", "Date": "March 5, 2013"}, {"Title": "Great Bargain!", "Author": "Twain Two \"shaka king\"", "ReviewID": "R1UBUFBORDKO27", "Overall": "5.0", "Content": "Brother printers require Brother cartridges.  Do not use refurbished or remanufactured ones.  I learned my lesson.  If you have a Brother, then only use Brother products.", "Date": "March 4, 2013"}, {"Title": "brother ink", "Author": "Kristi", "ReviewID": "RXT8A434A1XS9", "Overall": "5.0", "Content": "Actually, I gave a five star rating because the ink came quickly, well packaged, and was what it said it was. However, I needed Brother 51 ink so, whether it was my fault or the shippers, I do not know. Anyway, I am getting the correct ink now.", "Date": "March 3, 2013"}, {"Title": "Great value.", "Author": "Trouble", "ReviewID": "R1102ZSNZAZCGE", "Overall": "5.0", "Content": "Prints well. Fits well. Works much better than the ff name replacement catridges and doesn't leak like the refilled ones.", "Date": "February 27, 2013"}, {"Title": "Total waste of money", "Author": "nayoung kim", "ReviewID": "R38Z8FNQDTDG2I", "Overall": "1.0", "Content": "It started clogging immediately. Couldn't keep alignment even with brand new cartridges - the manual says the quality of the ink/freshness effects print quality. And the ink levels read almost empty from the moment of installation.", "Date": "February 26, 2013"}, {"Title": "Brother Printer", "Author": "John J Dubinsky", "ReviewID": "R3842I2I84W7XF", "Overall": "5.0", "Content": "Like the printer.  Working well.  Easy to use. Price was right.  So, I am happy and would recommend the printer.", "Date": "February 25, 2013"}, {"Title": "I haven't used it yet", "Author": "Charles H. George", "ReviewID": "RM563S4DGYYXH", "Overall": "4.0", "Content": "since I havent used it yet, I can't comment on it's quality, but it arrive as advertised and on time.", "Date": "February 25, 2013"}, {"Title": "Brother LC613PKS color ink cartridge", "Author": "S. Knight", "ReviewID": "R1SL0HAXQ98E6O", "Overall": "5.0", "Content": "Love the color,met all my expectations and needs in both quality, price , ease of installing and the ordering process was quick.", "Date": "February 24, 2013"}, {"Title": "Great item", "Author": "Pam", "ReviewID": "R37FBS3B5MTSW5", "Overall": "5.0", "Content": "I'm always happy with this product  a great purchase if u need ink in a hurry and can't get to the store", "Date": "February 22, 2013"}, {"Title": "Can't beat the price", "Author": "n.j.", "ReviewID": "R3EF6Z0UUMJB9N", "Overall": "5.0", "Content": "This is the ink that my printer recommends. It was cheaper to order it, rather than going to Staples. I think I will order my ink from now on.", "Date": "February 17, 2013"}, {"Title": "Good Quality Ink", "Author": "Patricia Durant", "ReviewID": "R1M4FSYEV2QYSO", "Overall": "5.0", "Content": "So far so good.  I bought this ink because the price is very good compared to others, and the print colours are sharper.", "Date": "February 11, 2013"}, {"Title": "brother ink cartridges", "Author": "Elizabeth J. Seibert", "ReviewID": "R2RUTYI32URVQI", "Overall": "5.0", "Content": "Arrived in 2 days. Original packaging. Received 2 sets of colour cartridges for less than I would pay for1@ office max", "Date": "February 9, 2013"}, {"Title": "Great Product", "Author": "A Customer", "ReviewID": "R1EUZ627Z6AIZ2", "Overall": "5.0", "Content": "But then what should you expect from a name brand ink for your Brother Printer. I tried several \"compatable\" ink products nd,while they were truly compatable, they dried out far faster. I do not use my daily and the compatable color cartridges needed far more frequent head cleanings than the real Brother cartridges. The black compatables work without the frequent cleanings. The frequent cleaning requirement wasts a lot of ink so the use of \"compatable\" color cartridges proved to be only marginally cost effective. Too much trouble for too little gain so I am sticking with Brother color cartridges.", "Date": "February 9, 2013"}, {"Title": "Ran out too quickly", "Author": "N. Hanafi", "ReviewID": "R1JXQ3KNBW578E", "Overall": "1.0", "Content": "the yellow ink ran out very very quickly, it did not even last 20 pages. and the printer stopped working because of this. I wonder why it can not print Black and white only since the black ink is still full.", "Date": "February 4, 2013"}, {"Title": "After paying Staples prices I'm very happy", "Author": "jd \"jd\"", "ReviewID": "R19SLJHSBFHPJS", "Overall": "5.0", "Content": "I have only used one black cartridge so far.  I will soon be doing a large mailing regarding a walk for Ovarian Cancer awareness and will need all the colors.The black worked beautifully", "Date": "February 4, 2013"}, {"Title": "Cheap and Good", "Author": "George L. Ennis", "ReviewID": "R1ZOVLY1TFE62S", "Overall": "5.0", "Content": "I really like the fact of how inexpensive these cartridges are. And you can buy other brand cartridges even cheaper than the orginals (and the original Innobella are inexpensive compared to other brands)  Brother has hit the mark with their marketing strategy this time around.  The color of my photos are as good or better than Walmart or Walgreens quality.", "Date": "January 28, 2013"}, {"Title": "Good to have brand name", "Author": "TL in SB", "ReviewID": "R2ZQU9CVGBITQF", "Overall": "5.0", "Content": "These work perfectly and I'm confident to have the brand name product.  The price was really good and didn't involve a lot a un-necessary packaging.  Very happy with product.", "Date": "January 20, 2013"}, {"Title": "good for the price", "Author": "audrey rosenberg", "ReviewID": "REE2FFX44XWDW", "Overall": "4.0", "Content": "tried to cheap out on no name ink cartridges and almost ruined my printer.  use the brother brand if you have brother printer", "Date": "January 18, 2013"}, {"Title": "Great ink at an excellent price.", "Author": "Sherry Mackintosh \"SMacki\"", "ReviewID": "R39GJC20KMQ4OQ", "Overall": "5.0", "Content": "What a great price for ink!!!  The ink is good quality and lasts a long time with all the printing I do. Well worth it.", "Date": "January 11, 2013"}, {"Title": "ok", "Author": "Laurie Phelan", "ReviewID": "R2VL0IOTHEECN3", "Overall": "5.0", "Content": "These are the same cartridges that you get in the store for a cheaper price. The ink was just as good and lasted the same amount of time.", "Date": "January 10, 2013"}, {"Title": "Ink Cartridges", "Author": "EasyCruzin \"Mike\"", "ReviewID": "RIIF86D9L6DCU", "Overall": "5.0", "Content": "Great price. Quck shipment. Forget the retail store for printer ink. We all know that you can buy a printer for next to nothing. It's the ink that keeps Brother in biz. So why buy retail?", "Date": "January 7, 2013"}, {"Title": "Disappointed", "Author": "PhotoGirl", "ReviewID": "R33KYUC9A5Q8DY", "Overall": "2.0", "Content": "Yellow tank has not worked right since I got it.  Have to keep taking it out, then putting it back.  Not what I've experienced with previous orders.", "Date": "January 6, 2013"}, {"Title": "The original is best.", "Author": "C. Hill", "ReviewID": "RGOCR1MXHAL4Z", "Overall": "4.0", "Content": "These work best for Brother printers, I recommend the original cartridge's as opposed to the generic brands.  They just work better.", "Date": "January 4, 2013"}, {"Title": "great product", "Author": "sonja morton", "ReviewID": "R5XH2WJ30YM97", "Overall": "5.0", "Content": "i have ordered this item twice.....the first time i had to sent back one of the ink cartridge because of its failure to work.....amazon was very helpful in getting this product replaced at a very expeditiously time table.I will continue to order especially this product from amazon.", "Date": "January 4, 2013"}, {"Title": "Don't waste your $", "Author": "Nancy  Sawicki", "ReviewID": "R3SZEI5F30EBRD", "Overall": "1.0", "Content": "Printer didn't recognize 2 of the 3 color cartridges. Wound up having to go to a retail store and purchase the factory ones.", "Date": "January 1, 2013"}, {"Title": "Won't do it again", "Author": "Vac Searcher Jedi Knight", "ReviewID": "R1DCDMYGYUOTC1", "Overall": "1.0", "Content": "I've found there are a ton of things that are easier and more economical to buy on amazon. For the most part I've been exceptionally pleased with the service and products.  Unfortunately, these have been a terrible disappointment. Yes they work but the quality of the print is below sub par and it forces me to clean the print heads constantly.  What a mistake!", "Date": "December 31, 2012"}, {"Title": "Brother printer / color cartridge order issue Pioneer Marketing", "Author": "smb", "ReviewID": "R29SM33FEUP0FC", "Overall": "1.0", "Content": "I don't hate the product - my Brother MFC-490CW printer is fine.  But I ordered the 3 piece color cartridge pack supplied by Pioneer Marketing Products and and not one of the colors loaded properly.  It took several tries for the printer to accept the colors (2 of the 3).  The Yellow cartridge did not work on the install at all even after multiple attempts.  So in the middle of a big project I had to leave for the local office supply store and buy a yellow cartridge.  I should have known better than to buy this from an unknown source.", "Date": "December 30, 2012"}, {"Title": "Good cartridges; NOT starters", "Author": "Kaptax", "ReviewID": "R1QU3DP2IOJFY3", "Overall": "4.0", "Content": "I was a bit worried about the claims that these might be starter cartridges but I took the chance and ordered them.  As others have mentioned, these came in no box - just three individually sealed wrappings. Thinking I got duped, I contacted Brother.  I was told that they do not manufacture starter cartridges for the MFC495CW and that if the product is sealed in Brother packaging and the label has \"Innobella\" on the side, it is genuine OEM, full cartridge.  As for longevity, I have yet to see.", "Date": "December 11, 2012"}, {"Title": "Not Happy", "Author": "Elaine", "ReviewID": "R39D70TMPFSGBW", "Overall": "2.0", "Content": "Only color that prints is the the  Cyan.... Magent and yellow.....Dried out .....I would guess  Iwould like them replaced noe", "Date": "December 8, 2012"}, {"Title": "GOOD PRICE BUT NOT ENOUGH", "Author": "MAMA LO", "ReviewID": "R3VE7VW3UOMSFL", "Overall": "3.0", "Content": "THIS WAS AN AWSOME DEAL PRICE WISE, HOWEVER THE YIELD WAS VERY LOW.  If you print a lot, then this is not for you unless you just need a fix right now within a reasonable cost.  Otherwise I would suggest the ones that are comparable to the actual brother cartridges.", "Date": "December 8, 2012"}, {"Title": "Works Well", "Author": "Charles E. Paddock", "ReviewID": "RW2QOYC8975BU", "Overall": "5.0", "Content": "I have used several of these since buying my printer, and they work well,  Wish the printer held larger cartridges, though.", "Date": "December 7, 2012"}, {"Title": "Ink", "Author": "I", "ReviewID": "R2DIQAXF2TQ5LZ", "Overall": "5.0", "Content": "So far so good. I needed replacement for the starter cartridge and I didn't want to risk using the non-OEM ones because I read too many reviews saying it will completely kill the system.", "Date": "November 26, 2012"}, {"Title": "Great Cartridges", "Author": "Vicky", "ReviewID": "R2XZWL0KIEZXWL", "Overall": "5.0", "Content": "These are great cartridges.  This is my second time purchasing and the quality is great.  I will definitely purchase again!", "Date": "November 19, 2012"}, {"Title": "Bad print job", "Author": "HighlandgirlDeb", "ReviewID": "R11OYEGSMJSVE", "Overall": "2.0", "Content": "I'm not pleased with this product. When I print a job that includes text and color picture, the paper jams. I had to print the color picture first then print the text to prevent jamming. The cartridges came without their box, which shows the expiration date. I think I received an expired item.", "Date": "November 1, 2012"}, {"Title": "Defective Product with Short Warranty Period", "Author": "Echosabbe", "ReviewID": "RDV5DSKG3TFWP", "Overall": "1.0", "Content": "I echo the earlier review regarding defective cartridges and narrow warranty window. Brother is firm on warranty period; if you purchased it prior to 3 months before use, you are out of luck even if the product is not expired. So much for customer loyalty. It would be better for them to demonstrate a little more customer service for their defective products. If you buy their ink, do not purchase until you need it. Better yet, consider taking your $$ and going elsewhere.", "Date": "October 18, 2012"}, {"Title": "It's Real Brother Ink", "Author": "Ora Streeter", "ReviewID": "R1PRIIG27FRK3", "Overall": "5.0", "Content": "Shipped on time, the price was right, the packaging was sealed. Haven't used it yet.... but will update when I do... if need be!!!", "Date": "October 11, 2012"}, {"Title": "Brother MFC 6490CW ink cartridges", "Author": "Karen A", "ReviewID": "R3U1WA9STYYONC", "Overall": "5.0", "Content": "I ordered these cartridges on line through Amazon.com.  They were inexpensive, were delivered quickly, and work great.  I am very pleased with my purchase.", "Date": "September 4, 2012"}, {"Title": "Great service", "Author": "V. C. Symonette \"nypdasgt\"", "ReviewID": "R3C18S1GER3DLX", "Overall": "5.0", "Content": "Got everything very quickly.  The box was not great, but the product was.  Will buy again at this price and with this service.", "Date": "September 4, 2012"}, {"Title": "Good Ink for the Brother MFC -J410W", "Author": "oldmotem \"kevin\"", "ReviewID": "R2UCA9QIZ3F70M", "Overall": "5.0", "Content": "I have never used generic ink in this machine.  It's 1 1/2 years old.  It does go through some ink,  but in general doesn't use much more than any other printer.  And the ink loads easily and works.  Never had a problem with it.", "Date": "August 10, 2012"}, {"Title": "Works great!", "Author": "Flower w/ thorns", "ReviewID": "R32AW26DQAAA7K", "Overall": "5.0", "Content": "Exact replacement for my printer. Prints great. Easy to install. A lot cheaper to buy them here than from local office supply store or from other online stories.", "Date": "July 21, 2012"}, {"Title": "Brother Ink", "Author": "Linnie", "ReviewID": "R510IP0QR7N1D", "Overall": "5.0", "Content": "I have tried the cheaper compatible ink in my Brother LC61 printer and it is not what I need.  The Brother ink always works perfectly.", "Date": "June 13, 2012"}, {"Title": "Very good communication", "Author": "V. C. Symonette \"nypdasgt\"", "ReviewID": "R1IA3XQ6ERMT1C", "Overall": "5.0", "Content": "I had a slight issue with one of the cartridges, and they answered my question very quickly.  Finally they sent me a new one, and a return envelope for the defective one.  Great service.  Will buy again.", "Date": "June 3, 2012"}, {"Title": "LOVED THIS PRODUCT!", "Author": "Steph", "ReviewID": "R3APC5XEQ8HS1G", "Overall": "5.0", "Content": "This ink was great! It is the high quality ink I wanted and was priced very reasonably! You could spend $30 each on just one package of the three colors! With this I spent about $45 (about $14 a box plus included shipping) and got 9 individual cartridges (3 boxes)! I was a little scared when I read the reviews that this product wouldn't be the high quality ink I wanted, but as it turns out, it was! I would caution potential buyers from other inks that only cost about $1-10 (or really cheap) because sometimes those cartridges have been used and refilled with some cheap ink that has terrible color! I will never buy ink from any place else, either from a regular store or online. Amazon is the place to buy!!", "Date": "June 2, 2012"}, {"Title": "Works Like a Charm", "Author": "Natalie C Depman", "ReviewID": "R13BVE6A4PM8J9", "Overall": "5.0", "Content": "Works great with my Brother MFC-J265W Printer.  Shipped quickly and much better than running out to a Staples.  Sophia Global really cares about customer service.", "Date": "May 13, 2012"}, {"Title": "Nearly empty cartridge", "Author": "Mary", "ReviewID": "R2DSCPJZHT041T", "Overall": "2.0", "Content": "Although I purchased \"New\" cartridges,the Cyan ink cartridge was nearly empty when I first opened it and put it in my printer.  This is the first time I've ever been dissatisfied with anything I've ever purchased from Amazon.com", "Date": "April 5, 2012"}, {"Title": "Delivered on-time in an OEM package", "Author": "M. Friedman", "ReviewID": "RSQYXFYVDG8BY", "Overall": "4.0", "Content": "I have not used the ink yet....but.....it was fairly priced....delivered on-time and came in an original manufactures packaging.  So far so good.", "Date": "April 1, 2012"}, {"Title": "out of 3 worked", "Author": "Marietta Markley \"marietta\"", "ReviewID": "R2M9WODFHFH2KQ", "Overall": "2.0", "Content": "this was a very good price, but the yellow cartridge did not work.  I have had the other 2 in my printer for over a month now and they seem fine.", "Date": "March 22, 2012"}, {"Title": "liked the product", "Author": "CASAMAYOR", "ReviewID": "R2IUO3G0QKP5BO", "Overall": "5.0", "Content": "in comparison to the OEM products you buy at the stores this was the same at a much better price and conveniently delivered to my home.", "Date": "March 11, 2012"}, {"Title": "Good deal.", "Author": "D. Klaren \"DK\"", "ReviewID": "RMJ77TGXYSSIG", "Overall": "4.0", "Content": "Good deal when compared to other online stores.  Colors are vibrant and working fine.  Packaging was very protective of item.", "Date": "January 10, 2012"}, {"Title": "Brother ink cartride review", "Author": "Chuck R", "ReviewID": "R2Y49B2KHJHWR6", "Overall": "4.0", "Content": "For a good price I got the replacement ink cartridges that fit my printer and they work great. The quality is excellant and I had no problem installing them. Would have cost me much more at Staples where I have bought them in the past.", "Date": "December 9, 2011"}, {"Title": "MIKES REVIEW", "Author": "Michael Soda \"scrapper\"", "ReviewID": "RC143INQMYU1Y", "Overall": "3.0", "Content": "CARTRIDGES ARE THE ONLY ONES TO USE IN A BROTHER PRINTER, TRYED THE REFILLABLE CARTRIDGE AND HAD TO CLEAN THE PRINTER 3 TIMES BEFORE I HAD TO TOSS THE PRINTER AND CARTRIDGS OUT'INJOY YOUR PRINTER BUT KNOW YOUR GETTING SCREWED FOR THE INK AND IT DOES NOT LAST LONG'A QUICK NOTE , EVEN IF YOU ARE JUST PRINTING BLACK AND WHITE IF ONE OF TH COLORS RUNS OUT IT WILL NOT PRINT  MIKE", "Date": "November 23, 2011"}, {"Title": "Just what I ordered", "Author": "Linda L", "ReviewID": "R12UIOJ8OKUUBF", "Overall": "5.0", "Content": "I had a bad experience with a \"replacement\" cartridge that wasn't a Brother cartridge so now I'm VERY picky about getting OEM.  These cartridges were just that and they work just fine.", "Date": "November 16, 2011"}, {"Title": "Only use OEM cartidges", "Author": "Robert D. Finley \"Desert Hawk\"", "ReviewID": "RIV6J995NWRFW", "Overall": "5.0", "Content": "I will use only OEM Bother ink cartridges until the manufacturer and seller warranties are up.  Not risking any possible problems with \"computable\" brand cartridges which would void any warranty I have.  That is almost four years from now and the printer may be worn out and replaced by then.The Brother OEM ink cartidges are purchased from Amazon because of the overnight shipping available and the excellent service I have always had.  From books to a large LCD TV.  Nothing broken.  Nothing lost or misshandled.", "Date": "November 4, 2011"}, {"Title": "Amazon's Brother LC613PKS Color Ink Cartridge - 3 piece color Pack (Cyan/Magenta/Yellow)", "Author": "S. Bondi", "ReviewID": "R6UPJX4BXZF0J", "Overall": "5.0", "Content": "Being the OEM ink specifically for my printer it works exactly as it should. Amazon is the perfect supplier with their great pricing; prompt deliveries and quality customer service. In my years of experience I have found that the aftermarket ink cartridges, although much less expensive, end up costing you more in the long run.  I have had printer after printer die far earlier than they should have due to ink nozzle failures, but since I began using only OEM ink products the primary reason for printer replacement has been due to upgrading our operating system and having some of the all-in-one printer features not function with the new operating system.", "Date": "October 31, 2011"}, {"Title": "Not what ordered", "Author": "Deborah Walker", "ReviewID": "RUI15M2UG5MR5", "Overall": "2.0", "Content": "Black cartridges were sent rather than the color pack that had been ordered.  The vendor was good at responding quickly to the error and crediting us for the difference in price.  My daughter had already thrown out the packaging so we couldn't return the product.", "Date": "October 30, 2011"}, {"Title": "Brother Ink Cartridges - color", "Author": "Abby.NCIS", "ReviewID": "R2G9ZH90PG8TDG", "Overall": "5.0", "Content": "The order was sent from supplier immediately.  It arrived in fine order, quickly, and they were \"Brother\" cartridges and not some substitute.  Great service!", "Date": "October 30, 2011"}, {"Title": "Fits MFC490CW", "Author": "Still waiting", "ReviewID": "R2FPUHSWVWXWB7", "Overall": "4.0", "Content": "These are the right ink cartriges for Brother MFC 490 CW.Purchased wrong ones that the compatability tool said would fit and they didn't. These do. Still waiting for my refund on the others. $30 plus bux. Look in your manual to get the right ones.", "Date": "October 5, 2011"}, {"Title": "great buy", "Author": "kutefisk \"susie\"", "ReviewID": "R2HOYIOT5QKF4W", "Overall": "5.0", "Content": "These are very well priced and shippped quickly so happy to be able to have this source for cartridges happy to have found it", "Date": "September 24, 2011"}, {"Title": "Great product!", "Author": "Richard", "ReviewID": "R3PWMXELKZ6XLQ", "Overall": "5.0", "Content": "Great product!  Would buy from again!  The cartridges work just as good as if I went to Office Max or Staples to buy them!", "Date": "September 21, 2011"}, {"Title": "Brother LC613PKS Color Ink Cartridge - 3 piece color Pack", "Author": "Steve", "ReviewID": "R2TD725OD97IH4", "Overall": "5.0", "Content": "These are the only Ink Cartridges that work for my Brother MFC-295CN.I have spent over $100.00 on no name Ink Cartridges trying to find a cheaper way to print. Forget it, you will only get ripped off, the printer will not recognize No Name Ink Cartridges.These Ink Cartridges work flawless and print 4 times the pages that the printer came with.", "Date": "August 13, 2011"}, {"Title": "These cartridges are THE BOMB!", "Author": "John Mickel \"Wicked\"", "ReviewID": "R27YWBE6JAOKEA", "Overall": "5.0", "Content": "replacement printer cartridges for the Brother 990CW among other models. Basically anything that takes a LC61. So far I not had any problems from them. The price can not be beat! Great buy!", "Date": "June 16, 2011"}, {"Title": "3 piece Brother printer ink refill", "Author": "L. Bass", "ReviewID": "RIHLW648TOKBH", "Overall": "5.0", "Content": "I bought my printer shortly before we moved out of the US. I went to look for refills when I got to my new location and it was extremely hard to find them in stock. I found this product online and it solved my problem. Three refills in the store usually cost around $10 each. This is an unbelievably great deal and I do plan on purchasing this product again when I need my refills.", "Date": "November 15, 2010"}, {"Title": "Name brand is the best~Brother", "Author": "M. Riegle", "ReviewID": "R17SAQ1SV8B2YW", "Overall": "5.0", "Content": "I get only the Brother brand ink cartridges because I don't trust the remanufactured or generic ones. I don't want to chance ruining another printer. Already did with a refilled cartridge. I buy from Amazon because they are cheaper and I can just order and get them delivered. I order the double packs when possible and they are a good buy.", "Date": "May 30, 2009"}, {"Title": "Good seller, arrived as it said and quick.", "Author": "M&M; \"MyTrueComment\"", "ReviewID": "RCLJ5025ECL44", "Overall": "5.0", "Content": "The items arrived quick.  They are in the original bags.  I hve not test them yet.  They looks good as described.", "Date": "April 1, 2009"}, {"Title": "Excellent Value", "Author": "Phil T", "ReviewID": "R3LJE6AA6Q5NVO", "Overall": "5.0", "Content": "These are authentic Brother ink cartridges, not knock-offs.  High quality is assured; there's no worry about smudges or malfunctions.  And of course, the pricing is excellent.", "Date": "October 25, 2013"}, {"Title": "INK", "Author": "Debra", "ReviewID": "R1RIL621YQNBW", "Overall": "1.0", "Content": "Good product.  Good price but when I need ink.  I don't want to wait.  Usually I end up going to store for ink and pay a little bit more for the convenience.", "Date": "January 23, 2013"}, {"Title": "I just loved it.", "Author": "Wendy", "ReviewID": "R391VXCPUS254X", "Overall": "5.0", "Content": "This product is exactly what I needed for my Brother LC61 Series machine. These replacement cartridges worked really amazing. I give 5 stars.", "Date": "December 16, 2012"}, {"Title": "Brother ink", "Author": "Stephen Foster", "ReviewID": "R12Q73EUY5TLBL", "Overall": "5.0", "Content": "I like to use good ink in my printer. I would not try ink that was not designed for my printer. My brotherprinter is a very good printer and I would not want to damage it.", "Date": "December 15, 2012"}, {"Title": "Brother ink", "Author": "Anich", "ReviewID": "RODOROTO1D8LE", "Overall": "5.0", "Content": "The brother LC61 color ink work Ok with my machne, and I received early then the time they seid, I recomend this company.", "Date": "June 27, 2012"}, {"Title": "review on ink cartridge", "Author": "Amazon Customer", "ReviewID": "RYEG4Y2VB1JVB", "Overall": "2.0", "Content": "one of the colors [yellow] did not work at alli have used this product many times from other sources and never had a problem.  needless to say i am not happy with my purchase.noreen freiden", "Date": "February 23, 2012"}, {"Title": "Shipped super fast!  Real Brother products", "Author": "D. Ravnikar", "ReviewID": "R2JEXRXM55RP6E", "Overall": "5.0", "Content": "Print cartrides came in the mail in less than 2 days from across the country!  Vacuum sealed, official Brother print cartridges", "Date": "February 4, 2012"}, {"Title": "BROTHER INK", "Author": "BOB", "ReviewID": "R1P57E1CMYE0KU", "Overall": "5.0", "Content": "THIS IS THE REAL McCOY AND NOT SOMECOMPATABLE INK, AVERY GOOD BARGAIN.I AM WELL SATIFIED WITH THE PRICE AND SHIPPINGTME.", "Date": "January 29, 2012"}, {"Title": "Its ink, in pink, get used to it", "Author": "C. Henderson \"oneisEnuf\"", "ReviewID": "RV1BFRB52JK2T", "Overall": "5.0", "Content": "OK so these are ink cartridges for an HP printer and more than just pink it also has the Cyan and Yellow that you need for color printing.  I love ordering ink on amazon because I can always be sure to get the exact right kind that is needed without searching fruitlessly.  Easy to order, works great for our printer, and price was right.", "Date": "October 25, 2013"}, {"Title": "BIG MISTAKE", "Author": "alfred r elmy", "ReviewID": "R3R3XN7TD9JBCI", "Overall": "1.0", "Content": "I have received the wrong item.  After informing those in charge and returning the item,I have not yet got the 3 piece color pack.  Why not?", "Date": "October 1, 2011"}], "ProductInfo": {"Price": "$27.49", "Features": "Yields up to 325 pages per cartridge @ 5% coverage\nInnobella Ink + Paper = Genuine Brother Quality\nInk droplets of 1.5pl (picoliter)\nGenuine Brother Supplies\nFor use with DCP-165C, DCP-385C, DCP-585CW, MFC-290C, MFC-490CW, MFC-5490CN, MFC-5890CN, MFC-6490CW, MFC-790CW", "Name": "Brother LC61CL 3-Pack Ink Cartridge, 500 Page-Yield, Cyan Magenta Yellow", "ImgURL": "http://ecx.images-amazon.com/images/I/41rYszI6XrL._SY300_.jpg", "ProductID": "B001C3CKRA"}}