{"Reviews": [{"Title": "Great Camera and Easy to Use", "Author": "Melonie Ross", "ReviewID": "R20H8VLFTHDYVI", "Overall": "5.0", "Content": "I bought this camera to take with me on vacation.The camera works great and is easy to use.It has 10.3 mega-pixels and therefore provides great clarity in the pictures and with the video.The camera only has a 3 times zoom, but works great. If your wanting close up pictures of wildlife, then you need to go to higher end camera. That is to be expected though, because this camera is less expensive, and gives great pictures for the price.I liked it so much, I bought one for my ten year old daughter so she could get started taking photos. It's easy to use for beginners and also for people who don't need all the high tech gadgets.", "Date": "June 8, 2009"}, {"Title": "Fantastic little point and shoot. Durable. Great bargain.", "Author": "John Mischke", "ReviewID": "R3FI7REI7OR553", "Overall": "5.0", "Content": "This is one fantastic point and shoot. For anyone considering buying a pocket-sized camera, I can't reccomend anything much better if you're happy with a 3x zoom and some difficulty in seeing the LCD in bright sunlight. It's very easy to use, and apparently very durable.The best feature of the CD1013 is the red-yellow-green hand blur warning that shows on each picture. This really helps when you're outdoors in the sun and can't tell or don't have the chance to see how good your shot was. Get a red or yellow hand? Just take another picture -- maybe try to be steadier, change your zoom or focus or consider changing settings -- until you get a green hand. But depending on what you're focusing on, a red-handed picture may end up just fine anyway.So far, I'm thinking this camera is pretty darn durable. I've been using it outside at work for the last month and a half -- often taking 100 shots a day, sometimes in light rain. I've dropped it several times in a camera case. So far, no major problems! After a few weeks, I liked this camera so much, I found a great deal on another used CD1013 -- but it arrived with so many scratches and a battery/memory card door that doesn't fully close that it looked like it had been in a blender. After getting a partial refund, I gave it to my five-year-old son. The fact it has survived its past and stood up to my son's abuse and still takes great pictures is amazing.More pros of the CD1013:-- Takes good videos with great sound; although no speaker so you have to play the video on your PC to hear the sound.-- Fantastic resolution at the 10.1 megapixels. I usually shoot at 5 MP and still have fantastic pictures.-- Pretty quick lag time to turning it on and taking the first shot.-- Been using rechargeable alkaline AA batteries (1800 mAh) and usually get 200 shots or more. Even when you get a low-battery shut-off, opening and closing the battery door and doing so over until the batteries are totally dead can get you another 10-20 shots.-- Easy and comfortable to use. Zooms in pretty steadily and quickly.-- Menus and settings very easy to navigate. Handy messages explaining the use of settings pop up on LCD.Some cons:-- Sometimes outdoor shots in lower light in auto-flash come out dark for some reason. But turning the flash off usually gives a great picture.-- Does not remember the flash setting you had previously selected when you turn it back on. But the flash button is right there next to the power button.-- I have had some occasional moments of \"Uh-oh, something's not right.\" Was sure I had a jammed lens the other day. But turning the camera on and off and maybe popping the battery door has fixed every problem yet.-- Not the slimmest point-and-shoot you can find, but still fits in even a jeans pocket.-- Hard to focus easily when using in the close-up macro mode.-- Every time you change batteries you have to reset the date and time. But it prompts you to do so right away and it's a pretty minor annoyance.", "Date": "May 15, 2010"}, {"Title": "Just got worse!", "Author": "Shannon", "ReviewID": "R3I76ODX4YDJ0O", "Overall": "2.0", "Content": "A friend and I had both purchased one on a Black Friday sale. At first they wouldn't even turn on but I tried a new set of batteries and eventually it decided to work. It has to have brand new batteries to even turn on. My friend's camera never worked so she returned it and got something else. Indoor shots aren't the greatest and many turn out blurry. It's alright over all but about a year down the road the screen has stopped working but only when you want to take a picture. It works fine for viewing the pictures on the card but for taking a photo it's a black screen. Viewing the \"photo\" you took with the black screen is also a black screen. It's just annoying. I bought this camera to have a small camera on hand instead of my huge ancient Olympus but this camera has just been a total waste.", "Date": "January 9, 2013"}, {"Title": "NOT good for close up shots.  LOTS of blurry pix.", "Author": "dency", "ReviewID": "R6AOQL06B7YVU", "Overall": "3.0", "Content": "High usage, durable, fairly okay camera for general use.  **Good battery life & only takes 2 AA batteries.WORST PROBLEM/PERFORMANCE:  Closeups....... I get close to subject--it never focuses; I back off a foot & it starts making it's noises as it self-adjusts; all the while I can see on the LCD screen, it's passing the focus point time & time again!  It finally stops in blur mode but INDICATES that it's clear!!??  HATE this!  It has the ABILITY to focus but REFUSES!! Takes me 10-15 shots to get 1 or 2 clear closeups!One other thing:  I'll get a BLURRY warning when about to shoot a photo that I can SEE on the LCD screen is clear AND vice-versa--it give CLEAR symbol on obviously out-of-focus shots!Using this camera has become THE bane of my existence, though it's probably fine if you don't do closeups.Compared to the old 2.5 MP SONY Cyber-shot I had, I'll take the Sony over this 10mp KODAK any day. :(", "Date": "January 27, 2011"}, {"Title": "Keeps getting worse", "Author": "ECL81", "ReviewID": "RXIYBHTDBVSO4", "Overall": "2.0", "Content": "I purchased the Kodak Easyshare CD1013 for Christmas 2009. it was a black Friday sale. When i first started using it the only thing I disliked it the quality of the indoor pictures, the flash doesn't seem to be very strong and pictures seem to turn out a little dark. I had this same problem with a previous Kodak camera I owned and am sure it is just the Kodak brand. It wasn't bad enough to return the camera, it was a good price after all.I do like the feature that lets you know whether the picture is blurry or not. It has a red, yellow or green hand letting you know. The problem is is that it seems to be harder and harder the older the camera gets to get a green hand. so you are taking the picture again and again and missing some good shots of your kids. On an outing the other day I took it out to take some pictures and when turning it on it would automatically shut off. though I knew the batteries were new I still tried the spare i had with me. it still did the same thing. when getting home I took some new batteries out of a new package, just to make sure and now it will not even turn on for a second. The camera has only lasted 8 months. I'm sure there are lemons in every batch, but I have learned to go with past experience and not buy Kodak again and I get what I pay for.", "Date": "August 19, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Kodak EasyShare C1013 10.3 MP 3x Optical/5x Digital Zoom HD Camera General Features: Silver color\n10.3 megapixel resolution Capture beautiful HD pictures in 16:9 format\nView your pictures in high definition on an HDTV or other HD devices 1 / 2.3-inch CCD\nFace Detection CCD total pixels: 10.3 MP (3704 x 2874 pixels)\nEffective pixels: 10.3 MP (3696 x 2776 pixels)", "Name": "Kodak EasyShare C1013 10.3MP 3x Optical/5x Digital Zoom HD Camera (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41g%2BYUS%2BjsL.jpg", "ProductID": "B001N7XHA4"}}