{"Reviews": [{"Title": "New Nikon P60 is a strong contender in a crowded field", "Author": "E. J. Pershey \"Museum guy\"", "ReviewID": "R3L7LEJ41TV0XC", "Overall": "5.0", "Content": "Just bought one of these over weekend and tried it out extensively. Compact, solid design that feels good in your hand. At this price the feature list is superb: Electronic View Finder (EVF), 5x opitcal zoom, 8 megapixel, Auto/Program AND Manual controls. Movie mode that allows zooming while you shoot. Exceptional image quality. Vibration reduction image stabilization works great, too. I also was pleasantly surprised to see that it uses AA batteries--no expensive special purpose lithium batteries. These were all important features for me.The EVF is very cool and unusual in a camera at this price and, it seems more and more, a viewfinder of ANY kind in a point & shoot camera is becoming unusual. So many of the newer models are eliminating this feature, requiring you to use the large LCD screen. The EVF is better than a traditional optical viewfinder, since it mimics the large preview LCD: it shows any menu options, too. In bright sunlight this makes the camera very easy to use. Without the EVF, I don't know how I would have shot so many of my test photos over this past weekend in the bright sun.The P60 is fun to use. Its various shooting modes offer real differences in image composition and creation. Lots to experiment with here, but at the same time it is an easy-to-use point and shoot camera for taking snapshots.If you're in the market for a small digital camera, seriously consider this one.", "Date": "April 7, 2008"}, {"Title": "Finally Nikon Has a Winner!!!", "Author": "Mike Sudol", "ReviewID": "R1DPKHFOC92OL0", "Overall": "5.0", "Content": "Over the past 2 years, I have gone through a lot of Nikon Point and Shoot Cameras. I started with the L1, S200, s51, 7900, even a P5000 and briefly had a Canon SD 700IS. I have to say, the P60 is the best out of all of them! Almost absent is Nikon's annoying shutter lag they had in previous models and now it is a fast, responsive little camera. I don't think it will win the award for quickest compared to the Canon's Elphs, but it is a sure improvement. The camera is quiet when zooming and very fast. Image quality from what I can see so far is excellent. Best of all, it takes Double AA batteries back to the days when I had a Nikon 950. It is very light and not heavy. Also it isn't a sub compact camera, so don't expect it to fit in a little girl's pocket. The electronic viewfinder is also very nice to have on a camera this small. It isn't the sharpest when u look through it, but it is a nice option to have. The only drawback is that the P60 does not have the wide angle lens that the P50 had, it makes up for it though in the 5X Zoom. This camera also has less shutter lag than the flagship P5100, which I have used (I had the previous P5000 model). All in all, I think Nikon fixed a lot of flaws on this model. Hopefully, they keep up the good work!", "Date": "April 14, 2008"}, {"Title": "Great little camera!", "Author": "J. Fallico", "ReviewID": "R11U893SZSVECJ", "Overall": "5.0", "Content": "Having been a fan of Nikon cameras for years. I wanted a small camera to take on our upcoming trip to Disney World.I also own a Nikon D300 but it would be way too difficult to lug around this camera and the many lenses I have for it. Don't get me wrong, my D300 is THE greatest camera I've ever shot with but just not practical on a family vacation like this.After reading several reviews of the Coolpix P60, I decided to purchase it and am very happy I did. After just a few days with this nice little camera, Nikon really has a winner on their hands for the compact market.Some of the benefits that are important to me include...A digital viewfinder - As I normaly use a dSLR camera, I'm just used to composing photos through the lens (viewfinder). It's also great for bright conditions when there may be too much glare on the screen.The advanced shutter & aperture controls give me more function when needed rather than just letting the camera choose the settings. I never use the AUTO settings on any camera.Great low light (high ISO) settings which actually produce usable pictures.A very good image stabilization feature.I highly recommend this camera.", "Date": "June 13, 2008"}, {"Title": "Love it", "Author": "C. Joseph \"material girl\"", "ReviewID": "R2XS07SBK6KEN9", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_30441181embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_30441181refresh_preplay() {\n\ndocument.getElementById(\"cv_30441181chiDiv\").innerHTML = document.getElementById(\"cv_30441181hiddenPre\").innerHTML;\n};\ncv_30441181refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_30441181so;\t   \n\n\nfunction cv_30441181loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_30441181so = new SWFObject(swfLocation, \"cv_30441181AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_30441181so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_30441181so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_30441181so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_30441181so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_30441181so.setAttribute(\"height\", swfHeight);\n          cv_30441181so.setAttribute(\"width\", swfWidth);\n          cv_30441181so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_30441181so.write(\"cv_30441181flashcontent\")) {\n          fp_resizePlayerSpace('cv_30441181', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_30441181';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_30441181', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_30441181loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_30441181\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1L2MI9JLUSXG9\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1L2MI9JLUSXG9\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2XS07SBK6KEN9\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1L2MI9JLUSXG9/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_30441181duration')) {\n      document.getElementById('cv_30441181duration').style.display='none';\n    }\n    cv_30441181loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_30441181loadSwf(movieID, playerVersion) {\n   return _cv_30441181loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_30441181newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_30441181', 0, h);\n}\n\nfunction cv_30441181resetPlayer(w,h,bw,cc) {\n  cv_30441181newHeight(h);\n\n  cv_30441181so.addVariable(\"resetBandwidth\", bw);\n  cv_30441181so.addVariable(\"cacheCode\", cc);\n  cv_30441181so.setAttribute(\"height\", h);\n  cv_30441181so.setAttribute(\"width\", w);\n  cv_30441181so.write(\"cv_30441181flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_30441181RollOverImg = new Image();\ncv_30441181RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81uohPY26tS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_30441181preplay = document.getElementById('cv_30441181preplayImageId');\nif (cv_30441181preplay) {\n  cv_30441181preplay.onmouseover = function() {\n    cv_30441181preplay.src = \"http://ecx.images-amazon.com/images/I/81uohPY26tS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_30441181preplay.onmouseout = function() {\n    cv_30441181preplay.src = \"http://ecx.images-amazon.com/images/I/81uohPY26tS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_30441181preplay.parentNode;\n\n  var cv_30441181currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_30441181currentClick) {\n      return cv_30441181currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 6:18 MinsHi, My name is C Joseph and this is my review of the Nikon Cool Pix P60I paid 125 dollars for this beauty and I can say that it's been a good investment. The Nikon is roughly the size of an adult fist and about as thick. It has 8 megapixel which for me translates to a better quality of photos and more to work with when I'm editing. The optical zoom in beautiful, perfect for the fun on the go photographer.The camera is really compact, it fits in a pocket in a purse but it's not as thin as the more fashionable ones but it makes up for that  in  quality. The image stabilization on it is really good,  again  perfect for quick crazy shots. I got a 8g card for it because I'm a pack rat when it comes to deleting pictures  and also because it has a big beautiful preview screen so you can  just carry it around and showyour friends pictures from  the party they missed. Moving past the technical I love this camera for three main reasons. It's brilliant, in that the quality is so above par one you  get the pictures onto your computer you'll  appreciate it. It's versatile, I love the different settings,  modes and features and the fact that you can tweak every little  thing to get your picture just perfect. And finally, I love how tough  it is, this very camera that  I'm recording from right nowfell three stories and survived. It's a little scuffed up but the lenses is fine, I think thats luck on my part, but it takes pictures and records great still.  I think for a gadget as cool and as fun as this, is worth the cash.After recording I have only a few corrections.The audio skips in and out occasionally but not too much. It seems you have to be facing the mic at all times for optimal audio quality.Also I had to reduce the size of this in Divx so that it was 100mb  needless to say the quality is not as sharp.Also the image stabilization is not perfect, always hold on tight to your camera :)", "Date": "January 9, 2009"}, {"Title": "Great capable camera", "Author": "J. Endicott", "ReviewID": "R2TSN8KV4ACAHZ", "Overall": "5.0", "Content": "I bought the Nikon P60 to replace my aging Nikon CoolPix 3700. The 3700 just wasn't getting the job done anymore, so I wanted to upgrade to something better. I briefly considered a low end DLSR, but decided instead I wanted something that was compact yet still adjustable in its settings.The P60 was the cheapest camera I considered, and the first one that I decided to try out. I was extremely impressed out how well all my pictures turned out, and how customizable all the settings were. It also feels great in the hand, and it is not too heavy.I have only one complaint, and that is the way the P60 absolutely chews through batteries like none other. I am going to have to get some rechargeable batteries for it, and I would recommend anyone buying one to just automatically buy some rechargeable batteries to go with it.", "Date": "July 6, 2008"}, {"Title": "Great little P&S; for outdoors", "Author": "D. Brown", "ReviewID": "R2H69IB90QTM9W", "Overall": "4.0", "Content": "I'm an active saltwater angler and shoot outside in bright sun a lot so I wanted a point and shoot that let me compose shots in a viewfinder and allowed me to see my subjects clearly even in the brightest conditions. The P60's electronic viewfinder works very well in these conditions and delivers sharp well-composed pictures. Telephoto is also impressive and overall controls are fairly intuitive. My other camera is  a  high end Nikon SLR and  while the P60 is clearly a step down in capability, it is an amazing little camera and I am very happy with it.", "Date": "June 24, 2008"}, {"Title": "P60-almost picture perfect", "Author": "C. White", "ReviewID": "R1R10UAIN87THI", "Overall": "4.0", "Content": "I liked everything about the Nikon P60, except for 1 thing.  Nikon has not fixed the \"lag\" time between indoor flash shots.  It's much to slow for any kind of spontaneity. such as children shots.  The quality of the photos are very, very good, which isn't new to Nikon, but there is still that lingering problem with \"recharge lag\" for the next shot.  Of course, this isn't a problem outside where the color and sharpness are outstanding.", "Date": "June 22, 2008"}, {"Title": "Happy with Nikon, again ... AND AGAIN", "Author": "G.Milliken", "ReviewID": "R3AVI85NVMYQ01", "Overall": "4.0", "Content": "Nikon's P60 is a great point and shoot digital camera with a very important feature, a view finder. The P60 is the 5th Nikon I've purchased starting with the Coolpix 775 (which I gave to my 5 year old), all of them are still in service. I use these cameras primarily for work and as careful as I try to be, they are used hard. While my 5600 was out for repair I purchased an L14 which for a variety of reasons I do not like, including lack of a view finder. I knew this when I purchased but thought I'd give it a try. Decided to try the P60 and have not been disappointed.One thing I feel purchasers must understand is what they are buying and then learn how to use it. If you want a camera that does it all, you need a different camera, don't buy a Brownie and expect a Hasselblad. I buy these cameras to take thousands of reference shots while skiing. They are small, fit in my breast pocket and can be operated with one hand. For snap shots they are great, but when I need the money shot I get out the SLR. A lot of complaints I see in reviews are a result of not learning how to use the camera and work within its limitations.The P60 has some draw backs, it can be a bit slow especially the flash refresh. I didn't give it 5 stars mainly because of the placement of the memory card. Having to work around the batteries is a design flaw that surprises me from Nikon. You also have to push the monitor button very hard or a few times before it activates.The optics and zoom are great, I have been pleasantly surprised with the digital end of the zoom. I just took pics of the Waterfalls installation in NYC, zooming into the digital zone from Manhattan over to Governors Island about a half a mile, with excellent results. Falling water is a challenge without zoom and camera shake, the pictures are clear and the water frozen (no tripod).Other reviews have addressed various technical aspects and again, while important, I think may overshadow the utilitarian nature of a point and shoot.I would recommend the Nikon P60 to anyone.UPDATING THIS REVIEW POST VACATION:Just returned from vacation and another good test of the P60. The P60 performed great and after 600+ photos (both 3M & 5M size) I'm still on the same set of batteries. No flash shots were taken but to those who complain about \"eating batteries\" .. I would recommend buying better batteries or getting high quality rechargeables. I spring for Lithiumand keep some rechargeables as extras.As mentioned before, I have several Coolpix and have never experienced any quality (product) issues. I have had two repaired but again after the way they are used, I don't hold that against the camera.", "Date": "August 11, 2008"}, {"Title": "A capable inexpensive winner", "Author": "Brett Ryan", "ReviewID": "R1IHBF2L2E1R5S", "Overall": "5.0", "Content": "After much research and pavement pounding I recently decided to buy a Nikon P60.  I have had no regrets on buying this fine camera and it does 95% of what I need a camera to do.On macro work the camera is quite good as I have taken a number of very good closeups of flowers, insects, and other small things like bare microchips.  Hard to find fault here except on some subjects I've had to take two or three shots to get a good one.  I personally chalk this little problem up to operator error because I'm still learning about what this little gem can do.Using this camera for outdoor photography is where it shines.  Unlike most modern point and shoot cameras that depend entirely upon the big LCD on the back of the case, which is glare prone on every one that I've seen, this camera has a viewfinder with a tiny, but very good LCD in it that simply removes the glare issue.  The other added bonus in using the viewfinder instead of the big LCD on the back of the camera is greatly increased battery life.  I managed close to 500 shots on a single pair of AA alkaline batteries using this feature alone.If there is any weakness in this camera it has to be the same with all small frame point and shoot cameras, the flash.  To me it is amazing the output of the tiny flash unit built into the camera but it is quite limited.  When buying this camera you have to keep in mind that all indoor flash photography is best when your subject is between ten and twenty feet away.  At least that's where I've gotten the best results in all the various modes that require the flash when I've used this camera.The real bright spot with this camera is the fireworks mode.  I suggest having some kind of camera stand when using this mode because when you hit the switch the shutter will remain open for a full four seconds thus getting a good exposure of the fireworks in motion, leaving nice traces in the image looking like some beautiful artwork in the end.  Really fantastic.  I intend to experiment with this scene mode in other situations, like parties or night time city scenes.There are many other scene modes but I do not have time, or space to review them all but there are three other strong points with this point and shoot camera.1. Lens body is quite good with very little distortion at the higher levels of zoom.2. This camera has a natural 5x zoom capability, and also a digital zoom.  Disable the digital zoom, as in all digital cameras I consider that feature worthless, stay with the optical zoom.  If you need to get closer to the subject then handle that with post processing in your favorite photo editing program but be certain to have the camera at its highest quality (least amount of compression) setting and resloution (highest mega-pixel setting).3. The P60 takes two standard AA batteries, not some special format.  Add to that the battery chamber is quite well designed so that the batteries will not get stuck in the case.  The previous camera that I have been using now has a Li-Ion battery that is solidly stuck within the case.  When it dies that four year old beater will be going to the landfill.  Add to that getting new batteries will not be a problem because AA's are sold everywhere.In summary I feel that this is a wonderful camera for the price that is quite capable of what it was designed for but remember it is a mid-range point and shoot style camera with a few more features, useful features, than your standard point and shoot style camera.  If you need a camera to do more then you need to look at the high end point and shoots like the Nikon P80 or P6000 which has a RAW file mode.", "Date": "December 2, 2008"}, {"Title": "Good Small Camera", "Author": "F. Wayne Kinningham", "ReviewID": "R3IW2M878YJHHY", "Overall": "5.0", "Content": "The Nikon Coolpix P60 is very good for a small digital point-and-shoot.  It makes very clear pictures at the 5MP setting, which is what I usually use.  I especially like the Hi ISO setting.  This allows me to take very good picutes in low light settings.  The movie capability is good and allows zoom during the filming which some cameras don't.  The use of AA batteries makes it convenient for travel.  The only negative I can think of is that it is somewhat slow to be ready for taking that first shot when the camera is turned on.", "Date": "June 11, 2008"}, {"Title": "The FLASH is AWFUL!!!!!!", "Author": "C. Hutton", "ReviewID": "R1YB6HBF2NKJBV", "Overall": "3.0", "Content": "I cannot get a good picture of my 9 month old, because once you use the flash to take one picture, it takes FOREVER for the flash to charge to take another picture.  I push the button when she is smiling and the little blinking red light is all I see!  The book says to wait a few seconds for it to charge and try again, so I keep tring and trying - it is awful!  By the time it is ready, the moment has passed!I think the time is takes to turn the camera on and take a picture is fast, and if you aren't using flash, it doesn't take long to take the next picture.  The pictures can be a little blurry at times, but I am trying to fix that with focus options.  It is hard to focus on a moving baby with any camera, though!All in all, I might send it back.", "Date": "June 8, 2008"}, {"Title": "Nice Coolpix", "Author": "June Bug \"Junie B\"", "ReviewID": "R325CRZTTMX0D3", "Overall": "5.0", "Content": "I am very happy with this camera. Pros: Price, manual options, light weight, easy to hold, good zoom, anti shake, and most of all it takes great photos.  Cons:  The flash is not very quick to recharge, and the zoom takes a few seconds too long to focus. If these things are important to you spend more money and get another camera, but for the price this is a great little camera, and I highly recommend it.", "Date": "July 20, 2008"}, {"Title": "Great pics if you learn the ropes", "Author": "J. KNOWLES", "ReviewID": "R9PTLY2P0T9BT", "Overall": "4.0", "Content": "The color, subtle contrast/tone changes,  and pixel rolloff on this are much more natural than the canon or kodak I've owned in this price range.  That's why I got this unit.  Sample pics at one site were almost identical to the D60 shots. Light is the difference though...this has a lot less glass.  I fixed the frequent blurr by switching to center focus (not face) and fixed the motion blurr and got lower ASA by spreading a tripod short-legged (even when not planted) for dim shots. Once I worked with \"P\" mode for focus, ASA, exposure, etc. I got some outstanding shots.  To move beyond point-shoot at a lower cost takes work, but this gives me that real natural color and contrast subtlety.  Only Nikon and Fuji seem to do that. Fuji is still a bit sluggish.  Nice shirt cam, super if you fiddle in P mode and steady things.  I always MUST have electronic viewfinder...that's a big seller in the sun!", "Date": "November 17, 2008"}, {"Title": "Nikon Coolpix P60", "Author": "David Rice", "ReviewID": "R1JQ67BAHLQHOD", "Overall": "4.0", "Content": "My purchase was based on the following criteria:1. Price - Under $200.2. Features - 8MP, 5X optical zoom with stabilizer, EVF, AA batteries.3. Design - Compact, easy to read buttons, flex grip handle.Nikon is a well known brand in the photography field. The Coolpix P60 keeps the brand competitive by offering quality features and design at a low price. Most compact point-and-shoot cameras in this category are well above $200. Uploading pictures on the included software is easy. The black matte color gives the camera a professional and distinctive look. Overall, 4 stars. Five stars if the weight was a bit lighter.", "Date": "April 19, 2008"}, {"Title": "awesome little camera until it broke", "Author": "Jo T.", "ReviewID": "R1ZAE9LZUYPXMJ", "Overall": "1.0", "Content": "below is the original review i wrote for this camera.  i am now amending my review.  last month, when the camera was only about 1 1/2 years old, i was taking pics when the zoom lens froze, as did some of the functions.  i did everything possible to make it unfreeze, including putting in several different fresh batteries, turning it on and off millions of times, resetting settings to default, pressing the zoom while trying to manually get the frozen lens to move, and turning the camera on and off while manually trying to get the frozen lens to move.while doing extensive online research in an attempt to get information on possible fixes. i learned that this is a common problem with nikon point and shoot zoom cameras.  the high price of having the camera repaired fails the cost/benefit analysis.  the cost of having the camera repaired ranges from one third to half the price of the camera.  it makes better financial sense to buy a new updated camera.i am extraordinarly disappointed with nikon for failing to be responsive about this recurring problem and for failing to address it. according to reports of new models of nikons in this class, this problem continues to occur.  to be awesome, a camera has to function more than a few years.------------------------------------------------------------------ORIGINAL REVIEWi bought this camera to replace my nikon coolpix L1 [which underwent an unfortunate accident]. i LOVED my coolpix L1 -- more than any other camera i have had or currently have, including my canon rebel. i love the P60 just as much. it has features not often found on other cameras in this class: 5x optical zoom, a hand grip, and a viewfinder. i find that when set on automatic, the camera makes excellent decisions -- better than my rebel. in fact, i like spending time comparing shots of the same thing taken by both cameras. if you need a trusty camera, small enough to carry around in your pocket, and smart enough to make good decisions for quick shots, i highly recommend this camera.", "Date": "September 9, 2009"}, {"Title": "Another Lens Error Victim", "Author": "R. Benson", "ReviewID": "R28OOWWR8Q70OM", "Overall": "1.0", "Content": "Great feature set, and I got it at a good price. Big draws not in other cameras in this class - viewfinder (not optical; but small, light shielded electronic display) in addition to the big display, and replacable AA batteries. Another standout was 5x optical zoom vs typical 3x in this price range. Negative - no quick way to turn off flash.However, similar to so many others' experience, five days into a two week trip in China (at about 50 weeks of ownership) the [turns out characteristic] \"Lens Error\" disabled the camera. In the days that followed I could occasionally get it to start up for a short time, which only makes things worse since a repair person may not see the problem. In short, it likely cannot be repaired, and to try to keep using it, even if it does start up, it can't be depended on. So it's junk to me, and I'm out the money and have no camera.Conclusion: in spite of the feature set, I can't recommend this camera to anyone, as it will died at the most in-opportune time. And it makes me unable to trust any Nikon branded camera.", "Date": "August 24, 2010"}, {"Title": "Not your father's digital point and shoot", "Author": "Steven P. Spinella \"USteve\"", "ReviewID": "R15C8VFYMBWM5J", "Overall": "5.0", "Content": "When we picked this up on sale we had only seen reviews from the editorial sites. We've always liked the nikon image quality, but now we won't be shaking the camera in between shots waiting for the recovery. Seriously, though, this is not just a point and shoot, but an electronic version of an SLR. You can look at the view finder or the screen, put a grid on it, set the aperture, \"shutter speed,\" ISO equivalent (like \"film speed\"), white balance, and if you don't feel like messing with that, just point and shoot.It is a little thicker than the Nikon L6 we're replacing, and it looks sort of retro black and square, but I think we'll get over it ;-) After all, buy this if you're looking for a camera, not a fashion accessory.But seriously, this is a great camera. I assume it's on sale so that the word will get out. Don't tell anyone I got it for about $100.", "Date": "July 19, 2009"}, {"Title": "great value", "Author": "Tacfarinas", "ReviewID": "R1JLNIFH5SRNXG", "Overall": "4.0", "Content": "This Nikon is excellent in many ways, and certainly a great value for the money.  I just came back from a short but picture-intensive holiday and the camera was near-perfect; it's very nice to hold in the hand, with a good solid feel, and most of the pictures came out beautifully.My only quibbles are perhaps idiosyncratic, and based purely on a desire for total convenience when on the move, and certainly not unique to this camera.The first is that you cannot lock the mode switch (not that I know of any camera where you CAN do this).  This means that if you tug the camera out of a shirt pocket it's quite likely NOT to be in the mode you were expecting.Second (as with all cameras I have used) I wish there were a physical off switch for the flash, so that you could (a) remember how to turn the flash off and (b) be confident that it IS off.Third and most importatnt.  I chose this one because it had a viewfinder as well as the screen; I tend to prefer viewfinders anyway (perhaps this is just old-fashioned) and it is essential in bright sunlight.  The viewfinder on the P60 is electronic, designed specifically for the bright light problem, and it works well (though I would still prefer a purely optical one).  The problem is that you have to turn the electronic viewfinder off, with a not very convenient or decisive button, so that the whole process definitely slows you down with some fiddly stuff right when you'd like to be thinking about your shot.", "Date": "March 17, 2009"}, {"Title": "P60 Nikon Camera", "Author": "GB \"Glenn\"", "ReviewID": "R3SPITTWFPPST4", "Overall": "5.0", "Content": "I love my new camera.  It is lightweight and a really nice camera for the money.  It has a nice viewfinder and takes great pictues.", "Date": "January 6, 2009"}, {"Title": "Nikon Digital Camera CoolPix P60", "Author": "Ruth Gonzales \"sewing nana\"", "ReviewID": "R3LAJRKWMDZ4BG", "Overall": "4.0", "Content": "Very nice product.  I took it on a cruize and it worked out very well. Once I learned how to change the default setting to suit my needs, it was GREAT.  Speedy delivery.  Nice price.  Night shots were not very good but probably because I have not had a chance to experiment with the settings as yet.  I had only one week to get used to it before the cruize.  It came with a wrist strap but I would like to get a neck strap.  It would be more convenient for me.  Also the vibration reduction is good for this camera and for the price it suits me just fine. The one step up model is supposed to be better at this but costs $100 more so I think I will stick with this model.", "Date": "November 26, 2008"}, {"Title": "A great camera from Nikon!!!", "Author": "Jeff E. Farkas", "ReviewID": "RE7GF0COWF4HF", "Overall": "5.0", "Content": "After reading reviews for various basic point and shoot digital cameras for my Girlfriend I was drawn to the Nikon. I'm very well aware of the quality of Nikon and the excellent lenses they make also drew me to this model. Well, I just got it and I've been messing around with it and my Girlfriend loves it. It's easy to use and it takes great pictures. I have to give it five stars!! It's just simply the best camera at that price range, IMO. I now can't wait for my Nikon to come in.. I got the D40.Jeff...........", "Date": "May 15, 2008"}, {"Title": "dreaded lens error after 2 months", "Author": "StarMarc", "ReviewID": "R2BM5JJAZCPWO0", "Overall": "1.0", "Content": "Bought for AA batteries, pic quality, viewfinder non-giga-pixel overload.It took great pictures.Two months later died of the lens error in India.The product is tempting, but DO NOT BUY IT unless you really like to gamble.", "Date": "April 24, 2010"}, {"Title": "I have had this camera for a couple years now and would highly recommend it.", "Author": "Rita L. Childers \"Memzoporita\"", "ReviewID": "RNEQLE2SKD5LF", "Overall": "4.0", "Content": "I have had this camera for two years. The viewfinder is the real reason I got it, this is hard to find on point and shoot, an important feature missing in many inexpensive cameras.  I must admit I have always been a Nikon fan. So when a salesperson, who had the camera recommended it, I went for it.  If you are looking for a simple camera that will take good pictures and downloads easily you might want to consider it.", "Date": "November 8, 2009"}, {"Title": "Perfect picture, dim/shiny LCD screen", "Author": "Kwan-Jin Jung \"pineridge\"", "ReviewID": "R13MW6024VXNK1", "Overall": "4.0", "Content": "I compared with Canon SX110IS, SD780IS, 560 and Nikon S-220, S-230 cameras. The picture quality of P60 is the best. I feel that the scene is deeper and the color tone is more natural. Canon SX110IS and 560 are also good, but the feeling of full depth is better at P60. The image stabilization seems to be better as well compared to Canon SX110 and SD780. This may suggest that the CCD shift method may be better than the lens shift method of Canon at least in this range of camera. Nikon S-220 & 230 were too noisy in particular at the indoor shooting without the flash. Probably, the Nikon S-series may be different line than the P-series. In addition, the wide angle is OK compared to Canon cameras. The view angle of Canon SX110 was not good enough. Considering the price of P60 ($100 at Officemax), P60 seems to be the best one in this range of camera if the size and weight can be accepted.Cons:- The LCD screen is too shiny and dim so that it is very difficult to see the scene. In this aspect, Canon SD780 and SX110 are much better. However, this can be compensated by use of the small eye-piece window.- The flash mode cannot be saved. Every time the power is on, it has to be set again. In this aspect, Pentax camera is unique and well designed even though its picture quality has some color overflow effect.- It is a little bit bulky and heavy to carry.- The voltage level of NiMH rechargeable battery does not seem to be recognized as high enough. Only Tenergy brand of NiMH battery could (somewhat) satisfy the expected voltage level of the P60 camera.", "Date": "August 1, 2009"}, {"Title": "Great Camera - One Improvement Suggested", "Author": "David H. Reed", "ReviewID": "RVT3KMFQT39QP", "Overall": "4.0", "Content": "I have been using this camera for one year.  It is versatile, loaded with features, easy to use, and produces excellent results.  For me the feature that distinguishes this camera from others in its size and price range is the electronic viewfinder.  I carry it with me when skiing and hiking and most of my shots are either taken in bright sunlight over snow or involve moving wildlife.  In both of these situations a camera without a viewfinder is basically useless.  The one annoying aspect of this feature on the P60 is that you must press a button twice to activate the viewfinder and deactivate the LCD--you must do this every time you turn the camera on.  If you are trying to get a shot of moving wildlife the time to make the switch is critical.  Nikon should offer a toggle setting to make the viewfinder the start-up default.This camera offers a \"manual\" mode, but the range of f-stops and exposure settings is very limited, and only a few discreet settings are allowed.  It is actually a bit annoying to try to use this feature.  If I want that kind of control I use my Nikon D80 SLR(which by the way has only a viewfinder in picture mode--the LCD screen is used only for review).In recent days I have begun to experience \"lens error\" problems.  The camera sometimes fails to become ready to shoot on start up, I believe because some part of the lens mechanism fails to extend properly.  Perhaps it just needs to be cleaned and lubed.Update July 6, 2009.  This camera has now totally failed due to lens error.  It is a piece of sculpture--totally useless.  I could not recommend it.  I am very disappointed.", "Date": "April 10, 2009"}, {"Title": "Disappointed", "Author": "A. Gordon \"AG\"", "ReviewID": "R18B1INWSD3S2K", "Overall": "2.0", "Content": "Tested three samples from various vendors:kept trying to convince myself about this camera- the lens resolution appeared to be quite good especially for close ups;however - the plastic exterior felt cheap and sloppily put together, the battery/card compartment door was very loosely pivoted, there were compression artifacts in images, etc., etc.- all in all it was not desirable at all - eventually ended up with a Coolpix p50 that I really enjoy ...", "Date": "March 19, 2009"}, {"Title": "Excellent camera but can't download to Windows 2000 by cable", "Author": "Peter V. Brown", "ReviewID": "R2IZWYBFWN6KID", "Overall": "3.0", "Content": "Pros: Uses standard AA batteries, not proprietary rechargables; sharp pictures; good lens zoom range; flash does NOT automatically charge until needed, which lets you turn it off to save batteries; high ISO mode lets you take pictures in church without flash; many tweaks possible to optimize pix.Cons: Cannot download pix via cable to Windows 2000 computer, must use card reader for that - which results in a lot of opening & closing of battery door since card is in the same compartment. Cable works fine with XP computer. Nikon cameras greater than 8 megapixels all use proprietary rechargeable batteries.", "Date": "January 3, 2009"}, {"Title": "Great little Nikon", "Author": "Sheila Small \"Sheila\"", "ReviewID": "R1ZBDP3GBIQIBZ", "Overall": "5.0", "Content": "I own a Nikon DSLR, but wanted an additional smaller camera to carry with me in my purse for spur of the moment opportunities. I chose this particular camera based on my criteria of size, price, quality, and PRESENCE OF A VIEWFINDER (difficult to find on a camera this size). I have used it for two weeks and find it to do what I want it to. I prefer my SLR, but overall, this is a good investment. The AA batteries are inexpensive and I expect the quality of my photos will improve over time. The image stabilization is a welcome feature.", "Date": "July 27, 2008"}, {"Title": "Excellent Camera", "Author": "Broadview 23", "ReviewID": "R4JOSAWQ5CNHZ", "Overall": "5.0", "Content": "I am a novice photographer, so this camera is everything I knew to ask for. I like the layout of the controls, the ease of use, the weight/size, and the quality of the pictures. All for a wonderful price. It is simple to use, but capable of more complex applications. I really am happy with this camera.", "Date": "June 25, 2008"}, {"Title": "Worst camera I've ever owned!", "Author": "MutLovrar", "ReviewID": "R2MW6JPKJYCJYZ", "Overall": "1.0", "Content": "I have always been a huge fan of Nikon, but this is the worst camera I've ever owned!  I've tried all the focus settings and it has yet to take a clear picture.  Maybe it's a glitch in mine because none of the other reviews mentioned the focus - only the flash.  It's true the flash is weak, but the focus is by far the worst feature.  It's been tested indoors and out, using face priority, and all the other settings.  I chose this one because it was a cheaper \"P\" level (performance), but now I'm considering getting a higher level \"S\" (style) one instead.  For over 20 years, I've carried a camera in my purse at all times.  Now I've given up carrying the camera with me any more since it doesn't work anyway.", "Date": "May 2, 2009"}, {"Title": "Great camera!", "Author": "Laurie A. Guck", "ReviewID": "RF1JFDAPM8UTP", "Overall": "5.0", "Content": "I love this camera!  It's SO easy to use.  The first weekend I owned it, I took 200 photos using the pair of batteries included.  The photo quality is terrific.  I would definitely recommend this camera to others.", "Date": "June 9, 2008"}, {"Title": "Nikon Coolpix P60", "Author": "Jacob Anthony Vasquez \"The Disturbed One\"", "ReviewID": "R11UK0V4ACMZSM", "Overall": "5.0", "Content": "Love this camera!!! I haven't had a complaint yet on it. Got rechargeable alkaline/Ni-cadmium hybrid batteries, and takes well over 350 pics at a time. Photo quality is great. I do notice high barrel distortion at wide angle but not a concern with most pic I take.  Great product.", "Date": "June 8, 2010"}, {"Title": "camera", "Author": "Sarah S. Oberne", "ReviewID": "R1FZSPUD7RC15W", "Overall": "4.0", "Content": "The camera arrived on a timely basis in excellant condition.  It takes good pictures and performs as stated on Amazon.", "Date": "June 15, 2009"}, {"Title": "Nikon P60", "Author": "Barry99", "ReviewID": "R3501CQHDF7UR5", "Overall": "5.0", "Content": "Great camera ... wide range of settings ; quick and easy auto mode ; 5x optical ; electronic viewfinder ; lots of features.  It uses AA batteries which is what I like for traveling ... picture quality has been excellent.", "Date": "May 31, 2009"}, {"Title": "Great Camera!", "Author": "J. Germond IV \"Winged Gecko\"", "ReviewID": "R2O9DQRG1ZYNHE", "Overall": "5.0", "Content": "Great camera...to me flash time is not too much of an issue.  I was using an older digital camera and it takes about the same time.  The good news is that it doesn't let you take the picture without the flash fully charged.  So when the picture is dark, you don't have to take it again.  Battery life is not an issue either.  My other camera takes 4 AA batteries.  It can take twice the amount than this camera.  Hence, it is the same yield...so carry a couple of spares in your case.  The only complaint is that when you are using the view finder and you take a picture, the review is played back in the view finder and not on the main screen.  I don't like taking pictures on the larger lcd, but would like it to play the reviews on it.  All in all, a super camera for the price.", "Date": "May 12, 2009"}, {"Title": "Good enough to buy again", "Author": "M. Harper", "ReviewID": "R32SS6MN3N1JTX", "Overall": "5.0", "Content": "I purchased this camera in March and really liked how the pictures turned out and the fact that it's compact, light weight and takes very good pictures, especially high-resolution close ups. My fiance liked it a lot as well and took it to Kenya for three months.  The camera mysteriously disappeared from his possession after two months.  So we decided to purchase another one.  We use the rechargable AA batteries, which last much much longer than the regular alkaline ones.  Very nice camera for the price.", "Date": "October 12, 2008"}, {"Title": "Nikon Coolpix P60 8.1MB - a good choice", "Author": "Erico von Bueren", "ReviewID": "R3SIXJ7WXGZPCB", "Overall": "4.0", "Content": "Sufficient depth of menues, picture are very sharp, chip speed great.Use ultra II or III SD card to save picture fast. Enjoy!", "Date": "October 10, 2008"}, {"Title": "Outstanding!!", "Author": "Miguel", "ReviewID": "R3DL59Q9JZZ4R6", "Overall": "5.0", "Content": "Outstanding combination of features, performance, and price.  Sharp details from closeups to miles away (see nine-mile coastline view).  Electronic viewfinder option is great for composing pictures in sunlight.  No worries about battery running down -- just pop in two fresh AA batteries and keep shooting.  Movies are great, so buy large memory chip to have plenty of room.  I love it!!", "Date": "August 20, 2008"}, {"Title": "I'll never buy a Nikon again", "Author": "Amazon Customer", "ReviewID": "R1TH1B1T26Z3MF", "Overall": "1.0", "Content": "We bought this camera in April, 2007 from Amazon. It worked ok, not great. It took several seconds to store each picture and be ready to take another one, even though I bought a very fast flash memory card. The battery cover broke almost immediately, so the batteries are now held in by a piece of tape. Within 5 months of purchase, however, we got the dreaded \"LCD read error.\" The lens was stuck halfway open, the camera wouldn't focus, and it made a horrible grinding sound when turned on or off. We sent it in for service, and it's still there 3 months later. I've called Nikon many times, and they always assure me the camera is almost fixed and I'll have it back in a jiffy. Weeks later, I'm still camera-less, so I call again and get the same story. These guys make a flimsy camera and have no idea how to service it. Never again", "Date": "December 10, 2008"}, {"Title": "Picture Perfect", "Author": "deelux \"the letter man\"", "ReviewID": "R2EO2WGHSLLAPY", "Overall": "5.0", "Content": "The Nikon Coolpix P60 camera has it all.  From the lightweight, easy grip design to the photo quality.  It is perfect to preserve your memories with stills or video.  Great for vacations and everyday activities.  I also suggest getting the Nikon accessory pack (case, tripod, lens covers, etc.).", "Date": "December 24, 2009"}, {"Title": "Aperture Problem", "Author": "Brent M. Saba", "ReviewID": "R2M26SOIWW8AC9", "Overall": "2.0", "Content": "Less than a month after I got this camera, the aperture developed a problem. I have the upper right corner of every frame where the aperture leaves a rounded, blacked out area in the picture. I was on vacation when this was discovered. When I went back and looked at all the other pictures I had taken, it was faintly visible in almost ALL of the pictures from when this camera was first used. Hopefully, Nikon will back their product better than Canon did! Which is the reason I switched to Nikon in the first place!", "Date": "July 24, 2008"}, {"Title": "Digital camera", "Author": "JD", "ReviewID": "R1LP3TT3WDTZ92", "Overall": "5.0", "Content": "Great little camera! If you don't want to lug your DSLR around, get this one. Excellent product.", "Date": "June 25, 2008"}, {"Title": "P60 is a nice camera, but this particular used camera was not as advertised", "Author": "SHilsenbeck", "ReviewID": "R2PYU8NECL1TR7", "Overall": "2.0", "Content": "This used P60 was purchased to replace a malfunctioning P60 that has a custom underwater housing. As described, the USB cable was missing. No problem. Not mentioned was the fact that the latch on the battery compartment door was broken, and the flash was not working, rendering the entire camera non-functional.", "Date": "January 29, 2014"}, {"Title": "Don't purchase from Video & Audio Center- Camera defective", "Author": "Linda Bireley", "ReviewID": "R1A3TKOJP5WBIQ", "Overall": "1.0", "Content": "Camera arrived to be used by our dematologist office. The camera leaving a dark spot image on pictures.. We purchased a replacement camera and filed for a return on 11/19/13 the date allowed per Amazon policy. We did not hear anything and filed again for the return. The Video & Audio Center has refused to take back this DEFECTIVE CAMERA . DO NOT PURCHASE FROM THIS COMPANY!!!", "Date": "December 4, 2013"}, {"Title": "Lens error and marginal quality pictures", "Author": "Chris Kafer", "ReviewID": "R2U1FB9EYD060X", "Overall": "1.0", "Content": "This camera has pros and some serious cons and is overpriced for what you get.Cons1) The barrel distortion is horrendous on this camera.  Shooting anything with straight lines will need significant software correction (e.g.PTLens software. No affiliation)2) The infamous \"lens error\" not due to any mistreatment on the users part.3) Eats batteries.Pros1) Fits in your pocket2) Decent picture quality with the caveat of #1 aboveThat's about all I can say for this camera.  I would not purchase another one and the one I have is now dead after VERY light use over a couple of years due to Con #2. It spends most of its time in a case in my desk.", "Date": "September 30, 2012"}, {"Title": "Not so good", "Author": "Carlos", "ReviewID": "RWQGJB63PSC8H", "Overall": "2.0", "Content": "It is a camera that takes much in loading the flash, reason why the time between photo and photo is much. The best thing than has is that it uses batteries instead of battery, allowing to have access to load more easily when the batteries finish.", "Date": "November 3, 2011"}, {"Title": "Great while it lasted", "Author": "Thomas Gamble", "ReviewID": "R3501HRHMDL733", "Overall": "2.0", "Content": "This camera lasted about two years.  Now there are problems with the software (very slow, flash function not accessible, taking multiple shots like button is stuck, etc).  Should have lasted longer for that price.  Last time I buy Nikon, that's for sure.", "Date": "October 8, 2011"}, {"Title": "lack of picture cropping", "Author": "Richard Olson \"rko\"", "ReviewID": "R16UGTYPQZB1YM", "Overall": "4.0", "Content": "just bought a new nikon p60 and since i use pictbridge camera directly to printer i'm a little disappointed that the p60 does not crop the pictures like my old canons did  other than that the picture quality is very good", "Date": "April 29, 2009"}, {"Title": "Good camera, poor service", "Author": "J. Swanson", "ReviewID": "R1CP5N81RP3UJW", "Overall": "5.0", "Content": "The camera is fine. Just what I wanted. However, I also ordered a case for the new camera and some how that got lost in the shuffle. Since the camera and the case were to come from two different suppliers I didn't notice the fact that the case was never included on any order. I have made due with another case I had on hand but I would have rather had the one I originally ordered. But since I didn't pay for it, I'm not out anything but inconvenience.James W. Swansonjimjans@msn.com", "Date": "December 13, 2008"}, {"Title": "little camera, big fun", "Author": "KEW", "ReviewID": "RDLARAUK6HGMG", "Overall": "4.0", "Content": "This is a very nice little camera. The wide viewer makes composing the shot easier. The optical zoom is great for close-up, but it really works because of the Vibration Reduction feature. Nice quality pics and easy to down/up load. Accessing menu and features can be frustrating; there are a lot of controls to get familiar with and it is not as intuitive as it could be.", "Date": "June 7, 2008"}, {"Title": "Great purchase", "Author": "Luc Levert", "ReviewID": "RRDCJU1D5XQDN", "Overall": "5.0", "Content": "I recently bought the coolpix camera and I'm really happy.  It's wonderful and it takes really good pictures.  For the price this camera is super cool.  I recommended it to everyone, it's a great product.", "Date": "June 5, 2008"}, {"Title": "Good ... for a while.", "Author": "MsO \"teacher librarian\"", "ReviewID": "R2BELT0V9EMMBI", "Overall": "2.0", "Content": "Enjoyed this camera for a year--the lag time was frustrating but I really did like everything else. Focus and color seemed good. Product design was fairly intuitive and the camera felt sturdy.Then, four days into a Europe trip (and 53 weeks after I purchased it) I experienced the same problem it seems like everyone else giving it a low rating did ... the lens refuses to retract and it's just dead in the water.I very much doubt that my replacement camera will be a Nikon. The Canon this one replaced lasted much longer.", "Date": "July 3, 2009"}, {"Title": "Nice features but poor quality", "Author": "Ronn Abueg \"Ronnbot\"", "ReviewID": "R2482XD030N2R3", "Overall": "1.0", "Content": "The Nikon P60 has really nice features for the price: it has a handy (electronic) view-finder (that isn't painful to use because you don't need to squint like mad), useful 5x zoom and helpful optical image stabilization (VR). However, to me, the deal breaker was the fact that it uses the ubiquitous AA cell instead of an expensive proprietary battery. This is great for traveling - if your batteries die, you can get replacement AA's just about anywhere.Having said these, the biggest issue I have with the camera is its quality or lack there of. I had the P60 for less than a month and it doesn't work anymore. It has never been dropped, always in a padded case when not in use, and since it is the wife's camera, it is normally in a nice, big purse. It complains about a `lens error' and I can't take pictures with it; I can, however, view some of the pictures though - yea, big woof. Someone at Nikon seriously botched the Quality Assurance (QA) on this thing.I had another Nikon years ago, the Coolpix 4300, and its quality was abysmal as well; should have learned my lesson, or Nikon should have replaced its useless QA personnel(s) so that the P60 would be a bit more reliable.On the other hand, just before owning the P60, I had the Casio EX-Z120 compact camera. It was as tough as a brick - the case is completely made of metal. It was used all over Asia, dropped numerous times (even on cement), and missing a couple of screws, but for almost 2 years it never let me down until it was lost/stolen.I greatly lament buying Nikon compact cameras; should have bought Canon, or another EX-Z120. I can only take solace on the fact that Nikon may honour their 2 year warranty.", "Date": "August 22, 2008"}, {"Title": "Nikon Refuses to honor warranty", "Author": "Bruce Conway", "ReviewID": "RKK0FQUV47436", "Overall": "3.0", "Content": "I purchased the Nikon Coolpix P60 less than eight months ago. The camera was decent, but had its faults (such as a very dim LED invisible in daylight). Then the lens refused to retract. So I jumped through the hoops and sent them the camera into Nikon warranty repair.Imagine my surprise when I got an email from Canon saying that the lens mechanism is NOT covered by the warranty, and an invoice was attached for $117. This was close to what I originally paid for the camera.So I need to buy a new digital camera... and it sure as hell won't be a Nikon.", "Date": "June 2, 2009"}, {"Title": "Junk; DO NOT BUY", "Author": "William D. Colburn \"buys things on amazon far...", "ReviewID": "R2DR4TM4FA3SJC", "Overall": "1.0", "Content": "I wanted a point and shoot for easy shots.  My first digital camera was a Nikon Coolpix 950, and it was a rock solid camera that still works 8 years later.  My second digital camera was a Nikon Coolpix 995, and it was a rock-solid camera that still works 6 years later.My Nikon P60 worked for a week.  I didn't even carry it around with me; it rode in the passenger seat of my car.  The lens mechanism failed and wouldn't move in and out.Nikon needs to go back to making good point and shoots.  The 950 used to be the digital camera that all other digital cameras were compared against.", "Date": "August 6, 2008"}, {"Title": "Not very special", "Author": "Zoe C. Johnson \"genday\"", "ReviewID": "R23PKXDM0JVMK1", "Overall": "1.0", "Content": "What a disappointment.  This is nothing more than one of the L-series cameras with an electronic viewfinder.  There are really only two f-stops, and the choice of shutter speeds only goes to 1/1250. There is no aperture or shutter priority. The lens is neither really fast or slow.  It will handle what it was purchased for, to make snaps straight out of a purse, but nothing more.  It really does not belong with the P5100 in the same series.", "Date": "July 9, 2008"}, {"Title": "it just feels cheap", "Author": "Adrienne M. Long \"anonymous\"", "ReviewID": "R3SYXT7Q2X3VNX", "Overall": "1.0", "Content": "I had a mid-range Nikon coolpix that I bought about 4 years ago and was very happy with it.  Sadly it disappeared and I thought I'd upgrade to this version.  The quality has gone down significantly and I have to return this piece of garbage.  There is no optical viewfinder, rather it has an window that you look through that gives you a low quality image of what you would otherwise see were you to look at the screen.  The menu options have been reduced by half.  There is no way to choose your ISO settings and much of the control is taken away from the user. Booooo Nokia.  The standards I once appreciated in this brand are clearly in the toilet.  I'll be looking into Cannons.", "Date": "February 17, 2009"}, {"Title": "works well indoors, a disappointment outdoors", "Author": "Mari", "ReviewID": "R36DER806SZ7UF", "Overall": "2.0", "Content": "The monitor had a such a glare when taking pictures outdoors that I could not see the image.", "Date": "July 3, 2008"}, {"Title": "not what I needed", "Author": "Mohamed Abdellatif Abdalla", "ReviewID": "R4GBTJ3AT653P", "Overall": "1.0", "Content": "No charger ,only batteriesNo Computer cameraNo card to save dataNo Cover to put in", "Date": "October 30, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.1-megapixel resolution for stunning prints as large as 16 x 20 inches\n5x optical zoom; vibration reduction\n2.7-inch high-resolution LCD; Electronic Viewfinder\nIn-Camera Red-Eye Fix; enhanced Face-Priority AF automatically focuses on up to 12 faces\nCapture images to SD memory card (not included)", "Name": "Nikon Coolpix P60 8.1MP Digital Camera with 5x Optical Zoom with Vibration Reduction (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/515prNv%2B%2B6L._SX300_.jpg", "ProductID": "B0012OI6EA"}}