{"Reviews": [{"Title": "Do not buy this camera!!", "Author": "Juanita K", "ReviewID": "RDUXB6M98681S", "Overall": "1.0", "Content": "This camera is HORRIBLE! The pictures are ALL terrible! Its so pixelated and blurry. The software for playing with is really good, but the camera is a waste. Its worthless for taking any pictures worth keeping. It is going back to the store!! I realize its a kids camera, but good lord if you can't see what you are taking a picture of, doesn't it defeat the purpose of the camera?!", "Date": "October 26, 2008"}, {"Title": "Very Basic and No LCD Screen", "Author": "Nuknuk", "ReviewID": "R2ELUYPLMH75Y6", "Overall": "2.0", "Content": "It is a very basic toy digital camera.  It does not have an LCD screen for playback.  It is capable of operating as a livecam.  3 snap-on Hulk faceplates to choose from for the design you want.  You have to load the inlcuded 3\" CD software before it can be recognized by your PC.  For comparison, I found a digital camera that I bought as a Christmas stocking stuffer with a tiny less than 1\" LCD screen at the back for 20$.", "Date": "December 27, 2008"}, {"Title": "Hulk Camera", "Author": "TL", "ReviewID": "R10NX3YQYCMSEV", "Overall": "5.0", "Content": "Fantastic little camera for my little boy who is a huge Incredible Hulk fan.  Not only does it take photots but it comes with software that can transform your littl eone into the hulk, play games and edit pictures.  The only thing we wish it had was a screen to see the photos before you downl;oad them, currently it only had a viewfinder but with kids we weren't really worried about getting the best shot he had more fun just taking the photos anyway.  Great camera for children, easy for them to manuver and use. Probably not somethng an adult would be excited to use as the photos are a little grainy and like I stated before no digital screen to actually see your photo before you down load.  Perfect childrens gift though.  My son had hours of fun!", "Date": "June 18, 2012"}, {"Title": "Great BD Gag Gift!", "Author": "D M Pax \"Kahuna\"", "ReviewID": "R56DRMM4TOK5E", "Overall": "5.0", "Content": "I purchased the Sakar Incredible Hulk Camera, along with a the Real BD Present, a Panasonic Digital 12MP, for my GF's sister, who by the way ... is a dead ringer for one of my favorite actress's, Carie-Ann Moss (Matrix).All she ever did was Rant & Rave about how cute the Hulk Camera was and that she used to be crazy about Lou Ferrigno, in her Teens. She even took the Hulk Camera to work and put on her desk ...and most of her engineer friends and employees, thought that was the coolest BD Gift Ever!I sent it as a Gag Toy gift and it was a Hit ... so with Women you just never know ... that's WHY it will always remain a Mystery!", "Date": "November 11, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001P80YT8"}}