{"Reviews": [{"Title": "get what you pay for", "Author": "Erica", "ReviewID": "R1TCSSV3YR4ASL", "Overall": "3.0", "Content": "i bought an older model with 7megapixels and it worked great for about a year. but after christmas, i've had nothing with problems. most of the time it won't go on now and the left button on the circle buttons will not work at all. the picture quality is no where near my old 35mm camera and the lag time between snapping the picture to it taking the photo is as slow as my cell phone. in fact, i usually have to rely on my cell because it never turns on. i would recommend spending more money", "Date": "April 11, 2010"}, {"Title": "Polaroid i830 Digital Camera is the BEST!", "Author": "Darcy", "ReviewID": "RCCRVW0KI8QXX", "Overall": "5.0", "Content": "I purchased two of these pretty pink camera's. One for my daughter and one for myself. They are the absolute BEST camera that I ever owned. This camera has many GREAT features. Simple to use too. Excellent quality and a Great price too. It takes BRILLIANT pictures!! I highly recommend this Polaroid i830 Camera. 5+ stars and  2 thumbs up *****...............  :)", "Date": "October 27, 2008"}, {"Title": "Polaroid i830", "Author": "Jewels", "ReviewID": "R1PWGVUBWOIV1V", "Overall": "4.0", "Content": "This camera was a gift for my daughter because she's been asking for a digital camera for Christmas. The Polaroid i830 is a simple camera that is easy to use for beginners who never owned a digital before and offers decent quality for 8MP and a 3x Optical Zoom. We've never had problems with it.", "Date": "July 23, 2008"}, {"Title": "The best!!", "Author": "HB Girl", "ReviewID": "R2NKOEK97BB1FP", "Overall": "5.0", "Content": "This camera was my child's and I loved it!  So user friendly AND it takes great pictures! I broke it and spent two years trying to replace it but never found one either of us liked as well. It's just so easy to use without having to memorize the user manual. I finally came here and found one from a retailer still in packaging. I've never been happier!", "Date": "February 5, 2012"}, {"Title": "I love it!", "Author": "Ms. Tot", "ReviewID": "R11KLP4GDTTZQT", "Overall": "5.0", "Content": "I absolutely love this camera. My Polaroid's flash went out so i wanted a new one so i decided to buy a Kodak and totally disliked it. So from now on i will only buy Polaroid! :D", "Date": "April 6, 2009"}, {"Title": "could be better", "Author": "Lw Underwood", "ReviewID": "R3V2VB1IUIXEGB", "Overall": "4.0", "Content": "this camera isnt the best you could get. but its good. i have had no problems with it at all.", "Date": "January 29, 2009"}, {"Title": "A do not buy!!!", "Author": "Sandee", "ReviewID": "ROU3FLPAK7L3S", "Overall": "1.0", "Content": "This camera has to be by far the absolute worst i've ever had. I was able to snag 2 photos before the LCD completely went out! I will definitely be buying Canon cameras from this day forth.", "Date": "May 27, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "8 megapixel resolution\n3x optical zoom lens and 4x digital zoom\n2.5-inch color LCD screen\nMacro focus\nPictBridge capability", "Name": "Polaroid 8MP i830 Digital Camera w/ 3x Optical Zoom, Pink", "ImgURL": "http://ecx.images-amazon.com/images/I/51m6KEDe4-L._SY300_.jpg", "ProductID": "B001051ICI"}}