{"Reviews": [{"Title": "Great camera for soccer moms!", "Author": "Heather M. Williamson \"ATMlady\"", "ReviewID": "R1AHITZWJQ4C0U", "Overall": "5.0", "Content": "I bought this camera early in April, from another vendor. I didn't want to wait until Amazon's April 15 release date! My newfound hobby is photographing high school rugby games, so I am by no means a professional and truly don't know much at all about photography at all. I had been using a Kodak Easyshare with 12x zoom with good results, but I wanted to get closer and I wanted faster sequential shooting. Yet, I didn't want to buy a $1,000 plus SLR camera. After all, I'm not trying to win a Pulitzer. I'm not frantically concerned with crisp color, and I don't have time to learn a million functions. I just want to get the \"money shot\" - a player with ball in hand, hair flying, face in grimace, muscles straining, dirt clods and sweat droplets spraying around - you know what I mean. After some research I discover that my Easyshare, and this Olympus, are in a class of camera called point-and-shoot super zoom - yeah! That's exactly what I wanted! And THIS camera, at 20x zoom gets you closer than any other out there. So I was sold. And wow, are my pictures with this camera GREAT! I started with the pre-programmed sports mode, but found that my best action shots were in the \"P\" mode, at a speed of H1 (and that's not even the fastest speed!), with image quality = fine. I saved these settings as a \"my mode\" and can adjust brightness/exposure with the dial at the top of the camera if I need to.  Other than the great money shots I am getting with this camera, I like the battery life. I have taken up to 1,500 pictures at a time without having to change the battery, and I use the screen a lot. I also like that I am not bound to a monopod - it's light, it's point and shoot, I can move around and adjust things quickly and catch just about all the action. The only thing I don't like is the amount of time it takes for sequentially shot pictures to \"save\". It can be frustrating to wait on the camera to save while action is going on that you can't capture. This was a problem with my Easyshare, too, and I suspect is a problem with any point and shoot with sequential shooting capabilities. The only reason I'd ever upgrade to an SLR is that this does not appear to be an issue with those types of cameras. If my fascination with sports photography continues to grow, I imagine someday I will buy an SLR. But for now, I am really satisfied with this Olympus and it's 20x zoom and dozens fps shooting speed!", "Date": "April 18, 2008"}, {"Title": "Good solid camera", "Author": "E. Soon", "ReviewID": "R3HHQK6KYNZS9F", "Overall": "4.0", "Content": "Tried the camera out for the past 4-5 days, under various conditions. All and all, for the price and the functions/ability this camera offers, it is a solid camera.First of all, this is obviously no SLR camera. The aperture and the shutter speed are more limited than I would prefer. As such, it probably might turn off  people that are looking for a SLR styled camera. While the high ISO values allow you to take pictures in low light conditions, the noise reduction is simply not enough to make those pictures look presentable. Image stabilization was no match for my cat in those low light situations, even with high ISO values. Fast shutter speed remains the key against blurry pictures.The selling point of this camera, the 20X zoom, works as advertised. The zooming ring works fine, but it might not be sensitive enough if you are trying to zoom meticulously. There are 4 AF modes to choose from, ranging from giving the camera total control of choosing the object to focus on (not as \"smart\" as I like), face recognition, center focusing, to basically using the arrow keys to manually point at the area you want to focus. Also, there is a manual focus option, though not very practical to use, IMO.The \"High-Speed Sequential Shooting\" I think is handicapped by the slow writing speed of the XD-Card. Perhaps the H XD card might make a different, but the M XD card was simply too slow. I have yet to try the pre-capture mode.The LCD is big and clear, and you have the option of using the viewfinder window to take pictures, though it is not a \"real\" viewfinder window.The battery life on this thing is amazing. It would take some heavy shooting to drain the battery out in one day (of course, that depends on the kind battery you use).All in all, there are goods and bads to this camera, but for the price and the functions that you got, I think it is a good camera for what it is designed for.", "Date": "April 28, 2008"}, {"Title": "Good improvements but questionable design", "Author": "lordhoot \"lordhoot\"", "ReviewID": "R3MWXRMJEBW8LJ", "Overall": "3.0", "Content": "As a pretty happy owner of Olympus SP550UZ, I borrowed this latest version, SP570UZ to tested it out for several days under various conditions. I immediately saw few similarity and few non-similarity with this camera to the SP550UZ that I owned. From now on, I am dropping the SP and UZ reference and just calling them \"550\" and \"570\".Let me hit the good points first. First of all, I thought the capture speed and the write speed of 570 have definitely improved over my 550 camera. Of course, this is still not lighting fast but its an improvement. I think the weak xD card is the blame anyway as I was using their \"H\" card all the way. Second, you definitely see the difference between 28mm wide for 550 and 26mm wide for 570. Only 2mm difference but you can see it. Not much difference between the 18x and 20x though. Like the 550, the 570 is very easy to hold, handled and grip. The 570 is slighter larger but the weight felt the same. Major improvement I really like in control for the 570 lies in the fact that you can make certain adjustments like flash compensation right off the back LCD menu now instead of going through the menu system in the 550. The shadow adjustment mode does work pretty well under ideal condition. But not all that well depending on the extreme cases. Face detection system works well although I am not really a great fan of this. Still for both features, it better then not having one at all. Photos came out looking very good under most condition and I think they improved the color capture for red which was somewhat of a problem for the 550. The dual image stabilizer proves to be excellent once again and capturing at extreme zoom proves to be quite good as long as there is enough light. But those are the highlights of the good things about this camera. I am not going to bother going down the specs since Amazon have been so kind to provide it for all to read. One of the previous reviewers wrote that the battery life quite excellent and I do concur with that. But there is a reason for that in my next paragraph.The bad things about this cameras lies in three elements. One is that the electronic viewfinder is harder to use thanks to the increase reliance on the LCD that is almost on all the time. I like using the viewfinder as an old film SLR guy but if needed, I can adjust to this. Second element lies in the zooming...there is no auto-zoom. All the zooming are done by hand - your hand that is and to be honest, it is not an exact science here. While you still got the auto-focus, you have to manually zoom up and down. The lens control actually feel pretty \"rubbery\" to borrowed another person's term. Worst, with my 550, I can zoom and fire away one handed. There is no way I can do that with 570 since one hand is on the shutter while other hand have to adjust the zoom. Unless you got super long fingers, most normal folks would have to do it two handed. The lack of the feel of a firm control in zooming is quite puzzling and I supposed anyone can get a handled on it with enough practice but still felt pretty weak. A whole star was taken from the review on this feature. I wasn't too impressed. By the way, this is why the battery life have improve...camera no longer have to zoom, you have to do it yourself. (And they save weight by not adding the auto-zoom device into the camera.) Finally, Olympus totally failed to improved their camcorder system for the UZ series. Like the 550, 570 is light-years behind...let say Canon S5 IS in terms of taking video. The videos taken by Olympus 570 is okay if the camera cost $150 but totally unacceptable for $450 plus camera. It can be pretty grainy and sound was pretty weak. Another star gone for that.I supposed I could go on but I wrote enough. I am sure a more professional reviews on the Internet is forth coming and anyone interested can continue to investigate. I am not sure if this camera is really right for inexperience photographer or even for a casual one. It quite advanced piece of digital camera but its not really well designed. Manual zooming is nice as an option but not as a permanent condition. And the video recording for a camera of this price range is really pathetic. Personally, I can live without the video but zooming feature is a step backward to the 20th century...not a step forward for the 21st.", "Date": "April 29, 2008"}, {"Title": "One sweet camera", "Author": "Charles Hawkins \"seahawk505\"", "ReviewID": "R331BZTCBWLINV", "Overall": "5.0", "Content": "I have owned the Olympus SP-57OUZ Digital Camera for a little over a month, and continue to find reasons to be very satisfied with my choice. For years, I was wed to Canon SLR's (pre-digital), and was content but not thrilled when I switched to digital. My first camera was an HP850, which seems ancient to today's standards, but served me well. I thought I might make the leap to a Canon digital SLR, but didn't want to pay the high prices nor carry the extra weight around, or fuss around changing lenses.When I read the initial (pre-release) reviews of tis Olympus, it had all the bells and whistles I wanted, at a decent price (Amazon's price was best), and so it became my choice. I am thrilled at everything this Olympus is capable of, especially shooting in low light, at full telephoto extention. It has image stabilization, and 20x zoom power, which I found to render excellent pictures at my granddaughter's ballet recital. I was shooting from about the sixth row, more than forty feet away, and was able to get clear candid closet-ups of her during the performance.I also enjoy the Olympus' ability to take in-camera panoramas, and then stich them together seamlessly. I have used this feature using a tripod and hand-held, and either way has produced excellent results. I wholeheartedly recommend this cutting-edge camera.", "Date": "May 25, 2008"}, {"Title": "Not perfect...but makes up for it's shortcomings very well", "Author": "SAV518", "ReviewID": "R2A1OWEQFOT7OL", "Overall": "5.0", "Content": "After owning an Olympus C-3030 for a few years and getting several comments on the excellent photos it produced, I was ready to upgrade to something with more features, zoom, resolution and compatibility.I first purchased a Canon A650-IS bundle for Christmas and was immedaitely displeased with the graininess of indoor shots without the flash. I know Canon makes good digicams, but in the megapixel race, I felt they just crammed too many pixels onto the sensor to produce quality low-light images. So, back it want.Now, the SP-570UZ is not the 'be all and end all' in prosumer-level digital cameras, but for what it is designed to do, it does, for the most part, pretty darned well. The range of the lens alone is fantastic. I can get excellent wide-angle shots and wonderful zoomed close-ups. Perfect for a typical consumer wanting decent quality shots of kid's sports, snapshots and outdoor landscape photos. The various preset scene modes are fairly good and I've done well with sunset/sunrise shots.I have had the camera for a month or so and had photos from my wedding, honeymoon, softball games and other family events turn out awesome. There is still some annoying noise in low-light situations, but not nearly as bad as the Canon. I can definitely live with it and I have found some ways to deal with it afterward that make the shot acceptable for larger prints. The zoom ring takes a little time to get used to and it does lag a bit and can make it hard to make fine adjustments, but I understand there may be a firmware update that helps with this issue, so I am crossing my fingers.The night-scene mode is great for those cityscape and dusk shots. I really love the fact that I can shoot in RAW (however, I still have yet to work alot with RAW images), because, as my wife says I \"just can't leave the image alone\" prior to printing. The panoramic mode that can be used with Olympus cards is neat and does a good job stitching in-camera, but some scenes can cause a portion of the stitched image to skew quite a bit, requireing a re-do.One drawback is the fact that it will only take xD Picture cards, but this I can live with as well. The Olympus \"color\" I have come to love is still present and so far, my prints from my HP Photosmart C-7180 look phenomonal!I am giving it 5 stars, not due to it being perfect, but for perfectly satisfying all my primary reqquirements, for the overall cost, and then some. This camera will be a perfect carry-along P&S; camera before I break down and get a DSLR to extend my photographic capabilities.", "Date": "June 10, 2008"}, {"Title": "not durable, not reliable", "Author": "Marko Bogovic", "ReviewID": "R3QMPAX7Q4UDKS", "Overall": "1.0", "Content": "Very, very good camera while it was working.Unfortunately, it just died without celebrating its second birthday, and with 200 US repair charge, my guess us by by Olympus cameras, hello Canon and others.", "Date": "June 9, 2008"}, {"Title": "Flexible yet superbly easy to use, only weakness is low-light color noise", "Author": "James J. Horning \"Jim H.\"", "ReviewID": "RGMOF46521XHS", "Overall": "4.0", "Content": "Hands down, this is the most flexible of the dozen or so (film and digital) cameras that I have owned.But it is also the easiest to use over a wide variety of situations.  And the 20x optical zoom is just amazing, equivalent of 26mm to 520mm on a classical 35mm camera.  For 3-megapixel shots, there's a 30x \"soft zoom\" mode that combines 1.5x digital zoom with the optical zoom, without loss of resolution.The one downside is that the small (1/2.33\") sensor does exhibit quite a bit of color noise in low-light situations.  To be fair, it takes usable pictures in lighting, and at distances, where none of my previous cameras would have gotten anything at all.Turn the mode dial to Auto, and you have the consummate point and shoot camera.  The things you need to master to take good snapshots in most situations are: taking off the lens cap, turning on the power switch, pointing the camera, and pressing the shutter button.From there, you can mix and match other features and controls wherever your photographic needs, sophistication, and interests take you.  One button to enable the flash.  One ring to control the zoom.  One switch for manual focus.  Program, Aperture, or Shutter priority modes.  Exposure compensation.  Over 20 specialized \"scene\" modes, such as Portrait, Smile Shot, Fireworks, Candlelight, ... One button to switch to Macro or SuperMacro (1cm) focusing.Flash metering is through the lens and there is a hot shoe that interfaces with external Olympus flashes for TTL metering, which seems quite accurate.The camera has enough buttons (and a multi-purpose \"setting\" dial) to provide an efficient interface for all the common controls an advanced amateur is likely to want.  And it also provides a very general menu interface that provides direct control of even more camera parameters for users who need it, without having to remember which button controls what.  Exposure and flash exposure compensation.  Bracketing (3 or 5 shots, with 0.3, 0.7, or 1.0 steps).  Drive: single shot, bracket, continuous, high speed (13.5 frames/sec.), time lapse.  Sharpness, contrast, and saturation adjustment.  Metering \"intelligent,\" spot, or area mode.  Autofocus face, \"intelligent,\" spot, or area mode.  Fulltime or predictive auto-focus.  And so on.An Olympus feature I like is MyMode, where I can pre-establish four combinations of settings that I expect to use a lot, and get to them just by selecting one of my four modes.No wonder the \"Quick Start Guide\" is 100 pages.NB: Don't be fooled: The $10.00 \"Instruction Manual\" that can be purchased separately from Olympus is just the \"Quick Start Guide\" in plastic covers.  There does not seem to be ANY official source for the rest of the information an owner might want.Shooting pictures at 5 megapixels, image quality under all conditions seems to meet or exceed that of my older Olympus C-750.  (And it's dramatically better in every single dimension than the Olympus C-2100 I reviewed back in 2001.)  I expect to be able to crop pictures normally and still make 8\"x10\" prints without any visible digital artifacts.  As with all my digital cameras, I'll use Photoshop to fix up pictures to my taste; I've played with, but don't expect to seriously use, the 570UZ's in-camera editing facilities.Oh, yes, the 570UZ is also a pretty decent little camcorder.  Just turn the mode dial to Video, and you can shoot videos at VGA (640x480) or qVGA (320x240) resolution at either 15 or 30 frames per second.  Everything the Flip Video Ultra Series Camcorder can do, in a package that's only a little larger, with 20x optical instead of 2x digital zoom, and only one button you have to understand.  But with the potential of using most of the camera controls described above, if you want to.  Because it records to a flash memory card (and the maximum xD card is 2GB), video chews up memory pretty fast: Less than 19 minutes/2GB at full resolution and frame rate, just over 50 minutes/2GB at minimum res and rate.", "Date": "June 6, 2008"}, {"Title": "firmware update", "Author": "Eric -K- \"California\"", "ReviewID": "R3ODWB55FULAZJ", "Overall": "5.0", "Content": "Just got the camera last week.  Seems like it will be all it says it is and more.  Just a quick note for anyone concerned about zoom lag.  If you install the Olympus software that came with the camera on your computer you can access firmware updates for the camera.  Olympus has very recently done a firmware update that added a language and improves the zoom response on the camera.  Zoom response seems improved since I updated my camera.", "Date": "July 13, 2008"}, {"Title": "Compact and Comfortable", "Author": "Joel M. Colman", "ReviewID": "R3MGA3SB8VBIAF", "Overall": "4.0", "Content": "My Sony F828 was stolen, and I was looking for a replacement.  Having used  the SP-570uz for a bit, I am pleased with the camera.  Before purchasing I was aware of the operation of the zoom lens being a little spongy - it doesn't have the same professional feeling that the Sony has.  I have never used the Xd memory card before, and wished Olympus would use the SD card.  Still, having hundred's of pics avaliable on a 2mb card is plenty for me.My needs were to have a compact camera that can take great shots indoors.  These super zoom camera's are pretty good, but not all of them have a hot shoe, which was the deal killer for my needs.Holding the camera is a pleasure.  You might be surprised how comfortable it is to hold.In addition, the wide lens is a great feature.The lens cap does come off pretty easily.I think these companies that are producing these super zoom camera's are hitting a sweet spot for people like me, who do not want to spend over $1000 on a camera with a quality len's, but don't want to use a super compact camera because of its obvious limitations.  I carry a Canon SD450 all the time, and enjoy that camera too.I believe most of these super zoom camera's can take wonderful day-time outdoor pics, but I need a camera that can attach an external flash for all the indoor pics I take.Everyone has their specific requirements, and this camera fit mine.", "Date": "May 8, 2008"}, {"Title": "Little Things Ruin It", "Author": "Lowell Prescott", "ReviewID": "RZ7MKEXH0V4M8", "Overall": "2.0", "Content": "I've read so many good things about this camera that I almost hate to be a detractor. But as a hard-shooting amateur, I find this camera frustrating in so many ways that I'm already seeking a replacement after just a few months.Some of the big things are OK (build, weight, menu structure, view finder, LCD, battery life, memory) but some of the biggest things are not (auto-focus speed and accuracy, image stabilization, lens, menu defaults, controls, zoom). But even if you can live with some of the subjective choices made by Olympus on the big things, their choices on many of the little things are pretty frustrating.The bottom line:- I frequently miss shots with this camera.- I frequently get blurry pictures across many lighting conditions.- Even when I get the shot, the images, while not terrible, are sub-standard in many ways (and I don't think this is a subjective read on my part, nor do I think I have a defective unit).This is not my first Olympus UZ. That was the Olympus C-2100 2MP Digital Camera w/ 10x Optical Zoom, with which I took about 16,000 pictures over the last 6 1/2 years. That camera was a pioneer in the UZ category, featuring 10X optical zoom (100X digital), the earliest image stabilization and a fabulous lens made by Canon. Its only real downside was the 2.1MP resolution (which was at the low end even as it was introduced). Mine ultimately developed some dead pixels on the sensor which led me into a very quick search for a replacement.I'd had such good luck with the Olympus, that I didn't even consider other brands. After reading a handful of reviews which labeled this camera the best of its class, I didn't even hesitate. I assumed that time had improved most of the features, and that the learning curve would be fairly small. The latter proved true, the former did not.At 10MP, resolution is not an issue. The ability to save RAW and JPG simultaneously is fabulous, though slow (I don't use it regularly). The view finder and LCD are great. Battery life (with hybrid rechargeables and a few tweaks to the default settings) is superb. Some people complain about the menu structure, but there are a lot of features on this camera. I think the menu structure is pretty good. And this camera does feel good in the hand. The built-in flash is also much more usable than the one in its predecessor.That's where the good ends.The first questionable thing I noticed is that the camera was making unexpected decisions on which portion of the frame to use for auto-focusing. These decisions were not good. I have a whole bunch of early shots with some arbitrary element of the shot -- often far from the center -- in focus while everything else is fuzzy. This turns out to be a \"feature\" called \"iESP\" mode in which, according to the manual, \"The camera determines which subject within the screen to focus on.\" I quickly disabled it in favor of the \"spot\" mode (center of the frame gets the focus). There are additional modes available, and though I realize there will be times when iESP is a usable feature, it simply should not be the default.This also turns out to be the first of several senseless defaults that I discovered as I worked through the menus. These include:- Movies default to recording without sound.- The \"record view\" (which shows each picture for a second or two immediately after taking it) defaults to ON, but also defaults to the LCD screen even if you're using the viewfinder, rendering it virtually useless. By the time you get the camera away from your eye to view the captured image, it's gone.- When using the viewfinder, by default the control panel is visible on the LCD. Unless you change settings frequently, this is a needless drain on the batteries.Once I got the auto-focus mode changed, that's when I began to realize just how poor it is. It's slow, frequently inaccurate, and performs especially poorly in anything other than direct sunlight. On my previous Olympus, I had become accustomed to a quick and perfect focus every time. With the 570, it sometimes takes three or four tries before it can focus, and it almost requires a hard edge somewhere within the AF target mark. This may help explain why iESP is the default: it allows the camera to search for hard edges in the frame and use those to get a quicker focus lock. Unfortunately, it also means weird auto-focus decisions.I appreciate the extended zoom range of this camera, especially at the wide angle end. But this comes with serious trade-offs.First, the lens has some serious pin-cushioning problems which even zooming cannot completely alleviate. I often have to use my camera to take pictures of images in square frames. This camera makes that an especially difficult task.Second, at the telephoto end, autofocus becomes a painful problem. I also take lots of pictures from the stands at baseball games, and this camera performs very poorly in that type of setting. Even worse, the image stabilization is of very little help. In my previous Olympus camera, handheld was always an option -- even at the 100X end. With this, even a tripod cannot guarantee that the image you see in the view finder will be the image you get. The simple act of pressing the shutter button is often enough to make it reset, which is very frustrating.These problems render the optional digital zoom portion as essentially worthless. When all is said and done, the usable telephoto zoom on this camera is about the same as the earlier model (though there is definitely more useful range at the wide angle end if you can live with the pin-cushioning).You will see mention in almost every review of the zoom ring on the lens. Most reviewers dismiss it as \"not too bad.\" I have to disagree. It's very, very bad in design and implementation.Some photographers may be able to adjust to its quirks, but I find them simply unacceptable. First and foremost, the zoom does not respond exactly to the turning of the ring. Sometimes it stops before you stop moving your hand, other times it continues zooming after you have stopped moving your hand. Moving it slowly sometimes results in a slower zoom, but the threshold between slow and fast zooming is hard to find. It is possible to move the ring and get no change whatsoever in the zoom. As a result, accuracy with the zoom is nearly impossible.Though the concept is a throwback to the old SLRs of my childhood, the more modern alternative (a small lever near the shutter release which can be operated by the index finger of your shooting hand) is far superior. The ring on the 570 essentially forces the use of two hands, and even then cripples your ability to frame a shot as you wish on the fly.And finally, the zoom ring turns the wrong direction. Counter-clockwise zooms in, clockwise zooms out. I am forever getting this wrong -- another reason for missing shots.This last piece, the direction to turn the control, is just one of many annoying smaller things found in this camera. Among these are:- You must remove the lens cap when the camera is powered on. I prefer to leave the power on with the lens cap on, then just slip the lens cap off when I'm ready to shoot. That's not possible with this camera.- If you forget to take the lens cap off, you get an error message, the camera locks up, and you must cycle the power off and on. At a minimum, this triples the boot-up time.- The edge of the lens cap is very close to the surface of the lens. Finger smudges on the lens have become a very real and common problem.- There are some very subtle differences between the \"P\" mode and the \"Auto\" mode of shooting -- limitations which you may not realize until you look at the pictures later (I used \"P\" initially, then switched to \"Auto\" when I discovered some subtle improvements to the results).- The so-called \"smile detector\" feature is worthless. Don't buy this camera for that. It just plain doesn't work unless all the conditions are perfect (a rarity).- The camera sounds are LOUD, even at their quietest setting. The alternative, \"silent mode\", is so quiet that you can't tell when the shutter has snapped.- The shutter snap sound is artificial, and there is no tactile sense that the shutter has snapped. The older Olympus had a soft mechanical click, and it was essential. Over time, this -- along with shutter lag -- have served to differentiate between the professional DSLR class and the amateur UltraZoom. There is no question that this camera is aimed at amateurs (and not even at a \"prosumer\" class user).- When reviewing photos, they are displayed in either the viewfinder or on the LCD based on which you were using to take photos. Viewing pictures is difficult in the viewfinder, and there should be an option to specify that the LCD is always used for reviewing. But there is no such setting.Finally, when you get used to all of the quirks on this camera and get ready to take a family picture, you will discover that this camera does not support the use of a remote control. There is a time delay shutter release, but that's just not the same.If I had known this, I would not have purchased this camera.I suppose that none of these things would be deal-breakers if the image quality was as exceptional as I have become used to with Olympus cameras. But I find the images soft and the colors somewhat wan. I came to discover that there are various menu settings which allow these characteristics to be adjusted (picture mode, sharpness, contrast, and saturation), but that seems ridiculous to me. I want crisp images and accurate colors. That should be the default (and only) option on the camera. Even after I have adjusted these settings at great length, the image quality remains quite flat.An additional frustration does creep in with regard to the menus. Though I find their organization to be quite easy to navigate, I find myself frustrated because certain menu options are unavailable based on mode settings. For example, I don't understand why the \"Camera Menu\" is grayed out and unavailable when the camera is in \"Auto\" mode.If you are drawn to this camera for some of the gimmicky features I have not mentioned, I recommend that you think twice. Yes, there are lots of scene modes and image preview/editing options, as well as extensive bracketing and shooting parameters to adjust. But I consider these to be mainly toys, and I do not use them. If you are shooting portraits in a studio somewhere, such nuanced options may come in handy (but you probably wouldn't want an ultra-zoom in such a setting anyway). If you are taking pictures out in the real world, there is just not enough time to decide on and set the correct scene mode before you snap.Two final things: First, the camera contains some internal memory which allows you to take pictures without using the optional xD memory card. But be careful not to lose the USB cable which comes with the camera. The camera-end connector is not standard, and without that cable there is no way to offload those pictures. (I found this out the hard way.) Second, though the quality of video clips is acceptable, the zoom range is severely hobbled when in the video mode. Full-range zoom is not possible when shooting videos.As you can tell, the SP-570UZ has been a disappointment to me almost from the moment it came out of the box. It may be that this is truly the best camera currently available in this class, but if that is the case, the class has regressed since the C-2100UZ was released in 2001. That would be a shame.*** UPDATE January 2010 ***I've been using this camera for 18 months and I absolutely hate it. But let me correct a few small things from the review.1. Even though I eventually found the USB cord, I also discovered that it's possible to \"back up\" photos stored internally to the xD card. Clunky, but it works.2. Out of frustration with image quality, I began experimenting more systematically with the scene modes. They are uniformly worthless, and the difference in results between them is almost laughably invisible.3. Battery life has turned out to be excellent. It's a cold comfort.4. Because of poor performance in anything other than direct sunlight, I tend to avoid cloudy days and use the flash much more often. No camera should make you want to do either of these things. The results remain quite disappointing.5. Video quality is especially poor. There's also a weird limitation on zooming. It appears to be only digital, and as you zoom in, the picture degrades very quickly. It's nice to have no arbitrary time limit on video length, but when the quality is this bad, using it for that purpose should be avoided. (My cheap, Flip-style camcorder gets WAY better results.)For now I'm stuck with this dog while saving up for something better (a D90 perhaps).", "Date": "October 20, 2008"}, {"Title": "Excellent, unique image maker", "Author": "David Allen Holmes", "ReviewID": "R1PNLEYI44CENK", "Overall": "4.0", "Content": "Oly's SP-570 is a unique camera. If a person is looking for a \"move-up\" camera from a simple \"point 'n' shoot\" this may not be the one. Nor is it a replacement for a dslr. It is in a class by itself, and takes some getting used to. However, once one gets into the \"learning curve,\" this camera becomes a powerful tool.Image quality is typically Olympus - excellent, with great color reproduction. A caution: this is a small sensor camera. While it will go high ISO, images get noisy beyond ISO 400 - useful, but noisier than a dslr.Menus: This is a very complete camera. It has all the controls of a dslr, plus many more. This can be a little confusing to someone not familiar with all this. The menus are clear enough if one spends time with the camera AND the manual. (Reading the manual with this camera is a must)!General handling: While this is not a \"pocket camera,\" it is quite compact, fits very nicely in the hand, and has the controls very well located.Speed and battery performance: Curiously, the type of battery seems to affect overall performance. I began with simple NiMh rechargeable batteries. Performance improved considerably when I put in new hybrid batteries! Focus speed is a little slower than one might be used to. This is reasonable given the huge range of the lens. Some complain that it won't keep up with fast-moving subjects, however, there are focus settings that help alot.It is well within acceptable speed.Overall, this is a great creative tool, and a super \"walking around\" or travel camera for someone with a little camera knowledge and a little patience to learn. Its flexibility is outstanding, something that is enhanced by the ability to use flash other than the built-in.", "Date": "June 18, 2008"}, {"Title": "An excellent value", "Author": "yarn momma", "ReviewID": "R2R91HLEVN2DFE", "Overall": "5.0", "Content": "I just received this camera yesterday, and haven't had time to check out all the bells and whistles on it, but I am in love.  I admit, I've never had a superzoom or dslr before, and have not purchased any digital recently, but this camera has more features than my old computer!  I've played with zoom and macro and love them...I can literally touch my target in supermacro, and still get focus.  I prefer the manual zoom (20x optical! what a dream!) on the 570, as it's easier to control. My research has shown that for many superzoom cameras, the powerzooms are harder to control, and on those that have high and low speed zooms, the low speed tends to break down rather quickly.  Not to mention, this increases the battery life, and is one less thing to break!It's comfortable to hold, not too heavy or lightweight, and the grips are such that even a sweaty hand won't slip. The tripod mount is metal, a nice plus, but you do have to be careful that the pad on the tripod doesn't get in the way of your zoom control. I am thrilled with what I've seen so far, I love the control and the ability to go everywhere from total AF to MF. The color quality is great, too.'ve been using an ancient (film) slr camera for years, with piles of extra lenses (2x converter, 80-200 lens, standard lense, macro filters, etc) and this does all of that, w/o the extra pieces.I strongly recommend this 570 to anyone who wants more than a point and shoot, but isn't ready to spend $1000's on camera \"boxes\" and lenses.", "Date": "May 14, 2008"}, {"Title": "GREAT CAMERA FOR ARTIST", "Author": "RVHART.COM \"ROB\"", "ReviewID": "R15EIGFXSOYE12", "Overall": "5.0", "Content": "I AM AN ARTIST THAT OIL PAINTS. I USE THIS CAMERA TO SHOOT PICTURES OF MY ART WORK FOR TEACHING AND FINAL PUBLICATION ON WEBSITES. THE CAMERA IS PERFECT WITH THE 10 MEGAPIXEL RESOLUTION AND ZOOM LENS. IM NOT A CAMERA EXPERT BUT IT HAS NOT TAKEN ME LONG  TO LEARN THIS CAMERA. VERY USER FRIENDLY! ONE FEATURE THAT IS CRITICAL FOR ME IS THE IMAGE STABILIZATION!! I HAVE TREMOR IN MY LEFT SIDE AND HAND DUE TO PARKINSON'S, THIS CAMERA HAS MADE IT POSSIBLE FOR ME TO TAKE FREE HANDED SHOOTS AGAIN. I WAS TRIPOD BOUND BEFORE! THANK YOU OLYMPUS, GREAT CAMERA.", "Date": "July 7, 2008"}, {"Title": "Amazing camera", "Author": "Miroslav Rybar \"Miro\"", "ReviewID": "R23NMB5HJ204AP", "Overall": "5.0", "Content": "I went from a 5mp point and shoot camera to this Olympus and i was amazed. I thought my pictures looked good on the 5mp, but this takes amazing pictures. You can take a picture of a rock and it'll turn out looking very professional. Very easy to use, more options then you'll ever need. I usually shoot pics. in auto mode and they always turn out great, i can't imagine what someone who knows what they're doing with all the rest of these setting can do. Instead of a button for zoom this has a zoom ring, which i was a little skeptical about when i ordered it, but once i got to use it i noticed how much better control it gives you over the zoom. Wide angle option is great, 20X zoom is amazing and the picture quality of 10mp is great as well. The camera itself has a nice heavier feel to it, grip is super comfortable. Overall it feels like it's very well made. I used to think $400-$500 for a camera was expensive but, this Olympus changed my mind, the pics. you can take with this is well worth couple hundred buck. I'm extremely happy with this purchase and would recommend this to everyone.", "Date": "June 26, 2008"}, {"Title": "Awesome camera with a few weak points.", "Author": "David Bygott", "ReviewID": "R1JICLVKMO3Q4X", "Overall": "4.0", "Content": "I bought this camera because I wanted one lightweight camera that would do everything - wide angle, long tele and macro - when I was hiking in Costa Rica and photographing nature.It did the job. It's nice to hold and has a solid feel to it. That awesome lens is quite sharp at all positions and I've got some very nice pics with it. The image stabilizer is very useful. I'm still learning, and there's a lot to learn. My main criticisms are as follows:1) I find it hard to tell whether my subject is truly in focus. As I'm over  40 my arms are too short for me to be able to see the rear monitor clearly, so I mostly use the viewfinder, and its image quality is very crude.2) I find it very difficult to track and photograph moving objects like birds - response both of viewfinder and of shutter is disappointingly slow.3) On the Macro setting there's a \"grey area\" between about 6' and 6\" where finding the right combination of distance and zoom is very hit or miss. While you're fussing with that, your subject, if a small animal at close range, has generally fled. Probably this gets easier to estimate with time.4) Camera doesn't seem to allow use of built-in flash with Super-Macro - probably because you'd get a lens shadow.5) Camera really chews up batteries, many days I exhausted 2 sets a day.Apart from these quibbles, I strongly recommend this camera.", "Date": "June 17, 2008"}, {"Title": "Great camera with some limitations", "Author": "D. Jensen \"snake man\"", "ReviewID": "R1X018WPV30TY2", "Overall": "4.0", "Content": "I was a big Olympus fan back in the days of film, but switched to other brands when digital came along. I bought my 570UZ for a photo safari in Kenya. I no longer care to haul all the lenses that are necessary to shoot a wide range of subjects with an SLR.My 570 performed well under most conditions, but fell short in low-light scenarios (too much noise), and resulted in some shots being too soft. In one instance, the camera couldn't focus at all on a patch of flowers with sunlight on them. Still, I got excellent results with most shots, and with 10 megapixel quality, was able to enlarge them to 16X20 without excessive pixelation.Start-up time is good, response time is OK (better with an H card), and the scene modes make it very easy to get the right exposure for a specific condition such as sunsets, etc. There is even a mode for shooting through glass, which works great at the zoo. For serious photographers, the camera has a hot shoe for attaching an external flash.All things considered, I would recommend this camera to anyone who doesn't want the expense or hassle of buying or carrying a DSLR.", "Date": "August 24, 2008"}, {"Title": "Good value, excellent camera", "Author": "Viking", "ReviewID": "R1UXBEL30TMBJC", "Overall": "4.0", "Content": "I bought this camera primarily as an upgrade to bring for traveling. I didn't want the bulk of having to carry around the extra lenses of an SLR, but needed more features than most point and shoot have.  This camera was a perfect match for my needs.  I've had this camera for two months now and have taken numerous pictures with it. My only two complaints are the XD memory (needlessly more expensive alternative to SD) that it requires and the fact that the auto-zoom isn't as good as it could be.  I love the range that the built in lens has and the amount of manual adjustment that is available.  It will even shoot in Raw.", "Date": "June 27, 2008"}, {"Title": "Great camera - few shortcomings", "Author": "Happy retiree \"MRF\"", "ReviewID": "R3Q1BPXK6UM8WS", "Overall": "4.0", "Content": "I upgraded from Olympus C-750UZ (4 MP, 10X zoom) to SP-570UZ.  Features I wanted were longer zoom, higher MP, zoom ring (selectable as manual focus ring), and continued full manual control.  I immediately installed an Olympus website firmware update to smooth the zoom ring operation.  I'm using 2 GB M+ xD card which saves large photo files quickly enough.  With added experience, the many control buttons/switches/rings seem logical enough.I was surprised at the difference in the widest zoom settings - the SP-570 takes in much more width for landscapes.  It also has a fantastic panorama stitch option I've used in landscape shots.I'm also impressed with the image stabilization which has allowed hand-held 20X zoom photos of the full moon that were surprisingly clear.  I bought the CLA-10 extension tube so I could use the 55mm polarizing filter I used on the C-750.  This has resulted in severe vignetting when trying to shoot at the widest zoom setting.Since most of my photos are taken with at least some manual control, I have not yet sampled all of the scene settings.  There are a lot to choose from.I expected the battery life before recharging to be longer, so I'm hoping some new more powerful rechargables will provide a remedy.  I have not yet been able to find a way to change the brightness intensity of the electronic viewfinder which consistently displays the subjects much brighter than the resulting photos.  I've learned to compensate for this, but a brightness setting would be better.All in all, this camera provides great flexibility and user control in a wide variety of photo taking opportunities.  I'd definitely recommend it if you want something more than an automatic point and shoot but don't want to carry all the lenses required in a DSLR.", "Date": "August 25, 2008"}, {"Title": "Almost perfect", "Author": "G. J. Del Parellada \"Tinglao\"", "ReviewID": "R1D1LHFFX7SFRF", "Overall": "4.0", "Content": "The camera has an impressive optical, the zoom ring is very practical, the stabilizer works nice, fantastic LCD monitor, the viewfinder is very good compared with other cameras (Fuji, Canon, Lumix), lots of scene modes that works great, massive sequential shooting, the hot shoe...Things I dislike: lots of buttoms (the use of this camera isn't very intuitive), the length of the video recordings, with sound isn't possible to use the zoom when you are recording a video...", "Date": "May 27, 2008"}, {"Title": "For a SNAPSHOT camera, this is excellent", "Author": "G. Lambert", "ReviewID": "R6M5KCPPT8Y5K", "Overall": "4.0", "Content": "I stress, for a SNAPSHOT camera, this is a great camera. It is absolutely no replacement for a quality DSLR. The DPI difference between the 2 is extreme. My Nikon D70 has 300 DPI, my SP-570U has 72 DPI.The shutter lag is not to bad. The zoom and vibration reduction are most excellent. The 13 fps (in 3MEG mode) is extraordinary. One big downside is how long it takes to write the RAW images to the memory card, but again, it's a SNAPSHOT camera.It's compact and easy to carry with me wherever I go. That and the zoom were the main reasons I purchased it. If I would've realized that the DPI was limited to 72 then I would've checked out the Nikon Coolpix P80.I've only had the camera 2 weeks, I could take it back and check out the coolpix but alas I'm happy with the Olympus. It's a decent camera for what it is. Again, don't think you're going to get DSLR quality with this camera, but for snapshot quality photos it's an excellent product.", "Date": "May 13, 2008"}, {"Title": "Olympus SP-570UZ", "Author": "W. Svendsen", "ReviewID": "RSA8BKWWSS70V", "Overall": "5.0", "Content": "By far, the best camera I've ever owned. It takes amazing pictures & it is easy to use. Quick start up & it doesn't seem to consume batteries as much as my previous digital camera did.", "Date": "July 26, 2008"}, {"Title": "My spouse keeps taking it", "Author": "Clare Fairchild", "ReviewID": "R3PPZI42G11KLU", "Overall": "5.0", "Content": "I've used an Olympus for several years but haven't found one until now that could compete with my original 5 megapixel in the C700 series --of which I've worn out four.It seems clear that Olympus engineers have killed themselves to make every possible improvement to this lovely camera: the feel, the extended power lens, the careful amount of indoor flash, the many options for scenes, all with the clarity Olympus is famous for. As usual, the camera takes better photos than I even think I'm getting. The big problem is that my spouse, who carries a big bazooka Canon lens, can't keep his hands off this new camera of mine--which actually can take longer telephoto shots than his. Only one design problem remains: the lens cap still won't stay on. Also, my old C-765 can take a great shot of the moon without a tripod, but so far I haven't been able to point and shoot at the moon with this one.", "Date": "August 21, 2008"}, {"Title": "Overall a great digital camera.", "Author": "Wayne Walsh \"W.flyfisher\"", "ReviewID": "R3DUIOSUSKYRXW", "Overall": "4.0", "Content": "I purchased this camera for taking still photos so was not concerned with video. On a recent trip to Alaska I used this camera to take pictures of nature scenes, wildlife, and just general pictures. It performed beautifully. The pictures were extremely clear and sharp even when using the digital zoom ranges. I did encounter some issues with the automatic focus not wanting to lock on distant objects but should be able to resolve this once I get used to using the manual focus feature. The one feature of this camera I would like to see changed is the picture card. For myself I have used cameras in the past which use XD cards so I already had the capability to utilize them. I would have preferred it if the camera used the more universal SD cards. Other than that I have been very satisfied with my purchase.", "Date": "July 14, 2008"}, {"Title": "Great All Around Camera", "Author": "Gadget Guy", "ReviewID": "R2CU7YOKR5P198", "Overall": "4.0", "Content": "I've been the owner of many digital cameras (currently have a D40, Fujifilm F30 as well) and have always wanted the convenience and novelty of a superzoom.  What sold me on the Olympus was the wide angle which helps more than people realize. I do wish it had a tilting LCD but everything else is there.  In terms of what could have been done better, the zoom action is handled via a lens ring but it's not mechanical - so you get zoom lag which is probably the most annoying thing about the camera.  I can accept the slower focus and responsiveness of the camera compared to DSLRs but the zoom lag is a problem that's been difficult to get used to.  Battery life is good - I went for a week shooting 300+ pictures before a recharge. The rest of the camera is comparable to others in the field.  If you want the fun of a superzoom and could use a wide angle for landscape and interior shots - this is you camera.", "Date": "July 12, 2008"}, {"Title": "My First Digital Camera", "Author": "Jeffery J. Lovejoy", "ReviewID": "R2J2GIP157JL39", "Overall": "5.0", "Content": "Eventually, digital photography will offer the same quality as film, but until that happens this camera is the perfect compromise for a film guy getting into digital. Nobody needs to explain the concept of \"optical stabilization\" to a film guy, and this camera has it. Also, this fully automatic camera can go to fully manual with just the touch of a buttom. There's enough megapixels (10), to statisfy a film guy's need for \"acceptable quality\". But someday, there will be a digital camera with 26 to 28 megapixels . . . .Please Note: If you buy this Olympus camera buy the Olympus flash (FL-50R). The two were made for each other. And, with a telephoto lens the built-in flash is not sufficient.", "Date": "March 2, 2009"}, {"Title": "Amazing camera, perfect for a low-budget enthusiast.", "Author": "Forest Jarvis", "ReviewID": "R3L0AABWUPHZ7V", "Overall": "5.0", "Content": "Pros: Amazing zoom (equivalent to 26-520mm), 10 mp, can alter with aperture and shutter speed, 13.5 fps sequential shooting, high ISO, large LCD, a lot of SLR-level features, zoom ring, comfortable to hold, excellent super macro, multi fireworks mode.Cons: xD memory card, can be very, very slow when using flash, has difficulty focusing at times, unpredictable with focus, small aperture range (predictable for a non-SLR, I suppose). I'm going to have to disagree with most of the other reviewers and say that I like the feel of the zoom ring, and I haven't had any problems with unpredictability-- indeed, I find it much more accurate than electronic, W-T style (manual) zoom.For anyone doubting the 20x zoom, the equivalent of 500mm, I have to point out that so far I have seen only one other point-and-shoot camera with the same zoom capabilities; and to get the same level of magnification in an SLR, one would have to shell out nearly $1000 for a decent lens. On the other end of the spectrum, the wide-angle is spectacular, and the macro and super macro modes are superior to any other camera I have used; I can produce crystal-clear images with the lens literally touching the object. Unfortunately, the camera can be very finnicky with the focus, mostly with close-up shots; I often have to take 5 or more pictures of the same object in order for the camera to focus correctly.I like both the sequential shooting and \"shoot and select\" options, and they produce focused, sharp images, although at a reduced resolution of 3 MP. The fastest options are far faster than those of most SLRs.The ISO is very useful, although the noise can be unbearable at times. However, at times when the slow flash reaction is a problem, pictures using the maximum ISO (6400) are a definite alternative, and I find the effects colored lighting produces with high ISO are very attractive.Both the shutter speed and aperture can be fiddled with, for creative options. One problem is that the aperture cannot go above f/8.0, due to the small lens. Therefore, a shutter speed above 1/500 is not feasible in most circumstances.I also have fun with the \"multi fireworks\" mode in the scene options, which allows me to take multiple exposures in the same image. The Panorama option is also very useful (however, a tip to users: \"combine in camera 2\" produces far smoother results).Some reviewers have mentioned the weight of the camera, but I don't find that an issue. It is light enough not to be an inconvenience, but large enough to feel comfortable in my hands. The only issue is that the zoom ring means I have to use both hands to use the camera effectively.The battery life is very impressive, especially for AA batteries- I can fill up a 2-GB card sometimes twice before having to change batteries.The major disadvantage to the camera is the huge amount of time it can take to take pictures when using the flash- I sometimes have to wait of 6 seconds for the flash to fire, and occasionally the focus is off. This can be bothersome when taking posed pictures or low-light action shots. However, like all troubles, I learn to deal with this; you just have to get to know the camera. The slowness is what many people have complained abut, but it's not as big a deal as they may make it out to be.The other major problem is that it requires an xD picture card, which as of now cannot store more than 2 GB, or a little over 800 10-MP pictures. For someone like me, who can take that many pictures in less than a day, this can be a problem.Overall, however, the camera is perfect for someone with a tight budget who wants to take SLR-level pictures. Despite the drawbacks, the camera has is capable of some phenomenal pictures, and, as with all cameras, the results depend on the person behind the camera.", "Date": "January 4, 2009"}, {"Title": "Great Camera!", "Author": "Chief", "ReviewID": "R3V3K6RBFT6VU3", "Overall": "5.0", "Content": "Thanks Amazon.  The camera arrived very quickly and was packed well.  Olympus is really on to something with this design.  This is a \"substancial\" camera which sets it apart from the crowd of superzooms.  When you pick it up, it feels and looks like a DSLR.  The camera is rather heavy which contributes to a secure feel.  The coating further adds to the handling and inspires confidence.  It seems sturdy and well built.  I really like the zoom ring on the lens.  The buttons are all well placed and easy to use on the fly once you learn their function and location.  At 10 megapixels, pictures are superb.  The auto focus works very well and rarely \"misses\".  I like the expanded screen which pops up when using manual focus but it is slightly \"jerky\" and takes an extra second or two to really get the focus spot on.  Reviewers have said that the menu is complex.  I don't agree.  I invested a little time navigating through the menu selections and working with the camera and found it to be logical and easy to use in practice.  The zoom range on this lens is incredible.  One would have to have a heavy bag full of expensive lenses to cover this range.  It will be interesting to see how this camera evolves and improves.  It's no doubt that refinements to this already great platform will be made.  A reduction of noise at higher ISO settings and smoothing out the manual focus assist screen would be nice.  Improvements in lens performance at the extreme end of the zoom range would be welcome.  The BEST camera is the one you actually use.  Not the one sitting in the closet because it is too heavy, bulky and complex.  Also, how often do people decide not to take the big camera bag along for fear it will get stolen?  I suspect that if DSLR owners \"discover\" this camera, especially as it evolves, many will find a place for it in their arsenal as a great \"grab and go\" performer.", "Date": "December 16, 2008"}, {"Title": "Olympic Camera", "Author": "Leah Andritz \"Leah\"", "ReviewID": "RO4B2MDGJQRBT", "Overall": "5.0", "Content": "I love this camera. I bought it for digital submissions of art work for my Advanced Placement Studio Art students and it takes wonderful images.", "Date": "October 30, 2008"}, {"Title": "A good replacement for an SLR", "Author": "R. Hoskins \"HealthMaps\"", "ReviewID": "R3QGZ467ZCC3UY", "Overall": "5.0", "Content": "I had my Canon XTi stollen. Very sad day. Loved it. But I needed a decent camera to take with me on a trip to SE Asia, and I had no time or money to research the new Canon XSi. SO I went with a review in some PC magazine and tried the Olympus SP-570UZ, especially appealing with Amazon's price. After about 2000 pictures, lots of experimenting, I am very happy with this camera. The image quality and sharpness is outstanding which is what I most require in any camera. Its long zoom (20x) results in very sharp, high quality images. Using it is pretty simple, but I encourage folks to learn how to use all the extra features. One has almost SLR control but there is also some simple settings and guides to just point and shoot photography. But more like, Think, point and shoot. If a SLR is out of your budget, or your need a second camera with your SLR, or would like to almost have an SLR but without the steep learning curve, this camera might work for you. This camera is definitely of the highest quality.", "Date": "October 22, 2008"}, {"Title": "Love it", "Author": "bill", "ReviewID": "R7U0FJN2MGDA3", "Overall": "5.0", "Content": "Olympus 202132 Nylon Carrying Case for Ultra Zoom Digital CamerasAs a novice/amateur and not an advanced enthusiast, I love this camera.Does not come w/ it's own case.  Consider the Olympus 202132.Got the SP-570UZ to replace my C-755 4MP 10X optical zoom used for family, friends, and annual trip to a Big Ten football game.  Generally sit 8 rows from field, and the old 10X was great, looking forward to the 20x this year.  Was very happy w/ my \"old\" C-755.Did side by side shot comparison.  The 570UZ at low/no zoom captures larger field or window than my C-755.  I prefer the manual 570UZ optical zoom to the C-755 motorized optical zoom, I find the manual zoom gives me more control, motor not as fine control when I try to go higher or lower, end up picking between two motor zoom points when I want an in between magnification on the C-755, the 570 manual zoom lets me put it right where I want it.And really love the image stabilization, which is really critical on close up full zooms which can be blurry if you don't have perfectly steady hands.Takes a high capacity & fast memory 2GB XD M+, holds 800 pictures, only have to transfer pictures I want, will probably never have to delete to get space.  The LCD viewer takes up a large amount of the back of the camera, very nice, LCD viewer has amazing resolution and color.Takes a good quality 30 minute video, w/ sound.  Video uses the digital zoom, not the optical zoom.  The digital zoom works quite well for the video.  I have not tried combining the digital zoom w/ the optical for still pictures, because of past experience that digital zoom was pretty negligable.  I understand digital zoom technology has gotten considerably better, so we'll see how well that works for still w/ optical.570 is physically larger than the C-755, but still compact enough for easy carry & fits the hand well (at least mine, I'm 6'2\").", "Date": "September 14, 2008"}, {"Title": "Jumped from Olympus C-750...", "Author": "Kate \"Kate\"", "ReviewID": "R34JHGUBGPLCI3", "Overall": "4.0", "Content": "I have had the C-750 for a few years, and have taken some great shots with it. I do a lot of landscape and wild critter shoots.Got the Olympus SP-570UZ as a gift last week, and have taken all kinds of shots, LOVE the macro and super macro, great portraits, and zoomed in on Elk across the valley like a charm.The only thing keeping me from giving this camera a 5 star rate, is the fact that I had a hard time zipping from subject to subject in the small manual, and would dearly love to have the manual on disk that the Olympus C-750 had.What I ended up doing is just getting the camera out, and pressing buttons, and looking at menus, (when I finally figured out how to get to them) and taking pix 'til I got the hang of it. I feel that there are SO MANY things I am still going to find out from this camera, and I have to say I do LOVE it!Olympus SP-570UZ 10MP Digital Camera with 20x Optical Dual Image Stabilized Zoom", "Date": "August 23, 2008"}, {"Title": "Best I have owned", "Author": "Harriet C. Forster", "ReviewID": "R3H77RIWTSCSC0", "Overall": "5.0", "Content": "All that I expected.  Little more complicated than I had anticipated.  Maybe in 6 more months I will explore all the of the many features.  What I really liked (as compared to older digital cameras) is the fast next shot availability.  I don't have to wait for seconds to go by.Picture quality at all zoom levels are great.", "Date": "August 9, 2008"}, {"Title": "A Really Nice Camera", "Author": "D. Patterson", "ReviewID": "R3OU8ZLRK9Y1TS", "Overall": "5.0", "Content": "This camera will do a lot more than I know how to do.  But the features I like the most are the 20X zoom lens and the Super Macro setting.  I take a lot of closeups for posting on eBay and this is the best camera I have ever used for that purpose.  The landscape feature is also nice and with this lens you can get some amazing shots at 10mp and fine resolution.  If you only want one camera to use for everything, this is the one that I would recommend.", "Date": "August 9, 2008"}, {"Title": "Great camera for a geat price", "Author": "Gbar", "ReviewID": "R2WALTOT7UZ4KW", "Overall": "5.0", "Content": "I got this camera because I am taking a digital photography class and I didnt want to spend 700 dollars on an SLR and this was one of the only cameras that all the requirements necessary. Ive played with the camera alot and love it. The zoom is great and the image stabilization works great even zoomed all the way in with optical and digital zoom(total 100X zoom). All the manual setting are easy to change and will be valuable for my class and any photograhper wanting that next step from a point and shoot. Overall surpassed my expectations and amazon also did a great job. Got the camera in perfect condition in only 3 day.", "Date": "August 2, 2008"}, {"Title": "Almost perfect", "Author": "James Rogers \"Leprechaun Jim\"", "ReviewID": "R38B53L350O1E5", "Overall": "5.0", "Content": "I bought the Olympus SP570 UZ from Amazon.com after trying to deal with people who offered great prices but tried to get what they could out of me.  I am checking Amazon first from now on.  I have had it for a month and after over 120 pictures, I am still on the batteries included with the camera.  I used it right out of the box in auto mode and am learning to use moree and more of the modes and options.  Based on pictures I have taken, I have a photo job lined up this evening.  You can't mount a filter on this camera without using a tube.  Since the camera does adjust to different lighting situations, you can get by without filters for most situations, not a big deal.  I've talked two friends into buying one already.  If you want an slr, this does have full manual yet if you just want to pop your camera up and get a shot, this will do it.", "Date": "July 19, 2008"}, {"Title": "amazing camera", "Author": "J. Gomes", "ReviewID": "R3H3TQ559KE5P0", "Overall": "5.0", "Content": "This camera takes great pictures in any type of light and has many of the features people look for in a point and shoot camera. This camera also has the added benifits of a full manual mode, great focal length and large display.", "Date": "June 16, 2008"}, {"Title": "Wonderful!", "Author": "ILGal", "ReviewID": "R3BSDH19K18LX8", "Overall": "4.0", "Content": "A lot of lens,as you'd expect. Good battery life. The wide-angle is great. This is an upgrade for me from the 500UZ.Fairly light (good for hiking!). If you turn the camera on with lens cap on, it makes you shut down and restart (annoying). 500UZ you could leave on and cap lens; this one, you can't. The focus ring takes some getting used to.", "Date": "June 15, 2008"}, {"Title": "Fantastic \"All-In-One\" Camera!", "Author": "Photo Dave", "ReviewID": "R1OFQUZ6GVWFY", "Overall": "5.0", "Content": "I have owned this camera for about 5 weeks, and have been quite impressed by its abilities to take everything from wide angle room shots, people close-ups, and even nature shots using the 520 mm (equivalent) telephoto.  I even bought the 1.7X telextender, and found it to give very good sharp images with equivalent of about 800 mm!  The camera is easy to use; it is fast focusing (slows a bit for dim subjects); and menu is very user-friendly.  Only drawbacks:  raw files take a bit of time to load; the XD card is not the ideal storage media, and only goes to 2 GB; and cannot be fired as fast as I would like using the higher resolution jpeg's.  My bottom line opinion:  this is as close to a professional or semi-professional DSLR as you can find in todays market!", "Date": "August 31, 2008"}, {"Title": "A REAL winner", "Author": "Hulan E. Whitehead", "ReviewID": "R3QW99N5FN93F4", "Overall": "5.0", "Content": "Reviews are nothing more than an end users opinion and personal experience with a product.In my opinion and personal experience, Olympus has a winner with the SP-570UZ, with an excellent 20X Optical Zoom, plus a TRUE Super Macro (.04\") close up.  I use both these features, now with ease and great success.  The PANORAMA feature is easy and fun to use. I find the SCENE feature most useful with many helpful options.I probably qualify as an advanced amateur photographer.Their Manual however, leaves a lot to be desired, with little to no cross referencing...often leaving you hanging to figure out what to do next. Even with these drawbacks....it was well worth this trial and error method of learning.  The body is almost identical to the Olympus E-520 SLR and I learned much more from the E-520's Manual than the SP-570's.I purchased my SP-570UZ on June 18, 2008. I have saved 1456 of over 2000, mainly nature pictures, taken on vacation in Western North Carolina and another 144 taken at a friends wedding.My only negative thoughts about this camera is it's manual.", "Date": "August 29, 2008"}, {"Title": "My Olympus SP-570UZ", "Author": "Ellis C", "ReviewID": "R3M65GJVRYYA03", "Overall": "4.0", "Content": "The camera is an easy to use point and shoot with a 20x Optical stabilized zoom. The clarity of the pictures taken with this camera is absolutely beautiful.  The zoom feature is nice, however, at times this manual feature doesn't respond quick enough when I'm attempting to take a picture of a moving image.  The other disappointing feature was that the camera uses 4 AA batteries, which were supplied. These batteries, however, fail to last for more than 20-30 pictures before they are \"emptied\".  In reading the instruction manual it is noted that use of special features such as the zoom and flash will tend to expend more than normal battery energy. Surprisingly, when I check the \"empty batteries\" with a battery tester they all showed in the \"Good\" range, but still failed to perform in the camera.  As recommended in the manual I acquired a charger and two packages of rechargable batteries, and to date it seems that this has resolved my problem.  I also own an Olympus Camedia compact camera, which came with a charger and rechargable battery, maybe Olympus should consider including a charger and a package of NiMH batteries with all of its cameras.Overall, however, I would consider this camera to be very durable and reliable and I am very happy with the product.", "Date": "May 30, 2008"}, {"Title": "Best Camera I have ever had", "Author": "KENNYBOP \"KENNYBOP\"", "ReviewID": "R2FLWVZXFP4OT2", "Overall": "5.0", "Content": "This camera does everything I want and need and is a super value for the money.  I do a lot of super Macro close ups and the quality of these pictures are excellent. With the rapid fire I am able to get good pictures(albeit at a lower resolution which is fine for snapshots) of our Grandaughter who is just learning to walk.  The dual image stablization and face recognition also helps with her pictures.  The 20x optical zoom is great for pictures of the deer, turkeys, raccoons and other animals that come into our yard.  Really the only downside is the relatively high price of the xD cards but that is a small factor in the total package.", "Date": "September 30, 2008"}, {"Title": "Love this Camera", "Author": "RowdyGirl", "ReviewID": "R3CL7ALULFZX8N", "Overall": "5.0", "Content": "I am not a professional but do a lot of photography and photo editing.  I have taken, what some say, are beautiful photos.  I bought this camera after researching for over a year. Reading reviews, opinions, watching for \"what's new\", etc.  I took the photos for my daughters wedding, a small private ceremony, and was blown away.  I had two days to 'play' with it.  One of the best I took was in the Candlelight mode.  You can take good or bad pictures with any camera. You need the eye and sometimes just more than one shot.  The continuous shot is great.  There are enough modes to use, and are explained well, that you could take pix for a long time just using them.  Love the feel, the weight, the zoom ring.  I don't understand the problem some have w/ the xd card.  I got a good price and can get hundreds of pix.  I will post some if my slow dial-up will allow.  Fantastic job Olympus.", "Date": "August 28, 2008"}, {"Title": "Awesome camera!!!", "Author": "Amazon Customer", "ReviewID": "RIEBMBGRR8QN", "Overall": "5.0", "Content": "This camera was definitely worth the money. I am very pleased with the camera and if I had to do it over again I would buy this camera again.  Definitely recommend this.  Good value for the money.", "Date": "July 29, 2008"}, {"Title": "just OK", "Author": "Aeacus", "ReviewID": "R321LEJB7BV9JV", "Overall": "3.0", "Content": "does what it is supposed to do, however pictures in mediocre light such as cloudy day are at best mediocre.  Some minor distortion in the lens visible only in some pictures.  All in all good camera with not so good lenses.", "Date": "September 1, 2013"}, {"Title": "Really loved this camera, It looked like a PRO", "Author": "bliss", "ReviewID": "REHRKTZ8M2MGW", "Overall": "5.0", "Content": "Having this camera made me feel like a pro.I would buy another one even though it is not HD.A great camera for outdoors.Produced rich green and blue colors, while preserving and enhancing skin tones.You can see samples of photography that was taken with this camera in my book on Amazon - get your copy hereAwesome Photography from Inexpensive CamerasVideo is not HD quality, hence blurry (This camera came out before HD became popular and available for consumer cameras).If you are going to use it indoors then please use a tripod.I have a few tips in my book here- get your copy.Awesome Photography from Inexpensive Cameras", "Date": "April 8, 2013"}, {"Title": "Solid camera", "Author": "Mike R", "ReviewID": "R3TX9M0YPBK2OS", "Overall": "5.0", "Content": "The camera takes very good pictures.  It is packed with many features of an DSLR.  Because, it has so many features that you have to go through layers of the menu to get to some of them, but this is typical for compact cameras.  The camera is easy to hold and light weight.", "Date": "March 22, 2013"}, {"Title": "Lacks", "Author": "R. Springer \"Watercolor lover\"", "ReviewID": "R3SZBUT8PCU94E", "Overall": "3.0", "Content": "MManual zoom is difficult to use, no smooth to adjust. Photos not as clear as I had been used to in the 550UZ.", "Date": "January 6, 2013"}, {"Title": "The Everything DSLR", "Author": "Darrell L. Bubb", "ReviewID": "R18IPA4864R9OM", "Overall": "5.0", "Content": "This camera practically does everything for you, yet allows flexibility unseen in other brands.High-speed sequential shooting is un-surpassed.  10MP is still ample resolution to print a16x20.", "Date": "January 2, 2013"}, {"Title": "comment to D. Rosenfeld in Wayland Mass.", "Author": "LKB", "ReviewID": "R14QUIXCKNITK", "Overall": "5.0", "Content": "to d rosenfeld in wayland mass.  sounds like you have warrenty issues.  I have and use the 570 regularly, and have excellent battery life, the battery meter is on the upper rt area of the lcd screen.  as to the plastic contact cover for the optional flash assy, what would one have them use? all it does is protect the contacts it covers. autozoom would be cool, but I am not that picky.  anyway, Warrenty!!!! old bean!", "Date": "June 10, 2012"}, {"Title": "Outstanding overall camera", "Author": "John", "ReviewID": "R2L2SJZJ1VDSZW", "Overall": "5.0", "Content": "This camera is soo versatile that you can take ANY picture and it usually is a PERFECT ONE.  I would recommend this for all grades of photographers and get neat pictures to show or enter in competition.  It is a must camera with the only one lens to worry about.", "Date": "March 14, 2010"}, {"Title": "Near Perfect for My Uses", "Author": "ChockNRock@Yahoo.Com \"Philosopher\"", "ReviewID": "R3W45GNDTZAAAC", "Overall": "4.0", "Content": "CONSHad to buy funky XD memory card instead of standard SD I already had a few ofLens cap comes off too easily, subjecting lens to ruinous scratching risk--reflects badly on all OLYMPUS productsThey say video is subpar, but I rarely use it for thatPROSAwesome 20x zoomWonderful dual stabilization of image (does not seem to work on super macro, don't know about macro)Very good feel in handsLOVE the trade off of manual zoom only in order to substantially extend battery lifeLove the quick button that changes or temporarily eliminates picture data, allowing you to see the whole imagePre-set options for various types of point and shoot images overly abundant for most users--fabulousAlso love the trade off of learning to remember to pop up the flash manually only, in order to extend battery life (some  pic modes will remind you on screen to press the button to pop up the flash)Make sure you immediately get and carry photo lens tissues in your camera bag; don't want to scratch that lens.  And get a bag big enough to carry fresh batts too.", "Date": "August 31, 2009"}, {"Title": "Best Pictures for the Camera Cost", "Author": "Craig Hogan", "ReviewID": "R7CWEFRBYQFIU", "Overall": "5.0", "Content": "I am very happy with the results I've received from this camera. The clarity is excellent.", "Date": "August 23, 2009"}, {"Title": "Great product!", "Author": "Elizabeth J. Brookman", "ReviewID": "RBDCY85TTWIFP", "Overall": "5.0", "Content": "Love it except it is sometimes slow in taking a photo or slow in the zoom. Not the best for quick photography. Good with close ups. Great for stills and when you have time to set up the shot. I would highly recommend it. Great value for the price.  Rarely need to use the flash indoors....", "Date": "April 25, 2009"}, {"Title": "Love it...", "Author": "Spaz", "ReviewID": "R1FBCUMBHPFCRG", "Overall": "4.0", "Content": "I have it, use it and love it!I did knock off a star because I HATE that if you turn on the camera without removing the lense cap that you have to turn it off, remove the cap and start over.  I also dislike that on the battery save feature you have to turn off the camera...you can't just click the shutter button and have it turn back on.  And lastly...like one reviewer stated, you have to wait a while on the \"scene\" mode for the camera to load shots before you can take pictures again (I'm totally impatient and want immediate results)!I'm not a professional nor have a professional review.  I'm a mom and wanted a nice camera to capture great shots of my family and life in general.  I got it!  Hope that helps :~)", "Date": "December 29, 2008"}, {"Title": "camera review", "Author": "Joan C. Blair \"J. B.\"", "ReviewID": "R1BH2SEUAEQHTP", "Overall": "5.0", "Content": "The camera is realy great.  I have one and bought this one for my daughter-in-law.Olympus SP-570UZ 10MP Digital Camera with 20x Optical Dual Image Stabilized Zoom", "Date": "December 16, 2008"}, {"Title": "gillmartin review", "Author": "G. E. Martinez \"anchorman\"", "ReviewID": "R2KOVN0U3OA437", "Overall": "5.0", "Content": "I find this camera easy to hold and handle, It's focusing power is great a very well engineered machine that is a pleasure to handle and shoot great photos with.  Thank you Olympus for the SP-570UZ", "Date": "December 12, 2008"}, {"Title": "Fantastic camera!", "Author": "H. McConnell", "ReviewID": "R14XZ7YY570SF7", "Overall": "5.0", "Content": "The Olympus SP-570UZ is handy, simple to learn to use and produces terrific results.  I especially love the crispness of close-ups.  I got it because it has a hot shoe but have not used the external flash yet.  Otherwise, the 560UZ is just about as good.  I highly recommend both of these models, but if you want the extra flash, get the 570UZ.", "Date": "November 11, 2008"}, {"Title": "Olympus SP-570UZ", "Author": "Gary P. Krick", "ReviewID": "R2BM4PAJ51OSVW", "Overall": "5.0", "Content": "An outstanding camera at a great price. Very high quality. Rated #1 in PC World.gary", "Date": "August 8, 2008"}, {"Title": "AN OUTSTANDING CAMERA!", "Author": "Linda", "ReviewID": "R34QKXN2LC4ZAM", "Overall": "5.0", "Content": "After much research, we decided to replace our (then state of the art) 4 Megapixel camera with this one and we've been very happy that we did. This camera does it all and is very easy to use. We're very happy with it and would recommend it most highly.", "Date": "July 16, 2008"}, {"Title": "Great camera, read instructions carefully", "Author": "Paulette Prendergast \"Nana5\"", "ReviewID": "RBTRH490LUU41", "Overall": "4.0", "Content": "This is my third Olympus camera and I love it.  The picture quality is great and the zoom is phenominal.  The only problem that I have had so far is when in the record mode I am not getting any sound and cannot find where to turn it on. The camera menu will not let me in to change a setting. I guess I will have to call support.", "Date": "June 29, 2008"}, {"Title": "Love new camera", "Author": "Charlene M. Fakes", "ReviewID": "RV5O8NO8E5J6Z", "Overall": "5.0", "Content": "This was the \"perfect\" camera for my daughter's high school graduation.  Loved the BIG zoom on it.  I could almost tough her from the stands!!", "Date": "May 27, 2008"}, {"Title": "Excellent purchase- well worth the money", "Author": "Sarah Undem \"wyofarmgirl\"", "ReviewID": "R3JYYXMTW3HEFE", "Overall": "5.0", "Content": "I have beene exceedingly pleased with this camera. I went to my best friends wedding in Florida and captured over a thousand picturs within the first two weeks I had it. I took some amazing photos of everything, it's versatile, quite simple, and just amazing.", "Date": "October 9, 2008"}, {"Title": "awesome pictures", "Author": "Jay \"J\"", "ReviewID": "R2KTP54HTA8XGP", "Overall": "5.0", "Content": "Best camera I have ever used. OMB we took 1500+ picture on our 2 week vacation in Europe. Takes excellent pictures. Used two 2 gig cards. Keep a spare card and some batteries in a case. Picked up a case from bestbuy. Used the viewfinder to save some juice.", "Date": "October 3, 2008"}, {"Title": "Amazing Clarity and Ease of Use", "Author": "10seVol", "ReviewID": "RVZYMXFBTXLVZ", "Overall": "4.0", "Content": "The camera is so versatile I'm still in the learning phase. However, I can't find much, if anything, wrong with this camera. It takes amazingly sharp and clear photos. The 20x optical zoom is incredible.", "Date": "September 1, 2008"}, {"Title": "great camera", "Author": "Nancy S. Wenk \"photo junkie\"", "ReviewID": "R1G7TOQ3YMIED2", "Overall": "5.0", "Content": "I bought this camera after my husband, bought for me as a gift, a larger camera with interchangable lenses.  All I wanted was a camera with good zoom and at least 10 mp.  So he had to buy camera #2.  I love this camera.  We took it to Africa, on Safari, and my camera took distance with quality, and did as well as his too heavy one. I do have some trouble with backlight, and haven't fooled with it enough to correct some minor problems", "Date": "September 1, 2008"}, {"Title": "Nice and complex camera", "Author": "Diego \"Diego\"", "ReviewID": "R2ID2FNFC3IS7Y", "Overall": "4.0", "Content": "I bought this camera to replace and old Oly C730UZ. My main motivation was to replace the old camera with another similar in characteristics: long zoom and with auto and manual controls, perfect for taking photos of my kids at the school drama representations. And, off course, compatibility with my Oly FL36 external flash (I have the external flash bracket for the 730UZ).I have only one complain to this camera: is too slow to focus if not in the sunlight. I love the Shutter and the Aperture priority controls. The menus are different from the old camera, but I got use to them very quickly, since they are very intuitive. The zoom control has strange movements (slow reaction time), but I have it under control after about one month using the camera.All in all, I am happy with my purchase.", "Date": "October 6, 2008"}, {"Title": "Not what I'm used to in an Olympus", "Author": "J. Send", "ReviewID": "R1YRIK6MJ28O1Q", "Overall": "2.0", "Content": "I have owned Olympus cameras for over 10 years now and have always had a great experience, so when I was ready to move up to a bigger model I of course looked to them.I am so dissapointed though, not only am I out over $400, I have a camera that is inferior to my old olympus.  I am not impressed by the quality of the prints this camera takes, I find it very cumbersome to use. I was so quick to focus on things with the little toggle button on my old camera and now I have to use two hands to focus this and for nothing more than show, it really isn't a camera that you have to move the lens cap to focus, it could easily be done with a toggle switch, but the manufacturer wanted it to appear more professional. I don't think the shoot button is laid out well either it is hard to man this camera with just one hand. The quality of the photos when you do a sports action, or multi frame action mode is horrible. I need to sit down with someone who knows cameras better than I to see if we can over ride the factory settings on that feature.  I also didn't like how the unit opens to hook up the USB port to download the pictures onto your computer, it is a very tight fit and I am always worried about breaking something.So to wrap it up, I wouldn't recommend this to someone who is not camera savvy, (doesn't know what Aperature means etc) or who wants some thing to just point and shoot.A few features I do like though, are the scene and guide features where it has \"dummy\" settings for lighting, specific scenes etc.  and as for the 20X zoom, it really does get you up close fast, and takes a fairly decent picture. I would have to say the 20X zoom takes much better photos than the standard photo taking mode.Olympus has made some awesome cameras but this is not one of them.", "Date": "October 23, 2008"}, {"Title": "Olympus SP-570-UZ Review", "Author": "John Uske \"computron\"", "ReviewID": "RDYMTH2EX6C0R", "Overall": "5.0", "Content": "I have quite a bit of money invested in the Olympus system. My first foray into serious digital photography began when I bought the Olympus C-700 UZ super zoom camera. Soon after I started taking indoor photos, I realized the built in flash was not enough. I bought separate flash units made by Olympus and I migrated right on up to the most powerful unit they make which was the FL-50 Flash with a hot shoe connection to the camera body. To use the flash with the C-700 I had to buy a synch cable and flash bracket with a hot shoe to connect it to the flash. The TTL flash metering system makes sure the exposure is right every time because the feedback to the flash unit comes right through the lens used to take the photo. The flash has become the most important piece of equipment I use in my photography because without good lighting you cannot get good photos. So my first consideration each time I buy an Olympus camera is does it have a hot shoe for the flash? I sold the C-700 and bought a C-750. I sold that after a while and migrated to the C-770. I kept the C-770 and I also bought an E-Volt 330 which is my main camera now for event photography.However I still like to have a compact camera to go out with which is why I kept the C-770. This camera was the last of the C series super zooms. Olympus then came out with the SP series of super zooms. Some had a hot shoe some do not. Olympus goes in cycles with their super zooms as to whether or not to include hot shoe, which is what I need to connect to the FL-50 flash. The SP-570-UZ has a hot shoe the SP-565 and SP-560 do not. The new SP-590 has a radio remote flash trigger to work with the new FL-50R flash that can be triggered by radio signals. I think Olympus has moved away from the hot shoe connection for good. So now was the time for me to buy the SP-570-UZ which has a hot shoe. I am of course very pleased with the camera, but I do not think it has an adapter for the Olympus wide angle lens attachment like my C-770. I know it can take the telephoto lens using the CLA-10 adapter tube. I am still happy to have this camera. It is very compact and easy to take along on trips without feeling like I am lugging around a brick.", "Date": "April 25, 2009"}, {"Title": "Its a good camera for a n00b", "Author": "Luis E. Pena \"LPena\"", "ReviewID": "R15S11KT7AFEP7", "Overall": "4.0", "Content": "I had to buy a camera for my college class and i decided to pick this one up. I loved it at first but now after many uses, it tends to be just a tad bit slower. However, the the cost, its a great camera.", "Date": "September 30, 2008"}, {"Title": "Ultra Zoom Digital Camera", "Author": "Erhard M. Ciolina", "ReviewID": "R2QG257SR9T9W1", "Overall": "4.0", "Content": "I am very happy with this ultra zoom digital camera - a great tool for every serious photographer.", "Date": "June 18, 2008"}, {"Title": "EXCELLENT CHOICE", "Author": "John E. Hetsch", "ReviewID": "R2YSHG6A7M3N7A", "Overall": "5.0", "Content": "I PURCHASED THIS CAMERA ON THE RECOMMENDATION OF A FRIEND WHO HAD ONE AND I AM SO HAPPY HE CONVINCED ME TO GET IT.  I'VE HAD TWO KODAK CAMERAS WHICH ARE SIMILAR IN FEATURES AND APPEARANCE, BUT THIS ONE OUTSHINES EVEN THE KODAK CAMERAS.  IT WILL BE MANY MONTHS, IF EVER, THAT I LEARN TO USE ALL THE FEATHRES OF THIS CAMERA, BUT JUST KNOWING I CAN GO INTO THE MENUS AND BRING UP THE FEATURES MAKES ME FEEL GOOD ABOUT THE CAMERA.  MOST OF MY PHOTOGRAPHY WILL BE USING THE \"P\" MODE, BUT JUST KNOWING I HAVE AVAILABLE COMPLETE MANUAL CONTROL MAKES ME LIKE THIS CAMERA.  SO FAR, THE PICTURES I HAVE MADE ARE SIMPLY BEAUTIFUL, SHARP, COLORFUL AND EVERYTHING I EXPCECTED.  I HAVE ONLY HAD IT FOR ABOUT TEN DAYS, BUT EVERY DAY, I LEARN SOMETHING NEW ABOUT IT AND I LOVE IT.  I RECOMMEND IT TO ANYONE THINKING ABOUT A DIGITAL CAMERA.", "Date": "April 16, 2008"}, {"Title": "Fast Review", "Author": "F. Kawkji", "ReviewID": "R2EWY19SMXFSIW", "Overall": "3.0", "Content": "Well let's talk about the good thing of this cam, this is a small cam when comparing it to SLR and it have a rigid body with a lot of good features you can take advantage of them when using it. The menu is SLR like and you will feel comfortable when you are changing the different settings and it has the best wide angle in this category. The bad things is the batteries meter it suddenly go down without any previous notice, and another thing is the focus night time, it's really bad and it should be fixed from the company because not always you will have the patience to manual focus things that's why I am giving it 3 stars.Finally, if you do not have alarm to wake you up do not worry any more this one include alarm with snooze option.", "Date": "July 3, 2008"}, {"Title": "New High in Advanced Digital Cameras, D-SLRs Look Out!", "Author": "Chip P.", "ReviewID": "R34MADVJF6U09", "Overall": "5.0", "Content": "This is a great camera. This is the \"can do\" camera! Why buy a Digital SLR? The SP570 does so much, and so well, that D-SLRs aren't worth the great extra cost or trouble. Plus you have to pay EXTRA for the lenses for D-SLRs!If you want to just take decent pictures, then any decent digital camera will be good enough. But if you want to take great pictures in many situations, from many distances, in most all lighting conditions, and always have some flexibility to \"grow into,\" then the Olympus SP-570 is the best choice!Ask yourself: Do you care? Are you going to improve in time? Do you want to capture images that make people, or at least you, say \"Wow?\" Are you curious about photography? Do you want to get to the next level? Do you like having good & capable tools to use? Do you ever see a picture that someone else took, and think \"that's great, I wish I could do that?\"To \"get there,\" you need tools, education, and practice. You must have \"good enough\" tools to do work that is \"good enough.\" The pictures are already in you, and in your environment. Set them free so you, and others, can enjoy them, or learn from them, or \"see\" and feel something new, something valuable.Those who don't promote and share art, kill a great part of life. There are billions of pictures out there just waiting for a caring person, an open eye, and a capable camera, to capture them and give them to the world.Go to the Olympus Digital Camera website: [...]Look at the features, and learn. Then imagine what you could do, if you only had the tools to \"TRY.\"I bought this camera, the Olympus SP-570, back in April 2008, the first week that it came out, as a gift for my sister. NO REGRETS! My sister loves me for this great gift! By the way, this was the very first digital camera that my sister has ever used! And at 61 years old, she isn't so much the \"tech type.\"  Every week she tries new things with her new camera. The Olympus SP-570 gives her great joy by freeing her creativity, opening the door for her, and delivering wonderful imagery. Yes, I'm a hero now!Also buy yourself a \"good\" tripod, camera case, extra xD-Picture cards, a USB xD-Picture Card reader, and USE THEM! (The reader looks like a \"USB Flash Drive.) Keep the extra xD-Pictue cards and the xD-Picture Card reader in the camera case. This way if you need them, then they will be with your camera and you can get to them, instead of sounding like some lame dim-whit and having to say: \"Oh, I left that at home, sorry.\"[...]. Now you can transfer your pictures into most any computer on Earth!Also, as soon as you get a new xD-Picture Card, put it into your SP-570, select the menu, and navigate to \"Format Card.\" This will clean and better prepare your new card for use. Also, before you go to do any important photographic exercise, down load ALL pictures on your cards, and again \"Format\" each card. This will ensure that all cards are clean, and will enable the camera to \"map\" any bad cells so that you won't LOOSE any important pictures.Also: practice. And take lots of pictures! Lots & lots & lots of pictures. They're FREE!!!!!!!!!!!!!!!!! You can always delete the bad pictures. But if you don't have the pictures to select from, you won't have the luxury of deleting the bad pics. All good, smaller format photographers, take extra pictures! Later you can delete, but you can't take more pictures later. \"Strike while the iron is hot!\" That's good advice.Also: Get up early and photograph your environment at \"Dawn,\" or shoot at sunset. The low angle light makes your pictures more appealing. Push the envelope! Have FUN!But most importantly, buy the best camera that you can afford! I recommend the Olympus SP-570! Now I've given you the information, you must act on it. P.S.: I am a Mensan, the smartest people on Earth, so my opinions carry extra value and cache. Oh, and I'm very modest!", "Date": "October 15, 2008"}, {"Title": "cameraguru", "Author": "georay \"cameraguru\"", "ReviewID": "R2QUKK0CLCBQQR", "Overall": "3.0", "Content": "this camera had the best color i have seen most of the time the other part of the time it took too long for response time and was not a good pic, the zoom was like turning my 70-300 vr but not as responsive", "Date": "July 18, 2008"}, {"Title": "Less Than Expected", "Author": "Dale", "ReviewID": "R14CZR6RNHJ289", "Overall": "2.0", "Content": "I bought the Olympus SP570UZ as a gift for someone who is proficient with optical & SLR cameras. The 20 optical being the main feature we've waited for. She has used and tested the camera in several areas; while I am less experienced I want optical. Both of us agree while zoom in/out is jerky and takes time to focus when stops or is blurry until zoom is reached.  For me, using the left hand to zoom creates some stabilization problems.  There are several issues with this camera I feel for myself, and possibly other less experienced persons; would be too time consuming to learn versus the cost.  I purchased this camera & card on Amazon and called to talk with a rep before purchasing to determine what was included in the package....she couldn't tell me, she said they don't get that info, which; I would think is relative to the sale.  She did give me a number to Olympus to answer further questions which was can one zoom in/out during video recording....his answer was \"yes\"....well, you can, the recording is very fuzzy and not stable.In this instance simply, I do not feel I got what I paid for.", "Date": "August 28, 2008"}, {"Title": "high quality and user friendly", "Author": "George A. Garcia", "ReviewID": "RMWFTLYRXK40J", "Overall": "5.0", "Content": "great olympus quality and very user-friendly! easy to use and great picture quality. construction and ergonomics are top-notch !!!!!", "Date": "June 10, 2008"}, {"Title": "Bad camera", "Author": "D. Rosenfeld", "ReviewID": "R3LUIMB8DQFORT", "Overall": "1.0", "Content": "I was looking for a 20X zoom and normally trust Olympus. Due to the many failings of this camera I don't believe it was designed by Olympus. Some, and just some, of the major defects: 1.Very short battery life (time to recharge) 2. No battery meter 3. Stabilizer poor 4.Plastic flash insert 5. Zoom in general, all features 6. Read Steve's review.", "Date": "January 4, 2009"}, {"Title": "Zoom error Fatality!!!", "Author": "bujinin \"Pete Saussy\"", "ReviewID": "R30OBPZK2CCO0O", "Overall": "1.0", "Content": "my wife bought me this beauty for xmas. i never could get it to do much in the way of macro or quick shots of birds and airplanes, just too slow to focus, and the face-focus is confusing; but still a nice camera...until it fell one foot off a table. power on and the tube zzzts out then zzzts back in, the display reads Zoom error and it shuts off. i sent it off and it was returned \"unrepairable\". so now i have an expensive bait-weight. i love olymppus, have used their stylus's for years, and still use my old one.. again. what happened olympus?pete saussypawleys island", "Date": "September 7, 2008"}, {"Title": "Olympus SP 570 Is Great!!!!!", "Author": "Jenna Longmire \"camera buff\"", "ReviewID": "R1LFHW3OBM6E4I", "Overall": "5.0", "Content": "This is a great camera and one I will enjoy for years to come!!!! Takes great pictures and the zoom is wonderful!!! Great for taking pictures of wildlife!!!", "Date": "June 5, 2008"}, {"Title": "Zoom Less Than Expected", "Author": "SBR \"SBR\"", "ReviewID": "R3AXM4CI25GB9I", "Overall": "3.0", "Content": "I bought this camera as an alternative to the very expensive 500mm zoom lenses for my Canon XTi SLR, as I have a limited need for a zoom over 300mm.  Unfortunately, in a side by side comparison the zoom on the 570UZ, billed at 500+ mm, was insignificantly closer to the subject than my 300 mm Canon lens.  The difference between 300 and 500 is less than the difference between, for example, 50 and 250, but it still should be very noticable.  It is not.  The superiority of the SLR over the 570UZ in every other aspect (except size, of course) means that this camera is probably on its way back to Amazon after a day of experimentation. Note that the 3 stars is mainly for the zoom and focus, not the other attributes.", "Date": "May 13, 2008"}], "ProductInfo": {"Price": "$449.99", "Features": "10-megapixel image sensor captures enough detail for photo-quality 18 x 24-inch prints\n20x optical dual image-stabilized zoom\n2.7-inch HyperCrystal LCD\nPerfect Fix in-camera editing; includes Olympus Master 2 software\nStores images on xD Picture Cards (not included)", "Name": "Olympus SP-570UZ 10MP Digital Camera with 20x Optical Dual Image Stabilized Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51l85Y3VMNL._SX300_.jpg", "ProductID": "B0011E67VA"}}