{"Reviews": [{"Title": "A Good Product!", "Author": "Eliot Merk", "ReviewID": "RPXREJKZ088BA", "Overall": "5.0", "Content": "I don't understand the bad reviews that this camera has gotten.  To me it is like my iPhone, intuative and easy to use!  Takes great pictures too!  My only disapointment is that a premium priced Point & Shoot camera like the S60 Nikon Coolpix S60 10MP Digital Camera with 5x Optical Vibration Reduction (VR) Zoom (Burgundy)should not have been shipped without a SDHD memory card (even if only limited capacity!).  Make sure you buy this camera AND a SDHD card at the same time, without the card you will have only 9 or 10 photos before you must delete or download to your computer.", "Date": "April 5, 2009"}, {"Title": "Negative,  NOT!", "Author": "William H. Boothe", "ReviewID": "RO6GB5TBBFI4P", "Overall": "4.0", "Content": "Super is how I would describe this camera.  Display is great.  Feels good to handle.  Relatively easy to navigate menus displayed on the view window, a convenient feature.  I almost did not buy this after reading the negative reviews, but it seems to me these are simply wrong. I have yet to print from the card, but I assume and 10 mp it will do fine.  If you are on the fence on this one, go ahead, take the plunge!", "Date": "June 24, 2009"}, {"Title": "the fun camera", "Author": "John Valle \"john\"", "ReviewID": "R19R8QW3ECUXU9", "Overall": "4.0", "Content": "everybody i showed the camera to, loved it and wanted one,my wife is happy with it, what else can i say..the different things you can do with this camera makes it so cool to have....", "Date": "December 28, 2008"}, {"Title": "Worst Camera of the year award", "Author": "A. PHUWICHIT", "ReviewID": "R27PZMOSO9VE2J", "Overall": "2.0", "Content": "Unbelievable Nikon sent this camera to the market. The spec is fantastic. I could not wait when I first reviewed its spec. The first month I got it, I still try to make it work since I am a big fan of Nikon. 6 Months passed by, I still could not make it worth the money and decided to replace with SONY.In detail, the large LCD is good, but picture quality is bad. I took many pictures using all available modes on the camera. When I uploaded and preview on my computer, the picture quality is just like the camera on your hand phone. As a matter of fact, it is almost the same picture quality as my iphone.TRUST ME, DON'T BUY THIS PRODUCT NO MATTER HOW YOU LIKE THE LARGE LCD AND TOUCH SCREEN. SONY T-SERIES IS FAR BETTER. YOU WILL BE REGRET. I am not a kind of guy that try to discredit the brand. But this product is really a big disappointment.", "Date": "October 16, 2009"}, {"Title": "It's a NIKON.", "Author": "Juan Enciso", "ReviewID": "R2KMAJLPPVC77N", "Overall": "5.0", "Content": "I love this camera.  It looks weak at first but after a couple of drops I can tell you that it can take quite a few hits without any damage.  The photos are stunning.  Everyone in my family wants one.  Buy an extra battery just in case.  I agree that zoom in and out with the touch screen is not the best option, but it is worth the trouble for this quality.", "Date": "October 8, 2009"}, {"Title": "Great Little Camera", "Author": "James Beverly", "ReviewID": "R4I30CQW968YM", "Overall": "5.0", "Content": "I am very pleased with the S60. It does everything it is supposed to do - and does it very well. I can't understand the negative reviews. Remember it is just a pocket camera. I have only had it a few days - but so far, so good. Be sure and buy a memory card with it.The touch screen is a nice touch and helps keep the dust out.The only thing I would change is the rechargable battery! I travel a lot and camp - so sometimes a 110 v supply is not handy. A few AA batteries are available almost everywhere. I would prefer them. Rechargeables seems to be the trend on all of my newer Nikons - wish they would go back to the AA batteries.", "Date": "July 20, 2009"}, {"Title": "Mostly Satisfied", "Author": "S. Southern", "ReviewID": "R387DINBW5WANG", "Overall": "4.0", "Content": "I thought the zoom would be better and the camera itself really has no memory so you should get a memory card when you get the camera.", "Date": "January 7, 2009"}, {"Title": "Nikon Coolpix S60", "Author": "Stephen W. Abney", "ReviewID": "R3I5BURY9F8N40", "Overall": "5.0", "Content": "Bought the camera as a Xmas gift for my wife.  She loves it especially the built in picture editor.  Very easy to use and takes great pictures.", "Date": "January 6, 2009"}, {"Title": "Bad picture quality", "Author": "K. Brinkman \"Kirsten, 26\"", "ReviewID": "R3QTG67TT14T86", "Overall": "1.0", "Content": "We have been very disappointed with this camera.  We have always had a Cannon but decided to go with Nikon's new product.  With 10 megapixels you'd expect a picture to be crystal clear, but our old Cannon was 7 MP and took better photos on a lower setting than this does on it's highest.  Also, the touch-screen, which we thought was a great selling point, is very frustrating to use.  I would especially not recommend it for older people, just to zoom in and out with the touch screen vs. actual buttons is much more difficult that you'd think.  Overall we could not recommend anyone to buy this product.", "Date": "January 8, 2009"}, {"Title": "Nikon Coolpix S60 10MP Digital Camera", "Author": "Robin J. Thompson", "ReviewID": "R2RYJPQUJZQNBB", "Overall": "4.0", "Content": "Nikon Coolpix S60 10MP Digital Camera with 5x Opti... this is a great camera.  Still figuring out just how to use all the bells and whistles!  Would definitely recommend to others.", "Date": "January 29, 2009"}, {"Title": "not worth the money", "Author": "Gary M. Cooper \"Coop\"", "ReviewID": "R1NPMPNU7KGPEE", "Overall": "2.0", "Content": "Quit working after one day.The touch screen worked fine just no picture in the view screen when trying to take pictures.(What is a camera for?)Did we get a lemon?I looked up reviews afterwards and found simular issues and not so good pictures for a camera with 10 mp and costing so much.Fortunally we were refunded the full amount because there was no stock to send out another.Some other nikons might fare better but I like the reviews from Kodak better,sorry Nikon.", "Date": "January 9, 2009"}, {"Title": "outstanding", "Author": "jkracing", "ReviewID": "R25SQTPXAG93R2", "Overall": "5.0", "Content": "This is the best camera that I have ever had. Everywhere I pull it out to use it people cant believe that I could write on the screen and then when I print it off the stuff I wrote on the screen was printed on the picture. Everyone ask me where I got it , and I told them all to get on line and go to Amazon.com---  I love this camera. My daughter is 11 and this is what she is wanting for Christmas now.", "Date": "July 9, 2010"}, {"Title": "Fantastic little camera", "Author": "KatieQ \"Kate\"", "ReviewID": "RNYFQ0G443WE2", "Overall": "5.0", "Content": "Nikon Coolpix S60 10MP Digital Camera with 5x Optical Vibration Reduction (VR) Zoom (Crimson Red)I bought this camera to take to Italy with me and it did a fantastic job . My pictures were clear and it 's ease of operation made me appreciate it even more.  It was light and easy to travel with and the touch screen is very responsive yet not overly sensitive that it would do commands without me wanting them. I would recommend this to anyone who wants a great picture and is not familiar with having a digital before.", "Date": "June 1, 2010"}, {"Title": "Nikon Coolpix S60", "Author": "Diana Yong \"Siuyen\"", "ReviewID": "R2V6ZEUM9YFACV", "Overall": "5.0", "Content": "Excellent design, color and portability.  Image Quality,easy of use and picture quality: Excellent!  No complaint about this product.  It is a 5*", "Date": "January 30, 2010"}, {"Title": "Broke after using it TWICE", "Author": "Julie Mitchell \"missjulia\"", "ReviewID": "R24IXZQUKEG3SJ", "Overall": "1.0", "Content": "Do not buy this camera.  It broke after I used it TWICE, taking a total of about 10 pictures with it.I purchased it for a trip around the US for my 40th birthday to celebrate with good friends, after which I was leaving the country for 8 months.  Thanks to Nikon (who refused to just send me a new camera ASAP, which would have been the decent thing to do) and this camera (which is absolutely useless to me less than 2 weeks after purchasing) I have no pictures to show of this very special vacation.If you have important memories, do not trust them to a Nikon camera.  I have owned Kodak and Fuji cameras and never had a single problem with them.  I will never buy another Nikon again after this experience.", "Date": "September 9, 2009"}, {"Title": "Lousy camera. Touchscreen is a gimmick. Do Not Buy.", "Author": "mike016256 \"Mike\"", "ReviewID": "R1K8JM87DPVWB4", "Overall": "1.0", "Content": "I am somewhat of an amateur photography buff and so I know what I'm talking about when I say do not buy this camera. My girlfriend received it as a gift. While it takes barely acceptable landscape pictures in broad daylight, every other lighting condition produces pure trash. The digital grain makes this this camera not terrible, but unusable.10 Megapixels? BULL. This camera might produce an image with 10 million pixels in it, but it has just a little bit less grain than a VGA cell phone camera.So which camera should you buy? Well here's what to to avoid, because they are more than likely to be gimmicks:1. Any camera with a touchscreen.2. Any camera offered in colors beyond black or silver.3. Any camera with a lens that does not stick out past the body.4. Any camera that does not sport the Canon, Nikon, Leica, or Panasonic branding.And I know price is always a factor, but if you are serious about learning photography:5. Any camera where you cannot remove the lens.", "Date": "November 6, 2009"}, {"Title": "defective camera", "Author": "drmichael \"drmichael\"", "ReviewID": "R3SVU9OR1I5UB5", "Overall": "1.0", "Content": "I was sent a defective camera that stopped working on the second day.  Now in dispute with seller about replacing it!  VERY UNSATISFIED.", "Date": "January 20, 2009"}], "ProductInfo": {"Price": "$179.99", "Features": "10.0-megapixel resolution for stunning prints as large as 16 x 20 inches\n5x optical Zoom-Nikkor glass lens; Optical VR Image Stabilization\n3.5-inch high-resolution touch-panel LCD; customizable touch-panel display\nAuto adjusts up to ISO 3200; Shutter and Blink Warning\nCaptures images to SD/SDHC cards (not included)", "Name": "Nikon Coolpix S60 10MP Digital Camera with 5x Optical Vibration Reduction (VR) Zoom (Burgundy)", "ImgURL": "http://ecx.images-amazon.com/images/I/41p2jGKZ71L._SX300_.jpg", "ProductID": "B001DNY5G8"}}