{"Reviews": [{"Title": "The Search Is Finally Over!", "Author": "charlesn", "ReviewID": "R3M1B0383FXM17", "Overall": "4.0", "Content": "Like many photographers with pro SLR digicams, I've been on a seemingly endless search for an ultracompact, truly pocketable digicam that could produce photos without great compromises in quality. And finally, my search ended with the purchase of a C-Lux 3.Before I get to specifics, a word about what \"truly pocketable\" means to me. It means that I can pocket the camera in either my jeans or the inside pocket of a sport jacket without awareness of either size or weight. If there's awareness, then leaving the camera home becomes more likely, which defeats the whole purpose of buying a camera to have with you ALL the time. For example, I have a Fuji 31fd that I love, except I tend to leave it home because it feels a little too bulky and heavy for pocket carry. So its outstanding low-light performance is meaningless when the camera's sitting in a drawer.Amazingly, many of the digicams in this category perform poorly at the type of photo for which they are most likely to be used: snapshots of people. Flash exposure is either terrible or unpredictable at best, while color balance and skin tones are anything but natural. In addition, the low power flashes on small cameras almost require a wider angle lens that allows you to get in closer, especially for group shots, and yet many of them leave you stuck at roughly 35mm. It's in all these areas that I find the C-Lux 3 really shines. Great and consistent flash exposures, speedy and accurate focus, a supersharp lens, very natural color balance and pleasing skin tones, and a lens that widens out to 25mm. I've also been very satisfied with daylight pics, as well. Compared side-by-side with a friend's Panasonic \"twin\" of this camera, this FX37, I overwhelmingly prefer the processing done by the Leica. You may feel differently if you're a fan of supersaturated color in your photos, and many people are, in which case the Panasonic might be your pick. In addition, Panasonic's sharpening is more agressive resulting in noisier photos at higher ISOs.This is not, by any means, the perfect camera. The lens is pretty slow on the long end, and while low-light performance without flash is better than nearly all of its category competitors, it's a far cry from the F31fd. Once you get above 400 ISO, things start getting noisy. So if indoor available light photograhy is your thing, this probably isn't your camera. (Then again, no camera in the ultracompact category would be.)Construction of the C-Lux 3 is first rate and very classy--having seen the camera in both black and white, you can't go wrong with either one. The white is more of a fashion statement and somewhat more feminine. Menus are very intuitive and straight-forward, with good button layout for an ultracompact. I have thick fingers and never felt cramped.The choice of a camera should always be driven by your intended use for that camera. If you've been searching for a great, truly pocketable ultracompact--and indoor available light photography is not main interest--I think you'll find the C-Lux 3 to be a very satisfying purchase. Is it worth the significant upcharge vs. the Panasonic FX37? That's more difficult to answer. For me, the difference in Leica processing of the image made it worthwhile, since I get great pics that please me right out of the camera.", "Date": "June 24, 2009"}, {"Title": "Amazing poket size camera!!", "Author": "OVIDIU HELJU \"HLJ\"", "ReviewID": "R261NR5JL44Y1Q", "Overall": "5.0", "Content": "Since 2002 ,i have own 6 digital cameras, all point and shoot, 2 Sony,2 canon,1 samsung,1 Nikon,and now i have purchased LEICA. from the previous models, canon was on the top as a picture quality.this LEICA C-LUX 3 is amazing, just got it from UK (better prices then US) believe it or not 344GB!!..1. Great design, and very light.2. Easy ,friendly menu3. Recording video files are away much clear then any another brand of this size, the frames are 1280 x 720 pixel the highest,30 frames/sec. up to 2 GB limited time ,having an 8 GB card is just perfect for recording and taking pictures.", "Date": "January 27, 2009"}, {"Title": "Almost perfect.  Small size, easy to use, beautiful camera", "Author": "T. Grady", "ReviewID": "R3T9HQMHDZZ8SH", "Overall": "5.0", "Content": "Overview:Let me start by saying that I LOVE this camera.  With that in mind, it's not perfect (I'll explain later).  This camera begs you to use it and I've used this camera more in the last few weeks than I used my last camera in a year.  The design is beautiful and the camera fits nicely in a jeans pocket.  I've been carrying it almost everywhere when I travel.  With my old camera, I almost never took it with me because it was just too big.The camera itself:The dial has photo and video and there is a switch for pictures/video or playback.  The options are pretty basic, but the camera seems quite good at figuring out what to do by itself.  It takes almost every picture at ISO 100 or ISO 160.  The ones at higher ISO settings (400+) are noisier, but you can also set a maximum ISO for it to use.  Image stabilization works well.  It defaults to snapshot mode where there are limited options and almost everything is automatic.  There is also a program mode that lets you choose and play with a few more settings.  The self timer has 2 and 10 second options.  The 2 second option is only available in program mode.  There are also many more flash options available in program mode.  For 95% of my shots, the standard snapshot mode is perfect.  Turn it on, point, shoot.  For the other 5%, the program mode is easy to get into and navigate around.  In general, this is a camera that just wants you to take pictures and not worry about settings.Performance:One word- versatile.  This camera is awesome at city landscape shots.  The lens is fairly wide and the zoom is enough for virtually all of the shots I have taken.  The quality of these shots (color, sharpness, noise, etc.) is very, very good even when zoomed in to a pixel level.  For interior/people shots, this camera is usually good.  The wide angle can be really useful to get the whole room and the flash is good, but sometimes the shots come out fuzzy or with quite a bit of noise.  Some of the inside or low light shots I have taken were excellent and others were merely okay.  Surprisingly, this camera is quite good at night shots, but you will need a tripod or other stabilized surface to make the most of it.The 720P video mode is also nice, but the camera won't zoom while taking video.  The videos files are large, but a free program like Handbrake can convert them into any form/size you want.  The benefit of the video files is that they can be played in virtually any media player.  Some cameras use AVCHD.  It's a much more advanced codec that results in smaller size files for the same picture quality.  The down side is that very few program can play AVCHD and it's a real mess to try to edit.  You're not missing out on anything by not having AVCHD.Comparison with Canon S50.Yes, the Canon S50 is an OLD camera.  It's from when 5 megapixels was considered too much.  However, with it's big sensor (1/1.8\"), it takes excellent shots.  I did indoor side by side comparisons.  Sometimes the S50 was actually better and more detailed, sometimes the C-Lux was.  The much wider lens on the C-lux 3 meant that when zoomed out all of the way, the S50 and C-lux 3 had roughly the same area per pixel (Roughly twice the area, 35mm vs 28mm, and twice the pixels, 5 MP vs. 10 MP).  When zoomed in all of the way, the C-lux 3 shoots the same area, but with twice as many pixels.  In the end, I considered indoor picture quality to be a wash.  Outside, I prefer the C-lux 3.Summary:Would I do it again?  Absolutely.  This camera is fantastic.  It's small, easy to use, the lens is versatile, and the picture quality is very good (though not perfect).  If you get this camera, get the Leica case.  It's expensive, but the case is high quality, the leather is beautiful, and it's good to have something protecting the camera.  [...].", "Date": "August 19, 2009"}, {"Title": "Two years out...", "Author": "Megan \"Megan\"", "ReviewID": "R2PI9QROBEW4HI", "Overall": "1.0", "Content": "My father bought this camera first, and really liked it, so for Christmas 2 years ago he bought one for my sister and one for me.  It's a very nice size and weight, and the pictures were good quality.My dad's went first, which makes sense since he bought his first.  The flash went, and then the autofocus stopped working.  He called to ask them about fixing it, and it was going to cost almost as much as the camera was worth.Then the autofocus on my sister's went, rendering it useless.A few months ago, the lens on mine stopped retracting, and the flash stopped working: it would take literally 90 seconds to recharge between shots.  Which was a minor inconvenience, but not as bad as the day I took a photograph, shut the camera off, and the lens wouldn't go back in. I mailed it back to Leica and it was going to cost $400 to fix.  Ridiculous!  I took good care of this camera, and there is absolutely no good reason why the 3 out of 3 cameras all stopped working within two years.Don't be taken in by the Leica name: this was an extremely poor quality camera and a complete waste of money.", "Date": "December 30, 2009"}, {"Title": "C-Lux 3, my second Leica", "Author": "J. Pruitt", "ReviewID": "RHH29K5FO57WA", "Overall": "5.0", "Content": "I have really grown to like and love the C-Lux 3!  This is my second compact Leica.  I previously owned a C-Lux 1, I left it on an airplane and amazingly enough it was never turned in to the airlines...Anyway, great camera to carry in your pocket - guys, or in a purse.  I have enjoyed the ease of use for not only myself, but also for those that might be taking pictures for you say in a group setting.The wow factor of the camera can not be discounted either.  The camera stands out and has on numerous occassions been the topic of conversation.I have had numerous cameras for well over 30 years and this camera truly is unique - even if I had to buy one used, I would do it!", "Date": "January 10, 2011"}, {"Title": "Exceptional for our purposes, impressive.", "Author": "P. Harsch", "ReviewID": "R3COIFYY2FWB8S", "Overall": "5.0", "Content": "We purchased this camera for use primarily in our real estate business for taking quality digital photography of houses and landscapes. My wife, the better judge and who converts all our photos, was very impressed with the wide angle for inside shots as compared to other lesser cameras. We love the video feature too as I can take pan around video clips for our house tours.The camera has served all sorts of other purposes from simple home use, nature photography for our enjoyment and family shots, sports, etc.I am by no means a photo expert but we do receive all sorts of compliments for the photography on our web site.I was also amazed to read one review that cited all sorts of mechanical problems. So puzzling, so much so that I thought to myself that perhaps theirs was mishandled, dropped, exposed to the elements, dirt, who knows. So far I have never had the slightest issues with performance of any kind. We have used ours almost daily for roughly two years.One important aspect to me, a relative amateur, was to have a simple to use camera that would shoot automatically and yet take high quality shots that could be blown up and still yield crisp clear images and also, was compact. This camera has met all of those goals with honors.The only caveat is the display which of course is hard to see in bright sunlight. You learn to adjust and work with that.Highly recomended!", "Date": "January 9, 2012"}, {"Title": "My 4th Leica digital", "Author": "Michael Cheung", "ReviewID": "RR9BH77PS4MCG", "Overall": "4.0", "Content": "This used black Leica arrived in a timely manner and is in pretty much good used condition as described by seller. I purchased this black one to replace an identical white one which was damaged when I went snorkeling with it in my swimming trunk pocket, un-noticed. Eventually I bought another used white one again. This Leica C-Lux 3 model has become my favorite camera among the 3 dozen cameras that I have bought in the past 50+ years. I might add that these white and black Leica's are the only cameras I ever bought used and they made me very happy. The C-Lux 3 has the 24mm wide angle lens that I need (for taking indoor construction photos), the portability  that I prefer(for keeping in my jean pocket 7 days a week) and the performance to match(for reviewing my before-and-after work photos). Too bad this model is discontinued.No more SLR film or digitals for me.", "Date": "October 11, 2013"}, {"Title": "ultimate point n' shoot", "Author": "Anthony Guido \"Guido\"", "ReviewID": "R3TUDH23R3P5R5", "Overall": "5.0", "Content": "love this camera. for pictures and quick movies this camera is hot. use it for all occasions. compact and easy to use. not cheap. but if you want a camera that is great quality that;s easy to use this is the camera you'll love", "Date": "January 10, 2010"}, {"Title": "Easily usable", "Author": "Hajime Jozuka \"The Doctor of Village\"", "ReviewID": "R9TX8BJPTZ3Z8", "Overall": "5.0", "Content": "This item is very easily usable and carriable to take photo and video. Especially, I recognized the item is the smallest video and gives the clearest picture in any situation.", "Date": "May 2, 2010"}, {"Title": "Fantastic little camera", "Author": "German Huerta", "ReviewID": "R1TEOFKYQVC46B", "Overall": "5.0", "Content": "I love my new Leica...  It's design is simple, it is very easy to use, and very portable.  I find myself taking a lot more pictures.", "Date": "November 8, 2009"}, {"Title": "top point and shoot", "Author": "fiddler \"imbuzz\"", "ReviewID": "R2G8XTC6AAC667", "Overall": "5.0", "Content": "THIS IS ABOUT MY TENTH POINT AN SHOOT.  I GOT IT BECAUSE OF THE WIDE ANGLE LENS SO I DON'T NEED TO CARRY A SCREW ON FOR THAT TYPE OF PHOTOGRAPHY.  I LIKE EVERYTHING ABOUT IT EXCEPT THE FLASH IS A LITTLE LIMITED IN THE DISTANCE IT WILL COVER BUT YOU EXPECT THAT WITH A POINT AND SHOOT.  IT IS VERY COMPACT AND EASY TO CARRY WITH YOU.  IF YOU GET A CASE WHICH IS RECOMMENDED BEWARE THAT THE SIDES ARE TOO NARROW AND TRIP THE ON OFF SWITCH IN USE - JUST SPREAD THEM WITH A SCISSOR HANDLES OR THE LIKE AND ALL IS FINE.  AND THIS LITTLE GEM GETS REALLY UP CLOSE WHEN THAT IS NEEDED.", "Date": "March 20, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Leica quality\nSharp Leica Lens\nEasy operation\nExtremely compact size\nLarge brilliant veiwing screen", "Name": "Leica C-Lux 3 Digital Camera (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41h3TxrNTeL._SY300_.jpg", "ProductID": "B001H8FAQI"}}