{"Reviews": [{"Title": "Great camera for the price!", "Author": "Jon Guidry", "ReviewID": "R3C2C7B9ZSGG4V", "Overall": "5.0", "Content": "My wife and I just recently replaced our Sony DSC-W5 (5 megapixel) camera with this one, and here are our impressions so far:1) The Anti-Shake AE is something new for us, as the DSC-W5 didn't have it.  Actually, we would get blurry pictures all the time in low-light situations with the DSC-W5 (which did not have Anti-Shake AE), and the new Nikon L18 does not seem to have as much trouble as the old camera did.  Low light pictures seem to come out great.2) This camera removed red-eye in the camera AUTOMATICALLY.  You don't know how much of a time saver this is!  My old DSC-W5 took crappy pictures when we turned on the red-eye protection, and the L18's pictures are MUCH better with the anti red-eye.3) This camera does a better job of focusing on people than my old DSC-W5 did.  It was pretty impressive to see multiple focal points on the easy-shoot mode.  The focus was spot-on.4) The colors are bright and vibrant.  Much more so than my old DSC-W5.5) The screen on this camera is HUGE.  We love the sharpness and brightness on it.6) It supports the new SD-HC cards.  That means we can put the new 4GB and 8GB cards in it, and aren't limited to just the 2GB ones.7) The Video capture (640x480 VGA) takes great, sharp AVI video captures.  Great for those times where you don't have your camcorder available.8) There is some limited internal memory in case your memory card gets full!9) You can have any picture come up on the startup screen.  So we took a picture of our name and phone number, put it in the internal memory, and set it as the start up picture.  That way, any honest person that finds our camera has the info to return it.All in all, this is no SLR or any other high end camera, but it does well what we need it to do - capture our four children and the wonderful moments in their lives.", "Date": "April 19, 2008"}, {"Title": "Warranty terror", "Author": "S. Turocy", "ReviewID": "R2XF6UVN8CPGET", "Overall": "3.0", "Content": "I have enjoyed my Coolpix L18!  It's a great camera!  I purchased it after purchasing the L14 as a gift for a family member and hearing the continuous 'bubbling' reviews about it.  The L18 is easy to use and also download your photos! Although I have had no problems with my L18, I have a word of CAUTION concerning Nikon- should you have any problems arise with their product, return it immediately!!!  The Coolpix L14 Gift had an 'error' within the first 3 months.  Following the troubleshooting directions, it appeared to correct itself.  Unfortunately, 5 months later the identical problem occurred again.  This time I retrieved the gift and returned it for repair under its one year warranty.  Nikon has failed to honor their warranty.  We were, however, able to reach their agreement to pay half of the original quoted repair cost.  Had it not been a gift that has been thoroughly enjoyed, I would not have given in to the blackmail.  Although the cameras are wonderful, the warranty is 'just a piece of paper.'  Nikon has left a stain on its wonderful product line.  I enjoy my L18 camera, but should anything go afoul, I will not go through that ordeal with Nikon again.", "Date": "September 30, 2008"}, {"Title": "Great camera... until!", "Author": "McKinney", "ReviewID": "ROC9QM1J9WHGG", "Overall": "3.0", "Content": "This was a great camera, but unfortunately the key word is \"WAS\".  I purchased the camera for general shooting, nothing fancy, and it worked great.  I replaced my Fujifilm FinePix with this Nikon Coolpix.  I enjoy the thinner design, making it easier to keep in a small purse.  The red shell adds nothing to the photos, but I'll take that over a dull gray any day.  Aside from aesthetics, there are many features packed into this stylish hardware, probably more than I've fully utilized.  As with any digital camera, the most important feature is point and shoot picture taking.  I hate the cameras that have 17+ picture modes and the rotating \"option wheel\" on top.  99 times out of 100 I am just turning the camera on and snapping a shot... I don't need to change any shutter settings.  This Nikon has a handy toggle on top that allows for picture taking, picture viewing, or video taking. The large LCD screen is vibrant and makes it easy to view photos.  It saves space by eliminating the old-fashioned \"eye hole,\" which is fine with me because I rarely use it anyway.  I'll take the larger LCD.  Red-eye was always a problem with my Fujifilm, but this Nikon did a great job of eliminating it; every photo seemed very clear and bright. I've also used the video feature a few times.  Unlike my Fujifilm, you can actually zoom in and out while taking video.  Video quality is nothing spectacular, but it is tolerable for short clips. Downloading the pictures and videos to my computer was a snap.  Again, Nikon won big points with me because this is the easiest camera I've used... and one of the cheapest too.  However, as I mentioned earlier, there was a catch.  After only 4 months of use, my photos began to have a hazy ring around them.  It looked like there was some fog or a smudge on the lens.  I've wiped the lens carefully, but the problem remains, causing me to believe that this problem somehow lies inside the camera lens - a problem I, of course, can't solve without having to call the distributor and get the run-around on how to get it fixed, despite my free one-year warranty-with-purchase.  A digital camera that takes blurry photos is no better than a paper weight, even if the paper weight is colorful and shiny.  Either the lens is out of alignment or my entire family has developed astigmatism.", "Date": "November 23, 2008"}, {"Title": "Disappointed", "Author": "L. Nguyen", "ReviewID": "R1T6Z0OAQ63NDH", "Overall": "2.0", "Content": "I own this camera for two weeks now, buying it as a replacement for a 5-year-old Canon S400 (4MP) as the battery is dying, and it was not that good when new either to consider a replacement.  The first few pictures I took from the L18 disappointed me but I gave it the benefit of the doubt citing my inexperience with Nikon products.  After trying to like it for 2 weeks, I gave in!  While I do not know the relation between this and the L14, I have to agree with most of the low rating reviews on the L14, and perhaps more.  Here are my overall impression with limited testing:1. Slow shutter speed: from the time you fully press the shutter button (after focusing) to the time the camera clicks to the time it actually captures the picture is long, very long.  In the first few pictures I moved the camera thinking it was done only to have the wrong frame captured.  This, albeit irritating, I can get used to.  But trying to take kids' expressions can be challenging.  Not to mention if you ask someone else to take your family picture while on vacation etc.2. Un even focusing: 7 people lining across the width of the frame, only the middle three are in clear focus, it degrades from there.  This is both with no zoom and 1/2 zoom, Auto mode.3. Washed out color: I spent a lot of time testing indoors, as this would be the most common use for us, though a few outdoors pictures did not look right when the sky and clouds are a part of the scene.  For indoors, it seems over-exposed with muted colors.  I tried setting color to Vivid and/or reducing Exposure Compensation, the only two settings I can find that may affect this outcome, which only slightly improved the image.4. Noisy: not audio but video.  If you open the picture with some viewer at full resolution you will know what I mean.  If you have some other camera to compare, try taking the same/similar resolution.5. Miss or near hit: to sum it up, I went to a function, took a lot of pictures indoors, all well within the rated flash range but only 50% of them were acceptable, as in you can make out who is who and what is what.  None I would even attempt to print and I had a huge disclaimer when sharing those to people who requested.Make no mistake, all pictures looked really good when viewed on the 3\" LCD, perhaps that is where they should stay.  On a scale of 10, if I give my antiquated S400 a 7, the L18 deserves a 2.  Perhaps I should rate it one star instead!", "Date": "April 15, 2008"}, {"Title": "Excellent Point and Shoot", "Author": "Paul Garland", "ReviewID": "RI5JGPTYQZPCK", "Overall": "5.0", "Content": "I have had many digital cameras.  At the moment I also own 3 Nikon SLRs, the D40/80/300.When I am out walking the dog in the desert, the L18 is the camera I usually take.  Picture quality is fine, and the really wonderful thing is you can use AA NiMh rechargeable batteries in it.  Battery life is good.For the price this is a great little light weight camera.", "Date": "May 14, 2008"}, {"Title": "Great camera, but \"EATS\" batteries!", "Author": "Larry D \"PC Larry\"", "ReviewID": "R2L8JOSKSYSUVT", "Overall": "4.0", "Content": "My wife needed a \"SIMPLE\" camera.  The L18 does the job.  It is super easy to use and she loves it.  Her only complaint is that she is constantly feeding it batteries.....she used alkaline.  We could start using rechargeable, but haven't tried that yet.  But the camera is GREAT!  Connection to computer for transfer works fantastic.  Recommended.", "Date": "November 19, 2008"}, {"Title": "Sleek and Red Automatic Camera", "Author": "Darena Shopz \"darenashopzatoutlookdotcom\"", "ReviewID": "RR6H2NI55ZY6C", "Overall": "4.0", "Content": "I must admit I bought this camera because of its features and price but mainly because its cute, slim and red. I previously used a Kodak Easyshare which I loved its ease of use but the picture color wasn't great and it eventually tore up so I decided to try the Nikon Coolpix.The Nikon L18 is a little different than I was use to using and I wasn't crazy about it at first but the quality of the pictures that it takes has really converted me over.The Nikon has some great features. It has 8.0 megapixels so if you've been using one with smaller megapixels then you'll have to get a bigger SD card if you want to continue taking around the same number of pictures before you download.It has a 3.0 in LCD screen which is really big, that's a great feature. It doesn't have a regular viewfinder which allows the camera to be slim but does make it a little harder to take pictures in the bright sun because sreens alone can be hard to see outside.The camera has easy auto mode, scene mode, movie mode and macromode. You can also directly connect to a TV, computer or printer.You can shoot in easy auto mode if you don't like to have to adjust your camera settings. In easy auto mode, you have face recognition where the camera will focus on the face. It automatically adjusts focus and flash. And has a wonderful feature, anti-shake, where the camera increases shutter speed when the camera or subject moves to cut down on blurriness.The camera has a self-timer.The camera has macro mode for taking pictures as close as 5.9 ins. This provides a clearer picture than just using zoom in the easy auto mode which can provide a grainer picture.In scene mode the camera automatically adjusts for several different modes. The scene modes include portrait, landscape, sports, night portrait, party/indoor, beach/snow, sunset, dusk/dawn, night landscape, closeups, museum, copy, backlight and panorama assist.While this is a point and shoot camera, so many different modes on the camera have made it a little more complicated to navigate but the quality of photos are well worth the effort. I still have to reference my user's guide from time to time but I'm very excited about taking pictures now.", "Date": "June 17, 2008"}, {"Title": "Fast Downloads!", "Author": "Griggs \"Griggs\"", "ReviewID": "RQVYYK09T0B5Z", "Overall": "5.0", "Content": "This was purchased to replace another digital camera that was broken.  The key feature sought was the large LCD screen.  The features of this camera surpassed our expectations.  This camera is used primarily for online auction photos of clothing and jewelry.  The close up photos are very good quality.  It downloads the photos to the computer in about 1/2 the time of the previously used camera.  The zoom is not as strong as the previous camera, but for the intended use it works perfectly.  The memory card purchased was significantly lower in price than for the other camera.  Very nice product for the price.", "Date": "May 3, 2008"}, {"Title": "Don't waste your time", "Author": "Jamal Khawaja", "ReviewID": "R7381VZQJYD3O", "Overall": "2.0", "Content": "Incredibly slow shutter speed - I ended up erasing half my pictures because all that was left was background or landscape - the action had already left.  A couple of times the gap between pressing the button and the camera actually executing was over 6 seconds.", "Date": "August 31, 2008"}, {"Title": "nikon coolpix l18 8mp 3x zoom", "Author": "S. Kim", "ReviewID": "R2F5FWHJRF9XX9", "Overall": "3.0", "Content": "pros:-Like the color options which make it stand out from the normal silver cameras that are out.-good picture quality for the price.-uses AA batteries, but batteries last about 2-3 days.-uses normal SD card for memory-can zoom in during video recordingcons:-very light, doesn't feel very durable?  plastic body?-excruciatingly slow reaction time.-interface takes some getting used to", "Date": "August 17, 2008"}, {"Title": "Very Fragile NIKON would not honor warranty", "Author": "Kristen Peerman", "ReviewID": "R1XRQ9K14BBMSQ", "Overall": "2.0", "Content": "This seemed to be a good camera with good resolution.  The Image stabilization is a nice feature.  I have owned 3 previous Nikon Digital Cameras.  The first two were first and second generation Digital Cameras.  Both had sturdy build and produced good quality images.  Then we received the Nikon Coolpix L6 as a gift.  This camera produced good quality images and nice features on Camera.  We had this camera for about year when my daughter dropped the camera from about 2 feet and the LCD broke.  At that time we purchased the Coolpix L18.  This time the camera was never dropped and the lens gave us a lens error after 2 months of use we sent this into Nikon to fix this as well as get an estimate on fixing the L6.  Well they came back and said that the L18 had been impacted.  I explained to them that this camera was never dropped and said that it may have been in the case and impacted against the body or something.  Well that is a very poor excuse for not covering a 2 month old item under warranty.  If carrying the item around could cause the item to become non operational and stop working, then Nikon needs to increase the build quality of their compact digital camers. Well the estimate to fix was over $100 and you can buy the camera new for just slightly more than that. So due to fragile nature of this camera I would not recommend and since Nikon refuses to Honor their warranty I do not think that I will buy another Nikon Camera. I have been looking to upgrade to a DLSR but still want a small camera for easy carry capability.  Well I used to trust Nikon quality but not anymore.", "Date": "October 29, 2008"}, {"Title": "Love This Camera", "Author": "Y. Taylor", "ReviewID": "R3DYN8CFKNB4JC", "Overall": "5.0", "Content": "I wanted a camera that wouldn't be too hard to use and this is it. The Coolpix Camera was recommended to me by a salesman. It is one of the best recommendations I've had in a long time. The camera takes great pictures, love the anti-shake, anti-red eye, zoom, face recognition, ease of use, just to name a few. I recommend the Coolpix 100% percent.", "Date": "October 2, 2008"}, {"Title": "I Love this camera!", "Author": "Taryn Rebuck", "ReviewID": "R2WEC4AKPDOI5K", "Overall": "5.0", "Content": "I recently had the L12, went on vacation and well they don't take well to getting in swimming pools! So I purchased this one as it's replacement. I love it even more! Has a lot more features and is very easy to use. It is very compact and the 3\" lcd screen is great. The only think I don't like is they put the SD card slot in the battery compartment. I like it better with it's own compartment, I take hundreds of pictures a month and I find it easier to take the card out of the camera and use a card reader on my computer, instead of connecting the camera to the computer.Over all I recommend this camera to all levels of camera users!", "Date": "July 10, 2008"}, {"Title": "Decent camera for the price", "Author": "K. Smith \"lovetoread\"", "ReviewID": "R1LFZJWLDXBX14", "Overall": "4.0", "Content": "When I went shopping for a new camera, I was going to get the Canon Power Shot, but this one had a few features that changed my mind.  This camera has the automatic anti red-eye feature.  My husband and son both have blue eyes, so I always have to touch up their photos.  Not with this camera.  Nice!  Also, my six-year old likes to take pictures and this camera had the anti-shake feature so you get clear pictures.  I have noticed that the \"scenes\" feature is not quite as cool as I thought it would be.  I've yet to take a good picture with the \"close up\" option.  It downloads very fast and it is far less bulky than our past camera.  Overall, I feel like I have a decent camera to do what I need with it, and I paid a decent price.", "Date": "May 12, 2008"}, {"Title": "A Lot of Camera for a Little Money with Poor Picture Colors.", "Author": "Brenda Piper Stephens \"BeaDaNurse\"", "ReviewID": "R2RSYDWZVYDJNR", "Overall": "5.0", "Content": "1ST REVIEW: Wow... I'm impressed. I purchased this camera because I wanted to \"downsize\" from the full featured, larger digital camera I own. This camera is very easy to use -- right out of the box, without reading a manual an inch thick. Very simply to use and packs a punch in versatility. One reviewer complained about the speed in which the camera saves a picture. Look at your SD card. That's probably where the problem lies. SD cards vary in speed, with the lowest class numbers being slower. I tried taking pictures with a Lexar and a SanDisk SD cards. (Neither one of the cards had a \"class\" marked on them.) The SanDisk was much faster. I'm going to return that Lexar. But, the camera is definitely a keeper. I would recommend a LCD screen protector as a worthwhile addition.2ND REVIEW: The above review was written BEFORE I downloaded pics into my computer for viewing & printing. This camera produces terrible color. I thought I had the settings incorrect, so I checked them and did a test shoot using the Coolpix L18 and a Canon Powershot S2. They are not exactly in the same class of cameras, but any camera should be able to closely reproduce the actual colors in the scene. The Coolpix was way off. Pictures shot indoors had too many yellow tones in them. And the poolside pics taken in bright sunlight made my pool look like it was overloaded with green algae, when in fact, the water was a beautiful crystal clear blue. Sorry Charlie, this camera is going back. I'll look into the small, point & shoot Canon line of cameras.Since I edited my original review, it would not let me change my star rating. After all, I would probably rate this camera as a 2-Star. The size is nice. And I like the fact that it uses SD cards (including the new high density ones), and AA batteries, which are easily obtained. But, it performs poorly in picture quality. And, isn't that was taking a picture is all about?", "Date": "July 5, 2008"}, {"Title": "nikon coolpix 18", "Author": "R. J. Butterfield", "ReviewID": "RRUCPYX1PES10", "Overall": "5.0", "Content": "Nikon Coolpix L18 8MP Digital Camera with 3x Optical Zoom (Navy) This is the second Nikon coolpix I've purchased through Amazon..Long story, lost the first one,bought the same camera, easy to use, big screen in the rear, just a dream to use.. the pics are first class. The camera has so many options, most of my pics are savers.... I've owned many cameras, but this is the best of best... thanks bob", "Date": "July 27, 2008"}, {"Title": "So simple my mom can use it!", "Author": "roy", "ReviewID": "R1I1ODVUAOTMTK", "Overall": "4.0", "Content": "Nikon Coolpix L18 8MP Digital Camera with 3x Optical Zoom (Ruby Red) I purchased this camera for my mother who was going on her first cruise. Before my purchase I read about 200 reviews some very positive and some very negative so I will attempt to make this review a bit different.PLAIN AND SIMPLEWhat you need to know is this. You are buying a hundred dollar camera, what you get is a hundred dollar camera. The Nikon L18 is phenomenal for the novice user who isn't looking to take pictures for the Associated Press or the latest ad campaign. The L18 is compact and takes nice pictures and descent video, 640x480 at 30fps with sound (good enough for your upload to your favorite video site).BAD REVIEWS?I think most of the bad reviews came from people expecting to get a $500 dollar camera for $100. The bottom line is if you are looking for $500 dollars worth of features then look for a camera with a suggested retail price of $500. If you are looking for ultimate picture control then why are you looking at a camera that costs $100? If you are a very advanced user and you are looking for yourself a camera then why are you reading this?THE REVIEW THAT DID ITI knew this was the camera to get when I read a review where a guy said \"I bought one for my mother, wife, and sister all who are not very tech savvy at all (my wife can barely operate a dead bolt lock)\". I said to myself \"now that's the camera for my mother\" and the L18 delivers simple operation even if it's not as easy as a dead bolt. The \"Easy Auto\" mode makes photography easier by taking control of settings, so you simply turn on the camera and shoot freely. Easy auto mode even takes most of the advanced option away from the menu so a novice user can't muck up something.OPERATIONThere is literally a button for On/Off, Mode (Photo, Video, Scene) and Play (Slide Show), it can't get much simpler than that. The 3 inch screen is nice and bright and helped out a lot with that whole cutting off of heads (even without her glasses) that seem to have plagued my mom. The Scene mode gives you options like Portrait, Night Portrait, Sports, Landscape, Party, Beach/Snow, Close Up, Copy, Back Light, Panorama Assist... I pretty much instructed my mom to stay off that mode (a bit too many options) but for the more savvy novice user I say go for it!OTHER STUFFBattery life is decent but what you have to know is that with the screen being the only viewfinder batteries tend to go rather quickly. That being said I came to appreciate the use of AA batteries, easy to replace and readily available. You probably want to invest in some batteries specifically for advanced electronic equipment, pick up a 4GB card while you're at it.THE RESULTMy mother came back with photos and videos from her cruise, though I could tell some videos were initially intended as pictures and versa ves but who among us haven't forgotten what mode they were on? She appreciates that she can take her SD card to the nearest drug store photo kiosk and we were even able to teach her how to plug her SD into a printer and get her photos prints out. She also manages to plug her SD into her digital picture frame. She loves her L18 and now feels that she is a digital guru and we don't DARE tell her anything different.Put it this way. My mom being able to take pictures and record video clips is nothing short of amazing and I couldn't find another camera that I thought could get her to that point. Either you'll turn your novice into a digital guru or buy them a hundred dollar paperweight (take the chance).", "Date": "January 15, 2009"}, {"Title": "Not a great camera", "Author": "Marjorie L. Moniz \"Marjorie\"", "ReviewID": "R30X1E230GY9NF", "Overall": "2.0", "Content": "The pictures has a lot of noise in them. I'm returning it tomorrow. Guess you get what you pay for!EDIT:To be fair I must correct my above review. I have had the camera for a month now.(Hubby convinced me not to return it right away) Took it on a trip to WDW last week and it did an awesome job with my photos. I found that using the anti shake degraded the photos. I turned it off, used exposure compensation (-0.3) and vivid color, set on auto.  My photos turned out 100% better. It's a great camera for carrying around with you for those spur of the moment photos. I save my Pentax DSLR for my portrait and important photos but this one does a great job on my spur of the moment photos...", "Date": "April 24, 2008"}, {"Title": "CoolPix Camera", "Author": "Rheadawn Brown \"RDBrown\"", "ReviewID": "RM1Q22MER1P86", "Overall": "4.0", "Content": "I bought this camera for my daughter.  She loves it.  It videos, zooms, and takes still pictures.  It's very handy and fits in your purse or even coat pocket.", "Date": "December 23, 2008"}, {"Title": "nice camera", "Author": "Karen L", "ReviewID": "R1MLIJJ0M8TWWR", "Overall": "3.0", "Content": "Nice camera. It sucks down AA batteries and can be kind of hard to zoom all the way in. But overall, not bad.", "Date": "September 21, 2008"}, {"Title": "Cool Pics", "Author": "Murissa Jack", "ReviewID": "R1C0HP8KXG2VEK", "Overall": "4.0", "Content": "I love this camera, it's lightweight takes amazing pics.  I love the anti-shake feature my last camera didn't take good photos of someone while they were in motion and this does.  Takes great pics in complete darkness with the flash feature.  Overall great camera the price was a little high but it was worth it and I adore the color red it's makes it stand out and easy to recognize.", "Date": "September 19, 2008"}, {"Title": "It is what it is", "Author": "stlbluejay8773 \"stlbluejay8773\"", "ReviewID": "R31KVDP67D32OZ", "Overall": "3.0", "Content": "Likes:-- Easy to use menus-- Large LCD screen-- Is ready to shoot as soon as you hit the power button-- Uses AA batteries-- Slim sizeDislikes-- Picture qualify leaves something to be desired.  Inside shots are always too dark.  Have tried numerous test shots in all different modes and still can't get pictures as good as my 5 year old Olympus C740 3MP.-- Pictures on the LCD screen look great, but look below average once downloaded to my computer.  I have to do a lot of editing on the photos I want to keep to make them look acceptable.Conclusion:  This is a fine camera if you are an average consumer who just likes to have a camera with you at all times to \"catch a moment\" and want something a little better than your camera phone.  If you are more serious about your photos, I would go with something else.  I give it 3 stars base on design and ease of use.", "Date": "August 4, 2008"}, {"Title": "Great Camera !", "Author": "Abraar Hussain \"a233393\"", "ReviewID": "R2F98KJ5P4BXO3", "Overall": "5.0", "Content": "It's a really great camera. I bought this camera from Amazon.com for my recent trip to London, England. Easy to use and picture quality is awsome! The camera settings are already configured and there is no need to manually adjust the settings (the default settings are fine to use, but the option to tweak the settings is available if really want to). Overall, great camera for a reasonable price.", "Date": "July 17, 2008"}, {"Title": "Never buy Nikon again", "Author": "Robert \"BobGoblin\"", "ReviewID": "R1F0YWP2L8PLCA", "Overall": "1.0", "Content": "I bought my camera in November 2008.  It is now May 2009.  I have probably used my camera a total of 2 hours since purchasing it.  During that 2 hours of operation, I have gone through countless pairs of batteries--I think many may believe I am exagerating how many batteries this camera has eaten during so little time of operation.  Further, I just plugged in into my compouter to upload some photos from the camera to my computer-the screen gave me a message that the new batteries I had installed are exhausted, and the screen then went blank.  I replaced the batteries and--the camera no longer works!  Apparently, it sat on my desk so hard it broke (yes, I am being sarcastic).  Now, I am trying to find my receipt.  Whether I find that receipt or not, I will NEVER buy a Nikon again, ever!  Yes, the camera takes good photos, but it does so at the expense of a new set of batteries every other time I turn it on, and by breaking after only a few hours of operation, having been extremely well cared for (never dropped, never subjected to any stress or moisture).  This camera sucks!", "Date": "May 16, 2009"}, {"Title": "It is what it is and nothing more.", "Author": "Ricardo", "ReviewID": "R8KDU5R5QXOX0", "Overall": "3.0", "Content": "I recently purchased an L18 for my 30 year-old son who knows nothing about photography. He simply wanted an easy to use digital camera.Having been involved in photography for the past 40 years, I've used everything from Leica M's to current Nikon DSLRs and everything in between. However, this camera was not for me. It was for someone who could not care less about how it does things, as long as it takes good pictures.About all that I did with the camera was to unpack it, check that it was working properly and set it up (what little there is to set) for purely point and shoot photography.During the course of setup, I did take a few shots and downloaded them to my PC. Nothing special, just to see what the quality was.Personally, this is not a camera that I would want for myself. I found it entirely too \"automatic\", which is not what I want, but what my son wants.Picture quality was decent. Dynamic range is on the low side, it does tend to overexpose a bit (maybe 1/3 stop) and the \"anti shake mode\" is nonsense as all it seems to do is raise ISO to the point of introducing digital noise.I don't consider the quality to be on par with more expensive models from Nikon or other brands. However, for viewing on a PC, email or smaller prints, it produces acceptable results.If all you want to do is point the camera and press a button, you could do a lot worse. The quality of the product and the images it produces does not exceed its pricepoint. As I said above, \"it is what it is and nothing more\".", "Date": "December 18, 2008"}, {"Title": "Nikon Coolpix L18 Review B+ Rating", "Author": "A. Hayes \"A. Hayes\"", "ReviewID": "R32GI4BSVRM0LZ", "Overall": "4.0", "Content": "Overall, I would say this camera provides a lot of \"Bang for the Buck\" but it does have it's share of problems.By no means is it a point and shoot digital, because you really must use specific settings for what you are trying to take pictures of.  There is a point and shoot mode, but it provides substandard pictures.  This basically means that you are constantly changing modes for different pictures.  BUT when pictures are taken in the correct mode, you are provided with excellent high quality pictures. For picture quality, I give the camera an A, but because you must be in the correct mode at all times, I must drop it down to an A-.I bought this camera mainly for taking videos of ball games and my son's marching band and this is where the disappointment comes.  This camera's microphone is soooo sensitive that it distorts sound to the point that it is unbearable to listen to.  We have contacted Nikon and they have no fix for this problem and say there are no settings in the camera to change the sensitivity. For every day videos of people talking, the sound is okay - but at all ball games when people are loud or when the band is playing loud - forget it.  This camera fails horribly.Another video problem is this.  When taking videos, as long as the subject doesn't move out of depth of range and as long as the photographer does not move - all is okay. BUT - if either the subject of photographer moved out of depth of range, the video goes blurry.  You must zoom to depth, stay there, and then shoot the video.  There is absolutely no zooming in or out once the video begins - well, you can zoom in and out, but you don't want to because everything goes blurry.So, because of these problems, I would have to down grade the camera to a B+.Still yet, for a camera to throw in your pocket and go - it's good.  Just don't expect anything to write home about.", "Date": "September 7, 2008"}, {"Title": "Good Camera; Worthless software included", "Author": "AJB \"AJB\"", "ReviewID": "R3IXOVWNSTKND6", "Overall": "4.0", "Content": "I like this camera a lot. Good speed and image quality for the value. After seeing the Canon A580 I think I may have purchased that one, but I was looking for something very user friendly for my wife, so this works fine. The one feature that I find oddly cool is the \"Panorama Assist\", which helps to create good panoramic images. Basically, after you take the first picture, it keeps part of the picture on the screen while you look live at your target which allows you to line up the next shot...Really cool, and a smart feature.  (it may have been around for a while, but I'm a Canon user) :)My only issue is with the terrible software included. There is no editing software included....who does that??  It includes a panorama maker and a transfer software, and quicktime...because that's supposed to be helpful or something....The \"Nikon Transfer\" software...first, its ugly...looks like something a teen developer made. No style to it, but it doesn't do anything worthwhile besides a bridge (that didn't work until several restarts later) to download the stuff. [...]And to edit, get a free Adobe Photoshop online account to store and edit your pics.", "Date": "August 5, 2008"}, {"Title": "Entry Level Camera, Entry Level Performance", "Author": "M. Kaainoa \"Kekailoa\"", "ReviewID": "R3PRM2ZABTQL5", "Overall": "3.0", "Content": "I have used high end digital cameras, but not SLRs. It is important to keep in mind the Price of this product when reviewing performance. I have found that it is what you should expect in a \"Bigger is Better\" society. The large MP are for marketing, not for beautiful pictures. Compared to other sub $150 cameras, it is not bad. Get a Canon a570/590 for entry level performance, but this camera is for my older parents. The large 3\" screen and simple Nikon interface was what sold them. The picture are not worth bragging about, but it will be enough for their use. Not disappointed, but nothing I didn't expect when spending as few dollars as possible.", "Date": "May 19, 2008"}, {"Title": "Great until it breaks!", "Author": "S. Krieger", "ReviewID": "R3EDFD58KVGDQ7", "Overall": "1.0", "Content": "It is very common for this camera to break with a \"lens error.\" I had it for only two months, and it was not dropped. One day, I went to turn it on and it said \"lens error.\" After researching this error for this camera, it turns out that this happens frequently with this model. It needs to be repaired when this happens. The pictures were great, though, so if you do not pay much for it, and are willing to pay for the repair, the pictures turn out nicely. Great point and shoot...until it breaks!", "Date": "July 8, 2009"}, {"Title": "Amazing", "Author": "Laurel Cannon Alder \"book mama\"", "ReviewID": "R3CQEHCWYASDI1", "Overall": "5.0", "Content": "Nikon. Coolpix. From the beginning of time both men and women have sought ways to make and take pictures. First cave dwellers, then ancient Egyptians, and Indians, Degas Rembrandt Monet, Leonardo, Picasso, and so many more have been great artists trying to record feelings, scenes, extraordinary events. But now the common civilian with the Nikon Coolpix L18 digital camera in hand can become a great artist with a single shot, by using the amazing features of the digital camera. The Nikon Cool pix digital camera is sleek and equipped with a whopping three inch screen and a great zoom to help you on your way to becoming a great artist. The big LCD screen makes it easy to view your subject and review your pictures. The technology in the screen is advanced enough that you cannot see the pixels well. The zoom is a little above average for its size but what makes it cool is that there is an anti-shake feature so that when you are zoomed all the way you don't get a common blurry picture like from other cameras. Another great thing is the size of the L18 Coolpix because it is so small. Someone could easily slip it into a pocket and forget it is there. Some negative points about the camera are that for the screens immense size there is no traditional view lense.  The only reason that might be a problem is if you are in a sunny spot and the LCD screen is tough to see.  There are only four functions on the camera: easy auto, auto, movie, and scene.  There are more features on a Sony or a Canon.  Although, one might say that simplicity can be bliss.  The camera itself can be slow to load after taking a picture to get back to the main screen on the camera. Unique features about the camera are the large three inch screen, anti shake feature, and D-lighting. D-lighting can only be found in Nikon cameras.  The purpose is to add or take away light from under-or over-lighted images.  The camera also has 8 mega pixels which is nice for viewing pictures.  The only thing Nikon could add to make this great camera better would be a traditional view lens which would add bulk or take away from the gorgeous screen.  Together, this camera is great and is a good starting out camera. It was well worth waiting for my Nikon Coolpix L18 Digital Camera so I could become a great artist or photographer.", "Date": "January 29, 2009"}, {"Title": "Great point and shoot camera", "Author": "L. Kellagher", "ReviewID": "R2E47BAIVZ1GTH", "Overall": "5.0", "Content": "We bought this camera for my parents for Christmas.  They are over 80 and this is their very first digital camera.  We could not have made a better choice.  This camera was easy to use right out of the box, even for my dad, who never handled a digital before.  Every picture seems to come out crisp and clear.  The best part is the 3\" screen - that makes it perfect for older users.", "Date": "December 29, 2008"}, {"Title": "Not impressed!", "Author": "Jill Ruffalo", "ReviewID": "R31QHQRZ49KYNZ", "Overall": "2.0", "Content": "I owned a Nikon Coolpix L3 for a year or two, but it broke after dropping one too many times, so I figured I'd go for an updated version & purchased the L18. The exterior appearance is nicer (i.e. the color, size of screen), but nothing works as well as with my other camera. I always have to push the ON/OFF button several times before the camera turns on & I have to press the button to take pictures more than once, especially with the first picture I take after turning the camera on. Takes forever to take a picture too. As if that's not enough, I cannot get the software that came with the camera to work, so I am not able to upload ANY of the pictures I have taken since I bought it. So not only is it way too difficult to take a picture, I can't even get them onto my computer! I'm beyond frusterated with this product & I would NEVER recommend it!", "Date": "October 29, 2008"}, {"Title": "Was working fine, until...", "Author": "AJ", "ReviewID": "R40LVLSTPXTV8", "Overall": "2.0", "Content": "I bought my camera a little over a year ago.  It was my first digital camera, and I was very happy with it at the time.  Recently, though, the lens got stuck, and the LCD screen said 'lens error'.  I followed the instructions which said to take out the batteries for a day, and put them back in.  That trick worked for a few days, but then it got worse.  Now, the lens is totally stuck and I can't do anything with the camera.I called their customer service area, and was able to get them to tell me it could cost $80 to $120 to repair #could not get a free repair since the 1-year warranty had lapsed#.  I then checked with a local authorized dealer who stated it would cost around $100 to repair.So, needless to say, instead of getting it fixed, I am just going to shop around for a new one.  Why pay to fix this, and possibly have it happen again, when I can just buy a new one, for possibly less money.  Live and learn, live and learn....", "Date": "May 24, 2010"}, {"Title": "Beware of Ritz camera", "Author": "E. Berg \"LadyJane\"", "ReviewID": "RQGH3VKPCK208", "Overall": "3.0", "Content": "I bought this camera as a Christmas present for my mother who needed a decent easy to use camera. I never saw any pictures from her and wondered why she wasn't using it. Needless to say, the camera's manual was completely in Spanish! And, one of the USB cables (PC connector) was missing. Anyway, I tried calling the customer service # on the invoice and cannot get through to an operator. I'm now going to the Nikon site to see if I can download the damn manual. I don't recommend ordering from this company at all.", "Date": "July 27, 2009"}, {"Title": "Hardly used but acts like its been through alot!", "Author": "DAVID E. MCCARTHY", "ReviewID": "RC5DK8N4U49T6", "Overall": "2.0", "Content": "Bought this a a Xmas present for my teenager. He hardly used it for the first few months then recently took it on a camping trip. He took almost 200 pictures which look great but when he tried to download the pin connector wouldn't work. Cable did not fit well and it looks like the pins all bent over. Then the screen went blank also. I got the pins straightned and the LCD screen works again but the connector is shot. Estimate on the repair was almost $90 for a camera I paid $97 for. Should have stuck with a better known brand with better repair service.", "Date": "May 10, 2009"}, {"Title": "MAY AS WELL BE DISPOSABLE.", "Author": "M. McMillin", "ReviewID": "R23FB7REZZQYL6", "Overall": "3.0", "Content": "I loved it in the begining, takes great pictures and was easy to use. Three Months later we took picture and shut the camera off. The lens retracted crooked. I swear to you it was not abused. I didnt expect Nikon to cover it any way. I am more disapointed in the Target 3 year extended service plan that I purchased along with it. I was assured that any thing that Nikon wouldn't cover would be picked up by them \"Even if i dropped it\". I should have known better.It was a darn fine camera otherwise.Bottom line folksIf you own one be very careful with it,If your going to buy one Say No to the extended service plan.", "Date": "February 18, 2009"}, {"Title": "Eats Batteries!", "Author": "JMPIII \"Average Dad\"", "ReviewID": "R1BXA8QL6RUB1D", "Overall": "2.0", "Content": "This camera takes pretty good pics for the money, BUT it eats batteries even if it is switched OFF!...sit it on the shelf for two weeks and the batteries are dead. You cannot use rechargeables either...DO NOT BUY, but if you do, then buy a 100 pack of batteries.", "Date": "December 31, 2008"}, {"Title": "Too Fragile to be a Kids Starter Camera", "Author": "a mag", "ReviewID": "R1TJWTCJOPSAHI", "Overall": "2.0", "Content": "My 12 year old was really excited to get this camera on Christmas morning and had gobs of fun with it. She took it everywhere (in a fashionable soft case) taking pictures every chance she could. Loved it.Unfortunately on Day 5 of ownership she pressed on the LCD monitor too hard while cleaning it with a soft cloth. And that's all it took. The  LCD display is now fragmented and unreadable. Without the LCD the camera is worthless Landfill Toast. Our local dealer, the same one who raved about it as a kids starter camera, advised us the fix will be more than the cost of a new one. As you read other reviews I'm sure you will notice that the Coolpix lens is also prone to malfunction and breakage.For those reasons I would not advise this camera for children, even those adept at handling iPods and cell phones and laptops. We will not consider replacing with the Nikon Coolpix line. There are other manufacturers who have more durable low end cameras and that's where we will be headed.This was a painful lesson. Hope this saves somebody a little heartache.", "Date": "December 30, 2008"}, {"Title": "Great for the price, simple", "Author": "Amazon Customer", "ReviewID": "R22XG5R959RHGC", "Overall": "4.0", "Content": "Gave this to my mom (65+) as her first ever digital camera.  She doesn't even use a cell phone.  Works great in the full auto mode.  She was able to figure it out in a half an hour of practice.Only drawback I've seen is the picture review time after taking a photo is not configurable.  The photo only stays on the screen for about 2/3rds of a second after you take the picture.  To see it again, you have to poke the 'play' button.Focus is good enough - misses getting an autofocus lock about 1 in 5 times indoors under fair to poor light.  Not as good as my Panasonic, but better than nothing.Feedback is great - easy to tell if you have focus, intuitive beeps (single for focus, double for missed focus, etc).Picture quality is good enough - you won't be making prints to hang in the Guggenheim, but for snapshots it's fine.", "Date": "December 28, 2008"}, {"Title": "Great camera for the money", "Author": "K. Puckett", "ReviewID": "R3UI1JSVF3P7YD", "Overall": "4.0", "Content": "The camera makes good pics. Nothing complicated.  We are enjoying it!  Good camera for a reasonable price.", "Date": "December 25, 2008"}, {"Title": "excellent", "Author": "A. Villalobos", "ReviewID": "R3NDDDC5IHYSGT", "Overall": "5.0", "Content": "This camera is easy to use with a great viewing screen. Pictures after taken are very clear to see even when taken from a distance. Its very compact, fits in the little zipper area of a purse. I love this camera and take it everywhere.", "Date": "December 25, 2008"}, {"Title": "okay", "Author": "Margaux Paschke", "ReviewID": "RJGDX0OTNSMLU", "Overall": "3.0", "Content": "This camera is worth it if you can get it cheap.  Originally, I needed to replace my Olympus camera and wanted a less expensive in-between camera that could do the job until I bought another Olympus.  I heard good things about the Coolpix and Nikon is a good name so what could I lose?*  The 3x is not much and not a great option for vacation or scenery photos*  The automatic focus is not the best - the most disappointing feature*  It takes a few moments to take a photo which can be stressful when dealing with small kids or any moment that passes by all to quickly* the color quality leaves something to be desiredThere are good things about this camera: small compact size makes it easy to carry around; easy to use without reading the instruction manual; large 2.3\" viewing screen; loads of options; includes CD to provide even more options; and uses SD memory card.Bottom line, I am saving up for another Olympus because you do get what you pay for and this camera is not worth much for people serious about their photos.  I will keep it for my young kids to use.", "Date": "December 22, 2008"}, {"Title": "Happy with camera", "Author": "CRam76 \"dvdqueen76\"", "ReviewID": "R2QA6XVWZ90QHY", "Overall": "5.0", "Content": "Mom bought this camera in red and I tried it out. I loved it so I bought this one in blue. Makes taking pictures easier and clearer. Love it alot better than my old canon one. Would recommend!!!", "Date": "December 21, 2008"}, {"Title": "Excellent small camera", "Author": "B. Ince \"waterwitch\"", "ReviewID": "R37N6C7A9AGR4Z", "Overall": "5.0", "Content": "This was purchased as a Christmas gift and the recipient couldn't be happier with it!  It's easy to use, the controls are simple, the options are plentiful and the picture quality is outstanding.  In addition, the samll size makes it easy to take everywhere with you.I have a slightly older model and it's with me at all times!", "Date": "December 21, 2008"}, {"Title": "coolpix", "Author": "Denis Munoz-plaza \"retired geek\"", "ReviewID": "RIR592N81ASSS", "Overall": "5.0", "Content": "great camera, very easy to use and the large screen is clear, makes taking pics easy.", "Date": "December 20, 2008"}, {"Title": "Good value with nice video option", "Author": "Nei Baon", "ReviewID": "R3U79MY2PXK4HP", "Overall": "4.0", "Content": "My husband bought me this camera so I could always have it handy in my purse.Pluses:  Compact; battery friendly - 2 AAs take a lot of pictures; nice viewing screen; unique \"portrait\" feature that tracks the face; quick and easy video camera with decent picture and stabilization. (Video option much handier than our camcorder for getting spontaneous footage of our 3-year-old daughter.)Minuses:  Pictures not as crisp as I would like; shutter lag. (Of course, I'm used to my husband's high quality digital SLR).Overall, I think it's a good value - so much so that I'm getting one for my mom for Christmas.", "Date": "December 18, 2008"}, {"Title": "Nikon Coolpix L18 New Owner", "Author": "Amazon Customer \"Celrose\"", "ReviewID": "R3PPQK4356T52E", "Overall": "4.0", "Content": "I found that the service at Amazon is excellent. They actually deliver what they advertise and they are very prompt with their delivery. I purchased the Nikon Coolpix L18 and I really like this camera. I find that Nikon has a really good screen and you see the picture as it is. Even when I transfer the pictures to my pc the images does not change colour. It is a very handy camera to have as it is very light weight and easy to use.", "Date": "December 16, 2008"}, {"Title": "Great 8MP digital camera for reasonable price", "Author": "Motilal Singh \"Gadget guy\"", "ReviewID": "R3ETKTKOXTV1B2", "Overall": "5.0", "Content": "It's simple to use and takes a great quality photos. The only difference between this one and its newest, more expensive model is the size...honestly I like being able to have more of a grip on my camera like this one provides. Save yourself some money and get this model unless you really want a small camera. The size of the screen is wonderful and it takes pictures fast. I would recommend this camera to anyone of any age.", "Date": "December 12, 2008"}, {"Title": "Great for the price, but get rechargable batteries!", "Author": "Miss Lexiloo \"Lexiloo\"", "ReviewID": "R3L1M4F5OVWFVO", "Overall": "4.0", "Content": "This camera takes great pics with very little user effort and/or knowledge required. However, it burns through 2AA's in a day or two (at least the cheap ones that came with it). Luckily rechargables are pretty cheap.Also be sure to get an SD card, because the camera's internal memory only holds about 5-10 pics.", "Date": "December 11, 2008"}, {"Title": "A Great Little Nikon", "Author": "Bob Ferguson", "ReviewID": "R2HZG03E2VL8M5", "Overall": "4.0", "Content": "This Camera is Great, with just a few things I did'nt like about it.But, for the prices, between $86 and $100.00 dollars, I've seen recently, this camera is a steal! Things I like about my camera. Nikon name and it's glass lens. Most and few of the other cameras in this price range had cheaper, plastic lens. Automatic control that mimics real creative shooting manualy. At first, I though I was going to loose out with an AE camera, not being able to choose ISO and Shutter Speed Settings; but I was wrong, each picture I've taken and like so far, have been right on with this camera's AE and Mode Exposure and ISO settings. Sports Shots, Movement, Freezing people and cars moving, Landscape and Beach Shots, all great, and with none of the mistakes an incorrect manual setting could give you in your final pics. So, I say, Let the camera do the work. And what can you say, Trust your Nikon.  Great other features, Night Landscape. Night Scenes with out the grain of film. Smooth Video Mode for 'film' like video shots, either day time and nighttime with some grain. but I like grain, 'film' like, as it were.Now, the bad things about the camera. Do'nt record your video and sound at the same time for your 'YouTube' epic. The sound is very bad. Although you could use a mini-disc or other digital recorder to record your sound for your mini-movie. Night Shots are shakey when movement is envolved.But, these two things are so far the only thing I do'nt like about my new camera. Oh, did I mention the great colors that mimic good old Kodak and or Fuji film. And people do'nt mind you taking there picture, because, it's so little and non-threating, try that with a digital SLR or Video Camera Outfit. Great Camera, Great Price, Great Deal.", "Date": "December 8, 2008"}, {"Title": "Cool Coolpix L18", "Author": "James Leighton \"California Cliff\"", "ReviewID": "R1ROLNZOP2BTW3", "Overall": "5.0", "Content": "Excellent purchase!  Fast shipping no issues.  Great Camera!  Easy to use and quality pictures and video.  I used it at a school presentation and got nice clear pictures and video from my seat in the audience, clear sound too.  Good value.", "Date": "December 2, 2008"}, {"Title": "Great for the Price!", "Author": "Julie E. Carpenter", "ReviewID": "R3DWABP06Q1J07", "Overall": "4.0", "Content": "We recently purchased this camera after we heard terrific reviews from family and friends who owned it.  \"Amazing camera for the money.\"  I have a 5 month old and capturing the \"moment\" is quite difficult.  With this camera, the moments I've successfully captured look great, however it is a bit difficult getting a good focused picture on him.  Also, the camera definitely needs a protection case.  After not even 1 week of owning, the camera barely hit the side of a chair and now makes a ticking sound when the lens is opened.  I don't want to know what would happen if it was dropped, especially with that big LCD screen.  All in all, very pleased with the quality of pictures!", "Date": "September 14, 2008"}, {"Title": "EXCELLENT CAMERA!!  EXCELLENT PRICE!!", "Author": "Gary Saylor", "ReviewID": "R20B4NVQS4KA1Z", "Overall": "5.0", "Content": "This is the 10th Nikon camera I've purchased this year.  I own two myself.  The others I've purchased for friends.  Nikon's \"L\" series cameras are ultra-easy to use, are feature-packed and have a HUGE LCD screen.  My $250 Coolpix s50c has the same screen.  I would suggest this camera (or any others in the \"L\" series line, including the Coolpix) to anyone who wants great pictures and all the cool features for a really low price.", "Date": "August 10, 2008"}, {"Title": "Slow, eats batteries & poor warrenty service", "Author": "B. Coleman", "ReviewID": "R6YBUJGS3D6MI", "Overall": "1.0", "Content": "I bought this camera for its size.  I found its menus counter intuitive.  It ran through the first batteries after 10 pictures.  It had trouble focusing.  It was slow take the picture.  After 6 weeks, the lens cover refused to close.  Nikon declined to fix it under warranty, instead offering to fix it at a cost equal to that of a new camera.", "Date": "March 22, 2009"}, {"Title": "Easy, fun, compact, and cool: I really like my coolpix!", "Author": "Nathan Andersen \"film lover, philosophy profe...", "ReviewID": "R1BWGB3LJBBSQW", "Overall": "4.0", "Content": "This is a great little camera, that is easy to use ... just point and click and the picture comes out pretty good pretty much all of the time.  Sure there are better cameras, but you've really got to know how to use them to get anything better than what comes almost automatically from this camera.  For the price it would be very difficult to surpass the quality and ease of this handy little item that fits nicely in the pocket and is ready to go when you need it.I own a Mac and a PC, and have had absolutely no difficulty uploading my images to either computer.  I am not a professional photographer, but just want to be able to share images with my friends and family, mostly by sending them over the internet and posting them to facebook.  For those purposes, this camera is ideal.I've owned earlier versions of the Nikon \"Coolpix\" and what I really like is that with each upgrade they have added valuable features but have found a way to avoid making the camera feel more complicated.  I love the new automatic red-eye removal feature, and the image stabilization works very well.  (By the way, I still have my older \"Coolpix\" cameras, and they still work fine -- as far as I can tell, they are built to last.)Nate Andersen", "Date": "November 30, 2008"}, {"Title": "Great Camera! Bought it for my wife.", "Author": "J. Haggard", "ReviewID": "R37KLFEE5UG4M1", "Overall": "5.0", "Content": "We had an Olympus camera that broke, then we had a Pentax brand camera that broke and my wife decided she wanted this camera. I ordered it for her trip to Vermont she was going on and it arrived in time. She took may great pictures and they turned out amazingly well. The colors were vibrant, everything was in focus. This really is a great camera for the price. Is it for the \"pro\"? Probably not, but it works just well for anyone that wants to point and shoot. One of my favorite things is it takes AA batteries so you can easily get replacements if needed. Great camera!", "Date": "November 4, 2008"}, {"Title": "Nikon does not stand behind their warranty!", "Author": "Frequent Buyer  757", "ReviewID": "R33SARAFFEMN05", "Overall": "1.0", "Content": "Camera has been very well cared for, but had an electronic problem after a couple of months.  An IMAGE of a crack showed up on the screen.  Sent camera to the Nikon service dept, and was told warranty was invalid b/c they thought the damage was due to a high impact.  The camera does not have a scratch on it.  After further discussion with the management, they said it could have been damaged due to water.  Neither of these were true. Nikon does not stand behind their warranty.  I have read other reviews with similar stories.", "Date": "December 9, 2010"}, {"Title": "Ordered for Refurbished but received the one which looks like USED.", "Author": "truereview", "ReviewID": "R1IX61D61QRWIM", "Overall": "1.0", "Content": "I have Ordered for Refurbished camera but received the one which has lot of scratches on it and looks like USED for several days by someone!!! The scratches are all over the camera and even the letters on the buttons were disappeared.", "Date": "September 12, 2010"}, {"Title": "Just bad!", "Author": "D. Nguyen \"Danny\"", "ReviewID": "R2ECZR0XCSVBPL", "Overall": "1.0", "Content": "First of all I consider myself as an amateur photographer  even though people have paid me for photo shoots.  Although I shoot mostly with DSLR's I have had owned many point and shoot cameras. My office decided to buy a few of these cameras because the boss is old school and wanted a camera that used AA batts.  This camera is horrible!  Don't expect to take action shots with this camera.  The delay between when you press the shutter and when it actually takes the picture is about 4-5 sec.  Some times you may get lucky and get a picture within 3 sec but that's rarely.  The problem is that it takes about 2 sec to just focus and another 2 to take the picture.  We use the cameras to take pictures of job sites so I don't take any action shots but because of the delay I've skipped taking some pictures because some times in never even would take the picture.  I would just hear the camera trying to focus.Some times I've tried the camera to take macro pictures of equipment name plates and even with the macro setting on the pictures would be blurry.  We have 3 of these cameras and none of them have ever had a focused macro picture.  I've found that my cell phone camera takes better macro pictures.We've had these 3 cameras for 2 years now and the only reason why they still work is because everyone in the office tries to get the other Canon cameras that we have before they have to take these cameras.", "Date": "May 12, 2010"}, {"Title": "Let me tell you what I did!", "Author": "RWm \"Rick\"", "ReviewID": "R1VOU3PWWSK4OU", "Overall": "5.0", "Content": "I once brought a Kids camera for my 5 yo.  He loved it.  It was garbage.  It ate batteries.  It had a junk 1\" screen.  It took HORRID picures.  AND It cost me $45!!  Awful!!!So I did plan B.  I brought this camera refurbished.  At the time it was $75 with shipping.  I gave it to him.  Forewarned him about always using the strap and not touching the lens.  I must have told him 100 times.  He knows now and is careful.HE LOVES IT.  He doesn't want to print the pictures(never did).  He just takes shots and records movies.  He takes hundreds of them.  Some nice ones!  He can edit them on the camera too.  He figured this out on his own.  A 5 yo.  (So what does it mean for those that complain about the controls...)This is a nice camera with good battery life.  Takes nice pics and is cheap.  I'd do it again for him.", "Date": "March 3, 2010"}, {"Title": "It is a Lemon and they do not honor repaires!", "Author": "James Richards \"Jamie\"", "ReviewID": "R25GN2Q2T15HDI", "Overall": "1.0", "Content": "The picture quality was nice. The camera is light weight. BUT less than a year I was taking a picture of my daughters graduation and all of a sudden the less stayed out and the picture said 'lens error'. I bought a three year warranty, and sent it to the company for repairs. They told me that I \"apparently dropped it\" Which was a BIG flat out lie. I took excellent care of it, not a scratch, and never got to even take it outside my house yet. This is the WORSE camera I ever bought. Save your money dont buy this camera", "Date": "January 20, 2010"}, {"Title": "Very short battery life using NiMh cells", "Author": "Lotus-Seven", "ReviewID": "R1G0TB20D7RZGU", "Overall": "1.0", "Content": "My wife purchased a Nikon L-18 to keep in her purse for snapshots.  It worked OK (images are decent) using Alkaline batteries, but would only take 30 or so shots using NiMh cells.  We did, of course, use the \"set-up\" menu to set the camera to the \"Nikon recharageable NiMh\" setting.  The camera stopped working and the screen indicated \"discharged battery\" when the NiMh cells each drop to 1.25 Volts.  This is a typical voltage of a NimH cell that still has 90 percent of it's charge remaining.  We tried using (3) brands of new NiMh cells with the same result.  Most cameras, but not the L-18, set up for NiMh cells will typically function until the cells drop to about 0.95 V. which represents a 5 to 10% charge remaining condition.We exchanged the L-18 for another and it works exactly the same.  It appears that the low battery cut off is set to 1.25 V. no matter if the menu selection is st to Alkaline, NiCad or NiMh.  At first I believed that we received a defective example, but the second one is behaves the same, so I suspect that this is a design fault or a firmware error.We are very disappointed with the useless Nikon L-18 and have already purchased a small Canon that actually gets 250 shots on a pair of AA NiMh cells.", "Date": "November 27, 2009"}, {"Title": "Poor Quality Poor Warranty", "Author": "E. Ramirez \"Silver Mouse\"", "ReviewID": "R2YF6C1BULVP37", "Overall": "1.0", "Content": "Nikon coolpix L18 has a poor quality. I bought it in Nov. 08 and in March 09 the LCD screen start to fail on and off. Finally the screen went completely black. Still under warranty i sent the camera for repair. Nikon did not fix the camera free of charge because they said I drop the camera. they told the same to a friend of mine with the same problem. Nikon wants to charge me 103.00 dollars to fix it. I declined the repair. I will never buy a Nikon product again. To get away from fixing a problem Nikon tells you that you drop the camera. I'll tell this incident to consumers so they can get a camera from a responsible manufacturer.", "Date": "November 4, 2009"}, {"Title": "Worthless warranty", "Author": "S. Davis", "ReviewID": "R29HB8XAYW8EGH", "Overall": "1.0", "Content": "This camera was a decent camera with fairly good picture quality until like in many other reviews I have read, it breaks.  I too got the lens error after no apparent reason.  I packed it up and sent it to Nikon and was informed that it appeared to have user damage. They  wanted to charge me more than I paid for the camera to fix it. This camera is not what I would call reliable or durable. Nikon does not stand behind it at all.", "Date": "August 26, 2009"}, {"Title": "Cool Camera, lousy warranty", "Author": "pam schirmeister", "ReviewID": "R1WNPU417MMIAM", "Overall": "1.0", "Content": "I bought this camera last Christmas, and while on a trip this summer, the camera stopped working while it was in my hands. One minute I was taking pictures, the next minute, a lens error message appeared. I sent it back to Nikon and was told that lens errors problems were not covered under the warranty and that the charge for repair would be more than the original cost of the camera. Period. I have other much more expensive cameras and have sent some of them back for work (Oympus and Canon), and have never had a problem with the warranty. It made me realize that the warranty is as important as the product. If you're thinking of buying this camera, just hope that it never has any problems because if it does, Nikon may not be very reliable about backing up their \"cool\"  cameras with very cool service or support.", "Date": "July 30, 2009"}, {"Title": "Good while it lasted....", "Author": "A. Marro", "ReviewID": "R14YKYEXZJ90VJ", "Overall": "2.0", "Content": "Good camera, takes nice pictures but 7 months old and I get a lens error. After researching the error on line I am seeing so many complaints about it...with no solutions. Can't be fixed!", "Date": "July 23, 2009"}, {"Title": "Blurry Action Shots", "Author": "S. Petersen", "ReviewID": "R2MMKJOTOY3X8W", "Overall": "2.0", "Content": "We've had this camera for one year.  We've tried all kinds of settings, but we can't get good action shots.  We've been so frustrated at our children's sports events.  It seems impossible to focus on one person moving.  We're pleased with the other features, but we'll have to look for another camera.", "Date": "July 18, 2009"}, {"Title": "WHAT WARRANTY?", "Author": "koldflow \"kel_zo\"", "ReviewID": "R2JHYY8RRPK4YL", "Overall": "1.0", "Content": "Nikon has lost my loyalty with this camera; horrible customer service. The camera lasted all of 5 months with a maximum of 2 hours of use then a battery change resulted in \"lens error.\" Nikon claims that there was \"lens impact\" as reason for not repairing under warranty. They explain the lens was crooked. The lens became crooked when I turned the camera on after changing batteries; apparently they suspect impact or that it was dropped. I suspect a faulty mechanism on this camera.  This camera was sent in for repair without a scratch on it; this camera was never dropped or had impact.  The repair costs comes to $102 and some change for a camera valued at $99.  If you plan on purchasing this camera plan on it coming to you void of any type of warranty; my experience gives the impression they simply blame a faulty camera on the customer.", "Date": "July 1, 2009"}, {"Title": "Better than first expected!", "Author": "C. Williamson \"Happy Mom\"", "ReviewID": "R1P7BK3Y9IFB2P", "Overall": "5.0", "Content": "My daughter wanted a small camera that took \"good\" pictures, but since it was a gift from her parents she didn't want or expect the most expensive out there. We looked and compared several brands and models and decided on this one. Surprisingly enough, she got a small camera that takes excellent pictures and has lots more features than expected on such an economical model and we got a super deal.  She's happy, we're thrilled she's happy and look forward to many years of great service!", "Date": "March 2, 2009"}, {"Title": "ABSOLUTLY FANTASTIC FOR AMATUER PHOTOGRAPHER", "Author": "Danny Boen \"rollingpoet\"", "ReviewID": "R18SDAA58YFDNY", "Overall": "5.0", "Content": "ABSOLUTLY FANTASTIC FOR AMATUER PHOTOGRAPHER.  IM NO PRO NOT BY ANY MEANS OF THE WORD BUT I DO HAVE MY PHOTES PROFESSIONALLY PRINTED AND THE PRO THERE IS JUST AMAZED AT THE WONDERFUL PIX I BRING HIM WITH THIS CAMERA.", "Date": "February 21, 2009"}, {"Title": "camera", "Author": "Joanne Caravano \"disney nut\"", "ReviewID": "RH0195V3Y2Q2C", "Overall": "5.0", "Content": "shipping was faster than expected and i love this nikon camera for the price ,i would highly recommend it for the novice camera user.", "Date": "February 19, 2009"}, {"Title": "Really Great Camera For Most", "Author": "Just a guy from France in the corner", "ReviewID": "RVPPRDKNUPXA", "Overall": "5.0", "Content": "This is one terrific camera. It's all highs and no lows. It was a great value at $140 and at $100 it's amazing.  I started looking for cameras by ruling out any that use proprietary batteries. When you're in the jungle (as I sometimes am) or it's really cold, then battery replacement can be an issue, so I wanted standard AA or AAA batteries. (I took 9 rechargeable batteries into the jungle last time I went-- they cost more altogether than the camera they were for). I've used my camera for well over a year-- the screen is big, the controls are easy, the programs are useful, battery life is good, the resolution is excellent, the optical zoom is marvelous, it's light, it's compact. You simply can't do better in the point and shoot world unless you're prepared to spend quite a bit more money, and what quite a bit more money buys you is just slightly better. When my son needed a camera recently, this is what he got, and it's plenty. Use it with the 4GB card and it will hold nearly a thousand full res photos. I'd say buy it now before they replace it with something \"better\" that's not as good.", "Date": "February 13, 2009"}, {"Title": "Greatest Nikon For The Price", "Author": "Kristin L. Gadd \"trav's mom\"", "ReviewID": "RD56FDPHLY22L", "Overall": "5.0", "Content": "Imagine getting a Nikon for under a hundred dollar and 8.0 mega pixels,  I was thrilled.  Of course had been wanting a more expensive Nikon for years but while still dreaming about that i will do just fine with all that this fine Nikon can do.  Sharp,colorful,closeup, timed, video.  I was able to get inexpensive accessories also.  The display screen is entire back of camera ...fantastic for me and it is is so easy to use.  You will not go wrong with this camera.", "Date": "February 10, 2009"}, {"Title": "So far so good", "Author": "Auntie Lou", "ReviewID": "R20ST0Z7US5AXT", "Overall": "4.0", "Content": "I finally came out of the stone age to try a digital camera and I've been pleased with the compact size and ease of use of the Coolpix. The low price was a bonus. I dislike reading instructions but I glanced at them just to get an idea where to start. It's really a no-brainer and the quality of the pictures is very good. If you're a first time user of point & shoot digital this is a good way to go.", "Date": "February 8, 2009"}, {"Title": "Windows 2000 users beware", "Author": "R. C. Hopkins", "ReviewID": "R1OXQQA52IT0BL", "Overall": "3.0", "Content": "The main issue I have with this is it is not compatible with windows 2000 as Nikon claims. You have to pull the SD card out and use an SD card reader every time you want to down load your pics. In which case you can use it with just about any OS. The SD card is located in the battery area and kinda hard to get it to pop out if you don't have long finger nails.It does seem to to do good in low light though, and haven't had a chance to see how it does on battery life yet.", "Date": "February 7, 2009"}, {"Title": "Nikon L18", "Author": "Steve Stacey", "ReviewID": "R1TITAAQBUDTO0", "Overall": "5.0", "Content": "Great camera - I bought it for the AA batteries, and compact size.  Both of them are better than expected.  Lens cover has worked fantastic so far - I have taken about 659 pictures so far - camera is in the desert, wind, dust, sand, and temp extremes (no hot weather so far).  Light, fits in shirt pocket, and the batteries last a long time.Dislikes, the screen to take pictures is terrible in the bright sun - I would like the camera to have peep site.Overall - I love it so far - we will see how it likes falling on rocks and off cliffs when we survey in a couple of week.Steve S", "Date": "February 3, 2009"}, {"Title": "love my camera", "Author": "Kathy Millsaps Sands", "ReviewID": "R3GEC5Q9PMDYFW", "Overall": "5.0", "Content": "3 members of my family received this camera for Christmas. It's small yet has great functions and takes pics or video .", "Date": "February 2, 2009"}, {"Title": "nikon coolpix- great buy", "Author": "Indira Rampersad", "ReviewID": "R38OP54GI453BC", "Overall": "5.0", "Content": "I love this camera ! My only complaint is the very small memory. You can take about 8 pictures and the memory becomes full. Buy the camera, but a memory card is a must.", "Date": "January 30, 2009"}, {"Title": "Easiest point and shoot camera ever", "Author": "Justin R. Smead \"Smeadawg\"", "ReviewID": "R6Y3WKN45X45U", "Overall": "5.0", "Content": "I bought this camera as a present for my wife. When I got it I took it out and played with it a while to see if I liked it. Great look and feel easy button operation too (there is not to many to get confused with). After giving this to my wife she quickly caught on to the functionality of each button (she used to not know how to delete pics she didn't want on our old camera). When I got to use it the other day I figured out how to crop photos on the camera and save them later to be downloaded off the camera.  I still have not figured out all the things that it can do but it has an 'easy' mode that makes for a simple way to take pictures.  It also has a user preference mode that lets you set it up the way you want it to take pictures.  Our old digital camera made this awful sound of focusing and took forever to get ready to take the next photo. Not with this camera. Its back and ready to take another shot in a snap (we just used normal Duracell batteries too). I would say that for the price of the camera you get more than expected.  I let everyone use it to convert them over to Nikon Coolpix cameras. If I knew you I'd let you use it!!", "Date": "January 26, 2009"}, {"Title": "C. Stumph KY GAL", "Author": "C. Stumph \"KY GAL\"", "ReviewID": "R34G3HQU1ZQ5J0", "Overall": "5.0", "Content": "I purchased this camera from Amazon a couple months ago.  It is really a good point and shoot camera.  MAKES good pictures for the someone who doesn't want a technical camera.  I have made many pictures with it and feel it does a great job.  The price was wonderful also.  I compared many prices and this was way the best value. Give it a try.  You will be glad you did. While you are at it you should buy your SD card for it because you will need one.", "Date": "October 17, 2008"}, {"Title": "good price good effectiveness", "Author": "Omer Faruk Cakir \"omerfarukcakir\"", "ReviewID": "R3CVB0XZPD6PGX", "Overall": "4.0", "Content": "good price and it is really goodNikon Coolpix L18 8MP Digital Camera with 3x Optical Zoom (Navy)", "Date": "September 14, 2008"}, {"Title": "Great Little Camera", "Author": "Momma", "ReviewID": "R1KOOZLOOS669C", "Overall": "4.0", "Content": "This is a great little camera! I've had a few point-and-shoot cameras and this one is very easy to use and takes pretty darn good pictures!I found that the red-eye button was making the shutter pretty slow, but once it was turned off, I've had no problems with use. And, as a mother to a 1-year-old, the anti-shake feature is a lifesaver!", "Date": "September 4, 2008"}, {"Title": "Great camera, nice pics, simple to use", "Author": "Gordon C. Peterson \"sinisterxc\"", "ReviewID": "R20KH2UGM1BCVC", "Overall": "5.0", "Content": "Replacement for daughter's camera (fell onto floor!). Works well, easy menus, easy point and shoot. Good value for the money.", "Date": "September 2, 2008"}, {"Title": "Great little camera!", "Author": "C. Dickerson", "ReviewID": "R3124UX6RJ4OZA", "Overall": "5.0", "Content": "Great little camera! Uses standard \"AA\" batteries and takes a good photo. It may not have all the bells and whistles of the more expensive cameras but it is more than adequate for the average person's snapshots. I own several digital cameras and this is my favorite.", "Date": "August 29, 2008"}, {"Title": "Cool Camera", "Author": "Capri", "ReviewID": "R1JGU5NIKW07FK", "Overall": "4.0", "Content": "I love the look of this ruby red camera. The 3\" LCD screen is decent size (much larger than my previous cameras) and great for previewing. The photo and video quality is exceptional. The anti-shake AE is much much better than my previous camera. Actually, I have absolutely no problem in that area. There are some other really great options for this camera, but I have the finish reading the manual to take full advantage of that.My only dissapointment was that just after about 3 days of using this camera, the LCD screen began to give problems. There were lines and different colors going through the display which is really distracting when you need to preview your photos or videos. The quality when eventually uploaded is great, but I hate that the screen is bad.", "Date": "August 24, 2008"}, {"Title": "Horrible Warranty", "Author": "Rashell L. Dithomas", "ReviewID": "RKN9Y7QMH41E1", "Overall": "1.0", "Content": "We purchased the camera from Costco in October, it broke at the end of January, just a couple weeks shy of Costco's return policy.  Therefore, we had to deal with Nikon direct to fix our broken lens/ shutter; that just one day decided not to open.  Nikon was willing to fix it for $[...], which is the price we paid for the camera.  That didn't sit well with me so they offered me a 30% discount to fix the camera, which totaled $[...].  Still a ripoff to me but we're fixing my Husbands \"work\" camera this time but if it happens again, we're sticking with our Canon cameras!", "Date": "March 2, 2009"}, {"Title": "No batteries seem to work!", "Author": "Robert Davis", "ReviewID": "R3RIUIOW1RFIA7", "Overall": "1.0", "Content": "I bought this camera for my daughter and we have changed the batteries multiple times and it still does not work.", "Date": "January 14, 2009"}, {"Title": "Dont always look for the brand name .", "Author": "coop67 \"Tim\"", "ReviewID": "RXYCHUKIUIABJ", "Overall": "3.0", "Content": "Upon getting into the digital age in carmera's i decided to start with the most trusted name Nikon i thought starting in a lower price range camera i coundn't go wrong with nikon well i was so wrong a very cheaply made camera surrounded by plastic, very nice 3 inch display screen though,but by the time you focus and shoot it would be hard for me to even catch my grandma walking across  the floor.I would recommend buying a canon or panasonic for a lower end priced camera you can use a basic sd card in these and have very good quality camera....a sony is very good, but you have to buy there own memory sticks that are very mutch more expensive.", "Date": "December 10, 2008"}, {"Title": "LGBFELT", "Author": "L. G. Bodyfelt \"lgbfelt\"", "ReviewID": "R2H64IIQPO5C9I", "Overall": "4.0", "Content": "I picked out two prespective camera as a possible gift for my wife (semi-handicap with plural nueropathy in hands and fingers).  Simplicity and easy of button use are the prime criteria.  My choices were Nikon Cool Pix L18 and the Canon PowerShot A590IS.  I believe the better of the two is the Canon A590 (good reviews, 4x optical zoom, optical stabilization, etc), but the wife chose the Nikon because of the 3\" preview and review screen and the \"Awesome Red Color.\"  Go figure?  Camera has worked out so far so good.  Time will tell.  I have owned and still use a Nikon CoolPix 500 since 2000.  It is bulletproof.  I expect nothing else from Nikon and the Coolpix L18.", "Date": "November 30, 2008"}, {"Title": "LOVE this camera!~", "Author": "J. Thorne \"KailuaWalkerJen\"", "ReviewID": "RT2FLR8JZKWKT", "Overall": "5.0", "Content": "This camera is amazing!  I love this camera!  It's been wonderful taking such fantastic photos.  Ones that I actually want to display.  =) Ones that people want copies of to put on their walls!Plus I love the color too!  So fun and easy to use!Love it! Love it! Love it!Thank you, thank you, thank you!=)", "Date": "November 11, 2008"}, {"Title": "best camera", "Author": "JOSE", "ReviewID": "R38H6W85SK25YJ", "Overall": "5.0", "Content": "This was a great buy. I needed a special gift for my family and this is a great gift. The product is good quality and is a gift that will last several years. The price is very good and according to what he sought.  great gift", "Date": "December 27, 2013"}, {"Title": "Good Camera, slightly flawed", "Author": "EDDY M FOYE", "ReviewID": "R39LTQO4SF5EWT", "Overall": "3.0", "Content": "The camera was delivered promptly and appeard to be in very good condition, however the lense does not readily open when the camera is turned on which causes the picture to be either all black or mostly blacked out. The front apereature sticks frequently.", "Date": "October 18, 2013"}, {"Title": "This \"used - like new\" Nikon camera was defective!", "Author": "Norman L. Biegner", "ReviewID": "R2Z7UTPF83JKKJ", "Overall": "1.0", "Content": "I purchased this camera from an Amazon \" book seller\" who stated that it was \"like new\".  It surely had no scratches, it looked brand new.  After installing 2 new batteries,  I took about 10 pictures - then an alarm came up that: \"batteries exhausted\".  After putting in another set of new batteries - the same scenario.The camera has a defect, now the seller wont even answer my request notices for a refund.Nikon makes the best cameras, but this one should have gone back to the factory, not resold by a less than honorable vendor.", "Date": "October 4, 2013"}, {"Title": "Great deal", "Author": "jelpmac", "ReviewID": "R25NFBUWQZNILO", "Overall": "5.0", "Content": "Rec'd timely, works fine, was a great buy and gets a lot of use, love batteries over recharging all the time.", "Date": "March 30, 2013"}, {"Title": "Nikon Coolpix L18 8Mp", "Author": "John", "ReviewID": "R67CYCSBNDX6E", "Overall": "5.0", "Content": "I was totally satisfied with the camera that I purchased. It works great. I ordered it, and it was here in like 4 days....great service, great product. Thanks", "Date": "July 20, 2012"}, {"Title": "Perfect for beginers", "Author": "Vintage Doc", "ReviewID": "RLKF3XGJDASFR", "Overall": "5.0", "Content": "First off a little about me my company buys the top new electronics each month and tests them out for potenital buyers we bought 4 of these camreas to test for a middle school libray This little camera rocks its verry easy to use and takes awesome pictuers for an 8 mp cammera Any reviews you read about batery drain are non sense we shot 2 hours of video useing energizer li batterys and had no problem i would recomend geting rechargeables simply for ease Overall this camera would make a great beginer camera and would be good for children from a pro photo aspect it leaves a lot to be desired but for an entry level camera it is quiet good Also their is alot of non sense about Nikons warranty this pure crap i have had hundreds of Nikons come thru my shop and have only had two return 2 and they were quickly replaced", "Date": "June 8, 2012"}, {"Title": "A great gift", "Author": "J. Griffin", "ReviewID": "R2ST6P63FKO1J", "Overall": "5.0", "Content": "I purchased this as a gift for my mom and she loved it.  It's easy to use, takes excellent photos and videos and fits nicely in a purse.", "Date": "May 26, 2011"}, {"Title": "Defective LCD monitor", "Author": "Michelle Nagel", "ReviewID": "R39F9ODXMH2BG2", "Overall": "2.0", "Content": "Naturally, shortly after the ONE yr warranty expired, the LCD monitor became defective.  The camera can no longer be used and is too expensive to have repaired.  Not worth the money.", "Date": "May 19, 2011"}, {"Title": "Nikon Coolpix L18", "Author": "Dr. No", "ReviewID": "R3G6O680RT7C1B", "Overall": "5.0", "Content": "This has been a great camera. This is perfect for carrying anywhere with the ability to take beautiful photos. The price makes this camera a awesome deal. Comes with software and is easy to use.", "Date": "November 29, 2010"}, {"Title": "A great long lasting camera", "Author": "Greg Becker \"A middle aged surfer dude who tr...", "ReviewID": "RDMMB6P16ONS2", "Overall": "4.0", "Content": "This is such a great camera for a very low price! I bought it like 2 years ago. The first year was great then the second year was not so good though. It lost its fantastic quality but i think now it is time to get a new one like this one for another year. It has a reasonable amount of film in it.(10 min) an you know it is good for camping trips to keep enough memories :). i really recommend this nikon coolpix camera if you just like to have a camera for trips and stuff.Tip: NEVER BRING IT IN THE SAND!!! HAD TO FIX IT LIKE 5 TIMES!", "Date": "February 14, 2010"}, {"Title": "Be careful of the quality and keep your purchase receipt", "Author": "Michael Toler", "ReviewID": "RTN8BW7FSWZ8J", "Overall": "2.0", "Content": "I bought and used two L18 coolpix cameras in December 2008, because they were on sale, rated highly by Amazon, had familiar features, could easily fit in my pocket, used world-wide common AA batteries, had a nice big digital display, and improved 3Xzoom and 8 magapixel capability. I gave one to my wife who rarely uses it. I already owned an L11 which is 3 years old and bought a new L20 this December 2009 to replace the broken one I bought last year. I carry the camera in my pocket and take digital photos daily, have over 100,000 photos in my computer and frequently edit and label them from my international travels and family events. The L18 that I bought and used was blue and my wife's is red. I took about 5000 photos over 10 months with the L18 before the digital display suddenly stopped working - which prevents setting the functions on the camera (video, still pics, flash, etc.) and seeing what the camera is capturing. Without the sales receipt, no way to return the broken camera to Nikon for warranty repair (supposed to be a 1 year guarantee - but no repair facilities in Europe and despite registering the camera on line at the time of purchase, you still have to have the sales slip to return it to Nikon for warranty repairs). None of the three coolpix cameras I have take good fotos at night (without the flash or with it frequently there are so many spots in the foto from moisture in the air that the photo is irreparable even with the best software)resulting in yellow people and blurrrrrred images. Also none of them take good photos of moving objects - more than 40% of my photos of people moving are too blurred - even when the person only slightly moves. The Pentax 330GS that I used 2002-2007 before switching to Nikon took great night and much sharper pictures of moving objects but it only had a 3.0 magapixel capability. When the subject is still, in daylight, and you can hold the camera steady, the coolpix cameras all take great pictures.Nikon Coolpix L18 8MP Digital Camera with 3x Optical Zoom (Ruby Red)", "Date": "January 13, 2010"}, {"Title": "Great!!", "Author": "H. Garza", "ReviewID": "R2ZO05XFQTDZRI", "Overall": "5.0", "Content": "I love this camera. I have been through so many...guess i'm too picky! It also arrived very quickly!", "Date": "December 9, 2009"}, {"Title": "It didn't last a year", "Author": "Wendy", "ReviewID": "R15GIJUEBX6UR0", "Overall": "3.0", "Content": "It was a great camera and easy to use.  The photos and videos were good and the extra zoom was handy.  The camera was bought last Christmas, it didn't last a year.  It still takes photos, however it is diffucult, since the LCD screen went blank (and there's no eye hole).  Now I need to get another point and shoot- before Christmas.  Also, the cost of keeping up with the AA batteries was blah.", "Date": "December 7, 2009"}, {"Title": "Easy to use, excellent camera", "Author": "Christopher G. Staton \"Christopher\"", "ReviewID": "R3TSDX26X58AY3", "Overall": "5.0", "Content": "I have this camera, in conjunction with an underwater housing for scuba diving.  Takes excellent pics and is extremely easy to use.  I also use it as a more portable backup to my Nikon D80 SLR digital.  Recently went on vacation to Vegas, taking both cameras, after the first day, I stored the D80 and only used this cool pix and received many compliments on the quality of my images.  No one could tell which pics were from the cool pix or from the D80. I will be buying at least one more of these as a backup in case mine fails..", "Date": "October 12, 2009"}, {"Title": "Love my camera!", "Author": "E. Harman", "ReviewID": "R22ZUB10K3A1PY", "Overall": "3.0", "Content": "I got my camera at Christmas from my in-laws and it's been a fabulous camera to carry around in my purse for those moments when you wish you had a camera.  HOwever it's now September and the LCD screen has gone blank.  I've been told I'd have to replace my screen components but that will be around $100 for parts and labor.  Forget that!  I think that's what my in-laws paid for the darn thing.  Love my camera and am so bummed that it pooped out on me.  I'm going to go buy another one and stay away from this particular camera in fear that it will happen again.", "Date": "September 23, 2009"}, {"Title": "Nikon Coolpix", "Author": "L. schultz \"Moonshadow\"", "ReviewID": "R1QRAAAUFG8OPS", "Overall": "4.0", "Content": "Great little camera Crisp clear shots and the zoom quality astounded me.  Very easy on screen instrutions.  My only negative comment was the computer disk was damaged on delivery", "Date": "September 9, 2009"}, {"Title": "pictures are great but now defective", "Author": "A. Eldridge", "ReviewID": "R26DO2LRRD5ZQX", "Overall": "3.0", "Content": "We loved this camera when we first bought it.  The pictures and videos of our new son came out great.  However, it is now having an issue with detecting the batteries (after less than a year of ownership).  Other reviewers mentioned that the camera used up batteries but I think the camera can no longer sense the true battery power.  I have tested the batteries and used them in other devices and they still have plenty of power but the camera says battery exhausted after only a few minutes.  I have not tried to contact Nikon, so perhaps they know about this problem and would fix it (however, most of the negative reviews indicated otherwise).", "Date": "June 24, 2009"}, {"Title": "Good for general photos", "Author": "Beauty&Brains;", "ReviewID": "R1U1LYIGOPOLTM", "Overall": "4.0", "Content": "I've had this camera for 2 years and taken hundreds of photos with it. I've taken with me on a deployment and to the beach and it still did great. The flash is somewhat tricky to get just right, you just have to experiment. There is a macro setting for super-close ups which will come out blurry if you dont use a tripod. The zoom is wonderful, just be careful not to zoom so much that you use the digital zoom, that will digitize your photos. In general it's great for photos of family and friends, not great for action or long distance.", "Date": "June 11, 2009"}, {"Title": "very disappointed", "Author": "Marko Ljutica \"if i must\"", "ReviewID": "R3U3DVL6XC0AK7", "Overall": "2.0", "Content": "as mentioned in previous reviews, this camera eats up the battery. after transferring my pictures into the computer, some pictures were cut in half, the result being a picture which was half blank grey and half the actual picture. i was so upset :(...", "Date": "June 2, 2009"}, {"Title": "Great Purchase!", "Author": "R. Joseph \"Trinihibiscus\"", "ReviewID": "R24CQF9PJ4DGN4", "Overall": "5.0", "Content": "Grerat purchase.  The clarity of the pictures is amazing!  The color is very elegant and above all the camera is so easy to use!", "Date": "May 18, 2009"}, {"Title": "good all rounder", "Author": "Michelle L. Yates \"giroux321\"", "ReviewID": "R2GBHSFL8Z8WJH", "Overall": "4.0", "Content": "this is a good camera for everyday use.  the megapixels are enough to produce nice enlargements and its easy to tote around.  nice viewing screen", "Date": "May 9, 2009"}, {"Title": "After 6 months - Mixed review - battery and memory issues", "Author": "James J. Christopher", "ReviewID": "R12CZPPHXPRTQ0", "Overall": "3.0", "Content": "I bought this camera before Christmas of 2008 and after being extremely happy with the price and quality I am now not so thrilled.  It has crashed twice costing me all the images on the internal Memory card (had to reformat the card) and it now burns through batteries at an insane rate - sometimes after only one or two hours use it will say \"batteries are exhausted\" and they need to be replaced - thee are expensive alkaline batteries.  I still love the look (mine is blue), the feel and the photos are very good but these other issues give me pause to recommend this camera - I am sure there are better available products that offer less hassle.  Oh and the Video images on this are very poor - no good enough for any use other than the most basic - video image very grainy and sound is bad.", "Date": "May 4, 2009"}, {"Title": "great price but...", "Author": "Maria Casita", "ReviewID": "R3CHR8RBDUM20Z", "Overall": "2.0", "Content": "I wanted an inexpensive camera to replace my broken expensive camera. I chose this one because it is extremely user friendly. I picked it up in the store and was able to use it without referring to a manual. The only problem is, you get what you pay for. It takes OK photos and I want good photos. I have chosen to leave my camera at home lately rather than be disappointed by my photo outcomes. Now I am shopping for another replacement camera so I guess I really did not save any money after all.", "Date": "April 15, 2009"}, {"Title": "Lens Error! after 5 days of use!", "Author": "J. Champion", "ReviewID": "R1SBSOBY0KAZX9", "Overall": "2.0", "Content": "This camera was used for 5 days and then it showed the Lens Error!  It took good pictures and was well taken care of (not dropped or anything).  I was so disappointed.  Must be some poor design or something for this to happen after only 5 days of use!", "Date": "March 21, 2009"}, {"Title": "Great little digital for beginner", "Author": "H. Steinhagen \"H Steinhagen\"", "ReviewID": "RFO54C659BXI0", "Overall": "5.0", "Content": "Big Screen, easy to use for 1st time digi user. Like it so much i ordered one as a gift for a family member.", "Date": "March 19, 2009"}, {"Title": "DOES IT ALL VERY WELL AND MAKES MOVIES TOO; ARE YOU READY FOR YOUR CLOSE-UP?", "Author": "C. Scanlon \"least helpful reviewer\"", "ReviewID": "R2WFYMY1S9478X", "Overall": "5.0", "Content": "I had leave the desert hermitage Saturday like every Saturday to go to town to wash clothes thirty miles away and buy celery and Mori-Nu Tofu, Silken Style, Extra Firm, 12.3-Ounce Boxes (Pack of 12) and the rest, and when I got there remembered I had an assignment to do for the newspaper, but left the Nikon D40 6.1MP Digital SLR Camera with 18-55mm f/3.5-5.6G ED II AF-S DX and 55-200mm f/4.5-5.6G ED AF-S DX Zoom-Nikkor Lens with 2 Nikon School DVD at home in the hermitage.I've used the D40 for a few years now and it is finally getting intuitive and I am finally figuring out how to do some of what it can do. I just wish I could afford a long lens. It is really a great camera, and very tolerant of my pushing the limits in low light. Recently I got some great night carnival shots taken and one published.So I get to town last Saturday and remembered I was supposed to do this VERY IMPORTANT assignment, and went to the place and discovered it was my only chance, that day, right then. Not next weekend; right then. They even offered to lend me their point-and-shoot and they offered to e-mail me the results, but then found out the p&s; had been sent back to the shop.No other choice but to go to the ubiquitous BIG BOX store and see what they had. Nothing special, until I saw my favorite brand name. I thought of going back to an Olympus, having used that brand years ago, but they take minicards not the full size SanDisk 2 GB SD Memory Card ( SDSDB-2048-A11, Retail Package).Then I saw the Nikon display, and, like, wow.Okay, so its ruby red . . . That is its only weak point (although the expectant lady at the Chinese food store said it was a great and a lucky color when she saw it while serving my steamed tofu). This camera can do more than you can ever use and more than you can imagine, and more than my beloved d40. For one thing it takes movies, well.For another thing it takes a full 8 megapixels, more than the d40. I could blow these pictures up further than the d40's, if such a thing as a photo lab still existed (Ok, so, ten megapixels is the standard now; we might say ten is the new 6.something).And it takes the SD card, so anywhere you are you can pull out a targus SDHC card reader, and slip open the L18's combination battery-SD card cover, and plug the card into any computer with a USB port and file your photos. And you can get SDHC cards big enough for your needs, a card which will far outlast the battery charge.I just feel really dicey about that battery latch. I used to snap their tooth off all of the time over twenty years ago on my great Canon AL-1 film SLR camera, and it brought out some sweat to my brow the first time I tried manipulating this one. It takes a snap and a slide, but it is no sweat once you get the hang of it.The strange thing is that old Canon AL-1 took triple AAA batteries in its full sized SLR, whereas this L18 micro-mini-camera takes double AA. In fact the bulk of the width here is due to the fat batteries. I was surprised, but much more is done electronically here than on the old SLR's.This tiny camera is under four inches long by under three inches tall by about exactly one inch thick, because of the batteries. Figure those dimensions while picking out a camera case, which you will want. Right now mine is wrapped up in a bandana and a Zip-lock bag, just like back in the tropical mountain rainforest twenty something years ago, but I definitely want a case to keep it in, to throw in a pocket and walk around, and no one knows what I'm packing, that I am ready to shoot pictures. Several are for sale here on the broad amazon, but carefully check the interior dimensions. I think I might settle on the Rokinon Digital Camera Weather Resistant Carry Case for Nikon Coolpix L16, L18, P50, P60, P5000, P5100, P6000, S7c, S9, S50, S50c, S51, S51c, S52c, S60, S200, S210, S500, S510, S520, S550, S560, S600, S610, S610c, S700, S710 Digital Cameras.That's another strong advantage over the full-sized DSLR hanging off one shoulder. This camera and case can slide into any pocket and no one knows it, but you are ready for anything.Too bad it is, well, so red.It takes movies. This tiny thing takes movies, with sound, saved right on to the SD card. AND it is HDSC compliant, which means you could probably load that SanDisk Ultra II 16GB/15MB SDHC Card in here and film for a good long time. I'll just be glad to get a 4gb card in here!Right now I have a 2 GB card in, and have it set to record still photos at the highest resolution, and that 2 GB card will hold over 375 shots. It will also hold over twenty minutes of movie. I am astonished, full of tech shock. Okay, so you're used to your mobile PHONE doing all of this, no sweat, but check out the resolution on this baby (My phone, by the way, only hangs on the wall and rings, except it never does, ring, but that is another story).This L18 has a three times optical zoom (which means it is not digitally manipulated to look closer - the lens itself is doing the zooming) handled with that tiny teeter totter switch W-T that point and shoot folk are accustomed to (I am used to turning the lens).This 8 megapixels is incredible. I took some shots at the assignment, and checked them on that full color monitor on the back (I want to get some of those protective screens, but wonder how they affect viewing) and was able to pan in very close with the on-board bells and whistles, and confirm that every hair was in focus.They were. This is incredible.For it to do ISO 1600 is another strong selling point for a photographer. You can count on shots by a bare light bulb or street lamp. By candle. I just want to find where I switch off the built in flash, which is also great, going out to 25 feet. This is incredible.Okay, so the anti-shake means the little elves inside can go what we used to call shutter-priority, setting a faster shutter speed in order to avoid the effects of your shakes. Don't think you can stand on a vibrating steel plate to test the anti-shake. This is for us old folk who aren't as steady as we once were. This camera can do everything except miracles, so don't go out of your way to push its limits.Which is just what I plan to do in the coming months. Maybe I will report back with updates. I am finding it AUTO's to an incredible depth of field. I can focus on something close (like the ingredient list on the soy sauce bottle at the restaurant) and find what is much further behind still in focus. I am certain you can tweak it if you want a very short depth of field, perhaps simply by pulling way back to widescreen.The color is true and very good. And the short film I tried out came out very well, as clear as the still shots with good front to back focus, and the microphone (as well as the speaker on playback) are incredibly sensitive.You can do a lot of things with this camera's on-board photo-processing lab, including Black and White and Sepia, and vivid colors, as if the true colors were not fantastic already. The 110 page User's Manual which comes with it tells you much, if not all, quite clearly, considering. It indicates to me there is much more to this wonderful camera than I am aware of, and I plan to study it closely.I thought I was just grabbing an emergency, inexpensive point-and-shoot to get an assignment done. It turns out I got one truly great camera with far more capabilities than I am aware of, and I hope to grow into them all.This should to turn out to be one very beautiful relationship.", "Date": "March 16, 2009"}, {"Title": "What a camera!", "Author": "Buddha Sun \"May the Chi be with you!\"", "ReviewID": "R1TJ15JFRC95M5", "Overall": "5.0", "Content": "I nover thought that I would buy a digital camera, but when I looked at this one, I gave it a try. It is the envy of all those in my family that have digital cameras! It is excellent!!", "Date": "March 3, 2009"}, {"Title": "Pretty good deal", "Author": "Lil writer \"book worm\"", "ReviewID": "R36MKS0NVTR035", "Overall": "3.0", "Content": "I bought this camera last year to take holiday photos and i haven't stopped using it since. It didn't really cut into my budget because i got at a really good price despite its many functions. It takes really good pictures. It's very efficient and easy to use. The zoom function for instance, i can take good pictures no matter how far i am and they still end up looking really good. Its size is also another thing i was pleased with, its the right size to carry around in my pocket and not too small to easily lose.Its aesthetically pleasing to the eye although i found that it's not in a lot of colors which was a little dissapointing. Its color range isn't wide enough although the ones that they do have are appealing. I would recommend this camera to those people who like to take pictures at get togethers or just parties with friends.", "Date": "February 10, 2009"}, {"Title": "l18 coolpix", "Author": "Andrew G. Roetting", "ReviewID": "R19O1GW518RDES", "Overall": "5.0", "Content": "I purchased the camera for my wife, but have used it and really appreciate the compact size, menu options, and the quality of the prints.  I have an olympus SP-510-UZ and can say print quality is par with my camera.  It sure is nice to have a pocket camera to tag along.", "Date": "February 3, 2009"}, {"Title": "Good Deal", "Author": "Miriam W. Jocks", "ReviewID": "RRZCHG7P3TIH", "Overall": "5.0", "Content": "This camera was a Christmas present, and it was a very good deal. Several people in my family have one, because it's so easy to use, and the fact that we can get these with different colored casings keeps us from mixing them up. The large screen is useful if you have low vision (or are starting to need reading glasses).", "Date": "January 27, 2009"}, {"Title": "Great Nikon Coolpix", "Author": "T. Powell \"Real Music Lover\"", "ReviewID": "R1ECY4ODH7Y7PO", "Overall": "4.0", "Content": "I've never has my own camera so I wanted to start out with a great one.  I chose the Nikon Coolpix and I'm glad I chose it.  I am very pleased and I'm sure you will be too.", "Date": "January 27, 2009"}, {"Title": "red coolpix", "Author": "Ernie S. Early", "ReviewID": "R2IBFU7Y1936LG", "Overall": "5.0", "Content": "i think this product is very nice and can't wait to (master) the loads of features; so far the 2gb memory works well. oh and it's my son who is the photographer.", "Date": "January 24, 2009"}, {"Title": "BIG BLUE CAMERA", "Author": "P. J. Hamilton \"dragon lover\"", "ReviewID": "R2AWBYHJD14JY1", "Overall": "5.0", "Content": "THE NIKON COOLPIX L18 8MP DIGITAL CAMERA IS GREAT.  I CALL HIM BIG BLUE AND HE GIVES BEAUTIFUL PICTURES.  IT IS SO EASY MY GRANDDAUGHTER AND TAKES BETTER PICTURES THAN I DO.  THE WHOLE FAMILY USES HIM.  I DID GET A 4GB MEDIA CARD SO WE CAN KEEP TAKING PICTURES FOR A LONG TIME BEFORE WE HAVE TO DOWNLOAD.", "Date": "January 24, 2009"}, {"Title": "Good Value", "Author": "K. Michaud", "ReviewID": "R3CW2T4BNGS30J", "Overall": "4.0", "Content": "This camera was a perfect present for my mum who wanted a small and easy-to-use camera. The size was perfect - can fit into a pocket, even, and my technologically-impaired mum figured out all the instructions in just an hour or two! Lets anyone have fun with digital photography.", "Date": "January 21, 2009"}, {"Title": "Nice camera", "Author": "Forrester, found", "ReviewID": "R1MCMTV2QUS1ID", "Overall": "5.0", "Content": "My first digital camera so I'm mostly comparing it to my conventional Pentax and making observations on it's ease of use and practicality. It takes nice clear pictures in virtually any light. What you see is the picture you get. I've been taking pictures outside in sun and overcast conditions and indoor pictures, and they all come out well. It is very easy to use and I like the fact that it uses conventional AAA batteries which can be purchased cheaply. (When I was buying a storage card for it that was how the clerk identified the model so I'm guessing that is a popular feature.) Overall, it is a nice camera for the price.", "Date": "January 21, 2009"}, {"Title": "nikon coolpix", "Author": "B. Park", "ReviewID": "R3PVZ0DU6YIOTM", "Overall": "5.0", "Content": "My daughter loves this camera!!.  I purchased this as a xmas gift and was unsure of the quality but needless to say my daughter can not put it down.  The batteries have held up well considering the use.  We got her the reuseable  batteries and a charger.", "Date": "January 19, 2009"}, {"Title": "Even my Mother in law loves this Camera!", "Author": "Charles Cummins \"Astrochuckie\"", "ReviewID": "RV4NK3B9BGDWC", "Overall": "5.0", "Content": "This was a Christmas present for Wifey's mother. She loves it and can actually understand how to use it! This means she doesn't call us all the time for support! What a dream! Fast shipping from Amazon and very well packed.I might get one for myself!", "Date": "January 18, 2009"}, {"Title": "A good camera, cool too!", "Author": "Chet E. McCracken", "ReviewID": "R2CZR080OXFYUE", "Overall": "5.0", "Content": "Bought 2 of these. 1 for my wife and 1 for my sister-in-law. They love them. They work well, are small and the pictures are great......well recommended.....", "Date": "January 18, 2009"}, {"Title": "Nikon L18 Camera", "Author": "J. Coe \"nurse\"", "ReviewID": "R1QQBMF8X1UO6J", "Overall": "5.0", "Content": "Great camera with so many features for the price I have barely gotten to enjoy a fraction of what is possible", "Date": "January 17, 2009"}, {"Title": "Nikon Coolpix L18 Camera", "Author": "Patricia Jensen", "ReviewID": "R17NNY05J4F2AS", "Overall": "5.0", "Content": "This is a great camera.  It is the fourth Coolpix Camera that we have purchased.  It works great, is easy to use and takes great pictures.", "Date": "January 14, 2009"}, {"Title": "Nikon Coolpix L18", "Author": "Susan Ibanez \"avid reader\"", "ReviewID": "R127NP6NTIF9V", "Overall": "2.0", "Content": "Nikon Coolpix L18 8MP Digital Camera with 3x Optical Zoom (Navy)Lots of MP's here, but some disappointment too.  Cameral takes AA batteries, handy, but it drains them fast!  Shutter has a long lag time, which makes shots of children playing impossible in the automatic setting.  For kids, use the sports mode which is still has some shutter lag, or use a flash to freeze the action.", "Date": "January 13, 2009"}, {"Title": "Love the Nikon!", "Author": "Busy Mom \"Karen\"", "ReviewID": "R34A08WN5HHQ1S", "Overall": "5.0", "Content": "We originally bought it as a gift for Grandmom, but she got a different one. We gave it to our son and he LOVES it. Easy to use. Large clear screen. Even the movie part works very well. We'd buy again in an instant.", "Date": "January 13, 2009"}, {"Title": "Great camera", "Author": "Thomas A. Zulli \"Tazz\"", "ReviewID": "RLVFBSSAF3FZL", "Overall": "5.0", "Content": "I needed a new digital camera bad, the one I had only had 4.1 megapixels. I did some researching based on my price range and found this camera. I noticed it got mix reviews mostly very positive. Since it was exactly what I needed, I bought it.It turned out to be better then I expected. Quality is great, it has a camcorder with sound (my old one didnt have sound) and its easy to use. Its worth whatever you spend", "Date": "January 12, 2009"}, {"Title": "Good camera for an active teenager.", "Author": "Matthew J. Basile \"Big Boy\"", "ReviewID": "R3QORA0UDXSXMR", "Overall": "5.0", "Content": "I bought this camera for my 17 year old daughter just to carry around with her when she's with friends. She loves it. Pictures are clear and bright. Full of color. Very good camera for the price. She loves the red color.", "Date": "January 12, 2009"}, {"Title": "Still learning", "Author": "Mary Gay Bennett", "ReviewID": "R3VY49P74GLSJY", "Overall": "5.0", "Content": "This camera does everything. I am still learning how to use it. Will take time and practice for me. I highley recommend this product.", "Date": "January 12, 2009"}, {"Title": "great camera", "Author": "Jen \"5980\"", "ReviewID": "R7XIIJTQAS1UI", "Overall": "4.0", "Content": "Like others, I had problems with the camera draining the batteries. When not in use, I advise to take the batteries out of the camera. Other than that, it's been great.", "Date": "January 11, 2009"}, {"Title": "Nikon Coolpix Camera - great value", "Author": "Gail A. Betts", "ReviewID": "R2AKLD0HJFOMKU", "Overall": "5.0", "Content": "I bought this camera for my daughter for Christmas. She loves it.  The pictures seem to come out very clear and it's easy to use. She is currently traveling to New Zealand and Australia and wanted a nice camera to capture the sights out there. She is very happy with the quality of this product.", "Date": "January 11, 2009"}, {"Title": "Nikon L18 CoolPix Digital Camera in Red", "Author": "J. Schiavone \"Judy\"", "ReviewID": "R3G4NE8PUFZ9RQ", "Overall": "5.0", "Content": "This is my first digital camera, and I love it.  It takes great pictures, was very reasonably priced, and is so cute in red.  It is very user friendly, and has a lot of great features (such as a 3\" LDC screen), for a simple point and shoot camera.", "Date": "January 11, 2009"}, {"Title": "Nikon Coolpix camera review", "Author": "C. Egan", "ReviewID": "R2EL9X5UKB036K", "Overall": "5.0", "Content": "I purchased this camera as a gift for my 15 yr old son and for my 26 yr old son. They both love it, it takes great pictures for a pocket camera. They are both happy with it, haven't heard any complaints, and the price was good. My 26 yr old has had many cameras and he says his is just what he was looking for, it is a replacement camera for him, so I guess that's the best recommendation. Good camera for the price. Clear pictures and easy to take. If you are looking for a camera for someone who just wants to take fun pictures and who is not a professional,this is a great camera. And like I said, the price is good.", "Date": "January 10, 2009"}, {"Title": "Great little camera", "Author": "Linard7", "ReviewID": "R2O64ISHXPJ9SW", "Overall": "5.0", "Content": "I bought this for my 10 year old daughter for Christmas.  This is super easy to use, just point and shoot.  Takes great pictures.", "Date": "January 10, 2009"}, {"Title": "Worth more than I paid.", "Author": "Sheila Miel", "ReviewID": "RHMD2VL77YU78", "Overall": "5.0", "Content": "So I spent alot of time researching my camera before I purchased it because I was very happy with the digital camera I purchased 8 years ago so I was very careful.  I was not giving up a good camera for a good camera..I wanted a great camera.  My old camera took forever to load between pictures (which I saw as I was researching is the command complaint for older cameras) so that was one of my number one concerns also I am a very big scrapbooker and I wanted to make sure that I could enlarge pictures easily to 8x10 or crop without a problem.  I had a budget of $150 and I spent only $90 and I believe that it was so worth it.  I have taken through the holidays around 200 to 300 pictures and used the video feature.  I have uploaded the video for family to see presents being opened at Christmas and I have printed around 200 of the pictures and I very happy with the quality of what I have, no problem with enlargements or cropping.  Very good camera for the price.", "Date": "January 9, 2009"}, {"Title": "Nice point n shot cam with energy consumption fault", "Author": "Alex Wei \"Matrix2000\"", "ReviewID": "RVQ1WSORA9J2F", "Overall": "3.0", "Content": "I bought this camera during the Thanksgiving sales.  Very good value with its price. And the brand Nikon also has value. color is ok (I took two years of photograhy in college), sharpness is good and I like the contrast.The large LCD screen is its main value; But it eats battery like crazy. It consumes one pair of AA batteries in a day of shooting of around 50-60 pictures and 2 videos. I paid $89.00 for the cam, but I expect another $89.00 for the battery soon.", "Date": "January 7, 2009"}, {"Title": "Very good basic camera", "Author": "Nice Guy", "ReviewID": "RLRBCGH1QJQ3A", "Overall": "4.0", "Content": "I like the fact that the camera uses a AA battery and has a view finder.  Although the screen is great, I occasionally like to use a view finder.Had a Canon A530 before (until it was accidentally ruined).  Like the smaller size and the bigger screen of the Nikon.The delay between the flash and the picture gives subjects time to close their eyes.", "Date": "January 7, 2009"}, {"Title": "very slow shutter speed", "Author": "Tammy Peterson", "ReviewID": "R3TIMJPO2ACXF0", "Overall": "3.0", "Content": "nikon makes very good camaras. the only problem i have with my camara is the shutter speed is very slow. by the time the pic is taken the moment has passed. otherwise very nice camara.", "Date": "January 7, 2009"}, {"Title": "Coolpix is Cool!!!", "Author": "S. V. Barone", "ReviewID": "R2HLUE9XWGDTR5", "Overall": "4.0", "Content": "The Nikon Coolpix L18, is a great starter camera for the serious picture taker! With 8 Megapixels and 3x optical zoom, it helps the casaual photographer to aspire to better hieghts! Could be more useful with a rechargable lithium-type battery as it does run through the standard AA batteries.", "Date": "January 6, 2009"}, {"Title": "Nikon Coolpix is so easy", "Author": "E. Gallagher", "ReviewID": "R2R6VVSFHXF0SQ", "Overall": "5.0", "Content": "This camera is so easy to use - it's great.  It was a Christmas present for my 13 year old daughter.  She was thrilled with it - just popped in the batteries (which were included) and started taking pictures.  The pictures came out clear and sharp.  The next day we took a trip to Hershey and took more pictures on the Chocolate World tour - also great.  I'd recommend this for an easy point and shoot digital camera.", "Date": "January 6, 2009"}, {"Title": "don't cry over a broken camera", "Author": "Janice Brown", "ReviewID": "R2OJYLEHXA1QJ5", "Overall": "5.0", "Content": "I was very upset when I realized that my digital camera was broken and that it would cost more to fix it than to get a new one. I looked around my town and Wal Mart had the Nikon Coolpix on sale for $99.  I checked Amazon,found it for $87 and no shipping costs.  Then when I received it, took some pictures, I was astounded by the clarity of the photo, the ease to operate the camera and the color red.  I was very happy. I wish I could attach the first photo I took of my Black Lab in the first snow of the season. It was my  Christmas card this year.", "Date": "January 6, 2009"}, {"Title": "Excellent Camera for the price", "Author": "Marti Melville", "ReviewID": "RYTJ5H13QWV5P", "Overall": "5.0", "Content": "I purchased two of these cameras as gifts.  I wasn't disappointed.  This little camera is able to take great digital photos.  I've been very satisfied with my purchace and the recipients were thrilled.I would recommend this camera to anyone looking for an easy camera to use with quality photos at a price that can't be beat.Marti MelvilleAuthor of Deja vu: Farraige[...]", "Date": "December 22, 2008"}, {"Title": "RECEIVED THE CAMERA BROKEN AND NOT ABLE TO GET A NEW ONE", "Author": "L. Espada", "ReviewID": "RYVJPBL6PAEJM", "Overall": "2.0", "Content": "I SEND A $200 CAMERA AS A BIRTHDAY GIFT TO MY 16 YEAR OLD NIECE. THE CAMERA NEVER WORKED, IT ARRIVED BROKEN BUT I AM NOT ABLE TO GET A NEW ONE BECAUSE I STILL (1 MONTH LATER) DON'T HAVE AND INVOICE WHICH SHOWS THE DATE OF PERCHUSE.THIS IS THE SECOND TIME DOME SIMILAR HAPPENDS, I WILL NEVER BUY ON AMAZON AGAIN.", "Date": "June 24, 2008"}, {"Title": "Flawed picture quality", "Author": "N. Franklin", "ReviewID": "R718AW20E8GO5", "Overall": "1.0", "Content": "I took pictures of my artwork with the Nikon but I had a problem with the way the pictures were coming out. I tried again and again but each time certain areas of the picture came out faded. I had an earlier model of this camera before and it worked just fine, but in this case I had to return the camera. I guess in this case it was probably just my bad luck that I got a dud.I was told that Canon has a better quality lenses and a better reputation in general, so I returned the Nikon and got a similar sized Canon. Amazon made it easy to return the Nikon and didn't make me pay for postage or a \"repackaging\" fee. The Canon arrived in a few days. It isn't quite as small, sleek, and sexy, but it takes fine pictures without any fading or distortion.", "Date": "September 13, 2008"}, {"Title": "Nice photos, while it lasts", "Author": "S. D Shearman \"SShearman\"", "ReviewID": "R3DZJD3YVLVV9G", "Overall": "3.0", "Content": "I owned this camera for about a month and really liked it--good shots, fairly good speed, excellent review quality on the huge LCD. and face recognition focus. It even allows you to zoom in/out while you are acquiring video; My older sony won't let you do that.Huge LCD, low cost, 8MP, what's not to like?After about a month of use, a small black \"crouton\" something broke off or came loose inside the camera lens assembly. It positioned itself just on the back of the lens, so that future shots all included a photo of the backside.", "Date": "November 6, 2008"}, {"Title": "HIGHLY Dissappointed", "Author": "laltuna", "ReviewID": "R2P3AT6ZCJRDC3", "Overall": "2.0", "Content": "I purchased this product \"used\" and was told it was in good condition. When taking pictures the camera performs normally and the pics are ok however, when taking videos is another story. The videos are NO GOOD. I purchased this prior to going on vacations to St. Maarten. I filmed a great group of teens playing steel drums. I thought this was going to be such a great memory of my 9th year wedding celebration trip. What a great disappointment when I've got home and tried playing the video. The sound was very distorted and the quality of video was very poor. The vendor should have known this and should have never sold this camera. Or at least give warning about the fact that the video although it works is totally useless.", "Date": "October 11, 2012"}, {"Title": "hate it", "Author": "leann", "ReviewID": "R2UEQ8E6ZXXUU9", "Overall": "1.0", "Content": "READ THIS REVIEW BEFORE YOU EVEN THINK OF BUYING THIS CAMERA. ITS FOR YOUR OWN GOOD----------------------------------it seemed good at first but now i hate it. the picture quality is horrible. on other cameras I've tried, when in the dark, the flash makes the picture more clear and brighter, but using this camera, it look like someone put a thin white layer over the picture...its horrible. i've been using software like photoshop for quite some time so im pretty good at using it. when i edit other pictures they turn fine but when i try to edit a picture that was taken by this camera, it just doesnt workout. the picture doesnt get any better. also, i hate taking pictures of myself or other people, it makes your skin look so oily and your hair look greecy and it makes you look tired. if you having anything like a pimple on your face, it comes out very noticeable.another thing that bothers me is the focus. it takes too long to focus, when im taking a picture with someone, i have to wait so long, then if the picture doesnt come out good, i have to wait again for the camera to take the picture. when my friends ask me to take their picture using their camera, it takes no time at all. i dont have to wait for it to focus, it takes the picture right away plus the picture quality turns out very well. it looks just like the real scene.someone else i hate about the camera is the sound quality of videos. i took this camera to a rock concert, when i uploaded the video to my computer, i couldnt even hear what song it was. and at the concert, i was very close to the stage and speaker. at first i thought it was because of the screaming audience but it wasnt. it partially was because of them but i should i still been able to hear the band. i tested out the sound by playing a song on itunes then recording it. the sound was horrible. there was this extra noice in the background, it sounded like a mess and i was in a quiet room.FOR YOUR OWN GOOD, DO NOT BUT THIS CAMERA. IT IS NOT WORTH THE MONEY, I WOULDNT EVEN BUY A CAMERA LIKE THIS FOR $40.-----------------------------", "Date": "July 2, 2011"}, {"Title": "Anyone care about the slowness? Anoying button", "Author": "Athlonnx", "ReviewID": "R3QL56KD5Z2QRE", "Overall": "2.0", "Content": "I've owned this camera for over a year.  I got it for $130.  This was to replace an old Kodak 4 mega pixel 2003 camera that was like a brick.  Overall, I think my old Kodak was better than this camera....The camera does have some positive attributes, such as the large LCD screen.  If you want the pros on this thing, just read all the other reviews.  People really like this camera for some reason.Bottomline, I have 2 major problems with this camera:1.  It takes forever to take a picture.  Notice that none of the other positive reviews note how long it takes to take a picture.  It's S-L-O-W.  It's slow when starting-up.  Need to capture that fleeting precious moment?  Forget it, by the time this thing boots-up...  The other problem is that the camera has some sort of sensor.  When taking a picture, the yellow light activates (scans the area?) and blinks a few times, after a few seconds, it finally takes the picture.  You can forget about taking a consecutive picture quickly.2.  Actually pressing the button to take the picture.  If you don't press the button just right, it will not take the picture.  Instead, the yellow light will blink and no picture will be taken.  This is considered a feature.  Don't quite understand why.Other people have used my camera and they hate it.I really don't understand why most of the reviewers like this camera.", "Date": "December 7, 2010"}, {"Title": "If a warranty matters - Stay away Nikon", "Author": "FKT Engineering", "ReviewID": "RAM0JQEZ104XM", "Overall": "1.0", "Content": "We bought the Red L18 On Dec 16 2008.  On Feb 14 2009 the lens jammed when extending.  I don't know why, it just did.  I sent it in for warranty repair.  Nikon Service imformed my that it was not under warranty because of an impact, or scratch on the body of the camera.  Unless air can impact or scratch the camera, I have no clue what caused the impact.  I will never touch another Nikon product.It was a nice little camera, but obvously it is far too fragile to take outside.  If you plan on taking it out of the box to actually us it, use it with extreme care.My Canon cameras have been dropped, sat upon, left in the hot sun for hours and they work fine.  I can't even begin to say how disgusted I am with Nikon.Beware...", "Date": "February 27, 2009"}, {"Title": "better nikon", "Author": "R. Korzeniewski \"korz\"", "ReviewID": "R28CQHWF07FP50", "Overall": "5.0", "Content": "This is an improvement from the slider functions selector - you change from picture to movie thru a menu button choice. I think it's better.", "Date": "December 13, 2008"}, {"Title": "Great Camera, Low Quality", "Author": "Christine Ama", "ReviewID": "R3JQSN5BA6KN3M", "Overall": "2.0", "Content": "I have had many Nikon SLR's over the years and have always found them to be made well and a great quality product. Like most reviewers, I have found the CoolPix L18 to be a great point and shoot camera, Unfortunately, the quality of this one does not hold up to my view of Nikon cameras. The Display started to act flaky (occasional flicker) just after a few months of use and eventually quit all together.  Like other reviewers with nikon service issues, Nikon was reluctant to stand behind its product even tho obviously defective, I will consider a different brand with better customer service for my next purchase. Takes great pictures, low quality components...", "Date": "December 12, 2008"}, {"Title": "Great \"companion\" camera", "Author": "SpeedoNJ \"Len\"", "ReviewID": "R1C2P0OQ19E8OD", "Overall": "5.0", "Content": "I love point-and-shoots and have no desire at this point to get intoDSLR, and this LITTLE thing works great to have with you all the time.  I have bigger P&S; from the other mfgs (and Nikon) that do very well but you can't carry them around in  your pocket like this one.Have a Fuji A500 which did just average, this one is much clearer, LCD is huge in comparison, pictures are not grainy.So for that time when you say \"I wish I had my camera with me\" get this and keep it by your side at all times (or use it everyday for all your pictures) and you'll be ready. And it comes in red or blue-- no more boring silver or black only.", "Date": "November 9, 2008"}, {"Title": "Hugely disappointed", "Author": "Janie Jones \"Montana Gal\"", "ReviewID": "ROLSUMN6GJTP", "Overall": "1.0", "Content": "I just bought two of these for grad presents for my twin daughters. I wanted to take a few pictures just to make sure they would be all right. I took pics inside, outside, at a few different settings, close up, zoom. They looked fine when reviewing them on the camera but when I downloaded them onto the computer THEY WERE AWFUL. Even just a normal close up picture is horrible. They are so grainy I can't believe it. I would expect better quality from a disposible. I will be returning these and looking at the Canons.", "Date": "April 27, 2008"}, {"Title": "nikon coolpix L18 *MP Digital", "Author": "Terri Wallace \"reader\"", "ReviewID": "R1SKTU3AV0ZD5E", "Overall": "5.0", "Content": "Great Camera for the money. Nice big screen.Easy to use. I would totally recommend it!", "Date": "June 26, 2008"}, {"Title": "Decent Product for the Price", "Author": "KeyboardIsMightier", "ReviewID": "RHMOXGLZ5QJP3", "Overall": "3.0", "Content": "I purchased two Nikon Coolpix L18 years ago and found the product to be average for the price.  It has a pretty good zoom for a point-and-shoot camera.", "Date": "May 29, 2013"}, {"Title": "okay", "Author": "B. Anderson \"champaign super nova\"", "ReviewID": "RWELYY6KASFJE", "Overall": "2.0", "Content": "Ordered many years ago and just now getting around to review. Iphone sare all the rage now, no need for this.", "Date": "February 18, 2013"}, {"Title": "Worthless Cra*", "Author": "S. Fisher", "ReviewID": "R3CGQU8J4TKUUJ", "Overall": "3.0", "Content": "I bought a brand new Nikon l-18 to take with me to my Vacation to the Philippines, it worked fine in the begining but after shooting #85 pics every other picture was out of focus. the red square would light up then the green when I took the pic it was blurry. Luckly for me I had my Fuji-film f650 also with me and It shot great pictures to bad it was a 6 mgp.", "Date": "March 30, 2009"}, {"Title": "Really bad shots in the night", "Author": "Amit Wadhwa", "ReviewID": "R1P04DTTLH8FA7", "Overall": "2.0", "Content": "The camera works great during daytime but night shots are really blurry. I actually bought a Sony W-150 for myself after this purchase and have kept this as a backup.", "Date": "March 5, 2009"}, {"Title": "very slow", "Author": "Mar \"Marinera\"", "ReviewID": "R1VHJRN98P1OI9", "Overall": "3.0", "Content": "i own this for 1 week and return, nice colorful pictures. but so slow i dont have the patients for it.", "Date": "February 28, 2009"}, {"Title": "Fairly good camera", "Author": "Marisa Bohar", "ReviewID": "R33NGHB9XTGH5R", "Overall": "3.0", "Content": "I was super excited to get this camera as an upgrade to my last one. I gotta tell ya, I was somewhat disappointed with how slow the camera actually snaps a picture from when you click the button. I mainly take pictures of my neices and nephew and I have gotten some profile shots on accident because the picture didn't take fast enough. I am open to suggestions on how to fix this. Another thing is that the camera always seems to drain batteries very quickly. After one use I the battery is half or more used. I am also open to any suggestions there. Otherwise worth the small price I had to pay.", "Date": "February 27, 2009"}, {"Title": "Regular cam", "Author": "Guilherme Mello", "ReviewID": "R3C0Q3V7OMOSG6", "Overall": "3.0", "Content": "The lenses and the shooting waiting time are litle below a sony in the same price range....Everything else is fine. Good value", "Date": "February 26, 2009"}, {"Title": "Bad luck", "Author": "Silver Mouse", "ReviewID": "R2DTUK4W7QHWS0", "Overall": "2.0", "Content": "I bought this camera in December 2008 and in January 09 the screen burned out. I just returned the camera for repair. It takes great pictures. A lots of features. I guess I got a lemon (it was made on friday afternoon). Not only this camera but all digital cameras you must buy a memory card if you want to take more than 20 pictures. Waiting to get it back.", "Date": "February 6, 2009"}, {"Title": "Satisfied Customer", "Author": "Steven Dennis \"bnstruk\"", "ReviewID": "RIH1DT750OYQ7", "Overall": "4.0", "Content": "Very happy with this product. I haven't got my pictures developed yet but it did seem a little blurry when taking pictures around fifteen feet away. But other than that I very much like my camera.And very nice considering the price. So all in all very happy with this product.", "Date": "January 31, 2009"}, {"Title": "Good for the money", "Author": "IAMTHEIAM", "ReviewID": "RH3KJNE2QV3W3", "Overall": "4.0", "Content": "I bought it for my Mother because it has easy mode and real easy mode.The only draw back is the two AA batteries do not last very long at all.Wish it had a lithium ion battery pack like the previous Nikon i had, but get the rechargeable AA batteries seem to work well.It takes a great picture and has quite a few options and a big LED screen is what she like about it.Good camera for the money.", "Date": "January 29, 2009"}, {"Title": "Beware", "Author": "Jennifer L. Stulz", "ReviewID": "R2R61PCRS8DGXV", "Overall": "1.0", "Content": "This camera's lens broke 3rd week we had it! Beware - you get what you pay for and in digital cameras this is a cheapie.", "Date": "January 17, 2009"}, {"Title": "DOA - Nikon Warranty Service was Fast - about 3 weeks, same unit returned", "Author": "Learnfrom Myexperience", "ReviewID": "R2LUMPU39ZB3JR", "Overall": "1.0", "Content": "Bought this for a graduation present. Sent it off to college - it did not work. I tried to get it to work later and it 'takes' a picture but nothing goes to any memory (internal or SD card). I missed the return window by 3 days, with vacations and all. Perhaps a reminder that local brick and mortar stores are much better at this sort of event than packaging and shipping to an ether-store. I'll update this after I learn how Nikon treats me. - UPDATE: Nikon service was relatively fast - It was not clear to me that the warranty service was indeed free since you sort of blindly send the camera off and then they bill you 'no charge' later. It is working well. Some additional info: the camera apparently has no actual optical or electronic image stabilization ability - it just kicks the shutter speed up if it believes motion is occuring. A bit unclear in the description that it does this - FYI...", "Date": "August 31, 2008"}, {"Title": "I ditto EVERYTHING Marjorie and Anon. Shop Had to say... DON'T buy EVEN if on sale!!!", "Author": "T. Alleyne", "ReviewID": "RPO36CSZLAK5W", "Overall": "1.0", "Content": "I wish I could give it \"NO STARS.\" You will be very disappointed.  I returned it to Ritz Camera when I came back from a trip.  The time it takes for the camara to take another picture.. the moment has been lost.  A very, very long time to take the next picture.  The pictures were horrible!  Just plain horrible!  I'm going to stick with my husband's Canon Proshot 870.  A much better camera.", "Date": "April 28, 2008"}, {"Title": "Nikon L18", "Author": "Santiago J. Baraoidan", "ReviewID": "R1E51ZHD0ZZ8G7", "Overall": "2.0", "Content": "Can't give a review at this moment. Receive camera on the 29th Mar., took 21 days to get here in Hawaii. Had to send it to Nikon Service Center on 1st of April to be repaired.", "Date": "April 6, 2010"}, {"Title": "coolpix", "Author": "David R. Stowe \"David Stowe\"", "ReviewID": "R1TWZOO0Q6BYMB", "Overall": "2.0", "Content": "Item was itended to be a gift to our military serving son. Nice company to work with. They were very helpful. . .Still the item never arrived and as of now it's location is unknown. The people have tried everything to help me so I guess that is the way it goes.", "Date": "February 4, 2009"}, {"Title": "Terrible Camera", "Author": "B. Remy", "ReviewID": "R27DRU8080PUZJ", "Overall": "1.0", "Content": "I have used this camera for about two weeks daily now for work. I hate every second I spend behind this piece of junk. It will over-expose and blowout almost every photo you take unless it's not sunny outside and then you get blurry photos from the slower shutter speed. Also, don't even get me started on the terrible auto-focus system. The focus bracket is in the center of the image, but don't think that's where it will focus all of the time. It would regularly focus on something in the background or foreground and I would have no idea because the bracket stays in the center. The macro mode is terrible as well, it says it will focus up to 5\" (which is weak in its own right), but I couldn't get it to focus sometimes as far away as 10-12\" on some photos. I am planning on returning it tomorrow and going back to my Canon A620 which takes much better photos in bright sunlight which is what I need.", "Date": "December 2, 2008"}, {"Title": "Piece of Junk", "Author": "Andrea Grieser \"apg\"", "ReviewID": "R12X5MS70LUDAH", "Overall": "1.0", "Content": "I bought this camera on Dec. 22 as a gift for my son.  We brought it on vacation, and by Dec. 28 it stopped working.  The display monitor wouldn't display a picture any more.  I never dropped it, never manhandled it, and was always careful with it.  My son was, too, as I taught him to always wear the camera strap on his wrist to avoid accidentally dropping it, and I always observed him using it, and he was very careful.  Nevertheless, the display doesn't work anymore, and since it doesn't have a viewfinder, I now have a $100 paperweight, as Best Buy told me it was \"accidental\" damage, even though I had no accident with it.  I guess I'll try sending it to Nikon, though am not happy that I have to pay all the postage for their junky product, and if they decide it's an \"accident,\" I'll get no help there either.The picture quality was ok (though there were a bunch of blurry ones for no reason I can figure out and some with streak marks), but I didn't expect too much because of the price.  Never going with Nikon again, though.  If you decide to buy this anyway, be sure NOT to get it from Best Buy, as they don't stand behind their products unless you buy their ridiculously overpriced warranty plans.  Maybe they buy junk on purpose hoping you'll buy their warranty plans (which by the way aren't that great since we had one on a laptop from them and it took them forever to fix it each time it broke).", "Date": "January 2, 2009"}, {"Title": "This is the worst camera I've ever owned.", "Author": "Brian S. Mccarthy", "ReviewID": "R261LKN7TM4PSE", "Overall": "1.0", "Content": "I bought the Nikon L18 specifcally over other compact digital's beacuseof it's AA batteries. That was a mistake. Using the manufacturer'sbatteries and charger, if I put a fully charged set of batteries in onSaturday, and turn the camera on on Monday, I'm rewarded with \"Batteryexhausted\". Alkalines work better, but not much.When combined with transfer software that can only be described as lame,compared to the typical \"appears as drive d:\" camera interface (You can'ttransfer from the camera except via this special application), thiscamera is junk to be avoided at all costs.", "Date": "November 20, 2008"}, {"Title": "Customer Beware", "Author": "Brody", "ReviewID": "R1GDBHGSRV606I", "Overall": "1.0", "Content": "I ordered this camera, as a gift, from one of the Amazon vendors, Vanns.  It arrived defective and Vanns was unwilling or unable to replace it.  Amazon was also unwilling to replace it, and I was told that I would have to get a credit from Vanns and then re-order it from another vendor.  Apparently, Amazon does not stand behind its vendors...you are on your own.  The right thing for Amazon to do, since this camera is sold by several vendors on the Amazon site and I used my credit card to pay Amazon, would be to get me another camera, from another vendor.  My relationship should be with Amazon, not its myriad vendors that I don't know.  So, beware when ordering from a vendor.  Amazon will not help you if it's defective.", "Date": "May 27, 2008"}, {"Title": "Returned Item", "Author": "Pauliina J. Torres \"paulina\"", "ReviewID": "R205OJXOLGPUN3", "Overall": "2.0", "Content": "Unhappy with camera. I needed more Optical Zoom (soon realized after I bought the camera). Pictures were not clear, had to retake several before I got a clear one. Not expensive, but you get what you pay for. I would probably suggest it for a young kid, my 12 year old loved it.", "Date": "September 8, 2008"}, {"Title": "not good camera at all!", "Author": "mom of 6", "ReviewID": "R22G4CDU712KFP", "Overall": "2.0", "Content": "i bought this camera and it was horrible. the quality of the pictures where not good! i didnt have a good experience with it i would suggest not buying it!!!", "Date": "December 9, 2008"}], "ProductInfo": {"Price": "$295.00", "Features": "8.0-megapixel resolution for stunning prints as large as 16 x 20 inches\n3x optical zoom;  Anti-Shake AE mode\nHigh-resolution 3.0-inch LCD makes it easy to view and share pictures\nIn-Camera Red-Eye Fix; enhanced Face-Priority AF automatically focuses on up to 12 faces\nCapture images to SD memory card (not included)", "Name": "Nikon Coolpix L18 8MP Digital Camera with 3x Optical Zoom (Navy)", "ImgURL": "http://ecx.images-amazon.com/images/I/41xPOzzy4eL._SX300_.jpg", "ProductID": "B0012OELOO"}}