{"Reviews": [{"Title": "Great so far", "Author": "J.P.", "ReviewID": "R3N4CIIO4HFP3K", "Overall": "4.0", "Content": "I bought the Cybershot DSC-W220 for my mom's birthday. She is by no means an enthusiast. It's purpose is going to be primarily for family photos. We had a HP camera before and decided it was time to upgrade. She has sight problems and had trouble seeing pictures on the tiny Hp screen, but this 2.7\" LCD screen on the W220 helps her a lot.The controls are easy enough that anyone in my family can use it, from a preteen to a grandfather. Most of the time, you can just leave it on the Auto setting and the camera will adjust settings automatically. There are separate buttons for Playback/Review, Menu, and Home next to the LCD screen. The On/Off button on the top of the camera is a bit hard to press (sometimes you have to use your nail), but it's understandable because otherwise it'd be easy to accidentally turn the camera on/off. There is a light that comes on from the front so the subjects know when the picture is about to be taken. The Smile Detection automatically takes up to 6 photos, and has a smile meter showing scale of smile(s). Scene Detection detects scenes such as snow, beach, etc automatically and adjusts settings accordingly.I was debating on whether to get this, the W230, or the Nikon Coolpix. The Nikon seems great but in-store testing demonstrated the quality of the pictures-they were too soft. The touchscreen feature was nice, but not nice enough for a sacrifice in quality. I was short on time, so I grabbed the W220 from BestBuy because the W230 was almost $100 more. After doing some research, and talking to a Sony rep, the only noticeable difference between the W220 and the W230 is the larger screen (2.7\" vs 3.0\", respectively). I wish now I had more time so that I could've gotten the W230 from the Sony website-it's only $20 more!There are a TON of features in this camera such as Smile Detection, Facial Recognition, and technology to reduce blur caused by shaky hands. This is by far the most bang for the buck for me.Pros:Sharp, clear picturesThe HD Video it records in 1080 is excellent4x optical zoomscene recognition pics the adjustments for the scenesmile detection automatically takes up to 6 shots when subject(s) are smilingcountless othersCons:The only two things I could find so far were that the Smile Detection feature doesn't work with small smiles, and in some cases, one of the subjects had to smile very wide to activate it.Also, the camera uses the Memory Stick system (like most of Sony's products), not SD Cards like most other cameras, so if you're thinking about purchasing this, be sure to get the Memory Stick (they're cheap on amazon, but expensive on Sony's website. Don't even think about ebay-some are cheap chinese knockoffs that quit working within a few months and all your data is erased-I bought one for my PSP and this is what happened!)I've only owned for a day, so I'll update this in a few weeks. Oh, and be sure to read the manual for some great tips or charging, photo quality, etc. Most manuals are a drag to read but this has got to be one of the few manuals that is well written. If there are questions anyone has before purchasing, don't hesitate to leave a comment and I'll get back ASAP.", "Date": "May 6, 2009"}, {"Title": "Shoots like it's 3x its size", "Author": "Fryfat", "ReviewID": "R2S0EF1EUIVBXN", "Overall": "4.0", "Content": "I bought this last month to replace my older cybershot, and am impressed with the upgrades Sony has made to this line.What I love:* The automatic \"Easy\" mode is quite good, great for those times when you need a quick shot of something you weren't expecting, or for beginners who don't like playing with settings.* Wide angle zoom* indoor shots look great, even under incandescent bulbs* Closeups give good detail.  Flowers and insects make good models.* Connects to my HDTV to show off photos* Ultra compact, easy to carry* Great battery lifeWhat I hated:* No SD card support, this is a Sony product so it will only use Sony's proprietary media, which is more expensive.* While the battery is great, I'd still prefer AA rechargables, since buying an AA battery is easier than finding an outlet while traveling.* Lens has some color issues in the wide angle end, as well as soft corners* Zoom moves in large steps, what if I want in-between?* Menu system is confusing* No optical viewfinder, meaning I always have to use LCD.  Would be nice to save on batteries sometimes.This little camera suits me well, and I've been using it over my canon elph.  I have nicer cameras, but I never seem to have them when the most interesting things in my life happen.  Compatcs, like this guy, are with me all the time.  And with 12P to work with, I can still make large prints like I would with my better cameras.", "Date": "July 21, 2009"}, {"Title": "Value for the money", "Author": "Vince Biasiotta \"Tr00per\"", "ReviewID": "R1W4PXJDOCCL0T", "Overall": "4.0", "Content": "I have had this camera for more than a month, if you want a basic digital camera that is not confusing and takes great pictures this is an ideal camera.  If you want good movie capture than stay away, this is for taking photos not video although the video can be good if indoors and good lighting. I like the ability to choose between HD and SD easily and has the ability to take HD photos in 16:9 format for viewing on wide screen HD tv's I have done that a bit and found the pictures to be crystal clear, I have a 55\" sony HDTV and if you are concerned about your pictures looking grainy when blown up, Don't.  I feel very happy with this purchase and would recommend to anyone looking for digital camera for under $200.  I have no regrets. I wanted a camera to take great HD photos, quality optics, 4x optical zoom and compatible with my other media. I would rate this camera above average in photo quality and speed of use. I did not give this a five star rating because the burst mode is not very fast and I would have liked a few more features like more complex settings for iso and focus adjustments but then again I was not expecting a full feature set for a non SLR  under $200. Very strong Value for the dollar you will enjoy, PS, I am using sandisk pro duo memory sticks and works just fine, Sandisk is so much less expensive than the actual sony pro duo's", "Date": "August 16, 2009"}, {"Title": "Easy to use, and great features!", "Author": "Gin C \"Gin\"", "ReviewID": "RNG3N751CO82Y", "Overall": "5.0", "Content": "We have 14 of these camera's in use in our surgery center, I choose and purchase all our cameras.  Last year we went through an exhaustive search to see if Nikon, Canon, Kodack, and several other brands would work as well as our Sony's that we've used for the last 4 years.  After purchasing several cameras to try them out, we decided to stay with Sony, due to ease of use and reliability.  After reading the reviews we choose the DSC-W220, and replaced all our surgery and skin graphing camera's with these.  We are thrilled, they are extremely easy to use and yet give us incredibly detailed photos.  Each camera takes about 1000 photos a month, and these have been real champs so far.  We have had no problems, and even our newest most camera-shy nurses have taken to them very easily.If your looking for a powerful, lots of functions, easy to use camera at a good price, I'd definitely recommend this one.", "Date": "September 9, 2009"}, {"Title": "Great for the Price", "Author": "M. Sepic \"MAS\"", "ReviewID": "R2DCR1AW2V2C76", "Overall": "4.0", "Content": "I was looking for a pocket size point-and-shoot camera with image stabilization and good picture quality for less than $200. The Sony delivered exactly that for around $150.I find myself taking lots of spontaneous photos because it is so convenient to carry and use.When you adjust the mode wheel the setting are projected onto the LCD screen - easy to see and the icons are clearly labeled.Good image quality allows considerable cropping of pictures without losing too much detail.Is it perfect? No, but the compromises are ones I can live with:  No optical viewfinder  Somewhat limited zoom (4x)  On-off switch and shutter are a little small for me  Battery life is OK but not great (definitely recommend buying a spare)  Lacks manual control of aperature and shutter speedAll in all, this is a camera that begs to be taken along with you and used frequently. Have fun with it - I am!", "Date": "September 27, 2009"}, {"Title": "Sony/Zeiss makes great combo.", "Author": "D. Ehrich", "ReviewID": "R1X4DHQRX6PJ1U", "Overall": "5.0", "Content": "I love the size, the lens and the on-screen and menu options. The photo display does not give the final photos justice, so you have to learn to adjust your expectations. For example, many of my distant mountain shots lacked definition and depth when I looked at the camera, but when I downloaded them into iPhoto, they were sharp, with great depth and detail. So I got a 4 GB card and I don't delete anything until I see it on the computer screen later. You'll love this camera.", "Date": "September 20, 2009"}, {"Title": "I am really happy!", "Author": "Manuel Camacho", "ReviewID": "R9838T5IH80A7", "Overall": "5.0", "Content": "Pro: Great image quality, outstanding 3200 iso. 4x opt lenslight 147 gms. 2.7 LCD is good and bright. Not so noise images at 1600 iso.This camera is better than my Casio exilim or my pentax optio.Cons: You can't adjust zoom while you are recording video. Not SD compatibleI paid 165 dollars, this camera is really great value for your money!", "Date": "May 11, 2009"}, {"Title": "Awesome camera for an awesome price", "Author": "A Delighted Amazon-er", "ReviewID": "R1X6AZAAFUVEKM", "Overall": "5.0", "Content": "I don't know what you can get in a camera that only cost 180 dollars. But Sony Cybershot DSC-W220 is seriously a awesome camera composed of 12.1 megapixel, face detection and a lot more. Shipping from Amazon was fast and easy. This camera make taking pictures fun, enjoyable and a snap. So if you're looking for a good awesome digital camera, i would recommend this one.", "Date": "April 12, 2009"}, {"Title": "Great Little Point and Shoot for the Money", "Author": "Delta Lady", "ReviewID": "R2D1WSBBAFOXU3", "Overall": "5.0", "Content": "We purchased this for our son and daughter-in-law for their anniversary as their old digital camera had given up the ghost ~ and they both love to take tons of photos. I did a lot of research and it came down to this one or a similar Nikon, however as we have had Sony cameras before (and were pleased with them), we decided on this particular model. We wanted something relatively inexpensive for now as we will be getting them an SLR outfit in the future.The only CON I can mention is that you MUST have a Sony Pro Duo Memory Card/Stick to use with this and advise getting it on Amazon at the time this camera is purchased. Our son told us to never mind the Memory Card/Stick, that he felt he could get one locally (they live several states away) however Best Buy sold him two different kinds that did not work and on the third trip, he found they wanted TWICE as much as Amazon Sellers for the Sony Pro Duo Memory Card/Stick. I purchased one on Amazon then from an Amazon Seller on the East Coast for less than $20 (including shipping) and it was delivered three days later. So this was not an issue in the end, however if I had known, I would have ordered it at the same time I ordered the camera.AND my son said I should NOT mark the camera down in stars because it requires a Sony-brand Pro Duo Memory Card/Stick ...The reason being (besides his stating that that is just good old capitalism) is that they think the camera is \"AWESOME.\" We don't hear too much from them these days (written word) as they have been busy playing with their new toy in their spare time, however we HAVE received a number of \"AWESOME\" photos from them ~ the quality has been such that we have printed out 5 x 7s and 8 x 10s for framing that have been \"AWESOME\" as well.Another self-imposed requirement I had was that the camera come with its own battery and charger as I hate the thought of buying and keeping AA batteries for anything such as this. This does come with the battery and charger, so it fit the bill in that regard as well. Battery life is substantial between chargings, the videos are nice and it is very easy to use and figure out. It's a great all-around little Point-and-Shoot camera for the price.My husband and I were in Target a week ago and they had the same camera there, so we were able to actually see it and play with it a little. It is small, not the small size of the Nikon we had considered getting, but pocket-sized nonetheless and substantial enough that it could not fall out of one's pocket without one knowing, we felt. Also, I should mention here that the exact same camera at Target was on sale ($50 off) and was still $50 more than what we paid for it on Amazon (with Free SuperSaver Shipping). They also wanted $5 more for a Sony case that I am going to order on Amazon for it.We are so impressed with the pictures and videos that we are seriously considering purchasing another one for our own use. However, again, I suggest ordering the Sony Pro Duo Memory Card/Stick from an Amazon Seller (if you don't already have one) when you purchase this ~ they are usually sent First Class Mail, so you may also want to check to see what Seller is closest to you as a number of them (with shipping added in) are very similar in price.Amazon fulfilled the order at a fulfillment center west of the Mississippi, so it took about a week to arrive (to an East Coast location) after ordering, not unreasonable at all. It was well-packed and arrived in great condition. Another great Amazon experience.", "Date": "February 20, 2010"}, {"Title": "GREAT CAMERA", "Author": "A. cieniewicz", "ReviewID": "R338IPARBPGPGJ", "Overall": "5.0", "Content": "This is an amazing camera for an amazing price if you have any questions about the camera just comment the only con was that it is only a 4x zoomPS The online Sony store is selling the camera for 150", "Date": "April 27, 2009"}, {"Title": "Easy to Use - High Quality Camera", "Author": "CKE", "ReviewID": "RAF720EZ4JJRX", "Overall": "5.0", "Content": "I purchased this camera as a gift for my in-laws. They are in their mid-60's and they have owned digital cameras in the past. However, they were not looking for something that would require a lot retraining on how to use a \"new\" camera. Enter DSC-W220 with its sleek look and straight-forward controls. My in-laws were knowledgeable about the cameras usage in just a few minutes.  While the camera is easy to use it does not skimp on performance. Mind-you this is not a camera your going to see used by photo journalist, but it is more than adequate for most families. The features that we enjoyed- Giant viewable screen - essentially the entire back of the camera is a viewing screen.- Picture capture is very fast- The DSC-W220 is \"Smart\" and makes it very easy to capture pictures regardless of the light condition, required shutter speed and other factors.- 12.1 MegaPixels is a giant file and will let you get very highquality prints even at large sizes.- The battery can be removed and (using the included adapter) plugged directly into a wall outlet - the in-laws really apprecaited the ease of this feature.Final VErdict - A great value on a easy-to-use high quality camera. This is a camera for the masses.5 Stars", "Date": "January 21, 2010"}, {"Title": "Good, entry level point and shoot", "Author": "Henry Z. Tzeng \"Sleepy H\"", "ReviewID": "R32ZGZ8F60ZT5P", "Overall": "4.0", "Content": "DSCW220 is a very good entry level point and shoot.  Shutter response is good, and controls are intuitive.  Good size Overall a good starter camera.Some stuffs that are a bit annoying1. some of the mode the flash cannot disable2. Easy shot is ok, but pictures taken in this mode tend to be grainy3. taking picture thru another clear material is not recommended (in general, the flash goes off for no apparent reason.Things I like1. it's cheap2. it's small and handy3. good battery life (100 shots with auto flash around 50% of shots)", "Date": "November 4, 2009"}, {"Title": "Great Camera for a Great Price!!", "Author": "Avid Reader", "ReviewID": "RV6CZM3T7YZ62", "Overall": "5.0", "Content": "I bought this camera for $130 which is awesome.The picture quality is incredible with 12 mp.Since I am a person who prints a lot of photos, this camera has been great!It has a lot of extra features such as taking a photo when it sees a smile. But I Prefer the Auto mode.It's battery lasts very long.I have no regrets on buying this. I recommend this Sony camera!", "Date": "January 26, 2010"}, {"Title": "Sony Cybershot 12.1MP", "Author": "David Freeman", "ReviewID": "R3MQZZ16XZT0UM", "Overall": "5.0", "Content": "After the camera shipped it was delivered in only a few days and in very good condition. It works just fine and is a great point and shoot camera. If you want a camera that is easy to operate and very good quality then this one should be considered.", "Date": "September 12, 2009"}, {"Title": "Good for underwater pics", "Author": "Fernando \"Fer\"", "ReviewID": "R1LUG43AJ3HHA", "Overall": "5.0", "Content": "I used it with the Sony MPK Marine Pack, great combination and excellent pictures. I actually went down up to 170 feet, and nothing wrong happens. Good quality.", "Date": "June 25, 2010"}, {"Title": "Good camera and delivery", "Author": "PGH", "ReviewID": "RTV8RSKRLT2OC", "Overall": "4.0", "Content": "The vendor was good to work with - fast delivery, new product, no damage.  The product is very good for the price and easy nature of picture taking. A good decision overall for the typical or average person wanting to take nice pictures easily with a compact, light camera.", "Date": "February 17, 2010"}, {"Title": "Good quality and fast", "Author": "Rebeca Landin", "ReviewID": "R157UP0EJ3EXWQ", "Overall": "5.0", "Content": "I bought this camera new on sale for $129.00.  Before this camera, I had a basic point and shoot Olympus for about 3 yrs and wanted a better, faster camera.  This sony camera takes pictures in about 1 second or less, so it was just what I was looking for. The screen size is big and the buttons are in a good area so that I never press anything accidentally. It always takes sharp, clear pictures with good color. However, if you don't use the flash, there might be a slightly yellow tint.  The camera settings are pretty basic, nothing really special.  My only \"problem\" is that it's pretty loud so I can't really take too many candid shots because you can hear the camera turn on at even the lowest volume.  I haven't found a mute button so far, but that would have been nice for me since I don't always like the beeping it makes when you switch from picture to picture.  Other than that, its a very good camera.  One warning I'd like to give is that it only takes the Sony memory stick, which I did not realize my computer wasn't compatible with.  It comes with a usb cable that can hook up to your computer in this case, but I don't like using a lot of cables so I'm going to opt for a card reader.", "Date": "January 30, 2010"}, {"Title": "sony cybershot review", "Author": "M. Mendoza \"M M\"", "ReviewID": "R2OXZD5ABZCL3O", "Overall": "5.0", "Content": "I bought this camera for my daughter to  replace the one I lost. She loves it and from what I can see it takes good picures and holds up pretty well. Unless you drop it off a cruise ship into the ocean.", "Date": "January 19, 2010"}, {"Title": "Love it!", "Author": "A. Nicholson", "ReviewID": "R3BI0JTZV63W4", "Overall": "5.0", "Content": "Even though I have only had the camera for a few weeks, I have definitely been giving it a work out and LOVE it so far.  Great features and easy to use...the large screen is great and takes pictures quickly so you don't lose the moment like some of my other digitals.  Very happy so far!", "Date": "June 5, 2009"}, {"Title": "Very Grainy Video", "Author": "Dr. K", "ReviewID": "R9IFE7J1S5ABV", "Overall": "2.0", "Content": "The photos were fine (true skin tones and good low light colors) but the video is very very grainy at all three video settings.  The zoom is not the sharpest but is decent.  I am going to return it.  Very disappointing about the lack of video quality because everything else about this camera was great (easy to use, intuitive, nice menus, good photos).FOLLOW UP: I actually returned the camera for a new one hoping the poor video quality was just an anomoly in the first camera.  No, the video was just as poor in the replacement camera. I can actually see each pixel move when viewing the videos on the computer.  The video's look fine on the camera when using the play back/review feature but on the larger screen of a computer, the actual pixels are visible making the video look grainy and poor. It is horrible. I am going to return this second camera and try the Cannon SD1200is.", "Date": "May 10, 2009"}, {"Title": "Awesome", "Author": "Patrick Arndt", "ReviewID": "R3SD6NYQFDOR9V", "Overall": "5.0", "Content": "Very quick to turn on a take a pic. Easy to navigate interface. The battery life is good about 1 day of taking full size pictures. No problems at all.", "Date": "July 13, 2009"}, {"Title": "Wrong camera arrived", "Author": "Sara C Ochs", "ReviewID": "RBRRPVY0HWGD0", "Overall": "4.0", "Content": "I ordered the Sony Cybershot W220.I received the Sony Cybershot W210.I wish I received what I ordered. Thanks.", "Date": "August 25, 2013"}, {"Title": "Great camera!....", "Author": "Christopher White", "ReviewID": "R2A0FOSR1VZD33", "Overall": "5.0", "Content": "I've had this model of camera for four years, and it has taken quite a bit of abuse... and I'm sad to see it go-- I've dropped it, banged it, bumped it, got it wet, and it hung in there. Unfortunately, one exploding soda too many took it out. Every warrior gets old; old foes that once were harmless at some point become deadly. Oh, Sony Cybershot, how you will be missed!!!This was my first camera, and I just loved the way the controls were set up-- a dial switch for the different picture formats, and it shot video (well, the video wasn't spectacular, but it wasn't a full-on video camera... it's only a point-and-shoot; and for that, it did its job very well). The only thing it didn't have that I would have liked was the ability to shoot panoramic shots (which, four years ago, would have made this a very expensive camera... unlike similar models that are out now, which DO have panoramic capability, at about the same price as this model was about four years ago when I bought it). Its small size allowed me to keep it in a pocket, or to carry it in a camera bag with my video camera, and it still took great pictures (note: I'm not a professional photographer-- I used the camera for those \"tourist\" shots, or for pics on family outings; not to take pictures for magazines or for professional grade family portraits). The pictures always printed out clear (12 megapixels, 4X zoom... which, truth-be-told, the megapixels only really matter if you're absolutely hysterical crazy about the printing being absolutely pristine... hence, this isn't really for a professional picture taker, but more for family trips and such... and would probably be good for the kids' first camera), and colors were always life-like (except when the printer cartridges were running dry). I never had a problem with this piece of equipment, and if they were still sold in stores today, I'd have already bought another.However, since this review is more of a eulogy/obituary for my camera, I must say that times have changed. Technology has changed. And it's been a tough decision on whether to buy another cybershot, or go with the biggest competitor, the Nikon Coolpix.And as much as it pains me to say this, I have decided that the newest/latest descendant of the W220, the Cybershot DSC WX80, has been beaten out by the Coolpix S6500... but only because the zoom is better (Coolpix- 12X, Cybershot- 8X) (other than that, they look to be the same camera, except for the name and the outward appearance), and the bundle is cheaper (if by only $10).All in all, I have to say, this is/was a great camera, and overall the only thing that would have made it better for me was if it had a panoramic function (as both the Coolpix S6500 and the Cybershot WX80 do, as do many other digital cameras now).So, if you're looking for something under the $100 price range, but don't want to give up much in the way of functionality or quality, you should definitely consider this camera.", "Date": "August 11, 2013"}, {"Title": "A small camera that packs a POWERFUL PUNCH!", "Author": "Seanzilla", "ReviewID": "R3P8L2DK3LCMXR", "Overall": "5.0", "Content": "After my older SONY Cyber-shot (DSC-P150) had finally bit the dust, I needed a new camera...and QUICK! Since I was (as others were) impressed by the overall photo quality of my prior camera, I decided to pick up another one, but in a newer model. The DSC-W220 has certainly fulfilled my needs...and then some.Nicely compact (about the size of a wallet), this camera has some really nice capabilities. First of all, the display is really big at 2.7\"! The camera also has some nice modifications for the type of shot you're taking (e.g. close-up, landscape, people, etc.). The flash carries very well, but not past 10 feet or so. Although there is not a viewfinder, I have yet to find any need for it, even outdoors. The camera is not heavy, but DOES feel durable in your hands. Battery lasts a pretty good amount of time, but with a lot of use, will drain at an average amount of time. Photos are extremely crisp and clean, and with a 4GB card, you can hold over 800 at the 12Mp setting.PROS: Small, compact, and user-friendly. Great photo crispness and detail. Can focus well on macro settings within 2 inches of object. Has built-in MPEG video for fun short videos. Card and battery are easy to install/remove.CONS: ON/OFF button too recessed, and sometimes difficult to turn on/off unless you use direct finger-tip pressure. Videos are slightly grainy (hey, this is a photo-camera though). Flash not so good beyond 10 feet or so.All-in-all, this is a great camera with some really nice features. Easy to use and handle for all your photography needs. Good stuff!", "Date": "July 11, 2013"}, {"Title": "Doesn't work with Mac", "Author": "MSC Physics", "ReviewID": "R39XU8INBGQCW6", "Overall": "1.0", "Content": "The software for this camera does not work for a Mac OS system.  Considering we use Macs, . . . .Also, very small and thus hard to hold if you have full size or larger hands.But I have no idea about how well it will work with a PC.  If you buy one, good luck!", "Date": "May 18, 2013"}, {"Title": "Sony Cybershot", "Author": "Berntzen Sven-erik", "ReviewID": "R3K7F2Z3GT393X", "Overall": "5.0", "Content": "This is my fourth Sony Cybershot camera. A great choice. Two I gave away to  happy family members after a year or so and one I accidentally damaged. I always bring my Cybershot  in my pocket wherever I go and have taken thousands of exposures in Europe and America. Also made a number of videos. A new Cybershot is not far away.", "Date": "May 2, 2013"}, {"Title": "Great Camera", "Author": "Maral M. Balayan", "ReviewID": "R2UA46D65H6Z4I", "Overall": "4.0", "Content": "It's a great camera. Many options you can choose from.the resolutions and pictures come out great, to print or even post online", "Date": "January 17, 2013"}, {"Title": "I can only give good grades. Good quality. My daughter  uses perfectly. I am going to buy another one for my friend's daughter.", "Author": "gocha", "ReviewID": "R1S1JICN5760IU", "Overall": "4.0", "Content": "I can only give good grades. Good quality. My daughter  uses perfectly. I am going to buy another one for my friend's daughter.", "Date": "December 15, 2012"}, {"Title": "Sony cameras are best", "Author": "Ray B", "ReviewID": "R2WZPCK7TSI4HU", "Overall": "5.0", "Content": "Purchased this camera for use in our Engineering Dept. I have three Sony cameras at home. The Engineering team has been happy with it and have purchased another for different department. Would buy or reccomend another Sony with the Carl Zeiss lens. On sale, they are a good value.", "Date": "December 8, 2011"}, {"Title": "Try canon", "Author": "Ej", "ReviewID": "R30I19JOQ57LRR", "Overall": "3.0", "Content": "I initially bought this...now 3 hrs ago in view of the image stabilization feature...however the pic quality compared to even a lower pixel canon camera that I own, is not unto par. Would not recommend unless u were out of choices", "Date": "September 7, 2011"}, {"Title": "Great camera for the price", "Author": "Spaceman", "ReviewID": "R3AJIANZVWNQHS", "Overall": "5.0", "Content": "Bought this for my girlfriend for her birthday.  We've been to places all over in Europe, the Caribbean, and in the states.  No matter the weather conditions, this camera always comes through with awesome pictures.  Obviously, the technology always keeps getting better, so something at the same price in the market now is probably better than this but I'd definitely recommend this camera to any one of my friends.", "Date": "March 24, 2011"}, {"Title": "Easy to use, great camera!", "Author": "Mario Perez Alfaro", "ReviewID": "R15NV71KZ6EN8S", "Overall": "5.0", "Content": "This camera takes excellent photos, the best choice at the best price, buy this camera thinking that I would get an excellent camera and it was", "Date": "November 22, 2010"}, {"Title": "Was a gift and the quality is great.", "Author": "Peter J", "ReviewID": "R12TKOT4LYKHEH", "Overall": "5.0", "Content": "Sorry, this isn't an in-depth review.  After my in laws came back from the Grand Canyon with horrible pictures from his 1.2 megapixel camera, my wife figured it was time for an update.  It works well and is easy to use when we borrow it.  My father in law who isn't too technical with new gadgets was able to use it without a hitch.  Great build quality and haven't had one single problem with it.  My father in law was impressed with the quality of the pictures, along with my brother in law who has a little older model sony.  I wish it took standard SD cards, but it looks like the newer sonys are.", "Date": "April 21, 2010"}, {"Title": "Nice camera", "Author": "JD \"JD\"", "ReviewID": "R1O3BIC9563Q41", "Overall": "4.0", "Content": "Good camera for the price.  Compact & easy to use.  It does not use a standard USB cable so you always need to bring your own cable with to download.  Also, must purchase the proprietary memory card.", "Date": "April 17, 2010"}, {"Title": "camera", "Author": "Judy A. Shaughnessy \"tulip picker\"", "ReviewID": "R2IKWLP0QYJTUT", "Overall": "5.0", "Content": "bought this camera as a christmas present for my 15 year old son.  he loves it and takes it everywhere.  the pictures are beautiful  arrived on time and in great  condition", "Date": "April 5, 2010"}, {"Title": "Great camera", "Author": "anita", "ReviewID": "R3MR8NREWLESI4", "Overall": "5.0", "Content": "I really like this camera.  Would recommmend it to anyone.  Picture clarity is great.", "Date": "February 20, 2010"}, {"Title": "Good Camera!", "Author": "Purple Jade", "ReviewID": "R1HJYTC2C70LFZ", "Overall": "5.0", "Content": "This camera works really well. The pictures have good clarity and the battery lasts long enough.", "Date": "February 6, 2010"}, {"Title": "Sony Cybershot Can't Be Beat!!!", "Author": "Bradley J. Luckert \"BIGB1972\"", "ReviewID": "R2S0T1VPG3CHKA", "Overall": "5.0", "Content": "This camera is great and lives up to the hype. Most picture for the buck!!! I am very pleased with the features it offers as well as the quality and ease of use.", "Date": "January 30, 2010"}, {"Title": "great product", "Author": "Sanjay Chowdhury \"sanjay\"", "ReviewID": "R1C9WZBAFH0ZCV", "Overall": "5.0", "Content": "excellent picture quality and clarity. pictures are bright in all conditions. i have used Panasonic, HP and many other. My first digital Cam was sony...I have returned back to sony.....there is nothing like it.", "Date": "January 21, 2010"}, {"Title": "Wonderful", "Author": "Abdul", "ReviewID": "R1RI2N4KF5Y10A", "Overall": "5.0", "Content": "Wonderful cyber shot.. One of the best I think.Took lot of pictures all on auto setting. All parties and New Year.. the result is the best memories in pictures. Best part is smily setting, u just laugh its keeps taking pictures.I Recommend this one for all or atleast for lazy people like me.", "Date": "January 7, 2010"}, {"Title": "Great camera", "Author": "Gigi San Andres \"Gigi\"", "ReviewID": "R3S1DF4394F5TH", "Overall": "4.0", "Content": "Very good camera. I had a Nikkon before this, I didn't notice until I had this camera that the other images were very grainy and it didn't work at night. Thank God my brother dropped my nikkon and stopped working so I could buy this one. The quality of the image is PERFECT. The only thing that's not good for me is the shooting time, it takes about 2 seconds before the actual picture shoots, so if I want to capture a moment, I can't because of the shooting time. Besides that, it's perfect.", "Date": "January 5, 2010"}, {"Title": "Great Camera", "Author": "A. Kaplan", "ReviewID": "RX6SMRL3JJ0P2", "Overall": "5.0", "Content": "I have really enjoyed this camera. For the price, it takes amazing pictures and seems to be very durable. It is also really lightweight compared to my older one which is great for when you are on the go. I would recommend this camera to anyone looking for a great, easy to use, point and shoot camera.", "Date": "January 3, 2010"}, {"Title": "everything i wanted", "Author": "Matthew M. Poole", "ReviewID": "R2L5K511WXZ0J9", "Overall": "5.0", "Content": "amazing.  especially the ability to take pictures in low light conditions!  im impressed, and im thankful i spent the few extra dollars to get this camera versus some of the other competition.", "Date": "December 29, 2009"}, {"Title": "nice little camera", "Author": "Neeraj Vora", "ReviewID": "RMUYK5CXY8JOJ", "Overall": "5.0", "Content": "i purchased Sony Cybershot DSC-W220 to replace my old fuji 5.0. i am happy with the peformance and it is small enough to fit in the jean pocket.its nicely built, been using if for two months regularly, and i have no complains so fari have the 16GB sd card, so there is lot of room to store hi resolution picture before running to my laptop to download it. Plus the video in 720 are great !!!!!!! considering what this little camera is capable of.I would have been more pleased if the zoom option was available in the video mode too. but again, i mostly use this to take hi mp pictures.this product truly deserves 5 stars...", "Date": "December 20, 2009"}, {"Title": "Love IT!", "Author": "E. L. Stelzner", "ReviewID": "R5OR77E669SFJ", "Overall": "5.0", "Content": "Love it after going 3, yes 3 cameras in 1 month til this one came along~", "Date": "December 15, 2009"}, {"Title": "Camera is not durable", "Author": "D. Lengar", "ReviewID": "R254VU1V79WQBK", "Overall": "2.0", "Content": "I bought this camera and I was blown away with the picture quality. It says 12 megapixels and thats what it is. I bought the Polariod 12.1 megapixels the week before and had to return b/c I was not satisfied with that product.This camera is legit, couldn't stop taking pictures of everything when I first got it. It really hard to put it down and it seemed like it made everything look clear. I even tried moving the camera to see if the pictures would show up blurry and they still came out fine.I modified my review b/c I went out one night and my friend was a little drunk. I handed him the camera to take a pic and he dropped it. The camera would not work after that. The camera is not durable for dropping. If you drop it, this camera needs to be replaced at while or it won't work. I had to replace mines cuz it would not work.", "Date": "January 28, 2010"}, {"Title": "Affordable Camera for wife uses accessories from my W290", "Author": "R. White \"GreatDanes4U\"", "ReviewID": "R2IMFDGG5DCSYP", "Overall": "5.0", "Content": "Got camera and wife loved it. Also got extended warranty from Vann's SquareDeal. After reading manual I had to have the deluxe Cybershot so I bought the W290 for me with more advanced features and easier to use menu plus better zoom than W220. However for the price this is good and my wife said she likes it when I was going to give to a family member and buy another W290! So we keep both :-)", "Date": "November 8, 2009"}, {"Title": "Poor buy", "Author": "Miguel's Mom", "ReviewID": "R2J5TLDOJNEBZU", "Overall": "2.0", "Content": "The shutter was defective and we had to send it back right after receiving it. It was for my friend's birthday party and she was not even able to use it. Still waiting for the replacement.", "Date": "January 30, 2010"}, {"Title": "Camera Review", "Author": "Jean H. Bullard \"Grandma\"", "ReviewID": "R29NGVH1SP81PO", "Overall": "5.0", "Content": "I am very pleased with the Sony, the only problem I have encountered is the on/off button is very small.  This is my problem as my fingers are somewhat stiff.  The arrival was on time and we are truly enjoying the camera.", "Date": "September 11, 2009"}, {"Title": "OK", "Author": "Maliji", "ReviewID": "RWVT33A8N7TNU", "Overall": "3.0", "Content": "I had a Sony Cybershot earlier..it was too good.. I wanted to buy one for my friend..But this particular model is not so great, but not a bad one for one using a digi cam for the first time..I would have loved a better quality from Sony", "Date": "January 30, 2010"}, {"Title": "good camera for a beginner", "Author": "T. Zhang", "ReviewID": "R3AZCPWQLLTPC9", "Overall": "5.0", "Content": "I bought this camera for my son. It's easy to use and he liked it.", "Date": "September 3, 2009"}, {"Title": "It's just too much for me to learn all the features.  I'm not good at reading instructions.", "Author": "Diane L. Johnson", "ReviewID": "R2GRENK8W1V2ON", "Overall": "4.0", "Content": "I would have liked to have known all the features and how to download to my computer.  I lost my instruction manual, so I am having to learn as I go along. Luckily, my niece and daughter are good at showing me how to operate this camera Sony Cybershot DSC-W220, 12.1 Digital camera.  It does take quality pictures, and I love the automatic focus.  It's my first camera. Used disposable for so long.  Change is good. Overall, great camera!", "Date": "November 17, 2009"}, {"Title": "great camera!!!!", "Author": "Kristin", "ReviewID": "R2YZ2QI0BSXWV7", "Overall": "5.0", "Content": "i bought this camera and it works great!!!! it's a really a really good camera but one thing that i'm not if it's just me or is the camera. The batter doesnt last much but i'm not sure if i used too much or is the battery though but bottom line, the camera is really good!!!!", "Date": "May 24, 2009"}, {"Title": "Best camera! takes great quaility pics and video!", "Author": "S. Qureshi \"SQ\"", "ReviewID": "R1QUUNG5VCWKCQ", "Overall": "4.0", "Content": "As soon as i opened it i loved, i took my first picture i loved it even more.. has great quality with 12 mp :) cant ask for more.", "Date": "November 24, 2009"}, {"Title": "Really Satisfied", "Author": "Aurion", "ReviewID": "R3FF1W3YHT9OUY", "Overall": "5.0", "Content": "I bought this couple of weeks back.Truly satisfied with this.Great product from Sony stable.", "Date": "August 5, 2009"}, {"Title": "Excellent product and cheap", "Author": "Manuel Ramon Cruz Fernandez", "ReviewID": "R2N0I7MZOXFVRC", "Overall": "5.0", "Content": "Sony Cybershot DSC-W220 12MP Digital Camera with 4x Optical Zoom with Super Steady Shot Image Stabilization (Silver)", "Date": "June 3, 2009"}, {"Title": "Proprietary Data Card....", "Author": "B. B. Helsabeck", "ReviewID": "RRP84GFESAXRH", "Overall": "1.0", "Content": "Like all Sony cameras, this one uses Sony's proprietary data card. Every other consumer item on the planet accepts SD cards. Don't continue supporting this oddball arrangement.", "Date": "December 3, 2009"}, {"Title": "No view finder", "Author": "D. Tarantelli \"Zoom91\"", "ReviewID": "RL7XJA2L16XJ0", "Overall": "2.0", "Content": "This camera was a real disappointment and I will be looking to replace it. It has no view finder so outdoor shots in bright sun are very difficult because you can't see the display well. I also felt the picture quality was very poor and grainy. I expected 12 MP to produce stunning clarity but it this camera does not. My older Gateway 4 MP camera is super sharp but a bit large and slow. Again if you are looking for clarity don't purchase this camera. Oh it is small and fast so I guess that's something.", "Date": "July 28, 2009"}, {"Title": "Sony Cybershot review", "Author": "Alejandra Miralbes", "ReviewID": "R39IAYATC3WU4Q", "Overall": "5.0", "Content": "I love the camera.  It was exactly as described by seller.  Would definitely buy from seller again.", "Date": "November 19, 2009"}, {"Title": "small internal memory", "Author": "Kirsten", "ReviewID": "R19GDG6RWHCSOS", "Overall": "3.0", "Content": "Question: is it just assumed that you buy a memory stick because the 15mg holds only three pictures? Our camera tells us the camera's memory is full after just three pictures. Is this the case for everyone?", "Date": "September 11, 2009"}, {"Title": "Great little camera", "Author": "T Bethards", "ReviewID": "R3BM4RXCPENH3C", "Overall": "1.0", "Content": "Great camera for its size. Not quite the picture quality of a full size, but almost. Easy to use. Works really well in all light settings. I even dropped it once with no adverse affect. The zoom really works well. The memory stick is pricey compared to the SD type. Great product for the money. I highly recommend it.", "Date": "October 4, 2009"}, {"Title": "purchase of a digital camera", "Author": "Julieta Enriquez", "ReviewID": "R1WAEPSZ63Q5FL", "Overall": "3.0", "Content": "No complains at all, I got the package as I expected it.I received with delayed, but because of wether conditions and they send me an e mail letting me know this, and the link of the website to track the package.when i got it it was everything ok", "Date": "April 26, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "12.1-megapixel Super HAD CCD image sensor\nCarl Zeiss 4x optical zoom lens; Optical SteadyShot image stabilization\nBIONZ image processor delivers speed and precision\nFace Detection; Smile Shutter technology\n15MB built-in memory; capture images to Memory Stick Duo/PRO Duo Media (not included)", "Name": "Sony Cybershot DSC-W220 12.1MP Digital Camera with 4x Optical Zoom with Super Steady Shot Image Stabilization (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41e79CESOmL._SX300_.jpg", "ProductID": "B001O9ARDG"}}