{"Reviews": [{"Title": "Excellent Camera for Users Who Like Manual Controls", "Author": "Levent", "ReviewID": "R7IVLVPJF4EVQ", "Overall": "5.0", "Content": "I've been using the Ricoh GR II for a little over two weeks now and I must say that it is an excellent camera.  For me the primary thing that I needed was a pocket camera with a fast wide-angle lens, easy to use manual controls (shutter speed, ISO, f-Stop, etc.) that can shoot in low light and in the RAW format.The Canon G9 was way too big and bulky and although it had a nice ISO dial on the top of the camera, I didn't like the fact that I had to cycle between the f-Stop and Shutter speed on the menu to change the settings.The Leica D-Lux 3 (also sold under the Panasonic name as the LX-2) was about the same size as the Ricoh.  It is an excellent camera, but I really did not like the joystick system for the manual settings and it lacked a hot shoe, an optical viewfinder and you could not attach a filter to the lens.The Ricoh has an excellent 28mm wide angle lens with very little distortion. This lens does NOT zoom, but for my uses this is unnecessary.  Although, I do have the option of attaching a converters that can make the lens into a 21mm or a 40mm.  With the addition of a ($50) lens hood adaptor I could add a circular polarizer filter.  The processing engine in the Ricoh camera along with the fast f 2.4 lens allows for excellent photos in low light and at high ISO levels.  The camera takes about four seconds to record a RAW file to the SD card.  But because of a memory buffer, you can instantly take a second RAW photo as the first photo is still being written to the SD card.  The Ricoh has a hot shoe, which allows you to mount an flash unit or some excellent optical viewfinders above the lens.  And finally, for me the best part of the Ricoh is the little control wheel in the front and the control lever in the back of the camera.  This allows me (during the Manual Mode) to instantly control the f-Stop with my right index finger as the thumb controls the Shutter Speed (in the same manner as a Nikon DSLR).All in all, this is a great pocket camera that has some very professional features. It DOES have a full auto mode, but it does NOT have the many program modes of the consumer cameras such as landscape, portrait, sports, etc.This is a very expensive pocket camera, that is capable of a very fine image.  Because of its manual controls I would recommend it to anyone who loves the technical aspects of photography.But in the hands of a beginner it is perhaps too much of a camera and I think it would be a bad camera to give to your grandmother, unless of course your grandmother was Annie Leibovitz.", "Date": "January 29, 2008"}, {"Title": "What it is and what it isn't - v.2", "Author": "Coronet Blue", "ReviewID": "R2ME16CT3R5UAW", "Overall": "3.0", "Content": "This is a very nice camera, with a ton of little tweaks that show Ricoh has again listened to users.  But the image quality is virtually identical to the previous model so it's hard to justify the price.The camera is beautifully made and in this respect, essentially identical to the GR-1 film cameras.  The flash on mine isn't loose although it is a manual pop-up which is a mixed blessing, in my opinion.As with the original GRD, the lens is quite good.  There are cheaper cameras with zoom lenses that are sharper in the center but if they go down to a 28mm equivalent, the corners are awful, whereas the performance on this Ricoh stays good, right to the corners.  Most point and shoots solve the poor quality/wide angle problem by not going there, which is probably just as well.  Consumers, by and large, don't know the difference, as they think they will need a telephoto to shoot a charging Rhino vs. needing a wide angle to photograph a birthday party in a small room.How's the image quality?  Identical to the original GR-Digital but with one advantage: the newer camera writes RAW files with reasonable speed and since RAW does give a bit of extra detail, you could say the GRD II is better in that it makes it practical to shoot RAW.  No, the GR Digital II does not give the quality of the GR-1, but the GR-1 is a film camera.  An iPod doesn't sound as good as a McIntosh stereo system but we're in the digital world now. Three things matter: (1) convenience, (2) convenience and (3) convenience.  Things like lenses optimized for a specific focal length, and tripods are so yesterday.GRD II feature changes:Good--Writes RAW in a few seconds--Buffer allows writing a second RAW immediately after first (but not a third)--Fabulous new LCD, extremely bright and clear--Battery retaining clip--Two, top-mounted \"my settings\" for instant recall of personal settings.--Faster preview.--Preview auto rotates shots taken vertically--Terrific, easy to access menus.  Even better than previous GRD. Faster, too.--\"High ISO\" options to cap off maximum ISO (helpful with noise).Bad--Price.--Same (small) sized sensor as previous camera creates unsolvable high-ISO noise problem.--Focus sometimes slower than on original GR Digital (different mechanism--see photos of front of cameras)Neutral--Auto leveling indicator.  Works, but only for rotation (easily corrected in Photoshop).  Does not indicate if camera is tilted up/down or if parallel to subject.--Skew correction.  Believe it or not, camera attempts to straighten tilted subjects but usually says \"recognition failed\".--Switchable noise reduction.  Haven't tried this.--Manual, pop up flash.  Can't go off by accident but also slows you down when you need it.--On screen, depth-of-field indicator.  Clever idea but I'm not sure I see the need.--Wheel on rear of camera replaced by spring loaded switch.  A wash, as far as I can tell.--10 megapixels vs. 8.The fact is, these days, most people WON'T buy a camera with a fixed focal length lens, no matter how good so don't expect one from Canon or Nikon anytime soon.  Olympus tends to be a wild card so you never know.  Sigma has promised one but with their quality, I'd be very cautious.It should be obvious that this is not an all-purpose camera, nor is it for everyone.  I wouldn't have bought it, but I found I used my first GR Digital much more than my Elph or even my SLRs. Its fun!  Unless you are going to use film, you won't get better quality with a wide angle in any camera close to this size.", "Date": "December 19, 2007"}, {"Title": "A quick review", "Author": "hbthemik", "ReviewID": "RJRWACSC9KRZH", "Overall": "5.0", "Content": "I've done a lot of research before buying my 1st Ricoh. Since I used to use DSLR and film SLR(still use it), and decided to come back to the p&s; world, I knew what a high-end p&s; could offer and could not. You will get plenty of info. on the technical side of the camera, so I'll skip it here.I started my search from Panny LX3.. and ended up debating whether to choose GRD ii or GX200.. I wanted the versatility of a zoom lens, but the attraction of prime lens was quite big.. since this was going to be my only digital camera, I hesitated a little. In the end, I chose GRD ii for few reasons.1. better, simpler, more classical looking.2. better quality of a prime lens (faster, less distortion, etc.)3. slightly smaller although it's not much4. the fact that it is less popular than gx200 yet more passionate users.These are somewhat biased, subjected reasons but oh well whatever makes me happy, right?So, after owning and using it for about a month now, I love it.If you're reading this, trying to figure between a zoom and a prime, don't let its prime lens stop you.It's what makes GRD a GRD, and it's been on since the era of analog GR1 series, because it WORKS!On the other hand, I love GRD so much, I'm thinking about getting GX200 as well.. :)", "Date": "November 17, 2009"}, {"Title": "RICOH GRRRRRRRRRD II", "Author": "projekt", "ReviewID": "RNXM365EK0JXC", "Overall": "4.0", "Content": "I just believe this camera should get its due.It is a compact digital camera with full manual control.It is a compact camera that has buttons and controls fully customizable.It is a comapct camera that fits snugly into your shirt pocket.It is a compact camera that can capture images in RAW in .DNG format.It is a comapct camera with a fixed lens (28mm).It is a compact camera that has no 'Image Stabilization' feature.It is a comapct camera that renders beautiful grainy Black & White images.It is a compact camera that can capture Macro images 1.5cm from the subject.It is a comapct camera that comes with a detailed instruction manual.It is a compact camera that has a plethora of accessories (Viewfinders, Wide Angle Lens, Telephoto Lens, etc..)It is a compact camera that captures that special moment when you didn't tag along your DSLR.It is a compact camera not designed for the point and shoot crowd.It is a camera that you can carry everyday with you.Let the images I have shared speak for this compact digital camera.The images were all shot in Jpeg format.", "Date": "June 6, 2009"}, {"Title": "Don't buy it unless...", "Author": "S. Agar", "ReviewID": "R1CVLLOTVKRIZM", "Overall": "5.0", "Content": "...unless you know what you are buying, and you are sure that it's what you want.This is  a fixed focal lens, only 28mm equivalent. No optical zoom...It does not give you photos w/o noise.. It makes beautiful B+W photos, which you may not care at all. It takes RAW photos (also), which you may not care about, because it takes so long to convert to JPG. Therefore you are better off with a Canon or Sony, if you think these are important problems for you.For me, this camera is a backup for my Leica M8, for street shots, candid shots, at high ISO's, mostly in B+W. It's even smaller than an M8, has a perfect lens, quiet, reliable AF, and I can use it at waist level (with LCD turned off) to take some interesting photos.I carry it around instead of a 21mm (28 eq. on M8) lens with Leica.Use RAW and utilize the full benefit of having the GRD II.My wife has a 12.5 MP Canon with IS etc. That's an excellent camera. If you are after a good P+S camera, don't even consider the Ricoh GR DII.Best regardsSeyhun Agargallery.slrdigital.org", "Date": "February 28, 2008"}, {"Title": "Disappointed", "Author": "aralsea \"aralsea\"", "ReviewID": "R3PTQ34976RUKB", "Overall": "2.0", "Content": "I owned a Ricoh GR1v film camera (RIP) and hoped the GR Digital 2 would provide a similarly high level of image sharpness and color rendition, along with the 28mm fixed lens and great minimalist design.Unfortunately, I was disappointed: the GRD2 is not the digital equivalent of the GR1v in terms of image quality. Color rendition was OK in good outdoor light, but images were not sharp and focus was inconsistent in all settings, even in SNAP and infinity.Write speed in RAW seemed OK to me, but it's probably not fast enough for someone looking to shoot a lot of action.When set to 3:2 the image isn't perfectly aligned in the view screen--it's as if the image is slightly rotated to the right. Maybe this explains the level feature? Regardless, the images seemed to be level on my computer. (It was always a pain to get images level with my GR1v.)Which leads me too...the overall build quality of the GRD2 is poor--maybe average for digital p&s; cameras, but worse than the GR1v and not what you'd expect for $700. The flash, for example, is a bit loose when closed.Another thing mail-orderers should know: the GRD2 is also a lot smaller than the GR1v. (This made me sad.)The ability to set aperture, film speed and exposure compensation, and the ability to customize the control functions, are great features, but the image quality is just not good enough to justify the price.I really wanted to love this camera--even like it--but the image quality just isn't there. Ricoh: please, please figure this out! People will buy a high quality fixed lens digital point and shoot with a great minimalist design, but the images have to be SHARPER than zoom point & shoots!", "Date": "December 10, 2007"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001022HWG"}}