{"Reviews": [{"Title": "Great P&S; camera but avoid EXR Auto mode at all costs", "Author": "landale", "ReviewID": "R37IO09FJEEAGP", "Overall": "5.0", "Content": "I received this camera a week ago and have been very impressed with it so far.  I had previously bought a Panasonic FX150 in December but returned it after 2 weeks due to horrible ISO400 performance and too much noise on the lower ISO settings as well.  I had high hopes for this camera as I wanted a camera that could achieve good low light shots but thought something like the Panasonic LX3 was too big and too limiting with it's short zoom.Before going into the many positives of this camera I want to express my only major negative with this camera and that is its ability to select the correct ISO setting for each shot.  When shooting indoors in low to average light or when shooting with the flash the camera tends to choose a much higher ISO then needed resulting in shots with more noise then there should be.  There is no reason for an image stabilized camera to select ISO800 with a shutter speed of 1/80 or faster when there is no movement in the frame.  While this happens across all modes on the F200EXR it is more extreme in EXR Auto. I did a quick test with the camera taking two shots in P mode, EXR SN and EXR Auto seconds apart.  P mode and EXR SN selected ISO200 while EXR Auto selected ISO400.  In reality ISO100 would have been fine for this shot but the ISO200 shots still looked very good.  I have even had shots where ISO400 would have been adequate but EXR Auto selected ISO1600!  Thankfully in most modes you can set a max ISO to keep the setting better under control, EXR Auto is unfortunately always stuck in full Auto ISO.  The one good thing to keep in mind here though is that the F200EXR's ISO400 performance is better then almost any other P&S; out there so while it still might show some noise it will look almost as good as ISO200 on most of the cameras in its class.  If EXR Auto is the main selling point for you then skip this camera.  If you want one of the best cameras on the market right now then keep reading.Now there are a lot of positives to this camera, many of which have already been discussed in other reviews so I won't go on forever about them.  The screen is great and the camera feels solid in your hands.  The menu system is a little strange but it's pretty easy to figure out once you get used to it.  I am really just going to focus on image quality though.  One of the best things about this camera is its EXR sensor that allows for 6MP images to be taken with low noise or increased dynamic range.  While some may think 6MP isn't enough, don't believe the marketing hype.  For 95% of the people out there 6MP is plenty and lower noise or increased dynamic range are far more useful then 12MP images.  This lower noise is apparent across the board but is especially noticeable in how clean and detailed ISO400 and many ISO800 shots turn out on this camera.  For web and 4x6 printing you will be hard pressed to find much difference in shots taken between ISO100 and ISO400 while in a true rarity for the class many ISO800 shots as well.In my use I have found the secret to the best quality images from this camera is to avoid the EXR mode entirely and use P mode with the image size set to 6MP.  While the instructions make it seem like the EXR sensor is only used when the mode dial is on EXR my results indicate that EXR is used anytime the image size is set to 6MP.  For instance ISO100 with a DR of 400 would only be possible if EXR is used and this is possible in P mode (or M mode for that matter) as long as image size is set to 6MP.  The setting I use for most shots is P mode, 6MP, DR set to Auto and ISO set to Auto (400).  This keeps the ISO in a reasonable range and still allows the camera to take advantage of the EXR sensor.  When shooting at night or in low light I will just adjust the ISO to Auto (800) to allow for a greater ISO range.Overall I can't say enough positive things about this camera.  Sure it would be nice if it had HD video or a higher resolution screen but those aren't required to take fantastic pictures.  The automatic ISO performance is disappointing and the EXR Auto mode even more so but as I stated above there are plenty of work arounds.  Sure the camera isn't perfect but I think for anyone willing to adjust some settings themselves will discover a P&S; with some of the best all around image quality around.", "Date": "March 10, 2009"}, {"Title": "Depends on What You Want it For", "Author": "MV", "ReviewID": "R624AIVUDLQTY", "Overall": "3.0", "Content": "I don't mean for this to be an in depth review. There are a lot of truly excellent in depth reviews posted here already.I followed this camera since announcement and have been eagerly awaiting its release here in Canada. After about a week, though, it's going back.The big issues I have with the camera may not be of high priority to other people, but are particularly important to me. This camera, as others have said, is generally superb, and can take absolutely fantastic pictures with the best dynamic range available.And one other positive which is important to me but not mentioned by a lot of other people is the flash recycling time is quite good, maybe 2 seconds.Auto white balance is excellent too.My issues:* Because this is to be a family camera, it has to be easy to use without really being educated about its functions. The full auto modes are not good enough - the EXR mode is loud and annoying, and both auto modes take pictures in ISOs that are not even remotely necessary. I don't need my wife taking ISO 1600 shots in decent indoor lighting at 1/60th of a second. That's not particularly helpful. It also prevents me from ever using most of the presets (snow, party, etc)* While high ISO is obviously better than anything else in a compact, the camera needs it because the image stabilization is not as good as on Canons and Panasonics because it is sensor-based rather than lens based.* I come from A series Canons, and the ability to set apertures and/or shutter speeds is sorely missed, particularly were auto ISO gives you 800 or 1600 more often than 200 unless outside in daylight.* Video is important for us because with small children it is nice to have a video capabilities at all times and we don't carry around a video camera. Video capabilities on this camera kind of suck.* A critical point for me, though not much I'm sure for a lot of others, is continuous shooting. Rarely do kids look the right way, so to be able to burst shots until you get the right one is very important to me. This camera can only do quick bursts at full resolution for 3 shots (or at least it only keeps the first or the last 3), and the full continuous shoot mode is painfully slow, I would say one shot every 1.5 or 2 seconds as it refocuses between each shot. That is not nearly good enough, and while the camera does have a (very) quick continuous mode, that takes shots at only 3 megapixels.* The battery cover keeps opening up in my pocket. Not a huge deal, but at the same time, maybe it is...So like I said, the camera is great at what it does, but its limitations may be important depending on your needs. Video, as noted by others, is bad. Photos, as noted by others, are superb, IF you are expert enough to learn and use the camera. As a straight point and shoot, the camera is not particularly good, as it boosts ISO way too much. And continuous shooting is, for me at least, unacceptably slow.I really wanted to like this camera, and dynamic range is something I always really wanted, but the F200 EXR just doesn't work for me.I am inclined to try the new Panasonic super zoom next (the ZS3/TZ7). I don't need a super zoom, and I understand Panny is coming out with a similar 5x zoom at some point, but I don't want to wait. I understand the ZS3/TZ7's burst mode is faster, the lens is wider (and better), and the video is HD. I also understand the Panasonic has excellent lens-based image stabilization, and much better battery life (though I never had a problem with the F200's battery life). While the Panasonic has fewer manual controls, it is supposed to have the best auto in the business. While I would prefer more controls, it is more important for everyone to be able to pick up and use the camera to produce quality shots than for me to be able to (and have to) play to get pretty pictures.I think Fuji really missed the strike zone on this one. This camera with a better lens, better auto intelligence, and better video (and better continuous shooting for me at least) could have been a huge smash success that reinvigorated the Fuji brand for cameras. As it is, the camera is a tiny small step forward but big step to the side from their previous compacts. It's really too bad.Hope this helps.", "Date": "April 2, 2009"}, {"Title": "Excellent Camera for IQ, What it is and What it Isn't", "Author": "atomic240", "ReviewID": "R2MCNWZA98BLCG", "Overall": "5.0", "Content": "The short and sweet of it is this probably the sub-compact camera that will give you the best Image Quality (IQ) of any other camera in this category.  I do not consider the Panny LX3 as being in this category as it is larger.  If size is not an issue, then an interesting comparison can be drawn whereby they both produce excellent output with their own pluses and minuses.  But, the LX3 was simply too large for my uses.What it Is - This is a specialty compact camera much like the F30 and F31fd before it.  I owned both of those cameras.  I call it \"specialty\" because you have to coax it a bit to get the best IQ from it, just like the F30 or F31fd.  Just like the earlier Fxx series, you can't rely on \"Auto\" modes to yield the best pictures.  This camera, just like the earlier Fxx series, hikes the ISO way too much for the shot at hand in most cases.  I believe that this was done to absolutely insure that no blurry pictures occur.  Anyone with decent technique can take crystal clear pictures at much lower ISO's and lower shutter speeds if the subject is still.Advantages over the F31fd:Better lens, MUCH less purple fringingSharper pictures even in 6MP modeWider and longer reachImage StabilizationBetter Noise Profile - Noise reduction is less aggressive thereby retaining more detail in 6MP mode.  Noise may be a bit more prevelant, but it is much less bothersome on the F200exr.  It is more film like in terms of grain, not that blotchy colored mess that can often be seen on cameras in this class.12MP high resolution is there if desired and the subject is suited to it.MUCH better WB.  The F31fd was way too cool when doing typical shooting outdoors.  I had to put it on the \"cloudy\" setting to get it to a more realistic balance even in sunny conditions.  This is not the case with the F200exr.  The white balance does a great job indoors and out. One less thing to fiddle with on the F200exr.Dynamic Range, though not as high as billed, is better than the F31fd when in 6MP mode.Disadvantages:Shorter battery lifeLens is slower on the wide end, 2.8 vs. 3.3.(I really hope they come out with an E900 update to address these issues)Manual control, just like the F31 can be difficult when compared to the LX3 or the FZ28.  There isn't the PASM modes on the selector dial, though a P mode and M mode are offered, but not at the level of control that you would get with a cam that gives you full control.What it isn't - Fuji has billed this as the ultimate point and shoot.  While it can certainly function in that role, you will not get the best IQ out of it that way.  This is why you will see the occassional 1 and 2 star reviews with this camera, just like with the F31fd.  The F31fd in knowledgeable hands could produce photographs of spectacular quality as does the F200exr.  But, don't expect it to do that in auto point and shoot mode including the exr auto mode (jumping to high ISO's way too fast).  Pannies don't do that and the LX3 may be better choice for this kind of shooting.  It's auto mode tends to peak at ISO 400 until very low shutter speeds are encountered, and then it will increase the ISO from there.  This is similar to the FZ28, which I do have.  Great zoom cam btw.  Panny also accounts for movement in the frame too.  The LX3 also has that awesome F2.0 lens offering over at least a 1 stop advantage over the Fuji.  This would be great if you didn't have to pocket the thing.  The menus on the Fuji just aren't as easy to use as some other cams in this class and don't seem to offer the level of features either.  This has not changed from the F31.In summary, this camera, like the F31fd before it, is all about the sensor.  You will have to put up with some annoyances in terms of camera features, but the output really is spectacular for a camera of this size.  Know what this camera is and is not before you buy it, and you won't be dissappointed.  If it is IQ in a pocketable compact you are after, then you have reached your destination.", "Date": "March 11, 2009"}, {"Title": "Outstanding Advanced Camera, Excels Where Others Fail! Highly Recommended!", "Author": "C. Hill \"CFH\"", "ReviewID": "R1MCF5YTGJL4S5", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_33223041embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_33223041refresh_preplay() {\n\ndocument.getElementById(\"cv_33223041chiDiv\").innerHTML = document.getElementById(\"cv_33223041hiddenPre\").innerHTML;\n};\ncv_33223041refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_33223041so;\t   \n\n\nfunction cv_33223041loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_33223041so = new SWFObject(swfLocation, \"cv_33223041AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_33223041so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_33223041so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_33223041so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_33223041so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_33223041so.setAttribute(\"height\", swfHeight);\n          cv_33223041so.setAttribute(\"width\", swfWidth);\n          cv_33223041so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_33223041so.write(\"cv_33223041flashcontent\")) {\n          fp_resizePlayerSpace('cv_33223041', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_33223041';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_33223041', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_33223041loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_33223041\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2IBZXNOGF7CDB\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2IBZXNOGF7CDB\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1MCF5YTGJL4S5\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2IBZXNOGF7CDB/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_33223041duration')) {\n      document.getElementById('cv_33223041duration').style.display='none';\n    }\n    cv_33223041loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_33223041loadSwf(movieID, playerVersion) {\n   return _cv_33223041loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_33223041newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_33223041', 0, h);\n}\n\nfunction cv_33223041resetPlayer(w,h,bw,cc) {\n  cv_33223041newHeight(h);\n\n  cv_33223041so.addVariable(\"resetBandwidth\", bw);\n  cv_33223041so.addVariable(\"cacheCode\", cc);\n  cv_33223041so.setAttribute(\"height\", h);\n  cv_33223041so.setAttribute(\"width\", w);\n  cv_33223041so.write(\"cv_33223041flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_33223041RollOverImg = new Image();\ncv_33223041RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81lf%2Brtz89S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_33223041preplay = document.getElementById('cv_33223041preplayImageId');\nif (cv_33223041preplay) {\n  cv_33223041preplay.onmouseover = function() {\n    cv_33223041preplay.src = \"http://ecx.images-amazon.com/images/I/81lf%2Brtz89S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_33223041preplay.onmouseout = function() {\n    cv_33223041preplay.src = \"http://ecx.images-amazon.com/images/I/81lf%2Brtz89S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_33223041preplay.parentNode;\n\n  var cv_33223041currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_33223041currentClick) {\n      return cv_33223041currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 7:38 MinsThe FujiFilm F200EXR is a very compact camera that packs a lot of advanced features into a \"Point & Shoot\" format camera body. This camera is capable of taking outstanding photos in all of it's modes, including the \"Auto\" Mode for everyday picture taking (not to be confused with \"Auto EXR Mode\", see below). We are avid photographers and own several other digital cameras, including Point & Shoot, Compact, and a dSLR that we use for family photos and taking product pictures for our small business.This is somewhat of a lengthy review, so I will summarize my findings here:If you are looking for a \"Point & Shoot\" camera for taking the occasional casual picture, this camera is probably overkill for your needs and you would be better off with a less expensive alternative. That being said, if you are looking for a very powerful, feature rich camera that can be made to perform well in almost any setting and for any application, all in a very small \"Point & Shoot\" format, then this camera is well worth the investment! This camera packs more features and often takes better pictures than our much more expensive dSLR camera.Now for my overview and full review:The F200EXR is truly packed with many top of the line features, including -* 12 Megapixel Super CCD EXR Sensor* 3\" LCD Screen* Wide Angle (28 mm) through 5x Optical Zoom (140 mm)* Dual Image Stabilization* Wide Range of Preconfigured Modes (see below)* Face Recognition with automatic in camera Red Eye Removal (works well!)* Support for SD, SDHC, and xD cards* Includes 48 meg of internal memory, enough space for about 10 pictures in the highest quality mode* Long lasting Lithium Ion Rechargeable Battery (NP-50)What's in the Box -* F200EXR Camera* Lithium Ion Rechargeable Battery (initial charge took just under 2 hours)* Home Battery Charger* Wrist Strap* Proprietary USB/Video Cable (standard video/audio only, a HD cable is available but not included)* Printed Basic Manual Booklet (in several languages)* CD with Owner's  Manual (Full) in PDF* CD with FinePixViewer Software (not bad image management, basic editing, and linking to Fuji web content)* Plastic Sleeve for Battery Storage* Miscellaneous Warrantee and Warning PagesThe Controls on the small camera body are generally well placed and easy to use, with a \"rose\" type interface for selecting and navigating the many menu options, selecting Flash, Macro, Self Timer, Delete, and Exposure Compensation settings. In addition to the Power Button, there are also four small buttons for selecting Playback, Photo Mode (F), Face Recognition and Red Eye Removal, and Display.Pressing and holding the Playback button while the camera is off will turn on the camera and allow for viewing your pictures without extending the lens.The Photo Mode (F) sets many options that will affect your pictures, like ISO, Dynamic Range, Image Size, Image Quality (jpeg compression, I turned mine from the default \"Normal\" to \"Fine\"), White Balance, and Film Simulation.  Interestingly enough, this important mode is not covered in any detail in the printed \"Basic Manual\" so you must look at the Owner's Manual on the CD or download it from the Fuji web site.The numerous shooting modes are accessed through the Dial and include:* \"Auto\" (Red Camera Icon) mode allows the F200EXR to be used as a \"Point & Shoot\" and usually produces truly outstanding quality pictures* EXR Mode (EXR Icon, White Letters with Red Background) -  - Fine Capture Mode (High Resolution), produces very crisp detail of intricate subjects and is useful in product photography - The Camera will display HR when in this mode.  - Pixel Fusion Mode (High Sensitivity and Low Noise), produces low-light shots with minimal noise - The Camera will display SN when in this mode.  - Dual Capture (Wide Dynamic Range), takes two pictures and merges them in-camera to provide great detail in highlights and low lights. - The camera will display DR when in this mode.  - Auto EXR Mode, tries to select between several presets (many found in the SP Mode, see below). This is very Hit & Miss, as the camera will \"hunt\" around a lot - I will avoid using this mode and use the regular \"Auto\" mode or manually set the SP mode when possible.* Program (P) and Manual (M) modes are standard modes enabling the user to set Shutter/Aperture priority or to take full control of settings, respectively* Natural (N) is an interesting option for capturing images with the natural scene lighting* Natural + Flash (N+ Lightning Bolt Icon) option takes two pictures, one as the \"Natural\" mode and another with the flash, to ensure a good picture is captured.* Movie Mode (Movie Camera Icon) is a really useful video (with audio) clip capture mode that allows for 320 or 640 resolution at 30 Frames/Second. The clips are saved in standard AVI format and are surprisingly good! The one main complaint is that you cannot use Zoom while filming, so you must select the Zoom you want before starting.* Scene Position (SP) Mode allows you to select between 15 presets, including:  - Portrait, Portrait Enhancer, Landscape, Sport, Night, Night (Tripod), Fireworks, Sunset, Snow, Beach, Underwater (for use with the optional Underwater Case, this camera is not waterproof), Museum (turns off sound, flash, and Focus Assist Light), Party, Flower, and TextThere are far too many options and combinations to cover much more deeply, so I'll wrap this up with my major likes and dislikes:Likes -* Great Point & Shoot \"Auto\" Mode takes impressive 12 MP pictures (file size is roughly 4.3 MB in Large 4:3/Fine resolution)* Very low \"Shutter Lag\", even when not pre-focused* Impressive Wide Angle and 5x Optical Zoom Lens* Clear description of Shooting Modes displayed on LCD when changing dial settings* Fantastic EXR Modes allow for capturing outstanding pictures that would have been unusable with lesser cameras. In particular, the Pixel Fusion (SN) and Dual Capture (DR) modes are very useful for solving difficult photography problems.* Outstanding \"Super Intelligent Flash\" produces great illuminated scenes without washing out the subject, a feature that is very useful in Macro Mode which we use heavily for our business product photography needs.* Accurate Face Recognition with automatic in-camera Red Eye Reduction - This feature assures people are in focus, helps with in-camera Slide Show playback, and can automatically remove Red Eye. It is also very cool to watch it work!* Large ISO range of 100 to 12800, without much noise or grain when using SN mode* Decent battery life of about 180 - 200 or so shots without flash, drops fairly quickly if flash is used a lot. I recommend buying an extra battery or two.* Lots of user selectable options - Spending a little time reading the Owner's Manual is a good investment to learn about all of the features packed into this camera.Dislikes -* Steep Learning Curve (reading the Owner's Manual is absolutely required to take full advantage of all the features this camera offers)* Auto EXR Mode is really \"Hit or Miss\", we will not be using this option as the camera makes a lot of noise and does not always select an appropriate mode.* No Zooming while filming in Movie Mode* No Remote Control* HD Cable is not includedThis is a very powerful camera that can be made to outperform almost any other consumer grade camera currently on the market if you spend a little time reading the Owner's Manual and do a little experimenting with the extensive options.We have been able to take absolutely beautiful pictures in the standard \"Auto\" mode and have produced some photos that we would not have been able capture, because of tricky lighting, by using the EXR modes. We will likely make the F200EXR our primary camera for taking our business product pictures (using the EXR \"Fine Capture\" mode), as the results are truly outstanding!The F200EXR is \"Highly Recommended\"! The positive elements of this camera significantly outweigh the few negative items, making this an easy choice for those in need of the advanced features and functionality this camera delivers in a very compact Point & Shoot form factor, 5 out of 5 Stars!", "Date": "April 1, 2009"}, {"Title": "Take it everywhere!", "Author": "jbortz", "ReviewID": "R3ELYHUOO7L4QA", "Overall": "5.0", "Content": "I consider myself to be a photo enthusiast / semi-professional as I do some commissioned portrait work on the side.  I primarily work with the Nikon D300 DSLR for all of my photography and once I switched over 100% to DSLR's a few years back, I never thought I'd find a \"pocket sized point and shoot\" camera that I'd be \"unashamed\" to carry around with me.  Well, I was wrong.  I recently got my hands on the F200EXR, and it is a beautiful thing!  It's got plenty of resolution (12MP) to satisfy any and all photographic needs, but even more important and impressive is its ability to capture clean (very low noise) images in low light (particularly when you boost the ISO to 6400 at a reduced resolution of 6MP).  Another wonderful benefit not typically found in digital, let alone point and shoot cameras, is its wide dynamic range.  Digital sensors have had a difficult time dealing with high contrast scenes, and losing detail in the shadows and highlights.  The EXR sensor does a tremendous job of handling these situations with ease.  I keep my details in the shadows without totally blowing out my highlights.  Is the camera going to replace my D300...of course not, but it's absolutely my camera of choice for my everyday needs and will always be with me to capture lifes moments...especially with a newborn on the way!  I'm not even worried about when the baby really gets moving either because between the high sensitivity, and the 5fps burst rate...I'll catch all the action.", "Date": "March 11, 2009"}, {"Title": "Wonderful little digital with great features", "Author": "Burgmicester", "ReviewID": "R1WGN4IN6CAZ0G", "Overall": "4.0", "Content": "The FujiFilm EXR200 has a ton of features and takes pictures with great ease.  However, this is not your typical point and click camera.  I have read some of the more expertise driven reviews and those more technical reviews were terrific in helping me to understand this camera before using it.  This is particularly important with the EXR feature.  As this camera has an almost unlimited ISO setting, it is important to put some limits on that.  Otherwise, it does take pictures at very high ISO settings in an effort to maximize the resolution even though it might increase the graininess at the same time.So I took the advice of the experts and re-set the ISO on 800 as a limit.  That was very helpful as the pictures that were taken were not grainy at all.  The camera has a terrific feature for those that were SLR photo-takers in the past.  It shows all of the settings with the picture and saves them; I love this feature.  Back to the ISO:  It did take a while to figure out how to find and set that ISO feature.  I'm still a little fuzzy on the screen walk-though to get to various settings and when they are applied.  The instructions could be a little easier and that is the mark off giving this a \"5\" rating.I took the camera on vacation with me and clicked away.  I was mostly in the Auto mode (staying away from the EXR mode because of all of the discussion around it).  I also used the double taking portrait mode (the camera will take two pictures within a second - one with flash and one without - if I understand this correctly).  This feature is quite nice by the way.  I also used the landscape mode quite a bit also.The pictures are stunning.  And since they are in full HD, they can be played back on a HDTV.  We did this with relative ease - except that initially we did not realize that the 4:3 sizing was not automatic and had to be set at the TV level to get the proper sizing.  But with a 52\" screen, the pictures are spectacular.Recently my daughter was in a dance recital and I decided to try out the full auto EXR mode.  So I reset the ISO to unlimited and began to snap pictures of her dancing in the minimal stage lighting from a distance of 35 yards or so.  And to my surprise the results were very good.  Normally, I get a grainy photo in a blur and it is dark.  With the EXR,  the graininess was not too bad and the clarity was very good.  Yes there were blurs when the action was too fast, but many times I got a very good solid picture with excellent lighting.  Two additional settings were used on these pictures:  \"high iso and low noise\" and \"suppress flash\".One more feature observation:  the purely \"manual\" mode is not quite as nice as I'd like.  While it will allow you to set both the aperture and the speed, it does not allow an unlimited spread in those ranges.  So the results are not as easy to obtain as with an older SLR manual camera.That is the benefit of this camera and the downfall.  There are so many settings, that the photographer might need more experience than a typical \"point and click\" picture taker to get the most out of this camera.  But if you have any SLR background this is a terrific little camera.  Even if you are not too experienced, just setting the ISO to 800 and using the auto shoot will give you very good pictures.  But my sense with the price and features is that this is for someone with a little more experience than a typical point and shoot camera owner.", "Date": "April 20, 2009"}, {"Title": "An exceptional pocketable camera", "Author": "Dennis C. Smith", "ReviewID": "R2I8PFUXK0HH2J", "Overall": "4.0", "Content": "Why consider an expensive higher performance camera?A few years ago I was enjoying a gourmet dinner served aboard Napa Valley's popular Wine Train. It was off-season so it was dark outside when our entreés arrived.  The presentation was beautiful so I decided to photograph it.  I removed my trusty Canon subcompact and proceeded to take pictures.  The cabin lights were low but adequate, I thought, to avoid the bothersome shadows that using the flash would cause.  Even though the Canon had yielded many great photos in daylight, it soon became apparent it was completely inadequate for this task, and without a wide angle lens,I had to stand away from the table to capture the complete place setting.  On auto settings, the exposure took so long that I could not avoid blur.  The less blurry pictures I did obtain had no definition in the shadow areas, and the pictures had a yellow cast rendering the food colors unattractive.  I wondered if this were the nature of all subcompacts--that they were all just bright daylight cameras only.A common set of preferencesCameras have advanced since then.  Image stabilization, more megapixels and wide angle and longer zoom ranges abound.  Later I had purchased one of the first subcompact wide angle cameras, a Panasonic FX-01, and then replaced it with a similar FX-07 after it broke. Both achieved good pictures in broad daylight, and the wide angle soon became a feature I could not live without.  But there was some noise in the darker areas of a picture, and in low light situations, even with the long exposures made possible by the excellent image stabilization, the noise (which gives smooth objects a disturbing speckled or smeared appearance) was too much to bear in a page size print.  Even with only 6 and 7 megapixels respectively, I never thought my pictures from these cameras lacked sharpness.  When my second Panasonic became flaky after much hard use,  I went on a search for a pocketable camera that could produce great images not only in bright daylight, but also in such challenging situations.  I also sought a camera that would produce good results automatically, without forcing me make numerous adjustments or require postprocessing on a computer.The search for the bestWhat follows is a description of how I conducted a search and how I discovered some common misleading misconceptions.  If you just want to know how well I thought the camera worked, skip down to the \"Early Impressions\" paragraph.I started my review with Consumers Reports because I am a member.  There was little information about camera performance in non-ideal situations.  There were coarse ratings for dynamic range, a capability that would improve photos in high contrast situations, but no sample photographs to explain such a benefit.I then went to the website of Digital Photography Review.  Complete specifications were listed for every make and model camera, but only a few were reviewed.  The reviews, though few, are astoundingly complete with side-by-side photographic tests of competing models and sample galleries downloadable at the pixel-for-pixel level to your computer. I read at least two dozen reviews (average length: 18 pages not including sample galleries) to find out what the editors considered important.  In the process I learned that camera design involves trade-offs.  Camera designers have to choose which areas of importance to emphasize.The megapixel trapOne of the most interesting illustrations of this was in a Panasonic press release which introduced a new upscale compact camera, the DMC-LX3.  The release went to great lengths to emphasize that the pixel count was deliberately kept lower so that each pixel would have higher quality resulting in an overall better picture. Yes, they were saying that excessive pixels results in a lower quality picture even though it makes the camera's specifications look better which can lure unsophisticated buyers. Even more interesting, in the DPR website's review they compared the LX3 with10 megapixels to the Canon G10 with 14.7 megapixels and the Nikon P6000 with 13.5 megapixels.  In bright conditions the higher megapixel cameras excelled slightly in fine detail (differences barely visible in a poster sized print).  But as light levels dropped the LX3 held it's quality, and in low light situations the Panasonic pictures were usable while the others were not.  All 3 cameras had approximately the same size sensors.  Even though the Panasonic's  lens captured up to twice the light of the others', it's hard to believe that was enough to make such a difference.  So in this case, it seems like fewer (but larger) megapixels did produce the best overall results.Interestingly Consumers Reports rated image quality higher for the G10 while the Digital Photography Review editors rated the image quality higher for the LX3--and provided samples to show it.  ApparentlyConsumers does not take low light performance into consideration.I agonized long and hard about purchasing a LX3 because i could use the battery packs from my older Panasonics.  But even though the LX3 is among the very smallest compacts, its 1.5 inch thickness (manufacturer published specifications erroneously publish the thickness as 1.06\") make it just too big to make it a comfortable fit for my jeans pockets.My missionSo my mission was, as yours may also be, to find a subcompact that could yield great pictures not just in bright daylight, but also in less ideal conditions.  In other words, an \"all occasions\" camera. And I wanted a wide angle lens because of its great convenience.  Would I find such a camera?  Would it just edge out the runners up or would it be a run away winner?How specifications and sample photos can point to a winnerTo find the best low light prospect I looked for 3 things in the specifications.  Larger sensor size and a faster lens both allow for greater light capture.  Third, I looked for a sensor technology with the most sensitivity and pixel uniformity so that light amplification would produce less noise.  The first two of these criteria can usually be determined by looking at published specifications.The great majority of subcompact (easily pocketable) cameras use tiny sensors that collect light over an area of only 1/4 of a square centimeter.  Even the next larger category, compacts, use mostly these small sensors, but a few use larger sensors closer to 1/2 of a square centimeter, and these usually offer better low light performance.  Larger cameras with interchangeable lenses offer sensors from about 3 to 6 square centimeters usually with proportionally improved low light performance.  Specifications  sheets use a strange description for sensor size.  Because the common fractions of 1/4, 1/3, 1/2, 2/3 etc. in  inches are not precise enough to describe sensor width, a decimal is often used in the denominator.  For example: 1/2.5 or 1/1.6.  If you divide these out you get 0.4 and 0.625 inches.  Bigger is better because it captures more light.So called \"fast\" lenses are simply larger and can collect more light.  They are called \"fast\" because they allow a faster shutter speed for a given exposure.  Common lens speeds are 1.4, 2.0,2.8,4.0, 5.6, 8.0, 11, and 16, with each lower number requiring only half the open shutter time of the next highest of these numbers.  You will see some numbers in between and zoom lenses will have two lens speeds: one for fully zoomed in and one for fully zoomed out.  Zoom lenses get slower the more they zoom out and low light performance gets correspondingly worse.  A long, slow zoom combined with a small sensor can produce low quality pictures even in bright light, as I found out when I tried a Panasonic TZ3 long zoom compact.  Yet many such cameras are popular.So in specifications, I looked for larger sensors and faster lenses.As for different sensor technologies I found only four.  The best by far is a sensor made by Foveon which layers the red, green, and blue pixels on top of each other.  In other sensors pixels are side by side and are only red, green, or blue sensitive, so the camera's processor extrapolates to get a color and brightness for each pixel.  This processing involves a certain amount of error which accounts for a lot of the noise, and when you see the output of a Foveon next to the others, its superiority is striking.  But no subcompact offers a Foveon processor.  Only one compact does and it costs $800 and is so featureless it offers only a fixed lens.  Maybe someday.....The two most popular sensor types are CCD and CMOS.  Each has its pros and cons, but CMOS are not produced in small enough sizes to be offered in subcompacts as far as I know.The fourth sensor type is Fujifilm's proprietary modified CCD called a SuperCCD.  I can't tell you about the engineering difference, but great claims are made for its low light performance.The results from specifications survey:Among subcompact cameras, hardly any offer other than the smallish 1/2.5 to 1/2.3 size sensors.  The only ones I could find with wide angle lenses were from Fujifilm at 1/1.6 representing almost twice the surface area of the others' sensors.  This was interesting because Fuji also claimed superior technology so it should have two advantages: technology and size.As for lenses, the fastest I could find on a subcompact was f2.8.  The only slightly larger Panasonic LX3 had an amazing f2.0 lens--if only it were thin enough!Looking for wide angle, image stabilized, larger sensor size subcompact cameras I found only two, both from Fujifilm: the f100fd and the f200EXR.  Both had lens speeds of f3.3, about 50% slower than the fastest in the group.  The sensor was more than proportionately larger, so the Fujis looked promising for best overall.  So I looked for reviews to see the differences.Reviews from othersI checked CNET (Asia) and Digital Photography Review web sites for both cameras.  The f200EXR is too new for anyone to have completed a review as of this writing, but I did find first impressions on CNET and a gallery of samples on DPR who is apparently preparing a review.  The older Fuji f100fd was reviewed favorably on CNET and was the winner in a comparison test on DPR, but that wasn't a full review. The main advantages of the more expensive f200EXR seem to be a larger 3\" monitor (vs. 2.7\"), more manual control, and 2 new sensor modes that let you trade off resolution for either wider dynamic range or lower noise.  I found a heavily discounted low price for the f100fd of $225 but the f200EXR is only available at full list of $400, at least till supply catches up with demand.  Since I've seen the Panasonic LX3 below $350 I anguished over its just-barely-too-large size.  I saw no claims for superior per pixel sensor performance for the f200EXR over the f100d--only that the trade off modes would offer better results in some situations.  On DPR's gallery, the f200EXR's low noise shots looked really impressive. Some shots were duplicated in two modes for comparison, and you could see, for example, that you could choose a slight loss of fine detail (6 megapixel picture) to gain shadow detail that was blacked out at the high resolution (12 megapixel) setting.  One particular shot (looking up the trunk of a defoliated birch tree in late afternoon light) was not one where forced flash could have filled in the dark areas.Since I had previously owned the original Canon Digital Rebel SLR, I knew that its 6 megapixels offered plenty of resolution for page size prints--as long as the pixels were good ones.  So I decided on the f200EXR.Early impressions of the f200EXRFirst the bad news:If you've been spoiled by previously owning a Canon or even a Panasonic, you're going to feel Fuji's product presentation is rather crude.  There's no compact pocket size manual you can carry around for reference--only an insultingly simple \"basic\" manual that might get you to taking the first picture.  Then you have a CD with a pdf file for the complete manual.  And boy, is it confusing.  Part of the reason is that Fuji didn't really work out a user friendly menu system.  While the manual warns \"not all options may be available in all modes\" that's not enough to prepare you for never seeing the menu choices you expect.  Menus are different for shooting and playback, and you have two different buttons which will access different menus most of the time.  There seems no logic as to which functions are put into which menus.  Eventually you can learn it, but what a pain. Finally, to put icing on the cake, some settings (flash is one) reset if you go back and forth to play and shooting modes--but not all.As for manual controls, they are limited.  There's no manual focus, and I've found that in some modes the auto focus malfunctions--especially in night shots.  Control over aperture lets you choose only from the two available extremes at each focal length.  And often you can't use settings in certain desirable combinations, such as using the sensors' special dynamic range and low noise options in combination with aperture control.The access door for the AV/USB port is attached by two delicate rubber standoffs rather than being hinged securely as most competitors' models do.While the monitor is a generous 3\" its resolution is no better than before. 230,000 pixels is OK but that's half that of some same size monitors (LX3).  Also, when you want to check your shot for sharpness, you'll find you can't zoom in far enough. You can zoom in to look at 1/64 of the full shot, whereas my old Panasonic zooms in to 1/256.Movie mode is an afterthought.  There's 640x480 or 320x240 capture.  No widescreen capture format and no HD capture, even though the camera has component HD output (via a pricey optional cable) for still photos.The battery is smallish, only 1000 mah.  My smaller and older Panasonic's battery is 15% larger. You'll use it up fast fiddling with all the menus.  Spare batteries are precious, about $40, but I ordered some Kodak spec batteries that are supposed to be compatible on Overstock.com for 1/3 the price.The image stabilization seems noticeably less effective than my old Panasonic. To be fair, the Fuji has much greater zoom (5x) which really challenges the IS.  I briefly owned a TZ series Panasonic with 10x zoom, and even Panasonic's superb stabilization wasn't enough to make the long end of the zoom reliable.And finally, those tenths of inches add up.  Its large for a subcompact, and about as large as it can be and still  fit easily into your jeans pocket.The bottom line is that this is really a point and shoot camera, and enthusiasts will be frustrated trying to exercise manual control.Now the good news.Image quality.  The f200EXR's probable top competitor is currently the Canon SD880is, matching the Fuji with a wide angle lens and trouncing it with greater compactness, style, and ease of use.  And it can pretty much match the Fuji in bright light when you look at DPR's photo tests and sample galleries.  It boasts the some of the best image processing algorithms in the industry to control noise.But when you look at the darker parts of a picture, the Fuji produces great color saturation and amazing smoothness.  I'm not sure my old Digital Rebel did any better.  In low light there is still some noise, as there would be in any camera, but for a subcompact the smoothness and saturation is amazing.And the Fuji is pretty smart about automatically making choices that consistently yield a great picture.  Put it in EXR automatic mode and it trades off resolution for less noise or more dynamic range only when it needs to in low light or high contrast situations.  The 12 megapixel settings have enough resolution that you can count the links in a chain link fence a quarter of a mile away.  The 6 megapixel low noise setting has astoundingly low chroma noise in dark parts of the picture.  The 5x zoom outdoes almost all subcompact competitors.In direct comparison to my old 7 megapixel Panasonic, which is not a bad camera (can you say Samsung?) the differences were dramatic.So does this camera seem to be a runaway winner in the subcompact class?  For image quality, quite probably.  Would it have given me a perfect picture on the Wine Train?  I doubt it -- it's a subcompact!  But it probably would have given me a picture good enough to keep.I still wonder about the sexy LX3 with its fantastic fast lens and large sensor (which should enable it to use a lower ISO than the f200EXR in any given situation), and all its great manual control features.  I've read that you can get really good results if you transfer the RAW files to your computer and process them in an imaging program like  Photoshop.  Been there, done that (with the Rebel), and I've found the more work it is to take a picture the fewer you take.Long after the f200EXR has bitten the dust I won't remember about the fiddly controls, but I will still have gorgeous pictures to excite my memories.  Lots of them.", "Date": "March 8, 2009"}, {"Title": "F200EXR is the right camera for me", "Author": "D'Backs '98", "ReviewID": "RMHCIS6H2STR1", "Overall": "5.0", "Content": "I bought my F200EXR the other day and I love it!  I am replacing my F10.  I bought my F10 a few months before the F30 came out so I knd of missed the boat last time.  I have friends who own the F30 and were always bragging about the low light capabilities.  I shot the F200 downtown at different ISO's as well as on EXR Auto.  The noise is considerably lower than my F10.  I am very excited about the amount of detail in my photos even at 800 - 3200 ISO.  My 8x10 prints look great.  EXR mode does a good job but I usually like to adjust the ISO myself according to the situation.I love the 5x wide angle lens.  I travel quite a bit and this camera is the type of camera that I have been looking for.  It allows me to be prepared for any situation that I might encounter.  I highly recommend it!", "Date": "March 20, 2009"}, {"Title": "EXCEPTIONAL 'POINT & SHOOT' CAMERA - NOT SO EXCEPTIONAL LIFE SPAN", "Author": "B. Colonna", "ReviewID": "R2EMY3R3TLY5I6", "Overall": "3.0", "Content": "UPDATED March 2013: This camera served me well for just shy of four years.  For no reason the other day, the LCD screen failed.  The display is all \"broken up\" which basically makes the camera useless.  The camera has not been dropped, hit into anything or exposed to extreme weather.  While it worked I was very happy with the camera, but I would have expected it to last longer.  While it is about 3 years, 11 months old, it was used sparingly, for family birthday parties, the occasional local trip, and children's sporting events.  I had previously rated this item a 5 but based on this am lowering the rating to \"just average.\"ORIGINAL REVIEW, April 2009:If you are looking for one digital camera that has virtually every feature you would need or want for typical \"point and shoot' photography, the Fujifilm FinePix F200EXR is that camera.  The camera is well designed, full of features, yet very compact.What's in the box?* 12 megapixel F200EXR camera.* Li-Ion Battery* Battery charger* Camera cable with USB or RCA connectivity* Wrist strap* Basic instruction manual (three manuals, English, Spanish and French)* FinePix Owner manual - on CD* FinePix Viewer software - on CD.While the camera does not ship with a SD card, typically you will find offers when buying digital cameras for free cards with the purchase of cameras.The cameras basics include a 5x optical zoom, which is equivalent to a 28mm - 140mm focal  length.  There are point and shoots with longer focal lengths (the Panasonic TZ-5 is 280mm), but the F200EXR still has a decent optical zoom  Unlike some of its competitors, the F200EXR gets its image stabilization from a sensor not the lens.At 12 megapixel, this camera has more than enough resolution to satisfy most consumers.  It has a great range of speed/sensitivity, being capable of ISO from 100 all the way up to 3200, as well as 6400 ISO when shooting at 6 MP, and 12800 at 3 MP.  The camera sets itself between 400 and 3200 ISO in auto mode (400, 800, 1600, or 3200).  In other manual modes, you can select 100, 200, 400, 800, 1600, 3200, 6400, and 12800).As with any camera, I would advise that you set the auto mode for the  lowest ISO to get the most noise-free photos, and then move to higher ISO setting when warranted (sports or activities where you are trying to photograph moving objects).This camera sports a good size CCD sensor.  The F200EXR's CCD is 1/1.6\".  In comparison, Panasonic's TZ-5 has a CCD of 2.33.  That's a CCD almost 45% larger than the Panasonic, which is a nice camera in its own right.  For those of you who don't delve that far into digital photography, here's a key point to keep in mind when choosing still or video equipment......in general, the bigger the sensor (the CCD) the better quality (less noise) you can anticipate in your photos.  Don't obsess about CCD size - Naturally, lens quality, processor, and design all play a part, but all other things being equal, a good size sensor will help generate less noisy shots.What is a CCD?  Let me back up a step - In the old days, taking photographs was a chemical process - film, development chemicals, and mechanical camera parts. In today's digital age, most of this happens electronically, outside of maybe some mechanical camera components.  Simply put, a CCD  is a \"charge coupled device\".  It converts light into electrons.  The information is transported across the CCD and converted from analog to digital.  This turns each pixel into a digital value.  So why does it matter if the CCD is bigger?  The bigger the sensor, the less `noise\", therefore you capture more minute detail.This camera is not the least expensive in its class.  It is, however, in my opinion, one of the best.  The face detection on this camera works very well, appearing to recognize the correct number of faces in a photo and not usually getting fooled.The 3\" LCD display is very bright and easy to view. Although like any camera, when you are in direct, very bright sunlight is becomes hard to see the viewfinder.The flash is superb.  It provides very good exposures, lighting the subject and backdrops nicely.  Flash photos from the F200EXR produce very true to life colors, even contrast and natural results.  I am yet to have any photos that appear washed out, \"over exposed\" or \"under exposed\".  Even when used in macro mode, this flash is fantastic.  Typically I disable a camera flash in macro mode and depend on natural or other artificial lighting.  But this flash allows for a close-up focus with the flash enabled.In normal modes, you can focus on subjects as close as 1.5 feet.  The camera's macro mode will allow you to focus as close as 1.9 inches.My lone complaint about the camera is that it does not truly have a \"fully manual\" mode.  The manual mode is good and you change change shutter, aperature, and ISO.  The aperture range is F3.3 to 9.0 but you are not able to randomly select any F stop and shutter speed, as you are limited to only the F stops the camera makes available for a particular ISO  or shutter setting.  This is just a minor issue; the camera produces great photos at any setting - I just like to be able to make manual settings as I choose.I found the F200EXR delivered great photos in all three modes: High Resolution, High Sensitivity and Low Noise, and Wide Dynamic Range.  High Resolution is just what it says - 12 million pixels and a lot of detail.  I took some early evening photos of a lacrosse game using Pixel Fusion (High Sensitivity & Low Noise) mode.  There was some slight noise, but considering the conditions, these action photos were very clear and crisp.  These photos were slightly more vivid than those shot using other modes.The EXR mode worked well for me.  When in this mode, the camera recognized the subject matter (faces/portraits, sports/high speed subjects such as a lacrosse game, and some nighttime portraits) and made appropriate adjustments and delivered superb results.Overall, this is not an inexpensive camera for its features, but I believe you get what you pay for.  That's the case with the F200EXR.  This is a very, very good product; it  has exceptional face recognition and produces very natural result for portraits, especially under flash conditions.  If most of your photo subjects are family, other people, etc. then I would highly recommend this camera.", "Date": "April 19, 2009"}, {"Title": "Great P&S;, but not quite the greatest", "Author": "Robert Holland \"quiltchannel.com\"", "ReviewID": "RPAU1T6SP51LE", "Overall": "3.0", "Content": "I have an unaccountable attraction to small point and shoot cameras, even though I have pretensions to being more than a casual photographer. And when I do get my hands on a point and shoot, I want to test its limits. The limits of these cameras are generally poorer performance across the board compared with their big brother digital SLRs, but their attraction is of course their simplicity and small size. If made right, they should be the ideal street camera.I recently acquired what is considered to be the best point and shoot available, the Panasonic LX-3, and I haven't been disappointed with it. It's super-fast lens and ability to shoot raw images make it hard to beat in this category. However it's not really a pocket camera, so the convenience factor is compromised. You really need to hang it around your neck.The Fuji F200 EXR is truly a pocket camera, and so I find myself carrying it to more places. Its automatic lens cap nicely protects it without my having to worry about it, and it has a plethora of features. Some have complained that it is not very intuitive, and that the various automatic settings don't always result in the best possible images. I have found this to be true especially in interior shots without flash, notably these cameras' weakest area. The camera either pushes the ISO to a noisy 1600 level, or if I prevent this, the shots are often blurry. Moreover the color, especially in mixed light, can get a little wonky.I have been spending a good deal of time with the EXR features, and agree with other reviewers that the total automatic setting under EXR is to be avoided. The camera just isn't that smart. However, if you give it a little help, and experiment with some of the specific EXR settings, most notably those designed to reduce noise, you can get some pretty good results, even at 1600. The 5X zoom is robust enough to pull in quite a bit, and the close-up macro capability is impressive. You can focus down to a couple of inches.The non-HD video capability is only average -- good for those times when you don't have a better video camera with you, mostly for casual use.This is a good $229 camera priced at $369. It needs at least one more generation before it's the camera it could be.", "Date": "April 20, 2009"}, {"Title": "Very good..but over hyped!", "Author": "Radio Man \"yarns13\"", "ReviewID": "RY5WSK6EM3CG3", "Overall": "4.0", "Content": "First, let me say I am not a professional photographer..but I do buy A LOT of cameras, and photography is my hobby. Sad to say for my wallet I have owned almost every top rated small point and shoot camera that has come out in the last 2 years. One camera I also had was the famous Fuji F30fd camera. I just HAD to have it because of it's superior low noise at high iso etc. Now..to the Fuji F200EXR. I bought mine from Japan as the price is about the same as USA and I could not wait for the release here. I have only had this Fuji about 5 days but so far these are my impressions about the camera.I had a Fuji F100fd too, The F200 IS clearly better in terms of low noise than the F100fd. But vs the F30fd I am sorry to say at best, the F200exr is as good maybe, Or maybe not quite as good as the F30 re:low light. Overall though the F200exr is a MUCH more well rounded camera than the F30 was. I have noticed that the F200exr seems to use less noise reduction than the F30 did..so maybe it's why on first impression the 200exr may not be QUITE as low noise as the F30/31. Actually I do see more detail at high iso from the 200exr vs the older Fujis. However the EXACT same shots..same light, same iso..The F30 if anything, shows LESS noise than the F200EXR (again MAYBE more noise reduction though..less detail than the 200EXR). However if even noise is equal..the F200EXR has a much better lens (Almost zero purple fringing OUTDOORS compared to the nightmare of the limited F30) It's 28mm..vs the 35mm.it's image stabilized..uses sd cards..has GREAT auto white balance.The intelligent flash really works GREAT. Unlike most cameras I have used I don't see that Canon Wash out with the 200exr.Flash shots overall look VERY good..almost like no flash was used. The image stabilization works but not nearly as well as Canon or Panasonic's image stabilization.On BALANCE I have to rate this F200EXR about the best overall small point and shoot I have ever used..including my use of the Canon SD990 that I recently sold. Also I own an LX3...I would say maybe the noise at 400iso and above is about same with the LX3...the F200EXR blows away the LX3 at iso 1600 (Much less color,chroma noise, more detail)...1600 on this Fuji is actually VERY good and mostly usable vs about every other camera I have ever used.The long story short I feel this F200EXR is a great little camera BUT I think all the hype about the sensor seems a bit over rated. Maybe in terms of how Fuji made this sensor..pixel binning..whatever it's called..it's all great on PAPER but in the real world..why is this camera NOT much better or barely better or as good? re; low light than a 4-5 year old F30fd at same 6 megapixel resolution?  Also the amazing EXR dynamic range mode?..I don't feel it's any better than taking the same shot using a flash for shadow fill in. To sum up again I am not a pro photographer but my eyes tell me though this cam is VERY good..\"it's not a world apart from other hyped low noise cameras\" BUT it may be actually the Best(low light)point and shoot by a small margin... I DO like the camera very much...but when the dust settles I don't feel this camera is going to be the next F30/F31 \"legend\"..but it IS a much better camera OVERALL. MUCH better on overall balance, but NOT, a low light stand out particularly, as there is still some noise easy to see 400 iso and above...But this Fuji is a REALLY really good camera... perhaps a GREAT camera, if you take this camera as a whole..not as just the low light winner!", "Date": "March 7, 2009"}, {"Title": "Probably 4.5 Stars", "Author": "Kailua Steve", "ReviewID": "R1PLDS3044SWZI", "Overall": "5.0", "Content": "I purchased this camera after reading Landale's excellent review and his patient assistance to the people who were disappointed in this as a point and shoot camera. I was also influenced by the reviewer who liked its low-light capability. It is interesting technology and the camera can take very nice images, but it takes some experience and effort (which is fine by me). I've used this camera for a couple weeks and a few hundred images so I will share my second-impressions. I've yet to see a great difference in its low-light capability from other $400 cameras. It's o.k., but not spectacular. I have not yet done any A/B tests so I may be mistaken. I /am/ impressed with its dynamic range (see Landale's \"how to\"), its macro capability, and its lens -- no obvious barrel distortion like common with cheaper cameras. I have not experienced the noise issues others have. As long as one limits the ISO to 400 where practical, I've had good images in both P and Auto EXR modes. The body has a nice, quality feel.I have accidentally turned it on while hiking and the barrel tries to stick out and the camera gets unhappy so I may have to buy the OEM case for it. That case doesn't enclose the camera but it does have a firm surface above the power switch to prevent it from accidentally being turned on.Initially I would have rated this camera at 3 to 4 stars (for the price), but I've grown to like this camera more as I use it more. I'd rate it at 4.5 stars but I rated it as 5 to counter the few \"I just unboxed this camera today and don't like it\" reviews here.I uploaded an image today in which the original shows great dynamic range and detail for a 6 MP image. After it is reduced for uploading it may have been compromised. UPDATE: Just added an ISO 1600 image today.", "Date": "April 30, 2009"}, {"Title": "Produces vivid images", "Author": "Quoad Toad", "ReviewID": "R2R0SUZQKNO9T3", "Overall": "5.0", "Content": "I love small cameras and I have bought many since 2000.  My first digital camera was a Fuji, so I have an affinity for the brand.The Fuji FinePix F200EXR exceeds my expectations for a small camera.  Once the original settings are tweaked, this camera produces excellent pictures.Out of the box, the camera leans towards the very high end of the ISO range.  Before changing any settings, the first picture I took was taken at ISO 800.  Pictures taken using a high ISO tend to be very grainy.  I prefer to use as low an ISO as possible.  The lowest ISO of the F200EXR is 100.  I would have preferred the lowest ISO to be 64, but 100 still produces nice pictures.  When taking pictures using any small camera, I never set the ISO over 200.After changing the settings, the pictures looked beautiful.  First, I put the camera in \"p\" mode and changed the ISO to default to 100.  Then, I changed the color mode from neutral to vivid.  The colors of the images were striking once in vivid mode using ISO 100.This camera is great with greens, blues, reds, and purples.  The color is vibrant.  Keep in mind that when zooming in 100% or more, there is noticeable fringing.  This is typical of small cameras and I have noticed similar effects with my Olympus 770SW and Ricoh R6.The F200EXR has a couple of features none of my other small cameras has.  The first is a mode that takes one picture using natural light, followed by another picture with a flash.  The second is a mode that allows the user to take pictures continuously by holding down the shutter button.In terms of size, this camera is slightly bigger than the Ricoh R6.  It's slightly smaller than the Olympus 770SW and the Canon SD850IS.  The Fuji is a heavy camera and weighs about as much at the Olympus (which is encased in metal).  Further, the Fuji screen is significantly larger and prettier than any of my other small cameras and I have uploaded a picture for a size comparison purposes.My one complaint about the Fuji is that I wish it had a higher zoom.  5x optical zoom is good, but not great for a camera in this price range.  However, few camera manufacturers make tiny cameras with higher optical zoom.  Canon offers the SX110IS, but despite Canon marketing it as a tiny camera, it is significantly larger than the Fuji.Overall, the Fuji is a great camera that takes nice pictures.  It can easily fit in a purse or a shirt pocket.  It feels sturdy and well built.  Although, I wish it had higher optical zoom, I am very happy with this camera.  Out of the box, the images are grainy, however, I highly recommend to change the default ISO settings.  It will make a huge difference.", "Date": "April 8, 2009"}, {"Title": "Disappointed", "Author": "A. Feng \"Alex\"", "ReviewID": "R1PEV8MYOXKCED", "Overall": "2.0", "Content": "I don't want to dissuade anybody from purchasing this product. I gave it two stars not because it was bad, but because it did not perform as well as i hoped. One of several beefs i had with it was1) Inability to zoom in and out during videos2) Lag time (about 2 seconds) between flash photos (doesn't happen all the time, but it does so more often than not)3) Unless you have face recognition mode or KNOW for sure you're focused on someone's face it'll focus on some other object like a fence post, and the picture will end up blurry even in well lit conditions4) Great landscape photos (still life), seriously, best for a point and shoot I've seen, but I don't do landscapes, so unless you love backdrops this probably is not what you are looking for when your taking pictures of things that move5) Photos taken from my 8.0 Megapixel Canon SD 870IS come out clearer (ie less grainy) than this 12.0 megapixel Fujifilm one even though the Fujifilm one can take pictures in darker conditions6) flash is right underneath the shutter button so your finger sometimes gets in the way7) Might want to carry an extra battery on you, because it dies relatively faster than most (about 300 picture for me don't know how that translates into video time)8) Lots of zoom capability but you sacrifice clarity when you utilize it9) All in all, my canon powershot sd870is performs just as well or better than my Fujifilm FinePix F200EXR 12MP except in dark conditions since it has a higher ISO (check out pictures people took online), but that's about it.", "Date": "October 13, 2009"}, {"Title": "Agonizing Choice", "Author": "Royal", "ReviewID": "R2NB688Z82MJY7", "Overall": "4.0", "Content": "I think I read and agonized over every review of this camera ever written anywhere before choosing. It has some warts: It is not attractive. It has no HD movie capability and you cannot zoom while filming. It has no optical viewfinder but the LCD screen actually does work outside in bright sunshine. It does have a fully automatic feature so one can use it as a simple point and shoot if you have family members who don't like reading directions. But, the stellar feature of this camera is the new CCD technology that allows one to get some outstanding pictures under difficult conditions. To get the full benefit from that technology requires a little bit of study and some basic knowledge of photography. Reading the other reviews on this site will give you valuable information about optimal  use of this camera which is not available in the owner's manual. Negotiating the software is easy after the first few minutes. I have had no problem with the image stabilization. I recommend the Lowepro Rezo 30 case instead of the 20 for ease in getting the camera in and out in a hurry.If it is the art of still photography that drives you,  this is the pocket camera to get IMHO!", "Date": "June 25, 2009"}, {"Title": "A Snappy Little Camera", "Author": "Tamara Thorne", "ReviewID": "RID8WSYYFRC98", "Overall": "5.0", "Content": "I've been putting this camera to the test for a couple of months, and the more I use it, the more I love it.  It's intuitive, fast, and the automatic setting will make the photographer look more talented than she or he is.Before I go on -- I wish I could give it 4 1/2 stars.  It's too fine to be a four, but there's one thing that drives me crazy on small cameras: the lack of a viewfinder.After age 30 or 40 most people begin experiencing near-sightedness and unless you wear bifocals to truly see what you're looking at on a camera screen, you have to whip out the reading glasses.  This is a huge time-waster and general pain in the rear. With a viewfinder, you simply have it set to match your vision. No muss, no fuss.But, the Fuji has such a large screen that it's usable without reading glasses. Granted, I prefer to see it more clearly, particularly with closeups, but this little guy is very good at taking care of me, with or without.I've always gone for mid-size cameras because I use massive zoom frequently. The Fuji has 5X zoom, beating most other subcompacts by 2 degrees, but that's still less than half of what I'm used to.So, following the suggestion of one of the early reviewers here (he explains tech very well), I set the camera to 6MP to make room, most of the time, but I've found that if I want a long-distance shot, if I change it back to 12MP, I can take such an insanely high quality photo that I still get the bi-plane or soaring hawk. I simply crop it.I'm amazed at the length of time between battery charges, at the ease of use, and at how hard it is to ruin a photo.  I highly recommend this puppy!", "Date": "May 21, 2009"}, {"Title": "solid camera with a few caveats", "Author": "montego", "ReviewID": "R1UOAE1R36QBFP", "Overall": "3.0", "Content": "I got this camera because it was touted as a great point and shoot camera for low light situations. Although it is a solid camera that can take good pictures, I don't really agree with this description. As previous reviews have mentioned, the camera chooses crazy ISO values when set to the auto exr mode and to some extent to all of the exr modes. The high ISO values may convey some benefit that I'm not aware of but the end result is really grainy, noisy pictures that in my opinion can't really be used. I'm not a really knowledgeable photographer but even I know that there is no need for ISO 1600 for an indoor shot using the flash, which is what the auto exr mode usually does. Any ISO greater than about 400 starts to look too noisy for good results on this camera in my opinion.That said, if you take the time to adjust the settings so that the ISO is limited and put some thought into the camera settings used you can get fine pictures. However, having to do that with each shot defies the purpose of having a \"point and shoot\" camera. I'm keeping this camera after some fiddling with the settings but I have to say I am a bit disappointed in the much touted Auto EXR low light benefits...", "Date": "January 3, 2010"}, {"Title": "To The Point", "Author": "Phil", "ReviewID": "R2NCWUFEXU5A1Q", "Overall": "5.0", "Content": "Bought this camera as a Christmas Present for my Daughter-In-Law, and having read so many conflicting reviews I decided to try it out.  As most have stated, the EXR Auto Mode is useless, battery life is quite short and the camera's menu settings are user unfriendly.  If you can live with these inconveniencies you will love the quality of the photographs. For those who want a simple point and shoot, just set the EXR mode to HR, the max Auto ISO to 400 and the camera will outperform any Point & Shoot out there.  If you learn to take advantage of all the features, there isn't anything around at this price that will match its capabilities or performance. I haven't heard the click and clack noises that other people referred too, nor see any problems with the battery compartment accidently opening. I have a Canon DSLR and my wife has a Canon SD950 IS and the F200EXR out performs the SD950 in all areas.  At this website [...] you can go to, \"Compare Sample Images\" under \"Digital Cameras\" and compare test images of different cameras side by side. After you select the pictures you want to compare, click on the images to enlarge them. This is good way to check out some of the claims; my old XXXXX camera was better", "Date": "December 22, 2009"}, {"Title": "Real innovation from Fuji - consider the F200EXR if it matches your needs", "Author": "Snap, Crackle and Pop", "ReviewID": "R1OFEQXJDH7AR7", "Overall": "4.0", "Content": "THE QUICK TAKE:  The talk about the \"Super CCD\" sensor is more than hype, Fuji has achieved a real innovation and it is generally very well executed.  But Fuji can only bend the laws of physics, not break them - so keep your expectations about what this camera can do realistic.  If the real but limited benefits of the F200EXR sensor (lower light capability or extended dynamic range) are useful given the way you plan to use the camera, and you want a compact camera, the F200EXR is well worth considering.  (It may depend on the prices of what you're considering - price discounts on this camera have grown, making it a more attractive option.)  Fuji did many important things right when they designed this camera.  You should plan on spending some time with the camera and the manual.But Fuji can't do miracles (yet), so some people will find a better fit elsewhere - either a larger camera with a bigger lens and more control, a more standard point and shoot camera that you use carefully when needed, or something smaller.THE SUPER CCD SENSOR: INNOVATION, BUT NOT REVOLUTIONBefore the camera was released, there was discussion about whether the sensor could do what it claimed, whether the hype was real.  It's clear that the F200EXR does deliver - the sensor offers flexibility to trade down in pixels from 12MP to 6MP in order to expand the dynamic range or give more flexibility in low light.That is real innovation.  And, it's something that is well worth the tradeoff - 6MP is plenty of megapixels, and the resolution of a photo is rarely as important as exposure and  composition.Unfortunately, though, a 2x tradeoff in pixels gives you (of course) just twice as much light to work with - and the benefit of that is a lot smaller than most people realize.  Lots of people may have unrealistic expectations for the camera.And, you can get a lot more than 2x the light out of a bigger lens, or by keeping the camera still for a long exposure.  So the benefit is fairly modest, and some of the issues (see below) likely will more than outweigh the benefits for many people.STRONG FUNDAMENTALSFuji got some important things right with the camera:LENS FLEXIBILITY:  The 5x, 28-140 zoom (equivalent) offers a lot of flexibility for composing photos and making the most of your megapixels.SENSOR SIZE / PIXEL DENSITY:  The size of the sensor is a major factor in how well a camera performs.  To Fuji's credit, they used a credible size for this class of camera - 1/1.6\", or 7.78 x 5.83 mm, 0.45 cm².  The resulting pixel density of 25 MP/cm² (lower is better) is competitive for this class of camera (and with the EXR mode it's effectively half that density).LARGE SCREEN: The large 3 inch screen is useful and nice to use.More generally, the camera performs well on exposure, flash, and other important dimensions.  But then, at this price point the bar should be set high in my opinion - performing well on the fundamentals is just the ante to even be in the game.POTENTIAL ISSUESMany buyers may find that the issues outweigh the benefits for the F200EXR, for the way they take photos:LIMITED APERTURE CONTROL:  In many situations, especially shooting people, I'd rather have more aperture control than this camera gives - it's very limited - and I'd give up the incremental low light and dynamic range benefit to get that.ISO CHOICES ON AUTO:  The ISO and shutter choices the camera is programmed to make often don't make sense to me.  Perhaps it is programmed to have a strong bias toward getting a sharp photo, but they seem to have pushed the tradeoff too far.  (Though using an ISO higher than I would like is a common issue in cameras, perhaps to make them more foolproof.)BATTERY LIFE/POWER CONSUMPTION:  It's been years since I've owned a compact camera for which I had to think about more than charging the battery at night.  The battery on this has run out on me a couple times. The power consumption of its electronics must be much higher than average, let's hope future generations reduce the power consumption to stretch the battery life.EASE OF USE NEEDS IMPROVEMENT:  I expect the F200EXR to perform as a high end point and shoot camera when needed, especially now that we've been through about 20 generations of digicams and should have this refined by now.  Fuji does lots of things right, but given the state of the art now, the controls and menus fall short on ease of use. The face detection can be intrusive and slow.  I'm not confident I could hand it to a friend or family member (or stranger) and count on getting good results.  If I want something that only I can use (and in this case only after studying the manual and experiementing), I might carry a different camera.  And when I want just a point and shoot, I often grab my old Sony DSC-N1 instead of this camera.SIZE:  The size works fine for me, though it's at the upper limit of what I'd consider for a pocketable point and shoot at 3.8 W  x 2.3 H  x 0.9 D in. and over 6 oz without the battery.  And the features justify the size - it's still amazing what something this size can do.  But a lot of people who might want the low light benefits may think twice about the size.  That is, the people who might value low light shooting the most want something smaller.I haven't tested the video mode enough yet, but I do expect a camera in this price range to perform fairly well.  I want to be able to capture those unexpected moments with the camera that I have.  So if, as some say, it falls short there, that's another potential factor in one's decision.There's also some question about whether the image stabilization is as effective as it might be; if not, that's offsetting some of the benefit of the sensor.I've used the F200EXR a fair amount, but these are more impressions than my usual hyper-detailed analysis.  I'll come back and update later on if needed.FINAL THOUGHTS:  Fuji did lots of things right, and has done something important with the F200EXR sensor and the way it is integrated into the camera.  Future generations of this technology are very promising - and you may want to wait for them. Fuji would need to iron out some of the issues, and perhaps offer more of a benefit from the sensor technology, before I could unequivocally recommend this camera to a wide group of users.", "Date": "August 9, 2009"}, {"Title": "Best point-and-shoot for natural light conditions", "Author": "Shawn G. \"tgstk2\"", "ReviewID": "R32POTDZ2CULAB", "Overall": "5.0", "Content": "The Finepix F200-EXR is more or less like any other compact point-and-shoot camera except for one amazing feature -- the EXR mode. Using this mode, you can specify for the sensor to change how it generates an image to work optimally for three different conditions -- (1) High resolution and detail; (2) Low light/high ISO; (3) High contrast/dynamic range. Once you manually specify the conditions to optimize for, the camera automatically changes the way the sensor responds to best handle the situation. The EXR system really does work. One caveat however: there is an \"Auto\" EXR setting that is supposed to pick the best between the three different EXR settings for any given picture. Using this feature is not advised because (1) the camera makes tons of clicking noises while framing your picture and (2) the camera tends to go to super-high ISO (1600) way too quickly.", "Date": "August 1, 2009"}, {"Title": "Best in Class and Good Value for the Beginner through Advanced", "Author": "Aceto \"Hope is a Weed Exasperatus: 1:18\"", "ReviewID": "RVNOKO2X1SKCR", "Overall": "5.0", "Content": "My rating considers the class of camera and the price point.  So I am not comparing it to DSLRs or any other type or class.  My conclusion after my first thousand pictures is that you cannot do better for the money in quality or Fujifilm's advanced feature set.  If you want a compact camera that a novice can use effectively right out of the box, and grow with to an advanced level, give this great little camera your careful attention.Out of the box, I immediately liked separate manuals by language instead of fooling with a bulky bundle.  Good for a small camera bag or your pocket, as is the F200EXR itself.  And the whole manual is on their disc to load into your computer, Mac or PC.  I liked the fast charger for the battery.  Just enough time to load my computer, register on-line and set up the software, which I do not need to mix with other camera software.  But I do recommend ordering at least one extra battery along with the camera.  They are only $10 on Amazon and make life easier.Read the manual a bit while you wait for the charge light to go out.  This is a camera to grab and go in your pocket.  It has a wrist strap for added security while you carry.  The build quality is quite good.  You will want the F200 with you all the time.  It is even smaller than the Canon 97201S, just about the size of my cell phone and only twice as thick.  If you are planning on going into rugged country or conditions, I would still use a case to give it added protection.  There is a strong circumferential steel ring around the zoom, but it will not protect against a pointed shot at the center of the lens shutter, which is meant to keep out dust while reacting quickly to high shutter speeds.The exposure speeds cover a wide range.  One the low end, ISO 100 gives deep, saturated colors that remind me of even the ASA 25 of Kodak days gone b if you use the vivid setting.  I did not at all mind not having the ISO 64.  Dual Mode takes two shots with each click -- one flash and one ambient light.  I was surprised how often I was wrong about which one I thought would be better and how often you really want to keep both. Very handy.Noise reduction and stabilization corrections are effective.  If you are making too much vibration to handle easily, you are notified on screen.  I am used to the traditional view finder, but after a couple hundred shots, viewing through the screen proved adaptable and then more and more useful.Another handy feature is holding down the button during sequences of high action and letting it take rapid shots so you did not miss that little slice of the perfect moment.  How many times, while you released and went for the next, you were just a moment too late. I was pleased with the low light results as well in color and stability.  I got fine flatness of field with a 25w lamp photographing a page of print laying not quite flat at arm's length.  Fine sharpness.  The zoom gives a useful range, but do not mistake it for a special use where you want very powerful telephoto.When you want high resolution, go for 12mp.  Macro mode gives beautiful results.  Another advanced feature is Portrait Mode where the sensor is trained to detect faces and give them special treatment.  There is a setting to eliminate \"red-eye\" from flash.  Although you are primarily paying for quality, this camera is a good value only if you are the type of amateur who wants to take advantage of the many features and options available.  Even though you will be pleased on the first outing, the F200 is designed for those who want to grow with extended use.  You will learn to navigate easily through the dial, buttons and on-screen menus.  The best way is to concentrate on one feature or set of options at a time.  If you take notes of your settings for each shot, you will gain great insight and control.This review is more for the ambitious novice, so I did not go into the technical specs which you already advanced photographers can find and interpret easily enough.  If they meet your requirements, you will be gratified by the design, execution and results.", "Date": "April 15, 2009"}, {"Title": "Great Camera", "Author": "Koala Bear", "ReviewID": "R1A9IL1JVAXZ7Q", "Overall": "5.0", "Content": "The image quality is amazing in this camera, and you wouldn't believe the macros you can take.  If you are looking for a camera with amazing video quality, this isn't it.  I didn't buy the camera for videos, and so far it has exceeded my expectations.  There are a bunch of settings to fool around with to make sure your pictures come out the best.  The sensor in this camera is probably as good as it gets in any point and shoot, and it takes pics up to 800iso without any noticeable noise about 75% of the time (iso 400 does it about 90% of the time).Pros:  Best quality pictures in a point and shoot.  Insane macros, and the ability to raise the iso to 800 without much noise.  Good battery life, compact, and easy to use (short learning curve).  Great low light shots from my experience.Cons:  Less than amazing video quality.", "Date": "April 14, 2010"}, {"Title": "LOTS OF HYPE BUT DOES NOT DELIVER", "Author": "P. P. Maholchic", "ReviewID": "R284P6A57B96T2", "Overall": "3.0", "Content": "This camera is no match for my f31fd camera which thankfully I still own and takes great pictures.  I've found that the image stabilization on the f200exr is marginally effective.  Anything above ISO 400 produces very visible grain.You have to work to get good images out of this camera.  Flash is very weak. Every image has to be post processed except images taken in ideal lighting conditions.  There is just so much you can do with JPEG files.The dynamic range works well outdoors in good lighting provided you don't require any detail in your landscape shots.Useless as a 12 megapixel digicam.  Not good for landscapes ... very heavy sledge hammer noise reduction going on at ISO 100 in HR Mode even in great lighting.  Even DPREVIEW notes this.  You will not see any detail in foliage at all ... completely smeared.  Results not good at all for high resolution.People are awestruck by the inproved dynamic range.I just use a bit of negative exposure compensation on my f31fd and bring up the shadows a bit and it sure beats the noise on this over-hyped expensive f200exr.For the price I DO NOT RECOMMEND GETTING THIS CAMERA.  Spend a bit of extra money and get the Canon G11.  At the very least you will not get sledge hammer noise reduction going on and highly usable detailed landscape images. Additionally the optical image stabilization on the Canon REALLY WORKS WELL!  Good for about 4 stops ... better than boosting ISO ad nauseum.  And it comes with a hot shoe .... For great indoor pictures get a used f30 or f31fd camera if you can still find them.", "Date": "January 29, 2010"}, {"Title": "EXR is disappointing", "Author": "stratman \"stratman\"", "ReviewID": "R1UXFYZAF97B3J", "Overall": "3.0", "Content": "After being completly satisfied with a Fuji F10 (which is now broken), I expected the newest Fuji chip and capabilities on the 200EXR [at a premium price] to really be an improvement, but this camera, so far, is a disppointment.  My old F10 had faster shutter release and a much better picture with flash than the 200 EXR. Also, the macro focus on the F10(and metal body with convenient grip)was much better.The 28 wide is an improvement over the 35 in the F10, but the picture quality overall is not something special like the F10 was.I can see why the last versions of the 6 megapixel super CCD chip Fuji F30 and F31D cameras command high prices on e-bay.Controls on this camera are slow to set and confusing.  Manual setting limited to two f-stops are a joke, compared to the F-10.", "Date": "May 19, 2009"}, {"Title": "Best Low Light Point and Shoot I've Used", "Author": "Lon J. Seidman \"lonseidman@gmail .com\"", "ReviewID": "RTR4YNWDRHRDS", "Overall": "5.0", "Content": "Bottom line:  Fuji has come up with what I'd say is probably the best low light point and shoot camera on the market at the moment.Low light photography has, until very recently, been a real challenge for camera manufacturers.  Nikon's pro level SLR cameras (the D300, D700 and D3) revolutionized low-light digital photography for those willing to shell out a few grand (or more) for the privilege.  I shoot with a D300 and I'm still amazed at how well it makes use of the available light.Point and shoots cameras, while increasing the number of megapixels, have fallen short on low light performance.  You're left with either unviewable noisy images or forced to use an onboard flash with a very limited range.  Even the much loved Panasonic LX-3 suffers spotty low light performance.Fuji's new camera does not best my Nikon (it really shouldn't considering it's a fifth of the price) but it certainly does better in low light situations than I've seen a camera in this class do.When conditions are right images are balanced with very little noise.  Pushing the envelope too far, unfortunately, results in images that suffer a bit from the camera's oversampling.  They're not as bad as other cameras might be in similar situations, but they aren't something you'll want to have printed either.  In other words, a dark ballroom won't work, but indoor rooms with some ambient light will do pretty well.I do suggest playing with the manual settings extensively.  There are a bunch of menus to go through to get it perfect but the results are far better than the camera's own automation.  It's also a great way for beginners to learn more about exposure!My only disappointment is the very limited movie mode.  If you're looking for a camera that does great stills and HD video, look elsewhere.  Video is limited to SD 640x480 and is length limited.  Video is such an afterthought on this camera that Fuji even left it out of the marketing materials.", "Date": "April 16, 2009"}, {"Title": "BEST camera under $475", "Author": "B.Dub", "ReviewID": "R2SH1R7L07Q6T", "Overall": "5.0", "Content": "Over the past four years I have purchased 18 ($250-450) compact cameras, in search of one that can take sharp pics in all lighting conditions. Half of these cameras were CANON. My issue with Canon is - they over-expose the shot, preventing me from capturing the MOOD of the shot. AND Canon is not as quick as this FUJI F200. (FYI- I have owned/used their SX210, SX200, SX110, A610, S60 ...)My CASIO cameras had superb color saturation, contrast & sharpness \"outdoors\", because they generally under-expose the shot just a bit; AND they shoot fast! BUT not so good in low-light situations, like most cameras. Later, I purchased the Casio FH20 when it came out, BUT no matter what I tried, images were a little washed out and soft for \"my\" taste.After reading great pro-reviews on Panasonic TZ5 and FZ18 and FZ28, I was convinced Panasonic had what I was looking for. BUT after only four dozen shots, I was disappointed right away with soft edges & smeared detail in pics, AND Auto White-Balance had too much Blue in outdoor shots.My Olympus SP565 was pretty nice, and did fair job, but \"I\" didn't like their Menu layout and missed buttons that gave me direct access to features I use all the time.WHAT pushed me to give up this SP565 was when I checked out the FUJI F200 at local retail store.This FUJI F200 was unbelievable! Very Fast, Great color and detail, and unreal depth-of-field. In mid-day bright sunlight, faces were not burned out, and when shooting 5-dozen pics at a class reunion outdoors - every shot FROZE the action. ie- people walking, waving their arms, etc.. With over 90 people at the reunion, it was great to be able to capture people fairly close, as well as far away. One of my shots captured a camera bag only 4-feet away on a picnic table AS WELL AS people in front of a pickup truck 60 feet away. I have NEVER seen such clarity, great color, depth of field and NO burned out faces before! AND this FUJI F200 shots fast. AND finally a camera that can take ridiculous low-light pics. I love its natural-light and natural-light w/ flash feature. In tough lighting conditions - its EXR modes can do it all.to be fair - this FUJI F200 is limited to a 28-140mm lens and battery life is 250-300 per charge. AND video is limited to the typical 640x480. Recently FUJI released its HS10 EXR camera with tons of enhanced features, including a 24-720mm lens and HD 1080p video w/ stereo audio. Its manual zoom around the lens is nice too. This HS10 is the Fuji F200EXR on steroids..To date, I have taken 2500 shots with my FUJI F200, and still love it over ALL other compacts I have owned or tried. Over past four years I have taken 9500 shots with my cameras. When I can afford it, I will (add) this FUJI HS10, so I have more zoom and abilty to take HD movies.", "Date": "June 9, 2010"}, {"Title": "One of the top two cameras that easily fits in your pocket", "Author": "Reader / Photographer \"Dave\"", "ReviewID": "R11Q7QIDI4C9UA", "Overall": "4.0", "Content": "I bought this camera because it offers the best image quality and still fits easily in your pocket.  The sensor is bigger than most compacts-- the same size as the sensor in the Canon G10/11, which allows for better image quality with less noise.  The pixel bining approach is very creative and it works well.  In high resolution 12MP mode, the resolution is very very good.  The DR (dynamic range) mode is very effective in avoiding blown-out highlights or overly dark areas.  There is a clever mode which takes two shots- one with a flash and one without flash so you can see what type of photo looks best.  Also, the zoom range is good, with a very wide setting that is hard to find in compacts.  The autofocus is accurate and works well in low light.  Exposure is also accurate.I have only two complaints-- 1) the camera does not have an orientation sensor, so vertical images need to be manually rotated. 2) in SN (low light) mode, the camera tends to pick ISOs that are uneccessarily high.  This can be managed by settinga  ceiling on the ISO, but you have to remember to set it before you shoot.Overall, it is remarkable how such a small camera can deliver such good image quality.", "Date": "April 22, 2010"}, {"Title": "Great with enhance skin funtion!", "Author": "LazyBoy \"LazyBoy\"", "ReviewID": "RX2MXEFLHQS89", "Overall": "4.0", "Content": "Pro.Skin enhance funtion work like magic. Looks like the person is wareing make up with nice skin and light.Con.Battery life is really bad if is on EXR funtion", "Date": "February 19, 2010"}, {"Title": "Finally, a fast pocket digital that takes great pictures", "Author": "Amazon Customer \"1arryb\"", "ReviewID": "R3TBEDDHHKKUW7", "Overall": "4.0", "Content": "The FinePix 200 is the 4th pocket digital I've owned. This is the first one that rivals the \"shootability\" of my big Nikon SLR. The first big issue is speed. This camera starts up and is ready to shoot in a second - literally. It is also the first and only pocket camera I've used that lacks that annoying half-second delay between the time you press the shutter and it actually takes the picture. For me, this is crucial for capturing that \"special moment\" when taking snaps of family, friends and pets.Next issue is picture quality. This camera takes incredibly sharp pictures. My wife and I were shocked to find that this camera takes sharper pictures than our Nikon D200 when handheld. This is no doubt due to the image stabilization technology built into the Fuji camera (I haven't yet coughed up the big bucks for stabilized Nikor lenses).Another huge factor is the excellent software built into this camera. With every previous camera I've owned, including my big Nikon, I'm always \"gaming\" the automatic program defaults in order to get the colors or the contrast right on the shot. With the FinePix, there's none of that. I set this camera to the full auto \"EXR\" mode and leave it there. So far, I have rarely disagreed with the settings chosen by the camera.A final word about EXR mode. I like to shoot pictures of my friends at parties. With other cameras, this means either using the flash (boo!) or cranking the ISO up to the max and getting grainy photos. This camera has the unique ability to \"gang together\" light from 2 sensor elements into a single pixel on the final picture, enabling you to shoot with a lower ISO. In this mode the camera has incredible low-light performance. At the cost of shooting at 6Mpixels instead of 12 (fine, unless you want to enlarge past 6x8\") you can shoot without a flash in most situations.Physically, this camera isn't the sexiest, but it fits well in the hand and the controls all make sense.Battery life is so-so, especially if you use it in \"fast-focus\" mode. I'd recommend buying a second battery if you travel or go on extended photo shoots.", "Date": "January 25, 2010"}, {"Title": "The best P&S; camera in this price range", "Author": "Y. Takahashi", "ReviewID": "R3J9O0Y6J5U0DB", "Overall": "5.0", "Content": "I've been through countless digital cameras since the world first digital camera Casio QV10.  I'm keep replacing my P&S; almost once a year and average picture I'm taking with P&S; is about 15,000 shots per year.  I realy loved Finepix F31fd (the predecessor of F200) which is the best low-light condition deigital camera ever, but unfortunately, it's out dated already and doesn't have a wide angle lens nor image stabilizer.  This F200exr has both wide and stabilizer and with EXR low light mode, I can get almost the same result as F31fd (even better quality because of less in-camera noise reduction strength - I hate strong blur filter to imitate \"low noise.\").  Also, if you love to take a nature picture, this is THE ONE you want to use.  As most of camera lovers know, FUJI is the only manufacture that can preduce \"real green\" color.  Again, I've been through many cameras including professional DSLR, no other manufacture can beat FUJI's green.", "Date": "October 4, 2009"}, {"Title": "Does low light & high dynamic range well, but people look plasticky", "Author": "Mark Wieczorek", "ReviewID": "RTZVRN1STNB7X", "Overall": "3.0", "Content": "I bought this camera for it's low light capability. It can do ISO 12800 which is amazing especially for a point-and-shoot, though the photos are (understandably) noisy. Unfortunately the camera doesn't provide RAW nor can you change the noise reduction, so everyone comes out looking plasticky. Also, the flash is under-powered and right under your fingers when you're pressing the shutter button (just look at the camera - you can see how your fingers will get in the way). Half of my photos are dark on the right side because of this.On Saturday I was out with my friend who had one of those ever-so popular Canon cameras (SD1100IS) and the flash on that camera was WAY better than the flash on this camera, even if the shutter was sluggish (took 2+ seconds to actually take the shot). Though this may have been the metering (see below).The same photo on this camera vs. the Canon - on the Canon the whole bar was lit up, but on this camera just a few people at the front were lit up & everything behind them was dark.It also exposes for the brightest spot, so if a TV or lamp happened to be in the background, the foreground went to black - meaning the people went to black. This is common in pro level cameras where you want to keep as much highlight detail as possible, but this operates on the assumption that you can pull detail out of the shadow area. It's not so good for consumer cameras that frequently do stuff like take pictures in dark bars & don't get much shadow detail. I've changed the metering mode to \"average\", so that may help.I mean, I get that this camera is supposed to be good at high ISO, but why make it so miserable at other areas of in-the-dark shooting (such as flash photography).The construction is excellent - a strong, steel body, though as an other reviewer said, the door sometimes opens in my pocket. The battery doesn't last forever, but it lasts long enough. I'm not afraid to leave this in my back pocket for spur-of-the-moment photography.A facebook friend has a Sony camera where people look amazing whenever she photographs them, I may get that camera. Partly it's got a good warm balance for flash photography, and partly ... I dunno it must be the lens or the chip, but people just look good.I was at an afternoon dinner party a few weeks ago & took some natural-light (mid afternoon, north/east light windows) photos with this camera & the noise reduction kicked & and made everyone I took look pasty & clay-like. It wasn't bright in the apartment, but the Canon would have handled this photos just fine (and with Raw I could have decided on my level of noise reduction).Canon has a new flagship powershot coming out (based on the G10 - I own the G9 and love it, but it's too big to carry around & I want a High ISO capable camera) that's supposed to do ISO 12800. When that comes out I may ditch this camera in favor of the powershot. The Canon will probably be more expensive, but not by much, and if it shoots Raw, so much the better.As other people said - the dual image stabilization is a bit of a crock. It lacks lens stabilization so uses CCD shift & bumping up the ISO to \"stabilize\" the image, but what that means in practice is you end up with more noisy images instead of more blurry images.All in all - I'll keep using it for now & maybe switching it to Average metering will help, but I'm really thinking the upcoming Canon flagship will be the point-and-shoot for me. Or a cheap Sony that makes people look good (which, at the end of the day, is very important).I've taken about 800 photos with this camera over the course of a few weeks, from High ISO to long shutter speed (up to 8 seconds) to regular bar hopping to broad daylight & it does alright, but it only stands out in the high ISO area & now that Canon is going to be introducing a P&S; that has high ISO - I'd wait it out for that one if that's why you were buying this camera.If I had it to do over again, I'd wait for the Canon (high ISO capable + based on the tried & true Canon formula, which I've come to trust with my G9) or buy a Sony so people look good in my photos.I also own a Canon G9 and a Nikon D200, studied photography in college & make a bit of a hobby of it (the bar hopping thing was just where most of this cameras flaws showed up).Update: I use this camera a lot (now up to about 1200 photos), since it's the smallest camera I own. It's really good at landscapes & walking-about photography. I still maintain that people look \"plasticky\" when taken with this camera, especially at high ISO - which it loves, high ISO is part of its \"dual image stabilization\" features. I still haven't tried the \"averaging\" exposure reading in bar settings & noticed it's only available on Program (with red eye reduction turned off). Since it exposes for the highlights, if you're willing to photoshop, you can pull a lot of detail out of your daytime photos, especially with the expanded dynamic range - it's pretty cool getting foreground & sky detail in the same photo, especially with a point & shoot, though at first blush the foreground will be dull (since it's exposing for the brightest spot in the sky), but there is detail there to be extracted. If the direct sun the foreground will go to black. I took a sunset photo & could pull grainy details out of the foreground in photoshop - that's pretty impressive, a sunset with detail in the foreground. The boxiness of the camera makes for a somewhat decent impromptu tripod (just put it on the ground or on a table & as long as the ground isn't too uneven or the zoom isn't too far extended, it stands on is own). I wouldn't recommend this as a first/primary camera (because it makes people look plasticky), but I would recommend it as a second camera for someone into high-dynamic-range and low-light photography. Exposures can go up to 8 seconds - which may be of interest to those of you into low light photography. If it's really dark out, I leave it on 8 seconds & use the F-stop (two level control) and ISO to change the exposure. As it gets brighter I decrease the exposure time. ISO 6400 and 12800 are sort of unusable. Except for some rare situations where there's a lot of \"white\" but it's still dark out, thing become a grainy, splotchy mess at these ISO levels, but you can get photos that no other (current model) point & shoot could take.", "Date": "August 31, 2009"}, {"Title": "A potentially great camera marred with a lousy Auto mode.", "Author": "pika2000", "ReviewID": "RUQV6SR7BLS07", "Overall": "3.0", "Content": "Just received this camera today. I'm not an expert photographer in any way. Currently I have the Panasonic TZ4, and bought this Fuji due to the interest of the EXR sensor and a more compact camera.Now for starter, imo the TZ4 is so so (again, I'm no expert), and I find even an older Canon SD compact digicam that I used to have sometimes took better & sharper pictures. I tried using the F200EXR on auto mode, since that is the mode that most lay people would use. I'm taking indoor pictures, together with the TZ4. The TZ4 auto mode took the picture with flash and ISO 125. Not bad. The F200EXR took the picture with flash at ISO 800. WTF? The resulting image, obviously, is to the advantage of the TZ4 having cleaner and sharper picture due to lower ISO, while the F200EXR's image is extremely noisy in comparison.Next test, I set both cameras to ISO100, and took the same pictures again. Now the F200EXR shows the better image, with cleaner and less noise compared to the TZ4.So, why does Fuji set the auto mode to be so lousy? I mean c'mon, ISO800 with flash, while the competitor used ISO125? With the dizzying array of shooting modes, most lay people would simply want to use Auto mode. Even worse, on some settings, the lowest I can set the Auto ISO is ISO 400, and guess what, the camera seems to use ISO 400 all the time. I had to actually lower the ISO manually to get ISO100/200. Forget about setting it to Auto ISO1600 unless you only want to see noisy/grainy pictures.More annoyance is the yet another proprietary USB cable. Even worse, Fuji's USB cable is built into the AV cable, so it's much bulkier than a regular USB cable. Another is that the F200EXR's IS doesn't seem to work as well as the TZ4. My hand is not the steadiest, but some of the pictures taken with the F200EXR were obviously blurry, while the TZ4 pictures were not.There's a ton of settings in this camera. Tons of shooting mode combination. I have not tried all of them. I think I have to really review the manual to take advantage of this camera, and obviously not to use the Auto mode. For those that don't want to be bothered with other modes other than Auto, prepare to be disappointed.Update:I took the F200EXR for a quick test drive outdoors.Likes:-The compact design. Note that I have the TZ4, which is quite bulky inside a pocket.-The EXR Auto mode fares okay. Note that this is outdoors, thus less likely for the Auto mode to pick higher ISOs.-Some pictures turn out pretty good.Annoyance:-The IS is not that great.-On Auto mode, if your hand is not the steadiest, even on bright outdoors, the Auto ISO can shoot up to ISO 400 or higher. I guess that's the trade-off (considering the weak IS).-It's still a compact P&S.; Don't just expect noise free/DSLR-like pictures from the EXR sensor.-Some weird artifacts on reflective surface of water. Not really noticeable unless you zoom in on the picture though.", "Date": "March 23, 2009"}, {"Title": "A little magical camera", "Author": "KayCS", "ReviewID": "RFQG5ETWNABRY", "Overall": "4.0", "Content": "This was purchased more than a year ago based on one compelling reason, which was, and still is, its larger small sensor (1/1.6\").  The size of its EXR sensor is the same as the F200EXR's sister product, S200EXR, and is still larger than the most current F series product (the F600EXR, which is only 1/2\").  It is because of this very reason, I bought one, but had not used it until recent months because I was mostly using my DSLR (Nikon D90).One thing struck me almost immediately was that pictures came out from the F200EXR lacked shadow details and pictures, very often, came out extremely high in contrast.  This puzzled me for a bit and many different settings were tested but still the same result, the pictures were in extreme contrast !  Sharpness, however, was right-on !  Color was rich and tasteful, but still, no details in shaded or shadowed areas, things looked almost completely black in these areas !I had determined to do a little research on this strange behavior.  After some hours spent, finally found a solution!  The trick was that the F200EXR must be using DR800 in Dynamic Range setting, and the ONLY way to get the camera to allow DR800 to be selected, was to NOT to touch the Film Simulation, which means, leaving it permanently set at default (PROVIA/Standard).  Additionally, the EXR mode MUST be set to use DR.  I hadn't spend time looking to further my investigation to why only PROVIA that allows you to choose DR800, but this, ladies and gentleman, was THE magical setting to get all those shadow and shaded areas details back !It made a huge difference in quality when the pictures were compared, and because of this magical setting, the F200EXR is actually a portable photography wonder that produces sharp, delightful pictures with rich dynamic range !  The AF acquisition is fast and accurate, and it is also very surprising that even at ISO1600, pictures are still usable with bearable noise !  One star was knocked off because of its not so stellar VGA resolution only video capability.There was a thought of either putting the F200EXR on eBay or still keeping it, after the aforementioned magical discovery, the camera, all of the sudden, became a instant keeper, and also one that would go wherever it is taken too.", "Date": "January 5, 2012"}, {"Title": "Perfect with the underwater housing", "Author": "M. Tolentino \"e324016020\"", "ReviewID": "R3MGUE4DTRUHYO", "Overall": "4.0", "Content": "I've always been disappointed with the results of my former waterproof point & shoot cameras. They deliver everything but the photo quality I was hoping for. I finally decided to get the F200 plus the waterproof housing for it and I was amazed with the results. Now I get the image quality I want for both in and out of the water.", "Date": "May 12, 2010"}, {"Title": "Disappointing auto mode", "Author": "camera novice", "ReviewID": "R10FLQC92518IY", "Overall": "3.0", "Content": "We have owned a Fuji f3800 for 5+ years now and really like but it is beginning to show its age and needed a replacement.  We wanted a comparable point-n-shoot that had good low-light picture quality in 'auto' mode.  Maybe the camera needs a more advanced photographer who understands all the settings but when we compared the same images taken on our f3800 and the new f200EXR, it was clear that the f200EXR was being returned.  We tried several different settings and were disappointed with all of them, not to mention the larger file sizes for more grainy pictures.  We feel inept, given all the positive reviews for this camera but maybe this camera is just too smart for our needs.  Would appreciate any advice and will monitor this review for any camera suggestions others may have for us.", "Date": "January 23, 2010"}, {"Title": "Good product...not excellent", "Author": "Naveed Shah \"DocIce\"", "ReviewID": "R31Z79S0NA8JMG", "Overall": "4.0", "Content": "I bought this camera even though I have a Canon Digital IXUS 860....I thought that the low light result would be terrific...but unfortunately it is just a little bit better, and it is bulkier than the Canon too ....not worth the money spent....I am still looking for a small compact camera which gives good results in low light without the flash!", "Date": "January 9, 2010"}, {"Title": "solid camera", "Author": "J. Miller \"Scientist\"", "ReviewID": "R3NWVO6MXEOUCU", "Overall": "4.0", "Content": "I actually returned the first f200exr that I had received because the colors looked washed out and worse than my five year old casio exilim which I loved.  Ultimately I wanted a camera that would give me better shots in low light though.  I just received my new f200exr in the mail and The pictures do look very good.  A word of advice though, I realize that my pictures looked washed out after I set the compression quality from Normal (N) to Fine (F), which technically should have made the pictures better, but actually made them considerably worse.I'm not certain yet if I'm going to keep this camera or not.  I tested it against the Canon sx200IS, which takes wonderful normal light pictures, and against my girlfriends Canon SD870is to which I would say is a very solid camera as well.  I have a Canon S90 on the way that I'm going to test it against as well.  The Canon was considerably more expensive than I was planning on, but ultimately I'll base my decision on picture quality and overall build quality of the camera.Build quality is one thing that I will say the Fuji gets full points for.  This camera is compact and feels very solid in the hand.  The controls are comfortably placed, though the flash is in a bad spot.  It took me days before I stopped automatically covering the flash while holding the camera, but eventually you do get used to it.  I agree with some other reviews that the menu isn't great, but it is perfectly usable once you get past the steep learning curve in the beginning. I'm not thrilled with the picture quality, but then I am coming from another very nice camera.  I would say that the low light photos are very good, especially if you limit the ISO (since the camera likes to force it up to about 1600 every time is sees a shadow) and just accept that low light will require a tripod.  Or in place of a tripod, just use the 2 second timer and set it on something solid.  I'm planning on testing more in normal lighting.  One other thing that you might want to be aware of is that when on full auto EXR mode, it does make a bit of noise.  It was enough to bother me, but then I tend to be sensitive to such things so you might be fine.Overall I would say that I do like the camera very much.  I think that for the casual photographer it would be great.  It's got a nice large sensor for lower light and the sensor design, I think, holds quite a bit of promise for the future of fuji cameras; I'll definitely be keeping an eye on them for the next few years.  I think all but the most picky will be happy with this camera.  I've done more research into cameras the past three weeks than I would care to admit and if you're willing to put the work in to really learn this camera I think you'll like it.", "Date": "December 7, 2009"}, {"Title": "Between 3 1/2 to 4 Stars...", "Author": "Super Mum", "ReviewID": "R2BGR1VLZC78XK", "Overall": "4.0", "Content": "After purchasing my first DSLR several years ago I have become \"snobby\" about point-and-shoots (P&S;) and generally cringe when I see the photos I have taken with a P&S; knowing how much better they \"could have been.\"  It should also be noted up front that I HATE flashes on P&S; cameras as they tend to blow out the color in the photo and bleach out expression and detail.When I was offered to review this camera I really wanted to test it out in a variety of environments, giving it a fair shot, before reviewing.  I have been using this camera for 7 ½ months and feel as though I have a good idea of what it is capable of now.  Had I reviewed it in the first couple of days/weeks my review would have been much lower as it took awhile to tweek the settings to make me happy.  At first I found that I was having a hard time getting consistently good shots and was frustrated over the lack of control I felt.  After trial and error I now get consistently good shots every time.What I enjoy:- It offers options for both the novice user and those who want some control over the settings.- Face detection - when the camera detects you are shooting a face, or multiple faces, the LCD zooms in on the faces after the shot is taken for a close up (quick check if anyone blinked, spinach in the teeth, etc.). If someone blinked you know right away and can attempt the shot again without missing the moment.- IS (image stabilization) works well especially in low light conditions- The \"Natural Light and with Flash\" mode.  This mode takes two photos rapid fire... one with flash and one without.  I, again, am not a fan of P&S; flashes for the aforementioned reasons but sometimes I misjudge what this camera is capable of shooting without a flash (often it results in more blur than acceptable).  This mode allows me to capture the shot both with and without a flash nearly simultaneously and I can make the decision of which I like better when I get back to my computer.  Standing \"O\" on this idea!- While I have Photoshop and Lightroom at home, for those who don't, it is a neat little feature to add \"Film Simulation Mode\" when you want to capture a subtle change in color.  Wish there were more \"films\" to choose from as I think this is a fun alternative for those who don't want or can't afford Adobe's products.- Held up to my abuse (it's so small I would forget about it in my scary purse for weeks at a time)What could have been improved:- NO VIEWFINDER!!!! Seriously... they are necessary despite what the majority of people seem to believe.  When holding a camera away from your body it is less stable (which equals more blur).  Also, in certain lights LCD screens are hard to see.- Shutter lag is longer than I would have liked- Takes nearly three seconds to turn on to first photo- More noisy (\"grainy\") at ISO 800, 1600, 3200 (low light shots) than I would like... but noise is better than glaring flash in most situations IMO- Location of the flash as it can be easy to cover with a finger (not a problem in the long run but it may accidentally occur at first use.)- Speed at which the camera zooms... it's too fast.  I often find myself over zooming and having to recorrect.  Perhaps because I am used to manually zooming on a DSLR?  But still... it seems to fast.While I did initially state that this is a great camera from a novice... it still requires that someone be willing to learn through trial-and-error or the manual before getting ideal shots.  This is not a camera you purchase in hopes of pulling it out of the box and taking amazing shots.  There is a learning curve and amazing shots are very possible with practice.", "Date": "November 7, 2009"}, {"Title": "A great subcompact but failed after just over a year", "Author": "E. J. Hutchinson", "ReviewID": "RHGJH43I1JBDE", "Overall": "1.0", "Content": "I did a lot of research before buying this camera. I was looking for a subcompact that could take decent low light pictures, period. That was my biggest complaint for subcompacts. I have not used it extensively and will probably update my review after my first vacation but I did some testing taking pictures next to a camp fire at night. The results were outstanding. Both myself and my friends were amazed. I even took a picture when the first went out and the only light was my friends cigar and even that was not bad. As for other general observations: the viewer screen is excellent, I  used it with the sun shining directly on it and could still see the image. I have not seen the benefit of the EXR feature but again, I have not used the camera extensively. So far I have to say this is a great subcompact and the reviews I read were spot on (Cnet, Consumer Reports). The user guide is very good and I did not need a lot of time to understand the cameras menus, functions and how it works. The only negative things I can say is that I did not like the little push button to turn on the camera, a little too easy to press inadvertently for me and I do not like the lack of a view finder, but I realize they are being phased out in compact cameras. I don't know if this is appropriate for a review but I have to recommend the case at the link below for this camera, if you are looking for a good compact case.[...]UPDATE: after a few vacations I can see I made the right choice. The low light capability of this camera, for the price, is outstanding! My friends have also marveled at some of the shots I have gotten. Also the manual settings you can play with are helpful too! One more minor complaint could be that the battery dies fast if you are reviewing pictures a lot. I have two batteries and killed both on long days (over eight hours) of picture taking. But I realized I could have saved battery life not reviewing every picture. Again, minor complaint but wanted to put it out there, for long days a backup battery is essential.FINAL UPDATE: After a little over a year I was using the camera on vacation when the screen began to show only a blurry purple image. No matter what I tried it did not go away. Being that the warranty is a year I had to look into repairing it myself. The repair shop I went to in my area said the repair was going to be $125.00 to $150.00. Needless to say I cannot see spend $150 to fix a $300 camera. Because of this I have to rescind my previous five star rating and drop to a one. I cannot in good conscious go any higher for a camera that is unusable after a year. A camera that was not abused or mishandled in any fashion. My last camera was a Kodak and that lasted many a vacation and the only reason I replaced it was that it was just outdated, wish I had that back.", "Date": "June 26, 2010"}, {"Title": "Read the Manual, Nice P&S;, No Battery Life", "Author": "TechConsumer", "ReviewID": "R3810E7RGS3CO2", "Overall": "4.0", "Content": "Don't expect to take great pictures out of the box.  The fully automatic mode is fine for out doors, but indoors requires some understanding of the camera features to get the perfect shot.  The camera is very capable of delivering a great photo, however the operator must be willing to put time into learning all the optional settings.  The battery life is sad!  If you want this camera, buy it with a second battery or you will be caught powerless on the road or away from home.  Video capability is an after thought, sure if you need to take a quick video, it works, but don't put your hopes into anything more.  Bottom line, this camera will be good for pocket sized user willing to take the time to learn its many features.", "Date": "October 19, 2009"}, {"Title": "Compared with other cameras", "Author": "Big-Z", "ReviewID": "R1F6SWYGOKMIXY", "Overall": "5.0", "Content": "I have owned and kept or sold more than 24 digital cameras over the past 15 years. I currently own and compare for this review the picture quality of the Finepix F200EXR, the Panasonic FZ150, the Panasonic FZ28, and the canon A1100. Yesterday I took all four out for a comparison round of shooting and with each camera took three outside pictures, one in perfect lighting and two in poor lighting (full shadow at sunset). I compared image quality overall and down to the pixel level with all four cameras set on automatic with the F200EXR on EXR but limited to ISO 100. The scoring results out of a possible 15 points total came out as follows: the F200EXR was tops at a score of 14.5. Next came the Panasonic FZ150 with a score of 12.5. Then came the Panasonic FX28 with an 11.8, and finally, as expected, came the Canon A1100 with a 10.5. Before I sold my Canon SXi DSLR, I did some comparison shooting, comparing its unretouched photo quality to the F200EXR, and although I did not score the images at the time, I remember that the Canon XSi was only slightly better than the F200EXR... probably a score of 15 on the same scale.All the pictures were taken at highest resolution and analyzed straight from the cameras with no editing. This comparison, obviously was not scientific, but since I consider image quality and portability the two major factors in my digital ownership, I am only  interested in the final, every day real world outdoor photography results. I did the subjective comparisons without knowing which camera took which pictures.I was not surprised with the F200EXR winning, but I was a bit surprised that the FZ28 scored third, considering its high relative high price.", "Date": "October 1, 2009"}, {"Title": "Fujifilm FinePix", "Author": "K. Hill", "ReviewID": "R2C4VY297I60XC", "Overall": "4.0", "Content": "First impressions of this camera when you pull it out of the box are good. It's attractive, shiny and pleasantly weighty. It has an all metal body. The view screen on the back is the largest of any camera I've had.It's very easy to start using this camera. This is my third digital camera and with my previous two cameras, I never could figure out how to use the recording feature to make videos. I gave my first camera away without ever figuring it out. With this one, I was recording on my very first day sans manual.Installation of the camera software was also swift and easy. I did use the manual for this part, but it's mostly a matter of putting in a CD and following instructions on the screen.This camera cuts on and off rather quickly. The wait time between taking photos is reasonable. My toddler is still out of frame most times and I have lots of photos of the back of her head, but then she's fast.THE CONS:  Though this camera has 12 MP, the photos taken with my Nikon with 10 MP are still superior. These look a little fuzzy in comparison and just never approach the quality of my Nikon no matter what setting I use. With my Nikon I can zoom in on photos and I can actually count my baby's lashes. I sit there and ooh and aah over the texture of her skin. I can even see the weave pattern in her clothing. The more I zoom on the Fuji photos, the fuzzier the photos look.", "Date": "May 8, 2009"}, {"Title": "pretty good, but some complaints...", "Author": "Joseph H. Allen \"joe_from_boston\"", "ReviewID": "R1W34TASAYX0WN", "Overall": "4.0", "Content": "Annoyances:1. I can confirm some of the other reviews: the screen does smudge more than on other cameras.  It would be better if the screen was not recessed, then it would be easier to wipe.  This seems like a stupid complaint, but seeing an always smudgy screen detracts from the beauty of the camera.2. I'm annoyed at the cable.  I wish it was the same as previous Fuji USB cables, and just have a separate connector for video. Perhaps they need more space for the connectors?  Well then eliminate the XD card slot.  Best would be if it they could eliminate the cable (have a USB plug pop out of the camera or something).  Perhaps bluetooth is the answer,  but only if I don't have to pre-install a driver in the computer.3. Maybe it's just me, but the mode-select knob is too easy to turn, so between taking the camera out of a case or my packet the mode is changed from where I left it.  Usually I don't notice until after I've taken a picture.  They should just eliminate the knob and make the menu system better (add a mode button).4. Lots of hot pixels on my camera if I take an 8-sec night exposure (at first I thought stars were showing through the cloudy sky..).5. I wish the camera showed a zoomed-in result of result of the previous taken picture to verify the image quality.  Some other cameras do this.The good:1. The build quality is nice.  It feels substantial and high quality.  It's still small enough to fit in my pocket.2. The higher sensitivity CCD really helps.  I rarely make prints, so I care more about blur reduction and good focus than resolution.  Last night I took flash-free shots of kids in a dark restaurant.  ISO 1600 is just fast enough to pull this off and on this camera it's not so noisy as to be useless.I wish Fuji's next camera:1. had optical image stabilization.  In truth I don't have a comparison between ccd shift and optical shift, but my feeling is Canon's IS is better.  It's true that the larger CCD also helps, but it would be better still if it had both.2. had a faster lens.3. had an even lower noise higher sensitivity CCD sensor.4. hdtv video recording with zoom during recording (possibly digital zoom is ok here) and stereo audio.(but I guess that they are going to compromise all around to get a 12x zoom lens to compete with Panasonic and Canon).", "Date": "May 2, 2009"}, {"Title": "Great Camera, great customer service", "Author": "Emilie Barnett", "ReviewID": "R37N4IMHH72EKL", "Overall": "5.0", "Content": "I'm writing this here because I no longer have the option to give seller feedback for this purchase.I ordered the F200 to replace our old one which after several years of pretty hard use (plus one rum-soaked trip to the Carribean and an equally dirty trip to Burning Man) died.There was a mix-up and I received the F600 instead, which it turns out seems to be a slightly better camera so I decided to keep it. When customer support learned about the mixup, they offered to send me a free SD card, which I accepted and promptly received. Very impressed with their attentiveness, and I am confident had I requested the correct camera be sent to me instead they would have done so immediately.As for the camera itself, the F200 is a solid point-and-shoot, that seems to handle low-lighting situations better than most. It's a convenient size, has a decent zoom, and both beginners and advanced photographers can take good photos with this camera.", "Date": "January 2, 2014"}, {"Title": "Doesn't Exist", "Author": "Wandering Anglo", "ReviewID": "R8JE6DR9CZUHW", "Overall": "1.0", "Content": "I wanted to see if this F200EXR was really available because it's discontinued and I really doubted I could get it. And I was right. I received a different EXR. I did not want that one, I wanted the 200 because I had one before and loved it.All I can say is that if you want this particular item you won't get it here and I don't know why Amazon lets this vendor substitute.1 Star because you have to use a star in the reviews...Great camera, but you won't get it here.", "Date": "January 1, 2014"}, {"Title": "Will not get item that you ordered", "Author": "dinosnake", "ReviewID": "RRSZPVQP8AL89", "Overall": "1.0", "Content": "Regretfully the F200EXR is discontinued and the dealer, while listing it for sale, is actually well out of stock.  I got a F600EXR instead and, of course, returned it promptly.  The dealer was very helpful and pleasant to deal with for the return, but I just wish they had told me what was going on before even bothering to ship me the wrong item.", "Date": "May 10, 2013"}, {"Title": "Excellent Experience", "Author": "james c thomas", "ReviewID": "R3LSKSD6B39MCH", "Overall": "5.0", "Content": "I just wanted to say thank you, my camera came in less time than I expected.It was also in better condition than I expected. This is the reason I try to buy anything I need through Amazon first. My experiences here have ALL been great.", "Date": "February 24, 2013"}, {"Title": "not impressed", "Author": "Amelia P. Pearce \"Pearce\"", "ReviewID": "R2PQIU8YE2KGMN", "Overall": "2.0", "Content": "I was  not happy with the images that were taken indoors.  The pictures were dark and grainy, especially disappointing since we were hoping to document our new baby!", "Date": "September 13, 2011"}, {"Title": "Nice point-and-shoot camera", "Author": "JoonsReview", "ReviewID": "R23PTS7M9GY2KW", "Overall": "4.0", "Content": "I already own a Digital SLR, but needed a more compact and light digital camera which I can carry around and bring to occasions which I don't need the power of DSLR, but want better picture quality than mere phone cameras. This one was my final choice, and I bought it at Oct.10.2010. I carried this camera along by San Francisco trip. Overall, I am satisfied.It is compact and light enough to carry around. It produces decent images with lots of modes. If you are quite a pro and want to set the shutter speed, aperture, white balance, color, etc, you can do that using the manual mode. If you are not, you can use the preset modes, which are actually quite good and convenient to use (My girlfriend loves the enhanced portrait mode, because it makes her and my skin look like porcelain).EXR mode, which is a mode where the camera itself decides what the scene it is taking (portrait, scenery, night time, etc) is quite accurate. It does drain the battery than normal, but worth to use when you don't want the hassle of changing modes (or don't know what to choose).Battery dies after a day of use, but I took about 200~300 shots, so I think it is decent.Fuji makes great digital cameras, so I am quite sure you will be satisfied with this one :)", "Date": "November 29, 2010"}, {"Title": "fuiji", "Author": "Nancy Radosta", "ReviewID": "R2QHU6O0EBK0HU", "Overall": "4.0", "Content": "The camera comes with a basic manual. The actual manual is on a disk which can be difficult if you are not a computer user or if you are traveling and have a question.", "Date": "February 24, 2010"}, {"Title": "F200 EXR", "Author": "Yaser Arafat \"Cheema\"", "ReviewID": "R3VK94W7DCOFGB", "Overall": "3.0", "Content": "I compared it head to head with LUMIX DMC ZS3, which was much better and had natural photo colors.So EXR light sensor not so impressive to me and its only 4-5 X zoom.", "Date": "January 21, 2010"}, {"Title": "Like it!", "Author": "An", "ReviewID": "RRCJ765AHG8NC", "Overall": "4.0", "Content": "I bought my Fuji Finepix F200EXR after I have returned my Nikon Coolpix S70 (not satisfied with the picture quality).  I previously owned a Fuji Finepix 3800 which I really liked that's why I decided on getting another Fuji Finepix. The picture quality of the F200EXR is really good considering it's a compact camera.  It can really take good pictures even in low light conditions.  I also like the macro mode.  What I don't like is the noise it makes when you are on EXR mode.  It also drains the battery quite fast.  You really have to keep another extra battery on hand.  The video quality and the sound is not that good, you cannot make HD movies.  Well, I bought this camera for taking pictures, not videos, so it's not that bad I guess.  Price range is okay compared to other compact digital camera. Overall, I'm satisfied with my Fuji Finepix F200EXR.", "Date": "November 16, 2009"}, {"Title": "Love my New Fuji!", "Author": "C. Flook", "ReviewID": "R1AA90I5BEC7E4", "Overall": "4.0", "Content": "I researched many cameras on the internet before purchasing this one.  I use it for work and for personal use.  So far, after a month, it seems to be working as I had hoped.  It's a very nice camera with many user friendly options.  The zoom works very well, as well as the EXR setting. The only problem that I've noticed is the battery loses its power rather quickly.", "Date": "November 11, 2009"}, {"Title": "akam", "Author": "Pamela R. Mersch", "ReviewID": "R3M1GFXNCZPV03", "Overall": "3.0", "Content": "Battery use is drastically affected in ers mode.  Battery becomes warm and usage is shortened.  Other than that big flaw, camera does well.  Recall time/shutter speed is not as good as previous 800 series canon.  Actualy canon has performed better and is better.  I was brought in by the 5X optical and the 12 megt .  Haven't had camera for a long time but would suggest canon 870 as better alternative if meg were larger and optical zoom better,  your call.Pam", "Date": "November 8, 2009"}, {"Title": "A good compact with a glitch", "Author": "Tere Sammallahti", "ReviewID": "REPTJ7R0HTMIE", "Overall": "4.0", "Content": "I just had to come here and say that it's a good compact camera. The menu is easy to use, firmware is easy to update, not too many buttons and those preset modes allow one to take good pictures without further knowledge of photography.However, there is a glitch. I like to video quite a bit and to my amazement this camera produces hissing (from low pitch to high pitch and so on) noise to the video you take. I just called to Fujifilm support center and they said there's nothing they can do to it as the hissing is due to the EXR panel which focuses all the time. Altough I don't understand why the hissing noise is still there if I put my camera on a table facing the wall. So, if you like to take good quality video, this camera is not for you I'm afraid. The hissing noise will be there and there's nothing you can do about it, at least according to them.", "Date": "October 9, 2009"}, {"Title": "Excellent camera!", "Author": "Bob Lawrence", "ReviewID": "R2NRGLNNRAVB7J", "Overall": "5.0", "Content": "I've been using point-and-shoot digital cameras for about ten years, for both on-line and personal use.  This is the best camera I've ever owned.  I've taken it with me hiking, biking, or just looking for interesting subjects.  The results have been uniformly outstanding.  Of course, I'm a long-time PhotoShop user, so I can correct minor problems, but the better the input, the better the output to print.  Excellent camera.", "Date": "September 6, 2009"}, {"Title": "A great low noise point and shoot", "Author": "S. Colyvas", "ReviewID": "R1TP3OTXI8TTI7", "Overall": "5.0", "Content": "The previous low noise king of point and shoots was the fujifilm f20/f30 series camera, until the f200exr fujifilm hasn't been able to match it. Finally The F200exr performs simillarly to the f20/f30, the key is the new EXR sensor, dpreview has a good discussion of the sensor at:[...]The f200exr also has great build quality and the features expected from a current point and shoot camera like optical image stabalization and a 6x zoom.I can't agree that this camera is the \"perfect complement to a DSLR\", this is a point and shoot, it does not have a relatively fast lens (f3.3 is the \"fastest\" setting) and it does not shoot raw. I would reccomend the panasonic lumix dmc-lx3 if you want an enthusiast level pocket camera (although the lx3 is a little bulky).", "Date": "March 17, 2009"}, {"Title": "Great camera for portraits, EXR function works well in most situations.", "Author": "AmazonDiva \"Keep Calm and Carry On.\"", "ReviewID": "R2AQ2WZ91UBMP6", "Overall": "4.0", "Content": "The Fujifilm camera has an intelligent system that helps you take better pictures through the EXR sensor which balances the flash and switches the mode automatically. It is pretty good at recognizing the number of faces in a shot or from switching from landscape to portrait as soon as a person walks into the frame. I was most impressed by it's ability to recognize a backlit shot if someone stands in a darker room in front of a window. However, the results are a bit mixed. Some of the portraits I have taken so far are amazing, and showed extreme detail when I took closeups of faces by zooming in. There is absolutely no red eye as the intelligent system recognizes and eliminates it. But there are other portraits that turned out grainy despite decent lighting.I have been a big fan of Canon point and shoot cameras so far, this camera was better than Canon when taking portraits on auto mode in good lighting. However, all the dim light and night shots came out really grainy when using the EXR function or night mode. I later realized that this is because this camera sets the ISO to 1600 in Auto or EXR mode. That is very disappointing rendering the EXR/Auto/Special modes useless in evening/indoor/night scenes. In less than perfect lighting situations on auto mode, I think Sony Cybershots have a slight edge, although they miss out in other situations. Canon cameras have been my best buddies for daylit landscapes and do reasonably well in evening/night shots. Fujifilm could not beat their performance, this camera is useless as a point and shoot for me. If you're prepared to tinker with your shots each time then it will work for you.Nowadays all cameras come with dual image stabilization, so this was similar to other cameras, although Canon IS seems a shade better.Here is the feature breakdown:Modes:The EXR mode - for as your eyes see it to intelligently auto set the right settings - I use this a lot as it is pretty good on the flySP Mode - which has all the different scene modes you would ever need- Snow, Beach, Underwater, Museum, Sunset, Fireworks, Night, Night with Tripod, Sport, Landscape, Portrait and Portrait Enhancer (smooths out skin), Party, Flower.Natural Light mode - which takes great portraits with natural lightNatural Flash mode - which takes 2 continuous shots - one with natural light and one with flash which is great as you can use whichever version comes out bestAuto mode, Movie mode, Manual Mode, Programmable mode (which you can set to your liking) are some other modesThis camera gives you a full HD photo option and even comes with an HDMI cable so you can view pics on your HDTV which is great.Overall, this camera is pretty good, but at this price range it's not spectacular. I really think there is no perfect camera, but this camera has a nice balance of 12 MPs, a big screen, great zoom, wide-angle, image stabilization. I recommend this camera if you're prepared to work with it a little, as it takes very good portraits on P mode, when you set the ISO and dynamic range. Fujifilm needs to fix the auto and EXR modes to make this camera a good point and shoot camera.", "Date": "May 28, 2009"}, {"Title": "FUJIFILM F200 EXR", "Author": "D. Karavan", "ReviewID": "RNHWPQXZLVT7S", "Overall": "4.0", "Content": "I was looking for the best possible compact camera possible. Saw the f100 (older model) and it was fantastic and thought the next one out would be just plain fascinating. Have this one for about a month now.Pros: Good Size (about half my hand), fast focus, 5x zoom (not best but better then the 3x zoom cameras), high ISO up to 12800. Continues shooting 9 pictures per second at 5mp.  On EXR mode the camera detects and sets everything by itself. For example if move it close to an object it will select marco mode automatically and reduce the flash by it self. Or if I take a picture of sky, it turns off flash and selects Scenery by itself.Cons: Video quality sucks (640X480) such a good camera and bad video its embarrassing, also no zoom during video. slow start up time about 3 to 4 seconds. Does this annoying clicking sound when put on EXR mode, this is on all the EXR cameras i have researched.Other thoughts: Out of all the compact cameras out there, this would be the best one in terms of low light pictures. Next in line would be Panasonic LX3.*(low light shots) are incredible. I go outside in pitch darkness (ISO 12800, 8 second sutter rate) it looks like day time shots.", "Date": "March 31, 2009"}, {"Title": "Fairly good pix do not excuse unacceptable quality of manufacturing and service", "Author": "Carl Schuyler", "ReviewID": "R2ZPXEYJ1BAHDF", "Overall": "2.0", "Content": "This is the 4th and last Fuji I have owned.  First, the good:* I like the picture quality.  Not the greatest, in fact I think since my first Fuji experience this aspect of the products has deteriorated.  But, it's better than many less expensive cameras.Now to the not so great:* The battery life is abysmal.  I needed to take up to 3 sets of batteries per day.  Make sure you have a charger and time to recharge your batteries!* Quibbles on picture quality: I was never able to get it to focus predictably - which was OK, since I just needed to take many pictures of the same scene and throw out the unfocused ones.* I bought this for a trip to Europe.  It lasted 2 weeks, then started to malfunction: It would go into USB mode unpredictably after being turned on.  Within a couple days it was unusable.* I sent it to the Fuji service center in New Jersey.  They said it has a vertical line in the LCD - something that I certainly don't recall and think I would have noticed.  But the kicker was they said it had water damage and was beyond repair.  This is odd, since I never had it near any water.  They wanted half the price of what I paid for it, in order to exchange it.  Unacceptable: I used this thing for 2 weeks, and not roughly at all - I took good care of it.  And it's broken, period.  In addition, I had requested another service in the cover letter I sent, which was completely ignored.  It's almost as if they threw out the letter, ascribed random and spurious reasons for not honoring the one-year warranty, and left it at that.I will not buy a Fujifilm product again.  To be clear: I'm calling the Fuji one year warranty nearly worthless, and those who handle the service process dishonest and nonresponsive at best, and cheaters and liars at worst.PLEASE consider the poor durability of Fuji cameras, as well as non-stellar quality, before paying a high price for one.  I have had three previous (and escalating) bad experiences with Fuji cameras.  Previously I came back because of good picture quality, but in this last experience that, too, was not great.  In my opinion Fuji doesn't value quality - they'd rather just sell as much shoddy product as possible.Bottom line: Unacceptably bad durability, useless service and warranty, overpriced.  Go with the top-notch brands.", "Date": "December 26, 2010"}, {"Title": "Nice camera", "Author": "Therese \"Treehugger\"", "ReviewID": "R3858DYOZ1IY8O", "Overall": "4.0", "Content": "I enjoyed using this camera.  It is light and compact and very easy to use.  I am a \"point and shot\" photograper so I wasn't able to use the camera's manual features, but I was able to use the automatice features that are pretty standard with digital cameras - portrait, landscape macros, etc.The camera does seem expensive for a point and click camera though.", "Date": "July 10, 2010"}, {"Title": "It's Like Having A DSLR In Your Pocket!!!", "Author": "Brad Jordan", "ReviewID": "R29HCCTFPRMTU4", "Overall": "5.0", "Content": "Fuji has automated my life with this new camera.  As someone who regularly caries a high-end DSLR, I'm falling in love with the F200EXR!  In my mind, the auto scene selection is what makes the F200EXR really stands out.  I don't what to be bothered with figuring out what mode to set the camera when I am having fun, and I'm discovering that the F200 EXR technology is very well balanced with the auto scene recognition.  Regardless of shooting condition needs, (wide dynamic range, hi resolution, low light) I can just \"point and shoot\" and enjoy my day.When I want to get really creative I just set the Auto EXR mode to one of the Priority modes or turn on one of the professional film simulation modes.As for flash... I have used a lot of high end point and shoots over 10 years, but the F200EXR flash is the best I have seen. When the camera's auto scene selection selects macro close-up the flash never blows out the subject.  An awesome feature for anyone selling stuff on online auctions.What can I say is that so far, I think the EXR sensor is living up to the company's heritage.", "Date": "March 11, 2009"}, {"Title": "Right out of the Box - Sturdy, Beautiful, User Friendly", "Author": "Diana De Avila \"MS Gkygrl\"", "ReviewID": "R2XLS6R94F1E7W", "Overall": "5.0", "Content": "I received my Fuji FinePix F200EXR and was impressed immediately by it's heft (the camera felt very solid in my hands and is constructed of a metal body).  Inside the box is a Lithium battery, charger, manual, software and a USB/AV Cable).I have taken a few indoor shots which looked absolutely beautiful.  I like to try a product out before I read the manual to try to understand how easy it is for a quickstart (or rather, an impatient geek like me).  The buttons seemed well marked and right off the bat was a set-up menu for date and time (as soon as the battery was inserted).  Setting this up was pretty easy and I just used an up and down arrow key that is typical of many digital cameras.  I wanted to see how far I could get without documentation.I have just bought a case for it (a Lowepro) and will begin to venture into the manual to learn what all the settings mean.I must express that I love to take pictures but am a true hobbyist.  I am much more a geek than a photographer, so I will be venturing into the accompanying software and manual to try to figure things out.  I just wanted to provide an initial impression.I'm impressed.  The picture quality right out of the box was fabulous!Installing the software is easy (I used a Windows Vista laptop) and uploaded pictures from the media card.  Beautiful quality pictures and the FinePix software is very user friendly and makes it easy to work with your pictures and store them.  There is even a FREE online service for storing pictures created by Fuji specifically for FinePix users.  Registration for this is easy.The manual is straighforward and explains every setting.  There is also a CD copy of the manual (as well as paper) so you can choose your medium.  The one feature I want to figure out is the \"burst\" shooting (taking multiple pictures with one click of the button).  But I may have to read further.  As I mentioned, I am a hobbyist.The camera does not come with a case.  But I have found that the Lowepro Rezo 20 Camera Case (Black) is a perfect fit for the camera, an extra battery and a card.  At $10.00, it is WELL worth the investment for this great, sturdy camera.", "Date": "March 27, 2009"}, {"Title": "Huge disappointment", "Author": "Organic Mama \"Organic Mama\"", "ReviewID": "R3GG8ADZXFLQKG", "Overall": "1.0", "Content": "First, this camera takes terrible pictures indoors. The photos from indoors look like you are in a dust storm: all grainy, You have to be outdoors with no flash for truly good photos. Second, after about a month of having the camera, the lens cover will not open completely, almost as if it is stuck. Half my pictures have a black angled mark at the top left due to this. I am really disappointed by this camera.Update March 26, 2011: This camera continues to get worse. I am on a family trip in Europe and what happens? My flash no longer works. Out of the blue, just like that. I have had this camera for roughly one year. I do not bang it around either. So with the lens sticking and flash not working, I continued to take outdoor photos only (due to the no flash thing) and suddenly the battery will not re-charge. I am still in Europe with my husband and children and am beyond upset that I no longer have a camera that works.", "Date": "January 25, 2011"}, {"Title": "Broke after One Year", "Author": "In Search of Value", "ReviewID": "R3BMD69K57946J", "Overall": "2.0", "Content": "A year ago we bought this camera because we wanted a better and faster camera to take pictures of our then one year old.  I bought this camera mostly because I thought it would be quick and responsive.  It wasn't as fast as I wanted it to be.  It ended up needing more time to recover between pictures than was ideal for taking pictures of a toddler.  The picture quality was usually good but I often got blurry pictures because the camera wouldn't focus quickly enough to capture the moment I was trying to capture.  While it lasted I wouldn't say I loved the camera but I liked it and I was happy with it.  I bought this camera October 15, 2009 and on Halloween 2010 I pull it out of my purse to take pictures of my son at his Halloween parade and it doesn't work.  I turn it on and all I see is distorted blurred colors.  A couple of days later it was working fine again.  It worked through Christmas and then I pick it up from it having been sitting on a desk for a week and I see the same distorted colors.  Time for a new camera.  For this expensive a camera it should last longer than 1 year.", "Date": "January 12, 2011"}, {"Title": "Great in low light, fast, burst mode. BUT grainy picts and zoom not great", "Author": "caal", "ReviewID": "R1PSEXMTPXGTZ0", "Overall": "3.0", "Content": "I have been looking for 2 years for a digital camera that was great in low light and fast (as opposed to my canon sd1000). This camera definitely is fast. I took pictures around the house last night (after getting the camera yesterday morning) with the canon in one hand and the fuji in the other and the fuji was much more responsive. Also the pictures you've been seeing online that it takes are pretty much true. There are values and things in reflections that no other camera that I have tried has even come close to capturing. I've tried out and returned a lot of cameras because none met my expectations for speed, color quality, burst mode, low light quality and the flash(panasonic lx3, sony dsch7, canon g9, casio z90, nikon d40 and the canon sd1000).So compared to the other 5 cameras this one is much faster and better in low light without the flash. Even with the flash the pictures seem less white than they do with the sony or canons.However when you zoom in to view the pictures on the camera they definitely are grainy (good old fashioned film-almost grainy) compared side by side to the pictures taken immediately before or after with the sd1000. When you zoom in on the canon's pictures they get pixelly more of a rectangular distortion which i've seen with all the other cameras. The Fuji as i said are grainy and the zoom isn't as great as on the canon and at less zooming in the pictures still have that dottie distortion. I'm going to give it a couple of more days and take more pictures to continue to test it my real world. and then get them printed. but I don't see how with what I'm seeing on the screen that won't show up with printing.But overall this camera is definitely going someplace the other manufacturers haven't been yet as far as low light and speed but I'm worried about the graininess. Also another review mentioned it's noisy and it really is. It makes sounds constantly when it's on. A little annoying. They sound almost like branches rubbing on concrete or intermittent cat purring but there are sounds when you're not actually taking a picture and the camera is on. Bizarre.", "Date": "March 20, 2009"}, {"Title": "Disappointed! Not what it should be!", "Author": "J. D. Mitchell", "ReviewID": "R1FXYC0SIZI5R7", "Overall": "2.0", "Content": "I am very disappointed in this camera, as well as the F70EXR. I have done a side by side comparison with my son's older and less expensive Fujifilm F40fd. The image quality at any setting is vastly superior from the F40fd. This camera produces excellent image quality, but I don't understand why it is not nearly as good as the older camera.", "Date": "April 3, 2010"}, {"Title": "Fun while it lasted", "Author": "Robert M. Matthews", "ReviewID": "R3BHDNDBIPMR4H", "Overall": "2.0", "Content": "I've had this camera for about six months now.  I must confess it did take me a little time to understand the EXR modes but once I did I got some good shots.  And it took me some time to realize that the soft images I was getting was not due to an inferior lens, but the camera's preference for slow shutter speeds and small apertures.  When I used a tripod I got some really crisp images, but lugging around a tripod kind of defeats the benefits of using a compact camera.Anyway, I've got a little more than a thousand shots on it and it developed a hardware problem about two weeks ago.  When I turned it on the lens travelled all the way to it's maximum length and an error message appeared saying \"focus error\".  The lens would not retract when powered down.  All you could hear was a buzzing sound afterwards when either turning on or off.  I let it sit for a few hours and tried again, and it began working for no reason.  It functioned normally for about a week and then the same problem happened again.  This time it took almost two days of sitting on the shelf before it began working.  Same symptoms.The camera has never been dropped or abused. Or gotten wet.  I cannot trust it anymore and will not buy another one.  Time to buy a real camera, I'm afraid.Overall, I did benefit from the camera because it forced me to think about the choices it offers in exposure modes.  It makes you feel like an integral part of the picture taking process, and your decisions will make or break the results.  It is not, in my opinion, a good camera for those who seek an idiot-proof camera but will help you become a better photographer if you are willing to make the effort.", "Date": "March 21, 2010"}, {"Title": "Over-hyped", "Author": "miss teri parson", "ReviewID": "RCUYGMMP9Z59I", "Overall": "3.0", "Content": "Over-hyped, but what do you expect at this price range?  Good for day to day use...you know, taking 100 pictures of your kids doing normal stuff that you think is just so darned cute...like eating pasta or wearing a milk mustache.", "Date": "January 2, 2010"}, {"Title": "Great camera at a great price", "Author": "Nathan M. Rose \"Movie Guy from FlickDirect\"", "ReviewID": "R2QPG1A441TT6C", "Overall": "4.0", "Content": "These days cameras have really hit their saturation level for for megapixels. Unless you want to create a wall sized photo one really does not need a camera that does more than 12mp. Instead companies are now revisiting the features their products have -- and this little camera really packs a punch!. Now taking great photos with image recognition software is a piece of cake! The camera is simple to use and produces great photos time and time again. If you are looking for an everyday camera than look no further. The Fujifilm FinePix is what you are looking for!", "Date": "April 16, 2009"}, {"Title": "This is Truly Awesome", "Author": "Theresa M. Studer \"Terra57\"", "ReviewID": "RXXLVEMGEC8IG", "Overall": "5.0", "Content": "This is not my first digital camera but let me tell you it ranks right up there with my $800 Sony.  I'm still learning my way around with it but it does take the most beautiful photos and captures the true color better than most other cameras out there.I really like the fact that the view screen is good size especially for those that are like me and can't see half the time what you're doing if you don't have glasses on.  I don't really need the glasses with this screen.  YAY!It's size is extremely comfortable in hand and the buttons are placed in logical spots instead of reaching here there and everywhere to try and find them.  I was even able to figure out how to put the date in it before reading the directions.My expensive Sony is an SLR Digital and is bulky which those of you who have something similar can relate to.  I also have a Kodak  that I paid about $200 for maybe six or seven years ago and it's a bit bulky compared to the Fuji.The cameras instructions are easy to understand which makes using this a breath of fresh air.  If I were going to go out and buy a new digital camera tomorrow I would most certainly consider this one in the top ranks for it's all around easy and price.You get what you pay for and I'm sure this will last me just as long as my Kodak if not longer.  Oh and ladies, it fits in the purse nicely.  Carry and go.  Never know when you will need something to take that one precious photo.8/10/2009 UPDATE ~ I have been using this camera now for a few weeks and still find it takes wonderful pics.  My only drawback is that I like to shoot in Macro and this is really not the camera for that.  It does fantastic action shots as I found out this weekend with my three grandchildren visiting and was so nice not to have the motion blur that happens with a lot of other camera's out there.  Actually caught my granddaughter booping her little brother off the head with her Webkinz.  Ahh, nothing like being caught in the act and have the proof in the picture.  LOL!Also have not charged the battery in the month I have had this and it's still going strong.  Just need to get a bigger memory card and I will be in heaven for quite some time.", "Date": "July 13, 2009"}, {"Title": "Fujifilm F200EXR", "Author": "marvelus \"marvelus\"", "ReviewID": "R3EEKW4AWZPUXT", "Overall": "5.0", "Content": "Excellent camera.  Meets or exceeds my expectations.  Very user friendly.  Great quality photos", "Date": "May 24, 2009"}, {"Title": "Pretty nice camera for everyday use", "Author": "Valerya Couto \"LOTRsherlockHPFreak\"", "ReviewID": "R3C2NZLSQNS6WU", "Overall": "4.0", "Content": "I am not a photo person so I can't and won't get into the technical aspects of this particular camera. I was lucky to receive this for free and though we have a digital camera in the house, with a baby on the way, it was nice to have another. The megapixels (12) are great and for the most part, the photo quality is pretty darn good. Again, I am no expert, but for my use, I was perfectly satisfied. There are many different settings, some I haven't even gotten the chance to test out. It was a bit tricky at first to get into the swing of things since I found the menu to be a tad on the complicated side, but once I got used to it, it was no big deal. The camera is compact and sleek looking and feels comfy in my hands, which I really like.The image quality in low-lit areas was just mediocre. The other gripe I have is with the battery life. Personally, I found it failing very quickly. The last comment I have is regarding the price. At nearly $350, I felt it was a bit pricey and if I was actually looking for a 12MP camera, I still wouldn't pay that price, especially if I was interested in a better brand, like Canon where maybe it would be justifiable. But other than the price, I personally feel like this is a pretty good camera and does the job quite nicely.", "Date": "September 24, 2009"}, {"Title": "Very Poor Documentation and Support", "Author": "Cat Dancer", "ReviewID": "R2HCIGYC7IZVL", "Overall": "2.0", "Content": "Don't think I would recommend this camera because of the poor owner's manual / web site support. Can't find a phone number anywhere, so guess there is no one at Fuji to help. Most important failure is that the camera will not disconnect from my Mac. Supposedly an \"indicator light\" on the camera turns off, then you can turn off the camera and remove it from the USB port. There are dire warnings in the manual and online not to remove the camera if the light is not off, but nothing to tell you what to do if the light stays on. Since this is such a basic procedure, to not have better documentation causes me to rate this camera very low.", "Date": "December 28, 2009"}, {"Title": "Great for an experienced photographer, camera didn't last, HORRIBLE service", "Author": "David Anderson", "ReviewID": "RAB653IADQ3OU", "Overall": "1.0", "Content": "Loved the camera.  but a few problems:1. My wife hated it, she couldn't figure out how to use it2. the zoom stopped working.  it was very touchy and impossible to use3. after about 8 months, the screen went outI sent it to Fuji Repair with my receipt (it was in warranty) and detailed both problems.  I heard nothing for 3 weeks, finally got an email from them saying they received my product.  Two weeks later was an estimate for $115.  They said there was a scratch on the exterior and an \"impact\" in the lower right which voided my warranty.I tried to call and explain that 1. I don't ever remember dropping it and the 2. neither of the problems were a result of me dropping it, but they said it didn't matter because any scratch like that would void the warranty.I've never had those problems with Canon.  I'll spend that $115 on a different manufacturer.", "Date": "September 21, 2010"}, {"Title": "Not a good portable point and shoot camera", "Author": "Shashank", "ReviewID": "RFNFY75MVTAKF", "Overall": "2.0", "Content": "I am a SLR photographer and wanted a point shoot camera for portability purpose, so that I can carry it when I'm busy n can capture moments. But the clarity and ease of use the cam is below standards even with a huge sensor size. I would recommend any canon camera @ same price range for this FujiFilm camera.", "Date": "December 19, 2009"}, {"Title": "Don't bother with this camera!", "Author": "Coffeegeek", "ReviewID": "R3Q6AEL7I74CKS", "Overall": "1.0", "Content": "I received this camera the day it became available for purchase in early August. So far I have not been impressed with it. I'll keep the review to the point instead of rambling on.1) This camera sucks as a camera to hand to someone unfamiliar with its function, and expect a decent photo. In EXR mode, with the dual flash firing, most people move right after the flash fires the first time, leaving slightly out of focus shots for you. To work around this, you have to kill the moment while you fiddle with menus and submenus setting up for a shot.2) The flash sucks. My brother has Sony DSC W230 slim pocket cam that has a smaller flash that works ten times better. Proof of this is in the shots you take that require a flash ( most indoor shots) since on the Fuji, the flash is located on the far left side of the camera, you get a nice shadow border on the right side of all your friends and family members who might be within 12 feet of a wall. Thats bunk! I've tested it over and over. It happens, trust me.3) The shutter release is way to far over to one side making it a pain to use for anyone with larger than normal hands.4) The flash is right underneath that button, meaning its really, really easy for you or someone else to accidentally cover the flash with their hands while taking a photo.", "Date": "September 28, 2009"}, {"Title": "Cheaply made camera, too many problems", "Author": "Sunwing", "ReviewID": "RDU7HK1LH0NXB", "Overall": "2.0", "Content": "I've had this camera for a year and am really unhappy with it.  About a month after having it, the zoom started to malfunction and would only zoom all the way out or all the way in.  Then the lens cap wouldn't close all the way; I sent it back under warranty and they only fixed the lens cap issue because they said they found some kind of sticky substance around the zoom and I was negligent. Then a month ago on a trip the camera was dropped from a height of about 6inches.  It broke the camera for good, and now the zoom is stuck out and won't take pictures.  Granted, the camera was dropped, but I had an Olympus for about 6 years, treated it worse than the Fuji, and it held out much better.  I ended up giving that camera away to someone; wish I kept it afterall. I will never buy Fuji again; this camera just didn't hold up to a little bit of rough treatment, and for the $315 I paid at the time, you would expect a more solid made body.  I bought this camera because of its video and image quality in low light, and I was disappointed anyway.  Low light photos were mediocre, and the video image quality was decent, but the audio was so low you could barely hear what was being recorded.", "Date": "August 8, 2010"}, {"Title": "FUJIFILM FINE POX F200EXR", "Author": "PROUD AMERICAN", "ReviewID": "R3L9HH1DB253S9", "Overall": "3.0", "Content": "I RESEARCHED CAREFULLY AND DECIDED THAT THIS CAMERA WOULD BE WHAT I WANTED FOR MY PURPOSES.  IT IS SIMPLE TO USE, ALL CONTROLS ARE INTUITIVE, IT IS SHIRT POCKET SIZE, AND HAS MACRO SETTING.. IT WAS EVERYTHING I EXPECTED IT TO BE EXCEPT THAT WHEN IT IS DIPLAYED ON TV, THE PICTURE IS GRAINY ON ANY SETTING AND VERY DISAPPOINTING ESPECIALLY WHEN I SEE FINE DISPLAYS FROM A MUCH CHEAPER KODAK EASY SHARE.. I DOWNLOADED THE SOFTWARE FROM THE DVD AND FROM THE WEBSITE AND IT HAS NOT FUNCTIONED TO DISPLAY A PICTURE YET.  A CAMERA IS PURPOSED TO CAPTURE A SHARP PICTURE SO I SHOULD HAVE CHECKED ON PICTURE QUALITY FURTHER.  NAIVELY I THOUGHT ANY CAMERA TODAY WOULD GIVE A DECENTLY SHARP PHOTO.  LIVE AND LEARN", "Date": "November 14, 2009"}, {"Title": "good medium priced camera", "Author": "Jon Norris", "ReviewID": "RFHN94IZH2U1J", "Overall": "3.0", "Content": "This is  a good mid priced camera for people who want to go beyond just point and click. It has many outstanding features, and a few negatives. First, the positives:12 megapixels - this is high enough resolution to suit most non-professional needs quite well. In fact, some might say it is overkill for day to day shooting. You can easily create 16x20 inch prints from this resolution, and probably go much larger for non-professional tasks. (I have done 16x20 inch  prints from 2 megapixel images that were quite adequate for my purposes.)Large LCD screen - again, it is large enough and high enough resolution to be very functional except outdoors in bright sunlight, where it is way too dim to be easily used. LCDs in general fall down here, but more on that in the negs.Easy to use - the menus and functions are easy to use and access - when choosing the programmed modes, for example, each turn of the dial brings up a description of the function on the LCD screen - very handy. There is also a handy zoom function when viewing pictures which uses the same zoom controls as picture taking - nicely consistent.Fast and responsive - for a digital camera, it takes pix and moves from function to function pretty quickly, although not as quickly as a film camera (which is a problem of all digitals to date, at least at the lower end of the product lines).Lens stabilization works reasonably well, which is nice for a small camera that is hard to hold, especially on maximum zoom.Rechargeable battery is removable and can recharge outside the camera. This is great because you can buy extra batteries and not be limited by running out of power (a certainty with this small a battery).Now the downside. There are many things I don't like about the camera.First, I don't like proprietary batteries. If you want to use rechargeables, you can get them in standard battery formats. This limits one's battery choice in the field, and strands one if there is no way to recharge. I think that creating thousands of proprietary battery formats ends up contributing far more to landfills than using standard sized battery formats would do. It also requires the owner to purchase expensive batteries for spares which can only be used in one piece of equipment. From the aspect of customer convenience as well as good engineering and use of resources, this is simply a bad idea, period. At nearly $40 per battery (about the size of a Compact Flash card), it is also way, way overpriced. For that price, you can get a charger and at least 4 AA sized batteries with a lot more storage capacity.Lens cover is very flimsy and easily defeated. A gentle touch will open it up, and it is made of such thin material that it would not protect the lens from much of anything. It is so bad it is probably a wasted effort.Zoom is only 5X. While the zoom range is adequate for most shooting and favors more of the wide range than most cameras (a plus), I would like to see a bit more on the telephoto end.It is not significantly smaller than the Canon A720IS which has been my camera of choice for over a year. The Canon has a bulge for the larger AA batteries, which is actually nice because it makes it easier to hold, although harder to put in a pocket. Of course, with the terrible lens cover, the Fuji would not be safe just tucked in a pocket, anyway. I guarantee that will get you lens damage sooner or later.The Canon also has an optical viewfinder (although without diopter correction) which makes it far easier to use in bright light, if you have glasses, or if you want to conserve battery power and turn off the LCD. The Canon will shoot 3-4 times as many pictures on a set of Nimh or good alkalines as this Fuji will on one charge of its battery. I use lithium instead of regular alkalines, as they last 4-6 times longer, perform better, and have a better shelf life (as well as being easier on the environment). I am in the process of converting to rechargeables with lithium for backup for all my cameras. A set of lithium AAs in the Canon can last me over 6 months or over 1000 or more pix. This Fuji can't even come close, with only about 140 pix per charge, depending on zooming, flash, etc.The movie mode on both cameras is enough the same to make the comparison a wash. The Canon also has an LCD which is brighter and more easily viewed in bright light. On one sunny day when I was doing side by side test shooting, I could readily use the Canon in sunlight which made the Fuji totally unusable, even shading the screen.My overall recommendation is that unless you desperately need the 12 megapixels in a slightly small camera (about playing card deck sized), I would  still choose the 8 megapixel Canon A720IS over this Fuji (they are about the same price as I write this). For me, the difference between 8 and 12 megapixels would not be enough to choose the Fuji, and the battery/screen combo would be a definite deal breaker.This Fuji is a nice little camera, but it has just enough drawbacks to make me think twice, especially up against the Canon. I haven't tried any of the Canon models closer in resolution to this Fuji, so there may be even more to recommend them.", "Date": "April 8, 2009"}, {"Title": "F31 still better at low light...", "Author": "Trevor Goodchild", "ReviewID": "R3BIVTSPW2XQ9X", "Overall": "4.0", "Content": "The low light on this guy is not as good as my beloved F31, but I like the camera very much and plan to keep it.Has anyone else noticed yellow-blotches in the EXR mode?", "Date": "March 9, 2009"}, {"Title": "Beware of Simply Electronics", "Author": "Stephen Herman \"Shocked customer\"", "ReviewID": "RTJ13CCGLVMCZ", "Overall": "1.0", "Content": "I ordered the Fujifilm 200 EXR from Amazon. They arranged for Simply Electronics to ship it. It came with a 220 volt plug (I live in the USA, 1210 country). There is no return address on the invoice, not even the item ordered or the price paid. This seems to be a gray market outfit. Beware!", "Date": "February 14, 2010"}, {"Title": "No zoom in movies and very short battery life", "Author": "Morrigan Alexandros \"The Opinionated Me\"", "ReviewID": "RP8L4VRWCSB2X", "Overall": "4.0", "Content": "The GoodThe Fuji F200 is a very good point and shoot. The camera has a nice big screen and helpful features such as red eye reduction, cropping and resizing. The camera takes excellent sharp pictures and it is relatively compact. It is a simple point and shoot and it does have a very sharp portrait mode.The BadAlthough compact, the camera is a bit heavy. The screen smudges way too much, whereas my previous Olympus or Cannon did not. The pictures are a bit grainy and yellowish indoors and in low light. Sometimes, the camera takes a great indoors picture and sometimes it does not. No matter that I am in the same position and pointing at the same object within 5 second intervals. Basically, the auto mode is hit or miss. The EXR mode is noisy (literally) and this becomes annoying pretty quickly.The UglyThe camera does not run on regular batteries. Instead, it comes with a battery pack and a charger. I find this very annoying because if you ever run of battery life, you cannot just replace the batteries with good regular batteries unless you had a spare battery pack (that's about $30-40).Adding to the annoyance, Fuji has combined the USB cable with the AV cable. The result is a bulky and annoying cable.And as a last straw, you are unable to zoom in and out while in movie mode. You are stuck with the zooming level you selected at the beginning of the movie.ConclusionI would get another camera. A Canon PowerShot is better than this.UPDATE 9/17/2009 The battery, fully charged, lasts only 2 days of medium to heavy use (no videos recorded, just pictures). So, if you go on a trip, like I did, be sure to bring the charger. I had to charge the battery every other day. Sometimes, if would not be last the full second day.", "Date": "March 25, 2009"}, {"Title": "Arrived Defective", "Author": "N. David", "ReviewID": "R2MDMKE7OU05IO", "Overall": "1.0", "Content": "I bought this camera new, it came properly packagedWhen it was put on, no picture on screen only fuzziness, not able to see anything.Screen looks like a TV screen with no picture signal.Fujifilm FinePix F200EXR 12MP Super CCD Digital Camera with 5x Wide Angle Dual Image Stabilized Optical ZoomVery disappointed that camera was not built robust enough to handle shipping transit.", "Date": "October 7, 2009"}, {"Title": "Dissapointment", "Author": "Evangelos Kaparis", "ReviewID": "R2XL6EJRX4H811", "Overall": "1.0", "Content": "This camera is a huge let down.  The flash is so weak and pictures are so grainy indoors i find this camera totally unnaceptable.  The EXR mode is so noisy hearing the camera click and clack... My Canon SD880 was a much MUCH better camera....", "Date": "March 10, 2009"}], "ProductInfo": {"Price": "$349.95", "Features": "12-megapixel Super CCD EXR\n5x wide-angle, dual image stabilized optical zoom\nEXR Auto function; Dynamic Range Bracketing; Face Detection 3.0\n3.0-inch LCD screen; HD photo capture\nCapture images to SD/SDHC/xD memory cards (not included)", "Name": "Fujifilm FinePix F200EXR 12MP Super CCD Digital Camera with 5x Wide Angle Dual Image Stabilized Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51a57QCH48L._SX300_.jpg", "ProductID": "B001R23JMQ"}}