{"Reviews": [{"Title": "Good for what it is..", "Author": "Lon J. Seidman \"lon@ lon.tv\"", "ReviewID": "RBBHE8PML0GSJ", "Overall": "3.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_29381651embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_29381651refresh_preplay() {\n\ndocument.getElementById(\"cv_29381651chiDiv\").innerHTML = document.getElementById(\"cv_29381651hiddenPre\").innerHTML;\n};\ncv_29381651refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_29381651so;\t   \n\n\nfunction cv_29381651loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_29381651so = new SWFObject(swfLocation, \"cv_29381651AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_29381651so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_29381651so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_29381651so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_29381651so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_29381651so.setAttribute(\"height\", swfHeight);\n          cv_29381651so.setAttribute(\"width\", swfWidth);\n          cv_29381651so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_29381651so.write(\"cv_29381651flashcontent\")) {\n          fp_resizePlayerSpace('cv_29381651', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_29381651';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_29381651', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_29381651loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_29381651\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2C6WJN0N4QO11\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2C6WJN0N4QO11\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RBBHE8PML0GSJ\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2C6WJN0N4QO11/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_29381651duration')) {\n      document.getElementById('cv_29381651duration').style.display='none';\n    }\n    cv_29381651loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_29381651loadSwf(movieID, playerVersion) {\n   return _cv_29381651loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_29381651newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_29381651', 0, h);\n}\n\nfunction cv_29381651resetPlayer(w,h,bw,cc) {\n  cv_29381651newHeight(h);\n\n  cv_29381651so.addVariable(\"resetBandwidth\", bw);\n  cv_29381651so.addVariable(\"cacheCode\", cc);\n  cv_29381651so.setAttribute(\"height\", h);\n  cv_29381651so.setAttribute(\"width\", w);\n  cv_29381651so.write(\"cv_29381651flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_29381651RollOverImg = new Image();\ncv_29381651RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81hGenkq0hS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_29381651preplay = document.getElementById('cv_29381651preplayImageId');\nif (cv_29381651preplay) {\n  cv_29381651preplay.onmouseover = function() {\n    cv_29381651preplay.src = \"http://ecx.images-amazon.com/images/I/81hGenkq0hS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_29381651preplay.onmouseout = function() {\n    cv_29381651preplay.src = \"http://ecx.images-amazon.com/images/I/81hGenkq0hS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_29381651preplay.parentNode;\n\n  var cv_29381651currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_29381651currentClick) {\n      return cv_29381651currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:40 MinsThe Swann BlueAlert is a good product, not a great one.  It does a lot for its price range and unlike other inexpensive security products it's completely self-contained.  It does not require a computer to operate.  My video review has footage from the device so you can see how it operates in the real world.", "Date": "November 20, 2008"}, {"Title": "Lower quality DVR best used for purposes other than security", "Author": "Sparky Jones", "ReviewID": "R1BMEJ9S9DZ99O", "Overall": "2.0", "Content": "The short:  A security camera DVR (term used loosely) best used for watching the status of various things such as open garage doors, weather, etc, where video quality isn't as necessary.  It could be used as a game camera too, or it maybe useful as a sentry in cubicle warfare.  ;o)The long:  This DVR/camera system will not be useful for most people seeking home or business security.  That said, it is not completely without merit.It is advertised as a combo video or picture recorder.  It allows for a wired or a wireless camera.  As far as setup, the interface is clunky and archaic looking.  I set up the wireless camera in an office, as well as aimed out at a yard, to check the different results.  I was not too impressed.  Movement is recorded in short video clips averaging about 300k per file.  Snapshots can be low or 'higher' resolution, up to 640x480.In an office environment, the video files are good enough to identify someone within 8-10 feet.  Any distances longer than that are distorted beyond recognition.  The camera faired somewhat better aimed outside due to the improved lighting.  However, the included camera has a somewhat narrow field of view and presents the observer with only minimal details.The kit does come with a video cable that allows you to choose your own wired camera if wish.  So I used a color bullet camera (around 380 resolution) of my own and aimed it in the same area where the wireless camera had been pointed.  The image quality improved quite a bit, as did the field of view.  I posted 'before and after' snapshots to the product description on Amazon.PROS:* It can use higher capacity SD cards, so access to the unit is minimized.* Video input cable allows user to choose wired camera input.* Wireless option allows more freedomCONS:* Wireless camera quality is awful.* Clunky setup interface.* Resolution of videos is very low.* Camera doesn't look like it would last in elements.RECOMMENDATION:For anything other than novelty, I would not recommend this setup.  I do not feel it qualifies as a 'security system'.  If you are interested in game watching, weather, or something like that, it would be OK.", "Date": "October 27, 2008"}, {"Title": "Can't be taken too seriously but does have some merit.", "Author": "M. Erb", "ReviewID": "RNAO5X00PM58I", "Overall": "2.0", "Content": "The Swann BlueAlert Security Kit is described as a \"Movement Video Recorder. Records movement while you are away or distracted.\" Technically that is accurate. Realistically, the movement that is recorded is fuzzy with lots of compression artifacts and unless your subject is in well-lit areas and about 6 feet or less from the camera, it is  unlikely that you will be able to easily identify the person in the captured movies or still images. Since my review is rather lengthy, I'll give my overall impressions up top and you can read on for more detail.Overall I was not greatly impressed with this device. I'm not sure how much you should expect at this price point, but if you truly need a security solution, then you'd be better off spending more money on a device that is going to provide better video quality, better menu navigation, simultaneous recording of multiple cameras, more robust storage capability and better build quality. As it is, this is a \"fun\" unit to fool around with and perhaps use as a remote door monitor, or non-critical monitoring of some other inside or outside area. I'm pretty sure I would not want to rely on it as a true security device. I can definitely see some applications where it would be adequate however and for not a lot of money either. I do like the fact that I can pop the SD card into my computer and easily transfer over the images and video.Pros:-Compact size doesn't draw a lot of attention to itself-Video quality is OK for non-critical applications-Easy to setup-Easy to transfer captured video and images to your computer.Cons:-Cord lengths or power supply and video connections are too short to be very useful-Video and Still image quality are not very good. Lots of compression artifacts-Camera claims to be weather resistant but power cord coupling is not protected from the elements nor is the camera speced for temperature below 32 degrees F.The \"kit\" is shipped in a clear plastic container with the following...-BlueAlert DVR (Digital Video Recorder)-Antenna-DVR power supply-Wireless Outdoor Camera (WOC)-WOC power supply-Wall Mounting hardware for WOC (3-screws and 3-wall anchors)-128MB SD card-Video out cable-Video in cable-RCA to BNC adapter-Easy Setup Guide (English)-Instruction manual(s) (English, French, Spanish)-a package of security warning stickersInitial setup is quite easy. The SD card is already inserted in the DVR slot when un-packaged. All you have to do is to plug in the DVR power supply to the wall and attach the other end to the DVR. Next you need to connect the DVR video output to your TV by using the provided Video cable. It is only about 3 feet long so you don't have much flexibility in placement with the provided cable.The Wireless Outdoor Camera can be used indoors or outdoors. The provided power adapter cable is short and will severely limit your camera placement options unless you use an extension cord. Furthermore, the coupling that connects the camera to the power supply is -not- weather resistant so would need to be protected for outdoor applications.The Camera and DVR operate on the popular 2.4GHz spectrum which is also commonly used for cordless phones and many Wireless Computer Networks. Consequently it is quite likely that you will experience interference, depending on placement, which could possibly disable your wireless network or cause video quality issues. Fortunately the device has 4 channels available and channel 4 was the only channel that would work in my house without disabling my wireless computer network. In order to change the channel frequency of the camera you must remove the front bezel of the camera by hand and then use a paperclip or very small screwdriver to gingerly move two tiny switches to the appropriate position. You use the same technique when adding additional wireless cameras so each camera would be operating on a different channel.I did not feel the menu system was very easy to use. I'm quite technically savvy and I had some initial confusion as how to change some of the settings. In fact, I am convinced that the unit I have is not retaining or recognizing some of the settings.When setting up the camera you have several options regarding the size of the area that will be monitored for movement as well as the sensitivity of responding to movement with the defined area. Essentially you have 3 size choices: full frame, half frame, quarter frame and then you can move the frame to the area of the screen that you want to monitor. For instance if you had the camera setup outside and a busy street was also in the view, you theoretically choose a smaller area to monitor and then position that area \"away\" from the constantly moving traffic. Automatic recording would only begin when motion occurs inside the area you specified. In effect you are ignoring the moving traffic whereas if you had the full frame set up for movement detection, then the traffic itself would be setting of the recording all the time. In addition you can theoretically determine the movement threshold that will determine when the DVR begins to record. I did not have much luck at all with these settings.  Different settings did not seem to affect the recording sensitivity in my usage and it seemed that the settings, particularly the size of the monitored area were not being retained.The DVR is quite small... 3.5 inches deep and 5.25 inches wide and just under 1 inch tall. The on/off switch is located on the back. The top of the unit contains the other buttons for menu and display functions. There is also a LED on the top side that indicates when recording is taking place. The SD slot is on the front side of the unit, as is a button that selects which channel is being monitored, 1,2,3 or 4. A corresponding LED on the front panel indicates the selected channel. If the unit is turned off, then you will to reslect the desired channel unless you are using channel 1 which is the channel selected by default when the unit is turned on.The menu options enable you to set the date and time, choose capture format (AVI or photo) and whether you want motion detect on or off. The setup menu lets you choose between NTSC and PAL for TV output, what quality setting you would like for images (High or Low), motion detect area, motion detect sensitivity, motion detect count (how many photos are taken in each interval, 1, 3 or 5) and motion detect interval (how much pause must be between motion events before capture begins again, 1,3 or 5 seconds)The DVR automatically creates folders for each day during which recording takes place. The folders are easily accessed via the menu buttons. You can also singly delete video and images or delete them all at once. You cannot pick some to delete and leave others however... it's all or one.The DVR can have up to four wireless cameras attached but will only record one camera at a time and that is determined by which camera is selected. There is also PIP (picture in picture). When using PIP, the DVR will only record the camera in the full screen viewThe DVR has 16MB of built-in memory (the Swann website and Amazon description erroneously state that the DVR has a 16MB hard drive) and the SD can handle a maximum card capacity of 2GB. This will hold many many hours of video and photos however. If the card or onboard memory is filled to capacity, the DVR will continue recording by recording over the oldest data first. The DVR only records 10 seconds of video during each recording event and this is not adjustable.", "Date": "October 24, 2008"}, {"Title": "Basic, but effective", "Author": "Mary S.", "ReviewID": "RRE5LXW0ZDHMJ", "Overall": "4.0", "Content": "I have enjoyed having this camera.  My electric company's meter reader likes to leave my iron pool gate unlatched and ajar and I have sent several warning letters to them about putting me in a position of liability with my swimming pool.  This nifty gadget has now provided me all the evidence I would need if (God forbid) some youngster wandered into the swimming pool.  It also allows me to keep an eye out on my garage area for anyone wandering around or if I hear a noise, I can flip over to the input channel and check it out.  I have no windows facing this area, so it has become my \"eyes\" for that side of the house.There are some notable kinks, though.  For instance, it's not really wireless when you have a rather substantial power cord that has to be plugged in somewhere, so you will be limited as to where you can install this item.  The signal to the DVR is wireless though and that's nice.  Also, the image quality could be better, but it is sufficient for my purposes.I'm not sure how durable this item is outdoors completely exposed to the elements.  I have installed mine in a semi-protected area under the eaves of the carport and the outlet plug is covered, as well.  I cannot attest to how well this would perform with no weather protection outdoors.  It seems to be performing fine in my circumstances.I find the DVR very easy to use and I like that it is so small.  I also like that that the camera is so small. Where I have installed mine (against a dark corner) it's hard to spot and I like that.  I had been in the market for a security camera for some time and for the money, I feel this is a good value.  I have yet to suffer the interference that others are talking about, but I will update this review if anything goes awry.", "Date": "November 26, 2008"}, {"Title": "revised: 1 star, piece of crap", "Author": "A. Boston", "ReviewID": "R33M1RYHPTPZVK", "Overall": "1.0", "Content": "Sept '09: I went to review some 'footage' from this. Turns out, all the stills are black, or fuzzy grey lines thru jet black with no images. I put it in a different location and fiddled around, testing different modes etc on the recorder. The camera and recorder were about 2 feet from each other. Same thing. Black stills on my SD card even when I set it to do AVI instead of JPG. It works to transmit and watch live on TV, but otherwise useless junk.Original review: I was excited to receive this, I've always wanted some kind of surveillance or security system. A couple years ago my apartment was robbed and I have to say, it has made me one of the most paranoid people around despite moving to a different town since. Every time I leave, I leave as though someone will be breaking in and I hide stuff(in a different location every time, to my own detriment, I can never remember where I put stuff!).Thanks to this little system, I've been feeling a little more confident when I leave the house. The system comes with one wireless, motion sensor, 'nighthawk'(which means it has night vision) camera, one dvr set up which tapes internally I believe and also to an SD card(a 128MB SD card comes with it), and the cables to hook it up to a TV, as well a some other cables I haven't figure out the use of yet. Lastly it comes with some stickers for your windows or doors saying the house is under 'swann surveillance', which I slapped up immediately.Lets start with the set up. I'm very tech savvy and rarely have to read a manual. I'm usually very intuitive as to what goes where and how it works. Unfortunately for me, I found the manual useless when I couldn't get the picture up on my tv. So that made this product lose a star for me. I got the camera and dvr plugged in to a power outlet no problem. It took me about 30-45 minutes to figure out how to program the dvr and make it viewable on my tv(which helps you see the angle you have). After fiddling around with the wires in different plugs, and pressing buttons on the DVR, a picture miraculously came to my screen. I live in an old new england house, so the rooms here certainly aren't huge. The camera is in a room about 12x12. It's not super clear, but enough where you can make out the prominent features on a person. If it was farther away, it would be a lot fuzzier. If they're wearing a hat it could prove a little more difficult. It's a black and white camera, and in night vision is also a weird version of black and white, so with a hat a dark shadow tends to be cast over a person's face. I think it will also depend on the angle of the camera -- I set mine up pretty high on top of a window frame, so it's looking down. If it were lower pointed up, there may not be a hat/shadow issue.So far it's working well. I've pondered getting more cameras, but due to the manual being terrible, I cannot tell if it will work with another wireless camera or if will only take one more wired camera. You can adjust it to different motion sensitivities, but so far I don't know if a high # is a low or high sensitivity, because the manual doesn't say. I have pets and wanted to set it up so it doesn't recognize them. Eventually I'll get to figuring that out. But as the card fills up it overwrites the oldest files and if its just day to day it wouldn't be a problem. Plus I obviously walk by a lot..so it's going to turn on for that. If you were to go away for a vacation you'd want to set it up with a larger SD card(it will accept up to 2GB) and figure out which motion sensitivity works best for you. I also plan to disconnect the dvr from the TV and put it somewhere less...find-able. Because if someone breaks in and finds that and takes it with them, you'll be completely out of luck.", "Date": "October 29, 2008"}, {"Title": "Merely Fine", "Author": "Douglas Figueredo", "ReviewID": "R3J7MVF2J0T330", "Overall": "3.0", "Content": "I agree with pretty much all of the current reviews on this product.  I actually don't think that the video quality is that poor for what the product is suppose to do.  You should not expect camcorder quality, but I don't think that  is really the point here.  The strength here is that it is easy to quickly review the video that has been recorded because you just pop out the card and put it into your computer.  If the resolution was higher then the file sizes would be bigger and it would take longer to load the video, etc and that would be a hassle.The biggest drawback for me is that the power cable for the camera is so short and can prohibit where you put the camera.  This might be bad if you want to hide it in a book shelf of something and there is no plug nearby.  Then you'd have to use extension cords and that could defeat the stealth nature of security cams.I did play around with connecting it to my sling box and that worked for live view on my computer - so that is an option if you already own this.  Otherwise, you might want to step up to something more professional.Middle of the road - not bad, not complicated, but not cutting edge either.", "Date": "February 11, 2009"}, {"Title": "not bad, but not good enough", "Author": "K. Lin \"yesuaini99\"", "ReviewID": "R1PD2RPNZCRXT0", "Overall": "3.0", "Content": "Just briefly:1. the infrared sensor is not good, sometimes it doesn't sense anything, sometimes too sensitive2. recording quality is not good, especially if dark lit, (but isn't that the situation when we need good quality to see the \"intruder\"???)  So the product is a bit self defeating if the recording is not up to par in dark lit situations.3. cable not long enough for the video unit.  I wish they had used the power over ethernet power adapter (if there is such a thing) so the cam unit is not dependent on the adapter cable which is never long enough for an outdoor/patio application.Overall, it's not a terrible product, but for some serious security, I'd consider a more suitable system that's build for that purpose.", "Date": "December 11, 2008"}, {"Title": "Some flaws, but still a good alternative to expensive secutiry cameras", "Author": "Dmitry Kristal", "ReviewID": "R19PK9DOXSH7J3", "Overall": "4.0", "Content": "The Good:* A good alternative to expensive security cameras* Simple Menu to adjust date, time and sensitivity* Keeping data on SD card is a convenient option* Records in the darkThe Bad:* Not as wireless as you might think* Picture quality could be better* Occasional interference and scrambled pictureThe Bottom Line:This cam was installed for a small warehouse.  While it claims to be wireless, you would still need a power supply for the cam itself, while the blue box is connected to the back of your TV.  Picture quality is mediocre at best--Do not expect to see faces clearly.  Sometimes upon reviewing the SD card, the picture is jumbled up for few minutes or so(possible due to cable interference.)  While this occasional nagging problem may not seem like a big deal, it could be a big deal if it happens during an important moment when you need this cam the most.  Also, please keep in mind that this cam comes with screws, so you need to use power drill to attach it.  However, we used heavy layers of heavy-duty tape instead to keep it mounted on the wall.  Therefore while this could be a good potential alternative to expensive equipment, be aware of occasional quirks.  Also if you are looking for high-quality resolution, you may want to look elsewhere.", "Date": "November 18, 2008"}, {"Title": "Passable as a security device but not comparable to professional or even high end home security", "Author": "FirePepper Red \"firepepper red\"", "ReviewID": "R3I8N24K8Z42DK", "Overall": "2.0", "Content": "The Swann BlueAlert Security Kit is a great idea but it is marred with flaws.  The installation is very straightforward  but the wireless connection between the camera and the recorder is subject to a lot of interference.  Everything from microwave ovens, wifi networks, even cordless phones will interfere with the Swann security system.  Switching the camera to channel 4 (using the fussy dip switches) decreases some of the interference with wifi but microwave ovens still cause the Bluealert to break up.Even under ideal conditions (with all appliances in the 2.4ghz range turned off) the Swann still showed some degree of interference though much less.Swann recommends repositioning the camera and receiver to get the best signal reception.  I tried this but it was an exercise in frustration.  Finally, by accident, the receiver fell off short stand and was dangling near an small indoor FM antenna.  The reception improved dramatically (though it is still has the occasional interference).  I have left the DVR in that position and it has provided acceptable results.One big problem is that the Swann system uses a software based motion sensor.  The sensitivity and area to be monitored can be changed through the menus but no matter how much I fiddled with the settings, I was unable to have it record only when something moves within the intended area.  I think part of the problem is that the software interprets interference as movement so the recorder starts recording at odd times.  You will end up with a lot unnecessary photos if you use the motion sensor.Another issue is that despite Swann's claims that the camera is made for outdoor use, the power connector is made strictly for indoor use.  There is no mention in the instructions about how to make the connection water tight, though I used some electrical tape to ensure that moisture would not get into the connection.  The mount for the camera has a limited degree of motion so you must mount it carefully to be able to view the exact area you want.  The camera cannot be mounted from a ceiling or else the photo/video will be upside down.Apart from that the camera provides reasonable quality video and photos.  Daytime shots lack color but are about what you expect from a security camera which means not adequate for printing photos but more than sufficient for security use.  The night vision is OK but doesn't have much range.  It does allow you to see in total darkness but only within a couple of feet (5-8 feet maximum)  Of course if you don't expect any miracles, then you will find that the camera is adequate for day and night surveillance.*** Positive Points Include: ***- Small Size- Acceptable picture quality for a security camera- Easy to use and navigate menu system- Comes with everything you need including cables and window stickers- Automatically records over the oldest photos/videos when the card is full- Antenna is removable so you may be able to improve your signal by fitting a larger antenna (though I have not tried this)- Can accept a wired camera which may provide better quality video*** Negative Points Include: ***- Too much interference from other 2.4 Ghz appliances- Limited range- Though it accepts connections from 2 cameras, it will only record one- Limited movement of camera mount- Camera power cord is not rated for outdoor use- Receiver/ Recorder is only average quality... it works but doesn't impress with its construction- A/V cables and power cables are really short- Both camera and receiver get hot to the touch during use- Software motion sensing is not effective... it is too sensitive during the day and not sensitive enough at night (even after adjusting it to its maximum settings).- The receiver does not remember the channel setting so if you switch it off you will have to select the proper channel for it to work again (not difficult but just inconvenient)*** Overall ****Unfortunately the Swann Bluealert has a lot of issues that decrease its usefulness. It will do an acceptable job if you can limit the 2.4ghz interference and you are able to place the receiver in a \"line of sight\" view of the camera, but for most home uses its performance is severely limited.  If Swann can make the next generation of this product use a digital signal that is not prone to interference and a higher resolution camera, they will have a real winning solution, until then this unit has severely limited applications.", "Date": "October 29, 2008"}, {"Title": "Keeping an eye on things while you're away", "Author": "Evan Jacobs", "ReviewID": "R1DYSBP2C73CJI", "Overall": "4.0", "Content": "This little unit is easy to set up and works pretty well.  I wish I had the infra-red camera but in lit areas the camera I have is just fine.  When I first set the unit up, it crashed my wireless network.  I was concerned that it was creating interference so I changed the wireless channel the camera was using (easy to do) and then everything was fine.  I suppose I might have a problem if I wanted to use all four cameras, but it's fine for now.  For a home security system or keeping an eye on your housekeeper this could really do the trick.  Everything gets recorded to an SD card and the whole thing works like gangbusters.  The image quality isn't great but it's better than I'd expected.", "Date": "October 27, 2008"}, {"Title": "Back to the drawing board", "Author": "D. Johnson \"Chi-Town Dale\"", "ReviewID": "R2CVA75D2OFF8D", "Overall": "1.0", "Content": "I had high hopes for this product. I have been using wireless cameras for a number of years now and thought this would be a great addition to my collection.Unfortunately it isn't.It has a very high price for just a single camera. For the price of this single camera, I have purchased entire security systems.For $170 you can purchase an X10 security system including 3 cameras, a color TV Monitor, motion detector, hookup to your VCR that will only record when motion is detected. All cameras have built in microphones so you can listen as well as see.You can upgrade for a little more to a zoom, pan and scan type of camera which allows you to either manually pan your property or rooms in your house or program it to pan the area on a continuing basis. If you see something, you can stop panning and zoom in for a close up look at what caught your attention.With motion detection you can record whenever anyone approaches your home in your VCR for later review without wasting tape when nothing is happening.The picture transmission is crystal clear and it works in hot or cold weather, unlike the Blue Alert which only will work indoors unless you live in Southern climates.The Blue Alert also seems to suffer a great deal from interference from other electronic equipment. I can't put it anywhere near my computer and get a picture that is not so full of snow that the place you are looking at is virtually invisible. Since I have so much wireless equipment, microwave ovens, wireless telephones, cellphones, satellite TV with controllers that transmit signals to TV's in other rooms of the house there is a storm of electronic signals flying around my house all of the time. The Blue Alert can't compete with these signals, even in the middle of the night.So this is nowhere near as good as other systems I have used. That is unfortunate since for the price that is being charged for it you can get 3 cameras with sound that will work indoors and outdoors. For $60 more, you can get 3 pan, scan and zoom cameras with color monitor or you can just pipe the signals direct to your Television and take the cost of the color monitor and purchase software that will allow you to receive the output from those three cameras on your computer anyplace in the world. So you can see and hear your children playing in the yard while you are in another state or country.This product just doesn't come close to doing the job and the fact that it can digitally record the information just isn't a big factor since other systems can use a VCR and motion detection to do the same job. Since I have two DVRs already, devoting one of my VCRs isn't a big deal since I hardly ever use more than one of the three I have what with two  DVRs, three DVD players and my Windows Media Center Extension that also plays DVDs as well as movies from my Computer. In fact, it adds to the disk drive traffic I already have.", "Date": "November 26, 2008"}, {"Title": "Poor product overall", "Author": "Amazon Customer \"Comp\"", "ReviewID": "R16UUOEH97P2LE", "Overall": "1.0", "Content": "I have an existing wired security system (3 high performance 480 line cameras) in the house so was looking forward to this device.  I currently have the cameras tied to a video processing board (a Swann too in fact) on a PC at home.  This uses up a lot of electricity and takes up space but does a marvelous job of recording live video.  This Swann device looked like a perfect solution to replace it.  But was it?First off, the connections are sparse.  I could only connect a single wired camera. Whooptie-do, most homes have more than one camera for security so this rules out a solution box right then and there.  As for video output, there is only a composite output connector.  Yep, same old connector from something from the 1980s.  Since I only had a VGA/DVI monitors in the office where the security connectors came into the room from the outside, it was impossible for me to even hook things up without needing to buy more equipment.  Could've at least had an SVGA connector.  I guess a VGA/DVI connector is just silly out of the question.  And this would've really been a great security box if there were some kind of network connection so that I could connect my PC to it so the box itself need not be connected to any kind of display and could email images out instantly during motion detection for further security protection (else these are useless if a thief just steals the box from you!)Oh well, I figured I could at least use the included wireless camera as a front door camera to see who was at the door when someone knocks on it, all from my living room boob tube which is only about 30-40 feet away.  Nope, couldn't do that.  The amount of static from the camera created a useless picture.  I tried moving the camera closer to see where the static would end -- about 5-6 feet away was optimal.  Up to 10 feet got increased static but somewhat usable.  Beyond that there was no hope.  Static is a major issue as the motion detection screws up since it senses the static as motion and starts recording.  You end up having gibberish recorded.  Then we have the recordings itself.  This unit touts the ability to store a ton of video on a small data card.  True, it can, but it accomplishes that by using heavy heavy compression.  Keep in mind these security cams have poor resolution to start off with.  The high compression just makes it even worse.  You end up having useless data that will not hold up in court in the event a thief is caught; a judge will throw out the evidence as inadmissible due to the horrible quality not being burden of proof.The menu system is confusing.  This is in no doubt due to the menu fonts looking like something from my old Commodore VIC-20 from the early 1980s.  Honestly, it looks the same.  I couldn't believe my eyes.  Talk about hokey, Swann really needs to improve on this.In all, there is so much hope for a device like this.  Like I discussed, it would've been nice if there were more connectors and better video recording ability.  Swann, people can buy 8gb SD cards these days for cheap.  Relax the video compression setting!  Product is severely overpriced for its functions . This is really just a toy worth no more than $25 and even that price is too high since I can't imagine you can do much with this.  This system just sits around collecting dust now since I can't do anything with it:  I have no use to place a camera a few feet away from my TV, which if the unit is stolen I have no data available to view, and even if it wasn't stolen, it wouldn't be admissible in court.", "Date": "November 20, 2008"}, {"Title": "What a disaster - and they want $200 for it????", "Author": "Tarun Chachra \"Tarun Chachra\"", "ReviewID": "R3LESY110511XP", "Overall": "1.0", "Content": "I was very excited when this product came up on Vine and figured I would give it a shot.  I wanted a camera system like this to monitor my kids in and out of our pool in the summer time.  Naturally it was a bit too late for pool testing...but hey, it could be tested and used next year.The setup alone was horrific, my wireless network (apple extreme basestation) and this thing did not want to talk to each other.  Finally I got it working and the testing began.The video quality is very low quality - nothing that could make this camera security friendly.  Its good if you are trying to see who is at your front door but its not clear.  The low light performance is so so.Its a great concept and I sincerely hope they improve it.  But for $200 you can do much better with other products out there.  Sorry Swann...but I am being honest here in saying that this product is not ready for market.", "Date": "November 11, 2008"}, {"Title": "Low video quality, but good range", "Author": "Matthew Carruth \"Matt Carruth\"", "ReviewID": "R1RYJ3LTC2J9FE", "Overall": "3.0", "Content": "I was assuming that I'd plug this into my TV and see a high quality image.  OK, expecting HD would be a bit much, but I thought that it would look like broadcast TV.  I was wrong: what you see is a washed-out, low-resolution image that is only marginally useful.  The operation is clunky: after you plug in all the components nothing seems to happen.  I find myself re-seating the connects for a couple of minutes and then it suddenly works: go figure.  The range is good, however.  I thought that 10m would be the best case with clear line of site, but I was able to get it with several walls in the way.  This was the best thing about this unit.I'm giving this unit 3 stars because it is sold a a security system and expectations are lower in this arena.  For a consumer video it would loose 1/2 to one star.", "Date": "November 1, 2008"}, {"Title": "Poor Quality Video", "Author": "W. Stohler", "ReviewID": "R3IB74ZE1AUUBL", "Overall": "1.0", "Content": "I've installed CCTV systems professionally, and am admittedly an AV snob.I received this DVR / wireless closed circuit TV (CCTV) camera combo as part of the Amazon Vine program.  I was optimistic that the video quality would be good enough for home security use.  The unit is small, easy to set up and easy to program.  The motion sensing recording works OK, but there is a ~1-2 second lag between sensing the motion and the starting of the recording.  So for a small condo, you could miss much of the action before the recording starts.  If you're looking for something small and cheap and don't need high quality video, it's OK.  If not, I wouldn't waste my time or $.", "Date": "October 26, 2008"}, {"Title": "This unit must be improved", "Author": "Vlad G", "ReviewID": "RUH4ZH7NHR30W", "Overall": "1.0", "Content": "First, what I hate about this unit:- the camera minimal temperature rating is 32 F, so it cannot be used outdoors in the most part of continental US;- quality of recorded clips and pictures is terrible; I can hardly recognize my own face from 5 feet distance because of heavy compression artifacts;What I do not like about this unit:- camera power supply unit is NOT outdoor rated and has only 4 feet cable;- infrared illumination is always on, so camera cannot see through Energy Star compliant windows (they reflect infrared)- factory channel setting kills yours wireless network and 2.4Mhz phone- SD cards only, no SDHC support- it can only record one camera feed at a time- there is no remote and included AV cable is short***Given all constraints, it is difficult to find practical use for this system. Its temperature rating mostly prevents it from outdoor usage, its recording capabilities are so crippled, that it is only \"useful\" to watch people you already know (babysitter, spouse spying?:)) and there are many cheaper alternatives for tasks like baby monitoring or doorbell cameras (at least you do not need to sit next to your home TV).Finally, what I liked about the unit:- live picture quality is acceptable- night vision works as advertised- screen menus are OK- software motion detector gives good capability to select sensitivity zone- camera has one channel (4) outside wireless network range, so I managed to resolve radio interference;- it supports other Swann cameras and allow the second one (wired)I really wish Swann to fix the product to make it more useful:- improve temperature rating (you do have cameras with 14 F rating!)- improve quality of video/still capture (after all memory is cheap our days)- improve power supply characteristics - at least make cable a little longer;- add remote control - it really difficult to operate the unit sitting 30 inches from TV screenI would guess these improvement make unit cost more, but at least that would make a usable product.", "Date": "October 24, 2008"}, {"Title": "I Thought About 2 Stars, Then Saw the Price", "Author": "Muriel Hahn", "ReviewID": "RAW9ANY1TKRDO", "Overall": "1.0", "Content": "This \"video recorder security kit\" is priced at $174 at the time of this review. Based on my experience with the quality and capability of this equipment, I would say it shouldn't be more than $25, found in a discount bin at your local electronics store.Besides for recreational purposes, such as knowing when someone may be coming up to your front door (because you probably won't make out WHO is coming) or perhaps spying on the cat sleeping in your bedroom, I find no use for this device. The video quality, whether wireless or not, was awful.And because I reviewed this product as a Vine member, I am shocked at the asking price. I would not recommend spending anything close to that amount for this item.I would go into details on how it was fairly easy to set up, the benefits of SD memory, and perhaps the neat motion detection feature, but why bother? The quality and price is all that really matters to me in a security camera. If any other feature was such a deal breaker, then maybe spending $45 for this equipment would be okay.Maybe.", "Date": "March 18, 2009"}, {"Title": "Somewhat disappointing for the price; connection options not the best", "Author": "R. Kaufmann", "ReviewID": "R3N9KFDAZP6JOP", "Overall": "2.0", "Content": "Basically, it does what it says.  The video quality isn't that great, especially for the price.  And I would really expect a USB interface on such a device to allow direct connection to a computer.  I don't want to rain on their parade; it may a fine device for folks who only need a super-cheap (both in price and quality) security system, but I think customers would be happier getting something more feature-rich, and something more easily connected to a computer.", "Date": "November 20, 2008"}, {"Title": "Excelent picture", "Author": "Dr. Hani T. Almashhadi \"Newport Pasha\"", "ReviewID": "R2SIF17SOSSD71", "Overall": "5.0", "Content": "I whish it comes with more than one camera and I wonder how can you switch between them. Other than that I loved it.", "Date": "November 20, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001F50UDG"}}