{"Reviews": [{"Title": "Very good..but far from perfect...", "Author": "Radio Man \"yarns13\"", "ReviewID": "R1UWNRQTQ2RC1G", "Overall": "4.0", "Content": "I realize there IS no \"perfect point and shoot camera\". I suppose there can not be a PERFECT small camera due to the small size.In recent months I have owned TOO many small point and shoot cameras including..the older Canon SD950, a Fuji F100FD, a Panasonic TZ5, Even an Olympus 1010 model..and lastly bought a new discontinued Fuji F30 off e-bay for indoor low light shooting. I am sort of running my own private consumer reports situation it seems. :)This SD 990IS is maybe the best OVERALL point and Shoot I ever had. But, instead of all the usual glowing remarks Canon Elphs seem to get..I want to point out a few negatives or inconsistencies with this camera. I mostly bought this camera because of the new function..FACE SELF TIMER seemed like a GREAT and useful idea as I take more pics with my g/f, or friends, dog, whatever..on timer than anything else. Long story short Face Detection works THE best on this 990 of ANY other camera I have ever used. It's nearly flawless INDOORS. However I tend to use this Canon more OUTDOORS. Problem is is in rather bright sunshine like MANY cameras, Face detection has trouble. Simply, often it doe NOT detect a face..and won't detect the second face either. This is only in rather strong sunshine..otherwise Face detection and Face Self timer DOES work and works rather well. The lens is OK, but on such an expensive elph I feel there should be less purple fringing THOUGH it's not BAD..but it IS there...and also indoors ISO set above 250 or so tends to get a bit grainy. So much so, I set the megapixels to 10..thereby why did I need a 14.7 meg camera??I have also noted to my eyes this camera is not producing the almost too vivid colors of most canons...DEEP greens...Deep blues. But I actually feel the colors produced by this camera are perhaps more natural than almost any point and shoot I have had so that's a good thing. Also a positive..this camera handles blown highlights (Too BRIGHT) and dark shadows better than most. To sum up..this IS a really good camera with REALLY useful features WHEN they work, ala face detection in bright sun.I feel Canon and just about all the point and shoot cams presently out there are WAY too concerned about who's got the most meagapixels. I'd much MUCH prefer a camera closer to my  OLDER Fuji F30 which BLOWS the doors of this Canon in low light no flash) WITH JUST 6 MEGAPIXELS..then a nearly 15 meagpixel camera with too much noise. The Fuji's lens sadly has THE most purple fringing outdoors of any cam I have tried, hence my search has continued. To sum up..in today's market..perhaps this 990is may be about the best OVERALL small cam out there..but as I pointed out..if you are rather picky..it has a few flaws and I feel it is a bit overpriced...BUT also a VERY good camera which will make most people quite happy. It has a nice metal body..and the battery lasts a LONG time..another plus!", "Date": "October 13, 2008"}, {"Title": "Powerful Little Gem", "Author": "Alan Levine", "ReviewID": "R3TJ4ACPDW5IIG", "Overall": "5.0", "Content": "I got the early version of this camera in Japan, sold as the IXY 3000 IS and am head over heels in love; this replaces an SD800IS which was a long time favorite. The new one got my attention for the whopping 14.7 MP as I have been using this for taking panoramas on a GigaPan rig - [...]-- and more pixels count for much there. Plus there is the full manual (focus and exposure modes). And then there was the thrill of getting a new camera a few weeks before it was available in the US.Mine is set up with an 8GB SD HC card, which feels infinite.I've been very happy with the quality, and I do a lot of macro shots, posting hundreds on my flickr site [...]The new QuickShot mode is nice- to shoot through viewfinder where you want the quickest response time. And a bonus is a long overlooked feature- an on screen battery level indicator. There is a small button where you can instantly go to view mode, rather than flipping the shooting mode. Face focussing is very handy. Video quality is superb. Having the camera stitch mode (used for getting good overlap for single row panoramas) on the presets selection is great. And w00t! It uses the same NB-5L battery, so I now have more spares.My negatives are minor- the black style is slick, but the plastic shell feels a little cheap/flimsy, but the camera is sturdy. My biggest gripe is the latch on the battery/SD card compartment comes open easily in your bag or your pocket; the one on the SD800 never popped open on its own. The latch for the USB dock too is odd, it is hard to figure out where the hinge part is, and I always feel like I am going to do it wrong and break it off.Spinning the lower selection wheel takes some dexterity; so setting the aperture and f/stops in manual mode is going to take some time to be a smooth process.I've never bought a camera just because it has a large resolution, but I am shooting 4416x3312, better than my first generation Digital Rebel.I am in love with this little camera!", "Date": "November 14, 2008"}, {"Title": "Amazing camera! 9/10th of a G10 for much less $$", "Author": "Drew J. Pearson", "ReviewID": "R3HSNB2DZ7KY2D", "Overall": "5.0", "Content": "First of all, this camera is built beautifully. It is a highwater mark among the current Canon lineup (along with the G10 obviously). The metal body feels very solid and luxurious in your hand. I have only taken about 40 pictures with it thus far, in all different settings, and they all turn out great. The manual mode is what made me choose the SD990 over the aging SD950. It is nice to have this much control of a compact camera.I was initially worried about the noise a 14.7 megapixel sensor this size would produce, but thanks to the new DIGIC 4 processor, it is always under control. I wouldn't use anything above ISO 600.I am the type of consumer that pays more for better quality, and then holds onto things for a long time. This is one of those high-quality items. After your friends go through 2 or 3 plastic Kodak digicams, this will still be going strong. I wish I could afford a G10, but alas, I cannot. This is truly the next best thing. Way to go, Canon!", "Date": "October 24, 2008"}, {"Title": "Great camera, but some problems", "Author": "Mark Twain \"jack\"", "ReviewID": "RD15D99H843TP", "Overall": "3.0", "Content": "I have been using Canon cameras for many years and have been very happy with them.  This new model has some annoying new problems.  The on-off button is very hard to operate, its nearly impossible to operate without both hands and a strong finger depressing the button with absolute force and spot-on accuracy.  Why did they change this feature that was not giving any problems in the past??  The new Quik Shot mode does not seem to me to be that much better to deserve a separate mode.  Sure, we need to have as fast a shot as possible, but this one is not much faster and of course you can't see what you are shooting.  As far as I can tell there is no more Slow-synchro setting as in previous models.  If its there, its buried and I haven't found it yet.  That was the one feature I used most in the past, now its gone.  I must admit the ISO3200 setting in the 'Scenes' mode is a nice substitute, but does not give the same motion effects as you could get with the older Slow Synchro mode of the past models.  I do like the design and the black finish, its definitely a pleasure to hold and I have gotten comments on the design.  The new \"face recognition\" feature on the timed shutter release is very nice when it works, which is about 75% of the time.  when it doesn't work, get used to standing there for 30 secs before the shutter goes, then be prepared to have three shots go in rapid, i mean very rapid succsssion... which might come in handy for group shots where someone may have eyes closed on one shot, but not the next.  All in all its a great camera, the only really annoying feature is the on-off button which I hope they get rid of in the next upgrade.", "Date": "February 11, 2009"}, {"Title": "From A70 to SD990 IS", "Author": "Gringo Puma", "ReviewID": "R1I011I16Y1GM", "Overall": "5.0", "Content": "I purchased a Canon Powershot SD990 IS camera after my five-year old Powershot A70 died due to a sensor failure. (Even though the camera is long out of warranty, if I return it to Canon, they will replace the sensor.)Shutter Lag was a major problem with A70. The SD990 IS appears to have none.Low-light photographs with the A70 were always blurred because of camera motion. The image stabilization and the ISO 3200 setting of the SD990 IS produce low-light images with no blur.The sensor of the SD990 IS is a 1/1.7\" CCD (7.60 x 5.70 mm, 0.43 sq cm); the A70 sensor is 1/2.7\" (5.27 x 3.96 mm, 0.21 sq cm)The LCD of the SD990 IS is larger and much brighter.Videos from the SD990 IS look good. If I wanted HD video, I would buy a video camera.The A70 used four AA batteries; the SD990 IS uses one small NB-5L battery pack.The SD990 IS is smaller and lighter -- 182 gm vs. 320 gm.The SD990 IS has not experienced the e18 error or the \"lens error, restart camera\". Neither did the A70 in spite of being dropped on a concrete floor from a height of three feet.Bottom Line - I am happy with the SD990 IS and think it is worth the price.", "Date": "November 17, 2008"}, {"Title": "SD990 IS Rocks", "Author": "Kiki", "ReviewID": "R1PYT4V7M3WD60", "Overall": "5.0", "Content": "I upgraded from the SD550, which was a great little camera.I'm loving the SD990 IS.  Pictures are awesome.  Colors are right on, even when printed.  There are many preset options to choose from, plus you have the option of shooting manually.  Digital zoom is much less noiser than my old SD550.I'm never fond of digital zoom, but I do have to say in full digital zoom I got an awesome shot of the moom.  Very detailed to the point you could see the surface of the moon.  Yes it was a little noisy, but much better than what I expected.The camera is made very well.  Feels very solid in your hands.  Controls are placed nicely...very easy to access.  You have the option of in camera edit for red eye, cropping, color swap...features which come in handy if you want to use direct print.Face detect works great in the conditions I've used it in.  I haven't used the self timer so I can speak for that.  I do like the option of having magnified focus display which kind of zooms in to check the focus.Macro images turned out great as well--crystal clear.With the new software in the camera this little sucker is fast.  Much faster than my old SD550.I purchased this camera thinking I'd find some kind of flaw and have to return it after returning a few other cameras over the past few months; however, I haven't found any reason to return it.  I would recommend this camera to anyone looking for an awesome compact camera that gives the user many options to choose from.  My 8yr old could pick up this camera and get a great shot with the preset modes and a pro could get an awesome shot on manual as well.Forgot to comment on video mode:  It's good, but not much of a change from my SD550.  I'm more a picture person so that doesn't phase me too  much.  It's nice to have the option for those video moments and you can even set the transfer button to video mode, which is a nice feature.", "Date": "November 7, 2008"}, {"Title": "By far the best Point-and-Shoot I've found", "Author": "Eric Picard", "ReviewID": "RWHZNVTH99ZKF", "Overall": "5.0", "Content": "I have an undergraduate and graduate degree in photography - but I don't do a lot with it.  In fact, I've pretty much taken a hiatus for about 12 years from shooting photography as an art form - except for one series of projects about two years ago that I did using my camera phone.One reason I've held off for the past few years is that I've been waiting for a camera with the characteristics of the SD990IS.  I wanted a point and shoot camera that would fit in a pocket, that was >14MP (with fantastic image quality) and that would have long battery life.And that's what this camera is - it has met and exceeded every expectation. While the lense is a bit limited - and not what you'd want in an SLR - that's not what I wanted.  I've been taking photographs in the mountains while skiing, assembling them into massive panoramas and having them printed in very large format.  And the quality of these images is stunning.I bought this camera in early December.  I've charged the battery twice, despite frequent usage.  I bought a 16 GB SD card, and it's been nice not to have to worry about running out of storage.I highly recommend this camera!", "Date": "March 6, 2009"}, {"Title": "Awesome Awesome Awesome", "Author": "Safari Hood \"Safari Hood\"", "ReviewID": "RYDNWAF4Q1CKD", "Overall": "5.0", "Content": "I received the Canon PowerShot SD990 today (October 7th, 2008) and I love this new camera. I bought the black version, and it is very very sharp looking. The pictures on Amazon's site just don't do it justice. It has to be seen in person to be appreciated. The pictures that it takes are just as amazing !! I upgraded to this camera from a Canon PowerShot SD950. Fans of Canon's PowerShot series won't be disappointed. It is compact and lightweight, as you've come to expect. It features Canon's new Digic 4 processor. The Digic 4 is all about speed. I put in a SanDisk 2GB Extreme III SD card, and the camera estimates it could store 309 pictures, at full resolution (4416 x 3312) and SuperFine quality. That was with a completely empty card.The camera comes with a 32 MB card, which, at the settings I mentioned, you might get 5 pictures on it, maybe 6. I would definitely recommend that you buy a 1 or 2 gigabyte card to go with your camera. I hope this review helps. This is my fourth Canon PowerShot camera. I have had it less than a day, and I absolutely love it. Happy Photography!- Safari Hood", "Date": "October 7, 2008"}, {"Title": "Incredible Camera for real life'ers and photographers alike", "Author": "K. Joseph", "ReviewID": "R21MW1S1XFO7Z3", "Overall": "5.0", "Content": "I purchased this camera just before my vacation to San Diego and Hawaii. I have not taken any photography courses in over 10 years and do not consider myself a true photographer. I do have an eye for capturing moments. However, when purchasing a camera I was determined to find one with a wide angle lens. The Canon digital elph SD990IS is the first camera I have purchased in 5 years...and I am glad I did not waste any money on anything else between that time. For those of us who want quick shooting, have an artistic eye of what we want to capture, and want to do so with minimul fuss in a point & shoot camera, you will be hard pressed to find something with the equivalent performance in a compact package. I am heavily impressed with this camera and it turned out to be the perfect camera for my vacation documentary. The sheer technological brilliance that Canon has packed into this camera has forced me to write my first and possibly only review of such a product. Albeit, it does not do HD video recording but for those small moments you may want to capture, it will suffice and capture them in different settings (Sepia anyone?). I cannot stress how many pictures I have taken that came out crisp in a moving vehicle, or low light settings I may not have had enough stabilization. The camera was smart enough to recognize even without small setting changes (e.g., face detection vs center). Very little noise is produced even in digital zoom mode. I took well over 1000 shots in gist. There are possibly a handful that did not come out correctly. I will try set a public album for review in which this camera was the sole device used to capture my best vacation ever. The other reviews can provide technical aspects but I'd like to mention just a few things here from a more simple perspective. If you like capturing:- Mountains, beaches, blue skies and water in wide angle views that may take your breath away a second time around...- The precious face of a 3-year old with mountains and landscape in the background- The magnificence of nature itself or the world from an airplane window- A night on the town with your closest people...This camera is absolutely for you...links coming soon.", "Date": "January 7, 2009"}, {"Title": "Great camera with minor drawbacks", "Author": "C. Radovich", "ReviewID": "R2XTU6PJBT5GHR", "Overall": "4.0", "Content": "I have upgraded from an SD630 to the SD990is.Pros:Image stabilization  - Awesome!Color quality - ExcellentVideo - Superb (blows away the Canon FS1000)Look - SexyBattery: L-O-N-G life.Cons:1) A little slow on the draw.  My SD630's beats the 990is by half a second on focusing.  I have some more research to do so this could be UE.2) Size: Heavier and fatter than my SD630 but not so much so that I care.3) Price: But that's what we have Amazon for.4) Having to read the silly review by the dude with 16mb card comment.  Come on....", "Date": "December 13, 2008"}, {"Title": "Way Fast", "Author": "Waxy", "ReviewID": "R1C92KFD7TKRHQ", "Overall": "4.0", "Content": "After hours and hours and hours of surfing reviews, I finally chose this camera since I like the clarity of Canon cameras. I bought a SanDisk Ultra II SDHC 4GB card to go with it after reading reviews which claimed a 4GB is faster than 2GB and SanDisk is a great brand. This camera is so fast. From shot to shot, it is fast, compared with my older Canon. There is also a function where you can press the camera button and it will continuously shoot photos and that is supposed to be even faster. Clear and fast. That's what I need.", "Date": "December 18, 2008"}, {"Title": "Excellent Camera with 1 exception", "Author": "Turiya \"O\"", "ReviewID": "RPTSJ2N60ZDMU", "Overall": "4.0", "Content": "I LOVE this camera, I bought it to upgrade from my PowerShot SD900 (10MP). The thought of having 14.7MP was too good to pass up - and the pictures it takes are astounding. Astounding clarity and detail. I love it. However a big drawback for me is it doesnt take High Resolution video like the SD900. It does take video, just standard 640x480, but those vids lack the sharpness and crispness that I am used to with the SD900. When I first realized this I decided to return the camera, but I am too hooked on the 14.7 now, so I am keeping both cameras. I want 1 camera to do both, guess I will have to settle for 2 for now.", "Date": "November 3, 2008"}, {"Title": "Great little camera", "Author": "Puppipal", "ReviewID": "R2LEFXHVKT72DO", "Overall": "5.0", "Content": "I first bought the 880IS, but soon found out I couldn't do without an optical viewfinder or some manual control.  So I exchanged it for the 990IS, with which I'm much happier. I have a Canon 5D if I want a big SLR with \"L\" series lenses, but the 990IS holds it own against any camera.  I can carry it with me all the time and have gotten some great shots.  The LCD screen is big enough, and the controls are easy to use.  My only complaints are that it won't shoot RAW and it could have more manual controls.  But, like I said, I can always get out my 5D . . .", "Date": "December 5, 2008"}, {"Title": "Fabulous little camera!", "Author": "ThinkAndDo", "ReviewID": "R2JXPO82RGM7QN", "Overall": "5.0", "Content": "The SD990IS is by far the best pocket camera I've owned, and I continue to be surprised by the image quality. In some circumstances, pictures rival those taken with a digital SLR.The user interface is remarkably intuitive, almost elegant. Even the manual is well-written and organized.Battery life is very impressive.I'm actually kind of surprised to find myself giving such a glowing review, but for its class, this camera is superior in every way. The best endorsement I can offer is that I find it is ALWAYS in my coat pocket.", "Date": "January 17, 2009"}, {"Title": "Nice Camera", "Author": "Derk", "ReviewID": "RG455ZAYAYD2R", "Overall": "4.0", "Content": "I bought this camera because I needed to replace an aging Nikon.  Also, my dad had bought one of Canon SD700 series (I don't remember the exact model), and I was impressed by the quality of pictures that one took.  Which led to my decision in buying this.First off, the design was nice.  I like the metal body, it has a nice weight to it and feels comfortable in your hand.  The buttons are very intuitive, but a bit on the small size (I have fat fingers).  I also like the compact battery charger.As for picture quality, it wasn't half bad.  I was first worried about the potential for noise with such a high mega pixel, but I haven't experienced it.  What I was impressed with the most is the zoom, especially the digital zoom. In my past experiences, digital zooms are worthless because they simply enlarge the pictures, making them pixelated.  However, with this Canon, I was blown away.  I think the new processor compensates for this, and the digital zooms comes out looking good.  I was able to capture very small prints from across the room!The flash (like previous Canons) are very powerful.  I took some pictures in total darkness and they look as if I had some other external light source.A couple of other things...the 32MB SD card is a joke, but shouldn't prevent you from trying out this camera.  Zooming in and out made some noise, not really loud, but can be annoying.  Also, in the continuous shoot mode, you can hear the camera making adjustments. A camera case would have been nice.  Overall, I am happy with it.", "Date": "November 10, 2008"}, {"Title": "One of my Best Cannon Cameras", "Author": "GG", "ReviewID": "R2CXCRMPF4PV32", "Overall": "5.0", "Content": "I call the SD990 IS the \"baby sister\" of the Canon G10 which I also own and love (along with the 880 and SX110).  The 990 and G10 both have the same size sensor and number of pixels.  Although not as complex as the G10, the 990 offers some manual control as well.  I took both of them on a recent trip to Las Vegas, and I was impressed with them.  The 990 is great when I want something more compact and lightweight (purse size).  The picture quality, for what I was shooting, seemed equally as good as the G10.  The night shots of the Las Vegas lights came out fantastic with the 990 - extremely sharp and no noticable noise (probably because Canon increased the sensor size along with the pixel increase).  Even though the 990 lacks a wide angle lens, it more than make up for it with its image clarity and color.  I highly recommend it.", "Date": "May 23, 2009"}, {"Title": "reccommended! Perfect point and shoot!", "Author": "Breng", "ReviewID": "R2454BQOY5JPZE", "Overall": "4.0", "Content": "I love this camera.  It is perfect for me.  I wanted a point and shoot that produced quality pictures and it is almost perfect.  Size is perfect, very easy to use, even changing settings.  I am married to a professional photographer and he is even impressed with the quality.  We took it hiking during peak leaf season of NC and the images are very impressive.  It is a little slow to respond when shooting so action shots are difficult but I've had the opportunity to experiment with different settings for the same image and it makes post production quick and easy. Even the lights on a very large outdoor christmas tree is lifelike!  I have not had the opportunity for fireworks yet so no comment there. For a point and shoot, easy to use with quality images it is perfect.  I recommend!", "Date": "December 17, 2008"}, {"Title": "Top Notch Point and Shoot", "Author": "K. Koenig", "ReviewID": "R2V81FW8PMLQ16", "Overall": "5.0", "Content": "Looks,build quality, and function are all top notch with this camera. Fairly durable as I have dropped it twice unfortunatley....still works fine. Picture quality is amazing. I'm no expert but I am very picky when it comes to cameras and pic quality. The only features it doesnt have that I wanted that the IS880 has is a 3\" LCD screen and 28mm wide angle lens. The only camera that has it all is the Canon Powershot G10 which is bigger and heavier and closer to a pro camera. I prefer the subcompact camera myself and love it. Its smaller than I thought it would be. Overall I am very satisfied with my purchase of this camera and the excellent price from Amazon. Buying and shipping was all very easy and efficient.", "Date": "February 1, 2009"}, {"Title": "Great Camera for a great price", "Author": "John R. Hagmann \"Canon Fan 4 Life\"", "ReviewID": "R1EY0U99XZG51M", "Overall": "5.0", "Content": "What a purchase - great camera and easy to use.  Buttons are very intuitive and takes great pictures and pretty good video as well.  Get a 8GB SD card when you get it and you are all set.  Transferring pictures from camera to computer is a breeze and the whole experience is well worth the cash layout.  The reviews on this site helped me, as well as steve's digicams...but I buy all of my items on here!  I looked at the sd870, 880, and 990 and for the price the 990 was it.  i waited over a year to buy the 870 and switched to this and boy am I glad that I did.", "Date": "January 16, 2009"}, {"Title": "a lot of features in a small package", "Author": "CY", "ReviewID": "R6SVI245CB3H8", "Overall": "5.0", "Content": "This is my 8th digital camera, after a Kodak, Canon S50, G5, Sony T5, Canon 20D, 40D.  Last year I bought my wife a SD950 and we both loved it so I decided to buy another one for my pocket when I can't carry my bulky 40D with all its lens, etc. This SD990 is a newer model so I bought it without doing too much research.  I have been a Canon user for many years and thought I couldn't go wrong with it.I was first very surprised by all the features it has, especially the manual exposure control mode (although the aperature control is only limited to two settings - F2.8 and F8 when zoomed out, I think it's due to the limitation of the point-and-shoot). The manual focus magnification is great.  It also has the live histogram which I can't live without on my SLR. The wheel operation is convinent and very nicely done. Also lots of improvement to the user interface for viewing.  But I can see all the functions packed in one wheel control can be confusing for someone who is not familar with photography.The face detection works well.  The image quality is superb as usually being a Canon. I also like the large view screen. I bought this model for its optical view finder, which come in handy under the bright sunlight and also to conserve battery power. So I enjoy the large screen in addition to the view finder.Minor disappoinments:- Image quality surfers under low light, especially at high ISO. Since I am fairly proficient at photography I would stablilize the camera and force a low ISO under these situations.  But for someone who just points and shoots like my daughter, a lot of party pictures end up being deleted.- Shutter lag is still very serious. With all the new technology out there, I was disappointed to still experience shutter lag, especially after using it at a amusement park.  But again, I was spoiled by the performance of the 40D SLR so it's not very fair to compare.- Again I hate the direct print button on Canon cameras.  It's a waste of precious space.  At least Canon could make it programmable to other functions.I am being very picky to list these disappointments. But overall this little camera is a great one - compact size, lots of features, great image quality (under the right conditions). If I am in need for another camera, I would buy it again.", "Date": "July 24, 2009"}, {"Title": "Excellent small camera for everyone", "Author": "Walker Shaw \"Bill\"", "ReviewID": "R3AXYI1Y663TGG", "Overall": "5.0", "Content": "I upgraded from the SD700IS to the new SD990IS after reading all the specs and reviews.  It exceeds all my expectations and offers significant improvements.  The camera slips easily into my front pocket, always ready to capture those unexpected scenes.  The new zoom range and macro capabilities are especially appreciated.  I highly recommend this camera for everyone.", "Date": "January 12, 2009"}, {"Title": "Great Little Camera", "Author": "Photobug", "ReviewID": "R368AWEP9PPY7C", "Overall": "4.0", "Content": "After using a Canon PowerShot S50 for the past couple of years, all I can say is, What an improvement!  Excellent picture quality out of a very compact package.  I am very happy with this camera and have used it in multiple settings in several countries.  My only two minor quibbles are with the power button (difficult to push and poor location) and the slippery surface of the camera.  Couple with the diminutive size of the unit, this latter issue has led to several near drops.  You really need to take care not to drop this camera.  On the flipside, the SD990 will fit anywhere, and is definitely unobtrusive.  It is also intuitive and takes great shots.  I'd buy it again.", "Date": "March 26, 2009"}, {"Title": "Canon is the BEST!!!", "Author": "Ivo Bojanov", "ReviewID": "R1HHJR60OZ5A1H", "Overall": "5.0", "Content": "I bought this camera b/c i was replacing my old SD550. I did about 2 days of research, and learned so much things about cameras (even things that i wont need), and this camera is by far the best out there. the first time i used it was at the Chicago auto show and the pictures were great. all the functions work perfectly and the quality is insane. my expectations were surpast.", "Date": "February 26, 2009"}, {"Title": "Powershot 990IS is Superb", "Author": "William A. Swick", "ReviewID": "R3UNPH83G2N4BW", "Overall": "5.0", "Content": "I have had several digital cameras, and next to my Nikon D80, this is the best I have had.  I am still learning all it can do.  reload time is short, it takes nice movie clips, has intuitive controls and a nice feel in the hand. Pictures at the high resolution levels are great and can be blown up to poster size with no loss of detail.The price was right, the vendor sent exactly what was ordered, and i am very satsified.", "Date": "November 16, 2008"}, {"Title": "Fantastic Camera", "Author": "Peter Ford \"pbford\"", "ReviewID": "R3LJ2IGU4HZB04", "Overall": "5.0", "Content": "I have now owned three different Canon cameras since I bought my first in 1999.  My previous camera, an S60 was fantastic due to the fact that I could have more fine-grain control over my pictures than your typical point-and-shoot camera.  This camera can do everything the S60 could and has a much higher resolution.I would highly recommend this to anyone who is looking for a small camera that allows for more control of over your picture-taking options, without having to buy a high-end digital SLR camera.", "Date": "November 11, 2008"}, {"Title": "so far great camera", "Author": "Karen Fuentes \"Karen\"", "ReviewID": "R138JUFW2UVFV2", "Overall": "4.0", "Content": "This camera has been great so far I bought it so I can take pictures of my 18 month old who runs around it's been easy to use.  I am not a professional at taking pictures so I needed something easy and so far I've been able to figure the basic things I need to get good images.  I did go to the store to see different cameras and most were way too small for me the buttons were hard to press this is compact but you can at least move the dial without any difficulty the only downfall is you have to buy a separate memory disc the one that comes with the camera you can only take 4 images We have used it with the different scenes and pictures have come out good used it for fireworks and aquarium images and have recorded with it. I give it a good review and would recommend it", "Date": "July 11, 2009"}, {"Title": "Perfect in all sense", "Author": "Dasan", "ReviewID": "R1G32REZUN5QVO", "Overall": "5.0", "Content": "I've been using this for little over month now and very impressed with the quality of images and video from this SD990.Video quality is good and best thing is you can zoom while shooting in video mode.Amazon purchase experience was great as always.", "Date": "June 2, 2009"}, {"Title": "Great little camera!", "Author": "Julie Ledbetter \"jrledbet\"", "ReviewID": "RW8YEAF4A6IWK", "Overall": "5.0", "Content": "I really like that I have the option of viewing using the screen or the peephole. No more guessing what I'm shooting when there's too much glare to see the picture on the screen. Small, light-weight, easy-to-use, yet still takes a great picture. No nasty lag time when taking the photo like some digital cameras I have used. Been using it for about a month and am more than satisfied.", "Date": "May 31, 2009"}, {"Title": "Great Camera!", "Author": "Deborah A. Lerdon", "ReviewID": "R22E02984RS4YH", "Overall": "5.0", "Content": "This camera is super easy to understand and it takes great pics.  I owned an SD850 and loved it.  Unfortunately, it had a bad tumble and the lens never worked properly again.  I searched and searched review after reviews to get the best and this was it.  The only issue is the lens extending and having it fall out of my hands.  ALWAYS wear your wrist strap.", "Date": "May 27, 2009"}, {"Title": "stylish & great point and shoot", "Author": "W. Yeh", "ReviewID": "R1GDRPHXRL9GZ8", "Overall": "5.0", "Content": "having been a digital camera user for a while now, i've owned different brands of digital cameras over the years (fuji,kodak, and now canon). i switched because a lot friends around me use canon powershots and i like how their photos turn out. i did some research and ended up buying the sd990. i am very pleased with my purchase, as it takes great photos in a variety of different settings. the manual and auto settings were easy to learn too. also, i think the camera is one of the better looking point-and-shoot cameras on the market. the video that it takes is pretty good too. 640 x 480 @ 30 frames/s , good enough for blogging, or homemade videos. :) overall, just a great and sturdy camera... thanks canon!", "Date": "May 26, 2009"}, {"Title": "I've always been a Nikon man but........", "Author": "OldAnalogGuy \"OldAnalogGuy\"", "ReviewID": "RTDM7I79IKCTI", "Overall": "5.0", "Content": "...this Canon is excellent.  I am still discovering all the possible settings and options, but just shooting in 'auto' mode does a bang-up job.I had the chance to use the 'red-eye' correction in the camera iteslf and it is supurb.  The actual picture if used in raw mode (largest and most detailed) displays as 65\" wide in Adobe Photoshop.  When cropped to 8x10 or 11x14\", the detail is awesome.If you are on the fence about which digital camera to buy, I can assure you that you will be estatic with this Canon SD990IS.I cannot see any way to improve upon it other than perhaps a slightly larger LCD display and maybe a 6X optical zoom.  But just the way it is guarantees that you will truly love this little guy. It is that good.", "Date": "March 17, 2009"}, {"Title": "Nice camera", "Author": "Gary H", "ReviewID": "R1WAAE03VJZX7O", "Overall": "5.0", "Content": "I have to admit this has to be the best point and shot camera I've owned.  I just got it less than 24 hours ago and am impressed with the picture quality.The quality of the screen and lens and the general build itself is good, but it does look cheap in the control area.  Luckily, after ordering the camera and before getting it in the mail, I had a chance to \"touch and feel\" the camera at a local costco warehouse (just happen to see it while shopping).  I was a bit disappointed at the time due to the plasticy feel of the controls and the overall body, but when I actually got the unit last night it wasn't so bad (perhaps because it was in a brand spanking new box and that changes the perception of the grubby one I examined at costco).The picture and video quality is better than my previous camera - a 7.2 Casio Exilim EXZ70.  It was difficult to get sharp and infocus pictures with the Exilim, especially in moderate and low light conditions.Alot of people have mentioned being impressed with the digital zoom of the sd990is.  I tried it out and took a picture.  It didn't look that impressive after viewing it before taking the picture in the viewfinder.  After taking and reviewing the subject, it looked alot better - it seems the camera cleans it up and smoothes out the edges thanks to it's new video processor logic.  So I also am impressed with the digital zoom.I'll be going to a holiday party for work tonight and will be bringing this camera.  After tonight I will have a better idea how this camera really performs.  There will be alot of low to moderate lighting scenes and that will test out the focusing and picture quality of the pics in those conditions.GaryPS.  I wanted a black sd990is, but got the silver one at another vendor due to price (they didn't have black, because of their price/promotion, I went for the silver one).  I still regret not getting the black.... but I'll live.", "Date": "December 6, 2008"}, {"Title": "Good overall camera - provides lots of options", "Author": "alt", "ReviewID": "RJ53GHDHV8G8O", "Overall": "4.0", "Content": "This is my 3rd Canon Elf camera and this is as impressive as the past generations. I haven't found any other point and shoot that works as well as Canon's Elf line. The SD990 is certainly larger then many of the past Elf's but it is worth it in this case. Image stabilization seems to work well. Movie mode provides very good video. I haven't tried all the functions yet and actually typically only use auto mode. The only issue I have hit to date is that in movie mode, focus seems to be a bit tricky. I have not explored this fully and it may be a setup problem but I think that the focus happens as you press the shutter and then is fixed. So you have to stop recording and restart to get it to focus correctly.", "Date": "April 14, 2009"}, {"Title": "Awesome Camera", "Author": "Richard Gallacher", "ReviewID": "R2IEPNENATXMMP", "Overall": "5.0", "Content": "Right to the point.  I have used many point and shoot cameras over the years.  Not all of them were Canon cameras.  I've purchased the Canon 50D camera but wanted a smaller camera to carry around.  I choose the Canon SD990 IS, 14.7 MP camera. After taking several hundred pictures with this camera I can say the picture quality is outstanding not to mention the camera's construction, also.  I've taken pictures and printed them to 13\" x 19\" size with again, outstanding results.  It's not exactly a \"shirt pocket\" camera but it's very easy to carry in your pocket. Purchase this camera and you will never regret it.", "Date": "January 19, 2011"}, {"Title": "Great Camera", "Author": "L. Graham", "ReviewID": "R1JWBSOYX96HV5", "Overall": "5.0", "Content": "Camera takes excellent photos.  It is small in size, but not too small.  If you are looking for something to tuck into your pocket, this is not the one for you.  But if you are looking for a good point and shoot with some manual control, this one is great.  It has automatic setting for point and shoot, but you also have overrides to adjust shutter settings, or at least choose from other semi-automatic settings such as nightscapes and action shots.  It comes with a mere 32 MB card, though - enough for about 6 pictures.  Order extra memory cards when purchasing this one.", "Date": "September 14, 2009"}, {"Title": "Awesome camera", "Author": "LarsAnna", "ReviewID": "R3902VRC4JSHRT", "Overall": "5.0", "Content": "I got this camera as a carry-around-on-an-everyday-basis camera - got a little tired of dragging my Canon 20D around.This camera is very nicely built, feels very solid and sturdy. The button layout is very easy to use and very fast to maneuver. The learning curve is also quite short, as most things on the camera just makes sense.The technical quality of the camera, leaves little to be desired. It takes amazing photos, of course with all the limitations such a small camera has. The zoom is nice and fast and focusing is most times spot on. Only thing I wish was better, was low light capability, but then again, no camera with a sensor and lens this small will do much better.I can highly recommend this camera as an everyday use camera, due to it's light weight, small size and outstanding quality.A general precaution to every photographer: always bring extra memory cards and batteries - you will end up snapping away..", "Date": "December 21, 2008"}, {"Title": "LOVE THIS!", "Author": "M. Waage \"kittycat\"", "ReviewID": "RZDQ954TVQZNG", "Overall": "5.0", "Content": "I love this camera. I own Nikon DX40 and of course it's nothing compare to that but this is a GOOD camera. I love the fact that I can take as good pictures as my SLR. I love how clear it can be at night. I went to disneyland and was able to capture good pictures of the Fantasmic show with NO FLASH.Although this camera has a lot of functions that I have to learn but I believe when you know how to do it, you will get a good pictures. Great for close up picture.The design is pretty slick.I just love carrying this every where I go..", "Date": "December 17, 2008"}, {"Title": "Great Camera", "Author": "Mohammed A. Ali", "ReviewID": "R17ECGHDL15NR9", "Overall": "5.0", "Content": "Takes the best pictures I've ever seen on a digital camera.  Pictures are sharp and bright.  An amazing product.  Few drawbacks however as nothing is perfect although this one comes pretty close.  Power plug is NOT included with the product; have to purchase that separately.  Also, the power button is fairly weak and feels like it could fail any minute.", "Date": "December 2, 2008"}, {"Title": "Too bad...", "Author": "ChrisK", "ReviewID": "R2KPU6DX5O8LRZ", "Overall": "5.0", "Content": "...they don't make these anymore. Best little pocket camera ever. I also have had the 20D and now the 5D Mkii and this little guy is the perfect backup.", "Date": "September 2, 2011"}, {"Title": "Uprgrade from SD550", "Author": "Mike", "ReviewID": "R2S81GU6FU65SG", "Overall": "5.0", "Content": "Have had this camera about a month now. I upgraded from a Canon SD550. Picture quality is very good, the colors come out very nice. I find it harder to turn on and zoom compared to my 550 though. The power button is almost flush with the camera body meaning you have to cram your finger over the button and push hard to get it to turn on. The zoom lever is always perfect size for a mouse! Not sure why they make these buttons so hard to use. I would also would have preferred a metal body like that of the 550 compared to the plastic body on the 990. Looking past all that negativity, the pictures come out very nice. The images stabilization is quite nice. I haven't used the face tracking too much but the few times I have it seems to work great. I also like the new ability for more manual control. There aren't many options, but you can now select f stop and shutter speed which is a nice feature. 14.7 megapixels should be enough for anyone. I would buy this camera again.", "Date": "August 16, 2009"}, {"Title": "A VERY GOOD CAMERA", "Author": "Andrew", "ReviewID": "R3TWE9IN6RS84M", "Overall": "5.0", "Content": "As ever with a Canon you have to be nervous of the infamous E18 error - but provided you don't get it you have a superb camera. It is tougher than it feels. The colours are excellent and the video makes a camcorder almost superfluous. The face recognition is a gem and I particularly like having a battery strength gauge. Batteries, let me add, seem to last and last.", "Date": "July 7, 2009"}, {"Title": "Great Camera", "Author": "T. Packard", "ReviewID": "RYTA5UKEB6GEC", "Overall": "5.0", "Content": "There are so many compact digital cameras on the market today that it was difficult to decide.  I researched all that met my criteria and selected the Powershot SD990.  I'm so glad I did. I love this camera. Picture quality, ease of use and features are superior.  I highly recommend it.", "Date": "June 3, 2009"}, {"Title": "A Winning Cannon  (Canon)", "Author": "Charles W. Hayden", "ReviewID": "R1T6LZTQUM0B01", "Overall": "5.0", "Content": "I have had two Canon SureShots in the last couple years... both had failures  (dirt on the inside, estimated to cost $175.00 to fix.)  This new one with its 14.7 mgs is terrific... Great resolution.I wish it had more than a 3 to 1 zoom tho..Love it.  Easy to pocket and quick to re-bound for the next shot.", "Date": "May 29, 2009"}, {"Title": "Excellent camera", "Author": "GWS", "ReviewID": "R1SSVFXO2QR9RN", "Overall": "5.0", "Content": "This little camera fits in a shirt pocket, but the retractable lens provides sharp photos and excellent video. The settings  are very easy to control, thanks to the simple buttons on the rear and the clear display. For example, switching to macro or no-flash only takes a second. I got a USB stick with a 16 GB memory card, so I can record an hour of video. The stick transfers images and movies into my Mac without using the Canon software, and the movies are editable in iMovie.", "Date": "May 24, 2009"}, {"Title": "Excellent Camera", "Author": "Jose Lopez Nunez \"Jose Lopez\"", "ReviewID": "RJMWMYXJ460KA", "Overall": "5.0", "Content": "Probably one of the best compact camera in the market. Pictures of excellent quality. It is not a plain point a shoot camera. Manual mode allows for exposure control. Very nice and intuitive controls. I highly recommend this camera. If you do not want to carry a larger and heavier SRL, this is an excellent option.", "Date": "March 11, 2009"}, {"Title": "Canon Powershot 14.7mp is Mini but Mighty", "Author": "zolar zolo \"carolyn\"", "ReviewID": "R2OJBAQZTV9NV2", "Overall": "5.0", "Content": "The Canon Powershot 14.7mp is the best. It goes any and everywhere. Its features are unlimited. The price $299.00 is great, unbeatable. Pictures and videos are remarkable. I have a Canon Powershot 5.0mp, it still works great. I paid $500.00 for it when it first came out years ago. I am totally 100% happy with my Canon Powershot 14.7 mp. I would recommend it, it is great.", "Date": "February 28, 2009"}, {"Title": "Canon SD 990 IS- does the job!", "Author": "Ellis K. \"No man is an island\"", "ReviewID": "RQ3MYJZW3S6BD", "Overall": "4.0", "Content": "I've had the camera for a month and still need to use it in more varied conditions.  So far I've mostly done inside snapshots, which came out great.  I like the size and feel of the camera.  The controls are easy to use and there are more manual setting options than the casual photographer needs most of the time.  However, I'm looking forward to taking some landscapes and variable light shots to see how the camera works under those conditions.  My last camera was a 5-yr old Canon Powershot SD 45.  This camera is much better than that one.  I think it is a good value for the price. Also, the black body looks really good!", "Date": "February 2, 2009"}, {"Title": "Awesome Camera", "Author": "R. Hartsock", "ReviewID": "R36A0OXA3H6RAY", "Overall": "5.0", "Content": "My first digital camera. I have been one of those people to wait for the right camera to come along. Well I believe if you are looking for a very good camera and your First camera, make Canon Powershot SD990IS your camera. This camera offers manual setup for people that want to setup their camera and automatic for those that want to point and shoot. I'm very pleased with my purchase and would buy this camera again. My purchase from Amazon/Adorama cameras was GREAT. I ordered my camera very close to Christmas and actually received my new camera on 12/24/08. Thanks for the great service!", "Date": "January 23, 2009"}, {"Title": "Canon Powershot SD990IS 14.7MP Digital", "Author": "2 Cats", "ReviewID": "R36Y3S5N6JIRNK", "Overall": "5.0", "Content": "Awesome camera! This is my 4th Canon and I love it. Larger display, faster and clearer photos. Super easy to use. Can't go wrong with this camera. Directions for downloading are clear and simple.", "Date": "January 3, 2009"}, {"Title": "Little Camera", "Author": "Lamar J. Danner", "ReviewID": "RQ252KUWYL7KA", "Overall": "4.0", "Content": "This little camera is just what i was looking for. Going on vacation and didn't care to take along my big 35MM camera. I like all the extras it has,just like it's big counterpart the Canon 35mm EOS,this camera has a lot to offer.HI-Res photoes @14.1 megapixels SD Card slot. I think the best features are:face detection,anti shake,long lasting battery,movie mode.The cons are it's a bit small and so are the controls! I usded different brands of SD Cards and found the SANDISK Ultra 2 class 4/2 or 4GB works best in this camera. And you need to buy a case for the camera.Got the case and Sandisk SD memory cards,a Pelican case for SD card storage all from Amazon.com I did shop around befor buying all the above,Amazon had the best buy.", "Date": "July 9, 2009"}, {"Title": "Camera great....but price doubled by Amazon?", "Author": "Linda G.", "ReviewID": "R29KLIQ5UP8EO7", "Overall": "1.0", "Content": "I bought this camera from Amazon in 2009. I like it and recently wanted to replace my damaged camera. Canon no longer makes this model, period. It is gone and they have no refurbished to sell of this camera. I bought mine in Feb 2009 from Amazon for 409.00. Now the price is over $800???? I will not pay that to buy a discontinued camera. Could it be that the hope is those of us that love this camera will pay whatever it takes to replace it since it is no longer available from Canon?  I will not! I love Amazon, but do not like this. Something is wrong! Canon Powershot SD990IS 14.7MP Digital Camera with 3.7x Optical Image Stabilized Zoom (Black)", "Date": "September 19, 2012"}, {"Title": "I'm still looking for a good still camera", "Author": "CARLOS E. RODRIGUEZ \"Woody Allen fan\"", "ReviewID": "R3G6R5N1JL4688", "Overall": "3.0", "Content": "I am very fond of Canon products, however I think there is something missing with this camera, you can take great shots with daylight but unfortunately you have to be very patient when waiting the camera to autofocus at night. IA mode is also quite dumb when selecting the subject to focus.By the way, its last generation processor could be better. Recording movies is great. I don't know why it has to be *.MOV but it's not a big deal after all. 14.7MP is more than enough, macro function works great. Its flash... acceptable. Maybe the trick is to try taking photos without using its big LCD screen. Try the manual after using it, you can take great shots. However it would be better. Other cameras are ready to shot at night (with very low light conditions) in less than a second. With this camera you have to be very lucky to get the picture before the group is leaving the place.", "Date": "May 8, 2012"}, {"Title": "Very nice!", "Author": "Sammy", "ReviewID": "RY0T496E7TJJ", "Overall": "5.0", "Content": "Lovely camera.  It was a great replacement for a previous Sony digital camera.  The picture quality is awesome and the special feature are fun too.  I highly recommend canon cameras to anyone in the market for a digital camera.", "Date": "February 4, 2011"}, {"Title": "love my camera", "Author": "linh", "ReviewID": "R17P3M4PUKVWFJ", "Overall": "5.0", "Content": "i love this camera. I have an SLR and always end up using this camera to take my pics anyway. Im about to sell my SLR and just stick with this camera. The colors that this camera catches is beautiful and vivid. ive been very happy with this camera.", "Date": "November 30, 2010"}, {"Title": "Wonderful Camera.  Everything you need in a point and shoot.", "Author": "Backwoodsben", "ReviewID": "R1OECR4LR6NR4V", "Overall": "5.0", "Content": "I've taken this point and shoot in small airplanes, hiking in Guatemala, backpacking, and along on kayaking river trips.  I've dropped it numerous times.  I've gotten it wet (not submerged).  It's got some dings in it but still performs nicely.  I love the high quality photos with only the click of a button.  I wanted the quality that an SLR camera offers but without the weight and complications of extra lens and such.  I shoot short videos.  I love the sunset filter that makes a setting sun on a mountain peak really glimmer with a wonderful orange hue.  I've used the zoom function to get close to marmots, ospreys and monkeys that were a decent ways away and have had good results.  I used it in the rain forest taking pictures of Mayan ruins with only minimum fogging.  I carry extra batteries and memory cards and can go for a couple of weeks on 3 or 4 batteries and a single 4 GB card.  Even the cold tempearatures while skiing doesn't seem to slow down this camera.  I did my homework before ordering a cheaper, refurbished model of this Cannon and I have never been more pleased with a purchase before!", "Date": "September 1, 2010"}, {"Title": "Great camera", "Author": "The guy", "ReviewID": "R3DDSQOXC1HUFH", "Overall": "5.0", "Content": "Really love this camera. I think it is one of the best point and click cameras on the market today. I will however say the zoom on this camera isn't very good. Other than that, I love it.", "Date": "August 29, 2010"}, {"Title": "Still a great camera....", "Author": "Derick1105", "ReviewID": "R1F373HSPFCKND", "Overall": "5.0", "Content": "I purchased this camera a year and a half ago to replace my SD550 (which I gave to my wife).  This camera had one of the best low light image quality at that time.  This camera was definitely worth the upgrade from the SD550 due to its speed and preset settings and longer battery life.", "Date": "July 26, 2010"}, {"Title": "one of the best", "Author": "Eli Langer", "ReviewID": "R2Z8PIF3IA9YMJ", "Overall": "5.0", "Content": "ive been using this camera in a variety of situations, indoors and outdoors, studio and field and am qualified as a photographer and artist to review it.i have found the camera to be versatile and portable with incredible image quality. the zoom lens has jammed as i have got send in it both on beaches in canada and in the desert in california but in both circumstances repeated openeing and closing of the lens mechanism has seemed to remedy the problem. zoom lenses are vulnerable in this way and i think all zoom lenses are susceptible to this problem.that said, the camera is amazing and worth its price. i would recommend it to any level of photographer.the controls require some learning however but patience will pay off in fine photography.well done, canon.", "Date": "April 6, 2010"}, {"Title": "Excellent companion for a travelers", "Author": "Mr. Sam Yi \"penyi\"", "ReviewID": "R2VOFFT044Q0B9", "Overall": "5.0", "Content": "I brought my 5D with my fancy lens collection on my trip to Korea. Now almost 2 weeks into it, I've only opened my camera twice.  This niffty little camera can handle most practical situations.  Very good in low light situations (thanks to IS) and very good light metering.  I have been very impressed with this camera and will recommend it to anyone in the market for a point and shoot. (This is my 6th point and shoot! None other have impressed as much as this!!)Aside from the fantastic picture quality.. few things I really like about the camera.- the power button is small and is hard to \"accidentally\" press. this protects the lens when it's in your pocket.  I've broken several PS cameras in my pocket this way.- very inexpensive aftermarket batteries are available.- ability to delete images based on date range.I'm sure there are other thoughtful features I'm failing to list here... all in all, stop reading and buy.", "Date": "April 6, 2010"}, {"Title": "Excellent for a compact camera", "Author": "LGM", "ReviewID": "R2EP1DRZ4GBJRT", "Overall": "5.0", "Content": "I am very impressed with this little ELPH. Not only is the image quality very good, but it has some features that are usually only found on larger cameras like:*Live histogram*Full manual mode (though no aperture or shutter priority)Plus, I have added CHDK to mine. CHDK is 3rd party freeware that adds additional functionality to certain models of Canon cameras. With CHDK, I now have:*Raw/DNG*Exposure bracketing*A movable live histogram*Plus a slew of other features I don't even useRaw/DNG files are large and slow to write to the camera. But it's nice having the option to use it when shooting speed isn't a priority. I find I use DNG at least half the time. The large file sizes aren't that big of an issue given today's highly affordable large capacity SDHC cards.And why use CHDK's live histogram instead of the one that comes with the camera? Well the one in the native firmware places the live histogram in the middle of the LCD so it interferes with framing a shot. With CHDK I have moved the histogram out of the way to the lower corner of the LCD and turned off the camera's original one.  CHDK also gives you the option to show the histogram only when you half-press the shutter but I chose to leave it on all the time.So now with this nice and compact SD990 (plus CHDK) I have just about all the features and flexibility of more advanced models in a very portable package. But all that flexibility would mean squat if the image quality wasn't there. But it is. And high ISO shots are usable, especially when images are downsized. So I am very happy with this Elph, my first one after having used Canon's G-series cameras for years.", "Date": "October 1, 2009"}, {"Title": "Amazing Camera", "Author": "Robert J. Kierski", "ReviewID": "R1IP28PN9THNBZ", "Overall": "5.0", "Content": "This camera is very powerful for it's size.  I'm always impressed with the features cannon can pack into such a small space.  The only thing I'd want is to be able to add a telephoto or wide angle adaptor to the lens.  For far away shots, the zoom-in isn't sufficient.  For extreme wide angle shots, the zoom-out isn't sufficient.", "Date": "September 14, 2009"}, {"Title": "Excellent Product.", "Author": "Varun Kapur", "ReviewID": "R1BGM9V0F4G3SA", "Overall": "5.0", "Content": "Thanks for this excellent product @ excellent price. I am totally in love with this camera.Thanks Canon and ofcourse.. thanks Amazon!!:)", "Date": "September 12, 2009"}, {"Title": "Great camera", "Author": "\"Jo\" The picture taker", "ReviewID": "R1SZAFW0CJ1TSP", "Overall": "5.0", "Content": "I purchased this camera to replace an older cannon powershot S400. What a great camera this is. I had read the reviews for this camera and compared it to other camera's with the same pixels. I am amazed at the quaility of the pictures the camera takes and how nice they are when printed very vivid and clear. The only thing that I wish was that cannon would make their instruction manual more user friendly.", "Date": "September 12, 2009"}, {"Title": "Great camera!", "Author": "Leighl293 \"leigh\"", "ReviewID": "R30ODJFFBZ0AL8", "Overall": "5.0", "Content": "Love the ease of using this camera and the size!  fits in my purse.", "Date": "September 10, 2009"}, {"Title": "Bottom Line: Best Point and Shoot Camera I have ever owned", "Author": "D. Mclaughlin", "ReviewID": "R2W1MNY1X2C3OP", "Overall": "5.0", "Content": "This is the first time I have actually sat down to rate a product I purchased.That is how confident I feel about this product.  My wife and I by a point and shoot camera on average every year or so.We have owed a total of 6-7 cameras.  The Canon 990 IS is by FAR the BEST we have ever owned.  The quality of the pics is comparable to non-point and shoot cameras that run in the $1,000 range.  I could not be happier with this product, and the auto-correct red-eye feature is wonderful!", "Date": "September 2, 2009"}, {"Title": "Excellent Point and Shoot", "Author": "A. LITTLE \"Tech Junkie\"", "ReviewID": "R3GIUQ38HL72PW", "Overall": "4.0", "Content": "I have had this camera for a few weeks now and am very pleased with it.  It produces some of the best pictures I have seen coming from a point and shoot digital camera.  It is a little large for a point and shoot, but it is still very portable and light for its size.  My major complaint is the on/off button is a little more difficult to use then I think it should be.  You have to press it pretty hard for it to come on, making it more difficult to quickly capture a shot.  Overall, I am very happy with the camera and would recommend it to anyone looking for a higher-end point and shoot.", "Date": "August 26, 2009"}, {"Title": "great camera", "Author": "Amyy", "ReviewID": "R28U61E697J0JC", "Overall": "5.0", "Content": "amazing camera...takes pictures that come out crisp and clear even when its pitch black at night. love it!", "Date": "August 25, 2009"}, {"Title": "Canon 990IS", "Author": "S. Freeman", "ReviewID": "RQNFOS0A56V9G", "Overall": "5.0", "Content": "I really like the look of this camera. The pictures taken were of excellent quality and crystal clear. I was glad when canon came out with a black version of the 950 IS. I think I will be happy that this may be my last camera I will need to purchase because it has all the features I was looking for.", "Date": "July 11, 2009"}, {"Title": "stunning", "Author": "Christine Sauser", "ReviewID": "R3DGJSY1WX74QL", "Overall": "5.0", "Content": "I went from a 35mm Pentax SLR to this Cannon and I wanted a camera that would do all I needed. Well this delivers and more. I am still plowing thru the booklet and am amazed at all my options. This will keep me happy for years, which was my intention. It is everyhting it said it would be.", "Date": "July 9, 2009"}, {"Title": "Great little camera", "Author": "J. Howard", "ReviewID": "R2LQ8KSF3ASPLH", "Overall": "5.0", "Content": "I bought this camera for my wife for Mother's Day when her previous Canon 4 MP died.  She loves it.  It fits nicely in her purse so she always has it with her.  It takes terrific pictures.  She has a very nice digital SLR with interchangeable lens but she prefers this little guy.The 3.7x optical zoom works great.  All the controls are easy.  Results are fantastic.  It is simple enough that you don't need to read the book.It has a view finder which makes taking pictures easier than hold the camera at arms length and trying to get a good shot.  It has stabilization built in which helps when you are holding it at arms length.  The viewing screen is a little smaller to allow for the view finder but the space is worth giving up to get the view finder.The only drawback according to my wife is the version of Zoom Browser that came with this camera is no where near as easy to use or as powerful as the one she got with the  4 MP camera a few years ago.", "Date": "June 26, 2009"}, {"Title": "debate no longer", "Author": "game fan", "ReviewID": "R3E6L9NORSZBTK", "Overall": "5.0", "Content": "This camera is awesome!!  There is so much functionality with taking pictures and the editing right on the camera it is amazing.  We have a full blown digital slr(canon 50 D), and ws use this one more.  It is a very practial camera with the large 14.7 megapix beautiful shots.  I love the color accent feature. It will highlight only one color and the rest will be b/w.  Great on flowers, yellow corvettes,rustic old red barns, and kids on playground equipment.  If you are looking for the biggest bang for your buck I love this camera and it fits in your pocket.The video is also great.  The video quality for a camera is really nice.Underwater case works great!  The video is really practical underwater, I helped a swim team work on thier form by taking video.  You need fins and goggles to swim backwards and about a 45 degree angle in front of them.  Take the video and the coach can show them right away on the large lcd viewfinder.  works well.", "Date": "June 25, 2009"}, {"Title": "Excellent Camera", "Author": "Richard", "ReviewID": "R2XB7KA2ZTK6O2", "Overall": "5.0", "Content": "This is an excellent camera.  What you give up in areas like optical zoom is made up for by the speed of the camera and the quality of pictures it takes.  TONS of features built in.  Love the color swap feature - worked great in the Oregon mountains for capturing all the vivid greens.  The camera even took a fall down the trail at Shepperd's Dell waterfall with hardly a scratch!", "Date": "June 25, 2009"}, {"Title": "cannon powershot sd990is", "Author": "Robert P. Walck", "ReviewID": "R39JV8GJP2F516", "Overall": "5.0", "Content": "Best of all it has a view finder. Small easy to carry it around. Very simple to use yet it has many features. If you want a small camera buy it you'll love it.", "Date": "June 16, 2009"}, {"Title": "very nice", "Author": "John T. Danner", "ReviewID": "R403WKFY67K5R", "Overall": "5.0", "Content": "a great camera, performed great in low light situations which is what i wanted it forit is a bit hard to turn on if you don't hit the button right but not a big dealshots are clear and brightvery happy with this camera", "Date": "June 11, 2009"}, {"Title": "Great Camera", "Author": "S. Samaras", "ReviewID": "R1I6LUQX6MP334", "Overall": "5.0", "Content": "This is a great camera indeed and the photos are unbelievably good.The only complaint that I have is that the camera finish is smooth and it is easy to slip out of your hand so I make sure that I put the string around my wrist", "Date": "June 8, 2009"}, {"Title": "Excellent small camera", "Author": "Online Shopper \"Jman\"", "ReviewID": "R2U6A6Y0H84T43", "Overall": "5.0", "Content": "This camera almost takes pictures as well as my Digital SLR.  It's truly impressive.  The only downside is that the body is a bit slippery and hard to hold.", "Date": "May 20, 2009"}, {"Title": "Great camera....", "Author": "James B. Pennington \"CWI\"", "ReviewID": "R2NHR5EWQWGF6I", "Overall": "5.0", "Content": "Great little camera.  Once i figure out how to keep from getting red eyes with it I will be even happier.  Definately can tell the difference from my last 8 MP camera.  This one is extremely clear and quick to refocus.", "Date": "March 25, 2009"}, {"Title": "Excellent Camera", "Author": "Stephen Cravinho", "ReviewID": "R2UXSKGJI3WD8U", "Overall": "5.0", "Content": "Used it for honeymoon.  Very small and easy to use.  Takes great pictures.  Fits in you pocket or in a small case.  Battery lasts a long time.  I recommend the product.", "Date": "March 11, 2009"}, {"Title": "Canon Poweshot SD900IS", "Author": "Muhammad Subhani", "ReviewID": "R25OP1WZWFJT78", "Overall": "5.0", "Content": "A superb product with great results. My daughter loves it as she needed a compcat camera with good results and a good zoom.", "Date": "March 4, 2009"}, {"Title": "Quite possibly THE best canon i have ever owned!!", "Author": "N. Barker \"sharp shooter\"", "ReviewID": "RLG1MFCA13683", "Overall": "5.0", "Content": "Got the canon powershot sd990IS for my trip to Jamaica. I have owned several canon digital cameras in the past and this one is definitely the best one yet. This camera is so easy to use and all the options are very easy to get to. I recommend this camera to anyone looking for a point and shoot. The setting that I ended up liking the most was the sunset setting.", "Date": "February 26, 2009"}, {"Title": "Excellent Camera", "Author": "Kim", "ReviewID": "ROV8O8YCQ1POX", "Overall": "5.0", "Content": "I researched many digital cameras before I decided to purchase the Canon 990IS. I has a Sony 4mp for years and it was a great camera but I wanted to upgrade and I knew I wanted a Canon. I decided on ththe 990is is due to the range of features, the larger mp (since I like to blow pic's up sometimes) and I read alot of user reviews. This is a very sturdy camera and the black matt looks and feels great. I takes neat small videos as well, and very simple to switch between video and pic. I bought an 8gig sd memory card with this and it is definitely big enough for my images even set on 9mp on which I  have it currently set. The added quality is worth the money and for just over 300 bucks (compared to $399 in most stores) it is definitely worth every penny.", "Date": "February 18, 2009"}, {"Title": "A little confusing at first, but GREAT camera!!!", "Author": "Crystal Kim", "ReviewID": "R2V4G1IM12SAFT", "Overall": "5.0", "Content": "The camera is a little confusing at first with all the buttons and functions, but overall it is great!  I use it to take pictures of my 20 month old.  It captures pictures fast and super clear.  Love this camera!!!", "Date": "February 17, 2009"}, {"Title": "Awsome Camera", "Author": "D. Mastri", "ReviewID": "R3T0198OHHLM1Q", "Overall": "5.0", "Content": "2nd Cannon Camera I've owned. Had the A95 and I have used it for years. Great upgrade. The ISO setting sees better then I do in the dark. The movie mode works great. Battery Level indicator is a nice feature. I use the camera to take pictures of my artwork for my portfolio and the lens makes everything nice and sharp. I love the size and weight. Camera's only bad flaw IMO is it's a little hard to grip with the smaller shape.Love it. Thanks Cannon.", "Date": "February 13, 2009"}, {"Title": "Awsome", "Author": "Joseph M. Tersigni", "ReviewID": "R18FM8NW9N3XBX", "Overall": "5.0", "Content": "I've owned many digital cameras in the last 10 years and this is by far the best.  picture quality is amazing coming from such a small lens.  its very good on battery power, i charge mine once a week for moderate to low picture taking.  it doesnt take playing around with it to much to take blur free images in dark areas.  i have no complaints about this camera.  i think cannon just stole me as a loyal customer away from Fuji", "Date": "February 6, 2009"}, {"Title": "Great Buy!!", "Author": "TX Tigah", "ReviewID": "RT7FSUANYLDH1", "Overall": "5.0", "Content": "This camera is super.  Finest pics of any point and shoot I have owned.  Plenty of customizable adjustments for the more professional photo taker.  Very happy with this purchase.  And it looks cool in black.  Highlt recommended.", "Date": "January 19, 2009"}, {"Title": "Great buy", "Author": "Deepa \"Deepa\"", "ReviewID": "R2SC077NZJ1LFJ", "Overall": "5.0", "Content": "I absolutely love this camera. It is light weight and easy to use. Takes great day/night time pictures and one can shoot amazing videos with it. After trying many digital cameras over past two years, I believe this is best on the shelf at the moment.", "Date": "January 19, 2009"}, {"Title": "Great little camera", "Author": "R. Fraser", "ReviewID": "R3UC47GO40FPIE", "Overall": "5.0", "Content": "I purched This Canon SD990IS camera so I dont have to take my Canon 20d on all my trips. This little camera works great. The 3200 setting for indoors or out side at night is great, also the macro is great.It is small and easy to travel with.", "Date": "December 26, 2008"}, {"Title": "I love this camera", "Author": "Moe", "ReviewID": "R2VISWDX0R79KX", "Overall": "5.0", "Content": "Who can argue with the same sensor as the G10?  I'm glad I spent the extra money for this camera.", "Date": "July 19, 2009"}, {"Title": "little bag of tricks", "Author": "deano", "ReviewID": "R35HNF7J03GC1Q", "Overall": "5.0", "Content": "I spent years an thousands of Dollars on Full SIZE CANON A1 35MM with IS lenses and speedlites to achieve pictures about half the quality of the ones I can achieve with this relatively tiny and well priced 990IS.Great little bag of tricks with more capability than i can induce. Its not that it lacks creative manual tools; because I can control a lot more on this than the A1. Its just that smart when your in a hurry. I've taken great fire works, sunsets and stopped Hummingbirds dead in the air. Great deal and convenient size.", "Date": "January 27, 2009"}, {"Title": "Thrilled with it.", "Author": "P. Halloran", "ReviewID": "R1XWTAPNRANY2K", "Overall": "5.0", "Content": "Ordered this for xmas.  Did some research choosing this camera over the SD870.  I choose the SD990 over it for the viewfinder in case the sunlight interferes with the large screen.  It takes great pics, movies in a pinch, the playback is great and I Love,Love,Love the red-eye reduction.", "Date": "January 13, 2009"}, {"Title": "Nearly perfect", "Author": "D. Schuster", "ReviewID": "R2BAYO4P021YIJ", "Overall": "5.0", "Content": "This is my second elph and it is the best yet.  Great for social events where I don't want to bother with my DSLR.  Image quality is terrific, as is the range of shooting options plus the 14.7 megapixel allows for major cropping. Would recommend to a friend.", "Date": "December 14, 2008"}, {"Title": "missing modes?", "Author": "roger", "ReviewID": "R3B0QYNSRUJF4Y", "Overall": "4.0", "Content": "I just purchased this camera to replace an old Canon G2. I like it because it is compact and its user interface (buttons, menus, etc.) is much simpler and streamlined. And I purchased the 990 specifically because of Manual and Program modes. However, in manual mode, I have to set both the aperture and shutter speed. There does not appear to be a way to set just the aperture and let the camera automatically decide on the speed. The display shows to what degree the picture is overexposed or underexposed for a given setting, but no way to let it automatically determine the correct speed. Am I missing something?", "Date": "October 28, 2008"}, {"Title": "Replace Battery Pack is the only thing this camera will do", "Author": "M. T. Armstrong \"ImBatGirl\"", "ReviewID": "RDXL4V9GCAE2L", "Overall": "2.0", "Content": "I love Canon and have never had any problems with them until I bought this camera. It has been back for warranty repair twice. The first time they returned it the next day saying nothing was wrong. Got it back and the same thing happened. Have bought 4 new batteries and a new charger and still same problem. It has been sent back again. I think I got a lemon and am disappointed in Canon helping me on this one. The camera should be replaced.It will turn on and at times I have been able to take a few photos but it never lets me take but a few and sometimes gets stuck with the lens still out and on the screen it says replace battery pack. I have never been able to use the camera on a trip due to this and this is why I got the camera.", "Date": "November 17, 2009"}, {"Title": "great camera", "Author": "Dona", "ReviewID": "R1XIM3LW2N0Q6B", "Overall": "5.0", "Content": "This is so easy to use and takes great photos just using the auto features. I'm a Realtor and while I'd have liked a wider lens, that is all that keeps this from being the perfect camera. The interior shots look great without any editing, colors much better than my old Canon camera.  I researched reviews on multi sites before making a decision and worried that it wasn't in my local stores to \"handle\", but couldn't be happier. You will want more memory, I had a 1GB from the old camera and will get an extra 2GB for vacations. It is easy to set the camera to downsize the photos for realtor web sites before I take the photos and then reset it for personal shots.  I've been able to see the screen even in bright sunlight. Be careful buying a case, it is borderline tight so I went a little bigger and have room for a small cloth to wipe the screen (I went to the local store since I knew this would be a problem). Amazon's price was terrific. I am delighted with my purchase.", "Date": "October 24, 2009"}, {"Title": "Exellent pics light or dark", "Author": "creature feature", "ReviewID": "RHKDPY9IZK6QG", "Overall": "5.0", "Content": "First off this is by far the nicest point and click camera I've owned. It has more options than any point and click I've ever seen and I can't wait to learn to use them all. It just amazing that a camera this small can do things that a slr can do. The pics have been outstanding, the detail you can get with the camera and the cropping options are so easy to use. I'm really impressed with the pics taken in low light situations. I haven't taken a bad pic yet due to this camera.", "Date": "January 9, 2009"}, {"Title": "One of the best", "Author": "Shad \"Shady\"", "ReviewID": "R2ZB6QXZJ5J4UH", "Overall": "5.0", "Content": "This camera was a gift for my brother and yes a great choice.I own the canon 870is and it is too a great camera.My brother is in a band and he wanted to take pictures and blow them up so me owning a canon and knowing what great cameras they are I thought the 14.7 mega pixels would be just what he would need.I would recomend this camera to any one who loves to take great pictures.Read the owners manual and learn how to really use it,you will be supprised how good a picture could turn out when the camera is on the right settings.", "Date": "November 23, 2008"}, {"Title": "Canon Powershpt SD990IS", "Author": "Lee B Rivera", "ReviewID": "R2443J48UH00NQ", "Overall": "5.0", "Content": "cant beat the metal body. this thing has been drop all over the place and still works like new. picture resolution is fine especially for a little point and shoot camera", "Date": "November 11, 2013"}, {"Title": "Canon Powershot", "Author": "marian vistuba", "ReviewID": "R1CPISSSO176TX", "Overall": "3.0", "Content": "I got the canon powershot used & as I was used to this camera already I was disappointed the mode dial does not move as it should. However, it will do as this is not my primary camera & the price was right.", "Date": "September 18, 2013"}, {"Title": "my second camera of the same model!", "Author": "Karen A. Alvarez", "ReviewID": "R3U32F7XR3CKU4", "Overall": "5.0", "Content": "i love this and can't be without it. this is the second camera i bought of the same model. canon is great, the features are incredible. i really love it. i got the black so it doesn't show as much if i am taking pictures at a concert or anywhere else that is a little dark.", "Date": "May 2, 2013"}, {"Title": "OK for a pocket digicam, but not very durable", "Author": "M. A. Santos \"Desert Wanderer\"", "ReviewID": "R1W5XCG9B732B8", "Overall": "4.0", "Content": "This is our 3rd Canon ELPH and we bought it in early 2009. I got it in black, because it reminds me of my F-1s. It's basically mine, my wife's is an SD1100, the standard size one in pink.First, off I am a long time (over 35 years) manual focus film SLR camera user and really can't stand the shutter lag you get with nearly all pocket digicams (which is caused by the time needed to acquire focus and the slow speed of some SD cards). Getting the thing to auto focus on your intended subject is also an adventure as is controlling exposure. My Old Canon F-1s are still superior to every pocket digicam, and their only real equal are the mega-thousand dollar digital SLRs with full frame sensors, etc. I have better things to spend my money on.That said these little cams are useful if only for their portability. If you can set them up correctly they can also take very good photos. The SD990 with its 14.7MP is really capable, but it does have a few drawbacks. The auto focus is very stubborn if the subject is off center, and evening backlit scenes are not its strong point.On the plus side outside daylight results are excellent. A high speed SD card also helps reduce the shutter lag, but it's still no F-1.The SD990 was a departure from most previous ELPH models. It's thicker and more curved. That's not a serious issue, but the power button is smaller and while it has not given me a problem, others do cite it as as a negative. The back control wheel is also of a different materiel and design, and my SD990 has developed a condition where the small center FUNC SET button is completely stuck, you can't push it. Our other ELPH, I think it's an SD1100, has the standard design and that one is fine (and my wife uses it much more often than i use this SD990), so this mas definitely soured me on the camera.I take good care of my equipment, but i am out in the desert a lot on deployments where it gets HOT. Perhaps the composite material gt distorted from heat. Who knows, but it's a a pain at present. I do think the SD1100 with its metal FUNC SET button would not have gotten stuck.While the camera still works, I can't change any settings or delete and images using the camera. I'll see about getting it repaired, because it's not the lens (usually that's a case of getting rid of the camera), but this is getting dropped from 4 stars to 3.  If i can't get it fixed, I re-write a 2 star review.Note I got it repaired. Can't remember how much it cost, but it was reasonable. Restoring the 4 stars.", "Date": "January 3, 2013"}, {"Title": "Love this little camera, just a few problems with it.", "Author": "M. Marcus \"Matt & Tracey\"", "ReviewID": "R2LKAR8W3R9NIX", "Overall": "4.0", "Content": "This is a GREAT starter camera for the aspiring photographer. It really helps you to start to learn the different camera settings if you are just moving on from a point-n-shoot.  You honestly would have a very difficult time jumping into a loaded primo camera.My husband is an avid photographer and this was his first big step for cameras. You will definitely have to read the booklet when you get it if you have never used a camera with settings before. It is a little tricky to figure out. I am not the photographer and still do not know anything past clicking the button!  My husband is pretty much very comfortable with this one now. He has moved on to a more advanced Canon, but he was saying he would not have been able to really get it down without having this one first as kind of a training camera.The pictures are great quality. You can't tell a ton of difference between this one and a 16 or 18 mega pixel.  The video camera is pretty good. One thing we noticed is that when you go to zoom in during a video, the lever moves in very quickly so you have to go slow with it.One big downfall we noticed about video taping is with the mic. The mic is on top of the camera, so if you aren't paying attention to where your hands are, you can actually cover the mic and have no sound!  It's also a little small so you have to always put the strap on your wrist in case you accidentally drop it!Other than those few things, we love it!  This is the camera that we take with us if we are going out for fun or on vacation. You can find a case or cell phone case for this and put it on your belt. It's small enough to fit just about any where, which can be a big plus over a bigger camera.Hope this review helped you out!", "Date": "September 20, 2012"}, {"Title": "All U ever want in a point and shoot!!!", "Author": "Roman A. Sarmiento \"FreeViews\"", "ReviewID": "RLQ7ALNJZIWSQ", "Overall": "5.0", "Content": "The SD 990 is an amazing piece of work.  It does everything from the most simple to the complex techniques in photography.  I bought it for my girlfriend at first and after a few months of toying with it, i purchased my own.  I couldn't be more happier. It is an amazing camera! The feel is great, the interface is user friendly, and most of all it makes any amateur take professional photos. the photos i get from this camera is amazing. HIGHLY RECOMMENDED!!!", "Date": "December 10, 2011"}, {"Title": "this is a great camera right before you jump it to professional", "Author": "artistic Gal \"Nemo\"", "ReviewID": "R2ZNSFDAS7OQ2Y", "Overall": "5.0", "Content": "I love this camera.. the picture quality is great especially if you have good outdoor lighting..the use is super easy as i am not really big on adjusting camera settings .. i always have it on auto and it does a great job at that.. the size of it is really nice.. but mostly the way it is made is so nice looking.. it is not not cheaply made, like a lot of other brands are doing.. i have the black and my sister has the silver, I think the quality of the silver is a notch better (the buttons fell better when you push them) but if i were to re purchase  i would still buy the black.. i like the color.", "Date": "December 3, 2011"}, {"Title": "Cannon Power shot SD9901S", "Author": "Sharon Schoenfeld", "ReviewID": "RZ57AF93RN80O", "Overall": "5.0", "Content": "My brother bought this camera and the pictures were so great, I had to get one for myself.  I love it and have taken some great pictures in the Smoky Mountains with the fall colors. Shipment was fast and a great price.", "Date": "October 27, 2011"}, {"Title": "Great point and shoot", "Author": "W. Hill", "ReviewID": "R2H32VEIWZGUU5", "Overall": "4.0", "Content": "I'm very happy with this camera - use it more than I use my DSLR.  It's not perfect but I would recommend it.", "Date": "March 7, 2010"}, {"Title": "Great Little Camera!!", "Author": "Telemachus", "ReviewID": "R3NO9WRIASOMMP", "Overall": "5.0", "Content": "I had purchased the Canon PowerShot SD980IS 12.1MP Digital Camera with 5x Ultra Wide Angle Optical Image Stabilized Zoom and 3-inch LCD (Silver), but was not happy with he picture quality in auto mode.  I tend to upgrade my pocket camera every year, so have used a variety of PowerShot cameras over the years.  I traded the SD980IS for the SD990IS and am VERY pleased.  Picture quality in ALL modes is superior to anything I've used in the past in the PowerShot family.  Colors are vibrant; pictures are sharp.  Manual and semi-manual modes are easy to use and provide great flexibility.I ended up purchasing a refurb model from one of the Amazon associates, and am quite pleased.  I've never tried a refurb, but other than a fingerprint on the case, the camera was perfect.  Highly recommend.", "Date": "February 7, 2010"}, {"Title": "Best Compact Camera EVER", "Author": "Joey B.", "ReviewID": "R7M02NINUYICX", "Overall": "5.0", "Content": "Ok, my title might be going a bit overboard, but I can honestly say it's the best handheld/compact camera that I've ever owned (& I've owned a LOT over the years).  It looks great, it's comfortable in your hand, & it takes amazing pictures!  I'm sure some professional will say it's nothing compared to SLR cameras, & in many ways they're right.  But, for something this small that fits into your coat pocket, it's a hard little camera to beat!", "Date": "February 6, 2010"}, {"Title": "EXCELLENT", "Author": "Sarosh", "ReviewID": "R2B17LZISP9OTY", "Overall": "5.0", "Content": "The Canon Powershot SD990IS 14.7MP Digital Camera with 3.7x Optical Image Stabilized Zoom is the best little camera I've used yet. From micro pictures to large landscape shoots this Camera is the best bang for your buck.", "Date": "January 22, 2010"}, {"Title": "Great point and shoot camera", "Author": "Amazon Customer \"mw\"", "ReviewID": "RTQG6W4D1U7L8", "Overall": "4.0", "Content": "Pros -This camera replaced my SD550 (7MP). It is essentially the same camera - similar dimensions, similar interface. It has more digital zoom, and it has more than double the megapixels. The image sizes are larger (4-5mb on high setting), so go ahead and buy a fairly large memory card (4+gb). Canon is my favorite company for point and shoot, and I really enjoy the ELPH series.Cons -Shutter is sometimes slow to react to button - a host of light measuring and focus processes no doubt, but sometimes I just want to take the picture when I push the button. Flash also takes a bit to recharge, and will hold up the picture if it isn't ready. For the size of the body, a little more optical zoom would have been great. A little more wide-angle, like the SD980 would also have been nice.If you pay more than $280 for this, you're getting shanked.", "Date": "December 21, 2009"}, {"Title": "Great Small Camera", "Author": "Chris Parker \"Chris\"", "ReviewID": "R2G5EFBZXV7S9Z", "Overall": "4.0", "Content": "I purchased this camera after having my SD870 destroyed. This camera is a good improvement to an already good camera. I have a SLR and have used this as an additional camera. It is handy to have and produces photos that are vibrant and rival the SLR.The only thing that I dislike is the price. But they do pack a lot into this small device.Did I mention that it also does video? Not just a few short clips, but full video. It does not replace a camcorder, but it gives you a lot of options.cbp", "Date": "December 16, 2009"}, {"Title": "Amazing deal for performance camera", "Author": "Mohamed Fares \"Mohamed Fares\"", "ReviewID": "R1MSI33EUCTJME", "Overall": "5.0", "Content": "It's my first experience with Cannon in performance cams. I really was surprised regarding the quality of photos, colors and sharpness. The most amazing point for me with the image stablization. Whatever your move was or your sight move the picture comes out very stable and very sharp.I enjoy this camera very much.", "Date": "December 11, 2009"}, {"Title": "Try to Pry it From My Hands!", "Author": "S. Block", "ReviewID": "R2TOPDE676RKQ7", "Overall": "5.0", "Content": "My first digital love was the Canon Digital Elph with two megapixels (2001).  I still used that camera and sold photos I shot with it.  Then it was stolen.  I was forced to replace it.  I chose the PowerShot SD990 IS, 14.7 megapixels, and it's PERFECT.  I really can't think of any annoying problems or drawbacks.  I love it for shooting videos.  I use Canon software, which I love, and transfer some videos to my mp3 player.  I find I use the camera a lot because I got a good little case for it.  It goes into my purse with no worries.  The battery life is excellent.  Recharging is fast.  You always need to upgrade the memory card with any new camera, since they rarely come with one large enough.  If anyone wants my beloved SD990IS, they will have to fight me for it!  BTW, I chose the silver case.", "Date": "December 10, 2009"}, {"Title": "Love this camera", "Author": "Susan Field", "ReviewID": "R198T9FD13MK0S", "Overall": "5.0", "Content": "I love this camera. It takes macro photos very well as well as quick shots of my active pets. I purchased it as an option to use when I don't want to lug a huge Canon SLR digital camera around with me. Most people are less intimidated by a small pocket sized camera for candid shots of themselves. I'm the M.O.B.(mother of the bride) for my daughter's wedding next June, 2010. I wanted something I could pull out for a quick candid shot or two.I first saw this camera in the Fall of 2008. I thought Canon would come out with a similar camera with more zoom. Alas, they did not. I waited and waited. Then, the price dropped and the new line of cameras came out, with not a one with anywhere near G-10 features. So, I purchased the 990SD and will have loads of fun learning all it's bells and whistles this Christmas.", "Date": "December 8, 2009"}, {"Title": "Great point and shoot camera", "Author": "K. Zakar", "ReviewID": "R3Q2D8TWANQCPB", "Overall": "4.0", "Content": "I love the camera! It is so easy to use and the on off button which someone said was difficult is not a problem. The battery however does not last as long as the 4 AA's I used in my last cannon so I bought an extra battery so I always have one on hand. Problem solved.. I also have a problem with the coach bag. It is too small. I feel like the zipper is going to scratch my camera screen every time I put it in so I bought a bigger camera bag. Other then that I love the photos I have taken so far. Great Quality..", "Date": "December 8, 2009"}, {"Title": "Canon 990is review", "Author": "T. Keith", "ReviewID": "R184DO4QK4CSFO", "Overall": "4.0", "Content": "I am enjoying learning more about the camera on an everyday basis.  I do feel the camera is a bit overpriced, but overall I like the camera.", "Date": "December 5, 2009"}, {"Title": "great camera", "Author": "M. E.", "ReviewID": "R1GO437VLOXRAT", "Overall": "5.0", "Content": "I am still getting use to very small size of this camera and using of all features properly. It's my first digital camera. The pictures I have made are so far brilliantly clear, colorwise very truthfull. I tried a portrait by candle light in otherwise dark room and came out great.The small size is very practical for having it anytime handy. I bought hard carry in case for better protection. I did not try taking any video, for that I am having HD camcorder. This one would serve just for immediate \"emergency\" situation. Battery was charged so far once, maybe a month ago and is still functioning well. I am testing how long it can stay charged.Camera is black, no need to spend more money for silver or gold. This price was the best, even better then Best Buys. Whoever buys, don't forget to set besides date also red eye reduction \"on\". The camera as I bought it had no setting and I was puzzled why I am getting horribly red eyes.Before I bought this camera I made study thru Internet what camera to buy and decided thanks to all reviews and features for this one.Only thing I am missing is more powerful zoom.", "Date": "December 5, 2009"}, {"Title": "One Year Owner - Almost Perfect", "Author": "Ching Vang \"Chingy\"", "ReviewID": "R2HOMSNQ22HEKV", "Overall": "4.0", "Content": "I have this camera for one whole year, so if anyone wants a accurate review, read on.After one year....- On/ off button kind of receded into the camera, like TV buttons that are over used, so I have to press it hard everytime, hopeing it'll turn on/ off. It usually takes me a few tries just to turn it on when the precious moment comes.- The audio just died yesterday. I was using a lot of flash at the park then I saw a powder of smoke come out of the microphone. Then I came home and the audio/ microphone doesn't work anymore. I can still hear it if I upload videos onto my computer and watch it, but play back audio in the camera doesn't work.- Scratches all over the camera. don't believe them when they say it's scratch resistant.- The viewfinder is useless. Not accurate and very small. The battery life is fine so you won't need to use a non accurate view finder.- Sand got into the zoom, so the zoom lever is stuck at times. Sometimes, it feels like there is super glue in the lever, so I have to manually push it back and fort a few times to unlock itself from the sand particles. It's annoying when I'm in the middle of a precious moment, only to find the zoom lever stuck.- Out of one whole year, I've only had one video that glitched on me, and a few glitched photos.- Video is out dated. 640 X 480, 30fps is very dated in this HD day and age. Plus you can only use digital zoom while in video, which results in blurry, aliasing horrible looking video. You can digital zoom first then take a video and it'll look much better than zooming while video, but it's still not optical zoom. Video at night sucks. Lots of noise in low light videos and it is weaker than your eyes. So you don't get what you can see in a real dark room. The video seems kind of choppy for 30 fps, maybe it's really 29 fps. You can edit, trim videos in the camera.- Picture quality was considered great a year ago. But there are newer canon compact models with better noise control for about the same price. ISO 80-200 is fine, but you can still see Canon's noise reduction even at these low ISO. ISO 400 is ok, but ISO 800-1600 is awful, full of blue and red noise so I never use them. The ISO 3200 was considered god a year ago, but now other canon models have better picture qualities for the same price. It was great when I first started shooting with it, but after I took a 20 minute long video, the camera burned up and the photos degraded since. So now there is noise reduction even at ISO 80. You can edit colors, trim pictures in the camera. Even has it's own slideshow (No audio).- very easy to use. Canon compacts beat every other brands because the buttons are a one touch wonder. A few touch can get you to macro, flash, color controls. Unlike other brands. Canon has the best controls and very easy to use.-Battery Life is very good compared to my old Canon SD790. Maybe because this camera only has a 2.5 screen while the SD790 had a 3.0 screen. But it'll last you a whole day at the park.- Focuses great for a compact. It does take a few seconds to focus in low light and not as accurately. Thank god it has manual focus (One of the first compacts to have it) because some macro shots just wont focus especially when there is to many leaves on screen or when the background and the subject are close together.- It has manual controls (The first compact ever to have Manual control) so I can catch jump shots and sports in daylight hours. But in the evening or on cloudy days, it it reminds me that it's still just a compact with manual controls. Now a days, Almost all Canon compacts come with Manual controls, so you can skip this camera if Manual control was all you wanted it for.- I-Contrast seems useful but it adds a lot of noise, and it highlights the whole picture, not just the dark subject. So If the foreground was dark and you used I-Contrast, it will lighten the foreground but also lighten the background. So you get a very bright, over exposed background for the cost. I never use it anymore because I can just lighten up the picture in photoshop or any other program, with more controls over the highlight.- Colors are so good and the camera gives you lots of color controls. Auto mode has no color controls, so the picture turns up kind of washed out and gray looking. But you can always add/ fix the colors in the camera. My colors beat all of my cousin's colors from his Sony, and Nikon compacts. You can edit the colors of the photo in the camera. Canon has alwaysbeen known for it's Vivid colors.Final Though : Almost perfect camera except for all of the negatives above. This camera was great because it was the first Canon compact to have Manual control/ focus, useable ISO 3200, and many other specs. But newer Canon compact models have it all plus better picture quality and HD videos, newer specs at about the same price (Still no optical zoom while in video). My advice is to look at all the newer Canon models first, because they have everything this camera has, plus better specs for the same price.", "Date": "November 30, 2009"}, {"Title": "Good Camera but a bit pricey", "Author": "Rosie", "ReviewID": "R2SICONUVF0G8G", "Overall": "4.0", "Content": "Nice camera ... takes great photos.  The wide angle leave a bit to be desired.  It is hardly a wide angle.  Other than that it is a nice compact camera.  It takes nice crisp and sharp pictures.  The camera gives you a lot of room to zoom in and crop a picture before printing it.  I recommend the Canon Leather carrying case for it as well.  It fits nice and snug in the hard case.  I literally throw it in the bottom of my brief case and have no problems with it.  Contrary to other reviews, my camera holds a nice charge!", "Date": "November 12, 2009"}, {"Title": "Canon still leads in the compact camera arena", "Author": "Charlie", "ReviewID": "R1GK7VHXUFLN8J", "Overall": "5.0", "Content": "As a long standing owner of Canon cameras over 30 years the company continues to make a variety of cameras that fill the needs of amateurs to professionals.  As a compact point and shoot, stylish camera with high resolution, bright large screen, and easy controls the SD900IS does a very good job.  The Nikon CoolPix cameras are the nearest competitors.  If you compare them side to side I feel Canon wins out. Go to a camera store and do a head to head comparison.  Canon has always had very good refresh rates between pictures, not taking long to write to the memory card. The rechargeable battery life is good. A spare battery is always a good idea to have on hand to switch out if needed.  The camera is not for professional shots and fast action sequences but it can handle 95% of the average users needs. Nice zoom range.  Great for faces and close ups.  The camera is for my daughter and she loves it.  Any teenager or adult looking for an easy to carry camera with very good quality images will enjoy the SD900IS.", "Date": "September 13, 2009"}, {"Title": "Awesome !!!!!!!", "Author": "R. PLAZOLA \"Bobby Plazola\"", "ReviewID": "R1MUNU4L0NYLXF", "Overall": "5.0", "Content": "The best camera I have ever owned.  This is my eighth digital camera, I have been purchasing only Canon cameras for the last four.The quality of pictures is amazing and that's not even the best part.  The HD video will blow you away!  Easy to use and the size issuch that you can put it in your pocket and take it anywhere, never miss another photo shoot opportunity.Five star all the way.", "Date": "September 6, 2009"}, {"Title": "Best Value", "Author": "Ethan's Mommy", "ReviewID": "R2C5T5USY22IUJ", "Overall": "5.0", "Content": "I just got this camera for the birth of our son.  I LOVE it!  I'm still exploring all its features, but it is the best digital camera I've ever had.  The pictures are VERY good.  The price on amazon can't be beat! (Its $400 in the store) I do suggest getting a larger memory card for it though.  It comes with a 32 MB card (not enough!).  I found a cheap 4GB card on amazon which is more than enough memory.", "Date": "August 26, 2009"}, {"Title": "Great camera", "Author": "D. Thompson", "ReviewID": "R10S0BO9KY9V16", "Overall": "5.0", "Content": "I am impressed with this camera. I did alot of research before finally choosing this one and I'm very happy with my choice. It's easy to use and takes fantastic pictures. Probably the best photos I've ever seen and I worked in a photo printing lab for a year so I've seen alot of pictures. It is definetely worth the money.", "Date": "July 6, 2009"}, {"Title": "Small wonder", "Author": "Nonni4hlk", "ReviewID": "R2PGSDYCZG2XUZ", "Overall": "5.0", "Content": "Replacing my old Canon with a new Canon was quite an undertaking of sorts. I researched and researched via various websites and finally chose the SD990. My requirements are simple...point...shoot...print and for not a ton of money! I am not one to read instructions to any great length and with this camera I really didn't need to as it is very user-friendly. The software is great...downloads are easy and there are many ways to alter the photo so that the finished print looks great. The camera is so good that it enables you to take a photo of something moving (slowly), like an animal in the zoo, without the end result being blurry. The zoom is wonderful. The large screen is fantastic. The only con I have and I can absolutely live with it is the on/off button. It requires using my thumbnail pressed into it to turn it on. Using the pad of my finger doesn't get it done, however, I'm so used to it now that it is no longer a problem. Also, the design of the camera is very sleek and can sometimes feel a bit slippery in your hand so I just use the strap each time I go to take a photo which insures the safety & well-being of the camera...I can be clutsy at times :) I would recommend this camera to anyone who wants a point 'n' shoot camera that's easy to use and that produces great photos for not a ton of money.", "Date": "June 29, 2009"}, {"Title": "Canon Powershot SD990IS", "Author": "Joshua Berkowitz \"Kid-O\"", "ReviewID": "R2O6WLESHQBQGG", "Overall": "5.0", "Content": "This is my third Powershot camera.  Most recently, I replaced my lost SD800 with the 990.  The pictures are superior to those I've seen taken by other digital cameras (and that's not because I'm the one taking them).  The new modes are fun and useful, like the manual mode that allows you to control shutter speed and aperture, and the 3200 setting that allows you to take pictures without a flash in low light. I highly recommend this camera!", "Date": "June 27, 2009"}, {"Title": "A+", "Author": "iamGODrU", "ReviewID": "RFTQ5LJ7MWA2U", "Overall": "5.0", "Content": "Pros: Great camera. Easy to use for amateur as well as professional shooter. Picture clarity and image stabilization is also great.Cons: Price could be a little better, power button is small for big hands and fingersOverall, this camera is fun to use.", "Date": "February 16, 2009"}, {"Title": "Excellent camera", "Author": "Amazon Customer", "ReviewID": "R2XFEHYGWKYKKA", "Overall": "5.0", "Content": "This Canon PowerShot does it all... I like it for its convenience without having to lug around a big dslr camera.  It has image stabilization and it provides the photography enthusiast with a camera that can be used easily on auto mode or more professionally on a variety of other modes.", "Date": "February 12, 2009"}, {"Title": "Perfect For Me!", "Author": "Royce E. Rahn", "ReviewID": "R276AZN67DWK2Z", "Overall": "5.0", "Content": "I love my new camera.  The camera offers many different settings!  I went snowboarding in Mammoth this weekend and set the camera to \"SNOW\" and the pictures came out so clear.  I have had a couple pictures come out a little blurry because I sometimes have shaky hands; however it's a huge improvement to my previous canon powershot camera.  Also, if you're looking for a case for the camera I ordered the following case and the camera fits perfect:http://www.amazon.com/3n1-Combo-Kit-Neoprene-Powershot/dp/B001F0WT9O/ref=sr_1_44?ie=UTF8&s;=apparel&qid;=1234198419&sr;=8-44I thought when ordering this camera the battery was the same as my old powershot and it's not.  So rather than using my old battery I had to buy a new one.  I like to have a backup battery just in case my battery goes dead.  So I purchased this equivalent battery that is not the actual \"Cannon\" battery but much cheaper:http://www.amazon.com/Ultralast-UL-NB4L-Li-Ion-Battery-Equivalent/dp/B000K2NWYE/ref=pd_cp_cps_3?pf_rd_p=413863801&pf;_rd_s=center-41&pf;_rd_t=201&pf;_rd_i=B000KNJEX6&pf;_rd_m=ATVPDKIKX0DER&pf;_rd_r=0T0SZ511GGG9GFBM9DFRThe one thing on this camera that looks like it might break easily is the Memory & Battery cover.  It's plastic so I make sure I am extra careful opening it to remove the battery and/or memory stick.", "Date": "February 9, 2009"}, {"Title": "Works in all settings tested", "Author": "Willie", "ReviewID": "RJB77XGK5X9TW", "Overall": "5.0", "Content": "This camera is fast and accurate. It has easy navigate menus, including control over settings for those who desire.  Choose the correct setting and the pictures are awesome in low light through wicked bright light.  Action quick shots, indoor portraits, outdoor scenery all awesome.  Face recognition software just plain works every time and quickly.  Canon reportedly upgraded this and I believe it based on seeing it in action.  Image stabilization works without noticeable slowdown.  A nice plus is this may be the only new camera with a plain view port for those quick shots you don't have time to check the LCD screen (like when my son was climbing and snapped some shots).  You can easily edit shots in the camera if you don't want to wait for downloads.  The case is strong.  The battery seems to last a long time.  We haven't been able to find a negative for the camera.  The associated warranty extension is another matter....", "Date": "February 8, 2009"}, {"Title": "One of the best cameras in its class", "Author": "MO. Bari \"Mo\"", "ReviewID": "RZSS1BIV1DDUW", "Overall": "5.0", "Content": "After much research I bought this camera and I couldn't be happier with my purchase. I use it almost every day and take it with me where ever I go. Excellent battery life, picture quality and features.", "Date": "February 7, 2009"}, {"Title": "Love this camera!", "Author": "L. Yeash \"Mother Earth\"", "ReviewID": "R3ECM2KLQQU1IC", "Overall": "5.0", "Content": "Consumer Reports Magazine consistently ranks Canon cameras as the best so they are the only ones I consider.  This camera has a rapid fire shutter feature that allows you to take pictures in rapid succession so if a parade is going by or your child is performing in an event, you don't miss a shot waiting for the battery or camera to recharge.  It is very simple for the average person to use but if you want more manual control and less automatic, you can do that.  I don't know what all the features mean to do it manually but I could if I read the simple to understand instruction manual.  My only criticism is the camera is not ergonomic to hold so I always put on my wrist strap and not worry about dropping it.  I would highly recommend this camera to anyone, it is amazing in every respect.", "Date": "February 3, 2009"}, {"Title": "Digital Camera", "Author": "J. Martin \"online shopper\"", "ReviewID": "R1PUFJXRMZI58L", "Overall": "5.0", "Content": "Great product.  I was totally pleased with my Canon camera.  I have two new babies in the family and I'm able to capture crystal clear moments and have the memories to cherish.  My last digital camera was a disappointment because many images captured were blurry.", "Date": "January 11, 2009"}, {"Title": "Not worth the extra money in my opinion", "Author": "Amazon Addict", "ReviewID": "RTPOVQYWZE7NZ", "Overall": "3.0", "Content": "I had the SD1100IS Canon PowerShot SD1100IS 8MP Digital Camera with 3x Optical Image Stabilized Zoom (Blue) and decided I was going to upgrade to the SD990IS because I liked the look of the all black camera better and it was supposed to be a better all around camera.I used it for one day and found that for a point and shoot camera the 990IS is not better than the 1100IS. My 1100IS would take clear in focus pictures every single time. The 990IS I had a lot of pictures that were out of focus. When you are out on the town and just snapping pictures as the night goes on you don't really take time to review them all until you come home and I found that maybe 1 out of 6 pictures were out of focus. This is unacceptable to me when I have paid more for a camera that doesn't perform as well.  I am going to return this camera and get the SD1200IS Canon PowerShot SD1200IS 10 MP Digital Camera with 3x Optical Image Stabilized Zoom and 2.5-inch LCD (Dark Gray)as it is the next gen of the SD1100IS. Check out that page to get my review of it. I already have a review of the 1100.", "Date": "May 11, 2009"}, {"Title": "I guess I was expecting a little more...", "Author": "CC777 \"ccz777\"", "ReviewID": "RXMGFJ6AAJYX7", "Overall": "4.0", "Content": "I upgraded from SD-450 to this camera.  I guess my expectations were high.  So, far my photos are good but not better than the 450 as far as the clarity.  My biggest issue with this camera is that my photos are soft (not sharp) indoors.  In good lighting, they are amazing.  Also, I wish the LCD viewer was a larger.With that said, I love the face recognition with the zoom feature and \"quick shot\" feature that makes this camera work similar to an SLR.  The video is very clear. I have only used the camera about 8 times so I will update this review upon further examination.", "Date": "December 21, 2008"}, {"Title": "This camera only cost $399.00 brand new", "Author": "Carolyn Yane", "ReviewID": "RI31SI3GQ0TXX", "Overall": "5.0", "Content": "I bought this camera new shortly after canon released it.  I paid only $399.00 for it along with all the trimmings from Canon's website.  This camera is no longer available.  How can one justify asking such a ridiculous price?  I love the camera, but please!!!!!!!!!!!!!!!!!!", "Date": "February 21, 2012"}, {"Title": "Watch for red and yellow eye", "Author": "wyldwrh", "ReviewID": "R2I4AQH9X8F2BE", "Overall": "3.0", "Content": "This camera would be great if you could take a picture of someone without the dreaded demon eye or red eye.  It also does very poorly in low light. Outside it does a great job with vivid pictures that are quite impressive.  If only it would work better in low light and indoors.", "Date": "June 28, 2011"}, {"Title": "Lens Error, Restart Camera problem", "Author": "L33.T \"L33.T\"", "ReviewID": "R1DZ9ZPVXHD99Q", "Overall": "3.0", "Content": "I bought this Canon SD990IS on Amazon 3/2009. Its now 11/2009 and i'm receiving the infamous \"Lens Error, Restart Camera\" error (search online and you will find tons of people with this issue on lots of Canon cameras) when I try to turn my camera on. I always have it in my fully padded case and I have never gone to the beach with it (so no sand inside). The camera clicks and beeps and then displays the error, and then it shuts right off. I have just requested for a free repair and I am going to send it in. I hope I will not get charged for this repair! I will update this and see if Canon warranty really does suck like how most people say they do.. and if they will charge me for this repair, even though i'm only 7 months into this warranty. Crosses fingers! I hope they fix this camera for free because it was a nice camera!", "Date": "November 22, 2009"}, {"Title": "a multitude of modes to learn", "Author": "ernster", "ReviewID": "R3KVN7JWAXY4BV", "Overall": "4.0", "Content": "i was in the market for a new camera to replace an aging sony cybershot from 2001.  while searching through various brands, i came upon the lesser brother of this elph at best buy.  the odd thing was that it was missing many features that this camera provides and was only 20 dollars cheaper.the camera has many modes to learn:  you can splice shots together, you can concentrate on a particular color in the landscape to accentuate, and the picture quality is excellent for a point and shoot.  the macro shots are crisp, and the auto features make this easy for newbie camera operators like myself to take great pictures.i was disappointed in the movie mode in as much as the other cheaper canon models had high definition movie capability that this one appears to lack.it's small enough to palm, and the contruction is sturdy and doesn't feel like it's going to fall apart after using outdoors day in and day out.", "Date": "September 29, 2009"}, {"Title": "Excellent overall", "Author": "Hellau", "ReviewID": "R1B25T9MBCQH5U", "Overall": "5.0", "Content": "Pricey photo camera, but very nice. I took close up of moving animals, and they came out with a quality of professional shots! This camera is very good all around.", "Date": "August 1, 2009"}, {"Title": "Great Camera", "Author": "Allen Chen", "ReviewID": "R2LUKB2988U5IF", "Overall": "5.0", "Content": "This camera is great! It takes great pictures and it has all these different features such as foliage, waterfalls, or night options that allow for taking even better pictures! I recommend this camera to everyone!", "Date": "April 6, 2009"}, {"Title": "An excellent camera, but \"manual\" mode is misrepresented", "Author": "Kimboi", "ReviewID": "R1MT8T1SC3VS73", "Overall": "5.0", "Content": "I had a SD790 that impressed me greatly: terrific image quality and many useful features. However I discovered that I had frequent trouble composing my images using the screen and I wanted more control over the image (motion control, depth of field). So I returned it and got the SD790 after doing a lot of research (but not enough, apparently). The \"manual\" mode only gives you the choice of two aperture settings! You can pick any shutter speed you want, but obviously only the one corresponding to the selected aperture will give you the correct exposure. Maybe that's not important to you, but it was to me -- very much. I'd probably have bought a different camera (or not bothered to return the 790) had I realized this. I feel that Canon's description of this mode as \"manual\" is misleading and deceptive, it may constitute false advertising.", "Date": "March 29, 2009"}, {"Title": "Great Camera!!!", "Author": "Marlyn Ampueda", "ReviewID": "R22NKSCREFBETB", "Overall": "4.0", "Content": "I've just started in this hobby: taking pictures, and I bought this camera without knowing most of its fuctions, but in the past 2 months I've realized that Canon SD990 IS it's a great camera, the face detection works great, and the image stabilization plus quick shot works great for those who wants to take pics of their own pets or other animals or people in sports (like me). I also owned but lost the Canon A720 IS, great camera too but too big. Negative: takes a wide long from pic to pic when you are using the flash in a very dark places and the videos are not compatibles whith Window Media Player. For those who know the technichals details I apologize because this is not the right way to describe a product, and for those who wants a great camera for great price buy this one.", "Date": "February 11, 2009"}, {"Title": "super Awesome Camera", "Author": "CoDy", "ReviewID": "R3BP2C2SHYNTDS", "Overall": "5.0", "Content": "I have owned this camera for a month now and have not found anything wrong with it.  It takes amazing pictures.  Probably one of the best features it has is the Manual/Program mode. I can take quality photos without paying the price for a big digital SLR.  I also enjoy that it is small enough for me to take wherever I go.  I highly recommend this camera to anyone.  Good for the beginner clear up to the more advanced photographer.", "Date": "February 7, 2009"}, {"Title": "Another nice canon product", "Author": "Kyle", "ReviewID": "R2DV79LC63S0AQ", "Overall": "5.0", "Content": "This canon camera is a real nice point and shoot with an easy to use GUI and it didn't take me long to start getting some real nice pictures. You cant go wrong with this camera if your looking for probably the best camera right now that you can carry on you at all times. There is only one thing I have noticed though, and im not sure if it has been there all along but there is a dead/stuck pixel near the center of the screen, but its only there when you are viewing on the lcd screen, once I push the take button down halfway to focus it, it goes away. Not sure if its normal or not, but it doesn't affect its usage and doesn't show up in pictures and I see no reason to return it, I'm not that picky. Overall I recommend this camera", "Date": "January 17, 2009"}, {"Title": "Great Gift!", "Author": "Christian P. Santos", "ReviewID": "R3DGM11V33O15S", "Overall": "5.0", "Content": "Received this product as a gift from my girlfriend, I reallt love this camera, its easy to use and the quality of the pictures are great.", "Date": "January 7, 2009"}, {"Title": "Sold it after 3 months.", "Author": "Johnny Lightning \"Driver\"", "ReviewID": "R2TM897TRMRH21", "Overall": "2.0", "Content": "I am a Canon guy.  I love most of Canon's cameras.  I purchased this SD990IS to replace my SD660 that was dropped and broken.  I was very excited about this camera when I ordered it from Amazon.  I thought it would be the end all beat all point and shoot camera.  First I did not like the build quality.  It feels like a plastic toy Sponge Bob camera.  When you push on the power button it feels like it is going to break.  I would have never purchased it if I would have seen one in person before.  Second big drawback is the slow shutter speed.  I though that I could get over it but after missing the shot time and time again I had to get rid of this camera.  It took close to a second to snap off the shot.  On the plus side the low light pictures were great.  Also the ability to zoom in on a 14.7MP picture will blow your mind.  It takes GREAT pictures.  Its just slow.", "Date": "January 28, 2010"}, {"Title": "Useless battery!", "Author": "Love 2 Bake", "ReviewID": "R1OOVR3SD54X2R", "Overall": "2.0", "Content": "Don't do it!  Just don't!  Frequently, within moments of installing the freshly charged battery, I get a message telling me to change the battery pack.  What?!?  Then at other times it would act fine, so I'd think this camera was okay after all.  Then it would happen again--I could never tell when--and I'd lose pictures because of this ridiculous battery!  I bought a second battery as a back up, hoping against hope that this camera was salvageable.  No difference!  I'm sending this entire piece of garbage back.", "Date": "May 22, 2011"}, {"Title": "Cannon fans: first time Cannon disappointed me =(", "Author": "Regular working mom", "ReviewID": "R3GZU337C8NUI9", "Overall": "2.0", "Content": "Extremely hard to control the quality of this camera.(or I should say very difficult to get the functions correct)  Sometime I get very good quality other time I get really bad quality (NOT because I shake the camera!) eventhough I have adjust it to \"auto\"...  seem like you have to manually adjust it to the correct scene inorder to get good quality of pictures...  I got this camera for over 3 years and I still couldn't get it correct...  The video quality is not good either unless you don't zoom it.", "Date": "March 1, 2011"}, {"Title": "Great Compact Super-Zoom!", "Author": "TL in AZ", "ReviewID": "R2TRTLVNMMFYXV", "Overall": "5.0", "Content": "Ok, so you're looking for a compact super-zoom camera and scoured the 'net reading all the reviews about how the Panasonic Lumix ZS-3 beats the Canon SX200IS. Well, let me tell you, the SX200IS is a far more enjoyable camera to use. I initially purchased a ZS-3 and found it lacking in the \"fun-to-use\" category and overall picture quality.First, a caveat: I've owned multiple Canon point-and-shoots, so I'm very comfortable with the user interface and most importantly, I like how the Canon DIGiC chips process the images. So, yes, I'm a bit biased, but I went ahead and tried the Lumix ZS-3 anyway based on its many positive reviews.My disappointments with the Lumix ZS-3 were the following:-Loose (or at the least, less solid feeling than the SX200IS) mode selector wheel.-Grainy looking pics even at the lowest ISOs-Flat looking colors-Less-intuitive menu system-Doesn't feel as substantive in your handI ultimately exchanged it for the Canon SX200IS and couldn't be more pleased...Here's why:-User-friendlier menu system-Full manual controls-Really easy to adjust exposure, ISO, and flash power-Smooth two-speed zoom motor-Better image processing (richer colors at default settings)-Good movie recording (remember, no optical zoom though)-Solid build quality (feels just right in your hand)Some other thoughts:It takes a few days to get used to the pop-up flash. One time I had my finger on the flash cover (which lays flat when the flash is deployed) while shutting down the camera. The lens retracted, but flash stayed put until I lifted my finger and allowed the motor/spring-loaded mechanism to pull the flash inside. Just remember keep you finger away from the cover when turning the camera on/off.Pick up a screen protector from Clarivue ([...]) to protect the 3\" LCD from fingerprints and scratches.All-in-all, this is a terrific camera for someone who wants a compact camera to take along on trips, to capture spontaneous family memories and to have fun while taking pics and learning digital photography. I enjoy using it even more than my Nikon D40.Good luck in your search for a compact super-zoom and remember to keep expectations realistic; Compacts can't rival the picture quality of DSLRs, but cameras like the Canon SX200IS make picture-taking a joy.", "Date": "December 31, 2009"}, {"Title": "CANON POWERSHOT IS A POWERSHOT.", "Author": "AVATAR VINCE", "ReviewID": "RYH7R4U8488U8", "Overall": "5.0", "Content": "AMAZING PRODUCT!I HIGHLY RECOMMEND IT.I AM A PROFESSIONAL VIDEOGRAPHER AND WANTED A CAMERA THAT WAS EASY TO USE AS A POINT AND SHOOT.", "Date": "December 3, 2009"}, {"Title": "A great camera", "Author": "Web Warrior", "ReviewID": "R1F0TB0LZQZXWJ", "Overall": "5.0", "Content": "I selected this camera after spending hours reading many, many reviews on [...], [...] and here on Amazon.  It is a tremendous camera and is galaxies better than my old Kodak LS443.  I especially like the fact it has a viewfinder, not something mentioned by very many reviewers.  It does everything well.  It is easy to use.  My only minor complaints and they are that, very minor is I wish it was just a bit bigger because I'm a large guy with big hands.  Also have to be careful not to cover up the flash holding it but that's easy to teach yourself to overcome.  Finally, I would have exchanged some of the very small size for just a little more wide angle and telephoto lens capability.  Considering the size of the camera this does a commendable job.  This is the only digital point and shoot to get great reviews by [...], [...] and Amazon.  The three complaints I read on Amazon reflect a lack of understanding rather than honest criticism of this great Canon camera.", "Date": "November 2, 2009"}, {"Title": "Great Camera", "Author": "Christopher Rennick", "ReviewID": "R1K66TG30542K8", "Overall": "5.0", "Content": "I am completely satisfied with this camera.  I read many reviews of many cameras and decided on this camera for image quality and ease of use.  The negative reviews must be due to operator error or some anomalous defects as I have not experienced any problems that were not of my own doing.  I have really enjoyed doing close up photos of plants and sea shells.  The manual focus capability has really made it possible to get truly sharp, high resolution images for later manipulation.  I do most of my shooting in fairly bright light so the ISO has been low and noise in the pictures is practically non-existent.  When I see what this camera can do with fairly miniscule optics, it makes me wonder what life would be like with a EOS 5D mk 2 with an L series lens.", "Date": "October 27, 2009"}, {"Title": "Canon Powershot SD 9901S 1407 MP", "Author": "Jeanette Rodriguez", "ReviewID": "R3BVDXA9N42ZP1", "Overall": "4.0", "Content": "Really good pictures.  I would like more user friendly and better direction in instruction book, but great pictures make up for it.", "Date": "October 26, 2009"}, {"Title": "Canon camera", "Author": "Tommy H. Beard \"\"Top Gun\"\"", "ReviewID": "R2DVAP81QXBMJ3", "Overall": "5.0", "Content": "Very nice camera. Great size to take anywhere. Took it to SeaWorld yesterday and it was handy and useful.", "Date": "October 19, 2009"}, {"Title": "nice camera", "Author": "Rose Graham", "ReviewID": "RN8AZJYWB5G5E", "Overall": "4.0", "Content": "I found this camera to be a really nice one.  However I bought it for the reason, I understood, it was great for closeups.  I used the micro but was a little bit disappointed in the picture quality.  I have another Canon that I use and it was better than this one.  I gave this one to a friend and he loves it.  He has been able to take really nice pictures and it is so easy to use.  So there you have it.  I would recommend buying this camera, but not for really close closeups.", "Date": "October 16, 2009"}, {"Title": "How easy to get great pictures", "Author": "L. Collins \"sidewinder\"", "ReviewID": "R3JHH6V6EB4DY5", "Overall": "5.0", "Content": "Been looking for a good quality point shoot camera and I have found it in the Canon SD990IS. Got rid of my Pentax Program 35mm and very seldom even use my Minolta diamage camera anymore because it is so much easier to carry the pocket size SD990IS which takes as good pictures as my pervious cameras. Now I am seldom without my camera so when the old \" I wish I had the camera \" moment comes along I get the shot now. Used this for my son's recent wedding and was plesently supprised with the quality pictures and only my poor composure tecnique caused some pictures that weren't keepers.", "Date": "October 13, 2009"}, {"Title": "Totally diggin' it!", "Author": "R. Jewell \"boysmommy\"", "ReviewID": "R32LET4Z92VO28", "Overall": "5.0", "Content": "This camera takes better pictures than the $1000+ Nikon my husband bought me 2 years ago.  I bought so I could have something to throw in my purse and it has been fantastic.", "Date": "October 13, 2009"}, {"Title": "Cannon Powershoot Products", "Author": null, "ReviewID": "R5OW63DGEO2UV", "Overall": "4.0", "Content": "The camera have good resolution and great new features but you have to read the manual to get the resolution you want. The only bad thing is older models have a safe lock in the battery and memory stick cover and this model not.", "Date": "October 12, 2009"}, {"Title": "Excellent Camera!", "Author": "C. Delong", "ReviewID": "R29X9AH83MY1O0", "Overall": "5.0", "Content": "I love this camera.  I just sold my DSLR because I wanted something smaller but something that took great photos and this is it.  The video is amazing too.  I was on a job taking video and photos of a dam repair and the video I produced had amazing quality.  If you are looking for a point and shoot and can afford it I would definitely recommend this one.  Everyone I've shown the photos too loves it and can't believe I only paid 299!", "Date": "October 10, 2009"}, {"Title": "Good camera", "Author": "Michelle Fitzenhagen \"picky picture taker\"", "ReviewID": "R23X420XWKFQSI", "Overall": "5.0", "Content": "Good camera - great pictures;  I am looking for a camera that takes pictures quickly.  This has that feature but you cannot use the video screen; you have to look through a tiny view finder.", "Date": "October 9, 2009"}, {"Title": "Canon Powershot SD990IS 14.7MP Digital Camera with 3.7x Optical Image Stabilized Zoom", "Author": "Garnet Ambrose", "ReviewID": "R1V68FD67GH7ZH", "Overall": "5.0", "Content": "The Canon Powershot SD990IS 14.7MP Digital Camera with 3.7x Optical Image Stabilized Zoom is the best little camera I've used yet. From micro pictures to large landscape shoots this Camera is the best bang for your buck.", "Date": "October 3, 2009"}, {"Title": "AWESOME CAMERA", "Author": "Jason T", "ReviewID": "RAA99C6LEIUHY", "Overall": "5.0", "Content": "This camera is very good. It takes very good pictures and has good battery life. The only downside about it is its a little bigger than i thought it would be, but overall it is a great camera", "Date": "September 30, 2009"}, {"Title": "excellent purchase", "Author": "Tricolor", "ReviewID": "RZJGD5YHO5VMT", "Overall": "5.0", "Content": "Excellent camera and very easy to carry.The best review I can write is that a I have the same camera and I bought a new one for my daughter.Easy to use and as I bought the underwater case it takes wonderful underwater pictures.Great purchase.", "Date": "September 24, 2009"}, {"Title": "Sierra Hiker", "Author": "Mark Brenner \"sierra Hiker\"", "ReviewID": "RQBIRD8WJIC3A", "Overall": "5.0", "Content": "Canon Powershot SD990IS 14.7MP Digital Camera with 3.7x Optical Image Stabilized Zoom (Black)We bought this camera to replace a Canon A640.  The Photos are wonderfully sharp, excellent color and contrast.  It is perfect for both macro photography along with outstanding scenic shots.  Nice size to slip in a pocket.  We bought the Caselogic UNZ-2 Small Universal Pocket - perfect for a simple case but not room for a spear battery or extra memory card.", "Date": "April 25, 2009"}, {"Title": "Cannon Powershot SD990 IS", "Author": "C. Faile", "ReviewID": "RICTJS8TVSE7L", "Overall": "5.0", "Content": "Excellent product,  Preforms admirably in any condition and light setting.  Offers all the options and adjustments most would ever want, and will work as a great point& shoot at the same time", "Date": "March 31, 2009"}, {"Title": "GREAT CAMERA", "Author": "Fred B. Clark", "ReviewID": "RT9HS59D5T1JJ", "Overall": "5.0", "Content": "I've used it for a month and couldn't be happier!!! Fred", "Date": "February 4, 2009"}, {"Title": "first shot delay", "Author": "P. Hsieh", "ReviewID": "R3EORKRHD0MZB2", "Overall": "4.0", "Content": "This camera works well while the light is bright. When the light is not so good, the pictures blur. Although the flash light solves the blur problem, it is so strong that the pictures look unnatural.", "Date": "February 3, 2009"}, {"Title": "Camera lens fails to retract", "Author": "road trip reader", "ReviewID": "R17BQ56WXKWM42", "Overall": "2.0", "Content": "Purchased to take on trip to australia resolution seemed good after 900 photos camera suddenly stopped working.changed batteries& that wasnt the problem. For first 3 weeks it was terrific;tho noticed it did not seem as tightly sealed on sides as my previous canon elph. At least it broke during final week of trip and it appears completely broken googled & found on steves digicam reviews numerous others with exact same experience of lens and camera suddenly stopping.monday will contact canon but from other users it sounds as if canon blames this on humidity!!!!My dslr is a canon& this is really too bad.fortunately the sd card seems fine obviously more robust than the camera...Again i was ready to give this a great review until it suddenly stopped working a few days ago..", "Date": "February 7, 2009"}, {"Title": "Excellent Elph Powershot", "Author": "CoexistCapeCod \"CapeCodCoexist\"", "ReviewID": "R2BA0BLN5AVK0V", "Overall": "4.0", "Content": "This is my fifth or sixth Canon Elph Powershot and I love it. I actually bought it when it first came out and sold it when I bought a G10 (another great camera). I love the G10 - but it is bulky and I wasn't grabbing it every time I went out - like I did with my SD990.....so I bought another one! Now I have 2 cameras that I love - both do or have something that the other doesn't so I will be a 2 camera guy. I love the cropping ability of the SD990. Picture quality is excellent. The only thing I wish it had was either a wider lens or a longer zoom. Aside from that it is perfect for me! I highly recommend it!", "Date": "October 17, 2009"}, {"Title": "Canon Powershot SD990IS 14.7MP Digital Camera with 3.7x Optical Image Stabilized", "Author": "Carl E. Brown \"cbsports1\"", "ReviewID": "R620PF88Q9UX0", "Overall": "5.0", "Content": "Canon Powershot SD990IS 14.7MP Digital Camera with 3.7x Optical Image Stabilized  GREAT CAMERA", "Date": "August 19, 2009"}, {"Title": "Delievered as promised", "Author": "Jason Wang \"Jason\"", "ReviewID": "RHRYNF3K5EWTU", "Overall": "5.0", "Content": "Great camera and the vendor delivered as promised, quick shipping, and great product. Would recommend...", "Date": "May 14, 2009"}, {"Title": "great compact camera", "Author": "L. Douglass", "ReviewID": "R2RSM51C7KOSCX", "Overall": "4.0", "Content": "I recieved my camera 2 days after ordering it using the free shipping.  I am not a camera buff but it takes great pictures.", "Date": "January 26, 2009"}, {"Title": "2 words", "Author": "Steve Arnold", "ReviewID": "RQMC4E33D7GQH", "Overall": "5.0", "Content": "I have only Two words that explains my review. Great Camera Great Price.....oops that was 4 words.", "Date": "January 25, 2009"}, {"Title": "A GREAT POINT AND SHOOT CAMERA", "Author": "JIMBUNKUS \"JIMMY D\"", "ReviewID": "ROES05TLA3HRP", "Overall": "5.0", "Content": "IT HAS TO BE THE BEST AND MOST ADVANCED POINT AND SHOOT CAMERA ON THE MARKET TODAY!!  BEAUTIFUL PICTURES BETTER THAN I COULD IMAGINE, THE AUTOMATIC FUNCTIONS ARE REALLY GREAT AND IS SOMETHING YOU CAN EAISLY USE AND APPRECIATE ESPECIALLY FOR QUICK POINT AND SHOOT PHOTOGRAPHY. I HAVE OWNED OTHERS KODAK, CASIO,MINOLTA ETC. BUT NONE TO COMPARE TO THIS CAMERA AND THE GREAT INCLUDED SOFTWARE!", "Date": "May 28, 2009"}, {"Title": "outstanding DC!!", "Author": "Jay M. Lau", "ReviewID": "R21E9OS5NMPO2G", "Overall": "5.0", "Content": "SD990IS is an outstanding DC I even used. Lots of functions, quick start, sensitive face-detection, and much more!! 3.7x optical IS zoom is very helpful for daily use. Good picture quality and low noise even in dark. Some people, esp. for girls, may complaint it is so thick, is not small enough, etc; but to me, it is the perfect size! If include wide-angle, that will be wonderful!!", "Date": "December 7, 2008"}, {"Title": "Not bad but poor picture quality if you don't hold the camera really still.", "Author": "SMW \"SWOLFE3074\"", "ReviewID": "R111SMN0F97M8H", "Overall": "3.0", "Content": "My wife and I bought this camera a month ago and took it with us on our trip to Cancun.  It takes great still pictures but when it comes to people and faces, well it comes off a bit short.  We took over 800 pictures in 8 days and most of the pictures with people were a bit unclear.  They were not as crisp as our pictures of scenery and FOOD :)Another thing we did not like about this camera is you really need to know how to use it to get a decent picture.  When we would pass the camera to a stranger or friend to take our picture, because they figure it is just a point and shoot, they snap the picture without doing any auto focusing and leave us with a not so great picture and a lost opportunity to save memories.  This is with the auto setting mind you in good light.All in all once you know how to use the camera it takes pretty good pictures.  The auto setting in low light does not select the correct ISO for the brightness so most pictures in a low light area under the auto setting come out too dark. For better pictures in low light you have to use the P/M setting but you also have to act as if you are a tripod and remain very still otherwise the picture will be blurry.I have just returned this camera to Amazon and am looking for a new one.", "Date": "November 16, 2009"}, {"Title": "Awesome!!", "Author": "A. Race", "ReviewID": "R15LZAYAR9BM7V", "Overall": "5.0", "Content": "Awesome camera! I haven't played around with everything yet, but it is an awesome camera.  A little pricey.  I would wait until the price comes down first.", "Date": "November 26, 2008"}, {"Title": "HD quality", "Author": "Miguel Fuentes \"COUNTRY BOY\"", "ReviewID": "R2VN222YSKO0N7", "Overall": "4.0", "Content": "The digital pictures are excellent, near HD quality. The numerous pictures format that can be taken are nice. The only drawback I had was reading the instruction manual the size of a small novel.", "Date": "April 24, 2009"}, {"Title": "\"Lens error - resart camera\"", "Author": "David W. Brantley \"Vino\"", "ReviewID": "RH34RODZPPQHW", "Overall": "1.0", "Content": "Purchased the SD990IS from amazon on November 24th, the second day we used it the camera beeped and shutdown but the lens did not retract, now when I turn on the power the camera beeps and displays the error message. I have contacted the manufacturer and am waiting to hear back. It is rediculous that I had to call Canon on an item only a few days old. One other note, the box looked as if it had been opened and repackaged when I received it...having never had an issue with items from amazon before I decided to try it...may have been a mistake on my part, we'll see.", "Date": "December 7, 2009"}, {"Title": "Good enough for the price", "Author": "Kiflom A. Tesfagaber \"kiflom\"", "ReviewID": "RYBHISTZVZDKD", "Overall": "3.0", "Content": "I got the camera recently and so far it is working fine. The only problem is taking distant pictures at night. May be I need to read the manual thoroughly.", "Date": "June 15, 2009"}, {"Title": "surper", "Author": "N. tran", "ReviewID": "R2MBL9G6MLUMYU", "Overall": "4.0", "Content": "amazon  price is usually cheap compared to local stores/ as always. fast and liable dealer. this prod is broght for some else to use. but just looking at it, it is somethig to satisfy most to the picturings", "Date": "August 1, 2009"}, {"Title": "Stopped working after 2 weeks", "Author": "V. Herbert \"Goldmohur\"", "ReviewID": "R25JW7K63QL0SR", "Overall": "2.0", "Content": "I bought this camera after reading all the positive reviews. However, my experience has not been positive.First of all, Canon should have given at least a 2 GB memory card with this expensive camera, or let the buyer know that they need to buy a larger memory card. What they gave was good only for 6 photos & that was a surprise to me. I bought a 2 GB memory card and used it for 2 weeks. The camera quit working during my vaction, much to my disappointment. The lens did not extend or open. I sent the camera to Canon and they fixed it for me & gave me no explanation as to why it quit working. I talked to their support staff who couldn't give me a reason either.I'm giving it 2 stars since the photos that I took on auto mode were of very good quality.", "Date": "February 28, 2009"}, {"Title": "I got it cheaper @ buydig.com", "Author": "Farren", "ReviewID": "R2A4UL1FHR06CM", "Overall": "5.0", "Content": "Amazon doesn't have the lowest prices anymore :(It will save you money to do your research...", "Date": "December 10, 2008"}, {"Title": "Was delivered in defective condition", "Author": "Stephen G. Bernard", "ReviewID": "RWLQG3QXRIQQT", "Overall": "1.0", "Content": "So rather than taking a chance on getting another 990is, I returned itand Amazon's Customer service was really great about taking it back andrefunding me.I would buy from Amazon again but not this particular model camera.It is not a wide angle camera and if you want wide angle don't buythis camera. Canon has other wide angle cameras.I can't comment too much on this one as it didn't work right butit was not wide angle at all.", "Date": "September 1, 2009"}, {"Title": "rattle inside new Canon Powershot SD 990", "Author": "A. Krivenyshev", "ReviewID": "R3RYMDRX2AMCKR", "Overall": "1.0", "Content": "Few minutes ago- just got my new Canon Powershot SD 990 IS and as you are taking Camera out of the shipping box- you can hear slight rattle inside camera- loose lens, loose protective cover or loose shutter rattle ???If you shake the camera gently, you can hear a rattle sound inside.Very disappointing with Canon- as my recent Canon Video GL2 ZOOM stop working (cable inside broke- cut off -presumably by tape door cover and Canon Image Stabilizer Lense EF-S 17-85 for EOS20 stop working also - with Error 99.", "Date": "February 13, 2009"}, {"Title": "canon sd990is disappoints", "Author": "mariqtrade \"mariqtrade\"", "ReviewID": "R1UTUB55749417", "Overall": "1.0", "Content": "my canon powershot sd870is is way much better than my new sd990is. the on and off button is so cheap! my advice is: skip this camera", "Date": "April 19, 2009"}, {"Title": "like my old camera better", "Author": "S.C.", "ReviewID": "RMSR94F2FZEO5", "Overall": "2.0", "Content": "maybe i dont know how to use it. but i had sony cybershot  works way better.  i like canon cause it take faster pictures. and better pictures at darker place. it auto adjust the color better than sony.  but my sony was a touch screen.  when i use manuel i can actsually point to where i want to focus on the screen with macro or not and it will focus exactlly where i wanted to focus on.  so i decied.. i'll just buy a cheaper canon for now till my husband bring my old camera back from iraq. hope this review helps...", "Date": "November 16, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "14.7-megapixel resolution for the highest image quality\n3.7x optical zoom with Optical Image Stabilizer; 2.5-inch PureColor LCD II\nDIGIC 4 Image Processor improves Face Detection\nQuick Mode decreases lag time so you don't miss anything\nCapture images to SD/SDHC memory cards", "Name": "Canon Powershot SD990IS 14.7MP Digital Camera with 3.7x Optical Image Stabilized Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41g2GNuOYhL._SX300_.jpg", "ProductID": "B001G5ZTWM"}}