{"Reviews": [{"Title": "Easy to configure and fast to use security camera DVR", "Author": "Recty", "ReviewID": "RJTIVYHV1I41Y", "Overall": "5.0", "Content": "I definitely recommend this product. I have experience with computers but had never set up a security camera DVR before, this was totally new territory for me. After doing some research this one seemed to be pretty easy to get configured and recording so I made the plunge.I couldnt have been happier. I like this system for it's ease of use (simple mouse click interface) and it's quick setup. It literally just needs a mouse plugged in (provided in the box) and a camera attached and you're off and running. It also is very easy to access the hard drive for removal or for upgrade to more space. It formats the new drive you place in and starts recording immediately.This product has a built in web server which is great for remote access. From either a web browse or a small piece of client software (standalone executable, doesnt even require an install) you can access your DVR remotely. From there, you can watch the camera(s) in real time, review old footage or backup a portion of video to your hard drive of the PC you're viewing the DVR from.Initially I didn't set up the configurable motion sensing option, but after a month or so I tried it out and it's a really great feature. With running 4 cameras, a 500GB hard drive filled up in about a month. Not a big deal, old footage just starts being wrote over, but this means they only have a month worth of footage to go back to. When I turned on motion sensing and then set the areas I cared about motion (i.e. I told it not to care about a spot where a tree seen through a window was always flapping in the breeze) I was able to extend the recorded footage to just slightly more than 2 months worth. That's amazing... two months of video from four cameras on a 500GB hard drive. With 2TB hard drives being quite affordable, I could easily see being able to store 6-8 months worth of footage on a single hard drive, for a typical 10-12 hour a day business.I also like the option to set up users... I use the built in administrator account, then the owner of the business has an account with basically all privileges but setup (so she cant get in and mess it up accidentally) and then I have also set up a manager account for all her managers to share with less permissions. They are basically allowed to see current footage, review old footage but not save it to their hard drive. When security camera footage is needed, they request it from the owner who then reviews it and downloads the times if deemed necessary. Obviously this is totally configurable depending on the dynamic of the place the DVR is placed in, but the option to configure separate users with specific permissions really is a nice feature.I liked this DVR setup so much I purchased another. I do computer support for a small business in town who has two storefronts. They asked me to attempt to set up a security camera system for them if I felt like I was able, so I made the attempt and was so successful with the first one they immediately wanted another security system set up in the second storefront. I had no qualms at all about purchasing another of this system, it's really a no brainer. For the price, you cant beat the features it provides and the ease of use. The business appreciated that it only takes at most an hour or two to get set up once you're familiar with the menus.My only dislike is the manual is pretty poor quality. I basically glanced at it and found the initial administrator password, then didnt bother looking at it again and went through the setup process. Anyone with any kind of computer background can easily set this up without the manual, and even a complete techno-caveman could still have pretty good success without turning to the manual.", "Date": "November 3, 2011"}, {"Title": "A Great DVR For The Money...", "Author": "evL", "ReviewID": "RWCTE1IOJ4JWA", "Overall": "5.0", "Content": "Hello Folks,So I was in the market for an inexpensive DVR. I noticed this one, and with a Linux OS backed by 1TB hard drive I gave it a chance. I must say I am very happy. And, I am new to the CCTV scene. Don't let the Linux side of things bother you, it's imbedded, no need to fuss with it. You will need to be a little tech savvy to get off and running with it. This is because the written manual is not very helpful. The manual on the CD that you get is a little better. I learned more about it every day for about two weeks and now have its operation down. It worked great with XP and SuSe OS's. Worked great on the following hardware, ML370, HB3320, WRT54GS, DV8300, and T42.Folks it's a damn good DVR for the price. The internet side of things works great. Email motion notifications, Schedule, Viewing over the internet, Motion sensitivity, PIP, and a whole lot more.Some of the Questions I had about this device that I know now, that I could find an answer to before my purchase, and which might be helpful to you, neither bad or good, are :: The written manual sucks, other than illustrations. Manual on the given CD is good. Some pretty kewl software comes on the CD as well such as a \"remote desktop\" for taking care of things with another computer, so you don't need an extra monitor for it. The HD is a 1TB Hitachi. I did \"kill it\" / re-format, on purpose and it bounded right back into shape with no issues. Meaning you can mess it all up if you wish and put it right back in the state it was when new. Yes four channels with an audio input on channel one only. Has video and audio out. Good overall design and feel, solid. Good mouse. Good remote. It will do motion only recording, no need to record all the time. Does FTP well to your own \"web space\" just fine if your a domain owner. You can watch \"anywhere\" with the use of the \"server\" given to you from manufacturer or if your really good, from your own \"web space\". You can back up to a USB thumb drive or any \"drive\" via USB. Does great on a network. It can be set up for ADSL, DHCP, LAN, and 3G. It can do PTZ control but I haven't tested that out fully. It can email to ten addresses, and as well have up to ten user accounts each with separate permissions if needed. Selection of \"motion zone within picture\" if needed. A very annoying alarm for various things which actually is quite nice. Super great picture from the VGA plug in back, so yes there is video out via BNC and a VGA plug for a monitor as well. Cat5 plug in the back for the network. Package had a power supply, CD, Manual, and Remote. Good grief... Not bad for the price.The device comes from U.S. Security Solutions. Google it. I think there at [...] now.So we'll see how she does in the long term but for now up and running 24/7 with out a hitch. It's running three cameras. I will more than likely purchase one more of these in the future. I really dig it. The best to you and yours...evL[][][]", "Date": "January 10, 2012"}, {"Title": "Nice, turn-key unit", "Author": "J. Doyle \"Power User\"", "ReviewID": "RYB9AQE8RVU6W", "Overall": "4.0", "Content": "This is a pretty nice, generic unit that operates as advertised.  Packaging was adequate, arrived a little slower than I'm accustomed to (as a Prime member) because it was drop-shipped...but I'm just spoiled.This is the recorder and remote only, no cameras, mics, monitor or anything else.  Just making sure you're paying attention!  I've used a bunch of the \"off the shelf\" product from Swann and Q-See in different configurations, and am using some of their cameras with this recorder at home now.We're really pretty happy with it.  Setting it up to see/change things over the internet would have been a LOT easier with better instructions...but eventually we prevailed.  Be prepared to have somebody who is \"web-savvy\" available to help with this part of the job.Haven't really put it through any tough \"paces\"...we just look at the house, the cat, the street to make sure things are as we expect around the house.  I'm planning to add a \"front door cam\", so we can see who's knocking.", "Date": "July 16, 2010"}, {"Title": "Works very well!", "Author": "Kurt Woznak", "ReviewID": "RRIKFIOTQ0V0B", "Overall": "4.0", "Content": "Rec'd the unit quicker than expected. I have been using this DVR for 2 months now and is working great. The only negative thing I can say is the manual is not very intuitive. I learned most of the functions by trial and error to get it set up the way I wanted. I feel the Software is more robust than other systems I had in the past. I would recommend this unit.", "Date": "October 29, 2012"}, {"Title": "Excellent", "Author": "Radio Guy", "ReviewID": "RO81KMYHQLW6R", "Overall": "5.0", "Content": "This DVR is great as it works perfectly and is easy to set up.  The video quality is flawless, unlike many other net enabled DVR units.  Overall, this one is a winner.", "Date": "March 22, 2010"}, {"Title": "worked better than i thought", "Author": "bokonon", "ReviewID": "RVOOEM2MUY3SL", "Overall": "4.0", "Content": "I am tech savvy, but extremely lazy and anything that causes me to mess with it more than 30 minutes, gets me very irritated.  This bordered on that, but ultimately it is working well now.  I setup the cameras first and that was zero hassle.  Plugged in my sony cams and they appeared on the screen.  I wanted to install this in a server rack I have setup in my garage and it would work for a few mins and then would start that annoying beeping.  I would look at it, and the screen would be the \"boot\" screen.  Dead.  I removed it from the server rack and its fine now.  I think the heat may have caused issues.  So be sure to keep this thing very well ventilated.  I have been running it for a few days without an issue now.I set it up to automatically FTP to my web server, for offsite backup of motion events.  This was easy to setup as well.  The only problems are that you cannot specify a directory for the FTP to save to, it just saves to the root of your server. :(  The second is that its a proprietary IRF file, which Windows can read, but not Mac.  :( :( :(  They really need a mac viewer for these files.Then I got braver and setup the DDNS.  This was not too difficult at all.  I didn't even use the supplied CD-ROM, not that I would expect any mac software there anyway.  Just navigated to the website on the sticker and keyed in my login/password assigned to me, and setup a DDNS.  I had to \"punch a hole\" through my firewall on my Apple Airport Extreme Base Station for port 80 in order for the DVR to be visible from work/etc.  But it all was fairly strait forward and is working well now.  Have 2 cameras going, and looking to add another soon.  Very cool.", "Date": "February 4, 2013"}, {"Title": "Good DVR, difficult remote setup", "Author": "crewchief", "ReviewID": "R3PG7YHU5PMI1P", "Overall": "4.0", "Content": "The physical installation was easy. The DVR works great, displays good immages. The real problem is with connecting and setup to the PC and Internet. The instructions are totally inadequate and misleading. I called the manufacturer two times and finally got it right. The setup and login scripts are somewhat cryptic.", "Date": "January 18, 2013"}, {"Title": "Great service", "Author": "kim k", "ReviewID": "R3GTYXTC3P9XVK", "Overall": "5.0", "Content": "So far, great product. The paper instructions are hard to understand, not enough information to get up and running. The CD is the best mode to use. We couldn't get the live internet viewing set up. US Security Solutions where we purchased it from, patiently stayed on the phone with us to get this system up and running. Thanks I would highly recommend this merchant. They were very knowledgeable. Shipping was right on time as scheduled.", "Date": "June 6, 2012"}, {"Title": "Very pleased with the DVR", "Author": "M. Peterson", "ReviewID": "RK4ITP47J0F7J", "Overall": "5.0", "Content": "Us security solutions shipped the item very quickly. It works very well. Has more features than the Swann Unit that it replaced. The software is very easy to use and has many features that I really appreciate.", "Date": "June 28, 2011"}, {"Title": "You get what you pay for!", "Author": "Review Master", "ReviewID": "R390GQCK5522I8", "Overall": "3.0", "Content": "It works great has alot of great features as the expensive ones. Can not complain about the price, great price for this unit. BUT the big But, very cheap made has no fans does heat up alot. Also instruction in plain english they SUCK. If you are not IT savey forget about connecting this to your email or network. Dont get me wrong it works great when connected but you do need now computers or network/it to connect it to your network or email for a common enduser will be lost and icatch support is no help.", "Date": "February 22, 2013"}, {"Title": "Great security DVR with excellent support.", "Author": "KeyBored", "ReviewID": "RR0LGX2IYOZW1", "Overall": "5.0", "Content": "I really like this DVR. It's very quiet and small (11.5\" x 8\" x 2\"), and was fairly easy to set up. My only difficulty was port forwarding my router, but a call to US Security Solutions quickly resolved the issue. These folks are excellent on the phone - very informative and helpful. Other reviewers have noted the instructions aren't the best, and that's true, but I think they're adequate and the menu on the DVR is pretty straightforward - at least it was to me and this is my first DVR. You can access and change all settings with the buttons on the front control panel, and the mouse they include made it even easier. You can also change settings from your computer using the included DVR remote program. There are some settings in there that should have more documentation, but again tech support was helpful.The unit comes with one power and one data SATA cable.  I bought the model without hard drive. I installed a Western Digital WD AV-GP 2 TB AV Hard Drive using the DVR's hard drive brackets. The bracket mounts are offset by design, so installing the hard drive was a little tricky - lining it up was a bit of a pain.  I think it's important to get a hard drive that is made for DVR's. These hard drives tend to run quieter and cooler. With the HD drive installed, The DVR feels warm to the touch, but is cooler than my BrightHouse Samsung cable box.The unit outputs its video through a VGA port. I bought a 24 inch TV with a VGA port (sometimes called RGB), and mounted it on my bedroom wall next to my larger TV. I'm handicapped and in bed about 12 hours, so it's helpful to see who's coming to the door and what's going on in the back alley. I'm also able to see the cameras from the computers in my house and my phone when I'm out. There are free apps like \"I Watch DVR\" that let you view your DVR from most android phones and tablets.I'm no expert on networking, but maybe this will help. You have to enter a series of numbers in 4 fields in the networking/LAN section of the DVR menu: the IP address, subnet mask, Gateway address, and network port. The Gateway address on most routers is 192.168.0.1 or 192.168.1.1.  To find these numbers just Google \"find Gateway address\" and follow the instructions - it's pretty easy. For the IP address of your DVR, the last number after the decimal is changed to a number of your choosing. I followed the suggestion in the manual and changed it to 212. So the IP address of my DVR is 192.168.0.212. The port is the opening in your network allowing information to flow to a particular device. I used the suggested 8888, but you can use other available ports. The unit is protected by an administrator password and also up to 4 user passwords with various permissions - available cameras, settings, etc.Now you must go to your router and convince it to allow you to see your DVR on the network. All routers are different, so it's difficult to give a definitive explanation. Basically, you have to enter the IP address and opened port for your DVR. The settings for this are either under port forwarding, firewall, or some other hidden place depending on the mood of whoever designed your router. Check your manual, you should find it in there. Lastly, the IP addresses I listed above refers to your home network, not the outside network. So when you use your iPhone or computer away from home, you don't enter the DVR IP, you enter your router's IP followed by the DVR's port.  You can find your router's IP by following the Google instructions above. Don't miss out on this DVR - a great product with excellent support (they explain things a lot better than me).", "Date": "April 13, 2013"}, {"Title": "Great system, even if you think you can do it yourself", "Author": "Amazon Customer \"Mike Levin\"", "ReviewID": "R3EWST3UY0L8ST", "Overall": "4.0", "Content": "When I started researching these home security video systems, I quickly encountered the ones from $500 to $1000, and decided to build it myself. Then I said, there must be someone building something like this full of features at a good price. I couldn't be the only person in the market. So, I finally turned up this unit and ordered all the various parts and assembled the overall system (the control unit is pre-assembled) and figured it out how to operate it quite easily.The tiny $200 investment for the control unit is minuscule, compared to the effort and chances of not getting it right and running far over that putting it together yourself. I immediately started using the Webserver feature to be able to check things on my phone, and the motion sensitivity to keep hard drive usage to a minimum. I've run backups of the files from both the unit itself over its front-facing USB port, and via the iPhone app, which converts it to MP4 for easy emailing and playing back on mobile and web.The beauty here is that if you notice something on your system, with a little bit of fuss getting the start and end points correct, you're now carrying the video on your phone. Unfortunately, you can't email it directly from the app. But you can get to the .mp4 file from iTunes, and then email it back to yourself and have it then in your normal photo album as if it were video shot with your phone. From there, you can do anything--edit it in iMovie or extract a 4-second clip for Cinemagram, like this clip of a guy harassing us: [...]There are a bunch of other features I haven't tried yet, like automatic emailing you excerpts whenever the motion sensor activates. I would have been happy with one channel at this price, and that's all I'm currently using, but now that I have 4 channels, I'm thinking out to supplement channel 1 in case of camera tampering and such. This is just a wonderful value for the money, even for someone who is very technical and thinks they can cobble it together themselves cheaper. The time saved and ready-to-use features of the software make it worth just going this route. The only reason I don't give it 5 stars is because there are a few rough edges in the software, and particularly the iPhone app which does constantly crash, but still gets the job done. Oh, and it really did get the job done. Google new york co-op bullying to read my story. I highly recommend this unit.", "Date": "April 1, 2013"}, {"Title": "Great DVR.", "Author": "Reed", "ReviewID": "RFEZWG540BCPY", "Overall": "5.0", "Content": "This DVR is very easy to set up.  I have been using it at my store for about a year and it has worked perfectly.  I do not use any of the networking features so I cannot comment on them.", "Date": "January 22, 2013"}, {"Title": "It is junk!", "Author": "Byron Brandt", "ReviewID": "R30HN67Y4IEDGS", "Overall": "1.0", "Content": "The Dvr never worked right.I called them up to report issues they gave excuses blamed my cables for it not working properly.I was lucky to get 2 cameras working the other two channels never work correctly.I reset it  at 6 times.The warranty is the worst I have ever experienced.You open it you bought it no matter what the problem is.Read warranty very closely.The mouse did not work right it would not click. They told me they check every one they send out.They voided there own warranty", "Date": "January 25, 2013"}], "ProductInfo": {"Price": "$499.99", "Features": "H.264 Main Profile Compression Technology, which save 20% or more recording size than traditional H.264 Baseline Profile codec.\n2 USB allows to operate DVR by mouse or touch panel screen. Triplex for Recording, Playback and Network\n4CH Real-Time display on 480fps/NTSC Supports D1 / HD1 / CIF Resolutions\nTriple Stream, recording at D1 and viewing at CIF remotely Supports 100% Independent Network\nWatermark & Scrambling examination to verify recorded files.", "Name": "New 4 Channel Embedded Linux US411Z-WS D1 H.264 Network DVR With 1000GB (1TB) Hard Drive, Real time True Triplex with built web server for remote viewing and operation, backup and operation 4CH DVR 480FPS SATA ready", "ImgURL": "http://ecx.images-amazon.com/images/I/31%2BxcY8muML._SX300_.jpg", "ProductID": "B0013FCGGC"}}