{"Reviews": [{"Title": "Great Buy for Novice and Advanced photographers", "Author": "Gerardo \"Businessman, Technologist, Marketer....", "ReviewID": "R16UEGUDXJWZF6", "Overall": "5.0", "Content": "This is a great little camera for both an advanced amateur (like me) looking for a second camera to carry everywhere you can't take your DSLR or for a complete novice (like my wife) who is looking for a camera that is really easy to use yet takes good pictures.IN SUMMARYWhat makes this camera special is that you have a full 10X zoom in a very compact form factor with a real wide-angle lens at 28mm. Most other cameras offer a smaller zoom range (around 4x), provide a semi-wide-angle at about 35mm, or are much bulkier.PICTURE QUALITYIn reality, most cameras today take pretty decent pictures. Most people really don't need more than 2 megapixels, unless you are planning to either crop your photos or make very large prints. Therefore 8.1 megapixels are more than enough. My DSLR has 5 megapixels and I have never needed more.The Leica lens is very high quality. The multiple built-in scene modes will make it easier to capture that sunset or use custom settings for that special picture. As with most cameras, it is always to have a photo editing program to adjust contrast (or levels if you are a bit more advanced), do some cropping and adjust sharpening.As an advanced amateur (take a look at my Nikon DSL photos at [...] ) I found the quality of the pictures from the Lumix TZ4 to be excellent.  AT the same time, my wife was able to use the Intelligent Auto mode to snap some pretty decent pictures. The flash does an especially good job  - indoor people pictures had very nice tones and not blown out or underexposed like some other cameras.VIDEOWith a 1Gb SD card I was able to capture a couple videos of my daughters dancing (to Hannah Montana, of course). The quality and resolution of the video is pretty amazing for a camera in this price range. You may want to use Windows Movie Maker (included with XP and Vista) to do some edits and make the video a smaller size suitable for emailing.OTHER FEATURESThe camera feels very well built and solid. Face detection technology works incredibly well, ensuring your subjects are always in focus (as opposed to focusing to whatever is at the center of the picture). Image stabilization works . The LCD screen is very large and bright. Controls are easy to understand.SUMMARYI spent a long time looking at many cameras and playing with them. If you are an advanced photographer, this is not a camera to replace a DSLR, but a perfect companion to take to those places where you don't want (or can't) bring your big expensive camera. The TZ45 does not provide all the manual controls of other cameras, yet it allows enough settings for me (i.e. exposure compensation, ISO settings, etc.) .For the average user, you can find a cheaper and a smaller camera for sure. But I doubt you will find a solid, pocket camera with a 10x zoom and a 28mm quality lens that produces such great photos with little effort. Definitely, the TZ4 is highly recommended.UPDATE ---I uploaded a few photos fromt he Lumix to this Flickr page [...] My other Flickr page has mostly photos taken with my Nikon D50.Most photos I uploaded are straight from the camera. I found a simple sharpen command from any photo editing software will increase the quality of the pictures.I have enjoyed the camera and am suprised for its great flash performance. It does an incredible job at balancing the background with a just-right flash.Battery charge lasted for a couple hundred photos. Highly recommended.", "Date": "April 22, 2008"}, {"Title": "Comparative Review: Panasonic Lumix TZ4; Canon SD 800IS and Canon SD850IS", "Author": "Artemaria", "ReviewID": "R12GUMZXG7962A", "Overall": "3.0", "Content": "I decided to do a little test comparing the SD 800 IS (28mm to 105 mm), SD 850 IS (35mm to 140 mm) and the Panasonic Lumix TZ4 (28mm to 280 mm).  I just wanted to make sure that I got the camera that was right for me.As part of the test, I took about 70 photos with each camera in various lighting conditions, indoor lighting behind, indoor lighting in front, outdoor, zoom, wide angle, etc.  Because I usually use only 4x6 prints, I printed all the photos in 4x6 prints at a local photo lab.  There was no post photo processing on any of the photos.  I just wanted to see the results right out of the camera so to speak.Thus, to me, the test was as real world as possible because that is how people use the camera, you don't shoot screens of color swatches, you shoot people, things, landscapes, grass, etc.  Printing it out at a photo lab let me see the pictures as best as they could be.  All cameras were set on full auto and no special modes were used for any of the shots.The results were very intersting but hardly surprising.  With the exception of a somewhat noticeable difference in the telephoto and zoom ranges, at a 4x6 size, there is essentially no discernable difference in the pictures generated by the Canon SD 850IS and the Canon SD 800IS.  There was no difference indoors, outdoors, or anywhere else.  This is not surprising, because the cameras are very very similar, use the same processor, and only differ in the lenses.The Panasonic was another story.  It exhibited performance issues, had zoom hunting, poor focus, fringing, etc. on the indoor shots.  Outside, with plenty of light, it performed very well and produced excellent photos, but because I don't shoot exclusively outside, that was a deal killer for me.  You basically cannot shoot anything moving indoors with this camera.  Based on the reviews, I understood that this camera had limitations, but did not realize how much the processor hobbled this camera's indoor performance.Here's the Review for the Panasonic Lumix TZ4:PROS:LENS: The quality and range of this lens are ideal.  That is the absolute best part of this camera.  Wide angle lens is a real treat in a point and shoot sized camera.  I shot many group shots with this camera and everyone of them fit in the picture, and I did not have to walk back any steps (or wedge myself into a corner, etc. to do it).  Also, outside, and especially outside, it is amazing what you will fit into a picture.  There is absolutely no distortion with this lens.  The outside pictures are superb.ZOOM RANGE: You will not find better.FEEL: The feel of this camera is of a well built quality piece.  The grip is excellent and it feels good in the hand.FAST: Pretty fast for a point and shoot.  Not as fast as the Canons.SIZE: The smallest superzoom anywhere.  Smaller than Canon's superzoom the SX-1000.  Looks better too.LOOKS AND FEEL: I absolutely loved the looks and feel of this camera.  It reminded me of my old SLR.  It had a nice heft to it, and the controls were laid out nicely.  Also love the fact that it was black and made of good quality materials.BATTERY: Battery life is very good.  Took almost 200 shots and did not even come close to using up the battery.FLASH: Flash is very strong for a camera this size.  Reaches rather far, but will not illuminate an object at the end of the 10X zoom.CONS:PROCESSOR: This camera is a grand slam waiting to happen if they can just put in a better processor.  On indoor pictures, there is no ability to take a good candid with the camera because it hunts for focus and zoom for too long.  Many of the pictures that were taken exhibited astounding amounts of fringing, or were out of focus.  Because I was looking for a camera that I needed to take many indoor candid shots (where people are moving around and not posing), this was a deal breaker for me.On outside shots, where you have plenty of light and if people don't move around too much, the camera takes excellent pictures.  Many of the professional reviewers lament Panasonic's heavy handed noise reduction, but you don't see anything on the outside shots.  This zoom range is an unbelievable asset to have outdoors.Overall, many reviewers labelled this a \"travel camera\" and it is easy to see why.  It is durable, has a great lens, and will take excellent sightseeing photos.  For that purpose, it is highly recommended.  I knocked it down to three stars because I need a camera that does it all very well, and the indoor performance of this camera was disappointing in view of how much I really wanted to like and keep this camera.Hope this helps and best of luck in your shopping!", "Date": "June 17, 2008"}, {"Title": "Powerhouse performance", "Author": "New Englander", "ReviewID": "R7ZWRDYX4LSIW", "Overall": "5.0", "Content": "I have a DSLR that I really, really like, but there are times when I want to travel with a minimum of gear. And then, of course, it's absolutely true that the best camera is the one you actually have with you when you see that once-in-a-lifetime shot.I've not been a Panasonic user before this and was actually quite leery of the brand based on professional reviews that complained about other Panasonic models suffering from a watercolor effect and heavy handed noise reduction artifacts. So I went with Fuji first and then Canon, but couldn't \"get happy\" with any of their offerings.So far, neither noise reduction artifacting nor watercolor effects are  apparent in this iteration, the TZ-4. It is a gorgeous metal camera that is easy to hold by a guy with even fairly large hands, despite the fact that it's very compact. The menu system is quite straightforward and there are plenty of scene modes that at least approximate what a manual control camera might offer you. ISO, AF area, metering area, exposure compensation and bracketing, and white balance can all be manually set. There is no shutter or aperture priority, although you can specify the absolute minimum shutter speed the camera will choose, down to a full second.The custom white balance set feature is very well implemented, and I had no problem getting beautifully lit, correctly exposed existing light shots indoors using the image stabilization feature and low ISO.The LCD monitor is not as sharp as the TZ5's but plenty good for checking pictures, and the battery lasts longer in this camera than the TZ5 if that matters to you.The AF assist light is very, very helpful and focus lock is almost always very quick and on the money. The macro feature is astounding. The controls are well placed and give good feedback.I have three gripes: the power switch and the scene wheel can both be inadvertently activated; there need to be way firmer detents or they both have to be recesed. AF seems to struggle a bit with the movie mode, but being able to zoom during the actual video shooting is a godsend. And finally, the USB out port is irritating. It pops open very easily. I may use a piece of black electrical tape to cover it.All in all a superb little performer for what you get for your money; chock full of features and of course the lovely 28 - 280 zoom. WOW.  I highly recommend this camera as an ideal all around travel camera you might actually take with you !!", "Date": "April 9, 2008"}, {"Title": "Excellent camera", "Author": "Lillian", "ReviewID": "RTSQ5Z9WALL96", "Overall": "5.0", "Content": "Excellent camera! Easy to use. Takes good photos and videos. I bought this camera to take pictures of my kids playing sports. The camera took excellent shots of the kids playing soccer and running track. You can use the zoom manually or the automatic feature.  Video playback was clear.  You have playback options by calendar or with added music built into the memory. It also uses the new high performance SD cards which allows you to purchase either a 8gb or 16gb card allowing you to record one hour video. Amazon sales an 8gb for around $30.  Don't forget to by a reader for the high performance card which I also purchased through amazon for $8.", "Date": "April 21, 2008"}, {"Title": "Simply Awesome", "Author": "Binoj", "ReviewID": "R2D7WJUBEWDWED", "Overall": "5.0", "Content": "This being a new product i was little apprehensive about buying it. But after getting this i just found that its too good. All round winner and would be a very good competitior for Canon SX-100 with 10X optical zoom. Its predecessor didn't have the zoom active while taking videos, but with this new model its taken care of that. More or less the remaining review will be same its predecessor except for some improvements. Looks are good and also small and will easily fit in a loose jeans pocket as well.Absolutely worth the money and a complete all-round camera.", "Date": "April 21, 2008"}, {"Title": "Great, versatile camera.", "Author": "Maggie J", "ReviewID": "R338R9O8DVNUBA", "Overall": "5.0", "Content": "I bought this camera, after quite a bit of research, to replace my Canon SD400 that was going on three years of use (and I always have a camera on me, so that's a lot of use). I wanted something relatively small but more capable than my Canon, which took great pictures of still objects in great lighting and decent video, but was slow and limited by its 3X zoom and insensitive flash.Out of the box, the TZ4K looks nice, albeit a little clunky next to the sleek Elphs and other more compact cameras on the market. However, it powers up quickly and adapts readily to just about anything I've tested so far (the first week I had it consisted of nothing but rain, so for a while I was just doing poorly-lit indoor shots of my cats and random furniture. That said, that my cats actually looked like cats and not blurry blobs or white glowing things is a major improvement over my old camera).I took it to the zoo, where it had a little trouble deciding what to focus on if using the long end of the zoom (especially if the subject was moving), but I suspect this could be helped by turning off the continuous auto-focus. I got a few interesting action shots of my three-year-old nephew running around. I took it to the bar with a few friends and had a shoot-off with a friend who owns a Nikon. Today I took it on a hike and tried out the scenery and macro modes, the latter of which can be a little tricky sometimes. It can't always decide whether it should be focusing on the background or the foreground, even when macro mode is selected (though it does tell you when you're too close for it to focus).I did notice some of the focus changes during video mode that some people have complained about in reviews of this and the TZ3/TZ5, but to be honest it was minimal and can be avoided by turning off the AF. Sound quality is comparable to my Canon -- not the highest quality, but clear and audible.Battery life is good and it has a battery meter on-screen, so you don't have to hunt through any menus to find out how long you've got.I bought it bundled with the 4GB SDHC and reader and they arrived on the same day. Also got a Lowepro Rezo 30 case for it, which isn't too bulky but has a soft lining and lots of padding.Overall, I really love this camera and would recommend it to anyone interested in purchasing it. Definitely worth it.Edit: I've now had this camera for over a year and still thoroughly enjoy it. I've found that leaving it on the \"natural\" color setting leads to images that are little to on the \"cool\" side, but that's what \"vivid\" is for. One quirk I've noticed and do not like is if I'm switching back and forth between taking video and pictures, it will sometimes randomly save a picture in a reeeaaalllyyy low resolution. It's really obnoxious, because I've had a few otherwise good shots become worthless due to terrible image quality in a format too small to even make a passable 4x6 with. If anyone else has this issue and/or has a solution, I'd appreciate it. Most of the time it's not an issue, though.", "Date": "June 1, 2008"}, {"Title": "Best Camera we've ever owned", "Author": "D. Rasor", "ReviewID": "R1ENI453NKR7WN", "Overall": "5.0", "Content": "I'm not a professional photographer, but would consider myself an advanced amateur. I jumped on the \"digital\" bandwagon in '98 and since then have owned 8 different cams. I currently do most of my shooting with a Canon SLR, but bought this Panasonic for my wife (she was carrying a small 5Mpix Canon in her purse for point-and-shoot type use). She wanted something that was small, light, but had WAY better ZOOM capability so she could do occasional BIRD shots. The Panasonic seemed to fit the bill. We've only had it for a few weeks, but here are our observations:1. Very well built; quality feel2. Smaller/lighter than I thought (given the awesome zoom lens)3. Panasonic's choice to position the zoom to START at a wide angle (28MM equivalent) was right-on. We can take shots indoors (or do great landscape shots) then ZOOM in for more detail4. The anti-shake is amazing. She's done some hand-held sunsets at full zoom and the results rival what I can do with my Canon SLR on a tripod!5. Speaking of sunsets, she uses the full-auto mode and the exposures are PERFECT!6. We've only taken one video and the results are GREAT. For MOST video uses we won't be carrying our camcorder any longer.7. For all manner of shots (indoors with flash; outdoors in the evening with fill-flash; Full sun; Sun+Shade; Close-ups etc etc) the exposures and color saturation are spot on.8. VERY impressive face-recognition capability! Spooky to watch it track the subject as they move around in the frame and keep focus on them!9. Great Battery life (we've taken maybe 50-60 photos + the video and the battery \"gas guage\" still shows 3/4 capacity left.)Negatives?....so far we've not found any.Basically this is the MOST impressive Digital Camera we've ever owned and for a shade over $200 it's a terrific bargain as well!", "Date": "June 12, 2008"}, {"Title": "Truly a wonderful camera", "Author": "S. Murphy", "ReviewID": "RGQUNUAOMRA3E", "Overall": "5.0", "Content": "I picked this camera up for our major family vacation to Greece this year, as I wanted a new camera with a nice zoom and better resolution.  I spent about 3 weeks investigating which camera to pick up, looking at a number of different web sites and their reviews (Amazon and c-net were great places for info).The camera was great out of the box, easy to understand and program as it has a few nice trip programs to assist with filing pictures.The zoom is great as I was able to get up close to a number of ruins with the lens. During the trip I noticed a majority of the travelers had the same or a different version of this Panasonic camera.It has a fast opening speed, which is nice when you need to pull out the camera and get it open for that unexpected shot, as well a rather fast picture to picture speed if you want to capture a number of shots quickly. Also, there is no delay from pushing the button to the camera taking the picture, which was nice (my old camera had a delay which made timing a little difficult).All in all, wonderful camera, we just returned and the pictures are great quality.One negative point - make sure that you pick up an extra memory card  - as the camera does not come with one, so you can only take a few pictures.  I picked up a 4 Gig card, which as the vibrant picture setting is good for about 1,000 pictures.", "Date": "June 8, 2008"}, {"Title": "Great Camera!", "Author": "Rafael Mateo", "ReviewID": "R3H97MMUL2MFQO", "Overall": "5.0", "Content": "This is my first point and shoot camera and I gotta say that im very satisfied with this product. The quality of the pics are great and the 10x zoom is amazing. The menu is easy to use and so far it has worked nicely in very dark enviroments. I highly recommend it.", "Date": "May 4, 2008"}, {"Title": "Nothing is perfect, but this has the combination of size, ease of use, and lens that I wanted.  Plus it's PRETTY!", "Author": "tbyg", "ReviewID": "RE0PXEN66JHZB", "Overall": "5.0", "Content": "Blanket statement:  I am in love with this camera!DIFFERENCES BETWEEN TZ4 AND TZ5 (probably not complete, but I thought I'd list the ones I noticed)1/2 inch smaller screen on TZ4.  I hear this leads to increased battery life, which the specifications indicate as well, and I was just fine with the 2.5\" screen.  Operative word, *was*.  I am super happy with my TZ4 but nevertheless have come to wish that I'd gotten the TZ5.TZ5 does high definition movies.  TZ4 does 16:9, but not in high def.The max resolution is a little less for the TZ4, of course.TZ5 has in-camera red-eye correction.  (Both have red-eye reduction flash.)The TZ5 can take still shots out of movies, but not at very good resolution.  If you don't mind doing that in the computer instead of the camera, a freeware program called Irfanview will do the same thing with *any* QuickTime movie.TZ5 will take three formats (4:3, 3:2, 16:9) at the same time.You can view two pictures at a time with the TZ5.Some parts of the manual are a pain to read for the TZ4, as you have to follow all the footnotes (which mostly deal with differences in maximum resolution).Oh, heck, having read my own list of differences, I've changed my mind.  I'm fine with the TZ4, especially for a lot less money!  (That 3\" LCD is just *so* pretty....!)GOOD THINGSTakes a lot of pictures on a charge.  I got about 150 with a *lot* of flash and zoom, plus admiring the pictures extensively and fiddling with the controls a lot.  (I was playing with it....)The LCD mode for holding the camera above your eyes and still being able to see images on the LCD works great.  I don't *how* it works, but it does.Very intuitive controls.  You can do the most common operations without even reading the manual.Very nice controls to use.  I love the decisions that were made about what was a switch and what was a button, what was on the quick-access buttons, etc.Very nice to hold.  That was one of the main reasons I chose it - I can't stand the almost credit card sized cameras, but I wanted something I could carry around in my purse.  (Or, as it turns out, hanging off my purse.)I dearly love the DMW-CHTZ3 case that I ordered for it.  It's Panasonic's own case, and it is *very* protective and hangs nicely from my purse strap.  Some caveats, though.  It holds the camera and a memory card and that's *it*.  No spare battery will fit, even though the instructions imply that one will.  When you open the case it looks like there are three pockets, but it's really just a protective arrangement.  Put the camera in the middle pocket.  Don't put anything in the outside pockets because either it won't close or you'll damage the camera.Both zoom and wide angle!  Love it!  Extended optical zoom (with reduced, but not too reduced for my needs, picture quality) is amazing.  The manual recommends a tripod for the highest zoom, but apparently the stabilization works great, because I'm getting good zoom pictures by hand.Love the charger - no cords, just fold-out prongs.  It *does* come with the camera.  (I remember one reviewer saying he almost bought one, not realizing it was included.)The high-speed burst really works - I took a bunch of pictures of one of my dogs that look like a movie when you flip through them.NOT SO GOOD THINGSNot a lot of manual control.  I can't find any aperture control at all.  Shutter control is limited to selecting the slowest speed you'll accept.  You *can* control the ISO.  On the other hand, it generally does just fine on its own.  It is a glorified snapshot camera, but *what* a snapshot camera!Terrible hiss on the audio.  The sound quality is OK otherwise.  I noticed this with one I tried in a store, didn't know if it was just a bad unit or what, but bought it anyway as I was willing to live with it in any case.  I'm thinking you could probably do something about it if you had the right audio editing software - it's just a high, constant noise, much like the cymbal sound in early Beatles records.Lens cover *very* flimsy.  I touched it lightly just to test and almost had a heart attack.  Treat it like you would a hollow eggshell!When my hand is placed the way it wants to go, I have a tendency to accidentally press controls with the base of my right thumb and cover the microphone with my left forefinger.  I wish they'd move the controls down just a little and swap the locations of the microphone and the speaker.It looks like it is a pain to put a date stamp on a picture in the camera.  (Not so much if you're printing.)  I don't do that much anyway, but I think I'm glad I don't.The LCD is pretty washed out in bright sunlight, even when set on \"power.\"  It's still usable, though.  You might want to consider buying a shade of some sort for it if you are going to use it outside a lot.Some of the software supplied (ARCSoft) is of the sort that tries to connect to the internet without asking whenever you open a connection.  (And that's why we have firewalls.....  ;-> )  Installation of the software tied up a lot of memory even after the installations were done - I'm sure a reboot will fix it, but it does not speak well of the software (QuickTime, ARCSoft, PHOTOfunSTUDIO).  Except for QuickTime, it's probably not stuff you'd really use anyway, but I thought I'd try it.  Did not install the Acrobat reader that came with it, as I've had updated versions of that program break stuff - I stick with my current version, no matter how old, as long as I can.  PHOTOfunSTUDIO put an icon in the righthand side of the taskbar (whatever that area is called) without asking.  QuickTime did the same in the lefthand area.Regarding the software that wants to phone home, I suggest Googling \"startup manager\" or \"start up manager\" to get a program to stop it.  Only one thing that I installed actually started by using the startup menu - the others had to be dug out.The version of QuickTime you get has a lot of functions disabled.  Most of them can be gotten around fairly easily, such as the lack of a \"save as\" function.RANDOM COMMENTSDon't order a 2.5\" LCD pop-up sun screen.  The housing for the LCD is the same size as for the 3\" screen on the TZ5.Order an extra battery, but shop around.  I got one for $26 and change, free shipping.I notice people have mentioned not liking that the battery and memory card are in the same compartment.  That didn't bother me at all.  A lever holds the battery in even when the outer door is open.Be sure and get a high-speed (category 6) memory card.  I had some very occasional tiny glitches in movies with a category 4 that I had lying around.", "Date": "March 5, 2009"}, {"Title": "More kudos", "Author": "smith carpentry \"Quality tool freak!\"", "ReviewID": "R3LPDI7D37ZGIZ", "Overall": "5.0", "Content": "Well, this might be a little different approach to the typical review, but I thought it was only fair since I spend so much doe at this website! Firstly, the credentials of this camera are above reproach. The finest German Lens on the market. The most powerful zoom on a compact point and shoot. I could go on, but hey, this is a great camera. Only one thing I could add. You might find this a dirty trick, but, tough luck.  I went to Costco and got it with a coupon and it came with a case, a 1 gig card, and it was $[...]. So don't be mad anyone, I spend plenty here, I just thought it fair to pass along the advice. Gooday, from a faithful Amazon buyer. J", "Date": "June 6, 2008"}, {"Title": "Takes pictures that rival an SLR in quality!", "Author": "Yarii", "ReviewID": "R3DY4ZK4XBAR2H", "Overall": "5.0", "Content": "UPDATE - November 29, 2010: Just a quick update to say I still love this camera just as much as the first day I used it.  I have tried a couple other cameras since I wrote this review - Nikon L18 and L20's and even a new Panasonic Lumix ZS1, and none of these could compare except for the ZS1.********************************************I received this camera a few days ago and I am absolutely thrilled with it. I have tried Kodak's, Pentax's, Canon's and even a Nikon Coolpix and this Panasonic TZ4 wins hand-down.It's 8.1 MP and has a Leica 10X optical zoom glass lens.  Leica manufactures some of the best lenses in the world.It's made in JAPAN - not China!It's fairly heavy for a compact point & shoot; the body almost feels like a metal camera, and maybe some of it is, but the majority of this camera is a high-quality heavy plastic.Best of all, it's not really a 10X optical zoom. If you shoot in any resolution from 6 MP or under you can take the OPTICAL zoom all the way up to 15.9 OPTICAL!!!And it takes fabulous pictures. I have always had a shaky hand when taking pictures, and I have not had one blurry picture yet, even when taking pictures of my cats - and they never hold still.It takes the best night-portrait and night-scenery shots I have ever seen.  I can't wait to take this camera to the Wright Patterson AFB Museum - the last camera I took there was a Fuji and most of my pictures turned out bad due to the low light conditions at this museum.If you have the control wheel set to iA (Intelligent Autofocus) you don't even have to press the macro button to take a close-up--the sensor adjusts and does it automatically.I have never been as thrilled with a camera in my entire life as I am with this one.So if any of you are looking for a great point & shoot camera, check this one out :)BTW I got the black camera, but it's more of a dark gray shade, not a dark black.Also please note that the pictures that are uploaded here to share do not do this camera justice.  I think Amazon compresses the uploaded pictures - trust me - your pictures taken with this camera will look 100 times better in person than they do here on this site.The prices for this camera are the best here on this site.  Believe me, I checked everywhere before purchasing this camera.  And if you don't like it, Amazon has a great return policy.NOTE:  If you are looking for a high definition camera, go with the TZ5 - it's a little more expensive but the cameras are basically the same otherwise.", "Date": "October 11, 2008"}, {"Title": "A workhorse and a great buy!", "Author": "Ha K Hwang", "ReviewID": "RCYG58S1TO3FR", "Overall": "5.0", "Content": "For those of us interested in semi compact cameras with wide angle lens and big zooms, this camera is a dream come true!It came down to either Canon SX100 or Panasonic DMC-TZ4 for me, as I was unimpressed by the price and lack of zoom on the best of ultra compact cameras: Canon SD770/790/870.As far as SX100 vs TZ4 goes:SX100 makes a little better quality pictures, has full manual controls, and has better noise reduction processor.  It suffers from traumatic flash recycle time (10 sec +).TZ4 has wide angle lens, compactness, superior iA mode (auto mode), much better LCD, simpler controls, capability to zoom during movies, 16:9 movie mode, and a world class Leica lens.  It suffers from the aggressive, inferior Venus IV noise reduction processor.Be sure to download the latest firmware update (ver 1.2) from Panasonic--it addresses the autofocus issue at the long end.In the end, the wide angle capability and the fact that TZ4 lens (not the processor) is the best in compact cameras tipped me over to TZ4, and I am very happy!  I'd highly recommend TZ4.", "Date": "July 26, 2008"}, {"Title": "Fantastic camera for novice or DSLR user alike", "Author": "B. Colonna", "ReviewID": "R98VPEK8LUVC5", "Overall": "5.0", "Content": "This is another great Panasonic camera.  I own a couple of other Lumix models, the FZ20 and FZ50.  I bought this as a lightweight option to those full-sized cameras.  There are other smaller, less expensive cameras in this megapixel and price class.My advice right off the bat is that this camera is an excellent choice.  Don't be tempted by the more expensive TZ-5, unless you really need HD video capability in a still camera, and an extra megapixel.At 8mp, this camera has plenty of capability to provide high quality shots at 8x10 or so.  The lens is able to produce the equivalent of a  28mm focal length (wide-angle by conventional camera terms), and it has a best in class 10x optical zoom.  Not digital, folks, 10x OPTICAL.  That's like having a 28mm - 280mm lens on a traditional 35mm camera. Few competitors match that.Like its bigger FZ brothers, the TZ4 features a lens made by renowned lens maker Leica.The ISO speeds on this camera range from 100 to 1600, exceptional speed range for a compact digital.  80 ISO is very nice for minimizing \"noise', but Panasonic's new Venus IV engine works wonders in that respect, and I really don't see a difference in noise between my other cameras at 80 or 100 ISO and this camera at 100 ISO.The 2.5\" LCD is very bright and easy on the eyes.The TZ-4 also has \"face detection\".  It has the ability to \"find\" faces in the exposure and select the best focus for the subject.For a fairly small camera, this device is easy to operate, takes great shots, and is a wonderful \"second camera\" when you don't want to carry a lot of gear yet still produce high quality photos.This camera works well for the novice, those who don't like gadgets or the young camera user!  it also has enough flexibility to allow more experienced photographers to enjoy it.I've taken a lot of shots with the TZ-4 and can't find much difference between the shots and my other Panasonics or my Nikon DSLR.", "Date": "August 12, 2008"}, {"Title": "GREAT camera!!!", "Author": "spin_nin", "ReviewID": "R16SIUG651943L", "Overall": "4.0", "Content": "I've owned this camera for about 6 months and, for the price, it is one of the best deals out there.Lowering the megapixels to 5 allows for 12x zoom. OIS works very well.Takes great pictures in almost all lighting conditions. Only indoors (low light) could be better but not at all bad. Night shots are AMAZING (as long as you use a tripod for the long exposure).Size is a little bulky compared to other compact cameras but other compacts don't feature 10x zoom.iA works pretty well for taking pictures on the fly but they can get a little grainy. I prefer to keep the ISO @ 100 but it isn't ideal for all situations.The display is big and bright and one of the best features is being able to zoom while shooting a video. Also love the positioning of the tripod mount to the door for the memory. I can easily swap memory cards without removing the camera from the tripod.I had a Fujifilm Finepix F50fd 12MP Digital Camera with 3 x Optical Image Stabilization and that had the edge in detail and low light shooting but only had a 3x zoom. It was dropped during a trip and quit functioning. I've dropped the TZ4 twice (not as hard as the Fuji though) and it is still going strong.I would not hesitate to recommend this camera to a friend.***UPDATE AS OF 6-23-10***After taking THOUSANDS of pictures (amazing pictures!) The camera's lens cover now no longer closes. I still highly recommend it except for two other major flaws...The sound on video recordings is HORRIBLE. Completely distorted at high volume levels like at a rock concert. Newer models don't have this issue.View finder / screen did not automatically brighten in dark conditions so I could see what I was photographing. Again - newer models have solved this issue.Unfortunately - the newer models picture quality is not as good. The newer models offer a higher megapixel count which is a downfall. This creates more noise in pictures as all they've done is jam the megapixel count up on the same, small, sensor. Smaller megapixels on a small sensor makes sense here but the marketing dept. feels people want more pixels as opposed to higher quality photos.That said - I just ordered the Panasonic Lumix DMC-ZS5 12.1 MP Digital Camera with 12x Optical Image Stabilized Zoom with 2.7-Inch LCD (Silver) despite the Panasonic Lumix DMC-ZS7 12.1 MP Digital Camera with 12x Optical Image Stabilized Zoom and 3.0-Inch LCD (Silver) being on sale (more adjustable camera for $30 more with digital stereo sound - more adjustable = more complex and I just want a simple point & shoot here)", "Date": "November 4, 2008"}, {"Title": "Excellent Choice", "Author": "Dragonwort Castle", "ReviewID": "R2BOTENNNUNTV6", "Overall": "5.0", "Content": "This is a truly excellent choice for a small camera. Pocket sized yet a great 10x optical Leica zoom, excellent auto function and easy to read instructions. Fantastic view finder and wide angle, as well as macro. I highly recommend the TZ5 and TZ4.  Simply said, used it over a month with 200 plus photo's of graduation and grandchildren, including crystal clear movies, 10 out of 10.", "Date": "May 22, 2008"}, {"Title": "ZoomZoomZoom Good Buy", "Author": "J. Galanis", "ReviewID": "R1WSGW5KGTLT19", "Overall": "4.0", "Content": "After scouring the internet for reviews and comparisons on various digital cameras, I found myself purchasing the Panasonic Lumix TMC-TZ4K. I purchased this camera mostly because my prior digicam (Nikkon 7600) took AA batteries and they died constantly. For someone like me, this camera is perfect.As far as point and shoot cameras go, this one is really top notch. At 8.1 megapixels, the shots come out crisp and clear. The intelligent autofocus mode can make even an amateur look like a fairly good photographer. For those of us who are not all that camera-savvy but are interested in learning, the TZ4 enables you to use manual mode and work the settings on your own.The \"scene\" mode settings are pretty typical of most point and shoot cameras. One extra that I thought was interesting was the \"starry sky\" setting, which enables the user to use shutter speeds of 15, 30, and (i think) 45 seconds. In very low light settings this feature is excellent. It is also a neat setting if taking photos of a band in a dark basement.The camera is very sturdy and just holding it you get a feel that you have a quality product.The 10x zoom really is what sets this camera apart from any other point and shoot camera you can get today. The next highest zoom I found was only 5x. After having a camera with such a high zoom capacity I can't imagine going back to anything less.Conclusion: For the amateur photographer who wants to have a chance to fiddle with a few settings, this camera is great. It shoots people very well as well as scenery (which are the two major functions I use it for). At $221, it isn't too heavy on the wallet for the quality of a point-and-shoot camera you are getting.", "Date": "August 19, 2008"}, {"Title": "Very Pleased So Far", "Author": "M. Abbott", "ReviewID": "R2AQ3WLRG2PT3", "Overall": "4.0", "Content": "I really like the 10X zoom - it provides much greater flexibility than my previous compact digitals that had 3X zoom. The picture quality seems very good. I've only used the camera on a short trip to visit family, and haven't learned all the features, but so far I've found it to be very satisfactory. My only complaint is the fact it doesn't have an optical viewfinder, but the LCD monitor quality could make up for that.", "Date": "May 5, 2008"}, {"Title": "Excellent Choice", "Author": "Dragonwort Castle", "ReviewID": "R3MZ2HLHCPV1CJ", "Overall": "5.0", "Content": "This is a truly excellent choice for a small camera. Pocket sized yet a great 10x optical Leica zoom, excellent auto function and easy to read instructions. Fantastic view finder and wide angle, as well as macro. I highly recommend the TZ5 and TZ4.  Simply said, used it over a month with 200 plus photo's of graduation and grandchildren, including crystal clear movies, 10 out of 10.", "Date": "May 22, 2008"}, {"Title": "Great Little Camera", "Author": "Janneke Bogyo \"janb\"", "ReviewID": "RTXATCBXCJX1C", "Overall": "5.0", "Content": "I was looking for a camera small enough to fit into a pocket during kayaking expeditions or hikes but that still had more than a 3X zoom!! Hard to come by! This camera finally fit the bill and I couldn't be happier with it! The Intelligent Auto mode is amazing! I thought just AUTO was easy but this is even easier and more precise.  The wide angle lens by Leica is also a plus and the 10X zoom allows me to take closer shots of wildlife I see on my outings.  So far, I'm very happy with this camera.  The price was incredibly reasonable as well!", "Date": "July 20, 2008"}, {"Title": "A great little package", "Author": "Tai Pan", "ReviewID": "R3OL4BN9I3W7RS", "Overall": "5.0", "Content": "I usually only buy cameras that are made by camera companies not electronic companies...The Pana Lumix TZ4 showed promise so I bought one to test...After the first 25 or so pictures I was sold....I own A Nikon D70 and Coolpix 7900 which are great cameras with short zooms...The TZ 4 filled in what I needed , longer zoom / 28-280 / and very impressive pictures...The Leica lens is what sold me...Since the quality of the picture comes from the lens and not so much the features I took a shot and wound up very happy with this product...Short falls , no view finder . short range flash no other complaints....A great little toy for a good price", "Date": "June 16, 2008"}, {"Title": "Love the zoom power on a compact camera", "Author": "L. Moran", "ReviewID": "R3OXVINFAV90C1", "Overall": "4.0", "Content": "It's so nice to finally have some freedom with a compact camera.  I thought I was going to need a 5 lb. Digital SLR, to take quality pictures.  It's relatively easy to understand, but I admit I read the directions on everything I buy regardless.  I did have to return the camera within the first month, due to a faulty connection cord, but received the replacment in 4 days.  Overall I am quite happy with my purchase and a great price too.", "Date": "June 9, 2008"}, {"Title": "Nice!", "Author": "sean_3656", "ReviewID": "R7BIKCWC9Y375", "Overall": "5.0", "Content": "This camera behaves exactly as reviewed and expected. There is no reason to but the 10MP version for $100 more, 8.1MP is plenty. The 10x zoom is awsome and the large screen can't be beat. Highly recommended.", "Date": "June 16, 2008"}, {"Title": "Better Than Expected,Like A Compact DSLR", "Author": "W. Nelson", "ReviewID": "R10XTRE45VTO19", "Overall": "5.0", "Content": "In May I bought a Pentax k200d DSLR off Amazon because I needed a high quality camera in which I could change lenses and do things a point & shoot won't let you do. I still love the Pentax but why they call this Panasonic a \"point & shoot\" baffles me, it has more menu options than my last bridge cam (a Fuji s8000fd) and the quality rivals that of my Pentax in a compact size. I only paid $164.00 on Ebay (Brand New) and it was a steal of a deal. Hard to believe the quality of shots made with the 10x zoom fully extended, it's amazing!! I also wish it had a viewfinder but the LCD does great in the sunlight if you adjust the settings right for it. Construction is top notch and shape is just right, I don't want a compact camera that is so slim where it's hard to grip and have to use just fingers and then make sure smudges don't get on your LCD screen. If this camera had been out at the same time as the Fuji (October 2007) I would have never bought the s8000fd. This camera will make a nice back up to my Pentax as it also takes movies (haven't done that mode yet) It's a winner and get it in black (actually charcoal gray) it looks nice too.", "Date": "October 29, 2008"}, {"Title": "It's All right Here Baby...", "Author": "Alberto Uribe \"Crazy Al\"", "ReviewID": "R1G3VQIL48OD24", "Overall": "5.0", "Content": "What an Amazing Piece of Technology this Little Baby is...Well I won't Bore you with what Basically ever Other REviewer has Already said about this little Baby except that People who Critize this Camera for Lack of image Quality OR Poor Auto Focus OR lack-luster Audio...FOLKS..there is NO SUCH THING AS THE \"PERFECT COMPACT/DIGITAL CAMERA\" OUT THERE ON THE MARKET..as I have told another Reviewer to Just be Grateful that Technology combined with a lot of Hard work and Research has Blessed us Photographers with the: Panasonic Lumix DMC-TZ4 8.1 Mega Pixel Digital Camera...Snap Pictures and ENJOY!", "Date": "November 25, 2008"}, {"Title": "Great Camera, Great Service", "Author": "Ginny Wojtkowski", "ReviewID": "R239FAHMQBBG2J", "Overall": "5.0", "Content": "I have previously owned a DMC-TZ3 and enjoyed it very much and originally purchased it for the zoom capabilities.  However it was ruined by my best friend while on vacation so it needed to be replaced.  Since I was familiar with the TZ3 and still had all the accesories (which are the same) I decided to buy the TZ4.  Amazon had a great price and I ordered it on a Friday and recieved it on Monday. This was after I tried to save more money by purchasing a TZ4 from a place called HDCAMERAWORLD.COM.  Avoid this place with a passion, its a total scam with sales people who all sound like a relative of Tony Soprano. In the long run Amazon was only $50 higher than them anyway.  The TZ4 has many improvements over the TZ3. It takes much better pictures with only room lighting and no flash. The instant zoom button is also handy. There is a separate switch to playback photos so that you don't have to disturb the settings wheel on top of the camera. The zoom also can be operated while taking movies, where as the TZ3 zoom wouldn't function once the recording started. My only regret is that I was too cheap to purchase the TZ5.", "Date": "September 16, 2008"}, {"Title": "This Is A Very Good Camera!", "Author": "G. Scales", "ReviewID": "RK7C7CBMRX1X5", "Overall": "5.0", "Content": "After reading many reviews mainly from people who cant resist comparing this camera with a 700 dollar DSLR.It is better than I was expecting.The build quality is top notch. Good quality buttons, nice looking and still small enough to fit in a shirt pocket.Several people gave this camera high marks but complained the indoor performance was lacking.I am getting very good indoor results. The camera overall is very easy to use. With a little practice you should be taking nice photo's.In movie mode this camera rivals my dedicated camcorder in most ways except in sound quality.The sound recording with this camera is not so prominent that you hear every little sound. With my camcorder recording in stereo the sound is so prominent, that is it distracting.I've been using a standard 2 gig SD card which seems to work good. I do think one of the faster write cards would be a good idea especially if your doing a lot of Video.The video in highest quality mode does use some space. With a 2 gig SD card you will get about 20 minutes of video, which for me is all I've needed so far.Bottom line I would recommend this camera. It does what Panasonic advertises it should do.It takes great photo's and video, and seems to be a very high quality camera that should give good service.So for the great price that Amazon is offering this camera for, I would say go for it.I ordered this camera on Monday morning, and received it Thursday morning. Which is typical top notch service from Amazon.One final thought, comparing this camera with the TZ5. The TZ4 is the best bang for the buck.The TZ5 does offer a few extras, but I have a feeling you will find this camera very feature rich and probably all the camera you will need.", "Date": "July 24, 2008"}, {"Title": "EXCELLENT ZOOM, & SKIN TONES, I LOVE IT.", "Author": "Loneliness", "ReviewID": "R3ENOEYJV3JL2C", "Overall": "5.0", "Content": "I bought this camera to replace my larger x12 zoom Sony, as I needed a small one to carry around with my new baby. This is a perfect camera for family pictures, small, fits in a pocket, has a x10 optical zoom + some advanced features that allow semiprofessional adjustments. The Leika lens, plus x 10 optical zoom make all the difference, plus programmed scenes allow for easy picture taking when you are out of time. What I find is optimal is the camera's skin tone colour... even with flash it captures it better than all the other ones I've tried. The burst mode is also excellent for capturing that first baby smile. The filming and sounds also work nicely, so for such a compact little thing, and the price, I give it 5 stars.", "Date": "July 9, 2008"}, {"Title": "great little camera", "Author": "Florence", "ReviewID": "R1U3UJRESUAYMG", "Overall": "5.0", "Content": "I have used this on three trips so far.  I find that it is easy to take photos  in very low light, which I am really pleased with.  The varoius scene modes really do work well.  The trip function is very useful, telling me which day of the trip I am on every time I take a photo.  In fact, I could get more out of my camera if I actually read the manual, but just the basic usage has been great and although it is not ultra-compact, it is very easy to pop into a small purse or to carry on a plane. I wish there were more manual ability available but other than that I am very satisfied.", "Date": "June 27, 2008"}, {"Title": "Lumix-TZ4K", "Author": "Karen Empey", "ReviewID": "RZXNU0I54Y8F4", "Overall": "5.0", "Content": "Fabulous.  We've had the TZ3 as well - this one is for my father.  So we were comparing to the TZ3.  Wonderful shots, image stabilization is the best!", "Date": "June 13, 2008"}, {"Title": "For the size (and money) you can't do any better", "Author": "A. Cheng", "ReviewID": "R2G8B3D5VVR261", "Overall": "5.0", "Content": "I just attended the 2009 World Figure Skating Championships, with my recently-acquired TZ4 in tow. I had wanted a small camera with a wide-angle lens and powerful zoom, along with good speed and accurate capture (especially with color contrast), and the TZ4 or 5s seemed to be right up my alley. Since the TZ4 was cheaper and I didn't need the upgrades in video capture, I chose that over the TZ5.It's not a DSLR, but then again no DSLR would ever be this cheap or this small. It can go into my regular purse unobtrusively, which is important. I never took photos because I never wanted to lug a big camera around, but now since I have a small camera that can go everywhere, I'm taking photos all the time! It's not shirt-pocket kind of small, but it should go into a jacket pocket pretty easily.It takes a bit of practice to get the timing right, especially with figure skating and the shutter delay that comes with all digital point-and-shoots, but I took some amazing photos during the event. If I had the focus at the ready, the delay was almost nonexistent. (Uploaded some mid-jump and mid-spin pictures to prove it.) Sometimes the camera needed a few moments to find the focus point and the moment was lost, but c'est la vie.During the exhibition, I had two fellow spectators ask me which camera I had because the photos were turning out so good. Again, it's not a DSLR so the photos aren't extra-crisp unless you have strong lighting to help, but it still captures a lot of details. You can even use it as binoculars, since the 10x optical zoom will visually capture more information than your eyes can. The zoom, when used at its full power, needs a steady hand to limit any blur, but it's pretty awesome.There's not a lot of manual controls, but you can do some bracketing with exposures and limit the ISO, which was about the extent of manual control I truly wanted. (Manual control of the shutter speed would have been really nice though, especially if you wanted to take star trail photos, for instance.) There are a TON of automatic settings you can choose from, so it's somewhat like having manual control. It's a lot of fun playing with them and seeing what you can do.I haven't tried everything the camera is capable of, especially the movie-mode. But for my personal needs, I couldn't have picked a better camera.", "Date": "March 30, 2009"}, {"Title": "Great camera, no complaints", "Author": "J. Hatcher", "ReviewID": "RUFHUY684QEL", "Overall": "5.0", "Content": "I did a lot of research before buying this camera, reading reviews and such. Amazon had by far the best price I found, so I went with them. The camera was shipped within the time frame indicated and arrived on (maybe even 1 day before) expected date. This was very important as I was leaving the country and unsure whether it would get there in time.As for the camera, it's been great so far. I managed an excellent shot of Obama at the parade, have enjoyed the zoom and the other features. Everything works as expected. As many reviews noted, the Mic is in an inconvenient location, as is the flash so you have to watch your fingers when taking pics. However, so far I am pleased with the purchase.", "Date": "January 31, 2009"}, {"Title": "Great Camera with a Leica Lens", "Author": "Gates", "ReviewID": "RZ8EB6GNL6298", "Overall": "5.0", "Content": "I am a professional photographer, but sometimes it is a pain carrying around an SLR.  I chose this camera for the Leica lens (considered among the best optics), and the 10X optical zoom mainly, but it has many other features that I was very impressed with.  The camera has a lot of extra features, such as face detection Auto Focusing that works very well.  Also the intelligent Auto feature works great and you don't have to adjust anything on the camera to get a great photograph.  The video mode is also very useful and impressive, allowing 15 min of video at a time at the highest resolution (2 megapixel at 16:9 ratio) until your card is full.  I have an 8gb card and could do videos until the battery runs out.  The best thing about this camera is that it works best on automatic, with great exposure, white balance, and fill flash.  The only negative thing I have to say about the camera is to be careful of getting your finger in the way of the flash as it is next to the grip.  Other than that, this is a great camera and I am very happy with the purchase.", "Date": "December 26, 2008"}, {"Title": "Love my new Panasonic Lumix DMC-TZ4K", "Author": "LL", "ReviewID": "R2M45N1HJX8PAV", "Overall": "5.0", "Content": "I am not the most technologically inclined person I know & I prefer easy-to-use electronics be it my laptop, stereo, digital camcorder or camera! I just got a puppy and I am always outdoors snapping shots in action. My old Kodak easyshare was not capturing the shots, so I decided to research new cameras with quality zoom capabilities without paying over $500.I cannot believe the quality of photos from the Panasonic Lumix DMC-TZ4K. I have been an avid fan of the 'auto' setting while I learn the rest of the features the camera has to offer. This is my first super-zoom and I recommend it to anyone who wants a quality super-zoom camera for a minimal cost. It is amazing for outdoor use and for any shot. I have to agree with previous comments that the Panasonic Lumix DMC-TZ4K lacks performance indoors on still frame portraits. It was worth every penny and I am very pleased with my purchase and the shipping services. I might suggest ordering a larger memory card and extra battery with the purchase.", "Date": "August 28, 2008"}, {"Title": "v. good buy", "Author": "Fred", "ReviewID": "R31OB1ZF4ZBTGP", "Overall": "4.0", "Content": "This was the best combination of price, quality build, zooming and Megapixels for me. High quality photos. Had to compromise for a little bulkiness; much heavier than I expected. I bought an 8GB SD card with it from Amazon- both at an awsome price; we recorded several short videos & took hunderds of 8MP pictures with ample memory space left on the card.. it was a good decision.. Highly recommended if you don't mind the extra bulk and weight (4 out of 5 due to that) compared to the slicker slimmer cameras with less features.", "Date": "July 30, 2008"}, {"Title": "Love This Camera", "Author": "monkuboy", "ReviewID": "R3BV4FWUGEZ51X", "Overall": "5.0", "Content": "First let me say I am not a camera fanatic so I am not familiar with all the technical aspects of cameras and am limited mainly to using the automatic settings most of the time.  The only thing I normally change is to disable the flash.That said, I think this is a wonderful camera for folks like me.  It takes high quality pictures on the automatic setting and the feature I really love is the 10x zoom. That makes a huge difference.The build quality of this camera is nice and sturdy.  It is on the heavy side compared to other compact digital cameras, but it feels solid and is well constructed. The controls are easy enough to figure out, the instruction manual is clearly written and covers all the aspects of the camera, and it comes with all the accessories most people would need (but you have to get your own SD flash card).I like this camera because it is easy to use, the pictures so far have come out very, very nice, the 10x zoom is great, and it just feels like high quality when I hold it.  I think it is a better value than the TZ5K as the latter's extra features aren't worth the difference in price, but if you are the type who lets those little things nag at you, it might be better to consider the TZ5K just so you feel like you have everything.I've always had good luck with Panasonic products (this is my first camera from them, though) so I had no hesitation getting this one when choosing a brand.", "Date": "July 26, 2008"}, {"Title": "Panasonic Lumix DMC-TZ4 zoom really works!", "Author": "TechWrite \"Tech-comm\"", "ReviewID": "R1TWRGM04WSH4L", "Overall": "5.0", "Content": "I bought a Fuji f30 on its reputation for having the best picture quality among camera of that size. It really DID take great pictures, but the ergonomics were problematical... it was complicated to use, the controls were not intuitive, and it was limited to 3X zoom. Moreover, I discovered that just about very use I had for a camera seemed to require greater zoom capability. I'd been looking at the Lumix line, and decided that the TZ4 was the price point for the features I wanted. I bought one and after a week, was able to sell the f30 (still like new) for more than I paid for the Lumix. The Lumix's conrols are more logical and intuitive than the f30's so it's MUCH easier and more convenient to use. Its best picture quality is about 98% that of the Fuji's, but all in all it's a much more useful camera for my purposes. Not only can I take the technical and whiteboard shots I need but could never get before, but with 10x optical zoom I can also take respectable wildlife shots of the sort that would typically require an SLR. Shots taken with the digital zoom, however, are less imposing.  Lumix was the first line of small and moderately priced enthusiast super-zoom cameras on the market. It has competition now, but Lumix cameras are still the smallest, and feature for feature, among the least expensive of the bunch.", "Date": "July 25, 2008"}, {"Title": "Awesome camera, awesome zoom", "Author": "Brian", "ReviewID": "R1FHLNL6AXJPG5", "Overall": "5.0", "Content": "Perfect camera for someone who wants to take pictures far off or just needs a 10x zoom but does not want a bulky camera. I just replaced my Canon S2IS which was 3 times this size. Fits right in your pocket.", "Date": "July 13, 2008"}, {"Title": "Awesome camera!", "Author": "Kristin L. Madson", "ReviewID": "R106MTHC944ZAO", "Overall": "5.0", "Content": "My husband and I purchased this camera to be a cheaper, more portable camera than our DSLR. It has turned out to be a wonderful purchase! The camera has the amazing 10x optical (not digital- this will not change the image quality) zoom which has proven to be awesome! We got to test it out yesterday at a wedding at the results were phenomenal. The pictures were clear and bright and the colors were vivid. The video mode was extremely impressive. We took just a short clip of the actual vows at the wedding, and watched it on our LCD TV and found it to be pretty darn sharp and not very grainy what-so-ever.We have yet to mess around with the settings too much, but the iA (intelligent automatic) seems to work just fine. It definitely appears to have some varying settings, but it still is a point and shoot and will not replace an SLR, but it is a wonderful companion to one. We are very, very pleased and would recommend to anyone.", "Date": "June 22, 2008"}, {"Title": "Good value", "Author": "Blue Moon", "ReviewID": "R39FKPD7VFQI9D", "Overall": "4.0", "Content": "I recently purchased this Lumix and find it easy to use and a good quality for a digital camera.  I like the 10x optical zoom and the variety of settings that are available.  It is a good solid camera, although a bit heavier than most current digital cameras on the market.  I looked at several cameras and narrowed it down to a Canon and the Panansonic.  The Lumix was the winner because of the zoom.  It is a clear and crisp picture.  It is also easy to use without even working through the manual.  Not sure yet about the battery life. I hope that the lithium ion rechargeable battery has a lot of pictures in it before needing recharging since it doesn't use regular rechargeable batteries. I find this to be a possible negative since I can't carry extra AA batteries like my last camera.I would recommend this camera because I feel it is a good quality camera at a reasonable price.", "Date": "June 18, 2008"}, {"Title": "so far so great", "Author": "Franny Glass", "ReviewID": "RNATDZRQWCRVX", "Overall": "4.0", "Content": "I probably don't need all the features this camera has, but because of rave reviews by amateur photographers and professionals, I decided I had to have this one. I haven't had any of the pictures printed yet, so my gauge of picture quality is based only on what I've seen on the camera and on the computer screen, but I have no complaints there. I absolutely love how great it takes pictures through windows with the ariel scene option. The iA mode does take remarkably good pictures, but beware! I was getting terribly blurry shots of a tiger until I realised the the tall grass right in front of me had prompted it to switch to macro. I turned it to normal picture mode, and got some great shots. The only thing I wish is that it could take a shot quicker from the moment you turn it on, but then I wouldn't have that great zoom lens which really does take fantastic pictures. Also not really an option for someone insisting on a very slim camera, but for me, it's just fine. Rather than try to fit it in my purse when on a trip, I stick my money and id in my camera case and end up traveling much lighter than the other way around!A year later, I'd just like to add that I still love my camera, and it has taken some pretty amazing shots, but I have noticed that when on the intelligent-auto setting, it gets 'confused' indoors a lot and does not focus well. The normal setting is better there. Also, if I had my 'drathers' I'd rather it take pictures a little quicker.", "Date": "June 13, 2008"}, {"Title": "LOVE this camera-but tips if you have a problem", "Author": "Jean Turicik", "ReviewID": "R3UG7IZ1WIIALZ", "Overall": "5.0", "Content": "I have owned this camera for over 3 years, and it takes beautiful pictures, especially the zoom.  I have a picture of my Granddaughter, close up, that looks like a professional took it.  I have had no problems until the other day, I went to turn it on and got a message \"turn camera off and back on\".  Well after doing this multiple times with no luck, I googled the make of the camera with the error message.  Found a message board on Amazon, where multiple people had the same problem and they said to \"lightly, but firmly, tap the camera several times next to the lens\", and it worked!!  Apparently the problem is caused by something getting into the lens mechanism, as small as a grain of sand.  I am just so happy I found this board and the camera works again.", "Date": "May 26, 2012"}, {"Title": "great optical zoom in a fairly small package.", "Author": "Garvin", "ReviewID": "RP7254PCYGSDF", "Overall": "4.0", "Content": "there are a lot of good things about this camera. I really like the GUI and how easily accessible many of the settings are. The quality of the LCD screen is very sharp and colors are vibrant. The 10x OPTICAL zoom is a great feature! It allowed me to take a lot of nice nature shots that would not be possible with point and shoot cameras. the build quality is also very high ... the camera feels very solid and has a nice weight to it.I do wish the instruction manual for the camera was a little more descriptive. For example, there are two image stabilization options, but it is unclear to me which is better for what situation. Also, more manual options would be nice, such as selecting shutter speeds.This is by no means a replacement for a DSLR camera of course, but it is a nice middle ground between point and shoot and professional level cameras.", "Date": "August 9, 2010"}, {"Title": "The perfect solution", "Author": "J. Capobianco", "ReviewID": "R130OE1BOAZWY3", "Overall": "5.0", "Content": "After 30 years of trying to find the perfect all around travel/family pic camerathis is it!I have owned 12 film cameras 14 lenses amature to pro. Own 2 DSLR's EOS 10d and Rebel xt as well as a Kodak z730 and Panasonic dmc-fs5. This dmc-tz4 is the ONLY camera that you need in 90% of photo opportunities you will run across. The Leica 28-280mm lens is sharper than any Canon L series in production (well maybe equal to the $5,000 200mm f1.8). I tested it last week against the decent sigma 18-200mm on a rebet xt body and the tz4 is MUCH sharper at all focal lenghts and gives you great wide screen video. It even edges out my Canon 100-300 f5.6L and that lens in considered one of the sharpest ever in that range!The only reccomendation if you do much enlarging is to download Neatimage, it's freenoise reduction software and gives images that smooth DSLR look.Go buy one!!!", "Date": "September 9, 2009"}, {"Title": "Compact camera with a big hearted optics", "Author": "Rayaz", "ReviewID": "RDO7MJTTSB4MI", "Overall": "3.0", "Content": "Replaced the TZ3 with this camera after a very good experience with the TZ3.  Due to the higher price of the TZ5 opted for the TZ4 and believe i did not loose out on much.The camera is very portable, though its not really a pocket friendly camera, but fits in perfect if you are wearing a denim.Missed the larger screen that was there with the TZ3, as the 2.5\" screen can be a bit small to one's liking, and its performance in bright sunlight is not that great.  It also has a tendency to show a purple vertical line when shooting in bright sun.The Intelligent Auto mode is pretty good, and is far better an option for most uses than using the screen modes or the limited manual mode.  However the autofocus in auto mode is very slow even after the firmware upgrade, and can be very irritating when you miss the moment due to the delay.  The work around is to select \"Sport\" mode, but here the flash is disabled and is not ideal for indoor use.The pictures taken in daylight is superb, and is further enriched by the wide screen optics that makes it an ideal trip camera.  Pictures of people in groups come out well, but when the number of people increase the faces get distorted.  Landscapes and buildings come out superb, though the color reproduction is somewhat not natural (very noticeable when you take sunset/sunrise shots).The biggest issues is that the indoor photos are not that great, specially in low light conditions. The flash can be overpowering for close proximity shots, but does a fair job for group photos.  However indoor shots in low light without the flash are very grainy.The superb zoom of 10X (extended to 15.9X when set to 3 mega pixel) is very useful and helps you takes some great photos.  However the focus at maximum zoom is a bit slow and you need to plan your shots.  A tripod is recommended as even with the great optical stabilization, its hard to keep the camera steady when shooting at full zoom.The issue with indoor performance impacts the movie mode badly, as the videos even with decent light are dark and lacking in detail.  However videos taken in daylight are pretty decent for a digital camera and is more than enough to share with friends and family :)  However VGA or WVGA seems to be a bit small compared to the current cameras :(  The ability to zoom while recording video is an asset, and is something you want in a camera once you use it.  The zoom is rather slow in video mode to reduce the noise from the mechanics. The audio quality of recordings is rather poor and limited to mono.One more feature i really missed over the TZ3 was the ability to use the single click context menu and change from normal to wide screen.  With the TZ4 (and the TZ5) you have to select the menu option and navigate to change the form factor.Overall its a decent buy with good quality photos in most cases, and the true wide screen optics makes it a wonderful trip camera.  Add the superzoom it makes the camera truly useful for trips to get pictures and videos of items far away.", "Date": "August 16, 2009"}, {"Title": "GREAT camera.", "Author": "Barbara L. Simmons \"BLS\"", "ReviewID": "R15G4N1D1AU13F", "Overall": "5.0", "Content": "Best point-n-shoot I've ever owned.  Crisp, clear pictures every time.  Speedy, easy to use.", "Date": "July 9, 2009"}, {"Title": "Gorgeous Camera!", "Author": "M. Wingerson", "ReviewID": "RMSQ16W20X7D2", "Overall": "5.0", "Content": "I needed a mix between portable and quality.  This camera met everyone of my expectations.  It has a nice auto mode for easy use and plenty of manual features.", "Date": "July 8, 2009"}, {"Title": "Excellent Camera", "Author": "Jim \"Jim\"", "ReviewID": "R377BMC2RNILP", "Overall": "5.0", "Content": "Pros:  Easy to use;  easy to view & erase pictures already taken; nice size - comfortable to grip;  great zoom & lens;  takes excellent photos ie.  clear & accurateCons:  we still prefer an viewfinder.  The monitor is difficult to see in bright light, and you cannot know if the photo is properly composed.  However, I guess this is the standard with most smaller travel cameras.", "Date": "June 20, 2009"}, {"Title": "... but AWFUL audio noise / quality", "Author": "lovhybrid", "ReviewID": "R33S1EJOKXD1FP", "Overall": "4.0", "Content": "i got this set from a club store and im really impressed on pic quality.But when i used movie mode, i was surprised when i heard the audio. I thought it was the settings but after reading the manual, it says its audio is on fixed mono.My other cams kodak mx1063, and sony dsc w80, sounded so much better.", "Date": "March 30, 2009"}, {"Title": "Relatively cheap, wide angle lense, very simple operation.", "Author": "ATuck \"A-Rod\"", "ReviewID": "R3TXUBD1WBOYC5", "Overall": "5.0", "Content": "I bought this camera to make up for my Canon Rebel XTi which went to the shop for repairs.My XTi might not get as much use when it gets back.I really like this pocket camera. While slightly larger than your average pocket clicker, the size difference is mostly because of the wide angle lense included. I find this quite a luxury to have wide angle in my pocket, not around my neck.I use my cameras primarily for business - I do quotes on major home remodeling 3+ times per week. For me, being able to stand in the doorway of a one person bathroom, and taking a shot that encompasses the entire room is pretty powerful. Up till now I have used a Canon Rebel XTi which worked great but was somewhat of an overkill, not to mention heavy.I bought the DMC-TZ4 instead of the TZ5 primarily because of cost, and because even though having a camera that takes HD videos sounded great, I didn't really need it. That being said, the video function on the TZ4 works very well, including the ability to zoom while recording. The onboard microphone is more than a little tinny, but the overall picture is excellent.The only beef I have with this camera comes when trying to focus while fully zoomed. This may be normal with a long zoom on a non SLR camera, but it takes awhile to focus if the TZ4 is zoomed past half capacity.I would advise anyone who has similar uses for a camera (real estate, construction, remodeling, home decor, etc) to buy this camera. It works great.", "Date": "February 2, 2009"}, {"Title": "Knockout!", "Author": "The Burnt Biscuit", "ReviewID": "REM8JH2XOM8GU", "Overall": "5.0", "Content": "For me this is a perfect camera. The length of the zoom coupled with he wide angle put it in a class of it's own. When I bought it I didn't know it even had video, but that's incredible, too. The battery lasts a long time-- a few days of vacation-intensity picture taking between charges-- unless you are the type who has to review and monkey around with every shot. The video mode also uses up a good bit of battery, so buy an extra if you are going to do a lot of that. I don't know how well the pre-set \"scene modes\" really work, but they are easy to access and offer a big variety. You probably want a 2-4GB card as well. On a 3 week vacation I filled up a 1 and 2 GB card. When I dump the pictures into my computer I find that they generally are a tiny bit over exposed-- I adjust that and generally \"warm them up\", as well as add a bit of saturation in the editing program. That's not to say that the pictures aren't acceptable if you just take them to a developer, but a little tweaking is nice (and easy). One thing-- Don't Drop It!! I dropped mine and slightly dented the lens enclosure. The camera still tried, but the lens wouldn't open. Panasonic charges $110 for service, plus parts, (which they were reluctant to quote,) but indicated that a new lens would be at least $100, so it was cheaper to just buy another camera sans case/memory card etc, which I quickly did.", "Date": "January 18, 2009"}, {"Title": "GREAT CAMERA", "Author": "G. Caldera", "ReviewID": "R1GT7FBVFSS2BU", "Overall": "5.0", "Content": "I had searched for over a month for a camera under $200 with over 7mp, 2.5\" or bigger screen, good battery life, good optical zoom, and optical stabilization. This camera met all of my expectations and more. It is very good looking. I have the dark grey/charcoal one. I purchased this a little over a month ago at $160.00.This camera takes great photos. I have taken roughly over 100 pictures since I bought it. The IA mode is a godsend. I didn't think that it would be a prominent feature that I would use since I like to change the advanced settings according to the scene. It's not like the AUTO mode found on other cameras. IA really chooses the best settings in a fraction of a second. This optical stabilization is very good. It is able to keep up with my little nephew while he's running without blurring the image. The battery life is better than what I was expecting; it can really take up to 175 photos, with flash, on a single charge. The optical zoom is very handy; my previous camera had only 6x. The 8.1mp allows me to take great pictures and enlarge them without seeing pixilation.The 28mm makes all the difference when taking a group picture. It fits everyone in the picture without having to be 20ft away. The lcd on the back is beautiful. It certainly beats my 8.1mp HP camera hands down. It is very bright and rich colors, also much better definition.  This camera is by far the best camera I have used. It is not too bulky; I can carry it comfortably in my pants pocket or jacket pocket.I would definitely recommend this to others.", "Date": "January 17, 2009"}, {"Title": "Great Camera, Wish Date was Auto Printed", "Author": "TechAddict", "ReviewID": "R7L75EFFJRCOI", "Overall": "5.0", "Content": "I didn't use the camera extensively, like on a trip, but I think it is a great a camera, my only take on it is that it doesn't have the time and date automatically printed on the pictures, I had to spend sometime to find how to do it, the camera provides a way to add them after you take pix but you have to make a reduced resolution copy of the original for that purpose, I used a settled on a freeware IrfanView. I liked being to zoom during taking videos. I also liked the quality of the few pictures I took at night. In general, it is a great camera.", "Date": "December 6, 2008"}, {"Title": "Smart Camera", "Author": "Joe Bromley", "ReviewID": "R37S6A10TWDKMH", "Overall": "5.0", "Content": "This is a great camera that is best for someone who likes preset settings and does not like to mess about with manual features. The camera is a little bulky to carry around in your pocket but not so big that it is not a worthy point and shoot. I have found this camera best for shooting at events and general snap shot moments.", "Date": "November 16, 2008"}, {"Title": "Great value for money", "Author": "Nikhil Rao \"wii player\"", "ReviewID": "R3D7FXUT0RDATA", "Overall": "5.0", "Content": "I purchased this camera as an upgrade for my earlier Canon A95 (5.1 MP) I was really impressed with the amount of features packed into the small form factor. The 10x zoom is most impressive, and with extended zoom, 15x is possible. I have tried taking images of the same objects with maximum and extended zoom, and the difference is amazing. Picture quality reduces at the extended zoom, but that is to be expected.One thing I was looking forward to was the wide angle, but pictures taken of landscapes with this and another non-wide-angle camera turned out pretty much the same. The images stabilization is also pretty good, with 2 modes available. This model has a host of features, but they are easy to locate and use, great for both the amateur and semi-pro photographer. All in all, a good value for the money.", "Date": "October 31, 2008"}, {"Title": "Lovely Camera, LOVE IT!", "Author": "Our4miracles \"our4miracles\"", "ReviewID": "R2NQSG6M82DIYS", "Overall": "5.0", "Content": "I have had MANY MANY cameras the last 4 years.. and I am really in love with this little package. EVERYTHING about it is perfect!", "Date": "September 30, 2008"}, {"Title": "Incredible shots for an incredible price!", "Author": "BurninginPhoenix", "ReviewID": "R1P9I66PF82ZMN", "Overall": "5.0", "Content": "After shooting several shots with this camera I can safely say that I would recommend it to anyone who asks.  To see some shots taken with the tz4 go to [...]", "Date": "July 18, 2008"}, {"Title": "Simply wonderful", "Author": "Big time Amazon Fan \"Tom\"", "ReviewID": "R1J9XOS2UDBVKP", "Overall": "5.0", "Content": "Panasonic Lumix DMC-TZ4K 8.1MP Digital Camera with 10x Wide Angle MEGA Optical Image Stabilized Zoom (Black)I have a larger Panasonic but felt that I needed a \"pocket size\" camera which allows better mobility. This Panasonic fits the bill to a tee. It is jam packed with features and has an excellant battery. I purchased a Sandisk 4 GB SDHC chip which makes this camera a powerful little camera. The auto zoom and quick menue top off the added features.Just wonderful", "Date": "June 25, 2008"}, {"Title": "THRILLED absolutely THRILLED", "Author": "Colleen \"Colleen\"", "ReviewID": "R2WWJ2E8BEXE7Q", "Overall": "5.0", "Content": "I am thrilled.  I was so upset when my other camera died.  I had NO IDEA which camera to choose.  I researched as much as possible and always ended up with this one on my list.  I am a scrapbooker and NEED my pictures to come out well...and they did.  The first time I used it was at my son's first grade picnic.  I had just gotten it and had not even read the manual.  I just put it on the automatic setting and hoped for the best.  I downloaded the pictures that night and printed up some for the kids in his class.  Their parents RAVED about the quality.  My husband has read bits and pcs of the manual (I must confess...I still haven't read the manual) and made a cute little video using pictures and music...done directly on the camera.  I am truly thrilled with this purchase.  If you are iffy about buying this camera...trust me...BUY  IT...you will be glad you did.It is me again...almost 4 years later.  My camera died April 2012 after an EXTREME amount of use (I am ALWAYS taking pictures).  It was an awesome little camera and I miss it :( I do still recommend it!! We just bought another brand camera which takes good pictures, but I do miss the ease of use with this one.", "Date": "June 23, 2008"}, {"Title": "Panasonic TZ4", "Author": "C. C. Ford", "ReviewID": "R19TVVPRGXBG7U", "Overall": "4.0", "Content": "Amazing little digital camera. The pictures are not quite as good as my SLR, but almost -- and definately more portable!", "Date": "July 19, 2008"}, {"Title": "Great features, but questionable photo quality", "Author": "packhawk", "ReviewID": "R2LJC19PHZI0D6", "Overall": "4.0", "Content": "I recently purchased the Lumix TZ4 to replace my Canon A510 which suffered from severe flash recycle lag, which drove me nuts. I was drawn to this Panasonic mainly because of the 10x zoom, which is great.After using the camera for two weeks now, I find it very easy to use, and the battery life seems good. Indoor shots, with or without flash, come out much better than my Canon.Video turns out nice, although the microphone does not seem to pick up noise more than a few feet away. I like the different aspect and frame speed options. Be sure and turn off continuous auto focus for video mode, otherwise the camera has a hard time focusing on just one thing and everything turns out blurry.My only complaint is when I download and view the photos on my computer, I notice what seems to be haze/grain/noise on my outdoor sunny shots. The photos do not appear crisp at all, and I have tried several settings, changing the color mode from standard to natural, as the manual suggests, but with no difference. I did some comparison outdoor shots with the Lumix and the Canon, and the Canon's shots are much sharper and crisper.I am also slightly annoyed with the cover to the cord ports. It doesn't snap shut or anything and I have found that it is easy to rub my hand against it and it will open.In the end, I decided to keep the camera, because the Lumix's speed, zoom and other features are still an upgrade from my Canon, but I am not impressed that it cannot master the basic function of a camera, to take nice, sharp images. Please let me know if I am missing something.Update: I have now had the camera for one year and have reached my frustration point. The camera constantly hunts to focus resulting in missed shots or blurry shots. I continue to have soft and overexposed pictures on sunny, outdoor shots. I am going to give the Sony H20 a try.", "Date": "June 26, 2008"}, {"Title": "So far, so good", "Author": "Jimbo \"Jim B\"", "ReviewID": "R1DOL2ZOB38NMZ", "Overall": "4.0", "Content": "I have been using this for approximately one month.  Very simple to use in auto mode.  Good zoom.  Pictures are fairly well detailed.  To me, simple is good.", "Date": "July 3, 2008"}, {"Title": "Still evaluating, but so far so good", "Author": "Stefan Bartus", "ReviewID": "RF7GVI47G5GMB", "Overall": "4.0", "Content": "I have been using this camera for 3 weeks and been very happy with it. Fast focus comparing to my old one(Olympus C-770UZ) and really inteligent automatic mode.Only small dissapointment comes from decreasing resolution of wide angle 16:9 mode, but still looks great on my 42\" plasma. So far no problems.", "Date": "June 29, 2008"}, {"Title": "I'm enjoying my new camera", "Author": "Marissa Endicott", "ReviewID": "R65ZM5Z1T8TN7", "Overall": "4.0", "Content": "So far I am enjoying my new camera.  I am still learning all the special features and noticing some things that I am doing wrong.  For instance, taking pics of my daughter at her 8th grade awards night - the stage wasn't well lit and when I used the zoom the pics were a bit grainier than I wanted - but I know that's errors on my part.  I think you really gotta play with the settings to get great pics - you gotta know what settings to use at different events (I'm trying!)Overall - I really like the camera.  Clear pictures, easy to use, love the battery thingee!  I'm enjoying it!", "Date": "June 13, 2008"}, {"Title": "Lumix dmc 8.1 mp", "Author": "desert dog \"cameraphile\"", "ReviewID": "R28BV7XZOZ2F40", "Overall": "5.0", "Content": "This is an absolutely great camera.  The fit and finish are extremely good and the camera blends nicely the issues of size and weight.  It is small enough to take everywhere, but not so small as to be actually difficult to use with anything but tiny handsThe HD movie feature works great and the images are superb. The nice thing is you can actually zoom while taking a video, something not offered in most cameras.  Nice easy to use features, great price, very flexible wide range of features and sharp crisp pictures.The only thing needed is more megapixels and now the new version is out in 9 mp.", "Date": "June 11, 2008"}, {"Title": "Nice compact camera", "Author": "Rocio Jaimes", "ReviewID": "R5Z7GIUDSG192", "Overall": "5.0", "Content": "I highly recommend this product if you are not really looking for an up-to-date compact camera. I have it since 2009 and it still offers a nice performance. Its lens definitely was worth for the money I payed for the camera back in the day, but if you want to record some live footage on a concert (for example), you should consider a newer Panasonic model. I sure will buy another camera by this brand if I ever change my old Lumix.", "Date": "December 26, 2013"}, {"Title": "Great Point And Shoot!", "Author": "Michael Patrick Mccartney", "ReviewID": "R2UBF42LVNG5AC", "Overall": "4.0", "Content": "It's not top of the line, but I like all the features, and ease of use, and it takes beautiful photos.", "Date": "December 11, 2013"}, {"Title": "I love this camera and am buying another one even though this one broke...", "Author": "Sara Marie Miller", "ReviewID": "R1AMYKVXDD49DG", "Overall": "5.0", "Content": "This camera takes the best photos! I bought it after seeing a friend's photos on her blog and inquired into what she was using to get such focused vibrant close ups.It is super lightweight, zooms in close, deals with low lighting better than most and does all you need and more for a basic point and shoot. A Leica lens for $50? Yes!I take this little gem with me everywhere and take shots almost daily.  Unfortunately I scratched the lens and the shutter is frozen in the open position but this camera gets tossed around like a rock in a tumbler. I am buying a new one today- great price and best camera I have ever owned. Planning to take better care of this one.", "Date": "April 23, 2013"}, {"Title": "Great Cammera", "Author": "Chase", "ReviewID": "R3JCT6NVW1GSD", "Overall": "5.0", "Content": "This is one of the nicest camera's out there for the price bar none. I have gone through several cameras and Panasonic gives by far the best picture quality, Image stabilization is great, And it couldn't be any easier to use. Our family has 3 of them. And they can take a lot of abuse and keep right on performing like new. I used to be a Sony fan. But this camera puts Sony to shame.", "Date": "January 13, 2013"}, {"Title": "Great travel camera", "Author": "Gregory S. Simmons", "ReviewID": "R2VAHW6P49WJXC", "Overall": "5.0", "Content": "I have had for 6 years and it still works great. Basically the best pocket camera you can get with a great wide screne shot required for travel pics. I have read many comparisons on picture quality under a variety of conditions and this phone gets rated high. I have used for fireworks, night, beach, landscape, inside muesems, etc and it works perfect. I have pictures set to 4-6MP so cameras that have anything above that is kind of a waste. No one wants a 20mb picture file unless you plan to print it off poster size lol.", "Date": "January 11, 2013"}, {"Title": "Perfect size", "Author": "Savvy \"Smart Consumer\"", "ReviewID": "R12G7JABLS21YJ", "Overall": "5.0", "Content": "I carry this camera every day - you never know when you're going to have a 'Kodak' moment.It's light; take great pictures; great video; great zoom; no red eye; automatic face detection; etc.  Too many great features to mention.I have had it for a few years and I'm sure the latest models are even better.  But for the price this was/is a great camera.", "Date": "November 27, 2012"}, {"Title": "Awesome Camera", "Author": "freetolio \"freetolio\"", "ReviewID": "R3ASETRF9DRUYD", "Overall": "5.0", "Content": "I bought this camera a few years ago from Amazon, and it has been great.  I have taken it in hot, cold, and humid areas and it has held up great.  I have no plans to buy any other camera anytime soon.Pros:It is very, very sold feeling and a bit weighty.The lens assembly is very solid, so you don't feel like you will break the zoom components when you are wiping down the outer lens.10x optical zoomPanoramic modeGood automatic setting properly detects most setting situations.Very minimal shutter lag.Easy access to white balance, metering, and other manual controlsCons:You can have poor performance in low light.  You can correct this by fixing the camera on a solid surface, but this camera will sometimes introduce an almost impressionistic noise instead of blurring up like a typical camera when you are moving it in these conditions.  IMHO, this is worse than regular blur.Autofocus can slow down the viewfiender even though this was mostly mitigated by the firmware update.I used to have a Fuji Finepix 2650 (which eventually failed electronically), then a Kodak C360 (someone broke it), then a Kodak V530 (started losing screws and physically coming apart), and then I got this in 2008.  Since then I have also gotten a waterproof DV unit (GE DV1).  This camera produces better daytime pictures than any of those others (though it is higher resolution).  Kodak cameras seem to really do well at automatically reducing noise in some specific situations in a way that this camera does not automatically do, but overall it still wins out for daylight usage.  Low light performance is somewhat dubious.  Perhaps using manual controls could mitigate this.Even in spite of bad night shots, I have to give this camera its due praise and recommend it heartily.", "Date": "May 27, 2011"}, {"Title": "Great camera - Panasonic Lumix", "Author": "happy traveler", "ReviewID": "RFXO1LFIAS7DH", "Overall": "5.0", "Content": "I needed a small camera to take to Italy. Last summer, my cousin was showing me her Panasonic Lumix and highly recommending it. I remembered her telling me that she researched extensively before she chose it. Taking her word for it, I got online and purchased this little Panasonic Lumix from amazon.com, and my cousin was SPOT ON. This camera is wonderful! Its magnification, Leica lens and ease of use are features which culminate in excellent quality photos. This camera has it all for a very reasonable price - and I don't even have the latest Lumix! I highly recommend it.", "Date": "May 8, 2011"}, {"Title": "best camera I've ever had", "Author": "Vero Saenz \"bicycle rider\"", "ReviewID": "R2J9T2QSHCWA9T", "Overall": "5.0", "Content": "this camera is very easy to use, has a great zoom for it's size and it's lens is one of the best on the market...two people have purchased this camera on my recommendation  after seeing my pictures..", "Date": "January 31, 2011"}, {"Title": "Really outstanding more than I've expected", "Author": "Miguel Gonzalez \"miguelocta\"", "ReviewID": "R1FB7GF0YF1NS7", "Overall": "5.0", "Content": "Really have been a great surprise for me and my family, we have enjoyed this camera for a while and its excellent in all senses: great resolution, the battey life is very long, the display superb, easy to use (even my 5-years old son take pictures with it). Strongly recommended.", "Date": "September 8, 2010"}, {"Title": "very good camera", "Author": "Lloyd E. Ramsey", "ReviewID": "R2GLG8UM6PW6IC", "Overall": "4.0", "Content": "The main thing that I do not like about this tiny camera is that it is not SLR.  I cannot see enough of what will be in the frame to frame a photo.  That remains true for me for the early stages of zooming; and the slighly larger screen of the next model would not be enough better for me.  I have to trust the amazing resolution to crop and resize later.  The tiny size is also slow and tedious for me to handle without smudging the screen or shifting a setting button.  I'm moving around in rather rough terrain, using a tripod.  The lightness and size can have some advantages.  Not having to fool with a light meter is nice; but some of the images are over-exposed, and I have not learned to use the iA options.  With medium resolution for 3x2 aspect, I'm gettting 35 photos with internal memory, and with flash off have not recharged the battery yet.  None of the bundled software has even been loaded, so no comments on that.Not being able to pay for a digital SLR, I am very pleased with this one and would not trade it for another small one.  Some photos have been added at [..] for you to see by the dates.", "Date": "June 14, 2010"}, {"Title": "Best camera I've ever owned", "Author": "280te_chick", "ReviewID": "R3VJESQ4ECNROU", "Overall": "5.0", "Content": "I did not purchase this camera from Amazon, rather from a local camera shop. However, I need to tell you that this camera is really fantastic. I have been a traditional 35mm user (OK point and shoot) for many years and feared the transition to digital because of the menus and sub menus to refine my photos. I've tried to use digital cameras that were not my own and always manged to mix up the settings!  The Panasonic DMC-TZ4 is very easy to use and dare I say \"Intuitive\". Photo quality is sharp and I'm very pleased with my purchase. It has been dropped twice from waist level and survived - one year old and operating great. You should not be disappointed!", "Date": "May 27, 2010"}, {"Title": "Small and Powerful", "Author": "kpm \"kpm\"", "ReviewID": "R1KL9CDW8UI9XS", "Overall": "5.0", "Content": "The camera is small, light weight, but it is a solid construction. It has a 10x optical zoom which is very useful for taking pictures of animals in nature or objects or people at large distance. It also has a wide angle, which allows to get everybody in the picture, even in a small room. The macro settings allow for sharp focusing at very short distance, e.g. close up of a blossom. In off state, the lens is nicely protected with an automatic lens cover. Three different USB connectors allow for hooking it up to pretty much everything. I like it.", "Date": "May 6, 2010"}, {"Title": "One of the best point and shoots!!!", "Author": "Swapnil", "ReviewID": "R1KFG4L6DHVSM3", "Overall": "5.0", "Content": "I own a Nikon 5600 point and shoot and was satisfied with it... Later I upgraded to an entry level SLR (Nikon D60)..However, it was not possible for me to take the D60 everywhere and so was in need of a point n shoot that could give me good pictures and a good optical zoom in any lighting conditions..After reading a lot of reviews about the Tz4K I finally bought one...I am very satisfied with the purchase", "Date": "February 1, 2010"}, {"Title": "Very Nice all Around Camera", "Author": "H. Gress", "ReviewID": "R13DNT003I7EPU", "Overall": "5.0", "Content": "You don't need to do much to get a good picture just click the button and it Takes great pictures 99% of the time. The zoom is great also,has come in handy many times. The only down side to this camera is that it is kinda bulky to just stick in your purse, but that's about it.", "Date": "December 14, 2009"}, {"Title": "The greatest especially for shaky hands...~!.", "Author": "Marilyn R. Parker \"Indy Quilter\"", "ReviewID": "R3NVMQLA6MCHYN", "Overall": "5.0", "Content": "I have been taking digital for a few years..and sell my shots.  Since developing essential tremors...had a bit of a problem.  This camera really, really helps stabilize...love it...", "Date": "November 18, 2009"}, {"Title": "camera", "Author": "Jamie Anderson \"Jamie\"", "ReviewID": "R3SFLJAKO6QBXE", "Overall": "4.0", "Content": "I had a panasonic luminix in the past. I love the zoom in a small camara. The pic quality is not always consistant. And theres a lag between shots", "Date": "November 1, 2009"}, {"Title": "I Love This Camera!!", "Author": "Virginia Serghides", "ReviewID": "R36Y5CVJBKA0WE", "Overall": "5.0", "Content": "I shopped for awhile before buying this camera--I was happy when I found all the features I was hoping for in a moderately priced camera.  I took it on vacation and found it easy to use, small enough to carry in my purse, and it takes great pictures.  I kept it on the auto setting, and was able to get some great photos of birds and other wildlife--really, the photos were better than what I could see myself, plus great shots of friends even in less-than-ideal light settings.  This is a great camera for someone who wants to take good pictures but isn't really into all the tech-y stuff--the camera does it all for you.", "Date": "July 17, 2009"}, {"Title": "Great Camera", "Author": "Thomas Rikert \"Nihilist\"", "ReviewID": "RYYYU33O1ODOJ", "Overall": "5.0", "Content": "I owen three Panasonic Cameras.One of the best on the market.The lense, made by Leica, makes a big difference in regards to the picture quality.This one was a gift for my sister.She really likes it.", "Date": "June 7, 2009"}, {"Title": "Panasonic DMC-TZ4", "Author": "Ron M", "ReviewID": "R2RL7BHEN7RVRC", "Overall": "4.0", "Content": "I purchased this camera after using one belonging to a friend.  I'm very satisfied with the picture quality and the ease of use.  I like the zoom capabilites the 10X combined with the digital zoom allows me to take decent pictures even at a far distance.Two things I find annoying at times.  In bright sunlight, the monitor is hard to see and on ocassion I find myself pushing the menu button with my thumb while handing the camera.  Neither one of these things are major issues for me and I would recommend purchasing this camera.", "Date": "April 11, 2009"}, {"Title": "digital camera", "Author": "Kimberly A. Mihok", "ReviewID": "R37MFYV63HSFE9", "Overall": "5.0", "Content": "Well designed camera. Has alot of features if you know how to use them.It's intimidating at first, but with some experience with it, it will be worth having. Good price well designed to navigate through the screen.", "Date": "April 9, 2009"}, {"Title": "Very pleased", "Author": "Jacqueline Daley \"Cylence\"", "ReviewID": "R1M2O49AU30L5M", "Overall": "5.0", "Content": "The rapid burst is awesome. The settings take some getting used to, but overall it's very easy to adjust to. I am very very pleased w/ my purchase :)", "Date": "March 16, 2009"}, {"Title": "excellent pocket camera with best value", "Author": "L. Li", "ReviewID": "R33YZ31UZ3E5QF", "Overall": "5.0", "Content": "thought it is still not the match for the DSLR camera, it is best pocket camera in its kind for everything.If you are the architect like me, you will love the wide angel zoom for the interior shots.very happy with what I got.", "Date": "February 11, 2009"}, {"Title": "Great zoom for our trip to China!", "Author": "M. Ruzek", "ReviewID": "R3VDWAK9QUOZG5", "Overall": "5.0", "Content": "I was looking for a new compact camera with a modest price tag.  After researching I decided to get this Panasonic Lumix with 10X zoom (the largest of any compact) and am very pleased with it.  We took it on our vacation to China and were able to get some great shots that we could not get with our old HP.  My husband was using the Panasonic and I had the HP, so we have side-by-side comparisons.  It was also nice to be able to use the movie function to record messages for our family and friends and post them on Facebook so they could keep up with our trip.  Very satisfied with this camera.  One note: get a large - 8GB or more - memory card if you plan to take movies.", "Date": "February 5, 2009"}, {"Title": "Great Camera", "Author": "Hugo Coster", "ReviewID": "R2I4MKK2KNGJZ2", "Overall": "5.0", "Content": "Takes great pictures and does it without me having to do any serious input.  On the first day I spent an hour figuring out what the buttons meant and testing the different settings effects.  It wasn't difficult, simply try out what kind of modes you like the best and thats it.  I bought an extra battery because my last camera would stop after 100 pictures but this one works for much longer.", "Date": "January 28, 2009"}, {"Title": "Panasonic Lumix DMC - TZ4S 8. 1MP Digital Camera", "Author": "Barry L. Burtnett", "ReviewID": "R3GYCNSOI52A6V", "Overall": "5.0", "Content": "Great camera with good features. The pictures are clear. I would highly recommend this product.", "Date": "January 22, 2009"}, {"Title": "great point and shoot camera with room to learn", "Author": "Samantha Crisp \"Sammie\"", "ReviewID": "R3L5PTU4TPVIOF", "Overall": "5.0", "Content": "I absolutely love this camera.  It takes great point and shoot pictures but also has more advanced features.  I'm still learning the details, but for a novice photographer this camera is excellent.", "Date": "January 15, 2009"}, {"Title": "Great Camera", "Author": "K. DeBoer", "ReviewID": "R33FHMRAH41JWP", "Overall": "4.0", "Content": "Overall I love my camera.  It gives great pictures and has so many features for its tiny size.  The only thing I don't like is it seems to be a little slower recovering from flash pictures than I was led to believe, even with the battery fully charged.  I wouldn't give it up though - small enough to go everywhere and powerful enough for large pictures.", "Date": "January 14, 2009"}, {"Title": "easy to use", "Author": "Mrs. Otis", "ReviewID": "R204AZB5PFL0FL", "Overall": "5.0", "Content": "This is my first digital camera and I absolutely love it.  The Lumix is very easy to use, takes wonderful and very clear pictures, and excellent movies.  The 10x zoom is the best feature, allowing for some really nice shots.  The battery holds the charge for as long as needed, and recharges in about an hour.  I would highly recommend this camera.", "Date": "January 14, 2009"}, {"Title": "the best price/quality product", "Author": "Rodolfo Maripan", "ReviewID": "R229VECTR5G9TY", "Overall": "5.0", "Content": "This is the best camera for the price, if you are looking for a slim, lightweight wide angle camera, this is the best choicePros.I'm currently using this camera at the mountains in South America (Los Andes) even at 5000 mt. works perfectly, the image quality is very good, the optical zoom is incredible consideranig the size of the camera, ligth weight and strong structure.Cons.is not so good for taking pictures at night, but is fairly good considering the price.", "Date": "January 12, 2009"}, {"Title": "Panasonic Lumix camera", "Author": "Stacy R. Groggel", "ReviewID": "R1HEXZ0HMNDFV4", "Overall": "4.0", "Content": "Good point and shoot camera...could be better for indoor shots where flash is necessary but happy with it overall.", "Date": "January 12, 2009"}, {"Title": "Panasonic Lumix DTZ4", "Author": "Shirley M. Snyder \"Shirley Snyder\"", "ReviewID": "R3OOJMTTW7OJMB", "Overall": "5.0", "Content": "Cmaera is awesome.  Excellent features, including icamera, variety of SD cards, digital zoom, quality lens, overall body size, and ease of handling.  Camera takes quality videos - even for wedding and important functions.  Newer design is smaller and has added grip for ease of holding.If there is a drawback, its the side door for external plugins.  Door can open with hand position until your use to it. Door is located under strap mount on right side.I have the DTZ1 and thought that was wonderful until I purchased the DTZ4.", "Date": "January 12, 2009"}, {"Title": "Great little camera", "Author": "Hannelore Hansen", "ReviewID": "R1XXFCQKX3E5XE", "Overall": "5.0", "Content": "I love this camera. The photo quality is great. I only wish it had an optical viewfinder in addition to the LCD screen. Otherwise this camera is first rate.", "Date": "January 12, 2009"}, {"Title": "Love the Panasonic", "Author": "Jacine", "ReviewID": "RQAF5PXDU96GT", "Overall": "5.0", "Content": "This was purchased as an upgraded replacement camera. We love the Panasonic digital cameras. They are well constructed and provide beautiful picture quality. We would recommend the Panasonic TZ4K for serious beginners and intermediate level photographers.", "Date": "January 12, 2009"}, {"Title": "Great Gift", "Author": "Patsycline2u", "ReviewID": "R3T0XNKF03D8KO", "Overall": "5.0", "Content": "I am so glad I purchased this camera for my husbands Christmas gift. The service and shipping time was terrific and he loves this camera. I shopped and shopped to find the extra zoom power and talked to many sales people in camera depts as well as reading the reviews online. This was the least expensive place I found it including all the pre holiday \"door busters\"Thanks Amazon......", "Date": "January 12, 2009"}, {"Title": "All around wide angle lens winner", "Author": "Anna Pavlova", "ReviewID": "R2WZ1APPF28P3C", "Overall": "5.0", "Content": "I needed a wide angle lens camera for real estate work, and this works just fine.  I also had fun with pictures during a holiday trip to Philadelphia and the light show at the old Wanamakers (now Macy's) department store. My only problem was when I didn't realize I had shot a short video instead of a still shot. You can hear the music playing at the light show as the camera takes a shot of the tree and then goes down to the floor as it kept shooting after I thought it had done its work.  That only happened once. I had a 1 g disc at home and found there is plenty of room on it for hundreds of pictures, although the battery has to be charged once in a while.", "Date": "January 11, 2009"}, {"Title": "Great camera and excellent vendor", "Author": "Doc", "ReviewID": "R2QJSMH59DFLGX", "Overall": "5.0", "Content": "The camera is everything I wanted.  I checked it out in the store before I bought it so knew what I was getting.  I used it on a cruise and it was wonderful.  I was surprised by how well the videos it took came out.  Pictures are excellent quality and the 10x optical zoom is great.  The vendor was incredibly quick.  I ordered the camera on a Sunday and had it Tuesday morning - the shipping only cost me $5.00.  Best deal on the internet.  I would definitely use this same company again.", "Date": "January 11, 2009"}, {"Title": "Best Christmas gift I ever got!", "Author": "C. A. Lehman \"stoogeswoman\"", "ReviewID": "RL465PSRNJD2S", "Overall": "5.0", "Content": "My husband gave this to me for Christmas and I absolutely love it!  I have never owned a digital camera before, and have resisted buying one for myself.  In fact, the last camera I used was one of those 35mm disposables you get at the drugstore!  I just didn't understand a lot of the technological stuff involved and was afraid I'd be overwhelmed if there were too many complicated features.  My thoughtful husband did some research and came up with this one - and it's just right!  After fiddling around with the buttons and dials for a couple of days, I \"got it\" and took some wonderful pictures - even started making movies!  It's also very easy to download the pictures onto the computer.  If you're hesitant about jumping into the world of digital photography, this would be a great camera to start out with!", "Date": "January 7, 2009"}, {"Title": "This camera is great.", "Author": "V. Walk", "ReviewID": "R28LVAZD1SKP3A", "Overall": "5.0", "Content": "A friend of mine who is a professional photographer owns and recommended this camera.  I own a Canon 30D, but wanted something compact to take on a cruise over the holidays.  I absolutely love the camera.  No excessive out of focus photos.  The 30D has been spending more time on the shelf and less in my hands.  The TZ4 is simple to operate and feels like a quality piece of equipment. I liked the camera so much that I purchased another one as a Christmas present for my father.", "Date": "January 7, 2009"}, {"Title": "Excellent camera for the money", "Author": "Patrick Stevens", "ReviewID": "R2DRC9FRDIH11M", "Overall": "5.0", "Content": "I don't understand why people are saying that this camera's picture quality is low, I'm seeing the exact opposite. The stabilization feature rocks too! This is the best camera I've seen in this price range. Completely satisfied.", "Date": "January 6, 2009"}, {"Title": "Great camera for this average guy", "Author": "W. Benton", "ReviewID": "R3BZX2OOAFU87M", "Overall": "5.0", "Content": "I'm not a camera expert, just the dad of a 5 year old that wants to capture great memories.  It's easy to use, compact, and takes great pictures.  The processor and it's capabilities is amazing - from automatically detecting light levels so you don't get dark photos (I just took a great picture of my son, in the dark, in bed sleeping) to finding faces the picture and focusing on them correctly.  It also has a great feature allowing the user to take continuous photos with very little delay.", "Date": "December 24, 2008"}, {"Title": "Mega O.I.S Is Great. OK Pics", "Author": "M. Siau \"cherokeerebel\"", "ReviewID": "R1TKYCEBSQGVFN", "Overall": "4.0", "Content": "I bought this camera looking for something simple. I sell on eBay and just wanted something easy that took good pics, especially close ups and inside. In the iA mode it does not take good pics inside. In fact, I have tried playing with the settings but still no luck. Many of my pics have a red tint. I have tried different lighting conditions too. Inside, in my experience only, it works best depending on the flash. That being said it leaves shadows on my ebay items and yes, I try using stand alone lighting. I will say the image stabilization is wonderful! That's why I bumped it up to 4 stars as opposed to 3. To use the macro mode place the camera close to the object and try not to use the zoom. Also, outside it takes nice, sharp pics. In my totally uneducated opinion I would suggest someone looking for a camera to take a lot of indoor pics to try something else. This camera is nice if you're mainly taking outside pics. One really cool feature of this camera is the ability to zoom while taking video. I do believe the value for what I paid was good ($160) and Amazon shipped it quickly although they should have put some filler in the shipping box so the box inside didn't bounce around. I've only had it a few days and if I figure out maybe I'm doing something wrong or find settings that correct the \"red\" problem I will certainly come back and update.", "Date": "December 22, 2008"}, {"Title": "Panasonic Lumix DMC-TZ4S is a great little camera.", "Author": "C. Novotny", "ReviewID": "R3PFITRI6PEVWX", "Overall": "5.0", "Content": "We received the camera very quickly and all was well.  It's easy to use and the photos look very good (haven't had any printed as yet, but on the screen they look good).  We recommend the seller and the camera.", "Date": "December 21, 2008"}, {"Title": "Great Point and shoot", "Author": "Amazon Customer", "ReviewID": "R1HUQV8BJQ96KL", "Overall": "5.0", "Content": "This camera is fantastic i have been using it for 10 days now and the photos have come out great.In many different conditions (snow, rain, blue skies, night mode or movement) the Ia setting has worked very well the face recognition is allso very good.The best thing of the camera off course the 10x zoom fitted in such a small camera.", "Date": "December 12, 2008"}, {"Title": "Lumix is Exceptional!", "Author": "Demeter", "ReviewID": "R1P3ZIDFBOUONI", "Overall": "5.0", "Content": "I've been using this camera for about six months and am impressed with its versatility and performance.  Although it is somewhat heavy in my pocket, it fits, and I am always happy to have it with me.  At this price, it is amazing to have a 10X wide angle Leica lens. This camera takes exceptional photographsPros: Ease of Use; 10X Wide Angle Leica Lens; Outstanding results.Cons: Some lag time; no viewfinder.", "Date": "November 20, 2008"}, {"Title": "Love the zoom", "Author": "Picky Ooney \"Momofboys\"", "ReviewID": "RYI7BTTYZRFZO", "Overall": "5.0", "Content": "As easy to use as my Canon Elph was.  A bit bigger but worth it for the 10x zoom!!!", "Date": "October 9, 2008"}, {"Title": "a good compact point and shoot camera", "Author": "Yongfu Wang", "ReviewID": "R1LOEF1J1Y6R30", "Overall": "5.0", "Content": "It has an excellent Leika len for 10x optical room, and the IA mode is very useful, you can get good quality photos easily, just point and shoot. It would take a while for the camera to focus on the object you want.", "Date": "September 9, 2008"}, {"Title": "Better Than I Expected", "Author": "JNX", "ReviewID": "RSOZ9CALAURHC", "Overall": "5.0", "Content": "This camera is absolutely wonderful.  Easy to use, amazing zoom, fantastic video capability.  I couldn't be happier!", "Date": "September 7, 2008"}, {"Title": "Lumix shines", "Author": "Sam Fowlkes \"samfolks\"", "ReviewID": "RXE2LDTM2HBJI", "Overall": "5.0", "Content": "For a small camera to have 10X optical zoom power with image stabilization is awesome. But its best features is the scene1, scene2 option, ie. you can set scene1 for landscapes, scene2 for sports then depending on your subject a quick move of the selection dial allows you to go from auto to landscape or sports. GREAT feature.", "Date": "September 1, 2008"}, {"Title": "panasonic Lumix camera", "Author": "Tammy L. Malsom", "ReviewID": "R366A52QFOHL0C", "Overall": "5.0", "Content": "Absolutely wonderful camera.  The 10x wide angle brings everything close and vibrant.  There are so many special features to help you take wonderful, sharp pictures in any light.  I would recommend this camera to everyone.  My mother ran out and bought it after seeing the pictures it took on vacation.", "Date": "August 27, 2008"}, {"Title": "Luv my Lumix", "Author": "P. Wales", "ReviewID": "R38844DPW9A38W", "Overall": "5.0", "Content": "I purchased this TZ4K as a back-up to the TZ4K I recently bought for a trip to Peru.  I so loved the first, I wanted to be sure I had another TZ4 if something happened to the one I have.I'm not a technically savvy photo-geek, but I am an enthusiastic photographer.  The \"Intelligent Auto\" feature on the TZ4K is just what the doctor ordered -- I can capture photos under all kinds of light conditions and activity speeds as well as shots of close-up to faraway objects without having to think about it.  I took over a thousand pictures including ones from moving vehicles, and they all turned out great.If there's a negative aspect to this camera, I haven't found it.", "Date": "August 27, 2008"}, {"Title": "Great Point & Shoot without loosing quality.", "Author": "Michelle", "ReviewID": "RJ5NAE5HCU06C", "Overall": "5.0", "Content": "I previously had a much larger Fuji that seemed to always take blurry pics.  I wanted to keep the amount of zoom and have a much more compact camera and get a perfect picture quality that my Fuji lacked.  I've only had this camera one week but have taken many different pics in many different lighting/places.  These include baseball game, restaurants, work/office, home (& others' homes) and just driving down the road.  I have to say this totally meets my requirements for easy to use and still GREAT quality photos.  I would definitely recommend this for someone looking for the same in a compact package.  I did note this is heavier than it looks (not too heavy) but I'm sure that is b/c the good quality parts.  Buy this camera!!", "Date": "June 17, 2008"}, {"Title": "Summertime blues", "Author": "Ashley Gray", "ReviewID": "RUYTXCYPMQ2MY", "Overall": "2.0", "Content": "I was hoping I'd really like this camera. After all, a great lens and powerful zoom fitting in my pocket is very cool. Other reviews I'd read suggested this would be a great travel camera.Unfortunately, I cannot agree. Without a viewfinder, the reflective lcd is virtually impossible to see on a bright day. In fact, with my prescription sunglasses, there was no image whatsoever. With them off, I could barely make out my shot, but with no definition. I did read the manual and adjusted the display for outdoors, but it still was very poor. Further, with the lcd operational, I couldn't get more then 70 shots on a battery charge.I had a Canon before, and ended up going back to another. I didn't get the lense and zoom, but I sure feel I got a more thought out camera. Right from the manual (didn't need a magnifying glass to read it) to the auto focus, the Canon just seems to get it right more of the time.", "Date": "August 12, 2008"}, {"Title": "very good", "Author": "Joao C. Dacosta", "ReviewID": "R27ZWDGLLUVHDI", "Overall": "4.0", "Content": "The combination of number of shooting features and good quality for the price, 10 times zoom, Leica lenses, makes it probably one of the best of this category in the market.", "Date": "October 14, 2008"}, {"Title": "Excellent!", "Author": "Thomas C. Voltaggio \"tvoltagg\"", "ReviewID": "R24I5OYY7AZPHH", "Overall": "5.0", "Content": "This camera is fantastic.  I bought a TZ1 several years ago and really loved the small size and 10X optical zoom.  It was great for vacation shooting.  I decided to give it to my daughter so I could get the \"same\" camera with 8 Mega Pixels.There's no other point and shoot camera this small with 10x optical zoom.I recommend it completely.", "Date": "October 4, 2008"}, {"Title": "So far, so good", "Author": "Hometown Philly", "ReviewID": "R270CKGK4CBAK0", "Overall": "4.0", "Content": "I've had this camera for about one month.  The zoom quality is good, although extreme close-ups have not come out as hoped.  This could be my skill level - I'm still learning how to use the camera.Overall, I'm satisfied with the speed and performance of the camera.  It's easy to use and not difficult to navigate the menu.  Out of the box, it is a simple set up.", "Date": "July 28, 2008"}, {"Title": "Nicholas", "Author": "Nicholas Scott \"Nicko\"", "ReviewID": "R1IWEN48LDCXX1", "Overall": "5.0", "Content": "Very very good camera, I am very impressed. I purchased it for my girlfriend who originally had a canon sd1000 which she managed to drop after 2 months of owning it. However, it seems like it was a turn for the better. I am far more impressed with the features of this camera, the zoom is amazing and the scenery pre-sets are great as well. overall I would say it out performs the sd1000 in many areas. However there is one little disappointment and its the  darkness of the pictures when using the AI features, but that can easily be overcome with the backlight setting. All in all, she is very happy with it and so am I so I decided to purchase the Z5 for myself. That will come with another review when I take a couple hundred pictures with it haha.", "Date": "July 24, 2008"}, {"Title": "Good but not great.", "Author": "bigjr", "ReviewID": "RXTAXVIAP35UE", "Overall": "4.0", "Content": "Picture quality is great in good lighting.  In lower light, it's not great, but I've seen far worse.  Every once in a while, after taking a photo, I can't get it to take another photo until I do something with the controls.  Haven't figure it out.  I haven't played with it long enough to rule out user error, but it is annoying watching people's smiles go stale.  Anyways, for the price, I'm not complaining.  Seems like one of the better deals in it's class.  I'm going to keep using it ... maybe even read the manual one of these days.  The IA setting isn't that great.", "Date": "June 20, 2008"}, {"Title": "retired professor", "Author": "richy", "ReviewID": "R2154YP4374G2N", "Overall": "2.0", "Content": "I desired a camera that could be easily put into a pocket or purse. It was to replace an old Fuji point and shoot, with a 6X zoom and to supplement a DSLR. The Fuji never worked well in low light and even worse when I used the flash. The Lumix TZ4 was to replace my old buddy. The reviews on the Lumix were outstanding -- however all that glitters is not gold. While the TZ4 worked well in bright light it was extremely disappointing when used in low light levels -- inspite of all it's rave reviews. It was not a whole lot better with the flash. I sent it back after using it for a week and bought a Canon SX110 IS. WOW, what a difference and the zoom at 10X is better than my Fuji's 6X and the Lumix. And the colors and performance in low level light is wonderful. The image stabilization works well also. I also bought a Canon DSLR Rebel Xsi and this little SX110 has a performance that is quite competitive to the Rebel, except the little guy has a much better zoom! And it fits into my pocket!", "Date": "January 7, 2009"}, {"Title": "Nice Little Camera for the Pocket", "Author": "ElmoTheCat", "ReviewID": "R278938O2V6Z4C", "Overall": "4.0", "Content": "Can't ask for an easier to use menu interface. Great pictures. Umpteen picture taking modes. Everything is automatic, meaning there is no manual aperture or exposure settings. Having just gotten this recently, I was surprised the easy the shooting mode dial turns... maybe too easy. in fact, I wonder if it's loose... anybody owning same, please comment.", "Date": "July 16, 2008"}, {"Title": "One Pretty Good Camera.", "Author": "Sloan D.", "ReviewID": "R1A3LH4XJR7FYF", "Overall": "5.0", "Content": "Thus far, this has been one very good camera!  It is easy to use.  I have taken some very good pictures of sports events, dimly lit indoor events, and even a self-portrait. It seems to be just the right camera for point-and-shoot, amateur photographers such as myself.  Since I'm not a serious photographer, I can not attest to the specific perks of owning this camera.  Yet, I would suggest this camera to a friend.", "Date": "June 8, 2008"}, {"Title": "Not for pics of kids indoors", "Author": "Ruth Princess \"Your Fairy Godmother\"", "ReviewID": "R2T2WGY79KQXOI", "Overall": "1.0", "Content": "I used to have the FX01 and everyday that I used it, which was close to every day, I would say how much I loved this camera.  Then it fatally broke and I \"upgraded\" to the TZ4.  Every other day that I use this camera, I say how much I hate it!!!I know I should give it 3 stars because for outdoor shots it is 5 stars but candid indoors a 1 star might be too generous.I feel as though I was ripped off by several hundred dollars.  When I first got the camera 2 years ago, I took tons of outdoor pictures of Chicago buildings in the bright summer sunlight.  The zoom would take a clear picture over 50 stories high (check out my Jetsons Chicago video on Youtube ruthejp13).  But once I brought the camera indoors after it was too late to return it, I discovered the horrible flaws.  People in the corners and background of bad lighting shots looked like they were Coneheads.  If the main subject wasn't blurred, which was often the case, the further depth subjects looked like something in a carnival house of mirrors.  Now I don't even carry the camera with me anymore because I hate it so much.  One of the reasons I liked my first Panasonic is because I could do so much with it.  I knew all the settings and best way to capture what I wanted.  With this camera it doesn't matter what setting, it won't take good pictures of moving kids indoors.  I know, I've tried everything for the past two years.They upgraded the firmware once for better focusing and it helped but not enough.  I would love to compare it to an old fashion film camera because I think the processor is messing up the pictures instead of improving them.  What good is a \"image stabilization\" if round-faced baby looks like her head was pulled to a point with forceps?  It might be a nice clear picture but not accurate by any means.I'm thinking about getting something without image stabilization or focus just so if the picture is bad, I know it's my fault.  Not really but that's how bad it is.  Seriously though, one picture the kid was in the upper corner and the next picture that same kid was in the center.  You could not tell he was that same child and the picture was taken a second later.  When framed artwork in a background corner looks curved, you know there is something wrong.", "Date": "January 14, 2010"}, {"Title": "Great device", "Author": "MR \"M\"", "ReviewID": "RFLLBHOK2UOG1", "Overall": "5.0", "Content": "I love this camera. Makes great pictures with little trouble. The shipping was fast although I was a bit scared when I couldn't track it online since Amazon's link didn't work.", "Date": "February 24, 2009"}, {"Title": "chucky", "Author": "Charles Edward Jaster", "ReviewID": "RK1G04CXUA4VW", "Overall": "4.0", "Content": "excellent camera in both price/features-bought one for myself and one for xmas presesnt-zoom is fantastic on camera-panasonic makes great products ,easy to use and great value for price- overall great purchase-Panasonic Lumix DMC-TZ4K 8.1MP Digital Camera with 10x Wide Angle MEGA Optical Image Stabilized Zoom (Black)", "Date": "February 16, 2009"}, {"Title": "Excellent deal!", "Author": "COSTA RICA \"PURA VIDA\"", "ReviewID": "RWI8MQW3L6V1Q", "Overall": "5.0", "Content": "Everything went perfect. The product is great and the delivery was according to schedule. In the past, I didn't trust on buying articles on the web, but now, thanks to Amazon, I'm confident that everything I buy for in this website will be delivered on time and in perfect conditions. EVERY DEAL IS A GREAT DEAL WITH AMAZON!!", "Date": "February 12, 2009"}, {"Title": "very nice camera, wait till the price drop under $200", "Author": "CheapTech", "ReviewID": "R2EAKBEX46X15H", "Overall": "5.0", "Content": "Very good all around camera for beginner and intermediate user.10x optical zoom is simply amazing, surprisingly packed in the size of a wallet. Big lense as well. Very satisfied with this purchase. Its price dipped to $160 in Dec 2008 for some reason; only last couple of days...Maybe it'll happen some other in the future?", "Date": "February 5, 2009"}, {"Title": "Terrific camera", "Author": "Gary I. Busman", "ReviewID": "R25MHSU9KSHCO5", "Overall": "5.0", "Content": "Best camera I have ever had. Useage is exceptionable. Pictues fantastic. Would recommend to anyone desiring a 10X zoom. Like 2 cameras in one.", "Date": "February 1, 2009"}, {"Title": "I like this camera", "Author": "drippy fausett", "ReviewID": "RD5SMDF0EB1Z7", "Overall": "4.0", "Content": "Haven't used it a whole lot so still learning to use it.  Seems to be a well built camera except for the plastic tripod mount and the some what flimsy lens cover.", "Date": "January 18, 2009"}, {"Title": "Great Point and Shoot", "Author": "Dr. Josh L. Handt \"Dr. Josh\"", "ReviewID": "R2YZVYFHDDP88S", "Overall": "4.0", "Content": "This camera works great as a second camera to my SLR. Some funky menu settings, but very easy to use.  I would recommend it.-Josh", "Date": "January 15, 2009"}, {"Title": "panasonic lumix camera", "Author": "P. M. Gregory LLC \"pmg1291\"", "ReviewID": "RIQ7BYK3TTS9D", "Overall": "5.0", "Content": "This is an excellent canera for the money. I really like the clear close-ups, picture quallity is excellent.", "Date": "November 24, 2008"}, {"Title": "Best little camera AND a fantastic price", "Author": "J. Jaczkowski \"M Jaczkowski\"", "ReviewID": "R3JDAO6ISR8U5Z", "Overall": "5.0", "Content": "This camera is what I have been waiting for. It does it all. Easy to follow instructions. Easy to follow menus on the camera. Super photos and videos . And a price that did not hurt my budget.", "Date": "August 22, 2008"}, {"Title": "Great Camera", "Author": "Cherity \"Go Sox\"", "ReviewID": "R2SCEW73Y9IAQK", "Overall": "5.0", "Content": "I'm very happy with this camera.  It was the most megapixels and zoom that I could find for this price.  My pictures have come out great and it is easy to use.", "Date": "July 25, 2008"}, {"Title": "Great value, wide-angle lens", "Author": "Jim Moore", "ReviewID": "RWG9IO7032TGM", "Overall": "4.0", "Content": "This camera is performing very well, especially the 28mm lens.  It makes all the different for interior shots of real estate.", "Date": "September 1, 2008"}, {"Title": "Help!!!", "Author": "John H. Gruver \"brainactiv\"", "ReviewID": "R2GC450AQ12VKT", "Overall": "5.0", "Content": "I've gone to Panasonic's site, downloaded the firmware update, but there are no instructions on how to do it???!!! My computer will not open the download. The camera doesn't recognize the download... what????Fantastic camera, btw. Bought it for my in-laws...", "Date": "July 27, 2008"}, {"Title": "panasonic lumix dmc tz4k", "Author": "Norman Cohen", "ReviewID": "R15FSVXCWGKSR1", "Overall": "4.0", "Content": "A first class digital camera for the price. The zeiss lens is certainly a main attraction. Its features assure an excellent result.The one drawback is that there isn't a view finder. It's extremely difficult to size up a photo with the sun on the lcd monitor.", "Date": "July 6, 2008"}, {"Title": "Failed in 4 months, warranty too short, other problems", "Author": "frannyglass \"frannyglass\"", "ReviewID": "R38MNEZUNZD4B2", "Overall": "1.0", "Content": "This camera has great features and great value.Except:1. The camera failed after 4 months--and wouldn't turn on.2. The camera has a problem focusing when you're fully zoomed in3. The control wheel at the top is poorly designed so that it gets moved and out of place all the time4. The warranty that Panasonic extends is criminally short: 90 days!5. The screen sticks out from the camera making it vulnerable to breakage and making it highly susceptible to glare.Otherwise it's a great value for the money!", "Date": "October 10, 2008"}, {"Title": "Bad Picture Quality", "Author": "William F. Sherman", "ReviewID": "RI8QASPZLHZ9", "Overall": "1.0", "Content": "Camera has great zoom qualities. The picture quality is very poor. I dont care how you adjust the camera, it still will not take vivid pictures.", "Date": "October 6, 2010"}, {"Title": "Excellent outdoor rambling camera", "Author": "D. P. Schroeder \"Paukenwirbel\"", "ReviewID": "R21S82S2V7Y49I", "Overall": "4.0", "Content": "I'm extremely impressed with the Leica lens and Venus IV engine in this camera for outdoor pics, especially with the wide angle (28mm eq.) through 10x optical zoom (15.9x w/digital).  Pictures are extremely clear with great color and very little distortion.  Plus, with its size, you can easily buy a \"fanny\"-type carry bag that hooks on your belt, and if you're walking around or hiking, biking, etc., it's extremely convenient.I have had some problems similar to those reported elsewhere with indoor shots in moderately low light.  The flash is ok, but it's easy to cover up with your right middle finger.  Plus, the Auto White Balance has some problems in low light, especially, producing some pictures that definitely need some post-processing to look good.  This is the only reason I deducted one star.  My biggest disappointment is that it's not as good as my Canon PowerShot A720IS 8MP Digital Camera with 6x Optical Image Stabilized Zoom for indoor photos, though it has the capability to be better since it has a wide-angle option which should really improve upon the Canon.Interestingly, it takes excellent macro pics, even in NO light (see my pics I've uploaded).  It's true that with this lens, you can't get quite as close to the subject as with other digital pocket cameras, but I'm still thrilled with the results.Overall, I'm quite pleased, though I think that to take advantage of the best features of this camera, it's best used outdoors in fairly good light.", "Date": "July 27, 2008"}, {"Title": "Go for a Sony", "Author": "M. Gunther", "ReviewID": "R2OEMD5GZRD84V", "Overall": "1.0", "Content": "I've had this camera for just over a year.  It's very easy to use and has a nice menu of photo taking options, but the photos aren't great.  Last week I was walking in the house and dropped in and now it won't turn on - it's just completely dead.  It's not like I dropped it from a great distance - it was just from my hand to the floor.  Makes me think the construction isn't great.My father has a Sony CyberShot DSCW170 and the photos it takes are amazing.  I would recommend that and will buy a Sony for my next camera.", "Date": "June 13, 2010"}, {"Title": "Descent", "Author": "Doug Green", "ReviewID": "R1H0KKYICDLCAQ", "Overall": "3.0", "Content": "No frills, feels really solid, pretty compact for a 10x. But I think if I had to do it over I would get the TZ5K, the manual is annoying when it says it can do a certian function then has a * saying TZ5 only....", "Date": "July 21, 2008"}, {"Title": "It does everything and is good quality", "Author": "L. Rangel \"buyer\"", "ReviewID": "RX156B57CVNKW", "Overall": "5.0", "Content": "Panasonic Lumix DMC-TZ4K 8.1MP Digital Camera with 10x Wide Angle MEGA Optical Image Stabilized Zoom (Black)great product and does everything. Still learning about its capabilities.", "Date": "May 5, 2008"}, {"Title": "Panasonic TZ4S", "Author": "Paul Ashley", "ReviewID": "RNX3NICNOQ6NM", "Overall": "1.0", "Content": "I own a Panasonic LZ3 5MP far superior to the TZ4S. So I thought I would upgrade to 8MP and 10optical zoom instead of the 6X optical zoom. I will definitely return this camera. Ugh! Like the earlier reviewer said great stats poor camera. Controls are a little sharp with rough edges for starters. Secondly, the offset placement of the lens leaves no room to place your fingers to steady the camera. Forget the other reviews and this camera as it is very poor. Leica lens you say.. if you have to put your fingers over it to steady camera where is the rub...", "Date": "July 17, 2008"}, {"Title": "Panasonic Lumix DMC-TZ4S is a piece of junk!!", "Author": "E. D. Davey", "ReviewID": "RXCB8EDAN94UK", "Overall": "1.0", "Content": "I purchased a Panasonic Lumix DMC-TZ4S in late December 2008.  I took the camera to New Zealand for what I thought would be a great vacation.  The camera stopped working on the second day of the Milford trek.  The camera did not get wet. It was in our waterproof gear and nothing else got wet that was in the same area. Instead, it seems that the humidity was too much for it to handle. At first we got a card read error, tried a different card, got the same error, then tried to use the internal memory on the camera, but it started flashing different error messages then went kaput.I would not recommend any one buy this camera!  Unless, of course, you want your vacation ruined.  I would not recommend any one buy a camera from Amazon because of their 30 day return policy.", "Date": "March 23, 2009"}, {"Title": "Tempting specs; bad product! Really bad.", "Author": "Sanjay Bhandari \"Ziffusion\"", "ReviewID": "R3TZ1FRWC3XLXD", "Overall": "1.0", "Content": "It looks great on paper - wide angle Leica lens, 10x zoom, 8.1MP, wide screen modes, image stabilization. What a disappointment though.1. Pictures come out grainy (noisy). And it is VERY obvious; you don't have to use a magnifier to see it.2. Bad performance in low light.3. The camera stopped working within minutes of receiving it. Kept displaying message \"shutdown camera and start it again\" - but to no avail.4. Somewhat bulky for a compact.I'll stick with Canon thank you.(This review is for the product. Amazon was GREAT with their no fuss return policy!)", "Date": "June 13, 2008"}, {"Title": "it's a very beginer's camera", "Author": "I. Toufique", "ReviewID": "R1ME0Q1M5Q30XM", "Overall": "2.0", "Content": "this is a camera for very beginers. if you are a occasional user, this is an OK camera for you.  I took this thing to take pictures in a wedding, after taking 15-17 pictures, the unit started to hit up, flash was sucking up all the battery juice.", "Date": "August 17, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.1-megapixel resolution captures enough detail for photo-quality 16x 22-inch prints\n10x optical zoom Leica DC lens; Face Detection\nNew Panasonic Venus Engine IV improves noise reduction, elevates the detection accuracy and corrective effects\n2.5-inch LCD; Mega O.I.S. and Intelligent ISO\nCaptures images to SD memory cards (not included)", "Name": "Panasonic Lumix DMC-TZ4S 8.1MP Digital Camera with 10x Wide Angle MEGA Optical Image Stabilized Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41mb6YBdehL._SX300_.jpg", "ProductID": "B0011Z2402"}}