{"Reviews": [], "ProductInfo": {"Price": "$139.99", "Features": "Everything In This Kit Is Brand New Items + Full Usa Warranties\nBelow Is A Full listing Of All Items In The Kit\nHIGHLIGHTS OF KIT : \"0.5x Digital Wide Angle Macro Professional Series Lens\" - When you've run out of room and your back's against the wall and you just can't seem to squeeze everything you want in the shot, just put on this wide angle lens attachment to get it all in the picture. This 0.45x wide angle attachment more than doubles your camera's wide angle field-of-view. You'll be able to get more of the scene in your scenic shots and more of the group in your group shots. The Wide Angle Lens's detachable Macro Lens enables you to photograph small objects up close. Great for jewelry, coins, stamps, flowers, and more. Even if your camera already has macro capability, this macro lens will get you even closer for truly amazing close-up photos\n\"2x Digital Telephoto Professional Series Lens\" - When your digital camera can't get you quite close enough to the action, this 2x telephoto accessory lens will bring the action twice as close to you. It's perfect for all your long-distance photos of sporting events; candid portrait shots, as well as nature and wildlife photography. This is the ideal lens attachment for sports fans, bird watchers, animal lovers, and parents whose kids play sports. In just seconds, you'll have this attachment on your lens erasing half the distance between the world and your camera. Best of all, these specially designed high quality digital accessory lenses are 100% compatible and fully automatic with your camera's autofocus and auto-exposure systems, so they're easy to use.\n\"High Resolution 3-piece Filter Set (UV, Fluorescent, Polarizer)\" - This filter kit contains 3 filters: FILTER UV: Protects your camera's lens from scratches, dust, dirt, moisture, and fingerprints, while reducing unwanted ulra-violet light. FILTER PL: Polarizers let you acheive vibrant color saturation, reduce or eliminate glare and reflections from non-metallic objects and glass surfaces, and minimize haze. FILTER FDL: The F-DL fluorescent light correction filter gives true-to-life color rendition by removing the harsh yellow-green cast ordinarily resulting from fluorescent bulbs.", "Name": "30 PC ULTIMATE SUPER SAVINGS DELUXE DB ROTH ACCESSORY KIT, INCLUDES FLASH, LENSES, FILTERS, ACCESSORIES AND MUCH MORE! FOR THE Olympus E-420, E-410, E-400 Digital SLR Cameras Which Have This (25mm) Olympus Lens + BONUS Gift = Waterproof Camera = Great For Kids", "ImgURL": "http://ecx.images-amazon.com/images/I/61VP99X%2BOiL._SY300_.jpg", "ProductID": "B001S3VG4W"}}