{"Reviews": [{"Title": "Christmas Gift", "Author": "Chris Kovach \"Amra_Lion\"", "ReviewID": "R2B3U4CLI5K2HE", "Overall": "5.0", "Content": "I bought this bundle from Walmart(where it was originally offered) for my wife for Christmas, and it works awesome, yeah it not as detailed as the higher mega pixel cameras , but for the price of $99 it is an awesome set. The printer will go anywhere and print right from the camera no PC needed. My wife took a trip right after Christmas and took  her set with her. She was printing and taking pictures of the family and of the kids for the family to have the whole time. It is exceptionally user friendly, there is even some basic editing options built into the camera. If your looking for a Very Good Quality camera printer set , you cannot go wrong with this one for the money. 5 Megapixels isn't as high as most cameras out there but it makes incredibly detailed 3x5 or 4x6 photos", "Date": "May 24, 2008"}, {"Title": "Perfect for vacation, scrapbooking, and home!", "Author": "Nester \"Corinne\"", "ReviewID": "R3C2JTNQAH3BAI", "Overall": "5.0", "Content": "I got this is a gift and have used it so much more than I even expected!  The quality of both the camera and photos are so good and it's so easy to grab and go!", "Date": "March 24, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Camera TypePoint & ShootDigital Zoom5xSensor Resolution 5.0 MPScreen Size2.4\" Optical SensorSensor Size1/2.5\"Sensor Type CCD\nScreen Size2.4\" Optical SensorSensor Size1/2.5\"Sensor Type CCD\nSystemMacro Focus Range10-80cmFocus Adjustment Automatic Auto Focus typeTTL contrast detectionFocal Length Equivalent to 35mm Camera36 - 108mm\nHP's intuitive-to-use Photosmart M447 Digital Camera? Get ready to snap away with impressive results, courtesy of the 5-megapixel resolution and 5x digital zoom. This model also has Steady Photo, an antishake feature that helps eliminate motion blur, and a bright, 2.4\" display for framing and reviewing shots.\nCamera FlashFlash TypeBuilt-in flashRed Eye ReductionYesEffective Flash Range3.6 mCamera Flash FeaturesAuto Flash, Flash Off, Forced On, Red-eye Reduction FlashFlash ModesAuto Mode, Fill-in Mode, OFF mode, Red-eye Reduction Memory / StorageIntegrated Memory size16 MBSupported Flash MemoryMultiMediaCard, SD Card, SD Memory Card, SDHC Memory Card ViewfinderViewfinder TypeNone DimensionsDepth1.45 in.Height2.48 in.Width3.78 in.Weight6.3 Oz. DisplayDisplay TypeLCDDisplay RotationBuilt-inScreen DetailsLCD display - TFT active matrix - 2.4\" - colorDisplay Size2.4\" MicrophoneMicrophone TypeMicrophone - built-in - monoMicrophone Operation ModeMono ConnectionsConnector Types1 x USB, 1 x docking stationExpansion Slot1 x SD Memory Card System Requirements for PC ConnectionOperating System SupportedApple Mac OS X 10.3.9, Apple Mac OS X 10.4 or later, MS Windows Vista, MS Windows XP Home Edition, MS Windows XP Professional, MS Windows XP Professional x64 Edition, Microsoft Windows Vista, Microsoft Windows XP Home Edition, Microsoft Windows XP Professional BatteryBattery Form FactorStandard form factor File FormatDigital Video FormatMJPEG, Motion JPEGStill Image FormatEXIF 2.2, JPEG ResolutionMax Video Resolution320 x 240 Environmental ParametersMin Operating Temperature0 °CMax Operating Temperature40 °C", "Name": "HP M447 Photosmart Compact Photo Studio Digital Camera with Printer", "ImgURL": "http://ecx.images-amazon.com/images/I/31iBPk438PL.jpg", "ProductID": "B0018N637W"}}