{"Reviews": [{"Title": "...the best digital point-and-shoot I ever had", "Author": "dorel_c", "ReviewID": "R2RK1Z0SEXOA1V", "Overall": "5.0", "Content": "I owned several cameras, film and digital, and this is by far the best digital point-and-shoot I ever had. I have to admit that it took me a long time to decide on buying a Casio as opposed to Cannon, Nikon, or Pentax, as I had very good experience with those.However my wife was supposed to be the main user of this new camera, so when she saw it in a store, she was sold on it, as the camera is very small and very good looking. She loved the green one (which is is actually a greenish yellow) so we paid $10 more than the black one and got it.To me it took a lot more to be convinced, so here is my point of view on it:Pros:- Very good quality of the pictures (the auto focus works great and the multi point metering system takes care nicely of most situations, including some more difficult shots (like high contrast, back lit subjects, moving subjects, etc)- I love that you can easily switch between standard format (1.33 ratio), film format (3:2 ratio), or wide screen (16:9 format).- Metal body, makes the camera fill solid and you can have a good grip and stability.- Easy to switch between different menus like changing formats, flash modes, ISO sensitivity, different self timer settings, shooting modes (like single, continuous, etc), auto shutter, and face recognition modes.- Although I consider face recognition a gimmick and I never use it in real life, I did try it and surprisingly works very well! Not only the camera will find and focus on the face, but you can set also the Auto-Shutter to take the picture only when the subject smiles. There is even more: you can record several faces in the camera's internal memory, and when those people are in a larger group, the camera will find their faces and focus on them, so they come out the best! I tried the freakish feature and it works!!!Also, it has other many Auto-Shooting features, that some people might want, I tried them, they work but, I don't normally need most of them.- The movie recording quality is very good. I set it to wide screen and the highest quality and it is exceptionally good, I say at least like a DVD (also it does record sound very well, with no significant camera's own noise).- It has its own movie recording button, so you do not need to go though any settings in order to start filming. You push the trigger on top, you take pictures, or if you push the trigger on the back side, you are filming (push again to stop). It can not get any simpler or faster.- If you don't like to mingle with settings, you may find the \"Best Shot\" setting very simple and useful. You click the \"BS\" button (funny name... ;-), and you get a bunch of sample photos. Use the left-right-up-down buttons to navigate to the picture that is similar to what you are shooting, push OK, and the camera sets itself up for that type of picture (like flowers, portrait, self portrait, sports, night scenes etc, etc).- I love the burst shooting mode (aka CS - Continuous Shooting), which has several settings:CS - shoots pictures at the quality you set as fast as possible;CS-FAST shoots lower resolution pictures and saves them to the internal memory. I got about 4 to 5 pictures per second in this mode, and the quality is good enough to print 5x7\" pictures. This is a life saver when your kid shakes hands with the principal of the school, when they make a karate jump, or when they throw that ball. Normally you push the trigger and hope the camera takes the picture at the right time. With this, you push the trigger a little earlier, hold it until the kid is through, and before you know it you have a series of pictures taken at short intervals of each other, so your chances are a lot better to find one that shows what you want to see.- Used with a 4GB SDHC memory card, my wife took literary hundreds of pictures and filmed many minutes of movie during a recent trip before she had to transfer them to the computer. She did that only several times during the 3 weeks trip.- Also, one charge of the battery lasted for several days. In fact she did not charge it until, into the four or fifth day of the trip, the low battery message came on.Negatives:None so important to give anything lower than a five star rating.- I would have liked a \"shorter\" focal length on the close end, so that you can have a wider view as sometimes there is not enough room to get away from larger groups of people. However most of the cameras have this focal lengths, so this is just a wish with small point and shoot cameras.All being said, I love this little camera.", "Date": "July 3, 2008"}, {"Title": "good for my purpose", "Author": "Wensheng Wang", "ReviewID": "RD2B49MH3HELH", "Overall": "5.0", "Content": "I bought this camera mainly just for video.  From my search only Casio have point-n-shoot camera that capture more than 640x480 at 30fps.  This Z80 can capture 848x480 at 30fps. Samsung's L210 and S1050 can do 800x600 but only at 20fps.  Video quality at 848x480 (casio call it UHQ/HQ wide mode) is quite good.Image quality is OK, it's no where near that from my Rebel xti, but acceptable, again I am not too worried about image quality.Control, UI are good.  (You can try it at WalMart or Costco)Other pluses are its small size and low price.Minus: H.264 movie is in .mov format, I don't have quicktime or itune(hate them), I installed \"quicktime alternative\" and can watch them in WMP or mediaplayer classic.Another thing is Vista keep importing movies that's have been imported. It just do this to movies, pics are fine.  I usually click \"erase after imporing\", so it's not big deal for me, and it's Vista's problem not camera's anyway.overall I like it.", "Date": "May 21, 2008"}, {"Title": "horrible", "Author": "K. Sullivan \"photo enthusiast\"", "ReviewID": "R29S91ZDKPO7AU", "Overall": "1.0", "Content": "This camera produces way too much noise. The screen resolution is extremely lousy, and the images, everytime, without fail come out blurred (even though I set the sharpness to the highest setting.) In addition to this, the color quality is extremely poor. I initially thought that the noise was due to the poor screen resolution, but when I transferred the images to my camera, the noise was even worse! Also, there is no viewfinder and the camera altogether seems very cheap and poorly made. You have been warned! Stay away if you wish to be able to take at least have decent pictures.", "Date": "January 1, 2009"}, {"Title": "Awful camera, doesn't worth the price", "Author": "cyberboy", "ReviewID": "R22PMEN8UVQ87I", "Overall": "1.0", "Content": "I buy this camera 2 years ago and it has been a pain in the neck. Pictures indoors are blurry most of the time and time between pressing the shoot button and the reaction seems like for ever. I found myself loosing lots of precious moments due the slow shoot response. I buy this camera because I use to have an old Exilim Z30. Which takes beautiful pictures and was very fast.Also after dropping it from about 3 feet the video several buttons stoped working.Don't buy this camera.", "Date": "August 17, 2010"}, {"Title": "Definitely not up to description. :(", "Author": "Terry Collins III", "ReviewID": "RDVNG9SGKYN3M", "Overall": "2.0", "Content": "I can't record using the camera which was not in the description. None of the buttons work except for the button used to take the picture. Not up to description. I cannot save any changes made to the settings either.", "Date": "January 31, 2014"}, {"Title": "Love this camera!", "Author": "Jose R. Santaella Del V \"Jorasavi\"", "ReviewID": "R1ZJXB6HV5SH2T", "Overall": "5.0", "Content": "My second camera from casio. This camera looks very good, amazin pictures and functions. I am really happy with the performance. Love the battery life, the charger port and how easy you can handle the pictures on the PC.", "Date": "June 27, 2012"}, {"Title": "Horrible.", "Author": "Jillian", "ReviewID": "R385BN0ZC0DIPZ", "Overall": "1.0", "Content": "I've had this camera for a couple of years now, and all I can say is...uuhrg. This is a horrible, horrible camera. Everything was grainy. I have been into photography for years, and even after adjusting the manual settings, nothing came out so it wasn't horrible amounts of grainy.After a while, for no reason I can imagine, pretty much all the buttons stopped working. I couldn't use anything but manual settings, I couldn't record, and I couldn't delete anything.On the subject of recording- after the camera button stopped working, every once in a while when I was trying to take a picture, it would just start filming. This would happen several times during a day when I was trying to take photos. Due to not being able to delete anything, I couldn't remove the random few seconds of video that the camera was insistent on taking.All in all: horrible camera. Do not buy it.", "Date": "June 25, 2011"}, {"Title": "Great buy", "Author": "Kion S", "ReviewID": "R3DDGQ2B2H77SB", "Overall": "5.0", "Content": "Someone recommended the Casio Exilim to me and I was not disappointed. I'll just outline my favorite features:1 - Small, lightweight and comes in 'girly' colors2 - the delay between taking the snapshot and photo capture is almost non-existent3 - the screen is very large4 - it comes with a re-chargeable battery!! (no money to be spent on batteries yay)5 - Easy to useIn summary I absolutely love it!", "Date": "February 14, 2009"}, {"Title": "camera", "Author": "baybreeze 74", "ReviewID": "R26BEJGZPSPTHK", "Overall": "3.0", "Content": "I was disappointed in this camera. It was smaller than my last Casio which was alright except my new batteries did not fit in this camera. The opening on the bottom was flimsy, it seemed like it would not take long to break.", "Date": "February 3, 2009"}, {"Title": "Very Happy with My Purchase of the Casio EX-Z80BE Camera", "Author": "JoolieSews", "ReviewID": "R312ZG9Y7ZSDJD", "Overall": "5.0", "Content": "I purchased this camera first in a green color for one daughter at a local store.  It was so easy to use, she caught on quickly and the big view screen on the back is so wonderful.  The quality of picture put side by side to two other digital camera's in the household, is so much clearer and crisp colors.  I have always enjoy the quality of my other cameras and didn't know that there was anything lacking.  Really the first and formost reason for buying my first one of this brand and style was for the color.  Since a few months have went by and only impressed with my daughters pictures, I bought this one for one of my other daughters because she loves blue.  I went for the same camera because of how impressed I am with the quality and ease of use.  I have since purchased another in pink for my 3rd daughter and yet another one step up for myself.  I was going to get the same camera for me, but they only had one like this in the 10MP, not many other changes between the two.  I have put the pictures from these cameras against my husbands $550.00 camera's pictures and my pictures are better so are my daughters.", "Date": "January 11, 2009"}, {"Title": "Great little camera", "Author": "Artcast", "ReviewID": "R1215E3CRL11LQ", "Overall": "5.0", "Content": "I purchased this camera about a month ago because I wanted a camera with video capabilities at a reasonable price and this one fit my requirements it is easy to use and it takes great pictures and video.", "Date": "November 18, 2008"}, {"Title": "I wish I had bought something else", "Author": "Maggie", "ReviewID": "R3SAK0TVKRQZQE", "Overall": "1.0", "Content": "Awful, awful camera. I have a nikon d40-x, which I am in love with, but I wanted something smaller and something to take videos with. I also didn't want to pay very much since I wouldn't use it that often.I keep thinking that I must be doing something wrong with this camera, but I have tried changing all of the settings, and nothing has helped. The ISO is set to automatic by default, and the photos are terrible and grainy. Even when I set the ISO to 200 the photos are less grainy but still not good. None of my photos have ever come out in focus. The videos are insanely grainy as well. The only good thing I can say about this camera is that the sound recording quality is pretty decent for concerts. That's it. Do not buy this camera. Spend $100 and get something you won't hate.", "Date": "June 6, 2009"}, {"Title": "Casio Exilim Camera Blue", "Author": "Edward W. Oliphant", "ReviewID": "R3OOOTN53NSCY8", "Overall": "5.0", "Content": "Love this camera for my child. Small and easy to carry. LCD screen is big and easy to see.", "Date": "August 24, 2008"}, {"Title": "Think before buying", "Author": "S. Robinson", "ReviewID": "R7LTUSACQ3G27", "Overall": "2.0", "Content": "I recently purchased the EX-Z80 and have since returned it because I was not happy with the image quality. The auto function produced pictures that were blurry and noisy. Quite a bit of pixelation/noise in all photos I took as test shots. The flash is very bright for shooting close subjects, takes a lot of color out of people shots. The different shooting modes were difficult to figure out and still produced blurry photos. The difficulty in actually figuring out the right setting to use was too bothersome. Not to mention, I never found a setting that I was happy with. If you're not that picky about blur and noise, then this might be the type of camera for you. However, for the camera buffs that just want a small camera to carry around for those spontaneous photo-ops, you should think again. I returned the camera and bought a Canon Powershot A590 IS that I am very happy with.", "Date": "June 23, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "8mp with 3x zoom\nAuto shutter\nYou Tube ready\nInstant video button\nFace detection", "Name": "Casio EX-Z80BE 8 MP, 3x Optical Zoom Digital Camera - Blue", "ImgURL": "http://ecx.images-amazon.com/images/I/51JHIgYLCQL._SY300_.jpg", "ProductID": "B0012BINTQ"}}