{"Reviews": [{"Title": "Great Point and Shoot", "Author": "T. Blais", "ReviewID": "R36WGMQ127WVG5", "Overall": "5.0", "Content": "I'm a photography major, and this is one of the best point and shoot cameras i have used. Macro feature does wonders to any photograph. Very wonderful camera. I use this camera as my main photography camera. Battery lasts for very long and is rechargeable!Amazing price for an amazing camera.", "Date": "March 25, 2009"}, {"Title": "you get what you pay for", "Author": "E. A. Walker", "ReviewID": "R95R061KG8VF7", "Overall": "4.0", "Content": "great zoom lense, pictures can be a bit blurry on some settings.  battery has lasted awhile and for a point and shoot it was a good price.", "Date": "November 9, 2013"}, {"Title": "Battery drainer", "Author": "KellyG", "ReviewID": "R18D8XVOSZCSCC", "Overall": "1.0", "Content": "It didn't recognize new batteries, said battery exhausted. Then the lens kept getting stuck and wouldn't go back in place.", "Date": "October 29, 2013"}, {"Title": "GE E1035 10mp digital camera", "Author": "Jill A. Hughes", "ReviewID": "R1Z0POG67EAHY", "Overall": "5.0", "Content": "I bought this camera for my 9 year old for Christmas......LOVE,LOVE,LOVE it... easy to use and the picture quality is excellent. I love the fact that you can charge the battery and you don't have to worry about always having aa batteries on hand. Very happy with this purchase and the price was great, too.", "Date": "January 30, 2010"}, {"Title": "Great Camera for the price", "Author": "M. Thompson", "ReviewID": "RHHL65CPGOWP7", "Overall": "5.0", "Content": "I was looking for a good camera with many of the newer features, that did not cost much over $100.  I got this for $99.99 and it has been well worth it.  Most other cameras with these features cost more.  I also like that is has it's own battery and I don't have to worry about added cost of AA batteries every few weeks.  One thing buyers should note is that the specs say it uses up to a 4G memorycard.  A 4G card holds more than enough pictures; I have a 2G card that's fine as well.  But since they're making 8G and higher ones now, make sure you stick with 4G and below.", "Date": "August 31, 2009"}, {"Title": "Bad!!!!!!!!!!!", "Author": "Laura Chaves Garcia", "ReviewID": "R2HJEEQO9BFB7H", "Overall": "2.0", "Content": "This camera in first instance work good but over 5 months show a lines red or green in the LCD and is impossible to take a photo.", "Date": "August 26, 2009"}, {"Title": "Great camera", "Author": "momof2boys \"Learning\"", "ReviewID": "R2I1V82PUV2QFX", "Overall": "5.0", "Content": "I'm very pleased with this camera. My last camera was a Kodak cx7300 that was a piece of JUNK but the GE camera was almost exactly what I wanted. The features are great and I've taken beautiful pictures with it. I was in 3 pitch black rooms and set the camera on automatic and snapped the camera each time it looked as if the room had natural light in it. It was perfectly lit. I also haven't had problems with my boys protecting their eyes from the flash because I'm able to use the kid setting and it takes the flash away. The one thing that I'm not so happy about with this camera is the zoom feature, it doesn't go in as much as I'd like but only the cameras that you spend a million dollars on do. I just needed a camera to take nice pictures for vacations, children and family. I'm not a professional and very much a novice but I can say the panoramic pics came out perfect. Okay I'm done now. I'd recommend it for the quality and the price. PS I got a 2gb sandisk it holds hundreds on pics and the video is great on the camera too.", "Date": "February 11, 2009"}, {"Title": "great camera, great price", "Author": "ferrarifixer \"ferrarifixer\"", "ReviewID": "R1FVAQXIFNSFX3", "Overall": "4.0", "Content": "Was surprised to find all the features of this camera...does video too, with such a low price.  I also purchased a 4mg storage card that will allow storage of thousands of pictures or up to an hour of video.  Compact and well made, easy to use.", "Date": "November 16, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "10MP Digital Camera\n3x Optical and 4.5x Digital Zoom\n2.7 Inch Vibrant LCD with Auto-Brightness Technology\nElectronic Image Stabilization\nFace-Tracking, Panorama, Stitching, Blink Detection, Face Detection, Smile Detection and Red-Eye Removal Built In", "Name": "GE-E1035 10MP Digital Camera with 3X Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41A7ZLcb6mL._SX300_.jpg", "ProductID": "B0015LTQWQ"}}