{"Reviews": [{"Title": "Very Disappointed", "Author": "M. Brewer \"AutumnSunset\"", "ReviewID": "RKGPY2SO24WF3", "Overall": "2.0", "Content": "I pre-ordered this camera based upon my previous experience with Fujifilm digital cameras.I have owned 2 Fujifilm digital cameras, and the color and sharpness of the pictures were awesome. I lost one of the cameras, and replaced it with no hesitation with another Fujifilm - Finepix A303 with 3.2 megapixels. I was not disappointed. I have excellent pictures from the A303 camera - have even framed 11x14's and made calendars from the pictures. Another plus on the A303 is that it uses AA batteries.So I eagerly awaited the arrival of the Finepix J50 - why should I need reviews when I had such great experience with my previous Finepix cameras?  I looked forward to the larger LCD screen, the extra zoom, the extra pixels and features - hopefully arriving just in time for the birth of my new grandchild. BIG MISTAKE! It arrived in time - but made grainy, off-color pictures. The zoom is nice, but what good is the zoom when it rarely makes good enough quality pictures to enlarge.I received this camera in April, and have been experimenting with it to find the \"secret\" to great pictures. NO LUCK so far! I am researching other digital cameras - and have been since May. Obviously, there is no hope for this Fujifilm. What a let down!Interestingly enough, the review before mine is the first review that I have found on the Fujifilm Finepix J50 - and I have been looking for months. I had wondered if mine was just a \"bad\" camera, but evidently not. There must be other disappointed customers out there. This previously very-satisfied Finepix digital camera customer, is now looking at Canon and Nikon digital cameras.", "Date": "September 7, 2008"}, {"Title": "Horrible Camera...", "Author": "F. Reyes", "ReviewID": "R1114FD950DIHG", "Overall": "1.0", "Content": "There were no reviews for this camera before I purchased it, but I was so in love with the features, that I decided to get it any way.  I had a Fuji camera before (6mp) but lost it last August while on vacation.  It was a great camera, so I thought I could not go wrong with this one.  Plus all the new features sounded great.Well from the first picture I took, I knew there would be a problem.  I took about 40 pictures trying to play with the settings and sizes, but all the pictures still look grainy and fuzzy. The quality is not what I expected and it left me wondering, where are the 8MPs?", "Date": "July 15, 2008"}, {"Title": "Do not buy the Finepix J50", "Author": "Paul", "ReviewID": "R3UMX20HDQ2PWP", "Overall": "1.0", "Content": "Bought as a replacement to an older, less megapixel Finepix.  The pictures are huge yet grainy every time.  The colors are dull.  Can't find setting changes to make it work.  Searched for other reviews and all concur.  Avoid this back step in The Fuji line.", "Date": "March 3, 2009"}, {"Title": "THE PERFECT CAMERA", "Author": "LKW \"arawandme\"", "ReviewID": "R1G9DPOE2XEYM", "Overall": "5.0", "Content": "My camera executes flawlessly.  It comes with a rechargeable battery and charger.  Fuji picture quality is unbelievable.  Definitely no complaints here, I absolutely love my camera.  It's super easy to operate.  The pictures are sharp and clear.  I have a new German Shepherd puppy and she moves very quickly.  For this camera, no problem, it auto focus and shoots fast.  I am glad I bought it before reading all of the negative comments, I would have missed out on a great camera.  Definitely worth the money.", "Date": "August 2, 2009"}, {"Title": "For beginners only", "Author": "Richard W. Fitch \"twiga_riq\"", "ReviewID": "R1J178XK7I6PUN", "Overall": "2.0", "Content": "My trusted Canon developed a failed board.  My choice was to repair a 4-yr old camera(and wait 8-10 weeks)or find a new one.  Not wanting to spend a great deal right now, but wanting shots of summer activities, I opted for the J50.  As others have stated, this is not the camera I expected from Fuji.  Produces good close shots, has a very good macro function and is a very compact unit.  However, pictures are grainy, lack accurate color, sparse manual over-rides and very limited flash range. I have returned it and will now 'surf' for a more robust model. This one might be acceptable for someone just starting with digital photography, but not one I would recommend to a more experienced user.", "Date": "May 20, 2009"}, {"Title": "An average point and shoot camera", "Author": "Mark H. Haider", "ReviewID": "R8GG5YUAAUOKM", "Overall": "3.0", "Content": "I just recently purchased this camera and I would rate this as an average point and shoot digital camera.  I've used this camera indoors and it is best suited for photographs taken at less than 10 feet, there is noticable image noise when taking photographs at longer distances, approximately 20 feet or more.  I believe that this is because in the automattic mode, that the flash does not have the power to go this distance, so the automattic ISO feature kicks in and as a result the photographs are darker and have more noise in them.  I haven't had a chance to use this camera outdoors in bright light, but hopefully the photographs will be of better quality.", "Date": "March 1, 2009"}, {"Title": "This camera sucks", "Author": "A. Bohadel", "ReviewID": "RV8WM958GGUEQ", "Overall": "1.0", "Content": "Don't waste your time and money on this camera!  I can't believe they are still selling this junk.", "Date": "May 2, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.2-megapixel CCD captures enough detail for photo-quality 16 x 22-inch prints\n5x optical zoom; 2.7-inch LCD screen\n15 pre-programmed scene modes; Movie mode\nPicture Stabilization Technology\nStores images on xD or SD/SDHC memory cards (not included)", "Name": "Fujifilm Finepix J50 8.2MP Digital Camera with 5x Optical Zoom (Brushed Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51Aam4S0PtL._SX300_.jpg", "ProductID": "B0011ZK6SE"}}