{"Reviews": [{"Title": "Excellent Camera - Great Value", "Author": "Gumper Van Lier \"Gumper Van Lier\"", "ReviewID": "R2Y6D3CAP1TL3I", "Overall": "5.0", "Content": "I recently purchased the Z1015 IS mostly for it's HD video and mega zoom features and I'm pleased with the results. The zoom feature is available while in the video mode which was what I was looking for. The sound is recorded in stereo and is good although it's compressed. Kodak using .MOV (QuickTime codec). The 720p widescreen video is quite impressive and you can film up to 29 minutes, if you have the memory. I find making videos with digital cameras convenient and easier than using a camcorder.The picture quality is excellent too and the smart capture mode works well. It is true that there is a delay in processing the photos as another reviewer mentioned but this is not a problem for me. There may be a firmware upgrade for this in the near future. You can avoid this by using the program mode according to another reviewer.The Z1015 IS may be a better value then the lower model Z1012 IS as the Z1015 IS comes with a rechargeable battery and charger. The Z1012 does not. Also the Z1015 has a 3 inch screen compared to 2.5 inch screen for the Z1012. Lastly, the zoom is 15x compared to 12x for the lesser model.I purchased the Easyshare camera dock which works well with this camera and is very convenient as it's always connected to my computer. It also works as a charger too.One minor complaint. The screen could be of higher resolution like I've seen on the Panasonic models but that's about it. For the price, this is an excellent camera.Update (Oct 12, 2008): Kodak has a 1.02 firmware update that addresses the slow processing speed when in Kodac's smart mode. I've updated my camera but don't see any significant difference.Update (Nov, 2008): Kodak has updated their firmware again with version 1.03. This takes care of the processing delays. A Big improvement.About the video: This camera does not film with stereo sound although the manual and online user guide shows two microphones. Zoom up on the photo here on Amazon and you will see two holes next to each side of the lense. These are the mic holes. Well, my 1015 comes with only one mic on the right side (if facing the lense). I called Kodak and they confirmed that this model records in mono. They have since updated their manual online but not the user guide. The Z1012 records in stereo but I think the Z1015 has higher quality sound (less compression)than the Z1012. I'm a little disappointed but this camera is excellent and most people should be very pleased with both the photo and video quality.", "Date": "October 4, 2008"}, {"Title": "Better Pictures Than Kodak Z1012IS and Fuji S2000HD", "Author": "NotaSecondTime", "ReviewID": "R2SMKIRTB0AA6O", "Overall": "5.0", "Content": "Consumer Reports camera ratings have recently improved as they now match my first hand experience. Several commercial sites are not telling the truth either as the Fuji f50fd received very high ratings but smeared close-up detail of pine trees. Terrible PQ. Now Consumer Reports finally gives the f50fd camera the low rating its always deserved. The same goes for the new Fuji S2000fd - still way too much noise, though I do like the feel of the body.Actually all these smaller cameras (with their tiny sensors) have visible noise which CR takes pains to list for every point-in-shoot!The Z1015IS has less than the older Z1012IS. The muted colors of the Z1012 are gone in the Z1015. The blues may be a bit too saturated (update: the camera was probably on High-color). Very naturally sharp with a bit of purple fringing with bright store lights off the central lens axis. No issues otherwise with color fringing. Nice pictures! Menu system is easy to figure out.A rechargable lithium battery is now included. Kodak Easy Share software is designed for first graders. At least the RAW images can be saved to 8bit TIF format for Noise Ninja cleanup to make the PQ from the best superzoom camera even better. (Well there is no batch processing so a simple task becomes difficult.)  The 28mm wide angle is most welcome.Lastly its nice to see an American company effectively compete with the competition. Good show Kodak.Update:Consumer Reports just rated the Z1012IS as the best non-DSLR camera, which is why took the time to test it.Because of the local 15% restocking fee (you know where) I took a Scandisk 4GB SDHC card into the store and shot there for the Z1015 and the Fuji 2000. Both cameras show a strong superficial resemblance.I bought the Z1012 and also compared it to the Nikon D300. I set them both to ISO 100 and ISO64 (Kodak). At ISO 64 the 1012 exhibited excellent fidelity with low noise. Nice.The $1800 D300 had improvements in fidelity and tonality in showing the fine texture and detail of surfaces. Images have more \"pop\" and life.Vista's columns and and IEXIF 2 viewer shows the:Fuji S2000HD noisy pictures shot at 1/60 sec, f/4.8 and ISO 125-400, quality set to FineKodak Z1012IS - f/2.8-f/4.8 ISO 64-400. 1/30-1/100 secISO64 shot on tripod for optimal clarityKodak Z1015IS - lost capture info with RAW conversion to TIF. Uninstalled Easy Share hoping for some better RAW software!Will buy Z1015 when it goes on-sale at Amazon.Update2: Received the Z1015 and have analyzed three days of pictures. Recommendations:Casual users should make exclusive use of the Smart Capture mode as it will properly expose pictures. Pictures are almost always in focus too. Its that simple if you want it to be! This is why my wife says the Creative Memories ladies like the Kodak Easy share. Add in the advanced controls and its a camera for everyone.For advanced users the good-lighting strategy is to take Aperture controlled RAW then quickly switch the top Mode dial over to the red color/Smart Capture/Perfect Touch setting. Between the two pictures you will get the best picture 99% of the time. In RAW mode set the sharpness to low and use noise reduction and unsharp mask on the TIF images with computer based processing, as the normal sharpness is a bit grainy. The improvement is worth the effort. Indoors use the Smart Capture mode as the Kodak technology does pick the best compromise. I use IrfanView software with 420 plugin for RAW batch .KDC to .TIF conversion.Lastly Noise Ninja allows for quantitative noise analysis and direct comparison between different camera sensors. (But watch out for unadvertised manufacture noise reduction which decreases detail). Bigger sensors are better as the Kodak Z1015IS at ISO 80 has as much noise as the Nikon D300 at ISO640!The situation is complicated by the the TI/Kodak image processing chip skewing of the Z1015 noise readings. The ISO 100 and 200 noise measures lower than ISO 80. You see evidence of this unadvertised image processing at work in the low-gain and high-gain being set in the EXIF data.Telephoto (420mm) image quality degrades a bit. Best to use a tripod and low ISO settings here.Background: The KODAK Color Science image processing chip was first introduced in cameras in 2006. This Perfect Touch technology results in fewer dark shadows and increased detail. (Since then many other post processing programs mimic Kodak's leadership. Most of the major name camera manufactures quietly pay Kodak royalties.)Significantly this technology was not available with the P880, Kodak's last enthusiast camera. This camera was twice the Z1015 price too. So we have a bargain priced, intuitive and fun to use camera.", "Date": "September 22, 2008"}, {"Title": "Wonderful Images", "Author": "T. Fonte", "ReviewID": "R2GLP12ZIAD5UN", "Overall": "5.0", "Content": "The camera can produce top notch images in RAW, with exquisite detail. Jpeg images are fine also, although RAW is superior because of uncompressed files. Either way the images are full-colored (no-one does color like Kodak), clear, dynamic and detailed. I haven't tried the video functions.The RAW capability is the great strength of the camera and also a source of some weakness. DO NOT USE THE AUTO MODE (or SCENE MODE)if you intend to take several shots in rapid succession. In these modes the camera takes an inordinate amount of time to process the shots. The camera takes time to apply Kodak's Perfect Touch editing to the shots. It is not defeatable in Auto and Scene modes. I use the P mode. Perfect Touch is not applied here. In P mode the camera takes a bit longer with RAW than it does with jpeg in writing to the card.Another drawback to RAW is that few programs read the Kodak RAW files from the Z1015IS. Kodak's own Easyshare software that comes with the camera does. Personally I don't like the software--too basic and clumsy for my taste. Irfanview, a free editing program, does read and edit Kodak Z1015IS RAW files and allows you to save in lossless TIF or BMP, along with jpeg and other types. My hope is that Adobe and others will soon add this camera to their list of readable RAW files.I already had a 12 times optical zoom camera (the Z1012, a fine camera itself), so the 15 times zoom was not a big attraction for me--the RAW was and it has proved to be a real winner in image quality. Anyway, the 15 times zoom works as intended. There is occasionally a bit of purple fringing, but it is not noticeable on normal-sized prints (up to 8.5x11). Macro focusing distance is moderate.Ease of use is excellent. The buttons are well located and handy to manipulate. You can change exposure, flash compensation and other functions quickly and easily. The grip is very convenient. It has a viewfinder and the LCD is large and of very good quality. With moderate flash and LCD use I got about 300 shots off the provided rechargeable battery. The battery recharges in the camera via the provided external power connection--reasonably quick and handy.In summary, the camera does what I want and does it beautifully--produce first-rate photos. I have posted a large number of large-sized photos at [...] Feel free to visit there to see what the camera is capable of. It is easy to use, reasonably-priced and produces first-rate photos. I heartily recommend it.P.S. November 2, 2008.  Automatic application of Kodak's Perfect Touch editing to every picture in the Auto mode is what slows down the write time for the camera in Auto mode (it doesn't happen in the other modes). Kodak has issued a firmware update (1.03) for the camera that now lets the user disable this feature. With the Perfect Touch disabled the camera is very fast in writing in Auto mode.  I imagine that new cameras will come with this firmware installed.  If not, just visit Kodak's web site to download it for free.Adobe has updated their RAW plugin to include the Kodak Z1015 IS in the cameras covered.", "Date": "October 4, 2008"}, {"Title": "Downgrade from previous Kodak Z series cameras", "Author": "M. Schaefer", "ReviewID": "R39ITXAP8F39L9", "Overall": "5.0", "Content": "Update: Kodak fixed the perfect touch speed issue in their 1.03 firmware update, so I've adjusted the star level from 1 to 5. It's rare that a company listens to their customers, and I was impressed to hear of their firmware patch.This camera seems to be end all, nicest Z series camera produced, and Kodak is flaunting very fast capture speeds. They do however leave out a detail that will surely convince you, as it has me, to return your Z1015: For every 4 to 5 pictures you take in smart-scene, there is a 20-50 second pause for the Kodak Perfect Touch post-processing...let me repeat that, you take 4-5 pictures and then the camera locks up completely for a half minute (using RAW files), up to almost a full minute if you're using jpg compression. Call Kodak about it and they'll tell you that this long delay is \"normal,\" that a firmware upgrade is coming, and that you should \"return your camera for repair.\" This camera is a disaster and Kodak needs to pump out a major Firmware upgrade eliminating the post-processing. I was a fan of the Z series, having owned a Z612, and Z712, and recommended the Z812 to my mother as an easy to use, point-and-shoot camera. They are all excellent, fast cameras. The Z1015 is a major, substantial downgrade. It's no longer fast, in fact it is downright SLOW, thus making it a loser in the point and shoot field.When using the PASM manual settings, you can skip the post-processing freeze. Only Automatic and all scene setting modes (everything that makes the camera point-and-shoot), are affected by the processing lock-up.", "Date": "October 4, 2008"}, {"Title": "A super superzoom camera", "Author": "Beefeater", "ReviewID": "R3OBK9KR2TBFUZ", "Overall": "5.0", "Content": "I have used the Z1015 for about 5-6 weeks now, and I think it's a wonderful camera.  Strengths include: * Most important, it takes wonderfully sharp, well-exposed pictures.  I have been amazed at how consistently good the photos are. * Wide zoom range is a big advantage.  This is my first superzoom, and I did not appreciate how much extra flexibility it gives you when composing a shot.  The Z1015 zooms in and out pretty fast, but I find I can tap lightly on the +/- control to get what I want. * Image stabilizer works surprisingly well, even at extreme telephoto (although it cannot work miracles) * Layout of controls is more convenient and intuitive than on any digital camera I have used.  Playback, delete, flash, focus options, and self-timer can all be set quickly with one button.  A lot of in-camera help is also available if you need it, which I find handy to remind me what the many Scene modes do. * Electronic viewfinder shows just what the camera sees.  It can be used in any light, gives info about the settings as well as the image, and saves power.  I now use it most of the time, saving the LCD just for playback. * Comes with a rechargeable lithium battery and charger.  I find the battery lasts about 125-150 shots, so I carry a spare battery.  It charges quickly in about 2-3 hours. * Shooting modes all work well.  My favorite is P, which gives good control over flash, exposure adjustment, and focus modes if I want them, letting the camera set the rest. * Ssurprisingly light in weight despite the large, superzoom lens, due to the plastic (not metal) body * Very quietComments about weaknesses (and rebuttals to those mentioned in other reviews) include: * Very few weaknesses.  Many of those mentioned in other reviews suggest that the writer did not do much research before their purchase or did not take the time to read the instructions.  The Z1015 can be used as a simple point-and-shoot, but it is not really an entry-level camera.  It has a lot of features.  Investing a couple of hours in learning about them really expands what you can do with it. * Processing speed is not a problem with current firmware. * LCD screen is indeed a bit grainy, but adequate.  I find that pictures look much sharper when viewed on a computer or digital TV later than they do on the camera's LCD. * Lens cap does pop off easily, but I think it was designed that way so that if you turn on the camera without first removing the lens cap, the extending lens pops the cap off harmlessly without damaging the internal zoom lens motor. * Warning: the Kodak 1348762 camera case that Amazon says many customers buy along with the Z1015 is actually NOT big enough for this camera.  After returning it, I bought a Tamrac 5693 case, which is well-made, compact, inexpensive, and accommodates the camera and an extra battery perfectly.In sum, I have found the Z1015 to be a remarkably versatile camera that makes me look good as a photographer--well worth the mid-range price.  I would buy it again in a heartbeat and recommend it to anyone interested in a high-quality superzoom digital camera.", "Date": "July 19, 2009"}, {"Title": "Do not buy this camera if you are taking photos of the kids!", "Author": "Stephen J. Nedder Jr. \"Uncommon valor was a c...", "ReviewID": "R26TMHERX65VS1", "Overall": "1.0", "Content": "We have owned several Kodak Easyshare cameras and this one was by far the most disappointing. There are a few good points: the zoom is great and the camera takes good quality pictures with plenty of settings for both the novice and the professional.  It also comes with a rechargeable battery.  That's were it ends.  The camera has a processing feature that slows this thing up big time.  After every picture, the camera processes the photo.  After taking 4 pictures, the camera locks up in \"Processing\" mode to finish processing the photos onto the memory card.  This gets very frustrating when you are trying to capture the perfect picture of the kids in various activities (like their first trip to Disney!).  Also, on the action setting, the camera needs to charge after every picture, resulting in a 30 second delay.  I would not recommend this camera to anyone - I'm returning it and looking for something that doesn't lock up.", "Date": "October 18, 2008"}, {"Title": "Excellent camera", "Author": "Denise Grandits", "ReviewID": "R17KCDUEH01N0K", "Overall": "5.0", "Content": "I have been the proud owner of a Kodak Z710 for 2 years.  It is a great camera especially for outdoors shots.  I was able to stand on the sideline of my son's high school football games, snap random shots (not really focusing on anything in particular) and then zoom/crop the shots for some spectacular images.  I've uploaded some of those under the Z710 review.But, I was ready to upgrade since the trusty old Z710 wasn't great indoors at the basketball courts.  I could never figure out the PASM settings so that I captured the fast action in dreadful gym lighting.  I actually broke down and ordered a digital SLR from another retailer and gave it a try for a good month.  I was surprised that the results weren't that much better than the Z710 so I have returned it.Today, I headed off to try the Z1015 and I was very happy.  The firmware upgrade on Kodak eliminates the wait time between shoots and if you turn off the automatic preview after each shot, you cut down on more time.  I have just a 2MP memory card in it and I think that is slowing it down a bit, too.However, tonight I played around with the camera.  While sitting on my couch, I used the 15X optical zoom to zoom in on ornaments on the Christmas tree.  Then, I cropped them further.  Was I shocked!  I only have the Christmas tree lights on and the images are stunning.  You can see the detail as if I were standing right next to the tree (the couch is about 12 feet away from the tree).For the regular photographer, this is a great camera.  If you are considered a digital SLR, you might want to give this camera a try first.  I would never have bought it but my older version Kodak just couldn't achieve good pictures in poor lighting conditions.  This camera's higher ISO capability just might solve my dilemma.  We'll find out...between 3 sons, we have 6 games in the next week.  I'll post an update after I test my new Z1015 at the courts!", "Date": "December 31, 2008"}, {"Title": "Best Semi Prof. Camera for this Price ( HD)", "Author": "Hesham Talat Hegazy \"Hesho The Man\"", "ReviewID": "R2F88SJSQ9X7RI", "Overall": "5.0", "Content": "I bought this Camera a Week ago from a local dealer ,The Latest software was already installed ( Vr 1.3 ) and the smart capture option eliminates completely the delay problem every one is talking about .I had a Sony T20 8.1 MP but unfortunately I lost it during my last vacation , I can admit that the Z1015 takes better photos in all light conditions , The Zoom option is awesome and using a tripod in Digital Zoom range creates stunning  photos , Actually I took an impossible photo just to test the auto focus at max digital zoom range and the results ware awesome . also the HD vedio is stunning on a 32 in. TV .The Smart Capture mode is still there if you need the best possible photo you can get since the camera runs all tests on each photo But the result is more than great .I compared the photos taken with the Z1015 with other SLR cameras ( Nikon & Canon )  and they ware almost  same quality and the deference did not justify the price diff. which is more than $400.Actually I recommend this camera for any one seeks a semi professional camera with high auto capabilities and also Manual features for personal creativity .", "Date": "May 2, 2009"}, {"Title": "Very disappointed; 3 stars is just right", "Author": "Pro Consumer", "ReviewID": "R1EX2ZYEZJGQYJ", "Overall": "3.0", "Content": "full disclosure:  I am not a pro, but I know what a good picture looks like.Based on CR's strong rating on the Z1012, I bought the Z1015 thinking \"It has to be an upgrade, right?\"  Either CR doesn't know beans or it is definately a step down from the Z1012.  The only redeeming feature is the in-camera image stitch feature, allowing for panoramic shots with no external processing necessary.Pros:Long ZoomHigh resolutionAcceptable outdoor photo quality in sunlightincludes rechargable batteryCons:image stabilization?  what image stabilization?firmware needs updating out of the boxunusable low-light shots due to excess noiseEXTREMELY SLOW autofocusFor the most part this camera let me down in every way that I had hoped it would excel.  I had to return it and got the Fuji Finepix S2000 instead; it is superior to the Z1015 in that it takes superior low-light shots (in every way), needs no updated firmware to make it work well, has much faster autofocus, and superior results using \"scene\" modes.I am not someone who wants to spend 5 minutes framing each shot and taking 10 garbage pictures to find the exact settings necessary to make a picture look good.  It's 2008; I want the camera to be smart enough to make colors look natural with regard to the world around us.  Is that too much to ask?  Apparently for the Kodak Z1015, it is.", "Date": "December 17, 2008"}, {"Title": "Best Camera I've had", "Author": "R. Jones", "ReviewID": "R2O4SMQGOAAREC", "Overall": "5.0", "Content": "Absolutely love this camera! At first I was a little unsure if I wanted this Kodak or the Kodak Z1012IS. I went in to a local retailer and played around with the Z1012. After that I was sold on the Z1015. For just a few dollars more I was you get a larger LCD screen which is really nice, and a few other features. I had read reviews prior to my purchase of the Z1015 that talked about the processing time after taking the pictures. I noticed it with the Z1012 when I was in the store, and felt that I could deal with the issue. However when I got my Z1015 from Amazon and started to use it, it was really annoying. Although many reviews said that the free update that Kodak offers for the camera didn't do much I decided it was worth the try. It was more than worth it. No more processing time issues. I was able to shot over 20 pics back to back with no problem. The update also revised a portion of the smart capture mode. All and all this is an amazing camera that takes wonderful pictures honestly. I would highly recommended. It's light weight and easy to use, and I didn't even mention the zoom. If you are considering buying a Z1012, don't get this one. The extra money is worth it!", "Date": "January 9, 2009"}, {"Title": "Date battery NOT replaceable", "Author": "Rick", "ReviewID": "RT1F7HP34WAIL", "Overall": "1.0", "Content": "I purchased 2 of these cameras 2 years ago, one for my wife and one from my son. I have loved the cameras up to this point BUT.........and here is the big BUT........about 2 or 3 weeks ago (and within 1 week of each other) for BOTH cameras the date started resetting EVERY time the main battery was removed. After a few call with KODAK it was determined that the backup battery was dead in BOTH cameras.....and here is the BAD part.....they are internal in the camera and must be replace by a servicing technician at $80 per camera!!!%%%%###%%%!!!Needless to say I am NOT happy about this. All KODAK can do is appologize and say ...there is nothing we can do about it. I have been a long time KODAK customer BUT that ends with these 2 cameras. VERY DISAPPOINTED in thier customer service. TOO bad.....KODAK used to be a good company. They lost my business with this ordeal.", "Date": "July 6, 2011"}, {"Title": "Nothing to write home about", "Author": "Scott Peterson \"I.T. Sme\"", "ReviewID": "R3BI2MUY499KVA", "Overall": "3.0", "Content": "I bought this camera as it was about the only one I could find that fit my criteria of:10X or greater zoomAble to take moviesLithium Ion BatteriesHD movies was a plus.  The Z1015 doesn't feel good in your hand, it seems more like a toy than a real camera, and you seriously feel you could break it without trying.  It held up fine during the time I had it, but then again I only had mine for a few months.The issues I had with the Z1015 were several, as follows:Very poor low light quality, in movies and pictures.  I couldn't quiet tell what was happening in the movies but it looked like the noise was bring smudged into fine vertical stripes.Flash pictures looked like something from the days of 110 film.Quicktime compressor on the movies, which not all video editors work with.  I know on my Vista 32 bit machine the movies froze and would only play with VLC.Quirky push button zoom that's always either too far or too close.At the far end of the zoom it tended to lose focus.The image stabilization at the far end of the zoom would also get \"twittery\" and be worse than leaving it off.Leaving autofocus on when taking a movie would result in endless chatter being picked up by the mike as it locked and relocked.  It was better to manually set the focus and then take a movie.As with most of these low end cameras in normal-bright light they do just fine, and it was capable of turning in good quality movies within it's limits.  However, I'd buy a Canon S3 or S5 over this, and if you really care about quality then get a DSLR and one of the newer flash based \"real\" camcorders.  It may be more difficult to carry two items around but it's worth it.", "Date": "January 24, 2009"}, {"Title": "Loaded Camera--Almost Perfect", "Author": "Steve \"Packer Backer\"", "ReviewID": "R1W3WQSE4TX9CM", "Overall": "4.0", "Content": "This camera was almost a perfect 5 for me except for one annoying feature that will bother me as long as I own it...I will get to that later.Pros:-Good, intutive, and easy to use and maneuver button features...none appear prone to breakage due high usage.-A viewfinder plus a 3\" LCD screen you can toggle-The Smart Capture automatic picture correction and facefinder...a big help to moderate to novice users-Zoomable HD video on the same camera with 10MP still shots..find another in this price range...good luck-Many flexible picture options for a novice to grow into a budding photo enthusiast...Pros will spend more for pro features, but many of these emulate those features in a less flexible but less knowledge-requiring format-Actually rather light and ergonomically comfortable in the handCons:-Requires vendor specific batteries...an unncessary \"GOTCHA\" in this day and age of a burgeoning rechargable battery market-The \"top looking down\" viewing angle on the LCD looses clarity fast...right, left, and \"bottom looking upward\" is just fine to me-And My Greatest Pet Peeve...The Lens Cap!...it attaches to the camera lens housing and not the camera lens, so it cannot be on the lens when the camera is ON because the lens portrudes from the housing in the ON mode.  Clearly unsafe to me for the lens when walking around in the ON mode and absolutely annoying to have to remember to take off the lens cap before turning on every time.  I know, small, but greatly annoying the way I take pictures.Suggestion:-The manual that comes in the box is basic.  Goto KODAK and download their extended version.  You will learn more about your camera and what it can do.A Great camera that just misses perfection for me!", "Date": "January 24, 2009"}, {"Title": "Good camera...", "Author": "Roberto Vicente \"bodhiu\"", "ReviewID": "R9KLDT4X22ZUE", "Overall": "4.0", "Content": "Just got my Z1015.  Rather than wait for any problems, the first thing I did was download the firmware update from Kodak. [...]  You unzip the file then put the update back on the SD card and the camera automatically reacts to the update.  All done in 1 minute.  The camera hasn't given me any problems.I like its light feel and it fits comfortably in the hand.  It is a very quiet and smooth running camera.  Focusing isn't all that fast, but the image quality is good and the HD video is decent but the zoom will blur out on occasion on distant shots.  If anything it looks like a soft focus edit, though unintentional!  The many features are helpful but I shoot mostly in manual.  The exposure rate in on the high side so I tone it down -3.  There is some barreling or fringe lens shadowing on the edge of pictures.  The infinity depth of field is nice and sharp, but the lower end doesn't blur out the background as much as I would like.  The battery life is excellent and the recharging is simple by just plugging the camera via AC cord into the wall socket.  Will take over 200 pictures on one charge up!  The 3 inch LCD is nice and big, easy to use.  It seems that that the image stablization works (I do have IS on) because I have a very shaky hand and it would have shown in the pictures.  My past not using Kodak had to so with their poor IS only working in the long zoom format.No, the camera isn't made as solidly as a Canon or Nikon but you are only paying about one quarter the price!The camera is very simple and user friendly.  It does the job and if you know your photography you can get more out of it.  It is a good camera but not excellent.", "Date": "April 24, 2009"}, {"Title": "very dissapointed", "Author": "Mar \"Marinera\"", "ReviewID": "R3IA22KNL3K0HB", "Overall": "3.0", "Content": "I got this camera thinking it was going to be great. but i was very dissapointed on it.1 st the pictures almost of the time come out blurry. it can do beautiful sharp macros but with kids not so great. because its very slow . i dont like the feel of it. it feels really cheap and very big 2 .its ok indoor some times. but to be honest i like the kodak z8612. because its faster and it does nicer pictures -if you believe me or not-. also much cheaper.so if you have patients with this camera it could do very nice pictures but you have play with lots of setting to do it.", "Date": "April 13, 2009"}, {"Title": "Couldn't be happier!", "Author": "Blanche Marie", "ReviewID": "R3LW8AQCRA92JR", "Overall": "5.0", "Content": "Just got this camera a few days ago and have been having fun taking shots at the beach and lots of close up shots. I can zoom in from my 9th story balcony onto the longboarder surfing a long way out and it looks like I am right next to him. I zoomed on a person reading on the beach and I could almost read the title of his book! This camera is wonderful. The pictures are sharp and I can adjust it manually to do lots of fun shots.The battery does wear down quickly but I always keep 2 charged and a lithium as a back up just in case. Saves frustation.Would recomend this camera to anyone!", "Date": "February 10, 2009"}, {"Title": "slow capture speed", "Author": "S. Johnson \"reader mom\"", "ReviewID": "RIJELLWNTW3JJ", "Overall": "2.0", "Content": "Bought this camera because it seemed to combine the best features of point and shoot with some SLR capabilities.  What I got was too slow, both between shots and at taking pictures.  I seems to think too much even after turning off the extra functions and using different modes.  While the camera software and computer software are mostly self-explanitory and easy to use I would not recommend this camera if you desire shots with any kind of speed. I feel misled about the speed of this camera and would have upgraded to true SLR if I had realized.", "Date": "January 21, 2009"}, {"Title": "A nice camera", "Author": "Abe Vigoda \"part-time inventor\"", "ReviewID": "R1LHKPJS0ELYSX", "Overall": "4.0", "Content": "I like Kodak products.  I like bringing it along on my travels around the globe and being the only one without a Japanese camera, especially to Japan where they stare at it but would never have the nerve to carry one around their neck.Fast review tonight...Pros:1- Great color in the photos2- Excellent 15x zoom brings anything in close.3- Easy menu4- Good button placementCons:1- Smart Capture feature can lock-up and freeze the camera for a few MINUTES !2- The firmware from Kodak's site failed to load onto my camera3- Camera lens-cap comes off way too-easily I was going to return it but the zoom is so good that I cannot go to exotic locations without it now.  Will just have to bring along a sub-compact for that spur-of-the-moment shot.", "Date": "January 14, 2009"}, {"Title": "Very good but could be better", "Author": "Octavio Barreto", "ReviewID": "R3CZAXBWDU1TTN", "Overall": "4.0", "Content": "I have a DX6490 and the z1015IS is an excellent upgrade. The camera firmware is 1.03 version, very fast autofocus and amazing automatic mode (smart scene). You cannot use another lenses or filters yet, because it don't have any thread. The jog dial was moved to the left side of the camera and I believe that the original position in front of the shooter is the best position. You have only two aperture options that depend of the zoom used, always one of them is the half of the other.The panorama mode is a very strong utility. The manual focus isn't the best but is very good. The camera's ccd is very sensitive and you can take photos in iso 80 with poor light. I prefer manual mode but the automatic modes are very strong. The histogram is very useful and the 2 seconds delay shoot is perfect when you must take a photo with big aperture, without flash and slow velocity. It's a very recomendable product. You must buy a high capacity memory (4GB or more).", "Date": "December 17, 2008"}, {"Title": "Great For The Money", "Author": "T. Goddard", "ReviewID": "R2YK7SCYVEAY46", "Overall": "5.0", "Content": "I bought the camera at a warehouse store on line and followed previous purchasers advice of updating the firmware before even using the camera. I haven't tried the burst mode. I'm still playing with the Scene Mode settings and find the full automatic setting to be perfectly fine in most cases. In the Scene Mode under Museum without flash or sound it works great indoors for the Christmas Light Photos. And yes, the video is mono. But, I think it sounds fine for regular fidelity videos.  Overall I'm really happy with the camera. I can hold onto it without much trouble and keep it safe and stable without fear of it slipping out of my hands due to its size. I had an old DC-280 1.2 mega pixel camera and this new camera continues to impress me with all of the configurable auto-settings and the manual settings.  Definitely an enthusiasts camera. The Kodak software takes getting used to and it's not the best. But, what a camera for the money.", "Date": "December 17, 2008"}, {"Title": "Happy once firmware was updated", "Author": "Cole", "ReviewID": "RQTPNAI8FAO9D", "Overall": "4.0", "Content": "My camera came with 1.00 firmware and it didn't work well at all.  It was slow to operate, IS didn't work well, and it's auto mode selection was very bad.  But I upgraded to 1.03 and it seems like all these problems have gone away.I am not a digital camera geek so I don't have anything to say about image quality.Here are a few minor issues:Video is captured in Quicktime.  Most PC users will not have a Quicktime editor.Screen/view finder is turned off until image is processed or button is pressed.  So if you take a pic and you have to press a button (trigger, zoom, etc) to turn the screen back on.  So it does have very good back to back pic taking speed but is not really friendly about it.The manual mode controls do not allow one handed use.  The adjust wheel is on the left hand side.  Also it doesn't feel all that intuitive.I am very happy with the camera and would recommend it provided the user doesn't plan of using manual often.Great - lots of feature for the price.Update: Jan 2013.  Still working great after several tens of thousands of pictures.  I have abused this camera and everything still works as new.  Too bad Kodak is no more.", "Date": "December 4, 2008"}, {"Title": "Biggest bang for the buck !", "Author": "Anthony B. Lenti", "ReviewID": "R2F6GQ53JV5KVC", "Overall": "4.0", "Content": "Having used this camera and its accompaning software for the past 3 weeks, I have to say that this was one of my best buying decisions in photographic items. The Schneider lens is sharp as a tack, the color rendition is accurate,the start up time is incredibly fast,and so many more positive facets that space does not permit! I am amazed at the ease of Panoramic shots in that the stitching takes place IN the camera , not in Photoshop later. All in all I am super satisfied with this highly advanced camera. About the only little minuses I find are the lack of a hot shoe for additional flash, and the absence of threads on the lens for attaching filters.", "Date": "March 15, 2009"}, {"Title": "great camera", "Author": "edward tucker", "ReviewID": "R1T7348X995EZL", "Overall": "5.0", "Content": "so far we are well pleased with kodac z1015 grandson has already wonschool contest. it does everything i have wanted to do. battery liveseems good.  kodac could improve the lens cover and the rubber coversfor the plugs", "Date": "March 12, 2009"}, {"Title": "versitile and easy to use - great camera!", "Author": "Carl L. Danner", "ReviewID": "RNVERDUZR4LLU", "Overall": "5.0", "Content": "As you rotate the mode dial the camera displays the current mode setting in big text on the LCD or viewfinder for a couple seconds. Now I always know what mode I'm in even if its dark or I don't have my glasses on.It takes HIGH DEFINITION (700x1080)video with stereo sound. You can zoom in or out while filming.  I used he 640x400 mode to digitize all 250 of my 8mm film home movies. You can put the camera in manual focus mode so it stays focused even when the 8mm film goes dark or gets fuzzy.The \"Stitching mode\" allows you to combine three pictures into one super wide-angle pic.  You take the first pic. then move the camera to the next area. A small piece of the first picture is transparently displayed so you can overlap the two pictures to line them up correctly.  You can take a picture of somebody then have them move into the area of the next picture.  The stitched pictures make it look like they are in two places at the same time---Lots of fun.The comparability list says the camera does not work with Windows 2000 And they are correct.  The software does not work but you can use a 1gb SD card in the camera and then put the card in your computer and save the pics.  Win 2000 does not see SD cards larger than 1gb but who cares?  A 1gb card lets you take 266 high def jpeg pics. I taped a small pill bottle to my camera strap so I have a spare 1gb card and battery handy at all times.  Works great. I never miss a shot.  Regarding the software, I have another digital camera and I did not bother to load the software for it either.  Photoshop works so much better to edit pics.  And who needs all this EasyShare crap anyway?  If you don't know how to attach a pic to an email so you can share it then you probably won't figure out how to use EasyShare anyway.This is the most fun camera I have ever owned --- Love It", "Date": "January 16, 2009"}, {"Title": "Good stuff", "Author": "J. R. Craner", "ReviewID": "RL4XRMBKAANAJ", "Overall": "5.0", "Content": "So far so good, i really like this camera. researched it long and hard before buying and it does seem to be best buy for the money.", "Date": "January 6, 2009"}, {"Title": "Excellent buy for the average person", "Author": "P. Havlicek", "ReviewID": "R205SWF9V8Y433", "Overall": "5.0", "Content": "Excellent digital camera for the average person. Takes outstanding pictures.  My son loves the camera and that is something coming from a 17 year old.  I read all I could about inexpensive digital cameras and realized the best buy was the Kodak Z1015IS.  Most of the problems listed for this camera are operator headspace and timing.  I would recommend this camera to anyone.", "Date": "December 23, 2008"}, {"Title": "Kodak Keeps it Cheap", "Author": "Zachary Wagner", "ReviewID": "R2S0IUJ69E1IC9", "Overall": "4.0", "Content": "Well I've been using the Kodak Easyshare Z1015 IS (ridiculous name, yes) camera for a few days now, so I thought I'd put in my two... or five... cents.  First thing is, when you take it out of the box, if it feels a little cheap, well don't be surprised.  But is it cheap?  Well, yes and no.  I'll reiterate this a couple more times in this review, but the price is really good for this camera.  But what everyone really wants to know is--how does it perform?  The answer to that is a mixed bag.First, the push-to-capture speed is pretty fabulous for a digital camera.  Meaning that you've got less of a chance to miss that perfect shot.  But what if a MORE perfect shot comes along oh... in the next 2-3 seconds or so?  Well too bad.  Because the processing/saving to memory time of this camera isn't great.  Yes, I've got the latest firmware update (which it came with, but I checked anyway), and I have a class 4 SDHC card, so it's no slouch.  However, the speed did prompt me to order a class 6 card in hopes that will help my cause of taking more than two pictures in ten seconds.  Of course, there's always the burst feature... which isn't all that quick, either.So there's some bad for ya, how about some good?  Well, this camera, generally, takes great photos.  With the thing in one of the manual-oriented modes, jpg on fine and sharpness enabled, wow, very nice pics from a camera with this price tag.  What else?  Well Kodak just upped the ante with their Z980 with the 24x zoom (for $100 more), but the 15x zoom this baby sports is still really, really nice.  What about the focus when you get in that close?  Again, and unfortunately, the answer is it's a mixed bag.Yes, the manual mode is great for a point and shoot, and it does allow you to manually focus... sort of.  Meaning that if you can get it to basically focus in on your subject, then you can refine the focus and make the pic come out better.  But the manual focus is very, very basic.  Those expecting to use this as some sort of replacement for a more expensive DSLR camera... think again.  But then again, you're never going to get the manual focus capabilities from a point and shoot that you get from a DSLR.  Period.  So in a way, you can't fault Kodak for giving it their all.The wide angle is nice, but I wish it were wider (the Z980 takes it to 26mm, this one clocks in at 28mm)The battery life is respectable, especially for the zoom you get, but I wish they would have included a separate charger so you didn't have to charge the battery IN the camera (I already ordered one).Another thing?  For this price you get an HD camcorder (it can zoom while filming).  Yes, the quality isn't the best, but it's still in high resolution, and better than any other digital camera movie mode I've ever used... and it's still CHEAP.  Forget buying that HD camcorder (I'm selling mine now), and just use this.The bottom line:For the beginner to intermediate photographer, this thing is going to take care of almost, if not all, of your needs.  Beyond intermediate, you have to start considering the compromises you're going to be making for the price (but this is something anyone who has ANY photography skills should realize).  This thing is CHEAP.  Meaning that you could buy this just for the interim until you can afford a DSLR, and in the end really not lose much money, AND have a great point and shoot camera to use for more basic, everyday things.  All in all, highly recommended.Oh, except for FedEx.  They've delivered TWO packages to me in a year and a half, and I've had issues both times.  UPS?  They've delivered every other package (and we're talking quite a few).  How many problems?  Zero.", "Date": "August 20, 2009"}, {"Title": "Mixed emotions, but ended up returning Z1015", "Author": "Jason Rupert", "ReviewID": "R1B14DPQ9MXDH9", "Overall": "2.0", "Content": "(based on 30 days of ownership) Love the Kodak chat customer support and really liked this camera, but that could not compensate for several oversights on this camera.Good:(1) Took good pictures and nice quality video.(2) Liked the form factor, but felt cheaply made in the hand - not solidBad:(1) Shoddy construction - as mentioned by many others, when sitting down flash pops up and lens cap flies off.(2) No threads to on lens to add UV filter to protect this really nice glass.(3) Digital noise when shooting videos in quiet environment.  This was present in our old Kodak and hoped they would have fixed it in the newer version.Overall ended up returning over a combination of (1) and (2) above in the bad - since the lens cap just randomly pops off and there is no way to add a protective filter our lifestyle would definitely lead to a damaged lens.Pretty sad since we loved our old 3 MP camera.  Just purchased the Panasonic Lumix DMC-FZ28K, so hopefully that one will work out.", "Date": "May 18, 2009"}, {"Title": "TOOO slow if you are trying to capture children", "Author": "J. Graddy", "ReviewID": "RPR24V0JEHEQE", "Overall": "2.0", "Content": "I just bought this camera and am frustrated by the slow processing. I can't believe how slow it is. My camera came with the firmware upgrade installed and I can't believe this is the \"repair/upgrade\" . I tried taking photos of my kids and I can't get the camera to let me take a photo before my children are out of the frame, etc. It takes almost 10 seconds to snap a second photo and probably a few seconds for the first, but either way, what I intended to capture is not. I end up with a lot of photos of their backs or not smiling, etc.I'd keep the camera if I already knew how to use the PASM manual more (only if it really made a difference in processing speed), but then again, it's supposed to be a \"Point-and-Shoot\", too. Not a \"point-try to shoot-wait for the camera to allow you to-oops that's nothing like I wanted\" camera. This is the worst Z series camera I have had. It's my 3rd Z (had a 4 MP when they were new and then the 8MP..both I LOVED) and the z1015 is my least favorite. My least favorite camera ever. I'm sad that I now have to look into a new brand of cameras rather than just upgrading to another kodak Z camera. I'll be sticking with my Z8 series (8 MP) until I find an actual UPGRADE as a replacement. Not a downgrade. Now back to researching cameras....", "Date": "February 6, 2009"}, {"Title": "Poor LCD, problems with auto-focus, returned disappointed", "Author": "Brian Curran \"hibricc\"", "ReviewID": "R1O9D70XLIZ5UN", "Overall": "2.0", "Content": "Spent about a month researching this model and last year's (the Kodak EasyShare Z1012 10.1MP Digital Camera with 12x Optical Image Stabilized Zoom) online.  Reviews for the old one were more glowing than for the Z1015IS, but it seemed like once users upgraded the firmware to 1.03, all their problems with the Z1015IS vanished.  The clincher for me was the longer zoom lens (15x vs 12x), and the 28mm wide angle - so I bought one.  I was excited to find that it came preloaded with 1.03 (along with a separate sheet describing the changes in the firmware update).BUT, I was disappointed in these aspects:Viewing angle of 3\" LCD - The LCD washes out above the horizontal, making it difficult to take pictures from below eye level, like when you're taking a picture of your kids, but don't want to look \"down\" on them.Low resolution of 3\" LCD - The specs answer this question, since the 3\" LCD has the same resolution as the previous 2.5\" LCD, so the pixels themselves are just bigger, yielding a blockier image.Poor auto-focus, even at wide angle - couldn't get a clear picture of my family in front of the Christmas tree, something my old Kodak EASYSHARE Z730 - Digital camera - 5.0 Mpix - optical zoom: 4 x - supported memory: MMC, SD and my father's Kodak EasyShare Z712 IS 7.1MP Digital Camera with 12x Optical Image Stabilized Zoom did with ease.Now I'm not a pro photographer, so maybe the PASM settings would have solved my problems in certain situations, but I feel that's too much work for a camera that presents itself as \"Smart\".  And if the Perfect Touch processing is required to get a good picture, the time it takes to process (an option with the new firmware) is simply too long to know if you \"got the shot\".I realize I may get flamed in the Comments for not taking the time to \"get to know\" the camera, but that's not what I want in a superzoom digital.  My mistake for not researching more thoroughly.  Returned the Z1015, and will look more closely at the Z1012, since it seems to be merely a slight upgrade from the older Z712, rather than the (poorly) redesigned Z1015.", "Date": "December 30, 2008"}, {"Title": "Happy Family Camera", "Author": "Andrea Thompson \"Mountain Walker\"", "ReviewID": "R3ELSJ39MQJLCH", "Overall": "4.0", "Content": "We had a Kodak Z740 stolen and wanted to replace it with an updated version.  We chose the Z1015IS to fill this purpose.  I find this camera to be easy to use, fast enough to get shots of my toddler, and it takes nice video.I found that the auto focus was a bit slower than my older Z camera, so I changed the auto focus to the center of the view field and this helped a lot with focus speed.Many speak of incredibly slow processing time, but we have not had this issue. This may be because we got a SanDisk Extreme III high speed memory card 8 G (this size chip is great too because you can shoot tons of high def pics and take video and never run out of room).I really like that you can zoom in and out when using video mode, something my old camera did not do.  The large view screen is nice too.The 15X optical zoom is AWESOME! I recommend getting a small portable tripod that will fit in your camera bag so you can use the zoom where ever you are.My wife is an all AUTOMATIC photographer and she is happy with this model.The only real cons are that this model cannot use standard batteries like my old one, so I bought two right off the bat to have a backup.  They are rechargable, and these two have covered us for all uses.  Get a charger with a car port too.The other con is the lens cap.  Its a bit easier to pop off than I'd like.  However, this has not impacted the camera or its use in any way.  Dont worry about this.All in all, tons of camera for the $$.", "Date": "March 13, 2009"}, {"Title": "Works very nicely", "Author": "Larry Peterson", "ReviewID": "R24BN1I876VLN4", "Overall": "5.0", "Content": "I purchase this item some time ago and have had a really good change to use it.It works very well, and the 15X zoom really is great. It also has an option to use a view port instead of the screenwhen the sun is too bright. Very nice photos.", "Date": "January 2, 2013"}, {"Title": "Good camera", "Author": "Shawn", "ReviewID": "R2SKLXMDE1AAV0", "Overall": "4.0", "Content": "What a nice camera this is. I like that its more than a point and shoot but not quite a DSLR. Great that things like the aperature and f-stop can be adusted. Wished for more optical zoom though.", "Date": "May 8, 2012"}, {"Title": "Good, but.............", "Author": "David J Dougherty", "ReviewID": "R3EGQHBA3BHRPQ", "Overall": "2.0", "Content": "Very good camera overall, for the price! However, one feature just drives me up the wall:The lens cap will not stay on. One little brush knocks it off, taking it out of the case knocks it off. May sound like a nit, but not to me. Caused me to drop it from a 4 to a 2.", "Date": "March 27, 2011"}, {"Title": "Love the color quality.", "Author": "new mommy 323 \"new mommy 323\"", "ReviewID": "R2U0IN01TRS7Y6", "Overall": "5.0", "Content": "I bought this camera at Office Depot because it was on the clearance table for 150.00.  Not only was it a great deal, but the picture quality is great.  My husband purchased a 550.00 camera and I seriously like the pics taken on this one better.  I took pics of my daughter at the park and when I printed the pics they were amazing.  The pics of the slides and the playground was intense. The pics come out super bright.  I put the pics up at work and people ask me what camera I used because the pics are great.  Another awesome thing about this camera is that it is a point and shoot that doesn't require much effort. It is easy to use and you get great shots.", "Date": "May 14, 2010"}, {"Title": "Kodak vs Canon?", "Author": "Vicki E. Bessent", "ReviewID": "R29GC39PJ8D0Z3", "Overall": "5.0", "Content": "Have had Kodak's & Canons. Prefer this Kodak Z 1015 to my Canon S5.Each to learn. Large LCD Window. Colors are very natural.", "Date": "February 5, 2010"}, {"Title": "Full Featured Camera That Takes Excellent Pictures", "Author": "Mark W. Bliton \"MWB\"", "ReviewID": "R6QYY2Z6FSJFM", "Overall": "5.0", "Content": "This is a great camera for a person who wants a full featured camera at a reasonable price.  The 15x zoom lens is fantastic and the image stabilization is a real asset.  The view finder is also a big plus for those who don't want to only rely on the LCD.  It is a larger camera.  If you are looking for compact camera this isn't the one for you.", "Date": "January 9, 2010"}, {"Title": "Great Camera", "Author": "Kate C. Hibbeler \"hibbhaus\"", "ReviewID": "R3AK1A9YVO1OCS", "Overall": "5.0", "Content": "I have owned other Kodak cameras before this one.  It is the same good quality and takes amazing photographs.  For the money, you cannot beat the pictures - my 5 x 7 photos are flawless.", "Date": "October 11, 2009"}, {"Title": "Kodak EasyShare A1015IS", "Author": "S. E. Collins \"Kivett Lake\"", "ReviewID": "ROBW4RQSIUABP", "Overall": "5.0", "Content": "I have found this camera very easy to use and produces high quality pictures.  Zoom feature is wonderful.  Either LCD screen or viewfinder  provide clear visualization.", "Date": "September 7, 2009"}, {"Title": "Fantastic Camera", "Author": "Leanne Burroughs \"Leanne Burroughs, Author of...", "ReviewID": "R16D8ESKPZEVSL", "Overall": "5.0", "Content": "I absolutely love my Kodak Z1015IS.  I had a Kodak Z710 before and loved it, but regretfully I dropped it one too many times. :-(The zoom capability on this camera is phenomenal.  I haven't used it indoors in a gym yet to see how the lighting works with that.  With the Z710, the photos always turned out too dark and I had to enhance them.The only drawback to it is that it is slower than I would like sometimes when trying to capture my granddaughters.  I've read there is a firmware upload that is supposed to help with that, but I couldn't figure it out the one time I went to look at it.Regardless, this is a camera I would highly recommend to everyone.", "Date": "April 25, 2009"}, {"Title": "Love My Kodak Camera", "Author": "Miss Pepr", "ReviewID": "R1UVJEJTVZ2JUE", "Overall": "4.0", "Content": "I started with a Kodak C613 camera and was pleased with the results.  However, I wanted to upgrade to a camera that gave me the option of choosing the settings.I chose the Kodak Z1015IS because of the 10MP and 15X.  I have not been disappointed.  The pics are turning out great!  Even better than I expected.  The true color you get with this camera is amazing.  Understanding the setting manual is easy.  If you really want a great digital camera, this is the one to buy.", "Date": "April 3, 2009"}, {"Title": "Best camera for the money", "Author": "jankr1 \"papaj31\"", "ReviewID": "RZVFMIR2VPOYE", "Overall": "4.0", "Content": "The camera met my expectations. However, two things were very annoying: the lens cap was slightly warped, so it didn't fit well and the HD video files are still in the MOV format, which requires a conversion program to make them useful in the non-Apple world. The SUPER program worked good on converting the HD video files.", "Date": "March 1, 2009"}, {"Title": "kodak easyshare Z1015IS", "Author": "Rebecca K. Stout", "ReviewID": "R3P7PB2LASZUOJ", "Overall": "5.0", "Content": "I am very happy with my Kodak EasyShare Z1015IS. I am still learning about it.The helps on the camera are great. I think it's A lot of camera for the right price.", "Date": "February 21, 2009"}, {"Title": "We like our Kodak Z1015IS digital Camera", "Author": "Mike \"Mike\"", "ReviewID": "RHY87HUTDN8RR", "Overall": "5.0", "Content": "The camera is very versatile, allowing photos in fully automatic mode, or with any level of user control he or she wishes.  Quality has been excellent.  We researched our purchase carefully, and are pleased with our choice.  Through Amazon, we were able to get the best price we saw anywhere.", "Date": "February 19, 2009"}, {"Title": "Happy with purchase", "Author": "Ralph Parker", "ReviewID": "R4LGBYKV2SI0C", "Overall": "5.0", "Content": "Amazon is very prompt and great to order from. The Z1015IS Kodak camera is a great camera. Don't know of anything bad about it only good stuff.", "Date": "February 5, 2009"}, {"Title": "Great Digital Zoom Camera!", "Author": "Mike Borland", "ReviewID": "RQDVBA6JSDAW", "Overall": "4.0", "Content": "I purchased the Kodak Z1015IS in November 2008. The picture quality and zoom capabilites are great. I also have found the movie mode quite useful. In summary, I find the price/performance ratio to be the best in this class of camera.", "Date": "January 24, 2009"}, {"Title": "Popup flash stops popping up", "Author": "Arvind C \"AC\"", "ReviewID": "R3EA1YPBX72ZIG", "Overall": "1.0", "Content": "The popup flash is a big issue with camera like this. The popup flash stopped popping up for my camera and the camera is basically useless. The camera also shuts down every once in a while for no reason and I miss precious shots. I loved the camera initially because of all the features it has but now I hate it.", "Date": "November 2, 2008"}, {"Title": "Very Good Camera!", "Author": "Julane \"Julane\"", "ReviewID": "R3NVFZI2USGR2D", "Overall": "4.0", "Content": "I am not a photography guru, and until I bought this camera I had never owned a digital camera before.  Based on reviews I thought this one would be good.  It was important that my new camera would be easy to figure out.  I don't have time to read a huge book of instructions.  I wanted a camera that I could essentially just pick up and use right away.  At the same time, I wanted a camera that would be capable of taking very high quality images once I had learned more about photography.I have had the camera for about three months now and overall I have been extremely happy with it.  I was able to start using it right away, and even in the automatic mode it takes wonderful photos.  The set-up is very user friendly and it is easy to figure out additional features.  Since I am a busy musician I haven't had time to look into all of the details of making professional quality photos yet, but so far everything I have done has worked very well.  The quality of the photos is excellent.I only have one complaint concerning the camera and that concerns taking videos.  I'm not sure if these problems have anything to do with my lack of knowledge or if these sorts of problems are standard regarding videos taken from digital cameras.Here is the problem:  I have set up the camera in order to take videos of myself fiddling and sometimes the image goes in and out of focus.  It appears a bit blurry.  Also, the camera makes a strange noise (sort of a clicking or grinding sound) at times while recording the video that can be heard when the video is played back.  I find that extremely annoying.  You can see an example of a video that I made with my Z 1015 IS that I uploaded to You Tube and you will see the blurriness and hear the sound I'm talking about.  Go to: [...]My goal isn't to take professional quality videos using this camera, but I was a bit disappointed with the clicking sound.  Some more information for you:  I ordered a set of equipment to use with my camera from Kodak and among the items included in the set was a camera bag.  I wanted to make sure that the bag would fit my camera so I contacted Kodak by phone.  The woman I spoke with assured me that the bag would fit my camera.  Once I got the bag in the mail all I had to do was look at the bag to see that there was no way it was big enough to fit the camera.  I was disappointed that I was given wrong information over the phone by a Kodak representative.  Having said that, the remainder of the items in the set were cheaper than if I would have bought them separately.In this review I've tried to tell you about both the good and the bad I have experienced from this item.  In buying this camera I liked helping to support an American company.  I think this is an excellent camera overall.  I am so happy with it that I am planning to buy a subcompact camera from Kodak in order to have something small to take with me on trips.", "Date": "April 29, 2009"}, {"Title": "Lesson in frustration", "Author": "Maggie", "ReviewID": "R1SVKE9U3WZ08N", "Overall": "1.0", "Content": "Easy share? What a joke. This camera NEVER connects to the computer right, and I've tried it on many different computers. I've had it for years, but I rarely use it because it is so amazingly difficult to get my pictures, which is funny to me since this is an EASY SHARE. HA! I only recommend this camera if you are looking for a lesson in frustration. What should be so easy, and is easy with every other camera I've used, is AWFUL. What good is a camera that you can't access any of the pictures from? I'd give it a zero, but I had to give it a one.", "Date": "August 27, 2012"}, {"Title": "great camera", "Author": "avg.joe", "ReviewID": "RY839A5V87B58", "Overall": "5.0", "Content": "great camera. zoom awesome. do not like how loud zoom is on video. most user friendly camera i have ever used. looking forward to 100x upgrade", "Date": "December 26, 2011"}, {"Title": "Excellent Camera", "Author": "Sam \"Scalion\"", "ReviewID": "R2Q355D7HGMT7A", "Overall": "5.0", "Content": "I have always owned Kodak cameras. This is thus far the best. The flashlight is very powerful rendering bright and crisp pictures even in pitch darkness. The only thing Kodak should have avoided is that the flash pops up for every picture, unless i set the flash off, at times it is annoying and unnecessary. Otherwise its a great camera.", "Date": "August 7, 2009"}, {"Title": "Shipping and handling of camera", "Author": "Donna D. Weston \"Mesa Fan\"", "ReviewID": "R89NAGDKLYGPG", "Overall": "4.0", "Content": "We like our camera except that we cannot seem to get a comfortable strap that will fit the camera.We were disappointed because possibly the camera had been used or something was wrong.When we received the camera there was almost no packing in the shipping box, the camera box had been opened and the bag the camera was in had been opened.  I am just hoping that nothing will be wrong with the camera.  Have not had a lot of time to play with it.", "Date": "March 18, 2009"}, {"Title": "for pictures only !", "Author": "D.Rose \"Donatillo\"", "ReviewID": "R37VSW5UMK5RZ9", "Overall": "4.0", "Content": "The Clacker Camera..The pictures are great , I tried every situation, and its the best picture machine yet.  When vedeo came for \"its turn\" picture was great , but the noise produced by the clacker of the focus , just destroyed the thought of good movies.  This Camera must have had a time limitation to make it on the streets in time ! because the error of noise of clacker stayed with it. I would recall the camera to have it fixed from its horrible flaw. Movies are just as important in this field. If you buy a Camera with \"movie\" it better work right out to the buyers. The battery should have been also a double AA like the rest z models, but its another blunder with a new type of cell to make it even more frustrating to buy funny batteries and charger as well.  If you like taking pictures and thats all, this cameras is it..thats about it.", "Date": "February 24, 2009"}, {"Title": "Kodak Z1015IS Camera", "Author": "John Dorpinghaus \"The Dutchman\"", "ReviewID": "R18HHZAYWD5WB3", "Overall": "5.0", "Content": "Everything about this camera purchase was far superior to many other internet purchases I have made.", "Date": "January 6, 2009"}, {"Title": "Big disappointment", "Author": "East Coast Brian", "ReviewID": "R3C4ES3U4CQK7L", "Overall": "2.0", "Content": "The pictures taken outdoors with this camera were uniformly soft.  Detail was missing; everything looked as if there was a bit of fog.  The look was as if taken with an old uncoated lens.  How Schneider ever got involved is a mystery.Indoor flash pictures were better--probably because reflected light was more direct.  But since most people will buy this for the long zoom outdoors, this is a loser. All those megapixels just make for a soft picture that is very large.I returned this camera--Amazon's affiliate seller was fast and courteous--and bought a Canon PowerShot SX110IS.  It has fewer bells and whistles than the Kodak, but a fantastic lens.  Well worth it.FOLLOW-UP, a few months later--the Canon takes very good pictures for the price, but it is a special kind of hell to shoot in daylight outdoors.  I will never buy another camera without a viewfinder.", "Date": "May 2, 2009"}, {"Title": "Dont' buy if you shoot in Manual~!", "Author": "Marylee Pope", "ReviewID": "R1UGR7DAYUY28W", "Overall": "1.0", "Content": "I bought this because I LOVED my Z812 IS.  But this one had a 15x zoom (vs 12x on the 812) 28 mm lense AND could shoot in RAW.  MAN what a disappointment!  In manual, you can NOT set your aperature.  It give 2 options (one high and one low) and then is will often SWITCH while you are shooting!  I'll be shooting along and suddenly, black image.  I look and it has switched to like a 10 F stop!  It is also very difficult to set the ISO, Shutter speed and aperature...the light bounces around and passes waht you are trying to set.  you have to REALLY baby it to stop where you want it.  Over all, I HATE this camera.  Just can't afford another now since I just got this one a few months ago.  I shoot a LOT as a hobby....landscapes, animals, etc and am very frustrated with it.  I also like the \"Star\" effect on lights with night shots on the 812.  Nothing doing with this one.  Just plain bland lights.  That was my signature on night shots.  Some may NOT like it, but I do and miss it.  Kodak...you BLEW it on this one!", "Date": "April 29, 2009"}, {"Title": "You get what you paid for.", "Author": "Anna Krivenko \"Anya\"", "ReviewID": "R847KAQZIA83V", "Overall": "4.0", "Content": "Edit: The raw format on this isn't worth it!! It's kodak raw format! Not actual raw!! So I am assuming you need the kodak software to work on those! Completely defeats the purpose of raw :(True, the pictures are not a very good quality at night as other cameras, so don't shoot at night! :) or just deal with it. Something about some chip that's meant for that and some cameras just don't have very good ones to begin with like this one. Chances are most people use this camera for snapshot purposes, not professional photography. The graininess won't show up on your 4x6s. It's sufficient quality for everyday use. The great thing is it shoots in RAW.. I still haven't figured out what to do with it, but from talking to photographers RAW has its perks. I like being able to edit photos slightly on camera as well as crop them. The autofocus is pretty good also. I was testing that whole out of a moving car theory. While on roadtrip we were passing by some forestie looking thing off the freeway, so I zoomed all the way in and took a few shots. A couple of the pictures turned out really sharp! Crappy quality due to zooming so much(come on, no camera is really meant to take great pictures while zoomed all the way), but sharp. Don't know.. it's fine for me. If you want a camera that shoots raw, has all the multiple settings, good autofocus AND shoot well at night, go spend a couple grand on a professional one but if you want to be able to just spend $250, then quit complaining that it's not the best thing in the world. I hang around a lot of photographers and know that their equipment is ridiculously expensive, so wanting to spend this much you have to sacrifice something!When it was delivered the mail person just left it by my door, which I wasn't happy with since I lived at an apartment building and my door was right next to the outside door. But whatever, that's not these guys' fault.", "Date": "August 10, 2009"}, {"Title": "Kodak should know better", "Author": "Just Bob again", "ReviewID": "RAESXH1CX5AV9", "Overall": "1.0", "Content": "I was going to rate it a 4 because it has a lot of features.  I changed my mind.  A solid one.  After a hundred years in the business, they should know how to design a camera.  I guess they forgot.  Lots of pixels and lots of features alone do not make a good camera.  The core features need to work well and they don't.Zoom is jerky.  It zooms, overshoots, stops where it wants which is too far,  You zoom back, it overshoots and now it's too wide.  It's near impossible to quickly get a shot framed how you want.Even when you make the focus zone small, it acts like it focused on your subject but changes its mind at the last instant and gives you a blurry picture.  A million or a billion pixels make no difference if they're all blurry.Two-tenths of a second is what they claim.  Push the button and get a picture.  Well, depends on how you measure it.  Add in a couple seconds for fighting with the zoom.  Add a second or two for it to try and fail to focus.  Another half-second to pop up the flash.  A second or three to store the image in the memory.  Yes, I got the fastest Kodak-certified card I could find.  Actual picture-taking time is more like 5 seconds per shot.  I've lost a lot of shots.  It's not a true SLR.  It's not a point-and-click.  It's a point-and-wait camera.File formats.  They us a proprietary format for their RAW files, not TIFF.  They use Quicktime for movies.  If you want to really use the camera, you have to buy more software.  They must have some marketing tie-in to try and sell software.  I don't like it.  The Easyshare software also does its level best to sell you their online printing and online image sharing garbage.  No, I want none of that.George Eastman is probably turning in his grave because Kodak is unable to make a halfway decent lens cap anymore.  Hard to attach, hard to remove except when it pops off by itself at every opportunity.Bottom line, a lot of features for the money.  However, many features do not work that well.  I had an older CX Kodak digital.  Less pixels, less features.  It took acceptable pictures quickly and rarely out of focus. This is not a professional-grade camera.  It's too complicated and slow for a point-and-shoot.  Ergonomics are not good.  Not easy to hold.  Zoom buttons poorly placed.  Needs two hands to use but too small for that.  It points out how much work is yet to go before digital is a good medium.  Makes me want to dust off my old Pentax and go back to film.", "Date": "April 17, 2009"}, {"Title": "What beautiful pictures!", "Author": "Lindahntx", "ReviewID": "ROBI4H8RGQYIN", "Overall": "5.0", "Content": "I just received my Kodak EasyShare Z1015 IS last night, and started taking photos this morning of flowers, to test it out.  I can't be more pleased! OMG! I can't wait to get more experience on it.  Look out grandson, I'm gonna be all over you!", "Date": "June 17, 2009"}, {"Title": "love it", "Author": "A. Nicholson", "ReviewID": "R17P7YUL7U8LJF", "Overall": "5.0", "Content": "I have had my Kodakz1015 for almost a month now, and I love it!! I am constantly taking pics. We went to the beach and the pics turned out great. I am so glad I got this camera.", "Date": "May 11, 2009"}, {"Title": "Amazon's used junk", "Author": "JJ", "ReviewID": "R3TLEBG8VSKOB6", "Overall": "1.0", "Content": "it isn't so much the product itself as it is the outfit that I purchased it from.  I purchased a new camera and when I received it there was already 12 photos loaded onto it.  I called Amazon to complain and had to fight with them for 45 minutes before they gave me a minor credit on my purchase.  Several days later the battery on the camera died (because it is a USED camera, when I supposedly purchased a NEW camera).  This was my first experience buying from Amazon and certainly my LAST!!  Never again will I buy anything from Amazon!!!", "Date": "October 11, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "10-megapixel resolution for stunning prints up to 30 x 40 inches\n15x optical zoom with 28mm Schneider-Kreuznach Variogon wide-angle lens; HD still capture and HD video\n3.0-inch indoor/outdoor color LCD; advanced settings include program, aperture and shutter priority, as well as full manual mode (PASM)\nInnovative smart capture feature automatically adjusts settings for a great picture in just about any environment\nCompatible with SD/SDHC memory cards (not included)", "Name": "Kodak Easyshare Z1015IS 10 MP Digital Camera with 15xOptical Image Stabilized Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/4136JlrrGiL._SY300_.jpg", "ProductID": "B001BX6HCU"}}