{"Reviews": [{"Title": "All good, except where you need it.", "Author": "A. Thompson", "ReviewID": "R3GOUIJJA4WR4E", "Overall": "2.0", "Content": "Are there any decent mounts out there? The one that came with my Foscam 18905 - why did they even bother? Useful only if you don't care where the camera is aimed.These are actually a big improvement. But they still don't work very well.The modular design and all the pieces screw together in lots of possible configurations. It's a cool idea, really. But the weak link is the most important - the ball joint. It just won't hold like it should. A heavy camera like the 18905 will get pulled by the wind or the ethernet cable. Makes for a precarious situation.Another example of that Wal-Mart mentality. Make it cheap and the heck with the functionality.Edit: I tossed out the ball head that comes with it and replaced it with a decent one - Professional Mini Ball Head Camera Mount. Sure, it triples the price of the total mount, but it works great. And it's still under about $20 each. It's a shame to have to go to that extreme, but it solves the problem.", "Date": "November 21, 2013"}, {"Title": "Adjustment is a little tricky", "Author": "Dixiepartsman", "ReviewID": "R1WONX8GNZDTEX", "Overall": "4.0", "Content": "When I first got these I thought they were defective. The thumbscrew wouldn't hold the ball swivel tightly at all. It just flopped around regardless of how tight the thumbscrew was. I took the thumbscrew completely out and looked inside the hole and there seemed to be a groove in there. If  you align the groove with the screw hole then put the thumbscrew back in so that it's in the groove the whole thing works fine. Pretty lousy design considering that they ship these with the screw loose so it's inevitable that it will misalign itself. I can see how some of the other reviewers thought they were defective. The extensions are nice and beefy but I'm going to put some thread locker on the threads just in case.", "Date": "November 8, 2013"}, {"Title": "Nice!", "Author": "T. Arnall \"Terry Arnall\"", "ReviewID": "R2Q76TZSZNK1VQ", "Overall": "4.0", "Content": "CCTV kits usually don't come with state of the art mounts, these are really nice for a light CCTV camera. You can even screw the tubes together for a longer reach. I would spend more money to find something like these built a little tougher/heavier duty. I little hard to tighten the adjustment...maybe I need a smaller camera. Using those that came with my Swann CCTV kit I got from Costco.", "Date": "October 19, 2013"}, {"Title": "these are beautiful", "Author": "billtull", "ReviewID": "R2THDP74KX0Q52", "Overall": "5.0", "Content": "gottem fast, they look beautiful, and the function as they should lots of extras included,  and the price was more than fair, nuff sed...", "Date": "August 8, 2013"}, {"Title": "VideoSecu 2 Pack 2-6 inch security camera mounts", "Author": "Daniel Bender \"Daniel Bender\"", "ReviewID": "R1KOTNBS6U2Y08", "Overall": "5.0", "Content": "These mounts are made of very solid metal. I love the idea of being able to make the armature as short or as long as you need it. They hold the camera firm and the shafts very solid. If you're having problems getting the swivel head to tighten, there is an Allen key on the other side of the thumbscrew to assist in tightening the swivel head. I will be buying more!", "Date": "July 19, 2013"}, {"Title": "Perfect for my appliaction", "Author": "E S", "ReviewID": "R3IJ4Q7K83KXKQ", "Overall": "5.0", "Content": "These are the best security camera mounts I have run across in this price range.  They look great and don't break easily like the ones that come with most cameras.  The ability to extend several inches is a plus.", "Date": "July 15, 2013"}, {"Title": "Sturdy mounts", "Author": "J. Knouse", "ReviewID": "R32KTAAJN72W25", "Overall": "4.0", "Content": "I bought these to replace the originals that came with my cameras & broke on first use. These are quite superior & much sturdier & heavier than the originals, also, you can change how tall they are & how far they stand off from the surface. Well worth the price.", "Date": "July 10, 2013"}, {"Title": "Very handy", "Author": "TJH", "ReviewID": "R2VPWTE3UXQJ8D", "Overall": "5.0", "Content": "This is a great price and they work fine. I think most cameras must use the same size threads because it worked on the crappy no-name  camera system I originally purchased and also on my Foscam setup.", "Date": "June 28, 2013"}, {"Title": "All metal construction. Average quality.", "Author": "GoDoItYourself", "ReviewID": "R3DI5U35FQ0BU7", "Overall": "4.0", "Content": "I got these to mount my surveillance camera.I was surprised to see all the components were of metal construction.No plastic parts at all.Some consumers complaint about the lack of holding power of the ball head.I noticed that too on these. There is a setscrew on the opposite side of the thumbscrew.Tightening them and backing off about an 1/8th turn helps hold the ball head in positionwhen the thumbscrew is tightened. If the problem persist, remove the thumbscrewand round off the tip with a file or grinder. That little trick help make mine stay firmly in place.I wouldn't recommend mounting anything heavier than a pound. Especially whencantilevered out away from the ball head.", "Date": "April 8, 2013"}, {"Title": "Don't over tighten the thumb screw!", "Author": "Dean T. Martin \"Larger Leon\"", "ReviewID": "R1GA8U8NZ6DU60", "Overall": "3.0", "Content": "I used both sets on a couple outdoor CCTV cameras, and the initial setup was fine. Note: You have to tighten both the thumbscrew and an Allen head screw on the opposite side in order to lock the ball joint in place. I decided to change the height of the mounts, and when I remounted the cameras, one of the thumbscrews stripped out. Apparently, the metal on the \"head\" is not very strong. Fortunately, I had a slightly bigger screw and was able to lock the camera in place. So, I recommend being careful and keep adjustments to a minimum.", "Date": "April 4, 2013"}, {"Title": "Nice fixture!", "Author": "Alex Tejada", "ReviewID": "R37FNDOFRVHGRK", "Overall": "5.0", "Content": "This was to replace from my home security metal mount and works just fine. It also brings additional parts if you wish to extend.  Easy install!.", "Date": "March 18, 2013"}, {"Title": "Great mounts if you have a bit of patience with them.", "Author": "Chris Hughes", "ReviewID": "R1EXPET95EDZM3", "Overall": "4.0", "Content": "I read through every single review of this product and I was a bit skeptical about their quality but I haven't had a bad experience. I used these to hang 2 HD camera's from a ceiling joist. The metal and screws are of decent quality. However, as others have mentioned, the ball joint requires some patience to get tight and working. It took me a while to get them to tighten down into position but once I played around with it, they were fine. I would not recommend using them in a application where they would require lots of adjustments. Overall I'm happy with them and would recommend them.PROS: Comes in a 2 pack!!! Extremely low price. Decent build quality. Included screws.CONS: Ball joint takes some patience to get into a tightened position.", "Date": "February 5, 2013"}, {"Title": "Great bracket for my security camera", "Author": "Mark", "ReviewID": "R3NOKPSL4TYEF5", "Overall": "5.0", "Content": "Nice quality and color, strong and adjustable, looks and works great. All the pieces of the bracket come apart and can easily be assembled in a multitude of ways. Camera simply screws on and can be tightened in any position.", "Date": "December 15, 2012"}, {"Title": "Ball head will not tighten", "Author": "T. Roth", "ReviewID": "R4ACR5OFCMM0K", "Overall": "1.0", "Content": "The ball head on one of the two mounts in this 2-pack worked fine, but the other one would not stay in place. Even when the knob was turned in as tight as it would go, the screw mount still swiveled freely. Returning for refund. If I had received two that worked properly I would have given this a high rating, but I wouldn't take a chance on buying this product again and getting another defective mount.", "Date": "December 15, 2012"}], "ProductInfo": {"Price": "$54.95", "Features": "360 degrees turn and rotation, 90 degrees tilt\n1/4\" / 20 threads throughout\n12 different combinations, customize to 2\", 4\" or 6\" length\nMetal construction, all parts interchangeable. T-bar drop ceiling clip included\nPackage included: 2 x metal security camera brackets", "Name": "VideoSecu 2 Pack 2-6 inch Metal Wall Ceiling Mounts Adjustable Pan Tilt Video Camera Mounting Brackets with Ceiling Clip for CCTV DVR Home Installation Surveillance System 1SG", "ImgURL": "http://ecx.images-amazon.com/images/I/411BldKP8nL._SY300_.jpg", "ProductID": "B001D49TU4"}}