{"Reviews": [{"Title": "Pretty good camera!", "Author": "Elise \"Elise\"", "ReviewID": "R1LCFNT1JWBK7Z", "Overall": "4.0", "Content": "I just bought this camera, and from what I can tell so far it's pretty good. Pros:1.) Takes really clear pictures2.) Nice BIG screen3.) comes in a cool color4.) Plays videos through windows mediaCons:1.) So far the only thing which isn't so bad is the shutter-lag. My old Kodak use to take super quick pics, this one is still fast, but not as fast as my old camera.In general, this is a good camera i would recommend.", "Date": "September 8, 2009"}, {"Title": "Teenage Daughter Loves it!", "Author": "ChatterBox \"Book Klub Member\"", "ReviewID": "R3RR2GNGH176QP", "Overall": "5.0", "Content": "I bought this camera for my 14yr old daughter and had it shipped to California for her Christmas present. She loves it! It is easy to use and she likes the big LCD display. I liked the price because my daughter is known to lose things. But she likes it so much she hasn't lost it yet. I would highly recommend it to someone who wants a small inexpensive easy to use Camera. I ordered the orange caselogic ultra compact case with storage and a sd card to make a total package and my daughter is in digital photo heaven! Plus KUDOs to Amazon, the items shipped quickly and without any errors and well before Christmas day... Loved the whole experience!", "Date": "February 8, 2010"}, {"Title": "Pretty Good", "Author": "G. Torres", "ReviewID": "R3LYTJKNCE1GGT", "Overall": "4.0", "Content": "Camera works well..nice big screen..much like most other cameras today..the only complaint I have is that there is no button for video..you have to go into the menu to switch to video mode.  This isn't convenient for a kid (although they are probably better at figuring these things out that adults), but it's also just not convenient.  Other than that, the camera is good, especially for the price.", "Date": "January 18, 2010"}, {"Title": "there's a comprehensive user's manual on [...]", "Author": "Chantel Aberdeen", "ReviewID": "R1I8BWFICZ9VV", "Overall": "3.0", "Content": "I read the review regarding a possible memory flaw, and purchased this camera anyway because I was hoping it was an anomaly. I didn't add a memory card, because I was curious about the internal memory. After two photos, \"Memory full\" displays on the LCD. I received the camera today, and I am not prepared to give up on it yet, because of the price I paid ($[...] on amazon).I intend to try some experimenting with and without a memory card, and I'll update my review...May 6, 2010 update:With my SanDisk 4GB SDHC Card, there don't appear any memory issues at this point. So that's a relief. I am not sure if it is reasonable to expect the internal memory to be better for this product. The user guide is very disappointing. It has very little information, and so I am trying to experiment with different settings to determine how to optimize the use of this camera. The photos appear grainy, but perhaps that's acceptable for a camera of this quality. I am a novice and would feel more comfortable if the manual were more informative. I'm still not giving up, and I can give it 3 stars for now.May 7, 2010 update:I found a comprehensive user's manual on [...]. It's 93 pages. My friend said that Polaroid probably didn't include it because it would mean they'd have to charge more for the camera. So now, I believe it's fair to give it 4 stars, however, I'm still experimenting, and may post another update later. By the way, [...] lists the retail price at $79.99. So I would advise others to give it a try now, because amazon is still selling it for $20 less.", "Date": "May 4, 2010"}, {"Title": "Orange Gem", "Author": "SuperMom", "ReviewID": "R2GFOK9WEAXHZ4", "Overall": "4.0", "Content": "I purchased the Polaroid T1031 for my daughter because she was graduating from H.S. and I wanted her to capture all the moments of her last year. I was looking for an inexpensive camera because this was going to be her 3rd one. Well when I saw this one for $60 I snatched it up right away, not really paying attention to the features. Well once we received it and compared it to the expensive camera I purchased (KODAK)for myself I was blown away. The pictures were brighter, sharper, colorful, the screen was GIGANTIC compared to mine. The function buttons were not sitting on top of one another and the share features were very easy to do. The video and sound was amazing, I swear you would have thought I had a camcorder. This camera saved my memories of her last year of H.S. becasue the KODAK was not even close to providing the same performance as the Polaroid T1031. Don't judge a camera by its price or color. :-)", "Date": "May 27, 2010"}, {"Title": "Orangetastic", "Author": "S. Callahan", "ReviewID": "R1HPDFI2WK8TKC", "Overall": "5.0", "Content": "I was very excited to get my camera in.  My only gripe is now it's on sale even more, my loss.  The menus are easy to figure out without the manual and simple to navigate through quickly when wanting to change from picture to video and back and for different features.  I bought this camera for it's size and for it's ability to zoom while videoing.  My big chunky Fuji is still my main one but this one is for more discreet picture taking in say a restaurant etc...the pictures have been clear and the color good.  The display is very clear and I like the size of it.  Others mentioned problems with the battery life, battery compartment door etc.  I have not had any problems with any of that.", "Date": "April 13, 2010"}, {"Title": "Great value camera..", "Author": "Sandip Gupta", "ReviewID": "R5ESB59U1W97M", "Overall": "5.0", "Content": "Got this camera for my daughter as this met her requirements... sleek, good color,3 inch lcd, not pricey.I would rate the picture quality close to my canon SD110. Don't need to think twice if need one for your kids. Highly recommend.", "Date": "January 31, 2010"}, {"Title": "Good camera for very good price", "Author": "Samil Korkmaz", "ReviewID": "R78O0PJC7VY9J", "Overall": "4.0", "Content": "I bought this camera as a present for a friend. It hace a nice large LCD, the choice of casing color is good (a nice type of orange, not flashy as I was worrying before I got it).My only complaint is that the video feature is not directly accessible, it is buried two levels down in menus.All in all, price/performance is very good.", "Date": "April 10, 2010"}, {"Title": "A real person's experience with this camera", "Author": "Jonathan A. Rimert", "ReviewID": "RY78R0AF3Q11O", "Overall": "5.0", "Content": "I recently purchased the Polaroid t1031 digital camera for MYSELF, not my child. Amazon's free super saver shipping was nothing at 5-7 business days. My new camera arrived safely packaged within 3 days of my purchase online at night. I opened the box, and unwrapped my several orders. The Camera was certainly orange, but not at all as neon orange as the picture Amazon is using. Everything was included in the box, and in great shape. I plugged the battery and charger into the wall immediately, and the charger has a very noticeable red light that comes on when the battery is not fully charged. It changes to green once the battery is ready. I waited 2 hours and the battery indicator was green (probably had some juice in it already, but fairly quick full charge). I plugged in the battery, and the kingston mini SD card (in an attachment to fit the polaroid), and the camera was ready to run. Very first impression is the bright, and clear resolution on the 3\" screen. The features are all VERY straight-forward (this coming from a huge novice in cameras, but have have done a LOT of research on them). The camera is well worth the cheap price on it right now. I think if it goes up more in the 100's range again, you could get something a little more your taste, but it's a VERY good affordable camera. I recommend getting an SDHC card for memory expansion, and Amazon ALWAYS has a good deal on random memory cards. I picked up 2X 2GB mini SDHC cards that had SDHC adapters for less that $5. The camera is GREAT, and I will certainly update this comment if I feel the need to change the rating. Until then, this is a steal! 5 stars ALL DAY!", "Date": "June 7, 2010"}, {"Title": "Perfect for a teenager", "Author": "J. Christian \"A B!t of Wh!mz!e\"", "ReviewID": "R3PDH9INKBLJN6", "Overall": "5.0", "Content": "We purchased this camera for our 13 year daughter. She loves it! The orange color is perfect for teens. This camera has so many features, so be ready to read the manual. (comes as a CD not an actual manual) Having the built in battery was our top priority, but be sure to charge the battery multiple times right away to give it it's best charge. (Charge for minumum 2-3 hours, then unplug, then plug back in and charge again for best results)Be sure to buy a camera case for it too to protect it. Amazon had it the cheapest!", "Date": "April 22, 2010"}, {"Title": "Fantastic Camera for the Price!", "Author": "K. Groh", "ReviewID": "R2DUAXKGENE2X0", "Overall": "5.0", "Content": "Last year we purchased a Hello Kitty camera for my daughter for around $50. But it took horrible pictures and quickly stopped working. I've been waiting for the right camera to replace the one that broke.This camera is the perfect price for a quality camera. The beautiful orange color is unique. It is compact in size and appears durable.Since the dimensions are not listed anywhere, and you may need them for a case, they are: 3¾\" x 2¼\" x ¾\".The camera can be used strictly as a point and shoot (which is what my 6 year old does) but also allows you to control many features like the flash, wide angle, telephoto, and scene.It does take video but we haven't gone there yet. I'm afraid my computer will be overloaded with long videos of our dog walking around. As it is, 80% of the photos she takes are of the dog.The photos are clear and have good color. It focuses easily and saves the picture quickly.The battery is a rechargeable and the camera comes with the recharge unit for plugging in. The camera can connect to your computer through a USB cable but the Sandisk can also be taken out and read directly.UPDATE:I purchased another one of these cameras for a client who needed a small but clear camera to take shots at summer camp. We bought it in conjunction with the Polaroid CZA-10011B PoGo Instant Mobile Printer (Black) so that they could take camper pictures and instantly print them for a camp \"Passport\". The POGO printer works great with the camera and prints 2\"x3\" sticker photos. A great pair of products.", "Date": "May 10, 2010"}, {"Title": "Poor customer service", "Author": "George Hnosko", "ReviewID": "R29Y0N8XOIAES7", "Overall": "1.0", "Content": "I purchased this camera not quite a year ago and have had nothing but problems with it. Sometimes when you turn it on the screen comes on and the power light comes on but when you push the button to take a picture nothing happens. Other times when you turn it off the power light stays on and the only way to get it off is to take out the battery. I called Polaroid and so far have gotten no satisfaction. Would not recommend to anyone. Spend a little extra if you have to for another brand. Update. Right after I wrote this review Polaroid contacted me and asked me to send the product back which I did. I think they might have had it for 24 hours and returned it to me with a letter stating they could not duplicate the problem. I turned it on about three times and it worked perfectly, but on the fourth try it turned on and froze. I took out the battery to turn it off. then put the battery back in and turned it on and as soon as the screen lit it turned itself off. So I feel that they turned it on and it worked and stuck it back in the box and returned it to me without really trying to get the camera to act up. Bottom line is, save your money and buy a better product.", "Date": "January 2, 2010"}, {"Title": "Good camera", "Author": "MA", "ReviewID": "R2YGGLPQYG722Z", "Overall": "4.0", "Content": "I got this camera for my 14 year old and other than the fact it's a little slow to take pictures, it is great! Love the picture quality and display!", "Date": "January 12, 2010"}, {"Title": "3rd Party Replacement Battery for the Polaroid t1031", "Author": "Calvin E. Garcia \"Computer M.D.\"", "ReviewID": "R1PF8XNE8CMWFC", "Overall": "5.0", "Content": "I had the same problem, trying to find an extra battery for this excellent camera. I did a lot of personal research on this problem, since you can't get any information from Polaroid's website. You must stay with the proper voltage and amperage, that is 3.7V and 720mAh. I found a third party website that has this battery in stock. [...], its the Kodak KLIC-7001 Digital Camera Replacement Battery 3.7V 720mAh, this is the same battery for the Polaroid t1031.", "Date": "September 10, 2009"}, {"Title": "Great Little Camera at a Great Price!", "Author": "NM Mom", "ReviewID": "R1G788PHU8PFIV", "Overall": "5.0", "Content": "I purchased 2 of these cameras for my 2 sons (ages 9 and 11) to take with us on our trip to Germany this summer. I was hesitant, due to the price. Anything under $100 seemed too low for a decent camera.  I thought that the low price probably meant low quality. This camera got so many positive reviews, though, that I went ahead and purchased 2. I was not disappointed! These cameras are terrific. And for this price, you can't go wrong. My kids had no trouble figuring out how to use them. The battery is easy to charge and install. The picture quality is good. It was easy to download the photos onto our Mac (iPhoto) and edit them. Shipping was fast - and free if you're an Amazon Prime member. The battery lasted a long time between charges, until my sons discovered the video capabilities during a particularly long stretch of driving. They made silly videos in the back seat for several hours. I was happy that they were entertained, but it drained the battery. We recharged them that night at the hotel. The video quality is not particularly high. I have no problem with this, as we have a separate video camera. I only wish this camera was available in more color choices so each child could have had a different color.  And, you do need to buy a memory card.Update:  A year later these cameras are still going strong!  My son's have taken them on vacations and to camp.  No problems.  The strap on one broke, but I was able to find a polaroid replacement strap for this exact camera model right here on Amazon.  [....].  It comes with 2 wrist straps and 2 neck straps (which  my son's actually like better than the wrist straps).  I also bought them each a camera case (also right here on Amazon) to protect the cameras while in their backpacks, etc.", "Date": "August 3, 2010"}, {"Title": "POLAROID HAS THE BEST PICTURES", "Author": "amanwill", "ReviewID": "ROQVIQXOH4W46", "Overall": "5.0", "Content": "I had an earlier model of this camera and it got destroyed. I ordered this one and its wonderful. Takes great clear pictures! I recommend!", "Date": "July 8, 2010"}, {"Title": "SURPRISINGLY GOOD CAMERA!", "Author": "musicreviewer \"musicreviewer\"", "ReviewID": "R28DE1RDTKN9X7", "Overall": "5.0", "Content": "Just a quick review. I am amazed at the quality of the pictures I took right out of the box, only popping in a 4GB SD card. The colors are very accurate and the detail is very good. Strong flash.I moved the pics off the camera using the supplied mini-USB cable, and did not install the supplied software. Piece of cake.The color of the camera (orange) looks much richer in person than on the website. I can't say it motivated me to buy it. Cleveland Browns fans would like it, and it is easy to differenciate from other cameras at a party. It's growing on me...Update: The video feature has become my favorite part of this camera. Better quality than you would expect from something in this price range, which has resulted in my actually using it, unlike my \"real\" video camera which never is handy when I need it.", "Date": "June 22, 2010"}, {"Title": "Polaroid", "Author": "N. Fadhil", "ReviewID": "R2SO9NLHRFWPJ0", "Overall": "4.0", "Content": "excellent, as expected, received it on time. the only disadvantage is the small memory, you have to buy a memory card with it, otherwise you won't be able to use it AT ALL! I had to buy 8 GB memory card, so now i can take up to 1800 pix with it. but still, excellent pictures and excellent quality.", "Date": "June 5, 2010"}, {"Title": "Just bought & love it!!!!", "Author": "Marissa Hanson \"Ms J\"", "ReviewID": "R1BO17P5P7SSRD", "Overall": "5.0", "Content": "The screen is huge, it has great features and the picture quality is awesome. I would recommend this camera to anyone who doesn't want to spend an arm and a leg for a great quality product!", "Date": "June 2, 2010"}, {"Title": "Mine's titanium, but it tickles me pink", "Author": "Panglos \"Panglos\"", "ReviewID": "RZ1KFGVJQYMXG", "Overall": "5.0", "Content": "I was very pleased when I saw and picked up a Polaroid t1031 for $89 a couple of months ago, and I'm still tickled pink with it. Now it's even less (although I did get free shipping). Gol-lee, I love the combination of a great product and a steal of a deal.And what a great feature list: image stabilization (a must-have, in my experience); small LiIon battery and charger (I was able to pick up some Kodak batteries that are compatible with it for about $1.50 each); face and smile recognition; big, clear 3-inch LCD; and more. Most of all, the t1031 features simple operation, meaning even my wife (or anyone else) can use it. And I don't have to worry about remembering how to access an obscure, infrequently-used function that my aging mind hasn't seen for over a year.The t1031 has a flaw, though. For some reason, Polaroid put an \"anti-shake\" button next to the on/off button, making it easy to flip inadvertently. For this reason, it's a good idea to check the screen for the \"anti-shake\" icon before depressing the shutter. But what's the purpose of such a switch in the first place? Why would anyone ever turn image stabilization off? If there is a reason for it--for performance purposes, for instance--this feature would be better implemented in a menu selection.Something to get used to: non-standard placement of the T/W button. Instead of left-right orientation, this one is up/down, with T(ele) on top. No big deal.A month before I got the Polaroid I bought my spouse a Sony camera for about 3 times what I paid for the Polaroid, partly because of how much Sony users tend to rave about them. The photos taken by the Polaroid are superior, with noticeably less noise; the Sony menu system is confusing and has resulted in lost shots; and I don't want to hear the words \"Memory Stick\" ever again.About the only thing more I would want out of this camera is a larger zoom range, but you cannot realistically expect it for the price (yet). Today, if you're in the market for a camera of this type, and/or this is your price range, I'd get one of these without hesitation.", "Date": "February 18, 2010"}, {"Title": "suprised", "Author": "MF26", "ReviewID": "RCP9D0WF7GDMJ", "Overall": "5.0", "Content": "I BOUGH THIS ON A WHIM WONDERING WHY IT WAS LESS EXPENSIVE AS THE COMPETITION. POLAROID IS A TRUSTED PHOTO COMPANY SO I DECIDED TO BUY IT AFTER BEING UNHAPPY WITH MY KODAK EASY SHARE. I LOVE THIS CAMERA SO FAR. YES ITS VERY BASIC W/OUT THE BELLS AND WHISTLES BUT VERY EASY TO USE, NICE AND SMALL, AND TAKES GOOD QUALITY PHOTOS. THE FEATURE I AM MOST IMPRESSED WITH IS THE SHAKE SETTING. NOT ONLY DO THE PICTURES COME OUT CLEAR EVERY TIME EVEN IF MY HAND IS MOVING BUT ALSO IF THE SUBJECT IS MOVING! WOW. ALSO THERE IS NOT MUCH LAG WHEN SNAPPING A PHOTO. I ALSO LIKE THE CHARGEABLE BATTERY AND THE CAMERAS APPEARANCE. THE SILVER COLOR HAS PURPLE UNDERTONES AND ITS VERY COMPACT AND LIGHT WIGHT.", "Date": "December 20, 2009"}, {"Title": "Deeply disappointed - Watch out!", "Author": "Rod", "ReviewID": "R1OD9MKKCMH65T", "Overall": "1.0", "Content": "I have purchased this camera 40 days ago. I decided to give it a try after few good reviews and the very competitive price. I got it since I was going abroad and didn't want to carry my expensive SLR with me. Bottom line is that after the 1 week of use, the camera started shutting down with no advice, and didn't turn on when I hit the power button. I had to take the battery out, put it back again so I could turn that on! I came back from vacation this week,and was decided to return it, but now the return limit expired, so basically I've got the monkey on my shoulder! Besides, the camera has some annoying specs that can bother you even when it works fine. It takes too long to take the shot once you hit the shutter button. I have a baby and wanted to take several pics while she was looking at the camera. It took so long that when the picture was taken she was already looking somewhere else! I would say it takes from 3 to 4 seconds to really take the picture - that's too long, no matter the price you pay for a camera!! I would definitely return it or replace it for some other model if I could, so my friendly advice is: Stay away from this camera!! There are several inexpensive options around!", "Date": "July 30, 2010"}, {"Title": "Good camera with possible flaw", "Author": "Ming Su", "ReviewID": "R1QWKPEP9KJG4O", "Overall": "3.0", "Content": "The camera looks nice. But it sometimes has trouble to read the memory card. After I'took the camera out of the box and slide in my 1G memory card, it showed \"Memory full\", and automatically turned off. Then I formated the card using the camera, same result. I tried my 2G card, same thing. Then, I formated the 2G card on a  computer into all possible format. Finally I found out FAT32 seemed to be able to make the camera work. But the second day, it showed the same problem again. After I took the card out and slide it back in and restart the camera, it's back to work. I'll keep using it for next few days. If it keep doing that to me, I'll contact the customer service, either exchange or return.I tried in the last few days after I left the previous review. \"Memory Full\" problem occurred twice. \"Memory Error\" problem happened the first time I connected it to the PC. By pulling out and putting back in the memory card, problems could be solved. So I believe my case should not be a general case for this camera. It must be caused by the bad connection between the card connector and the memory card. I guess I'm just not lucky.", "Date": "December 28, 2009"}, {"Title": "Solid, Economical Camera", "Author": "DeoDuce", "ReviewID": "R9491B8Y4LH5F", "Overall": "5.0", "Content": "I bought this camera in July 2010. I wanted an affordable camera that was easy to use but that also took high-quality pictures. This is the camera I was looking for. It's super lightweight so I can stow it in my purse. It is very easy to use except for the USB computer transfer. I read the instructions thoroughly but could not figure it out, but I am not a computer person. I just take out the SD card and pop it into my laptop to transfer pictures so it's not a problem for me. I really like this camera. It has been all over the country with me and no problems so far.", "Date": "June 1, 2011"}, {"Title": "Broken after less than a year.", "Author": "Consumer", "ReviewID": "R1M8QGN6BV9GVM", "Overall": "1.0", "Content": "Everything with the camera was great until about 3/4 of a year after I purchased the item. The camera roze upin the middle of a birthday party. The lens of the camera is frozen outward and will not retract. I liked this camera very much until it broke. I would not suggest buying this camera under any circumstance.", "Date": "April 13, 2011"}, {"Title": "Camera stopped working at the beginning of my vacation!", "Author": "Coffee \"Coffee\"", "ReviewID": "R17SPP9N93RN9Z", "Overall": "1.0", "Content": "My camera stopped working after about 100 pictures.  I thought it was the battery, but it seems to be fully charged.  When I turn it on, the shutter extends, retracts then extends again, then finally just shuts off.  I can review photos, but I can not take pictures.  I bought this product a few months ago form Amazon.com new to take on a 7 day cruise, and the camera stopped working day 2!!!!!  I am not happy!!", "Date": "August 23, 2010"}, {"Title": "This is a great little camera", "Author": "J. Lee", "ReviewID": "R1HWMCPXLBY921", "Overall": "5.0", "Content": "I research for months before I purchased it and it is just perfect.  It has everything I wanted.  My old camera was 3 megapixals and blurred every picture I ever took.  This one is 10 mps and takes gorgeous shots.  The video and sound are great for a digital camera.  I really didn't expect it to be as good as it is.  I have a little trouble switching back and forth from video to picture, but will get the hang of it.  Most features are so easy to find and use.  The only problem I have with it is that it is really easy to turn on.  I purchased a gps hard case to store it in as this keeps the botton from being pushed.  You will need a memory card.  I have a 2G and it seems to hold a lot.  It is really easy to load pictures/video onto my laptop to edit.  I really like the large viewing window.  I don't have to break out my readers to see what I am taking pictures of.  I know there are a lot of comments made by people with big expensive cameras talking about this being perfect for children, but if you are budgeted as I am and would like a really good camera, you will not be dissappointed.", "Date": "August 10, 2010"}, {"Title": "Great deal", "Author": "Ernest R. Decarlo \"Blue Streak\"", "ReviewID": "R35455LQX4G40G", "Overall": "5.0", "Content": "I think this is a great camera for the money.  I spent over $140 for a Nikon and this Polaroid has better video playback with the same still picture quality. Con: It's a little slow when taking the picture so you and the people that your photographing  have to be steady until it's finish. The USB cable to the computer didn't work but I use a USB flash memory card holder anyway so that was no big thing for me. Overall I'd buy it again...If it ever got stolen it wouldn't hurt so much as spending $150 to $300 for one.  Great for adults, and children for a first camera.", "Date": "August 5, 2010"}, {"Title": "Orange Polaroid", "Author": "Hilaree", "ReviewID": "R25UYN1O4TC6JY", "Overall": "4.0", "Content": "For the price, a pretty great camera.  There is NO way to use it withough a memory card (I think it took two pictures then was full) but it has a great picture quality, anti shaking button, and a huge screen on the back to preview photos.  I'm very happy with it!", "Date": "July 21, 2010"}, {"Title": "Amazing camera!", "Author": "Tie Dye Bagel", "ReviewID": "R15HXKK882H46J", "Overall": "5.0", "Content": "I love this camera! I got it today, no problems at all. I didn't even have to look at the guide to figure it out, it's that easy to use. Only thing is, it was a bit tricky to figure out how to delete a picture or take a video. But, no biggie, as the camera has many pros! First, LOVE the color. It is a bit darker than shown in the picture. The screen is HUGE! And the pictures are very clear and easy to see on it. I love all the different picture options, such as if you are taking a picture of something with text or a portrait; these are designed to take pictures of such. It is also a very fast camera. Great buy if you ask me.", "Date": "July 19, 2010"}, {"Title": "Nice camera", "Author": "thongseveryday", "ReviewID": "R3HI1Y3OEFQV8F", "Overall": "5.0", "Content": "I needed an easy to use, low cost camera that I wanted to take on my boat with me.  This one seems to fit the bill perfectly.  I have been impressed with the ease of use and the quality of the pictures.  Its cost was low enough that I don't need to worry if something happens to it.", "Date": "July 16, 2010"}, {"Title": "Good $$ for this great camara", "Author": "Jessica Bomgardner \"Jesssikta\"", "ReviewID": "R1JFP4W8KCBHS3", "Overall": "5.0", "Content": "This is a really good small camara,- Easy to use- Big Screen- Not blurry (I did tested, even running)- Great colors.- It's not slow taking pics, 1st focus then shoot- Inserted battery, with charger (no more AAA)On the other hand, the video is in the menu is not easy to get there. I know people that spend more than $250 and they take blurry pictures and are big camaras.This is a very handy, small, great quality camara, that takes very good quality pics, NOT BLURRY IT ALL.And less than $100 good value, don't forget to get a memory at least 4GB that gives you around 950 pictures of high quality. I would recommend it to everyone.", "Date": "June 29, 2010"}, {"Title": "Perfect little camera", "Author": "Julie Loisel", "ReviewID": "RPL0LGNND3ME8", "Overall": "4.0", "Content": "I just got it few weeks ago, I love the red eyes correction! I really enjoy the big screen and the fact that it is a small camera! This really cheap camera is perfect for my travels and events! It offers a lot of options to take pictures. And I love the colour!I am not a professional but I just needed a camera for the everyday life and the Polaroid is just perfect!", "Date": "June 8, 2010"}, {"Title": "nice camera", "Author": "Catherine M. Schmitz", "ReviewID": "R2T4RRD1AU4QYU", "Overall": "4.0", "Content": "I bought this camera for my 15 year old daughter. The price was great and the quality of pictures and video is great. She loves it and is having a fun time with her friends creating great memories.", "Date": "June 1, 2010"}, {"Title": "great little camera", "Author": "S. Osborn \"Mother of the Groom\"", "ReviewID": "R25WVYP1HNX0Q8", "Overall": "5.0", "Content": "I selected this cameral because of the price and the poloroid brand.  it has lived up to the name. It is easy to use and I love the antishake feature.  Also the blink detection that makes sure every one in the picture has there eyes open.  All in all a great little camera just wish it had the full user manual with it.  But it is easy to get as an online reference.", "Date": "May 30, 2010"}, {"Title": "Excellent!!! More so than Excellent!", "Author": "A. Berry \"Mommy of four 2010\"", "ReviewID": "RZ7VF63M9OD7F", "Overall": "5.0", "Content": "Great timing,and everything was just as it said, it was a present for my mother for mother's day, and she loves it, no problems, memory card worked perfectly fine in it, when I place it in, and all this for such a great price! I recommend this camera for anyone looking for a good quality,little camera, and the color of it is a real gorgeous orange! Plus my mom has real shaky hands, and it has the feature for that, she is 61 yrs. old and that does help her a lot! Now bought me one, no problems with it, it is better than my Kodak Easy Share, me and my mom love love love this camera, don't care what other people think about the camera, it works to my needs and my mom's it is so clear, and easy to figure out, not one problem on this camera and I have bought two, me and my mom love the camera a lot, so many features, some that the Kodak doesn't have!!! I don't understand how so many people have had a problem with this camera, unless they just are not using good SD cards or they don't read to set it up, which is something I didn't have to do, it is self explanatory just by looking through the menu, if you are having trouble with it read the instruction, I mean seriously come on now, it is way to easy lol, not trying to be rude, though it sounds rude, sorry if I have offended you, but the truth is what I wrote, so I'm not sorry for that!", "Date": "May 7, 2010"}, {"Title": "Not a great camera but the seller was worse", "Author": "Momof61977", "ReviewID": "RPS750RSDSDSP", "Overall": "1.0", "Content": "I bought this camera from Amazon and actually Amazon has ripped me off repeatedly, I wont be shopping with them anymore unless Im 100% desperate. They are no help whatsoever. I bought this camera it came with the wrong charger wrong battery wrong everything....it was a mess the seller gave me a $20 refund to buy those items myself which ended up costing much more but whatever. The camera one day out of the blue stopped working I sent it to Polaroid because its under warranty. Well come to find out this suposed new item I was sold from AMAZON's 3rd party seller had tampered with the camera and made the warranty invalid. Although they claimed it was new. I contacted Amazon they said there was nothing they could do that I should contact THEIR 3rd party seller. They were aware of the first issue but didnt care. I contacted the seller who is New Harbor they didnt respond. So if you buy this camera go directly through Polaroid they will atleast fix the problem because if they sell you a defective camera they will take responibility. Amazon and NEW HARBOR dont care and will rip you off. The overall quality of the camera was ok but they do have nicer ones. I would stay in the T series but not this camera.", "Date": "August 14, 2010"}, {"Title": "Nice when it works", "Author": "Dr. Thomwu \"Thomas\"", "ReviewID": "R34DBMLYHCESUJ", "Overall": "1.0", "Content": "I have had two of these in the past two weeks, and just sent the second of them back -- one return per week.  I will say that AMAZON returns is simple, fast, and free to AMAZON Prime members; I already got the refund on the first return!  Turn it on, listen to the lens emerge making an odd grinding noise, marvel at the large screen filled with a clear picture quality, try to operate the zoom (more grinding), finally, turn it off -- the lens stays out, and will never go in again -- go ahead and turn it back on all you want - it makes a few beeps, and then happily announces \"Goodbye\" - the only goodbye is sticking it back in the box, and returning it.  It was a great price ($59.99), but if it isn't going to work, what good is it?  This camera won't get a \"3rd times the charm...\".", "Date": "May 15, 2010"}, {"Title": "ArcSoft Digital Camera Software", "Author": "Carol", "ReviewID": "REK077TFC0Z6N", "Overall": "1.0", "Content": "The Camera is great to use even for my grandsone who just turned 4.HOWEVER don't install the ArcSoft software that comes with it on your computer. It took over mine and I can't get ride of it. And so for the company has been of no help and it has cost me over $100 in tec service try to solve the problem", "Date": "September 17, 2010"}, {"Title": "Polaroid t1031", "Author": "Elizabeth Wang", "ReviewID": "R1OT2WPDI4J9ZX", "Overall": "4.0", "Content": "For the price,  I am very happy with this camera.  I'm am no camera expert but I feel that the resolution was very  clear, I could use some of the pictures for my drawings. The camera is great I have owned it a while! I had my friend take some pictures of me competing in a drawing contest. The pictures turned out very nice! Especially for the price this camera is a good DEAL! I was just gonna use it for just hanging out with friends and photographing my drawings, but I might use it for more.", "Date": "September 2, 2010"}, {"Title": "used it 3 times", "Author": "ddude", "ReviewID": "R2DWRDLM2H9YY0", "Overall": "1.0", "Content": "I have had the camera for 2 months. I have used it 3 times. Now it will not turn on.  and yes the battery is charged.:(", "Date": "August 28, 2010"}, {"Title": "not worth purchasing", "Author": "emjearl", "ReviewID": "RCL4VIFTZKPI5", "Overall": "1.0", "Content": "I had the same problem I noticed other reviewers complaining of. After about a week the camera just stopped working. The lens gets stuck in the open position and refuses to turn back on. At first I was able to push on the lens, make it close and go back into the camera. It probably \"worked\" for another two weeks if you were gentle and patience with the device. Now it seems beyond repair. The lens is stuck half way out with the shutter open. The picture quality was great while it worked, but we only got to take picture twice before the problems begain.", "Date": "August 16, 2010"}, {"Title": "It's Awesome But the Battery Stinks!", "Author": "elainethegreat", "ReviewID": "R4AJ92XTVX4RJ", "Overall": "5.0", "Content": "I ordered this camera because I was needing to upgrade the one I currently own and I trust Polaroid. The price was reasonable and the product sounded superb...I loved the fact it was a 10 mega pixel camera and the LCD screen was huge! I was ecstatic when I finally received it and started using it. There are plenty of great features and the menu is fairly self-explanatory. The pictures are of excellent quality, too...I can't believe how crystal-clear they turned out! In addition to this, you have the option of changing the screen size, something I was not able to do with the other 2 cameras I owned, and it can be fun. I also purchased a 4 GB SD card as a bundle package with this camera, so I have well over 3,000 pictures left even though I've already taken 100 (I've had the camera for about 2 months).  The only complaint I have? I've noticed this stated by other reviewers, too. The battery life is HORRIBLE! When I'm taking pics quite a bit, it only lasts a couple of hours, and that's on a full charge. I then have to charge it with the battery charger that's included, but to get the battery completely charged takes a few hours. SUCKS!! So if you're looking for a camera with a good quality battery, don't buy this one! Spend the extra money and buy a Nikon or something comparable.  Other then that, though, it's perfect! I'm overall satisfied with my purchase.", "Date": "August 14, 2010"}, {"Title": "Super camera", "Author": "normal", "ReviewID": "R1BSRP9BV5FZPX", "Overall": "5.0", "Content": "I love this camera, I'm 73 and it is so easy for me to operate, takes great pictures, and slips into your pocket or purse. I carry it with me and have taken dozens of pics in the last month.", "Date": "August 8, 2010"}, {"Title": "Polaroid t1031", "Author": "Shawn", "ReviewID": "R1DUT3NO21CQE4", "Overall": "5.0", "Content": "The camera is great I used it for the first time this weekend! I had my buddy take some pictures of me competing in a triathlon. The pictures turned out great! Especially for the price this camera is a TOTAL DEAL! I was just gonna use it for just hanging out with friends, but I might use it for more. I'm an art and design major and the resolution was very crisp and clear, I could use some of the pictures for my art work.", "Date": "August 5, 2010"}, {"Title": "Buy the SquareTrade Warranty!", "Author": "Jacey's Mommy", "ReviewID": "RUJEC23TL0AK2", "Overall": "5.0", "Content": "This was a great camera. Excellent pictures and features. But, within a few days of receiving it the camera broke. It would turn on, focus, unfocus and then turn off. I called Polaroid b/c there was a 1 year warranty in the box. It was bought brand new from Amazon.com however, it was sold by DBROTH fulfilled by Amazon. I didn't realize this at the time. According to Polaroid this not an authorized reseller so they will not repair it at all. What?!So I contacted Amazon.com they are taking it back b/c it is within 30 days. I bought the SquareTrade warranty at the same time. It was easy to cancel it and receive a refund. However, if this had happened outside of the 30 days I would have had no recourse. Moral of the story: Buy the SquareTrade warranty. Polaroid will not honor their warranty if you buy it through Amazon. You can always cancel it if you don't need it.", "Date": "July 28, 2010"}, {"Title": "Wish I had one 4 myself!", "Author": "Rick", "ReviewID": "RBLTTQOTS1XDD", "Overall": "5.0", "Content": "Bought this for my daughter (12); this is the best digital camera, ever, and the price was amazing ($69, which was anywhere from $10 to $60 less than every other retailer)...You cannot beat the quality, the fact that it has 10 megapixels is amazing!  It has a rechargeable battery so you never run out of AAs or AAAs or whatever and don't have to buy Energizers or lithiums or whatever for $4 - $5 each - ever again! Also, it's a Polaroid! that say it all, Polaroid practically invented the instant camera (along with Kodak).  Cool color.  You will definitely need a 2, 4 or 8 MB SD card (not included) but this is true of every digital camera nowadays.  They cost $9 to $25 at Meijers, Walmart, etc.", "Date": "July 8, 2010"}, {"Title": "Great Camera for a Great Price", "Author": "Michele Bowers", "ReviewID": "R2TKEJJH48PP4L", "Overall": "5.0", "Content": "I almost didn't buy this camera based on a few of the reviews. But I am glad I did! The user manual is on the disc in the box. I did need a memory card but I could take 32 pics on the camera itself without the card, now with a 4G card I can take 11,000 on the VGA setting. I have had nothing but fun with this camera. It takes great quality pics and video. Fairly easy to use if you read the instructions first. I haven't played with all the features yet but I love the large view screen. I would recommend this camera to anyone.", "Date": "July 2, 2010"}, {"Title": "A fabulous camera at a great price", "Author": "Julie A. Butler", "ReviewID": "R5C6RF7ZWZS5Z", "Overall": "5.0", "Content": "It has so many features for the money.  It is a famous brand so you know you're getting quality.  Good menu functions, so versatile.", "Date": "June 28, 2010"}, {"Title": "Polaroid t1031", "Author": "KS Doc", "ReviewID": "R3U8G486HR9RHI", "Overall": "4.0", "Content": "Purchased for 8yo daughter.  She has been able to easily operate the camera.  The picture quality is very good considering the price level and the pics look better than the $90 Kodak she had that lasted 2 months (dropped from approx. 5 inches from the floor - it was toast).", "Date": "June 5, 2010"}, {"Title": "Polaroid T1031 10mp Digital Camera", "Author": "M. Stewart", "ReviewID": "R15Z1NBFOG22EA", "Overall": "5.0", "Content": "Amazon is the best!Great camera for the price, and fast shipping!Super easy to operate, clear written instructions.With free super saving shipping, It just doesn't get any better.Thanks Amazon!", "Date": "May 26, 2010"}, {"Title": "Grr", "Author": "M. Kitchel \"Sorry, Coca Cola, I switched team...", "ReviewID": "R1HSAS33ZAI1ND", "Overall": "1.0", "Content": "Read the other negative reviews. It's all happened to me, too. I'm one of those people that never had a computer crash, never got the ring of death on my xbox. So i don't usually listen to the negative comments too closely. This camera sucks. Of course to stops working on the day of my best friends wedding. I'm irate. This was probably the 4th time I had used my camera. Worked just fine the week before.", "Date": "July 17, 2011"}, {"Title": "Stop Working after 3 months", "Author": "Victor Alvarez", "ReviewID": "RC1A7U7QHCEHH", "Overall": "1.0", "Content": "I bought this camera by july 2010, and 3 months after it got damage nobody gives me a fixing reason, and in all shops they just say those types of cameras cant be fixed due to lack of internal parts...Not a good choice", "Date": "April 27, 2011"}, {"Title": "Good Camera but read instructions throughly!", "Author": "JC", "ReviewID": "RG3DQNXDTMNGK", "Overall": "4.0", "Content": "The pictures are very clear but be sure to read the instruction manual. It's a tedious read but necessary. I didn't read it completely & have dozens of approximately 05-20 seconds videos. When I tried taking pictures in poorly lit rooms they didn't come out at all. I'd no idea where flash was. Overall, well worth the price!", "Date": "December 2, 2010"}, {"Title": "Love This Camera!!!", "Author": "James Willette", "ReviewID": "R234QV184LFXVO", "Overall": "4.0", "Content": "I've owned this camera for almost a year now and I absolutely love it.  I just recently had the battery die on me (this weekend- ugh) so I have to get a new one but I use this camera all the time. I take tons of pictures, tons of videos, and I absolutely love it.  The only thing I don't really like is, because I use it so much, I would prefer just regular AA batteries instead of worrying about having to charge the battery that it comes with and then as i said, i need to replace the battery and i can't just go to the store and buy AA's. But thats it. Other than that, great camera!", "Date": "November 1, 2010"}, {"Title": "No wonder it was cheap.", "Author": "supertennis", "ReviewID": "R3NAGUQZOB386Q", "Overall": "2.0", "Content": "I've had this camera since June.  I liked the color and the price was good, but since I got it I've had problems with picture quality and I've been putting it down to this or that, telling myself it must be my fault - handshake or some other reason.  I keep trying to fix what I think are issues with my picture taking but really, it's the camera.  It's as if my hand was shaking when I took a pic, but this week I've been using my phone (BBerry) camera instead and it's giving me awesome results so now I know that it's this camera and I cannot rely on it.  Unfortunately, it's over the time to return it, so I'm trying to prevent others from making a mistake with it the way I have. Spend more and buy a better one - it'll save your time and precious memories!", "Date": "October 24, 2010"}, {"Title": "Great for the price, with a few drawbacks", "Author": "Geminica", "ReviewID": "R3C90MZYHKAZWL", "Overall": "4.0", "Content": "My last camera failed at a moment when my budget was paper thin, and I replaced it with this Polaroid because it seemed like the cheapest option that would get the job done.  It's worked quite well!  I like the picture quality, and it's pretty easy to use - with some drawbacks.Pros:Good qualityGreat orange colorBasic functionality all worksCons:Makes a harsh whirring sound upon on/off and use of the zoomTrying to do extreme close-ups is a messy mix of standing far enough back for the focus to work and then zooming in as far as you canThere's no info in the quickstart manual about charging the battery, and I found it was not obvious.  The battery has to go in the charger backwards and it takes 2 hours to charge.But I'm happy with this camera - for the price, I was expecting to put up with worse problems.", "Date": "September 22, 2010"}, {"Title": "Second purchase of this camera", "Author": "darkandtwistylibrarian", "ReviewID": "R2O2BEB0EMMO2I", "Overall": "5.0", "Content": "This camera was a big hit, it has come down in price so when we needed another camera we bought the same thing again!", "Date": "September 19, 2010"}, {"Title": "Good camera, great price", "Author": "Em", "ReviewID": "RL4TW5PHCRS8H", "Overall": "5.0", "Content": "This camera is a good one. We bought it to go on a trip to Vancouver, British Columbia. The pictures are nice and compare with my other $300 camera. The bright orange color is cute and makes it hard to lose and easy to find. The screen on the back is huge, great for those who like to see the whole picture in front of them. We haven't done much with the video yet. There are simple settings and buttons but all of the basics are covered. We got some really fun black and white shots with this camera.All in all it's a great buy. Definitely recommend to the point and shoot crowd or someone who just wants a camera to capture everyday/vacation shots.", "Date": "September 11, 2010"}, {"Title": "Perfect!!", "Author": "Leekyducky", "ReviewID": "RF0AKNCDFA9PW", "Overall": "5.0", "Content": "this camera is amazing!! i love it! if you are looking for just a simple cheap camera that takes amazing pictures then you found it because this camera is awesome! :D i bought this so i could take pics on all my vacations and so far i have taken 1,200 pictures! it is so easy to use, all the settings are excessable by just one button! definatley would recomend it! :D", "Date": "September 6, 2010"}, {"Title": "Excelent Deal!", "Author": "McGabison", "ReviewID": "RVS17MPRBTS30", "Overall": "5.0", "Content": "Sometimes you might think that purchasing something cheap would turn out to be unfunctional (as usual) but I must admit this Polaroid breaks the scheme on this one! Very good camera, nice resolution, very functional, great features. Only thing, as some have already mentioned it is kinda slow when it comes to taking a shot, anyhow thats nothing to worry about unless your willing to use this camera for professional purposes (which is not its use).", "Date": "August 28, 2010"}, {"Title": "Excellent", "Author": "T. K.", "ReviewID": "R7C5VG8R8ELA9", "Overall": "4.0", "Content": "This camera was shipped quickly and efficiently and does everything I need it to do. Has a ton of HD settings and the battery lasts a good while. The only complain I have about it is the timer. You have to go through several menu options to access the timer, which only comes in 10 second form, and every time you take a new picture you have to go back through all the menus and turn it on again. It would be better if the timer stayed on for all the pictures you take until you go back through and turn it off.I've now had this camera a couple years and it still functions just as well as it used to, even if it is now sort of out of date with how high the megapixels are on new cameras.", "Date": "August 27, 2010"}, {"Title": "good camera", "Author": "David, now in Texas \"David\"", "ReviewID": "RUL96HCPC2WI6", "Overall": "4.0", "Content": "So far, I'm pleased with this camera.  My only complaint is that it has enough internal memory to hold (drum roll.........) 2 pictures.  You MUST buy a memory card to use it.This reminds me of the quip attributed to Lee Iacocca, who said that an accountant's idea of cost cutting was to saw two inches off the tailpipe every year.  The same accountants must be working at Polaroid these days.  I mean, really, guys enough memory for 2 pics?Buy a memory card. The camera itself is fine.", "Date": "August 13, 2010"}, {"Title": "Fantastic 1st Camera", "Author": "Lance \"The Man of Stature\"", "ReviewID": "RNQS5EZKN3TLJ", "Overall": "5.0", "Content": "I purchased this camera for my vacation to Canada and it has not disappointed me.  It is very simple to use and for a relatively inexpensive camera it takes great 10 MP photos.  The pictures are crisp and clear and the videos are not too bad at all.  I can't comment on the features too much since I've been using it just to point and shoot so far, but I'm sure once I do I will be even more impressed with this gadget.  The orange colour is very attractive and pleasing to the eyes.  If you're looking for an affordable camera that can deliver the goods of a high end one, then by all means purchase this one.", "Date": "August 10, 2010"}, {"Title": "Great and Easy to Use", "Author": "Lovemechu", "ReviewID": "R1HATBJ5LV5A9C", "Overall": "5.0", "Content": "I'm 15yrs old and when I got my package today i opened to see my polaroid box and opened it..This camera is very easy to use and have many features like hd pictures to different colors to takeyour pictures and more.I WILL RECOMMEND THIS CAMERA TO ANYONE WHO WANTS ONE OR IS GOING TO BUY ONE.", "Date": "August 9, 2010"}, {"Title": "Good quality, slow in reading the memory card", "Author": "Katz", "ReviewID": "R2LEMF1QBOJKR6", "Overall": "4.0", "Content": "It's a good camera, it has a good quality lots of options to choose. the only small problem is its slow when it comes to reading the memory card.", "Date": "August 5, 2010"}, {"Title": "Perfect for Me", "Author": "J. Medina", "ReviewID": "R8QRE529XLDGB", "Overall": "4.0", "Content": "The camera is great, I love the ease of using it and my pictures come out wonderful, even the ones of my kids moving every where.  The color is not my favorite because it is so bright everyone knows when you pull it out, but for sure I can't loose it with a color like this.", "Date": "August 4, 2010"}, {"Title": "Camera", "Author": "Matthew", "ReviewID": "R1TFE0HK5H4QQH", "Overall": "4.0", "Content": "It is what it is.  This camera does not claim to be top of the line and does a very good job compared to price.  You get exactly what you pay for and for my needs this fits just perfect as a travel/expendable camera where i am not afraid to bring it along for fear of breaking an expensive camera.", "Date": "August 2, 2010"}, {"Title": "Polaroid Camara (orange)", "Author": "Katrina Henson", "ReviewID": "R33HOKNQ27ABWK", "Overall": "4.0", "Content": "Like the color ! Like the picture !But the internal memory is very small !", "Date": "July 15, 2010"}, {"Title": "Easy to take pictures!", "Author": "Denise", "ReviewID": "RROO95VBSCSE5", "Overall": "5.0", "Content": "I'm very satisfied with this digital camera. I recommend it for everyone. It's easy to take pictures and the images are very beautiful.", "Date": "July 6, 2010"}, {"Title": "Awesome camera!!", "Author": "Pat Ann", "ReviewID": "R2G096OUET0ZZJ", "Overall": "5.0", "Content": "We bought this for our son for his summer field trip and he really liked it. The pictures are great and it's so easy to use,I highly recommend this camera especially for a first time user(s).  The picture clarity is wonderful and the video is too.", "Date": "June 28, 2010"}, {"Title": "Great Camera", "Author": "R. Frederick", "ReviewID": "R4X9K2SFQGXGH", "Overall": "5.0", "Content": "I was a little hesitant at first, because of the low price. Very nice camera, very easy to use. Rechargeable battery is great!. Color is super cool. Buy this one!", "Date": "June 17, 2010"}, {"Title": "Great point-and-shoot", "Author": "Stephen L. Lacienski \"stephen\"", "ReviewID": "R2FU9PTS8W8DSX", "Overall": "5.0", "Content": "Great little camera with great display, a decent macro setting & fantastic picture quality. Probably the best point-and-shoot I've used.", "Date": "June 16, 2010"}, {"Title": "Good little camera...", "Author": "lostintexass", "ReviewID": "R1MNK5QG2HIH9P", "Overall": "4.0", "Content": "This is a good little camera for the money... I had a vivitar that I paid twice the price for a few years back that took crappy pictures.. I'm still learning this camera, I've had it a month now.. I've taken 100 or so pic's & 2 video's and have only had two blurry pic's. The manual is on a CD, I wish it came with a hard copy of the manual. The rechargeable battery beats buying throwaways, and only takes two hrs to charge...Yes I would recommend this camera to friends & family..", "Date": "June 15, 2010"}, {"Title": "Good...for the money, not the best though.", "Author": "P. Leonce", "ReviewID": "R3HJQUAJICPU0U", "Overall": "4.0", "Content": "The camera is definitely great for the basic = point and shoot.  It comes with some good options and bells and whistles but they are really hard to figure out.  The camera does not come with any comprehensive manual; just an insert on how to take and download pics.  No real explanation on how to navigate settings.  And the battery life isn't great.", "Date": "May 4, 2010"}, {"Title": "Spare Battery", "Author": "mycutetots \"Laura\"", "ReviewID": "R9HK4PX8RU9WK", "Overall": "4.0", "Content": "Amanda, I was doing some research and found it on Amazon by a third party seller. The extra battery is a EPMUSA-800MAH model. I am buying it pretty soon but I have not yet tried it on my new camera. You might want to wait until I try this one before getting yours. I will let everyone know how it works. Hopefully I will not be disappointed.", "Date": "July 31, 2009"}, {"Title": "World Distributors were AWFUL to deal with!", "Author": "K. Proffitt", "ReviewID": "R2GBL0ULIXCSSN", "Overall": "5.0", "Content": "The product was great- when I received the camera the button you press to take pictures was loose. I wanted to exchange the camera for another just like it, just to find out World WIde Distributors is NOT an official seller of poloroid cameras. I called over seven times- they never did what they said they would do, I had to ask repeatedly. Finally after threatening to contact Amazon they sent a shipping label and accepted the return with a full refund. VERY FRUSTRATING!", "Date": "September 11, 2009"}, {"Title": "great clear pictures", "Author": "amanda \"mandaz3\"", "ReviewID": "R1THPWEJCBIA6O", "Overall": "4.0", "Content": "I bought this camera 2 months ago. I love it but only have one problem....the battery. You must take it out a charge it on the battery charger. It takes a while, but cannot find a spare battery to buy anywhere. It's not a regular battery and not just anywhere sells them. I have looked on polaroid website and nothing. So if anyone can help me find a spare one to keep charged I would appreciate it. thanks", "Date": "March 10, 2009"}, {"Title": "Junk. Broke Immediately", "Author": "jmy714", "ReviewID": "R39OI5TCUSYOCU", "Overall": "1.0", "Content": "This is Garbage. Lens broke almost immediately. Charger is is weird. It's sitting in the back of a drawer someplace.", "Date": "December 1, 2013"}, {"Title": "Returned", "Author": "Happy", "ReviewID": "R3LLYCG73WZ2L8", "Overall": "2.0", "Content": "Such a disappointment!  I bought this right before my brothers wedding and ALL of my photos turned out blurry and out of focus, no matter what setting I used. I even tried hooking it up to the Photographers tripod and still didn't get a clear photo. Returned this and bought a Sony like my previous camera.", "Date": "February 21, 2013"}, {"Title": "Meh", "Author": "Jade Funk", "ReviewID": "R2L1YKF00BRKRS", "Overall": "3.0", "Content": "This camera was okay. It has about the same quality as a disposable so I think it's overpriced. The color is cool though.", "Date": "February 20, 2013"}, {"Title": "Worst Camera Ever", "Author": "Shawn A. Wears", "ReviewID": "R1GJKYQG22WEBN", "Overall": "1.0", "Content": "Battery hardly ever worked. Bad buy! It worked for 2 weeks. Just getting around to writing poor reviews.Not worth time or money!", "Date": "January 13, 2013"}, {"Title": "This is Great!", "Author": "tkgrma \"Debbie\"", "ReviewID": "R1X2DM9VSZS49Q", "Overall": "5.0", "Content": "Guess what I've had this a yr or more so far ...little behind on the review. But I figure it lets ya know it at least lasts! I've taken this to all fun occasions. Easy to use. I found to put it on the Record thing at the person with the sun behind. seems to work very well on that one. Love the shake button, leave it on all the time. Pictures are very nice and clear! I do remember it coming quickly and great condition.", "Date": "December 26, 2012"}, {"Title": "excelente equipo", "Author": "neonitro", "ReviewID": "R3QSFNLZ1S9V0Q", "Overall": "5.0", "Content": "buen equipo, excelente funcionamiento era lo que esperaba, lo recomiendo 100 % es de buena calidad y muy buen acabado", "Date": "December 15, 2012"}, {"Title": "did great at first, then broke", "Author": "Possum Trot \"Possum\"", "ReviewID": "R2UFNWP0JP2VGC", "Overall": "2.0", "Content": "This product did well at first, easy to use, really enjoyed it.Then, it just died after about 18 months.", "Date": "November 16, 2012"}, {"Title": "I've had this camera for 3 years.", "Author": "TNTSIERRA", "ReviewID": "R80SF4ETNUF76", "Overall": "5.0", "Content": "Now that I have lost this camera I am really missing it :-(  I had the camera for 14 months when the screen went out but I know I had dropped it numerous times so I wasn't shocked when it broke. I had it fixed for $30 and for the past 2 years it had gone camping, to the beach and everywhere in my purse. Never without it. It has survived numerous 3-5 hour fast paced horseback rides being banged around in a fanny pack. I love how compact it is and the battery life is very good. Easy to transfer images to my computer. Great camera for a great price. I would and probably will buy it again.", "Date": "November 12, 2012"}, {"Title": "Not meant for low light", "Author": "Reese", "ReviewID": "R1TXUIV3LHKWWH", "Overall": "3.0", "Content": "While this camera takes great pix with plenty of lighting, it is not really meant for indoor events where lighting is bad. Unless you have a completely still setting - I have some neat nighttime shots using the apeture setting, where it looks like daytime in the backyard.I have mostly used the camera to capture memories of my children's sporting events, but even the team shots come out poor because of indoor lighting - using a flash doesn't help.", "Date": "March 12, 2012"}, {"Title": "There are better cameras out there", "Author": "Kathy Grey", "ReviewID": "REV43AGECBIS1", "Overall": "2.0", "Content": "This camera is OK, but images can blur easily. I ended up giving it to my child so she can start taking photos. She likes it.", "Date": "January 29, 2012"}, {"Title": "Pretty good camera for its price.", "Author": "E. Santiago", "ReviewID": "R12NNIAU6HTFB0", "Overall": "4.0", "Content": "It's a pretty good cheap starter camera and it takes some good pictures. However the battery life isn't that great but it is a rechargeable battery so I guess that sort of makes up for it somewhat. The pictures like I said are pretty good but this camera doesn't really have image stabilization so you need a good steady hand as the simplistic movement can make the picture seem a bit blurry, nothing life changing but you will be able to tell when you moved a bit from when you didn't. It's very easy to use even for somebody technologically challenged and the pictures have pretty vibrant colors.However I can't stress the \"for its price\"(I got it for $50) part enough. If you have other options/deals check them out first and research them through.", "Date": "November 9, 2011"}, {"Title": "broke after 1st drop", "Author": "lzamudio(oregon)", "ReviewID": "R1YLHFIWGD4DNT", "Overall": "1.0", "Content": "took amazing quality pictures but very fragile my wife dropped it only about 2 feet and the whole screen shattered and the lens bent do not recomend if you drop things constantly", "Date": "August 19, 2011"}, {"Title": "Good camera, broke after 1 year", "Author": "Swagger Wagon", "ReviewID": "R2EVLDLZ1H4FD8", "Overall": "3.0", "Content": "Within a few weeks of the 1-year warranty expiring, the outer shutter began to stick and the auto-focus started to have serious problems.  Polaroid customer service was not willing to do anything for me, since it was past 12 months from the purchase date.  They did, however, try to sell me another Polaroid camera to replace this one.  I thought that was funny.Outside the durability issue, I did enjoy using this camera while it lasted.  It is not the best out there, but it fits in my pocket and it has a few manual options that most point-and-shoot cameras do not have.  It would have been well worth the $65 I paid for it (new) had it lasted longer.Pros:- Small & lightweight- Large viewfinder- 10 MP resolution- Relatively wide range of manual options for an inexpensive P&S;Cons:- Durability- Moderate shutter lag- In lower light conditions, the \"Auto ISO\" setting does not set the ISO high enough.  I have to manually set the ISO to 800 or 1600 to get a reasonable shutter speed in even moderately low light.- Resets to default still picture settings when you switch back and forth to video mode- No dedicated button for video mode, you have to go through the menu to switch between video and still shots- Non-standard battery and no on-board battery charger, which means you almost have to buy another battery and haul around the custom charger that comes with the camera- Insufficient low-end shutter speed for long-exposure night shots- Not impressed with Polaroid customer serviceI bought this case for the camera, and have been very happy with it: Case Logic TBC-302 Ultra Compact Camera Case with Storage (Black)I am using this SDHC memory card, and I am happy with it too:  Transcend 4 GB Class 6 SDHC Flash Memory Card TS4GSDHC6EI also bought this spare battery, which has been adequate but not great:  iTEKIRO 800mAh Replacement Battery for Polaroid t1031 t1035 t1234 t1235 Digital Cameras", "Date": "August 4, 2011"}, {"Title": "Had it for Less than a year, BROKEN", "Author": "Aimee Freudeman", "ReviewID": "RJQH1QRJ9UOI3", "Overall": "3.0", "Content": "Got this cute camera for christmas of 2010. It's June 1st, 2011, and my camera is broken. I didn't handle it roughly, expose it to the elements, get it wet, or misuse it in any way. The display is almost pure white, with streaks running vertically. I'm NOT happy. I'm going to try to contact Polaroid today and see if I can get it repaired free of charge.Before the break: Perfect camera. Easy to use, multiple setting for pictures, including an 'auction' format, decent video quality, and awesome portability. Now? JUNK.", "Date": "June 1, 2011"}, {"Title": "good camera", "Author": "Mariano Andres Sanin", "ReviewID": "R1D7OFDONHMJ4F", "Overall": "5.0", "Content": "This is a good camera, easy to use, good size to have it in the pocket and the picture's quality is awesome for a low price camera.", "Date": "January 21, 2011"}, {"Title": "Nice camera", "Author": "minds", "ReviewID": "R20T4IYOSQB6OA", "Overall": "5.0", "Content": "We bought this camera for our 12 year old. This is a solid well built camera, pictures are great and the video is good.Great camera for the price.", "Date": "December 13, 2010"}, {"Title": "Great camera for the price", "Author": "Angiec217", "ReviewID": "R3SHHHL5B6LE5J", "Overall": "5.0", "Content": "I had always wanted a digital camera and when Amazon had this gem on sale at 1/2 off (I'm thinking its because it was orange because every other color was regularly priced) I scooped it up! I have not been disappointed!  Takes great pictures and has not let me down! The camera may be bright orange but the pictures are not! Great buy. I am extremely satisfied.", "Date": "December 4, 2010"}, {"Title": "worked great Until the lens stoped working", "Author": "jazycristo", "ReviewID": "R3SXVGUFMRAKXS", "Overall": "2.0", "Content": "This camara has very high quality picture takin. but the battery dies fast and now the lens wont work. its only been a few months to so i am very disappointed. good price, pic. quality but now i have to spend money fix it.", "Date": "November 23, 2010"}, {"Title": "AMAZING PRODUCT!", "Author": "kaitlyn", "ReviewID": "RI5MJI4PACXY8", "Overall": "5.0", "Content": "Absolutely love this camera, it is such an amazing quality camera for only 99 dollars. I reccomend this for all photography.", "Date": "October 29, 2010"}, {"Title": "Good for the price", "Author": "Mouvielle Caro \"Mouvielle\"", "ReviewID": "R158FOM8A5EBH0", "Overall": "4.0", "Content": "I got this for my mom who is 60 years old,it is easy to use and great quality for a grandma.", "Date": "October 23, 2010"}, {"Title": "Great first camera for kids", "Author": "JEB", "ReviewID": "R2980TPF6SMEWR", "Overall": "4.0", "Content": "Great camera for everyday use. You cannot get a better camera for the price.The battery is a huge plus and lasts a long time before needing recharging compared tomost cameras around this price that take AA batteries.", "Date": "October 21, 2010"}, {"Title": "good camera", "Author": "manuel alejandro rojas valencia", "ReviewID": "R3JYAJRMVMVDW7", "Overall": "4.0", "Content": "this a good amateur camera, it is good quality and good price. the performance is ok for its category. i am satisfy", "Date": "October 4, 2010"}, {"Title": "owner", "Author": "Lisa M. Ginn", "ReviewID": "R2PJ9JZXVMCJTH", "Overall": "3.0", "Content": "Just wanted to say that I was disappointed that the first time I went to charge the battery, it will not charge.  I have to buy a new battery for a new camera.  Kinda sucks!!!!", "Date": "September 23, 2010"}, {"Title": "Great, slim, lightweight cam", "Author": "heat1968", "ReviewID": "R3VN0S3BHGJVQW", "Overall": "5.0", "Content": "I bought this camera for my grandaughter who is always wanting to take picswith mine. She and her older sister LOVES to take pics. This is small and lightweight for their little hands.  I have seen pics taken with this camera and they are great! I wouldn't mind having it for myself!The only thing I don't like about it is, it uses one of those square funny looking batteries.  But, a charger was included, so that was great! I would recommend this camera for anyone", "Date": "September 18, 2010"}, {"Title": "Paid for 2 day shipping and never recieved", "Author": "Leisa Kijowsji", "ReviewID": "R16UWJKJ87L7GO", "Overall": "3.0", "Content": "I ordered 4 things and need the digital camera with 2 day shipping for a gift.  The wrong items were shipeed expedited not the camera that I needed. I will now have to buy a differest one and send this one back.  This is easy since I'am somewhat disabled and I have ordered from Amizon times.  I have tried repeatedly tries to contact the seller but I have gotten no response.", "Date": "September 17, 2010"}, {"Title": "Poor from the start", "Author": "Debbie Kelsen", "ReviewID": "R1Z8JMENXMTO2U", "Overall": "1.0", "Content": "This camera never took a decent picture in the 24 hours I had it. It went back the next day. The images were blurry and I was not happy with the zoom. I purchased a Nikon Cool Pix and am thrilled with the results. Save yourself some aggravation and don't choose this Polaroid.", "Date": "August 31, 2010"}, {"Title": "Love it", "Author": "A. Miller \"SAfred\"", "ReviewID": "R2U7451RJ49L23", "Overall": "5.0", "Content": "Photos are great. I use this at work, and the photos turn out great. Very user friendly. I love orange - so this was meant for me.", "Date": "August 30, 2010"}, {"Title": "Horrible camera", "Author": "CS", "ReviewID": "R2A2ECQZM09PDF", "Overall": "1.0", "Content": "I bout this camera about a week ago it came on friday and it was packaged very nice. i opened it and i took a pic and it was a good pic when u had the flash on , but if u didnt have the flash on the pics werent good. And the flash was realy bright it was blinding! the next day i went to take a pic of my cows and as i was walking back the lens wouldnt come out and i turned it on and it just made a grainy noise and then it just said goodbye. so i plaayed with it for a while and still no luck. the color of this is nice but the camera is very bad. i wouldnt recomend that any1 buys this.", "Date": "August 29, 2010"}, {"Title": "Pretty cool camera", "Author": "Amazon Customer \"Holla if u hear me!\"", "ReviewID": "R3L0F2AIHIPWMG", "Overall": "5.0", "Content": "I bought this for my brother and he loves it as its his families first camera. I am visiting him right now and have used the camera and its cool. Navigating through it isnt easy at first to use the menu items but you can figure it out if you havent read the directions. I love that you can zoom while video taping as my camera does not do that so I need to upgrade.", "Date": "August 26, 2010"}, {"Title": "GREAT", "Author": "SusieQ", "ReviewID": "R14GQ10H9SQ00N", "Overall": "4.0", "Content": "I bought this camera for my daughter for her 13th birthday and she loves it. She's in love with the color, how crystal clear the picture quality is, & how you can makes videos on it. Her older sister has a camera, and she is jealous of this camera! I would really recommend it!", "Date": "August 16, 2010"}, {"Title": "Future Photographer", "Author": "Amazon Customer \"I am a senior citizen living...", "ReviewID": "R2ITO54YIM4UYO", "Overall": "4.0", "Content": "I bought this for my 10 year old grandson and he is quite pleased with the ease of handling and the quality of photos.", "Date": "August 13, 2010"}, {"Title": "good general use camera", "Author": "Mary Crosby", "ReviewID": "R3D1B70QR52D0O", "Overall": "4.0", "Content": "Got this for my twelve year old daughter to use for vacation.  She uses it--alot.  With her old camera we were replacing AA batteries every few days because of the overuse.  This camera comes with a rechargeable battery and the battery charger!  She plugs it in every night to charge just like her phone.  I LOVE THAT!  Takes gorgeous portraits and the review feature is very easy to use.  Great \"workhorse\" camera.", "Date": "August 9, 2010"}, {"Title": "camera", "Author": "Sandy", "ReviewID": "R2G2AJVZD703N8", "Overall": "4.0", "Content": "This is my first digital camera, and I am very pleased with it.  However, a few of the pictures are blurred.  However, they were action photo's, so that may be the problem.", "Date": "July 7, 2010"}, {"Title": "Great extra camera...for a while.", "Author": "Horses and Cows", "ReviewID": "R16NWXZCH95KIG", "Overall": "3.0", "Content": "Bought this camera mainly to take close-ups for craigslist and e-bay items.  Works good for things that don't move but taking animal pics leaves a little to be desired.  The lag time (as mentioned in a couple other reviews) is a drawback to this camera.  It also has an annoying 'roger beep' that I haven't figured out how to turn off (will check dvd today).  I do like the display size, picture clarity and it's easy to use.  Overall, for my intended purpose and the price this is a good camera.Edit:  No longer available, but wanted to make a note of the problems I encountered with this camera.  Replaced the battery a couple times because the camera would freeze up after 2 pictures.  Then found you could jump start it by just taking the battery out and putting it back in.  That got old after a couple sessions, so it's in the junk pile now...", "Date": "July 5, 2010"}, {"Title": "Great camera for the price", "Author": "Kevin W. Smith", "ReviewID": "R3TTZYUIU8HRH5", "Overall": "5.0", "Content": "We bought this camera for my daughter.  She loves it and uses it all the time", "Date": "June 10, 2010"}, {"Title": "Great product!", "Author": "Michael L. Williams \"MDub\"", "ReviewID": "RCFXUX84U4G0N", "Overall": "5.0", "Content": "This replaced a previous purchase (same camera) that was dropped several times by a teenage owner.  She is a year older now and still loves this camera.  This camera is used daily (like I said, teenage owner) and it takes great pictures.  It is very easy to \"share\" these photos as well.  Great product!", "Date": "January 19, 2010"}, {"Title": "Could not delete photos", "Author": "Bonnie L. Coggins \"Bonnie\"", "ReviewID": "R8VQB2WFBS8V0", "Overall": "3.0", "Content": "I bought this camera for my boyfriend, but wanted to try it out before giving it to him.  The level of functionality would be good for him--some functions but not too many, and easy to navigate through them.  All the buttons seem to make sense.  The screen is clear and large.  The camera looks really cool.  I haven't uploaded any photos yet to see how they look on my computer.  The battery charger is kind of weird, and I don't like it as much as my Canon one.  For 1/4 of the price of my Canon, I can get over that though.My only big problem is that I can't delete photos!  Following the instructions in the manual does not delete them.  I'm sending the camera back, but I'm planning to reorder it, hoping this is just a problem with this individual camera.", "Date": "February 17, 2010"}, {"Title": "Great pics but disappointed in camera", "Author": "Mike D. Hardgrove", "ReviewID": "R1RX7DDSXPO0O5", "Overall": "3.0", "Content": "I purchased the camera for my wife to use to get some items on ebay.  The camera takes great pictures but when she attempted to download them to her camera the computer refused to recognize the camera. We had a family member who is a professional IT person stop by to help out.  He could not get the computer to recognize the camera.  The computer is a Dell and they wanted around $150 to just talk about fixing the problem (7 year old computer).  Polaroid has yet to respond to our request for help. Polaroid advertises that all you have to do is connect the camera to your computer and the computer will automatically recognize the camera.  It did.  It said it was connected, and that's where it ended.  Bad purchase on my part because it won't do the job I bought it for and bad purchase on my part because Polaroid won't respond to a request for help.  Mike Hardgrove in Tulsa, OK.", "Date": "August 2, 2010"}, {"Title": "I love this camera!!!!", "Author": "Stephanie Childers \"Stephanie\"", "ReviewID": "RELCJ12IW4NQI", "Overall": "5.0", "Content": "This camera is the best I have ever had.  The screen is very large so you can see the pictures you take very well.  The picture quality and the best also.  I just love this camera...", "Date": "May 29, 2010"}, {"Title": "portable & decent pics", "Author": "Luke Rad \"lz3broc\"", "ReviewID": "RYZ304ERZLIM", "Overall": "3.0", "Content": "my mom-in-law bought this camera for me, the Polaroid t1035 10MP for an early Christmas gift, it was a bundle pack with a Polaroid PoGo Instant Mobile Printer. I was very surprised. I have been wanting to get a new camera for many years. I had in mind what I wanted, but since this was a gift I am still happy to get something small and portable. My previous digital camera still works a Nikon Coolpix 4300 4MP. so going from a 4MP to a 10MP is a huge leap.As with my old Nikon, the one thing I dislike about this Polaroid is the proprietary battery. I really cannot understand why digital camera companies cannot come up with a standard system. I wish it would of used AAA or AA batteries. But now I need to go out and find from somewhere a compatible battery that I can use while the other battery is charging.Other than that the camera is very portable and I love the size. I am anxious about scratching the LCD so I need to go find a good cover for it as well as a good slim bag for the camera. I am happy the Camera uses SD memory cards. My old Nikon uses Compact Flash which I have always preferred. But I use several portable devices now that all use SD cards so I have a variety of SD cards at home to use.I am still charging the main battery so have not been able to snap any pics yet. I am hoping to use the video/audio feature and use the anti-shake feature and seeing how well they work. I wonder how large of photos I can go using 10MP. I never ever needed more than 4MP with my old camera as I rarely did any pics over 8 x 10.", "Date": "December 21, 2009"}, {"Title": "Not a durable camera", "Author": "Jennifer A. Tabor", "ReviewID": "R16CRZY1VSFRQ7", "Overall": "2.0", "Content": "I had to buy this camera when on a vacation and my old Kodak quit.  This camera didn't last 6 months.  Now the lens is stuck open and it won't take any more pictures.  I guess I'll go look for another Kodak.", "Date": "December 10, 2009"}, {"Title": "NOT Macintosh compatible", "Author": "janemaine", "ReviewID": "R3PWSVBLT7QT42", "Overall": "1.0", "Content": "Great little camera. Good quality. But, was not Macintosh compatible, could not use USB to hook up to my computer. Did not recognize the camera as did my flash drive. my external hard drive etc. Too bad! I loved this camera. Sold it to a friend w/a PC. I hope to find a similar camera here that I can use w/my Mac.", "Date": "August 13, 2010"}, {"Title": "Nice for the price.", "Author": "mary j \"MJWillShop\"", "ReviewID": "R1MX4WOE7SL9OQ", "Overall": "4.0", "Content": "I got this for a Christmas present so I don't know how well it works. I have had Poloroid before and had good luck with them. I love the color. I wish it had come in a box though. It came in the plastic holder to hang on wall so it kinda makes it look cheap. But if it will save a tree it's OK with me.", "Date": "July 27, 2010"}, {"Title": "mixed feelings", "Author": "Joseph O. Petty", "ReviewID": "R2K2GGVTCZ5NDY", "Overall": "1.0", "Content": "I bought this camera for a hiking expidition I am going to go on. Too bad the camera glitched up on me and it never going to work again. Guess you get what you pay for. I sent it back for my money back so I could get a better piece of equipment. A Kodak. It was a good camera for the less than two months that I owned it however I wasn't about to spend the money to fix something that just isn't worth it. I do not suggest this camera, take my advice and spend the extra $20 for the newer Kodak easy share 12.0 mega pixel. Its much more worth it. Besides, battery life just didn't set well with me. In order to take this trip I had to buy 3 other batteries to even hope to make it last long enough. By the way, these batteries are not the cheapest things in the world either. But now that the camera went to crap I have to return the batteries too, if they will even let me. Otherwise it was a giant waist of money.", "Date": "July 12, 2010"}, {"Title": "You get what you pay for", "Author": "Pwince \"Purple Eyes\"", "ReviewID": "R20TRM4QOX52I1", "Overall": "2.0", "Content": "Well 59.99 dollars for 10 mega pixel camera seems like a dream come true.But I will let you know here and now that you get what you paid for. This camera isn't all too stable.It sometimes freezes and won't operate unless I take out the battery or memory card.It can't even playback video files and gives me error messages. Quite often, pictures I take with this camera are blurry.This camera isn't reliable, overall in my opinion.If you got 60 dollars spend on cams, try and find other alternatives before considering this one.I guess you get what you paid for hm?", "Date": "May 26, 2010"}, {"Title": "NOT SATISFIED!!!!!", "Author": "Jen", "ReviewID": "RIUS8Y6UDLRQP", "Overall": "1.0", "Content": "I had the exact same camera and mine broke on Thanksgiving 2010 and i LOVED it, so i came home that same day and ordered it from this user above; However no package arrived. kept waiting and waiting and then finally got a email on December 9th from Amazon stating that the owner just canceled my order without my consent and there was no reason why they canceled it!!!!! SOOOOOO mad!!!!", "Date": "December 15, 2010"}, {"Title": "Excellent Performance!!!!!!", "Author": "Pedro Garcia \"Pedro Garcia\"", "ReviewID": "R2NQFORCP1CMSZ", "Overall": "5.0", "Content": "This is a Excellent Digital Camara,Esta camara a pesar de que es bien economica tiene un excelente rendimiento.Se las recomiendo.", "Date": "April 6, 2010"}, {"Title": "EXCELLENT LOVE THE COLOR.", "Author": "Zoraida Torres Diaz \"CHULA\"", "ReviewID": "R3VI9AXL1CBZKF", "Overall": "5.0", "Content": "LOVE THE COLOR ORANGE THAT IS MY FAVORITE COLOR I LIKE THE WAY IT WORKS IT'S EASY TO LEARN AND IT TAKES NICE PICS!!!", "Date": "April 24, 2010"}, {"Title": "Do not buy without the memory card.", "Author": "Richard Vidaurri", "ReviewID": "R3N3MUUVP0R5J6", "Overall": "2.0", "Content": "I bought this because I needed a camera that I could afford to have stolen out of the Jeep at any moment. But Polaroid, which used to be a respectable American company, has redefined the meaning of CHEAP.  The thing was good for two, count them, two, pictures before I had to stop and insert the memory card.  The battery does not fit properly into the charger, requiring that I wedge an old safety razor cartridge behind the battery in order to get the thing to stay in place and take a charge.  There was a time when an American company would not allow such a thing to leave the factory, no matter how low the price.  More Asian influence here.I've only had it a couple of months, so I can't speak to the durability of the camera.  The pictures are O.K. but I only use it for snap-shots.The only positive things I have to say about this camera are that it certainly is inexpensive (even when you factor in the memory card) and with its orange livery it has sex appeal. Women stop me all the time to ohhh and ahhh over the thing.  We're such a simple people.Richard VidaurriGuadalajara, Mexico", "Date": "July 31, 2010"}, {"Title": "Battery", "Author": "J. Young", "ReviewID": "R31V6G3GQZ4QAB", "Overall": "1.0", "Content": "Used the camera about four times and the battery went dead.  I hadn't used it in awhile and when I wanted to take a picture, the battery was dead!  I find it confusing to operate and would never recommend.Polaroid t1031 10.0 MP Digital Still Camera with 3.0 LCD Display (Orange)", "Date": "June 13, 2010"}, {"Title": "Haven't used it yet as I am getting the run around from the seller.", "Author": "1331carson", "ReviewID": "RQR6KOSKVGJT1", "Overall": "1.0", "Content": "I have yet to use the camera. The seller shipped it wothout the li-on rechargable battery. They tell me that they don't have that item. But might get one in. Offered a full or partial refund. I have left countless messages for the seller all week now, and Have yet to get a return call to get my money back. Polaroid 10.0MP Digital Camera with 3x Optical Zoom - Gray (CTA-01031S)", "Date": "March 25, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "10.0 megapixel resolution, 3x optical zoom, 4x digital zoom and 3.0¿ bright color LCD for previewing images before you shoot\nAnti-shake image stabilization, face tracking, smile and blink detection, red-eye removal\nTakes video clips with audio\nPolaroid PoGo Compatible\nIn the box: Digital camera, Wrist strap, Lithium-ion rechargeable battery, Battery charger, USB cable, AV cables", "Name": "Polaroid 10.0 Megapixel Digital Camera with 3.0-Inch LCD Display", "ImgURL": "http://ecx.images-amazon.com/images/I/41H7sLnCXgL._SX300_.jpg", "ProductID": "B001AZCKQ6"}}