{"Reviews": [{"Title": "\"Emergency Camera\" Works Great!", "Author": "P. Mellor", "ReviewID": "R1A5MIFGK2YEUK", "Overall": "4.0", "Content": "This camera arrived just a few days before a trip to Taiwan / Macau and I took the instruction book to read on the plane.  I'd damaged my previous camera (also a Kodak EasyShare) and although it had resumed working, I took this one as a backup.  It was great!  It held up through all sorts of weather and packing, took short videos when wanted, even had a \"museum\" feature that allowed me to take great photos in the Maritime Museum in Macau. It runs on AA batteries and lasts plenty long--all in all, I was very happy with it and with the quality of photos it produced.  Remember to use the ISO feature in the evening, get up close whenever possible for the sharpest photos, and unless you are shooting for a magazine, you'll probably be happy with it.  I am still using both cameras, have tons of good photos and video--", "Date": "February 7, 2009"}, {"Title": "Very nice Camera", "Author": "M. Burden \"misiekay\"", "ReviewID": "R19TCLOHJPUHY6", "Overall": "5.0", "Content": "Hi I just thought I would like to rate this camera because I read a couple bad things about it and they are probably the user fault not the cameras.  It has lot of options when it comes to taking pictures and also had lots of easier options for the people who are not that good at digital cameras. I also like the fact that you can crop rotate and enhance your pictures right on the camera instead of downloading them and doing them on another program.  I love the color. It also came with a battery charger and the batteries have lasted above expectations. Someday though I hope to use this camera for all of it abilites there is a lot of thigs you can do.", "Date": "December 21, 2008"}, {"Title": "I Love It!", "Author": "Moncella", "ReviewID": "R3KMGZ3ZSZLTBN", "Overall": "4.0", "Content": "I love this little pink camera from amazon.com. It helps you to take great pictures. I would give it five stars but it eats batteries and mine has the + and - in the battery compartment in the wrong place. As others say invest in rechargable battery. I have Duracell power pix now but the kodak website gives you a 10% discount on the rechargeable ones for being a new customer when you register the camera. You can not hear video sound from the camera but when you put the videos on the computer you can hear the sound very good and for a mother of a 7 month old it is very exciting to catch your child saying momma!! I hope to get her first steps also.", "Date": "December 7, 2008"}, {"Title": "Batteries cost more than camera!", "Author": "gr8kidzmom \"Tanya C.\"", "ReviewID": "RDFIOV80EGLBH", "Overall": "1.0", "Content": "After having a Kodak Easy Share in the past, I thought it was time to upgrade.This camera eats batteries up like nothing!  I have put about 12 batteries in this camera within a month.  I now have the rechargable type, but they still drain very fast.I have contacted Amazon and they are sending a replacement (within 1-2 months!!)  Hopefully the new one will be better or this model is history!", "Date": "February 11, 2009"}, {"Title": "Great camera for parents.", "Author": "A. Hayward \"A&C; loves ZWA\"", "ReviewID": "R2JK9PMZBZ56TG", "Overall": "5.0", "Content": "My husband bought this camera for me for Christmas to replace my Sanyo camera that my 1 year old broke, and I have to say that I am glad that he did brake that camera because I absolutely love this one! My sanyo was just a 6 mega pixel and my pictures now compared from then are much better.It has a setting for taking pictures of moving children which really comes in handy for parents with active children. I have been taking pictures non stop of my children since i got it, the only downside is that it eats batteries, the Kodak batteries that came with it only lasted for 2 hours , i suggest investing rechargeable ones, the Duracell rechargeable batteries are great for this camera it has been 3 days since i recharged my batteries and they are no where near dying.", "Date": "January 5, 2009"}, {"Title": "Excellent", "Author": "Karla J. Stengel \"kstengel\"", "ReviewID": "R2Q3AAXQ1RA6MC", "Overall": "5.0", "Content": "This product is excellent.  I had read that the camera went through batteries real quick, however after using this camera for several weeks now, I have not had to replace the batteries yet.  I do recommend turning the camera off between pictures, as this is what I do and still have not had to change them.", "Date": "May 7, 2009"}, {"Title": "Very Dissapointed", "Author": "Sanoja", "ReviewID": "RX8MUOE6N03FL", "Overall": "1.0", "Content": "The picture quality is great!  When it works.Half the time the camera won't power on, even with brand new batteries.  I have tried every troubleshooting step at the Kodak site, including spending a small fortune in all types of batteries, but to no avail.  I have seen the same problem reported in a number of web sites.  I am calling Kodak today.", "Date": "June 10, 2009"}, {"Title": "kodak c913", "Author": "MB", "ReviewID": "R1Q47RSYB2401Z", "Overall": "3.0", "Content": "When you buy this camera,you should understand that it is a POINT&SHOOT; not an SLR.Regardless of all the bells and whistles Kodak puts on this camera it will always be a POINT&SHOOT.It; works well outside in the open.It will do the job most of the time in the open shade.Any other area or condition needs the flash which is only marginal.I shot approximatley 1200 pictures with my c913 before even considering writing a review.Two thirds were good pictures(speaking of the camera,not my ability which is questionable).The other third were useless and it actually was mostly the camera's fault (I know,I know).Trying to shoot low light-no flash or messing with all the ISO settings usually messed up the picture.So if you want to do SLR photography buy an SLR.If you want a camera that cost less than $100.00,works for snap shots and can be tossed in the dumpster if it breaks down after 12 months(that would be a little less than $8.50 a month for a disposable camera)this would be a reasonable choice.", "Date": "July 26, 2009"}, {"Title": "No better than Easyshare!", "Author": "MommaMia", "ReviewID": "RRGZKAAKTQWVI", "Overall": "5.0", "Content": "I have owned several models of EasyShare cameras over the years, and I can't brag about them enough!  All of the models are easy to use, especially this one.  I take great, colorful pictures, can transfer them easily to the computer, can access them anytime easily, can't say the word EASY enough!  (Several of the pictures I have taken with them have been entered in art shows) Take a chance, you won't be sorry.  If you are afraid of digital cameras, afraid you won't be able to figure out how to use it...again, do not fear! These cameras and the programs they come with make it all so very easy.", "Date": "June 3, 2009"}, {"Title": "Kodak C913", "Author": "Nancy D. Warters \"Nancy\"", "ReviewID": "RPED0YIE6ISQU", "Overall": "3.0", "Content": "The camera needs to be handled delicately in the area of the battery/SD card area, the parts seem to be plastic and flimsy, the door doesn't always close flush so you have to keep trying to get the door to close properly. I like the Pink camera but next time will stick with the Nikon versions, they are better quality. Nancy", "Date": "February 5, 2009"}, {"Title": "Takes great pictures, when it turns on and transfers them.", "Author": "Rachel", "ReviewID": "R1ZYQMCNPLMGF7", "Overall": "2.0", "Content": "This camera takes great pictures, and has a lot of cool features that make it really easy to get a good shot no matter what kind of lighting or situation you're in. I have had a few big problems with it though, one being every so often it will decide that my memory card needs formatting and won't turn on until I do it. It also tells me if I format it, it will delete everything off of it. Then I turn it on and off a couple times (usually 4-6) and it'll be fine again. I've missed a few really good shots at concerts or the zoo because it wouldn't turn on when I needed it to.Also when I plug it into my computer, unless I go in and actually transfer the pictures one by one on my own, it will decide which ones it wants to transfer and which ones it does not and proceeds to delete the pictures that it doesn't want to transfer. This really sucks because I've lost a lot of really good pictures this way.All in all, for the money, it's a good little cheap camera, just not very convenient.", "Date": "May 10, 2009"}, {"Title": "Nice camera for the money", "Author": "J. D. Palmer", "ReviewID": "R1R6RFEOG238AV", "Overall": "5.0", "Content": "First, I love Kodak ! Kodak was in business long before any of the other camera makers and its in my state, NY.I got this camera on black Friday the day after Thanksgiving at staples and I paid $79 and I got a free Canon printer after rebate. $79 for a nice camera and printer ain't too bad !What I like about this camera is the big view screen in the back, its huge compared to the view screen on my Canon camera. It's easier taking a picture with that big screen to look thru.and it takes very nice pictures too !Worth every penny, bought this camera for my mother and she loves it, If I was buying a new camera again, I got a Canon power shot A510, I'd buy this camera instead of the Canon. I know Canon probably has more features for taking better photos but I'm a point and shoot guy and I never use all those extra features that Canon has. I just take my Camera out and take a picture and usually the picture is great so I don't need those fancy features . I'd rather have that bigger view screen in the back .", "Date": "August 9, 2009"}, {"Title": "Well Enough", "Author": "Melissa Taylor", "ReviewID": "R39F712IGIW5WE", "Overall": "3.0", "Content": "I am moderately happy with my new camera. The picture quality is as good as can be expected and while it does eat batteries (all digital cameras do in my experience), it isn't such a big deal when you use rechargables. While I'd love to have the quality of a Nikon in a cheaper package, that ain't gonna happen.I was very upset when I received the camera, thinking I was going to have to send it in to Kodak for service before I had even had a chance to use the thing. I put the batteries in and the camera would not turn on, even after I had tried several other batteries. However, after reading reviews and finding someone else had the same problem and discovering their battery insert had been put in backwards, I tried reversing mine - low and behold it worked! So, I would say, if you have problems getting it to turn on, right out of the box, try that.Other than that, it's a spiffy little camera. And its PINK! That's the best part.", "Date": "March 26, 2009"}, {"Title": "Dont Waste your Time Ive Gone Thru 2 Cameras Horrible", "Author": "P. Brady", "ReviewID": "R3QFTQXKTJMUXY", "Overall": "1.0", "Content": "Bought this for my daughter and is a nice looking camera with easy to use buttons, however I have bought two of these and had to send them both back.  When on the first one the lens cover would not shut and the second one when you try to zoom the camera shuts off.  Save time and money and go with a different brand!  Very Disappointed with this camera I guess I should have stuck with the better brand cameras such as Cannon.", "Date": "February 11, 2009"}, {"Title": "Don't waste your money", "Author": "Mom of Three", "ReviewID": "R3BII4SIFODJL1", "Overall": "1.0", "Content": "I read some of the great reviews and went to check my camera to make sure they were talking about the C913.  I have had a Kodak Easyshare before and loved it, the pictures were sharp and it was easy to use.  I have had the C913 for a year now and I HATE it.  I have used it on many of the different settings and the pictures turn out blurry if your hand is not perfectly still.  My husband even put it on the table and took a picture and it still came out blurry.  The worst thing is that a lot of the pictures look clear on the viewfinder and then you transfer them to your computer and they are blurry.  I have had several digital cameras in the past that I loved and they took clean, sharp pictures.  I can't believe that this would be user error, as some might say.  Maybe mine is defective but I will not be buying a Kodak for a while, that is for sure.", "Date": "December 5, 2009"}, {"Title": "Works great", "Author": "Eric M. Barrientos", "ReviewID": "R20SQMXX5G86M0", "Overall": "5.0", "Content": "I bought this for my business.  I didn't want to spend a lot of money on a camera.  It takes surprisingly good pictures for the price.", "Date": "May 29, 2009"}, {"Title": "Kodak WOW", "Author": "Valrie J. Putney", "ReviewID": "RP755Z6FHIWVR", "Overall": "5.0", "Content": "It is a great camera and easy to learn how to use it.  I really love it", "Date": "April 3, 2009"}, {"Title": "Kodak C913 Digital Camera is the best!!! A+++", "Author": "Daniel J. Becker", "ReviewID": "R3H5HAY07MLGFW", "Overall": "5.0", "Content": "I recently purchased this camera for myself and I love it. My girlfriend liked it so much that we bought another one from the same seller! Thanks amazon. This camera retails locally for $60 More than what I purchased it on amazon! Dan Janesville WI", "Date": "March 28, 2009"}, {"Title": "Battery life is terrible", "Author": "Mike", "ReviewID": "R3SKFU0555RU07", "Overall": "1.0", "Content": "There is a problem with the camera constantly draining the batteries. Even if I do not use the camera, within a week the batteries are dead. I use the same batteries in my other digital cameras, no problem.Very disappointed with Kodak customer service. After sending the camera back twice for repairs, the same problem continues. I asked for a refund at that point and they said that would not refund my money. They want me to send it back for a third time for repairs. Kodak says that they stand behind their products, just don't ask for you money back. That is not their policy.Even when I called their customer serrvice line, one of the first options that comes up is \"Are you experiencing a problem with a short battery life with your camera ?\". Sounds like they know there is a problem, but they are just not owning up to it. Shame on you Kodak !!!", "Date": "June 25, 2010"}, {"Title": "Good camera but........", "Author": "Robert E. Newberry \"Bobdog54\"", "ReviewID": "R1FU3MR4FQTWZA", "Overall": "3.0", "Content": "I have no complaints about the features of this camera.The quality of the pictures are great along with a really great software program. The but....referrs to the battery compartment. You have to be REALLY careful when changing batteries or even just opening the battery compartment.Well opening is not the problem rather it is CLOSING the compartment. It is really important to be slow and careful as the little contact arms can get bent or broken pretty easily. I had to return the first one due to this problem.Amazon was great replacing it and so far no problems but I can tell I will need to be very careful EVERY time I open/close the battery compartment.", "Date": "November 13, 2009"}, {"Title": "easy.......", "Author": "John C. Tietjen", "ReviewID": "RCD8OF3HLTWP2", "Overall": "5.0", "Content": "its sooooooo easy.  for me, thats a  biggie.  i highly recommend it.", "Date": "March 12, 2009"}, {"Title": "poor battery life", "Author": "dimples39581", "ReviewID": "R1C70WY9RWXG4L", "Overall": "1.0", "Content": "The battery life of this camera is horrible. It did not hold a charge. Was able to return it which was great. I would not purchase this camera again.", "Date": "February 7, 2010"}, {"Title": "Are you crazy with that price??", "Author": "C. English", "ReviewID": "R2AFS7U7UZQFWT", "Overall": "4.0", "Content": "That price is insane! I sure hope no one bought one at that price. I own one...paid 80.00 for a new, NOT refurbished, camera. I do like the camera, but it is an 80.00 camera...not several hundred.", "Date": "November 18, 2009"}, {"Title": "nice camera, but very poor design specially with battery compartment", "Author": "Marcela Gonzalez \"amazon fan\"", "ReviewID": "R1IHM26M8UKVMA", "Overall": "2.0", "Content": "I had to return this camera back due to a defect on the lap that seals the batteries, without the batteries, the little lap closed ok, but once the  batteries were in, the lap couldn't seal, it was like it didn't fit there anymore...nice camera though, wish the battery compartment wasn't as poorly designed...", "Date": "November 11, 2009"}, {"Title": "Great Pictures for the Price", "Author": "Bob Falco \"Bob K F\"", "ReviewID": "R1FH4ZDJ4XSG73", "Overall": "5.0", "Content": "We use this camera in a warehouse to take photos of departing loads. It takes excellent pics that show good detail and depth in less than ideal light levels.", "Date": "May 24, 2009"}, {"Title": "So Far So Good", "Author": "S. Brown \"Customer s\"", "ReviewID": "RE0HU9VDE6FK", "Overall": "4.0", "Content": "Purchased for an 8 and 10 year old.  So far they and the camera are working out fine.  (6 weeks)", "Date": "May 10, 2009"}, {"Title": "Camera", "Author": "Jonathan Terland", "ReviewID": "R3PRDI1HRWPK07", "Overall": "5.0", "Content": "Bought this for a birthday present. It was fantastic, however, we could not find a speaker that will let you hear the sounds during video playback. But we bought it for pictures so it works great.", "Date": "March 22, 2009"}, {"Title": "Just what Santa ordered!", "Author": "Mrs Kane", "ReviewID": "R2AEJ7EC5QYNE1", "Overall": "5.0", "Content": "This was an easy and pleasant shopping experience and my daughter was thrilled with it.  Made Santa's job easy!", "Date": "January 20, 2009"}, {"Title": "Teenage Memory catcher", "Author": "Judy R. Bryant \"Mom of three out in the country\"", "ReviewID": "R37UVU89LIF0AP", "Overall": "5.0", "Content": "My daughter is a junior in high school and she has really loved her new camera. It is not only the hottest teen girl color, but it is a way for her to capture her high school days on film without wasting money on the pics that she isn't aware her friends took. I am pleased and so is she.", "Date": "January 14, 2009"}, {"Title": "great camera for the price", "Author": "C. woodson \"New Grandmother\"", "ReviewID": "R3O5SM30TE44DD", "Overall": "5.0", "Content": "I bought this camera for my home so we could take pictures of my new grand daughter.  I'm not a photographer, but this camera takes great pictures. My teenage daughter had the camera all the time.  It would be nice to use it a little more.  It takes GREAT pictures especially for a novice like me.Kodak EasyShare C913 9.2MP Digital Camera with 3x Optical Zoom (Silver)", "Date": "March 17, 2009"}, {"Title": "Easy, quality, and did I say easy?", "Author": "redkendog", "ReviewID": "RF4DUWWYXHL8I", "Overall": "5.0", "Content": "Two things I was looking for in a camera: 1) Simplicity of use with uploading for sharing and printing to my printer and to online printing sites.  2) Quality -both hardware integrity and color/clarity of the photos.This unit hit both marks at a great price! A camera at the $200 mark was my max, but this one is worth every dollar.  I like how the camera feels solid in my hand, how easy it is to see on the large viewer -especially in bad light, and the photos are simply amazing.  I bought this right before Christmas and did all my photocards, I have never been able to do this in the past because the quality just was not there.  Also, I always have had to try 2-3 times to upload my pictures to get them printed or just gave up.  I had my mother upload the photos ...this is from a woman who says, \"Everything I touch turns to crap!\" After she was able to work this camera, I knew I had to write a review.", "Date": "December 27, 2011"}, {"Title": "In the Pink!", "Author": "S. Block", "ReviewID": "R10P941H48GRS0", "Overall": "5.0", "Content": "Kodak Easy Share \"C\" models are always a good bet when buying a reasonably priced digital camera.  They're easy to use, and the photo quality is great.  I have purchased these cameras before: one 5 and one 6 megapixels, for my children.  They worked very well. When one of them was ruined by water damage, I bought this one to replace it for my 7 year old. She desperately wanted a pink one this time, and those are not as easy to find. I recommend Kodak Easy share for both adults and children for their ease of use and reasonable price.  I also like that the C913, and all other C model Easyshares use AA batteries.  This is very convenient when the battery dies and all you have to do it pop new batteries into the camera instead of having to wait to charge the battery.  It's a HUGE selling point for me when I choose this model.", "Date": "December 3, 2010"}, {"Title": "Love it!", "Author": "N. Dransfeldt \"Niki\"", "ReviewID": "R2NVFSLHOWR7SU", "Overall": "5.0", "Content": "Best Easyshare camera I've had.I also have a Kodak Photo printer dock.  I use a kodak kaa2hr battery pack in my camera that also charges while it sits on the dock.  I'm telling you this is the MUST have set up.  I never worry about using up batteries now.  I never have a low battery light.  It's great.  I've had this camera and the same battery for nearly a year now with zero problems.The camera itself takes great pictures.  I'm very happy with it!The only negative thing I can say is that you have to go to the menu to put on the timer.  The old one I had, had a timer button right on it.  Kinda of miss that.", "Date": "July 7, 2010"}, {"Title": "Great Little Camera", "Author": "kcallahan47", "ReviewID": "R2LDO2NKKRCBL9", "Overall": "5.0", "Content": "I bought this camera to replace one lost while traveling.  I also needed one that would work on my printerdock, which, many of the newer Kodak Easyshares won't.  This one fit the bill perfectly, was slightly smaller than my previous one, and took better pictures (more MPs).  While I'm sure it's not studio quality, it's a great camera for traveling when space is at a premium.", "Date": "February 3, 2010"}, {"Title": "Blurry and Bad Lighting", "Author": "H. Orenczak", "ReviewID": "R1QGRHR56OODSV", "Overall": "2.0", "Content": "I have had this camera over a year and have complained about it from the start. I should have taken it back when it was still new. No matter how I change the settings the light is too bright but if I don't use the flash everything is blurry. It gets very frustrating losing your picture opportunity with the picky-ness of this camera. When I try to do close up pictures it wont focus on the right thing. I had a chance to play around with my Moms Cannon at about the same price range and will be looking to get rid of mine. I do not like this Kodak! This camera is supposed to be a point and shoot. I have used disposable cameras and gotten better results. Finally fed up!", "Date": "December 26, 2009"}, {"Title": "spend the extra $50.00 and get another camra", "Author": "Chadd Wedgewood", "ReviewID": "R2DT8U67A8KRT4", "Overall": "2.0", "Content": "I have owned old Kodak camera's and loved it.  I bought this one out of desperation just before Christmas last year.  I didn't research the product and bought it because it seemed like a good deal. Found out quickly that I waisted of money.  You can do much better for about $50.00 more and another brand.  The picture quaity just isn't there.  Not to mention the thing stopped working after 6 monthes. Did my research this year and went with a canon!", "Date": "December 13, 2009"}, {"Title": "Point & shoot pocket camera", "Author": "Joseph B. Williams \"Joe Brow\"", "ReviewID": "R22Z4FHTUOJ8LB", "Overall": "4.0", "Content": "The camera is of typical good quality Kodak construction.  It is not as thin as I had expected, but I can still carry it in my shirt pocket.  It is impossible to see what kind of picture you are taking in bright lighting conditions, but that was expected.  I've only taken one set of pictures with the camera, and the exposures were darker than I expected.  However, the information was all there, and simple editing allowed me to produce good clear pictures.", "Date": "December 7, 2009"}, {"Title": "Good introductory camera", "Author": "McDruid", "ReviewID": "R2KG5A7HRPB4OH", "Overall": "4.0", "Content": "I bought this rather cheaply (seventy bucks) for a cousin in Turkey. I only had about three days to test it, but it seems like a good camera for a casual user.Ease of use: Very Easy.I've had a few Kodaks before and they seem to put extra effort into making them easy to use, the C913 is no exception. I would rate it as very easy to use. Most menus are only one level deep. The only time you have a submenu is for the setup menu. There are only 2 different menus available with the camera set on the \"auto\" setting, so you don't have to search around to find things (turning the dial to other settings, such as video, gives access to other menus with items appropriate to the setting). It takes 4 button presses, all the same button, to set the camera to no-flash from auto. It takes 3 button presses, using two buttons, to set the camera to 10 second self timer. The camera has 20 different languages built in. There are a dozen or so scene modes.Responsiveness: Surprisingly fast.With fresh batteries installed (included with camera): Startup to first picture (with flash) about 2.5 seconds.Shot to shot (with flash) under a second.Time to max zoom from standard: about 2 seconds.It is pretty hard to measure these accurately, but these times should give you an idea. The camera likes to use the flash, and I didn't get a chance to test it without, but this is pretty good for flash shots.Picture quality: DecentI don't have a good technical way of measuring quality, but the shots are only OK. Close up, the hair lacks detail and faces are slightly splotchy. It doesn't have the quality you would expect from 9 Megapixels. Prints at 4x6 look fine.Video quality is not so good, it is only 640x480, and video inside the house is pretty dark.Pros + Video editing in-camera + When switching modes, an explanation of the mode is briefly displayed on the screen. + Fast + Easy to UseCons - No sound on video playback - LCD screen is very grainy - Video images are poor", "Date": "December 4, 2009"}, {"Title": "Super Sweet", "Author": "Armand J. Plato", "ReviewID": "R1KQKO7XJTZATG", "Overall": "5.0", "Content": "This is just what I've been looking for.  Just got tired of lugging big photographic equipment around.  This Kokak EasyShare Camera can even fit in my shirt pocket.  It makes a big differance and takes great pictures as well.  It's super sweet dealing with Amazon and PayPal.  I'll do it again.", "Date": "November 2, 2009"}, {"Title": "Kodak Easyshare Camera", "Author": "Gerald L. Keller", "ReviewID": "R2HABP9XF0Q2WG", "Overall": "5.0", "Content": "The camera is very easy to use and is small enough to carry in your pocket. It is exactly what I needed for my use. I would recommend it highly for anyone just getting started or anyone that is proficient in photography.", "Date": "September 13, 2009"}, {"Title": "Kodak EasyShare in PINK", "Author": "A Customer", "ReviewID": "RV1DSNDDYB85Q", "Overall": "3.0", "Content": "I received this beauiful camera for christmas of last year. It is now 8 months later and it no longer works. When I turn it on it flashes a \"lens problem\" message and shuts off.I really likeD this camera because it took very nice everyday pictures. The pink is very nice and more of a glittery pink. I LOVED IT.I was never too crazy about the playback feature on the video setting as you can not hear audio since it does not have speakers.Too bad it no longer works.", "Date": "September 11, 2009"}, {"Title": "amazing results for price", "Author": "Mama Ro", "ReviewID": "RUU7VNOLXH8CG", "Overall": "5.0", "Content": "Our daughter requested this camera for her thirteenth birthday. She did her research and felt it was the best in our birthday gift price range....and it was pink. It made a boring summer turn to magic and has spawned an intense interest and focus for her teen years. As parents who have always worked in media and graphics, we have been impressed with the quality of photos, the many options and special effects this camera can produce. The size is perfect for toting around town, hiking in the woods or surprising friends at parties. And once again...... it is pink1!!!", "Date": "September 11, 2009"}, {"Title": "great pictures", "Author": null, "ReviewID": "R3QWAJMKXR9YOT", "Overall": "5.0", "Content": "I like it very much and that's what counts I think it is a great camera", "Date": "August 22, 2009"}, {"Title": "good deal", "Author": "Waseem U. Usmani", "ReviewID": "RFMQ2DNU0IX8D", "Overall": "5.0", "Content": "i have beens  using this product for one month and so far result are good. It would be better if they added chargeable battery instead of aa cells because while recording and taking snapes it consumes lotof cells otherwise it is a good product to rccomend.", "Date": "August 21, 2009"}, {"Title": "Kodak913 user", "Author": "Marty Mart \"mystery lover\"", "ReviewID": "R1LJ4LLIXCGJ98", "Overall": "3.0", "Content": "I purchased acct I had owner a Kodak like the 913, but lower pixels.I purchased for use at a local Scouting event, and it worked well enough, but doesn't always turn on when needed, some fiddling is needed with batteries or with on/off button before it will work.  I don't understand this, as I am using Kodak rechargeables and they performed perfectly in the other camera.All in all I would say the quality of the pictures are great, but I'm disappointed in the product.", "Date": "August 11, 2009"}, {"Title": "Kodak easyshareC913 9.2MP", "Author": "Michael A. Gordon \"Michael A Gordon\"", "ReviewID": "RIQCGREUFU0H4", "Overall": "5.0", "Content": "I an very satisfied with my camera for only $85.00, it is a great deal.I have been able to make some great video clips.My pictures come out sharp.I have taken advantage of ordering prints from the Kodak Gallery online and have been able to enlarge up too 8x10 pictures with excellent quality.so as a family man taken pictures of family,I am very satisfied.Battery life is very good.", "Date": "August 2, 2009"}, {"Title": "Best gift ever.", "Author": "Angelbaby \"P2AIP\"", "ReviewID": "R1WQTWKHAHAI0L", "Overall": "5.0", "Content": "This product is really good. Kodak makes some of the best cameras. My daughter is 8 and she can use it with ease. I love this camera the best gift I could have gotten myself.", "Date": "July 7, 2009"}, {"Title": "Awesome camera!", "Author": "Belcy", "ReviewID": "RAX1HFBVNJF1T", "Overall": "5.0", "Content": "For me been an amateur, I was greatly surprised with this camera. It's very easy to handle! Besides the reasonable price, the color and quality of the pictures are amazing! Easy to understand and to handle. I have compliments wherever I go and take pictures with it. I highly recommend it!", "Date": "June 27, 2009"}, {"Title": "Kodak Easy Share C913", "Author": "Mrs. Karen L. Reed", "ReviewID": "RLGXQ51M4S5T2", "Overall": "5.0", "Content": "Bought this camera for my father-in law who is in his 80's, needed something easy.  This was the right camera for him, he could use it without problem and took great pictures. He was on a train and took pictures while moving and they turned out good. Very nice camera for the price.", "Date": "June 27, 2009"}, {"Title": "Great product!!!", "Author": "Joyce Mink", "ReviewID": "R26L9SWBQM2Z35", "Overall": "5.0", "Content": "This is a great product! I am very thrilled with the ease of use and the quality of the pictures.", "Date": "June 15, 2009"}, {"Title": "product ad seller satisfaction", "Author": "Paula Lockmiller", "ReviewID": "R3J0S6F8SN9SAI", "Overall": "4.0", "Content": "I like the camera and its features and would purchase another like it.  I would strongly suggest that you buy it from a high rated seller,  My item had to be sent back and the seller was not prompt on responses,", "Date": "May 31, 2009"}, {"Title": "happy camper", "Author": "J.", "ReviewID": "R1FU8QCSAIM31A", "Overall": "5.0", "Content": "Camera performs as I expected and as was represented. Zero complaints.  Shipping was far better than expected.  Will definitely buy there again.", "Date": "May 9, 2009"}, {"Title": "Great Camer for a Great Price", "Author": "J. Harris", "ReviewID": "R10JMH0PUM55U7", "Overall": "4.0", "Content": "Very nice camera for the price. It has very nice  zoom. And the Resoultion is Great.", "Date": "January 19, 2009"}, {"Title": "Easy Share Camera", "Author": "Darlene Weinbrenner \"writer\"", "ReviewID": "R2G9QM00HMQZOG", "Overall": "3.0", "Content": "This camera is great.  It is easy to use and the price was great.  The only thing is that you have to purchase a memory card and it is a MUST to buy rechargable batteries and a charger because after taking only a few photos, the batteries die.  So, for the extra costs I gave this 3 stars instead of 5.", "Date": "January 12, 2009"}, {"Title": "For my 13 year old daughter", "Author": "T. L. GEORGE", "ReviewID": "RISO4PP4VS9WS", "Overall": "4.0", "Content": "I bought this for my 12 year old(who will be 13 in a week) for christmas. She wanted a pink camera. We have always had Sony, which I love, but didn't really want to spend the money on a 12 year old. I asked a few people who had Kodaks and they were happy with theirs. I haven't used it, but my daughter loves it and says it's easy to use and the pictures are great. The only thing she didn't like was that it came with AA batteries and you would have to buy the rechargable ones separately.", "Date": "January 5, 2009"}, {"Title": "Kodak C913", "Author": "Salvage D", "ReviewID": "R1GBLXO8YX8IJC", "Overall": "4.0", "Content": "Great camera, too bad they went back to the rechargeable AA batteries. What a pain that is.Delivery was fast, package well prepared.Kodak EasyShare C913 9.2MP Digital Camera with 3x Optical Zoom (Pink)", "Date": "December 16, 2008"}, {"Title": "Unacknowledged defect?  Cameras will not turn on/stay on", "Author": "M. Kelsey", "ReviewID": "R27N9IGH2FLP4I", "Overall": "1.0", "Content": "I bought an EasyShare C913 a few weeks ago.  When it arrived and I installed the batteries (correctly, and that's another design flaw!) the camera would not stay on.  The screen would flash, the lens would partially extend, then the camera would shut off.  I packed it back up and returned it to Amazon for a replacement (which they sent UPS next-day, no charge!).The replacement camera appeared to work fine, for a few days.  Now it is showing exactly the same symptom.  I swapped out the batteries, and even shelled out ten bucks for \"lithium\" instead of regular \"alkaline.\"The Kodak call center rep claims that this is \"not a known problem with this model,\" although it appears to be quite well-known on Web review sites.  She suggested that I \"ask the seller to test the replacement camera before send it to [me].\"  Uh, huh.  I asked if she was familiar with Amazon...I'm sending the replacement back to Amazon now.  I haven't quite decided if I should get yet another replacement, or just a refund.", "Date": "October 21, 2009"}, {"Title": "Wonderful little camera!", "Author": "M. L. Nicholas \"Christian Fiction Fan\"", "ReviewID": "R29FRK07SQVAGM", "Overall": "5.0", "Content": "I recieved this camera as a birthday present, and I am absolutley in love with it! It takes beautiful, clear pictures- surprisingly good considering it's price. I take it with me everywhere and snap pictures of anything I like. It takes the most beautiful landscape pictures. I really have loved this camera from the first day i bought it. It seems pretty durable, too- I dropped it down a flight of 15 stairs and it still worked fine! However, I just dropped it again yesterday, and it's dead for real this time. I dropped it with the lens out, and it fell and tapered the lens downward. But i love this camera so much I'm buying a new one... in pink of course!! A warning to all Camera owners and shoppers: Use your wrist strap!!!", "Date": "April 13, 2009"}, {"Title": "quality product", "Author": null, "ReviewID": "RG5JGUJ6JRRYR", "Overall": "5.0", "Content": "Thanks for now I have come out excellent product very well and really have no trouble with the camera", "Date": "March 16, 2009"}, {"Title": "TERRIBLE!!!! DO NOT PURCHASE!!!", "Author": "L. Steinkamp", "ReviewID": "R2PCIGE04IT6K4", "Overall": "1.0", "Content": "Never have I been so disgusted with a camera! It is awful. It wouldn't turn on no matter what I did. I only had it for a few weeks. I called the company, and they said that I could send it in at my cost to be fixed. This is the worst policy I have ever heard. Purchase at your own risk.", "Date": "July 8, 2009"}, {"Title": "Don't waste your money", "Author": "A. Kelly", "ReviewID": "R286G4OFFOB0E3", "Overall": "1.0", "Content": "I purchased this camera yesterday at a local store and I returned it 2 hours later. I could not get the software to download and I could not get the camera to power up. I tried with the batteries that came with the camera... no go. So I put new batteries in the camera and it still would not power up. Back to the store it went!!!", "Date": "February 22, 2009"}, {"Title": "Don't buy this camera", "Author": "Jeanne M. Mahoney", "ReviewID": "R2BHUQU7NFJ2C3", "Overall": "1.0", "Content": "This camera only worked for a few weeks.  Most of the time it won't turn on at all.  I tried several different batteries and finally got it to turn on.  A few days later when I was ready to use if for my daughter's birthday, it wouldn't turn on at all.  Don't buy this camera -- it's a piece of crap.", "Date": "October 26, 2009"}, {"Title": "Not quite what I expected", "Author": "Handy Andy", "ReviewID": "R1F4W5JQHGE8V1", "Overall": "3.0", "Content": "I certainly like the size and features of the camera.  However, I do miss the viewfinder that my previous Kodak cameras had.  It is impossible to frame the subject in bright light.  Also the camera appears to be more fragile than my previous ones, and in addition the power button is too small and difficult to turn on and off.", "Date": "April 20, 2009"}, {"Title": "Happy Teen", "Author": "Tess", "ReviewID": "R6U79N2WF3VD", "Overall": "4.0", "Content": "Kodak EasyShare C913 9.2MP Digital Camera with 3x Optical Zoom (Pink)  bought this for my 14 yr. old daughter. She's very happy with it overall. The video portion lacks in quality, but it's adequate for a teenager. Make sure to use the recommended batteries. This camera will eat thru alkaline batteries daily, if they even last that long. Best to get rechargable ones. You will also find you will need a memory card as the camera memory only holds about 9 photos.", "Date": "February 5, 2009"}, {"Title": "Good basic point-and-shoot camera", "Author": "Kindle Customer \"Listening to audiobooks is a...", "ReviewID": "R15XVLG55UJR6F", "Overall": "4.0", "Content": "I bought this camera for my parents for Christmas. They take lots of pictures of their granddaughter with disposable cameras, and this is now their first digital camera. So far so good: it takes good quality pictures. Not a lot of bells and whistles, but also not too daunting for beginners. My only criticism is that it feels a little lightweight. My own digital camera is a Casio Exilim EX-Z70 which by comparison has a sturdy, solid feel to it. All in all, I would recommend it for a first time digital camera buyer who is looking for good image quality.", "Date": "January 12, 2009"}, {"Title": "There is cople point here.", "Author": "valentin perez mendoza", "ReviewID": "R1C5N3LJO8E2WV", "Overall": "2.0", "Content": "The camere was use it. the one o got. I knew that... But im not sure if it was the problem, because the pic dont have good resolution, and you can't do good pic with this one. Maybe the new camera work, but that one i bought is not Good", "Date": "January 11, 2014"}, {"Title": "ehh. so so", "Author": "Tim", "ReviewID": "RUQ405QK995AB", "Overall": "3.0", "Content": "This is a So so product that gets the job done for someone who just needs a small piece of equipment. Very limiting.", "Date": "December 31, 2013"}, {"Title": "Kid friendly. Made his vacation complete", "Author": "Nancy Meiring \"NancyA\"", "ReviewID": "RQHEOB5Z18JSF", "Overall": "5.0", "Content": "I bought about 7 used Easyshare camera's for my grandkids. We were going to Disneyworld and I wanted them to each be able to take pictures of what they were interested in. These were a great purchase, even the 4-year old got great pictures and they fit right on the printer. These are easy to use, priced right and quality pictures were had by all.", "Date": "December 30, 2013"}, {"Title": "Camera", "Author": "JOSE", "ReviewID": "R2GJBXNBVLNLT6", "Overall": "5.0", "Content": "This was a great buy. I needed a special gift for my family and this is a great gift. The product is good quality and is a gift that will last several years. The price is very good and according to what he sought.  great gift", "Date": "December 27, 2013"}, {"Title": "Replaced A Stolen Camera", "Author": "Sylvia Kromer", "ReviewID": "R3OMJSX59LYYCD", "Overall": "5.0", "Content": "We had a camera like this one and it was stolen from a motel room.  We loved this camera because it is so simple to use.  We tried a few others but no comparison so I found this one on Amazon and replaced the stolen camera.", "Date": "December 16, 2013"}, {"Title": "Good camera", "Author": "happystamper", "ReviewID": "RIBTMO4WFI8CC", "Overall": "4.0", "Content": "Was very satisfied with the camera.  It came in the amount of time stated and was as expected. All accesories were there.", "Date": "October 19, 2013"}, {"Title": "My views about this camera", "Author": "Rana Abdullah", "ReviewID": "R1NQALGJEBPVQL", "Overall": "3.0", "Content": "This camera use battery cells so expensive...i purchased second hand so data cable and manual was missing and each time i had to remove the memory card to copy pictures.Result is not bad but also not very good.", "Date": "September 24, 2013"}, {"Title": "Great", "Author": "briana", "ReviewID": "R7GC7XCDEKDLB", "Overall": "5.0", "Content": "exactly  wAHT i aSK fOR!  COOL CAMERA  WORKS VERY WELL, LOOKS ALMOST BRAND NEW, I LOVE HE COLOR CAME WITH BATTERIES THE BEST!", "Date": "September 18, 2013"}, {"Title": "Great camera", "Author": "Susan", "ReviewID": "RNXR96M9S14QM", "Overall": "5.0", "Content": "I had an Easyshare camera just like this and the screen shattered. I was upset because my mom bought it for me and she is gone now. This camera is so easy to use. And it is easy to learn too. I'm going to get a good camera case so I don't just throw it in my purse. It needs to be treated carefully and gently.", "Date": "July 22, 2013"}, {"Title": "Easyshare", "Author": "CR", "ReviewID": "R1ROYOX8DUWI10", "Overall": "3.0", "Content": "This camera is always one of our favorites; however this particular camera after several months of use, the buttons stared to stick.", "Date": "May 16, 2013"}, {"Title": "Kodak Camera", "Author": "granof12", "ReviewID": "R3RPWBJ46PZEBE", "Overall": "5.0", "Content": "i love this little camera.  it is perfect for what i wanted it for.  Not a big powerful camera, but fun to use.", "Date": "April 7, 2013"}, {"Title": "buenisimo", "Author": "YEIMY", "ReviewID": "R1GF7JNUAWXVSL", "Overall": "5.0", "Content": "lo recomiendo 100%, practico, comodo, excelente producto, muy buen calidad, mejor imposible, , excelente responsabilidad en el tiempo de entrega", "Date": "January 24, 2013"}, {"Title": "Kodak Easyshare C913 9.2 MP Digital Camera with 3xOptical Zoom (Silver)", "Author": "I RECEIVED THE PRODUCTS WITHOUT PROBLEM", "ReviewID": "R1K86WXG59QR18", "Overall": "5.0", "Content": "product received in good time and we liked it because it was requested by me to give away and use", "Date": "January 3, 2013"}, {"Title": "Nice camera for the price.", "Author": "A. Sekelsky", "ReviewID": "R3CQSG7328SBKS", "Overall": "4.0", "Content": "This camera was great while transitioning from my first, 5 MP digital camera. The quality is pretty good for the average user, and the camera has lasted me a while. I also enjoy all the features on it, like the sports and macro options. However, I've been having an occasional problem in which the camera will not turn on, or it will turn off during use. Maybe the latter is just the batteries running out. Usually, it helps to open the battery department and close it again. Sometimes, though, it won't help, and changing the batteries doesn't help. This is a recent problem, but it is working, now. My mother is starting to have that problem with her Kodak, too, which she bought around the same time she bought mine as a birthday gift.I would really like to check into getting a 16 MP camera, since my mom's Kodak that she got from QVC has even better quality than this one, and I'd like a little better quality for taking pictures of the dogs at the local animal shelter while walking them. It seems that higher-quality cameras are more affordable than they were a few years ago when she bought mine.The video quality can lack sometimes. It seems like my iPod takes better video (unless it's just me; I've never compared them side-by-side.)I do really like it in sports mode, even while using it for just everyday moving objects. That's one thing I'm looking for in a new camera. Well, it's not perfect, but it's still wonderful. I like using it for taking pictures of dogs in mid-run, including my own dog.Only thing is, I would not pay two hundred dollars for this camera, like they want here. My mom got it for me from Walmart a few years ago for about ninety dollars. It was the pink one, too. I don't know if they have this camera at Walmart, anymore, but there are definitely better cameras for that price nowadays.I've had this camera for four or five years. It's fun. Sometimes, it takes multiple times to take the right picture, but that could also be my fault. I like experimenting with different things and also using the macro function when possible.", "Date": "December 8, 2012"}, {"Title": "Kodak Software", "Author": "Kolta", "ReviewID": "RP0W4T9ODJVGN", "Overall": "1.0", "Content": "The camera is one thing but, the software will drive you to drink not to mention that the Kodaks Gallery function is invasive. It's very difficult to opt out from Kodak nabbing your photos to store on their servers. But wait, the fun hasn't started, watch what happens when you tried to upload your photos to your computer from the camera. The software picks and chooses what photos it wants to upload and if you say NO, it deletes all the photos stored in the camera. The camera sucks the batteries dry. The software is the work of the devil. I HATE THIS CAMERA AND SOFTWARE. This camera and it's software must die.", "Date": "September 15, 2012"}, {"Title": "Excellent camera that can still compete with newer models", "Author": "tigertron007", "ReviewID": "R32CU1SJ6EAMWN", "Overall": "4.0", "Content": "I have owned this precise model for a couple of years now and I'm happy to say that this is one good camera. The picture quality is good, very user friendly and easy to operate. The pictures it takes are very sharp and the high resolution gives you good details to work with when you want to edit/photoshop them later. Using the flash gives it warmer colors. The auto setting practically takes care of everything for you. That said, it's not completely blur-proof as shaky hands can still ruin your shots. This is more evident in close-up shots. The close-up setting is supposed to help you get good shots of objects that are near but I'm having a harder time getting good pictures that way. I end up using the auto setting and auto focus instead. Despite some shortcomings, I'm not ready to give up this camera just yet.", "Date": "June 16, 2012"}, {"Title": "dissatisfied", "Author": "Cherry", "ReviewID": "R1IFS420V8PJDP", "Overall": "1.0", "Content": "The Kodak Easyshare C913 9.2 MP Digital camera was the first item I have purchased through Amazon that was not what it should have been. When turned on, it shows screen with info but a black background instead of the picture view .. shutter opens but screen remains black.", "Date": "June 14, 2012"}, {"Title": "Sturdy, but eats batteries", "Author": "Kristina", "ReviewID": "R3JDOT4VF66FNL", "Overall": "4.0", "Content": "I've had this camera for two years now and it still works great.  It can be picky, yes, but I have never had the trouble of it reformatting the SD card or spontaneously deleting pictures or not turning on.  It's the most reliable camera I've ever had-- but it eats through batteries like crazy!  Unless I know I need it ready at an exact moment (a graduate will walk across the stage only that one time, etc.) I'll just use the batteries until the camera shuts off on its own (and even then, I can usually get it to come back on for another two or three pictures before it really dies).I bought this camera when it was on sale for $94 in a bundle set and I really haven't had the trouble with it that other people have had.  Get yourself some rechargeable batteries and an 8-pack of AA on the side for emergencies.  I took 850 pictures just this last weekend with three sets of batteries and 768 of them came out without blurs (and the others were of close-up scenery out the side window of the car as we drove by at 70mph).  Must have gotten one of the \"good\" cameras, then.Also, I lost the USB cable very early in my relationship with this camera, so I open the battery compartment to extract the SD card whenever I want to put pictures on my computer.  Maybe that's why I don't have the delete-pictures problem?  Even when I drop the camera, things still work and no pictures are knocked from the memory.  Sometimes its hard to replace the battery lid, but just mess with it a bit, it has never taken more than 30 seconds to fix.Five stars, minus one for the battery-eating.", "Date": "November 28, 2011"}, {"Title": "Used easyshare C913", "Author": "farmerbobp", "ReviewID": "R1QB0WFLI9YQCX", "Overall": "5.0", "Content": "excited to see this camera's software is compatable with other Easy Share models. It's rough organizing one's photos when using 3-4 cameras and they all require different software.", "Date": "May 16, 2011"}, {"Title": "Good little point and shoot", "Author": "Frequent Clicker", "ReviewID": "R2TRYB3ERCDD7N", "Overall": "4.0", "Content": "This isn't the newest camera out there, but I have been pleased with the picture quality.  My indoor pictures are often a good quality, and sometimes that can be an issue with cameras.", "Date": "May 9, 2011"}, {"Title": "Early review on 1st use", "Author": "Coralie M. Blount", "ReviewID": "R1N5BO9YKVAXD", "Overall": "5.0", "Content": "This reconditioned camera seems to be excellent. Easy to operate. Easy to know what setting is best for the lighting. I do not know yet about batteries. I have not had any pictures printed but the image on the camera looks great.", "Date": "September 7, 2010"}, {"Title": "Get's The Job Done", "Author": "R. McRae", "ReviewID": "R15JVGZMFEY8MO", "Overall": "4.0", "Content": "After a short notice trip to Maui that my wife and I took last August 08, we managed to get by with several disposable cameras. And although those photos really weren't all that bad, my wife surprised me one day with the Kodak EasyShare C913. Since we had another trip coming up to St. Louis in October 08, she felt we should at least purchase an entry level digital camera. Easy to use, very acceptable results, and affordable for any budget, this little camera will lull you into waiting, before spendng a bit more on a more \"reputable\" model, as I just did by the way. I just purchased the Canon Power Shot SX10 IS on Amazon, at 4x the cost. But this little gem will come along with us as back-up on every excursion as well. For samples of my results, see my uploaded photos here at Amazon. The one drawback, as read in previous reviews, there are moments during recent use and after about a years ownership, where the camera just won't switch on. But that has been rare.", "Date": "September 19, 2009"}, {"Title": "new camera", "Author": "C. Bourg", "ReviewID": "R21VIEMAMSSZLX", "Overall": "4.0", "Content": "I have not had an opportunity to use this camera a lot yet. I purchased it to use on an upcoming trip. I did use it a little and was satisfied with it.", "Date": "September 17, 2009"}, {"Title": "This is a nice camera!", "Author": "Maria Chopperfield \"ASD\"", "ReviewID": "R2U2760OUP5PP8", "Overall": "4.0", "Content": "I have not used camera much yet but it appears to be quite light weight. More importantly, the picture quality is great.", "Date": "July 22, 2009"}, {"Title": "Okay Product,,,,, service (shipping) just average.", "Author": "Nikki", "ReviewID": "R1HA1VQBRH9VO3", "Overall": "4.0", "Content": "The picture quality is not fantastic.. just okay for the price.... must take a lot of pictures to get something close to what you want. The shipping was not fast at all..", "Date": "June 23, 2009"}, {"Title": "New for the price of used!", "Author": "Richard V. Bunch", "ReviewID": "RWCE62IAZX6SX", "Overall": "5.0", "Content": "this replaced my 10 year old camera that was a whole lot more expensive, and was not even near as close to as good of pictures thank you", "Date": "March 30, 2009"}, {"Title": "Software is terrible", "Author": "K. A. Wilson", "ReviewID": "R1BWIBNI4K4FQA", "Overall": "1.0", "Content": "This camera takes good pictures, but I've only had this camera for a couple months, and the software is a nightmare to navigate thru.  I've also had trouble with not all of the pictures transferring to my computer.  Even with help from Kodak, which helped for one instance, now not one picture will transfer to my computer.  Save your money and buy another brand.", "Date": "November 16, 2008"}, {"Title": "Great Buy !!!!!!!!!", "Author": "Sherman E. Stewart", "ReviewID": "RO46S32PLPNRF", "Overall": "5.0", "Content": "Great deal and a super vendor, the best review I can give is I would buy from them again without hesitation!", "Date": "November 18, 2009"}, {"Title": "works well", "Author": "Kittie Peacock \"Iowa Woman\"", "ReviewID": "R1YQMD2YXLFB1K", "Overall": "4.0", "Content": "I am pleased. I did have a little scare when for some reason it would not turn on but after some time it turned on for me again.", "Date": "February 3, 2009"}, {"Title": "Good pictures, TERRIBLE VIDEO!", "Author": "Mike Sweeney", "ReviewID": "RF3P35H76SSIR", "Overall": "2.0", "Content": "This camera was bought on Black Friday. It came with a free printer and I thought it would be a good camera for 9 Megapixels. Turns out it was a big waste of money and I ended up returning it. Pictures are very good quality, but FORGET about the video function. IT SUCKS! The video quality is probably as bad as a video phone. The only way you can make it be like a normal video camera is to adjust the video resolution but then that takes away how good the actual quality of the video is, but it records more frames per second. If you want a camera for taking pictures, then this is not a bad camera. But if you want a digital camera for taking video then stay away from this camera at all costs.", "Date": "November 30, 2008"}, {"Title": "Terrible Camera", "Author": "C. Luckie", "ReviewID": "R1R2W9RGOJTUFS", "Overall": "1.0", "Content": "My husband gave me this camera for Christmas.  I took some pictures then and also in Jan. and the camera worked great with great pictures.  Shortly after then the camera began malfunctioning.  I would take a picture of my grandson throwing a ball but the picture would be of him having already thrown it....or something similar.  I read all directions but still couldn't get it to work.  Contacted KODAK and they were absolutely no help.  Had 2 Kodaks previously.  Kodak service stinks.  There was a minimum fee for repair that was way more than some cameras even cost.  I will NEVER buy Kodak again!", "Date": "October 28, 2009"}, {"Title": "Kodak is the standard...forever!", "Author": "C. A. Curie \"AutismMommy\"", "ReviewID": "R3GQL7SW332RDN", "Overall": "5.0", "Content": "Kodak is the standard. Lots of accessories, rechageable is good for everyone, great quality, easy, durable. I love Kodak Cameras. Help is a phone call away and they're always nice, helpful, know their products and can fix everything IN THIS COUNTRY! Come on, let's support American Companies...or stop complaining about the economy as you go out and buy your foreign cars, cameras, TV's, etc...and wonder why we're in trouble! You don't see anyone buying our stuff do you? See, maybe we aren't so smart!Kodak is Kodak. It's the best camera out there on any budget!", "Date": "September 11, 2009"}, {"Title": "Great Easy to use Camera  with great photos", "Author": "Jinsey Colelette \"Jinsey Colelette\"", "ReviewID": "R1FNRFNM62KLC1", "Overall": "5.0", "Content": "This is my second Kodak Easy Share and I told a sales person  who worked in cameras at Walmart who was talking about getting her daughter a camera and I told her if I was her I would get her an Easy Share C913 they are great and take Great photos and videos and are so simple to work.  I use My camera all the time.", "Date": "January 30, 2010"}, {"Title": "Kodak C913", "Author": "Paul", "ReviewID": "RYLD3V60C82B6", "Overall": "4.0", "Content": "Good pocket digital camera considering the price.  I like that it is not ageneric name. Anyone looking for advanced features, which are not used that often,needs to spend 3X as much.", "Date": "August 21, 2009"}, {"Title": "Not Impressed", "Author": "Ms. Tot", "ReviewID": "RYLLL9B20QALR", "Overall": "1.0", "Content": "I currently own this camera i bought it about a week ago because my Polaroid I830's flash stopped working. So i thought id get this one. I was no not impressed with it at all.  My Polaroid with no flash takes way better pictures.  This camera is only good if u take close up shots.", "Date": "April 6, 2009"}, {"Title": "Worthless.", "Author": "ShoeGirl", "ReviewID": "R3IC4I7GHY6E4D", "Overall": "1.0", "Content": "This camera was purchased on Black Friday at Staples.  The ad showed a \"C913\" but we were sold the \"CD93\" instead, and as it turns out, they are the same camera.  The power button is tiny and difficult to push.  So when the camera would NOT power on after several tries, I decided it was because it was so difficult to actually depress the button.  But sometimes it does turn on easily.  Basically, the power button just plain doesn't work 9 times out of 10.  If I take the batteries out, jostle things around, replace the batteries, they try again, the power might come on.  But usually it just won't turn on.  Also, the 1GB card that came with it doesn't work.  I put the card in, and it said \"Card Unusable.\"  What's the point of including a memory card that doesn't work with the camera?  And the camera won't let you do anything else (like choose to use internal memory) because it won't exit the \"Card unusable\" screen.  This camera is trash.  I took it back to Staples and spent half an hour trying to get some reasonable help.  They finally agreed to replace it with a C913.  So far the power button on the C913 has worked MORE OFTEN, but still not all the time!  Will review that camera too...Oh, and both cameras are advertised as 9.2 MP online, on the box, and on the camera case.  But the camera only takes up to 9.0 MP resolution, as seen on the resolution selection menu and LCD screen photo information.  There's not a great difference, but it's still false advertising.", "Date": "December 29, 2008"}, {"Title": "what a piece of dogpoop", "Author": "Douglas Parham \"out there\"", "ReviewID": "R1YPY23NVMGZJA", "Overall": "2.0", "Content": "I bought this because I had an older Kodak digital camera with only 1 megapixel and it worked great for over 10 years.  You could sight through the viewfinder and see your potential photo in bright sunlight, unlike this one which only has a screen and not a viewfinder so you just guess at what the pic will look like.  Eats batteries, but that's not my main complaint.  The goddamn thing only lasted a year and then broke.  Amazon guaranteed it for 2 months so I'm out a camera and time to start shopping again.  guess what brand I won't buy and guess who I won't buy it from.", "Date": "June 24, 2010"}, {"Title": "used cramera", "Author": "Thomas Hernandez Jr.", "ReviewID": "R1UA2YM0ZVCZIM", "Overall": "3.0", "Content": "The next time I looking to buy a used cramera or anything else I will check and ask does a users manual come with this product.", "Date": "October 23, 2009"}, {"Title": "Kodak easy share c913", "Author": "Gee Gee \"picture\"", "ReviewID": "R14QHS23SOCOOA", "Overall": "4.0", "Content": "My husband and I are very happy with the C913. We have been checking to see if we could have bought it at a lower price, but to date we have not found it cheaper any place else. We feel we received the best deal purchasing it on line.", "Date": "February 20, 2009"}, {"Title": "Camara Kodak de 9.2\"", "Author": "Mary Bracho \"MMBS\"", "ReviewID": "R281DU2P5E6HZ1", "Overall": "5.0", "Content": "Kodak EasyShare C913 9.2MP Digital Camera with 3x Optical Zoom (Silver)Excelente camara, con una buena resolucion, lo unico que le faltaria a la promocion es que la misma ya viniera con una tarjeta de memoria de por lo menos 1 giga, su estuche para guardar la cam y su cargador de bateria, ah y unas pilas recargables, por lo demas excelente.", "Date": "April 4, 2009"}, {"Title": "GREAT CAMERA", "Author": "Jay Molnar", "ReviewID": "RJADYFQHKVPRO", "Overall": "5.0", "Content": "I BOUGHT THIS CAMERA FOR MY DAUGHTER FOR NEXT CHRISTMAS, SHES GONNA LOVE IT, THANKS FOR THE GOOD DEAL.  THANKS, RONIE CROSBY", "Date": "March 26, 2009"}, {"Title": "VERY SLOW SHIPPING!", "Author": "J. Combs", "ReviewID": "R14U1P2UOV5ISD", "Overall": "3.0", "Content": "Product is good.  Works well and automatic mode does a very nice job of getting white balance and shutter speed.  Shipping was Very slow.  Even though it was free, took almost two weeks.  Within a day or so of delivery, I found the same camera at a local store for slightly less money.  Would encourage one to compare local stores before buying online.  Good camera.", "Date": "May 30, 2009"}, {"Title": "If KODAK can't do better than this, they should quit!", "Author": "Amazon Customer", "ReviewID": "R3LN1WT86UZ8T7", "Overall": "1.0", "Content": "I have never been so disappointed!  The still pictures can be OK, but forget the video function: if you try to zoom in while taking a video you'll see about 25 pixels per inch! And the camera does not play back sound captured while taking a video.  And their picture management software does not do as well as others I have used, such as PICASA.  When I called KODAK to request a refund, the 800 number I was told to use was for service; they told me they do not handle refunds.  When I asked them to transfer me to whatever department does, they were unable to!  You can bet it will be a long time before I buy KODAK again.", "Date": "November 20, 2008"}, {"Title": "This is the most crappiest camera ever", "Author": "J. Carucci", "ReviewID": "R37F3MH9L118VK", "Overall": "1.0", "Content": "This camera is full of crap! Its crappy everything! What people said before in this review, this camera I have won't turn on at all. It only works for a day or 2 and then it won't turn on after that. Don't waste your money on this. Kodak sucks!!!", "Date": "July 7, 2009"}, {"Title": "Crappy crappy crappy", "Author": "Teresa Fudge", "ReviewID": "R3F2AV6H1UNBNI", "Overall": "1.0", "Content": "This is a piece of crap camera. The buttons are tiny. The battery door is flimsy. The pics aren't anything special. Kodak sucks.", "Date": "November 28, 2008"}, {"Title": "I got my camera,", "Author": "K. Anderson", "ReviewID": "R2CYV7K1HW81DI", "Overall": "4.0", "Content": "and as I promised, I would review it. I believe this camera best suites someone who is looking for an upgrade from a lower megapixel to a higher megapixel camera and not vice versa [like me]. It does take great pictures, don't get me wrong, but once you've had a 10.3 MP and drop to a 9.2, you will be comparing images for a while. My camera also came with a mini charger and rechargable batteries [which does not work and makes me consider taking the camera back, considering reviews say it eats batteries] and a cute little drawstring bag that you have to shake a dozen times until the camera comes out. [Please note that the camera I'm reviewing does NOT come with the charger and drawstring bag] I've recorded one video and I cannot hear sound during playback and I am unable to make it play through my computer, so I do not know if it has sound at all. Despite my battery mishap and my megapixel downgrade, this little camera can and will get the job done. Hope you like it!! Thanks for reading!!", "Date": "December 13, 2008"}, {"Title": "NO Good", "Author": "G. Moore", "ReviewID": "R2TB2LMASTE5E", "Overall": "1.0", "Content": "The Kodak \"EasyShare\", You can share photos easy, but they deleted all of my photos from my online album, because Kodak had a \"Terms and Condition\" change.  They said they sent an email, but I get so much junk I did not see it, they deleted all of my photos that I can not get back, because I did not purchase $5.00 worth of prints.  I did not see the email, so now my children, grandchildren, family photos are gone, with no way to get them back.  I would not recommend ANY Kodak EasyShare anything. I do not know how a company can delete something like this without having someway of knowing that you have received or agreed to there term changes.", "Date": "August 28, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "9.2-megapixel resolution for stunning prints up to 30 x 40 inches\n3x optical zoom lens, 5x digital zoom; HD still capture and VGA video\n2.4-inch indoor/outdoor color LCD\nBlur reduction, multiple scene, color and shooting modes\nCompatible with SD/SDHC memory cards (not included)", "Name": "Kodak Easyshare C913 9.2 MP Digital Camera with 3xOptical Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41KrKJ0xjdL._SY300_.jpg", "ProductID": "B001BX6HFC"}}