{"Reviews": [{"Title": "great little camera; not so great PMP", "Author": "A. Godshall", "ReviewID": "R1W1KNRGUODFOK", "Overall": "3.0", "Content": "This great little camera takes pretty good shots, though there is just a little bit more artifacting going on when I take pictures of text than my old LonicaMinolta Dimage X1.I paid a little extra to get this camera over the other Samsung 8.1MP camera because of the PMP (portable media player) feature after seeing the onboard demo video, and while it does have a great little screen it doesn't seem to take any kind of standard video (I tried lots of different mpeg4 and mov and avi files and they wouldn't even show up on the menu)- you have to use the video converter they supply, which runs on proprietary OS only.As an MP3 player, it's OK, and it does let you delete a file after you've listened to it (which is a key feature if you listen to podcasts).There also seems to be no way to charge and listen at the same time- the USB/charge cable and the headphone jack go into the same connector.  I guess I'm buying an external battery or two and an offline battery charger.", "Date": "June 16, 2008"}, {"Title": "Great little camera", "Author": "RC", "ReviewID": "RVNG2PVNOCOTQ", "Overall": "5.0", "Content": "I bought this camera elsewhere for $99.99 and have been VERY happy with its performance with regards to its camera function.  It takes good pictures in both low light and during the day.  It has a very convenient size and easily fits in your pocket.The MP3 and video functions are a nice bonus, but to be honest, I have not had a chance to try them out fully yet.", "Date": "August 1, 2008"}, {"Title": "Quality photos but PMP is realtively weak", "Author": "Nathan Beauchamp \"ConsumerAdvocate (nathan(at...", "ReviewID": "R2XUVWNNQQ7APL", "Overall": "3.0", "Content": "Recently there is a trend to make every electronic device into a multifunction device. A cell phone that also plays mp3s and take photos is the most common instance of this, but it appears camera makers are catching on and creating cameras that double as PMPs (Personal Media Players). What's good for the goose...However, in my mind having a camera on a cell phone is adding a feature to a device you're going to carry around with you anyway. It gives you a functional camera for those times when you don't have your real camera with you. I'm not sure that a camera that doubles as a PMP is really as good a concept because when I bring a camera with me its so that I can capture excellent images, not listen to some music.In point of fact, the Samsung I8 is primarily a camera, and the PMP features feel a bit tacked on and burdened by confusingly designed menus that are not very intuitive. The camera features are somewhat easier to access, and this a slick, attractively designed camera to be sure.Thankfully that I8 knows how to be a camera not just a convergence device. The photos that it produces are pretty sharp, and the metering feels pretty spot on in most situations. However the camera is haunted by some serious shutter lag and this is probably the most irritating problem with the camera. It is slow in general: navigating menus is slow, booting up the camera is slow (thanks to the PMP needing to do a database search each time it boots. You cannot turn this off) and taking pictures is slow.The I8 is just about average. It's more of a gizmo than a camera. If you want a solid camera I suggest getting a Canon Powershot. Their light sensors are among the best. If you want a PMP get a Cowon D2. At this point a camera that doubles as a PMP doesn't get either application quite right.", "Date": "February 11, 2009"}, {"Title": "i love it!", "Author": "Boon Y Kim", "ReviewID": "RUH86CGXIYGUZ", "Overall": "5.0", "Content": "i still have this camera and its so cute with cute features. i like that it has an mp3 player. you cant put in too many songs but quite a few goes in there. its pretty tiny and light weight. i would recommend it to people who's looking for a decent camera.", "Date": "June 24, 2013"}, {"Title": "YAAYY :) SO CUTE", "Author": "KAP", "ReviewID": "R2Z6YNI4QTG8FK", "Overall": "5.0", "Content": "ITS SOO CUTE!! :) IF U LIKE CUTE THINGS AND BEING CUTE..GO FOR ITOV COURSE....I >ONLY< USE THE CAMERA ASPECT OF IT..NOT ALL THE EXTRA CRAP..IF U WANT A GOOD MP3 PLAYER, BUY AN MP3 PLAYER..THATS LIKE GOING TO A BURGER JOINT AND EXPECTING EXCELLENT CHICKEN..NOPE.BUT IVE HAD IT FOR YEARS AND ITS NOT MESSED UP ONCELOVE IT!!", "Date": "July 14, 2010"}, {"Title": "Good photo quality, awful UI", "Author": "Hoping Amazon Dies \"bankruptcy would be fine\"", "ReviewID": "R3P1LGJF99IL7V", "Overall": "2.0", "Content": "Photo quality is excellent.  The UI, on the other hand, is cumbersome and poorly conceived.  Switching from photo to movie, which I do all the time, requires several button presses, with slow UI screen paints in-between each.  I get the sense that they tried to give it a flashy UI in order to appeal to the teen demographic, without considering those of us who just take photos and movies and want a snappy response from our device.Ditto the flash.  The flash does not pre-charge, so when you go to take your photo, and press the fire button, nothing will happen for a couple of seconds while the flash charges.  Those are a looonnnnnggg couple of seconds too.  Nor does the UI respond while this is taking place.  Multi-threading, anyone?(The UI contains a ton of other neat-sounding goodies, like an MP3 player and a travel guide and other hoopla that looks good as bullet points on a sales flyer.  Perhaps some people use those, but I didn't and you probably won't either.)I accepted its shortcomings because the camera has two killer design wins: first, the lens does not extend out of the camera body, which means that it won't get dirt or water in the mechanism and die young; and second, the camera itself is small and has rounded edges, which means it will fit neatly in your pocket.  I did indeed carry it in my pocket and whip it out whenever it was needed, and so I have had a happy year of taking great pictures while cursing at the lousy UI....until the hardware failed this month.  Around my 1500th picture (according to the filenames), a solder terminal inside the camera gave out, taking the red CCD with it.  Consequently, the camera sees everything as blue-greenish.  I can twist the camera body, and flex its motherboard enough to reestablish the electrical connection to the red CCD, and it will work for a couple of minutes, but this won't last long.  (I know it's the CCD and not the viewscreen because picture review always works fine.)  They call this situation a \"cold solder joint\", and it will worsen over time until the camera becomes useless.  I may just be unlucky, or maybe this is a demonstration of poor quality control on the Samsung assembly line.", "Date": "November 26, 2009"}, {"Title": "My camera has been in repair for 5 months...", "Author": "Sarah Walker \"Sarah\"", "ReviewID": "R2T732T727PAQX", "Overall": "1.0", "Content": "I bought this camera in January after reading the reviews on this website, as it looked great and was an ideal size. I had the camera for a month before the lens cap broke, at which point I sent it off for repair.Since then I have been having an ongoing battle with Samsung to fix/replace my camera. I have now been without a camera for 5 months. Their customer service is appalling.I might have more positive things to say about the camera if I had been able to use it for more than a month...", "Date": "July 10, 2009"}, {"Title": "I love this camera", "Author": "Sophia Walters", "ReviewID": "R3UQISP82ODT8M", "Overall": "5.0", "Content": "The Samsung i8 8.2 MP was def the best choice, I wouldn't want any other camera. It has such a good picture, even in the dark. I love the new design and the color and that's why I bought it. I am more than satisfied with it's performance and the buttons are just the right size for me. Love it!", "Date": "December 23, 2008"}, {"Title": "Great Little Camera", "Author": "LitoLaMaravilla \"Lito**\"", "ReviewID": "R1HKHBZT1FABRO", "Overall": "4.0", "Content": "I bought this camera about 2 weeks ago and it had a nice zoom, nd was very easy to store in any pocket. I am happy also with the PMP only thing is that i can not charge and listen which is bad but hey i saved a good penny so i could afford a recharchable battery..Camera is wellworth the price nd is sleak...", "Date": "December 16, 2008"}, {"Title": "I LOVE MY CAMERA!!!", "Author": "Autumn W. Williams \"AutumnWheat\"", "ReviewID": "R1ZQP38B3GIMEF", "Overall": "4.0", "Content": "The ONLY problem I have with this camera is the screen gets scratched up REALLY REALLY easy! I would recommend getting some sort of a clear protector for the screen.", "Date": "December 15, 2008"}, {"Title": "Not Mac friendly", "Author": "D. Suits \"bookemdano\"", "ReviewID": "R248JMKII9CNY5", "Overall": "2.0", "Content": "This camera has a nice design, the camera itself is great but the media player/mp3 player conversion software is not compatible with the Mac OS.  The driver is for windows only.  Its a shame because the style resembles the Apple brand, one of the reasons it caught my attention.  Also, the buttons are very small and difficult to press without using your fingernail.  The USB cable/charger adapter is a great design, one less cable to worry about.The interface is user friendly as well.  If you have big hands you may find this camera to be cumbersome.Its very disappointing that I wasnt able to utilize the various functions, Samsung has dropped the ball on this.", "Date": "December 11, 2008"}, {"Title": "chic and cute, worth price", "Author": "Mohd Naszeri Jaiman \"matstar\"", "ReviewID": "R3NZ4IRGE5IK72", "Overall": "5.0", "Content": "this camera is awesome! u should buy this kind of camera because it has everything u need for entertainment ( mp3 player, PMP, and etc ).no need to buy camera and mp3/mp4 player separately.", "Date": "November 23, 2008"}, {"Title": "GOOD CAMARA", "Author": "A. Nienhuser", "ReviewID": "R3FTFLQ9S430L3", "Overall": "4.0", "Content": "this is the camara that i always wanted,i recommen it,clear pictures,good batery,small that fit in your shirt pocket, I am very happy with it.", "Date": "November 23, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.1-megapixel resolution for high-quality prints up to 30 x 40 inches\n3x optical zoom; digital image stabilization\nFace Detection technology; Red Eye fix\n2.7-inch LCD screen; listen to MP3s or watch video in PMP mode\nCapture images to SD cards (not included)", "Name": "Samsung i8 8.2 MP Digital Camera with 3x Optical Zoom (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41fC3PLmjCL._SY300_.jpg", "ProductID": "B00127ZES8"}}