{"Reviews": [{"Title": "Fine camera, but also check out the A590 IS", "Author": "Julie Neal", "ReviewID": "R2MHRRAVQL3FFB", "Overall": "4.0", "Content": "These PowerShot \"A\" cameras are Canon's attempt to deliver the quality and features of its more expensive PowerShot \"G\" and PowerShot Pro \"S\" lines (such as full zoom lenses) at a budget price. The results are pretty good. (How do I know? Because I've actually gotten to use all of these cameras. I earn my living at Walt Disney World writing a travel guide, and nearly every day guests ask me to take photos of them with their own cameras, which most often are Canon PowerShots.)Here's my opinion of the top-selling \"A\" series cameras:7TH PLACE: Featuring Canon's acclaimed Digic III processor, the 2007-model A560 includes the company's face-detection metering system and a decent red-eye removal. It's a nice camera, but a better value is the new A470 (see below). $150 list.6TH PLACE: The A570IS is the same camera as the A560 but with optical image stabilization and the ability to shoot manually. $200 list.5TH PLACE: You can do a lot with the sweet little A630. It's a 2006 model, but has a flip-out LCD panel and lots of manual controls. The shots I've seen from this model look great. Keep your ISO under 800 and you won't get any noise. $350 list. (Canon offers a 2007 version of this camera that I haven't had much experience with yet, the A650 IS. It also lists for $350.)4TH PLACE: The 2008-model A580 (the camera on this page) is a 2008 upgrade to the A560. The face detection system works a little better than the one on its predecessor, and the new model is slightly rounder and easier to grip. A fine performer and a great bargain. $150 list.3RD PLACE: The fully-loaded A710 IS has all the toys, including a full-range zoom (35mm film equivalent of 35-210mm), adjustable flash power and optional second-curtain flash. This last feature means you can make the flash fire at the end of a long exposure, instead of the beginning, so moving subjects streak into focus instead of out. A 2007 model. $500 list.2ND PLACE: The 2008 entry-level A470 is great for kids or anyone just looking for a good basic camera. But frankly, it's better than basic. It includes Canon's face detection technology and has a zoom lens, 14 shooting modes and the ability to set exposure compensation, ISO and white balance manually. Plus it looks great. Everyone with this little camera always seems to be having fun. $130 list.1ST PLACE: The A590IS is the A580 (see 4th Place, above) with image stabilization and with the option of full manual controls. For an extra $30 those features are well worth it. I bought this model for myself. $180 list.", "Date": "March 10, 2008"}, {"Title": "GREAT CAMERA for the price!!", "Author": "Michelle R. Anderson \"Michelle\"", "ReviewID": "R3FQW4D7KUMX2M", "Overall": "4.0", "Content": "I purchased this camera as a replacement to a canon A510.  I really LOVE this new camera.  They improved some features like increasing the size of the review screen and made some options a lot easier to use (like turning flash on/off, timeers in a better spot, deleting pic's).  It takes GREAT pic's and is very lightweight and easy to use.The ONLY DRAWBACK - the moved the SD card.  Before it was in its own spot and it was very EASY to open and close.  ON this model, they moved it with the batteries and to open that cover, you have to push a littler button, and push down at the same time and then slide the cover off.  Doesn't sound that tough but it takes a lot more time to get that open and sometimes it takes a few tries to get it open.That is why I rated it 4 stars instead of 5 stars.  Other than that - I LOVE this camera!!!  Get a lot of features for the price!!", "Date": "June 1, 2008"}, {"Title": "A very good camera for the price", "Author": "E. Birowo", "ReviewID": "R3S7HFP4HUXG08", "Overall": "4.0", "Content": "I didn't really have a good experience with my Canon 35mm compact camera before, so I was pretty hesitated to order this one. But compare to my ancient Sony DSC P92 & Nikon  coolpix 4300, this Canon A580 is the best for the price. It has all the features of a more expensive camera & so easy to use. Came with a software and AA battery. The only bad thing from this camera is whenever I set it into night mode the picture always turned out blurred. But other than that everything is good, just have to have an extra battery with you all the time.I ordered this camera from Amazon & it arrived withing 3 days. The shipping was free & no sales tax even made it a better bargain.", "Date": "March 7, 2008"}, {"Title": "What a great little camera", "Author": "Mr. D. Joseph \"usrpguk\"", "ReviewID": "RESLIKOECLNIK", "Overall": "5.0", "Content": "I bought this camera for my trip to the States recently, and all I can say so far is, absolutely great! Bought from Amazon.com and delivered in 2 working days - spot on!I have to admit, I am one for trying to use something without having to bother with reading instructions. Thankfully, this camera is definately user-friendly. It is so easy to use. Sure there are more sophisticated options available to use on this camera, that will I probably need to address the manual for but, for a camera that you can just pick up and shoot impressive photos straight away, this baby does the trick. Even at full zoom, the picture quality is not distorted much at all.I previously had a Samsung 8 MP camera, and the difference in quality of pictures this Canon takes compared to the Samsung are impressive. I could ramble on about how good this camera is, but if you are like me, you will just want to be re-assured that this is worth buying - IT IS!Easy and simple to use, great pictures (day or night), nice looking and compact camera. Oh and I nearly forgot, I don't know what Canon put in there batteries, but the standard alkaline ones that came with the camera are lasting ages. I have taking over 80 pictures so far and no sign of them running out (no doubt they will, now I have mentioned it!); very impressed.This Canon A580 PowerShot camera is a great buy!", "Date": "July 16, 2008"}, {"Title": "Canon PowerShot A580", "Author": "E. M.", "ReviewID": "R28U5IFLOBWALN", "Overall": "5.0", "Content": "Great camera at a great price...the only upgrade would be the IS feature on the next model, otherwise this is a perfect camera for the point & shooter or the pro who wants a pocket size device to take perfect, high quality pics. Buy it...", "Date": "June 11, 2008"}, {"Title": "Great little camera", "Author": "R. Spohr", "ReviewID": "R4N02IHFLT7IF", "Overall": "5.0", "Content": "We have a Cannon Digital Rebel XTI and wanted something smaller and easier to carry. This camera takes good pictures, is relatively fast, and has all the features you expect from a point and shoot.", "Date": "April 16, 2008"}, {"Title": "Great for the price!!", "Author": "N. Zapien", "ReviewID": "R30LJI5VHLT1C3", "Overall": "4.0", "Content": "I was hesitant about crossing over from Fuji to Canon but when I came across this camera on sale for such a great price I just could not pass it up.  I would have to say that it is probably not the best Canon out there but you would be hard pressed to find a digital for this price that takes great point and shoot pictures.  For the price you just can't beat it. I use the Sony rechargeable batteries and they work wonderful with this camera.  I uploaded a few scenery pictures to show the quality.", "Date": "June 14, 2008"}, {"Title": "Good camera for the price", "Author": "Charles E. Dunn", "ReviewID": "R1CBJ7H6BJJE86", "Overall": "4.0", "Content": "Upgraded from the Canon Powershot A70. Good camera for point and shoot photography. Definitely less blur than on the A70.", "Date": "March 28, 2008"}, {"Title": "excellent!", "Author": "C. Taucci \"Trouthog\"", "ReviewID": "ROEA73DMB5DED", "Overall": "5.0", "Content": "This is my 3rd Canon, first one got stolen,second one fell into water. They just keep getting better and cheaper.No problems whatsoever.Love it.", "Date": "June 7, 2008"}, {"Title": "Great for the price", "Author": "G. Simms \"Ireadlots\"", "ReviewID": "R3JNM0OCKHWRQ7", "Overall": "4.0", "Content": "Amazing how much better (and cheaper) digitial cameras have become in recent years. The number of true pixels has increased while prices decline. What I like about this one is the autofocus capability (which makes sure that faces are in focus) and the fact that yoiu can use it like a point and shoot or play with it if one is more adverturous. Does it provide all of the features a serious photographer would want? No. But is is certainly serviceable, takes excellent pictures, and is quite handy to use. The fact that it runs on regular batteries is a plus. The memory card it comes with is insufficient, so you'll need a bigger capacity card right away.", "Date": "July 24, 2008"}, {"Title": "Great value in a small package", "Author": "J. Solar", "ReviewID": "R2EM7Q5FZNNLVJ", "Overall": "5.0", "Content": "The Canon PowerShot A580 was exactly what I wanted:  a small camera that would fit on a belt in a case or around the neck, one with an actual optical viewfinder in addition to the LCD screen, decent optical zoom (4X), a brand with a good reputation, and good value for the money (about USD $150).  This camera has all of these features.Because I have used Canon cameras in the past, the dials and buttons are almost intuitive now although there are some differences which were easy to learn.  Adjusting for light variation in the shot (light background and dark foreground) was difficult to do quickly.  Fortunately, one can easily make adjustments on the computer using Adobe Photo Shop (the less expensive version).  I would recommend a larger SD memory card than the one provided or the maximum available through Canon (512MB.While I prefer my Canon Digital Rebel SLR camera for overseas travel, this A580 is perfect for city shots, candids of friends or family, and as a backup camera.  I would recommend this camera without hesitation.", "Date": "August 31, 2008"}, {"Title": "A Nice Surprise!", "Author": "Nursing student", "ReviewID": "REQ309EW9RW8M", "Overall": "4.0", "Content": "I currently have a Canon Rebel Xti but honestly, it is just too bulky.  So, in order to take decent pictures on family trips and such, I chose this Canon Powershot.  I gotta say, I am very impressed with this camera!  For a little, hand-held unit, it's got a lot of options on it.  It's very easy to use, and it fits in my purse.  The screen is nice and big. I really don't have anything bad to say about it.  The batteries I put in when it came to me (I didn't use the ones that were sent because those packaged batteries never last long) two weeks ago are still in there, with full power.  I've transferred the photos a few times and do definitely recommend purchasing at least a 2 gb memory card because the smaller cards don't fit many pictures on them but that's the case with all cameras.  If you are a person that likes to take pictures of family, friends, parties, pets, and want mobility in your camera, this is the one for you!", "Date": "August 29, 2008"}, {"Title": "Would definitly purchase again!!", "Author": "D. Reiter-Messer \"photo nut\"", "ReviewID": "R36WR25TK6NA3N", "Overall": "5.0", "Content": "I am extremely impressed by the ease at which I was able to learn all the ways to use it. The pictures are perfect and the ability to make moives is halarious. It is soo very sturdy that it can be taken on all my excursions. Would definitly suggest all my friends to buy one.", "Date": "May 19, 2008"}, {"Title": "Great Snap Shooter", "Author": "R. Williams", "ReviewID": "R1FNSI2INAKKRG", "Overall": "4.0", "Content": "My wife wanted a camera that was easy to use and it has worked really well for her.  She gets good, clear shots and even the movies are acceptable quality.  Don't expect the quality you might get from a high end digital camera, but it is very good for every day use.", "Date": "June 12, 2008"}, {"Title": "review of Cacon Powershot", "Author": "Dr. John A. Stefferud", "ReviewID": "RZCOMF6PW731E", "Overall": "4.0", "Content": "Amazon was prompt in sending product, Canon camera is as advertised and in great shape and included every booklet and accessory needed. Canon PowerShot A1100IS 12.1 MP Digital Camera with 4x Optical Image Stabilized Zoom and 2.5-inch LCD (Silver)", "Date": "January 7, 2010"}, {"Title": "great camera", "Author": "Kristi Lanford", "ReviewID": "RWER8Y9Z9QUTH", "Overall": "5.0", "Content": "wow - what a great camera.  The features that I wanted was EASY to operate, point and shoot camera.  That is exactly what I got.  Just a great camera that fits in your hand, slides in a purse to go anywhere and be ready at all times to take great pic's of kids.  It does use AA battaries but with 4 kids I keep a lot of those on hand.  Also, I have been told that if I would use the lithium AA they would last longer.  Really easy to put pic's on my computer and share them.  I really like this camera!!", "Date": "November 16, 2008"}, {"Title": "Great Entry Level Digital Camera - Tons of Features", "Author": "Nuknuk", "ReviewID": "R2DFQOMPOXTHP6", "Overall": "5.0", "Content": "Excellent entry level camera for your $.  (Compare with Canon A590 IS before you buy)Pros:- 8 megapixel- Excellent image quality. It has Canon's Digic III image processor.- Canon Genuine Face Detection Technology.  Automatically detects, tracks, focuses and optimizes the exposure on up-to nine human faces in the frame.- Good in low light- Long battery life.  Uses 2 regular double AA batteries.- Zoom is 4X.- Fast startup. When you turn on the camera, you can almost shoot right away.- Huge 2.5 LCD screen + viewfinder- Manual control for ISO (80 to 1600)- Built-in speaker- Shoots 640x480 video with audioCons:- Feels small and awkward in your hands- Looks", "Date": "November 13, 2008"}, {"Title": "Great quality.", "Author": "Anonymus", "ReviewID": "R3W14L0H15YCJA", "Overall": "5.0", "Content": "I did a little research before buying a camera and when I saw the sample photos and videos shot with the A580 I didn't look further. This was all I needed. The photos are all clear and huge. I took a shot in complete darkness and it came out like I shot it at daylight. I really can't find a flaw to this camera. Even the price is excellent. One of the best things I ever bought.", "Date": "September 30, 2008"}, {"Title": "great little camera", "Author": "Sue \"sweetiepaws\"", "ReviewID": "R17V5LLQSUVQY8", "Overall": "4.0", "Content": "Easy to use, great pictures.  Wish it came with carry case to protect it though", "Date": "September 23, 2008"}, {"Title": "Buy one!", "Author": "Taube", "ReviewID": "R1PO6YNOP0BE7J", "Overall": "5.0", "Content": "We recently returned from a month long trip,  my wife has a Canon A540 and I was using a Sony DSC700. There is no comparison in the quality of photo's between the two cameras...we both shot several hundred photo's...the Canon photo's won hands down! So I purchased a new Canon A580 and we both love it. Plus now the the SD cards can be used in either one...Sony uses a proprietary duo-card....Canons for us from here on out.", "Date": "September 22, 2008"}, {"Title": "GREAT CAMERA, GREAT PRICE==", "Author": "cappy", "ReviewID": "R308QBLA1TUDIO", "Overall": "5.0", "Content": "When it comes to digital--forget me, I am a ranked novice.  But after reading the discriptive booklet, started to get a good idea of this A580. This is a great camera for the money, and the sample photos I'm taking are out of this world. My recommendation, [if looking for a good digital], BUY!!", "Date": "July 24, 2008"}, {"Title": "Looking good", "Author": "W. A. Wood", "ReviewID": "R15DVMHPI8DK9L", "Overall": "5.0", "Content": "Purchased to replace 4 1/2 year old digital camera. Thus far it is easy to use, produces excellent pictures and videos. Very satisfied with the performance.", "Date": "June 11, 2008"}, {"Title": "Disappointed after 18 months", "Author": "Rob \"Rob\"", "ReviewID": "R1PQG1TD4DP5EN", "Overall": "1.0", "Content": "We purchased this camera 18 months ago for our trip to Hawaii. It took some great scenic pictures. Indoor pictures are another story,we had noticed the Red-Eye on subjects was very bad, even with the Red-Eye settings set to On. Every batch of photo's we had taken we have had to use photo editing software to remove the red-eye problem afterwards. Today the internal flash quit working. I changed the batteries, pulled the CMOS Battery and let it power down in hopes it would reboot. With new Batteries the flash still would not work. Since we were not overly-impressed with the quality of the pictures anyways, I salvaged the Batteries and the SD Card and tossed the camera in the garbage. We will not even check into getting this fixed.Our Kodak DX4530 is 8 years older, been dropped numerous times, been thrown on accident, rainstorms, hunting and hiking trips, tossed around in backpacks, suitcases and glove boxes and even forgotten in a hot vehicle for two weeks and still works to this day. The Canon PowerShot had a pampered and very easy life in comparison and was not ever dropped, been wet or thrown. I would consider looking at another camera before considering the purchase of this one.", "Date": "February 27, 2010"}, {"Title": "Wonderful Camera for the price", "Author": "Lamia L. Ferdous \"nycsmaruf\"", "ReviewID": "R1C07B0C5L2CCO", "Overall": "5.0", "Content": "when you have a cannon, you don't need over 8.0this camera works, pictures are wonderful, it will beat any camera of another brand around 12 megapixel. it was very cheap,i would recommend anyone buying it", "Date": "June 14, 2013"}, {"Title": "Great Camera", "Author": "Betsy", "ReviewID": "R1UGEWZIVOJ399", "Overall": "5.0", "Content": "I already had one of these cameras & when it could not be repaired, wanted another one.  It is absolutely the perfect camera for an amateur who wants to take professional-type photos.", "Date": "January 4, 2013"}, {"Title": "Just Good for Pictues While Videos are Tricky", "Author": "Nicole Lane \"Nicole\"", "ReviewID": "R1I04FMLK47E0F", "Overall": "4.0", "Content": "Ever have that terrible experience with cameras? Well for me, it's the video experiences the most. Do not buy this camera if you're wanting to upload videos because it'll cost ya! Unless you are smart, loves experimenting on technology, and handles electronics well... don't buy this!", "Date": "July 3, 2011"}, {"Title": "Canon A580", "Author": "P. Simonson \"\"FloridaWing\"\"", "ReviewID": "R3UIW9IQL84GII", "Overall": "4.0", "Content": "This A580 was purchased for my 8 year old grandson who will find it easy to use and dependable.  Among its best features are AA batteries, not some proprietary & costly battery designed for and (usually) only available from the manufacturer at a high price - AA's are available everywhere, and the A580 only takes 2.  Another feature is the SDHC cardslot - the first thing to do is purchase a 2GB to 4GB card which will give you more available storage than you will need, even shooting at the highest resolution - the cost for SD cards is so low you can afford to have several spares.Reviews generally indicate some limitations to the A580, especially in low light situations or with higher ISO settings. Know your limitations - a camera IS NOT capable of doing the impossible.  Use it properly and the results will be very good.  Another limiting factor is the recycle time for flash use, especially with standard AA batteries.  Using higher capacity rechargeable NiMH (nickle metal hydride) batteries cuts down time-between-shots greatly.  NOTE:  Get a good set of 4 rechargeables and a rapid charger - you'll have 2 sets always on hand.)  Also, the lack of manual controls limits the user to only the automatic settings, but they are varied enough to cover most shooting situations.  IF that is an important factor, consider the A590 - the current direction of Canon is to provide fewer and fewer manual controls and more automatic settings, so that doesn't seem to be a major consideration to the majority of current Canon point-and-shoot users.Among the complaints is the size of this camera - I find that an advantage - the new tiny, slim camera models are very hard to use for someone with large hands and are so small as to be easily misplaced or lost.  Try to use one of the new cameras with gloves on...impossible - give me an A-series from 2006-2008 anyday and it will take comparable pictures much easier.In my opinion, Canon has taken a monumental step backwards by redesigning their current line of point-and-shoot cameras.  In comparison to those offered now, the models offered between 2006 and 2008 were superior across the board in quality, dependability and user-friendliness.  The A580, although no longer in production, remains a very good camera, especially for young or casual users.  Don't sell this model short - obviously the earlier models are still sought-after and the selling prices for many are actually higher than they were new.", "Date": "June 8, 2011"}, {"Title": "Poor IQ", "Author": "Thomas B. Cass", "ReviewID": "R27068LPO1KDP3", "Overall": "1.0", "Content": "My wife has this camera. I own a Sony A100 DSLR. Maybe if image quality isn't very important to to this camera may be OK but, personally, I think the Image Quality is horrible, about on a par with those old film cameras that used tiny film. I couldn't recommend this camera to anybody. Absolute garbage IMO.", "Date": "September 21, 2010"}, {"Title": "This camera has 9 lives!", "Author": "KJ", "ReviewID": "R2N8V9EXD7KH85", "Overall": "4.0", "Content": "First off, this is a great basic point & shoot camera that doesn't require a lot of fiddling with for good pictures.  It does have a lot of settings you can use if you know what you're doing, but the auto mode actually works quite well in most circumstances.  The picture quality is above average for cameras within this price range, and it's nice to have a view finder on those very sunny days when you can't see the screen.  I've had mine for a couple of years now and I've really beat it all to hell.  And still it keeps on going...  Doesn't seem to eat batteries the way some of my other cameras in the past have done.  I got a bit of sand in the lens and it wouldn't shut - I forced the lens closed and left it alone for a day.  Gave it a good dusting and powered it back up and it worked just fine!  Same thing happened again with the same result.  THEN it got completely soaked when it popped out of my pelican case when doing a random waterfall slide while hiking... not only was it completely submerged, but it skidded across a lot of rough rock.  I thought for sure it was toast.  I took the batteries and SD card out and left it out for a day to dry.  After 2 days the camera works just as well as before with one exception:  I can't seem to figure out how to keep the date/time set - which can be a PIA when uploading 600+ pictures.  Nevertheless I was truly amazed - I was thinking it was my opportunity to upgrade to a waterproof/shockproof camera I had my eye on but the camera gods don't think it's time for that apparently.  So while there are some things I don't like (a bit bulky, can't carry in my pocket - panoramic could work better - sometimes get grainy pics randomly even though it's likely operator error), this has been a fantastic camera all in all - very tough.  Would definitely recommend it.", "Date": "August 23, 2010"}, {"Title": "GREAT camera", "Author": "somehearts", "ReviewID": "R1BGR9OK7RCKBO", "Overall": "5.0", "Content": "My dad has had this camera for awhile now, and it still works REALLY well.  We've never had any problems with the camera.  I actually like this camera better than my Kodak EasyShare C7430.  Now I'm in the process of getting myself a new camera and I'm not really sure what I want to get.  As much as I love my dad's, I'm not sure if I want to get the same camera he has.  In fact, I think it's time I give his camera back to him.  Two things I LOVE about the Canon Power Shot are the zoom and video features.  I love the fact you can just push the button and make a video.  I also like the zoom feature on the Canon Power Shot.  I want a new camera that has the video feature and a better zoom on it.", "Date": "June 22, 2010"}, {"Title": "Love it", "Author": "Missy", "ReviewID": "R38NNSKJANQE7Y", "Overall": "5.0", "Content": "I have had this camera for some time now and it is still fabulous. I bought more for my family ( mom, etc.) and everyone loves it. Of course there are better out there, but it is a great buy and pics come out clear and beautiful. The batteries need charging OFTEN as pretty much all digitals. keep extra batteries around always that are already charged and ready to swap.  Would absolutely recommend this camera either way.", "Date": "January 9, 2010"}, {"Title": "Good pocket camera", "Author": "K. Anderson", "ReviewID": "R3L9Z7SQ9NXZ49", "Overall": "4.0", "Content": "Nice point and shoot camera to carry around. Takes excellent pictures in daylight, but you do not have control of camera speed or aperature settings. When indoors the flash is very slow to recycle.", "Date": "October 7, 2009"}, {"Title": "An Excellent Choice", "Author": "Bill McLean \"Serious Enjoyment\"", "ReviewID": "R2UHMZXIAD6IVO", "Overall": "5.0", "Content": "I cannot add much to what has already been said by happy buyers.  I have used this camera for the better part of a year.  The Power Shot A580 is a really good little camera.  I did notice something that I do not think anyone mentioned.  That is, when one looks at the screen while taking a picture, a rectangle appears and quickly shrinks down to reveal the exact spot that the automatic focus is zeroing in.  For example, when a face is on the far right of the picture you will see the camera focus on that face by means of the rectangle zeroing in on it.  Wow!My opinion of the less than 4 Star critiques is that they had simply lost perspectives on what to hope for in a really small digital camera.  Their criticisms were sort of like those people who criticized the little bitty spy cameras of yesteryear because they did a poor job of portraiture and scenic photography.Yes, the A580 does not accept interchangeable lenses or accessories like polarizing filters, add on close up lenses, or add on telephoto lenses.  The A580 is just a very good all around camera that takes really good pictures very easily.  And it beats the daylight out of most other small sized cameras.Of course, even better pocket sized cameras are already starting to appear in the market place.  And in 2011 even better cameras will appear.  And on and on.  I have placed an order for one of these...another Canon that I will not identify here.  I will say that it has 12.1  mega pixels, HD movies at 30fps, optical anti-shake, and a lower price.  I cannot recommend this camera, at least not until I have used it for a few months.  It could be a dud.By the way, I purchased my A580 at a BiMart store in Oregon - on sale at a much lower price than is advertised by Amazon. If I were shopping for the A580 today, I think I might purchase the \"Used, as New Condition\" for one advertised on Amazon for only $110.00.  However, I did order my next Canon from Amazon.com.  I shop around.  'caviet emptor.'", "Date": "October 7, 2009"}, {"Title": "Big Isn't necessarily better!", "Author": "George J. Paquette \"Papa George\"", "ReviewID": "R1JA9ESIWP9GMH", "Overall": "5.0", "Content": "This camera is a techie's little dream. I have a large Sony SLR that does whatever I want it to except travel lightly. The PowerShot A580 does that for me. It's light and has all of the bells and whistles I need for getting that little extra push to make a picture even better. At the same time, my Muggle wife can put it in Auto and just point and shoot. One underated feature I really appreciate is the optical viewfinder. On bright days when the display washes out, I can still shoot with confidence. Most of the other popular brands don't have this feature so I didn't even consider their offerings.G.Paquette", "Date": "August 9, 2009"}, {"Title": "A580", "Author": "Belinda R. Stacy", "ReviewID": "RMYP52J2EQCC5", "Overall": "5.0", "Content": "excellent product. i have one at work for technical work,and was so impressed I bought one for home", "Date": "September 7, 2008"}, {"Title": "Great camera!", "Author": "C. Thull \"book diva\"", "ReviewID": "R38XOOW0S5SC6W", "Overall": "5.0", "Content": "This is the perfect camera for everyday use. The camera is lightweight and has a large display.  Great for taking along when you are out.", "Date": "August 29, 2008"}, {"Title": "Easy to use", "Author": "V. Tiley \"arkanthis\"", "ReviewID": "RX5RRH8YO3CP9", "Overall": "4.0", "Content": "I was pleasantly surprised by the features of this camera. It does have a few quirks to learn if you don't use the Easy feature, but other than that I've gotten some great pictures very quickly and easily. I had read online about the difficulty of opening/closing the battery/memory card compartment, but that hasn't been an issue at all. I would recommend it to people who just want the ease of picking up a camera and shooting without worrying about settings. A good camera for it's price.", "Date": "August 26, 2008"}, {"Title": "Great Camera", "Author": "M. Fisher", "ReviewID": "R2B50GQHKIIJQ2", "Overall": "4.0", "Content": "I loved my old Canon. I bought another brand as the price was good. After less than 1 year, I switched back to this canon. This is a great camera at a very good price. Shipping was also quick. Thanks", "Date": "August 24, 2008"}, {"Title": "Great P&S;", "Author": "M. Ester", "ReviewID": "R2AYYQIGKDGGDX", "Overall": "4.0", "Content": "I bought this camera to replace the older version that I had that broke. It is a great replacement. It's affordable, easy to use, and takes great pictures. The video quality is much better on this camera than older A series Canon Powershots. The body is very comfortable to hold and the screen on the back is large enough for you to really see what you photographed. The only complaint I have is that the viewfinder on the camera isn't exactly centered the same as the actual image so you are forced to use the screen on the back instead to get better pictures.", "Date": "August 20, 2008"}, {"Title": "Canon Powershot A580 review", "Author": "Ashley Searle", "ReviewID": "R3FPAHVPKL3ARN", "Overall": "5.0", "Content": "I have had cameras like this one in the past and I have loved them all! We had to replace the one we had because it was lost. The quality of the pictures is fantastic, especially on our photo printer. I don't think I will ever go with a different brand!! Thanks!", "Date": "August 19, 2008"}, {"Title": "Canon Powershot A580 8 MP digital camera", "Author": "Marlita C. Haviland", "ReviewID": "R3DU20MWCSXYED", "Overall": "5.0", "Content": "Canon PowerShot A580 8MP Digital Camera with 4x Optical ZoomThis camera takes excellent pictures and for a person new to digital photography, this camera is easy to use.  I would recommend this camera for any person, but especially those who are looking for a digital camera for general use.", "Date": "August 9, 2008"}, {"Title": "Very good camera for the price-", "Author": "Gardener -", "ReviewID": "R1O2BP7DIC2T14", "Overall": "5.0", "Content": "I am very happy with this camera for the price. It is my first digital camera and I haven't had trouble figuring out it's basic operation. Regular batteries don't last very long so I would advise getting rechargable batteries and a charger. The memory card that comes with the camera isn't very large either, so I am looking at buying one or two more sometime soon. The only  thing that has been a little bit dificult to get used to is the two click shoot. The first half click focuses the camera and the second click takes the pictures. That is a little bit different, but I am getting used to it, and overall I am very happy with this camera considring the price etc. It is also easy to upload pictures to the computer. One thing you have to be careful of is holding your hands still as you shoot pictures because this camera doesn't have image stablizer; nevertheless, I have only had a few blurry pictures because of this.", "Date": "August 5, 2008"}, {"Title": "Camera is Great", "Author": "S. Wynegar", "ReviewID": "R34CEKKTERZC6M", "Overall": "5.0", "Content": "I purchased the camera in June and I'm loving it. Takes great shots and is very easy to operate even though I'm a novice really. Size is perfect for me and I'm anxious to take on my cruise in January which is the main reason I bought a new one. I'd recommend to anyone looking for a nice, easy camera. My friends also have the same model and I guess that's why I chose it. Great price, great deal and arrived really quick.", "Date": "July 31, 2008"}, {"Title": "Great, easy to use camera", "Author": "Carrie K.", "ReviewID": "RXRVVWPXBAKDT", "Overall": "5.0", "Content": "This camera is so easy to use and the pictures turn out wonderful. Great if you are just looking for a point and shoot camera.", "Date": "July 27, 2008"}, {"Title": "Better Than Hoped For", "Author": "Herman W. Duncan \"Wayne D\"", "ReviewID": "R176471E97BAXJ", "Overall": "5.0", "Content": "This camera has been a delight. We've taken a couple of thousand pictures (including our granddaughters wedding)since its purchase and still have not explored its features fully. Get it!", "Date": "July 25, 2008"}, {"Title": "Good product, great price from Amazon", "Author": "M. Ramakrishnan", "ReviewID": "RYI95PFZ158OG", "Overall": "4.0", "Content": "A very good camera. I presented these to my kids and both love this camera. Its better than the Sony camera I bought them 3 yrs ago.I got a good price at Amazon.", "Date": "June 28, 2008"}, {"Title": "VERY GOOD CAMERA", "Author": "John L. Simmons", "ReviewID": "R24F0RUCGVQ9DD", "Overall": "5.0", "Content": "The Canon Power Shot is an excellent camera for anyone to use.  It is simple to use and it takes very good pictures.", "Date": "June 24, 2008"}, {"Title": "Nice product", "Author": "Y. Chen", "ReviewID": "R349ARPWKBU313", "Overall": "5.0", "Content": "very good pruduct, nice image quality, though it makes a little bit of a noise when you try to zoom in or zoom out, as long as the pictures are good I don't care.", "Date": "June 20, 2008"}, {"Title": "Great camera---too complicted instructions", "Author": "J. Brown \"Book Athlete\"", "ReviewID": "R142TDQ9L79T6F", "Overall": "4.0", "Content": "Need to get easier instruction booklet.  Very hard to get the camera to work with the p/c.", "Date": "June 12, 2008"}, {"Title": "canon powershot a580", "Author": "Jacqueline Walker", "ReviewID": "R15EQ6H5Q0AEMT", "Overall": "4.0", "Content": "versitle camera, easy to use, quick learning curve. wish it displayed battery life not just when low. nice variety of features.", "Date": "June 2, 2008"}, {"Title": "the canon powershot", "Author": "S. Simmons", "ReviewID": "R3SMFDRSVZ7YV4", "Overall": "2.0", "Content": "the canon powershot was great when i first used it. it took really good pictures. However, when the battery ran out and i changed them it would not work properly anymore. It would take about two pictures and then shut off. It would say change batteries. Even when I changed the batteries it still would stay on for just a moment then shut off.  I had to return it.", "Date": "June 28, 2008"}, {"Title": "The LCD went out", "Author": "Dara Raazi", "ReviewID": "R25TPI68MO7OD5", "Overall": "1.0", "Content": "Had the camera for about 5 months and used it seldomly until the LCD went all white except for a small sliver at the edge.  Not having an LCD made picture review in the field impossible, and so I sent in the camera for repair under the 1-year warranty.  Canon contacted me via email and stated that the repair would cost $79 plus shipping.  They determined that the malfunctioning LCD was caused by impact/pressure.  Upon questioning as to what kind of scenarios would lead to impact/pressure to the LCD, they cited the example of putting the camera in your front pant pocket then sitting down.  With the pants becoming tighter, the pressure on the LCD could cause it to break internally.  That's BS!  Canon won't warranty repair the LCD, and won't accept that it was essentially defective.  That was my third and last Canon.  I'm switching to Sony.", "Date": "July 28, 2008"}, {"Title": "A580: Fatal Design Flaw - DO NOT BUY", "Author": "S. Diggs \"Stringbean\"", "ReviewID": "R39D1PHY5Z4ZDL", "Overall": "1.0", "Content": "BUYER BEWARE: The A580 camera has a basic design flaw. The motorized lens is given to jamming and displaying \"Lens error, restart camera\" error message. Do not buy this camera, or any similar A Series Canon digital camera, as they all have the potential for this problem.Canon is currently stonewalling the public that no such problem exists. Use Google and do a quick search for the error message above if you have any doubts that this isn't a widespread problem.I just bought a A580 through a factory upgrade of my defective A530. Within 15 minutes of the first power up, I started getting the Lens error message. The camera is a factory refurbished unit, so no way Canon should not know this camera has a problem.Maybe the best way to get Canon to deal with the problem honestly is to start listing serial numbers of Canon digital cameras and their problems, so that if Canon rotates the serial number back into stock, the next poor sucker will find out the serial number history and know that it is already bad. Please post your serial number and the problems with it so Canan can't get away with recycling known defective cameras.A530Serial Number: 24221173871. Internal flash defective2. Lens felt lining debris in view finder3. Battery contact problems - AA battery contacts make loose connections after several yearsA580Serial Number: 6552101659Problem:1. \"Lens error, restart camera\" message right out of the box", "Date": "August 2, 2009"}, {"Title": "Works for me.", "Author": "Joseph Minato", "ReviewID": "R25G2YP92NNKQZ", "Overall": "5.0", "Content": "I needed a low cost, functional digital camera for my middle school science classroom. It is used by myself and dozens of students. So far it has performed very well. And the price was right. It is not the best camera for a serious photographer, but it works great for my educational purposes.", "Date": "December 19, 2008"}, {"Title": "Canon PS A580", "Author": "T. J. Perkins", "ReviewID": "R3IJAOEE03VTAF", "Overall": "3.0", "Content": "The pictures are excellent and reflect the 8.0 megapixel format. However, the time lag time between each picture ensures that this is only good for still pics and no action. But, what do you expect for under $200. You will pay three times that to get the speed.I was also disappointed that I could not use any of my former Canon memory cards or batteries.", "Date": "August 13, 2008"}, {"Title": "canon powershot A580 8mp camera w/ 4x optical zoom", "Author": "casey", "ReviewID": "RJV9V8SPLKKXM", "Overall": "5.0", "Content": "it was a gift for my daughter's birthday, so I wanted something that would take great pictures (she's graduating from high school)yet be small enough to fit easily in her pocket.  She loves it.", "Date": "May 11, 2008"}, {"Title": "Not happy", "Author": "Darlene D. Hall", "ReviewID": "RF3XIIXNGWU7T", "Overall": "1.0", "Content": "I was very disappointed with the camera, the battery holder does not shut all the way and it causes the battery to not last very long. I will not order from this person again.", "Date": "December 29, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "8.0-megapixel CCD captures enough detail for photo-quality 16x 22-inch prints\n4x optical zoom\n2.5-inch LCD screen; Face Detection\nNew Easy Mode simplifies operation\nCaptures images to SD memory cards (included); powered by AA batteries", "Name": "Canon PowerShot A580 8MP Digital Camera with 4x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41QVCKfuDsL._SX300_.jpg", "ProductID": "B0012YA4YK"}}