{"Reviews": [{"Title": "Very Happy So Far...", "Author": "vikrtain \"Kentucky Robinson\"", "ReviewID": "RYP4VZF5S05ZU", "Overall": "5.0", "Content": "I have been searching for the right ultra portable camera with particular features and have been trying several.  I've settled on this one.  First, the camera is nearly the size of a credit card and is perfect for taking along to the park or backyard or anywhere you don't want to drag the larger SLR.  Second, of all the cameras I've tested (Lumix TZ3, Kodak V1253, Canon SX100 and Casio S880), this delivers as good if not better picture quality.  All these cameras take quality photos, but depending on the circumstances, some are better than others.  The S10 was the best overall.  Rich, deep colors outside and very good low light flash inside.  And at 10 megapixels, you get a lot of real estate to work with in the editing room.  Third, it has widescreen (16x9) video capture.  Excellent quality.  It's even better than the Kodak which boasts HD @ 720p.  Furthermore, the video capture is accessible by a single recording button next to the view finder so you don't have to switch modes, you just have to press a button.  That in and of itself is worth keeping the camera.  Fourth, the camera is packed with features.  Like any compact digital cameras, you have to experiment with your ISO and shutter settings to get the right results, but I've done some extensive testing and this camera really delivers, even in auto mode.  Fifth, and one of the most important things for me, the movies from this camera ARE compatable with iMovie '08.  Other Casios are not.  They use AAC audio on this one for some reason and it is recognized by iMovie.  Sixth, I like being able to shoot my stills in 3:2 aspect ratio so I don't have to crop every photo I want printed.  This camera has that option.  It also has burst mode and is quite good.The only cons I have noticed so far is that it's hard to get a good, clean shot of a moving subject in low light.  Flash isn't strong enough and the photos usually end up blurry.  This is true with every compact camera I've tested.  The camera's size also takes a little getting used to.  Because it is so small, it is easier to get camera shake when trying to shoot -- something that just takes some practice.  I'll continue to use and update this review if necessary, but so far I'm very pleased.", "Date": "March 8, 2008"}, {"Title": "Still good, but not as good as the previous model", "Author": "P. Nash \"Crazy Computer Guy\"", "ReviewID": "R3NH88M2X6SFU", "Overall": "3.0", "Content": "I'm a die-hard fan of the Casio Exilim S line since the very first model came out. I haved owned at least 5 different models and usually buy the newest one as soon as it's out. Casio has a track record of making each one better than the last, but I think they slipped a little bit on the EX-S10.The EX-S880 is the previous 8MP model, and I'm going to recommend that you buy that instead of the 10MP version. Why? Image quality. I really feel that the image quality and light sensitivity is significantly worse in the EX-S10 than the previous product. I have been regularly frustrated with images that turn out with bad white balance and slow shutters resulting in blurry pictures. And don't even think about taking a serious shot with anti-shake... it's a digital processing correction, not optical stabilization like on larger cameras, and so as a result it adds a *lot* of noise and grainy distortion to images. Unless I'm desperate to get a shot, I always leave anti-shake off (but this was true in previous generations as well).Compared to the last model, Canon also changed to a different battery, which is a little larger capacity I think. The old battery was pretty great, and I like that it had been the same for several models. Over time I'd built up a good collection of spares, but now I have to start over for the new battery size.So...IMHO, buy the older model, you'll be happier. I mean, really this is for snapshots, right? There's no *real* reason you need 10MP to print postcards or even 8x10, it just gives you a bit more flexibility to crop or zoom, but 8MP is *juuust fine*.  Personally, I'm switching back to my EX-S880 I think.In general, what I like about Casio's cameras is:* Great scene modes. The \"Best Shot\" feature has a huge variety of really cool scene modes, including \"white board\" mode. I have used many of these, such as portrait, backlit, landscape, landscape with portrait, night scene, white board, ...it goes on. Really useful.* Well-organized UI for features, although maybe it's just easy for me because I've used these cameras for so long.* Fantastic video capability. This camera takes great movies, and I use that feature all the time. I wish you could zoom in and out while capturing though.* Beautiful big LCDs. However, I feel that on the EX-S10, the camera really can't make the best use of the LCD. Almost every picture I take on the S10 *looks* blurry and soft in review on the LCD, but when I put it on the laptop, it is usually great. I can only conclude that the scaling algorithm they're using to shrink a 10MP image down to that tiny number of pixels in an LCD (uh, .077MP) doesn't work so well for maintaining some sort of sharp image. This sounds like a nit-pick, but in reality it really freaks me out and makes me not feel very confident about the images I'm capturing.* Beautiful, sturdy build.  I can't tell you how many times I've dropped my Casios over time. Maybe that sounds bad, but the point is that I've never broken one. Okay, I did crack the screen on my EX-S770, but I think something heavy was placed on it, not a drop. Usually I put some of that plastic scratch film on the screen and forego a case, because with a case it would be too bulky to put in my pocket and too awkward to whip out quickly for some snaps... which would defeat the purpose. Sure, my cameras get a bit scratched, but not much. The case is a beautiful paint color and it's metal, so it takes the abuse really well.Here's what I don't like...Stupid proprietary USB connector.  I've always hated the fact that the only way to get data off the camera without pulling the card is to use Casio's proprietary dock... there's not even a cable you can plug into the connector. I really wish they would switch to the now-available \"micro-usb\" which is smaller than the more common mini-B, but standard. When I buy these cameras, I never bother to take the docks or the software out of the box, I really don't like installing custom buggy photo software that puts stuff all over your computer. So, I always pull the card to download my images.Disappointing low-light performance.  As I mentioned already, the low light performance on this particular model is not as good as it should be. The camera is always slowing down the shutter to very long delays and complaining that there's not enough light.Anti-shake is very grainy.  Sure, you get the shot when you might not otherwise, but the image will likely be grainy and have lots of digital noise (pixels that are off-color from what they should be, like green, red, and blue specks floating around).", "Date": "December 20, 2008"}, {"Title": "Amazing", "Author": "Robyn Olsen", "ReviewID": "R2BC7PWQTDXCK6", "Overall": "5.0", "Content": "This camera is absolutely amazing. i had the older version previously but unfortunately i dropped it too many times for it to survive. So i upgraded to the newer version and i couldn't be happier. The display is gorgeous as are the outcomes from the camera. Cameras have come a long way with Mega Pixels and this definitely shows incredible capabilities. The zoom feature is great and i love that you have the ability to rotate, edit, and crop pictures and video files. I recommend this to everyone i know and i hope by reading this you will consider it 100%", "Date": "June 17, 2008"}, {"Title": "Great Portable Camera", "Author": "JEZ", "ReviewID": "R1ZJODRT7WW9F1", "Overall": "5.0", "Content": "I purchased this Camera upon the recommendation of my mother.  I was a bit skeptical at first at the size and price for a 10mp camera but I have been amazed at the quality of shots.  I took a picture of my dog in my basement with no light on and i turned out like a daylight shot.  It is quick to take the picture and in burst mode i get about 4 pictures all with flash in less than a second.  I love this little camera.  Small enough to fit in my pocket yet well made so i don't worry about it being there.  Yeah it's not the manliest color in the world but you can get it in silver and black as well.  I would recommend this product to my friends, and when time comes to get another camera I will certainly be looking at Casio Exilim first.", "Date": "June 9, 2008"}, {"Title": "Good 10MP buy", "Author": "D. Defreitas \"dot\"", "ReviewID": "R34730WCXYIC8Z", "Overall": "4.0", "Content": "Very slim camera, with a decent selection of modes, and features. Very nice large LCD on the back, though I wish it could be a little brighter...but that's no major hang up.Slightly disappointing that you can't hit a button to see the last photo you took while in snapshot mode, you need to enter review mode to see any images.Menu structure was a little confusing for me at first, wasn't as slick as some of the menu's I've seen on Sony cameras, but it is functional.I don't see any icon which notifies me if pictures are storing to memory card or camera memory, but I soon found out that when a memory card is inserted pictures automatically save to memory card, which makes sense...but it would have been nice.To charge the battery you need to take it out and  place it in the battery charger, where it takes about 90 mins to charge. While this is slightly annoying to have to take the battery in and out every time you need to charge it, it means that if your battery goes bad, you only need to replace the battery and not send in the entire camera for repairs. I think the battery sells separately for 29.99 ~ 49.99. There is also a little clip holding the battery in which is annoying when you try to put the battery in, but its just a slight annoyance, not a major pain.Picture quality is awesome. I am no expert photographer, but I was able to get some good shots. Also it has a bunch of pre-set modes (about 20 I think) from your basic indoors, outdoors, night shot, portrait to modes for party, high illumination, candles, underwater, scenery, and many more.Where the Exilim logo is right under is a big sticker with \"YouTube Capture Mode\" it looks like a high quality adhesive sticker, and I'm a bit worried to take it off thinking that it might leave an ugly square spot on the camera. So I'm stuck advertising for YouTube every time I whip out my camera....oh well I'll get over it eventually.", "Date": "July 22, 2008"}, {"Title": "I love this camera!", "Author": "Monika Panek", "ReviewID": "R34ZOHFAMXFZ4E", "Overall": "5.0", "Content": "- easy to use- perfect quality of pictures/videos- fantastic zoom options- on the screen you can see the life of the battery (it lasts pretty long)- very thin and lightI really love my new Casio!", "Date": "June 27, 2008"}, {"Title": "Proprietary USB Cable", "Author": "drbobo", "ReviewID": "R1E05USEHX65H6", "Overall": "4.0", "Content": "Great camera with ONE exception!The USB cable is proprietary. While the camera input sort of looks like a mini-USB, it is NOT!Come on Casio! I am glad you dumped the dock but where is USB!!!", "Date": "April 27, 2008"}, {"Title": "Casio Rocks", "Author": "MadEdPAKL \"Travelers\"", "ReviewID": "R1Y801PHGZHJIA", "Overall": "5.0", "Content": "I have loved Casio cameras since we special ordered our first 2 MP red camera from Japan.  This 10.1 MP camera is a replacement for a 7 MP Casio that broke (when a friend dropped it on the pavement).  We also have an 8 MP Casio.  I like that this 10.1 MP camera goes back to the original Casio roots.  In other words, it is small, a great size for pockets, and about the same size as the old 7 MP version.  I realize that most people go for the other brands, but Casio cameras are great, and this tiny one is perfect for travel.  It makes really good videos as well as still photos.", "Date": "October 31, 2008"}, {"Title": "Jack of All Trade Master of Almost All", "Author": "J. KIM \"GlockNinja\"", "ReviewID": "R2BFX8E3QCZHZN", "Overall": "4.0", "Content": "I was going to buy the Flip camera or the Sanyo Xacti 700HD. But I found this camera which is in between price wise. It takes great pictures and if you put the video mode on the highest settings, it also takes pretty good videos. And the size and thiness makes this camera as easy to carry around as the Flip. The only complaint I can think of is that they could have included a nice video editing software that would allow you to paste clips together. Sound quality is way better than I expected. Picture/still quality is excellent, and the video is Youtube friendly and the quality is above average for a still camera. I bought mine at Sam's Club which was a mistake because Amazon had it for less. But I do have to return mine because this one will not zoom while taking videos. It normally does zoom but for some reason this one was broke. Bottom line, if you are thinking of getting an inexpensive video/still camera, spend it on this one. For $200 bucks, its going to be hard to beat it.", "Date": "October 22, 2008"}, {"Title": "click to capture, software and battery issues", "Author": "Jennie L. Rosio", "ReviewID": "R25WY1KVNV7FU5", "Overall": "2.0", "Content": "I've had this camera for six months. Positives: Portability. That's what tempted me to buy this cute little thing. Also, still photos are ultra-clear and bright. I find the flash powerful; when shopping for homes which do not have electricity running, I've been able to get clear, bright shots in garages that are completely dark. Negatives: The battery charger doesn't hold the battery well; I have to tape it or it pops out just enough to keep it from charging. Then, when putting in the battery, it's confusing as to which direction the battery goes, so I get it stuck 50% of the time. There's no little reminder-icon or anything like that to help you remember which way it goes. Most frustrating: click to capture speed. I click to take a picture, and what seems almost a full second later, I have something much different than I wanted to capture. For example, when trying to shoot a dog-training demonstration last month, I tried to get a cool shot of the dog jumping in the air, but catch him well after he was on the groud with his tail to us. The friendliness of the software connected with this camera gets half a star. I find myself looking at the manual in order to do very simple operations; it is just not very intuitive in-camera software. I have already deleted Casio's software from my desktop, too.  It was really inflexible and hardly had any features.  I instead downloaded Kodak's software and I just try to make that work with this camera. I had a bulky little Kodak EasyShare camera before this one with a lower megapixel, and would like to consider purchasing a Kodak again when I upgrade to a higher megapixel some day... it was so much easier to use, the click to capture speed was great, the battery charger was so simple, and the software was much more intuitive.", "Date": "March 14, 2009"}, {"Title": "Camera is NOT red", "Author": "C. Leveque", "ReviewID": "R1MRQTHUTFSZHN", "Overall": "3.0", "Content": "Just to let everyone know, this camera is not red like the 880. It is more of a purple/pink. As a man, I do not want a pink camera, I wanted a red one...BestBuy calls it \"Plum\" which is way more accurate than Red. But, I have gotten over that and actually used the camera. It is a very nice little camera. SO small and slim. It makes the canon S850 look large. It is almost as slim as my iPhone, and shorter. Perfect for my jeans pocket. I took the camera on a trip for a week. At first, some of the settings were confusing and the manual is terrible, but I got the hang of it and had alot of fun with the best shot modes and creating my own custom best shot modes. I love the picture quality, but the noise reduction is alittle heavy for my taste. It does not clip highlights like canons tend to do, and that made me happy. Overall, I like the balance this camera has between size and picture quality, and I am over the color not being a perfect red.", "Date": "March 12, 2008"}, {"Title": "Casio Exilim 10MP Digital Camera", "Author": "E. T. Curtis", "ReviewID": "R1TUNRRIEGKYZK", "Overall": "5.0", "Content": "As with all the Exlim Casio cameras, excellent. We have recommended Casios to many and all have been happy with their purchase. We do miss the docking station/charger of our previous model, but the additional pixels of this model make up for that loss.", "Date": "May 21, 2008"}, {"Title": "Bad camera, bad experience", "Author": "Abatch", "ReviewID": "RL2R0ZE9M5D05", "Overall": "2.0", "Content": "This camera literally lasted me one year and for the price I paid for it is truly not worth it. The reason why I bought this camera is that my brother had won one in a contest. We were out at a night club and it worked soo well in dark picture settings, I was impressed immediately. So I bought one ,almost within a month, and was satisfied with the ease of use and picture quality. The zoom is not really super great since it's only 3x at 10.1 mega pixel. I guess if you want a better zoom go somewhere else. After a year of wear and tear the camera started acting up while vacationing out of the country. The zoom button was acting up and the view picture started freezing.  I can only say that this manufacturer must not make good quality cameras like Canon or even Kodak does. It never fell on the ground or even mishandled. I usually have my digital cameras for years. My previous digital was a Canon and I replaced it with this poor quality one instead. I would not recommend buying this digital camera unless you like to waste money and purchase a new one every year.Oh and if you want to hear something even better, I was within warranty and their customer service tells my husband and I to send it certified mail through USPS. Upon arrival, they state my camera has a broken side and voided my WARRANTY wiithout stating it on a letter sent back to me tell me that the only issue I had was a broken/error card or whatever. I had to call them to find out why they were charging me half of what I paid for this camera in the first place to fix it. They tell me that it was only b/c there was a damage on the camera that they voided the warranty. The customer service representative goes on to tell me that....'isn't it better to call us instead of finding out on paper that your warranty was voided?' Not sure what anyone else may take of this, but doesn't sound like a great manufacturer to me. And to set the record straight the camera was in perfect condition, only scratches from every day wear and tear, never fallen on the ground and the only thing I can get out of all this was the camera was damaged in transit through USPS. They had told me to send it certified mail in the first place, BUT the stipulation with USPS is that by sending anything via certified mail it does not insure anything you send out. So go figure? Great suggestion Casio!So there you go, my bad experience with Casio. Never again, they are better as manufacturers for calculators! Buy a Canon instead.", "Date": "October 10, 2009"}, {"Title": "easy to use", "Author": "tech novice", "ReviewID": "R3T7SAO5S5U3G4", "Overall": "5.0", "Content": "this is a very easy to use point-and-shoot camera which is also extremely slim.  It was reviewed as the best in a recent NYT tech review.  It beats its competitors in the ease of navigation through its menu and functions.  The quality of the pics are good, of course.", "Date": "March 19, 2009"}, {"Title": "Great small camera!", "Author": "M. Meltzer", "ReviewID": "RHU1EI18IVLLE", "Overall": "5.0", "Content": "This is the 2nd Exilim S type casio camera I have owned..They are great small cameras.  Very thin and take just terrific pictures.  Easy to use and the quality and looks of the camera are all A+!  I would highly reccomend this device to anyone...", "Date": "January 12, 2009"}, {"Title": "Casio EX-S10", "Author": "C. Marks", "ReviewID": "R1INPCZUVEIB6H", "Overall": "5.0", "Content": "So far, this has been a great camera.  It takes high-quality pictures, even when operated by children or while in motion.  Although it has many different settings, and multiple ways to set your own for the tech-savvy out there, the automatic mode works great for point-and-shooters.  A very easy camera to use, and definately worth the price!", "Date": "December 25, 2008"}, {"Title": "Love it", "Author": "Ian Dottin \"The Claudyus\"", "ReviewID": "RR7PVWLMEQQFH", "Overall": "5.0", "Content": "It is alot of fun to have. I have it clicked on my belt beside my cell, so it is easy to walk with. It is easy to use. The pics are beautiful. I have found nothing to not like. It's just alot of fun to have.", "Date": "July 15, 2008"}, {"Title": "Love Casio P&S; Cameras!", "Author": "WriterGirl \"WriterGirl\"", "ReviewID": "R3S3N7Z5CKZYT7", "Overall": "5.0", "Content": "I had gotten this camera as a gift some years ago. I absolutely loved it, but I lost it last year. Thankfully I was able to find this model here. I have owned many brands of point-and-shoot cameras and, by far, this is the best. The pictures come out beautifully clear and the videos are great. I like the zoom feature for video which works quite well. Time will tell if this used one will work as well and last as long as my original.", "Date": "July 30, 2013"}, {"Title": "GREAT CAMERA", "Author": "William A.", "ReviewID": "R10BDYZZSKDOWJ", "Overall": "5.0", "Content": "I have used this camera for about three years now.  It is full of features while being incredibly slim.  I would definitely recommend it.", "Date": "June 20, 2013"}, {"Title": "As described.", "Author": "james d. plihcik", "ReviewID": "R1OEE8TXPPHP5J", "Overall": "5.0", "Content": "Camera is the smallest 10mp out there. Does everything including video. Quality is excellent, function is easy. This camera is no longer manufactured.", "Date": "June 18, 2013"}, {"Title": "Very good compact camera", "Author": "D. Lamb", "ReviewID": "R3UZFRBDH8ENXY", "Overall": "5.0", "Content": "This is my go to camera.I have it with me all the time. The price was very good did not want to pay alot.", "Date": "December 13, 2012"}, {"Title": "Casio EXS10 camera", "Author": "JGtravelor", "ReviewID": "R19L9VZJGTLXTD", "Overall": "4.0", "Content": "Overall I like the camera and the large screen is great and you can see the pictures even in bright light, like ski pictures. My last camera you couldn't see anything in the screen. Unfortunately the zoom switch has failed already and I see some others saying their zoom doesn't work either. Casio can either fix it and warrantee the work, not the whole camera for 90 days for $79 plus shipping or exchange it for  another one and get a 1 year warrantee for $80. You must keep your battery and simm card because the new one isn't going to have what they consider as accessories. I'm alittle disappointed because that zoom switch isn't something you use that much but it could have been worse, if they said too bad it is out of warrantee. For that reason I'm going to continue to deal with Casio. I  think the problem may be that not enough people are letting Casio know they had a zoom switch problem or else there are only a few unlucky consumers.", "Date": "May 18, 2011"}, {"Title": "Replacing too soon!", "Author": "mom4", "ReviewID": "R2NVGTOH8WW4E0", "Overall": "2.0", "Content": "I purchased this camera in December 2008 and it seemed to work pretty well at first.  I quickly realized that the picture quality is very poor when zooming.  I had to have it repaired because it just stopped taking pictures.  I would push the button, but nothing happened.  When I received the camera after repair, it was taking pictures again, but it seems the photo quality has gone down even more.  At least 50% of my photos are blurry.  Time for a replacement!", "Date": "November 23, 2010"}, {"Title": "Casio Exilim", "Author": "rooster_ranch", "ReviewID": "R3UGK0ATUVT5TH", "Overall": "2.0", "Content": "I purchased this camera in early 2009 and am already going to have to replace it.  It takes great pics SOMETIMES... IF the lighting is just right or you're outdoors.  But most times with the flash there are red eyes (even with red eye reduction flash), blurriness happens more often than not, and it has a tendency to make people's skin tones reddish in indoor lighting.  I just took pictures of my daughter's first Halloween with it and was so disappointed when we uploaded them to the computer.  Blurry, red eyes, orange skin!  UGH!  Won't be buying Casio again, going back to Kodak.", "Date": "November 2, 2010"}, {"Title": "Great for the non-professional", "Author": "Barbara A. Topolosky \"hoping4astory\"", "ReviewID": "R3KNTUTEM91AJ4", "Overall": "5.0", "Content": "I love this camera. I take it everywhere. I also put pictures in a little community newspaper and they come out great.The quality of the movies are wonderful. I've made some little movies on my Mac which has a great movie making capability.It has a million settings for taking pictures: night, outside, portraits, etc. It also detects smiles, and family members. Pretty cool little camera!", "Date": "February 21, 2010"}, {"Title": "Small size, big screen, nice photos... then it broke.", "Author": "Dave R. \"colorado-gadget-moose\"", "ReviewID": "R1Y3PZK3RKO68", "Overall": "3.0", "Content": "Bought this camera for my wife:  she loved the stylish red color, big screen, and small size of the camera.  Took nice pics.  For a week.  Then it broke.  The power would come on, but the lense would not extend and the camera would not technically \"power up\".  Talked to Casio, they said send it in for repair (at my expense).  Sent it back for a refund from J&R;, and they were great at processing that.  Overall, this was my first, and probably last, Casio camera.  Really disappointed that it stopped working within the first week, makes me wonder about the overall quality of their products.  Bought a Canon instead.  I give this product 3 stars, which I think is more than fair, considering how long it lasted.", "Date": "August 20, 2009"}, {"Title": "Good and Plenty", "Author": "T. Dilbert-Bennett \"teknofreek\"", "ReviewID": "R1ZPFHVZ7HCM7A", "Overall": "5.0", "Content": "Really worth your money. Takes some really nice pictures. Fast shutter time. Extra slim and LIGHT!!! Really great.", "Date": "July 30, 2009"}, {"Title": "The Casio EX-10 Exlim is better than the Polaroid camera that i bought", "Author": "Kintrell", "ReviewID": "R1VUPN3HIREN6M", "Overall": "5.0", "Content": "At first i had difficulty learning the camera, but then my daughter showed me exactly where the record button was and all the scenery shots that you can take. It takes beautiful pictures and it records really good, when you zoom in, it doesn't knock out the sounds like my polaroid camera does, and what was also surprising for me is that when you set it for a one person shot to take the picture, it takes it automatically without you touching the shutter button, i would recommend everyone to get this camera asap because this camera is so bomb, i like it alot, next month i am gonna order the pink one for my oldest daughter since she likes my camera so much hahaha, so amazon you will be hearing from me again about this casio EX-10 Exlim camera, this is the best camera that i have had so far, and also its already youtube ready, oh i am loving it to the fullest, thanx amazon, and once again amazon customers, i recommend you get this camera because this camera right here works wonders, I can honestly say that i am well satisfied with this product :)", "Date": "June 24, 2009"}, {"Title": "Great little camera", "Author": "Grampa Jim \"Baseball Forever\"", "ReviewID": "R2ROKMUN7VH8OO", "Overall": "5.0", "Content": "This is a great camera that fits in your pocket and can take high quality  stills (10.1MP) and video!", "Date": "June 7, 2009"}, {"Title": "Digital Camera", "Author": "Karen E. Orr \"\"Bolt\"\"", "ReviewID": "R2NGLG3PKF6CN5", "Overall": "5.0", "Content": "The camera arrived as promised, it works just like new even though refurbished. All included accessories were included. Would buy  from this seller again if the opportunity arose.", "Date": "April 19, 2009"}, {"Title": "VERY HAPPY", "Author": "Dawn Blain Whitford", "ReviewID": "RM6GF8YF8DE5M", "Overall": "5.0", "Content": "I spent sometime trying to find the perfect camera. I am very happy with my purchase. Good quality for a good price.", "Date": "February 9, 2009"}, {"Title": "excellent service", "Author": "Haibin Xu", "ReviewID": "R1GWFJ8CTNLRO0", "Overall": "5.0", "Content": "The camera is really slim almost can fit into your wallet.I will also give a 5-star review for the customer service by 6ave.", "Date": "October 30, 2008"}, {"Title": "Around town camera", "Author": "K. Siegrist \"G. Siegrist\"", "ReviewID": "R1YOZXT8S0MAMJ", "Overall": "4.0", "Content": "Takes great photos and good movies in the .mov format. Easy up load to you tube. Lost of options to keep the novice busy for hours.", "Date": "August 1, 2008"}, {"Title": "Awful Camera", "Author": "Danielle Collamer", "ReviewID": "R2J3VWAOUQ2S66", "Overall": "1.0", "Content": "I had this camera for less than a year before it broke.  I took great care of it and always kept it in its case. Around one month after I purchased it, the zoom broke.  About 5 months later I was using it and it would turn on for 1 second, make two clicking noises, and then turn off.  I took it to the camera repair shop and they said it would cost over $200 to fix it, which was even more than I originally paid for the camera.  When I tried to contact Casio, they were extremely unhelpful and just had automated computer response e-mails which were sent back to me.  Overall, this camera was not great and I would never purchase a Casio again.", "Date": "December 19, 2008"}, {"Title": "Another Casio that stopped working after 1 year", "Author": "Kevin", "ReviewID": "R1OAELG805JT1V", "Overall": "1.0", "Content": "Don't bother with Casio cams ...this is my second to simply stop working after about a  year...Poor quality or workmanship but these things should not happen in this age. Took nice pics while she worked tho.", "Date": "May 28, 2010"}, {"Title": "3 DOA.... (Updated)", "Author": "Klisk", "ReviewID": "RP4JIT4J74MNJ", "Overall": "1.0", "Content": "I'm not sure what the deal is, it's all very fishy.But I bought 2, and both were DOA. The first one was clearly used, and had to go back. It wouldn't save pictures to the internal memory.The second one is new, but literally DOA. I charged the battery up, put it in the camera. It let me set up my time/date/etc. Then once it started to 'boot up', and the zoom extended? The camera crashed and would not power on at all after that. The lense clicks twice and it turns off. No good. It even had dead pixels!I'm very frustrated. How bad can quality control be that I can get two DOA's in one night? It's bad enough that it's a 35 minute drive to the Best Buy. So ridiculous....--- Update:It took me 3 tries to get this model camera from Best Buy without it being DOA. 3 DOA's.... How does that happen? Well, 4th was the charm.Once I got one that worked, I was happy. Great pictures, great color, amazing clarity, the size... I like the plum color, too.Now, a month later, I'm miserable. The once clear pictures are nothing but blurry, over exposed, and full of glare. Everything is washed out and blurry.This model camera has serious defects. Serious, serious defects. Do not buy. Every picture looks like it was washed with bleach, and smeared around in photoshop. It doesn't get much worse.", "Date": "September 10, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "10mp with 3x zoom\nAuto shutter\nYou Tube ready\nInstant video button\nFace detection", "Name": "Casio Exilim EX-S10RD 10.1MP 3x Zoom 2.7-Inch LCD Screen Digital Camera (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Ag2C5H-uL._SY300_.jpg", "ProductID": "B0012XTJVK"}}