{"Reviews": [{"Title": "You have found the one!", "Author": "Lindsey Ralston \"ILuvMyMaddie\"", "ReviewID": "R11AV5SW2HN8XN", "Overall": "5.0", "Content": "Ok, I read 1,000's of reviews, looked at every video review and tested tons of cameras out. In my mind and what most Best Buy people will tell you is that Canon's are it for digital cameras. I bought the Canon Powershot 1200IS, and it took horrible pictures - not crisp at all. I have a 1 year old who runs around like crazy and this camera does such a good job! It looks nice, the size is great, the price is great and I could not ask for more! I thought it would be impossible to get a good camera that wasn't a slr for a decent price. This is the best out there - don't waste hours and hours looking on the internet, I'm saving you your time: get this one!!! Or atleast buy it from somewhere where you have the option to return it, I gaurantee you wont!", "Date": "June 23, 2009"}, {"Title": "Sony Cyber-Shot DSC-W230", "Author": "Wayne Alexander", "ReviewID": "R1M1XLVLR8GTQJ", "Overall": "5.0", "Content": "I was looking for a digital camera to take with me on my trip to Australia.  Being a trip of a lifetime, I wanted to make sure I returned with amazing pictures and video that helped me remember and share my experience.  I shopped online and in stores comparing prices and brands.  This camera provides easy use with great results at an affordable price.  There are many functions to choose from allowing for optimal performance.  It is compact and easy to become accustomed with.  The larger lcd screen was helpful when capturing and reviewing pictures.  The video function picks up sound well, but you cannot zoom while filming.  The settings can be manually configured to be adjusted to your preferences, but there is also a function for easy shooting.  Battery life was sustainable and allowed for full days of picture taking.  Viewing pictures as a slide show on the camera is great, because it plays music along with it, and you can add your own music to add a personal touch.  I was able to capture images quickly with the fast response time of the shutter.  Overall, I was completely satisfied with this product and would recommend it to someone shopping for a decent digital camera, but isn't quite ready for a SLR.  The pictures turned out great!", "Date": "July 13, 2009"}, {"Title": "Best camera for its price.", "Author": "Patrick Nguyen \"Trance Music\"", "ReviewID": "R3LX9T84XBVRIQ", "Overall": "5.0", "Content": "I have tried Sony W290, Canon SD 790 and SD 1200, this is the best camera of all.  Beautiful and vivid pictures, time to start up is very fast.  in burst mode, you can take several pictures, and I mean it's take very fast, I love this.  compare with W290, W230 is better and it's cheaper.  I have both, but I have returned the W290 to Dell.For performance, I give it 4 stars, but the price is better than W290 so I give it 5 Stars!Excellent device for the price.I highly recommend it.", "Date": "June 5, 2009"}, {"Title": "Fabulous Buy", "Author": "Sarah O'Brien", "ReviewID": "R22DWVA8NIIDFA", "Overall": "5.0", "Content": "I absolutely love this camera! I looked around to find a good review for weeks before buying it but I couldn't find more than 2 or 3 reviews. As soon as I opened the box I fell in love with this camera. It's definitely more red than hot pink (which it sort of looks like online). The pictures come out great and there are tons of special features, such as red eye reduction, smile detection, and tons of others that I haven't had the chance to try out yet.  Even if the picture doesn't look great when you first take it, when you check it in review it's usually blur-free and the lighting is fantastic.  I was scared to purchase this camera because my old Sony's lens stopped working after a year, so I bought the 2-year warranty on this just in case, but so far I haven't had any problems.It's definitely worth the money and I hope this review helps!", "Date": "June 26, 2009"}, {"Title": "Expected a little more", "Author": "Ah Chew", "ReviewID": "R14GVIX6A556HG", "Overall": "3.0", "Content": "For the price and the 12Mpx, it's a pretty good camera.  I bought it for my Grand Canyon trip, an obvious picture-taking mecca.  The camera can be fairly easy to use, if you choose the most automatic options.  If you want to experiment and go more manual, there're a myriad of options for that, too.  However, as a former camera geek, I would have liked an option to go completely manual and be able to choose my own iso settings for further experimentation (hence, the three stars).  You are able to adjust aperture settings (or at least it can mimic that).  But even with the options I did have, I was able to play around with it and take some very acceptable pictures.  Not pro-level, but enough to impress family and friends.  And at 12Mpx,, there's a lot of latitude for cropping, blowing-up, etc.", "Date": "June 1, 2009"}, {"Title": "Doesn't do well in low light", "Author": "C. Coleman", "ReviewID": "R2PX1USX2TJQN7", "Overall": "3.0", "Content": "This is my wifes camera, but this thing does not seem to do well indoors at all. It never gets over 1/30th of a second shutter speed even with flash, so pictures of my 10 month old are always slightly blurred because he does not sit still. If the ISO is increased to 400 it is incredibly grainy, even iso 200 is a bit grainy. The camera also rarely seems to be focused. I cannot tell it so much, but my wife points out in the majority of her pictures taken indoors that very rarely is the subject in focus. We have tried the various focus settings and it still happens. It is partly an issue of our son moving a lot (and the camera never getting over 1/30th of a second even when it is well lit with flash indoors) and also the camera just not QUITE getting the focus right.The face detection doesn't work well unless the persons face is DIRECTLY aimed at the camera. My son's face is NEVER detected because he will have his hand by his head and apparently that keeps it from working. That, or he will be turned away (even if just slightly) so it is not detected.", "Date": "June 3, 2009"}, {"Title": "A disappointment", "Author": "J. Prucha", "ReviewID": "R2L4XCT858GUJX", "Overall": "2.0", "Content": "I bought this camera after having experience with my friend's touch screen model from Sony from a year or so ago.  The touch screen aspect wasn't crucial to me, and I thought Sony would be the way to go to replace my old 6.1 megapixels Kodak.I've been looking around for a while, and after seeing that this model has an ISO up to 3200, I thought it would be ideal for taking photos in low light.  Sadly, that is quite the contrary.  While the DSC-W230 can take images without flash inside, the quality is poor.  There is noise in nearly every shot, despite the camera being on the ISO setting.  I've tried many other settings, including twilight and fiddling around with the manual programming mode, and yet the camera just doesn't deliver.Even when taking photos outside, as soon as I zoom in just one, the image becomes fuzzy.  The screen is great and the quality looks wonderful at first, but upon the first zoom in, it is apparent that the images just aren't as crisp as they should be.  Sadly, it is comparable to my old Kodak.The quality when uploaded to my computer shows its true colors.  Images that seem lovely on screen are just not up to par.One other small annoyance is the fact that you cannot delete an image immediately after taking it.  You have to go to review.Some aspects of this are really nice since there are many modes to play with and slideshow mode is fun, but if you are looking for crisp, clean pictures, save your money.I am sadly going to return this model.", "Date": "May 10, 2009"}, {"Title": "really good camara", "Author": "Ivan Ventura", "ReviewID": "RRRLN84XWWC1Q", "Overall": "5.0", "Content": "well its a good quality camara. since the screen its 3 inches it eats up the battery faster so it is a good idea to have a back up battery. the battery can last u from an hour to 3 hours it depends if ur taking video or just pictures. the quality of the pictures is awesome I take 8mp pictures because the 12mp pictures are too big. but if u want to make  like a poster the 12mp is perfect for that. the smile shutter its a cool feature and the quality of the pictures is great. n u should consider buying a screen protector cause everyone wants to touch the screen when ur showing them the pictures so at the end of the day the screen is full of finger prints.", "Date": "June 7, 2009"}, {"Title": "Good camera", "Author": "Soaps Mom \"Soapy's Mom\"", "ReviewID": "R7Q8ORY1EG3TW", "Overall": "4.0", "Content": "We most recently purchased this camera after wanting to upgrade our pixels from our old Sony.  Takes very nice photos, good video clips if needed but less then stellar when it comes to zoom clarity.  At a graduation ceremony from the second row I tried to zoom halfway to get a better shot and found the end result both on the display and in the actual print out to be very blurry and that wasn't even in full zoom.  There are going to be times when you simply cannot get closer and must use the zoom and unfortunately, I cannot count on this camera to give me a clear shot.  Other than that, using the easy mode, the pictures came out clear and colorful.  Also took some action shots of my child rolling down a small hill at the park with her friends and was pleasantly surprised at the clarity. The other issue I have with this camera is the lagtime between the view of the picture and being ready to take another. Very slow and you can miss a perfect shot. For day to day, vacation shots and special occasions, I think this camera is a good choice especially for the money! PC Richards charged $174", "Date": "June 4, 2009"}, {"Title": "Absolutely Fabulous!", "Author": "The Taminator \"There's no going back. You've ...", "ReviewID": "R12GPYHBGVQGQE", "Overall": "4.0", "Content": "I needed a second still image camera for business since we share a single one in the office, which often results in delays. I was so happy with the Sony Cybershot DSCW80 that I bought about two or three years ago, that it was a no-brainer to upgrade to this newer, higher megapixel version. This is my fourth Sony digital camera, and I'm loving it.I can't stress enough how wonderful the anti-blur technology on the camera is. While these newer, lightweight cameras are much more portable than their predecessors, it's also hard to hold them steady without a little of that extra weight. I don't have Parkinson's, but I don't have a steady surgical hand either, and this camera totally makes up for it. I don't like using the zoom feature without a tripod, but the more you zoom in on any camera, the shakier you get if you don't have it on a steady surface. It just goes with the territory.I am an amateur photographer--I use this for just regular photographs of everyday things. I need something simple to point and shoot. It has the same basic controls that my other Sonys have had, with the bonus of a slightly larger screen on the back. Most users will probably have little trouble using the dials and menu on the back to try different settings and to view the pictures you've already taken. I doubt if you'll have to consult the manual if you've had any experience with digital cameras before.I have video cameras and image editing software, so I didn't use the video function and did not install or use Sony's software on my computer, so I can't comment on either of those functions. The battery charges more quickly than previous models, and seems to have longer life for my still image shooting. The images are just fantastic--I could wave it around while taking a shot and still get a crisp, clean picture.Some people don't like the fact that the lens extends out when you turn it on, but I think it's a small price to pay for such quality images. My only other gripe about this camera, as with all Sony cameras, is the fact that it does not take a standard SD card and you must use Sony's Memory Stick Pro Duo. This isn't necessary, it is slightly irritating, and if it took a standard SD card I would have given it 5 stars.If you can get past the fact that you'll need to purchase a special memory card for this camera (and it's such a great camera that it's not hard to make that leap), you'll be very happy with this for years to come. I highly recommend this camera for anyone, advanced users and beginners alike. It's a fantastic value that will preserve your memories and take great pictures for your business for years to come.", "Date": "October 3, 2009"}, {"Title": "LOLLAPALOOZA", "Author": "Alexander M. Nowak", "ReviewID": "R2OPRJDBGHG1K6", "Overall": "5.0", "Content": "When I went to Lollapalooza this year I wanted a camera that would not only take pictures and have video but also have 12 MP. This was the camera for me! Amazon and Costco both have similar deal on this camera. At Costco you get the camera, case and a 2 GB memory stick for around 215. Problem is they only sell the camera in blue and I am a guy so that was a little weird. So then I came here to Amazon and got the camera in black and got a 4 GB memory stick for around 220. So this was the best value for me here at Amazon. Then about the camera. IT IS AN AMAZING CAMERA. It does not have the closest zoom of all time but it is pretty good. I used to to shoot alot of video and the video are actually VERY good. For a camera is looks like an actual video camera is recording it all! it is a must buy if you want quality. You just have to figure out if you want to spend less money and get less zoom. Or spend more and get more.", "Date": "September 5, 2009"}, {"Title": "Excellent point and shoot", "Author": "Scott", "ReviewID": "RJBGC1L9PQ260", "Overall": "5.0", "Content": "Purchased this camera as an alternative to the DSC-H5 because it is smaller and can fit in your pocket.  It works great for that.  Excellent picture quality and long battery life.  I mostly take outdoor pictures and though I'll still use the H5 for sporting events and distance shots due to the better zoom, this is a great camera to have with you at all times.", "Date": "May 19, 2009"}, {"Title": "Good but could be better", "Author": "A. Howell", "ReviewID": "R2E9SJI8RHVUSA", "Overall": "4.0", "Content": "I bought this camera based on past reviews of Sony Cybershots. It is very easy to figure out without reading too much into the instructions. I took several test pictures and was a bit disapointed. The first few looked like they were taken from my old 5 MP camera. After testing all the settings and taking a few more shots the camera held up to expectations. Pictures came out good and clear. I would recommend this camera for those on a budget looking for something midrange. If you want better quality then go with one of the megazoom cameras.", "Date": "April 3, 2009"}, {"Title": "Fantastic camera!", "Author": "Boss Tweed \"beatnick\"", "ReviewID": "R1DQ6M8H6JWKKN", "Overall": "5.0", "Content": "I did a bit of research on digital cameras, and went to the local \"Big Box\" retailer. This one is fantastic! Great screen, quick pictures, excellent quality, etc. etc etc.", "Date": "June 13, 2009"}, {"Title": "Almost....perfect", "Author": "L. Da Vinci \"Renaissance Man\"", "ReviewID": "RRWY9DDHHG9PB", "Overall": "3.0", "Content": "I ordered this camera because of the Sony quality, the compactness of it and the reasonable price.Pro's: Very sharp pictures, large LCD screen, very compact, easy to use and fast start-up for first shot.Con's: The battery does not last long, (LCD power consumption?).After 20 pictures (with no flash), one of the four bars for the battery is gone, so a full charge may last no more than 100 pictures. This is a special battery, expensive and not widely available. I would suggest designing this camera using AAA batteries, instead of the propietary one Sony uses. After two weeks of use, I sadly had to return this camera.Keep the above in mind if you are considering this camera.", "Date": "July 16, 2009"}, {"Title": "Not what I expected.", "Author": "S. Boodoo \"sboo99\"", "ReviewID": "RE1U9ORBBSH81", "Overall": "3.0", "Content": "I bought this camera with hopes that it would exceed my expectations. I previously had a Sony Cybershot DSC-W30 6MP and I loved it! It honestly was the best camera I had ever owned and lasted YEARS with perfect quality photos EVERY SINGLE TIME. Thus I decided to purchase another Sony Cybershot when the gear wheel stopped working (due to overuse) on my older camera.I looked at tons of reviews for all sorts of Sony Cybershot cameras to be able to pick the best suitable one for me (it did not have to be the lastest). I finally settled on the Sony Cybershot DSC-W230. The features looked great, it was similar to my old camera (generally same look, same lens, etc.), plus as a bonus, I got it in my favourite colour... red!!! Please note that the actual red of the camera is slightly darker to what is pictured here (at least on my screen). I was extremely excited about my purchase and coudn't wait for the camera to arrive. It arrived in great condition.Thinking it would have the ease of use as my old Sony Cybershot DSC-W30, I figured that I could take just take it out the box, pop in the battery and memory card (memory card not included btw) and start snapping photos. I was wrong.You see, I am the type of person who snaps photos for everything. Anytime I go out I snap photos. When people arrive at my home I snap photos. When my dog does something cute I snap photos. I'm accustommed snapping photos until I have pictures coming out my ears and other people tire of it (I don't care though, I would still snap photos all the same). I found myself having to read the manual in order to understand the camera (something I have never done out of force, but out of interest). As said before, the camera has some really cool features that you can play with, such as the smile detection (which, I discovered, does not really necessary work with a smile but works if you squinge your eyes alone to simulate a possible smile) but it feels as though some of the main essentials were taken out.The flash, on its highest setting, is no match for my previous camera. That flash was able to light up a pitch black room with the photo coming out as though it was broad daylight. This one doesn't. I suppose they designed it to save on energy or something, but this was the most (if only) worry that I had when purchasing this camera, so I was disappointed.If I want to take a photo on the automatic setting, the photo does not come out great. In my last camera, an older version I remind you, it worked perfectly. In this one, it isn't so great. I suppose if you really adjust all the settings EVERY TIME you need to take a photo then it may come out great. I am no professional photographer (they may probably really like this camera): I am just an ordinary user who was looking for a camera that can snap everyday pictures with ease and clarity. Even in the EASY mode (made for grandparents, etc.) the photo does not come out good. Photos come out blurry if the flash is not on, so I need to have it on all the time (I don't mind this since my older camera had the same problem). The camera also NEEDS to be adjusted for the lighting in every setting otherwise the photos do not come out good.I hardly use the camera at all. When people inquire as to the reason, I simply shrug and say \"it's too much hassle\". And it's not for lack of trying as I have my camera permanently attached to my purse with the purple Shock-Absorbing Durable Active Camera Case (purchased here), so I don't have the excuse of \"I left it home\". Since my purchase in December 2009, I have only taken one photo album worth of photos, and that in itself is disappointing.So here's my recommendation: If you want a fantastic camera with great features that you don't mind adjusting for every photo that you take, then this is perfect for you. Otherwise, you may not appreciate the camera. But I'll still recommend that you purchase it because it probably is the best on the market (for Sony anyway) :)", "Date": "February 4, 2010"}, {"Title": "Good choice", "Author": "Sandra Wildermuth", "ReviewID": "RUM3JT7WHOFSS", "Overall": "5.0", "Content": "I was really nervous about buying the right camera and i have to say im pretty impressed with this one. I'm not a photographer, just an everyday mom who likes to take those random pics. I wanted something light weight, quick to take the pic, long bettery, lots of storage, and enough options to do different things but not so confusing that i never use them. This deffinatley fits the bill.", "Date": "October 28, 2009"}, {"Title": "My first impressions", "Author": "Luke Hebenstreit", "ReviewID": "R385GTRBCMQ3I0", "Overall": "5.0", "Content": "This camera is really nice.  The quality of the pictures is excellent.  I haven't even had any problems with the picture blurring when I'm not 100% still.  The flash is really bright, but somehow manages to not add a glare to glossy/shiny objects the that much (it's much less than any other camera I've used).  The camera is much smaller than I thought it would be.  It can easy fit into my pocket if I don't feel like carrying a camera bag.  I've only had it for a couple of days, but I'm very impressed with this guy so far. ^_^", "Date": "September 20, 2009"}, {"Title": "Great Camera", "Author": "Dorothy D. Burns \"Dottie\"", "ReviewID": "R2ODZIPLWKSMH4", "Overall": "5.0", "Content": "I purchased this camera for my daughter to replace one that a small child dropped. The Image Stabilization and face recognition is great because she has small children she tries to capture with it.  She really enjoys it and gets a lot of beautiful pictures.  I have found that Sony makes a great camera.  I have a small one I carry with me at all times (DSC-N1)which I think is great, plus a Sony digital SLR.", "Date": "September 10, 2009"}, {"Title": "Great Camera", "Author": "Mary Jo Daraklis", "ReviewID": "R1WL2KNFYBTARE", "Overall": "5.0", "Content": "Comments by Wife of JohnI love this camera for a person who likes good pictures with ease of operation this is for you. Not one blurry picture when using the Auto mode.You just need to remember to press the shutter button half way and wait for the beep.My husband did run through the battery in about one hour, but he doesn't like reading instruction and learns by trying first hand.He must have gone through every option and zoom combinations on a 100 shots. All without shutting the camera off once.  After one hour he announced he was now an expert on the camera, and needed to charge the battery...lolI know him well and bought an extra battery....lolIf you are a camera nut that likes to brag about spending $1000 or more on your cameras this is not for you.  But if you want great pictures for a reasonable camera price this will make your day.  IMHO", "Date": "August 27, 2009"}, {"Title": "Don't go for it", "Author": "Nang", "ReviewID": "RM0P902KJV592", "Overall": "2.0", "Content": "If you are a canon user for past few years do not get this camera. I owned two canon cameras in last 5 years and then deciced to go for Sony this time. I am badly dissapointed on the picture quality. Low light photo capture is pathetic. When you see images in your computer and zoom it up it gets splitted instantly which is more surprising for a 12 megs camera. I returned it and bought Canon digital elph series and its worth it.", "Date": "October 8, 2009"}, {"Title": "point and shoot", "Author": "Y. R. Kurimoto", "ReviewID": "R386YT9GR3W7J2", "Overall": "5.0", "Content": "This a great point & shoot digital camera.  It is very user friendly and the clarity of the pictures are very impressive.  The pic bridge feature is a plus for making quick prints.", "Date": "September 12, 2009"}, {"Title": "No Better than the 7.2 Mega Pixel Model", "Author": "Christopher Mayo", "ReviewID": "R4MR2QKRYZ1HW", "Overall": "3.0", "Content": "I have been using the Sony DSC-W55 7.2 Mega Pixel Cyber Shot for over a year now, and have been very pleased with it. I wanted to upgrade to something that would provide me with more pixels, and hopefully better pictures. Unfortunately, after testing it I found the quality of the pictures from the two cameras to be nearly indistinguishable. I am returning the camera and sticking with my old one.The three stars may not be fair, though, because my old 7.2 MP camera is priced much higher than this new 12.1 MP camera. I do not understand why. Be aware that the additional megapixels, even for the same model of camera, may not make much of a difference.", "Date": "June 19, 2009"}, {"Title": "Some amazing pictures, but more are blurry", "Author": "Barb", "ReviewID": "R1WUSG4PNHOJQI", "Overall": "3.0", "Content": "I got this camera in July of 2009 for my 13th birthday. I have taken some really, really good pictures with it that look stunning. But most of the time, when I am going through all my pictures from something like a vacation, I find more that I end up just deleting because they are too blurry or just look really low quality. The pictures that do turn out well are in the perfect lighting, and it seems like that is hard to get in normal situations.Overall I've been unhappy with this camera. I feel that there are much better cameras out there for the price this one was, and is now. The camera is easy to use, and there are some nice features on it (vivid color for example, which I use often), but usually you can find these features in other cameras.At the time I got this the camera was thin and light, but there are thinner and lighter cameras out now.I wish that I had spent less on a camera that could have been just as good, or spent more on a higher quality one.I'm not saying you shouldn't buy this camera. This would probably be a good camera for younger kids that are using it to take pictures with their friends, but you could find cheaper ones that are just like this.I just prefer something that is higher quality in a $300-400 range if you are willing to spend more.Just a side note: The blue is a really nice. I really like the look of this camera.", "Date": "March 26, 2011"}, {"Title": "Older versions are better quality", "Author": "txdude311", "ReviewID": "R1XGOLCQ52YQOX", "Overall": "2.0", "Content": "I love to take pics. I have worked a little with DSLR's but mostly point-click.This camera is inferior to previous comparable Sony Cyber Shots, such as the P100- 150 which were 5.0 and 7.2 mp's1. Even though this is newer and almost twice the mp's the quality is not as good as the older ones. Pictures are not as crisp and sometimes when it over focuses on middle objects and the sides become more blurred than necessary.2. The video is roughly the same. Its better to get the next version up which now is like a $20 price difference because this one is not HD video like the one up, which is 720p.3. I can't manually change the focus. Such as. 0.5 meter, 1 meter, 6 meter. The older versions did even though their mega pixels are under 10.Overall invest in a different camera that take better image quality and video quality, it is worth it. I'm looking at a Luminex.", "Date": "September 3, 2010"}, {"Title": "LOVE the burst feature", "Author": "J. Send", "ReviewID": "RFH32TGH1JC1", "Overall": "5.0", "Content": "After buying a $500++ bigger Olympus camera and was severly dissapointed with the digital quality (even though I had previously had good luck with Olympus) I decided I would rather have a small camera I can slip in my pocket to get all of those can not miss shots.The best thing about this camera, is the burst mode, If you have it on the normal camera mode, the green camera on the dial. go into the menu and set your shutter to burst.You can then take 4-8 consecutive photos with one pressing down of the button.I can then take great shots of my kids and uncooperative husband, seems that first photo is always so rigid and then they let lose just that tiny bit for the perfect shot.Top it off with my Creative Memories Memory Manager Software ( a HUGE bang for your buck in photo storing and editing) I can clone from one picture to the next and get an almost perfect photo.I've done this with a group of men (who we all know don't cooperate) and got a great final product. I also did this with my daughter's baseball team and got a great shot of the kids.Well worth the price, fun features great grab and go keep in your pocket or purse camera.", "Date": "August 28, 2010"}, {"Title": "Tremendous Value", "Author": "S. BING", "ReviewID": "R3SDCWEFGZRCZH", "Overall": "5.0", "Content": "After owning several compact digital cameras in the past 3 years, I have always found they have been less than expected or promised in terms of Picture Quality, focus, speed and easy of use.Bought this Sony as a Refurbished unit and could not be more pleased with camera.Sharp crisp pictures, that can be taken one after another with no lag time between  pictures waiting on the camera to ready for next picture.Featured packed, great quality....whats not to like.", "Date": "April 22, 2010"}, {"Title": "film to digital", "Author": "All Smiles \"All Smiles\"", "ReviewID": "R14EGSR5O4FDSF", "Overall": "3.0", "Content": "Ok here is an up date. I like the camera but am looking for a new one!! I am tired of taking pictures trying to hold my hand perfectly still!! I can move the camera super fast at times and get a great clear picture and other times when I am still and there is little movement from object I get a blurry picture!!!!. My sister in law also stopped using her Same camera due to same annoyance!!! I did not pay the Price it is advertised here !! It was under 200$ It is fun to play with all manipulations on it but you can only do them when they are in the camera, not once on the computer.! The zoom is only ok not as much of a zoom as I'd like either. Over all it is ok I do want to get a different one after having this one almost 2 years! I'd keep it if I didn't have to delete soo many blurry pictures and NOT being able to get the quick  photos at that momment. I loose alot of one chance shots!!I bought a digital so I would have something much smaller then my minolta film.  There are pros and cons to a digital in general I guess. I also ready many reveiws before buying this camera and looked at it many times. I do not find many of the problems other do .  You can delete more then one picture at at time just go to grid mode, check all ones want gone and poof they gone.  Didn't think anything about lens  zooms out when turned on but I do find my hand in wrong spot at times putting tension on lens. I'm getting used to not having a hand there that is all.  I also too have a hard time getting used to motion pictures. Film, one click NO BLUR. Digital get some clear and some blur in same photo but not cameras fault ( Digital thing).  Menu is soso to use but I find that once I get a certain setting I have to search to get it back to prior setting. I have read manual and played with it many times. Just at times you can get one spot from one button but not another. Needs a reset button:) Also you Can see picture after you take one. It has a 2 sec setting.  You ccan take multiple pictures at once. Burst mode works well minimal blur. Overall I enjoy the camera. I have taken it out in cold, Screen turns purple after a bit , once warmed up is fine.  Even though you have a big screen no match for a veiw finder. So point and shoot and it usually comes out what I wanted. The few pictures I have printed came out nice. I like to play with it and all the neat effects it has on it:)  Over all I really like the camera , Won't let go of film all together yet. I believe most anyone could use this camera. Especially on easy setting. Just point and shoot. Delay is very lil  until you get into different settings. Battery lasts pretty good. Again never had a digital but I am pleased:) READ directions on how to focus first and then take pictures and you will not have any trouble taking nice pictures.  Only reason I give a 4 is due to it not being as quick as my minolta film!!", "Date": "February 24, 2010"}, {"Title": "Excellent camera", "Author": "Marty \"safelock\"", "ReviewID": "R2FHQ54XXDC5PL", "Overall": "4.0", "Content": "This is a good value.  Easy to use, good features, fair battery life, excellent pictures.  Fit easily in a shirt pocket.  Use an Sony FGI battery because this shows the actual time left on the charge and this will improve the management of the battery life.There is some next picture delay when using the red eye feature, however if this feature is turned off the delay is minimal.The smile shutter, although not perfect, works surprisingly well.I would buy this camera again.", "Date": "February 9, 2010"}, {"Title": "Great Camera!", "Author": "Mama Bear", "ReviewID": "R1TMETMGDUUCKO", "Overall": "5.0", "Content": "We wanted to try a new brand of camera after our second Kodak quit on us, so we shopped around and decided to try a Sony Cybershot.  I have not used it a ton yet, but I like what I see so far.  The pictures load just fine into the Kodak EasyShare software too, which I like because I did not want to have to switch to a new program.  The outdoor photos look great and the indoor ones are nice too.  It is so hard to find a camera that takes decent indoor low light photos.  Also, I love the steadyshot because I have two small children who are always on the go.  It does require a special memory card called the Memory Stick Pro Duo, which I didn't know at the time when I purchased the camera.  They are not that expensive, though.  I also really like that you can charge the battery two different ways.  You can charge it through your computer using the USB cable, or it comes with a wall charger.  That will be nice for vacations when we do not have access to a computer, but need to charge the camera.  Overall, I am impressed so far!", "Date": "December 11, 2009"}, {"Title": "Excellent Digital Camera", "Author": "Pworld", "ReviewID": "R17DX68TRYU63O", "Overall": "5.0", "Content": "The picture quality on this camera is excellent, especially for the price that u pay for it. It is definitely well worth the price. It's very easy to use and also taking pictures at night is no problem at all, u can take a picture when it is very dark and the picture comes out like u took it during the day. I highly recommend this camera for anyone looking for a good quality digital camera. Oh yeah it also takes videos! Excellent camera by Sony!", "Date": "September 21, 2009"}, {"Title": "Wonderful Product", "Author": "Afaque Ahmad Qureshi", "ReviewID": "RVJJZY3TA7UUT", "Overall": "5.0", "Content": "I have found this camera to be very useful and stylish. Its sleek and the picture quality is very sharp. It has all the standard features that you would expect from an advanced camera. Since I already have most of the electronics from Sony, so there was hardly any need to go thru the user manual. There were no compatibility issues. In a price of less than $200, I have received latest technology and stylish digital camera that  has a big display screen. All in all, I have found it to exceed my expectations.", "Date": "July 6, 2009"}, {"Title": "Great Camera!", "Author": "Zacoustic", "ReviewID": "RB6R7ZUWIP9Q4", "Overall": "5.0", "Content": "This camera is fantastic! I bought it so I wouldn't have to carry around my DSLR everywhere, and it takes high quality pictures and is very easy to use. The only con I can find with it is the battery that came with it doesn't last too long. Other than that though, great buy!", "Date": "June 29, 2009"}, {"Title": "Radical Red", "Author": "Taran Godbey", "ReviewID": "R1NG8S919CHJWU", "Overall": "5.0", "Content": "I am in love with this camera, the quality of the pictures is amazing, and it's so compact that I can take it with me everywhere.", "Date": "May 12, 2009"}, {"Title": "Needs Improvement", "Author": "D. Stanford", "ReviewID": "R2XDXIIVGGKBIA", "Overall": "2.0", "Content": "I was very disappointed with the DSC-W230. About 80% of my picture taking is outdoors at parks or on trips. And all the pictures I took outdoors seemed blurry, soft & somewhat grainy. Indoor photo taking seemed a little better, and close-ups using Macro seemed decent. But sadly I had to send this one back whereas I need it to perform well for outdoor shooting.", "Date": "July 9, 2009"}, {"Title": "Not sure why...", "Author": "kiel boojitsu", "ReviewID": "R2VNGWK93MGBG3", "Overall": "3.0", "Content": "Not sure why everyone is giving this camera such high praises. I've had it for about 4 years and it's been a trusty little camera for what it is. Functionality wise it's easy to setup, easy to use, and easy to work with. There's very little on the user-end that you can mess with (ISO is the deepest I could get besides facial recognition, flash, and a few other settings). So for a pick-up-and-shoot camera, this is pretty good.My biggest problem comes from the quality of the basic settings. Because I cannot manually edit every aspect of the camera (ISO, F-stop, exposure time, etc.) I am at the whims of the 'smart' focusing and settings. There are certain settings (low-lit, up-close action, among others) where this camera will just not produce results worth keeping. With flash, without flash, face detection on, face detection off, it just doesn't matter in some situations and will just give you a blurry, grainy photo.It's not the worst digital camera on the market, but not sure it's worth the price tag (even if it is lower than others). Go for newer models or a compact dslr (I realize these are probably still really expensive, but worth it usually).", "Date": "April 5, 2013"}, {"Title": "Only as good as the user", "Author": "D. NEVIN \"\"Doc\"\"", "ReviewID": "R24Y9AC9WKPZ8W", "Overall": "5.0", "Content": "I've had this camera for over 3 years and have never had a problem with it.  I've taken a few thousand photos with it!I also have a Nikon D-500 and a Panasonic Lumix Mega Zoom. Each has it's own unique features / abilities so I also have a good point of reference.You do need to spend some time learning how to take advantage of it's features. The image stabilization can be turned on or off.You need to make sure when you take a picture that you have the dial in the correct position.  If you have hit the Macro button for close ups, you won't get a great photo of objects at a distance. On the manual mode you can do a lot of programing but, you need to understand how that willaffect your picture. The visual aids on this camera are wonderful. I would suggest you leave them on to help in getting the right settings.I most recently took this camera to Scotland and used it while sailing on a grey day with wind and rain and it took some great photos with no blurring.Don't go cheap on the Memory Stick Duo/PRO Duo which you have to purchase separately and make sure it matches your camera.As I said, this camera has performed well for 3 years and I have no complaints and highly recommend it.", "Date": "January 2, 2013"}, {"Title": "GREAT Camera by Sony", "Author": "J. Danzig", "ReviewID": "R2BSL2T4M12Q00", "Overall": "5.0", "Content": "I know how manufacturers typically build \"newer\" models of these throw away devices. I think they poured a lot of time and effort into changing that in these models.Great camera. Features work better than expected and since I purchase this camera years ago I STILL use it today for Hiking, Boating and many family functions.", "Date": "June 9, 2011"}, {"Title": "Excellent quality, easy to use, no complaints!", "Author": "EDMO", "ReviewID": "RZ7RZ2NYNW4DM", "Overall": "5.0", "Content": "I recently drowned my old sony cybershot, and discovered this newer model when looking for a replacement. Just like the previous model, it didn't disappoint. The picture quality is fantastic (though it's hard to tell exactly what difference the extra megapixels makes), it is simple to use yet has a huge range of features for those who are more photographically-minded. I recently bought underwater housing for it, and it takes excellent underwater photos and videos as well using the Underwater mode. Very satisfied!", "Date": "March 13, 2011"}, {"Title": "Excellent pocket camera for the price", "Author": "CJS", "ReviewID": "R2BK5F8YR0BPR5", "Overall": "5.0", "Content": "The best things are: large aperture allowing taking pictures without flash indoor.  Large and crispy LCD monitor.  Take very good pictures.  Battery life is not very long but keeping a spare definitely helps.  Bought one for myself, my child and my boss.", "Date": "August 20, 2010"}, {"Title": "well...it's kind of hard to take pictures without a visible screen...", "Author": "al presto", "ReviewID": "R1WQ5U48KJEYA7", "Overall": "2.0", "Content": "I bought this camera a year & a month ago after my last camera started acting up. This was a newer camera, so of course the reviews on it were good. For the past 7 months it was a very good camera, it took pictures relatively well, although I had to work with it a little- I've gotten really good at holding dead still to get a clear photo.A few months ago it started having problems focusing, but would fix itself relatively quick. Then coincidentally, just a few weeks after the warranty expired, the screen went nearly black & I could only make out a faint outline of the picture in bright sunlight. There being no viewfinder, I had no idea what I'm taking a picture of or if it will focus.I depend on my camera on a day to day basis & the inability to use it is driving me crazy! It will cost over a hundred dollars to fix, & it's only one year old! I've treated it with nothing but care & this is what I get.God, my old samsung took a tumble down a rocky hill & survived longer than this piece of crap.Not worth my $200, & never buying Sony again.", "Date": "August 10, 2010"}, {"Title": "A great brand for a great price", "Author": "Bookworm", "ReviewID": "RX2L8G5XN7DUP", "Overall": "5.0", "Content": "This Sony Cybershot is one of the best cameras I have purchased.  The optics with Carl Zeiss lens is fantastic.  I wouldn't use a camera with any other type of lens.  A highly recommended product for the price!", "Date": "March 29, 2010"}, {"Title": "ok replacement", "Author": "J. Kornfeld \"colorshoot\"", "ReviewID": "REA1XRBZR6U06", "Overall": "4.0", "Content": "I bought this camera when I started having problems with my old sony camera. I was disappointed that Sony does not make cameras with view finders anymore. But I thought I would try it anyways with a trip in Africa. With no view finder it was hard to take pictures out side and not sure what you were taking half the time. A view finder is a must. Some confussion on when I wanted to have the flash on with back light like with a sunset and figure in front. Still not light enough. Also difficult to take night shots. Glad to have the same battery as my last camera though. One reason why I bought this model. Size makes it easy to take with you.", "Date": "March 1, 2010"}, {"Title": "Excellent Camera", "Author": "Simms \"Simms\"", "ReviewID": "R3E39IQC7AKDR3", "Overall": "5.0", "Content": "After reading the reviews I was hesitant about buying this camera but having had good experiences with the older model Sony Cybershots I went ahead and purchased this camera for a trip to Washington DC. I was very happy with all aspects of the camera. You do have to buy a memory stick which I purchased off amazon for approximately $12, the memory stick holds 800 high quality pictures so I have no complaints about having to purchase the memory stick. Out of the 300 pictures I took this past week in a variety of conditions, I would say maybe five pictures were blurry so overall the picture quality was not a problem. I would highly recommend this camera for anyone looking for an easy to use camera that takes really good pictures, if you read the directions you will find that this camera has a lot of options to take better pictures in differing conditions.", "Date": "February 24, 2010"}, {"Title": "Great for the user needing simplicity!", "Author": "Maggie B.", "ReviewID": "R3CHRJG9YQV623", "Overall": "5.0", "Content": "This camera was purchased for someone who is completely overwhelmed by technology. Because of the different settings it is possible to just put it on \"easy\" making it entirely simple for the most basic use but still gives excellent quality pictures.  It's the greatest !", "Date": "February 16, 2010"}, {"Title": "Very good point and shoot, not for amatuers", "Author": "S. Raut", "ReviewID": "RI8TQLQUJUMTJ", "Overall": "4.0", "Content": "Its good given the ease of use. It also has big screen. So you need to be aware that it causes a dent on the battery life compared to previous small screen versions. Also, I heard SONY realized now that the pro duo card non-compatibility issue is real fact and that they are gonna stop those versions in future products -  a good move!Camera has some in-built image processing that makes its use really easy and robust. However, if you look carefully the images lack the 'depth' which I saw in my another Canon Powershot. Sony is really sleek and portable though. Nice to be used if you are not an enthusiast and wanna use for daily purpose and picnics.", "Date": "January 31, 2010"}, {"Title": "Sony Cyber-Shot", "Author": "NatalieJT", "ReviewID": "R35WRGA27TV4SF", "Overall": "4.0", "Content": "I bought this camera for my daughter last year for Christmas to take to college. It was stolen in January, so I ordered another one for this Christmas. She loved the first one so much that she said she wanted the same camera to replace it with. I decided to order silver the second time instead of the red because there was a huge price difference and I didn't feel like paying a fortune to replace it. She didn't mind the silver anyway. The only thing that I have noticed is that the second one (silver) doesn't seem to be taking as nice of quality pictures as the first did. I'm not sure why.", "Date": "January 30, 2010"}, {"Title": "Great camera for a good price", "Author": "Joseph J. Seiple", "ReviewID": "R2WWWGZ7Y45VZ1", "Overall": "5.0", "Content": "I always look at reviews before I purchase so I thought I would write one. This camera is great I bought it for my wife she loves it. The smile shutter works great it makes it easy for her not to mess up pictures of the kids. I have always liked sony cameras so this one won't disappoint you.", "Date": "January 7, 2010"}, {"Title": "Best By Far", "Author": "Zachary A. Kelly", "ReviewID": "R12KK7856VNS3B", "Overall": "5.0", "Content": "by this is by far the best camera ive ever had or used. the quality is amazing and the features make for the best shots. takes a while to learn all the features but is worth it, im very happy with this camera.", "Date": "December 20, 2009"}, {"Title": "Good buy for beginners", "Author": "Barbara K. Watanabe \"Happy Gram\"", "ReviewID": "R3E3XJUGEUW327", "Overall": "4.0", "Content": "For a first time digital camera buyer and user, this camera meets our needs.  Easy to operate, stylish, good picture quality, size is very convenient.", "Date": "December 15, 2009"}, {"Title": "Great Camera", "Author": "Mark Holt \"mh4\"", "ReviewID": "R1PIF5T1L2I98D", "Overall": "5.0", "Content": "We really like the camera!  Takes good pictures fast from start up. Videos are pretty good quality.  Best price around for this camera.", "Date": "October 13, 2009"}, {"Title": "Great Camera!", "Author": "Mayra R. Gillison \"love it\"", "ReviewID": "R2V9DJKB5CFLHG", "Overall": "4.0", "Content": "The camera takes beautiful pictures.  I don't regret buying this camera at all.  The 'smile' features comes in handy when you're trying to take pictures of an active 8mos old.  The only thing con is the battery life doesn't last that long.", "Date": "August 18, 2009"}, {"Title": "Great for photo loving people!", "Author": "Kathleen E. Mcnamara \"Kat Mac\"", "ReviewID": "R239UMJUBXPDCH", "Overall": "5.0", "Content": "I researched as much as I could on cameras and found this one to be reasonable priced with as many features as it has. The picture quality is great--12mp and down. The battery life is ok but I would not hesitate to buy this model again. The options for pictures effects are fun and it is easy to use for the most in-experienced of photographers.", "Date": "August 16, 2009"}, {"Title": "Very good cam", "Author": "Jose Pennafort", "ReviewID": "R2XNKQ5J7ZR5YP", "Overall": "5.0", "Content": "I loved this cam, I am completely amateur in photos, but this one is very easy to use and have a lot of interesting resources.", "Date": "July 20, 2009"}, {"Title": "great camera", "Author": "J. Mccullough \"JennBobby\"", "ReviewID": "R1PX7HWVGAKPE5", "Overall": "4.0", "Content": "We are very pleased with this camera. I am glad that we purchased it. The only quirk I have, is getting blurry pictures. I am sure with more practice we will figure out how not to have blurry pictures. Other than that I really like the camera. The video feature is great!", "Date": "July 11, 2009"}, {"Title": "Some serious flaws", "Author": "Thomas", "ReviewID": "R3NY2V3OV1LCNJ", "Overall": "3.0", "Content": "I picked this camera as a gift to my mother in law because it had good reviews on Amazon, but I missed two important points that really make me regret my decision: (1) It uses memory cards with a Sony proprietary format (\"Memory stick PRO Duo\"), not the ubiquitous SD/SDHC memory cards. If you have a laptop, monitor or printer with a built-in card reader, you probably won't be able to use it to read the pictures from the card. (2) To connect to computers, it uses a Sony proprietary cable with a massive and flimsy-looking connector on the camera side. You cannot use a USB-to-micro-USB cable, like for all other cameras on the market. If you lose or break the cable, good luck to find a replacement.Other than that, the LCD screen is nice and the camera takes decent pictures.", "Date": "December 22, 2010"}, {"Title": "Great pix, lots of features, but stuck with \"memory schtick\"", "Author": "John Bartas", "ReviewID": "RHU7ESPQJN8UQ", "Overall": "4.0", "Content": "I've bought several of these little digital cameras over the last 15 years, and this little Sony holds it's own. Of course it has more pixels than the older cameras, however at around 8 mp other things like shutter speed and quality of optics are more important to image quality. For this reason I tend to prefer buying from experienced high-end camera makers over consumer electronics makers like Sony. My digital Nikons and Canons have taken great pictures since I first bought a Nikon Cool-pix in '97 or so. I decided to give this Sony a try due to the large screen and better than average telephoto range. The Sony, I'm happy to say, keeps up with the camera pros. Maybe it's the Carl Zeiss optics - I had assumed that Sony just bought the rights to use the name, but it's actually a decent lens system. The telephoto works well, and pictures are as sharp as the competition throughout the focal range. Color balance and light metering are also first rate. My kids love playing with the smile feature, and they make videos which, while not as good as a dedicated camcorder, are better than missing the action altogether. The LCD is large and clear, and we don't miss the rangefinder at all. Battery life is good. Overall, excellent quality and feature set.We've had nothing but trouble with Sony TVs since 1990 or so, and our one Sony Camcorder was a reliability disaster. But this camera must be made but a totally different branch of the company, since all the controls work, and the unit feels solid. It's been used a lot in the near-year we've had it, and had no issues at all. Software and hardware all work great.My only complaint, and the reason this is not a 5-star review, is the non-standard memory stick. Why can't Sony use an industry standard like Micro SD, and stop trying to push their proprietary versions on people? They've been trying to do this since the Betamax, and it's never worked. They hurt their products and their customers with this attitude, trying to squeeze a few more nickels out of people. A very short-sighted business practice. But this camera's other great features make it worth overlooking the silly Sony stick - just allow a few extra bucks for the \"stick tax\".Digital cameras being what they are, someday soon Sony will sadly replace this little gem with something that has more mega-pixels, and there should be some great pricing as this is discontinued. If you can, snag one then - the new model won't take pictures that are any better. Meanwhile, If you're looking for a Camera in this class, this should be on your short list.", "Date": "November 5, 2010"}, {"Title": "Sony Cyber-shotDSC-W230 - Great camera", "Author": "Matthew B. Schulz", "ReviewID": "RF495ASX4PBKB", "Overall": "5.0", "Content": "This is a great camera for the price.  The red color never hurts either.", "Date": "June 25, 2009"}, {"Title": "Great value product", "Author": "Joel Camilo \"Technologic\"", "ReviewID": "R3RB8B18OZYTCJ", "Overall": "5.0", "Content": "It might no be te best camera, but I love the 12 mp resolution. I actually find it perfect.", "Date": "April 14, 2009"}, {"Title": "Garbage", "Author": "Pen Name \"Turk\"", "ReviewID": "R21504OFAELDUG", "Overall": "1.0", "Content": "The camera is sleek looking. Nice with a big 3 inch LCD screen on the back and a nice Carl Zeiss lens.It is a Sony. That is why I bought it.After receiving the camera I took dozens of pictures to evaluate the picture quality with different adjustments/modes/light conditions. The result? It is garbage made in China. Except one or two pictures, the photos are blurry with lots of noise.A total disappointment. This is a 12 mp camera, mind you. Its photos are absolutely inferior in quality compared to my previous Sony CyberShot DSC-P120 (Made in Japan) 5mp camera. It is not an improvement.You would think in time Sony would better its products, not worsen. I am deeply disappointed with this Sony product.Sony must be ashamed of lending its name to this garbage. I returned it and a got a refund thanks to Amazon.", "Date": "November 10, 2009"}, {"Title": "good-bye Kodak", "Author": "S. Brown", "ReviewID": "REYUAKX5MGHJN", "Overall": "5.0", "Content": "When I purchaced my Kodak in 2008, My husband said,\"buy a Sony\". Well listen closely honey... YOU WERE RIGHT!Easy,quick,beautiful pictures. Love this camera!", "Date": "May 13, 2009"}, {"Title": "Not crazy about my cybershot", "Author": "Rita W. Click \"Sooner Reader\"", "ReviewID": "RPRTNEQK0QQI5", "Overall": "1.0", "Content": "The zoom is in the worst place ever and my pictures turn out grainy 90% of the time!  I am normally a Sony fan but not with the Cybershot.", "Date": "April 7, 2010"}, {"Title": "LOOPED HORIZON LINES", "Author": "Margaret Freund", "ReviewID": "R2YA8NVXL3YD50", "Overall": "2.0", "Content": "Bought this ignorantly because I did not realize it had no viewfinder and ergo when you try to take a photo outdoors ...you cannot see what you are taking. Called Sony and their \"professional\" advice was to go to a shady area and then take the photo.  Of course, if you are in the Sahara Desert this will be tough but that was their answer.  Inquired as to why when taking beach scenes..the horizon line is arched at both ends and they did not understand the word I used and when I explained it I was told they understood but it could not be used in terms of a camera even though it explains accurately what the camera does..it pulls down the horizon line on the right and left effectively making the shot null and void.  Told them I sell my photos and their answer was You should have bought a better model?  I then asked why they sell substandard models and have no disclaimer saying that it is not a good idea to take pictures outdoors as there is a very good chance you will not be able to see what you are taking.  I say .take up painting...at least you can see what you are painting.  Do not purchase this unless you have supersonic vision.", "Date": "March 29, 2010"}, {"Title": "I Like My Old Cyber-Shot Better", "Author": "Cyndie E", "ReviewID": "RQA0YRTS6YXXC", "Overall": "4.0", "Content": "The screen it's plastic not glass so it gets very dirty. It doesn't use regular rechargeble AA batteries so if you are on the go and run out of batteries you can not go to the store and get some new ones. The material of the whole thing it's like a mixed of metal and plastic (it makes it look cheap)The memory stick needs an adapter to download pictures to computer. But, I must say, I got it for a good price (my old Cyber-Shot was like $260 4 years ago) it's a 12MP instead of 7.5MP It takes nice pictures. Over all I am content with my new camara I guess I gotta get used to it.", "Date": "December 28, 2009"}, {"Title": "This camera is just average.", "Author": "Thingyo", "ReviewID": "R1MJO4I7U1F996", "Overall": "3.0", "Content": "I bought this camera after reading reviews from Amazon.  This camera is OK, but not great as other people suggested here.  I had old Canon Powershot S500, and it gave much better picture quality than this one with less pixel size.  I was disappointed of picture quality, specially coming from Sony.  The quality of picture from this camera in daytime is OK, but in nightime, it showed too much redish colors with blurring images.  Next time, I will stick to Cannon or Nikon.", "Date": "November 2, 2009"}, {"Title": "Great deal on a great camera", "Author": "Kelly bertram", "ReviewID": "R3RQM1PJITC3F", "Overall": "5.0", "Content": "I was very pleased with quality of the camera and price because I bought my original one (same style) in 2010 but my toddler accidently got water in mine and I didnt have the money to invest in a brand new camera so I found my old one on here.  Since I had everything that goes with the camera, it made it an easy choice to at least try.  And to my surprise it was perfect!  And in good timing because we found out were having twins in april!!  Lots a of pictures to take soon!!", "Date": "December 31, 2013"}, {"Title": "One of the best point and shoots I've ever had", "Author": "CynicalPink", "ReviewID": "R3F0UPDYIT5MCX", "Overall": "5.0", "Content": "This camera is GREAT at capturing color. I usually find that point and shoots dull colors quite a bit, but everything looks vivid and crisp. I've gotten a lot of compliments on the photos I've taken with this. It's also quite slim.", "Date": "September 19, 2013"}, {"Title": "not as described", "Author": "Muhammed", "ReviewID": "R244SSHX2W6BMV", "Overall": "3.0", "Content": "There was not a charger with the item. Its screen has many many scratches. Battery is dead. not memory included. very old.", "Date": "August 3, 2013"}, {"Title": "Best buy ever", "Author": "nikki", "ReviewID": "R2U2FBULICUYDB", "Overall": "5.0", "Content": "I love my camera got in 2009 it is now 2013 (yes i know im late) and it great. I get compliments on it every where i go. It has never malfunctioned on me and everything was in brand new condition when i got it.", "Date": "July 29, 2013"}, {"Title": "less than one star", "Author": "Lynn N.", "ReviewID": "RMECBVZTEMV97", "Overall": "1.0", "Content": "I ordered this camera for my sister who lives in Panama.  My trip was cancelled due to illness and I was not able to get the camera to her for 2 months.  The camera was damaged when she finally opened it and this vendor would not let me return and they would not replace it.  I sent the camera to Sony and they do not cover the damage that the camera has, even though the camera was delivered in that condition.  It has a crack in the LCD screen and does not work at all. Another $90 will fix it.  No way to Sony.  I will go buy something else. I just wasted $200.", "Date": "July 23, 2013"}, {"Title": "Sony Cyber-shot DSC-W230", "Author": "Robert M. Breen", "ReviewID": "R24WMIRT8ZXA7O", "Overall": "5.0", "Content": "Easy to use and set up.  Have received many complements on photos taken from friends and family.  Photos were so sharp and clear.  Zoom was especially clear and sharp.", "Date": "March 19, 2013"}, {"Title": "I like", "Author": "juan carlos quijada", "ReviewID": "R2ZMCYL1E0EA89", "Overall": "5.0", "Content": "The camera is very good. small, comfortable and very good pictures. It is excellent for everyday use. I recommend it widely", "Date": "March 11, 2013"}, {"Title": "Good camera for the price", "Author": "designateddoug", "ReviewID": "R1HB9LHDXYCEZH", "Overall": "5.0", "Content": "Bought this for my mom, she needed something simple to use that took decent pictures. This little Cyber shot did just that and more. She loves the camera, so I can't complain.", "Date": "January 30, 2013"}, {"Title": "Nice digital camera", "Author": "greenthumb", "ReviewID": "R2DN34I6KLD63A", "Overall": "5.0", "Content": "I ave found all he features on the camera easy to use. It is a little smaller than I expected, but I'm getting used to it. Would recommend this cameral for families to get great pics of their children due to the smile feature.", "Date": "January 7, 2013"}, {"Title": "Userfriendly device", "Author": "Alberto Loges", "ReviewID": "RKYG2FRZ7B83S", "Overall": "4.0", "Content": "Quality pictures and really strong. I recommend it specially for people how is not professional but enjoy taking good pictures. Convenient when traveling", "Date": "January 2, 2013"}, {"Title": "Awesome camera for my vacation", "Author": "Amanda Davidson", "ReviewID": "R1K49RTSZ0UABC", "Overall": "5.0", "Content": "I bought this camera for a trip to Disneyland so I wouldn't have to use my Iphone the whole time.  This camera was great we got some awesome picuters!  I was light weight and easy to carry around.  I even forgot to secure it on Splash Mountian and It took a bit of water with ease.  If you looking for a little camera for a trip or event I recommend this one.  You wont be disapointed.", "Date": "December 15, 2012"}, {"Title": "Gorgeous shots!", "Author": "TJ", "ReviewID": "R2SXLJJDMDZA43", "Overall": "5.0", "Content": "If you ever want a beautiful picture, then this camera is the one. The colors are so vivid and clear that you would swear it was done by a professional.", "Date": "November 18, 2012"}, {"Title": "LOVE LOVE LOVE!!!!", "Author": "Eb6191", "ReviewID": "R20WU4YI9IUKU9", "Overall": "5.0", "Content": "This camera is perfect!! I read a below review of somebody who researched a ton of cameras and said don't waste your time because this one is the best and to trust her...SO glad I did! It really takes beautiful pictures and wasn't too expensive. Don't waste your time searching I'm on my 9th camera of college and this is by far the best one!!", "Date": "September 30, 2012"}, {"Title": "Nice little camera", "Author": "Scott N Siettmann", "ReviewID": "RI85PCVN0IKGT", "Overall": "5.0", "Content": "Seller got the camera to me quickly! I enjoy the slim design with multiple features. Exactly what I was looking for in a quality camera I can carry in a pocket.", "Date": "July 24, 2012"}, {"Title": "Not A Bad Camera But Probably Not Worth It", "Author": "Jessica Wine", "ReviewID": "R1Y18S267SBAXX", "Overall": "3.0", "Content": "This camera works just fine as compared to most other ones we have used in the price range.  Like many of them the shutter speed is kind of slow at times and the red eye filter isn't as amazing as they say.  However, I have to say the biggest reason for not buying it is the same one for any generic non professional camera these days. It is that you might as well use your phone.  Yes, the quality is not as good but what do you always have with you, your phone or your camera? When I tried to keep my Cyber-shot with me in my purse all the time I ended up breaking it and having to buy another (not the camera's fault). Besides I have read that old fashioned film is only four to eight megapixels.  How close do you want to view my acne? Keep your money and maybe buy a better phone.", "Date": "January 3, 2012"}, {"Title": "Sony DSC-W230", "Author": "Bob", "ReviewID": "R3FOTKWPX9BGO3", "Overall": "5.0", "Content": "With a 4X optical zoom, the Sony DSC-W230 excels at low light level photos, including indoor. The wide angle lens is also a major plus for the unit.I have another camera for use outdoors, where I might need 18X optical for wildlife photos.  The Sony unit is compact, uses a 12MP sensor, and is perfect for portable, indoor use.  For me there is really no downside to this camera. I knew what I wanted it for, and it has performed perfectly in that capacity.", "Date": "October 19, 2011"}, {"Title": "Best camera ever!", "Author": "Lauren", "ReviewID": "R1RWWZVCN58620", "Overall": "5.0", "Content": "I love this camera, takes gorgeous pictures, lightweight and very user friendly.A definate best buy. 2nd one I've owned in my life.", "Date": "October 12, 2011"}, {"Title": "Sony cameras are great.", "Author": "NDGR", "ReviewID": "R3PCOQT167DIY0", "Overall": "5.0", "Content": "My first camera was a Sony CyberShot and ever since then, I have never bought another point and shoot for myself. Sony cameras in general take great pictures and have a setting for almost anything you would need. The batteries last a while, too. I recently got this model to replace a camera whose screen got cracked and I love it! It requires no special software, so it is both PC and Mac compatible. Overall, I was really impressed with this camera. I have not run into any problems with it. If you do not choose to buy this camera, I highly recommend a camera in the Sony family.", "Date": "June 29, 2011"}, {"Title": "Awesome camera", "Author": "Gaspartacus", "ReviewID": "R2IW0V2W5VMM8L", "Overall": "4.0", "Content": "Best camera i have bought thus far. Picture is real clear. Although the dark red is more of a dark pink:-/", "Date": "April 23, 2011"}, {"Title": "Love it -", "Author": "DJ", "ReviewID": "R359B9G5O6BQQD", "Overall": "4.0", "Content": "I am loving this camera.  It's easy to use, compact and the picture quality is really good.  If you want something with excellent quality, try a SRL, which I switch back to my SRL occationally, but this is just a great size.", "Date": "March 10, 2011"}, {"Title": "Its a simple but nice camera", "Author": "ravenlrod", "ReviewID": "R6LR4EX3AGB7G", "Overall": "4.0", "Content": "The pictures are nice. The camera is easy to use. It's definitely not designed for the professional photographer. But for us mere mortals, it will get the job done nicely.", "Date": "February 25, 2011"}, {"Title": "Great camera", "Author": "Penelope B.", "ReviewID": "R380WVP5X9R5V", "Overall": "5.0", "Content": "I purchased this camera for my \"spare/back-up\" camera for my work.  It's easy to use and the 3\" display screen is awesome!  Zooms really close too!  Overall, great camera for the money.", "Date": "December 22, 2010"}, {"Title": "Great camera", "Author": "Margaret J. Lynne", "ReviewID": "RGQ76K9F3VB9W", "Overall": "5.0", "Content": "I have 5 sony cameras.  stick with one brand because the controls are fairly similar.  this low cost unit is almost as good as my sony dh50 except for the optical zoom.  I like to shoot iso at parties so it does not annoy people with constant flashing.  Picture quality is good enough.  High light shooting is surperb.  I am getting lazy and find the easy shoot control is as good as anythinig I can do with the camera and can give me consistently great shots.", "Date": "December 5, 2010"}, {"Title": "Compact, Quality Digital Camera", "Author": "L. Eldon \"cornish bird\"", "ReviewID": "R1QM1PS9ZW8Q8A", "Overall": "5.0", "Content": "I bought this camera as an identical replacement as I unfortuantely lost my first one. The fact I returned to the same item says it all really. But yes the price is amazing for the camera. It is compact, high quality, great zoom and easy to use. Very up to date technology at an affordable price. I would highly recommend.", "Date": "November 24, 2010"}, {"Title": "FABULOUS pics, GREAT Amazon price!", "Author": "Less Wrinkled, & HAPPY about it!", "ReviewID": "R2K0AIXFQHH2NA", "Overall": "5.0", "Content": "I purchased this camera prior to going on a Christmas cruise.  It's very easy to use, produces high resolution images, and is light and easy to carry.  I replaced my original Sony Cybershot camera, which I paid over $800 for when they FIRST came out w/digital cameras, and this runs CIRCLES around that one!  The images are incredibly clear!  EXTREMELY pleased with this purchase based on QUALITY of pics produced, as well as GREAT Amazon price!", "Date": "September 18, 2010"}, {"Title": "love it!!!!", "Author": "Stephanie L. Lyons", "ReviewID": "R3813PM0X54AK7", "Overall": "5.0", "Content": "Love my new camara. cant wait use it more. to bad I have to buy another battery.", "Date": "June 7, 2010"}, {"Title": "Sony digitil camera W230", "Author": "P. Edwards", "ReviewID": "R2IFHSNOH9P9JM", "Overall": "5.0", "Content": "I love this camera. The 3\" screen is the best.  I had a Sony camera before and loved it, too. A great replacement with a great price.", "Date": "May 12, 2010"}, {"Title": "You can be photography stupid and still get great shots!", "Author": "John Perides", "ReviewID": "R2PX3DJ59QUW4R", "Overall": "5.0", "Content": "I have resisted going digital for years.  Back in the 1970s and 80s I shot thousands of photos with an SLR that had a very good lens.  Prints eventually gave way to slides to save on money.  All of them eventually were relegated to the desk drawers or in rarely opened albums.  The camera even went on the shelf.  I wanted to spend my money on things other than Kodak and Fuji.  When digital came along I went counter to the culture.  I could see the cost sense with no film to buy and develop, but everyone was shooting what I always called snapshots of people's heads blocking real subject-matter or poorly constructed photographic images of highly unintelligible subjects with rotten lenses.  You know what I mean, generally worthless pictures. Now I am older, more sentimental and soon off to Italy.  I want shots of my friends in unusual places, the food, the land, the chefs, the farmers, grapes on-the-vine, cut cheese, wrinkled faces, mountains, rivers, sculptures - detail!  After only a few dozen shots with this camera set on automatic, I am astounded at the detail, the contrast, the absolute perfect interpretation of the subject matter without touching a single setting.  Buy it and love your subjects - love the fact that you will be able to revisit them with all the passion and stirring of soul that you had when you first saw them.  Buy the 8 gig Memory Stick ProDuo as well and you will have room for thousands of shots and hours of video.  Enjoy.", "Date": "May 10, 2010"}, {"Title": "Sony Camera", "Author": "Marty L. Martinez", "ReviewID": "R1OS0JCE8FF7Q6", "Overall": "4.0", "Content": "I am pleased with the purchase of the Sony Cyber-Shot camera.  We have four Sony cameras in our family and are very pleased.  Purchase on Amazon made comparisons and pricing very easy.", "Date": "May 4, 2010"}, {"Title": "PRICE WAS ALLITLE HIGHER THAN OTHER ITEMS SAME QUALITY", "Author": "Richard B. Cayton \"Rick Cayton\"", "ReviewID": "R34XBVBQA18CVA", "Overall": "3.0", "Content": "I THOUGHT I WAS GETTING A FAIR PRICE, I MADE THE MISTAKE AND BOUGHT WITHOUT DOING MORE RESEARCH PAID MORE THAN I NEEDED TO", "Date": "April 27, 2010"}, {"Title": "Good camera for casual use", "Author": "Nenaptio", "ReviewID": "RJZJ8YMZX6YJB", "Overall": "4.0", "Content": "I got this camera as a gift and I think that this camera is cheap(price), but the quality is pretty good.This camera has a pretty decent picture quality, and video quality.It has a large lcd screen, but the bad part is that it covers up the area where a viewfinder usually is.there are plenty of feature, some that I don't even need, but is fun to play with.There are not many things that are bad, only the missing viewfinder and that it only uses pro duo memory cards.", "Date": "March 14, 2010"}, {"Title": "Sony Cybershot DSC W 230 digital Camera", "Author": "Garleeque", "ReviewID": "R22BHQ43PCW7K", "Overall": "5.0", "Content": "Bought this camera to replace my wife's earlier model Sony that took a bath!!!.  She loves this one.  Bigger display.  Only drawback is lack of an optical viewfinder, but the LCD display is so good that this lack is not a problem.Would wholeheartedly recommend this camera to anyone.  Great buy, and the usual great Amazon service.", "Date": "March 4, 2010"}, {"Title": "Nice Performance", "Author": "E. V. Jimenez", "ReviewID": "RYWFG8GJM2Y84", "Overall": "5.0", "Content": "Nice features. Very stable. Good pictures in the night, the flash light is very good. I also bought a 2GB memory stick and now I can take more than 1000 pictures in nice resolutions.", "Date": "March 3, 2010"}, {"Title": "Very nice camera for the price", "Author": "Fabio", "ReviewID": "R23E15OQ2WP0CM", "Overall": "4.0", "Content": "I started using it the next day after receive it.My old camera was a cybershot, therefore there is no much difference in the ease of use.I like it, it is very portable.I would like the battery to last longer, if you record video, consumes the power faster...anyway, nice pictures, easy to use, good features.It worth the price.", "Date": "February 19, 2010"}, {"Title": "A good camera", "Author": "Mintu Dey", "ReviewID": "R2ALZS1WUB83SU", "Overall": "4.0", "Content": "Its a good camera with great picture quality. Easy to use with different modes of operating with it. Image stabilization avoids blurring of images and you can click even when you are moving.But may be because of the brand name the cost is a little higher than other cameras with similar features.Over all its a good product to buy.", "Date": "February 10, 2010"}, {"Title": "Great Camera!", "Author": "Joseph Griffin", "ReviewID": "R23TANPE6OEN0U", "Overall": "5.0", "Content": "Bought this camera for my wife for Christmas. She loves it! Picture quality is excellent, and she is still dicovering new features. I know I saved at least $40 on the price over regular retail. Very pleased.", "Date": "February 10, 2010"}, {"Title": "best camera, best price", "Author": "Levani Kikacheishvili \"I am I\"", "ReviewID": "R2CSQSPCZW75EV", "Overall": "5.0", "Content": "I bought this camera 1 month ago on amazon, and I am very setisfied whit it's quality. During my trip to Dubai I bought the same model and the quality of pictures were definitely much worse than one bought on amazon. I think that one was something like fake, not genuine, so I advise you to buy from amazon any fear to get fake. It's really good, and price is more than accaptable.", "Date": "February 7, 2010"}, {"Title": "only takes one pic without memory card.", "Author": "sparky", "ReviewID": "R1Y5GH7Y4QVEEV", "Overall": "4.0", "Content": "best camera ever except if you want to take more than one picture you will need a memory card. Why do companies like to screw us. My opinion is that it should come with a memory card, one nobody wants to pay that much just to take one picture. Otherwise you wont find a better camera.", "Date": "February 6, 2010"}, {"Title": "Sony Cyber-shot DSC-W190", "Author": "Michael Tatom", "ReviewID": "R2FAG8D7M6QM6T", "Overall": "4.0", "Content": "You'll find it hard to beat this camera for the price--it's as simple as that. Well-made, compact, powerful features, easy to use, excellent pictures (12.1 mega pixels) and very affordable. I own four good digital cameras already--two Nikons and two Pentax--and this is the all-around winner for quality, performance and ease of use. Throw it in your pocket or purse and you're good to go. You won't regret buying this baby. Oh yea, the battery life seems fine to me.", "Date": "February 3, 2010"}, {"Title": "Sony Cyber Shot W230", "Author": "Ricky", "ReviewID": "RHYYZL8R6OCZE", "Overall": "5.0", "Content": "Overall I think the camera takes great pictures, its an everyday camera and you cannot expect professional quality from it, price wise not bad,I will recommend this to anyone who is not deep into newer technology because its easy to use and its a simple camera.Only thing is battery life sucks.", "Date": "February 2, 2010"}, {"Title": "Sony Cyber-shot very nice!", "Author": "T. Hatfield \"travel RN\"", "ReviewID": "R4OQEQ9B3QV8Y", "Overall": "4.0", "Content": "I already had an older version of the Cyber-shot camera, but thought I would like some of the newer features of this one. They are GREAT! I am extremely pleased with my purchase.", "Date": "January 30, 2010"}, {"Title": "Nice camera", "Author": "Shafiur Rahman Mohammad \"Sha\"", "ReviewID": "R30DAYV8K9KKQY", "Overall": "4.0", "Content": "I should call myself a Sony products fan. I bought a handycam, camera from them previously. This is my third camera from sony, and it is perfect. Good picture quality and easy to use. I would recommend everyone to have on for themselves. Optical image stabilization does not make that much of a difference. One thing I dislike about Amazon is their free shipping, they were supposed to ship in 7 days. But It took 11 days to come to my place.", "Date": "January 30, 2010"}, {"Title": "Awesome Camera!", "Author": "Eric Durbin", "ReviewID": "R29D5PUHMHVVBF", "Overall": "5.0", "Content": "Very nice camera.  My wife loved it!  Easy to take photos and photo quality is excellent.", "Date": "January 4, 2010"}, {"Title": "Very good camera for the price", "Author": "WI Badger", "ReviewID": "R1E4VGEXIAU0KB", "Overall": "5.0", "Content": "The camera is new only for a couple weeks, but so far we really like it.  Features were easy to use and picture quality was very good.  My last camera was very bad at taking indoor pictures (a 5 MP Powershot), this seems to be a lot better and more versatile.", "Date": "January 3, 2010"}, {"Title": "Rugged and Fantastic", "Author": "James P. Sullivan \"skipsul\"", "ReviewID": "R6WMN48Q4JUHE", "Overall": "5.0", "Content": "Got this for my 9 year old for Christmas, and so far she has not managed to break it - high marks on durability.Ease of use is incredible, I just opened the box, handed it to her, and she's gone to town with it.  Picture quality is just great, it shoots very good movies, its image stabilization and auto-focus are superb.The price for all of this is a bargain.  Very highly recommended.Great job Sony!", "Date": "January 3, 2010"}, {"Title": "Issy's Review", "Author": "Issy", "ReviewID": "R3LUCGMG89ZUER", "Overall": "5.0", "Content": "Great little camera.  Lots of features and I love the 'in camera' editing for red eye, cropping, etc.  It feels really fragile to me so I keep it up high and away from my children! (that might be because we had the Olympus waterproof/shock proof camera beforehand)", "Date": "December 15, 2009"}, {"Title": "Superb pictures!!!", "Author": "D. Doyle \"apple addict\"", "ReviewID": "R1NCKTFT2ELBUQ", "Overall": "5.0", "Content": "Love this camera!! It's easy to use and takes absolutely beautiful pictures.  There are retouching features that i didn't know about when i bought the camera, like soft focus, partial color, fisheye lens, etc.  It is a great camera, with MANY features, that takes beautiful pictures.  I totally recommend this camera for anyone!", "Date": "December 13, 2009"}, {"Title": "Best carry on Camera", "Author": "Monika", "ReviewID": "R2D9GJYRCQK5TL", "Overall": "5.0", "Content": "It is a very good quality, with a very good battery. It is handy and always ready to picture the moment! Love it!!! If money doesn't matter take the 15MP!", "Date": "December 3, 2009"}, {"Title": "I LIKE THIS", "Author": "C. Peterson", "ReviewID": "R2Y6R15UY0UX1L", "Overall": "5.0", "Content": "USED 2 OF THESE TO TAKE WEDDING PICTURES AND ALL WAS FINE. MY COMPUTER PRINT OUT OF THESEPICTURES WAS GREAT AND WE DID OUR OWN MEMORY BOOK.  GOOOD  DEAL", "Date": "November 24, 2009"}, {"Title": "This camera is amazing", "Author": "Linda F. Goncher \"Linda Faye\"", "ReviewID": "RSSAOHAO5R2OD", "Overall": "5.0", "Content": "This camera has everything - full of features, ease of use, small, attractive (red).  I thought having no view finder would be a negative, but actually this makes it easier to focus on your subject.  Also makes it easier for someone else to take a picture of you!  I read the instructions before using it but you can easily figure out the camera features as you go along.  Everyone likes the slideshow with music feature.  My old Olympic was 9 yrs old & dinosaur when it came to ease of use & features.  This Sony makes taking video a breeze.  The battery changes in less than 2 hours & has a lot of staying power when in use.  I did get an extra battery to switch off, as I'm going on a cruise soon.  Love this camera!", "Date": "November 1, 2009"}, {"Title": "Love Sony cybershots", "Author": "Moneeka C. Mann \"MO4myMann\"", "ReviewID": "R3LRQKVUUTYSK5", "Overall": "5.0", "Content": "This camera is great.. i love how big the screen is and the fact there is not peek through lense that no one ever uses any more on these little digital cameras.. I don't think the battery lasts long enough but i have two so that helps out a lot! And if you're comparing the dsc-w series to the dsc-s series, the w is much better and has more features! definately worth the extra buck!", "Date": "October 16, 2009"}, {"Title": "I love it!", "Author": "C. PURCELL", "ReviewID": "R1AHMCE7BMAT7B", "Overall": "5.0", "Content": "I bought this Sony 12 M for my friend and she is super happy with it. She said that the instructions were clear and the camera was very easy to use and understand. She loves the color and has used it every day.", "Date": "October 4, 2009"}, {"Title": "sony w230 camera", "Author": "A. Qasim", "ReviewID": "R21F5ZG8BIWN7H", "Overall": "5.0", "Content": "excellent camera. great pictures. mostly wedding shots. battery life could have been better. overall very nice camera.", "Date": "September 21, 2009"}, {"Title": "Great camera!!! Great price!!!", "Author": "Hot Nana \"Donna\"", "ReviewID": "R3PEHFRU1Q7XRO", "Overall": "5.0", "Content": "I researched and compared cameras for about 6 months.  I first bought the Kodak Easy Share, but the on/off button was sooooo small.  Returned the Kodak, ordered the Sony Cyber-shot and I love it, but best of all, my husband (Mr. Picky) loves it.", "Date": "September 14, 2009"}, {"Title": "fulfill requirements", "Author": "gho", "ReviewID": "R2UZ3LRSAAK7T1", "Overall": "5.0", "Content": "I needed a point and shoot camera with a larger LCD screen and a longer battery life. This camera satifies both of them. It is the first Sony camera I have ever bought. I owned Olympus and Nikon cameras before. So far I am very pleased with it.", "Date": "September 12, 2009"}, {"Title": "Great camera for the $$$$$$", "Author": "K. Miller", "ReviewID": "R2T38QCCFGRWRQ", "Overall": "5.0", "Content": "The camera takes great pictures.  By no means would I consider myself a professional photographer, but with this camera, great shots come easy.  It's as easy as point and shoot.  I also have a DSC-W150 which I love.  My one complaint is why did they go to a 4x optical zoom with this camera.  My DSC-W150, which is an older model, at least has a 5x.  Other than that, it's a great camera.", "Date": "September 3, 2009"}, {"Title": "Review for Cyber-shot DSC-W230", "Author": "F. Behm", "ReviewID": "R2H81OH1L286EW", "Overall": "5.0", "Content": "This camera is simply amazing i really hope that people can look at these reviews and see that this camera will be a great choice for them. It has the great mode of smile where it the camera just goes off whenver someone smiles. This camera is really great! I recomend it for anyone the photos are crystal clear (even at high speeds) and the camera is simply amazing!", "Date": "August 16, 2009"}, {"Title": "Great Little Camera", "Author": "R. woods", "ReviewID": "R1A6LK3CZX99WR", "Overall": "5.0", "Content": "I got this camera for my wife who never had a digital one beforeIt's great!  It's so easy for her to use.  The pics are crisp and clear.Color is great.  So glad I purchased it.  She's used the delay, but notthe movie feature yet.  More to explore!", "Date": "July 10, 2009"}, {"Title": "Good Buy", "Author": "Kate \"cat lover\"", "ReviewID": "RATQ0AUJW477T", "Overall": "5.0", "Content": "I like this camera.  It has the larger screen on it along with the 4X optical zoom.  It has enough megapixels so that I can enlarge pictures and still have quality pictures.  It also has the steady shot stabilization and smile recognition.  It has all the features I was looking for.", "Date": "June 21, 2009"}, {"Title": "Great buy", "Author": "Zoommer", "ReviewID": "RHO2SAXVHGE3Y", "Overall": "5.0", "Content": "This camera is great, the only complaint is it's zoom is limited. It takes great pix and the software that comes with it has a really creepy facial recognition function. A little weird, but pretty neat for finding pix of people.", "Date": "June 11, 2009"}, {"Title": "The worst camera ever put out by Sony", "Author": "Frank P. James", "ReviewID": "R3FN3I8TSLI01K", "Overall": "1.0", "Content": "Do not get this camera - it's capable of taking the odd spectacular picture, but for the most part it takes blurry shots with horrible color interpretation.  It's a rare lemon for Sony - avoid like the plague.", "Date": "September 5, 2010"}, {"Title": "Sony Cyber-shot DSC-W230 12 MP Digital Camera with...", "Author": "theriv", "ReviewID": "R2M7MIES48NU", "Overall": "5.0", "Content": "The Sony Cyber-shot DSC-W230 12 MP Digital Camera is a great camera for capturing those special moments. The camera has an easy to use menu on the camera and takes greats pictures.", "Date": "June 8, 2009"}, {"Title": "Best camera that I had seen ever", "Author": "Ratna S. Singamsetty \"Siri\"", "ReviewID": "R19R9X9U6EHE13", "Overall": "5.0", "Content": "I feel that this camera is the best one that I had ever seen and thats the reason I bought 3 cameras from amazon. simply awesome", "Date": "November 12, 2009"}, {"Title": "I loooooooooove it.", "Author": "Asma K. Siddiqui \"Hihipuffyamiyumi\"", "ReviewID": "R38989YV4RW54H", "Overall": "5.0", "Content": "I was kinda afraid of buying it since i saw bad & good reviews, BUT I love it, really good picture quality & really nice features. The screen kind of seems bigger in pictures but it is really big & clear. I'm extremely picky with cameras, one thing isn't right, & I'm done with it, but this one is perfect, I just had for a couple of days but I really like it, its small & cute.:)", "Date": "October 29, 2009"}, {"Title": "DS-W230", "Author": "Chet Davis \"camera buff 87\"", "ReviewID": "R1RZZ8T2ZKI39N", "Overall": "4.0", "Content": "The feature I like the best is the smile detector. Took a few tries to learn how to use it, but it really works. Also like the the small easy to carry size.", "Date": "October 23, 2009"}, {"Title": "Ok but...", "Author": "WMS", "ReviewID": "R3VG0T5EKVDM8I", "Overall": "3.0", "Content": "This camera is ok... but a little bit bulkyBefore this, i had the DSC-w200 which also has 12.1 meg... but with lighter design.I liked better the W200, too bad i lost it and had to replace it whit this one.", "Date": "April 30, 2009"}, {"Title": "Blurry photos and pixelated noise are the downfall of this camera", "Author": "DB", "ReviewID": "R3966OTY9IQ15Z", "Overall": "2.0", "Content": "We bought this camera after testing it out at Best Buy on several weekend visits and absolutely loved the small size, 3.0 inch LCD display, on-screen menu, and 4x optical zoom of the camera. However, the blurry photos are real downside to this camera. Our last camera was a 5MP Canon PowerShot A95 point and shoot that we got back in 2005 and it by far takes much better pictures. Despite listing image stabilization as a feature of the Cybershot w-230, you have to keep your hands absolutely still. I mean really still in order to avoid blurry photos. It is also difficult to capture clear pictures of movement even when you adjust the settings. Also, this camera does a poor job of taking photos in moderate to low light and night photos are poor as well despite using the low light settings. There is a lot of noise (e.g. big, blurred pixels) in the low light photos and I would say that 1 out of every 3 photos are ruined b/c of either blurriness or low light. Overall, the poor picture quality is real deal killer for me especially since our Canon camera from 5 years ago takes better pictures than this Cybershot. I would not recommend this camera because of the poor image quality. All of the other features are excellent and this camera would be perfect if it was able to combine the high quality images of a Canon camera with the features of the Sony (e.g. 3.0 LCD, 4x optical zoom, etc.) at this price point.", "Date": "January 8, 2010"}, {"Title": "Died after a few months", "Author": "J. Dias", "ReviewID": "R3HSMFTYZ9Z2KA", "Overall": "1.0", "Content": "This camera stopped works after three months. Service not great to get it fixed. Wouldn't recommend this camera.", "Date": "May 23, 2010"}, {"Title": "Sony Cybershot DSC-W230 12MP Digital Camera", "Author": "Meynard O. Princesa", "ReviewID": "RSAGTP57AYB2M", "Overall": "5.0", "Content": "This Camera is very nice...It's a nice gift fore my friend and she likes it...", "Date": "April 2, 2010"}, {"Title": "Great Camera", "Author": "Katherine J. Kelly", "ReviewID": "R310951D4ZZVYJ", "Overall": "5.0", "Content": "I bought this camera for my daughter as a Christmas gift.  She will be traveling to Paris during Spring Break.  I was looking for something light weight, easy to use and had a large memory capacity.  This fit the bill, turns out she had been looking at the same model and color that I bought.  So it was a perfect gift.", "Date": "February 7, 2010"}, {"Title": "Great Camera for the price", "Author": "Florence Dellorfano \"Floey33\"", "ReviewID": "R2IW39MNGSACBQ", "Overall": "4.0", "Content": "This is a great camera for the price the battery life is longer than the Olympus cameras I have had the picture quality is great! My next camera willdefinetly be a Sony cybershot!", "Date": "November 11, 2009"}, {"Title": "DONT BUY THIS", "Author": "A-RON \"A-RON\"", "ReviewID": "RYA3JEEJXLCQR", "Overall": "1.0", "Content": "I gave this turd a 1 star for the simple fact that it takes terrible photos and all the features and portability mean nothing if it cant do what a camera is supposed to do. every single picture has blur to it unless the subject is a non living non moving object. low light photos? don't ask!! very disapointed. Buy a camera made by a camera company....", "Date": "December 15, 2009"}, {"Title": "so disappointed !", "Author": "Wei Qin \"Anne Qin\"", "ReviewID": "R1RLTJ0XEJL3L7", "Overall": "3.0", "Content": "I brought a sony dscw85 several years ago and I love it so much. So this time when I think about buy a new digital camera, I just want DSC W series. But i have to say, I didn't see much approvements for the W230...", "Date": "December 10, 2009"}, {"Title": "Not so happy", "Author": "Janna Roukhmanova", "ReviewID": "R1XL238OINVJN", "Overall": "2.0", "Content": "I had casio before and i was very happy with it.But after time i had to get a new one so i diside to try sony and it  had very good review;s so i got it.It take good photos , but the batery life is not good, its very have and big after having casio, the memory card its to small to fit in my lap top, so i had to buy a sony USB plug so i dont have to connect the camero to the lap top all the time.And you still want to get this camera you HAVE to get sony memory card because other brand wont fit in the slot!!!! So now i cant have the same memory card that i was using for the casio in this one!So im not to happy! If you buy this camera you have to buy 2 more thing to make it all work!", "Date": "March 19, 2010"}, {"Title": "GOOD CAMERA,BUT...", "Author": "J.R \"GEIMES\"", "ReviewID": "R3E6ISZYXOGP14", "Overall": "2.0", "Content": "CAMERA IS FINE....TAKE GOOD PICTURES..BUT THE VIDEO IS NOT CLEAR AT ALL....WHEN YOU USE THE ZOOM...IT IS TERRIBLE", "Date": "January 27, 2010"}, {"Title": "Breaks easily", "Author": "Keith", "ReviewID": "R308I8DRTDHZ0", "Overall": "2.0", "Content": "I dropped the camera from about 3-4 feet to the ground and it won't work. I can toss my cell phone across the room and it would still work. They need to make these more study becuase dropping them does happen. I loved it for the month that it worked however.I decided not to buy another Cannon camera because it broke after 3 years and now my Sony broke after one month.  I think I will go back to the Cannon.", "Date": "October 9, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001R4QM8W"}}