{"Reviews": [{"Title": "very user friendly-takes great photos", "Author": "L. Guidotti \"paintinlady\"", "ReviewID": "R21I68YAT88G2Q", "Overall": "4.0", "Content": "I bought this camera for my husband who hates having to read pages of instuctions. He found the camera very easy to use, needed to refer to the manual for certain features and found those easy to understand-HE LOVES THIS CAMERA!!!", "Date": "July 20, 2008"}, {"Title": "Happy", "Author": "C. Huggins", "ReviewID": "R3SSQ252SODBT0", "Overall": "5.0", "Content": "With me being a very picky person when it comes to camera's, I have to say that I was very impressed with the Sony S750. I've taken pictures indoors and outdoors and have been very pleased with the outcome. I was also impressed after I downloaded the images on my computer. I like that it's small and affordable. I would recommend anyone to purchase it.", "Date": "May 15, 2008"}, {"Title": "Great camera for its price", "Author": "Anonymous", "ReviewID": "RGI0XQL44JBNH", "Overall": "5.0", "Content": "I got this camera recently and must say that its a very nice camera for its price. The pictures are very clear and the camera has a very sleak design.  The one thing I don't like is the fact that it takes only memory sticks (which are expensive), but then thats something common to all sony cameras. All in all I love this camera.", "Date": "September 11, 2008"}, {"Title": "Really good camera for the price you pay", "Author": "Leandro Pablo Casiraghi", "ReviewID": "R3TKDNQHFU56QS", "Overall": "4.0", "Content": "This is a great camera by Sony, inside the price range you can get it. The photos are beautiful, with great definition and colors. It's not as slow as Sony cameras are heard to be considered, even when it's not light-fast.the only problems I see on it is that the LCD display, even when it's big and have good resolution, has a problem showing the real colors and brightness of the image, you it will take you a good time to learn how your real picture will look based on the one on the LCD. I have been taking pictures with all of the options of the camera and I still couldn't learn which one to choose. the other problem is that it's really hard to focus on close objects, even faces or solid objects.But, for the money you pay for this camera, it's overall an excellent camera.", "Date": "November 11, 2008"}, {"Title": "So far, so good...", "Author": "Kathy D. Sterrett", "ReviewID": "RVVDXIKD6OBKR", "Overall": "5.0", "Content": "Well I purchased this camera a couple of days ago and really enjoy it so far. It is very compact (nice to carry in pocket) and has a 'sleek' design. The pictures look fantastic and the different modes make it easy to get the perfect picture. On the other hand, my camera's lense makes a strange noise upon opening (maybe they all do that). Also, most normal SD memory cards are not compatible- meaning I had to get a new memory card. Other than that this camera is a great pick- I recommend it.", "Date": "August 14, 2008"}, {"Title": "Not good colors with flash.", "Author": "NewYorkx", "ReviewID": "R3J78SVVDM2M66", "Overall": "3.0", "Content": "I'm not really happy with this camera when it comes to colors when using flash. I worked before with P200 and colors were always vivid, here you can't really choose white balance and it makes colors far too white, even in P mode. Nice green shirt looks gray etc. If you need something with true colors I wouldn't recommend this camera. I'm going to return it and buy better model.", "Date": "September 19, 2008"}, {"Title": "Sony Cybershot", "Author": "Sonja L. Lutz \"English Teacher\"", "ReviewID": "R3BOEKZHTWKG2", "Overall": "4.0", "Content": "Sony Cybershot is a good little camera for the price.  One can take pictures in color, sepia, or black and white.  The camera also has video capabilities.  I bought the last two Cybershots as gifts for my grandchildren.  It's an affordable camera to give pre-teens a real camera experience.  The only thing I've found wrong with the one I own is that the battery latch isn't secure.  It pops open easily, and the camera turns off in the middle of a shot.  Otherwise, I've been pleased enough with the pictures that I have chosen this camera for my grandchildren.", "Date": "December 21, 2008"}, {"Title": "AMAZING!", "Author": "Kerianne M. Roehl", "ReviewID": "REJ03JJIGFVHV", "Overall": "5.0", "Content": "This is an amazing little camera. I recently purchased it and it takes GREAT pictures and can take pictures in pretty much any light. I HIGHLY recommend this camera to anyone who reads this. Definatly worth the money.", "Date": "May 14, 2008"}, {"Title": "Great little camera--though I could wish for more zoom.", "Author": "Sheri in Reho", "ReviewID": "R20IX9SCT0LRLD", "Overall": "4.0", "Content": "A few months ago, I decided that since I regularly take digital pictures and upload them to my Flickr site ([...] it was about time to upgrade to a better camera.  The economy being what it was, I decided that I didn't want to blow a HUGE wad o' cash--just enough to get a good quality camera that had higher megapixels than what I already had (a Casio QV-R40 with 4.0 megapixels).A Flickr friend had just bought herself a Sony Cybershot and liked it a lot, so I set about doing some research.  As it turned out, Amazon.com had this particular Cybershot model on sale at the time I was looking, so I got a great deal as well as a great camera.The Sony Cybershot S750 features 7.2 megapixels, a 2.5\" LCD monitor, ISO 1250 (high sensitivity) and a 3X optical zoom.  In hindsight, I wish I had gone up a notch to a higher zoom but, all in all, I have been very happy with the camera.  It was tremendously easy to learn to use.  I am not a big fan of \"reading the blanking manual,\" so having something that is easy to use right out of the box was a bonus.It has a very quick & easy wheel that allows you to switch between different types of shots quickly.  The options are the standard auto adjustment setting for photos, a program auto setting (which I haven't tried yet), a movie setting, a snow setting for taking pictures in a bright white landscape, a waterside setting for beach and other water shots, a twilight setting for shooting in low light w/o flash, a twilight portait setting, a landscape setting, a soft background setting and a blur-reducing low-light setting.The battery supposedly would allow you to take about 280 shots on one battery charge, which is pretty darned great compared to my older camera.  However, it won't take much without an additional memory card (for an additional cost, of course).  I got the Sony Memory Stick Pro Duo with 8gb of memory and that has worked very well.", "Date": "April 10, 2009"}, {"Title": "Hector J", "Author": "Hector J \"Hector\"", "ReviewID": "R1KOJ8DNEYRZUS", "Overall": "5.0", "Content": "This item is a great purchase , it gives you some option to get pictures in any whether as well as videos from all that you want and love.", "Date": "June 13, 2008"}, {"Title": "Excellent Point & Click Camera For The Average Family", "Author": "J. Ratliff", "ReviewID": "R1WHJOTO4VUFN2", "Overall": "5.0", "Content": "The Sony DSC-S750 offers a lot of camera for the money. The unit is very simple to use, and comes with a rechargeable battery, which is a great thing. If you've ever used a regular battery in a digital camera, you know how fast they go. Since the battery is rechargeable, you won't be spending a ton of money on those \"Photo\" batteries either! This camera offers multiple quick set modes for taking pictures in the most common environments, so you don't need to be a techie to choose the right settings. While the camera is easy to use, it does offer some more in depth features for those folks who want to tweak their photos or just want to play with the advanced settings. With a large screen for viewing your pictures, you will be able to check them immediately to make sure you got the shot you wanted. The removable memory stick makes getting pictures printed at a local store easier than ever. Just pop out the memory stick and take it with you!The Sony DSC-S750 has been my favorite camera for a year now. I don't take a ton of pictures, and I'm not a professional, but the pictures turn out great, and the camera is easy to use.", "Date": "August 10, 2009"}, {"Title": "Small, light & easy-to-use camera that takes great photos!", "Author": "K. Harper \"kmharper\"", "ReviewID": "R10ZCI1PVCXYV", "Overall": "5.0", "Content": "I received this camera for my birthday since my other Sony lost it's flash.  I was hesitant about another Sony but am really happy with the camera.  I am by no means a professional, but I do take about 50 photos a month for fun.  This camera is very light weight, very small and has a very short first shot delay, which is so nice!  The flash is good and the rechargeable battery is nice, esp if you have ever used one that takes AA batteries.  Battery is easy to charge and does so fast.  It takes about 5 min to figure out how to take your first shot, then it's fun & easy to learn the other details!I love the timer, the movie function and the large screen display.Overall, a great little camera with all the functionality you would need if you are not a professional.", "Date": "February 11, 2009"}, {"Title": "Perfect for a basic digital camera.", "Author": "Paul Moser", "ReviewID": "R2UWAFBIG2OTSG", "Overall": "5.0", "Content": "This camera doesn't disappoint for a simple, compact digital camera. It has the ability to take 7MP size pictures, but if you're only ever going to view them from a computer and print 5\"x7\", you'll only need to shoot at 3MP, which then gives you even more storage capacity. I recommend investing in a 2GB memory card for this device.", "Date": "February 10, 2009"}, {"Title": "Nice for the price", "Author": "Thomas M. Key", "ReviewID": "RDV4VJB17DVU0", "Overall": "4.0", "Content": "Very vice camera with 7.2MP for the price was good. Viewfinder difficult to see in some light situations.", "Date": "February 4, 2009"}, {"Title": "Excellent value", "Author": "H. W. Richardson \"Korban\"", "ReviewID": "R1QPZ9OEWQTGA1", "Overall": "5.0", "Content": "The camera was received quickly after ordering and is a solidly built and compact camera.  Very good value for the price.", "Date": "January 31, 2009"}, {"Title": "great camera", "Author": "Kateri L. Hilton", "ReviewID": "R2AEYJ9ZQLWAKO", "Overall": "5.0", "Content": "This is a great camera. It takes great pictures. It is a true and true point and shoot camera. It is simple to use, which is great for those of us who are not professionals, but has great functions that were easy enough to understand when I wanted to take more advanced pictures. The video function is great too.I like the lithium ion battery because it lasts a lot longer (just remember to charge it before special occasions). I bought a camera that ran on AA batteries and got tired of them always dying out so quickly.The shutter speed is also great. I bought this for a friend of mine who just had her first baby and she hasn't missed a smile.I have a Sony Cybershot with 6 MP that has lasted me 4 years and is still taking great pictures, so I know this 7.2 will last for years to come.The Sony Cybershot is a great camera for a great price, so I definitely recommend it.", "Date": "January 19, 2009"}, {"Title": "Sony Camera", "Author": "Amazon Customer", "ReviewID": "R2IMHWHZWFVW2X", "Overall": "5.0", "Content": "Love this camera.  Would highly recommend it!  It's easy to use, requires very little previous knowledge of digital cameras.  Heads up however, you will have to purchase memory card separate.", "Date": "January 1, 2009"}, {"Title": "dark smudge spots in blue skies", "Author": "hnaz", "ReviewID": "R2R0SA0R6F7WRP", "Overall": "2.0", "Content": "I purchased this DSC-S750 in May 2008, after the previous Sony I had (DSC-W5)died after being dropped. I had had the W5 for 3 years with no problems. This camera however, developed a very nuisance problem after only 9 months. In some exposures, mostly in pics that had large expanses of bright blue sky, but not exclusively, large dark spots would mar the picture. In one pic the spots would be there, and in the next, in a slightly different exposure they wouldn't be. As it was still under warranty, I took it in for repair.  I got it back with a note saying that it had been a problem with the optics and it was fixed. Two months later similar spots were back. I didn't have the time to take it in for repairs and be without a camera for several weeks at that time, so I lived with the spots for a few months, doing a workaround of not putting so much sky in the pics (I lived in gorgeous big sky country so I liked to take landscapes with lots of sky pics). I finally took it in for repairs again (thankfully I had purchased the extended warranty my retailer was offering)and when it came back (with a note saying they had replaced the \"switchboard\"), it was free of the spots for probably less than a month. I am hoping that when I take it in this time that they will just call it a lemon and replace the stupid thing.  The other annoying thing about this camera is its lack of ability to get colors on the blue end of the spectrum correct.  When I've tried to take pictures of dark purple iris flowers and other dark purple flowers, the flowers always come out very blue. Then for at least the last several months, nearly every picture has too much blue in it, so I'm glad my basic photo software has color correction as a Fix. I have to use it on every picture to take the blue cast out. In addition, recently the auto lens cover has been sticking halfway shut. On the plus side, the camera has only very minor trouble with auto focus, does a lovely macro shot, and can handle a very bright snowy day or a dark interior room exposure pretty well.  So while I was initally satisfied with the camera, it went downhill at 9 months and has just gotten worse with the blue color cast and the sticking lens cover at less than 2 years. I find that unacceptable.", "Date": "July 4, 2010"}, {"Title": "Good little \"back-up\" camera", "Author": "M. Blackwell", "ReviewID": "R1RFSDJ5BNOUY9", "Overall": "4.0", "Content": "Not long ago, my trusty \"old faithful\" Canon stopped working and I began to shop around for a new camera.  The newer models don't have some of the nice features that \"old faithful\" had, and so I was frustrated...  could I do without a viewfinder?  Besides, I knew the controls of \"old faithful\", and didn't want to have to go through the learning curve again.  Then, miraculously, I learned that the issue my camera was experiencing was covered by Canon - for free - even though it was long out of warranty.  So, I sent it off, and was told promptly that it was indeed going to be fixed.Sorry...  that's a long lead-up to my view on this Sony.  I had a couple of events that I didn't want to attend without a camera, and so when I spotted this Sony on sale recently, I snapped it up as a \"back-up\" camera, to use while my other camera was being repaired, and to have for those occasions when I really didn't want a larger camera, or when there was any chance the camera might be at risk (bike riding, for example).  I got the camera home (with the 2G card I had purchased), and was delighted to see that the controls were very similar to those on the Canon.  The learning curve was very short.  I love the large LCD screen (good thing, since there is no viewfinder), and although there aren't as many shooting modes as I have had on the Canon, these are certainly sufficient for a casual photo shooter!  Even better...  when you set a mode, the LCD shows you the selection you have made (nice for those whose eyesight isn't what it used to be).  And there are some new features that \"old faithful\" didn't have...  stabilization, face recognition, etc.  I found the close-up feature to be more difficult that \"old faithful\" because it had a shorter range of focus, and was more sensitive to movement (which, in a tiny camera, is always an issue).  I noticed the problems others have commented on regarding flash-outs, white, colors, etc., and after playing with the camera I can say that these problems can be overcome - you just have to know your camera better.So...  long story short is that I think this is an excellent little camera for a \"back-up\"!!  In fact, there may be times I'll reach for this instead of \"old faithful\" (which has been returned to me in perfect condition!!).  If you're a first-time digital camera user, this is a good choice...  you'll learn lots as you use it and review the manual periodically.  It's at a price-point that makes it a great gift for graduates or special birthdays or other celebrations, and it fits in your pocket...  easily.", "Date": "August 11, 2009"}, {"Title": "Sony DSC-S750 7.2MP", "Author": "Ronald S. Buda", "ReviewID": "R2GPVIPUQTJYG3", "Overall": "5.0", "Content": "This is an older model,but still takes great pics. It has a re-chargeable battery pack that seems to last longer than the re-chargeable AA NIMH's used on the DSC-S650. Also it doesn't come falling out when the door is open.2-Gig memory card stores over 10K pics on J-peg for E-mail. Saved $$ by purchasing an open box. Looks & performs as new. Has features I'll never use,but just point & click & your done. I'd recommend this to anyone looking for a digital camera except(yawn)a snobby/nerdy Tech geek which could spot flea poop in black pepper. They'll have to spend more $$$ to be satisfied.", "Date": "June 12, 2009"}, {"Title": "great!!", "Author": "A. Wallace", "ReviewID": "RL7JAQ16LB1ZW", "Overall": "5.0", "Content": "great product, im having a lot of fun with this. looks great, works great, takes excellent pictures, who could ask for more with such a low price.", "Date": "May 12, 2009"}, {"Title": "great camera", "Author": "David", "ReviewID": "RSZG1QK85SA2C", "Overall": "4.0", "Content": "i carry it with me every where i go. great compact, battery effecient, and easy to operate digital camera.", "Date": "March 8, 2009"}, {"Title": "Camara regular", "Author": "Juan C. Otamendi \"cota1000\"", "ReviewID": "R3VRE992GMJPI5", "Overall": "3.0", "Content": "Cámara con estándar normal, no es gran cosa, pero te saca la pata del barro. Consume mucha batería, y Sony debería usar tarjetas de memorias mas económicas como la SD. Compacta y liviana. Buena para los pocos exigentes, bueno por el precio no se debe esperar mucho aunque hay unas un poco mejores por menor precio.", "Date": "February 24, 2009"}, {"Title": "As expected", "Author": "Sasha Gottesman", "ReviewID": "R1HXEFCZ9GTKQ2", "Overall": "4.0", "Content": "I did a lot of research before buying this camera. I think it is a great camera for the price I paid (less than a hundred bucks) however you have to familiarize yourself with the settings to get the best pictures out of it. The one with the Carl Zeiss lens takes better pics, but it costs quite a bit more. I like my camera and it looks great too. Memory sticks are coming down in price too so it was not really an issue to have to use them. One complaint is that it does not have a real viewfinder for taking pics in low light (it seems to be deemed obsolete by most camera manufacturers, but I miss it).", "Date": "January 21, 2009"}, {"Title": "Great camera for the price", "Author": "S. Jones \"stargazer_ja\"", "ReviewID": "R1XXC12PZM9VCQ", "Overall": "4.0", "Content": "I gave this camera to my daughter for Christmas and she has been clicking her way to nirvana.  I live in Jamaica, and getting the sony card was a little challenging, but we managed to find that for the additional storage. Also unfortunately that memory stick does not fit in my card reader.  Other than that, the camera has been great so far.  Perfect for a budding point-and-click photographer.", "Date": "January 20, 2009"}, {"Title": "Good Camera", "Author": "A. Ibeagha \"Soccer dude\"", "ReviewID": "R29UN4MH1WE93I", "Overall": "3.0", "Content": "This is a very good camera for a gift. My issue with it is that it does not come with the memory stick and the memory stick for this camera is a special one.The pictures are great and the camera is easy to use.Thanks.", "Date": "January 14, 2009"}, {"Title": "AWFUL!", "Author": "K. Guerin", "ReviewID": "R2VM06MWXUR7R4", "Overall": "1.0", "Content": "This camera is the worst camera I've ever owned. I had the camera for about 2 months, and the USB part of the camera broke. I sent it in for repair (per Sony), and it came back to me still broken. Sony was VERY unhelpful and didn't even seem to care about my broken camera. I will never buy another Sony camera. This camera does take good pictures, but if you're looking to download the pictures onto your computer then I would suggest finding a better camera! Buyer Beware!!!!", "Date": "January 5, 2009"}, {"Title": "Excellent product", "Author": "Nelson Zambrano", "ReviewID": "R1I3FNXUF5XQLE", "Overall": "5.0", "Content": "A great camera, just what you expected from what you can see in the pictures, worth the money for the good quality", "Date": "December 17, 2013"}, {"Title": "Beware", "Author": "jim", "ReviewID": "RYJWWG88DVLSQ", "Overall": "4.0", "Content": "Had no battery bought one had to get another one +a charger and a reader total 78.00 for a 15.00 camera but it’s better than my first one I like it despite the headaches", "Date": "August 2, 2013"}, {"Title": "sorry", "Author": "dennis white", "ReviewID": "R3HSDFG60PKE3X", "Overall": "1.0", "Content": "Perhaps my fault,??!!!  the camera does not work properly, it does not focus, blurry pics and the lens does not always retract,..this was not noted in the sale, I should of bought new, I guess,..dont always believe what you read", "Date": "January 8, 2013"}, {"Title": "First Digital Camera purchased and I absolutely love it!!!", "Author": "N. Christensen", "ReviewID": "R1C4PEJ573RIT8", "Overall": "5.0", "Content": "I bought this camera back in 2007 or 2008 as I was finally ready to go \"digital\" andI am very happy with this purchase.  This little camera takes excellent pictures, thebattery lasts a long time, and I am still using the original OEM battery.As someone mentioned, the instruction manual was easy to read...user friendly and Ihave found that even those that think they cannot take a good picture will be surprisedwith this camera.  It even takes good quality videos. While it not a top of the lineprofessional camera or video recorder, it more than serves the purpose. I love lowI can upload pictures with the usb and camera hooked up and my pictures load in secondsfor the most part.  Purchase price when I bought it was just under $100. Probably theBEST $100 I have ever spent on an electronic item.  Great camera for a beginner!", "Date": "August 2, 2012"}, {"Title": "love the new camera", "Author": "M. Graziano", "ReviewID": "R1Y4UJFPUUV7CY", "Overall": "5.0", "Content": "I couldn't be  happier with this camera. It does everything it claims and it takes great pictures.", "Date": "January 28, 2009"}, {"Title": "Good, cheap camera.  But don't drop it!", "Author": "Jason Signalness", "ReviewID": "R8LUG30CHKDX8", "Overall": "3.0", "Content": "I used this camera for almost a year and I liked it very much considering the price.  My one big complaint, however, is poor construction.  I dropped it once, from about 2.5 feet, and it never worked again.  To have it fixed by Sony costs almost as much as a brand new camera.  So, in short, it is a decent camera, but it is not sturdy and is definitely \"throw-away\" if it's damaged at all.", "Date": "November 2, 2009"}, {"Title": "Great item", "Author": "Anjana J. Patel", "ReviewID": "R3DL8ER2ST8X5T", "Overall": "5.0", "Content": "I am happy with my purchase of Sony Cyber shot . I am enjoying it.", "Date": "February 18, 2009"}, {"Title": "Not as good as I thought.", "Author": "Blake Owens", "ReviewID": "R1UFTKONJEI9S7", "Overall": "2.0", "Content": "I initially liked this camera when I bought it, but the longer I have it, the more things I don't like.  The construction has this cheap-feeling plastic around it and you need to have a very steady hand to take a clear picture.  The shutter speed is also way too long.", "Date": "January 31, 2009"}, {"Title": "Sony cyber-shot DSCS750", "Author": "M. Burke", "ReviewID": "R26W6B8HHYHSP2", "Overall": "5.0", "Content": "The item came on time, and was exactly what was expected. It was a gift and the recipient was delighted to receive it.", "Date": "January 30, 2009"}, {"Title": "Good camera", "Author": "E. Albino", "ReviewID": "R2V22HTHOS0IJI", "Overall": "4.0", "Content": "This camera it is good, it have a large lcd screem to see your pictures, and the pictures are made with good quality.", "Date": "September 8, 2008"}, {"Title": "Good Value", "Author": "C. Ortiz", "ReviewID": "R3IQLIZTGWLK4V", "Overall": "4.0", "Content": "Nice camera for the price.  Easy fit in purse or pocket to always have handy.", "Date": "February 15, 2009"}, {"Title": "A lot for a little", "Author": "Sharon Schultz \"sharwils\"", "ReviewID": "R3G111BN3WNPTC", "Overall": "4.0", "Content": "This is a pretty good camera to have in your pocket or purse. I have a Fuji S7000 and a Sony H2 and they are to big to haul around on short trips into town and errands. This is perfect for that. It provides a good quality photo for a small price. Very nice compact camera", "Date": "January 25, 2009"}, {"Title": "great camera", "Author": "W. Mosby", "ReviewID": "RCVECZAT2Z08D", "Overall": "5.0", "Content": "I replaced a 4.2MP with this one. It is just what I wanted. I also got a 4GB memory stick for $12.The pics are great & I can choose the resolution I want. Since I don't print at 11x17, I save space on the picture files.", "Date": "January 25, 2009"}, {"Title": "Sony Cyber-shot DSCS750 7.2 MP Digital Camera with 3x Optical Zoom", "Author": "Charles Smith \"drgntudo\"", "ReviewID": "RNXWQ5XHEP2RQ", "Overall": "4.0", "Content": "Excellent with only one imperfection the battery.  I am not sure yet but when the battery needs recharged, must be removed from camera and placed in a charger.  I purchased the optional power pack hoping that as the battery needs charging that I can power the camera with AC and this will recharge battery.  Like I said I have not had item long enuf to see.  Other than that I am satisfied with this purchase.", "Date": "January 16, 2009"}, {"Title": "Awsome Camera!", "Author": "Jim McGiveron  http://nosmokejim.blogspot.com...", "ReviewID": "RTQJTYRXQFI6G", "Overall": "5.0", "Content": "Sony has been around for a long time,and they have a great reputation,allmy stereo components are Sony.This Sony camera is compact,lightweight,and takes great photos.Great zoom,much better than most cameras,the overall performance is awsome!", "Date": "November 4, 2008"}, {"Title": "Broke really easily", "Author": "Bunnee", "ReviewID": "R1F6FT6YGZ83B8", "Overall": "1.0", "Content": "This worked great until we downloaded the first set of pictures. As soon as the pics finished being put on the computer, the camera never worked again.", "Date": "January 7, 2009"}, {"Title": "Sony got greedy", "Author": "Catherine Crozier \"CatDiver\"", "ReviewID": "R3QP3P3JIOFC76", "Overall": "2.0", "Content": "I recently bought this new Cyber Shot camera to replace my old one which is about 4 yrs old, and for which I had invested about $100 on memory sticks.  The new one arrived just in time for my trip to visit my sister.  After taking only a few pictures the camera ran out of memory.  Then I discovered my memory cards would not fit into the new camera.  Shame on Sony for trying to force those of us who want to stay with Cyber Shot cameras to have to buy new memory sticks.  I returned the camera and will look for something besides Sony.", "Date": "February 8, 2009"}, {"Title": "Not a very good camera", "Author": "M. Fettig", "ReviewID": "R38R7XV14MFMPB", "Overall": "2.0", "Content": "I received this camera for Christmas and I have to say...Both my LG Chocolate and my wife's LG Voyager cell phones take better pictures.  Indoors, outdoors, close, distant, all the pictures were pretty bad.  I found someone to buy it on that other resale site.  I'm looking to buy a Canon.", "Date": "May 3, 2009"}, {"Title": "OK Camera, but cannot email pics", "Author": "Gene Basler", "ReviewID": "R1INUQVIC0JZQV", "Overall": "3.0", "Content": "If anybody can tell me how to scale down the picture quality so that every photo I take can be easily emailed, I would be delighted to learn it! I take lots of pictures for work, and I just assumed when I bought it that  I'd be able to set the default image quality, like every other camera I've owned.  Anyway, technically not a review, but that drawback makes it virtually useless for my purposes.  Nowadays, even for recreational use, everybody I know wants to be able to email his or her pics, and printing them is not so important.  So 7.1 megapixels are great when you need them, but...", "Date": "February 9, 2009"}, {"Title": "disappointed", "Author": "Sharon M. Goettel", "ReviewID": "R1B8EZ5A91I8OM", "Overall": "3.0", "Content": "The camera functions fine, however, I thought this was a newer model.  I had just purchased the newer model for my son at the same price, but could not find it available in the stores for my daughter.  I thought this was the same thing.  It's not and she knows.  Very disappointing.", "Date": "February 22, 2009"}, {"Title": "Good", "Author": "Rajamanim Krishnamoorthy \"Raj\"", "ReviewID": "R1WIK0IWKQXD9E", "Overall": "4.0", "Content": "So far so good.Buyer is lighting fast. Received the item within 24 hours", "Date": "December 14, 2008"}, {"Title": "BUYER BEWARE", "Author": "C. Hamer", "ReviewID": "R1W1MTFXXSXV4C", "Overall": "1.0", "Content": "IF YOU BUY A SONY CAMERA, YOU ARE STUPID.  SONY MIGHT BE OKAY WITH SOME THINGS, BUT THEY DO NOT KNOW HOW TO MAKE CAMERAS.  IF YOU ARE GOING TO BUY A CAMERA, GET A CANON.  NIKON IS OKAY, TOO, AND SO IS KODAK, BUT FOR THE LOVE OF GOD DO NOT BUY A SONY CAMERA.First:  The batteries are proprietary, which means you will be paying 40 dollars for each battery.Second:  You'll get a replacement battery, and your camera will tell you that it is \"for use with compatible batteries only,\" then it will turn off.  Then when you turn it on it will do the same thing.Third:  Sony batteries suck.4th:  Sony software sucks.5th:  The photos are not good.SONY = HEARTACHE - DO NOT BUY SONY CAMERAS BECAUSE YOU WILL REGRET IT!!!!!!!!!!!", "Date": "May 19, 2010"}], "ProductInfo": {"Price": "$183.73", "Features": "7.2-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints\n3x optical zoom; 2.5-inch LCD display\nFace Detection; Smart Zoom feature\nHigh Sensitivity (ISO 1250) mode\n22 MB internal memory; capture images to Memory Stick Duo/Pro Duo media", "Name": "Sony Cyber-shot DSCS750 7.2 MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51ITD8qantL._SX300_.jpg", "ProductID": "B0011E67AG"}}