{"Reviews": [{"Title": "Fabulous Quality; Im so satisfied!", "Author": "Courtney N. Prince", "ReviewID": "R3DTCJ1AK02Z6", "Overall": "5.0", "Content": "I was very pleased with the condition of the product and gadgets it came with. It is all new and so worth the money I spent to buy it. If you're looking for a camera for first time use or just for fun...you'll enjoy this product. I'm completely satisfied with my purchase and I recommend this over and over. Thank you!!!!!", "Date": "January 27, 2010"}, {"Title": "Absolutely Amazing Deal for all you get!!! Will Definately Buy From Amazon again!!!!", "Author": "B Martin", "ReviewID": "RW8THZDES823F", "Overall": "5.0", "Content": "I was kind of skeptical at first but when my shipment arrived & it was everything pictured & so much more I was sooo pleased & could'nt wait to try it out. I love it it does the job & so much more, and the quality is outstanding & what you expect from Nikon. Whether you're and amature or professional this product will be perfect!!!! I will definately buy from amazon again their deals are amazing & the best around!!!!", "Date": "December 28, 2009"}, {"Title": "The best purchase I've ever made", "Author": "Leon", "ReviewID": "RQTZPF1IE92PI", "Overall": "5.0", "Content": "My Nikon d3000 camera kit is one of the best purchases I have ever made.The camera is without a doubt a winner. It's easy to use, lightweight, the images are brillent, the user manualis user friendly (with many tips for picture taking) and the items in the kit are just what I need to start my new hobby.I give this item a full 5 stars.", "Date": "August 4, 2010"}, {"Title": "Great Buy!", "Author": "Jennifer Eckman", "ReviewID": "R26C32URRDIGHL", "Overall": "5.0", "Content": "I am very impressed with my purchase! I had found this same camera for the same price, but without the tripod and all the extras. Buying it from this seller saved me easily over $100.00. This camera has a really nice mode that makes it very simple to take pictures with it if you are new to Digital SLRs. It is a great starter camera! I was slightly disappointed that I couldn't see the image on the screen before I took the picture, but to have that I would have to give up some of the great qualities that made me love this camera! It was received in the time stated and it was lots of fun to have the tracking code for it to see where it was and when it wound get to me.Definitely a great buy!", "Date": "February 20, 2010"}, {"Title": "great camera", "Author": "D. Bernardino \"cloud mix\"", "ReviewID": "R1KD6WQONCZCUC", "Overall": "5.0", "Content": "i love this camera it makes me feel professional although it's just a hobbytography for my facebook....buy one!", "Date": "May 19, 2010"}, {"Title": "Amazing deal!", "Author": "Shannon Pemrick", "ReviewID": "R3ARQFFY3B7K6R", "Overall": "5.0", "Content": "I'm really glad I purchased this bundle. At school we worked with the Nikon D60's and since they're no longer being produced I set out to look for a near direct replacement. The D3000 is it. It has all the features I was used to but it also showed that it was upgraded from the older D60 models.After for the rest of the bundle it's a nice starter kit. The reader and 8 gig memory card you get with it is really nice and handy and it's great to have the caring case and tripod all ready to go once the batter for the camera is charge. The only, minor, complaint I have are the tripod and caring case. The tripod is small and a bit flimsy. Looking at the photo provided I had thought it'd be a bit sturdier but it works and I can always upgrade later. As for the bag, it's a bit smaller than I had expected. It works well to start off, but I'll definitely be getting another one.", "Date": "October 19, 2013"}, {"Title": "camera", "Author": "speedygon", "ReviewID": "RDSWP4A1Y2MZN", "Overall": "5.0", "Content": "i have taken alot of phote and they come out great had to learn how to use it. worth the money", "Date": "June 7, 2013"}, {"Title": "Nikon D3000 Camera & Accessory Kit", "Author": "M. Flowers", "ReviewID": "RQ6LNUUAD241", "Overall": "4.0", "Content": "I am very pleased with my camera and accessory kit - it was all that it said it would be; easy to use and I got more bang for my buck than a retail store", "Date": "August 21, 2012"}, {"Title": "Love the camera & accessories!!!", "Author": "B. MADDIE \"maddi\"", "ReviewID": "R1PAT08O7MQTLT", "Overall": "5.0", "Content": "I absolutely LOVE this camera and all the accessories I got with this set. I got it at a very good price, it was packaged well and it was delivered quickly. I'm very happy with it!", "Date": "September 2, 2011"}, {"Title": "DSLR for Beginners", "Author": "Jace Little", "ReviewID": "R3RTVJXJC5HQZN", "Overall": "4.0", "Content": "Like photography? Scared to try a DSLR camera? This is a very basic but efficient DSLR. This is a good starting DSLR. It will seem daunting at first but in no time you will be snapping very good pictures. Although many cameras have more megapixel, these the 10 on the Nikon D3000 will print to atleast 11 x 17. If you are only printing 4 x 6 or 8 x 10 you won't notice the difference. Or if you are just viewing them online, its not worth the extra money. Great camera, good price. SOLD!", "Date": "July 7, 2011"}, {"Title": "She loves it", "Author": "EM", "ReviewID": "R9MQHHFEF0HA9", "Overall": "5.0", "Content": "My daughter is using this camera and she simply loves it. She is 14 years, says it's easy to use and makes great pictures.", "Date": "March 4, 2010"}], "ProductInfo": {"Price": "$699.99", "Features": "Nikon D3000 10MP Digital SLR Camera - Body (Includes manufacturer's supplied accessories)\nNikon 18-55mm f/3.5-5.6G AF-S DX VR Nikkor Zoom Lens - 5pc Deluxe Lens Care & Cleaning Kit\n8 Gigabyte SD Secure Digital Memory Card - Secure Digital USB Card Reader - Universal Memory Card Wallet - Pack of LCD Screen Protectors\nWell Padded Multi Compartment Gadget Bag with Pockets & Strap - Additional EN-EL9 Reachargeable Lithium ion Replacement Battery\nFull Size 59\" Tripod W/Case - Jumpstart DVD Guide to Digital SLR Cameras", "Name": "Nikon D3000 10.2MP Digital SLR Camera with 18-55mm f/3.5-5.6G AF-S DX VR Nikkor Zoom Lens + 8GB DLX Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/516-oowDjHL._SY300_.jpg", "ProductID": "B002NRSMYY"}}