{"Reviews": [{"Title": "Excellent entry level DSLR", "Author": "J. Kim \"James\"", "ReviewID": "R395F26T9I8N84", "Overall": "5.0", "Content": "I received this camera last Friday. I had 2 full days to take great shots with this camera. I purchased two bundle kit, which comes with 18-55mm lens as well as 50-200mm lens. I have another manual focus lens, which is A50.7.One of the most asked questions about this camera is AF speed. Yes, AF is pretty quick. To test AF speed, I sometimes turn focus ring to opposite direction and checked the time it takes to set the focus. It was usually less than 0.4s. Even in low light situation, it worked fine. I took many shots with only one small table light in the living room so, ISO was 6400 and shutter speed was 1/4. Camera doesn't seem to have any problem for AF. Nice thing as a entry level camera is that it supports up to 11 AF point and you can choose your AF point. Some may say, it lacks super impose. However, simply touching 'ok' button reveals current AF point in the LCD screen. So, that's not a problem. AF is sharp and accurate. In MF mode, camera indicates the right focus in two ways both sound and indicator. So, there's no problem using manual focus lens. in Liveview mode, Camera magnifies focus point to assist you, which is very useful since viewfinder is very small.High ISO support. This is the best part I like about this camera. It supports up to 6400, and can be expanded to 12800. I took several shots outside around 6:00 PM. My friends used flash but my K-x didn't require flash. with 3200 or 6400 ISO, it still gave me clean bright pictures. Pentax did a great job reducing noise, especially color noise. It's hard to find the noise from the pictures. Now, 3200 is something you can use everyday. Actually, scene mode for the kids uses very high ISO to get 1/1000s or faster shutter speed. Thanks to that, pictures for my kids are all sharp and crispy.User interface is very intuitive and simple. Since this camera is small, most of the buttons are within reach of your thumb and index fingers. Though it's small, grip is ergonomically designed so that camera is very stable in your hand. It has one auxiliary button (green button), which you can assign other functions. It has drive mode, ISO, White balance, aperture and flash buttons. It also has dial to navigate menu faster.It uses 4 AA batteries and this is really nice. You can use your Ni-MH batteries or Lithium-ION batteries. It your camera is run out of juice, you can go nearby stores and buy one quickly. I took about 250 shots and I didn't need to recharge yet. Camera recognizes battery type automatically and optimizes the operation.with all the bells and whistles, I think Pentax K-x is super buy for the beginners. Not only it has all the features needed, it outperforms higher grade DSLRs in certain area like low noise. Thanks to great compatibility for the mount, even 30 years old lens can be used for this fresh new DSLR. It was quite fun to look at postings to sell old, student film camera kit at bargain price and you can use lens out of it. I also got 50mm fast lens which is excellent to take portrait shot from used market.A few updates.1. Some folks reported battery compatibility issue. Below is the blog of Pentax USA President. He recommended user to put batteries and wait for a few seconds so that Camera recognizes the type of batteries.[...]2. It also reveals a few problems related to Shake reduction. First, it produces noise from magnet handling CMOS censor. Bad thing is, this noise is recorded in movie mode. K-7 also has same issue but it supports external microphone. K-x doesn't allow that so, this can be one issue.3. It also shows color overflow problem under low light situation, especially red and blue. When there's bright light, for example traffic signal, red color or blue color spread around as if it overflows.A few users reported above problems to Pentax R&D; and they are supposed to return by 11/9. I hope firmware upgrade will fix those problems.", "Date": "October 26, 2009"}, {"Title": "Little Wonder", "Author": "Enche Tjin", "ReviewID": "R1OLYR6NW12DBV", "Overall": "5.0", "Content": "Pentax Kx is Pentax digital SLR for beginner and enthusiast. Pentax Kx replaces Pentax KM / K2000. There are many improvements from KM, such as three stops higher ISO setting, video recording, faster continuous shooting, 11 selectable auto focus points and 12.3 megapixel image resolution (compare to 10 mp). Kx shares same body as Km, so it is still very compact but not weather-sealed like Pentax k200, k20d or k7. It also use four AA batteries instead of lithium batteries.BODY & HANDLINGPentax Kx weights 581g, and its dimension is 122 x 92 x 69 mm. It is one of the smallest DSLR camera around, but not the lightest because of body material and 4X AA batteries.Using batteries has been always been debated, some people  like to have lithium battery with their camera, especially those who does not or concern about reliability of rechargeable batteries. Some might prefer the universal AA batteries because they are available everywhere and the rechargeable one is relatively cheaper compare to lithium one.Built quality of this camera is generally good for beginner digital SLR, sturdy and substantial. Ergonomic is not the best especially for people that has big hand or finger, but it is good in general.Like KM, the camera interface has been simplified yet very accessible. It has one thumb dial which you will use this a lot to change setting values. There are dedicated trash button, AF/AE-L, exposure compensation button, customizabe green button, live view button, info button, four way buttons which are shared with ISO, WB, Flash, self timer. These are basically what you will need and expect from a good digital SLR camera.There is also a shooting mode dial, where you can find manual and semi automatic control. There are also some popular scenes mode and video mode. Unique to Pentax, there is Sv (sensitivity mode), which allow you to set preferred ISO and let the camera decide on aperture and shutter speed value.Changing setting is fast and easy because of availability of many dedicated buttons. Main LCD screen could be activated by turning the camera to ON position or pressing INFO button. Pressing INFO button twice, you will get 12 squares representing popular settings such as auto HDR, image size, shake reduction, etc.This small control panel is a great help and better than Nikon's info screen, but it is not better than Olympus super control panel.LCD SCREEN & VIEWFINDERLCD screen is basic, plain 2.7\" , 230k. Compared to recent years DSLR, this screen is a bit outdated but it is not bad. Viewfinder is relatively big compare to beginner DSLR camera. Only Canon 500d and 450D can match the size of the viewfinder.AUTO FOCUS PERFORMANCEAuto focus (used with 18-55 kit lens) is surprisingly fast in bright light or low light situation. You will get AF confirmation in the viewfinder (hexagonal green dot) but there is no indicator where the active focus point is. For who that rely on automatic 5 points, 11 points or central point AF, it might not be a problem, but for those who usually use other individual AF point, it might be a bit of inconvenience.IMAGE QUALITY AND ISOPentax Kx  images in natural setting are not bright and saturated like competitor like Canon DSLR, but they are more muted and a bit cold. It is similar to Nikon DSLR such as Nikon D90. Nikon and Pentax Kx uses Sony sensor, and that might explain the similarity.But don't too worry if you don't like muted color, because you can always set higher saturation in Pentax custom setting or deal with it later in your favorite photo editing program. But off course it won't match Canon color when you both set the saturation setting to the max.The sensor strength is on high ISO setting. It matches Nikon D90 and even slightly better. Combined with built in shake reduction, this camera is very good in low light photography such as night scene or indoor performance. This performance might be the best for crop sensor camera up to date and only to be beaten by expensive full frame camera such as Nikon D700 12.1MP Digital SLR Camera (Body Only) or Canon EOS 5D Mark II 21.1MP Full Frame CMOS Digital SLR Camera (Body Only)OTHER FACTS & FINDINGS  * Pentax Kx is available in 100 colors combination in Japan  * Built-in photo processing like auto HDR is slow (takes approx. 10 sec to process and to make a good HDR, you need tripod). It also drain batteries power quickly. Live view, movie recording is very basic for DSLR standard and it also drain batteries. Prepare plenty of rechargeable AA batteries if you keen on using these features.  * The kit lens 18-55mm is generally an OK kit lens, but to get better image quality especially sharpness and image acuity, I recommend you to look for some better lenses such as Pentax 16-45 f4 or 17-70mm f4.COMPETITORCanon EOS Rebel T1i 15.1 MP CMOS Digital SLR Camera with 3-Inch LCD and EF-S 18-55mm f/3.5-5.6 IS Lens Price: $750is a leading beginner cameras with 3\" hi-res LCD and 15 megapixel image resolution. The most important maybe the access to Canon extensive lenses. But this camera is more expensive and  slower in continuous burst (only 3.5 fps), no built-in image stabilization, and image is not as clean as Pentax Kx' image in high ISO setting.Nikon D5000 12.3 MP DX Digital SLR Camera with 18-55mm f/3.5-5.6G VR Lens and 2.7-inch Vari-angle LCD Price: $700D5000 is also a great low light performer like its brother Nikon D90, but the problem with this camera is lack of built-in auto focus motor. This limit your lens selection. There is no built-in image stabilization either. Like Canon and Pentax beginner DSLR cameras, D5000 has live view and movie mode, plus swivel screen.Olympus Evolt E620 12.3MP Live MOS Digital SLR Camera with Image Stabilization and 2.7 inch Swivel LCD w/ 14-42mm f/3.5-5.6 Zuiko Lens Price: $700The E-620 is very small and compact because of smaller image sensor (which is actually a disadvantage). E-620 has swivel LCD screen and built-in image stabilization. Click the camera name for review.CONCLUSIONPentax Kx is a small wonder. It is great camera for low light condition, very portable (especially combined with Pentax pancake lenses), and the design is very user-friendly. It has two problems that prevent this camera to be the perfect beginner/enthusiasts camera: the active auto focus indicator is absent , and battery life is short when you use photo retouching features and record movie often. However, with the current price point, this camera gives you a  better value than its competitors.Subjective Rating - Relative to entry level DSLR cameras 2009Image Quality : 5/5Features : 5/5Performance : 5/5Body and Handling : 4/5Value for Money : 5/5For image samples and iso comparison please visit my blog. You can find the link through my Amazon profile.", "Date": "November 5, 2009"}, {"Title": "Wonderful little camera", "Author": "W. Struth", "ReviewID": "R2SHL953XXI58D", "Overall": "5.0", "Content": "I purchased the K-X with the two lens kit with the 18-55 lens and the 55-300 lens.This is a wonderful little camera; the autofocus is fast and accurate, the menus are clear and easy to use, the picture modes let you play with your creativity or you can use it for just point and shoot, and it has manual control when you are ready to use it. I went with the long lens because I take a lot of detail shots and this lens does the trick for me. I haven't yet found a situation where I needed to zoom in closer, and when I do I can always buy a longer lens.  Back to size it's a great one handed camera to use, I find the camera comfortable to handle and it feels well made.I've taken about an hour of video so far; it can shoot up to 25 minutes of video at a time.  It's not a video camera but when you want to take a video spontaneously it works great.  For me the video is just icing on the cake.  The photos are what I bought the camera for.  I use mostly the aperture priority (to manipulate the depth of field or get low light shots) and the auto picture settings.  And they come out consistently crisp and accurate.  Sometimes you will have to manipulate the white balance settings especially when you use the low light capabilities of this camera without a flash, as with any DSLR. The camera has lots of digital filters to process your pictures with, and they are fun to use.  What I love most is being able to use the high ISO settings and not need a flash indoors and still get great quality shots.I use rechargeable batteries in the camera and have now downloaded the new firmware so the camera recognizes them faster.  This is a must do because before I had to turn the camera on and off and turn the live view on and off for it to recognize new batteries.  I played with a few sets of batteries to make sure they would work.  I'm saving the supplied lithium batteries to be a back up set when the rechargeable batteries get depleted.The in camera shake reduction works with all my lenses including my old manual lenses from 30 years ago.  The neat thing about using manual focus lenses (and wearing glasses like I do) with this camera is that you can set the camera to beep when you have focused the lens correctly, and there is also a visual indicator when you look thru the viewfinder. And every Pentax mount lens you buy will work with this camera.", "Date": "December 5, 2009"}, {"Title": "Wow! What a great Camera!", "Author": "jackmaddy \"jackmaddy\"", "ReviewID": "RAC6TBK305IRM", "Overall": "5.0", "Content": "This is only a preview and I will post a revised review in a few days.This is my first SLR camera so I have no frame of referrence other than my visits to camera shops to try a few out.  I was torn between the Canon T1I and the PENTAX K-X.  I took a look at the T1I and felt it was a bit on the cheap side. It was also a bit more expensive with less features and lens are very expensive.  Also I think the 1080P at 20 frames is a gimmick as is the whole HD video feature in SLR camera's.I have only had the Pentax K-X camera for 24 hours but cant get over the build quality.  It takes fantastic pictures and has more options and tweaks than you could ever want.  Its very easy to use right out of the box even for my wife, yet if you want to tweak your photos and get into it everything SLR offers, the options are there and then some.A few comments about the fact the camera does not come with rechargeable batteries and battery life in general: As for Battery life, I am using the supplied Lithium AA's I have used the camera for several hours, taking video and a couple hundred pictures, the battery is still showing as full!  As for no included rechargeables, this to me is a non issue.  1.  You can keep a spare set of batteries either alkaline or Lithium or even rechargeable which is what I plan to do.  I think this offers a ton of flexiblity and ensures you will never run out of juice!Also, the camera I purchased was a kit with both the 18-55mm and also 50-200mm lenses.  these lenses are great build and have excellent image results.Again, this is only a preview but what I have seen so far I am so glad I went with the Pentax over the Canon T1I!  More to come soon.", "Date": "October 28, 2009"}, {"Title": "Big punch packed in a small body!", "Author": "waiehu92", "ReviewID": "R2K7IX42TT7RDZ", "Overall": "5.0", "Content": "Okay, my review's not going to rattle off all the specs and info you can find everywhere else on the 'net. Here's my two cents on actual experience with this camera...Low light shots are amazing! No need for flash with this camera...I've compared shots with/without flash...just wayyy better without flash...up to ISO 6400 is very, very usable. I took the camera for a shoot down Waikiki at night with very good results. You'll be amazed how many of your shots come out well with this camera, even running the auto setting! Auto focus is quite fast, and despite what some may say about the kit lenses (i got the kit with the 18-55mm and 55-300mm), the image quality is very sharp and clear, and the zoom and focus dials are really smooth. You get an actual manual focus ring unlike other entry level DSLRs. The layout of buttons on the camera to adjust f-stop and shutter speed is set up to be really user friendly. After a few shots, you don't even have to think about where the buttons are...they just make sense. I'm learning the manual settings and am getting to know the different effects the camera is capable of...but really, you'll be surprised how good night photos are, and how different shots are without flash, which gives a really artificial looking light. As far as video, I've taken good video with good natural light (daylight), but had video with lots of noise and grain with night shots. I've seen really great footage with f1.4-1.7 old lenses, and have a f1.7 on order and on the way. Do a \"pentax k-x\" search on Vimeo or Youtube and check out the footage...you'll be amazed at what's capable with wide open aperture and this camera for video. As far as how the camera feels in the hand, I'd say I have average size hands and it really feels solid for its size. The build quality, while not weatherproofed etc. like DSLRs that cost twice as much, has a quality feel all around. Battery life...I took roughly 1000 photos and about 10 minute or so videos, and the original lithium batteries are still at full. I bought an 8pk of Eneloops but didn't get a chance to use them yet!This camera got me hooked on taking photos, can't wait to take it out on my next outing!!Hope this was helpful to someone-", "Date": "January 30, 2010"}, {"Title": "Digital SLR, Love my K-x", "Author": "Mark BALCHER \"Digital Doctor/ Tech Titan\"", "ReviewID": "R1WVKP4TUVKM78", "Overall": "5.0", "Content": "I recently got the Pentax K-x in Black from Amazon. It arrived in only a few days, and Amazon provided me with a way to track my package, so I could see exactly where it was. I can't say enough about this wonderful camera. I've been shooting with SLRs for 25 years now, and this is the finest one I have ever used. It is such a pleasure to hold and use. You feel like you are holding something very special, as the build quality is top notch. The HD video feature is awesome, too. I've been tinkering around with HD video on my PC for a couple of years now, so I know all about the formats of HD. You are going to need a computer with a bit of muscle under the hood to be able to play your HD videos. I recommend a dual core processor. That should be enough to handle, playing your HD captures. It shoots video in the .avi format. And if you like to upload to YouTube, it works just fine. YouTube actually recognizes the video as being HD, and thus allows it to be played in their HD player. The other thing I love about this camera, is the RAW format. It lets you choose between the Pentax RAW (PEF), or the highly used .DNG (Digital Negative) format, which is so very versatile. I like shooting in .dng, since it's non proprietary, and Adobe Photoshop has no problem with it. As for the picture quality, and camera settings, they are what you would expect to be with any DSLR. I've always been a Canon guy, but couldn't resist this little gem. I'm so glad I opted for the Pentax, and have no regrets.", "Date": "January 8, 2010"}, {"Title": "WOW Pentax K-x", "Author": "D. Kelley", "ReviewID": "R17N4V3JXBZ24D", "Overall": "5.0", "Content": "My first DSLR.  Have had Film SLR in the past and loved the creativity that can be accomplished with a manual camera. Hated the hassle and price of having film developed. Went to point and shoot digital and lost interest in photography. I picked up a friend's Canon DSLR and was instantly hooked again.Chose the Pentax because I have some old manual K mount lenses left from my film SLR. In retrospect after using the auto focus lens that comes on the K-x I will proebley very rarely if ever use my old K mount lenses.So the number one reason I chose the K-x was a poor choice on my part. But this is an awesome camera Here are what I like.1. Hand Shake compensation is built into the camera not the lens making lenses less expensive and it works extremely well.2. This is the most compact DSLR I have held. It fits my 8 year old daughter's hands and also fits my somewhat large 45 year old man hands at the same time.3. Simplicity of use. In auto mode my wife and daughter take excellent photos. (Think outstanding point and shoot.)4. Complexity all functions can be manipulated to give you full control of your photos. (Think Film SLR loaded with ISO 100 - 3200 film at the same time and full manual control of shutter speed, F-stop, Focus and any other thing you can think of.)5. Price this is a great first DSLR and possibly the only one you will ever need. It's not a pro DSLR but some times it thinks it is.6. 4.7 Fps this means your child is playing a sport as the ball comes toward him/her you push the button the camera will take 4.7 pictures every second for about 4 seconds depending on the speed of the SD card. I had an old SD card lying around I got about 5 pictures and it would slow down. I put new class 10 SD card in and it doesn't slow down for about 30 pictures.", "Date": "March 23, 2010"}, {"Title": "Best value and superb low light performance", "Author": "Photographer", "ReviewID": "RVE3K3V63UNAP", "Overall": "5.0", "Content": "This is my third Pentax dSLR, the others are Ds and K10. I was not really planning on getting a K-x, especially after I bought a Panasonic LX3 just 2 months ago. The published reviews suggested that it is too good to pass up; the price may go up as a result of the reviews. So I jumped. For the rest of this review, I will be comparing the K-x to my K10.AF performance is significantly improved. Even though I did not really feel that it was much faster, focus is dead on even in very poor light. There is no difference in AF speed for SDM lenses. Some people reported that they sometimes had problems with the K-x / Tamron 17-50 combination, I have yet seen that. I have to say that improvement in AF alone is enough to justify the upgrade for anyone with a Pentax older than K20.Noise performance is another area that K-x just left K10 in the dust. When both were set to ISO200 and at 400% magnification, darker areas remained smooth for K-x while the K10 was visibly noisy. With the limited experience at ISO6400, I am so far very pleased with K-x noise performance.I like a real optical view finder but I love LV for macro. I don't have any problem with the penta-mirror viewfinder. It might be a tad darker but you will hardly notice.Some people have reported that K-x has a larger dynamic range than K10; however, I cannot confirm that yet. I am hoping that this is indeed the case. It is safe to say that it is at least as good as K10.Before I placed the order, I was actually quite concerned with the lack of AF point indicators in the viewfinder. I think I am OK with this arrangement. It is obviously not as easy as K10 but not a deal breaker. As for the lack of a 2nd e-dial, it is again not a deal breaker since I also have a Ds which does not have a 2nd e-dial either. Weather sealing, not a deal breaker. I cannot justify spending another $500 just to get these features.There are plenty of significant improvements over the K10 to make K-x a keeper. There are just a few minor issues.Shutter/mirror is just as noisy as K10. I prefer the K7 but cannot justify the price difference. Again, it is not a deal breaker.I have relatively large hands and hope that someone will market a battery grip for K-x. I have a battery grip for K10.In summary, I can confirm the findings of many published reviews. It is a very capable camera and perhaps the best value in its market segment. It certainly took sales away from K7 but I think Pentax will increase market share at the expense of competition. BTW, it is also the cheaper dSLR in my collection. Great job Pentax.", "Date": "January 14, 2010"}, {"Title": "Could not be happier", "Author": "Engi_Nerd", "ReviewID": "R3K8S7OHP9GC6V", "Overall": "5.0", "Content": "After several agonizing months of research and forum crawling, I found myself firmly stuck between the Canon T1i and the Pentax k-x. [...] analysis of the Pentax ultimately sealed the deal for me, promising a compact and responsive starter DSLR with lots of headroom to grow in to (and for hundreds less than the canon). Having had the camera for a few days now (and promptly updating the firmware to avoid the nefarious battery issue)I can honestly say I could not be happier. The kit lens has proven more than sufficient for me to cut my teeth on and can definitely produce sharp, vibrant pictures, provided you're not relying on the idiot setting. The button and menu layout is concise and accessible, allowing you to learn the camera inside and out in only a day's time. The camera itself is extremely compact but still manages to have a very solid and comfortable feel. And as so many have noted, the high-iso capabilities allow you to shoot in available light with fantastic results. And while hardcore photographers complain they're pointless, the in-camera filters and cross processing abilities give great results with minimal effort and absolutely add value to the camera. My only gripes thus far are the lack of focus points in the viewfinder (which i wouldn't actually use but feel i should get for spending 6 bills) and the AA batteries, which were easily remedied with a set of Eneloops. All in all though a FANTASTIC camera and ridiculous bargain. If you're reading this you want the k-x but are probably worried about going non-Canikon. My two cents: Buy Pentax and don't look back.", "Date": "December 28, 2009"}, {"Title": "Initial Impressions.", "Author": "Amazon Customer", "ReviewID": "R3JFSROKUN37SK", "Overall": "5.0", "Content": "I just received and unpacked the K-x. The K-x feels solid and quality built, this is great for the class and has features that many more expensive cameras lack. I shot a few pictures and they are looking awesome... I will need more time to do a complete review, but overall the K-x looks great. I think this Camera has tremendous Value and will push more consumers to look at Pentax for dSLR. Many ppl forget or don't know the great Film Pentax's of the past.A few notes:1. Yes the camera comes without a SDHC Card, but Camera's lack this anyway. (I purchased a 16GB Class 6 SDHC ~$32).2. The Camera comes with Lithium AA Batteries, but you can use Ni-MH Rechargeable AA also.3. Included Kit lens 18-55mm is sharp and takes great pictures...4. You can use many film/dSLR Pentax Lenses going back about 50 years, this mount is compatible.I will update my review after some good photo work. The K-x does lack HDMI connection (only USB) so you can't playback from the Camera the 780p Video to a TV with USB. I will have to load my SDHC Card into my PS3 or Laptop for viewing/editing in 780p. It depends how much Video you will shoot and if you will record to DVD, in which case this is not an issue.", "Date": "October 23, 2009"}, {"Title": "Really nice", "Author": "MattB", "ReviewID": "R23SF1GVD2S1SW", "Overall": "5.0", "Content": "This camera is the best value in DSLRs on the market today.I got it to replace an Olympus e-510 which is a fine camera, but the K-x blows it away.My favorite features are the high ISO performance which allows for shooting without a flash in lower light, and using faster shutter speeds with the relatively slow kit lens, the quick auto focus, and it's small size and low weight.I like to get out into the wilderness on my skis and bike but love to bring a good SLR with me. The K-x now makes that easier than ever. Also, being compatible with every Pentax lens made in the last 50 years is a huge plus. I picked up an inexpensive 50mm f1.7 prime on eBay and have been having fun shooting with that too. Much sharper (when stopped down) and faster (when opened up) than the kit lens which is ok but not fantastic.Shooting around the house without having the use a flash is also a huge advantage. The shots just look more natural and when shooting it's less intrusive for my subjects to not have the flash going off all the time.The two things I would add to this would be the weather seals found in the  higher Pentax models and AF illumination (the rod spot that tells you what point is focused).I haven't had any problems due to lack of seals yet, but the peace of mind would be nice while taking it out into the elements.Video is ok but not great. That's a nice feature that I probably will not use a whole lot but it's nice to know I have the capability if the right opportunity arises.Be sure to upgrade the firmware to 1.01 if your camera doesn't already have that version. It fixes some problem the original fw had with the battery meter and different kinds of batteries. Without it battery performance is not very good when using rechargeables.", "Date": "January 7, 2010"}, {"Title": "Great First DSLR or Back-Up", "Author": "Adam J. Brown \"Adam\"", "ReviewID": "R1LWCJF20BDKFD", "Overall": "4.0", "Content": "I recently picked up photography. My first camera was a little Casio Exlim point-and-shoot that I bought for school projects. I soon found myself taking pictures of non-school related subjects. From there, I bought a Lumix ZS3 point and shoot, which had better image quality and a few more manual settings. Then I stepped it up to the Lumix FZ35, which had all of the basic manual controls, and decent image quality as well; however it lacked the image quality that I've been seeking. What does this have to do with the Pentax K-X? Well, if you have followed a similar path in photography, perhaps the points that I convey will be of use to you knowing the context from which they come from.I looked, and looked, and looked for a reasonably priced DSLR; I researched at nauseam comparing specs and sample pictures. I found 4 highly regarded DSLR's within my price range. The Pentax K-X, Nikon D5000, Canon T1i, and Olympus E620. I'll be brief and spare you the details. The Olympus was the least impressive, with the most impressive feature being it's articulated LCD screen. Image quality was just okay. The Canon appeared to produce the better image of the four, but only just. However the Canon struggles in low-light; I'm a fan of low light, so I checked the Canon off of my list (It was also the most expensive of the four, by $150 or so.). That left me with the Pentax and Nikon...image quality was most important to me, followed by specification, then features. Both the Nikon and Pentax use a similar sensor...however, the Nikon's images tend to be softer, as opposed to the Pentax which produces sharper and more true-to-color images. Both perform well in low light conditions, however the Pentax maintains greater details, as the Nikon's image softens as light decreases. In my research, the Pentax's performance in low light conditions was often compared to high-end DSLRs in performance.Video was not a must for me, but a convenient feature, and both the Nikon and Pentax have HD video. Really, the only significant feature that Nikon has over the Pentax...an articulated screen. However, a feature that Pentax has over Nikon are lenses, and the convenience of being able to mount the Pentax K-X with just about every lens that Pentax has ever made (At a somewhat affordable price too!). I was sold on the Pentax, so I bought the camera. Here's a good old fashioned pros and cons list.PROSimage qualitylow light shooting performancecomes with a pretty good kit lensHD videosome cool digital filters including color extract and fish eyeHDR capture (Although, not quite as good when produced through software...still, a fun feature.)fast AF through the view finderquick and easy manual controlscompact yet feels like a serious piece of equipmentany Pentax lens can be mountedvery affordableAF/MF switch...helps when the AF struggles to focus on your subject, whether because of the lighting or compositionfires at 4.7 frames per second!30 seconds to 1/6000 of a second shutter speedF stop down to 40CONSlive view AF takes about 2-3 secondsmenu takes some getting used to (not a big deal)HD video is adequate but not greatimage quality is good, but it's not a big jump from some higher end compacts (like my Lumix FZ35)Overall, this is a good first DSLR camera, and even a pretty good back-up, I would think, for more serious photographers. If you want a nice package at a nice price, you can't do any better than this Pentax.", "Date": "August 17, 2010"}, {"Title": "Great entry level DSLR", "Author": "Larry Kregen", "ReviewID": "RL2OV2EI0UK12", "Overall": "5.0", "Content": "First off, I'm not going into a full review of this camera, as that was done very well by several other reviewers. I will however, list the immediate pros and cons.Pros: 4.7 fps continuous shooting, excellent low light capability, excellent value.Cons: Biggest problem with this camera in my opinion, is the LCD screen. Works fine for the menus, but when you playback an image, the screen resolution is obviously not high enough. Images that look grainy/blurry on the camera look perfectly fine on a computer. This isn't something major, but keep in mind reviewing images, that they will look much better on a computer.", "Date": "June 16, 2010"}, {"Title": "This camera \"shines\" in the dark", "Author": "Up North Guy", "ReviewID": "RAHBIGH88XTN1", "Overall": "5.0", "Content": "I chose the K-x over the K7 because of its low light performance(being half the price helps as well). I have read reveiws that state the K7 performs slightly worse than the k20 at high ISO levels. Being an owner of a k20, I can state that the K-x far out performs the k20 at ISO 1600. This camera is perfect for shooting pictures of people and settings where a flash would be considered intrusive. Its relatively fast focus speeds and hd video make this camera the perfect tool for capturing those special moments with my friends and family. I think you can get more candid shots when you don't have a flash announcing that a camera is present. I still prefer my k20 for more formal photograpy where a \"hands on\" approach is desired, but for everyday use, and at this price, I think the k-x is hard to beat.", "Date": "January 30, 2010"}, {"Title": "Simply Awesome Camera", "Author": "Waldo", "ReviewID": "R2B8VT14A0C14I", "Overall": "5.0", "Content": "I bought this for my daughter, and she had it working and taking pictures in less than 3 minutes after the initial configuration.  Low light, bright light, macro and even stopping the blades of a helicopter with the 1/6000 of a second shutter speed make this camera one with the specifications of a high end model, at an entry-level price.  Oh, and it takes HD movies as well.  The rest of the cameras in this price range will be trying hard to catch up to the K-x.", "Date": "October 28, 2009"}, {"Title": "Excellent SLR, especially for the money", "Author": "J. Fortt \"Technophile\"", "ReviewID": "R16P0MN977M81G", "Overall": "5.0", "Content": "I'm using my Pentax K-x for stills and video, mostly portraits and product shots. It's my first DSLR but after reading up a bit on its capabilities I was good to go. For the price, this is simply an amazing camera. I had considered entry-level models from Canon and Nikon, but after reading a bunch of online reviews I decided that the K-x was a better bet. Indeed, the sensor quality and features (it shoots great 720p video) are unbeatable in its segment.A few likes and dislikes:Likes:I shoot from the viewfinder. I'm not sure if this is because the LCD isn't big enough or because I just like shooting from the viewfinder better - probably the latter. I like to use a manual focus when the situation allows, and I can just see a lot more using my naked eye instead of live view.The video feature is great for casual shooting. I used it on Christmas morning to capture my 18 month old opening gifts.Since I rarely use live view, rarely use a flash and set up my shots before turning the camera on, the original batteries have lasted me about two weeks. Can't complain about that. I bought 8 Eneloop AAA rechargeables for when the originals run out, but haven't had to swap them out yet.Low light performance is amazing. Check out the reviews. It's as good as cameras that cost twice as much.Dislikes:The audio is mono on the camera, and there's no audio input. So if you want to shoot something with sound, i.e. an interview, you'll have to use a separate recorder and sync the audio later. That's probably too much of a hassle for a project with a lot of cuts, but if it's something simple it's workable. I managed to sync some audio in iMovie that looks/sounds really good.The shutter is on the loud side. I haven't yet found this to be a real problem for me, but some reviewers have been annoyed by it.It's rare for me to get a decent-looking picture using the internal flash. Some of that is probably just the nature of internal flash, but I'm guessing some of it owes to the implementation in the K-x. Fortunately, images still look good at ISO 1600 and usable at ISO 3200, so it's possible to get up to a high enough shutter speed to take photos of a toddler indoors during the day.", "Date": "December 28, 2009"}, {"Title": "The Pentax K-x is a giant killer!", "Author": "Edgar_in_Indy", "ReviewID": "R28C1KZNPJEBKT", "Overall": "5.0", "Content": "I recently upgraded from my beloved Olympus e-510 DSLR with the 14-42mm and 40-150mm kits lenses in order to get a DSLR with better low-light performance and HD video capabilities. I loved my Olympus, but image quality took a nose-dive at ISO 800, and I liked the idea of having an HD camcorder built into my camera to capture high quality family photos and home videos in one device. I eventually settled on the Pentax K-x after first buying, and then returning, a Canon T2i.I know that the T2i costs almost twice as much as the K-x, and they're not direct competitors, but I think my experience illustrates what a great camera and bargain the K-x is and how, for me at least, it was a giant killer.I initially pre-ordered a T2i for the $900 MSRP after reading the glowing reviews in the press about the 18MP sensor, the high-ISO performance and the killer 1080p video. When I received the T2i, I was surprised by how cheap and plasticky it felt. It's not that the T2i was likely to fall apart, but my Olympus felt and looked like a higher quality camera, even though it was about $200 less than the T2i when I bought it. I realize that the T2i is a Rebel, but for almost $1000, I expected something more solid.Even worse was the Canon 18-55mm kit lens, which felt like a toy compared to my Olympus kit lenses. It looked cheap, and the zoom action felt very cheap, and you could hear plastic-on-plastic as you zoomed in and out. There was no lens hood included, and the optional lens hood was only about an inch deep and looked ridiculous. The front element rotated when auto-focusing, which makes using some filters problematic, and you had to switch off AF to manually make focus adjustments. My Olympus lenses did not rotate the front element, and allowed full time focus override without turning off AF. And build-wise, they looked and felt like a higher end lens. But worst of all, Canon kits lens's optical performance was lacking, rendering the 18MP sensor moot.I could live with the cheap feel of the T2i body and the ugly jelly-bean design, but I came to realize that in order to get a lens that would match the performance of the body, I would need to shell out another $500 or more, and as a hobbyist I just didn't have the budget.The real deal-breaker with the T2i though, was the use of Quicktime format for the HD video. Quicktime is a proprietary Apple video format, and while I must assume it works well on a new Mac, the QT videos often gave PCs problems. I'd read about this from other users, but I figured that with my high-end PCs and my computer knowledge, I would be okay. But both my new Sony Vaio laptop with Windows 7, ATI 4650 graphics and 4GB of RAM and my desktop computer with Windows XP, dual-core processor, 4GB of RAM, Raptor 10K HDD and nVidia 8800GT graphics would stutter on playback of the 1080p files. And finding affordable programs to edit Quicktime HD video files is another headache. I wasn't about to buy a new Mac just to be able to work with the video from my new camera.So back went the T2i, and my quest for a new camera continued. I was just about to pull the trigger on a Nikon D5000, when I came across the Pentax K-x.The first thing that grabbed my attention was the styling. I thought the red was killer, but I wasn't that brave. And the camera looked dead-sexy in navy blue, but when I saw the white version, I was in love. One thing I liked about my Olympus was that it was something DIFFERENT than all the Nikons and Canon Rebels you see every other parent carrying to school or sports functions. I would often get questions about it from people who didn't realize that Olympus even MADE DSLRs. With this Pentax, I would again have something out of the ordinary.Then I started reading reviews of the K-x. One of the great things about the T2i is the high ISO image quality, and according to the reviews and the sample images I was looking at, the K-x was right there with it.And the K-x also did HD video. There were some limitations, such as 720p and lack of full control over exposure while shooting video, but I didn't really mind since the samples I downloaded looked great, even on my 110\" 1080P home theater projector. And 720p files take less space than 1080p and require less processing power to playback and edit. And best of all, the K-x uses Motion JPEG video format, which plays back great on PCs and is compatible with almost any Windows video editing program. The MJPEG format does use more disk space than the equivalent QT file, but hard drives and SD cards are cheap these days, so it's not a big deal.Another great thing about the K-x is that it has sensor-based image stabilization in the body, so any lens you stick on the camera is stabilized. My Olympus used a similar system, and I was very happy with it. The big advantage is that you can buy non-stabilized lenses so they'll be smaller, lighter, less expensive, and (theoretically) more reliable.I ended up buying the K-x in white with the 18-55mm lens. The K-x looks and feels like a higher quality camera than the T2i, and matches my Olympus in this department. The kit lens is also a very worthy piece of hardware.With the money I saved on the Pentax, I was able to buy the legendary Tamron 28-75mm F2.8 lens, a Pentax 55-300mm zoom lens, and a Sigma speedlight. The flash was new, but I got great deals on the slightly-used lenses on eBay and Craigslist. ($300 for the Tamron on eBay, $150 for the 55-300mm Pentax on Craigslist).I've been using the Pentax for a couple months now, and have taken hundreds of pictures. I am absolutely thrilled with the camera and couldn't be happier with the photos and videos I'm getting. The T2i did have just slightly more detail, but other than that I would say the K-x has equal image quality. And the 12MP RAW image files of the K-x are faster to work with than the 18MP files of the T2i and take up much less space on SD cards, so you don't have to worry about filling up nearly as fast.There's not too much negative I can say about the camera. I would like it to have a mini-HDMI port and a standard mini-USB port, and continuous auto-focus would be nice in video mode, but no other DSLR has that yet. Stereo mics and even a mic jack would also be very welcome.I suspect that the image stabilization system may not be as good as the one in my Olympus, but I can't say for sure since my Pentax telephoto is longer than the telephoto I had with the Olympus (450mm equivalent vs 300mm for the Olympus) and will therefore be more prone to shake.I get compliments on the Pentax everywhere I go, and it's been a joy to use and own. I could not be happier with my purchase.In the future I'll probably add a Sigma 30mm F1.4 prime and a Sigma 10-20mm ultra-wide zoom to my lens kit.Just for the record, I'm not trying to bash on the T2i. It is an amazing camera that is currently without peer in its price range. But if you're like me and you only have about $1000 to spend, I think you will get much more value by going with a less-expensive but almost-as-capable camera like the K-x, and using the extra money on high quality lenses. My F2.8 constant-aperture lens has been a revolution for me, and I recommend every budding photographer make room in their budget for something similar.", "Date": "May 29, 2010"}, {"Title": "Made a Pentax Fan Out of Me", "Author": "Bill Nicholas", "ReviewID": "R2D81LYLZNVCCW", "Overall": "5.0", "Content": "I bought the K-x shortly after it came out. I got it with the kit 18-55 zoom and the 50-200 zoom. To call this an entry level camera is a disservice. It may be easy enough for a newbie, but the capabilities and options in it go far beyond an \"entry\" level. The main reason I was interested in the K-x was for the low light performance, and it is everything they say. It is even more so with better lenses and understanding of the settings. The batteries are the only issue but I have not had a problem. I bought 2 sets of eneloops and just keep them charged and ready. I have never got caught out of juice. I did seek to upgrade the lenses after a while. One of the best features owning a Pentax is you can get lenses as good or better than Canon or Nikon for 1/3 to 1/2 the cost. You can also fit almost any lens Pentax ever made on the camera. I've picked up a few cheap lenses on Craiglist to get a feel for what I'd like in a new lens. I replaced the 50-200 kit zoom with a DA* 50-135 f/2.8 and it is mind-bogglingly (if that's a word) better. The images it produces have a distinct quality that makes them almost 3D. It's an expensive lens but, believe me, it's worth it. Take my advice on this, though: don't bother looking for a better standard zoom. The Pentax 18-55 kit zoom is one of the best kit lenses available. I compared it to the DA* 18-55 f/2.8 and Tamron 17-50 f/2.8 and returned both. Neither produced noticeably better images and they did not have the kind of \"pop\" produced by the DA* 50-135. There just isn't that big a difference to justify the extra cost (it is justified for the 50-135 f/2.8). Be satisfied you have a good standard zoom and maybe get a good prime lens instead. One of the neat features I really like in the K-x is the HDR function. If you take architectural photos, especially at night, it can produce unbelieveable images. The other thing I like is the green button you can assign certain functions to. I have it set to focus when I press it with my thumb. I prefer doing it that way than pressing half way down on the shutter. Don't be afraid to buy this camera. I know Canon and Nikon are the heavy weights, but after owning a Pentax, and reading stuff from other users and reviewers, you come to realize Pentax is not an underdog. They are just as good and often better. There just aren't as many Fans. Yet.", "Date": "July 20, 2010"}, {"Title": "Best Starter DSLR on the Market", "Author": "Melissa Hopp", "ReviewID": "R10R33DPQUHJVH", "Overall": "5.0", "Content": "The Camera is by far the best starter level DSLR on the market.  Having used both the Cannon Rebel and the Nikkon D3000, I can say that the Pentax is the best.  The only complaint I have is that the auto focus, particularly up close, takes forever to work.  However, for those who don't use the auto-focus, like myself, that is not a problem.  The Manual mode allows you to control every last bit of the camera.  The photoshop options that come with the camera are unique and allow for expression.  All of the important dials are easy to reach, and quick to use.  The camera is comfortable in your hand, and easy to hold.  The video quality is very good for a camera.The lens it comes with is very versitle and light.  And a simple flick of a switch on the side can put the camera into auto-focus mode, allowing the camera to focus when you can't.Pentax is the way to go.", "Date": "July 19, 2010"}, {"Title": "Great DSLR for amature", "Author": "D. Campbell", "ReviewID": "R1UH2DOINHDTTG", "Overall": "5.0", "Content": "I love my new camera, the Pentax KX.  I use the camera with the accompanying 18-55 mm zoom lens as well as lenses from my old Pentax SLR with great results with each lens.  I had resisted making the move to digital for years because I liked the comfort of knowing what I would get with my film SLR camera, but a few years ago I bought a point and shoot digital for my wife; who never felt completely comfortable with my camera. I found myself using her digital more and more frequently because of the instant gratification of seeing the results right on the spot.  I also found myself more and more frustrated with the limitations of the point and shoot including shutter delay and inability to get the results I wanted and was used to with my film SLR.  The clincher came one day when we were at the park with my 2 year old granddaughter and I grabbed my wife's camera to take some pictures as my granddaughter ran joyfully from play equipment to play equipment.  The results were photos of her running out of the scene unless I was able to guess how much to \"lead\" her when I took the picture to account for the shutter delay.That same day I ordered the Pentax KX from Amazon and with the Prime shipping got the camera two days later with free shipping.  The camera does everything I want and was used to getting with my old film SLR and then some.  The colors are great, the stop action is unbelievable and with the various settings I am able to get the pictures I want with the effects I want.  For me part of the beauty of the camera is that I can use an automatic setting like the \"kids\" setting that allows shooting at over 4 frames per second and delivers excellent skin tones or I can control everything from ISO to shutter speed in a manual mode.  Yet it is easy enough to use that my wife has discarded her point and shoot and now uses my camera in the auto mode just like a point and shoot but with better results.The added benefit of being able to use my old Pentax lenses has been a great cost savings.  I love the ability of the camera to signal when a frame is in focus, even using these old lenses that have an \"A\" setting on them.  Great camera, great price, great service from Amazon.  I love photography again!", "Date": "April 25, 2010"}, {"Title": "Just one word \" awesome\"", "Author": "P. Nina", "ReviewID": "R3AYCML3QNPK1L", "Overall": "5.0", "Content": "After lot of research and deliberation, I got the pentax k-x for my trip to London. I am an amateur in dSLR cameras, so I am not going to go over the technical details. But, what I would like to share is my experience with this little gem for over a period of 10 days in London. I took over 1000 pictures, most of them in auto mode. The pictures were shot from top of moving buses, in boat cruises, dimly light museums and many indoor places. I was amazed to see that almost all of them were clean images. There was hardly any blurry image and the pictures were beautiful with stunning details. The battery that came with the camera lasted the entire trip (over 1000 pictures and few videos) and is still running.Earlier, I had few apprehensions about the battery life in Pentax K-x, but I don't think it is an issue(I updated the firmware!). Interestingly, the prize of Pentax k-x in UK is comparable to rebel T1i and NikonD5000. So folks, I think we are very lucky to get it much cheaper in US. If you are a first time buyer of dSLR, I would strongly recommend you to buy this one. You will never go wrong. For 720$ with 2 lenses (18 - 55 and 55 - 300), it is a steal.", "Date": "January 28, 2010"}, {"Title": "Excellent camera but...", "Author": "Vuzz", "ReviewID": "RPJIAZUGK7E4E", "Overall": "3.0", "Content": "I bought the camera from Amazon and made 800 shots when a problem appeared. The camera would block all of sudden, shutter speed would disappear from display and there was no way to make shots again. I tried to change batteries and everything seemed to be OK again but only for several shots. The second try was to check lens and contacts, but without help. All in all, K-x is a great camera but in my case very unreliable. I sent it back to Amazon and will order K-x again :)Pros: very compact, fast, excellent photosCons: a bit heavier than I expected, unreliable (in my case)", "Date": "July 14, 2010"}, {"Title": "Great Camera! wish I could get a defect free one though...", "Author": "O. Shaheen", "ReviewID": "RUDZVXD1SIU3S", "Overall": "3.0", "Content": "The Pentax K-x was my first SLR, and I got it after a lot of research in which emphasis was on compactness, image quality and features/ease of use, and a huge plus for the K-x was that it accepts standard AA batteries.The K-x did not disappoint in all categories, and if anything proved to meet or exceed my expectations especially in low light shooting with extended exposures. The difference in photo quality was phenomenal as compared to other point and shoot and prosumer (pro-conusmer) digital cameras of which I have owned about a half dozen through the past decade (from Sony and Canon).Shortfalls:1- The autofocus seemed to have trouble focusing when a light source is facing the camera, even at an angle, switching to manual seemed to solve the problem, but one should have quick reflexes to adjust the focus manually if shooting conditions change.2- After a few days shooting with my  Pentax K-x I noticed a spot in some pictures which appears whenever the background is blue, in some shots it becomes more evident than others which gave me the impression that the camera's software is trying to overcome a dust particle of sorts somewhere in the Camera optics. I checked the lens and the mirror, everything seemed to be spotless clean, and I have been shooting with extreme caution, so I concluded that the problem must be with some dust particle on the sensor and accordingly I sent it back and ordered another one. Once I received my second camera I took a shot of the sky mid-day immediately after taking it out of the box and assembling the lens, and to my surprise there was still a spot of a different shape not too far away from the previous camera! I returned it and I'm convinced that this is still a great camera, but it seems that stores are shipping returned merchandize or for some reason the quality control people at Pentax don't seem to bother taking pictures of the basic sensor colors (blue, green and red) to insure the quality of their product.", "Date": "September 9, 2010"}, {"Title": "Pentax K-x Digital SLR - Using non-auto focus Vivitar lenses", "Author": "MSUBully", "ReviewID": "R3CAWY81PR0QUZ", "Overall": "4.0", "Content": "I'm still learning how to use this camera.  I had an old Super-program Pentax 35mm, moved to digital point-n-shoot, now the K-x.  I have used my new K-x for landscapes only and have been on two trips so far.  I think the resolution and clarity is very good, and the features and options are fantistic!  Also, it works well with old Vivitar 28-85 and 70-210 lenses, just don't have autofocus.  There seems to be a very slight problem with auto-exposure settings made by the camera, but the problem could be the operator, me.  However, I learned long ago to bracket all important shots, so I still have some great photos.  (BTW, I'm not using it, but what the heck is sensitivity priority?  Manual doesn't explain it very well.)  I have not used the Pentax 18-85 lens that came with the camera much, but it will only go as low as 4.5, so I'll just use it for point-and-shoot applications and movies to take advantage of the auto-focus.  I think it's worth the extra $50 on the price vs. the body-only price.The viewing screen is great, but hard to see in bright sunlight.  It makes reviewing the pictures difficult in some situations.  However, the viewfinder is blocked when you take movies, so I'm going to get a hood to go over my head and the camera (pretty retro.), or a big hat to shade the viewfinder when making movies outdoors. BTW, the quality of the movies is amazing.A great camera at a great price!  I am very satisfied.", "Date": "August 1, 2010"}, {"Title": "Grerat Buy!", "Author": "Alan F. Jordano", "ReviewID": "R5ZW676ECDKVU", "Overall": "5.0", "Content": "This camera just plain rocks for the price point.  You can use it as a full automatic or take control of any or all of the settings.  It comes with a generous number of preset scene modes.  Its burst recording is lightning fast as long as you do not have the camera set to do any automatic in camera processing adjustments.  You will need a Class 6 or higher memory card to take full advantage of its burst recording capabilities.  Focus is very fast and usually dead on.  Occasional mis focus but not any more than with any other digital camera.  Kit lense works well and is pretty solid.  Low light capabilities are fantastic.  Great images right down to ISO 1600.  Battery life is NOT an issue as long as you have the latest firmware.  I am running the same set of batteries after set up and three weeks of use with hundreds of photos taken.  I also spend a lot of time at places like Medieval Faires where the camera is turned on and ided for hours at a time waiting for that perfect candid shot. After all of that the battery indicator is still green.  If you do not want to purchase litium primary batteries invest in a set of eneloops and a charger and you are good to go at minimal expense.Only negative thoughts.....Wish the setting display in the viewfinder was a little larger and brighter and low light (Close to dark) / low contrast focusing can be an issue.  It is better is you select one of the night scene modes.Overall I am extremely pleased withn this camera and I am VERY particular about my work.", "Date": "July 21, 2010"}, {"Title": "Surprising", "Author": "M. Wilson", "ReviewID": "R11APJJNH1YRM9", "Overall": "5.0", "Content": "Other reviews here will provide you with in-depth information, and I won't disagree with them. All that I'll say is that I never thought I'd get as much use out of this camera as I have. \"These DSLRs are so huge compared to my regular point-and-shoot that I'm certain I'll only ever use this for special occasions, such as weddings...\" Not true. The features that this camera has, coupled with the quality that it provides, make it a camera that I enjoy using to a far greater degree than I ever experienced with any point-and-shoot camera.", "Date": "May 30, 2010"}, {"Title": "Easy, excellent, smallish, friends amazed", "Author": "G.P.", "ReviewID": "R3MIBLGS3D47XL", "Overall": "5.0", "Content": "I purchased the K-x from Amazon in December 2009.I used to shoot with an SLR way back in high school around 1990.  This is my first SLR since then and I'm amazed at how easy and fun it is to take great shots.  My friends and family are amazed at the results but I owe a lot to the design of the K-x (though it should be noted that the competition is probably equally capable).  I've uploaded a few of my first pics, take a look.My recommendation: DSLRs are so much better than small point and shoots. But they are less convenient (e.g. bulkier, less simple).  At this price, don't think twice... just buy it and have fun.Batteries: I'm using cheap rayovac 4.0 nimh rechargeable batteries and like most of the other \"low standby discharge\" nimh batteries... they last for ever.Nit Pickers: Yes, it's true: play back display is not as nice as some other rigs, \"live view\" is only useful if you are taking still life shots, video is not very usable. These aren't very important to me and are outweighed by the other positive attributes of the camera.", "Date": "February 26, 2010"}, {"Title": "Best Bang for the Buck", "Author": "Paul Han", "ReviewID": "R1NVUNHWMOP6DW", "Overall": "5.0", "Content": "I come from the world of point & shoot, but I recently had a European trip and needed a new upgrade. I looked into entry level DSLR's and came across this particular camera. I did my due diligence looking at offerings from Canon and Nikon but to me this camera offered the most appealing features at the lowest cost. I particularly liked the low noise at high ISO's.When I first received the camera I put in 4 powermax AA batteries but the camera wouldn't turn on (it also comes with 4 energizer lithium batteries), luckily I purchased a few sets of Sanyo eneloop batteries and it turned on after I put those in. After this, I immediately upgraded the firmware to 1.01 which was a very simple process. However this firmware didn't fix the issues with the powermax batteries, but I don't really mind that. Since I'm a newbie to DSLR, I used the built in automatic picture mode and I had decent results. I did some research and looked up the terminology (shutter, aperture, ev, iso, etc.) and started using manual mode. After hundred's of shots and trial & error I started getting the hang of it and started taking awesome photos. I'm very happy with the image quality of this camera, you can see some of my shots in the amazon product gallery. However, even with image stabilization on it seems to be very sensitive to movement. Slight movement on my part and I get some blur, so be careful with that. I've only slightly used the special features such as HDR, color removal, video (720p at 24fps) etc. but from the limited use they seem to be pretty cool features.This camera seems to be very picky when it comes to batteries (evidenced by it's refusal to turn on with my powermax batteries) but it works great with the Sanyo eneloops. With liveview on I could take only around 200 photos before I got a battery warning. Without liveview and just using the viewfinder I took more than 2000 shots and the camera's battery meter would just be drained halfway. Some don't really like the AA batteries but I love it, very easy to find and use.The 18-55mm kit lens included is sufficient but I found myself at times wanting a bigger lens... For instance, the time I was at the top of the Eiffel Tower I wanted to zoom in to get a nice close up shot of Notre Dame Cathedral, but unfortunately the kit lens couldn't zoom in far enough to get a decent shot.Overall, I really love this camera. It's one of the best purchases I made, very satisfied customer. I would recommend this to both beginners and professionals, a great camera at a great price.", "Date": "March 19, 2010"}, {"Title": "Great first DSLR!", "Author": "J. Pribislavsky", "ReviewID": "RDCW2LYB2OJNW", "Overall": "5.0", "Content": "I got my K-x early December and shot like a million pictures already. Image quality is superb and make sure you get yourself some quality filters, the IR remote control and a good quality tripod to make it even better. It does take a bit of time to figure out all the settings and controls since there are so many of them available (I am still finding things here and there that I had no idea the camera could do) but the interface and menu is VERY easy and very user friendly. Overall quality of the camera is excellent and that is what Pentax is known for. As for the 18-55mm lens it came with, great lens for everyday shooting. You might want to consider getting one of the other lens packages as I kinda regret not having another telephoto lens on hand. I will buy one later, but if you have a camera like this you would want to get another lens anyways, so why not save some money now with the great bundles Pentax has available.Video quality is great if you record in a well lit room or outside (just like any other camcorder). I still need to figure out the auto focusing while filming which is just a matter of selecting the right configuration.The only thing I don't like is that if you want to shoot in HDR Mode (High Dynamic Range Imaging) which combines 3 shots together and pretty much gives you the best quality shots, you cannot set the timer on. So even if you have the best tripod out there, when you press the shoot button, the push slightly shakes the camera on the first image which makes the outcome of the 3 combined images slightly blurry. I don't understand why the countdown timer is not available for this mode. The only way to take an HDR picture is if you get the infrared remote or program your universal TV remote control to work with your camera ( it's an infrared signal, same signal you use to change a channel on your TV with your remote.All in all, this a a superb camera for all your needs and a great first DSLR for rookies like me. Very sturdy quality built and easy one hand operation. Just get a good tripod, filters, remote control and some extra lenses later on and you are set!!", "Date": "February 25, 2010"}, {"Title": "Great value if you know how to use it", "Author": "powerop", "ReviewID": "R2KGQFH6ONFDG", "Overall": "5.0", "Content": "Updated: 8/2/11 - Ever since selling the T2i, I've become adept with the k-x especially because of its outstanding handling and features. And even now after owning a new Canon 60D (for its swivel screen), I still cannot let go of the k-x!Updated: 7/20/11I bought the Canon T2i at the same time as the Pentax k-x for a direct comparison. After much debate, I ended up returning the T2i for my own personal reasons. Keep in mind, every camera has pros and cons, and the best camera for you is the one you use in your hands.1) AF and 3D trackingT2i: Does not beep nor show light indicators while it tracks movement.K-x: No focus indicators at all (except during phase-detect live-view), but fast AF with beeps.2) Low-Light assist beamT2i: Fail. Does strobe-like, seizure-inducing effect with the pop-up flash.K-x: Fail. Ditto.3) FlashT2i: Attempts to default to ISO400. Powerful.K-x: Fail. Weaker and not as elevated above camera.4) External FlashT2i: Has a good small flash (270EX) that uses 2 AA batteries. Cycles fast n quiet, lightweight high sync above 1/180. Can adjust exposure in-camera.K-x: Ok options. Little outdated. Only larger, regular-sized external flashes. But camera has built-in wireless flash control = Nice.5) Live ViewT2i: Good AF speed. Does not show histogram. Keeps mirror open when changing modes or playback.K-x: Contrast AF speed sucks. Phase-detect is much faster. Mirror is noisy.6) Color AccuracyT2i: Reds look good in JPG.K-x: Deep reds look magenta in JPG using default settings. Blue skies are vivid.7) NoiseT2i: JPG has better algorithm. Keeps more detail. More noise in shadow areas.K-x: RAW files has excellent performance. JPG engine too harsh.8) FocusT2i: Shows focus points, sensitive to color of light. Has 1 cross-type sensor.K-x: Must resort to center focus and recompose shooting style. Can use manual lenses with cheap vintage glass. Has 9 cross-type sensors.9) White BalanceT2i: Fail indoors. Would have to use flash. Custom white balance is a pain.K-x: Good Auto. Custom white balance is easy to use too.10) Battery LifeT2i: Has proximity sensors to turn off LCD. Li-ion about 400 shots. Can accomodate battery grip.K-x: Easy to find AA batteries. No battery grip. Up to 800 shots with manual lens. Eneloop FTW.11) Viewfinder InfoT2i: Shows buffer and exposure.K-x: More readable F number and shows custom modes12) Instant ReplayT2i: Must press Play button before zooming in, does not show blinking exposed areas or ISOK-x: Good. Can custom zoom quickly, but to see ISO must press INFO button13) BodyT2i: A little bigger, very light and plasticy.K-x: Compact, more sturdy and heavier.14) MeteringT2i: Features Active D+ lighting which protects highlights well or ALO for shadow.K-x: Has highlight and shadow optimzing, athough more subtle, both can be turned on simultaneously.15) Dynamic RangeT2i: About average for JPG and RAW. Confirm withed ImageResourceK-x: JPG sucks but RAW is top 5 superb.16) Image correctionT2i: Corrects vignetting, does not slow down bufferK-x: Corrects distortion and/or CA but slows down buffer a lot17) Shadow NoiseT2i: JPG are malleable, comparable to RAW files. More chroma noise present, but NR gives better results.K-x: JPG best without NR applied. RAW files less chroma. NR too harsh.18) Video modeT2i: Auto aperture seemless. Autofocus useless. Many formats. Efficient playback H.264, heavy editing H.264. External mic capable. Hackable with tons more options with Magic Lantern.K-x: Auto aperture a bit jerky. No autofocus. No ext mic. Huge files motion JPEG format, easy editing. In-body stabilization noisy.  Can use with 3rd party lens with OS for quieter stabilization - just keep shutter half-pressed.19) FeaturesT2i: 18mp sensor and metering from 7D. Great modern lens ecosystem.K-x: Intervalometer, HDR, more presets such as Extract color, wireless flash, in-camera RAW processing. Compatibility with all Pentax bayonet vintage glass during film era.BOTTOM LINE:T2i: No worries camera. Not very customizable though. The \"reliable\" camera.K-x: Capable of better results with work. Feature-rich. The \"robust\" camera.Tips for K-x:During liveview in Auto mode there is a secret mode called \"Blue sky\" that appears on its own in certain conditions (outdoors). It is not found anywhere else in the camera.Look into \"modset.492\" hack to fine tune AF for front or back focus. Proceed at your own risk.", "Date": "June 16, 2011"}, {"Title": "new dslr user", "Author": "hmommy", "ReviewID": "R14A4ZX4IBE4FC", "Overall": "5.0", "Content": "I was so impressed to see all the features that I could get in this entry-level-priced DSLR! I was considering the Nikon D5000 or the Sony A390, but I could get everything those had for a lower price in the K-x (& Pentax is a well-known name in the world of SLRs). It quickly arrived and the past five weeks I have been learning the wonderful world of DSLRs. The camera fits my hand very comfortably - it doesn't feel large or awkward or too heavy to hold. (I wasn't sure about this b/c it was the one camera I was considering that I was never able to actually \"touch\" in real life). The menu is easy to read and the placement of the controls make sense. The menu layout is great - it has pages to each menu as opposed to a long list to scroll down through. You can see the options at a glance. The video mode is more than adequate. Live view for picture-taking lags a bit, but with a DSLR, it's so much easier to just use the optical viewfinder. Probably a beginner thing to say, but I like how the card slot is independent from the battery slot. I've taken 1600+ photos on the batteries that came with the camera and they're still going. The flash fills a large room and the camera can handle low-light well (but need a steady hand!) As a beginner, this camera has been great to learn on and I know it can do so much more than I am capable of at the moment. I look forward to growing with it.", "Date": "October 11, 2010"}, {"Title": "Pentax K-x", "Author": "Gary \"Gary\"", "ReviewID": "RQK1ZTHA08XPH", "Overall": "5.0", "Content": "I bought this as a back up for the K-7. I shoot wildlife only. I know nothing about any other photography. But i find myself reaching for this sometimes. It is really an excellent camera for the price. I also want to comment on the excellent sensor in the camera. It is better than my K-7 at hight ISO settings. Which is very important to me. Very good product for the price.", "Date": "July 30, 2010"}, {"Title": "Fabulous DSLR for anyone!!", "Author": "Jennifer \"JennJenn Bo Benn\"", "ReviewID": "R3AAWPF0JLPUOD", "Overall": "5.0", "Content": "I have had the chance to try several brands of DSLR's (Nikon, Canon, Olympus) and as they all have great qualities in each, I have found that the Pentax Kx has all that I could need and ever want in a camera at this time. I say 'at this' time because as my photography grows so will my needs. The Pentax Kx is super light weight and fits the hand so nicely for one hand shooting. It snaps pics in a jiff with great clarity and gives you that instant gratification.The only con I have found is it is a bit on the noisy side. This really only matters of you are trying to sneak up on sleeping subjects like cats, the focus and shutter might disturb them. But seriously, that is the only con I have found in the month and half of owning this camera. I use my camera EVERYDAY and was concerned about battery usage. I was afraid that I would be purchasing batteries constantly but have found it to be quite the opposite. I only recently had to change the batteries that came with the camera and that was after snapping almost 2000 shots and leaving it on for periods of time. Oops.The kit lens is great and gives such amazing clarity. I have pushed the lens' limits and have not been disappointed, but that also goes with Pentax being a top notch product. I think one of the main reasons I went with this model is the fact that I can use my old Pentax SLR lenses. Bonus!I also recently purchased some budget lenses by Tamron and although in the product description it mentions pretty much every Pentax model BUT the Kx, I took a chance and purchased them any ways and found that it does fit and works just dandy. That's a review for another time.Oh and I can't forget about my two favourite features, the Digital Filters and the HD Video capability. You can snap all the pics you want then while viewing them on the LCD you can go into the menu options and add a digital filter such as \"Toy Camera\", \"Retro\", \"High Contrast\", \"Extract Colour\", \"Soft\", \"Starburst\", and my personal favourite, \"Fish Eye\". You can also create your own custom filter and adjust the intensity of the previous mentioned ones to your desire. Seriously, awesome!The HD Video is a great feature that impressed me the first time I tested it. Compared to my other (older) video recorders, the sound and video clarity is immediately noticable. It's such a nice bonus to be able to capture both photos and video with a turn of a dial.So overall the Pentax kx camera is the best purchase I  have made in a long long time and if you are debating to purchase this or not, I say go for it! You won't be disappointed.", "Date": "June 25, 2010"}, {"Title": "K-x vs K100d", "Author": "Warren Steffey", "ReviewID": "R3A57O5FZZCZN4", "Overall": "4.0", "Content": "I have used a K100d for several years and been very happy with the camera.  I wanted to upgrade to more pixels and faster burst speed, but did not want to obsolete the lens, flash and other accessories I had accumulated.  I initially considered the K200d, but at $700 - $750, it did not seem to be a good value. At $470 at Amazon, the K-x was a very good value. There are many full reviews on the web, I'll address only the \"negatives\" these reviews mention.I initially had two worries, the lack of a focus indicator in the viewfinder, and reported \"soft\" images by one trusted reviewer.  It turns out that the lack of a focus indicator is not the problem I thought it might be. I'd like to have one, but I can live without it. JPEG images right from the camera might be subjectively a little soft, but I have not compared the two cameras side by side with the same lens. In any event, I believe any photo good enough to show people is worth a minute or two on Photoshop.  After the routine sharpening I don't see any softness.The K-x is smaller than the K200d. It is still easy to grip, but I think I like the larger camera body anyway. I use my Sigma 70-300 almost all the time, and a lens this large offsets the value of a smaller body. If I used a more compact lens the smaller body size might be a nice feature.The camera uses AA batteries. I used rechargeables in the K100, and planned to use them in K-x as well. The lithium batteries that came with the camera have already taken 1,500 photos and the battery meter has not moved off \"full\".  I purchased 3 sets (12 batteries) of \"ultimate\" lithiums at Sam's Club for $21.  The shelf life is 15 years.  If I can get 4,500 photos for $21 I might not bother with rechargeables.I do not use \"automatic\", but also do not use a lot in the camera's built in features. Most of my settings are still default, although I have experimented with adustments to contrast and \"dynamic range\". I have not even tried live view or video experimentally.  Most of my subjects are horses and cats.  Their attention span is measure in fractions of seconds, and they will never pose, and rarely stand still once you point a camera in their direction. I like to concentrate on the subject, composition, background etc and strive for a usable image I can clean up in Photoshop. I still get a lot of full-sun pictures with blown out highlights and very dark shadows, but this does not seem to any worse than most digital cameras.You can see samples at \"[...]\" if you like", "Date": "April 16, 2010"}, {"Title": "Excellent Camera", "Author": "C", "ReviewID": "R3HTC5VDF3CM4H", "Overall": "5.0", "Content": "This camera has been easy to use from day one.  It takes excellent pictures.  I had some trouble using the flash indoors.  The pictures were to bright.  Then I started using the Tv selection on the dial with a setting of 1/60.  I use this with ISO 200 or 400.  Indoor flash pictures are now also excellent.  The live view focus is slow but I read that most(maybe all) DLSRs with live view have some problems.  I just don't use it. I considered myself an average amature photographer.  I like the auto settings.  I mainly just vary the ISO and White Balance to suite my needs.I highly recommend this camera to others.", "Date": "April 3, 2010"}, {"Title": "Great value for money", "Author": "Nageshwara Rao \"nagtmk\"", "ReviewID": "RF85NX62I0FMT", "Overall": "5.0", "Content": "Pros:Excellent value for money.Huge array of in-camera digital filters.2 modes of RAW.Compatible with wide range of lenses.720P video capture.Good auto focus.Body-built shake reduction system. Easy availability of AA batteries.One of the smallest entry level DSLR in the market.Large ISO range from 100 to 12800 (Excellent noise reduction system).Superb in-camera editing features!Available in vibrant colors!Cons:Very slow auto focus in Live View mode.It is 4 days since I started using the camera. I will update more in the coming days.", "Date": "February 4, 2010"}, {"Title": "BUYER BEWARE!", "Author": "Charles R. Cherry", "ReviewID": "RS2TO13NK1XOY", "Overall": "1.0", "Content": "DO NOT PURCHASE A CAMERA FROM THIS COMPANY.I have a Pentax K-x that seemed to work great, but it went through batteries (AA) like nobody's business. Then I found out that there was a firmware update available.I followed the support website's instructions for applying the update TO THE LETTER. The firmware update turned my camera into a brick.Calling Ricoh support was no help. It was MY FAULT for bricking my camera. I didn't have to apply the firmware update. Since I chose to do that, Ricoh has no liability in the matter.Of course, the only way to fix the camera is to box it up and ship it to them, at MY EXPENSE. Then they will fix it. Again, at MY EXPENSE.PURCHASE A CAMERA FROM THIS COMPANY AT YOUR OWN RISK. If the software craps out on you, it's all your fault.", "Date": "November 26, 2013"}, {"Title": "Why Did I Choose Pentax K-x Over Canon 500D And Nikon D3100?", "Author": "R. Gandhi \"RonakG\"", "ReviewID": "R2YC0VI6W9LDCZ", "Overall": "5.0", "Content": "I bought my first DSLR 3 weeks back.  And to surprise to a lot of people, it is a Pentax K-x.  I chose to go with Pentax K-x over Nikon D3100 and Canon 500D.  I get asked \"WHY Pentax\" many times. Well, modern-day cameras are very much advanced and are very capable.  All are so close in terms of IQ that it is difficult to decide on one.  Because of this, we need to consider other aspects of them to come to a conclusion.So let's begin -* In-body image stabilization - Pentax offers in-body image stabilization that both Canon and Nikon don't.  Pentax has implemented image stabilization in the camera body by using sensor shift mechanism.  The sensor shifts itself (kind of vibrates) at a very fast rate to compensate with the camera shake induced by shaky hands of the photographer.  Main advantage of in-body image stabilization is - well, it is in body.  So, ANY lens you mount on the camera becomes stabilized by default. In contrast, Canon and Nikon prefer image stabilization in lenses, which makes the lenses bigger and of course expensive.* Ergonomics - My Pentax K-x just feels right in my hands.  All the controls are at the right place.  The body is smallest of the lot with just right amount of weight. The Canon was the worst of the lot with the Nikon coming very close to the Pentax.* Low light IQ - This is where Pentax scores most.  This has become Pentax's USP since K-x, K-5 and now K-r.  Pentax takes a conservative approach towards noise reduction to retain details in photos.  This enables us to process the image the way we want. The noise reduction software are getting better and better day by day, so I'd prefer to do it in the computer with all the processing power and intelligence than in camera.* Fastest among the lot - The K-x can shoot at 4.7 frames per second.  This is the fastest burst shooting rate among the three cameras.  Though I won't need such high-speed shooting everyday, it's a nice to have feature.Backward compatibility with older glass - Pentax has maintained backward compatibility with all old lenses they have ever made.  So I can use ANY Pentax lens EVER made with my K-x.  Some of the prime manual focus lenses are very cheap in second-hand market. Though Canon and Nikon both have a larger set of lenses on offer, Pentax gives me way more choices than I will ever buy.Largest and brightest view-finder* Bang for the buck - Have you ever seen a Pentax advertisement on TV or a hoarding on a road?  I haven't, because Pentax doesn't spend much on marketing.  They are a very small company focused on R&D; behind their products.  This enables them to price their products lower compared to Canon and Nikon.  I bought my K-x along with 18-55mm and 55-300mm lenses for USD 629.  In this amount with Canon I would have only got the body, or with Nikon one kit lens with the body.One negative point for Pentax is their absence in retail outlets.  Not sure why but Pentax don't stock enough cameras, lenses and accessories in retail electronic stores.  This keeps prospective customers away from trying a Pentax camera in the store.  They don't have good service network too in most of the countries.  In India, they don't have any presence at all. So if this matters to you, you may want to be safe and go with either of Canon or Nikon.The main point going against the Nikon D3100 was the stripped down body.  Nikon has removed the focus motor from the D3100, so the lens has to have a focus motor to auto focus.  It also doesn't have the bracketing feature, which is considered very basic and very useful for HDR imaging.  Nikon tends to do such things with their entry-level DLSRs.The main point going against the Canon was the price and how quickly they obsolete camera bodies.  500D is now 2 generations old camera as 550D is in market since few months now and 600D already been announced.If I had a little more budget, I would have gone for the Pentax K-r.  It is new and improved K-x with things like -* Dedicated AF assist lamp.  It helps the camera in focusing in very low light (no entry-level DSLR has this).* Visible focus points in view-finder (most K-x reviews rant about this point)* 3 inch LCD with 921k pixels* Even higher shooting rate of 6 fpsSo there I have it, the Pentax K-x.", "Date": "May 16, 2013"}, {"Title": "Just an Amazing camera.", "Author": "Simon", "ReviewID": "R35X89MBWZ1084", "Overall": "5.0", "Content": "This camera is simply awesome. I used to be a Nikon 35mm SLR fan and user.But Pentax has proven to be the best quality out there right now.The image quality of this camera is just amazing and sharp,ease of use right out of the box. I highly recommend this camera ,it is the best that I have tested for three months and it beats canon and Nikon for its class. Very satisfied and great price.Will add couple of pictures for review.", "Date": "October 17, 2010"}, {"Title": "Very impressed so far", "Author": "Ryan S.", "ReviewID": "R3SNDAZW2TIXA3", "Overall": "5.0", "Content": "Bought this after a ton of research.  So far I'm very impressed with picture quality, ease of use and overall value.  My \"camera friends\" (e.g., those who work with cameras for a living) were impressed with the camera given its price.It takes a little work, but you can get truly unbelievable pictures out of this thing.  Coming from a Canon point-and-shoot, it's a night and day difference.", "Date": "October 3, 2010"}, {"Title": "Incredible detail", "Author": "YouReview", "ReviewID": "RLXACQ6QR6YAW", "Overall": "5.0", "Content": "I have nothing but praise for this camera.  It is fast with great color and detail.  If you've been looking for an entry level SLR, this is the one.", "Date": "April 15, 2010"}, {"Title": "Very good starter DSLR", "Author": "Amazon Customer", "ReviewID": "R1A9CEP82QZXHS", "Overall": "5.0", "Content": "I was looking for my first DSLR and at $470 shipped from Amazon, it was a low risk way to try it out.I shoot several thousand pictures during my trip to London and Paris and results look really good.I mostly used auto exposure bracketing at +-3 EV, with intention of converting the bracketed images to HDR images. I processed some of them already and results look good.Picture quality at ISO 6400 is comparable to picture quality of my other P&Ss; at ISO 400. So the Panasonic FZ28 had to go and I will keep Canon SD1100 only because of its tiny size and because with CHDK hack I can do things which no other camera can do. If it was only possible to have something similar to CHDK for K-X!", "Date": "March 20, 2010"}, {"Title": "Entry Level?!? Whatever", "Author": "I. King \"Renie\"", "ReviewID": "R9I0ZPS2TP2BH", "Overall": "5.0", "Content": "I bought this about two months ago and have been figuring it out ever since.  I haven't seriously handled an SLR since the late 80s/early 90s when I had a Minolta Maxxum.  Real life and raising a family made me put my passion for photography on the back burner.It's my passion, so I knew I wanted to get into it again, but the prices of the cameras were astronomical for me until I saw this camera. OMG.Okay, so my old Ricoh (70s) and the Minolta were fine cameras.  But they didn't require a degree to figure out all of the controls.  I'm a pretty quick study, so I had them up and going in no time. The only thing that kept me from doing more was, of course, the price of film.  Now that film is not in the equation, I'm shooting rolls and rolls and loving it. Each shot teaches me a little more and I'm getting better and better.This little camera is the bomb.  I purchased this and the Tamron AF 70-300mm f/4.0-5.6 Di LD Macro Zoom Lens for Pentax Digital SLR Cameras (it was cheaper separately at the time I purchased them rather than the bundle), and I haven't regretted it even for a microsecond.  While the controls on this (and every DSLR) are a little daunting, I have managed to crank out some photos that amaze me.  I've Photoshopped a few choice ones and they are, in a word, stunning.The two things I'm loving most about this camera are the low-light and the macro features.  I've been able to take awesome shots in places that are poorly but beautifully lit (hey! this is Vegas!).  I've gotten **this close** to bees and flowers and taken gorgeous shots.  I can't believe the quality.The cons are that for some reason, it is reluctant to focus in low-light situations when the LV is running.  And I haven't upgraded the firmware.  One day.  The other con is that although I've used the video function a couple of times ... it leaves a little to be desired.  Of course, my *real* video camera is a Canon DV, and gives almost broadcast-quality footage.  This has a little ways to go to equal that camera, but it's okay in a pinch.  The video feature also sucks battery power big time.So purchase it for the stills, not for the video.This camera is a treasure, and I'm so glad that the quality and price have been able to resurrect my photography passion without killing my budget. You absolutely cannot go wrong with this camera.  By the way, I purchased black because I think the colors are, well, *hokey.*Update 10/2010I'm updating this review because I want to let folks know that it's still the most amazing camera I've ever owned.  Disclosure:  New iMac with Photoshop.  Therefore, decided advantage.This little camera continues to amaze me.  I figured out (by reading the manual) how to do HDR photos, and the rest is history.  My photos are posted on my employer's intranet, and I get compliments every day.  It's lightweight, easy to use, and a wonderful possession.  I gave this five stars when I'd only had it a couple of months, and several months later, I wish I could give it ten.  It doesn't have the controls and screens that you'll see on the higher end Nikons and Canons, but the photos are the final story.  And mine are fabulous. And I still love the camera.", "Date": "May 5, 2010"}, {"Title": "Great camera for the price!!!", "Author": "Mac Geek \"Mike\"", "ReviewID": "R3PL0J1LVD8PXZ", "Overall": "5.0", "Content": "I have the Pentax K2000 which is a NO nonsense No frills DSLR camera. It takes outstanding photos!!!!...That's what it was made for!...No video...Just photos!!!...I made the upgrade to the new Pentax KX about a month ago & couldn't be more pleased!!!...This DOES do video!!!...720p High definition!...This has Live View & Orientation Sensor!...Still....like my K2000...it does what it actually made for....It takes EXCELLENT photos!!!!....I always am sort of skeptical when a camera has too many \"Bells & Whistles\"....I always think of that as a gimmick & that it will take away from the ability to shoot good photos.  That's why I originally bought my K2000 last year. Because it was designed to be a VERY nice DSLR camera made for taking photos...Which it does VERY well...After reading a LOT a reviews...I decided to buy my KX...AGAIN...I am very PLEASED....I am more concerned about quality photos than anything else on a digital camera & it takes very nice photos!...Of course, if you are a \"novice\", you will have to learn about different settings on a DSLR to get different results...I never really used the video on any of my cameras....I have a camcorder for that...but....I must say that I am impressed by the video on the KX also...I bought this on AMAZON for a very good price...I've tried other \"Name Brand\" cameras costing up to $250.00 more. I am VERY glad that I stuck with Pentax!!!!!!", "Date": "February 1, 2010"}, {"Title": "Awesome!  Great for a 1st timer!", "Author": "Niki", "ReviewID": "R2SBCSC1ABWLBX", "Overall": "5.0", "Content": "I love this camera.  I am not a professional, but bought this learn the art of being a photog.  I have taken amazing shots and have learned a lot.  It is fun to play with all the different settings.  It is not a bulky camera which is great as I have small hands and I can hold with one hand.  I have even taken pics using a tripod with excellent quality.", "Date": "September 17, 2010"}, {"Title": "Pentax K-x", "Author": "Bradley Jones \"Bradley\"", "ReviewID": "R37ZIWM7S03C20", "Overall": "4.0", "Content": "I was in the market to find the cheapest price DSLR that still shot HD video. This met the standards and I am very happy with the purchase. The lenses for it are on ebay at reasonable prices and Pentax on-line customer support is fantastic. They all so have a great forums section that I frequent with great tricks and tips. This camera has more features that I would ever use but I'm glad that they're their. I will be a loyal Pentax customer for life.If you have the extra money, which I didn't, I would have bought the K-7. But you can't beat the price for quality for this camera.", "Date": "June 28, 2010"}, {"Title": "Easily the greatest dSLR for a serious enthusiast", "Author": "Teapot Tales", "ReviewID": "R3TJ2IUG5JT4XA", "Overall": "5.0", "Content": "This camera may be about the best choice for a super-zoom sufferer who is finally ready to give up on limited optics and tiny point-and-shoot sensors and wants to explore what a real digital camera can do. If you do not feel like spending thousands of $$$ on your dSLR setup, then this camera is a great choice. You might just want to buy a more flexible lens, such as Sigma 18-200mm for Pentax (or anything similar according to your preference and budget) as the kit lenses are not as multifunctional as this Sigma. You might want to buy just the body and then choose your optics.I think that the 4 AA battery power source is a great choice and a money-saver, but you have to buy good quality batteries (lithium or NiMH) in order to avoid any disappointment that is inevitable when you try to use cheap Alkalines in a high-drain device such as a full-featured digital camera. I use NiMH batteries from respectable manufacturers (Sanyo, MAHA, Lenmar) and they work just fine.My Pentax K-x went through spontaneous photo shoots, low-light long distance photo shoots, a vacation in a mountainous wilderness and I do not see any negative impact upon its performance or looks. Just make sure that you use the proper lens wiping sheets with Methanol to clean the lenses and filters. Do use a good UV filter at all times to keep the lenses our of trouble. Make sure that you change your lens in a clean environment or at least, do it quickly and use a body cap in the process.Most importantly, though, once you get your K-x, download and install the latest Firmware update. Doing so can make your photo shooting experience somewhat better.", "Date": "August 29, 2010"}, {"Title": "WOW! What a treat!", "Author": "Zhou Yu \"SL Trojan\"", "ReviewID": "R2LCNT6CCKP3QG", "Overall": "5.0", "Content": "I have been a Pentax user for as long as I can remember photography. My last Pentax DSLR is a K10D. What an advancement! Quieter shutter, faster focusing, more responsive, much better high ISO image quality, and much more compact. LOWER prices! What a deal!Any downside? If I can think of any, here are some. Materials could be stronger. Metal bottom would be better. Would be better to have a scroll wheel in the front.A great all in all camera.", "Date": "May 13, 2010"}, {"Title": "2nd Pentax DSLR", "Author": "George M. Bosela", "ReviewID": "R15YMSZKBHET72", "Overall": "4.0", "Content": "I have owned a Pentax K100D for over three years and acquired several additional lenses.  Building on my earlier investments was important to me.  While I have not really explored all the new features of my K-x, these are my initial reactions.The Kx is marginally smaller.One of the features that I liked in the K100D, a separate settings display panel has been removed.  It did not take long to get use to activating a settings display on the viewing display panel.  My only concern is the additional drain this may create on the batteries.The battery utilization seems improved.  I transferred two sets of my rechargeable  AA batteries to the K-x and I seem to be getting more pictures on each charge than I had been with the K100D.Since I shoot all my pictures in the RAW format; I was worried about the storage demands imposed by the 12 megapixel images of the K-x compared the 6 megapixel images of the K100D.  It has turned out that there is much more variation in the size of the Pentax RAW formatted images on the K-x.  As a result the RAW files created by the K-x up to this point range between 12 and 19 megabytes.  The average is about 15 megabytes.  With the K100D most images were very close to 10 megabytes in size.  If this holds up I'm getting images that have twice the resolution with only a 50% increase in file size.I was also pleasantly surprised that the programs that I use to process my digital image (Bibble 5 and Paint Shop Pro X2) did not bog down when handling the larger files.  If there is any slow down in processing time associated with the larger images, it has seemed negligible so far.I've had no problem in using my third party lenses with the new camera.After only a couple hundred images on the K-x, I am satisfied that I has met all the expectations that I had when I purchased it.", "Date": "April 15, 2010"}, {"Title": "Surprising High ISO pics and JPEG engine", "Author": "Concerned Cit \"Concerned Cit.\"", "ReviewID": "RCEBJRTE68C3H", "Overall": "4.0", "Content": "from Dpreview linked here at amazon.com on the Pentax K-x: \"Its high ISO JPEGs are possibly the best of all current DSLRs with an APS-C size sensor; they certainly beat any of its direct competitors.\"\"With this performance the K-x easily beats most other APS-C cameras whenshooting JPEGs, including much more expensive models. If you need better low light performance than this, going full-frame is pretty much your only option.\"Of course full frame entails bigger, heavier and more expensive cameras and lenses.BTW, new firmware update resolves any battery issues :-)", "Date": "December 26, 2009"}, {"Title": "Excellent Entry level DSLR", "Author": "Brian Leslie", "ReviewID": "R20L7Z0BNXE1U2", "Overall": "5.0", "Content": "This is my first DSLR and while there are a few bells and whistle's I would have liked to seen on it, I am very happy with the camera. It takes fantastic photos. Videos leave a bit to be desired and are limited to 30 seconds.", "Date": "February 24, 2013"}, {"Title": "Excellent Camera!", "Author": "Madeline Taylor", "ReviewID": "RR00O33WMU6B4", "Overall": "5.0", "Content": "I did a lot of research before making my purchase. For an entry level DSLR, this is a great camera. Would highly recommend!", "Date": "January 21, 2013"}, {"Title": "Video camera", "Author": "Jp", "ReviewID": "R37RY8AYC56B1I", "Overall": "5.0", "Content": "If you are looking for a camera that you can use for filmmaking. then buy this one!I was in the same rut as you (if you are looking to make movies), and I did my research and this camera is amazing at taking videoand the fact that you can change lenses makes it even better! the quality and wide range of lenses make a perfect buy for its pricecheck out this video I made with the camera![...]", "Date": "July 31, 2012"}, {"Title": "Pentax K-x Great for Astrophotography", "Author": "Mike Cain", "ReviewID": "R2D0IRVTD86DJN", "Overall": "5.0", "Content": "I have been using the Pentax K-x for astrophotography. Most of the images in the following link were combinations of 30sec exposures at iso 12800.  I used Astroart to combine and enhance all the images. Excellent camera. Low noise at low light levels at high iso.[...]Mike Cain", "Date": "July 8, 2012"}, {"Title": "Solid performer, great entry-level DSLR", "Author": "Elijah, \"God bless!!!\"", "ReviewID": "R21O56DOKM0XTL", "Overall": "5.0", "Content": "I have purchased my K-x about 1 yr ago with 18-55 and 55-300 kit lenses and I was glad that I got a 2-lens kit.  I like the option of having the zoom lens and do use it quite often for outdoors and indoors/church. This was my first DSLR and my previous camera was Lumix FZ28, which is a nice point and shoot super zoom with all manual controls.I like the option of adding K-mount manual lenses and being able to use them with build-in image-stabilizer. I have added a 50mm M F1.7 lens and love the results from a $50 lens. The image quality of high ISO is amazing for its class and price.I have uploaded few images to amazon under K-x.One thing that I would have liked to have is focus point/s in viewfinder to show where the camera is focusing, but it's not a big deal.I use it with Sanyo Eneloop rechargeable batteries and they last forever. I have an extra set of plain AA for emergencies in my bag, but only used them 1-2 times.Overall I am very happy with my purchase.Elijah", "Date": "March 21, 2012"}, {"Title": "My second DLSR, great one!!", "Author": "J. Wu", "ReviewID": "R31X9X62X1N8CO", "Overall": "4.0", "Content": "I had a nikon D60 before getting this camera.D60 is a great camera but what I hate about it is that:1,no auto focus motor build in, greatly limited lens choice;2,no build in stabilization, have to relied on lens, greatly limited lens choice again;3,bad iso performance, not so usable after iso 800;4,no video function, I want to record happy family moment w/o buying another portable camcorder again.I got myself a k-x, and it solve all the above problems, and I even got extras wit it:1,HDR function which is great and fun to use;2,able to use all the cheap but great old film lens, just manually;3,iso performance actually exceeded my expectation, high iso is not a pain anymore, but a joy to use;4,more color available, I got myself a white version, it is very bright and attractive.However, there are defeats to the k-x, but not critical: (and that's why I gave it a 4 stars but not 5)1,battery reading isn't reliable, it shows me one pair of battery(in full charge)half but another pair full;got away with it easily, simply bring yourself 2 or 3 sets of batteries, and swap them when the camera goes off;2,no focus point confirmation in viewfinder; very critical to some people but I use center point to focus and composite anyways, plus I installed split focusing screen, make the problem even tinnier;3,focus and shutter is quite loud, this might not be ok to some people but I actually like it that way, it gives me a \"sturdy\" feeling.About image quality and controls and build quality, everyone had mentioned it and there is no point for me to repeat again.As conclusion, this is the cheapest entry level dslr out there with way more than entry level functions.If you are new to dslr world, and would like a entry dslr that accomplish many mid-level functions in a fairly low price tag, the k-x is a no brainier.I got myself a kit of 18-55mm 55-300mm for $650 in 4/2011 just for your comparison, I think their price raised a bit now.", "Date": "July 13, 2011"}, {"Title": "$500 down the drain", "Author": "A. Rodriguez \"designer\"", "ReviewID": "R22ZLM2WJP6QIL", "Overall": "1.0", "Content": "I sent my camera in for repair after maybe 500 shots. Battery life was terrible, a fresh set of batteries would last only a few hours. When I would remove them, they would be incredibly hot. I ran into a friend who purchased the exact same camera and found that  he didn't have this problem. My camera was still under warranty, so I decided to send it in for repairShortly after, I received and email saying that the repair wasn't going to be covered by the warranty. Pentax concluded that I improperly used the batteries (leaving them in the camera for about a few weeks).  I contested that something was wrong with the camera when I purchased it.Anyways I talked to someone at Pentax and they said they would talk to the management to see if they would discount the repair. I never heard back from them. After 3 weeks, I called again and got the same story, that that they would not even consider discounting the repair.It's been a big disappointment... I can't really justify spending another $250 to repair a $500 camera. When it did work, it worked well - got a COUPLE of great photos out of it.From my experience, I feel pretty yanked around... I am out $500 and no longer have a camera. I'll never buy another Pentax again.", "Date": "May 26, 2011"}, {"Title": "By Far The Best Camera I've Owned", "Author": "Jeffrey C. Dennison \"Old Banjo Picker\"", "ReviewID": "R3C5CCOEALY274", "Overall": "5.0", "Content": "I've had the K-x for three months now and have taken thousands of stills and a dozen movies all with fantastic results.  I'm 52 years old and have had many cameras over the years.  But, this one tops them all for picture quality and speed and ease of use.  I've been looking for about 5 years for a camera that can perform well in multiple roles.  I finally found it in the K-x.  This camera makes easy \"snapshots\" as well as any type of \"artistic\" photographs my amateur skills can handle.  It also makes wonderful movies better than any of the camcorders I've owned.  The included manual is a great resource for showing you HOW to do something, but you'll want another resource for helping you discover WHAT to do.  One suggestion, purchase as large and fast an SD card as you can afford.  I bought the 32gig ultimate which works wonderfully and will hold several hours of video.  A word about Amazon.  I hunted for the best deal on the K-x for several weeks and could find no source better than Amazon who also threw in a free filter in the deal that I always leave on the lens.", "Date": "February 13, 2011"}, {"Title": "Best Camera in it's range!", "Author": "Stephen J. Price", "ReviewID": "R1CHPUSLA0TUP5", "Overall": "5.0", "Content": "the K-x in comparison to the other \"starting out\" cameras that the other co. offer is way better than one could ask for!  I'm in a photojournalism class and the school offers canon rebel's... that's nice but pentax offers a clearer quality par none. Nikon is not even in the race. The feature and size of this camera make it easy for anyone to use and give you the same feeling I do when I leave the house. \"I need to grab my Pentax before we leave.\"", "Date": "January 29, 2011"}, {"Title": "Pentax K-x", "Author": "Bill", "ReviewID": "R2NIDXI505ER3T", "Overall": "4.0", "Content": "Nice camera for a really good price. I have an issue with the camera information, Pentax older K-mount lenses will work with this camera but, and this is a big but, you cannot use an old Ricoh lense on this camera or it will jam! Fortunately there are a few websites that can help you with removing the lense and can help you determine what brand of lense you have.That moment when the camera is new and the lense is stuck on it is really a heart stopper!!! LOLOtherwise I truely enjoy using the camera and as I said it is a really good value.", "Date": "December 28, 2010"}, {"Title": "Great, not perfect", "Author": null, "ReviewID": "RBWOAO5NXET97", "Overall": "4.0", "Content": "Pros: Excellent battery life with lithium, nice low-light quality, hd video, quick burst shooting, zippy autofocus, great shadow range, feels solidCons: Not much RAW headroom for clipped highlights, inconsistent multi metering (center-weight is better), AF points not displayed in viewfinder, kit lens could be sharper (not really complaining though), audio could be betterReview: The Pentax K-x is my first DSLR as I have recently upgraded from an old Kodak z8612 megazoom. Almost everything about this DSLR is better than my old megazoom, but it is not completely perfect.Autofocus is quick and accurate, although it may occasionally hunt in really low light. Contrast detect AF in Live View is a different story though-unbelievably slow. However this is not a problem for me, so it is not influencing my rating of this product.The camera is a bit compact compared to the Canon Rebel T1i/500D I tested out at the store, but it handles nicely, the handgrip is (for this price segment) large and comfortable, and while there are not all that many external controls, the button placement is very good. The power switch, like most consumer DSLRs, is located in a ring around the shutter button. This is the same spot as the zoom toggle on my old megazoom, so sometimes I will instinctively flip the switch and end up turning the camera off.Performance overall seemed very good. All the buttons are nicely responsive, burst shooting is great with a good memory card (though the buffer fills a little fast), and the camera is ready to shoot practically instantly after I flip the power switch.The provided 18-55mm f3.5-5.6 kit lens is usually sharp enough, and the zoom barrel turns smoothly. However, unless I stop down to f8, the corners can be noticeably soft. This isn't a real bad problem, but may be if you need sharp corners on your kit lens. The bokeh on the 18-55 lens is very nice.Low light shooting was a key factor in my decision to purchase this camera, and it did not disappoint. There is a good deal of luminance noise (\"grain\") in high ISO JPEG shots, but not much color noise and good detail retention.In the limited testing I was able to get done in movie mode, I was pleasantly surprised by the picture quality of the HD video, but audio could be better. Also AF during video is very slow and the noise is picked up by the mic.Dynamic range was a bit of a double-edged sword for me- excellent shadow range, but highlight range was a little disappointing. RAW headroom is limited. However, activating Highlight Priority will give you an extra stop of highlight range without much cost in performance or added noise, so this may not be much of an issue.The exposure metering was usually pretty good, but the multi metering was a bit inconsistent-producing a washed out shot, then a shot that required +3 stops of post-capture exposure compensation. Center-weighted average worked better for me, especially doing macro shots.Overall this DSLR is not perfect, nor as good as models a price class up, but will give you great low light quality and good performance in an inexpensive bundle. Overall not perfect, but a great DSLR to upgrade from point and shoot.", "Date": "December 20, 2010"}, {"Title": "Amazing little camera....", "Author": "Sahil Patel", "ReviewID": "R32DRM7O99PNXL", "Overall": "5.0", "Content": "This is amazing camera the price to feature ratio can not be beat.... I compared to Nikon D5000, Canon T1i, Olympus E620 before making my decision.... this is the best camera hands down... it blows the competition out of the water..I will attempt to compare this against the legendary Nikon D90... note that Nikon D90 is almost twice the cost of a regular Pentax K-x kit1) D90 does 3200 ISO, expanded to 6400, K-x does 6400 ISO expanded to 12800.2) K-x does 1/6000 second shutter.. D90 1/4000.3) D90 4.5 frames per second.. K-x 4.74) K-x has built in image stabilization, lens based in D90 (expensive lenses)5) K-x does HDR. D90 doesn't .6) HD video? K-x does it, same resolution.7) D90 has larger 3inch screen with higher resolution than K-x's 2.7 inch screen.8) K-x doesn't show focusing points in view finder, this is probably the biggest omission.", "Date": "November 23, 2010"}, {"Title": "Wow! What a great Camera!,", "Author": "Best Items", "ReviewID": "R3APHUWIT82JKG", "Overall": "5.0", "Content": "This is my first SLR camera. It takes fantastic pictures and has more options and tweaks than you could ever want. Its very easy to use right out of the box even for my wife, yet if you want to tweak your photos and get into it everything SLR offers, the options are there and then some.", "Date": "September 5, 2010"}, {"Title": "Excellent camera, slow & inaccurate autofocus", "Author": "XNOR", "ReviewID": "R2KWP56G6SVT4E", "Overall": "4.0", "Content": "This will be a short and brief review:Pros: * Excellent super sharp pictures * Compact, feels tough and good handlingCons * Slow and inaccurate autofocus - extremely frustrating at timesThis is my first DSLR after having used Canon Digital Film SLR.  The biggest flow that I find in the Pentax k-X with the kit lens is that the autofocus speed is pathetic and also inaccurate.Was shooting pictures of my daughter at a nearby park and was having an extremely tough time in getting the lens to focus right.  In the Canon Film SLR however the autofocus was super fast and very accurate.  I tried this at various other occasions and noticed similar lag in autofocus - ended up using the manual focus for most shotsBut the quality of the pictures were simply amazing - just blew me away.  If you are not too concerned about the autofocus - this is an excellent camera - else I would stay away.  I returned my Pentax k-X and still waiting what to do next.After some online research - finding that the slow focus is a common problem among all pentax camera/lens", "Date": "October 18, 2010"}, {"Title": "Very good camera", "Author": "Royce E. Hall", "ReviewID": "R1BBTKLATODLPK", "Overall": "5.0", "Content": "I have been very happy with this camera. It is my first dslr, and I have been happy with the features and the quality of picture. The only drawback is that with the auto-focus feature, the display does not indicate what the camera is focusing on. The result is that the camera may choose to focus on an object I am not trying to highlight. This can be avoided by using the manual focus of course.", "Date": "May 31, 2014"}, {"Title": "Great Shape and Sent Fast!", "Author": "Mieren", "ReviewID": "R1WN2HAMROEE2B", "Overall": "5.0", "Content": "I contacted this seller because I wanted to get this camera in time for my vacation. The seller was super helpful and in great communication. My camera got sent pronto!!It came in even better condition than I anticipated. I pulled it out of the box and you could hardly tell it had ever been used. It came with all the accoutrements plus a camera bag and a manual that hadn't been shown in the photos.I've only taken about half a dozen pics so far, but everything seems to be working great. I sure do appreciate how easy this seller was to work with! Thanks!! :D", "Date": "May 8, 2014"}, {"Title": "Finally the camera I needed.", "Author": "Ronald Frazier", "ReviewID": "RYC27JLEDYQSW", "Overall": "5.0", "Content": "This was an upgrade for me. Semi-professional photographer. Learning cure average. Very happy with this. I had a 35mm Pentax and equipment from the 80s but hadnt used it in a decade. Supposedly you can use you old lenses but I never could figure out the trick.", "Date": "January 27, 2014"}, {"Title": "Never leave home without it", "Author": "Greystoke \"Greystoke, the wordsmith\"", "ReviewID": "R3RX2IPV8010O6", "Overall": "5.0", "Content": "As a diehard Pentaxian, and with a broken KX, only one choice remained, this camera was in excellent condition with original packaging.", "Date": "January 5, 2014"}, {"Title": "It is light weight and does everything quite good.", "Author": "Leon Wechsler \"LW\"", "ReviewID": "R3RAHP9LUTCSZ1", "Overall": "4.0", "Content": "It is light weight and does everything quite good.The fast sport mode is the only feature that makes this camera above average, because it takes several pictures in fast sequence and then picks up the best for you.In all other modes it is slow and you need patience.", "Date": "December 4, 2013"}, {"Title": "Great", "Author": "kenneth snarr", "ReviewID": "R3KJZLMNQWHYGC", "Overall": "5.0", "Content": "I wanted a light Pentax that would work with my old Pentax lenses for my recent vacation.  This was perfect and the pictures were awesome.", "Date": "July 29, 2013"}, {"Title": "Camera", "Author": "Dallon Darkstorm", "ReviewID": "RJD6QNUHZ4VTQ", "Overall": "5.0", "Content": "I have had this camera for a bit of time and Love it is awesome and works well. I do recommend this camera to starting people.", "Date": "May 30, 2012"}, {"Title": "muy buena camara", "Author": "marco cr", "ReviewID": "R2MEHWKSI2EMEQ", "Overall": "5.0", "Content": "Despues de probar la camara por varios dias , e visto que es muy buena camara , y me costo mucho mas barata que en mi pais.me gusta como funciona , es comoda y practica.pude conseguir un manual en español que me a ayudado a manejarla mejor .y cada dia aprendo mas sobre ella.estoy muy satisfecho con esta compra.", "Date": "September 1, 2011"}, {"Title": "Pentax k-x", "Author": "Psyche", "ReviewID": "RTIEMFZTE4B2O", "Overall": "5.0", "Content": "Aside from not knowing much about SLRs, I like this one very much. I know I have a lot to learn, but with what I do know how to do the camera performs well. It's not too complicated for a beginner like me. I'm glad I bought it!3/22/2013:Still working perfectly. I don't see any decrease in the quality of the images. It works the way I want it to and I have much more experience and couldn't ask for a better camera.", "Date": "August 2, 2011"}, {"Title": "SD Card reader problem", "Author": "Marc Cram \"Vegas Monkey\"", "ReviewID": "R1YFVF9NOUZSOV", "Overall": "2.0", "Content": "I purchased the K-x in October of 2010 and within a few months the card writer/reader inside the camera went bad. The camera would read \"Memory Card Full\" and then it writes a whole bunch of corrupt files to the card. No one at Pentax really helped me out. I had a return warranty and now have to wait months to have problem resolved.", "Date": "May 31, 2011"}, {"Title": "A camera I've been wanting for a while!", "Author": "Everardo Valencia", "ReviewID": "R1ZKEOIJIC126S", "Overall": "5.0", "Content": "For quite a while I've fantasized having a camera that can take beautiful pictures and video worthy of creating short films, and here I am holding one! I'm absolutely delighted with the quality and immensely great value of this camera. The kit lens leaves is good, but it's better to get another lens for even more stunning pictures and video! The features on this camera are in abundance; I haven't even used them all yet.The only let downs are that there is no microphone slot, it only shoots video at 24 fps and a 720 HD resolution, and that there is this occasional popping noise in the audio. The video does get grainy, but with a good wide aperture lens (like my f 1.8 50mm manual lens), the grain is greatly reduced and even gone altogether.I would not look at any other camera if you're looking for an affordable DSLR camera that can shoot 720 HD video. Buy this camera, especially if you're starting out at photography and/or semi-pro/professional video shooting!", "Date": "April 27, 2011"}, {"Title": "Pentax K-x", "Author": "Dobb", "ReviewID": "R18TI43QLX6NID", "Overall": "4.0", "Content": "Although this camera is considered an entry level DSLR camera, it has a lot of features found on more advanced cameras. Pentax does not seem to have the name recognition of a couple of the other big camera makers, but I have found this camera to be an excellent value for the price. We like this camera because your can take very good photos with the automatic setting or you can use the easy to understand menu functions to suit the situation in which you are shooting pictures. The features that were most important to us were the anti-shake control and the auto focus. Both of these are excellent on this camera. I don't use the live view to preview pictures very often, but it is nice to have this function available. The kids in motion and the continuous shooting modes have worked very well for me. Another selling point for me was that this camera uses regular lithium AAA batteries. You can always have spares without having to remember to keep a battery pack charged. I haven't yet taken any low light pictures with this camera yet so I can not comment on that aspect of its performance. I mainly use it to take pictures of my children and grandchildren. I have used this camera to freeze a baseball in flight and to capture the expressions of a 1 year old. We have also taken some very nice landscape shots form our favorite hiking trails. I have taken a video clip just because you can, but I will not rely on this camera for videos. This camera seems very intuitive to learn to use and I would recommend it to anyone looking to buy a DSLR camera. Pentax also has a website which seems to have good customer support and forums where you can get any questions answered and get tips to learn to use you  camera better.", "Date": "April 10, 2011"}, {"Title": "easy for beginners", "Author": "ingridpingrid", "ReviewID": "R2RHI8PZBNT9KX", "Overall": "4.0", "Content": "I got this camera about a month ago. I'm an absolute beginner, so can't say much about the quality of the camera. But it was really easy getting started with this camera, and I think the pictures are great. I bought a beginners guide too, and hopefully I will find the time to learn some more about photography.:-)", "Date": "March 31, 2011"}, {"Title": "Pentax K-x value for money", "Author": "Dushshantha", "ReviewID": "R1SLO40WXYQYXC", "Overall": "4.0", "Content": "Received this Camera three weeks back. Amazon service is excellant. It reached me in 6 working days (US to Sri Lanka) !Image quality of the Camera is superb. It works well with my old Pentax Lenses. Main reason for purchasing the Pentx K- x is that I have been a Pentax user for over 15 years and had 4 differant types of  lenses and was looking for a affordable DSLR compatible with those lenses. K-x was a perfect choice. Since I have not tried out much  outdor photoes with this Camera yet , I am unable to comment on other features now. Anyhow I am very satisfied with the unit. Only con is the low Battery level indication for recahrgable batterie even afer full charge.Tried with new firmware version upgrage , but no use.", "Date": "March 25, 2011"}, {"Title": "My little powerful memory creator!", "Author": "Elena", "ReviewID": "R2DL8QAL4SJ574", "Overall": "5.0", "Content": "This is so great! It's been a year since I bought this Pentax camera and I've been in love ever since. It takes great pictures even though I am a photography dummy. I still haven't started reading the instruction manual to see its best features, but even like that the pictures come out great! Highly recommend it to everybody", "Date": "March 7, 2011"}, {"Title": "Amazed, but Seriously Conflicted", "Author": "Dave", "ReviewID": "R1R0PR6CKFG1WH", "Overall": "5.0", "Content": "I picked up a K-x body with two lenses a few days ago. I previously owned a K10D also with two lenses.First off, I love the K-x. It is compact, but not toy-like. Some of the new features like in-camera HDR and of course HD video are great. And it takes ridiculously good pictures in just about any light.But all that's covered extensively in other reviews. I want to mention something that surprised me coming from the several year old K10D. The K-x does not have the TAv (Shutter/Aperture priority) mode. The closest you can get is M mode with a fixed ISO. For some reason, Auto-ISO is not available in M mode.TAv mode is one of those features that if you've used it before you most likely fell in love with, but if you skipped it you'll never notice it's gone. Basically, you get to set the shutter speed and aperture, and the camera uses the ISO (sensitivity) to correct the exposure.So why is it absent? IMHO on the K-x the TAv mode is excluded in favor of including the Scene Mode, which presumably appeals to the point and shoot crowd trying to transition to dSLR. Plus, Pentax still offers TAv mode on the more expensive K-7 and K-5.Would I have bought the K-x if I'd known TAv mode was absent? Maybe. I'm a big fan of TAv mode, and found myself using it alot. So much so that my first thought when I saw the specs for the K-x with a 12800 ISO sensitivity was how great it would be to have all that additional range in TAv. I find TAv mode so useful, I thought it was a no-brainer that it would be included. I didn't even look. And besides, the K-x has all those cool features....My recommendation is that if you are starting out in dSLR that you cut the safety net of Scene mode completely. Pick up a used K10D and learn about photography. Once you understand the relationship between shutter speed, aperture, and sensitivty try TAv mode. You'll be floored by how much creative control it gives you. And don't worry: the K10D has a \"Green\" mode that takes great pictures anytime you want a break. As a bonus the K10D also throws in weather-proofing -- so you'll be able to hone your skills in just about any circumstance.On the other hand, pick the K-x if you are drawn by the improved sensor/sensitivty/features and can live without the weather-proofing. The K-x is a remarkable camera, especially for the price. And plenty of famous photographers have done brilliant work without TAv mode, so how useful can it really be?", "Date": "March 7, 2011"}, {"Title": "I'm not a professional photographer!", "Author": "Kandelina \"Fantismo Reviewer\"", "ReviewID": "R3OWA4KJTYLI61", "Overall": "4.0", "Content": "Like the title says, I'm not a professional photographer by any means but I did do my research on what camera I wanted to buy and an online Digital Photography school aided in my decision. I absolutely love this camera, I wanted something to keep up with my now 3 year old little monster, I am aware that there are a plethora of functions that professional photographers use and like about this camera but I like the fact that I can point and shoot and the picture comes out AWESOME every time! I'm am avid scrapbooker as well and I despise blurry pics and all you parents out there can agree that when it comes tot he kiddos the chances of getting your preschooler to re-take a blurry photo are slim to none! :)In the running was the Canon EOS Rebel and the Nikon D3000, I chose the Pentax because it has all of the same features (that I was looking for) and it was cheaper, to be completely honest and the fact that is has the option for panoramic photos was pretty awesome too :) Also, my sisters father-in-law used to be a professional and Pentax was his camera of choice so he has a lot of lenses that are compatible for my model which is also great!", "Date": "March 1, 2011"}, {"Title": "A good entry-level DSLR for little money.", "Author": "Jose Luis Escobedo Cordero", "ReviewID": "R3GVWG673E0NEB", "Overall": "5.0", "Content": "This small DSLR shows that you can get good photo quality for little money.  Even if you use the kit lens, you will get amazing low light photos.  I've been using this camera for more than a year and I love it.  I'm sure you can get even better photos by using other lenses from PENTAX.It is worth every cent.", "Date": "February 28, 2011"}, {"Title": "Good, but not great", "Author": "JJ \"DIY\"", "ReviewID": "R1RUB931HVAMME", "Overall": "4.0", "Content": "I have this K-x for 2 weeks and took some pictures in day and night. This is my first DSLR and so far I mainly use auto mode. I'm sure it will become much useful once I learn all the technics in photo. Overall, I like its low-light pictures and the built-in special effects, but to my surprise I'm disappointed by its macro shots. Apparently, my Fuji F72EXR takes better and sharper close-up pictures on the flowers and insects. Since I don't know much in photo, so I'm not sure it's limited by the lens or by the camera. It's set to flower-mode for close-up pictures. For the price, it's a good camera.", "Date": "January 31, 2011"}, {"Title": "I love this camera!", "Author": "Scott Mcelroy \"Mr. McPenny\"", "ReviewID": "R209EZO4SC474I", "Overall": "5.0", "Content": "I'm just a regular person, I don't have lots of photographic experience.  I wanted a better camera to enable me to take actions shots of our dogs.  The older, compact, point and shoot camera we had just didn't have the options needed.  (I did some internet research before coming up with that analysis.)When my new Pentax K-x arrived, I studied the manual and I was able to start taking pictures within an hour or so.  I discovered that I didn't have to manually set everything unless I wanted to.  The camera can also be set on \"Auto Picture\" and the camera automatically sets everything.  I'm already getting shots I could only dream of before.  Now, I can really capture my dogs personality, beauty and playfulness.I chose a Pentax because I have a Pentax 35mm camera from decades ago, and guess what?  This new camera accepts the lenses I used on that old model film camera!", "Date": "January 17, 2011"}, {"Title": "The Pentax K-x - Just Right!", "Author": "Jason McRales", "ReviewID": "R1WYP6M61EBX8L", "Overall": "5.0", "Content": "I really like the Pentax K-x.It's pretty much perfect. Sure, some things could be improved, like the focus speed, but it's just all awesome.PROSThe K-x has terrific image quality compared to other DSLRs, and certainly compared to compact cameras. The viewfinder is bright and large, and there are many features to discover. For example, 720p HD video with cool depth of field effects. I picked this up for around 460 dollars. WITH THE LENS! Terrific value. It has in-body image stabilization, but it doesn't seem to work as well as optical lens based stabilization. There are all the great manual modes, but Pentax also includes a handy sensitivity priority mode, where you pick the ISO, and the camera chooses the aperture and the shutter speed. Great lens. The sharpness is wow! Also, the in camera editing is actually handy and is useful if you do not have access to a computer for a while. I find the use of AA batteries a huge plus also. I can pick up batteries cheaply anywhere in the world. Great handling also, the buttons are extremely easy to memorize and it is easy to master controlling the camera.CONSThe focus speed is really fast in good light, but in low light, it can be a bit tricky to focus, but still really fast, just not lightning fast. In live mode, like almost every other DSLR, the AF is very slow, unless you use the quick mode AF, which is slightly faster. That's pretty much it.If you need a DSLR, GO BUY THE K-X NOW! IT IS ABSOLUTELY THE BEST AT EVERYTHING OVERALL, INCLUDING IMAGE QUALITY, FEATURE SET, AND PRICE!Plus it comes in like 20 different colors. (kinda)", "Date": "January 8, 2011"}, {"Title": "Why I Like It?", "Author": "Gunasekhar Tirupati \"Gunasekhar\"", "ReviewID": "R30ET7XNG7YCF6", "Overall": "5.0", "Content": "After using Fujifilm S8100fd for over a year, and finding what I can't do with a point-and-shoot camera, I decided, its time to get a DSLR. One of my friends passed on a news that there was a huge discount on some DSLR called Pentax K20D. That's how I came to be know about Pentax. When I researched about that camera, I thought I may have to go for K-7 instead of K20D. After losing 800EUR on ebay in purchasing a new K-7, I took some time to re-evaluate if I really need to spend some more money on the camera. After 3 months I found it's very difficult without a DSLR. Ok, then which one?I went to a camera shop and hand held some of the DSLRs from Canon and Nikon. All are wonderful cameras but they are bigger for my small hands. Then I found this little camera, which also uses 4xAA batteries as my Fuji. I found the features and the reviews about this little beast very interesting. No second thought, I bought it, this time from PhotoPlanet in Stuttgart. My first expedition was to Wilhelma in Stuttgart. I was impressed at my own skill and the camera capabilities. The color rendering is excellent and the handling is very very easy. The cross processing mode is very interesting. We don't know what we are going to get until we get it.I am not a person who wants to take photos in low light. But in some occasions this camera proved to be my asset.Cons-----1. The auto focus in live view is slow and I feel its of no real use in many scenarios2. The video can be far more better with manual control of aperture and shutter speed rather than tricking the camera to use some preset values in another shooting mode. You know this???3. Looks like a plastic box until you handle it. But far far better than the real plastics from SonyPros??? Everything else.See some photos I uploaded...", "Date": "December 20, 2010"}, {"Title": "Loving this camera", "Author": "dv_ous", "ReviewID": "R2P6HDULZAVIFY", "Overall": "5.0", "Content": "For the price, this is an unbelievable camera. I haven't had a chance to take advantage of all the functions yet but the menu is simple and easy to manuever through. AF is super quick, slows down a bit in very low light. Only feature that I wish it has is an indicator for focus segment lock but once you get over the slight learn curve of shooting without one, its a non-issue.", "Date": "November 30, 2010"}, {"Title": "What noise ?", "Author": "iLikeAmazon", "ReviewID": "R29SGUS216UIKW", "Overall": "5.0", "Content": "I have this camera for a few days and very happy with its high ISO and low noise performance. I took pictures while we had a bonfire with NO flash and ISO 6400. Pictures are very usable with very little noise!! Other cameras would give me a lot of colorful dots all over the darker area of the pictures. I wish they can reduce its size so I can fit it into my jacket pocket. I also wish they fix the video \"metal\" noise issue, with that, video is almost useless. But video should be left with camcorder anyway. The live view does not stay on after I switch back from play mode. So I need to hit the LV button every time and it is a little slow. It is fast in saving picture with my 8GB SDHC class 10 card, I can keep taking picture almost continuously with just indoor lighting. For below $500, I think there is nothing (or very hard) that can match this camera. I also have another question. How come the shutter noise is so loud on this camera? It woke up my sleeping child when I took a few pictures. My 2nd half did not like it... Is this normal for this type of bigger camera or do I have a defective unit ? It also makes noise when I change setting or turn the dial. This is my first digital camera with detachable lens. I used Canon SX20is, Fujifilm HS10 and other compact cameras and they are much quiet. After taking many pictures, the shutter noise just imprinted into my brain now. It sounds like some expensive cameras..... It is a power saver too, I am still using the batteries which come with this camera after few days of testing, flashing and video'ing. I am considering getting K-r next when the price drops more!! The spec shows the same senor size, same pixel counts and added new features. It uses same processor but a review said it is faster in performance. I wish Pentax has newer firmware to make K-x faster too. I don't understand why other vendors keep increasing the pixel counts of every new camera using smaller or same size of senor and then degrade their PQ. Pentax does not follow them on the new K-r, this is what I like :-)", "Date": "November 26, 2010"}, {"Title": "great camera", "Author": "Judith A. Davis", "ReviewID": "R3RBRTY151XSZJ", "Overall": "5.0", "Content": "I've had this camera for six days and I love it very much. As an experienced film SLR (OM-1) user, I'm having trouble with the autofocus making too much noise and not coming in clearly, while the manual focus works great. I figure I just haven't learned this very well. I am very pleased with the camera even though struggling with short battery life already. I have the two lens kit (18-55mm and 50-200mm) and I've gotten great shots without a tripod.", "Date": "November 14, 2010"}, {"Title": "Exceptional Camera. Impressive Photo Quality", "Author": "Ashish Jain", "ReviewID": "R2QYHDRII950FL", "Overall": "5.0", "Content": "After much research - most of it positive except for lack of AF feedback (i.e. highlighting of points in focus), I decided to buy this camera.Many notable positives are1) Biggest bang for buck compared to most expensive Canon and more expensive Nikon. Also have had bad experience with Canon and was very hesitant with their cameras.2) Impressed by the Image quality especially the low light shots. None of the other cameras offer such good low light image quality. Out of about 150 low light shots, I have had to use flash only twice!3) The HDR feature is not available in many similarly priced, competing cameras4) Its more compact than other cameras and easier to travel with5) Body image stabilization allows for use with wide array of lenses thus reducing the overall cost6) Amazing Red Eye elimination7) Large number of control functions to control the image quality and renderingAlthough having the AF feedback would have been nice given that camera has 11 AF points, the camera does provide feedback (via a hexagon led and a beep) once you focus on the point of interest. This alleviates any need for AF feedback.I would highly recommend this camera to folks interested in great pictures and not biased by brand name! All I can say is that I am glad I chose this over Nikon (my first preference due to brand name bias)", "Date": "November 5, 2010"}, {"Title": "Great first DSLR", "Author": "J. B. Leners", "ReviewID": "R2OFQKQWC80IXY", "Overall": "5.0", "Content": "I bought this camera as my first DSLR. I chose Pentax because I had an old Pentax SLR with some lenses, but am happy with my choice despite not entering the Nikon vs. Canon feud.", "Date": "August 18, 2010"}, {"Title": "best thing since peanut butter", "Author": "J.D.", "ReviewID": "R2D7Y6FUB31L3Z", "Overall": "5.0", "Content": "I've never done this before. But like A lot of others. For years I shot 35mm slr. They were all pentax! Had several good lens.since the  pentax kx. would take those lens. thought I would try it? Hey I'm 59yrs old! Haven't shot since 1993. I'm A real computer dummie!!!! But let me tell you! With my pentax kx & windows 7 & kodak 7250 printer even I can set at home and print WONDERFUL photos!!!!!!! I've gotten something back I thought i'd lost? because of the cost of prosseing ! That I truly Loved! You can't beat the  \"bang for the buck\" So simple to use. easy to use manual", "Date": "April 9, 2011"}, {"Title": "Great camera, excellent price.", "Author": "bobeltomate", "ReviewID": "R3742PDQIS3GW7", "Overall": "5.0", "Content": "I finally made the jump from film SLR cameras to digital with this camera.  Since none of my film lenses would work with a modern digital camera, I had the luxury of picking from all of the brands.  Reading review sites like dpreview are an excellent place to start, and if you find the reviews too technical this class of camera is probably not for you.  Buying a camera really has a lot to do with knowing what you want and need, and for me I needed full manual control (f-stop, shutter speed, color balance, RAW, etc), good low light, and swappable lenses, at as low a price as possible without entering knock-off territory.  I got that with the Kx.Following is stuff that I didn't expect, but was happy to discover about this camera.* Honestly, the low light performance and image stabilization are what has amazed me the most.  I was able to take pictures of the recent lunar eclipse with the kit lens (not telephoto), by hand (no tripod), and capture the fine details of the craters well enough amaze me.  1/200 shutter speed, 800 ISO on the full moon; 1/40 and 1600 ISO on the dark, fully eclipsed moon.* Though I've only dabbled in it, and there's a strong anti-IR filter on this camera, you can get some IR shots with an R72 lens.  Not the best camera for IR, of course, but not as bad as some people online say.* The noise, which is pretty rare, is great.  One reason I never made the leap to DSLR before was the ugly RGB dots I'd seen in the noise of my friends pictures.  This camera manages to produce a film grain style of noise, when it has noise.  Check out the DP Review page for this camera for examples.Unless you already have a pile of lenses marrying you with another brand, this is the best camera of this generation, in my (hobbyist) opinion.", "Date": "December 24, 2010"}, {"Title": "Very good entry level DSLR", "Author": "Dasheng Shi \"playab\"", "ReviewID": "R20AEYRBXZ6S5C", "Overall": "4.0", "Content": "This is my first DSLR pro-consumer camera. I like the image quality, fast focus and no-lag shutter speed. The video sometime is off-focused. The only major complain is that I use Picasa to manage or crop the photos, but the pentax raw format is not rendered well in picasa3. I have to convert the RAW format to JPEG before importing to Picasa. It took about 60 min for converting 400 pictures.", "Date": "June 8, 2010"}, {"Title": "Great Camera, small expensive ecosystem", "Author": "Roy Denney", "ReviewID": "R3L3MZA0HVC6YY", "Overall": "3.0", "Content": "I love this camera, I still use it, it's fun easy to use, fast, in expensive, BUT...There's that word again,Pentax makes some awesome gear.  Period.  There is no disputing that.  The problems are more around the ease of getting what you want.  If you want lenses or a flash, they simply don't have the selection of Canikon or the distribution channels.  If you are just getting this one camera and don't want to get into photography and you are only going to use the kit lenses then you can not beat this system.  even if you are going to use some of their awesome glass with the understanding that your pool will be limited then this is still great gear.  If you like to buy new toys and want to really get into photography then this should be a standard disclaimer, buy the cheapest canon or nikon that is new on the market set aside the money you saved by not blowing your budget.  Use it for a month then go down to ritz and try to figure out what gizmo will help you with the shots you've been having trouble with(faster lens, a flash, fast telephoto, these may not make sense now, but after you've played with the camera and talked to some other shooters or read a couple magazines and reviews it'll be clear what you need for your style of photography.).  With the weaker supply chain you really can't try stuff out as easily.Like I said the camera is great, but the availability and selection for lenses and gear just isn't up to snuff if you are taking up a new hobby.  That said I will use this camera for some time to come.  I was able to use a shade 13 welding plate to photograph the Venus transit earlier this year.", "Date": "August 9, 2012"}, {"Title": "K-X camera great beginners camera", "Author": "kmartin55", "ReviewID": "R1MCMA19E7LCX0", "Overall": "5.0", "Content": "I had been looking for a new camera 1 that would take pictures without delay, i found it in a DSLR camera, after trying several different brands this pentax camera was the one. I have had this camera for about 1 month and have took great picutes. so if you are interested in take great pictures as a beginner try the K-X,", "Date": "November 3, 2010"}, {"Title": "Fun camera", "Author": "Neildo", "ReviewID": "RD0YTBKKJOWMK", "Overall": "5.0", "Content": "I recently had a kid so I wanted a camera for taking indoor, low-light shots.  I bought both the Canon S90 and the K-X because both are top-rated for low-light shots.  Surprisingly I give the S90 a slight edge over the K-X for low-light snapshots.  S90 has a fast f/2 lens so you ISO setting is much lower.  Typical indoor night shot on the S90 is 1/30 @ 400 ISO, whereas K-x is 1/30 @ 1600 ISO.  I'd say the S90 at 400ISO is slightly clean than the K-x @ 1600ISO.  With a fast prime lens (not cheap unless you buy manual focus), the the K-x would win easily.  If you're buying a camera primarily for quality, indoor snapshots of kids, then I'd recommend the S90.  However, if you really want the features of a DSLR then you can't go wrong with the K-X.  Good all-around camera.  I like the ability to use any k-mount pentax lens.  HD video is a nice bonus.I can recommend NiZN batteries for this camera.  I've been using them for a month with this camera and they seem to work almost as well as Lithium and better than NiMH.", "Date": "February 2, 2010"}, {"Title": "I like it", "Author": "Gregg Kemp", "ReviewID": "R321IW8H10W6N1", "Overall": "5.0", "Content": "This is my first DSLR, so I don't know enough to evaluate it compared to any other DSLR. But I'm very happy with the purchase and impressed with what I've done with it so far.", "Date": "December 21, 2010"}, {"Title": "Very good product. (revised)", "Author": "Emmett Clark", "ReviewID": "R24N9LONS4D093", "Overall": "2.0", "Content": "Great camera for the person wanting a dslr that is easy to use for the beginner and yet is capable enough for the experienced photographer. Review of camera was posted based on previous experience with same model. This is a replacement for a stolen camera (same model), I have revised review downward because of Amazon's shipping. Began Prime trial for two day shipping because of impending trip. Received e-mail that was shipped on 9/22. Just checked expected delivery - it is 9/25 - 4 days for 2 day shipping. So much for Prime - will not renew at end of trial.", "Date": "September 22, 2013"}, {"Title": "Lenses vs camera", "Author": "Izzy", "ReviewID": "RX26XMWKN6VNU", "Overall": "1.0", "Content": "I purchased the camera with the understanding I could use the lenses from my Pentax KM film camera. Right out of the box I installed a lens, the camera would not work and I could not remove the lens. Off to Pentax Service Department from where I was told Pentax did not manufacture that lens, it was not compatible with the K-x camera, and it will cost $77.00 to have the lens removed.I have used various lenses on my film camera for many years and took them to be Pentax lenses without considering who manufactured them. I thought this would be an easy switch from SLR to DSLR without the need to purchase additional hardware. Not so!My advise: Buyer beware. Make certain what your lenses are.I wrote Pentax and told them they need to make it abundantly clear that Pentax lenses by other manufacturers are not compatible.Two months later I change my rating from one star to five stars for the CAMERA, and maintain one star for PENTAX for the information I received regarding the use of film camera lenses on the DSLR.", "Date": "March 6, 2011"}, {"Title": "Video Sucks - Pentax False Advertizing", "Author": "heliking", "ReviewID": "R1EJ83VVV6WR5V", "Overall": "2.0", "Content": "Camera takes good pictures but don't waste your money if you want good video.  You will use up your batteries within 10-20 minutes of video...even after updating firmware.  There is no external battery pack available for this product...and no A/C Adapters anymore.  I called Pentax and they could not even tell me how long the video is supposed to last.  Pantax is lying to it's customers with this product advertizing this camera with video use.  I don't think I will every buy Pentaz again...now stuck with this.  I had to buy a deparate video camera to get longer video time and not waste so much money burning up batteries.  Thanks Pentax...you are terrible!!!  I could have paid $200 less for a camera comparible to this without the terrible video!!!", "Date": "August 10, 2012"}, {"Title": "un-awesome little SLR (revised review)", "Author": "P. Laflamme", "ReviewID": "R2NAULS4SP841G", "Overall": "3.0", "Content": "I have been searching for the best camera for my needs for more than 8 years. I have been using Olympus and Fuji Point & Shoots but kept wanting more. I need a good low light camera, adjustable flash, and low/no shutter lag and quick recycle...I want to take decent shots for parties and weddings. I thought since prices are dropping now would be a good time to \"reluctantly\" go SLR. I got the Pentax K-X for my own little birthday present 3 months ago so I have taken plenty of shots with it.  The PROS - It's pretty quick. Focus and shot to shot times are low with the kit lens.  AA batteries!!! YEA!!!  The Cons - LIMITED LENS CHOICES! I bought a 18-200 Tamron (Returned It) got Blur & distortion on the edges.  I did get a Sigma 50mm...NICE SHOTS but no zoom.  The kit lens (18-55) is a joke...3X REALLY?  Live View is a JOKE! It lifts the mirror and then time s l o w s  t o  a  c r a w l.  There is a BLUR/Smear that happens whenever you take a photo in moderate to low light. This IS a documented problem with this camera. It makes hands, clothing or anything that is not in the direct fire of the flash blurry and a deal-breaker for me. Every camera has it's weaknesses but this is unacceptable!  I didn't want to go SLR because of \"Mirror shake\" (When the SLR Mirror flips up & down), Proprietary batteries and expensive lenses. Now that several P&S;'s have CMOS sensors...I'm going back again to try the new advanced Point & Shoots. The larger the sensor, the larger the lens has to be. Now that CMOS sensors of such high quality are being made and photos rival SLR's....there is less excuses to go SLR. If you're a wedding photographer then you're ALREADY spent your money but for me... I will try a Superzoom advanced Point & Shoot.After buying 4 different \"Advanced Point & Shoots\" (HS10/HS20/FZ100/P500) I feel this camera does out-perform even the new BSI CMOS point & shoots. They were rushed to production way too fast. There are some things I would change about this camera but then It wouldn't be $475.00. (The cost of the above cameras)This camera does need light to focus. Even though I don't like using flash I recommend the Polaroid PL144AZ Flash Unit ($120.00)It has an AF Illuminator built in for faster focusing and It does reduce red-eye.So...I'll be using this for awhile and maybe we'll get along.", "Date": "April 24, 2011"}, {"Title": "Pentax k7", "Author": "historyguy", "ReviewID": "R1CBO696DQW4LQ", "Overall": "5.0", "Content": "I tried several DSLR's before purchasing the K7. I found Canon to be overrated and expensive, having tried the T1 and T2.  I also tried the 7D and found it too heavy.  The K7 is just the right mix of price, features, and size.  The software is also superior.  I especially like how it places the pictures into dated folders by day.  That allows for multiple day shoots without confusing what day you took what picture.  The battery life is excellent.  I've owned it for a month and have yet to recharge the battery.  It will need it soon.  All in all a good values for less than a grand.", "Date": "October 6, 2010"}, {"Title": "Pentax K-x Camera", "Author": "Dwight S. Burns", "ReviewID": "RYU6HD33EHPED", "Overall": "5.0", "Content": "Haven't had the time for my new Pentax K-x yet but what little time I had it is byfar what I really wanted. Thanks Pentax Corp.", "Date": "July 13, 2010"}, {"Title": "Good camera but . . .", "Author": "Christopher J. Clark", "ReviewID": "R3MUZCYM05WQRB", "Overall": "3.0", "Content": "I loved the idea of this camera. It would allow me to use any of my old k-mount lenses, had body-based image stabilization (cheaper glass), and best of all it ran on AA batteries, which are almost always conveniently available.The latter feature is what disappointed me though. I found that this camera ran exceptionally well with brand-name non-rechargeable lithium-ion batteries, but when I switched to rechargeable batteries (tried a couple of varieties ranging from 2600-2900 mAh) I found the number of shots produced very disappointing. This was especially the case when using the LCD for liveview or previewing images.I was disappointed enough to return the device and order a Canon t1i instead.", "Date": "November 23, 2009"}, {"Title": "Great Camera but...", "Author": "maylh", "ReviewID": "RZ2QMVN1MZUHR", "Overall": "4.0", "Content": "I owned it briefly and returned it.  The battery issue was very bothering.  Pentax should have done a better job before releasing.  I returned it before the new firmware was release so I am not sure it fixes the problem.  Two things I don't like through my limited use.  1)ver slow focus in low light in Live view 2)load shutter click.  I understand some don't care.  But one of the advantages of using a DSLR is its low light capability...for indoor activities.  In many such instances the loud click sound is annoying.  I got a Canon T1i instead.  It costs a bit more, not much.  But I got it during the Thanksgiving for about the same price.  The Canon fitted with a Tamron 18-270mm weight, about the same of the Pentax fitted with a Tamron 18-250mm lens.", "Date": "December 10, 2009"}, {"Title": "Updated firmware did not fix the battery glitch", "Author": "WAN2", "ReviewID": "RTPSPEDTRW21M", "Overall": "2.0", "Content": "From Day One my K-x's battery meter was faulty--even with the firmware update (Version 1.01).  Whenever I switched the mode dial the battery meter went to HALF.  Turning the K-x off re-set the battery indicator back to full.  The Pentax people (VERY knowledgeable and accommodating) told me the camera was defective and to either send it to them or return it to the place of purchase for exchange (it is one week old).  My final verdict awaits my second K-x.  It has caused me to wonder whether I should have gone with the XSi.", "Date": "January 19, 2010"}, {"Title": "Could not pull a sharp image", "Author": "GGPM \"GGPM\"", "ReviewID": "R20HMQRHWQALHQ", "Overall": "2.0", "Content": "I worked long and hard with this camera over a month. Sometimes I could get the results I wanted, but most often the level of detail I expected when zoomed in on my image was just plain fuzzy. I reset the settings multiple times and shot different types for 30 days. In the end, I decided to head back to Nikon. It was very disappointing.", "Date": "December 5, 2009"}, {"Title": "Picture Request", "Author": "Timothy G. \"musicluvr\"", "ReviewID": "R35R5MSJNAL8Y5", "Overall": "4.0", "Content": "I am seriously considering this this camera. I am thankful for all of the people that took the time to review this camera. I hope that some of the proud owners of this camera will post more pictures so that I can get a look at your handy work.More pictures on here would give me an idea of what this fine camera is capable of. Thank You all in advance.", "Date": "January 4, 2010"}, {"Title": "Don't forget to get an SD Card", "Author": "nicejob", "ReviewID": "R2U5YY88CDWIUA", "Overall": "3.0", "Content": "I was excited when my K-x finally arrived.  But disappointed to find it had NO SD card.  Not even a .5GB throwaway.  Kind of takes the joy out of getting a new toy.  I'd like to review the camera, but now I have to wait until I can get a card.Also, the small end of the USB cable is non-standard (I really hate that.)  So, I would recommend a card reader as well - misplace the cable and you are SOL.Finally, to continue ranting a bit, the camera does not come with rechargeable batteries.  It ships with four lithium AAs.  It's not clear, from my brief research, that the camera works well with rechargeables.  The lithiums are expensive, and certainly not very green.Overall impressions of the camera are good - it's light, compared with a full-size DSLR, but still feels fairly study.  The overall organization is fairly straight-forward and the menu system is simple, at least compared to the Nikon D-300 I've been using.I'll update once I can actually take some pictures.  But if you want to have fun out of the box, make sure you get an SD card.", "Date": "October 21, 2009"}], "ProductInfo": {"Price": "$649.99", "Features": "12.4-megapixel CMOS sensor with Pentax Shake Reduction; HDR image capture\nKit includes 18-55mm f/3.5-5.6 AL lens\nCapture widescreen HD 720p video at 24fps; 2.7-inch LCD with autofocus and Face Detection Live View\n4.7fps capture rate with 1/6000 sec max shutter speed; 11-point wide-angle autofocus\nPowered by AA lithium batteries; capture images and video to SD/SDHC memory (not included)", "Name": "Pentax K-x  Digital SLR with 2.7-inch LCD and 18-55mm f/3.5-5.6 AL Lens (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41mVtS3OO1L._SY300_.jpg", "ProductID": "B002OEBTC8"}}