{"Reviews": [{"Title": "Great drive for a very fussy TiVo's, just don't use it in a performance orientated  PC.", "Author": "videobruce", "ReviewID": "R2RPICJ8HS5M43", "Overall": "4.0", "Content": "I wish I had a dollar for every review on NewEgg from these kids that buy a 'green AV' drive for a PC, then complaint the performance is terrible when they try transferring and accessing files.Green drives that are specifically designed for AV use as in DVR's or Media Servers can't and won't have the speed and ability of a desktop drive. Rotational speeds are lower (not needed when recording or playing media) and the actuator arm is dampened to keep the drive quiet (necessary for many, but not all DVR's, especially TiVo's).Power consumption is measurably lower compared with a regular desktop drive (the blue series).Note; some DVR's won't accept drives larger than 1TB and some won't work with caches larger than 32MB", "Date": "January 31, 2013"}, {"Title": "Great Hard Drive", "Author": "Matthew Albury", "ReviewID": "R264HK14855GC6", "Overall": "5.0", "Content": "I purchased this hard drive for a surveilance system i purchased but did not come with a hard drive. It worked very well with my system. I really like how it operates.", "Date": "February 27, 2013"}, {"Title": "Good, solid HD", "Author": "Starkman", "ReviewID": "R1IFQKLGMJEILO", "Overall": "5.0", "Content": "After researching well, I went with this HD. It's working fine and is more than enough for my needs. Nothing else need be said.", "Date": "February 4, 2013"}, {"Title": "No complaints at all!", "Author": "theincrediblehoek", "ReviewID": "RLLN87PXSX8DT", "Overall": "5.0", "Content": "I'm not really looking for much in a hard drive, just that it works, and works well over time. I've purchased this recently, and I'll update as it ages, but it booted up fine, seems to read/write pretty quickly, and can't really complain about anything so far!Update (1/15/2013)Still works well, writes and reads quickly, and has no real issues. Used it for a computer I built for my parents and they have no issues so far.", "Date": "January 5, 2013"}, {"Title": "WD AV-GP 500 GB Hard drive", "Author": "Brandon yen", "ReviewID": "RGOC12ER51YMX", "Overall": "5.0", "Content": "I bought this hard drive to use with my ZMODO KDS4-BARBZ4ZN 4 Channel CCTV- H264 DVR 4 CAMERA OUT DOOR IN DOOR Model security camera. this is model that fit in the DVR box good. The holes for the screw fitted in the the right places. So if you had this security DVR model buy this hard drive it's the right one. Thank", "Date": "January 15, 2013"}, {"Title": "Harddriving On", "Author": "Mark E Preddy", "ReviewID": "R28B1QWFSI9PRM", "Overall": "5.0", "Content": "This unit is an exact replacement for a RAID sytem I needed.Shipped on time and properly packeged.Many Thanks!  :) Mark", "Date": "December 31, 2012"}, {"Title": "Works great for my Q See 4516 Security DVR", "Author": "isplash", "ReviewID": "R2ZX49X735YA9Y", "Overall": "5.0", "Content": "Works great for my Q See 4516 Security DVR, I don't know much about this hard drive  but it was pretty simple to take care of it.And now it works great. silmply open the dvr case then take plug in and out.", "Date": "April 5, 2014"}, {"Title": "Using it in my security system Works great", "Author": "Albert Bumpus", "ReviewID": "R985DXXPVRVZT", "Overall": "5.0", "Content": "Compatible for use in my security system. Works great. Definitely priced right when you are on a budget and need good quality at  a good price.", "Date": "March 25, 2014"}, {"Title": "worked just fine", "Author": "alex malott", "ReviewID": "R3EBYLKLYMCHEK", "Overall": "5.0", "Content": "good shipping good hd no problems hooked right up, never did this process before but it was simple as cake", "Date": "March 23, 2014"}, {"Title": "Works great with the Zmodo 4 camera security system", "Author": "Jon", "ReviewID": "RVXU85AEUUVCY", "Overall": "5.0", "Content": "The low priced 4 camera zmodo surveillance system does not come with a hard drive.  Big bummer.  But this drive does work on my system and even I (non techie) was able to easily install the hardware, and format the drive to work perfectly.", "Date": "December 30, 2013"}, {"Title": "Excelent.", "Author": "carlos efren fuentes", "ReviewID": "R136BJVMTPW56L", "Overall": "5.0", "Content": "I'm really satisfied as the product as the service provided. Is really what I was expecting for,  I really recommend it.", "Date": "December 9, 2013"}, {"Title": "Works great for DVRs", "Author": "Benjamin Cruz", "ReviewID": "R31IVUFREY417Q", "Overall": "5.0", "Content": "I used it for a security DVR and it worked great! I would highly recommend the unit for this purpose.", "Date": "November 25, 2013"}, {"Title": "Perfect for TiVo DVRs", "Author": "Cory G.", "ReviewID": "R1OCTYMMKWGNZ7", "Overall": "4.0", "Content": "Good drive - excellent for replacing dead TiVo DVR drives.  Get the drive here and get InstantCake software from weaknees.com and you are all set.", "Date": "November 14, 2013"}, {"Title": "Bought to replace the disc in my SVAT unit.", "Author": "G. J. Wolf", "ReviewID": "R37L7V2V64ZVL2", "Overall": "4.0", "Content": "Perfect replacement, and works fine.  Just don't know how long it will last.  The original only lasted 2 years, but it is on 24/7.", "Date": "September 10, 2013"}, {"Title": "WD Replacement Hard Drive", "Author": "Junkmologist", "ReviewID": "RZSYWNU0OZS9A", "Overall": "4.0", "Content": "I find this drive a good valueRuns coolFast enough for this desktop PC - Win 7No Issues", "Date": "August 20, 2013"}, {"Title": "for zmodo dvr", "Author": "rm250", "ReviewID": "R1DQ4IYAWYEFR9", "Overall": "5.0", "Content": "This is a very quite and cool running drive, works great in my security dvr, very happy with this hard drive.", "Date": "May 17, 2013"}, {"Title": "Excellent.", "Author": "Car", "ReviewID": "RD6NGMOI5EQCP", "Overall": "5.0", "Content": "Good product that works as advertized. I used the product in a DVR and it has been working error free since installation.", "Date": "April 25, 2013"}, {"Title": "So far loving it", "Author": "Tony", "ReviewID": "R3763Z9B6FGYZI", "Overall": "5.0", "Content": "I own 500GB and 2TB of this drive.This drive does not make any sound on my zmodo dvr. Will see how long will it last..", "Date": "March 23, 2013"}, {"Title": "Awesome add-on for Zmodo system", "Author": "James Southard \"JoeCop\"", "ReviewID": "R1PN9ILDIKYJ0H", "Overall": "5.0", "Content": "I installed this hard drive in my Zmodo system.  The setup was easy and the hard drive does a good job!!!", "Date": "November 24, 2012"}, {"Title": "Awesome add-on for Zmodo system", "Author": "James Southard \"JoeCop\"", "ReviewID": "R3MH0771SPUPRP", "Overall": "5.0", "Content": "I installed this hard drive in my Zmodo system.  The setup was easy and the hard drive does a good job!!!", "Date": "November 24, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002P3KO7O"}}