{"Reviews": [{"Title": "Mark III vs. Mark IV", "Author": "Mark Kitaoka", "ReviewID": "RXHZNELVXRFKE", "Overall": "5.0", "Content": "I had the Mark IV on order with Amazon since Canon's product announcement on October 20th of 2009. Since my local camera shop received the unit on Monday January 4, 2010 and Amazon still listed it as \"Not Yet Received\" I purchased mine from the local retailer despite the additional $464 in sales tax.I have been a Mark III shooter since June of 2007. For my professional work, my primary subject matter is live theatrical performance which includes acting as well as dancing ranging from ballet to traditional Tango to the very fast paced ballroom, specifically shooting Burn the Floor, which is just completing their Broadway run this month. Live performance shooting has many of the same elements of sports photography, except the lighting is much lower and at times more severe due to stage lighting. My Mark III performed well in most instances although I did have occasions where the autofocus did not perform as well as I had hoped. But to be fair, I cannot say with 100% certainty that it was the fault of the gear or the user, me.For my non professional work I utilized the Mark III for extensive street shooting in the rain, high wind and many other adverse conditions. In all cases the camera performed well enough that I could only blame myself in those instances where I didn't get the shot. This includes night shooting of high movement subject matter.I have never been concerned about the 10.1 MP size of the Mark III having had many of my images blown up to 6x8 feet posters used on the outside of theatres and large shots used in four color programs. I had several concerns with the Mark III which I had hoped would be addressed in its successor, the Mark IV:1. A higher ISO range with equal or less noise2. The ability for the focus point to switch when changing from landscape to portrait orientation. - Although the Custom Function allows one to change the rear wheel to adjust the focus point, I prefer to use that dial to adjust for exposure. Having to switch in a very fast paced situation caused me to miss some great shots.3. More selection of focus points for manual focus point adjustmentOther than those three wishes, I was happy with my Mark III. In all three cases, the Mark IV met my wishes. I have done a comparison in low light, low contrast situations with both Marks at ISO 6400, which for the Mark III was considered H1. As such, adjusting the ISO from 3200 to 6400 was not possible in 1/3 stop increments. More on that later. In the comparison, the Mark IV handily beats the Mark III in terms of detail and noise at ISO 6400. Much more detail is visible which has something to do with a higher MP count, but at 100% crops, there is a marked difference. The noise on the Mark IV is less and of a different quality than the Mark III, more film like than digital.During performances I had only used ISO 6400 in conditions which made lower settings impossible. I have always thought that a noisy shot is much better than one that is blurred beyond usage. My clients agree. One of my favorite lenses to use while shooting on stage as well as from the house is the EF 24-105mm f4.0 IS L. The focal range on a 1.3 crop sensor is just PERFECT, but the slowness of the f4.0 kept me from utilizing that lens with the Mark III unless lighting was sufficient. This will all change with the Mark IV as ISO 6400 is just fine using a f4.0 lens in my conditions.Keep in mind that everyone needs to decide how a camera is to be used, under what conditions and it is naive to think that an investment in current glass won't influence a decision to stay or leave any brand of camera. I am heavily invested in Canon glass and all of them are L series lenses. I find that the color and sharpness of L series lenses are worth the investment, especially since I purchase most of them on the used market. There are folks who love to go back and forth on brand, pixel snooping, stats, etc. in hopes of proving themselves 'right.' I am NOT one of those people. To me a mediocre/poor/boring image is the same whether you take it with film, a full frame DSLR or medium format camera. (BTW, I'm not sure why 35mm is considered FF anyway. I consider 2.25x2.25 my idea of full frame!) My personal opinion is those who often argue ad naseum about camera stats take the lousy or boring pictures anyway.I have NOT been able to use the camera in high movement, low light performance photography as I write this. My first opportunity for that comes this weekend. It will also be the first time I have the chance to shoot with two separate cameras with different lenses attached. That will give me a good, but not scientific comparison of the cameras, but more important for me is whether keeping both is worth the effort. I will decide if the Mark III gets a new home or not.My advice is to base your hard earned purchasing dollars on what is right for your situation. My Mark III has performed well in the past and I'm confident after some of my own testing that the Mark IV is even better. Time will tell and as I gain more experience shooting with this new tool, I may add my insights here in the future. Best of luck with your own shooting!UPDATE January 9 2010Today I had my first opportunity to shoot in low light with the Mark IV. Although it was NOT as high movement/low light as I am accustomed, it was a very good initial test. I shot a choral group with musicians, so movement was nice and slow, except for the conductor. It was also the first time I was able to use two camera bodies without switching lenses. On the Mark III, I used a EF 70-200mm f2.8 L IS and on the Mark IV, I utilized the EF 24-105 f4.0 L IS. This focal range allowed me to cover all that was necessary. Obviously I used the f4.0 on the Mark IV because of its higher ISO range and noise performance.I want to say that it will take some adjustments moving to the Mark IV. As I reviewed some images from other photographers using the Mark IV prior to receiving my own camera I had no idea what conditions the photographer's lighting conditions presented. I can say that because of the new sensor and ISO performance, it makes scenes appear MUCH more well lit than I experience with my human eye. In the past I have run -1/3 to -2/3 EV when using my Mark III to prevent blow out in highlights even using Highlight Tone Priority. Tonight I set both cameras on 0 EV to compare. The Mark IV presents a brighter image, about 1/3 stop brighter than the Mark III.Because this was not a paid gig, I took more chances with the imagery than had it been for pay. I found that in camera Noise reduction of 1 Low suits my taste much better than -0 Standard in the Custom Settings function. There is a different quality to the noise produced at Standard over Low. I prefer Canon's Low setting, but your preference may differ. The highest I found it necessary to set the ISO tonight was at 10,000. Upon examining the images on my monitor, there is the most noise in the subtle shadow areas around the subject's chin and lower neck. This is normal in my experience along with noise in large solid color backgrounds. But the noise at 10,000 is easily much better than the Mark III at ISO 6400. In addition the detail that remains at 10,000 eclipses the detail, or lack of detail in the Mark III at 6400. I measure my detail in the hairline wrinkles around the eyes and in the forehead of my subjects. The Mark IV sustained those details where the Mark III at 2/3 stops lower ISO did not.Also the noise produced by the Mark IV is more chroma than luminance. In my workflow, chroma noise is MUCH easier to reduce than luminance noise. The dynamic range of the Mark IV in terms of color is FAR superior to the Mark III, but I attribute this to a new sensor and new processors. Camera bodies are really just like computers, as soon as they come out they immediately begin to become obsolete. The color and white balance are MUCH better than my Mark III. It still takes some adjustment, but much less than the III.The automatic focus point association between landscape and portrait is a God send! Also the Mark IV takes advantage of UDMA card speed. I purchased a 32gb Sandisk Extreme CF card for the Mark IV and it's rated at 60mb per second. In shooting RAW burst, the ability of the Mark IV to write to the card after the buffer is full is easily three times as fast as the Mark III, but to be fair the III doesn't have UDMA capability.So far so good. I plan to keep my Mark III simply because shooting with two cameras with different focal length lenses is the only way to go for my work. At some point I will replace the Mark III with another IV, but that will take time and a few more clients. It will be interesting to see how the images look at high ISO in large format, which much of my work is used as with clients. I'm happy with my choice so far and anticipate that more work in my normal venues will continue to show favorable results.My issue is now how to build up my neck to support two 1D bodies with a 70-200 on one and a 24-105 on the other! When I use my 28-70 in place of the 24-105 it's going to be a real pain!FINAL UPDATE: January 17 2010Tonight I had my first opportunity to shoot a theatrical performance with the IV. I can only say that Auto ISO along with AI Servo will change how I shoot theatre. The settings I used tonight were Highlight Priority On, AI Servo, single shot, Auto ISO, ISO range L to 12800. The lenses I used tonight were the EF 24-105 f4 L IS and the EF 70-200 f2.8 L IS. Anticipation is such a major part of theatrical shooting, waiting for just the right expression, gesture and moment. I was able to capture images tonight with a clarity that I have not experienced with my Mark III. Auto ISO constrained within the parameters I wanted left me free to concentrate entirely on capturing the moment while retaining a speed proportionate to the focal length. By freeing me up from keeping an eye on the shutter speed, which was set by the Auto ISO, I was able to compose my shots more accurately. Using AI Servo for my focusing also allowed me to follow the subject and keep them in focus just before pressing the shutter. I watched and anticipated their expressions like never before.The ISO varied between a low of 800 in very good stage lighting to a high of 12800 in those scenes where it was too dark for me to know the actor's expression. I ran an EV value between -.33 to -1.0 to compensate for harsh spot lighting, so common in stage work. In those cases where the shot was very dark, where the actor's face was shaded in a very dark manner, ISO 12800's noise is very visible, but not to the point where a noise processor will bring the image back to usefulness. In those cases where light is medium, I will NOT have to use noise reduction post processing for printed images in large format.So with my last entry I will simply say that I am pleased to have made an investment in the new Mark IV. It surpasses my Mark III in a way that will now allow me to press the limits of my ability to capture even more compelling imagery. And in my work, an image that moves the viewer is one I'm proud to produce, regardless of the equipment. The Mark IV will certainly push my own skill limits in a way I'm happy to undertake. It's a tool that will help expand the level of my own creative process.Best of luck to all of you in whatever you decide to purchase and shoot. It's time for me to get back to work.UPDATE February 28 2010I'm not sure how many of you who own the Mark IV have upgraded your firmware to 1.0.6, but if you haven't, I would recommend the update. Although Canon has not released specifics about the update I can tell you that from personal experience, it helps to track objects that pause for 1-2 seconds before moving. Prior to the update I noticed that when a performer paused, the AI Servo mode hunted a bit attempting to stay on the same trajectory as the subject's last known movement. With 1.0.6, that pause causes the camera to hunt much less than before. I have now had the chance to use the Mark IV in two live theatrical performances, one publicity shoot, low light street shooting and one wedding. (My gawd I hate it when I get coerced into shooting the occasional wedding, but when my regular clients 'ask' what is a guy to do?) and the image quality along with high ISO performance is remarkable. In real world applications ISO up to 10000 is very usable for print in large format.In addition, having studied Canon's guide for AI Servo and High ISO usage is necessary in order to customize the camera for specific applications. I highly recommend reviewing the material. You can download the PDF from Canon Rumors at this link:[...]You'll have to scroll down a bit for the link to the PDF.UPDATE May 4 2010 - Noise performance with Adobe Photoshop CS5Having used this rig for quite some time now in various low light/high movement situations I wanted to comment that I have avoided the use of the higher range of ISO, specifically H1, 2 and 3. In those cases where I wished to reduce the noise levels in post processing taken at ISO 12800 I had used Noise Ninja with good results. I recently purchased Adobe's new Photoshop CS5 and decided to process some images taken at H1 and H2 through their Camera RAW noise reduction scheme.Obviously the quality of light has a large bearing on the amount of noise in any high ISO image. But I can say that using the new Camera RAW noise reduction in CS5 now allows me to use both H1 and H2 ISO on many more 'non emergency' situations. In the past Noise Ninja did not yield acceptable results at H1 or 2, blurring the detail beyond my acceptance level. CS5 removes that obstacle and I now find that shots taken at H1 (ISO 25600) are VERY useful both in print and on the web. H2 at 51200 are also useful when run through the noise reduction program. Yes, there is noise and if one is expecting a very low level of noise I would recommend you NOT venture into those ranges. But if like me you are sometimes REQUIRED to get a shot that captures the moment in more than acceptable fashion, I highly recommend the use of CS5's Camera RAW noise reduction with the Mark IV. It is a combination that has allowed me to capture and produce imagery like never before.", "Date": "January 7, 2010"}, {"Title": "A huge step up from the mk III", "Author": "William D. Colburn \"buys things on amazon far...", "ReviewID": "R3O16TVN07U7HT", "Overall": "5.0", "Content": "(Edited to fix my poor grammar and reword a few things to be more clear)The 1D mk III was my first 1-series body.  Before that I had, in reverse order, a 5D, a 20D, and 300D.  Each step along the way was nicer and nicer.  I couldn't imagine a better camera than my 1D mk III, but now I have it.Over time (mostly through reading about the camera) I learned that my mk III had poor autofocus.  I had an early version with the defect, but also because the mk III apparently did not live up to the autofocus of the 1D mk IIn.  I had the defect fixed, and my auto focus was better, but still not as good, or so I had read, as the mk IIn autofocus.  I can attest that I certainly felt frustrated with the mk III autofocus on a regular basis.I haven't been to a sporting event yet, so I can't speak to that kind of focusing, but in good light with a stationary subject my gut feeling is that, yes, focusing is better in the mk IV than it was in the mk III.  I can also attest that in near darkness conditions, such as when I can't even see my subject (and a 1.2 lens), the autofocus is astounding.  Astounding there is relative; in this case I mean it often acquires focus, which is quite a feat in near total darkness.This camera is 16MP instead of 10MP, but so far I haven't noticed much of a different in quality from the smaller photosites.  Canon said the microlenses were an improvement, and I'm quite willing to believe them.My ReallyRightStuff L-bracket from my mk III fits perfectly, which is a nice bonus.  It uses the same batteries as my mk III was well.  The mk IV doesn't come with a wall adapter like the mk III did, but I have a mk III so it wasn't a terrible loss for me.The battery life is supposedly down with the larger sensor.  Canon claims something like 1200 shots I think, while the mk III supposedly got 1900.  I know I usually got 7000 per battery if I drained a battery over a few months, or about 12000 if I shot a major event in a single day.  While the battery performance still seems good (I didn't start with a fresh battery, and I've been out in the cold a lot with it), it is definitely not as long-lived as in a mk III body.  The battery smart-logic only understand shutters, and doesn't keep track of video, so shooting movies will play havok with matching up a shot count to the battery life.The aesthetics of the menu system are much improved.  It is basically the same menus as the mk III, but they feel more polished now.The high iso is, well, high.  I won't lie to you: at H3 you get something barely above garbage out of the camera; but you get something!  It's absolutely astounding to be able to shoot in that much darkness.  H2 is pretty bad, and H1 is kind of all-right.  And I haven't found anything that needed any of the H modes; 12800 has been more than adequate for playing around in.  I'm quite happy with the exended ISO, and noise at that level is something I expect.  The camera can be pushed further with H3 than I even pushed B&W; film, and the results are quite good for the circumstances.When you stick to ISO 12800 or lower the results are quite spectacular.  My gut feeling was that 12800 is about as good as 3200 on the 1D mk III, but I hadn't specifically compared them to see.  I've uploaded a comparison picture to Amazon showing two shots that compare the ISO.  The mk IV 12800 definitely seems to be better than the mk III H1 (6400).I like the new rotation-selectable AF points.  I like the new corner brightening options.The video I've barely played with.  Auto focus in video sucks, so you need to manual focus.  The lack of a level control on audio-in is a serious deficiency.  The video does look good though.  I've barely played with it though, and I've never owned a video camera (I've only owned a film-based movie camera), so I'm not sure what I can say about it.  I do know that it takes a long time to upload a minute of Full HD to YouTube.I guess that is all I can think of at the moment.I like my new camera.", "Date": "January 6, 2010"}, {"Title": "Canon hits one out of the park", "Author": "T. Harmsen \"www.intempus.us\"", "ReviewID": "R3TQXPM7K26GTW", "Overall": "5.0", "Content": "I have been a Canon shooter for a while now but seriously considered jumping to Nikon with the release of the D3.  I stuck it out with my 1D3 which, despite the negative reviews, performed exceptionally well for me.When the D3S released it was all I could do to resist hitting the \"buy\" button.  I wanted to see what the 1D4 specs looked like before I made my mind up to either stay with Canon or do like many other Canon pro body shooters and make the switch to Nikon.The 1D4 released and I liked the specs, so I bought the camera.  I was one of the first in the US to get my hands on a 1D4, I received mine at the end of January when the first few bodies landed.  I've been shooting with it for a month now and I can say, it's an amazing body.AF:The autofocus system is noticeably superior to the 1D3's, which was outstanding to begin with.  My 1D3 didn't have the sub-mirror problem that plagued other users, so in that respect I was lucky.  My 1D3 had its quirks, like losing focus on subjects rapidly approaching or not really doing so well in very low light.  The 1D4 not only remedies these quirks of the 1D3, it goes even further and takes an already great body and makes it exceptional.  I've shot basketball games in dimly lit stadiums, I've shot outdoor (albeit winter) sports, I've shot birds, I've shot in studio and each and every time I'm impressed with the 1D4's performance.ISO:The high ISO is good, but not what I had hoped.  I mean, with a little noise reduction in post processing I can easily get beautiful images at ISO 12800.  Anything past 12800 and the images are for the most part unusable.  There is some chroma noise at ISO 6400 and above, but the luminance noise is more noticeable. Despite having some grain to the 6400+ images there is amazing detail in the high ISO images. They clean up very nicely and produce print quality work.  It is about 1 stop better performance than my 1D3, which is good.  It's about even with my 5D2 with the slight advantage going to the 5D2.  But the fact that it's close is amazing.Controls:I really like the new features like being able to register two different AF points based on camera orientation.  I also like being able to have two AF points registered for each orientation.  I can select two points in the horizontal position for example and while shooting hit the AE Lock button and toggle between them instantly.  This is very helpful when shooting sports and other events. The ability to use the joystick to quickly select a new AF point is also a nice touch, one that I use often.  The lack of a video button seems a bit odd (such as the one found on the 7D) but I don't really use the video function on DSLR's, so this is a moot point for me.  Aside from a few under the hood changes, the controls are quite similar to the 1D3 cosmetically, something that's kind of comforting to long time 1D shooters.Auto ISO:This feature finally made it to the 1 series and I LOVE IT.  I've never worried about Auto ISO in the past, mostly because Canon never really offered a solid implementation.  I've been using it on my 1D4 and all I can say is \"nice job!\"  It's very useful.Overall:I would say that the 1D4 is more of a 1D3n release.  True, it does have a totally new 39 point cross-type sensor AF system and a vastly improved LCD screen along with some other tweaks, but nothing really all that different from the 1D3 that it replaces.  I am very happy with the upgrade from the 1D3 to the 1D4 and would make the purchase again.  It's a very solid system.", "Date": "February 19, 2010"}, {"Title": "Amazing camera", "Author": "Me", "ReviewID": "RCLXF9FWDCTGW", "Overall": "5.0", "Content": "I've had the pleasure of using a pre-production 1D Mark IV for several weeks now, and I barely use my 5D Mark II anymore. As a photojournalist, this camera does everything I need it to -- most important for me:- Low noise high ISO. I have no fear whatsoever going to ISO 12,800. Images are still sharp and have good color. No ugly lines at all. Perfect for shooting sports in stadium with crappy light (see link below).- Better autofocus, especially in low light. With any camera I've used before, autofocus on low light was terrible. It's still not great, but it's a lot better.- 10 FPS, with a large buffer. With a fast card (60 MB/s or higher), you can lay on the shutter for several seconds on highest quality before it starts to lag.- Compared to the 5D Mark II, this thing is built like a beast. I've banged it around a lot and it still looks brand new.Here are a couple galleries shot entirely with the Mark IV. I believe the ISO for the first one is 5,000 and the second is 4,000:[...]", "Date": "January 13, 2010"}, {"Title": "Otherworldly image quality", "Author": "DocKayT", "ReviewID": "R3MRTL1IY161KM", "Overall": "5.0", "Content": "I tried to buy this camera through Amazon but it remains unavailable or inadequately priced thus I went to a local dealer to get it for the MSRP. I'm a hobby photographer upgrading from a 50D since I needed a second camera for my wildlife trips. I was hesitant to go with the 7D since there does not seem to be a substantial difference in IQ to the 50D (in fact some serious reviews state it's even worse!). I'm writing this after having taken some couple of thousends pictures in Costa Rica during a recent vacation. To say it upfront: The IQ is otherwordly good compared to the 50D (and even to my 5DMII). I could take pictures of monkeys and birds in the shaded rainforest at ISO up to 12,800 that are more than usable. The fast burst rate is of course extremely helpful. The AF certainly is something you have to become familiar with (read manual and white paper) and get used to. I took some tack sharp pictures using my 500mm F4 IS lens (without tripod!) but I'm still far away from being fully capable of using the AF in AIservo. Also, the spot AF enables you to catch distant subjects and get them tack sharp. Handling of the camera is much better compared to the 50D as expected from a 1D series camera; especially the option to use the vertical format is appreciated. The only minor criticism I have is the charger which is huge like a brick and does not have any advantage because you cannot charge two batteries in parallel anyway! Wonder what canon thought when releasing this ...In conclusion, if you can afford the price tag, go for the 1D Mark IV. You will appreciate it.In conclusion", "Date": "April 24, 2010"}, {"Title": "Lives up to the hype", "Author": "D_Sone \"Sone\"", "ReviewID": "R24KB0368W945J", "Overall": "5.0", "Content": "*** UPDATE, 2/21/2012: I sold my 7D bodies to upgrade to another Mark IV. The 7D is great, but the Mark IV is vastly superior on nearly all fronts. ***Just like with the Canon EOS 7D, Canon took a serious look at their line-up and listened closely to their customers as well as market trends. I'd have to say they have come out with an excellent camera that is extremely versatile. The short version of this review is that they took everything great about the 7D and turned it into a top-performing Olympian.Let's start out with the new AF system. The previous version, the Mark III, had notorious AF problems which hurt Canon's pro-line reputation. Canon's first response to correcting this was the new AF system in the EOS 7D and found a winner. They then took that knowledge and took it to the next level. The AF is faster and more accurate than the Mark III and makes the 7D's AF performance seem tortoise-like. The 39 cross-type AF points are extremely useful in low light and all are accurate and fast. The AF locks dead-on even with low-contrast, low-light, back-lit lens flaring situations (churches, concerts, parties, etc.) There is very little focus hunting and if there is, it is super quick.The next most impressive thing is the AI Servo II. Even at the default, out-of-the-box settings it is frighteningly fast, accurate, and consistent. It snaps on at full speed and doesn't let go, even at 10fps. I tried to \"stress\" the system by using the EF 24-70mm f/2.8L -- a lens not known for its fast focusing -- to shoot a soccer game. The AI Servo II yawned and gave me tack-sharp sequences despite foreground and background obstacles.Next is the high-ISO performance of this camera as it compares to the 7D and Mark III. The ISO range of the Mark IV (50-102400) is WAY wider than either the Mark III and 7D. Compared the to the Mark III, I noticed about a 1.5 stop improvement in noise. Compared to the 7D, I've noticed a minimum of 2-stops worth of improvement. The Mark IV holds onto detail and color very well at these upper ISO speeds and the files do well even with a +2stop push. I feel comfortable with the Mark IV's performance up to ISO 25600 (H1). Beyond that, full-frame cameras like the 5D Mark II win out on high-ISO performance.Finally, customization and ergonomics. Canon held onto nearly everything from the Mark III regarding ergonomics. It feels solid yet comfortable in the hand with the buttons in easy reach in any orientation. I do wish it had a main command dial like on the Nikon D3s, EOS 7D, and the 5D Mark II. The buttons are well placed, but I think the 7D did a better job regarding centralization of commonly adjusted settings. However, the Mark IV is aimed at photographers upgrading from the Mark III, so keeping it feeling the same was critical.I feel the menu-based system is a little slower than physical dials or centralized buttons, but the level of customization options in the Mark IV is incredible. The photographer can literally set up the button functions, picture settings, filing, etc. as he/she pleases.This camera is aimed at the professional who needs the speed, performance, and weatherized capabilities this camera offers. Photojournalists, sports photogs, nature photogs, and even wedding photogs will appreciate this camera. It has a hefty price tag, but if you simply need the best tool, then the Mark IV is it. If you're on a budget and need something as well balanced, get a 7D. Although I'm totally impressed with the Mark IV, I don't see my two 7D bodies collecting dust either. But I might sell one to help get a second Mark IV.How does it compare to the excellent Nikon D3s?It beats it in the fps, resolution, and AF performance.It decidedly loses in the high ISO performance, but only after getting WAY up there.Remember, the air is pretty thin up there when you reach the flagship camera level. And usually, people who are using these cameras are heavily invested in one brand or another. So, comparing them in those cases is like apples and oranges and splitting hairs.", "Date": "September 17, 2011"}, {"Title": "Canon nailed it with this one.", "Author": "Eric Strate Photography", "ReviewID": "R2D5HL7PJ1CX76", "Overall": "5.0", "Content": "Mark Kitaoka pretty much nailed it with his detailed review, but I figured I'd add some of my own experiences and opinions as well.I've shot with a 5D Mark II and a 50D - but this is my first foray into OWNING a 1D series camera (I've shot with them before, but I was always borrowing them and never really got to really know one inside and out).  The first thing that owners of anything but the 1D series will notice is the build quality.  As solid as the 7D and 5D and even 50D series might feel, the 1D cameras are just in another league.  Button layout is very intuitive - I found myself easily able to adjust everything I need while looking through the viewfinder, and quickly at that.  Switching to video is also seamless - you can set it to switch to recording with a single button push instantly not only switching to video mode, but starting recording at the same time.  Video quality is astounding.What most impressed me, though, was being able to shoot a basketball game with shutter speeds up to 1/4000th of a second with ambient gym lighting and get good results. Being able to shoot at ISO's of 10,000 and above with good results gives you incredible freedom to crank the shutter speed up and capture every aspect of the action - freezing action as never before with indoor sports.The following shot was taken at ISO 12800:[...].Noise is visible in dark areas, but I'll take an image with that noise level all day for the ability to shoot at the shutter speeds that shot was taken at.Here's an example of ISO 5000:[...].The lack of noise in that image is, in my opinion, phenomenal for that ISO.To the person who thinks this camera is completely unwarranted for your current 'level' of photography, I'd encourage you to reconsider if price isn't the issue.  The blazing fast AF, improved AI servo performance, video, and high ISO performance will open up completely new areas of photography to you.  I know people who can afford this camera and have chosen not to get it simply because they felt it was just beyond what they needed.  That may be the case, but if you feel like spoiling yourself, this is one purchase you won't regret.  I love this camera and cannot wait to shoot a wedding with it.", "Date": "February 16, 2010"}, {"Title": "Best camera I've ever used!", "Author": "O. Wroe \"ozvisuals\"", "ReviewID": "R3AXCDIWF1MNZM", "Overall": "5.0", "Content": "There is a ton of info out there on this camera and I just want to echo most peoples findings.The pluses:Autofocus system is a huge win!  I had a 5d mark ii and a 7d before this camera.  I still have the 5d mark ii and the 1d mark IV destroys the 5d as far as autofocus goes.  The center point of the 5d mark ii is good but all the rest suck.  ALL THE FOCUS POINTS OF THE 1D MARK IV ROCK!  No more focus and recompose.Colors:  Man oh man, the colors straight out of the camera absolutely RULE on this camera.  I just can't use anything else.Auto White balance:  Back to the colors, this thing hits the white balance consistently and beautifully.Low light ISO:  Wow!  Just wow!, no banding, beautiful grain all the way to 10,000 iso.  Maybe not quite as good as a d3s but close.cons:the only thing I can think of is autofocus in low light could still be improved.  I still need to use the flash at times to get the infrared light out there to help me focus when I'm around 10k iso.This camera is a horse!", "Date": "July 26, 2011"}, {"Title": "Worth the price", "Author": "Randym", "ReviewID": "R2Q6HTZGFV1HCT", "Overall": "5.0", "Content": "I've had this camera almost a year now, and am very happy with it.  I use it mainly for sports, and it hasn't disappointed.  I haven't noticed any problems with the autofocus, or the focus points.  I love the way you can adjust the autofocus sensitivity, so that the camera will continue to track a player, even if the referee crosses in front of him.  (Oh, the shots I missed before I got this camera.)The biggest drawback is the APS-H sensor. That means Canon EF-S lenses, meant for APS-C cameras, won't work with this one. The EF lenses work fine, but they are generally meant for full-frame sensors, and wide angle on a full frame camera is not very wide on a cropped sensor. So the wide angle options are limited for this camera.  But I use telephoto lenses far more than wide angle when I'm shooting sports, so it hasn't really been an issue. All in all, I'm very pleased with this purchase.", "Date": "February 13, 2011"}, {"Title": "Excellent camera", "Author": "Sam I Am \"A Parent\"", "ReviewID": "R236AU6FG0L6SG", "Overall": "5.0", "Content": "I am an amateur with experience using a 40D for 3 years. I have learned to use the manual settings and usually shoot in P or Av modes. I did not previously trust my skills with the M mode. The biggest change for the better is the Auto ISO feature. It is fantastic. The ISO adjust for any Tv, Av or M settings and is incredible. The pics at ISO 6400 are great. Noise is visible somewhat at 12800, however the amount of noise is dependent on ambient light and sometimes is minimal. I am pleasantly surprised to see how good very low light pictures look. The IQ is fabulous - I shoot primarily JPEGs since I do not have the time for RAW processing. I am very happy with my purchase. For maximum benefit, it is useful to have at least one fast lens (my 50 mm prime goes to f1.4) particularly for low light indoor shots. LCD view is great. I have actually found this camera easier to use than the 40D for routine photography. Some of the autofocus/drive options are a little confusing, but if you play with this long enough, you will find the menus fairly intuitive and easy. I love the video ability. It allows me to capture clips on vacation. Video is best accomplished on a tripod and has a learning curve, compared to a traditional camcorder. You have to stop expecting a noise free picture with no light!!!It has been 3 months since I got this camera and I love it!", "Date": "May 16, 2010"}, {"Title": "Low ISO NOISE - Not For Portraits - Color not Great", "Author": "tomphotos \"tomphotos\"", "ReviewID": "R2PO55J82ZBDGI", "Overall": "1.0", "Content": "I have been a professional photographer for a number of years and create thousands of images per week and purchased this camera as an upgrade to the Canon 5D Mark II.  Wow was I wrong...I had been a little disappointed with the focus speed of the 5D MKII and had put a couple hundred thousand images on it, so I sprung for the new model.  I was a little worried about the 1.3x crop factor, but thought if they were sharp I could over it.  I photographed a wedding and reviewed the images and noticed they were not super sharp and wasn't in love with the color, but thought that I might be able post process them to be as good as I had been getting from my 5D MKII.  Nope.  Wanting to believe in Canon, I photographed a few more portrait sessions and another wedding with the 1D MKIV.  Then continuing my research and attemping to use the Canon DPP rather than lightroom to process the RAWs, came to same conclusion, JUNK. At this point I felt that I had purchased a $5000 boat anchor.I continued to read all the reviews and the only thing anybody was talking about is the high-iso capabilities.  That's all great, but I would assume that it would also perform as good as the previous generation cameras in the low-iso range.  My 5D MKII files knock the 1D MKIV files outta the water, and here are the key elements:1. LOW ISO NOISE - Where did this come from?!?!  The 100-400 iso images look like 1600 iso on the 5D MKII2. Skin Tones/Textures - Because of the noise and lack of file clarity, the skin tones were never smooth and the color was not as nice as the 5D MKII.3. Focus System - With the more complex 45pt focus on the 1D, I had a tendency to mis-focus regularly (back focus, front focus, etc.)  The most accurate seemed to be using just the center point focus and re-composing once focus was achieved.4. Eyelashes - with a variety of L-Lenses, the 1D was never crisp enough to see them (noise, lack of focus, etc)5. Color Depth - Reds go strange with this sensor.Overall, this camera may be a great piece of equipment for a night sports photographer, but is a terrible camera for most everything else.I returned my 1D MKIV to Amazon a few days after the normal return period and it cost me $1000 dollars.  It was that bad._____________________________________________________________________Update: June 16, 2010I am still not thrilled with these files, but with the new Lightroom 3 you are able to post process a good bit of the noise away.  Now I can salvage the shoots that I did with this camera.", "Date": "June 6, 2010"}, {"Title": "Low-Light High-ISO All-Star Digital Cameras", "Author": "Tatiana Nicholas", "ReviewID": "R3NNOHHGFHKT5S", "Overall": "5.0", "Content": "Canon EOS 1D Mark IV16 MegapixelsThe 16MP, $4,800 Canon EOS1D Mark IV is the first and only APS-sensor camera to claim a maximum ISO of 102,400, and has a recommended top ISO of 1320. It has a signal to noise ratio of 41.4 dB at ISO 100, and doesn't dip below 30 dB until after ISO 1600. Digital noise is effectively suppressed up to ISO 1600, although overall image quality deteriorates rapidly by the time you reach ISO 12,800. Still, an amazing performance.", "Date": "September 21, 2011"}, {"Title": "Focus or not to Focus", "Author": "Terry L. Manier Jr. \"TerryM\"", "ReviewID": "R2YI57EKMKPWKE", "Overall": "3.0", "Content": "I purchased the Canon 1D Mark IV from Adorama about a month ago. My main camera at the time was/is mark IIN and a 5d. When I got the camera I was a little shocked that it feels heavy like my Mark IIN but not a biggy. I got busy learning the new camera because I had a travel gig the following week. Loved everything about the camera. It became super simple to use. Loved that the ISO was on the right side and separate from the other operation buttons. (I flip through ISO often on editorial shoots). SUPER SUPER great! BUT THEN... HA hA... there is always a 'but then'. THE FOCUS POINTS. AF POINTS... (which I use a lot) SUCK!... CAN I SAY THAT??! THEY SUCK.!! Here's the deal. Canon brags about the 45 AF points. I think I read 'crosshairs' somewhere... which makes you think if you have that little red puppy on something that's where your lens is going to focus.... Not so. I have found that (even on a tripod) that you better watch out where you think you might focus. I constantly move the AF point around and shoot... (reframing and following my subject) the thing is Canon allows you to preview where your AF point was when the picture was taken and I have found it to be highly... yes 'highly inaccurate' well, I guess I shouldn't say highly... how about 10 percent of the time. If your a pro editorial photographer... that's 9% to many. ( Yes I tried different lenses and same results). I returned that body and Adorama sent me another one. We'll see what happens.  Here's another thing. I used to hand hold and shoot all the time at 1/60, 1/50 and sometimes 1/40 of a second. Not with this camera. I'm not sure why but you (I) can not hand hold this camera and shoot low light, slow shutter speeds, with the accuracy of the predecessors to this camera. My D60 used to get the best slow shutter speed pics... ALSO, I don't care what anyone says... INCLUDING CANON... It doesn't matter what ISO your on if you get so much NOISE that its unable to be used in print. Everything I shoot goes into a pub. I will not shoot over 6400 in 'warm' environments with this camera. Canon.. you can say the Camera will shoot at 600,000 ISO and it won't make a difference if the noise is so bad. Lastly, I'm a STILL photographer. I don't want to shoot VIDEO. CANON... please make a camera THAT IS JUST AN INCREDIBLE STILL CAMERA and leave all the video crap off. PLEASE!!!!", "Date": "April 21, 2010"}, {"Title": "Wrong Frame Rates", "Author": "A. Harrison", "ReviewID": "RLERJYUKEY89R", "Overall": "2.0", "Content": "Yet another camera with idiotic frame rates for video.  When are the boneheads at these companies going to simply make a camera that records at 24 frames per second like film has done for 50 years.  Film makers do NOT want 23.976 fps!  Its not complicated, although many people who misunderstand audio sync make it so.  Ideally a camera would record at all the common frame rates ( 23.976, 24, 25, 29.97, 30, 48, 50, 59.94, 60 ).  Then users could pick what they need for their individual situation.  Each has its uses.  If every camera would record at both the silly, awkward old frame rates we inherited from color TV in the 1950's (23.976, 29.97) as well recording in the natural, easy to work with frame rates ( 25, 25, 30, etc. ) then the industry could gradually move on and dump the old ones!", "Date": "March 3, 2010"}, {"Title": "Wait for real upgrade", "Author": "GK \"GK\"", "ReviewID": "R3LSFEYUBA11Z9", "Overall": "4.0", "Content": "Sony SLR: In-body image stabilization that works well (around 2 stop advantage)Olympus SLR: In-body image stabilization that works well (around 4 stop advantage)No In-body image stabilization like Sony & OlympusNo Tilt and Swivel LCDNo 1080p HD video recording 60 fps", "Date": "February 17, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "16.1-megapixel APS-H CMOS sensor and Dual DIGIC 4 imaging processors\n45-point Area AF sensor including 39 cross-type AF points with f/2.8 support\nISO 100-12,800 for shooting from bright to dim light with low noise levels\nEOS HD movie with manual exposure control and multiple frame rates; 3.0-inch Clear View II LCD monitor\nMagnesium alloy body with shutter durability up to 300,000 cycles and exclusive dust-and-weather resistance\nBody only, lenses sold separately; capture images to CF Card Type I and II, SD/SDHC (not included)", "Name": "Canon EOS 1D Mark IV 16.1 MP CMOS Digital SLR Camera with 3-Inch LCD and 1080p HD Video (Body Only)", "ImgURL": "http://ecx.images-amazon.com/images/I/51gPldLUNZL._SX300_.jpg", "ProductID": "B002TG3ZYQ"}}