{"Reviews": [{"Title": "Roughly as good as can be expected.", "Author": "S. Davis", "ReviewID": "R2ZTF2F8VMGV7G", "Overall": "4.0", "Content": "My title is rather pessimistic, I know, but I've been playing with this camera now for a couple of hours, so I've had a chance to get a feel for what consumers are going to probably like, and not like, about this lens kit.First, if you are a serious photographer, you are going to be better off buying the body of this camera separately from the lens. It isn't that the 18-55mm, 3.5-5.6 aperture lens is bad: it just isn't great for inside work, as far as I can tell. The kind of \"meh\" aperture range means you'll struggle a bit in \"normal\" indoor lighting to get hand-held shots that don't really want flash, and the problem with the flash is it is straight-ahead flash, so that your attempts at head shots are going to potentially have a deer-in-the-headlights quality about them. This will be because even zoomed in to 55mm, you're going to need to be close to a subject for a portrait shot--closer than you really would like to be. Getting the two-lens kit, for a couple hundred dollars more, might be a really good alternative here, because I think the longer telephoto in that kit can go out to 200mm, giving you more flexibility in where you need to stand for shots. I was pretty sure when purchasing the kit that I was going to quickly need a really solid prime to go with it, and the Sony 50mm f 1.4 has already proven itself a valuable addition.The good news is that, aside from the \"adequate-but-kind-of-meh\" lens, everything else on this thing mostly rocks! I was a bit nervous because I had seen other reviews in which some reviewers chewed on the ergonomics a bit, but I'm not really finding that to be a problem so far. The battery door, the door to the memory cards, etc., are rigid and open happily and confidently. As far as the battery goes, my advice would be to pick up an extra battery, because after charging mine the first time, I was down to roughly half power without having taken that many photos (maybe 75 RAW out of what I was being told was a 500-image total available. I didn't expect the battery to make it for 500 shots, but it looks like I would have gotten about 150 shots out of the charge, and I can definitely see situations where a photographer would run into trouble from that.)One thing that may not be immediately obvious from pictures is that the right-hand grip is quite comfortable, and there is a design feature on the back (basically a bit of a \"hump\" that provides the right thumb a place to get a kind of secure purchase so that you really shouldn't ever feel like the camera is in danger of slipping out of your hand. I always put my left hand under the bottom of a camera anyway, so that I can adjust the focus ring easily, and even though this camera and its lenses have auto-focus, that's still a comfortable place for the left hand.Many of the features and details of the camera are things that you can find in other reviews or in detail lists for this product, so I won't repeat all of that. I will state that I had no problems with the placement of the shutter button. I had seen some criticism on line suggesting that the reviewer felt like he was putting a lot of stress on a couple of fingers while firing the shutter button, but I really just didn't find that to be the case.All of the controls are really pretty intuitive. I turned the feature off that shows the pictures of what various things mean. If you are stepping up to a SLR from a point-and-shoot, do yourself a favor and learn what aperture is, and white balance. The joy of this camera is taking a photo with \"automatic\" settings, and then going to manual, taking the same shot, and realizing how completely screwed up your own sense of the shot is! <smile> Actually, this is kind of valuable, in that the digital nature of the camera means that you (and I) can get a real lesson about what happens when changing aperture or shutter speed, even sometimes by very small amounts.In many ways, this camera is an ideal camera for a serious hobbyist (I'm not going to go hyperbolic and say \"professional,\" because the limitations of this camera are the sort that wouldn't be tolerated by a professional being pushed to the limits of digital photography. It isn't that a professional shot can't be taken on this camera, but that there are digital bodies that would make a professional's life much easier than the a230 would).It is going to pretty much meet all of my needs for awhile, at least with the better lens on the front, and maybe a really good zoom to give me a bit more range of options.The build quality seems fine to me. Nothing is jiggling. Lenses go on and off with no problems. Definitely buy the LCD cover that's available from Amazon. Otherwise, you'll discover that basically everything smudges the LCD display. It isn't the end of the world, but your nose will constantly be pressed against the display, so there will always be a bit of oil and moisture smudged on, otherwise.This isn't a bad camera at all, and if you are JUST looking for a system that will give you some flexibility to take \"normal\" shots of the variety that other people make you sit through after they've fed you dinner, then you are going to be immediately happy. The camera will do many of the things that you need for it to do automatically, and can easily take better shots than you would take, if you knew nothing or little about photography, and had no interest to learn. But like many things, if you DO know something about photography, you will be pleasantly surprised about the sorts of things that you CAN do with this rig, as long as you are willing to make an investment in accessories that will give the body a chance to show its stuff.", "Date": "July 1, 2009"}, {"Title": "Sony Alpha a230L DSLR", "Author": "B. Weeks", "ReviewID": "R1H6OT69AUEGGO", "Overall": "5.0", "Content": "This was a Christmas gift to myself, purchased mid-November 09.I'm a beginner DSLR user. I won't go into a catalog of specifications this camera has, those can be found easily on the sales information listing for this camera on this website or from Sony. I will highlight the features I use and like or dislike.This camera has been exactly what I wanted for learning photography. I did not want a lot of bells and whistle. Out of camera picture quality is very important to me. I am not ready to spend time at the computer post processing when I would rather be outside shooting pictures.The Sony a230 does not have live view or video, but I did not want live view or video capability. I have both on my advanced zoom and never use it. Optical viewfinder important due to the fact that I am far sighted and find live view screens not usable in 98% of my pictures since I like shooting outdoor/nature/landscapes the majority of the time.PROS:  *Out of camera colors/picture quality is great. I love the colors and textures this camera produces. Again, this is a personal preference. Exposure compensation can easily be changed +/-2 as well as color saturation in the menu. I have enjoyed the black and white out of camera results also.  *The GUI menu system is easy to use, clear/crisp with easy to find advanced menu settings. Because of the great GUI, I have to say that my learning curve has been much much improved over my advanced super zoom, in fact, I rarely use the Green Zone (auto/preset modes) on this camera. I am using Aperture Priority or Shutter Priority and easily experimenting with manual white balance etc. VERY FUN and REWARDING. If you so choose, different color scheme options allow you to change the display to either Black, Brown, White or Pink. (I haven't experimented to see what is the best viewing for outside use yet, leaving mine set to White default)  *18-55mm kit lens excellent IQ and good overall practical range to have for most photos. I love having this wide angle capability that I didn't have in my advanced zoom camera.  *ERGONOMICS & BUILD: At first glance I thought it looked a little plasticky, but once I held and examined it, changed my mind. It feels sturdy and well made (which was proven recently when it accidentally was toppled from my dining table onto the floor. I like to hike, and did not want a bulky heavy camera to lug around. I know this is a personal thing, but I really like the balance and feel of this camera in my hands, even with the additional larger 70-300mm lens I purchased later for this camera, it still feels good to me.The menu buttons on back may be too simplified/stripped down for experienced users, but I like the way they are arranged, ISO setting is easy to access. For learning, having less buttons to accidentally hit and cause frustration has been good.  *VALUE reasonably priced for those on a budget. Kit lens 18-55mm included  *OPTICAL VIEWFINDER. I love this VF. Nice clear crisp, with sophisticated auto focusing when it senses my eye.(this can also be turned off if for batery power savings, since it will start focusing the lens if gets anything close to the view finder, when carrying)Camera settings are displayed through the viewfinder, wheel on front of camera below the on/off power button allows you to change settings based on what menu mode you are on. Field of view seems to be very good in my limited experience. 9 cross focus points.  *Auto-Bracketing feature. Will take up to 3 different shots with exposures shifted either 0.3 or 0.7 steps.I can't speak knowledgeably about dynamic range since I haven't played with those settings yet.  *Lens options. Knowing I can use Minolta A-mount lenses is a plusCONS: *at some point, maybe I will wish there are more advanced features available on this model, like an AEL button. A \"depth of field\" button is mentioned by more experienced users, but being far sighted, I have to load the pictures up on my computer to see the true quality of the final picture, so I usually take several pictures of the same thing, tweaking the settings and the angle as insurance. So a depth of field button probably wouldn't help me.  *Bigger screen on back, it has a 2.7\". Larger would be nice for viewing  *Not the fastest frames per second on the market at 2.5, but have to say this is not an issue for me so far. I have been able to get some decent bird in flight pictures. I don't normally shoot sporting events, except for baseball.  *like any camera, low light situations are a challenge. In low light, the auto focus has a hard time. Some patience and experience/or in my case, trial and error is needed. I find if I switch to manual focus and manual white balance settings this helps. Having the right lens probably also helps. I have 2 lenses at this point, neither are really meant for low light/night use. I recently successfully used the on-board flash using rear sync or fill, manual white balance settings set to daylight, ISO set to 800, to take a nice portrait of my husband at night by a campfire. This was the BEST outdoor evening portrait shot I have ever taken to date! I was evidently in the perfect range for the on-board flash, and accidentally through experimentation got everything right! After taking this shot, I would say that ISO 800 or below is where the best image quality will be for this camera. An accessory flash will be in my future, so the ISO capabilities will probably improve if I do that.  *Proprietary battery. Expensive and only found at stores that carry the a230/a330/a380.Won't be able to find the battery at the local hardware store or even electronics store if they don't carry this line of cameras or camcorders that use this battery.There are no perfect cameras, but the Sony a230 has exceeded my expectations thus far.", "Date": "March 5, 2010"}, {"Title": "WOW, this is my first DSLR Camera, I love it.", "Author": "Patrick Nguyen \"Trance Music\"", "ReviewID": "R3DU9QBNA9EHUE", "Overall": "5.0", "Content": "this is just about the perfect entry-level DSLR.It has everything that you need to get great shots out of it, without the high price tag or a bloated feature set. I'd definitely recommend it. It's not the best, technically, but it's a great learning tool, performs well under stress, and an expert can get great shots out of it across the ISO range and in all lighting conditions. I would say that this will become legendary for its value as a DSLR. It's the closest thing to a \"throw it up and shoot\" cheap little box film camera that you can get in a DSLR. But it still takes great photos, it's very fast, nice and small, obviously cheap, and very easy to use.I have to say I'm very happy so far with my choice, and this camera is my first DSLR Camera. The auto focus is fast and accurate. The shutter response is quick. The image quality is very good with lots of detail. The exposures have been very accurate with a minimal number of photos with blown highlights. The image stabilization kicks butt. The dynamic range optimization really does pull highlights out of the shade.Pros:-In-body Stabilization-Compatible w/ Minolta lenses-Smallest and lightest DSLR-Very simple to use-Vivid and good image quality-Its high ISO (3200) low light performance is increbible-PriceCons:-New Sony lens are expensive-Some noise at high iso.Just got this camera for couple days, will update more soon...Update: 04-2010 - I have taken about 27,000 pictures with this camera, so far so good.", "Date": "July 1, 2009"}, {"Title": "Sony A230 - A Winner From Sony", "Author": "C. Martin", "ReviewID": "R335GY2SW90NLG", "Overall": "5.0", "Content": "I found a deal on a new Sony A230 that was too good to pass up (I really wanted the new kit lens). Knowing the comments I have read on the internet, I was skeptical on its performance and especially its ergonomics.Let's talk about the ergonomics first. It feels very solid and well made to me. I owned the A200 previously and actually think the A230 has a better build quality. It just feels more solid. The grip is different for sure but I find it is manageable for me by placing the right side of the camera against my palm. Plus it's lightweight and this helps with the grip. You really cannot get an understanding of the grip by holding it in a store like Best Buy or Target where you cannot hold the camera by itself. I am not saying it's my favorite grip by any means but it is manageable.My main complaint in general usage is the lack of dedicated buttons. Many functions are menu driven. However in my case the main 2 options I change regularly are exposure compensation and ISO. There are dedicated buttons for these.Simply stated, the new kit lens is quite an improvement over the 18-70. I am no expert but the overall image quality was noticeably sharper across the entire range. It is still entry level in feel though. The thing that stands out to me as an improvement over the A200 is the auto white balance. It is very good and a definite plus for new DSLR users. I actually compared it indoors to my Nikon D5000 and the white balance of the A230 was noticeably better. The Nikon tends toward a warmer white balance in general and this drives me nuts honestly.Another aspect of the image quality that surprised me was its low light performance and noise performance. I tried last night to get it to take pictures without flash inside in a very dark room without flash. I changed to manual mode and raised the ISO to 1600 and then 3200. With the quality as JPEG fine, the noise was well controlled but noticeable, especially at ISO 3200. Then I changed to RAW and the difference was significant. I normally shoot JPEG but shooting RAW will make a difference when a special shot is needed or when the lighting is not optimal.One area the Nikon noticeably performed better was in low light auto focus. The Nikon can focus quicker than the Sony. However the A230 usually did not give up and could eventually focus.I personally do not use AEL or Kelvin white balance so Sony removing these features did not impact my decision to buy it. Each person will have to make his/her own opinion on the importance of certain features.In the end, the A230 won me over for its great out of the box image quality, fantastic auto white balance, excellent kit lens and reasonable price. I definitely recommend it.", "Date": "August 11, 2009"}, {"Title": "a230: great camera!", "Author": "abstractpavlin", "ReviewID": "RYNSSW80Q2EHW", "Overall": "4.0", "Content": "After about a week with this camera, I really like it. I am a photographer and I needed a D-SLR, I wanted to start small, but not too small, and cheap. I did do a LOT of research before buying this. I would not recommend it if you need to take lots of fast consecutive shots, 2.5fps (frames per second) is not the fastest.  Flash recovery time is a bit slow too. If you have large hands this camera might be strange too, the buttons have very little travel and are shallow and the grip is small. The menus and UI (user interface) are very very nice however. Easy to use and navigate. I really like this camera, it is basic, but has advanced features too. Color is pretty good, but for the best results you should play with the settings. Another plus is you can use Minolta lenses too. I would suggest going and buying a telephoto or zoom lens however, because the kit 18-55mm lens is not the best. Another thing is the shutter is kinda loud, not a huge down, but something to take note of. Also has a proprietary hot shoe (where you can attach an external flash) but you can buy an adapter online for about $5. The battery life is also pretty good. I really like it, and would recommend.", "Date": "November 1, 2009"}, {"Title": "Sony DSLR Alpha DSLR-A230L great quality", "Author": "Philip Henderson \"rpghsr\"", "ReviewID": "RIG5TA9PJFDVQ", "Overall": "5.0", "Content": "I have read the pros and cons from many reviews and I don't have much to add. Sony has given us much more quality than that for which we paid. I have been taking photo for 50 years and I am impressed.For those who wrote negative things, the solution is easy. Pay the extra dollars for what you are looking for. Sony is pricing this a lot lower than what it is worth.", "Date": "February 26, 2010"}, {"Title": "Excellent budget DSLR with access to an immense array of lenses", "Author": "I. J. J. Nieuwland \"Ilja Nieuwland\"", "ReviewID": "RBKC9EZ88A5TU", "Overall": "5.0", "Content": "First of all: I have never even held a Sony a200, so I can't compare it to the previous model. I did own a Nikon D70 and a D60, however, so I can draw some comparisons there.The reasons I decided to give up on the Nikons was twofold: first, the user interface that I just couldn't get along with and always found quite cumbersome. And then there's the issue of lenses. cheaper Nikons (such as the D60 or D3000) can only autofocus with AF-S lensen (which have the AF motor in the lens rather than in the body of the camera), which means that you'll have to manually focus older (AF) lenses. For me, that's not an option all the time. I bought a D70 body second-hand to use on my older Nikon lenses for that reason. The D70 wasn't perfect, however: it was an older device with the LOUDEST shutter I've ever experienced (not so brilliant for nature photography, then). But even IF you want to use regular AF lenses, the demand on the second-hand market is such that often, used lenses are hardly cheaper than new ones.After deciding that consultation of friends was pointless (photographers can get VERY partizan, esp. Nikon and Canon users), I decided to test a number of cameras for myself. The decision between this camera and the Pentax K-m was finally decided in this specimen's favour because of:- The user interface: everything is intuitively accessible. Sure, you need to read the manual, but you rarely need to refer back to it after you've used settings (my experience with the D60 was VERY different).- Weight and form: the device is quite light, but not so much that it feels flimsy in any way (admittedly, the Pentax 'feels' still more sturdy).- Picture quality. A detail (duh!) perhaps, but I found the pictures taken with the kit lens were just a bit crisper than the comparable Pentax or Nikon setup. Furthermore, in-body stability control works like a charm.But most of all:- This is basically a Konica Minolta camera, and (almost) the entire archive of Minolta lenses and flashes will fit. For under $100, I purchased some brilliant lenses (four in all) that would have cost me well over $500 had I chosen their Nikon alternatives. So on that score, it offers very good value for money as well. Sony hasn't artificially crippled this model like Nikon has, so any lens will work because of the in-camera autofocus motor.In all, very happy with my choice. The few idiosyncracies were things I could live with. For some, the lack of a live view on the display may prove to be a deal-breaker, but I never used live view anyway so for me it wasn't a factor.Good value for money, and brilliant value if you decide to hit the used lenses market.", "Date": "May 15, 2010"}, {"Title": "Sony a230 DSLR camera", "Author": "Jeffrey L. Jump", "ReviewID": "R7DDE6MR0OX6I", "Overall": "5.0", "Content": "Got this camera for my wife. We have three kids and take lots of pics. We had been using a point and shoot, which makes taking pics of the kids impossible. So, we went with this camera for the DSLR shutter speed. It is super easy to use right out of the box and took better pictures with the automatic settings than our old point and shoot ever did. There are some features that we'll have to learn how to use to get the full value out of the camera, but for someone wanting to go to the next level of picture quality and who isn't a professional photographer, you will be very happy with this one, especially for the value. PS - if you are upgrading from a point and shoot, just know that you have to use the optical viewfinder when shooting pics (that is, the lcd is only used for reviewing pics and adjusting settings, not \"framing\" pics). This was an adjustment at first since you can frame a pic with the LCD on point and shoots, but not with DSLR's. But not to worry, the quality of the pics and the shutter speed will quickly offset that inconvenience!", "Date": "March 17, 2010"}, {"Title": "Great Camera!", "Author": "Mo", "ReviewID": "R1URLLTDGJCHVN", "Overall": "4.0", "Content": "I love this camera. I tested other cameras in the same price range, but preferred this one.The portrait setting is great. I am used to shooting a 35mm SLR, so it doesn't bother me that the LCD screen doesn't display what you're shooting. The only con for me is that you usually need still subjects, pictures will come out blurry when your subject is moving too fast, unless they are well lit. However, it helps that you can adjust the shutter and aperture manually.", "Date": "December 2, 2009"}, {"Title": "Best value out there: switched from Nikon D90", "Author": "B. Redd", "ReviewID": "R3M4JUEYEL62UR", "Overall": "5.0", "Content": "This camera ROCKS!You can't get anything close to the same value from Nikon or Canon. I switched from a Nikon D90, and had a Nikon D80 prior to that. The value proposition of the Sony is way, way beyond either of those. It's not even close. Let me illustrate:You want to do indoor, somewhat low-light handheld shooting: this is a common situation. The ideal would be an image-stabilized fast prime. What's the cheapest way to do this with a Nikon? The 35mm and 50mm aren't image stabilized, and the 50mm (my favorite, and best for portraits) doesn't even have autofocus with the D3100 or D5000. You'd have to get a D90, which costs a LOT more. The 85mm has VR but is only f/3.5, a pain to use on any APS-C, and costs a mint. Basically, there are no good cheap options with Nikon. With Sony, it's a cheap camera with a cheap Sony or even old Minolta 50mm lens, and you're done.What if you want wireless flash? Even the low-end Sony's do that, not so with Nikon.Want to do bracketing? Again, included in even the low-end Sony's, but not with Nikon.Another great lens option is the Tamron 17-50mm f/2.8. A professional lens for cheap, that will benefit from the in-body image stabilization.Any way you cut it, the value is right here.", "Date": "February 25, 2011"}, {"Title": "My first DSLR, and I am Sony for life!", "Author": "Silverkoup", "ReviewID": "R33QTNE0G5QQ2E", "Overall": "5.0", "Content": "I purchased the Sony A230 2 days after Thanksgiving, basically as an impulse buy because I wanted a new camera NOW! I mulled around between this model, the A330, and a Pentax K-X. I decided on the A230 for 1 reason.....price. I got mine form walmart with the kit lens for $396 out the door with and extended warranty. The other 2 models were at  least another $100-$150 in price, so with that money I saved, I bought a lens, a minolta 50mm f/1.7 to be exact from around 20 years ago. This ability to use old minolta lenses was a huge selling point for me also. This camera really shines, I have found no reason's to rergret my purchase. The folks that complain ohhh it doesn't have live view.....boo hoo....what did people do before lcd viewfinders, looked through the viewfinder wow what a concept. To me the viewfinder make it feel like a real camera. The pictures come out crystal clear and the editing software, while not photoshop obviously, does the trick. All in all i suggest this camera to anyone that's looking to get into photography and are new to DSLR's. Take a look at some photo mag's Sony is on it's way up the A55 is camera of the year, yea better then Nikon or Canon, so I plan to ride the wave with Sony. DO NOT HESITATE pick this camera up. Lens options for this camera are also abundant and with steady shot inside, lenses are waaay cheaper the canon or nikon. Thanks for readinig and go already pick one up", "Date": "December 16, 2010"}, {"Title": "Nice starter kit", "Author": "ted", "ReviewID": "R10T365N5XXN05", "Overall": "5.0", "Content": "When my friend told me about this product on sale and my reaction was \"but it's a Sony... I don't want to have to start using memory sticks instead of the SD cards used in my other devices.\" and he pointed out that it uses both! Kudos to Sony for accommodating SD cards. Also, note that old Minolta autofocus lenses can fit this body too. I think it applies to all of them but the only one I know for sure works is the Minolta Maxxum AF Zoom 80-200mm lens.", "Date": "December 6, 2010"}, {"Title": "The right fit for me", "Author": "S. L. CHURCH \"S. L. CHURCH\"", "ReviewID": "RQL9VI7FNEXI6", "Overall": "5.0", "Content": "Right before Minolta was sold to Sony I purchased a digital Maxxum Dynax 7D. It is a nice camera but all those bells and whistles were a bit too complicated for me and because of the weight I almost always had to use a tripod which I really don't like lugging around or taking the time to set up. Mostly I would use my small point and shoot camera and leave the big 7D at home if I went out to take photos.One day I was at the local Farmers market and there was a couple there selling their photos. I stopped and talked to them and that's when I found out about the new line of Digital SLR cameras Sony was putting out. The wife had a new Sony Alpha 100 and was nice enough to let me play around with it. I was pretty well sold on a Sony after that but at that time just didn't have the money to spare.Now I'm glad I waited to buy a Sony Alpha because since that time at the Farmers Market there's more to choose from and I like the Sony Alpha A230L better than the Sony Alpha A100 because it's simpler and lighter.Oh, I have to mention another big plus is that I didn't have to buy new lenses because I can use my Minolta lenses! The one that came with it is very nice though so I might consider buying a couple of Sony lenses too.So for me, this camera is every thing I've been looking for. It's light, easy to use, easy to hold with my small hand, takes great photos and didn't hurt the pocket book either because Amazon.com had a great deal!", "Date": "April 6, 2010"}, {"Title": "The Perfect starter DSLR", "Author": "Sara Cobb", "ReviewID": "R266NA9RDELCUA", "Overall": "5.0", "Content": "It's my first DSLR camera, and before buying it, I was reading and looking on the internet for almost 4 months to buy the \"perfect\" camera (for me) to start my experience on DSLR. And after hundreds or reviews, specifications comparing with other DSLR from the same category (Canon XS, Nikon D300, Olympus E520) I think the a230 is the easiest to use and to start with. I'm not saying that the other DSLS are not better, the Canon and Nikon probably are, but honestly for my 1st touch with the DSLR, I guess this sony is from far the best camera (again, for me) according to its price. I was also going to get the Olympus E520 with 2 lenses, but I read a lot about it, and I found out that it has a major AF problem, and I didnt want to face that issue once I'm dealing with my 1st DSLR. The only \"bad\" thing about this camera is may be the miss of the live view option, but this is my \"DSLR beginner/point and shoot old user\" point of view, and I'm sure it's going to changer, a lot!Anyway, I totally do recommend this camera for a beginner DSLR user and especially for a low budget. 99% of the reviews i saw (easy to find, youtube : \"sony a230 review\") are saying that according to it's features, this Sony is the cheapest DSL camera ever.", "Date": "February 10, 2010"}, {"Title": "Amazing DSLR for $400 Price Range!!!", "Author": "Vanessa Nebenfuhr", "ReviewID": "R17I8PYGZB0AKP", "Overall": "5.0", "Content": "Hard to find a very good DSLR for under or around $400, and I am very glad I got this one!! Takes continuous shots at 2.5/sec with the right settings so I'm finally not missing anything like I was with my old one. Battery life is outstanding.The only negative I read in other reviews is that it doesn't show what you are looking at in the LCD screen, only the meters, but it seems to save lots of battery life (my old one had a live LCD and it sucked up the batteries) and all of the meter functions are in the viewing lens, so if you are used to a regular SLR it's even better.Closest thing to a real SLR with the ease of digital photos.", "Date": "April 11, 2010"}, {"Title": "Sony Alpha 230", "Author": "O. Verbovaya \"tissa\"", "ReviewID": "R1779UGXSZDUVJ", "Overall": "4.0", "Content": "I got the camera 2 weeks ago and so far I am very pleased. I am not a professional and I have always had a point-and-shoot cameras and this is my very first DSLR camera. For those who are looking for a DSLR camera on a budget this is a good choice! I can not afford a very expensive camera at this time, but this one is a good quality for the price you pay! Before I got it I read the revierws and I asked two professional photographers to look it up online and tell me what they think and both of them said \"it is not bad at all\" so I went ahead and got it. It is pretty easy to operate and I like the quality of the images and the overall appearance of the camera. I got an additional lense (70-300 mm) and I am very happy with this camera.Pros: decent quality for a relatively low price, good start for those who are making a transition from point-and-shoot camera to a SLR camera, you may buy additional lenses, tripods and otehr equipment and take the pictures you want, the battery life is pretty long, has many functions and settings for those who preffer manual mode and for those who do not want to mess with the manual mode.Cons: A230 one doesn't have a life view and it takes some getting used to, the one that has a life view is more expensive. No video. It comes without a camera case, you you will need to get one.", "Date": "February 16, 2010"}, {"Title": "My First DLSR and Im Very Pleased", "Author": "K. R. Webb \"vekxin85\"", "ReviewID": "R2H51YE2WY9S3O", "Overall": "5.0", "Content": "I've had the camera for a few days now. Its been wonderful. Many people online seem to complain about Sony's default settings for the camera. They say the color is \"off\" a little. I've taken of 400 pictures in a few days and haven't any problems with the colors of the photos. I recommend buying an external flash. Its been a big help.Sony HVLF20AM TTL Digital Flash for Sony Alpha Digital SLR Cameras", "Date": "December 13, 2009"}, {"Title": "Nice little camera, easy to use... good value.", "Author": "D Allen", "ReviewID": "R1KULBL78WF21X", "Overall": "4.0", "Content": "I bought this camera body used off another site.  My initial motivation to picking a Sony Alpha was the compatibility with Minolta lenses, I have a Minolta Maxxum 7xi with a full complement of lenses and I hoped I would be able to use at least a few them.  I checked into newer \"digital\" lenses, but decided to give my older lenses a try before putting out money on newer versions of what I already had.  One of my favorite lenses was the Tamron AF Aspherical XR LD [IF] 28-300 1:3.5 - 6.3 Macro so I put it on the camera and headed into the flower garden.  I am so glad that I didn't spend the money on a newer lens before giving this one a shot..the pictures turned out great!  The camera was easy to use right out of the shipping box, menus are fairly easy to navigate and it only took a few minutes to start shooting.  I am very pleased with the pictures (I am not a pro or a pixel counter).  Both the camera and lens performed wonderfully.  The camera has a good feel to it, light enough to carry but heavy enough to feel solid.  It does not have live view, I still prefer the viewfinder so that's not a big deal to me.  Shots are previewed on the display after shooting (you determine how long they show) BUT don't go by the preview screen - my only real complaint so far is the preview screen sucks!  After taking 30 or so shots and looking at each on the screen, I came back into the house thinking the camera was going back on the site I got it off of.  I pulled the memory card and put it in the computer, expecting to be disappointed...was I surprised!! So if you have Maxxum xi lenses and want to use them, get this camera (or another in the same line).  I read a post that said the older lenses (before the xi series) don't have TTL so you have to disable it in the camera to use them.  Not sure what they were talking about, but something to keep in mind; you want the lenses with 8 contact points.I know this review is supposed to be about the camera, but the camera requires a lens to work and one is only as good as the other...Camera pros:Light, easy to carry.  I have small hands and the buttons were all positioned where they were easy for me to access, someone with larger hands might find it kind of cramped.Easy to use...while it will take a while to learn all the features, it's nice to be able to pull it out of the box, charge the battery, put a memory card in, a lens on and go and know you will get good pictures.Can go from full manual to full Auto, plus 6 pre-programmed modes...sometimes you feel creative, sometimes you don't.10.2MP is good for most of us, I know there are 24MP (and higher) out there, but for most of us we won't notice the difference between 10.2 amd 24...we don't make poster size prints... we want nice pictures we can pass around or frame as 8x10's or 11x13, or show on the computer or web page.  If you are cropping to the point where you need 24MP, get a bigger zoom, LOL!Ability to use either SD card or Sony HG Duo.  You can have both in the camera and choose which one you want to use.Camera cons:Preview screen...the pictures all looked really \"soft\".Rechargeable battery... I know they are more eco-friendly, but I miss the ability to pop into a store and get a replacement battery if I'm away from home.  So far the battery life seems decent, but I will be buying a second battery before I do any day hikes.All in all, I am very pleased with the camera... no, it's not top of the line, but it's a great little camera for those of us who want nice pictures with the flexibility of a dslr without taking out a second mortgage to get it.  And keep in mind, the Minolta xi series lens work great and are fairly inexpensive.", "Date": "June 2, 2012"}, {"Title": "Alpha 230", "Author": "Alvin", "ReviewID": "RQIDAZT6AJHA4", "Overall": "5.0", "Content": "This is my first digital camera.  I am a long time Minolta user and chose the Alpha because my lens fit this camera.  I have had few problems adapting to this camera and this is perfect for somebody who used to shoot 35mm slr and is not happy with the point and shoot cameras that are very popular.  My initial experience has been very positive and I find the camera relatively easy to use.", "Date": "September 6, 2011"}, {"Title": "Great camera", "Author": "Karen Shiebler \"Karen\"", "ReviewID": "R6ZOUTIH1E5BV", "Overall": "5.0", "Content": "This camera is perfect for someone with a little bit of photography background, and for someone with no idea of how to take a decent shot.  It is easy, and can be fully automatic for settings, but can also allow more creativity with shutter speed, ISO, etc.  Great results with the macro and also with the quick action feature.  Fabulous!", "Date": "July 25, 2011"}, {"Title": "Excellent amateaur DSLR", "Author": "Coffee Lover", "ReviewID": "R3V8V1L4EEVAX8", "Overall": "5.0", "Content": "Purchased this camera to replace a film-plane body, using the same AF lenses. Took it on a two-week trip to Alaska and couldn't have been more pleased with the images in a wide variety of situations -- snow, sunlight off water, deep woods, evening sunsets, etc. Easy controls and comfortable hand grips make the camera effortless. A terrific value.", "Date": "September 13, 2010"}, {"Title": "A great camera for the money and overall", "Author": "Catherine A. Gagliano", "ReviewID": "R1G024LD0LICGL", "Overall": "5.0", "Content": "I bought this camera only a couple of days ago at a walmart in myrtle beach. I payed the exact same price as was listed online. The camera takes wonderful pictures and i have had no problems with it. I have taken over 300 pictures already and all of them have wonderful quality although some I really didnt care for.Pros: Beginners cameraEasy to use and learnGreat price. Don't think that because its cheap its not good! This camera has taken some pictures that are better then some canon cameras.Cons: LCD doesn't display what your looking at, it only displays the picture and your settings. You must look through the eye to take a picture(although in my opinion is a more true picture)", "Date": "August 25, 2010"}, {"Title": "Sony dslr A230L", "Author": "Gary I. Thornley", "ReviewID": "R2R4VS4J7XC2OW", "Overall": "5.0", "Content": "Everything is great with this product and provider of services.  It arrived on the date promissed in excellent condition.  The camera does everything that I need and then some.  The pictures are beautiful.  I would recomend this item to anyone who is looking for an easy to use dslr that gives great results.", "Date": "September 5, 2009"}, {"Title": "BOON FOR BEGINNERS", "Author": "John Stephens \"Claude Balz\"", "ReviewID": "R2UY907KX7OEUW", "Overall": "4.0", "Content": "This camera is excellent for the price. I purchased it specifically because it uses bayonet mounted lenses, so I could use the lenses from an old school film camera no longer operational. There are so many sophisticated features that I had to spend time studying the manual, but it was a labor of love. It's great to have so many variables in so small a package.", "Date": "January 7, 2014"}, {"Title": "Its one of the best", "Author": "girish", "ReviewID": "R3QZ5HNJHYXJBT", "Overall": "5.0", "Content": "its a amazing product i trust amazon i go .....i go with customer review which is updated in website .", "Date": "August 30, 2013"}, {"Title": "I'll be an A student this semester", "Author": "SMiles", "ReviewID": "R1QXHD6XX7N4UX", "Overall": "5.0", "Content": "I ordered this camera for my photojournalism.  class in the fall, but was happy I had it in time for my mother's retirement party. I'm still getting used to the functions, but seems to work great.", "Date": "July 13, 2013"}, {"Title": "Good Camera!", "Author": "Ashan Jayewickreme \"J\"", "ReviewID": "R2394E4VYQMV5E", "Overall": "5.0", "Content": "Vendor was good! Camera was Good! had a lot of fun with it! do recommend it to anyone who is just starting of with a taste for photography!", "Date": "January 4, 2013"}, {"Title": "Great camera", "Author": "Sean", "ReviewID": "R26ZUGZ88Z4LQM", "Overall": "5.0", "Content": "Couldn't be happier. This is a great camera at a great price.  I also like that I can expand its capabilities by purchasing different lenses n filters for different applications", "Date": "December 28, 2012"}, {"Title": "Amazing for my first SLR", "Author": "Josh", "ReviewID": "RHSXO38CMHCRR", "Overall": "5.0", "Content": "I got this camera a few days ago at walmart, i was on a budget for around 300 so i knew i wouldnt be able to get a nikon or canon, but i saw this on the clearance table for 289 so i grabbed it. Ive been messing with it and taking endless pictures with it. Im using everything on manual as i find it better to use. I love this camera, it takes really nice photos, even in the dark. Though it does get alittle grainy at high ISO but i expected that. If you're on a budget and want an entry level SLR i recommend this camera, though its not in production from sony anymore.", "Date": "December 24, 2012"}, {"Title": "I love this camera!", "Author": "Mindy \"Mindy\"", "ReviewID": "REU4D3HJWFVPU", "Overall": "5.0", "Content": "This is absolutely an amazing camera for the money.  It takes wonderfully vivid pictures that end up looking quite professional even in an amateurs hands.  Now, this isn't a $5000 camera so I'm not comparing it as such, but truly it's perfect for those looking for great results as several steps above a snapshot.  Initially my disappointment was in the camera's lack of a live view on the LCD screen.  When I did my research I learned that this saved me quite a bit of money because the camera switches from the live view as the mirror is moved out of the way of the shutter to take the shot.  This method seems to make sense, just as the old SLR's of old.  Once a person gets used to it, it's simply a matter of habit.", "Date": "February 21, 2011"}, {"Title": "Amazing Camera", "Author": "Katie", "ReviewID": "R1EVWOLJK50FRK", "Overall": "5.0", "Content": "The Sony A230L Digital SLR camera is a great product if you're interested in photography. It's easy to use help interface helps for beginners to learn the ways of this camera easily and quickly, then you're off shooting. I'm someone who researches things that I am getting ready to buy and this Sony camera is amazing for it's price. The photos come out beautiful, the portability of this camera is simple and easy and the camera is just all around amazing. I recommend this product to anyone who is truly interested in getting a start in photography.", "Date": "January 6, 2011"}, {"Title": "Very clean images - high IQ", "Author": "now what", "ReviewID": "R3EBD7BKVWA5V4", "Overall": "4.0", "Content": "This review is based purely on results.  A friend in Brazail sent me a few photos, as email attachments, taken with his camera.  They are, in a word, perfect.  Very clean, true-looking colors, and true-to-life images (beach and surfing) in high-contrast and difficult tropical light situations, both landscape and action.  Very good preservation of both highlights and shadows.  One test of good IQ is to enlarge the image (which I had to do in order to select, print and frame the portion that I wanted).  Every one of these photos can be enlarged until it turns to pixels, and you won't see one bit of noise.  Absolutely smooth.  My own cameras (Canon, Pentax, Fujifilm) range from 12+ MP to 16+MP and I honestly can't say that they produce better results.  (Greater definition, yes, but not any cleaner or smoother.)  I'm not going to rush out and buy this camera (I can't afford another one!) but I have to recognize quality when I see it.  I had a different Sony and returned it due to noise and failure to preserve highlights and shadows.  If it had been as good as this in terms of IQ, I would have kept it.  For the price, this camera probably rates 5 stars due to the results it produces, but I gave it 4 because I don't know how it functions in other respects.", "Date": "July 21, 2011"}, {"Title": "Not for people with bad vision", "Author": "Monica S. Lim", "ReviewID": "R3PUU6O4464FNV", "Overall": "3.0", "Content": "This is my first dslr camera. I had the camera for about 2-3 weeks now for my photography class at my university. I have always trusted Sony's brand and was basically raised on it.It's not a bad camera for beginners like me who are just taking a photography class out of a requirement or if you want to pick it up as a hobby with out spending an arm, leg, and other body parts. It has good crisp, clear images. I even managed to get a picture of one of my small flower buds as it was beginning to open up. It has a huge wide range of colors, easy to use, light weight which is nice because I have a long commute on public transit, basically everything you're looking for in a camera.CONS: I have bad eye sight. Lazy eye plus astigmatism in one of my eyes and astigmatism in the other. I own a Sony Cyber Shot which comes with the \"live view\" of being able to actually see what you are taking in the lcd screen. This camera does not have this feature. You have to look through the eye piece in order to see what you are about to take. And if you have bad eye sight like me, that is a pain in the butt, especially if you have no tripod on you and are trying to take a picture of something with the larger lenses, which yes this camera is lighter then most cameras but it gets pretty heavy with the larger lenses. I can't stand the fact that it doesn't have a LCD screen which you can see out of. Why do I have to pay $200 - $300 for basically the same camera just to be able to see through the LCD screen?Honestly, I'm beginning to wish I got the Nikon D060 instead. The bundle is nice but not really worth it.", "Date": "September 15, 2009"}, {"Title": "Good seller - Good product - Great shipping", "Author": "Andrews", "ReviewID": "R2F7ZW1DPMW143", "Overall": "4.0", "Content": "I recieved this camera with everything including the box, manual, lens, lens cap and accessories.  The battery even came half charged, not drained, so I wouldn't have to spend hours charging it.  I could use it right away.  I used my own memory stick but that's okay because it was stated as such in the original description.  The shipping was great it reached me quicker than expected, less than a week including weekends.  There were no defects.  There were no scratches or scrapes.  The camera was clean as if the pre-owned camera was used once or twice and put back in the box.If you're looking for a slim, pocket sized camera, this is not for you.  This camera is something you will definitely be hanging from your shoulder or in a bag.  Compared to the non DSLR Nikon L100, in size, the Sony A230 is slightly bulkier but not heavier, I own both.  The basic 18-55mm lens that comes with it is nice for close shots but if you're looking for a 15x like the Nikon L100 or higher camera you'll have to buy a better lens.  The options are okay.  The photo does not show on the display until you take it, rather the display shows options or stats.  You look through the lens to zoom in and out via lens.  I really like the picture quality.  Of the 500 pictures I've taken in the past month, not one comes out blurry.  Auto and Manual, changable lens and photo delay are a plus.  I like the rechargable battery concept, very portable and wireless to charge.There's probably other things I missed in the review.  The only flaw I could think of is that when you click for one second and it flashes but does not take a picture, you have to hold it for a second or two as oppose to taking it right away, I reset the settings and much better and it got better.  It's a nice entry level DSLR.  I like it because it takes really clear pictures, again entry level photographers go for it.  The alternative was the Nikon D3000 but I couldn't find a review that gave a huge difference between the two.  This coming from a Techie by trade not a photographer.", "Date": "September 1, 2010"}, {"Title": "Excellent entry level DSLR", "Author": "Peich", "ReviewID": "R2OXAQDTGSSYDC", "Overall": "4.0", "Content": "I have just received this camera today from Sony and I have taken about 250 photographs to test it. I am coming from a fuji S602 bridge camera that has done a great service for many years and I wanted to upgrade to a DSLR.I have gone across so many  reviews and websites for taking a decission and my final options where the Alpha230, Canon Rebel XS and Fuji HS10 (which is not a DLSR). I went for the A230 because I found it at a very good price and I expected to take much better pictures with a DSLR than with a bridge camera.My first impression of the Sony is that it looks and it handles nicely but it lacks several interesting features that might be more important than what I initially thought, such as \"live view\",  tilt in screen or video. I knew that before buying it but now I miss them.Regarding merely photographical aspect, which is the reason for buying it I am pleased with how responsive, fast and smooth a DSLR is compared to my old bridge camera. However, photo quality is not as good as I would expect.Images definitely look sharper, but the color, aperture of the lens, automatic modes and the balance of the lighting on the image are not at the level I would expect.Actually, I am considering returning this camera and buying a Fuji HS10 as I love the colors that my old fuji provides and I expect to be even better in the newer models.I would be very glad to know somebody else's impressions and if somebody has been able to test the HS10 against a DSLR.This weekend I am going to make a face by face comparison between my new Sony A230 and my old Fuji and if I do not see a great difference I will go for the Fuji HS10.Any opinions are more than welcome.***************** Upate on January 12, 2012********************I finally kept my Sony Alpha and after using it extensively for 8 months I am in love with it.Unlike with other point and shoot and bridge cameras I have used, I can tell that if your photos are not good are just because you have not take them properly and it is not this camera's fault.- I always shoot in RAW and the colors and image sharpness are excellent.- The camera is lightweight and portable to be a DLSR. Very nice as a DSLR for travelling.- The grip is not very good but I am used to it now, and it makes the size of the camera significantly smaller than some competitors.- It might be too simple and may lack some features for advanced amateurs. However, you can really take professional quality pictures with this camera and I would rather spend the money in a good lense rather than trying to get the super high speed shooting camera or the ultramegapixel one.Overall I am really glad with it and it is one of the best value for money things I have ever bought.", "Date": "April 20, 2011"}, {"Title": "Nice camera", "Author": "Susan Rushing", "ReviewID": "R3H8O3J7HLQ0AB", "Overall": "4.0", "Content": "I am looking to buy a new camera, my daugther dropped our nice Kodak. Growing up we always had a SONY and loved it. My dad still has his and it takes amazing pictures. While I did not locate this camera on my own, was brought to it via another site, I am glad to have found it. The in-body SteadyShot alone is a feature I truly need, with a 4-year-old who loves to take pictures, the 10.2 megapixels don't hurt either!The reviewer was compensated for posting this review. However, the opinion stated in the review is that of the reviewer and the reviewer alone. Further, the reviewer independently selected this product to review and has no affiliation with the product maker/distributor, Amazon or the review requester.", "Date": "February 13, 2011"}, {"Title": "Sony Alpha 230", "Author": "Karen K. Wolanin", "ReviewID": "RN4MIGI4YF0SI", "Overall": "4.0", "Content": "The Sony Alpha is a great camera but the lens supplied just doesn't have the crispness other cameras have.", "Date": "March 15, 2010"}, {"Title": "very poor build quality", "Author": "photographerNW \"photographerNW\"", "ReviewID": "R2PTTFCZCDU42D", "Overall": "1.0", "Content": "I am really frustrated with Sony and my Alpha DSLR, a product with inferior build quality and a customer service that lays the blame on me instead of acknowledging quality problems. I have bought it sometime in 2007 and only had problems with it. After some weeks it just wouldn't turn on anymore and it took Sony several weeks to get it repaired and back to me. Now when I take pictures the resulting file shows a different field of vision than what the viewfinder showed me. Even worse, there is a black right upper corner in every one of my picture. After several tries to get to the right person to help me, Sony told me that any repair would cost a fixed amount of £114.56. Without even knowing what is wrong with my camera. Asking if this functional failure is normal for a Sony product after three years, I was told that this is normal \"wear and tear\". For me a camera that is expected by the producer not to last longer than the guarantee period of one year, is not worth paying for. My next camera, or any electronics product for that matter, will for sure not be a Sony product. I recommend for everyone planning to buy one of their products to think hard about how long he/she plans to use it for.", "Date": "June 4, 2010"}, {"Title": "It's ok", "Author": "shopping fiend \"sappy\"", "ReviewID": "RIOFR2LQB1H6Q", "Overall": "3.0", "Content": "I think most people decide to go with a DSLR because they've got a friend with one that takes fantastic pictures and they want to get that themselves.  I knew going in that I would have to learn how to use it.  I bought this camera on sale for $399 and hard a really hard time getting good pics out of the camera.  I think out of hundreds of pics I took while I had it, I thought 3 were really good.  I bought a telephoto lens to see if that would help but it didn't.  The pictures had no color, were not sharp, and terrible DOF.  I probably could have been able to eventually use it to its fullest potential but I want good photos now.  I finally took this one back and decided on a Nikon D90.  I am going to get in in a week (come on Amazon!)  It's a lot more but I think if you really want a dslr it's because you want GREAT pics, not just pics that are better than a point and shoot.", "Date": "February 25, 2010"}, {"Title": "Chad", "Author": "Chad D. Williams", "ReviewID": "R36GF1PI0CVZVI", "Overall": "1.0", "Content": "We bought the Sony a230 at Costco and loved the camara with the exception that it doesn't have live view meaning you can't see what your taking a picture on the display, you have to look through the viewfinder.  I can't go back to looking through a viewfinder after being able to look at the display.  We ended up taking the camera back to Costco and will look for something with live view.  After talking with Sony the a300 and above all have Live View.", "Date": "April 28, 2010"}, {"Title": "I expected better from Sony...", "Author": "kingrebe", "ReviewID": "R3928O5VEPJVOU", "Overall": "1.0", "Content": "It blurs even slow moving objects in sports mode.  My child was just walking by and his face is blurred...big time....I bought the camera because it focused so quickly..DON'T BUY IT unless all of your subjects will be sitting still.", "Date": "June 29, 2009"}], "ProductInfo": {"Price": "$449.00", "Features": "10.2-megapixel APS-size CCD image sensor for ultra-fine detail\nIncluded SAL1855 18-55mm standard zoom lens\nSteadyShot INSIDE in-camera image stabilization; Eye-Start Autofocus\n2.7-inch Clear Photo LCD Plus display\nCompatible with high-capacity Memory Stick PRO Duo, Memory Stick PRO-HG Duo and SD/SDHC media (sold separately)", "Name": "Sony Alpha A230L 10.2 MP Digital SLR Camera with Super SteadyShot INSIDE Image Stabilization and 18-55mm Lens", "ImgURL": "http://ecx.images-amazon.com/images/I/41LLdGAggiL._SX300_.jpg", "ProductID": "B0029U0WWU"}}