{"Reviews": [{"Title": "great out-of-camera images", "Author": "John Trent", "ReviewID": "R24ZFL3LCY6COA", "Overall": "5.0", "Content": "Probably too soon to review, but I'm responding to an e-mail from Amazon to review my recent purchase.  This is my fifth DSLR (Nikon D50, Olympus E-300, Samsung GX-1S, and Sigma SD14) and I have to say it has the best out-of-camera jpeg image quality of any camera I've owned to date.  I've long liked Olympus's auto tone correction feature in their software, and now it can be applied in-camera at the time of capture (now called shadow adjustment technology and set by choosing auto gradation in the menu).  Tonal range is quite natural, with open rather than too dark or blocked up shadow areas, yet retaining good snap and contrast to make bright, sunny days look bright and sunny.  The ESP metering (a multi-segment pattern) has proven quite reliable as has auto white balance.  I don't like having to post-process to get image quality I like, and the E-450 has been very good in this respect.I've also decided that I have no need to replace the 14-42 kit lens that comes with the E-450 any time soon.  Based on test reports, I just don't see any other available lens providing a noticeable image quality improvement for my needs.  Almost all my shots are at my favorite 25mm focal length, outdoors in daylight conditions, and I prefer deep depth of field.  The kit lens gives me no perceptible geometric distortion, no vignetting, well-controlled flare and chromatic aberrations, and sufficient resolution and contrast as to be indistinguishable from the higher-priced optics (according to Popular Photography's SQF charts).  Plus, its light weight balances well on the little E-450 whereas the more expensive optics would all be somewhat front-heavy.I downgraded the camera one star for features simply because it would have been nice to have separate buttons for auto-focus and auto-exposure lock.  I have set the AEL/AFL button to auto-focus for me, but that leaves metering tied to the shutter release, which wouldn't be my first choice (though the ESP metering has been so good that it's a minor quibble).  One of the best Olympus features has been their sensor dust reduction system, consistently rated as the most effective currently on the market, and I've had no sensor dust issues so far with Olympus DSLR's.", "Date": "November 7, 2009"}, {"Title": "Good Camera--a slight improvement over the E-410", "Author": "Robert A. Marvin", "ReviewID": "R3K3JCSC3QOKIP", "Overall": "5.0", "Content": "I bought an E450 body from Cameta, as a replacement for an E410, which I accidentally damaged (the replacement body was cheaper than the price Olympus estimated for a repair). I thought I had no interest in the additional features. I don't use live view, so the improvement in focusing wasn't important and I certainly  will never use the \"art filters\". However, the improved, clearer display of camera settings(f stops, shutter speed, ISO, etc.) on the LCD screen IS a significant improvement IMO.", "Date": "September 26, 2009"}, {"Title": "Worth every penny.", "Author": "OzzyCoop \"Nate\"", "ReviewID": "RI6CBI7YAGDK6", "Overall": "4.0", "Content": "I needed to replace an e-500 and couldnt afford the e-620. I had a very tight budget and this fit it. I wanted a more serious camera then the e-500 and liked the e-620. I ran across this and remembered how much I like the e-410 and 4** cameras. I took a chance on this because every post I read about these complained about how all it is is a 420 and it was marketed toward the \"point and shoot grandma\". I was worried but I know Olympus is a quality company and decided that I really couldnt afford a new camera but bought this anyhow. It was worth every penny. I really liked the e-500 and this is (as it should be) bounds better. Dont let anyone who makes fun of the art filters and whatever put you off. It takes excellent quality pictures(not as excellent as the 620 of coarse) and is every bit as versatile as the others in the Evolt entry dslr series. The size is incredible like the other 4** models. Not big like the 500 but not small either. It isnt pocketable but it is very portable. The liveview isnt great but it is very helpful when the circumstances require it. The live view isnt for action shots. I use it for landscape and flower macro and it works great.If there is a lot of motion use the eye piece.  The camera dosent have true IS but switch it to DIS through the art menu and it does a well enough job in underlit rooms and and places you cant take a tripod. Again it isnt true IS so dont expect miracles but it can get you to a slightly slower shutter speed without tons of shake if any at all.I believe it boosts the ISO and uses a faster shutter speed along with some other setting adjustments. I am a tripod person anyhow so I only use DIS occasionaly. The face recognition is ok. The shadow adjustment is ok. It is very rugged and well built. I got it with the 14-42mm and I love it. My other Zuiko lenses from my 500 go well with it. The 35mm macro was made for this camera. I must admit though that because of the 450's smaller size the 150mm lens takes some use to getting the hang of holding. I like the button layout better than the 500. I love the almost non-existant hand grip. I have long skinny fingers so i can hold it comfortably for long periods of time. It compares to the rest of the Evolt series rather well. It isnt a $1200 camera but it is just as good of a performer. I am surprised by the 3 point auto focus system but I guess for its size they needed to cut a couple corners. I used the 500 for years so i am just used to it. I think the 620 has a 7 point AF setup. It isnt a problem for me. I dont like the placement of the usb cable video out thing but that is minor. The art filters are for some and not for others. I have cameras that I like to take pinholes and pop art with so I use those. I dont think it looks as nice as the real thing anyhow but to each his own. The 620 is great and has many features this dose not(not to mention a 12mp sensor and the tilt LCD screen and the fact that it is around $700 so yeah it will be better). As far as image quality goes the 450 is right up there. I truly think that the colors this camera produces are more true to life than most dslrs are. Olympus makes the best entry level dslrs anyone will ever make.", "Date": "October 12, 2009"}, {"Title": "Hot damn!", "Author": "SpEd", "ReviewID": "R1EK0NTW0SX4SL", "Overall": "5.0", "Content": "As a replacement for my very old, much lamented (and malfunctioning) Yashica SLR, it has returned me to the real camera world. I have confront the conflict between my Ludite side and the understanding that automatic functions exceed my expectations. It makes taking picture (almost) too easy. Soon everyone will be doing it. Nice camera. Great price.", "Date": "October 11, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002GILU44"}}