{"Reviews": [{"Title": "Forgetaboutit", "Author": "Charles Foundyller \"James\"", "ReviewID": "RBT1QM7K83J5N", "Overall": "1.0", "Content": "This item is borderline useless.  Its images are mostly out of focus; the contrast is so poor you have to know what you are looking at to understand what it is; and the focal length is so long that it's useless in confined spaces.  I wish I could return it, but it's non-returnable. Stay away. It's a waste of money.", "Date": "January 25, 2010"}, {"Title": "Stay away!", "Author": "Robert C", "ReviewID": "R3CNHDOD3IA0MS", "Overall": "1.0", "Content": "These seem to be hit or miss with quality... mine missed.  The image is so blurry that you cannot tell what you are looking at even when you are within inches of it.  There is no way to focus, the LED lighting is supposed to be adjustable but is really off or on.If you can't get a good return policy, I would spend a few extra and get on with a better screen. Luckily I was able to return mine.", "Date": "December 25, 2010"}, {"Title": "Great for what it's meant for", "Author": "Nicholas J. Steele \"pixel pusher\"", "ReviewID": "R2ULOGVOLEX6ET", "Overall": "5.0", "Content": "The cable thickness does limit what you can use it for, but it's meant for looking behind walls, etc.  and it does that job perfectly.  It's fairly sturdy and the camera does not bend much, which is exactly what I needed it for.For the price, this is the best product of it's kind that I could find.  The LCD is removable, so you can hold it about 20 ft or so from the actual camera, and you can TV out the output of this to a laptop or recorder.Quite good for the price.  Maybe next time they will make the cable smaller and more flexible.  Till then, this is a great deal instead of an awesome deal.", "Date": "September 15, 2009"}, {"Title": "Not as advertised", "Author": "SocialDragonfly", "ReviewID": "RXF0ETZUNBD86", "Overall": "2.0", "Content": "I purchased this product due to one of the photos which showed a person looking at the inside of an engine. It appeared that the man was looking into a spark plug shaft to view the inside of the engine, presumably the cylinder walls. This is impossible due to the end of the fiber optic being to wide for the spark plug shaft. Very disappointed about the false advertising.", "Date": "June 25, 2011"}, {"Title": "Great utility but fairly cruddy image", "Author": "Lianimals", "ReviewID": "R255VLOZ55ZDK1", "Overall": "4.0", "Content": "We use this as a 'quick and dirty' method of looking into animal burrows and although it's adequate for visualizing larger critters, the lens of the camera is definitely not suited for much abuse.  After about 6 months of light duty, the image appears mildly unfocused and it's difficult to see the LCD screen in any sort of sunlight.  Makes me wish I had purchased a tool with better quality imaging but it fits the bill if image quality is not of utmost import but low price is.", "Date": "January 9, 2013"}, {"Title": "Overall very nice", "Author": "Goharma", "ReviewID": "R2B7S7FOPX1XPP", "Overall": "5.0", "Content": "GOOD: Overall very good, build quality is good, picture is good, underwater images are goodBAD: Manual is not useful, no way to focus, detaching the monitor shows interference on the screenI just bought this to play with and to have if I ever needed it for some reason.", "Date": "August 2, 2011"}, {"Title": "Great deal!", "Author": "J. Hertel", "ReviewID": "R36G6AURSGZ4UN", "Overall": "5.0", "Content": "This camera works well and the removable lcd wireless screen is great when manipulating the camera into tight spots. The image rotate function is very nice when trying to identify writing that may be upside down; essential when inspecting drywall.", "Date": "December 3, 2009"}, {"Title": "No SD Card Storage", "Author": "Glenn Stephens", "ReviewID": "R30V371QTRNNHY", "Overall": "3.0", "Content": "The downside is that this particular camera does not store the photos onto a SD Card of any size. However, the Snake Camera & Light are very Good", "Date": "December 11, 2013"}, {"Title": "Wireless Waterproof Snake Plumbing Sewer Inspection Camera with 2.5 TFT-LCD...", "Author": "Dennis W. Sitherwood \"maintone\"", "ReviewID": "R1PLBVB70J75HU", "Overall": "1.0", "Content": "This item was presented as a new item, but when I received it, it had been used by someone with greasy hands which led me to believe this was a used item that I sent back, as a Federal employee, we are not allowed to purchase used items.", "Date": "September 24, 2013"}, {"Title": "Not recomended", "Author": "Best tool", "ReviewID": "R3CE4QD9ZWO1SF", "Overall": "1.0", "Content": "I bought this tool thinking that will be helpful, I used 2 times and for the third time the monitor didn't turn in. Whatever I do if that doesn't work this tools is useless, Not recomended!!", "Date": "August 11, 2013"}, {"Title": "Worked well", "Author": "Stephen", "ReviewID": "R9N16Z73XV9Q9", "Overall": "4.0", "Content": "Head was too big for inside spark plug hole but it worked well as said.  Much less expensive than others", "Date": "May 9, 2013"}, {"Title": "snake camera", "Author": "flyboy", "ReviewID": "R1C0Y4WRBNDGS3", "Overall": "5.0", "Content": "This camera works great! it works better that some I have used that cost more than $300. The wireless display really makes this camera much easier to use than the one that are wired to the snake. Great picture quality and a great deal.", "Date": "July 24, 2012"}, {"Title": "john", "Author": "utilityjohn \"johnjpc\"", "ReviewID": "R1E8T5MEX1WTDH", "Overall": "5.0", "Content": "I would compare this to the high priced version only better,you have the removable monitor that they dont,believe me it makes a big deal.", "Date": "March 20, 2010"}], "ProductInfo": {"Price": "$94.99", "Features": "This innovative new inspection tool allows for easy visual inspections in hard-to-reach areas, even in total darkness or under water.\nIts comfortable pistol grip design and forward facing controls make it easy to detect and diagnose the unreachable.The Snake Sewer Inspection Camera provides solutions whenever and wherever you need them.\nWireless Inspection Camera with LCD Monitor be your eyes and hands while you look inside walls without tearing them apart, search behind appliances and other difficult places for lost items and hundreds of other uses. Allows for easy visual inspections in hard to reach places.\nMini water-proof camera with 1m(3\") flexible extended tube,2.5 TFT-LCD wireless monitor with rechargeable Li-battery\nWaterproof Level: IP67 with Underwater,Night Vision Range:1.5m,Lightweight, handhold design for easily find, diagnose and solve problems,3 useful accessories includes: hook, mirror and magnet", "Name": "Wireless Waterproof Snake Plumbing Sewer Inspection Camera with 2.5 TFT-LCD Color removeable LCD Monitor", "ImgURL": "http://ecx.images-amazon.com/images/I/41R8f7D21SL._SX300_.jpg", "ProductID": "B00273Y8AQ"}}