{"Reviews": [{"Title": "I do not recommend this camera", "Author": "mckaylively", "ReviewID": "RXS3MQ60BP62L", "Overall": "1.0", "Content": "I purchased this looking for an inexpensive, small, lightweight camera to suppliment my Fujifilm camera.  I wanted something that was easy to stow in my pocket but still took good pictures.  I did find a small camera that was a perfect fit for any pocket (price wise and size wise, I must say), but that's about where the good ends.This camera has several modes that allow for the user to adjust picture settings, but after playing with all of them for a week and taking numerous pictures inside and outside with good light and low light, I didn't have one \"good\" picture.  By \"good\" I mean every picture turned out so fuzzy that I trashed them.  No matter what setting or light condition I took pictures in, I could not get a clear picture with this camera.  Every single shot came out fuzzy with dull colors.  Needless to say, I returned this camera.Yeah, this is a $50.00 camera, I know.  Still, though, I at least expected clear pictures.  What good is an 8 mp camera do if it doesn't take good pictures.The answer is no good at all.", "Date": "October 19, 2009"}, {"Title": "Crappy", "Author": "M. Kendall", "ReviewID": "R2UEWL4VLNGK79", "Overall": "1.0", "Content": "this is a very crappy camera...i bought it for my mother ...but i get so much issues with it i am so disappointed with my purchase....the camera automatically starts on the 3MP miode and u have to change to the higher MP all the time and its jus too shabby made i am extremely disappointed ...will never buy another camera like this again", "Date": "October 11, 2010"}, {"Title": "Big things comes in very small packages", "Author": "Avet", "ReviewID": "R2K97NAILS0G39", "Overall": "5.0", "Content": "I didnot have much money left over from the purchases of my laptop, but with the little that i did have to purchase a digital camera just to have in my bag, but I didn't expected to much from it. To my surprise I got a whole lot more than what I expected to recieve, this little is camera is awesome love it don't go onewhere with out it.", "Date": "August 12, 2012"}, {"Title": "Do NOT buy!", "Author": "LovesAGoodBook \"always looking for a good book\"", "ReviewID": "R146WP0FB2JKPX", "Overall": "1.0", "Content": "My 6-year old twins received a Vivitar Vivicam as a birthday present.  It was awful!The camera takes lousy pictures (not one photo they tried to take came out clearly).  The SD card slot is open (there is no cover/protection).  The batteries have lasted for about 10 photos and now the camera will not even turn-on.  It has 1-star because 0 was not an option.", "Date": "May 13, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002DZI8OA"}}