{"Reviews": [{"Title": "GREAT LITTLE CAMERA", "Author": "Phenix", "ReviewID": "R1AKDVRES1BAAE", "Overall": "5.0", "Content": "I really love the Olympus FE-5020.  It produces very acceptable images for this price range.  Olympus is a brand you can rely upon.  I also own an Olympus Stylus 500 which I bought 5 years ago and it has produced many great images.I see that the two previous reviewers here have decided to return their cameras.  Don't let that turn you off this camera.  I am very fussy about picture quality.  I was a professional photographer for 20 years before I left the business.  Sure, there will always be cameras that take better pictures, but for this price range you won't go wrong.The thing about this camera that really appealed to me is the 24mm lens.  I also own a Panasonic FZ28 and a Sony HX1, and while they are both superb cameras, they only go down to 28mm on the wide end of the zoom.  The Olympus  FE-5020 nicely fills that gap.  Another thing I love about the FE-5020 is it's compact size.  It fits in my jacket pocket and will go with me everywhere.  That's a bonus because you can't take photographs when the camera is sitting home because you didn't feel like lugging it around.I don't find the controls too small.  I'm a guy with large hands and have severe carpal tunnel syndrome but I manage nicely in navagating the camera settings.It is true that you will probably need to manipulate the photographs on a computer.  I believe that the beauty of digital photography is the ability to work on a computer rather than breathing the toxic fumes of a darkroom.  To me, digital photography is 50% camera work and 50% computer enhancement.  If you're not onboard with this, you may want to look elsewhere.  The images I enhance on the compter are great.  You can either use Picasa which is free or the Olympic Master software included with the camera.  I start out with Photoshop Elements 6, enhancing contrast and color saturation.I opted for the dark gray FE-5020 because I'm old school and think a camera should only be one color--black.  I was happy to discover that the dark gray is actually closer to a dark navy blue so I got pretty close to having a black camera.The neopryne Olympus camera pouch advertised by Amazon fits the camera beautifully and is very nice.  I'm going to order another Lithium battery because I'm running it down in about 2 hours of shooting.  It would probably last most people longer than that, but I'm always checking each image, zooming in and out of the captured image which really eats up power.  I also walk around with the camera powered up when I prowling for shots.I hope this information is helpful to anyone interested in the camera.  I've had mine for about 5 days and just love it.  I will try to post a photograph in Customer Images, but I've tried this before and my pictures exceed the size they allow you to post.Enjoy your image making.  I hope you enjoy photography as much as I do.", "Date": "October 18, 2009"}, {"Title": "Looks good for the price, but lots of flaws", "Author": "Russell N. Balliet", "ReviewID": "R2EIATB884I7RY", "Overall": "2.0", "Content": "My Canon SD850 got claimed by the sand dunes recently so I needed to replace it. I was looking for something with a wide angle lens at a decent price. After some research I decided to purchase the Olympus 5020 and here are my thoughts after some time with the camera:First off the image resolution is decent, but the colors are very flat and don't seem very accurate. Sure you could fix this in post processing, but you shouldn't have to do that. The camera does seem to do well inside with flash as long as the subject is within a few feet. I actually probably could have dealt with the color issue, but the more I played with the camera the more I got annoyed by some other things. Olympus boasts about AF tracking and face recognition, but these modes do not operate simultaneously, you have to pick one or the other and at that neither seems to work well. Also, the stabilization that is a standard feature on most cameras doesn't operate all the time, but has to be selected as a separate shooting mode. One really odd thing that I couldn't figure out is when in the standard \"P\" mode the camera doesn't shoot in full 12mp, but only 5mp; I went through all the settings, but couldn't figure out why this was happening. Macro mode leaves a lot to be desired, the documentation claims 3cm, but the best I could do was about twice that distance. There's pretty much 0 user control; in some settings you can change the white balance and ISO, but that's it.Most of the controls are within the menu system, which is easy to navigate, but it means a lot of button pushing to change the type of AF or shooting mode.  There are a lot of different scene modes to choose from, but if you want to change the one you're using you have to cycle through all the shooting modes back to the scene mode and pick the new one you want. In my opinion all this stuff should be at the fingertips; not buried in menus. The construction of the camera also feels cheap, the D-pad on the back feels very flimsy and \"clicky\" when used and the battery door feels like it would snap off very easily. Overall the construction and controls are very clunky and poorly designed.The bottom line is that this might be a decent first digital camera for someone, but if you're someone like me who has used digital for 7-8 years you'll quickly see that Olympus left a lot on the table with this camera. I really wouldn't recommend this camera to anyone as there are many cameras of this size and resolution out there; I had hope for the 24mm wide angle, but more cameras are offering wide angle now too.Mine is going back and I decided to spend some more money and get the Panasonic Lumix FX580", "Date": "October 14, 2009"}, {"Title": "Olympus FE 5020", "Author": "R. A. Hartig \"XDouglas Driver\"", "ReviewID": "R3MVJRD5W2WFWW", "Overall": "4.0", "Content": "Great little camera for a very reasonable price plus free shipping fromAmazon. The 24mm wide angle lens makes point and shoot much easier, as it eliminates the hassle of having to back up to include everything or everyone in a close in shot. I would have prefered a written instruction manual as opposed to the supplied CD. The \"quick start\" instruction sheet is, I think, too brief.", "Date": "January 17, 2010"}, {"Title": "absolutely a great camera", "Author": "Dammer Gus", "ReviewID": "R10NMDX7V0IQF", "Overall": "5.0", "Content": "I bought this camera after my daughter lost my Sony CyberShot. I was upset when she lost it because, not only was it expensive but I had really liked that camera. Yet, when replacing the Sony, I didn't want to pay that sizable amount again so I starting looking at other options. I liked the looks of the Olympus and the price was reasonable. It seemed to have the same features as the Sony and long ago I had an Olympus camera that had been a good quality camera.This Olympus camera, I just love. It is as easy if not easier to use as the Sony. For the first \"outing\" with the Olympus, we went to Universal Studios in Burbank, California. The group consisted of five females and if you have ever been with a group of women that size or larger, then you know that we will all go in different directions all at once. So a lot of the pictures I took were on the run holding the camera up in the air. I would hold the camera at almost arm-length away and looking at the display to make sure my aim was decent enough to get the picture I wanted within the frame. Then I would just press the little button on top.Even with running and jiggling the camera, all the picture came out clear. None of them were blurry or out of focus. And the color quality is vivid and crisp. It is amazing that such a little camera at a low to moderate price would take such great pictures. I actually think it is better than the Sony. It is the most user friendly, point and shoot camera I have ever owned. I highly recommend this camera to anyone looking for that style of digital camera", "Date": "February 10, 2010"}, {"Title": "Best camera to buy!", "Author": null, "ReviewID": "R37CAX6VAGGFV9", "Overall": "5.0", "Content": "This camera topped my older top of the line nikon digital camera. Thank you who put a bright smile every day.", "Date": "March 21, 2010"}, {"Title": "sent it back", "Author": "hnaz", "ReviewID": "R1JVS9RZKQINQ9", "Overall": "1.0", "Content": "My current camera (Cybershot S750, 7.2 MP) is very shakily standing on it's last legs and having all kinds of trouble, so my husband purchased this Olympus FE5020 to replace it. Sorry to say, we had to send it back. I spent a couple of days taking pictures with it and was unhappy with the muddy colors it produced (trees which are in their bright green summer glory looked like they were greyish olive green), with it's inability to take pictures that were in focus when the zoom was used and the target was moving at all, it's inability to take a good macro picture (I like taking close up pictures of bugs and flowers, which, even with the macro setting turned on, it couldn't do- at about 5 inches away the flower was still very blurred - the macro function might as well have not existed for all the good it did), and it's inability to get a decent autofocus overall. I probably deleted a full third of the pictures I took due to blurriness. In a test between my breaking down Cybershot and this FE5020, my husband took some pictures of me standing still in an ordinary room lit by sunlight. It took six shots, trying with and without the flash, before the FE was able to take a picture that wasn't blurred or unacceptably dark!  Hardly useful if you are trying to actually capture events or a moving baby. It probably had the worst autofocus I've ever come across in 20 years of using point and shoot cameras. In contrast, the Cybershot had all six in perfect focus and decent exposure without any fuss, purely in Auto mode. So the FE got sent back.", "Date": "July 4, 2010"}, {"Title": "Olympus With Ease", "Author": "Mary Irizarry", "ReviewID": "R15LAWQQD2135H", "Overall": "4.0", "Content": "Great camera, simple and easy to play with. Great photos with alot of details being a 12mp. Light weight, easy carry and fits comfortably in a pocket or small purse. Love the sleek look and style. Buttons are easy to use.  The only small exception for this camera is when you just want to \"view\" the photos taken when turned on, the lenses expands out. A little annoying. All in all the Olympus Fe-5020 for the price is a pretty nice camera and fits well for my needs.", "Date": "March 25, 2011"}, {"Title": "Olympus 12MP 5x wide angle zoom", "Author": "Marlene C. Mason", "ReviewID": "R396WIHY12LXK7", "Overall": "5.0", "Content": "This is my fourth Olympus camera.  I have been nothing but pleased with the portability, ease of use and small size.  This camera is as good as any I have ever owned and better than most.", "Date": "April 24, 2010"}, {"Title": "Digital Camera", "Author": "US Marine 81 \"Gizmo\"", "ReviewID": "R4F20IRIOT5TW", "Overall": "5.0", "Content": "The Olympus Digital camera is a fine product. We purchased one while in the Bahamas and liked it so much that we had to have another one. The 12 M pixels and the 5.0 Optical zoom are a great combo to have. This is my 6th digital camera. It's the best yet.", "Date": "January 27, 2010"}, {"Title": "Great camera. Easy to use", "Author": "Paula", "ReviewID": "RALXJ56KA828M", "Overall": "5.0", "Content": "This digital camera takes great pictures and is easy to use. Can't go wrong for the price. This is our second camera by Olympus.", "Date": "May 13, 2011"}, {"Title": "Disappointed with the  FE5020", "Author": "N. Kreinberg", "ReviewID": "R1J43UZ95DPTNU", "Overall": "1.0", "Content": "I had a FE 280 (with 8 megapixels) for years and loved it. When I broke it, I tried getting one as close to it as I could and ultimately bought the 5020. This camera is very disappointing. The macro is terrible and regular shooting produces unsatisfactory pictures.  What's the point of having more pixels when you get inferior pictures?Avoid this one.  I wish I had paid attention to the negative reviews.", "Date": "June 11, 2011"}, {"Title": "Very nice", "Author": "Todd Daniels", "ReviewID": "RIL5Y8EZITFOL", "Overall": "5.0", "Content": "Got this camera as a gift for my wife.  She loves it.  Easy to use and great photos.  Thanks!", "Date": "May 30, 2011"}, {"Title": "terrible picture quality", "Author": "M. Wagner \"Wags\"", "ReviewID": "R279LRHPD80L3E", "Overall": "1.0", "Content": "First of all do not do business with Cameta Camera. We explained all the issues with the camera and they would not take it back because it was not within their 14 days. The camera was bought as a Christmas gift and was opened at a later time and we tried to return it 3 days after opening it. This is somewhat understandable, but the gentleman on the phone was down-right rude and refused to hear about the issue.This is the first Olympus camera we've bought and we're extremely disappointed. We bought a Nikon 7MP a few years ago and we had no problems but looked forward to higher quality pictures. During the first 50 pictures or so only a small percentage of them were somewhat clear and the rest were blurry or distorted. The 12MP quality is 10 times worse than our older 7MP camera. There are numerous different settings so we thought we could have been using bad settings on the camera, so we did a trial and took 35 pictures of the same exact object, which was a bottle sitting on the table. We tried a variety of settings, incluing the automatic ones. In the end we could read the writing on the bottle only 7 times, and they weren't vivid by any means...so disappointed with the quality of the pictures...terrible, absolutely terrible.", "Date": "January 20, 2010"}, {"Title": "Excellent for Travel", "Author": "Jeremiah", "ReviewID": "R2HM1OJ5IU1NNO", "Overall": "5.0", "Content": "My wife and I bought this camera at a military exchange store while on vacation in Hawaii. The size was what appealed to us initially. It's very light and compact, even with it's Lowepro camera case (additional cost). Put it in your pocket and you forget it's there, until you need to take a picture! For such a light camera the build quality seems very good, as it doesn't feel \"flimsy\" at all.I'm surprised at all the negative comments here about picture quality. Our photos turned out very well (I used the 12 megapixel setting) with accurate colors. Most of our photos were taken on golf courses, and the variations of green (fairways, rough, greens, trees, and flowers) were accomplished nicely. The wide angle feature is terrific, and the 5x optical zoom is generous and works well. I personally don't like digital zoom, and this camera has a definite stop between the optical and digital zoom modes.I didn't have much time to read the manual (it's on CD), but the controls turned out to be very intuitive. Battery life is excellent (lithium ion with included travel charger). With the 2Gb xD card we purchased for this camera, it will hold almost 700 photos at the 12 megapixel resolution.I just checked the battery charger and it handles 100-240V and 50/60Hz, so this will be our traveling camera from now on.This is my first Olympus camera, and I'm impressed so far. Even at the $149 exchange price, I feel I got a pretty good deal. I'll be interested to see how it holds up under long-term use.", "Date": "March 13, 2010"}, {"Title": "Great for point and shoot portability, but poor picture quality", "Author": "GuruDude", "ReviewID": "R22A7NH6XZHP7M", "Overall": "2.0", "Content": "Decided to try Olympus again after being really pleased with the picture quality of an Olympus C-3030 I had purchased several years ago.  I really liked the size and portability of the FE-5020 and the fact it had a 5X optical zoom.  For the most part it lived up to my expectations, but pictures taken with this camera have more than the average amount of noise compared to the other cameras I have owned.  Even on 100 and 200 ISO settings and varied lighting conditions there's still a noticeable amount noise.  I was hoping for more from Olympus, but I guess the old adage holds true: you get what you pay for!!!  I would be wary of purchasing anything \"low-end\" from Olympus again.", "Date": "February 11, 2010"}, {"Title": "Very good", "Author": "Wayne Keyser", "ReviewID": "R3EYA1I7LH3W6L", "Overall": "4.0", "Content": "A sturdy and usable camera, takes fine photos with minimal fiddling. Sent my son to England and Scotland with this, and it was all he needed.", "Date": "January 8, 2013"}, {"Title": "Olympus FE 5020", "Author": "Charlotte Young", "ReviewID": "R4CG6RRG443B4", "Overall": "4.0", "Content": "Does take good pictures, but it is hard to navigate and the instructions are not always that easy to follow", "Date": "December 25, 2012"}, {"Title": "good camera for the low price", "Author": "negrito", "ReviewID": "R2J24GJLNDJI39", "Overall": "5.0", "Content": "The camera is very good expecially when you take the pictures outside.  I gave it to my brother who lives in a tropical country and he is very happy with the results", "Date": "March 4, 2012"}, {"Title": "Great overall point and shoot for the money", "Author": "Nick", "ReviewID": "R2GXOHQ2M422MJ", "Overall": "5.0", "Content": "I purchased this camera for my girlfriends birthday in June 2011, overall we are very happy with it. The picture quality is good in low light and very bright pictures, also does a good job with the action shots that we have taken(mostly while tubing) good pictures in the dark. Camera features and menu are easy to use although I didn't like the software that came with it but it's easy enough to just copy and paste the files just like you would with a flash drive. Very happy with the quality of the camera overall although i would recommend getting a second battery and bring your charger if you go on a trip. Also I should mention i was happy with the zoom capability and clarity.", "Date": "December 10, 2011"}, {"Title": "Great camera for price", "Author": "Greg", "ReviewID": "R1F7YWK70UB75Y", "Overall": "5.0", "Content": "I bought this camera because I am in real estate in new york city and I nereids a camera to take pictures of sometimes small rooms.  This comes is a wide angle and takes fantastic pictures.this is my second camera from a really cheap samsung asp I don't have anything great to compare out to but it is a really great camera.", "Date": "September 23, 2011"}, {"Title": "Awesome little camera!", "Author": "Amazon Customer", "ReviewID": "R297EQKWTMI7IY", "Overall": "4.0", "Content": "Bought this awesome little camera for my daughters birthday and it outperforms my much more expensive Fujifilm FinePix.  Rechargeable battery, great focus, whats not to like?  Grabbing some moving shots is very easy with this little camera, you won't regret the purchase.", "Date": "June 29, 2011"}, {"Title": "NEVER BUY THIS CAMERA.", "Author": "cecilia martinez", "ReviewID": "R2Q4CRGUX1RW7S", "Overall": "1.0", "Content": "This camera was poorly constucted. It felt like a piece of plastic in my hands. The battery wouldnt charge for more than 5 seconds. Never could take a picture because the battery always died. The best part is that we were 2 days late from the 30-day money back guarantee. It was a gift to my daughter and it was wrapped. I got this without reading reviews at all. I thought it would be a good camera since it was on Daily Deals. Don't waste your money. Get a better camera brand and READ THE REVIEWS.", "Date": "June 20, 2011"}, {"Title": "Great Little Camera", "Author": "Theresa Hartel", "ReviewID": "R2FXES654GJQYV", "Overall": "4.0", "Content": "First I must state that I am a complete camera novice and was looking for a camera to take decent pictures, at a decent price and that was small enough to throw in my bag.  This camera fits the bill and is great.  It is compact, takes wonderful pictures and was under $100.  There are many features of this camera that I haven't used yet so, if you are more experienced with your way around a camera, you may like it even more.", "Date": "June 17, 2011"}, {"Title": "Olympus Wide Angle Compact Camera", "Author": "J. Chia", "ReviewID": "R1JP3ULU1YEC3A", "Overall": "4.0", "Content": "I bought this camera for its wide angle capability: 24mm.  It is a simple camera that meets my requirements: pocketable and wide angle. Good price at Amazon with fast delivery.", "Date": "June 15, 2011"}, {"Title": "olympus camera", "Author": "G. Youhas", "ReviewID": "R1O37B1JGHB40P", "Overall": "5.0", "Content": "Easy to use, fits easily in my purse and takes great pictures.  Am a long time Olympus camera user!!!", "Date": "June 10, 2011"}, {"Title": "Good for the Money", "Author": "Melli \"Racers7\"", "ReviewID": "R3IMT6DKA3SRG5", "Overall": "5.0", "Content": "I received an Olympus fe360 (gift)a little less than 2 years ago before it got sand in it from the beach and conked out, despite the reviews I loved that little camera.  I decided to get another Olympus because I already had the chip, charger and battery from the first one.  So I upgraded to this new one, the Olympus fe5020, and got the whole package for around $100 (w/USB attachment, charger and battery too).  I know a few people (in reviews) didn't like the delay when pushing the button for a picture but it was a minor detail.  I enjoy this camera and it didn't really change much from my other one except its a 12mp instead of 8mp so the pictures are pretty clear.  It has a quick edit button, movie option and is good for quick pictures on outings.  The menu options are clear and pretty straight forward but with any piece of equipment you should play around with the settings and also watch the CD for setup  so you get better aquainted with your camera.  Now as an artist I do take photos of some of my work with it.  I make sure I have good lighting though because the adjustments on the camera are better for auto pictures.  But if you have a basic photo editing feature on your home printer it will do pretty well when you download photos and the included cd-rom with instructions is helpful too.  All in all it is a good basic camera that does a lot for little money.  Easy to carry, slim and looks nice.", "Date": "October 25, 2010"}, {"Title": "Great camera", "Author": "B. Brown \"idol fan\"", "ReviewID": "R2W1ZSADWCAVYW", "Overall": "4.0", "Content": "It's a Great camera. Some of the interior pics I took didn't turn out so good but other pics that I took turned out EXCELLENT!!", "Date": "May 11, 2010"}, {"Title": "Olympus camera", "Author": "Glennice A. Brumfield", "ReviewID": "R3CR1T872BLVSG", "Overall": "5.0", "Content": "This product is great. I had an olympus camera before and love the brand name. It is a little difficult learning all of the features but the CD does help.", "Date": "February 12, 2010"}, {"Title": "Olympus Camera", "Author": "Deb Kramer \"Reader\"", "ReviewID": "R1B9WIQD4B2QGD", "Overall": "5.0", "Content": "Bought it for my college aged daughter for Christmas.  She loves it.  It works well, is easy to use and takes great pics!", "Date": "January 31, 2010"}, {"Title": "olympus means quality lenses", "Author": "L. Hancock \"graphic artist\"", "ReviewID": "R1FP24CD1IP0AC", "Overall": "5.0", "Content": "I've always purchased Olympus cameras because they have the best lenses. Notice the number of medical lenses there are. This new model lives up to my expectations!", "Date": "October 19, 2009"}, {"Title": "Perfect Christmas gift!", "Author": "Cherry726", "ReviewID": "R3GRXG3AFNJE3R", "Overall": "5.0", "Content": "I bought the camera as a gift for my dad for christmas-we have been in search for a wide-angle camera for a while and when I found this I figured why not give it a try?!---it is perfect--He loved it!I received it the very next day,no lie! :)", "Date": "December 31, 2010"}, {"Title": "Olympus FE 5020 camera", "Author": "sschase", "ReviewID": "R84EAFG55XR6D", "Overall": "5.0", "Content": "Great camera.  Takes wonderful pictures and has a video feature as well.  This one is for my husband!", "Date": "December 14, 2010"}, {"Title": "Awesome Camera!", "Author": "Jane A. Healy", "ReviewID": "R2LJA8SDD71FRL", "Overall": "5.0", "Content": "I had no picture-taking experience but this camera is so easy to set up and start using!I can't stop taking pictures with it!  I researched many cameras before making my purchase andbelieve that this one was made for me!", "Date": "August 24, 2010"}, {"Title": "Excellent Seller", "Author": "Florentino Encarnacion", "ReviewID": "R264UO49MPQGZ5", "Overall": "5.0", "Content": "Very fast ship, i am very happy with the  camera, i get what i told.", "Date": "April 18, 2010"}, {"Title": "Mixed Review", "Author": "Carolyn Billups", "ReviewID": "R322DRFVCIZTJO", "Overall": "3.0", "Content": "The pictures are clear and are nice but the angle is wierd. The peoples face in the picture looks long and fat like your looking in one of those mirriors, pretty wierd. Love Olympus but this wide angle view is probably good for landscapes but not for portraits. Pictures of my son look great but idk", "Date": "April 10, 2010"}, {"Title": "Great gift", "Author": "OfficeOrder", "ReviewID": "R4560NELFO9UD", "Overall": "5.0", "Content": "Gave this camera as a gift. It was easy to figure out right away- user friendly. Although I can't speak to how it did over time, I can say that the receiver was quite happy to get the camera. Before giving it, I charged the battery, installed a memory card and played around a bit with the camera. It took great quality pictures.", "Date": "August 6, 2010"}, {"Title": "poor quality camera quality isnt there", "Author": "Jason Pancari", "ReviewID": "R2WL3DTTDEZR70", "Overall": "1.0", "Content": "just wanted to start off this review i bought this camera cause i wanted to try out olympus. I will never try there cameras again. First off i want to make a note you cant turn the flash on in super macro thats one limition the camera has. the pictures indoors have purple tint especially on the walls. camera is made very poorly. If you put it on iauto or dis mode if you turn the camera off it will revert back to p mode which will allow you to pick a scene mode under scn. this camera is horrible. just wanted to tell you my thoughts about it.", "Date": "January 9, 2010"}, {"Title": "Could be a great camera - - buy from a local vendor!", "Author": "Jim", "ReviewID": "R37PBLPHD2L0IX", "Overall": "1.0", "Content": "Ordered this camera a week before Christmas as a present for my young daughter.Paid the extra $'s for expedited shipping.Was just told by UPS that I need to be home tomorrow between 8:00AM and 7:00PM for delivery (the Amazon vendor will only ship with signature).Saved $20 buying through Amazon.  Now I have to use a vacation day to get it.Unless you can afford to stay at home for 13 hours to accept shipment, purchase this from a store where you can pick it up!", "Date": "December 21, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "12-megapixel resolution for photo-quality prints up to 20 x 30 inches\n5x wide-angle optical zoom; 2.7-inch LCD\nCapture images to xD-Picture Card or microSD (not included)", "Name": "Olympus FE-5020 12MP Digital Camera with 5x Wide Angle Optical Zoom and 2.7 inch LCD (Wine Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41sm-V06uiL._SX300_.jpg", "ProductID": "B002HWRKUC"}}