{"Reviews": [{"Title": "A very good camera", "Author": "Bryan MacKinnon", "ReviewID": "R1L75MP8ID9LKW", "Overall": "4.0", "Content": "With GPS and wireless, this is the future of cameras and many electronics. It is easy to use and takes very good quality photos for a compact. And of course it has GPS and Wifi/Bluetooth.  The touchscreen is large and is very easy to use (the easiest I've ever used).I'd like to give this a 4.5 stars rating since the issues I had with it are minor: 1) the GPS can be a bit slow getting the initial fix and 2) the touchscreen is a bit sensitive sometimes causing it to bring up menus when you don't want to, and 3) I have a preference for regular SD cards verses micro SD.I've had mine for 2 weeks and overall I really enjoy it and the my larger digital SLR (without GPS) is collecting dust on the shelf.", "Date": "November 14, 2009"}, {"Title": "A JEWEL  AND  JOY.", "Author": "A. C. Lima \"NAGUAL MD\"", "ReviewID": "R1SNPTOFN0LI7B", "Overall": "5.0", "Content": "A GREAT CAMERA.,WITH EVERYTHING YOU WILL NEED IN A TRIP.PROS-1-HAS THE BEST FEATURES OF ANY COMPACT CAMERA.2-PICTURE QUALITY GOOD.3-GPS-3 MINUTES TO START.,BE PATIENT.,IT GOES OUT IN SPACE TO THE SATS.4-ZOOM VERY DECENT.5-BACK SCREEN OF VERY GOOD QUALITY.6-TOUCH SCREEN GOOD.6-OPERATIONAL BUTTONS EASY TO USE AND INTUITIVE.COULD IMPROVE-1-NORMAL BATTERIES.2-WEATHER PROOF.3-BIGGER ZOOM.", "Date": "March 25, 2010"}, {"Title": "Impossible to find replacement charger", "Author": "D. Neubert", "ReviewID": "R26GINP2AH6ALT", "Overall": "2.0", "Content": "I used the Sumsung CL65 for a few weeks and liked it.  It was one of the first cameras with a big screen, GPS and Wifi.  However, I lost the charger somewhere.  I couldn't find a replacement.  I found a third party version on Amazon bought it, but it didn't fit.  Samsung does not sell replacement chargers.  No camera store, Wal*mart or Best Buy had one either.  I thought of buying a cheaper Samsung Camera just for the charger.  Well, this camera has been sitting in my useless electronic equipment drawer now for a year.  While not as good as the CL65, I trust my iPhone more.  I've lost chargers for it and can buy one anywhere - airports, abroad etc.", "Date": "August 2, 2011"}, {"Title": "Not so good", "Author": "Claudio", "ReviewID": "R1XM7G4XEA8R2C", "Overall": "2.0", "Content": "Very disappointed with the short comings of this camera . The added features like Wi Fi  and Bluetooth do not work up to standards and neither are the so called connections to \"social networks \" . Not a particularly user friendly cam  , the quality of the picture is OK as far as you don't move too much. I do not recommended at all . A  very average camera with a big price .", "Date": "July 14, 2011"}, {"Title": "Bluetooth Not Computer Compatible", "Author": "John Garvin \"JRG\"", "ReviewID": "R7ECUPAUD0KEN", "Overall": "1.0", "Content": "The Amazon and Samsung web sites clearly states this camera connects via Bluetooth to computers. This camera does NOT connect to either a new Mac nor a new PC via Bluetooth. I have been on the phone with Samsung technical support staff for a minimum of 3.5 hours and talked to at least 10 people. They contradict each other and have no a clue. I would totally avoid buying this camera!!!!Now after just over one year the camera has completely quit operating.", "Date": "November 16, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002MW6CB0"}}