{"Reviews": [{"Title": "You wont be disappointed", "Author": "maitai \"maitai\"", "ReviewID": "R1EDGRSI4P6Y26", "Overall": "4.0", "Content": "After doing a lot of research on Amazon I took a chance to add this camera to my existing home CCTV system. I use 4 logitech 9000 USB cameras. Two to monitor outside, and two to monitor the second floor of my home. I wanted to monitor the first floor, thereby completing my CCTV project. I travel a lot and like to keep an eye on my home from afar. I run everything on an iMac, running \"Security Spy\". Security Spy supports this camera. My goal was to connect it to my wireless network, and view the camera via Security Spy, and the camera's built in webserver, if the iMac went down while I was traveling (which has happened in the past).At first I had problems but with a bit of patience I figured it out. The first thing I had to do was to give the camera a static ip address as my airport extreme would want to change the camera's IP address everytime it rebooted, which caused me a hour of grief. Once the camera had a fixed IP my airport extreme router settled down and \"accepted\" the camera.The second thing I had to do was to \"disable\" the Plug N Play feature in the setup menu of the camera. That caused me another hour of wasted time, as the UPnP feature caused havoc with the stability of my wireless network and prevented me from seeing the camera via the internet. Once the UPnP was disabled in the camera my wireless network was rock solid. I was able to view the camera via the web, as well as on my iphone. The camera has proven to be a great addition. The picture quality is great. It is very well made. To me, it was money well spent.I only wish the documentation was written better, as I really felt like I was flying by the seat of my pants. So detailed below is a brief overview to help other Mac users as the setup was not in the instructions, nor are they obvious.For Mac users that have an Airport Extreme router, it helps to setup \"Port Mapping\" to ensure you can see the camera on the web. Go into \"Utilities\" in the Applications Menu, then select Airport Utility and wait for the application to open.Once you see your Airport Extreme in the viewing pane, select \"Advanced\" followed by \"Port Mapping\". Then hit the \"+\" and select \"Personal Web Sharing\" from the drop down menu. Type in the forwarding port you want to use. Example port \"80\". Enter this value in the Public TCP Port field, and then enter it in the \"Private TCP Port\" field.Then in the Private IP address field enter the camera's IP address. Finally give the Port Mapping configuration and name....eg. \"KITCHEN_CAMERA\". Hit continue and wait for the airport extreme to reboot. Once this is done the router is configured.Power up the camera close to the router (making sure it is in range) and the blinking light on the camera should go green, indicating you have a connection established. Don't forget to turn off the UPnP in the SETUP menu of the camera as I mentioned earlier. If the camera does not work, don't worry. You are 95% complete. Just back track your steps as you may have missed something. Good luck to all.Enjoy the camera it is a great little device. I hope this review and my mac configuration helps others.", "Date": "January 21, 2011"}, {"Title": "Does the job", "Author": "G. Jones", "ReviewID": "RM5F6JE0HYD82", "Overall": "4.0", "Content": "I needed a \"nanny-cam\" network to monitor the whole house.  I installed FOUR Panasonic IP cameras (one BLC-1A and three BLC-121).  All function exceptionally well.  I am able to access any single output or a composite of all four easily, even from an iPhone.The wireless range and reliability of the BLC-121 was disappointing, but when hooked up in wired mode, work flawlessly.  Setup with a Mac was difficult (there are plenty of \"how-to's\" on a google search that made it less painful).  Sound for the BLC-121 on a mac is nonexistent.Very happy with the video clarity and reliability of all four cameras in wired mode.", "Date": "January 30, 2010"}, {"Title": "Nice Camera", "Author": "JV", "ReviewID": "R349FC351FJ02I", "Overall": "3.0", "Content": "Bought this camera to keep an eye on my front yard.  I have it facing the window looking outside.  Initial setup was easy, although had to play around with it to fine tune the settings.  Images are decent at the higher resolution of 640X480. Less than this, images are comparable to that taken by a cell phone.  Have it setup to FTP images to my computer.  Wireless range is good.  Please note that the camera does not perform well in low light or night time conditions.  Camera does have a night view feature which does improve the low light condition somewhat, but the image is grainy. Overall this is a decent camera for the price.", "Date": "April 1, 2010"}, {"Title": "Great little camera wifi camera!", "Author": "LexNoir", "ReviewID": "R3EFY7YTSWLAJB", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1RN14V9I2COGKembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1RN14V9I2COGKrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1RN14V9I2COGKchiDiv\").innerHTML = document.getElementById(\"cv_mo1RN14V9I2COGKhiddenPre\").innerHTML;\n};\ncv_mo1RN14V9I2COGKrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1RN14V9I2COGKso;\t   \n\n\nfunction cv_mo1RN14V9I2COGKloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1RN14V9I2COGKso = new SWFObject(swfLocation, \"cv_mo1RN14V9I2COGKAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1RN14V9I2COGKso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1RN14V9I2COGKso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1RN14V9I2COGKso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1RN14V9I2COGKso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1RN14V9I2COGKso.setAttribute(\"height\", swfHeight);\n          cv_mo1RN14V9I2COGKso.setAttribute(\"width\", swfWidth);\n          cv_mo1RN14V9I2COGKso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1RN14V9I2COGKso.write(\"cv_mo1RN14V9I2COGKflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1RN14V9I2COGK', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1RN14V9I2COGK';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1RN14V9I2COGK', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1RN14V9I2COGKloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1RN14V9I2COGK\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"mG2UT7DWBQP53\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"mG2UT7DWBQP53\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3EFY7YTSWLAJB\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/mG2UT7DWBQP53/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1RN14V9I2COGKduration')) {\n      document.getElementById('cv_mo1RN14V9I2COGKduration').style.display='none';\n    }\n    cv_mo1RN14V9I2COGKloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1RN14V9I2COGKloadSwf(movieID, playerVersion) {\n   return _cv_mo1RN14V9I2COGKloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1RN14V9I2COGKnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1RN14V9I2COGK', 0, h);\n}\n\nfunction cv_mo1RN14V9I2COGKresetPlayer(w,h,bw,cc) {\n  cv_mo1RN14V9I2COGKnewHeight(h);\n\n  cv_mo1RN14V9I2COGKso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1RN14V9I2COGKso.addVariable(\"cacheCode\", cc);\n  cv_mo1RN14V9I2COGKso.setAttribute(\"height\", h);\n  cv_mo1RN14V9I2COGKso.setAttribute(\"width\", w);\n  cv_mo1RN14V9I2COGKso.write(\"cv_mo1RN14V9I2COGKflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1RN14V9I2COGKRollOverImg = new Image();\ncv_mo1RN14V9I2COGKRollOverImg.src = \"http://ecx.images-amazon.com/images/I/71QjMMrlHPS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1RN14V9I2COGKpreplay = document.getElementById('cv_mo1RN14V9I2COGKpreplayImageId');\nif (cv_mo1RN14V9I2COGKpreplay) {\n  cv_mo1RN14V9I2COGKpreplay.onmouseover = function() {\n    cv_mo1RN14V9I2COGKpreplay.src = \"http://ecx.images-amazon.com/images/I/71QjMMrlHPS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1RN14V9I2COGKpreplay.onmouseout = function() {\n    cv_mo1RN14V9I2COGKpreplay.src = \"http://ecx.images-amazon.com/images/I/71QjMMrlHPS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1RN14V9I2COGKpreplay.parentNode;\n\n  var cv_mo1RN14V9I2COGKcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1RN14V9I2COGKcurrentClick) {\n      return cv_mo1RN14V9I2COGKcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:07 MinsThis camera is perfect for a home or small business.  I recently replaced two TrendNet WiFi cameras with these Panasonic units.  The image quality is excellent, though there is no infrared night vision.  But that's a good thing if you're like me and have them mounted inside behind glass.  iR night vision capable cameras tend to have the iR lights reflect off the glass at night causing your image to be unviewable.  Almost like holding a flashlight in front of a mirror (if that makes sense).  So if you're mounting these at your home or business, as long as you have a good motion light outside your home, that's all the light you'll need.The clarity and auto focus on these cameras are excellent though colors may appear slightly washed out.  But we're not looking for HD quality here.  The TrendNet cameras you had to manually focus by turning the the lens.  These have no such focus mechanism.1.  I love that these don't have the annoying external antennas on them, the wifi antenna is built in.  Cameras with the WiFi antennas tended to be a pain to mount because you had to take that antenna into consideration.2.  I love the mounting bracket.  The mounting bracket was well thought out allowing you to mount it sideways, upside down, or right side up.  In other words, the base you see in the photo, can be rotated any direction.  Then your camera can rotate 360 degrees as well.  I found the base to be well built.  My TrendNet and Dlink camera swivel mounts broke after rotating them a few times, and they were only rotated a few times because you couldn't tighten them into position without breaking that too.3.  These have a microphone but I've never used that function.4.  They are compatible with the Synology IP Cam software, as well as NetCamWatcherThey're fairly small/compact.  Making mounting them near a window with blinds/shades flawless since they're square but boxy.  My TrendNet cam has a weird shape which caused my blinds/window shades to stick out a bit.  I've uploaded a small video to show the picture quality.  But it's possible that Amazon may have adjusted the video/image so the quality you see might not be the same quality I see.  Also I wasn't able to find anything moving when I took the video.What I don't like:  Not much that I don't like.  The software as a bit strange when trying to get it setup wirelessly.  But I think that's because I'm an Information Technology professional.  We're used to doing things the hard way (or the technical way), not by using software that attempts to make it easy.  So though I found the software tricky at first (probably because I tried to skip the instructions) I think a non-technical user would find it quite simple.I'd purchase this item again.  In fact I already did.", "Date": "September 26, 2011"}, {"Title": "Great camera", "Author": "Grace A. Wagner \"G W\"", "ReviewID": "RYUNZM0VEKHB9", "Overall": "5.0", "Content": "Received this camera today and installed easily.  I could view it perfectly on my computer through my wireless network.  The only problem I had was configuring my router as I am a ATT uVerse customer and the configuring was a little different due to their firewall settings. I had to go in and create a custom firewall setting for the camera network setting then I could view the viewnetcam website for my camera.  We love this so much we just purchased a second camera for a different room to keep an eye on our pets.", "Date": "April 3, 2010"}, {"Title": "Easy Set-Up - Decent Quality", "Author": "K. C. Hayley \"kch\"", "ReviewID": "R223SRMSQS78UJ", "Overall": "5.0", "Content": "Ok, I'm not a technie and was worried about setting this up.  Nothing is more frustrating then trying to get stuff to communicate, laptops, modems, routers, iPads, Wiis, just not my thing.  The other reviews worried me about the lenght of time and having to call customer support etc... but I really want to help secure my home so I thought I'd try.  Well I was done within 10 minutes and the camera works great.  I went back to buy a few more and noticed that the price increased $15 since I ordered 2 weeks ago (oh well), but I wanted to just try one first. I did order more because I'm so happy with the product.You have to wire the camera to set it up initially so you do need a CAT5 cable (not included).  I followed the instructions and everything happened just like the instructions said.  I have DHCP so I didn't need to know any IP addresses.  You do need to know your wireless security key and wireless network name.  The wired test worked just fine, I clicked the address it gave me and there was my mug looking into the camera.  The true test was unplugging the CAT5 and seeing if it really did work wirelessly and yes it did!  The microphone seems fairly sensitive, it picks up general white noise, I just turned the volume down.  For some reason, the camera gets really warm, but the instructions said this is normal.The web page allows for additional settings and it tiles the view for each camera.  I'm hoping setting the next camera will be just as easy with no conflict problems.  I'm probably borrowing trouble, but again, not my forte, I hate programming devices.  So in conclusion, I found this to be quick, easy and works just as I had hoped.  There is something very satisfying about being able to check on your house at any time.  I just bring up the site on my iPad anytime - anywhere!", "Date": "March 19, 2011"}, {"Title": "Great Camera", "Author": "Samira Aliabadi", "ReviewID": "R3LDW1R4H0IQ6X", "Overall": "4.0", "Content": "Great camera! Installation of the software was however more tedious than I anticipated.  My husband spent close to two hours on the phone with technical support.  They were, however, VERY helpful and stayed with him on the phone until installation was complete.  We also go the wireless camera that tilts.  Can use both cameras simultaneously and access both images at the same time.  Great if you have kids and want to watch them when you are away.", "Date": "November 16, 2009"}, {"Title": "Excellent webcam for monitoring...", "Author": "Paul Greenman", "ReviewID": "R2RS62SAZNPPN7", "Overall": "5.0", "Content": "I ordered this and it came quickly, and worked well.  Although I was setting it up on a Mac, I found directions on how to do this easily on the web, and got it going in a short time.  The trick is to connected it by wire first, and use the default IP address of x.x.x.253.  Then it opens right up and you can configure it through any browser.  Directions from other users on the web helped me set up port forwarding to get it \"published\" onto the outside web, and it's been fine ever since.  Very nice.", "Date": "August 29, 2012"}, {"Title": "Good video - hard to set up", "Author": "Celacom", "ReviewID": "RPFT0LP8O97I8", "Overall": "2.0", "Content": "This was a first time install for a wireless network camera. It was far more difficult than I hoped. When it's working from the inside wifi, it has good video, zooming in still had a good image. But - trying to set it up for remote access was not successful for me. I thought I had some good computer knowledge, but it required getting into the router settings... and that pretty much ended it for me. But - when hooked up to an ethernet cable and accessed via an ip address - it was great. Overall, it was frustrating. I have now tried a Linksys Cisco Wireless N camera - got it up and working in 30 minutes, including remote web access. But it does involve having to pay for a domain service...  Maybe the Panasonic will work if you have better skills than I do.", "Date": "October 5, 2010"}, {"Title": "Like it", "Author": "Walker", "ReviewID": "RJMC0AE3VJXGL", "Overall": "5.0", "Content": "It can be tricky to setup, especially if you have a wireless router and trying to get access via cell phone. Cell phone doesn't get audio. Still, I think it's the best in the price range.", "Date": "March 12, 2010"}, {"Title": "decent camera, but no mac/linux support", "Author": "CC Yang", "ReviewID": "R82D0K62MOZNE", "Overall": "3.0", "Content": "This is a decent camera given its low price.  You should have no problem working with it if you are on a PC.  However, there exists virtually no support for non-PC users.  If you are not on a PC, e.g., mac or linux, the installation DVD does not work for you and you have to manually connect and set up the camera using your system utilities.  If you understand how to set up local fixed IP and port forwarding, this is just some work for one time.  But the real unsolvable issue is that you have to use IE to access the audio from the mic on the camera, because the program on the camera is written in ActiveX, which is proprietary for IE.  You can still access the video stream with other web browsers, but forget about the audio.  Unless Panasonic publishes alternative program for non-PC/non-IE users, you might want to hold up the purchase.", "Date": "May 18, 2011"}, {"Title": "Panasonic Internet Cameras", "Author": "WERMS", "ReviewID": "R36ZVMVU83N2YW", "Overall": "4.0", "Content": "Panasonic BL-C121A Wireless Network CameraPanasonic BL-C1A Network CameraI have purchased and installed dozens of Panasonic cameras with great success.  The specific steps a user has to complete to use  Internet cameras can be challenging.  There are advanced concepts that need to be understood before the many specific features can be implemented confidently.An understanding of static IP addresses, ports, router port-forwarding, and dynamic DNS (DDNS) concepts are helpful when configuring internet cameras, especially for remote access from a public network.Each camera should be configured with a unique internal IP address and unique port so that it can be accessed from the local network.  Be careful and take notes.  For remote access, a port forwarding rule needs to be established in the network router.  If this is done correctly, you should be able to access the camera using the external IP address or DDNS name (i.e. viewnetcam.com) and port.  These steps provide a live view, but if you are not viewing when something happens, you missed it.  There is a way you can see what you've been missing!Many internet cameras can save images taken when motion is detected.  This is a very powerful feature and the Panasonic line of cameras do this well, but it can be complicated to maintain a 24/7 recording system with multiple cameras.The Web Enabled Remote Monitoring Service (WERMS) provides cloud-based image history services that work really well with Panasonic, and many other internet cameras sold by Amazon.  This valuable service adds huge value to capable cameras, but is not provided by camera manufacturers.The Panasonic cameras work so well, WERMS enhanced and optimized the original BLC-1A Petcam interface to make it super easy to start benefiting from a 7-day revolving history and 30-day archive.  The hope is to streamline the setup for more cameras, but, adding WERMS is easy if you can already view through the camera.Please visit WERMS at werms.com to learn more and get help with using your Panasonic, or other internet camera from Amazon.", "Date": "November 15, 2012"}, {"Title": "Very good!  I can check up on my house at any time.", "Author": "The real Amazon fan", "ReviewID": "R7PJKTH4F4NGB", "Overall": "4.0", "Content": "Simple, small, easy to install, good looking, works great.  The software that it comes with isn't great, but after some setup and fiddling around with our network, we got it to work well as an indoor porch camera.  We have it mounted inside the window.Image is pretty clear during the day... a little grainy in the evening hours, but with the porch light on we can clearly see who is at the front door.  With motion sensor enabled, we can get emails on our smartphones when someone approaches the house even if we aren't home.  (Solicitors, go away!  you will be youtubed!!  j/k)I think if Panasonic offered this unit with a WHITE cord instead of the standard ugly black cord, it would've been even nicer for a 5-star rating.  Especially since the camera would be mounted inside the house, a white cord would make more appealing.", "Date": "July 24, 2012"}, {"Title": "Great camera I can see on my iPhone.", "Author": "Soo Jeong Lee \"pacific coast\"", "ReviewID": "R3UNOOSNF0VULF", "Overall": "5.0", "Content": "This camera works great.Yes, I am not a geek and it took around a week to set this camera, but since then, it works very well.I am pleased that I can check my house while I was gone for a vacation and Thanksgiving visit to my family.Attention, it is not night camera so if you want to use it during the night, you have to set light.Even though it is wireless, it need power connection which is wired.", "Date": "November 29, 2011"}, {"Title": "Easy setup without installing any software", "Author": "C. Bailey \"cbailey139\"", "ReviewID": "R18M2JIWXTRPWQ", "Overall": "5.0", "Content": "Wow. I'm very impressed. All kinds of things about this camera are nice surprises. Looks and feels well made, image is sharp and clear, web page configuration allows many options like capturing so many frames for so many seconds after motion is detected, and on and on. Particularly neat: there are two terminal pairs available on the camera. One of these pairs, you can connect to a switch (like a door opening detector switch say) and trigger the camera to grab pictures whenever it activates. The other pair is itself a switch you can connect to other things, and control remotely through the web. But like many other details, you don't have to fool with these unless you want.I didn't even unwrap the CD, didn't install any software. I figured the camera would have an IP address of 192.168.1.??? and that it would probably be near one end or the other of the 0-255 range, so I tried typing IP numbers into my web browser, and on 253 I found it. It wanted my name and a password, and then it gave me the web page interface, which was clean and clear and simple. Some of the wording was in funny English-as-a-second-language but it was easy to guess what they meant.By the way, I used a Mac for all of this, which did not seem like any problem in the slightest. I'd guess any computer with a web browser would be fine.", "Date": "January 8, 2011"}, {"Title": "Wonky setup, misleading features", "Author": "S. Sanders", "ReviewID": "R1LQ53L0NCB144", "Overall": "3.0", "Content": "This camera has tons of neat features, decent picture, etc., etc., but I had to return it because the one single feature I was interested in does not really work: automatically emailing pictures.  After wasting an hour or two trying to make it work, I gave up and contacted Panasonic support, who got back to me within 24 hours with this response: \"Please be advised, your Network Camera E-mail transfer function does not support SSL encryption when sending E-mail. We recommend the BLC230 Networ Camera or use a compatible emil provider.\"  So, again, unless you have a POP mail provider that does not require SSL encryption (seemingly rare and old fashioned nowadays), it won't work.  Won't be able to send via gmail, for example.  And no IMAP support at all.  This seems misleading because it says it supports SSL, but I guess that is only for serving the images, not sending them.The other thing is that it is almost impossible to access the camera's web setup page without the special tools because it defaults to a hardcoded, secret IP address (sorry, I didn't write down what that was) instead of DHCP like almost any other networked device on the planet.  Usually I can plug in a new device, see its ip address via the router's DHCP assignment table, and start browsing it, but this camera requires a special tool, which comes on the DVD.  I don't have a DVD-ROM drive, so I downloaded it from Panasonic.  The downloaded utility silently unpacks itself to a subdirectory, so I had to hunt around for that on a hunch, but I finally found it and got it to work.So it seems like a solid piece of hardware with very outdated features and firmware; wait for it to go onsale for $50 I'd say - unless you need one that can email pictures.", "Date": "March 4, 2012"}, {"Title": "Could have been good.....", "Author": "RSD", "ReviewID": "RA67TOOX5BHG6", "Overall": "1.0", "Content": "I have 2 of these cameras bought from Amazon and both of their wireless modules stopped working within 3-4 weeks of continuous use. Returned 1 and kept the other since the pics/video is pretty good in \"wired\" mode.The setup was pretty easy but trying to configure it to work with the Panasonic internet viewing site \"viewnetcam.com\" could be a nightmare unless you know that your router's uPnP will play nice with the Panasonic (my Cisco M20 did not and I still have not figured it out) or you are a network savvy individual so you can manually configure both router and panasonic settings.Hope this helps.", "Date": "March 22, 2011"}, {"Title": "Easy to use", "Author": "SC141", "ReviewID": "R9JFOWYIGKAUT", "Overall": "4.0", "Content": "The camera works great.  We are using two as nanny cams.  The capture everything, and my wife and I can view online at any point.  I read that others had some difficulty installing.....I did not run into those issues.  The manual isn't entirely intuitive (start with 1 manual for wiring, switch to other manual for computer setup, go back to first manual for hardware) - but if you read through it, you know where to go for what.  Overall, took me 25 minutes for the first camera (made a mistake on the wireless password) and 10 minutes for the second camera.  That said, I have not mounted the cameras on the wall or ceiling, so that setup is likely longer.  Either way, 3 days in, we're very happy with the cameras.", "Date": "March 22, 2011"}, {"Title": "BL-C121A wireless network camera", "Author": "isamu tajiri", "ReviewID": "R1EK37YMSZ781N", "Overall": "4.0", "Content": "This one was used product. However, works fine.i would hear the audio (have to use IE browser).and video wise, easy to see the camera picture.", "Date": "May 13, 2013"}, {"Title": "Wonderful", "Author": "bwolz", "ReviewID": "R1X41BY4GKRJUZ", "Overall": "5.0", "Content": "The company did not have this model in stock any more, but sent to me the next upgraded version of the camera for my use.  I works even better than the one I wanted.....  Great product, great company and received it fast.", "Date": "May 6, 2013"}, {"Title": "Great camera. Unfortunately the seller was sold out and \"upgraded\" me to the BL-VT164W which is a horrible camera", "Author": "Slappy White", "ReviewID": "R2U5JE1X8XD89D", "Overall": "5.0", "Content": "I have a few of these BL-C121A cams and they are fantastic. After I placed my order I received a call from the seller, they were all out but would send me the newer replacement camera which cost about $100 more, they would waive the difference. Sounded good so I agreed. Newer is better right? Wrong. The replacement for this camera is the BL-VT164W and is completely unusable. It doesn't capture video which is the main purpose of these cameras. Also it's only configurable through Internet Explorer. IE? Who uses that anymore? I'll be returning it and buying a BL-C121A cam on eBay. Amazon and Panasonic really need to pull these newer BL-VT164W cams until they are ready for market...DO NOT BUY THIS CAMERABL-VT164WP  HD - H.264 Wireless Pan-tilt Network Camera,  (White)DO NOT BUY THIS CAMERA", "Date": "April 17, 2013"}, {"Title": "Setup was normal as with other Panasonic cameras", "Author": "TB", "ReviewID": "R13GBPCVCDZ4F9", "Overall": "4.0", "Content": "I order two units to add to my existing camera network. They were labled as NEW in the listing and on the receipt but the boxes were clearly opened and one box even had writting on it, like someone checked offeverything that was in the box. So hoping these are truely new and they will perform as well as my other Panasonic cameras.", "Date": "March 21, 2013"}, {"Title": "Great IP camera, strong WiFi, would like smtps support", "Author": "S. J. Luke", "ReviewID": "R1V1RDTKSJCG5P", "Overall": "3.0", "Content": "The WiFi on this camera connected at the very extreme range of my place's signal, farther from the repeater than my Laptop or phone connected.  Add the Ethernet connection and these cameras have been a reliably connected video stream source.Lot's of option to configure.  The setting app (a web application residing on the camera) would crash during configuration fairly regularly (-1 star), but the camera itself would still be functional - providing motion detection alerts and feeding the stream.  So risk is low (just annoying during initial configuration).The camera does not support secure email servers for sending alerts.  This can be worked around but the work around isn't pretty.  Since almost all email clients are secure now (and who wants one otherwise?) this is a must-implement feature in my mind (-1 more star).", "Date": "January 11, 2013"}, {"Title": "Great for home use", "Author": "Meredith M", "ReviewID": "R2L71X846Z84IB", "Overall": "5.0", "Content": "I bought this to keep an eye on my dog during the day, I simply did not believe my neighbors complaints. As long as you have a PC it's a great buy. (At time of purchase there was no Mac software.) The enclosed instructions made set-up very easy. I was up and running the evening I openned the package.It's also a tough little camera, I've knocked it off it's stand several times and it's stick working. I haven't permanently afixed it anywhere yet.It works better in a well lit location but the picture quality if fine for what it is.", "Date": "November 15, 2012"}, {"Title": "a11", "Author": "CNorth", "ReviewID": "R1KU5C4ZJ6R256", "Overall": "4.0", "Content": "Needed help setting it up, but when I finally had it up and running, it is the BEST camera for the money I ever had!", "Date": "July 10, 2012"}, {"Title": "My 3rd Panasonic C121A, works great", "Author": "Jaylady", "ReviewID": "R3NEHQIERCRG6W", "Overall": "4.0", "Content": "I now have 3 of these, and am very happy with them. Setup could be better, and the night images could be much better, but for what I need, they all 3 work great. I think if you spend a LOT more, you can get more features (pan & tilt, crisper images). But for the basics, these work for us. I like using the Panasonic iPhone app to view all 3 cams on my iPhone whenever I want.", "Date": "July 3, 2012"}, {"Title": "Great as a petcam... during daytime hours", "Author": "TQM", "ReviewID": "R1AR8T9TCKJKIR", "Overall": "4.0", "Content": "I purchased this camera to use as a petcam indoors while at work to keep an eye on our new puppy.  The video is pretty clear when on the home network and while watching from the internet.  The camera includes a motion sensor and microphone.  You can use the motion sensor to trigger notifications to you via email and/or to record a video for up to 10 seconds (the video is not emailed to you, just the notification).  The microphone works good, but you cannot hear the sound on the Iphone, which sucks, but this is not the camera's fault but Apple's.  What may be one of the camera's/server's fault is that I have not been able to get it to work on my Blackberry.  I keep getting a 403 error message when I try to load the page.  Then again, it could be my fault as I haven't researched the issue for a possible solution yet.  Regarding setup of the camera, it took some time, but I can't say that its really hard.  The part that took me the longest was to set up the email timer triggers: You can set it up so that the camera emails you a photo image every hour (other options are every second or every minute, no in-betweens).  For setting this up, you cannot use most free email services like Hotmail or Google, so we used our Verizon email account.  Verizon's web instructions to setup email software like Outlook was to use port 465, but it actually worked on port number 587 (took me all day to figure this out through lots of Google searching).  In the end, this was the setup that worked: \"SMTP Server IP Address or Host Name: outgoing.verizon.net\", \"Port No. 587\", then select \"SMTP authentication\" and enter your Verizon email user name (without the \"verizon.net\") and your password.  Once I got the right port number, the email feature is GREAT!  Now, even though I can't watch the video feed on my Blackberry, I receive photos every hour on my email.The biggest problem I have with this camera, and the reason I give it 4 stars and not 5 is that image quality severely diminishes when there is no natural light.  Come sunset, the image becomes very grainy.  I turned on all the lights in close vicinity of the camera, and still, the image is grainy and nothing like it is with natural light.  You can kinda still tell where the puppy is, but the image is very grainy.  In darkness, you cannot see anything at all.  I will try to post images of these, so you can see the difference between natural light, indoor lights, and darkness.Overall, I am happy with the camera but for the price, image quality should be better with indoor lights (it IS an indoor camera).", "Date": "June 29, 2012"}, {"Title": "Low cost, so-so performance", "Author": "Thomas K. Bagwell Jr. \"Tom Jr\"", "ReviewID": "RMUYBVHPEPVCK", "Overall": "3.0", "Content": "I wanted a low cost, entry level, IP camera and the Panasonic BL-C121A Wireless Network Camera seemed to fit my requirements.  My intent was to use the BL-C121A as a \"weather\" camera, mounting it indoors on a window sill, facing out.  The camera is inexpensive and has only moderate resolution.  It is fixed focal length and the depth of field  (aperture?) only has three settings: \"image clarity, normal and motion.\"  It has a built-in CPU running LINUX.  It does not have much horsepower and tends to time-out if I am in administrative mode when it starts an FTP upload.  It comes with a software bundle that is not particularly flexible - you can do 1 sec, 1 minute or hourly FTP uploads but nothing in between.  However you can also trigger FTP, email or SMS events using the motion detection feature, which I have no requirement to use at this time.  Some FTP sites require binary format but there is no provisions in the software to change for ASCII mode.  I did try a couple of other devices in this price range including a couple of Chinese knock-offs sourced from eBay.  All were lacking features or in the case of the knock-off just did not work out of the box.  The Panasonic BL-C121A Wireless Network Camera represented the best overall compromise in the price range.  I expect to upgrade to a more functional device in the future, otherwise, as I found out, you can do a lot worse if your budget is under $150.", "Date": "December 12, 2011"}, {"Title": "Excellent in its category; reception a little weak.", "Author": "Jimh615", "ReviewID": "R13US497P2YIUS", "Overall": "4.0", "Content": "I have 6 cameras at my house online watching my dogs when at work and out of the country.  2 are Panasonic.  I have a PC running Vista 64 bit.The BL-C121A is relatively easy to set up IF you understand how to get into your routers software.The Panasonic BL-C121A:1  Works flawlessly2  I have it in an ex-dog food container mounted to my roof overhang (picture included above) looking down on my dogs water supply.3  Although the camera has a digital telephoto feature; digital telephoto is NEVER any good!!!!  Pixels are enlarged but clarity rapidly suffers.4  At night you will need some lighting or the picture becomes ultra grainy.5  During the day it is clear enough to see the water ripple as the water streams into my dogs drinking bowl.6  Reception range is not as good as cheaper cameras that have been in the same housing over the years.  I have to specially orient my router to receive it, while other cameras which were far cheaper, placed twice as far away, have no problem with reception.7  Some features like zoom, WILL NOT work on Firefox 7 or Chrome, but worked fine on IE 9.8. The camera comes with recording software that allows manual or recordings based upon motion criteria9. The microphone is sensitive and very good.  Although in my installation, sound is not available on the recordings.10.  I have included a picture of the camera placement, in an converted dog food container.  Even though it is inside the container, sound is quality enough that you can clearly hear water from the faucet hitting the water in the pot.11. I have included a short video taken from this camera.It's very good in its category of an under $150 camera that is wireless.", "Date": "October 30, 2011"}, {"Title": "OK camera with some minor issues", "Author": "D. Khoo", "ReviewID": "R3FPHG7GJP8HGQ", "Overall": "3.0", "Content": "The camera's MJPEG and MPEG-4 video quality are decent to good.  The built-in web interface is pretty feature rich, though it doesn't matter much to me as I'm using a 3rd party app (Blue Iris) to monitor all my cams and manage recordings.  A couple of issues I'd like to note: 1) The microphone picks up way too much static.  2) The WIFI range isn't very good on this cam.  Probably because it lacks an external antenna?  I've got it in a location in my house where other devices are getting an uninterrupted WIFI signal, but the Panasonic Cam will occasionally go in and out.Update: I've read in a discussion forum that using the WIFI on a webcam introduces static in the audio.  I haven't tried hard wiring it to confirm this yet.", "Date": "September 25, 2011"}, {"Title": "Perfect as a baby cam", "Author": "Chris", "ReviewID": "RROCMQY9IEXPP", "Overall": "5.0", "Content": "I'm using this as an indoor baby cam and it's perfect! Streaming the audio and video to my handheld devices and I'm good to go. Also using netcamviewer for remote access is perfect.", "Date": "June 10, 2011"}, {"Title": "I like it", "Author": "Ken Adams", "ReviewID": "R1BWTIXOWR9COR", "Overall": "5.0", "Content": "Easy to set up, although had to use Windows for that.  It's been in use for over a year now (EvoCam on Mac OS X).  No issues at all.Update (Dec.2011): it's been almost two years since I bought the first camera.  I now own one more of the same model and another one outdoor.  Still no issues, very happy!Just noticed a question about the audio someone left ... I actually do not use it, nor motion detection.  Sorry, cannot comment on that.  I only use the cameras to monitor my kids when they play outside.", "Date": "June 2, 2011"}, {"Title": "Panasonic IP security cam", "Author": "John D. Clark", "ReviewID": "ROT7HU5XJL22O", "Overall": "5.0", "Content": "I have been in data communications for 25 years, 10 years working on IP stuff. Routers, switches that sort of thing. If you are not IP literate I would strongly suggest looking for a trained professional, or a precocious 13 year old to help you through the installation. It's not that installation is that difficult, but terminology will come to play. DNS, MAC Address, Net Mask, etc.. This is the alphabet soup that can make your eyes glaze, and cause you to go prematurely gray.As for the product concept I can only say that since it does exactly what I imagined we needed after my wife and I had our home broken into. It has a motion detector. It takes a picture when there is detected movement. Then emails, or FTP's it (your choice) to you. It must be brilliant. It is left to you the homeowner to decide if the dog got into the living room, or if there is something more nefarious afoot. You can also play voyeuer on hired help and such, or make sure the kids arent having a keger while you have dinner out. (As if they arent smart enough to put a photograph of the empty living room in front of the camera.)My real feelings for the product come from my experience with Panasonic tech support. I told the rep Richard Morgan I'd complement him. So there I did. Did I need help with the install? Of course not! But I did have a question regards SMTP service that dumbo carrier Verizon could not help with. Not ony was Verizon clueless they were surly about it.The best thing I can say about the product is that we need three more cameras. Despite the price they will all be the Panasonics.", "Date": "June 21, 2010"}, {"Title": "Software stinks.", "Author": "ERA", "ReviewID": "RF1HWZPGF5YS2", "Overall": "3.0", "Content": "I had very easy time setting up this camera for use on my local network.  It took about twenty minutes of following the instructions.  I haven't set the camera up for external IP viewing yet, but I haven't gotten a static IP for my router to do that.  The frame rate is really good regardless of the resolution, but the image quality is disappointing.  The sensor is extremely noisy which makes the picture very grainy indoors, I haven't tried outdoors in daylight yet.  Using the software the camera comes with makes the refresh rate take a dive, and the quality goes down too, but using the software seems to be the only way to get audio so far. Overall I'm really pleased with the refresh rate, and lag, but disappointed by the image graininess and the lack of audio in http mode.EDIT:  I played with the settings and found that the image graininess goes down to almost nothing if you turn down the brightness, and turn off the backlight option.  Audio is still a work in progress.", "Date": "April 13, 2011"}, {"Title": "Setup difficulty depends on your router", "Author": "Joseph T. Lillevig", "ReviewID": "R2SD4S9RMDLGDN", "Overall": "4.0", "Content": "It took me quite a while to get everything working (wireless and viewwebcam) that I needed.  The basic camera setup was not bad when doing the wired connection on my local network.  That's when the \"fun\" began.  The wireless difficulty mostly had to do with my uncertainty as to what needed to be put in on the camera woreless page.  I've setup several wireless devices but they have always found the network on their own and then I just had to enter the security code.  After I realized that the SSID had to match the name of my wireless router it all came together.  The viewwebcam issue was partly due to something called \"loopback\".  Apparently many routers do not allow you to do the external access through viewwebcam while connected (even wirelessly) to your local network.  Access from outside of my house worked fine.  The biggest difficulty was in understanding what I needed to do to get my router happy with external access.  There is something called uPnP and my router (Microsoft LN-700) has it always on.  That fact took a lot of web searching to find out.  I also dug enough to find that other users recommended disabling uPnP in the camera setup and just going with port forwarding setup.  New territory for me but eventually I got it correctly set in my router setup.  All-in-all a lot of work to get going but I got it cheap and it does what I want it to.", "Date": "April 3, 2011"}, {"Title": "Good camera for the money", "Author": "Monte", "ReviewID": "R1PHW3QSV8CEBC", "Overall": "4.0", "Content": "The GUI on the setup menus are a bit difficult to navigate, but otherwise, this is a great camera for the money. i can access from my droid or external PC's. It can upload images after motion is detected to ftp, email, or pics or video to local network storage. I may get a few more of these little guys.", "Date": "February 14, 2011"}, {"Title": "good camera, with nice features, not for low light conditions", "Author": "Michael", "ReviewID": "R2KA8RP1IOSML4", "Overall": "4.0", "Content": "good picture, nice quality, easy to install.  if your new to web cams as i was, you will probably need to call panasonic cust svc to help with router setup, but it was painless, and i learned how to setup dedicated ports and addresses to devices so they stay on my wireless network. i like the motion feature in which once it senses motion, you can set it up to send you an email with a pict of what caused the motion.  you can setup (free) a website to view this camera from any computer, even works on my iphone.  only one con: low light picture, well there isnt one, but if there is decent amt of light, pict is really good.", "Date": "February 5, 2011"}, {"Title": "Great Network Camera", "Author": "cobbikaze", "ReviewID": "R14TGLV9UFMRBL", "Overall": "5.0", "Content": "I installed 4 of these in our office to monitor the comings and goings of employees and others.  We previously had a laptop stolen so decided to monitor all of the doors.  I've worked with several wireless cameras - but Panasonic are great.  They cost more than other brands - but they seem more \"commercial\" than home type cameras.  I've had these cameras for about 6 months and they work great.  They have a good motion sensor as well as the ability to hard wire directly to a door (that is every time our front door is opened or closed - it snaps a series of clear pictures.  Also you can configure these to be able to connect to them right over the internet with free Panasonic software.  If you're looking for something better than a D-Link or Linksys network camera - this would be it.  I couldn't be happier and we haven't had anything stolen from our offices since installing them.  Note that these cameras have a fixed lens, which is what I wanted to monitor the doors.  I have also used the Pan and Tilt wireless Panasonic camera and that is also a fantastic product.", "Date": "January 13, 2011"}, {"Title": "A hint for Wireless Setup", "Author": "kwmcc", "ReviewID": "R20XPHXIR132IC", "Overall": "4.0", "Content": "One hint that I'd offer is that the WPA password does not appear to support spaces (blanks) in the password or pass-phrase.  My system's WPA password was a phrase, with spaces between words.  After several hours of troubleshooting, I determined that MAC filtering wasn't the cause (this device has two MAC addresses, something that the wireless configuration page tells you), that Static IP wasn't the cause (I was concerned that DD-WRT might have reserved address ranges for Wireless vs Wired), and that it connected when there was no security specified.  Having exhausted every other possibility, I tried changing the WPA passcode.  Bing, it worked immediately.", "Date": "December 20, 2010"}, {"Title": "nice camera", "Author": "islandgirl", "ReviewID": "R108GL5OGN8A6S", "Overall": "4.0", "Content": "I recieved the BL-C121A a couple of days ago. I have to say- much nicer than I expected. As others said, it was difficult to set up(I almost gave up),but I'm glad I didn't. I am using this wireless with my router from the next room now with no problem. And YES!- I transmit video to my Droid!!( I am using IP Cam Viewer app.) That was probably the easiest thing to set up out of everything(though not without some struggling as well). I am no techie, but I'm not a complete computer idiot, either. The picture I get on my Droid is even nicer than my pc image..go figure..Anyways, the picture in daylight is great (depending on where light is coming from and how much, you get some bright spots), low light is pretty good, too. Sound is good as well. I had it aimed out at the harbor in front of our house- color and picture were nice but not superfine detail for distance, which is to be expected for any camera in this price range. Only thing I wish I had was PTZ feature as camera is fixed, which I knew when buying, but this camera got pretty good reviews compared to others so I figured I could do without for now. Maybe I'll spring for more expensive Pana with PTZ next time. Great camera for the price. You will like it once you get through the frustration of setting it up. Would have maybe given 5 stars if easier to set up, better instructions, and PTZ option. Highly recommended.", "Date": "October 10, 2010"}, {"Title": "Excellent camera", "Author": "teacher22", "ReviewID": "R201SQKFWGPXZU", "Overall": "5.0", "Content": "I bought this camera not knowing what to expect, this is my first network camera of any kind. I found it very easy to install and set-up. The picture quality is great, even on my iphone. My primary purpose for this camera is to keep an eye on my dogs while I am away..I am very pleased with this purchase and would definitely recommend it to anyone!!", "Date": "August 9, 2010"}, {"Title": "Indoor Cam", "Author": "Higgbo911", "ReviewID": "R87EBCOK4J7GO", "Overall": "3.0", "Content": "I returned this cam because I wanted to use it on my front porch.  This cam does not operate in outdoor temperatures we have in Charlotte.  I do not remember the exact range, but anything below freezing would be an issue, I think.", "Date": "May 22, 2011"}, {"Title": "Beware ANTOnline", "Author": "LR", "ReviewID": "R1QL3E6TKSGBD0", "Overall": "1.0", "Content": "I am finally able to use this camera five months after purchased it at amazon.com, from seller ANTOnline; aka: Atlanta Network Technologies Inc locating in GA. The camera works fine, after I had to buy the power cord that was missing from its original package. The seller is the one you should avoid. After I got my nightmare shopping experience, I research the seller, and came across with some websites such as \"antonline sucks.com\". I list them at the end of this review for your reference.I don't want anyone experience the same nightmare as I did. You can learn from my experience, without the cost of your own time and money, if you want. Here is what happened, my worst shopping experience of all, online and in store.The camera was delivered on 12/03/2011. I bought it as a brand new item. The original package looks obviously old, cracked; and not sealed. See photo posted. The power cord was missing from the original package.On December 4th 2011, I requested return authorization from ANTOnline. They refused my return request, and did not email me Return Authorization. They emailed me saying I should contact Panasonic for the missing part. I contacted Panasonic, who explained to me: \"This seller is counting on our warranty policy.\" I see! Panasonic would send me a power cord for free, only if the original package was arrived as brand new and sealed, which was not the case.On December 4, 2011 I filed a claim at Amazon.com, but have not heard back from them. For years, every month I spend hundreds dollars on amazon.com, this is the first time I filed a claim.On December 8, 2011 I filed a charge dispute with my credit card company. After a month waiting (you see how this has screwed up my Christmas shopping plan), on January 9, 2012 I received a letter from my credit card company denying my inquiry; the reason is \"The merchant explained that they have not received the item back\". What?! ANTOnline has refused my return by not sending me Return Authorization, why would they expect me to send back the camera? Obviously, the seller had started a game.The original power cord would cost $41 @ panasonic.com, so I bought one from Radio shack, to make the camera work. It actually works! I know it's a Panasonic, a good brand; but since the camera was sold by ANTOnline, anything is possible.Here are some websites for your reference. You can also google \"ANTOnline review\" to get your own results.[...](there are 4 reviews on yelp.com, right below the second reviews, there are another 2 filtered reviews you can click on to read, one of them is from someone who used to work for this company)Amazon.com (click on \"see all feedback\" next to \"recent feedback\")Plenty of negative feedback, yet they still sell here.  I cannot agree more with Kevin P.'s feedback on Jan 6, 2012: \"Very deceptive practice...THIS COMPANY IS A SCAM\".", "Date": "March 20, 2012"}, {"Title": "Good but fixed lens!", "Author": "onederin", "ReviewID": "R2H6D3A6WJTJMF", "Overall": "4.0", "Content": "I ordered this an addition to a few Panasonics I already have. What was not clear is that this lens is fixed. It does not move up or down or pan. The Panasonic tech's I spoke were not aware of this and told me 1) I needed to re-install activex 2) the camera was defective. Both where wrong, so I wasted a lot of time and energy. Also it does not have a heat sensor, just motion and noise(my other cameres's don't have a noise sensor.)The camera itself is fine, just be aware of what you are getting. Also if you don't have a dvd player or are using a mac you can download the software from[...]", "Date": "November 7, 2010"}, {"Title": "Software for BL-C121A Network Camera", "Author": "DON", "ReviewID": "R3HZY806Q5L06I", "Overall": "3.0", "Content": "Haven't had a chance to setup the Network Camera yet as am away from home site at present. However, was disappointed that software enclosed with camera is for much older PC's. The CD installation disc does not say whether it will work with \"WINDOWS 7\" AND \"WINDOWS EXPLORER 9\" which I and most others have.", "Date": "August 31, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0027K2XSI"}}