{"Reviews": [{"Title": "So far I like it!!!", "Author": "N. Palmatier \"nikkole\"", "ReviewID": "R3JYO9MOWRFHU2", "Overall": "5.0", "Content": "I got this camera on HSN since they had a special on it for $220 (and broke it into 5 payments). I just got it and I have been playing around with it. The pics are great and it is very easy to use. Be aware it is NOT an slr camera but and SLR LIKE camera...same quality but easier to use. It also has some of the bells and whistles you would find on an slr that you just can't find on other point and shoot digital cameras. I am taking this camera to Spain next week so I will post my pics when I get back! :)As promised I am reporting back after my trip to Spain. The pics turned out GREAT!!! It was so easy to use and all the different settings are AWESOME! You just really need to read through the owners manual so you know exactly what you are doing! Once you know all the in and outs it is totally the best camera to take on vacation!!! 5 star rating from me!!!", "Date": "December 16, 2009"}, {"Title": "I am glad I won this camera", "Author": "Robert Connor \"CalBoomer\"", "ReviewID": "RN8WU08GXMX9V", "Overall": "5.0", "Content": "Sincerely, I am glad I own this camera. It was my first Fuji but will not be my last.It has outperformed all my expectations. I bought it from HSN and liked what I saw, but owning was an even bigger pleasure. Fuji has some newer cameras since this first came out and it shows how committed this company is to making great pictures. So far I  have taken close to 4,000 since November '09. My next camera will be a Fuji as well. I am stuck - either the HS10 or HS20. These beat Canon, Nikon, you name it on quality, durability and, heck yes, way better on priceFor a treat, go to youtube and catch the \"Fuji Guys\" - Good stuff there to learn !Since I published this I have taken another 3,000 pictures. Still works great and I must say I am not \"gentle\" when using it either. There are more cameras out there with more pixels and more features but nothing beats this \"machine\" !Now approaching 9000 pics and it I am not a good caretaker but this camera was built to be used!", "Date": "February 23, 2011"}, {"Title": "Wonderful camera", "Author": "Steven G. Berman \"Life Of Grace\"", "ReviewID": "R3F6OX6JYHUNE5", "Overall": "5.0", "Content": "This camera is about as good as an SLR. I bought it because the user reviews were good and I don't need a complex SLR and the camera has lived up to all of my expectations.", "Date": "August 28, 2010"}, {"Title": "Fuji S2100", "Author": "Amazon Customer \"Digital Shutter Bug\"", "ReviewID": "R17KW6KLEWZDKO", "Overall": "5.0", "Content": "I purchased this camera to upgrade my Fuji S5000 that I have had for 7 years. The S5000 is still going strong but I am not allowed to collect cameras (wife said so). I perchased the S2100 from another web site at a great price. It is east ro use since it is very simular to the othe fuji camera. This one doesn't have a panorama mode which I would like, but ithas all ot ehe other bells and whistles that I was looking for in a digital toy. This is an easy to use camera that if you are familar with Fuji is simple to adjust to. This is a great beginning camera as it is easy to learn on and is automatic if you don't want to do it yourself. If you are adventurous, you can get as fancy as  you want. I haven't used the video because I like the stills. I have a 16GB SDHC card in mine and I play hard with it. Depending on the features you are looking for, consider this camera.", "Date": "June 9, 2010"}, {"Title": "awesome, love it", "Author": "behelce \"princess\"", "ReviewID": "R1IFP47DDDDU4O", "Overall": "5.0", "Content": "i also bought this camera at HSN, and i'm in love with the camera. before i have ordered so many cameras from them but i had to return them all because they just don't take quality pictures. i wanted a camcomder so tried shoppping around jvc, olumpus, g&e; sonny and what else. i just wanted a camera which will take good videos and better pictures at same time, and i strongly recommend this slr style. so far no camera has been able to impress me except this one.  i have had it for almost a year now has never given me any problem. sound quality is great, and i mean great even in the bathroom, you could hear every splash of water. i didn't like the other cameras because of poor quality sound, but this one is superb. clear pictures even at the maximum zoom and grate videos. buy this camera and you will thank me you did. soooo easy to use, and exceeded all my expectations. during the winter, i took some videos and pictures of the snow through the glass window, because it's frozen outside i couldn't go out, but the pictures were so great as if they were close shoots. i'm planning buying one for my husband.", "Date": "June 9, 2010"}, {"Title": "fuji finepix s2100hd-10mp 15x zoom", "Author": "F. Rawling \"chump\"", "ReviewID": "R28TB2LPBC3UT", "Overall": "5.0", "Content": "Great camera and very easy to use I've had this camera for about a year now it can do everything, from great stills to video's its a camera that is light and you won't even know you even have it along, I've used it from shooting family to shooting bald eagles in flight. If you read the directions and more importantly experiment with the camera this is the only way you'll know what it can do. I have an slr and an array of lenses and I find myself bringing this camera out more often.  All in all very happy you get a lot for the money.", "Date": "June 29, 2010"}], "ProductInfo": {"Price": "$210.93", "Features": "Allow 15x zoom ups during your recordings.\nA function to follow moving subjects in standard wide view for easy framing at high zoom settings\nA 10.0-megapixel of high resolution can capture the world around in vivid color and lavish details", "Name": "Fujifilm S2100HD 10.0 Megapixel 15x Optical/5.1x Digital Zoom Dual IS (Image Stabilization) Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/31%2B1DtuprmL.jpg", "ProductID": "B002XXPK0C"}}