{"Reviews": [{"Title": "This is a great buy", "Author": "Just Gary", "ReviewID": "R5C4WBX6MSKA3", "Overall": "5.0", "Content": "UPDATE ON Aug 11, 2013: I have had these working for two years. I ended up buying four of them. I posted a picture of one working. One of them had an issue because it was too close to the dryer and would go off unexpectantly when I was drying clothes. For some reason moisture does affect a few, but not all, of these cameras. I ended up swapping it for one of the other detectors and had no issues with either when I did that. Other than that, they are working great with no issues. I have caught two contractors and a \"friend\" looking through drawers in my house. The \"friend\" actually took money out of my wallet while I was in another room. He isn't invited back any more but I never told him about the camera.The picture is great. The sound is so clear that my cat heard his own voice recording and went to the PC speakers to investigate. No one ever thinks that the smoke detectors are recording. Even the installers just thought it was a new type of central alarm system; you have to run the lines through the attic to a central location and I wasn't going to crawl up there in 100 degree weather. Well worth it.Remember that this is just a surveillance camera and you have to buy the DVR and connecting wires separately. Some people rated this bad because they thought it was a complete system, which it never claims to be.To answer some of the questions I have seen on here:1. This is a surveillance camera. It does not record. It does not have memory. It doesn't come with instructions because it is to be used with a surveillance system. It does not have an independent removeable battery. It needs a power source and needs to be connected to a system that is typically used for surveillance, like a 4-channel DVR. Power is usually supplied with those systems. This is basically an add-on.2. If it doesn't look like the picture shown on this page, return it. You got the wrong product.3. This gives a real crisp and clear picture when it gets plenty of light. It works in diim light but not in the dark. The less light, the less clarity.4. Finally, this does work as a smoke detector and no one looks at the smoke detectors. I have no idea why people think it is obvious as I bet you cannot describe your smoke detector. It has a hole (of course) but shows no sign of a camera. Only if you absolutely have seen one of these before would you know it is a surveillance camera.5. It takes some electronic know-how to hook up a security system so if you know nothing about electronics, seek professional help.ORIGINAL POST: I had bought another brand that was cheaper and I was unhappy. The other one was priced under $50 but did not have audio, was black and white, and was not a functioning smoke detector. If you looked at it, you can even spot the camera as it is not totally concealed.So, I decided to purchase this one because of the pic (yes I know that can be dangerous). Well, it looks exactly like the pic. The actually picture quality is really good and in color. The audio works perfectly. And it is a functioning fire alarm. There is no way anyone can tell it is a camera device.The only problem I had was that I gave it a little power to test the video, which activated it. So, when I take the power away, it beeps like it has a low battery. Very annoying when you are setting it up.I am buying a second one.", "Date": "July 23, 2011"}, {"Title": "Better than expected.", "Author": "John D. Grissom \"Cain\"", "ReviewID": "R2V38QGR72IEID", "Overall": "5.0", "Content": "I install business/home security cameras and I admit I was worried when I first saw the tiny pinhole. Most 1/3\" lens Sony cameras I install have a much larger lens. I thought there is NO way this is going to give the area of view my customer was looking for. I plugged the thing up to our \"in house\" DVR and wow was I surprised!! I held it high above my head as close to the ceiling as I could get and after seeing the viewing area, color quality and brightness, I could not wait to get it installed.We installed this in the customer’s house and after getting everything plugged in I was AGAIN amazed. Not only did it cover everything they wanted to see, the AUDIO reception (which I did not test before) was OUTSTANDING. We could hear their small dog drinking from its water dish from across the room as well as watch him doing it. ALSO, it really is a smoke alarm. It has a rechargeable battery that is recharged from the power supply. This is NOT a night vision camera. There has to be some light in the room. We installed two of these in the customer’s house; one in the kitchen where lighting was outstanding, this resulted in OUTSTANDING color and clarity. The second was in the living room where the lighting was dim (table lamp and television) and on a scale of 1 - 10 I would still give it a 5 or 6 simply because even though it has no infrared emitters it still produced a picture good enough you could tell what was going on in the room even in the dark corners.** NOTE ** This is a camera/smoke alarm that MUST be plugged in to a 12v power supply (not included) and either a DVR or something with video INPUTS. You will need to cut a nickel/quarter size hole in your ceiling to run the (not included) cables to a power supply and your video source.Pros:1.) Tiny pinhole that if you did not know it was there you would NEVER notice it.2.) 1/3\" SONY CCD Wide Angle Color lens which in my opinion for the size and money you can't beat.3.) REAL WORKING smoke alarm!!! The smoke detector has a rechargeable battery and really detects smoke! There is even a test button on it that when depressed emits a loud alarmCons:1.) This is in NO WAY a complaint. I'm just mentioning it so you know. NOT A NIGHT VISION CAMERA. For it to be \"Night Vision\" it would have to have infrared LED's and then (to some people) it would be obvious that it's a hidden camera. You defeat the purpose of \"hidden camera\" then. This camera needs a least a small lamp in the room to see.** NOTE ** This is a camera/smoke alarm that MUST be plugged in to a 12v power supply (not included) and either a DVR or something with video INPUTS. You will need to cut a nickel/quarter size hole in your ceiling to run the (not included) cables to a power supply and your video source.", "Date": "January 13, 2013"}, {"Title": "Pleasantly Surprised", "Author": "Robert M. Moore \"BMoore\"", "ReviewID": "R4IPTEOH0904F", "Overall": "5.0", "Content": "We have a dozen or so cameras (all exterior) located around the house and property, but due to how the front porch and door is recessed, it would have been nearly impossible to mount a dome or bullet camera to cover the front entrance without it sticking out like a sore thumb. I decided to mount an indoor camera to cover the front door and I installed this camera approximately 2 months ago. I wanted to try a concealed/covert style to avoid mounting an obvious dome or bullet, but must admit I fully expected the quality to be crappy because of the low price. I was wrong. This little camera not only blends in perfectly on the ceiling, the resolution is indistinguishable from 750 tvl cameras mounted outside. This camera does require more light to operate than our outdoor domes and bullets (when they are in color mode), but I don't need it to, nor would I really expect it to. I am extremely impressed with the quality of this camera and am amazed at the price. I strongly recommend this camera to anyone who needs an interior day only camera, but doesn't want to install an obvious camera. I should probably point out that I did not hook up the microphone, since I only needed the camera. Therefore I can't comment on how the audio works, but have no reason to think it wouldn't impress me just as the video has.Amended review on 9-2-2012:I have just installed a second one of these cameras in the office and experienced the same results. Once again, I'm very pleased. This is a very nice camera at a remarkable price.", "Date": "July 22, 2012"}, {"Title": "V. good quality", "Author": "Gaigemc", "ReviewID": "R3ETXVKMZ1SBFF", "Overall": "5.0", "Content": "Great item, gives a good, slightly fish eyed view. I needed it for a narrow entry and wanted to also cover a side door without setting the unit in the corner of the room. It worked perfect, giving view to both doors and most of the entry.", "Date": "October 16, 2011"}, {"Title": "Cool Camera", "Author": "EP", "ReviewID": "R302VAKJRCG37O", "Overall": "5.0", "Content": "These cameras worked great. Clear video and audio and you can't even tell its a camera. Looks like any other smoke detector. Easy to install.", "Date": "May 25, 2012"}, {"Title": "Good camera", "Author": "D. Perry Jr.", "ReviewID": "R8DR97OHJL0TE", "Overall": "4.0", "Content": "Installed this in a friends living room who was having trouble with money disappering from her purse. Got the colprate the first night. Picture quality is excellent in good light. Decent in low light.", "Date": "October 23, 2012"}, {"Title": "Really works", "Author": "tiff_tiff_tiff", "ReviewID": "R89C6RVDCVCUL", "Overall": "5.0", "Content": "This thing is awesome. It works really well, is easy to setup. It looks real (and is a functioning smoke detector). It even has audio. The video and audio quality are both very good. Sometimes the little red light flashes on it, not sure what that is about. It also beeps when the power is disconnected (or during a power outage) which is annoying. But overall this was an excellent buy.", "Date": "March 25, 2012"}, {"Title": "super", "Author": "christopher serrnat", "ReviewID": "R19NU0A2DX40RL", "Overall": "5.0", "Content": "This item works as it said. Very happy with video quality during the day. Would be great if had night vision also but understand it would stick out at night with ir leds. LOL", "Date": "February 24, 2013"}, {"Title": "Cheap and possibly dangerous", "Author": "Brice", "ReviewID": "RPHV7GKOC85S1", "Overall": "2.0", "Content": "This is a potentially dangerous product because it is being labeled as a \"functional\" smoke alarm.  I have only been able to get the camera to function.  I have NOT been able to successfully test the smoke alarm function.  After completely installing this product in my ceiling I have been able to successfully initiate the camera function.  Unfortunately the \"SMOKE ALARM\" feature is DOA.  Dead on arrival.  The red light illuminates and blinks as if it is functioning.  The button right next to the instructions to \"test weekly\" does not perform any function at all.  I pushed the button.  I pushed and held down the button.  I repeatedly pushed and then held the button.  Nothing happens.  The red light continues to blink.The next test that I performed was with burning matches.  The smoke and suit from the matches was not efficient to set off the smoke alarm either.  I tried multiple matches as well as burning paper.  Nothing worked.The smoke alarm is DOA.Unfortunately I had ordered a second one before I realized that the first one was crap.  When the second one arrives I will test it as well.Oh.  As a bonus to my negative review this device is a \"hard wired device\" only yet it doesn't come with a power cord or an A/C adaptor.  That requires an additional purchase.This is bordering on ridiculous.Be careful.", "Date": "July 23, 2012"}, {"Title": "eyespy", "Author": "pitterpat", "ReviewID": "RARZUBXPMQS5A", "Overall": "5.0", "Content": "An easy camera to install great picture quality and well made a good camera for the dollar. Would buy another in the future", "Date": "September 8, 2011"}, {"Title": "pretty good camera, i only wish you can tilt the camera position", "Author": "Henry", "ReviewID": "R1BG8J65A1U5HZ", "Overall": "4.0", "Content": "i installed one in the living room and one in the kitchen, my house has a low ceiling, if i can only tilt the position of the camera higher it would've been a perfect product, the camera pointed a little low for houses with low ceilings.", "Date": "March 18, 2013"}, {"Title": "Good Camera", "Author": "Billy Hebert", "ReviewID": "R1XPR7VYL3YU8Q", "Overall": "5.0", "Content": "I bought the camera to watch over wife's jewlery. Wanted something that people wouldn't know was there. This fit the bill great and works good.", "Date": "January 19, 2012"}, {"Title": "Returned this Item", "Author": "G. Brevard \"Hiking\"", "ReviewID": "RS51USMH46HL4", "Overall": "4.0", "Content": "I ordered this device for an older home. I misunderstood how this device would function. It requires wiring through walls and attachment to a DVD player. I did not want to pay for deconstruction and repairs to the home for the installation of this item.  However, if you are building a home or already have a security system installed and want hidden security cameras, consider this product. I returned this product with no problems.", "Date": "May 13, 2012"}, {"Title": "No manual in shipment, manual link online doesn't work.", "Author": "Michael Fumento", "ReviewID": "R17VBU2Q3KSJGE", "Overall": "1.0", "Content": "It says \"Does not come with a built-in DVR. Not a wireless product.\" Also does not come with manual, at least mine didn't. And it's hardly intuitive. I don't know how to work it. So I went to the company Website where there was a link to download the manual. Doesn't work.We're not off to a great start with this product.Update:I contacted customer service, which sent me what's purported to be a user's manual. It's not. It's a list of contents with an image. There is NOTHING explaining how to wire the system. I'm sure it's \"intuitive\" to them, it's THEIR system. It's probably intuitive to some buyers. But I'm a smart guy and it's hardly intuitive to me. I have no idea how to wire this thing. And so far the Web searching I've done, which I shouldn't have to do, has turned up nothing but reviews. Very disappointing.", "Date": "February 20, 2013"}, {"Title": "Low Quality", "Author": "Floater", "ReviewID": "R310BGBNY914F4", "Overall": "2.0", "Content": "Camera works ok but after about 30 days the smoke alarm became very sensitive to humidity changes and would go off in the morning when the heat would come on. Then it started going off at random times for no apparent reason. As it was right outside of 30 days I'm hoping Amazon will send me a replacement as there is no way to contact the manufacturer.", "Date": "April 16, 2013"}, {"Title": "Great camera for the Price", "Author": "keith", "ReviewID": "RYHHO2LHZQS01", "Overall": "5.0", "Content": "very good picture, while being descreet, could not even tell there was a camera there, now can watch house while on vacatio", "Date": "December 17, 2012"}, {"Title": "Actual product differs greatly from photo", "Author": "TG", "ReviewID": "RZ211D7SK5B52", "Overall": "1.0", "Content": "I didn't even install these to check them out.  I opened the package up and found a very cheap and obvious product with deep scratches over the face of it.  The camera is fairly obvious too.  The smoke detector was supposed to be white but what i got was a beige with brown almost burn looking markings all over it.  The shape and design is completely different from what is in the photo as well.", "Date": "February 27, 2013"}, {"Title": "Junk,", "Author": "Ianp", "ReviewID": "R2W51YQLJYG9BZ", "Overall": "1.0", "Content": "I have a gas stove installed in my basement.  using this product, I thought I could check  if folks using the basement remembered to turn the heat off by seeing it with the added benefit of of having a functional smoke detector.  Well, the instructions showed how to open it.  I tried to open it to install THE BATTERY! and broke it.  The model they sent me, does not open,,,  ( why have instructions on how to open it if there is no reason to do so!!)  SINCE it has no battery back-up.  HEY CHINA,,  We have batteries in our smoke detectors here in the USA, since often during a smokey event, the power goes off..  The power for everything is 12VDC and of course, there is no power supply with it.  Other than that, it is cheap white plastic and worth about $8 as a camera.  Amazon,  I am disappointed !!", "Date": "March 12, 2013"}, {"Title": "Good idea but bad image", "Author": "bobmannn", "ReviewID": "RYMX240VX9X7G", "Overall": "3.0", "Content": "This product is a good idea, in that no one will suspect that this is a camera. Even though there is a small black dot on the outside (the lens) I am confident that no one suspects that this is a camera.The only issue I have is the image. It is really grainy and noisy with interfereance lines. You can still make out an image, but it is just really bad when compared to the other 7 cameras on my system. I have several of those cameras hidden inside a fake motion detector case that look to use the same CCD camera guts, and they all look much better than this one. I am sure that the cable and hookup is good, as I can put a different camera in place of this one and the image is just fine, so I am confident that there is something wrong with the camera itself or the way it is designed.Unfortunately, I was not able to hook this up until after the return window had closed or else I would have returned this; unfortunately I have to live with it now.", "Date": "October 2, 2012"}, {"Title": "beep beep beep", "Author": "marco", "ReviewID": "R1WOR7AZ4KK0R4", "Overall": "5.0", "Content": "video looks great and no one suspects a thing. thats the best part of it. keeping eye on employees is a plus without them knowing. great product", "Date": "September 21, 2012"}, {"Title": "Camera.mount", "Author": "Bob M.", "ReviewID": "R18D2BNJHOIAS2", "Overall": "2.0", "Content": "I was not very happy with the positioning of the camera mounted inside the smoke detector. It is no reflection on the seller at all, as the delivery and packaging was fine. It's just that for my application, the camera was mounted 90 degrees out of place, and when I tried to change myself (obviously I knew this would void the warranty and I was taking a chance), the camera stopped working and changed the output to just streaks.", "Date": "January 9, 2014"}, {"Title": "perfect to spy inside home", "Author": "alexander lavin", "ReviewID": "R20M5HWKAGOTFA", "Overall": "5.0", "Content": "i recommend no to use if u dont wanna know what you might surprise to find .lolit might like or no.lol", "Date": "January 4, 2014"}, {"Title": "Great image quality, poor distance", "Author": "Aaron", "ReviewID": "RRKS0Z0K9N2PP", "Overall": "4.0", "Content": "Very good product here. Pricey, but the image quality is pretty good. If you have a light that shines right into the camera, it ends up compensating very poorly and you lose a lot of detail. It's discreet, but a few \"tells.\" Can't detach the smoke detector part from the base and does not have a fake battery cover either. Also comes with 3 screw holes in the base for mounting. Has the regular \"do not paint\" and other disclaimers you would see on a detector. Signals when you press the Test button, but haven't tested with real smoke/fire.Image quality is very impressive if you've got the right lighting. You'll need an adapter for the Video cord, but that wasn't more than a couple dollars. Audio quality is ok, I picked a lot of white noise. I'm happy with the viewing angle as well. Good product.", "Date": "October 16, 2013"}, {"Title": "Better than I hoped", "Author": "CDR", "ReviewID": "R3TH4WJLGCJG22", "Overall": "4.0", "Content": "This thing looks good (would never know it has camera) and works well. It is a smoke detector also & beeps if power source is removed. Video quality is better than I expected. You cannot adjust direction of lens, so I mounted it just slightly tilted in the rear. Low light images are quite poor ;( and in complete darkness it only shows black. I have tried many things to improve on this. I bought 2 cheap IR lamps & they did nothing. Not sure if they were the wrong frequency or if this camera doesnt \"see\" IR lights. I bought a bunch of nite-lights and they didnt help much either. Overall I am pleased with this unit & would recommend if you are planning to use a DVR and you don't need very dark recording.", "Date": "August 29, 2013"}, {"Title": "Good camera for the price", "Author": "Shihan \"Dennis\"", "ReviewID": "R1XNWLVL5XB1IW", "Overall": "4.0", "Content": "This camera is pretty good for the price and type of camera.  The video (for the lack of a better word) is a bit \"coarse\".  Tried to adjust the contrast via the DVR, but was unable to \"smooth it out\".  That said, I really liked this camera with it's true smoke detector appearance and acceptable video.  I purchased two of these for one of my clients and they are happy with it also.  If I ever need a \"smoke detector/camera\" again, I will probably order this one.", "Date": "August 5, 2013"}, {"Title": "Good picture", "Author": "lbayers", "ReviewID": "R3OWM264JNXJV8", "Overall": "5.0", "Content": "These cameras have a lot better picture than you think they would.  I did have trouble with one out of four having audio issues, but they replaced the camera and all is well and my customer is happy with the covert cameras.", "Date": "July 3, 2013"}, {"Title": "smoke detector", "Author": "sc", "ReviewID": "R25JHGA6G6WS5", "Overall": "5.0", "Content": "great service. I love my new camara, it works perfect. would recommend this merchangt to any one!!! i would definitely do business with them again.thanks", "Date": "April 3, 2012"}, {"Title": "Good quality image, not a believable smoke detector.", "Author": "Bryce", "ReviewID": "R3NHER29TBN1TI", "Overall": "2.0", "Content": "This works well I guess as a camera. It doesn't look like the one in the picture. It does NOT have a 9V battery compartment and has 3 screws that are visible on the base plate when it is attached to the ceiling. Also, you can totally see the lens of the camera.", "Date": "January 23, 2013"}, {"Title": "The eye catcher", "Author": "manny", "ReviewID": "R1AL6AANZ8326I", "Overall": "5.0", "Content": "This really is a good buy  I cought a few people steeling  now people call me for security cameras so I buy the stuff they look for", "Date": "July 11, 2013"}, {"Title": "Horrible Product...Horrible SELLER", "Author": "Romiesha Tucker", "ReviewID": "R98LIFBUP3VYS", "Overall": "1.0", "Content": "I purchased this because someone had been breaking into my apartment and I was trying to catch them in the act. This product is not discrete at all. So I tried contacting the seller several times to return it. The seller never responed and I was out of $60. The thing is still sitting in my trunk. It was of no use to me and I would never buy from this seller again.", "Date": "April 14, 2013"}, {"Title": ":( Really doesn't need to be better user friendly, no clear instruction take it seriously.", "Author": "Client", "ReviewID": "R2EMT0RE2QR88B", "Overall": "2.0", "Content": "I had read the reviews and I am in agreement with those that mention that this product for the price is devoid of precise instructions.  Actually, I will change the rating from 3 stars to 2 stars. For the novice this comes with a 16' cord tor possibly connect to perhaps a dvr and it is a female 3 connector. You will need to go to radio shack or if you are astute you will be fine. But, I am dissappointed that it is not very user friendly.  It is hard plastic and maybe it has a battery in it but I don't know, yet. I have packed it away.", "Date": "May 30, 2013"}, {"Title": "NOT RECOMNDED", "Author": "hasiba", "ReviewID": "R3GCOR2UVVVK3Y", "Overall": "1.0", "Content": "THE CAMERA IS NOT GOODNOT WORKINGIS NOT THE SAME FEATURE WHEN YOU BOUHGHT ITI WANT NO REFUND I JUST DUMP IT", "Date": "January 18, 2013"}, {"Title": "if your looking for covert this is as low key as you can get", "Author": "joseph kuzma", "ReviewID": "R3CFSJTNI7VT4Y", "Overall": "4.0", "Content": "great idea for covert.  looks and acts like a smoke detector.  my customer loves it, rating actually dropped a point cause i have to have so many words on this review to submit.  i do rate it a 5 though", "Date": "November 6, 2013"}, {"Title": "Save Money or pay more $$ on something else", "Author": "Mindy", "ReviewID": "RI884WTLYTTPE", "Overall": "1.0", "Content": "You have to install and run line into you wall for this to work, I am not a wireing person, so I have to return all of it, I am now going to order something that cost a little more that I do not have to install and run wires all over my home.", "Date": "October 7, 2011"}, {"Title": "Smoke Detector Camera", "Author": "Tina", "ReviewID": "RUFZBTTPQO9OU", "Overall": "4.0", "Content": "I'm a female and will be setting up the smoke detector myself. Is it easy to set up or will I need help?", "Date": "May 6, 2013"}, {"Title": "hate it", "Author": "Cynthia Nix", "ReviewID": "R3AQHGN0WK190H", "Overall": "1.0", "Content": "This did not come with instructions and apperently needs other parts for it to work....because I was not aware of this it has not been installed and my house was broken into. If I had it installed I would of been able to see who did it. I do not recommend this product", "Date": "November 27, 2012"}], "ProductInfo": {"Price": "$61.34", "Features": "Does not come with a built-in DVR. Not a wireless product\nSONY Color CCD Image Sensor\nPicture Elements: NTSC: 512 H x 492 V - PAL: 512 H x 582 V\nHorizontal Resolution: 470 TVLines ; Minimum Illumination: 0.1 Lux\nHorizontal Sync Frequency: NTSC: 15.734 KHZ - PAL: 15.625 KHZ ; Vertical Frequency: NTSC: 60 HZ - PAL: 50 HZ\nClock frequency: NTSC: 19.0699 MHZ - PAL: 18.9375 MHZ ; Lens: 3.7mm Pinhole Lens", "Name": "COP USA SDR35 Functional Smoke Detector Covert Color Camera, SONY CCD 470TVL 0.1Lux 3.7mm Pinhole Lens DC12V 150mA", "ImgURL": "http://ecx.images-amazon.com/images/I/31zn2fh%2BLvL._SX300_.jpg", "ProductID": "B002KPTVLW"}}