{"Reviews": [{"Title": "Amazing camera", "Author": "Peto", "ReviewID": "R3TZMWSFD2EQTB", "Overall": "5.0", "Content": "The BeachCamera sent the camera kit promptly! I ordered this kit because of the same reasons as the first review and it was even cheaper than S90 alone on amazon. The items in the kit doesn't look much of high quality, but I can't be more than happier with getting all these goodies for free - especially the SD! Anyway, the most important is the camera, which is AWESOOOOME! It is truly amazing. I had Sony Cybershot W150 before this one and the quality of pictures you can take with this one is unbeliavable - 1000x times better than with the Cybershot. There is almost no noise at all and they are so clear. The colors are also captured very nicely. Although it is an easy to use camera, it does provide some manual options if you want. If you don't want DLSR and still want a perfect camera you can't pick a better one than Canon S90!", "Date": "February 1, 2010"}, {"Title": "Great service, great camera, OK kit!", "Author": "A. Acker", "ReviewID": "RHCZTUHWNWAWR", "Overall": "5.0", "Content": "OK, so i decided on the S90 over the G11 for the features, size and quality and was going to pull the trigger on the camera but then I saw this kit. All these items for the same price as the camera? Well, it sounded too good to be true so I figured even if they were all junk, they were FREE. So, I ordered it and are all OK with the exception of the case -- it's way too big and doesn't fit the camera so I'm going to give it to my daughter. The card and the rest of the stuff are all no name so I expect it to fail at some point soon. Or not?Also, Beach Camera delivered it fast. And since I live in NY there's no tax too. I love NY!So, all in all, 6 stars (if I could) for the camera and 5 stars for Beach Camera.", "Date": "January 13, 2010"}, {"Title": "Superlative little Gem", "Author": "Mark Twain \"Sam\" \"book maven\"", "ReviewID": "R3EJ65AD03G05Z", "Overall": "5.0", "Content": "I already have two point and shoots (both Samsung, both good--have actually sold photos to publishers from them), have a nice bridge camera (Olympus) and a good SLR (Nikon), didn't really need another P&S; but bought this Canon S-90 anyway, don't know why, maybe it was its RAW and low light capabilities, or that it was a Canon, not sure but I'm glad I did. Ease of use, functionality, picture quality are outstanding. As soon as you take it out of the box and hold it, you feel quality. Its diminutive size is such a benefit in that you can put in in your pocket and barely feel it yet know that you've got within quick and easy reach a refined and capable photographic device, one which will dazzle the amateur and please the professional.", "Date": "July 14, 2010"}, {"Title": "needs view finder", "Author": "byrdedoc", "ReviewID": "R3SYE0UNI6S2T2", "Overall": "4.0", "Content": "Love this little camera.  Does everything it says in the other reviews and product specs.  What is needed is to bring back the ability to look through the view finder instead of the LCD screen.  In bright daylight, it is difficult to see the image you are trying to capture.  I understand the new cameras are going to screen only.  I think this is a mistake.", "Date": "July 11, 2010"}, {"Title": "great point and shoot", "Author": "J. Burns", "ReviewID": "R1FNOS641D8S40", "Overall": "5.0", "Content": "I've been searching for a small digital camera that didn't have too much of a lag time when taking a picture. This camera is it! Very easy to use.", "Date": "May 9, 2010"}, {"Title": "superb camera", "Author": "Jack West", "ReviewID": "R34DDAYIARZ5I", "Overall": "5.0", "Content": "the best of the smaller cameras out there now - just check out the spects on this little well made gem.", "Date": "January 31, 2010"}, {"Title": "Awesome Camera & Service", "Author": "R. Hillman \"Life learner\"", "ReviewID": "R51J3N5UA3Z7D", "Overall": "5.0", "Content": "Love, love, love this camera.  After testing it in different modes, I found that it could handle any kind of light, shaky handling, and action shots.  Solid feel, huge 3\" viewfinder, and long battery life--though I always buy a spare battery to have in the case.  An excellent manual, rechargeable battery, and recharger are all included.  I did a LOT of research before buying this camera to replace my previous Canon Powershot S45, and have not regretted this purchase.  It has been 9 months now, and we are very happy with it.  We are fans of the Powershot S-series cameras; our S45 performed excellently for over 6 years.  IMHO, this is BEST compact digital you can currently buy (well, possibly the S95 is as good).  Furthermore, Beach Camera was quick in delivering a perfect camera at an excellent price.  We will do business with them again.", "Date": "October 1, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002P56P84"}}